[{"comment_id":"10153590637376336","commenter_b":"Nuclear is clean efficient and it's a country's pride! Do you know ordinary Iranians are really nice folks?","commenter_a":"Boy this Iran sure wants nuke power really bad, but what I don't understand is why they need nuke power to light up clay homes in the desert. Does anyone else see a different picture? America used wind, coal, steam as a first time power source.","post_message":"Iran will reportedly be allowed to use its own experts to inspect a site it allegedly used to develop nuclear arms under a secret agreement with the International Atomic Energy Agency."},{"comment_id":"10153275307228132","commenter_b":"You're a total dick!!!","commenter_a":"Junkie","post_message":"\"So funny, honest and loving. We lost a great one today.\""},{"comment_id":"902473139819442","commenter_b":"Even woodpeckers for fucks sake. If they're damaging your house, or your property, guess what, you can shoot it","commenter_a":"Bring back fox hunting - look at the state of this fox -","post_message":"Fox Busted In The Hen House Literally!"},{"comment_id":"10153653127786336","commenter_b":"Obama should be deported with all of the illegals...","commenter_a":"make me sick","post_message":"\"The Obama administration is very friendly to individuals who are transgendered who are illegal immigrants. They provide them taxpayer-funded hormone treatments [and] special accommodations.\" – Tom Fitton, president of Judicial Watch, Inc."},{"comment_id":"10155997067345354","commenter_b":"Hopefully, Palin and her Carnival Midway Freaks family will return to obscurity soon. Surely she's spent all the money she collected for running for political office by now.","commenter_a":"China is killing us just like Donald Trump said, and our country's leaders do act like that are stupid who are only interested in staying in their cushy jobs in Washington DC, and who keep lying to the American people about race, gender. And all the other social things that will distract the American people from really noticing that your country's Government is crashing our country's economy. And that the media is playing hand and glove along with the Washington DC establishment of both political Parties. Because the media likes their cushy jobs also, and really don't want to change how our country is run, for no reason. So we the American people Ladies and Gentlemen were always on our own and we just never realized how bad these guys were, and simply trusted in the wrong people. Who would believe that all three branches of our country Government Institutions ...","post_message":"“It is such a sham business. This BS of them touting all the medical services they provide women and the free healthcare–They don’t provide all these services.\""},{"comment_id":"10155292076102501","commenter_b":"can't we keep her out of this state somehow? I tihnk every time I see her kids commercial how many unborn infants have died because of her support for abortion. Protect kids? Get serious lieing Hillary","commenter_a":". --------------------------------------------------------------------- HILLARY - BREAKING THE GLASS CEILING? --------------------------------------------------------------------- Mrs. Clinton, how can I possibly tell my daughter to follow you as an example after you allowed your husband to assault and demean multiple women throughout his political career? Were those women not important? Tell me, will you fight for my rights like you fought for those womens? Ummmm, I hope not. What about the sisterhood, Mrs. Clinton? Did you expose your husband for his abuse? No! Instead, you enabled him as the abuser and tried to silence his victims. How can you live with yourself? Female empowerment? ......... Nice try!","post_message":"Hillary is coming back."},{"comment_id":"10153531348054740","commenter_b":"I agree you shouldnt have to justify.","commenter_a":"It is sad that so many don't know the difference between real life and tv.....","post_message":"Here's why cops don't 'shoot to injure':"}]
