[{"comment_id":"1234949299869862","commenter_b":"Really irritate me how she copies her speech","commenter_a":"Better to repeat the inteligent words of an inteligent woman, than stupid words of a stupid husband! Since an empty head isn't capable of producing words of her own!","post_message":"Listen to Melania Trump's speech last night vs. Michelle Obama's speech in 2008 @webpagelink"},{"comment_id":"10155029420463690","commenter_b":"Because women are more corrupt than men","commenter_a":"First Brazil female president now Argentina. Jealousy men and women hounding women for things they continue to let men get away with. Same with Imelda and Gloria from the Philipines and current S. Korea, India's Sonia Ghandhi, liberia's grandmother, Pakistan Benezir Bhutto female presidents/PM etc!","post_message":"Cristina Fernandez Kirchner, the former Argentine president, has been charged in a corruption case and slapped with a $630m asset freeze over public tenders awarded to a businessman friend during her administration."},{"comment_id":"466533816861832","commenter_b":"I don't know why this is article has been shared today, because it will just upset people on a Holiday and just continues to widen the divide between the people. Because we are celebrating our country, our history, and the couragous people who protect our freedom, it seems a little rude and inconsiderate to share this message. And furthermore, I do not believe the data report anymore than I can throw a cow. I believe most of us are equal in how patriotic we are or not.","commenter_a":"Conservatives only THINK they are more patriotic. Why? God, guns and gays......","post_message":"Is this poll right?"},{"comment_id":"10153952706726323","commenter_b":"Show the UK the door Lol! We want out and you to go home.","commenter_a":"7 years in England and I have never met an English person that defined themselves as European, British when they want to show how broad their borders can be. We don't even share the same values, we interpret our history in a completely different way. They made of us a 'Brand', neglecting our own background, dignity, honesty, skills, and so on... unless you speak as they do, or you are a CEO,CFO, any kind of abbreviation really will do...only then you will be treated nearly as an equal. Dear Europe, do not succumb to this hypocrisy and show them the door.","post_message":"'I have negotiated a deal to give the UK special status in the EU. I will be recommending it to cabinet tomorrow'"},{"comment_id":"10153594366538352","commenter_b":"Kiss my black ass old lady!","commenter_a":"Wait let me get this straight well never mind because I know if he was black it would've been reported when he took a crayon from school because that's how deep they dig! #BlackManCantFartWithoutBeingCalledAnAnimal","post_message":"Biker killed in Waco shoot-out was a law-abiding decorated Vietnam veteran with Purple Heart, records reveal – despite police claims that all 9 dead were criminals"},{"comment_id":"1146806995375828","commenter_b":"Only lesbians are voting Hillary","commenter_a":"#Hilary said she going to let her husband run the economy.... Way to go #feminists set back 50 years in one sentence...epic fail #TRUMP2016 pls share","post_message":"We just won Kentucky! Thank you to everyone who turned out. We’re always stronger when we’re united. hrc.io/1WDpty0"},{"comment_id":"524012904454471","commenter_b":"Like fuck she will. We need to get so fucking loud they hear us in China. WE DON'T WANT ANYMORE OF THESE SOULLESS SHITHEADS IN OUR COUNTRY. This all part of the goatloverocrats plan to divide us more. We have got to stop this.","commenter_a":"We should have them settle right next door to her house in upstate NY","post_message":"Voters are outraged by this.  How does this benefit and protect Americans?"}]
