[{"comment_id":"1162468617182722","commenter_b":"The magic number is 2026, half of 4051 . Bernie gets to that number the superdelegates have to support him.","commenter_a":"Bernie could win every state from here on out and Hilary would still be leading in the polls and delegate count. ..","post_message":"Hillary Clinton's margin narrows to just 6 points over rival Bernie Sanders."},{"comment_id":"10153847085126162","commenter_b":"Girl stfu ^^^ u dumb. That's not y.","commenter_a":"As long as her son has a decnt funeral, I dont judge her for using donations for what she needed besides funeral expenses. If it was enough for her to buy a house out of the hood Im sure she would have done that too! If she is partying and gloating about thats not cool. But a scandal after tour the death is kind of hard to deal with so...i cast no judgement.","post_message":"9-year-old Tyshawn Lee's mom is accused of spending money donated for her son's funeral expenses on a new car. FULL STORY: @webpagelink"},{"comment_id":"10154620951999714","commenter_b":"Phelps and Beyonce can go both choke on razor blades.","commenter_a":"And more","post_message":"Beyoncé, Britney Spears, Rihanna, Michael Phelps and more! #VMAs2016"},{"comment_id":"10153438772266051","commenter_b":"Ignorant bitch.","commenter_a":"Grow up you spoiled brat.","post_message":"It's easy to see why this encounter between a woman going through the McDonald's drive-thru and an employee has gone viral."},{"comment_id":"10154204530456037","commenter_b":"Pussy","commenter_a":"Muslim obama has destroy the military.","post_message":"The accused spy, Lieutenant Commander Edward Chieh-Liang Lin, has been in the Navy since 1999 and has won several awards, including two Navy/Marine Corps Commendation Medals."},{"comment_id":"1146391592075725","commenter_b":"ANOTHER RACIST TO PODIUM","commenter_a":"Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry","post_message":"LIVE: Presidential Nominee Donald J. Trump is in Warren to speak to supporters just 8 days before election day. More info: bit.ly/TrumpvisitsMCC"},{"comment_id":"1077005215689340","commenter_b":"Hillary is an establishment hoe","commenter_a":"She is the most qualified candidate in this race. I strongly believe, Life will be better with @username. <3 #imwithher #weareforher #Hillary2016 #feelthehill #yeshill","post_message":"Anyone asking for your vote has to grapple with the reality of inequality in America—and offer real plans to fix it."}]
