[{"comment_id":"10153736602849749","commenter_b":"@username - Why does Europe have to take these refugees? So many are military aged men. Why aren't they staying in their country and fighting to save it? Militant Islam is dangerous whether you agree to it or not. Letting these people into your country will diminish your country because these people will demand that you accommodate their religion and their way of life instead of them making an adjustment because they are guests. They will demand changes in established laws because they will not conform. These are not bigoted statements. These are facts that are easily verified.","commenter_a":"Why do militant atheists support the arrival of (militant?) Islam into Germany?","post_message":"German police spray left-wing protesters with a water cannon to keep them apart from an anti-Islam demonstration. See more: @webpagelink"},{"comment_id":"10152822886591130","commenter_b":"SHE* isn't 'dressed up as a woman. She is a fucking woman.","commenter_a":"Hold on a minute here, it's make your mind up here time fella/gal or whatever make & model you wake up wanting to be today as others (me) do mind where you take a piss as kids use these toilets and we need to protect from people who don't even know what sex they are from one toilet visit to the next !!!","post_message":"\"How we go about our business is none of yours.\""},{"comment_id":"981667418562042","commenter_b":"CNN commies hiding the truth and denighing the facts.","commenter_a":"Lemon is such a a a I can't find an insulting enough word. Help!","post_message":"VIDEO: CNN Instantly Ends Segment When Pro-Trump Latina Says This About Donald @webpagelink"},{"comment_id":"10152988203790861","commenter_b":"You act like kids don't figure stuff out.","commenter_a":"I can just see a kid planning it out to steal the gun and shoot up the classroom.","post_message":"A Texas school district wants to allow teachers to carry guns in the classroom. Tell us what you think about arming teachers."},{"comment_id":"1121161091293379","commenter_b":"I thought she was 100","commenter_a":"Nick Foley @username @username bruh.. lol this is about to be mom","post_message":"A man named Sidomejo from Indonesia has documents that claim he was born in 1870 – which may mean he is 146 years old."},{"comment_id":"10152925468786680","commenter_b":"Love is no ones business but the two who found it's bliss.","commenter_a":"Well, you could always just ignore it. Our government seems to be doing that alot lately. Like DC ignoring the Heller case.","post_message":"“It seems like the oppressor is now taking on the mentality of the oppressed.”"},{"comment_id":"1205288416198545","commenter_b":"in tears watching this. God keep him with you and give the family strength and patience to heal.","commenter_a":"Priceless....God bless this little tyke and his family and friends..","post_message":"WATCH: 6-year-old boy killed in SC school shooting laid to rest dressed as Batman at superhero-themed funeral: @webpagelink"}]
