[{"comment_id":"10154402963106729","commenter_b":"and..... Beyonce needs to get the hell out of the United States of America!...","commenter_a":"Our police are just doing their job and taking out the trash.","post_message":"Everyone needs to see what he sent Obama...POWERFUL."},{"comment_id":"10154088028351159","commenter_b":"I wouldn't trust her to clean my toilets !","commenter_a":"The same thing she did with Benghazi!","post_message":"In case you missed it..."},{"comment_id":"627551517435427","commenter_b":"Big mouth cow","commenter_a":"So we'll give her grandmother a free drink.","post_message":"This entitled woman just demanded a free drink... Because of slavery?  This is absolutely ridiculous. We owe her nothing.  Should she be compensated for slavery?"},{"comment_id":"10154040095578701","commenter_b":"Build that wall","commenter_a":"Juan Wheeler","post_message":"Oregon State Police say a traffic stop on Highway 97 in Sherman County led to the seizure of $2.3 million worth of meth and cocaine."},{"comment_id":"980308098739718","commenter_b":"Who in the hell watches Cnn anyways. Tell that bitch to go to there country and try an speak her mind they will cut her head off. Hopefully.","commenter_a":"More Leftist Fuckers !","post_message":"Alisyn Camerota is the CNN hack who cross-examined me after the jihad attack on our Garland free speech event, as if it had been my fault that we were fired upon by Muslims. So it is no surprise that she is calling on Americans to be sharia-compliant."},{"comment_id":"1743445975938698","commenter_b":"Devil at work.","commenter_a":"we should not remove any thing if they don't want to come to come our churches let them go back to there country where they can do as they please..","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More ‘Comfortable’.  America was founded on Christianity!  Do you think this is ridiculous?"},{"comment_id":"1009683892433898","commenter_b":"ILLEGAL ALIENS should be deported not given drivers licenses and free housing and medical care.","commenter_a":"Why don't you add the rest of the story. Not only did 50% of all California driver's licenses go to illegal aliens, but they have motor voter laws so those illegals are now eligible to vote even though they are not citizens. Non-citizen should NEVER be allowed to vote and neither should welfare recipients who have been on welfare for more than two years. They should not be allowed to vote on how the money from tax payers is spent when they are not paying taxes themselves.","post_message":"Did you know HALF of all California driver’s licenses issued in 2015 went to illegal aliens?"}]
