[{"comment_id":"964070213702162","commenter_b":"She is dumb as a fox! Crooked doesnt require brains! Just dishonesty!","commenter_a":"Ha! Ha! Poor Hilary Rotten Clinton!","post_message":"Does anyone know that Crooked Hillary, who tried so hard, was unable to pass the Bar Exams in Washington D.C. She was forced to go elsewhere!"},{"comment_id":"10152964045994753","commenter_b":"I must be living wrong, that bitch","commenter_a":"This is in England so who cares","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"415787422087411","commenter_b":"Many more American waiting for jobs now, so if your illegal, then bye, bye. If your immigrants better get back to work, that is what you came to America for.","commenter_a":"Carol Johnson","post_message":"#DayWithoutImmigrants: Immigrants across the country are expected to stay home from school and work today to show how critical they are to the U.S. economy and way of life."},{"comment_id":"10156266292905294","commenter_b":"He was white u racist b*tch","commenter_a":"Probably some ghetto trash. Where is Obama when blacks rob??? Where is he?","post_message":"The Papa John's Pizza regional manager said a man entered the store with a gun and demanded money. A chase began shortly after:"},{"comment_id":"729302233879236","commenter_b":"@username No, she is insane and a danger to others.","commenter_a":"Dreadlocks existed in Scandinavian, Mediterranean, and Middle Eastern cultures as well. Also, does this make it permissible to confront black women who have straightened or relaxed hair for taking white people's culture? No?","post_message":"\"You're saying that I can't have a hair style because of your culture? Why?\" the man said. \"Because it's my culture,\" the woman said."},{"comment_id":"10153136004245090","commenter_b":"She's an idiot","commenter_a":"She is a liar, sneaky, underhanded, untrustworthy and she needs to answer for Benghazi and the killing of those four innocent men. I hold her and Obama responsible. Would never want someone like this as President.","post_message":"Bottom line: Why don't you want Hillary Clinton to be President? Sound off here: @webpagelink"},{"comment_id":"1513285485378585","commenter_b":"Mmmmmmmhm! I noticed that. Pussy","commenter_a":"How true","post_message":""}]
