[{"comment_id":"10153225018458352","commenter_b":"Shut yo strong African ass up","commenter_a":"Stevie Ray Dirt this going to be me if you don't hurry tf up ! lmfao jk","post_message":"Strong Black Woman Marries HERSELF Cause She Couldn’t Find A Husband (True Story)"},{"comment_id":"10153692556453984","commenter_b":"Had she told the tuth to begin with she probably would be our next pres!!!","commenter_a":"Absolutely","post_message":"Looks like Hillary Clinton just got another piece of bad news, and it's from one of her least-favorite people. 'Bulldog' Gowdy is hot on the trail! Do you support Trey Gowdy's fight to hold Hillary accountable?"},{"comment_id":"10154826794495673","commenter_b":"@username is the picture of white privilege. Southern white belle. She was raised that way. She can't help it that she was taught to not think for herself and be afraid of being touched by a black person.","commenter_a":"HELL NO!!! This black racist woman is a poor excuse as a human being, she would only use and abuse the American people just as her failure of a husband did. No more Obama's or Clinton's should be allowed near The White House!!","post_message":"Do you think Michelle Obama could make a good president some day?"},{"comment_id":"1245131405583109","commenter_b":"Hillary said she carries hot sauce with her to pander to blacks and said they are predators. New leaked emails said that democrats were making fun of black women names. Yep that's what the democrats think about you. You have been played","commenter_a":"all he really concentrated on is how the speakers totally dogged him out....lol...I loved it but thats all he heard...he didnt hear them talk about Isis...he didnt see them bring up 4 star generals..he didnt hear a thing about what Kareem Abdul- Jabbar said...he didnt see the father of a Muslim man who fought and was killed while serving in our armed forces...he didnt hear them address Black Lives Matter and the Police...he didnt hear them talk about our criminal justice system...so t makes me wonder what convention was he watching..","post_message":"\"They're not talking about radical Islamic terrorism. They're not talking about borders where people just pour across. They're not talking about the crime,\" - Donald J. Trump"},{"comment_id":"621998441316699","commenter_b":"Sadly many get all their\"information\" from the globalist owned main Street media........the sheep are being led to slaughter!!!!!!","commenter_a":"The problem is, NO BODY WHO SUPPORTS HILLARY CARES!!! The amount of hard evidence, current criminal offenses is mind boggling... but her supporters just don't care... she shouldn't even be allowed to run...","post_message":"Uh oh..."},{"comment_id":"582726195242593","commenter_b":"Omg seems that all woman are becoming liars now ^ smh^ unbelievable","commenter_a":"There are two women Trump doesn't want to tangle with. Elizabeth Warren has forgotten more about economics than he ever knew. And Hillary's foreign policy knowledge is something he will never acquire. She will decimate him in a debate because he will have to be ready to speak on issues, not just make personal attacks. He is so thin skinned that he will self destruct as soon as she holds his feet to the fire. He and his followers don't have a clue. They have demonstrated time and again that when all else fails, thuggery rules. That doesn't win elections once reasonable people make up their minds not to put up with it any more. Now I just hope that reasonable people do that sooner than later. Put him out of his misery as quickly as possible.","post_message":"He's got a problem."},{"comment_id":"10153278015134575","commenter_b":":) Exactly","commenter_a":"If you're going to do BUSINESS in a free society that is supposed to separate religious beliefs from law of the land then we must require you to be tolerant & serve anyone & everyone who walks through your doors. (Remember? Separation of church & state? One of our country's founding principles?) Besides-supporting intolerance & bigotry is an abuse of the word Christian. Jesus would not turn anyone away.","post_message":"\"If a gay couple was to come and they wanted us to bring pizzas to their wedding, we'd have to say no.\" An Indiana pizzeria finds itself at the center of the debate over the state's religious freedom law."}]
