[{"comment_id":"10154773205966037","commenter_b":"Hillary is the liar and murderer deserves to be in prison right now!","commenter_a":"SHUT UP TRUMP","post_message":"WATCH LIVE: Donald J. Trump holds a rally following last night's debate and says he will totally accept results 'if I win.'"},{"comment_id":"617790755078170","commenter_b":"She a geto gutter hoe send her back","commenter_a":"I agree with Brooks.And Steven Joseph Sr.God bless that soldier .And thank you for your service","post_message":"Michelle Obama wanted this army staff sergeant to do this, but he refused.  This is amazing. We stand behind this soldier 100%.  Do you support this war hero stand against Michelle?"},{"comment_id":"10155438408395354","commenter_b":"If she had a brain, she would be dangerous","commenter_a":"she can also take credit for being a slut.","post_message":"'sooooo bad a$$ Senator Cottons voicemail box is fulllllllllll!'  ....we didn't forget the apostrophe, Miley did."},{"comment_id":"1583910615243254","commenter_b":"She's worth no comment","commenter_a":"Illuminate","post_message":"VIDEO! Cops are being slaughtered since Beyonce's Racist anti-cop performance. In 8 days 8 cops were murdered, and many more shot!  SHARE THIS EVERYWHERE!"},{"comment_id":"10153530679413984","commenter_b":"I hope she gets jail time!","commenter_a":"Some beasty mom will kick her face in I'm sure. As a Juvinal little will happen to her in our current legal system.","post_message":"The extremely disturbing video of a young girl brutally attacking a schoolmate who was holding a small child went viral, now the attacker is facing some serious consequences...  Are you hoping justice is served?"},{"comment_id":"10153412977987293","commenter_b":"Racist white lady alert","commenter_a":"I've never seen or heard of another president blamed for more things out of their control.","post_message":"It's not like he keeps a dais parked in front of the desk all the time."},{"comment_id":"10153491435486880","commenter_b":"Wal-Mart will fall fast, probably years from now when 'Fresh' is in Full Force! @webpagelink","commenter_a":"Cj Gennaro","post_message":"Amazon.com had a really good day."}]
