[{"comment_id":"10153319908498352","commenter_b":"And we know she sell pussy how??","commenter_a":"So she's gonna stop posting pics of her kid!?? How about stop posting pics of your ass.... Bash is better off with his daddy","post_message":"Amber Rose Responds To Wiz Khalifa Saying She Has A Dirty House & Baby Bash Birthday Issues"},{"comment_id":"10153270058159497","commenter_b":"We are all snacks, can't we get along?","commenter_a":"Oh SO SNACKS DON'T HAVE THE RIGHT TO DEFEND THEMSELVES?","post_message":"From our sister publication, ClickHole:"},{"comment_id":"10155218538748690","commenter_b":"Hahahaha hahahaha hahahaha hahahaha UAE seeks to kick out all Pakistani expatriates and destroy CPEC by 2018 but inshallah we Pakistani will not succeed them in thier nefarious purposes. No voice for Manmyar, Kashmir, Palistine, Syria, Iraq, Libya, Afghanistan, and Chachniya etc. Make your own home first then think about mars.","commenter_a":"He who controls the Spice controls the universe!","post_message":"\"The landing of people on other planets has been a longtime dream for humans. Our aim is that the UAE will spearhead international efforts to make this dream a reality.\" @webpagelink"},{"comment_id":"10153158704481770","commenter_b":"Someone should tell her that it has been done and she needs a new demon.","commenter_a":"When ever a candidate has nothing good to offer they bash the other party. The Butcher of Benghazi has nothing to offer, but more lies and death!","post_message":"Hillary Clinton was asked by Miss America's Outstanding Teen 2016 what she would do as president to fix our national debt but instead of offering a solution, Clinton criticized George W. Bush."},{"comment_id":"10154477709641729","commenter_b":"True","commenter_a":"Hillary is power hungry and Bernie is actually a communist . Both don't care about the American people.","post_message":"They'd best heed the writing on the wall."},{"comment_id":"1085989268155126","commenter_b":"How old is this beech? She sound ignorant dumb and stupid. U need to stay off the coke white girl!","commenter_a":"Send her back to the bunny Farm.....she's useless....","post_message":"Tomi Lahren says #BlackLivesMatter is the new KKK."},{"comment_id":"910206839098639","commenter_b":"How is this funny, what an ignorant woman!!","commenter_a":"Sarah Silverman is a moron who needs to go back to school and learn what the real Hitler was all about.","post_message":"Was this a good idea?"}]
