[{"comment_id":"1393322447348037","commenter_b":"NEVER Hillary!","commenter_a":"Petulant child is what Cruz is. Anyone who still endorses Cruz endorses Hillary Clinton!","post_message":"Comparing the print version of Ted Cruz's RNC speech to the rendition that got him booed off stage really does prove it's all in the delivery."},{"comment_id":"1781827275423105","commenter_b":"Go Hillary! You're a rock star!","commenter_a":"Boom!! Mic drop!!","post_message":"EXACTLY! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153356243998908","commenter_b":"I'm sure American Indians don't want those free loaders here either, even legal immigrants who did the hard work to become citizens don't want them here. We need a real President who has the guts to deport these leeches.","commenter_a":"We need a man like him in office now. He deported millions of illegals, he was a great President, unlike our current one.","post_message":"Collective Evolution \"In the councils of government, we must guard against the acquisition of unwarranted influence, whether sought or unsought, by the military industrial complex. The potential for a disastrous rise of misplaced power exists, and will persist.\" - President Eisenhower."},{"comment_id":"10154532453451051","commenter_b":"@username, do you kiss your boyfriend with that mouth?","commenter_a":"You're goddamn right I do. Hope he cracks down on the obstructionist Dems swiftly, and mercilessly, and for those who will inevitably say \"Oh, but the GOP were nothing but obstructionist with Obama! Buhuhuhu.\" To that I say: Elections are a game of King of the Hill, we now have the Hill and soon all 3 branches of Government. I'm not gonna entertain that \"moral high ground\" game, no, this is strategic warfare plain and simple, and we have the strategical advantages.","post_message":"Do you support Jeff Sessions as attorney general?"},{"comment_id":"10153505584229705","commenter_b":"Martin Besson","commenter_a":"Fatima Tanner Daniel Robson these hotels!!","post_message":"So bizarre!"},{"comment_id":"1086347321421796","commenter_b":"Oh my, kicking out the Black Lives Matter people AGAIN during your Atlanta, GA rally. Second time in how many days, Shill? Awww, she loves the Blacks, she sure does, except for when they might just question her. @webpagelink","commenter_a":"I was one of them too! Now I'm a 29 year old man and I'm voting for Hillary!! You had our back and now we have yours!!","post_message":"Eight million kids have healthier lives and brighter futures thanks to the Children’s Health Insurance Program. Connar is one of them."},{"comment_id":"1042921652395512","commenter_b":"Clams don't eat salt. That's its foot anyway.","commenter_a":"Now who wants to lick salt off a clam","post_message":"It's easy to forget that shellfish are animals ... until you see something like this."}]
