[{"comment_id":"839844146064134","commenter_b":"Women want it all, money,, looks, and a man who does everything right?, that has made me want all the same from a woman, sO far no luck, it's not a hero juzca person who shows love everyday, in everyway and a REAL woman not a Queen to appreciate it!","commenter_a":"If only we were all blessed with that. He's a hero plus a husband who gets it!!","post_message":"SO SWEET! The way to a man's heart may be his stomach, but one devoted husband has proven that women's love can come from a man who can"},{"comment_id":"807700012661940","commenter_b":"But she did. Shouldn't no one not have to go anywhere because fools can't handle their jobs.","commenter_a":"She should have never went to TX in the first place TX is not place for decent law abiding people as we see what happened to her over a signal change, TX is a rebel state always has been that way, and their federal support for programs should be stopped right away. Any kind of support needs to be stopped and let them people that love that place pay for their own social ills then see how they like that","post_message":"'How did switching lanes turn into all of this?'"},{"comment_id":"10153880714231509","commenter_b":"It's her baby. If she says no then it's human trafficking.","commenter_a":"It's HER baby. Period. And the father and her can share it.","post_message":"Should the surrogate mother be able to keep her? This baby's future is now in the hands of the courts: @webpagelink"},{"comment_id":"10154098589214753","commenter_b":"She could be doing a whole lot worse,she is doing what she wants before going to collage,seems like a good idea to me .She may not be so inclined to act foolish when she gets there and will take her studies more seriously.Enjoy your year off","commenter_a":"Wow! This is not news...who cares?","post_message":"Malia Obama has been embroiled in a pot smoking scandal after footage was released of her smoking at the Lollapalooza music festival in late July. The first daughter opted to attend the Chicago event instead of joining her parents for the Democratic National Convention in Philadelphia. It was a decision that led to big headlines for all of the wrong reasons. Images of Malia twerking and partying it up were posted online. It wasn’t just her wild behavior that got attention, but who she was... @webpagelink"},{"comment_id":"10154292047384877","commenter_b":"She out here looking like Nick now","commenter_a":"Wait so you can demand money for a breakup now?? I must have missed that memo, lol","post_message":"Mariah Carey also took to Instagram to confirm the split and her break-up hashtag game is brutal."},{"comment_id":"904971426268782","commenter_b":"If they are illegels they can't vote cause they,are not citizens","commenter_a":"They most definitely, without a shadow of a doubt should not now or ever be able to vote! ONLY citizens of these great United States of America have the honor and privilege to vote in elections! Period! End of story!","post_message":"Last I checked illegal means illegal and you have no rights in America!"},{"comment_id":"10152570108341770","commenter_b":"She's not upset about the coat, it's that her father is a turd and her mother is a pig.","commenter_a":"I guess so","post_message":"What do you expect when you dress your toddler in a $3,500 fur coat, Kim Kardashian?"}]
