[{"comment_id":"10152889447368837","commenter_b":"How about sending your black people to Africa forever ever, so they don't rob, kill , root and continue destroying this country!","commenter_a":"Since the US is working with Cuba, the government needs to eliminate the wet foot dry foot policy. Make sure any Cuban who comes here get citizenship so they can pay taxes versus living here off the grid and sending monies home to screw up the Social Security, retirement and Medicare funded programs built for Americans in this country. Black White Hispanic Asian Haitian alike.","post_message":"Dangerous Voyage."},{"comment_id":"10156088559505294","commenter_b":"In my opinion, the collarbone issue and sleeveless tops or dresses are a bit over the top. The women in most offices I've worked at wore sleeveless dresses and tops that were tasteful and appropriate. Even the women news anchors wear tasteful sleeveless outfits. I don't see a problem with that. I do however agree a dress code should be in place for kids in school. When they get out in the real world, there are rules, and they have to be followed. 48-50 years ago, we had to wear skirts or dresses that touched the floor if kneeled down. If it didn't touch the floor, we had to change. The guys had to wear belts. If they didn't have a belt, they had to pay 50 cents for a piece of masking tape with the word belt on it and tape it to their pants, and they better have ...","commenter_a":"I say all schools should have a dress code and make sure all students adhere to it. It teaches them to accept things in life their not happy about, but rules must be followed.","post_message":"It's back to school time, and we're hearing more stories about dress code violations. Students at one school in Chicago are protesting a rule that they wear only shirts and dresses with sleeves.   Click below for more, and tell us: Are dress codes these days fair? Unfair? Do they go too far?"},{"comment_id":"10154170271666337","commenter_b":"Umm I'm no Chris brown fan but I never heard of this chick till earlier this week. Last time I checked Chris had what people would call a very successful career and continues to make and sell records. Although I do feel for her... Life should never come to a point you need to attempt to end it.","commenter_a":"Um yes Chris Brown (nobody, singer ,wash up, hasbeen dumbass) there is a thing as attempted suicide....someone who did it and survived has ...guesss what 'ATTEMPTED TO KILL THEMSELVES' you fucking ignorant talentless piece of shit","post_message":"Now Chris Brown has joined the ugly Kyrie Irving-Kehlani-PARTYNEXTDOOR situation..."},{"comment_id":"921271484601636","commenter_b":"she spends our tax dollars on all kinds of expensive garbage. the woman needs a clue. race is not the issue. her habits are.","commenter_a":"And didn't they take her law degree away from her? And he apparently didn't even pass the bar exam.","post_message":"Everyone is racist at me!!  Michelle Obama whiny, self-centered commencement speech  @webpagelink"},{"comment_id":"893708487388873","commenter_b":"Barbara can't you see what this Idiot is doing to this country?","commenter_a":"I agree. It makes no difference to me if a Republican or Democrat occupies the White House. This HATRED for this PRESIDENT is appalling. In their HATRED they are destroying America! But they're too ignorant to realize it!!","post_message":"Too true.  Image by Occupy Democrats."},{"comment_id":"10152814272036973","commenter_b":"Dogs hurt others to protect themselves, their pack, or their belongings out of instinct. Humans have the ability to think before they hurt others, yet they still choose to do it. This is why I care about animals more than most people.","commenter_a":"To bad people don't care bout homeless people as much as they care about dogs. Smh","post_message":"Every day, on average, three dog bites serious enough to break this skin are reported to authorities in the Portland area. In round numbers that's roughly 1,000 people injured annually."},{"comment_id":"10154283827397014","commenter_b":"Milita Military Milita Military those two words don't sound the same","commenter_a":"A collection of dudes with short man complex playing army man and pretending to be 'patriots'....awwwwwww, you guys run along and have fun now, don't get anyone or yourselves killed","post_message":"The group said they'll vow to protect the Second Amendment, even under Trump."}]
