[{"comment_id":"1026765060695063","commenter_b":"I'd whip her so hard she could only us that middle finger to rub her sore butt.","commenter_a":"No presents .........","post_message":"Utterly hilarious 10-year old drama! [Read below]"},{"comment_id":"10153725721616770","commenter_b":"Donald is getting rid of illegal immigrants That doesn't belong in America","commenter_a":"Judy white your are a Democratic like them ripping the people of America no jobs Don't you know that God got Donald trump's back Revelation 18 the fall of Babylon and all trades deals .if Hillery Clinton knew god maybe she would be president But she hates god . remember god is greater.any humans On earth no one can overcome what god Has planned can try .","post_message":"New pro-amnesty campaign manager for Donald J. Trump says \"deportation force\" now \"TBD\""},{"comment_id":"10153095086985496","commenter_b":"I ain't never seen a man look like her from the neck down. Really???","commenter_a":"Just don't get how people beating the crap out of each is a sport and other makes them role models, I always taught my kids not to fight.","post_message":"The reaction may surprise you (then again, it might not): @webpagelink"},{"comment_id":"10154937035987235","commenter_b":"go fuck yourself","commenter_a":"Obama Regime is displaying a rare determination to start WW3 before they are ejected from office. Welcome to the new cold war sponsored by peace loving progressive (communist/fascist) liberal globalist Democrats! It's strange to be watching such open minded and tolerant and peace-loving progressives suddenly try and act all hawkish and aggressive and neocon-like by trying to start 3rd world war with Russia. Nice work! Barack Obama and the Democrats are bad losers!","post_message":"\"I could never look myself in the mirror again with self respect.”"},{"comment_id":"1263026913766051","commenter_b":"You lady are a idiot","commenter_a":"That's the problem. You all look to Facebook for your answers instead of doing your own research and being free thinkers.","post_message":"This is the video we've all been waiting for. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153848630809411","commenter_b":"About time someone stands against the crooked cops","commenter_a":"My wish is that these imagrants won their battle and that they rule in Europe as it were Europes wish that they rule in my country. :) Now its your turn.","post_message":"'Like a war'"},{"comment_id":"10153829501651337","commenter_b":"Humanity","commenter_a":"The amount of non judgmental compassionate comments on here is truly staggering","post_message":"HE'S KNOWN HOW LONG? Here's Charlie Sheen's HIV announcement..."}]
