[{"comment_id":"10153188794046680","commenter_b":"And @username get that male organ out of your mouth.","commenter_a":"@username just how would have more gun control laws have prevented this last shooting? California has already the most stringent gun control laws on the books.","post_message":"A day after the shooting massacre in California, Republican presidential contenders were utterly unapologetic about their opposition to new gun-control laws."},{"comment_id":"1127007594082684","commenter_b":"Hell yes, round em up & send em back in those pink boxers.","commenter_a":"HE 's the best man for the job","post_message":"ClashDaily.com"},{"comment_id":"10157481563535354","commenter_b":"Silly Rabbit illegals can't and most don't want to vote or do anything to bring attention to themselves....try again!","commenter_a":"Did anyone else notice that Bill Clinton basically told illegal aliens to vote for Hillary in his speech?","post_message":"Bill Clinton's Big Bomb of a #DNC Speech was SO bad, Even Progressive MSNBC Host Rachel Maddow is TRASHING it... WATCH:"},{"comment_id":"812675022209688","commenter_b":"@username, she should have been in jail a long time ago!!","commenter_a":"We need Trump 100%. Clinton is going to do nothing new for the @username people","post_message":"She disagreed with Donald Trump's proposal."},{"comment_id":"1837423903207723","commenter_b":"She speaks in a strange language called hooking and whoring.","commenter_a":"Jackie Kennedy: BA in Arts Hilary Clinton: graduate Yale Law Michelle Obama: graduate Harvard law Laura Bush: degree in eduction, Masters in library science Pat Nixon: worked odd jobs to put herself through college including sweeping the floor of a bank! Graduated with the equivalent of a masters degree from the University of Southern Cali. Lady Bid Johnson: BA in journalism from the university of Texas Nancy Raegan: drama and English major graduate of Smith Melania Trump: college dropout. Model, married her sugar daddy, excuses his misogyny as \"boys will be boys\" lies on command. I don't care if she's posed nude so long as she has integrity. If she's honest. If she's got a mind of her own. But she doesn't. And that's a problem. Yep. Awesome role model. AWESOME. 🙄 #GiveMeABreak","post_message":"Liberal or conservative, misogyny is misogyny."},{"comment_id":"10153609424211130","commenter_b":"Does she have penis yet?","commenter_a":"No one likes the murdering bitch... she is no friend of the LGBT and most us want her to go away.","post_message":"Caitlyn Jenner has a clever idea for how to beat Ricky Gervais at his own game."},{"comment_id":"10155037125378459","commenter_b":"Hey the angry ex wife is back!!!!!","commenter_a":"You know when there is a big headline telling you the absolute truth about anything on social media that you are in for a load of bullshit.","post_message":"The Truth About Oprah Winfrey Oprah Winfrey meets in secret with THE MOST evil men and women in the world every year and is given talking points to push on her audience..."}]
