[{"comment_id":"494885290693351","commenter_b":"Say what you will, but she has the right to stick with her belief.","commenter_a":"For one, she's not crazy, for two, Congress has to pass the laws,and no law was passed for her to grant marriage licenses to gays. Gods law, IS LAW","post_message":"One side has got to give in. Right?"},{"comment_id":"10154715866881077","commenter_b":"A real woman would provide a chicken pot pie, just saying...","commenter_a":"Kiss my what? Real women can provide their own and don't need any man. After all, I have done just fine on my own with my 2 special needs children (because their father wasn't any sort of real man: his moto provide, but beat and refuse basic needs or the right for me to work) That being said real men and woman work together to get through life together. Men nor women are above one another. This billboard only assists in the purpose of one being better than the other and undermine equality, which we have been fighting so hard for.","post_message":"What do you think about this billboard?"},{"comment_id":"10153282671259087","commenter_b":"@username We, obviously, are not idiots. Kinda shows with other comments. I have a fgreat idea, let's let all the illegals move in with you. Open your arms, and say welcome!!!!!","commenter_a":"Facts that can't be argued about Donald Trump. The man has been under attack since the day he announced. He has exposed how special interest groups, lobbyists and campaign donations corrupt our government admitting he himself has purchased favors. He has exposed media to be the bias self-serving thing they are. We've seen that he is right. Trump has told us what needs to happen to turn this country around. It's the cold hard truth. Trump has spent decades negotiating billion dollar deals with the toughest business minds on the planet and come out on top huge. Bankruptcy? Never has Trump gone bankrupt. He has over decades purchased failing businesses and used bankruptcy laws to restructure those and prevented those from failing. But 4 out of hundreds? Let's say 100. That is a 96% success rate. What experience does he have? He has dealt with politicians, world leaders and perfected ...","post_message":"“If anyone else was in Trump’s position they’d be viewed as the inevitable nominee,” said one former Reagan administration official who supports Donald J. Trump. “I have never seen a group of people so obtuse as to what is going on outside of Washington that they feel comfortable writing Trump off. They’re finally just now coming to the realization that he’s going to win.”"},{"comment_id":"10153010796814586","commenter_b":"Stop the dog slaughter. Stop killing,our animals. MONSTERS!!!","commenter_a":"Sigurd Rognan","post_message":"Dogs are speaking out for their friends being KILLED FOR LEATHER in China & sold all over the world. SHARE if you never WEAR your BEST FRIEND! JOIN THE MOVEMENT: @webpagelink #DogLeather [By posting your photo on Facebook, tagging PETA & using the hashtag #DogLeather, you are acknowledging that you have read & agree to our terms of submission: @webpagelink"},{"comment_id":"560508577442430","commenter_b":"No, illegal immigrants might think it's OK, like they already do from FD up thinking.. Our economy isn't built to give, give, give to u and the illegals. So yeah, they should go back to mexico, duhhh.","commenter_a":"Ur working at a fn hotel of course there's no job security. Fn fools.. smh. Don't like ur current situation? Gtf off ur ass n change it stop waiting for someone else's hands out!! That's ppls problem now days, want everything handed to u without doing a fn thing to deserve it.","post_message":"\"How do I feel working for Trump? I'm an immigrant. It's a job...We don't have security.\""},{"comment_id":"10154489395427439","commenter_b":"Ritual genital cutting is wrong regardless of sex.","commenter_a":"Barbaric people. Wouldn't expect anything less from this death cult.","post_message":"The gruesome practice of female genital mutilation is at record highs in America due to the influx of Muslim immigrants. FGM is found only within and adjacent to Muslim communities. The fact is that Muhammad justified it: “A woman used to perform circumcision in Medina. Muhammad said, \"Do not cut severely as that is better for a woman and more desirable for a husband.” (Sunan Abu Dawud 41.5251)."},{"comment_id":"10153792298068271","commenter_b":"The ignorance of those bottom feeding illegals is who are to go, or die. We are not talking of the folks here legally. Your ignorance is proven. No more handouts! !!!!! Work, or die. I approved this message. If you are illegal then get out now! !!!!! Or you might have to go the hard way. LOL. Lock N Load, Simper-FY! !!!! Burn the Mexican flag, you are either a American or your not. If you carry that fag, Ops, I meant Mexican flag, you should be returned to that filth country right away.","commenter_a":"According to the United States Census Bureau \" By the year 2050 (which is not that far off) one in every three Americans will be Hispanic \"legal and illegal, The Trump family will not be happy. Incidentally. Census bureau is a reliable and credible source. Celebrating Cinco de Mayo weekend :)","post_message":"\"His business was built on the backs of Latinos that helped him become successful and what he boils that down to is eating a taco salad.\""}]
