[{"comment_id":"523659234491323","commenter_b":"Not with a dogs dick!","commenter_a":"fuck her","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"},{"comment_id":"10153442947898908","commenter_b":"This is wrong. I can just tell you it is wrong because of decay and expansion. We know that the universe was something different even if that was just a tiny speck. The way the article reads as if the universe has always been the way it is now and that is not the case. All these bible thumpers who don't understand basic science or astrophysics will use this to try to say God is real.","commenter_a":"the end is the beginning.... the beginning is the end...","post_message":"This is a tough thing to wrap your head around."},{"comment_id":"10154015266906028","commenter_b":"Clearly you have ignored the riots that occur when sports teams win. Those are primarily white. It's incredibly difficult to understand any point you're trying to make, simply because you make no sense. @webpagelink","commenter_a":"Cops die on a daily basis stopping crime and just because there is some bad cops you assume all of them are bad ? What are you doing San Francisco 49ers Colin Kaepernick what are you doing to keep people safe or stopping crime ?","post_message":"After some fans took to social media to burn the jersey of the embattled quarterback because he refused to stand during the national anthem, photos of Colin Kaepernick's socks have surfaced and riled people up again. @webpagelink"},{"comment_id":"1086551791461598","commenter_b":"oboma is kissing hillerys ass cause she going to put him in the supreme court sit .Lord please don't let this evil. women win .","commenter_a":"It will be the end of the America our founding fathers put together","post_message":"ClashDaily.com"},{"comment_id":"10153637396193854","commenter_b":"He is a idiot and a monkey like that wife of his both ugly as sin he want be there much longer they have signed impeachment papers","commenter_a":"GO TO HELL","post_message":"Under Obama, U.S. Army Orders Soldiers To Scrape Bible Verses Off Their Rifle Scopes…"},{"comment_id":"924205284313566","commenter_b":"Who teaches people to hold a handgun like that???","commenter_a":"No don't agree along those lines , that's open a CAN of of worms with BIG problems behind it . ,good Luck","post_message":"For God's sake, get a grip!"},{"comment_id":"10154746027261350","commenter_b":"He's the Man!","commenter_a":"@username thought you'd appreciate this story.","post_message":"WATCH: 8 years. Over 2 million photos. White House photographer Pete Souza has captured some amazing moments during President Obama time in office. @webpagelink"}]
