[{"comment_id":"2108841499340180","commenter_b":"VICTORY FOR TRUMP ! . .FEDERAL PEN FOR THE LYIN' QUEEN !","commenter_a":"Save your money,this election will not be bought","post_message":"Nigerian billionaire Gilbert Chagoury pledged one BILLION dollars to Hillary and Bill Clinton's Foundation. That's billion--with a 'b.'   Now why would a Nigerian oligarch with a past like his do such a thing?"},{"comment_id":"10153523758249456","commenter_b":"😂😂😂","commenter_a":"If only they had went to college....","post_message":"Today, 13 people were sworn in as Montgomery Police officers. We'll hear from MPD Chief Ernest Finely, coming up at 6. Let's congratulate the new graduates!"},{"comment_id":"569853826519212","commenter_b":"So how was your nap after clearance today then?","commenter_a":"'@username this is you","post_message":"Facts"},{"comment_id":"1164167413602019","commenter_b":"Hillary is unelectable. Period.","commenter_a":"Look...as much as you may like Bernie, this is over. Hillary Clinton has the delegates and she will be the nominee. It's time to stop being delusional and start being realistic. Yes, Hillary may be a corporate puppet. However, that's still better than the Republican alternative. Do you really want to run this country into the ground with Trump?","post_message":"'A ticket combining Bernie Sanders with Sen. Elizabeth Warren would leave any Republican ticket with Donald Trump or Sen. Ted Cruz ticket in the distant dust and win a landslide victory for Democrats in November.'"},{"comment_id":"10153821104831336","commenter_b":"'@username sad indeed. Alana should shut her nasty mouth.","commenter_a":"I wish Obama would show the same respect for our troops. Oh my bad he puts illegal immigrants first before the fine men and women Who served our country.","post_message":"Today, Britain observed the annual Remembrance Day, a Commonwealth of Nations memorial day honoring armed forces who have died in the line of duty."},{"comment_id":"10153186263669411","commenter_b":"And what happens when two monsters get together? another monster!!","commenter_a":"ha ha ha America is a father England is a mother isis is a child isreal is a nanny","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153356544334087","commenter_b":"Yep.","commenter_a":"Hillary should worry about that indictment coming down the pipelines in January.","post_message":"“This is truly unbelievable, that after what we’ve seen in Paris and other places, Republicans will not bring up a bill that will prohibit anyone on the no-fly list from buying a gun in America,' Hillary Clinton said. 'If you are too dangerous to fly in America, you are too dangerous to buy a gun in America. How many more Americans need to die before we take action?”"}]
