[{"comment_id":"10155189729959199","commenter_b":"Kill the mother.or hang up.her...","commenter_a":"Sick twisted and very disturbing","post_message":"Police say this mother killed her baby by feeding her a teaspoon of salt in order to get back at the child's Dad >>> via.q13fox.com/zXtwH"},{"comment_id":"864868203550521","commenter_b":"ROFLOL!!!","commenter_a":"I see a white guy in a gold shirt.","post_message":"Photo: 20-year-old Jeffrey Williams, suspect charged in shooting of two police officers in Ferguson, Mo. @webpagelink"},{"comment_id":"535194776668815","commenter_b":"Enough reason to deny them into the USA!!!!","commenter_a":"Send them to the Obama White House when theyb return from vacation.","post_message":"***WARNING***"},{"comment_id":"10153512925208854","commenter_b":"They can take the next boat, plane, or train out of my country!!","commenter_a":"All those who sign this petition should be banned from the USA forever","post_message":"U.S. Citizens Sign Petition to Ban American Flag"},{"comment_id":"745794202277824","commenter_b":"She a fat hoe nuttin moe","commenter_a":"Dumb song.","post_message":"Something DISTURBING Was Just Exposed About Beyonce's Halftime Song  This is sickening. She should be banned from performing at any sports events for this.  Do you Beyonce needs to learn some respect?"},{"comment_id":"10152788051453445","commenter_b":"Aussie bastard cannibas its called! Sydney university are offering $10,000 if any1 can find another plant!!","commenter_a":"@username Steven Bains","post_message":"WHAT?!? A new strain of #marijuana has been discovered!"},{"comment_id":"10153695789091336","commenter_b":"No women in combat puts the men at risk to protect them they are targets of the enemy..don't care how strong or tough you think you are you get in the enemy's hands you will see the truth","commenter_a":"There is no way a woman is as physically strong as a man. That is just the way it is. It is just common sense. A woman could be jeopardize the safety of other marines when in battle","post_message":"The U.S. Marine Corps would request a waiver to keep women excluded from infantry and artillery positions, but not armor positions like serving in tank units, according to an official."}]
