[{"comment_id":"932489970229038","commenter_b":"Nothing compares to what Bill Clinton did as Gov of Ark, and in the White House with Monika Lewinsky and other women..same with John F Kennedy, with Marilyn Monroe, and mistress of a Gang boss, and nude swimming parties. They both dis honored our White House...where was the media..and why were they voted in twice...","commenter_a":"I agree! Mr. Trump has changed in the past 11 years but Hillary Clinton has not except for the worst!!","post_message":"Dr. Robert Jeffress, Senior Pastor of the First Baptist Church in Dallas, Texas, stated that he still supports Donald J. Trump, despite the GOP nominee's controversial 2005 comments."},{"comment_id":"10153621420851045","commenter_b":"Uncle had custody of her, I don't think it's what it sounds like. Parents don't just lose custody.","commenter_a":"🙏🙏🙏","post_message":"We have some fantastic news to share with you. Carlie Trent has been found safe and her uncle is in custody! #BringCarlieHome"},{"comment_id":"10154540555266509","commenter_b":"Parental responsibility not blame the gun.","commenter_a":"more guns would have prevented this","post_message":"\"He shot straight through. \" The Florida pro-gun activist was accidentally shot by her 4-year-old son, authorities say."},{"comment_id":"1715308212052135","commenter_b":"That is the good thing about voting for Trump! It is bad for Mexico and good for the USA!","commenter_a":"Bite me you greaser","post_message":"Mexico's former president claimed voting for Trump is \"treason.\""},{"comment_id":"1299379106804981","commenter_b":"Uh, she should be arrested!","commenter_a":"Sorry, but if didn't want anyone to see it, he should have put it in a folder, or face down, or taken it with him when he got up.","post_message":"You should be mortified - Post Updated *******************"},{"comment_id":"10154648123623812","commenter_b":"@username if Hillary would've have been held accountable 14 years ago, she'd be in prison.","commenter_a":"ABC news and the Washington Post- Lies. ABC headline is ridiculous. Newt Gingrich still backs Trump. The media is banking on people only reading the headline, and not the story.","post_message":"Newt Gingrich, one of Donald J. Trump's most ardent supporters and once rumored to be his vice-presidential pick, says Trump is \"proving he is more unacceptable\" than Hillary Clinton."},{"comment_id":"596965907173588","commenter_b":"They BORN there.need to FIX their OWN Country..DON'T COME MESSING UP 'OURS;~~","commenter_a":"Trump will make american tax payers build the wall not mexico","post_message":"Trump Better be Serious about Border Security Promises"}]
