[{"comment_id":"933293890039082","commenter_b":"And any criminal will just turn in their guns! Like they do in Chicago and California!","commenter_a":"Clinton is so clueless!! This isn't about gun control bitch. This is about Obama allowing Muslims to come here knowing the repercussion of this. They were making IED'S in their garage you stupid fuck Clinton. Better start putting a ban on IED'S. Now all these Syrians Obama? Your the terrorist and the democrats are all equally guilty for putting you in and backing you. Come get my guns. You will get them no problem there but you won't be walking away. Black lives matter and Muslims are all terrorist.","post_message":"Wasting no time..."},{"comment_id":"10154556355598690","commenter_b":"Some women just cant understand that others wish to cover up. Brainwashed since childhood to wear hardly anything.","commenter_a":"If the burkini is a symbol of Islamic extremism, then does that make the bikini a symbol of Western extremism or rather, Western subjugation of women? Surely freedom works both ways? Why should women be forced to show skin if they choose to cover up?","post_message":"Cannes Mayor David Lisnard called the full-body, head-covering swimsuit worn by some Muslim women \"the uniform of extremist Islamism\"."},{"comment_id":"501575200039916","commenter_b":"WANTS TO KEEP AMERICANS STAGNANT, MOVING BACKWARDS AND PAY HIGHER TAXES TO SUPPORT IMMIGRANTS COMING OVER OUR BORDERS FROM ISIS COUNTRIES TO PUT AMERICANS IN GREAT DANGER, WANTS TO KEEP MINORITIES IN DEMOCRATIC OPPRESSION, POVERTY, JAIL, AND HIGH CRIME, NO FUTURE, WELL WHY NOT VOTE FOR HILARY CLINTON.","commenter_a":"Yes","post_message":"Question of the Day: Should the media be giving Tim Kaine's past comments about President Bill Clinton more attention? Share your thoughts below."},{"comment_id":"10153226681651833","commenter_b":"Thanks Jason - the \"next one\" will probably effect me, though.","commenter_a":"I don't even own an AR, but I sent an e-mail to the ATF \"comments\" site opposing the ban on M855. I also sent e-mails to my congressman and both senators and signed a petition about the same issue. I suspect that the motivation is simply that the government doesn't want those who own ARs to have a source of reasonably priced ammo for their guns. I oppose this mindset.","post_message":"A notice from the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF) shows the agency is considering a ban on the popular M855 AR-15 round  by re-categorizing the round as  piercing.  Be sure to contact ATF and let them know you oppose this proposal. Then contact your members of Congress and express your opposition to ATF's ammo ban.  @webpagelink/ #M855"},{"comment_id":"10154290589526323","commenter_b":"On bbc this morning she actually said that she wants europe, keep the pound and still have no borders with the uk!!!! This woman is nuts.....","commenter_a":"If Scotland votes to leave the UK and joins the EU then welcome to the Euro, Schengen and for Brussels to take over your resources like Banking, Oil, Fisheries and Hydro Power! You will become swallowed up and ruled with an iron fist from Brussels with orders and wrapped around a straight jacket..and have a border with England! Fancy it?","post_message":"\"If the Scottish parliament is judging this on the basis of what’s right for Scotland then the option of saying we’re not going to vote for something that’s against Scotland’s interests, that’s got to be on the table. You’re not going to vote for something that is not in Scotland’s interests.\""},{"comment_id":"10153424148207016","commenter_b":"If she's been forced to left that means that's not what she wants to do I will never ever ever ever ever ever vote for that woman. I'm voting in this election because we have to get rid of Republicans and bought Democrats but I'm writing in Bernie Sanders","commenter_a":"After picking myself off the floor from laughing so hard, I have figured out that one way or another, Senator Sanders will be the real winner no matter what happens in this race. A change is coming in American politics, and even Hillary Clinton won't be able to stop it. Delay it, maybe, but the majority of the American people from all sides have had enough with business as usual at their expense and are mad as hell about it. Just look at the long lines at the polls and the huge turnouts at Bernie Sanders' rallies if there are any doubts - that is the beginning of the revolution which Sanders is talking about.","post_message":"Left enough already?"},{"comment_id":"1374953252516136","commenter_b":"OH my goodness....Awesomem display of fireworks...:'(","commenter_a":"Happy New Year to all family and friends in London ❤❤❤❤","post_message":"We at the London Eye to welcome in the New Year."}]
