[{"comment_id":"10152922353911051","commenter_b":"Someone should dangle her nasty evil ass with their hands around her fu****g neck!!!! evil bitch","commenter_a":"I'm sure the mom had a tight grip on the child when she did that. In saying that I'm hoping the kid was being punished for doing something really fucking stupid for her to take it that far","post_message":"Neighbors couldn't believe that a mother would do something like this to her young son."},{"comment_id":"10154716616787908","commenter_b":"It looks like GE is moving part of it's head quarters to Boston, since Boston will give them a $25 million dollar tax break! It's all about the deal! I'm told that what they're giving back is just a drop in the bucket compared to what they'll get. We're so lucky!","commenter_a":"Yes BERNIE Yeeeeees","post_message":"I didn’t hear the head of GE and all these CEOs who ship jobs to China asking the Chinese for a bailout check in 2008. Instead, after laying off American workers they came begging the American taxpayers for a bailout."},{"comment_id":"10154094490463984","commenter_b":"Thanks to our neighbors to the north..it would appear they are much wiser than we are. If this racist carp is going to end, it must end on both sides. I truly believe there are far FAR more black racist than white in the USA today. I also do NOT believe the blacks want racism to stop, that as a whole have too much to lose.....","commenter_a":"Can we just get this racist woman off social network already! Tired of seeing and hearing about her!","post_message":"Fresh off her race-baiting Super Bowl 50 performance, Beyoncé was about to head up to a huge concert in Toronto. However, a Canadian official just hit the singer with BRUTAL bad news... She never saw this coming... she should have, though."},{"comment_id":"10153300662806491","commenter_b":"That is fair enough. I read a bit about the current government it is indeed incredibly corrupt and has generated a lot of hatred from the people due to actions which benefited only those in the inner circles. This however does not bode well, civil unrest of this scale does not end well.","commenter_a":"It is a horrible tragedy but it does not warrant for a cabinet to resign. I am confused at why the riots asked for the resignation rather then the changing of the laws.","post_message":"Prime Minister Victor Ponta and his Cabinet resigned Wednesday after mass protests."},{"comment_id":"10152892433531051","commenter_b":"What about the elderly and the disabled you stupid bitch.","commenter_a":"If you don't have Children, You shouldn't be drawing food Stamps!!\"","post_message":"This state just kicked 9,000 people off food stamps."},{"comment_id":"1007373832677433","commenter_b":"Ronni: I wasn't sure if he was calling me a simpleton Repub dink or Palin? The sarcasm in my comment is fairly obvious, is it not? Like I would agree with that rabid bat shit crazy ass woman?","commenter_a":"Goodie bags filled with teddy bears and soccer balls would certainly entice me to leave my country for another.","post_message":"\"Knowing that Trump won on [immigration], it should empower you to go ahead and ask the candidates, 'What the heck are you thinking, candidates? What are you thinking when you're going ahead and actually asking for more immigrants, illegal immigrants, welcoming them in, even inducing and seducing immigrants with gift baskets of teddy bears and soccer balls?' \" Sarah Palin said."},{"comment_id":"1118006468215013","commenter_b":"and illegals.","commenter_a":"Lol same old democrap bs. Yes the GOP is trying to keep Millon's from voting. Millions of dead people.","post_message":"Mrs. Clinton is out accusing the Republicans once again of plotting voter fraud, and she is making this allegation in front of African-American audiences."}]
