[{"comment_id":"1038851362838059","commenter_b":"Merry Christmas from your Muslim neighbors! Fighting for #AmericanUnity Like us on FB #AMOT American Muslims in Opposition of Terror","commenter_a":"Merry Christmas, Hillary & to your family!","post_message":"Can't think of a better day than one with family, food, and the best gift of all: a new grandchild on the way! Merry Christmas. -H"},{"comment_id":"597841083739804","commenter_b":"OBAMA IS THE SAME ALL ARE THE SAME CORRUPTS AND CRIMINALS WHAT HAPPEN IS PEOPLE WANT'S TO BE CORRUPTS AND HAVE POWER AND ABUSE OF POWER THAT IS WHY THEY LIKE THEM CONGRATULATION LOOK AT THE WORLD HOW IT LOOKS AND THINK A LITLE NOT TO MUCH AND SEE WHAT IS GOING ON","commenter_a":"Damn right!","post_message":"George W. Bush was right, there were weapons of mass destruction.  We always had his back. He is a great man, and a true patriot.  Do you support George W. Bush?"},{"comment_id":"1216942571674495","commenter_b":"Deceitful lying criminal. God have mercy on those who vote for monster Hillary. She will destroy this country with her crimes.","commenter_a":"How telling!","post_message":"Hillary v. Hillary!"},{"comment_id":"746903725500205","commenter_b":"she is a disgarce and should be reprimanded so should cbs and the nfl they truly are responsible for giving this racist cop hating person a platform in which she was able to spread hate and racism","commenter_a":"YES.","post_message":"Congressman Absolutely Unloads On Beyonce For Vile Halftime Show  She completely overstepped her boundaries.  Do you agree with this Congressman?"},{"comment_id":"660818097425993","commenter_b":"She needs to get Raped to change her opinion. stupid bitch.","commenter_a":"She is a disgusting, lying hag! If she can lie to children, she's a special kind of 'she-demon!'","post_message":"This is just disgraceful."},{"comment_id":"1728684567380415","commenter_b":"#NotMeUs hillary just want your vote so she can work hard for the rich people!","commenter_a":"Please exit out of video , share the post by clicking SHARE button on bottom right. Come back and join us❤️","post_message":"Bernie Sanders rally in Pittsburgh: Part I"},{"comment_id":"486501341528450","commenter_b":"She's a skank. Thought she was going to leave the us if bush was elected. Leave the us bitch","commenter_a":"The fucking Libtards heads will explode when Trump gets elected. I will fucking LOVE IT!!!!","post_message":"You've GOT to see her characteristically snooty and elitist statement..."}]
