[{"comment_id":"10156348163835354","commenter_b":"This is exactly what we need..someone to shake up the illegals..make them realize that they cant stay here..these officials are part of the problem ..trump isnt crapping on latinos..he jist wants them to be here legally..obama and past administrations have turned their heads and not dealt with..we have a big problem now...go trump","commenter_a":"Really that is a bunch of nonsense! They would only be fearful of someone enforcing the Rule of Law for ALL... IF they have broken any laws. Anyone here legitimately -- they have nothing to fear at all! This Hispanic Lawmaker is sounding a false alarm! Instead of defending illegal aliens he should be working to improve the lives of the citizens and legal constituients he represents. Why is he working so hard to help those who do not belong here but doing nothing for those leagally here that needs the job he's allowing the illegals to stay at?","post_message":"“Mr. Trump’s racist remarks and his continued rhetoric demonizing Latinos and immigrants has created fear within these communities around the country....\""},{"comment_id":"10154682154393984","commenter_b":"She's the whore of Babylon","commenter_a":"Let me tell you all her dx.......she needs Jesus Christ!!! Maybe she is possessed by a demon, highly likely......! God has allowed her to come to ruin because she wont turn from her wicked ways.....for those who do not like my comment.....read your bible, you will find out lots a things God allowed to turn people away from sin!!!","post_message":"There's been lots of speculation about what might be ailing Hillary Clinton, if anything. One dental expert took a look inside Hillary's mouth... and almost instantly, he said he knew the condition that's been causing all of her health problems.  Could this expert be right?"},{"comment_id":"10154166607743352","commenter_b":"Jail needed for sex scum","commenter_a":"Troubled ladies-counseling needed.","post_message":"What sort of school IS this?! Geography teacher is now accused of lesbian affair with teenager after two colleagues 'had threesome with boy'"},{"comment_id":"852438651458224","commenter_b":"She's an idiot!","commenter_a":"AS. THE REAL Castro DID FOR THE USA. SEND THE BOAT PEOPLE. RETURN THE FAVOR. SEND OUR BOAT PEOPLE LET THEM SEE HOW THE REAL CUBANS ARRE BEING TREATED THE NUT. JOB IS TALKING. REVOLUTION.ARESST IT PUT IT IN JAIL. THE SCHOOL KNOWS ALL ABOUT HER AND DID NOTHING.INVESTGATE THE SCHOOL THEY HAVE MORE LIKE her","post_message":"Look kids, this is what #liberalism does to the brain!  Pray you're never on a plane with someone like this! You have to see it to believe it:"},{"comment_id":"10153404609274170","commenter_b":"I use roaches. She is like a roach, nasty.","commenter_a":"Good news here .. 57% *of* 47% only comes to 26.69% overall. This places me among the 73.31 who think she's a lying skunk (and those are her good points).","post_message":"53% of voters say Hillary is not trustworthy. ...But 57% of Dems still support her.  Why?"},{"comment_id":"10154412876021491","commenter_b":"Does this tour detour to the location of the White House MLK Bust? I hope they know where it is. Don't depend on Time, though.","commenter_a":"Shruti Maheshwari","post_message":"Here's how to score a major deal on a scenic getaway."},{"comment_id":"10152859256761051","commenter_b":"Sick ! Needs the same done to her !","commenter_a":"They all deserve prison for life without parole!!!","post_message":"The judge looked this grandma in the eyes, called her the most evil person he had ever met and sentenced her to 4 life terms."}]
