[{"comment_id":"10153145036396167","commenter_b":"Maybe a big dick up there asses just makes them crazy!! It drives my ex-wife batty!! ha!! B|","commenter_a":"The violence wasn't connected with his homosexuality but it's pretty common for gays, particularly gay men, to be mentally unstable.","post_message":"Seriously, CNN?"},{"comment_id":"10153287976081770","commenter_b":"@username you may be right. But on the other hand maybe thats what this country needs now. A good dose of reality. Quit voting these life long politicians in office.","commenter_a":"Trump as President??? So everyone is all right with him insulting women, rude comments about Jeb Bush, Ted Cruz, Carly Fiorina, Megyn Kelly,insulted the miltary, the disabled, John Mccain just to name a few. One of the meaniest and rude things he has done where he ripped it with me is a couple of days before Thanksgiving, at a rally in South Carolina he made fun of a New York Times reporter that had a physcial problem. Speaking as a person that has a physcial problem, that was very offensive! If I would have been at that rally, I would have knocked the living crap out of Trump! Trump thinks that he is going to be able to insult himself into The White House but oh boy, he is VERY wrong!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","post_message":"Donald J. Trump spoke highly of his wife, Melania, at his last rally before voters head to the polls in New Hampshire."},{"comment_id":"1301607906602125","commenter_b":"sharon when and if hillar y gets on i hope she puts the syrian refugees near u look what happened in europe well maybe u can get 1st taste of the syrian refugees in ur neighborhood","commenter_a":"Trump totally blew that first questions......He's the greatest at deflection.....LOL.......all he can say is we got to stop the jobs from leaving.","post_message":"WATCH LIVE: Hillary Clinton and Donald J. Trump square off in their first debate."},{"comment_id":"10153689476229411","commenter_b":"^your a dumb bitch lol","commenter_a":"Neo nazi sentiments are riseing in europe includeing islamaphobia and alittle anti semetic retoric. This is a reality. I dont care if u agree or dont its happening. People say get rid of the immigrants that have refugee status and those fleeing war zones and this intolerance will end. No it wont. This is a deep rooted problem of european ethnic supremacy masked. Its disguised well and they sure convince alot of people of there philosophy from people like madam blavatsky. And her race based ideology. Whats fueling race and ultimately religious intolerance is low birth rates from the native peoples of europe so they blame immigrants even tho the state subsidizes births in europe. Neo fascism is gaining ground because of this wacky race based fear and economic troubles. So the nazis are mixing both messages pointing it at immigrants and they do get violent. They dont only want ...","post_message":" is disrespectful is the political reality in Europe that people, suffering so greatly hand, over thousands of euros and must take such unsafe routes while for the rest of us Europeans it is so easy  to travel in the other direction\""},{"comment_id":"10153530234038854","commenter_b":"We knew this was coming, all part of the homosexual agenda.","commenter_a":"By Law, Churches are automatically Tax Exempt, so there's no need for them to have an IRS 501C-3 status. If you don't believe it, I suggest you research it.","post_message":"This is going to get ugly… Obama’s Lawyer To Supreme Court: Religious Institutions May Lose Their Tax-Exempt Status If They Don’t Back Gay Marriage…"},{"comment_id":"10153063364393188","commenter_b":"Idiot and hypocrite. So he says he was a solider.","commenter_a":"He's a traitor and needs to be deported immediately","post_message":"Really?"},{"comment_id":"1339079532789860","commenter_b":"Yo she cheated she should be feed the next chick","commenter_a":"MAKE HER EAT A BAG OF THEM","post_message":"Chip Roulette: Who Will Eat The Carolina Reaper Chip, The World's Spiciest Tortilla Chip, First?"}]
