[{"comment_id":"10154290589526323","commenter_b":"On bbc this morning she actually said that she wants europe, keep the pound and still have no borders with the uk!!!! This woman is nuts.....","commenter_a":"If Scotland votes to leave the UK and joins the EU then welcome to the Euro, Schengen and for Brussels to take over your resources like Banking, Oil, Fisheries and Hydro Power! You will become swallowed up and ruled with an iron fist from Brussels with orders and wrapped around a straight jacket..and have a border with England! Fancy it?","post_message":"\"If the Scottish parliament is judging this on the basis of what’s right for Scotland then the option of saying we’re not going to vote for something that’s against Scotland’s interests, that’s got to be on the table. You’re not going to vote for something that is not in Scotland’s interests.\""},{"comment_id":"472935749563672","commenter_b":"Able bodied people that are on welfare should be required to work. Taxpayers have to work, why not the leeches on welfare.","commenter_a":"If they are able to work,then yes. They should have to work. Same as they should be drug tested.","post_message":"These free loaders just got some very bad news.  Awesome. It's about time these people are put to work.  Do you agree that people on welfare should have to work?"},{"comment_id":"1510912668928758","commenter_b":"The choice is simple one's a white supremacist with thousands of racist supporters.....and the other is a woman that rubs you the wrong way","commenter_a":"What a surprise","post_message":"The endorsement will run in Sunday's edition of The Times — a day before Hillary Clinton and Donald J. Trump go head-to-head in the first presidential debate."},{"comment_id":"897196563636468","commenter_b":"Nailed it! Being as, I saw this last night and asked, who is this woman!","commenter_a":"Funny how Kelly Clarkson's known over a couple of continents, yet what's her face has never been heard of over here.","post_message":"Some people wait a lifetime for a comeback like this  well done, Kelly Clarkson."},{"comment_id":"10153664912304726","commenter_b":"There are Syrian refugees already there!!","commenter_a":"Yeah, let the refugees all live at the vatican. they got lots of money and plenty of room.","post_message":"The Vatican keeps out the throngs while the Pontiff urges the U.S. to open borders."},{"comment_id":"10154319507055329","commenter_b":"Haha complete and utter shit show Xxx","commenter_a":"Charlotte, number 4 and not number 5 lol!","post_message":"Here's to the tea addicts!"},{"comment_id":"464367687084172","commenter_b":"Please be specific and truthful. Trump is only against ILLEGAL immigration. Trump is only calling for a temporary hiatus on muslim immigration until we can ensure that terrorists aren't taking advantage of the opportunity to come to America. Otherwise peddle your bs somewhere else.","commenter_a":"And of course Trump said nothing of the sort. Bernie is a liar, plain and simple.","post_message":"Watch Bernie Sanders's explanation for Donald J. Trump's rise. -------- Read more on the third Democratic debate: @webpagelink"}]
