[{"comment_id":"10155450012565354","commenter_b":"Common Women are not going to waste 2000/yr on themselves. That is uncommon disposable income.","commenter_a":"You are not close to \"the common woman,\" if you refer to her as \"the common woman.\"","post_message":"Gwyneth is quickly becoming our favorite celebrity."},{"comment_id":"893860944043492","commenter_b":"Theres nothing \"hateful\" about 1) secure the border 2) Enforce the immigration laws. In fact every country, including Mexico, does this. People ARE angry. For good reason. As we see our country being ruined by endless millions of incading illegal aliens.","commenter_a":"Its very simple. 1) Enforce our immigration laws. 2) Secure our borders. By the way, that's how all the other countries try and deal with immigration. The rest of this nonsense is just typical liberal delusions","post_message":"End of a DREAM?"},{"comment_id":"10158155070740206","commenter_b":".. And why is anyone still endorsing hillary clinton?","commenter_a":"so the NYP takes a run at Ryan Lochte for lying but gives crooked Clinton a walk ? hmmmmm","post_message":"Liar liar, swim trunks on fire. @webpagelink"},{"comment_id":"10156176044470354","commenter_b":"I think the women of the View are ignorant. Their 15 minutes has been up years ago !!!!!!!!!!!!!!!!!","commenter_a":"These women are a bunch of assclowns... They mean nothing and I can't wait for the day they need a nurse then they will be eating their words and asking for your help... SMH...","post_message":"The #NursesUnite movement is mobilizing against liberal co-hosts of \"The View\" Joy Behar and Michelle Collins. But now, new arrogant and elitist behind-the-scenes comments are coming to light and sparking further uproar with nurses across America..."},{"comment_id":"1613087268994006","commenter_b":"Look at that smug look on her nasty face! She makes me want to puke","commenter_a":"Sending to the Khans..","post_message":"Appearing alongside Hillary Clinton, Khizr Khan asks rhetorically, \"Donald J. Trump, would my son Capt. Humayun Khan have a place in your America?\" @webpagelink"},{"comment_id":"862139507221510","commenter_b":"Obama and Trump should get along splendidly then.","commenter_a":"Hillary is running a close second or maybe she is in first place.","post_message":"Yes he is! Do you agree with Trump?"},{"comment_id":"10153736495329753","commenter_b":"Yes","commenter_a":"Of course he's backing Killary. He's a libtard!","post_message":"Incarcerated hip-hop artist Bobby Shmurda has endorsed Hillary Clinton’s 2016 presidential bid. The 21-year-old leader of the Brooklyn-based GS9 crew is the latest in a string of high-profile hip-hop artists to back the Democratic front-runner, including Snoop Dogg, Pharell and Eminem. According to Shmurda, Clinton is the most suitable candidate to take over the Oval Office in November because of her “strong mind” and empathetic nature. “I’m going for Hillary, man,” he told Vibe. “I like... @webpagelink"}]
