[{"comment_id":"355920354532026","commenter_b":"She does not care about you!","commenter_a":"okay, the need and movement for change I support and believe in, but sorry HILARY CLINTON no vote from me","post_message":"“We’re hoping that we can partner with Hillary to get some true change for all people.” —Maria Hamilton, mother of Dontre Hamilton"},{"comment_id":"10152847429722623","commenter_b":"Yeah because throwing fish chunks attracts puppies","commenter_a":"Jessica Kennedy South","post_message":"Check out this photo:"},{"comment_id":"1369855736388104","commenter_b":"Those women are vicious hacks for hillary.they don't care what she did against America or the corruption & lies they are all part of the corruption .","commenter_a":"What a waste of her time. They just want their ratings to increase with all the drama","post_message":"The claws really came out..."},{"comment_id":"10152824862457212","commenter_b":"Yes of course. The middle aged woman who comes from a upper middle class family. Is going to tell people how to make it. Please go on.....................","commenter_a":"Cue the Conservatives of this state to tell how they worked so hard for their money, and it is everyone elses fault the don't have the means they do. In 1...2...3...","post_message":"Seeking to assess if the Horatio Alger, \"rags to riches\" narrative...remains viable, researchers measured the odds of a child born to parents in the bottom 20% of income earners reaching the top 20%. They then contrasted the chances of climbing the ladder in the U.S. to that in other developed countries. #News9 #CBSNews"},{"comment_id":"561305640738010","commenter_b":"Yeah men can't back out....it's called child support lol","commenter_a":"Men should be made accountable and pay all money through a court.","post_message":"We couldn't agree more!"},{"comment_id":"501432243350902","commenter_b":"The blood will be on your hands when the terrorists and illegal aliens kill American citizens, you child molesting PIECE OF SHIT!!!","commenter_a":"\"ELECTED\" enforcers for the largest criminal organization on the planet.","post_message":"BETRAYAL.  #RINOStampede"},{"comment_id":"521952154659744","commenter_b":"When pigs fly, I'll believe it when I see it!","commenter_a":"Thank you for finally thinking of Americans and our safety !","post_message":"BREAKING..."}]
