[{"comment_id":"10153658944994726","commenter_b":"Hillary grow up and stop the whining!You are worth $2 millions! or billions?","commenter_a":"What a Dumbell","post_message":"WATCH: Hillary: I’m an ‘Outsider Candidate’"},{"comment_id":"10153330910164497","commenter_b":"Hillary is a sex addict; shes always screwing herself.","commenter_a":"Idk if she'd be a good president though; last time she had a job, she outsourced it to Monica.","post_message":"This Week's Top Story:"},{"comment_id":"10153765289899726","commenter_b":"Come to my house and more than their head will fly out the window. #semperfi","commenter_a":"Now, does Allah have 73 virgins for her too?","post_message":"Bomber's severed head 'flew out the window'"},{"comment_id":"10154881965660575","commenter_b":"Want to be loved I guess","commenter_a":"Is it just me: or is she looking at you like a Stepford Wife ?","post_message":"Barbara Bush: “We believe that every person has the right to live a healthy, dignified life.”..."},{"comment_id":"10153367837094714","commenter_b":"You just don't understand feminism, boys are free to do what they want to do women should be just as free, to have sex, get drunk and behave carelessly just like boys do.","commenter_a":"Why would they take offense? Because they want to protect the image and dignity of young women? Seriously?","post_message":"Wow, we didn't see it until we looked closely"},{"comment_id":"10153409431986336","commenter_b":"Give it a rest ! Donald Trump has every right to his opinion. I agree that this country has had an influx of illegals for years. Be informed and know that Mexico and Guatemala have cut a deal to send thousands more to cross our borders illegally. The monies they send back to Mexico and Guatemala is $120 Billion dollars. This president wants to give them a free pass plus $35 thousand tax refunds? So they cross illegally, burden our health centers, schools, and oh only so you get my disgust! All I used to hear at the hospital is people telling other relatives of theirs to \"Come to the U.S., because this country is so stupid. They give you money for living, food stamps and oh if you have your babies in the U.S. , then they are citizens and you can stay\"... So these so called nice people ...","commenter_a":"Its a PR move. All they really care about are the $$$$$$ NBC and MSNBC are financially hurting. Low ratings low viewership.","post_message":"Breaking News: NBC is ending its business relationship with Donald J. Trump due to his \"recent derogatory statements\" regarding immigrants. DETAILS: @webpagelink"},{"comment_id":"897936806940850","commenter_b":"DUMBASSES!!!!!!!!!","commenter_a":"People take note of these 18 cities and steer clear.","post_message":"ALERT: These 18 U.S. Cities Just Made Terrifying Announcement About Muslim ‘Refugees’… Do YOU Live There? @webpagelink"}]
