[{"comment_id":"10152692190456636","commenter_b":"Because of course it's the woman's fault! We are female, wear thongs and stiletto heels so obviously that translates to \"I want sex and will have it with anybody and my screams of no & stop obviously mean, yes!\" And if you go to court they ask questions about your underwear and what we're you doing out. Never ask the rapist what he was wearing or why he thought you walking down a street by yourself translates to brutally attack and rape me. It's 2015 the world has come far but on certain things importance ranks zero.","commenter_a":"road","post_message":"'I witnessed this years ago, after I was raped myself'"},{"comment_id":"965007433534716","commenter_b":"2 pussy's","commenter_a":"Freya Mistry Rayan Mistry","post_message":"Donald Trump and Jeb Bush are fighting over who is tougher. What do you think?"},{"comment_id":"10158282673955294","commenter_b":"Today????????","commenter_a":"Does this mean Chris Jericho, aka Y2J, has been signed to a lifetime contract with WWE? If not, they're stupid idiots!","post_message":"A group of scientists have moved the \"Doomsday Clock,\" a symbolic countdown to the end of the world, to two and a half minutes to midnight."},{"comment_id":"10153746116545326","commenter_b":"@username I'm still waiting for the tons of stepford wives to come.","commenter_a":"Lots of bitterness coming from the Sanders.","post_message":""},{"comment_id":"1170571449649992","commenter_b":"A lot of dumb chicks out there..","commenter_a":"Love it!!!","post_message":""},{"comment_id":"10153981518484749","commenter_b":"These drivers are trespassing on private property. The property owner is 100% within her rights to report each trespasser to the police and have their cars towed.","commenter_a":"why not have it towed? make a deal with a local tow company and get a commission off each car towed from your driveway","post_message":"\"Happy digging, at least it's not raining.\""},{"comment_id":"977678122350240","commenter_b":"Hillary is NOT with us, we are NOT with her.","commenter_a":"The Revolution!!!!! Bernie !!!!","post_message":"Bernie or Bust rally in downtown Philadelphia"}]
