[{"comment_id":"10152582982555950","commenter_b":"Im guessing she's a real bitch...","commenter_a":"he could have just said he wanted a divorce,","post_message":"The man's wife didn't know about or give permission for the demolition, police say."},{"comment_id":"601754246672035","commenter_b":"Yes I do the whites made her now she it very racist big time","commenter_a":"shut your mouth!","post_message":"Oprah: ‘Anyone Who Doesn’t Like Obama Is Racist’. Unbelievable. What a bigot. Do you think Oprah is the racist?"},{"comment_id":"10153656654198598","commenter_b":"I guess Margaret Sanger and her biggest admirer, Hillary, are accomplishing their evil goals!","commenter_a":"Whoa! That is alarming.","post_message":"More Black Babies in New York City are Aborted Than Born Alive"},{"comment_id":"10154106990671409","commenter_b":"God help us if this is all they can trawl up for person of the year . He is only out to fill his own own pockets further. This misogynistic , ecogotistical man is only out for himself, and will turn out to be america's biggest mistake.","commenter_a":"He's NOT a PERSON!!! He's an orangatan and inhumane ethnocentric lying bully.","post_message":""},{"comment_id":"10153653886305950","commenter_b":"Shut up, whore.","commenter_a":"The teen should have complied. And his parents did a terrible job.","post_message":"The aggressive confrontation nearly cost the teenager his life."},{"comment_id":"10154395372381656","commenter_b":"@username let me guess you stand on a corner and watch to see if there anyone putting up a sign after you park legal must work for city and help a 5 man team screw in a light bulb....","commenter_a":"Don't park in a tow zone and you'll be fine. lol.","post_message":"\"None of us has been arrested for stealing,\" he said."},{"comment_id":"10153734368245950","commenter_b":"Here's another dense one told all her life she's witty","commenter_a":"It sounds like some shyt white Americans did to build this country then brag and say they did. Then tell u get over it.just saying the story sounds familiar","post_message":"The captives were sometimes held in chains, whipped, beaten and threatened, underfed or made to eat off the ground, according to a statement."}]
