[{"comment_id":"10154210994334024","commenter_b":"'@username and never apologized! Hillary blamed them and called them vile names. Such double standards.","commenter_a":"This book was praised by women readers and them running to the theaters to see the movie, but offended by what trump said 11 years ago. The vulgarity of those novels enormously outweigh what he said. Such hypocrisy!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10155797026705354","commenter_b":"To someone above, I wash my own car. More Americans are growing their own gardens. I rarely go to hotels. Their whole argument is false though because we have had immigrant worker programs for decades. Obama is intentionally flooding the country with illegals. Read about George Soros and his open border group. The man is evil.","commenter_a":"We are the force that keeps the country afloat.' is she for reals? we were floating right along wa before illegals came along.","post_message":"'Mexicans, like all Latinos, contribute positively to this great nation. We are the force that keeps the country afloat.'"},{"comment_id":"822546624556646","commenter_b":"Trying to straight-wash and white wash the situation is terrible. Not only was this guy scoping out gay bars before, he also chose to go on Latinx night, when most of the patrons were PoC, generally of Latin descent. So this was a hate crime. It had to do with race, it had to do with sexual orientation. You trying to bury those facts is deplorable.","commenter_a":"This isn't a gay attack. It's a terrorist attack that's being portrayed as homophobic because that's a cause people will rally for. Anything to further your agenda. No one wants to believe it's radical Islam, but that's what this is. Of course his family and even his own tweets blame gays. A gay bar is a perfect target so we can blame homophobes and call it a a hate crime. Well terror is also a hate crime and gay or straight these people are dead.","post_message":"President Obama on Sunday morning's mass shooting at a gay nightclub in Orlando, Fla. It's the deadliest mass shooting in U.S. history. @webpagelink"},{"comment_id":"10153832005601162","commenter_b":"Not a girl if you have boy parts, sorry.","commenter_a":"What about the rights of every girl at this school. This is insanity.","post_message":"30-DAY DEADLINE: The U.S. Department of Education says Palatine Township School District 211 is violating the rights of a transgender student by refusing to allow her the unrestricted use of a girls' locker room: @webpagelink"},{"comment_id":"10152884101260950","commenter_b":"Day. I love all animals.....and the nice part is.....nobody can stop me.","commenter_a":"Burn her ass. Grrrrrr. My compassion for animals is soooo much stronger than it is for humans.....karmas a bitch","post_message":"The woman allegedly set a terrier mix named Brownie on fire; the dog's burns were so bad, he had to be euthanized."},{"comment_id":"10153563054238984","commenter_b":"Stop!","commenter_a":"Subject Prophecy Fulfillment At the time of Messiah's coming, Israel would have unfit leaders. Zechariah 11:4-6 Matthew 23:1-4 The Messiah's brothers would disbelieve him. Psalm 69:8 John 7:3-5 The Messiah would be the 'stone' rejected by the Jews. Psalm 118:22 Matthew 21:42-43 The Jews would have a hardened heart against the Messiah. Isaiah 6:9-10a John 12:37-40 The Messiah would be a 'stumbling stone' for the Jews. Isaiah 8:14 Matthew 21:43-44 The unbelief of Israel's leaders would force the Messiah to reject them. Zechariah 11:8 Matthew 23:33 The Messiah would stop ministering to the those who rejected Him. Zechariah 11:9 Matthew 13:10-11 The Messiah would be distressed over the Jews unbelief. Isaiah 49:4 Luke 19:41-42 The Messiah's own people would not believe he was the Christ. Isaiah 53:1 John 12:37-38 The Messiah would be rejected. Zechariah 11:12-13b Matthew 26:14-15 The Messiah would be rejected. Isaiah 53:3 Matthew 27:21-23 The Messiah would ...","post_message":"This former governor can speak from firsthand experience, and that experience has her taking a BIG stand for 'The Donald.'  Do you agree with Jan Brewer?"},{"comment_id":"10153245155862550","commenter_b":"Candace, those who are offended by the American Flag can move!!! HAPPY INDEPENDENCE DAY Ladies!","commenter_a":"I hope they catch them...my ancestor is buried there. And who knows...some of those soldiers that they dishonored are probably non-white....my ancestor is NA. All lives matter....","post_message":"#BreakingNews Update: The Durham Police Department is investigating after a Confederate memorial in Maplewood Cemetery was vandalized.  More details here: @webpagelink"}]
