[{"comment_id":"1267309513345274","commenter_b":"Great comeback! :)","commenter_a":"Ya gotta love the way the Dems embarrass themselves in front of the entire world .... just say'n .. JBeale","post_message":"Allen West Republic"},{"comment_id":"10153824492221336","commenter_b":"Start packing illegals.....","commenter_a":"Now build a Wall and Deport the Illegals!","post_message":"BREAKING: In a 2-1 decision, the 5th U.S. Circuit Court of Appeals upheld an injunction blocking President Barack Obama's executive order to protect an estimated 5 million people living in the United States illegally from deportation."},{"comment_id":"10153158036376756","commenter_b":"Haha or they're super annoying beats made on a computer by another artist.. Then they take that same beat again change a few things and bam another two chains song!","commenter_a":"Modern day hip hop is way worse! All the beats are the same n the lyrics are garbage!","post_message":"Maybe you've noticed that many hit country songs sound the same. Now you have proof."},{"comment_id":"1263042020429217","commenter_b":"She started the whole thing ...she spit on him and was calling him a n***** ...she even lied and said she didn't even hit him or anything and begged for the video to not be shown.she is also suing the restaurant and this is not the first time she assaulted someone and lied about it .she is scum and a money hungry bitch","commenter_a":"Everybody saying she deserved it, just hope your daughters don't instigate something and get her ass beat.","post_message":"Totally uncalled for!  #WSHH #Oklahoma #JoeMixon"},{"comment_id":"594411744025341","commenter_b":"You probably have one between your legs Shannon!","commenter_a":"Who cares! It's an inanimate object! Ever heard of idolatry? This is it!!!! True followers of Christ don't kneel before a statue, they kneel before the one true God.","post_message":"What does sheer animalistic Muslim hatred against Christians look like? Story below."},{"comment_id":"475003736018845","commenter_b":"He SHOULD WORRY ABOUT DOING HIS JOB! ALSO, STOP BEING A RACIST @webpagelink","commenter_a":"Thank you Mr President for being the last President w class and dignity. Im very pleased w what youve done thats affected my life these past 7 years. Too bad Congress coukdnt back you more.","post_message":"Extreme voices in the Senate shouldn't stand in the way of a fair hearing for the next Supreme Court nominee. @webpagelink"},{"comment_id":"1052520311437414","commenter_b":"STUPID AMERICANS!!!!!WAKE UP!!!!!!","commenter_a":"Kick all muslims out of America.","post_message":"This could be way more serious than you ever thought possible. Do you think these men need to be stopped?"}]
