[{"comment_id":"10153370538292144","commenter_b":"@username She's a Republican.","commenter_a":"Not all republicans are pathological liar but all pathological liars are republican.","post_message":"\"This is not normal political hucksterism. It's a pathological disregard for the truth.\" —Kevin Drum"},{"comment_id":"10154180577936770","commenter_b":"no he isn't","commenter_a":"He is violating the constitution again. Smh.","post_message":"Liberals are accusing Donald Trump of implementing a \"Muslim ban\""},{"comment_id":"1208679672504821","commenter_b":"She is the most disrespectful woman in the world","commenter_a":"How sick","post_message":"IN CASE YOU MISSED THIS YESTERDAY: @webpagelink"},{"comment_id":"10154054771666574","commenter_b":"Thank you Senator @username. Please stand up to this narcissistic demagogue who is the president. Please encourage your Republican colleagues to stand up to the POTUS and his white nationalist advisors.","commenter_a":"A Free Ukrainian and freedom for Chechnya, Dogestan, Alania, Ingushetio, North Osseha, and other ethic republic under Russian occupation.","post_message":"President Donald Trump’s call with Vladimir Putin is scheduled to take place amid widespread speculation that the White House is considering lifting sanctions against Russia. For the sake of America’s national security and that of our allies, I hope President Trump will put an end to this speculation and reject such a reckless course. If he does not, I will work with my colleagues to codify sanctions against Russia into law. In just the last three years under Vladimir Putin, Russia has invaded Ukraine, annexed Crimea, threatened NATO allies, and intervened militarily in Syria, leaving a trail of death, destruction, and broken promises in his wake. Russia’s war on Ukraine has killed over 10,000 Ukrainian soldiers and civilians. Russia supplied the weapons that shot down a commercial aircraft over Ukraine and killed 298 innocent people. Russia has conducted a massive military buildup along NATO’s eastern flank, conducted large-scale military exercises, ..."},{"comment_id":"10152875626591051","commenter_b":"Yep.. she should have her vehicle towed for parking in the handicap spot. That will give her an attitude adjustment real quick!","commenter_a":"The American Disability Act will allow the police to fine this nasty man. I'd call the police. Let them handle him.","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"762801500520430","commenter_b":"The poor girl just can't make up her mind, if you want to call it that.","commenter_a":"She is an idiot!! Just like most spoiled rich people!","post_message":"Hypocrisy, much?"},{"comment_id":"1323274761102106","commenter_b":"Hillary is for WALL STREET, BIG BANKS and CORPORATE WELFARE!!!! Bernie was right!!! Don't let her steal our COUNTRY🇺🇸#NEVERHILLARY","commenter_a":"I think it's great that the majority of America is holding him accountable for being a sexual predator.","post_message":"Hillary Clinton is leading Donald J. Trump by 15 points in Virginia, up 8 points from two weeks ago."}]
