[{"comment_id":"10153400579000329","commenter_b":"He's all yours, ladies lol","commenter_a":"Greg Paul Rachelle Krista","post_message":"His name is Brock O’Hurn and he's the king of man buns."},{"comment_id":"10153359522561051","commenter_b":"I'd be waiting every day to catch those bitches.","commenter_a":"I hope she caught her in the parking lot.","post_message":"When this woman's 2-year-old son came home with these marks on his leg, she marched down to his school and demanded to see the surveillance footage. Now she's even more outraged."},{"comment_id":"10154805040466037","commenter_b":"WTF!!!!! You're the hypocrite. Vote for Hillary a baby killer","commenter_a":"Dumb heartless trump, there are civilians....women and children in Mosul. They need to get out before attacking the place. Hmmmm there's something called \"war crime\" if u attack recklessly as ur suggesting innocent lives will be lost... It funny how u don't support necessary abortion to save a mother's life but ur happy to kill many innocent civilians... Trump = fool bigly","post_message":"“We gave them months of notice. U.S. is looking so dumb. VOTE TRUMP and WIN AGAIN!”"},{"comment_id":"10153927537756350","commenter_b":"Glad she isn't winning the contest. Shallow personality and spoiled.","commenter_a":"He didn't need to interview her and ask for an apology, when he already did the same night the mistake happened. She's a spoiled brat looking for attention, and of course Steve Harvey is the way. What it bothers me more, is the fact that he and his family has been threatened, and the media still paying attention to her, she's greddy! #getoverit #sorelosers","post_message":"See Steve Harvey come face-to-face with Miss Colombia Ariadna Gutierrez, the contestant he accidentally crowned Miss Universe."},{"comment_id":"10153203503306130","commenter_b":"Funny how people attack Obama's character then defend this guy, it's very revealing really.","commenter_a":"Donald Trump scares you because he'll take away all your free stuff! Donald Trump scares you because he believes in working hard to get what you need, what you want. He will fix America and you will continue to whine and cry about your \"entitlements\" being taken away! Suck it up and go to work America!","post_message":"See a map of the world through The Donald’s eyes."},{"comment_id":"1056274324413039","commenter_b":"You ladies here are absolutely correct, with your minds guns are for killing, and yes you for sure do not need to own one. If a person thinks that guns are just for killing, they sure as fuck better not own one... Let's start a new asshole list and get some signatures that states, If you are a total fucking idiot that believes guns are just to kill shit, then you do NOT and will NEVER be able to own a gun. :) Hows that ladies better? I broke it down and separated the stupid shit you people come up with. Ok, lets hear whats next,...","commenter_a":"Gun nuts who needs loads of weapons and ammo suffer from paranoia. Paranoia is a mental disease. Any person, especially those with existing mental problems can have a psychotic break any time. People like this are dangerous to the rest of us.","post_message":"Nothing says \"I'm a good Christian American\" more than protesting a priest calling for peace."},{"comment_id":"10154057964035448","commenter_b":"Everyone go to Shannon's blog and tell him to shut the hell up","commenter_a":"Shannon Sharp is one big disappointment. What an ignorant clown he turned out to be. Hasn't a clue...just a great big mouth!!","post_message":"The Left will never learn..."}]
