[{"comment_id":"10153645226755399","commenter_b":"Totally feeding ISIS everything they want. Playing right into their hands. What a naive jerk. ISIS loves Trump.","commenter_a":"Hum. ISIS launches attacks in order to provoke a backlash against Muslims in the West in order radicalize them. Trump follows the ISIS playbook perfectly calling for an entire raft of outlandish actions against Muslims in America: ISIS Mission Accomplished. Donald Trump: ISIS Agent #1","post_message":"The GOP presidential frontrunner just went there."},{"comment_id":"10153659617321323","commenter_b":"What about the kids, which is the entire point of the article?","commenter_a":"Just one big difference here. Kyle has asked for privacy, and presumably won't be going voluntarily onto TV shows to discuss his divorce. The people that appear on his show do so voluntarily, so are obviously less concerned about privacy for their issues. Stop trying to compare the two. Theirs no hypocracy here.","post_message":"\"What does Jeremy Kyle think is more likely: that a child’s parent or parents appearing on his show will constitute a mere 49 minutes in their childhood, or that its ripples will magnify that car-crash public event enormously – grotesquely – into something that cannot fail to be formative, and endlessly repercussive in its damage?\""},{"comment_id":"10153566690418812","commenter_b":"Get those horny chicks out of there.","commenter_a":"This is a good reason why you don't have them in there or serving in combat.","post_message":"One former female corrections officer is providing an insider perspective on forbidden love behind bars: @webpagelink"},{"comment_id":"408767239311570","commenter_b":"@username, you are an idiot, we DON'T live in a democracy, our founding fathers set up a constitutional republic to keep \"mob rule\" from ever ruling. What do you suppose will happen when 51% of voters all vote for free stuff??? What needs to happen is we need stricter voting laws. No felons can vote, nbody that recieves public governmenet assitance can vote. Rules lile this would EXTEND the life of our country. People who think like you ARE what's wrong with AMerica","commenter_a":"None of them can be trusted but seem to get elected anyway!","post_message":""},{"comment_id":"10153299356731051","commenter_b":"@username IGNORE THE TROLL. NO FRIENDS ..NO SITE..NO BRAINS!!!","commenter_a":"Yes I agree with Trump make this nation great again","post_message":"Donald Trump wants to make America's military so powerful that the whole world will be afraid to challenge us. Would you like to see it happen?"},{"comment_id":"10153326562398812","commenter_b":"Oh really? If that had been me, or any other black woman in this country, our black asses would have been thrown under the Jail the first time it happened and my children would have been taken from me with no chance of hardly seeing them let alone getting them back! They would charge me with felony endanderment also! But these two ol'birds get a second chance to do it and even have entitled it 'Free Range Parenting'! Ain't that somethin'! Exploring their independence would happen when they are of the age of independence. If you still write them off on your taxes, you are responsible for them! And just what are these wonderful parents doing while these babies are at the park and walking alone through town for any demented minded criminal to snatch?? SMH! I tell you, it must be nice to live by your own laws and ...","commenter_a":"So it's now a crime for parents to let their kids go to the park? What are they suppose to do put them on a leash and take them out for walkies.","post_message":"UPDATE: 2 Maryland \"free range\" children taken into custody again: @webpagelink"},{"comment_id":"10155009134559411","commenter_b":"So why can't they do the same over here when the terrorists return","commenter_a":"Danes are fucked-up in the head except her. Brave and lovely lady ! You should run for whatever kind of Governmental election and you`d do very well. All the best to you .","post_message":""}]
