[{"comment_id":"656303624531597","commenter_b":"Fuck off bitch!","commenter_a":"What the hell does Mexico have to do with our policies, Take care of your own place and f-off Mexico.","post_message":"Claudia Ruiz Massieu, foreign minister of Mexico, has called on the U.S. to pass a new ban on firearms that she labels “assault weapons.”"},{"comment_id":"10153601498992383","commenter_b":"Well your opinions are wrong, ladies! What kind of military expertise do you have besides \"my husband served?\"","commenter_a":"this is getting way out of line.second marine shot at a shooting range at Camp pendleton?","post_message":"Our thoughts are with the family and friends of the Marine."},{"comment_id":"10157544266265206","commenter_b":"Pervert","commenter_a":"Manzoor Hassan @username ye kon ha ?","post_message":"“My heart dropped into my stomach, and I was immediately hysterical,\" the woman said."},{"comment_id":"1178158985635102","commenter_b":"OH PLEAZZZZZZZZZZZZ.....LMFAO..THIS IS BECOMING COMICAL...IDIOTS EVERYWHERE!","commenter_a":"It's not an anti trump its a protest against the president from mexico","post_message":"LIVE NOW: An anti-Trump protest in Mexico City."},{"comment_id":"543511749143213","commenter_b":"@username hell don't exist kid you will rot just like eveyone else when you die and are burried","commenter_a":"we aren't animals anymore we used our intelligence to go beyond that, why would we want to back track? I wouldn't want my kids seeing them sexual or not. Or my husband sexual or not. No matter how much we try to \"not sexualize\" them, they always will be and there will be women and men who will sexualize them. It's not hard to leave a fucking shirt on","post_message":"Women everywhere are freeing the nipple  but Facebook doesn't want us to show it. #MicCheckDaily"},{"comment_id":"635288009979398","commenter_b":"How silly. Some people will sign anything.","commenter_a":"idiot","post_message":"An online petition to remove all air conditioning from Department of State property has gotten more than 1,800 signatures since it was posted online Sunday."},{"comment_id":"790580904351473","commenter_b":"You shouldn't be in office if you can't stand by your convictions! You were elected b/c the voters trusted you! You were given a mandate to turn the tide in this Country! Now do it!","commenter_a":"gutless bast---s","post_message":"What are your thoughts on this reasoning? 'Many' Reps. Afraid of 'Retribution' If They Voted Against Boehner"}]
