[{"comment_id":"1052907811455998","commenter_b":"She looks like Hitler's nasty ass! THERE'S A PARTY GOING ON AND THE TRUMP TRAIN TO GET ON, CHOO CHOO, CHOO CHOO","commenter_a":"The left wing nuts see trump as a dictator. He's trying to follow the Constitution and our rule of law. What a bunch of morons","post_message":"Sarah Silverman is a _____________."},{"comment_id":"10153892633433812","commenter_b":"STFU","commenter_a":"Sex is meant for procreation. If you don't want kids the only sure way is to not have sex. Birth control, even when packaged correctly is not 100% I have had multiple friends become pregnant while properly using birth control. Stupidest reason to sue ever.","post_message":"More than 100 women are suing Qualitest Pharmaceuticals after they say they got pregnant while taking incorrectly packaged birth control pills."},{"comment_id":"10154296566836491","commenter_b":"Cristina Cojocaru","commenter_a":"I can do this.","post_message":"Prepare to be amazed."},{"comment_id":"10154486445542994","commenter_b":"There is no male. It is a transgendered woman.","commenter_a":"they beat his anus","post_message":"Courtney Purvis says she was attacked outside of a bar in Dearborn because she identifies herself as transgender."},{"comment_id":"1007373832677433","commenter_b":"Ronni: I wasn't sure if he was calling me a simpleton Repub dink or Palin? The sarcasm in my comment is fairly obvious, is it not? Like I would agree with that rabid bat shit crazy ass woman?","commenter_a":"Goodie bags filled with teddy bears and soccer balls would certainly entice me to leave my country for another.","post_message":"\"Knowing that Trump won on [immigration], it should empower you to go ahead and ask the candidates, 'What the heck are you thinking, candidates? What are you thinking when you're going ahead and actually asking for more immigrants, illegal immigrants, welcoming them in, even inducing and seducing immigrants with gift baskets of teddy bears and soccer balls?' \" Sarah Palin said."},{"comment_id":"1215472705166021","commenter_b":"No, slutty women are.","commenter_a":"I wonder how many these so called rape or incest abortions our taxes go to are really that or women lying. I'm sure planned slaughterhood and other abortion providers don't perform parternity tests.","post_message":"Like and Share if you agree!"},{"comment_id":"10153066527856336","commenter_b":"Please woman go troll somewhere else","commenter_a":"Poor guy","post_message":"Bristol Palin is engaged to Medal of Honor recipient Dakota Meyer – the Kentucky native is credited with saving the lives of 36 Marines, Army soldiers and Afghan soldiers."}]
