[{"comment_id":"694654787391766","commenter_b":"I'm suprised that asshole can even find a bathroom.","commenter_a":"The worst President in US history.........","post_message":"ISIS has officially declared they are coming to America. Obama needs to step up before it’s too late. Is Obama unfit to handle this situation?"},{"comment_id":"10155319935565294","commenter_b":"No! Our kids are getting more stupid every passing day! They NEED ALL the education they can get!!! :)","commenter_a":"No","post_message":"Should schools switch to a four-day week? Tell us what you think."},{"comment_id":"10152920542711107","commenter_b":"Yes! Stop her!","commenter_a":"Yes","post_message":"Can you and I get 10,000 more signatures on Facebook? Over 21,000 of you have sent your \"Stop Lynch\" Emergency Fax Petition through Facebook -- and your voice is being heard loud and clear. Momentum is building against her confirmation thanks to your outpouring of opposition. In fact, two previously undecided Republicans announced their intention to vote against her nomination. But you and I can't stop now. As you know, Loretta Lynch has proven herself to be an advocate for the lawless conduct of the Obama administration and not an advocate for the rule of law. That's why I'm counting on you to keep the pressure on and urge my colleagues to vote \"no\" on her confirmation. Sign your \"Stop Lynch\" petition right away!"},{"comment_id":"972010302845037","commenter_b":"Sick evil hag","commenter_a":"Someone should MOUNT HER, OR STUFF HER","post_message":"Why one big game hunter is NOT backing down: @webpagelink #CecilTheLion"},{"comment_id":"960437774039688","commenter_b":"Get the delegates and you win.. How would they screw him if he gets the necessary votes?","commenter_a":"If after winning FL, MO, NC and IL, Trump does not get nomination, Rubio and Kasich do not drop out... I with all my family and friends will never vote for GOP.. We will be life time democrat..Trump is better than all GOP candidates , if not trump than Clinton or Bernie is fine for me because GOP does not count out votes as votes... They want to do what they want.. They don't hear our voice...","post_message":"\"Donald Trump is one of the two most talented presidential candidates any of us have covered.” Mark Halperin Bloomberg Politics Managing Director Editor"},{"comment_id":"1763785047184730","commenter_b":"Nice mouth for a lady?","commenter_a":"and this is supposed to negate every racist, woman hating, derisive thing he's said in the past 9 months???? Fuck off!","post_message":"Do you support Trump?"},{"comment_id":"10150723689079999","commenter_b":"Krissy's a troll. Ignore her.","commenter_a":"Monstrous. No excuse. Over the course of 4 decades denotes a culture of abuse not an abnormality in behavior.","post_message":"At least 231 children who sang in a boys’ choir led by the brother of former Pope Benedict XVI were abused over a period of almost 4 decades."}]
