[{"comment_id":"10153708553274071","commenter_b":"@username Andy Lee when should we make the reso?","commenter_a":"Eric","post_message":"We ate live octopus at this NYC restaurant — and it was exhilarating."},{"comment_id":"10152902121277098","commenter_b":"Do you know any white girls from the sticks? Smh!","commenter_a":"White girls from the sticks are certainly the most psychotic!","post_message":""},{"comment_id":"497560420446120","commenter_b":"By voting for @username, you are wasting your vote. There is no way he can win the presidency. Besides, why would you vote for a person who supports amnesty. Amnesty is bad for America. It is bad for the state of Ohio. It lowers wages. And takes jobs away from Americans.","commenter_a":"We're just 3 days from Ohio. Chip in $10 or more right now to support our TV ad & critical grassroots programs! JohnKasich.com/TV","post_message":"Kasich Works Town Hall live from Heath, Ohio"},{"comment_id":"1143200309023611","commenter_b":"Neither is \"snakeshit ted\"","commenter_a":"Rubio is not going to make it!","post_message":"Pressure on Rubio to pull off win in Nevada"},{"comment_id":"10153827950153797","commenter_b":"Devastating but why didn't the mother have them in the first place ?","commenter_a":"Another child in the cruel system","post_message":"CHILD DIES IN CPS CUSTODY: Several days have passed since the mother of 6-month-old Aailyah was told, \"There's been a little accident.\""},{"comment_id":"10150787426639999","commenter_b":"I'd stay in line then.","commenter_a":"Police State: \"Get in line or we'll crack your skull.\" That's the direction we're heading towards if we let this continue.","post_message":"As the girl struggles, the officer whirls around and then slams her down onto a brick sidewalk."},{"comment_id":"473513952773114","commenter_b":"She lied about her heritage stealing the opportunity from someone truly deserving and you thought she was principled. Lieing Hillary, Crooked Hiawatha!","commenter_a":"All it sealed was the fact that the vote I thought I'd be casting for Elizabeth Warren in 2020 will have to be cast elsewhere. Then Candidate Obama nailed it in 2008 when he said Hillary Clinton will change nothing, but say anything. A few pressers with Elizabeth Warren won't convince me that Hillary Clinton has suddenly become more progressive. It will just let me know that Elizabeth Warren isn't as principled as I had hoped and thought.","post_message":"Locked hand-in-hand in Ohio, Hillary Clinton and Elizabeth Warren sealed a powerful alliance Monday that could help unify the Democratic Party and give Donald J. Trump nightmares."}]
