[{"comment_id":"1380514481968578","commenter_b":"You're way too late. It's all Hillary now #imwithher","commenter_a":"If you live in a state that has yet to hold a primary, join with Sanders and stop both Hillary and Trump. #nevertrump #neverhillary","post_message":"Ohio Gov. John Kasich will suspend his presidential campaign on Wednesday, a senior campaign adviser tells NBC News."},{"comment_id":"10153571120640779","commenter_b":"It's a bitch...","commenter_a":"Karma.","post_message":"USA Swimming, the national governing body of competitive swimming, has banned convicted rapist Brock Turner for life."},{"comment_id":"1369207093090488","commenter_b":"The woman is pure evil","commenter_a":"It's time for women to shine, it's Been over due. I'm so proud a women is going to be the next President of the United States 2016 for the 20th century","post_message":"LIVE: Democratic Presidential nominee Hillary Clinton speaks at Democratic National Convention."},{"comment_id":"937892139587360","commenter_b":"OF COURSE democrats WANT illegal aliens to vote. This would give them a VAST majority for all future elections. If this were to happen, the America that we know would cease to exist. ALL American citizens, regardless of party affiliation, must prevent illegals from being allowed to vote.","commenter_a":"What do expect it will help them to continue getting their freebies!!","post_message":"More than half the voters who identified themselves as Democrats in a recent Rasmussen poll said they believe illegals should be allowed to vote. Among all voters, more than one in three believes illegals should be allowed to vote. What do you think? @webpagelink"},{"comment_id":"1012141178845630","commenter_b":"She owes no one a child. Her womb is her business.","commenter_a":"maybe she used off gone on injection or pill or something instead off using nothing knowing there could be a small chance she could fall pregnant also there are alot of good people in this world who cant have kids she should off kept baby them given baby up to a loving family instead off killing a innocent life","post_message":"Woman uses IVF to conceive three kids - then has abortion for a natural pregnancy"},{"comment_id":"10153130654836973","commenter_b":"Having read the Koran and the bible, it's clear that ISIS is justified by their faith. And so where the bigoted bakers, Faith is not an excuse to treat others poorly. You say murder is never okay yet both books are full of it. You are intolerant of both the bible and the Koran. Yet you somehow think a bigoted bakers faith is an excuse? That's a double standards","commenter_a":"The intolerance level for religion on this thread is too dang high! Get yourselves together. If you're going to claim 'BE TOLERANT' to things, you gotta be tolerant to religion also. They will always exist. There will always be someone or some thing to worship or praise. Spirituality is a great thing. It brings positivity to people's lives. There's nothing wrong with that.","post_message":"But the story isn't as simple as nature versus religion, experts say."},{"comment_id":"10155025843208734","commenter_b":"Oh I remember lol","commenter_a":"Thats Ari Moran! I know him! Great officer!!!","post_message":"We're live in studios with Fairfax County Police Department's new bloodhound, Juneau! 😍❤️🐶"}]
