[{"comment_id":"1112768188788371","commenter_b":"This is his third baby mama. The guy is an absolute psycho and she is a dumb doormat.","commenter_a":"It's not about breastfeeding. It's domestic violence. He has strict rules for his partner, including this new one related to breastfeeding. He's a controlling arsehole.","post_message":"He wants his wife to stop breastfeeding when their son turns 8 months old."},{"comment_id":"1410976518925134","commenter_b":"like dying in the sea coming from Europe to steal Mexican and Native American land?","commenter_a":"I wish people would realize this is actually happening and innocent people are losing their lives! of course under ignorant trump supporters everyone is Mexican","post_message":"Donald J. Trump is already deporting people to Mexico  even if they're not Mexican."},{"comment_id":"1015570635171720","commenter_b":"he had a brick ..they can kill too","commenter_a":"\"Unarmed man tazed by police officer\" is what a headline will probably be","post_message":"Watch This Thug Learn Why It Never A Good Idea To Throw Bricks At Cops, BOOM!  @webpagelink"},{"comment_id":"10153223686721336","commenter_b":"Why is she still walking around and not in an orange jumpsuit?","commenter_a":"Is she resigning? That would help B'more get better.","post_message":"Moments ago, Mayor Stephanie Rawlings-Blake said Baltimore will get through the devastation of the last few days and that the city will only get better."},{"comment_id":"1325820547439790","commenter_b":"I would've knocked this old bitch out, no joke @username","commenter_a":"\"If you don't know the language learn it \"she says.........ok .....maybe this old woman should re-learn her own language but properly because......you're a nobodies......isn't quite right and \"just because you come from another country it don't make you nobody\"....what does that even mean? Double negatives in sentences and conjugation the verb \"does\" wrong,,,,,smart woman yup","post_message":"This woman's racist rant just got her banned by the mall for life."},{"comment_id":"1211910735512691","commenter_b":"Duck you you racist old bitch","commenter_a":"Stop drinking you juice head.","post_message":"This racist woman went off on two Hispanic shoppers with a racist rant  and no one did anything to stop her.  More on this story here: @webpagelink"},{"comment_id":"1219528801419908","commenter_b":"^^^dumb bitch","commenter_a":"The one and only way it could have been prevented was if he complied with the officers instead of resisting after being tasered twice and thrown to the ground.","post_message":"CASE CLOSED....  @webpagelink"}]
