[{"comment_id":"10153973412478854","commenter_b":"Move your black Ass ,no one cares.","commenter_a":"U Have Become Despicable & Have No Class.","post_message":""},{"comment_id":"1402181823177264","commenter_b":"He wants all Muslim refugees to stay there......","commenter_a":"GOOD FOR THEM , EVERY STATE IN THE UNION SHOULD DO THIS !!","post_message":"Victory for the Constitution!!"},{"comment_id":"1075179569197597","commenter_b":"Crooked Worthless Hillary for Prison","commenter_a":"You brag about being a grandma on your Facebook page. Why don't you stay at home with your aides? Give your grandkids cookies and milk. America is a great country that influences the world. It needs a strong leader. POTUS is not a position for the weak and feeble.","post_message":"Danny Williams and his wife Leah lost their home after Trump University took advantage of them."},{"comment_id":"1415750351836830","commenter_b":"She was with the head writer of SNL and the woman who plays her on SNL skits. They All suck!!!","commenter_a":"id bet they were laughing at each other because they couldn't decide who was SKANKIEST.....","post_message":"Hillary raised a lot of eyebrows with her dinner guest..."},{"comment_id":"10153798223993132","commenter_b":"All white women fear intelligent black women!","commenter_a":"Im not at all surprised that a group of loud, obnoxious, self-important women threw a fit. Don't be disrespectful to other passengers, and then demand respect. You're not above others.","post_message":"But it may be too little, too late."},{"comment_id":"678779465606192","commenter_b":"Woman you are so ignorant!","commenter_a":"Well hillary killed people so she should be arrested and u should be to for sticking up for her","post_message":"It's funny how that works, isn't it? Like Addicting Info for more great content!"},{"comment_id":"10156069283810354","commenter_b":"@Kristin ... \"you serious Clark?\" is a quote from the movie Christmas Vacation : )","commenter_a":"Well, when schools in a Tennessee district are banning the USA flag, why not the gay pride flag?","post_message":"“...police reportedly confiscated a gay pride flag…” Will the Left ban the gay pride flag now?"}]
