[{"comment_id":"10153894151651782","commenter_b":"So if people have an issue with racism in this country they should leave?? How dumb","commenter_a":"I'd make sure they get no government grants or assistance! Way to keep division strong!","post_message":"A Massachusetts college says it will remove the American flag from its campus: @webpagelink"},{"comment_id":"10154208108446717","commenter_b":"I want to punch that bitch in her ugly face","commenter_a":"Disgusting.....","post_message":"His sympathy is with the first responders, and not the victims."},{"comment_id":"976274442437807","commenter_b":"I never liked her fake ass!!!","commenter_a":"Yes.","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"10155180907040649","commenter_b":"@username You are right but the other way around Soros running Obama and Hillary. They all need to go. God be with us all. Trump needs us more now than ever. Pray people and I mean pray as hard and often as you can. We will also fight them tooth and nail if need be and its looks like we are going to have to. Just stay awake, stand up no giving up and no giving in, we will not be taken down and we will win.","commenter_a":"They're rioters, not protesters. Well paid radical left-wing thugs. Call it like it is...and find out who's backing these people.","post_message":"Question of the Day: Do you think President Barack Obama and Hillary Clinton should condemn the violent left-wing protesters?"},{"comment_id":"635476119976300","commenter_b":"And we are apparently buying her cigarettes for her, good for nothing jackass. Where are the FATHERS, let those suckers pay for their babies they fathered!","commenter_a":"Deport !","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"10156146715050354","commenter_b":"Who the fuck is indoctrinating children?","commenter_a":"It is what perverts do !","post_message":"Cha-ching! Tax dollars, y'all!"},{"comment_id":"10154441251316756","commenter_b":"Dousing has been around for a long time.","commenter_a":"Funny how those diving rods never find the plumbing or septic tanks..","post_message":"Our reporter says the rods she was holding \"forcefully cross[ed],\" without her moving them. She doesn't know how it happened."}]
