[{"comment_id":"10153084060819330","commenter_b":"I. Jesus. Side. Way. I am not. Crazy. Even. With. Alzheimer. If. He. Every. Receive. Jesus. He. Still can. Today","commenter_a":"Elvis with his wings bowing his head.","post_message":"Do you see the angel in this ice formation on a porch in Bristol? Audrey Totire sent us this See It, Share It photo after her friends noticed the image of what they say looks like an angel.  What do you think?  See more top photos from the week here ---> @webpagelink"},{"comment_id":"1611331605832486","commenter_b":"Just the fact that Hillary has a list long enough to get e locked up for life, and she's still a president candidate shows how rigged the whole system is...","commenter_a":"Lier.","post_message":"“Of course the elections will not be rigged. What does that even mean?”   President Obama called Donald J. Trump’s claim of a rigged election “ridiculous,” saying \"At the end of the day it's the American people's decision.\" @webpagelink"},{"comment_id":"1510912668928758","commenter_b":"The choice is simple one's a white supremacist with thousands of racist supporters.....and the other is a woman that rubs you the wrong way","commenter_a":"What a surprise","post_message":"The endorsement will run in Sunday's edition of The Times — a day before Hillary Clinton and Donald J. Trump go head-to-head in the first presidential debate."},{"comment_id":"931439316891490","commenter_b":"And the POPE lives in the woods!]","commenter_a":"It may as well be true. He always lies and is immoral and evil.","post_message":"Is this true?"},{"comment_id":"1279104212107002","commenter_b":"Women should have curves, she's beautiful!","commenter_a":"Love this woman. She is funny and embraces who she is","post_message":"You're beautiful, Melissa McCarthy!"},{"comment_id":"10154526253322464","commenter_b":"Want to bring some refugees? Bring the Yazidi!!!","commenter_a":"We want to live in peace I Yazidi from Iraq There's no one feels Us #StopYazidiGenocide #StandforYazidiWomen #StopYazidiGenocide #StandforYazidiWomen Nadia Murad","post_message":"Washington Examiner: Oklahoma Obamacare plans face 76 percent hike.  #FullRepeal: @webpagelink"},{"comment_id":"10153630601128433","commenter_b":"America the beautiful, oh how I miss her. Being offended is the new status symbol.","commenter_a":"Of the 13 attacks, how many went unanswered? How many were abandoned during the attack by their own chain of command? How many had their back up team be ordered to stand down? How many were blamed on a YouTube video?","post_message":"As Hillary Clinton testifies at a House hearing on Benghazi, a lot of you are digging back in our archives to look at a fact-check about past attacks on U.S. diplomatic personnel overseas. @webpagelink"}]
