[{"comment_id":"10156946534115093","commenter_b":"Hillary will trounce Trump because 70% of voters dislike Trump. That's the math.","commenter_a":"Ya use your own mind governor vote trump don't be an establishment governor. Trump is who the people want.","post_message":"Governor Mike Pence should exhibit the leadership that conservatives have come to expect from him."},{"comment_id":"590301711160408","commenter_b":"She looks to be about 100 years old in this photo, Ban her ugly mug from FB","commenter_a":"When she becomes a licensed nutritionist then maybe somebody might listen to her. Her plan not only sucks but it is no where near the enough food. A child needs more than 200 calories for lunch.","post_message":"What Michelle Obama is banning now is just plain unacceptable. The American people are tired and finally fighting back. Do you agree Michelle Obama should mind her own business?"},{"comment_id":"10153320749437439","commenter_b":"Appeasement increases Islamofasism. Now, go study, @webpagelink","commenter_a":"I can't believe you. Yes you are free to be as stupid as you want. But one of these days you are going to be the cause of the death of some innocent person. Shut up and go away you dumb bitch.","post_message":"Going live on @jaketapper The Lead on @CNN to discuss jihad attack on free speech #garlandshooting"},{"comment_id":"960663503945907","commenter_b":"If you don't love her(America) then leave now !","commenter_a":"Good bye Felicia!","post_message":"U.S. students jump off deep end: Renounce America Now it's official. Many American students want to have nothing to do with the U.S., and they're pressing for this astonishing action."},{"comment_id":"10153341180476545","commenter_b":"Didn't a Muslim refugees came to U.S.A and took part in 9/11? So yes we have seen American Idol attacked be a refugee","commenter_a":"Funny... I do treat people the way I wish to be treated, I have not once cut off anyone's head.","post_message":"Their voices: Both sides of the Richardson mosque protest VIDEO: @webpagelink"},{"comment_id":"10153043180073984","commenter_b":"Finally someone with a backbone. Why is the rest of the media supporting this evil by not showing the world their true nature?","commenter_a":"Close this guy and his mosque DOWN...","post_message":"Wow, what this guy tells Hannity about the awful Paris terror attack - how he defends the killers' actions...well, see for yourself.. Do you believe radical Islam is the enemy of civilization?"},{"comment_id":"10153953005567464","commenter_b":"Norma Pickford love your BS where you get it from? @webpagelink","commenter_a":"I trust you to do the right thing for America and the workers of America. Don't weaken. You keep doing your part and I will keep praying to the Lord to bless us with yo uh in the Whitehouse","post_message":"Politico reports Obama's Department of Labor is using H-1B foreign workers while many Americans are jobless. That is wrong. The H-1B visa program is broken and I have a plan to fix it: @webpagelink"}]
