[{"comment_id":"1007362382702564","commenter_b":"That's uncle Ernie sitting on the eggs","commenter_a":"@username get off of here!","post_message":"ONE EGG IS HATCHING! Eaglet Watch 2016 continues as Harriet and her mate M15 wait for their two eaglets to hatch. One egg began to crack yesterday! Fingers crossed we get an eaglet today!   Once an eagle egg begins to crack, it can take 12 to 48 hours for the eaglet to fully hatch.   Live video: Southwest Florida Eagle Cam MORE: @webpagelink"},{"comment_id":"10153883413908797","commenter_b":"Wayne if weren't a firefighter then don't offer an opinion you don't know anything about, the twit woman had it coming!","commenter_a":"They didn't have to do it. .could've went over her car and just give her a ticket","post_message":"DRASTIC MOVE: Look close. That’s Yasmine’s car. The windows are smashed and a fire hose has been pulled through it. Firefighters say they had to do it to get to a house engulfed flames. And they point to what Yasmine did just minutes earlier as the reason. Do you think she has any right to complain?"},{"comment_id":"1296306160407617","commenter_b":"I hope that VA dentist is in JAIL!","commenter_a":"No one at the VA loses a job; for any reason. The 2014 fudged wait list debacle resulted in no nurse or lying administrator losing a job or even pay. The VA is a corrupt leviathan in need of elimination. And with my first hand knowledge of the organization, I would put a bullet in my temple before becoming a patient in the system.","post_message":"Absolutely horrific! This department needs to be cleaned out top to bottom, and people need to be punished for letting things get this bad."},{"comment_id":"10154589153096336","commenter_b":"The only place Hillary should be is in prison! #trump2016","commenter_a":"MAY HAVE???????","post_message":"Newly released emails suggest a senior Hillary Clinton aide stage-managed her first hearing on Benghazi by feeding specific topics to Democratic Senator Robert Menendez. @webpagelink"},{"comment_id":"450075515174329","commenter_b":"Jamal Mercer you realize that Plymouth Rock was landed in 1620 and that formal America wasn't til 1776. So your way off on \"over 500 years\" more like 200 years. And the majority of this country was built by Irish and Chinese labor not black. How come for hundreds of years Irish were slaves, yet Irish people don't use it as a crutch and a complaint of why they can't do something. 6 million Jews killed in the holocaust, that was from 1933-1945 that was roughly 1350 a day for 12 years. Yet Jewish people don't use it as a crutch and a complaint why they can't do something. Neither one of these groups were given nearly as much entitlement as the black community.... Yet the black community still complains that it's not enough that they can't get ahead. And yes most people look at black on black crime and ...","commenter_a":"What pisses me off is people that deflect this issue with Black on Black violence. Like y'all don't know that we just got rights in this country 50 years ago and the subsequent aftermath of white supremacy for over 500 years is the reason we live in impoverished areas with the shittiest schools. Y'all DO know that those circumstances breed violence right? Don't act like White men have not committed the most violent atrocities in this country since it's inception. Don't act like your \"discovery\" of America wasn't simply genocide. Don't act like multiple billion dollar industries that people still reap the benefits of today and in the future weren't built on free labor that black people don't see a penny of. Read sometimes. You will know why the black community has violence. Still to this day the most heinous crimes and serial murders are committed by white men. Sandy ...","post_message":"This story keeps evolving."},{"comment_id":"10152881196379753","commenter_b":"So would you rather have the Transgender in the men's bathroom? Chances are SHE Is attracted to men. So would you like HER to go in there and check you guys out? Should lesbians have to use the men's bathroom then? Fucking. Ignorant","commenter_a":"Everyone should boycott planet fitness \" Political bullshit run foul again! Hope the woman sues there ass off.","post_message":"This woman thought she saw a man using the ladies locker room at her Planet Fitness. When she complained to the front desk, they responded by cancelling her membership.  Should transgender men who identify as women be allowed to use women's bathrooms/locker rooms?"},{"comment_id":"1563692830591111","commenter_b":"@username We don't need to build a wall... we need to make all employers use E2Verify, get our Congress to quit allowing corporations to import H1b and H2b workers... Then move military bases from sanctuary cities and put them along the border...use the open spaces for war practice and bombing ranges to collapse the tunnels.","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, preserve the sanctity of the unborn life, preserve the sanctity of the 2nd amendment ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness","post_message":"We cannot pretend the problem does does not exist. We need to build the wall- in order to make America safe now-- and for future generations!"}]
