[{"comment_id":"10153296243781130","commenter_b":"So if this chick had aids and she was bleeding all over, that's cool right?","commenter_a":"And in the meantime virtually no attention was paid to the actual winner of the women's race, Tigist Tufa. Instead the media focuses on this woman and her disgusting stunt. Why am I not at all surprised that Huff Post jumped on the bandwagon.","post_message":"\"Periods are here to stay, and our generation has the power to put this conversation on the map today in order to blow through stigma.\""},{"comment_id":"1205288416198545","commenter_b":"in tears watching this. God keep him with you and give the family strength and patience to heal.","commenter_a":"Priceless....God bless this little tyke and his family and friends..","post_message":"WATCH: 6-year-old boy killed in SC school shooting laid to rest dressed as Batman at superhero-themed funeral: @webpagelink"},{"comment_id":"10156270295245354","commenter_b":"Illegals voting in California this should give the liberals some help. GO Trump !!!","commenter_a":"They focus on Gun Control, in the Debate, they will lose the Election","post_message":"Here's what's on deck for tonight's Democrat presidential debate..."},{"comment_id":"10154295592708132","commenter_b":"A woman's ribs shouldn't show like that. That is not a healthy body.","commenter_a":"I think she looks great - no doubt about that but remember she has access to so may resources such as chefs, nutritionist, top motivating trainers, laser tightening, etc. Not to mention there is definitely not a daily 9-5 job in her day and don't forget adding in a few nannies to help out as well. All of these resources help alleviate stress and carve out time for you to focus on yourself. All that alone is a great cocktail for motivation.","post_message":"Spring has sprung for Britney Spears!"},{"comment_id":"1026033040752819","commenter_b":"And all those boobs in a row on display.","commenter_a":"I feel like the word \"leggy\" came up a lot in this article. As if the author was sorta fixated on this one thing about the girls who tormented her and swift in particular in a sorta Freudian way. Like, \"The evil reign of Taylor Swift, with her forever legs, way too long to be street-legal, stretching between pencil skirts and slightly worn Converse, glossy in the pink-frosted Malibu dusk... Um, I mean, hen culture and mean girls and stuff.\" I don't necessarily disagree with what she's saying, but she is really, really aware of Taylor Swift's legs.","post_message":"If T Swift and her squad rub you the wrong way, you're not alone. Here's why."},{"comment_id":"10153808334131337","commenter_b":"Y should people have to log out of FB cause they don't like her?","commenter_a":"If you don't like her and don't like hearing about her then I don't know keep scrolling, log out of Facebook, go on about your life!","post_message":"Oh, sure, Kim Kardashian West..."},{"comment_id":"10153715195470736","commenter_b":"NO>>NO..these are always a waste of tax payers money and benefit Corps...and I don't want MORE people here..","commenter_a":"NO!!! no no!!! such a waste.","post_message":"Would you want Oregon to host the summer Olympics in 2028?"}]
