[{"comment_id":"1043155299071968","commenter_b":"She is disgusting.","commenter_a":"She's scummy just ignore her 5% I Q","post_message":"JENNIFER LAWRENCE Recalls Attending Same Concert As Trump: “I was adamant on finding him and then making a video of me going, ‘Hey Trump, f*ck you!’” [VIDEO]"},{"comment_id":"10152820989551615","commenter_b":"I would be putting her inappropriately dressed (?) fat butt right out of the \"prom.\" She LOOKS like a moderately dressed hooker! Maybe that is closer to the truth than one might think.","commenter_a":"Wouldn't be necessary if the CHILDREN and their PARENTS actually knew how to dress appropriately.","post_message":"“You can't put ten pounds of mud into a five pound bag.\" One parent is threatening to sue for sexual harassment over a school handout about the dress code for graduation. It’s a story we’re talking about this morning on Channel 11. @webpagelink"},{"comment_id":"925323364324906","commenter_b":"@username yes it was look at the lady who ran it she has ties to hamas open your eyes","commenter_a":"There was no pro Sharia Law March. There was a \"we don't want a president calling women who disagree with him fat pigs\" march. A \"no man has the right to give another man permission to call his daughter a piece of ass\" march. A \"why would you take away funding from violence against women programs as one of your very first acts as president\" march. A \"don't remove health insurance before you have another plan in place march\".","post_message":"Ayaan Hirsi just took the gloves off. She couldn't let this go unnoticed, and neither could we. Do you agree with her?"},{"comment_id":"10152879295577623","commenter_b":"A lot of girls are...","commenter_a":"Worst part is...SHE looks like she was cute,pre meth...","post_message":"A man and woman from North Carolina were arrested in Louisiana and face charges of manufacturing meth."},{"comment_id":"1114940968546374","commenter_b":"One man and one woman, Not 4 men and one woman. Stone her!","commenter_a":"Maybe she have life in prison since she likes jail so much.","post_message":"This is honestly what it's all about..."},{"comment_id":"10155208349228690","commenter_b":"JEWS also believes in exactly the same GOD we worship,,,the one and only,,,,,They call him Hashem,,,,and have other name in Hebrew,,,,ISLAM allows MUSLIMS to EAT koshered MEAT ,,or animals slaughtered by Jewish rituals,,because they also recite name of our / their GOD,,,,,so this MEANS ,,Islam has accomadated both MUSLIMS JEWS christians to LIVE side by SIDE,,,understood,,but ones who LIE may NEVEr admit this,,,","commenter_a":"They steal their land, they're destroying their houses, they're spoiling their olivers, they're arresting children and abuse them, they're using chemical weapons against them, they're isolating them, making them starving, they're bombing hospitals, ... And they're blaming palestinians for throwing them stones and hating them ! Should they give you flowers?! Go ahead Palestinians! May Allah bless youuu","post_message":"Eshaq Abu Jibneh suffered the injuries in a brutal attack in a West Jerusalem public square last summer, belatedly recognised by Israeli authorities as a hate crime."},{"comment_id":"10153445067641051","commenter_b":"She is a selfish bitch with no sense of humor for leaving him.","commenter_a":"I don't blame her. What a shame that he had to get drunk! Now suffer whatever it takes to get rid of other!!!","post_message":"This wife took one look at the tattoo her husband decided to get and immediately kicked him out of the house."}]
