[{"comment_id":"1241511662632276","commenter_b":"Send his ass to jail","commenter_a":"Send him to jail","post_message":"This thug-in-training tried to act tough by sucker punching this white 12-year-old boy with a pair of brass knuckles. Too bad for him the District Attorney didn't think his brutal assault was as funny as he did... Now he's going to see what the real word is like! SHARE and let us know what you think should happen to this thug-in-training! @webpagelink"},{"comment_id":"10154133671460950","commenter_b":"There was only 1 person who refused to vote guilty all 12 have to agree, this piece of shit refused to vote guilty. There were 11 people who voted guilty","commenter_a":"Its the south and besides he had an all white jury and he shot the man in cold blood it was caught on camera and the jurors call it a mistrial","post_message":"WATCH: Judy Scott, mother of Walter Scott, reacts to a mistrial being declared in Michael Slager's trial: \"It's not over 'til God says it's over.\" @webpagelink"},{"comment_id":"10153200811382377","commenter_b":"I'll agree with you on that , but it still doesn't change my position on accepting unvetted refugees !","commenter_a":"So he just declared the Obama administration a terrorist group then !!","post_message":"British Prime Minister David Cameron: \"The Muslim Brotherhood is not the only movement that promotes values which appear intolerant of equality and freedom of faith and belief.\""},{"comment_id":"10154453531128256","commenter_b":"I can see a domestic violence commercial. You go girl","commenter_a":"Well, question how do you work shooting or showing a weapon into a McDonald , Pepsi , Kentucky Fried Chicken, Nike commercial? Just asking, maybe that's why no offers.","post_message":"While companies like Winchester, Beretta and Otis Technology support Team USA's Kim Rhode, she doesn't have a single sponsor from outside the firearm industry."},{"comment_id":"376409252547369","commenter_b":"She is a looser","commenter_a":"THUMBS DOWN!! Pitiful excuse for a human being. Hard-working Americans don't get $112,000 in benefits. THIS IS SO WRONG. Stop the money and see what she does.","post_message":"One more Welfare Moocher..."},{"comment_id":"396582543845311","commenter_b":"Richard J. Lindner She Did Commit Perjury, Destroyed Evidence Under Subpoena GET OFF THE H-TRAIN","commenter_a":"Repost: Federal Law: Title 18. Section 2071 Can it be any clearer? Former United States Attorney General Michael Mukasey tells MSNBC that not only is Hillary Clinton's private email server illegal, it \"disqualifies\" her from holding any federal office. Such as, say, President of the United States. \"If you do this or that bad thing, you've essentially disqualified yourself as being the leader of the free world,\" said Mukasey, referring to the illegal server and the illegal handling of classified materials. Mukasey specifically points to one federal law, Title 18. Section 2071. For those of us who do not have United States Code committed to memory, here's what it says: (a) Whoever willfully and unlawfully conceals, removes, mutilates, obliterates, or destroys, or attempts to do so, or, with intent to do so takes and carries away any record, proceeding, map, book, paper, document, or other thing, filed or deposited with ...","post_message":"BAM!"},{"comment_id":"10153089785921491","commenter_b":"Ah , the range of a true lady.","commenter_a":"Love everything about her, even though I'm now aware of an intimate and amusing detail of which I had't really given much thought.","post_message":"Interviewers, beware: do not mess with Amy Schumer."}]
