[{"comment_id":"10153608463849440","commenter_b":"You are so uneducated, illiterate and pathetic. Worthless. Parasite. A rodent of no worth or accomplishment.Stop #WhiteGenocide 14/88","commenter_a":"Colorado is the epicenter of #WhiteGenocide and the GOP here is allowing it because they're afraid of calling Amy E. Brown and her #Blacklivesmatter5280 terrorist friends out.","post_message":"Editorial: Colorado Republicans made a big mistake in abandoning the 2016 presidential caucus."},{"comment_id":"868283350028908","commenter_b":"Those women are a group of sick , twisted bitches. But their outlook is the killary twist. Blame the victim . You bitches make all women look bad.","commenter_a":"Take conservative Fox with you","post_message":"This is absolutely shameful. Get this liberal trash off the air immediately. Can we get 30,000 'LIKES' to have this show shut down?"},{"comment_id":"10154566492298812","commenter_b":"@username you keep drinking the kool-aid","commenter_a":"If you can't emotionally tolerate a black man reaching for his ID and you pee your pants like a 9 year old girl scout, and you shoot him without ever seeing a gun, it's time for you to take off the police uniform and get a job where you will not be harmful to human beings and to society.","post_message":"Pres. Barack Obama: Attacking police officers, even rhetorically, does \"disservice to the cause\" of criminal justice reform. @webpagelink"},{"comment_id":"10153425250862217","commenter_b":"I had a design like that when I was in seventh grade in 1993. It was an idea from Dick traci and knight rider. Knight could talk to kit with. Glade it took so long for this to happen 23 years was all! lol","commenter_a":"Yall now getting this lol to late","post_message":"It's a lot more hi-tech than our day. Times tables written on our arms was the height of sophistication back then..."},{"comment_id":"10153491435486880","commenter_b":"Wal-Mart will fall fast, probably years from now when \"Fresh\" is in Full Force! @webpagelink","commenter_a":"Cj Gennaro","post_message":"Amazon.com had a really good day."},{"comment_id":"1189675974461986","commenter_b":"@username she will not loose","commenter_a":"The real problem is Bernie Sanders is NOT a democrat! No wonder he and democrats are having a problem. He should have run on his own party-- as the socialist he is.","post_message":"It's not just the Republican Party that seems to be having a problem uniting..."},{"comment_id":"433011990220428","commenter_b":"good hope the NIGGER DIES","commenter_a":"I likt being mean but he hevhe i loveĉit","post_message":"Will he be able to finish his second term?"}]
