[{"comment_id":"1082496428446957","commenter_b":"Taxpayers fund churches!! Churches don't pay taxes! Planned Parenthood is doing a service that they are legally allowed to preform because there are women choosing to have those services done. Christians have no right do insist this be stopped just because of their religious beliefs. I'm sick of Christianity being all high and mighty thinking that it is the end all be all of decision making for everyone else on the planet. Not everyone is a Christian and not everyone must be. Defund your churches!! Make the churches pay taxes!! Every time a Christian stops an abortion make a Christian take in an illegal alien and put him/her through school/college!! Stop hiding behind your bible and pretending to actually care about the embryos because we all know when you're not cursing abortion your wishing gays would go away and praying extra hard that your children won't turn out to be ...","commenter_a":"You know what's really ironic? Your religious organization doesn't pay taxes yet you're complaining about the money spent on abortions. Another thing is that you want to stop abortions but there's starving children right there in your neighborhood and your church and its congregation all have food on their tables, cars, cell phones etc. Then, you even complain about paying for birth control because it goes against your religious beliefs but then you expect non Christian tax payers to pay for your churches. In addition, you believe that your Christianity should trump my rights as a woman and you should decide what I should do with my body because of what your bible says. Well, I'm telling you NO!! Abortion is legal and its going to stay that way because of people like you. Women like me will always be here to stand up for our rights not only just ...","post_message":"Planned Parenthood has made a business out of destroying that which God has created. The one-sided relationship between it's ever-growing bank account and American taxpayers must be severed. That is why I introduced the 'Defund Planned Parenthood Act of 2015.'   #ProLife #DefundPP"},{"comment_id":"10154345626992549","commenter_b":"First off Executive orders are largely symbolic. Building a wall will do absolutely nothing for illegal immigration and drug trafficking other than to satisfy the small minority of Americans who voted for Trump. The tax payers will have dole out billions to build this 'wall' without benefit. You can't even call this a viable 'infrastructure' project. I do agree with deporting illegal criminal offenders and would go even further by deporting criminals with legal but non-permanent status. Not only from Mexico but anywhere. Ireland, Israel, Africa, etc...","commenter_a":"Isolationism does have consequences.","post_message":"This afternoon, President Donald J. Trump is expected to order the construction of his long-promised wall along the U.S.-Mexico border and take other executive actions on immigration. @webpagelink"},{"comment_id":"10154829556541425","commenter_b":"Go home","commenter_a":"Thank you all for standing up against bigotry and stupid trump!!!","post_message":"We are live at JFK Terminal 4 arrivals #MuslimBan #MuslimBanprotest #nobannowall"},{"comment_id":"570070006492803","commenter_b":"Beat trump I. Want a Christian men with a back bone .we can live better cleaner an safer","commenter_a":"I bought what I was getting for Christmas before Thanksgiving so that I could concentrate on the ultimate gift , Jesus.","post_message":"Hello everyone, I wanted to make sure we had some time tonight to spend with each other. As always, remember to keep sending me your questions via text to ASKBEN (@username on your mobile phone).   There were many questions from all of you asking “what is one of your favorite things about Christmas?”     Honestly, I love to see the look on everyone’s faces as they open presents – that’s the best part for me, seeing the look children have in anticipation of a gift. During this season, I always try to remind myself of the greatest gift…our savior Jesus Christ.   I know that many of us spend the week leading up to Christmas frantically rushing around buying presents, our time occupied with “how much to spend” on loved ones, rather than spending much time occupied with those loved ones. It’s about relationship, not retail. We should remind ourselves of that more often.   It is easy to become distracted by the world when we are constantly being bombarded with competing priorities, our time becomes monopolized by differing pursuits and positions, fleeting moments that will pass. Our true pursuit should be everlasting, one that cannot be wrapped in bows, it does not perish. It is peace. It is good news, in pursuit of others as we share with those we encounter. Just as we are now, you and I, sitting here together sharing this moment in time, these are the moments that do not fade or wither upon snow’s first falling – this is the season to be joyous with one another, lift others as He has lifted you, our hands united in hope.   That is why Christmas is special to me – I am reminded of the greatest of gifts every time I see my children and grandchildren’s faces. Hope.   Thank you for sharing your evening with me, I look forward to many more.   Goodnight, Ben"},{"comment_id":"10150722681504999","commenter_b":"'@username It seems to me that you are the uneducated one, very stupid also!","commenter_a":"Bringing a knife to a gunfight, no sane individual would attack a police station full of armed police with a knife. Religion really plays no part in this. Surely the man needed mental health treatment?","post_message":"Officers fatally shot a man who was wielding a knife and yelling “Allahu akbar” as he tried to attack a police station in Paris on Thursday."},{"comment_id":"10152715652847293","commenter_b":"Way to bury your head in the sand. Typical liberal","commenter_a":"we have chosen not to see the film because we don't support war/killing...either way, the good thing is it got people thinking/talking...or, at least, trying to talk/think...","post_message":"Regardless of what Bradley Cooper wants, his movie American Sniper has become political."},{"comment_id":"1466756690087245","commenter_b":"Flynn has resigned!!!","commenter_a":"IMPEACH TRUMP NOW","post_message":"'I think this guy is somebody who might want to think twice about whether he stays in the position that he has.' -- Bernie Sanders"}]
