[{"comment_id":"1274781525895650","commenter_b":"A+ student in everything but Math... Since I finished school 20 yrs ago I've never had to use Algebra...not even once.. It depends on your career, I guess..","commenter_a":"If you're too dumb to pass algebra, then you shouldn't be allowed to graduate High School. Then, you should be forced to live the rest of your life working at Wal-Mart with all the other people that couldn't pass algebra...or even worse, be a Fox News contributor.","post_message":"The willingness with which these people embrace ignorance is baffling."},{"comment_id":"1059501164087223","commenter_b":"a little racists are we? I don't see any white ladies up there dancing with her.","commenter_a":"nope didn't see it,...who is beyonce?","post_message":"Not so subtle."},{"comment_id":"546660998833704","commenter_b":"Yes! Please Do not get into Roe vs. Wade! It is settled law. Let women decide this issue.","commenter_a":"Ben, the worst thing you could do tonight in the debate will be to fall into the liberal media's trap. CNN CNBC and the rest of the liberal media wish to turn this debate unto a boxing rim once again. At the end, it will hurt the Republicans and that is the liberal media's purpose. They intend to make you fight Trump. They want to bring you down, the liberal media though. DO NOT FALL INTO THEIR TRAP!!!!!","post_message":"Thank you for all the kind words of encouragement leading up to the debate tonight. I know I don't stand alone, as We the People stand together to Heal, Inspire and Revive. Please make sure to send me your pictures throughout the day and during the debate at bencarson.com/standwithben!"},{"comment_id":"944852772272626","commenter_b":"Those skank lesbians should choke on the next thing they eat.","commenter_a":"Ten Reasons for Supporting Trump 1. Donald Trump is immune to special interest lobbying because he has accepted no donations or special interest money. No other candidate can make this claim. 2. Donald Trump knows how to negotiate. No one builds an international business empire the size of Mr. Trump without being able to win at the negotiating table. 3. Donald Trump is an executive. The President of the United States is the Chief Executive Officer of our nation. We don need a policy expert or a legislator we need someone who knows how to run an organization. Mr. Trump is the only candidate who has a proven record as a successful executive on a large scale. 4. Donald Trump is honest. Mr. Trump is a man who tells the truth. He may not always say it in the most polished way, but our country has had enough suave liars. ...","post_message":"\"...for emotional suffering....\""},{"comment_id":"600515870151925","commenter_b":"I'd say the dog has reached that point because it is being handled incorrectly. I'd put a spot light on the Obamas for not treating the dog properly and training their girls on how to treat the dog. Dogs don't lash out just like that. It would have to have been constantly mishandled. Like that stupid heavy jewellery around the neck for instance.","commenter_a":"I don't think they need to sue, if he takes financial responsibility for the cost of the injuries.","post_message":"Should they soak the Obamas for big bucks? (Or at least some sort of political favor?) Wealth being spread around. That the Obama way, isn it?"},{"comment_id":"10153055349059170","commenter_b":"Nah he's not Indian. Fake birth certificate. He wants his muslim army to overtake America.","commenter_a":"Bobby has it right. He's a great Patriot. Would make a great president.","post_message":"To those who want to silence talk of God - because they're afraid of how it will affect election outcomes - reconsider your priorities. Looks like Bobby Jindal has this right. (And in no way did he mean what is critic here thinks he meant.)"},{"comment_id":"1089512117777571","commenter_b":"YEP CLINTON RAN TO CANADA","commenter_a":"Blame Carter. If he hadn't pardoned Clinton for draft dodging we wouldn't be in this pickle.","post_message":"SHOCKING VIDEO: US Marine Booed, Removed From Clinton Rally For Asking Legitimate Question WATCH THIS! @webpagelink"}]
