[{"comment_id":"561305640738010","commenter_b":"Yeah men can't back out....it's called child support lol","commenter_a":"Men should be made accountable and pay all money through a court.","post_message":"We couldn't agree more!"},{"comment_id":"10153051963761350","commenter_b":"Honorary Dame in England is a big honor -","commenter_a":"I'm a fan Angelina you too pope francis","post_message":"First comes being named an honorary dame by the Queen of England, and now Angelina Jolie is shaking hands with the pope!"},{"comment_id":"10154488301629228","commenter_b":"Good God she's a monster","commenter_a":"This woman is a liar, she lied to the police about Betsy Faria's death and her role in it and tried her best to imply Russ had killed his wife. Why she's not in jail is beyond me. I think this new story stinks to high heaven and hopefully the O'Fallon PD does a very through investigation. This woman is dangerous, avoid her for your own safety","post_message":"'For him to be alone at all is shocking for me.  He doesn drive.  He doesn leave the house by himself."},{"comment_id":"1038152239553568","commenter_b":"She is dumb","commenter_a":"Guess she will have to work for a living now","post_message":"This model lost everything."},{"comment_id":"714422425388653","commenter_b":"Get out of this country!!! The USA was great until you damn Devils Muslims started to come here!!!","commenter_a":"I don't care. Take that shit off. What do you have to hide. You want to wear it , wear it at home.","post_message":"She filmed it.   WATCH the video very closely..."},{"comment_id":"1136613006364478","commenter_b":"He told that woman to 'GO AND SIN NO MORE,' @username. Jesus calls even a single divorce for ANY reason one thing: '... ADULTERY!' ~ JESUS 'THOU SHALT NOT COMMIT ADULTERY!' ~ GOD 'JUDGE YE RIGHTEOUSLY!' ~ GOD ~ JESUS","commenter_a":"Mark 10:10-12 In the house the disciples began questioning Him about this again. And He *said to them, “Whoever divorces his wife and marries another woman commits adultery against her; and if she herself divorces her husband and marries another man, she is committing adultery.”","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1766066213681675","commenter_b":"'@username trophy wife No. 3 was a soft porn model who also lies like through her teeth. No wonder she squints so much, trying to find her sugar daddy's pee pee!","commenter_a":"'Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s.' --Melania Trump","post_message":"'Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s,'  Charles Harder, a lawyer representing Trump, said in a statement."}]
