[{"comment_id":"1321278027895520","commenter_b":"@username The only thing she can do is race bait and pay for play. Everyone sees it now. Clinton lies like a RUG .She tries to make everything a race issue it is Economic issues. All Americans , she is the one race baiting .How can she and her friends think they can run the Country when they can`t even control their Husbands ? She didn`t take long to throw a well respected Black General ,Colin Powell under the Bus to cover more of her lies ? She also says Trump supports KKK views ? His grandchildren are Jewish for crying out loud. When will liberals wake up ? How do ya get Rich working in the Public Service","commenter_a":"The only thing she can do is race bait and pay for play. Everyone sees it now. Clinton lies like a RUG .She tries to make everything a race issue it is Economic issues. All Americans , she is the one race baiting .How can she and her friends think they can run the Country when they can`t even control their Husbands ? She didn`t take long to throw a well respected Black General ,Colin Powell under the Bus to cover more of her lies ? She also says Trump supports KKK views ? His grandchildren are Jewish for crying out loud. When will liberals wake up ? How do ya get Rich working in the Public Service ?","post_message":"Thank you for the great feedback on my Immigration Speech last night in Phoenix, Arizona. I am grateful for everyones support. I want to thank the ANGEL MOMS - who I met last year when I began campaigning. I am truly humbled by their courage and bravery - they are truly INSPIRATIONAL to me. I love the United States of America - and it has been so good to me. I want to MAKE AMERICA SAFE AND GREAT AGAIN - with you, the American people. -DJT"},{"comment_id":"10154288676688445","commenter_b":"Ding Dong: who's there? Your local sheriff lol","commenter_a":"Throw them in the fireplace and share the lovely smell with the whole neighborhood!","post_message":"Grow Q&A: What Can I Do With The Pot Leaves I Trimmed Off?"},{"comment_id":"10152979635977483","commenter_b":"Then ban the naacp bitch","commenter_a":"This flag was specifically adopted In response to the civil rights movement.. the confederate flag should be banned across the u.s point blank period","post_message":"\"Just by the outpouring of support I've gotten from all over the world, I know for a fact I'm doing the right thing,\" said Belinda Kennedy, owner of Alabama Flag & Banner."},{"comment_id":"10155589079690354","commenter_b":"both pigs","commenter_a":"Odd is right Tyranny lives","post_message":"Adorable...."},{"comment_id":"10153242310616336","commenter_b":"Well what does Baltimore have to say now? I just can't believe those two cops were harassing those two nice men.","commenter_a":"They thoght they could get away with it!","post_message":"UPDATE: A third suspect has now been arrested after the shooting prompted a statewide manhunt.   The suspects accused of killing two Mississippi police officers in the line of duty were reportedly arrested early this morning."},{"comment_id":"10153817855231955","commenter_b":"@username Dude your girl looks like a dude!","commenter_a":"That's okay. Iowa hasn't picked a winner in 16 years, looks like they are keeping up the tradition. Keep thumping your bibles you inbred corn growing losers.","post_message":"CRUZ WINS IOWA"},{"comment_id":"982872948473970","commenter_b":"These people are what is wrong with America! I can't wait for them to occupy Canada","commenter_a":"these are the hate american soros funded kids who still live at home and hacve ebt cards and dont pay for health insurance..","post_message":"DEVELOPING: Leftist Radicals in New York City and Arizona launching anti-Trump uprisings...TRUMP PROTESTERS BLOCK ROADS TO PHOENIX RALLY....MORE..."}]
