[{"comment_id":"1222107054548141","commenter_b":"Fucking weird bitch","commenter_a":"@username @username wdf","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"902219749819813","commenter_b":"Mad gangs are those who want to draw another map. If a woman doesn't want you will you force matters. Ukrainians and other countries don't want Russian. For then to survive they want a friend indeed to protect them to the aggressor. PUTIN","commenter_a":"NATO is the biggest ever gangster-organ./ bunch of WARCRIMINALs.. existed on earth.. and as such.. the biggest threat to world-peace of our time..","post_message":"A top Russian military commander says Moscow considers NATO missile installations in Eastern Europe “priority targets.”"},{"comment_id":"640100692862928","commenter_b":"Trolls- in 4 years we have elections again- what if next time the candidate you don't like cheats to win? Will you be OK with a corrupt election system then?","commenter_a":"THEY HAVE A RIGHT TO TRY TO STOP IT JUST LIKE YOU THINK YOU HAVE A RIGHT TO DO IT.","post_message":"The fight for #Recount2016 continues! We deserve a voting system we can trust, that is accurate, secure and just. Despite the sabotage, political cronyism, bureaucratic hurdles, economic extortion, and legal maneuvering that has been thrown in our way, this historic first-ever multi-state presidential recount carries on. I'm here to give you the latest updates, answer your questions, and talk about next steps."},{"comment_id":"10154746753444657","commenter_b":"@username, while I agree that security along our border is non existent and with the possibility of terrorist using it to their advantage it needs to be dealt with. I think it's a complete fallacy that illegal immigration should be such a focal point in this election. Its not our biggest problem. Our growing deficit and out of control federal government seem to be a bigger threat to our country!","commenter_a":"We are going to loose this election while small minded people focus on small minded things. Stock footage and former adult stars in commercials aren't going to destroy this country the people are! Because they can't seem to focus on the problems we are facing and examine the solutions of the candidates.","post_message":"Oh, the perils of stock footage."},{"comment_id":"388174341307161","commenter_b":"Why not let seniors work and draw social security. Count married people as two on tax returns this would generate more taxes. People would spend more money. Only the very handicapped should not have to work. People on welfare that are capable should have to do community service. They should b drug tested and have valid I'd Think of solutions instead of calling names. Cut out the waste. We need solutions","commenter_a":"Then why don't they shout it out, let their scared party from the Tea baggers know it has to be done, but I'm sure none will stand up to them.","post_message":"Do you agree with this poll?"},{"comment_id":"335857396538054","commenter_b":"There is no climate change that is your agenda","commenter_a":"Does this arrogant, smug, condescending community organizer and failed President REALLY want to compare resumes with the Donald? More evidence of how delusional he is and how stupid he thinks we all are.","post_message":"“I think foreign observers are troubled by some of the rhetoric that’s been taking place in these Republican primaries and Republican debates. I don’t think it’s restricted, by the way, to Mr. Trump.”  During a press conference earlier today, President Barack Obama slammed Donald J. Trump and other GOP presidential candidates while continuing to tout climate change. @webpagelink"},{"comment_id":"509824199177535","commenter_b":"^ Then stop posting your shit on our news, we honestly couldn't give a fuck about you dumb cunt Americans. Continue shooting each other, I need more wanking material.","commenter_a":"\"More guns!\" -Americans","post_message":"DEVELOPING: The search for the suspected gunman continues this morning."}]
