[{"comment_id":"1267200936634248","commenter_b":"Childhood whooping cough measles mumps etc","commenter_a":"There is no mention of what vaccinations it is about, only that it will be forced. I don't really see this article as useful to anyone lol","post_message":"No jabs, no benefits."},{"comment_id":"10153836514883797","commenter_b":"Why don't young ladies have enough sense to do background checks on these idiots before they shack up with them, have kids with them...","commenter_a":"Omg that's so sad","post_message":"HEARTBREAKING: Cecelia has just moved with her two children from the Detroit area for a better life. But Friday night, her ex-boyfriend used a dog leash to strangle her and her two boys. The last thing she ever said to her mother before her death will break your heart:"},{"comment_id":"1044157185605292","commenter_b":"Wikipedia that hoe","commenter_a":"Let's be real, we never went to the moon.. We did not have the technology to go through the Van Allen radiation belt. The astronauts would had been cooked alive.","post_message":""},{"comment_id":"10154104100243132","commenter_b":"#2. he likes ugly chicks","commenter_a":"Just be happy... The beginnings are the best!","post_message":"New year, new romance for Amy Schumer!"},{"comment_id":"1017113771678485","commenter_b":"@username no dont get mad because Hillary is a corporate puppet slave and black people dont like her!!!","commenter_a":"Sorry black folks don't like Hillary","post_message":"Speeches, selfies and heart-to-hearts: A look inside Hillary's recent events in African American communities."},{"comment_id":"10153401491811323","commenter_b":"Talentless bleeder only got a gig in the first place because she was a woman.","commenter_a":"Was this the same BBC that was busy implementing their towards 2000 policy at this time?","post_message":"“I was told by the producers that they preferred my version, but the channel decided they couldn’t have a woman in charge.”"},{"comment_id":"10153446320724087","commenter_b":"I want a woman too, but not a liar, cheap, and a phony","commenter_a":"Fuck no to Hillary. Hell yeah to Feel the Bern!!","post_message":"“It’s imperative that you vote. I want you to vote for [Hillary Clinton]. It’s time for women to be seen as real equals,” soccer hero Abby Wambach said at an event for the Democratic front-runner. “That is one hell of a badass woman in my opinion.”"}]
