[{"comment_id":"10153605570044205","commenter_b":"I held the door for a woman once and she said \" What you think I can't open my own door?\" Aaaaaaaannnnndddd I quit opening doors for women","commenter_a":"Also this bitch is a joke... i live in texas and shes just a narrowed minded republican raised by republicans... look how much make up she has on... lets guess what she cares about. Gtfo with your nonsense... and dont talk about men not holding doors for girls.... you women killed it. Hardly anyone says thank you... you are basically expecting it but not acknowledging it. So we took it away. Bitches always pointing the finger at men like we are always in the wrong. No fuck you.","post_message":"Alexis Bloomer has taken to social media to give a speech on why her generation is so self-centered."},{"comment_id":"10153202654871107","commenter_b":"Deport all 30M illegal aliens.","commenter_a":"This makes me so angery that our government cant even enforce laws already there, time to replace everyone of our politicians for not doing their jobs and getting caught up with deal making, sick ,sick of it, PUT MORE INS AGENTS ON THE JOB AND GET ALL OF THE ILLEGALS OUT NOW!! and may I add i'm sick of politicians asking for money to do their jobs this includes you Mr. @username!!","post_message":"Our nation now has whole cities and states who stand up and willingly defy federal immigration laws in order to protect illegal immigrants who have broken our nation’s laws. This must end and it must end now. Today, I introduced legislation in U.S. Senate that would cut federal funding to cities and states who refuse to follow our immigration laws. My bill makes it clear, the American people will not stand for cities harboring violent criminals. But I need to know if you are with me. Please sign your \"Enforce Immigration Law\" petition right away, then consider chipping in $20.16 or more to help me spread my message to voters in early primary states."},{"comment_id":"1857403831172162","commenter_b":"If brains were dynomite these broads couldn't blow their tampx loose.","commenter_a":"Reality sometimes is in our face This just the beginning","post_message":"Classy!"},{"comment_id":"10153997969131770","commenter_b":"No we want our WALL","commenter_a":"I bet she does. I want the wall right now.","post_message":"Mexico foreign affairs minister says her dream is OPEN BORDERS, with no walls."},{"comment_id":"1588983808072440","commenter_b":"Why are gender confused women so ugly??","commenter_a":"Very dangerous! Students looking for a leader. Maybe a Pol Pot?","post_message":"“I’m never going to argue with people’s feelings,” she says... before explaining why she rejects the feelings of conservatives who have been silenced."},{"comment_id":"1317863694976546","commenter_b":"She is not his type","commenter_a":"Hillary paid them","post_message":"BREAKING Trump campaign adviser A.J. Delgado tells Brian Williams the allegations of inappropriate touching against Donald J. Trump aren't credible."},{"comment_id":"10153321016436051","commenter_b":"What kind of a twisted 'person' would do that? She belongs in a lock-up hospital.","commenter_a":"Anyone who does this when they are very young, will be sorry as they get older---","post_message":"Remember the woman who did this to an innocent animal? Well, she just got some bad news."}]
