[{"comment_id":"929005763900127","commenter_b":"Not as pathetic as your lying Hillary.","commenter_a":"Trump even takes a GOOD idea like term limits at EVERY level of elected governing and ruins it with his hate, ignorance, and by being the WORST candidate for President ever his pathetic nothingness and lack of depth daily shows how weak and what a fraud this TRUMP is. Pathetic. LISTEN LEARN THINK FEEL and VOTE smart.","post_message":"Donald J. Trump has vowed to limit House members to a 6 year term and Senators to 12 as part of his broader plan to \"drain the swamp\" and reduce the amount of influence lobbyists have in Washington.  Read more: @webpagelink"},{"comment_id":"10152763354566051","commenter_b":"kill the bitch","commenter_a":"They need to wrap her head completely in duct tape !!","post_message":"When her fiance broke up with her, this woman decided to make his 3-year-old daughter pay."},{"comment_id":"10153496846973132","commenter_b":"I highly doubt they kept having them JUST to have a girl.","commenter_a":"How selfish, to keep having kids only hoping for a gender. That 13th boy will someday realize he was only born because his parents hoped he'd be a girl.","post_message":"Maybe the 14th time's the charm?"},{"comment_id":"10154595854899203","commenter_b":"It has nothing to do with civil rights get real. If the NFL wants security they can hire their own. The police are voluntary for the game.","commenter_a":"Pathetic. A cop's job is to protect and serve, not protect and serve who they agree with. Bad cops.","post_message":"They are furious with Colin Kaepernick."},{"comment_id":"10153902236123812","commenter_b":"The native Americans should have stopped accepting immigrants. They wouldn't have lost millions of life's by those terrorist immigrants!!!","commenter_a":"ISIS doesn't need to be in America. Has everyone forgotten about the mass shootings that happen almost every day now? They can easily recruit here and never step foot on American soil. Blind hatred is still hatred.","post_message":"LATEST: Mississippi joins Ohio, Florida, Illinois, Indiana, Louisiana, Arkansas, Michigan, Alabama and Texas in refusing to accept Syrian refugees in wake of #ParisAttacks."},{"comment_id":"415728535218854","commenter_b":"David, you're the world's largest pussy","commenter_a":"the FACT that America is the worlds largest and foremost terrorist breaks my heart because most of the people in this country are better than that but our government sucks shit and has brainwashed them.","post_message":""},{"comment_id":"10153742340973812","commenter_b":"Just drop your Facebook account. We'll all be happier and you can be crazy all by yourself with no interruptions.","commenter_a":"Please post worthy news and not perversion... Next will be pedophiles wanting to marry little kids.","post_message":"Meet James Yates and William Smith, Jr., the first same-sex couple to get marriage license in Rowan County, KY. This was their sixth attempt to get a marriage license."}]
