[{"comment_id":"10154815795872936","commenter_b":"Maybe Canada would take us. They always wanted the Pacific Northwest.","commenter_a":"The rest of the country is dragging California down.. do we really have to be in the same union as knuckle draggers Mississippi, Kentucky, West Virginia, etc.? I'm beginning to agree that California should secede, go our own way.","post_message":"Gov. Jerry Brown's fiery take-down of Donald Trump: \"We've got the scientists, we've got the lawyers, and we're ready to fight.\""},{"comment_id":"1004919146212988","commenter_b":"I absolutely agree, bit discouraged by the corruption of our politicians which when it comes down to it is our own fault. But Liberty, freedom, and the right to self determination are Gods greatest gifts.","commenter_a":"agree","post_message":"Do you agree with Calvin Coolidge?"},{"comment_id":"10154308673266178","commenter_b":"They have NO rights if they are in this country illegally.","commenter_a":"If you want to protest, you have every right. When protesting and you decide to escalate your actions by using violence, you are not only breaking the law but also trying to infringe on other people's freedom of speech.","post_message":"The LA Times gets political over the Trump protests.  Here's their biggest concern..."},{"comment_id":"10153784197573132","commenter_b":"Dig these hard chicks","commenter_a":"Way to go ladies! Proud of you. You are true role models.","post_message":"True role models."},{"comment_id":"10154242646146336","commenter_b":"Lots of ladies in Texas have CHL (concealed handgun license) enter at your own risk!","commenter_a":"Caitlyn Jenner is harmless. But lots of creeps out there will go into the women's room to do things other than pee. It's only a matter of time before we hear the horror stories. Be careful ladies.","post_message":"Donald J. Trump said this morning that he does not agree with North Carolina passing a law on bathroom use by transgender people.  He added that if Caitlyn Jenner visited Trump Tower she could use whichever bathroom she prefers. @webpagelink"},{"comment_id":"624113881076675","commenter_b":"He's a freaking idiot!! Hitler reincarnated!! Good on Miley","commenter_a":"No, obama acts like that, lol","post_message":"Miley Cyrus is not a Donald J. Trump fan."},{"comment_id":"853456421380774","commenter_b":"She can only be arrested if she goes to Egypt so best she stays away . But good she speaks out","commenter_a":"Good","post_message":"Clooney’s wife threatened with arrest."}]
