[{"comment_id":"10154080413671162","commenter_b":"You must be a star chaser or useless female cop.","commenter_a":"What a bunch of ignorant aholes....do me a favor and NEVER CALL THE COPS to help your pathetic selves...none of you are worth it....all loser thug scum bags","post_message":"Police say they were trying to pull a car over when it smashed into their patrol SUV in the Loop."},{"comment_id":"10153089105414753","commenter_b":"I had twin daughters at 18, me and their mother had been married over a year when she got pregnant. My daughters have NEVER been abused, so yes teens can be good parents. This is a fucking offending question","commenter_a":"A lot of adults do the same to. Their children and i was a teen parent without any help and my children are fine and i am married now so it had nothing to do with him being young","post_message":"Should teens be allowed to have babies? What do you think should happen to this 19-year-old father? @webpagelink"},{"comment_id":"10153745269073984","commenter_b":"that bitch needs to be in prison, hell yeah she and this country need her to just go away.","commenter_a":"Yes. She is wasting our time!","post_message":"A Fox News correspondent just revealed one surprising thing about this Hillary event that you won't see on TV, and it's definitely an embarrassing moment for the Clinton campaign.  Do you think Hillary Clinton should drop out of the presidential race?"},{"comment_id":"10150526412169999","commenter_b":"Fact","commenter_a":"Davey","post_message":"Exercise — and, in particular, weight training — after weight loss could stop unwanted pounds from creeping back on."},{"comment_id":"755539251303319","commenter_b":"Send the bitch to jail and strip the bed sheets off of her","commenter_a":"Your in US lady you must obey the law... I'm sure when your in Muslim country your not even allowed to drive ....","post_message":"Burqa-Clad Woman Pulls Race Card On Cop, Gets Brutal Wakeup Call That's not how it works in America... Sorry. Do you think she got what she deserved?"},{"comment_id":"1364153086957478","commenter_b":"Let's hope NOT. NO MORE COMMON CORE! NO ON ROMNEY! KEEP your PROMISES!","commenter_a":"I agree.","post_message":"I wonder if Conway is behind the 'new' Trump?  The whole 'lets leave Hillary alone'... and 'lets talk to Mitt about being Sec of State'... and 'lets hire a pro-common core Sec of Ed.'.....  It's getting harder to stay smiley faced.  We can only be pushed so far.  Enough of Mitt.  Dump him.  Give Rudy G. the job of Sec of State TOMORROW. Not only is he talented, but show some loyalty to the guy who stuck his neck out.  Stop making the man sweat it out, and start supporting the platform we voted for.  Walk the walk already.  @webpagelink"},{"comment_id":"979662915464481","commenter_b":"Shut up bitch","commenter_a":"there is no cure for stupid!","post_message":"Jesse Jackass rides again. Check out THIS crap. UNREAL. @webpagelink"}]
