[{"comment_id":"1047246341998727","commenter_b":"Illegals should have NO rights in voting, wokring or anything here....PERIOD.","commenter_a":"You gotta get all the brainless and illegals to stop voting democrats, its the democrats that arm criminals but prevent legal law abiding people to legaly arm themselves","post_message":"Hillary and Bernie want taxpayers to cover healthcare for illegal aliens. What do you think?"},{"comment_id":"1089862507690725","commenter_b":"NO!!! Girls are NOT Intelligent enough, Athletic enough, Independent enough, Mechanically minded enough, Wood Working enough, Outdoors enough, Tough enough, Strong enough, Brave enough, Work Hard enough AND are Too clean, Too emotional, Too femine, Too Goofy PLUS don't like Spiders, Roaches, Vermin , nor Bats. Need any other reasons?? Let's stop being so PC and keep the girls where they belong, in the House, Kitchen, Laundry Room, barefoot, definitely barefoot and making babies. That's GOD'S will!!! If you don't agree, we can just have the BOYS join the GIRLY Scouts. BTW, I'm a LIBERAL, oSCUMa, Kerry and HITLERy lover!!! Can't you tell.","commenter_a":"No-they have girl scouts.","post_message":"Should girls be allowed to join the Boy Scouts?"},{"comment_id":"902494896546891","commenter_b":"I told you I was going to get her out","commenter_a":"'@username she's a chunk! Pictures were a lie! 😁 She's out @username lol","post_message":"Our camera caught the middle school teacher who reportedly got pregnant during an affair with an 8th grader as she left the jail. We had questions, but she didn't have any answers. Full video: @webpagelink"},{"comment_id":"10153539588391037","commenter_b":"these pigs should have never been given the attention.","commenter_a":"If anyone believes the Duggars are all better now, please let your kids do a sleepover there and let us know. We'll wait for your report","post_message":"After weeks in limbo stemming from revelations of Josh Duggar’s sexual misconduct, the reality show 'will no longer appear on the air.”"},{"comment_id":"10154034198879749","commenter_b":"And here we have it ladies and gentlemen. You see, when you dare to question one of these social justice creatures and it becomes apparent that absolutely none of their arguments hold up to scrutiny, they start with the personal attacks just like they've been taught. Thank you Tracy, for showing us all just what an utter lack of both argument and character you possess. Why don't you pop off back to Tumblr and tell all your sympathetic sisters how the nasty misogynist was harassing you.","commenter_a":"And if they end up working less hours, and being paid less as a result I'm sure we'll hear all about the sexist 'wage gap' a little more from the social justice cretins.","post_message":"A Bristol firm allows women to work flexibly at different times of the month to tap into employees' 'natural cycle to create happier working environments.'"},{"comment_id":"875427632505785","commenter_b":"I prefer to be even more accurate than that. The legal term is 'Illegal Aliens'.","commenter_a":"Hey Fox 10! I love you, but this has to stop! It's ILLEGAL IMMIGRANTS NOT JUST IMMIGRANTS! Immigrants are preserved for those who came here LEGALLY. GET WITH IT!","post_message":"More than 1,800 immigrants that the federal government wanted to deport were nevertheless released from local jails and later re-arrested for various crimes, according to a report released Monday. What do you think about these findings?"},{"comment_id":"10153823695146336","commenter_b":"FORGIVE HER AS GOD FORGIVES YOU....PUNISH HER IN OTHER WAYS..NO CELL PHONE..NO XBOX. ..NO TV IN HER ROOM..NO COMPUTER IN HER ROOM (ONLY FOR HOMEWORK OVERSEEN BY YOU)","commenter_a":"It's called tough love. That's what children need","post_message":"Would you cancel Christmas to punish your child for stealing?"}]
