[{"comment_id":"10152627692760950","commenter_b":"cathie stickna in your butt","commenter_a":"weird President","post_message":"President Barack Obama makes a few funny faces and uses a selfie stick in a new BuzzFeed video — and some politicians aren't happy about it."},{"comment_id":"1565531100423273","commenter_b":"WoW... I have never been to the USA, but i fear already for the Afro-americans living there now, after reading this comment (n)","commenter_a":"The ones the cops shoot, is because hey are criminals. Felons with weapons. Threatening others and getting the police called on them. All the others, is just fightin and being dumbasses. White people do that do. White felons and criminals get shot too. But since they are white, no one cares to make a news story.","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"1162973243743146","commenter_b":"@username haha why does she always look psychotic?","commenter_a":"Bristol Is Pregnant Again Because...","post_message":"Hypocrisy at its finest."},{"comment_id":"10153400709859474","commenter_b":"she will not tell the truth...","commenter_a":"What difference does it make","post_message":"Breaking: Hillary Clinton to testify before Trey Gowdy and the Benghazi Select Committee. Share to demand the truth!"},{"comment_id":"10153600653569062","commenter_b":"Usa, invaded my country,so they have to clear the mess that's,they did over there then we'll back","commenter_a":"All you Muslim loving people need to move to a Muslim country and enjoy your Muslims.","post_message":"Your thoughts on this? Roughly two dozen sign-wielding protesters repeatedly tried to vocally overpower speakers at Texas Muslim Capitol Day."},{"comment_id":"10154645739237178","commenter_b":"Rather have snow than ice in Wake Forest !","commenter_a":"Sketchy in so pines","post_message":"Winter weather update with WRAL Elizabeth Gardner. (Stick around for the end to watch a little gloating from Brian Shrader's Anti-Snow League)"},{"comment_id":"10156267037025354","commenter_b":"Why are illegals allowed to have a drivers license? Utter insanity!","commenter_a":"Jerry Brown is a putz! He should have been out of politics decades ago. Look at California. It's a disaster.","post_message":"It's starting."}]
