[{"comment_id":"10154087462891813","commenter_b":"Maybe after they have this 200,000 woman march on Washington Saturday for women's rights then maybe we'll finally get a female: Ambassador to the United Nations, Secretary of Education, Secretary of Transportation, Senior adviser to the President and first female to successfully run and win a Presidential campaign, female Director of small business affairs..preferential hiring for females and federal laws mandating all government workers and state workers and military personnel get the same pay for the same rank and experience? Oh and abortion on demand.....wait...","commenter_a":"powerful and mighty statement","post_message":"Today and every day, dissent is patriotic. #WomensMarchonWashington"},{"comment_id":"10153547475163812","commenter_b":"it is just showing Obama is gay and that monkey guy he calls a wife now can be legal","commenter_a":"so nig","post_message":"White House lit in rainbow colors following US Supreme Court ruling that same-sex couples have right to marry: @webpagelink"},{"comment_id":"10154662154026323","commenter_b":"God help America and American people if these two women get into the White House.","commenter_a":"The nastiest of women. Apparently Nasty women are UN shills hell bent on overthrowing the rule of law in America, and worldwide. Cunts.","post_message":"“Get this, Donald. Nasty women are tough, nasty women are smart, and nasty women vote, and on November 8, we nasty women are going to march our nasty feet to cast our nasty votes to get you out of our lives forever.”"},{"comment_id":"10153242618583132","commenter_b":"First Dr. Nancy Snyderman and now Brian Williams betrayed us!","commenter_a":"Yea a permanent one lol","post_message":"Brian Williams tells staffers that he is taking a break from NBC Nightly News amid his recent scandal."},{"comment_id":"975168222494648","commenter_b":"Not really , I was talking about little pussy Libtards like you Chucky boy !","commenter_a":"Yea , all money belongs to the Dear Leader. And he gives us only what we need or deserves ! Just look at how that worked out with Joseph Stalin !","post_message":"Oh no."},{"comment_id":"1296455407059683","commenter_b":"No they should be given sentences building the wall then deported for ever","commenter_a":"Agree","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154572108529087","commenter_b":"She should put on her fake Indian outfit on.","commenter_a":"WARREN IS A BRAIN DEAD DUMBACRAT !!!","post_message":"Elizabeth Warren: 'Congress must pull its head out of the sand and launch a real, bipartisan, transparent inquiry into Russia. Our national security is at stake.'"}]
