[{"comment_id":"10153828343101051","commenter_b":"You are a brave girl I'm happy you kids are out off that hell hole","commenter_a":"This so sick and so sad! I pray for these children are in a good foster home. The mother and the boyfriend and the other person go to jail for life. This child was very brave to email the teacher. Didn't anyone at school see that something was wrong with these kids? The boyfriend should be castrated! How can this happen in America?","post_message":"This teacher was reading her e-mails when she noticed a message from one of her students. Because of how young the kids in her class are, they rarely sent her e-mails. She realized almost immediately that something was wrong."},{"comment_id":"10153506474399342","commenter_b":"She's one of these \"innocent\" women that our cretin in the White House wants to allow in the US.","commenter_a":"What a mutt. I hope they shot her in that ugly face of hers.","post_message":"We're getting our first look at the female shooter in Wednesday's tragedy in #SanBerardino."},{"comment_id":"10153982167589203","commenter_b":"What a pussy cant go against his witch of a wife!!!!","commenter_a":"@username Lorenzo Antonino","post_message":"\"If we're not a part of the solution, we're a part of the problem.\""},{"comment_id":"10154010743370329","commenter_b":"Ooh I didn't know there would be another season?! Thought it was over!","commenter_a":"@username Aimee Fortune Jade Morgan @username","post_message":"Watch the first four minutes of the next season of Pretty Little Liars right now!"},{"comment_id":"10153759354128352","commenter_b":"She's a slut","commenter_a":"U can tell exactly who the sluts are on this post lol all the women who are defending her..","post_message":"Woman who was ‘slut shamed’ after her public threesome at Calgary Stampede went viral says she has no regrets – in video seen by 3.4million"},{"comment_id":"480993755358552","commenter_b":"She must be from NYC she can go to hell","commenter_a":"Screw her","post_message":"This Democratic congresswoman from New York just announced her plan to reduce gun violence. I wonder how it will be received."},{"comment_id":"10154735667991756","commenter_b":"Hamas is a disaster, as is Israel's abuse of Palestinians. There are hookworms on two sides, sucking the life-blood out of two peoples.","commenter_a":"Not my monkey, not my circus. Let's keep our dicks tucked away for now.","post_message":"Of 1.9 million Gazans, 1.4 million need humanitarian aid, and the United Nations directly helps 1.1 million. Robert Piper, the U.N.'s humanitarian coordinator for the Palestinian territories is worried Israel's charges against the two aid workers could exacerbate a large aid funding shortage."}]
