[{"comment_id":"10153939512524087","commenter_b":"@username .... Why would anyone vote for Hilary the war monger ? She stands for nothing that benefits American citizens... all she talks about is illegals and bringing in Muslims... blacks are totally used by her.... She dumps illegals in poor black communities... but will never have Muslims or illegals where she and her friends live.... people like you are a joke.. total fools.. and Trump is not a racist stick that card up your asss... its old used outdated game...","commenter_a":"After Trump loses in the election I wonder what's next for Republicans. Atleast he brung out the closest racist and exposed the Republican party for what it is","post_message":"Prominent Donald J. Trump critic GOP Sen. Jeff Flake had kind words to say about Trump following last night's nomination speech at the Republican convention."},{"comment_id":"10152538895247014","commenter_b":"Suck his dick already","commenter_a":"I bet his pay didn't get any cuts","post_message":"In his state budget proposal, Gov. Doug Ducey announced some big cuts to the state's universities. Now, the Board of Regents responds."},{"comment_id":"10153039009502217","commenter_b":"The pussy is slanted trust me","commenter_a":"Tradicional woman japannese, very good","post_message":"Japan really isn't that strange"},{"comment_id":"1738569013030719","commenter_b":"Hoe","commenter_a":"Alex Keira Keir Craig","post_message":"I'm gonna make love in this Snapstory with you, Usher."},{"comment_id":"10153809290224753","commenter_b":"She's a greedy mama! She's pathetic!","commenter_a":"Why do people keep making this disgusting family rich? They have no talent, nothing but yet people are infatuated with them please STOP talking about them, no one cares what they do!! And let's not start with that disgusting Jenner dude/lady wanna be","post_message":"Kris Jenner is ready to cash in on son Rob Kardashian and Blac Chyna’s surprising baby news. According to a new report by People, Jenner is reportedly looking at Kardashian and Chyna’s pregnancy from a “financial perspective” and is seeing some major dollar signs both for herself and the newly engaged couple. While some of the Kardashian and Jenner family were a little skeptical over the news that Rob and Blac are preparing to give Jenner another grandchild, People revealed that “Kris is... @webpagelink"},{"comment_id":"1065254780239751","commenter_b":"Yes he did !!!","commenter_a":"Good idea. Take questions submitted by the public and picked randomly. Put each at a table with a mic. Turn off the mic when two minutes is up.","post_message":"It wasn’t pretty. More like a street fight than boxing, but Trump fearlessly took the game straight to Hillary and made the next 30 days about her repeated lies and corruption and not his disgusting comments of 11 years ago. He often reminded people why he won the primaries by unapologetically hitting at failed policies of the elites and establishment from both parties. Trump needed to show contrast and he did. He is more a chain saw than a scalpel, but his cuts drew blood. And it’s time to get rid of the so-called moderators. Get a big clock and let the candidates go to the stage and take turns and get rid of the media personalities who want to debate the candidates. My advice to “moderators?” If you want to debate, become a candidate. Trump won the debate. That much I know."},{"comment_id":"902389386549543","commenter_b":"She is a fkn disgrace! #hilliaryforprison","commenter_a":"To all of you considering a third party vote or staying at home, facts show what that did in 2000. It gave us GEORGE BUSH. Remember Florida? Bush-2,912,790; Gore-2,912,253; Nader-97,488; Buchanan/Foster-17,484. Do the math. Please tell me, what good did that do? Are we way ahead of where we were 16 years ago? You know what Bush did. He appointed John Roberts and Clarence Thomas to the Supreme Court, gave us Iraq, Isisl and the Middle East, tax breaks for millionaires, FEMA during Katrina, the Great recession and the road to Trump. Read what \"Art of the Deal\" writer Tony Schwartz has to say about Trump and realize that it's better to have Hillary in charge while you use your outrage to build a party around progressives like Elizabeth Warren and Jeff Merkley. The unfortunate truth is, if you don't vote for Clinton/Kaine this year, we'll have Trump/Pence next year. ...","post_message":"\"Let’s go make history and elect Hillary Clinton the 45th president of the United States!\" —Tim Kaine"}]
