[{"comment_id":"10152535254222623","commenter_b":"It'd be great if people actually read, studied and paid attention in school and did something with their lives except screwing, rolling blunts, and figuring out ways to commit crimes.","commenter_a":"Look at the parents. Poor child","post_message":"A mother and father have been charged after police found video of a baby playing with a real handgun."},{"comment_id":"10154051432298445","commenter_b":"Listen you little bitch ur just mad because","commenter_a":"Come on they just want to get paid like everyone else....shut the fuck up and give them their chop...before you end up paying an arm and a leg for mr.college degree but cant find a job in the field i studied for...to show up and try to charge u 30% of ur crop this is America only place they have buffets js","post_message":"#TBT to 2015. 'trimmigrants.' had trouble finding work, created tension after arriving in Humboldt expecting trim jobs.   Humboldt friends - has the atmosphere changed?"},{"comment_id":"10152916992026749","commenter_b":"stfu","commenter_a":"Horrible man!!!!!!","post_message":"First Steps."},{"comment_id":"1807147956208492","commenter_b":"All of the above?","commenter_a":"'@username. We should try this..","post_message":"Winter just got a lot more bearable."},{"comment_id":"10153955830944087","commenter_b":"Never trust a woman in a white pants suit.","commenter_a":"No bitch, that's not how this works!","post_message":"#BREAKING: Hillary Clinton accepted the Democratic Party’s nomination for president Thursday, making history as the first woman to lead a major political party."},{"comment_id":"10153695954333984","commenter_b":"Carly should be in the prime time debate","commenter_a":"We need a female leader on that stage who isn't whining 'i'm so week and gutless I need a man or goverment to get me better pay and by my birth control for me.' A real grown up woman who can take a blow and still be standing. Go Carly go","post_message":"Despite a pretty big poll surge, this 2016 Republican candidate may be kept off main debate stage again...  Do you hope to see Carly Fiorina in the next debate?"},{"comment_id":"10153542250533812","commenter_b":"Chriss if you lease a car. Can anybody come in that vehicle and disrespect you. Chriss you happened to get a job that you get assigned a vehicle can anybody come tell you what and how. You're a smart man. You might get a job that requires you to move out of the state or even the country. That job comes with all expenses paid for four years including the house and the car. You tell me who can come in there and disrespect you. Not even the ceo or cfo of that company can do that without proper protocol. You had to move your family. And your doing your best job. Think about that chriss. YOUR A SMART INTELLIGENT MAN","commenter_a":"Pres. Obama. It is America's house we only let you borrow it for a little bit! Respect all people as you desire to be respected. You are in my house and every legal Americans house. Not that they were right but you are wrong!","post_message":"WATCH: Pres. Obama normally lets hecklers speak, but this time, he put his foot down: 'OK, you know what? No, no, no...'"}]
