[{"comment_id":"10153612601766336","commenter_b":"You know they wont. Shes gonna get a slap on the wrist.","commenter_a":"Lock er up!!!","post_message":"The DIA, the NSA, and the NGA, which oversees U.S. government spy satellites, confirmed to Catherine Herridge that the information was classified at the time and remains classified now."},{"comment_id":"1683425098577634","commenter_b":"It will never happen to that cockroach!","commenter_a":"Yes, it should have happened a long time ago.","post_message":"BREAKING: GOP Threatens Obama With Active Impeachment.  Stop threatening, and just do it already.  Would you be happy if they actually followed through with this?"},{"comment_id":"1720797558169853","commenter_b":"LOL.... The immigrants steal our jobs.... even our speeches!","commenter_a":"She did a great job last night!","post_message":"Join me behind the scenes at the 2016 GOP Convention -- as I introduce our next First Lady of the United States of America, Melania Trump! #MakeAmericaSafeAgain"},{"comment_id":"10153627073939170","commenter_b":"It's gone too far when instead of protecting himself he thinks of the headlines to come and takes a beating.. Time to put the animals back in they're cages.","commenter_a":"I don't have military training or police training but why couldn't an officer shoot towards the legs and feet to attempt to wound or even scare and attacker. I know you would have to worry about the femoral artery and even ricocheting bullets but I seriously doubt every round fired allways hits the intended target when trying to shoot at center mass.","post_message":"Way to go, media. The crooks know the score now and they're taking full advantage."},{"comment_id":"10152549413699071","commenter_b":"So true, reason why women throw themselves on celebrities","commenter_a":"Healthy man not attracted womens .attrating gods grace","post_message":"The most valued trait in a potential mate isn't beauty or wealth."},{"comment_id":"1053026444717108","commenter_b":"Good. She is druggy scum! She deserves to never ever see him again!!","commenter_a":"Mother, child bond, find away to keep them together","post_message":"PLEASE SHARE: Puyallup police are asking the public to be on the lookout for endangered 5-day-old Jeshua Taylor and his mother (pictured) Myra Maria Aguilar. Police said Myra appears to have fled with Jeshua in an attempt to keep the child from state custody. >> @webpagelink"},{"comment_id":"855184514566047","commenter_b":"Oh, he wont' do that - she's white.","commenter_a":"I Jeb Bush should set up a public shaming.","post_message":"What are your thoughts about this tweet about Bristol Palin, Sarah's daughter?!"}]
