[{"comment_id":"10153194384047217","commenter_b":"Helicopter looking for someone ?","commenter_a":"He's not the messiah - he's a very naughty boy.","post_message":"This mysterious bright light in the sky sent Californians into a panic 🌠"},{"comment_id":"10153215772461943","commenter_b":"I don't trust her, Should be tried for treason","commenter_a":"Was never any doubt, when her mouth moves, she is lying!","post_message":"** Now we have smoking gun proof of Hillary Clinton involvement in the lying Benghazi  points used by Susan Rice... Please SHARE this breaking news story! **"},{"comment_id":"10153464811106028","commenter_b":"@username, yes, jail is vacation. You should go there when you get tired of working. Many of our jails are full of illegal immigrants waiting to be deported or just released back into society. You should really think before you open you mouth Mario. Some people are just plane dumb. To think jail or prison is a vacation. If we sent home the illegal immigrants that are currently in our jail system, we could close 20% of our jails and put that money to better use.","commenter_a":"More people would have been there but it was morning and they were sleeping. It's also not the 1st or 15th so they don't have their free government checks, so no gas to get there. I say deport them, if they are here illegally they need to go. I'm tired of paying tax for them to get a free ride. We don't even take care of our own vets as well as we take care of illegal immigrants. That's a bunch of bull.","post_message":"Immigration policy protests continued throughout the morning in downtown LA, forcing closures at Los Angeles and Main streets. Protesters in a circle at the intersection called for a stop to recent federal deportation raids: @webpagelink"},{"comment_id":"10154130637278352","commenter_b":"I'm positive with all the comments you got some backlash lol, but keep in mind they're fucking disgusting bitches ha ha ha ha","commenter_a":"There's nothing wrong with breast feeding, but this is disgusting to put your almost 4 year old on the boob.... Want your child to drink your breast milk? invest in a pump....","post_message":"Mother defends breastfeeding her three-year-old son claiming cows' milk is bad for children as she encourages more women to feed toddlers this way"},{"comment_id":"10155327246350354","commenter_b":"Why in the hell would we care if illegals' feelings are hurt by AMERICANS FLYING OUR AMERICAN FLAG. IF THIS HURTS YOU, GET THE HELL OUT OF MY COUNTRY. YOU ARE ILLEGAL !!! That means you don't belong here !!!!!","commenter_a":"If these Students get public support it needs to be rescinded.","post_message":"Just when you thought this story couldn't get any more infuriating..."},{"comment_id":"10153092087111438","commenter_b":"Ha! You said it before I finished my statement.","commenter_a":"It's very obvious what happened here, it has been right from the start. This plane was intentionally driven into the ground by one of the pilots on the plane. This was very clearly a suicide/mass murder. Sadly, this is not the first time a pilot on a major airline has done this either. We are going to need to start doing a FAR better job of digging deep into the backgrounds of the pilots that we entrust to fly our major airliners going forward now. Or, we are going to have to start piloting these planes remotely from the ground and only using on-board pilots as a back-up in case the remote piloting system fails for some reason.","post_message":"A bit of eerie evidence has turned up on the cockpit voice recorder from the Germanwings flight that crashed into the French Alps this week."},{"comment_id":"10156946907525389","commenter_b":"@username you are just a hater. Stop disrespecting people specially Muslims.","commenter_a":"Love this man!","post_message":"\"Why didn't she say, 'Hey, make better lifestyle choices?' If you want to join something, why don't you join a church, why don't you join the Boy Scouts or the Girl Scouts?\"  Milwaukee County Sheriff David A. Clarke Jr criticized Hillary Clinton's comment on joining \"positive gangs.\" @webpagelink"}]
