[{"comment_id":"1023824300991761","commenter_b":"Women's loos can be more festy","commenter_a":"My bathroom in my house is open to anyone who can flush. Unisex bathrooms would end this issue","post_message":"In case you missed it: Trans people need to use the restroom just like anyone else. Why do some people have to make such a big deal about it?"},{"comment_id":"10153055472862293","commenter_b":"Shut Up..get outta here!!!! Lol...forgive blacks..?? psscvhh","commenter_a":"Should \"White America\" forgive racist blacks?","post_message":"\"If we really believe that black lives matter, we won’t devalue our reality and cheapen our forgiveness by giving it away so quickly and easily.\" via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"10157462499315093","commenter_b":"Hillary Rotten Clinton is the most corrupt person to ever run for president...she is like Crabby Appleton,Rotten to the core....","commenter_a":"Hillary Rotten Clinton is the most evil and most corrupt politician in our country's history hands down.","post_message":"They gave money. She gave them meetings. It's a conflict of interest. It's corrupt. She's still lying about it."},{"comment_id":"10156605912540389","commenter_b":"They offered it to me!!! What a crock!! We can't have another Clinton in the WH......","commenter_a":"For someone so smart what a waste of a brain. Just greed Is what motivates her.","post_message":"Even the left is calling this one of her worst moments."},{"comment_id":"1861021464115839","commenter_b":"Fits his class level.","commenter_a":"Ignorant","post_message":"WARNING: Graphic content"},{"comment_id":"10152873585726051","commenter_b":"I thought they are suppose to be getting a education if they are going to act like fouls then everyone needs to pay and kick them out of school so somebody wanting to be there can.","commenter_a":"What a disgrace!!! Is this what they went to college for? They should be expelled and not allowed in any other college!! Let them have to work hard for the rest of their lives!!","post_message":"This fraternity caused $430,000 in damage and wasn't sorry about it at all. Well, now they're sorry."},{"comment_id":"10154129472871509","commenter_b":"Shut up Muslim trash","commenter_a":"Middle East bloodshed happened due U.S invasion of Iraq. Sadam was a great leader. U.S is responsible for Shia occupation of Iraq, syria and Yamen.","post_message":"At least 30 killed after airstrikes hit wedding @webpagelink"}]
