[{"comment_id":"10154347897121375","commenter_b":"Fernando Barbosa god I hate this bitch","commenter_a":"@username \"dirty Muslim who'd piss of daddy\" literally us to every white guy","post_message":"This viral rant on #WomensMarch is riddled with fake outrage and hypocrisy where she complains about women complaining."},{"comment_id":"841765072552278","commenter_b":"Shoot to kill. This is the only way to stop these people","commenter_a":"I support the police, but I do not think that was the time or place for protest...RIP Officer Liu","post_message":"UNREAL: Here The Disgusting Thing Race Rioters Did To The Widow Of Fallen NYPD Officer @webpagelink"},{"comment_id":"10152949521626051","commenter_b":"she is not a mother no mother puts a man before her kids . sick bitch","commenter_a":"Wonderful Mom!!!! She should be locked up !!!!","post_message":"Every night this little girl has to lock her bedroom door so that the child molester who lives with her mother can't get to her."},{"comment_id":"10153758496148487","commenter_b":"Is the message that youre a whiny little pussy? Roger that.","commenter_a":"We are sending a message to the rednecks and right wing nut cases.","post_message":"\"We join other leaders in our state who are calling for a change in the state flag."},{"comment_id":"995140990545649","commenter_b":"terrible how must the parents feel xxx","commenter_a":"SICK!!!!!!!","post_message":"She drives off with the baby's pram still wedged in her bumper"},{"comment_id":"437859166374039","commenter_b":"For all the idiots out there who think its a good idea to burn people's shit FOR STARTERS BURN YOUR SHIT NOT OTHERS WHO WORK HARD FOR WHAT THEY HAVE... STOP TRYING TO SAY ITS FOR FREEDOM FOR THE BLACK RACE YOUR MAKING IT WORSE","commenter_a":"please, this country was founded because people rioted when their tea was being taxed LOL.","post_message":"\"This is not protesting, this is not first amendment rights.\""},{"comment_id":"1278850128860187","commenter_b":"No way in hell will I change my faith or anything else for this evil bitch!!","commenter_a":"Wear red at the polls. Let's show the Clinton machine how we can show our support another way that can't be rigged. Polling lines full of Trump supporters should skew the view of the biased media. We are the media. We are the people. For the people by the people we will make this country great again. Go Trump!!","post_message":"This literally just happened, folks!"}]
