[{"comment_id":"1766066213681675","commenter_b":"'@username trophy wife No. 3 was a soft porn model who also lies like through her teeth. No wonder she squints so much, trying to find her sugar daddy's pee pee!","commenter_a":"'Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s.' --Melania Trump","post_message":"'Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s,'  Charles Harder, a lawyer representing Trump, said in a statement."},{"comment_id":"10153137257982869","commenter_b":"Mr. McCain should not have called Trump backers, 'crazies' but I dont hear any of you calling him on that. I like you Mr. Huckabee and would vote for you but understand that Trump is saying what we want ALL of you to say, the truth! McCain can no longer ride on his service alone, he is an awful senator and has done much to hurt veterans today!!!!","commenter_a":"I agree! I respect him for my freedom! He has been outspoken about issues I agree with - don't know what will steer our country In the right direction. I know we need prayer first! Who loves America the most should be elected! I love my country and love it's history! To all who love our red, white and blue!","post_message":"John McCain is an American hero. When our troops return from combat, they should be treated with the utmost respect and admiration. Every breath I breathe and every step I take is free because of brave Americans like John McCain."},{"comment_id":"609436732514253","commenter_b":"She is a bitch","commenter_a":"Obama deserves no respect People who turn away from the very truth that is staring them in the face, will learn all too soon what these represent. This will be the beginning of the end. People have no idea what Hilary and Obama are doing behind our backs. Their evil and hatred goes much deeper and more wide spread than you can imagine. This is not a joke, it is coming.","post_message":"Some say this sign is extremely disrespectful to President Obama and should be removed on that basis alone. This man says it's his property, and the First Amendment gives him the right to keep the sign up. Decide for yourselves who is right."},{"comment_id":"1742501459315047","commenter_b":"SORRY HILLARY IS PRISON BOUND.MAYBE YOU CAN WRITE HER.","commenter_a":"Just like she took care of the Benghazi situation?","post_message":"'I’m afraid because these motherf—kers are coming for us, y’all.”"},{"comment_id":"10153861210290950","commenter_b":"You kiss your Moms with that nasty mouth?","commenter_a":"Here is my thought. Don't show him on TV!! Focus on the team, the stands, and the rest of the stadium and to hell with him. If everyone stops making him big news, maybe we can all go back to watching football and the rest of the players on the field. Make him prove he even deserves to be out there, and sorry 49er fans, but before all this crap by him became news, I couldn't even tell you who he was. Maybe this is his way of getting some publicity because he ain't no Tom Brady or Peyton Manning!!! Let him sit, he may just earn the right to sit there all season!!!","post_message":"A veteran who supports the San Francisco 49ers quarterback tweeted: 'Don't use my service--or that of any veteran--to justify the silencing of black Americans.'"},{"comment_id":"911829685530326","commenter_b":"She is a pig!!","commenter_a":"Sickening!","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"1192807494093054","commenter_b":"'@username Refugees are not illegal. Go troll someplace elst.","commenter_a":"Children are innocent, they can't be held guilty for anything their parents say or do. And my question is how can you hate war refugees, and many of them children, and still claim you're Christian. The tenet of the religion is to care for the stranger, the wretched, and the sick. Not sure what part of that is hard to understand. Jesus was a refugee, and so were his parents, we seem to forget that. Bravo to the troops, they're doing the right thing.","post_message":"Kudos to these vets for speaking out against Trump."}]
