[{"comment_id":"1184608688264181","commenter_b":"Ha bitch","commenter_a":"Stupid motherfuckers🖕🏿🖕🏿🖕🏿","post_message":"No longer enrolled! #KansasState #WSHH"},{"comment_id":"990159621088681","commenter_b":"Party affiliation is not THE ISSUE & what you should be voting on here Is Making America BETTER, PROSPEROUS & SAFER. IF YOU WANT MORE LIES..MORE CORRUPTION ...MORE $$$$$$$ GIVEN TO THE MIDDLE EAST...MORE WEAPONS SUPPLIED TO THE RADICAL GROUPS....MORE ILLEGALS COMING IN... MORE MURDERS..SANCTUARY CITIES... ...VOTE HILLARY.. YOU are the SHEEP. THE UNION HAS MADE YOU FOLLOWERS. SOUNDS LIKE MOST UAW MEMBERS ARE WISING UP. LOCAL 909 MEMBERS HAVE. EDUCATE YOURSELVES. WATCH: CLINTON CASH HILLARY THE MOVIE HILLARY'S AMERICA 13 HOURS READ: GUILTY AS SIN PARTNERS IN CRIME CRISIS OF CHARACTER ....and so much more... Investigate the CLINTON FOUNDATION.. HOW THEY HELPED (LOL) HAITI. They stole billionsof donations from these poor people. CLINTONS ARE FULL OF LIES. THEY MUST NOT BE TRUSTED! !! HILLARY CLINTON IS A WICKED WOMAN..for those who follow LOUIS FARRAKHAN, he States this fact, he also states how obama has failed his people. Look it ...","commenter_a":"Out of all the people in this work and these two clowns are the only choice","post_message":"Donald J. Trump is speaking this afternoon at Macomb Community College in Warren."},{"comment_id":"1570942919862279","commenter_b":"@username how about keeping your dick in your pants if all you men are going to do is walk away.....","commenter_a":"58 million human babies have been victims of abortion in the past 43 years since Roe vs Wade legalized abortion through all 9 months of pregnancy. Science has proven that life begins at conception. Social injustices continue such as poverty, hunger, underemployment, and child abuse has actually increased. Killing innocent life has not and will not solve these problems. Women and men suffer terrible regret for a decision that can never be reversed. They need real help and healing. The website hopeafterabortion.com offers loving help to post abortive women. Prolife Pregnancy Care Centers offer free nonjudgmental, loving support whether a woman decides to give birth or abort. So many women have been exploited and even died due to abortion. Abortionists get rich killing babies. Planned parenthood is the largest abortion provider in the United States. They do not provide any prenatal care or even mammograms. None of their services are ...","post_message":"\"Only when America chooses, remembers, and restores her respect for life will we rediscover our moral bearings and truly find our way,\" Rand Paul said."},{"comment_id":"539030936307389","commenter_b":"@username you're not paying for my uterus. Lol.","commenter_a":"So, Kaine, a Roman Catholic, has a moral conflict with his faith when it comes to the death penalty (killing criminals) but no qualm whatsoever promoting the killing of unborn babies?","post_message":"Mike Pence is a good man who had a strong performance tonight. This evening Tim Kaine demonstrated that he would serve as just another enabler of the failed Obama-Clinton policies that have hurt our economy, taken away our freedom, and weakened our security. The choice for Americans is clear. We cannot afford a third term of President Obama, and Clinton-Kaine would only continue the disastrous policies of the last eight years."},{"comment_id":"788288661319908","commenter_b":"Why is it that all of Trump's picks sound like great material for an Onion article?","commenter_a":"Sickening! The u.s.a. Is about to become an embarrassment","post_message":"Every single appointment is scarier and scarier."},{"comment_id":"842693252541388","commenter_b":"Go pound sand Joan","commenter_a":"WOO HOO!! #CRUZ4PRESIDENT!!","post_message":"Thank you Governor Mike Pence for your support! #ChooseCruz: votetedcruz.com/in"},{"comment_id":"644825525648235","commenter_b":"That doesn't matter he is evil to the core Common core Rotten Apple Treasonous Muslim at war with America","commenter_a":"The antichrist is supposed to be gay I was taught","post_message":"Former Breitbart Reporter: Why Did Obama Join “The Gay Club” at Occidental College? @webpagelink"}]
