[{"comment_id":"10154228784001378","commenter_b":"Yes ty @username I did","commenter_a":"@username did you get one yet?","post_message":"The Hatchimals are coming! The Hatchimals are coming! Target has announced that a new shipment of the hottest toy of the holidays will be popping up in stores nationwide starting today. Are Hatchimals on the list this year?"},{"comment_id":"1678495722420749","commenter_b":"She's a POS!","commenter_a":"Um Killery! Benghazi is in Libya!!! You are responsible (Culpable) for 4 Americans dying needlessly over there on September 11 2012! You are a Lying POS!","post_message":"Hillary Clinton did not mention the four Americans who were killed in the Sept. 11, 2012 terror attack in Benghazi."},{"comment_id":"10152983731016545","commenter_b":"Like all things. Just because it can be done, doesn't mean it should.","commenter_a":"What was he expecting? That's like going topless and wonder why people stare.. lol. People ask for attention only to flip once they get it.","post_message":"A Georgia man says he was harassed by police after openly carrying an AR-15 into an airport last week. Citizens are permitted to carry weapons in the open and public areas of the airport,  provided they do not move into the TSA-controlled secure areas of the airport property."},{"comment_id":"1784602218530696","commenter_b":"This lady is a clown with money. She is a joke","commenter_a":"gotta laugh at all these haters who are left over from Obamas reign! Its time to shake up the education system!","post_message":"Join us as Vice President Pence holds a swearing-in ceremony for the Secretary of Education, Betsy DeVos."},{"comment_id":"1023562641110247","commenter_b":"Conservatives can also be whiny. Like, OMG THE IMMIGRANTS ARE STEALING OUR JOBS OH NO I HAVE TO GO RE-TRAIN. I'M ENTITLED TO JOBS HERE.","commenter_a":"I don't know about my liberal comrades, but I went to work, paid bills, look after my kids, helped my neighbor fix his car, and drank. In fact I don't know a single liberal friend that did any of those","post_message":"It's a scary thought..."},{"comment_id":"10158911278605206","commenter_b":"@username, would you feel that way too if you were on an airplane and didn't like the pilot? According to you lilies Trump will destroy America. You might want to hold off on purchasing any party supplies. According to you dandelion's Putin will take over America because of Trump. You daffodils won't be allowed to throw any party's if that's true...","commenter_a":"The world deserves Donald Trump. No doubt about it.","post_message":""},{"comment_id":"10157018686460389","commenter_b":"And who is this new party going to be run by.. Romney?","commenter_a":"Ronald Reagan had similar numbers at this point in the process...the anti-Trumpites will fall by the waste-side....they are caught up in narrow-mindedness babble that has locked the GOP out of the White House for 8 years...it does not work WITH their current platform...we will re-write the \"Contract with America\" and the Republic's Platform (for our constitutional republic) and our new GOP party--the New American Conservative Party...AND TRULY MAKE AMERICA GREAT AGAIN. #TeamTrump #TeamUSA #BrightLightOnTheHill #AnythingisPossible #PositiveAttitude","post_message":"This is what an insurgency looks like."}]
