[{"comment_id":"517994265057820","commenter_b":"she is a pig","commenter_a":"She is an idiot, why does anyone give her the chance to prove it and get her 15seconds of publicity?????","post_message":"Mike Brown's mom just said something infuriating about the two cops who were just shot. This is absolutely disgraceful. No wonder her kid was a thug. Do you agree Mike Brown's mom is totally out of line?"},{"comment_id":"10153839277481717","commenter_b":"Welcome to Trumps America","commenter_a":"That's horrible! My partner and I attended the fair...we felt safer and less vulnerable in SF than we do in many parts of Albuquerque.","post_message":"Five men attacked the friends with pepper spray for no apparent reason other than they are gay."},{"comment_id":"10153708553274071","commenter_b":"@username Andy Lee when should we make the reso?","commenter_a":"Eric","post_message":"We ate live octopus at this NYC restaurant — and it was exhilarating."},{"comment_id":"10152823954416130","commenter_b":"Sorry for caring about Charlotte by the way","commenter_a":"If this jerk telling you to get them isn't reason enough NOT to, then I don't know what is...","post_message":"\"The science is, you know, pretty indisputable. We’ve looked at this again and again. There is every reason to get vaccinated, but there aren’t reasons to not.\""},{"comment_id":"1376905028996190","commenter_b":"Once you build the real fence, you will also be a target of terrorist!","commenter_a":"Hypocrisy","post_message":"The agency said it intends to begin building a “taller, stronger” fence to protect the White House grounds by 2018. via NBC Washington"},{"comment_id":"10153944005826336","commenter_b":"@username Your cocksucking grandma needs to read the bible!!","commenter_a":"What is this world coming to?!","post_message":"Just a few weeks before Christmas, Labor Commissioner Brad Avakian wiped out the Klein family’s bank accounts – taking nearly $7,000."},{"comment_id":"948395698606028","commenter_b":"Karma's a b**** and so is Hillary Deplorable Hillary LIES MATTER Pay for play Lining her pockets","commenter_a":"It was not a mistake...it is who she is. Angry bitter vindictive with money and power. Glad she was feeling enough pressure to be who she always was. A spiteful mean spirited person","post_message":"When you are president, you are president of all the people."}]
