[{"comment_id":"1044939055565842","commenter_b":"Watch out for the showers.","commenter_a":"Disrespectful, Ungrateful Cretins!","post_message":"Refugees in Germany are being housed in a former Nazi concentration camp"},{"comment_id":"895114997196955","commenter_b":"Your mother is a rat","commenter_a":"for press tv and iran the houthi rebels who tried to overthrow the govt are not terrorists. Instead the forces fighting houthi rats are terrorists. and iran claims to be a democracy. wtf","post_message":"Saudi warplanes airdrop weapons to militants in #Yemen  Read more: @webpagelink"},{"comment_id":"10154292449213525","commenter_b":"She didn't sleep with babe in bed purposefully by the sounds of it... She fell asleep. Big difference in that one is purposeful, one is accidental. New moms are exhausted.","commenter_a":"So sad..so dangerous. I had my baby in his crib until he was 1","post_message":"'Do not co-sleep with an infant,' Sheriff Grady Judd insists.  'Co-sleeping with infants is just an absolute no.'  His deputies have arrested a Winter Haven woman after they say her 'horrific negligence' while co-sleeping with her newborn baby led to his death -- for a second time: @webpagelink"},{"comment_id":"10153566641994456","commenter_b":"Pure ignorance! Women should not let a man in their car that they don't know, much less 2 men!!!","commenter_a":"I don't stop at this Pilot Travel Center, even in the daytime. Lot Lizards and beggars are like running water, 24/7, even with the police watching.","post_message":"A Birmingham woman's act of kindness resulted in her car and wallet being stolen at gunpoint. @webpagelink"},{"comment_id":"10153572022092293","commenter_b":"We should see this McKenzie","commenter_a":"'@username ayoooo","post_message":"The Witch is a must-see for any horror fan -- just be ready to be creeped out."},{"comment_id":"10153039322884753","commenter_b":"She doesn't have to pledge allegiance to the USA. So where is she pledging allegiance to, while getting a free education here. Hmmmmmmm","commenter_a":"I think she and her family should leave the country","post_message":"When a 14-year-old student decided she no longer was going to participate in the pledge of allegiance at her school, her teacher decided to punish her. Now the girl's parents are asking for an apology."},{"comment_id":"893350990721431","commenter_b":"She's not getting my vote","commenter_a":"Go Hillary!!! :)","post_message":"All across the country, people are working hard and making plans for their futures. Hillary is getting started too. Be a part of her campaign from the very beginning:"}]
