[{"comment_id":"10153801376773822","commenter_b":"Sean Hile lol","commenter_a":"Chelsea Nichole","post_message":"Burgers, Wings, and Country music... A taste of Nashville is set to move into #Pittsburgh's North Shore."},{"comment_id":"942361925804666","commenter_b":"I don't like it poor women","commenter_a":"How horrible.","post_message":"With everyone watching. Horrifying. - Matt Orr"},{"comment_id":"692872167570028","commenter_b":"It's NOT A WOMAN!!","commenter_a":"Moron nuts ops HeShe got balls . Sick , sick , sick . Woman of the year ? Bull crap ,disgusting , insulting to all women in the world . Hmmmmm maybe he should be castrated then but he will still be the same , a mangoman hehehe .","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"10153060645251350","commenter_b":"And you'd win a beauty contest for sure ...","commenter_a":"She's so ugly. She has a mouth the size of a horses mouth","post_message":"What do you think: Is this a subtle pregnancy announcement or just a cute silly photo from Beyonce?"},{"comment_id":"1428416493869569","commenter_b":"She, that was a woman officer","commenter_a":"watched the video again lucky nobody was shot what people need to remember officers have a family too they want to go home in one piece he should have drawn his weapon but he still would have been the bad white cop","post_message":"MUST WATCH: Two people face assault charges following a wild brawl with a police officer in Nashville."},{"comment_id":"10153284046734228","commenter_b":"Th!at girl blacked her eye","commenter_a":"That dude is either Prior service (MP) or a local cop. His entire demeanor and physical behavior scream it. I don't think brandishing was the best idea either way..","post_message":"Teens who frequent the skate park say they aren surprised by the fight, but they can believe how it was stopped. A man pulled a gun. - @webpagelink"},{"comment_id":"10153161322294726","commenter_b":"If she moves her lips She is lying","commenter_a":"Think she bad now if she WIN. White house .no stopping HER","post_message":"WATCH: Bombshell Report Clinton Did Use Private Email For State Department Business"}]
