[{"comment_id":"10154221052787869","commenter_b":"Immigrants aren't spending money with local businesses, if they aren't getting paid welfare checks. You're idea would only hurt the citizens of those cities. I agree that the federal funding needs to get cut for processing illegals, but lack of tourism would be cutting jobs, and hours for legal, working citizens that have nothing to do with it. Trust me, the working people in 'sanctuary cities' want them gone, too.","commenter_a":"Not only should these cities lose their federal dollars, but people should not visit these cities and they will also lose their tourism dollars. Maybe they will cooperate then!","post_message":"One of Donald Trump’s most popular campaign promises was to end “sanctuary cities,” where local officials refuse to cooperate with federal immigration agencies on deportations.  This refusal to enforce the law makes these cities magnets for criminal illegal immigrants seeking to evade arrest and deportation and puts their citizens at grave risk (like Kate Steinle, the young woman allegedly shot to death in front of her family in San Francisco by an illegal immigrant who would have been in custody if local authorities hadn’t released him from jail instead of turning him over to the feds as the law required.)    Trump isn’t even in office, and already, some city leaders are having the same kind of tantrum we’re seeing from protesters in their streets.  The Democratic mayors of Chicago, New York and Los Angeles all defiantly declared that they’ll never give up their “sanctuary” policies and cooperate with federal immigration authorities.  L.A. police chief Charlie Beck also announced that his force will never work with Homeland Security to deport criminal illegal immigrants.  He said, “That is not our job, nor will I make it our job.”   Memo to these mayors and to the L.A. police chief:  As law enforcement officers, your job is enforcing laws, not protecting criminals.  If it takes cutting off your federal funds to force you to do your jobs and put your citizens’ safety first, then maybe that should be the very first cost-cutting measure President Trump takes to reduce the deficit."},{"comment_id":"667515520077863","commenter_b":"I hope she killed herself!","commenter_a":"Terrible","post_message":"This Texas mother and vocal gun advocate snapped and took the life of her own two children over a simple family argument after spending years criticizing Democrats for 'wanting to take her guns away':  'A family spat started inside the married couple’s Houston-area home and spiraled into gun violence that spilled out onto their street.  “It was a family argument that turned into a shooting,” Fort Bend County Sheriff Troy Nehls told the Houston Chronicle. “But we’re still trying to put the pieces together.”   Read more HERE: @webpagelink  Thanks to Point Counter Point."},{"comment_id":"555357001316722","commenter_b":"'@username open your eyes hill right hand person Muslim female yea so Trump might not be perfect or what this country really wants but he is 100 times better then hillary","commenter_a":"Mitt I actually liked you and voted for you! Thank you for giving me even more reasons to vote for an outsider! All of you politicians disgust me and are hypocrites! #trump2016","post_message":"WATCH: Mitt Romney slammed Donald J. Trump as 'a fraud' and called on the 2016 GOP candidate to release his tax returns.  What do you think of Romney's speech? @webpagelink"},{"comment_id":"10153524909826130","commenter_b":"If Trump had his way Muslims wouldn't be aloud to return if they left the states either.","commenter_a":"Muslim terrorist kills Americans again and liberals continue to make excuses for Muslim terrorist. Over 3,000 killed on 9/11, more than at Pearl Harbor , Fort Hood Muslim terrorist killed many, Muslim Boston pressure cooker bomber mangled several, Muslim husband and wife kills several in Ca. Liberals seems to love Muslim terrorist. Muslim terrorist cuts heads off reporters and airs the videos, Muslim terrorist throws homosexuals off roof tops, Muslim terrorist drown people in a cage, Muslim terrorist burns people alive.","post_message":"Donald J. Trump says he doesn't know any Muslim athletes, but these photos say otherwise."},{"comment_id":"10155817024445192","commenter_b":"If she has an abortion, there is no child support. If you have the kid, they have to eat whether you like it or not.","commenter_a":"Women say it's thier body until it comes to child support. Then is both. Hmm mm if abortion is legal because of pro choice then child support should be pro choice too.","post_message":"A Florida judge is blocking a new state law that requires women to wait 24 hours before getting an abortion."},{"comment_id":"507758516015518","commenter_b":"She is illegal","commenter_a":"'@username 2016!!! LETS PUT THIS BEAUTIFUL LADY IN THE WHITE HOUSE!!!","post_message":"Very proud of our next First Lady Melania Trump! #MakeAmericaSafeAgain"},{"comment_id":"10153271300604497","commenter_b":"Sadia","commenter_a":"Bmc Covert Joe Sanders","post_message":"'Mom and Dad are going to be thrilled when I bring literally anyone home to meet them.'"}]
