[{"comment_id":"900773723315710","commenter_b":"And how is this news? Last time I checked, Mail was supposed to be a page for news.","commenter_a":"just kill them all anyway","post_message":"In these exclusive pictures, she goofs around like a typical London schoolgirl. Here we reveal what poisoned the mind of the 15-year-old who's run off to join ISIS."},{"comment_id":"10153253284026756","commenter_b":"i like to read porn not watch it as much","commenter_a":"Meanwhile, people are praising a movie about a creepy, abusive man who likes to manipulate women into believing they want to be treated like emotional and sexual slaves.","post_message":"In which the vice president manages to invade all of our personal spaces, simultaneously."},{"comment_id":"10153093023857293","commenter_b":"Ha Ha Ha!","commenter_a":"the Republican brand has been damaged long before Trump! He is just icing on the top!","post_message":"The head of the Republican National Committee wants Donald J. Trump to tone it down."},{"comment_id":"10154251661998144","commenter_b":"arrest them all","commenter_a":"These people mare a direct threat to our Country and the good honest people in it! Anything goes to move them! I'm fed up!","post_message":"Anti-Trump protesters blocked off an ambulance because they were upset about President Trump's executive orders"},{"comment_id":"10153361395611107","commenter_b":"Class on the left, and no class on the right. She is just another, inept, liberal, lying skank. I put her in the samne group with that traitor, Hanoi Jane.","commenter_a":"Better yet , hit her at her cankles. Paul/Trump ... Trump/Paul for America, not the establishment","post_message":"Guess who I ran into? Tune in to @CBS now to find out why I think she should forever be precluded from being potus"},{"comment_id":"10153963116971341","commenter_b":"Better one soldier in jail and one terrorist dead then one terrorist in jail and one Israeli dead. That Palestinian is a terrorist who tried to stub innocent civilians.","commenter_a":"A large proportion of the Israeli population supports these extra-judicial killings @webpagelink","post_message":"\"What happened in Hebron does not represent the values of the Israel Defense Forces.\""},{"comment_id":"1642912372619537","commenter_b":"Very nice & her tiara stayed on!!!","commenter_a":"Awesome","post_message":"These two turned up the HEAT!"}]
