[{"comment_id":"10153919889436955","commenter_b":"Trump is the only one who will throw out all of the illegals and anchor babies too stop the influx of Muslims","commenter_a":"Rubio has supporters?????","post_message":"POLL: Who will Marco Rubio supporters vote for?"},{"comment_id":"816614281820679","commenter_b":"You have got to be kidding 49. Unbelievable! Evil surely takes its toll. She looks horrible. I am older than her!","commenter_a":"Can you believe the skanky crack whore, also known as KellyAnne Conway, is only 49? She looks like she is late 60's or early 70's... This is the toll that selling your soul to the devil will take on you!","post_message":"She did sell her soul to the Devil, after all."},{"comment_id":"824943850887973","commenter_b":"What dumb a holes. They can't destroy anyone. The U.S. Would squash them like a bug.","commenter_a":"Someone shoot this idiot......he is the problem.","post_message":"Warns that \"Tehran will set fire to every military base from which a hostile U.S. plane takes off for bombing Iran.\""},{"comment_id":"10152564279192623","commenter_b":"Notice everytime it moves up and down is when she brakes. It falls forward when she brakes. And honestly this woman in the front car has been a menace for a while now! It's about time someone got proof of her ridiculousness.","commenter_a":"the cops were called. she started in back of driver redneck lady tried to run lady and child off road first time. and slowed down to let the other in front. the phone was in a dashboard holder while taping driver not holding phone.","post_message":"WATCH: Road rage out of Randleman.   Just tilt you head and wait until about the 3-minute mark.  Egads.  Warning: Language and gestures may be offensive to some."},{"comment_id":"10154432896669342","commenter_b":"The first 2 females that get drafted if there is one better be his kids.","commenter_a":"What they need to do is send all the government babies to serve leave the women alone","post_message":"The timing of Obama's support for women registering for the draft makes it mostly symbolic, but where do you stand on the issue?"},{"comment_id":"10156224999290551","commenter_b":"Go back to your own shithole country.","commenter_a":"Let's wrap them up in bacon and send em back to where they come from😎","post_message":"Trump was right - Muslims did celebrate 9/11."},{"comment_id":"1091917874180626","commenter_b":"MAKE AMERICA GR8 AGAIN 2016! # AMERICA FIRST # BUILD THE WALL!","commenter_a":"Let's see a lot more arrests...these are terrorists!!","post_message":"Democrats' voter outreach to gang members is apparently working..."}]
