[{"comment_id":"782076235316287","commenter_b":"Go now obama!","commenter_a":"Yes please leave if you are offended by our flag or if you disrespect it. LEAVE","post_message":"SHARE if you agree!"},{"comment_id":"777311705792740","commenter_b":"FUCK YOU BITCH!!!!","commenter_a":"What a tool.","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"1844880965799014","commenter_b":"Despicable, she has done this before....","commenter_a":"How long have these two been doing that kind of stuff? Looks kind of brazen to me! If that were my property, it would have been a totally different outcome.","post_message":"Totally. Busted. Sure, they're caught red-handed, but just wait until you see how they respond..."},{"comment_id":"10152991363976336","commenter_b":"We know what we have to do!So what's the holdup !! Being our borders are wide open where just gonna wait till it starts in America! The longer this builds the harder it will be to totally defeat!","commenter_a":"Well, we could talk about why the government is giving Tonto National forest to a foreign mining company. Gold?","post_message":"Attorney General Eric Holder lashed out at Fox News, defending the Obama administration's reluctance to say 'Islamic extremism.'  'If Fox didn't talk about this, they’d have nothing else to talk about,' Holder said."},{"comment_id":"10153530483933872","commenter_b":"We are tired enough of the lies and deceit and are going to vote you out- both of you wicked queens of the damned!","commenter_a":"Oh no, Patty! Why do you have to endorse Hillary? Disappointed that you don't #feelthebern","post_message":"It's great to see Hillary Clinton focus on this critical issue for our families, our economy, and our future."},{"comment_id":"958348850875022","commenter_b":"She is a frickin IDIOT","commenter_a":"Don't screw with my free speech !!! It won't go well for you !!!","post_message":"The Constitution’s 1st Amendment protections for free speech apply only to “institutions of faith” and not individual Americans, according to Sen. Tammy Baldwin (D-Wis.). Baldwin, the nation’s first openly lesbian member of the U.S. Senate, offered that bit of liberal logic during a recent discussion on MSNBC. Asked by the MSNBC host whether a bakery whose owners have religious objections to the ruling should be compelled by the government to bake gay wedding cakes, Baldwin insisted that religious free speech has no place outside churches, synagogues or mosques.  @webpagelink"},{"comment_id":"10155862004711038","commenter_b":"That is impossible. Teenage girls take up the entire bathroom so you can't share it with them.","commenter_a":"Yeah, teenage boys are gross...but have you ever shared a bathroom with a teenage girl? It's fucking nasty.","post_message":"You love him, of course, but COME ON."}]
