[{"comment_id":"480329612157619","commenter_b":"deport all illegals","commenter_a":"and I went through 2 WTC bombings 5 months pregnant in the first one.. 2 back surgeries had and foot surgeries in the second and I could not get a dime to support myself and my daughter other than the Social Security Disability I worked for for 23 years ...in fact was told \"I made too much money to get any help\" Really????","post_message":"This illegal immigrant has been collecting welfare for 20 years... This is outrageous. Illegals on welfare should be kicked off and deported immediately. Should we deport all illegals collecting welfare?"},{"comment_id":"849791398402742","commenter_b":"Well you be sure to let all those people know where that magic land is where all those wonderful jobs are just growing on trees!","commenter_a":"I think this is great. People will no longer abuse welfare and will actually get up and find a job.","post_message":"Arizona's Legislature cut $4 million from the budget by reducing the maximum time you can be on welfare from 5 years to 1 year. Critics say that it will cut funding for those who need it and can't find jobs. Supporters say it will encourage more to get off welfare and find work. What do you think?"},{"comment_id":"1054929361214588","commenter_b":"She* is a woman.","commenter_a":"Sorry Siri, but according to his DNA, he's still Bruce! A rose by any other name.....","post_message":"Siri knows Caitlyn's name and she's going to correct anyone who forgets."},{"comment_id":"1788246978118850","commenter_b":"She is garbage.....","commenter_a":"Your a f*cking idiot. Please leave the country. I'll buy your ticket.","post_message":"During a show in Tampa, Amy Schumer brought an audience member on stage and quizzed him about his decision to vote for Donald J. Trump."},{"comment_id":"986861908039953","commenter_b":"President Obama is the best. Elizabeth Warren should have run for president because she would have been great just like Obama..STOP HATING PEOPLE. Recognize greatness...","commenter_a":"That's just great Thank you Mr President and Elizabeth Warren , your the best !!","post_message":"They are kicking Wall Street's ass!"},{"comment_id":"572733119579689","commenter_b":"Yeah you gotta be a useless bitch to waste time on Amazon digging these shit custom up for a fucking baby.. NO NOT ME","commenter_a":"@username gotta do this to the baby 😂😂","post_message":"I just grew ovaries and they just exploded."},{"comment_id":"10154111304162541","commenter_b":"Shut up","commenter_a":"Like Trump, Steve Harvey is also a racist and mysognist. Between his extremely offensive dating advice for women and his extremely offensive comments about Asians, Steve and Don the Con have a lot in common.","post_message":"\"I walked away feeling like I had just talked with a man who genuinely wants to make a difference in this area,\" Steve Harvey said."}]
