[{"comment_id":"1135446926503853","commenter_b":"And own the chef world John peck !! You're gonna kill it !!","commenter_a":"So those aren't His arms ?","post_message":"BEAUTIFUL: Former Marine sergeant John Peck lost his legs and arms when he stepped on a homemade bomb in Afghanistan.  Thanks to a double arm transplant, Peck says the best thing about having arms again is that he can hold his fiancee's hand and become a chef.  PHOTO: Brigham and Women's Hospital MORE: @webpagelink"},{"comment_id":"10155155433964778","commenter_b":"She wasn't a black swimmer to me until the media and people who keep stressing the fact of the first 'African American' ... First off the has been in the past but what I see of anyone in the Olympics is an athlete who trained very hard and worked through their own adversities to reach their goals. To me African Americans want the dividing line to diminish, I know I treat people as people so I think the media should stop putting a dividing line there. I don't care who you are if you want to do a sport and make it to the Olympics with hard work and perseverance you can make it, it's not your color that helps you make it.","commenter_a":"She was just another amazing swimmer to me. I didn't think about her race...SHE made that the issue. It's hard to be colorblind when it keeps getting made an issue BY THE ONES COMPLAINING!! WTF!","post_message":"'I want to be an inspiration, but I would like there to be a day when it is not ‘Simone the black swimmer.’"},{"comment_id":"10153265076161602","commenter_b":"They're asking for regulations--there is no compromise from the gun lobby.","commenter_a":"I think we can all agree that there are some people that should not have firearms. However, if you support the second amendment like I do, you need to be part of the solution. Because if we let those that are against the second amendment make the policies, what do you think will happen to 2A? Let's be proactive in this, not reactive.","post_message":"The families made it clear they are not associated with the non-profit Sandy Hook Promise."},{"comment_id":"909734362398134","commenter_b":"Their already lawless. Nothing but thugs in many of the public schools, who by the way are running the schools. The kids tell the adults what to do!","commenter_a":"Sounds like she wants to give 'minority students and other risk youth, including migrants and LGBT students.' a free pass whenever they get into trouble. How about teaching them to OBEY the law?","post_message":"Things go from bad to worse..."},{"comment_id":"1945808648983136","commenter_b":"This Fucking pussy","commenter_a":"What a freak thus guy is!","post_message":"Must-watch. Morning Joe, a Republican, was left speechless by top Trump advisor Stephen Miller's dictatorial, lie-filled performance on the Sunday shows.  Shared by Occupy Democrats, LIKE our page for more! Video from MSNBC."},{"comment_id":"10153011198456717","commenter_b":"Time to jail her ass","commenter_a":"Yay!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10156094482870354","commenter_b":"Throw that fat stank ass pig in the pen!","commenter_a":"She deserves the same","post_message":"***UPDATE***"}]
