[{"comment_id":"10156077114395354","commenter_b":"She is a very dangerous person!","commenter_a":"You can fully understand why a lot of politicians want gun control after the shit they have pulled on the people . Some of them might well fear for their lives . With the present climate in this nation the people sure as hell aren't ready to give up their weapons . My advise is to stockpile ammo while you still can , before they ban sales .","post_message":"Here's what she's got planned for law-abiding, gun-owning citizens..."},{"comment_id":"895880550545124","commenter_b":"An actual woman.","commenter_a":"This is a weak argument.","post_message":"Maybe liberals should have thought about how much they wanted to focus on Michelle and Melania's speeches before they started losing their minds. With so many people looking at the speeches this was gonna happen."},{"comment_id":"1820380214887532","commenter_b":"I will bet you $10.00 to a donut she is a liberal.","commenter_a":"This is insanity, this principle needs to be removed.","post_message":"Angry yet??"},{"comment_id":"1210892618945831","commenter_b":"Ain't no clan rallies, ain't no alllivesmatter, ain't no trump rallies...none of that bullshit up here ya'll mother fuckers get fucked up up here talking that bullshit. If you ever in the big Apple look me up.","commenter_a":"Edited for narrow minded people who want to pick apart a comment as opposed to seeing the big picture: Why do things like this only get attention when the victim is attractive? When this same thing happens to anyone other than black people, it only gets attention when they are affluent or attractive. This SAME THING happens to white people MORE OFTEN than it does to black people and doesn't get the OVERALL attention it deserves. It's not even a black or white thing at this point. It's about what the main stream media will and will not cover. BLM is BULLSHIT and only service to segregating the people and preventing ALL OF US to come together to address these issues. If we cannot band together and fight the power they are the ones winning while we are killing each other. #knowyourenemy","post_message":"I am literally in tears. Full story: @webpagelink"},{"comment_id":"1531453513826452","commenter_b":"Yep, Asian Men are Sexy!!","commenter_a":"Don't feel bad Asians .. Black people either play a criminal or a slave majority of the time .. And/or there's only one black character in the entire film or show lol ..","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"10153094131986378","commenter_b":"Nothing is going to happen to this so called mother ...because if a white judge sentenced her to prison..she'll pull the race card.......","commenter_a":"Can we leave her in a hot car???","post_message":"TODDLER LEFT IN 117-DEGREE CAR: An Arizona mom has been charged with child abuse after surveillance video showed her leaving her toddler locked inside a hot car while she went shopping at Walmart. See the surveillance footage:"},{"comment_id":"10156907192725594","commenter_b":"He is currently behind, I am not suggesting that he is not. What I am pointing out is that EVERY SINGLE POLL gives him a much wider lead over Trump than Hillary's lead. Most importantly in swing states. Who cares that Hillary won most of the Southern states, they are not going blue. Bernie won in most of the swing states and he polls dramatically better than her over Trump in those states. He may be losing the primaries, it is probable even. However if the point of this article is that Trump is such a threat to the presumptive Democratic nominee and we need to not be distracted by the primaries than it is fair to say, who is the better candidate to defeat Trump? Maybe for the sake of unity and defeating Trump, Hillary should bow out. You know, for the common good.","commenter_a":"I think we need to start asking the question is it time for Clinton to bow out of the race. Because if our main yardstick is not letting Trump be president all the polls are pretty clear, Sanders is our best bet.","post_message":"Yet Bernie Sanders is having none of it, frequently telling the thousands of supporters who attend his rallies that he still has a narrow path to the nomination."}]
