[{"comment_id":"10154159417163797","commenter_b":"Y u hating? Stop trippin & stop actin like a jealous punk. Man, sometimes these women can be straight up fools and want to try ruin something that is a gift for a couple that wanted something so bad and finally god gave that gift. Ezella, being a punk gets u nowhere. Shut up and complain about ur own life princess if u wanna be such a negative Nancy","commenter_a":"He's not crying because he's happy, he's crying because that's his 9th kid & he already owes 30k in arrears. 😈😼🙈🙉🙊","post_message":"TEARS OF JOY: A video of a man bursting into tears when he learns his wife is pregnant is warming hearts all over the Internet. Watch Here:"},{"comment_id":"955289837857113","commenter_b":"How about we start with u lady . What a Moron!","commenter_a":"She should start with herself.","post_message":"(Video) 2 lies woven together to justify depopulating the Earth... Full Story: @webpagelink"},{"comment_id":"10153134126831051","commenter_b":"Mother fucking bitch..","commenter_a":"A real POS","post_message":"Witnesses called 911 when they noticed this woman begin tossing something out of her car window. When the police finally caught up with her, she didn't bother denying it."},{"comment_id":"10153227996393812","commenter_b":"And feminazis want to be equal. Smfh","commenter_a":"Men can be abused too...","post_message":"\"Why is it so hard to see black and blue?\" #TheDress being used to fight back against domestic violence: @webpagelink"},{"comment_id":"10154376306546636","commenter_b":"She did? She'll never get out of prison.","commenter_a":"She got off easy for mowing down people terrorist style. Or maybe they got the idea from her idk","post_message":"A woman accused of a deadly crash that claimed four lives during a homecoming parade in Stillwater has accepted a plea deal."},{"comment_id":"985183654870370","commenter_b":"She's tripping.......","commenter_a":"She got a low i.q. and a low self esteem. Your kids should come before any man. They always say a fool and their money will soon part. And soon, it will all be gone and so will he.","post_message":"The N.C. woman who won a $188 million Powerball last February is facing an onslaught of criticism after she posted a $12 million bond for her boyfriend…for the fourth time. Lamarr (Hot Sauce) McDow was arrested Tuesday for violating the terms of his pre-trial release. As NewsOne reported last year, Marie Holmes, 26, posted bond for McDow three times — once just weeks after she collected her winnings ($3 million), once in August ($6 million) and again in October after he was arrested for possession of a firearm by a felon. Is the public being too hard on Holmes? Is it any of our business what she does with her money? Let us know ----> @webpagelink"},{"comment_id":"10157547755435206","commenter_b":"I don't know who's worse: a rapist or a pedophile. This psycho is both.","commenter_a":"Should of chopped him in pieces .","post_message":"An Indian man took revenge against a 17-year-old boy who raped his 7-month-old baby daughter — by tying him to a tree and chopping off his hands."}]
