[{"comment_id":"1372232146121032","commenter_b":"Chris Schiraldi really? Please tell me your source besides your opinion because that sure as hell isn't fact!!!!","commenter_a":"Yeah thanks for the lowest workforce participation rate in decades. Thanks for creating so many low wage/ low benefit jobs. Thanks for so many on food stamps because the economy sucks. And thanks yahoo for being yahoo... and that isn't much","post_message":"75 straight months of job gains. 15.8 million private sector jobs added since 2010.   Thanks, Barack Obama."},{"comment_id":"693308824147234","commenter_b":"and being hoes..laaag","commenter_a":"This shit here is crazy. All week we been talking bout Kylie like she beyond famous. Her family is known for fucking and being hoes. Malala opens up a school and nobody don't say nothing the worlds view point on things is fucked up.","post_message":"Quit making stupid people famous."},{"comment_id":"10153678409374641","commenter_b":"I say make email really sick for weeks with water damage so much so that they want to die lol....but can't get off the looploo","commenter_a":"You have to kill there soldier first then go after the leaders.","post_message":"\"I think it's futile to respond to terrorist violence with more violence in a way that creates more terrorists,\" says Sally Kohn."},{"comment_id":"664601907063721","commenter_b":"What a FFFFFFFFFFing Bitch.","commenter_a":"Yes","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"},{"comment_id":"10153127700606491","commenter_b":"That females are equal to males. Google the definition of feminism. That's all it is. Males and females equal. No enforced culturally engrained gender roles. It goes very deep.","commenter_a":"Amazing that no one commenting but me is for gender equality! I thought it was 2015 :( oh well you can't teach ignorant adults I suppose.","post_message":"\"Every child is an individual.\""},{"comment_id":"10153724102627217","commenter_b":"Ms. Herod... Majority of UK science budgets are coming from EU... Now a lot of most important science projects are too expensive for even the US alone... Not to mention working scientists who are working in UK aren't British, but from EU who are paid by EU... UK's science sector is one of the biggest looser after EU exit...","commenter_a":"Lol pmsl...so now learning science has alot to do with brexit...not very intelligent then are you...we had science before we went into it we still have it & for all the years to come ...please stop with the crap ..we are & we will be better of out","post_message":"Are you a scientist worried about #Brexit? Here's the latest."},{"comment_id":"843506072460327","commenter_b":"Nina Turner is wrong and she knows it!","commenter_a":"She obviously never Studied JFK","post_message":"Sanders’ camp: Democrats ‘court disaster’ with Clinton"}]
