[{"comment_id":"10154130394501545","commenter_b":"'@username I think CNN is giving you false hopes. You might want to turn off the biased media.","commenter_a":"I love how 'news' organizations report this as news. Headline should read 'Professor got lucky with one correct prediction, and hopes another will come true.'","post_message":"A professor who has correctly predicted the outcome of every presidential election since 1984 has a new prediction..."},{"comment_id":"10153734549101323","commenter_b":"Fucking Liberal fucks! Feminist whores! Leave Star Wars alone!","commenter_a":"I'm not sure whether the viewer would have got the right impression of Jabba if instead of enslaving Leia he'd have given her a thatcheresque power suit and asked for her opinion on current affairs!","post_message":"It's one of the most memorable, weird, gross and resonant moments from The Return of the Jedi, and from Star Wars in general – and Disney is working to disavow it."},{"comment_id":"1093117534044369","commenter_b":"He should be slut shamed with a fire ant bath!!","commenter_a":"The term 'slut shame' is fucking ridiculous in and of itself, but saying that the judge was 'slut shaming' a rape victim is fucking horrendously disgusting. This judge should be suspended, and whoever made the title for this article should be fired.","post_message":"Holy sh*t."},{"comment_id":"10154236917854726","commenter_b":"Hillary must never be allowed into the White House.","commenter_a":"What about these rides on that billionnaires plane!","post_message":"Media pushes war-on-women narrative against GOP while ignoring indiscretions of Bill Clinton."},{"comment_id":"10153564661133837","commenter_b":"If they are illegal then yes deport them and yes build a wall preferably with large guns","commenter_a":"He just wants to deport them all, and thinks they're all criminals, and wants to build a wall!!","post_message":"TRUMP LOVES HISPANICS!  Presidential candidate Donald Trump tweeted out this afternoon, 'I love Hispanics!' to help celebrate Cinco de Mayo.  THOUGHTS - THAT'S SO NICE or THAT'S SO WEIRD?"},{"comment_id":"1194513290647275","commenter_b":"Yep and a drunk driver that got behind of the wheel of a car but didn't hurt anyone should not be taken away from their family and put in jail when they were caught????","commenter_a":"She's a threat to no one. They just took a mother from he children who were born in this country!! We are the one's who are threatening the lives of people who trusted us and came here to make their lives better, just like Trumps mother did. Just think, if they had sent her back we wouldn't be dealing with this heartless man! What a blessing that would be. He's done more damage in less than 3 weeks than Nixon did in about 6 years and he wasn't this bad!!","post_message":"Immigration agents “said she’s a threat, but my wife isn’t a threat,” her husband said in an interview."},{"comment_id":"10152926851271336","commenter_b":"My God leave the Good Doctor alone. Don't see you going after those that treat patients in their mammogram buses and doing blood and plasma draws that happen to be far more dangerous. Give the guy a break. He is licensed to practice in that state, the entire state. Can you blame the Dr. after what Obamacare has done to folks. Jesus Lord...go after POTUS for putting people in this position in the first place, without healthcare, sucking what was left of Medicare that the elderly needed and driving up healthcare coverage so govt gets a buck.","commenter_a":"Need more like him and fewer like Obama.","post_message":"Mississippi health officials are threatening to revoke the medical license of an 88-year-old doctor because he treats patients out of his Toyota Camry. Dr. Carrol Landrum says his patients are too poor to travel to him, so he goes them."}]
