[{"comment_id":"10153506495063855","commenter_b":"Stay outta Kohls then Asshole...","commenter_a":"OMG. Is kohls run by the lesbiens now? My wife told me the womens shoe section is full of work and combat boots nowadays.","post_message":"ICYMI: Kohl's melts our hearts."},{"comment_id":"10153559640036051","commenter_b":"This post gave me cancer all over again....","commenter_a":"I support guns. I love them. I have some. They are for Huntin. I believe we should be able to own guns. But this Type of rifle. I think our militry And police is the only ones who should have this kind of gun. What does a deer hunter need with somethin like that. I think somethin like a 30-06 is plenty of gun. Or somethin similar. Not just that kind. But Nothin like Whats shown. There should be a limit. But not banned","post_message":"A federal court just ruled that a Maryland law banning citizens from owning military-style rifles is unconstitutional. Do you support the court's ruling?"},{"comment_id":"10153876614269024","commenter_b":"Kick this fucker right in the mouth","commenter_a":"What a poor excuse for a Mayor.","post_message":"@conservativebyt"},{"comment_id":"10153265498530047","commenter_b":"@username over 5million LOL. Dead people and illegals","commenter_a":"SIGN THE PETITION / CLICK ON WEB SITE Justice Scalia one of the most brilliant and ardent defenders of the Constitution has just passed away. This is a huge, deeply felt loss. We must not forget that the next justice could impact the Court and the direction of our nation for decades. The American people deserve a voice in this decision: @webpagelink","post_message":"President Obama will stop at nothing to force his nominee for the U.S. Supreme Court through the Senate before his last year in office comes to an end.      But we can stop this from happening.  SIGN & SHARE our urgent petition to the U.S. Senate today: @webpagelink"},{"comment_id":"10154403628496336","commenter_b":"Ban all bombs - Obama","commenter_a":"Obama will call for more gun Control in Istanbul!!! It's not a terrorist attack in his eyes. Because of him these cowards are killing innocent people.","post_message":"Breaking News Update: At least 10 people were killed in the two blasts at the Ataturk Airport in Istanbul, according to the Turkish Justice Minister. @webpagelink"},{"comment_id":"1415056648547094","commenter_b":"Blacks should all go to Africa and start a country called \"obamasthan\"... If they want out, get out. The intelligent blacks and whites and Hispanics will help them leave. No US citizenship. Good bye!","commenter_a":"Show me the money!","post_message":"Check out his plan..."},{"comment_id":"10154014053348984","commenter_b":"SHES A RACIST BIGOT ANYWAY","commenter_a":"I don't know anyone that likes that show, or doesn't think that Whoopie is whoopie.","post_message":"Donald J. Trump has had enough with the liberal ladies of \"The View.\" In just one word, he absolutely destroyed host Whoopi Goldberg... this is brutal.  This goes to prove one thing... never pick a fight with The Donald."}]
