[{"comment_id":"1713989815484209","commenter_b":"The Senate's duty is to listen to its constituents. Therefore it should or should not act on this matter based on what they know we want.","commenter_a":"Oh how quickly Obama forgot that he filibustered the nomination of Supreme Court Justice Samuel Alito in 2006. Hypocrite!","post_message":"\"I have fulfilled my constitutional duty. Now it's time for the Senate to do theirs.\"   WATCH: President Barack Obama says if the Senate does not vote on SCOTUS nominee Merrick Garland, \"our democracy will ultimately suffer.\""},{"comment_id":"10154350131948145","commenter_b":"Yeah they'll definitely be jailed, they can track everything now","commenter_a":"@username, yep another one. Unbelievable!","post_message":"Hopefully they got to it before identity thieves did."},{"comment_id":"977678122350240","commenter_b":"Hillary is NOT with us, we are NOT with her.","commenter_a":"The Revolution!!!!! Bernie !!!!","post_message":"Bernie or Bust rally in downtown Philadelphia"},{"comment_id":"513245565531981","commenter_b":"I rarely say bad things on fabebook , but she 's a real bitch.","commenter_a":"Coulter and FOX's best days are wayyy behind them. Here's hoping this ideology of thiers dies a slow death","post_message":" know what this convention really needed? An angry Muslim with a thick accent,\" she said."},{"comment_id":"10154780872790695","commenter_b":"One tactically trained security Guard at the massacre in Orlando changed nothing.","commenter_a":"RIP young angel If the school faculty were allowed to be tactical trained and had permission to use a gun in this kind of cases our kids would be safer idiots would fear and no one will have to shed a tear","post_message":"JUST IN: The coroner has confirmed 6-year-old Jacob Hall died this afternoon.  Hall was one of three people shot during an elementary school shooting in South Carolina earlier this week."},{"comment_id":"698051370361332","commenter_b":"13th amendment, 14th amendment , 15th amendment. How many democrats wanted to abolish slaves, give citizenship to freed slaves ,and allow black to votes. And how many republicans wanted that. We can start there.","commenter_a":"@username @username learn from this man. Love you ladies","post_message":"Standing up for his beliefs!"},{"comment_id":"1713379888949123","commenter_b":"Then resign and get her out of the White House!","commenter_a":"I would like to know why people push like on these kind of post? I don't get it! Are you stupid??","post_message":"Are you... KIDDING ME!?   So sick of Barack Obama & Michelle Obama..."}]
