[{"comment_id":"869042603191993","commenter_b":"Good! Then STFU you two!","commenter_a":"So they jab him when they invite what's his face to address the congress, now they jab him with this letter to Iran. I mean are you kidding me?","post_message":"\"The letter sent on March 9th by forty-seven Republican Senators to the Islamic Republic of Iran ... is beneath the dignity of an institution I revere.\"  - Vice President Joe Biden"},{"comment_id":"10153652003074203","commenter_b":"he's going to destroy both political parties!","commenter_a":"Hes for real gonna destroy the republican party... and all of us love him for it","post_message":"One thing is pretty clear: Donald J. Trump isn going away for awhile."},{"comment_id":"10153000542416336","commenter_b":"tHE aTHEIS GROUP NEEDS TO STOP MAKING TROUBLE. IF THEY DON'T LIKE ANGELS ON THE MEMORIAL MOVE ON WE SURE DON;T WANT YOU.","commenter_a":"What about a Christians First Amendment rights?????? I am so sick of all this...","post_message":"An atheist group wants angels removed from a teacher's memorial, claiming its presence on public grounds violates the First Amendment."},{"comment_id":"10153282421385779","commenter_b":"Eat a bag of dicks.","commenter_a":"White Privilege: Being held accountable for the actions of your ancestors by people who refuse to be accountable for the actions of thier children","post_message":"Late last week, Macklemore and Ryan Lewis released a new song called \"White Privilege II,\" featuring the poet and singer Jamila Woods. The song immediately inspired praise, scorn and conversation. Here are four things Macklemore told us about the track."},{"comment_id":"717976815002166","commenter_b":"Did you read what I said? Or did I lose you after ESPN? By law, you cannot force someone to give up their body, body parts, body tissue to ANYONE, regardless of their life being in danger. So you can't force a woman to give up her body and blood and essence to someone who you've notably identified as a completely other person. And ps, bananas also have their own DNA. Oh shit looks like we can't eat fruit.","commenter_a":"I read Planned Parenthood does 30% of all abortions. Who is doing the rest of them?","post_message":"Appalling on every level. THEY MUST BE STOPPED!"},{"comment_id":"384727298550424","commenter_b":"So twisted. Islam has been illegal here since 1952","commenter_a":"Not my pOtus not my kkk","post_message":"LIVE VIDEO: 'Not My Presidents Day' anti-Donald J. Trump protests are happening across the country.  WARNING: Viewer discretion is advised"},{"comment_id":"1604088796561359","commenter_b":"someone get through their thick headed skins, that this is America and we do not have to do it. You respect my religion and I will respect yours, but this is not freedom of religion or freedom of anything but trouble. Your here follow our ways like all other immigrants have done.","commenter_a":"First of all why would you apply for the job at the place if you're Christian?","post_message":"THIS Muslim Company in The U.S. Is Forcing Their Christian Employees To Wear Headscarfs!"}]
