[{"comment_id":"1161299523890076","commenter_b":"overly politically correct, nail on the head!","commenter_a":"he offered no defense...merely doubled down","post_message":"\"I think the big problem this country has is being politically correct. I've been challenged by so many people and I don't frankly have time for total political correctness and to be honest with you this country doesn't have time either.\""},{"comment_id":"10153267785502894","commenter_b":"Lol I knew I was gonna get somebody! Yes it does and that's why being faithful and protecting ourselves is so important! It's too many fake porn stars out here...","commenter_a":"I bet too many thots out here having unprotected sex 😏","post_message":"STD Rates Have Hit a Record High in the United States"},{"comment_id":"10153757247084753","commenter_b":"She needs to stay in prison!!!","commenter_a":"She has been in jail almost 50 years let her go to die a free woman for all you goodie 2 shoes some people deserve a second chance let he who is without sin cast the first stone","post_message":"In shocking news today, Charles Manson follower Leslie Van Houten could be getting out of prison after all this time. Us Magazine shared that Leslie has now been tentatively approved for parole effective today. She has actually been turned down 19 times in the past. Most people know her as the one who wrote the messages on the wall at the murder scene of married couple Leno and Rosemary LaBianca back in 1969. At this time, Leslie Van Houten has been recommended for parole. There is nothing... @webpagelink"},{"comment_id":"10154061060138433","commenter_b":"@username -that's the point. Many have NOT committed a crime or have been overcharged to force a plea because poor people can't afford bail, or to wait in jail for a trial and to leave their kids or their job..","commenter_a":"They seem well paid to me. Especially when there's a glut of them.","post_message":"Did you see the Netflix series Making a Murderer? Remember Jerome Buting, one of the defense attorneys? PolitiFact Wisconsin recently checked his claim that Wisconsin pays criminal defense lawyers who represent the indigent $40 per hour, \"the lowest in the country.\" That rated a Mostly True."},{"comment_id":"10153493306391636","commenter_b":"Kd Ray what Arabs have to do with this?","commenter_a":"And Michigan shooter who drove uber said the app told him to kill people, mental illness comes in different shapes, this lady is terribly ill, not because she's Muslim!","post_message":"Horrific"},{"comment_id":"817764698322138","commenter_b":"What Melissa said !!","commenter_a":"You know if everyone hates you, you must be doing something RIGHT. Trump isn't an ASS KISSER.","post_message":"\"I understand why he got angry. She was asking insulting questions.\""},{"comment_id":"10153205140467426","commenter_b":"Lady shut the hell up negative nancy","commenter_a":"Please get some bike helmets for these young riders and teach them to wear it.","post_message":"Inspired by #Richmond2015? Happy riding kids!"}]
