[{"comment_id":"10155292076102501","commenter_b":"can't we keep her out of this state somehow? I tihnk every time I see her kids commercial how many unborn infants have died because of her support for abortion. Protect kids? Get serious lieing Hillary","commenter_a":". --------------------------------------------------------------------- HILLARY - BREAKING THE GLASS CEILING? --------------------------------------------------------------------- Mrs. Clinton, how can I possibly tell my daughter to follow you as an example after you allowed your husband to assault and demean multiple women throughout his political career? Were those women not important? Tell me, will you fight for my rights like you fought for those womens? Ummmm, I hope not. What about the sisterhood, Mrs. Clinton? Did you expose your husband for his abuse? No! Instead, you enabled him as the abuser and tried to silence his victims. How can you live with yourself? Female empowerment? ......... Nice try!","post_message":"Hillary is coming back."},{"comment_id":"500328103497004","commenter_b":"@username your mom is another uninformed voter. Now I'm voting for Trump just so you and your mom get hassled by immigration.","commenter_a":"Let me get this straight. Trump can beat Hillary, but he can't beat Bernie? So by voting for Hillary...you're basically voting for Trump?","post_message":"Is Bernie Sanders harming Hillary Clinton's chances against Donald J. Trump? Here's what he has to say about it. via Today Show"},{"comment_id":"908007962567959","commenter_b":"Look at that nasty excuse of a woman.","commenter_a":"That family is severely screwed up. Corrupt financially, politically, and morally! Any wonder why this society is so bad? No. Just pathetic. And they smile in the face of this country with absolutely zero remorse or accountability.","post_message":"GROSS!"},{"comment_id":"1450281048346082","commenter_b":"@username why don't you then? Rather than complaining? You are angry because women are doing exactly that for themselves but they aren't doing it for you?","commenter_a":"Machism means feminism...no extreme is good...Breast cancer has 10x more funding and support than prostate cancer (for equal mortality), there are more men incarcerated than women, men spend more time in jail then women for the same sentences...Men also suffer from inequality and starts from birth: life expectancy is lower than females and seems to be genetically driven (extra Chr X seems to provide some protection)","post_message":"Do you know what machista means? The hashtag #EsMachismo started trending, and these 21 tweets explain a lot. - Alicia E. Barrón"},{"comment_id":"1584761528498475","commenter_b":"Women should have the right to decide, but whomever is willing to oblige her and perform the abortion should be arrested and thrown in prison for being willing to be an accomplice to a murder. If it were illegal for doctors to perform abortions then she can decide all she wants. Decide away!","commenter_a":"Nicholas Moore","post_message":"If you think Trump has bad ideas - Gov. Mike Pence has actually taken women's rights away. These two make up one of the most anti-woman tickets in history!"},{"comment_id":"10153984542943690","commenter_b":"Stop stealing their land and tell the settlers to gtfo","commenter_a":"he knew the house would be demolished. he was selfish and brought it upon his family. The others thinking of attacking us should see this before they do anything they will regret","post_message":"\"Muhannad was killed but why do you have to destroy a house belonging to six others...what about the children and his elderly relatives?\"   @webpagelink"},{"comment_id":"10153425632179342","commenter_b":"Getting awfully tired of MEN telling WOMEN not to get pregnant. We can not without your sperm.","commenter_a":"This is a disgusting decision. Planned parenthood has done so much for women's health and to cut off funding will kill so many women. Short-sighted idiots. You are not pro life, you are pro birth, to hell with the before or after.","post_message":"Planned Parenthood affiliates statewide were told in a letter why they were being cut off"}]
