[{"comment_id":"577340679100840","commenter_b":"If you don't leave america it will be the end of us","commenter_a":"Yeah. We've survived Obama. Barely.","post_message":"And that's not all he said either..."},{"comment_id":"10153636348708132","commenter_b":"Eww she ugly","commenter_a":"I love her comedy routines and I think she is beautiful. I like to hold hips not bones.","post_message":"The endlessly quotable Amy Schumer!"},{"comment_id":"856436467738235","commenter_b":"Hang her!","commenter_a":"I'm a cabbie and I wish I could catch every person that skips on me","post_message":"A judge told this teen she could either walk 30 miles within 48 hours--or go to jail. She chose the long walk. See what she did below. Do you think the punishment fits the crime?"},{"comment_id":"1277480212306141","commenter_b":"Yeah, she's a racist.","commenter_a":"STOp THE HAte","post_message":"CLAREMONT COLLEGES “Students Of Color” REFUSE To Live With Whites: “I don’t want to live with any white folks”…”Don’t see how this is racist at all”"},{"comment_id":"10153874445353132","commenter_b":"Women WE MUST UNITE AGAINST STUPIDITY!,","commenter_a":"Did y'all read the article or just start running off at the mouth?! I, too, had the same reaction until I actually read the article. This congressman did not come up with this if his own accord. It was reported to him by the ones who trained them. THEY said there was special treatment.....not the congressman.","post_message":"\"Fighters must be prepared and capable. If they are not, people will die.\""},{"comment_id":"10153228723406336","commenter_b":"Please these Repigs are tooo much..HILLARY CLINTON WILL BE PRESIDENT Regardless of all the BS Faux NONEWS says and EXAGGERATIONS from Hannipig","commenter_a":"Listen for the \"vast right-wing conspiracy\" defense.","post_message":"Hillary Clinton has agreed to testify on Capitol Hill later this month about two controversial issues when she was secretary of state – the fatal terror attacks in Benghazi and using a private server and emails for official business."},{"comment_id":"651982771617164","commenter_b":"SEND HER BACK TO WHERE EVER SHE CAME FROM ! LET HER WHINE ALL THE WAY HOME !","commenter_a":"Yap she's crazy..go home.","post_message":"Woman Goes On National TV And Blames Americans For Banning Sharia Law And Executing Kids In... This must be some kind of sick joke. Do you think she has completely lost her mind?"}]
