[{"comment_id":"10153577383622061","commenter_b":"she is an african american woman and can clearly see the hand on the jacket is a white persons hand. Open your eyes","commenter_a":"This has to be photo shopped. The woman has 3 hands. 2 on her face and 1 on his coat. My father was a fireman too, but would not have been allowed to pull a stunt like this!","post_message":"WATCH: Firefighter goes to great heights, literally, to make one stunningly beautiful proposal!"},{"comment_id":"10153395852497629","commenter_b":"aSSHOLE NIGGA LOVER!","commenter_a":"I think it's safe to say they are not accusations but are indeed facts","post_message":"The interview is expected to include Dolezal’s first major comments regarding accusations that the she lied about her race."},{"comment_id":"1703022976604096","commenter_b":"For everyone trying to give intellectual insight to a Trump supporter, you're wasting your time. I don't expect any moron to get it, neither should you. With Newt, he's guaranteed to lose, and be irrelevant, and then the rest of ua educated americans can get back to a #TrumpFreeReality . #TrumpSupportersareMORONS #DumpTrump #AMERICAISALREADYGREAT","commenter_a":"Absolutely I would vote for these two gentlemen. Newt could and would immediately provide the information and experience to \"hit the ground running\" I believe this would be an awesome team.","post_message":"Rumors are swirling that Donald Trump could pick former House Speaker Newt Gingrich as his running mate. Would you vote for this ticket?"},{"comment_id":"512513402270286","commenter_b":"take her ass outside and hang her","commenter_a":"Everything became a talking point of deflecting responsibility to her experts.","post_message":"Rep. Jim Jordan questioned Hillary Clinton about Benghazi attack: “You tell Americans one thing, but your family an entirely different story” WATCH and SPREAD!"},{"comment_id":"528487337334584","commenter_b":"#FUCKTRUMP #FUCKTRUMPLATINOS & YOU","commenter_a":"Latino for Trump! You don't have the explained anything. The system is crooked!","post_message":"STATEMENT REGARDING TRUMP UNIVERSITY It is unfortunate that my comments have been misconstrued as a categorical attack against people of Mexican heritage. I am friends with and employ thousands of people of Mexican and Hispanic descent. The American justice system relies on fair and impartial judges. All judges should be held to that standard. I do not feel that one’s heritage makes them incapable of being impartial, but, based on the rulings that I have received in the Trump University civil case, I feel justified in questioning whether I am receiving a fair trial. Over the past few weeks, I have watched as the media has reported one inaccuracy after another concerning the ongoing litigation involving Trump University. There are several important facts the public should know and that the media has failed to report. Throughout the litigation my attorneys have continually demonstrated that students who participated in Trump University ..."},{"comment_id":"10153330396398812","commenter_b":"I was just about to say- and watch all the females flock to this rich young single male Hahaha","commenter_a":"@username i actually think I'm in love","post_message":"This CEO says executive pay is \"out of whack.\" So, he's going to start earning $70,000, like many of his employees: @webpagelink"},{"comment_id":"10152670445845927","commenter_b":"Give that money to the Border Patrol, and arm them to convince aids-ridden latinos to stay on their side of the fence !","commenter_a":"Sick! No matter how sinful humans try to avoid the consequences of this horrible sin, God's word (Romans 1:26,27) assures that they will receive in their bodies the automatic payment for their wrong. God doesn't lie and He never fails.","post_message":"The study is to find the best ways to convince gay Latino men to wear condoms and get tested for HIV."}]
