[{"comment_id":"1350025431679743","commenter_b":"Lmaoo thats why i say i cant be no girl","commenter_a":"See Babe Its Not Easy Being A Girl @username","post_message":"Women shouldn't have to spend a fortune on bras. Like ATTN: on Facebook."},{"comment_id":"10153302212427439","commenter_b":"All other real religious beliefs will be outlawed !! Muslims don't do real religion ,,!!","commenter_a":"I guess he's all for isis and how shiria law can't be separted from the musilim religion they go hand and hand. And he's all in for this no such thing as islamophobia we can and will protest any genocide against anyone","post_message":"This is full blown sharia in the UK – not only will our ban not be lifted, I would expect more voices of freedom banned. UK: Labour leader says his government will criminalize “Islamophobia”, (thanks to Jihad Watch), April 26, 2015 We are going to …"},{"comment_id":"10153966184001037","commenter_b":"She is crazy & evil!","commenter_a":"Obama started the war in Iraq?","post_message":"Sarah Palin opens up about her son's arrest: “My son, like so many others, they came back a bit different.”"},{"comment_id":"675517259277271","commenter_b":"And now you know .......the rest of the story","commenter_a":"Good questions","post_message":"Hear, hear!"},{"comment_id":"10153956285791880","commenter_b":"@username I'm white. I'm not mad bro. But was that kid in Ferguson mo a thug and literally just robbed. Convenience store? Sure back lives matter.. I'm indifferent tho.. Any race, sex or creed comes at me Wrong I'll end you. Period.","commenter_a":"All the white ppl mad!! Lmao, after the 400+yrs of oppression that they weren't victims of, they want to be included in a black lives matter movement... Smh, never been discriminated against, but black lives matter is a racist cult?? Can't c the forest from the trees...","post_message":"The Facebook CEO issued a companywide memo chastising employees who have been crossing out the phrase “black lives matter” and writing “all lives matter.”"},{"comment_id":"838829739577213","commenter_b":"Yes! They should be arrested!","commenter_a":"As long as it includes under God!","post_message":"This is disgusting. Do you support the Pledge of Allegiance?"},{"comment_id":"10153233936119170","commenter_b":"Yes, she belongs there. Always enjoyed this show and hae a good laugh at some stupid people.","commenter_a":"Fodder for \"World's Dumbest Drivers\".","post_message":"Behold a video of the worst parking job in human history. Newsworthy? Probably not. Hilarious? Definitely."}]
