[{"comment_id":"10153733713798984","commenter_b":"Amen. And with the way that woman looks, she'll be working the counter at McDonalds.","commenter_a":"If you can't or won't do what your job requires, then find another job.","post_message":"The husband of Kim Davis wants to send a message to the judge who jailed his wife, and he only needs six words to do it. He is not at ALL happy with what is happening to Kim, but it is clear that he and his family are not going to back down from their beliefs.  Do you support Kim Davis and her family?"},{"comment_id":"10153875046907235","commenter_b":"So did Ollie North! The fuckery.......","commenter_a":"\"Former United States Attorney general sold guns to drug cartels.\"","post_message":"WHOA"},{"comment_id":"10154886159283010","commenter_b":"Hippie bitch is a nobody","commenter_a":"The left is still jockeying for attention...and this is the best they've got..Less than impressive..","post_message":"A political twist on a holiday classic."},{"comment_id":"10154356585776509","commenter_b":"The mass shooter in California, were not by Americans. They should establish a law that anyone who comes into this country looking for citizenship should established themselves as Americans ,have at least 2 year or more waiting period. Until they do an extensive background check","commenter_a":"When black people kill white people and rape white women you don't see no tears from Obama. When Muslims terrorize and kill people cut Christians heads off you don't see no tears from Obama","post_message":"President Barack Obama wipes away tears while speaking about victims of gun violence: \"Every time I think about those kids it gets me mad.\" @webpagelink"},{"comment_id":"10154915468813984","commenter_b":"The demasses aren't scared of the end. They're scared none of their demon plans to let illegals run our country will be stopped and their kickbacks will end. Yep it's gonna end. We are not your puppets and you can't control us!!!!!","commenter_a":"right on","post_message":"Ann Coulterjust NAILED it... she is going to infuriate a TON of liberals with this."},{"comment_id":"1954618021430775","commenter_b":"It aint over till the fat lady sings,lol","commenter_a":"Mark my words, in future presidential elections, candidates will try to do what Donald Trump is doing.","post_message":""},{"comment_id":"10153334889369369","commenter_b":"Crazy btch","commenter_a":"@username Olivia Salvatore","post_message":"At 3 stories high and 3,000 square feet, this might be America's largest closet.  [\"Secret Lives of the Super Rich\" airs tonight at 10p ET/PT.]"}]
