[{"comment_id":"1621412104829954","commenter_b":"She needs to go and climb under a rock","commenter_a":"This woman is disgusting.....","post_message":"Lady Gaga just stunned her fans when she wore this out in public..."},{"comment_id":"1774855949444875","commenter_b":"Really are we surprised??? He has been committing political suicide for over a week now and handing it to Hillary with the comments about over weight women, his tax evasion, and then of all things to attack the vets???? Pitiful win if you ask me and sad that she is not winning with a landslide.","commenter_a":"Pence is going rogue! :):) He's pulling a Sarah Palin....he's running in 2020! :):):)","post_message":"A new poll in one key battleground state shows Donald J. Trump's campaign facing some trouble ..."},{"comment_id":"10154299169246051","commenter_b":"@username u would suck D. Chump dick if u had a chance. What a brain dead sheep u are.","commenter_a":"He's being practical. People were thinking it would be like the Great Wall of China, not realistic. He's still going to protect the country and secure the borders.","post_message":"Donald Trump just announced his giant wall isn't happening after all - and the reason has people outraged."},{"comment_id":"1891157881114099","commenter_b":"that's something you would need to record lol","commenter_a":"@username this would be something you would do lol","post_message":"Now that's a f.d up prank. #WSHH"},{"comment_id":"1059948200694894","commenter_b":"She isn't a women, if she was slick Willie would deny ever having sex with her","commenter_a":"Unlike him, she should be under federal indictment and disallowed from running for any office at all.","post_message":"It's getting downright catty between Hillary Clinton and Donald Trump."},{"comment_id":"1134554249934436","commenter_b":"Lol. She is a democrat. I hope you never wander into a voting booth","commenter_a":"We must stop the democrats and Hillarys war on women and the unborn!","post_message":"Every dollar goes toward making sure Donald J. Trump never becomes president."},{"comment_id":"10153243002653984","commenter_b":"Liberal women who are blind & have cement between their ears!","commenter_a":"Why is anyone even considering Hillary for the next president??? Ar","post_message":"Hmmm I wonder why they wanted to keep this a secret... Do you hope Hillary gets defeated in 2016?"}]
