[{"comment_id":"10154264831942411","commenter_b":"@username Did you even look at the picture?","commenter_a":"Enjoy climate change people humans are to blame for early spring weather.","post_message":"We've never seen anything quite like it."},{"comment_id":"1325251154159559","commenter_b":"A new report by NBC just released today says that Chelsea Manning maybe subjected to permanent solitary confinement charges coming from her recent suicide attempt. Is the Obama administration trying to strong arm Wikileaks? I can't imagine that being a coincidence. We must stand up for Chelsea Manning! Whatever happened to no cruel or unusual punishment?","commenter_a":"AS empty a bunch of words as when Republicans claimed them. Easy to be optimistic when you are rich, less so for the masses.","post_message":"With his last convention speech, the president forced pundits to acknowledge that Democrats are taking back an optimistic worldview, writes Neal Gabler of USC Annenberg Norman Lear Center."},{"comment_id":"1736127839964656","commenter_b":"Maybe she should be mad at the powers to be who wanted it kept quiet.","commenter_a":"Maybe tptb should have done thing differently but since it all came out kelly has been a spoiled hateful spiteful bitch. If tomorrow is his last day I hope puts her on blast through the entire show.","post_message":"She’s reportedly not making things easy for him."},{"comment_id":"682546678578123","commenter_b":"Historical facts, not rumors, not hearsay just plan undeniable facts. (This is just a small percentage of a much longer list ) Of the two candidates running for president... Only @username was caught lying to congress. Only @username was fired from a job for being unethical. Only @username deleted 30 some thousand emails after she was ordered to hand them over to the Fed. Only @username had that same computer wiped clean by professionals. Only @username got the rapist of a teenage girl off on rape charges then laughed about it. Only @username lied to the American people about Benghazi. Only @username lied to the American people about her emails. Only @username lied about being under sniper fire. Only @username lied about lying to the American people. Only @username was involved in \" Cash Cow \" Only @username has a long list of scandals. Only @username nationally belittled her husband's ...","commenter_a":"If you hate her so much why do you sad feckers bother to be here? And have you actually looked at Trump? The rest of the world are scared shitless that he'll get in. Oh, apart from Russia.","post_message":"Born before women could vote, Ruline just cast her ballot for Hillary in Iowa today. Join her: IWillVote.com"},{"comment_id":"1659939417632867","commenter_b":"This would be true if Hillary got in! Stupid racist black woman!","commenter_a":"Real Hope and Change is coming to Americans !!","post_message":"SHE'S BACK TO HATING AMERICA: It's the end of \"hope and change\" and Michelle, for one, isn't happy about it."},{"comment_id":"10153557846293984","commenter_b":"just leave her alone!","commenter_a":"For gosh sake's, get a life!","post_message":"Wow, just when you thought people forgot about Paula Deen's problems, this shocking photograph surfaces..."},{"comment_id":"10153628847251336","commenter_b":"Shes so nasty","commenter_a":"She is a disgusting person trash","post_message":"What did you think of Miley Cyrus' barely-there ensemble?"}]
