[{"comment_id":"10154720282189170","commenter_b":"B.S. She's campaigning for Hillary, and fighting for gun control. She's an adult who's inserted herself into the process. Don't want to take the heat? Stay out of the fight.","commenter_a":"She is not a politician. She should be left out of it.","post_message":"Wow.  Five bucks says Chelsea will do everything in her power to dodge this question in the future."},{"comment_id":"1213265855432501","commenter_b":"I quit watching long ago. Now I know why. Bunch of bitches!","commenter_a":"Why don't they just give it up... Everytime they say something bad about Trump their show loses viewers. I never watched them but if I came across it channel surfing I'd stop and see what was on... Now I will keep surfing.... And I'm sure I'm not the only one.","post_message":"Joy Behar of 'The View' just said Donald Trump will bring “mental illness” to the White House."},{"comment_id":"10157696214715603","commenter_b":"Lol @username not gonna happen","commenter_a":"Don't believe the media...Hillary's poll numbers are falling faster than Bill Clinton's pants in an Arkansas trailer park...","post_message":"Hillary Clinton forcefully challenged the FBI's new email inquiry Monday, declaring during a campaign rally in battleground Ohio, \"There's no case here.\""},{"comment_id":"635677536633830","commenter_b":"Demons","commenter_a":"@username read the top comment 😂😂😂","post_message":"Name it!  #WSHH"},{"comment_id":"1075829105767772","commenter_b":"They blame it on Obama....for \"existing\".","commenter_a":"I swear, in some ways things are worse now than they were 50 years ago. Some try to say that it's just among old white people. . . well those folk seem to have done a pretty good job of passing it down.\\b\\b\\b\\b","post_message":""},{"comment_id":"10153035783794877","commenter_b":"hes right yall hoes more worried about her hair then her policies..","commenter_a":"Pretty amazing the priorities of the majority of blacks. Grio post an article about a federal investigation on police, and folks talking about how the Mayor hair and lips... Then we wonder why black folks are look down on.","post_message":"The Baltimore Police Department probably isn't happy with what Mayor Stephanie Rawlings-Blake just asked for. Get the scoop below.  Grio fam, was this the right move? Will it pan out? Sound off..."},{"comment_id":"10153484924965861","commenter_b":"Impeach her","commenter_a":"Mary Failin was trumped","post_message":"BREAKING: The Oklahoma Court of Criminal Appeals has granted a two-week stay in the execution of Richard Glossip."}]
