[{"comment_id":"10153105977467098","commenter_b":"YUP!! We always Been Here!! Who the Real Illegals!!","commenter_a":"Every race that is not latino or native american is an illegal inmigrant or descendant OF an illegal immigrant latinos ARE from this continent OF AMERICA... North central and south AMERICA ANYONE else their ancestors came on a boat across The Ocean and The atlantic ALL WE Did WAS cross an imaginary Line Lmao.... americans huh..... WATCH WHO u call a wet back we didnt have to cross The atlantic TO GET here wet backs","post_message":"Donald Trump would not say how he would locate, round up and deport the 11 million undocumented immigrants he says must go."},{"comment_id":"10154451806701336","commenter_b":"@username no he wants to ban people ! Refugees are properly vetted - since we have had close to a million come in since 911 !","commenter_a":"Something is wrong with the America I grew up in.. it's called liberalism!","post_message":"Just In: Elderly patient and nurse shot and killed at hospital in Titusville, Florida. Police have not released information on suspect or motive. More: @webpagelink"},{"comment_id":"1700724426879591","commenter_b":"Fuk Oprah. She had her run and time. Its over now. Another billionare who knows whats best for others. Sit down and shut up Oprah.","commenter_a":"Is Oprah muzlim Is whoopie they sure fighting for them hard and they killing all American people plus Christian people","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"10153332076309411","commenter_b":"Remove NATO from their borders","commenter_a":"Russia must stop being aggressive by removing all warships, and submarines, from international waters - these waters belong to the US and its allies, even though they are international :)","post_message":"The 'hunt' is on"},{"comment_id":"1266165143423955","commenter_b":"This woman is such a moron. Send that lunatic Syria then see if she still thinks they ate doing gods work what an idiot","commenter_a":"Your kidding right ? Sick out of it, to hate that much.","post_message":"HOLY F*CK!"},{"comment_id":"724107867720000","commenter_b":"send thim all home, they dont belong in the USA.","commenter_a":"you dont like our flag go home","post_message":""},{"comment_id":"10153131425722293","commenter_b":"They are our imagine of the \"freedom\" .","commenter_a":"Yes.","post_message":"Experts fear a whole slew of risks that may follow should these tribes come into full contact with the outside world."}]
