[{"comment_id":"10153888112799330","commenter_b":"God bless you all.","commenter_a":"I hope they gave you the treat and treatment of the hereo you are. Awesome job Officer Axel.","post_message":"Axel helped save a missing woman after finding her in a pond in Tolland early this morning. ---> @webpagelink  How about some \"likes\" for Axel."},{"comment_id":"611945445596715","commenter_b":"To accept defeat to a liar, who had the questions ahead of time, who has lied over and over - HOW CAN HE ACCEPT IT? I doubt the American's will acept Hillary as president, as they rejected Obama!!!! Voter fraud is alive and well. NO voter ID? Illegals being PAID TO VOTE DEMOCRAT? HARDLY FAIR OR BALANCED.","commenter_a":"Why wasnt it asked to hillary..","post_message":"During the final Presidential debate, Trump refused to say if he would accept the results of the election. Many believe this will threaten the time-honored tradition in which the loser recognizes the legitimacy of his opponents election to office in order for a peaceful transfer of power to occur.   Should Trump accept the results of the election if he loses?"},{"comment_id":"10153952706726323","commenter_b":"Show the UK the door Lol! We want out and you to go home.","commenter_a":"7 years in England and I have never met an English person that defined themselves as European, British when they want to show how broad their borders can be. We don't even share the same values, we interpret our history in a completely different way. They made of us a 'Brand', neglecting our own background, dignity, honesty, skills, and so on... unless you speak as they do, or you are a CEO,CFO, any kind of abbreviation really will do...only then you will be treated nearly as an equal. Dear Europe, do not succumb to this hypocrisy and show them the door.","post_message":"'I have negotiated a deal to give the UK special status in the EU. I will be recommending it to cabinet tomorrow'"},{"comment_id":"10152746460981636","commenter_b":"Feminists are heavily invested in the rape culture narrative, the fact that they always attack rape prevention shows this","commenter_a":"Did you dare to suggest that the onus should be on the perpetrators of rape instead of the victims? Prepare for a tirade of comments accusing you of 'calling all men rapists'...","post_message":"Perhaps the focus should be on the perpetrators of rape, rather than potential victims?"},{"comment_id":"10154105448940950","commenter_b":"@username So many foaming at the mouth racists until he will need them. He will need them in heaven.","commenter_a":"This \"news\" is like a week old. Why do I care if she wants her son to finish school with his classmates this year? Most parents would do the same.","post_message":"Melania and Barron Trump plan to remain in New York City until at least the end of the school year."},{"comment_id":"10158795471470206","commenter_b":"My smartphone is a machine-gun!","commenter_a":"Journalism....there's the headline, then there's the complete opposite being stated in the article. Maybe the journalist just didn't understand that big word 'refuted'.","post_message":"The Superior Court of Justice decided to punish the players for failing to play their match."},{"comment_id":"999687850098947","commenter_b":"FGM - Female Genital Mutilation. The stats about it: @webpagelink","commenter_a":"The awkward moment where liberal values clash with Islam and no one wants to stand up for the gay man to avoid insulting Muslims...","post_message":"“My religion is very clear about what happens to gay people...\""}]
