[{"comment_id":"895076240539004","commenter_b":"Angela and Sheira close your fucking legs, Whores!!!!!!!!","commenter_a":"Unborn Baby's are Human at the time of conception.....Duh.....that's not hard to figure out. When you abort AKA MURDER a Baby at any time after conception it is very simple.....IT'S MURDER.....just watch our Court system when a drunk kills a pregnant woman they will be charged with the MURDER of the child as well. There are just some people that will argue against the facts to try to justify MURDER but make NO MISTAKE it's MURDER. Just because you get pregnant and it's inconvenient and you call it abortion, does not change the fact everyone knows in their heart IT'S MURDER.","post_message":"How cool is this?"},{"comment_id":"1054986811286811","commenter_b":"She is looking weak","commenter_a":"Hillary Clinton is as transparent as mud. She's so deplorable....no wait...I don't want her sharing my basket. Trump/Pence 2016","post_message":"Question of the Day: Do you think Hillary Clinton has been transparent about her health? Share your thoughts below!"},{"comment_id":"10154743377731037","commenter_b":"Keep 'em coming. Nothing's going to change my mind or anyone else's. The one thing that all of you had in common before today is that Hillary already had you fooled. It's not working on the rest of us, so sit back and enjoy the next four years that not only I know is coming, but SHE CLEARLY KNOWS IS COMING, hence the grasping at straws that we are witnessing this morning.","commenter_a":"It's hard to distinguish between the most rotten pile of trash this morning! You have: -the \"accusers\", who have remained silent throughout the whole campaign until Andy Cooper asked a question that, in his coke-addled and cock-obsessed mind, he thought would surely win him a Pulitzer. -the Clintons. ('Nuff said) -the MSM thinking that we'd all just magically buy this crap. Don't be fooled, America. You see the direction that they are bending over backwards to point you in. Vote Trump and let them know that you're not going to stand for it any longer!","post_message":"A woman alleges she was raped by Donald J. Trump when she was 13 years old in the mid-1990 — and now Law & Order: Special Victims Unit' is taking on the case."},{"comment_id":"853456421380774","commenter_b":"She can only be arrested if she goes to Egypt so best she stays away . But good she speaks out","commenter_a":"Good","post_message":"Clooney’s wife threatened with arrest."},{"comment_id":"593792507477995","commenter_b":"Leave the girls alone.","commenter_a":"In all fairness now, you'd take Drugs too if you had those two Lying Muslim Idiots for parents! LOL","post_message":"The White House is in uproar after Obama daughters caught doing THIS.  This is outlandish. These are the daughters of our president.  Would you vote to kick the Obamas out of the White House?"},{"comment_id":"10152956045287093","commenter_b":"Don't leave the drawers open","commenter_a":"@username pretty sure this is my dresser lol","post_message":"RECALL ~ IKEA is recalling 27 million adult & children’s dressers because of a tipping hazard…2 toddlers were killed when their dressers tipped over on them… @webpagelink"},{"comment_id":"774995235932418","commenter_b":"^Oh Lord, the grammar/spelling in that last response. Anyway,saw photos, she's white but husband and kids arent, for those who care one way or another.","commenter_a":"Why doesn't the headline read white officer killed by a person of color?","post_message":"A very sad story."}]
