[{"comment_id":"10155892133225231","commenter_b":"Nancy you have the right attitude. The train operators succumbed to some questionabally motivated sour pusses and got a snootful of bad publicity. So dumb. Ladies of that age/demographic have disposable income.","commenter_a":"Laughing and talking too loud? Those are the ladies I want to ride with!","post_message":"They had no idea that laughing and talking \"too loud\" would get them escorted off the train."},{"comment_id":"1160091574027415","commenter_b":"You are more than disgusting","commenter_a":"Yes!","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"832286116867642","commenter_b":"Obama, \" I visited all 57 states.\" Pretty supid, huh a-hole?","commenter_a":"More of the same GOP = Stupid 🐷🐷🐷🐷🐷","post_message":"Rebuttals galore!"},{"comment_id":"10153010169898984","commenter_b":"Truth or not, IMPEACH him now. He is not good for America or for the American people.","commenter_a":"He's another Teflon Politician!!!! Makes no sense!","post_message":"[Best of 2014 Compilation] Back in Feb. 2014, Steven Seagal had some pretty harsh words for Barack Obama. Surprise! There are actually some actors in Hollywood who don't follow the party line..."},{"comment_id":"10153357050192464","commenter_b":"Israel is bankrupting America, rich Jews are destroying democracy & destroying jobs here in America, Jewish love-of-money & Golden Calf worship & other anti-Christian values are totally corrupting America and infecting the world such that Talmudic-believing Jews have put us on the path to the 6th Mass Extinction of Live on earth. And for 35 years we've had Presidents who love love love Israel, to America's detriment. I believe God is punishing America for supporting Israel. It is time we have a Pres who doesn't believe the propaganda, who sees Israel for what it really is, who knows Jews are no longer the poor, hungry victims of discrimination & the Holocaust but are now the oppressors & suppressors & war-mongers, the rich, greedy & self-serving people who don't give a damn about the USofA or the American people but only care about themselves. And we need a POTUS who isn't ...","commenter_a":"Look at the country's that take money We get no TAXES and the PEOPLE get no help","post_message":"SHARE if you agree we need a President who will #StandWithIsrael!"},{"comment_id":"10153957745968132","commenter_b":"wow pretty stupid its not like the jungle book jeez idiot she should be caged","commenter_a":"Who the hell in the PEOPLE staff is in charge of the facebook page that writes obsurd comments?? What the hell is terrifying about this situation?? Nothing! She was a moron that snuck into a zoo and decided to pet it. She got what was coming to her. Terrifying..would be if it's normal business hours and a tiger came out of its cage.","post_message":"This is so terrifying!"},{"comment_id":"1411629742215405","commenter_b":"She is nothing but a stinken trouble maker, kick her behind out of our country","commenter_a":"This fk needs to go","post_message":"Socialist Seattle City Councilwoman Kshama Sawant said activists should demand the mayor use local police to block Immigration and Customs Enforcement agents. Read both sides [here: kiro.tv/SawantOnICE] and tell us what you think: A. Yes, we need to hold ICE accountable B. No, police are needed for all protests C. We need a solution, this isn’t it. D. Wait, what? E. (Enter your own answer)"}]
