[{"comment_id":"1250456418323110","commenter_b":"Wonder what he or she was gonna tell on Clinton. What does that make now 4or5.","commenter_a":"How many more?","post_message":"DEAD!"},{"comment_id":"1695714467362766","commenter_b":"You must have missed the fact that two pedophiles are involved in this legislation. One had to back down and the other is going strong. Has nothing to do with mixing anything up. It's the consequences and the perverts backing this type of legislation. Are you going to day pedophilia is okay now?","commenter_a":"Has a \"sign\" ever stopped a pedophile before?? No. Classifying transgender and pedophiles in a group together is just so wrong. Boys are sexually abused at double the rate girls are so why is everyone not up in arms for their sons? And statistically pedophiles prey on children they know. Family members/close friends not random children in a public bathroom. What does it matter what parts the person in the next stall over does or doesn't have? There in there to pee just like you and go on with their life! Thats my two cents on the whole subject! But apparently many people feel so differently and even though I don't understand it I respect that not everyone agrees!! I do however feel so heartbroken for the entire transgender community whose repeatedly being compared to pedophiles.","post_message":"\"This means a man can simply say he 'feels like a woman today' and enter the women's restroom... even if young girls or women are already in there,\" stated the American Family Association, which started the petition."},{"comment_id":"10157007075205725","commenter_b":"#BOGOSale - FINAL CLEARANCE: Hypocrite Hillary AND Slick Willie = two for the price of one!! CLEARING THEM OUTt!! #TrumpTrain #MakeAmericaGreatAgain","commenter_a":"Trump versus Hillary, lets do this voters. We do NOT need Hillary (Obama) Clinton in the White House. Thanks Mr. Trump. Vote Trump...lets get him to Washington!","post_message":"So interesting that Sanders beat Crooked Hillary in Indiana. The dysfunctional system is totally rigged against him!"},{"comment_id":"10154826794495673","commenter_b":"@username is the picture of white privilege. Southern white belle. She was raised that way. She can't help it that she was taught to not think for herself and be afraid of being touched by a black person.","commenter_a":"HELL NO!!! This black racist woman is a poor excuse as a human being, she would only use and abuse the American people just as her failure of a husband did. No more Obama's or Clinton's should be allowed near The White House!!","post_message":"Do you think Michelle Obama could make a good president some day?"},{"comment_id":"847481612018670","commenter_b":"Kick them out of the country,they do not deserve to live here! DEPORT!","commenter_a":"Deport them to Iran.","post_message":"OUTRAGEOUS: Little Muslim Rats At Public School Walk Out When NATIONAL ANTHEM Plays Do you agree they should be deported?! Share this EVERYWHERE if you do! @webpagelink"},{"comment_id":"999021020109368","commenter_b":"This is legislature that should ONLY be debated and decided BY WOMEN!!","commenter_a":"mayam merouane ok @username","post_message":"What a brave woman"},{"comment_id":"784480358346621","commenter_b":"The whores knew what they went to Mr. Cosby room for money and sex. I say they didn't get pay they got laid .","commenter_a":"My lord there is a lot of racists here!","post_message":"We can only dream! Cheney masterminded a war based on lies to funnel $37 billion in no-bid contracts to his \"former\" defense contractor company, Halliburton. When will his time be up? Image by Occupy Democrats, LIKE our page for more!"}]
