[{"comment_id":"10153868198207994","commenter_b":"There is a need to protest because even though this vile cop has been charged, he hasn't been convicted. We know how sympathetic jurors are to police. Hell most of the people commenting here would probably find him not guilty. This is more than just one bad cop. This is institutional.","commenter_a":"I sure hope it don't escalade into a riot and looting, that's all Chicago needs","post_message":"Protesters are beginning to march in Chicago right now just after disturbing video of a white police officer shooting a black teen was released. CAUTION: Viewer discretion is advised."},{"comment_id":"1263042020429217","commenter_b":"She started the whole thing ...she spit on him and was calling him a n***** ...she even lied and said she didn't even hit him or anything and begged for the video to not be shown.she is also suing the restaurant and this is not the first time she assaulted someone and lied about it .she is scum and a money hungry bitch","commenter_a":"Everybody saying she deserved it, just hope your daughters don't instigate something and get her ass beat.","post_message":"Totally uncalled for!  #WSHH #Oklahoma #JoeMixon"},{"comment_id":"10153879434881337","commenter_b":"and fuck u bitch","commenter_a":"FUCK OBAMA!!!!!!!","post_message":"PRESIDENTIAL APPROVAL: Kendrick Lamar keeps it short and sweet with his reaction to Barack Obama's \"song of the year\" praise..."},{"comment_id":"10155111433599614","commenter_b":"@username in Oregon not her she stinks hahah","commenter_a":"Jessica @username Davenport what an idiot lol","post_message":"The woman said she tried to get her pet ball python -- \"Bart\" -- out using cooking oil, but that didn't work.  She went to the hospital, where her ear was numbed and stretched even more, freeing Bart.  \"He acted like nothing even happened and was totally chill,\" she said."},{"comment_id":"1089823474413307","commenter_b":"Rhonda, your ignorance of reality is amazing!","commenter_a":"This administration MUST GO, PERIOD. Why is O allowed to take actions that have harmed this country in the eyes of the world???","post_message":"Yesterday, the Pentagon announced that the Russians could be told the location of our ground Special Operations troops in Syria, so that their Russian Air Force avoids them. This is a grave mistake. Once again, the President's administration demonstrates their inability to lead as Commander-in-Chief. Because he does not have an effective strategy for defeating ISIL/ISIS, he is putting troops on the ground without the protection of our air forces and asking the Russians, politely, to not bomb them. For over 50 years, our air forces have ensured no member of the American military has been killed by an enemy airstrike. I hope the Administration’s poor decision-making does not change this fact.  @webpagelink"},{"comment_id":"583909811799598","commenter_b":"Go away ugly rumors nasty gossip ho away","commenter_a":"So do it already and quit saying you're going to.","post_message":"Obama was just caught red handed in a massive act of treason.  Throw him out of the white house already. He is a criminal?\\t  Would you be happy if Obama was impeached immediately?"},{"comment_id":"1411832842165706","commenter_b":"No sympathy here...he's a paid hack for Hillary...and so he just lost all credibility..He supports sharia law,with connections to her foundation and Saudi's...he has worked on policies for moohslim immigration into this country..He's dangerous and a radical.....Of course we find this out after the fact...which were lie perpetrated by the left..progressive librals..with an agenda....always a strategy and agenda..!!!!!!!!!!!!","commenter_a":"You are correct Rush, he needs to move away from attacking the attacker (old Scientology technique) and focus on his message.","post_message":"If Trump does not start seeing things through an ideological prism, he will never understand the method, the motive, and the how and why these attacks against him happen."}]
