[{"comment_id":"10153191726563132","commenter_b":"Oh ladies...smh","commenter_a":"Angie --we need to get Kathy on this situation.","post_message":"Won't you lend a paw?"},{"comment_id":"10156389241130725","commenter_b":"if the so called good muslims are offened with what Donald Trump is saying why are they not stepping up and reporting the ones that are trying to hurt us,that offens ME!","commenter_a":"On Trump, his blocking Muslim entry is due to terrorists in with refugees, Americans as terrorists coming back not the innocent and good ones, he wants to stop the entering to get the bad ones out first to protect Americans. I agree with @username","post_message":"Statement on Preventing Muslim Immigration:"},{"comment_id":"10150935121129999","commenter_b":"She did say that but she said it was because of the mother's health.","commenter_a":"As an avid hater of Trump, it's hard to read this because I am so tired of Trump supports blaming all bad press about Trump on the \"liberal media\" but this is supposed to be a fact checking exercise and it is just so obviously biased and sarcastic and the tone does not come off as objective at all. It would be nice to see something written that fuels the \"evil media\" fire a little less.","post_message":"We're fact-checking the presidential debate with Hillary Clinton and Donald J. Trump: @webpagelink"},{"comment_id":"10153544235856880","commenter_b":"My money is on Donald getting it done.","commenter_a":"Trump 20 16. Yes they will I am business man and I know I would make them pay it. Cost 30 billion","post_message":"Sorry, Donald."},{"comment_id":"642298305928438","commenter_b":"she needs to bait Bill to keep him away from other lady`s","commenter_a":"Even if this is true, what does it say about Trump that he is so easily baited. Trust me Little Miss Bimbo, Trump doesn't need anyone to bait him, he finds ways to be an ass all by his lonesome.","post_message":"It isn't like he makes it really hard. I don't think he needs any help."},{"comment_id":"10153907516071178","commenter_b":"Colbert is out of touch with reality","commenter_a":"Colbert and Koppel who ?","post_message":"It's like a liberal media love-fest."},{"comment_id":"1239000506196199","commenter_b":"WE NEED A BILLIONAIRE VIGILANTE TO STOP THE RIGGED SYSTEM THAT LET HILLARY CLINTON GET OFF!!!","commenter_a":"So he really thinks minorities are buying this load of BULL💩💩💩💩💩💩💩💩💩💩💩💩","post_message":"\"We will honor the people with the truth and nothing else,\" Donald J. Trump said during his acceptance speech at the #GOPConvention."}]
