[{"comment_id":"1174759955897808","commenter_b":"And assholes will be assholes!","commenter_a":"They are F'n PIGS... We learned that in the sixties... How soon the ignorant forget. PIGS BE PIGS... NOTHING HAS CHANGED","post_message":"We FINALLY have the proof!"},{"comment_id":"10155146637143984","commenter_b":"Sad part Brenda Gantt at best they will pat him on the hand deport him without any consequence for ehat he did, he will turn around without a wall to stop them and illegally enter again.There was an incident ehere a woman lost her daughter unborn grandchild and new son in law to an illegal no consequences.She and several tried to get illegals deported what she got in my oppinion was a slap in the face, it cost too much to send them back where they came from.SERIOUSLY SHE PAID THE ULTIMATE PRICE TO BE TOLD THAT? No i say meet the authorities at the border say here are illegals we are returning.We need stricter rules if they are here they need to suffer same consequences a citizen does, whether here on a visa or illegal with no consequences for judgement given from court","commenter_a":"Ha ha Mexico will never pay for the wall and when they send the illegals back I can't wait to see all of you working in the fields","post_message":"Jaws hit the floor as soon as Trump revealed when the Mexico wall is going up. This came as a complete shock to Mexico, and is going to go a long way in shaping Trump's presidency..."},{"comment_id":"1008713619198681","commenter_b":"She's a BAD example of a women !!!!","commenter_a":"Excellent ... +++","post_message":"Whoever you support in this election, it's important to mark historic firsts - and this is the first time that a woman from either party has won the Iowa caucus."},{"comment_id":"10154153451894197","commenter_b":"nice, she can afford to leave, no doubt on our dime.","commenter_a":"and who didn't see this coming","post_message":"Former Governor Rell is moving to Florida, and she is not happy about the direction of Connecticut.   Have you considered moving for tax reasons?  Watch Face the State with Dennis House this morning at 11.    Preview here: @webpagelink"},{"comment_id":"10157077224085354","commenter_b":"Ignorant slut","commenter_a":"Crazy socialist bitch","post_message":"The only thing 'ludicrous' about it is what Debbie Wasserman-Schultz said this morning.  WATCH:"},{"comment_id":"635288009979398","commenter_b":"How silly. Some people will sign anything.","commenter_a":"idiot","post_message":"An online petition to remove all air conditioning from Department of State property has gotten more than 1,800 signatures since it was posted online Sunday."},{"comment_id":"1609502052678904","commenter_b":"That ole man wroke that check that his azz couldn't cash....","commenter_a":"shouldnt have been talkin shit","post_message":"Damn! Racist guy gets handled for saying the N-Word!  #WSHH"}]
