[{"comment_id":"10154012731783352","commenter_b":"You know there has to be issues with her if the white men think you are crazy!","commenter_a":"I hate when you left a man they started to talking shit Dave Justice go sit your ass down some place and stop talking smh","post_message":"Halle Berry’s ex Dave Justice tells why he’s finally speaking out about the A-list actress, who tried to ruin his life and did the same thing to ‘Eric, Gabriel and Olivier’"},{"comment_id":"10156562504755354","commenter_b":"Just make sure you have plenty of their special food and make your women cover up head to toe.","commenter_a":"Nope. I wont be where terrorist refugees gather","post_message":"So his plan is to have businesses display his 'Refugees Welcome' stickers in their windows to attract customers.   Question: If you saw a 'Refugees Welcome' sticker in a business window, would you reward them with your business?"},{"comment_id":"10152829725821051","commenter_b":"if she shop lifts why isn't' the bitch in jail","commenter_a":"You mean she isn't stealing now?","post_message":"This shoplifter has never had a job. She current lives in rent-free housing and receives monthly benefits. She says if her benefits aren't raised, she'll go back to stealing."},{"comment_id":"10154033715125329","commenter_b":"Chop chop woman haha","commenter_a":"'@username Brittany Suzanne Pink","post_message":"Gilmore Girls could be getting new episodes on Netflix!"},{"comment_id":"10154323044371545","commenter_b":"I don't need to march with a bunch of femanazis' I'm fully aware of my rights as a woman and my freedoms as a US citizen - no one has tried to take any of those away from me except the last administration so I'm good MAGA","commenter_a":"I wonder how many women signed up to go to these marches thinking that they were supposed to be empowering women when it turned out just to be an anti Trump rally- so I would say that at least half of the women may be there for totally different reasons - which means the people who organized these marches were completely disingenuous","post_message":"Any DFW women make the trip to Washington for the #WomensMarch? If you did, Hannah Davis wants to hear from you. Share your pictures here."},{"comment_id":"10153629881103188","commenter_b":"So why aren't the women and children coming instead of all the able bodied young men who destroy things when they get to Europe?","commenter_a":"Wolves in sheep clothing!! Wake up Europe and do not be so naive!! Do not grant any of these people permanent citizenship. Send all able bodied back to Syria to fight for their country!!","post_message":"Millions of fleeing refugees are crashing into Europe like a tsunami."},{"comment_id":"10153154705006051","commenter_b":"Can't stand your ass either","commenter_a":"Can't stand Al Sharpton!! He is an evil racist!","post_message":"Al Sharpton was asked if the $5.9 million settlement for Eric Garner's death was enough. His response: No. He also has another demand. Do you agree or disagree with Sharpton?"}]
