[{"comment_id":"10153137299814060","commenter_b":"NOT OUR BELIEF !!!","commenter_a":"In islam animal or human statue is ban","post_message":"The destruction of ancient statues (some replicas) at the Mosul museum in Iraq, a video of which was released on February 26th, is far from the most heinous crime committed by Islamic State. But the group’s sacking of holy sites and libraries are elements of a broader attack, perpetrated in the name of Islam, on the Middle East’s rich cultural and religious heritage @webpagelink"},{"comment_id":"865539350258452","commenter_b":"Just keep trucking along well have a good president in the office finally","commenter_a":"Vote Trump","post_message":"Thank you Connecticut! See you this evening!! Lets MAKE AMERICA GREAT AGAIN!!"},{"comment_id":"937487649627809","commenter_b":"NO, NO, NO. Why is there even a question about this. Too many illegals in this country already. Do you want more?????","commenter_a":"Everytime I think I hear the dumbest thing ever, something else trumps it. I cant believe how unpatriotic some folks are now days. America is for Americans. Become an American and then you can vote. No intelegent group would ever let an outsider make a decision for them. It doesent make sense.","post_message":"More than 1 in 3 Americans believes illegal aliens should have the right to vote in U.S. elections, a figure buoyed by the majority of Democratic voters who favor the idea. @webpagelink"},{"comment_id":"10153845298899753","commenter_b":"Can 't see what any young girl would see in that creep--what do they see in those guys?","commenter_a":"Doesn't this family have any self respect? Who really gives a crap?","post_message":"Do Kylie Jenner and Tyga have a sex tape to release? Although multiple reports have claimed the former pair starred in a series of explicit films before they split weeks ago, Kylie Jenner and Tyga weren’t planning to release one of their clips last month. Following a report earlier this week, which claimed Kylie Jenner and Tyga were about to become the next celebrity sex tape stars just last month, a second report has shot the idea down. According to a May 23 report by Gossip Cop, Kylie... @webpagelink"},{"comment_id":"452509181540789","commenter_b":"Courtney i could care less what a fugly cunt, such as yourself thinks.","commenter_a":"No one wants to see ugly bitches without a top on.....maybe feminazis, but they don't count they're not people","post_message":"We support these brave and courageous women as they demonstrate against the rise of #policebrutality nationwide. What do you think about this form of protest? Effective?   Learn more → @webpagelink #SayHerName #FreeTheNipple #StopPoliceBrutality #TFTP"},{"comment_id":"1027451010661056","commenter_b":"You old bitch","commenter_a":"Free stuff...what they don't understand is they will be paying for it out of their taxes for the rest of their lives....","post_message":"This would be comical if it weren't so dang scary."},{"comment_id":"1371582852881168","commenter_b":"She's definitely a weird bitch !","commenter_a":"Stein you lost by zillions go home and get a job","post_message":"JILL is just fishing for money is all...?  @webpagelink"}]
