[{"comment_id":"10153669076314641","commenter_b":"Stop immigrant in Europe","commenter_a":"ISIS/ISIL/ the so called religious GROUP they r not MUSLISMS they created by americans & isreal 2 blacklash islam! ABOUT JAHADY JOHN as his from where he born said AN \"ANIMAL A DOG\"","post_message":"\"Jihadi John,\" who may have been killed in a U.S. airstrike, is a Kuwaiti-born, middle-class Londoner."},{"comment_id":"421180878069520","commenter_b":"^^ this idiot supports sanctuary cities and providing safe harbor to illegal alien criminals","commenter_a":"Hillary belongs in prison.","post_message":"More than $400 million has poured into the presidential race so far."},{"comment_id":"10157268817905551","commenter_b":"not NO more BITCH!!! your goin DOWN!!!","commenter_a":"Take him out and watch what happens especially when his refugees and rioters, illegals dont get paid","post_message":"Emails Prove that the Real Leader of the Democrat Party is George Soros"},{"comment_id":"10153409459121051","commenter_b":"What a bunch of cowards. The black girls are bigger then the white and it takes 6 of them to whip one white girl. They are just trash and need to go to jail","commenter_a":"Let's take them and whip their ass","post_message":"Beating this teen girl senseless wasn't enough for these women. They also decided to leave a special message on her forehead."},{"comment_id":"485911244932789","commenter_b":"be head her","commenter_a":"Yes , l support our police","post_message":"A woman is suing the police department... over a hijab? This woman broke the law, the police are completely in the right. Do you support our police?"},{"comment_id":"10157050332450354","commenter_b":"This bitch is a PSYCHO!!!!!!!!! I am 100% convinced now ( before I couldn't be totally sure ) that those bruises on her forearm were made prior to Cory grabbing her. Corey grabbed her biceps the video shows more likely than her lower arm. She has 0 credibility and will never get a job as a respected journalist again","commenter_a":"You stupid bitch you need to let it go. There was no case and you should be the one arrested. You will be lucky if you can get a job delivering papers. Your a liar just trying to get more than your 15 which by the way is up. You didn't do what you were told to do just like every other common thug that feels they can what ever they want. Now shut up and go home before you make a even bigger ass of yourself","post_message":"“The entire situations just seem to me a little sketchy....\""},{"comment_id":"825278590901728","commenter_b":"And 11 million illegal aliens","commenter_a":"Please just go away, Cruz. You have nothing good to add to our country!","post_message":"“You cannot win a war against radical Islamic terrorism with an administration that is unwilling to utter the words radical Islamic terrorism.” - Ted Cruz"}]
