[{"comment_id":"705344102952475","commenter_b":"@username, I'm no fool and I'm with her. Run along, jump back into your basket and go away...","commenter_a":"No matter what your kinds of words against Hillary we will not listen to you.This is solid Blue.","post_message":"\"There were trans people all over the country who were so excited that we could get gender identification papers that reflected who we really are … that is something that Hillary Clinton has done.\" —Laverne Cox"},{"comment_id":"624113881076675","commenter_b":"He's a freaking idiot!! Hitler reincarnated!! Good on Miley","commenter_a":"No, obama acts like that, lol","post_message":"Miley Cyrus is not a Donald J. Trump fan."},{"comment_id":"10153165455697869","commenter_b":"End stupid people from breeding","commenter_a":"Amen....","post_message":""},{"comment_id":"842653202518126","commenter_b":"Let them go to hell","commenter_a":"Bunch of Stinky Asses","post_message":"In Obamaland... Islam rules. @webpagelink"},{"comment_id":"630659240427363","commenter_b":"See. Look at this fucking cunt here. ^","commenter_a":"As much as I don't understand the obsession with Pokemon Go, it's done more good than any public health initiative that that any state or federal government has spent millions.","post_message":"The health consequences of sedentary lifestyles are costing the US $27.8 billion a year."},{"comment_id":"10153409431986336","commenter_b":"Give it a rest ! Donald Trump has every right to his opinion. I agree that this country has had an influx of illegals for years. Be informed and know that Mexico and Guatemala have cut a deal to send thousands more to cross our borders illegally. The monies they send back to Mexico and Guatemala is $120 Billion dollars. This president wants to give them a free pass plus $35 thousand tax refunds? So they cross illegally, burden our health centers, schools, and oh only so you get my disgust! All I used to hear at the hospital is people telling other relatives of theirs to \"Come to the U.S., because this country is so stupid. They give you money for living, food stamps and oh if you have your babies in the U.S. , then they are citizens and you can stay\"... So these so called nice people ...","commenter_a":"Its a PR move. All they really care about are the $$$$$$ NBC and MSNBC are financially hurting. Low ratings low viewership.","post_message":"Breaking News: NBC is ending its business relationship with Donald J. Trump due to his \"recent derogatory statements\" regarding immigrants.   DETAILS: @webpagelink"},{"comment_id":"10153162975649205","commenter_b":"Assholes","commenter_a":"JAYWALKING noting wong","post_message":"Cops Beat Black Teen For \"Resisting\" His Jaywalking Ticket"}]
