[{"comment_id":"10152762111222061","commenter_b":"Real FAT women","commenter_a":"It's time that real women get recognized!","post_message":" I happen to be a size 22, but I am sexy...\" -- Lane Bryant takes aim at Victoria's Secret with #ImNoAngel campaign: @webpagelink"},{"comment_id":"1781276175448687","commenter_b":"And she wants to spend her last dying days being president? Really? Think please!!","commenter_a":"Make it sound as bad as you can, @username, you always do.","post_message":"JUST IN: Hillary Clinton was diagnosed with pneumonia on Friday, her doctor says. The doctor revealed the condition hours after Clinton stumbled while leaving a 9/11 event. @webpagelink"},{"comment_id":"1050627531700165","commenter_b":"Go Hillary!","commenter_a":"I don't think Republicans even talk a good game. Nothing but LIES and the people who vote for them are too stupid to see it.","post_message":"\"We cannot – and I will not – put our vets at the mercy of private insurance companies without any care coordination or leave them to fend for themselves with healthcare providers who have no expertise in the unique challenges that are facing our veterans.\"   --Hillary Clinton"},{"comment_id":"1044965742191103","commenter_b":"So lern ich ja vielleicht doch noch was Mathe 😂","commenter_a":"@username :D","post_message":"Original image by Cath Ennis"},{"comment_id":"10154494540149586","commenter_b":"T p dig n jag s denna Jenny!","commenter_a":"Giulia","post_message":"\"I resist the systems that oppress people & animals alike.\" #WomensEqualityDay"},{"comment_id":"10153540694723984","commenter_b":"It won't affect her she is like a cork she just keeps popping up! I am afraid women who are not paying attention will vote just because she will be the first women president! I hope we have enough smart women that understands our country is going down the tube. Also we have very little protection from the terrorist! We are like sitting ducks on a pond!","commenter_a":"There is an obvious method to keeping Hillary out of the White House. All we need is an alternative candidate. That's how Obama got elected... no strong alternative.","post_message":"Hillary has dug herself a hole so deep, it doesn't look like there's ANY way she's going to be able to crawl out...  Are you hoping Hillary Clinton's scandals sink her?"},{"comment_id":"10154570112539497","commenter_b":"*grandma hands me a $10* \"Go get yourself a cup of coffee!\" \"Grandma, this is a $10...\" \"Then get yourself 3 cups of coffee!\"","commenter_a":"Jennifer Ann Winchester","post_message":" don tell your parentsthis is just between you and me. Good boy."}]
