[{"comment_id":"10153961468913132","commenter_b":"'@username she better step away from my man","commenter_a":"'@username @username @username I'm sure you've already heard, but it's foreal.","post_message":"So it IS true! Happy for Gwen Stefani and Blake Shelton. <3"},{"comment_id":"10153004075042061","commenter_b":"These magnificent creatures were never meant to be made to stand on their heads or do any of the other ridiculous tricks they're forced to do.","commenter_a":"Stop hitting elephants.","post_message":"An elephant attacking your car - never a good thing: abcn.ws/1LxMzPP"},{"comment_id":"1670944519835060","commenter_b":"These women need to learn to lug around bottles with store bought milk that contains half the nutrients in case their baby becomes hungry and fussy and starts bothering everyone around them. They should use their brains!!!!","commenter_a":"Feeding your baby and using your body the way God intended it to be used is absolutely shameful. How on earth could women stand up for such a thing and demand that society accept this!","post_message":"Women are brilliantly standing up to breast-feed shaming.  Read a powerful example right here: @webpagelink  Like ATTN: on Facebook."},{"comment_id":"10152701811618067","commenter_b":"What about Asians! We have more wealth than whites! ;)","commenter_a":"CNN thought process: Pot? Check. Ladle? Check. Add racial mixture. Add perceived racial sleight. Stir vigorously. Serve on CNN Special, '[fill in gap] in America'","post_message":"The latest report about financial inequality makes for uncomfortable reading... @webpagelink"},{"comment_id":"836801636436616","commenter_b":"Any one doing this should be around up put in jail and when it is time to get out they should be deported","commenter_a":"And those BASTARDS in DC want to bring in over @username in the next two years. HELL NO","post_message":"Broad daylight in Germany. Watch Muslim 'refugees' beat the crap out of this mom and daughter. Can you say, 'extended magazines?' @webpagelink"},{"comment_id":"10154233003321336","commenter_b":"'@username criminal actually the first foreign language spoken by illegals immigrants in the usa territory was English","commenter_a":"Donald Trump he's making our nation the laughing stock of the world but he is not the problem apparently in the usa there are a legions of racists misogynistics and fear filled ignorant people just waiting for a voice of lead and release them ,, he is not our shame the idiocy of some of our citizenry is our shame","post_message":"'I've spent less money than almost anybody else and I'm in first place by a lot.' – Donald J. Trump"},{"comment_id":"10158110429230206","commenter_b":"We should get rid of both of them . Say no to Armageddon .","commenter_a":"Donald Trump went from selling luxury condominiums to selling empty dreams .","post_message":"“If somebody wants to go out and say that they voted for this person or that person, they can do it. But that ballot is sacred.”"}]
