[{"comment_id":"1922337691198281","commenter_b":"What easier place to pull off a mass murder? A gun free zone, loser!!! Did your law stop the murderer from having a gun?? Libs just keep getting dumber.","commenter_a":"another freaking retard liberal","post_message":""},{"comment_id":"952520861503939","commenter_b":"We need to send in a drone and level the place. I will be tainted now and need to be rebuilt anyway.","commenter_a":"Operation White Privilege hasn't had an accidental firearms discharge yet. That has to be some kind of record.","post_message":"Do you not want the government to 'Waco' you? Because this is how you get the government to 'Waco' you."},{"comment_id":"10154645517167599","commenter_b":"@username Trump should be in the swamp!!","commenter_a":"Everyone needs to be more like Romanians. At least they doing something about corruption in their government.","post_message":"We were live from the anti-government protests in the Romanian capital, Bucharest. The demonstrations are in response to the passing of a decree that will free dozens of officials jailed for corruption."},{"comment_id":"10155858980760354","commenter_b":"Bitch has no morals !","commenter_a":"Do the world a favor and stop breathing!!!!!!!!","post_message":"Really?"},{"comment_id":"1718149915138787","commenter_b":"Why don't they remove these 3 evil women?","commenter_a":"I wouldn't waste 1 minute watching this group! They all look like they are wearing Halloween masks!","post_message":"Come... ON... Joy Behar needs to be banned from TV!"},{"comment_id":"470527006471213","commenter_b":"This lady thinks she is the president,this too shall pass just like her food for the kids at lunch time.","commenter_a":"I still want to know who elected the bitch","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"1303184443111138","commenter_b":"People check when you read this and other comments if your name is being used factilously by the Republican party to make statements in your name for Don the Con. Please watch.","commenter_a":"You sound like school children arguing on a playground. Little school children. This is what you got from the first presidential debate. Hillary did not do well if all you have to talk about is her accusation that Trump called some woman miss piggy.","post_message":"\"If any women was about to let go anything that he said in the past, this is not going to be it.\" - Morning Joe's Mika Brzezinski reacts to Donald J. Trump's remarks about ex-Miss Universe Alicia Machado's weight"}]
