[{"comment_id":"10153459531098855","commenter_b":"Attention whore","commenter_a":"Even her wig looks sad to be there","post_message":"Not another one!"},{"comment_id":"10154121579688132","commenter_b":"Kendra Hill Graham..she was crazy like a fox and a filthy pig to boot!","commenter_a":"Wow! Mental illness is real. She is disgusting! May God bless the children involved.","post_message":"Police officials are calling it \"one of the worst neglect cases\" they seen in Concord, California."},{"comment_id":"1405783259444718","commenter_b":"Nothing will be done. The past muslim made sure plenty of others were in charge before he left to keep it that way.","commenter_a":"I remember last year someone was sentenced pretty harsh for putting bacon on the door handles of a mosque. They called it a hate crime. Let's see what they do about this if they even do anything at all! Sickening","post_message":"Can you imagine the outcry if something like this had been done to a mosque?"},{"comment_id":"10154018390388984","commenter_b":"they need to stop her for good","commenter_a":"YES","post_message":"Wow, things just keep getting worse and worse for Hillary Clinton. I wonder if she saw this one coming...  Do you hope Hillary gets defeated?"},{"comment_id":"1089996267688050","commenter_b":"A woman who is drugged won't remember being raped. Guess that makes it ok?","commenter_a":"at least we don't remember it","post_message":"Maybe that circumcision was a bad idea after all, huh?"},{"comment_id":"896505850386756","commenter_b":"Hillary is evil. The only people vote for her is either they think she is \"Good\" and/or \"Qualifies for President\" or simply the fact that she is a woman.","commenter_a":"Be carful her crew is monitoring this","post_message":"\"I have to ask, though, if you want cops to turn over camera footage of every single moment of their shifts, why did you turn over only some of your e-mails from your time as secretary of state?   What is the difference?\""},{"comment_id":"10154773746046350","commenter_b":"That is so awesome-we need more of this-people helping other people-","commenter_a":"I was in an abusive relationship with an alcoholic constantly trying to keep him out of jail, take care of our 2 young children and working as a bartender. I lost a job due to not having a sitter while their father was in jail. Little did I know, 2 people who used to come into my old employment owned a small family bar and needed help. They contacted me and offered me a job. I had only been there for a short time and my boss lent me money to get my boyfriend out of jail. After a month when I reached the end of this relationship my boss lent me his car and more money to get a place and get on my feet. He never took the money I owed him out of my check. He told me to pay when I could. Every year for 3 ...","post_message":"What's the kindest thing that someone has ever done for you? Tell us in the comments below.    TODAY is kicking off our second annual #ShareKindness campaign with a goal of inspiring 1 million acts of kindness by the new year. @webpagelink    Our sponsor The Y is helping us out by committing to the first 10,000 acts."}]
