[{"comment_id":"10154672765359760","commenter_b":"Why? Ugly horse face bitch!","commenter_a":"Hell No! She didn't belong there in the first place. Garbage.","post_message":"Michelle Obama was loved by millions of people around the world as First Lady. Do you miss seeing her in the White House?"},{"comment_id":"10153649421859138","commenter_b":"Why would you post such a thing Dan??? Wtf?","commenter_a":"Meanwhile in Chicago this weekend, more people were gunned down by those whose lives matter. But let's not protest that.","post_message":"The Twin Cities Marathon went on today without major disruptions, and police did not make any arrests."},{"comment_id":"639736896151349","commenter_b":"That's great and all but how do these women make money now?","commenter_a":"yeah and there'll be some bleeding heart liberal who'll be out fighting for robots rights and defending human trafficking because \"pedophelia is a disease!\" and we \"shouldn't judge\".","post_message":"Experts believe that cyborg prostitution will help ‘clean up the industry’ by reducing sexually transmitted diseases and ending sex slavery."},{"comment_id":"10152912269504071","commenter_b":"Idiot white people","commenter_a":"Why is it still okay to use the n-word in rap music? Why haven't people of color stood up against those of the same color that use that word?","post_message":"There a few other words more volatile than this one."},{"comment_id":"10153851389446955","commenter_b":"@username this guy Julio & Cruz are dangerous crazy nuts that do not understand our European culture & they are racist loonies. BUILD the WALL. Go TRUMP 2016. lol","commenter_a":"Little Jebbie & Cruz is a LIAR & I want to watch sue the crap out of him, maybe Cruz can get another Goldman Sachs loan to pay the damages.","post_message":"FRUSTRATED JEB: 'I Should Stop Campaigning Maybe'..."},{"comment_id":"10154362175295329","commenter_b":"In the meantime, STFU. :P Because see below? Where she says, \"I considered myself a feminist before it was cool, now everyone is claiming it?\" She said that a while ago. First, tell that to Gloria Steinem, honey. Second, I think it's not really feminism when one woman decides to deride another because she decides that she's not doing it right? Yeah, no. Sorry. That sucks a lot.","commenter_a":"Stfu demi","post_message":"\"How the fuck am I making this about myself?\" – Demi Lovato"},{"comment_id":"855184514566047","commenter_b":"Oh, he wont' do that - she's white.","commenter_a":"I Jeb Bush should set up a public shaming.","post_message":"What are your thoughts about this tweet about Bristol Palin, Sarah's daughter?!"}]
