[{"comment_id":"10153435939769087","commenter_b":"@username Sorry you feel that way. She'll cheat and lie to you also.","commenter_a":"Who cares anymore what Bill Clinton has to say? He has no influence anymore. Why doesn't Bill & Hillary Clinton follow the law? why are they exempt from following the law?","post_message":"\"It's important that we not be chumps when we decide what security provisions should be employed to check people's background,\" former President Bill Clinton said. \"America is a place that welcomes all people who are willing to treat people the way they want to be treated, willing to follow the law, willing to create a common community.\""},{"comment_id":"10154490644508132","commenter_b":"But she was slimer before","commenter_a":"Her body is not well balanced is too much up in the chest ... too much on her Back .... Kourtney and Kendall bodies are better","post_message":"Kim Kardashian West traded her neutrals and furs for a bold vibrant look! (via PeopleStyle)"},{"comment_id":"10156168064325594","commenter_b":"Asians women are Crazy hands down!","commenter_a":"Well this certainly doesn't fit the regular narrative.","post_message":"The tearful and frantic 911 call was clear: “We got into a fight. I stabbed him. He’s bleeding.”"},{"comment_id":"10154229905709170","commenter_b":"Stop it. This kind of game playing makes you look more the fool. Most people today couldn't pick a transgender out of a line-up of people. They've been using our public bathrooms according to the sex they identify with, live and dress as, all these past decades to no uproar. Now all of the numskulls have come out of the woodwork claiming their women and children will be raped in the toilet stall because men are going to swarm into the ladies room because the law says they can. Get this: sexual predators don't follow laws in the first place and no law will stop them from getting their next victim be it in a bathroom or anywhere else.","commenter_a":"I will be packing better know what you are doing or you will be peeing like a girl for real !!!","post_message":"You want to try using the ladies' room, bro . . . the politicians and the media might be OK with you, but as for the ladies themselves, I wouldn't be so sure."},{"comment_id":"10156681236645354","commenter_b":"Go Donald Trump make America great again Let's take our Country back Ban muslims God be with you and Stay Safe.","commenter_a":"Trump did NOT say Muslims should wear special ID badges. Clever editing by a hostile press invented that.","post_message":"Fox News Invites Anti-Trump, Hitler-Citing, Muslim Advocate to Join GOP TV-Debate"},{"comment_id":"10153690862048812","commenter_b":"@username number 2 would be thugees not thugs","commenter_a":"Over rated NFL attention seeking drama thug using his kids for media attention.","post_message":"NFL star James Harrison strips his kids of their participation trophies. “These trophies will be given back until they EARN a real trophy.” @webpagelink"},{"comment_id":"10153140603601051","commenter_b":"Shut up bitch [Lizzie] !!!","commenter_a":"I believe you were given an explanation...if your son didn't understand, you sure did and should have suggested he put it on the wall or door of his bedroom. You are the parent.","post_message":"This mom didn't think anything would happen when her disabled son displayed something in his window. A few days later she got a letter from her community's management company: Pack your things and leave."}]
