[{"comment_id":"10154136860436051","commenter_b":"She does crack","commenter_a":"Clinton and what is that obsessive sniffing","post_message":"Who won the debate: Trump or Clinton?"},{"comment_id":"1779395119015202","commenter_b":"So women have been successfully doing this for how long? Most cases of extreme pain can be resolved medically and if not that's why we accrue roughly 8 hours of sick time per month at standard full time jobs One cannot expect businesses to experience this loss of productivity and still want to retain female workers","commenter_a":"Emily Lynn Bowman","post_message":"(Note: Look at the women in the back left of this photo.)"},{"comment_id":"10153750337633812","commenter_b":"Trayvon martin attacked Zimmer . Tired of the lies , zimmer lived in that neighborhood and had the same rights to walk as trayvon . Zimner's head veing slamned into the ground doesnt matter plus your ignorant white comment shows you don't know the facts . Zimmer is latino , black and white so stick your white privilege lie up your backside where your head is already stuck .","commenter_a":"A man who killed a lion is in hiding but the man who killed trayvon Martin is walking free?? Ohhh to be white in America","post_message":"Walter Palmer, the hunter tied to Cecil the lion killing, headed back to work: abcn.ws/1K0cdrW"},{"comment_id":"1775780972691266","commenter_b":"Andrea Lynnette no way in hell.","commenter_a":"To all the people harping about how \"historic\" the DNC nomination is: There is nothing empowering about this, and by saying otherwise, you are setting the next generation of American women up for failure. You're telling them that it's okay to lie, cheat, and steal, so long as it breaks the glass ceiling. You're telling them that it's okay to stand behind an unrepentant philanderer so long as it is politically expeditious. You're telling them that one does not need to take a principled stance on any issue in order to be successful; one only needs to adhere to populist notions. The only way in which last night was historic is in the sense that this marks the first time in American history that a candidate won the nomination under FBI scrutiny. This is also the first time in which an entire political party was caught actively sabotaging a candidate. ...","post_message":"Democratic Party nominates Hillary Clinton. Your reaction?"},{"comment_id":"10153147518933984","commenter_b":"This guy must be screwing oshithead or he wouldn't get so mad.If he loves illegals so much he needs to go live with the scum.If the illegals get into our country,crime will run rampant.","commenter_a":"Vote the asshole out next term.","post_message":"Who does he think he is to make these kinds of threats?"},{"comment_id":"1056318254456150","commenter_b":"It's not an illusion. It's fact. Nothing like this has happened in 38 yr. Life comes with no guarantees. Accidents happen!","commenter_a":"Yeah, but I'm sorry . . . Disney has created this illusion of fantasy and safety. The illusion that one can experience fear and threat in a safe environment. In fact, they have made millions (billions) of dollars designed on that premise!","post_message":"\"This is Florida, and it's not uncommon for alligators to be in bodies of water.\""},{"comment_id":"10153831984088132","commenter_b":"She's ok with adultery too","commenter_a":"A Christian who was married and divorced what? 3 times? Ok. She certainly doesn't have a problem with divorce but has a problem with gay marriage. The problem with so called \"Christians\" these days is there always seems to be a double standard. Sorry but you can't condemn someone who you deem a sinner when you sin yourself. Shame on her.","post_message":"\"Kim Davis should have never been locked-up for being a Christian,\" said Mike Huckabee."}]
