[{"comment_id":"10150883310494999","commenter_b":"will have to wait to see how many generics fail to work","commenter_a":"There is going to be generic? Why is everyone complaining? This medicine just got way cheaper!","post_message":"The move by Mylan is a common tactic: raising prices before a generic competitor reaches the market, as a sort of final attempt to milk big profits from the brand-name drug."},{"comment_id":"848836128595379","commenter_b":"Eat shit loser!","commenter_a":"No one has won any war against Afghanis.It is history.","post_message":"When you're on a mission to defeat the Taliban, but fly fishing is life. ~Josh"},{"comment_id":"10153659271788132","commenter_b":"Hope they keep her in prison for life!","commenter_a":"White trash!","post_message":"Awful."},{"comment_id":"678568942333684","commenter_b":"Muslims do like goats.","commenter_a":"Surely the king has more class than to let Hillary sit on his face !","post_message":"Hillary Clinton was just caught doing absolutely sickening with the Saudi King. She is not to be trusted. This is filthy. Do you think Hillary Clinton would make a terrible president?"},{"comment_id":"1251827328191456","commenter_b":"they are only saying this so they wont loose sales!!!!!","commenter_a":"So everyone remember to take your children to the restroom before Target trips","post_message":"👏 👏 👏 (via The Huffington Post)"},{"comment_id":"1026033040752819","commenter_b":"And all those boobs in a row on display.","commenter_a":"I feel like the word \"leggy\" came up a lot in this article. As if the author was sorta fixated on this one thing about the girls who tormented her and swift in particular in a sorta Freudian way. Like, \"The evil reign of Taylor Swift, with her forever legs, way too long to be street-legal, stretching between pencil skirts and slightly worn Converse, glossy in the pink-frosted Malibu dusk... Um, I mean, hen culture and mean girls and stuff.\" I don't necessarily disagree with what she's saying, but she is really, really aware of Taylor Swift's legs.","post_message":"If T Swift and her squad rub you the wrong way, you're not alone. Here's why."},{"comment_id":"10153619643270329","commenter_b":"Jordan Selph","commenter_a":"Jackie Hollander","post_message":"Bastille Day, As Told By Sloths"}]
