[{"comment_id":"421525971373828","commenter_b":"Stop apologizing women! I had an abortion, cause I wanted to and no one ever new! Lol! Ya know why, cause its not your business! Stop saying ,well my birth control didn't work, blah blah blah. Its not illegal! If you don't like abortions, don't have one.","commenter_a":"What does that actually have to do with abortion? Viagra is not causing the death of a living being. It's not about hurting women's reproductive decisions. I mean, I'm all for birth control methods. Just imagine how many abortions could've been avoided if the women were using a very effective form of birth control? And, before anyone says that you can get pregnant on birth control or while using condoms, let me just state that it is over 99% effective if used properly. Although it is possible, it would be a fairly rare occurrence.","post_message":"\"I purposely tried to make it as invasive, as intrusive, as hypocritical and unnecessary as possible,\" the lawmaker said."},{"comment_id":"10152922886022377","commenter_b":"Lock her up and throw away the key!!!","commenter_a":"Her mug shot will be her best picture.","post_message":"Criminal charges coming soon for Hillary Clinton?"},{"comment_id":"10153285470317994","commenter_b":"Rights? RIGHTS? LOL.","commenter_a":"If the son paid for them he had no right. If he paid for them then the joke was on him.","post_message":"Kurin Keys just got his pair of Air Jordan 11. He also just got his grade card and it wasn't good."},{"comment_id":"1113788628681311","commenter_b":"I will be voting for a true American who has respect for our military n veterans who's goal is to make America strong again for we the American people n the future of our country n children bring jobs back. close our borders Build the WALL My Vote like many Americans who are sick of our do noting liberal government Will vote Trump Go TRUMP","commenter_a":"Indiana, go vote Trump over lyin' Ted and Kasich! Time to send Donald to the White House. We're tired of all talk and no action politicians! #TRUMPTRAIN","post_message":"Last week we had huge wins in Connecticut, Delaware, Maryland, Pennsylvania and Rhode Island. It has been an amazing week in Indiana. We have traveled all over the state visiting Indianapolis, Evansville, Fort Wayne, Terre Haute, South Bend and beyond. I was endorsed by many sports icons including the legendary coach Bobby Knight, long-time Purdue University Basketball Coach Gene Keady, former Notre Dame Coaches Digger Phelps and Lou Holtz, and actor and former NFL player Fred \"The Hammer\" Williamson. I also received support from many Republican leaders across the country, who believe we will unify the party and defeat Hillary Clinton in the fall. The latest polls indicate this to be true. According to the latest Rasmussen poll, I beat Hillary easily and with your support we can widen this margin and Make America Great Again! It is so important to me to win Indiana. Not only would it solidify ..."},{"comment_id":"1065116426845174","commenter_b":"She's thick. And frankly looks weird with the stretch marks photoshopped out.","commenter_a":"Ashley Graham, the model is size 16. She's NOT EVEN PLUS SIZE. That's what's wrong!!","post_message":"You decide..."},{"comment_id":"10153254096516509","commenter_b":"Send her to India","commenter_a":"I hope they capture her alive and she spends the rest of her days rotting in prison. Death for her is too kind.","post_message":"BREAKING NEWS: The female suspect in the #Paris grocery siege has escaped, the police union spokesman says. Watch Live Now: @webpagelink"},{"comment_id":"1040232792739639","commenter_b":"Maybe the politicians should take a course in medical health","commenter_a":"She needs to have her nurses license taken away.","post_message":"“You cannot forcibly incarcerate someone if it’s not based on legal grounds” - Kaci Hickox on why she's suing Chris Christie"}]
