[{"comment_id":"10152669035866135","commenter_b":"Me too","commenter_a":"Me too, worst sound i have heard from my phone! I try to read the alert and they want me to answer a survey! Are you freaking kidding me?!?","post_message":"UPDATE: Police have now released a picture of missing 6-year-old Hailey Betts.  READ MORE: @webpagelink  Have you seen her? Please call police right away if you have any information."},{"comment_id":"10154771811749411","commenter_b":"Basket of this, Bucket of that...Ms. Clinton seems to have a container to stick all of us in. Apparently, we're not much to be concerned about. To my mind she's a big pile of ***t,...bring your own shovel. No need to place her in an urn or other bucket-like container, just toss it in with the other compost and let her continue to decompose.","commenter_a":"I've seen a number of articles on \"alternative\" news sites claiming wikileaks is falsifying all this stuff. Kind of sad that people would go so far to bury their heads in the sand rather than even consider the thought that a candidate which rigged a primary is capable of so much more. #HillaryforPrison","post_message":"The sheer number of insults in the email trove has left the Clinton campaign unable or unwilling to respond."},{"comment_id":"10158064309830354","commenter_b":"She's so ugly!","commenter_a":"she looks like a dude to me. this not a real female.","post_message":"Poisoned coffee on the day of the debate???"},{"comment_id":"10153846038466336","commenter_b":"Smug calculated shrew. She's nothing short of evil. WHY ISN'T SHE IN PRISON?","commenter_a":"She is a lying self serving witch and she has a list of dead people that believed in her and knew to much that could destroy her and Bill.","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."},{"comment_id":"10154577963871323","commenter_b":"President Mitterand had wife and kids plus a lover with who he had a girl!!! Lol","commenter_a":"If it was France or even Italy it wouldn't be an issue and would be distasteful to bring up in public. In America there is a certain ownership in marriages rather than partnership. Maybe she loves him as a man and equal in mind, the fact that he does have a wandering eye (penis) may be something she is willing to accept the way we accept a partner's handbag obsession.... Just saying....","post_message":"The end of a relationship – even a years-long marriage, even an otherwise-good relationship, even with children in the mix – is, at this point, the only acceptable consequence of infidelity, and staying is posited as the inexplicable choice for a woman to make.  But life and love are more complicated than that for many people, even in 2016."},{"comment_id":"1137500072976406","commenter_b":"I agree she's a snobby cow that needs to learn a lesson and go inside but prisons are full","commenter_a":"Yet another classic case of women and their double standards...if a man had stabbed a woman, there'd be out with the pitchforks and torches baying for his blood...","post_message":"Woman who stabbed a man in the eye with her stiletto walks FREE from court"},{"comment_id":"1735291753418932","commenter_b":"Tyler","commenter_a":"Julia Lynch yay","post_message":"Wristbands allow festivalgoers to return to the empty field after a trip to the parking lot to retrieve more MDMA, mephedrone, 2-DPMP, Benzo Fury, Adderall, or synthetic cannabinoids."}]
