[{"comment_id":"10156536159770354","commenter_b":"That's not a woman. It's a guy","commenter_a":"definitely a man","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"},{"comment_id":"10154440121543525","commenter_b":"ARE YOU WITH NO SIN, MAYBE YOU SHOULD NOT THROW STONES AT GLASS HOUSES. YES MICHAEL JACKSON AND PRINCE MAY HAVE BEEN DRUG ADDICTS, BUT THEY WERE BOTH AN INCREDIBLE TALENT, AS WAS WHITNEY HOUSTON ON THE FEMALE SIDE. SHE UNFORTUNATELY WAS A DRUG ADDICT. BUT SHE HAD AN INCREDIBLE VOICE. BUT ALL I AM SAYING IS LEAVE THE JUDGEMENTS TO GOD, BECAUSE I AM SURE YOU ARE NOT WITHOUT SIN.","commenter_a":"Who cares, he was a drug addict just like Jackson. Both were not exactly someone to look up to.","post_message":"Ten years ago today, Prince performed what's been called the greatest Super Bowl halftime show ever -- belting out \"Purple Rain\" amidst a driving Florida rainstorm. #RIPPrince  WATCH HERE: @webpagelink"},{"comment_id":"10157212234715389","commenter_b":"They left them to die!!!! They were tortured before they killed them.... What kind of sick people lets this happen with the best armed forces in the world!!! These people need to go to jail!!!!! They did it on purpose!!!!! Sick !!! For heavens sake place these people in jail!!!!","commenter_a":"#nofaithintheGOP. Yeah, we know.. So you wrote a paper about it. What do you want? A diploma...Go arrest them. #theyarepartoftheproblem.","post_message":""},{"comment_id":"10152787006691545","commenter_b":"What time?","commenter_a":"I can't believe they just showed up out of the blue. There should have some fore-warning. *drum snare*","post_message":"About 30 members and supporters of Bloodstained Men, a nonprofit group based in California, held signs that read, \"Foreskin is not a birth defect.\""},{"comment_id":"897132857052677","commenter_b":"i can deal with trump and cruz. NO RUBIO! or KASICH! let illegals stay here at no price. do not understand why people hate common core. soros giving them bucks. not them!","commenter_a":"Trump/ Carson","post_message":"Who are you voting for?! Let us know!"},{"comment_id":"531806736985283","commenter_b":"No deal why is this bitch still free lock her up","commenter_a":"He can't, Hillary, not without the approval of the People!","post_message":"“The Europeans, the Russians, the Chinese, they’re going to say, ‘we stuck with the Americans, we agreed with the Americans, we hammered out this agreement, I guess their president can’t make foreign policy.’”"},{"comment_id":"10150689045559999","commenter_b":"Ha, the wife and dog get all the ink.","commenter_a":"@username who's in the photo?","post_message":"Amazon.com is doing 2 predictably unpredictable things this week."}]
