[{"comment_id":"10154517651704166","commenter_b":"Ash, Nc","commenter_a":"Hi from","post_message":"Mother of son hit with books at school speaks out"},{"comment_id":"10153907295491680","commenter_b":"@username your a bitter woman","commenter_a":"Another classless moron that thinks sexual abuse is ok 👌 way to go Rush, you are pathetic","post_message":"\"Men brag,\" Rush Limbaugh said on his long-running radio show."},{"comment_id":"10157050332450354","commenter_b":"This bitch is a PSYCHO!!!!!!!!! I am 100% convinced now ( before I couldn't be totally sure ) that those bruises on her forearm were made prior to Cory grabbing her. Corey grabbed her biceps the video shows more likely than her lower arm. She has 0 credibility and will never get a job as a respected journalist again","commenter_a":"You stupid bitch you need to let it go. There was no case and you should be the one arrested. You will be lucky if you can get a job delivering papers. Your a liar just trying to get more than your 15 which by the way is up. You didn't do what you were told to do just like every other common thug that feels they can what ever they want. Now shut up and go home before you make a even bigger ass of yourself","post_message":"“The entire situations just seem to me a little sketchy....\""},{"comment_id":"10150886165499999","commenter_b":"feminists are pro-islam, so of course this concerns them","commenter_a":"What does that word 'feminism* do here? Feminism does not say what you should or should not wear. Some feminists may have delusions of what is best for some, but it is still not the feminism itself, what people belive or does not belive.","post_message":"Our top 10 comments of the week."},{"comment_id":"10152620550458067","commenter_b":"Get a FREE Education, Graduate, and then move into your Parents Basement because all of the Illegal Immigrants have your JOBS.","commenter_a":"Tax money used for a good long term investment finally.","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."},{"comment_id":"836130403149880","commenter_b":"Yes please an easy will for Hillary!","commenter_a":"Get em Sarah! We want you!!","post_message":"“I’m ready for Hillary, are you? Are you coming?” - Sarah Palin"},{"comment_id":"992371087511918","commenter_b":"So she is only part Native American because you think they must have been raped? Um.. I am part Native American because my great grandmother was savagely raped by a Native American, so please tell me how innocent and peaceful they were. And yes illegals now are a different story. Whether you like it or not, when Europeans came here it was a hostile takeover. There was a war. Which the Native Americans lost. So if illegals want to wage war, than they can bring it on. If not, they can go the he'll home to whatever country they came from. I honestly don't care which country it is.","commenter_a":"If Native Americans had @username \"Illegal European scumbags have yet again raided local villages, they crashed their boats into our shores, raped our women and children and then killed them for not turning into Christianity..\" #Talk about several overdue sentences","post_message":"Margarito Quintero didn’t have a license and was in the United States illegally. He was previously arrested and deported in 2008."}]
