[{"comment_id":"487710868083187","commenter_b":"Shut up.","commenter_a":"Supporting Bernie is supporting a blow FOR the middle class.","post_message":"It's a mistake to treat the \"black vote\" as a monolith."},{"comment_id":"1194337773935013","commenter_b":"This bitch got the fucking nerve to talk about pollution killing people yet donated money to an army of murdering cowards to support them killing children. Fuck outta here","commenter_a":"Hillary can double that... in a weekend!!","post_message":"\"Pollution kills more people every year than wars, car accidents, and homicides combined.\" -- Arnold Schwarzenegger"},{"comment_id":"10152743535041973","commenter_b":"Women don't wreck things? You should've seen what my first wife did to the cable box!","commenter_a":"Sounds like teenagers at play.","post_message":"Eleven large boulders had been dug out of a steep bank below the trail and pushed down an embankment creating unstable soil, which is vulnerable to erosion from winter rains."},{"comment_id":"10153485942076491","commenter_b":"Thanks for the suggestions Mark but I really don't care what yoy think I should be reading.","commenter_a":"He really should narrow that down to a top 10 list. Nobody likes to read that many books.","post_message":"It includes ‘The New Jim Crow’ by Michelle Alexander."},{"comment_id":"10154755616704726","commenter_b":"53% of white women voted for TRUMP !!!!!","commenter_a":"They should have nominated an honest, personable candidate, and maybe, just maybe they could have won. Hillary was the very worst candidate, with way too much baggage. It had nothing to do with gender. Most women would have voted for a woman who had not lied and had not been under FBI investigation. Wikileaks showed just how dishonest her campaign was.","post_message":"Grieving Democrats and pundits point to gender bias as a culprit for Trump's win — but an October poll disproves them."},{"comment_id":"864666960316353","commenter_b":"I know! Power to the feminists. But that would make me feel dirty .","commenter_a":"Grace Te Moananui @username","post_message":"Armpit Hair Is Trending, And It’s A Step Forward For Women Everywhere"},{"comment_id":"739571439509370","commenter_b":"Suzette, no, she doesn't. She just encourages them to get abortions so they can go back to their life and most likely get pregnant again.","commenter_a":"So here's an actual SOLUTION for all the pro-life people... Rather then protest, why don't you offer to help those poor, confused girls seeking an abortion? Perhaps these women feel they have no other option. So why don't you offer to help them out, since you love babies so much? Offer to take these girls in & give them an alternative, especially since a lot of them fear that their family is going to shun them due you to this unplanned pregnancy. Then, pay for all of their medical bills for all the doctor visits they'll need, including the hospital birth. Then, while the mother recovers at YOUR house, you can raise the baby you desperately wanted to save when she leaves to go on with the life that she wanted to live. I think that would work. Why don't all you pro-life people go and do that? Oh wait, ...","post_message":"Planned Parenthood doesn't want anyone to know this? Then spread this EVERYWHERE!"}]
