[{"comment_id":"10153753103761037","commenter_b":"@username tell me that in 12 months... no Bernie, no Trump, no Clinton and no JEB... then who's left? Let's talk again when there's only days left of this nonsense.","commenter_a":"Jim Webb won this debate: he got more exposure out of the media tonight than he has had since he began his candidacy. Compared to Clinton he looks honorable, compared to Sanders he looks responsible. Since those two are the media darlings, those are the only two he needs to be compared to until he can get out of single digit polls. If any of those candidates expect to get moderate Independent and Republican voters next fall, they need Webb on the ticket… unless Trump manages to stay in the race.","post_message":"Bernie Sanders defends his record on guns after Hillary Clinton pounces. #DemDebate"},{"comment_id":"10154119835601770","commenter_b":"Give those real freaks, real deplorables if you will... a hand they know Clinton is one of them!!","commenter_a":"They feel sorry for the looser and I mean a dirty looser","post_message":"Remember when Vice President-elect Mike Pence was booed at 'Hamilton'?"},{"comment_id":"724979780984130","commenter_b":"Let's not forget that the woman also has to spread her legs.","commenter_a":"I have been saying this for years. The whole thing starts when a man can't keep it in his pants. He has no business telling women what they should or shouldn't do.","post_message":"Let me share a piece of myself. Yours truly was abandoned as a newborn by a man who now he is 100% against abortion. I guess me being taken to Arkansas and being raised by an abusive stepfather (and the first few years in a shack with an outhouse and a well for water) was OK. I appreciate that I had a chance at life. But you men who think you can make decisions for women? STFU. Now.  ~tiff  via Occupy Democrats"},{"comment_id":"475516605979471","commenter_b":"Getting a little tired of the, \"MUSLIMS\" trying to change our great country of AMERICA!!! If you infidels don't like our country, please feel free to go back to where you came from or if you're an American muslim, get used to our way of life or ship out & go to a muslim country from which they came. I'm sure they need you in those countries since so many have migrated here.","commenter_a":"So then go eat at Camel humps grill","post_message":"McDonalds, KFC, And Pizza Hut Say No To Halal Meat And Muslims Are OUTRAGED  There is no reason why they should have to change their business for them.  Do you support these food chains?"},{"comment_id":"885760648126024","commenter_b":"Such a wonderful hero to me. He's human, makes mistakes and humbly admits it. That takes a real man. Thank you, \" W\".","commenter_a":"he is a moran.","post_message":"So funny, and 100% class..."},{"comment_id":"10154713474904586","commenter_b":"GO VEGAN LEAVE ANIMALS ONE YOU EVIL PEOPLE","commenter_a":"I hope there is a hell, and the people who inflict this unspeakable cruelty on these poor helpless beings, burn in it for an eternity...lowest form of scumbag life on the planet..","post_message":"This is what \"shackle & hoist\" looks like."},{"comment_id":"10155690406614199","commenter_b":"She started it. First of all she knew it would take her long so why didn't she let him go first. Second of all she poured her drink on him. At it sounds like she isn't very honest. And sorry but she looks like she's on drugs. This is what happens when you push people to far","commenter_a":"I think because she lied and she threw the first thing to get the conflict from verbal to physical either she gets punished or he gets off free. This is soo sexist if a guy threw a drink at a lady and she smacked him in response pretty sure she would get away with it.","post_message":"Police have released surveillance video from an alleged attack at a grocery store that tells a bit of a different story than the one the alleged victim gave."}]
