[{"comment_id":"10154160211386336","commenter_b":"Stfu feminist","commenter_a":"Thank you @username for backing Megyn Kelly. If the cry babies can't take the hard questions, they can watch the lamestream stations.","post_message":"Unbelievable. (Via: ViralHog)"},{"comment_id":"648669105287702","commenter_b":"That Bitch be ugly!!!!","commenter_a":"So be it","post_message":"Whoopi Goldberg Says She Might Leave The Country If Trump Is Elected. Well I guess she's going to say goodbye. Will you happy to see her go?"},{"comment_id":"1011157232323867","commenter_b":"I heard this interview last night. It was in reference to him making less money.","commenter_a":"LOL","post_message":"That'll convince voters."},{"comment_id":"10153163216675950","commenter_b":"What...like it's hard?! #illegallyblonde","commenter_a":"This nonsense is in the same category as the Nobel Peace Prize nonsense. Victory is awarded by decree. Neoliberals in higher education are waging an aggressive campaign to destroy meritocracy.","post_message":"\"There are few teams we are prouder of having lost a debate to than the phenomenally intelligent and articulate team we faced this weekend,\" students on the Harvard team wrote."},{"comment_id":"1401830939879019","commenter_b":"If you are in the U.S illegal,then you should be deported period,there is some circumstances involved in illegals","commenter_a":"Amen brother!","post_message":"Black Trump Supporter Just Exposed SICK Thing He Saw Muslims Doing In His TownHas BRUTAL Message For Liberals Share if you agree they will NEVER Assimilate"},{"comment_id":"10153306067889087","commenter_b":"I bet they're total bitches!","commenter_a":"Who are these people backing Hillary?! It seems like every Democrat supporter that I come across is supporting Bernie.","post_message":"Hillary Clinton holds a stunning 31 point lead over her closest Democratic presidential rival Bernie Sanders according to a new NBC News/Wall Street Journal poll."},{"comment_id":"1035505973211617","commenter_b":"Rondell....you are missing something","commenter_a":"What makes Melania Trump's speech troubling is not that she \"plagiarized\" words/phrases from FLOTUS Michelle Obama's 2008 speech. But rather that Melania was not able to speak \"authentically\" about how she feels about \"her\" own husband, Donald J. Trump. The fact that Melania had to use another woman's words to speak about her husband versus using her own words underscores something deeper--not just about the Trump campaign, but whether America can trust a man whom his wife does not even know.","post_message":"In-house writer with the Donald J. Trump campaign steps forward with apology for Melania Trump's speech and tries to resign - but Trump camp rejects resignation."}]
