[{"comment_id":"10153590178129497","commenter_b":"You sons of bitches !","commenter_a":"Fearless!","post_message":"Via ClickHole:"},{"comment_id":"10153545304972452","commenter_b":"Happy mothers day mom, have a cheeseburger, see ya later!","commenter_a":"was it on a friday ?","post_message":"When they both went for the cheeseburger, investigators said Benjamin Middendorf had enough and shot his brother."},{"comment_id":"812245008908679","commenter_b":"You are one sick bitch.","commenter_a":"More whit and wisdom from Donald Dump the worst! Just like the KGB. People might begin to vanish if he doesn't like them.","post_message":"I would like you know what Trump supporters think about this. I find it very unsettling."},{"comment_id":"1026050264097061","commenter_b":"illigals should not be able to vote period","commenter_a":"I agree, if sending all illegals back to where they came from will save lives, then do it and to the illegals be damned!!","post_message":"YES!!"},{"comment_id":"1695404184069071","commenter_b":"She's just a fat old cow","commenter_a":"Getting offended over what a woman with no pants on has to say at a game where men are paid millions to crush each other for a ball....Just wow.","post_message":"Some people didn't notice what was happening during Beyonce's performance last night... but these sheriffs did, and they were appalled. Did you notice what Beyonce did?"},{"comment_id":"1022737904430216","commenter_b":"Yuge piss on Shillery Clinton. Name ONE more disgusting pig who ever lived?","commenter_a":"Nobody kicks a dead dog. Hillary's attack shows that her campaign sees Cruz as a real threat. Ron Nehring, keep up the good fight.","post_message":"Ted Cruz: “John Kerry was not a little wrong, he was wildly, extraordinarily wrong. Facts matter. Science matters. Data matters.\""},{"comment_id":"10153218783658869","commenter_b":"No inspired because I do not look up to her.","commenter_a":"Antes de ver a una mujer en la Casa Blanca, la clase política americana es capaz de buscar lo inexistente, y si hay hay que crearlo, de crea.","post_message":"Hillary Clinton cannot appear too strong without risking her likability ratings; she cannot appear too vulnerable without her credibility suffering. Herein lies her dilemma."}]
