[{"comment_id":"10154266348729203","commenter_b":"Go on sis!","commenter_a":"It seems that people are pushing their agenda however way they can... Big changes are coming soon... @webpagelink","post_message":"'Captain America: Civil War' screenwriters on the importance of Cap in light of Trump: 'It important to have someone remind people that that is not what this country is about, and you being kind of an ugly fool, and reductive.'"},{"comment_id":"10155007132753431","commenter_b":"Wicked Witch of the East.","commenter_a":"It's not about popularity. It's about decency and common sense!","post_message":"DeVos gave no sign that she had reservations about withdrawing key guidance for transgender students."},{"comment_id":"10153589357933984","commenter_b":"Just WHAT THE HE#% IS WRONG WITH AMERICANS, just like the poor Jews in Germany, we just sit back and let all this crap happen!!!","commenter_a":"Screw you","post_message":"The NAACP just made a stunning demand about this historical monument... this is shocking move.  Nobody thought they would go this far...  What do you think about the NAACP's demand?"},{"comment_id":"10154379049296028","commenter_b":"The tourist started it. There are reasons they had to close up. Their computers weren't working and they were forced to close maybe for an hour. Stupid tourist wanted to fight. She assaulted the employee first (yes, throwing water at someone is considered assault) causing the employee to be in defensive mode. Maybe that employee should be suspended for 2 days and hopefully she's not fired.","commenter_a":"What? You are not going to stack the coupons and price match??","post_message":"A woman's desire for a post-Christmas bargain took a violent turn. The confrontation caught on camera shows a store manager and a customer get into a scuffle in front of awaiting shoppers at a Florida mall. @webpagelink"},{"comment_id":"1210989268913328","commenter_b":"Impeach this !!!!!!! Donkey Dicks ! Vote Trump","commenter_a":"How can you Impeach Trump??? He's not even President!!! Impeach the one in there now!! What the heck is the matter with people now a days??!! No common sense, want everything free, think they are entitled, scream racism at everything, destroy property with no remorse, get mad and just shoot people, not responsible for anything they do wrong, always due to their past or otherwise, no morals................ect..........And now talk of impeaching someone who isn't even President!!! America stand up and be counted for what is real, true, moral and right!! All Whiners can leave!!! Of course just my opinion! I know all will not agree, but 'Freedom of Speech!! My country, my Right!!","post_message":"Donald Trump doesn't have the GOP nomination and he hasn't been elected yet. But that is not stopping the effort to have him impeached the moment he might be sworn in as president"},{"comment_id":"10153171665732235","commenter_b":"LMAO!","commenter_a":"you know who else loves snow days? SATAN.","post_message":"Good grief."},{"comment_id":"1728663384083911","commenter_b":"They can stick it!!","commenter_a":"No, no, hell no! If if offends them, just stay away!!","post_message":"Liberals Want To Ban The Most Iconic 9/11 Picture From Museum.  There is no reason on earth why it should be banned.  Can we get 30,000 'LIKES' to keep this picture in the Museum?"}]
