[{"comment_id":"1786349714946678","commenter_b":"Lol! She is a lunatic!","commenter_a":"She is a racist huh?","post_message":"Former Arkansas Gov. Mike Huckabee asked Monday if House Minority Leader Nancy Pelosi is racist after she said Housing and Urban Development Secretary nominee Ben Carson is \"disturbingly unqualified.\""},{"comment_id":"10153330953062452","commenter_b":"Stay out of this Stephanie Mullins","commenter_a":"Great. Now it'll be legal for California to smell worse than just smog and congestion. ***Disclaimer*** This comment was made in sarcastic jest. If you're offended by this joke, clearly you cannot comprehend sarcasm over the internet. Avoid replying if you're offended. You'll just make yourself look as stupid as the halfbreeds of Offended By Everything 2015. #PSA #TheMoreYouKnow #CalmYourTitsAndTokeYourHits","post_message":"Is California going to pot? The push to legalize recreational marijuana use in the state just got a big boost. The California Medical Association is giving the proposed ballot initiative a big thumbs up. abc7.la/20oIUO6 So, should adults 21 and over be able to buy and smoke weed?"},{"comment_id":"1749451101986580","commenter_b":"Disgusting ... Soooooo sick of the ignorant and desperate race card being used - Clinton you are literally turning my stomach as you spoke often, all on recorded tv I may add, of protecting our borders from illegal immigrants and the insurmountable costs associated with this illegality - it's not racist, just one nation cannot afford to take on the needs of an impoverished third world nation that hides vast amount of hidden cash and hurts their citizens - you are such a liar and hypocrite - like now you should completely lecture us on keeping healthy and happy marriages - you and your lying inept money grubbing hateful wife make me sick - literally sad for any one that thinks you are role models - just so so so sick","commenter_a":"Racist not at all. Trump/Pence will be better then the evil woman! No question about that! I believe that Billy is suffering from a sexual disease that is destroying what mind (little left).","post_message":""},{"comment_id":"10154126092428132","commenter_b":"So sorry to hear your loss and prayers goes out to you and your family God bless","commenter_a":"Prayers for your brother so sorry.","post_message":"The news comes just a day after Celine Dion lost her husband, Rene Angelil, to the disease."},{"comment_id":"10153369157063984","commenter_b":"Fire them all and make new hires sign a contract that if they are caught stealing anything they will pay back double the amount of the theft. The citizens work hard for their money and it is the taxes they pay that keeps those in Washington working.","commenter_a":"Hey, as long as they're paying for their gambling and \"adult entertainment\" out of their own pockets, well..... that's between them and God! But, if I'm paying for any part of it, then \"nail them to the wall\"!!!","post_message":"This has got to be a big embarrassment, and they probably thought they'd gotten away with it..."},{"comment_id":"10156049439790725","commenter_b":"because we know how to build stuff that's why..... Why u think Latinos rule the construction industry?? Lol... Really building a wall huh? Who u guys going to get to build the wall?","commenter_a":"What about the fence the Mexicans put up to keep People from Guadamalia out> If it works for them why not for us??","post_message":"For those that don’t think a wall (fence) works, why don’t they suggest taking down the fence around the White House? Foolish people!"},{"comment_id":"10153722896533690","commenter_b":"How Iran can Accept refugees while Iran is very poor country and its people are migrating to Europe","commenter_a":"Europe is christian place so send rufugees there,, iran is a shia muslim country, so send refugees there. Why don't you send these refugees to sunni dominating countries like pakistan, turkey??????","post_message":"Opinion: \"Of the more than four million Syrian refugees, almost half of them, the largest concentration, have gone to Turkey. In addition to Turkey, Camp Zaatari in Jordan has received tens of thousands of Syrian refugees. There are also Syrian and other refugees scattered throughout the Arab and Muslim world, particularly in Lebanon. There is one glaring case of a Muslim country that is heavily involved in Syria but has yet to accept a single Syrian refugee, and that is the Islamic Republic of Iran.\" Hamid Dabashi, Hagop Kevorkian Professor of Iranian Studies and Comparative Literature at Columbia University, writes for Al Jazeera."}]
