[{"comment_id":"10154579392684062","commenter_b":"Apparently not a gem if she can't get someone her own age. And it really doesn't matter. She is sick and needs to be Put in jail!","commenter_a":"I bet she's white","post_message":"She hasn't been arrested yet."},{"comment_id":"10153772364848132","commenter_b":"Such a strong woman...","commenter_a":"What a wonderful tribute to your husband this morning Kathie Lee... May God be with you and your family at this difficult time...","post_message":"This emotional tribute from Kathie Lee Gifford is so touching."},{"comment_id":"1677003925887340","commenter_b":"'@username, why do many Americans believe that Obama isn't concerned about protecting America? He has given no indication whatsoever that this is the case. As a matter of fact, he does just the opposite. Do you seriously believe that building a wall at the Mexican border and not accepting any refugees will do anything to stop terrorism? The roots of terrorism are not illegal immigrants or refugees. The roots of terrorism are Americas interferences in the middle east. The roots of terrorism are people who say 'bomb them and take their oil'. How would you feel if someone would say this about the USA? Terrorists can be fought with weapons but terrorism can only be fought with education. And this is exactly what Obama does. Educating people...by talking about Islam, by visiting a mosque, by saying he will stand with the Muslim Americans. That doesn't mean he hates Christians or ...","commenter_a":"Congratulations Mr. TRUMP. We look forward to seeing you here in SC. Our country needs a strong leader that's going to make this country great again. We need someone in the white house that actually is a christian, strengthens our military and will secure our borders. Take care of our people first, the great people of the United States.","post_message":"Good morning America! THANK YOU for your vote, New Hampshire! We will MAKE AMERICA GREAT AGAIN! Off to South Carolina today. Everyone have a GREAT DAY, and again- thank you!"},{"comment_id":"652024288284285","commenter_b":"I'm so glad.","commenter_a":"Yes","post_message":"Muslim Miss USA Chooses Jesus Over Mohammed... Islamic Community FURIOUS  She has the right to believe whatever she wants to believe.   Do you support her choice?"},{"comment_id":"10153307289837377","commenter_b":"And this Yankee Trump girl says thank you!","commenter_a":"Never doubted for a minute South Carolina wouldn't vote for Trump. Southern people aren't liars and we want a tough leader.","post_message":"Republican presidential frontrunner Donald Trump has won Saturday's primary in South Carolina, US networks projected."},{"comment_id":"10154551617736336","commenter_b":"Voting TRUMP, you dirty COMMIE BSTD... Only people like you get filthy rich off our flesh and blood! New WORLD ORDER NUT JOB","commenter_a":"This coming from a PURE MORON.","post_message":"Speaking in Austria, European Union chief Jean Claude Juncker said, “We have to fight against nationalism, we have the duty not to follow populists but to block the avenue of populists.'"},{"comment_id":"1253236361399557","commenter_b":"This is how much hillary hates women. Hillary wants to bring in illegals who hate women. @webpagelink","commenter_a":"Trump is afraid of Hillary for one good reason and that is why he constantly threatens her with assassination. Hillary can win over Trump by force of argument rather than by force of fear. You Trump supporters aspire to fear and violence. We Hillary supporters to free speech and Civil Rights.","post_message":"On this day in 1973, tennis champion Billie Jean King defeated Bobby Riggs in the “Battle of the Sexes.” King went on to found the Women’s Tennis Association, the Women’s Sports Foundation, and Women’s Sports Magazine to support women athletes on and off the court."}]
