[{"comment_id":"10156236766360354","commenter_b":"WHAT??? It doesn't designate the Black Lives Matter and the Black Panthers as terrorist organization for constantly calling on blacks to kill cops and white people and CAIR, but they want the NRA designated as one even though they threaten no one? This is absolute bullshit & I'm so tired of the attack on our 2nd Amendment rights!!! We MUST stand against this!","commenter_a":"NOT","post_message":"Here's how far the Left is going with this..."},{"comment_id":"1832691560303641","commenter_b":"Good don't want you back in the White House!","commenter_a":"Thank goodness, not that she would ever get elected after her husband's lousy job.","post_message":"It looks like we'll never see an Obama in the White House again. Is that good news to you?"},{"comment_id":"10155234005228984","commenter_b":"Shut off the money! Mandate Everify with suspension of business & huuuuge fines if caught hiring illegals. No Welfare or any other benefits to non citizens. Proof of citizenship to attend schools! They will self deport! As for DACA? Ok. Let those poor kids who were dragged here as children BUT deport the parents that dragged them here!","commenter_a":"They are pissed off because of our policies but let ne of us cross their broader and see what happenes.","post_message":"WATCH LIVE: Secretary of State Rex Tillerson, DHS Secretary John Kelly and Foreign Secretary Luis Videgaray make statements from Mexico City on President Donald J. Trump's new immigration proposals."},{"comment_id":"848307568693153","commenter_b":"GO stuff your FAT ,UGLY, RACIST face!","commenter_a":"What IF I ONLY HATE \\bOBAMA'S \"WHITE\" Half???","post_message":"If you hate Oprah does that make you a racist..."},{"comment_id":"569853826519212","commenter_b":"So how was your nap after clearance today then?","commenter_a":"@username this is you","post_message":"Facts"},{"comment_id":"10153823736048128","commenter_b":"Gee Rickie: thanks for clarifying this And, I know my geography idiot; I was referring to Europe in a cultural sense. Did you forget to take your Autism meds Rain Man? By the way, we thick Yanks haven't allowed an invasion of Muslims into our Country on a scale no where near proportional to your own Country. Your Nation is finished you morons! So, go choke on a hookah you snarly toothed Lime!","commenter_a":"Why bother at this point when they are allowing millions of Islamists to openly invade Europe?!?! Seems like an exercise in futility or just some good media PR to appease scared & irate native Europeans.","post_message":"Authorities in Italy, Germany, Switzerland, the U.K. and Scandinavia searched 26 premises and seized electronic devices and documents."},{"comment_id":"644282239071875","commenter_b":"I wish you ugly frumpy women would shut the hell up. Your blind support of Hillary is going to put Trump in the White House.","commenter_a":"He needs to bow out, pledge his delegates to Hillary and move on.. Hopefully she will have a place for him in mind and he can be of some help in the future. He's led a sterling campaign, but has been on the loosing side for the last few primaries and is bound to loose tomorrow.... YAY Bernie for doing what you did, now solidify the party, tell your supporters to support Hillary and then we can all go forward to enihilating trump and winning the presidency. Your Elizabeth Warren can still BE the VP candidate and together the women can set the world on fire and win... America is ready for this.. Trump must be downed and your support of Hillary will clinch that! PLEASE..","post_message":"Does Bernie Sanders keep fighting through July's Democratic convention? Or does he bow out?"}]
