[{"comment_id":"1234855006552733","commenter_b":"trump = sexual predator. You really feel ok getting behind this rapey racist creep? Wake up you ignorant fool!","commenter_a":"If you are a woman who is offended by what Donald Trump said a decade ago but you enjoyed 'Fifty Shades of Grey' and other movies and books like this than you are a hypocrite! Do you laugh when comedians talk like this or do you stand up and leave the room!?! I was not offended, I could care less what he said BS's with men in private - give me a break! I care about what he says and does now - I care about what he will do for our country! Look what Hillary did that mainstream media is covering up - her speeched released show she also refers to people as bucket of losers....has two different policies, one for public,one for private...not to mention the entire email scandal with her 'innocent' friends all getting immunity...why do innocent people needimmunity?","post_message":"After audio was released of Donald J. Trump saying highly controversial things about women, Christian Coalition founder Ralph Reed shocked the media with a huge announcement on the Republican nominee.  Nobody saw this one coming... what do you think about what Reed said?"},{"comment_id":"10154087182591409","commenter_b":"'@username Michelle had to keep her legs closed or her dick would fall out!","commenter_a":"Lisa erikson just because Hillary hasn't been charged and found guilty doesn't mean she's not. She's a liar and as crooked as Obama and Michelle on many levels. Keep lying to yourself.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"848560338575181","commenter_b":"BUILD THE WALL","commenter_a":"and this comes as a shock to no one.......ban them.","post_message":"Reports say #ISIS now has a passport machine to have its believers infiltrate our country. I told you so! We need to protect our homeland - and make it safe for all citizens. We need leadership! #Trump2016"},{"comment_id":"10153199034456051","commenter_b":"To whom are you directing the 'Lazy whore' term, Chieng Yang? Just wondering. ..I think that kind of name calling is unnecessary and unproductive.","commenter_a":"Hey lopsided breast implants are her punishment...","post_message":"This woman says she really doesn't care if anyone is offended by her photos - they're staying up."},{"comment_id":"1157488834340407","commenter_b":"I thought she was leaving. No one cares what she says","commenter_a":"She lies as much as killery","post_message":"Miley Cyrus, a Hillary Clinton supporter, is extremely sad."},{"comment_id":"10154444576164586","commenter_b":"I would still eat the ishhhh out of that piggy","commenter_a":"What do they expect it's part of an animal! Keep showing these disturbing photos until it makes a real difference","post_message":"This is so gross, it's no wonder so many bacon-lovers are vowing to ditch it."},{"comment_id":"10153602111881336","commenter_b":"No Obama already congratulated them.","commenter_a":"Obama will probably prosecute them.","post_message":"Three Americans are being hailed as heroes today for tackling and disarming a gunman on a high-speed train traveling between Amsterdam and Paris."}]
