[{"comment_id":"10153024604841037","commenter_b":"Black people should pay more TAX","commenter_a":"Poor Bill, women coming from everywhere trying to get a payout. I believe you Bill.","post_message":"A model who claims #BillCosby assaulted her at the Playboy Mansion met to pursue criminal charges"},{"comment_id":"1297424046964731","commenter_b":"Not a Christian. He's a low-life creep!","commenter_a":"That doesn't sound very much like what Jesus would say","post_message":"WOW!"},{"comment_id":"10153117989439342","commenter_b":"Stfu","commenter_a":"Why is this breaking news??? So what!! You glorify more sin than good!! Tell the world about Jesus!! Stop caressing this foolishness like its normal! I see why God clearly warned us not to be of this world!!","post_message":"The first image of Caitlyn Jenner, formerly known as Bruce, has been released by Vanity Fair magazine --> @webpagelink"},{"comment_id":"1281382285238371","commenter_b":"Well said. If this Jolie live in Muslim country like we do ,then her opinion about Islam will radically change. She should know the Muslim will never compromise with others..stupid","commenter_a":"I don't listen to rich new world order liberal fucking wackos. If the come out and try to tell us all to do something. Its never ever good. This Bitch is rich living in nice safe places. Safe from the hell the rest of us would have to deal with","post_message":"DOES ANYONE CARE WHAT THIS LOSER HAS TO SAY?"},{"comment_id":"10153931656668812","commenter_b":"This is way out of context y'all all sound ignorant specially the one starting this comment","commenter_a":"Waiting to see who blames Obama or immigrants....","post_message":"Long Island town demolishes U.S. Navy veteran's home while he was in Florida recovering from a knee replacement: @webpagelink"},{"comment_id":"915008615188661","commenter_b":"The other race of women say the same things, they just not on here.","commenter_a":"Good for him, this happens to men all the time. The women on here that are outraged are the type of women that men should stay away from. Nothing worse than a hypocrite. I can't help but notice that the women that are upset are mostly black. Very telling","post_message":"Tasha Smith forced to pay ex-husband $7K a month, in addition to the $50K she gave him last year @webpagelink"},{"comment_id":"10153590637376336","commenter_b":"Nuclear is clean efficient and it's a country's pride! Do you know ordinary Iranians are really nice folks?","commenter_a":"Boy this Iran sure wants nuke power really bad, but what I don't understand is why they need nuke power to light up clay homes in the desert. Does anyone else see a different picture? America used wind, coal, steam as a first time power source.","post_message":"Iran will reportedly be allowed to use its own experts to inspect a site it allegedly used to develop nuclear arms under a secret agreement with the International Atomic Energy Agency."}]
