[{"comment_id":"10153530483933872","commenter_b":"We are tired enough of the lies and deceit and are going to vote you out- both of you wicked queens of the damned!","commenter_a":"Oh no, Patty! Why do you have to endorse Hillary? Disappointed that you don't #feelthebern","post_message":"It's great to see Hillary Clinton focus on this critical issue for our families, our economy, and our future."},{"comment_id":"735565289967382","commenter_b":"Dear God, kick this ignorant African so hard he gets back to Africa. He needs English as a second language. Also needs to be taught to not make threats. What a POS. Go back to where you came from.","commenter_a":"This guy is a fanatic. He'd better be stop or someone s going to get Bharat namely, him","post_message":"Knife wielding Muslim attacks Trump, but watched what happens next. I bet he never expected this. Let's show him our support. Can we get 30,000 'LIKES' Donald Trump?"},{"comment_id":"10150618266494999","commenter_b":"Benny no where have I said or implied \"let the floodgates open and let every single person just come on in\". If you read my 1st few words, you would see that just putting a concrete wall around the WHOLE country is not the answer. Take the opportunities away and well, you should be able derive the answer. The ones that are here, are, whether you believe it are not, contributing to society already. They cut your lawns, serve your food, make your sandwiches etc etc. Even work the farms. I am not for illegal immigration whatsoever but to say they who come over bring us problems!!...I think we have benefitted more from them than not. I am just saying not all illegal immigrants are Mexicans. As for your Chinese response, true they would love to come to America. A lot do make it here (illegally I may add). Have ...","commenter_a":"This is how people misinterpret words. Trump was talking about ILLEGAL immigrants. No offense was towards Bushs wife. Unless of course she is illegal.","post_message":"\"He’s not a stupid guy, so I don’t assume he thinks that every Mexican crossing the border is a rapist,\" Jeb Bush said of Donald J. Trump."},{"comment_id":"1321278027895520","commenter_b":"@username The only thing she can do is race bait and pay for play. Everyone sees it now. Clinton lies like a RUG .She tries to make everything a race issue it is Economic issues. All Americans , she is the one race baiting .How can she and her friends think they can run the Country when they can`t even control their Husbands ? She didn`t take long to throw a well respected Black General ,Colin Powell under the Bus to cover more of her lies ? She also says Trump supports KKK views ? His grandchildren are Jewish for crying out loud. When will liberals wake up ? How do ya get Rich working in the Public Service","commenter_a":"The only thing she can do is race bait and pay for play. Everyone sees it now. Clinton lies like a RUG .She tries to make everything a race issue it is Economic issues. All Americans , she is the one race baiting .How can she and her friends think they can run the Country when they can`t even control their Husbands ? She didn`t take long to throw a well respected Black General ,Colin Powell under the Bus to cover more of her lies ? She also says Trump supports KKK views ? His grandchildren are Jewish for crying out loud. When will liberals wake up ? How do ya get Rich working in the Public Service ?","post_message":"Thank you for the great feedback on my Immigration Speech last night in Phoenix, Arizona. I am grateful for everyones support. I want to thank the ANGEL MOMS - who I met last year when I began campaigning. I am truly humbled by their courage and bravery - they are truly INSPIRATIONAL to me. I love the United States of America - and it has been so good to me. I want to MAKE AMERICA SAFE AND GREAT AGAIN - with you, the American people. -DJT"},{"comment_id":"10153848285134497","commenter_b":"In others words BITCH, BYE!! Am I speaking your language now?","commenter_a":"But on a real level...this is what all parents should do with their offspring when traveling.","post_message":"\"Look at that, she not even stirringwhat a perfect sleepy angel!\""},{"comment_id":"10154331295400695","commenter_b":"Praying","commenter_a":"Lord I pray for these families. Unless you have lost a child no one can even imagine the heart break they feel right now. I ask you Father to walk along side of each one of the family members wrap your arms around them to let them know you are right there for them to lean on you or carry them thru this. They have now entered the choir of angels . God bless all","post_message":"#PrayforUGA: We just received these photos of Christina Semeria, Halle Scott, Kayla Canedo and Brittany Feldman, the four UGA students killed in last night's tragic crash. Our hearts go out to their families and friends. @webpagelink"},{"comment_id":"1166997406690286","commenter_b":"We also have an excess of employers giving jobs to illegals. So really we don't have an illegals problem we have an employer problem. If there were no jobs to be had there would be no illegals.","commenter_a":"I don't want more foreigner coming in. that is for sure.. but.. there are right now 10 jobs for every man women and child in this country.. way way more jobs than people.. way more.. so..","post_message":"Do you agree with Senator Sessions on this?"}]
