[{"comment_id":"1012961912156618","commenter_b":"I would give my share to put there asses on a boat and send the ass holes somewhere else","commenter_a":"Big mouth and no brains. This is what Obama has done for this country. What a disappointment.","post_message":"'Pay me consistently, provide me safe housing, offer me a job with benefits, run me those Beyonce tickets' She must have lost her mind, if she thinks we are going to pay her anything. Will you pay for this entitled BLM organizer to go to a Beyonce concert?"},{"comment_id":"548856361983005","commenter_b":"Yes","commenter_a":"Yes","post_message":"The NFL, coaches, and fans are sick of him and his garbage. The league has had enough. Do you think Kaepernick should be ejected from the league?"},{"comment_id":"927580090624348","commenter_b":"'@username OMG are you loco? This b&tch kills off people.","commenter_a":"You not being elected the President will make America safer","post_message":"Hillary Clinton: Guns Will Not Make Americans Safer #DemDebate   @webpagelink"},{"comment_id":"10154623463961336","commenter_b":"and she wants us deploables to pay for their free ride 😡🙄","commenter_a":"Hillary wants more illegals and she cannot even speak Spanish!","post_message":"Chris Christie slammed Tim Kaine for comments he made accusing Donald J. Trump of inciting violence at his campaign rallies, on 'Fox News Sunday.' @webpagelink"},{"comment_id":"10154093101217452","commenter_b":"OMG. You must be a plant. No one could be that ridiculous.","commenter_a":"We are no longer fighting soviets obama. Russia is a friend in the war against ISIS.","post_message":"'Ronald Reagan would roll over in his grave.'"},{"comment_id":"10153097133433271","commenter_b":"Better relocate. .. drunks and moosee don't mix well..... drunk will loose","commenter_a":"'@username this would've been amazing:)","post_message":"A young female moose wandered into downtown Boulder Sunday night, strolling down the Pearl Street Mall. On the advice of a state wildlife officer, police fired some bean-bag rounds at the moose's backside and eventually shooed it away from the populated area.  More details: @webpagelink"},{"comment_id":"10153753535205695","commenter_b":"She should be impeached","commenter_a":"I don't think she should be jailed. They should just fire her.","post_message":"#BREAKING: Judge orders defiant Kentucky clerk to jail after she refuses to issue marriage licenses."}]
