[{"comment_id":"1038233369545417","commenter_b":"Can't stand her!","commenter_a":"I stop to watch her program Always bashing on the same person all the time ! I did think that during the first debate the question was legitimated after all he has to respond because the question was going to be asked from her or somebody else But after all the bashing my trust in what they call fair and balance news under her reports was gone and I was certain that She did have an agenda by starting by this type of question Also what is making me mad is all the spin around her the queen She giggles all the time even when her guests are vulgar in her program It made me laugh when I ear that she is a respectable journalist and fox stands for her Did they listen when she was giggling from her heart when somebody said that during one of the debate \" ...","post_message":"Megyn Kelly didn't hold back! (WATCH)"},{"comment_id":"945737062128382","commenter_b":"Most Muslims are opportunists & try to take advantage of our awesome OPEN accepting country and are trying to push their false religious bogus rules and regs on us. Too late. Two wars have been fought on our soil and much blood shed to protect our American way of life and that includes the right to run a busniess free of foreign rules... do not continue trying to bring foreign laws into the equation..it doesnt fit!!!. America's laws are the way we live life..NOT islam..thats for syria etc..those rules are SOOO not ever going to work here so just try to relax and accept it. Get some counseling. Maybe then you will be happier and free from manmade male imposed non Christian laws. They always seem so negative..no joy in life! You're in America..rejoice..embrace your new life here. Jesus will set you free from the bondage of FALSE RELIGION...ask the ...","commenter_a":"She must follow the rules of the country where they live and enjoy the luxury of that country. If they don't, they must return back where they came from.","post_message":"Muslim woman wouldn't remove hijab, but hypocrisy bit her in a BIG WAY!"},{"comment_id":"10154704981818812","commenter_b":"Shut up Ayesha","commenter_a":"NBA is rigged!","post_message":"U.S. men's basketball team earns gold for third consecutive Olympic Games and the sixth time in seven tries with NBA players."},{"comment_id":"573261456173658","commenter_b":"Praying for you Dr.Carson you can do this","commenter_a":"they don't persecute christians alone. innocent people of all faiths and lack of faiths are persecuted, i think its wrong to focus on only the christian victims","post_message":"Our country faces grave national security threats. We must act boldly and decisively to protect American citizens from terrorists at home and abroad. We can no longer dawdle while ISIS continues to persecute Christians, enslave young girls, oppress civil societies and perpetrate terrorist attacks against the free world. We must destroy their caliphate and prevent their terrorists from infiltrating our homeland. We must also secure our borders, identify radical Islamic extremism by name and root out its agents and collaborators in our own country. My \"Seven Steps for a Safer America\" offers a path forward for confronting these threats and protecting this great country.  1. Congress should immediately issue a formal declaration of war on the Islamic State, which is also known as ISIL or ISIS.  2. The United States should lead the immediate formation of – and provide substantial advisory, financial and military support to – a military coalition in the Middle East to wage war against ISIS. Such a regional coalition would consist of countries such as Egypt, Saudi Arabia and Jordan.  3. The United States should urge its allies and partners in the Middle East to engage in massive recruitment and training of Sunni Syrian men based in Saudi Arabia and the Gulf and of Sunni Syrian male refugees in Jordan – to establish a military force to destroy ISIS and to establish a protection zone for the victims of the terrorist state.  4. The United States should deploy its military resources and work with moderate Arab nations – as well as extend strategic support to Kurdish, Christian and Sunni tribes in the free al-Hasakah Province in northeast Syria – to establish a refugee safe zone in the Province. All refugees should be directed to that free area and to other liberated areas later, and be put under international protection.  5. Congress should immediately establish a war-time emergency visa and immigration policy; establish an emergency inter-agency task force to review all visa and immigration policies; and limit visitor visas to three months with mandatory check-ins for extensions no longer than three months.  6. President Barack Obama and Congress should immediately deploy the National Guard and military troops to patrol the U.S. southern border as well as designated spots along the northern border.  7. The Department of State should designate the Muslim Brotherhood and other organizations that propagate or support Islamic terrorism as terrorist organizations, and fully investigate the Council on American-Islamic Relations (CAIR) as an offshoot of the Muslim Brotherhood and a supporter of terrorism."},{"comment_id":"1411515005587074","commenter_b":"@username yes you are bitch","commenter_a":"Thank God he is back. Just feel better knowing he is in the USA.","post_message":"Welcome back, President Obama!"},{"comment_id":"1167989119901455","commenter_b":"How do we know that it is a woman makig the comment?","commenter_a":"Looking his wife in the eye and saying thank you when she hand him a coffee might be a good step towards rebuilding intimacy.","post_message":"\"Honestly, I want to feel that we’re not just roommates—that we’re not just waiting for the kids to grow up so that we can move on.\""},{"comment_id":"10154326338646336","commenter_b":"I don't have a family or children. I am not offended in the least. It might be a downer for those couples that are trying to start a family but geez........just quit being so sensitive. The world is not fair nor is it perfect. Keep moving forward.","commenter_a":"START A FAMILY, START A FAMILY, START A FAMILY. get over it you big babies.","post_message":"Is the phrase \"start a family\" offensive? Apparently some people think so."}]
