[{"comment_id":"1083798354993969","commenter_b":"You're an ignorant cunt Rosie","commenter_a":"Sell yall anything and then yall prounce on it. He ain't sided with humility that's his only thing he can do to them white bois. As a black police officer he can't beatem, rough them up, shootem, killem like they do \"somebody's\" people. That's for sure a death sentence then.","post_message":"When a KKK member suffered a heat stroke at the hate rally in Columbia, a black police officer put aside his personal feelings and sided with humanity."},{"comment_id":"871509956275393","commenter_b":"Fuck u.bitch dani","commenter_a":"Whoopl.is.a.racist bitch","post_message":"They really destroy the argument for keeping the racist flag around."},{"comment_id":"10153478346566955","commenter_b":"Nancy Reagan has more class in her little finger than Michelle Obama has in her entire \"hulkish\" body!!!!!!!","commenter_a":"As always, a lady of class! Hoping this next debate, we get a chance to hear from ALL the candidates more than the moderators.","post_message":"Nancy Reagan invites 16 candidates to next debate..."},{"comment_id":"1612409662385087","commenter_b":"If we refuse service/sales to illegals we would be fined or jailed. They have rights, you know! More rights than American CITIZENS have!","commenter_a":"Hey...do not rent nor sell groceries or clothing or gas or anything else essential to their staying here....if we stick together their existence here will be short and sweet....","post_message":"This is stunning. After seeing this more countries might do the same. Do you think the two are connected?"},{"comment_id":"10153505413366770","commenter_b":"She's an idiot","commenter_a":"Kelly girl get over yourself, now your show will be a flop.","post_message":"Kelly Ripa was dressed for a funeral."},{"comment_id":"1247598538653217","commenter_b":"Cheap wages and NO regulations. So tell us, what's unreasonable? Are the international businesses really hurting that bad? Oh, right, it's the \"shareholders\" that are burdened","commenter_a":"Government caused the exodus of manufacturing. 35% corporate tax, EPA regulations, inflated wages, high energy costs. Don't let government fix anything. All they do is break things.","post_message":"Too many working families in the Midwest have been left behind because of the outsourcing of American jobs. I led a letter with Rep. Debbie Dingell and 24 other colleagues to urge Congressional Leadership to expand opportunities in manufacturing communities harmed by outsourcing. It is critical Congress takes immediate action to jumpstart the economic prosperity of our communities."},{"comment_id":"1096205787130648","commenter_b":"this bitch looks horrible","commenter_a":"He sure doesn't call the Super predators you pos","post_message":"...says the woman who trashed tens of millions of working class Americans."}]
