[{"comment_id":"864050243704778","commenter_b":"We should have spoken up about the poor quality of the American diet sooner. GMO food & MSG should have been outlawed!","commenter_a":"TRADUCTION ARCHI NULE","post_message":"Well?"},{"comment_id":"10153478399867993","commenter_b":"Do it already.","commenter_a":"What are you waiting for? Her to be elected???","post_message":"Judge suspects ‘bad faith’ from Obama administration on Hillary Clinton emails, threatens subpoena to force former Secretary of State to turn over entire email account."},{"comment_id":"928696510523431","commenter_b":"She should think about buying a woman's breasts.","commenter_a":"This girl can actually sing. Not sure why she does these things. Pointless, & invalidates her as an artist.","post_message":"Miley Cyrus shares naked tub pic"},{"comment_id":"421525971373828","commenter_b":"Stop apologizing women! I had an abortion, cause I wanted to and no one ever new! Lol! Ya know why, cause its not your business! Stop saying ,well my birth control didn't work, blah blah blah. Its not illegal! If you don't like abortions, don't have one.","commenter_a":"What does that actually have to do with abortion? Viagra is not causing the death of a living being. It's not about hurting women's reproductive decisions. I mean, I'm all for birth control methods. Just imagine how many abortions could've been avoided if the women were using a very effective form of birth control? And, before anyone says that you can get pregnant on birth control or while using condoms, let me just state that it is over 99% effective if used properly. Although it is possible, it would be a fairly rare occurrence.","post_message":"\"I purposely tried to make it as invasive, as intrusive, as hypocritical and unnecessary as possible,\" the lawmaker said."},{"comment_id":"1157612937618557","commenter_b":"Yes we all should judge illegal immigrants as invaders and depot them! good ppl or not they MUST GO","commenter_a":"Color Blind? All Trump has done in his campaign is judge people by there color and culture.","post_message":"Ivanka Trump on the people her father hires: \"He is color blind and gender neutral.” @webpagelink"},{"comment_id":"517613611762552","commenter_b":"@username must be an ignorant stinking liberal!","commenter_a":"Why can,t we ban liberals ???????","post_message":"Liberals are trying to get rid of one of your favorite snacks. Stop being so sensitive. We need to put a stop to this. Do you agree Liberals pushing their beliefs on you?"},{"comment_id":"1764590997115642","commenter_b":"Melanie can say she wrote her speech speaks what pea brain she have.","commenter_a":"Maybe because she copied it down in her own handwriting she THINKS she wrote it!","post_message":"WOW – Melania Trump’s plagiarism scandal just got even more interesting... Video by Occupy Democrats, LIKE our page for more!"}]
