[{"comment_id":"10157235838770231","commenter_b":"Because they are white? And black thugs will get arrested because they are black very simple?","commenter_a":"Privileged, yes. I'm not convinced about the White part. Jameis Winston was accused of a much more serious crime but because he is an athlete he was shielded from those repercussions. And let's not even get into Bill Cosby.","post_message":"It must be nice to be white and entitled."},{"comment_id":"10154079129819091","commenter_b":"Pence CNN 9/8/16 'I think it's inarguable that Vladimir Putin has been a stronger leader in his country than Barack Obama has been in this country.' Pence VP Debate 10/04/16 'That is absolutely inaccurate. I said he's been stronger on the world stage.” Like his master Trump, Pence lies about his lies. The Trump campaign hostility towards President Obama is a national disgrace. President Obama is 100 times the leader that Trump or his boy Pence will ever be.","commenter_a":"The problem with Kaine was when Kaine spoke, Pence let him speak but the minute it was Pence's turn, two seconds into his turn Kaine was interrupting him, he's such a putz.","post_message":"VP nominees Tim Kaine and Mike Pence were both on the attack Tuesday night:"},{"comment_id":"10153278165616336","commenter_b":"Put down the assault fork and nobody will get hurt!","commenter_a":"Ummm.. Say what fattie? You can't handle food ownership.","post_message":"'Americans do not seem to be able to handle gun ownership in a way that permits maintenance of a civil society.'"},{"comment_id":"988263084573780","commenter_b":"Iam not ur bitch","commenter_a":"'@username Jøkêå Downey-mccain Kealeo Dixon @username 😂😂😂","post_message":"When Your Whole Squad On F*ckery Level 10!"},{"comment_id":"10154672765359760","commenter_b":"Why? Ugly horse face bitch!","commenter_a":"Hell No! She didn't belong there in the first place. Garbage.","post_message":"Michelle Obama was loved by millions of people around the world as First Lady. Do you miss seeing her in the White House?"},{"comment_id":"10154264988769062","commenter_b":"Outta place.","commenter_a":"I hope they put trash bags in his cell.","post_message":"CORRECTION: The Harris County Sheriff's Office released a corrected mugshot of Shannon J. Miles. The mugshot displayed at the HCSO press conference was incorrect. Miles is charged with capital murder in last night's shooting death of Deputy Darren Goforth.@webpagelink"},{"comment_id":"946413835412782","commenter_b":"100% on welfare and too lazy to work. Their freebie food gives them energy to cause protests and riots all the time.","commenter_a":"I wonder if George Soros is funding any of these BLM people. He funded the protesters at Ferguson and Baltimore. Same faces running around protesting....","post_message":"Grassroots Activists Push Black Lives Matter Thugs Off Of Michigan Ave [Video]  This is what the main stream media DIDN'T show you..."}]
