[{"comment_id":"10152747219056051","commenter_b":"This is soooooo wrong and why can't these cases be corrected immediately when the proof comes out. The women who do this should be prosecuted and pay for All damages!","commenter_a":"Back in 1990 I had to pay 400 a week child support for 3 kids the courts let me have custody of my oldest boy gave the ex-wife custody of the three youngest the day that we walked out of the courtroom the ex wife let me have the other three children two years later the welfare department came to me and told me that I have to pay back the last two years of u living expenses that they was giving her she forgot to tell them that she was getting 400 a week the last 2 years took me 2 years in the court system to fight it the system does not like to put women in jail so I know what you are going through","post_message":"This man had an arrest warrant issued for him and got threatened with jail time over unpaid child support. There's just one problem."},{"comment_id":"1274246805922508","commenter_b":"Of course it's happening in England and if Americans don't wake up, you will see it here too. Open the Bible and read it with your family. it will show you who God is and who this muslim god is. Protect your family at all costs.","commenter_a":"If this is allowed to happen in the US, then mistakes have been made, and someone will need to pay!","post_message":"This school has taken things WAY too far. This is ridiculous. Is this school committing a crime?"},{"comment_id":"10153430639944255","commenter_b":"This woman wants us to return to the 1950s? I guess that means she's going to shut up and make me a sandwich.","commenter_a":"Around 70% of White America does not live in a diverse city as is, and this is the reason for so much suspicion about people of other races, and culture. I am not for this kind of self segregation, but at the same time I do not believe we should be about forcing people to live where they do not now live. Until we learn that people are people this will never change.","post_message":"Yes, this is a real post from a real elementary school teacher in Texas."},{"comment_id":"10154684897643872","commenter_b":"Cow Patty is a crooked Hillary corporate baby killing whore and will lose in November!!!!","commenter_a":"Yeah, I'm voting you out for voting for TPP, freedumb act planned unparenthood and supporting crooked Hillary, enjoy unemployment Cow Patty!!!!","post_message":"Voting starts today! Got questions? Visit iwillvote.com for answers."},{"comment_id":"10154841543903984","commenter_b":"Go to prison Hillary! !","commenter_a":"This is proof this election is and will be rigged. There's absolutely no way Hillary is leading in the polls. She will win but by using massive voter fraud.","post_message":"Fox Business Network just took a serious swing at Hillary Clinton, and it definitely was NOT a miss. The network exposed on-air the one thing mainstream media would never show you, and Hillary does NOT want it seen."},{"comment_id":"10153236038721336","commenter_b":"See this is what I mean, we know this guy is a terrorist. He admits so on TV and trains other MUSLIMS the most effective ways to be a terrorist. Why is he allowed to walk the streets? We need a force not answerable to normal athority that can move in on MUSLIM terrorist like this without constraints and not having to watch them for 10 years then wait a week after they attack to make an arrest. Get the job done and move on to the next one.","commenter_a":"Why giving your air time to this evil, wicked man","post_message":"Imam Choudary: 'The United States of America are the champions of murdering innocent people!'  Muhammad contest organizer Pamela Geller: '[We're] the champions of freedom, sir!'"},{"comment_id":"10153065488357217","commenter_b":"Because you are another dependent brain-washed puppet and the worst part of you think you're on the right side! Praying for you!","commenter_a":"Well done Kentucky clerk! And you masonBBC don't try to make real Christians look like some bunch of homophobes! Shame on you @username! You should apologies!","post_message":"UPDATE: AP reports Kim Davis, the Kentucky clerk who won't issue marriage licences, and all her deputy clerks have been called to appear at a federal court hearing on Thursday morning.   County Clerk Kim Davis eventually came out of her office, but she said she would not issue any marriage licences.  'Under whose authority?' she was asked. 'Under God's authority,' she said."}]
