[{"comment_id":"10153901332209411","commenter_b":"Russians shout their own feet. We do not export our high quailty fruit and veggies anymore. Go and import from china the plastic one !","commenter_a":"We have banned all Turkish produce on our global operations since last week...and will never have any trade relations with that country. May it be Diplomatic or Corporate! For as long as it's erdogan's administration.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153918981451509","commenter_b":"Illegals are a huge problem","commenter_a":"Where is Donald Trump and his outrage????? Ohhh wait, you got to be illegal for him to care who gets killed!!!!!!","post_message":"The suspect in a shooting in an Antioch, Tennessee, movie theater is dead, Nashville police say. @webpagelink"},{"comment_id":"10153779566119170","commenter_b":"Bush is a tush","commenter_a":"They need to stop this childish back and forth banter, and get back to the serious problems that need to be solved in this country! SMH...","post_message":"Jeb is pulling out all the stops on trashing Donald J. Trump, even comparing the billionaire to ultra-liberal filmmaker, Michael Moore. Of course, Trump had to respond!"},{"comment_id":"628929223957206","commenter_b":"By Bitch.","commenter_a":"And don't forget to take Rosie, Whoopi, Kanye and the rest of the we're-leaving-if-Trump-wins morons with you! Good riddance to all!","post_message":"Miley Cyrus packing her bags and taking off after trying to take on Donald Trump. Say goodbye! Good riddance. Can we get 30,000 'LIKES' to have Miley leave the country?"},{"comment_id":"10155056114144749","commenter_b":"hoorah!","commenter_a":"Good review worth reading.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154568633769411","commenter_b":"'@username, fuck cows!!","commenter_a":"It's really strange, Facebook isn't offering me a chance to superimpose the Pakistani flag over my profile picture. It's as if they dont really give a fuck unless it suits the agenda of the overlords of western governments.","post_message":"The Khorasan province branch of ISIS has claimed responsibility for the attack"},{"comment_id":"10153006629032756","commenter_b":"no it isn't all urine its sweat also, you ever lean on a couch and your arms start itching well that usually sweat, other bodily liquids like tears, saliva and other related stuff can cause the burning of the eyes too","commenter_a":"Jason Meade","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
