[{"comment_id":"1255087781177916","commenter_b":"Get on your knees and suck my big fat hillbilly cock. Lol ....","commenter_a":"Republicans deserve a President Cruz who gets his condoms from dive bar bathroom dispensers.","post_message":"It's not who the party's establishment thinks."},{"comment_id":"10154001146333598","commenter_b":"Give me a chance at her murderous body!","commenter_a":"Shame on you.","post_message":"This Abortionist Flies in to Planned Parenthood to Abort 31 Babies Every Day"},{"comment_id":"10153784799867894","commenter_b":"Andy needs to fire her ! #GoodBye2BasicBitches","commenter_a":"@username another storyline to stay on #RHOA","post_message":"It’s Really Over! Cynthia Bailey Announces Plans to Divorce Peter Thomas: ‘I Just Don’t Want to be Married Anymore’"},{"comment_id":"10152816296297452","commenter_b":"I hate possums they look like big rats","commenter_a":"Time to burn the house down","post_message":"Can something be totally terrifying and completely cute at the same time? We've seen a lot of \"wild animal in the city\" stories here in Southern California: bears, coyotes, mountain lions... But this could be the wildest. What one L.A. woman found in her closet is lighting the internet on fire. @webpagelink How it got in... how it got out... and the reason it was so angry. Tonight at 11 from ABC7 Eyewitness News. Courtesy: Tara McVicar"},{"comment_id":"10153085748364312","commenter_b":"So it's appropriate for the race card to be thrown here?? Wow","commenter_a":"I bet they don't get gunned down! BC \"white lives matter\"","post_message":"Two teenagers from Kentucky who vanished nearly two weeks ago are suspected in a multi-state crime spree."},{"comment_id":"897818090261432","commenter_b":"Put her in jail!","commenter_a":"Go straight to jail. Don't pass go.","post_message":"Which Hillary Clinton scandal is bigger? Is it the one involving her likely illegal secreting and destruction of email records from her time as secretary of state, or is it the one involving the massive conflict of interest she wholeheartedly embraced by using her family’s nonprofit foundation to collect millions of dollars from foreign government donors — again, during her time as secretary of state? @webpagelink"},{"comment_id":"10153931613802093","commenter_b":"I hope they carve him really good in TDC.","commenter_a":"What a motherf**king piece of s**t thug. Die, a**hole! Yeah, I'm pissed.","post_message":"BREAKING: Gustavo Zavala-Garcia has officially been charged with capital murder in the death of 10-year-old Kayla Gomez-Orozco. His bond has been set at $10 million. bit.ly/2fwFjd0"}]
