[{"comment_id":"10153828561639369","commenter_b":"You know all people do is speculate as to what happened but there was clearly better ways to handle this situation then to get your own self in trouble and have your whole neighborhood thinking there is some psycho out there. No the kids shouldn't be doing that kind of stuff but why would a grown woman behave that way over some toys and trash.","commenter_a":"This woman didn't handle this situation well at all. That being said, don't parents teach their children what respect is any more??","post_message":"News of the weird....   An anonymous threat said, \"The children look delicious. May I have a taste?\""},{"comment_id":"1130006897113975","commenter_b":"Get out of America then","commenter_a":"It is a sad day in America. One of the most disgusting men in in our country won the election. I am so sickened by the citizens who would cast their vote for such an evil man. Do they really feel he is person to speak for us as a nation. I find him so repulsive by his words and actions.","post_message":"THESE 23 HOLLYWOOD IDIOTS PROMISED TO MOVE IF TRUMP WINS..... LET'S HOLD THEM TO IT"},{"comment_id":"1196725563700232","commenter_b":"You left out the part where Trump plans on cutting taxes on the most wealthy as well., Then there are Trump plans for how trade with China and Mexico is going to be handled, yet even now all the products that bear Trumps name are being manufactured in China and Mexico. Perhaps to show he is working in good faith, don't you think he should have them manufactured here in the US? It is quite simple to say I'm going to do this I'm going to do that but it is far more difficult to actually do them. He might say it, if elected he might try and do it but I guarantee you he is not going to \"make\" the Mexicans pay for his wall, a wall that will actually do little to stop the flow of illegals. The gun he will hold to the Mexicans head to make ...","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, preserve the sanctity of the unborn life, preserve the sanctity of the 2nd amendment ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness","post_message":"Take a look at the companies that are partnering with this pro-amnesty open-borders group!   @webpagelink"},{"comment_id":"10153665284600163","commenter_b":"and what's wrong with PUSSY? I never had any complaints about it","commenter_a":"What a Bunch of Wussies .. What happened to free speech and \"Sticks and Stones may break my Bones .. But Words will never Hurt Me \" ?????? Damn we are becoming such a Pussy Country.","post_message":"Sad to say, this comes as no surprise... @webpagelink"},{"comment_id":"1088341921206279","commenter_b":"She is smart ! He is Dumber than a door knob !","commenter_a":"THE WHOLE WORLD condemns this moron. He's out of his fucking mind.","post_message":"As far as Mika Brzezinski is concerned, Mike Huckabee is repulsive and has no business being a candidate for president."},{"comment_id":"1270150533061172","commenter_b":"Lock her up","commenter_a":"we all know it was a fake story but the truth is \"SHE IS A TERRORIST \"spreading hate is no different than using a knife or a gun.","post_message":"Fake News: Drunk Trump Supporters Assault Muslim Woman in NYC Subway, Call her a 'F***ing Terrorist'"},{"comment_id":"10153166398548812","commenter_b":"If you want current news coverage, go to the news stations. Not Obama","commenter_a":"where is obama,why he is deadly silence now ?","post_message":"\"My best friend was killed and I don’t know why.\" Chapel Hill Shooting: @webpagelink"}]
