[{"comment_id":"10156409954230354","commenter_b":"DUMBASS BITCH STRIKES AGAIN!!!!!#","commenter_a":"Get her out of the power supply. Feel for your own residents. One bankrupt San Bernardino. Please give our city hope .","post_message":"Nancy Pelosi’s message to Americans this Thanksgiving is that the nation’s “broken immigration system” is “cruel” to illegal immigrants. No mention of the THOUSANDS of victims of criminal illegal aliens. Pass the turkey..."},{"comment_id":"10153576810758984","commenter_b":"Lot of good women out there but she's not one of them!!!","commenter_a":"Hillary is another Obama in a pantsuit. Maybe even worse! PPL didn't listen when Obama was exposed..... Will they listen now about Hillary?????","post_message":"I watched this over and over again to try and figure out what Hillary possibly could have been thinking. I'm still stumped. Like the news anchors reporting on this did, all I could do was laugh... Do you want to see Hillary suffer a resounding loss in 2016?"},{"comment_id":"692289614253147","commenter_b":"Doubt it,he won't say anything different then he has already,he's got a small mind and can't think beyond the paper and crayolas","commenter_a":"No,it's not...after his scripted speech Hillary IS going to have a lot of problems","post_message":"This made my morning. I hope you guys enjoy it as well. ~Natalie"},{"comment_id":"829662497101615","commenter_b":"prizon don't send them back , they will just return and do it again, either way we will be paying tax dollars for them so I would rather do it for them being in jail instead of welfare and what ever else obama is giving them.","commenter_a":"Now take away their real name and give them a number, prison number that is","post_message":"OBAMA’S ILLEGAL ALIENS ARRESTED IN MISSISSIPPI FOR IDENTITY THEFT! #NoAmnesty Just spread this like wildfire Dean James Americas Freedom Fighters"},{"comment_id":"1813669392186653","commenter_b":"I believe the only way to stop 5.O Is to kill em all Or stop bitch in, the popo gotta Gun n they Evil law,,Bt every nigga in the hood can shoot back,so kill em before they kill one u","commenter_a":"America you're gone so far.","post_message":""},{"comment_id":"10152734752671051","commenter_b":"Unbelievable! some women should not children and she is one. Discipline begins at home.","commenter_a":"Needs a good ole fashion spankin.","post_message":"This 11-year-old boy is responsible for a fifth of the crime in his town – and his mother knows exactly who to blame for that."},{"comment_id":"10154086939802994","commenter_b":"I will never shop at cvs again until he is rehired","commenter_a":"Go figure if I was him I would have told him take anything you want this job don't pay enough money it's not worth losing my life over","post_message":"Two men hopped the pharmacy counter and tried to rob the CVS. The manager, a trained Army vet, fought them off and took their weapon from them - but they got away. He was rewarded for protecting the store and people inside...with a pink slip."}]
