[{"comment_id":"10153672228046130","commenter_b":"She's not plus size... She's average!!!!!","commenter_a":"How hilarious.","post_message":"A trailblazing move by Sports Illustrated Swimsuit."},{"comment_id":"10154994816928256","commenter_b":"US tax payers are going to pay for that wall that Trump wants built, no skin off his back, he don't pay taxes. Suckers","commenter_a":"Deficits only matter when Democrats run the show. How long until you learn this very simple truth?","post_message":"Republican leaders would not say how they would prevent the massive project from adding to federal deficits."},{"comment_id":"10153169832344087","commenter_b":"Can you give an educational description of what is a liberal and a conservative","commenter_a":"Maybe he should have gave the same talk to the average liberal they are after all at the same mental stage as a second grader","post_message":"“The congressman chose to give an example of the current situation in Iran, and made some inappropriate comments about ‘Do you know what a nuclear weapon is? Do you know that there are schools that train children your age to be suicide bombers?'' one parent said."},{"comment_id":"833697490010213","commenter_b":"All babies are precious I guess your mother didn't think like you or you wouldn't be here idiot","commenter_a":"How but killing the mother so she can't have anymore kids","post_message":"How many of you would have been aborted under this perverted logic?"},{"comment_id":"593124330856614","commenter_b":"'@username where did she go?","commenter_a":"I hate Donald Trump, but these idiots are playing right into his rhetoric, and not doing anything but acting like thugs.","post_message":"Watch: Protesters set fire to a Donald J. Trump supporter's hat.  Read more about the San Jose assaults here: @webpagelink"},{"comment_id":"10152714612441519","commenter_b":"Go back..","commenter_a":"People have a choice where they want to work. Not enough money offered? Go work for someone else.","post_message":"'$10 an hour? Does Wal-Mart really think this is enough to live on?'"},{"comment_id":"10154543040158812","commenter_b":"Not this woman!!","commenter_a":"Hillary and her husband are as dirty as dirty can be! Can't believe this lying, two faced, arrogant broad is the Democratic nominee for President! Thank you women voters for voting for gender instead of what was best for this Country!","post_message":"An impromptu meeting between President Bill Clinton and the nation's top cop could further undermine Hillary Clinton's efforts to convince voters to place their trust in her, highlighting perhaps her biggest vulnerability. @webpagelink"}]
