[{"comment_id":"807700012661940","commenter_b":"But she did. Shouldn't no one not have to go anywhere because fools can't handle their jobs.","commenter_a":"She should have never went to TX in the first place TX is not place for decent law abiding people as we see what happened to her over a signal change, TX is a rebel state always has been that way, and their federal support for programs should be stopped right away. Any kind of support needs to be stopped and let them people that love that place pay for their own social ills then see how they like that","post_message":"\"How did switching lanes turn into all of this?\""},{"comment_id":"10152911974179071","commenter_b":"I dont think you really listened to his speech. He said they meaning mexicans!! illegals or not he is still refering to the RACE!! Are RAPIST!!! That alone is disgusting to label mexicans that are trying to find a new country.","commenter_a":"He didn't express hatred for Mexicans. He expressed hatred for the illegal immigrant problem Mexico presents the U.S. with. Those are two very, very different subjects.","post_message":"Behold, the Donald J. Trump piñata."},{"comment_id":"1108180832531570","commenter_b":"You need to get out more, specifically a museum.","commenter_a":"Ppl are quick to doubt things like this but believe whatever Fox News tells them. Meanwhile every civilization that recorded their history speak of giants. How can one make up or imagine Giants without being exposed to them or having seen them? Just like they wrote about hybrid races u think they made it up? Nope I think archaeologists (not all) but as a whole cover things up so they can keep getting funded. I don't by into dinosaurs, I think they are the hybrids ancient cultures speak about but hey if a man in a white lab coat says the grass is really blue a third of mankind would eventually start to see blue too. To each Is own tho","post_message":"A team of archaeologists have uncovered the skeletal remains of a giant in the Bulgarian city of Varna. Located on the eastern shores of the Black Sea, Varna is now a major tourist attraction. The area has a rich culture and its history goes all the way back to 5,000 BC. The oldest golden treasure in the world was found during excavations at the Varna Necropolis and carbon dating revealed it was buried more than 6,500 years ago. Thoughts?"},{"comment_id":"10154051789570326","commenter_b":"There ARE alternatives for oil. There is NO alternative for clean water.","commenter_a":"Tell it to the people in Arizona . . . How'd you like this coming out of your tap? @webpagelink","post_message":""},{"comment_id":"10152821064059342","commenter_b":"^ they just don't have enough self control to keep from raping a woman unless shes covered apparently.","commenter_a":"Why do we have a muslim Capitol day?","post_message":"FBI RESPONDING TO MUSLIM CAPITOL DAY THREATS: Organizers say demonstrators are expected to protest against Thursday's rally. A spokesperson said the event began in 2003 and has never drawn opposition before, but this year online threats have prompted the council giving event to contact the FBI."},{"comment_id":"10153842818632483","commenter_b":"The girl ran right up and smacked him.........you go girl !!!","commenter_a":"He needs his nuts cut off and ducked taped in his mouth till he bleeds out.","post_message":"Surveillance footage shows an oak tree at Toomer's Corner being set on fire after Auburn's win over LSU Saturday night. Read more here: @webpagelink"},{"comment_id":"433011990220428","commenter_b":"good hope the NIGGER DIES","commenter_a":"I likt being mean but he hevhe i loveĉit","post_message":"Will he be able to finish his second term?"}]
