[{"comment_id":"10155111433599614","commenter_b":"@username in Oregon not her she stinks hahah","commenter_a":"Jessica @username Davenport what an idiot lol","post_message":"The woman said she tried to get her pet ball python -- \"Bart\" -- out using cooking oil, but that didn't work.  She went to the hospital, where her ear was numbed and stretched even more, freeing Bart.  \"He acted like nothing even happened and was totally chill,\" she said."},{"comment_id":"1637686876527430","commenter_b":"I don't rbecall we doing this Obama some needs to stop this it is un-American to do this not happy leave the country that has let you make millions of dollar from the same people you bash we are sick of all this go cry to Hillary or better sit on her husband lap","commenter_a":"How stupid can they get? Pathetic!!","post_message":"Some celebrities will show up to Trump's inauguration....to protest."},{"comment_id":"10157822759390389","commenter_b":"She is a joke","commenter_a":"Evil woman","post_message":""},{"comment_id":"10153128765639586","commenter_b":"<3","commenter_a":"Jessica Thompson this is why we cut those things!!!","post_message":"ALWAYS CUT YOUR PLASTIC SIX-PACK RINGS.   PETA fieldworkers found this poor feral cat reminding us all how dangerous discarded plastic & other trash can be: @webpagelink   SHARE to remind everyone!"},{"comment_id":"10152933531687434","commenter_b":"Sex is only for straight, married, rich people!","commenter_a":"It's like they WANT teenagers to have babies. No sex ed, no planned parenthood. Since we know abstinence only education does not work, what else can we take from this?","post_message":"“If they’re doing such a great job, why aren’t these things better?” Bobby Jindal asked of Planned Parenthood."},{"comment_id":"10152623544456680","commenter_b":"Yes, I want our economy ran into the ground by having a college drop-out as our president. Said no one. Ever.","commenter_a":"I would rather see him run than Walker! I'm scared of Walker. After what he's done in WI, our economy would be in shambles after one year under him. @webpagelink","post_message":"Jeb Bush isn’t playing well among Republicans, Peggy Noonan writes in a new Wall Street Journal op-ed."},{"comment_id":"10153541203558690","commenter_b":"She's a recovering alcoholic...... That says it all right there","commenter_a":"Living within your means should not mean living in a cardboard box or struggling to pay for minimum needs! What a selfish ignorant thing to suggest! Low wages determine the quality or lack of it in your life, it also means absolute lack of choice!! It absolutely sickens me to read the suggestion that if you are working and struggling it is automatically your own fault! Life happens and not always by our conscious choice! There are many many external influences that can alter your existence negatively! The American dream is a distant illusion for millions of people! In many instances through the greedy manipulation of conglomerates and the loaded banking system! Please don't give me the tired \" think and grow rich \" schemes! I am an old chook, I've known uber wealthy and the other end of poverty throughout my life! Wealth is mostly \" built upon the ...","post_message":"While the debate over minimum wage continues in the US, Emilia Stancati , a 50-year-old who has worked as a waitress for most of her life,  falls further into credit card debt as her  job fails to cover her bills.    Watch the latest episode of Hard Earned:   @webpagelink"}]
