[{"comment_id":"10153425194311336","commenter_b":"Or illegals","commenter_a":"Yeah lets all love each other just not the gays, liberals, and obama woo hoo ....","post_message":"“At heart we really are indivisible.” Megyn Kelly shares why she loves America. Why do you? Tell us using #ProudAmerican! @webpagelink"},{"comment_id":"10153998219462169","commenter_b":"Please email this to every teacher, parent, and administrator in the nation.","commenter_a":"This is garbage! We have nothing left to encourage positive behaviors or discipline!","post_message":"Column: Hey teachers, please stop using behavior charts. Here’s why (From PBS NewsHour)"},{"comment_id":"10154454034611350","commenter_b":"At least they can wear pants other than jeans","commenter_a":"I like the new rule. Ass and tits are not school appropriate.","post_message":"We shouldn't be teaching girls to alter their dress as to not 'distract' the boys.\""},{"comment_id":"460205810854230","commenter_b":"The law should be to only give welfare to an American citizen. Then, take the American abusers off of welfare.","commenter_a":"But not as much as those in government office positions of welfare.","post_message":"The average immigrant household consumes 33% more in cash welfare, 57% more in food assistance, and 44% more in Medicaid, according to a new study by The Center for Immigration Studies."},{"comment_id":"1118758671477300","commenter_b":"Illegal immigration is what Americans are against Trump for president 2016 !!!","commenter_a":"Biden doesn't speak Spanish either. I bet he had a huge crowd","post_message":"Joe Biden went to Mexico on Friday and delivered a clear message: The views of Trump absolutely do not represent the views of most Americans. Do you agree with the VP?"},{"comment_id":"10152570511717212","commenter_b":"Tiu wull be my wife","commenter_a":"He has a wife? And a kid? There is hope for us all! WTF? Freak!","post_message":"A man is in Oklahoma City police custody after a standoff early Friday morning. According to police, the man could be heard yelling about a number of issues including what happened in Ferguson, Missouri, and about his wife and kids."},{"comment_id":"1563613390592441","commenter_b":"fucking bitch","commenter_a":"Let the parents kick the bitch with steel toe shoes in the head","post_message":"This woman should be in jail!"}]
