[{"comment_id":"976274442437807","commenter_b":"I never liked her fake ass!!!","commenter_a":"Yes.","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"10150839207834999","commenter_b":"@Gabrielle Nicole Alvarez By that logic, any psychologist whose job it is to draw such distinctions about attraction is a paedophile and any feminist knowledgeable about different types of abuse is a rapist. @@username hebephilia concerns the early stages of puberty, so ephebophilia, attraction to mid-late teens, might be more fitting.","commenter_a":"And now we wait for the complaining pedophiles...","post_message":"Miss Teen USA is ditching bikinis for athletic wear."},{"comment_id":"10153341904559170","commenter_b":"And why haven't you taken responsibility for your actions?","commenter_a":"And why haven't you solved your people's problems yet, Herm? Too busy slangin pizzas and tap dancing for white folks?","post_message":"Deplorable."},{"comment_id":"1049777781778246","commenter_b":"@username aw did I offend you?, I'll consider your little bitch feelings next time you comment ok. Lmfao pathetic","commenter_a":"Approx 100 million gun owners in US , approx 200 million guns, several trillion rounds of ammo. If us \"white guys\" were the problem, you'd Damned sure know it.","post_message":"Clear as crystal. FOLLOW US at Reverb Press and Stories That Resonate."},{"comment_id":"1154241914613147","commenter_b":"Maybe that dickwad should of been aborted.","commenter_a":"The faux outrage is big with this one. Who gives a crap.","post_message":"“How the hell do you think this joke is OK?”"},{"comment_id":"10153249048488352","commenter_b":"Pure evil heartless bitch","commenter_a":"The same thing should happen to her no doubt about it","post_message":"Texas woman, 26, found guilty of suffocating fiancé's two-year-old daughter to death using duct tape after he broke up with her"},{"comment_id":"10158270376090381","commenter_b":"Wacky Woman!","commenter_a":"Perserverance! Thanks for keeping us strong!","post_message":"Last night, Majority Leader Mitch McConnell attempted to silence not only Senator Elizabeth Warren, but the late Coretta Scott King. It was a shameful attempt to stifle the thorough debate on President Trump’s nominees that the American people expect and deserve. I applaud Senator Warren and my Democratic colleagues in the Senate for fighting on behalf of the millions of Americans who have demanded that the next U.S. Attorney General be committed to upholding our most fundamental constitutional rights. In the battles to come, both in Washington and in communities nationwide, I urge my colleagues to follow Senator Warren’s lead—as she persisted last night, so must we. We do not have the right to remain silent."}]
