[{"comment_id":"1302575163172066","commenter_b":"@username and why isn't Hillary in jail right now? Oh yeah, dirty politics.","commenter_a":"He's a fraud. Last night he said he would (be able to) release his tax returns if Hillary released the emails. So according to Trumb...HE CAN RELEASE HIS TAX RETURNS IF HE WANTS Period","post_message":"“If not paying taxes makes him 'smart,' what does that make all the rest of us?”  - Hillary Clinton"},{"comment_id":"507758516015518","commenter_b":"She is illegal","commenter_a":"@username 2016!!! LETS PUT THIS BEAUTIFUL LADY IN THE WHITE HOUSE!!!","post_message":"Very proud of our next First Lady Melania Trump! #MakeAmericaSafeAgain"},{"comment_id":"10155107351709062","commenter_b":"Grow a uterus then be concerned with this issue.","commenter_a":"The baby killers' excuses are absurd. They claim women's health concerns, yet having access to a sanitary hospital is unfair. And, it it's about health, how does killing a baby make them healthier???? Wouldn't keeping their legs closed keep the baby healthier??!","post_message":"Davis led an 11-hour filibuster of the restrictive legislation."},{"comment_id":"10153127374764753","commenter_b":"Pig drug whore doesnt deserve kids","commenter_a":"And I feel like a bad parent because of my mountain of dirty laundry... some people don't deserve children!","post_message":"Kodi Faircloth, though she may look quit a bit older, is only 38 and already the mom of 12 kids with another on the way. But it’s a safe bet that this Tulsa, Oklahoma, woman won’t be winning any Mom Of The Year awards anytime soon — not after what police report that they found in her home last Thursday."},{"comment_id":"1410976518925134","commenter_b":"like dying in the sea coming from Europe to steal Mexican and Native American land?","commenter_a":"I wish people would realize this is actually happening and innocent people are losing their lives! of course under ignorant trump supporters everyone is Mexican","post_message":"Donald J. Trump is already deporting people to Mexico  even if they're not Mexican."},{"comment_id":"10153435939769087","commenter_b":"@username Sorry you feel that way. She'll cheat and lie to you also.","commenter_a":"Who cares anymore what Bill Clinton has to say? He has no influence anymore. Why doesn't Bill & Hillary Clinton follow the law? why are they exempt from following the law?","post_message":"\"It's important that we not be chumps when we decide what security provisions should be employed to check people's background,\" former President Bill Clinton said. \"America is a place that welcomes all people who are willing to treat people the way they want to be treated, willing to follow the law, willing to create a common community.\""},{"comment_id":"10153602244842894","commenter_b":"It's a lot of women who are really Jr.","commenter_a":"Ok, so she doesn't mind showing her man's good...That is indeed a fools game but ok. I am really trying to wrap my mind around how the baby girl is a JR. should I not be distracted by that?","post_message":"Oh My! Teyana Taylor Shares Snaps of Iman Shumpert Holding Baby Iman Jr, But His Big Ol’ Bulge Steals the Show [Photos]"}]
