[{"comment_id":"543124655889625","commenter_b":"How much more money does she need ??!!!!!!!!??","commenter_a":"Is this really Hillary Clinton? @webpagelink","post_message":"This is truly shocking..."},{"comment_id":"10153594349921162","commenter_b":"Yolo","commenter_a":"Cesar Orozco @username @username","post_message":"Tomorrow could be the hottest day in nearly 2 years - if we reach 93!"},{"comment_id":"1078041262207343","commenter_b":"Fire her now!","commenter_a":"Mandamus?","post_message":"She took an oath. And the oath didn't say: \"I will uphold the parts of the Constitution that I agree with and ignore the rest\""},{"comment_id":"942171079182981","commenter_b":"Pussy","commenter_a":"Looks like a Bitch fight","post_message":"Slam City #Fight In The Park!   One Of The Fights In Last Months Fight Comp!  To submit content for our Upcoming #FightComp download the Worldstar App in the App store goo.gl/CnyR5l and access our brand new camera feature!"},{"comment_id":"10154298505504411","commenter_b":"stfu goat lover","commenter_a":"Go police go, do not let bastards ruin the day!","post_message":"Police deployed tear gas to disperse some particularly hostile demonstrators"},{"comment_id":"10153598743328984","commenter_b":"We need a MUCH STRONGER policy for Illegals. These two should be Executed then they will not sneak back in the Country!","commenter_a":"Her family should sue the dept. Of immigration!","post_message":"While this 41-year-old grandmother and nurse slept in bed, she was tragically robbed of ever waking up. Our thoughts and prayers are with her family.   Do you think more needs to be done in the U.S. to prevent this from happening?"},{"comment_id":"1702389236690262","commenter_b":"#NRAWhore","commenter_a":"Screaming about process that eliminates the ability to make progress is criminal.","post_message":"The sit-in by House Democrats is nothing more than a publicity stunt. The bill they're talking about was already defeated in the United States Senate. It's time for them to #StopTheStunt."}]
