[{"comment_id":"10153223186871336","commenter_b":"Lol @username it wouldn't be America without us it would still be Native American land Indian land you call crazy and aliens would still be over in Europe living without sign in famine","commenter_a":"Actually 52-0 if you count all the woman beatings and cheap shots outside of the ring.","post_message":"ICYMI: Floyd Mayweather piled up enough points against Manny Pacquiao to win by unanimous decision in their welterweight title bout last night. Mayweather extended his win record to 48-0, cementing his legacy as the best of his generation."},{"comment_id":"10153987793981320","commenter_b":"She is such a bimbo","commenter_a":"They have to be kidding! She is a joke! Tina Fey would do a better job!","post_message":"Sarah Palin has officially endorsed Donald Trump for President, but does it matter? Thoughts?"},{"comment_id":"10153945606794060","commenter_b":"Shut up!","commenter_a":"Turkey is the gateway for Islamists to enter Europe and the birthplace of fascism.","post_message":"For the Turkish nation Turkishness goes beyond nationality. But some citizens consider themselves more Turkish than others"},{"comment_id":"10153025578804753","commenter_b":"Which one are you Dave... The chick in the skirt..?","commenter_a":"Cowardly cops should go find work at the library..!","post_message":"Police said the man instead charged at the officer, who retreated behind his patrol car while giving numerous commands for the suspect to drop the rock. The man raised the rock to strike the officer, so the officer fired his weapon 3 times to prevent the suspect from striking him. According to a police statement, the officer, “used deadly force against deadly force”"},{"comment_id":"889757574548152","commenter_b":"Bye bye bitch","commenter_a":"When","post_message":"Rosie O'Donnell's worst nightmare just came to fruition. Good riddance, get her out of the country asap. Can we get 20,000 'LIKES' to get Rosie out now!"},{"comment_id":"1238359136216847","commenter_b":"Ah shut up!!!","commenter_a":"Ding- Dong.","post_message":"Come again??"},{"comment_id":"10152772722763445","commenter_b":"Stfu","commenter_a":"Pot kills","post_message":"What are you paying for your stash and how do they compare? Pot Prices: December 2014 THMQ."}]
