[{"comment_id":"1322891364416984","commenter_b":"Yes, Hillary should go to jail IMMEDIATELY!!!!!","commenter_a":"I am not voting for Hillary Clinton.","post_message":"CORRUPTION IS INSANE.  Americans getting screwed.    @webpagelink"},{"comment_id":"1239847632704451","commenter_b":"Hillary is the Unindicted Felon!","commenter_a":"That is exactly what pisses me off the most, to see the wealthy paying zero taxes! I pay taxes so I make my contribution to our government just like millions of Americans do! It sucks, really sucks! And then to say it is smart not to pay taxes on National TV? That is an insult to the American people! Bragging about it makes me think that those who support this clown have something wrong in their heads, period! Is this the kind of Commander in Chief we want?","post_message":"There it is, folks!"},{"comment_id":"1392014810811452","commenter_b":"That is so inspiring.","commenter_a":" I despair, I remember that all through history the way of truth and love have always won. There have been tyrants and murderers, and for a time, they can seem invincible, but in the end, they always fall. Think of it--always. Mahatma Gandhi","post_message":"Just when you thought it couldn't get any worse!"},{"comment_id":"1202081159878082","commenter_b":"Good one! Except I hope SHE would HAVE BEEN ABORTED LONG BEFORE NOW!","commenter_a":"So, I am reading that Hillary is really upset that the FBI is \"dumping\" on her right before the election.... I want to say to Mrs. Clinton, \"So Hillary, how does it feel to be aborted 8 days before delivery?\" Stole that comment, but it is awesome!","post_message":"The website announces it has moved to \"Phase 3\" of its \"election coverage.\" Here are the latest headlines. #WikiLeaks #Clinton"},{"comment_id":"10154635398261037","commenter_b":"To impregnate your mom? Yes.","commenter_a":"And she'll be knocked up again within the month","post_message":"Panna Krom, now 26, was convicted at 17 of killing her newborn in a toilet to hide the pregnancy from her parents."},{"comment_id":"10155791972890725","commenter_b":"STFU","commenter_a":"and a lot of people blame the police in one out of five hundred killings. what happen to hope and change under obama?","post_message":"Police say the victim, identified as Vonzell Banks, was likely not the intended target ----> @webpagelink"},{"comment_id":"10153514086261955","commenter_b":"Still trying to jump that fence huh? @username ...better hurry before that Trump wall gets built.","commenter_a":"It's not that hard to figure out why Trump is doing so well. People are so tired of politically correct politicians.","post_message":"Pollsters dumbfounded by Trump..."}]
