[{"comment_id":"698823633563273","commenter_b":"Well then stop her. Isn't that your job?","commenter_a":"Yes a female Eric Holder,","post_message":"GOP leadership should stop the Loretta Lynch nomination by not reporting it to the floor for a vote. We must reject lawlessness, outright."},{"comment_id":"849701391772757","commenter_b":"No more Somalis","commenter_a":"Part of barack islama's let everybody from any country come in when they want. No bg checks.","post_message":""},{"comment_id":"1332403530152725","commenter_b":"Beautiful doggies on your page","commenter_a":"Yeah and her third set of boobs.","post_message":"She only be 18...but Kylie Jenner is onto her second mansion"},{"comment_id":"10153266875433010","commenter_b":"Except for leaving him to near starve and die for 66 days","commenter_a":"God is good all the time... :-)","post_message":"His family reported him lost at sea 66 days ago. He said he survived by rationing his food and drinking rainwater.  “...everyday I was like, 'Please God, send me some rain, send me some water.'\""},{"comment_id":"10153467696365736","commenter_b":"This is Florida were talking about... the question of \"Consent\" is irrelevant. As the boys will simply plead that they were standing their ground!","commenter_a":"If you can't \"consent \" to having sex with an older person, you should not be able to consent to sex trafficking...","post_message":"The 15-year-old girl was a sex trafficking victim for two years, her mother says. At issue is whether she was capable of consent."},{"comment_id":"10153428324682293","commenter_b":"Yes but she identify as female sexually fluid","commenter_a":"My daughter is sexually fluid, she identified herself as a lesbian during high school years and she wasn't allowed to have girls sleep over ( unless they were childhood friends), my other two daughters were not allowed to have teenager males sleeping over.","post_message":"\"I wouldn’t have dared bring a boy into my room while I was in high school. Do the same house rules apply to same-sex relationships?\""},{"comment_id":"10153273876007377","commenter_b":"Lady!!1 It's Jail time !!!","commenter_a":"She is a LIAR and TRAITOR.","post_message":"This is a clear violation of federal law that has put these agents in harm's way."}]
