[{"comment_id":"10158362932045500","commenter_b":"Her water didn't break yet","commenter_a":"Her water did not break","post_message":"BABY WATCH (10am update): Still no baby giraffe yet! When do you think mom April will give birth at Animal Adventure Park? Don't miss anything: @webpagelink"},{"comment_id":"10154018738645736","commenter_b":"Isn't that gorgeous.","commenter_a":"We need some housing Kate Brown.","post_message":"People are still flocking to the Beaver State."},{"comment_id":"10150772965449999","commenter_b":"She's going to wear the same shoes every day forever? What if her feet keep changing?","commenter_a":"If you paid $1000 for shoes you will have the rest of your life, you got a bargain. If you hadn't you would have spent more on shoes that didn't fit, hurt, were too high, and you wouldn't wear them. Not extravagant at all; I would say it was smart shopping.","post_message":"\"I know I am going to take a lot of heat for what I am about to tell you, but I just spent almost $1,000 for a pair of custom shoes.\""},{"comment_id":"880526405340442","commenter_b":"Muslims bullying their way into power.","commenter_a":"Get your FREE money making website. No Investment Ever Earn and save on everything... loans, cars, insurance, merchandise, vitamins, hosting almost anything you can imagine, No Investment Required... EVER. @webpagelink","post_message":"The public was allegedly told 'not voting for him was sinful and un-Islamic'"},{"comment_id":"10153903960665329","commenter_b":"Wtf!!! She don't play","commenter_a":"This is hilarious. @username Maria Maldonado","post_message":"#goals"},{"comment_id":"10156244248180354","commenter_b":"Stop importing the pigs and it wont be","commenter_a":"Learn English","post_message":"Obama's New America..."},{"comment_id":"10152884212556636","commenter_b":"I'm just waiting for the first comment to blame the feminazi conspiracy to neuter us poor downtrodden beta males...","commenter_a":"That would be defined as sexist. People are supposed to be interviewed based on experience, education,","post_message":"'Can you wear more make up next time?'..."}]
