[{"comment_id":"10153150465564255","commenter_b":"Because man created god in his image and saw that it was good.","commenter_a":"well one thing it never said JESUS was ethiopian and he was born in bethleham so Jesus 90% chance was not black but i do not see why it makes a difference","post_message":"Why do churches use a historically inaccurate image?"},{"comment_id":"1263484480357673","commenter_b":"He emptied out gitmo... FOR himself and KILLARY.... Good IDEA!!!!! NOW JUST go.... YOU horrible DISGUSTING TRAITOR!!!! Plant.... Unlock the docs.... Barry is a CRIMINAL!!!!!","commenter_a":"Their plan is working. Next up, single payer govt. system.","post_message":"IMPLOSION.  Carriers dropping out.  Rates skyrocketing.  UPDATE:  @webpagelink"},{"comment_id":"1405973546081315","commenter_b":"Trump by a Landslide","commenter_a":"and the subsidy goes up so the real cost is less. The cost of healthcare is going up for everybody for 25 yr and every yr so whats new here","post_message":"First, we were told we could keep our doctors, but that was a lie and now we discover that premiums will rise 25%..."},{"comment_id":"936091029833983","commenter_b":"Shut up LIBTARDS","commenter_a":"Trump 2016.","post_message":"We have a message for Donald J. Trump: We're going to do everything we can to make sure you never become president. Sign this letter if you agree: hrc.io/2aaJYl5"},{"comment_id":"590662824455343","commenter_b":"This article is a joke. She is telling girls in a country where they are oppressed to believe in themselves. It has nothing to do with hating America or race.","commenter_a":"Get out if you don't like it, and keep your racist mouth shut, you and your husband have been nothing but a thorn in Americas side, glad your done not soon enough.","post_message":""},{"comment_id":"10153000542416336","commenter_b":"tHE aTHEIS GROUP NEEDS TO STOP MAKING TROUBLE. IF THEY DON'T LIKE ANGELS ON THE MEMORIAL MOVE ON WE SURE DON;T WANT YOU.","commenter_a":"What about a Christians First Amendment rights?????? I am so sick of all this...","post_message":"An atheist group wants angels removed from a teacher's memorial, claiming its presence on public grounds violates the First Amendment."},{"comment_id":"958471064269672","commenter_b":"BUT.... FOR ANY SMALL REASON SHE CAN GETS SHARIA LAW...... NO BAD TO TRY...!!!","commenter_a":"Lindsey! Remember no smoking no alcohol no pork prayer 5 times each day etc. However there will be more than enough sex and just think you will replace several goats! This will make you very popular with peta!!!!!😎","post_message":"Dear Lindsay: Pay particular attention to the anti-women bashing bits and ... then smoke a cigarette and meditate whether or not you really wanna to convert. @webpagelink"}]
