[{"comment_id":"10153711190119411","commenter_b":"Put them on big boats & send them too the U.S. !! Time for the yanks & Jews too clean up there mess they created !!","commenter_a":"They are provided with bins and skips in most places, yet they just throw their shit everywhere. Dirty pigs","post_message":"NIMBY-syndrome grips little-mittel-Europeans"},{"comment_id":"10153210442256336","commenter_b":"Good!! Put that b!tch in jail....","commenter_a":"Were they on Hillary Clinton's server?","post_message":"A Treasury Department watchdog has recovered roughly 6,400 emails from Lois Lerner and turned them over to Congress – reviving the investigation into the IRS targeting of conservative groups."},{"comment_id":"1778494812377732","commenter_b":"@username, so your point will be valid according to the justifications of the San Bernardino and Paris Massacre victims and their families? How much more American people must die before you realize even 1 terrorist is unacceptable for the sacrifice of our lives just to be nice to foreigners?","commenter_a":"Does anyone remember FDR's ban on Japanese and Jimmy Carter's ban on Iranians? Oh, and they were both Democrats, but Trump is being compared to Hitler for suggesting we ban Muslims. Funny how that works.","post_message":"Skyscrapers. Music. Athletics. Comedy. The list goes on and on ... After Donald J. Trump's recent controversial remarks, here's a look at the United States without the influences of Muslims."},{"comment_id":"1002365369819992","commenter_b":"Then why did she have a professional IT tech wipe it?","commenter_a":"The cat is out of the bag. Now they can give up the untrustworthy propaganda about Hillary.. We all know who America can't trust- Republicans","post_message":"Tomorrow, Hillary will testify in front of the House Select Committee on Benghazi. She’ll answer their questions, remember the brave Americans lost in the attack, and outline the need for our country's continued leadership abroad. Let her know you’re with her by sharing this. hrc.io/WithHer"},{"comment_id":"10154015266906028","commenter_b":"Clearly you have ignored the riots that occur when sports teams win. Those are primarily white. It's incredibly difficult to understand any point you're trying to make, simply because you make no sense. @webpagelink","commenter_a":"Cops die on a daily basis stopping crime and just because there is some bad cops you assume all of them are bad ? What are you doing San Francisco 49ers Colin Kaepernick what are you doing to keep people safe or stopping crime ?","post_message":"After some fans took to social media to burn the jersey of the embattled quarterback because he refused to stand during the national anthem, photos of Colin Kaepernick's socks have surfaced and riled people up again. @webpagelink"},{"comment_id":"10154497779774166","commenter_b":"My son. 3 at the time but 6 now, snuck out at 8am to play in the yard and went through child proof knob, door lock and deadbolt. And i was arrested and given a felony for child neglect... Judge here raised voice at me when i told her kids arent dumb. That mine is super smart. And sent me to jail/: now my ptsd is so bad i barely sleep since the day. Because im afraid he'll sneak out again.","commenter_a":"Was he pulled over for \"drunken milk driving\"? LOL! On the serious side, glad he was okay! My children were escape artists when they were younger. Have a toddler now and with having her older siblings around, she doesn't attempt anything like this. She's opened the front door before, but never left the apartment. We used alarms on the front door. Working third shift and having a toddler is hard LOL! But during the week she's at daycare so no worries there... Just worry on weekends when they're home with me.","post_message":"Deputies say the child was found driving down the road wearing only jogging pants and a diaper around 1:55 a.m. Sunday."},{"comment_id":"10153713540778984","commenter_b":"Chicago and Detroit have been run by democrats for years , as is california. This welfare state is all about staying in power, so is illegal immigration. The end result is bankruptcy, the next result Greece .","commenter_a":"If you're not disabled you need to work! HAVING CHILDREN IS NOT A DISABILITY! BEING A DRUG ADDICT IS NOT A DISABILITY!","post_message":"Wow. The welfare abusers about about to get some VERY bad news... they didn't see this coming. It's about time the cheating and the fraud got shut down... this needs to happen EVERYWHERE."}]
