[{"comment_id":"10153070562531051","commenter_b":"She needs to be put in a hospital were criminals go. They need to put all the weirdos on a dam island somewhere.","commenter_a":"THere has to be a way to trace the video, find this woman and make her pay for this horrible murder of an innocent dog. Nothing could be gained by this act and the woman needs to be stopped before she kills again.","post_message":"First she tied the dog up. Then she took out her blowtorch."},{"comment_id":"937869812915107","commenter_b":"I hope they suspend her license and hope the liar loses her job!","commenter_a":"She should loose her job & be required to stand on corner with sign showing what she is","post_message":"Our favorite ‘just deserts’ of the week!"},{"comment_id":"10156654458470725","commenter_b":"Hoe","commenter_a":"Let me tell you WHY I AM voting for Trump. I've received a few boo's for my stance on Trump and I just have to say this so I hope you will take just a moment and read it to the end. And I say this as no response with no judgement or ill will toward anyone. I understand there are many who feel Trump's brashness doesn't qualify him for office. I agree he does need some polishing in some of his mannerisms. However, God willing, I will vote for him because this country is so far gone now and into the sewer so DEEP that I doubt there is much that will help it recover. That is why I feel more strongly about this now than perhaps ever in my lifetime that we M-U-S-T elect a strong, no-nonsense, straight-shooter with a BACKBONE OF STEEL who will stand up for ...","post_message":"realdonaldtrump is the first presidential candidate in 2016 to reach 1MM Instagram followers. Follow: @webpagelink/ for behind the scenes footage from the campaign trail! #TrumpTrain #Trump2016"},{"comment_id":"10154062164657042","commenter_b":"Let's dip her legs","commenter_a":"Poor baby,, how can she be such a horrible person,, well prison will be her first hell, then when she die, her other REAL HELL IS WAITING FOR HER,, she have no place in heaven .","post_message":"A child has died after his stepmother dipped his legs into scalding hot water."},{"comment_id":"10153011056587169","commenter_b":"The go to feminist lie: blame it on \"Patriarchy\"","commenter_a":"I want all my kids to be powerful, my sons and my daughters","post_message":"How do you raise a powerful girl and what does that mean? PBS Parents experts share their thoughts:"},{"comment_id":"10153535673013352","commenter_b":"Rosey got no pics cuz she is a big fat pig","commenter_a":"Ape in the house","post_message":"The squatter from hell: Woman ‘moves into $800,000 Martha’s Vineyard vacation home and sells the owner’s possessions in a yard sale’"},{"comment_id":"10153304280001051","commenter_b":"She is a fence jumper!!!","commenter_a":"I approve he's the best President we ever had I love America !!!","post_message":"Simple question: Do you approve or disapprove of the job President Obama is doing in office?"}]
