[{"comment_id":"1937711623123134","commenter_b":"If Clinton is chosen over Trump, there will be a howl in the land like never heard before.....the fix would be in for the political elite and the upper 1%","commenter_a":"OMG. It's over. Get on with life.","post_message":"In Opinion, Harvard professor Lawrence Lessig says there is precedent for such a move."},{"comment_id":"10154378235307061","commenter_b":"ironic since even king himself thought malcolm x was a hack","commenter_a":"I am a white man, but it seems to me that Islam provided to Afro-Americans a system of faith and structure that Christianity failed to do. These people took names of Islamic heroes, rather than the surnames of their owners. Muhammad Ali took stature when he changed his name from Cassius (Roman name) Clay (ancestor white owner?). In America we stand up for who are and what we believe to be right.","post_message":"Malcolm X was killed on this day 52 years ago. @webpagelink"},{"comment_id":"1335655576501194","commenter_b":"Omg this little girl does need someone to beat her ass. Khloe can do it lol","commenter_a":"This lil girl is trash shame on her people need to stop giving her 5 minutes of fame","post_message":"She's calling out Kylie Jenner!  #WSHH #CatchMeOutside #KylieJenner"},{"comment_id":"952385434796916","commenter_b":"You are the disease you inbred fuck","commenter_a":"Abortion is a personal choice, you can't ban it from everyone just because your shitty religion doesn't like it","post_message":"You'll want to pay attention to this one."},{"comment_id":"558350940997625","commenter_b":"TRUMP 16 the rest are weak ! Non presidential . The to Cubans will open our borders to Cuba Canada and Mexico because there parents were illegals also . Period","commenter_a":"Donald J. Trump 2016","post_message":"\"...a man who has a multi-decade history of exploiting the immigration laws to take advantage of the little guy is not someone we can trust to stand with the working men and women of this country.\""},{"comment_id":"10153170103931770","commenter_b":"She's improved at lying ! And she makes Barb not feel like such a hag.","commenter_a":"Crap","post_message":"Barbra Streisand said she thinks Hillary Clinton's campaign strategies have improved a lot over the last few months."},{"comment_id":"10153965474855579","commenter_b":"Oppose...no refugees, period.","commenter_a":"TAKE A LONG PAUSE.","post_message":"Syrian Refugee Program: Your Message to Congress? Support, Oppose or Take a Pause?"}]
