[{"comment_id":"10153042151741680","commenter_b":"Aww, she don't like jail, maybe , I love being able to use this line right now, maybe if she wouldn't break the law, she wouldn't be in jail. Isn't that the line republicans always use.","commenter_a":"Davis is being duped by her attorney. As long as she refuses neither to resign her office nor to do her job, her attorney is the only person who's winning. She is a pawn.","post_message":"The controversy swirling around Kentucky county clerk Kim Davis is not letting up."},{"comment_id":"1831610420459597","commenter_b":"This woman is a lunatic.","commenter_a":"Just when I thought no-one could possibly be worse than Trump..","post_message":"Forget that Donald J. Trump is accused of sexual assault...and that President Bill Clinton is not on the ballot."},{"comment_id":"10154598591011756","commenter_b":"Ooh never heard that one...sweet","commenter_a":"Yes, I'm sure the Trump children know all about working. What's that saying? Born on third and think they hit a triple.","post_message":"The theme of day two of the Republican National Convention is \"Make America Work Again,\" with speakers ranging from House Speaker Paul Ryan to Tiffany Trump and Donald Trump Jr."},{"comment_id":"540716409449985","commenter_b":"they screwed up their country, and all they want is to screw up the rest of the countries","commenter_a":"Hell No !","post_message":"COMING SOON in your city and town..."},{"comment_id":"1330832217009829","commenter_b":"Madoff needs a roomie.","commenter_a":"Lying sack of ----.","post_message":""},{"comment_id":"685959174927994","commenter_b":"No!!! Piss off bitch!!!","commenter_a":"Absolutely not , you moved to America to benefit from American ways of life and you're participating in the American justice system , and you expect to be changed just for you . I don't think so . You shouldn't even be allowed into the court house let alone the court room for reasons of security .","post_message":"This judge just made a controversial decision... Great. We support this judge 100%. Should this woman be allowed to swear on the Quran?"},{"comment_id":"479766112213969","commenter_b":"Oh that is too funny she claims her life is harder than soldier that bitch don't have a clue","commenter_a":"and they have no vaction poor baby michelle","post_message":"Michelle Obama just made an outrageous claim... Our soldiers fight and die for our country, Michelle takes lavish vacations. Do you respect our veterans over Michelle?"}]
