[{"comment_id":"992775434136459","commenter_b":"That is all these losers have.","commenter_a":"Screw that ignorant pido, GO TRUMP GO","post_message":"Here are the 6 TWEETS..."},{"comment_id":"10153860204493598","commenter_b":"She probably has no problem selling those little body parts.I wonder how those people will answer God when they stand before Him!","commenter_a":"More like satan","post_message":"Wendy Davis is Dedicated to Promoting Abortions With God’s Help: “By God, We Get Back Up”"},{"comment_id":"10156025741310354","commenter_b":"Go educate yourself, ALEX! The Constitution does not need revision to deny citizenship to illegal aliens, or their children. It is left vague in our founding document and is clarified by statute. The 14th Amendment defines citizenship this way: \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.\" But even this does not get specific enough. As usual, the Constitution provides the framework for the law, but it is the law that fills in the gaps. The Constitution authorizes the Congress to do create clarifying legislation in Section 5 of the 14th Amendment; the Constitution, in Article 1, Section 8, Clause 4, also allows the Congress to create law regarding naturalization, which includes citizenship. Currently, Title 8 of the U.S. Code fills in the gaps left by the Constitution. Section 1401 ...","commenter_a":"In my opinion all the RINOs currently in office as well as the few Republicans who haven't yet achieved RINO are crapping their pants because Trump is saying what the public is thinking. Plus, Trump could give a rat's ass about what the Democrat media formerly known as the \"mainstream media\" says about him.","post_message":"Top Republican Strategist Promises a 'Cleansing' of Donald Trump Voters from the GOP!"},{"comment_id":"524012904454471","commenter_b":"Like fuck she will. We need to get so fucking loud they hear us in China. WE DON'T WANT ANYMORE OF THESE SOULLESS SHITHEADS IN OUR COUNTRY. This all part of the goatloverocrats plan to divide us more. We have got to stop this.","commenter_a":"We should have them settle right next door to her house in upstate NY","post_message":"Voters are outraged by this.  How does this benefit and protect Americans?"},{"comment_id":"10153148829377235","commenter_b":"Sure she doesn't work for FOX? Oh same difference, WSJ/FOX. I got confused there for minute her hair is yellow instead of blond. I guess that's why Murdoch doesn't have her on FOX, put some peroxide on that hair and Murdoch will make you a star! You too can be another FOX bimbo, if your legs are nice enough along with your cleavage.","commenter_a":"Oh my gosh ... it is so shocking to listen time and time to this rampant, severe stupidity.","post_message":"How dare Barack Obama talk about the suppression of minorities at an event showcasing the suppression of minorities!"},{"comment_id":"10152950589906051","commenter_b":"Let's throw her away with out anything too hope she go to hell","commenter_a":"This is true evil!","post_message":"Even the police were a little surprised that someone could be so cruel for no reason."},{"comment_id":"10152854045581749","commenter_b":"Yeah. ..not so much","commenter_a":"Dear President Mr. Obama May God Bless you And your family.","post_message":"\"I believe Americans are tired of the political back and forth. People want to see an agenda that moves us all forward.\" —President Obama  Read the President's latest message to OFA supporters: @webpagelink"}]
