[{"comment_id":"859635514085473","commenter_b":"Go home ma","commenter_a":"If she is going to run like a man then she should not be treated any differently than a man would be.","post_message":"After laying out plans to 'run as a woman,' Hillary Clinton is outraged at a Republican for bringing it up"},{"comment_id":"10153042151741680","commenter_b":"Aww, she don't like jail, maybe , I love being able to use this line right now, maybe if she wouldn't break the law, she wouldn't be in jail. Isn't that the line republicans always use.","commenter_a":"Davis is being duped by her attorney. As long as she refuses neither to resign her office nor to do her job, her attorney is the only person who's winning. She is a pawn.","post_message":"The controversy swirling around Kentucky county clerk Kim Davis is not letting up."},{"comment_id":"10153104771426051","commenter_b":"That woman is whack a doodle!","commenter_a":"Get a real life.","post_message":"This mom took one look at her daughter's Christening cake and immediately demanded an apology from the cake shop."},{"comment_id":"918831531585696","commenter_b":"Abd the dems preach tolerance but are hnwilling to be tolerant.","commenter_a":"Democrat,s = cult being lead by a zombie . Set devour America","post_message":"Just in..."},{"comment_id":"10154141594486509","commenter_b":"I can't stand Sanders grating voice and Hillary puts me to sleep O'Malley's obnoxious Thank God NCIS is on at 8.","commenter_a":"I wonder if @username will ambush Clinton, like FOX ambushed Trump.","post_message":"Classroom lecture vs. rock concert: Just how different are Bernie Sanders and Hillary Clinton campaign styles? #DemDebate @webpagelink"},{"comment_id":"495130020646953","commenter_b":"So work overtime so you can afford your eggs. Whining like a menstruating bitch with sand in her vagina isn't going to improve the situation.","commenter_a":"Fuck you MCdickbags watch egg inflation. Then this will make natural farm raised local eggs like $25 a carton","post_message":"McDonald's currently uses around 4 percent of all the eggs produced in the United States each year, around 2 billion eggs total."},{"comment_id":"10154200201311636","commenter_b":"I don't understand how she can even show her face in public after what she's done to Germany. Which in turn has had a negative impact on the rest of Europe. They should ship her out of the country along with all her precious illegal migrants.","commenter_a":"Thats good news for the AFD party..... No German wants to see this puppet!","post_message":"More follows"}]
