[{"comment_id":"954102247963967","commenter_b":"Yes women! Stay home! In the kitchen!","commenter_a":"Feed your kids before you go out in public......","post_message":"Talk about a great response from the mom. (via TakePart.com)"},{"comment_id":"10153728493184203","commenter_b":"No average, healthy adult woman should really be under 100 pounds!!","commenter_a":"What is their definition of fat?","post_message":"Body-shaming."},{"comment_id":"1632165196804485","commenter_b":"@username how are we snowflakes if we don't want to hear the opinion of some feminist being sad about a pipeline when there are thousands already in this country. To the other side of the wall for you.","commenter_a":"Unfollow.","post_message":":("},{"comment_id":"10154383170579877","commenter_b":"Right","commenter_a":"He didn't become \"more racist\", he already was. Trump just brought out their TRUE COLORS throughout his campaign. Big difference.","post_message":"This woman claims her ex became a \"monster\" during Trump's campaign."},{"comment_id":"10154325852416323","commenter_b":"The woman is a perpetually grinning dimwit. She'll probably become PM.","commenter_a":"Fucking moron","post_message":"\"At least 50% of her public statements sound as if they were said for a dare. 'Let’s banish pessimists.' 'Boris Johnson is a lovely man.' The rest sound like she’s assembling endtimes magnetic fridge poetry.\""},{"comment_id":"10157272858800389","commenter_b":"This is very inappropriate. It is not the job of Ginsburg to comment on any of the political constituents, democrat or republican. Her job is to interpret the law only and she is way out of bounds in this matter. If she wants to leave the country somebody would have to nudge her and wake her up because every time she is seen on tv she is either falling asleep or looking like she just woke up. It is way past the time for her to retire.","commenter_a":"This old prune needs to retire. She can't even stay awake. She's hateful!","post_message":""},{"comment_id":"10153265757247061","commenter_b":"No, he was too busy lighting our disgraced white house Christmas tree.","commenter_a":"If you have no interest in hearing President Obama, why comment? I'm sure he's not reading your negative comments. He's much too busy and has other more important things to focus on, unlike you, who clearly have too much time on your hands!","post_message":"BREAKING: President Barack Obama to address the nation from the Oval Office on Sunday night at 8pm ET, White House says. @webpagelink"}]
