[{"comment_id":"1031074676904002","commenter_b":"girls get u a 357 they will stop","commenter_a":"just waiting for the ruling that guns are people too","post_message":"This is gross -->"},{"comment_id":"1197826636921341","commenter_b":"Yeah. Pointing out the extremely horrifying problems of a crime filled cesspool part of a city and a counter culture no one is allowed to talk about unless theyre approved by liberals first is totes narcissistic. Gtfo.","commenter_a":"He wasn't making it about him, he was saying this will stop! They twist everything!","post_message":"\"Glad you’re not making this about you. Whew!”"},{"comment_id":"550965321772492","commenter_b":"@username I think there's more chance of a war with Clinton. She's voted for a couple already and seems intent on aggregating Russia with unfounded accusations.","commenter_a":"The Clintons always try to \"cover their tracks\" because their corruption is so deep. And they make sure they have info on others who can be manipulated via blackmail at a later date to further the Clinton agenda. PRISON is where they deserve to be!!","post_message":"This is worrisome..."},{"comment_id":"10153509361000796","commenter_b":"GO GTFOH get GONE. WE don't want you !!!!","commenter_a":"A lot of \"thinking\" republicans are going to switch to hillary to keep him out of office... they feel she will be far less dangerous and damaging...","post_message":"Across the country, Republicans are coming to terms with presumptive presidential nominee Donald Trump, and prominent Maine party members began to rally around him yesterday after his last two challengers, Texas Sen. Ted Cruz and Ohio Gov. John Kasich, dropped out."},{"comment_id":"10157044490065093","commenter_b":"The only con-artist is Hillary!","commenter_a":"Wow. You work so hard to justify your position. What a word smith. What's your answer. Third party's ? Just how would that work? How would you fix it. You complain but you don't have any idea of merit to beat Clinton except trumps is wrong. A lot of us know he is a jerk and all the other adjectives. But unfortunately in life we have to make unsatisfactory choices when there are no other options. We have no other options except staying home and electing Clinton.","post_message":"\"I'm talking about his core supporters, the people who didn just enthusiastically buy his con, they helped sell it to the rest of us.\" -- David French"},{"comment_id":"362582817419205","commenter_b":"They are terrified because of the media's misinformation. They blow the slightest remark out of proportion. He wants to expand on a wall that's already there. And the country has been deporting illegals the whole damn time. LGBT will continue to have their rights. And the so called race war is fueled by the media. Look at a person's character not at their skin.","commenter_a":"He should quit whining and moaning. I can assist him get residency in Madagascar within 15 minutes.","post_message":"Van Jones responds to the anti-Donald J. Trump protests: “We have to hear the pain.”"},{"comment_id":"10153896144132061","commenter_b":"Women get it done.","commenter_a":"Husband leaving town at a bad time","post_message":"\"This is what happens when you are 35 weeks pregnant, husband leaves town for the weekend, childcare for your 3-year-old falls through, and you have a game to cover!\""}]
