[{"comment_id":"10153097498516636","commenter_b":"She's attention seeking plain and simple","commenter_a":"She makes a good, logical point in my book. Why should menstrual blood be considered different than any other blood depicted in film, TV or video games? Can't have it both ways... I admit it's a pretty extreme way to make that point but you can't argue with the logic.","post_message":"Period drama"},{"comment_id":"10152945596811336","commenter_b":"most schools require children to be up to date on vaccines - if you want to enroll kids in school it has to be done. But it does need to be a parent's decision- there might be extenuating circumstances where they chose not to.","commenter_a":"When commenting on a liberals post, check your grammar and punctuation carefully because that's the only comeback they've got.","post_message":"Sen. Rand Paul got a booster shot just a day after he injected himself into the national vaccine debate: @webpagelink"},{"comment_id":"10153963833427212","commenter_b":"She hit him too.. He should have walked away, but she is not innocent....","commenter_a":"I will never condone a woman's bad behavior however I will not condone a man laying hands on a woman. I believe in self protection but, I don't blame her for wanting to block this and I do blame him for his assault on her. He apologized and they delayed it long enough that the statue of limitations applied so why people will always defend a man and an athlete just because they are is quite pathetic. Women are always scapegoated to be the reason they got hit or assaulted and worse of all by women!","post_message":"ICYMI: Amelia Molitor, the woman OU running back Joe Mixon punched two years ago, filed a new motion to block the release of the assault video on Thursday. #News9"},{"comment_id":"1084079061644582","commenter_b":"Isn't she too powerful to jail?","commenter_a":"Says the rich woman","post_message":"\"Wall Street can never be allowed to threaten Main Street again, no bank can be too big to fail, no executive too powerful to jail,\" says Hillary Clinton during Nevada victory speech. @webpagelink"},{"comment_id":"10153681462888984","commenter_b":"Let's have a face to face.","commenter_a":"I am, and I have always liked her because she is honest!!","post_message":"Sarah Palin just put something on Facebook that immediately went viral... this image is exactly what Hillary didn't want America to see. Palin is never scared to tell it like it is... we should be grateful for her courage and patriotism."},{"comment_id":"704368863070943","commenter_b":"He covered the swamp with scum!!","commenter_a":"Tge ma is a F-ing Con-artist!!","post_message":"Did Trump \"drain the swamp\" like he promised during the campaign? Vote below! LIKE Occupy Democrats for more anti-Trump content!"},{"comment_id":"10153357248947061","commenter_b":"silly girl","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."}]
