[{"comment_id":"10153635830302061","commenter_b":"'@username Wow.....you are a wicked mean nasty woman!!!","commenter_a":"It was a great dance to encompass her whole journey on the show, but in no way does it compare to Nyle's or Paige's.","post_message":"WATCH: Ginger Zee & Valentin Chmerkovskiy's take the dance floor by storm in last night's Contemporary Dance to a cover of Coldplay's 'Adventure of a Lifetime.' Dancing with the Stars Season Finale continues TONIGHT!"},{"comment_id":"10154517298243132","commenter_b":"'@username It has already been released that the arresting officer was a open lesbian in a relationship. Also that according to court documents, that her ex was terrified of Amber after the 'assault' took place and that there was property that belonged to the ex that was damaged. Funny how records show one thing and now the ex is stating something different.","commenter_a":"Why isn't @username publishing the story Daily Mail and TMZ did about Amber Heard's domestic violence charge from her ex 'wife'. She obviously has a violent past and I'm not say that 'if' she was abused that what happened to her was justified. The fact maybe they had a volatile relationship. She could have also beat on him as well as he her, again abuse is abuse. But for all the victims out there, if she is lying for the money that's basically a slap to the face for those who were actually abused.","post_message":"iO Wright says Amber Heard suffered at the hands of Johnny Depp."},{"comment_id":"10153230871447708","commenter_b":"It's a good talk but you shouldn't make promises u can't keep. But you still have my vote","commenter_a":"Until AFTER election.....Read my lips...All the same","post_message":"I will oppose and veto ANY and ALL efforts to increase taxes. Join me in standing up for American taxpayers.  Click here now!"},{"comment_id":"10153361867349726","commenter_b":"He has no womb case closed Obummer has no morals or common sense","commenter_a":"The country is damn near in chaos and he takes the time to talk about this BS...","post_message":"WATCH: Obama: Caitlyn Jenner Showed 'Tremendous Courage'"},{"comment_id":"1741105056106659","commenter_b":"BWAHAHAH AND THAT'S WHAT MAKES AMERICA GREAT!","commenter_a":"Carla Stovall Jeanne' Cleopatra Thompson Anthony Stovall BLOOP!!!!","post_message":"TRUTH: Kaepernick's critics are failing to see the larger point. Roland Martin nailed it with this one.  Shared by Occupy Democrats, LIKE our page for more. Video from MSNBC."},{"comment_id":"10155873946605354","commenter_b":"Ass wipe.","commenter_a":"Because he's a Libtard","post_message":"Why would a Cuban rapper take offense at remarks against crime by Mexican illegal immigrants?"},{"comment_id":"1637686876527430","commenter_b":"I don't rbecall we doing this Obama some needs to stop this it is un-American to do this not happy leave the country that has let you make millions of dollar from the same people you bash we are sick of all this go cry to Hillary or better sit on her husband lap","commenter_a":"How stupid can they get? Pathetic!!","post_message":"Some celebrities will show up to Trump's inauguration....to protest."}]
