[{"comment_id":"10154134849200695","commenter_b":"Sorry that you have to know the pain :( if you want to follow along like my page @username Walks ..I'll be posting updates there along the way","commenter_a":"I am walking across America this year in honor of my sister who died of an overdose. I am going from Delaware to California and telling people about this epidemic and about Good Samaritan laws that protect people from going to jail if they call 911 for help when they see someone overdosing. @webpagelink","post_message":"A powerful new drug is triggering a spike in overdose deaths in Atlanta & across Georgia. Where the pills are coming from and the urgent warning from experts at the CDC, today at 5."},{"comment_id":"1065530533487804","commenter_b":"And yet she's still nasty as hell.","commenter_a":"I am a fair-skinned caucasian with vitiligo. I have always been grateful that my light skin color kept it from being as apparent as it is on a person with dark skin. I applaud the openness, but I find it interesting that the earlier pictures had the vitiligo spread on her face much more widely and less symmetrically.","post_message":"Here's a story for anyone who's ever hated feeling different — aka a story for everyone. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"1043101302382000","commenter_b":"@username, the worst president in OUR lifetime was 2000-2008.","commenter_a":"Rep. Todd Young I understand your optimistic out look. How ever if you think that man will ever do anything, that would make America stronger then you greatly disappoint my opinion of you.","post_message":"While the President closed his State of the Union address by noting his desire to work across the aisle, much of his speech was spent digging in his heels on the same tax-and-spend policies rejected by the American people rather than identifying areas of common ground. But while I’m generally disappointed he took this tack, I still think there were some hints of bipartisanship that might present opportunities to grow a stronger economy. For starters, I agree with the President that Congress must pass a trade promotion authority bill. With two of the largest free trade agreements in the history of the world currently being negotiated, it is vital that the administration works with Congress to set negotiating priorities so that a deal might be completed quickly. In order to grow our economy, we must continue to open foreign markets to agricultural products and manufactured goods from places like Indiana, ..."},{"comment_id":"10156409017440354","commenter_b":"Hillary is a stupid c*** and anybody who votes for her is a f****** moron.","commenter_a":"@webpagelink George Soros is the money and the monster backing them all!","post_message":"Don't ask questions. Just trust Hillary."},{"comment_id":"1270740256295648","commenter_b":"* \"You shut your whore mouth!\"","commenter_a":"Shut your damn mouth.","post_message":"We're going to talk about this one for a while."},{"comment_id":"10152629454892894","commenter_b":"She mad @username don't believe that hoe","commenter_a":"Aliah Tamartian Trainer Toi Magee-Taylor","post_message":"Coupled Up? Keke Palmer & August Alsina are Ridin' Around & Gettin' It [Photos]"},{"comment_id":"10153395340948984","commenter_b":"She's the one who put the hatred for America in his heart, she should be deported immediately!","commenter_a":"Give her the same!!!","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing... Do you think this Boston bomber got what he deserved?"}]
