[{"comment_id":"1801495493414518","commenter_b":"your witch is going to fry","commenter_a":"Can Trump even go to the bathroom without retracting or sending a \"revised\" tweet after his handlers yelled at him? Losing votes every day he is! Such a dope.... A con and dope. Sad.. As at one time I liked the guy???","post_message":"Donald J. Trump received swift backlash for tweeting about the fatal shooting of NBA star Dwyane Wade's cousin and writing, \"African-Americans will VOTE TRUMP!\""},{"comment_id":"1003938939663251","commenter_b":"we didnt send anyone, go kill yor bankers they fuck up your country, wait they already fucked up i guess","commenter_a":"Next wedding come over to Greece you son of bitches to feed all the illegal migrants that you send us!!!!!!!","post_message":"This is such a great story!"},{"comment_id":"10155137005061037","commenter_b":"Most illegals come here by not wading a river.","commenter_a":"Trump supporters are more worry about illegals than of terrorists what a sad world dnt forget that criminals come of all races and not just cause your brown skin means your from mexico Natives,Mexicans,Italians share the same skin color","post_message":"He once referred to it as “The Great Wall of Trump.”"},{"comment_id":"736524969871414","commenter_b":"True she needs to sit down some where and just grow old. If they don't put her in jail.","commenter_a":"I had been wondering about Hillary and her health. I was just thinking today what if Hillary should get sick if she's in office. Woman have a tendency to become ill as we get older. Has had her menopausal years. Hell because when I get sick I don't want to be bothered by nobody. I don't think Hillary would able to handle this president stuff. Not that we don't want her to be president I really don't think she would make it. Stress on a woman is not good. It triggers other types of sicknesses. I know about that stress. I had to quit a job because of stress. I was so damn stressed out I came down with hyperthyroidism that made me lose 94 lbs in one month. Due to stress. My doctor made me quit my job or die. And I had been wondering about Hillary Clinton. She's ...","post_message":"BREAKING: Hillary Clinton's Health In Jeopardy... Campaign Could Be Over Either way she was never fit to be president. She should retire early. Can we get 30,000 'LIKES' to have Hillary drop out of the race?"},{"comment_id":"10153123685718690","commenter_b":"Exactly , he got 72 Virgin girls.","commenter_a":"So jihad was killing none believers and was killed? so he died a hero?","post_message":"The mood was sombre as mourners gathered in Beirut southern suburbs to pay their respects to Jihad Mughniyeh, one of the six Hezbollah fighters killed in an alleged Israeli air strike in Syria. @webpagelink"},{"comment_id":"10154177421583734","commenter_b":"OK, toss in Jesus too, and all the Angles, and it still won't get him the Seat.","commenter_a":"He could have God running with him . He still has no shot at winning","post_message":"Do you think Fiorina was a good choice for Cruz?"},{"comment_id":"1797648893800416","commenter_b":"Women's bathrooms have in closed stalls get over it.","commenter_a":"I don't do business with Target anyway","post_message":"In the wake of Target's decision to allow men in women's restrooms and changing rooms, the hashtag #BoycottTarget has exploded across social media and trended as high as #1 on U.S. Facebook..."}]
