[{"comment_id":"10153657767106051","commenter_b":"OMG... A bunch of women who can't stfu!","commenter_a":"This isn't a political website Lorretta so move on.","post_message":"Olivia Newton-John's ex vanished on a fishing trip 10 years ago. Now, more than a decade later, we finally know what happened to him."},{"comment_id":"10154735959309575","commenter_b":"How fatherly of him to want to murder his kids along with himself. SMH! This world is SICK.","commenter_a":"for the children and the family God bless them","post_message":"A 1-year-old boy and a 3-year-old boy survived after their dad threw them off a 100-foot bridge during a murder-suicide attempt. They suffered concussions but were awake and conscious when police arrived."},{"comment_id":"10152609562277452","commenter_b":"Can you believe woman these days","commenter_a":"Wtf Hurray for this man.. bless his heart, and for a better woman to come to them..","post_message":"After a father refused to give up his newborn son, who was born with Down syndrome, the mother left both of them. abc7.la/1DEs3a0"},{"comment_id":"10153633420073132","commenter_b":"Keep up with the misogyny","commenter_a":"These are the lowest life, vilest example of human being that exist today. And that's the best that I can say about them.","post_message":"\"We aren't sisters, we never were. We just dated the same guy at the same damn time.\" - Kendra Wilkinson on Holly Madison"},{"comment_id":"10154589264351002","commenter_b":"Really, lady. Just full stop.","commenter_a":"So I will be rude. I can't reach the top of my Edge, even with a broom, and I even have a hard time scraping the windshield. I am only 4ft 11in.","post_message":"Reminder: Not clearing the snow from your car is not only rude -- it's illegal!"},{"comment_id":"513918755467368","commenter_b":"Screw that fat ass bitch","commenter_a":"Her and the view should of been gone long ago","post_message":"Joy Behar took a turn attacking the mother of the Benghazi victim. #RNCINCLE"},{"comment_id":"10154088708589087","commenter_b":"Including Melania Trump, she's illegal so vote for Hillary Melania!! LOL!","commenter_a":"the legal immigrants (hispanic and otherwise) should get onboard the Trump train...the illegal immigrants should vote for Hillary.","post_message":"House Hispanic Democrats said Trump is a \"cloud hanging over us\" as they begin celebrating Hispanic Heritage Month."}]
