[{"comment_id":"1590001651301475","commenter_b":"Great she'll be a steady war monger!","commenter_a":"Yeah diplomacy works! First and foremost.","post_message":"The Young Turks #LIVE coverage of the Commander In Chief Town Hall hosted by Ben Mankiewicz, John Iadarola & Ana Kasparian"},{"comment_id":"427202340738140","commenter_b":"Pharmaceutical companies cannot profit so much that's why they do not do what they are supposed to do is protect the public","commenter_a":"Lauren Martin","post_message":"This video is from a new documentary The Culture High which looks at both sides of the marijuana prohibition argument."},{"comment_id":"688195661362262","commenter_b":"You are awesome president Obama! !!! Thank you for all you've done","commenter_a":"This guy is a crook 2","post_message":"LIVE - President Obama on the Election Night win of President-elect Donald Trump."},{"comment_id":"1027451010661056","commenter_b":"You old bitch","commenter_a":"Free stuff...what they don't understand is they will be paying for it out of their taxes for the rest of their lives....","post_message":"This would be comical if it weren't so dang scary."},{"comment_id":"10152738126476051","commenter_b":"What a dumb woman","commenter_a":"Just give her the money and don't accept any more invitations from her, damn !!!","post_message":"The woman who invoiced a 5-year-old for missing her child’s birthday party has a message for all the haters."},{"comment_id":"943744942348702","commenter_b":"To those of you who think the federal government can raise incomes do yourself a favor and take an economics class. And pay attention.","commenter_a":"Someone please perform a partial birth abortion on this woman.","post_message":"'The defining economic challenge of our time is clear: We must raise incomes for hard-working Americans so they can afford a middle-class life.' Read Hillary's ideas for the economy in her own words:"},{"comment_id":"484282168429030","commenter_b":"deport her and all the rest of the muslims in america","commenter_a":"Yes","post_message":"She walked on the plane wearing her Hijab, boy was that a mistake.  Shariah Law is dangerous, we support the patriots that stand against it.  Should Shariah be banned in all 50 states?"}]
