[{"comment_id":"1166954960025334","commenter_b":"You are so right. All this is her own doing.","commenter_a":"Why didn't Hillary say, I have heard the question? Shows character of Hillary.","post_message":"CNN FIRES BLACK DEM Party Chair: New Wikileaks Email Exposes SECOND Question Donna Brazile Gave To Crooked Hillary In Advance Of Debate"},{"comment_id":"1215065415200595","commenter_b":"That one black girl would have kicked their ass","commenter_a":"All it would've taken is 1 black girl and no one would give a shit","post_message":"These young racists aren't laughing anymore."},{"comment_id":"10154162654734087","commenter_b":"Yep, we saw how Liberal women threw their crotches at Bill Clinton with votes right? My guess is most would have gladly changed places with Monica Lewinsky. Sucks to be a hypocrital non-critical thinking Lib woman. That's Lib Feminism I guess.","commenter_a":"Yes, when a bigoted, neo-fascist, sexual predator runs for president on the GOP ticket, Democrats are loyal to their party and independents and moderate Republicans stream to join us to stop him as well...funny how that works.","post_message":"\"With the exception of cheating Bernie out of the nom the Dems have always proven to be far more loyal to each other than the Republicans!\" Trump tweeted."},{"comment_id":"10154630548633132","commenter_b":"Her stepmom Melania looks like Caitlyn Jenner lol","commenter_a":"Not being mean but she reminds me of Miley Cyrus..","post_message":"Donald J. Trump and Marla Maples daughter Tiffany is addressing the nation."},{"comment_id":"1060233254031678","commenter_b":"I have a question, I received an email from the bernie sanders.com saying i did not have a party preference but to request a democratic ballot. i did get a democratic ballot. this is my first time voting and was wonder if that's what it actually meant?","commenter_a":"I like how honest Bernie is. The Democrats sold that clean coal fantasy for years, and Clinton is still trying to sell it. Heck, she said natural gas is a \"bridge fuel\" when, renewable can replace most energy needs. When a candidate who sold fracking to the world, and supports \"clean coal\" gets environmental group endorcements. That candidate is the establishment. Because nothing else makes any damn sense.","post_message":"Safe fracking is like clean coal, pure fiction. Fracking pollutes water, degrades air quality and worsens climate change. No amount of regulation can make it safe."},{"comment_id":"1432027056824713","commenter_b":"PUSSY","commenter_a":"Canada doesn't want these idiots any more than we do.","post_message":"Progressives always break their promises."},{"comment_id":"10155350061090231","commenter_b":"He couldn't shoot him in the leg and let him live?????","commenter_a":"Did he sprinkle crack on him before calling it in?","post_message":"BREAKING NEWS: Video shows SC police officer, Michael T. Slage, shooting Walter L. Scott, 50, in the back as he fled."}]
