[{"comment_id":"820953834667537","commenter_b":"He's not a Muslim.....and if he was so what??? Oh I forgot we live in America where it's screw every other religion but leave Christians alone.","commenter_a":"“I’m not sure what’s more shocking, the atrocities of ISIS or the silence of the Obama administration,”Perkins said. Perkins and Kelly also discussed the Islamic State’s ultimatum, as well as their torching of an 1800-year-old church and destruction of one of the oldest communities of Christians in existence. “That’s the choice of freedom under Islam,” Perkins said. “This administration has been silent continuously when Christians have been persecuted,” he continued. “[It] is more concerned about offending Islamic states and Islamic nations than they are of defending the long standing policy that America has always had — that religious freedom is a human right, not just an American right.”","post_message":"“We will find the people who did this. France is today shocked by this terrorist attack.”   -  French President Francois Hollande"},{"comment_id":"1139418446080798","commenter_b":"Cruz, your are lying conniving little bitch! Trump 2016","commenter_a":"Cruz is full of S&$t, they did not VOTE for him or anyone else. They were not allowed to vote.","post_message":"\"Donald Trump 65,000 people voted in the state of Colorado. They just didn’t vote for you. They voted for our campaign. Or to put it more simply, Donald Trump, it ain’t stealing when the voters vote against you.\""},{"comment_id":"364315750438606","commenter_b":"Orrrrrrrrrrrrrrrr, build a big wall around it and let in any idiot who wants to live like an animal.","commenter_a":"Solution for Baltimore. Dismantle the police department and incorporate law enforcement into the Department of Social Services. Terminate all police officers. Fund the law inforcement portion of social services with Federal dollars. Social Services pay gang members $100,000 plus benefits and pension to each gang member, no identification or proof of residence required. Pay each adult $500,000 for new housing or relocation. No identification or proof of residence required. No follow up for use of housing fund. Encourage business owners to allow no cost to their merchandise (free) .","post_message":"Democrat Candidate for Senate in Maryland Blames Republican Governor for Baltimore Education Problems"},{"comment_id":"1160001747368578","commenter_b":"@username What Does Hillary Clinton Really Want? WARNING: up America As you may know, Hillary Clinton mentor was Saul Alinsky. She wrote her thesis based on his writings. Saul Alinsky died 44 years ago and was the author of a piece called for Radicals. He wrote about how to create a State. President Obama prescribe to this philosophy as well as Elizabeth Warren and Bernie Sanders. Don fool yourselves, this is their mission and their purpose! There are eight levels of that must be obtained before you are able to create a social state: 1. Healthcare Control Healthcare and you control the people 2. Poverty Increase the poverty level as high as possible; poor people are easier to control and will not fight back if you are providing them everything to live. 3. Debt Increase the Debt to an unsustainable level. That way you are able to increase taxes which ...","commenter_a":"This information has all been checked, then double checked... It is 100% Correct. Maybe Trump knows something we should That's why there is such an alarm within US government, since Trump's statement about temporary suspension of migration of Muslims to US till US authorities make sure there is a proper concept of safe penetration of US territory. People are stunned to learn that the head of the U.S. CIA is a Muslim! Do hope this wakes up some! Until it hits you like a ton of bricks read it again, until you understand! We now have a Muslim government! John Brennan, current head of the CIA converted to Islam while stationed in Saudi Arabia. Obama's top adviser, Valerie Jarrett, is a Muslim who was born in Iran where her parents still live. Hillary Clinton's top adviser, Huma Abedin is a Muslim, whose mother and brother are still involved in the ...","post_message":"Hillary Clinton belongs in prison!"},{"comment_id":"1576025939362143","commenter_b":"This is America not European dont like America go back to European take DONALD TRUMP with you ok gringo","commenter_a":"Why are people dumb enough to think people who do not want illegals in the US hate Mexicans? Or any other foreigner? It is ILLEGALS that they want to regulate, no those entering the country legally. We could do without the wall, just get more Border Patrol and more bullets...and do like other nations, shoot those crossing illegally, maybe that would satisfy the supporters of illegal immigration... Read up on Mexico's illegal immigration law.","post_message":"Former Mexico President Vicente Fox is sorry, not sorry about his big middle finger to Donald J. Trump and his proposed wall along the U.S. southern border."},{"comment_id":"10153782447389094","commenter_b":"Ppl are making it one. So just fix it where only one person can use the restroom by themselves.","commenter_a":"Just make all businesses have two restrooms with one stall. And a lock on each door. Problem solved","post_message":"The states allege the government action has “no basis in law.”"},{"comment_id":"1083781141676265","commenter_b":"It has proven once more that U.S are serving the Wahhabism in the region in return it get many from the Saudi Royal family. no matter to U.S how dangerous the wahabi are what extreme threat poses to civilization.","commenter_a":"Muricaaaa","post_message":"The Russian foreign ministry said the attack had jeopardised the US-Russia agreement on Syria."}]
