[{"comment_id":"825517894248057","commenter_b":"Sure I can agree with that but you need a way to pay off debt. Taxes are revenue for the government which are used for various expenses. When you balance the budget that means you are simply not paying down debt but spending less than you have. We need to start moving in a direction where we will run surpluses and thereby pay off previous debt. Just like a company, a government should not be run by debt. Now theoretically by increasing taxes = more revenue which could be used to pay off debts but that doesn't always work in modern society. We are a people who now are all run my debt, we own nothing anymore.","commenter_a":"Realistically the only way to reduce the deficit is increasing taxes. The problem is Hilary wants to increase to help her buddies and Bernie wants to increase taxes to add more social services. The other two will uses those taxes, cut spending and find other ways to be more efficient to reduce deficit.well trump will cuz Cruz will just have to give money to his buddies in the establishment","post_message":"HA! Look at how much the tax plan of each candidate will directly affect your paycheck...  Your jaw will drop when you get to Bernie Sanders..."},{"comment_id":"1238686566209877","commenter_b":"Well said! Agree 100%","commenter_a":"The norm in our country any more. White on black, is racism. Black on white, poor black kids had no daddy & raised in a poor neighborhood! That half an half in the White House. He has no compassion for his \"white\" heritage, only the black side. Pathetic man!","post_message":"A white pizza delivery kid was out working hard, trying to make ends meet. Then he got a call to deliver a pizza to these two thugs.  What happened once he got there will turn your stomach.  This should outrage the entire nation, but the media, Al Sharpton, and Barack Obama don't want to say a word."},{"comment_id":"1751080988447451","commenter_b":"FUCKING IDIOT!","commenter_a":"Tyler Steinle","post_message":"You should be VERY careful with things that go BOOM!"},{"comment_id":"10150808006769999","commenter_b":"Minority women...","commenter_a":"i get the point about not many women in software engineering.. but, minorities? umm..just looking around my office floor right now, all i see are minorities (asians and south asians)","post_message":"Why do so few women and minorities work in software engineering? We’re discussing reasons for the gap and what can be done to improve it.  Join filmmaker Robin Hauser Reynolds, whose new documentary, “Code,” explores the issue; Nick Rockwell, CTO at The New York Times; Minerva Tantoco, CTO for New York City; Myrna Soto, Senior Vice President Global Chief Information Security Officer at Comcast; and Jazmine Hughes, Associate Editor at The New York Times. If you have questions, leave them in the comments.  For the second half of this live stream, click here: @webpagelink"},{"comment_id":"782076235316287","commenter_b":"Go now obama!","commenter_a":"Yes please leave if you are offended by our flag or if you disrespect it. LEAVE","post_message":"SHARE if you agree!"},{"comment_id":"693090104129406","commenter_b":"she is a fraud... she was a mecanic in a motor pool","commenter_a":"You go girl!!!","post_message":"One way activists in the United States are supporting an end to poaching is by enlisting retired vets to take part in an organization that puts their years of combat training to work overseas."},{"comment_id":"816614281820679","commenter_b":"You have got to be kidding 49. Unbelievable! Evil surely takes its toll. She looks horrible. I am older than her!","commenter_a":"Can you believe the skanky crack whore, also known as KellyAnne Conway, is only 49? She looks like she is late 60's or early 70's... This is the toll that selling your soul to the devil will take on you!","post_message":"She did sell her soul to the Devil, after all."}]
