[{"comment_id":"1154295914627380","commenter_b":"This woman is crazy for thinking of that.","commenter_a":"You remind me of the politicians who turned away boats full of Jewish refugees, and sent them back to Germany to suffer in the Holocaust.","post_message":"Hillary Clinton will increase Syrian refugees by 550% without a realistic screening process."},{"comment_id":"1044042925655455","commenter_b":"Vote to leave the EU when you get the chance , Europe is lost","commenter_a":"Next a Muslim prime minister","post_message":"Sadiq Khan has been named as The Labour Party's candidate to replace Boris Johnson as Mayor of London"},{"comment_id":"10155791972890725","commenter_b":"STFU","commenter_a":"and a lot of people blame the police in one out of five hundred killings. what happen to hope and change under obama?","post_message":"Police say the victim, identified as Vonzell Banks, was likely not the intended target ----> @webpagelink"},{"comment_id":"10153567099501509","commenter_b":"Throw those Muslims overboard!!","commenter_a":"May God forgive them","post_message":"Muslims who were among migrants trying to get from Libya to Italy in a boat this week threw 12 fellow passengers overboard -- killing them -- because the 12 were Christians, Italian police said. @webpagelink"},{"comment_id":"1214784961920643","commenter_b":"all these woman marching i wish they would say samething about us senior that can not get out of the house to help fight for our medicare and social security","commenter_a":"Marching in Tucson, AZ!! Yea! Ladies!","post_message":"LIVE NOW: Women's March in D.C., just one day after Trump's inauguration. MORE MARCH INFO: @webpagelink"},{"comment_id":"10153453475573128","commenter_b":"To let the criminals' partnered officials pirate settlements to fill RICO crime established deficits AS the CRIMINALS declare exemptions on the fines, PRESERVES THEIR RIGHT TO THE CRIMINALLY GAINED CAPITAL, as the RICO mechanisms are left destroying the citizens WHO ARE NOT MADE RIGHT. They STILL lose the paid into asset/taxes.","commenter_a":"What is more egregious than a racket on our assets and THEN OUR WEALTH/earnings used to STEAL the racketeered assets WHILE the bank uses OUR wealth to outsource, exploit economic refugees, and MARKET RIG for decades? Citizen-taxpayers FORCED TO ASSUME market control(free market) destruction as RISK, as criminals assume racketeered assets, margins, and government. That is TEXTBOOK Weimar-Gangster Statism for which the criminal interests MUST be prosecuted and the assets/capital RETURNED to us as citizens and to our economy.","post_message":"A decade after homeowners used a soaring real-estate market to go on a borrowing binge against their own properties, many are now falling behind on payments."},{"comment_id":"10154411481819062","commenter_b":"Or the reverse at movie theaters. How will women react when a bunch of not-women get in line in front of them while the men's restroom has nobody in it?","commenter_a":"So he/she's will get to sit on the can in the Women's rest room. Well turn about is fair play, women using the men's room when there is a line at sporting events. How will men react when they are standing at the urinal and a woman walks by heading for the toilet stall?","post_message":"HAPPENING TODAY: In about an hour, business leaders are expected to reveal their plans to support the Houston equal rights ordinance."}]
