[{"comment_id":"10153370720431509","commenter_b":"Well the real word is cold and full of corruption and greed. This type of harvesting happens on a daily basis in 3rd world countries, poor desperate individuals selling their kidneys in back allies to rich benefactors. Most illegal organs are stolen form human trafficking.","commenter_a":"Organ harvesting and transport is complicated. You can't just slash a body and grab them out. This sounds like a ploy by the Iraqi govt to get headlines","post_message":"It's a startling claim. If true, what could be driving increasingly extreme tactics #ISIS is employing? @webpagelink"},{"comment_id":"10153666245398984","commenter_b":"All this just so the Dems can have more illegals to for for them....Could Trump be more dead on?","commenter_a":"Thank Obama for all these murders, he is the one responsible for letting thdm in the country!!!","post_message":"This is a horribly tragic story, especially since it involves an illegal who should never have been in this country. Please join us in sending thoughts and prayers to the families of the victims.  Are you against amnesty for illegals?"},{"comment_id":"10153142288487217","commenter_b":"USA is a dangerous place to live in. even Army men are not safe there. the brave men was unhurt in France even in terrorist attack. but in USA he got stabbed. Muslims terrorists are everywhere in USA TODAY","commenter_a":"Ban knives!!!!","post_message":"The airman, who was hailed as hero after the French train terror attack, is in a stable condition after being stabbed in California"},{"comment_id":"1112791138738235","commenter_b":"1 stupid bitch","commenter_a":"Unfortunately she is right more often than not.","post_message":""},{"comment_id":"1867582453468544","commenter_b":"Stupid bitch","commenter_a":"you make it like i did , hard work bitch , no hand outs","post_message":"One of the co-founders of Black Lives Matter just said that \"white folks\" need to \"sacrifice\" THIS for her movement... this is an outrage.  America needs to know the goals of this movement... they're not going to like this."},{"comment_id":"10155247657250294","commenter_b":"Flush her down the toilet","commenter_a":"So very sad.","post_message":"When she was told she couldn't board the plane, police say a Florida woman did the unthinkable."},{"comment_id":"10154153451894197","commenter_b":"nice, she can afford to leave, no doubt on our dime.","commenter_a":"and who didn't see this coming","post_message":"Former Governor Rell is moving to Florida, and she is not happy about the direction of Connecticut.   Have you considered moving for tax reasons?  Watch Face the State with Dennis House this morning at 11.    Preview here: @webpagelink"}]
