[{"comment_id":"857261721036748","commenter_b":"He is a terrible president regardless of anything else.","commenter_a":"I'm sick of this crap!...He's a great President..Who cares what religion he is?","post_message":"Scott Walker says he doesn't know if President Obama is a Christian."},{"comment_id":"1772774552977135","commenter_b":"These women are hypocrites.","commenter_a":"So explain to me how Trump is horrible because he was talking to another man in private about a women who cares get over it you crybabies. I'm sure she liked it too","post_message":"BREAKING: Protesters have gathered in front of the Trump Tower on Michigan Ave. They're holding graphic signs referencing Donald Trump's lewd comments about women. No arrests so far. MORE: @webpagelink"},{"comment_id":"971601666302233","commenter_b":"It seems like all the intelligent women with morals have been fired... This show needs to be cancelled!","commenter_a":"Yes","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"10152812861587507","commenter_b":"Tell us who those democrats are that WANT war????","commenter_a":"God supports hate , hate wins wars , and Democratic elections .","post_message":"Army of God? 6 Modern-Day Christian Terrorist Groups You Never Hear About"},{"comment_id":"10152887362811770","commenter_b":"Liar....","commenter_a":"gormless!!","post_message":"Pantsuit on fire!"},{"comment_id":"883164491718973","commenter_b":"She is evil & a liar!!!","commenter_a":"She's a bigger liar than her husband and he lied to the Supreme Court and got away with it","post_message":"We must STOP HILLARY!"},{"comment_id":"749306348569686","commenter_b":"@username - free cell phones started under Bush administration, food stamps under FDR.. try again.","commenter_a":"He is a real man.Best president with class and a brain. That'swhat make people hate him because he has education . and know how to be humble even when haters come along with silly response. HATERS","post_message":""}]
