[{"comment_id":"496087783849595","commenter_b":"Walking into someone's property uninvited and killing a dog who was protecting the house from such intruders. Fuck that guy.","commenter_a":"Look at these comments.","post_message":"This cop fear for his life after trespassing in a homeowner's back yard and being confronted by a 25 pound dog. What he said to the homeowner afterwards will make you sick.  Via - The Free Thought Project.com"},{"comment_id":"10153654951896519","commenter_b":"'@username tell that to Europe where is a hell hole for sex workers in the 'legal' market and human trafficking of child prostitutes is at an all time high. Prostitution functions on the idea that women and their sex organs are a commodity to be bought and sold for the pleasure and consumption of men, it's dehumanization 101, how on earth could it be empowering when the average age that people start sex work is at 14?","commenter_a":"It is aginst the law yet you break it, You understand that liberals do not want you exploiting these women and yet you are hypocrite for doing so.","post_message":"'Instead of seeking love, I sought success...'"},{"comment_id":"10153576265156336","commenter_b":"Suck it up, buttercup.","commenter_a":"Wonder if this clown avoids baseball games","post_message":"Lambert’s Café is known as “Home of the Throwed Roll,” where servers at the restaurant are known for tossing the rolls to customers."},{"comment_id":"10153184111444877","commenter_b":"these now women were looking for an easy ride to stardom so was their mothers who allowed them to be around a grown man in some hotel.","commenter_a":"I think she's screwed up!! I can understand her need to defend black folks but this guy??,","post_message":"Whoopi Goldberg defends Bill Cosby: 'He has not been proven a rapist.' Watch what else Whoopi had to say below.   Grio fam, what do you think of Whoopi's comments?"},{"comment_id":"10154048567109203","commenter_b":"She's a turd","commenter_a":"Hillary 2016","post_message":"How could you, Will Ferrell??"},{"comment_id":"903880782991323","commenter_b":"Discrimination!!","commenter_a":"I think it something that must be done, especially when children are involved. The effect of cigarette smoke on kids is devastating.","post_message":"A children's hospital announced it will no longer hire employees who smoke: @webpagelink Do you think it's a good policy or too harsh?"},{"comment_id":"10154071850239456","commenter_b":"Look for Huckabee at VP","commenter_a":"He will make a great VP","post_message":"Do you think he made the right decision?"}]
