[{"comment_id":"10153114864642144","commenter_b":"Bitch is a hater","commenter_a":"I don't even care about McCain but to be dismissive about his service to our country is disrespectful. Trump is an asshole.","post_message":"Low, even for Trump"},{"comment_id":"875381432484713","commenter_b":"I dont know about you ladies but I sure dont want to see no 35 year old pop star.","commenter_a":"Kenya once again showed what a messy, ugly, and miserable woman she is. Claudia is Kenya's equally despicable sidekick. Demetria needs to grow a brain of her own. NENE LEAKES showed she is the Queen of RHOA. And Cynthia continues to talk tough, but if someone says boo to her, she will break down in tears when all is said and done. Phaedra was dead wrong for asking Demetria is she had done crack, but Demetria had one of the night's best comebacks with the 'all we have in common is the number 8'!","post_message":"“Your Clit Has Left Your Body!\" Phaedra's Shade, NeNe's Wrath and Claudia's Toes Are Unleashed #RHOA Ep. 10 @webpagelink"},{"comment_id":"10154523609503984","commenter_b":"oh, Spanish ought to set you off too, especially those who want to make it our official language, after all it was Spain that did the most detriment","commenter_a":"Cynthia, America is not racist. There are racist people that live in AMERICA. Obama is a race baiting man stop being BLIND. It was VERY INAPPROPRIATE for the speech he gave in Dallas. If anyone has the TRUE right to be angry about racism it is MY PEOPLE, NATIVE AMERICANS. I don't see any blacks living on reservations in America.","post_message":"This guy hits the nail on the head. I'm sure race baiting liberals will be fuming after watching this. A lot of people took aim at Michelle Obama in 2015, but no one hit the bullseye harder than he did..."},{"comment_id":"10153356970249087","commenter_b":"#EndOurFreedom #KeepUsSafe","commenter_a":"There is no way to defend against terrorist attacks in a free society and have any freedoms left. Even a cop on every corner checking ID's and frisking people won't stop them.","post_message":"Former police commissioner Howard Safir said the terrorists in Paris changed the dynamic when they \"picked a local restaurant, they picked a theater\" instead of heading for iconic targets like the Eiffel Tower or the Louvre."},{"comment_id":"10153488237764087","commenter_b":"Her looks are irrelevant to the fact that Trump is a punk ass bitch and his supporters leave slime trails.","commenter_a":"I have a challenge for Megyn. How about she show up at the debate wearing ZERO MAKEUP, so she shows her true self and not the all painted up deceptive image of who Megyn Kelly really is. Come on Megyn, quit hiding behind that makeup paint.","post_message":"\"As I've said before, I would rather set myself on fire in front of the Fox News studio than go on the debate stage with [Megyn Kelly],\" Morning Joe's Joe Scarborough said."},{"comment_id":"10153046136906615","commenter_b":"make her take a leave of absense...without pay. If she wins, pay her retroactive.","commenter_a":"She will not resign. The minute she does. The Commonwealth will no longer be responsible for her attorney's fees. Conversely, this charade may turn into a \"where there is smoke, there is fire\" ordeal. Also thinking when she goes down. She is taking people with her, yet I believe the \"machine\" will do their best to mitigate future collateral damage!","post_message":"JUST IN via WPXI Joe Holden -- Pennsylvania's attorney general has been ordered to trial on all charges including perjury, obstruction..."},{"comment_id":"10153179541492014","commenter_b":"Who cares? She's giving a great Christmas! Good for her!!!!! People need to butt out and mind their own business!!!","commenter_a":"What's the problem? It's her money she works for her family.","post_message":"Sound Off: Is this a great Christmas or way too much?"}]
