[{"comment_id":"977192562373798","commenter_b":"why not a woman","commenter_a":"Great news. Some disquieting news is that Hillie is considering Julian Castro for her VP. He is a good one and I guarantee he would jump. I really wish I knew who Bernie is considering. It should be a person of color imho.","post_message":"The American people are definitely feeling the Bern."},{"comment_id":"10152809432022060","commenter_b":"Ummmm she made that choice! PLEASE quit pretending she was Innocent!","commenter_a":"Oh yea she looks real scared. She was with him two weeks? Cant lay her choices on him.","post_message":"Faced with the vicious way in which Dexter Allen is accused of killing the victims, Haraquon Degruy's mother believes she was trapped, unable to flee for fear of repercussions against herself or her family."},{"comment_id":"10156702895000354","commenter_b":"Yeah, poor Oprah. She probably is forced to shop at second hand stores.","commenter_a":"Black women have black privilege","post_message":"Guess how many millions of dollars actress 25-year-old Jennifer Lawrence made in 2015...  *Hint: it's more than you will make in a lifetime--by FAR"},{"comment_id":"10154443469472293","commenter_b":"Lady you are what makes liberals look stupid.","commenter_a":"Her rapist will be the next GOP candidate for president.","post_message":"Police were called to his $5 million mansion after a 21-year-old was allegedly assaulted at his annual Halloween gathering."},{"comment_id":"10153171348750736","commenter_b":"Yeah, I want my 30 cents! in a check.. pronto!","commenter_a":"Instead of someone winning, split thee winnings with everyone who bought a ticket!!","post_message":"#BREAKING  No winner in tonight's Powerball Jackpot.  Wednesday's draw will be worth at least $1.3 BILLION.  Is there a billionaire's equivalent to the Dollar store??"},{"comment_id":"636990926431695","commenter_b":"Let her go to a country that enforces Sharia law and see how she really likes being beat.","commenter_a":"She is insane!","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"10155955897895354","commenter_b":"The nasty b*tch just wanted attention and guess what? Now everybody is giving it to her.","commenter_a":"For the life of me I will never understand killing these magnificent animals. I just don't understand how it can be wonderful, thrilling, exciting or in any way fulfilling to kill an exotic animal. And then chop it's head off or whatever you do with that giraffe and have it mounted. Makes not one bit of sense let alone any kind of satisfaction.... Just don't get it.STOP IT NOW!!!!","post_message":"This hunter is single-handedly breaking the Internet today.   Check out the photos of her other controversial kills..."}]
