[{"comment_id":"1027758113945859","commenter_b":"What a bunch of liberal pussies you all are.....keep smoking that pot and living in your mom's basement LOL","commenter_a":"I love you Bernie!","post_message":"In just a few days, voters across New York will make their choice for the presidential nomination on Tuesday, April 19. The entire country will be watching as the results come in. And with your help, New York will send a profound message to the political and economic establishment in this country. That's why we're asking you to commit to vote for Bernie."},{"comment_id":"10153090995473984","commenter_b":"They both need to be jailed or shot as the traitors they are!","commenter_a":"Dems must be psycho after all she has had to do with the deaths of Stevens etc she thinks SHE should run for POTUS! The audacity of entitiled politicians is RUDE!!","post_message":"She probably thought she had gotten away with it. Not so fast, Hillary... Should she face criminal charges for this?"},{"comment_id":"1065259396852375","commenter_b":"Oh @username, you're so fucking stupid it's not even funny. I hope you can't reproduce.","commenter_a":"Have you recuperated from all the fun last week ? Glad everyone made it home with no problems. If you're planning to go to the DNC convention; here's the schedule. DNC convention Schedule Saturday, 27 August 2016 11:15 AM Free lunch, medical marijuana, and bus ride to the Convention. Forms distributed for Food Stamp enrollment. 2:30 PM Group Voter Registration for Undocumented Immigrants. 4:00 PM Opening Flag Burning Ceremony Sponsored by CNN 4:15 PM Address on \"Being the Real You\" Rachel Dolezal, former Head of the Seattle NAACP and Caitlyn Jenner 4:30 PM \"How to Bank $200 Million as a Public Servant and Claim to be Broke\" Hillary Clinton 4:45 PM \"How to have a successful career without ever having a job, and still avoid paying taxes!\" A Seminar Moderated by Al Sharpton and Jesse Jackson 5:00 PM Medals of Freedom presentation to Army deserter Bo Berghdal and the Baltimore ...","post_message":"Stand with Democratic leaders: tell the RNC to DISBAND Trey Gowdy's fraudulent Benghazi committee and have Republicans pay back taxpayers! PETITION: @webpagelink (hat tip to Occupy Democrats)"},{"comment_id":"10153157733159197","commenter_b":"She looka likea man.","commenter_a":"the scowl on the face of #3 is pretty funny","post_message":"Have you been to a spa in East Hartford lately? It could be one that was shut down after a prostitution bust-->> @webpagelink"},{"comment_id":"10154660419633797","commenter_b":"I'm pretty sure Russia is still one up on us!!","commenter_a":"Yup I'm a contributor","post_message":"AMERICANS DRINKING MORE: For the first time in nearly 15 years, everyone around the globe is drinking less alcohol. Except for people in the U.S."},{"comment_id":"10155553244070354","commenter_b":"Sit your dumb racist ass down and shutup AL shapton and pay the taxes you owe","commenter_a":"Wake up people! States better start secession proceedings. The 10th Amendment: \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\"","post_message":"First he fought the right, then he fought the cops, now Al Sharpton announces his plan to fight his toughest opponent yet: ....The U.S. Constitution."},{"comment_id":"989628607749873","commenter_b":"Lord have mercy, poor little baby, may he rest in peace.","commenter_a":"HOW?!?! HOW DOES THIS HAPPEN?!?! I just can't wrap my head around it. I have tried to understand but I am also a busy/working mother and I just can't understand how you can forget about a child in a car.","post_message":"Parents, grandparents and caregivers of any kind - PLEASE remember to always check your vehicle: @webpagelink"}]
