[{"comment_id":"1001470336557869","commenter_b":"HaHaHa ROFL at her.","commenter_a":"And she is the Dean at a University? Sad state of mind and then you combine that with putting her in the role of teaching! Are we the people paying for that woman's salary?","post_message":"WOW this lady...shamelessly LIED about her entire encounter with the Police Officers..and here's the proof! What a fool."},{"comment_id":"10153288097452629","commenter_b":"Hmmm. But I'm mixed so do I only get 5% off?","commenter_a":"Ariel help the world is blind","post_message":"If you love BBQ (and you're white), June 11th is your lucky day."},{"comment_id":"10154014162531636","commenter_b":"Nope! Jeremy Corbyn.","commenter_a":"ISIS?","post_message":"BREAKING"},{"comment_id":"427202340738140","commenter_b":"Pharmaceutical companies cannot profit so much that's why they do not do what they are supposed to do is protect the public","commenter_a":"Lauren Martin","post_message":"This video is from a new documentary The Culture High which looks at both sides of the marijuana prohibition argument."},{"comment_id":"10153366619543635","commenter_b":"Nope. I thought you knew better than that.","commenter_a":"Quran (3:56) - 'As to those who reject faith, I will punish them with terrible agony in this world and in the Hereafter, nor will they have anyone to help.'","post_message":"Hillary Clinton: 'Muslims Have Nothing to Do With Terrorism'"},{"comment_id":"1890349187852006","commenter_b":"One does not have to TRY to cast america in a bad light..... The racists & Nazis here do a good enough job by themselves. America is NOT great, & will never be great again until the cancer which arrived here In 1492 is removed. Swim back to Europe racist beast","commenter_a":"Stupid, stupid, stupid. I only still like this site cuz i wanna read what propoganda u spew next. Has anybody else thought that this site is communist run, or pro russian. They always try to find ways to cast the US in a very bad light","post_message":"OMG, did you hear?   $$ Dump: @webpagelink DAPL Raid: @webpagelink Drone Bomb: @webpagelink Join Us: The Free Thought Project"},{"comment_id":"10154679787223751","commenter_b":"we dont want to lecture anyone on how to govern their own country, but Canadians will lead by example","commenter_a":"That's whet they need to be.","post_message":"Canada's border has seen a surge in people crossing illegally from the U.S., with a 230% increase in people crossing into Quebec in January compared to a year ago. @webpagelink"}]
