[{"comment_id":"484149281775652","commenter_b":"Get rid of him and his fat AZZ wife!","commenter_a":"Yes","post_message":"VIDEO: Kanye West cries racism after Beyonce loses... Kanye is a fool and a cancer, let's ban him from America. Do you agree Kanye should be banned from America?"},{"comment_id":"10153586503151336","commenter_b":"Lmao @username is a pussy cuz a girl made it","commenter_a":"@username @username Cody Wilkerson","post_message":"Two women have made military history by becoming the first female soldiers to complete the U.S. Army's grueling Ranger Course."},{"comment_id":"503378786489136","commenter_b":"She is nothing but a bigot. Keep her locked up until she complies","commenter_a":"Do the right thing. Spread hate in the name of Jesus and shield your bigory with the bible. Claim you are a christian to defend your sorrid past to justify issuing your twisted moral judgment on others. Yes than you will be a twisted evangelical christian spreading the hate of your chosen religion.","post_message":"Who is the clerk in the middle of the same-sex marriage debate?"},{"comment_id":"10153731471343967","commenter_b":"But a laser pointer. Entertain your cat AND COOK DELICIOUS BACON.","commenter_a":"@username James Speck @username","post_message":"Brilliant"},{"comment_id":"441828512816456","commenter_b":"You're not fucking kidding.Damn sum bitches,making us all look bad.fuck them @username.I plan to fuck with them every day and at every turn without mercy.","commenter_a":"Tear them a new ass @username","post_message":"EXACTLY! CNN's Jake Tapper just SHREDDED Trump for banning them and other mainstream news outlets from the White House press briefings. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"947324245313643","commenter_b":"Sick witch, heartless.","commenter_a":"Arrested her","post_message":"Police say woman hid body of dead son in trunk of her car. According to police, the boy was last seen in 2004. @webpagelink"},{"comment_id":"1658752774184464","commenter_b":"Have you bothered -- of course you have not -- to realize the amount of business your new Fueher is doing in these very same countries? And continues to do so? At this moment anything HRC did is irrelevant.","commenter_a":"The Clinton Foundation accepts donations from the Saudi Arabian Royal family, who have had hundreds of people hung for being gay. But these moron Hillary supporters either don't know it or they're just willfully ignorant","post_message":"'I fully support Hamilton: An American Musical cast taking Mike Pence to task over equality, but..."}]
