[{"comment_id":"10153956823096135","commenter_b":"I want Michigan to win. Been a fan for many, many years !!","commenter_a":".","post_message":"POLL: It's time for The Game! The Michigan Wolverines face off against the Ohio State Buckeyes at high noon Saturday on WXYZ-TV. We want to know who you think is going to win. React to this post with a heart if you think it will be Michigan and a like if you think it will be Ohio State. You can also predict the final score with a comment. Also, if you share this post your friends can weigh in too."},{"comment_id":"821190501249706","commenter_b":"just his type, they can have fruit loops together","commenter_a":"Yeh but our leader will meet with a woman eating fruit loops in a bathtub! !! POS","post_message":"The White House is FURIOUS with Boehner for breaking protocol! Looks like somebody doesn't like the taste of their own medicine!"},{"comment_id":"10153168114730399","commenter_b":"Go to hell u hypocrit","commenter_a":"Our laws are dictated by the society as a whole, not by anyone's God or church.","post_message":"A unique interpretation of our justice system..."},{"comment_id":"10154460376356955","commenter_b":"Let's get real honest for a minute. WHAT demographic purachased most of the 80 million copies of \"FIfty Shades of Grey\"? White suburan WOMEN. They were ok with the talk about p888y in that book and movie, but are all the sudden appalled at trump's language 11 yrs ago.. As espn football guys would say, \"COME ON MAN\"!","commenter_a":"Funny how all the establishment types who have fought to stop Trump all along, republicans and democrats alike, are the ones most offended by coarse language and not so bothered by corruption and criminal activity.","post_message":"Voters Heckle Paul Ryan, Chant: 'SHAME ON YOU!'..."},{"comment_id":"756073464525834","commenter_b":"The best part about all these whining Christians & their rhetoric to defend Christ against a money hungry corporation(which bye strives to destroy mom& pop coffee shops) when ppl are already starving to death or hooked up on drugs. Your Christmas was actually started by Constantine, centered around & similar to pagan holidays to make the transition to Christianity easier. Constantine was actually a pagan until his death bed to where he rejoiced unto God and saved his soul. Why don't you silly Christians who so vehemently judge and live so unlike jesus did do some research on the Christmas tree... It's also pagan, right down to the star on top to the ornaments around it. America was founded on freedom of religion, but that only seems to apply if it's Christian. And yes, the indigenous natives were massacred by bible carrying spaniards, priests, English, Dutch etc. It doesn't matter ...","commenter_a":"This is my last bit about the god forsaken red cups (no pun intended), and thats it. And please read before commenting. Starbucks, is not \"catering to people outside this country\"... Starbucks is a free enterprise, and not obligated to tell you Merry Christmas, in fact, they are not obligated to even do something for the holidays. There are many born and raised here with different faiths and they ALL believe in god, just not Christmas. For example the Jewish believe in God whole heartedly, just not Jesus, which Christmas is about. They also celebrate Hanukkah this time of year. Christianity is not even the first religion in this country, and Christians came here and slaughtered the indiginous for not being Christian, so it's not surprising they still don't accept other religions or respect them. That being said, businesses SHOULD absolutely have the right to say Merry Christmas If they ...","post_message":"Oops doesn't really cover it."},{"comment_id":"10154732730043132","commenter_b":"BUT is he jewish?!","commenter_a":"Daniel Foisset","post_message":"It looks like Aly Raisman has plans for after Rio!"},{"comment_id":"10153535750495667","commenter_b":"@username she is a horse","commenter_a":"She's still ugly and that will never change!","post_message":"Michelle Obama turned Friday the 13th into a fashionable affair."}]
