[{"comment_id":"1178124042307867","commenter_b":"No brains--no headaches. Maybe he should leave with Whoopie. They would be happy in Iran, take Rosie with you.","commenter_a":"Some of these people have lost their f##ing minds!!","post_message":""},{"comment_id":"832521843510736","commenter_b":"All of them boobs!","commenter_a":"\"Mess NBC\" IS A JOKE! Less than 150,000 viewers. Now, compare this with FOX - with 2.7 Million each each NIGHT!","post_message":"Bouncing back?"},{"comment_id":"10153059352079342","commenter_b":"Sick sick person, wonder how she would like that done to her. She looks mean! Glad she is not my grandmother.","commenter_a":"guela knows","post_message":"A grandmother from southwest Houston is accused of burning her 12-year-old granddaughter with a hot tortilla pan after the girl got in trouble at school for writing on the chalkboard.  FULL STORY---> @webpagelink"},{"comment_id":"1420023134696147","commenter_b":"She really believes she has the right to treat that man disrespectfully because she disagrees with his views. What is wrong with people? Great job by the airline.","commenter_a":"Need to see more in many other places.","post_message":"WATCH! Anti-Trump Hag Gets Kicked Off Flight After Threatening TRUMP Supporter...Passengers Clap! [Video]"},{"comment_id":"1672047073075950","commenter_b":"I hope this doesn't help Hillary. She needs to be indited & serve time.","commenter_a":"they are setting the stage to let hillary off with murder","post_message":"Breaking News: Defense Secretary Ash Carter has decided not to demote General David Petraeus. @webpagelink"},{"comment_id":"1664185713874789","commenter_b":"Mars, but unfortunately the earth will be trashed long before humans can get to it.","commenter_a":"Is there by any chance a spare planet any of you got around?","post_message":"This is not a drill – a bill has been drafted to “completely abolish” the Environmental Protection Agency before the end of 2018."},{"comment_id":"917835871594729","commenter_b":"This is a very old photo of Hillary...she has become too old and out of date to be the Democratic President we need!","commenter_a":"Be nice if She would make up Her mind!","post_message":"Are you supporting Hillary 2016? Then go to DemStarter.com right now and show your support: @webpagelink  Hillary is in 3rd place in pledged support behind Elizabeth Warren and Bernie Sanders on DemStarter.com, but we're still just days into it.  Go to DemStarter.com, and show your support for Hillary, or for your favorite Democrat!"}]
