[{"comment_id":"10153581516273984","commenter_b":"The feds will just print more money huh. That's what's wrong with America is people like you don't know how things operate. The only money that gets printed is money that gets destroyed that banks send back. We are not in debt because we keep printing our own money. We can only print as much money as we have in our gold reserves. The reason we are in debt is because we keep borrowing money from places like China. But see that's the problem with the people in this country, they run to the polls to vote but have no clue how anything even operates","commenter_a":"Trump won't be any better. We will have more wars and more debt. Your pensions and other government ensured money will be gambled away again. The dollar will continue to devalue as the Fed prints money debt money. More American jobs will go overseas to China and Mexico. The middle class will slowly but surely wither away while people wonder what happened AGAIN and do absolutely nothing but complain on the couch or internet. The list goes on and on and on but you reap what you sew I guess. It is always the younger generation who has to clean up the mess of the old as always.","post_message":"Donald J. Trump just ripped apart Obama's Iran deal with 6 blunt words that hit home to millions of Americans. You know Obama hated hearing him say this, because Obama knows it's the truth."},{"comment_id":"1059948200694894","commenter_b":"She isn't a women, if she was slick Willie would deny ever having sex with her","commenter_a":"Unlike him, she should be under federal indictment and disallowed from running for any office at all.","post_message":"It's getting downright catty between Hillary Clinton and Donald Trump."},{"comment_id":"10153733424987042","commenter_b":"Girl bye","commenter_a":"I'm sure most idiots are gonna miss the point of the post.show an police officer respect to get respect though not true in some cases but 95% it is.lets be kind and respectful to our men and women who put their lives on the line for us everyday.💙❤️💚💛💜","post_message":"\"I’m a black man wearing a hoodie and strapped. According to certain social movements, I shouldn’t be alive right now because the police are allegedly out to kill minorities.\""},{"comment_id":"10154816797908812","commenter_b":"There's a pattern here Trump women seem to be dumber than crash dummy's","commenter_a":"She means softer because he hasn't had as many scandals and the extent of those scandals would be scary enough facing the press. I would definitely start coughing if I were in her shoes...she could pretend to faint again just as the van arrives and that way she can be saved from her own embarrassing actions. Being held accountable to the public is not in her best interest.","post_message":"The Trump campaign’s major concern: The candidate’s limited preparation. The Clinton camp’s biggest worry: That Donald J. Trump will be asked softer questions than Hillary Clinton."},{"comment_id":"10153154293302293","commenter_b":"Oh please. Stop being a pussy.","commenter_a":"Thanks Fox News for causing hysteria among your psyco viewers and almost getting my buddies killed.","post_message":"The men had a deadly plot to lure government forces into a trap, federal officials say."},{"comment_id":"1681608915392702","commenter_b":"@username it made it to the internet via facebook / twitter etc , not sure about the mainstreeam","commenter_a":"with innocent doctors inside","post_message":"Pretty much sums it up... The Free Thought Project.com (Y)"},{"comment_id":"1692723517682991","commenter_b":"One of you crazy ladies is from Texas.","commenter_a":"Realism is not what I see coming from most of HRC's supporters. There are some extremely hard to admit, and in fact, frightening facts that I think we have all tried to glaze over for years. In Bernie Sanders we have got a candidate that is addressing those facts. Climate Change is real, most democrats are no longer climate change deniers, but I feel like the real threats are being overlooked. For example, droughts are happening all over the United States. We are quickly depleting our fresh water aquifers. When one factors Fracking into this, we are willfully allowing our government to destroy more of our fresh water systems. HRC cannot denounce Fracking. Now, before you think that article that spells out how much HRC is taking in campaign contributions from the fossil fuel industry is another Republican smear tactic, note that it is by Greenpeace. She has to go. ...","post_message":"\"We can open the door to every person in this country again.\" —President Bill Clinton"}]
