[{"comment_id":"10153894447031130","commenter_b":"I'm sure that's very concerning to her. News flash: women aren't interested in your opinion of them.","commenter_a":"She is not attractive or funny to me at all.","post_message":"And Amy Schumer looks fab, of course."},{"comment_id":"1193174800771119","commenter_b":"@username and deport them","commenter_a":"Sounds to me like she's taken some pages out of Hitlers book: Meine Kaumph. Don't know if that is spelled right, but you get the idea. And I wonder how she'll feel about it when she reaches 80. (if she ever does).","post_message":"What's up with leftists having no problem 'taking people out'?"},{"comment_id":"10152787741471130","commenter_b":"And please don't reproduce a$$hole!","commenter_a":"This makes my stomach churn. These poor dogs would have been better off on the streets!!!","post_message":"\"They were living in their feces, urine and there was nothing there.\""},{"comment_id":"831063543595735","commenter_b":"and what would having military service help with illegal aliens......","commenter_a":"Every Presidential candidate should have had at least 3 years active duty! No exceptions! Would stop illegal aliens, and other scum from infiltrating the white house like NOW!","post_message":"We need a leader who supports our military, now more than ever! www.thepoliticalinsider.com"},{"comment_id":"10152582982555950","commenter_b":"Im guessing she's a real bitch...","commenter_a":"he could have just said he wanted a divorce,","post_message":"The man's wife didn't know about or give permission for the demolition, police say."},{"comment_id":"1037527509601593","commenter_b":"Well America will allow idiots to have guns","commenter_a":"What a dingbat","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"1801596090092193","commenter_b":"Rot in jail bitches","commenter_a":"You mean to tell me. These people are so dumb that when they went out to do something this stupid. They didnt know anyone that would or could bail them out?.. That is pathetic","post_message":"Charlotte protesters want people's money for bail."}]
