[{"comment_id":"10153999197086623","commenter_b":"She needs those basement dwelling super predators!","commenter_a":"PLEASE!!!! Don't let the opinions/directions of others, polls, political analysts and outcome predictions determine your participation in the voting process. Register*… Vote… Exercise your right to be heard! *If you are not registered, in some places you may do so in person up to and through election day. Contact your state government voter organization or @webpagelink for more information.","post_message":"\"There is a platform now. I reflected on the things I've heard her say, commit to and seen in writing, and that's how I came to my decision.\""},{"comment_id":"10153358816899099","commenter_b":"Hide the women and children.","commenter_a":"Countdown until someone is groped/raped or a fight,","post_message":"These streets will be closed Sunday for the Puerto Rican Day parade @webpagelink"},{"comment_id":"1742743236000370","commenter_b":"Typical Bernie speech sounds like this.I like to thank my legs for supporting me.My arms for always having been by my side and as for my fingers-------I could always count on them.","commenter_a":"Thank you West Virginia and Nebraska...Im glad several of our states including Pa..can see what Trump needs to do.. JOBS....people need to get back to work.and Most hard working people want this...everyone needs to pay into the system..","post_message":"It is a great honor to have won both West Virginia and Nebraska, especially by such massive margins. My time spent in both states was a wonderful and enlightening experience for me. I learned a lot, and that knowledge will be put to good use towards the creation of businesses, jobs, and the strengthening and revival of their economies. I look forward to returning to West Virginia and Nebraska soon, and hope to win both states in the general election. Likewise, my time spent last week with the great people of Oregon will hopefully lead to another victory next Tuesday. Thank you! Donald J. Trump"},{"comment_id":"1300544240024109","commenter_b":"She'll be kissing a whole lot of ass in jail","commenter_a":"The bitch lost - America knows she is a lying bitch now she has to kiss his ass to try to keep her out of jail","post_message":"It's over."},{"comment_id":"10154242925578837","commenter_b":"The wall will cost billions and stop hundreds. Wao.","commenter_a":"A wall to stop terrorists, criminals and drugs from pouring into America, what a noble idea","post_message":"CONGRESS TO PAY FOR WALL - GOP leader Paul Ryan says congress will end up paying $12 billion to $15 billion for President Trump's border wall."},{"comment_id":"631016783743523","commenter_b":"Another white college educated female here!!!","commenter_a":"Donald Trump will not become president of the United States, because Americans understand that togetherness trumps divisiveness, and that love trumps hatred.","post_message":"Join me in in Philadelphia - LETS MAKE AMERICA SAFE AND GREAT AGAIN! GOD BLESS AMERICA!! -DJT"},{"comment_id":"1220141934692263","commenter_b":"Most hard working Latino's are no different than any other American that love their country. They want good jobs and a dependable future that illegals won't take their jobs. If they vote for Hillary they know their jobs will be gone. Either by illegal immigration, Middle East immigration or bad trade agreements that will move their jobs overseas. @webpagelink","commenter_a":"Love it.. No only I don't want him for my daughter I don't want him for my sons Trump is bully bully should never be rewarded.. I'm voting blue don't matter who, because Red is to dangerous to give my vote too","post_message":"According to Hillary Clinton's team, the intention of the ad is to show the effect Donald J. Trump's \"hateful rhetoric towards women is having on our daughters.\""}]
