[{"comment_id":"10153673371886336","commenter_b":"Exterminate them all","commenter_a":"And they wonder why their lives don't matter?","post_message":"Scott Lattin and his family painted the words “police lives matter” on the back window of their truck.  Then, someone spray-painted obscenities about the police on their car and wrote “black lives matter” in spray paint across the side of the truck.."},{"comment_id":"10155662877255354","commenter_b":"She is f#$%&@+ stupid.","commenter_a":"Fucking stupid liberal fuckers","post_message":"And look how much the fine would be if you didn't."},{"comment_id":"10153423460374087","commenter_b":"@username You will be pleased to know that I will be running for president in 2036, with @username as my running mate. We will be running on the Republican ticket which should also please you. Donald Trump is a man of one line punches with no specificity as to how he will execute his policies. I don't believe that building a wall will solve our immigration problems and banning the immigration of Muslims into the United States is unconstitutional. The First Amendment states, \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof.\" Banning Muslims from entering this nation goes against the beliefs of what our founding fathers envisioned for this nation. Now, I am not in favor of President Obama's policies and actions, but I do believe that there are much more suitable candidates for the office than Mr. Trump, at least until ...","commenter_a":"@username what politics have come to, smh","post_message":"Donald J. Trump's daughter Ivanka Trump says she may make her own political run one day."},{"comment_id":"10153838572646756","commenter_b":"I've heard people complain about steak & lobster, but not produce.","commenter_a":"Odd that many who are not on food stamps complain when those who are eligible have carts full of healthy/quality food: seafood, steak, fresh produce. It's America -where life is a competition. If you need help, you stay at the bottom.","post_message":"People who rely on federal food stamps ate about the same number of calories, but consumed fewer fruits and vegetables and whole grains and more added sugars, according to studies."},{"comment_id":"1285542031522022","commenter_b":"A lot of women with four children worked.","commenter_a":"BOOYAH!!!","post_message":"MUST WATCH: Kellyanne Conway PUNCHES BACK After Juan Williams Questioned How She Could Work And Raise 4 Kids: \"I don't play golf and I don't have a mistress\" [VIDEO]  I can't stop cheering for Trump's #1 woman! Just like her boss, the Left is going to quickly discover that she is not one to sit back quietly and be attacked…"},{"comment_id":"10156618428550354","commenter_b":"And why wouldn't he? His father and step father were Muslim...Is it beginning to make sense?","commenter_a":"They will have to air the whitehouse when they finally get because of the smell he will leave","post_message":"The worst terrorist attack in America since 9-11 and what does Obama do?"},{"comment_id":"10154017323271350","commenter_b":"sweet potato! :)","commenter_a":"Teri","post_message":"Once you start spiralizing life will never be the same!"}]
