[{"comment_id":"658627524300508","commenter_b":"Just the way I want them! You have your work cut out for you with Remi your Boston Terrier.","commenter_a":"@username both your dog's made the list","post_message":"What's the laziest dog breed?"},{"comment_id":"10152661116841491","commenter_b":"Thugs are thugs, white or black. Stop acting like it is a racist term, people. These idiots belong in the exact same grouping as the ones in Ferguson and deserve to be treated the exact same way.","commenter_a":"Omar Shtayyeh","post_message":"Columbus Police Department spokeswoman Denise Alex-Bouzounis said that about 8,000 students forced their way into The Horseshoe stadium and tore down a goal post."},{"comment_id":"10153471218374270","commenter_b":"What ever happened to OPSEC!","commenter_a":"What does that do? Piss them off?","post_message":"Big deal."},{"comment_id":"10153997229702042","commenter_b":"You ladies don't have knees or you like the attention... Knee to the groin!!","commenter_a":"Get him off the streets","post_message":"Police are looking for this man who allegedly groped and rubbed his groin against a subway rider on the train. \"SHARE\" this post to help police find this man."},{"comment_id":"1770180839911909","commenter_b":"I will be disgusted if Hillary is the president!","commenter_a":"I'm still in disbelief! Thank you for your service to this country Hillary. I'm just disgusted that Trump will be president.","post_message":"Scripture tells us: Let us not grow weary in doing good, for in due season, we shall reap, if we do not lose heart."},{"comment_id":"10153837390443812","commenter_b":"No, just their sperm. Lol","commenter_a":"You mean survivors are contagious for nine months.?","post_message":"Doctors have found that Ebola can linger in some male survivors for up to 9 months."},{"comment_id":"1105423922847469","commenter_b":"Bitchhhh","commenter_a":"@username best of the world's ladies !!!!","post_message":"This isn't who we are, and it also isn't how we keep America safe."}]
