[{"comment_id":"10156112421560293","commenter_b":"LIFE is what they should get. turn their a**holes inside out by the sisters...","commenter_a":"These people should be charged with sexual slavery of a minor. They should have a very long prison sentence.","post_message":"Phone calls about possible human trafficking and a missing teenager led Tuscumbia police to arrest these three suspects:"},{"comment_id":"1022130381169318","commenter_b":"CUMMING are stupid brats !","commenter_a":"OMG what a crock","post_message":"Come on..."},{"comment_id":"1271439512904593","commenter_b":"Now this is the kind of moms we need in America. This the type of mom who deserves happiness","commenter_a":"wow","post_message":"MOM OF THE YEAR: She says she promised herself she'd do anything to give her kids a normal life."},{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx \" you big dummy \"","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."},{"comment_id":"10156410445115354","commenter_b":"Rebecca the clan was founded in 1865....u ignorant slut....","commenter_a":"If this paper had any business sense and compassion, they would fire that guy.","post_message":"When you see the CARTOON mocking Republican Gov-elect Matt Bevin's adopted children from Ethiopia, just remind yourself: it's only racist when attacks are against Democrats, not Republicans."},{"comment_id":"659276420929603","commenter_b":"I guess she could go back to Africa Ebola does that ring a bell","commenter_a":"Dam she's got lips like monkey boy.I bet she could suck the crome off a trailer hitch.","post_message":"This entitled woman just demanded a free drink... Because of slavery? This is absolutely ridiculous. We owe her nothing. Should she be compensated for slavery?"},{"comment_id":"10153308267139641","commenter_b":"Give her a million and send her on her way.","commenter_a":"Probably be on ID How I almost got away with it","post_message":"Russia's richest man faces $7 billion divorce bill: @webpagelink"}]
