[{"comment_id":"10153594324081336","commenter_b":"These animals should be disposed of! Don't waste the tax-payers money on public defenders, trials and a life in prison!","commenter_a":"This animals need to be caught and put away for life!","post_message":"The Lash family had just returned home from vacation when a group of teens came to the door and asked to borrow a jack for their car, then tried to force their way into the home."},{"comment_id":"1013753742085664","commenter_b":"'@username Babies suck!","commenter_a":"I used to dislike Clinton... I was uninformed and knew little about her other than what the right wanted me to believe. After some research and learning about all of her work on behalf of minorities, working families, women, and children over the course of her life and seeing her deal with adversity and downright deplorable behavior with strength, class, and grace, I am PROUD to give her my vote and my full support. I'll be voting Democrat down the ballot to ensure not only that she is elected, but that she has a Congress she can work with - not one hell-bent on obstruction. There is a reason she polls so much higher with EDUCATED people. #imwithher","post_message":"For 45 seconds, a drenched Hillary Clinton abandoned her script and let down her guard in Florida: @webpagelink"},{"comment_id":"10153905516506178","commenter_b":"I always say Merry Christmas at that is just the way it is.","commenter_a":"Fitting that a NUTCRACKER be in the back ground. :-)","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153141686007093","commenter_b":"No she isnt..cause when you see a 400 lb woman wear them and you can see through them then you will be on her side! !!!!!!!!!!!!!!!!!!#!!!!!!!!!","commenter_a":"She's just all butt hurt because she doesn't have a nice body to pull off wearing leggings like they're pants ;)","post_message":"It's leggings season. But according to one woman's viral rant, a lot of people don't wear them correctly... @webpagelink"},{"comment_id":"554818391394376","commenter_b":"'@username you said it. Now it's trumps turn. AND HES GOING TO HEAR it... Loud and clear.","commenter_a":"'@username TRUMP IS OUR PRESIDENT, Have some respect, stop showing our kids it's ok to disrespect our President, our country. Can't wait for the day, your boat sinks, and you hate mongering reporters drown.","post_message":"He wrote a book alleging corruption between the Clintons and their philanthropy. Now he says he sees similar conflicts of interest between Donald Trump and his business."},{"comment_id":"10154033103686065","commenter_b":"he is just telling it like it is....and i am him now","commenter_a":"On point and going after the media . Media is so bias and they are being called out for what they are.","post_message":"What do you think?"},{"comment_id":"10155032769051757","commenter_b":"Great","commenter_a":"Excellent! I hope to see you do many more of Fox's interviews with President Trump. You deserve it. Thank you for always reporting the truth when others didn't.","post_message":"Question of the Day: What did you think of my interview with President Donald J. Trump?"}]
