[{"comment_id":"10156613595445354","commenter_b":"I'm amazed at how ignorant she is!!!","commenter_a":"Wasserman Schultz is what you cal and air head. The elivator does not reach the top floor.","post_message":"\"...it’s incumbent upon us to stand with our Muslim brothers and sisters and make sure that we can push back hard...\""},{"comment_id":"10153888628981336","commenter_b":"@username - your brain is a mulsim! SHUT ALL \"DOORS\"!! KILL ALL muslim islams!! The only people who hate Trump are the illegals, anchor babies, muslims! Again, I ask, which one are you or are you all three? I demand to block ALL ILLEGAL aliens; muslim islams, to PROTECT OUR borders! Then IMPEACH obama blammer mouth!","commenter_a":"Obama can't help it. His father was a Muslim, not an American. His allegiance is pretty clear.","post_message":"Yesterday on \"America's News Headquarters,\" Mike Huckabee shared his perspective in light of the #SanBernardino terror attack."},{"comment_id":"1009601765755554","commenter_b":"Brandon Douglas just remember this. This was a rigged election and the only ones that lost are us by excepting the way things.","commenter_a":"Don't give up Bernie! People still believe in you as being the right pick. Stand up and fight for the Presidency! People will back you!","post_message":""},{"comment_id":"882254358503349","commenter_b":"My child would be instantly removed!","commenter_a":"Yes it would and yet silence from the sooo offended group.","post_message":"ISLAMIZATION: LA Public School: Teaching Kids Is The One True God (VIDEO) @webpagelink"},{"comment_id":"1754494444782298","commenter_b":"If you have to ask what's wrong with him then you need to get a checkup from the neck up and have your ears cleaned out","commenter_a":"I sure hope he's getting 2 a.m. calls in the morning from people who hate his guts","post_message":"THEY DID IT: #Anonymous just released all of Donald J. Trump's personal information to the public..."},{"comment_id":"875339435822246","commenter_b":"And that wig is horrible!","commenter_a":"No new news...She says that about all men. No shame and straight up tacky.","post_message":"Sherri Shepherd Wants To Sleep With Johnny Gill… @webpagelink"},{"comment_id":"1332991433380908","commenter_b":"All im saying is some people shouldnt breed .","commenter_a":"poor skinny white Jesusy guy.. HOW COME I'm THE CHUMP !! ==========>.\"roll tide/ @webpagelink","post_message":"Counter-demonstrators outnumbered attendees of a \"pro-white\" rally at Stone Mountain Park in Georgia, home to a divisive landmark that pays tribute to Confederate leaders."}]
