[{"comment_id":"1581842645443556","commenter_b":"@username We saw that guy with the brains.Did you?","commenter_a":"\"i need all the white people to move to the back\" that's not racist or anything...shaking my head, god forbid a white person had said that about black people, a riot would break out","post_message":"Black Lives Matter protesters attempted to segregate white members of the media during a demonstration near the DNC. @webpagelink"},{"comment_id":"10156726524125725","commenter_b":"Hide yo kids, hide yo wives.","commenter_a":"Will he be blocking polling places and stopping people from voting like he did in MA? After all, if you can't win an election honestly CHEAT, just like you did TO your wife!","post_message":"Illinois is shaping up to be an important state in the Democratic presidential race, so much so that former President Bill Clinton will be stumping in the Chicago area this week ----> @webpagelink"},{"comment_id":"10152601048042061","commenter_b":"till she open`s her stupid mouth.......again !!!!","commenter_a":"I love this photo. Most models would be posing and trying to be the focal point. I just adore the fact that stunningly gorgeous Giselle has her hat pulled down and is pointing at Tom, and not stealing a bit of his thunder. What a great couple they make!","post_message":"Coming in at number 3 in the  News midday buzz  see how Gisele Bundchen and Tom Brady and their kids celebrated the Patriots AFC Championship win: @webpagelink"},{"comment_id":"1724892717782853","commenter_b":"We are in America! Speak English woman! Lol","commenter_a":"@username they read my post!","post_message":"\"Hail Hydra\" are two words no one ever expected Captain America to say."},{"comment_id":"1400798166615856","commenter_b":"Bye bye bitch","commenter_a":"KICK ROCKS, THAT'S RIGHT RUN RABBIT RUN","post_message":"BYE! You won't be missed."},{"comment_id":"1412904655446554","commenter_b":"You know joy what goes around comes around.I think she is only on tv because she is so nasty","commenter_a":"Enough is enough! Grow up and accept your new president you whining bunch of children! It's time to take either the hosts or the hosts off the air because they are to infantile to face reality!","post_message":"The heck!"},{"comment_id":"10153551321648984","commenter_b":"A coal burning slut","commenter_a":"Kardashian is nothing more than a SLUT! Don't watch anything to do with her, PERIOD!","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with...  Do you side with Megyn Kelly on this one?"}]
