[{"comment_id":"1031268323551304","commenter_b":"Why is it OK for transsexuals to lure gays into gay bars and not women to attract straight men into a restaurant?.........libtards double standard!","commenter_a":"Uhhh.. What's the problem?? We know this... They know this.. They know that we know this.. Who's getting hurt by this? Do much for women being empowered. They're not helpless..You can't have it both ways.","post_message":"This leaked memo says it all"},{"comment_id":"10154016179049411","commenter_b":"Merkel admits multiculturalism in Germany a failure, yet continues to accept refugees @webpagelink/ After Muslim rape epidemic, Merkel admits Germany refugee crisis out of control. German Chancellor admitted Europe is 'vulnerable' and said countries do not have control of the situation @webpagelink @webpagelink","commenter_a":"Magyarország <3","post_message":"'If we cannot secure the outer border [of the EU], regardless of how costly or demanding that is, we will destroy the Schengen regime by ourselves'"},{"comment_id":"10155005314954062","commenter_b":"@username Gale Adams @username @username Christina Marie 👀😒😔","commenter_a":"Justin Irwin","post_message":"Please be careful to all of our friends in the Conroe area. This was shared by Heather Dungan from Conroe 105 and I45 near Home Depot.  If you encounter high water, turn around. @webpagelink"},{"comment_id":"1227725310657052","commenter_b":"Please don't reproduce.","commenter_a":"Trump incites violence. He is bringing the racists out in droves and he is dividing this country. Since he came on the scene, there has been more hate crimes than I've ever seen. Wake up people!","post_message":"The sniper attack on Dallas police officers now ranks among the deadliest against U.S. law enforcement since 1900."},{"comment_id":"954480501354785","commenter_b":"After all the bitching and complains that one guy did I'm so happy to see this.","commenter_a":"Please don't start with you there goes the racist comments because you're a racist to say","post_message":"LIVE: Special announcement expected at Little Caesars Arena around 10am, regarding \"another Detroit franchise announcement\" - MORE at ClickOnDetroit.com (UPDATE: Kid Rock will open Little Caesars Arena with 4 shows in September 2017)"},{"comment_id":"1756628007939155","commenter_b":"Stop and think!....before you vote for Hillary just to have a female as President...You are hanging yourself for women making it again in the future. Stop and think!","commenter_a":"DUNP THE TRUMP & GUILIANI!","post_message":"MAYOR RUDY GIULIANI STATEMENT ON LATEST CLINTON FOUNDATION DONOR SCANDAL:                           (New York, NY) – Former New York City Mayor and U.S. Attorney Rudy Giuliani today released the following statement on the Associated Press’ analysis revealing that 55 percent of Hillary Clinton’s non-government meetings while at the State Department were Clinton Foundation donors whose contributions totaled at least $156 million:   “From the facts revealed to-date, it is impossible to figure out where the Clinton Foundation ends and the State Department begins. It is now abundantly clear that the Clintons set up a business to profit from public office. They sold access and specific actions by and to them for money. This makes a mockery of her promise to Congress and the President to keep the Clinton Foundation and the Clinton State Department entirely separate. In other words, they merged the two into the Clinton Family racketeering enterprise. The need for a Special Prosecutor to investigate these apparent crimes mounts with every passing day and the revelation of new sets of e-mails and phone logs. I’m sure all we’ve seen is the tip of the iceberg and there will be more to follow.” -Rudy Giuliani"},{"comment_id":"10154592299555579","commenter_b":"this woman is about one thing only………money and power and fame………….she has sold her soul…...","commenter_a":"WATCH CSPAN!!","post_message":"Laura Ingraham says to \"all you boys with wounded feelings and bruised egos must honor your pledge to support Donald Trump now. Tonight.\" Watch full speech here: @webpagelink"}]
