[{"comment_id":"10154231827133797","commenter_b":"How you like them bad apples","commenter_a":"So all of you WANT another war? The Obama hate is getting really old. Let me guess. Your all republican wealthy suburban mini van driving ,entitled Starbucks drinking pricks. I like how you alllll forget Bush's presidency. By far the worst president. Ever.","post_message":"OBAMA ADDRESSES PARIS ATTACKS: President Barack Obama says putting large numbers of U.S. troops on the ground to combat the threat from the Islamic State would be \"a mistake.\""},{"comment_id":"10155445943810725","commenter_b":"Sadly though it still happened :(","commenter_a":"Everyone who leaves their child with anyone should have a nanny cam.","post_message":"Nanny cam video reveals horrific new details on how a babysitter tortured a 3-year-old girl (Warning: Disturbing content)-----> @webpagelink"},{"comment_id":"10154379177365579","commenter_b":"Thats illegal zach. You have to come here to get it.","commenter_a":"If only he lowered the debt, defeated terrorists, raised the employment level, etc. as well as he cracked jokes.","post_message":"FULL REMARKS from President Obama at his final White House Correspondents' Dinner."},{"comment_id":"2108841499340180","commenter_b":"VICTORY FOR TRUMP ! . .FEDERAL PEN FOR THE LYIN' QUEEN !","commenter_a":"Save your money,this election will not be bought","post_message":"Nigerian billionaire Gilbert Chagoury pledged one BILLION dollars to Hillary and Bill Clinton's Foundation. That's billion--with a \"b.\"   Now why would a Nigerian oligarch with a past like his do such a thing?"},{"comment_id":"842369659142996","commenter_b":"Child abuse has actually increased since Roe v Wade. Abortion logic 101...the baby \"might\" be abused later so we'd better kill her now; the baby might actually get to LIVE in a non-traditional home so we'd better kill her now\". Sheeeesh, the stupidity.","commenter_a":"So many young couples would love to take that precious angel growing inside of you. Please don't murder that innocent baby..","post_message":"You don't get to \"choose\" to kill another human being."},{"comment_id":"1873334889566400","commenter_b":"I'm thinking entertainment value. After he leaves office, it will be obvious what a loser he is.","commenter_a":"Idiot","post_message":"President Barack Obama plans to speak out when he believes he needs to during the presidency of Donald Trump."},{"comment_id":"10153083234283837","commenter_b":"What does sleeping have to do with a woman running over someone with her car?","commenter_a":"Thus is why elderly should not be sleeping","post_message":"APPALLING ACCIDENT - An elderly woman accidentally ran over a man, believed to be her husband, in the driveway of their Fort Lauderdale home."}]
