[{"comment_id":"10153525456151438","commenter_b":"I've saved this to read for later because I'm in denial. I will always remember Richard Dawkins the way he was in his Growing Up in the Universe christmas lectures.","commenter_a":"He might be a brilliant scientist and author, but he's also a bigoted asshole too filled with his own sense of superiority to recognize that he can be as much of an intolerant hypocrite as the religious extremists he (rightfully) criticizes.","post_message":"He’s charming in his books, but he picks fights on the Internet."},{"comment_id":"631671896999280","commenter_b":"Too many real stories of sexual predators taking advantage of this garbage! BOYCOTT target!","commenter_a":"After the Trump rally last night here in Pa all the restaurants and stores were packed in the vicinity. We drove past Target to get out of the traffic jam and we noticed they were dead. It was really weird to see.It was bad enough when we came home from Kmart one day my 13 year old daughter telling me a female came in the bathroom with a bag and needle. Wish I knew before we left but I do not want her coming out and telling me a MAN was in there watching her No way.","post_message":"Target customers show the company just how they feel about its new transgender bathroom policy. @webpagelink"},{"comment_id":"10154716032249714","commenter_b":"Triggered a feminist. Didn't take long. What benefits will hillary do for you? Decrease tax rates hah funny. Zoe you sound little butt hurt you might need to see proctologist.","commenter_a":"Woah Woah Woah More Democratic Propaganda. Time to settle down @username.","post_message":"\"The first time I doubted my looks and worth was in kindergarten.\""},{"comment_id":"869042603191993","commenter_b":"Good! Then STFU you two!","commenter_a":"So they jab him when they invite what's his face to address the congress, now they jab him with this letter to Iran. I mean are you kidding me?","post_message":"\"The letter sent on March 9th by forty-seven Republican Senators to the Islamic Republic of Iran ... is beneath the dignity of an institution I revere.\" - Vice President Joe Biden"},{"comment_id":"10155442182635615","commenter_b":"Fix that damn grill! She looks like a damn key maker!","commenter_a":"get a new haircut, for starters...","post_message":"What do you think they should do with it?"},{"comment_id":"766553903477790","commenter_b":"Obama will call it workplace problems.","commenter_a":"It's not ISIS committing these violent crimes it's the guns, we have to start a war against guns!!!!!","post_message":"Oh my God.....BREAKING NEWS. Share it folks. We need you."},{"comment_id":"10153805458826337","commenter_b":"Is that chick is his girl?","commenter_a":"Vanessa Delgado where was this ride when we went damn man that looks cool","post_message":"Watch DeStorm Power escape Call of Duty's Black Ops 3 Shadows Of Evil Ride at Six Flags!"}]
