[{"comment_id":"10155220975479218","commenter_b":"@username tell that to a nun","commenter_a":"You wouldn't need to be pro choice or pro life if people were just responsible when it comes to their sex lives. Both men and women, responsibility!","post_message":"Thousands of people demonstrated in the annual March For Life, marching from the Washington Monument to the Supreme Court, advocating the right to life >> @webpagelink"},{"comment_id":"1207167835973058","commenter_b":"It's not true for entrepreneurs but workplace","commenter_a":"What if this statistic isn't true? Check out what John Stossel uncovered: @webpagelink","post_message":"Kristen Bell introduces Pinksourcing, where women are a bargain at the workplace, since you only have to pay them 77 cents on the dollar! It's the first episode of our new series, #CelebsHaveIssues."},{"comment_id":"773980632650962","commenter_b":"i cannot stand that woman","commenter_a":"Why don't you just all tell the truth and say \"he's a muslim that's why he didn't go\" it's like anyone would do anything about it!","post_message":"Very painful to watch."},{"comment_id":"1028049810606008","commenter_b":"This evil witch should spend The rest of her life in a solitary jail cell without food or water for all the evil she has perpetrated on this country!!!","commenter_a":"Softball questions","post_message":"She's totally cooperative! And yet she won't talk to investigators. Why? Wait until you see how she tries to explain this one away."},{"comment_id":"1737893789788061","commenter_b":"HE LIST THEM ALL WITH NAFTA AND BANK DEREGULATION TRY AND LEARN TRUE HISTORY.","commenter_a":"he has a great track record on creating jobs, just not in the USA","post_message":"Hillary Clinton is making plans for the future."},{"comment_id":"10153047601521336","commenter_b":"how many lawyers have been sent to \"find dirt\" on her, like they did with Sarah? can you imagine Sarah debating this heifer on live t.v.?","commenter_a":"Well of course they didn't find anything. You never had anything interesting to say.","post_message":"\"Will they put the same effort into her emails as they did mine?\"  Former Alaska Gov. Sarah Palin thinks the media should hold Hillary Clinton to the same standard to which they held her over access to emails. What do you think?"},{"comment_id":"10153138369757293","commenter_b":"freedom of religions","commenter_a":"Delaney Lynch","post_message":"“To be the first person to touch something that’s been lost for 300 years is a magical experience.”"}]
