[{"comment_id":"968036809901222","commenter_b":"Take the criminals away first","commenter_a":"FAST & FURIOUS ???","post_message":"This is one of those times where a picture is worth a 1,000 words!"},{"comment_id":"502394676575976","commenter_b":"I wonder if she's inbred?","commenter_a":"Stay classy, Penny. Fucking troll bitch.","post_message":"Today's fan mail."},{"comment_id":"1257627894274548","commenter_b":"NEVER Hillary!","commenter_a":"It's really quite a disgrace that The Ben Howe Show would've released this right before the election. This clearly shows who he's in the tank for. There's absolutely no reason for this nonsense. He does realize he could've made a three-part documentary on the 'sociopath' Hillary Clinton, right? Worse yet, her scandals are writing themselves as we speak.","post_message":"“I believe that what happens after this election will define the future more than the election itself.”"},{"comment_id":"10152783930412293","commenter_b":"Tom terrorist deserve to be pooped on and have there have there heads cut off","commenter_a":"I could hv done the same thing..those animals hv no respect for life so u respect them in death?","post_message":"The story of a Marine sniper, dead at 28, and the 38-second video clip that became part of his legacy."},{"comment_id":"766779530124121","commenter_b":"Vile woman","commenter_a":"LUCIFER CAN just go Home--The party is over--GOD BLESS AMERICA","post_message":"Thank you Indianapolis for the welcome. #ChooseCruz tomorrow: @webpagelink"},{"comment_id":"10152891097411491","commenter_b":"and because China is seizing Australian colonial territories in Antarctica which is morally wrong","commenter_a":"Asia is Asia, for the ASIANS. Why do we have to stick our noses in EVERYWHERE???? No wonder the U.S. is hated by so many countries.","post_message":"A historic debate over trade is now heating up in Washington."},{"comment_id":"10153445196113984","commenter_b":"She has no right to control any thing!","commenter_a":"Not only does she not have any class, she is ugly and gross! I do not care if she is republican or democrat she is just nasty!","post_message":"This has to be very embarrassing for the First Lady. Hopefully this doesn't make her try even harder to control Americans...  Do you think Michelle Obama as First Lady is bad for America?"}]
