[{"comment_id":"10152622903648067","commenter_b":"POLICE and MILITARY are made up of FALLIBLE HUMANS......some FALLIBLE humans do HIDEOUS things and then hide behind the BADGE!!! Those that do such things deserve to be OUTTED","commenter_a":"When they stop waging war against the Police and Military maybe I'll get behind the group... until then. They're a bunch of punks living in their moms basement, blaming everyone else for their problems.","post_message":"\"We, Anonymous around the world, have decided to declare war on you, the terrorists,\" the hackers said in a YouTube video. @webpagelink"},{"comment_id":"998045550284803","commenter_b":"i i think trump should have an abortion and have his you know w hat removed along with his tongue","commenter_a":"Is he going to waterboard women too?","post_message":"BREAKING:"},{"comment_id":"10154816797908812","commenter_b":"There's a pattern here Trump women seem to be dumber than crash dummy's","commenter_a":"She means softer because he hasn't had as many scandals and the extent of those scandals would be scary enough facing the press. I would definitely start coughing if I were in her shoes...she could pretend to faint again just as the van arrives and that way she can be saved from her own embarrassing actions. Being held accountable to the public is not in her best interest.","post_message":"The Trump campaign’s major concern: The candidate’s limited preparation. The Clinton camp’s biggest worry: That Donald J. Trump will be asked softer questions than Hillary Clinton."},{"comment_id":"10153157541959641","commenter_b":"Yes Dilma get the hell out!","commenter_a":"protests? you can't never even think about it ! if you join to a manifestation group you can get killed or lose your job if you be an influent person , you can get bribed and many people are shut because of these reasons this is the message that we've been received from our fathers the message has been transmitted from generations to generations a message of fear were the law is to rule the poor .","post_message":"Hundreds of thousands marched in Sao Paulo, Brazil, with one message for President Dilma Rousseff: Get out. cnn.it/1ynM33B"},{"comment_id":"10156643152565354","commenter_b":"Looks like a bad week for the Hollywood elites. He and Jada can cry on each other's shoulders. Just goes to show you that living in a mansion in Beverly Hills, riding in chauffeured limos, traveling the world and having the best of everything, still doesn't make these people happy. Pitiful!","commenter_a":"Booob!!!","post_message":"BAHAHAHA!"},{"comment_id":"10153686038898984","commenter_b":"DO NOT PASS GO....DO NOT COLLECT ANY MORE OF OUR MONEY......GO DIRECTLY TO JAIL....GITMO.......HOPEFULLY....barack HUSSEIN ......WILL FOLLOW !!!!","commenter_a":"YES!","post_message":"Wow. It looks like winning the presidency is about to become the last thing on Hillary's mind... Do you think Hillary should be indicted?"},{"comment_id":"1369581076434970","commenter_b":"Stay on your meds lady","commenter_a":"If you go and read her fb page you will see this is FALSE reporting.","post_message":"Sinead O'Connor has 'threatened to jump off a bridge'"}]
