[{"comment_id":"10154205031258701","commenter_b":"You are clueless chickie....","commenter_a":"Seriously people, faulting the girl for not reporting! It's a small town good-old-boy system. You really think the police chief would arrest his good friend? They were probably laughing about it. Since she went public she is being harassed. Small town politics...","post_message":"A probable cause affidavit states he exposed himself to a female employee at Flowers 'N Fluff at least twice a week for at least two years."},{"comment_id":"935042419864513","commenter_b":"Our borders have never been as bad as they are now. Obama is to blame for that! You never hear about it on the news either. I have family in the South and they say it's scary whst is coming into our country right now illegally.","commenter_a":"Good going trump lets get started right now throw Obama in jail and you can take over tonight","post_message":"Donald Trump's announcement is something we've never seen in history!  This is HUGE!"},{"comment_id":"10152594766464071","commenter_b":"Why do men think big boobs mean fat?","commenter_a":"Don't be fat. Problem solved.","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."},{"comment_id":"1695743490702170","commenter_b":"'@username Hillary should be in Prison!!!!","commenter_a":"I'm 18 years old. This will be my first election to vote in. I'm proud to say that I am supporting Donald Trump! Save my generation, Donald! #MakeAmericaGreatAgain","post_message":"I want to win for the people of this great country. The only people I will owe are the voters. The media, special interests, and lobbyists are all trying to stop me. We won't let that happen! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"1296455407059683","commenter_b":"No they should be given sentences building the wall then deported for ever","commenter_a":"Agree","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"495708673953046","commenter_b":"A Bullet to the head! No need to play nurse maid to this POS!","commenter_a":"shitbum","post_message":"This thug thought he was tough, not so tough now.   Good, he got exactly what he deserved. He is scum.  Do you agree all thugs should be deported?"},{"comment_id":"10152741444625950","commenter_b":"Well ladies, the Navy Seals BUDS training awaits you . You'll both cry, bitch, and quit within hours.","commenter_a":"I'd be scared too. It's simple - woman are NOT AS STRONG as men. It's a fact and when your dealing with the most dangerous and physically demanding covery ops - woman need not apply.","post_message":"Men in U.S. special operations forces don't think women can meet the physical and mental demands of their commando jobs, according to the survey."}]
