[{"comment_id":"991210200940830","commenter_b":"DUMB-DUMB-DUMB WOMAN","commenter_a":"What a ghastly hag!","post_message":"She's not the only woman to make such a painfully ignorant comment. Just last week, a German Mayor made a very similar remark. Click here to read what she had to say about Muslim immigrant rapists, and how women in Germany can prevent rape: @webpagelink"},{"comment_id":"542901459225067","commenter_b":"Go Hillary !","commenter_a":"She is honest and I am tired of people accusing her of everything when she has been for the USA since Clinton was President and after that, etc. She loves her country and will be an excellent President. Grow up world!","post_message":"The people of Iowa versus pollsters and pundits. The people win."},{"comment_id":"10153369790181770","commenter_b":"SHES A WITCH!!!","commenter_a":"hillary is an idiot , how could anyone vote for someone so evil, she has to be stopped","post_message":"Clinton thinks everything is fantastic at the U.S.-Mexico border."},{"comment_id":"1121854401168903","commenter_b":"Stfu fat bitch","commenter_a":"Is it because they're assholes?","post_message":"They spend their lives eating rotten meat - so why don't they get sick?"},{"comment_id":"559222970918198","commenter_b":"#WomenForTrump","commenter_a":"Wow, I worked for two presidential campaigns, also as a journalist covering campaigns and in the White House. If I had a dollar for every time I was pushed, grabbed or shoved. Campaign events are feeding frenzies, if you're a reporter covering a campaign event and you don't get pushed around a lot, literally, then you're not cut out for the job. It's par for the course! Thousands of people show up at campaign events and everyone is pushing and shoving to get a piece of the candidate and their staff has a duty to protect the candidate. I was in the White House in the Oval Office with the press pool one time and an aide or SS agent pushed me after I got too close to then Vice President Dick Cheney. It never even crossed my mind to file assault charges. If you watch the video, you can ...","post_message":"\"The culture of this campaign is – as Mr. Trump mentioned from the very beginning – it's not politically correct, and sometimes telling the truth inherently is belligerent.\" Trump campaign spokesperson Katrina Pierson defended campaign manager Corey Lewandowski, saying the incident \"is a '#NeverTrump' idea.\""},{"comment_id":"602171783246943","commenter_b":"I think he is a prick he makeing the country he inn charge with killing off his own people as black. And look at what they saying on here about him he needs to send two b52 bombers and carpet bomb all these evil peope o. Here calling him names lol","commenter_a":"I'm ready!","post_message":"\"The American People must be willing to call Barack Obama what He is in order to Defeat Him\""},{"comment_id":"10153151151584330","commenter_b":"... what does this have to do with this news story?","commenter_a":"Mental illness on the rise. We need to open state mental institutions Nd not close them down. Poor people have no where to turn to and it can effect the innocent.","post_message":"BREAKING: A person died after being hit by a train in Fairfield. Train service in the area has been disrupted --> @webpagelink"}]
