[{"comment_id":"10152991778321336","commenter_b":"Illegal aliens beau","commenter_a":"scary stuff","post_message":"More than 100 patients may have been exposed to a potentially deadly \"superbug\" at the Ronald Reagan UCLA Medical Center."},{"comment_id":"10153099040499726","commenter_b":"I'd like to get rid of your ass.","commenter_a":"Just another lie.","post_message":"WATCH: Democratic Representative: 'Tea Party People' Want To Bring Back Segregation, Get Rid Of Women's Rights."},{"comment_id":"1763955337222403","commenter_b":"Women over 65 don't have to wear them...lol","commenter_a":"If there was a young Muslim man in America...and Donald Trump was elected by popular vote to pass hateful laws against Muslims...How easy would it be to radicalize them against a nation that has rejected them? Trump is exactly what ISIS wants.","post_message":"Donald J. Trump campaign chair Paul Manafort fired back after President Obama said the New York billionaire's comments about Islam are \"ultimately helping do ISIL's work.\"  @webpagelink"},{"comment_id":"1311803105524589","commenter_b":"Bryan Gogg Citation? I didn't think so. The SS never comments on such things.","commenter_a":"I will not shed one tear for any faithless elector that ends up suffering grave consequences.","post_message":"This is about to be all over the news, folks."},{"comment_id":"10157959432550354","commenter_b":"She belongs in prison. Trump for all Americans","commenter_a":"Poor behavior is poor behavior, no matter who does it! Teachers are now reporting a sharp rise in bullying and rude talking out and racist comments directed at other children after Trump began his campaign. If you are acting like an idiotic, alt-right Trump supporter at home, your children are seeing and hearing this and thinking this is how people should act. Stop it now! You are creating a whole new generation of haters.","post_message":"\"I believe they were paid to come attack Trump supporters.”"},{"comment_id":"10152889547313299","commenter_b":"I thought I could not dislike this so called woman any more than I do, but, taking a disabled parking spot is outrageous!!! Did she get a fine? Everyone else would have. Do you really want to see this self-centered, rule breaking murderer as president???","commenter_a":"Hilliary is entitled to be queen and all the common people are her court. she can be charming but she's Danger with a capital Dl . she is deceptive with a capital D and isn't that strange Democrats. Is a capital D too","post_message":"Hillary Parks in Handicap Spot ... @webpagelink"},{"comment_id":"10154031292643132","commenter_b":"She still looks like a dude","commenter_a":"Good for her! She took care of herself, had a HEALTHY weight gain, and gets to enjoy the results.","post_message":"It's hard to believe this is just after ONE week!"}]
