[{"comment_id":"10153163966344255","commenter_b":"Where my confusion comes in is most people don't trust the government with their money but they will trust it with their children's lives....","commenter_a":"See fellow liberals? This is the fanatic pro-vaxxers showing their true face. Fascist totalitarianism. Hitler and Mengele would be proud of the folks signing this petition. These are not liberals. These are corporate thugs in disguise using liberal forums like @username to try to convince us that the pro-vax position is the smart, scientific , modern one and that vax-skeptics are a bunch of right wing anti-science fundamentalist boneheads. Its simply not the case. The real smart folk can see right thru this Big Lie that all vaccines are perfectly safe. They clearly are not. And most of us do not want to ban vaccines as they would have you believe. We just want safer vaccines, common sense, and for folks to see both sides of the scientific debate. And yes, vax fanatics, there IS a scientific debate.","post_message":"Public health must trump parental choice. Tell your governor to introduce legislation to ban all belief-based vaccination exemptions."},{"comment_id":"998702053501364","commenter_b":"Prison. He can still rape again without a tongue.","commenter_a":"Jail the bastard","post_message":"He lost his tongue. Is that punishment enough or should he go to jail as well? [Read below]"},{"comment_id":"1071771339501789","commenter_b":"@username Blacks are Americans, so are whites on assistance, and American Latinos. I would rather support 20 million of them than 1 illegal Anchor baby and it's Family. Maybe all those Americans on assistance wouldn't need assistance if the illegals weren't taking the jobs Americans need.","commenter_a":"My mother was a volunteer Pink Lady at the hospital in Weslaco Texas and she verified several times to me that Latinos routinely arrived in labor so they had no time to get back to Mexico. They wanted their babies born in America.","post_message":"Astonishing video proving Donald J. Trump is right... Ten percent of the people born in America today are to children of illegal aliens..."},{"comment_id":"1551325111574622","commenter_b":"This is HER country.","commenter_a":"Now do we really care what this looney tune thinks or if she accepts Trump...if she does not accept him....send her out of the country!","post_message":"No one could have said this better."},{"comment_id":"1008697665856648","commenter_b":"Deport them now ,let them go to enjoy Saudi Arabia!","commenter_a":"GOOD the muslims have NO right to tell others what to do and what not to do and no one has any right to attack anyone over an imagined religious superitory","post_message":"In protest, hundreds are posting photos of themselves wearing swimsuits in public places"},{"comment_id":"647292048744709","commenter_b":"Only think Muslim country doesnt provide is Security Reason for us to move USA !","commenter_a":"There is a renewed campaign that's getting a lot of attention to get the Equal Rights Amendment (ERA) into the U.S. Constitution. Many candidates talk about their support for fair treatment of women, and this amendment would provide a fundamental guarantee of equal rights. If elected, will you actively support the ERA? #GOPDebate","post_message":"Don Lemon is taking you through the latest in Facebook trends ahead of tonight's #GOPDebate. Have questions? Ask him anything!"},{"comment_id":"10153270653234091","commenter_b":"It should of been called player interference he did not slide with intent to advance to 2nd his sole purpose was to take out the 2nd baseman and break up a double play you can call it dirty call it aggressive I believe the rule says you have to start your slide before you reach the base and that he did not do . With all the new rules to protect the catchers and collisions at the plate this is no different . I believe he should be suspended . Unless you want the benches to clear every time he comes up to hit","commenter_a":"Here are the rules! Evidently, the umps didn't get that memo!!!","post_message":"UNDER REVIEW: Major League Baseball executive Joe Torre will review last night's controversial slide by the Dodgers Chase Utley that broke the leg of Mets shortstop Ruben Tejada for possible disciplinary action. What are your thoughts about the play? Read more: @webpagelink"}]
