[{"comment_id":"10154110456411337","commenter_b":"Why are they anonymous?? Staying unknown seems cowardly... Bunch of bullies. Be open about it if that's what they feel and think....","commenter_a":"Erica Rudolph","post_message":"TOTAL WAR: Things are getting really ugly between Anonymous and Donald Trump."},{"comment_id":"1824233217832680","commenter_b":"Yep! I saw what DT paid for in this campaign, thousands and thousands of his campaign signs , thru WV, Ohio, Mi. Drove it many times from NC due to a deaths in my family. I couldn't believe how many I saw and where they were. Really in the oddest of places too. Someone was paid to put them up.","commenter_a":"I love my Affordable health Care, it has saved my life. It's very important to have coverage for everyone in our country. You never know when you my need it. The health care conglomerate has made it expensive, big Pharm etc..etc.. not OUR President! What he did was great for this nation, and yes I would tweak a few things but all-in-all we need this for a healthy people!","post_message":"Your experience with the Affordable Care Act? #ACA"},{"comment_id":"10152956998151051","commenter_b":"Good! Send her ass to prison!","commenter_a":"Good","post_message":"Remember the veterinarian who got fired after doing this to a cat? Well, she just got some more bad news."},{"comment_id":"369671676554460","commenter_b":"Of course we pay for her boobs because we pay for all the boos in Washington","commenter_a":"This is disgusting and she should be kicked out in the cold! Taxpayers pay for this fraud nd sh should be removd from all social welfare programs! He doctor should never be able to bill this type of fraud.","post_message":"This Parasite... Unbelievable."},{"comment_id":"10153852965454705","commenter_b":"She's a liability. Period. I wouldn't let someone like that work for me.","commenter_a":"She worked too hard to become a doctor to get fired, she should do community service and pay a fine and formally apologize to the Uber driver. We've all done/said stupid things while drunk.","post_message":"An internal investigation will determine any disciplinary action, including possible termination."},{"comment_id":"1168788129800109","commenter_b":"******TRUMP..... 2016 **** DESTROY ISLAM AMEN....pass the ammo \"SWIPER NO SWIPING\" *no illegals voting Quote..DORA THE EXPLORER *BLACK LIVES MuRDER ...jokes","commenter_a":"Lol She should have to wear a lie detector at all time....that zaps her when she fibbs","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"},{"comment_id":"1818799778404105","commenter_b":"It is time for a woman president peeps..........this is not the woman.","commenter_a":"She may have one the debate, but America lost in this Presidential election","post_message":"Join Hillary live in North Carolina for her first rally since winning last night's debate → IWillVote.com"}]
