[{"comment_id":"10154194875640009","commenter_b":"This woman is a black retard, like the retarded black guy that was standing behind her when she spoke about the Kremlin invading KOREA. You let goofballs like this in a leadership position, you'll get a 3rd world country.","commenter_a":"the poor that is","post_message":"ICYMI"},{"comment_id":"1546996122269558","commenter_b":"They should kill all the illegal immigrants.","commenter_a":"Cute he Looks Like A Real nice Guy?? Surprised Yo Mama Didn't pardon Him","post_message":"Texas Executes Illegal Immigrant Murderer, Despite Protests From Mexico. Good riddance. The world will be a better place. Do you think he deserved the death sentence?"},{"comment_id":"10153153729864726","commenter_b":"your mother is white your white bunch of zebras in the white house","commenter_a":"what an ass","post_message":"WATCH: Michelle Obama's mom admits she is worried about mixing races and is glad Barack Obama isn't completely white!"},{"comment_id":"1290711880990755","commenter_b":"S'il pouvait balayer trump , ca ne serait pas un luxe !!","commenter_a":"SUS!","post_message":"I have been criticized for saying this, so let me say it again: I believe health care should be a right for all people, not a privilege."},{"comment_id":"10153511380259641","commenter_b":"I can't believe some of the comments here - So much hate {that's not justified} :/","commenter_a":"RIP the old England, lost to Islam now.","post_message":"#TBT:"},{"comment_id":"1002116393141873","commenter_b":"I wonder if Muslim women can cover their faces at protests with the new anti-mask protest law?","commenter_a":"Does this mean people can wear the banned Anonymous mask to the citizenship oath ceremony?","post_message":"Developing"},{"comment_id":"10153678111551336","commenter_b":"She is by not following the law set by the Government an trying to impose her stupid religious beliefs on ppl!","commenter_a":"Good for her. Find a different job then","post_message":"\"Her whole objection is that she doesn't want to be party to something that violates her orthodox religious views.\" – Tony Perkins, president of the Family Research Council"}]
