[{"comment_id":"10153459873801756","commenter_b":"She's a Jew deliberately provoking hatred between Christians and Muslims.. Ask yourself why...","commenter_a":"I have to say I thought more people would be for protecting speech from violence, since we're in the liberal west and all, but apparently not. Paris gets shot up and the claim is to be 'je suis charlie,' Texas gets shot up and 'they were asking for it.' Makes no damn sense. You're either for the rights of us all to speak without fear of being shot, or you're not. I went to a public school and I learned that Voltaire quote. Small minded terrorists of an idiot ideology that requires giving your life to kill anyone who mocks your 'sacred' beliefs. What a load of bullshit.","post_message":"The group's executive director runs a website called Atlas Shrugs, which The New York Times says 'attacks Islam with a rhetoric venomous enough that PayPal at one point branded it a hate site.'"},{"comment_id":"10153866172049411","commenter_b":"Jews can suck a dick","commenter_a":"Satanism and Islam are the same thing","post_message":"dudes have offered to escort Muslims and Sikhs afraid of hate-attacks for groceries and elsewhere."},{"comment_id":"10154136218409384","commenter_b":"She's just the best, go home to your expensive home and shut up...","commenter_a":"Everyone should see the damage that democrat loal gov't can do.","post_message":"It was my privilege to call to order House Democrats' hearing on the Flint Water Crisis. In an American city, thousands and thousands of children have been drinking and bathing in poisonous water for more than a year. It was not an unavoidable natural disaster. It is a man-made catastrophe. Now, thousands of children are at risk of lifelong damage from lead exposure – unless we help get them the care, attention and resources they need. We have a responsibility to help the people of Flint tell their story – and to be sure that story is heard loud and clear in the halls of Congress. The story of Flint challenges the conscience of America. It holds lessons and warnings for communities across the country."},{"comment_id":"1702389236690262","commenter_b":"#NRAWhore","commenter_a":"Screaming about process that eliminates the ability to make progress is criminal.","post_message":"The sit-in by House Democrats is nothing more than a publicity stunt. The bill they're talking about was already defeated in the United States Senate. It's time for them to #StopTheStunt."},{"comment_id":"1072808739397262","commenter_b":"Oppression? You are way off base here. It is oppressive to want it to be 1959. Here is the bottom line. Do what you want but you don't get others to do what your religious Far right cult says. And I am a Christian.","commenter_a":"Alas...another unintended consequence of liberalism. In their quest to 'help' people, they made them worse off. To correct their unintended consequence, what will liberals recommend? They will recommend coercing the college into providing the students with birth control... And class...this is another example of liberalism leading to oppression...","post_message":"What would Jesus do?"},{"comment_id":"10153584880961336","commenter_b":"'@username , IT should be ALL who are here illegally as they ALL have committted a crime by INVADING this country","commenter_a":"So, let me get this strait... Trump is going to deport all immigrants, and take away citizenship from persons naturalized in the United States....That is going to be a lot of deportation since we all have immigrant backgrounds so who is going to check the Family Trees to see how far it goes back..... and who's going to be the 'Gate Keeper'.... I wonder if Trump will also deport himself and his family as well or he planning on being the only person left in America....","post_message":"Donald J. Trump pledges to eliminate the 'biggest magnet' for illegal immigration by ending birthright citizenship for the children of illegal immigrants. @webpagelink"},{"comment_id":"10153460799391130","commenter_b":"When bitch steals ur face 😠","commenter_a":"Alyse Kozis @username - she makes one of your faces Karlie 😂😂","post_message":"Instagram's @Daddyissues_ hilariously meme-ifies herself."}]
