[{"comment_id":"10153438882926130","commenter_b":"That's rape !!! Lmfao !!!! Jk","commenter_a":"I am a Viking woman. I don't play any games when it comes to sex. I don't try to look sexy when I want it. I go up to my man and take it.","post_message":"Terry Crews completed a \"90-day sex fast\" with his wife and it left him \"more in love\" and \"more turned on\" than ever."},{"comment_id":"522092037950751","commenter_b":"Lol Uriah Bahl. Bitch","commenter_a":"Fuck these ingins","post_message":"\"It's a tiny community of [about 1,000] people taking on the federal government of Canada and three multi-billion dollar energy companies — opponents with virtually unlimited resources.\""},{"comment_id":"10154733856841509","commenter_b":"Hillary is a farce ridding on husbands shirt tails belongs in the kitchen not in the White House. She is a joke","commenter_a":"Trump says He's gonna make america great again but what he is actually doing is just taking all you idiots back in time and starting war and being racist again. He's kicking protestors out of the rally and saying \"All lives matter\" well then why are you kicking them? Trump's supporters are uneducated and racist as he is. Trump shames America's name. I dont really have a right to say all this since i haven't changed my nationality but i had to spit them words out as an American resident.","post_message":"CNN projects Hillary Clinton will win Maryland; Donald J. Trump will win Connecticut, Maryland and Pennsylvania. @webpagelink #SuperTuesday"},{"comment_id":"10154176687291337","commenter_b":"Good now the bitch dont have a job...now go get that unemployment check","commenter_a":"Freedom of speech, freedom of press, wwlcro American land of lies","post_message":"YIKES! Terrible move by this anchor..."},{"comment_id":"10154216584759203","commenter_b":"Ivory towers allow a lot of false logic. She'll just fly away to her mansion. No skin off her nose.","commenter_a":"I thought, \"Well she is on with Bill Maher. Lets see how she explains this away. And all she did was lie. She said she simply said yada and the people who were complaining didn't see the interview. Well I saw the interview and she lied. Not to be undone though, after a few minutes with Bill Maher, she actually showed her true colors and did admit what she believes. Then to top it off, as soon as Bill Maher brought up their support for Ralph Nader, which cost the country GW Bush and millions of lives, she simply interrupted, pivoted and changed the subject. She is a horrible human being and I wouldn't watch another movie with her in it on a bet...even if she does have the best rack of any 70 year old(Oct) I've seen.","post_message":"Susan Sarandon found herself in the hot seat Friday night."},{"comment_id":"10155018398498258","commenter_b":"Who cares She is not that important anyway","commenter_a":"When they go low , we go high","post_message":"Congresswoman Katherine Clark is breaking from tradition to protest Donald J. Trump by boycotting his inauguration."},{"comment_id":"10153085951882507","commenter_b":"no problem at all, as long as the part of the ----> well regulated militia <------ is the main factor, and not as is current, --> any inbred psychopath can buy any number of military grade weapons and high capacity magazine and then proceed to walk into restaurants with them.","commenter_a":"So this of course applies to second amendment rights also, correct?","post_message":""}]
