[{"comment_id":"1346208208805563","commenter_b":"@username If you can even get in to see the surgeon!","commenter_a":"Its funny cause in Mexico, the full of thugs and criminals and rapists Mexico you can get major surgeries for free. Yes you need to wait a few weeks but you do get it free if you pay your fee (about 8% of your salary goes for health, another 8% for retirement and house)","post_message":""},{"comment_id":"10152617466356680","commenter_b":"For those who want to deport, are the GOP taxpayers going to pick up the $50 billion tab? Dems won't because anyone with a brain knows the addition of these people into legal residency will boost our economy.","commenter_a":"Obama, siding with illegals against Americans, yes, Obama DOES NOT LOVE OUR COUNTRY.","post_message":"President Barack Obama is calling out John Boehner for not bringing comprehensive immigration reform up for a vote in the House last year."},{"comment_id":"894618207261542","commenter_b":"yes i reject it and this ass too","commenter_a":"YES.","post_message":"Where do you stand? Vote here and make your voice heard."},{"comment_id":"533308460200216","commenter_b":"If you are Gay, Why are you voting for Hillary when she wants to bring in thousands of refugees that believe all Gays should be executed? If you are Black, Why are you voting for Hillary when she admires Margaret Sanger and defends Planned Parenthood who want to abort as many black babies as possible? Exterminate the black race because they are like \"weeds\". (Margaret Sanger quote) Most of those clinics are in Black neighborhoods. If you are a Christian, Why are you voting for Hillary Clinton when she wrote her Senior thesis on Saul Alinsky who dedicated his book 'Rules for Radicals' to Lucifer (the Devil)? She says he was, and still is her mentor. If you are a Veteran, in the Military, or closely related to a Military member, Why are you voting for Hillary when she left those men to die in Benghazi and had the nerve ...","commenter_a":"Why can't we have all candidates for a debate? 1-2% should be enough for them to take the stage. Do you guys agree?","post_message":"What questions do you have about the elections? We're in CNN's Election Center with CNN Politics Executive Editor Rachel Smolkin and Political Director David Chalian. #CNNElection #ElectionDay"},{"comment_id":"467441413380453","commenter_b":"I've got a great idea! Let's send all the illegals to Italy! Who agrees with me?","commenter_a":"NO!!!Go home and support your own People!","post_message":"A five-year-old hands Pope Francis a letter asking him for help in preventing her parents from being deported. The Pope is calling for Christian support for all immigrants, both legal and illegal. Do you agree?"},{"comment_id":"10153888628981336","commenter_b":"@username - your brain is a mulsim! SHUT ALL \"DOORS\"!! KILL ALL muslim islams!! The only people who hate Trump are the illegals, anchor babies, muslims! Again, I ask, which one are you or are you all three? I demand to block ALL ILLEGAL aliens; muslim islams, to PROTECT OUR borders! Then IMPEACH obama blammer mouth!","commenter_a":"Obama can't help it. His father was a Muslim, not an American. His allegiance is pretty clear.","post_message":"Yesterday on \"America's News Headquarters,\" Mike Huckabee shared his perspective in light of the #SanBernardino terror attack."},{"comment_id":"636474266540179","commenter_b":"She's an idiot!!","commenter_a":"I watched her speech on the live stream and was absolutely blown away. Credit is definitely due to the writer, but Ashley's delivery was perfect. The emotion as well as strength behind those words brought tears to my eyes!","post_message":" am nasty like Susan, Elizabeth, Eleanor, Amelia, Rosa, Gloria, Condoleezza, Sonia, Malala, Michelle, Hillary! Ashley Judd at the Women's March on Washington"}]
