[{"comment_id":"1525021640848139","commenter_b":"Connie your argument makes no logical sense. You can't have it both ways. There are no voter suppression laws. Requiring an id is not voter suppression.","commenter_a":"Where was all your outrage over the treasonous Clinton pay for play entanglements? This page is so ridiculous","post_message":"Trump's not going to like this one bit!"},{"comment_id":"10152883747411051","commenter_b":"Feel attractive and beautiful? Get out. So a 16 or 18 year old kid gave her that? Sick. Lock her ass up.","commenter_a":"Just wait","post_message":"A teacher who was busted with not one, not two, not three, but four students is now looking at a lot more jail time than she initially realized."},{"comment_id":"10152843284606519","commenter_b":"How about you pay for your own? Why do I and the rest of the taxpayers have to pay for you losers? Stop being a fucking whore or just swallow next. time. Cum guzzling gutter slut sounds about right.","commenter_a":"400 million dollars plus the tax payers have paid to keep Planned Parenthood in operation. I understand it is cheaper to kill the child then pay for it in the form of welfare, Medicaid, HUD and food stamps. 56 million have been dismembered in the womb thus far. My question is where did the idea of the taxpayers paying for people's mistakes come from? Why should I be obligated to pay for other's mistakes? I am not and neither are any taxpayers. You fucked, you knew the results of fucking without birth control....fuck you and your offspring.","post_message":"\"I believe that abortion care is a positive social good. I suspect that a lot of other people secretly believe the same thing. And I think it’s time we said so.\""},{"comment_id":"868758169887103","commenter_b":"crying about the NRA , every lobbying groups receives money from those they represent . Guns sell themselves , new models fly off the shelves and gun stores hardly discount. Women are one of the fastest group of gun owners in the country .Many single mothers and single women carry weapons , it is the best defense . Many women have stopped harassment , rape or assault because they were armed, weapon is often never fired .","commenter_a":"If you read the article, it sounds as if alcohol should be banned from campus. What the article does not say, is you still need to be 21 to legally have a handgun. That and you would still need your concealed carry permit. Concealed carriers are as a group less likely to commit crimes than even the police. Ever time carry options get more loose, liberals cry the streets will run red with blood, but the reality is just the opposite.","post_message":"These bills are moving through state legislatures across the country - here's what you need to know."},{"comment_id":"10153367144158352","commenter_b":"Wow she's a fool!!","commenter_a":"WTF IS WRONG WITH ALL THESE CRAZY ASS PEOPLE IN FLORIDA!!! All these stories lately have been about people in FL just like the mom who made her child jump out 2nd story, there's been a shit load of crazies hitting the headlines recently","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"},{"comment_id":"1806403532965541","commenter_b":"She's a hawk. And trump's an isolationist. So who's weak?","commenter_a":"Hillary Clinton must be stopped at all costs. Or watch more and more Americans Die under her weak administration","post_message":"Live: Donald J. Trump gives a speech on veterans' issues in Virginia Beach, VA."},{"comment_id":"963644947039340","commenter_b":"But she is dirty","commenter_a":"She knows women's issues best","post_message":"Watch live as Hillary talks to students at New England College in New Hampshire about the issues on their minds."}]
