[{"comment_id":"10153142074684030","commenter_b":"Apparently all the men do. Lol. I've never heard of her","commenter_a":"I love Natasha Leggero!","post_message":"The Bieber roasters get a geography lesson from Natasha Leggero. The #BieberRoast premieres Monday, March 30 at 10/9c."},{"comment_id":"976708829015963","commenter_b":"If we could only get rid of Wynne and get 3 new federal candidates","commenter_a":"The whole country needs to come to grips and be honest with ourselves...Canada can and must do much better than we did over the past ten years!","post_message":"She's not holding back."},{"comment_id":"10153862948491523","commenter_b":"You think women put these objects in themselves? This was a product recommended and approved by from their doctors. STFU","commenter_a":"Stop putting foreign objects in your body!","post_message":"Some of the women experiencing adverse affects from Essure are relieved to get hysterectomies to get the coils out."},{"comment_id":"10153817478256320","commenter_b":"@username he will never be a woman","commenter_a":"Um. No. Besides i hear she doesnt even want to be a woman anymore.","post_message":"Happy Birthday!  Caitlyn Jenner celebrates what she considers to be her 'first birthday.'"},{"comment_id":"1099042766785437","commenter_b":"Glad she got her life back by killing another person. Ain't life grand!!","commenter_a":"You make me ashamed to be a woman, disgusting","post_message":"She got her life back at the expense of another."},{"comment_id":"1260466927330937","commenter_b":"@username agreed! She's a fecking CRIMINAL... PERIOD!","commenter_a":"Watergate would be jaywalking compared to the Clinton scandals","post_message":"Rudy Giuliani claims the Clinton Foundation scandal will be \"bigger than Watergate.\" Do you think there is truth to what he is saying?"},{"comment_id":"10153436699476337","commenter_b":"Yea and he's got a fake pussy.","commenter_a":"No one here read the article did they? She's not being called out for being a white NAACP supporter or for \"not being black enough\", she's being called out for lying about being black. She's totally not black at all. She's a white woman pretending to be black saying that she grew up poor, black, and racially profiled. When she wasn't. At all. -_-,","post_message":"HOW DOES THIS HAPPEN? Is this NAACP leader pretending to be black? Many on the Internet certainly think so..."}]
