[{"comment_id":"10153238433806782","commenter_b":"So you have no problem sharing a restroom with men? That's not how I perceive most women feel","commenter_a":"Oh for Pete's sake, does government really belong in the restroom???? Work on something that really matters! Schools, roads, infrastructure, the things government does belong. Are you going to post guards in every bathroom and have to check your 'plumbing' to see what you are equipped with to make sure you are going to right one???","post_message":"A similar bill was filed in Oklahoma: @webpagelink"},{"comment_id":"1765071860379740","commenter_b":"damn elizabeth coming out swinging","commenter_a":"That was EXACTLY what happened to another person that was supposed to be deposed and speak out against the Clintons years ago, and was found three days later by the FBI after the guy missed his deposition:-(","post_message":"Do you think the Clinton's were involved in his death?"},{"comment_id":"503579846468637","commenter_b":"Why argue with this man child?","commenter_a":"Remember the outrage over the clock kid? Let us see if libtards and media worry so much about Christians being singled out to die.","post_message":"' He seemed skittish, always looking over his shoulder to see if anyone was watching.'"},{"comment_id":"10153101958805329","commenter_b":"I love that now it's called 'fat shaming.' She made a choice to eat healthy, work hard and raise her kid. What is wrong with that? Society is annoying sometimes.","commenter_a":"What it's bad is telling people what to fucking do!!!","post_message":"“I have a kid, a six pack and no excuse.”"},{"comment_id":"10155889196645354","commenter_b":"Trump that bitch!","commenter_a":"She has more wrinkles than my nuts. Americans are dumb enough to vote this tramp in.","post_message":"Short memory!"},{"comment_id":"10153875046907235","commenter_b":"So did Ollie North! The fuckery.......","commenter_a":"'Former United States Attorney general sold guns to drug cartels.'","post_message":"WHOA"},{"comment_id":"10154900824501037","commenter_b":"Obama is playing on Americans. He wants to play a nice guy. He knew all powers for executive orders has been striped off him. He wants to turned american workers against trump's adminstration. And gain cheap popularity from clueless workers. Obama's intentions for america is bad. this is just a cover up. Watch out. He will try something like this again even wen he knew that he doesn't have power to do so. Just to make names for himself n pave ways for his wife 2020. Am one person obama can't fool. All his doing is to put trump in a tight corner n make him look like a bad guy. His a hypocrite and no one shud take him serious. Hilary and obams wants to make sure that trump did not succeed.","commenter_a":"I hope this judge dies of pancreatic cancer.","post_message":"A devastating blow to one of Barack Obama's signature achievements for boosting wages."}]
