[{"comment_id":"10152577798681316","commenter_b":"A percentage will watch Hannity and cry. The rest are busy being free.","commenter_a":"LOL they said this in 1777","post_message":"Freedom hardly exists in America today, where a family man who helped people purify their water naturally now faces 37 years in prison. Read Daniel Smith's story and support his fight against the corrupt US justice system. @webpagelink"},{"comment_id":"1535105376549586","commenter_b":"We need to deport her ass","commenter_a":"Yes","post_message":"Do you think she deserved 7 months in jail for urinating on a war memorial?"},{"comment_id":"10153245155862550","commenter_b":"Candace, those who are offended by the American Flag can move!!! HAPPY INDEPENDENCE DAY Ladies!","commenter_a":"I hope they catch them...my ancestor is buried there. And who knows...some of those soldiers that they dishonored are probably non-white....my ancestor is NA. All lives matter....","post_message":"#BreakingNews Update: The Durham Police Department is investigating after a Confederate memorial in Maplewood Cemetery was vandalized.  More details here: @webpagelink"},{"comment_id":"927319353970153","commenter_b":"Who cares about whatever Sarah has to say....she's a nobody. Good grief !!","commenter_a":"BO doesn't care he's in office as a fraud perpetuating and feeding the muslime brotherhood on our dime","post_message":"HA HA!"},{"comment_id":"10154253853418967","commenter_b":"The only reason I stay on with these garbage gawker pages is to see the awesome Hogan memes.","commenter_a":"One Hulkamania isn't enough, Gawk ?","post_message":"The absurdity of Charles Harder threats should not distract from the underlying mission of the man who pays him: To intimidate Gawker and its reporters from publishing true things about public figures."},{"comment_id":"10153868198207994","commenter_b":"There is a need to protest because even though this vile cop has been charged, he hasn't been convicted. We know how sympathetic jurors are to police. Hell most of the people commenting here would probably find him not guilty. This is more than just one bad cop. This is institutional.","commenter_a":"I sure hope it don't escalade into a riot and looting, that's all Chicago needs","post_message":"Protesters are beginning to march in Chicago right now just after disturbing video of a white police officer shooting a black teen was released. CAUTION: Viewer discretion is advised."},{"comment_id":"10153227586230047","commenter_b":"He did the right thing","commenter_a":"No","post_message":"While serving overseas, Sergeant Martland intervened to protect a child from sexual abuse.  He deserves to be honored for this heroic action, not punished.     Sign and Share our petition to fully reinstate Sergeant Martland: @webpagelink"}]
