[{"comment_id":"529925163864730","commenter_b":"Kool","commenter_a":"This poor (morally) man reminds me of the KKK and how most whites were offended and embarrassed by them in the early 60's.","post_message":"Al Sharpton's career is going to come to a screeching halt after this.  His own people are turning against him. Now is the time to strike.  Can we get 30,000 'LIKES' for Al Sharpton getting fired?"},{"comment_id":"918834358153905","commenter_b":"It's not liberalism it's victimism. Justifing everything you do and tring to force others to change by acting like everything that happens is victimizing you","commenter_a":"Agreed.","post_message":"The latest COMMENTARY from Matt Walsh:"},{"comment_id":"10152850363352217","commenter_b":"Women should be allowed to wear what they want to. It should be a free world for men and WOMEN","commenter_a":"This is the silliest thing ever!","post_message":"Why two opposing campaigns about what women wear are spreading across the Arab world bbc.in/1LU4ka8"},{"comment_id":"10153301098933067","commenter_b":"Both ladies were very graceful","commenter_a":"Mr. Trump, you are really out of your ulo..... it was an honest mistake and it was acknowledged so, just move on..... better luck next time Miss Colombia... congratulations to all the contestants and the winners........ jmtc","post_message":"\"I'll tell you what I think I'd do. I think I'd make 'em a co-winner. It'd be very cool\" - Donald J. Trump @webpagelink"},{"comment_id":"1384307571620555","commenter_b":"I think this woman just swallowed her safety pin.! Lol .","commenter_a":"Grow up you he she","post_message":"Give it a rest..."},{"comment_id":"10153439688411130","commenter_b":"You just got owned by said library bitch lol","commenter_a":"It's going to be called little Debbie","post_message":"YAY!"},{"comment_id":"1229557370394944","commenter_b":"The GOP doesn't like it when the democrats do to them what they had been doing to the democrats since Obama was elected.","commenter_a":"Games. . .ugh! Both sides need to just stop them!","post_message":""}]
