[{"comment_id":"1610722349214878","commenter_b":"wow beautiful.......","commenter_a":"Beautiful","post_message":"Wow. I've got chills.  God is so good."},{"comment_id":"932260496814809","commenter_b":"You believe and listen to the \"man hating\" feminists which aren't a legitimate example of the feminist movement.","commenter_a":"Thank you. It's time the \"real\" (for lack of a better term) feminists become the majority over the \"man-hating\" feminists.","post_message":"It's so misunderstood, but they clear it up — by using the word 32 times. - Rebecca Eisenberg"},{"comment_id":"10153139193807377","commenter_b":"It's very hard to forget that he was voted in not only by the majority but by illegal aliens and dead people. Yes that's true, and just because he was voted in doesn't mean that there are more people who want him out of office. He is not a leader, he doesn't know foreign policies . Isis is his fault! He removed all our military from Afghanistan and the other countries. Had we stayed they would not be where they are today! Hellery Will follow obuma in his running this country, and if You think he is Bad you Haven't seen anything yet. Her lies and deceit hopefully will Take her out for Good. Do you know that more than likely he will Go down in history as one of the worse presidents in our country so you might rethink that statement.","commenter_a":"Why can't you impeach him? If the majority agrees that he needs to be impeached, so what are you waiting for?","post_message":"The top Republican lawmaker joined half of US state governors in urging President Barack Obama to suspend the scheme. Do you support Speaker Ryan's efforts on this? Vote Here: @webpagelink"},{"comment_id":"1216942571674495","commenter_b":"Deceitful lying criminal. God have mercy on those who vote for monster Hillary. She will destroy this country with her crimes.","commenter_a":"How telling!","post_message":"Hillary v. Hillary!"},{"comment_id":"1715971748670504","commenter_b":"@username is not clearly thinking. What the soldiers need and what is spent, often wastefully, through our War budget are two separate things.","commenter_a":"Increase. I bet everyone saying to decrease posts those names on veterans day saying how you support the military. Obama cut meals for troops in a war zone. SMH","post_message":"U.S. Military Size: Increase, Decrease or Stay the Same?"},{"comment_id":"10153181017133690","commenter_b":"Okay white terrorist","commenter_a":"Christian Terrorist","post_message":"\"This was not a dispute over a parking space, this was a hate crime,\" Mohammad Abu-Salha, the father of the two slain women, said. \"This man had picked on my daughter and her husband a couple of times before, and he talked with them with his gun in his belt. And they were uncomfortable with him, but they did not know he would go this far.\" @webpagelink"},{"comment_id":"1325297067482547","commenter_b":"Means nothing! That's why it took him so long to release it. It had to be all set up. Duh!","commenter_a":"Unfortunately not true. The BC was a. Latent forgery and Trump said before there were serious questions about it. He should have sidestepped the issue. Hillary always does.","post_message":"Trump senior communications adviser, Jason Miller, had said the issue already was closed, as far as Trump was concerned.   2011, Mr. Trump was finally able to bring this ugly incident to its conclusion by successfully compelling President Obama to release his birth certificate.  Miller statement continued,  successfully obtained President Obama birth certificate when others could not, Mr. Trump believes that President Obama was born in the United States.  He added, . Trump did a great service to the president and the country by bringing closure to the issue that Hillary Clinton and her team first raised."}]
