[{"comment_id":"1040857019285867","commenter_b":"Go back to Cuba shitstain.","commenter_a":" II Bill of Rights. A well-regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed........................ . MOLON LABE (Come And Take Them). Obama, you pussy, from my cold dead hand!. . \"A well-regulated militia being necessary to the security of a free state, the right of the people to keep and bear arms shall not be infringed.\" \"I ask, sir, what is the militia? It is the whole people, except for a few public officials.\" George Mason, in Debates in Virginia Convention on Ratification of the Constitution, Elliot, Vol. 3, June 16, 1788.. NOT ONE of the new obama regulations will prevent a terrorist or thug from securing a weapon and using it ... That is the issue.... This is just more political BS for resume enhancement..... Terrorist and thugs DO NOT buy their ...","post_message":"This is only the beginning folks..."},{"comment_id":"10153677457716509","commenter_b":"White collar criminals need to get hammered too","commenter_a":"@@username.....you are so right. we must be smart in giving.","post_message":"They conned donors out of $187 million and spent almost nothing to help actual cancer patients, the FTC says. Here's how about 97% of the donations were used: @webpagelink"},{"comment_id":"10154423071206336","commenter_b":"Was she deserves to do is pull her name off the ballot and put yourself in Sing Sing for 25 years","commenter_a":"I wouldn't want it anyway. It would not be sincere.","post_message":"Question Of The Day: Does Hillary Clinton owe the American people an apology for lying about her server scandal? #Hannity"},{"comment_id":"1231532310220572","commenter_b":"And male or not, you're a cunt","commenter_a":"The dirtbag can pick anyone he wants, Congress has no obligation to endorse the fascist's choice. Speaking of the Constitution. GOP won't be re-elected if they pass any nominee appointed by Ovomit.","post_message":"BOOM!"},{"comment_id":"10153589906358984","commenter_b":"Stop giving this ignorant b*tch attention.","commenter_a":"Yes I do send them over to join isil","post_message":"Wow. This news makes her challenge even more shocking...  Do you think there should be a punishment for those who desecrate the American flag?"},{"comment_id":"10152972323790950","commenter_b":"Sick bastards!!!!","commenter_a":"For now...I am going to let this investigation work itself out for evidentiary findings. Meanwhile, I choose to hive him the benefit of the doubt. Such is the way we were taught in college.","post_message":"BREAKING: Subway spokesman Jared Fogle is a suspect in a child porn probe, a law enforcement source says."},{"comment_id":"10153794102616051","commenter_b":"Agree,she should be in prison","commenter_a":"AGREE","post_message":"Donald Trump says Hillary Clinton's record of scandals make her unqualified to be president. Do you agree or disagree?"}]
