[{"comment_id":"10153053080376336","commenter_b":"She should have been thrown put on her fat a**.","commenter_a":"How about firing the witch for inappropriate behavior toward our Veterans! She's disgusting!","post_message":"\"Had she been a veteran herself or served in the military, she would probably have a different thought on how she treats our veterans.\" The Veterans Affairs manager in Indiana who mocked her patients’ mental health has been placed on paid administrative leave."},{"comment_id":"10153451761433701","commenter_b":"That is NOT a tranny yo gooF! WOWO!! how do you not know a drag queen when you see one.. and btw... he would knock you out for identifying him inappropriately. so your surround sound is broken Debbie","commenter_a":"Seriously posting this in that manner is bullying. Wild interview? About to go viral? More like a compassionate individual & who cares what she looks like or which way she swings.","post_message":"It's a story about a bad crash in Mississippi, but the animated eye witness is stealing the spotlight. This is one wild interview that's about to go viral. Take a look"},{"comment_id":"10152543335115933","commenter_b":"Amen!!","commenter_a":"Leave our kids alone! GET RID OF COMMON CORE!","post_message":"It's about time we get college costs under control, and I'm glad to have Ohio's college and university presidents on board as we move to make it happen."},{"comment_id":"1092391170839418","commenter_b":"@username why would you want my ass to look like your girls face......woof woof.","commenter_a":"His last words were probably \" more ham \". He was old and he was a fat slob. Nobody needed to kill him.","post_message":"Before passing away, Justice Scalia made a comment to his security detail. And based on what we're learning about his death, that comment may have changed everything about that fateful night."},{"comment_id":"10153468718801130","commenter_b":"Classy women.","commenter_a":"Gorgeous young women!","post_message":"\"They're not trying to look older than they are.\""},{"comment_id":"10154223685116409","commenter_b":"@username it is what it is, he is president elect, I did not vote for him but we always need to see the bright side of things.","commenter_a":"Everyone should give him a try, ACA is unaffordable for middle class families.","post_message":""},{"comment_id":"1656739891212938","commenter_b":"JJ Fuller Jeffrey Kalmonson Jojo Stewart","commenter_a":"Those who are caught in the left/right paradigm are often not ready for critical thought and the unforgiving truth. If you agree please comment (even 2 words) and share! (y)","post_message":"Free minds, free people.. this world needs more of them Follow: The Free Thought Project.com #B2TF"}]
