[{"comment_id":"1233979523321475","commenter_b":"@username This is what I do know. He has had more than 1 stance on this. So Will the real Ted Cruz please stand up? Maybe you should learn a few things? Research... Trump does not have to do Cruz in. Give him enough rope and he will hang himself.","commenter_a":"Cruz will say anything to get elected so he can do nothing for the American people and everything for himself. Don't believe anything he said.","post_message":"Believe him?"},{"comment_id":"10156122397820354","commenter_b":"Hang her worthless ass for treason!!!","commenter_a":"Sickening","post_message":"Yesterday, a defiant Hillary told the AP she wouldn't apologize for endangering U.S. national security with her unprecedented secret server scheme. Today, she flipped.    FACT: No other Sec. of State in American history has EVER set up a secret private server. Period."},{"comment_id":"885087015015208","commenter_b":"She needs to move on and except defeat u fucking scumbag criminal","commenter_a":"Yes","post_message":"What a sore loser. She needs to come grips with reality. Are you glad Hillary is not going to be our president?"},{"comment_id":"10155794432670354","commenter_b":"she'll never get that stink off her!","commenter_a":"What was that idiot doing there anyway.","post_message":"What was she thinking?"},{"comment_id":"619138891610023","commenter_b":"that alright. She can just leave the white","commenter_a":"Just shut up","post_message":"Michelle Obama wants America's sympathy for all that she has to put up with.  Nobody cares. What a joke.  Do you agree Michelle Obama should keep her mouth shut?"},{"comment_id":"943485965686825","commenter_b":"Hillary wants to have DNA test to see if Chelsea is hers!!! DUH!!!","commenter_a":"Lol..she looks like Bill.","post_message":"Incredible!"},{"comment_id":"1378443058862829","commenter_b":"SHES WAVING TO THE CROWD YOU ASSHOLES..","commenter_a":"Conservatives suck","post_message":"Wait till you see what she appears to be saluting."}]
