[{"comment_id":"10153227996393812","commenter_b":"And feminazis want to be equal. Smfh","commenter_a":"Men can be abused too...","post_message":"\"Why is it so hard to see black and blue?\" #TheDress being used to fight back against domestic violence: @webpagelink"},{"comment_id":"10154820857971438","commenter_b":"It's got nothing to do with controlling women, it's got to do with being the voice of the silent unborn. Who protects the unborn when they are being ripped apart because the woman who decided to have unprotected sex asks to butcher the unborn. No one has listen to the unborn small scream when they are being tortured inside their mom's womb. Look it up, and after you hear it and see it, you'll realize that a life, no matter how small, MATTERS.","commenter_a":"They don't. It's about control.","post_message":"I am sympathetic to the pro-life argument, but anti-abortion rallies leave me baffled."},{"comment_id":"10152595284751519","commenter_b":"If only the women on Fox News would start wearing tampons for earrings, maybe they'd be taken more seriously.","commenter_a":"How can any thinking woman vote republican? Stepford Wives comes to mind. How does the republican platform support women? Oh and Glen, ACA is winning. Read.","post_message":"We don't have to take Fox News' lies any longer. Here's how we fight back."},{"comment_id":"10154962501399609","commenter_b":"And I love Mexican women too.","commenter_a":"This will bring in more money for our economy and more jobs to the US and lessen our trade deficit with Mexico. The demand for US products will go up and continue to stimulate our economy. Finally, we have a president making decisions that loves Americans and his country.","post_message":"JUST IN: President Trump wants to pay for the border wall by imposing a 20 percent tax on imports from Mexico. @webpagelink"},{"comment_id":"10153567099501509","commenter_b":"Throw those Muslims overboard!!","commenter_a":"May God forgive them","post_message":"Muslims who were among migrants trying to get from Libya to Italy in a boat this week threw 12 fellow passengers overboard -- killing them -- because the 12 were Christians, Italian police said. @webpagelink"},{"comment_id":"10153613354068690","commenter_b":"and she need to learn how to write in english either","commenter_a":"May Allah help all Muslims around the world Ameen","post_message":"We demand the freedom of our colleagues who are unjustly detained in Egypt. #FreeAJStaff"},{"comment_id":"1666828886940954","commenter_b":"when someone finally makes sense .. THANK YOU SALMAN RUSHDIE!","commenter_a":"Every thing they say here is an outright lie. There is Huffpoop id evil. not a shred of truth about any of these.","post_message":"Let's put Hillary Clinton's emails into perspective."}]
