[{"comment_id":"1717305195178742","commenter_b":"@username Did you smoke crack before your post? Americans can be Asians. Using your logic, Latinos and Latinas can't be Americans either. And all blacks would be African. Also, those nations are far from being heterogeneous like ours.","commenter_a":"Yes Asian men are not portrayed in a very nice light especially in american media. however, I find many Asian men to be attractive. love the facial structures and there is nothing like a guy with a sword.","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"1772774552977135","commenter_b":"These women are hypocrites.","commenter_a":"So explain to me how Trump is horrible because he was talking to another man in private about a women who cares get over it you crybabies. I'm sure she liked it too","post_message":"BREAKING: Protesters have gathered in front of the Trump Tower on Michigan Ave. They're holding graphic signs referencing Donald Trump's lewd comments about women. No arrests so far. MORE: @webpagelink"},{"comment_id":"10154229601211179","commenter_b":"Ash Kay- see? I'm not the only one thinking this! 😂","commenter_a":"That is sadly amusing","post_message":"via @buzzfeed"},{"comment_id":"10154082717346037","commenter_b":"You're an old hag and a criminal","commenter_a":"Hilary for president of America 2016!","post_message":"Hillary Clinton and Ted Cruz have received the most funding from the groups so far."},{"comment_id":"10155243196880354","commenter_b":"If the border is not closed these terrorists will continue to come into America!!!","commenter_a":"Save the taxpayer some money and just shoot them. Don't tell the world, just shoot them and be done.","post_message":"Meanwhile, as Obama was snapping selfies...."},{"comment_id":"10153990601334726","commenter_b":"Joel Gillespie One thing to have hired them (via a contractor) totally another to hand them citizenship. Maybe if Rubio and his fellow politicians would secure the border enforce immigration laws there would not be illegals for hire.","commenter_a":"hilarious that Rubio is the one that said Trump misspelled Choked and he didn't... Rubio was wrong","post_message":"WATCH: Rubio Mocks Trump, Reads Misspelled Mean Tweets, 'Friends Don't Let Friends Vote For Con Artists'"},{"comment_id":"10154880820226178","commenter_b":"What a shameless woman. You are heartless.","commenter_a":"Kelly A Dee","post_message":"LOL. Martha Raddatz can barely keep it together!"}]
