[{"comment_id":"10154607123003984","commenter_b":"Get a fucking rope around that sorry bitch's fucking neck. Treason is punishable by the death penalty!","commenter_a":"So why aren't we hearing this on all the news channels? This is serious enough that it should be out there! Why are they even allowing her to run for President?","post_message":"Hillary has dodged this way and that on Benghazi, hoping her lies never caught up to her.  But they just did in a huge way.  A high-level, bombshell email was just uncovered by a watchdog group, and it PROVES beyond a doubt that she left those brave men to die in agony, knowing full-well she had a chance to save them. How sick."},{"comment_id":"10154271222713984","commenter_b":"She is a liar and manipulator ..","commenter_a":"A vibrator up her cooze? Call out the nuke-sniffing pig from South Park.","post_message":"Hillary Clinton was about to give a speech when suddenly the reporters heard a very strange noise... they knew immediately that Hillary was hiding something.  We know Hillary can't be trusted and this proves it... everyone needs to know what Hillary just did."},{"comment_id":"1862154907348470","commenter_b":"I'ma tear that fried rat clean down!! I got moves to make and a child to feed. I'm a proud fried rat eating father! Haaaaah","commenter_a":"spider","post_message":"Which would you choose? #WSHH"},{"comment_id":"1116556865104033","commenter_b":"ignorant bitch, we are ALL immigrants!!!! VOTE HER OUT & VOTE STRAIGHT BLUE, FEEL THE BERN!!!!!!!!!!!","commenter_a":"When is the last time the republicans filled a bill about anything that would benefit the American people? These fools are of limited intelligence to be sure. Please people vote Blue every chance you get.","post_message":"Republicans are now setting their sights on our librarians."},{"comment_id":"712619718886803","commenter_b":"At the risk of repeating myself, J. McCain turn your back on this blight you call a presidential candidate! You do a disservice to your party, your constituents, your military compatriots and most importantly your moral compass which should be leading you away from rather than to Trump.","commenter_a":"Trup will be lopplllllppp Cidgbelillnnrvrubrg","post_message":"He's mad as hell but is he gonna take it any more? -- Paddy"},{"comment_id":"10155325034607439","commenter_b":"Women will be wearing them just to be so called fashionable","commenter_a":"YUK","post_message":"Fascist fashion. It's just plain ugly. Anti-fashion, anti-woman, anti-beauty."},{"comment_id":"371470169707944","commenter_b":"This is to Hanoi Jane. Run your bathtub to lukewarm. Get into tub. Have a nice glass of red wine. Take a razor and slit both of your wrists. Go to sleep. The world will be a better place without you.","commenter_a":"She owes the Vets she causd additional harm to in Vietnam. She needs to apologize profusely to all veterans for the rest of her life.","post_message":"Fonda said she made a \"huge mistake\" that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."}]
