[{"comment_id":"10154532714726162","commenter_b":"England, and yes it is my city is run by the labour party","commenter_a":"Where's white live matter, oh wait their not black","post_message":"A father and his two sons have been charged with molesting three young girls in their home... @webpagelink"},{"comment_id":"474933522694941","commenter_b":"No! We don't want any more of these people!","commenter_a":"AHH HELL NOO!!","post_message":"60,000? Can you imagine how many terrorists among them?"},{"comment_id":"10150889945159999","commenter_b":"Another great day for Mr Trump and another day Mrs. Clinton lost. Meeting with the Mexican President first and finding common ground, while she stays home and refuses to speak to the American people. Mexico will pay for the wall. It is in their best interest to keep American thugs and murderers out of Mexico","commenter_a":"If the real Native Americans take up this mantra we're all in trouble. D","post_message":"The photo-op allowed Donald J. Trump to please his nativist base and humiliate Mexico at the same time, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"875339435822246","commenter_b":"And that wig is horrible!","commenter_a":"No new news...She says that about all men. No shame and straight up tacky.","post_message":"Sherri Shepherd Wants To Sleep With Johnny Gill… @webpagelink"},{"comment_id":"712897555475520","commenter_b":"Yes.. Of course the illegals have been vaccinated.... If their illegal we wouldn't know NOW would we?..... And it doesn't just mean Mexican... It means any child that enters our country illegally.... Plain and simple.....","commenter_a":"So that would be all ilegal children at the very least! Who should not be in our schools anyway!","post_message":"Anyone who hasn't been vaccinated is being told to avoid visiting Disneyland."},{"comment_id":"1111506915536985","commenter_b":"there always must be some mother Theresa online who will even justify leg surgery of mosquito..","commenter_a":"It's gonna be a waste of money to save that snake. Save it for someone who really needs surgery.","post_message":"That looks uncomfortable."},{"comment_id":"10153711190119411","commenter_b":"Put them on big boats & send them too the U.S. !! Time for the yanks & Jews too clean up there mess they created !!","commenter_a":"They are provided with bins and skips in most places, yet they just throw their shit everywhere. Dirty pigs","post_message":"NIMBY-syndrome grips little-mittel-Europeans"}]
