[{"comment_id":"10150836955014999","commenter_b":"there is nothing more damaging to black community than RACISM!","commenter_a":"There is nothing more damaging to the Black community that the BLM movement. By defining racism and things like \"cultural appropriation\" as the reasons for failure of African Americans to succeed fundamentally points to solutions in the wrong place. If tomorrow, every last vestige of racism were lifted in society, would Blacks suddenly be elevated? No. The cultural deficit of the Black community is the key. Lack of educational attainment, intact families, communities with massive violence, lack of role models all are the key reasons for failure. These problems may stem from historic racism but they are not solved by eliminating racism today. So, when the BLM movement focuses on racism they are actually focusing in on the wrong items. Lifting small racists issues without fixing the basic cultural failings will do nothing. In 10 years, we may have few elements of racism left and a black community with problems ...","post_message":"\" ‘You’re free,’ they keep telling us. But she would’ve been alive if she hadn’t acted so … free.' \""},{"comment_id":"10155182978984369","commenter_b":"We are animals no different then lions killing each other in self self-defense. i believe killing for money power drugs and such is a sin. Killing for self-defense would be justified","commenter_a":"A few people on here are saying that a gambling debt or drug debt isnt a good enough reason to kill someone. Maybe not for you but obviously a good enough reason for someone who kills...","post_message":"NEW INFO: The victim girlfriend told investigators she drove her boyfriend to the location of the shooting to collect on a Super Bowl bet and when he exited the vehicle, he was shot"},{"comment_id":"1297424046964731","commenter_b":"Not a Christian. He's a low-life creep!","commenter_a":"That doesn't sound very much like what Jesus would say","post_message":"WOW!"},{"comment_id":"10155198682596002","commenter_b":"Sad now she is looking like a joke.","commenter_a":"I still remember Hillary as 1st lady saying stand by your man.","post_message":"What do you think of her statements?"},{"comment_id":"603381206519125","commenter_b":"Miley is a nasty skank!","commenter_a":"get rid of miley.","post_message":"Miley attacked Christian conservatives, but Bristol had an epic answer for her.  Good. We support Bristol 100%.  Is Bristol Palin a better role model than Miley?"},{"comment_id":"10153192857784087","commenter_b":"TRUMP 2016","commenter_a":"Our tax dollars hard at work!","post_message":"The sight of GOP presidential frontrunner Donald J. Trump’s plane surprised reporters traveling with the vice president, and they quickly snapped photos of the scene."},{"comment_id":"502459539951113","commenter_b":"RINO","commenter_a":"Who cares about Romney! Let's move on and win this one!","post_message":"You cannot be serious."}]
