[{"comment_id":"10153075316564440","commenter_b":"Sarah, maybe if your homegirl wouldnt act so tough against the cops and complied, she would be alive. she rammed a car towards and now she's dead!","commenter_a":"Wow these damn cops can do what they want that's a damn shame","post_message":"BREAKING: No charges against Denver cops who fatally shot 17-year-old Jessica Hernandez dpo.st/1dSxAU8"},{"comment_id":"1202509189764740","commenter_b":"It's always about me Me ME!","commenter_a":"cause i aint dead and after 38 years you cannot make me a beater to be dead after 38 years and with mama rosa's paperwork","post_message":"One thing he doesn't say, is \"victory.\""},{"comment_id":"886270021416239","commenter_b":"This is not good! We should close our borders for all foreigners indefinitely until further notice.","commenter_a":"Hey Rachel suck my cock","post_message":"A growing Muslim population in the U.S. is raising concerns that the nation could be at increased risk for instances of Islamic extremism in coming years. @webpagelink"},{"comment_id":"1720347271558389","commenter_b":"What a pathetic slut !!!!!!!","commenter_a":"Just another Wacko;showing her ignorance.","post_message":""},{"comment_id":"713882998713829","commenter_b":"...then get to it...show the American citizens that you politicians have some cajones...IMPEACH the MF'er!!!","commenter_a":"THIS IS THE FIRST TIME IN HISTORY THAT A LEADER OF THE FREE WORLD ISN'T HELD ACCOUNTABLE FOR HIS ACTIONS . AND I WOULD LIKE TO KNOW WHY.","post_message":"The American President... Or Jihadist In A Suit? ⋆ Dc Gazette... @webpagelink"},{"comment_id":"999515513474836","commenter_b":"No shit ..told u that a while ago......u stubborn Dominican","commenter_a":"Especially after what happened in France.... I usually dont say much but liberal democrats can go scratch... ...its gonna happen here soon.......","post_message":"Watch: Pres. Obama calls out Republicans for pretending the Bush Recession was the \"golden era\" and refusing to give him credit for fixing their mess."},{"comment_id":"10153422236844877","commenter_b":"Darn shes not even hot. Nappy headed hoe.","commenter_a":"What's crazy is people talking about her knowing she has special needs.","post_message":"Miami woman arrested for dancing naked at Johnny Rockets - in the middle of the afternoon! Find out why her father says she did it. Grio fam, what are your thoughts on his defense?"}]
