[{"comment_id":"997479846960469","commenter_b":"Statements of a failed leader","commenter_a":"Not president U S president","post_message":"President Barack Obama said on Friday that the strategy adopted by Russia in Syria is a \"recipe for disaster.\""},{"comment_id":"1149314588454636","commenter_b":"Ban them from the U.S.","commenter_a":"No","post_message":"The saga continues..."},{"comment_id":"585707061582274","commenter_b":"Zoe, your doctor told YOU not to lift that amount of weight. If the doctor told that woman not to, I'm pretty sure she'd stop. Everyone's body is different.","commenter_a":"This is just sad , smh more concerned about looking fit and all that , be healthy that's what that baby needs not for you to be fit. Wait till the baby is born and get to your regular routine. I really hope the baby comes out ok smh all that shaking and heavy lifting Pretty sure you just gave that child problems","post_message":"Fitness Model Chontel Duncan Isn't Stopping Her Intense Workout Sessions Even During Her Pregnancy!"},{"comment_id":"1745160079101455","commenter_b":"No, I am convinced she has a serious mental health issue. She lies and lies about lying. She questions your temperament to lead? She is the psycho, literally, staying with her husband solely for political purposes while constantly defending her indefensible record of blatant corruption. And for what? Her relentless pursuit of more power to abuse. Hillary is not mentally fit to lead","commenter_a":"she looks sedated","post_message":"Bad performance with foreign policy \"speech\" yesterday, by Crooked Hillary Clinton! Reading poorly from the telepromter! She doesn't even look presidential!"},{"comment_id":"10153547473805950","commenter_b":"I meant she's about the most ignorant narcissistic female I've ever seen.","commenter_a":"She's about the most ignorant narcsisci femaale","post_message":"He's \"as much a scientist as I am.\""},{"comment_id":"1162973243743146","commenter_b":"@username haha why does she always look psychotic?","commenter_a":"Bristol Is Pregnant Again Because...","post_message":"Hypocrisy at its finest."},{"comment_id":"10155791972890725","commenter_b":"STFU","commenter_a":"and a lot of people blame the police in one out of five hundred killings. what happen to hope and change under obama?","post_message":"Police say the victim, identified as Vonzell Banks, was likely not the intended target ----> @webpagelink"}]
