[{"comment_id":"10153936646970329","commenter_b":"The American government steals from us and treat its American citizens like crap.","commenter_a":"Everyone's shit scared of the Americans cause they lie, are arrogant, have big weapons, invade any country and are religion obsessed. Same as Islam extremists. The thing they say they hate.","post_message":"Including some disturbing news for America..."},{"comment_id":"10154168585709726","commenter_b":"She will be worse and any of the others. Idiots","commenter_a":"Whoever gets the nomination could run a brilliant series of ads about Hillary's War on Women.","post_message":"Abortion rights group looks to spend big to secure Clinton victory in November."},{"comment_id":"10153655047616130","commenter_b":"When someone makes those comments, they will learn what my bitch face REALLY looks like!","commenter_a":"Everyone: Are you okay? Everyone: You look tired. Everyone: You look upset. Everyone: You look confused. Everyone: Are you mad at me? Everyone: Why are you mad at me? Me: IT'S JUST MY FACE!!!!! This has been an accurate description on what it's like to live with Resting Bitch Face.","post_message":"Scientists say resting bitch face is real."},{"comment_id":"846327085437336","commenter_b":"How any woman could vote republican(step ford) is beyond me, but they need to turn off Fox and Friends. Lol","commenter_a":"I STAND WITH RAND! I am a woman that has worked hard to build a career and strong skill set and I have no complaints about my salary. I earn what I deserve based on what I have done for MYSELF. Women are not inferior, stop acting like it!","post_message":"Ugh. Senator Rand Paul announced his bid for the White House, and he's one of the most anti-woman politicians out there. If he thinks the war on women is over, he just doesn't get it."},{"comment_id":"1008831639165859","commenter_b":"Evil, vile woman.","commenter_a":"POS!","post_message":"Never forget..."},{"comment_id":"10153368981378812","commenter_b":"As past wars have told us, you can ONLY stop violence with violence, these people need to be shot down","commenter_a":"You can't stop violence with violence.","post_message":"BREAKING UPDATE: Baltimore Police: At least 7 officers injured in clashes -- 1 is \"unresponsive,\" some have broken bones; mob has surrounded and destroyed a police cruiser -- LATEST: @webpagelink LIVE: @webpagelink"},{"comment_id":"10153829501651337","commenter_b":"Humanity","commenter_a":"The amount of non judgmental compassionate comments on here is truly staggering","post_message":"HE'S KNOWN HOW LONG? Here's Charlie Sheen's HIV announcement..."}]
