[{"comment_id":"10154576312191037","commenter_b":"'@username so if they agree with Her hatefulness that will make them good people? You must have drank her kool-aid","commenter_a":"Most disgusting, despicable woman in America. She and Drumpf are the perfect, hateful, ugly pair that embody everything wrong with the US.","post_message":"She previously called him an 'angry Muslim with a thick accent.”"},{"comment_id":"10158563017270354","commenter_b":"She is too good for you a hole","commenter_a":"All of you hypocrites who are protesting and rioting over Trumps's decision that was very similar to Obama's that you didn't even bat an eye for, is the reason Trump will be here for 8 years.","post_message":"Grammy Award-winning rapper Eminem called President Donald Trump a 'bitch' and fantasied about sexually assaulting conservative author Ann Coulter in a new song."},{"comment_id":"1672517186342699","commenter_b":"Kiss my white ass.I don't owe you anything","commenter_a":"White lives matter","post_message":"“...white folks actually gotta give up something. You have to actually sacrifice yourself. You have to be willing to give up the things that you currently benefit from.”"},{"comment_id":"725495814307663","commenter_b":"Hillary is a virus!","commenter_a":"That's Tillery when we're not really being serious about lives of American citizens. She's a disgrace to represent any American. Trump 2016!","post_message":"Trump Just Leaked A Video Of Hillary Clinton That Could End Her Campaign [VIDEO]  She is panicking. See this video before it gets scrubbed from the internet.  Do you think Hillary has no place in our White House?"},{"comment_id":"10154024404718352","commenter_b":"Does that look like a white family bitch???? Go fuck your self","commenter_a":"Truth is that Mom's don't know, my stepfather abused me from 4-12 and I never said a word till I was 19 although my mom asked us many of times had anyone ever touched us we always said No because not only was their sexual abuse there was physical abuse, we we're scared he was going to kill us or or mom would kill him we were worried we'd have no one... 10 is so young if she did have a stomach her mother didn't notice nor did her teachers until the birth.... All I can say is he'd be dead once I found out","post_message":"10-YEAR OLD GIRL BIRTHS BABY AT SCHOOL AFTER THINKING IT WAS JUST A TUMMY ACHE"},{"comment_id":"10152889795339342","commenter_b":"Thanks to the OTHER hospital! Her hospital didn't even say what Duncan had! They kept it from her!","commenter_a":"Personally, I'd just be happy to be alive.","post_message":"SO CALLED 'EBOLA NURSE' NINA PHAM PLANS TO SUE: The 26-year-old nurse said that the hospital where she had worked in Dallas and its parent company failed her when she contracted Ebola while caring for the first person in the U.S. diagnosed with the deadly disease."},{"comment_id":"10153071973637217","commenter_b":"Whats up with the broken leg? Haha random","commenter_a":"... well ... coulda been worse !","post_message":"24 unconscious, several dislocated shoulders and 1 broken leg"}]
