[{"comment_id":"875517669161528","commenter_b":"Well here's the problem because of women like you these little Angel can't even make to birth how disgusting!","commenter_a":"The American dictionary says it's a human embryo, human fetus, human unborn baby. Common sense says it deserves human rights.","post_message":"Tell Congress to protect the unborn! Sign your Life at Conception Act petition today!  CLICK HERE to sign! @webpagelink"},{"comment_id":"1705131916440587","commenter_b":"Hillary has a mouth just like her, ask Hillary sec service or help!! She is no lady","commenter_a":"Dr. Ben Carson is a class act, the women of the view are an embarrassment to women everywhere & the show should be taken off the air!!!","post_message":"Whoopi Goldberg is just plain GROSS...   I hope this means the end of The View!"},{"comment_id":"10153237393021350","commenter_b":"Great idea but this lady ain't fat...","commenter_a":"You look fantastic!!","post_message":"This mom has become a swimsuit role model."},{"comment_id":"1004538792920312","commenter_b":"@username I'd love to hear your thoughts on the post from Kylelebrius Kennethius Jenkonious","commenter_a":"Hey friends, just wanted to highlight part of this post for those who aren't able to read the whole thing or watch the entire video. I really want this post to get people thinking about how we talk about these issues but also what causes these situations, not just the consequences of them. I know this is a tough situation and one that provokes lots of emotion and passion, but I hope we can talk about this in a productive and respectful way. Thanks in advance. \"Violence of any kind is wrong. But there's a serious problem when white students rioting after the annual Pumpkin Festival are described as \"rowdy\" and \"unruly\" but black protesters rioting in response to police brutality are portrayed as \"violent thugs.\"","post_message":"If you replace \"white\" with \"black,\" suddenly it doesn't sound so far-fetched. That's precisely the problem with the way folks are talking about the Baltimore riots. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10154312935051337","commenter_b":"All i can say is wow! I mean since Bran can use his powers to enter into a body does that mean he will eventually enter into the white walkers body an control him by pushing out what was put in now that would be awesome.","commenter_a":"That was by far the saddest moment of this show! Rip hodor/direwolf.","post_message":"OH. MY. GOD. Craziest Game of Thrones yet?"},{"comment_id":"479299448927302","commenter_b":"Americans mandate Islamic Terrorists be assasinated","commenter_a":"Fuck them shot them in that red dot in there head...","post_message":"New Texas curriculum tells students to refer to Islamic terrorists as 'freedom fighters'.  Spread the truth, let's put an end to this.  'LIKE' if referring to terrorists as 'freedom fighters' is WRONG!"},{"comment_id":"10153248513449087","commenter_b":"Stupid liberals so hope you run that old white socialist ass wipe.","commenter_a":"and democrats blame all the world's problems on Republicans, you old fart shut up","post_message":"\"In their world, every problem that you can possibly imagine is caused by Barack Obama,” Bernie Sanders quipped at a campaign rally in Boston. \"If there is rain, if it’s too hot, if there’s a mosquito in the room, it is all Barack Obama.”"}]
