[{"comment_id":"10153893248952293","commenter_b":"That's only for white guys.","commenter_a":"Just give him a slap on the wrist and let him go. Same as always.","post_message":"Police began looking for the 40-year-old after finding her 3-year-old daughter wandering alone in a Baton Rouge parking lot near her mother’s abandoned vehicle."},{"comment_id":"10153731561481336","commenter_b":"You're an idiot Elizabeth!","commenter_a":"The shooter was a conservative republican. That seems to be a common theme in mass shootings.","post_message":"One law enforcement official described the shooter as an \"angry young man who was very filled with hate.\""},{"comment_id":"10155599554315354","commenter_b":"Why are we still seeing this crazy whore.","commenter_a":"Sure she's an idiot...but can't she practice the religion of her choice wihout scrutiny?","post_message":"Raised Catholic....dabbled in Kabbalah...and now this... ...Check it out."},{"comment_id":"794052647345901","commenter_b":"LOL! Laughing mostly because I have a few friends like this guy...","commenter_a":"I believe it's called the \"pass the buck\" syndrome? Pity","post_message":"Image from Of the People, By the People, For the People"},{"comment_id":"10153653825589641","commenter_b":"Barbaric ... Disgusting behavior . Poor woman. I thank God every day that I was not born in an Islamic country and pity all those women who are oppressed . May she rest in peace .","commenter_a":"What happened to the man she was supposedly cheating with ? Let me guess ....nothing. That country is nothing but a bunch of murderers","post_message":"The victim was in a forced marriage, and had tried to flee with another man."},{"comment_id":"568744853313807","commenter_b":"Take her welfare away from her and force her 2 get a job!","commenter_a":"Their parents must be total Pieces of shlt","post_message":"Did this idiot DESERVE this?"},{"comment_id":"1265082296896088","commenter_b":"Women get no opinion in Adolf Trump's amerikkka. So stfu and get back in the kitchen","commenter_a":"But not the recount in Detroit, where there r more votes than voters now. Not Russian--democratic votes.","post_message":"Trump supporters are calling the effort undemocratic. What do you think?"}]
