[{"comment_id":"10154575281024877","commenter_b":"Melania looks like Caitlyn Jenner. !! !!","commenter_a":"Jobin, I fell the same way sometime it takes something to open her eyes maybe this is it","post_message":"This is one of the main reasons we need to stop treating Melania like a helpless victim."},{"comment_id":"542901459225067","commenter_b":"Go Hillary !","commenter_a":"She is honest and I am tired of people accusing her of everything when she has been for the USA since Clinton was President and after that, etc. She loves her country and will be an excellent President. Grow up world!","post_message":"The people of Iowa versus pollsters and pundits. The people win."},{"comment_id":"10153531344506077","commenter_b":"Well said!","commenter_a":"Apparently some of the people on this thread see this move by the Colorado governor as a humanitarian move. Well when the carnage starts in Colorado, we will see just how humane the move was. Every citizen of this country that has a gun needs to lock and load because what happened in Paris is coming here! If you can't see the truth then you are just as blind and ignorant as our so called leaders! I hope you do not suffer in pain long when your ignorance comes back to bite you in the butt.","post_message":"JUST IN: Colorado will NOT join the growing number of states that are refusing to accept Syrian refugees following the Paris terrorist attacks."},{"comment_id":"1147558291982624","commenter_b":"@username like to talk shit behind a keyboard like a little bitch!","commenter_a":"White on white crime 👀","post_message":"Sick: 26 year old man gets caught trying to meet a 15 year old boy! #WSHH"},{"comment_id":"10153788091955950","commenter_b":"Jay the only way Hillary will win is if she lies cheats an steels the votes. Oh wait that's what she does for a living !!!","commenter_a":"This is nonsince TRUMP is not a quiter. He's in it to win it. An he WILL !!! TRUMP FOR PRESIDENT !!!!!!","post_message":"A Clinton plant? A Russian agent? Here's everything you need to know about all the far-fetched explanations of Trump's behavior."},{"comment_id":"10158633377120725","commenter_b":"Funny, president Obomba deported more people than any president in us history. Liberals worship him. Trump deports people and out come the crybabies and the protests.","commenter_a":"Why deport the good people? I don't get this ine","post_message":"Advocates believe the roundups and arrests mark a shift in enforcement under the Trump administration."},{"comment_id":"1186141524764191","commenter_b":"That is right they would have convicted her already .","commenter_a":"IF there was anything to charge Hillary Clinton for related to Benghazi or her emails, (or anything else Fox Entertainment lies about) then wouldn't you think, after a decade of trying to convict her of something, the Republicans would have done it by now. There is NO basis to convict her of any wrong doing. The Republicans have lied about her for years and I'm sure they will continue. In the meantime I won't vote for anyone as repulsive as Donald Trump. He will, in my opinion, destroy this Country and our reputation around the World.","post_message":"How does this make ANY sense? From CNN: \"Donald Trump may say he's concerned about the little guy, but his tax plan would give the wealthy far bigger breaks than the middle class or working Americans. The Top 1% would see a whopping $275,250 reduction in their federal tax bill, or 17.5% of their after-tax income.\""}]
