[{"comment_id":"1658924690814663","commenter_b":"And last time I checked, Treason still carries the death penalty! That would certainly get rid of a bunch of \"bad actors\"! It would go a LONG WAY towards \"making America great again\"!!!","commenter_a":"Trump and Bannon are complicit in Flynn's actions. Does anyone remember Trump tweeting about how \"smart\" Putin is after Putin chose to not retaliate against the sanctions?? This was all coordinated at the highest levels. The whole administration should be in jail for conspiring with a foreign government against America's interests both before and after the election. If all of this put together isn't treason, I don't know what is.","post_message":"Bet Trump knew about this...."},{"comment_id":"10153776813241336","commenter_b":"Bye-bye!","commenter_a":"Good riddance!","post_message":"Ahmed Mohamed’s family released a statement saying they had accepted a foundation's offer to pay for his high school and college in Doha, Qatar."},{"comment_id":"10156625671370354","commenter_b":"Dork....","commenter_a":"He's a black man who don't no shit about running a country","post_message":"“I’m a black man who sometime wears his hat on backwards,” Obama said. And the rest is, well, you'll see..."},{"comment_id":"10153089785921491","commenter_b":"Ah , the range of a true lady.","commenter_a":"Love everything about her, even though I'm now aware of an intimate and amusing detail of which I had't really given much thought.","post_message":"Interviewers, beware: do not mess with Amy Schumer."},{"comment_id":"1028272853931448","commenter_b":"She wasn't even twerking she was just bn silly joking like she was. Pull up her dress with spanks under Neath......its really not a big deal. If Obama get mad about that he shitty.","commenter_a":"Carlos Aden Carlyle lol","post_message":""},{"comment_id":"828114997284754","commenter_b":"Can goats give consent?","commenter_a":"Polygamy is next. Then incest not far behind. Chris you gonna marry a goat?","post_message":"BREAKING"},{"comment_id":"991971067506900","commenter_b":"Islam IS the Problem !!","commenter_a":"That would stop all protests if you take a couple of the looters out!!","post_message":"\"After handing over his ID card, the terrorist stabbed one of the officers in the neck and another one in the upper body.\""}]
