[{"comment_id":"953133518031452","commenter_b":"Wow, county officials must be really threatened by gays getting married. We should tie them to chairs, and make them watch gay marriage ceremonies for weeks on end, to desensitize them.","commenter_a":"Go to the gulf and marry on a ship!","post_message":"They just cannot deal"},{"comment_id":"1134932883194388","commenter_b":"down, look at the squares on the sides","commenter_a":"I think up it is hard to say!!","post_message":"o.O"},{"comment_id":"10153756549625667","commenter_b":"No Trump No Hillary, any body else, American have the best.#","commenter_a":"like my page awlad nass","post_message":"As the Iowa State Fair got started 20 years ago, two people were shot dead in the exhibitor campgrounds."},{"comment_id":"10156573724785294","commenter_b":"This sickens me! There are so many people in this world that would love to have a child and would never do this to one, why do these type of people exist???i think they should have the same thing done to them!","commenter_a":"Makes me sick!","post_message":"'This is just one of those cases that just shocks the soul...'  A babysitter accused of horrific abuse after a 3-year-old is found bound and gagged in his closet for 'being too loud.' The girl's head was also shaved as part of a plot by her mother to make some money, police say."},{"comment_id":"1613037799000233","commenter_b":"Thanks to Trump! He has successfully stirred up America. I'm still with Hillary Clinton!","commenter_a":"Ever since the election, the real closet racists have come out..","post_message":"A teacher shouted the N-word in the middle of class, stunning her eighth grade students. The video has millions of views and the teacher has since been fired. @webpagelink"},{"comment_id":"10153405844391955","commenter_b":"Cruz is a phony with his evangelical persona","commenter_a":"Trump's record makes him look like the flip flopping, inconsistent political opportunist he is. The right personality and talking the way we like without looking at policies, are the criteria the Democrats selected Obama in 2008. Donald Trump has supported a net worth tax, 35% tarrif, he supports amnesty and a path to citizenship, 'because there are jobs Americans just won't do,' He's donated to clinton Pelosi & Harry Reid, and has said Bush is the worst president ever. He's a RINO and a caricature of a conservative inartfully voicing every failed mudsling of the left against conservatives. Ted Cruz is a world class debater, with a nearly perfect record who takes on both Democrats and spineless Republicans. He has all the positives and then some without the negatives of Trump. #TedCruz2016 @webpagelink","post_message":"NEW 'SILENT MAJORITY'"},{"comment_id":"1412904655446554","commenter_b":"You know joy what goes around comes around.I think she is only on tv because she is so nasty","commenter_a":"Enough is enough! Grow up and accept your new president you whining bunch of children! It's time to take either the hosts or the hosts off the air because they are to infantile to face reality!","post_message":"The heck!"}]
