[{"comment_id":"1180596495393685","commenter_b":"We ain't going to miss you don't let the door hit you on the way out","commenter_a":"He accomplish nothing but racial tension","post_message":"Here is how Americans feel about Obama as he leaves office. Are you proud of what he accomplished for our country?"},{"comment_id":"497111050479475","commenter_b":"She's a sellout to her own race, taking everything that white people gave her, and then spews her racist anti white nonsense to make blacks think she actually cares about them.","commenter_a":"She described racism other countries not ours.","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"10154969717088352","commenter_b":"She need to sit in jail for a good 30 days!! Bet she won't think that's funny!","commenter_a":"And what's her punishment??!!!","post_message":"Massachusetts cop’s wife ‘faked robbery and spray-painted the letters BLM on her own home to blame Black Lives Matter supporters’"},{"comment_id":"10154937498024885","commenter_b":"She MAY have HAD fashion, but when she wears hideous clothes made for her. It speaks volumes.","commenter_a":"Ok Post Disgrace, we get it STL has a slightly few more liberal, reverse racist, nobodies then the rest of the Midwest. However, this is no time to be praising Osama Obama's wife. We just celebrated Christmas for God's let's try to keep the sane ones sane.","post_message":"\"She's made an effort to wear accessible fashion,\" designer Tracy Reese says. \"I think Jackie (Kennedy) was a great role model but she wore a lot of couture, and things that most Americans could not afford.\" Mrs. Obama, she says, has worn both high-end and moderately priced fashion."},{"comment_id":"487880261407401","commenter_b":"He got her ass good","commenter_a":"@username bruhhh lol","post_message":"Barack Obama just hilariously roasted Bernie Sanders and Hillary Clinton. #WHCD"},{"comment_id":"10153907733031002","commenter_b":"I don't believe she \"deserved\" it at all. I also agree that a man that size obviously has other options to restrain someone. These girls need to realize these men aren't their daddy, brother, uncle.. They don't know how they are going to react, so they need to keep their hand to themselves. Neither party was right here.","commenter_a":"She Wasn't out of pocket. Just Because she was waiting for her brother that gave him the right to grab her up like she was an issue. This is a grown man, you don't punch a teenager on the face like she a man. He had no right to ever touch her, her brother was just trying to protect his sister, as he should.. PEOPLE are out of control.","post_message":"A mother is demanding answers after her daughter was punched during a heated exchange at a skating rink."},{"comment_id":"10153068896931323","commenter_b":"Real Women Have Pulses.","commenter_a":"All this \"Men like curves\" stuff is crap. Most men will fuck anything with a pulse.","post_message":"\"There is no better way to celebrate and show off than by donning a bikini. When the #CurvesinBikinis ad in Sports Illustrated is released, the world will be watching and they’ll like what they see.\""}]
