[{"comment_id":"10153797525542183","commenter_b":"@username No it was the racist Obama that started this long before Trump was running for president. He wants to incite the Blacks to get them out and vote Democrat so he had to get the media to claim Blacks were being killed by cops. The only thing he left out was they were Black criminals attacking cops that were being killed.","commenter_a":"Obama is the poster boy for the \"Black Lives Matter\" racists. Obama started this along with his media puppets to get Blacks to vote Democrat. The Democrats do not care how many cops or law abiding Blacks have to die to get and keep their power.","post_message":"Don't expect a word of this to sink in with those suffering from ODS."},{"comment_id":"10153982122994071","commenter_b":"Stfu","commenter_a":"No, no they shouldn't ... this is a classic example of over extending and away from your core business. The ramp up time is too long and the others can fill the gap fast. They need to stick to immediate delivery systems.","post_message":"Amazon.com is coming for the grocery industry."},{"comment_id":"10152888128321051","commenter_b":"Black white green. Wtf ever. Cant affort birth control. Then you can't afford kids.","commenter_a":"White women have babies too...not just black women.No-one should have children that they can't take care of,no matter what color you are!!---- i see that there are so many opinions about this post. I wasn't making this a race issue just stating my opinion.This country we call America is full of hate.We all can see this by all the name calling. It's a strange thing that some of you say it's not about race.anytime someone make a comment that doesn't support your views you call them a racist. I am not a racist i just can't stand people who continue to put my people down. I had to add these comments after i read the comments of so much hate. God made us all. The color of all our skin God made. So take your complaints to Him. It really makes me so sad that some people can treat others ...","post_message":"This state is about to ban low income single mothers from having any more children for 5 years."},{"comment_id":"10153775888041756","commenter_b":"Some of these countries send their boys to war as young as age 6. That's gendercide too. And a much more painful form of it. Like in Sparta where they would kill the boys if they didn't have a warrior's body. Male disposability exists throughout the world including the West. And it persists regardless of the sex of the leader. The Queens of England ruled half the world for long periods of time but it was still the men who were disposable. I would never expect the mass media to address that. Not for another hundred years that is.","commenter_a":"Those are going to be some very unhappy boys.","post_message":"Technology has enabled even the poorest of countries to boost the ratio of boys over girls. One expert even goes so far as to use the term \"culling\" when talking about what's going on in these countries — a word otherwise reserved for describing the removal of undesirable animals from the herd."},{"comment_id":"10153903118333690","commenter_b":"Israeisl go there with American pasports","commenter_a":"Donald Trump need to stop Americans going to Muslim Countries whether it,s visit or work","post_message":"US Republican front-runner Donald Trump wants to ban all Muslims from entering the United States. Elsewhere in the world, Tuesday marked the 50th anniversary of the Race Relations Act in the UK, which outlaws discrimination on the grounds of colour, race, ethnic or national origin. So, how has racism changed over time?"},{"comment_id":"10154858734646002","commenter_b":"@username I was shocked at the same thought, why would Disney have a man made Lake that wasn't somehow protected from alligators with a border fence ?!?! We've been there, never thought about alligators because it's Disney, they have safety rules and barriers everywhere.","commenter_a":"So let me get this straight ... Another parent is not watching their child in an area where it clearly says NO SWIMMING so now we are killing alligators for feeding in their habitat where once again it SAYS NO SWIMMING!! What is wrong with people ?!","post_message":"\"We have been to Yellowstone and encountered grizzly bears, but this is just freaky.\""},{"comment_id":"1263570023663025","commenter_b":"Be a lying pussy...ok","commenter_a":"Some People would not understand diplomacy, poise and intelligence go way further than acting out of anger and fear (like most of republicans are reacting) Obama is doing exactly what he is supposed to do!","post_message":"\"YOU ARE NEXT.\" President Barack Obama tells ISIS leaders they cannot hide. Read more: @webpagelink"}]
