[{"comment_id":"1784144245187941","commenter_b":"Oh shut up!","commenter_a":"If African Americans don't understand that they're being exploited and used for their votes by this woman, well then they'll get what they deserve after they elect her, a lot of nothing! So sad to see them falling for this. She's using a black rapper to pull in votes, amongst other things. Using a group of people for a vote is so wrong, nothing more. She's disgusting to do this.","post_message":"Hillary Clinton quotes Jay-Z during Cleveland rally: “Rosa Parks sat so Martin Luther could walk, and Martin Luther walked so Barack Obama could run, and Barack Obama ran so all the children could fly.”  Read more here: @webpagelink"},{"comment_id":"1242442195775531","commenter_b":"Some people like me are deathly afraid of spiders!!! Black widows can kill people!","commenter_a":"These foods are from plants. They grow outside on a farm. There are bugs and animals outside. Bugs crawl on plants! Good grief. Dump your produce in a colander in the sink and wash it.","post_message":"YIKES! A Bothell woman tells KIRO 7 she found a black widow spider hiding in her package of grapes.  Gary Horcher is talking to the woman, who has a warning for shoppers. >> @webpagelink"},{"comment_id":"10152697342252894","commenter_b":"Having a major craptastical, mitch, attituded 24/7 365 makes him a loser!! He is a jack hole!!","commenter_a":"Father, CEO, 100+ million in album sales from his music production (Jay-Z, Madonna, Mariah Carey, Ciara, Janet Jackson etc.), 30+ million in album sales and 21 Grammys. Being successful makes someone a loser? Ok","post_message":"Petty! If You Visit Loser.com, It Redirects to Kanye West's Wikipedia Page"},{"comment_id":"10154179126579411","commenter_b":"Gotta love the \"former\" officers or agents say the truth once they've retired.","commenter_a":"Shut-up CIA!!!! You funded and gave birth to ISIS !!!!!!","post_message":""},{"comment_id":"10153703239058984","commenter_b":"She would be the worst women president ever !!!!","commenter_a":"Same crap. Boring!","post_message":"She wasted NO time with this one...  Do you think Hillary would be the worst pick for president?"},{"comment_id":"10155025843208734","commenter_b":"Oh I remember lol","commenter_a":"Thats Ari Moran! I know him! Great officer!!!","post_message":"We're live in studios with Fairfax County Police Department's new bloodhound, Juneau! 😍❤️🐶"},{"comment_id":"1279380305469095","commenter_b":"Obama said there are 53 states. Everyone makes mistakes. Calm down","commenter_a":"Deployables go vote on the 28","post_message":"LOL! Donald J. Trump just told supporters to go vote 20 days after the election is over.  Video shared by Occupy Democrats, LIKE our page for more!"}]
