[{"comment_id":"10153001294901636","commenter_b":"Yes they do!! So it's just one person that has sex with all these people?? Or different girls?","commenter_a":"I think it would be funny to see all these people exposed!!! You shouldn't be cheating. Even though your not doing it in person and physical contact, your still cheating talking to that person if your other half doesn't know about it!!!","post_message":"A dating website that helps married people cheat has been hit by hackers who threatened to release information about millions of customers."},{"comment_id":"1033927403316825","commenter_b":"Good! Hopefully this will deter those damn anti-vaxxers from using Facebook and spreading their total stupidity. One can dream.","commenter_a":"Hip hip hor ehhhh","post_message":"Three cheers for Mark."},{"comment_id":"10153707986556491","commenter_b":"Brainless sheep! I like that","commenter_a":"Fabulous, great sense of humor and brains; trump is the icon of decadence under a cheap (very cheap) speech, only brainless sheeps follow him.","post_message":"“I have built a papier-mâché wall for Mexico. It costs $17.99. Fabulous!”"},{"comment_id":"10153903118333690","commenter_b":"Israeisl go there with American pasports","commenter_a":"Donald Trump need to stop Americans going to Muslim Countries whether it,s visit or work","post_message":"US Republican front-runner Donald Trump wants to ban all Muslims from entering the United States. Elsewhere in the world, Tuesday marked the 50th anniversary of the Race Relations Act in the UK, which outlaws discrimination on the grounds of colour, race, ethnic or national origin. So, how has racism changed over time?"},{"comment_id":"10153767433373132","commenter_b":"go girl.","commenter_a":"You are the most. Beautiful one there your Hair your. Clothes shoes. You go Rock it Beautiful!!!","post_message":"Counting down the days to New York Fashion Week."},{"comment_id":"558522770939482","commenter_b":"@username is PURE CANCER to this country, DONT LISTEN TO HER LIE's. GO SEE THE MOVIE THAT WILL EXPLAIN EVERYTHING THAT'S HAPPENING RIGHT NOW \"HILLARY'S AMERICA\" will burn this hag to the ground. NEVERHILLARY","commenter_a":"HAhahaha WHAT A JOKE THIS POST IS. THEY ARE ALL YOUR SUPPORTERS INCLUDING THE KKK YOU TOOK DONATIONS FROM.","post_message":"\"Couldn't have said it better!\" —David Duke, former grand wizard of the Ku Klux Klan, on Donald Trump's RNC speech"},{"comment_id":"10153848346775470","commenter_b":"Shes just drunk leave her alone","commenter_a":"Johnny Saenz","post_message":"Parents of students at an elementary school were outraged after they found out kindergarten teacher Klara Bowman had been fired after an accusation she was intoxicated in her classroom."}]
