[{"comment_id":"545668025630703","commenter_b":"Lock her up...","commenter_a":"Mrs @username President 2016 Women had no rights to vote. Just see how far women has come. Pervert Donald Trump discriminate women and abuse them sexually and when they dont give in. he trash talk them what sick beast he is. If this pervert wins you women becomes his slaves Vote for Freedom Mrs @username President 2016","post_message":"A note on Director Comey's letter, from Hillary for America Chair John Podesta. Chip in now to say you're standing with Hillary: hrc.io/donatenow  \"By now, you've probably heard some news about a bewildering letter sent to Congressional leaders by the Director of the FBI. This is all a bit confusing, and much of the reporting has been misleading or downright inaccurate, so I want to take a minute to walk through this.   Here's the quick backstory: In July, FBI Director Jim Comey concluded a year-long investigation by deciding not to go forward with any case about Hillary's emails. It wasn't even a close call, he said. In his words, 'no reasonable prosecutor' would have brought charges.  Yesterday, in a surprise to us all, Comey wrote a very strange letter to Congress that was long on innuendo and short on facts. He said that in a completely separate investigation, the FBI had found some emails that may or may not be related to Hillary, and indeed may or may not be significant at all.  It's being reported that Comey sent this letter over the objections of Department of Justice officials who told him that it was inconsistent with longstanding policy of both Democratic and Republican administrations not to take action that might impact an election. It's an unprecedented intrusion into a close presidential election with less than 11 days until Election Day.   Voters deserve answers.  Comey needs to come clean with the American people about what he found and answer all the questions about why he took this unprecedented step less than weeks before the election.  Here's what this changes for you and this campaign: Absolutely nothing.  The facts be damned—Trump's always shown a complete disregard for the truth. In spite of there being no new information, he's already raising money off the bizarre letter (he literally sent a text message asking for money within an hour of the story breaking!) and he's more fired up than ever on the trail today.  These are the actions of a desperate man. Trump knows he can't win on his character, temperament, or his policies. He's behind, so he'll cling to whatever he can. We can't let him get away with this.  Our organizers and volunteers on the ground are rallying behind Hillary in what will be the biggest volunteer weekend of the campaign so far. You need to have her back, too. You need to say you're not willing to let Trump bully or buy his way into the presidency, and you're not going to let anything stop us from making history.  There are ten days to go. Let's buckle down, stay focused, and win this. Chip in here: hrc.io/donatenow\""},{"comment_id":"10153226873549170","commenter_b":"Wrong. BOTH parents have to be citizens at time of birth. His father didn't become a citizen until 2005. If I go around the world getting women pregnant, those children are NOT citizens of the USA.","commenter_a":"First I like Cruz. There is no question he is a citizen. The real question is he a natural born citizen. Back in the day when I was in grade school (before history was re-written on the issue) we were taught that you had to be born in the United States to be president.","post_message":"There's plenty to debate about the race for the nomination, but folks, can we please put this question to rest?"},{"comment_id":"10154682154393984","commenter_b":"She's the whore of Babylon","commenter_a":"Let me tell you all her dx.......she needs Jesus Christ!!! Maybe she is possessed by a demon, highly likely......! God has allowed her to come to ruin because she wont turn from her wicked ways.....for those who do not like my comment.....read your bible, you will find out lots a things God allowed to turn people away from sin!!!","post_message":"There's been lots of speculation about what might be ailing Hillary Clinton, if anything. One dental expert took a look inside Hillary's mouth... and almost instantly, he said he knew the condition that's been causing all of her health problems.  Could this expert be right?"},{"comment_id":"10153683983505575","commenter_b":"This country is OWNED AND RAN by Muslims.... Obama will make you accept Terrorist Muslim Refugees... There is nothing you can do about it,,, UNLESS YOU FIGHT his Civil war ( Marshall Law ) he is forcing upon you..","commenter_a":"I think it time .... all the state stand up to penis head... fight for our freedom of speech and rights to bear arms.... protect our U.S....","post_message":"BREAKING. . . ."},{"comment_id":"10152993021545667","commenter_b":"The Donald brings women to be his wives to the USA so they'll marry him and make them legal citizens, did it twice","commenter_a":"Support Donald Trump.","post_message":"\"I cherish women,\" Trump told Hannity on Tuesday night."},{"comment_id":"569853826519212","commenter_b":"So how was your nap after clearance today then?","commenter_a":"@username this is you","post_message":"Facts"},{"comment_id":"1788072574740832","commenter_b":"jesus Christ those girls look petrified","commenter_a":"@username @username 😱😱","post_message":"Parents in remote parts of Malawi are sending their daughters to be sexually initiated by local men - called \"hyenas\" - when they reach puberty. Meet Eric, he’s proud of his role as a \"hyena\". Learn more from BBC News Magazine: @webpagelink Listen to the documentary: @webpagelink"}]
