[{"comment_id":"10152706820701051","commenter_b":"A lot of the comments posted here are no better then the girls who did this. Nothing but a lot of hate.the girls had no right to hurt anyone.But are you any better.look at your comments.and yes I think this girls should pay for what they did.Bottom line no has a right to go beating up people .Got a problem do it right call the law.that's is if your not just personally the one wrong","commenter_a":"Its racially insensitive to assume black girls can tell the difference between right and wrong. As well as controlling their impulses. Seriously white folk....one step at a time.","post_message":"One of the women who beat up this teen girl says she’s the real victim. Here’s why."},{"comment_id":"639833176157924","commenter_b":"Data and meta intelligence gathering of phone and internet data has NOT in any way shape or form been Stopped. Theres just been several bills past so that its now need to know disclosed. And America has had the uk parliament put these same laws here. So that from a judge is a downright lie. Also almost every american these days became that way from imigrants. Infact at one point more than half of Scotlands population emigrated to the Usa. To try and scare monger over a handfull of idiots that went mental over the several million who are helping the united states in the military, your hospitals , your restaurants etc. Its just cringeworthy and shamefull. And defending your self is one thing no one would want you to not do. No one wants harm on anyone. But more guns will only mean more dangers and more tragic and ...","commenter_a":"Opening statement? To what!? It'll soon be 2016. How long will you continue to spew this inflammatory propaganda?","post_message":"\"Number one: Get a gun.  Buy one legally.  Learn how to shoot.  And be primed to use it.\"  Last night on \"Justice,\" Judge Jeanine Pirro shared her plan for \"surviving\" in the wake of the #SanBernardino terror attack. @webpagelink"},{"comment_id":"10156788493850389","commenter_b":"My family and friends in Utah are behind Trump!","commenter_a":"Please Utah vote Trump!! He cares about We the People.","post_message":""},{"comment_id":"469971939860053","commenter_b":"look its him the bitch","commenter_a":"No way Michelle we have the right. Guns don't look for people to shoot look and see who are the vandals and thieves that are doing the shooting killing their own people","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"996887350366269","commenter_b":"Democratic Presidential Debate CLINTON vs SANDERS --- @webpagelink","commenter_a":"I drove 4.5 hours to Flint, Michigan, this week from Toronto, Canada, to volunteer my time on the @username campaign in the days leading up to the Michigan Primary. The people who work in Bernie's Flint office are passionate people with a strong desire to change America and help the people of Flint. I have actually never seen such an example of government neglect in my life. I spent a significant amount of time handing out water, door to door, and I still can't shake the feeling of being helpless - I felt helpless that I couldn't do anything to help them and I felt even more helpless that no one else was doing anything to help them either. I am not an American, but I know that America is better than this. No civilized society should allow hundreds of thousands of their own people to be neglected and abandoned ...","post_message":"The governor of Michigan must resign, but more importantly we must take action to help the people of Flint. Children in America should not be poisoned. The federal government must act. No one should pay a water bill for poisoned water. #DemDebate"},{"comment_id":"10153184020474726","commenter_b":"What a disgusting a hole.","commenter_a":"what a piece of dog feces","post_message":"\"He didn't win, did he?\"    Harry Reid confronted on his lies, with no regrets."},{"comment_id":"1749063398683963","commenter_b":"Shut up- you're just another puppet of clinton. There is no way in hell that trump is more dangerous than that witch Clinton. How much were you paid?! Were you threatened. Clinton must be stopped. Clinton is the threat! She is in with muslim radicals and is going to move toward removing guns from the citizens and let terrorism continue! Give trump 4 years- he will do better than Clinton!","commenter_a":"I wouldn't trust the CIA or the FBI if my life depended on it.","post_message":"\"Donald J. Trump is not only unqualified for the job, but he may well pose a threat to our national security,\" he said."}]
