[{"comment_id":"1325104020861488","commenter_b":"Both of those nut cases should be locked up and hit with $100,000 bail, third party and charged to the fullest extent. A little jail time should be mixed in with their punishment.","commenter_a":"Even as a woman I would have jumped in. But I'm a Country girl. I can whip ass like a Man. Especially when it comes to someone's life.","post_message":"A Florida police officer saw a car speeding over 100 miles per hour and stopped it on I-75 in Collier County, which the two men inside didn't seem to appreciate. After pulling a little trick before getting out, they began attacking the cop in the street to avoid arrest when they were met with an incredibly perfect dose of karma that they didn't see coming. @webpagelink"},{"comment_id":"459509127578200","commenter_b":"She still has it","commenter_a":"I would love to dance with ..you go girl..!","post_message":"I can't stop laughing!"},{"comment_id":"505614509629101","commenter_b":"Kendra Alison and Edward Michael Davila. The story continues.....","commenter_a":"Alison Anderson! Ann DuBay!","post_message":"Announcing the news today, his attorney tweeted in all-caps: \"WE WON A NEW TRIAL FOR ADNAN SYED!!!\""},{"comment_id":"900665266646768","commenter_b":"abortions have been going on before obama ever took office","commenter_a":"Abortion is indeed murder, and he is the ring leader behind it all.","post_message":"Eight years with a pro-abortion radical is eight too many. No more pro-aborts in the White House!"},{"comment_id":"1736640533224849","commenter_b":"What are the Muslims doing to make Christian's comfortable?????? We as Christiams MUST stand up for our rights.","commenter_a":"she is a fool! crosses belong in CHRISTIAN churches! maybe she needs to be a muslim preacher. shame on her for denying Christ!","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More 'Comfortable' We are talking about a Church. This is ridiculous. Do you think society is becoming too sensitive?"},{"comment_id":"1174084612658964","commenter_b":"They are sex obsessed weak willed bonobos.","commenter_a":"What is the anti gunners obsession with genitals and degeneracy","post_message":"Cocks Not Glocks, the gun control group that literally strapped gigantic dildos to backpacks and made lewd gestures that would get any man thrown in prison, was invited to the White House last week. They actually completed their trip on Friday while I was enjoying my time fishing on the Oregon coast. The Cocks Not Glocks organizers posted their White House trip on all their social media accounts making it a big deal - all while Trump was taking flack for saying the word \"p*ssy.\" Now, as a woman, I have said before that I… [ 224 more words ] @webpagelink"},{"comment_id":"898930746862951","commenter_b":"You sure use a lot of words to say \" I don't have a clue \". Don't you ?","commenter_a":"Take it to the Supreme Court. We only make them pass a background check to buy a gun. That's it. Gun purchasers have no other culpability. Why not a background check for ammo? If gun and ammo purchasers were held responsible for keeping their weapons out of the wrong hands, we wouldn't have as as many shootings. Right now, they pass the background check and then can hand the gun over to whoever they want. A simple law making a background check necessary to buy and use a specific gun would prevent this. Make the legal purchaser responsible to ensure that anyone using the gun has passed their check. Every shooting, trace the gun to the legal purchaser and throw them in jail, if the shooting wasn't the owner protecting themselves. We have technology that can recover removed serial numbers. Gun owners wouldn't let their guns out of their sight. ...","post_message":"Thanks, NRA!"}]
