[{"comment_id":"10153565993448271","commenter_b":"Those people are a bunch of Pathetic Savages and Thugs. Just look at their wild behavior. You would think... that the Police should have arrested scores of them. It must had been too much Rock & Roll or Punk Acid Rock.","commenter_a":"I can understand being excited but destroying public property and acting like a bunch of idiots is ridiculous.","post_message":"This is disappointing. While many people celebrated the Broncos' Super Bowl victory peacefully, some were destructive. Denver Police made 12 arrests and thankfully, no one was seriously hurt. @webpagelink"},{"comment_id":"1234345436618217","commenter_b":"They had a class on how to not rape women? Send the raping muslims home","commenter_a":"Stupid girl, wait until it happens to her or someone close to her, then she will change her tune.","post_message":"Watch as Red Cross spokeswoman cautions that this is just an isolated incident involving a teen who just didn't know any better...."},{"comment_id":"482704838584476","commenter_b":"Yea just can't fix stupid... While Obama tries to shove his deal down Americas throat - Iran is laughing at us, buying weapons and building bombs - Better war with them today than tomorrow - Iran has no purpose, no value - Just make it a dust bowl.","commenter_a":"Nuke China & Iran!","post_message":"So, please Obama explain us, how this deal prevent war?"},{"comment_id":"10153328261067093","commenter_b":"****Illegal immigrants.","commenter_a":"It's funny y'all keep talking about Democrats. I guess y'all are the same incompetent people that voted for Bush twice. Donald Trump has his head up his anus. He doesn't know the first thing about running a country. Let me guess he had y'all at Wall? He would build one to stop immigrants. All immigrants aren't bad they just want a better life. LeRhonda Flowers","post_message":"A resident of a tiny island in Canada is rolling out the welcome mat if Americans want to flee after Election Day.... @webpagelink"},{"comment_id":"10155452479610725","commenter_b":"I would vote for you","commenter_a":"Yes Yes positive steps move forward not backwards","post_message":"For America to be strong again, the ways of politicians must be put in the past. Let’s Make America Great Again!"},{"comment_id":"10153224960603984","commenter_b":"oh boo fuckin who leave bitch and take your husband with you","commenter_a":"She's out of touch on everything!!","post_message":"People are furious, and I can understand why. Do you think Michelle is an out of touch First Lady?"},{"comment_id":"1007375585988585","commenter_b":"You're a bitch brady","commenter_a":"Yet another reason to dislike Tom Brady.","post_message":"Tom Brady's support for Trump may be as soft as his balls."}]
