[{"comment_id":"10153526773721350","commenter_b":"Those hips are MALE hips!","commenter_a":"She look so stunning & beautiful tonight","post_message":"Caitlyn Jenner shared some very powerful words from the podium."},{"comment_id":"10153532117044586","commenter_b":"Test on the bimbos that model, that's what I say. Ugly monsters","commenter_a":"Please, help, Humane Society International...please.","post_message":"TERRIBLE NEWS: Here are some of the animals who will be hurt for Victoria's Secret."},{"comment_id":"958393367537826","commenter_b":"All blacks destroy their housing and no whites do right Shawn?","commenter_a":"Yeah how dare those desperately poor people in Africa decide what they can do with their own resources to get some income from wealthy people who want to spend it.","post_message":"52 percent of all lion trophy exports end up in the U.S., and its share of the trophy trade has been growing. #CecilTheLion"},{"comment_id":"1287108874642473","commenter_b":"OF COURSE OBAMA`S AND HILLARY PAY CHECK FROM SAUDI ARAB IS GETTING BIGGER BY SECOND , IMAGINE WHEN THIS HYENA BRING MORE OBAMA`S ANGEL REFUGEES... HOW BIG HER CHECK WILL BE..? HYENA CLINTON WILL NEVER SUFFER MUSLIN VIOLENCE , SURROUNDED BY HEAVY ARM BODYGUARDS , OK...WHAT ABOUT YOUR FAMILY..? IF OBAMA`S GANGSTERS TAKE OUR GUNS ...HOW WE ARE GOING TO PROTECT OURS FAMILIES...? WORKING HARDER IN ORDER TO FEED OBAMA`S ISLAM ORPHANS & WIDOWS ANGELS OR BLACKANIMALMATTER OR ILLEGALS ,...DEMOCRATS SLAVERING THE PLANET FOR ISLAM ...NOT SEE IT YET ...SERIOUSLY ..? CHECK HOW MANY PEOPLE ARE ON WELFARE OR FOOD STAMPS ..","commenter_a":"Who is the mayor?","post_message":"\"If you go 15 miles from downtown you will find communities that don't have water or sewer yet.\""},{"comment_id":"10153577937396162","commenter_b":"I have always said, the best person to fix a budget problem is a single hard working mama! That woman knows how to stretch every last penny to make it count! If you don't need it and don't have the money for it...you DON'T buy it!","commenter_a":"This is why Illinois has a money problem! Corruption and greedy politicians!","post_message":"BREAKING: Former Governor Rod Blagojevich's sentence has been thrown out and he has been awarded a retrial on 5 counts... @webpagelink For the stories you care about - \"Like\" ABC 7 Chicago!"},{"comment_id":"10153054078171336","commenter_b":"hey @username you guys have been saying that for 6 years. Settle down haters! And you sound like an idiot.","commenter_a":"Dig deeper because this is not enough to derail her run. She kept the records!","post_message":"“Can we trust Hillary Clinton to produce all of her email when we couldn’t trust her to obey the law that she had to use a State Department email?” – Senator Rand Paul asked on tonight's The Kelly File. @webpagelink"},{"comment_id":"1342533789196332","commenter_b":"It's all the evil devil and god. God controls everything so all Christian's say. So he was obviously murdering babies in Syria with an American fleg while satana Satana was makin googoo sing good lol. It's the devil but. Fuk away aff to your backward bible ye balloons and leave the rest the world out your hilariously illogical book of fairytales. Batter still. Get one your mates to stab you in the eyeball so you get t meet Jesus sooner and save us having to see an read your hilarious pish from the days before people could read. Pol","commenter_a":"They all signed in blood, sold they're souls! Devils!","post_message":"Someone Removed Background Music From Lady Gaga’s Superbowl Show, And It’ll Give You Goosebumps"}]
