[{"comment_id":"543983115775139","commenter_b":"Let them keep walking to wherever they came from","commenter_a":"Let them walk all the way to the muddeled East.","post_message":"Muslim Students Walk Out During National Anthem [VIDEO] If don't want to show your respect for our country, you can leave. Are you appalled by their blatant disrespect?"},{"comment_id":"10153181723473984","commenter_b":"Put all of them in jail there all criminals","commenter_a":"He needs to go!!!!!!!!!","post_message":"Unbelievable! Boehner just gave Obama exactly what he wanted... Do you feel betrayed?"},{"comment_id":"10154917656616509","commenter_b":"People, here the moronic trump plan : deport Americans from America! Ban Americans immigration from state to state. Unless you're a Caucasian with 'orange paint' on your face, then you must wear a badge to show who you are! That's the moronic trump have plans for America!","commenter_a":"So many people dead and Obama plays politics and slams Trump, Whats Obamas plan to stop this, He dont have one, Trump has one","post_message":"President Barack Obama on use of the term \"radical Islam\": \"What exactly would using this label accomplish?\" @webpagelink"},{"comment_id":"10155119419651320","commenter_b":"Looks pumping","commenter_a":"THE ISSUE IS NOOOOTTTTT MUSLIM!!!!!","post_message":"Democrats hold an anti-Trump protest in Washington D.C."},{"comment_id":"10154399971344087","commenter_b":"@username u one sick bitch","commenter_a":"Obama was basically a community activist turned president. No real domestic and certainly no foreign experience at all. Except maybe he was born in another country. With that said, trump is much better prepared day 1 than obama ever was.","post_message":"\"It is a source of great concern that our country is now in the hands of someone who seems to lack an ability to weigh the consequences of domestic and foreign policy decisions where great risks abound.\""},{"comment_id":"10154046888226167","commenter_b":"If their lesbians,where does the sperm come from?","commenter_a":"Did he say lesbians pouring blood, and eating milk and sperm? ahahahaha!!!","post_message":"Trump ally Alex Jones claims Secret Service is terrified of \"devil worshiper\" Hillary Clinton because she \"acts like Linda Blair\" and \"flops around on the ground\" and \"spits at them\" and \"stinks!\""},{"comment_id":"10153460596675779","commenter_b":"Complete agree David!!! Oh, by the way, I'm a female gun owner ;)","commenter_a":"She is a genius. I hope she realizes how hard your life can get when you make an enemy of the NRA! All you have to do is casually mention gun control or background checks and 50 whack - jobs will jump down your throat. If you're on t.v. it must be much much worse. Look what happened with Amy Schumer.","post_message":"Samantha Bee highlighted a glaring, surreal NRA double standard on Full Frontal with Samantha Bee yesterday, stockpiling a small weapons arsenal while trudging through red tape as she tried to nab her own Eddie Eagle costume, the NRA's gun safety mascot. Watch below."}]
