[{"comment_id":"449511958572680","commenter_b":"This lady is nothing but a liar...","commenter_a":"Muhammad ordered beheadings and other extreme violence as does the Quran today and all of Islam idolizes them as does Obama and Hillary!!","post_message":"The divisive rhetoric and encouragement of violence we're hearing from Donald Trump isn't just wrong—it's dangerous."},{"comment_id":"10153812435979218","commenter_b":"Watch out these Fkn MUSLIMS WILL BURN THEY'RE WAY INTO TOWN!!!?? MAKW EVERYONE LEAVE!?? GOOD JOB SHO EVER LET THE BLOCK GET BUSTED !!!?? I'D LOVE TO KNOW HOW MUCH INSURANCE WAS ON IT!! POOR DAMM FIRE FIGHTERS FIGHTING FOR NOTHING!!! GOD BLESS THE AMERICANS. UNITED WE STAND!!??","commenter_a":"Yeah arson. Hmmm.","post_message":"UPDATE: More photos from SkyTeam 11 of a large fire that has engulfed the old Milford Mill Swim Club >> @webpagelink"},{"comment_id":"631924593629516","commenter_b":"STUPID C..T","commenter_a":"Cheers for Hillary from Seddique Mateen, father of Pulse Nightclub Terrorist – and ideologue supporter of the Taliban and Critic of the LGBTQ community! • Seddique Mateen, the father of Orlando Pulse nightclub terrorist Omar Mateen, was spotted sitting behind Hillary Clinton at her campaign rally on Monday, August 8, in Kissimmee, Florida. • Clinton was paying tribute to the victims of the Pulse nightclub massacre at the rally when an employee of NBC affiliate WPTV noticed that one of the rally goers seated directly behind the Democratic presidential nominee was Seddique Mateen, the mass shooter’s father. • When asked about how Mateen received this preferred seating at her rally, Hillary Clinton, walked away without answering any questions. • Who instructed that Seddique Mateen be placed in such prominent seating at the Florida rally and why would they do so? • If it was a judgment error by Clinton’s staff ...","post_message":"\"I don't think what Donald J. Trump says is worse than actually what Hillary Clinton in fact has done.\"  - Green Party presidential nominee Dr. Jill Stein"},{"comment_id":"10156008718310354","commenter_b":"Omg still an ugly turd inside and out. Who cares what this bitch thinks or says!!!","commenter_a":"Yeah.... there is someone with less class than a pig.","post_message":"Just when you thought she couldn't be any more vile..."},{"comment_id":"10154362083273325","commenter_b":"Oh Baloney California is the Welfare , Illegal State !","commenter_a":"California is what's known as a donor State, in other words, we pay more in Federal taxes than the services/benefits we receive. This idiot needs to do some research before threaten us with his ridiculous tweets. #Resist #NoBanNoWall #RussianPoodle","post_message":"Describing California as \"out of control,\" President Trump said he would not be opposed to using defunding as a \"weapon\" against states that want to be sanctuaries for undocumented immigrants."},{"comment_id":"10154046383106509","commenter_b":"invasion of economical immigrants/social benefits leechers under camouflage of refugees","commenter_a":"Theres awfully a lot of Military age male in these \"refugees\".","post_message":"Germany to impose border controls with focus on its border with Austria. @webpagelink"},{"comment_id":"1841493012732673","commenter_b":"Another Asshole.... crawl back under the rock you came out from and take that Orange face dumb ass with you","commenter_a":"Really??","post_message":"Straight from the horse's mouth!"}]
