[{"comment_id":"10155835827900615","commenter_b":"About damn time they got these creeps off the air!","commenter_a":"Unfortunately another network will probably pick them up.","post_message":"BIG BREAKING NEWS –"},{"comment_id":"10156643152565354","commenter_b":"Looks like a bad week for the Hollywood elites. He and Jada can cry on each other's shoulders. Just goes to show you that living in a mansion in Beverly Hills, riding in chauffeured limos, traveling the world and having the best of everything, still doesn't make these people happy. Pitiful!","commenter_a":"Booob!!!","post_message":"BAHAHAHA!"},{"comment_id":"837279236391341","commenter_b":"She's a stupid twat","commenter_a":"How dumb can any one person be?","post_message":"Come again??"},{"comment_id":"10156322425460725","commenter_b":"Maybe ISIS knew America would take in the refugees, it was there plan all along to have a easy way into America to destroy us! Lord help us all.","commenter_a":"He's a traitor, he is just a resident of the white house, he has broken the oath and is no longer legally the president","post_message":"What is our President doing?"},{"comment_id":"901304566673644","commenter_b":"A woman's right to KILL her alive yet unborn child!!!","commenter_a":"Save the fetus- starve the child. They're not pro-life, they're pro-birth.","post_message":"Accurate."},{"comment_id":"10152905378740736","commenter_b":"Shes an idiot..lmao","commenter_a":"Send him home to Mexico please.","post_message":"Two young girls told security at an H&M store that the man was positioning his phone under women's skirts."},{"comment_id":"1002435359842664","commenter_b":"One things for sure there's plenty to pray for. For those precious children, for their mothers who have been fed lies from hell's own lips, and for those who would advocate for such heinous things to go on. I guarantee you this girl has had a couple of abortions and they were oh so wonderfully sickeningly sweet to her- so that they can use her face and influence. Makes me sick. Yes, she is responsible for her sins, but she's just a rebellious, gullible kid that several of these snakes have sunk their fangs into. Just like Brittany Spears before her- and Raven Symone.","commenter_a":"My heart went out to her when she started turning crazy. She's in the throes of rebellion, but I think it came because some of the snakes of Hollywood influenced her. She's rebelling against her dad, and the way he's tried to raise her, like many of the child actors and performers before her. The kid used to want to be a missionary and help save lives. Now she wants to be a champion for killing. I will still pray for her. God's arm is not short.","post_message":"\"I'm a good person to put on the face of a T-shirt.\""}]
