[{"comment_id":"949160488506463","commenter_b":"THIS IS 9AMERICA0 NOT SYRIA","commenter_a":"May I remind everyone, This is America and the judge was correct. Swear to the truth by swearing to it on the Bible!","post_message":"Did a judge violate this woman's religious freedom or were his actions justified?"},{"comment_id":"10153427375089726","commenter_b":"this brain dead old witch needs to be in a mental ward","commenter_a":"Congress can deny funding and they better. Premiums are going through the roof . Supreme are bunch of liberals out of touch with the average folks.","post_message":"According to Pelosi, Scalia ... joined the majority?  @webpagelink"},{"comment_id":"925335920856271","commenter_b":"What has she done is any of her \"jobs\" ??","commenter_a":"let's see.... do nothing, do nothing. who cares.. liar, philanderer, cheat.....","post_message":"Some familiar faces on Roosevelt Island."},{"comment_id":"1180323918655284","commenter_b":"My cats r broken, both are at best apathetic toward boxes, at worst terrified of them, depending entirely on size and location","commenter_a":"Elizabeth Dain","post_message":"Happy international cat day!  Here's a question for you - why do cats love boxes so damn much?  Find out: bit.ly/1zUeu4c"},{"comment_id":"10153515139311680","commenter_b":"Hillary already knows she's becoming the POTUS. There's nothing stopping her. We will have a female president! Can't wait. #ImWithHer","commenter_a":"It's just riding off of the success of Bill because nobody likes her","post_message":"Hillary Clinton: \"I’ve told my husband he’s got to come out of retirement and be in charge of this, because you know, he’s got more ideas a minute than anybody I know.\""},{"comment_id":"426764770781451","commenter_b":"let the idiot walk home ! she does not deserve to be around others !","commenter_a":"Her Bus, Her Rules.","post_message":"This bus driver decided to teach a foul-mouthed teen some manners."},{"comment_id":"533139670207659","commenter_b":"She can take her sorry ass over there and live bet they wouldn't let her stay long","commenter_a":"she is a complete WASTE AND NEEDS TO BE PUT IN JAIL ALONG WITH HER COHORTS..","post_message":"She is DELUSIONAL..."}]
