[{"comment_id":"10154996547968010","commenter_b":"Let the muther fucker SUFFER!","commenter_a":"Think he'll be well enough in time for Trump to appoint him to the SCOTUS?","post_message":"A source said Manson was seriously ill and it was unclear how long his treatment would take."},{"comment_id":"979014955531025","commenter_b":"Yes yes Milana the porn star.","commenter_a":"Did anyone besides me have flash backs to Jackie Kennedy when Melania walked out Classy dressed to the nines This lady loves America This lady will be a great first lady","post_message":"Donald J. Trump made a dramatic entrance at the GOP convention and introduced his wife Melania Trump. #RNCinCLE @webpagelink"},{"comment_id":"10153815303155695","commenter_b":"He is not in position to bless anyone! Really?","commenter_a":"Ughhhhhhhh. This man isn't Jesus. He is just a man. And not a good man. Wake up people and stop worshipping the pope before he drags you all to hell. That's what he is trying to do. Only one way. JESUS CHRIST. NOT THE POPE. NOT MARY. PRAY TO THE ONE WHO DIED FOR YOU!!!!","post_message":"\"The Pope’s gesture was beautiful and meant something special to our family,\" she said."},{"comment_id":"10153733142212708","commenter_b":"Looking at the next Presidential Family.","commenter_a":"Have a blessed Thanksgiving. You have a lovely family and we all have so much to be thankful for on this day. All the best to you on the campaign trail. A special thank you to the brave men and women who are serving in our military worldwide who can't spend the day with their families. They need a Commander-in-Chief who can provide them strength and guidance during troubled times and you, Senator, can do just that. Warm regards.","post_message":"From our family to yours, Happy Thanksgiving"},{"comment_id":"1045431208809965","commenter_b":"This is not news worthy.","commenter_a":"Who cares?","post_message":"BREAKING> Beijing wins bid to host 2022 Winter Olympics. China's capital will be first city to host summer & winter games."},{"comment_id":"10153335788334714","commenter_b":"Still a bitchh","commenter_a":"They named it the failed \"parenting\" tree in honor of welfare checks, EBT cards, and Section 8 vouchers.","post_message":"The trees were chopped off at the trunk"},{"comment_id":"915863931882175","commenter_b":"I think he should be raped until bleeds to death","commenter_a":"Let him go to prison and play with REAL BIG MEN","post_message":"Amanda awoke to find her baby was missing. She found her in the basement bleeding and unconscious. This man had raped the 9-month-old infant until she was brain dead. He was arrested and is in jail, but many people think he deserves a harsher punishment for his crimes. A new petition is calling for him to be hanged in public for his disgusting crime.   Should he be hanged?"}]
