[{"comment_id":"10153618306573352","commenter_b":"Please baby I have money I'm rich bitch!","commenter_a":"Well By his looks he is already seriously injured lol","post_message":"Tracy Morgan settles with Wal-Mart after store's truck hit his tour bus, killing his friend and leaving him seriously injured"},{"comment_id":"10156224999290551","commenter_b":"Go back to your own shithole country.","commenter_a":"Let's wrap them up in bacon and send em back to where they come from😎","post_message":"Trump was right - Muslims did celebrate 9/11."},{"comment_id":"1863352450575527","commenter_b":"She's a nasty which!!! I really felt sorry for Joy she was totally rude to her and had the look of revenge in her eyes toward Joy she should be ashame!!!!=","commenter_a":"Omarosa achieved \"fame\" by being nasty. She is perfect for Trump. She was a disgrace with her last comment to Joy. She literally gave me the chills. I was concerned about Joy's health (and mine) - Omarosa was so vile and consistently lied. She (along with Trump and his Trumpettes) could give good, caring people a stroke!","post_message":"It wasn't pretty."},{"comment_id":"944012942300794","commenter_b":"I definitely would pitch in for her ticket BACK to HER country. If she said this crap in HER country, she'd have her tongue cut out or be-headed, or better yet killed . Get the blank blank outta MY country. Thank you to all our service men who give their lives for OUR COUNTRY.......","commenter_a":"Don't like it leave !!!!","post_message":"A Muslim woman confronted a female cashier about her flag pin... What happened next is going VIRAL!"},{"comment_id":"10152820448531051","commenter_b":"John Jo, you say, don't fight the battle until they come knocking on your door, well how many Americans have been killed, beheaded, this isn't knocking on our door ,than what is. He's the BIGGEST POS TRAITOR WE HAVE EVER HAD, HE WILL GO DOWN AS THE WORST PRESIDENT IN HISTORY. HIS ONLY CLAIM TO FAME, HE TRIED TO DESTROY THE UNITED STATES. HIS ASD SHOULD BE IN PRISON.","commenter_a":"Thanks to Obama!!!","post_message":"As if ISIS didn’t have enough weapons at their disposal – now they have chemical weapons."},{"comment_id":"1862910250609136","commenter_b":"Girl bye, take your dirty mouth with you","commenter_a":"Go to Gitmo you A hole!","post_message":"Lol. Celebs can't even."},{"comment_id":"1334233936596633","commenter_b":"The wall goes up. No more cowardly Muslims in the White House. We've had enough","commenter_a":"Go ahead and lock up the nomination. It's irrelevant. There isn't going to be a Republican in the White House next year.","post_message":"Today's vote could decide whether Donald J. Trump will lock up the nomination outright."}]
