[{"comment_id":"10157180953385389","commenter_b":"she's a waste of skin!","commenter_a":"Oh, that was an Economic Speech. I did not hear anything of her plans for the economy but she was well studied on what she thought Donald J. Trump might do. Why will she not tell us her own plans?","post_message":""},{"comment_id":"10154261503546770","commenter_b":"Hollywood is full of whores!","commenter_a":"Omg. It's just a dress! Didn't your mothers teach you that if you don't have anything nice to say, don't say anything at all!!! Looks like you could all use a lesson in kindness!!","post_message":"Holy moly, Jennifer Aniston."},{"comment_id":"10153294543663701","commenter_b":"Lets here the song about an old woman molesting you when you were a kid.. LMAO!","commenter_a":"@username :)","post_message":"Garth Brooks rocked the Rose City on Sunday! If you missed out, the Moda Center just announced that limited tickets are available for his three remaining Portland performances."},{"comment_id":"1157451387627650","commenter_b":"Another sidetracking trick.","commenter_a":"Ah yeah. That should do the trick.","post_message":"OBAMA'S NEXT MOVE TO SCREW AMERICANS and protect illegal aliens...  @webpagelink"},{"comment_id":"10152759564322217","commenter_b":"Poor People :(","commenter_a":"May the victims be comforted by those of all faiths and races. A rare opportunity to share love","post_message":"More than 1,000 people have been killed in the Nepal earthquake. @webpagelink   * Deaths in Nepal, India, Bangladesh & Tibet  * Avalanche in Everest kills 8 * Centuries-old temples flattened"},{"comment_id":"10154164608531438","commenter_b":"Can masculine looking lesbians use the bathroom in your world Dina? Doesn't sound so.","commenter_a":"I think this is a positive thing, but most people I've talked to that oppose that bathroom scenario is not from the perspective of the transgender, but from what harm could come from people abusing that system to gain access to bathrooms they wouldn't normally have access to. If there was a way to guarantee kids and women's and men's safety in the bathrooms, then I don't think people would mind..regardless, we should be teaching both genders to not be dick holes to other people, regardless of what bathroom they most identify with.","post_message":"This moving ad on transgender bathroom rights will air for Fox News viewers during the final night of the Republican National Convention."},{"comment_id":"1237650529605618","commenter_b":"Who is going on the Walking Dead cruise in February","commenter_a":"This is kindergarten.....,childish.........by.....","post_message":"The Walking Dead gift reveal party"}]
