[{"comment_id":"10153195780106130","commenter_b":"I'd give her an orgasm!","commenter_a":"Who's the asshole out there denying women orgasms??? Selfish prick!","post_message":"'Don’t not have an orgasm. Make sure he knows that you’re entitled to an orgasm.'"},{"comment_id":"620315121449719","commenter_b":"Would make a great couple . Two freaks .","commenter_a":"HE likes. HE likes. HE aint a SHE!!!","post_message":"Caitlyn Jenner says she likes Ted Cruz because “he's very conservative, and a great constitutionalist.” @webpagelink"},{"comment_id":"905085592863011","commenter_b":"I got 8 right","commenter_a":"Yes","post_message":"Let us know how well you do!"},{"comment_id":"10155080825746037","commenter_b":"Andrea ... it is scientific fact that bees couldn't fly without wings, but, pull the wings off of that bee and it is still a bee ! Semper Fi","commenter_a":"There is a scientific basis for being transgender. The brain's gender identity and the genitals develop at different times in utero. So mismatches due to hormones are possible. If God knits these children together in the womb, He must do some transgender knitting. A boy who goes through a phase of wearing a dress is entirely different than a boy who persistently and insistently over a number of years says he is really a girl. Psychologically, it is best for these kids to use modern medicine to enable their outsides to match their insides.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"760411690754543","commenter_b":"We have enough oil in this country for the next 400 years but John Bush wants arab oil imported not american oil","commenter_a":"We've had enough of oil energy and oil families like yours. Get lost. You're not welcome on this planet anymore.","post_message":"If we embrace our energy revolution, we can create millions of jobs and higher wages: @webpagelink"},{"comment_id":"1634982916802334","commenter_b":"I haven't seen this yet!!!","commenter_a":"'@username my fav","post_message":"Cubs players sing 'Go Cubs Go!'"},{"comment_id":"10153459531098855","commenter_b":"Attention whore","commenter_a":"Even her wig looks sad to be there","post_message":"Not another one!"}]
