[{"comment_id":"1576836375956014","commenter_b":"And yes, you will pay for that f'n wall!","commenter_a":"Fox apologized to Trump and invited him in May. He is a liar","post_message":"The former president of Mexico, Vicente Fox Quesada, says Donald J. Trump is using his visit to Mexico with President Enrique Peña Nieto to boost his sinking poll numbers. @webpagelink"},{"comment_id":"10154872503577042","commenter_b":"If the child is deemed not viable for life outside the womb they will grant an abortion however get this there is nothing written into this law to protect the mother or take her health into consideration at all. It is a disgrace!! Turning women into human incubators whose body is controlled by the government.","commenter_a":"Wow are people really so uninformed? What if the baby has a condition incompatible with life or if the mother's life is at risk? What if it's an ectopic pregnancy that isn't always known by 6 weeks?","post_message":"Ohio lawmakers have passed a bill that would ban abortions in that state from the moment the heartbeat of a fetus can be detected."},{"comment_id":"1245500588795529","commenter_b":"Clinton thugs!","commenter_a":"@username-- You proud of this?? After watching this, I'm gladly giving my vote to Trump now. These Mexicans don't represent me, & aren't \"Americans\" acting like thugs.","post_message":"MUST WATCH: Video documents months of violent attacks by the radical left on Donald Trump supporters that are COMPLETELY ignored by the mainstream media. This video compilation shows Trump fans assaulted all ACROSS the nation. Worse and not surprising, the media, the left, and Hillary Clinton herself BLAME Trump for these violent assaults when they should be blaming those attacking the Trump supporters. Show your support for Trump by getting the TRUMP: REAL HOPE, REAL CHANGE bumpersticker! --> @webpagelink"},{"comment_id":"10155262254115725","commenter_b":"Well he's a she.","commenter_a":"I don't care what he does.","post_message":"Flash Survey: Does Hillary Clinton's use of a personal email account to conduct Secretary of State business hurt her potential presidential run? Vote here ---> @webpagelink"},{"comment_id":"10154383447230745","commenter_b":"She modeled nude! Soft porn!","commenter_a":"Trump is not going to make it past 2017......Bigly!","post_message":"WATCH LIVE: President Trump makes an announcement — will he take questions from the press? @webpagelink"},{"comment_id":"10153521372371162","commenter_b":"Illegals cant vote....","commenter_a":"This men can't never be president white racist people can do it alone with out Hispanics and blacks his election is a waste time and money he lost already","post_message":"BREAKING: Donald Trump sues Univision for $500 million over the Miss USA pageant... @webpagelink"},{"comment_id":"10156120572270354","commenter_b":"She is a Dumb o crap","commenter_a":"The city of Baltimore has an idiot for a mayor. I wonder if he is a Democrat or a Republican?","post_message":"“This settlement...avoids costly and protracted litigation that would only make it more difficult for our city to heal and potentially cost taxpayers many millions more in damages,” said Baltimore Mayor Stephanie Rawlings-Blake."}]
