[{"comment_id":"634938303363415","commenter_b":"god i hope his on his way to you for judgment","commenter_a":"Hey Obama time for you to step down!!!","post_message":"Obama's health is at risk, he may not finish his presidency.  He should resign. If his health is becoming an issue, it's a no brainer.  Would you be happy to see Obama resign from the presidency?"},{"comment_id":"10153575506851782","commenter_b":"It doesn't show a picture of the impala. All the vehicles in the picture are police cruisers.","commenter_a":"The article says it was a white impala, is it just me or does that car look black?","post_message":"HIGH-SPEED CHASE: Purcell police are chasing a vehicle at speeds of more than 100 mph on 180th Street: @webpagelink"},{"comment_id":"1716476818593163","commenter_b":"Well she is a WITCH.","commenter_a":"what a joke. anyone with any brains would look at her trend to not do the right thing. we have had enough bad behavior in the white house the past 2 elections we do not need more.","post_message":"According to Hillary's campaign manager, voters trust Hillary because she's completely upstanding, honest, and scandal-free. Claims to the contrary are nothing more than a GOP witch hunt."},{"comment_id":"10153526411091350","commenter_b":"I don't eat in private, why should my kid have to? Most women who choose to bf in public are so good at it, you don't even notice, so don't wore about averting your eyes. When I'm at target I'm busy shopping not looking for a nip slip.","commenter_a":"I completely support breastfeeding mothers but would prefer not to see it happening while shopping. Target should be providing private respectable areas for this if they really supported breastfeeding moms.","post_message":" policy supports breastfeeding in any area of our stores, including our fitting rooms, even if others are waiting. See why moms are swooning over the retailer breastfeeding policy."},{"comment_id":"630472157108961","commenter_b":"@username you too bitch","commenter_a":"This is not a man.........he's a crazy kid........wanting notarization. Why not go after Obama who continues to destroy our country and it's citizens!","post_message":"Here is the man who tried to kill Donald Trump yesterday:"},{"comment_id":"917823551667757","commenter_b":"This is another stupid Question!! HILLARY SHOULD BE IN PRISON 2016.. Dumb ass thinks she can run for president She just needs to STOP INSULTING AMERICANS INTELLIGENCE!!!","commenter_a":"Yes","post_message":"Multiple Choice Quiz time, Republican kiddies! Which answer did you choose? A or B? @webpagelink"},{"comment_id":"539522582917416","commenter_b":"Well screw the NBA Players . . . pansy ass bitches!","commenter_a":"WHO GIVES A BIG RATS ASS WHEN YOU BACK A LOSER !!!!!","post_message":""}]
