[{"comment_id":"10153844148480579","commenter_b":"Only when they try to use it as the basis of their platform or legislation. Then it is a big negative.","commenter_a":"Media Silent As Muslims Ethnically Cleanse 60,000 Christians In Philippines By: Daniel Greenfield When thousands of Muslims become refugees, then you can’t get the media to shut up about it for weeks. Thousands of Muslim migrants... jewsnews.co.il","post_message":"Do you consider religion when evaluating a candidate?"},{"comment_id":"947324245313643","commenter_b":"Sick witch, heartless.","commenter_a":"Arrested her","post_message":"Police say woman hid body of dead son in trunk of her car. According to police, the boy was last seen in 2004. @webpagelink"},{"comment_id":"1783804358520815","commenter_b":"Shut up....","commenter_a":"As reprehensible as Dylann Roof's crimes are, the death penalty is simply a barbaric act that brings a blood-lust satisfaction. There is no Hell to which criminals are consigned that is worse than lifetime confinement.","post_message":"Defense attorneys for Dylann Roof, who is accused of killing nine people at a church in Charleston, South Carolina, filed a legal challenge to the constitutionality of the federal death penalty."},{"comment_id":"519010834890623","commenter_b":"This article was July 2013","commenter_a":"That's story has been out for years - when is he actually gonna do it?","post_message":"Actor Johnny Depp wants to purchase the historical landmark Wounded Knee and gift it back to the Native American people."},{"comment_id":"1766321223645256","commenter_b":"If you are gay why are you voting for Hillary when she wants to bring in millions of refugees that believe gays should be executed? If you are Black, why are you voting for Hillary when she defends Planned Parenthood and admires Margaret Sanger, who wanted to abort as many black babies as possible and exterminate the black race because they are like \"weeds.\" Most of those clinics are in Black neighborhoods. If you are a Woman, how can you vote for Hillary when she has buried all of Bill's rape victims under the rug. As an attorney, Hillary also defended the rapist of a 12-year old girl and laughed about it later. She plays the woman-card and acts entitled; implying that she deserves your vote merely because of her sex. How is that gender neutral? If you have are a Miner, Steelworker or have a Factory job, why are ...","commenter_a":"He did not say because of how they prey! This is Dem spin! KILLARY only is concerned with illegals and refugee''s Get that big dem base full of those needing your handouts!! Does not matter if some want to kill us Really our money, but once it get to DC it's their money!! Her motto should be just give me your I WILL MAKE THE DEMOCRATS!!!! This country is going down fast!! Bombings, beheading, murders etc And our president is worried about where someone should PEE !! Big world leader! OBAMA A TOTAL JOKE!!","post_message":"\"In this great nation, where our founders put a fundamental principle forward of religious freedom, [Donald J. Trump] says ban all Muslims, don't let certain people into our America because of how they pray.\" What do you think of Sen. Cory Booker's comments about Donald Trump at the #DNC?"},{"comment_id":"10153638033307377","commenter_b":"dumb@$$","commenter_a":"Sooooo, did Michelle Obama use any words that Laura Bush used? Hmmm a good listen.","post_message":"Bill Kristol, editor of The Weekly Standard, has delivered an eleventh-hour pep talk to Republicans."},{"comment_id":"1752150585035881","commenter_b":"@username WE ARE GOING TO WIN HITH Hillary Clinton","commenter_a":"Interesting double standard. After all the horrendous things he's said about her this campaign, and the pathetic name calling, she offers one funny and spot on zinger and once again he has to have the last word.","post_message":"Watch the moment Donald J. Trump called rival Hillary Clinton \"a nasty woman.\""}]
