[{"comment_id":"1191908450861681","commenter_b":"wake up and smell the flowers Jill.... get the Frack out of the race...\\\\","commenter_a":"Plus, the Green platform is 50 good, 50 incoherent","post_message":"(LU) Your run will strip votes away from Clinton. Bernie Sanders knows this. That’s why he isn’t running as a third party candidate."},{"comment_id":"1573366636056793","commenter_b":"LOL And people trust this bitch. LOL Good little sheep BBBBAAAAAHHHHH","commenter_a":"Why this isn't on the headline news?","post_message":"She used the racial slur over and over and over..."},{"comment_id":"10154517651704166","commenter_b":"Ash, Nc","commenter_a":"Hi from","post_message":"Mother of son hit with books at school speaks out"},{"comment_id":"10153023631106770","commenter_b":"She should leave right away!","commenter_a":"OHHH so you weren't bothered by the USA Planned Parenthood baby chopping business? You weren't bothered by Hillary's stupidity with her email? You weren't bothered by Racists looting and burning Ferguson? You aren't bothered by Miley Cyrus twerking on TV for young girls? I see. You were bothered by the GOP debate... Right.....","post_message":"Emily Blunt said becoming an American was “strange and slightly disarming.”"},{"comment_id":"10154178335409877","commenter_b":"Well said Jillian. I too believe that BLACKLIVESMATTER! It's not right, it is unacceptable !! We are al the same inside, under the skin of all people. There is only 1 race. The HUMAN RACE, period!! The more that speak out the louder we are!! And I believe this to can CHANGE!","commenter_a":"Enough is enough","post_message":"So, so tired. #TerenceCrutcher"},{"comment_id":"10153166262121336","commenter_b":"she can't stop lying","commenter_a":"If her lips are moving she is lying","post_message":"“All my grandparents, you know, came over here...\" – Hillary Clinton said on the campaign trail But Census records show that only one of Clinton’s grandparents was born outside of the U.S."},{"comment_id":"10154390282749411","commenter_b":"Yeah, only to let them in later since we have open borders with yhem","commenter_a":"@username Lessa Katherine but sure.. let them into europe haha","post_message":"'This is my sincere thought'"}]
