[{"comment_id":"10153306961394087","commenter_b":"Build that big beautiful wall!","commenter_a":"The Trump Haters are the biggest whiners and cry babies in America ! Say all you want ,Hate all you want !.. But you cannot stop the train from heading to the White House !.Donald J. Trump for President 2016 !","post_message":"'I don't know if that's because she is incompetent, or she doesn't like me or maybe she's given instructions from up above,' Donald J. Trump said about CNN reporter Sara Murray after accusing her of purposely not recording the large crowds outside Trump's book signing event in New York."},{"comment_id":"10153034727835667","commenter_b":"Wtf she's ugly and weird","commenter_a":"Linzee Kay @username","post_message":"Miss Piggy will not be pleased."},{"comment_id":"10154641460388734","commenter_b":"Where there is smoke. There is fire. Only the individuals involved will ever know the truth.","commenter_a":"Hi Tony","post_message":"A woman accusing Republican Presidential nominee Donald Trump of ‘of victimizing her with inappropriate sexual conduct’ is speaking with the press for the first time."},{"comment_id":"1124537887639264","commenter_b":"It is a shame that one of the frontrunners for the Presidency is directly responsible for spreading the fears and bigotry that lead to this nonsense. Islamaphobia is going to ruin this country from within..","commenter_a":"And so it begins again The seeds of hate, distrust and ignorance have sprouted","post_message":"She never could have expected this. Not in America..."},{"comment_id":"10152859650389877","commenter_b":"Girl, bye.","commenter_a":"It looks like there's another sign that says 'Down' so, I'm hoping the other sign, which we can't see, says with... Would spell out 'Down With White Power'. I'm curious to know what the colors of the other team are?","post_message":"High school students flash 'white power' signs at basketball game. Read what happened next below.   Grio fam, what should the punishment be 4 this ignorance? #soundoff"},{"comment_id":"1037623106257736","commenter_b":"Many foreigners are required to take English in school unlike Americans.","commenter_a":"if you want to go to murica you have to speak engrish","post_message":"A study found that 77% of immigrants have high school diplomas and over 40% graduated from college."},{"comment_id":"10154362826911323","commenter_b":"In Bulgaria women sunbathe topless. Older women, too. At first it seemed a bit strange to me, then I thought 'Oh well, if a 60 year old can do that, I can, too'. That was when I stopped caring. As for underpants, not enough fabric, so I'll pass.","commenter_a":"Stupid debate. Why should it bother me how people sunbathe? I don't care if they are dressed, half naked or naked. Let everyone do what they are comfortable doing, it's not like you have to look.","post_message":"“It all depends on what type of underwear it is. If they had an Ann Summers crotchless type affair then that would be a touch odd.'"}]
