[{"comment_id":"1104255989636871","commenter_b":"#westoppedtrump #fucktrump","commenter_a":"You saved countless lives last night on the streets of Chicago, they stopped the gang banging for a few hours to come together in your honor...you've already made America great again.","post_message":"Good morning! Departing for Dayton, Ohio now! WE ARE GOING TO MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153253016300329","commenter_b":"I can almost guarantee that this lady is nowhere near as big as this dress makes her look. I personally think she looks pretty average. Size 12 or 14. I'm not \"fat\" but I would probably look like that in that dress, thanks to the perfect little human I made. Haha. It just isn't flattering, that doesn't mean anything about her body.","commenter_a":"The dress is not for fat people that is the issue lol","post_message":"ICYMI"},{"comment_id":"10154392573271491","commenter_b":"It's only a temporary ban, you guys make it seem like it's a ban forever and second why is it that USA always has to help the world, we have our own problems to take care of... Maybe once things are clear here and we are able to eradicate a huge chunk of terrorism, because it's honestly never gonna go away completely, then the ban can be lifted... What does it matter where the terrorist attacks that were here came from, people just want to open the borders like its nothing, let's spend some of that money here for once and help American citizens instead of foreigners for once or for now at least...","commenter_a":"She fails to understand we are trying to make sure those same radical Islamists, like the same ones who tried to kill her, stay out of our country. I'm saddened to see a survivor of radical Islamic terrorism can't sympathize with the U.S. trying to prevent terrorists from sneaking in as refugees!","post_message":"Malala Yousafzai: \"I am heartbroken that today President Trump is closing the door on children, mothers and fathers fleeing violence and war.\""},{"comment_id":"10152841582006130","commenter_b":"Yas girl","commenter_a":"Phebe Kim Gignac","post_message":"Your taste buds are going to explode."},{"comment_id":"10153842971535950","commenter_b":"Mary, please remove yourself from the gene pool. Don't reproduce.","commenter_a":"Many western people feel targeted and afraid of muslims. You never know what they have underneath all that crap they have on. Why don't they go back to Muslims countries?! If they can't adapt them should not migrate.","post_message":"In Nice, a city with the ban, police can fine any woman wearing a burkini -- or force her to disrobe."},{"comment_id":"10153476529996756","commenter_b":"I think they assume they can just take take take, and someone will eventually design a self sustaining space station and then they'll buy it.","commenter_a":"I don't understand why the Masters of the Planet want to destroy the planet.","post_message":"A provision in the TPP allows corporations to sue governments for limiting their ability to compete in a market, which critics say could undercut food labeling policies that promote healthier food choices and make it more difficult to battle rising obesity rates."},{"comment_id":"10155037130139369","commenter_b":"Sucker","commenter_a":"I'm 51 now and have paid into social security since my first job at 15 years old. I want MY money! Let them try and take our money. They'll have a revolution on their hands!","post_message":"That's $32,000,000,000,000."}]
