[{"comment_id":"704049616452283","commenter_b":"fuck that stinky black ugly bitch","commenter_a":"She maybe a First but NO LADY..","post_message":"Our first lady just disrespected all the white women in our country. She is a hypocrite and a racist. We miss Laura Bush. Do you agree Michelle Obama is a disgrace of a first lady?"},{"comment_id":"10155025508527577","commenter_b":"Ya genius. We don't want to pay for more illegals shit.","commenter_a":"maybe he just doesnt want to pay for someone else shit .. just like any normal person doesnt want to pay for anyone elses shit .. especially for something as stupid as a wall . didnt work for china back when they made one what makes you think itll work today.. there will always be someone smarter than the measures put in place to stop advancement ... explosives arent hard to get in mexico especially if you are a well connected cartel ... people will be getting killed while the wall is being built kidnapped and the likes the wall if stupid for so many reasons .. just increase personnel and the available resources to combat the problem and it will in turn become easier to manage the flow of illegal immigrants coming in ... and if you think we as the u.s. government doesnt profit off cartel youre dumb","post_message":"The Mexican President was funded by the Juarez Cartel and that’s why he is against the Trump border plan:"},{"comment_id":"10153869125358812","commenter_b":"Why are Christians punished for praying. No one says others have to follow.","commenter_a":"Wow","post_message":"High school football coach suspended for praying at games attends as a spectator while  Satanists gathered outside of the stadium: @webpagelink"},{"comment_id":"10152919389451491","commenter_b":"I always knew that America needed more violent rape on TV.","commenter_a":"Patrick","post_message":"Game of Thrones is famous for its tragic weddings, but last night the show pushed that into even darker territory."},{"comment_id":"488312324683981","commenter_b":"Hmm if firearms are a replacement for a small penis what are females replacing with firearms @username???","commenter_a":"Gun Worship in The United States of Guns is Killing US...","post_message":"SCARY!!"},{"comment_id":"891182254405684","commenter_b":"He has already done a better job than Obama ishani August ,why don't you move to Cuba or the middle east,there you would find out what \"raping \" in a country is all about.do you feel safe with open borders?","commenter_a":"I am just so proud of President Trump, he is keeping his promesses, he is a man of his word. Wait until he gets sworn in, things will start moving for great changes.","post_message":"Do you support our president, Donald Trump? Comment YES or NO."},{"comment_id":"10153715482507452","commenter_b":"@username my point is just because the government calls it illegal doesn't mean so that's my point and hector no conspiracy you just like to believe everything the government tells you","commenter_a":"Even if the lady were to have been illegal, the US low key appreciates the narcotics the government sells it themselves on the side where else can they seize the dirty $$$ that keeps circulating","post_message":"A San Diego woman traveling from Mexico was busted at LAX trying to smuggle in more than 11 pounds of crystal meth tucked away in the lining of her suitcase."}]
