[{"comment_id":"10153225018458352","commenter_b":"Shut yo strong African ass up","commenter_a":"Stevie Ray Dirt this going to be me if you don't hurry tf up ! lmfao jk","post_message":"Strong Black Woman Marries HERSELF Cause She Couldn’t Find A Husband (True Story)"},{"comment_id":"10154618806016336","commenter_b":"WHY THE IRAN DEAL IS A MONEY LAUNDERING SCHEME CREATED BY THE CLINTONS AND CARRIED OUT BY OBAMA: Our economy is worth billions if not trillions of dollars, annually. The Clintons are incensed at Americans and think they are trolls or deplorable or predators or worthless. What the Clintons really desire is to add to their greedy pot of wealth built on the backs of slaves; modern day, contemporary slavery which includes a melting pot of all races. TRUTH: Hillary's economic plan seeks to further these greedy ambitions of gain and puts all of America and every American citizen at risk. By allowing an influx of immigrants including the 11 million (maybe astronomically more) to stay illegally, unconstitutionally, your wages will decrease or stagnate while your costs of living rise: You will be forced to compete with these new immigrants for housing, your prices on everyday purchases will rise, over ...","commenter_a":"Trump founded Racist Birtherism","post_message":"A senior ISIS leader was killed earlier this month in a precision strike near the Syrian city of Raqqa, a U.S. official told Fox News."},{"comment_id":"10154138002220671","commenter_b":"If they dont catch her already","commenter_a":"#NewAge","post_message":"Police pursuing possible homicide suspect in Southern California"},{"comment_id":"10153024489644614","commenter_b":"Good question Michael, I'm gun illiterate, I though ALL guns had a safety :/. I was trying NOT to be cynical, but was wondering, if you hust had dinner with your wife, and you're entering an elevator, what possible reason do you have to unholster your weapon? Makes you go hmmmmmmmm","commenter_a":"Poor guy ..... perfect example of ALWAYS following safety procedures. If he was off duty, why didn't he have the safety on? But hey, nobody's perfect, and he is paying dearly for this mistake, physically, and I'm SURE! at his job with the ribbing he's getting frim his fellow officers.","post_message":"A Kentucky police officer accidentally shot himself while standing next to his wife in a Cincinnati elevator, and the entire incident was captured by surveillance video. Officer Darryl Jouett removed his gun from its holster and was apparently trying to put it in his pocket when it went off. A bullet ricocheted off the elevator door and hit him in the stomach. Jouett on Monday told WCPO - 9 On Your Side he was at home and on the mend. Read KTLA's story here: @webpagelink"},{"comment_id":"10152784839266680","commenter_b":"Oh hell no...","commenter_a":"Universal speed Bernie, your track record is AMAZING and your heart is filled with incredible passion! Thank you for FIGHTING FOR US #berniesandersforpresident #wallstreet #monsanto #earthfirst #love #care #animalsmatter #politics #gasland #environment #oceans #earth #america #goodpeople #bernie #hillary #hillaryclinton #jebbush @webpagelink","post_message":"Democratic Whip Steny Hoyer: \"We will dictate that the only people who can serve are the rich and I don’t think that’s what the Founding Fathers had in mind.”"},{"comment_id":"1851253931763489","commenter_b":"You WILL get the thin mints bitch!","commenter_a":"Nathan Williamson","post_message":"Knonk Knock, you want these Semoas?-mo Shop.tacticalshit.com"},{"comment_id":"10153189366828132","commenter_b":"Yes for real!!! That's hilarious.. but just a secret, I do it to. Except when they stare, I sing to them. And they sometimes laugh or look at me like","commenter_a":"I could so see Mervin doing Danielle!","post_message":"This police officer from Dover, Delaware, has some serious moves!"}]
