[{"comment_id":"10152901034836636","commenter_b":"Karina a poopoo head","commenter_a":"Great! Don't terrorize kids! Be the adult. Do your job and treat everyone equally. Don't only attack the black kids.","post_message":"This just in: That Texas officer videotaped outside an pool party has reportedly stepped down from the police force."},{"comment_id":"666551896811325","commenter_b":"Nah send the atheists and liberals and dems over to beg for coexistence. Please !!!","commenter_a":"I want all liberals to go meet isis and propose there coexist mantra. All of them! Now please!","post_message":"I am begging liberals to understand this!"},{"comment_id":"1069087446447636","commenter_b":"Put her on the street .","commenter_a":"She looks flashy","post_message":"The liberal media loved Michelle Obama's tang SOTU dress. Take a guess at how much it cost."},{"comment_id":"10154242157722690","commenter_b":"@username oh yes she is. No way would a women just go Willy Nilly about massive death. We are big on keeping people safe. He twits bc someone put him down. Just think if a country pisses him off.","commenter_a":"We have two people running for office that are both out for themselves. Ones going to court Nov 28th on a fraud case for his fraud school then we have one about email server. I mean come on we don't have a great choice! They both SUCK!","post_message":"FBI to reopen Hillary Clinton email investigation after additional emails were discovered as part of a separate investigation."},{"comment_id":"10152981955661336","commenter_b":"Obama the terrorist wants Islam to take over America!","commenter_a":"There's no sense in complaining!The people can get rid of obuma anyday they choose to!!","post_message":"\"[President Obama] clearly romanticizes Islam and treats it as though Islam is above all criticism… And until we hold Islam to the same standards as every other religion, ethically and behaviorally, terrorism wins.\" – Lt. Col. Ralph Peters"},{"comment_id":"10153203949426782","commenter_b":"This is complete BS!!! They are illegals!! NOT undocumented.... In Oklahoma you have to prove you are here LEGALLY, not an illegal criminal to get an Oklahoma ID or DL. Sign up for a DL as an illegal and get deported.","commenter_a":"If Americans went to Mexico illegally, they would be thrown in jail, deported, if they're lucky, possibly shot and killed, but I can guarantee they wouldn't be given free medical, free schooling, welfare, jobs, driver's license, etc....all at the tax payer's expense.","post_message":"An Oklahoma City grassroots effort to get undocumented immigrants drivers licenses is gaining momentum."},{"comment_id":"1469871926366166","commenter_b":"@username...... leave Our country!!!!","commenter_a":"Too late you racist p.o.s. you are hatred and bigotry..","post_message":"\"We will reject bigotry and hatred and oppression in all its forms, and seek a new future built on our common culture and values as one American people.\""}]
