[{"comment_id":"10153844148480579","commenter_b":"Only when they try to use it as the basis of their platform or legislation. Then it is a big negative.","commenter_a":"Media Silent As Muslims Ethnically Cleanse 60,000 Christians In Philippines By: Daniel Greenfield When thousands of Muslims become refugees, then you can’t get the media to shut up about it for weeks. Thousands of Muslim migrants... jewsnews.co.il","post_message":"Do you consider religion when evaluating a candidate?"},{"comment_id":"10154664447603145","commenter_b":"Then LEAVE MY COUNRTY !!!","commenter_a":"Mr. Trump isn my president. I don mean it emotionally; I mean it literally. It not sloganeering; it observable truth. Mr. Trump has no intention of representing me, my family, the people I care about, or the majority of Americans, from the imperiled to the comfortable. It is a stretch to call him anyone president but his own. -Lindy West","post_message":"Every president since 1976 has released his tax returns."},{"comment_id":"487105228080821","commenter_b":"She do it just for the publicity ..","commenter_a":"Probably already dated a few Bruce Jenner's in prison...","post_message":"Can you believe this story?"},{"comment_id":"1339079949456485","commenter_b":"She should eat it","commenter_a":"She should eat it","post_message":"Chip Roulette: Who Will Eat The Carolina Reaper Chip, The World's Spiciest Tortilla Chip, First?"},{"comment_id":"1277987642251583","commenter_b":"When I say technology, I'm talking about millenia of advancements. Even our simplest tools at one point put someone out of work, probably starting with the wheel. If you want to walk away from technology (or just some technology) that's your choice, just don't try and force others to pay for your choice.","commenter_a":"Low skill workers have been making this argument for generations since the first automation came about and it still doesn't work. Someone still has to design, manufacture, install and service the machine. Someone has to stock supplies for it to use. Still plenty of jobs, just not the job you were doing yesterday. They are also overlooking the other basic problem that the Government doesn't create wealth. If you get a freebie from Uncle Sam, that came out of someone else's hard earned money via taxes. If we're all sitting at home due to this miracle automation, then there's nobody around to pay the taxes to fund the government. It simply doesn't work. Worse, we've seen countless times around the world how it doesn't work and people still don't get it.","post_message":"Simply put, the idea is that Uncle Sam will cut citizens a regular paycheck whether they work or not."},{"comment_id":"896147533775276","commenter_b":"We Americans are beat. Face it effort to assist citizens verses supposed immigrants (illegal) is futile. We are sold out! The few elite own the few corporations and all are subjects of the foreign owned NON \"federal\" reserve! GOVT benefits were advertised south of the border. The border is not secure. Enforcing US deportation laws are ordered on STANDING DOWN. An increasing invasion of illegal foreigners flock into our nation. So now, the govt is offering huge tax rebates to illegals never having paid taxes! I give up! America can never survive.","commenter_a":"NO I DO NOT AGREE!!!!!!!!!!!!!!!","post_message":"PETITION HERE: @webpagelink"},{"comment_id":"10153621315776037","commenter_b":"Me either, but because of my mom, I've been around terminally ill people as I worked for her. This is a big deal and I believe it's important. Suffering through a long painful death is hard on families as well as patients.","commenter_a":"Death with dignity is a big deal to people. Unless you're living with a terminal illness, I suggest you leave your judgement at the door.","post_message":"Religious groups and advocates for people with disabilities opposed a nearly identical California bill earlier this year."}]
