[{"comment_id":"10153734508783132","commenter_b":"I have often said this...there comes a time when women need to realize this","commenter_a":"Just because you can wear one doesn't mean you should.","post_message":"NENE LEAKES can definitely rock a bikini."},{"comment_id":"1786615071570542","commenter_b":"Send them to Cuba , please. We do not want them.","commenter_a":"We dont really care what you think John Legend!! Why dont you, Colin, Beyonce, Kanye, Will & Barbara & all the other negative so-called celebrities move to Canada or Cuba & give us Americans a friggin break!!","post_message":"Singer John Legend also tweeted that the Star Spangled Banner is \"weak.\" @webpagelink"},{"comment_id":"688269957994142","commenter_b":"Honestly, what a creeper. Who thinks thats acceptable??","commenter_a":"@username what an idiot!","post_message":"This man WON'T stop preying on Kim Kardashian West and Gigi Hadid!"},{"comment_id":"10153618824494778","commenter_b":"Lol jk","commenter_a":"At least we don't recruit murders us losing having killed anyone can the patriots say that....stfu period.","post_message":"Last summer, #Redskins Daniel Snyder said during an interview that the team was exploring the possibility of a new stadium. Now they're asking season ticket holders for input."},{"comment_id":"1769177686700867","commenter_b":"Move out of our country then bitch! I'm glad Mike didn't let you carry our flag you traitor!!!!!!!!","commenter_a":"If your ass don't like it here leave you jabroni ass clown","post_message":"Ibtihaj Muhammad - the first American Muslim to compete in the Olympics wearing a hijab - just went on a disgusting rant about how much she hates the United States. This is SICK..."},{"comment_id":"10153249235547894","commenter_b":"here Sharnise Nisec Brown since you are behind on the times lol Lauren Payton Katrina Elizabeth","commenter_a":"Zanehya Rayshaun Corleone","post_message":"Exclusive: K. Michelle Opens Up About Her Relationship with Idris Elba and Backlash from Black Women: ‘The Women I Fight For Have Been The Women That Attack Me’ [Video]"},{"comment_id":"10154307782959205","commenter_b":"ummm i dont think thats the chant they should be using.. wrong march","commenter_a":"Choppy feed. :/","post_message":""}]
