[{"comment_id":"1088236524530691","commenter_b":"Humans are a parasite on this planet, we are unable to live in balance it's time for another extinction.","commenter_a":"It prob all happened because of climate change","post_message":"New evidence suggests there have been 6 mass-extinctions since life began."},{"comment_id":"1054180274641720","commenter_b":"Sam , isn't a lesbian so why would they have lesbian in the house?","commenter_a":"It's homophobic too, since there are no lesbians on the show either.","post_message":"Is The Bachelorette Australia RACIST? (via Daily Mail Australia)"},{"comment_id":"10157219301315354","commenter_b":"Round up all illegals as soon as possible.","commenter_a":"Now we tolerate Mexicans and all kind of low life's stomping and burning our flag while stand silent and do nothing . Wake up America.!!!","post_message":"***IN HONOR OF EVERY SOLDIER, SAILOR, AIRMAN, MARINE, & GUARDSMAN WHO DIED DEFENDING FREEDOM***"},{"comment_id":"416198871873795","commenter_b":"I think those are pictures of women there supposed to be in capes ridiculous","commenter_a":"Why do so many pictures of ISIS soldiers depict them in clothing that would be of the worst kind for combat? Might as well give them a cape.","post_message":"ISIL’s Al-Khanssaa Brigade, an all-women fighting group, says women should only leave the house to practice medicine, teach or study religion"},{"comment_id":"10152622903648067","commenter_b":"POLICE and MILITARY are made up of FALLIBLE HUMANS......some FALLIBLE humans do HIDEOUS things and then hide behind the BADGE!!! Those that do such things deserve to be OUTTED","commenter_a":"When they stop waging war against the Police and Military maybe I'll get behind the group... until then. They're a bunch of punks living in their moms basement, blaming everyone else for their problems.","post_message":"\"We, Anonymous around the world, have decided to declare war on you, the terrorists,\" the hackers said in a YouTube video. @webpagelink"},{"comment_id":"1411629742215405","commenter_b":"She is nothing but a stinken trouble maker, kick her behind out of our country","commenter_a":"This fk needs to go","post_message":"Socialist Seattle City Councilwoman Kshama Sawant said activists should demand the mayor use local police to block Immigration and Customs Enforcement agents. Read both sides [here: kiro.tv/SawantOnICE] and tell us what you think: A. Yes, we need to hold ICE accountable B. No, police are needed for all protests C. We need a solution, this isn’t it. D. Wait, what? E. (Enter your own answer)"},{"comment_id":"1395648327124620","commenter_b":"You're pretty much a stupid whore. I feel bad for your kids","commenter_a":"WAHT DONT U GET?????????????????SHE IS ILLEGAL.......Rayos has been required to check in with ICE every year since 2008, when she was caught working under a fake Social Security number...................NO ONE EVEN KNEW SHE WAS HERE UNTIL 2008....WAKE UP STUPID AMERICANS","post_message":"The 36-year-old mother of two is among the first undocumented immigrants to be deported under Trump strict new policies."}]
