[{"comment_id":"1371652822850169","commenter_b":"Shut the fuck up dum bytch","commenter_a":"a policemans job is hard and they have to put up with alot of verbal abuse and it takes alot of self restraint, thats y it is important for the good brave cops who really care about what they do to take pride and turn in the bad cops who do not care or are just burnt out","post_message":"This DJ just said it's time for good cops to start calling out bad cops."},{"comment_id":"10156524668125293","commenter_b":"Tony: I doubt most American wives want to work a job. Friggin stay at home cows!","commenter_a":"weather the job is a career or just to put food in your stomach. Your wages has to match the cost of living and the cost of living is going up and so should the wages. KEEP Protesting it because they are wrong!!!!!!!!!!!!!!!!!!!!!!!!!!!","post_message":"\"He's interfering in other cities' business.\" A bill passed the Alabama House today that would outlaw local minimum wage laws. Tonight, protesters are lining the street in Mountain Brook, the home district of the bill's author. More on the bill at 9:30, more on the protestors at 10."},{"comment_id":"756120254539294","commenter_b":"Dont \"let\" her leave America, MAKE IT LEAVE AMERICA! !!","commenter_a":"I thought Rosie was leaving?","post_message":"It's no secret that Rosie O'Donnell and Donald J. Trump don't like each other very much. But what she just did took things WAY too far..."},{"comment_id":"10153014611669138","commenter_b":"\"Land of the free\"? Should be able to go where ever the hell we like! A sign isn't going to stop me","commenter_a":"Sheesh. Just did this last year and yeah it was slippery but everyone knew you did it at your own risk. As for the stairs being closed well you could step over the chain they put to block it. I'm actually taking my boyfriend in the next couple weeks since he's never been.","post_message":"\"The Park Board is disappointed that local media is encouraging this behavior by covering it without explaining that it is dangerous and illegal.\""},{"comment_id":"1206849516074767","commenter_b":"Call Hillary what you want, I don't care about her emails, she is better than that piece of Shit Trump","commenter_a":"Can he get any worst?","post_message":"\"Forget politics; he is a disgusting human being.\" - Thomas Friedman"},{"comment_id":"1475217105828968","commenter_b":"You do not know what you are talking about! If woman cannot afford birth control then there will be a definate increase in unwanted pregnancy and ultimately more abortions than ever. Its a simple enough eqausion, NO PLANNED PARENTHOOD=NO AFFORDABLE BIRTH CONTROL=MORE ABORTIONS!","commenter_a":"Will never agree stay quite,agree or be agreeable to finance or support an organization that capitalizes on the murder of innocent children. And an organization that preys on the vulnerability of women in a bad situation, that is not women's rights but profit of murderers. It needs to be called what it is. Their profits and funding comes via. death and guilt not education.","post_message":""},{"comment_id":"1677499192511819","commenter_b":"you should post this for the misogynist guys on my link to see ahah","commenter_a":"@username this is exactly what that article you shared the other day was talking about. Is this real life?","post_message":"Donald Trump suggested Hillary Clinton is ahead because she's playing the \"woman's card.\" Not surprisingly, jokes and memes followed, pointing out the strange logic of such a statement."}]
