[{"comment_id":"1108181272536216","commenter_b":"thats how i hid my virginity, yeah do that","commenter_a":"Cilian they're coming for reggie","post_message":"This is awesome."},{"comment_id":"10153110276422550","commenter_b":"No she has make up in the first picture","commenter_a":"Two different people...","post_message":"\"If anyone needs a little motivation to not lay in the tanning bed and sun here ya go!\" A 27-year-old mother hopes her graphic selfies of painful skin cancer will serve as a warning for others. Her story --> @webpagelink"},{"comment_id":"10154451547182144","commenter_b":"oh just shove a vagina in her mouth and shut her ignorant racist hate filled mouth up #sorryvaginas...but she loves to eat them","commenter_a":"what an idiot","post_message":"Dick Cheney's torture-loving daughter is back in Washingtonand she's very excited to help Donald Trump torture people."},{"comment_id":"10153647642558352","commenter_b":"She's the other woman, this is why women need to stop claiming men until they put a ring on it and claim you","commenter_a":"Sad","post_message":"GIRLFRIEND FINDS OUT ON SOCIAL MEDIA HER SUPERSTAR SOCCER PLAYER BOYFRIEND MARRIED ANOTHER WOMAN RIGHT AFTER SHE DROPPED HIM OFF AT THE AIRPORT (PHOTOS)  This is real bad!"},{"comment_id":"492872274234399","commenter_b":"Yes , but if an illegal begets an illegal. Guess what it's still an illegal in titled to nothing.","commenter_a":"Just because an illegal baby is born on uur soil does not make them a US CITIZEN. ........","post_message":"Breaking...WAY TO GO TEXAS!"},{"comment_id":"1815605405326385","commenter_b":"CSI!!! That bitch bit me... great episode.","commenter_a":"Is no one concerned that she is really a giant lizard? #reptilian","post_message":"Is this an indicator that we really should be concerned with her health?"},{"comment_id":"1713481288905957","commenter_b":"@username...does that include the Canadian illegals that are here?","commenter_a":"But trump supporters are racist!! The only racist people I see are the one rioting at trump rallies!! You don't see that type of behavior at Hillary or Bernie rallies","post_message":"Protesters attacked Donald J. Trump supporters on the sidelines of a San Jose rally Thursday, in a raucous scene where a dozen or more people were punched and at least one woman was pelted with an egg."}]
