[{"comment_id":"1041402059258074","commenter_b":"But Brandon. . .who do you think PAYS for their jail time? You do and are you willing to pay for all illegal's jail time along with all the criminals we already have in our prisons?","commenter_a":"Why we would give anything to a illgale alien is news to me.don't get me wrong immergration is great if done legaly. All illeagle aliens need is about 5 years in prison then immeaditly deported.","post_message":"Ready for Americans to put American priorities first!? It's that easy!  FOLLOW US!----> Freedom Daily"},{"comment_id":"10154242646146336","commenter_b":"Lots of ladies in Texas have CHL (concealed handgun license) enter at your own risk!","commenter_a":"Caitlyn Jenner is harmless. But lots of creeps out there will go into the women's room to do things other than pee. It's only a matter of time before we hear the horror stories. Be careful ladies.","post_message":"Donald J. Trump said this morning that he does not agree with North Carolina passing a law on bathroom use by transgender people.  He added that if Caitlyn Jenner visited Trump Tower she could use whichever bathroom she prefers. @webpagelink"},{"comment_id":"10153363200377452","commenter_b":"Praying for the family, so heartbreaking.","commenter_a":"So sorry can't imagine the pain their families","post_message":"HEARTBREAKING: Just a few months after his sister died from leukemia, a distraught teen was struck and killed while riding his bike by a hit-and-run driver."},{"comment_id":"10153458933961509","commenter_b":"Only if you let your wife ruin you financially","commenter_a":"Ambur Hearn","post_message":"How much a wedding costs in... → Chicago, IL: $50,934  → Columbus, OH: $26,245 → New York, NY: $76,328 Mapped: The Cost of Weddings, city-by-city @webpagelink w/ The Knot via CNNMoney"},{"comment_id":"10154890966160329","commenter_b":"Kacie Rodriguez","commenter_a":"Javier Maisonet oh Neville! ❤️❤️","post_message":"They out here. // Harry Potter"},{"comment_id":"10154362083273325","commenter_b":"Oh Baloney California is the Welfare , Illegal State !","commenter_a":"California is what's known as a donor State, in other words, we pay more in Federal taxes than the services/benefits we receive. This idiot needs to do some research before threaten us with his ridiculous tweets. #Resist #NoBanNoWall #RussianPoodle","post_message":"Describing California as \"out of control,\" President Trump said he would not be opposed to using defunding as a \"weapon\" against states that want to be sanctuaries for undocumented immigrants."},{"comment_id":"10157473875275354","commenter_b":"The fact that he is pledging his support after this email scandal, proves that he is now being bought by Killary!","commenter_a":"A leaked memo shows the Bernie Sanders campaign considered asking the Democratic National Convention for a private plane as part of his endorsement of Hillary Clinton to help his movement energized. Feel the burn of corruption!","post_message":"WATCH the mass march and see just how \"united\" Democrats are...against Hillary Clinton!  \"Hell No, DNC, We Won't Vote for Hillary!\" #DNC"}]
