[{"comment_id":"10153340551136336","commenter_b":"I don't believed this syory","commenter_a":"If this is true, Airlines are about as out of control as the cops and tsa themselves are.","post_message":"“You wouldn’t want to watch your family member crawl onto a plane, I mean come on, this is America.”  Theresa Purcell said the American Airlines gate agent made her crawl because it was too late to set up a ramp for her to board."},{"comment_id":"1137481012959422","commenter_b":"Get the hell out, asswipes!","commenter_a":"I wish Scottland would welcome me in. I've had it with the states.","post_message":"In case you missed it: Syrian refugees arrived in Scotland this week. This is how they were greeted."},{"comment_id":"875288902530859","commenter_b":"I think she looks much better than that freak of nature.","commenter_a":"No no no no no! Wrong in so many ways... You need MUCH MORE Booty gf.","post_message":"My weekend as Kopycat Kim Kardashian."},{"comment_id":"10154291212970329","commenter_b":"hahahaha!! for real though!","commenter_a":"Hahaha @username Alyssa Purnell Mimi Zink @username @username","post_message":"oh heeyyyy (via So Relatable)"},{"comment_id":"10153185628051615","commenter_b":"Dude we should just start bombing them f*** that worry about the details later","commenter_a":"Come on. Can we stop leaving out important facts like that the passport was likely planted AND fake? World and even French news is properly reporting that. @webpagelink","post_message":"LATEST: A French official says the suspected mastermind of the Paris attacks was also linked to thwarted train and church attacks. Channel 11 Morning News will have updates all morning long."},{"comment_id":"10153137299814060","commenter_b":"NOT OUR BELIEF !!!","commenter_a":"In islam animal or human statue is ban","post_message":"The destruction of ancient statues (some replicas) at the Mosul museum in Iraq, a video of which was released on February 26th, is far from the most heinous crime committed by Islamic State. But the group’s sacking of holy sites and libraries are elements of a broader attack, perpetrated in the name of Islam, on the Middle East’s rich cultural and religious heritage @webpagelink"},{"comment_id":"10152742608351491","commenter_b":"I am amazed at how many women are so poorly informed on the issue and then let the world know how little they know. Amin wage woman does not have access to a mike and thankfully Patricia did and took advantage of it.","commenter_a":"Says a women riding home in a limo! Political rant to get attention. She is a actress","post_message":"“It’s our time to have wage equality once and for all and equal rights for women in the United States of America.”"}]
