[{"comment_id":"1050118365055120","commenter_b":"I couldn't even watch, turned the channel. Didn't need to hear another black actor bitch!","commenter_a":"Too bad there was not a black actor or actress that was good enough to be nominated or win a oscar!!!!!","post_message":"Well, Chris Rock didn't hold anything back. What did you think of his monologue?"},{"comment_id":"10154140633222093","commenter_b":"cash him ousside howbow dah?","commenter_a":"Loss prevention people were sleeping on the job.....ha","post_message":"ARE YOU HAPPY TO SEE ME? Man steals guitar by stuffing it in pants, walking out of Fort Worth store... @webpagelink"},{"comment_id":"10156654458470725","commenter_b":"Hoe","commenter_a":"Let me tell you WHY I AM voting for Trump. I've received a few boo's for my stance on Trump and I just have to say this so I hope you will take just a moment and read it to the end. And I say this as no response with no judgement or ill will toward anyone. I understand there are many who feel Trump's brashness doesn't qualify him for office. I agree he does need some polishing in some of his mannerisms. However, God willing, I will vote for him because this country is so far gone now and into the sewer so DEEP that I doubt there is much that will help it recover. That is why I feel more strongly about this now than perhaps ever in my lifetime that we M-U-S-T elect a strong, no-nonsense, straight-shooter with a BACKBONE OF STEEL who will stand up for ...","post_message":"realdonaldtrump is the first presidential candidate in 2016 to reach 1MM Instagram followers. Follow: @webpagelink/ for behind the scenes footage from the campaign trail! #TrumpTrain #Trump2016"},{"comment_id":"10153847161829203","commenter_b":"He probably didn't know the virgins are 20 year-old males who still play Pokemon.","commenter_a":"Enjoy the virgins, shithead.","post_message":"CONFIRMED: Paris Mastermind Dead"},{"comment_id":"1090268744329629","commenter_b":"at least all those illegals your allowing in here are getting to work.","commenter_a":"14.4 million part time jobs.","post_message":"Another positive jobs report out this morning. 215,000 private-sector jobs were added in March.  That's 73 straight months of private-sector job growth."},{"comment_id":"10153850185846770","commenter_b":"Women talk about men in all women groups too.... no one ever talks about that but women can get raunchy too....","commenter_a":"So guys can't be guys and talk in private? I bet 100% of the people whom have a problem with this are guilty of doing the same thing in some fashion in there own lives but let's make a big deal about ABSOLUTELY NOTHING","post_message":"Her name is..."},{"comment_id":"10153811889982994","commenter_b":"Isn't that what the looney bin was made for? Lock her up!","commenter_a":"Hansel and Gretel's villain just got made","post_message":"'May I have a taste?' Minnesota woman allegedly threatens to eat neighbors' children"}]
