[{"comment_id":"10153216649359705","commenter_b":"Heterosexuals have rights to same sex bathrooms","commenter_a":"PA-THE-TIC! Only country in the world that does this garbage!","post_message":"White House staff now have access to an all-gender bathroom. Here's why it's important."},{"comment_id":"10153785867669228","commenter_b":"Yo mama a obese dummy she should of swolled yo daddy nut.","commenter_a":"Oh like white bithes don't steal stfu","post_message":"Three women pushed shopping carts full of toys from a Toys''R''Us"},{"comment_id":"10153310533507629","commenter_b":"Women beater","commenter_a":"He is the scumbag of the earth.","post_message":"Fox News anchor Bill O'Reilly has been accused of dragging his ex-wife by her neck down a staircase in the couple’s home."},{"comment_id":"1390703587614315","commenter_b":"We have no way of knowing how Bernie Sanders would have weathered the inevitably nasty storm against him if he had been the nominee.","commenter_a":"I'm really angry at Democrats sending the candidate least capable of defeating Trump into the general. What morons. They saw polling showing that Sanders would trounce Trump by double digits and yet decided that Clinton was the \"safe\" bet??? Effing morons.","post_message":"Donald J. Trump's campaign tells us a lot about what kind of Commander-in-Chief he would be."},{"comment_id":"10154371429036491","commenter_b":"@username good luck having sex. I dont mind your sex life... duh","commenter_a":"The best birth control method is abstinence and celibacy.","post_message":"A leading medical group recommended IUDs as the best form of birth control for teenage girls today."},{"comment_id":"516575861835702","commenter_b":"Just shut the fuck up.","commenter_a":"Here a question , if tuition is free in the next years , does my daughter get a \" Refund \" on what she has paid in so far ?If Debt relief is on the table then she should be paid back for having the cash up front to pay for her school....right ?","post_message":"\"He said if a million students march on Washington for free college, that's the only way we're going to win. That's a really inspiring thing to hear.\""},{"comment_id":"631130463744199","commenter_b":"Obama don't care what \"Our\" Constitution says!!!!!","commenter_a":"unconstitutional","post_message":"Obama said that America wants him to run for a third term, here's how they responded.  What a joke. This is absolutely ridiculous.  Do you think Obama should run a third term?"}]
