[{"comment_id":"10154448547351523","commenter_b":"I got attacked by a rott happens. Why are you so short thinking. Now walk away","commenter_a":"SO SAD - and here come the pit bull lovers who will blame everyone/everything to protect pit bulls - how many people have to be attacked/killed before something is done to stop these attacks?? I suffered a vicious attack by a pit bull and it breaks my heart every time I hear of another pit bull attack. Pit bulls killed 232 Americans between 2005 and 2015 - here are the FACTS: @webpagelink","post_message":"'Two pit bulls ran out after my dog and just ripped it apart.'"},{"comment_id":"1814101218857117","commenter_b":"When you walk into McDonalds they already had yo order ready , 'ay 3 big Macs to the front, this fatass just walked in here...' built ass, you sitting down eating on a bean burrito & yo bitch walk in butt naked all you can do is *munch munch on food* 'uhh tf I'm supposed to do with that?' Gay ass outta here","commenter_a":"What kinda fake ass pink sack of waste of human flesh trump supporting stds catching macaroni and cheese smellin diaper full of shit stain 'my dad a lawyer' 'Just bought 2 big nos tanks for my honda and added turbo that way when I drive it goes really fast like 300 mph' lookin ass damnnn 'Daniel back at it again with the pink verses fruity man' head ass 'wanna hot dog on a stick?' Head ass normie fuckboi made this meme?","post_message":"This man is a genius ahaha #WSHH"},{"comment_id":"785168271673750","commenter_b":"These BUTTs ( Bad Uncivilized Terrorist Thugs ) are just showing what they are, BUTTs, they are just showing their colors, this is a sign of ignorance. If this people would listen to intelligent people they would know that pants up don't loot is the best way to go.","commenter_a":"If they want to look like idiots....it's their choice....there are other more pressing issues that is worrisome !!!!","post_message":"Louisiana Passes New Law That Will Fine Anyone Wearing Saggy Pants.  This is amazing. It should be a law in all 50 states.  Do you support this new law?"},{"comment_id":"1801831173397468","commenter_b":"Michelle and Hillary are 2 of the most dishonest people ever!! If Hillary wins then you can tell your daughters and grand d aughters as you watch them being raped by the refugee's , how you are soo happy you voted for this evil..woman .. Get ready for it, with a Hillary win, it will be Sharia Law...","commenter_a":"Want more of THIS, America? Vote Hillary and you just might get it!~ >","post_message":"'This is a country where a girl like me from the South Side of Chicago whose great great grandfather was a slave can go to the finest universities on Earth. A country where a biracial kid from Hawaii, the son of a single mother, can make it to the White House. A country where the daughter of an orphan can break that highest and hardest glass ceiling and become president of the United States. That is who we are, that is what's possible here in America—but only when we come together, only when we work for it and fight for it.' —First Lady Michelle Obama today in North Carolina IWillVote.com"},{"comment_id":"10153130429581162","commenter_b":"If prostitution ever becomes legal, you can sign your kids up freak.","commenter_a":"Making prostitution illegal is as stupid as pot being illegal. Regulate, tax and monitor.","post_message":"NEW: NFL Hall of Fame lineman Warren Sapp arrested for allegedly hiring a prostitute after covering the Super Bowl for the NFL Network: @webpagelink"},{"comment_id":"705783696236172","commenter_b":"No ovaries. Only clitoris.","commenter_a":"The clit and ovaries.","post_message":"Most of you are, or will be, very familiar with it. But it looks very different than you might imagine."},{"comment_id":"10153785867669228","commenter_b":"Yo mama a obese dummy she should of swolled yo daddy nut.","commenter_a":"Oh like white bithes don't steal stfu","post_message":"Three women pushed shopping carts full of toys from a Toys''R''Us"}]
