[{"comment_id":"10153857256601051","commenter_b":"Learn how to spell, dumb bitch","commenter_a":"This will happen more and more, as Obama has made the back lives matter a protected class! Waite to the refugees start! As they will be a protected class also! All the while Obama is trying to disarm the law bidding citizens!","post_message":"Eight teens trapped a teen gold in a home, held her down and sexually assaulted her. But that wasn't enough for them."},{"comment_id":"10150659306454999","commenter_b":"@username ..her lips not legs","commenter_a":"She is right, raising your arms doesn't mean a lot. Her getting multiple corporate donations to sway the way she passes bills does. U.S. Senator Bernie Sanders pointing out that every other politician does the same thing, and he is attempting to change the precedent does. What a lame attack from Clinton. This just made my opinion of her lower, not raise.","post_message":"Hillary Clinton also said that the candidacy of Donald J. Trump was a \"bad development for our American political system.\""},{"comment_id":"10154546397896162","commenter_b":"Wow. What an inbred type comment. Do us all a favor and move into a cave with a black bear so he can eat your face off.","commenter_a":"dig this monster up and mail him back to the middle east with his family in tow.","post_message":"Visitors gather in Arlington National Cemetery around the grave of Humayun Khan, the U.S. Army Captain whose family has been in public dispute with Donald J. Trump... @webpagelink"},{"comment_id":"10153811889982994","commenter_b":"Isn't that what the looney bin was made for? Lock her up!","commenter_a":"Hansel and Gretel's villain just got made","post_message":"'May I have a taste?' Minnesota woman allegedly threatens to eat neighbors' children"},{"comment_id":"1614898715485754","commenter_b":"No need to worry, Just Drink a Coffee ☕","commenter_a":"Brad Sherman","post_message":"Two days ago, an enormous asteroid flew past Earth. It was half as close as the moon. And we barely saw it coming."},{"comment_id":"10153783824626523","commenter_b":"she's hideous","commenter_a":"Who cares","post_message":"Chelsea Clinton has given birth to her second child, a boy."},{"comment_id":"1223870594319795","commenter_b":"What if he might win this time","commenter_a":"I honestly feel if Bernie and Jill teamed up they could win and the world would definitely be a better place. This needs to happen badly!","post_message":"Here's the Guardian article everyone is asking about.  Please read my clarifying statement about our offer to Bernie Sanders: @webpagelink"}]
