[{"comment_id":"649975575168534","commenter_b":"God Bless Heal Comfort Renew & Keep that poor innocent child...as 4 Them(Mr Swollen & Miss Crazy Lookin) ..Vengeance is Mine said the Lord!!!","commenter_a":"😡😡😡😡","post_message":"True tragedy. A 4-year-old was found beaten and zip tied to her bed. Not only that, she didn't know her own name and told police she thought it was 'Idiot'."},{"comment_id":"10154249002506409","commenter_b":"At the opposite end of the mall where Trump stood you are only able to see 1/2 of the mall. That 1/2 had a crowd, the rest of the mall was sparsely filled but you could only see that from an ariel view. Crowd scientists say Trump's inauguration crowd was half the size of Obama's and they are correct, especially when you compare views of both ends of the mall--anyway--who really cares about this anymore?","commenter_a":"Obama was the first African American president I would expect the crowd to be quite larger for him","post_message":""},{"comment_id":"10152822135907434","commenter_b":"You are no gentleman.","commenter_a":"Sure, dude.","post_message":"\"It’s not just about me. It’s about all of us accepting one another.”"},{"comment_id":"1578043845546293","commenter_b":"Uhhh...Hillary won the election by 2.7 MILLION (and counting) votes.","commenter_a":"Another fake poll.... Just like the poll that claimed Hillary was going to win the election ..... Lie... lie.... Lie!","post_message":""},{"comment_id":"10154020746508908","commenter_b":"Malo e :)","commenter_a":"@username Kristjan Korez","post_message":"500 kilometers On 1 Litre of water: Brazilian man challenges the idea of gas stations."},{"comment_id":"496956050512713","commenter_b":"THEY SHOULD KEEP WALKING BACK TO THEIR COUNTRY .... IN OTHER WORDS ...... GTFO OF AMERICA !!!","commenter_a":"Feel free to walk back to where you came from!","post_message":"If you don't respect our country, feel free to leave.  'LIKE' if you think they should leave!"},{"comment_id":"10153780658736350","commenter_b":"@username I have no clue what you are talking about but let me clue you and those like you in on something .... we wonder why kids are shooting up schools and bully each other to death when all they have to do is look at ignorance like you for an example. Sit behind a computer screen and throw insults around like you are all important. You get on a thread and bash a new born baby and his parents that take care of them selves and don't do anything what so ever to you and the likes of you. Instead of passing over a story you don't want to be a part of you get on threads and be an ugly soul and bully people that are happy for this couple or any couple that lovingly gives birth to a much loved and wanted baby. Since you brought up ...","commenter_a":"People have babies everyday! Women birth children under horrible circumstances... Alone .. In poverty ... How about focusing on that instead of these irrelevant people!!","post_message":"Congratulations, Jessa Seewald and Ben Seewald!"}]
