[{"comment_id":"10153183802333188","commenter_b":"\"The walking dead\" are serving as most of our representatives in Washington, take a good look next time someone speaks to the Congress.","commenter_a":"Why do you think it's so good? It prepares us for what we might expect in a SHTF scenario.","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"1115942415111321","commenter_b":"You are a woman, you are worthless, you shouldn't vote. See? That's how you sound. Btw, #hillaryforjail.","commenter_a":"I did not know Gov. Mike Pence. Thanks @username, I like his backbone. Voting Trump/Pence Donald J. Trump thanks for standing firm for the safety of America.","post_message":"If you ever had any doubts about Donald J. Trump sticking with his divisive and dangerous plan for America—say hello to his new running mate."},{"comment_id":"10155024301581600","commenter_b":"Yeah, what's a whinner?","commenter_a":"Proof we have become a nation of whiners.","post_message":"Tens of thousands packed into downtown."},{"comment_id":"907300286012867","commenter_b":"She gives blondes a bad name.","commenter_a":"There's no such thing as liberal intelligence","post_message":""},{"comment_id":"693348717485384","commenter_b":"Someone beat his ass.......again.","commenter_a":"A disgrace to the American oeople...Harry Reid you are way, way past your usefulness, so why don't you just go home","post_message":"SEN HARRY REID (D) UNLOADS ON THE SENATE FLOOR HATE SPEECH AGAINST TRUMP (VIDEO)  @webpagelink"},{"comment_id":"10153389153527169","commenter_b":"Don't despair. I have a niece named Gretchen. You are not alone! ;)","commenter_a":"Try being a Gretchen. I was literally the only one in my entire school all through k-12. I NEVER encounter tiny Gretchens but I'm only 31 so maybe there's still time?","post_message":"Is Your Name Going the Way of the Dodo Bird? (From OZY)"},{"comment_id":"1436141653072527","commenter_b":"Europeans, that's a joke all in its self.","commenter_a":"For all those that think protests didn't block traffic in MLK days. Stop using him as your go to pawn thinking you know something about civil disobedience and fighting for rights.","post_message":"It's the image that is defining a protest movement."}]
