[{"comment_id":"963771213658338","commenter_b":"He hasn't been sent yet! The judge will do that! 263, but if he, the judge, gives him concurrent sentences, he'll be out in 20....wait until JAN 16","commenter_a":"Lolol good!!!","post_message":"Daniel Holtzclaw was sentenced to 263 years in prison."},{"comment_id":"10154753068623812","commenter_b":"Send them all back and send Mexico into a Panic Mode. The Wall will be up in no time.","commenter_a":"Maybe he can bring back the auto manufacturing jobs from Mexico, and hire legal citizens, and then the illegals will stop coming. Oh wait. They come here because there are those willing to pay pitiful salaries and no benefits to make a buck.","post_message":"Donald J. Trump has made his promise that Mexico would pay to build a wall along the U.S. border a centerpiece of his proposed immigration policy. But only 13% of voters believe he could deliver on that promise if elected."},{"comment_id":"10156237879600594","commenter_b":"Her posture? She's not modeling, she's out on a boat with her nieces. I doubt they would have been in the picture if the intent was to be \"sexy\". She wearing a bathing suit. So what?","commenter_a":"The body is fine, the bikini is ugly and her posture is horrible.","post_message":"Ariel Winter takes the online hate and spins it into a message for all the bullied girls out there: \"YOU ARE BEAUTIFUL\""},{"comment_id":"10155231887371037","commenter_b":"@username Proof he has no respect for the other branches of government.","commenter_a":"It's pretty sad that he's got to be the target of all this hate. It seems so many people can't go a single day without being hateful or judgemental. How can a group of people that claim to be loving and caring be so hateful and ugly hearted?","post_message":""},{"comment_id":"10154622276758797","commenter_b":"😂😂😂😂😂","commenter_a":"Iveeno Wallace this time only ur teeth match.","post_message":"ABDUCTION ALERT: Look like anyone you know? #Chicago Police have released a sketch of a man suspected of trying to abduct a 14-year-old girl in the Roseland neighborhood. Important details, here: @webpagelink"},{"comment_id":"1014820688580048","commenter_b":"Time for muslims to take their a$$e$ back where they came from","commenter_a":"That's the national anthem. If you aren't willing to be An American than go home! And take the stinking socialist with you. You can take the atheists and the Mexicans.","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays @webpagelink"},{"comment_id":"10154420630831378","commenter_b":"That's because she's a big liar too","commenter_a":"And less than 7 hours ago Kellyanne Conway said the White House has full confidence in Flynn.","post_message":"#BREAKING National security adviser Michael Flynn has resigned. @webpagelink"}]
