[{"comment_id":"10153595852746336","commenter_b":"Which one is the women??","commenter_a":"Girl power!!!!","post_message":"26-year-old Capt. Kristen Griest and 25-year-old 1st Lt. Shaye Haver will become the first women to wear the U.S. Army's coveted Ranger tab when they graduate alongside 94 male soldiers Friday at Fort Benning."},{"comment_id":"10152939626746636","commenter_b":"Would you please get that hamster out of there by you're in?","commenter_a":"Gonzalo Jara is disgusting and may be homosexual. He should be banned for life!","post_message":""},{"comment_id":"1008491449210603","commenter_b":"@username You are scum simple as that!","commenter_a":"she was a drug taking piece of trash...","post_message":"Bobby Brown: 'Bobbi Kristina Brown was and is an angel'"},{"comment_id":"1154513944599658","commenter_b":"Open primaries work just fine Terrence.","commenter_a":"Yea- Bernie baby! This was a closed primary and they are near a tie!!!!! Can you imagine if they \"allowed\" everyone to vote?!!!!! #therevolutionishere","post_message":"UPDATE: Sanders wins the Oregon primary, while Clinton appears likely to eke out a narrow win in Kentucky. Sanders' cut into Clinton's 270+ pledged-delegate lead likely will be single-digits."},{"comment_id":"10152736026831051","commenter_b":"Liberal logic - Ban guns because you can call the police but the Police are Militant racists that can't be trusted so who are we supposed to call again? Ban all guns in the U.S. it will make us safer but keep the borders open so when the black market opens the guns can flow in like water. On an ending note; Police are in no way obligated to protect you from any threat per the Supreme Court so I guess when they do show up they can draw that chalk outline around your fresh corpse.","commenter_a":"Blah blah blah bullshit bullshit bullshit out of all the diehard ammosexual blowhards who love their guns. Europe doesn't have the problems we have in the country with guns. Neither does Canada or Australia. You want to believe what you want to believe. Follow the money. It's the NRA who wants you to keep your guns and fills your head with nonsense that you're just too willing to believe because you have no balls and tiny dicks. Try thinking about things instead of just buying into the rhetoric. The USA is safer now than at any other time in history. Why do you need them? Why focus on fairy tales like imagined revolutions against the government instead of focusing on things that are ACTUALLY happening like kids being killed in schools by LEGALLY OWNED GUNS.","post_message":"A company that worked on ‘Taken 3’ with Liam Neeson didn’t take kindly to his comments about the U.S."},{"comment_id":"10153396450126336","commenter_b":"So...?? How long will the free world tolerate this... We don't need another barbaric Nazi aggression...","commenter_a":"disgusting","post_message":"A worker at a U.S.-based chemical company in France was beheaded by terrorists bearing ISIS flags early Friday, authorities said."},{"comment_id":"1229955423699206","commenter_b":"Kick there asses and give them thirty days in jail and a ten thousand dollar fine.","commenter_a":"Dump the Trump - Really? - Obummer has divided this Country for the past 7 years.","post_message":"How would you deal with these protesters?"}]
