[{"comment_id":"10154020630826636","commenter_b":"@username however... that's detracting from my point! My original comment was about the UK's inability to prosecute migrant sex offenders!","commenter_a":"The only problem people in the uk have with immigrants, new British, Muslims etc... is the lack of police prosecution and \"special treatment\" minority groups get. There are an estimated 1 million cases of Islamic grooming, which've been swept under the carpet, by social services or went uninvestigated by police because of fear of being branded racist! That's not just some \"bigoted\" or \"islamphobic\" propaganda.. that's the reality of people living in a heavily Muslim populated area! The problem isn't with immigrants or non white Christian Brits... it's the lack of ability to deal with the crime coming from their community's by the authorities!","post_message":"Ironic?"},{"comment_id":"139820166538945","commenter_b":"So next time a woman has a child she doesn't want, wil you take it?","commenter_a":"Thank You, @username. Thank you, for keeping this promise. As you have always been pro-life, this is putting action to those words. #ThankU4speaking4Thebabies","post_message":"Today → House Votes to Protect Taxpayers from Funding Abortion"},{"comment_id":"10153470522401545","commenter_b":"I totally agree. It won't happen because it generates big money. A bunch of sick people","commenter_a":"And Porn is still accepted & allowed in our country & world ?!?! Porn is a horrible addiction causing harm to others. I want our elected officials to get porn out of our lives forever !","post_message":"In police documents obtained by WFAA, school bus driver Leonard Bradford told investigators he swam in a public pool with 40 to 60 children in the summers of 2014 and 2015. According to police, Bradford admitted to investigators that he purposefully rubbed his genitals on five girls."},{"comment_id":"546390502218196","commenter_b":"WHAT A ASSHOLE. !!!","commenter_a":"He is a Muslim!","post_message":"Obama threatens inprisoning military personnel for defying him. This is outrageous. He is drunk with power. Do you think Obama is a tyrant?"},{"comment_id":"849791398402742","commenter_b":"Well you be sure to let all those people know where that magic land is where all those wonderful jobs are just growing on trees!","commenter_a":"I think this is great. People will no longer abuse welfare and will actually get up and find a job.","post_message":"Arizona's Legislature cut $4 million from the budget by reducing the maximum time you can be on welfare from 5 years to 1 year. Critics say that it will cut funding for those who need it and can't find jobs. Supporters say it will encourage more to get off welfare and find work. What do you think?"},{"comment_id":"10152924972954342","commenter_b":"No the mother didn't give meth to the baby, the baby was born with it in its system meaning the mother used drugs while pregnant, she had the baby at home so they wouldn't test her or the baby BC when they come up positive CPS will take the child away","commenter_a":"...and exactly where was he going with this baby?? These crack heads now days are BOLD","post_message":"Police say this confessed drug addict was caught on camera smuggling his 2-day-old baby out of the hospital in a plastic bag. He was stopped by hospital staff after triggering an alarm and putting the hospital on lock down - but no one ever looked inside the bag he was carrying and they let him go."},{"comment_id":"10153793853959714","commenter_b":"You know how you don't want to date every girl you see? Girls don't want to date every guy they meet :)","commenter_a":"I don't understand why women say being too nice is unattractive when all they can talk about is how they wish they had a nice guy and someone who would finally treat them right but when they find a good man who does they say \"i can't be with you cause you're too nice\" and end up with the same type of guys who treat them bad I know part of it is because some girls aren't use to being treated like that so they go back to what they are use to or they just think we want something out of them give people a chance there are still good people left","post_message":"We don't know about this one..."}]
