[{"comment_id":"10153204606574342","commenter_b":"If she hate America she need to move","commenter_a":"but, she likes their $$$$$$$$$$$!","post_message":"Ariana Grande says she's sorry for saying \"I hate America\" in a recent video that leaked of her in a doughnut shop."},{"comment_id":"10153326829869170","commenter_b":"then let her and the mayor protect the city, see how good they do against the thugs.","commenter_a":"This whole deal is just so sad, on so many levels. Lots of fault to go around. Lots of blame to be shared.","post_message":"BREAKING NEWS: Baltimore's chief prosecutor says the death of Freddie Gray is a homicide. Six officers are being charged."},{"comment_id":"10153880875017994","commenter_b":"Can't say officer I Didn't see it... Lol","commenter_a":"Sweet","post_message":"This is a pretty \"cool\" pic."},{"comment_id":"10153526411091350","commenter_b":"I don't eat in private, why should my kid have to? Most women who choose to bf in public are so good at it, you don't even notice, so don't wore about averting your eyes. When I'm at target I'm busy shopping not looking for a nip slip.","commenter_a":"I completely support breastfeeding mothers but would prefer not to see it happening while shopping. Target should be providing private respectable areas for this if they really supported breastfeeding moms.","post_message":" policy supports breastfeeding in any area of our stores, including our fitting rooms, even if others are waiting. See why moms are swooning over the retailer breastfeeding policy."},{"comment_id":"10155255088631037","commenter_b":"Don't hate cause I'm not morbidly obese","commenter_a":"Where are all those kind hearted liberals who are protecting the refugees now?, you all show your true colors you will snub a American Woman just because of the job her dad has.. This is why the DNC is a sinking ship. Just look at all the red republican states now.","post_message":"Did Whoopi Goldberg think this is how Tiffany would react?"},{"comment_id":"1099154366818961","commenter_b":"Hypocrites and parasites all , get them all out now","commenter_a":"Kristian I don't know if you'll catch it","post_message":"#resigncameron demo live in London"},{"comment_id":"10153479746226438","commenter_b":"Nazi feminists, fuck off!","commenter_a":"Why are you showing a picture of this psychotic liar mattress girl who ruined a boys life with a false rape charge? There is no rape culture on college campuses. Rape has declined dramatically over the past decade. There are a lot of false charges of rape by scumbag feminist women though.","post_message":"Unfortunately, the oft-criticized statistic is true."}]
