[{"comment_id":"1867778023454493","commenter_b":"Yeah, all those vacations, all of that golf. It must have been a real bitch.","commenter_a":"Yes We Can dear President Obama and Yes We Will. Thank you for your service and your hard work for this country, against the constant and relentless Republican opposition, dissent, disrespect, hatred and racism.","post_message":"'I'm asking you to believe... YES WE CAN!'  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1228973160510939","commenter_b":"Typical liberal lesbian! Walking around with blinders on and not reporting the facts.","commenter_a":"She is the problem and needs to shut her mouth people like her have divided this country so much so sad they let her use what is suppose to be a bias platform to put out all this hate","post_message":"Run for Your Lives! Rachel Maddow is now warning that Donald Trump will definitely round up people and jail political opponents.  Meanwhile, you are accused of being a 'fear monger.'"},{"comment_id":"10154285238753984","commenter_b":"Dumb fucks.","commenter_a":"Yeah your baby sixteen not thirty???? but with a gun???? l bet he said before l'm a man a man he probably never said l'm a baby!!!! He pointed a gun at some cops you don't do that.If you point a weapon at someone it's to use it.And a good baby doesn't run from cops!!!! A gang member thug??? a baby???pleaseeeeee!!!! Over all it's sad when a young teen dies in this awful way. But you!!!! the parents of this teen is to be blame even charge with child cruelty for not teaching your baby respect since the beginning!!!! again it angry's me the ending of this young man!!!!","post_message":"A police officer chased the 16-year-old after he says the teen fled on foot from a car and then pointed a gun at him, which resulted in the shooting. Protests immediate erupt after eyewitnesses make this huge claim about the incident..."},{"comment_id":"759569737474968","commenter_b":"We also.have to put up.with people like you. I'd welcome anyone from anywhere else before I'd welcome you .","commenter_a":"If we gotta put up with Muslims...why the hell not at least he doesn't want to behead us","post_message":"If you thought he was in jail, you thought wrong."},{"comment_id":"1188981914457930","commenter_b":"A better statement than any feminist has ever made...","commenter_a":"Curtis Oakley","post_message":"They are doing it for a powerful reason."},{"comment_id":"483277565194949","commenter_b":"Jesus wouldnt like that she kills babies for a living.","commenter_a":"So sorry you folks are tearing this young woman apart, would Jesus do this?","post_message":"What'd you think, folks?"},{"comment_id":"10154324969511729","commenter_b":"How are they terrorists again ? Becus your tv said so ? They were where they shouldn't have been ...if Iran had war ships on the American shores America would nuke that country please stop with that bull shit all of a sudden people care for their army but when they come back broke homeless and jobless no one bats an eye no one takes time out of their lives to do shit about it no one protests to get them help ...so please shut the fuck Up with this false emotion","commenter_a":"A real president would have removed any hope of sanctions relief upon hearing reports that a terrorist regime had abducted any of our service personnel and had a carrier group steaming its way to the gulf with an ultimatum that those sailors be released immediately or else. But instead we get incompetent pandering from Lurch and Oblivious.","post_message":"Quite possibly the most ludicrous thing yet we've heard from this White House..."}]
