[{"comment_id":"10153932654413854","commenter_b":"He has cornered the market on STUPID...","commenter_a":"This guy is absolutely INSANE.","post_message":"Obama cites American Revolution as example of Americans being falsely paranoid about gov’t tyranny"},{"comment_id":"10155066406976509","commenter_b":"Don talking bull**** without proof !","commenter_a":"Everyone dopes in the Olympics China, USA, Germany you name it, everyone, the Russians were just dumb enough to get caught.","post_message":"BREAKING NEWS: Russia has failed in its quest to have a ban on its track and field athletes at the Rio 2016 Olympic Games overturned."},{"comment_id":"10153553565406955","commenter_b":"I can't wait until a loonie lib woman gets attacked by a filthy Muslim","commenter_a":"Muslims versus liberals...this is going to be fun.","post_message":"Topless protesters disrupt Muslim conference in Paris..."},{"comment_id":"631709593654535","commenter_b":"Just left Great Lakes Navy Recruit Center and such pride in our country and military on full display....folks from all backgrounds. Hillary does not support our troops and I can only pray that my son does NOT have to have that woman as his CIC","commenter_a":"The irland of cyprus to .with u trump","post_message":"I am truly honored and grateful for receiving SO much support from these military leaders -- American heroes -- who have defended our freedoms. THANK YOU for your service and sacrifice, as well as your confidence in me to serve as Commander-in-Chief. #AmericaFirst!"},{"comment_id":"10154162450013812","commenter_b":"This alone would make me patronize your establishment on a regular basis.","commenter_a":"I salute you! way to be a decent human.","post_message":"Pizzeria owner makes it a point to hire workers with disabilities: 'We did it because it needed to be done. There are no jobs out there for these kids, so they are being prepared for nothing.'"},{"comment_id":"10153228975447452","commenter_b":"*facepalm* ... She is an idiot. She should have respected their religion.","commenter_a":"Charge the lady for assault","post_message":"Attacked as they prayed?  A group of Muslim men say a worshiper was hit in the face and doused with coffee in a confrontation with an irate woman in a NorCal park. abc7.la/1Qgwbam  “You are very deceived by Satan,” the woman yells as the wild scene is caught on camera. Should she face criminal charges? Why she’s not backing down, in her own words."},{"comment_id":"10152666100851680","commenter_b":"I used to be sympathetic to Israel. Not today, and I'm part jewish.","commenter_a":"Yes it has lost its soul and also the respect the world had for Israel.","post_message":"OPINION: Fear defeated hope in Tuesday’s election, disfiguring our future. Via POLITICO Magazine"}]
