[{"comment_id":"10156349571840354","commenter_b":"Racist illegals","commenter_a":"We deport your sorry ass, illegal!","post_message":"Brace yourselves.  Amnesty activists just launched a VIDEO that EVERY American should WATCH..."},{"comment_id":"10153774717459726","commenter_b":"She's an angry heifer","commenter_a":"Cows go... MMMMOOOOOOOOO","post_message":"WATCH: GOP consultant Liz Mair says she's going for big money now to sink the GOP front-runner"},{"comment_id":"10153237578092144","commenter_b":"So she's dumb n ugly","commenter_a":"she's as smart as she is beautiful...","post_message":"To borrow a line from \"Jaws,\" she's either very very smart or very very dumb."},{"comment_id":"10154001679275927","commenter_b":"Every time she opens her mouth out comes more drivel!","commenter_a":"She owns a vineyard in California, I think she personally does all the wine tasting herself!","post_message":"WATCH-- President Clinton, as well as President Obama, we operating on a pay-as-you-go basis ...\""},{"comment_id":"10154200313034411","commenter_b":"@username do explain which nation was exterminated, and you're a unwelcome imigrant in south africa, you will also get what you sow, dickhead","commenter_a":"England never apologized for any war crimes during Imperialism era ...bcoz they are too fucking arrogant and Egoistic goons !!!","post_message":"During the Second World War, Ireland remained neutral and successive Irish governments were openly belligerent to British interests (Op-Edge by Bryan MacDonald)"},{"comment_id":"718460845008873","commenter_b":"never happen... if they couldn't massage their egos with those little golden idols... their would dry up and blow away.... or perhaps blow each other (y)","commenter_a":"Oscar - a trophy given by actors to actors for being actors. Like it makes the world a better place - NOT.","post_message":"Hollywood SCUMBAGS Might CANCEL the Oscars to Protest Trump"},{"comment_id":"10154196354922541","commenter_b":"She looks ridiculous","commenter_a":"love it!","post_message":"In case you missed it, Beyoncé’s pregnant."}]
