[{"comment_id":"876721502518426","commenter_b":"She don' deserve nothing more than 10 years in jail and not a holiday jail for what she has done to this Country she deserve the punishment that she gets","commenter_a":"No! She deserves jail!","post_message":"Hillary Clinton's worst nightmare just became her reality. Days before the election everything crashes. 'LIKE' if you think Hillary deserves justice?"},{"comment_id":"1065493480157790","commenter_b":"I hope he is right. We can live well without what Beck represents.","commenter_a":"lol Beck is always good for a laugh","post_message":"Glenn Beck's reaction to the fact that the Supreme Court upheld Obamacare was nothing short of amazing."},{"comment_id":"10152870129557093","commenter_b":"Omg this woman is so racist!!! Just watch! Lol @webpagelink","commenter_a":"He doesn't need to apologize! People need to learn how to act! And how to respect higher Authority. Life would be more peaceful if people just learned to act like decent people","post_message":"Attorney for McKinney Cpl. Casebolt said two suicide calls before pool party put him in \"emotional place\" .... said Casebolt apologizes to those offended by his actions.... @webpagelink"},{"comment_id":"10155025944411509","commenter_b":"That is not a woman.","commenter_a":"Why is this even news. Do we report on all suicide attempts by convicted criminals or just the Transgender ones ? Bias, bias, bias....","post_message":"U.S. Army soldier Chelsea Manning, imprisoned for leaking classified documents, tweeted that she was \"glad to be alive.\""},{"comment_id":"10153101900003010","commenter_b":"WORTHLESS PIECE OF HUMAN FLESH...","commenter_a":"This world is coming to an end . I feel sick after reading this","post_message":"A 30-year-old Newhall man told sheriff's deputies his newborn daughter was missing. But investigators say he sexually abused, tortured and killed the 19-day-old child."},{"comment_id":"658534947621213","commenter_b":"@username stay home then","commenter_a":"The Trump camp says Cruz is stealing the delegates? A delegate cannot be stolen! They are professional adult people that make up their own mind! In other words, they are not controlled by anyone!","post_message":""},{"comment_id":"566760130115693","commenter_b":"lol women are objectifying themselves! they love the attention! women are one the most hypocrite creatures in the world!","commenter_a":"Females are excepting this behavior. It goes both ways..","post_message":"The #WomenNotObjects campaign wants advertisers to know that consumers are fed up with how females are portrayed in the media."}]
