[{"comment_id":"10154326726666729","commenter_b":"None... Technically. I do think they may have accidentally drifted into their waters..","commenter_a":"Why did our sailors surrender and why didn't we have any support for our sailors such as a helicopter? Something isn't right here, this stinks like Benghazi.","post_message":"We REALLY wish we didn't have to show you this, but this is what the results of feckless foreign policy leadership look like..."},{"comment_id":"10153130457761162","commenter_b":"P.s pimps should be illegal, prostitutes should regulate their own self on how.much they make an what not","commenter_a":"Would it have been better if he had raped someone?","post_message":"NEW: NFL Hall of Fame lineman Warren Sapp arrested for allegedly hiring a prostitute after covering the Super Bowl for the NFL Network: @webpagelink"},{"comment_id":"10152694778793717","commenter_b":"Colebrook....-38","commenter_a":"Berlin -22","post_message":"We're looking for your best guesses for the coldest spot overnight tonight in New Hampshire. Comment below with your guess for the town and temperature, and Kevin Skarupa will reveal who was right Thursday morning!"},{"comment_id":"10154400820486051","commenter_b":"@username Suck it up Buttercup, it's the middle class that pays the taxes that all you losers live on. President Trump has done more, so far than Obama has done in 8 years. Oh I forgot he (BHO) has flooded America with illegals that are: murderers, rapist and child molestersl. The best thing that can happen for the USA is the Big One hit and take California with it.","commenter_a":"Rock on Rosie! Trump is scum! All these despicable people supporting him would make america great again by leaving. They are what is wrong with our country.","post_message":"Rosie O'Donnell just made a very controversial accusation against Donald Trump."},{"comment_id":"10153702258075779","commenter_b":"Sadly, you're probably right!","commenter_a":"He has been proven over and over to be a business failure, a liar, a walking contradiction, unfit foreign negotiator, bigot, mysoginistist, nuke-happy clown! Does the man have to eat a live baby before people get the hint?","post_message":"We all know for-profit colleges are shady, but how bad can they really get? A former for-profit professor explains why Donald J. Trump's is the worst."},{"comment_id":"10154090302722452","commenter_b":"So someone purchased a ticket for this bear, and the TSA couldn't screen it so it could go on the plane?!","commenter_a":"If he bought a ticket then he should have been allowed to bring it on the plane","post_message":"A YouTube star bought a plane ticket for a massive teddy bear as a stunt, but was forced to abandon the bear at LAX."},{"comment_id":"10153732430689117","commenter_b":"It is a completely legitimate discussion. In the 21st century private corporations have power equal to or even greater than a government's over people's platforms for speech and expression. In 10 years it is entirely possible that a single multi-national company will control all of the major social media platforms. Which means they could quite easily silence any viewpoint that they don't like. This in fact is already happening in many places around the world. Mark Zuckerberg will eagerly jump into bed with any ruthless dictator and agree to censorship on that country's population.","commenter_a":"There is no free speech war to be had. Twitter is a private entity and can ban who ever they like, for what ever reason. They do not have to abide but the first amendment, the government does.","post_message":"#FreeMilo just became a thing. Thanks, Twitter."}]
