[{"comment_id":"10153124217341051","commenter_b":"Ive seen women pulling crap everything from getting a friend to flirt to wrecking a guys car.Stupid and insecure....","commenter_a":"she was watching too much titanic","post_message":"This woman wanted to test her boyfriend's love for her by climbing over the railing on a cruise ship to see if he'd come to her rescue. You can probably guess how that worked out."},{"comment_id":"1095951603760962","commenter_b":"Don't forget her daughter got knocked up","commenter_a":"and her 'classy' son beat up his girlfriend...great family values","post_message":"When it comes to Donald J. Trump, the gloves are off."},{"comment_id":"10153274768969312","commenter_b":"Doesn't look like it! !!!","commenter_a":"Dont inmates get free dental care?","post_message":"Police say 32-year-old Jemayle Johnson escaped from St. Ann jail around 11:30 last night."},{"comment_id":"1427954837264260","commenter_b":"I consider reading this page to be a spectator sport. ;)","commenter_a":"Such a disgusting Olympics. The committee needs higher standards.","post_message":"And you thought Rio's green pool was worrying!"},{"comment_id":"1811243409145396","commenter_b":"what kind of genius stays with a man who outright cheats on you and is a womanizer....","commenter_a":"what kinda genius puts our deficit at $20 trillion....","post_message":"\"Now, how anybody can lose a dollar, let alone a billion dollars in the casino industry, is kind of beyond me,\" Hillary Clinton said of her opponent."},{"comment_id":"10156311109050354","commenter_b":"FUCK THEM.","commenter_a":"Another attack on the First Admenent","post_message":"\"You’re taking my rights. You’re taking what I am. My roots run Southern.”"},{"comment_id":"10155984439405354","commenter_b":"She's gross and needs to go away. Now.","commenter_a":"She's making too much money telling bad jokes.","post_message":"Schumer did not mention that the shooting during her movie took place in a theater with a total gun ban–**100 percent gun control**."}]
