[{"comment_id":"1508345139225610","commenter_b":"His wife has his balls..","commenter_a":"SEE THIS IS THE SHIT THAT HAPPENS WHEN WE APPEASE TERRORIST SUPPORTING NATIONS JUST LIKE JMMA(THE PEANUT BRAIN) CARTER AND BILL(I DID NOT HAVE SEXUAL RELATIONS WITH THAT WOMEN) CLINTOOOON DID,, NOW OBAMA IS DOIN SAME THING BUT THIS TIME HE HAS LET THEM GO NUKE,,,THEY PLAY WITH US BECUAS ETHEY KNOW OBAMA DOESNT HAVE THE BALLS TO DO ANYTHING SAD","post_message":"JUST IN:"},{"comment_id":"10153968954135695","commenter_b":"Read article it happened in Pittsburg","commenter_a":"Way to go ga.","post_message":"“They told me I was OK to park where I was, as long as I was not on the curb… then I come out and I'm being towed,' one parent said."},{"comment_id":"475937869263460","commenter_b":"what drug is she on these days? Think she's lost it in her old age....","commenter_a":"yes christian should pray all the time","post_message":"Parton delivers strong message to christians everywhere.  This is out of line, we need to show her that this type of public disrespect is unacceptable.   Do you agree that christians should be able to pray in public?"},{"comment_id":"895076240539004","commenter_b":"Angela and Sheira close your fucking legs, Whores!!!!!!!!","commenter_a":"Unborn Baby's are Human at the time of conception.....Duh.....that's not hard to figure out. When you abort AKA MURDER a Baby at any time after conception it is very simple.....IT'S MURDER.....just watch our Court system when a drunk kills a pregnant woman they will be charged with the MURDER of the child as well. There are just some people that will argue against the facts to try to justify MURDER but make NO MISTAKE it's MURDER. Just because you get pregnant and it's inconvenient and you call it abortion, does not change the fact everyone knows in their heart IT'S MURDER.","post_message":"How cool is this?"},{"comment_id":"10153480904281162","commenter_b":"I just would like to know, how much money has she spent in tanning salons...","commenter_a":"i've been black since I was 5 yrs. old. look at my pic.","post_message":"BREAKING: Did Rachel Dolezal lie about her race? Dolezal, the woman at the center of the race controversy, has resigned as the president of the Spokane NAACP @webpagelink"},{"comment_id":"10153981518484749","commenter_b":"These drivers are trespassing on private property. The property owner is 100% within her rights to report each trespasser to the police and have their cars towed.","commenter_a":"why not have it towed? make a deal with a local tow company and get a commission off each car towed from your driveway","post_message":"'Happy digging, at least it's not raining.'"},{"comment_id":"1581842645443556","commenter_b":"'@username We saw that guy with the brains.Did you?","commenter_a":"'i need all the white people to move to the back' that's not racist or anything...shaking my head, god forbid a white person had said that about black people, a riot would break out","post_message":"Black Lives Matter protesters attempted to segregate white members of the media during a demonstration near the DNC. @webpagelink"}]
