[{"comment_id":"10153932351055950","commenter_b":"FEMALE FAT FARMS WILL RULE TRUMP PRESIDENCY... .LOL.LOL.LOL. FAT CHICK'S BEWARE","commenter_a":"If Hillary cared so much about women she would not have brought this woman's name up. That just shows she will use anyone to get her agenda out there. She's Evil. Just remember she was the person who brought this up on debate night.","post_message":"This former Miss Universe says Donald J. Trump's comments about her brought up bad memories from 20 years ago when she gained a few pounds after winning his beauty pageant."},{"comment_id":"1071771339501789","commenter_b":"@username Blacks are Americans, so are whites on assistance, and American Latinos. I would rather support 20 million of them than 1 illegal Anchor baby and it's Family. Maybe all those Americans on assistance wouldn't need assistance if the illegals weren't taking the jobs Americans need.","commenter_a":"My mother was a volunteer Pink Lady at the hospital in Weslaco Texas and she verified several times to me that Latinos routinely arrived in labor so they had no time to get back to Mexico. They wanted their babies born in America.","post_message":"Astonishing video proving Donald J. Trump is right... Ten percent of the people born in America today are to children of illegal aliens..."},{"comment_id":"10153194467946756","commenter_b":"OH. MY. GOD.","commenter_a":"the 33 1/3 book he did is awesome","post_message":"\"Whether it's a song, or a book, or a conversation you have at dinner, the creative thing is what happens in the process—not the relic of it,\" says the man behind the band the Mountain Goats."},{"comment_id":"10153579902226135","commenter_b":"I think it's illegal to drive while drinking whether or not you have a child in the car...","commenter_a":"What's her name? I want to see if she has a Facebook.","post_message":"Initially, the woman is seen on video wearing only a tank top and underwear. Police says she appeared sluggish and smelled of alcohol."},{"comment_id":"1149041588518531","commenter_b":"I'm a nasty woman too. FUCK DEPLORABLE INC.","commenter_a":"I guess I'm just a nasty woman!!!","post_message":"I don't think this is what Donald Trump expected to happen."},{"comment_id":"1753303961361759","commenter_b":"Ooooh a compliment! Now go get your pussy grabbed by some rich wrinkled old prune.","commenter_a":"she's a Hillary wannabe","post_message":"I’m still banned from speaking on the floor of the Senate about the nomination of Jeff Sessions to be Attorney General. But this morning, I met with civil rights leaders and other Democrats right outside the Senate floor to say: Coretta Scott King will not be silenced."},{"comment_id":"1705728746332744","commenter_b":"The blacks elected him with help thinking they would have it made financially etc and now more are out of work and on welfare than ever. They have to stay in school and work hard like everyone else to get ahead and blacks don't see it. How do they think you get a position anywhere?","commenter_a":"Absolutely","post_message":"SHARE IF YOU AGREE!"}]
