[{"comment_id":"10153945606794060","commenter_b":"Shut up!","commenter_a":"Turkey is the gateway for Islamists to enter Europe and the birthplace of fascism.","post_message":"For the Turkish nation Turkishness goes beyond nationality. But some citizens consider themselves more Turkish than others"},{"comment_id":"1010063709005886","commenter_b":"Don't ask questions.....get them out !! We don't want those barbarians here !! They have proven they can't live in a civilized world .....they try forcing there garbage on everyone !! I refuse to live like these monsters !!!! Deport obama along with his muslime scums !!","commenter_a":"Its about time! He had relocated OVER 353k muslims since he entered offc. NO CHRISTIANS - he left them to be slaughtered by his isis comrades. All of these relocated muslims r all on welfare and considered ILLEGALS. Living off the backs of 741915279236631s they hate.","post_message":"Finally, the GOP is getting serious about asking questions about Barack Obama colonizing America with Muslim Refugees!"},{"comment_id":"1219104934776201","commenter_b":"And this is what this gremlin boils down to!","commenter_a":"This old man ain't going nowhere. Pump up the Trump.","post_message":"The conventional wisdom of the Democratic race holds that Vermont senator is the principled liberal challenging Hillary Clinton. But Bernie Sanders has moved too."},{"comment_id":"1226169560742155","commenter_b":"In other words what you want is to shut her up like Christians have been doing for too long in order of political correctness. And accept this mockery of a gay marriage. All religions in the world are against gay marriage. Its unholy, unatural and discusting and a general majority agree with that. Look at how muslims treat them lol. You wanna be a fruitcake? Fine, but stop throwing your discusting life in normal ppl's faces with ur ridiculous parade of freaks and now want to step into normal familly life of husband and wife. Its not for you. Adam and Eve. Man and Woman. NOT adam and steve! Marriage is between a MAN and a WOMAN. Amen to the sister with enough conviction to stand her ground. This is just the beginning. Her stand has awakened MANY. Its about to get nasty for a few :)","commenter_a":"Kentucky Christians should march for her. Don't remain silent, be there for the sister. Amen","post_message":""},{"comment_id":"10155879788485354","commenter_b":"Send them all back. Stop immigration period. Let's get a handle on it before starting it back up. We need to police our new immigrants better.","commenter_a":"FOOK AMNESTY","post_message":"Some truly shocking statistics in this article..."},{"comment_id":"10153417319160927","commenter_b":"....using plus size models to sell plus size products, what a amazing concept!","commenter_a":"Game over? Looks like the fat lady is singing.","post_message":"Did Facebook fat-shame?"},{"comment_id":"10153197491081051","commenter_b":"She's already proven she's delusional","commenter_a":"Nancy - Have Another Drink !","post_message":"Nancy Pelosi says President Obama's Iran deal is simply brilliant. Agree or disagree with her?"}]
