[{"comment_id":"968036809901222","commenter_b":"Take the criminals away first","commenter_a":"FAST & FURIOUS ???","post_message":"This is one of those times where a picture is worth a 1,000 words!"},{"comment_id":"455232604658620","commenter_b":"Hillary Clinton!!!","commenter_a":"Bernie Sanders!!!","post_message":"Listening is always better."},{"comment_id":"10154556355598690","commenter_b":"Some women just cant understand that others wish to cover up. Brainwashed since childhood to wear hardly anything.","commenter_a":"If the burkini is a symbol of Islamic extremism, then does that make the bikini a symbol of Western extremism or rather, Western subjugation of women? Surely freedom works both ways? Why should women be forced to show skin if they choose to cover up?","post_message":"Cannes Mayor David Lisnard called the full-body, head-covering swimsuit worn by some Muslim women \"the uniform of extremist Islamism\"."},{"comment_id":"1311217235558559","commenter_b":"I watched and every single one of the questions by Greta and the so-called voters sounded handwritten by Trump henchmen... they each read off their question all just like they were part of Trump 's typical campaign stump speeches... That was nothing more than free air time for a Trump speech... Greta where was Ted or John?''' I am done with Greta and Hannity you just cannot trust anything they would report on again... I used to think better of Greta giving everyone a fair shake but this is just too blatantly biased... hope her ratings tank and Fox gets rid of her!!!","commenter_a":"Gutfield is a moron. Flip the channel whenever he is on.","post_message":"Gutfeld now openly mocking fellow Fox News hosts."},{"comment_id":"1329355063770614","commenter_b":"And yet, billions of US tax dollars are given to foreign governments each year without the consent of tax payers. It's disgusting and so sad that we have Americans living like this and Obama and the entire Democratic party wants to bring hundreds of thousands more refugees into this country to live on the taxpayer dole! How stupid are we to keep putting these people into positions of power this way?!!","commenter_a":"There are many homeless in the Seattle area that live in tents because they don't want to have the restrictions that comes with living in a homeless shelter. Restrictions with when they come and go and what goes on there.","post_message":"OBAMA PUSHES AMERICANS INTO TENT CITIES.  Hillary will keep them there.  VIDEO  @webpagelink"},{"comment_id":"10155066370401509","commenter_b":"So trump does something good and the left will still whine like stuck pigs and try to spin it.","commenter_a":"Sadam Hussein was Trumps mentor.","post_message":"Donald J. Trump  last month forgave more than $47 million in loans he made to his own campaign committee"},{"comment_id":"1080774725297647","commenter_b":"Given the history of Egyptian-Israeli relations it doesn't seem at all out of place","commenter_a":"We salute Egiptian people. This reminds us of GEORGE W. BUSH lrt him try to fly to Iraq there will be rain of rotten shoes on him","post_message":"An Egyptian lawmaker has been attacked with a shoe in parliament after he invited the Israeli ambassador to Cairo for dinner."}]
