[{"comment_id":"10153146614743984","commenter_b":"You Dum bitch","commenter_a":"IMPEACH OBAMA NOW that damn MUSLIM","post_message":"Wow. I'm sure this is the last thing Obama wanted to slip out to the public. Do you think Obama is one of our worst presidents ever?"},{"comment_id":"771105652991563","commenter_b":"It would be a GREAT PLACE TO START.","commenter_a":"Yes","post_message":"It is widely known that George Soros was affiliated with the Nazi Party, and he's also a major financier of a number of democrat programs."},{"comment_id":"10154864481904170","commenter_b":"I know enough about Trump and Clinton. Only one has committed crimes worthy of prison time. Can't dispute facts.","commenter_a":"Ivanka is an amazing woman which demonstrates that President Trump is not only successful in business, but with his family too. A real winner in every sense of the word. #MAGA","post_message":"This should get people's attention."},{"comment_id":"10153829014724091","commenter_b":"Does the witch have pizza","commenter_a":"Sounds like trump","post_message":"We're under a Tornado Watch -- checking in with Lee Goldberg on what we can expect."},{"comment_id":"10153422515817235","commenter_b":"There are a good number of female cops killing for nothing.. Just look it up.","commenter_a":"Another petulant, controlling, entitled man killing a woman who told him 'no'. I'm really sick of men behaving this way simply because he can't get his own way. Women do not DO this. Why do men?","post_message":"Protecting and serving the hell out of you."},{"comment_id":"1033224813385043","commenter_b":"My favorite lesbians work at Home Depot............","commenter_a":"I think my favorite part is that the guy was uncomfortable that gay men were running a hair salon. What? Don't you know that's where gay men come from? Salons and interior decorating warehouses. (Edit: Apparently I need to state that I am a lesbian and an activist and this is a joke poking fun at the stereotype. If you're offended by this, I suggest you take your efforts and make a change instead of complaining on an internet post.)","post_message":"*slow clap*"},{"comment_id":"1466279580067766","commenter_b":"Yes!","commenter_a":"Yes !!! What choice do we have...?","post_message":""}]
