[{"comment_id":"861173230647951","commenter_b":"She is crazy","commenter_a":"Just 12 years? WTF","post_message":"8-year-old Julie died the same day she was going to be a flower girl at a wedding. Her mom has admitted to killing her daughter."},{"comment_id":"923666907700065","commenter_b":"That hoe better learned how to fight cuz we gon square up lmao","commenter_a":"'@username if I ever find out my daughter sucking dick idgaf she can get it . lmao go to her school and embarrass her. lmao","post_message":"Mom Beats Her Daughter In Broad Daylight For Sucking D!"},{"comment_id":"10155406778245231","commenter_b":"Couple? Ha! You are uninformed white women have been weaving in droves for years. Weave is weave texture is not a determining factor.","commenter_a":"Does that include white women too?","post_message":"But will he take their money when they purchase tickets?"},{"comment_id":"1776189505982322","commenter_b":"dumb blonde","commenter_a":"You can't act like a 10 year old threatening to nuke someone if you don't get your way -- that's what Trump would do. Donald Trump doesn't have the temperament, the intelligence or the conscience to have these codes.#imwithher","post_message":"Republicans agree: We can't give Donald Trump control of our nuclear codes."},{"comment_id":"10156008718310354","commenter_b":"Omg still an ugly turd inside and out. Who cares what this bitch thinks or says!!!","commenter_a":"Yeah.... there is someone with less class than a pig.","post_message":"Just when you thought she couldn't be any more vile..."},{"comment_id":"967270790032642","commenter_b":"You plutocratic blithering batch of flabbergasted infidels have the combined iq of less than one dead skin cell from the shmuck of @username's majestic penis post-circumcision and he in his infinite wisdom has confirmed that over 50% of all American penises have regressed so far due to their sheeple tendencies that they are considered vaginas by anatomists everywhere","commenter_a":"According to experts in the field of computer science the most logical, and therefore most correct, outcome would be for us to all vote Republican in the next election, the obvious pattern must be continued. Humans are not capable of conscious thought (especially not Americans) and must therefore follow trends like the herd animals they are.","post_message":"The jobs numbers say it ALL.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155983890750354","commenter_b":"Yea I enslaved your lazy asses. That's the only way to get you to earn your keep.","commenter_a":"Agreed. Kill us all and then who will pay for your entitlements.","post_message":"“You mother-f**ckers...came and stole us from Africa and put us in chains and murdered us for over 400 years, so yeah, you do need to die.'"}]
