[{"comment_id":"10153356905187439","commenter_b":"Mussies I swear they're really just opressed homosexuals","commenter_a":"Bastards.","post_message":"@webpagelink"},{"comment_id":"10154308673266178","commenter_b":"They have NO rights if they are in this country illegally.","commenter_a":"If you want to protest, you have every right. When protesting and you decide to escalate your actions by using violence, you are not only breaking the law but also trying to infringe on other people's freedom of speech.","post_message":"The LA Times gets political over the Trump protests.  Here's their biggest concern..."},{"comment_id":"10154517298243132","commenter_b":"@username It has already been released that the arresting officer was a open lesbian in a relationship. Also that according to court documents, that her ex was terrified of Amber after the \"assault\" took place and that there was property that belonged to the ex that was damaged. Funny how records show one thing and now the ex is stating something different.","commenter_a":"Why isn't @username publishing the story Daily Mail and TMZ did about Amber Heard's domestic violence charge from her ex \"wife\". She obviously has a violent past and I'm not say that \"if\" she was abused that what happened to her was justified. The fact maybe they had a volatile relationship. She could have also beat on him as well as he her, again abuse is abuse. But for all the victims out there, if she is lying for the money that's basically a slap to the face for those who were actually abused.","post_message":"iO Wright says Amber Heard suffered at the hands of Johnny Depp."},{"comment_id":"10152833752231130","commenter_b":"Hell yea older woman know what's up:) Amber Gray","commenter_a":"Lol. Ian.","post_message":"Yet women prefer to be younger than their partner."},{"comment_id":"10156543098270354","commenter_b":"So he opens the gates to let them in and then starts deporting them. I smell a RAT.","commenter_a":"Great but post it on obama and hillarys pg","post_message":"Obama Photo-Op Head Fake.  Don't Believe the Hype..."},{"comment_id":"10153209729066051","commenter_b":"I am a woman but if you not respect the man, specially on from of so many people, how do you spec, he is going to do. My friend you said what you WANT sorry you heard what you DESERVE.","commenter_a":"He has the right to his opinion and here we go again with Kelly, supposedly a conservative, telling someone that they don't have a right to say what they think. War on women, isn't that a liberal jab or stab...you bet it is. Keep talking Mr. Trump and you may win my vote, too!","post_message":"Donald Trump just got banned from a GOP Presidential debate because of this comment about Megyn Kelly."},{"comment_id":"838659359573185","commenter_b":"DON'T LISTEN TO THE DUMB BLACK BITCH","commenter_a":"Bigot","post_message":"Oprah: ‘If You Hate Obama You Are Racist, If You’re Racist You Must Die’.  She is the racist.  Do you think Oprah is a bigot?"}]
