[{"comment_id":"1183538221666206","commenter_b":"Now his mother is going down. Lol","commenter_a":"They have the wrong MAN!! Texas has executed many people because they are known to railroad!! We need to donate to the mans defense.","post_message":"The mother of the suspect in the execution-style killing of Texas sheriff's Deputy Darren H. Goforth said her son can't be the gunman because he was out shopping with her at the time."},{"comment_id":"928293913874616","commenter_b":"Brain dead liberals.Why would you want to force someone to marry you?","commenter_a":"What makes anyone think that someone would want the clergy in your faith to perform their ceremony if they did not believe in it. Two people in love that want to get married would never choose someone to marry them that was not accepting of them. There are many other clergy accepting out there. Not all WANT religious rites. Civil ceremonies performed are the legal ones that count. Not one person (straight or gay) can get married in the church without that civil license first. People are getting totally out of hand on this. The church is going to do what they want anyway. What really counts is marriage is legal for all.","post_message":"Wow."},{"comment_id":"10153403140121037","commenter_b":"If she looks like that at 65, I want some of what ever she got hahahahaha","commenter_a":"getting paid to be in the media daily ? yeah nervous about something","post_message":"Watch the full video: Katie Couric speaks with Vanity Fair writer Buzz Bissinger and stylist Jessica Diehl about #CaitlynJenner's groundbreaking cover story."},{"comment_id":"876377039127570","commenter_b":"Hopefully the \"treatment\" is the same pain & suffering the little girls had to endure","commenter_a":"There is sex offender treatment in prison?","post_message":"Nicole Vaisey, 26, and her boyfriend, 40-year-old Stephen Howells, admitted that they kidnapped the two Amish girls."},{"comment_id":"10154047857863855","commenter_b":"Fake, phony and fraudster. Being a lesbian gave her no special privilege to ripoff people","commenter_a":"Bet she didn't see that coming!?","post_message":"RIP Youree Harris."},{"comment_id":"940585612654173","commenter_b":"Aleeyah your FB page is wacked out!! Girl I feel sorry for your kid. Get yourself some help. God don't like ugly!!","commenter_a":"Whitefolks did the same thing to Black Slaves, yes it is demonic and insanity. Look whom and what rule we have been unjustly livong under. The girl is showing the affect of what she was taught and learned from her step forefathers the Slavemasters children.","post_message":"Mother accused of intentionally setting her newborn baby on fire enters a not guilty plea, will undergo a mental health evaluation: @webpagelink"},{"comment_id":"952811251478596","commenter_b":"@username how about you go fuck yourself","commenter_a":"Wow, while I agree that both parties are leading us down a rabbit hole. The fact is we have two parties that lead us in this country. The democrats have a criminal and a socialist as front runners in their campaign. So I have no alternative but to endorse the republican party. If my friend that liked this post feels that makes me anti American then I guess we don't know each other as well as I thought.","post_message":"This HAS to be said. Image by Occupy Democrats, LIKE our page for more!"}]
