[{"comment_id":"10154462240499087","commenter_b":"No, former president Bush didn't listen to the Intelligence Community and he didn't wait for their final report: he ordered them to leave to start his war!!","commenter_a":"It seems funny to me that all you Democrats were screaming with President Bush took the intelligence community advice on \"weapons of mass destruction\"! How quickly we change our minds....but now we are to trust the intelligence community?","post_message":"\"Lesson #1: don’t mess with the intelligence community.\""},{"comment_id":"10153891408869062","commenter_b":"Yeah","commenter_a":"Waiting on PA","post_message":"JUST IN: The Texas House Committee approved a bill to make marijuana legal for adults. It still has a long way to go before becoming law, but what do you think?"},{"comment_id":"10154346191079411","commenter_b":"I don't even think about you or feel absolutely anything for any of the followers of such cult... But i can tell you something: The members of the Western Civilization are entitled to protect Our values, Our culture and Our true religions from the plague that has overshadow every region it has reached... And there is absolutely nothing all of you can do about it. And if it happens that you are an antisemite like a very big portion of the muslim population, i can tell you that your life wouldn't be the same without Google, Whatsapp, Facebook, Oracle... and so on (Those are jewish invetions). Finally how can such a small country like Israel (You live next to it) defend itself from dozens of enemies and at the same time be so strong with such a small population? The brotherhood defends us all with the power of G'd... not ...","commenter_a":"If french people want to be slaved and force to convert to that filthy and pedophiloc religion then Fuck U All... Just wait to be once again a province from another country","post_message":"'I saw Muslims celebrating in the street during the attack. I saw it with my own eyes. In real time!'"},{"comment_id":"939719642754180","commenter_b":"Or he could just drop dead and save his family the embarrassment and the courts the cost.","commenter_a":"IF any of this is even true, if you waited this many years, you own it. Grow up.","post_message":"The once beloved comedian will hopefully not get away with his alleged horrific crimes against women."},{"comment_id":"10153778323659497","commenter_b":"Oh, NOW I find out where all the women with things are. You couldn't have said this sooner?","commenter_a":"I grew up in Bloomfield Hills. This is too accurate! 😂","post_message":"Walsh family members confirmed that Mom wouldn be home until later because of her thing."},{"comment_id":"10153154951847994","commenter_b":"Finally a judge with a brain! you go girl! They should get life but sadly they will have some tear jerking defense and will probably get ten years.","commenter_a":"Wow, this was compelling!!!","post_message":"A judge is furious over the death of a little child -- and she let the suspects hear it. She says watching their police interview footage was more like watching a cable TV show.   Read more about the case here: @webpagelink"},{"comment_id":"10153936248091336","commenter_b":"American homosexuals bring HIV into the world.Nobody condemns them but Africa has Ebola everybody condemns Africa","commenter_a":"Nothing good comes out of Africa!","post_message":"More than 2,700 babies have been born in Brazil with microcephaly this year, up from fewer than 150 in 2014."}]
