[{"comment_id":"10154538085533812","commenter_b":"'You gotta take them out'...... for dinner and a movie. Because Hillary, you see, she's a criminal. All my lawyer friends understand this. And we're gonna build that wall, believe it.","commenter_a":"He is such an idiot","post_message":"Donald J. Trump said that he would be open to using NATO forces to fight ISIS despite blasting the alliance in the past as 'obsolete.'"},{"comment_id":"10154452810413812","commenter_b":"Kick her out.. Back to Honduras, then she can sue the Doctor there...","commenter_a":"I'm waiting for liberals to come on here and blame Trump somehow I'm surprised ABC didn't blame Trump for it","post_message":"Mother of infant born in NJ with microcephaly says doctor in Honduras told her everything would be 'fine' after she reported having a fever. “He said, ‘Don’t worry, everything will be fine. I don’t think you will be affected.' Then I had an ultrasound, and everything looked fine.'"},{"comment_id":"1227725310657052","commenter_b":"Please don't reproduce.","commenter_a":"Trump incites violence. He is bringing the racists out in droves and he is dividing this country. Since he came on the scene, there has been more hate crimes than I've ever seen. Wake up people!","post_message":"The sniper attack on Dallas police officers now ranks among the deadliest against U.S. law enforcement since 1900."},{"comment_id":"10153392928479170","commenter_b":"Don't you feel safe now that the country is being run by grunge mosh pit princesses like this character?","commenter_a":"She is a leftist loon with zero common sense. A perfect fit for the Obama team.","post_message":"The woman who gave you 'jobs for Jihadis' is now working on the Iran nuclear deal. Time to 'Duck and Cover.'"},{"comment_id":"787010171427640","commenter_b":"so much for tolerance","commenter_a":"I'd of accepted her resignation effective right then!","post_message":"Citing 'separation of church and state,' the councilwoman resigned.  What she did almost immediately afterwards is raising eyebrows."},{"comment_id":"10152713958671051","commenter_b":"Note, Date women closer to your age.","commenter_a":"Be careful in what you want!","post_message":"A 69-year-old man thought he and his 17-year-old girlfriend had something truly special. You can probably guess how this story ends."},{"comment_id":"10154280732936336","commenter_b":"Agree100%","commenter_a":"How is this discriminatory? Use the bathroom according to your plumbing not your frame of mind. What about the civil rights of those who don't want to share the restroom with those of another gender? If a transgender earns money they pay taxes according to their earning not what they think they should pay. I'm really tired of a few people re-writing the moral and cultural standards for the nation.","post_message":"'I’ll make a decision in 24 hours.'"}]
