[{"comment_id":"10153208171456167","commenter_b":"A Ass is a Ass .","commenter_a":"We should promote his show on our facebook....","post_message":"Warning: These are some truly disturbing and vile remarks."},{"comment_id":"1154585737915740","commenter_b":"She wasn't going anything wrong. Shame on these liars!!!!!!!","commenter_a":"No class . Needs to move to Detroit where she belongs .Lol Trump for president","post_message":"What Michelle Obama Was Caught Doing At Nancy Reagan's Funeral Will Make You SICK The Obama's have absolutely no respect. Do you think she is the worst first lady ever?"},{"comment_id":"1008748529146158","commenter_b":"And you are a pussy","commenter_a":"Your not a hunter if your using a gun, your a murderer.","post_message":":("},{"comment_id":"1026349820770159","commenter_b":"@username holy shit","commenter_a":"Ashton Thalia Buzash Kaitlyn Mckinnon Heba Syed @username Joshua Miller Quinton Chaz I apologize for the weirdness of this but it's also kind of interesting","post_message":"WARNING: Graphic Content"},{"comment_id":"10153319908498352","commenter_b":"And we know she sell pussy how??","commenter_a":"So she's gonna stop posting pics of her kid!?? How about stop posting pics of your ass.... Bash is better off with his daddy","post_message":"Amber Rose Responds To Wiz Khalifa Saying She Has A Dirty House & Baby Bash Birthday Issues"},{"comment_id":"10153183400371336","commenter_b":"The 3% are not in love with the wealthy. We are in love with the constitution of this land. The wealthy like Gates want to enslave the world, how does that fit into the constitution? It don't. Lets bring the USA BACK TO HER ROOTS","commenter_a":"Your govt at work folks. Remember when you vote don't vote because of the party line vote because of principles. This country needs a wake up call really bad. We need a revolution badly in America but the problem is the Americans are too scared to do anything.","post_message":"The report asserted that “spending decisions entirely under the IRS's control led to 16 million fewer taxpayers receiving IRS assistance this filing season.”"},{"comment_id":"1761144924140317","commenter_b":"If Mexico wont pay for wall, lets put our own electric fence 2 miles from the border then put our violent offender prisoners behind it ! In tents. With no back wall.","commenter_a":"Please vote for trump!!!!!!!!!!!!!","post_message":"Truth."}]
