[{"comment_id":"932499113450014","commenter_b":"That chick in your photo is dating a dick btw.","commenter_a":"Fuck him for treating that person like that. Scumbag.","post_message":"Fuck this guy."},{"comment_id":"10153415013561509","commenter_b":"Absolutely!! Old lady's got a warrant in Egypt . she's going nowhere that's why she hides out. Please run with her.","commenter_a":"Scott Walker 2016!!","post_message":"Virtually every potential Republican candidate will make their case to conservatives this week at #CPAC2015. Learn more about it in CNN's latest edition on #Snapchat. @webpagelink #CNNSnapchat #CPAC"},{"comment_id":"890231291031876","commenter_b":"Why would you slap immigrants in the face by rewarding those that broke the law?","commenter_a":"There are a lot of academic papers (i.e. data by experts and not angry, ignorant people on Facebook) that shows that 1) undocumented residents have a MUCH smaller drain on tax dollars relative to what they contribute than what the media hypes up (generating fear is a lot faster/easier/profitable than actually knowing the facts), 2) that immigrants rank high on civic service, 3) that immigrants rank high on starting new businesses ventures, 4) that the U.S. Immigrantion system shows indicators of being purposefully designed to have an undocumented work force for which the govt. can reap benefits without paying the full bundle of rights, etc.","post_message":"We must sign comprehensive immigration reform into law to bring over 11 million undocumented workers out of the shadows. We cannot continue to run an economy where millions are made so vulnerable because of their undocumented status. @webpagelink"},{"comment_id":"10154784324202577","commenter_b":"First Amendment, Bitch!","commenter_a":"nothings going to change you yanks have been played for fools","post_message":"If Donald Trump truly wants to drain the swamp in Washington he must make an example out of this evil corrupt family and send a clear message that he is here to bring about real change."},{"comment_id":"10154066489172994","commenter_b":"Can I suggest a clip?","commenter_a":"Beyond a reasonable doubt. They have him , his gun, and a half dozen witnesses; he even pleaded the 5th. go figure. He wouldn't even get a chance to pray with me. One BULLET to his head, ok , 2 , just to make sure.","post_message":"Body found in a burned-out house in Detroit confirmed to be the mother of the missing 4-year-old girl -- the subject of the Amber Alert sent out this weekend. Police said the injuries were so severe to the second body thought to belong to the daughter that a positive ID could not yet be made. @webpagelink"},{"comment_id":"10152960138411051","commenter_b":"Good woman","commenter_a":"I would do that too. He deserved to be punished for that horrible incident. Great mom.","post_message":"As soon as this teen's mother saw the pictures that were being circulated, she immediately grabbed him and dragged him to the police station."},{"comment_id":"963821730369705","commenter_b":"we need Ben Carson to give us hope.","commenter_a":"Liberals did it.","post_message":"MIT professor and noted left-wing academic Noam Chomsky attributes Donald Trump’s wild popularity to “fear, and the breakdown of society during the neoliberal period.”"}]
