[{"comment_id":"1174568802605235","commenter_b":"They are not Isis,just Philly scumbags ,perpetrating a fraud. shoot them violent criminals have no place on our planet","commenter_a":"We are at war people. It's gonna be us or them, I'm stocking up, bigtime.","post_message":"In Philly,  this group of MUSLIM thugs ATTACK patrons and yell \"We Belong To ISIS\"  Obama has imported over 1 million muslims since he became president... 'FUNDAMENTALLY TRANSFORMING AMERICA!'  Let's GET 5000 SHARES if we should BAN Muslim Immigration!"},{"comment_id":"10153739265778984","commenter_b":"No need to wonder what you are, being from Liberfornia and all.","commenter_a":"I 100% support her staying in jail until she agrees to do her job as ordered by a federal judge.","post_message":"For Kim Davis, this is Day 5 of her incarceration - but her lawyers just made an announcement that could turn things around.  Do you support Kim Davis?"},{"comment_id":"1704424399796624","commenter_b":"Just shows how retarded womens issues are. realsexism.com","commenter_a":"We're all getting a little over-sensitive about these non-issues, no? Politicians need to smile for likability. Likability is crucial in a candidate. It's why a sweating Nixon went down to JFK. It's why the trope of \"kissing babies\" became a thing for politicians of any level. When I think of male pols who didn't smile, they didn't do so hot. Your Bob Doles, your Ralph Naders, your Jim Webbs. All pols need to be likable, and I can remember accounts of the \"dourness\" of the above males mentioned in the news, but when it's mentioned about a woman, it's not okay? She's running for President, this is fair commentary.","post_message":"Were other (male) candidates called out the same way?"},{"comment_id":"783181045136903","commenter_b":"Because jerusalem is Israel. This fact will not change no matter what this president says.","commenter_a":"Why we should consult Israel? What you guys think you are? How many Palestinians have been killed in the holly land since creation of Israel? You got a country out of nothing and there is nobody who could satisfy you people.","post_message":"In new book, former ambassador and now Knesset legislator describes his impressions from when he was Israel's envoy in Washington between 2009-2013."},{"comment_id":"495708673953046","commenter_b":"A Bullet to the head! No need to play nurse maid to this POS!","commenter_a":"shitbum","post_message":"This thug thought he was tough, not so tough now.   Good, he got exactly what he deserved. He is scum.  Do you agree all thugs should be deported?"},{"comment_id":"510533845803862","commenter_b":"Leave you camel humpers","commenter_a":"get OUT","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"},{"comment_id":"1025596987461312","commenter_b":"Sure, blame the illegals. What do you Morons know?","commenter_a":"Kristen Kirschner","post_message":"Let's take a moment to remember that measles was ERADICATED from the USA in 2000. Nice job, anti-vaxxers."}]
