[{"comment_id":"1186141524764191","commenter_b":"That is right they would have convicted her already .","commenter_a":"IF there was anything to charge Hillary Clinton for related to Benghazi or her emails, (or anything else Fox Entertainment lies about) then wouldn't you think, after a decade of trying to convict her of something, the Republicans would have done it by now. There is NO basis to convict her of any wrong doing. The Republicans have lied about her for years and I'm sure they will continue. In the meantime I won't vote for anyone as repulsive as Donald Trump. He will, in my opinion, destroy this Country and our reputation around the World.","post_message":"How does this make ANY sense? From CNN: \"Donald Trump may say he's concerned about the little guy, but his tax plan would give the wealthy far bigger breaks than the middle class or working Americans. The Top 1% would see a whopping $275,250 reduction in their federal tax bill, or 17.5% of their after-tax income.\""},{"comment_id":"10155445943810725","commenter_b":"Sadly though it still happened :(","commenter_a":"Everyone who leaves their child with anyone should have a nanny cam.","post_message":"Nanny cam video reveals horrific new details on how a babysitter tortured a 3-year-old girl (Warning: Disturbing content)-----> @webpagelink"},{"comment_id":"934017173381331","commenter_b":"You keep having your exercise interrupted by having to go pee. There I said it","commenter_a":"Duh, coffee is a powerful drug, of course things feel better when yer buzzed","post_message":""},{"comment_id":"10152984478206130","commenter_b":"That woman looks so pissed in every photo I have seen of her lol","commenter_a":"There is no \"key\" to living a longer than average life span. It's all about good genetics and being healthy","post_message":"“I feel good. I don’t feel sick. I’m still trying to do the right thing is all.”"},{"comment_id":"10154465806735530","commenter_b":"NO! Please God, NO!!!!! Don't come here!","commenter_a":"These comments certainly prove how classy and educated Trump supporters are, lol.","post_message":"Hillary Clinton will be in metro Detroit next week. @webpagelink"},{"comment_id":"466299333581093","commenter_b":"You sound like a true liberal","commenter_a":"Philip Sjostrom","post_message":""},{"comment_id":"1006229472770134","commenter_b":"You seem a lovely Christian...","commenter_a":"Scum bag,evil,man!! He's a Muslim running America,funding ISIS","post_message":"'Welcome home, Mr President'"}]
