[{"comment_id":"10152555972045667","commenter_b":"They will make some inmate a great bride.","commenter_a":"Despicable fools.","post_message":"Former Vanderbilt University football players Brandon Vandenburg and Cory Batey were found guilty on all counts for the 2013 campus rape of an unconscious woman."},{"comment_id":"1712583705672199","commenter_b":"What happens when fish over populate and end up eating up their whole ecosystem..","commenter_a":"They're fucking fish were at the top of the food chain","post_message":"If you know anyone who still goes fishing, show them this."},{"comment_id":"1747479275473588","commenter_b":"Fawwwwwk no cuz that proves a bih can't cook fr😩😩😂😂😂","commenter_a":"@username some shit you'd do😂😂😂","post_message":""},{"comment_id":"1049317721755905","commenter_b":"full retard mode: engaged","commenter_a":"This is the evidence of existence of Allah !!!","post_message":"Our brains are truly amazing.  By Emily's Quotes, via AsapSCIENCE."},{"comment_id":"10154170271666337","commenter_b":"Umm I'm no Chris brown fan but I never heard of this chick till earlier this week. Last time I checked Chris had what people would call a very successful career and continues to make and sell records. Although I do feel for her... Life should never come to a point you need to attempt to end it.","commenter_a":"Um yes Chris Brown (nobody, singer ,wash up, hasbeen dumbass) there is a thing as attempted suicide....someone who did it and survived has ...guesss what \"ATTEMPTED TO KILL THEMSELVES\" you fucking ignorant talentless piece of shit","post_message":"Now Chris Brown has joined the ugly Kyrie Irving-Kehlani-PARTYNEXTDOOR situation..."},{"comment_id":"10153090581796749","commenter_b":"Go fack your mam","commenter_a":"Fack you","post_message":"This is no longer a problem to leave for the next generation to fix. We have to act now."},{"comment_id":"10154475090187098","commenter_b":"Let's nuke 'em now !","commenter_a":"Can we drop some nukes on them already? What's taking so long?","post_message":"MISSILE TEST: North Korea reportedly fired a ballistic missile in what would be its first such test of the year and an implicit challenge to President Donald Trump new administration."}]
