[{"comment_id":"1390535574339520","commenter_b":"Horrible creatures","commenter_a":"'@username this is why you don't panic","post_message":"The bird was trying to steal her ice cream"},{"comment_id":"1231532310220572","commenter_b":"And male or not, you're a cunt","commenter_a":"The dirtbag can pick anyone he wants, Congress has no obligation to endorse the fascist's choice. Speaking of the Constitution. GOP won't be re-elected if they pass any nominee appointed by Ovomit.","post_message":"BOOM!"},{"comment_id":"1362693153771141","commenter_b":"Voting is a great right to have in the United States. It is so sacred that military veterans have put their lives on the line to make sure that we still have this right in the country. People take voting very seriously. It’s one of the essential parts of a democracy. Therefore when it comes out that people are messing with the people’s right to vote, it should be considered a big deal. And that is exactly what is happening in this country. The Democrats have been trying to fix the elections that have been going on in this country. They are doing this to make sure that they remain in power in the White House. Voter fraud has become so rampant that Fox News had a guest come on and say that there are at least four million dead people on U.S. voter rolls. Democrats and Bad Ideas go ...","commenter_a":"The best part from Donald Trump ' if u are for women supporting women's rights why are u taking money from countries that support ISIS and not treat women well, u should give all the millions back to them ' well said Donald Trump🇺🇸🇺🇸👍🏼🇺🇸","post_message":"In less than three weeks, we will elect a president—and only one candidate tonight showed she has what it takes. Will you be able to say you did all you could when it counted? Chip in now: hrc.io/2eiZtIy"},{"comment_id":"10153237283580329","commenter_b":"Kurt Russell","commenter_a":"Jared padalecki from supernaturals","post_message":"Keanu Reeves or Arnold Schwarzenegger?"},{"comment_id":"1508345139225610","commenter_b":"His wife has his balls..","commenter_a":"SEE THIS IS THE SHIT THAT HAPPENS WHEN WE APPEASE TERRORIST SUPPORTING NATIONS JUST LIKE JMMA(THE PEANUT BRAIN) CARTER AND BILL(I DID NOT HAVE SEXUAL RELATIONS WITH THAT WOMEN) CLINTOOOON DID,, NOW OBAMA IS DOIN SAME THING BUT THIS TIME HE HAS LET THEM GO NUKE,,,THEY PLAY WITH US BECUAS ETHEY KNOW OBAMA DOESNT HAVE THE BALLS TO DO ANYTHING SAD","post_message":"JUST IN:"},{"comment_id":"10153526773721350","commenter_b":"Those hips are MALE hips!","commenter_a":"She look so stunning & beautiful tonight","post_message":"Caitlyn Jenner shared some very powerful words from the podium."},{"comment_id":"10154269776132619","commenter_b":"What is ISRAEL SUPPOSED TO DO?????????? let the rest of the world walk all over them????? I don't think so..... If a lot more countries in the world were like ISRAEL the world would be a better place....","commenter_a":"Let's black list the UN. It needs to go. Thugs in suits.","post_message":"A push is currently being made in the United Nations to have the Israeli Defense Forces added to the blacklist of the council for Children and Armed Conflict."}]
