[{"comment_id":"10154026339057464","commenter_b":"Wisconsin people must have cheese for brains! How else can you explain why they are listening to Mitt and the Republican party supporting Cruz.! With Cruz you'll get another Bush style government paying higher taxes and less jobs! Only Trump has a solution to bring jobs back to America!","commenter_a":"I want the media to go after Cruz like they have gone after Trump. They are so biased and they make me sick. Media, please ask Ted this question: Have you been unfaithful to your wife? AND don't stop asking him until he answers that simple question!","post_message":"It's not too late to enter to win tickets to the championship game in Houston --> @webpagelink"},{"comment_id":"10153962484766680","commenter_b":"Hillary Clinton: All I do is win win win no matter what =)","commenter_a":"And it tells you that the election is not rigged and in fact anyone believes what comes out of Trump's mouth which just showed to not have any credibility","post_message":"Donald J. Trump celebrated a new poll that shows him leading by a single percentage point."},{"comment_id":"10153987186985329","commenter_b":"Fuck off bitch","commenter_a":"Dorotea Lazio Batistoni I'm ded","post_message":"It's finally happened."},{"comment_id":"10153167789731336","commenter_b":"Wow only they can attack ppl...what happens to them a slap on the hand!!! When does all this stop? The violence is out of control.. I no if they would of attack my husband an I was in my car..probably would of ran them over or use the gun to scare them off.... Sad that no one helped!!!!","commenter_a":"This is why you carry. Been a few dead teens if it had been me.","post_message":"Caught on camera: A man was viciously attacked in broad daylight by a mob of teenagers while helping an elderly woman at a gas station."},{"comment_id":"10152797801290671","commenter_b":"You should leave this planet! Your unreal.","commenter_a":"Looks like she's the one on the control on causing a riot","post_message":"Have you seen this video? A woman in Baltimore was caught on tape hitting a young man, believed to be her son, after catching him participating in the riots. About the incident, Baltimore's police chief said: \"...I wish I had more parents [like her] that took charge of their kids out there tonight.\""},{"comment_id":"10154975862774062","commenter_b":"That woman just wouldn't stop she makes the situation worse and keeps it going she brings it on herself if I were that man I would hit her too","commenter_a":"Men shouldn't punch animals like that. Poor cow..","post_message":"The confrontation quickly turned into a brawl."},{"comment_id":"10154602767897619","commenter_b":"We are with you Isreal, kill the muslim trash and leave them in the desert","commenter_a":"i do pray for Jerusalem !","post_message":"We <3 Israel. -VirtualJerusalem.com"}]
