[{"comment_id":"422053507998163","commenter_b":"After entering into discussions with egocentrics on Abortion, I have concluded the following: 1) Egocentrics callous their minds by clinging to the term fetus. 2) Egocentrics ignore the dictionary primary definition of child, \"1a :an unborn or recently born person\". 3) Egocentrics refuse to acknowledge a child exists until it breaths air. 4) Egocentrics ignore that sexual consent includes consent for sperm and egg to join thereby forming a new human being in the uterus. 5) Egocentrics dehumanize the new human being (child) by hammering the label \"fetus\", completely ignoring the relativity of \" the fetal stage\" development of a child. President Barack Obama told a group that harvesting organs from humans that are killed was and a tradition that needed to stop. He warned of dehumanizing marginal groups of humans and of the problems that arise when are not able to see someone else as a human being.\" Based ...","commenter_a":"No I don't think so","post_message":"Planned Parenthood and the 3% Abortion Myth"},{"comment_id":"2045292995569416","commenter_b":"Oh shes another one who lied.","commenter_a":"Liar liar pants on fire!","post_message":""},{"comment_id":"572733119579689","commenter_b":"Yeah you gotta be a useless bitch to waste time on Amazon digging these shit custom up for a fucking baby.. NO NOT ME","commenter_a":"@username gotta do this to the baby 😂😂","post_message":"I just grew ovaries and they just exploded."},{"comment_id":"945417468827008","commenter_b":"Whomever is behind this un-American idea, should be investigated for insanity and on legal terms. The people (or group) seem not to have any interest in America. Has Obama contaminated this too?","commenter_a":"This maybe a big mistake, he is the only one who is not under control of big labor groups and unions, plus I feel the American people are tried of the same old crap, time for a big change.","post_message":"NOOOOOOOO!!!!"},{"comment_id":"10153854800096955","commenter_b":"@username loooooooool u stupid Americans are cute. Have fun finding water in 5 years 😜","commenter_a":"You should have to have a comprehensive background check before anyone can just buy a knife and close the knife show loop hole . Problem solved !","post_message":"NYC Residents On Edge After 3 Slashing Attacks In Less Than 48 Hours..."},{"comment_id":"1723416237718117","commenter_b":"In my book, Angela Merkel will go down as one of the greatest people to have walked the earth. She opened the door for strangers when everyone else closed theirs. There were far worse atrocities happening in Germany and Europe before the arrival of immigrants. Xenophobes that previously had no excuse for their hate are happy to see their own people killed by minority terrorists just to justify their hatred for the rest of humanity.","commenter_a":"Merkel should be tried for treason. She is directly responsible for all of the sexual assaults and murders that have taken place!","post_message":"You can ban the burka, Frau Merkel. But what are you going to do about banning the migrant boats YOU encouraged to come and which are destroying your country?"},{"comment_id":"837370303025890","commenter_b":"Your just another Dumb Female","commenter_a":"Slick willy fits him better","post_message":"Just call him Adam."}]
