[{"comment_id":"1086229651436699","commenter_b":"I bet the real problem some have is that Black females got into West point, never mind graduate from there.","commenter_a":"When you lower the entrance standards to one of the world's greatest Military Academy, this is what you get...","post_message":"The image has spurred questions about whether the gesture violates military restrictions on political activity."},{"comment_id":"557140984486841","commenter_b":".....Hypocrite HILLARY SAYS DONALD DOES NO RESPECT ALL AMERICAN AS SHE HAS NO RESPECT FOR AMERICA OR AMERICANS ONLY GLOBALISM....HILLARY HAS LOST HER WAY SHE HAS FORGOTTEN THIS IS OUR HOME 'AMERICA'. WE WANT TO KEEP OUR FAMILY SAFE!, WHILE HILLARY JUST WANTS TO APPEASE THE ILLEGALS ..","commenter_a":"#NeverEverHILLARY PERIOD!! #BILLANDHILLARYCAREERLIARS","post_message":"Hillary Clinton’s actions constitute all of the elements of a major criminal enterprise - she created a private illegal email server in order to hide her corrupt dealings. She did so knowing full well it would put American lives at risk by making classified information highly vulnerable to foreign hacking. But, she didn’t care – as long as it helped her get away with her crime, no risk to America was too great.  Then, to further cover-up her crime, she deleted 33,000 emails to keep them out of the hands of authorities and the American public.  As a further element of the criminal cover-up, she claimed under penalty of perjury that she turned over all of her work related emails. We now know this to be one more massive Clinton lie. The FBI found thousands of work-related emails she failed to turn over, including the new discovery this week of 15,000 more work-related emails she failed to disclose.  What is being uncovered now is one of the most shocking scandals in American political history."},{"comment_id":"1096195137073807","commenter_b":"Why are democratic women so scary looking? See what lies do to your face?","commenter_a":"Obama praising himself Hillary looks like she needs to go to the restroom while being admired","post_message":"A note for 2016: the Democrats are the party that abandoned #Israel, enabled the rise of #ISIS and is now helping #Iran to get a nuclear bomb."},{"comment_id":"510973722424254","commenter_b":"Let's elect him and the boos will disappear, right along with all those illegals that are making the noise.","commenter_a":"Don't join conservative Tribune news bad to read","post_message":"Donald Trump handles this opposition like a CHAMP!!!"},{"comment_id":"10153541363403908","commenter_b":"Ass holes and sexism lol I understand!","commenter_a":"Kendrick- a small reference for the man haters in your life? Idk","post_message":"earlier this year, women were using the hashtag #WomenAgainstFeminism in order to set the record straight about their views on feminism. Here's a powerful response  for the \"not a feminist\" movement. What are your thoughts on this?"},{"comment_id":"882724591787290","commenter_b":"Battered but still a warrior, great courage.","commenter_a":"This kid needed a gun and a CCL. So as to defend himself!....oh wait he lives in Newtongrange, Midlothian. Is that in....the UK? They not allowed to defend themselves with lethal force, from Thugs! Thanks to people that think like Piers Morgan.","post_message":"Left for dead with a battered face and multiple fractures by man he stopped to help"},{"comment_id":"1065131623520589","commenter_b":"R.I.P.","commenter_a":"Awwww, RIP, Al","post_message":"RIP Al from Happy Days. He passed away on Friday at age 96."}]
