[{"comment_id":"10154180246323984","commenter_b":"Ha ha bitch you lost .........","commenter_a":"This is why they Hate Donald Trump, He is upsetting the SCheme they have in PLACE! @webpagelink","post_message":"Many are predicting that Marco Rubio is going to lose his home state of Florida in tonight's primary. Rubio has a plan if that is the case, and it's going to surprise a lot of people.  Is it over for Rubio if he loses Florida?"},{"comment_id":"10153134733596037","commenter_b":"A lot of women where I live buy as much jewelry. I don't think its extraordinary.","commenter_a":"As with Obama, the focus on a first lady is just a witch hunt. Jeb has enough of his own baggage to drag around.","post_message":"#JebBush's wife #ColumbaBush joins a long list of political spouses with a taste for extravagance. Yahoo News' Dylan Stableford reports."},{"comment_id":"10155402759240354","commenter_b":"A bunch of trouble making bitches trying to talk over one another","commenter_a":"Irrelevant opinions from an irrelevant long in the tooth washup","post_message":"**sigh**  WATCH the insanity for yourself."},{"comment_id":"884868911589338","commenter_b":"More like the Supreme Joke of the United States, where the highest bidder wins the votes. They should just remove the robes and wear clown outfits.","commenter_a":"Franklin Graham The Supreme Court of the United States has ruled today that same-sex marriage is legal in all 50 states. With all due respect to the court, it did not define marriage, and therefore is not entitled to re-define it. Long before our government came into existence, marriage was created by the One who created man and womanAlmighty Godand His decisions are not subject to review or revision by any manmade court. God is clear about the definition of marriage in His Holy Word: a man shall leave his father and his mother and hold fast to his wife, and they shall become one flesh (Genesis 2:24). I pray God will spare America from His judgment, though, by our actions as a nation, we give Him less and less reason to do so.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10152871964481491","commenter_b":"Says the woman whose profile pic looks as if she is in drag!!!! You should never talk about anyone's looks!!!","commenter_a":"Quit posting this, she isn't even a woman, so stop it","post_message":"“You’re too young for a 51-year-old!”"},{"comment_id":"1328806503882265","commenter_b":"I bet most of these women pretending trump troubles them are the same willing to kill an unborn child at 13 weeks","commenter_a":"The whole family should crawl back in that BLACK WHOLE THEY CAME FROM..","post_message":"Donald J. Trump's son defended his father's comments caught on tape, saying other men make similar remarks."},{"comment_id":"1012656692115433","commenter_b":"Is it a female? Lord have mercy she's dog ugly","commenter_a":"Racist woman","post_message":"Apparently Whoopi doesn't care if the DNC rigged the system.  Why? Because it's against a white guy. #DNC2016"}]
