[{"comment_id":"10153227262005667","commenter_b":"@username where do you live? Come on your pry think we don't need crude oil any more either.","commenter_a":"If you think it's cute I will snare one and let you try to pet it. They are vermin and need to be killed or they will take over. Now they just eat your pets, if the numbers get out of control they will come after humans.","post_message":"The animal was spotted entering the baggage claim area and then ran across the ticket check-in area and toward the TSA checkpoint."},{"comment_id":"10150971534884999","commenter_b":"The thrust for stories to prove a Trump presidency will embolden bigots is so great right now, people are faking hate crimes.","commenter_a":"\"RISE IN HATE CRIMES\" -If 'Murican media is anything like Toronto's , they are rigorously hunting down stories that fit the appropriate narrative of the day.","post_message":"Kids are at risk of getting the message that racism and harassment are OK, Emily Bazelon writes in The New York Times Opinion Section."},{"comment_id":"1642472956011827","commenter_b":"Hillary Clinton is against Christ and she is for anything illegal immigrants bring her money. .","commenter_a":"What would you have us call them, Hillary? They are in our country illegal,,,duh.","post_message":"Hillary Clinton says the term \"illegal immigrant\" is offensive and shouldn't be used. Is she right, or is this political correctness gone too far?"},{"comment_id":"10154502973076756","commenter_b":"@username do u recognize this woman in the pic? She's a Bay Area demonstration machine! I want to BE her!","commenter_a":"Wow.","post_message":"\"[W]e lack confidence that Judge Persky can fairly participate in this upcoming hearing in which a male nurse sexually assaulted an anesthetized female patient.\" -- Santa Clara District Attorney Jeff Rosen"},{"comment_id":"1005938356108252","commenter_b":"She looks like a evil witch","commenter_a":"She is \"special\" she doesn't not have to follow the law.","post_message":"GO TO PRISON!"},{"comment_id":"10154992608754723","commenter_b":"Enter with a Visa is legal so what exactly are you talking about. This woman held in JFK work for US ARMY for 10 years in Iraq and this is how she gets paid.","commenter_a":"Cut this out, you want to come to America come in legally like my parents and siblings did. Be willing to work hard and respect American vslues","post_message":"Protesters gather at JFK airport to fight the refugee ban and detainment of refugees."},{"comment_id":"10153168410293690","commenter_b":"In ind had been an individual liber,on account of each mob should be admit each religion.its actual substance,besides already has recognized via Basic R8s","commenter_a":"Its expected from modi sarkar, as he has the record of massacaring muslims in Gujrat..","post_message":"Are India minorities under attack? Christians and Muslims say the government is not doing enough to protect them from hardline Hindus. But is prime minister Narendra Modi being compromised by his nationalist roots? @webpagelink"}]
