[{"comment_id":"10152713958671051","commenter_b":"Note, Date women closer to your age.","commenter_a":"Be careful in what you want!","post_message":"A 69-year-old man thought he and his 17-year-old girlfriend had something truly special. You can probably guess how this story ends."},{"comment_id":"10154172313547690","commenter_b":"Like the boy didn't have enough problems then get a nasty nanny!","commenter_a":"Put me in the room with there for about 30 minutes let me drive her around and a little more","post_message":"This nanny is facing charges after allegedly abusing a 4-year-old-boy with special needs.  Luke has Down syndrome, heart defects and epilepsy. Once his mother noticed a change in Luke behavior, she decided to get a nanny cam. This is what she discovered. #NBC5Now More: @webpagelink"},{"comment_id":"1137064162981260","commenter_b":"Mold on the apple","commenter_a":"Grrrrrreat. *head desk*","post_message":"A huge new study has confirmed that we are in the middle of an extinction event, the likes of which hasn't been seen since the dinosaurs went extinct."},{"comment_id":"763776567072060","commenter_b":"F**k em both... Let's \"take em out\" ....","commenter_a":"Anyone who couldn't see this before is blind. Those two have always been allies.","post_message":""},{"comment_id":"498132093702004","commenter_b":"Simone de Beauvoir said women were their own worst enemies.","commenter_a":"Callous treatment of human life?? Funny coming from a woman who tried with all her power to block her own residents from receiving healthcare under ObamaCare!!","post_message":"Not cool Gov. Haley!"},{"comment_id":"10154743598641323","commenter_b":"Yep. Greedy bastards.","commenter_a":"Ladies and gentleman. I present to you - Capitalism at its finest......","post_message":"Michelin-starred TV chef Michel Roux Jr. has been paying some kitchen staff at his Mayfair restaurant less than the minimum wage, the Guardian can reveal, while charging over £60 for one starter."},{"comment_id":"1283300368381949","commenter_b":"Sonny Omelis hmm what do you think?","commenter_a":"Jaouad Jijeli","post_message":"...leaving Paris and New York in its wake!!!"}]
