[{"comment_id":"1793816267524585","commenter_b":"Amy you should be ashamed for trying to get people to vote for that criminal!!! The things she's going to do to our country aren't going to effect you because you have money !!!","commenter_a":"I'd be much more concerned if I voted for someone who was indited and convicted of high crimes against the United States and humanity!","post_message":"\"Your voting history is public record.\""},{"comment_id":"10154503562599138","commenter_b":"Dawn breaking over Lake Pepin Lake City, MN 6/9/16","commenter_a":"Watching the sunrise everyday on my way to work","post_message":"It's a call for pictures showing what you love about Minnesota. Show us animals, people and moments that show off what's so great about our state and we'll feature some on the Fox 9 morning news!"},{"comment_id":"1049313658417628","commenter_b":"Too true!","commenter_a":"I see an IRS audit in staples future. ...","post_message":"Staples announces that because of Obamacare they're having to make some changes in the structure of their employees, and Obama does not like it and he takes out after them. \"Obama Slams Staples for Reducing Hours to Avoid Obamacare,\" and Staples responded."},{"comment_id":"10153677449116336","commenter_b":"Have you ever noticed it's always pretty women getting killed? Eat more cheeseburgers.","commenter_a":"Yolanda Mejia","post_message":"A body found on a rural property in northwest Spain is most likely that of Denise Thiem, an American woman who went missing while walking along a pilgrimage route, Spanish officials said."},{"comment_id":"10152978013416615","commenter_b":"She's an evil monster.","commenter_a":"no way she a good mother she killed the boys and watched them die sje isn't a mother she is a monster","post_message":"After all this time, Susan Smith decides to talk about what happened the day she drove into a lake and killed her own sons."},{"comment_id":"1253710404722011","commenter_b":"@username you nailed it","commenter_a":"Actually, it's bullying - in his case, you know he would be doing just the same to a male competitor. I believe sexism is a river that runs through him, but I see a ogre of a bully when I see him...","post_message":"TRUTH. Thanks to Hostile Politics."},{"comment_id":"1167588859974389","commenter_b":"Bo Go Back To Fucking Your Sistermommy","commenter_a":"Isn't that great ! I am happy to see Trump gets that endorsement. Hillary is probably sick with envy but she got an endorsement from BLM...and other terrorist groups.","post_message":"Major Endorsement from our Heroes on the Frontlines..."}]
