[{"comment_id":"806491062782835","commenter_b":"Its funny the democratic party started the Confederate nation and fought to keep slavery. Robert byrd retired in 2010 a Democrat longest serving politician in history and was active member of the klan. Imagine all yhr bills he voted on due to his racist views. Alot of the Democrats knew he was a klan member and said nothing. Pull some ones opinions off line and use them to your benefits but truth is your being lied to but 99% of politicians and the first to speak up you all attack.lol just like o malley saying all lives matter and Democrats attacked him for that. Yet alone he is democrat himself. Get it through your heads we are done with the hypocrits and lies and political correctness","commenter_a":"Can someone please explain to me who they are polling to get Trump in the lead?","post_message":"And yes, it's really his number."},{"comment_id":"1569194983095765","commenter_b":"Immigrants need to assimilate","commenter_a":"I feel sorry for this woman, she is so ignorant. The capability of her brain being able to handle one language and one culture is probably the siza if a pea.","post_message":"A woman captured on video yelling racial slurs at a Spanish-speaking woman as they waited in line at a JCPenney store will be \"permanently banned\" from the mall where the incident took place once she is identified, Jefferson Mall officials say."},{"comment_id":"1001474073269501","commenter_b":"Muslims consist of .9% of our population. Bigotry around 20%","commenter_a":"I disapprove! He has caused nothing but destruction! The flooding of illegals and Muslims! They are murdering innocent Americans! Obama just sits back and enjoys the show. He lies about his crimes like Hillary does. I'll enjoy the show when Trump is president and arrests your ass!","post_message":"Do you approve or disapprove of the job President Obama is doing in office?"},{"comment_id":"10153690611426756","commenter_b":"The woman is the patient.","commenter_a":"It's interesting the idea that the woman is the \"patient\" so her health is all that matters. I've always pictured prenatal care as for both the mom and baby together.","post_message":"Over the years, residents have come to Janet Singer, a nurse midwife, with tricky questions about performing abortions: Where does life actually begin? How do doctors’ personal beliefs play out in their clinical care? And what’s really best for mothers? She thought the public would benefit from hearing their experiences, so she asked four residents to write about them."},{"comment_id":"10154442416273701","commenter_b":"You wouldn't likely notice a player. This woman was doing something else, I'm sure.","commenter_a":"Am I the only one that thinks it's disrespectful to be playing in a cemetery??","post_message":"Authorities in New Jersey say a woman trying to catch Pokemon in a cemetery ended up stuck in a tree and had to call 911 to rescue her."},{"comment_id":"1812875395612222","commenter_b":"@username......................your a @&$)(:; fool","commenter_a":"Such a BS! Obama made a deal to stop nuclear proliferation. Iran's compliance with our demands lifted the sanctions. So they got THEIR money. Eric Trump is total idiot thinking he knows anything about this matter.","post_message":"\"[President Obama] lied about it. He said that it wasn't ransom money... No different than when he lied about ObamaCare.\" Yesterday on \"Sunday Morning Futures,\" Eric Trump accused President Obama and Hillary Clinton of lying to the American people."},{"comment_id":"10152784678501130","commenter_b":"I read a quote from a woman somewhere who said \"When I had kids, I saved up my sick and vacation days.\" She thought this was a major accomplishment. So she took time away from her family and herself (vacation days) and exposed her colleagues when sick. How smart is that. Bootstrap childbearing.","commenter_a":"About time, but still not enough. Germany vives a year.","post_message":"\"[W]e can't say we stand for family values when so many women in this country have to jeopardize their financial security just to take a few weeks off of work after giving birth.\""}]
