[{"comment_id":"507498396098707","commenter_b":"You guys are all nuts if you think Hillary will make a good president! She is a lier, cheat, she would bring this country down the tubes. She is insane, she is a felony and belongs in jail. If anyone else did what she did they would be in jail for life. Wake up democrats I'm sure there is someone else out there, who can do a much better job! Just because you guys want a woman in the White House she is definitely the wrong choice!","commenter_a":"She's a chameleon who will do anything for power, prestige and to keep her ego stoked.","post_message":"No one does politics as good as a Clinton."},{"comment_id":"10154037628650672","commenter_b":"Even the illegal/undocumented immigrants are human beings. Everyone deserves a chance at safety.","commenter_a":"This doesn't effect law abiding citizens!!! Immigrants are safe!!! People who are here illegally are the problem!","post_message":"Mayor Bill de Blasio is addressing the media in the wake of President Donald Trump's executive order to strip federal funding for so-called sanctuary cities."},{"comment_id":"10153085748364312","commenter_b":"So it's appropriate for the race card to be thrown here?? Wow","commenter_a":"I bet they don't get gunned down! BC \"white lives matter\"","post_message":"Two teenagers from Kentucky who vanished nearly two weeks ago are suspected in a multi-state crime spree."},{"comment_id":"1391521917576588","commenter_b":"She is one ugly ape!","commenter_a":"Where is the FBI? Where is homeland security? These idiots are threatening the president of the United States.","post_message":"Nasty Liberal Journalist Asks Why Trump Assassination Is Taking So Long INSTANTLY Blows Up In Her FACE!"},{"comment_id":"1050293421764665","commenter_b":"Good thing? To leave 20 million with no health care? Who are you? Scrooge? Let the excess population die? WWJD. I will not battle here.","commenter_a":"I am a constituent of yours. Let me tell you how hard I am going to work to make sure you are never re-elected! How dare you dismantle the ACA in the late night sessions. How dare you de fund the UN!","post_message":"This was John Kerry and President Obama taking a slap at Israel. I think most Americans believe that the United Nations has become more anti-Semitic, more anti-Israeli. We're going to stop the US money to the UN until we get this fixed."},{"comment_id":"10153263072806323","commenter_b":"People are so ignorant. They get off on body shaming others. They act like a strangers physical appearence directly affects them... If it does, then how pathetic are they?","commenter_a":"Whilst healthy living is undoubtedly a good thing, and being significantly overweight (or underweight) can be poor for one's health, making clothes that fit the diverse body shapes we have is not 'facilitating' an unhealthy lifestyle. It's simply ensuring that people of all body types and dimensions can dress in a style which they like, and in sizes which are comfortable and flattering to their shape. Besides, being overweight isn't as simple as being a 'lifestyle' - in many cases it can come from factors as diverse as metabolism, mobility issues, eating disorders or genuine dietary or medicine requirements.","post_message":"\"Saying that high-street stores shouldn’t “facilitate” certain human beings having access to clothing, in order to make them really understand how unacceptable they are as people, is pretty nasty, right?\""},{"comment_id":"10154997987663812","commenter_b":"@username Lie cheat and delete.","commenter_a":"What are the successes? Stealing millions via the ClintonFoundation? Seriously what has she done in 30 years?? Name three things, that's 1 per decade","post_message":"Hillary Clinton's message to young Americans and young girls in particular: \"Never doubt that you are valuable and powerful and deserving of every chance and opportunity in the world.\" @webpagelink #Election2016"}]
