[{"comment_id":"10157838985835725","commenter_b":"Woman here voting for Trump too #nocrookedhillary!","commenter_a":"Thank you Mr. Trump. As you know killary used the hurricane to post her commercials on the weather channel! To take advantage of storm victims to campaign, she is one Nut case, how disrespectful. So, we thank you for your concern for our safety!!","post_message":"Thoughts & prayers with the millions of people in the path of Hurricane Matthew. Look out for neighbors, and listen to your local officials."},{"comment_id":"10153918680501116","commenter_b":"Mexico take Texas, we will throw in the theocrats for free!","commenter_a":"So much for Hamilton and Madison's half baked notions about \"representative\" government. How I wish California would secede from this corrupt Union...","post_message":"But Republicans are sticking with him."},{"comment_id":"1712662805615424","commenter_b":"What a drunk bitch. What is she? Fucking 3?!","commenter_a":"Leigh Mangubat","post_message":"Guy Records His Girlfriends Meltdown"},{"comment_id":"1576593039311229","commenter_b":"Can't stand this stupid bitch!!!","commenter_a":"The stupidity abounds in liberal media and mind.","post_message":"\"Liberal logic\" -- an oxymoron with the emphasis on moron"},{"comment_id":"437802309734983","commenter_b":"Wes spoken like a true submissive little bitch. Now go stand in the corner like a good little boy","commenter_a":"Hooray! Now, remove them immediately starting with Ferguson.","post_message":"President Obama is taking a necessary, bold step."},{"comment_id":"10152930337971749","commenter_b":"Gramma Cankles will NEVER be President...","commenter_a":"Can't wait for Hilary. All the brain dead idiots heads will explode.","post_message":""},{"comment_id":"10154288676688445","commenter_b":"Ding Dong: who's there? Your local sheriff lol","commenter_a":"Throw them in the fireplace and share the lovely smell with the whole neighborhood!","post_message":"Grow Q&A: What Can I Do With The Pot Leaves I Trimmed Off?"}]
