[{"comment_id":"10154224264151500","commenter_b":"@username ur queen is pregnant","commenter_a":"Kristina Vinson twins omg","post_message":"The Carter family grows."},{"comment_id":"1772229929682875","commenter_b":"@username In defense of Donald Trump : Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not starting a race war. Trump did not leave any US soldiers in Benghazi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion ...","commenter_a":"Trump represents everything that is wrong with America. A narcissistic opportunist, a pathological liar, a clueless idiot, an unashamed con man and an unapologetic bigot!","post_message":"Imagine this man in charge of our men and women in uniform."},{"comment_id":"10154096917590329","commenter_b":"Grade 6 gym class. Ran face first into a cement wall during a game of dodgeball. I had two black eyes, one of which was swollen shut, and a nasty bump on my forehead. Our picture day was the following week. Best school picture ever!","commenter_a":"Jon Maloney you could add a story to this","post_message":"LOL"},{"comment_id":"10153130429581162","commenter_b":"If prostitution ever becomes legal, you can sign your kids up freak.","commenter_a":"Making prostitution illegal is as stupid as pot being illegal. Regulate, tax and monitor.","post_message":"NEW: NFL Hall of Fame lineman Warren Sapp arrested for allegedly hiring a prostitute after covering the Super Bowl for the NFL Network: @webpagelink"},{"comment_id":"1040367212665366","commenter_b":"Suck a dick Diane.","commenter_a":"TRUMP will close our borders to illegal people. TRUMP will rid us of common core curriculum! TRUMP will temporarily ban Muslims from entering our country.. TRUMP will build up our military to its once held position! TRUMP will dump obamacare! TRUMP will allow the 2nd amendment to stand! TRUMP will negotiate with foreign countries like a hellstorm! And will NOT back down! TRUMP will in for America! DONALD TRUMP loves America! TRUMP will get jobs... DONALD TRUMP is The ONLY CHANCE we have to stay a FREE NATION!!! That's ALL why we NEED DONALD TRUMP for PRESIDENT of these UNITED STATES of AMERICA!!!!!!!!","post_message":"Breaking...  This changes EVERYTHING!!"},{"comment_id":"985288268192005","commenter_b":"she looks like the Queen of Qualudes.","commenter_a":"Or if she is in jail","post_message":"The Democrat Party WILL NOT let Bernie Sanders be the nominee – no matter how many States he wins, how many delegates he has or an other reason.   Watch this and tell me if you agree:"},{"comment_id":"10155402759240354","commenter_b":"A bunch of trouble making bitches trying to talk over one another","commenter_a":"Irrelevant opinions from an irrelevant long in the tooth washup","post_message":"**sigh**  WATCH the insanity for yourself."}]
