[{"comment_id":"10153641389062994","commenter_b":"I still don't understand all the female supporters on here. He hates you.","commenter_a":"He did a great job!!!","post_message":"Donald J. Trump is in Birch Run and will take the stage in just moments. Watch what the GOP contender has to say about Michigan, this country, his campaign, and who knows what else."},{"comment_id":"10153150337159607","commenter_b":"He didn't live there 6 years. Stop believing everything you read, or make up in your head. Respect his family and friends right now and stop thinking this was a conspiracy","commenter_a":"Police did it he was going to expose the police for the dirty","post_message":"A Baltimore City police officer was found facedown in the water in South Baltimore Tuesday night. Officer Prashanth Davis, 34, was pronounced deceased at the scene."},{"comment_id":"10153961213080579","commenter_b":"Right wing ammosexual Xtians kill more people in this country than Muslims.","commenter_a":"obama Will NOT FIGHT HIS BROTHER MUSLIMS.. BUT He WILL Help them.","post_message":"\"France is at war.\" French President Francois Hollande to Joint Session of Parliament.  Watch complete video here: @webpagelink"},{"comment_id":"1789900814667772","commenter_b":"She needs to leave this country ....POS !!!","commenter_a":"Idiot!","post_message":"Actress and activist Ashley Judd delivered harsh words aimed at President Trump from a poem written by a 19-year-old girl from Tennessee."},{"comment_id":"10153885803644411","commenter_b":"Those UkraNazi cockroaches belong in the trash bin.","commenter_a":"Ha! The \"Trash Truck.\" lmao... Never was there a more worthy chariot for such an unworthy set of a-holes.","post_message":"It is also not certain how much protection the new tank will be able to give those operating it, as its armor is a mere 40mm thick."},{"comment_id":"1021163441238000","commenter_b":"The next deaf girl I encounter will hear me cumming","commenter_a":"Lucy Truelove","post_message":""},{"comment_id":"10154278123559497","commenter_b":"so sorry, I hate seeing girls do this to gay guys","commenter_a":"As a gay man, this was the majority of high school. Being dragged along by my female best friend. Apparently as a gay guy I was supposed to Enjoy whole foods, Bloomingdales, frozen yogurt and Mac lol. Also always being asked for advice by every girl on guy issues.","post_message":"\"You just never know where the day is going to go with Paul.\""}]
