[{"comment_id":"726800087419505","commenter_b":"@username get 'em, girl!","commenter_a":"BERNIE SANDERS AMERICAS ONLY HONEST CHOICE 2016","post_message":"Hillary Clinton campaign's \"abuela\" post sparks #NotMyAbuela hashtag."},{"comment_id":"10154717771869657","commenter_b":"Moving forward..and having some fun goes along way..Go Trump!! Trump Up!!","commenter_a":"Lol","post_message":"Whiplash."},{"comment_id":"1257959987602294","commenter_b":"You are completely ignoring many of the issues such as the inequality in wages between men and women, the dearth of equality in positions of power such as government and business, and, many other issues which have been a problem for many years. Most murders of women are by men as are rapes. Women are often expected to wear short skirts and behave in what men deem a \"feminine\" way on TV and in many businesses. An excellent example is Fox news.","commenter_a":"I think this poem/speech misses a huge issue and ignores the obvious. Humans as a whole are failing. This isn't just a man's issue. I see, daily, women tearing other women down. Calling them the same things you hear. It is a problem from all sides. We have failed to raise children with respect, love, and caring. That is the issue. To suggest it is only males is dishonest. We should accept it is a societal issue and not a male/female issue.","post_message":"She’s a “dangerous\" woman because she dares to speak her mind in an online community that openly harasses, disparages, and threatens women. Warning: contains strong language. (via Agnes Török Poetry)"},{"comment_id":"928696510523431","commenter_b":"She should think about buying a woman's breasts.","commenter_a":"This girl can actually sing. Not sure why she does these things. Pointless, & invalidates her as an artist.","post_message":"Miley Cyrus shares naked tub pic"},{"comment_id":"1725328477744790","commenter_b":"A blow job from what you call an ugly woman is still a blow job. We drank, screwed, and partied in cemeteries when I was a teenager.","commenter_a":"Cemetary, huh? Could be 'cause the kid didn't wanta be seen anywhere with such an ugly woman.........","post_message":"Police say that an officer caught 49-year-old Kelly Aldinger in the act with a 17-year-old student at Easton Cemetery."},{"comment_id":"910779442445965","commenter_b":"YES THAT IS WHAT WE SPEAK. THE ILLEGALS CAN LEARN IF THEY HAVE A BRAIN OR FIGURE STUFF OUT FOR THEMSELVES. THEY CAME HERE NOW THEY CAN FOLLOW THE LAWS OR START Walking or swimming. either way learn or leave.","commenter_a":"Yes to english","post_message":"He wants to make this this official language of our country. People are up in arms. Do you think he's right?"},{"comment_id":"1092391170839418","commenter_b":"@username why would you want my ass to look like your girls face......woof woof.","commenter_a":"His last words were probably \" more ham \". He was old and he was a fat slob. Nobody needed to kill him.","post_message":"Before passing away, Justice Scalia made a comment to his security detail. And based on what we're learning about his death, that comment may have changed everything about that fateful night."}]
