[{"comment_id":"10154043523939203","commenter_b":"Mr Pope! Tear down that wall!","commenter_a":"If somone keeps coming on my porch and coming in through my door and rapes and kills, at some point I am going to lock the door!","post_message":" person who thinks only about building walls, wherever they may be, and not of building bridges, is not Christian.\""},{"comment_id":"1665137810414324","commenter_b":"Beyonce is a racist and a cop hater.","commenter_a":"God Bless You.","post_message":"Whoa, this outspoken Obama critic didn't hold back at all when discussing Beyonce's Super Bowl halftime performance... and he pointed out EXACTLY what made it so hypocritical.  If you thought Beyonce's halftime performance was unacceptable, spread this video far and wide,,,"},{"comment_id":"569853826519212","commenter_b":"So how was your nap after clearance today then?","commenter_a":"@username this is you","post_message":"Facts"},{"comment_id":"10153231132726336","commenter_b":"they should leave and not allowed back","commenter_a":"Look all black","post_message":"\"If you don't like what that flag stands for... leave!\"  On 'Fox & Friends,' Medal of Honor recipient Dakota Meyer called for a social media campaign to counter a movement encouraging Americans to stomp on the flag."},{"comment_id":"10153802137316130","commenter_b":"It's almost always a woman too","commenter_a":"How romantic to threaten to blow up a plane full of passengers for your ex-wife.","post_message":"An Egyptian plane was hijacked, and several passengers were held hostage."},{"comment_id":"10152763984611051","commenter_b":"they need to fire those officers, charge them criminally and hope she wins the lawsuit","commenter_a":"I'm thinking alot of you didn't read the article. Female police officer, in Canada, one month on the job, immediately suspended from the job after the attack, has since resigned.","post_message":"This officer arrested two people: a drunk teen and a rapist. She put them in the same backseat but only handcuffed one. Guess which one."},{"comment_id":"10153272764696045","commenter_b":"Steals from children and drives drunk to possibly kill someone. She needs to be in jail.","commenter_a":"Mandatory Rehab and therapy","post_message":"Amy McArthur Balch is currently being held in Morgan County Jail with no bail."}]
