[{"comment_id":"1672968102966647","commenter_b":"@username If she's 201 lbs I'm a dolphin.","commenter_a":"Plus sized? She's not even rubenesque. A way to help Sports Illustrated tell if their model is plus size or not to ask ask \"if we don't tell people she is plus size, will anyone know?\"","post_message":"A trailblazing move by Sports Illustrated Swimsuit."},{"comment_id":"995140990545649","commenter_b":"terrible how must the parents feel xxx","commenter_a":"SICK!!!!!!!","post_message":"She drives off with the baby's pram still wedged in her bumper"},{"comment_id":"10154173554642061","commenter_b":"We are all called on to help our fellow man","commenter_a":"Nice guy!!!","post_message":"School bus driver, who is a U.S. Army veteran, noticed one of his students was crying when he boarded the bus, so he bought 10 sets of gloves and hats for that boy and other kids in need. \"No one wants a kid to suffer like that.\" @webpagelink"},{"comment_id":"1269059086447452","commenter_b":"Can you imagine how outraged the freeloading Obama brown nosers minion would be if that would be the Obama girls.","commenter_a":"But the images of the Obamas as monkeys is ok?","post_message":"Sen. Ted Cruz launched an \"emergency\" fundraising appeal after the Washington Post published a cartoon online depicting his daughters as dancing monkeys."},{"comment_id":"10153014611669138","commenter_b":"\"Land of the free\"? Should be able to go where ever the hell we like! A sign isn't going to stop me","commenter_a":"Sheesh. Just did this last year and yeah it was slippery but everyone knew you did it at your own risk. As for the stairs being closed well you could step over the chain they put to block it. I'm actually taking my boyfriend in the next couple weeks since he's never been.","post_message":"\"The Park Board is disappointed that local media is encouraging this behavior by covering it without explaining that it is dangerous and illegal.\""},{"comment_id":"10153197093266051","commenter_b":"She a idiot","commenter_a":"Agree","post_message":"Nancy Pelosi says President Obama's Iran deal is simply brilliant. Agree or disagree with her?"},{"comment_id":"10154403319313812","commenter_b":"On their engines a 100,000 is a lot, only had to do my head gaskets or have a burned out valve. Meanwhile my duratec engine in the Mazda hit 300,000 with little power loss. We do love or did I should say our new 2016 Outback for the whole 600 miles we had it till yesterday it was the 85th car at the single dealership to be towed away to some lot in the middle of slc airport till god knows when Subaru can pull their head out and get entire steering colums to replace.","commenter_a":"I have 4 Subaru's in the family 2005, 2008, 2010, 2012. Three foresters one Tribeca. They all have been great. never had an issue with any of them. Two of them are over 100,000 miles. Love my Subie!","post_message":"RECALL ALERT: Subaru of America, Inc. recalls 52,000 cars and SUVs over potential steering failure and warns owners not to drive them."}]
