[{"comment_id":"10154336399174342","commenter_b":"🤔 alright hoe😭😭","commenter_a":"@username @username Rest In Peace Damiyah","post_message":"Happy #NationalCatDay Don't be a scaredy-cat! Watch these purr-fect #kittens reenact horror films: @webpagelink"},{"comment_id":"10154369972274749","commenter_b":"He is just like the guy that went on s rampage at the abortion clinic but this time he us a Muslim which changes the entire situation.","commenter_a":"Come on give the man a break,he was only a good muslim following the teachings in holy quran giving the wife the odd back of the hand and killing gay's is all well and good with islam ! It's us that have to adjust to the way they want us to live","post_message":"Mateen's ex-wife said she had been beaten by him during outbursts of temper in which he would \"express hatred towards everything.\""},{"comment_id":"618380188311949","commenter_b":"Go home? Come back Nikki, come back!","commenter_a":"I've hated being called \"Nikki\" all my life as a nickname, but in Prince's honor, I guess I'll go home and get my grind on. :-(","post_message":""},{"comment_id":"10155137005061037","commenter_b":"Most illegals come here by not wading a river.","commenter_a":"Trump supporters are more worry about illegals than of terrorists what a sad world dnt forget that criminals come of all races and not just cause your brown skin means your from mexico Natives,Mexicans,Italians share the same skin color","post_message":"He once referred to it as “The Great Wall of Trump.”"},{"comment_id":"10154042885608352","commenter_b":"N BITCH U HELLA UGLY..LOL.LOL.N GET UR HAIR FLAT IRON POOFY HEAD HOE!!YEA U A DIRTY HOUSE HOE,YEA U CAN STAY MAD,WAY N ALABAMA. TALKING SHIT..YEA U WOULD...","commenter_a":"SHE TALK ALL THAT. SHIT,N SHE A PUNK ASS HOE!!!MAKE US WOMEN. LOOK. BAD N US WIFE'S....DUMB ASS!!","post_message":"Mo'Nique Defends Letting Her Husband Have A Side Chick! Says 'That's When The Relationship Is Real'"},{"comment_id":"10156750651870551","commenter_b":"Any one who eats pizza with a folk should get out of the country .WHAT A DOUCHEBAG","commenter_a":"He's a loser! Go down the tubes! And another one bites the dust!","post_message":""},{"comment_id":"1113965658660810","commenter_b":"Arrest them sum bitches","commenter_a":"I don't know who wrote this, but it is fantastic! This is WHY Trump has such a following. Many have asked me if I support the republican party? Here is a letter someone sent to the RNC. You be the judge. Dear Representative, From the time I was able to vote I voted republican. I am 80 and have a great deal of respect and influence with hundreds of senior ball players who also network with thousands of others around the country. I received your questionnaire and request for money and strongly agree with every question as I have since Obama was elected. Unfortunately the one question that was missing is “What has the republicans done for the American people?” We gave you a majority in the house and senate and you never listened to us. Now you want our money. You should be more concerned about our votes not ...","post_message":"About 20 protesters were arrested on Thursday night outside a Donald Trump rally in southern California, where the Republican presidential front-runner was vowing to get tough on illegal immigration. Will this hurt Trump's campaign?"}]
