[{"comment_id":"1393104724052131","commenter_b":"@username - Woman you should stop watching Fox!!","commenter_a":"This is so stupid. History will show that President Obama is one of our best presidents and also one of my most maligned president for no other reason for the color of his skin . He is one of our most educated presidents, he is also one of our most Christian presidents who didn't have to say he was Christian because he's lived it by being a faithful husband a wonderful father and a patient man who has reached across the aisle and had his hand slapped over and over and over again by hateful Republicans who put party before their duty as servants of this country . He without any help from the Republicans have brought us back from financial ruin that was left by the last Republican president given millions healthcare and under his leadership on military has killed those perpetrated 911 and killed hundreds of Isys and ...","post_message":"A Louisiana newspaper sent a very strong message to President Obama today. Do you agree with the paper on this?"},{"comment_id":"1759531520987240","commenter_b":"@username Trump's wife was an immigrant and all she did to cum to U.S., is spread her legs!","commenter_a":"My native American vote for Trump although the Chief of the Cherokee tribe supports Hillary Clinton. Trump President of the United States 2016 all the way to Trump Towers aka the White House. Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not stirring a race war. Trump did not leave any US soldiers in Benghazzi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of ...","post_message":"It is time for rule by the PEOPLE, not rule by SPECIAL INTERESTS!"},{"comment_id":"10157822759390389","commenter_b":"She is a joke","commenter_a":"Evil woman","post_message":""},{"comment_id":"502375926577851","commenter_b":"WELL damn go fund ME!","commenter_a":"It worked for this hating pig, wait for the next one. Gopers are slow learners.","post_message":"I'd say I've been doing it all wrong the past few years... except I'm a decent human being with a conscience... via The GOOP  | Liz"},{"comment_id":"10153068133586135","commenter_b":"Nope kids do not belong at wedding receptions! Especially with the cost of plates being so expensive!","commenter_a":"Can't stand the non-kid weddings. Just bring them. HA!!","post_message":"After their babysitter cancelled, Jessica Baker and her husband didn't attend the wedding because kids weren't invited. A couple weeks later, they received a bill for $75.90 in the mail to cover the meals they would've eaten at the reception."},{"comment_id":"1584256221591722","commenter_b":"Donna, STFU!!!","commenter_a":"When my kids were young and one of them had pulled some lame brain stunt but I wasn't sure which I'd start a mild-mannered conversation about it when they were all present. Sure enough one of them would just sort of drift away--go outdoors or to his room. It was an instant notification as to whom the culprit was. So the Puffy Orange Juvenile is drifting away? Bingo! That's enough for this old mom.","post_message":""},{"comment_id":"10153598339119205","commenter_b":"Fuckdonaldbitchasstrump!!!","commenter_a":"*****Hillary Clinton leads the Nation in overall votes and delegates, than any other Candidate running for the Presidency! She is more qualified and has more experience and will be ready to be our Commander in Chief, on day one. She has exemplary qualification in Foreign Policy, National Security and Diplomacy. Please vote wisely and vote for Hillary Clinton, our next POTUS 2016*****","post_message":"The biggest LOSER of the MSNBC #DemTownHall was..."}]
