[{"comment_id":"10153004529954071","commenter_b":"Bill is a smart man!","commenter_a":"And what did Hillary say? Unless Trump is doing all this show to destroy the Republicans and elect Hillary as POTUS but then again there is Bernie.","post_message":"Former President Bill Clinton called Donald J. Trump in May and \"encouraged Trump's efforts.\""},{"comment_id":"1015046351849709","commenter_b":"Science BITCH","commenter_a":"Carlos","post_message":"Sorry folks."},{"comment_id":"1112383468868962","commenter_b":"So she's been here illegally since 1993........of course she'd vote for a criminal.","commenter_a":"If Facebook was not a thrown for liberals, and they removed news pages for being one sided, this would be the smoking gun","post_message":"She survived the holocaust — and years later, she’s getting her citizenship so she can vote for Hillary Clinton @webpagelink"},{"comment_id":"699418583582053","commenter_b":"Jaye you're a perfect example of a dumb blonde .....","commenter_a":"What in the heck did Obama do to deserve impeachment!!!! People are just RIDICULOUS!!!!!","post_message":"Obama's college records were finally publicized and what they say... This is exactly what he has been trying to cover up for so many years. Do you think Obama should be impeached?"},{"comment_id":"1180266452035470","commenter_b":"@username... Exactly! They're just drugged and/or drunken hoes.","commenter_a":"I FEEL YOU SHOULD HAVE A LIMITED AMOUNT OF KIDS IF YOU ARE ON WELFARE.","post_message":"WHOA! This judge goes off on this arrogant and ungrateful mother of 12 kids who has gotten a ridiculous amount of freebies from the state. What this mother says will disgust you. Can we get 2,000 'LIKES' to take back all the benefits this ungrateful moocher has gotten?"},{"comment_id":"1297388806970322","commenter_b":"Being ashamed of himself is not enough. Fire this idiot and boycott the idiots who hired him, and him being a professed republican. Rino.","commenter_a":"Con Hannity always a victim! Lester Holt is a registered Republican. FACT!","post_message":"The numbers don't lie."},{"comment_id":"10154929144129657","commenter_b":"You're actually describing her as intelligent? Seriously?","commenter_a":"Intelligent strong ladies don't need NOW to fight their battles for them. They are capable of doing it themselves.","post_message":"Looks like she doesn't need NOW's help after all."}]
