[{"comment_id":"1300695323356852","commenter_b":"Get educated. Oh that's right you don't want the truth only lies from the most disgusting pig.","commenter_a":"Hillary supporters, How do you put Syrian refugees before American people? How do you look a homeless vet or child in the eyes and say sorry I won't help you. Oh the same way you turned your back on American's in Benghazi.","post_message":""},{"comment_id":"685160418299400","commenter_b":"He going to build a wall!!!!! What an asshole","commenter_a":"Oh, Jennifer....I LOVE your post....thank you....you just made my day....","post_message":"Oh this is precious."},{"comment_id":"10154365677768008","commenter_b":"I just hope she don't hide when she delivers.","commenter_a":"Your Holiness, thank you for all you do for the world if you are watching!","post_message":"BABY WATCH (10am update): Still no baby giraffe yet! When do you think mom April will give birth at Animal Adventure Park? Don't miss anything: @webpagelink"},{"comment_id":"408553512676250","commenter_b":"Eat dicks @username, you dumb fat bitch.","commenter_a":"I, a citizen of The UNITED STATES of AMERICA, am calling for the immediate arrest and trial of Barack Hussein Obama for treason, under Article 3 section 3 of the United States Constitution, for aiding and giving comfort to our enemies. If you agree, please copy and re-post.","post_message":"Montana is fighting the Syrian Refugee policy to the end. This is amazing. Can we get 95,000 ‘LIKES’ for Montana?"},{"comment_id":"10153778466329497","commenter_b":"Yea Scott, because we were all alive to see that. Lol","commenter_a":"As a guy who bleeds black and is proud to come from Chicago where I've personally seen every single professional team in town win their respective championships except the Cubs. Thank you Mets!","post_message":"Via Onion Sports  Cubs Fan Criticized For Selling Playoff Seat To Mr. Met"},{"comment_id":"10154355156798812","commenter_b":"Yea these are the very perverted people that will claim to be transgender to gain access into bathrooms...","commenter_a":"The list of perverts who video people in bathrooms is long and does not just stop at Target! My local Old Navy had a perv filming a young girl while she was in a dressing room--her mother caught him in the act. These are not transgenders. These are simply perverted people! I am safer in a restroom with a transgender than I am with \"straight\" people! Transgenders are NOT peeping toms! If men dressing as women and claiming they are transgendered to assault little girls in bathrooms, then maybe there needs to be an anti-creepy men bill, not anti-LGBT bills, targeting Transgenders.","post_message":"Protesters inside North Carolina's statehouse staged symbolic sit-ins outside the offices of top legislative leaders."},{"comment_id":"549880968533529","commenter_b":"The ones who say they are refugees are young muslim men . I never see women or children in the pictures. This is what obummer wants to bring to America.","commenter_a":"It's funny how you people think all Muslims are bad, but I never heard you talk about all the Muslims in California who raised over 200k dollars for the victims of the San Bernardino shooting. Or what about the Muslims in Africa who protected Christians from getting shot on a bus.","post_message":"This makes me SICK!!!"}]
