[{"comment_id":"1033670103395908","commenter_b":"If I looked like Debbie, I would be a liberal to. Democrats know they got messed up looking chicks.","commenter_a":"Can we have at least 10 debates?","post_message":"Chair of the DNC Debbie Wasserman Schultz is taking your questions about the Democratic debate. What would you like to ask? Leave your questions in the comments, and we'll post Rep. Wasserman Shultz's answers in a follow-up tomorrow!"},{"comment_id":"911884798904575","commenter_b":"\"I guess if you favor the right, the debt will grow, more jobs will be lost\" - The current President who is on the left raised the debt more than every other President combined. You acknowledge that there can be different factions on the left but not right apparently as well. If your main concern is the debt then you should lean more conservative as the primary goal is financial stability. Bush was not a conservative btw, he was more liberal. The main difference in policy between Obama and Bush (and possibly both parties in general atm) is \"what\" they wanted to spend money on but they both want to spend as much as they can get away with. I also do not accept your copy and pasted answer to Octavio's question. A definition doesn't tell anything. He's asking where you see the differences. It's also dishonest to call America ...","commenter_a":"Socialism works, as designed by the Founding Fathers, all of whom were socialists.","post_message":"Republican liar: 1 Bill Maher: Infinity"},{"comment_id":"10154204530456037","commenter_b":"Pussy","commenter_a":"Muslim obama has destroy the military.","post_message":"The accused spy, Lieutenant Commander Edward Chieh-Liang Lin, has been in the Navy since 1999 and has won several awards, including two Navy/Marine Corps Commendation Medals."},{"comment_id":"10153111223750779","commenter_b":"@username You're such an, asshole.","commenter_a":"Donald Trump for President","post_message":"Billionaire celebrity G.O.P. presidential candidate Donald J. Trump will host an upcoming episode of Saturday Night Live."},{"comment_id":"10154449540370586","commenter_b":"That's bull learn something we do think for ourselves besides the president of the church knows she is evil educate yourself instead of spreading lies. Most Mormons are voting Trump or another candidate","commenter_a":"Most of the truly faithful Mormons will just vote for whoever church leaders tell them to, just like good little sheep... Both candidates should be in private talks with the church","post_message":"Democratic nominee Hillary Clinton’s campaign has launched “Mormons for Hillary” in an effort to woo people in red-state Utah to vote for her. Is it working?"},{"comment_id":"10154040549579411","commenter_b":"YOU STUPID WOMAN! Read some history first...","commenter_a":"Muslims ruled India from 7th century till 1856. All Indian heritage is created by Muslims rulers they civilized curry mouncher but still not enough... In entire Muslim India history you cannot find Hindu execution or forced convert to Islam..... Same 700 years Muslim rule on Spain... No force to converte to Islam.. No execution.","post_message":"5 assailants arrested, including a barber"},{"comment_id":"1181717725240095","commenter_b":"lol actually u support a murderous witch AKA BENGHAZI BITCH","commenter_a":"TO BAD ALL THE BULLSHIT HE TOLD WAS A LIE.","post_message":"Donald J. Trump just gave the speech of a lifetime... but more importantly, he totally destroyed Hillary Clinton. He put a very special message to Hillary in there that you won't want to miss."}]
