[{"comment_id":"1598021397151640","commenter_b":"At least God is doing something to help with the immigration problem.","commenter_a":"He is a wonderful god","post_message":"WHOA!"},{"comment_id":"10153551887101130","commenter_b":"it was funny....people lighten up","commenter_a":"Be serious. Not offensive","post_message":"You be the judge."},{"comment_id":"10154105407999166","commenter_b":"We are getting sick of black crap. Whites will start an uprising. Just wait","commenter_a":"If it was any other student you would be in an uproar...relax! He was wrong and you know it. We don't need this in schools. If they don't protect the safety of students, can you imagine what they would be up against. You don't wait til something happens then act. Let's think like adults here. This is 2016 not the 50s.","post_message":"JUST IN: Police say they have charged this Clemson student after he admitted to posting comments on a popular social media app, comments like \"let's do the Clemson protesters what Ohio did to the Kent State student protesters 40 years ago.\" He said he did it to \"make people mad\"."},{"comment_id":"10154136530601509","commenter_b":"Ignorant woman!","commenter_a":"Botate a la verga pinche paisana que te deporten por pendeja y regresate a tu pais pinche ignorante andas apoyando a trump y ni hablar ingles sabes se te nota lo paisana desde lejos","post_message":"The Donald J. Trump superfan, \"I saw Mr. Trump only in my dreams\" @webpagelink"},{"comment_id":"10158270376090381","commenter_b":"Wacky Woman!","commenter_a":"Perserverance! Thanks for keeping us strong!","post_message":"Last night, Majority Leader Mitch McConnell attempted to silence not only Senator Elizabeth Warren, but the late Coretta Scott King. It was a shameful attempt to stifle the thorough debate on President Trump’s nominees that the American people expect and deserve. I applaud Senator Warren and my Democratic colleagues in the Senate for fighting on behalf of the millions of Americans who have demanded that the next U.S. Attorney General be committed to upholding our most fundamental constitutional rights. In the battles to come, both in Washington and in communities nationwide, I urge my colleagues to follow Senator Warren’s lead—as she persisted last night, so must we. We do not have the right to remain silent."},{"comment_id":"1495644530464502","commenter_b":"Trump !! Hillary can't swim!!","commenter_a":"Butt wipe","post_message":"Watch Nebraska Senator Ben Sasse's speech LIVE to close out this year's #RSG16!"},{"comment_id":"702990689891509","commenter_b":"Vote for trump.he is going to kick.the illegals out of the.u.s.","commenter_a":"It Obamas fault.......#feelthebern","post_message":"Donald Trump was just stabbed in the back by the GOP. This is cut throat. Do you still support Trump?"}]
