[{"comment_id":"572733119579689","commenter_b":"Yeah you gotta be a useless bitch to waste time on Amazon digging these shit custom up for a fucking baby.. NO NOT ME","commenter_a":"@username gotta do this to the baby 😂😂","post_message":"I just grew ovaries and they just exploded."},{"comment_id":"10154015099517885","commenter_b":"So sad i am sure they will love that thight brown hole in prison be a man not a fallower make something of your life","commenter_a":"Then we will finnally get rid of all gang bangers","post_message":"We couldn't make this up even if we tried!"},{"comment_id":"1495082587178156","commenter_b":"Its not a city...its King County....so it wouldn't be the city that pays itd be king county...","commenter_a":"How big would the fine be if a private corporation had done this? Make the city pay that! This should never happen to our waters. (edit added: I was mistaken in my initial post. King County is responsible for the treatment plant, not Seattle).","post_message":"Roughly 100 million gallons of untreated sewage and rainwater has dumped into the Puget Sound after an equipment failure at a sewage plant near Discovery Park. >> kiro.tv/SewageIntoSound For a report on KIRO 7 News at 5, Graham Johnson is finding out what’s being done to get the plant working again. Watch on-air or kiro.tv/LiveNews"},{"comment_id":"10154156633758822","commenter_b":"Ship all libs and Democrats there now!!!!","commenter_a":"Can we send the Obamas and Clintons as test citizens? Perhaps their buddies in Isis?","post_message":"Humans on Mars by the 2030s! That's what President Obama's plan calls to do."},{"comment_id":"587852428063303","commenter_b":"@username WOMEN ARE THE FIRST TEACHERS OF MEN","commenter_a":"Amusing that Trump is too dim-witted to debate real issues affecting our country. Hahaha Republicans! Ready for Hillary 2016!","post_message":"Trump thinks attacking Hillary's marriage will save him. He'll soon find out how wrong he is."},{"comment_id":"10153134126831051","commenter_b":"Mother fucking bitch..","commenter_a":"A real POS","post_message":"Witnesses called 911 when they noticed this woman begin tossing something out of her car window. When the police finally caught up with her, she didn't bother denying it."},{"comment_id":"10154121076339342","commenter_b":"You are sick! Abortion should not be an option, period!","commenter_a":"There are so many people who would love to have kids and can't. But monsters like this get that blessing and go and kill their kids. This world is so effed up.","post_message":"Chilling new details about how a mother allegedly took each of her kids into the bathtub, and took their lives."}]
