[{"comment_id":"10155148589429614","commenter_b":"Yes send them to jail!","commenter_a":"@username if I was that teacher I would have been calling the cops EVERY DAY about the abuse of that baby!! ESPECIALLY after he asked her to call the social worker!! That poor little boy knew there were people out there that could help him, and then realized how bad he was being failed by everyone","post_message":"In testimony during the preliminary hearing, teacher Jennifer Garcia said in the months before Gabriel Fernandez's death, she repeatedly reported to county child service workers new signs of abuse that prosecutors say came at the hands of his mother and her boyfriend.   In one instance, Gabriel came to school with swollen eyes and a pockmarked face, she said. At first, he said he had fallen, but he then told her,  mom shot me in the face with a BB gun, she testified.  On two occasions, she testified, a fearful Gabriel asked,  you call that lady?, referring to the county social worker. But as months passed, and the boy remained with his mother, Garcia said she began to lose confidence in child protective services."},{"comment_id":"10153003040749091","commenter_b":"Thugs","commenter_a":"Soon will catch this people what a shame.","post_message":"HOME INVASION: Men break into South Bronx home, steal necklaces, PlayStation. Watch the surveillance video of the suspects.   FULL STORY: @webpagelink"},{"comment_id":"1226980343992420","commenter_b":"Ugh man females I hate em in high school and yes we can have a button up and cleavage will show lol","commenter_a":"Jessica Elizabeth😂😂😂","post_message":"Boob deodorant? Oh yes, I've got that."},{"comment_id":"10153216710121051","commenter_b":"Piss poor radical Muslim a$$holes!","commenter_a":"Piss poor life guards...","post_message":"Lifeguards desperately wanted to save this drowning woman - but her father refused to let them do it."},{"comment_id":"10153396977353010","commenter_b":"Illegal aliens should have NO rights in OUR country...time to load them up and send them home and shoot them if they try to return.","commenter_a":"Right wingers have often been bigots and dismissive of the Constitution.","post_message":"In a letter to supporters, Maricopa County Sheriff Joe Arpaio asked for help with his legal fees, adding that he feels \"targeted\" by the immigration rights groups that have sued him to stop what they say are racist policies targeting Latinos."},{"comment_id":"624034747748270","commenter_b":"GO Hillary!","commenter_a":"I'm a republican but I'm pretty sure Hillary just earned my vote on the fact that Ted dropped out. Trump is a no go for sure!","post_message":"Donald J. Trump is the presumptive Republican nominee. Chip in now if you agree we can't let him become president: hrc.io/1SL1LgJ"},{"comment_id":"10153798584711350","commenter_b":"You need attention like that idiot cutting herself.","commenter_a":"She's trying to commit suicide by cutting her upper arm. She's an idiot. A bridge or high building is what she needs to do. Cutting her arm is just a cry for attention.","post_message":" a teenager is hard, school sucks, parents are lame but life has so much to give you.\""}]
