[{"comment_id":"1716476818593163","commenter_b":"Well she is a WITCH.","commenter_a":"what a joke. anyone with any brains would look at her trend to not do the right thing. we have had enough bad behavior in the white house the past 2 elections we do not need more.","post_message":"According to Hillary's campaign manager, voters trust Hillary because she's completely upstanding, honest, and scandal-free. Claims to the contrary are nothing more than a GOP witch hunt."},{"comment_id":"10152892453289342","commenter_b":"Texans have had a better record than the cowgirls since they became a team up until the last 2 yrs.","commenter_a":"Come over to a winning team THE DALLAS COWBOYS!!!","post_message":"The greatest offensive player to ever wear a Texans uniform will play somewhere else next season.  The team has reportedly freed Andre Johnson up to pursue other options"},{"comment_id":"10153649421859138","commenter_b":"Why would you post such a thing Dan??? Wtf?","commenter_a":"Meanwhile in Chicago this weekend, more people were gunned down by those whose lives matter. But let's not protest that.","post_message":"The Twin Cities Marathon went on today without major disruptions, and police did not make any arrests."},{"comment_id":"10153941813117042","commenter_b":"Cuz is not her child . evil face.","commenter_a":"My child is 8 n very timid n shy. The minute i find out some one hurt her in any way. God help them cause ima go after them.","post_message":"A day care director was caught on video hitting a child with toys. But then it gets even more disturbing from there.   Warning: Police described the video as difficult to watch."},{"comment_id":"10154072971081756","commenter_b":"what is the average age of someone on Medicaid? If it's what I think, I think the horse the barn long ago with these folks quitting smoking.","commenter_a":"Wellbutrin, as pictured, is often used to help people quit smoking and is used as an anti depressant BUT (there's always a but.....) it can cause mental health issues itself such as hallucinations, manic symptoms, etc.","post_message":"Despite one-third of Medicaid participants being smokers, many states aren't doing enough to help people in their Medicaid programs quit."},{"comment_id":"985543698152769","commenter_b":"This old lady sounds like she's craving for big nigga dick :)","commenter_a":"See ya bitch... Cracker ass Cracker!","post_message":"Like housemother like house sons."},{"comment_id":"10154563050778010","commenter_b":"Tell that to the people that hire them....I've seen good ole Americans urinate on the street...it's not an illegal thing","commenter_a":"The only ones complaining they can't find a job are Americans...meanwhile illegals are busting their butts to support their families ..","post_message":"Most Americans believe immigrants in the country illegally are just as hard working as U.S. citizens."}]
