[{"comment_id":"1125682197501441","commenter_b":"I hope so, I heard today we have the most immigrants in the USA!!! I'm furious!!!","commenter_a":"I'm not happy with Michigan!!!!","post_message":"Team Hillary is full freak out mode...needs massive knockout punch in tonight's Debate of the Century to stop Trump momentum..."},{"comment_id":"10152704334291051","commenter_b":"Good! Take that piece of :poop: !","commenter_a":"GREAT JOB! (y) Hope the girlfriend is okay.","post_message":"A man walked in on his uncle trying to rape his girlfriend. This is what the uncle looked like after the nephew was done with him."},{"comment_id":"10153207313881770","commenter_b":"She has always been a liberal idiot so send them all to her house","commenter_a":"An actress whose biggest claim to fame is getting nailed by Frankenfurter","post_message":"Susan Sarandon is now likening Syrian refugees to Jesus."},{"comment_id":"10153150400359087","commenter_b":"Oh, she's held to a different standard, alright! Her sh*t don't stink. No matter what she does, she's Hillary Clinton, and she's untouchable. Ask General Petraeus.","commenter_a":"Plain and Simple Hillary needs to be in jail period.","post_message":"“This is not a criminal investigation,” former Rep. Ellen Tauscher (D-Calif.) said. “There’s no question about that. It’s dancing on the head of a pin and frankly partisan politics.”"},{"comment_id":"1370796892943097","commenter_b":"That was the sunniest, rainy Portland day with which I've ever been blessed","commenter_a":"How's Trump in his press secretary going to lie about this one? LOL","post_message":"Incredible images of the women's march protest happening all around the world."},{"comment_id":"1209490769090378","commenter_b":"Hillary is no lady she is more of a whore.","commenter_a":"We've already learned that this lady is a huge liar. What she says, and what she can do, are 2 different things. Obama just got blocked, so, hopefully this we won't have to worry about it and Trump will just be elected. Fingers crossed.","post_message":"DON'T let this woman be elected!!! @webpagelink"},{"comment_id":"10153294741338984","commenter_b":"California idiots are the cause of the decline of morals! Create a safe haven for idiots called Cali weirdness!","commenter_a":"Everyone knows that Parker","post_message":"DEVASTATING! In his own words, Obama proves time and again he's a calculating liar. Will you join millions of other Americans in demanding Obama be impeached?"}]
