[{"comment_id":"660481514127059","commenter_b":"She paid him off!!","commenter_a":"Why is she using Mr. Kahn so much? I thought his family is still distraught about the horrific death of his son?","post_message":"Replay: Hillary Clinton was in New Hampshire."},{"comment_id":"10153182922011943","commenter_b":"Time to round up these extremist traitors and deport to Muslim countries!","commenter_a":"She is the POTUS, Obamass is her puppet clown. George Soros funds the riots, paid Obamass millions and Valarie transmits all the government information to Iran where her father-in-law gives to his Iranian people. They know whats going on in Iran before we do here in the states. She had her office and quarters in the WH before Obamass and Mooschelle moved in.","post_message":"It been well documented that Valerie Jarrett, a Chicago lawyer and longtime Obama confidant, is a liberal extremist who wields tremendous power in the White House.   She has connections to many Communist and extremist groups, as FBI files obtained by Judicial Watch show. (SHARE THIS!)"},{"comment_id":"10153540575624411","commenter_b":"with Californias massive extreme drought, its like a match head waiting for a strike anytime any place.","commenter_a":"accidents happen anywhere why blame beautiful California. Nothing like California in this whole WORLD!!!!!!","post_message":"Watch: Huge forest fire sweeps highway in California"},{"comment_id":"1300466673353815","commenter_b":"If they all count, then re count where Hillary won by small margins...","commenter_a":"Jill stein sucks proletarian donkey dick","post_message":"We're at Trump Tower in NYC standing up for voting justice."},{"comment_id":"814574258686460","commenter_b":"The ladies of The View were rude and disrespectful. It seems like they only invited you on the show to badger you. Whoopi is worse than Bill O'Reilly. She kept interrupting you & would not let you get your point across, and Joy just laughed at everything you said like it was some kind of a joke. They don't care about their guests' viewpoints at all. I have to say that I admire you for being the great person that you are.","commenter_a":"Thank you, Dr. Carson, for remaining the gentleman you are while on The View today. I must say I stopped watching that show years ago. I watched today because you were on. I have great respect and admiration for you. Donald Trump is not my first choice for President. I will vote for him if he is the Republican nominee. Maybe some of your calmness, thinking before you speak, will rub off on Donald if he is nominated and elected President. The women of The View are not my cup of tea. I turned the show off as soon as your segment was over.","post_message":"I would like to thank the Ladies of The View for having me on. Though we disagree on politics, the beautiful thing about America is that we're able to have platforms where we can discuss those differences. I will continue to work hard to ensure that this remains for generations to come."},{"comment_id":"10155076639181337","commenter_b":"@username Delete yours Racist POS","commenter_a":"How many time during his presidency was Obummer on Fox? So I don't blame trump for not wanting to deal with CNN and their fake reporting.","post_message":"Fox News defending CNN?? Donald J. Trump has inspired the impossible."},{"comment_id":"10156284616795354","commenter_b":"Lol, they weren't immigrants.","commenter_a":"Immigrants....","post_message":"What in the world is going on?"}]
