[{"comment_id":"1066337003492628","commenter_b":"The woman is delusional.","commenter_a":"That is exactly what they are afraid of, that he will do something that never could do or would do. They just want to keep the people dependent on the government and not be able to stand on there own two feet?","post_message":"Hypocrisy, thy name is 'Democrat.'"},{"comment_id":"10153846948701162","commenter_b":"The wording is hilarious though. 'Twerking on a stranger'....lol!","commenter_a":"'@username how ridiculous are these two idiots!","post_message":"CRIME OF TWERKING: Two women are being sought for sexual assault after twerking on an innocent man.  FULL VIDEO: @webpagelink"},{"comment_id":"596965907173588","commenter_b":"They BORN there.need to FIX their OWN Country..DON'T COME MESSING UP 'OURS;~~","commenter_a":"Trump will make american tax payers build the wall not mexico","post_message":"Trump Better be Serious about Border Security Promises"},{"comment_id":"943744942348702","commenter_b":"To those of you who think the federal government can raise incomes do yourself a favor and take an economics class. And pay attention.","commenter_a":"Someone please perform a partial birth abortion on this woman.","post_message":"'The defining economic challenge of our time is clear: We must raise incomes for hard-working Americans so they can afford a middle-class life.' Read Hillary's ideas for the economy in her own words:"},{"comment_id":"1153858647985703","commenter_b":"It's the 'Chicago way'.... the end justifies the means.","commenter_a":"And all his ISIS appointees and advisors!","post_message":"Does this about sum it up?"},{"comment_id":"10150911052459999","commenter_b":"She ain't gonna be there folks - Someone on the DT team has a modicum of intelligence - Trump had an affair with his 2nd wife while still married to the first -inviting Flowers would Gain Hillary a Lot of Sympathy - guess what, it isn't the woman's fault when her husband cheats -Trump is Stupid & his handlers have to keep reining him in - Pitiful","commenter_a":"THE BLACK NARRATIVE IS TO COMMIT 'CIVIL DISOBEDIENCE' PROVOKE THE POLICE INTO INJURING OR KILLING THEM, THAN SUE TO GET A $$$ SETTLEMENT. MOST ALL BLACKS INVOLVED IN THIS SCHEME HAVE A BLACK LAWYER'S NUMBER ON THEIR SPEED DIAL.","post_message":"Donald J. Trump's team flatly denied that Gennifer Flowers would attend Trump's first debate with Hillary Clinton. Flowers's claims of an affair with Bill Clinton imperiled his 1992 presidential campaign."},{"comment_id":"1518093821534153","commenter_b":"Cindi Marcum then why do you ppl think that muslims have the right to travel to the u.s. and and park their lazy asses here, mooch off of us and kill at will while trying to enforce their barbaric ways of life on us....hmmmm?","commenter_a":"So if it's in the rights of the protesters to block a road where does my rights to travel freely fit into that agenda so I can say get to work , seek medical attention or buy food , ect","post_message":"Wow! Talk about fear mongering!?"}]
