[{"comment_id":"1033161420090232","commenter_b":"Hispanics are illegals? Since when? Your profile photo just proves you're racist.","commenter_a":"Pardon me...illegals don't vote so does it matter","post_message":"A presidential candidate must win at least 40% of the Hispanic vote to win an election in modern America. Here's why that's very bad news for Donald Trump."},{"comment_id":"10153679249728352","commenter_b":"Pure Evil!!","commenter_a":"SUCH HATEFUL EYES","post_message":"The most hated man in America, 21, smirks as he is hauled away in cuffs and a bullet-proof vest after his arrest ‘for shooting nine people dead at South Carolina church bible study’"},{"comment_id":"835612693201651","commenter_b":"HE IS LOOKING FOR MORE FREE REPUBLICAN MONEY !","commenter_a":"These people have to keep up the lie..because if you do your research. .then you will come to one and only one conclusion. .These people have no claim to the land..they were put there in 1948...but their blood line does not trace back to Abraham a hebrew..don't take my word for it do the research. .information is out there!!!!","post_message":"\"I will go anywhere I am invited to make the State of Israel’s case and defend its future and existence.” -Israeli Prime Minister Benjamin Netanyahu"},{"comment_id":"1908531226047249","commenter_b":"But where is Hillary?? This would have more weight if she were working with you","commenter_a":"Yes the people voted and they voted for CLINTON by over 2.5 Million votes!!!!","post_message":"The fight for #Recount2016 continues! We deserve a voting system we can trust, that is accurate, secure and just. Despite the sabotage, political cronyism, bureaucratic hurdles, economic extortion, and legal maneuvering that has been thrown in our way, this historic first-ever multi-state presidential recount carries on. I'm here to give you the latest updates, answer your questions, and talk about next steps."},{"comment_id":"916726885042526","commenter_b":"Such a FOOL !!","commenter_a":"He must be hitting the bong again","post_message":"President Obama said he thinks he's been a pretty good president, and he could win if he ran again. What do you think? Read more at @webpagelink"},{"comment_id":"10153916638559753","commenter_b":"Feed the gator Hillary and her pimp Obama kill that gator quick","commenter_a":"According to CNN the gator was a known Trump supporter and a life member of the NRA.","post_message":"News of yet another alligator attack has shaken things up in the state of Florida. A service dog named Precious has passed away after protecting her owner from being attacked by an alligator. Fox News reports the protective pit bill died after jumping in between her owner to save the man from an alligator attack in the southwestern portion of Florida. The alligator attack and death of this heroic service dog from Florida has prompted an inspect to determine whether or not the marina where... @webpagelink"},{"comment_id":"10153032074653145","commenter_b":"How date she!!","commenter_a":"'Stupid is as stupid does' Glad there's one less pea size brain off the streets. She and others with that type of violent ideas should be dealt with accordingly. Enough of thugs who think they can spread such animosity in a country with so many opportunities to do something positive, enough!!","post_message":" thought about shooting every white cop I see in the head..\" That's part of a Facebook post that got this mother arrested #WFTV"}]
