[{"comment_id":"924477534340446","commenter_b":"@username your mother should have swallowed","commenter_a":"If she really wants to make America whole again, she should do the right thing, and GTFO of politics altogether. It's a start at least.","post_message":"Do you agree with Hillary Clinton? #SCPrimary"},{"comment_id":"10156951027285725","commenter_b":"Redicous...sounds French.","commenter_a":"THIS IS REDICOUS","post_message":"Hold on to your $20s, they'll soon be a piece of history. @webpagelink"},{"comment_id":"10156401528845725","commenter_b":"@username pretty sure thats illegal and unenforcible","commenter_a":"I support you from India, they are welcoming muslims while one of muslim countries Brunei just banned Christmas..not to mention all most all muslim countries have banned isrealis and most of them hate america after jews..","post_message":"Thank you Franklin Graham! I have always appreciated your courage, but now more so than ever!"},{"comment_id":"10153176907066130","commenter_b":"And not be forcibly altered. Don't circumcise babies!","commenter_a":"Before picture or nahhh","post_message":"\"We need to remove the stigma. We should be able to alter whatever we please, free of the judgment of others.\""},{"comment_id":"495708673953046","commenter_b":"A Bullet to the head! No need to play nurse maid to this POS!","commenter_a":"shitbum","post_message":"This thug thought he was tough, not so tough now.   Good, he got exactly what he deserved. He is scum.  Do you agree all thugs should be deported?"},{"comment_id":"1084755811580947","commenter_b":"She well be Charming President .","commenter_a":"Unless Democrats want to see President Obama hand over the keys to the White House to Donald Trump, we Bernie and Hillary supporters had better start aiming attacks at Trump and the Republicans, and not at each other.","post_message":"\"She cares. She tries. She perseveres. And now she has a chance to tell the story she’s always wanted about America: the story about a country that found the courage to turn away from our darkest impulses; that chose to embrace our growing diversity as a strength, not a weakness; that pushed the boundaries of opportunity outward and upward, until there are no more barriers, and no more ceilings.\" —Jon Favreau, President Obama's former speechwriter"},{"comment_id":"712674415565701","commenter_b":"Fuck off you nasty hoes.","commenter_a":"Her tale is just the beginning...there's getting ready to be an avalanche of women coming forward...","post_message":"\"His hands were all over me. It was an assault.\" Here, Jessica Leeds of New York tells how a three decades ago Trump raised the armrest separating their seats on a plane and reached up her skirt.  Video by Occupy Democrats, LIKE our page for more. Credit: New York Times."}]
