[{"comment_id":"10152955044437293","commenter_b":"The evangelical pastors insist that only God can change the climate and that is an affront to God to claim that Man can do so. The ideologues constantly scream that the scientists, left-wing and Al Gore are in a conspiracy to 'steal our liberty.' using climate change to bring about global government. --- BTW. I am GOP and have been for decades. I also listen to Rush Limbaugh and Mark Levin, but unlike --- what is the word? sheeple? --- I don't check my brain at the door and believe everything I am told, like someon who listens to that 'lamestream media.' --- As for today's GOP, it is nothing like the one that Reagan led. He would not have tried to squash any talk about climate change, prevent any reference to it in schools, or cut funding for research into what is happening in our climate. But that is ...","commenter_a":"The deniers have wax in their ears and a blindfold over their eyes--because they prefer to think that their ideology or religion is under attack by all of this (and are encouraged by the oil and coal companies to believe just that).","post_message":"And scientists are concerned."},{"comment_id":"520938298031470","commenter_b":"This woman isn't on benefits","commenter_a":"It does make you think!!! As I pay out per week for my sons bass guitar lesson, each Saturday for my daughter to spend the day at the stables....school trips etc. ....and still moan about having no money, whilst running two cars and paying for three seats at Bath rugby...plus drinks!! This has put my 'poverty' into a proper perspective...and changed my opinion of ALL people on benefits being the same. Good luck to her and her family.","post_message":"Kathleen Kerridge’s family food budget is £40 per week – to feed five people. She says there is a big gap between the public perception of poverty and what it means for people like her. We should stop talking about poverty, she argues, until we know what being poor in this country really means."},{"comment_id":"10153974318380496","commenter_b":"Let them protest but not riots, vandalism and violence. These people r starting to scare me. Saw a sign outside trump towers saying rape melania and kill trump. What kind of people r they. Trump has to stay cool and not start tweeting.","commenter_a":"Thank God someone with common sense.","post_message":"While protests in Atlanta and around the country have been peaceful, that isn't the case for all. Now a major city's officials are saying that enough is enough.  “If you’re upset with the election, please don’t come out and protest,” the city's police chief said. “We are done with criminal activity in this city. It’s time to move on and to move forward.”"},{"comment_id":"10153031093836037","commenter_b":"Whore....","commenter_a":"Heck, sue playboy, or your parents. smh She should have been in school...","post_message":"Lawyer says he has evidence @BillCosby wasn't at the Playboy Mansion at time of model's alleged abuse: @webpagelink"},{"comment_id":"10153226681651833","commenter_b":"Thanks Jason - the 'next one' will probably effect me, though.","commenter_a":"I don't even own an AR, but I sent an e-mail to the ATF 'comments' site opposing the ban on M855. I also sent e-mails to my congressman and both senators and signed a petition about the same issue. I suspect that the motivation is simply that the government doesn't want those who own ARs to have a source of reasonably priced ammo for their guns. I oppose this mindset.","post_message":"A notice from the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF) shows the agency is considering a ban on the popular M855 AR-15 round  by re-categorizing the round as  piercing.  Be sure to contact ATF and let them know you oppose this proposal. Then contact your members of Congress and express your opposition to ATF's ammo ban.  @webpagelink/ #M855"},{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"'@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. 'We hope and pray the U.S. Coast Guard is able to bring Samantha home.' @webpagelink"},{"comment_id":"10154136218409384","commenter_b":"She's just the best, go home to your expensive home and shut up...","commenter_a":"Everyone should see the damage that democrat loal gov't can do.","post_message":"It was my privilege to call to order House Democrats' hearing on the Flint Water Crisis. In an American city, thousands and thousands of children have been drinking and bathing in poisonous water for more than a year. It was not an unavoidable natural disaster. It is a man-made catastrophe. Now, thousands of children are at risk of lifelong damage from lead exposure – unless we help get them the care, attention and resources they need. We have a responsibility to help the people of Flint tell their story – and to be sure that story is heard loud and clear in the halls of Congress. The story of Flint challenges the conscience of America. It holds lessons and warnings for communities across the country."}]
