[{"comment_id":"10153491570891336","commenter_b":"I don't want that scum anywhere near my home.","commenter_a":"Considering I don't have an auto dishwasher, Obama can be my dish washer anytime.","post_message":"Counterproductive? New Obama administration regulations are meant to boost dishwasher efficiency, but industry experts say it'll result in greater water usage."},{"comment_id":"1558275617531277","commenter_b":"NICE PERSON..SHE LIES, ARGUES LIKE HE DOES. INTERUPTS,ALL SHE DOES IS TRASH HILLARY","commenter_a":"She really seemed like a nice person and I am hoping she gets as far way from that idiot as she can. She is way too good for him. She was going down the tubes with him.","post_message":"The wheels are falling off!"},{"comment_id":"10153784446624203","commenter_b":"@username-She answers questions, she just doesn't give you, narrative you want hear-why should she. It amazes me, the vagina remark! Must be nice to have 240 years of men. Too bad it's not you electing, the first male President. Try reversing that and how would that feel? Oh and a lot our Male Presidents, haven't been real Winners. CONgress mostly MALE-mostly FAIL!","commenter_a":"Clinton is dead in the water. Mass media is bought and paid for. Sanders for President!","post_message":"\"Hillary Clinton may have trounced the men at Tuesday debate, but 2016 isn likely to be the year we get our first woman commander in chief.\""},{"comment_id":"612078075583452","commenter_b":"She did it before. Why not now ?","commenter_a":"She is reg","post_message":"If you listen closely to yesterday's debate, you can hear a very clear whisper. It was easily picked up by the microphone - but some people still missed it. Here - listen closely."},{"comment_id":"10153812349369170","commenter_b":"\"Hope\" is the refuge of somebody who has nothing substantive upon which to base what he wants to believe.","commenter_a":"Why do Christians continue to believe that they and their beliefs are entitled to special treatment?","post_message":"A group of angry atheists waged war on this town because of a touching veterans memorial. When the townspeople got wind of what was going on, they hit the atheists back HARD. This is awesome!"},{"comment_id":"682746131874162","commenter_b":"sorry i would not F%%% hillary the whore bitch, too many germs","commenter_a":"Hillary is a whore is better","post_message":"Drivers got one hilarious shock, but is it enough to turn Texas blue? -- Ellen"},{"comment_id":"10153075860699614","commenter_b":"A women should know her body lets slit her throat!!","commenter_a":"@username I understand what you're saying I've been through it also 3 times but when you see your babies all thoughts of dying and killing go away post part um depression it's just an excuse","post_message":"A young mother in Olympia, Washington, allegedly told police that she slashed the throats of her 6-month-old twins and 2-year-old daughter to keep them quiet for her husband. Christina Booth, who is believed to be suffering from postpartum depression, made a 911 call Saturday sobbing and screaming at the operator that her children would not stop crying. When police arrived they found the twins on the couch crying \"uncontrollably\" and \"bleeding from their necks.\" The 2-year-old was upstairs with a similar wound. All three survived their injuries. Booth allegedly told police \"she knew if she killed all the kids the house would be quiet\" for her husband \"who gets annoyed when the children cry.\" Read KTLA's story here: @webpagelink"}]
