[{"comment_id":"10153733539132169","commenter_b":"\"thank you for your service\"","commenter_a":"Jasmine Taylor","post_message":"Join The National Memorial Day Concert (PBS) this Sunday at 8/7c for an evening of remembrance, featuring General Colin L. Powell, Renée Fleming, The Beach Boys, Katharine McPhee, Trace Adkins, S. Epatha Merkerson, Esai Morales, Alfie Boe, Trent Harmon Music, Maestro Jack Everly and co-hosted for the eleventh year by Joe Mantegna and Gary Sinise. Join the conversation at #MemDayPBS"},{"comment_id":"1009004349187234","commenter_b":"first she needs to be a lady","commenter_a":"Watch out she will pick your pocket ...","post_message":"Michelle Obama Invites Muslim Refugee To Sit With Her At State Of The Union  She should invite a soldier who fought for our country. This is ridiculous.  Do you think Michelle Obama is the worst first lady ever?"},{"comment_id":"10153995516108854","commenter_b":"What a dumb whore weasel","commenter_a":"She's an STD waiting to happen.","post_message":"Lena Dunham Compares Rape Allegations Against Bill Cosby To The Holocaust…"},{"comment_id":"1590956274524819","commenter_b":"I won't stay there","commenter_a":"The should arrested the hotel owners and the stupid cops that arrested the veteran.","post_message":"I am boycotting this hotel. Veterans deserve BETTER!"},{"comment_id":"10153591914773132","commenter_b":"Ha","commenter_a":"Well I don't think prada makes sandals his size","post_message":"Looking good, Caitlyn Jenner!"},{"comment_id":"788608041305150","commenter_b":"Seems like a good time to turn off the tap to these law breaking cities. Go Trump!","commenter_a":"STOP THE INSANITY! Defund them and arrest those in charge that are breaking the law!","post_message":"A new study shows that more than 100 sanctuary cities across America received a total of $27 billion in federal grants and direct payments in one year."},{"comment_id":"10156528840915389","commenter_b":"She's a troll. Ignore her and maybe she'll go away","commenter_a":"The best parts of LIFE are free and easy to do.","post_message":"ICYMI: 89-year-old World War II veteran Bryan Sperry scores a touchdown during The University of Kansas alumni flag football game! Sperry played on the Kansas Football team from 1946-1948. @webpagelink"}]
