[{"comment_id":"10156901332200192","commenter_b":"Roxann Bracken ,you are above this EVIL woman ,you do not need to justify yourself ,YOU ARE AN AWESOME MOM , I don't know how someone like this @username sleeps at nite !!!! when she has such evil thoughts , Maybe if she would have raised a better Son he wouldn't be an abuser and in Jail ....just sayin ......I love you and am praying for you","commenter_a":"Just because you live in a nice house doesn't make you a good mother Robert Jennings is the father of Clayton there's a lot of facts people don't know I just hope they keep the investigation up this is no accident this is neglect","post_message":"BREAKING: Pasco deputies found the body of a missing 2-year-old Hudson boy Wednesday night in a pond near his home."},{"comment_id":"754556321401612","commenter_b":"Tie them by their ankles to a fast moving train!!","commenter_a":"This is the mine set of Muslims. That it's ok . Send their asses back","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News They deserve much worse than this. What do you their punishment should be?"},{"comment_id":"1003302019710656","commenter_b":"Sure let them get married. Let them suffer like the rest of the world. Oh and wait till they start getting divorced! HAHAHHAHHAHAHA Your welcome ass holes!! HAHAHHAHHAHHAHAHHAHHAH","commenter_a":"It’s My Right To Discriminate Against Republicans Since I Do Not Agree With Their Lifestyle Many conservatives who oppose equal rights for homosexuals do so based on “religious principles.” It’s a defense for ignorance that I always find amusing considering how many “biblical laws” are completely ignored because it would be almost impossible to abide by them. So, I've decided to use this right-wing ignorance to my benefit; I've decided that it’s my right to claim “religious freedom” to discriminate against many Republicans since I do not believe in the lifestyle choice they've made to be bigots. Republican and/or a bigot is a choice After all, in a state such an Indiana (which just legalized the right for citizens to discriminate against people with whom they disagree based upon their religious beliefs), shouldn't people in that state (or any other state with similar laws) then be allowed to discriminate against ...","post_message":"With the arguments for marriage equality heating up soon at the Supreme Court, TakePart.com has a handy \"here's what's up\" article full of background, context, and facts. Yay, learning!"},{"comment_id":"667824530017395","commenter_b":"THROW them out of the country after incarceration. This disgusting behaviour does NOT belong here","commenter_a":"Yet no justice for the douggler girls.......","post_message":"GROSS."},{"comment_id":"10152728420456519","commenter_b":"Ducking duckers lol","commenter_a":"@username hahaha","post_message":"No one should be forced to drop this kind of money to celebrate a loved one..."},{"comment_id":"10154098589214753","commenter_b":"She could be doing a whole lot worse,she is doing what she wants before going to collage,seems like a good idea to me .She may not be so inclined to act foolish when she gets there and will take her studies more seriously.Enjoy your year off","commenter_a":"Wow! This is not news...who cares?","post_message":"Malia Obama has been embroiled in a pot smoking scandal after footage was released of her smoking at the Lollapalooza music festival in late July. The first daughter opted to attend the Chicago event instead of joining her parents for the Democratic National Convention in Philadelphia. It was a decision that led to big headlines for all of the wrong reasons. Images of Malia twerking and partying it up were posted online. It wasn’t just her wild behavior that got attention, but who she was... @webpagelink"},{"comment_id":"1029734007098210","commenter_b":"Poor old bitch. Still eat up with dumbass","commenter_a":"Cannot wait! This should be fun. Trump has his problems but hillary is such a liar that I hope she turns pknk.","post_message":"Democratic presidential candidate Hillary Clinton took aim at Republican rivals saying she is looking forward to debating with them about the economy if she becomes the Democratic nominee."}]
