[{"comment_id":"10154338661984087","commenter_b":"Keep sucking off your Arab whore","commenter_a":"Raper of Ex Wives and groper in chief","post_message":"“Look to his past to see what he will do for women in this country,” Omarosa said about Trump."},{"comment_id":"537038436486736","commenter_b":"PUKEBAG, Tax-evading, racist POS!","commenter_a":"What A Joke HE IS DEFINATELY TALKING OUT HIS ASS NOW","post_message":"Dr. Alveda slams Al Sharpton for comparing himself to MLK on live TV.  Al Sharpton and MLK should never be used in the same sentence.  Do your agree Al Sharpton is a criminal?"},{"comment_id":"1178124042307867","commenter_b":"No brains--no headaches. Maybe he should leave with Whoopie. They would be happy in Iran, take Rosie with you.","commenter_a":"Some of these people have lost their f##ing minds!!","post_message":""},{"comment_id":"10153233984390950","commenter_b":"Did you think women are incapable of evil","commenter_a":"And the people who are saying the women and children are safe, check out who blew herself up with the suicide vest","post_message":"Police give update on raid near Paris: • Woman wearing explosive suicide vest blew herself up • 7 suspects taken into custody; 2 suspects dead • 5 officers reportedly injured; police dog killed"},{"comment_id":"10153447455781051","commenter_b":"Trash get class Ur pregnant!","commenter_a":"Well if there married its her car too sucks to be him hopefully the baby in her tummy is ok","post_message":"When passersby saw this pregnant woman smashing a car in the parking lot, they ran outside to stop her. As soon as they learned why she was doing it, they let her continue"},{"comment_id":"597418893776211","commenter_b":"@username Jill stein is a communist and belongs in jail for vandalizing construction vehicles at standing rock and she's crazy","commenter_a":"Bernie needs to take a young politician under his wing and mentor them so one or two elections down the road the only politician in america with a moral bone in their body isn't pushing 90.","post_message":"Mr. Trump, you told working people you were on their side. You know what? Millions of us are going to demand you keep your promise."},{"comment_id":"10154365677768008","commenter_b":"I just hope she don't hide when she delivers.","commenter_a":"Your Holiness, thank you for all you do for the world if you are watching!","post_message":"BABY WATCH (10am update): Still no baby giraffe yet! When do you think mom April will give birth at Animal Adventure Park? Don't miss anything: @webpagelink"}]
