[{"comment_id":"1052974981463934","commenter_b":"Where is our government's back bone they should have someone down there telling them that we have our own laws. Instead they act they have a yellow streak down their backs this is the USA if they don't like it leave","commenter_a":"Go back to your shit hole in the sand\"","post_message":"Muslims OUTRAGED After Texas Major After She Bans Shariah Court... [VIDEO]  She's taking heat.  Do you support this Texas mayor?"},{"comment_id":"10154125094006409","commenter_b":"Hillary is the CLOWN","commenter_a":"They already took our voices away anyway, so what difference does it make? Donald Trump didn't win the popular vote. Yet, he's the next \"President\" anyway. The guy's a CLOWN!","post_message":""},{"comment_id":"1167989119901455","commenter_b":"How do we know that it is a woman makig the comment?","commenter_a":"Looking his wife in the eye and saying thank you when she hand him a coffee might be a good step towards rebuilding intimacy.","post_message":"\"Honestly, I want to feel that we’re not just roommates—that we’re not just waiting for the kids to grow up so that we can move on.\""},{"comment_id":"10152885514044342","commenter_b":"Ain't that the truth. These hoes need to held ACCOUNTABLE!!","commenter_a":"It's always a mental thing.. Always an excuse...","post_message":"MOTHER CHARGED: A 23-year-old mother has now been charged in a brutal attack on her 4-year-old son that left deputies responding to the scene shaken and disturbed --> @webpagelink"},{"comment_id":"10153342820917098","commenter_b":"I am on her side, women now a days are almost naked just to prove that they are sexy.","commenter_a":"Im on her side. Hoes are in their feelings because she feels beautiful and sexy with clothes ON. She clearly didnt have to be half naked to get her man and that should tell you hoes something. Lol Dont be mad, learn something. Know your worth. Get it together.","post_message":"TWITTER DEBATE: Ayesha Curry, wife of Warriors basketball star Steph Curry, found herself in a social media firestorm after tweeting about today's fashion  Many people criticized her for body shaming while others praised her for her modest views. Which side are YOU on??   FIND OUT what she said: kron4.com/2015/12/07/twitter-explodes-after-ayesha-curry-tweets-about-modesty/"},{"comment_id":"1308657809199446","commenter_b":"Please! Let her stay home.she's not needed there are many others to take her place.","commenter_a":"Let her stay home.","post_message":"One of the dancers felt \"embarrassed and disappointed\" by performing at Trump's inauguration."},{"comment_id":"919874341467572","commenter_b":"WOW...THAT IS A AWESOME BEAUTIFUL PICTURE...GOD BLESS YOU ISRAEL...","commenter_a":"Beautiful!!!","post_message":"#TelAviv by Chief Eran Yerushalmi  #PicoftheDay #Israel #Beach"}]
