[{"comment_id":"892479024147549","commenter_b":"The majority of people who act out racism, cry about racism, are the most racist...are black people....you want a safe space where whites won't be around...Liberia...Nigeria...Botswana...many places...but here's the thing...no welfare, no food stamps, no healthcare, no free housing(except in the jungle and you build it), no opportunity for education, ....not one of you would survive in any of these African countries.....because you've been spoon fed for to many generations! I've been to Africa many times, I've spoken to hundreds of Africans.....they will rot and die in poverty because of the black government that runs the countries....take a very close look at who's in charge of America now!!! Except in America the white tax payer affords you the life you don't even deserve.....and now he's giving your life...yes your life to illegals...he's done with you....make the best of it...because that stupid monkey president couldn't care less about you!!!!","commenter_a":"Hell No. There are no more minorities","post_message":"Huffington Post:  Deserve Safe Spaces Without White People  A couple of weeks ago, two students from Ryerson University Journalism program were barred from attending an event organized by the ' BECAUSE THEY WERE WHITE!  @webpagelink"},{"comment_id":"1624197824544119","commenter_b":"During the debate season, Hillary Clinton will mop Donald Trump off of the floor and dump him into the sewer with the mop water because she is 20x smarter than he is. She went thru 12 hours of gruesome testimonies with congressional republicans and didn't even break a sweat and was able to squash all of them like cockroaches. On the other hand, Donald Trump choked during a 1 hour meeting with the Mexican President and he choked and sweated bullets while being interviewed by Faux News Megan Kelly.","commenter_a":"Jordan Elum","post_message":"#Repost Ivanka Trump #Instagram ••••••••••••••••••••••••• Smooches from baby Theodore. 😘 #Latergram"},{"comment_id":"538334903023756","commenter_b":"Yes....throw her ass in jail.","commenter_a":"That's what happens when you engage you mouth before your brain","post_message":"The Baltimore prosecutor is about to go down in flames after this.  She is a criminal, just like the rest of them.  Do you agree she should serve time?"},{"comment_id":"10153656357399726","commenter_b":"Gray is a puss !","commenter_a":"Not just NO but Hell No! Graham cracker thinks alot like Obummer!","post_message":"Should Ben Carson apologize?"},{"comment_id":"1377566012257306","commenter_b":"Sarah Elizabeth Pool like I said all that Shit is fake babe","commenter_a":"Janine April May","post_message":"Americans literally lose billions on weight loss scams."},{"comment_id":"10153687843588854","commenter_b":"She has less worth than a used condom","commenter_a":"She deserves a place in cellblock B","post_message":"Unreal: Susan Rice Calls Benghazi A “False Controversy”…"},{"comment_id":"10154287334146636","commenter_b":"It's very disgusting seeing the fake news of rape and burning alive. Burning alive is the nature of Muslims and Myanmars never do that act. Rape? All Myanmars are laughing the accusing of rape because Myanmar men even don't dream to rape Bengali Muslim women.","commenter_a":"Whether true or not, Myanmar needs to show evidence rather than blanket denying n also ppl should stop pointing finger from one side n stop calling ' Buddhist terrorist' unless u want to be called ur religion as ' terrorist' too, think in their place before u say ! Plus I AM DONE WITH ALL SOCIAL MEDIA NEWS especially like BBC !","post_message":"Horrific"}]
