[{"comment_id":"10156390568200354","commenter_b":"Then why has socialism worked anywhere ??????","commenter_a":"No.","post_message":"\"...the word ‘socialist’ has become a dirty word.\""},{"comment_id":"10155112285036729","commenter_b":"Just a clone of evil Hillary. Let her be gone and never seen of again!","commenter_a":"We can only hope. Oh, she may be protected as a Native American. Oh, that's right. She lied about that.","post_message":"Your feel-good story of the day, folks!"},{"comment_id":"10153661151756167","commenter_b":"Ditzy Daisy, throw her out! Keep her coat! Knock the cr*p out of her! Go ahead back to your momma! Drag her outta here! Ditzy Daisy, she's really nuts folks, really nuts. Yep, that's how Drumpf would handle her...","commenter_a":"That goes for all you communists who call us racists and if you spell president trumps name wrong again. The democrats are the party of anti american hate mongering. Now we can sue yo ass.","post_message":"Trump’s plan to “open up our libel laws” is just the beginning."},{"comment_id":"969277346429620","commenter_b":"Women only have X chromosomes.","commenter_a":"Those babies will never be normal. You need X and Y chromosomes. This is going to be sad.","post_message":"Humanity may have crossed a treacherous threshold as Researchers led by an Indian-origin scientist, have shown that stem cells from the skin of two adults of the same sex can be used to make human egg and sperm cells. What this means is, there is no longer a need for the opposite sex to “create Life”. What could possibly go wrong with “Playing God” and altering the creation of Life? #daysofnoah"},{"comment_id":"783781558433266","commenter_b":"That's the truth! Their acting like that's what they won't so people think their real. Lol! Their both scared and they should be! Trump the only one can beat Hillary or sanders!","commenter_a":"Move on.org, BLM and now Bernie supporters, are all DOMESTIC TERRORIST GROUPS OF AMERICA. They all need to he arrested! This is not protesting, this is organized violence!","post_message":"The last person that Hillary or Bernie want to run against is Donald Trump --- and that is fact!"},{"comment_id":"10155369881175389","commenter_b":"Hillary should run on a ticket with McCain. Both are so full of themselfs.....hint","commenter_a":"#ThaiJohnson the reason she doesn't look into the camera is the same reason a person lying to you can't look you in the eyes, she has that Obama syndrome can't stop lying and can't keep tract of the lies.","post_message":"Question of the Day: What do you think of Hillary Clinton's performance at today’s press conference? Tell us in the comments, and tune in to Fox News tonight at 10p ET for more on this story."},{"comment_id":"10153806284196509","commenter_b":"He is representing the USA is a PATRIOT with money. MANY MANY AMERICANS R Rich! PRAISE GOD WHOM ALL BLESSINGS FALL! RICH People make employment for others! RICH people can pay well & most do! Rich people donate to causes that heal, give to the poor, spread for GOOD! They are AMERICAN CITIZENS with opinions that this country needs fueled now!","commenter_a":"TRUMP is an AMERICAN that is ENTITLED to a VOICE! We support TRUMP!","post_message":"Both co-hosts of Miss USA, Cheryl Burke and Thomas Roberts, have pulled out of the pageant in light of recent comments from Donald J. Trump. @webpagelink"}]
