[{"comment_id":"10154100383542452","commenter_b":"Possibly the saddest thing I've ever heard... so sorry for your loss","commenter_a":"That is so heartbreaking @username","post_message":"BREAKING NEWS: A woman who was killed when a tree fell on a wedding party at a Whittier park has been identified as the mother of the bride."},{"comment_id":"10154189751584062","commenter_b":"Whiney tail! That's what my mother would have called him. Shame!","commenter_a":"He sounds like he needs a pacifier and a security blanket. ..","post_message":"Garnet Coleman is defending his claims that he felt mistreated during this traffic stop last month, despite what the video shows. Some law enforcement groups are demanding an apology - hear what he has to say about that tonight at 10. You can see video of the entire stop here: @webpagelink"},{"comment_id":"1802927083306226","commenter_b":"Well you got what you wanted...he called Illegal Aliens, \"Guests\" Now wallow in it.","commenter_a":"Only people glad he's gone are the criminals and illegals","post_message":"LIVE VIDEO: There's a new sheriff in town as Paul Penzone is sworn-in as Maricopa County's 37th sheriff after defeating Joe Arpaio in November's election. Arpaio served as sheriff for the last 24 years."},{"comment_id":"10153515139311680","commenter_b":"Hillary already knows she's becoming the POTUS. There's nothing stopping her. We will have a female president! Can't wait. #ImWithHer","commenter_a":"It's just riding off of the success of Bill because nobody likes her","post_message":"Hillary Clinton: \"I’ve told my husband he’s got to come out of retirement and be in charge of this, because you know, he’s got more ideas a minute than anybody I know.\""},{"comment_id":"10154249032461178","commenter_b":"She should be gangraped!","commenter_a":"Is the reverse also true?? Are you fair game if you disagree with my views?? What an idiot!","post_message":"A rapper with a history of controversy says violence against women is OK as long as they disagree with her politics."},{"comment_id":"10153381284694087","commenter_b":"And until tools are in place, ban all Muslim immigration!","commenter_a":"Bubio is a big money lobbyists puppet! Vote for Trump!","post_message":"\"How many attacks on the homeland will we have to endure before the president understands that lawful intelligence tools subject to judicial review are necessary to win the long war against radical Islamic jihadism?,\" Sen. Marco Rubio wrote in a scathing op-ed along with Sens. Tom Cotton and Joni Ernst."},{"comment_id":"801468519888245","commenter_b":"The female judge is pathetic.","commenter_a":"Wow....","post_message":"The cop sexually violating her body is evil enough, and to see the judge's reaction is absolutely chilling. Watch now (WARNING: GRAPHIC): @webpagelink  -Via Filming Cops flashback files."}]
