[{"comment_id":"10153296497591519","commenter_b":"@username No, I kiss your mother with that mouth.","commenter_a":"Racist Republican Religious Lying Christian Coward Party.","post_message":"\"Religions are not all the same, with some being more peaceful than others...\""},{"comment_id":"10154104825566336","commenter_b":"@username so you think the bible is nonsense. You better wake up before you meet your maker. - Bob","commenter_a":"Luke 8:17 What is done in the dark surely will be brought to light.","post_message":"Fox News confirms that a buried knife has been found on what used to be O.J. Simpson's property and is being tested by the LAPD. @webpagelink"},{"comment_id":"10153481286598984","commenter_b":"Let's get this evil son of ? Out of office","commenter_a":"Wake up America Obama has an agenda and he is working it!","post_message":"This DHS agent just admitted the truth about Obama's disturbing agenda... so Obama sent his officials to do something terrible to her DAUGHTER. What do you think?"},{"comment_id":"1116898208348184","commenter_b":"She's the prime example of a \"nasty\" woman","commenter_a":"As if anything this trash had to say matters!! She's disgusting herself!! I mean she's into animals and champagne bottles!! Hello!! Need I say more. Madonna , you're far from a woman if virtue!!! Lmao","post_message":"Madonna slammed Donald Trump, claiming that he 'hates people of Color and Women and is Anti-Semitic.'"},{"comment_id":"10153705912357217","commenter_b":"Morons.","commenter_a":"There needs to be an investigation into the biased remain reporting by the publically owned BBC, a petition is needed to force an investigation by the government that will hopefully result in the breakup and sell off of the corrupt paedophile luvies club and their bully boy licence fee tax collection department too, good riddance!! #ENDBBC!😡","post_message":"EU leaders say the UK must move swiftly to negotiate leaving the organisation bbc.in/euref #BBCShorts"},{"comment_id":"10152756009211051","commenter_b":"Could be..Better than that leaching piece of whale dung..","commenter_a":"You Brits can have her...","post_message":"People in Saudi Arabia are livid with Michelle Obama for one very specific reason."},{"comment_id":"10154400564286509","commenter_b":"Delusional much?","commenter_a":"10 dead so far in republicans terrorist attack on Flint. Where is the justice. The serial killer Governor needs to be put away...","post_message":"\"Our mouths were ajar\": Meet Dr. Mona Hanna-Attisha, the pediatrician who exposed lead poisoning in Flint, Michigan."}]
