[{"comment_id":"10153121325909411","commenter_b":"in ur ass","commenter_a":"White Americans are terrorists trained by CIA to kill people","post_message":"'We are concerned that attacks against the Muslim community are taking place in a heightened climate of Islamophobia and hatred.' - Sabby Dhalu, an organizer for Stand up to Racism."},{"comment_id":"10153910482357464","commenter_b":"We don't need another illegal immigrant running our country!! Vote for Trump","commenter_a":"We don't need another Obama in office be smart!! Vote for Trump","post_message":"Spoke with Hugh Hewitt yesterday on the eve of the Nevada caucuses. You can hear the discussion here: @webpagelink"},{"comment_id":"951958574839238","commenter_b":"These fuckin nazi like pigs make me sick my family came running from this 50 years later now look what the fuck is goin on the fourth reich vultures of america be killing our most loyal friends. Howcome We cant hurt their fukin dogs but they can jus come blast ours away word is bond kill my dogs look the fuck out","commenter_a":"Yanky fuckin cops","post_message":"This video is one of the most cowardly acts you will ever see. The poor dog was scared, ran and hid behind a table, and then was executed by a coward with a badge. The Free Thought Project.com (Y)"},{"comment_id":"1055064891200649","commenter_b":"Time to take them away before she kills them and why you are at it tie her tubes! Not smart enough to have children!","commenter_a":"Well try her in there for five minutes w/0 her iPhone, mirror and other items you know she thinks are indispensable....don't forget, no designer water, either!!!","post_message":"A Virginia mother left her two children unattended in a hot car, with windows rolled up as she turned herself in for leaving one of the children unattended in a hot car while she went shopping last month."},{"comment_id":"10153460362791336","commenter_b":"Trump has Americans interest for once , not what can Americans do for illegals .","commenter_a":"The Silent Majority is COMING OUT FOR Donald J Trump. The PC ERA IS OVER. THE TRUTH ERA IS HERE. Donald J Trump 21st Century Patriot.","post_message":"\"The silent majority is back, and we’re going to take the country back.\" On Saturday, Republican presidential hopeful Donald J. Trump spoke to thousands of cheering supporters in Arizona."},{"comment_id":"733570513458390","commenter_b":"He wants to deport the Hispanics? We need to deport him with his team to Russia since they don't have anything to offer the nation. At least the Hispanics do all the dirty work in this nation.","commenter_a":"Politicians and Corporate thugs and bloated military spending.","post_message":"They're called politicians. The Mind Unleashed"},{"comment_id":"1791974164423219","commenter_b":"@username Mexico has a wall at the south boarder but yet it's all ok for them? They built it to keep the freeloaders out, but it's so wrong for America to do it? Sorry if you want to be over run with illegals go move to Mexico. Otherwise support YOUR COUNTRY FIRST!","commenter_a":"Difference Clinton isn't a racist all Hispanics rapist, murders and thieves. Name one nation that has put a wall to keep a bordering country out. If every country in Europe can their border without a wall so can we.","post_message":"Controlled immigration wasn't \"extreme\" 20 years ago and its not \"extreme\" today..."}]
