[{"comment_id":"10154099546462377","commenter_b":"How about all of us that approve? No one asked me if I approve the transition? Comon, same old story as we heard during the lection!!!","commenter_a":"Awe !! Get used to it .","post_message":"More than of half of Americans disapprove of how Donald Trump is handling his presidential transition, a new Gallup poll reveals."},{"comment_id":"1297356170285821","commenter_b":"But a man still has no say over a woman's body. When men have the capability to carry a baby inside them, I'll gladly have a 3rd and let my husband experience the joys of pregnancy","commenter_a":"I think it is totally acceptable. They get to terminate like it's no big deal and others get to mourn that loss as an actual baby. Win=win situation.","post_message":"'Forcing a woman to pay for a burial after she ends a pregnancy or experiences a miscarriage is not just absurd — it is an unnecessary burden and an intrusion on her personal beliefs.”"},{"comment_id":"10153895371347452","commenter_b":"'@username. Well you are not a very educated woman. I hope you don't reproduce! This world doesn't need more deplorables.","commenter_a":"Really ?! Just because he says vulgar things about women who cares ! And I am a woman! Least he isn't hiding emails or having innocent people killed!!!!","post_message":"Donald J. Trump was caught in a 2005 video making vulgar comments about women. He issued an apology and added, 'Bill Clinton has said far worse.'"},{"comment_id":"928454370547645","commenter_b":"Because only girls can get raped","commenter_a":"I am so glad that I don't have a daughter. I'd be terrified for her in this world we live in. Heartbreaking.","post_message":"'The most disgusting, sickening' gang rape at Spring Break beach party"},{"comment_id":"10154759698326509","commenter_b":"Then no sex allowed","commenter_a":"What if you're bulking","post_message":"You're human, so chances are, you're interested in getting more sleep, having better sex and improving your mood..."},{"comment_id":"936764406358981","commenter_b":"what tits. he was smelling her fart","commenter_a":"'Joe stop staring at my tits, thanks.' ~ Hillary","post_message":"Can you imagine?  Talk about our country going to hell in a handbasket…"},{"comment_id":"10153587762999087","commenter_b":"She's above the law.","commenter_a":"Bloody Hell , Hillar-ious Hellary should have been an evil stand up comedian..","post_message":"Hillary Clinton on dropping out of the race if indicted: 'Oh for goodness, that is not going to happen. I'm not even answering that question.' #DemDebate"}]
