[{"comment_id":"10155637604520354","commenter_b":"BO is merely the `uncriticisable blackface` of liberalism. Hillary is much more evil because she knows what she is doing.","commenter_a":"Obama has a plan....and it's working.","post_message":"This is what Obama calls \"defeating ISIS\"?"},{"comment_id":"10153903407251336","commenter_b":"Her teeth are still loose she can't knaw on a steak... Cheap date. (y)","commenter_a":"She could have easily ducked her commitment, all things considered, but didn't. I gained more respect for Ronda over this classy gesture in the face of her recent defeat and widespread public mockery, than any of her knockout wins. Much love to her and our Armed Forces.","post_message":"UFC superstar Ronda Rousey kept her promise and accompanied U.S. Marine Lance Cpl. Jarrod Haschert to his Marine Corps Ball in South Carolina on Friday."},{"comment_id":"10156951068070725","commenter_b":"Americans will decide not illegals. Get ready for Trump.","commenter_a":"Mexicans all the way","post_message":"WOW! Great poll. Fox News just released their new GOP national poll - THANK YOU AMERICA! Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10155131365895231","commenter_b":"Girl preach!","commenter_a":"She will go when He calls her Home...we've all been on Life Support from our Day 1...","post_message":"Prayers for the Houston/Brown family: Bobbi Kristina will reportedly be taken off life support on Feb. 11th to allow her to pass on the same day as Whitney Houston."},{"comment_id":"10152745228401615","commenter_b":"being lesbian doesn't make them superior... they could easily end up divorced single mothers too.","commenter_a":"Most marriages end up in divorce and children are raised mostly by struggling single mothers. Those mother's present the mother And father role. Having two mothers appears to be a blessing! :) Children need love, structure and room for growth. So, haters just sit down and if you love children so much the foster care and group homes have many of your neglected and abused children waiting to be adopted and loved.","post_message":"Yes, they're both pregnant, but about a year apart..."},{"comment_id":"1339288666111988","commenter_b":"🙄🙄🙄 could have killed thatboy","commenter_a":"@username when @username used to wake us up every morning with his music","post_message":"Peace, love, and coexistence — this Christian man helps Muslims observe their holy month. (via NowThis)"},{"comment_id":"10152884212556636","commenter_b":"I'm just waiting for the first comment to blame the feminazi conspiracy to neuter us poor downtrodden beta males...","commenter_a":"That would be defined as sexist. People are supposed to be interviewed based on experience, education,","post_message":"'Can you wear more make up next time?'..."}]
