[{"comment_id":"1839777972919599","commenter_b":"Ja i steh drauf ❤️","commenter_a":"'@username 😂😂😂","post_message":"yassss"},{"comment_id":"10156586680480354","commenter_b":"Well @username be a man and stop hiding your face pussy","commenter_a":"Harry Truman was reigned back when it came to steel factories and labor unions. Obama needs to be reigned back with infringing on the 2nd Amendment!!!","post_message":"Today Obama destroys the 2nd Amendment.   And it's FAR worse than Americans feared..."},{"comment_id":"10150531763884999","commenter_b":"These tacky foreigners need to leave. Find another city to hide your tax-free money in. Please!","commenter_a":"Jia Ying Kho","post_message":"He may be a 'whale' at the clubs, but he's also spending millions on high-end New York real estate."},{"comment_id":"10155020049345500","commenter_b":"I can see you are a cold-hearted Republican, but are you a veterinarian? Did you ex-ray and scan the dog for injuries? This dog will suffer for this when it ages. You are an evil woman who abuses animals.","commenter_a":"This is ridiculous. I am the biggest dog lover ever and this is blown way out of proportion! The dog is fine!! Geez","post_message":"'DEAR PETA! CHILL!' What else Sarah Palin said in response to criticism after posting a controversial dog photo @webpagelink What's your take?  (Image courtesy Sarah Palin's Facebook page)"},{"comment_id":"1037555982922868","commenter_b":"GB = Greedy Basturds!","commenter_a":"Where does he live now?","post_message":"Tony Blair’s office said there would be “no negotiations” over his fee, which per-minute is higher than the yearly salary of someone on minimum wage in the UK."},{"comment_id":"10153991958186509","commenter_b":"Remember We are talking about illegal immigrants ILLEGALS","commenter_a":"Ricky Martin, go back to singing and dancing. Trump was referring to illegals....illegal is a status not a race. BTW, I'm not a Donald Trump supporter, but I can see the difference.","post_message":"Ricky Martin blasts Donald J. Trump for making 'racist, absurd, incoherent, and ignorant' comments about Latinos. @webpagelink"},{"comment_id":"10153352212341162","commenter_b":"So, Michael 'TheArtist' Louis, what you're saying is- the young man in the meme isn't 'black' enough for you? That only people who subscribe to the stereotypical depiction of how black people dress and behave are 'real' black people? If that's not racist against African Americans, I don't know what is... Smh. And isn't the point of ending racism getting AWAY from stereotyping based on the color of a person's skin? The funny thing is, the meme maker -who is presumably black based on what the meme says- is *trying to* say that white people are racist, when in reality - they have such deeply rooted issues of their own that they didn't even realize their meme was racist against themselves. Start with yourself...","commenter_a":"Looks like she for sent home for having a black date nothing's wrong with her dress","post_message":"TOO REVEALING? A girl was sent home from prom because school officials thought her dress showed too much skin. What do you think?   PHOTOS: @webpagelink"}]
