[{"comment_id":"1044585922265355","commenter_b":"Poor little Marco.","commenter_a":"Senator Rubio, please stop getting in the gutter. Your recent comments make you sound like like you are 5 years old. You are better than that and I am so very disappointed.","post_message":"\"And you know what they say about guys with small hands...\" Marco Rubio said of Donald J. Trump."},{"comment_id":"10153009704367690","commenter_b":"Attention, single ladies. Line starts to the left - lol","commenter_a":"And where did they pick up the Black man? #1 2nd row!","post_message":"JUST IN: Mugshots of some of those arrested in connection with the deadly biker brawl in Waco. Open link to see information on each mugshot. @webpagelink"},{"comment_id":"10155404286440389","commenter_b":"she needs go home shut up and bake pie","commenter_a":"Benghazi won't go away...no matter how many deletes","post_message":"\"A left-leaning agenda won’t get [Hillary Clinton] the presidency – it’s only part of the battle.\" – Doug Schoen, pollster for former President Bill Clinton Question of the Day: Will Bill’s shenanigans hurt Hillary if she runs for president?"},{"comment_id":"10153420675841162","commenter_b":"They should be out in the wild with their mom","commenter_a":"Michelle Papandrea","post_message":"ADORABLE! Take a look at the latest arrival at Metro Richmond Zoo in Virginia: 3 cheetah cubs..@webpagelink PHOTOS: @webpagelink"},{"comment_id":"914583611910394","commenter_b":"Trump is right about illegal immigrants. Our government has committed treason by leaving the borders open.","commenter_a":"Give em a right and then a left upper cut ,don't quit,you have em on the ropes...","post_message":"Hot off the press!"},{"comment_id":"10152752919406051","commenter_b":"She should have spent AT LEAST ONE YEAR IN CUBA.","commenter_a":"I know this might stir up the pot even more, but my sister got gastric by-pass surgery over 10 years ago & has severe health problems ever since, and will have them for the rest of her life. She also has to take a truckload of pills every day in order to make sure she gets enough nutrients so she won't have other health problems from not eating enough. Anyone doing any research on gastric by-pass will find that it's not the solution to weight loss, and in some cases, they're much worse off than before. This woman isn't so fat that she can't lose the weight on her own. The problem is she doesn't want to lose weight. If your \"want to\" isn't there, even gastric by-pass won't be very effective. I personally know 3 women who have had this surgery & they've all gained whatever weight the lost ...","post_message":"This woman says she’s too fat to work, so the government offered to pay for weight loss surgery. She had a different plan."},{"comment_id":"10153824341126955","commenter_b":"Who has a billion dollars for this nonsense? That obscene wealth needs to be redistributed!","commenter_a":"Sure it Berns now but it will itch latter.","post_message":"HILARIOUS"}]
