[{"comment_id":"10153030735456378","commenter_b":"Weather this is true or not I don't know,but one thing I do know is none of us would be in the water if we saw what was swimming around or beneath us!!!","commenter_a":"Hoax","post_message":"REAL OR HOAX? A video showing a great white shark circling a surfer has gone viral... but now, people are questioning its authenticity. What do YOU think? Is it real or is it a hoax?"},{"comment_id":"10153802137316130","commenter_b":"It's almost always a woman too","commenter_a":"How romantic to threaten to blow up a plane full of passengers for your ex-wife.","post_message":"An Egyptian plane was hijacked, and several passengers were held hostage."},{"comment_id":"10153715026934199","commenter_b":"Yup, tell Alaska pipelines are safe.","commenter_a":"you know, a pipeline is the safest mode of transportation.......","post_message":""},{"comment_id":"1017702978286400","commenter_b":"It's a true testament to J.K. Rowling's writing that I can read that passage, and, nearly 9 years later, still feel the same goosebumps I felt the first time I read the book in July 2007. Very sad day today.","commenter_a":"\"Look... At... Me...\" He whispered. The green eyes found the black, but after a second, something in the depths of the dark pair seemed to vanish, leaving them fixed, blank and empty. The hand holding Harry thudded to the floor, and Snape moved no more. \"","post_message":"\"It is an ancient need to be told in stories.\""},{"comment_id":"635686593246783","commenter_b":"@username As much as you might want there to be, there is Nothing wrong with Hillary's e-mail account! Just ask Colin Powell and Condoleezza Rice, who operated the same way.","commenter_a":"if I vote, I want it to count and be counted, that's the promise, Every Vote Counts, well except when Bush was elected","post_message":"It is probably way overdue.  Conservatives Are Destroying Our Future"},{"comment_id":"1030700923658691","commenter_b":"Muslim invaders go back to your own country your not wanted here !!!!","commenter_a":"And just what the hell have you Muslims done to get rid of Isis who hijacked your religion?","post_message":"UNREAL: Dearborn Muslims Protest In Support Of Syrian  And Against  In America  @webpagelink"},{"comment_id":"533708806819699","commenter_b":"All ready know this she part of the problem","commenter_a":"This is no surprise. Have to be living under a rock if you don't know she's muslim. Her relatives are members of the muslim motherhood and muslim brotherhood.","post_message":"An extremely influential American political figure was just exposed to be a Muslim.  This changes everything. Obama isn't even our biggest problem.  Do you agree Islam is a dangerous religion?"}]
