[{"comment_id":"10153550945636943","commenter_b":"No Syrian refugees....NONE!...call the Capitol...1-202-224-3121...follow instructions...Let them know you oppose Syrian refugees entering the U.S.. Took me 2 minutes...EASY!","commenter_a":"No","post_message":"Tom Fitton joins Fox News to discuss the danger Syrian refugees pose to the United States. Do you think Obama should allow thousands of Syrian refugees into our country?"},{"comment_id":"1525021640848139","commenter_b":"Connie your argument makes no logical sense. You can't have it both ways. There are no voter suppression laws. Requiring an id is not voter suppression.","commenter_a":"Where was all your outrage over the treasonous Clinton pay for play entanglements? This page is so ridiculous","post_message":"Trump's not going to like this one bit!"},{"comment_id":"10153724551069641","commenter_b":"I remember years ago being in Saudi and Riyadh was lit up like Vegas and I thought this place could be nice after all.the reality came a few days later when walking down a shopping mall with some other guys and some women who were covered were heading in our direction .They made a miniscule mistake of revealing the smalles amount of leg.Out of nowhere came the \"Religious police\",who started flogging them with sticks for this horrendous \" crime\",.The reality of the country set in for how women are treat and this was one of the many mistreatments of people in general i saw.The dark ages is what describes the country .if that is what helps to eventually lead you to heaven i am glad i am going to Hell!Though back then i had an early insight into it.","commenter_a":"Let them vote, drive and have some say so, that is more powerful than anything you could give them.","post_message":"How significant is this change for Saudi women?"},{"comment_id":"870555189755929","commenter_b":"Fuck that! Teach those fucks the appropriate way to interact with us.","commenter_a":"POLICE=Political.Oppressors.Lynching.Innocent,Citizens.Everywhere.","post_message":"Thoughts?"},{"comment_id":"10154452763505575","commenter_b":"That is bullshit...Rasmussen has Trump ahead of that bitch!","commenter_a":"FOX News just reported that Hillary Clinton leads Trump 48 to 41. Basically, they say Trump has lost 3 more points since the debate. Sorry FOX, but I don't believe your bullshit poll and you can take it and shove it up your #NeverTrump asses.","post_message":"It's Happening! Black Vote SURGES for Trump in last two weeks!"},{"comment_id":"1301581083201877","commenter_b":"This guy is pushing an agenda !!!! Creepy","commenter_a":"Mercy","post_message":"Really? Maybe if Christians had more walls, the Muslims wouldn't have conquered the Middle East and large parts of Europe from the 7th to the 10th centuries."},{"comment_id":"1589692694655762","commenter_b":"Nothing racist about, I have the same problem. Some do not understand us and takes forever","commenter_a":"How can you criticize this? Who actually likes calling those?","post_message":"\"So I called up, under the guise I’m checking on my card. I say, 'Where are you from?' They say, 'We are from India.' Oh, great. That's wonderful. Thank you very much,\" Donald J. Trump said, signaling as if hanging up a phone."}]
