[{"comment_id":"10153961752341037","commenter_b":"Duh, obamacare is funded by government (taxpayer dollars)","commenter_a":"If obamacare is so great, why is it that the clintons & sanders are not enrolled in it?","post_message":"Bernie Sanders airbrushed the complexities of trying to overhaul health care all over again and Hillary Clinton offered a selective reading of her rival's record on gun control in the latest Democratic presidential debate."},{"comment_id":"10154662722072619","commenter_b":"Stupid woman.","commenter_a":"Total anti-semitic bitch; She would march the Jews to the ovens if she could.","post_message":"Swedish FM drew outrage in Israel when she linked the terror attacks in Paris and the feelings of Palestinians."},{"comment_id":"10153948445168812","commenter_b":"you gonna adopt it?","commenter_a":"And for Christmas the pup should be freed from its current owners and gifted to a loving home.","post_message":"A pup from Hardin County, Iowa, got a sweet surprise this Thanksgiving when she was gifted a brand new dog house after living outside for almost three years."},{"comment_id":"10153206045164087","commenter_b":"@username I was just about to say the same thing. How can women support that misogynistic pig? It's baffling.","commenter_a":"America will get more of the same if Carson is elected President! America needs someone like Donald Trump to run this country like a business and bring back jobs, repay our massive debts, negotiate better trade deals, revamp or do away with Obamacare. With all do respect to Dr. Carson, he's not the man for this job. He'll get caught up in the Washington gridlock and America will get more of the same!!!","post_message":"Retired neurosurgeon Dr. Ben Carson has surged by double-digits to within striking distance of GOP front-runner Donald Trump according to the latest New York Times/CBS News poll."},{"comment_id":"692454430859640","commenter_b":"WE have NOT gotten the message!!!","commenter_a":"we got the message a long time ago...when will corporations take care of their responsabilities","post_message":"Gray Whale Dies Bringing Us A Message The Entire World Should See"},{"comment_id":"10152894841766636","commenter_b":"So they should ! Sex with a drunken person should never happen !","commenter_a":"It's funny, you could have had drunken sex over there without fear of prosecution. But if that new law comes in over here in the UK? A guy potentially could be charged with rape even though it was consensual at the time?!","post_message":"RIP Shagaluf."},{"comment_id":"10153225018458352","commenter_b":"Shut yo strong African ass up","commenter_a":"Stevie Ray Dirt this going to be me if you don't hurry tf up ! lmfao jk","post_message":"Strong Black Woman Marries HERSELF Cause She Couldn’t Find A Husband (True Story)"}]
