[{"comment_id":"554226841431375","commenter_b":"Hillary is the dispicable one calling Millions of Americans all kinds of names that do not want her for President . So save all your outrage for Hillary , oh that's right . You hypocrites don't have a problem with Hillary doing it and yourselves as well . Shame on you Debbie and all like you .","commenter_a":"The nasty, inconsiderate, unemphatic comments are disgusting & shame, shame on everyone making them. Hillary has run herself ragged & not surprised she's got pneumonia. Coughing a lot lately. She's exhausted. No wonder. Be careful what you say because it'll come back to you tenfold. #KARMA","post_message":"JUST IN: Hillary Clinton was diagnosed with pneumonia on Friday, her doctor says. The doctor revealed the condition hours after Clinton stumbled while leaving a 9/11 event. @webpagelink"},{"comment_id":"10153906940493812","commenter_b":"Are you American? If your pro bringing terrorists into the country and giving them free benefits like Medicaid etc. while American citizens starve, how about we send a few to stay with you? Wait... I get it... 'Nuff said!","commenter_a":"After all, some Americans do have a heart. Way to go Pres. Obama.","post_message":"\"Apparently, they are scared of widows and orphans coming into the United States of America.\""},{"comment_id":"1203485969759238","commenter_b":"Send her big wampum","commenter_a":"Senator : Thank you.","post_message":"Great news! Yesterday a Texas court struck down the US Chamber of Commerce’s attempt to overturn a new Labor Department rule requiring retirement advisers to put their customers’ interests first. The decision affirms what we already knew: this conflict of interest rule was lawfully enacted and the rulemaking process took the views, costs, and benefits of all the stakeholders into account. Now President Trump needs to follow suit. He should stand up to the Chamber of Commerce — and the armies of lawyers and lobbyists that brought this frivolous lawsuit — and allow the rule to be implemented in April as planned.  Hardworking Americans saving for their retirement deserve to have a retirement adviser who is recommending the investments that are the best for their retirement security, not the ones that let advisers pocket kickbacks and prizes."},{"comment_id":"1170579889643596","commenter_b":"Haha I thought the same thing. She should cover up!!! Lol","commenter_a":"She shouldn't be breastfeeding in public.....she should cover up.......oh wait animals breastfeed their babies out in the open too and no one bats an eye. Sorry just had to","post_message":"Prague Zoo's 24-year-old gorilla, Shinda, gave birth unexpectedly to a baby girl. Zookeepers didn't know Shinda was pregnant; they thought she was just overweight. @webpagelink  Correction: Prague Zoo has not yet released the official name of the baby gorilla. Shinda, its mother, has been living at the zoo since 2001, not 2003."},{"comment_id":"10153990525422452","commenter_b":"Jayleen Guadarrama","commenter_a":"LAPD. Respect the rights of the people.","post_message":"Anti-Donald Trump protesters marched through downtown Los Angeles for hours before LAPD tactical officers blocked in the crowd and began dispersing people in small batches. @webpagelink  The protests were generally peaceful, aside from scattered reports of bottle throwing and graffiti."},{"comment_id":"10153160382606491","commenter_b":"Lauren Kirby","commenter_a":"1577961212219543s","post_message":"\"Amy and I were creatively made for each other,\" Jennifer Lawrence said."},{"comment_id":"1532037343754150","commenter_b":"Forcing an innocent girl to say sorry to China due to afraid of losing a large profit. Good job Communist China and JYPE!! And if Taiwan and Communist China are the same state. Why Taiwan has her own flag, currency, army and diplomacy? And why does her people have the universal suffrage to vote to elect her own president? Why those chinese doesn't have the right to elect their leader directly? A \"small\" state like Taiwan has so many political parties. And A Big China just rule by Communist Party. How good to see democracy and dictatorship really works in! From those I have mentioned and others have talked with. It shows that Taiwan is an independent State. Try show some respect Chinese. Or even China wants to unit Taiwan. They should have guts to take action to invade Taiwan but not by talking those nonsense. And we shall see ...","commenter_a":"Chinese netizens says Lies Obviously is Chinese netizens because she Holding a Taiwan flag Began to attack She","post_message":"Her name is Chou Tzuyu and she is now the focus of attention."}]
