[{"comment_id":"1415709005136234","commenter_b":"And that makes you a sissifed bitch punk your mom is more of a man","commenter_a":"Here is your first lady wanna be conservatives. #REPUBLICANFORSALE #NeverTrump.","post_message":"They REALLY think they have her here. But here’s the thing…"},{"comment_id":"10153533392786337","commenter_b":"You wish you were a woman","commenter_a":"Bruce Jenner has 0 murders. Caitlin has 1","post_message":"MUST SEE MOMENT: Caitlyn Jenner gave a graceful speech while accepting ther Arthur Ashe Courage Award at the ESPY awards..."},{"comment_id":"10154011395049778","commenter_b":"Women get less pay than men so I guess the bill won't be worth the face value","commenter_a":"I really couldn't careless as long as the bill still spends the same.","post_message":"A woman will appear on the $10 bill beginning in 2020, the Treasury Department said Wednesday."},{"comment_id":"10152949754631336","commenter_b":"Being the measles were literally wiped out in the US, it had to come from somewhere else. I propose instead of making us get vaccines, we send all the illegals back to their 3rd world countries! Hence, problem solved! Oh, I'll go to jail before I have the government make me have one.","commenter_a":"I'm old school. I remember when country was more important than individuals. I nor my children COULDN'T start school unless I had my shots. What happened? ONLY in America do we have medicine to prevent sickness and ONLY in America does vaccines turn into a political stance. I voted for so and so because of their vaccination policy. WHAT?","post_message":"'The government believes it owns your body.'  Judge Andrew Napolitano chimes in on the great vaccine debate. Where do you stand on the controversy?"},{"comment_id":"1136613006364478","commenter_b":"He told that woman to 'GO AND SIN NO MORE,' @username. Jesus calls even a single divorce for ANY reason one thing: '... ADULTERY!' ~ JESUS 'THOU SHALT NOT COMMIT ADULTERY!' ~ GOD 'JUDGE YE RIGHTEOUSLY!' ~ GOD ~ JESUS","commenter_a":"Mark 10:10-12 In the house the disciples began questioning Him about this again. And He *said to them, “Whoever divorces his wife and marries another woman commits adultery against her; and if she herself divorces her husband and marries another man, she is committing adultery.”","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"992170134153660","commenter_b":"She is a nasty, vile woman...","commenter_a":"What about the part where it was not illegal to have that information on a private server you could have debunked it as well","post_message":"'Ahead of the #DemDebate, this is the video Hillary doesn't want you to see.' - Reince Priebus."},{"comment_id":"1140315249363924","commenter_b":"Blow these animals off the face of the earth","commenter_a":"If these imagrants can live or vote . Send them all over in middle east to fight for our country , including mexicans. Then see what happens . All of them will leave . Build that wall Donald","post_message":"Muslim Migrants Already Lazy Bums, Veg Out And Drink Liquor All Day on Taxpayers Dime!!!   This is what Obama and Hillary want for America!"}]
