[{"comment_id":"10152902448996680","commenter_b":"Get your Zoloft refilled.","commenter_a":"She is despicable. Trash.","post_message":"The Island nation of Palau gets swept up in the Hillary Clinton controversy."},{"comment_id":"1011665845530135","commenter_b":"Cassandra is a fox!","commenter_a":"She is beautiful, and yes, I think it's a step in the right direction, but she is NOT plus sized! I am a plus sized woman.","post_message":"PLUS-SIZED MODEL: Model Robyn Lawley just became the first plus-sized model to snag a page in Sports Illustrated's swimsuit edition. Do you think it's a step in the right direction for the modeling industry? Or is it sending the wrong message?"},{"comment_id":"10153892633433812","commenter_b":"STFU","commenter_a":"Sex is meant for procreation. If you don't want kids the only sure way is to not have sex. Birth control, even when packaged correctly is not 100% I have had multiple friends become pregnant while properly using birth control. Stupidest reason to sue ever.","post_message":"More than 100 women are suing Qualitest Pharmaceuticals after they say they got pregnant while taking incorrectly packaged birth control pills."},{"comment_id":"10154481877908411","commenter_b":"That's why she gets oaid the BIG BUCKS.","commenter_a":"Same to you and your family. Thank you for your sincerity and hard work.","post_message":"Wishing you all a safe & fun celebration as you ring in the new year tonight. Happy New Year!"},{"comment_id":"10153543758049753","commenter_b":"i hate this bitch","commenter_a":"You should start packing, so your ready when time comes","post_message":"According to Whoopi Goldberg, America will no longer be such a great nation if Donald Trump is elected. She shared this opinion Wednesday on The View where she stars as a cohost. This is what she said: “I’ve always been an American, and this has always been my country, and we’ve always been able to have discussions. And suddenly now it’s turning into, you know, ‘not them, not them.’ And you know, we have a lot of friends whose parents saw this already. They don’t want to relive this. They... @webpagelink"},{"comment_id":"10153659271788132","commenter_b":"Hope they keep her in prison for life!","commenter_a":"White trash!","post_message":"Awful."},{"comment_id":"10155319348083132","commenter_b":"Jesus this is absolutely heart wrenching","commenter_a":"Rest in peace","post_message":"The 21-year-old mom is being hailed a hero for her quick-thinking in saving her newborn."}]
