[{"comment_id":"10153220467940950","commenter_b":"Lets hope for something known as KARMA, mf'r.","commenter_a":"That's so wrong","post_message":"A video showing a McDonald's drive-through worker offering a reportedly homeless man a burger and then throwing water in the man's face is quickly moving through social media waves."},{"comment_id":"930444230329383","commenter_b":"And big SUCK IT to rupert & roger, FUCK the both of ya weasels!","commenter_a":"Awesome","post_message":"The folks over at Fox News had hoped to bully Dish Network into giving their toxic channel the cheap air time it demands, but going into a second week of being banished from the television lineup is only proving that Dish has more clout."},{"comment_id":"633540503462936","commenter_b":"Whoooo so what. It's not like he left guys to die in Benghazi.","commenter_a":"Jesus who cares. How many years ago was it? Too many! I don't care what crap they find out about him, I will still vote TRUMP!","post_message":"Did he or didn't he? Listen to the recordings here and weigh in below: @webpagelink  (CC: Donald J. Trump)"},{"comment_id":"1109196055770108","commenter_b":"@username You have no morality. Also gays shouldnt be allowed anywhere near kids.. its pure child abuse. If they were meant to be parents, then gays would be able to reproduce.","commenter_a":"I thought MLB was about playing baseball, not trying to promote an immoral, sacrilegious way of life!","post_message":"MLB is DYING to get a gay baseball player."},{"comment_id":"10153179631761833","commenter_b":"lots of canadians too,,but they have to do it ILLEGALLY,,,lol..","commenter_a":"The enemy fears us does not matter if they are in Washington or are muslim extremists the end results will be the same. We will protect our 2nd Amendment rights.","post_message":"John Lott: Terrorists can strike anywhere and at any time, giving them a huge strategic advantage.Unfortunately, too many politicians around the world are refusing to admit this.  In the U.S., over 12 million American civilians are licensed to carry concealed handguns.  These Americans save lives."},{"comment_id":"1838073153099439","commenter_b":"Well, she's certainly dum enough for the part!","commenter_a":"But she looks like Hulk Hogan","post_message":"Amy Schumer has been cast to play a blonde doll with impossibly perfect physical proportions...."},{"comment_id":"10153426857830329","commenter_b":"Faketalian !!! Grossest shit ever.","commenter_a":"@username oh my gawd we need to go","post_message":"We all knead this."}]
