[{"comment_id":"1473249136068163","commenter_b":"Men don't walk around campaigning for free the japs eye so why do women do this","commenter_a":"That's bold.","post_message":"Nude York City!"},{"comment_id":"489008974557030","commenter_b":"Our Government has NO IDEA of how many muslims (refugees, immigrants, migrants, legal or illegal) are Already in OUR country!!!!","commenter_a":"Trump","post_message":"Cheney:  think this whole notion that somehow we can just say no more Muslims, just ban a whole religion, goes against everything we stand for and believe in. Do you agree with Cheney or Trump on this issue?"},{"comment_id":"497111050479475","commenter_b":"She's a sellout to her own race, taking everything that white people gave her, and then spews her racist anti white nonsense to make blacks think she actually cares about them.","commenter_a":"She described racism other countries not ours.","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy.  She's the biggest racist we know, and we won't stand for it.  Do you agree Oprah is racist?"},{"comment_id":"10153438111440496","commenter_b":"STFU","commenter_a":"Always 3 sides to a story don't be quick to judge U ppl have no idea how students behave themselves at school unless u worked at schools Unbelievable not saying what that officer did was appropriate I haven't watched the video nor do I choose to Let them finish their investigation u stay out I choose to do the same","post_message":"Video shows a 6th-grade girl at a Texas middle school being grabbed and dropped by a school resource officer. The officer is now on leave."},{"comment_id":"861748160544348","commenter_b":"No, she was a goddamned moron that left it unattended. With a toddler. Gene pool cleaned.","commenter_a":"Those women's groups are worthless. If they had any kind of gonads they'd realize that disarmed women are victims.","post_message":"BREAKING: Michigan Governor Vetoes 'Shall Issue' Gun Bill After Criticism From Women's Groups"},{"comment_id":"10154184964563352","commenter_b":"Melissa..legalizing illegals will devastate black employment..for every available job it will be 150 Mexicans to every 3 blacks...it be horrible for us","commenter_a":"Hes gonna stop illegals from coming taking black jobs..hes gonna kill obamacare fines..wat sensible black would disagree","post_message":"Trump says black Americans 'are going to like me better than they like Obama' – even though the president has 'a slight advantage'"},{"comment_id":"726552340811280","commenter_b":"this female is an ignorant scumbag","commenter_a":"I guess that means yes....","post_message":"I'm not afraid to say these are FAKE TEARS!"}]
