[{"comment_id":"10153979531201680","commenter_b":"WARNING ! NEVER NEVER HILLARY ! America will have a very dark future /nightmare and dangerous as hell if hillary get elected. Note : RADICAL MUSLIMS, ISIS , TERRORISTS ARE PRAYING FOR HILLARY TO WIN SO THEY CAN DESTROY THIS COUNTRY AND YOU. Transcription of Brain Carn’s Prophetic Word for 2016 “What happened in California would become common place in America, and an event worse than 9/11 is coming to America. The Lord says that Islam has a definite problem. They will never shake this reputation of violence from themselves. Even innocent Muslims will endure hardship and persecution in the future and no longer see America the same. @username Muslims are gonna begin to gather to cities, like Dearborn, Michigan, and form new communities that contain the populous of their presence so as to guard the backlash from White Patriotic America. The Lord says that a witch hunt will be ...","commenter_a":"Says he wants to \"drain the swamp\" but brings out all of the old alligators and crocodiles from years ago-Newt, Rudy and Kellyanne Conway, whose husband was an advisor to Paula Jones!!! Listening to Conway is like listening to someone scratching fingernails on a chalkboard-very annoying!!!!!","post_message":"The race is deadlocked despite a Clinton advantage in early voting."},{"comment_id":"10153618006223721","commenter_b":"But it all depends on your reason to carry. Most women who would carry a knife in their bra wouldn't need it because they can normally defend themselves better than most blokes.","commenter_a":"One more place to put my knife! Sweet. Sometimes I like to carry a couple, one in the pocket, one on the necklace and now a surprise bobbie blade heck yes! Though this was certainly a man's idea as no woman would go \"lets put something sharp next to my breasts and have it not be an underwire. This is going to be a selling point for women's active wear.\" When in the high thigh sheath for when I wear a mini skirt coming out? Not all skirts have pockets you know.","post_message":"Activewear with an extra punch. (via Glamour)"},{"comment_id":"1098378433550493","commenter_b":"Gore's win was not robust enough and Bush et al weaseled their way into the White House and blew up the Middle East nearly blew up Roe V Wade - even if you have to hold your nose it will be worse if Hillary loses - people will die, the environment will be further destroyed, social security will be looted. Please reconsider. Fight for a third party after the election or begin now but please don't let Trump win - the pleasure of the spite will not be worth it. Just look at the destruction, devastation, the inhumanity, wreckage of Bush presidency. If Hillary is defeated because of the spite of Bernie people it will be a Pyrrhic victory certainly.","commenter_a":"Bernie, I will follow you anywhere... but I won't be able to vote for HER. I don't begrudge you supporting her... I'm sure there was a lot of pressure to do so as well as strategic reasons. I CAN get behind down ballot progressives though! Love you, Bernie!","post_message":""},{"comment_id":"10153883162778145","commenter_b":"Illegals cannot vote","commenter_a":"she has a point nobody likes having to pay for others but more than 50% of US citizens are on government assistance and probably all of the illegals that's why the democrats keep trying to make it easier for felons and illegals to vote , you know they will vote for the party giving stuff away","post_message":"The profanity-laden video was uploaded to YouTube and has sparked headlines and heated discussions on social media. You can watch it here:"},{"comment_id":"10152768405859032","commenter_b":"Good!! She should appreciate the fact that she got hired & HAD a job!! What a dumb ass!!","commenter_a":"@username talk about #keepingitghetto hahaha!","post_message":"The boss didn't appreciate all those thumbs-down emojis."},{"comment_id":"1891157881114099","commenter_b":"that's something you would need to record lol","commenter_a":"@username this would be something you would do lol","post_message":"Now that's a f.d up prank. #WSHH"},{"comment_id":"1585875914805484","commenter_b":"Yer yer yer no one beleavs it","commenter_a":"Melissa Saucedo","post_message":"She claims Donald J. Trump 'groped her butt' because she 'looked like a younger Melania'"}]
