[{"comment_id":"1139840619402033","commenter_b":"Hey, if he wants them in California, I thonk we should let him have them. While were at it, lets build a wall around California too.","commenter_a":"What a POS he is","post_message":"Even the FBI says they can't propertly vet these migrants..."},{"comment_id":"879835912051831","commenter_b":"I wish her big mouth would go away ; what a disgusting woman","commenter_a":"A message for Rosie. It is one thing for people to think you ignorant and it is another for you to open your mouth and prove it.","post_message":"Tom Selleck is awesome!"},{"comment_id":"10154174664018812","commenter_b":"She's repeatedly called black people, \"Super Predators\".","commenter_a":"It is sad what the Clinton machine has done to such a great man. While Blacks were fighting for equal rights in the '60s. Sen. Sanders was on the front lines risking his life while Sen. Clinton was supporting a white supremacist. Most of my fellow Black American brothers and sisters have unfortunately fell for the Clinton scam and it is going to cost us big time.","post_message":"JUST IN: ABC News projects Bernie Sanders will win Nebraska Democratic caucuses."},{"comment_id":"1341519315888255","commenter_b":"Nice fireplace!","commenter_a":"#TurnOnGreenLightGreenShirt","post_message":"I'm live in my third Fireside Chat to talk about #NoDAPL and other pressing issues important to the 99%."},{"comment_id":"1122482747785208","commenter_b":"Nice fat white chick.....the black man's kryptonire....","commenter_a":"\"He shouldn't be golfing he should be working. How dare he.\" Sincerely, Everyone who didn't care when GW Bush did the same thing while he was in office.","post_message":"WATCH: President Barack Obama sinks 40-foot chip shot on 18th hole while on Hawaiian vacation: @webpagelink"},{"comment_id":"897587366974686","commenter_b":"Please don't speak English again your murdering my language. Just keep speaking Spanish.","commenter_a":"Speak English? Good or bad I'm bilingual BITCH","post_message":"Crazy Racist Old Lady Yells At A Woman For Speaking Spanish At An Ihop!"},{"comment_id":"726384220793520","commenter_b":"Mostly things that happen bad in this country always happen in Texas are with someone from Texas","commenter_a":"That kinda stuff goes on all the time in Texas","post_message":"Terrible."}]
