[{"comment_id":"1031910293529802","commenter_b":"Stick to what u know lady. Some people don't much care for foreigners telling us what US values are","commenter_a":"She's a citizen by a marriage not by birth,besides she is just repeating what she hears loony clooney says","post_message":"DAUGHTER OF SUNNI MUSLIM, George Clooney Wife, Open Borders Activist And British Citizen Says Trump Doesn't Represent \"U.S. Values\""},{"comment_id":"10153107776462377","commenter_b":"Trump 2016","commenter_a":"The American people.","post_message":"Newsmax is conducting an urgent online poll asking Americans who won the 3rd GOP Debate hosted by CNBC. Was it Trump, Carson, Rubio or another candidate? Vote here now: @webpagelink"},{"comment_id":"1212113488867185","commenter_b":"Why is it that the LIBERALS are the one who ALWAYS scream the loudest whenever Voter I.D. is even mentioned let along being considered?","commenter_a":"DESPERATE DEMOCRATS KNOW THEY CANNOT WIN FAIR AND SQUARE, THEY RESORT TO UNDERHANDED AND DEMORALIZING TACTICS!!","post_message":"Libs everywhere were thrilled when Texas' voter ID law was struck down by the courts, which ruled it it was too restrictive. That's when they read the fine print, though...  All of a sudden, liberal jubilation turned to rage and tears."},{"comment_id":"1283029891737480","commenter_b":"It is so embarassing to see some women with such low IQ and/or low self-esteem.","commenter_a":"TRUMP for PRESIDENT...GO TRUMP","post_message":"The crowd cheered."},{"comment_id":"10154290589526323","commenter_b":"On bbc this morning she actually said that she wants europe, keep the pound and still have no borders with the uk!!!! This woman is nuts.....","commenter_a":"If Scotland votes to leave the UK and joins the EU then welcome to the Euro, Schengen and for Brussels to take over your resources like Banking, Oil, Fisheries and Hydro Power! You will become swallowed up and ruled with an iron fist from Brussels with orders and wrapped around a straight jacket..and have a border with England! Fancy it?","post_message":"\"If the Scottish parliament is judging this on the basis of what’s right for Scotland then the option of saying we’re not going to vote for something that’s against Scotland’s interests, that’s got to be on the table. You’re not going to vote for something that is not in Scotland’s interests.\""},{"comment_id":"10153467924781350","commenter_b":"Men like them that way on women.","commenter_a":"U can wear skinny jeans that aren't painted on","post_message":"Don't be a fashion victim."},{"comment_id":"10153325885524087","commenter_b":"Such an ignorant cow!","commenter_a":"Hideous hag.","post_message":"“They can wait if they like until next November for the actual balloting, but Donald J. Trump   was elected president tonight.” Ann Coulter tweeted."}]
