[{"comment_id":"10153345194546833","commenter_b":"Tell this liberal she can keep her money. I","commenter_a":"They just need to come take them","post_message":"The Hill:  Congresswoman Rosa DeLauro is expected to reintroduce the the \"Support Assault Firearm Elimination and Education of our (SAFER) Streets Act\" which would offer gun owners tax breaks for voluntarily turning in \"assault rifles\" to local police departments.    \"Assault weapons are not about hunting, or even self-defense, says Rep. Rosa DeLauro (D-Conn.).  is no reason on earth, other than to kill as many people as possible in as short a time as possible, that anyone needs a gun designed for a battlefield."},{"comment_id":"10156268992405093","commenter_b":"What is it..?...A Witch would go down nice.","commenter_a":"She is just ordinary folk like us. See, she can laugh at herself (not really) and wants everybody to see how much she is like us and SO down to earth. Oh my how have we misjudged her all this time?! What a fraud!!!!!","post_message":"It's just.... It's just too easy."},{"comment_id":"571042013020392","commenter_b":"If this is true, why doesn't every woman in America have problems????","commenter_a":"let them out . turn the puppys loose","post_message":"Every woman needs to read this!"},{"comment_id":"10156715676250725","commenter_b":"Reilly Steidle they're calling for you","commenter_a":"Lauren Lynn","post_message":"MTV is on the search for the next reality stars of the “Real World,” and fans living in the Chicago area have a chance to be a part of the show this weekend. How to apply ----->   @webpagelink"},{"comment_id":"10152889300511051","commenter_b":"Prosecute these fools ASAP!","commenter_a":"Once again this is the reason for the death penalty, see if they would be laughing then!","post_message":"This group ran out of a restaurant without taking care of their bill. When a waitress followed them, they decided to make her pay."},{"comment_id":"10153969418599575","commenter_b":"Mike Carter was it ever great? Living on credit was the way to create happiness, no one is talking about the pitfalls!","commenter_a":"None of the other Candidates are even mentioning Veterans! They have already had 6 Debates. I am going to watch the other channel and vote for Trump!","post_message":"Donald Trump is going to skip Thursday's GOP debate.   “We’ll have an event here in Iowa, with potentially another network, to raise money for wounded warriors,” he said. “And Fox will go from probably having 24 million viewers to about 2 million.”"},{"comment_id":"10152812337251749","commenter_b":"#iAmProudiAmBlack. #MyGirlFriendisBlack bcoz i only wanted a beautiful lady. Make these hashtags go viral and discourage nutty whites around the world who see blacks as apes. Tell them that: #BlacksRuleTheWorld. #ObamaIsBlack bcoz he is a great.","commenter_a":"Then it needs to be made a right","post_message":"\"We have finally ended the debate in this country of whether or not health insurance is a right or a privilege. We think everyone in America has a right to have adequate health care insurance. And the Affordable Care Act gives them that right.\" —Vice President Biden  Watch the weekly address: @webpagelink"}]
