[{"comment_id":"1022890011112195","commenter_b":"well people you all know by now that the illegals are who and what is at the top of being cared for first and they receive what our own Military should be getting as well as the American people our men and women who risk their lives are just a # and after thought and these actions begins with THE PRESIDENT OF THE UNITED STATES who has no respect for any Military or the American people , prayers for all who serve and have served and and fought for this great Country and our freedom and what we stand for we need to clean out the Government offices starting with the WH oval office we need a real man put in that position one that will help America not destroy it","commenter_a":"its in my tat","post_message":"NEVER FORGOTTEN! The voice of the people"},{"comment_id":"10155910391265725","commenter_b":"Take America back. STOP buying crap from other countries.","commenter_a":"DONALD TRUMP: Speaking what everyone is thinking. TAKE AMERICA BACK.","post_message":"Wow, some new and even greater polls-- thank you!"},{"comment_id":"10154392654096509","commenter_b":"Hotel California!!!!","commenter_a":"my prayers ...rest in peace","post_message":"Glenn Frey played guitar and keyboard and took lead vocal duties for the Eagles on tunes like \"Take it Easy\" and \"Tequila Sunrise.\" What's your favorite song from the band?"},{"comment_id":"864428380327492","commenter_b":"Ruth, you're an idiot.","commenter_a":"Just proves they hate women and wish we were their slaves ... can't believe we have to fight for human rights for women still .. please tell me why anyone voted for this disaster","post_message":"Republicans will move to strip all federal funding for Planned Parenthood as part of the process to dismantle Obamacare, House Speaker Paul Ryan said"},{"comment_id":"969099383223240","commenter_b":"Lock her up !","commenter_a":"there were 2 ac130's in Sicily only 2 hours away that would have wiped the attackers from the face of the earth had they been deployed","post_message":"Every American needs to know this before the election!"},{"comment_id":"292042534545715","commenter_b":"Ur so dead and sure its ur bear belly","commenter_a":"It's @username's butt ;)","post_message":"What could it be?"},{"comment_id":"10155998790520294","commenter_b":"No!!! I'll pass on swimming in everyone's pee and who knows what else lol. Germ infestation!","commenter_a":"I want to do this","post_message":"Would you take a ride on this 800 foot water slide? A few thousand people in Akron are!"}]
