[{"comment_id":"10153743354289614","commenter_b":"He doesn't like illegals","commenter_a":"You know TRUMP is mad!","post_message":"BREAKING: Mexico has defeated the U.S., 3-2, in the CONCACAF Cup match at Rose Bowl Stadium in Pasadena."},{"comment_id":"10152619091801636","commenter_b":"Read, stupid cow, before you open mouth: @webpagelink","commenter_a":"Smart people. Never vaccinate your baby!","post_message":"'The UK's anti-vaccination movement is alive and well, and we can't ignore it'"},{"comment_id":"10153768350172452","commenter_b":"It's not when you split lanes... it's when traffic is going about 30mph, motorcycles are going 60, and we in larger vehicles try to switch lanes. A small bike going twice our speed appears almost out of no where.","commenter_a":"We split lanes for one main reason: Safety! In a world with endless distractions, the rear ending of motorcyclist almost always ends up with a fatality.","post_message":"Gov. Jerry Brown has signed legislation that moves California toward condoning the practice of lane splitting, in which motorcyclists drive between two lanes of cars."},{"comment_id":"10154088875521717","commenter_b":"Omg what a pig","commenter_a":"@username read this, what an arsehole","post_message":"The student said she has never been more terrified of being outed than when Milo Yiannopoulos berated her on stage at a college event."},{"comment_id":"10156977022535354","commenter_b":"Lookit that uglyass bitch!","commenter_a":"And here I thought money laundering was illegal. Huh.","post_message":"“Hillary Clinton running for President in 2008, if you’re a foreign oligarch, you can’t give to her campaign, but you can have Bill Clinton give a 20-minute speech for half a million dollars, or you can make a $5 million donation to the Clinton Foundation, and you’ve got access every bit as much as if you had raised money for their political campaign. That’s really what the Clintons have done.”"},{"comment_id":"10156197809660725","commenter_b":"I think you mean deports the illegals","commenter_a":"thank you Donald Trump...for being the voice of and for \"the people\". liberal media and politicians are not used to truth...refreshing to hear you vs the politicians not in touch with Americas condition and needs!","post_message":"An updated POLL tracker (with all polls thru the weekend) reveals I maintained a double digit lead at 34.8%. Not only that, my poll #'s are double that of 2nd place candidate. #Trump2016 #MakeAmericaGreatAgain"},{"comment_id":"1415056648547094","commenter_b":"Blacks should all go to Africa and start a country called \"obamasthan\"... If they want out, get out. The intelligent blacks and whites and Hispanics will help them leave. No US citizenship. Good bye!","commenter_a":"Show me the money!","post_message":"Check out his plan..."}]
