[{"comment_id":"1083743574979986","commenter_b":"nah, bitch. not now.. just getting going :)","commenter_a":"forced depopulation by way of financial and imprisonment threats.. sad..","post_message":"The Australian government will tighten the rules requiring children to be vaccinated in order for parents to receive welfare payments and childcare subsidies."},{"comment_id":"435422649916109","commenter_b":"Look at her scarf. Clearly a terrorist","commenter_a":"Who do you trust these days? Don't call a cop on a cop.FOP same as KKK. FATURNTY ORDER OF POLICE.I see FUCK OTHER PEOPLE.","post_message":"BREAKING: Cop Says He Doesn't Need a Warrant, Forces Way Into Woman's Home  Video posted by Facebook user New York, NY resident Diane Malikah Moomin Pinkston with this caption (Follow The Anti-Media for further updates on this story)  \"Just happened about an hour ago April 9, 2015 2pm they didn't give me their names or badge numbers . They ran like cowards wanting people to do their ob for them and they get paid. they all left without giving me their info. this is what the system allows them to do. And I'm holding the whole system responsible. they keep screwing up n need to pay to make sure this never happens again.\"  Update: the victim of this warrantless search has posted another video responding to this incident: @webpagelink  via The Rundown Live  Full story: @webpagelink"},{"comment_id":"10153929324394586","commenter_b":"WAIT WHY DID HE KILL IT ANYWAY WAS IT HIS TO BEGIN WITH IS HE IN JAIL HE NEEDS TO BE FOR ANIMAL ABUSE HAS The Dodo HEARD ABOUT THIS?!? I CANT BELIEVE SUCH AN INNOCENT CREATURE WOULD BE HURT LIKE THIS HUMANS ARE SUCH IDIOTS HE/SHE NEEDS TO BE LOCKED UP IM JUST SO MAD","commenter_a":"Where is the proof that this specific coyote was killed for the fur? I've witnessed coyotes stalking my dogs while they're in the back yard, and I can't have barn cats because the coyotes kill them. The coyotes get closer and closer to my house every chance they get. I'm all for nature taking its course, but you can guarantee I'm going to protect my pets' lives over the life of a coyote. How do you know this coyote didn't just attack a farmers chickens or livestock? How are you so sure this guy executed this specific coyote for the sake of its fur? I don't think you are. Posting graphic videos for awareness is one thing, but posting a graphic video with the wrong facts is nothing but propaganda.","post_message":"WARNING: EXTREMELY HARD TO WATCH.   Coyotes bark just like dogs when they're scared. Even the coyotes killed for fur trim.   CC: Canada Goose   [via Robert Banks]"},{"comment_id":"1216368028409389","commenter_b":"Allyson the bitch","commenter_a":"Donald the Clown and his Republican surrogates will lose big time !! Only imbeciles will believe he stand by working class Americans","post_message":"I stand for ALL AMERICANS! Deplorables, basement dwellers, I stand for ALL of YOU!"},{"comment_id":"10153904359188717","commenter_b":"@username no. The difference is Michelle has brains and doesn't pose nude like some bimbo.","commenter_a":"He takes the stage and introduces his wife who delivers a plagiarized speech.","post_message":"#ICYMI: Donald Trump's WWE-style entrance to the Republican National Convention last night was epic. Take a look: @webpagelink"},{"comment_id":"10153984611959614","commenter_b":"Walk in front of my car. Karma will get u","commenter_a":"You see how faithful this poor dog is his master was going to kill him.My brother told me one time as he was coming home from work.He saw a little dog on the road this truck purposely hit that little dog and killed him.What kind of animals do we have on the roads.I guess it speaks for it self","post_message":"A heartless driver shoved a dog out of an SUV, then sped away as the abandoned pet desperately scrambled to get back in.   The dog was struck by another vehicle as it chased after the driver on a Long Island road. Incredibly, the canine survived.   Suffolk County SPCA is offering a reward to find the person who abandoned the dog. The driver's vehicle is described only as a dark green, early 2000s Jeep Cherokee."},{"comment_id":"10153290749172426","commenter_b":"Had he handled it the nasty note wouldn't have been left. Women can be shallow. Personally I pay quite frequently but you can't tell me this dude doesn't know how his wife can be...so just handle it.","commenter_a":"Classic husband who didn't even pay for the meal and the wife had to....lmao","post_message":"\"So Jenny, here's a life tip for you from me...\""}]
