[{"comment_id":"10150875072404999","commenter_b":"Why should it always be hush hush? I was told by a lady that '' Your daughter loves to play sports. Make sure she doesn't mention her periods or say it hurts because her coach will kick her out especially in our school district.'' She will still participate no matter what ,but y the taboo?","commenter_a":"All power to her to be able to compete with period cramps.","post_message":"An Olympic commentator turned to Fu Yuanhui, who was grimacing in pain. “It’s because I just got my period yesterday, so I’m still a bit weak and really tired. But this isn’t an excuse for not swimming well.”"},{"comment_id":"1546155322346073","commenter_b":"A Butt Ugly Bitch!","commenter_a":"How sad he is But...wait pediphiles will be the next protected people","post_message":"This is the crux of the problem"},{"comment_id":"480443122154949","commenter_b":"INDEPENDENT WOMEN FOR TRUMP!!","commenter_a":"Saw the Town Hall meeting with you tonight, very on point. I hope people get their heads on straight and vote for you Mr.Trump. Go Trump Go","post_message":"WOW! What an evening in West Allis, Wisconsin! THANK YOU for the incredible amount of support tonight. Everyone get out and VOTE TRUMP on Tuesday, April 5th! We will MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153150465564255","commenter_b":"Because man created god in his image and saw that it was good.","commenter_a":"well one thing it never said JESUS was ethiopian and he was born in bethleham so Jesus 90% chance was not black but i do not see why it makes a difference","post_message":"Why do churches use a historically inaccurate image?"},{"comment_id":"10154316931887654","commenter_b":"it's with the thieves,rapists and murderers! this lady is a witch!","commenter_a":"It's hard to believe that she has enough brain to keep her breathing...........The woman is a grieving mother whose son was murdered by someone who should not have been here. Our borders are sieves because of failed policy and Pelosi says he was a 'law-abiding citizen'???? Where is her soul? Her compassion? Her empathy?","post_message":"Democrat leader sides with illegal aliens over mom whose son was murdered by one."},{"comment_id":"10155111311329170","commenter_b":"Another Crazy Woman, she needs to go away, Far away !","commenter_a":"This woman belongs in an institution. She is delusional. Medicate her and get her out of office. My god.","post_message":"VIDEO: Somewhere in California there's an entire district of people who keep sending this woman back to Washington. Wut."},{"comment_id":"450286948495219","commenter_b":"Jo Jo What ever bitch, I have never called the cops and never will when I wish to commit suicide I'll call the pigs. You are a statist bitch.","commenter_a":"Whats the difference? Police are thugs.","post_message":"Do You Support Our Police Over Thugs?  Comment 'yes' or 'no'."}]
