[{"comment_id":"10154380383764091","commenter_b":"Hoe shut up!","commenter_a":"Thank gawd he is out! Worst president ever. They want to praise the south side of Chicago,but have done nothing to help the killings in the city where they got their start. Turned their backs on them","post_message":"\"You've made me proud. You've made the country proud.\" President Barack Obama gets emotional as he takes a moment to acknowledge his wife, First Lady Michelle Obama. @webpagelink"},{"comment_id":"1755557531334252","commenter_b":"I love how the racist cunt doesn't realize Africa isn't a country lol","commenter_a":"Good. GTFOut. Go to Africa where it's guaranteed you'll have a black president. This half white didn't work out so well.Alec baldwin made the same statement. Liberals whine and cry when they don't get their way. About time to unleash that Trump ttain.","post_message":"\"The View\" host Raven Symone says she's leaving America if a Republican becomes president. Will you miss her?"},{"comment_id":"506386899562882","commenter_b":"@username. Hillary Clinton is nothing but a liar and a criminal. Her whole life is been about criminal activities.","commenter_a":"Hillary will be the next president for sure","post_message":"Donald J. Trump fans in China?  The U.S. presidential candidate who accused China of stealing American jobs also says the \"people from China love me.\"  Is this really the case?  CNN's Matt Rivers is live from Beijing, China, answering your questions and telling us what people think of the U.S. Republican candidate."},{"comment_id":"10154305700931729","commenter_b":"@username STFU you aussie pussy","commenter_a":"God (the real God) does not require one to pray a certain number of times. He's willing to listen at any time!","post_message":"Well, they probably won't do THAT again."},{"comment_id":"10154310787426130","commenter_b":"I'm very disappointed with Meg Ryan. She must be in the pocket.","commenter_a":"Actual, I think Richard Dreyfus won that one (see his tweet at the end of the article).","post_message":"Megyn Kelly set him straight."},{"comment_id":"10153350460578690","commenter_b":"Haha innocent people. You're funny Ceyda. A Muslim living in Germany saying hitler, who is dead by the way, should finish all the Jews. I hope the west wakes up to the problem of you disgusting vermin and destroys you. You have been sent by the devil through your peodo prophet.","commenter_a":"This stupid Israelis how long would they continue harming innocent people Israel is behaving as if even that land is there's forgetting then were also refugees I wish Hitler could finish all jews","post_message":"Anyone who's received a letter has 30 days to leave Israel. If they refuse to leave they will face a hearing to determine their indefinite imprisonment. @webpagelink"},{"comment_id":"10153441968716756","commenter_b":"Then by your logic no couple on the street should be holding hands or kiss, or hug. You can't just say keep it to yourself. That has been the norm for years. They are tired of hiding. They want to be free like you and me. They want to walk down the street holding hands, they want to marry and they want you to keep your personal preferences to yourself.","commenter_a":"I don't care who you marry Just don't shove it down my throat.","post_message":"The briefs against bans on gay marriage come from the traditional allies -- and some surprising ones: small businesses, law enforcement officers and some Republicans."}]
