[{"comment_id":"501432243350902","commenter_b":"The blood will be on your hands when the terrorists and illegal aliens kill American citizens, you child molesting PIECE OF SHIT!!!","commenter_a":"\"ELECTED\" enforcers for the largest criminal organization on the planet.","post_message":"BETRAYAL.  #RINOStampede"},{"comment_id":"1033066763409083","commenter_b":"Maybe we could stop the flow of heroin coming into the U.S.","commenter_a":"To associate with Hillary Clinton, you are an EMBARRASSMENT to the residents of VA and to the military who live and serve here!! DISGUSTING!!","post_message":"I’ve seen firsthand how significant an impact the opioid and heroin abuse epidemic is having on communities and families in Virginia. More Virginians now die from these overdoses than car accidents, and law enforcement currently lacks the tools to save more lives. I’m pleased the just passed Comprehensive Addiction and Recovery Act (CARA) will encourage co-prescribing of naloxone – a life-saving drug – alongside opioid prescriptions and also implements a measure to protect the elderly from medication abuse. I worked with a bipartisan group of colleagues to draft and introduce these provisions. Lastly, while I am pleased Congress was able to work in a bipartisan way to address this crisis, we should keep working to provide emergency funding that is critically needed for state substance abuse programs, law enforcement, treatment and other priorities authorized in this bill."},{"comment_id":"10154378235307061","commenter_b":"ironic since even king himself thought malcolm x was a hack","commenter_a":"I am a white man, but it seems to me that Islam provided to Afro-Americans a system of faith and structure that Christianity failed to do. These people took names of Islamic heroes, rather than the surnames of their owners. Muhammad Ali took stature when he changed his name from Cassius (Roman name) Clay (ancestor white owner?). In America we stand up for who are and what we believe to be right.","post_message":"Malcolm X was killed on this day 52 years ago. @webpagelink"},{"comment_id":"934295046610968","commenter_b":"Run Sarah RUN!! President Palin has a certain \"RING\" to it !!!","commenter_a":"SHE IS OK WITH TORTURE. REMEMBER?","post_message":"When Sarah Palin posted a picture on Facebook bragging about how her son used their family dog as a \"stepping stone,\" she proved once again that animal abuse doesn't bother her at all, and animal rights groups are now slamming her for it."},{"comment_id":"10153748050319255","commenter_b":"Thank you for your service. 🇺🇸🇺🇸🇺🇸","commenter_a":"I am an ex Special Forces Officer and I volunteer to lead The teams that are going to infiltrate Exxon and Shell","post_message":"We can only hope, Karl.  By Daily Kos user Lefty Coaster"},{"comment_id":"1503406889676883","commenter_b":"Are people really this stupid its kinda hard to belive","commenter_a":"She certainly has enablers on her death wish trip. Medical bills should be paid by her.","post_message":"Do you agree our tax dollars should NEVER be used on any of her medical bills? This is unreal!"},{"comment_id":"10154140324537690","commenter_b":"Economically saying no to this is an economic disaster.","commenter_a":"I do live in Arlington. I like the ballpark we got! And really, do you believe in no new taxes?","post_message":"The debut this week of Arlington's plans for a massive entertainment complex to be built around a proposed new baseball stadium is not sitting sitting well with everyone."}]
