[{"comment_id":"918831531585696","commenter_b":"Abd the dems preach tolerance but are hnwilling to be tolerant.","commenter_a":"Democrat,s = cult being lead by a zombie . Set devour America","post_message":"Just in..."},{"comment_id":"935501763157349","commenter_b":"Okay. That's more than a bit much. People shouldn't need to spread theirs legs that much. I wish people wouldn't call it man spreading though. I've seen women do it as well, and the name just sounds offensive.","commenter_a":"Frankly unless they refuse to close their legs to let someone sit next to them this is just stupid.","post_message":"They both spread their legs on the subway, but only one raised eyebrows. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"489292257897396","commenter_b":"As long as yours dangerous people out there with weapons there's no reason to take away mine. If you take away all the guns from law-abiding citizens all you will have left are criminals with guns and there's no way to get all of those guns away from them","commenter_a":"What's the point in saying this every time and never doing anything about it? Of course, more gun control. Giving guns to the general public is fucking stupid.","post_message":"Once again, America needs to answer this question..."},{"comment_id":"1417299944952004","commenter_b":"They are illegal immigrants. Reagan granted amnesty in the 80's and it was to be a one time thing for those already here. Settled once and for all. But they keep coming. And this problem is not just from Hispanics although they make up the majority of inflow. If they couldn't come legally then they shouldn't be here. People have been coming legally for 100 years (like my father and his parents). No excuses. They are breaking the law and need to be deported.","commenter_a":"All he has is big ego","post_message":"Dude! Really??!"},{"comment_id":"1693802114227741","commenter_b":"The towers that Donald Trump built ... Border Patrol endorses you to build that wall too, Mr. Trump ... A BUILDER ... not a destroyer ... of American liberties/freedom FOR POTUS!!! @webpagelink @webpagelink #DONALDTRUMP #POTUS #REPUBLICANPARTY #GOP #2016ELECTION #BORDERWALL #BORDERPATROL #TRUMPTOWERS #PRESIDENTIALPRIMARIES #VOTETRUMP #TRUMPTRAIN #MAKEAMERICAGREATAGAIN","commenter_a":"We have said that for years,They dont need us to protect them anymore.If they do,they pay for it.","post_message":"Changing times call for changing perspectives. I am proud to have started this conversation."},{"comment_id":"10153197426077377","commenter_b":"I like you Ted but I want the migrants to assimilate into the US and the simple fact is the migrants from Mexico and Central and South America do that very well... we are them and they are us... get string borders but work out something so those that are hardworking people who make our country a better place can stay.","commenter_a":"Canada Cruz is an Amnesty supporter.","post_message":"Ted Cruz — \"I think Jeb Bush has been very honest, he's been very candid about his support for amnesty.\""},{"comment_id":"1674844459456494","commenter_b":"Mary Taylor i would have punched the bitch","commenter_a":"Prime example of a child who is never disciplined!!! Always got there way if I throw big enough fit !!!!! Afulenza child !!!!","post_message":"WHO DOES SHE THINK SHE IS?"}]
