[{"comment_id":"10154156813446926","commenter_b":"It is indeed a colony of the US, and it cannot survive without Billions of dollars of aid from their masters. Israelis should decide what future do they want for their children, one in which they are perpetually fighting a war, or one in which they can make peace and learn to live with mutual respect. --- As far as ethnic cleansing is concerned..this is again the same issue. It is only ethnic cleansing when the Jews are forced out of their homes, it is not ethnic cleansing when ZIonist militants throw out Palestinians from the homes they were living in for centuries.","commenter_a":"The way I see it Israelis will be in the Palestinian villages for a long time..... society whose leaders campaign for a convicted terrorist to be given the Nobel Peace Prize, a society that teaches its children hatred and violence as part of its standard curriculum, a society that unabashedly teaches anti-Semitism through all means available, a society that puts suicide belts on children during political celebrations, a society that honors, glorifies and funds terrorists, a society that uses a hateful version of religion to poison the minds of its children, a society that engages in widespread jubilation when Jews are victims of terrorist attacks, is not a healthy society that can develop peace of any kind.","post_message":"#Israel's occupation forces in the #WestBank have used at least three Palestinian family homes as military posts in recent months"},{"comment_id":"10153869230258352","commenter_b":"Wtf? The sorry bitch nees LIFE!","commenter_a":"i think life without parole is better","post_message":"Mom who gave her baby methadone ‘to help her sleep’ and killed her will serve up to 30 years in prison"},{"comment_id":"10153825781392522","commenter_b":"There goes the fake Native American vote!","commenter_a":"Another documented lying Democrat fanning the flames. STFU Pocahontas","post_message":"'We will fight harder, we will fight longer and we will fight more passionately than ever.'"},{"comment_id":"10154344957028753","commenter_b":"'@username so you are ok with building a wall by cutting programs like help Americas like are vets and retired or elderly and poor, like a childrens education, too what build a wall that will no nothing in the end 10 years from now when or if is done, I will not give my money for a wall I rather help Americas, the environment, help kids have a good education, and yes help those illegals trying too become citizen that cant afford too pay 5000 dollars too take a class to become a legal citizen,a wall will do nothing ,ask any Germany how the berlin wall worked for them, most European, middleeast and faeest ppl come tho Canada, Toronto airport is a major gate way too northamerica, why not a wall there, this as nothing too do with topps illegals it has too do with dons ego, he has too ...","commenter_a":"I'm okay with that. I would rather pay for a method to keep illegals out as much as possible, than to pay for their food, housing, health insurance, etc. and also feel the wrath of the homelessness because they invade my husbands profession.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153706069823717","commenter_b":"Best part about this is her age, she's not an 18 or 20 year old like most ad models.","commenter_a":"Oh thank heavens. The world is a safer place.","post_message":"People magazine has named Jennifer Aniston the 'World's Most Beautiful Woman' for 2016."},{"comment_id":"10153302910759087","commenter_b":"But the sheep love the Queen of BS and her Lies, Hillary the evil millionaire theft by deception. and lair","commenter_a":"Carly doesn't back down from a fight. I would NEVER go on that show after that BS. She's a better woman than I!","post_message":"“My message to the ladies of ‘The View’ is, ‘man-up,’” Carly Fiorina said. “The Obama administration, for example, has been bad for women. Planned Parenthood is harvesting body parts. If you don’t like those facts and those messages, than man up and debate me on them. Don’t sink to talking about my face.”"},{"comment_id":"10153590364786409","commenter_b":"What a bunch of caddie women","commenter_a":"Oh I could never stand her....once Regis was gone,so was the show.....","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."}]
