[{"comment_id":"1123835504398528","commenter_b":"Fuck that stupid ass","commenter_a":"You are a complete asshole if you think this is a political issue IS AN AMERICAN issue and every single one of us should have a problem with this!","post_message":"So if we want the truth, that makes us disloyal? Bullsh*t! --Andrew"},{"comment_id":"10155961820435725","commenter_b":"Time for Americans to play the TRUMP card!!! Adios Illegals!!!","commenter_a":"Mr Trump ...the RNC will NEVER give you the nomination .... This is a chance for America to rid itself of the GOP for good... Start a third party... American Patriot Party... A Party of the People!!! If it doesnt work... so be it... You are the only one who can beat Hillary and if you are not the nominee ...she will win.. But at least we gave it a shot... If you dont win...then the GOP wont win!!!!","post_message":"Our online store is officially open! Visit www.DonaldJTrump.com/shop to shop the latest #MakeAmericaGreatAgain merchandise."},{"comment_id":"10154660794741756","commenter_b":"Shut Up Clown!","commenter_a":"If Venus or Serena were caught using this stuff they would have been stripped of everything!! Those double standards.Lol","post_message":"\"If it's not banned, athletes will use it.\""},{"comment_id":"10153929310543037","commenter_b":"Lesbians get their own series since they probably could beat the guys, @webpagelink","commenter_a":"This event is unfair....lesbians have a total advantage. ;-)","post_message":"The event will host 200 teams with 5,000 people."},{"comment_id":"10153174192806694","commenter_b":"Hate-watching is incredibly stupid and masochistic *unless* you're getting paid to do it, in which case I get it. I get why I09 \"hate-watches\" - it's part of their business. But how the hell can someone who isn't getting paid justify it? Lots of bored, boring, aesthetically masochistic, profoundly lonely people looking for attention I guess?","commenter_a":"Stop watching it if it's so bad","post_message":"And the one moment that exemplifies every single problem with the series."},{"comment_id":"10154435925811509","commenter_b":"Stz! Sexually transmitted zombies","commenter_a":"This is it. This is how zombies start.","post_message":"CDC confirmed the first case of Zika virus being transmitted sexually in the U.S. Dr. Sanjay Gupta has been following this fast moving story closely and is here live to answer your questions. What do you want to know?"},{"comment_id":"977484695718405","commenter_b":"You know all this for a fact?? Otherwise move along snowflake","commenter_a":"That was awkward to watch she was looking like she can't wait to get away from him seriously but her face never moves Botox much","post_message":"President Trump and First Lady Melania Trump just shared their first dance at the inaugural ball. @webpagelink"}]
