[{"comment_id":"10152889213814071","commenter_b":"I'm gon die Miranda Hill Allie Lorimor","commenter_a":"Anfal Alkhalaf","post_message":"Listen to your dentist."},{"comment_id":"10153064490042483","commenter_b":"Funny @username nowhere in your meme is there a picture of the woman you would force to become an incubator.","commenter_a":"Conservatives aren't pro life, they are just pro birth. They defund welfare and unemployment programs, don't support universal heathcare, want to deport \"anchor babies\" and so on. They need to stop pretending they care so much for unborn lives","post_message":"\"The federal government and several courts have made clear that a state cannot kick Planned Parenthood out of its Medicaid program simply because Planned Parenthood provides abortion,\" said Susan Watson, executive director of the ACLU of Alabama."},{"comment_id":"1400391526679146","commenter_b":"I was at fort Wainwright... Fucking miserable place no doubt (it was -37 when that pic was taken)","commenter_a":"Thank you for all you do!!","post_message":"I remember hoping I'd get frostbite so my chain of command would get an ass chewing. This is about as miserable as it gets. ~Will"},{"comment_id":"565035256989762","commenter_b":"What would the us do if mexicans where stealing land putting colonies into their land? Only rockets?!","commenter_a":"Military action would be used against a country which sends rockets, terrorists and death into any western democratic country. Why is it unacceptable when the only democracy in the Middle East does it to protect their own democratic citizens? If the vice news offices where destroyed by a Mexican rocket would their be a US reaction.","post_message":"The armed wing of Hamas has vowed to retaliate for the deaths of the two children."},{"comment_id":"10152738013846135","commenter_b":"I didn't even know there were still idiots who thought like this....holy crap. What is WRONG with people?!","commenter_a":"Blacks got their way again!!!!!!!","post_message":"Today's Baltimore Orioles game was the first ever game to be played without fans. It led to some crazy pictures! PHOTO GALLERY: @webpagelink"},{"comment_id":"1030490090346441","commenter_b":"Time to build a wall around Chicago.","commenter_a":"It's white people's fault...or financial disparity, or whatever else they want to blame all their actions on","post_message":"Chicago Black Gang Member Lured Child From Playground And Executed Him Point Blank You mean #blackLivesMatter protestors are not rallying for this 9 year old boy who was executed by a thug! I guess his Black Life Didn't matter @webpagelink"},{"comment_id":"10153229988242293","commenter_b":"And who would that lady be? Certainly not this four times married adulterous who're?","commenter_a":"It takes lady to show the world what TRUE VALUES are; and how STAND UP in those VALUES ...!!","post_message":"Kim Davis entered the Carter County Detention Center under cover of night five days ago. She emerged to Survivor’s “Eye of the Tiger.”"}]
