[{"comment_id":"10153051831985950","commenter_b":"WTF?! I would have knocked that bitch the fuck out if that were my child. And the so called DAD is a piece of SHIT too! They need to light her ass up in PRISON! >:(","commenter_a":"What?! I can't comprehend this... why,,,,","post_message":"Police say a stepmom bullied her now 15-year-old stepson: \"She asked me if I wanted to play the game,\" the boy said. \"And I said no. So then she called me 'punk,' so we did it. We went in the bathroom, she poured a whole bunch [of alcohol] on my butt and then she lit it on fire.\""},{"comment_id":"933475353412186","commenter_b":"Somebody needs to fuck her ass up","commenter_a":"Elisabeth Hasselbeck is a no talent bimbo. She is a racist a bigot and just an unpleasant pain is n the ... Neck! Her claim to fame is that she was on Survivor and clung to an older gentleman who did everything for her and protected her. How is she qualified to open her ignorant mouth about anything political??? Typical Fox bleached blonde snotty witch! Yuck! She was fired from The View because she was so nasty and bigoted.","post_message":"This is superbly offensive."},{"comment_id":"10153150963247483","commenter_b":"I am totally convinced that libs are the only people that post comments on AL.com. Must be a lib ran organization. Oh I forgot, its part of the media!","commenter_a":"Assholes","post_message":"\"In my judgement, with respect to Hillary Clinton, she will be a unique president if she is elected by the public next November, because the day she's sworn in is the day that she's subject to impeachment because she has committed high crimes and misdemeanors,\" Congressman Mo Brooks"},{"comment_id":"10152956267682061","commenter_b":"Congratulations, Ginger!!! We love you in Atlanta!","commenter_a":"Congrats","post_message":"Ginger Zee is pregnant and we couldn't be any more thrilled for her! Same with Lara and Amy Robach! @webpagelink"},{"comment_id":"10154405827009170","commenter_b":"Two evil sisters!","commenter_a":"Goofy the fake indian with Chief \"Lie to your face\" Clinton!","post_message":"Lord help us if we have to listen to these two for the next 4-8 years..."},{"comment_id":"629045897266731","commenter_b":"no - if they want to work, they must follow the rules of the company, not shariah law.","commenter_a":"omg,.... to quote Faye, No more 'political correctness' for me. I am getting tired of this \"FAVOR\" at the expense of the average AMERICAN citizen. ANY business ANY where in the USA that refuses to fly the AMERICAN Flag, that honors false Gods.....will not get my business, Period!!!","post_message":"Home Depot Embraces Shariah Law With ‘Muslim Sensitivity Training’. They are submitting to societal pressure. Do you think Shariah Law has no place in America?"},{"comment_id":"10156605912540389","commenter_b":"They offered it to me!!! What a crock!! We can't have another Clinton in the WH......","commenter_a":"For someone so smart what a waste of a brain. Just greed Is what motivates her.","post_message":"Even the left is calling this one of her worst moments."}]
