[{"comment_id":"10152630732682061","commenter_b":"@username. Its not like she can't afford it.","commenter_a":"One would think that she'd get those awful teeth fixed.","post_message":"UPDATE: Bobbi Kristina Brown moved from hospital: @webpagelink"},{"comment_id":"10152853525740667","commenter_b":"If she needs to step down than Bruce Jenner needs to be a man","commenter_a":" Michelle","post_message":"Last week, Rachel Dolezal's parents said she was born Caucasian and has been deceiving people into thinking she was African American."},{"comment_id":"163756660695086","commenter_b":"She's unbelievable. I swear she better not get into office. WAKE UP AMERICA!!!","commenter_a":"I think Hillary is channeling Marie Antoinette.","post_message":"Hillary Clinton just landed her plane in Nantucket...   Almost immediately after people saw her, this HUGE problem went viral..."},{"comment_id":"10156497004350294","commenter_b":"Looks like we need to start banning vehicles. All of these vehicles just hitting and killing people is unacceptable!","commenter_a":"So sad... prayers for the families","post_message":"The woman and a man were crossing the street when a vehicle hit them. Anyone with more information is asked to step forward:"},{"comment_id":"10156253683750594","commenter_b":"Tickets better get cheaper!","commenter_a":"He got too confident and thought maybe too good and should have stayed a little more humble and kept his head down in his work. But the whole team was over hyped these last two seasons","post_message":"Just three years ago, Colin Kaepernick was considered the prototype for the quarterback of the future."},{"comment_id":"1412807245405968","commenter_b":"Again....she attacks her husbands victims. She's a POS female.","commenter_a":"Says the woman who stood by her philandering husband on numerous sexual misconduct occasions. And then she attacked the women. She is the one who set women back!! I want a much better role model for my daughter.","post_message":"\"When Donald J. Trump says, 'Let's make America great again,' that is code for 'Let's take America backwards,'\" Hillary Clinton said."},{"comment_id":"1424826404224494","commenter_b":"Evil creeps just like their daddy.","commenter_a":"Assholes someone needs to hunt them down !!","post_message":"Madonna just called out Donald Trump’s privileged sons and it’s EPIC."}]
