[{"comment_id":"10153403140121037","commenter_b":"If she looks like that at 65, I want some of what ever she got hahahahaha","commenter_a":"getting paid to be in the media daily ? yeah nervous about something","post_message":"Watch the full video: Katie Couric speaks with Vanity Fair writer Buzz Bissinger and stylist Jessica Diehl about #CaitlynJenner's groundbreaking cover story."},{"comment_id":"1820420311530016","commenter_b":"Feminazis!!","commenter_a":"Again Liberals at their stupidest.","post_message":"Women's protest"},{"comment_id":"1766871976928173","commenter_b":"We have no idea what he's going to do, he's never been given a chance, The Clintons however.....what have they done? Let's see, when in office 1 went on trial for impeachment. The other has numerous investigations against her for treason, putting our national security at risk multiple times, accusations of selling American uranium to Russian companies in exchange for massive donations to \"The Clinton Foundation\" who was soliciting funds to send to the Haitians who were devastated by one of the worst earthquakes in history, yet only received a small fraction of what was raised......and while consumed with sealing her deal with the Russians, neglected action in Benghazi which cost the lives of US soldiers......... So, I don't know what Trump will do, but if I had to pick between the lesser of two evils, I would say you can't get much more evil than that witch who camouflages ...","commenter_a":"We truely don't want him in our state. We have his lil brother John Bel Boma and that is enough. We'll just hold on until Trump wins.","post_message":"Dear Mr. President: How’s the vacation going on Martha’s Vineyard? Pretty swell place for sure. Ocean breeze, beautiful homes, and packed out with America’s top 1% of the 1%—you must be in your element. And golf? I’m sure you’re playing so much golf, you’re getting almost tired of it. But then, you never tire of golf. You just seem to tire of that “Presidency thing.” My neighbors in Louisiana aren’t having it so good, Mr. President. They are underwater—again. Historic floods that have impacted or destroyed 40,000 homes and left thousands of families homeless are sure ruining their hopes for a summer vacation this year. Probably will take away hopes for a summer vacation next year as well. Their once nice homes are now waterfront property. In fact their homes don’t just front the water—they are IN the water and the water is in them. I realize that in the ..."},{"comment_id":"10153055222394877","commenter_b":"Wrong! I've awakened with someone riding on my dick..The dick can get hard without you even knowing it... while you're asleep. Duh. Ever heard of a wet dream!","commenter_a":"Rape is rape, no matter the gender of the rapist and they all should get equal servere punishment. She deserves more than 9 months tho.","post_message":"Mother of 3 arrested for breaking into a man's apartment and raping him while he slept. Grio fam, if she was a man do you think her sentencing would have been more severe? Sound off below!"},{"comment_id":"860254627375604","commenter_b":"So their religion allows that then ? Bunch of fucking cowards .","commenter_a":"Time to nuke the FILTH........when will the uk and America finally stop bowing down to this scum","post_message":"Some women have been forced to seek hospital treatment after violent sexual encounters"},{"comment_id":"10155804568635725","commenter_b":"Tell Andre ignorant ass to just go kill himself!! You never hit a girl you shine!","commenter_a":"Lmao attacking him?? it's a Football f**** player against a girl. Did u not see how she threw that punch lmao how is a grown ass man/athlete gonna look w that argument on court?? Lol and why didn't he leave her alone after she seemed to push him away?? Cuz she said the N word!!! Ha so it all makes sense now!!! Oh my god someone bring the guillotine!!! Not the N word!! Bring all the rappers too!!! This is an injustice!!! Lol","post_message":"Florida State University quarterback De'Andre Johnson is telling his side of the story of the now-viral video where he is seen punching a woman in the face at a campus bar, including what he says the woman said to him right before the attack ----> @webpagelink"},{"comment_id":"10153918675239170","commenter_b":"Incompetent? Really? Jobless rate record low. Economy back on track. Bin Laden dead. Equal rights for everyone. Health care for everyone. I think you need to reevaluate. Perhaps it is the people who you are getting your facts from who are the incompetent ones. And since they're evidently your only source, I'd say you might want to step up your game.","commenter_a":"He's such an incompetent douchbag. 12 more months, thank God!","post_message":"Probably as close as Obama will ever come to actually admitting it."}]
