[{"comment_id":"1165479466892468","commenter_b":"Bitch please","commenter_a":"@username HAHAHAHAHAHA","post_message":" #WSHH"},{"comment_id":"10153339835009087","commenter_b":"Does this apply to Christian refugees too ?","commenter_a":"youtube title; William Blum - CIA murder and torture of Hundreds of thousands of people...use transgenders & lesbians deuteronomy 22:5 man should not wear the headdress of a woman & a woman should not wear the headdress of a man... youtube title; Collapse of Europe and the United States Of America ...vengence is mine say the living god psalms 104:16 of israel who's name is JEHOVAH deuteronomy 32:35 & romans 12:19-21..john hopkins mount sinai nyu medical bellvue hospital fraudulet med scam bill penis breath clinton irish shit god of luck death trap robert & patrick kennedy section 508 mental illness research nazi's... article title; The Clinton Crime Family...vengence is mine say's JEHOVAH the god of israel deuteronomy 32:35..bill penis breath clinton irish god of luck death trap section 508 disability... article title; Willie Lynch letter: The Making of a Slave...bill penis breath clinton great white satan irish god of luck ...","post_message":"“[Refugee children] are indistinguishable from any child in America,” President Barack Obama said. “The notion that we should somehow be fearful of them, that our politics would somehow leave them to turn our sights away from their plight, is not representative of the best of who we are.”"},{"comment_id":"10154384594879705","commenter_b":"@username which of these girls is overweight? What weight should girls be according to you Bill?","commenter_a":"Ten bucks says that all the people saying they're disgusted are the same people who get pissed when someone calls a thin girl 'too thin' because apparently body positivity is only for bodies YOU feel positive about. Right.","post_message":"No photoshop, no frills."},{"comment_id":"10153953096951336","commenter_b":"So according to your logic @username driving home after having a few beers is equivalent to shooting a gun into a crowd of people? Am I understanding you correct? I bet you still believe Marijuana makes people go crazy.","commenter_a":"People who drink and drive should serve prison time. At least a 1to 5 year minimum . And if they kill or hurt someone while driving drunk they should serve life in prison.","post_message":"\"Social media led us straight to this suspect to stop him before he was able to hurt himself or others,\" the Franklin County Sheriff's office said."},{"comment_id":"10153826127084024","commenter_b":"funny how she started all of it and then plays the victim","commenter_a":"With a native name like NO ONE WANTS TO POKE HER TUNA.","post_message":"It’s the latest in a series of Internet “tweetstorms” calling Trump on the carpet for his treatment of women and his insults toward her."},{"comment_id":"10152647999850950","commenter_b":"stupid, stupid girls. can't they read?","commenter_a":"The war on terror is taking our freedoms. The Terrorists are easily winning.","post_message":"A former chief of counterterrorism at the FBI told CBS News that he thinks some young Muslim girls are being lured toward jihad as a way of giving meaning to their lives: \"They are looking for adventure.\""},{"comment_id":"1004815269538226","commenter_b":"No im against the pregnant women always tryna make the world owe them for having sex.","commenter_a":"Pregnant women have too much sense of entitlement I have no pity for the broad Much respect to the cops","post_message":"When Charlena Michelle Cooks, 8 months pregnant at the time, would not tell officers her name right away, they pushed her to the ground on her belly and cuffed her. Video: kiro.tv/BodyCam"}]
