[{"comment_id":"10153751099450575","commenter_b":"get this ass out of office and then let them rape her!!!!!!!!!!!!!","commenter_a":"Yup!!!!! a little common sense, people....she's the leader of Germany...Oh , sorry, look at the leader of the U.S. He's not smart enough to pick up on this.....well I think he is smart enough , but he's on a fast track to destroy america, so, it can do that!!!","post_message":"Now she admits it after she already destroyed Germany. . . ."},{"comment_id":"10154061542714411","commenter_b":"\"Hey, Jews are getting their own country, let's all go be our typical fuckhead selves and try to butcher them all.... we'll need a name, someone go digging around and come up with something while I strap a bomb to my kid\" (The founding of Palestine).","commenter_a":"O God!!! hahahahahaha...Ignorant Mr.MP...","post_message":"Letters matter"},{"comment_id":"938657176211868","commenter_b":"Who is she ?","commenter_a":"DAN, Dumb A N","post_message":"\"While MSNBC may believe that I am worthless, I know better.\""},{"comment_id":"10153297983721336","commenter_b":"I lean liberal and I agree. Fine the companies that hire illegals. Tax all employees, legally here or not, the same. If their legal papers expire and they are still here deport them and fine the company a shitload","commenter_a":"The answer is real simple. Enforcement of employment laws. Fine, and, if necessary, arrest those who employ illegals. Along with jobs get rid of freebies. They won't stick around for long with no jobs and no freebies.","post_message":"\"I think up until now, you can say, 'well it's in the hands of the courts.' But at a certain point it's not going to be and you're going to have to answer.\" – Charles Krauthammer"},{"comment_id":"1891107191121894","commenter_b":"America America God shed His grace on thee!!!!","commenter_a":"seems like a funeral more than a parade","post_message":"We're live from President Donald J. Trump's Inaugural Parade:"},{"comment_id":"1141907219179950","commenter_b":"So, she won 3rd and 5th place. So much for any supposed advantage she's supposed to have by having been born biologically male. She was beat by naturally born females.","commenter_a":"We're all equal so we must all be equal physically right? Yeah no.","post_message":"“What happened to protecting naturally born females?”"},{"comment_id":"1027413480657895","commenter_b":"Cause he wanted to, yall white people ready to see a brother arrested","commenter_a":"He has already turn himself in people are so stupid","post_message":"UPDATE: The brother of the man identified as a person of interest in the downtown shooting tells NBC 5 his brother has nothing to do with the shooting - in fact he said his brother handed his gun over to officers when the shooting happened: @webpagelink"}]
