[{"comment_id":"1311876355490031","commenter_b":"These people should be locked up in cages. We have to be a voice for these poor animals. Set them Free!","commenter_a":"China don't care about shit","post_message":"Tourists take selfies with him"},{"comment_id":"1797648893800416","commenter_b":"Women's bathrooms have in closed stalls get over it.","commenter_a":"I don't do business with Target anyway","post_message":"In the wake of Target's decision to allow men in women's restrooms and changing rooms, the hashtag #BoycottTarget has exploded across social media and trended as high as #1 on U.S. Facebook..."},{"comment_id":"2070583743040341","commenter_b":"Go Back to your own Country!!!","commenter_a":"What scum is voting these things into office?","post_message":""},{"comment_id":"10153101680026336","commenter_b":"Muslim Terrorist","commenter_a":"Andreas Lubitz is not a muslim but a terrorist","post_message":"LATEST: #Germanwings co-pilot Andreas Lubitz appears to have kept evidence of an illness from his employers, including a doctor’s note excusing him from work the day he crashed an Airbus A320 into the French Alps, prosecutors said. @webpagelink"},{"comment_id":"1107945392631847","commenter_b":"Even though the Stupid bitch cuts my sandwiches diagonally.","commenter_a":"Bernie is in my dead pool. Die Bernie... The sooner the better!!!","post_message":"Here's actor Mark Ruffalo and director Matthew Cooke on why Bernie Sanders is the right candidate at the right time. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"444684015719892","commenter_b":"killing over a pizza.. one less tax payer.. those black thugs aren't too worried about their welfare checks these days","commenter_a":"They need to be stabbed to see how it feels than shoot","post_message":"Where are the rioters?"},{"comment_id":"10154289456551336","commenter_b":"No it wouldn't be. It's encouraging to see females that still want equality, rather than superiority.","commenter_a":"It's a dress code, then she should be sent home. Would this still be a story if a man was sent home for not wearing a tie?","post_message":"Dress code violation or sexism?"}]
