[{"comment_id":"10152908270740927","commenter_b":"Forced motherhood?! Are they frigging kidding me?! Nobody forced them to have sex unless they were raped. So stop with the ridiculous posters!","commenter_a":"Just who is forcing these women to get pregnant? No one is forcing \"Motherhood\". Try and show some responsibility if you are going to have sex.","post_message":"It's no surprise that Satanists support Planned Parenthood, but what is SURPRISING is how they showed that support ..."},{"comment_id":"10154438030826336","commenter_b":"Fat lesbians...","commenter_a":"Disgusting that Chick Fil HITLER would laugh about genocide.","post_message":"Celebrate #CowAppreciationDay at Chick-fil-A!"},{"comment_id":"1250923198278313","commenter_b":"Another add payed for by the Clintons","commenter_a":"What happened to the American people deciding who will represent us. I'm so tired of this political old timers dictating our path","post_message":"“[Donald J. Trump] is a dangerous demagogue completely unsuited to the responsibilities of a United States president.” - Bruce Kovner, who has donated nearly $3 million to the Republican party"},{"comment_id":"10153178842572061","commenter_b":"Give me a break!!! I do NOT want her as a role model for my daughter!!","commenter_a":"So it's for self gratification and not to improve our country? Gotcha Hills. Now go away.","post_message":"Hillary Clinton starts of debate by saying: \"For me, this is about bringing our country together fathers will be able to say to their daughters, you too can grow up to be president.\" abcn.ws/1R9qmZ2"},{"comment_id":"10154060269921162","commenter_b":"BANG...! that's all","commenter_a":"Two things that are impossible... To rehabilitate a terrorist or a child molester. Both should be shot on sight...","post_message":"DISTURBING: Thousands of digital images that show children as young as 5 years old engaging in sex acts with adults were found in an Indiana man's home... @webpagelink"},{"comment_id":"10153946533833797","commenter_b":"Iam glad this guy grew some and told the girl to take a hike","commenter_a":"Love this! No one comes in between me and my little fur babies! 💜","post_message":"PET PEEVE: They always say a dog is man's best friend. And this guy is really proving it. One man chose his beagle when he was faced with the “it’s me or the dog” decision. More on the ad here:"},{"comment_id":"10153177506232885","commenter_b":"Scumbag whore.","commenter_a":"Unwhite Bastards.","post_message":"At a complete loss for words right now! This is absolutely disgusting and an abuse of the right to free speech!"}]
