[{"comment_id":"1065968390113738","commenter_b":"William Tryon WOW...totally makes sense NOW, 10 Celebs Moving that Already Own homes in Other Countries, In Exchange FOR LUNATIC Trump Promising TO Send OUR KIDS to WAR...Excellent Logic!!! NOT!!! Our Country is Not A Business For Trump To Practice HIS Failures ON--IT'S OUR COUNTRY!!! MoonStruck \"SLAP\" Snap Out Of IT!!!! Trump has Infected Our Country With IGNORANCE The Worst EPIDEMIC! Trump Rising! DID the Hiel Hitler Salute On National TV for the World TO SEE..Disgusting!! VOTED For TRUMP & Got KIM JONG UN & Porn Star.... WWIII-- DO WE Want ALL Our Kids To Get Drafted Into A Greed WAR for Trump!! THE Epidemic in Our Country by OUR OWN Citizens Addiction TO Porn, Drugs & Human Trafficking is a Major Problem IT Comes By Boats, Planes, Trains & Automobiles CUT the Consumption Solve The Problem that Huge Problem. MEDIA Has Attached ITSELF TO Trump's BOOB because MASSIVE Orange ...","commenter_a":"Another reason not to vote for Ted Cruz. #Trump2016","post_message":"“The only guy who can beat [Donald J. Trump] is Ted Cruz.”   Breaking News: Carly Fiorina has endorsed Ted Cruz for president."},{"comment_id":"661665720654565","commenter_b":"NOT NO BUT HELL NO!!! SEND THEM BACK WHERE THEY CAME FROM!!! ANOTHER PLANET!!!!","commenter_a":"No.","post_message":"The Obamas are celebrating 24 years of marriage today. Are you proud to have them in the White House?"},{"comment_id":"496464583811469","commenter_b":"we are not picking on her because she is a women!!!!!!!!!!!!!! Get that straight right off! we are stating that she has a very long line of a shady past, and if you people dont get your head out of the sand it could very well damage our country more than what we can correct. She will never get my vote, already saw her in action and it was not a pretty site.","commenter_a":"I can't believe how mean and cruel people are!!! It's sad. Hillary is not perfect, no one is!! She has made mistakes just like all the other presidential candidates. Every person that has run for President and every President in the White House has made lots of mistakes. Everyone picks on her because she's a woman!!!!! I'm thinking seriously about voting for her.","post_message":"Trump says Clinton is a woman abuser who would be a horrible president. Agree or disagree?"},{"comment_id":"10154570112539497","commenter_b":"*grandma hands me a $10* \"Go get yourself a cup of coffee!\" \"Grandma, this is a $10...\" \"Then get yourself 3 cups of coffee!\"","commenter_a":"Jennifer Ann Winchester","post_message":" don tell your parentsthis is just between you and me. Good boy."},{"comment_id":"1615282505444662","commenter_b":"@username, I get that. I don't think that that's any more serious than foreign interests pouring money into a specific candidates election fund or even the main stream running a biased smear campaign to try and get \"their candidate\" elected. It all needs to be stopped.","commenter_a":"So the Russians hacked the Dems servers and released their emails. So what. What does that have to do with Trump? The main stream media was trying its hardest to influence the election for Hillary. Had she won, would people be calling for an investigation of that?","post_message":"So: Shep Smith just called out Donald Trump's lies about Russian election interference on Fox News. \"It was brought up before the election. Over and over and over again.\""},{"comment_id":"1288527907860500","commenter_b":"Melissa these manhating proabort feminists don't get the concept of responsibility","commenter_a":"As early as 9 weeks the baby in the womb has all the same organs as you and I but in an earlier stage of development. He/she has a head, ears, nose, eyes, arms, legs, heart, brain, lungs. So tiny and so beautiful. Denying his/her humanity is denying science. Denying a human being his/her rights is against a concept of civilized society.","post_message":"Isn't life precious?"},{"comment_id":"1289659341093811","commenter_b":"So someone stole a car that means they deserved to get raped? Sickening","commenter_a":"But you stole and you went to prison, perhaps you shouldn't steal so that you can practice your transgender in your house","post_message":"Horrifying.  (via Daily Mail Australia)"}]
