[{"comment_id":"547425292114717","commenter_b":"She needs to be exposed for every crime she has committed and she needs to leave her campaign so she can face charges for every one of those crimes!","commenter_a":"Oh! Bet me!","post_message":"Hillary is officially paying the price for all the crimes she has committed.  Awesome. She is a criminal.  Can we get 10,000 'LIKES' for Hillary getting arrested?"},{"comment_id":"903785579812018","commenter_b":"OH BUT HE'S BLACK HE DON'T KNOW NO BETTER.SHIT HANG HIS ASS","commenter_a":"So sad","post_message":"She was shot down in cold blood and there were never any riots. This was a tragedy, and she will never be forgotten. Can we get 10,000 'LIKES' in her memory?"},{"comment_id":"10158325140525725","commenter_b":"Yea !! Thank god that I wouldn't waist my time on those losers !!","commenter_a":"If they gave them to me I wouldn't go !!","post_message":"Looking to get out of last-minute Christmas shopping or away from your in-laws? Then Saturday's Chicago Bears home finale could be your answer."},{"comment_id":"1082137365131066","commenter_b":"So yeah, drug addicts can just stop for a few days to pass a test...yeah no, sorry that isn't how it works.","commenter_a":"Anyone bother reading the article? '..recipients (of welfare) choose the day and time of the testing..' This is how it's done in all these examples and *THAT* is why there was only one person that failed. Most drugs are out of your system (and won't show on a dipstick test) in less than 48 hours. Do *RANDOM* drug screening like I have to do for my job. No advance notice, just get here now and pee in a cup. See how many fail then.","post_message":"There are stereotypes and there is reality. Welcome to reality."},{"comment_id":"10152888529356051","commenter_b":"Well that's where becoming a mature adult comes into play. He's had three children with more than one woman not married to any of them not stable himself there for you get what you get. Young people and old people to please stop having babies you didn't plan for it. You didn't save for. And you can't afford. Whether or not the mother works as a relevant because at this point she didn't get herself pregnant and cant. Guys wrap it up put on a raincoat run the rubber road or better yet stop treating sex as an entertainment videos. Stop having sex with all these women and not looking at the big picture tell you don't drive your car without a spare so don't live your life that way be prepared","commenter_a":"my son is a father of 3 girls, he pays so much child support that he cant afford to live himself, by the time he gets paid and all the child support comes out he has any where from 20 to 30 dollars to get in through the week..He cant afford to by food, just barley has the money for gas to get back and forth to work with, while in the mean time, the mothers get $500.00 a month in food stamps, don't have to work, They live off of his money, he cant get food stamps because he makes too much..well if they seen his check after everything comes out, then they would see what he is going trough. The laws needs to change..make these mothers get out and work.Cut out the food stamps because the mothers are selling them just for the money..","post_message":"This man has gone without food for days because of all the child support he owes. There’s one big problem with this."},{"comment_id":"1442259229136366","commenter_b":"tell me what he lied about?","commenter_a":"Trump has NEVER had a alcoholic drink in his life ,you idiot.","post_message":"His Fakeness speaketh."},{"comment_id":"559381210853585","commenter_b":"You only opt in because the choice is an illusion. Who reads the terms and conditions on anything online these days? Very few. I haven't thought of a solution re advertising, and the way things are going its only going to become more intrusive. The advent of neuromarketing is already upon us. The introduction of the 'reactions' facility on FB not excluded.","commenter_a":"I would try and read the enclosed article but the bombardment of ads, some obscuring the text, in the first 10 seconds put me off.","post_message":"Hint: it has nothing to do with preventing terrorism."}]
