[{"comment_id":"470081979849049","commenter_b":"Sure try take away all our guns but let the criminals still have them way to go","commenter_a":"Terrible First Lady","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153319556628352","commenter_b":"She's got meth face.","commenter_a":"Fuck y r sum moms like dat not fair for children they deserve better","post_message":"Mother arrested for child neglect after her young daughters traveled barefoot trying to sell their toys door to door as she slept"},{"comment_id":"10153253749121800","commenter_b":"Heard this on 98 rock on way to work....halliarous!","commenter_a":"Masoud Jalali","post_message":"\"To be clear, a guy on CNN just said, 'Hey, if people are looking for news, I'm sure they can find it somewhere.'\" -- Jon Stewart"},{"comment_id":"10153207458909135","commenter_b":"Cindy- don't conern yourself with the three blind mice","commenter_a":"What lies are you planning on telling today? How are those donors and polls coming along?","post_message":"On the radio with Laura Ingraham now. Listen live here: @webpagelink"},{"comment_id":"1023152674374447","commenter_b":"This woman is nuts","commenter_a":"She's dumber than a rock.","post_message":"We asked the DNC Chair if her children were human before they were born. She gave a shocking answer..."},{"comment_id":"545668025630703","commenter_b":"Lock her up...","commenter_a":"Mrs @username President 2016 Women had no rights to vote. Just see how far women has come. Pervert Donald Trump discriminate women and abuse them sexually and when they dont give in. he trash talk them what sick beast he is. If this pervert wins you women becomes his slaves Vote for Freedom Mrs @username President 2016","post_message":"A note on Director Comey's letter, from Hillary for America Chair John Podesta. Chip in now to say you're standing with Hillary: hrc.io/donatenow  \"By now, you've probably heard some news about a bewildering letter sent to Congressional leaders by the Director of the FBI. This is all a bit confusing, and much of the reporting has been misleading or downright inaccurate, so I want to take a minute to walk through this.   Here's the quick backstory: In July, FBI Director Jim Comey concluded a year-long investigation by deciding not to go forward with any case about Hillary's emails. It wasn't even a close call, he said. In his words, 'no reasonable prosecutor' would have brought charges.  Yesterday, in a surprise to us all, Comey wrote a very strange letter to Congress that was long on innuendo and short on facts. He said that in a completely separate investigation, the FBI had found some emails that may or may not be related to Hillary, and indeed may or may not be significant at all.  It's being reported that Comey sent this letter over the objections of Department of Justice officials who told him that it was inconsistent with longstanding policy of both Democratic and Republican administrations not to take action that might impact an election. It's an unprecedented intrusion into a close presidential election with less than 11 days until Election Day.   Voters deserve answers.  Comey needs to come clean with the American people about what he found and answer all the questions about why he took this unprecedented step less than weeks before the election.  Here's what this changes for you and this campaign: Absolutely nothing.  The facts be damned—Trump's always shown a complete disregard for the truth. In spite of there being no new information, he's already raising money off the bizarre letter (he literally sent a text message asking for money within an hour of the story breaking!) and he's more fired up than ever on the trail today.  These are the actions of a desperate man. Trump knows he can't win on his character, temperament, or his policies. He's behind, so he'll cling to whatever he can. We can't let him get away with this.  Our organizers and volunteers on the ground are rallying behind Hillary in what will be the biggest volunteer weekend of the campaign so far. You need to have her back, too. You need to say you're not willing to let Trump bully or buy his way into the presidency, and you're not going to let anything stop us from making history.  There are ten days to go. Let's buckle down, stay focused, and win this. Chip in here: hrc.io/donatenow\""},{"comment_id":"483277565194949","commenter_b":"Jesus wouldnt like that she kills babies for a living.","commenter_a":"So sorry you folks are tearing this young woman apart, would Jesus do this?","post_message":"What'd you think, folks?"}]
