[{"comment_id":"10154064678631336","commenter_b":"@username I won't vote for trump ! I will support the other republicans !","commenter_a":"Donald Trump understands better than anyone why the country is so much in decline. He understands how our politicians have sold us down the river with trade deals that benefits other countries and lines the pockets of foreign lobbyists who give away our wealth and jobs for their own gain. This is why the Establishment hates and fears Trump so much. Our country is 20 trillion dollars in debt because of all the corruption by both sides that are owned by the same people. Trump understands that if we do not get a wall on the border we will lose the country. Because all of the over 12 million illegals in this country are going to vote DEMOCRAT once some RINO or liberal gets into office and gives them Amnesty- THAT will mean the extinction of the Republican party and we will become a third world socialist nation. The Establishment ...","post_message":"“The lessons of 9/11 are being forgotten by a lot of people. And that is: A human condition elsewhere matters to our national security.”  Do you agree with former President George W. Bush? @webpagelink"},{"comment_id":"796156163908294","commenter_b":"Yeah and make all those fat bitch bags move to another country","commenter_a":"No one watching it anyway put whoopi on a plane","post_message":"'The View' Made THIS One Fatal Mistake, And Will Likely Be Shut Down Because Of It  Good. Get this liberal trash off the air. We've had enough.  Would you be happy to see the View get thrown off the air?"},{"comment_id":"636990926431695","commenter_b":"Let her go to a country that enforces Sharia law and see how she really likes being beat.","commenter_a":"She is insane!","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"668184586705453","commenter_b":"Yes ; has been, is, and always will be!!! She is truly an ugly American.","commenter_a":"Nice eyebrows, plucked clean and then painted on............banchee","post_message":"Michelle Obama wants to destroy Halloween for kids across America.  There is no chance that we will let her take Halloween away from our kids.  Do you think Michelle Obama is a joke?"},{"comment_id":"10154164610665796","commenter_b":"These people aren't here illegally...","commenter_a":"they dont need our help if there illegal except for a plane ride back to were they came from so they can do it the right way","post_message":"The state plans to end its part in the resettlement of refugees, who have fled war or persecution, on March 4.   The full responsibility for resettling refugees and overseeing federal money for refugee services is expected to shift to Catholic Charities Maine."},{"comment_id":"10153441041876037","commenter_b":"She was living a lie by her own choosing. Time to clean it up.","commenter_a":"When her tan started to fade did anyone ever think she looked a bit less black?","post_message":"In a resignation post, the civil rights activist vows to fight for “what is right and good in this world.”"},{"comment_id":"1055171694505347","commenter_b":"If that woman is not tortured in hell eternally, then God does not exist... and let me TELL YOU something. He does.","commenter_a":"Where is Russia's outrage? Where is this woman now?","post_message":"Horror in Moscow: Woman in burka walks streets carrying child's severed head..."}]
