[{"comment_id":"10154205810731179","commenter_b":"Ah misogynist women are the *best*.","commenter_a":"Don't flatter yourself lmao. Look at his wife 😍😍","post_message":"#WomensMarch"},{"comment_id":"10153596201678984","commenter_b":"Absolutely Support him. He has every right to refuse and shouldn't be forced to preform a same sex marriage if it's against his beliefs!!","commenter_a":"I am supporting the judge who didn't marry the same-sex couple. If gays and lesbians demand justice they also should let those who differ in thought the same right to practice what they believe instead, of trying to force someone to commit something that goes against what they belief..","post_message":"This judge's response has him in hot water. You'll be surprised when you learn his background, then when you see who stepped in for him -- you'll be even more surprised. A totally backwards scenario from what you'd expect... Do you support what this judge did?"},{"comment_id":"1233646523418790","commenter_b":"The filthy parasites must get the fuck out of the US","commenter_a":"Both my Great Grandparents immigrated , assimilated, learned English, no gov assistance, raised big families and loved this country for the opportunities & freedom it afforded them. We deserve the right to help those who earn the right to be Americans , but not those who come to take, hate, criticize and try to change America to suit their needs. JFK had it right .. \"ask not what your country can do for , but what you can do for your country \". Our Vets need first consideration when we spend our tax money... ! It's about time to help those who honor this country !","post_message":"Just when you think Trump can't do any better he implements policy like this one that puts AMERICANS FIRST! SHARE & LIKE if you think immigrants should never receive welfare! @webpagelink"},{"comment_id":"1015872441856793","commenter_b":"She needs to be shown the door","commenter_a":"Go to mslsd with Rachel Madcow. Starting to look like her anyway.","post_message":"Is this the end of Megyn Kelly on Fox News?"},{"comment_id":"545444305663576","commenter_b":"She will kill the U S A","commenter_a":"MORE LIES!!! Her horns are really showing out! Gggrrrr","post_message":"Hillary Clinton says that Donald J. Trump's idea of making \"America great again\" is code for \"let's take America backward.\" Thoughts?"},{"comment_id":"10153790561559407","commenter_b":"Eco tourism is the answer to the local economy of these communities, not hunting animals into extinction. Man has done enough damage to Africa. The west needs to stick it's hand in its pocket and spend the money to educate them and show them how to diversify their economy so they don't need to rely on sports hunting. It's not sport to hunt and kill these beautiful animals.","commenter_a":"The UN should encourage all nations to make it illegal for their citizens to go to Africa and hunt the Lion or any other African wildlife.","post_message":"A small victory for the king of beasts:"},{"comment_id":"10154362784109062","commenter_b":"❤️","commenter_a":"Praying for the family...","post_message":"A heartbreaking loss for a family after a 14-year-old boy collapsed and died after school in Cleveland, Texas. Hear from the mother about how the teen is being remembered on KHOU 11 News at 6."}]
