[{"comment_id":"889040704452119","commenter_b":"I'm outdone. The babies can't even sell Girl Scout Cookies in peace!","commenter_a":"Smh. .","post_message":"“What Did I Do Wrong?” 9-Year-Old Girl Shot While Selling Girl Scout Cookies With Sisters"},{"comment_id":"10153735329829205","commenter_b":"Fuck clinton and her globalist allies","commenter_a":"Come on Loretta lynch meets bill Clinton on the Tarmac before the Benghazi report. See the movie 13 hours in Benghazi please don't tell me that every person in that movie was lying about what happened that night. There was no reason why they all resigned? Like you yourself said maybe technically they did nothing wrong but morally ? And who was to blame ? And what happened after ? And let's not forget the laugh. I would never vote or defend the Donald but let's not call a word on cnn anything but spin for Hillary. They have not even reported on the so called technical issues with the voting errors or for what went wrong with Nevada. Seriously do you honestly think that your viewers cannot see through your crap when you are crapping too ?","post_message":"Michael Cohen is one of Donald J. Trump’s top advisors, an a lawyer. He may have just committed libel against Hillary Clinton."},{"comment_id":"1164072160294870","commenter_b":"Did I hurt your feelings Harvard? Suck it up Nancy","commenter_a":"No I don't want you out of the White House I want you in prison he's a lowlife scumbag Obama you're just as bad as Hillary Clinton prisons too good for you I think you we voted a terrorist to run our country. U scumbag","post_message":"Yes!"},{"comment_id":"1651699668460485","commenter_b":"The deficit has no real meaning re the economy. Look it up.","commenter_a":"A big not for 8 years. What a great vacation they have had. Our country has gone to crap. Glad you enjoyed it. The only thing I have left is change in my pocket.","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"1229522020425442","commenter_b":"I don't know about everyone else but I still think she looks good without make up.","commenter_a":"She's so beautiful! Why would she want to cover up that face? Who would, if they actually thought about it?","post_message":"\"Just a little concealer next time.\""},{"comment_id":"492953910886489","commenter_b":"I don't feel sorry for her. She had the right to marry four times. Fuck that bitch hope they fine her into poverty and hope she gets her ass tossed by a big butch inmate","commenter_a":"just give her a different job already","post_message":"Are you angry at the anti-gay clerk? Us too. But we also pity her."},{"comment_id":"10153613317153132","commenter_b":"Lovely woman","commenter_a":"magnifique Augrey","post_message":"\"I didn't know she was a movie star. She always looked at my father like he was the center of attention.\""}]
