[{"comment_id":"10153071601427434","commenter_b":"Some black women are hot","commenter_a":"You KNOW it was provable, terrible, and criminal when the nearly all white, all male jury found him guilty. Even they were horrified enough.","post_message":"A jury has found Daniel Holtzclaw guilty on 18 of the 36 charges he faced for allegedly assaulting at least 13 black women. He faces up to 263 years in prison."},{"comment_id":"832375306811018","commenter_b":"Fire her, is this what she is teaching kids? She need to teach the prisoners not the kids!","commenter_a":"What an idiot teacher, she should be suspended and never get anymore money !!","post_message":"An elementary school teacher has been suspended for having her 3rd-grade students write \"get well\" letters to an inmate convicted of killing a police officer. What would you do if your child was in that classroom?"},{"comment_id":"1096493903701292","commenter_b":"suck republican dick, thomas! asshole!","commenter_a":"conservatives will go nuts in: 3, 2, 1...","post_message":"More than time to recognize that Black Lives Matter and there are too many incidents of police officers who believe otherwise."},{"comment_id":"1001149379923298","commenter_b":"Watch out folks, she will give you the evil eye!","commenter_a":"HillbillyHillary at the Arkansas Pig festival,stumping for votes","post_message":"The video Hillary doesn't want you to see. This could sink her campaign! [Watch below]"},{"comment_id":"1558222467532092","commenter_b":"Oh, oh. Is this were the Kiju come from?","commenter_a":"And what will happen if we try and remove it? It will cause all kinds of movement in the earth's crust - aka DEVASTATING EARTHQUAKES!","post_message":"It's as much as 1,000km down, a third of the way to Earth's core."},{"comment_id":"10153792306655329","commenter_b":"Love watching this grossness!","commenter_a":"Tom Genaway","post_message":"jlskjerssjklrjsl"},{"comment_id":"1851627945062122","commenter_b":"Rosie would hate it if her wife has a pic out there like Melania's and she were compared to other lesbians, just saying","commenter_a":"Rosie lacks any semblance of class... what a hateful, mean thing to do. Thank you God that Trump is our next president! This left wing ugliness is hard to take..","post_message":"OUTRAGE...! Rosie O'Donnell TWEETS naked photo of Melania Trump when comparing her to other First Lady photos. WARNING: Nudity. @webpagelink"}]
