[{"comment_id":"1430637223901951","commenter_b":"Does anyone think she is intelligent or this helps the women's cause?","commenter_a":"I'm sure her mother is very proud.","post_message":"Classy!"},{"comment_id":"963078257120853","commenter_b":"She's an ass","commenter_a":"Idiotic.","post_message":"Hillary Clinton says allowing 10,000 Syrian refugees is a \"good start\", but she wants to bring in 6 TIMES that number."},{"comment_id":"1014316725248091","commenter_b":"Sondra, you sound like someone who doesn't know what she is talking about. For many women PP is the only place where they can get cancer screening. PP provides birth control. How dare you assume that you get to make the health decisions for even a single person. Shame on you.","commenter_a":"Mr. Bera, the real \"consequences\" of ending funding to PP would be an end to PP altogether..they should be brought to justice for their depravity and disregard of the law by selling baby parts-- we taxpayers have been funding them TWICE OVER for years and are sick of their lies are many other reputable womens health centers you know all of this but are afraid to vote your conscience.I'm really ashamed of you..and if you are a pyhsician as you claim, you are not a humanitarian nor a normal human being.","post_message":"As one of the few practicing doctors serving in Congress, I understand the real consequences ending federal funding to Planned Parenthood would have for patients. That’s why I stand with Planned Parenthood and will not vote to defund it. We need to keep politicians out of the exam room and instead work together to make sure women have access to preventive health care → @webpagelink"},{"comment_id":"10154738132201037","commenter_b":"everything she does is fake.","commenter_a":"Sounds fake to me. She'll have to sue me to I guess.","post_message":"The suit alleges Kim Kardashian West was victimized a second time when the website reported that she faked the robbery and lied about the assault."},{"comment_id":"1065131623520589","commenter_b":"R.I.P.","commenter_a":"Awwww, RIP, Al","post_message":"RIP Al from Happy Days. He passed away on Friday at age 96."},{"comment_id":"10153847208137894","commenter_b":"Bitch get your pasty ass on with that lie. What personal struggles has to do with you utilizing the word??? White people are full of shit bc whatever was said she meant it. They love to come back with a weak ass apology as though that changes anything. I love it when they make an ass of themselves or get fired bc it shows them that that so called white privilege isn't paying off like they want. Well opps dumb bitch your bad.","commenter_a":"Miss 'm y ass ..bullcrab","post_message":"Miss Teen USA Apologizes for All of Her N-Word Tweets, Blames Them on ‘Personal Struggles’"},{"comment_id":"10152930337971749","commenter_b":"Gramma Cankles will NEVER be President...","commenter_a":"Can't wait for Hilary. All the brain dead idiots heads will explode.","post_message":""}]
