[{"comment_id":"10153779454116336","commenter_b":"She's a snake!","commenter_a":"Shes all done for now, goodbye Hillary","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."},{"comment_id":"10154136218409384","commenter_b":"She's just the best, go home to your expensive home and shut up...","commenter_a":"Everyone should see the damage that democrat loal gov't can do.","post_message":"It was my privilege to call to order House Democrats' hearing on the Flint Water Crisis. In an American city, thousands and thousands of children have been drinking and bathing in poisonous water for more than a year. It was not an unavoidable natural disaster. It is a man-made catastrophe. Now, thousands of children are at risk of lifelong damage from lead exposure – unless we help get them the care, attention and resources they need. We have a responsibility to help the people of Flint tell their story – and to be sure that story is heard loud and clear in the halls of Congress. The story of Flint challenges the conscience of America. It holds lessons and warnings for communities across the country."},{"comment_id":"1012656692115433","commenter_b":"Is it a female? Lord have mercy she's dog ugly","commenter_a":"Racist woman","post_message":"Apparently Whoopi doesn't care if the DNC rigged the system.  Why? Because it's against a white guy. #DNC2016"},{"comment_id":"886020504921859","commenter_b":"You are right Mary the bitch owes Haiti","commenter_a":"Shut it down.. take some of the millions and help Haiti which some of it was supposed to be used for. Then rehire ALL NEW PEOPLE IN THE VA HOSPITALS AND HELP OUR VETS. some of those people are the rudest uncaring and unhelpful people around hire enough to take care of the vets so they don't have enough to wait so long for appointments etc. Help Americans for God's sake.","post_message":"Hillary devastated after finding out this about her foundation.  It's all coming crashing down.  Do you think the Clinton foundation should be shut down?"},{"comment_id":"1150086235078889","commenter_b":"Hillary Clinton for President!","commenter_a":"This guy.....God help us all if he's elected!!!! Gary Johnson!!!! Love how he talks about jobs when he's notorious for trying to break up unions and has his own clothing line made in China!!! l","post_message":"WATCH LIVE: Donald J. Trump holds rally in Florida"},{"comment_id":"533721010147110","commenter_b":"Or maybe we should learn from history instead of repeating the same mistakes over and over. Illegal immigration didn't work out too great for the Native Americans. Has illegal immigration worked out for any culture? We all have a set of keys for our lives, hence I believe we all can agree on a measure of security. I say who comes into my home, you say who is allowed into your home. We can decide on who we let into our community. I wholeheartedly welcome people wishing to be an American. I am against the culture of Islamization and separatists who don't value American principles or agree with our civil rights. There are many different developmental frameworks: Republics, Monarchy, Communism, Islam, etc. Islam is an entire framework of religion, social, economic, legal, political, and military standards which is completely incompatible with American laws, Bill of Rights, and the principles I ...","commenter_a":"I believe this is a good moment to revisit Donald J. Trump policy on going after the families of known terrorists. Seddique Mateen supported the Taliban. His son Omar Mateen should have been deported already. Trump Fan Network get the word out. Donald J. Trump will institute policies to prevent these tragedies. Furthermore, the laws designed to go on the offensive for this threat should be a mix of \"aiding and abetting felons\" with counter-terrorism.","post_message":"The FBI interviewed him twice in 2013 and again in 2014, but determined he was \"not a threat at that time.\""},{"comment_id":"10153857256601051","commenter_b":"Learn how to spell, dumb bitch","commenter_a":"This will happen more and more, as Obama has made the back lives matter a protected class! Waite to the refugees start! As they will be a protected class also! All the while Obama is trying to disarm the law bidding citizens!","post_message":"Eight teens trapped a teen gold in a home, held her down and sexually assaulted her. But that wasn't enough for them."}]
