[{"comment_id":"376409252547369","commenter_b":"She is a looser","commenter_a":"THUMBS DOWN!! Pitiful excuse for a human being. Hard-working Americans don't get $112,000 in benefits. THIS IS SO WRONG. Stop the money and see what she does.","post_message":"One more Welfare Moocher..."},{"comment_id":"10156001387100354","commenter_b":"I would prefer you be hung, Stabbed, set on fire, tar and feathered, AND THEN DECAPITATED. SAD THING, Americans NEVER GETTING WHAT THEY WANT OR NEED!","commenter_a":"How do so many of these guys have zero brains when it comes to breaking the law. They are truly brain dead about this!","post_message":"How, again, did this guy break into the top 10?"},{"comment_id":"10154962501399609","commenter_b":"And I love Mexican women too.","commenter_a":"This will bring in more money for our economy and more jobs to the US and lessen our trade deficit with Mexico. The demand for US products will go up and continue to stimulate our economy. Finally, we have a president making decisions that loves Americans and his country.","post_message":"JUST IN: President Trump wants to pay for the border wall by imposing a 20 percent tax on imports from Mexico. @webpagelink"},{"comment_id":"557086307813348","commenter_b":"AHHAH u need a matching one","commenter_a":"@username one for mal","post_message":"That pose though"},{"comment_id":"1748645152080208","commenter_b":"heck ya we need a woman in the white house","commenter_a":"That's what I'm talking about Clinton 2016","post_message":"BREAKING: NBC News projects Hillary Clinton as the Democratic presumptive nominee. Read more: @webpagelink"},{"comment_id":"1842076306034200","commenter_b":"But the opinion of a lying, misogynist, braggart like Trump is worth listening to ? Some people . :-(","commenter_a":"Worst acceptance speech ever Be appreciative of the award. Nobody watches the Golden Globes to hear your multi million dollar opinion","post_message":"WOW! Meryl Streep just brought down the house at the Golden Globes..."},{"comment_id":"10152869461365927","commenter_b":"\"kill another Fetus now, we don't like Children anyhow\"","commenter_a":"If Republicans supported an organization that murdered 90,000 black babies last year OMG. PP would be the worst place since the death camps of the Nazi's. But godless \"Demon\"crats like Hillary are the true racist as they use PP as a form of population control to keep black birth rates down and the black population under control. Dems have always been the party of hate(KKK) and division, they still are they have just convinced the black race that they are their friends and supporters,,,,, really","post_message":"Planned Parenthood Director of Research Melissa Farrell makes STARTLING statement about dissecting aborted babies ..."}]
