[{"comment_id":"10153973401955329","commenter_b":"Steven David buy me this!","commenter_a":"Mallorie PaigeBusby Jonathan Busby lol","post_message":"I'd much rather be sleeping right now."},{"comment_id":"10154650140738984","commenter_b":"Lol Thomas.. I always look for that very same sticker.","commenter_a":"They could have lost their job after they bought the car. That also could be their groceries for the month. When I worked at Walmart I would see carts like that and see that a lot of people would buy their monthly groceries at one time. So if you broke the cart down into 4 it really wouldn't be that much.","post_message":"This man noticed a difference between his cart and one in front of him in line at the checkout. What he saw next is royally ticking off Americans everywhere."},{"comment_id":"470896363098657","commenter_b":"That's called free speech in Obama America. Sad. I would love to see them meet their maker. Hell is going to be a busy place.","commenter_a":"They will do anything to RUB their ideas into our faces. If your part of this just keep it in your bedroom(house). Enough is enough.","post_message":"This is INSANE!"},{"comment_id":"10153476732498132","commenter_b":"She can't sing or act....","commenter_a":"She's still hotter than Kim Kardshian and she has talent.","post_message":"She must be a magician with double-sided tape. #MetGala"},{"comment_id":"1833287473397659","commenter_b":"Its being kept running by immigrants as it has, its a shortage of money and a deliberate government policy to ruin the NHS so all the Tory dirctors of private health care can ride in and cherry pick the best parts and leave a dead carcass for the rest of us to fund.","commenter_a":"It's simply because the government has closed too many hospitals. That's the only reason.","post_message":"Worst NHS week in 15 years"},{"comment_id":"10152858693731336","commenter_b":"And those countries don't have 30 million illegals and a lazy spoon feed group like we do either!","commenter_a":"No one had actually spoken to a Canadian. They have to wait in hallways for a room. They go to Mexico for medicine and dental. So how is it better. Trust me I have dealt with a lot of them who come to the US to get care. This information comes from the Canadians themselves because they purchase travelers insurance from various American Insurance Co so they can come here. If you have not lived in Canada don't talk about their healthcare you don't know about it.","post_message":"What could a Republican alternative to ObamaCare look like? “We could try freedom for a while,” Sen. Rand Paul said."},{"comment_id":"10154071183936336","commenter_b":"#obamaville #EVILislam #muslimBrotherhood. #NOmoreDemocrats #SouthCarolinaForTRUMP!","commenter_a":"There is either more to the story or it's the usual Obamma admin ways.","post_message":"\"After acting to protect a child from sexual assault from an Afghan commander, SFC Martland was punished and could be kicked out of the military at any time,\" said Jay Sekulow, of the American Center for Law and Justice."}]
