[{"comment_id":"10153571769331545","commenter_b":"She prolly can throw baseball better than you","commenter_a":"@username hope I look half as good as her if I make it to 105!!!","post_message":"She's 105 and about to make you smile!  Her story: @webpagelink"},{"comment_id":"10153467696365736","commenter_b":"This is Florida were talking about... the question of \"Consent\" is irrelevant. As the boys will simply plead that they were standing their ground!","commenter_a":"If you can't \"consent \" to having sex with an older person, you should not be able to consent to sex trafficking...","post_message":"The 15-year-old girl was a sex trafficking victim for two years, her mother says. At issue is whether she was capable of consent."},{"comment_id":"10153477334723984","commenter_b":"She doesn't care , she just wants the money,","commenter_a":"Go die you ugly whore what a fucken disgrace","post_message":"Pop star Miley Cyrus just said something highly disturbing about Christians. It's especially sad when you consider where she came from..."},{"comment_id":"10153072865096717","commenter_b":"She would get beat down","commenter_a":"I'm not surprised. The only person she gets along with is Q-Tip, and his single greatest contribution was a cameo on the Dave Chappelle Show where he told kids to \"do the VD dance.\"","post_message":""},{"comment_id":"872299812875772","commenter_b":"Hillary is spreading disgust. She's a shameless, pathological liar with no morals at all.","commenter_a":"She is a complete idiot as well as a liar.","post_message":"Hillary Clinton says Donald J. Trump is spreading fear. Thoughts?"},{"comment_id":"10153278165616336","commenter_b":"Put down the assault fork and nobody will get hurt!","commenter_a":"Ummm.. Say what fattie? You can't handle food ownership.","post_message":"\"Americans do not seem to be able to handle gun ownership in a way that permits maintenance of a civil society.\""},{"comment_id":"1470713222988421","commenter_b":"Typical British woman. No morals, no values.","commenter_a":"Is this worthy of a news item? I think not.","post_message":"She text him the picture weeks later after not seeing him again"}]
