[{"comment_id":"10153332076309411","commenter_b":"Remove NATO from their borders","commenter_a":"Russia must stop being aggressive by removing all warships, and submarines, from international waters - these waters belong to the US and its allies, even though they are international :)","post_message":"The 'hunt' is on"},{"comment_id":"10153536791141717","commenter_b":"Stupid, dumb BITCH!","commenter_a":"I guess she never met Alexander the Great.. lol","post_message":"A gay man could never be a \"warrior.\""},{"comment_id":"10154306785891130","commenter_b":"Hillary's crimes against women will get the best of her.","commenter_a":"Bush was 33, Trump was 59, its easier to fall and be impressed by a rich man at that age Trump should have act like the grown up. Trumps ego will get the best of him yet.","post_message":"But Donald J. Trump is still a presidential candidate."},{"comment_id":"10153283527870950","commenter_b":"This BITCH makes me sick","commenter_a":"She should be treated as she treated this poor child.","post_message":"The 11-year-old girl's cousin told investigators that the young girl had a medical condition that caused her to lose control of her bladder and bowels. A family friend said the woman was upset that her daughter had the condition, and liked to keep the house spotless with bleach."},{"comment_id":"10156221727930389","commenter_b":"#Trump2016forPRESIDENT Build that Wall !! Make America Great Again is the only one running to can get the job done a Strong Leader ... carson is no-way President Material","commenter_a":"I am still voting for #TRUMP because he enforces the laws and is paying his own way and does not want a salary he is working for what is right for the American People","post_message":""},{"comment_id":"10153043162846130","commenter_b":"@username do us all a favor get a vasectomy","commenter_a":"You could skip the asking your boss to buy it for you and just buy it? Saved you a step. :)","post_message":"“Ask your doctor if birth control is right for you… then ask your boss if birth control is right for you.\""},{"comment_id":"10153501091738690","commenter_b":"Afgan want peace but usa want target killing of muslims.","commenter_a":"Afghan was peaceful peoples. Bu when usa attack on afghan they become defender and now usa and others calling terrorist. Shame on you.","post_message":"At least 17 policemen have been killed in Afghanistan's Helmand province after \"hundreds of Taliban fighters\" attacked the police compound, officials said. @webpagelink"}]
