[{"comment_id":"1103535999742651","commenter_b":"she is at best...an annoyance...go home and look for russia...","commenter_a":"I spent ten years in the military just got home three years ago been through all sorts of problems and have been diagnosed for ptsd and through everything that's been going wrong since I've been back I still never not once didn't have control of myself even when I caught my ex-girlfriend of six years sleeping with a coworker of hers she started seeing when I was on duty.I just asked her to I'll say made her move out. And every brother from the core I was at salute President Obama and there were over hundred of thousands of us there so don't believe what people are saying here about the military disliking President Obama we salute you sir.","post_message":"“What did I say that’s offensive? I don’t regret any comment I made, because I didn’t lay PTSD at the foot of the president.'  - Sarah Palin"},{"comment_id":"10154978304691037","commenter_b":"How many more horny female teachers will yahoo report?","commenter_a":"Another ungrateful millennial.","post_message":"The 29-year-old will serve two years behind bars."},{"comment_id":"10155066289616336","commenter_b":"'@username is a dumb pussy","commenter_a":"Can't wait to hear!! PA deplorable here","post_message":"President Donald J. Trump has announced Judge Neil Gorsuch as his nominee for Supreme Court of the United States."},{"comment_id":"1532037343754150","commenter_b":"Forcing an innocent girl to say sorry to China due to afraid of losing a large profit. Good job Communist China and JYPE!! And if Taiwan and Communist China are the same state. Why Taiwan has her own flag, currency, army and diplomacy? And why does her people have the universal suffrage to vote to elect her own president? Why those chinese doesn't have the right to elect their leader directly? A 'small' state like Taiwan has so many political parties. And A Big China just rule by Communist Party. How good to see democracy and dictatorship really works in! From those I have mentioned and others have talked with. It shows that Taiwan is an independent State. Try show some respect Chinese. Or even China wants to unit Taiwan. They should have guts to take action to invade Taiwan but not by talking those nonsense. And we shall see ...","commenter_a":"Chinese netizens says Lies Obviously is Chinese netizens because she Holding a Taiwan flag Began to attack She","post_message":"Her name is Chou Tzuyu and she is now the focus of attention."},{"comment_id":"1172654749497442","commenter_b":"I don't get the talk of someone 'forced' on us . She has millions more votes , sorry but except in the final Presidential election (ala 2000) the person with the most votes wins .","commenter_a":"Screw @username","post_message":"The numbers are revealing a slow but steady climb for Hillary Clinton"},{"comment_id":"10152934239186336","commenter_b":"If O had a son!! Hold the phone he would have to be heterosexual!!!","commenter_a":"Home grown terrorist!","post_message":"A former taxi driver from Virginia has been added to FBI's list of most-wanted terrorists."},{"comment_id":"10154156813446926","commenter_b":"It is indeed a colony of the US, and it cannot survive without Billions of dollars of aid from their masters. Israelis should decide what future do they want for their children, one in which they are perpetually fighting a war, or one in which they can make peace and learn to live with mutual respect. --- As far as ethnic cleansing is concerned..this is again the same issue. It is only ethnic cleansing when the Jews are forced out of their homes, it is not ethnic cleansing when ZIonist militants throw out Palestinians from the homes they were living in for centuries.","commenter_a":"The way I see it Israelis will be in the Palestinian villages for a long time..... society whose leaders campaign for a convicted terrorist to be given the Nobel Peace Prize, a society that teaches its children hatred and violence as part of its standard curriculum, a society that unabashedly teaches anti-Semitism through all means available, a society that puts suicide belts on children during political celebrations, a society that honors, glorifies and funds terrorists, a society that uses a hateful version of religion to poison the minds of its children, a society that engages in widespread jubilation when Jews are victims of terrorist attacks, is not a healthy society that can develop peace of any kind.","post_message":"#Israel's occupation forces in the #WestBank have used at least three Palestinian family homes as military posts in recent months"}]
