[{"comment_id":"10158183422455594","commenter_b":"What message are you sending? That nutty women can run around dressed as vaginas and cry out for the \"right\" for women to kill their innocent babies? Some message from you silly chicks.","commenter_a":"Funny how the negative comments are posted predominantly by males. Do we make you nervous and uneasy? Good. You should be nervous.","post_message":"Crowds went berserk for the big-screen actress as she waxed poetic in R-rated language on women's rights and the perceived threat the new administration poses to those liberties."},{"comment_id":"884338575001603","commenter_b":"Good Riddance to Hillary Clinton!!!","commenter_a":"It's about damn time!","post_message":""},{"comment_id":"10153728879938701","commenter_b":"Ugh, that's her opinion.....she is free to say it.","commenter_a":"President Obama please stay in DC.. We do not want to hear about your stupid gun control. You are NOT welcome in Oregon. You only care about One thing and that's you.","post_message":"JUST IN: President Obama will meet privately with the families of Umpqua Community College shooting victims on Friday."},{"comment_id":"1025373750832154","commenter_b":"@username, nope, not voting for her, either.","commenter_a":"The Trump train is full speed ahead. Get on board the Trump train. You will get run over. It is full speed ahead to making America great again. Mr. Trump for president 2016!!!!","post_message":"America is proud to stand shoulder-to-shoulder with a free & independent UK. We stand together as friends, as allies, & as a people with a shared history."},{"comment_id":"10152700132182434","commenter_b":"Also, can I state for the record Sansa had a good idea she would in fact have to have sex that night, but it's the only way to get her revenge on the boltons. She had a choice to get into the family, Littlefinger gave her one, but she chose to do this. This is fucking Westeros, people, hell, in many states in the US a husband can't rape his wife.","commenter_a":"i'd like to point out that Danaerys' rape occurred in the same way as Sansa's and had a lot to do with her character development","post_message":"Whoever titled last night’s episode of Game of Thrones “Unbowed, Unbent, Unbroken” has a grim sense of humor and solid sense of irony."},{"comment_id":"980094148726809","commenter_b":"@username Keep your dick in your pants!","commenter_a":"Well done! Any who object to a 'medieval theocracy' should take a good look at Northern Ireland if they want to see one in action. Bloody misogynist dinosaurs.","post_message":"Three women have handed themselves into a police station in Derry, stating they have procured and taken illegal abortion pills and requesting that they be prosecuted, in protest at Northern Ireland’s restrictive abortion laws."},{"comment_id":"10153465142866037","commenter_b":"Regina just stfu. Idc","commenter_a":"who cares. its their country their rules. i dont see why people like to police other countries because they find their practices to be disgusting. no different than people consuming pigs, goats, cows and chicken. don like it? donate other possible food sources then. if not stfu","post_message":"\"There are all sorts of cultural norms about what you can eat; you eat turkey, so why are you trying to force us to not eat dog meat?\""}]
