[{"comment_id":"567131713411422","commenter_b":"It is Bloomberg who is the dangerous demagogue and Obama, and Biden","commenter_a":"No body can help us if Hillary.is elected.","post_message":"Michael Bloomberg said \"Trump is a risky, reckless and radical choice,\" during his DNC speech last night. He also asked his fellow Independents to support Clinton because she \"understands that this is not reality television  this is reality.  Do you think his speech will hurt Trump's chances with Independents?"},{"comment_id":"996644970358551","commenter_b":"Arrogant bitch.","commenter_a":"And there are idiots out there that support this bi---!","post_message":"Whoa, Hillary Clinton put this reporter in her place."},{"comment_id":"758826910928758","commenter_b":"Those fucking bastards.....we gotta gut em, then kill them, then gut em again, then smoke a blunt or two and plant a tree and then maybe spread their entrails on our enemies lawn so they get the message.","commenter_a":"There's obviously some sort of mysterious group of people who have been trying to hide the advantages of the hemp plant to prouduce many of our products for everyday use.","post_message":"The solution seems obvious, doesn't it?"},{"comment_id":"10153664753098797","commenter_b":"Happy Birthday Glenn :)","commenter_a":"Happy birthday","post_message":"HEARTBREAKING AND HEARTWARMING: When Glenn turned 6, his mom threw him a big party. She invited 16 kids - but not one of them showed up.   Glenn was crushed. So his mom went on Facebook to vent. What happened next is absolutely incredible. See here - and wish Glenn a happy birthday in the comments section below:"},{"comment_id":"885477798171651","commenter_b":"Get out of here","commenter_a":"The Senate intends to rid this man from his job.","post_message":"(Video) The U.S. Muslim population has vastly increased under the Obama administration and set to continue to do so on an ever increasing scale.  What generally happens to societies as the Muslim population increases?   A work by Dr. Peter Hammond provides some insight...  Read More:  @webpagelink"},{"comment_id":"1785556881731423","commenter_b":"The white house will probably be full of naked stripper","commenter_a":"Trump will bring that back","post_message":"Yes!"},{"comment_id":"10153186374039497","commenter_b":"If only this were all fiction........","commenter_a":"James Tatham. I very much like @username's humour.","post_message":"This Week Last Year:"}]
