[{"comment_id":"727273657378849","commenter_b":"We can not trust Iran and we definitely do not need to give them money. Thanks for standing up against this deal and a deal that does not even include the release of our Americans held in the Iran prison.","commenter_a":"hey rodney you pathetic weasel,the US has violated almost every treaty they have ever signed you delusional fool.","post_message":"My statement on the nuclear deal reached with Iran: “In the coming days and weeks, I will carefully analyze the details of this agreement, but remain skeptical that the Iranian regime will live up to its end of the deal,” said Davis. “We’ve been here before with North Korea who two decades later have cheated its way out of a deal and onto a path to dozens of nuclear weapons. I fear this administration has agreed to terms that will leave the world’s leader in state-sponsored terrorism stronger economically with a nuclear program largely intact.” Last week, I spoke on the House floor warning against a bad deal with Iran →"},{"comment_id":"466812640175338","commenter_b":"Hang tee bitch.","commenter_a":"Close all borders indefinitely. NOW","post_message":"Muslim Refugee Beats And Rapes Woman In North Dakota While Yelling 'Allahu Akbar' [VIDEO] It's starting to happen in America. We cannot allow any more refugees into the U.S. Do you think we should close our borders to refugees?"},{"comment_id":"10152887362811770","commenter_b":"Liar....","commenter_a":"gormless!!","post_message":"Pantsuit on fire!"},{"comment_id":"10153882688173984","commenter_b":"We have created the Immigration Laws for a reason and when needed we have enhanced them to be stricter. Anyone that thinks anyboby that does not come into our country legally should be allowed to stay are Un-American. They are taking Jobs from hard working Americans. There is no excuse to let them stay.","commenter_a":"Even Bill O'Racist recognizes how evil Adolf Trump's plan is...wow","post_message":"Bill O'Reilly thought it was a good idea to try and teach Trump a lesson about his deportation plan - it definitely didn't work out for him... Do you agree with Donald J. Trump on immigration?"},{"comment_id":"917736131581794","commenter_b":"If she wants us white people to die bring it I'm locked and loaded she ain't got the balls to","commenter_a":"Now who's the racist.","post_message":"I'm sorry, what?!"},{"comment_id":"1684200761639665","commenter_b":"Like I said, she looks like an old hag.","commenter_a":"My gosh, she only 49 years old and looks much older.","post_message":"Kellyanne Conway breaks out her bathing suit as she manages to sneak away from Team Trump for a brief family vacation"},{"comment_id":"1203190183110565","commenter_b":"And Trump will build a wall and call you a rapist!","commenter_a":"It happens every election year, Bill Clinton (2 terms), G.Bush 2 terms, Obama 2 terms they pander for our votre (Hispanic) and once they get into office what do they do for the Hispanics. Bill Clinton had a few token Hispanics in his administration so did George Bush and very few with President Obama. Now Clinton and Sanders are also clamoring for our vote. They will probably get the majority of Hispanics to vote for a Democrat but I have a feeling that once Sanders or Clinton get in it will be more of the same for Hispanics in high governmental positions, Nada or muy poquito!, Trump has alienated about 99.9% of Latinos and every other race and if he gets in who knows what he will try to do with every so called minority group in America. The KKK will administer Homeland Security, the Amereican Nazi Party will administer ...","post_message":"The state so rarely has much say in a presidential race..."}]
