[{"comment_id":"10154704981818812","commenter_b":"Shut up Ayesha","commenter_a":"NBA is rigged!","post_message":"U.S. men's basketball team earns gold for third consecutive Olympic Games and the sixth time in seven tries with NBA players."},{"comment_id":"10152892448302894","commenter_b":"Guess she should be a chemistry teacher now!","commenter_a":"Damn shame","post_message":"Say What Now? Elementary School Teacher Busted for Having a Meth Lab in Her Home"},{"comment_id":"10153326828766350","commenter_b":"Why would you call her a whore?","commenter_a":"Nobody cares!!!! Kardashians are talent less media whores!","post_message":"Kourtney Kardashian's response to critics? To just keep posting those pics!"},{"comment_id":"912105055515910","commenter_b":"The reality is that the absence of a father or a mother is felt by children who have grown up in single-parent household. Perhaps we should then outlaw divorce/sex outside marriage to contravene this?","commenter_a":"Hoe the HELL she this she is? Talk about being 2 FACED! No RESPECT! YOOT! Of 2 day . Viva the Women who had and still have LOVE 4 you! !!! X","post_message":"'Another mom could never have replaced the father I lost'"},{"comment_id":"10153063718888606","commenter_b":"What would be said if they were male teachers and little girls.... Sick is sick.... They need to go to jail and be on the sex offenders list.....","commenter_a":"Definitely a crazy world we live in!","post_message":"Two California teachers are accused of having sex with students while on trips to the beach, which included one overnight occasion. Police describe what happened here: @webpagelink"},{"comment_id":"1302858003140584","commenter_b":"Hillary is a war monger. You think There would be peace if she was elected?","commenter_a":"He will destroy this country parents get ready to send your children to war","post_message":"Nailed it."},{"comment_id":"10155696474235389","commenter_b":"Not sure, police officers have a great sense of duty and honor.","commenter_a":"Neuter the police, this is the result.","post_message":"Question of the Day: Do you think Baltimore cops are now less likely to put themselves at risk?"}]
