[{"comment_id":"10154278742015329","commenter_b":"Thats that lingo dang old times lol","commenter_a":"Diego X Flores Pringle","post_message":"Single and ready for a PRINGLE."},{"comment_id":"10153446783647293","commenter_b":"-cough- There are already Muslims in America. -cough-","commenter_a":"Trump for President No muslims in America","post_message":"Donald Trump has his campaign rally groove — poll numbers, protesters, Putin, and of course, making America great again."},{"comment_id":"10158194484645725","commenter_b":"Dis bitch don't even answer","commenter_a":"@username @username Melissa F Hernandez @username MaFe Ndz We are going to take Matthew to Navy Pier again this year. You guys should come too!","post_message":"Tonight feels like the perfect night to see some holiday lights, don't you think?"},{"comment_id":"1060970767293401","commenter_b":"Diana Serrano those hard headed girls just don't listen!!!","commenter_a":"Hahaha.... Acha hai acha hai","post_message":""},{"comment_id":"1043167352401972","commenter_b":"She needs to be fired.","commenter_a":"Again I say\"get rid of her\". There are many patriotic qualified principals out there.","post_message":"A New York school principal has banned the Pledge of Allegiance, Thanksgiving and Santa. The school's PTA president Mimi Ferrer told 'Fox & Friends,' \"We are in America. We're supposed to be proud of where we are.” @webpagelink"},{"comment_id":"806491062782835","commenter_b":"Its funny the democratic party started the Confederate nation and fought to keep slavery. Robert byrd retired in 2010 a Democrat longest serving politician in history and was active member of the klan. Imagine all yhr bills he voted on due to his racist views. Alot of the Democrats knew he was a klan member and said nothing. Pull some ones opinions off line and use them to your benefits but truth is your being lied to but 99% of politicians and the first to speak up you all attack.lol just like o malley saying all lives matter and Democrats attacked him for that. Yet alone he is democrat himself. Get it through your heads we are done with the hypocrits and lies and political correctness","commenter_a":"Can someone please explain to me who they are polling to get Trump in the lead?","post_message":"And yes, it's really his number."},{"comment_id":"1313943068640455","commenter_b":"Ol bitch ass!!! Now come love on meeeee","commenter_a":"@username Amber Nicole yo ass lol","post_message":"Her mood swings are real!"}]
