[{"comment_id":"10153397569465950","commenter_b":"Girl power!! I'm sure he deserved it.","commenter_a":"So. The boy must have said it done something very intimidating to push get to this point don't have think?","post_message":"The viral video of a high school lunch fight shows a girl throwing a boy to the ground. At one point someone tries holding her back, but then she breaks free and knees the boy in the face before running away."},{"comment_id":"10156025741310354","commenter_b":"Go educate yourself, ALEX! The Constitution does not need revision to deny citizenship to illegal aliens, or their children. It is left vague in our founding document and is clarified by statute. The 14th Amendment defines citizenship this way: 'All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.' But even this does not get specific enough. As usual, the Constitution provides the framework for the law, but it is the law that fills in the gaps. The Constitution authorizes the Congress to do create clarifying legislation in Section 5 of the 14th Amendment; the Constitution, in Article 1, Section 8, Clause 4, also allows the Congress to create law regarding naturalization, which includes citizenship. Currently, Title 8 of the U.S. Code fills in the gaps left by the Constitution. Section 1401 ...","commenter_a":"In my opinion all the RINOs currently in office as well as the few Republicans who haven't yet achieved RINO are crapping their pants because Trump is saying what the public is thinking. Plus, Trump could give a rat's ass about what the Democrat media formerly known as the 'mainstream media' says about him.","post_message":"Top Republican Strategist Promises a 'Cleansing' of Donald Trump Voters from the GOP!"},{"comment_id":"1202995606404444","commenter_b":"Made all her money from being sexy. Buuuuuwahaaaaaahaaa","commenter_a":"Funny how a party girl talks about porn","post_message":"COMMENTARY from Matt Walsh:  “I don’t have my Bible in front of me, but I’m pretty sure Pamela Anderson being accused of puritanism is a harbinger of the End Times.”"},{"comment_id":"10153953305054170","commenter_b":"It's really too bad the 'Pinoccio' factor isn't for real, Hillary would have four foot nose by now to go with her bulging eyes! Having made statements in front of people and then denying it, shows that she that she thinks we're all stupid! Well the jokes on you Hillary 'Rotten' Clinton, you're the 'Poster Child' for stupid! Careful what you say 'Hill' people around you do have a memory!","commenter_a":"Nothing has 'doomed' her yet, doubt this will...","post_message":"Hillary definitively busted in another lie, by the father of one of the Benghazi victims. The media will try their best to ignore this so we're going to have to do their jobs for them."},{"comment_id":"1112768188788371","commenter_b":"This is his third baby mama. The guy is an absolute psycho and she is a dumb doormat.","commenter_a":"It's not about breastfeeding. It's domestic violence. He has strict rules for his partner, including this new one related to breastfeeding. He's a controlling arsehole.","post_message":"He wants his wife to stop breastfeeding when their son turns 8 months old."},{"comment_id":"10153717683207894","commenter_b":"'@username Nobody's voting for Hillary? Why does she have 3 million more votes than Bernie??? I'll wait","commenter_a":"I don't know why people spew unnecessary hate for this woman, She has millions more votes than Bernie and is the better between her and Trump. What did she do so bad to you all? Bernie Sanders got yall head messed up. And that whole Bernie or bust thing is IGNORANT as hell. Writing in Bernie Sanders name is basically a vote for trump, smh","post_message":"Hillary Clinton Reaches Delegate Count, IS the Presumptive Democractic Nominee for President"},{"comment_id":"10152993021545667","commenter_b":"The Donald brings women to be his wives to the USA so they'll marry him and make them legal citizens, did it twice","commenter_a":"Support Donald Trump.","post_message":"'I cherish women,' Trump told Hannity on Tuesday night."}]
