[{"comment_id":"469071613283419","commenter_b":"she b a back stabber","commenter_a":"She fits in with Sharpton an Jackson","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"1062665507148980","commenter_b":"Scum","commenter_a":"They are a terrorist group and should all be locked up.","post_message":"Black Lives Matter Takes to Twitter to Celebrate the Slaughter of Baton Rouge Police. Here are Their Sick and Disturbing Tweets..."},{"comment_id":"942361925804666","commenter_b":"I don't like it poor women","commenter_a":"How horrible.","post_message":"With everyone watching. Horrifying. - Matt Orr"},{"comment_id":"10154185935155779","commenter_b":"Minus the \"away\"","commenter_a":"Easy. U2. 9/11-victims' names scrolling through 'Where the Streets Have No Name'....that was not a performance, it was an event...every type of emotion, right on stage.","post_message":"There is no gig in music like the Super Bowl halftime show. You have 12 minutes to justify your legend. And with the Big Game set for this Sunday, what better time to rank the halftime shows from worst to best."},{"comment_id":"977484695718405","commenter_b":"You know all this for a fact?? Otherwise move along snowflake","commenter_a":"That was awkward to watch she was looking like she can't wait to get away from him seriously but her face never moves Botox much","post_message":"President Trump and First Lady Melania Trump just shared their first dance at the inaugural ball. @webpagelink"},{"comment_id":"864266033622421","commenter_b":"Guaranteed Chris Matthews is paid off. GUARANTEE IT!!!!!!","commenter_a":"Oh boy...Jorge","post_message":"Watch the DNC chair squirm when asked about the difference between Democrats and socialists: @webpagelink"},{"comment_id":"10153928172287411","commenter_b":"Love it...what a hoot! Dang, she would drink me under the table with that stuff!","commenter_a":"@username here is Dorothy again making good on her shot.","post_message":"That Dorothy Farrell sure knows how to party."}]
