[{"comment_id":"998167890303719","commenter_b":" y ayuda tmbn a Los autistas","commenter_a":"Diego Alberto Rodriguez Pesaresi @username","post_message":"Marijuana can literally stop a seizure in its tracks. Like ATTN: on Facebook."},{"comment_id":"1009473349173573","commenter_b":"This woman is an idiot.","commenter_a":"#ArrestHillary #NeverHillary #GladlyPayforHillaryInJail","post_message":"FBI Federal Bureau of Investigation Director James Comey testifies on Hillary Clinton Email Investigation before House Oversight Committee. Complete video here: @webpagelink"},{"comment_id":"10153409431986336","commenter_b":"Give it a rest ! Donald Trump has every right to his opinion. I agree that this country has had an influx of illegals for years. Be informed and know that Mexico and Guatemala have cut a deal to send thousands more to cross our borders illegally. The monies they send back to Mexico and Guatemala is $120 Billion dollars. This president wants to give them a free pass plus $35 thousand tax refunds? So they cross illegally, burden our health centers, schools, and oh only so you get my disgust! All I used to hear at the hospital is people telling other relatives of theirs to \"Come to the U.S., because this country is so stupid. They give you money for living, food stamps and oh if you have your babies in the U.S. , then they are citizens and you can stay\"... So these so called nice people ...","commenter_a":"Its a PR move. All they really care about are the $$$$$$ NBC and MSNBC are financially hurting. Low ratings low viewership.","post_message":"Breaking News: NBC is ending its business relationship with Donald J. Trump due to his \"recent derogatory statements\" regarding immigrants. DETAILS: @webpagelink"},{"comment_id":"10153505176486051","commenter_b":"I disagree with every thing she says, such a liar","commenter_a":"I hope she does get the dem. nom. that way repub. are guaranteed a win.","post_message":"Hillary Clinton believes Americans should wholeheartedly reject Trump's rhetoric on Muslims and immigrants. Do you agree or disagree?"},{"comment_id":"974731595926313","commenter_b":"Kyle Francis","commenter_a":"Sarah you wonder why I despair......... Senor Berm Eileen","post_message":"We didn't think the 2016 election could get any more bizarre, but Sarah Palin and Donald J. Trump proved us wrong yesterday."},{"comment_id":"402701206566786","commenter_b":"Wake up Bitch!","commenter_a":"I don't watch her channel anymore. I don't like Oprah!","post_message":"Oprah: ‘Anyone Who Doesn’t Like Obama Is Racist’. Unbelievable. What a bigot. Do you think Oprah is the racist?"},{"comment_id":"1786910708245530","commenter_b":"She is a liar !!","commenter_a":"Imagine a Trump led America With a vision to make us great, Builder, businessman, father, With a leader, fighter trait. Imagine factories buzzing, Oil flowing out of the ground, Coal miners packing their lunches, People talking about jobs they've found. Soldiers, sailors, airmen, marines, Showered with Presidential Pride, Strong and able to keep us safe, Respected and feared worldwide. Imagine a really, really big wall, With a big, beautiful door, Swings one way to put out the bad, The other to let in the good. ISIS not even a JV team, Russian Bear back in its cage, Iran decided to take a new deal, Israel safe from all rage. Imagine a man of integrity, A man the world will respect, A man who will fill the office With all the honor we expect. Imagine a Trump led America With a vision to make us Great, Imagine a Trump led America ...","post_message":"FACT-CHECK:"}]
