[{"comment_id":"10153097498516636","commenter_b":"She's attention seeking plain and simple","commenter_a":"She makes a good, logical point in my book. Why should menstrual blood be considered different than any other blood depicted in film, TV or video games? Can't have it both ways... I admit it's a pretty extreme way to make that point but you can't argue with the logic.","post_message":"Period drama"},{"comment_id":"916527265110193","commenter_b":"Rhyno - NO, dems did not control congress for the majority of Bush's presidency, you guys are so clueless..... it's the fault of those that pushed and developed it and demonized those not supporting it...... republicans did it, that pinch your cheeks thing again.....","commenter_a":"It is republicans that have forced Obama to keep the worst parts of the surveillance program going and to make it even more evasive. It is republican that created and pushed the surveillance state down our throats..... and they dare to point the finger at others for THEIR fascists policy.......","post_message":"“Such expansive development of government repositories of formerly private records would be an unprecedented contraction of the privacy expectations of all Americans,” the ruling said."},{"comment_id":"10153811887041770","commenter_b":"I never liked Nancy until I saw her genuine love and grief for the loss of her Husband.","commenter_a":"Well honey you know everybody laughed at Ronald Reagan because he was a movie star not a reality star cuz they didn't have that back then but he was still a movie star and they all laughed at him but guess what he broke down the wall he made this country great he made us unified and we love him and we love Nancy for The Classy wonderful woman that she was. Can we actually say that about what's an office now?","post_message":"Ann Coulter: “Why couldn’t it be a more genteel, a more elegant person like Mitt Romney. But as soon as you think that to yourself, you realize that is a creature that doesn’t exist in nature. For the attacks that Trump has come under, you have to be a tacky reality-TV star.”"},{"comment_id":"10150862465429999","commenter_b":"Here, here.","commenter_a":"The truth in the matter is that Washington is all about who has power and control of the agendas, no matter how awful their candidate. Withdrawing support from Awful Trump means conceding power to awful Hillary and the equally awful Democrats. The only way to break this power struggle is to elect more third party candidates that will force our elected public servants to compromise for the benefit of the American People.","post_message":"It's time for John McCain and other Republican leaders to set an example for their party by withdrawing support for Donald J. Trump, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"915559728526390","commenter_b":"Go f u co.yourself you ugly bitch","commenter_a":"I thought this might be a joke till I opened up and read more. This is absurd. I'm just saying","post_message":"Obama just announced that he is issuing you a new Muslim holiday that you must celebrate. This is ridiculous. He can't make us do anything. Will you refuse to celebrate this holiday?"},{"comment_id":"10153396676558837","commenter_b":"What cracker dnt steal money there all crooks","commenter_a":"At Least in sweet water PD This is standard procedure","post_message":"OFFICER ARRESTED: Detective Armando Socarras, a 10-year veteran, was accused of taking $1,300 in drug money."},{"comment_id":"984015725050561","commenter_b":"Carla. Go back to school honey. You are so stupid.","commenter_a":"Compare this: Melania Trump became a US citizen and said it was \"The greatest privilege on the face of this earth.\" Michele Obama said in a speech, \"For the first time in my adult life I am really proud of my country.\"","post_message":"Donald J. Trump’s campaign chairman denies allegations Melania Trump lifted her convention speech from Michelle Obama’s in 2008, claiming such an act would be \"absurd.\""}]
