[{"comment_id":"1129314157104004","commenter_b":"WAKE UP PEOPLE PLEASE","commenter_a":"I did hit like on purpose it was an accident.","post_message":"**Terrorist attack on US Soil! This just in!**"},{"comment_id":"10154485862326037","commenter_b":"Sure, if you choose to believe the people in collusion with the election fraud.","commenter_a":"If you wanted unity, you should have allowed the voters to choose the nominee instead of allowing your corporate masters to do it.","post_message":"DNC chair Marcia Fudge calls for unity amid a chorus of boos and jeers from Bernie Sanders supporters: \"We're all democrats\""},{"comment_id":"1002013776554647","commenter_b":"I dont think Buying Sex is a Game Changer Anymore. Lets get Real Here. You got a Lunatic Acting Like Hitlers Twin Brother Running and Thats Ok? Buying a Hooker is somehow More Repulsive?","commenter_a":"Intriguing.","post_message":"It sounds like this information could definitely ruin a campaign -- and it WILL be released."},{"comment_id":"990789407625962","commenter_b":"In coming President~Trump ^ seek and destroy all opposition within our borders and outside our borders VOTE TRUMP","commenter_a":"These and all jehadic Muslims are evil and need to be killed period.","post_message":"Who saw this coming? [Read below]"},{"comment_id":"10154189944991320","commenter_b":"NO WHITE PEOPLE DO THIS...BLACK AND LATINO....NO CHINESE....NO IRISH....NO ITALIANS.....NO GERMANS....NO SWEDISH...... NO LATVIANS.......BLACK AND HISPANIC PIECES OF S..T","commenter_a":"Try Linden Blvd. and Pennsylvania Ave.","post_message":"The NYPD made its inflexibility clear, dirt bikes and ATVs are illegal in the city, break the law and arrests will be made and the seized vehicle will be destroyed. @webpagelink"},{"comment_id":"10153364359422411","commenter_b":"Female castration","commenter_a":"What do they do about the women?","post_message":"A Republican from Alabama has introduced a bill that would require sex offenders to pay for their own surgical castration before being released from state custody."},{"comment_id":"1009718899145010","commenter_b":"Well the Wicked Witch odf Washington has looked better noow hasn't she.....TRUMP will save America...For us Mericans. Yall can move to Canada.....","commenter_a":"The dumbing down of America, this is the people we take care of with government assistance, most are not capable of taking care of themselves let alone voting","post_message":"Woah. Donald Trump voters will be the end of America as we know it. Thanks to Mitchell Wiggs for the video. Shared by Occupy Democrats, LIKE our page for more!"}]
