[{"comment_id":"1004502652963001","commenter_b":"Better hope Hillary don't get to be President. This country will be a goner in 4 yrs. if she does.","commenter_a":"Oh, so Democrats are crossing over to vote for Trump. I see your game plan Dems. After Nov. gets here and if Trump is the nominee you all will turn around and vote Democrat.","post_message":"#FloridaPrimary"},{"comment_id":"10153880992094714","commenter_b":"Illuminati right?","commenter_a":"I really can't stand Obama right now nor his latest decisions. He's honestly pissing me tf off no lie Like the earlier comment said, you have plenty room at the white house to throw a traditional Thanksgiving dinner all for them... We'll see how fast you call that a good idea...I'll wait","post_message":"\"[A] woman from Florida told me her family's history dates back to the Mayflower - and she said that welcoming others is part of 'what it means to be an American.'\""},{"comment_id":"10153589357933984","commenter_b":"Just WHAT THE HE#% IS WRONG WITH AMERICANS, just like the poor Jews in Germany, we just sit back and let all this crap happen!!!","commenter_a":"Screw you","post_message":"The NAACP just made a stunning demand about this historical monument... this is shocking move.  Nobody thought they would go this far...  What do you think about the NAACP's demand?"},{"comment_id":"10154653842272639","commenter_b":"No they don't, they just have a problem with a stupid woman lying and telling everyone it's Alternative Facts..... You are a White Neo Nazi KellyAnne and that is what the problem is.....You don't have power, you have NOTHNG!!!!!","commenter_a":"No we have a problem with fact challenged people","post_message":"“It turns out that a lot of women just have a problem with women in power,\" Kellyanne Conway said about the historic Women's March on Washington."},{"comment_id":"10153251876512464","commenter_b":"Would love to see these two little girls in the White House with dad.","commenter_a":"What a special day for the whole family","post_message":"Yesterday, we spent a wonderful Sunday afternoon teaching Caroline how to ride her big-girl bike—without training wheels!  She did awesome; very proud of her."},{"comment_id":"1573634599333254","commenter_b":"I know smh that's it I'm looking for new locations tomorrow","commenter_a":"@username Eder Marure","post_message":"A drive-by shooting left 1 person dead on Cypresswood Drive on Monday night."},{"comment_id":"10154606331071037","commenter_b":"She will not become president!","commenter_a":"I will wait and see what he does when he is actually president this is just all talk for the votes on both Hillary bringing in all the families from Ferguson and the parents from the Military we need someone to fight for the people not against each other we already have enough of that.","post_message":"“What is Trump? He’s not a Republican. Absolutely not. Those are not the Republican principles. He’s not a Democrat. He is just himself. He is egocentric.”"}]
