[{"comment_id":"10153561023428984","commenter_b":"Go back home you stupid little bitch!!!","commenter_a":"Twitter Bomb her page till she leaves! REMOVE ALL of the spoiled 'idols' your kids listen too, that say they Hate the Country that gave them the Opportunities to influence them!","post_message":"Globally known, pop-star diva Ariana Grande just told the world that she hates America... so karma just got its PERFECT revenge.  Her snobbery and selfishness are famous so this is not a huge surprise... she deserves what she gets."},{"comment_id":"10155303562011756","commenter_b":"'@username stfu and gtfo. Now.","commenter_a":"I get where the author is coming from and she makes a valid point. In this case though I think the mommy comments were engendered by Beyonce's show stopping 10 minute celebration of being black, being a woman, and being pregnant. Her presentation as an Isis figure/fertility goddess all flowed into the dynamic she created, so it's understandable that Adele and Faith related to her that way. Beyoncé was the mother of the night and that's how she planned it. If she performed formation and wasn't pregnant for example, this article would be more warranted. I think the whole mammy/mommy comparison arises because it's impossible to escape the history and application of white supremacy whenever colored people deal with Western institutions like the Grammy's. The concept of disposable black women, which Beyoncé essentially demolished in her performance, is baked into our society and forms a large part of the reason ...","post_message":"On the Grammy stage, both Adele and Faith Hill commented that they wanted Beyonce to be their . Those comments came across as absolutely bizarre for Denene Millner, writing for NPR's Code Switch:"},{"comment_id":"10158601678305354","commenter_b":"And don't forget while wearing a vagina costume ......","commenter_a":"it'd be cheaper just to say 'get the fu_k out!' stupid leftists just cant bring themselves to be rude or nasty ... unless they are being rude & nasty to conservatives.","post_message":"Desperate."},{"comment_id":"1386644204686259","commenter_b":"It's all geared for her to win. She knows this. The corruptness is too great and the winner will be whomever bows to the big $. Sanders and Trump won't do it but she does and will continue to do so.","commenter_a":"And, that a$$hat in the photo has never accomplished a thing worth mentioning.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"831073873594702","commenter_b":"She needs to eat goat meat. Raw.!","commenter_a":"Hey monkey looking good","post_message":"What's wrong with her!? You have to read this:"},{"comment_id":"10156794589450231","commenter_b":"She looking like a dog tie her azz up","commenter_a":"Need her tubes snatched from her body...","post_message":"Pregnant mom arrested after 2 toddlers found tied up like dogs behind home."},{"comment_id":"10154239882011509","commenter_b":"So is everyone just supposed to sit back and watch how ISIS does whatever the hell they want? I think not. War is a terrible thing, innocent peolle die just like they did in France and just like they did in other wars. It can't be justified, but if nothing is done about the situation we will all be required to memorize the Qu'ran soon, not to mention have our way of living destroyed by these pigs.","commenter_a":"French warplanes take off from an aircraft carrier,killing #InnocentChildren in #Syria and #Iraq","post_message":"French warplanes take off from an aircraft carrier, attacking #ISIS in #Syria and #Iraq.   The latest: @webpagelink"}]
