[{"comment_id":"10154898475594657","commenter_b":"Trump Beat Trump.","commenter_a":"Bunch of lying scumbags! They've always known that Trump was going to crush them. They scurry around like the rats they are, searching in vain, for a way to beat Trump! TRUMP 2016!!!","post_message":"\"All of us shouldn't even have answered that question.\""},{"comment_id":"1220911264593201","commenter_b":"@username who is illegal stupid!!!","commenter_a":"FINAL, now THAT is something to celebrate because: #BarackObama is a sociopathic liar, a national disgrace, an enemy of the Constitution, racially divisive, a promoter of black genocide by abortion, denies the threat of radical Islam and then supports that threat, a communist sympathizer and a traitor to civilization. That is his legacy.","post_message":"SATURDAY: Watch President Obama's final White House Correspondents' Dinner - LIVE on C-SPAN (TV) and here on C-SPAN's Facebook page. More here: @webpagelink"},{"comment_id":"1766493690288077","commenter_b":"get outta here!","commenter_a":"Democrats are so worried about Russia influencing our election by uncovering the truth. I'm troubled by the fact that Democrats are fine with mainstream media influencing our elections by deceptive and selective reporting to fit an agenda backed by money.","post_message":"A half dozen taco trucks formed a \"wall\" outside of the Trump International Las Vegas hotel hours before the last debate between Donald J. Trump and Hillary Clinton"},{"comment_id":"10153590307723837","commenter_b":"De p***a WTF is wrong with the human race","commenter_a":"@username here's another one to the list","post_message":"DON'T HIRE HER! A baby sitter brought the kids she was watching to help her rob a bank! But why she robbed the bank makes it even worse!!!"},{"comment_id":"10153812349369170","commenter_b":"\"Hope\" is the refuge of somebody who has nothing substantive upon which to base what he wants to believe.","commenter_a":"Why do Christians continue to believe that they and their beliefs are entitled to special treatment?","post_message":"A group of angry atheists waged war on this town because of a touching veterans memorial. When the townspeople got wind of what was going on, they hit the atheists back HARD. This is awesome!"},{"comment_id":"1837165426513406","commenter_b":"Kiss my white ass","commenter_a":"and let me tell you something about being poor we were poor when i grew up i was very lucky we had food on the table there were times we didn't have ckristmas cuz we didn't have the money so when the democraps say we dont know how it feels to be poor they are so fucking full of shit minimum wage was less was about 3.00 an hour so you people today dont know how it is to be really poor","post_message":"Black Lives Matter Co-Founder Makes SICKENING Demand For Whites To Do THIS [VIDEO]. She is a bigot, her demands are creating racial tension. Do you think she is the racist?"},{"comment_id":"10153824341126955","commenter_b":"Who has a billion dollars for this nonsense? That obscene wealth needs to be redistributed!","commenter_a":"Sure it Berns now but it will itch latter.","post_message":"HILARIOUS"}]
