[{"comment_id":"673333352791257","commenter_b":"It is VACCINATED children getting the measles from the illegals.","commenter_a":"There will be more diseases brought in that we have eradicated ! They can't let in all these refugees and not face the problem!!!","post_message":"Illegal immigrants have been bringing a special 'gift' with them when they cross the borders. This is terrifying!"},{"comment_id":"874758175906540","commenter_b":"1400 years Muslims have done nothing but murder...Muslims gave humanity the dark ages,Muslims have been murdering and destroying the new body count 750,000,000 and growing..this death cult will and have killed their own it will not matter!","commenter_a":"Don't we all feel better because the NYT supports the great community organizer? Hell, I may just go to work!","post_message":"The only war the Obama administration is fighting is 'the war for American public opinion.'"},{"comment_id":"10153933655437098","commenter_b":"Lol imagine you get off work,headed to your car,next thing you see,a perver having sex with your car lol","commenter_a":"The article doesn't make it clear if he owned the van or not?","post_message":""},{"comment_id":"1567244033571398","commenter_b":"Good and take all those bitches from the View.","commenter_a":"Move. That will even make America Greater.","post_message":"ClashDaily.com"},{"comment_id":"543443959158926","commenter_b":"Time to skewer the witch!!","commenter_a":"Hell Ya !","post_message":"'Hillary Is In for the Ride of Her Life' When She Takes On Trump. Governor Mike Huckabee"},{"comment_id":"586245841541886","commenter_b":"Murders need to go to prison!!!","commenter_a":"Thank you Dr Carson","post_message":""},{"comment_id":"10154258591333701","commenter_b":"What a bitch. Just say you don't want to exercise, don't take it to the next level.","commenter_a":"Once they hit 65 it should be mandatory yearly testing until age 75 in which case it needs to be testing every 6 months. Elderly people do not belong on the road. NOW before you idiots talk crap let me just tell you my father drove until he was 87 years old. When my brother and I reported him to the DMV at 83 years of age he was sly. He just went and took his drive test at the Silverton branch of the DMV and passed because all they had him do was drive around the block. Regardless, old people need to be allowed to ride the buss and max for free and stay out from behind the wheel!!.","post_message":"Police say nobody was injured in the crash, however there was something very familiar about it for everyone involved."}]
