[{"comment_id":"734861966642849","commenter_b":"Abortion should be legal everywhere and easily accessed for any women or young girl. It is their body and their right. A fetus that cannot process a though does not trump the right over an already born human being, especially when it lacks a social security card, birth certificate, valid first and last name, etc. A fetus does not reserve the right to life over the person it feeds off of and needs for survival. It is her property and as her property, she has a right to decide what does does with it where her physical and mental healthy is concerned.","commenter_a":"So disappointed you tossed in a nod to the Terry Shivo debacle...bad move. Most were probably not savvy enough to catch it. I did, you lost my vote. John Kasich won. Compassion and tolerance always beats government intrusion","post_message":"\"My record is clear. My record as a pro-life governor is not in dispute. I am completely pro-life and I believe that we should have a culture of life.\" – Jeb More on Jeb's conservative record: @webpagelink"},{"comment_id":"10153109594476519","commenter_b":"Women always tell there sob stories, leaving out key facts and events, seen it, been through it, went to jail over it!","commenter_a":"Men that beat woman usually don't get in fights with men.","post_message":"You'll never look at unrepentant woman-beater Dr. Dre again the same way after reading this..."},{"comment_id":"10155741989330192","commenter_b":"There are many democrats who share many of conservertive ideas.like ideas about gays ,abortions,veterans rights,the militery.","commenter_a":"They are called libtards for a reason... Those that oppose legal hunting are just bad shots.","post_message":"A group of conservationists is urging Gov. Rick Scott to cancel the bear hunt that is set to take place this fall."},{"comment_id":"10153784629291323","commenter_b":"So women are overly sensitive and need to \"man up\"?","commenter_a":"Actually, men do say and do the things they say on the internet in person to women, and the reaction by society and the bosses is about the same: yawn.","post_message":"\"If the things said by men to women on the internet were said by men to their female colleagues in workplaces, they would be fired. If they were said by men to women in public spaces, they would be removed [..] The belittling and bullying, threats and harassment, cyberstalking and outright hate speech directed to women on the internet every day is real-world behaviour with real-world consequence and it should oblige real-world punishments.\""},{"comment_id":"10153644040068967","commenter_b":"Yeah but women can not, not without getting sexually harassed","commenter_a":"Common place in Denmark as well. Alone and in school groups. Take your pick.","post_message":"Japan is awesome"},{"comment_id":"1190272557692172","commenter_b":"I noticed, I don't believe I have ever before seen this. You can tell, they are sooo far distanced from our so called leader, lol. How is he allowed to carry on???","commenter_a":"In Obamas mind 9/11 didn't happen either. This man is a nut. Kick him out before he destroys this country. If you didn't know he was crazy before now, here's proof that he is. Pure old mean and crazy. America Please wake up. You can't be this brain dead.","post_message":"Somehow, Pentagon leaders don't seem too convinced..."},{"comment_id":"998201713572910","commenter_b":"Don't stop there. Get the rest of the scum","commenter_a":"How sad....","post_message":"Islamic State's chief singer-songwriter has been killed in an airstrike in Syria"}]
