[{"comment_id":"10154582886013725","commenter_b":"Go away and have another affair with the maid. You have your nerve. You embarrassed your whole family!","commenter_a":"If trumps doing what he said I hope all you moron trump supporters cozy up 15 billion for the wall that you ignorant assholes and trump are foolish enough to build. Doubt that right so stfu scumbags.","post_message":"Arnold Schwarzenegger says Trump is completely embarrassing the United States on the world's stage right now. Is he right?"},{"comment_id":"10155391516626729","commenter_b":"make the bitch donate it to charities or homeless people","commenter_a":"Green Party = Communist, it is all about the money","post_message":"Probably the objective all along."},{"comment_id":"959584250762524","commenter_b":"That woman is so far out of touch with reality she is in her own dimension","commenter_a":"Hilary will lose","post_message":"Hillary Clinton on potential battle with Donald J. Trump: \"Look, I’ve been standing up to bullies my entire life on the international stage, on the national stage.”"},{"comment_id":"10153218783658869","commenter_b":"No inspired because I do not look up to her.","commenter_a":"Antes de ver a una mujer en la Casa Blanca, la clase política americana es capaz de buscar lo inexistente, y si hay hay que crearlo, de crea.","post_message":"Hillary Clinton cannot appear too strong without risking her likability ratings; she cannot appear too vulnerable without her credibility suffering. Herein lies her dilemma."},{"comment_id":"1046533445373310","commenter_b":"that's not fair to pres o","commenter_a":"MLK would be ASHAMED of those useless race-baiters. He would spit in their eyes himself, if he were still alive.","post_message":"How I wish we had a Martin Luther King today instead of thugs and scam-artists like Sharpton, Jackson, Holder—and Obama."},{"comment_id":"10152975467087232","commenter_b":"Would you like them to put a gas grill up there! Get a life California your state has more problems to deal with other than a treehouse","commenter_a":"Their property it should be their choice","post_message":"This California family's treehouse is pretty sweet! But a judge ruled it has got to change. DETAILS---> @webpagelink"},{"comment_id":"861355680627352","commenter_b":"ronan need to go, and joy should replace REV AL at 5pm cst is very very hard to watch his show!!!!!","commenter_a":"did someone from fox come over and take over in charge of show selection as I am with the others why keep Scarborough who belongs over on fox and let these two go....way to lose viewership","post_message":"Ronan Farrow reveals the answer to a big question ... almost."}]
