[{"comment_id":"1297507013642106","commenter_b":"STFU dumb bitch","commenter_a":"That bitch & her sleazy family need to STFU","post_message":"Palin should leave President Obama and his family alone."},{"comment_id":"10153281305806770","commenter_b":"Ladies need to have a knife, walk in pairs and stab to death the attacker. Do not attempt to wound.","commenter_a":"MODERN GERMANS NOT ACCUSTOMED TO ANIMALS","post_message":"The Cologne Carnival kicked off Thursday with 22 reported cases of sexual assaults, including two rapes, despite increased security."},{"comment_id":"10152578499710950","commenter_b":"Sore ass losers.","commenter_a":"Redonkulous !!!","post_message":"'Uh, excuse me?'  LISTEN: Reporters ask New England Patriots coach Bill Belichick about 'Deflate-Gate,' and he is not amused: @webpagelink"},{"comment_id":"1314229205273274","commenter_b":"Stupid, greedy women who don't respect themselves LOVE Trump. I mean, look at his wife.","commenter_a":"So they're trying to use looks to get people to vote for a man who half his party do not even like.","post_message":"People started freaking out when the hashtag #TrumpGirlsBreakTheInternet started trending Sunday night."},{"comment_id":"1569451360020943","commenter_b":"It's called treason, hang her.","commenter_a":"ABSOLUTELY NOT!!!!! We need to MOVE ON!!!!!!! Stop beating this DEAD horse and help the people, NOT YOURSELF INTERESTS!!!!!","post_message":"“I talk about the emails all the time and what can you say, does it get anymore corrupt or crooked than that?”  Donald J. Trump argued that Hillary Clinton is being protected from prosecution relating to her private email server. Do you agree with him?"},{"comment_id":"10155341100780725","commenter_b":"So put that bitch down","commenter_a":"Obviously she has mental and emotional illness. Maybe people shouldn't be so quick to throw her to the firing squad.","post_message":"The woman accused of viciously cutting open a mother-to-be's womb to steal her fetus was apparently faking her own pregnancy, which gives a clue as to why she committed the horrendous crime, according to a police affidavit ----> @webpagelink"},{"comment_id":"981651015256776","commenter_b":"Lol because people and companies don't donate cars and trucks for tax write offs","commenter_a":"God forbid American tax payer money goes towards improving lower and middle class families or stuff that actually benefits us, but check out the sweet new cars dps get to drive!","post_message":"Next time you pass a red Dodge Challenge or Yellow Ford Mustang GT, you might want to check your speed. DPS troopers now have two new unmarked vehicles for traffic enforcement."}]
