[{"comment_id":"1103463889708572","commenter_b":"@username, it's not a C-Section if the spine is snipped. That's not a C-Section, that's partial birth abortion, aka infanticide.","commenter_a":"Hillary has stated that unborn children have no rights and that they can be aborted within hours of birth. Yet, when someone kills a pregnant woman, there are TWO charges of murder. Hmmmm....","post_message":"Trump said the procedure can happen \"as late as one or two or three or four days prior to birth.\" But that is not at all likely, writes NPR's Jennifer Ludden."},{"comment_id":"464672456990682","commenter_b":"Fire her.","commenter_a":"Go to jail and never see the sun again.","post_message":"Do you believe this lady has the right to continue to defy the law?"},{"comment_id":"1108272855874801","commenter_b":"she has a penis","commenter_a":"She looks like a man..","post_message":"Terrible!"},{"comment_id":"10156595781460192","commenter_b":"Not Christian not even NICE!","commenter_a":"Lets just all work to eliminate race ...that so hard","post_message":"What are your thoughts on this sign?"},{"comment_id":"1007061529350376","commenter_b":"Merry I'm very aware it won't be Carly. It's not time for a female President :-) No female running has the ability to do the job. They're both failures in their past jobs.","commenter_a":"The debate proved why we need a Republican President and not Hillary.","post_message":"If you watched yesterday’s debate, you know we can’t afford to have a Republican in the White House. Say you're with Hillary—add your name: @webpagelink"},{"comment_id":"10153966142134411","commenter_b":"Ahaha...Bryndzova giving all you nazis away...hahahahaha","commenter_a":"Bandera was a patriot who fought the Soviet murderers in his country.Glory to Ukraine!","post_message":""},{"comment_id":"10153641052531509","commenter_b":"@username, I'm willing to bet that Elizabeth up there hasn't murdered any teenagers. It's possible that she's never even been arrested. I won't mourn a guy who can't seem to keep trouble away from him.","commenter_a":"Too bad the gunshot didn't kill the punk.","post_message":"George Zimmerman, acquitted in Trayvon Martin's death, has suffered a minor gunshot wound in Lake Mary, Florida, police tell a CNN affiliate. @webpagelink"}]
