[{"comment_id":"10152991625460409","commenter_b":"GOD BLESS GOV RICK PERRY. I PRAY IF THE LORD LEADS YOU TO RUN FOR THE PRESIDENCY THAT YOU WIN. YOU HAVE BEEN THE BEST GOV THAT TEXAS HAS EVER HAD. I'M PROUD TO CALL YOU A BROTHER IN CHRIST AND I PRAY THAT WHATEVER YOU ARE LEAD OF THE LORD TO DO THAT GODS BLESSINGS WITH OVERFLOW TO YOU.","commenter_a":"I never understood the concept of hurting one class of Americans helps the other! Question for Obama, if the wealthiest 1% is forced to pay their fair share as you say are they more likely to sacrifice their life style to pay the tax hike with or slash the payroll aka are jobs to pay for it ? And if given the choice between getting the rich to pay ( again as you say) their fair share or having a job to provide for my family, I'll take the latter every time!!","post_message":"This administration has failed to prioritize job creation and economic opportunity. The Washington culture may be fundamentally broken, but the American spirit that built this great nation is not. America's leaders should be working to ensure every person who wants a job, has a job. That’s what this is about – making sure mothers and fathers can provide for their families and our children have every opportunity to pursue their dreams. #SOTU"},{"comment_id":"611841178976490","commenter_b":"Ha.....snake in the grass. Call her out.","commenter_a":"send Hillary to live with the Arabs.","post_message":"FUNDING TERRORISM --- AND THE CLINTONS."},{"comment_id":"10155240461128984","commenter_b":"Wow Jim what a brilliant comeback. You most assuredly are a Democrat.","commenter_a":"Another average comment from your average Democrat. Together they all three have a collective I.Q. Of less than 70","post_message":"This is so sad. Our thoughts and prayers are with the family."},{"comment_id":"10155169022694411","commenter_b":"I think the Mexicans are just being drawn back to their ancestral lands annexed into parts of the US. God gave the poor Mexicans more land but the Devil took some of it. Now the population is over flowing into another country. Build the wall on the pre annexed land boundary and the problem will be solved...","commenter_a":"That wall devided a nation. This wall divides two seperate nations. Fuck outta here","post_message":"'We Berliners know best how much suffering a division of an entire continent, cemented by barbed wire and wall, has caused'"},{"comment_id":"1066271903469061","commenter_b":"Illegal drugs are banned.","commenter_a":"None; simply ban them! ..... instead of thinking on wasting American lives and huge amounts of money in pointless wars, we should tackle our home problems first....and gun control is the main one!","post_message":"\"What could possibly be the argument for allowing a terrorist suspect to buy a semi-automatic weapon?\"  - President Obama  More from his address here: @webpagelink"},{"comment_id":"923406901068872","commenter_b":"would love to see ben carson and donald trump ban together","commenter_a":"Ben, that is exactly what obama has been doing for the last six years!","post_message":""},{"comment_id":"1087993101236110","commenter_b":"Obummer is a trader to America. He is full of lies and bullshit.","commenter_a":"He's still trying to destroy America","post_message":"**BREAKING NEWS**  What the HELL!?!?"}]
