[{"comment_id":"10154186163347483","commenter_b":"Are there illegals enrolled at AU?","commenter_a":"They get lot more money from those students. It's about money","post_message":"A statement from the university said: \"Auburn is an international university. Students, faculty and staff from all backgrounds strengthen our campus, and we remain committed to fostering an environment that upholds our values of inclusion and diversity.\""},{"comment_id":"10152988203790861","commenter_b":"You act like kids don't figure stuff out.","commenter_a":"I can just see a kid planning it out to steal the gun and shoot up the classroom.","post_message":"A Texas school district wants to allow teachers to carry guns in the classroom. Tell us what you think about arming teachers."},{"comment_id":"987021391354390","commenter_b":"@username: Once again, you can argue all you want day in, day out. And guess what will happen? The ongoing trend. It get's worse and worse year after year. The debt keeps climbing, yet some have their blind folders on like they can't see this way of thinking, and the economy is constantly nose diving, we are constantly going further and further in debt. Another fact, we in the South are tired of pressing 1 to listen to English while we live in America. If Hillary had it her way before she goes to jail, the mid-west and North would be in the same situation after she let them flood in and gives them drivers license, you too would be having to Dial 1, every single time you want to hear English. Think it wouldn't bother you? Think again, you'll question whether you are really living in America. After-all these ...","commenter_a":"Raise Minimum Wages - Put Small Businesses Out of Business, Take Jobs from Americans. Allow immigrants to flood the country, give them drivers licenses, and take jobs from Americans. Oppose the pipeline, Take Americans jobs. Do away with energy companies, Take Americans jobs. \"Hello, I'm @username, the hypocrite, I promise Americans jobs!\"","post_message":"Time to invest in a clean energy future—not build a pipeline to carry our continent's dirtiest fuel across the US. I oppose Keystone XL. -H"},{"comment_id":"1766381716934834","commenter_b":"How many drunk, stoned, high on drugs?","commenter_a":"If YOU DONT LIKE THE DECISION THEN GET THE HELL OUT OF AMERICA!!!!!","post_message":"Trump protest continues in Portland. Story: @webpagelink"},{"comment_id":"1115305561859305","commenter_b":"And this so called wall would cost Americans billions of dollars. We can't afford that. No one can force Mexico to pay for it. And what about the water ways and the mountians? How will you put the wall on those?","commenter_a":"The WALL will seriously squelch the drug cartels, crime will decrease and the land value will increase, - It's called tough love, if we continue with open borders California will collapse, we flat-out can't afford it anymore, we're broke. Mexico has the best land in the world.","post_message":"\"Es una amiga nuestra de mucho antes y de siempre\". —Congresista Luis Gutiérrez sobre Hillary Clinton"},{"comment_id":"10153766161047217","commenter_b":"Stoning , beheading , kill non believers . No thanks not for me if that's peace then I'm a fairy","commenter_a":"Islam, this outdated cult ,has no place in a 21 century world....the quran is nothing more than a military pamphelt and islam is based on a cry for war to no end....madness......","post_message":"\"It's become much harder for modern women to live here after Friday night.\""},{"comment_id":"10153188976024087","commenter_b":"Ethyl Rosenberg did less and thy fried her in the electric chair!","commenter_a":"Go Hillary , ignore the naysayers , they don't even have a real scandal , crime or violation , ignore the fake media , stay focused on the real issues that Americans truly care about","post_message":"Senior aides to Hillary Clinton will meet with Democratic lawmakers at the Democratic National Committee offices on Thursday to discuss messaging and strategy as the presumptive front-runner's numbers continue to fall."}]
