[{"comment_id":"10155581523315192","commenter_b":"Girl should be held responsible for her actions!!!","commenter_a":"Not news.","post_message":"This came to light when a mom received a nude picture of her daughter in a text message:"},{"comment_id":"10153550945636943","commenter_b":"No Syrian refugees....NONE!...call the Capitol...1-202-224-3121...follow instructions...Let them know you oppose Syrian refugees entering the U.S.. Took me 2 minutes...EASY!","commenter_a":"No","post_message":"Tom Fitton joins Fox News to discuss the danger Syrian refugees pose to the United States. Do you think Obama should allow thousands of Syrian refugees into our country?"},{"comment_id":"10153188449234087","commenter_b":"Go to jail!","commenter_a":"You should have called it a sin. We readily forgive those, just not mistakes.","post_message":"\"That was a mistake. I’m sorry about that. I take responsibility, and I'm trying to be as transparent as I possibly can,” Hillary Clinton told ABC News's David Muir."},{"comment_id":"349993335204181","commenter_b":"Since nobody will charge her with anything, she is above the law","commenter_a":"Yelp the Clintonss. Obama .Kerry's .. all do.","post_message":"Rand Paul says Hillary thinks She Above the Law"},{"comment_id":"451531238383723","commenter_b":"she also thinks we can't deport 20 million illegal parasites. boy is she in for a big surprise. a needy, insecure, unaccomplished , doormat to a serial women abuser.","commenter_a":"Have fun I will not hand mine over","post_message":"Hillary Clinton is Coming for your Guns!"},{"comment_id":"10153513286844575","commenter_b":"This lady is clueless lol","commenter_a":"This is sad leave churches alone go to a justice of peace & get married the ones trying to sue they think it is a way to get rich it makes me sick","post_message":"Four Kentucky couples are suing a clerk who is refusing to issue gay-marriage licenses — or any marriage licenses at all.  Rowan County Clerk Kim Davis says her Christian beliefs prevent her from complying with the #SCOTUSMarriage decision, so she will no longer issue marriage licenses to any couple, gay or straight."},{"comment_id":"10153451405011336","commenter_b":"The sooner the better. We're going to need them to bail us out.","commenter_a":"When are we joining the European Union?","post_message":"JUST IN: The Confederate flag will be taken down Friday. @webpagelink"}]
