[{"comment_id":"10153005348800496","commenter_b":"So it's from not walking?","commenter_a":"Can someone explain to me how they grow like that? What about wild horses? Thanks.","post_message":"Disturbing: @webpagelink"},{"comment_id":"10156224607550354","commenter_b":"Thought she was an illegal immigrant.","commenter_a":"Is it any surprise she is black","post_message":"The Obama Administration continues to deny the food stamp fraud crimewave exists.   Instead, it continues to balloon the already exploding program. Check out the numbers..."},{"comment_id":"10154667232099270","commenter_b":"But lord lord that wall has to go up!","commenter_a":"Axe the F35 and you got your new engines","post_message":"The Air Force wants new engines for its venerable B-52 Stratofortress bomber fleet, but there’s no money in the budget to pay for them."},{"comment_id":"10155334759910329","commenter_b":"You won't be here to tear it down....This is America not Mexico...Tell your parents to get out and take you with them. And see where you end up.Won't be here in USA because you be able to climb the wall.","commenter_a":"No, you won't","post_message":"The photo was taken at a anti-Trump march on Saturday."},{"comment_id":"655169484673630","commenter_b":"Hope she is thrown in prision","commenter_a":"Yay! I really, really, really don't want her to be my Commander in Chief. EVERYTHING becomes disfunctional with someone like here at the helm.","post_message":"Hillary is officially paying the price for all the crimes she has committed.  Awesome. She is a criminal.  Can we get 10,000 'LIKES' for Hillary getting arrested?"},{"comment_id":"1619826891648925","commenter_b":"@username Killary's hips are evidently widening. Must be all the hot sauce and watermelons she stashes in her pants.","commenter_a":"Why I'm backing D.T., he's against the establishment, can't stand Obama & Hillary, called out lying Cruz, wants America first, he doesn't come from a political family, treats his 30,000 employees with respect, supports law enforcement, will put a border up, deal with illegals & radical muslims, doesn't act like a scumbag politician, he's not part of the \"Good Old Boys\", helps military and families, great family man, very passionate about this country & the citizens, doesn't take BS from anyone and wants to Make America Great Again! #VoteTrump2016","post_message":"FLORIDA -- THANK YOU --- WE CAN WIN! Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1512943285667077","commenter_b":"While ur asses get your alcoholic drinks!","commenter_a":"@username hahaha","post_message":"\"Is there free food?\""}]
