[{"comment_id":"10154662767663188","commenter_b":"Absolutely Michael! No Jake herrin Idiots like You are ruining this country!","commenter_a":"Sick of your BS Beck and I don't need your critique on any of this! He cleaned her clock and your whining butt just doesn't like it. If we lose this country it's because of idiots like you Beck!","post_message":"This was Donald Trumps best Performance in the debate. BUT remember the only goal is to ADD undecided voters. Charles Krauthammer just called Trumps performance Political Suicide. He is right. He was winning and then it began to break apart. They both have sealed their core long ago. Tonight was the last chance to bring the women that have been lost or questioning. Those Reagan democrats who worry about foreign policy, Russia or temperament. First 30 minutes were strong for him. He had some good lines and looked (at times) well informed. He had a great open borders section. While I cringed in the gun debate and abortion section. On the second Amendment Rubio, Cruz or almost any other candidate would have cleaned her clock when she spoke about 12 toddlers shooting people in DC. His pro choice response On partial birth abortion was the weakest I have ever heard. ..."},{"comment_id":"10156151601990294","commenter_b":"She was underage.... Huge mistake......","commenter_a":"I find it funny that people are actually defending him.... If this was any regular person he would've been considered a pervert, a pedophile, a sick man But who am I kidding, he's a ( white ) cop He's above the law","post_message":"The 17-year-old says the officer only received \"a slap on the wrist.\""},{"comment_id":"10152841074616051","commenter_b":"I am woman...hear me roar!!!","commenter_a":"Love my Hillary!!!","post_message":"A judge said that Hillary Clinton’s e-mail violations are punishable by jail time."},{"comment_id":"1309663882411384","commenter_b":"Thank you! Someone with a little logic about the abortion! It should not be tax payer funded and it should NoT be past 12 weeks and it should not be used just because some idiot woman didn't use birth control and doesn't wanna deal with the consequences of her actions !","commenter_a":"I can not believe that abortion is a right to be discussed in 2016. It is a womans right to decide! It is our bodies!! As long as it happens before the 12th week...but women need to use their head and not use this as birthcontrol! Protect yourself if you don't want a kid! As I said, it is 2016 and we do have many types of birthcontrol!","post_message":"Obama's last stand"},{"comment_id":"778598825583664","commenter_b":"Don't let Chump Trump know you Clown Car passengers responded to a Megan Kelly article...She is the enemy...Have you Repubics forgotten...Clown Car Rolls On","commenter_a":"Hey Tim, I like the pocket pool!!!","post_message":"Pulls no punches."},{"comment_id":"1128329537202466","commenter_b":"That says it all! Those flag burners and dissenters can leave.","commenter_a":"I'm a proud veteran too.","post_message":"I'm A PROUD AMERICAN!!"},{"comment_id":"10154377654466729","commenter_b":"parents need to stay in contact with reality when it comes to their kids. pay attention to what schools is teaching our kids. it is all coming together. womans lib, moms are not home any more to pay attention to what kids bring home. homes have been destroyed.","commenter_a":"Those who can, do.","post_message":"Bingo."}]
