[{"comment_id":"923763564345713","commenter_b":"Blacks don't have a race card too play too our advantage only white ppl. Have a race its called white privilege. We have no damn race card nor ace card too use too our advantage since our culture controls nothing.whites have the race card too play since they control the system.","commenter_a":"Where are those white commenters now. Aren't these people \"race baiting\" or pulling the race card I dont hear their clown asses now! When its things like this they have nothing to say Because they are sitting back applauding this. They are the racist!","post_message":"This is happening. Residents of a predominantly black suburb in Detroit are up in arms after discovering racist political flyers sprinkled on their lawns that depict a cop in Ku Klux Klan gear pointing a gun at a black child. The flyers urge residents to “get the blacks out” and vote for white candidates, including mayoral contender Kenson Siver. MORE ---> @webpagelink"},{"comment_id":"912964402129948","commenter_b":"Great ideas .. And it would eliminate early voting '","commenter_a":"It's incredible how many people are so patriotic on the 4th of July yet not so much on Election Day!","post_message":"This would be a huge step forward towards restoring the integrity of our democracy."},{"comment_id":"888129164543273","commenter_b":"Now before you say.... \"white women do the same things on their shows!!!\"","commenter_a":"Total waste of an article, this list would have certainly dropped down to less than 10 had the writer just said the entire basketball wives franchise, love and hip hop franchise and real housewives etc. instead of going by each show and each city. Dumb","post_message":"‘Sorority Sisters’ Isn’t Alone… 10 Reality Shows That Were A Bad Look For Black Women"},{"comment_id":"10156924134420725","commenter_b":"@username The Wall Is Coming and Mexico Will Pay. No More Hand Outs To Mexico It's Time Mexico Starts Taking Care Of Their Own!!! Donald J Trump President of the United States of America and American People 2016!!!","commenter_a":"Don't Forget: DONALD TRUMP WANTS TO BANG HIS DAUGHTER.","post_message":""},{"comment_id":"10155275257336037","commenter_b":"Bahahahahahahahaha your trendy hashtags will change everything. Lmao. #CryHarderBitch #YouStillLose","commenter_a":"Trump is the new media now.He is telling us like it is.Lame stream media wasnt telling us about Sweden.They didnt tell us about Bowling Green.They didnt tell us about Atlanta.They didnt tell us about the massive voter fraud.They even said he lost the popular vote.They falsly reported on the size of his inauguration.Biggest ever.He was there to tell us that Barack Obama’s birth certificate was a fraud.Without trump we wouldnt have know that thopusands cheered from the roof tops of NJ when 9/11 happend.He's in charge now so suck it snowflakes.Trump 2018!!!","post_message":"FOLLOW LIVE: Coverage of upcoming Presidents’ Day protests in New York, D.C., and Los Angeles @webpagelink"},{"comment_id":"945138485506331","commenter_b":"Ya skinny women are repulsive...","commenter_a":"why on earth would she? She's beautiful! When I was body building in my 20's I wore a size 10 & weighed 150lbs the muscles in my legs & back we big had to wear mens pant & shirts... now at 56yrs old I weigh 155lbs & wear a size 8. I can assure you I don't look likre I did in my 20's even though there is only 5lbs difference. Muscle is denser & takes up less space..curves are better than stick woman anyday","post_message":"She weighs 160 pounds, and no, she's not worried about her dating prospects at all. (via HuffPost Canada Living)"},{"comment_id":"10152655147557267","commenter_b":"Plain english","commenter_a":"No bill should be over ten pages long, nothing else added and in plain English a fifth grader could read","post_message":"I voted ‘no’ on final passage of H.R. 240, the Department of Homeland Security Appropriations Act of 2015, which was ultimately stripped of provisions to stop the President’s executive action on immigration. Read my full statement here: @webpagelink #idpol"}]
