[{"comment_id":"10153408271028338","commenter_b":"The mom didn't! The dog was roaming loose around the neighborhood when it attacked the child","commenter_a":"Sue the dog owner...? Why did the mom have the kid there around the dog?","post_message":"The boy's grandfather says he already spoken to a lawyer and plans to sue the dog owner in his grandson death."},{"comment_id":"10152950745681717","commenter_b":"Just like allowing women turned it into a coffee klatsch, eh, Huck? With each passing day, Republicans make the USA more of a laughing stock and pariah state. If we didn't have this economy, we'd be treated like North Korea.","commenter_a":"What does he know about the US Military? He never served in it.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153626363751336","commenter_b":"If a man wants to kill,he can kill without a gun..might as well push for knife control while you at it..","commenter_a":"That's cause he's an idiot.","post_message":"'I've got to do something going forward that makes her life meaningful and will always be with me. And this is the way to do it.' – Andy Parker"},{"comment_id":"10154038979953279","commenter_b":"Very simple by democratically changing the Congress /Senate, and local states governments with stateswomen /men that supports Bernie's and we the people's agenda. If you think outside the subjugated status quo box where you live it is possible to allocate the economic resources where we want it to be instead of for example spending trillions on wars and then passing a debt bill to we the people so we paid more to wall street. Simple enough. We can even pass legislation specifying since that Iraq war was illegal due to lies for greed we can write off that illegal debt and don't paid to wall street. Hmm just brain storming the possibilities once we change the Congress, Senate, and Bernie is our POTUS. Just follow THE PANAMA PAPERS.","commenter_a":"Hillary is Cynical. But we the people know who the real champion for the 99% working class wealth producers is. Only Bernie Sanders is genuine and legit to the people. #NotHer15 #berniesanders #latinosforbernie #bernieorbust #creditgoestobernie","post_message":"'I’m supporting Bernie Sanders because he says no to fracking. I’m supporting Bernie Sanders because we do need a single-payer healthcare system that takes care of everyone. And that is not a pipe dream.' - Rosario Dawson"},{"comment_id":"10157698667015354","commenter_b":"Oh dam black bonnet girls make the rocking world go round!!","commenter_a":"Rumspringa. @webpagelink","post_message":"Here's a headline you don't see every day..."},{"comment_id":"1814101218857117","commenter_b":"When you walk into McDonalds they already had yo order ready , 'ay 3 big Macs to the front, this fatass just walked in here...' built ass, you sitting down eating on a bean burrito & yo bitch walk in butt naked all you can do is *munch munch on food* 'uhh tf I'm supposed to do with that?' Gay ass outta here","commenter_a":"What kinda fake ass pink sack of waste of human flesh trump supporting stds catching macaroni and cheese smellin diaper full of shit stain 'my dad a lawyer' 'Just bought 2 big nos tanks for my honda and added turbo that way when I drive it goes really fast like 300 mph' lookin ass damnnn 'Daniel back at it again with the pink verses fruity man' head ass 'wanna hot dog on a stick?' Head ass normie fuckboi made this meme?","post_message":"This man is a genius ahaha #WSHH"},{"comment_id":"10153835209313380","commenter_b":"Outstanding. Congratulations.","commenter_a":"CONGRATULATIONS","post_message":"Today, I want to recognize Commander Zeita Merchant as she relieves Capt. Ryan Manning as Commanding Officer of Marine Safety Unit Chicago. Zeita is a native of Jackson, MS, and a Tougaloo College graduate. She will be the first African-American female commanding officer in history to command a Coast Guard marine safety unit and the first female officer to command Marine Safety Unit Chicago. Marine Safety Unit Chicago comprises 52 active duty, reserve and civilian personnel. Marine Safety Unit Chicago’s area of responsibility includes a fleet of 266 vessels, 118 regulated waterfront facilities, Lake Michigan shorelines of Illinois and Indiana, as well as 186 miles of the Illinois River System segmented by seven locks and more than 250 bridges. Congratulations Zeita! We know you will continue to make us proud. #MississippiMade #MississippiSupports #MyMS02 #BGTMS02 #FeelGoodFriday"}]
