[{"comment_id":"526053707590689","commenter_b":"She needs to go back to the Chicago geto where she belongs!","commenter_a":"She is such a liar she acts socked but she has tapers in the White House","post_message":"\"I can't stop thinking about this. It has shaken to me to my core in a way that I couldn't have predicted,\" Michelle Obama said regarding Donald J. Trump bragging on a 2005 tape about his fame allowing him to \"do anything to women.”"},{"comment_id":"755392124560784","commenter_b":"Happy New year","commenter_a":"Go Bernie..he's the right person for the job!!","post_message":""},{"comment_id":"587990821351234","commenter_b":"2","commenter_a":"2","post_message":"Some say two, some say 13 can you tell? Take our TODAY poll!"},{"comment_id":"924961764238223","commenter_b":"Some companies are specifically recruiting unskilled migrants because they know they can get away with paying them next to nothing! Also these entrepreneurs you speak of often pay such little to their employees so they can get rich themselves!","commenter_a":"70% tax from working people to pay while we have so many lazy unemployed sitting at home seems fair","post_message":"She says injustice and inequality makes her \"as angry as the Hulk\"..."},{"comment_id":"10153032074653145","commenter_b":"How date she!!","commenter_a":"'Stupid is as stupid does' Glad there's one less pea size brain off the streets. She and others with that type of violent ideas should be dealt with accordingly. Enough of thugs who think they can spread such animosity in a country with so many opportunities to do something positive, enough!!","post_message":" thought about shooting every white cop I see in the head..\" That's part of a Facebook post that got this mother arrested #WFTV"},{"comment_id":"10153177506924087","commenter_b":"Lmao! My uterus says otherwise but that's fine - enjoy your misogyny!","commenter_a":"Rand Paul is a fool. Trump 2016!","post_message":"\"I don't think you want a nominee that offends whole areas of the public, whole ethnic groups,” Rand Paul said. \"If you paint with a broad brush and you want to say, ‘well, most Hispanics are drug dealers and they’re rapists and murderers,’ well, that’s crazy talk, and that offends a whole segment of our population. I think most people who immigrated to this country are assets to our community and came here seeking the American dream, the same way my ancestors did.\""},{"comment_id":"10153810948993717","commenter_b":"Hillary wants to secure our border now - #TrumpWall - @webpagelink","commenter_a":"Great........I wonder which town he plans on hurting this time, forcing the tax payers to pay for his visit, and extra police security while he's here weather they like it or not....glad to see our state has a say in it......","post_message":"Donald Trump will be back in the Granite State on Monday: @webpagelink"}]
