[{"comment_id":"421180878069520","commenter_b":"^^ this idiot supports sanctuary cities and providing safe harbor to illegal alien criminals","commenter_a":"Hillary belongs in prison.","post_message":"More than $400 million has poured into the presidential race so far."},{"comment_id":"690501341083047","commenter_b":"We don't have to deport them all. 1. Enact extremely harsh prison sentences and fines for their employers. 2. Cut off all government entitlements to them, including drivers licenses. 3. Open service centers South of the border specializing in United States work permits for any company needing cheap foreign labor. Said employer would be responsible for all housing , food , transportation costs and hospitalization. The only way to get a job here would be to sign up in Mexico! Then wait just like the rest of the world has to. Enact those measures and most will self-deport! Those who don't are criminals and harshly dealt with! All anchor babies should be stripped of citizenship and also deported. Enough of these criminal aliens!","commenter_a":"What George Lopez said ain't much better than what Trump said! They are both wrong! This country was built by immigrants and most of them came here illegally including the white man! The only Americans are the native Americans everyone else is an immigrant! Native Americans didn't invite immigrants here! So don't fool yourselves! White man came here illegally! Massacred native Americans brought black slaves illegally and now have a problem with Mexicans! What a joke! Mexicans don't come here to take your jobs! They do the jobs that your too lazy to do and won't do them! White people go to these countries to get there labor and no one says nothing about that!","post_message":"Ummm ok?"},{"comment_id":"10155010955881350","commenter_b":"I need that hippo.","commenter_a":"Sydney Elise Harville","post_message":"WATCH: Make your Monday better with this hippo waddle. @webpagelink"},{"comment_id":"10152965357956336","commenter_b":"Lets face it, the ppl this upsets the most are the females that could never pull it off.","commenter_a":"I think all you who say it's too far are the same ones waiting for fifty shades of grey.","post_message":"Did Sports Illustrated Swimsuit go too far this year?"},{"comment_id":"517364508436536","commenter_b":"The other candidates are disappointed because they need Trump's ideas","commenter_a":"I wander if I can have my cable provider remove FOX channel from airing in our home period...ha..oh, I can do that. #TRUMP !!","post_message":"The Trump campaign is saying that Donald J. Trump will skip Thursday’s Fox News-Google #GOPDebate. @webpagelink"},{"comment_id":"1583049088381782","commenter_b":"@username crazy women beat their selves up.","commenter_a":"Before this is over, the \"two women\" will be just ONE MAN, and the \"abduction\" will likely turn into an \"affair\". The reason why she is saying it was women, is so that there's no suspicion of rape. = Less of an investigation.","post_message":"Authorities are searching for two women suspected in the abduction of a California mother. via NBC Bay Area"},{"comment_id":"10154969261836320","commenter_b":"So sad Amen","commenter_a":"Dammm i had no idea","post_message":"We're remembering actress Brittany Murphy who tragically died in Los Angeles on this date in 2009. She was just 32."}]
