[{"comment_id":"10153572381213984","commenter_b":"Real Americans care, libtards don't give a damn, want more illegals here!","commenter_a":"So sorry......","post_message":"One man whose life was forever changed the day his teenage son died at the hand of an illegal repeat offender is now embracing one 2016 candidate's message. Do you agree with what he said here?"},{"comment_id":"10154473389496336","commenter_b":"Hahaha we thought same thing.","commenter_a":"Lmao! So the DNC asked the lady who caused all the chaos in Baltimore to restore order ?? Wow ! The DNC is in trouble","post_message":"Baltimore Mayor Stephanie Rawlings-Blake gaveled in to bring the Democratic National Convention to order, after Debbie Wasserman Schultz excused herself from the role amid controversy regarding leaked DNC emails."},{"comment_id":"678779465606192","commenter_b":"Woman you are so ignorant!","commenter_a":"Well hillary killed people so she should be arrested and u should be to for sticking up for her","post_message":"It's funny how that works, isn't it? Like Addicting Info for more great content!"},{"comment_id":"1524641694504572","commenter_b":"@username Bernie wants you to suck off all the boys in Chicago so their bitches can have a night off","commenter_a":"All the protesters want the other candidates only one protester in question was for Trump and he was 87 and still willing to fight for what was right","post_message":"John Kasich is a _________."},{"comment_id":"10152721939436051","commenter_b":"Your a cunt ya bitch","commenter_a":"Dumb bitch she would of been mad if the made her fat ass look fater","post_message":"This girl couldn’t believe what her school did to her yearbook photo."},{"comment_id":"417605495104769","commenter_b":"Ummm hmmm. Now ask YOUR grand parents and the rest of YOUR family. Bitch PLEASE lol","commenter_a":"FUCK ALL Y'ALL WHITE AND FAT UGLY MATHERFUCKER! OBAMA OBAMA OBAMA OBAMA OBAMA OBAMA","post_message":"Malia Obama Just Challenged Tiffany Trump, Learns Quick Lesson The Hard Way. You don't mess with the Trump family. Can we get 30,000 'LIKES' for Tiffany Trump?"},{"comment_id":"10153140551051051","commenter_b":"Absolutely. It's a broken system. What I don't get is that in any other country if you enter the country illegally, you get sent back. Why is it soo hard here for that to happen? It's a bigger problem then an illegal person killing another person. Maybe it's time to close the borders and get our country and its laws in order?","commenter_a":"deport trump to mexico...","post_message":"The man who had been deported 5 times before killing an innocent S.F. woman entered a surprising plea. Do you think he's an example of how the current immigration policy isn't working?"}]
