[{"comment_id":"10154027159919087","commenter_b":"And I don't care if the illegals are brown, Yellow, red, black or white. They are here illegally and illegal is illegal PERIOD!","commenter_a":"Can he protect my children from crazy white dudes shooting up schools or movie theatres? Or other domestic terrorist that are US citizens? Get out of here with that bullshit! Our own people kill us!","post_message":"'[Donald J. Trump] is the only one who can protect your children from being slaughtered like my son was,' said one mother, who said her son was killed by an undocumented immigrant."},{"comment_id":"341937372643300","commenter_b":"Do you consider such hate to be Godly?","commenter_a":"It simply explains our Republic ...For which it stands....We are one Nation under under God...ALWAYS....OUR GODFATHERS KNEW THE MEANING OF REPUBLICS...Look it up...The American Flag is Our heritage....Obama is illegal trash....his followers as well...Demorats.s have sunk lower every year...This Obama is a bottom scraper...Clinton And Sanders are also bottom feeders.They NEED to be removed from office ...Ungodly monsters...","post_message":"I agree!"},{"comment_id":"640100692862928","commenter_b":"Trolls- in 4 years we have elections again- what if next time the candidate you don't like cheats to win? Will you be OK with a corrupt election system then?","commenter_a":"THEY HAVE A RIGHT TO TRY TO STOP IT JUST LIKE YOU THINK YOU HAVE A RIGHT TO DO IT.","post_message":"The fight for #Recount2016 continues! We deserve a voting system we can trust, that is accurate, secure and just. Despite the sabotage, political cronyism, bureaucratic hurdles, economic extortion, and legal maneuvering that has been thrown in our way, this historic first-ever multi-state presidential recount carries on. I'm here to give you the latest updates, answer your questions, and talk about next steps."},{"comment_id":"1746066945644780","commenter_b":"Sickening","commenter_a":"If Hillary wins we are fucked. All will end for this once dear nation. Adios America this nation is now a dump China & Russia are the leading nations now. Deceiving Hillary is going to backstab everyone. She will do anything to get your vote but at the end you will see her lies.","post_message":"Does Trump's violent rhetoric and bigotry remind you of something? Let's take a look back at history and find out...  Big thanks to Marianne DeMarco for making this video."},{"comment_id":"650282881785927","commenter_b":"She is such a fool. And not even a human. She needs to be in jail","commenter_a":"Putin looks at Killary, like you are in way over your head old lady. Don't even try to match wits with me.","post_message":"Busted: Clinton News Network's 'Fact-Check' Proven 100% False!"},{"comment_id":"10153805659416167","commenter_b":"For some reason I don't find the position of first lady (as you put it) as important as President. He cheated on his wife, maybe you've never done that, but there's many people ou t there who have cheated on their significant others. Not saying it's right of course, but the other presidential candidate cheated on his wife(s) also and I know the Republican's like to compare other political people when they're accused of something. Look at Trumps wife and her past. Do you really think she should be living in the White House? She's not even from America. Not that I think that's a good enough reason, but I know how you Republicans feel about immigrants. If you look at the naked pictures of her you may also feel she doesn't belong in the White House for that reason. Not that I think that's a good enough reason, but ...","commenter_a":"IMAGINE if you can...a useless, disgusting, nasty, corrupt, rapist, POS perverted woman abuser as our 1st Lady...Billy the perverted Clinton!!!","post_message":"Good grief. Uhh Joe why are you just mentioning this now?"},{"comment_id":"10153544562557411","commenter_b":"Maybe if he didnt talk back, laugh and pull away, they would have let it go!!","commenter_a":"How can u steal FREE milk?? Lol smh....","post_message":"'This is ridiculous... this is beyond embarrassing... he's at home for 65 cents.'"}]
