[{"comment_id":"1642423912674968","commenter_b":"@username health INSURANCE is NOT health CARE","commenter_a":"Wait....hold on a second. Usually stories like this are about people fighting to keep someone alive who wants to die. This time, this poor guy wants to live and the hospital wants to take his life, while he is coherent and of sound mind? I didn't read the story, but I would bet this is all because of $$$ or medical insurance!","post_message":"Heartbreaking video shows Chris Dunn nodding and putting his hands together in prayer when asked if he wants to live."},{"comment_id":"10155082864963690","commenter_b":"India and rape can't seem to stop. :(","commenter_a":"indian armies ..............thuuuuuuuuu........","post_message":"\"Victims gave the names of the policemen involved in the barbarity - but nothing has happened.\""},{"comment_id":"833282530101334","commenter_b":"Oh Terry your pro pic explains it all lmfao","commenter_a":"Tell me what isn't wrong with this picture.","post_message":"Bush. Romney. Utah. One day only."},{"comment_id":"1728076730757228","commenter_b":"The pathetic woman never smiled....good riddance!","commenter_a":"I am truly sorry that Carly dropped out. I do think you would make a great Vice President. Your knowledge and experience will go s long way. Thank you for throwing your hat in the game.","post_message":"BREAKING: Carly Fiorina is ending her bid for the Republican presidential nomination."},{"comment_id":"1858209934411861","commenter_b":"She just needs to fuck off and die!!!!","commenter_a":"You should be out of Washington altogether forever..and out of California. We really don't want you here or representing us in any way.","post_message":"Pelosi calls FBI Director Comey's letter about the investigation into emails related to Clinton's server before the election a \"foul deed\" and should be investigated. Do you agree?"},{"comment_id":"614399705409669","commenter_b":"@username NO ONE IS AS CORRUPT AS SLICK WILLY & SLICK HILLY!","commenter_a":"If Trump has done anything he has brought attention to the corruption in government!! Old man Bush cannot stand that Baby Jeb was soiling his diaper on the debate stage....it's all about $$$$ & the fact that the Clintons charged $250,000 for their fundraiser the other night should make hard working taxpayers sick!","post_message":"Kathleen Kennedy Townsend says former Republican President George H.W. Bush told her he's voting for Hillary Clinton."},{"comment_id":"1301581083201877","commenter_b":"This guy is pushing an agenda !!!! Creepy","commenter_a":"Mercy","post_message":"Really? Maybe if Christians had more walls, the Muslims wouldn't have conquered the Middle East and large parts of Europe from the 7th to the 10th centuries."}]
