[{"comment_id":"1123835504398528","commenter_b":"Fuck that stupid ass","commenter_a":"You are a complete asshole if you think this is a political issue IS AN AMERICAN issue and every single one of us should have a problem with this!","post_message":"So if we want the truth, that makes us disloyal? Bullsh*t! --Andrew"},{"comment_id":"692747934208970","commenter_b":"If illegal aliens must be allowed into our colleges, they should be charged twice the tuition as out-of-state students, with no eligibility for any financial aid, and any courses that legal aliens are taking in order to obtain citizenship be mandatory.","commenter_a":"He'll no!","post_message":"Do you think illegal aliens have a right to attend taxpayer funded public universities?"},{"comment_id":"750335681823676","commenter_b":"Trump and his mindless supporters are a NATIONAL EMBARRASSMENT !!","commenter_a":"Trump gonna have alot obama f-ups to fix right","post_message":"BREAKING: Trump Drops Bombshell About Obama... He Just Exposed The Unthinkable He is trying to cover this up as quickly as possible. Let's spread it. Do you think Trump would make a better president than Obama?"},{"comment_id":"10158320001025294","commenter_b":"I agree!! If your DNA IS ON THE VICTIM..SPEEDY DEATH!!","commenter_a":"I beleive in crimes like this. Should be Swift justice if you're found guilty nothing less then the death penalty and in a short period of time 3 days fir greiveing for convicts family and then serve sentence out!","post_message":"The suspect is a registered sex offender. \"Our investigators didn’t stop. The culmination of their efforts is the arrest of a person who we need to make sure never touches our streets again,\" said Cleveland's police chief as he announced an arrest in the case."},{"comment_id":"10152769527894877","commenter_b":"No. Ladies came up short they guys didn't end up in the board room. Lamas was dead weight though.","commenter_a":"I thought the female team won their challenge. Why did she get fired and not lamas?","post_message":"Keisha Knight Pulliam Fired From 'The Apprentice' For Not Calling Bill Cosby And Asking Him For Money. Watch it and read more here. Grio fam, was this at all fair? Sound off."},{"comment_id":"10154105541082093","commenter_b":"Yea man! Go Donald. Get rid of the illegals. I can't wait","commenter_a":"Jeff Sessions = KKK! Another good ole boy for Donald trump...","post_message":"They held up hand signs saying, \"Go Jeffie Boy!\" and \"KKK\" ... The Alabama Republican was rejected for a federal judgeship 30 years ago amid accusations of racial insensitivity... @webpagelink"},{"comment_id":"684458911714062","commenter_b":"Not this dumbass lady again","commenter_a":"\"Surrogate?\" That's his campaign CHIEF!","post_message":"¯\\\\_(ツ)_/¯"}]
