[{"comment_id":"10150716535004999","commenter_b":"I forgot to add that Polish women are among the most beautiful ladies in the world.","commenter_a":"As an alternative to the Polin museum (which is excellent) I would recommend the Warsaw Uprising Museum, which also opened in the last few years. It is a very well designed and engaging museum that brings to life this difficult piece of World War II history.","post_message":"Warsaw is finally growing into its aspirations as Eastern Europe’s culture capital. Here's what to do if you're ever there."},{"comment_id":"1614697422150704","commenter_b":"We don't need these radicals in United States we have enough radicals of our own homeborn.","commenter_a":"Let her \"NEXT SPIT\" be in Saudi Arabia !!!","post_message":"Deport these radicals NOW!"},{"comment_id":"1807147956208492","commenter_b":"All of the above?","commenter_a":"@username. We should try this..","post_message":"Winter just got a lot more bearable."},{"comment_id":"10153479887206037","commenter_b":"There are no grounds to deny 3 women, 4 men or any number imaginable from acquiring a marriage license. Where does the number 2 come from?","commenter_a":"Good job supreme court! Whether you agree or disagree with same sex couples it is not our right to judge them. It is nobody on this earths right to judge anyone. May all same sex couples find happiness","post_message":"Follow our live blog for all the latest updates on the U.S. Supreme Court's #MarriageEquality decision."},{"comment_id":"10152588899470779","commenter_b":"Right girl","commenter_a":"Jarelie Anne McClusky can't fucking waiiiit","post_message":"Brett Morgen's documentary is more than just a must-see for Nirvana fans. It's an eight-years-in-the-making collective labor of love that offers a private peek into the artist's mind, from the first creative stirrings to the spiral downward. You don't just feel as if you've gotten to know the man better. You're left completely emotionally spent."},{"comment_id":"10157959432550354","commenter_b":"She belongs in prison. Trump for all Americans","commenter_a":"Poor behavior is poor behavior, no matter who does it! Teachers are now reporting a sharp rise in bullying and rude talking out and racist comments directed at other children after Trump began his campaign. If you are acting like an idiotic, alt-right Trump supporter at home, your children are seeing and hearing this and thinking this is how people should act. Stop it now! You are creating a whole new generation of haters.","post_message":"\"I believe they were paid to come attack Trump supporters.”"},{"comment_id":"1016358938401725","commenter_b":"MONEY !!!!! That's all they care about !","commenter_a":"probably worried about all the money they have stashed in offshore funds they may have to pay tax now","post_message":"\"I don't think I've ever wanted magic more.\" J.K. Rowling, James Corden and more British celebrities react to the historical #EURef vote. @webpagelink"}]
