[{"comment_id":"1570144263286969","commenter_b":"AMEN. Michele sure didn't/doesn't get it!","commenter_a":"I agree","post_message":"\"There is one crucial sentiment Donald Trump’s Slovenian born wife certainly didn’t copy from Obama’s — the inherent pride of being an American citizen.\""},{"comment_id":"981590648554229","commenter_b":"Let me know if you need any help doing actual research, as opposed to just spouting off your uninformed opinion, Skatie.","commenter_a":"Of course, Mother Teresa was NOT talking about abortion when she said that, she was talking about child poverty.","post_message":"Mother Teresa gets it right! What do you think?"},{"comment_id":"10153338669186323","commenter_b":"^That hyperbolic Feminazi your mother warned you about","commenter_a":"Yeah! It's Natalie PortMAN not Natalie PortWOMAN","post_message":"“It’s a very female thing of being afraid to say: ‘I’m the boss, and this is how I want it.’”"},{"comment_id":"10153105889332235","commenter_b":"Oh no! Someone stole my vagina!","commenter_a":"\"Like she'd protect her purse or phone\" not even touching the objectification of a woman's anatomy there, but yeah let's make it legal to steal those too, that'll stop people stealing them. Am I right!?!?!","post_message":"Just. Wow."},{"comment_id":"10154169792132629","commenter_b":"@username bye bitch","commenter_a":"BernieOrBust! We are giving the people in the remaining states the opportunity to make the right choice! This is not a threat, its promise! Thanks to social media we are constantly talking to each other, organizing and planning our next steps! The bigger picture doesn't have the Democratic Party playing a role if they are adamant about representing the 1%! Those of us who are Bernie or bust have no party loyalties! We don't care about what happens to the party if they don't care about us in the primary! It's just that simple Trump does not scare us. We plan to vote a bunch of Progressive's in the House to block his agenda, but Hillary scares us more! The ultrarich neocons in the right wing love her and hate Trump! That's a problem! She will get a lot of center right policies signed into law! And we will never ...","post_message":"Hillary Clinton won no delegates, because Washington Democrats already awarded them based on party caucuses in March."},{"comment_id":"1265274246854453","commenter_b":"Checks and balances in government is what our forefathers had in mind when creating this country -- to offset those may use position to do heinous things. Banning an entire religion isn't the answer - and yes, it IS banning a religion if you say Christians from these countries can come, just not Muslims.","commenter_a":"But how come , you know , if one who comes over , has bad intentions or not ? This kind of mindset is not too much different , from the mind set of nazis","post_message":"President Donald J. Trump tweeted a message about the federal judge who halted his travel ban."},{"comment_id":"10153257961321162","commenter_b":"They should crucify her.","commenter_a":"Wtf people come on!!","post_message":"DEVELOPING: The bodies of two children, ages 11 and 14, were found dead in a freezer, and the mother is being held as a person of interest @webpagelink"}]
