[{"comment_id":"10153051145414094","commenter_b":"And if gun laws don't work, why have any safety laws? Should hardware stores sell nuclear material because the bad guys will get anyways? Should we not have traffic laws because the bad drivers will run a stop light anyways and crash into a school bus?","commenter_a":"While Republicans were defending the lack of sensible gun laws and calling this an \"accident\", the families and communities of this Church showed such dignity and Christian values by first saying that they forgive the shooter. They are such an amazing example and inspiration to this country. God bless them.","post_message":"Relatives of people killed in a shooting at a black church in Charleston, S.C., addressed the suspect in court Friday In an extraordinary display of grief and forgiveness."},{"comment_id":"10154328122239641","commenter_b":"Right after you @username..... she will right after you.","commenter_a":"I hope Hillary drops dead before November.","post_message":"BREAKING NEWS: Donald J. Trump comes out of the Republican convention ahead of Hillary Clinton in the polls."},{"comment_id":"1404176169614167","commenter_b":"We disgusted to look at you and your ugly ass fucking husband !!!!!","commenter_a":"Not sure who you are polling.. please tell me why democrats lost so big this election... because people were disgusted with her and her husband!!","post_message":"Michelle Obama continues to rank as one of America's most admired First Ladies. Do you admire her?"},{"comment_id":"10153513286844575","commenter_b":"This lady is clueless lol","commenter_a":"This is sad leave churches alone go to a justice of peace & get married the ones trying to sue they think it is a way to get rich it makes me sick","post_message":"Four Kentucky couples are suing a clerk who is refusing to issue gay-marriage licenses — or any marriage licenses at all.  Rowan County Clerk Kim Davis says her Christian beliefs prevent her from complying with the #SCOTUSMarriage decision, so she will no longer issue marriage licenses to any couple, gay or straight."},{"comment_id":"639140816274210","commenter_b":"Just like your whore mother.","commenter_a":"She is a pig.","post_message":"I am sick and tired of Michelle Obama and her family in the White House...GET OUT!"},{"comment_id":"10153490058828352","commenter_b":"Dumbest comment I've read. You're pretty much agreeing with this greedy ass woman.","commenter_a":"Even though this is crazy...thinking about it though if it werent for her he wouldnt be where he is today so...she really shouldnt have to ask...SINCERELY!","post_message":"Former NFL player reveals his mother demanded $1m after he was drafted ‘for raising him for 18 years’"},{"comment_id":"870170056373024","commenter_b":"Illegal aliens yes. Immigrants that come in legally and get properly documented should be allowed work as long as they don't have a disease or criminal record.","commenter_a":"Me too","post_message":"71% of voters said they would be in favor of Congress passing a law making it illegal for businesses to hire illegal aliens. Don't you agree?"}]
