[{"comment_id":"331807290546859","commenter_b":"Dump trump and his bitch wife","commenter_a":"trumpers are ALL bullies! Only bullies attack a man 4 against 1, not to mention punching a poor old dog.... Their mothers must be so proud","post_message":"Trump, your 'bad hombres' are right here.  Shared by Occupy Democrats. Video credit: ABC 7 News - WJLA."},{"comment_id":"10154570466249575","commenter_b":"Funny how a white teen cant even go to a middle school without murdering a classroom full of people. Funny how a white man cant go into a black church and not kill 8 or 9 people. Funny how a white man cant be around his cousin without sleeping with her","commenter_a":"Amazing how I can attend a tractor show in middle America with 100+ people and not one person was shot,stabbed,assaulted, but yet have one black cookout and all hell breaks out","post_message":"This man is facing preliminary charges of attempted murder and criminal recklessness after police say he shot two men having a backyard cookout Saturday.   Officers say the incident started when the suspect confronted the men about a vehicle blocking the alley where he was trying to drive."},{"comment_id":"894715537301698","commenter_b":"The best thing you are doing, Mr. Trump, is weeding the un-Americans out from our society. You are already making the change for America being great.","commenter_a":"@username how was your preteen sexparty with you friend Epstein. It sound s you got a problem dude. Defloration of a 12 year old girl is not ok, if you know what I mean","post_message":"The \"protesters\" in California were thugs and criminals. Many are professionals. They should be dealt with strongly by law enforcement!"},{"comment_id":"1149160438565158","commenter_b":"Only if they are able to drive!","commenter_a":"Go trump","post_message":"10 states now offer driver's licenses to illegal aliens. Don't you think this is WRONG?"},{"comment_id":"10152779162447144","commenter_b":"shameless woman","commenter_a":"Send them back!","post_message":"These remarkable photos show the conditions that are driving the exodus to the United States."},{"comment_id":"10153356544334087","commenter_b":"Yep.","commenter_a":"Hillary should worry about that indictment coming down the pipelines in January.","post_message":"“This is truly unbelievable, that after what we’ve seen in Paris and other places, Republicans will not bring up a bill that will prohibit anyone on the no-fly list from buying a gun in America,\" Hillary Clinton said. \"If you are too dangerous to fly in America, you are too dangerous to buy a gun in America. How many more Americans need to die before we take action?”"},{"comment_id":"10153942138341770","commenter_b":"She is disgusting!!","commenter_a":"Now we don't have to look at her on the Voice with that nasty tongue, hope she's packed","post_message":"Don't let the door hit you on the way out!"}]
