[{"comment_id":"10152769527894877","commenter_b":"No. Ladies came up short they guys didn't end up in the board room. Lamas was dead weight though.","commenter_a":"I thought the female team won their challenge. Why did she get fired and not lamas?","post_message":"Keisha Knight Pulliam Fired From 'The Apprentice' For Not Calling Bill Cosby And Asking Him For Money. Watch it and read more here. Grio fam, was this at all fair? Sound off."},{"comment_id":"10153749043211159","commenter_b":"Our Country? Go back to Iran you POS!","commenter_a":"no","post_message":"The White House is back on it..."},{"comment_id":"736146246538727","commenter_b":"Big girl had to run!","commenter_a":"It appears the fat lady gave the skinny lady a good beating. She shouldn't have touched her. She appeared to be shielding her head and face as she was pounced on. Then, she gets in her car, probably not thinking rasionaly and overwhelmed by the incident, she blacked out and just lost it. She definitely was not acting in her right mind. She felt shielded in her car and since she couldn't beat them all up, took it to a whole new level. Neither of their actions are justifiable but that big girl needs to be taught a lesson to never ever touch anyone or beat on anyone like that ever again. Clearly, fatso is from the ghetto and couldn't control herself.","post_message":"A parking lot brawl between two women over a parking spot quickly turned into a demolition derby. How could you explain this to your insurance company? // Courtesy: GrindFace TV FULL STORY: @webpagelink"},{"comment_id":"10153221947888984","commenter_b":"I pray Bibi wins. I believe he will, because if the Lord is on your side, who can stand against you?","commenter_a":"Please vote wisely Israel; the world needs Bibi to lead in the fight against Iranian nukes. Our administration won't, so we need you to lead the free world.","post_message":"It's down to the wire in Israel, as anti-Bibi Obama keeps a close eye on critical elections there. Do you support Bibi Netanyahu?"},{"comment_id":"1019119028118150","commenter_b":"Majority of the worlds wealth belongs to Caucasians. It's not news anymore.","commenter_a":"Wow lost all respect for this station. Seriously? I know there is more important news that doesn't have to deal with comparing races.","post_message":"Report: Whites have 12 times the wealth of blacks See study--> @webpagelink"},{"comment_id":"10153141257132490","commenter_b":"Seems like it's the only thing they are worried about .. LEAVE THEM BE. focus time and energy elsewhere. Geeeeesh!!!!!!","commenter_a":"For god sakes leave the uniforms alone!! They are fine as is.","post_message":"YOUR TAKE: CRACKERJACKS -- It's taken a decade to develop new service dress white and blue uniforms. Do you really need both types of crackerjacks? Send your thoughts to staff writer Mark D. Faram at mfaram@navytimes.com:"},{"comment_id":"1238359136216847","commenter_b":"Ah shut up!!!","commenter_a":"Ding- Dong.","post_message":"Come again??"}]
