[{"comment_id":"585422771627079","commenter_b":"I disagree. Trump will defeat the Liar Hillary.","commenter_a":"WELL IF 65-70% DON'T WANT TRUMP AND HIS POLL NUMBERS ARE MUCH HIGHER THEN TED'S... THEN I WOULD THINK 90-95% DON'T WANT TED AND EVEN LESS WANT RUBIO...","post_message":"\"If Donald is our nominee, in all likelihood, Hillary wins, we lose the Supreme Court for a generation, the Bill of Rights is lost, we're buried in debt, and jihadists rise across the globe,\" Ted Cruz said. Do you agree?"},{"comment_id":"1312709298805295","commenter_b":"GOD BLESS THE REAL WOMEN IN THIS COUNTRY! No vigina hats here","commenter_a":"I'm proud of them!","post_message":"HERE ARE SOME WOMEN WHO MARCH FOR OUR RIGHTS"},{"comment_id":"1754483651501060","commenter_b":"When they take our gun rights away, what are we to protect ourselves with when evil terrorist get guns off the black market? And don't people see that more people are killed by drugs and drunk driving in America than by people shooting others? They just want to take our rights away!!!","commenter_a":"Barbaric!!","post_message":"Watch Rep. Louie Gohmert shout \"radical Islam\" at House Democrats who were staging a sit-in on gun control. @webpagelink"},{"comment_id":"10154097033159117","commenter_b":"If you want to save money, deport Native-Born citizens. The immigrants cost less. @webpagelink","commenter_a":"our country is broke--go live somewhere else.","post_message":"\"So long as people are coming here to live peacefully and work peacefully, I think the government should have to show to us why they shouldn't be here.\" For the full video, go here: goo.gl/8DSL14"},{"comment_id":"1180908731937011","commenter_b":"YOU SUCK","commenter_a":"The Chinese asked the mongols the same thing","post_message":"ON IMMIGRATION: \"I have a hard line on this. We have a country or we don’t have a country. WALLS DO WORK! Just speak to the people in Israel. #GOPDebate"},{"comment_id":"694257180764860","commenter_b":"Oh please, these people are untouchable or she would have had in jail a long time ago.","commenter_a":"Throw her off the face of the earth along with Obama. .that would be the best thing for this country","post_message":"Insider information surfaces that will ruin Hillary's career forever. She's finished. Let's spread this. Can we get 30,000 'LIKES' to keep Hillary out of office forever?"},{"comment_id":"10154187969491615","commenter_b":"@username 99.9% could be prevented if the women had any morals....","commenter_a":"I hope everyone marching plans on adopting a kid or two. If your so concerned with the baby being born, you should actively participate in rasing it.seeing as the parents dont want to or they would have an abortion. So please sign up at the front entrance and take your unwanted child when you leave. Thanks for keeping kids outta foster homes and orphanages.","post_message":"This year is a historic one as Vice President Mike Pence is spoke during the march. It is the first time a president or vice president has taken part in the March for Life. _____________ UPDATE: (1:35 p.m.) The livestream has ended. Full story on.wpxi.com/MarchForLife"}]
