[{"comment_id":"1610662465894059","commenter_b":"And she should be out of a job.","commenter_a":"Yes","post_message":"\"These hands clean the rooms every single day for Mr. Trump so he can be rich.\" Meet the Trump workers who are not voting for Donald J. Trump @webpagelink"},{"comment_id":"10156317776015354","commenter_b":"Stupid ass!!!!","commenter_a":"Sounds like a plan to me.","post_message":"“No surprise that someone who makes a living glorifying crime and violence is a cop-hater, too.” MORE..."},{"comment_id":"10153253016300329","commenter_b":"I can almost guarantee that this lady is nowhere near as big as this dress makes her look. I personally think she looks pretty average. Size 12 or 14. I'm not \"fat\" but I would probably look like that in that dress, thanks to the perfect little human I made. Haha. It just isn't flattering, that doesn't mean anything about her body.","commenter_a":"The dress is not for fat people that is the issue lol","post_message":"ICYMI"},{"comment_id":"982783361781141","commenter_b":"Agreed but those who think she is a liar and a criminal probably won't be swayed regardlees. I think those \"on the fence\" folks will be the factor in the next election not the lemmings who accept whatever is feed to them. My optimism is shaky but I'm hopeful.","commenter_a":"I say, keep it up. Most people will see this for what it is .. a transparent attempt to stop Hillary from becoming President. Anyone who watched the hearing knows she was poised and presidential unlike the GOP committee members. Gowdy was an unknown laughing stock but not he's a famous one.","post_message":"In trying to save his committee and his reputation, Trey Gowdy is now saying that Hillary was the whole problem, rather than admitting that this 'investigation' is a sham. What are your thoughts on his accusation?"},{"comment_id":"953522348018789","commenter_b":"I demand that the offender's stop offending me. I'm tired of being offended. They get offended over Merry Christmas they get offended over In God We Trust, offended over the Ten Commandments... And the list goes on and on well if they don't like it move out of America.","commenter_a":"Why make something as general as a Cracker Barrel a racist issue? Stop creating trouble and problems needlessly! Enjoy this holy season and spread love and goodwill, not hate!","post_message":"Liberals are demanding that Cracker and Barrel change their name to this. We can let this happen. Let's show them our support. Can we get 30,000 'LIKES' to keep Cracker and Barrel the same?"},{"comment_id":"512673055591027","commenter_b":"She's such a joke.","commenter_a":"Why can't this woman get a job and shut up?","post_message":"Sarah Palin says she will work to defeat House Speaker Paul Ryan by backing his primary opponent in Wisconsin. @webpagelink"},{"comment_id":"10154256753938701","commenter_b":"ONLY IN AMERICA RACIST GET REWARDED","commenter_a":"Regardless of if you think the shooting was justified or not this is just callous and tacky. He honestly makes me feel ill.","post_message":"UPDATE: The gun listing has been taken down from the auction site."}]
