[{"comment_id":"10154846804139411","commenter_b":"Goat fucking muslims","commenter_a":"Stupid curry eating Hindus","post_message":"'Not in the spirit of a Sport'"},{"comment_id":"1823696047877973","commenter_b":"She is just jealous.","commenter_a":"Rosie is a washed up loser who thinks we care what she says. We know exactly what and who this disgraceful person is.","post_message":"OUTRAGE...! Rosie O'Donnell TWEETS naked photo of Melania Trump when comparing her to other First Lady photos. WARNING: Nudity. @webpagelink"},{"comment_id":"10153738689479032","commenter_b":"Thanks to those who muck it up for other people. Your stupidity is so appreciated. Stop breeding too.","commenter_a":"Maribel Maldonado","post_message":"Visiting Fossil Creek? As of May 1, you need a permit. @webpagelink"},{"comment_id":"10150604575769999","commenter_b":"Why do you suppose all those things are necessary for women? Come on, think!","commenter_a":"Overcoming the confidence gap? Thanks for your concern NYT but I'm doing just fine. I'm so sick of people telling me how disadvantaged I am as a woman. Women get alimony, the children, special scholarship opportunities, special mentorship opportunities, special conferences, support groups for violence against women, priority disembarking off the titanic, the seats on the crowed bus, and the list continues... Let's face it, men are disadvantaged now.","post_message":"While men often overvalue their strengths, women too frequently undervalue theirs. Call it a continuing confidence gap."},{"comment_id":"10156459147080354","commenter_b":"if you went to stop all this killing then we have to get all the dam muslims out of America they don't care about living they been killing each other for years and now they are doing it here I hope America will open there eyes and make this move","commenter_a":"Don't worry everyone the government is screening all of these Syrian refugees.","post_message":"***BREAKING*** Muslim Killer Tashfeen Malik was in America on a K-1 (fiancée) visa and held a Pakistani passport. DEVELOPING..."},{"comment_id":"10154449540370586","commenter_b":"That's bull learn something we do think for ourselves besides the president of the church knows she is evil educate yourself instead of spreading lies. Most Mormons are voting Trump or another candidate","commenter_a":"Most of the truly faithful Mormons will just vote for whoever church leaders tell them to, just like good little sheep... Both candidates should be in private talks with the church","post_message":"Democratic nominee Hillary Clinton’s campaign has launched “Mormons for Hillary” in an effort to woo people in red-state Utah to vote for her. Is it working?"},{"comment_id":"1017996811629034","commenter_b":"Wat a dumb bitch","commenter_a":"PUT YOUR GUNS DOWN????? What the fuck she's stupid","post_message":"This Black cop is furious about other cops not owning up to police brutality."}]
