[{"comment_id":"10152899941331336","commenter_b":"Sick woman","commenter_a":"This young lady will burn in her afterlife.","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."},{"comment_id":"10153816896676337","commenter_b":"'Bitch! Now turn the other cheek!'","commenter_a":"Jesus needs to come back and give this Pastor a firm pimp hand.","post_message":"The Pastor leading the Starbucks red-cup charge got disconnected and laughed at on TV..."},{"comment_id":"10152639430074071","commenter_b":"As a kid I really enjoyed the Daredevil movie. Watching it now... yeah lol. I do like the character though. I hope Netflix does it right :)","commenter_a":"Rodrigo Rubio Camara","post_message":"It's time to welcome him back."},{"comment_id":"10153816653768854","commenter_b":"Did you see the gaggle of stupid white girls in the 'shield?' I wonder why they hate their daddies so much.","commenter_a":"All that money spent, all the debt incurred, to produce kids like that.","post_message":"Liberalism is a Mental Disorder: Professor of Media Threatens Media with Mob Violence for Trying to Film Protest  [VIDEO]"},{"comment_id":"10153146887251955","commenter_b":"She is ugly like hell!!","commenter_a":"Hair fell out because nothing in her head to attach to","post_message":"Bald first lady?   'Jeopardy!' appearance raises questions"},{"comment_id":"1196791103694693","commenter_b":"David, better vote for anyone on the GOP side than voting for the criminal Hillary 'Cankles' Clinton. The woman should be in prison.","commenter_a":"DO NOT be complacent. Progressives need to come out in the MILLIONS and vote. Otherwise, the Republicans/teaparty, who sold out to crazies who actually want to take a dump on the Constitution and make America a 'Christian' Theocracy, will win.","post_message":"Republicans are losing ground in key demographics."},{"comment_id":"10153622480508690","commenter_b":"Nna, infact you get am","commenter_a":"And this is not a problem at all to the world peace, unless when Israel bombs Hamas terrorists, then it will be a problem for the world peace. Hehehehehehehehe One good thing people should learn is that Muslims from the unset, have always wanted to dominate. Whether Muslims like it or not, Israel of today will never succumb to them again. If Israel is the problem of the world, then Palestinians should try and leave the land of Israel and let's see whom Israel will kill again. Thousands are dying in Syria, Yemen and Iraq, yet it's not a problem to the world peace. Tell that to the birds. Never ever succumb to the demands of any Muslim community, if u give them one today, tomorrow they will demand for 3. Always push them back or they will over run u. This is why i pity Europe,maybe they are not ...","post_message":"Syrian government has conducted nearly 7,000 air strikes during the month of July, according to the Syrian Observatory for Human Rights, making it the most intense bombing reported in one month since the beginning of the conflict in 2011. @webpagelink"}]
