[{"comment_id":"986428001390952","commenter_b":"If she doesn't like it let her go back to where she can ask for what she wants and expect to get it because she's Muslim. If one doesn't like our rules go somewhere else.","commenter_a":"Simple solution open and pour content of can into cup in front of customers","post_message":"Your thoughts?  STORY: @webpagelink"},{"comment_id":"10152764552031491","commenter_b":"Yes. A woman can be a missionary or a nun. But why not be a priest too? Why is this off limits? What is it about women that make them unacceptable?","commenter_a":"Ponder on Mary's llife. have a virtue of humility. For the women, if you have calling to the religious life, you can be a missionary or contemplative nun. Be prayerful anyway, the right of women is not violated instead it is transcen! Pray for the gift of wisdom and understanding. Long live Pope Francis!","post_message":"Pope Francis gave a firm no to female clergy, while saying he wants to see a “greater role” for women in Catholicism."},{"comment_id":"10158374011905206","commenter_b":"Sucks to suck Donald Duck","commenter_a":"Trump has created more jobs in New York than any politician, yet they screw with him because..... You know ..... Politics.","post_message":"The Attorney General ruled that the Donald J. Trump Foundation had been raising cash in the state this year when it wasn’t registered to do so — a violation of state law."},{"comment_id":"932489970229038","commenter_b":"Nothing compares to what Bill Clinton did as Gov of Ark, and in the White House with Monika Lewinsky and other women..same with John F Kennedy, with Marilyn Monroe, and mistress of a Gang boss, and nude swimming parties. They both dis honored our White House...where was the media..and why were they voted in twice...","commenter_a":"I agree! Mr. Trump has changed in the past 11 years but Hillary Clinton has not except for the worst!!","post_message":"Dr. Robert Jeffress, Senior Pastor of the First Baptist Church in Dallas, Texas, stated that he still supports Donald J. Trump, despite the GOP nominee's controversial 2005 comments."},{"comment_id":"1213918441976908","commenter_b":"She should step down, even if she did win, God forbid , she won't make the first half year..","commenter_a":"Ken put the straw down","post_message":"She's dying!"},{"comment_id":"570057943197857","commenter_b":"Agree with you @username","commenter_a":"That too faced Lib says things a sailor wouldn't say on a drunken night","post_message":"Jamie Lee Curtis ripped Donald Trump for his 'lewd' comment on Lindsay Lohan."},{"comment_id":"10153457931491130","commenter_b":"Zane Gutierrez","commenter_a":"The politics of this is, scandalously ,that its a way for the establishment to write people off , they do not want to understand., There is so much hypocricy on this particularly in relation to alcohol : whats wrong with wanting to feel good , which is why anyone tries to get high off anything ?How we try to achieve this might be questionable but anything can be abused, does not make it bad in itself . people would not do self-destructive things if they felt self-worth. As some people here have said in their comments here,learning to love themselves was key to giving up the addiction .(not read the article btw)","post_message":"'We put people who are not well in a situation that makes them feel worse and hate them for not recovering.'"}]
