[{"comment_id":"10153839105457994","commenter_b":"What a sassy little shitbag ... definitely you 😉","commenter_a":"Jamie spirit animal","post_message":"Because sometimes, you just need to tear apart a room. Have a great weekend."},{"comment_id":"517589811698946","commenter_b":"No it is a religious theme park what is wrong people want to let Muslims in our schools and force our American children to learn there karen but they don't want a Mural of God in a theme park .","commenter_a":"Freedom of speech. Don't like it go to another country.","post_message":"A theme park in Orlando with a Christian message was challenged by the Freedom From Religion Foundation over a mural that could be seen on the highway."},{"comment_id":"10154645431764445","commenter_b":"Why? Herr Drumpf is a racist bigoted sexist pig","commenter_a":"Of course he's white","post_message":"BREAKING: The suspect in the deadly Washington state mall shooting is in custody, according to officials: @webpagelink"},{"comment_id":"415787422087411","commenter_b":"Many more American waiting for jobs now, so if your illegal, then bye, bye. If your immigrants better get back to work, that is what you came to America for.","commenter_a":"Carol Johnson","post_message":"#DayWithoutImmigrants: Immigrants across the country are expected to stay home from school and work today to show how critical they are to the U.S. economy and way of life."},{"comment_id":"912344515551025","commenter_b":"Illegals are taking jobs we Americans can't or won't take...","commenter_a":"Well I like Cruz...a lot. My husband and I both voted for him. He's a true conservative and defender of the constitution....","post_message":"Ted Cruz voiced his strong opposition to President Barack Obama's lax enforcement of our nation's immigration laws, arguing that his policies have led America down a path of economic turmoil. @webpagelink"},{"comment_id":"1187260984619751","commenter_b":"Build the wall then bill his estate","commenter_a":"Build a wall on the edge.","post_message":"Tell the truth....what would you do?"},{"comment_id":"1733461333592333","commenter_b":"Build that wall! ! !","commenter_a":"Deport them all","post_message":"Democrats gave undocumented immigrants and their concerns a featured role on the first day of the Democratic National Convention, drawing sharp contrasts with Donald J. Trump and his hardline proposals on immigration."}]
