[{"comment_id":"10155057562030725","commenter_b":"\"Bu-but! If we ban guns evildoers would be unable to buy them!! Rig-Right?\"","commenter_a":"you are so right MR, TRUMP ,","post_message":"If the people so violently shot down in Paris had guns, at least they would have had a fighting chance."},{"comment_id":"825939240815639","commenter_b":"Us as well!!!!! IF people do not want the AMERICAN FLAG, THEY SHOULD GET THEIR BEHINDS OUT OF AMERICA......PERIOD!!!!!!! Jo","commenter_a":"Fidiots, this is America, the laws they are SUPPOSED to enforce are AMERICAN laws. I'm so tired of the constant assault on my flag and my country.","post_message":""},{"comment_id":"10152956106239877","commenter_b":"It always existed except my dark skinned Sista women had it worse.","commenter_a":"True statement Colorism exist","post_message":"'Empire' Actress Grace Gealey: 'I Was Discriminated Against For Being Light-Skinned.' Read more on her revealing statements here.  Grio fam, sound off with your thoughts on all she had to say."},{"comment_id":"1532142173492916","commenter_b":"Oh we will because we need to stay united and fight. I mean go out there and protest, boycott Trump businesses, follow advice of people like Michael Moore, Bernie Sanders, Keith Olberman. I am saving my money and will travel to places where protests will be visible and impactful. Also, we have to find a way to help each other. Si se puede.","commenter_a":"2018 is just around the corner. We will clean house and send republicans packing!","post_message":"Conservatives will do anything to win what they perceive as the \"culture war.\""},{"comment_id":"10153430639944255","commenter_b":"This woman wants us to return to the 1950s? I guess that means she's going to shut up and make me a sandwich.","commenter_a":"Around 70% of White America does not live in a diverse city as is, and this is the reason for so much suspicion about people of other races, and culture. I am not for this kind of self segregation, but at the same time I do not believe we should be about forcing people to live where they do not now live. Until we learn that people are people this will never change.","post_message":"Yes, this is a real post from a real elementary school teacher in Texas."},{"comment_id":"522407631280177","commenter_b":"Translation: her vagina scares me.","commenter_a":"Maybe it is because Hillary Clinton is just plain unlikable. I am not a Trump fan but will hold my nose and vote for him over her. Her voice scares people, she just can't connect with anyone. She is the female John Kerry.","post_message":"Hillary Clinton and Democrats think  or hope  that once the primary wraps up, tensions will subside."},{"comment_id":"1061299707312818","commenter_b":"What an ass! Leave already.","commenter_a":"yah these dumbASSES are going to tell me to be tolerant with the beheading of CHRISTIANS in the MIDDLE EAST, hay DUMBass just cause a lot of people cannot believe that you are a focking muzlum dose not mean I'm going to kiss the muzlumz assss as they behead more Christians, BTW who the fock are you to tell us to be tolerant with the shayton muzlumz? name one Christian that has beheaded a muzlum this month, or this year, or even this century, you bass TURD have allowed so many innocent Christians to be killed by your demonic muzlum family, you have their blood on your hands, and their blood is crying out to GOD ALMIGHTY FOR JUSTICE. allahoooo ACHK BARR and GRILL YOU FOCKING BASS TURD.","post_message":"The Obamas have always gleefully kicked Christians to the curb during Christmas. This year was no different."}]
