[{"comment_id":"10156197802695354","commenter_b":"More proof that starlets should keep their thoughts and actions to themselves.","commenter_a":"Trash ball----please take out with the rest of the garbage...!","post_message":"The America-hating, donut-licking, liberal icon, Ariana Grande, enlightens the country she hates yet again..."},{"comment_id":"10156658380360354","commenter_b":"Has anyone noticed how the name has changed from refugees to migrants. They are not migrants they are foreign invaders Some people will never learn. You need to know who you are letting in your country. Know the history of Islam. We need to wake up in this country stop paying people to come here and destroy us. This was copied from a post by William Parrott When politically correct, tolerant, and culturally diverse societies agree to Muslim demands for their religious privileges, some of the other components tend to creep in as well. Here how it works. As long as the Muslim population remains around or under 2% in any given country, they will be for the most part be regarded as a peace-loving minority, and not as a threat to other citizens. This is the case in: United States Muslim 0.6% Australia Muslim 1.5% Canada Muslim 1.9% China ...","commenter_a":"How can anyone say that their religion does not allow this violence against non - Muslims?","post_message":"“How dare you run away from us?” one Muslim man allegedly yelled. “Christian girls are only meant for one thing. The pleasure of Muslim men.”"},{"comment_id":"958480264190210","commenter_b":"From this little shrimp? He couldn't lick his lips!","commenter_a":"The high-water-mark of this idiot's journalistic career was his appearance on \"My Name Is Earl.\"","post_message":"It is amazing that Fox keeps Geraldo around. He does this childish stuff all the time."},{"comment_id":"1017433231703049","commenter_b":"Cách đốt mỡ =)))))))))))))))))))))))","commenter_a":"Vivi Nguyen733970070144470 á đm....","post_message":"This is a giant ball of fire ants."},{"comment_id":"1819660061616257","commenter_b":"Let me guess...She will be Secretary of Mental Health...F*cking Lunatic...","commenter_a":"OMFG","post_message":"WOW. We are officially an international embarrassment..."},{"comment_id":"10153010022651770","commenter_b":"They boy that was trying to force the little girl in the bathroom was asked why did you do that ,an the boy said ,thats what daddy does to mommy !!!!","commenter_a":"Little kids are not mature enough to determine if they are transgender. They have been brainwashed.","post_message":"Miraloma Elementary principal Sam Bass said the bathroom change is because between six and eight students have decided they are transgender, or are tomboys."},{"comment_id":"10154151758449087","commenter_b":"@username Oh, please. Where are the arrests, the charges, the trials? Where are they? When did they happen? Where are the files? The proof? And here's the thing: Bill Clinton is NOT running for president. Whatever did or did not happen in the past is a \"he said, she said\" situation at this point. Or really a \"she said\" situation, and sadly, a LOT of women go after powerful men, married men, etc., and then cry \"rape\" when they don't get what they want. And I say that as a woman who would f**king kill a man who raped me. And once again, Bill Clinton is NOT running for POTUS. Donald Trump is a low-class disgusting creature who should NOT represent this great nation on the world stage.","commenter_a":"Let me know when Trump does something as bad as LEAVE 4 AMERICANS TO DIE..then you will hear my outrage..but you won't hear it over some locker room crap that Trump said.. Toughen up cupcakes..","post_message":"#BREAKING: Mike Pence was reportedly \"beside himself\" after hearing Trump's obscene remarks about women, and Pence's wife was \"furious.\""}]
