[{"comment_id":"10155889196645354","commenter_b":"Trump that bitch!","commenter_a":"She has more wrinkles than my nuts. Americans are dumb enough to vote this tramp in.","post_message":"Short memory!"},{"comment_id":"450075515174329","commenter_b":"Jamal Mercer you realize that Plymouth Rock was landed in 1620 and that formal America wasn't til 1776. So your way off on \"over 500 years\" more like 200 years. And the majority of this country was built by Irish and Chinese labor not black. How come for hundreds of years Irish were slaves, yet Irish people don't use it as a crutch and a complaint of why they can't do something. 6 million Jews killed in the holocaust, that was from 1933-1945 that was roughly 1350 a day for 12 years. Yet Jewish people don't use it as a crutch and a complaint why they can't do something. Neither one of these groups were given nearly as much entitlement as the black community.... Yet the black community still complains that it's not enough that they can't get ahead. And yes most people look at black on black crime and ...","commenter_a":"What pisses me off is people that deflect this issue with Black on Black violence. Like y'all don't know that we just got rights in this country 50 years ago and the subsequent aftermath of white supremacy for over 500 years is the reason we live in impoverished areas with the shittiest schools. Y'all DO know that those circumstances breed violence right? Don't act like White men have not committed the most violent atrocities in this country since it's inception. Don't act like your \"discovery\" of America wasn't simply genocide. Don't act like multiple billion dollar industries that people still reap the benefits of today and in the future weren't built on free labor that black people don't see a penny of. Read sometimes. You will know why the black community has violence. Still to this day the most heinous crimes and serial murders are committed by white men. Sandy ...","post_message":"This story keeps evolving."},{"comment_id":"571042013020392","commenter_b":"If this is true, why doesn't every woman in America have problems????","commenter_a":"let them out . turn the puppys loose","post_message":"Every woman needs to read this!"},{"comment_id":"10153561023428984","commenter_b":"Go back home you stupid little bitch!!!","commenter_a":"Twitter Bomb her page till she leaves! REMOVE ALL of the spoiled \"idols\" your kids listen too, that say they Hate the Country that gave them the Opportunities to influence them!","post_message":"Globally known, pop-star diva Ariana Grande just told the world that she hates America... so karma just got its PERFECT revenge.  Her snobbery and selfishness are famous so this is not a huge surprise... she deserves what she gets."},{"comment_id":"10153513356977061","commenter_b":"Oh god please... What a fake","commenter_a":"Worst First Lady and president ever ....E V E R ...","post_message":"WATCH: Pres. Barack Obama and First Lady Michelle Obama do the Whip/Nae Nae at The White House Easter Egg Roll. abcn.ws/1VPZxxV"},{"comment_id":"1323559051002906","commenter_b":"YOU CAN'T TAKE OUR RELIGION AWAY FROM US.","commenter_a":"Keep it. Just don't use it when class is in session.","post_message":"Teacher Demands Christian Boy Surrender His Bible, He Says No, See What Happens Next Good for him. Let's show this young Christian our support. Can we get 30,000 'LIKES' for his refusal to surrender his bible?"},{"comment_id":"392182107608412","commenter_b":"He had a gun in front of him , h9w do you know his hands were uo you cant see shit . You fuckers are stupid to believe that its the cops fault or the military fault if not for either you fucking scumbags wouldnt have a place to trash , rob and i really can care less if you dont cosider me a fellow american if you believe that fuck was innocent your as bid of a piece of shit as he WAS dont even call yourself an american you fucking soft liberal scumbag go catch a bullet.and if you th8nk i cant handle a weapon then come up to ny and find out get the fuck out of my country and go fuck your allah in the ass","commenter_a":"Dont hate the cops, hate yourselves for breaking the law and being to stupid and lazy to get a job","post_message":"\"I ain't doing nothing. I'm not reaching for nothing, bro.\""}]
