[{"comment_id":"10154388275884087","commenter_b":"@username yes. Literally. @webpagelink","commenter_a":"He literally yelled \"Allahu Akbar.\" Why isn't anyone reporting that?","post_message":"#BREAKING: Russia’s ambassador to Turkey Andrey Karlov was shot and killed by a Turkish police officer who shouted \"do not forget Aleppo.\""},{"comment_id":"10153199211227235","commenter_b":"Stupid bitch. Go read the Constitution you're currently wiping your ample ass with.","commenter_a":"Omg! Go away please.","post_message":"GOOD GRIEF!"},{"comment_id":"10153384667464726","commenter_b":"I can't tell you how little I care about what this silly woman says.","commenter_a":"it,s more convenient being black these days!!!!!!!!!","post_message":"WATCH: Controversy is swirling in Spokane over the local NAACP president. She says she is black but her parents say otherwise..."},{"comment_id":"1607924772836368","commenter_b":"Yes young lady you can , just don't lie to the FBI , don't help rapist do 10 months for raping a 12 year old, don't stay with a man who had many affairs. There Are many women who can be great presidents , Hillary just isn't one.","commenter_a":"Not if you win Hillary! I fear that your election might irrevocably tarnish the idea of female presidency... Bear in mind of course, that we have to deal with a reality where people automatically stereotype and generalise...","post_message":""},{"comment_id":"1071265242982572","commenter_b":"Do NOT be BLINDED people for it won't be long before they find a way to seize everyone's guns- THAT'S WHAT THIS IS TRULY ABOUT- SMH","commenter_a":"You are representing terrorists","post_message":"Attorneys for the family of Keith Lamont Scott hold a news conference."},{"comment_id":"722009277961832","commenter_b":"Brunch?","commenter_a":"@username come visit","post_message":"Mark your calendars for Jan. 29. On that day only this year, more than 30 museums in Southern California will offer free general admission as part of the 12th annual Museums Free-For-All-Day."},{"comment_id":"1392748740784870","commenter_b":"Uh, he mowed down 100's of people. Definition of terrorist. Congrats on breeding and raising a supreme loser of the highest magnitude. Obviously he got his stupidity from you, seeing as you don't know terrorism when it sprung from your loins.","commenter_a":"Why did ISIS wait long before declaring the attack !! because it was not an ISIS member !!","post_message":"Family of killer insist he's 'not a terrorist'"}]
