[{"comment_id":"1126925213993897","commenter_b":"Woman*","commenter_a":"Women?","post_message":"This woman was found dead in a shopping cart -- and police have started a murder investigation. >> kiro.tv/BodyInvestigation"},{"comment_id":"1012314152218696","commenter_b":"Ungly Chelsea looks just like her father , Webster Hubble. What s slut that crooked Hillary!!!!!!!!","commenter_a":"Yes. Beauty & the beast think you can figure this out for yourself.","post_message":"Is turnabout FAIR play? This deserves about 25,000 'LIKES & SHARES'. Enjoy... @webpagelink"},{"comment_id":"1069898906439694","commenter_b":"Trump’s running out of nonwhite ethnics to demonize. And since he needs to keep interest piqued for his free media advertising to continue, I’ve thought of a few white demographics which would work for him: LGBT people are prime. Recently an evangelist speaker at a Ted Cruz related event called for the death penalty for them because the bible has passages calling for that. And there have been comments such as the one claiming that gays are responsible for most urban violent crime. Another is that they are trying to turn us all gay. So Trump could call for making anything but heterosex illegal. That should excite his base and get hyuge media coverage. Planned parenthood employees and doctors would be favorite victims. Trump could call for imprisonment of all PP employees and the death penalty for any doctor who has any abortions already on their record. They are totally ...","commenter_a":"'He has not proven to be somebody that has a firm grasp of policy.' Let alone reality.","post_message":"'He has not proven to be somebody that has a firm grasp of policy.'  - Jeremy Peters"},{"comment_id":"1114298202002104","commenter_b":"What do you mean? It's a horrible thing to say. But we have freedom of speech in this country. Her speech is protected by the constitution. She shouldn't get fired for it.","commenter_a":"So its only freedom of speech if it's against Republicans? If the Democrats played on a level field they would get destroyed even more!","post_message":"The director of a nonprofit agency who called Michelle Obama 'an ape in heels' has been fired."},{"comment_id":"1470713222988421","commenter_b":"Typical British woman. No morals, no values.","commenter_a":"Is this worthy of a news item? I think not.","post_message":"She text him the picture weeks later after not seeing him again"},{"comment_id":"929005763900127","commenter_b":"Not as pathetic as your lying Hillary.","commenter_a":"Trump even takes a GOOD idea like term limits at EVERY level of elected governing and ruins it with his hate, ignorance, and by being the WORST candidate for President ever his pathetic nothingness and lack of depth daily shows how weak and what a fraud this TRUMP is. Pathetic. LISTEN LEARN THINK FEEL and VOTE smart.","post_message":"Donald J. Trump has vowed to limit House members to a 6 year term and Senators to 12 as part of his broader plan to 'drain the swamp' and reduce the amount of influence lobbyists have in Washington.  Read more: @webpagelink"},{"comment_id":"912646568790348","commenter_b":"'@username i have worked in kane country elections for Dems for 27 years I do my home work ! Bernie only got 8 bills passed in all his 40 years in the sen!!!! Hillary in 4 years got double that!!!! Bernie is ALL TALK NO ACTION!! He is in Bed with the NRA and voted against the brady bill 5 times and voted against amber alert!!! are you kidding amber alert!!!! Now that turns me WAY of Bernie!.And I dont HATE Bernie but Hillary I feel will get the job done and I would love to see what a woman can do!!!! And please dont call me DEAR!!","commenter_a":"Bernie is telling people what they want to hear not what he is capable to really get accomplished.His promises are not doable. They are unrealistic. Hillary has already accomplished many many good things for the poor and the middle class. Bernie is running on our ticket and using us. He is not a democrat and refuses to join our party, and has scorned our party for years. He is a left wing socialist. He voted against the Brady Bill and Amber Alert. He voted to protect the gun corporations and manufacturers against any and all law suits. He said that underage teenage girls should be allowed to have sex with their boyfriends not to get cancer. ( Wierdo) He also said toddlers should be allowed to to explore their sexuality with each other. He refused to serve in our military under concientious objection during the Viet Nam War when 55,000 ...","post_message":"It is clear that the views of the right wing do not reflect the views or the needs of the vast majority of the American people. The Koch brothers and the billionaire class are way, way out of touch with where the American people are."}]
