[{"comment_id":"1318642101490448","commenter_b":"No dumbass that's why she lost","commenter_a":"No she is to crooked","post_message":"Honest question: Do you think Hillary Clinton would have been a better president than Trump?"},{"comment_id":"549469748549029","commenter_b":"That's y he got molested in jail for being a fucking bitch... Some1 should at least throw some boiling water on him so he can see how that feels","commenter_a":"Ryan Smith","post_message":"Heartless: Scumbag Throws Boiling Hot Water On A Cat!"},{"comment_id":"918090094974937","commenter_b":"Unless you make over 12 million dollars a year then you'll probably get a big tax break and a yearly stimulus for being a small business","commenter_a":"I'm a proud Tennessee woman, I've never been disappointed in my beautiful state, today is the first. Trump is not for the people. #FeelTheBern","post_message":"Thank you Tennessee! #Trump2016 #SuperTuesday"},{"comment_id":"1013898135398451","commenter_b":"He'll yes. Put them back in there own country then nukem. All","commenter_a":"Time to fight back.","post_message":"The religion of Peace Strikes again! This time muslim migrants welcome their hosts...   Do you agree we should deport them all!?"},{"comment_id":"607266949431150","commenter_b":"You are So Right. Walter Biscardi Jr","commenter_a":"Wow, that is a match made in heaven. Just when you thought it couldn't get any worse than McCain / Palin, the Republican Party proves us all wrong again......","post_message":"Just in: Ted Cruz will name Carly Fiorina as his vice presidential running mate, according to two sources."},{"comment_id":"1505849332764056","commenter_b":"She needs to be held accountable..!!!","commenter_a":"You honestly can say that about both candidates...","post_message":"If Hillary Clinton hadn't thought that laws don't apply to her, if she had not believed that she was above the law and traditions that everyday people have to follow, she wouldn't be in this mess.  She's in this mess because of what she did.  She is in this mess because of who she and her husband are."},{"comment_id":"10154028893376051","commenter_b":"He is going to build a wall. Send back the goobacks and bomb Isis. Has my vote. If he triples the debt the libtards shouldnt mind. They have no concept of paying bills.","commenter_a":"Does that mean that Trump will put the country in more debt than it has been before him? Does it mean that Trump will instigate a covert plan to arm terrorist nations? Why exactly is that a good thing?","post_message":"Brexit leader Nigel Farage says Donald Trump reminds him of a modern-day Ronald Reagan. Will you be supporting Trump this November?"}]
