[{"comment_id":"10153766225688132","commenter_b":"the laws about women showing constant pictures of themselves naked have to change, really sick of seeing all her plastic body parts.","commenter_a":"Please change yourself first phony woman","post_message":"'These gun safety laws have to change!' - Kim Kardashian"},{"comment_id":"10153612165593984","commenter_b":"My, my, my....Welcome Home....but, don't ever come back!!!!","commenter_a":"Way to go kenya","post_message":"Wow. These 10 million Kenyans just sent Obama a VERY bold statement about his visit... they aren't pulling any punches.  Obama needs to pay attention to this...  Good for Kenya..."},{"comment_id":"10154048881589753","commenter_b":"They both need to be charged she was sorry as hell to let him do that your kids come first","commenter_a":"I sure hope they don't place that child back with her. Lock her up until she is too old to bear any more kids. Where are the Fathers nd Grandparents of these abused kids?","post_message":"An Arkansas mother and her boyfriend were taken into custody and charged with first-degree domestic battery after the woman’s four-year-old daughter was found zip-tied to her bed, reports KTLA. Jennifer Diane Denen, 30, and her 47-year-old live-in boyfriend, Clarence Eugene Reed, both residents of Hot Springs, were taken into custody last week after a staff member at the Cooper-Anthony Mercy Child Advocacy Center found Denen’s daughter to be severely malnourished and abused, according to The... @webpagelink"},{"comment_id":"10154031292643132","commenter_b":"She still looks like a dude","commenter_a":"Good for her! She took care of herself, had a HEALTHY weight gain, and gets to enjoy the results.","post_message":"It's hard to believe this is just after ONE week!"},{"comment_id":"10152889547313299","commenter_b":"I thought I could not dislike this so called woman any more than I do, but, taking a disabled parking spot is outrageous!!! Did she get a fine? Everyone else would have. Do you really want to see this self-centered, rule breaking murderer as president???","commenter_a":"Hilliary is entitled to be queen and all the common people are her court. she can be charming but she's Danger with a capital Dl . she is deceptive with a capital D and isn't that strange Democrats. Is a capital D too","post_message":"Hillary Parks in Handicap Spot ... @webpagelink"},{"comment_id":"10157254857370354","commenter_b":"Punch that Bitch","commenter_a":"If he had a background like that, other wives would come forward. She wasn't going to get alimony...hummmm","post_message":"The latest twist..."},{"comment_id":"1769168636661696","commenter_b":"Love her(homegirls)we going to build the wall and who's going to pay for it?????","commenter_a":"Sounds like home girl need to read up on her history! California is was part Mexico territory!!! And native European Californian, she just rambling!!","post_message":"'Will you go out and pick the strawberries?'  Donald Trump protesters clashed with his supporters at his San Jose rally yesterday to make a point about an issue close to their heart: illegal immigration.  @webpagelink"}]
