[{"comment_id":"10153724968238145","commenter_b":"Wow the desperation of perverts grown woman don't want you so you seek a teenager . Get rid of scum bag .","commenter_a":"Glad they got him.","post_message":"BREAKING: This happened at the Publix on SR-434 and Wekiva Springs Road. Angela Jacobs will have a live report at 12pm."},{"comment_id":"1163050380483299","commenter_b":"@username, I'm quite happy with my wife of 33 years, but thanks for the suggestion.","commenter_a":"Honestly, I don't know anyone who wears Ivanka trump's clothing. This is the risk you run when you become part of the political process.","post_message":"A recent survey found that 57% of women refuse to buy Ivanka Trump branded merchandise following her father's controversial campaign."},{"comment_id":"10153529915413010","commenter_b":"slave labor??","commenter_a":"Here's an idea..... Send the illegals home and put nonviolent incarcerated inmates to work on these farms.","post_message":"\"We have a large population of people who came here to work, not to be any kind of a security threat to anybody,\" said Bryan Little, of the California Farm Bureau Association.   \"And they came to work in an industry that needs them badly.\""},{"comment_id":"10154184964563352","commenter_b":"Melissa..legalizing illegals will devastate black employment..for every available job it will be 150 Mexicans to every 3 blacks...it be horrible for us","commenter_a":"Hes gonna stop illegals from coming taking black jobs..hes gonna kill obamacare fines..wat sensible black would disagree","post_message":"Trump says black Americans 'are going to like me better than they like Obama' – even though the president has 'a slight advantage'"},{"comment_id":"820733274641888","commenter_b":"I'd piss on the ladies car. Put vaseline on her door handles lol","commenter_a":"Oh wow! That's...harsh. It's bad enough that poor girl is struggling like this but for the person who wrote that note to shove that into her face then rub it in? oh heck no! @username, please follow up on this report and let us know the results. This story has just gotten me so hot I could boil the water for my tea just by holding the kettle in my hands!","post_message":"NASTY NOTE: Ashley Brady is still struggling to get used to her life as an amputee. She finally got a handicapped parking spot at her apartment complex, but two days later she saw a car parked there. After leaving what she believed was a polite note, Ashley got this in return:"},{"comment_id":"10153194467946756","commenter_b":"OH. MY. GOD.","commenter_a":"the 33 1/3 book he did is awesome","post_message":"\"Whether it's a song, or a book, or a conversation you have at dinner, the creative thing is what happens in the process—not the relic of it,\" says the man behind the band the Mountain Goats."},{"comment_id":"507758516015518","commenter_b":"She is illegal","commenter_a":"@username 2016!!! LETS PUT THIS BEAUTIFUL LADY IN THE WHITE HOUSE!!!","post_message":"Very proud of our next First Lady Melania Trump! #MakeAmericaSafeAgain"}]
