[{"comment_id":"971595456226551","commenter_b":"there is a problem with a Black man being president and not standing for a black man, or a white man!! but only standing for illegals and Terrorist!!! thats what should be bombed!!! leave white babies or any babies out of it!! SPILLING INNOCENT BLOOD MAKES YOU JUST AS LOW AND WRONG AS WHAT IS HAPPENING NOW!!!","commenter_a":"I will gladly Kill you for the White Nation!!!","post_message":"(Audio) A war cry... @webpagelink"},{"comment_id":"545444305663576","commenter_b":"She will kill the U S A","commenter_a":"MORE LIES!!! Her horns are really showing out! Gggrrrr","post_message":"Hillary Clinton says that Donald J. Trump's idea of making \"America great again\" is code for \"let's take America backward.\" Thoughts?"},{"comment_id":"10152769527894877","commenter_b":"No. Ladies came up short they guys didn't end up in the board room. Lamas was dead weight though.","commenter_a":"I thought the female team won their challenge. Why did she get fired and not lamas?","post_message":"Keisha Knight Pulliam Fired From 'The Apprentice' For Not Calling Bill Cosby And Asking Him For Money. Watch it and read more here. Grio fam, was this at all fair? Sound off."},{"comment_id":"10153809969273984","commenter_b":"Keep the apology. Fire her.","commenter_a":"Professors are the most ignorant people out there","post_message":"Unbelievable. The left is always calling conservatives bigots, meanwhile they're saying things like this? Should this professor apologize?"},{"comment_id":"10153783532251336","commenter_b":"You drug addicts are so jealous that it went to the police station. I will say it again. I'm glad it went there. get yourselves off the streets. IDIOTS!!","commenter_a":"Glad it went to the police station. Keep it off the streets!","post_message":"Officers wrote in a Facebook post, \"If you were expecting these packages and would like to claim them, please come to Police Headquarters.\""},{"comment_id":"824287517608590","commenter_b":"Let's go get em Ron. Steve is on his way to pick you up with mike bike","commenter_a":"I knew it!","post_message":"Well..."},{"comment_id":"498325633682650","commenter_b":"Latino political organizations need to get their voters in large numbers to make sure that ASSHOLE doesn't get in office!","commenter_a":"I am not a Republican. I am not a fan of any of these idiots running. But Trump has got to go . People are gonna get hurt, innocent people. Look at the monsters he has as his security detail that will swing at anyone for no reason and now this with his supporters. The media has to stop covering him. Take away all the attention he is getting. Maybe cover him when something intelligent comes out of his mouth, which so far has been nothing. This man can say whatever he want but we are a democracy, we have a government and he rant about all he wants to do but he can't do it alone. There are 3 branches of government. I know that he has veto power but then we would be calling him Dictator Trump not President Trump. He is a egotistical classless piece of shit.","post_message":"It's getting worse."}]
