[{"comment_id":"10153382274960047","commenter_b":"Absolutely. We need that evil out of our country, or there won't be. That evil Clinton is still getting votes. Are there that many brain dead people that can still vote? She a freaking criminal, and low life form that should be in prison. For those that do like her, if it were you that had did all she has, you'd be a lifer in prison. Wake the heck up.","commenter_a":"I would rather see silver or gold certificate or better yet actual gold or silver. Back then no in god we trust on any money","post_message":"We must defend \"In God We Trust\" from atheist attacks. We must defend our Christian heritage. Sign and Share our petition to take action: @webpagelink"},{"comment_id":"10153692556453984","commenter_b":"Had she told the tuth to begin with she probably would be our next pres!!!","commenter_a":"Absolutely","post_message":"Looks like Hillary Clinton just got another piece of bad news, and it's from one of her least-favorite people. 'Bulldog' Gowdy is hot on the trail! Do you support Trey Gowdy's fight to hold Hillary accountable?"},{"comment_id":"10154021550142377","commenter_b":"I see three women who should no longer be Senators!","commenter_a":"We have our own problems to solve. stop sticking your noses were they do not belong !! No other nation has made this kind of statement !!! $6Tril we spent and we have nothing except dead soldiers !!!","post_message":"Republican Sens. John McCain and Lindsey Graham have issued a blistering condemnation of the failure of the United States to act to prevent the slaughter of hundreds of thousands of people in Syria."},{"comment_id":"10155810276030725","commenter_b":"DO AM I STUMPING FOR DONALD? NOT SURE YET, MAYBE. Definitely our country has had already more than enough from LYING lawyers turning politicians! After all, LYING is the job they do best and nothing else really matters to them. Talking to many Hispanic,- with common sense- good friends of mine, I found out that they all agreeing with DONALD TRUMP! And it's not because they aren't hospitable and compassionate people. To the contrary! It's because of the fact that most of these illegal bad apples in their efforts to blend in and avoid being getting caught, always have settled in their neighborhoods bringing their drugs their street gang attitudes and criminal ways with, and my friends are the very first to have been victimized by. Now of course not all illegals are bad, but some are and one is too many. That's the reason we have legal immigration so ...","commenter_a":"I'd like to know how many illegal immigrants Trump employs and has employed.","post_message":"Statement on Relationship with NBC-"},{"comment_id":"10153973402646350","commenter_b":"Damn her! So bloody uncooperative.","commenter_a":"Every fortnight I clean out the strainers, wipe under the rubber and run an empty dishwasher on hot with vinegar, bicarbonate and eucalyptus oil. Same for my washing machine.","post_message":"The answer is"},{"comment_id":"742295419269809","commenter_b":"Herman. You read my mind. Agree completely!","commenter_a":"Banty McBotox seriously needs a reality check. Watching them as they form a circular firing squad is quite amusing. carry on.","post_message":"Please, Democrats. Keep repeating this. We want you to believe it with every fiber of your being. Don't change course. Don't learn your lesson. VIDEO!"},{"comment_id":"10152697145362144","commenter_b":"Sam. The lowest approval rating ever goes to Obama.","commenter_a":"No he is not. I am so disappointed in how NOT liberal he is and I voted for him twice.","post_message":"Obama is the most liberal president since LBJ. But that's not what conservatives hate. They hate him because he's also the most effective Democratic president since LBJ."}]
