[{"comment_id":"10152685368712507","commenter_b":"So, we can therefore classify modern business as \"irresponsible\" capitalists, right?","commenter_a":"\"How to fix inequality\"??? REALLY?!! C'mon guys! That's almost as absurd as \"fixing climate change\"!! With all due respect, is there anything that's just TOO DAMNED STUPID to write? Anything at all?","post_message":"There's no easy solution."},{"comment_id":"947458941975777","commenter_b":"@username Hillary won","commenter_a":"I'm voting for Bernie, Because I give a damn.","post_message":"I got into politics not to figure out how to become President. I got into politics because I give a damn. #DemDebate"},{"comment_id":"1658924690814663","commenter_b":"And last time I checked, Treason still carries the death penalty! That would certainly get rid of a bunch of \"bad actors\"! It would go a LONG WAY towards \"making America great again\"!!!","commenter_a":"Trump and Bannon are complicit in Flynn's actions. Does anyone remember Trump tweeting about how \"smart\" Putin is after Putin chose to not retaliate against the sanctions?? This was all coordinated at the highest levels. The whole administration should be in jail for conspiring with a foreign government against America's interests both before and after the election. If all of this put together isn't treason, I don't know what is.","post_message":"Bet Trump knew about this...."},{"comment_id":"10153342829529170","commenter_b":"Then STOP Them, enough already!!!","commenter_a":"homegrown terrorist and a president that wants Americans Disarmed.......YEA, THAT'LL WORK!","post_message":"If you're a liberal claiming ISIS doesn't exist inside the US, Barack Obama's own FBI Director has a message for you...."},{"comment_id":"10154660419633797","commenter_b":"I'm pretty sure Russia is still one up on us!!","commenter_a":"Yup I'm a contributor","post_message":"AMERICANS DRINKING MORE: For the first time in nearly 15 years, everyone around the globe is drinking less alcohol. Except for people in the U.S."},{"comment_id":"10154246766848797","commenter_b":"Denise unfortunately this is what your kid will probably end up doing! And you're beyond IGNORANT & clueless lady btw!!!!","commenter_a":"Black on black. Stop. We have to fight murder from the pd, ourselves, institutional genocide. Proverty. Racism. Chicago public schools. Residuals of enslavement. We are protesting all day and everyday.","post_message":"TUESDAY VIOLENCE: Five people were injured in shootings Tuesday on the South Side. Most recently, two teenage boys were shot in the Englewood neighborhood."},{"comment_id":"10153661436973352","commenter_b":"She just ain't shit","commenter_a":"I dont get it.. She was turning herself in to be locked up?!? And left the kids in the car......","post_message":"Mother caught leaving 1- and 6-year-old children in a hot car…while she was turning herself into police for doing the SAME thing last month. SHOULD THEY TAKE HER KIDS AWAY FROM HER?"}]
