[{"comment_id":"554676768026413","commenter_b":"Lu Fo see the top comments and it really shows how the middle class sees the negative effects of raising the minimum wage","commenter_a":"so small businesses will make sure they will not hire that 26th person","post_message":"BREAKING: California became the first state in the nation to commit to a $15 per hour minimum wage after Gov. Jerry Brown signed the new law Monday.   Under the plan, minimum wage was expected to increase to $10.50 per hour on Jan. 1, 2017 for businesses with 26 or more employees.  The minimum wage would then rise each year until it reaches $15 per hour in 2022."},{"comment_id":"10153959517171337","commenter_b":"\"Drink the kool-aid.. Sheep.. Libtard... Scandals...\" Meanwhile, there's Trump. All of those things wrapped into on ball of hair. HA HA HA!!","commenter_a":"Haha that bitch will do anything for votes. She's trying to win the young/urban vote lol tomorrow she'll be in overalls with a straw in here teeth talking to some farmers. Line up kids, get your blow job from Hillary !!!","post_message":"R.I.P Dabbing  @webpagelink   (2015-2016)"},{"comment_id":"1056816484380468","commenter_b":"Islam, by law, is prohibited from US immigration The Immigration and Nationality Act passed June 27, 1952 revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in Chapter 2 ACT 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by \"force, violence, or other unconstitutional means.\" This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House.Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the Hadith all require complete submission ...","commenter_a":"Don't waste tax dollars with a trial, start setting an example of what happens to terrorest who murder.","post_message":"BREAKING: Muslim Teen Refugee Charged With MURDER For Beating 97-Yr-Old WWII Veteran To Death  These refugees can not be trusted with freedom... give an inch they take a mile.   Http://woundedamericanwarrior.com/breaking-muslim-teen-refugee-charged-with-murder-for-beating-97-yr-old-wwii-veteran-to-death/"},{"comment_id":"10153971816072869","commenter_b":"Ugly nasty ol bill has givin her what she never wanted ol monica. Diseased up hoes.","commenter_a":"Why isn't the Mainstream Media talking about this Story?? News - 1) ABC News executive producer Ian Cameron is married to Susan Rice, Obama's National Security Adviser. 2) CBS President David Rhodes is the brother of Ben Rhodes, Obama Deputy National Security Adviser for Strategic Communications. 3) ABC News correspondent Claire Shipman is married to former Obama Whitehouse Press Secretary Jay Carney. 4) ABC News and Univision reporter Matthew Jaffe is married to Katie Hogan, Obama Deputy Press Secretary. 5) ABC President Ben Sherwood is the brother of Obama Special Adviser Elizabeth Sherwood. 6) CNN President Virginia Moseley is married to former Hillary Clinton Deputy Secretary Tom Nides.Etc... etc... Get the picture? Please copy and share *Muslim influence in America*: John Kerry's son in-law is an Iranian Muslim and, the best man at their daughter's wedding was the son of the man Kerry negotiated the Iranian Nuke Deal with. John ...","post_message":"NO deed goes unpunished..."},{"comment_id":"988837027845081","commenter_b":"It seems to be about control imo. Religion has had so much control in history that by taking a little bit away they think the world is persecuting them. In my opinion they should let gay people do what they want just like they think Muslims should mind their own business about others eatting pork.","commenter_a":"wow - I am honestly confused as to how gay couples marrying really affects your lives? whether it be against your religious beliefs or whatever your reasons are for hating these people, does it truly affect how your life is going? There are so many other things in this world that should be worried about, like how our veterans are being treated and cops being stalked and killed, does two people being in love and wanting to be married change your life? and btw, no, I am not gay. I would just rather see more love in this world than hate and violence.","post_message":"North Carolina and Utah Laws Allow Clerks to Refuse Same-Sex Marriages  More than 30 magistrates in North Carolina have legally refused to perform weddings for gay couples.  @webpagelink"},{"comment_id":"10152679214316545","commenter_b":"I don't understand why it's called The Miss Universe pageant when our planet is the only one competing?","commenter_a":"I thought it was very rude for the audience to boo, I felt bad for Miss USA.","post_message":"Miss USA was SO close to taking home the crown, but many thought Miss Jamaica was the biggest snub!  Thoughts on Miss Universe?"},{"comment_id":"10156594295450354","commenter_b":"She is a mental pig.","commenter_a":"Because you are a dog","post_message":"Feminism 2016 Style...  “It’s policy. Teddy Kennedy, remember Chappaquiddick?… I mean, a girl drowns and he abandons her, and [s]he drowned, and women still voted for Teddy Kennedy. Why? Because he voted for women’s rights. That’s why. That’s the bottom line of it in my opinion. I mean, I don’t like either one of them, to tell you the truth, Teddy or Bill. They’re both dogs, as far as I’m concerned. But I still will vote for Bill Clinton, because he votes in my favor.”"}]
