[{"comment_id":"1530656863908230","commenter_b":"Feminism is the CHOICE. You can choose to be a stay at home mom now, you are no longer forced.","commenter_a":"Feminism got women the right to vote, and the right to be equally taxed as men without suffering any of the consequences of their choices (like fighting in war) obviously women are indirectly affected by war too but....this devalued their job and oppourtunities as mothers, thus hurting the family structure by putting extra financial burdens on them to cover the extra tax load. This is why families cannot survive off of one income anymore (obviously there are other factors). Feminism made it seems petty and pathetic to be a stay at home mom and raise your children but it is the most important and difficult job in the world IMO.","post_message":"The work of stay-at-home moms is valued at more than $100K a year. Learn more about the stay-at-home mom stigma: @webpagelink Like ATTN: Video on Facebook."},{"comment_id":"10154754635023352","commenter_b":"Bridgette,u r s/o but ur lettin dem bitches knw wat it is.","commenter_a":"Her vagina is probably getting dry and can't keep up with him anymore..jk","post_message":"It’s over! Jennifer Lopez, 47, splits from toyboy Casper Smart, 29, after five years together"},{"comment_id":"10150802483299999","commenter_b":"Takes one to know one.","commenter_a":"Takes one to know one!","post_message":"Ted Cruz called Donald J. Trump a “pathological liar\" and a “narcissist at a level I don’t think this country has ever seen.”"},{"comment_id":"10153931727246162","commenter_b":"She deserved it!! Drunk idiot","commenter_a":"Excessive indeed, but I wonder what happened before he tossed her in.","post_message":"North suburban Skokie has agreed to pay $875,000 to a woman who accused a police officer of using excessive force after a DUI arrest: @webpagelink"},{"comment_id":"853806161323392","commenter_b":"Ya I always thought she was odd shaped... not anymore. Taylor is way hot","commenter_a":"Smart girl: screw the paparazzi out of a big pay day and staying true to her values; all while looking gorgeous and being a positive role model for girls everywhere.","post_message":"She had a good reason – and it wasn't vanity."},{"comment_id":"1230028840342704","commenter_b":"Not fit to be president. A witch","commenter_a":"From all accounts....Killary Rotten has one of the filthiest mouths in DC. She calls people nasty names and acts like she is insane...which she is. This is what she thinks of everyone in America....she is trying her best to fool as many as she can though.","post_message":"Is Hillary Clinton really a cold-hearted [expletive]? You won't believe her explosive fits of rage, even making her husband Bill bleed, as her astonishing vitriol has just gone public"},{"comment_id":"10153994821081409","commenter_b":"Voting should only be done in person with ID on paper ballots. Who marked that mail in ballot? Who is at the keyboard for online voting? Do you have a repeatable count of the votes? Again, voting in person with ID with paper ballot.","commenter_a":"Voting should be the same in every state, county, city, town, whatever. Mail in ballots should be available to everyone. I think eventually we should go to online voting if we can keep the republicans from tampering with it.","post_message":""}]
