[{"comment_id":"859268404119788","commenter_b":"Woman - an adult human female.","commenter_a":"This makes me not proud to be an American.. We stand by for the worst stuff.","post_message":"How's this for perspective?"},{"comment_id":"10154106990671409","commenter_b":"God help us if this is all they can trawl up for person of the year . He is only out to fill his own own pockets further. This misogynistic , ecogotistical man is only out for himself, and will turn out to be america's biggest mistake.","commenter_a":"He's NOT a PERSON!!! He's an orangatan and inhumane ethnocentric lying bully.","post_message":""},{"comment_id":"10153517390897293","commenter_b":"TRUMP KNOWS HOW TO NEGOTIATE! Politicians see how you get things done! Everyone is talking about Trump, and he doesn't have to pay a penny! Awesome! This is a Revolution for Trump like I have never seen in my 63 years! Go Trump! The man with COMMON SENSE! Obama was bought by the Communist Billionaire George Soros. Soros' main objective is to destroy America. Soros is now buying Hillary. NEWS MEDIA IS BRAINWASHING AMERICA TO HATE TRUMP! The people who have ruled America behind the backs of Politicians they have paid to win will lose a lot of MONEY if Trump gets elected. Who are these people, well some of them OWN NEWS MEDIA STATIONS! How many World Leaders have been paying Politicians to run so they could have a payback when the Politician got into power? Notice how much money America sends to other Countries? Think about it, WHO ...","commenter_a":"Waaaaah.","post_message":"He's out of Thursday's debate."},{"comment_id":"10152896761617293","commenter_b":"and the mob was mad when he called thm out too .... NEXT!! -","commenter_a":"Nothing like calling them as he (and most of the rest of the world) sees 'em!","post_message":"\"Currently, an evil front is being formed against us,\" he said. \"Now the pope has joined this conspiracy.\""},{"comment_id":"1152822888099590","commenter_b":"Hillary is a liar, a cheat and cares more about money then Americans.","commenter_a":"Another embarrassment p***y grabber to the country...","post_message":"JUST IN: Donald Trump Jr. will be speaking at ASU on Thursday at 2 p.m. MORE: @webpagelink"},{"comment_id":"1105325356224849","commenter_b":"Dont trust the polls It's women like Hillary that make all women look bad. Disgrace. She has not worked her way to the top, she has bought her way, lied, killed, and done corrupt things her whole life. That is not a role model. Hillary and Obama are not listening to intellegence of Isis entering the country. Same as Bill Clinton ignored the intelligence of Osama Bin Ladin. History repeats itself. 911 was 9 months into Bush's term. Clinton was the one that was warned and they had Osama located and wanted to kill him. Bill Clinton denied the order to take Osama Bin Ladin out. They lost him somewhere on the mountains after that.. Thus it was BILL CLINTON that didnt listen to intellegence and now Obama and HILLARY CLINTON are not listening to intellegence on ISIS entering our country with refugees. The seeds are already planted for the ...","commenter_a":"Trump will win this election. The crooked democrat establishment deserve to face treason, fraud, inducing panic and slander charges. WIKI LEAKS....JEFFERY O'Keeffe... YOUTUBE IT! Educate yourselves!!!!! Trump Pence 2016!","post_message":"Hillary Clinton remains ahead of Donald J. Trump with a six-point lead in a four-way race with just three weeks until Election Day, according to the latest Fox News Poll."},{"comment_id":"10154653626394024","commenter_b":"oh hell no !","commenter_a":"I want him back in the WH .","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"}]
