[{"comment_id":"10154388275884087","commenter_b":"@username yes. Literally. @webpagelink","commenter_a":"He literally yelled \"Allahu Akbar.\" Why isn't anyone reporting that?","post_message":"#BREAKING: Russia’s ambassador to Turkey Andrey Karlov was shot and killed by a Turkish police officer who shouted \"do not forget Aleppo.\""},{"comment_id":"1181717725240095","commenter_b":"lol actually u support a murderous witch AKA BENGHAZI BITCH","commenter_a":"TO BAD ALL THE BULLSHIT HE TOLD WAS A LIE.","post_message":"Donald J. Trump just gave the speech of a lifetime... but more importantly, he totally destroyed Hillary Clinton. He put a very special message to Hillary in there that you won't want to miss."},{"comment_id":"458998460955114","commenter_b":"Jamie....... Your mamma should have swallowed !","commenter_a":"I got to admit governor Abbott has some big huevos and strong backbone exactly what is lacking in congress n Senate to stand up to that pos obama","post_message":"Texas is not playing GAMES..."},{"comment_id":"10152797115634117","commenter_b":"Matthew, most of you gun totters don't have the balls to pull the trigger. But if you need a gun to make you feel like a man, knock yourself out. Guns are there for men who's wives wont let them have a penis truck. Have a nice day.","commenter_a":"And the evil liberal Democrats want to take our guns away because the police are here to protect you.","post_message":"U.S. marshal's effort to censor a citizen's recording was foiled by yet another citizen recording in this small town that collects millions in asset forfeiture revenue."},{"comment_id":"586245841541886","commenter_b":"Murders need to go to prison!!!","commenter_a":"Thank you Dr Carson","post_message":""},{"comment_id":"1202675816432455","commenter_b":"Anyone is better than Killary. I'd rather look at and hear him than her.","commenter_a":"Guess Rush has already forgotten all of Trump's promises to \"cut deals\" with all the Reids and Pelosis out there. The left probably won't have to worry very much.","post_message":"I want you to fast forward to November to Trump winning the presidency in November. I want you to think, using your intelligence guided by experience, what's gonna happen that night? What's gonna happen the next day? What's going to happen every day thereafter? What's gonna happen the day Trump gets inaugurated? What is the left gonna do? They're not gonna just sit idly by and accept this and say, \"Good fight. We gave it everything we had, but we lost.\" They're gonna do everything they can to undermine it. And I think we're gonna see levels of violence that we have not seen."},{"comment_id":"1391127634238463","commenter_b":"You poor Republicans. You are so lost in your stupor that all you can do is harp again and again over Hillary's e-mails. Sure, it was a mistake. But in the final analysis you can not find any harm caused by that. In the mean time just consider the damage caused to our nation by the rigidity caused by the Republican Congress over the past eight years. Your solution is to nominate a man devoid of any moral compass. Thanks Republicans. I can only hope that what rises from the ashes of the Grand Old Party will come closer to Abe's vision and that Rush L. stays buried in the ashes.","commenter_a":"I just do not understand how any true red blooded America could even think about voting for Hillary after her cover up of Benghazi and Emails !! The only thing she has proven is she is a BIG lair and above the law ! She is truly a woman of zero integrity and belongs in prison NOT running for our president !","post_message":"\"It took the socialist to remind us that you supported the trade agreements that cost millions of American jobs and millions of dollars.\" Last night on \"Justice,\" Judge Jeanine Pirro slammed Hillary Clinton over her Wall Street ties, failure to help the Middle Class, and backtracking over her husband's crime bill. @webpagelink"}]
