[{"comment_id":"471354216346689","commenter_b":"It's far easier to cheat on your taxes than it is to receive SSI.","commenter_a":"I don't believe it is a real disability either but a ploy to rob the taxpayers of more money.","post_message":"Please put me in a room with this man. Just for 30 minutes. I'm diagnosed as bipolar. There are varying degrees of bipolar disorder. Some are well managed on medication. Some aren't and are disabled.. I am one of those that is great on medications. However, off of medications? I can't function, and seriously, I become a danger to myself because I make TERRIBLE decisions in a manic phase. So yea, let me at him. ~ Liz"},{"comment_id":"1538307646229359","commenter_b":"Let it burn ...what a dumb bitch...","commenter_a":"Let's see how that works out!","post_message":"What do you think?"},{"comment_id":"10153952652862293","commenter_b":"I guess you are happy with the Clinton globalist international crime family in the White House (along with the money laundering Clinton Foundation). She will continue to ship your jobs overseas (she supports NAFTA and the TPP), promote open borders that bring in criminals and support unlimited immigration of Muslims bringing Sharia Law and terrorism. Maybe you could then move to a \"no go zone.\" Ask Europeans (and the people in Dearborn, Michigan) how that is working for them?","commenter_a":"How is it not completely obvious to anyone with two eyes that this family is a bunch of con artists? Literally nothing they say is true. And half the country wants to give the most important job on the planet to this guy? Amazing.","post_message":"Eric Trump said he could not name a single instance when his father had given such a gift."},{"comment_id":"10153411890826167","commenter_b":"Don't Muslims go the mosque all the time? What's the big deal?","commenter_a":"Well, we knew THAT was coming!!","post_message":"The White House said Obama's upcoming mosque visit is meant to \"reaffirm the importance of religious freedom to our way of life,\" but suddenly conservatives don't seem to care about that:"},{"comment_id":"1173361852693721","commenter_b":"Oh oh, look out behind Hillary, she has her gass again, and gives it up to everyone on stage.","commenter_a":"Liar Hillary she just can understand that lying is not normal well I guess it is for her and Bill and Obama and her Party.","post_message":"Donald J. Trump is calling Hillary Clinton a liar, openly calling her a liar for making up that story about his being a recruitment video for ISIS. He's now demanding an apology for her lies."},{"comment_id":"1298794080158825","commenter_b":"OK. Sacrifice your two daughters first....and we will all follow suit (he is a big asshole)","commenter_a":"Obama's a damn clown","post_message":"More evidence that this president believes in sacrificing military readiness on the altar of social engineering."},{"comment_id":"402875396503722","commenter_b":"silly sarah sure is a pompus bitch","commenter_a":"Rather look at her vs Billary! What a pompous bitch!","post_message":"Sarah Palin had some strong views on Hillary Clinton's email accounts. Is this as big an issue as she claims?"}]
