[{"comment_id":"1727798617495109","commenter_b":"She's a hottie","commenter_a":"Megyn Kelly is a dream come true.. Smart and beautiful","post_message":"“When I am wounded, I go after people hard, okay? And I try and ‘un-wound myself.’” — Donald J. Trump"},{"comment_id":"1554600804845563","commenter_b":"Only way undocumented immigrants get benefits is if they have a usa born baby...they get benefits from the kid since the baby is a us citizen.","commenter_a":"They are so scared and desperate of losing their welfare and EBT cards and being deported , they know Trump Is For Real they know he means business..... so the last resort they have is they think they can scare America's law abiding citizens from attending perfectly legal, legitimate rally for the candidate of their choice which is 100% in their right to do. These people are not protesters, they are rioters, violent disrespectful, criminal thugs. The main stream , elite owned media is not reporting on this, you will not hear Hillary Clinton tell the Democrats or anyone outside of trump rallies to stop the violence, they support this, they support black lives matter. As long as they feel it is helpful to their side especially Hillary, (getting in the White house will keep her from going to jail), they will let it continue. If it was the other ...","post_message":"WATCH: Trump rally riots - supporters attacked by a mob of protesters at a rally in California."},{"comment_id":"10156690146685231","commenter_b":"You beating her implies you didn't educated her about her role in society or her worth. Beating her is so drastic & dramatic. Talking & educating her would be much more powerful.","commenter_a":"If that girl were mine I'd slap her into next week but then again no child of mine would refer to herself as meat or be that cheap","post_message":"A high school boy asked a girl to prom with a sign that said, 'I prefer dark meat. Prom?'.... There's some things wrong here."},{"comment_id":"10152727264626051","commenter_b":"This woman is sick, she needs to lose her own child and put into intense therapy with jail time.","commenter_a":"Gross!!!!!!","post_message":"This kid never really thought about why his mom was so excited when his 11-year-old friend came over. Now he knows."},{"comment_id":"579405548899257","commenter_b":"@username smart woman","commenter_a":"\"Mr. Trump what would you like for dinner?\" Trump: \"I'm building a wall.\" \"Mr. Trump why don't you like Mexicans?\" Trump: \"I'm building a wall.\" \"Mr. Trump why don't you ever answer questions?\" Trump: \"I'm building a wall.\" \"Mr. Trump tell us something relevant about this presidential race.\" Trump: \"I'm building a wall.\" \"Mr. Trump are you building a wall?\" Trump: \"I'm going to make America great again!\" Well, that pretty much sums up everything this \"man\" has said all along and people will continue following his ignorance. #makeamericahateagain","post_message":"Donald J. Trump insists a judge born in Indiana is Mexican."},{"comment_id":"907300286012867","commenter_b":"She gives blondes a bad name.","commenter_a":"There's no such thing as liberal intelligence","post_message":""},{"comment_id":"1465398613511181","commenter_b":"Beyond stupid . Just be careful and keep your ear anus clean !!!","commenter_a":"Afiya Tavera Cunningham","post_message":"Doctors are once again letting us all know that you should not use Q-tips in your ears."}]
