[{"comment_id":"10153165521747217","commenter_b":"Yes.. haha true because their women are so beautiful ;) :)","commenter_a":"Next time Netanyahu - global warming also caused by Palestinians","post_message":"Germany steps in after Israel's prime minister claimed a Palestinian leader told the Nazis to kill Europe's Jews"},{"comment_id":"1243167749095092","commenter_b":"When i said this far. I'm talking about she's the presidential candidate. Her ass should be in jail by now.","commenter_a":"WAIT!! Who is to say she has gotten 'This Far!' The News Media!?? Her rallies attract less than 400 people on the average. I believe. I know democrats who are voting for trump that have told me They don't even like him but Hillary will destroy this country! Everything we see and hear is from the 'NEWS MEDIA!' Listen America, I saw and heard an interview with George Soros overseas last week. He said Donald Trump will win the popular votes of the American people by a 'Landslide!' BUT!..We have found the Achilles heel of Western Civilization. The electoral votes. Hillary will win by the way the electoral votes have been put in place....America this is scary. The election is rigged way more than the news media is letting us know. I'm sure Donald Trump knows this too. Personally I am praying and asking God to intervene in this election ...","post_message":"Arkansas's attorney general just issued a jarring statement about Hillary Clinton, the state's least favorite daughter.  What the AG says needs to be seen by every American."},{"comment_id":"10154689824655575","commenter_b":"get rid of this bitch","commenter_a":"Morons","post_message":"Is Jill trying to keep the money rolling in?"},{"comment_id":"936764406358981","commenter_b":"what tits. he was smelling her fart","commenter_a":"'Joe stop staring at my tits, thanks.' ~ Hillary","post_message":"Can you imagine?  Talk about our country going to hell in a handbasket…"},{"comment_id":"10153218039995090","commenter_b":"Stop Hillary!","commenter_a":"REMEMBER THE.LINTL Whttps://www.facebook.com/judy.winders/posts/@username LINTON. MURDER LIST","post_message":"Taking a road trip this summer? Show that you are committed to Stopping Hillary.  Take the pledge & get your free Stop Hillary bumper sticker: @webpagelink"},{"comment_id":"10154536419509087","commenter_b":"Jolie should worry about fixing her house first..","commenter_a":"Some day in history Freedom of Religion will meet the crossroads. How will America defend itself from enacting Shari Law?","post_message":"“Shutting our door to refugees or discriminating among them is not our way, and does not make us safer,' Angelina Jolie said. “Acting out of fear is not our way. Targeting the weakest does not show strength.'"},{"comment_id":"1351641891520492","commenter_b":"YOUR SENILE. SHE SMEARS HERSELF.","commenter_a":"You have my total support Hillary! Every time I come to your Facebook page and see all the horrible Trump trolls posting lies and rumors about you, it makes me even more committed to support your campaign! They are proof that what you said about the deplorables basket was not a gaffe but an unfortunate reflection of reality. I am so happy to see you looking so healthy and recovered today. Next stop the White House!","post_message":"This team is the only thing left that can stop Donald Trump.  We’ve got to leave it all on the field here, and we need contributions from Facebook to reach our goal of 100,000 by midnight. Will you chip in? hrc.io/2d4999O"}]
