[{"comment_id":"10154210423796973","commenter_b":"Aleksey Olenin","commenter_a":"What's the deal with this Westworld show? It doesn't look like anything to me... ;)","post_message":"'Westworld' has become the kind of watercooler-buzz show HBO loves."},{"comment_id":"10153744436512894","commenter_b":"Her weaves be the worst. .lol","commenter_a":"Wish them all blessing in life , hope God,s in the equation","post_message":"Pregnant Blac Chyna Goes Glam to Film Upcoming Reality TV Show -- See Her Latest Look!"},{"comment_id":"10155273538573797","commenter_b":"build a wall...then build another wall around the south side","commenter_a":"I blame the mayor. Its his fault this stuff happens","post_message":"A 74-year-old man has been charged with shooting another man Saturday night in the Park Manor neighborhood on the South Side."},{"comment_id":"10150864251334999","commenter_b":"He will blame the baby","commenter_a":"He will either win, or drop out so he can always claim he would have won otherwise. If he does stay till then end, and doesn't win, the reaction will look like this: 1. Demand a recount 2. Blame it on voters who didn't want to make America great again. 3. Complain that the GOP is at fault for not supporting him enough. 4. Blame his VP. 5. Demand to see Hillary's birth certificate","post_message":"The latest guessing game is whether Donald J. Trump will drop out of the presidential race before Election Day."},{"comment_id":"10152890902061336","commenter_b":"Immigrants must obey the law...review history.","commenter_a":"What's wrong conservatives are these immigrants too brown for you?","post_message":"Mexico is now issuing birth certificates at its U.S. consulates so illegal immigrants can avoid deportation."},{"comment_id":"959095867528667","commenter_b":"I want to hear the story too","commenter_a":"Trump fix SS","post_message":"DML discusses the best way to fund Social Security, and how the media disrespects veterans.  Please watch and share."},{"comment_id":"10152829564776770","commenter_b":"Go home Clintons","commenter_a":"Bullshit cover up","post_message":"Hillary is secretly a great person, says Clinton campaign"}]
