[{"comment_id":"10153902236123812","commenter_b":"The native Americans should have stopped accepting immigrants. They wouldn't have lost millions of life's by those terrorist immigrants!!!","commenter_a":"ISIS doesn't need to be in America. Has everyone forgotten about the mass shootings that happen almost every day now? They can easily recruit here and never step foot on American soil. Blind hatred is still hatred.","post_message":"LATEST: Mississippi joins Ohio, Florida, Illinois, Indiana, Louisiana, Arkansas, Michigan, Alabama and Texas in refusing to accept Syrian refugees in wake of #ParisAttacks."},{"comment_id":"10153337670592061","commenter_b":"Omg your so ignorant lady!","commenter_a":"I've had enough of this 'let's show black crimes in the news disproportionately bs' what's up with those occupy federal land militia and who's going to right the Steve Avery corruption wrongs. What he has to be an affluenza to qualify for civil rights in America?","post_message":"WATCH: Kidnap victim explains how she escaped after an alleged carjacker jumped into her car and forced her to drive nearly 150 miles: @webpagelink"},{"comment_id":"899557670234809","commenter_b":"This is the STUPID BITCH that just spent 8 years in the White House, what a piece of shit she is","commenter_a":"She has always been a JOKE","post_message":"He stepped to Michelle in a way she probably never thought anyone would.  Serious respect for this man. Let's get his back.  Let's get 3,000 'LIKES' for this soldier!"},{"comment_id":"10153752964580575","commenter_b":"I'm ashamed of you Mary, rape is rape. Lord help you if you ever get in that situation.","commenter_a":"I don't doubt Bill Clinton and Bill Cosby were with these women. My doubt comes from what is rape. When a woman wants something from a man and is willing to give sex for it , is that rape ?","post_message":"Bill's past is coming back to haunt Hillary. . . ."},{"comment_id":"538334903023756","commenter_b":"Yes....throw her ass in jail.","commenter_a":"That's what happens when you engage you mouth before your brain","post_message":"The Baltimore prosecutor is about to go down in flames after this.  She is a criminal, just like the rest of them.  Do you agree she should serve time?"},{"comment_id":"10152908663462434","commenter_b":"And he testified she was having a good time. Three sides to every story- his, hers and the truth","commenter_a":"Everyone acts like this is an isolated case. Boys pressure girls into having sex every day.","post_message":"In interviews with police, Labrie denied raping the 15-year-old, saying he’d put on a condom for what was supposed to be a consensual encounter before experiencing a “divine inspiration,” as he put it, and leaving the room. In testimony, he said the hook-up was consensual, and that having penetrative sex with the girl “wouldn’t have been a good move for me.”"},{"comment_id":"10153241147678984","commenter_b":"They can go crawl up a hog a-- with there counter parts the muslims.","commenter_a":"All the way !!!","post_message":"The stuff liberals are already saying about Ted Cruz is just disgusting...  Do you support Ted Cruz in the face of liberal criticism?"}]
