[{"comment_id":"1019297701444035","commenter_b":"Fix it or pay the consequences rich people.","commenter_a":"What I want to know, is why in the hell is the contractor, not a American company but one from the UK ?","post_message":"This worker does everything right. He works hard, and all the time, and he still can't feed his kids without food stamps. Why does the Senate allow this?"},{"comment_id":"10153844148480579","commenter_b":"Only when they try to use it as the basis of their platform or legislation. Then it is a big negative.","commenter_a":"Media Silent As Muslims Ethnically Cleanse 60,000 Christians In Philippines By: Daniel Greenfield When thousands of Muslims become refugees, then you can’t get the media to shut up about it for weeks. Thousands of Muslim migrants... jewsnews.co.il","post_message":"Do you consider religion when evaluating a candidate?"},{"comment_id":"1748645152080208","commenter_b":"heck ya we need a woman in the white house","commenter_a":"That's what I'm talking about Clinton 2016","post_message":"BREAKING: NBC News projects Hillary Clinton as the Democratic presumptive nominee. Read more: @webpagelink"},{"comment_id":"10152954324555399","commenter_b":"Well, they're not mutually exclusive qualities. A weasel can both **** others and have harmful effects, especially the more gradual and subtle kind.","commenter_a":"McConnell is a pernicious weasel. Reid will get even.","post_message":"An extraordinary act of trolling:"},{"comment_id":"1132568873502832","commenter_b":"Dont know. You went baiit an switch. Its about keeping these men out. Want more? @webpagelink","commenter_a":"To keep men pedophiles out womens bathrooms? Yes. I agree!","post_message":"How does this make ANY sense? Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"527878314072059","commenter_b":"Put her in jail!!!!!!","commenter_a":"To recap: Hillary is \"the devil\" and has \"hatred in her heart\" and Trump is going to appoint a special prosecutor to \"put her in jail.\" This is how a democracy slouches into totalitarianism.","post_message":"Your reaction to the second presidential debate?"},{"comment_id":"10153128873081051","commenter_b":"What a crazy bitch that is","commenter_a":"Some people shouldn't be allowed to breed.","post_message":"This man was worried when his girlfriend took off with their baby, but he tried to remain calm. Then he noticed the text messages she had sent him. That's when restraint went out the window and he called 911."}]
