[{"comment_id":"4646614632067289","commenter_b":"Need to enforce the laws illegal out of this country!","commenter_a":"Anybody coming into the United States should abide by all laws of the United States for the customs or any other law if not coming through customs legally stay out if you did not come through customs legally get out you have no right to be here illegally that's the law like it or not that's the law abide by it or stay out","post_message":"Do you agree?"},{"comment_id":"1766432363594674","commenter_b":"hillary a rothchilds criminal, she has already been selected months ago to be president all the sheep fall for it, see how the rothchilds find it easy to fool the easily lead with their controlled media","commenter_a":"Typical politician, first it's \"I didn't lie,\" then when the evidence piles up her statement quickly changes to \"I misspoke.\" Well, when you put it that way, I suppose you get a free pass...","post_message":"\"So I may have short-circuited it and for that, I, you know, will try to clarify because I think, you know, Chris Wallace and I were probably talking past each other because of course, he could only talk to what I had told the FBI and I appreciated that.\" - Hillary Clinton"},{"comment_id":"1277987642251583","commenter_b":"When I say technology, I'm talking about millenia of advancements. Even our simplest tools at one point put someone out of work, probably starting with the wheel. If you want to walk away from technology (or just some technology) that's your choice, just don't try and force others to pay for your choice.","commenter_a":"Low skill workers have been making this argument for generations since the first automation came about and it still doesn't work. Someone still has to design, manufacture, install and service the machine. Someone has to stock supplies for it to use. Still plenty of jobs, just not the job you were doing yesterday. They are also overlooking the other basic problem that the Government doesn't create wealth. If you get a freebie from Uncle Sam, that came out of someone else's hard earned money via taxes. If we're all sitting at home due to this miracle automation, then there's nobody around to pay the taxes to fund the government. It simply doesn't work. Worse, we've seen countless times around the world how it doesn't work and people still don't get it.","post_message":"Simply put, the idea is that Uncle Sam will cut citizens a regular paycheck whether they work or not."},{"comment_id":"1859557927611142","commenter_b":"Will be done if u pulled this shit lmao","commenter_a":"@username lol😂😂😂","post_message":"Cold! #WSHH"},{"comment_id":"10153548183098984","commenter_b":"Unless you're Native American, almost all Caucasians have ancestors that were thieves, murderers, and rapists. Shall we remember our horrible history? Shall we remember how Caucasians forced their way through other's land? Shall we remember the genocide that occurred? Shall we remember public lynches? Shall we remember the Trail Of Tears? Shall I go on?..... Who are the TRUE criminals here? Caucasian ancestors FORCED their way through due to greed. Most other immigrants come to America to WORK to provide for their family. So I repeat, UNLESS you're Native American, you come from immigrants as well, possibly even illegal. You're ancestors (Caucasian), if they've been here since the 1700s or 1800s, could have been the murderers, thieves, and rapist roaming around tormenting innocent. An add-in...who will do super low-pay labor? Mexicans are hardworkers, even when we are living in severe poverty, we still try to WORK. Anyone who has common ...","commenter_a":"Donald Trump is to good for any of them....you can't tell a Liberal the truth","post_message":"Donald J. Trump just taught these guys trying to bully him a SERIOUS lesson on why you do NOT try to play hardball with The Donald!   Do you think he has more backbone than Obama?"},{"comment_id":"10154413967139087","commenter_b":"The British started this mess, no one including the US wanted this \" trash of Europe so they found a desert to dump them in, let get along or die, who cares, why do we have to pay for these spoiled perpetual \" victims \"","commenter_a":"Israel will never be at peace, if they don't work for it. Sorry about the comparison but that sounds like something Hitler would do, obliterating a group of people to put your own. Have you ever heard about Divine intervention? God doesn't like when you prosecute His children.","post_message":"#BREAKING: The Israeli government says it plans to move forward with the construction of thousands of settlements in East Jerusalem despite a U.N. Security Council resolution demanding an end to settlements in the occupied territories."},{"comment_id":"10153186979634411","commenter_b":"Also, Gustav, there is a Palestine. There is a squatter on its land that usurped the Biblical name \"Israel.\"","commenter_a":"Um, Europe is crowded. If one million of any group left, it would be good for Europe. It doesn't matter who.","post_message":"'I think out of 3mn Jews living in Europe at least 1mn will leave and it will be a disaster'"}]
