[{"comment_id":"10153735414097293","commenter_b":"is this part of the gay agenda against heterosexual women? Now they want to send men, dressed as women into women's bathrooms? @webpagelink is it not bad enough that radical lesbians have divided the sexes and have by some accounts taken over womens centers with the help of radical like hillary clinton","commenter_a":"Meanwhile he had no problem playing in middle eastern countries like Qatar where the law punishes homosexuality with prison or death. Stop pretending he did this because of principle.","post_message":"Another day, another prominent rock star canceling a show to protest a controversial new law in a Southern state."},{"comment_id":"10153121950974641","commenter_b":"Oh really? Documented mental illness or zealous?","commenter_a":"Ohhhh good to know that! So, the ones to blame are those 150 victims for taking that plane!!","post_message":"Alps crash co-pilot suffered from severe 'psychosomatic illness,' according to reports: @webpagelink"},{"comment_id":"10152505642191770","commenter_b":"She finally bought herself some new boobs?","commenter_a":"People dont realize that both Kim K and Paris are shrewed business women.","post_message":"Remember Paris Hilton? She's back, and she's letting it all hang out."},{"comment_id":"690494281108627","commenter_b":"pregnancy, keep your pants on and shut up!","commenter_a":"They need a Vasectomy law instead lol stop blaming the Uterus","post_message":"100,000 women took to the streets ... and now the abortion law has been dropped."},{"comment_id":"10153573437688984","commenter_b":"That makes sense since she's a woman","commenter_a":"Bruce Jenner is a disgraceful, sick, fake excuse of a man. ..","post_message":"Wow. Franklin Graham just made a massive statement about 'Caitlyn' Jenner on Facebook... now it's going viral.  Nearly half a million people just 'liked' this post... because it's absolutely perfect.  Spread this absolutely everywhere."},{"comment_id":"10152893596581336","commenter_b":"Oh look, Obama making his own rules again...surprise","commenter_a":"Who's the party of NO now.","post_message":"'Congress needs to show patience.'  Moments ago, President Barack Obama said he will veto any legislation from Congress that added new sanctions against Iran. @webpagelink"},{"comment_id":"1041804329212648","commenter_b":"The same family will bring in refugees, no doubt, and will regret that as well.","commenter_a":"At the shelter in my city they put all pits and even half pits to sleep, they don't even adopt them out.","post_message":"Pit bull rescued from 'death row' attacks daughter just minutes after arriving at family home"}]
