[{"comment_id":"1068900079796837","commenter_b":"Right on..","commenter_a":"Guitar picks of course, a pick pocket!","post_message":"Who knew? (via HuffPost Canada Style)"},{"comment_id":"1736136556654311","commenter_b":"Secure our borders. ..Start deporting. AMERICA FIRST. ..GO TRUMP.","commenter_a":"This wasn't a racist comment trump was saying the judge could very well be prejudiced against trump because he wants to build a wall to keel illegals out and drugs and people who wants to do harm to our Country and judges parents are Mexican","post_message":"\"Claiming a person can't do their job because of their race is sort of like the textbook definition of a racist comment,\" Paul Ryan said of Donald J. Trump's recent comments about a judge. @webpagelink"},{"comment_id":"1744978035715181","commenter_b":"Me too. She was sweet. I guess that's why she bit it.","commenter_a":"Kim, I thought you would appreciate this.","post_message":"AMC's the Walking Dead may soon be stumbling its way out of Georgia if the state's anti-LGBT bill is passed."},{"comment_id":"10155114674037558","commenter_b":"One sick BITCH!","commenter_a":"Let me make this clear! We paid taxes to support our children completely in our schools. We did not pay taxes to make you richer, honey... Getting a fat paycheck to make inappropriate jokes about hungry children is not funny to the best of humanity - Just to you! Ms. Rich Monster - (Your Word)","post_message":"You put these Republicans all in one room and they say some evil things."},{"comment_id":"10152966300122093","commenter_b":"You Must love getting raped .. how was your child life stupid","commenter_a":"he's fine as hell he can be my massage therapist any day ;)","post_message":"This man posed as a massage therapist.... he then sexually assaulted the Dallas women he tricked.... @webpagelink"},{"comment_id":"10154746027261350","commenter_b":"He's the Man!","commenter_a":"@username thought you'd appreciate this story.","post_message":"WATCH: 8 years. Over 2 million photos. White House photographer Pete Souza has captured some amazing moments during President Obama time in office. @webpagelink"},{"comment_id":"626971257493453","commenter_b":"Kiss our asses","commenter_a":"he should be charged with murder","post_message":"George W. Bush was right, there were weapons of mass destruction. We always had his back. He is a great man, and a true patriot. Do you support George W. Bush?"}]
