[{"comment_id":"10153543271535950","commenter_b":"If it said \"build a wall to keep the women in their place\" would you be offended?","commenter_a":"OMG get the crisis team there quick. It's a free speech wall that can only be used for their personal agendas and things they agree with . Poor pansies. Oh and make sure the crisis team comes with their prescription pad.","post_message":"The Ohio University wall has been an outlet for free speech for more than 40 years. But some students say the latest Donald J. Trump-related message went too far, and they decided to do something about it:"},{"comment_id":"547567615431531","commenter_b":"And these stupid women continue to bash America when they could be free from the tyranny they have lived with for generations!","commenter_a":"This is not an act of religion, it is an individual's act. We all know who Lorena Bobbitt is but dont go around saying all white christian women go around cutting off male genitals. Perspective people, perspective.","post_message":""},{"comment_id":"10153509665060950","commenter_b":"I'm sorry but that doesn't even sound right. The solution that they put the fetus in does not destroy it. If that was the case every placenta, product of conception, etc, would be destroyed! Most product/tissue that comes from one's body goes into some sort of formalin. And about them giving you back tissue/poc, that will never happen. I don't believe any hospital will be like oh here, you can have your 19 week demised fetus. It's not going to happen.. That's like saying you want your uterus when they take it out. Someone told you a load of crap if that is really what transpired.","commenter_a":"I find that hard to believe. They have protocols to follow when it comes to medical waste. Right? (I honestly believe they do)","post_message":"The woman claims as she screamed for the employee to stop, she could see the face of her child as it was flushed."},{"comment_id":"10153676011437093","commenter_b":"I'm highly educated and make my decisions based on research and personal conviction. I am 100% against abortion used as birth control (not medically necessary terminations). I will never give up my rights to bear arms. And I find your tone patronizing, but that's nothing new. I won't vote for HRC because she is the reason my brothers are dead from Benghazi, she never owns her bad decisions and she cuts out the millions of Conservative women in her views.","commenter_a":"The entire DNC has spoken in this convention as though we millions of Republicans aren't even part of America. Can't wait until he is gone and Trump is our president!","post_message":"President Obama encourages Democratic Convention crowd to do more than boo Donald Trump. #DemsInPhilly @webpagelink"},{"comment_id":"10153687088042235","commenter_b":"Quit giving him attention...if you quit he will kill himself sooner.","commenter_a":"Georgie got a death wish.","post_message":"Seriously. F this douchebag."},{"comment_id":"10155152380736337","commenter_b":"\"I'm an idiot who has never read a book or even been in a bookstore but I fo sho is gonna post on Facebook all day and show those educated peoples the what for!\" And she says to get a life?","commenter_a":"I literally just had to google who J.K. Rowling is. This person has ZERO impact on me. I find it hilarious that these \"celebrities\" think that they impact our lives in any way, shape and/or form.","post_message":"BURN: J.K. Rowling's latest tweet-spree took no prisoners..."},{"comment_id":"1101968433174725","commenter_b":"Okay? That doesn't mean he wasn't talking to all Americans in this quote.","commenter_a":"He was actually talking to the wealthy in America with that phrase. He was about to raise their taxes.","post_message":"BOOM!"}]
