[{"comment_id":"1103187606428737","commenter_b":"More words of wisdom from the vastly intelligent mind of Pelosi, or liberals say the darndest things.","commenter_a":"idiot","post_message":"www.EagleRising.com"},{"comment_id":"1345625752137184","commenter_b":"Sooo true Scott","commenter_a":"No true born-again Christian can consciously vote for Hillary!","post_message":"Which way is North Carolina voting? As #Election Day gets underway, Jenna Lee is live from Raleigh, North Carolina, talking to voters. #50states"},{"comment_id":"10157442603035389","commenter_b":"Omg not shoplifting. Oh the outrage. Shut up pussy","commenter_a":"ARE YOU SHOCKED.....this from.a guy who picks katrina (reality TV star who was shop lifting ) as his spokesman and this woman has been caught several times trying to defend and excuse the lies and bogus claims he has made. THIS IS WHAT HE DOES.....THIS IS ALL ONE REALITY T.V. SHOW and you people have so much hatred and stubbornness that you allow this without question. Care for yourself more to question this man. You can hate hilarious clinton all you want, but that doesn't mean drop your guard down on trump. He will destroy the integrity of our country 10 times more. Bring Rand Paul back!","post_message":""},{"comment_id":"10153394971818984","commenter_b":"She is as stupid as her 2 sons. one is hell now ,, the otherone will follow .","commenter_a":"I wanted him to get life in prison I did not want him to become a martyr","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing... Do you think this Boston bomber got what he deserved?"},{"comment_id":"1755262658020828","commenter_b":"@username, good thing you have a vagina, or your head would be fair game. STFU","commenter_a":"Would anyone want him to be their pilot knowing how little he cares for a human? I wouldn't.","post_message":"It seems that words do have consequences after all."},{"comment_id":"10157411786570594","commenter_b":"Mean douches create little mean douches. The parents created these mean little spawns.","commenter_a":"why does the school district tolerate this? those kids should be expelled and parents should be educated about this....","post_message":"His mother has pulled him out of the school."},{"comment_id":"10154351539851336","commenter_b":"The fact that this women he raped was not aware of what was going to happen to her! makes him a horrible rapist!! even if she was drunk!! the same thing happens when a doctor rapes a women after they been under anesthesia and an adult raping a child is just as bad!! this young adult knew what he was doing, and now practically gets a pat on the back! by his ather and the Judge!! telling him yeah it's okay, you did nothing wrong let's just give you 6 months in jail so that we can get the media and people off our backs!! high five son!! you got my back and I got yours!! how disgusting and bad education coming from his parent!! this world is small and one day he will have a kids one day of his own, he better pray that your babies never ever ...","commenter_a":"I haven't looked at this in detail. No one should have an opinion about this until you look into it yourself. I don't go by what the media says, neither should anyone. Judge not less ye be judged. So if you haven't looked at this in detail, yourself, you can't possibly know the truth.","post_message":"Pastor John Pavlovitz wrote a powerful open letter to the Stanford University rapist's father, who said his son was paying \"a steep price...for 20 minutes of action.\""}]
