[{"comment_id":"814884995294947","commenter_b":"this is sick.stupid bitch,","commenter_a":"SLUT TRASH","post_message":"Only thing this proved is that she is flippin' disgusting. @webpagelink"},{"comment_id":"10154008998213797","commenter_b":"Whites wouldn't understand discrimination lol you sound stupid how about the jews they were white how about the Irish when they came to America they were white what about any German that came over after ww2 they were white now tell me again how ur comments are relevant","commenter_a":"It's not like she labeled their ticket with racial slurs. I guess I don't see what the big deal is. If the waitress had put \"white couple\" on a ticket, no one would care.","post_message":"WAITRESS LABELS CUSTOMERS: Kimberli Wilson went out to eat, and when the bill came, she couldn't believe what was written at the top. The waitress labeled her table by race. Here's what happened when she confronted the manager:"},{"comment_id":"139820166538945","commenter_b":"So next time a woman has a child she doesn't want, wil you take it?","commenter_a":"Thank You, @username. Thank you, for keeping this promise. As you have always been pro-life, this is putting action to those words. #ThankU4speaking4Thebabies","post_message":"Today → House Votes to Protect Taxpayers from Funding Abortion"},{"comment_id":"1200378003330990","commenter_b":"@username then why girl dont get a comfortable bra? DICKHEAD?","commenter_a":"well what if show my boner because wearing underwear is a bit uncomfortable","post_message":"These high school students brilliantly stood up against sexist dress codes."},{"comment_id":"680629115421379","commenter_b":"She needs to just go away already.","commenter_a":"We can let her become president","post_message":"Hillary Clinton slammed Donald J. Trump's \"I'm with you\" proclamation, writing on Twitter, \"Not included: women, African Americans, LGBT people, Muslims, Latinos, immigrants...\""},{"comment_id":"10153263925251990","commenter_b":"@username hubby leaves for work and I wake up","commenter_a":"Jackie Owens @username-Hernandez @username","post_message":"JUST IN: The CHP says two people were struck by blow darts while walking on the Golden Gate Bridge --> @webpagelink We will have more on this story in our News at 11 p.m."},{"comment_id":"971579579554776","commenter_b":"Trump.. love him","commenter_a":"The hugs he remembers were on September 11th? I believe what rand Paul was talking about was when New Jersey got slammed with a hurricane and he was thanking Obama for sending assistance so quickly. That isn't anything more than being an adult professional. Something 99% of republicans are incapable of being.","post_message":"ICYMI: Here are the top moments you were talking about during the #GOPDebate. Who do YOU think won? @webpagelink"}]
