[{"comment_id":"1180918395297096","commenter_b":"@username you come from immigrants, you really believe they should be sent out or kept out. Start packing. Show just how much you believe in this wall.","commenter_a":"Yes","post_message":"Agree or disagree: It's time to build Trump's wall at the border."},{"comment_id":"10154514715036077","commenter_b":"You will be glad to know Trump is looking to hire people like you to build that wall. Jobs jobs jobs, and then he'll send you back and bum pay you. That's how he has gotten rich on the sweat of others people like you who believe his propaganda. According to him we are all here illegally. .and a bunch of low life criminals","commenter_a":"As American hispanics, we are tired of how all of these coward racist liberals that hate America like Obama, Clinton, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, we're supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of our skin... disgusting. That's why we elected President Donald J. Trump. Help us reach more people by following our great pro-America page \"@username\", the only true patriotic cartoon comic strip. And let's Make America Great Again! Thank you.","post_message":"It would take 37 electors nationwide currently pledged to Donald Trump to vote for someone else to derail the election results and trigger a vote in the U.S. House of Representatives"},{"comment_id":"10152872139971130","commenter_b":"Says the bitch who makes more than most men... Lmao","commenter_a":"Says the woman who makes a million dollars a movie for acting while the teacher at her kids school makes 50k or less a year! #equalpay","post_message":"PREACH, Patricia Arquette!"},{"comment_id":"10155994061055354","commenter_b":"I'd really like to know what these morons see in this group that would make them leave the US ,.and join a group who sodomizes little boys and rapes little girls, kills anyone who disagrees with them and thinks they are right. ?","commenter_a":"She had a hard time deciding join isis or black lives matter! It's pretty sad to see the kind of warped minds our society is producing another lost soul gone to waste!","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS.   Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"10156088559505294","commenter_b":"In my opinion, the collarbone issue and sleeveless tops or dresses are a bit over the top. The women in most offices I've worked at wore sleeveless dresses and tops that were tasteful and appropriate. Even the women news anchors wear tasteful sleeveless outfits. I don't see a problem with that. I do however agree a dress code should be in place for kids in school. When they get out in the real world, there are rules, and they have to be followed. 48-50 years ago, we had to wear skirts or dresses that touched the floor if kneeled down. If it didn't touch the floor, we had to change. The guys had to wear belts. If they didn't have a belt, they had to pay 50 cents for a piece of masking tape with the word belt on it and tape it to their pants, and they better have ...","commenter_a":"I say all schools should have a dress code and make sure all students adhere to it. It teaches them to accept things in life their not happy about, but rules must be followed.","post_message":"It's back to school time, and we're hearing more stories about dress code violations. Students at one school in Chicago are protesting a rule that they wear only shirts and dresses with sleeves.   Click below for more, and tell us: Are dress codes these days fair? Unfair? Do they go too far?"},{"comment_id":"10152603535532894","commenter_b":"she slept with Jamie Fox, She slept with a fe NBA players. If you go on the internet its all there and on TMZ. She is a whore too","commenter_a":"Greg has his own real estate investments and can stand on his own. Please. Claudia is a whore. She has slept with everyone just like Kenya hoping for a big break. if you start your career on your back you always stay on your back That is a bad practice of sleeping with people to move up. People will never respect you as a woman or a professional like that","post_message":"#RHOA Fans Outraged: NeNe Leakes Hurls 'Half-Breed' Racial Slur at Claudia Jordan [Video]"},{"comment_id":"1012675578755490","commenter_b":"Stupid women","commenter_a":"shut up skanks, cancel the p.o.s....","post_message":"Umm ACTUALLY it is in the Bible!"}]
