[{"comment_id":"10154140633222093","commenter_b":"cash him ousside howbow dah?","commenter_a":"Loss prevention people were sleeping on the job.....ha","post_message":"ARE YOU HAPPY TO SEE ME? Man steals guitar by stuffing it in pants, walking out of Fort Worth store... @webpagelink"},{"comment_id":"10155518343016729","commenter_b":"This is a repost .....As For Barack Obama, We watched him sit for 20 years in a Church whose preacher condemned America . We watched him travel the globe apologizing for America's greatness .We watched him allow guns to be shipped to Mexican criminals so they could later turn up at crime scenes to mislead American opinion. We watched him use the IRS to punish those with opposing views . We watched him shrink America's military defences ,We watched mistreatment of our veterans , We watched the Ambassador and his protectors be left to die and be covered up by a lie , We watched our nation debt be doubled , We watched the nation's food stamps recipients climb to 25% , We watched a health care system nearly implode to promote some utopian fairy tale. We watched our police be disrespected , race relations fall to an all time ...","commenter_a":"Facebook is so liberally biased. Had this been a post by a Conservative toward Clinton or Obama supporters, the account would have been terminated. Also the person would have been fired from their position immediately. So the school not yet terminating him is garbage.","post_message":"Despicable!"},{"comment_id":"1049118838444933","commenter_b":"Ross I'm quiet familiar with what you and others want, but that's not the way it is,especially me. I served this country for my beliefs and I'll be damned whether people like you like my opinions or not. One day when the liberals get their way and all the refugees and ILLEGALS are let in this country then maybe you may see what I'm talking about. Either way its not my problem, I've served my time and paid a life time of taxes and still paying. No I think Ross today's society are out of touch with reality is the problem.","commenter_a":"As an older person I've come to the conclusion you can't blame these young snot nose, entitled brats. This is the environment that's been created by the liberals, so everybody can feel hunky dory.","post_message":"She probably won't be too pleased..."},{"comment_id":"10154162076211943","commenter_b":"'@username IF 60 % of conservatives and church goers stay home and do not vote. She will win. In 2012 they did not want to vote for a Mormon. SO they allowed a muslim sympathizer to stay in the White House.","commenter_a":"Lold she will just put it in Chelsea's name......","post_message":"The Boston Globe Wednesday demanded that Hillary Clinton shut down her family foundation if she wins in November because the entity 'will always look too much like a conflict of interest for comfort.'  'The Clinton Foundation is also clearly a liability for Hillary Clinton as she seeks the presidency,' the newspaper said in an editorial. 'The foundation should remove a political  and actual  distraction and stop accepting funding.' - via Newsmax"},{"comment_id":"877009682392087","commenter_b":"If you are a salaried worker, no overtime pay. Which means you get a set rate of pay weekly or biweekly and have to work how many ever hours you have to, to finish your job. Whether it's 30 hrs or 50 hrs you get the same pay. It's like that for a lot of managers and supervisors.","commenter_a":"I must be in a bubble, I thought anything over 40 hrs is overtime, I have always been paid time and a half for anything over 40 always. What is it the restaurant businesses? Who doesn't pay overtime?","post_message":"This is HUGE! 'A hard day's work deserves a fair day's pay,' the President said in his announcement.  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153636980216135","commenter_b":"I can't believe an older women like your self could be so ignorant. I've always been taught if you don't have anything nice to say DON'T SAY NOTHING AT ALL! How can those words even come from your mouth. Where is your morals?","commenter_a":"I'm so sorry for his family and friends, but what can you say about someone that stupid...?","post_message":"Police say the man was driving his car in reverse with the door open when he fell out."},{"comment_id":"1003873189632434","commenter_b":"When you take into account what these 2 young men did taking beer from a grocery store well there's going to be consequences plus swinging a skate board well the Police have to do something...I wish I were standing holding a sign I Support the Police Department !!","commenter_a":"I hate to say this but the store video does not lie. Now hopefully they'll release the bodycam video too. Now would be a great time to prove just how successful those are.","post_message":"The Olympia police officer who shot two men last week has given his account of what happened to investigators, and the department isn't releasing information.   More than 100 people packed city hall tonight demanding immediate changes in police accountability >> @webpagelink"}]
