[{"comment_id":"10154370005056162","commenter_b":"She should be CHARGED with TERRIBLE TASTE in clothing!","commenter_a":"The legs are a lot longer than a lot of the short shorts that teenage girls get away with wearing all the time everywhere.","post_message":"TOO SHORT? A burlesque dancer says an airline stripped away her dignity when they told her to change her clothes if she wanted to board her flight... @webpagelink"},{"comment_id":"10153352043126756","commenter_b":"Not a chance until the millions of illegal parasites are returned and hospitals offer them nothing.","commenter_a":"America is for real fucked up. You pride yourself on being a democracy yet you tolerate this kind of crap. Why aren't you all in the streets raising hell? No other first world country would allow a system like this.","post_message":"At the end of her life, MaryLou's family owed $100,000 for her medical bills, after insurance. This is how they struggled to manage both the care and the cost of cancer."},{"comment_id":"10154408526388352","commenter_b":"Boobs are for food NOT fun!!!","commenter_a":"Well that was mean","post_message":"'Step outside and button up': Judge blasts mother and kicks her out of courtroom for breastfeeding her eight-month-old son during custody hearing"},{"comment_id":"1175985589130223","commenter_b":"Eww she be ugly scary","commenter_a":"why is this infidel a councilwoman in the first place???","post_message":"SHE'S INSANE!!! There's no GREATER Threat to America than these liberals who believe our Military, Guns and Police Officers are Dangerous! Lets get 5000 SHARES if you think these people dont DESERVE the freedom our military provides them!"},{"comment_id":"685842924908994","commenter_b":"@username and you are a millennial piece of shit who does not know his ass from a whole in the ground. You should be stepped on like the cockroach you are.","commenter_a":"FYI, George Soros, Move On and Black Lives Matter are responsible for all of the protests going on. These are NOT groups of people who suddenly decided to protest. Therefore, the is more Hillary BS. However, CNN and MSNBC are blaming Bernie and Stein supporters. These people are insane. I am so tired of this BS.","post_message":"Protesters targeted buildings owned by Trump – burning effigies, setting flags on fire and chanting: “Not my president.”"},{"comment_id":"1725328477744790","commenter_b":"A blow job from what you call an ugly woman is still a blow job. We drank, screwed, and partied in cemeteries when I was a teenager.","commenter_a":"Cemetary, huh? Could be 'cause the kid didn't wanta be seen anywhere with such an ugly woman.........","post_message":"Police say that an officer caught 49-year-old Kelly Aldinger in the act with a 17-year-old student at Easton Cemetery."},{"comment_id":"513918755467368","commenter_b":"Screw that fat ass bitch","commenter_a":"Her and the view should of been gone long ago","post_message":"Joy Behar took a turn attacking the mother of the Benghazi victim. #RNCINCLE"}]
