[{"comment_id":"10153049677426051","commenter_b":"She's in her 20's?? Seriously at first glance she looks like an old woman, she needs to lay off the drugs","commenter_a":"Damn.!!!","post_message":"A customer was walking through the Walmart parking lot when she noticed something odd about a nearby green Hyundai. After taking a quick peak inside, she immediately called 911."},{"comment_id":"1452361001456073","commenter_b":"Fuck Trump he is a real dangerous piece of shit he must be taken down at any and all cost do whatever you can to make sure this ultra right wing low life piece of garbage does not become President. Trump do us all a favor die soon asshole.","commenter_a":"Nice pose for his new Facebook picture!!","post_message":"He got TORCHED on twitter."},{"comment_id":"10153911608872577","commenter_b":"The definition of terrorist declares them terrorists.","commenter_a":"No, a Heavily armed group of people using fear and power to push their beliefs on a government is what makes them Domestic Terrorists.....","post_message":"Non-violent occupation now considered domestic terror. #CNN #Bundy #Oregon @webpagelink"},{"comment_id":"10153314695286051","commenter_b":"get over it, all anyone ever sees is when a black gets shot, stupid bitch","commenter_a":"Hell I don't see anything about our Military any more because all I ever see is about cops","post_message":"Two police officers fatally shot a man in Texas this week, but there’s a catch: The suspect fired multiple shots at them first. Did the officers defend themselves appropriately?"},{"comment_id":"10154296449440329","commenter_b":"'@username no need to hide farts no? HAHAHA","commenter_a":"Oliver Wales","post_message":"'Someday you'll meet someone amazing who just gets you. And they won't want to date you either.'"},{"comment_id":"10153107012089474","commenter_b":"By opening her mouth, we can generate all the revenue we need from the gas coming out of her.","commenter_a":"Hey, you nut job, take Sen, Boxer's lead and just retire.","post_message":"Right when Americans are finally feeling some relief at the pump, Nancy Pelosi wants to take it away with higher gas taxes!"},{"comment_id":"10154295602821037","commenter_b":"Claude, women who use the term 'Feminist libtard' are sexy.","commenter_a":"Good lord! If men couldn't get a job because they hit on a woman at one time or another throughout the years, there wouldn't be any in the workplace! Women like this give us all a bad name. She must me a feminist Libtard! I'm sorry....some people will do anything to get attention and they are coming out of the woodwork! She acts like he raped her! I'm guessing she's trying to make a name for herself through Trump since she couldn't with her writing skills.","post_message":"Our reporter attended a Donald J. Trump event in 1987: 'Trump said there would be an even better afterparty and I was welcome to join him, but only if I came alone.'"}]
