[{"comment_id":"1048277701893900","commenter_b":"@username We have the highest number of legal immigrants per year in the whole world!","commenter_a":"I know this is going to be unpopular, but I know many Hispanics who agree with me. There is a legal way to come to the country, and contrary to some of the attacks I have seen on other posts, it does affect our low income Black, Hispanic, and White communities. They are used to a more extreme poverty, so they are willing to work for less than minimum wage, and are off the books, so taxes, SS are not paid. This means an American citizen or legal immigrant is denied a job. When so many of our jobs are being sent to Mexico, China, India how can we not address the issue of those who came here illegally. My nephew's wife is from Mexico. 2 of my nephews have dual citizenship. US/Brazil. I am far from racist or anti-immigration, but our own citizens and legal immigrants are suffering. We ...","post_message":"This week the media reported something that I find not just wrong, but inhumane: President Obama is currently planning \"a month-long series of raids in May and June to deport hundreds of Central American mothers and children\" who came to our country fleeing that same violence. Sending women and children back into harm's way after they already fled horrendous violence in Central America is painful and inhumane, and must be stopped. Sign my petition asking President Obama to stop these raids and to make sure that families fleeing violence in Central America are protected from deportation."},{"comment_id":"1212697888750239","commenter_b":"It's funny how the liberal low information voters want to take guns away from law abiding citizens, as if that will solve anything, yet they don't want to deport the illegal felons and criminals, or prevent them from being able to get guns in the first place; and you don't want to prevent a terrorist organisation that supports ISIS from getting ICBM nukes. Brazil has the world's most strict gun laws, yet people die almost every minute of the day due to gun violence there. You know why? BECAUSE CRIMINALS DON'T OBEY LAWS! That Oregon campus was a gun free zone in an area where open carry is legal. No one would have the guts to go on a shooting spree anywhere but in a gun free zone. Anytime there is a tragedy like thus, the Democrat solution is always more government tyranny. Europe has the same population size as ...","commenter_a":"So I'm sure someone on Facebook will say it's all his fault. Yeah right.","post_message":"A shooting at a school in Oregon is just the latest massacre that President Obama has had to respond to. Read full story: @webpagelink"},{"comment_id":"1414911755215699","commenter_b":"Stupid bitch","commenter_a":"Taylor Paton @username Barrett Paton @username Clint Paton So the house will always smell like a fuckin' bucket.","post_message":"No, you cannot eat the candle."},{"comment_id":"1349045918521792","commenter_b":"You have a lot of names there Laurren.. The typical liberal feminist skank.. Way to go","commenter_a":"Just a suggestion for you @username people. If you dislike Trump and hate that he won a fair election then I suggest you retreat into your safe space for the next 4 years (at least). Shouldn't cause you too many problems as you probably don't have jobs anyway.","post_message":"This website is going viral, and Trump is not happy. You know what to do!"},{"comment_id":"1194478233905538","commenter_b":"@username...your learning is interfering with your lack of understanding and common sense. These people are Muslims as maybe you are. Their ideology is to secede as supreme at any cost including the taking of life to advance their cause. Allowing 10,000 to come to this Country, and not knowing who they really are, is not a smart idea nor is it responsible. We have enough problems in this Country now with illegals and supporting them. We don't need more leaches to feed. And yes, I am a proud Southerner as you have mentioned. Your history is somewhat flawed and Gods laws supersedes mans laws.","commenter_a":"9/11...\"We will never forget\"! The White House has already forgot, allowing 10,000 Syrian Muslims into America...","post_message":"The Obama administration said Thursday it is willing to take in at least 10,000 refugees in the next fiscal year as Europe grapples with the crisis."},{"comment_id":"10153021389625399","commenter_b":"All you have to do is look it up .they are in key positions and were placed there by Plummer. Thank you Franklin Graham keep telling it like it is","commenter_a":"Listened to him!","post_message":"\"Washington, has been infiltrated by Muslims who are advising the White House, who I think are part of the problem.\""},{"comment_id":"828114997284754","commenter_b":"Can goats give consent?","commenter_a":"Polygamy is next. Then incest not far behind. Chris you gonna marry a goat?","post_message":"BREAKING"}]
