[{"comment_id":"10152829806276636","commenter_b":"U can't find african american in this kind of situation coz they are at home just waiting for their money from welfare...since when african american have their sense of urgency in going to work?","commenter_a":"Ironically, wasn't there a case in US of an african american single parent who was desperate for a job, left her children (older than this one) in car in car park so that she could attend interview....put in prison and her children removed, that just doesn't seem very fair does it?","post_message":"He'd got half an hour to work before making the realisation..."},{"comment_id":"870399723007863","commenter_b":"Her and Her Husband are a disgrace to America.period!","commenter_a":"She think it ok i am obama wife","post_message":"Is it her?!"},{"comment_id":"1259514897430388","commenter_b":"I hope the other women in jail rip her to shreds BARE HANDED","commenter_a":"They outta stab her and rip her cords out without painkillers so she cant have any more kids","post_message":"JUST IN: Buckeye mother Andrea Portillo is accused of stabbing her 5-month-old infant to death. MORE: @webpagelink"},{"comment_id":"10154082768681130","commenter_b":"The popular vote doesn't determine the presidency.","commenter_a":"She should have picked Bernie and that way all his voters would have voted for them","post_message":"Meet Hillary Clinton's running mate: Sen. Tim Kaine of Virginia."},{"comment_id":"1640584582874588","commenter_b":"Arnel, stay away from my dog. Haaaaaaaaa!","commenter_a":"We should not reward liars... reject Hillary.","post_message":"“We should not reward people who use inflammatory rhetoric, who use the kind of derogatory comments, whether it's about Muslims, or Mexicans, or women, or people with disabilities, whoever it might be,” Hillary Clinton said, referring to Donald Trump. “That is not a sign of leadership. That's a sign of, you know, showmanship, of desperation, that should be rejected roundly by the American people.”"},{"comment_id":"10154783600566336","commenter_b":"Did the first plagiarize too?","commenter_a":"Trump talked about immigrants, but first he should deport his own wife who is not even american and come here illegally","post_message":"History Quiz: Can you guess the first?"},{"comment_id":"10156161317710354","commenter_b":"the American police would be arrested for this.","commenter_a":"\"....it became clear to German authorities that a significant number of migrants they were trying to process were NOT Syrian refugees...\" They finally came to that conclusion?","post_message":"Chanting \"ALLAH HU AKBAR”...Pelting Police with Giant Rocks...MORE... Follow Breitbart London for up-to-the-minute breaking coverage of the migrant crisis..."}]
