[{"comment_id":"356605304542984","commenter_b":"Round them up. Shoot them. Send body bags back.","commenter_a":"with the help of our government they will win. little bush wants to take the walls down and do away with the border guards , it will save trillions of dollars each year. after all most of them are here now","post_message":"Are the Marxists gaining in their Desire to Destroy America?"},{"comment_id":"10153193077162093","commenter_b":"Women choose their boyfriends over kids all the time. Its only when something bad happens they realize how STUPID they are. If nothing wouldve happened she wouldve kept doing it. Shame it takes something like that to open up some people's eyes","commenter_a":"Skin her and drop her in a lemon juice bath 3 times a day for life.","post_message":"The mom said she desperately wants to be able to go back and make a different choice about leaving the house that fateful day.... @webpagelink"},{"comment_id":"10153334990238132","commenter_b":"There will always be someone looking for the controversy in something as simple as a picture is a baby in a flag. Move on! Be proud of our flag and the POSITIVE way is being displayed. AMERICANS have done worse to our flag!!!","commenter_a":"Any true American can not dislike this photo. This photo is what patriotism is all about! Anyone that has an issue with this photo must not have been born here, because this is what patriotism is all about. Thank you sir for fighting for our freedom.","post_message":"What do you think of the controversy that this photo is creating?"},{"comment_id":"1024965370917718","commenter_b":"'@username Agreed!","commenter_a":"Being vegetarian doesn't change much in the lives of cattle however. Nor hens. It's better than being an omnivore, yes, but still not cruelty free. Although nothing truly is. From medical treatments, medicine, to our pets sustenance, to palm oil, to beauty and household products, etc. As for diet, we are naturally omnivorous. We would not have survived very well as a species without meat as sustenance and the remainder for clothing/tools, along with plants, fruits, nuts, etc. Especially in the North.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1680131802273932","commenter_b":"Just because you have a blinker doesn't mean you can automatically change lanes. What an idiot! She's lucky to be alive. Remember never change lanes in front of a big rig, They purposely leave that space open, they need a lot of room to stop.","commenter_a":"the world is full of stupid once while going to work a farm truck loaded with green beans tried to pass him as of the right as he was making a right turn little car was broken","post_message":"LESSON: don't mess with truckers."},{"comment_id":"10154655790571101","commenter_b":"We will see the illegals go!","commenter_a":"But he promised the morons a yuge wall and told them the Mexicans would pay for it.","post_message":"'These are dreamers who are seeking the American Dream, and we should embrace them rather than do a bait-and-switch.'"},{"comment_id":"660481514127059","commenter_b":"She paid him off!!","commenter_a":"Why is she using Mr. Kahn so much? I thought his family is still distraught about the horrific death of his son?","post_message":"Replay: Hillary Clinton was in New Hampshire."}]
