[{"comment_id":"678779465606192","commenter_b":"Woman you are so ignorant!","commenter_a":"Well hillary killed people so she should be arrested and u should be to for sticking up for her","post_message":"It's funny how that works, isn't it? Like Addicting Info for more great content!"},{"comment_id":"10156317776015354","commenter_b":"Stupid ass!!!!","commenter_a":"Sounds like a plan to me.","post_message":"“No surprise that someone who makes a living glorifying crime and violence is a cop-hater, too.” MORE..."},{"comment_id":"891579364198188","commenter_b":"You're right. It just seems women are more selective.","commenter_a":"How about guys? It is not just all women!","post_message":"Well this is horrifying. (via The Huffington Post)"},{"comment_id":"10153425194311336","commenter_b":"Or illegals","commenter_a":"Yeah lets all love each other just not the gays, liberals, and obama woo hoo ....","post_message":"“At heart we really are indivisible.” Megyn Kelly shares why she loves America. Why do you? Tell us using #ProudAmerican! @webpagelink"},{"comment_id":"662069217316990","commenter_b":"Sorry Bitches !!! Go to jail !!","commenter_a":"Yes!!yes!!!!!yes!!! that;s a shame!! just think?? if that was your mom! or dad????","post_message":"These thugs tortured nursing home patients for an insane reason. These two are monsters. Let's lock them up and throw away the key. Do you agree these thugs should do life?"},{"comment_id":"10156284992790354","commenter_b":"Shes an ugly man","commenter_a":"You can't unwatch. But you can refuse to watch.","post_message":"If you've ever said to yourself, \"Gee, today I really want to see a 74-year-old Socialist disco dance,\" then today is your lucky day. If, on the other hand, you said, \"For once, I'd like to see Democrats not seek to destroy their own country,\" well...no such luck."},{"comment_id":"10155013534653734","commenter_b":"There are many veterans that need work. Why not offer them a job?","commenter_a":"Just make sure they got their paperwork together since you made a public announcement.","post_message":"Starbucks Chairman and CEO Howard Schultz announced the move after President Donald Trump's travel ban that applies to Syrian refugees and six Muslim nations."}]
