[{"comment_id":"439208642934096","commenter_b":"She should be fired !!!!!!!!!!!!!!!!!!!","commenter_a":"The teacher should be fired and possibly sent to Afghanistan!","post_message":"An Illinois teacher was placed on leave after stomping on the American flag in front of students. That teacher should be ashamed; the American flag deserves to be flown everywhere with respect and honor! ForAmerica"},{"comment_id":"10154077939321636","commenter_b":"Oh and they found no drugs in her system. She was just another drunken slapper who thought she could get rich quick with this story. Oh well it's backfired. Good on him for fighting!","commenter_a":"Might have been found not guilty of rape but his actions on the night highlight that he is a the very least a sexual predator of women and his partner is a disgrace for standing by him, but hay ho she might be into that sort of thing!!!","post_message":"The judge gave the jury a 'route to verdict'"},{"comment_id":"10153025802828205","commenter_b":"Cindy @username please those immigrants pay taxes and guess what they can't file them every year. So the United states keep them. And I bet you would do anything if your kids didn't have an education. Or food on their table. Yes those that killed . Do bad things should be deported. Those parents that work . Some people like me have small business. So shut up if you never been on a situation where you don't a choice.","commenter_a":"If the above bill goes trough then where does ending DACA and deportation come in? They are giving them an opportunity for citizenship which if they do that then they should deport their illegal parents especially if the kids have completed school and working. No compromise here or you Republicans will never win the White House and I will only vote to get all Rhinos out of their cushioned thrones.","post_message":"On #TBT, remembering when my Republican colleagues believed in protecting immigrant children, just one year ago. Yesterday, they voted to end #DACA and deport #DREAMers. What a difference a year makes."},{"comment_id":"10153237839494203","commenter_b":"Marxist Feminists are ugly and nasty.","commenter_a":"Would you describe a man as \"testy\", Daily Beast? Thought not.","post_message":" can spin her way out of this. She can explain her way out of this."},{"comment_id":"10154473639164749","commenter_b":"Rebecca Jara","commenter_a":"carry knife free zone signs with them. they are very powerful deterrents.","post_message":"\"I would urge parents to speak to their children about the app and the best ways to make sure they stay safe.\""},{"comment_id":"1039093332808969","commenter_b":"Probably its the smell coming from your stinky vagina bitch...","commenter_a":"Turkish people smell like fart. In the elevator, I aways have to cover my nose 👃 just to bear with their revolting smell. Russia should retaliate.","post_message":"Should be an interesting next few days..."},{"comment_id":"10153853522001336","commenter_b":"Your Governor says yes to more refugees.","commenter_a":"I just found out that approximately 130 Syria refugees are here in PA .","post_message":"“What I want is a watch list. I want surveillance programs. Obviously there are a lot of problems. I want a database for the Syrian refugees that Obama’s gonna let in.” Donald J. Trump went “On the Record’ to clarify his recent comments, emphasizing that he wants to keep track of the Syrian refugees entering the United States, not all U.S. Muslims. @webpagelink"}]
