[{"comment_id":"553770641467261","commenter_b":"Who even cares what that woman thinks? She's a murderer!","commenter_a":"Fricking Amazing, right!?!?! What a POS","post_message":"Is this hypocritical? WATCH: Hillary Clinton called out Donald J. Trump for his lavish lifestyle, despite living in luxury herself."},{"comment_id":"10153415680402293","commenter_b":"How about we stop immigration all together, butt out of everywhere and take care of our own problems!","commenter_a":"He wants to ban Muslims from entering the USA but why he doesnt ban the US from stealing Muslim's oil and lands","post_message":"“How can a country that always talks about human rights and freedom do this or even consider this?”"},{"comment_id":"10152820501225736","commenter_b":"And he signs new contract with Hair Club for Men.","commenter_a":"EEEEEEEEEE-HA!!!!!!!","post_message":"\"Due to the recent derogatory statements by Donald Trump regarding immigrants, NBCUniversal is ending its business relationship with Mr. Trump.\""},{"comment_id":"10154196330336770","commenter_b":"Beverly your character flaw is showing again! You need to get a job at disney oh I forgot your not a foreigner# you need to get a hobby!","commenter_a":"He isn't coming cause Trump plans to change the Visa programs so Disney will not be able to bring over cheaper labor and have Americans train their replacement anymore.","post_message":"Are you buying his reason?"},{"comment_id":"10153702258075779","commenter_b":"Sadly, you're probably right!","commenter_a":"He has been proven over and over to be a business failure, a liar, a walking contradiction, unfit foreign negotiator, bigot, mysoginistist, nuke-happy clown! Does the man have to eat a live baby before people get the hint?","post_message":"We all know for-profit colleges are shady, but how bad can they really get? A former for-profit professor explains why Donald J. Trump's is the worst."},{"comment_id":"10156195156160615","commenter_b":"LMAO! Look at that old Mary!","commenter_a":"Being that he's gay, \"they\" should be \"we\"- \"I don't know why we need special protections.\" Also, \"special\" should be \"the same as\", since lgbts are just asking for the same as everyone else - \"I don't know why we need the same protections as everyone else.\" That's what he said, decoded.","post_message":"\"I don’t know why they feel they need special protections\""},{"comment_id":"10153819870891037","commenter_b":"Build a big hole and build a fence around it. Yeah that outta do it","commenter_a":"A Swatch.","post_message":"“You look at this migration, I said to my wife the other day: ‘You know, they seem like so many men,’” said Donald J. Trump."}]
