[{"comment_id":"10153354052466770","commenter_b":"Who cares what a woman beater thinks fk off chrissy","commenter_a":"Racist lives matter","post_message":"He had nothing good to say."},{"comment_id":"853290011375903","commenter_b":"Actually, the influx of all of the communicable disease carrying illegals getting through our open borders IS his fault! Crooked teeth, acne, and cancer are not communicable diseases. Wake up.","commenter_a":"Oh yeah, blame it on Obama, he's also responsible for crooked teeth, acne and cancer... such an awesomely powerful human..all hail superpresident!!!","post_message":"What do you think about this?"},{"comment_id":"1090200961078541","commenter_b":"No sympathy.. The German people should have turned on their Government years ago for not putting the German people first.. The German people have sat back and just watched as their Government have let these migrant, immigrant and refugee vermin infect their country like a cancer.. And now innocent people have died.. How many more are going to die before someone does something and boots these parasites not just out of Germany, but out of Europe.. Can you imagine it.. a Muslim free Europe..","commenter_a":"Islam to be wiped off planet all together","post_message":"LIVE: 9 dead, multiple injured as truck plows into Christmas market in Berlin in likely terrorist attack Watch Ruptly LIVE here @webpagelink"},{"comment_id":"10152555972045667","commenter_b":"They will make some inmate a great bride.","commenter_a":"Despicable fools.","post_message":"Former Vanderbilt University football players Brandon Vandenburg and Cory Batey were found guilty on all counts for the 2013 campus rape of an unconscious woman."},{"comment_id":"10154373142406509","commenter_b":"It's bc she's white and rich.","commenter_a":"When you have money the law work for you and when you're poor it don't","post_message":"Tonya Couch, the mother of so-called 'affluenza' teen Ethan Couch, had her bond lowered from $1 million to $75,000 at a hearing on Monday."},{"comment_id":"10153961468913132","commenter_b":"'@username she better step away from my man","commenter_a":"'@username @username @username I'm sure you've already heard, but it's foreal.","post_message":"So it IS true! Happy for Gwen Stefani and Blake Shelton. <3"},{"comment_id":"595817020606725","commenter_b":"Excellent point!","commenter_a":"If the Hillary Clinton fans were so well-educated, then tell me why they are turning out in Mass numbers to destroy property, assault their fellow Americans, and anyone who doesn't share their beliefs. My guess is that most of these people don't work and probably didn't even vote. If that's your following Hillary, I am so so very glad that you lost.","post_message":"I believe Spiderman once said that a “tree is known by it’s fruit” and “wisdom is vindicated by it’s children.”  No, wait… that wasn’t Spiderman. It was Jesus."}]
