[{"comment_id":"10153365976956955","commenter_b":"Political parasites.","commenter_a":"Anyone who signs new gun control legislation that infringes on the second amendments should be tried for treason","post_message":"HERE THEY COME: CONGRESS TAKES UP GUN CONTROL"},{"comment_id":"752331831534238","commenter_b":"This guy is DANGEROUS!!! USA will not be a safe place if this ass hole wins. countries like RUSSIA! Will declared WAR on USA. He is thinking to pressure MEXICO to pay for a wall base in WAR!!! Mexico has many ALLIES! WWIII Don't make a bad decision people!","commenter_a":"He is the devil","post_message":"Watch Trump directly contradict himself — watch more here: @webpagelink"},{"comment_id":"893405944041287","commenter_b":"Slap a hoe","commenter_a":"@username What An Idiot She Is","post_message":"Mom Forgets Her Baby In A Shopping Cart A valley mom walked out of a Fry's store in Gilbert this afternoon but left her newborn behind in the shopping cart. 40 minutes later the panicked mom realized her mistake and went back to get him. The baby is back with his family tonight. Photo: Katie McCulley. Full story: @webpagelink"},{"comment_id":"245227072596737","commenter_b":"She's a freaking retard!","commenter_a":"One thing he is not insecure, but you are Nancy","post_message":"\"I feel sorry for you. You're the president of the US and you're so insecure...I pray for your Mr. President. And more importantly, I pray for the United States of America.\" Do you think Trump is insecure?"},{"comment_id":"870399723007863","commenter_b":"Her and Her Husband are a disgrace to America.period!","commenter_a":"She think it ok i am obama wife","post_message":"Is it her?!"},{"comment_id":"1764684433799515","commenter_b":"Class all the way !! Just think they want to make America great again !!","commenter_a":"Boring & hard to understand","post_message":"It was truly an honor to introduce my wife, Melania Trump last night. Her speech and demeanor were absolutely incredible. Very proud! #GOPConvention"},{"comment_id":"10152920542711107","commenter_b":"Yes! Stop her!","commenter_a":"Yes","post_message":"Can you and I get 10,000 more signatures on Facebook? Over 21,000 of you have sent your \"Stop Lynch\" Emergency Fax Petition through Facebook -- and your voice is being heard loud and clear. Momentum is building against her confirmation thanks to your outpouring of opposition. In fact, two previously undecided Republicans announced their intention to vote against her nomination. But you and I can't stop now. As you know, Loretta Lynch has proven herself to be an advocate for the lawless conduct of the Obama administration and not an advocate for the rule of law. That's why I'm counting on you to keep the pressure on and urge my colleagues to vote \"no\" on her confirmation. Sign your \"Stop Lynch\" petition right away!"}]
