[{"comment_id":"10153210976889726","commenter_b":"The love affair begins","commenter_a":"How much are the promises he made going to cost us this time?","post_message":"WATCH: Obama and Castro sit side by side!"},{"comment_id":"10153932824095575","commenter_b":"If you have bones in your closet be sure they will come out.","commenter_a":"BS alert!","post_message":"National Enquirer parent company refutes Ted Cruz--- DONALD TRUMP had nothing to do with our story...."},{"comment_id":"10154566603193645","commenter_b":"Most murders in US is commited by non Immigrant. Sandy Hook was by a mentally unstable person. Charleston commited by a Rasist unrepentant kkk inspite of the grace afforded him by the people he killed and their families. Florida commited by mentally unstable guy. The guns remain a major problem . Why is there no Presidential order banning guns. No NRA sponsored their election. Why ban muslims but allow christians. A a Christian myself I see this as very wrong. Saudi Arabia had 15 of the 19 killers of 911. Why is Saudi Arabia not included. Something is not right . I am Proud of the brilliant Judges. No one is above the Law.","commenter_a":"They should be thrown out and replaced. They can run for a political office if they want to push a political agenda","post_message":"BREAKING: A 3-judge panel just unanimously ruled against reinstating Trump's Muslim travel order. Do you support or oppose the court's ruling?"},{"comment_id":"863998766982005","commenter_b":"Women. Are. Psycho.","commenter_a":"not worth it.","post_message":"A woman has died in a car crash after chasing down her husband who was with another woman. What do you think? Crazy details here:"},{"comment_id":"1802927083306226","commenter_b":"Well you got what you wanted...he called Illegal Aliens, 'Guests' Now wallow in it.","commenter_a":"Only people glad he's gone are the criminals and illegals","post_message":"LIVE VIDEO: There's a new sheriff in town as Paul Penzone is sworn-in as Maricopa County's 37th sheriff after defeating Joe Arpaio in November's election. Arpaio served as sheriff for the last 24 years."},{"comment_id":"571151523088148","commenter_b":"Woopi is possessed. She can't help it.","commenter_a":"This is the woman who tried to lower the RAPE benchmark by stating in defense of an acused rapist that it wasnt ' RAPE rape.' I heard her with my own ears.","post_message":"Did Whoopi just blame women for having affairs with Bill Clinton?  Watch the clip."},{"comment_id":"10156205227255354","commenter_b":"ALL yes ALL of them...with the illegals! !!!!!!","commenter_a":"I would support someone who wants to deport all Muslims.","post_message":"Guess what percentage said they would..."}]
