[{"comment_id":"1398317006928016","commenter_b":"I don't particularly like or support this woman for the position. But this is petty.","commenter_a":"Christian Heredia 😂","post_message":"Trump's Secretary of Education. Speechless."},{"comment_id":"1012675578755490","commenter_b":"Stupid women","commenter_a":"shut up skanks, cancel the p.o.s....","post_message":"Umm ACTUALLY it is in the Bible!"},{"comment_id":"10154838480761729","commenter_b":"Nothing will stop this because they want to become martyrs and are ready to die for Allah. Killing them before they kill you is the only solution.","commenter_a":"Here we go again, it's the guns! Oh wait, I thought ALL guns were illegal in Germany? They need to tell these criminals that they are not supposed to have guns! How dare them break the law and get illegal guns! They need to make more gun laws because that will make it harder to get guns.","post_message":"UDPATE: Authorities warning MASS TERROR ATTACK UNDERWAY  Manhunt underway, public transit shut down..."},{"comment_id":"10150650975759999","commenter_b":"Idiots will vote for Trump.","commenter_a":"How do you spell landslide? Trump Trump Trump...","post_message":"When it comes to Donald J. Trump and the 2016 race, 'we're still in the swimsuit competition. It gets harder in the talent rounds.'  Read on in The New York Times Opinion."},{"comment_id":"10154575658114255","commenter_b":"The women who want to be at the beach fully clad should be left alone. Why is this an issue?","commenter_a":"Those women would be sentenced to death for not respecting the laws and religion of some countries.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"865416670223607","commenter_b":"Your mother is a dumb fuck you ignorant whore.","commenter_a":"WW3","post_message":"Turkish F16s warned the jet over the airspace violations before shooting it down, the military official said."},{"comment_id":"10153302910759087","commenter_b":"But the sheep love the Queen of BS and her Lies, Hillary the evil millionaire theft by deception. and lair","commenter_a":"Carly doesn't back down from a fight. I would NEVER go on that show after that BS. She's a better woman than I!","post_message":"“My message to the ladies of ‘The View’ is, ‘man-up,’” Carly Fiorina said. “The Obama administration, for example, has been bad for women. Planned Parenthood is harvesting body parts. If you don’t like those facts and those messages, than man up and debate me on them. Don’t sink to talking about my face.”"}]
