[{"comment_id":"10154812464086049","commenter_b":"Folks, it is a well known fact in the mental health community that many folks who take ' street drugs' have an underlying UNDIAGNOSED psychiatric condition , such as depression, anxiety, etc. They are 'self-medicating' themselves with street drugs. It is a shame, because many of these individuals could be helped with an early identification and treatments (therapy preferably and meds if needed).","commenter_a":"They should be charged with manslaughter if any of their 'customers' died from overdoses. Sorry. These guys knew what they were selling kills people.","post_message":"HEROIN BUST: 9 people have been arrested in connection with a heroin and oxycodone drug ring on Staten Island. Prosecutors said they've selling for several months. Names of suspects: @webpagelink"},{"comment_id":"1064573833613565","commenter_b":"So much hate is was fuels the violence like what happened in Orlando .for all that keep on with with Muslim need to die why hide your face if your so though to say thoughts words only cowers hide behind masks .....","commenter_a":"Gun control does not work and this is proof","post_message":"The FBI, Orlando Police and officials gave an update on the Pulse terror attack. Here's the latest: @webpagelink"},{"comment_id":"1056097081119075","commenter_b":"These lowlife Muslims are doing that in every country they are aloud into ! It's even going on here in America . It's how they take over a country without fireing a shot , they just out reproduce the natives and within a decade or two they will out number and be able to inpliment sharia laws ! We know Muslims have completely taken over one American city and are working on many more ! All these Muslims Obama has been bringing in are sent to certain cities for a reason ! Obama and Hillary are traitors and she will just pick up were Obama left off !","commenter_a":"Surprise, surprise.","post_message":"Muslim Pig Explains How He LIED To European Authorities To Bring In 4 WIVES  They are all about gaming the system and abusing our freedoms.   @webpagelink"},{"comment_id":"10152706974886717","commenter_b":"As an Australian, observing from afar, ALL your possible candidates are hypocrites and troubling. In a perfect world, Bernie Sanders would be President and the GOP and the Tea Party would have melted into oblivion. However, it's NOT a perfect world, and I'm a realist. Even the darling of the left, Elizabeth Warren, is an avid supporter of Israel, whilst allowing the continued persecution of the Palestinian people. Politics isn't about the best possible person: it's about the least worst. Hillary Clinton is the least worst by a country mile. We know where she stands. We know how she thinks. We know how she works. We know she's a fierce supporter of women's rights. We know she's learnt a lot of painful lessons from her time as first lady, Senator for NY, and as Secretary of State. I also believe that she's learnt from these mistakes to make herself a ...","commenter_a":"Doesn't mean she should be president. we need to stop being single issue voters and look at the whole picture.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153184134613984","commenter_b":"she is a drama queen & idiot.","commenter_a":"What a crock of crap!","post_message":"People are NOT happy about this, and they're calling her out for it big time.  Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"1212344615481226","commenter_b":"WHAT THE HELL IS WRONG WITH THIS WOMAN?????","commenter_a":"Another sold out politician who went off the deep end...","post_message":"Goodness gracious..."},{"comment_id":"460068644183716","commenter_b":"Illegals breed for welfare-their U.S. born-anchor babies support them!!!","commenter_a":"how did they get them to start with.","post_message":"Should All Illegals Collecting Welfare Be Deported?  Comment 'yes' or 'no'."}]
