[{"comment_id":"10153461006671717","commenter_b":"Welp since all the lesbians I see on here basically think its hilarious, and a silly hearted statement meant with no hate or bias I guess you're just one of those super bitchy \" right to be offended\" people that wake up everyday looking for a reason to be Cunty.","commenter_a":"I'm not buying it. I don't think the joke was just in good humor. There's enough language here to clearly see that he was being hateful towards the LGBT community. After all, he did say the word \"lesbian\". Isn't that enough to ban him and boycott him from everything? Shouldn't we be calling him hateful names for his aweful transgretions?","post_message":"Funny or die?"},{"comment_id":"900210363349638","commenter_b":"Yep, definitely my twin lol","commenter_a":"@username this you lol had to double take lol","post_message":"“There has never been anything like this seen in a fish’s gills before.\""},{"comment_id":"1100137706687990","commenter_b":"Couldn't she have just not threatened him with scissors? Criminals need to be held to their actions","commenter_a":"Why were the police called? Where is the audio to the video? Why doesn't the video show the shooting? In the video, she is obviously advancing on the officer. And it doesn't matter how big the person is or what they have, a weapon is a weapon.","post_message":"If a 100lb woman makes you fear for your life, perhaps your to much of a coward to be a cop!!"},{"comment_id":"1799616930271434","commenter_b":"Liar!","commenter_a":"The more she says it the less I believe it.","post_message":"\"Certainly my meeting with President Bill Clinton raises questions and concerns.\" Attorney General Loretta Lynch says says she will accept the recommendations of the FBI on whether to pursue charges against Hillary Clinton."},{"comment_id":"10153712087136336","commenter_b":"That teacher should be ashamed of herself she is just a bully!!!","commenter_a":"So very, very sad. The teacher should be fired.","post_message":"Lloyd's mother, Nyesha Terry, found him seated at a desk away from other students wearing a trash bag a teacher had turned into a poncho."},{"comment_id":"10153843599995796","commenter_b":"@username - did white privilege cause 360,000 Union soldiers to die fighting to free the slaves?","commenter_a":"Black lives matter is a racist (by definition) organization funded by George Soros to spread a false narrative, agitate and wreak havoc. People who fall for it, like Ms. Hathaway, are never interested in \"having a conversation\".","post_message":"\"I believe the Black Lives Matter movement calls on us to acknowledge our white privilege and its unfairness, to listen to the lived experiences of our darker brothers and sisters and to help them to achieve a world in which people of all shades live in safety,\" Julia Hathaway writes in her OpEd."},{"comment_id":"1495136007456674","commenter_b":"Just every woman with a family huh? Men with a family don't do more too?","commenter_a":"You all don't know what hard work is. Every woman that has a family does more than fast food workers, and fireman definitely do much more than fast food workers!!!","post_message":"\"Some people say paramedics don't even get $15 an hour and they save lives. So why should fast food workers get that?\" That question comes up a lot when we cover #FightFor15 rallies, like this one in Detroit. But Fox2's Roop Raj is having to defend himself just for asking it. Watch his whole report here and see what you think: @webpagelink"}]
