[{"comment_id":"10153236659491051","commenter_b":"Wait a minute. These girls made threats against someone's life and are suspended from the cheerleading squad for three games? What's wrong with this picture? Are you kidding me?","commenter_a":"OMG criminal charges and other parents need to be involved in their daughters' cruelty towards another student.","post_message":"This mom was horrified when police contacted her and told her what was happening with her daughter."},{"comment_id":"10154241809909411","commenter_b":"@username yes they can. They feel more comfortable in turkey then Europe. Lots of racist people giving them dirty looks in Europe.","commenter_a":"Europe should consider making a deal with Greece rather then Turkey who is playing its proxy war over Refugee crisis.. European Parliament Greece is honesty and has no evil or greed sort of motive behind this cause. They can handle refugees better then turkey. Who by the way is taking advantage of the European Parliament by making a deal and asking a free hand to strike and bomb Kurds who are basically fighting ISIS which turkey is making it hard for kurds by attacking them and making it easy for ISIS to freely invade other save areas of Iraq and Syria..","post_message":"'People detained on Lesbos and Chios have virtually no access to legal aid, limited access to services and support, and hardly any information about their current status or possible fate'"},{"comment_id":"1077236902352732","commenter_b":"Ya \" maybe in Florida . You know were the Zika mosquitos were found!!!","commenter_a":"Yeah...but nevermind when democrats block Zika funding. @webpagelink","post_message":"How do they sleep at night?  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154290485811545","commenter_b":"Building a physical wall between MX is imsidious but ee must create a climate of understanding with the that they are responsible for these people comimg over illegal. We need to have serious talks with Mexico and make clear that vast fines will be waged against them if this invasion continues.","commenter_a":"He's lying like his president about everything","post_message":"Our Facebook stream has ended, but you can keep watching here: wfaa.com/livevideo  WATCH LIVE: Confirmation hearing for Alabama Senator Jeff Sessions, President-Elect Donald Trump’s pick for attorney general.  MORE: @webpagelink"},{"comment_id":"1197017153648966","commenter_b":"Get her on board and watch him sink........","commenter_a":"Her only claim to fame is loosing and quitting.","post_message":""},{"comment_id":"418283194962942","commenter_b":"They are all criminals, that why they call them Illegals.","commenter_a":"So you want to prioritize sending back students & children before the criminals. I see.","post_message":"This Texas judge is boldly standing up to the White House. Should more follow his lead?"},{"comment_id":"10155997067345354","commenter_b":"Hopefully, Palin and her Carnival Midway Freaks family will return to obscurity soon. Surely she's spent all the money she collected for running for political office by now.","commenter_a":"China is killing us just like Donald Trump said, and our country's leaders do act like that are stupid who are only interested in staying in their cushy jobs in Washington DC, and who keep lying to the American people about race, gender. And all the other social things that will distract the American people from really noticing that your country's Government is crashing our country's economy. And that the media is playing hand and glove along with the Washington DC establishment of both political Parties. Because the media likes their cushy jobs also, and really don't want to change how our country is run, for no reason. So we the American people Ladies and Gentlemen were always on our own and we just never realized how bad these guys were, and simply trusted in the wrong people. Who would believe that all three branches of our country Government Institutions ...","post_message":"“It is such a sham business. This BS of them touting all the medical services they provide women and the free healthcare–They don’t provide all these services.\""}]
