[{"comment_id":"992656437438363","commenter_b":"Ban cars and booze. They made her do it !!","commenter_a":"The amount of unregulated stupidity shown by this younger generation is just absolutely astounding. It just blows my mind bravo idiots bravo","post_message":"Police couldn't believe what they were watching unfold live:  “After 30 years of law enforcement I hadn’t seen anything like this before.”"},{"comment_id":"455232604658620","commenter_b":"Hillary Clinton!!!","commenter_a":"Bernie Sanders!!!","post_message":"Listening is always better."},{"comment_id":"797236390409541","commenter_b":"Stfu no one wants to hear your mouth.","commenter_a":"Donald Trump is a BIG Government Authoritarian and progressive fraud from New York City He's NEVER been a conservative, and he NEVER will be conservative -- he's an actor, a phony, pretending to be what he's not.","post_message":"I'm getting really tired of this."},{"comment_id":"10153512973605671","commenter_b":"It was her idea. Men don't gaf","commenter_a":"Hahaha thought this was funny Brock. Idiots","post_message":"The massive metal pieces were found in an odd place—a backyard wedding"},{"comment_id":"1369597926402497","commenter_b":"Vote for Ohillary then...you deserve her","commenter_a":"Republicans have been telling trump supporters for months they wouldn't vote for trump. Now trumpsters are acting like it's a surprise. Well...surprise. #NeverTrump","post_message":"Sorry, Rick Scott."},{"comment_id":"1118673694809606","commenter_b":"yeah...chickens have lips and pigs can fly!!!!!","commenter_a":"not with him in office.","post_message":"Can Obama convince voters US moving in the right direction?"},{"comment_id":"10153352212341162","commenter_b":"So, Michael \"TheArtist\" Louis, what you're saying is- the young man in the meme isn't \"black\" enough for you? That only people who subscribe to the stereotypical depiction of how black people dress and behave are \"real\" black people? If that's not racist against African Americans, I don't know what is... Smh. And isn't the point of ending racism getting AWAY from stereotyping based on the color of a person's skin? The funny thing is, the meme maker -who is presumably black based on what the meme says- is *trying to* say that white people are racist, when in reality - they have such deeply rooted issues of their own that they didn't even realize their meme was racist against themselves. Start with yourself...","commenter_a":"Looks like she for sent home for having a black date nothing's wrong with her dress","post_message":"TOO REVEALING? A girl was sent home from prom because school officials thought her dress showed too much skin. What do you think?   PHOTOS: @webpagelink"}]
