[{"comment_id":"10153696766386159","commenter_b":"Blue laws are state laws or local laws that regulate in state commerce and are not the purview of the Federal Government. Few states have Blue Laws any more. In our state, only alcohol (package sales) are banned and that decision is made locally - not by the state. We have dry counties and dry townships. That decision is made by local residents.","commenter_a":"Freedom OF religion is also freedom FROM religion.","post_message":" United States of America did not create religious liberty. Religious liberty created the United States of America."},{"comment_id":"1069463933089027","commenter_b":"All abortions are murders !","commenter_a":"he knows what we all know, the muslim is a fool a joke a laughing stock a disease forced on AMERICA","post_message":"*****BREAKING NEWS*****"},{"comment_id":"800077153428906","commenter_b":"Women....or bitch....","commenter_a":"Welcome to a Hillary Presidency: Day to day scandals and law breaking. But, the Dems are OK with that as long as their guy is in office.","post_message":"This is definitely raising eyebrows..."},{"comment_id":"1269427259813296","commenter_b":"SOME OF YOU IMBECILES SICKEN ME WITH YOUR OPEN MINDEDNESS TO ALLOW MORE REFUGEES AND WHICH ARE TERRORISTS COME INTO THIS COUNTRY!! WAKE UP UNLESS YOU WANT TO BECOME ENSLAVED TO THE RELIGION OF ISLAM AND LOSE ALL YOUR FREEDOM ,BE BEATEN,BE RAPED ,BE BEHEADED..ETC...ETC...THERE'S NO PLACE IN THIS GREAT COUNTRY FOR YOU UNTIL CHRIST'S RETURN,THEN SHALL YOUR FATE BE DELIVERED AND ETERNAL HELL AND DAMNATION WILL BE UPON YOURSELVES,NOT 72,000 VIRGINS AS YOU THINK !! THE ONLY VIRGINS YOU RECEIVE ARE THE INNOCENT LITTLE GIRLS 6,7,8,9,10 YEARS OLD THAT YOU ARE RAPING AND DESERVE DEATH TO YOURSELVES FOR!!","commenter_a":"STFU he said he does not reveal plan! STFU","post_message":"Broken campaign promise!"},{"comment_id":"1511171265602298","commenter_b":"The Swiss do not have to do anything any muslim may demand! These muslims making demands that is not their place.Who the hell do they thik they are, they leave their land and move unwanted into another and they make demands? Sorry bacon lovers that is all the world will offer you. take it or leave!","commenter_a":"Works for me ?!... what hat ?!!!........ @webpagelink","post_message":"Ridiculous!"},{"comment_id":"10154196354922541","commenter_b":"She looks ridiculous","commenter_a":"love it!","post_message":"In case you missed it, Beyoncé’s pregnant."},{"comment_id":"10153252381712016","commenter_b":"Don't speak for young women. You aren't one.","commenter_a":"Young women see through Hillary..she put up with a cheat for a husband as a ticket to the WH...thats not what young women want for a future...its from the 50s...she lied to protect him through numerous scandals and no longer does it convincingly...she mumbles stock phrases about equality with no real commitment to anyone but her ambition!","post_message":"\"Through a record-breaking voter turnout, we won because we harnessed the energy and the excitement that the Democratic Party will need to succeed in November.\" --Bernie Sanders"}]
