[{"comment_id":"10153785867669228","commenter_b":"Yo mama a obese dummy she should of swolled yo daddy nut.","commenter_a":"Oh like white bithes don't steal stfu","post_message":"Three women pushed shopping carts full of toys from a Toys''R''Us"},{"comment_id":"10153487443061336","commenter_b":"Lawrence and Ruthanne Dolezal parents, both white as snow. Only time she is black is when the lights go out.","commenter_a":"OMG how proud her folks must be. Shes as black as Obama is white.","post_message":"“I wouldn’t say I’m African American, but I would say I’m black.”   Former NAACP leader Rachel Dolezal said in a new interview that she didn’t deceive anyone about her race."},{"comment_id":"10154189668593352","commenter_b":"Husbands fault!!","commenter_a":"She's young and does not realize the damage that she's doing and the fact that she cannot deny it!","post_message":"Sidechick Embarrasses Wife on Social Media – Posts Videos of Her And The Husband Doing 'You-Know-What'! (PHOTOS)"},{"comment_id":"1561091183908226","commenter_b":"I'll contact everyone of these cunts. I'll fly our and found your bitch ass into the ground since they are so profoundly sure I am not the face of death they never danced with. Boom...","commenter_a":"Boo hoo, my pussy hurts because I didn't get my war queen!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1238390432847651","commenter_b":"Shut up Head","commenter_a":"THE FACTS ABOUT MUSLIMS ------ MUSLIMS are not here to assimilate. Muslims have NEVER assimilated to any society. ... THEY COME TO: ... * Force THEIR' traditions, beliefs & political system upon us. * Delete our Traditions, Beliefs, religions & political systems. TECHNICALLY SPEAKING: Islam is NOT a religion. Islam is a 'political ideology/government' hell bent on erasing all OTHER religions & ruling the world. Islam is hell on Earth... Eradicate this so called religion. SPREAD THE WORD, COPY & PASTE!!","post_message":"Seven civilians, including three women and a child, have been beheaded by suspected ISIS-linked militants in southern Afghanistan."},{"comment_id":"10153740264340667","commenter_b":"This woman is unethical and unprofessional and immoral @webpagelink","commenter_a":"It's not just him who sees it. Many people see how biased and one-sided the media is. Very unprofessional. No shame left. I'm not against anyone here. I simply criticize the corrupt system.","post_message":"Not the first time it's happened this election cycle."},{"comment_id":"10154831956721350","commenter_b":"Isn't she supposed to be in Canada?","commenter_a":"why is she here? I thought she was leaving the country?","post_message":"WATCH: We love Amy Schumer's powerful message to body-shamers! @webpagelink"}]
