[{"comment_id":"10153542319922629","commenter_b":"Do you job or get the hell out of the way. She should have been fired weeks ago when she first refused to do the job she is being paid to do.","commenter_a":"a woman that has been married 3 times is turning down marriage licenses... go figure","post_message":"Citing religious beliefs (as opposed to, say, deep-seated, bigoted hangups), the county clerk refuses to treat gay people as equal to straight people."},{"comment_id":"741928785958028","commenter_b":"Stop calling it \"OBAMACARE\"! It's the AFFORDABLE CARE ACT!!!","commenter_a":"The people that voted for Trump knew that this repeal was part of his plan. You voted for him, don't cry now. Suck it up. Unfortunately the ones that didn't vote for him have to suffer too.","post_message":"The American people know that this is a matter of life-or-death, and they're letting Republicans know it."},{"comment_id":"1109745385756047","commenter_b":"@username You are a waste of space aren't you darling...😉","commenter_a":"If you have ever been to Paris or London,You would know these are the two most disqusting cities in Europe. These two are stupid !!Glad to see all the comments, and no one has even been there, or has any Idea what shitholes these cities are ! LOL.","post_message":"Donald Trump is officially an international embarrassment. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153416110184705","commenter_b":"It took a woman to git r done!!!","commenter_a":"good","post_message":"A woman scaled the 30-foot flagpole outside South Carolina's Statehouse and pulled down the Confederate flag."},{"comment_id":"490217177839688","commenter_b":"YOU BITCHES DON'T MISS ANY WELFARE MEALS DO YOU!","commenter_a":"Only thw Daily Dummies would bring more media attention to something like this. Learn the legal system who iduots. This guy wasn't guilty ever and the rest of Baltimore now knows it too.","post_message":"Baltimore city residents expressed disappointment in response to the city circuit court Monday finding a police officer not guilty in connection to the death of Freddie Gray."},{"comment_id":"1080347691985409","commenter_b":"Exactly","commenter_a":"Frankly, no matter whether the women went back to him--maybe they were screwed up emotionally at that time too--he assaulted them. It's the 21st century. Stop trying to drag women through the mud for reporting it. Choking is assault, n'est pas?!","post_message":"\"Nobody close to Jian even pretends he is innocent, and somehow this isn't an issue the women are.\""},{"comment_id":"10154853515096336","commenter_b":"Go away troll! You don't even live in our country","commenter_a":"I bet a million dollars kellyanne conway gave her soul away for for a few bucks and a pussy grab","post_message":" it up, Kellyanne Conway said to Jill Stein. your friends at the Clinton campaign said it won change the results. Conway suggests that the outrage over the call shows many Americans' unwillingness to accept Donald J. Trump as their president and to give him a chance, which includes Green Party presidential nominee Jill Stein three-state, vote-recount effort. Do you agree? @webpagelink"}]
