[{"comment_id":"10153305940576051","commenter_b":"If she is guilty, she should get the death penalty...","commenter_a":"\"Parents should be allowed to do whatever they want with their kids,\" we insist. \"It's THEIR children,\" we say. But what happens when the parents are sick and twisted? Huh? Don't kids have a right to be safe from their own parents?","post_message":"Even the grand jury was stunned that a mother could be so cruel to her own daughter."},{"comment_id":"850397761665128","commenter_b":"I'm a 20 year retired air force vet and a woman and this kind of treatment is common among the other sex","commenter_a":"In fairness. I wonder if the person thought the parking space was ONLY for physically wounded vet. Just saying. I agree the person was wrong. Vets come in all sizes, shapes, colors and gender. We all served. In AL we can even get the word VET on our drivers lic now. Just new.","post_message":"WOW! What do you think about the note left for this woman?"},{"comment_id":"1164695216980191","commenter_b":"@username if you don't appreciate how this site reports things or how it's run, do us all a favor and take your clicker to someone else's bait!! Life's too short to have to deal with such negativity! Peace!","commenter_a":"This happened a year ago... Wonder why it is recirculating?","post_message":""},{"comment_id":"1509437802422806","commenter_b":"All you ladies with your agendas should probably put it to ACTUAL LEGITIMATE use and aim it where it belongs: at your incoming government. I for one, have never just gone around grabbing random pussy or publicly proclaimed that I wanna fuck my own offspring. Actions speak so much louder than your weak ass words. Pick the RIGHT battle, for once!","commenter_a":"Call me crazy, but this dudes most impressive moments happened in a wheelchair on a kids show. So...he's banging an old whore. Whoopity-Do! I don't get and never have gotten the hype. Lol","post_message":"Drake won 2016."},{"comment_id":"910598689036384","commenter_b":"You belong down in NO with the rats. You must be proud to live in one of the shittest places on earth. Simple math there's more whites than other races of course its going to be a higher number.","commenter_a":"What choice do they have? They were forced into this public position. They can't exactly say \"please burn these racist institutions to the ground until America really feels our pain\".","post_message":"Freddie Gray’s family asks for calm in Baltimore."},{"comment_id":"10154015099517885","commenter_b":"So sad i am sure they will love that thight brown hole in prison be a man not a fallower make something of your life","commenter_a":"Then we will finnally get rid of all gang bangers","post_message":"We couldn't make this up even if we tried!"},{"comment_id":"10154883031433010","commenter_b":"Illegal Immigrants have been paying taxes for the longest time. Look it up. I suppose you don't want that money either.","commenter_a":"Those law makers assume that all Californians want this, many of us don't want lawless immigration, no matter what country they are from. We don't like that our laws aren't being enforced and our budget and resources for our state are being given away to non-Americans.","post_message":"California's fighting back."}]
