[{"comment_id":"10154287048884205","commenter_b":"TYT hello from Juneau Alaska! We are on the watch out here! Trump might sell us off back to the Russians, for a few barrels of oil!","commenter_a":"Hi Joe!!","post_message":"The Young Turks LIVE! Hosted by Cenk Uygur and Ana Kasparian"},{"comment_id":"10156580556107228","commenter_b":"No sweetheart they don't have no idea what fighting for their rights is about. I don't recall any civil wars that were fought to free the transgender. How many transgender have had crosses burned in their yards, how many transgender have been hung in trees? How many transgender were murdered for being transgender? Special kinda of stupid are the folks that think that the struggles the black community have faced and continues to face compares to Johnny who wants to wear a dress!!!!","commenter_a":"Sorry but to try to compare the two is insulting. I don't recall transgenders ever being enslaved, I don't recall transgender ever having to fight for their civil rights. Being transgender is a choice you make, wether you feel you were born this way or not is debatable. Black is black, no debate there.","post_message":"I sat on the plane this week with a beautiful family.  The mother introduced her three children to me and opened up to me that her youngest daughter is a trans child. She is actually a documentary producer and is working on a film about trans children, a film that will try to confront and dispel the wide spread fear, ignorance and bigotry that surround trans Americans. She allowed me to watch the trailer and the beauty, struggle and courage of the families she highlighted resonated with me deeply. I pray that we all grow more courageous in our empathy, that we all seek to understand each other more and that we all become better agents of love and justice. As for me, I condemn the actions of the Trump administration in their reversal of transgender student protections. I will not yield in the fight for equal rights and equal protection under the law. We all owe an obligation to those freedom fighters who fought for civil rights, women's rights, workers rights and human rights over the past generations. We can not pay those heroes of love back, we can only pay it forward. Now is the time that history calls on us to make for a better future for all. #protecttranskids"},{"comment_id":"10153030735456378","commenter_b":"Weather this is true or not I don't know,but one thing I do know is none of us would be in the water if we saw what was swimming around or beneath us!!!","commenter_a":"Hoax","post_message":"REAL OR HOAX? A video showing a great white shark circling a surfer has gone viral... but now, people are questioning its authenticity. What do YOU think? Is it real or is it a hoax?"},{"comment_id":"10153933179656509","commenter_b":"Lol see what I mean? \"White people do this all the time.\"","commenter_a":"Who could do such a thing? I don't want to hear that mental illness mess either. Lethal injection time.","post_message":"The suspect broke into the house and handcuffed the victims in their bedrooms -- and then shot them, authorities said. @webpagelink"},{"comment_id":"10158074030495206","commenter_b":"Take the appearance fee and go home","commenter_a":"Has she claimed racism yet?","post_message":"JUST IN:"},{"comment_id":"10153297983721336","commenter_b":"I lean liberal and I agree. Fine the companies that hire illegals. Tax all employees, legally here or not, the same. If their legal papers expire and they are still here deport them and fine the company a shitload","commenter_a":"The answer is real simple. Enforcement of employment laws. Fine, and, if necessary, arrest those who employ illegals. Along with jobs get rid of freebies. They won't stick around for long with no jobs and no freebies.","post_message":"\"I think up until now, you can say, 'well it's in the hands of the courts.' But at a certain point it's not going to be and you're going to have to answer.\" – Charles Krauthammer"},{"comment_id":"541637449341656","commenter_b":"Pls sign here here and here","commenter_a":"Wow, big shock. The state who elects the most insanely leftist politicians went for Trump. I wonder why. I can't wrap my head around it. Man, so bizarre.","post_message":""}]
