[{"comment_id":"10153524858391130","commenter_b":"I think the border should be closed to everyone until there is no violence in the USA! Or at least get it under control! There's gangs, rapist and terrorist roaming the streets! People under the fly alert were able to purchase guns yet half of American's aren't aloud to! Smh This government needs an overhaul, the system needs an overhaul!! People are homeless, going hungry and much more yet we still allow people in and they get free food, clothing and housing? Come on now!! This is suppose to be a place for dream's & opportunity!! USA has lost everything it built!!","commenter_a":"how is being again Islam racist ? it's a religion not a bloody race,,ban all organised religion,, there all fucking nutters","post_message":"Trump wants a \"total and complete shutdown of Muslims entering the United States.\""},{"comment_id":"10154538085533812","commenter_b":"\"You gotta take them out\"...... for dinner and a movie. Because Hillary, you see, she's a criminal. All my lawyer friends understand this. And we're gonna build that wall, believe it.","commenter_a":"He is such an idiot","post_message":"Donald J. Trump said that he would be open to using NATO forces to fight ISIS despite blasting the alliance in the past as \"obsolete.\""},{"comment_id":"1272162789512502","commenter_b":"She couldn't pay me enough, so I know Trump never tried. What a wrinkled up hag.","commenter_a":"They were all paid of course","post_message":"BREAKING! Newly leaked information shows Jessica Leads, who's accused Trump of raping her, has VERY CLOSE ties to Clinton Foundation.  This is NO COINCIDENCE! The timing of these accusations with these new facts about Leeds are TOO HARD TO IGNORE!!!!  Let's get 3,000 SHARES to spread the TRUTH about these rape accusations against Trump!"},{"comment_id":"10153996676511770","commenter_b":"Her hips are way way too big. She just looks out of proportion","commenter_a":"Fat and ugly wannabe!!! Hope she is going into psychiatry!","post_message":"Do her steamy Instagram photos cross the line?"},{"comment_id":"602527166571478","commenter_b":"Certain ppl should stop reproducing","commenter_a":"@username fuckin retard","post_message":"So Dumb: She Thought She Found A Hack To Charge Her Iphone!"},{"comment_id":"10153950585516491","commenter_b":"I really wish it had been 'Let the bodies hit the floor\" by Drowning Pool","commenter_a":"What this guy have to do with music? This show is a joke nothing to do with real music talent onlyma bunch of show offs","post_message":"Michael Phelps:  \"I might have a lot of gold but this guy’s got all the platinum.\""},{"comment_id":"875157552546363","commenter_b":"This is going to happen in every state these Illegas are in!!! Will there ever be a way to get them out of this country.. We need a great Wall of the United States just like the great wall of China!!","commenter_a":"who could have seen that coming? Not Obummer. He's got blinders on.","post_message":"Texas Man Murdered Execution-Style By An Illegal Immigrant Who Had Already Been Deported  @webpagelink"}]
