[{"comment_id":"10153245617818908","commenter_b":"So, let me get this straight, a man with his foreskin is unhygienic, but a woman with her parts all tucked away inside is hygienic? How does that logic make any sense? It's called basic hygiene practices. FYI, as men age (much older) their penis could fold inside of him and it will need pulled out to keep clean. This could be the issue your Family member was talking about. It's no different than when you wash your own genitals.","commenter_a":"I have 3 boys and all are circumcised. As a person that has family in the medical field it's for cleanliness when they get older. My mother worked in a nursing home and she has horror stories from having to bath uncircumcised men. It's gross not to be. Infection and bacterial growth is more common if the foreskin is still intact","post_message":"Why do Americans go out of their way to remove this part of human anatomy, when the rest of the world does not?"},{"comment_id":"10153852047087061","commenter_b":"Woman need to have concealed carry. Just too nasty out there now.","commenter_a":"Wtf!!!","post_message":"BRUTAL ATTACK: Police are looking for a man who walked up to a woman near a San Francisco park and began punching her in the face. Read more: @webpagelink"},{"comment_id":"10153222967261378","commenter_b":"Time for her to be shot in the face.","commenter_a":"Time for her to be released from her position.","post_message":"READY FOR MORE JAIL: Back at work and continuing to refuse same-sex marriage licenses, Kentucky clerk Kim Davis said she'll go back to jail again if that's what it comes to. Watch her tearful interview..."},{"comment_id":"10154116667236002","commenter_b":"If this is true (drowning and family defense) she and her family need to be removed from the gene pool","commenter_a":"If people witnessed her letting her children drown, why didn't they help them?","post_message":"The family of a Texas woman accused of allowing three of her children to drown in a swimming pool is defending her."},{"comment_id":"583797651802114","commenter_b":"Women Willing To Bern In Hell For Bernie Women Willing To Bern In Hell For Bernie sounds like a cult, kinda like Scientology.....","commenter_a":"The corporate owned media won't change their narrative about Clinton because for the most part, they are still run by straight, white males who must keep the myth alive that an ambitious woman is dangerous and there must be a negative reason behind her ambition.","post_message":"Let this sink in."},{"comment_id":"436426606545633","commenter_b":"Women are too smart for an old fish tale lol","commenter_a":"Good job, Mrs. Wifey","post_message":"This is great..."},{"comment_id":"10154088875521717","commenter_b":"Omg what a pig","commenter_a":"'@username read this, what an arsehole","post_message":"The student said she has never been more terrified of being outed than when Milo Yiannopoulos berated her on stage at a college event."}]
