[{"comment_id":"996496440403675","commenter_b":"She would take money from a baby for her own use","commenter_a":"The spineless Republican leaders arent getting the word out that Orlando was a terrorist killing in the name of Allah. The lying left has actually convinced their stupid followers the massacre is a \"gun problem\" rather than admitting this was a radical Islamic terrorist event. Our Country is in BIG trouble when we lose 49 innocent people, and the REAL problem has NOT been identified.","post_message":"CROOKED HILLARY CLINTON: FOR SALE!"},{"comment_id":"10154921930118690","commenter_b":"Karim Alyaa Dina","commenter_a":"Bal","post_message":"Integrating into a new country can be hard. That's why Horst Wenzel is teaching refugees the ins and outs of German dating culture."},{"comment_id":"10153130654836973","commenter_b":"Having read the Koran and the bible, it's clear that ISIS is justified by their faith. And so where the bigoted bakers, Faith is not an excuse to treat others poorly. You say murder is never okay yet both books are full of it. You are intolerant of both the bible and the Koran. Yet you somehow think a bigoted bakers faith is an excuse? That's a double standards","commenter_a":"The intolerance level for religion on this thread is too dang high! Get yourselves together. If you're going to claim \"BE TOLERANT\" to things, you gotta be tolerant to religion also. They will always exist. There will always be someone or some thing to worship or praise. Spirituality is a great thing. It brings positivity to people's lives. There's nothing wrong with that.","post_message":"But the story isn't as simple as nature versus religion, experts say."},{"comment_id":"10154255735864411","commenter_b":"It doesn't hurt to have sense of humour :)","commenter_a":"It's pretty stupid how media outlets are sharing such pathetic content. It's Obviously and clearly not a frikin time traveller. What's even more pathetic, is how the public seem so hooked onto such rubbish.","post_message":"'Time travel is real?'"},{"comment_id":"10153823756905671","commenter_b":"Probably no one in particular , some clubs are natural enemies to each other","commenter_a":"Wonder who he pissed off?","post_message":"A motorcyclist was shot dead on Interstate 80 near Truckee."},{"comment_id":"10154510747482446","commenter_b":"exactly wouldn't lower myself following that nasty woman.","commenter_a":"Hate mongering liberal degenerates that do what they normally do... Act like revolting pieces of trash that they ALL are","post_message":""},{"comment_id":"10153264086439342","commenter_b":"All you women bashing this woman are evil! Women are the quickest & most harsh to tear another female apart! Low life, heartless, evil women!","commenter_a":"The amount of alcohol that it would take for me to touch that would kill me...","post_message":"A Spring woman says she was sexually assaulted by a deputy during a traffic stop earlier this summer."}]
