[{"comment_id":"10153166262121336","commenter_b":"she can't stop lying","commenter_a":"If her lips are moving she is lying","post_message":"“All my grandparents, you know, came over here...\" – Hillary Clinton said on the campaign trail But Census records show that only one of Clinton’s grandparents was born outside of the U.S."},{"comment_id":"10153609828841051","commenter_b":"and where are these little bastards from ? shot there little asses down like the dogs they are and make there parents pay for this lady for the rest of her life and a huge settlement to her first.","commenter_a":"People are VENDICTIVE!!!! Mean...and must be CRAZY! What makes people want to do these things! We need an island , or send them to the Muslim area. There they will see what CRAZY IS!!!","post_message":"First these boys attacked an 87-year-old woman. Then they raped her. And then they poured bleach down her throat."},{"comment_id":"901769206549495","commenter_b":"Perhaps in fantasyland he's becoming a woman, but not down here where I spend my time - ON EARTH.","commenter_a":"Sorry Bruce, you're NOT becoming a woman - that's impossible. Your just taking hormones, and chopping your John-Thomas off.","post_message":"'Hey, guys, I'm becoming a woman' (Via Daily Mail Celebrity)"},{"comment_id":"10153563435706162","commenter_b":"This is some shady bull. Why was she even in jail in the first place? That I'm not understanding she was pulled over for not signaling a lane change? How did she even manage to be asked to get out of the car or get out of the car to assault an officer? I wouldn't have gotten out for that violation right me my ticket or let me go period point blank. I would be respectful but i wouldn't let them take advantage. She should have not been in jail in the first.","commenter_a":"Abc won't let this go. Must be a good day to hate on the police. Even though there is only evidence she killed her self.","post_message":"Her primary cause of death was \"hanging.\" Family and friends want to know what happened to a Naperville woman found dead in a jail cell, after she was pulled over for a traffic stop while on a road trip with her mom: @webpagelink"},{"comment_id":"10153341159307411","commenter_b":"It will happen. We've cowered to idiots. Time to be unpoloticaly correct. We Americans are fed up. Obama and bush did nothing. Hillary is evil. We need shorter sidewalks and taller fences. These people are evil.","commenter_a":"Those isis fools try and scare people with talk like KKK,Trump,and the Republican party,pay attention and listen it's all the same act.","post_message":"A group of ISIS supporters has threatened to take down Facebook and Twitter -- as well as their leaders."},{"comment_id":"10154352675806336","commenter_b":"Lets hope they nail her butt to the wall!!","commenter_a":"video of her saying she was shot at and then video that she was not shot still cannot convince these people she is a liar.","post_message":"Bret Baier: \"The State Department IG, though, wanted to talk to you and you didn’t want to do that.\" Hillary Clinton doubled down on claims that her personal email scandal will not hurt her presidential bid or result in an indictment. @webpagelink"},{"comment_id":"10155028093604826","commenter_b":"Use to be entertaining...fun .. a great time to get together with friends...now its just another political platform and a lot of disrespect in the name of freedom of speech. I will be exercising my freedom to not watch it","commenter_a":"Falcons but I won't be watching. Totally lost interest.","post_message":"Question of the Day: Who do you think will win the Super Bowl?"}]
