[{"comment_id":"10153226681651833","commenter_b":"Thanks Jason - the \"next one\" will probably effect me, though.","commenter_a":"I don't even own an AR, but I sent an e-mail to the ATF \"comments\" site opposing the ban on M855. I also sent e-mails to my congressman and both senators and signed a petition about the same issue. I suspect that the motivation is simply that the government doesn't want those who own ARs to have a source of reasonably priced ammo for their guns. I oppose this mindset.","post_message":"A notice from the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF) shows the agency is considering a ban on the popular M855 AR-15 round  by re-categorizing the round as  piercing.  Be sure to contact ATF and let them know you oppose this proposal. Then contact your members of Congress and express your opposition to ATF's ammo ban.  @webpagelink/ #M855"},{"comment_id":"668184586705453","commenter_b":"Yes ; has been, is, and always will be!!! She is truly an ugly American.","commenter_a":"Nice eyebrows, plucked clean and then painted on............banchee","post_message":"Michelle Obama wants to destroy Halloween for kids across America.  There is no chance that we will let her take Halloween away from our kids.  Do you think Michelle Obama is a joke?"},{"comment_id":"1626970717590041","commenter_b":"Just another dumb ass girl.","commenter_a":"Great job to a fellow veteran to set her straight. As a veteran we all lay our lives on the line and people like this little girl has no concept of what that means. It seems to me her family hasn't taught her or the school's she has gone to they need to wake up","post_message":"What an epic response by this Veteran!"},{"comment_id":"1306972999355460","commenter_b":"If they come after our guns we are so screwed...This is something we better not let them do...If ever we need to fight it will be when they do come for our guns....Wake up american's...That Muslim snake in the white house is out to get us and it looks like he will stop at nothing to destroy us and our country...","commenter_a":"Yes it will!","post_message":"“An armed citizen is nothing for me to worry about”"},{"comment_id":"10152607725262452","commenter_b":"How does he have signal?! Lol","commenter_a":"Meanwhile, we're all on our phones judging this man. Lol","post_message":"It's a sign of the times -- an Instagram photo shows a man missing a humpback whale surfacing just two feet away from him because he was glued to his cellphone. @webpagelink  (Photo via Instagram/Eric Smith)"},{"comment_id":"2053445024754213","commenter_b":"Just the opposite he carry a 3.95 GPA and has all he life. he Just married that MUSLIM pile of pig shit and was told by Obama you need to rebel.","commenter_a":"He probably doesn't know how to read or write.","post_message":""},{"comment_id":"426764770781451","commenter_b":"let the idiot walk home ! she does not deserve to be around others !","commenter_a":"Her Bus, Her Rules.","post_message":"This bus driver decided to teach a foul-mouthed teen some manners."}]
