[{"comment_id":"10155472723180603","commenter_b":"Girls what happen to being ladies?","commenter_a":"Inexcusable! They should all be expelled and forced to repeat the school year...","post_message":"\"'All these other girls started jumping off the table into the fight,\" said 10th grader Raejah Bratcher. \"Everybody started screaming and people were on each other's backs. Everybody was just fighting, people running in, getting hit, and running out. It was crazy.\""},{"comment_id":"793038077515812","commenter_b":"Omg yes","commenter_a":"@username we need this","post_message":"This is the perfect party game to play with your stupid friends: @webpagelink"},{"comment_id":"10157022006200725","commenter_b":"Crooked she is in everything!","commenter_a":"anything related to Hillary would Just get worse if she is in office","post_message":"Crooked Hillary just can't close the deal with Bernie. It will be the same way with ISIS, and China on trade, and Mexico at the border. Bad!"},{"comment_id":"10153188449234087","commenter_b":"Go to jail!","commenter_a":"You should have called it a sin. We readily forgive those, just not mistakes.","post_message":"\"That was a mistake. I’m sorry about that. I take responsibility, and I'm trying to be as transparent as I possibly can,” Hillary Clinton told ABC News's David Muir."},{"comment_id":"10152833310366051","commenter_b":"She prostituted herself out for the Republican party without thinking of the fall out from orally satisfying the president. He never did anything with her. He allowed her to get on her knees and prostrate and prostitute herself. She and the ugly woman with her ruined their own lives, not his.","commenter_a":"Good job Mr. Shanks. The worst part is that he carelessly wrecked the life of a young vibrant Monica Lewinsky. What a man! What a man! Jerk!","post_message":"The man who created Bill Clinton’s official portrait hid something in plain sight – and the Clintons aren’t happy about it."},{"comment_id":"10153660533997235","commenter_b":"She'll be fired for feminist ideology being expressed at FOX on air.","commenter_a":"Why is that \"news\"?","post_message":"In a rare lucid moment, Fox News' Andrea Tantaros NAILS IT."},{"comment_id":"504925023037210","commenter_b":"Geez. Is that OLD gal still around?","commenter_a":"She might find out how Hilter was if Hillary gets elected that your guns take away your health care tax away all your money distribute people money after the rich and powerful take most of it. OH MY GOODNESS THAY COMMUNISTISM","post_message":"According to the great celebrity-turned-philosopher Cher, Trump is now a genocidal murderer..."}]
