[{"comment_id":"1819660061616257","commenter_b":"Let me guess...She will be Secretary of Mental Health...F*cking Lunatic...","commenter_a":"OMFG","post_message":"WOW. We are officially an international embarrassment..."},{"comment_id":"10154651718054203","commenter_b":"@username So afraid of smart, strong women that it's pathetic. #madampresident Get used to it, prick.","commenter_a":"They're desparate at this point. Killary's ship is sinking fast, and when Trump smokes her on Monday it will seal the deal.","post_message":"Take a deep breath."},{"comment_id":"10153732172855575","commenter_b":"Hes a disgrace to the people who voted for him,, a disgrace to the GOP..WISCONSIN you need to send the rhino back to where he come form..","commenter_a":"Paul RyAn is a traitor plan and simple","post_message":"Report: Conservative Veteran may take on Paul Ryan"},{"comment_id":"10153580246221636","commenter_b":"Where we going? X","commenter_a":"@username when that degrees done, emigrate xx","post_message":"It's getting more and more expensive being a student"},{"comment_id":"10154312646744726","commenter_b":"For those confused about how an attack like the one in Orlando, Florida, could happen, I'll try to catch you up: Barack Obama's #1 goal has been to turn this nation into an Islamic wasteland. To that end, he appointed Hillary Clinton to be his dirty-dealing Secretary of State, in order to funnel military grade weapons to a then very inchoate ISIS. Hillary Clinton decided that it was appropriate for her to set up a fake Canadian charity, the Clinton Global Initiative, so that she could accept donations from dangerous nations, in return for personal political favors from the Secretary of State. This is the very definition of treason. However, Hillary didn't want anyone to have a paper trail of all her crooked dealings, so she set up a private email server in an attempt to thwart Freedom of Information Act requests. Barack Obama is now protecting Hillary, because he's ...","commenter_a":"It's truly disgusting and disturbing to use a massacre to push a political agenda. It was an Islamic terrorist attack now it's been used by democrats for an anti gun campaign, sickening.","post_message":"Liberals immediately urge gun control measures as terror link emerges in Orlando shooting"},{"comment_id":"10153119305979641","commenter_b":"Of course she did. She's corrupt as Hell. Let's elect her president.","commenter_a":"Good for her.","post_message":"Hillary Clinton deleted all emails from her personal server used for official secretary of state business, a Republican lawmaker says. @webpagelink"},{"comment_id":"10154297442132098","commenter_b":"Wow, that's crazy","commenter_a":"Mie Mie the mystery is solved","post_message":"CONDO FIRE: A massive fire broke out a Concord condominium this afternoon. Story: @webpagelink"}]
