[{"comment_id":"10154577788564726","commenter_b":"New York should have voted smarter.","commenter_a":"They are so crazy. Now I start feeling sorry for them.","post_message":"He's taking a queue from Obama's playbook..."},{"comment_id":"10154911182244714","commenter_b":"This lady is crazy","commenter_a":"Y'all just can't stop hating on a man that has the highest presidential approval rating since Reagan, can you? Higher, actually. If you can't say something nice, don't say anything at all.","post_message":"The First Family is heading west."},{"comment_id":"10157202420850354","commenter_b":"Pause for now....put them in his house","commenter_a":"You MUST be on the 'take', Ryan!! YOU CRIMINAL PIECE OF SHT!!! Get him OUT of there!","post_message":"\"That's not who we are,\" said Paul Ryan."},{"comment_id":"10153491983334087","commenter_b":"Look , she the cuase of all wars in Middle East , Voted for war in Irag ,war in Libya, war in Syria. She removed notorious terrorist group AKA \" MOJAHIDEEN \" out of terrorist list , so they can go to Syria . She is Republican","commenter_a":"Elizabeth Warren Sinks Clinton's Hopes for Endorsement @webpagelink","post_message":"“The difference between [Hillary Clinton] and Sanders is that she didn’t wait until the campaign to champion gun violence prevention,” said Dan Gross, president of the Brady Campaign to Prevent Gun Violence, which is endorsing Clinton in the presidential race."},{"comment_id":"10153228787618984","commenter_b":"Well he still did his job get unlicensed uninsured drivers off the streets. They are a huge reason insurance prices are so dam high. Besides Mexicans from across the boarder are becoming the majority especially in states like Arizona!! I'd vote for Sheriff Joe every day of the week and twice on Sunday.","commenter_a":"More LE needs to do that to rid America of the damn illegals","post_message":"I cannot believe he admitted this. Liberals will be giddy. He'll really need his supporters to step up now... Do you still support Sheriff Joe Arpaio?"},{"comment_id":"10153883162778145","commenter_b":"Illegals cannot vote","commenter_a":"she has a point nobody likes having to pay for others but more than 50% of US citizens are on government assistance and probably all of the illegals that's why the democrats keep trying to make it easier for felons and illegals to vote , you know they will vote for the party giving stuff away","post_message":"The profanity-laden video was uploaded to YouTube and has sparked headlines and heated discussions on social media. You can watch it here:"},{"comment_id":"10154931623678812","commenter_b":"Everytime i check most people that like trump are not from the United States like yourself from Australia you moron","commenter_a":"Trump is much more liked on all social media then Clinton the media is clearly lying with these polls","post_message":"Hillary Clinton has vaulted to a double-digit advantage in the inaugural ABC News 2016 election tracking poll, boosted by broad disapproval of Donald J. Trump on two controversial issues: His treatment of women and his reluctance to endorse the election’s legitimacy."}]
