[{"comment_id":"1730400360525702","commenter_b":"White people are gross","commenter_a":"God... trump is going to get us all killed.","post_message":"Hey, at least they're being honest about it. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154517988145329","commenter_b":"Stfu!!","commenter_a":"@username I found a picture of me when I wake up in the morning.","post_message":"??? (via So Relatable)"},{"comment_id":"496205537248565","commenter_b":"@username OK crazy lady, you might need some medication","commenter_a":"I'm a full supporter of Bernie but I'm guessing he is done?? If so I'll have to support Clinton. One I support Democrats. Two. Trump is a disgusting fraud who makes us look horrible. So if it comes down to Clinton and trump VOTE CLINTON!!!","post_message":"Thank you, Ohio."},{"comment_id":"1052630838137004","commenter_b":"This bitch know all the new snacks before they hit the streets bitch be snoring and dont even sleep","commenter_a":"@username thug life overload","post_message":"Oh No: Big Girl Back At It Again & This Time She Has Lil Terrio Rapping!"},{"comment_id":"10153199547146130","commenter_b":"Woman in front of the man is just perfect though.","commenter_a":"I noticed. I hated the woman behind the man. And her stupid hair cut.","post_message":"We can't believe we never noticed this before."},{"comment_id":"10153793456236336","commenter_b":"@username, actually I am quite the opposite. I believe that a 17 year old, is not a child anymore. I believe in raising kids to respect authority not defy it. I believe in order for people to succeed in this life, they need to learn to communicate appropriately and in the correct place. This punk did none of the above and she challenged because she thought she could control the authorities in the room. There was no brutality here at all and what the Officer did probably stopped the room from erupting in violence. Go watch @username's video and read the story. It may teach you something. Hopefully, this thug learned something from all she went through, but somehow I doubt it.","commenter_a":"I watched the entire video. You had a belligerent girl who refused to put away her cell phone. She was mouthy to the teacher, the principal and then the officer was called. He asked her nicely to obey. She refused to follow his orders even after being asked several times. He went to take her out of the chair, she hung on. He did not body slam her, as reported and actually she came out of the chair pretty easily. It just looked bad because the chair fell over. The officer was completely correct and the girl was completely wrong. They better clear this officer or they will be sending a very bad message and more kids or punks as the case may be, won't listen to their teachers either. Chaos will ensue in the classroom and order will be totally out the window.","post_message":"Do you think this is a case of excessive force or lack of respect for authority?"},{"comment_id":"563015167220109","commenter_b":"@username. You are Brain dead. Your mother must be so proud that she raised the village idiot. Sure glad you don't live here so we won't have to put up with your stench!!","commenter_a":"Did you hear that the Post Office just recalled their latest stamps? They had pictures of Antonin Scalia on them ... and people couldn't figure out which side to spit on.","post_message":"WOW... he went there!!!"}]
