[{"comment_id":"1730400360525702","commenter_b":"White people are gross","commenter_a":"God... trump is going to get us all killed.","post_message":"Hey, at least they're being honest about it. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1009017532480603","commenter_b":"Has this vile woman ever told the truth?","commenter_a":"Hillary For Prison 2016","post_message":"\"What difference does it make?\""},{"comment_id":"1770834126470122","commenter_b":"She can't fit those shoes","commenter_a":"Of course she's going to copy from one of the smartest, classiest 1st ladies we've ever had!","post_message":"Portions of Melania Trump's speech on Night 1 of the Republican National Convention bear striking similarities to Michelle Obama's speech at the 2008 Democratic National Convention."},{"comment_id":"1257260354293992","commenter_b":"You are illegal go away","commenter_a":"Oh yeah more guns to START shooting over the least thing or person ASSumed to be Muslim....................","post_message":"\"If more good people had concealed carry permits then we could end those Muslims before they walked in killing,\" Jerry Falwell Jr. said Friday."},{"comment_id":"1362948977061222","commenter_b":"@username oh look a grammar nazi, good burn lol","commenter_a":"First of all I know what it's like to work in a shop with just men. Men talk locker room talk. What you do think woman talk the same way! Shut the F up! It works both ways! Until you know what it's like to work in an all male job you can shut up!","post_message":"This rape survivor just took a powerful stand against Jeff Sessions."},{"comment_id":"10153405273244203","commenter_b":"@username those aren't feminists.","commenter_a":"What an absolute idiot! Feminism is the opposite of equality. Equality is equality, that's it.","post_message":"\"So to me, feminism is probably the most important movement that you could embrace, because it just basically another word for equality.\" Taylor Swift"},{"comment_id":"1615889428471180","commenter_b":"That'll put some die in her ass","commenter_a":"Oh,stfu. Take your crybaby ass to your favorite proctologylist and get a soothing ointment to rub on your buthurt","post_message":"This young woman was deeply offended by a sweater Target is selling. Should Target keep selling it anyway?"}]
