[{"comment_id":"541360652655195","commenter_b":"Muslims are buggering parasites that get alone with no one","commenter_a":"NO ONE FORCED THE MUSLIMS TO LOOK. THAT WAS THEIR MISTAKE. KEEP YOUR NOSE OUT OF OTHER POEPOLES BUSINESS.","post_message":"A pastor posted this controversial sign outside his church and it caused a huge stir in the community. His response to his critics was very simple."},{"comment_id":"649975575168534","commenter_b":"God Bless Heal Comfort Renew & Keep that poor innocent child...as 4 Them(Mr Swollen & Miss Crazy Lookin) ..Vengeance is Mine said the Lord!!!","commenter_a":"😡😡😡😡","post_message":"True tragedy. A 4-year-old was found beaten and zip tied to her bed. Not only that, she didn't know her own name and told police she thought it was 'Idiot'."},{"comment_id":"10154006195498984","commenter_b":"The witches on the view can't understand normal thinking!","commenter_a":"Moron","post_message":"Ouch. It has to be embarrassing for Whoopi to get set straight in front of her own fans like that. She was no match for Rand Paul. After one of Whoopi's famous rants, Rand Paul pointed out exactly what is so ridiculous and silly about her argument.  Do you agree with Rand Paul?"},{"comment_id":"10150659306454999","commenter_b":"@username ..her lips not legs","commenter_a":"She is right, raising your arms doesn't mean a lot. Her getting multiple corporate donations to sway the way she passes bills does. U.S. Senator Bernie Sanders pointing out that every other politician does the same thing, and he is attempting to change the precedent does. What a lame attack from Clinton. This just made my opinion of her lower, not raise.","post_message":"Hillary Clinton also said that the candidacy of Donald J. Trump was a \"bad development for our American political system.\""},{"comment_id":"549880968533529","commenter_b":"The ones who say they are refugees are young muslim men . I never see women or children in the pictures. This is what obummer wants to bring to America.","commenter_a":"It's funny how you people think all Muslims are bad, but I never heard you talk about all the Muslims in California who raised over 200k dollars for the victims of the San Bernardino shooting. Or what about the Muslims in Africa who protected Christians from getting shot on a bus.","post_message":"This makes me SICK!!!"},{"comment_id":"500239630100631","commenter_b":"Hopefully that little girl will hold a pillow over grandma bitches head later that night! Mean old bitch!","commenter_a":"What kind of monster does this ? I would kill the son of a bitch. Rot in hell !!!!","post_message":"This was too heartbreaking to watch all the way through. What kind of animal does this to a little child?"},{"comment_id":"1031910293529802","commenter_b":"Stick to what u know lady. Some people don't much care for foreigners telling us what US values are","commenter_a":"She's a citizen by a marriage not by birth,besides she is just repeating what she hears loony clooney says","post_message":"DAUGHTER OF SUNNI MUSLIM, George Clooney Wife, Open Borders Activist And British Citizen Says Trump Doesn't Represent \"U.S. Values\""}]
