[{"comment_id":"10154207452564916","commenter_b":"Ever hear of Independents? You know, 45% of the voters.","commenter_a":"And just where are all you threatening to leave the Dem party going to go? Good luck with that one.","post_message":""},{"comment_id":"10154594617592235","commenter_b":"Forgot this","commenter_a":"Typical conservative lack of knowledge. And yes, libertarians are conservatives. They are republicans. Believe me, they are republicans. Believe me. Republicans. Libertarians are republicans. Republicans. (Doing my best Trump impersonation, repeating myself over and over again. Repeating myself. Over and over. Believe me. Over and over)","post_message":"What the hell?  They announced victims right from the start."},{"comment_id":"10154482424522144","commenter_b":"White, \"christian\" males should be put in concentration camps as they have killed more Americans than muslims","commenter_a":"They don't fit his fantasy of a dystopian world???","post_message":"Actually, it's Trumpnot the mediawho's ignoring certain terror attacks. Guess why."},{"comment_id":"867849870028244","commenter_b":"I love this video! I can't stand the woman!","commenter_a":"Donald J. Trump should play, over and over, when she said, 'What difference does it make now?\" - regarding Benghazi. !!","post_message":""},{"comment_id":"992749454106935","commenter_b":"Truth be told and Trump will get to it publically soon: we're at war with Mexico. Take back southern AZ from the drug cartels. Put the military and night vision drones on the border along with the wall. No way will I go there either. And right on look at labels and BUY AMERICAN!","commenter_a":"Go Trump. Excellent rally. Gotta love truth and intelligence.","post_message":"Donald J. Trump spoke to thousands who braved the heat at a rally in Fountain Hills today. If you missed the event, you can watch it here: @webpagelink"},{"comment_id":"1134902403269479","commenter_b":"If they think it's so needed, why hasn't it been in place to stop rape before?","commenter_a":".","post_message":"Things just got seriously DANGEROUS for trans students in North Carolina..."},{"comment_id":"10155453199626729","commenter_b":"Illegal immigrants big issue here too, handing out drivers licenses that look identical doesn't help with the voter fraud issue we definitely have, but don't acknowledge.","commenter_a":"We have the same problem in Nevada. My guess would be 25% of the plates are Californian, maybe an exaggeration, but at least 10-15% are, and these aren't tourists because they're parked and driving out in our neighborhoods. These are just the ones that haven't bothered to register their cars here. Overwhelming people you talk to are Californians and most have come within the last 5-10 years. Majority of true Nevadans, natives and long time residents, are embarrassed by the color our state was on that election map. I wish the infestation would retreat to their looney state but it appears we've been overrun.","post_message":"So simple, a liberal could understand it"}]
