[{"comment_id":"10153233939551130","commenter_b":"Shame on you, damned sexist!","commenter_a":"\"Just to hold it in your hand\"... Yeah, that's not how tampons work >;)","post_message":"The best way to bring a tampon to the bathroom is just to hold it in your hand."},{"comment_id":"10153135572561323","commenter_b":"Pigs dirty cunt. Shut your mout bloody pig","commenter_a":"BBC News's journalist didn't have any story to write about Britain's own daughters? Those 1400 plus little girls who were repeatedly raped at the hands of Muslim grooming gangs for over a decade? Why couldn't she manage to that in her own filthy backyard which even produces terrorists who are raping and killing women in Syria & Iraq? Why did she feel that it was her duty to make a celebrity out of a rapist? Besides, the swines who are crying here for her are the same swines who objected to capital punishment for the rapist; who are now making money publishing stories of Nirbhaya. The pimps in Indian media who are talking about this are the same swines who objected to death penalty for the rapists. @webpagelink","post_message":"\"It was not rape, but my reaction was too involuntary, and its intensity too high, to say that nothing bad happened. Something happened. And it had the whiff of rape. I suspect many of you reading this will be eager to tell me what happened...\"  A challenging, deeply personal piece about why we need to talk about sexual assault in all its forms."},{"comment_id":"10154830329021830","commenter_b":"wow what shit if a celb said something worth hearing then ok fine but most are just fucked up losers that cry for attention","commenter_a":"Anthony Turner","post_message":"Ashton Kutcher Helps Reiterate Why Tomi Lahren & Co Are Full Of Shit"},{"comment_id":"10154156847317623","commenter_b":"This has got to be the dumbest comment I've heard in a while. You and the Cash Me Ousside chick should go hang out and play in traffic.","commenter_a":"Who puts a three month old into daycare??? Mom is so concerned etc. But that three month old needs his/her parents not daycare workers anyway. Plus no charges should be filed if daycare was not made aware of the lactose intolerance. Sounds like a lil neglect on both sides of this. Plus whoever took the video should have stopped this from even happening. This worker although breaking the rules was trying to help out a baby who is clearly already in duress when the parents should be the one taking care of them at such young age. I can almost bet that mother is more mad she had to take her kid to the hospital and missed out of her drinking time and watching tv time. Thats just my opinion!","post_message":"A North Carolina mom says a day care worker breastfed her 3-month-old son and made him sick."},{"comment_id":"10153885822754087","commenter_b":"Lmao.. She's a moron","commenter_a":"@username hysterical","post_message":"Hillary Clinton took things a bit too literally during a recent campaign stop when she read the word “sigh” off her TelePrompTer instead of actually doing one. WATCH:"},{"comment_id":"1711622465785020","commenter_b":"Let us take a look @ a hypothetical example? Every house in your neighborhood left all of their doors & windows wide open when they were home & when they went away. When they returned some had many people living in their home that refused to leave, use everything that they work years for. Took over the master bed room & some decided to kill their pets for religious reasons. Others kill neighbors as they walk home. The neighborhoods within 100 miles of your home became rapid with sex trafficking, drugs, gangs, shootings, suicide bombing, & more. Will U still leave your doors, windows wide open? Would U want better protection from unwelcome intruders? U may even ask for a gated community. So Y would anyone get upset about Trumps logic on protecting America. Build a wall, only let legal immigration through our front doors. Build a strong military & ...","commenter_a":"BELGIUM JUST ENDORSED TRUMP! #BRUSSELS #VOTETRUMP @webpagelink","post_message":"**BREAKING NEWS**  I agree!!"},{"comment_id":"773327109450736","commenter_b":"Sounds like she know how to have a good time.","commenter_a":"Billy Mills, Joshua Hill.. Here's an opponent for yall!","post_message":"Fighting a girl is a lose/lose proposition. @webpagelink"}]
