[{"comment_id":"1184927621535157","commenter_b":"Obama is an IDIOT! \"Yeah we have Muslim terrorist in this country so now take all the gun away from all the other CITIZENS!\" NO! IMPEACH THIS IDIOT!","commenter_a":"Now you watch yesterday's massacre was intentional. The went to Syria so guess what Obama you ass hole your climate control and gun control is bullshit. Prayers for the Families.","post_message":"Obama responds to the shooting by tightening gun control laws. This is unbelievable. Is Obama incompetent, or just intentionally trying to ruin America?"},{"comment_id":"1280674628621991","commenter_b":"@username yes she's the best of a bad lot","commenter_a":"Dump the Trump he just isn't Presidential Material","post_message":"If you think that a President Trump would be checked by Congress and \"couldn't really do that much harm\" you're totally wrong."},{"comment_id":"843343722394413","commenter_b":"You're wrong. Go in a mosque sometime you'll probably even walk out with your head still attached.","commenter_a":"If we behave in the same fashion as our enemies, we become our enemies.","post_message":"REVENGE: French Attack Mosques And Blow Up A Muslim Kebab Shop Looks like the French have had enough of the Muslims immigrants living there and are fighting back! @webpagelink"},{"comment_id":"1827830767485738","commenter_b":"No","commenter_a":"NFW","post_message":"Daily Live Poll: Do You Think Russian Backed Hackers Helped Donald J. Trump Win The Election?"},{"comment_id":"1179869992091535","commenter_b":"Lol yeah never thought about a lefty you ever try those net bags to catch spent casings I use them because we reload that should help","commenter_a":"First of all the guy was lying no way he shot it he said the casings flying in front of his face gave PTSD has anyone ever had a spent casing fly in front of them why shooting the AR not me lol so I doubt he even used one","post_message":""},{"comment_id":"10153344418725326","commenter_b":"Me too..they are owned by Time Warner her 7th largest donor!?!?!","commenter_a":"THE QUESTION IS THIS. DID CNN FEED HILLARY THE QUESTIONS IN ADVANCE. IF YOU LOOK AT HER BODY LANGUAGE AND LACK OF PONDERING THE QUESTION HER RESPONSES WERE CANNED. I FIRMLY BELIEVE CNN FED HER THE SCRIPT.","post_message":"Hillary Clinton was put on the defense Tuesday for her ties to Wall Street. While Sen. Bernie Sanders has been saying for years that the Wall Streets are contributing to the overwhelming income inequality in America. Ed gives Commentary. Don't forget to Subscribe to Ed's YouTube Channel at: goo.gl/ScLQVu"},{"comment_id":"10155578716975354","commenter_b":"Wouldn't it be nice if if \"christians\" practiced what they preach?","commenter_a":"Good on him, but you know he's gonna die soon.","post_message":"“I think this is the first time in history a leading Middle Eastern religious leader has embraced the forms of popular culture to advance the Christian message of love and hope,” WATCH THE VIDEO"}]
