[{"comment_id":"10153386538275326","commenter_b":"How is he going to run his hotels,if he reports all illegals??","commenter_a":"He mean kill them.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"990898310953409","commenter_b":"'Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you'","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas.  @webpagelink"},{"comment_id":"602469266610319","commenter_b":"Your 15 mins of fame is running out!","commenter_a":"She needs help, yes.","post_message":"Sarah Palin was just hit with a massive curve ball, she needs your help.  This is horrible, we love her. Let's show her we have her back.  Can we get 10,000 'LIKES' for Sarah Palin?"},{"comment_id":"743858605712748","commenter_b":"I know another PENNY ,and she is worth much more that as a friend !","commenter_a":"Good grief!! And people say pennies are worthless.","post_message":"Are they nuts?"},{"comment_id":"1013476458674427","commenter_b":"It was a lady Marine, she could have kicked his tear","commenter_a":"There are not enough words to describe what a worthless piece of crap this man is & idiots voted for him twice.","post_message":"I'm sure he's really proud of himself."},{"comment_id":"10153200452766051","commenter_b":"I do not agree with celebrating Columbus day or the fact that he slaughtered the American Indians, however, I was born in this country where we speak English. I've spent 12 years in the Army proudly serving my country against all enemies foreign and domestic. I am against anyone that threatens my country not diversity - I'm against the law that enables illegal immigrants having children in this country and said children being natural citizens.","commenter_a":"It's not racist, we speak English in AMERICA, if you want to speak Spanish then go to or go back to fucking Mexico","post_message":"When this IHOP customer heard what language a fellow customer was speaking in, she snapped."},{"comment_id":"853572084739045","commenter_b":"Lol! Wow!","commenter_a":"I agrees with the Judge! Come here by the proper channels! WTH","post_message":"Here's a breakdown of what the immigration ruling means."}]
