[{"comment_id":"1080515501999587","commenter_b":"Not going to stoop to your low, Rebio.","commenter_a":"Sounds like Rubio is gay. Wants to be in the bohemian group. Where all the rich billionaire and American leaders go and have a gay feast and worship something called mule. No woman are allowed.","post_message":"He went there..."},{"comment_id":"10153342829529170","commenter_b":"Then STOP Them, enough already!!!","commenter_a":"homegrown terrorist and a president that wants Americans Disarmed.......YEA, THAT'LL WORK!","post_message":"If you're a liberal claiming ISIS doesn't exist inside the US, Barack Obama's own FBI Director has a message for you...."},{"comment_id":"10153033840709071","commenter_b":"It's screwed up that you assume (be it probaly acurate) that we have not heard of Eritrea.. Why dont people know grography? It's alarming.","commenter_a":"People are leaving in droves so things are obviously not great, however western media outlets have always been incredibly harsh with regards to Eritrea. The ongoing refugee crisis is incredibly sad though. @username, thoughts?","post_message":"The worst regime you've never heard of."},{"comment_id":"10153322465354575","commenter_b":"That's no lady.","commenter_a":"F that lady","post_message":"A veterinarian posted this picture on Facebook with the caption: \"My first bow kill, lol. The only good feral tomcat is one with an arrow through it's head! Vet of the year award ... Gladly accepted.\" The cat was a family pet named Tiger, and now she could face charges."},{"comment_id":"10153097402831748","commenter_b":"Michael Savage you are an ignorant swine prejudice d Jewish imigrant not worthy of comment. You are inciting racial war!","commenter_a":"And you may as well be...oh hell-I can't think of anyone that I want to insult that badly. You are in your very own camp of What-the-hell??","post_message":"Michael Savage asserts \"[Obama] may as well be Charles Manson” for inciting racial tension in America."},{"comment_id":"10153929310543037","commenter_b":"Lesbians get their own series since they probably could beat the guys, @webpagelink","commenter_a":"This event is unfair....lesbians have a total advantage. ;-)","post_message":"The event will host 200 teams with 5,000 people."},{"comment_id":"10153513194301157","commenter_b":"Sorry kill traders Isis is out to kill innocent people that trader should lie down 6 feet under","commenter_a":"13 year veteran, can't trust anyone anymore!","post_message":"A Washington D.C. Metro Transit Police officer has been charged for trying to provide material support to ISIS."}]
