[{"comment_id":"1231979063521740","commenter_b":"OF COURSE IT WAS RANSOM!! AND NOW OBAMA HAS PUT THE AMERICAN TOURISM IN HARMS WAY HE IS THE VERY WORST THING THAT WE HAVE EVER HAD IN OUR WHITE HOUSE AND WE CAN'T WAIT FOR THEM TO GET OUT OF OUR WHITE HOUSE!!! HE HAS TRIED TO DESTROY AMERICA AND HAND IT OVER TO THE MUSLIMS AND THE ILLEGALS AND NOW THE TERRORIST !! LOOK AROUND YOU THEY ARE EVERYWHERE AND GROWING !!! YOU DEMOCRATS BETTER THINK ABOUT IT !!! TRUMP FOR PRESIDENT AND LETS WIN THIS TIME !! AND SAVE AMERICA AMEN","commenter_a":"Yeah right it was more like Money Laundering.","post_message":"“This was not ransom. Any suggestion that it had anything to do with ransom is absolutely and utterly false.” State Department spokesperson John Kirby defended a $400 million cash transfer to Iran during the release of U.S. hostages. @webpagelink"},{"comment_id":"10154064553747464","commenter_b":"Gaining delegates is part of how you win, especially in an open convention. He'd be crazy *not* to. It's something Trump is learning the hard way.","commenter_a":"Why use every edge known to man Cruz, just have a straight up best man with the most votes win's. You cheapened yourself pandering for delegates, it appeared slimey and desperate. Also why did you go to the border with Beck to hand out welcome boxes to ILLEGALS that were entering our country ILLEGALLY if you really believe in the wall and making already existing ILLEGALS leave this country????","post_message":"Join us on Monday for #CruzOnGMA!"},{"comment_id":"649071821906476","commenter_b":"THATS WRONG WITH THIS WORLD! Let her whipr children!","commenter_a":"Next time the boys won't be so lucky. Somebody just might get killed.","post_message":"Louisiana mother arrested after allegedly whipping her three children as punishment for breaking into a neighbor's home. \"I never could imagine that trying to be a good mother would end me up in jail.\""},{"comment_id":"390922764595794","commenter_b":"Amen","commenter_a":"Amen","post_message":""},{"comment_id":"1451058244908937","commenter_b":"Deport illegals!!","commenter_a":"Florida for Trump!","post_message":"LIVE Trump! DRAIN THE SWAMP FOLLOW US for Conservative news!---> Freedom Daily Donald J. Trump Donald Trump For President #maga"},{"comment_id":"10153068105811316","commenter_b":"That had to have been written by a 12 year old republican. Lol.","commenter_a":"hes telling the truth most dont want to hear","post_message":"Rapper: Caitlyn Jenner & MSM Promotion of Poor Values A Rebuke To God - @webpagelink"},{"comment_id":"10155045059411037","commenter_b":"NO!!!!!!!!!!!!!","commenter_a":"O come on!! Not her too!!!!","post_message":"Carrie Fisher died Tuesday, and Debbie has been distraught since Carrie's emergency on Friday."}]
