[{"comment_id":"1744978035715181","commenter_b":"Me too. She was sweet. I guess that's why she bit it.","commenter_a":"Kim, I thought you would appreciate this.","post_message":"AMC's the Walking Dead may soon be stumbling its way out of Georgia if the state's anti-LGBT bill is passed."},{"comment_id":"10153163966344255","commenter_b":"Where my confusion comes in is most people don't trust the government with their money but they will trust it with their children's lives....","commenter_a":"See fellow liberals? This is the fanatic pro-vaxxers showing their true face. Fascist totalitarianism. Hitler and Mengele would be proud of the folks signing this petition. These are not liberals. These are corporate thugs in disguise using liberal forums like @username to try to convince us that the pro-vax position is the smart, scientific , modern one and that vax-skeptics are a bunch of right wing anti-science fundamentalist boneheads. Its simply not the case. The real smart folk can see right thru this Big Lie that all vaccines are perfectly safe. They clearly are not. And most of us do not want to ban vaccines as they would have you believe. We just want safer vaccines, common sense, and for folks to see both sides of the scientific debate. And yes, vax fanatics, there IS a scientific debate.","post_message":"Public health must trump parental choice. Tell your governor to introduce legislation to ban all belief-based vaccination exemptions."},{"comment_id":"1243590202327674","commenter_b":"Hmmmm maybe we should stop any more Christians from coming to the US","commenter_a":"WTH is wrong with people!!!","post_message":"\"Nothing can describe the pain and sorrow of the remaining family members.\""},{"comment_id":"10153822220001162","commenter_b":"She needs to die a horrible death","commenter_a":"Her parents must be very proud of how their daughter turned out.","post_message":"BUSTED: The \"Baby Doll\" drug lord, Ana Marie Hernandez, is arrested in Mexico for allegedly running a cocaine pipeline to Chicago --> @webpagelink"},{"comment_id":"608238889333781","commenter_b":"They can leave this country","commenter_a":"Tell them to leave","post_message":"Texas Man Told Remove His American Flag Because It Was A ‘Threat To Muslims’. Let's show this patriot our support. Can we get 75,000 'LIKES' for his love of his country?"},{"comment_id":"1652752338307075","commenter_b":"Wow what a dumb bitch. She's also so stupid that she thinks all Muslims are from other countries. That's funny. Pretty sure my Muslim aunt was born and raised American and so are her children!","commenter_a":"LOL They must be Muslim, people are loosing their minds, they come to a western country, because they don't like there Muslim rules, now they want to change things hear. Can we petition to Ban all Muslims???? Maybe they are color blind!!!!!","post_message":"Students sign petition to ban the song \"White Christmas.\" This is how crazy political correctness is on campuses today!"},{"comment_id":"10153763080696350","commenter_b":"Of course he is being dismissed.. If he wasn't, there would be another riot. She needs her butt kicked out of school.. Very tired of this..","commenter_a":"This cop was so wrong with is action I am glad he was fired","post_message":"BREAKING: Sources say that the South Carolina deputy seen flipping a student in a classroom will be relieved of duty."}]
