[{"comment_id":"10154786755561438","commenter_b":"Fascist pigs.","commenter_a":"Just like China!","post_message":"All Interior Department Twitter accounts had been ordered shut after the inauguration."},{"comment_id":"10154177400546756","commenter_b":"I do not intend to vote for her in Any case. Her shady politics, her Attitude, the skewed way this contest has been run, and my basic gut reaction of Strong Dislike for her are nearly overwhelming enough but... This recent tack she has made Insisting that the Democratic party MUST Permanently Give Up on things like Universal Health Care, drug reform, campaign reform, college access, and essentially Everything that Really Matters to ME as a voter has Convinced me that I CANNOT - under Any Circumstances pledge My Vote for her. To do so would be to Agree with her disgusting defeatist position. The truth is, this is the Same reason I will not vote repugnican. And, while you may say my actions make it more likely a Rep. will win, I see no Real hope in a Hillary win Worth Voting FOR. Deal with it.","commenter_a":"So, for those who will not vote for Hillary Clinton if she becomes the democratic nominee, do you think it is possible that this will result in a GOP victory? Would that actually be better for the country?","post_message":"Hillary Clinton is projected as the winner of the Nevada Democratic caucus, according to AP. #NVcaucus"},{"comment_id":"1022904834453429","commenter_b":"@username TAKE YOU IGNORANT AGNOSTIC SELF AWAY....AND LEAVE THESE NICE PEOPLE ALONE ....TROLL!!!","commenter_a":"No. I don't think this God has anything to do with politics whatsoever. It's important to keep religion and politics seperate. Besides, this isnt even an important thing to be concerned about. There's a lot pressing matters to attend to than putting a God back into the government.","post_message":"SHARE IF YOU AGREE!"},{"comment_id":"10152881196379753","commenter_b":"So would you rather have the Transgender in the men's bathroom? Chances are SHE Is attracted to men. So would you like HER to go in there and check you guys out? Should lesbians have to use the men's bathroom then? Fucking. Ignorant","commenter_a":"Everyone should boycott planet fitness \" Political bullshit run foul again! Hope the woman sues there ass off.","post_message":"This woman thought she saw a man using the ladies locker room at her Planet Fitness. When she complained to the front desk, they responded by cancelling her membership.  Should transgender men who identify as women be allowed to use women's bathrooms/locker rooms?"},{"comment_id":"10153776818934255","commenter_b":"eliminate money...take their power...then its not \"too costly\" to protect the planet...and the creatures that inhabit it...its up to the people","commenter_a":"They were also in with Gov. Jeb Bush pushing education vouchers in Fl. that took money from public education.","post_message":"Unreal.  #DailyKosClassics"},{"comment_id":"10154930680644218","commenter_b":"Why doesn't all the TV news stop digging dirt and let it go. News and social media is half the problem. Start spreading positive news maybe people will do acts of kindness to make the news instead of following the negative.","commenter_a":"Imagine if a white guy said. He would be canned fast.","post_message":"A Baltimore County fire lieutenant is being criticized for remarks posted to social media after the election of Donald Trump. See what was posted >> @webpagelink"},{"comment_id":"1382199778464035","commenter_b":"Your a bitch","commenter_a":"I'm sure the First Sasquatch offered so much advice, what did she do...come to the defense of her brother Harambe?","post_message":"First Lady Obama took apart Trump, and just gave Republicans even more to worry about."}]
