[{"comment_id":"902087636648479","commenter_b":"She needs to pack it up and leave!","commenter_a":"Please take her off Facebook I cannot stand looking at her","post_message":"Whoopi Goldberg has done it time and time again. She really needs to learn her place. Do you think she's gone too far?"},{"comment_id":"1017722631617599","commenter_b":"@username, you and your daughters are throwing your votes in the TRASH then.......smh @username 2016","commenter_a":"I hope Bill & herself have plenty of room for the Syrian refugees, since She is so kind to the terrorist islamics. #Stupid to BRING THE ENEMY HOME!!! Utterly wrong. SHE HAS #LOST my Vote... and my two daughters Votes. #MARCORUBIO will be my choice now.","post_message":"We cannot allow terrorists to intimidate us into abandoning our values. Turning away orphans, applying a religious test, discriminating against Muslims, slamming the door on every Syrian refugee—that is just not who we are. We are better than that."},{"comment_id":"10153784232529255","commenter_b":"Money. Sickening greed. If taxes were confiscatory for the top rates, we'd have less of this.","commenter_a":"Do these companies that are selling...like a pharmaceutical or National Geographic not know WHO they are selling to or even care?","post_message":"RIP From Daily Kos user Eyesbright"},{"comment_id":"10152718223821051","commenter_b":"Shut up cunt","commenter_a":"this can not be","post_message":"Darren Wilson is about to get sucked back into the Michael Brown shooting case."},{"comment_id":"10154047559291770","commenter_b":"Jail her","commenter_a":"hope they CHARGE HER","post_message":"Muslim woman lied about subway attack by Donald Trump supporters."},{"comment_id":"10154934744787403","commenter_b":"@username sorry to disappoint but I'm all for Trump kicking all you Mexicans out of the country 😂😂😂😂😂","commenter_a":"Hypocrite","post_message":"BREAKING NEWS: President Donald Trump plans to suspend visas to seven Muslim-majority countries, draft order shows."},{"comment_id":"902999723068783","commenter_b":"The ones he just released did return to the battlefield and for a traitor that is a fact ! Stop with Bush,","commenter_a":"Impeach him now ! Sending prisoners to the battle field is treason !","post_message":"The WORST!"}]
