[{"comment_id":"1265448890160011","commenter_b":"Dana, what if it's you who's the bitch and not Hillary?","commenter_a":"There isn't a nail in the coffin. At this point in time either you see her for the corrupt lying bitch that she is and refuse to vote for her or you vote for her in spite of it. No one can say she's not a corrupt liar. Either you admit she is and you're voting for her anyway or you are not. The table is set. The pieces are moving.","post_message":"JUST IN!"},{"comment_id":"10153677360299641","commenter_b":"She is worth more than all of Isis put together.","commenter_a":"Mary Knoll","post_message":"This is Diesel. She is a 7-year-old police dog French police say was killed in the raid today.  Here's what we know about the raid so far: @webpagelink"},{"comment_id":"1765146687072705","commenter_b":"Do it dools ya pussy","commenter_a":"Dooley Whitton","post_message":"What you need to know about Flakkathe alleged drug used by an FSU student who fatally stabbed a couple."},{"comment_id":"10153087486466162","commenter_b":"She is hot","commenter_a":"Sicko","post_message":"STUDENT SAYS THEY HAD SEX AGAIN: A high school teacher charged with having sex with several students is back in jail after one student claimed that they continued to have sex while she was free on bail @webpagelink"},{"comment_id":"10153569563806051","commenter_b":"They should be sent back where they came from ASAP !!! End of that story !!!","commenter_a":"Please do some research. What does your state actually offer in the way of public assistance to noncitizens? In California noncitizens are not eligible to cash assistance or Calfresh (foodstamps). No Social Security or Medicare without legal residency. So just what are you haters talking about? I hope none of you ever find yourselves in a financial situation which would drive you away from your home in order to survive. I hope you don't call yourself \"Christians\" because you are so far from the core of that belief.","post_message":"Should illegal immigrants be banned from receiving Obamacare subsidies? That was far from the case in 2015."},{"comment_id":"10154450153734411","commenter_b":"@username Is there a government on this planet that is not - up to no good - ?","commenter_a":"Why are they bombing their own airport... ISIS Turks are weird","post_message":"BREAKING - #ATATURK #BLASTS:  - at least 50 dead - about 60 wounded - 2 explosions"},{"comment_id":"842653202518126","commenter_b":"Let them go to hell","commenter_a":"Bunch of Stinky Asses","post_message":"In Obamaland... Islam rules. @webpagelink"}]
