[{"comment_id":"716079211915990","commenter_b":"Shirley you. Ignorant bitch","commenter_a":"How many mof these post DO WE HAVE TO SEE BEFORE IT IS DONE???? IMPEACH NOW!!","post_message":"House GOP is officially voting on the impeachment of Obama. Let's push this through. Please let this pass. Can we get 75,000 'LIKES' to have Obama impeached?"},{"comment_id":"10154216444386350","commenter_b":"She should have been left the freak!!!","commenter_a":"After 30+ years of cheating and drugs nowwww she finds her inner strength?","post_message":"\"It right for me, because I honestly, at this point today, have no idea what I doing with the rest of my life.\""},{"comment_id":"10152816643679877","commenter_b":"She don't need to she's not Muslim","commenter_a":"They would criticize her either way. If she wore it, they would be hollering about how she supports terrorists, then the ignorant right wing tea party types would link it to Obama being a Muslim.","post_message":"Oh boy, they're coming for Michelle Obama for not wearing a headscarf in Saudi Arabia. Read more about her critics below. Grio fam, this seems foul to us. What do you think?"},{"comment_id":"1766049700310185","commenter_b":"She better look deeply into Muslim beliefs and get used to sexual assaults because these heathens think it's their right","commenter_a":"The White House is warning Trump not to retaliate against her. Is that a red line? They going to write a mean letter to him if he does?","post_message":"Right after Michelle Obama took the stage and launched an attack on Donald J. Trump that sent the media into a frenzy, the White House delivered a message to the Republican candidate that did NOT go unnoticed..."},{"comment_id":"10153256342071336","commenter_b":"Thank you.","commenter_a":"Good! He deserves it!","post_message":"Breaking News: Jury sentences convicted Boston Marathon bomber Dzhokhar Tsarnaev to death."},{"comment_id":"1098675453532382","commenter_b":"I don't need to see his return. But I do need to see killarys medical records. She's a wack a doo","commenter_a":"Go Trump 2016","post_message":"WATCH LIVE: Donald J. Trump addresses police shootings, claims America needs a 'national anti-crime agenda.'"},{"comment_id":"912506822117747","commenter_b":"Grow up racist","commenter_a":"Thanks Fox, again you nailed it..","post_message":"Just when you thought #FoxNews couldn't get any crazier... @webpagelink From (Y) Counter Current News - MBD"}]
