[{"comment_id":"672451282894291","commenter_b":"@username The trump wall is ! I want mexico to build it ! If you arent part of the solution you are the problem .","commenter_a":"When a unstopable force meets a unimpregranable wall It is time to vote for Trump ! Hope I spelled that right libs and spell check police !","post_message":"Donald J. Trump said he didn't call Ted Cruz 'Lyin' Ted' in his New York victory speech because \"I thought it would be very undignified for me to get up at that particular moment with ... pretty much the world watching.\""},{"comment_id":"10153929141081800","commenter_b":"he's one of the worst lol best...wtf","commenter_a":"Who cares how Obama grew up?!? He's the best president we've had, he's very intelligent, he's done an amazing job considering the racism and obstructionism from the republicans. Carson is mentally challenged and there's something seriously wrong with him. Stop focusing on color and start looking at ability and integrity. Obama towers over Carson in every way.","post_message":"Dr. Ben Carson accuses President Barack Obama of never living the black experience. ►Watch last night's full episode: @webpagelink"},{"comment_id":"1245235738872618","commenter_b":"Shes definitely got bigger balls than you lady.","commenter_a":"God how can anybody not believe Michelle is a man? Look at his face in this pic, my god.","post_message":"\"Everyone was in tears...\""},{"comment_id":"10153104489209726","commenter_b":"Bring it bitch","commenter_a":"Think again ! Governors and sheriffs need to lead the people and fight federal corruption and over reach !","post_message":"WATCH: Eric Holder On ISIS: 'I Think We're Winning'"},{"comment_id":"1346838938665097","commenter_b":"@username the fact is that a male will never transform himself into a female. FACT!!","commenter_a":"For people who don't understand, it is not just restrooms, but women's locker rooms and showers and dressing rooms. This is not right. This is not just a trans thing, but will allow men to go into confined areas where women are very vulnerable. So, how would you feel if your grandmother, mom, daughter, sister, aunt, etc. to shower with a man next to you with only a flimsy curtain? We here in NC will stand strong. I hope our governor will continue to fight for women's safety.","post_message":"The solution here might be that the North Carolina governor could say that we don't identify as North Carolina anymore, and therefore your lawsuit against us is irrelevant."},{"comment_id":"10153028935676130","commenter_b":"You should, Chris. If you think that's ridiculous, I hope you never have a daughter and have to see her treated like sh*t by some guy who doesn't keep in mind that she's someone's daughter.","commenter_a":"The relationship dynamics between a husband and wife are a lot different than between a father and daughter. Why would a man necessarily care if his daughter is nurturing?","post_message":"Spoiler alert: It's super depressing."},{"comment_id":"10153245787992507","commenter_b":"I never liked that women .","commenter_a":"She is Just not a good person ......","post_message":"Ann Coulter brought knives to a gun fight on The View."}]
