[{"comment_id":"10153901332209411","commenter_b":"Russians shout their own feet. We do not export our high quailty fruit and veggies anymore. Go and import from china the plastic one !","commenter_a":"We have banned all Turkish produce on our global operations since last week...and will never have any trade relations with that country. May it be Diplomatic or Corporate! For as long as it's erdogan's administration.","post_message":""},{"comment_id":"10154489632511051","commenter_b":"True, LOCK HER UP !","commenter_a":"agree'","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"},{"comment_id":"10153773357374877","commenter_b":"WTF... Where I live... White people be blasting they music so cut the crap!","commenter_a":"Ugh","post_message":"Driving While Black: Cops drag black man from his car and Taser him for playing loud music.   Grio fam, this is wild!"},{"comment_id":"979803835419705","commenter_b":"Dumb shit hoes do for niggas","commenter_a":"Looonngggg liiiive the kinggggg🦁","post_message":"The Struggle: His Mom Came Home Early So She Had To Jump Out The Window!"},{"comment_id":"1750985641784496","commenter_b":"What that is the craziest thing I have ever heard he's not racist just because he wants to build a wall and stop Muslims from coming into the country until we have a better way of verifying documents he said nothing about that","commenter_a":"are you kidding me. assama has set this country back 50 years","post_message":"Democratic leader says Donald Trump will bring back segregation.  Is he being this obtuse on purpose, or does he really believe this? #TTT16"},{"comment_id":"10154767711621729","commenter_b":"There is a possibility that he wont be Trumps VP ,....because he is considering the VP job with Hilary....just saying","commenter_a":"don't wanthe little bitch","post_message":"Never say never?"},{"comment_id":"1136953183031095","commenter_b":"I can guarentee she will have a fitness dvd out soon, watch this space. All these reality stars have horrible pics taken of them on the beach then get fit n do dvdds xx","commenter_a":"A well cut swimsuit would be far more flattering, although not much one can do with cellulite - ugh.","post_message":"The Only Way is Essex star soaking up those wintry rays ☀"}]
