[{"comment_id":"1079285898761124","commenter_b":"No woman with an ounce of self respect would vote for a misogynist like Trump.","commenter_a":"Good way to clean out those we don't need in America. Just one more reason for Trump to win","post_message":"A majority of people said they would go to Mexico."},{"comment_id":"10152743535041973","commenter_b":"Women don't wreck things? You should've seen what my first wife did to the cable box!","commenter_a":"Sounds like teenagers at play.","post_message":"Eleven large boulders had been dug out of a steep bank below the trail and pushed down an embankment creating unstable soil, which is vulnerable to erosion from winter rains."},{"comment_id":"467807840076463","commenter_b":"IDIOT ! LEAVE !!","commenter_a":"Yes, DEFINITELY","post_message":"Should Muslims Who Don't Like Christian Holidays Leave America?  Comment 'yes' or 'no'."},{"comment_id":"955814454527001","commenter_b":"He involves himself into everything other than the priests who get their heads c*** off so called refugees .","commenter_a":"lmao the fact that this is an actual problem and a topic taken up by the pope, speaks volumes about the state of the humans! arent we suppose to be the most intelligent species...i mean we aren't animals that can change genders at will or to reproduce...","post_message":"\"Today, in schools they are teaching this to children -- to children! -- that everyone can choose their gender.\""},{"comment_id":"667824530017395","commenter_b":"THROW them out of the country after incarceration. This disgusting behaviour does NOT belong here","commenter_a":"Yet no justice for the douggler girls.......","post_message":"GROSS."},{"comment_id":"10154522868449087","commenter_b":"Fuck this old communist bastard!!!!","commenter_a":"Your anti Muslim propaganda does that! Trump is anti Radical Islamic Jihadists! Got a problem?","post_message":"Bernie Sanders: \"Trump's anti-Muslim order plays into the hands of fanatics wishing to harm America. Love and compassion trump hatred and intolerance.\""},{"comment_id":"10154491854776002","commenter_b":"Yeah, she's a great mother!?!? Ha. Get those poor kids away from her immediately; lock her away with the scum husband.","commenter_a":"Seriously-not only her but her husband has committed the same crime-hurting thousands of others-stealing money from the government and she wants a break?!!!!!!","post_message":"Washington is asking the judge for a massive break. The judge ordered her to serve four years in prison, but she is asking not to go to turn herself in for five years so she can stay home with the kids while their father serves his time for the same crime."}]
