[{"comment_id":"10153986549963132","commenter_b":"stupid bs, she feels fat and ugly.grow up kim.","commenter_a":"Oh please. She acts like she is the only woman that has ever had problems while Pregnant.","post_message":"Kim Kardashian West is opening up about what could potentially be a very scary delivery."},{"comment_id":"10153200811382377","commenter_b":"I'll agree with you on that , but it still doesn't change my position on accepting unvetted refugees !","commenter_a":"So he just declared the Obama administration a terrorist group then !!","post_message":"British Prime Minister David Cameron: \"The Muslim Brotherhood is not the only movement that promotes values which appear intolerant of equality and freedom of faith and belief.\""},{"comment_id":"1420083668051377","commenter_b":"Oh shes a female.. whoops","commenter_a":"Muslims r like a football team. The radicals /terrorist r the strikers. The extremists r the midfielders who feed the radicals. The defenders r the moderate Muslims who create diversions, deflect, defend and save Islam from legitimate criticisms n any accusations. They work as a team though they create the perception that the defenders have nothing to do with the strikers. The Liberals r the goalies who jump in when the situation gets worse with statements like Islam is a religion of peace @ De Joe Int'l ur comment had to be repeated.","post_message":"'We march through the night to cut and behead... Allahu Akbar'"},{"comment_id":"10153987502144087","commenter_b":"Hillary is by no means a \"girl\". She's an old mentally disturbed hag.","commenter_a":"Wait, Hillary's a girl?","post_message":"Elizabeth Warren: \"[Donald Trump] makes death threats because he's a pathetic coward who can’t handle the fact that he’s losing to a girl.\""},{"comment_id":"421728768009004","commenter_b":"Burn her as a witch","commenter_a":"So intelligent, and powerful women","post_message":"Share if you're Ready For Hillary!  Get all the best HRC coverage you need here:  @webpagelink"},{"comment_id":"10152977675812690","commenter_b":"Cool...but can't we all agree that there are quite a few ILLEGAL immigrants that do NOT speak English?? I'm not talking about immigrants I'm talking about the ones who are here ILLEGALY!!","commenter_a":"But it is also illegal! Just do it right! Learn the language, support yourself and do it LEGALLY!!! Legally!! That is all!","post_message":"WATCH LIVE: Dual rallies have taken over downtown Dallas Friday evening, forcing several businesses to close early: @webpagelink Photos of the protests: @webpagelink"},{"comment_id":"10152606580602434","commenter_b":"The \"greedy bitch\" is a man.","commenter_a":"Getting married doesn't automatically entitle you to gifts or money, your guests will give what they can, if they can but surely their attendance is more important than receiving things from them? This is the most jacked up article I've read in a long time, far too much misdirected vitriol. Hope this greedy bitch gets nothing! Equating the whole situation of gift/money giving to 'living in sin' is so ridiculous and the amount of times people are directly cursed out is excessive. If you wanted to express your opinion so badly, you should have learned how to write first. Bridezilla!","post_message":"These people often fall in the same group as elitist jerks who think getting a dress from David's Bridal is \"tacky.\""}]
