[{"comment_id":"10154471840033433","commenter_b":"John Mossman well then he took one for the team when he helped conceive his daughters.","commenter_a":"Worst Muslim eva. Eating bacon on a non zabihah beef burger, drinking beer, smoking, wearing shorts, not observing Ramadan...","post_message":"Pants on Fire for town hall audience member: \"You know our current president is (Muslim). You know he's not even an American.\""},{"comment_id":"1640586052910285","commenter_b":"Close them.Then make it tough to come to America.Its to DAMN easy now,,that's why were lousy with illegals.","commenter_a":"NO!","post_message":"Senator Tom Cotton just introduced Trump's immigration proposal through the Senate! Sign the petition SUPPORTING the bill HERE: @webpagelink"},{"comment_id":"495211413960969","commenter_b":"What a f****n punk","commenter_a":"He is a psychopath I assume.","post_message":"As for killing Trayvon, he said, \"I believe God has his plans\" F*ck this guy. -Linda"},{"comment_id":"10154362784109062","commenter_b":"❤️","commenter_a":"Praying for the family...","post_message":"A heartbreaking loss for a family after a 14-year-old boy collapsed and died after school in Cleveland, Texas. Hear from the mother about how the teen is being remembered on KHOU 11 News at 6."},{"comment_id":"1003038786410224","commenter_b":"Boycott George Clooney!","commenter_a":"Doesn't he still support Clinton?","post_message":"George Clooney is right: the powerful influence of money in politics is obscene, and it is my belief that you cannot do away with big money in politics if your campaign is funded by big money."},{"comment_id":"881915648510562","commenter_b":"Bitch you wanna get arrested????","commenter_a":"@username we talked about this as well","post_message":"The dark history of why cocaine is illegal... (ATTN: is excited to launch a new series about the history of illegal drugs)."},{"comment_id":"10157534463145354","commenter_b":"Ass holes","commenter_a":"Tell the Lebanese to get the F off","post_message":"Antisemitism mars Rio Olympics... “The 2016 Olympics – a disgrace!!”"}]
