[{"comment_id":"1134360159938174","commenter_b":"My comment here is in no way an attack on this guy. The reality is that he's working an entry level / minimum wage job so that's why he makes minimum-wage. I'm a disabled Marine Corps veteran myself and I spent four years in school so that I could earn enough money to support my family and give them a better life. For those that say that maybe he doesn't have the aptitude to go to college, there are trade schools out there that he would be more than qualified to go to. When fast food workers start making $15 an hour then entry-level welders need to be making $25 an hour and those that are currently making $25 an hour will then need to make $35 an hour and so on and so forth.","commenter_a":"This man risked all he had for this country, got wounded but continued to serve his country and now he gets $7.50/hour and cannot afford to support his family!!! :( While Mr. Cheney does not step his foot on the battlefield once, and his Halliburton makes nearly $40 billion dollars from the Iraq war!!!!!!!!!!!!!!!!!!!!!!!!! How can this country allow such extremely disproportionate treatment of its citizens???? I think the living wage is around $27 to $30 dollars/hour and that's what the veterans deserve....","post_message":"He fought in Iraq, but back home, he's struggling to get by. Fight for $15 advocates that everyone be paid a decent wage."},{"comment_id":"10152977390881130","commenter_b":"#fatgirlwasted","commenter_a":"@username YASSSSSS!","post_message":"Stoners, rejoice!"},{"comment_id":"10154230829439877","commenter_b":"@username that's horrible Florida teachers do get raises the website says the pay is negotiable but I only co-teach so my salary is non negotiable. I suppose it depends on what one perceives as good pay the teacher I work with gets grants and other stipends but she also buys many things. My aunt who's taught for about 11 years in Arkansas buys many items but keeps her recipient for discounts and tax write offs I imagine you don't get nearly back what is put in. I subbed for a little over a year and I found myself buying many items I didn't care to file on my taxes even though the district gives you that option. I understand","commenter_a":"I've worked at many schools many of them teach our babies and cannot stand them this is a fact. I will add I chose my profession after having my well behaved straight A children repeatedly coming home telling me their teacher was mean or did not appreciate their good behavior and Good citizenship. So I began to substitute and get an inside view. 68 job assignments later I saw many teachers that were jaded not just by the lack of parental involvement but by the lack of pay. I think more parents should better discipline and I also believe teachers lacked empathy and understanding. I will add prejudices and biases had a part as well. I really noticed it at mostly white schools that had few Hispanic students and it is truly heart breaking. Therefore, I am pursuing my teaching certification with everything in me to become the/an advocate for ...","post_message":"Who are we allowing to teach our babies?"},{"comment_id":"10155254792200354","commenter_b":"Which college did she attend? Was a waste of money.","commenter_a":"We don't need Work Place Violence. They need OUT of U.S.","post_message":"She actually stands by her statement that ISIS terrorists just need...job opportunities. Watch the insane VIDEO below."},{"comment_id":"1687479528205826","commenter_b":"You can come to America if you do it legally if you want to go over the wall if there was a wall yes shoot to kill. That will be a deterrent to stop other illegals from trying to do it.","commenter_a":"Yes and shoot to kill anyone crossing from Mexico to the USA","post_message":"Yes, I do!"},{"comment_id":"981667418562042","commenter_b":"CNN commies hiding the truth and denighing the facts.","commenter_a":"Lemon is such a a a I can't find an insulting enough word. Help!","post_message":"VIDEO: CNN Instantly Ends Segment When Pro-Trump Latina Says This About Donald @webpagelink"},{"comment_id":"586386844881451","commenter_b":"This woman DOES NOT love America!","commenter_a":"YOUR A LIAR !!!","post_message":"\"My vision for America is an America where everyone has a place. This is the America that I know and love.\" —Hillary"}]
