[{"comment_id":"649308955259683","commenter_b":"Stfu you stupid bitch.","commenter_a":"Gifts from the illegals","post_message":"A new disease is spreading like wildfire, doctors calling it the new aids.  Share this with your friends and family.  Have you seen these symptoms?"},{"comment_id":"683847751805803","commenter_b":"WTF!!! Enough of the PC climate in today's world! We celebrate American holidays in AMERICA! If the illegal immigrants want to be celebrated they should NOT break our LAWS and just STAY the hell in their own country!","commenter_a":"will not!!!!!!!","post_message":"Obama has created his own 'Holiday' and is forcing it upon American citizens.  We will stick to our own holidays thank you very much.  Will you refuse to celebrate Obama's made up holiday?"},{"comment_id":"10153237393021350","commenter_b":"Great idea but this lady ain't fat...","commenter_a":"You look fantastic!!","post_message":"This mom has become a swimsuit role model."},{"comment_id":"10154363261003816","commenter_b":"Pack your bags libs, because the wall is going up.","commenter_a":"If you're to dumb to get an ID you don't deserve to vote","post_message":"In testimony and filings in the case, the plaintiffs said that blacks and Latinos make up 44% of those seeking a free ID to ensure they can vote but only 9% of the overall voting age population in Wisconsin."},{"comment_id":"865380196838555","commenter_b":"You're a dumb b****.","commenter_a":"Islamists stand together...if he were to admit islamism, he might be called an apostate.","post_message":"There’s a far bigger issue involved here than going to the anti-terror march in Paris on Sunday. That is Obama’s persistent refusal to identify the enemy as what it really is: Islamic terrorism. It’s pathetic to see the contortions our president and various administration officials and spokesmen go through to avoid using the word “Islam” when talking about the people who are waging war on the West. @webpagelink"},{"comment_id":"10153352212341162","commenter_b":"So, Michael 'TheArtist' Louis, what you're saying is- the young man in the meme isn't 'black' enough for you? That only people who subscribe to the stereotypical depiction of how black people dress and behave are 'real' black people? If that's not racist against African Americans, I don't know what is... Smh. And isn't the point of ending racism getting AWAY from stereotyping based on the color of a person's skin? The funny thing is, the meme maker -who is presumably black based on what the meme says- is *trying to* say that white people are racist, when in reality - they have such deeply rooted issues of their own that they didn't even realize their meme was racist against themselves. Start with yourself...","commenter_a":"Looks like she for sent home for having a black date nothing's wrong with her dress","post_message":"TOO REVEALING? A girl was sent home from prom because school officials thought her dress showed too much skin. What do you think?   PHOTOS: @webpagelink"},{"comment_id":"897157403654934","commenter_b":"she gave her all, wasnt a armchair quarterback","commenter_a":"She did it great","post_message":"“It took heart, guts, determination, falling down and getting up, and a little motivation from the crowd to get across the finish line.   Check this out.”"}]
