[{"comment_id":"952565694839683","commenter_b":"There's. room for one more clown in the car.","commenter_a":"The clown car is getting full!","post_message":"Another hat in the ring?"},{"comment_id":"10153556310231336","commenter_b":"dumb racist pos","commenter_a":"Dumb niggas","post_message":"After waiting about 20 minutes while the women talked, U.S. Senator Bernie Sanders was pushed away again when he tried to take the microphone back."},{"comment_id":"653257648132607","commenter_b":"I agree. Fuck Kim Kardashian! She is trash.","commenter_a":"So a woman who's apparently famous for releasing a sex tape of her getting pissed on gets robbed of 10 million dollars worth of jewellery. Who the Fuck cares.?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1560174614269652","commenter_b":"They are both disgusting women!!!! Never watched the show!!","commenter_a":"Rosie has to be one of the Most grating obnoxious people on the planet.","post_message":"I love ABC for doing what's RIGHT!   Rosie O'Donnell & Whoopi Goldberg have no place on TV."},{"comment_id":"10156349571840354","commenter_b":"Racist illegals","commenter_a":"We deport your sorry ass, illegal!","post_message":"Brace yourselves.  Amnesty activists just launched a VIDEO that EVERY American should WATCH..."},{"comment_id":"877412165685172","commenter_b":"As long as you're legal. Either way, hard work or not your family broke the law so you're criminals. It's the truth. The country is better off without illegals.","commenter_a":"Please please all illegals and Mexicans and Mexican-Americans keep posting your stories. We need to show Trump and his ignorant followers the truth!!! Post your stories. Post your families stories. Flood the Internet and Facebook with the truth of why people of every nationality and every nation come to America!!! Make it known and state the facts and truth!!!!!! Bring ignorance to its knees.","post_message":"She really nailed 'The Donald!'"},{"comment_id":"10153427375089726","commenter_b":"this brain dead old witch needs to be in a mental ward","commenter_a":"Congress can deny funding and they better. Premiums are going through the roof . Supreme are bunch of liberals out of touch with the average folks.","post_message":"According to Pelosi, Scalia ... joined the majority?  @webpagelink"}]
