[{"comment_id":"1025172404211543","commenter_b":"That old gal is an idiot.","commenter_a":"She must not love her freedom, or freedom of choice,","post_message":"FOLLOW US FOR UPDATES----> Freedom Daily This is Monica Ball she is a peace protestor outside of Bradley University in Peoria Illinois she hates the troops and doesn't care about her freedom..... Anyone see her? If so make sure you let her know where you stand. Show her some love @webpagelink"},{"comment_id":"10153563956586519","commenter_b":"Hello??? It is time for you poor ladies to start being your own role model. Stop whining.","commenter_a":"Sooooooo, losing weight is selling out now? You damned if you do, damned if you don't.","post_message":"\"I’m left longing for stories about fat women that don’t tumble off the wrong side of that thin tightrope between laughing with and laughing at...\""},{"comment_id":"1859871360913002","commenter_b":"Can we please build that wall around his ugly face and throw dirt in his mouth!","commenter_a":"GEEZ LET THAT MAN BUILD THE WALL ... @webpagelink","post_message":"\"We will build a great wall along the southern border,\" Donald J. Trump told a crowd in Phoenix, Arizona, during his immigration speech. After a long pause, he continued: \"And Mexico will pay for the wall.\" @webpagelink"},{"comment_id":"1209227002477386","commenter_b":"Dumb ass bitch","commenter_a":"I feel bad if they were black but if they're white I don't give a fuck because they never care bout us dying","post_message":"#WSHH #Iowa #Police #BreakingNews"},{"comment_id":"785950868181654","commenter_b":"Fuck you white Bitch! !","commenter_a":"DEMOCRATIC VOTERS ARE JUST FREE LOADERS...","post_message":"Don't worry John Travolta, we're also confunsed about what these people are doing!"},{"comment_id":"10153176001911336","commenter_b":"They could rename the White House, Geratic Ward","commenter_a":"91% huh? @username lol","post_message":"\"I think I've got a good message. I think I've been more right than wrong on foreign policy.\" Today on Fox News Sunday, Sen. Lindsey Graham said he is considering running for president if he can raise enough campaign funds."},{"comment_id":"1263029653753561","commenter_b":"This wasn't even a debate, it was #RealityTV. But yeah, Clinton couldn't have lost because #herOpponent has a #MentalDisability. Trump supporters are right, it's unfair to him to expect him to be competent. Donald show us your crooked tax returns #WordsMatter. Do you want the most powerful person on Earth to have the mouth, the character, the words of Donald Trump?? There is no argument for Trump. #ItsAVoteForHillaryAndHerAgenda #StrongerTogether #Progress #AFutureToBelieveIn #LoveTrumpsHate #LatinosArentRapists #WomenArentMissHouseKeeping #UnitedAgainstRacism #YesWeCan #DontBooVote #WhenYouGoDownWeGoHigh #LatinosArentPigs #ClimateChangeIsntAHoax #MissUniverse1996IsntMissPigy","commenter_a":"Its pretty simple boycott all these biased media outlets. Let their billionaires spend their money keeping it afloat. They don't help their own countrymen. But, sure want to take down America. Sorry, you are a idiot if you can't see this. Sad, but true Hillary is their puppet a long with Bush. The problem is the people are waking up. I can only say arm yourselves. These outlets and their mindless bots working for them are going to still put out the same trash everyday. You take down Law enforcement, then Military divide the people and conquer Keep being idiots.You will be telling of the America I love as \"Once upon a time\" You know those pastuers are always greener till your there. Don't you bots find it interesting Hillary is pulling a large number of Jewish vote and Muslim. WTH do you think she has promised each side to ...","post_message":"Trump's tax plan: 1. Huge tax cuts for billionaires and millionaires like him. 2. A tax hike for millions of middle-class families."}]
