[{"comment_id":"10153968461605579","commenter_b":"Absurd! There are 50 muslim countries to accept muslim refugees!","commenter_a":"You know why I support the Syrian refugees coming to America? Because I'm not going to let the terrorists dictate my beliefs, ISIS doesn't scare me. What scares me is that we, Americans, are losing our sense of direction. I've thought about this refugee crisis for for quite some time now, if you don't believe me ask the Marines who I taught about the Syrian civil war in 2012. I've been aware of this conflict for quite awhile now, while the rest of the world turned a blind eye. Islamic extremists aren't going to scare me and they are not going to change my way of life or thinking. I am an American and I cower to nobody. When I see people fleeing danger I want to help, we as Americans want to help. If you turn away women and children fleeing death and destruction because of terrorist attacks then ...","post_message":"Should the U.S. accept Syrian refugees?  WATCH: U.S. House debate on #SyrianRefugees  LIVE on C-SPAN @webpagelink    WATCH: House Judiciary Committee SubCmte hearing on #SyrianRefugees,  LIVE on C-SPAN3 @webpagelink    Senate Homeland hearing on #ParisAttacks  LIVE at 2pm ET on C-SPAN3 @webpagelink"},{"comment_id":"10152641066602061","commenter_b":"She not mom she don't deserve kids.","commenter_a":"No true mother would ever give up her child she should not be allowed to have any more children!","post_message":"UPDATE: Mom calls decision to give up newborn with Down syndrome \"hardest moment\" of her life. @webpagelink"},{"comment_id":"10154734525598812","commenter_b":"@T Elliot Cato. The Trump clan is made up of deluded folks. Please let them be...case is chronic!","commenter_a":"Why do Trump supporters keep believing the lies and conspiracy theories?","post_message":"NEW: The FBI expected to release Hillary Clinton interview notes and case documents in the coming days."},{"comment_id":"1150426991676729","commenter_b":"We could put all Muslims on Atlantis and let them fight it out! Yes, I know it is a fantasy that Atlantis existed but believing Islam can coexist with the rest of the world is a fantasy, too. Best hope the idiots get there and drown vforevthey realize they have been had. Obama can lead them with Hilary behind. My fantasy! Sorry, but I have problems.","commenter_a":"Way to go Angola","post_message":"Muslims have been asked to tear down their own mosques under threat of paying for the demolition fees...."},{"comment_id":"1131958793506245","commenter_b":"What did you expect from a trash bitch","commenter_a":"Sad, Sad, Sad. How dare you bring a child into this earth, if you do not plan to put them before yourselves. I imagine this is an ongoing problem and I truly hope that child is taken from them and placed in a loving home. If only I had the space, time, and money. I would rescue all children in a heart beat. :(","post_message":"Police want you to see these viral images of what heroin is doing to families."},{"comment_id":"10154998158283734","commenter_b":"She needs to be only allowed to Work at a Garbage Dump!! No Place else as long as she's alive!!","commenter_a":"She should get three to fives years of community service clean up","post_message":"According to police, the woman pictured below is accused of putting menstrual blood and saliva on a customer's burger."},{"comment_id":"1738896129708338","commenter_b":"Abortion queen, and has no shame.","commenter_a":"this drunk, druggie idiot has comments that no one cares about. She is a has been,, and has been Had !!! Loser, Drunk","post_message":"Renowned moral philosopher Chelsea Handler condemns Trump.   The paragon of virtue also adds: \"Please buy my book, 'My Horizontal Life: A Collection of One Night Stands'\"..."}]
