[{"comment_id":"10154194014766509","commenter_b":"*you're *themselves","commenter_a":"Why should everyone else have to be exposed to a trans person using the opposite bathrooms and locker rooms? If a person feels they are the opposite sex, get the full operation.","post_message":"The district has one month to provide access or they will lose federal funding."},{"comment_id":"1142286662534251","commenter_b":"Learn English you illegal immigrant","commenter_a":"Republicans or pathetic. I am for Trump as long as he is not for wars. Does not bother me if he is racist. At least I know where he is coming from. It is the ones who try to hide their racism you have to watch.","post_message":"None of the Republican leadership in Congress were at the meeting with Trump (nor were they invited)."},{"comment_id":"1220599301301398","commenter_b":"@username where is your weed now","commenter_a":"That will soon become illegal for sure","post_message":""},{"comment_id":"1304805006248280","commenter_b":"That's what he wants beware","commenter_a":"They try to do anything they can to make his life more miserable-how petty!!!!!","post_message":"TRUMP WON'T BE ABLE To Use Oval Office For A Year Have To Use Nixon's Old Office Across Street"},{"comment_id":"10153796040151336","commenter_b":"Kyle Get off the illegals nuts already","commenter_a":"We need a zero child rule for liberals.","post_message":"Couples in China will now be allowed to have two children."},{"comment_id":"642968752533659","commenter_b":"Amazing that this man who is causing all this problem is in cahoots with the Clinton foundation. Also the Muslim brotherhood. Look it up. He's also a lawyer who helps to bring in people illegally. Real \"good\"guy...and why was he attacking Trump? Trump did not want the war nor was he president or a senator who voted for the war. Nor is he the president now who has let ISIS run amok.","commenter_a":"He doesn't need to apologize. Hillary Clinton needs to apologize. If we did not go to Iraq their son would still be Alive. Hillary is to blame for running arms to muslim brotherhood. Khan attack Trump on national television. Trump responded. And cnn is Hillary Clinton fan club. Lol","post_message":"\"Is it difficult for your father to apologize?\" a co-host asked Eric Trump"},{"comment_id":"1277987642251583","commenter_b":"When I say technology, I'm talking about millenia of advancements. Even our simplest tools at one point put someone out of work, probably starting with the wheel. If you want to walk away from technology (or just some technology) that's your choice, just don't try and force others to pay for your choice.","commenter_a":"Low skill workers have been making this argument for generations since the first automation came about and it still doesn't work. Someone still has to design, manufacture, install and service the machine. Someone has to stock supplies for it to use. Still plenty of jobs, just not the job you were doing yesterday. They are also overlooking the other basic problem that the Government doesn't create wealth. If you get a freebie from Uncle Sam, that came out of someone else's hard earned money via taxes. If we're all sitting at home due to this miracle automation, then there's nobody around to pay the taxes to fund the government. It simply doesn't work. Worse, we've seen countless times around the world how it doesn't work and people still don't get it.","post_message":"Simply put, the idea is that Uncle Sam will cut citizens a regular paycheck whether they work or not."}]
