[{"comment_id":"388733381251257","commenter_b":"ABSOLUTELY YES !","commenter_a":"Real need/ felt need.","post_message":"This could be bad news for some people on food stamps."},{"comment_id":"443280275797013","commenter_b":"Its not just the cops with thug goggles on. The actions of blacks in Ferguson and Baltimore do nothing but reinforce that view. Racism, disrespect of laws and common decency toward others and their possessions, just begets more of the same focussed in the opposite direction.","commenter_a":"You are so racist against white people it's not funny.","post_message":"As a news team, we are not agreeing with either side of this photo as a philosophy but sharing it for perspective and as a piece of artwork which should generate honest conversation."},{"comment_id":"893629520678836","commenter_b":"Hi, what do you mean their own kind?","commenter_a":"Why are they attacking their own kind?!","post_message":"At least 37 people have been killed during a #Saudi airstrike on a dairy plant in western #Yemen."},{"comment_id":"10154549448869342","commenter_b":"That's not her!","commenter_a":"She ain't gangster now lmao","post_message":"Police became aware of a \"disturbing video\" on Facebook Live showing an adult man being bound and beaten."},{"comment_id":"10153224417118984","commenter_b":"Both sides of her mouth - she's guilty and she knows it","commenter_a":"YES; An Orange Pant Suit would do just fine!!","post_message":"The irony is unbelievable. I don't think I could have said it any better than Hillary did in this 38-second video... Should Hillary be punished for her email scandal?"},{"comment_id":"442764485911159","commenter_b":"In other words: Problems caused by Democrat policies expected to be solved by Democrat solutions. Great speech, but totally misses that it was HER party that did most of this. KKK, democrat. Vehemently-anti-civil-rights legislation, democrat. Creation of Freddie/Fannie and housing bubble, democrat. Champion of illegal immigrants driving down many black inner city wages, democrat. Cities with most black-on-black crime and deaths, mayors are...you guessed it....years of democrats. Great points, but I really wish people would figure out who REALLY is the Iago to Othello. (hint: he's a democrat)","commenter_a":"Warren! Warren! Warren!","post_message":"Elizabeth Warren explains why \"it is important to cause necessary trouble.\""},{"comment_id":"583392381839036","commenter_b":"No Mexican's aren't the only ones. All illegal immigration must be stopped. However Mexican's are the vast majority of illegals and our shared border is the place to start to stop it.","commenter_a":"Illegals come here from Mexico looking for a better life yet they want to turn the U.S. into Mexico...freakin' crazy, and stupid!","post_message":"\"The American taxpayers have reached a boiling point. We are tired of illegals taking American jobs. We are tired of illegals living off our tax dollars. We are tired of illegals causing mayhem in our streets,\" says Todd Starnes. Do you agree?"}]
