[{"comment_id":"10153286970856167","commenter_b":"Help the refugees by free their homelands from the bad people the world support with weapon and money for other profit exchange !! They are running away from their own evil ... This evil was created by the collective separations of this planet God of profit America is the only place in the planet When soon or later the origin of the people is not matter any more .. This will hopefully be our new planet order","commenter_a":"In the 1930s we turned away thousands Jews due to xenophobia, many of them later died in camps. Are we going to repeat the same mistake now?","post_message":"Since the Paris attacks, there's been a lot of hate. Here are the top five best responses to all the bigotry. Watch:"},{"comment_id":"1877645852479520","commenter_b":"Me thinks Conservatives protest to much! There was no outrage when Sen.Foley was exposed for pedophilia, in fact 36 other senators wrote impassioned letters begging for mercy for Foley. Trump bragged about oggling young girls naked at Teen Miss America and 46 million people didn't think it was a big enough issue to prevent a pedophile from becoming President. It is clear Conservatives sexual icing children is okay!","commenter_a":"Karma!","post_message":"BREAKING"},{"comment_id":"10153940111165579","commenter_b":"Any women who can put an unborn baby through a shredder while it's alive....is nasty","commenter_a":"So good to see a man who stays and takes care of his kids. At least he wasn't chasing an intern around the Oval Office right..... Why is it Libs can be so mean to men who stay with their families and give honor to men who not only engage in adulterous affairs but continue to do so. Liberal women are nasty...that is all.","post_message":"Speaker Paul Ryan: \"This was not a job I was looking for or seeking, it kind of sought me. I realized that it was a duty and an obligation. Now realize it's an honor.\" Watch complete press conference here: @webpagelink"},{"comment_id":"1011931832233204","commenter_b":"They don't really care about fetuses either. If they did, they'd be storming fertility clinics, demanding that leftover embryos be implanted in someone's uterus. No, this whole thing is about controlling women.","commenter_a":"The Republicans & Right Wing Christians are trying to take woman back to the 50's. Women should know their place, sit down & shut up.","post_message":"After seeing all the pro-lifers cheer the attack on Planned Parenthood yesterday, it's time to remind ourselves of how they really feel about human life.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154177400546756","commenter_b":"I do not intend to vote for her in Any case. Her shady politics, her Attitude, the skewed way this contest has been run, and my basic gut reaction of Strong Dislike for her are nearly overwhelming enough but... This recent tack she has made Insisting that the Democratic party MUST Permanently Give Up on things like Universal Health Care, drug reform, campaign reform, college access, and essentially Everything that Really Matters to ME as a voter has Convinced me that I CANNOT - under Any Circumstances pledge My Vote for her. To do so would be to Agree with her disgusting defeatist position. The truth is, this is the Same reason I will not vote repugnican. And, while you may say my actions make it more likely a Rep. will win, I see no Real hope in a Hillary win Worth Voting FOR. Deal with it.","commenter_a":"So, for those who will not vote for Hillary Clinton if she becomes the democratic nominee, do you think it is possible that this will result in a GOP victory? Would that actually be better for the country?","post_message":"Hillary Clinton is projected as the winner of the Nevada Democratic caucus, according to AP. #NVcaucus"},{"comment_id":"590770071125294","commenter_b":"Now if these douche bags will leave they know where their bread is buttered.","commenter_a":"They have money! They can easily move wherever they want, away from old bigot Trump and his supporters.","post_message":"Remember the celebrities who said they would leave the country if Donald J. Trump was elected president... @webpagelink"},{"comment_id":"1410115659014394","commenter_b":"Andres Rivera illegals don't belong here","commenter_a":"IMPORTANT *** California, Montana, New Jersey, New Mexico, and South Dakota, please vote for Donald Trump on June 7. We have 126 UNBOUND delegates who can choose to not vote for him on the first ballot. We need 126+ more BOUND delegates to secure a first ballot win and avoid a second ballot! Vote for Mr. Trump on June 7!","post_message":"The good news is that my campaign has perhaps more cash than any campaign in the history of politics. That's because I am standing 100% behind everything we do."}]
