[{"comment_id":"467726553428449","commenter_b":"racist ignorant rebooblican whore","commenter_a":"Both parties need to stop!!! Make America Great!!! Both parties are annoying.","post_message":"Obama wants her head, but Ann Coulter is standing her ground. This is bold. She needs our support. Can we get 50,000 'LIKES' for Ann Coulter?"},{"comment_id":"913906465331025","commenter_b":"Bernie, please keep THEIR laws off OUR bodies. #BERNIESANDERS","commenter_a":"The government only cares because it's the life of another tax payer. It's the basic human right of the individual.","post_message":"I understand that not everyone agrees on this issue but my view is that a woman has the right to make decisions regarding her own body, not the United States government."},{"comment_id":"10153605570044205","commenter_b":"I held the door for a woman once and she said \" What you think I can't open my own door?\" Aaaaaaaannnnndddd I quit opening doors for women","commenter_a":"Also this bitch is a joke... i live in texas and shes just a narrowed minded republican raised by republicans... look how much make up she has on... lets guess what she cares about. Gtfo with your nonsense... and dont talk about men not holding doors for girls.... you women killed it. Hardly anyone says thank you... you are basically expecting it but not acknowledging it. So we took it away. Bitches always pointing the finger at men like we are always in the wrong. No fuck you.","post_message":"Alexis Bloomer has taken to social media to give a speech on why her generation is so self-centered."},{"comment_id":"10153497941541130","commenter_b":"Exactly, because feminism is about equality","commenter_a":"The funny thing is, if the ad said men are preferred, the women would be yelling sexism. Women are preferred? Sexism.","post_message":"\"The position requires filling in the responsibilities of a receptionist, so female candidates are preferred.\""},{"comment_id":"10152744570508822","commenter_b":"so hard to even win a buck!","commenter_a":"$1 straight Is 50. $1 box is 25","post_message":"The Pennsylvania Lottery is getting a makeover and adding a new game. Check out the changes here: @webpagelink"},{"comment_id":"10153007949671636","commenter_b":"Cannot stand her!","commenter_a":"@username - your favourite!","post_message":"'What's wrong with you?!'"},{"comment_id":"1335611113123776","commenter_b":"Give her a Public Horsewhipping too......Fraud","commenter_a":"One down, thousands to go.","post_message":"Former Pennsylvania state Attorney General Kathleen Kane, who came to office on support from gun control groups, has been sentenced on felony perjury charges."}]
