[{"comment_id":"960457477322681","commenter_b":"Hunt these cops! Good Germans would say this!","commenter_a":"police state","post_message":"Officer Thomas Webster was just found not guilty of assault... even though he was caught KICKING and UNARMED MAN IN THE FACE as he obeyed police commands.  This is America, 2015. Not the Jim Crow Era.  From (Y) Counter Current News - MBD"},{"comment_id":"10158316523410578","commenter_b":"Lock up homegrown terrorists!","commenter_a":"OUT OF HERE ILLEGALS.","post_message":"Do you support the Immigration Crackdown? 'As we speak, immigration officers are finding the gang members, the drug dealers, and the criminal aliens and throwing them the hell out of our country. And we will not let them back in. They not coming back in, folks. They do, they going to have bigger problems than they ever dreamed of.' - President Trump @webpagelink"},{"comment_id":"10153686958951028","commenter_b":"Not her? This is total and a unpleasant BS!!!","commenter_a":"Joseph & Christine wowwww","post_message":"Former professional wrestler Chyna has died at age 46, her manager confirmed to NBC4. @webpagelink"},{"comment_id":"1021161244667320","commenter_b":"Thank you Sir for your service. You inspire - Me - to be a better person.","commenter_a":"How very inspiring to Americans!","post_message":"'God Kept Me Alive for a Reason'  Can we get 5,000 'LIKES' and 'SHARES' for this HERO?'  @webpagelink"},{"comment_id":"10154325852416323","commenter_b":"The woman is a perpetually grinning dimwit. She'll probably become PM.","commenter_a":"Fucking moron","post_message":"'At least 50% of her public statements sound as if they were said for a dare. 'Let’s banish pessimists.' 'Boris Johnson is a lovely man.' The rest sound like she’s assembling endtimes magnetic fridge poetry.'"},{"comment_id":"10154730385206341","commenter_b":"Understand. Thank you.","commenter_a":"Hmmm, an army that establishes a state based on a single religious identity through violence and ethnic cleansing. Why does that sound familiar? Oh yah! Ding Ding Ding Ding! Is the big chief still living in the nineties? They already look like ISIS to most of the world, just a little less sloppy.","post_message":"'The commanders are the ones who should set the rules of engagement, not politicians'"},{"comment_id":"10153000077314197","commenter_b":"I prefer the old style plates. And I believe undocumented residents should not be allowed to obtain a driver's license. There must be a hidden agenda here.","commenter_a":"The old one is much better!","post_message":"Which Connecticut license plate do you prefer?  What do you think about undocumented residents getting driver licenses? Watch Dennis House interview the new DMV Commissioner today at 11 on Face the State @webpagelink"}]
