[{"comment_id":"590770071125294","commenter_b":"Now if these douche bags will leave they know where their bread is buttered.","commenter_a":"They have money! They can easily move wherever they want, away from old bigot Trump and his supporters.","post_message":"Remember the celebrities who said they would leave the country if Donald J. Trump was elected president... @webpagelink"},{"comment_id":"773517859455693","commenter_b":"They should both go to jail","commenter_a":"Bill can't keep his pecker in his dried up wife's vagina and her server was unprotected. She is a liar, corrupt corrupt blood money.","post_message":"His reaction was..."},{"comment_id":"10154734525598812","commenter_b":"@T Elliot Cato. The Trump clan is made up of deluded folks. Please let them be...case is chronic!","commenter_a":"Why do Trump supporters keep believing the lies and conspiracy theories?","post_message":"NEW: The FBI expected to release Hillary Clinton interview notes and case documents in the coming days."},{"comment_id":"686618911486884","commenter_b":"Does this arbitrary terrorism not offend a large number of your customers, therby, justifying, really justifying firing such a dumb asshole?","commenter_a":"How much do he makes,","post_message":"This might be the worst CEO in the country and no, it’s not Papa John this time."},{"comment_id":"10154255735864411","commenter_b":"It doesn't hurt to have sense of humour :)","commenter_a":"It's pretty stupid how media outlets are sharing such pathetic content. It's Obviously and clearly not a frikin time traveller. What's even more pathetic, is how the public seem so hooked onto such rubbish.","post_message":"'Time travel is real?'"},{"comment_id":"1104396149581395","commenter_b":"Because women aren't people?!","commenter_a":"*women with depression","post_message":""},{"comment_id":"1170889439672424","commenter_b":"The people who are fighting for our clean water and sacred burial land i applaud you, it is sad to see once again big corporate doing as they please at the expense of the people and bull dozing minorities but hey this is nothing new when has America respected minorities let alone there rights and means of survival, most of the people apposed to this never lived in a state of emergency where there water was flammable or had to be boiled even places today like flint still have contamination in there water, smh alot of you people need to wake up and realize the treaty(1890s)was broken and that property was not supposed to be sold or messed with but when has the white man ever kept a treaty with the red man.","commenter_a":"Ritini Mahuru Anabelle Palza","post_message":"Activists in Standing Rock, North Dakota were shot with rubber bullets and sprayed with water in freezing temperatures. @webpagelink"}]
