[{"comment_id":"944224732371213","commenter_b":"Yeah, she didn't want to have sex with an Orange baboon.","commenter_a":"I guess Trump would know a lot about attitude. He has a very bad attitude and has the emotional age of three!","post_message":"\"She gained a massive amount of weight, and it was a real problem. We had a real problem. Not only that, her attitude,\" Trump said Tuesday morning."},{"comment_id":"10153598339119205","commenter_b":"Fuckdonaldbitchasstrump!!!","commenter_a":"*****Hillary Clinton leads the Nation in overall votes and delegates, than any other Candidate running for the Presidency! She is more qualified and has more experience and will be ready to be our Commander in Chief, on day one. She has exemplary qualification in Foreign Policy, National Security and Diplomacy. Please vote wisely and vote for Hillary Clinton, our next POTUS 2016*****","post_message":"The biggest LOSER of the MSNBC #DemTownHall was..."},{"comment_id":"10154724995284197","commenter_b":"Good dog. Take a bite out of crime!","commenter_a":"Another morning of bumper to bumper. And another police chase. Thank goodness no innocent people involved.","post_message":"JUST IN: #Milford police said they were pursuing shed burglary suspects down I-95 when it resulted in a crash with one of their own cruisers: @webpagelink"},{"comment_id":"351086708348331","commenter_b":"All about the MONEY Honey.","commenter_a":"It has profited as much as it can.","post_message":"“One source confirmed to me Caitlyn Jenner has made whispers of ‘sex change regret,’ hinting she might go back to being Bruce Jenner.” - Ian Halperin"},{"comment_id":"1063012123817862","commenter_b":"It is under God not no damn allah you ignorant muslim cocksuckers. If you dont like our country,our anthem, our flag,and our laws then by all means get the fuck out and take the clintons and obamas with you","commenter_a":"WTF","post_message":"THIS IS THE UNITED STATES OF AMERICA! Our country was founded on Christian principles. 'LIKE' if you think this is wrong!"},{"comment_id":"1750245355240943","commenter_b":"While the twins are cute. How's this building the black community? She is in dishonor. She dishonors her ancestors.","commenter_a":"See what happens when we come together as a people? We produce beauty!","post_message":"These cuties went viral after their emotional discovery of their age difference. Now, we get to meet the adorable #McClureTwins & their parents!"},{"comment_id":"647476645408815","commenter_b":"Please don't get me started on this WITCH","commenter_a":"HAHAHA Hillary blasts Trump for being a parent! Trump went to Scotland to support his son for building the golf course! He was being a father! Hillary is the one who can't handle business. She lost $6 billion on her watch.","post_message":"Hillary Clinton blasted Donald Trump, saying during this time the U.S. needs a leader that will \"put the interests of the American people ahead of their personal business interests.\" What do you think about this?"}]
