[{"comment_id":"1683735615241075","commenter_b":"@username that 'swhy we dont need foreigners like you in our country! keep begging... you still dont think you are mentally ill! lmao an opinion got your balls, smh sick in the head.","commenter_a":"l.o.l why it took a republican... Donald Trump is the truth and he makes sense but his arrogance ways does make him look bad ! but we dont need anyone leaving or coming into America right now since we have no control over our country....","post_message":"They called on Republicans to reject Donald J. Trump immediately."},{"comment_id":"10153962696310950","commenter_b":"Seriously?? You are part of the problem! What she is wearing is irrelevant! She shouldn't have to wear a turtleneck to keep creeps from thinking they have free reign. Just because a woman wears sexy clothing it is not an open invitation. You still have to have permission period end of story!!!!","commenter_a":"She needs to get some self-dignity and wear something that covers her breasts.","post_message":"The soap star notably did not mention the GOP candidate in her statement."},{"comment_id":"10153026521466955","commenter_b":"Women of the world just took a hit, sorry","commenter_a":"it's all lies and if you even think for a moment it's true then your the fool","post_message":"MAG: Bruce Jenner 'Transitioning into a Woman'... Filming momentous docu-series..."},{"comment_id":"928783390554410","commenter_b":"This is who he is at his core. This is what he will be. He has done us the great service of showing his true face, not the shiny, practiced veneer of the professional politician. Whether he learns to act presidential or not, this is the man you will be getting if you vote for him, a man who wants to pull out a measuring tape to settle disputes over issues. The fact of the matter is that there are no good choices this time. There aren't even any ok choices. But this man is a bully with all the character flaws that go with that, and he will do almost as much damage to this country as Clinton or Sanders. I am seriously dismayed by the continued popularity of this man, but I am equally dismayed by my other choices. And I am dismayed with a general electorate who ...","commenter_a":"It's past time for him to be acting more presidential. He also needs to do some research in preparation for the debates. Chris Wallace made him look like a fool when he put up those slides on his economic plan. He's making it harder and harder to not only defend him to skeptics, but to also remain an enthusiastic supporter instead of being a reluctant one.","post_message":"Despite what polls had shown days before Super Saturday, DONALD TRUMP lost two of the four states on Saturday to Sen. Ted Cruz, and the states he did win were at a lesser margin than predicted.  Some supporters and pundits are placing the blame on Trump's performance during the Thursday night debate, stating his \"less than presidential\" behavior is catching up to him.  In the past, DT has stated he will act more presidential when the time is right, so we ask you to take our poll knowing DML will read the results later tonight on UNFILTERED.  POLL: Does Trump need to act more presidential in order to win?  @webpagelink"},{"comment_id":"1765614553704778","commenter_b":"Congress has the power to IMPEACH HILLARY now for all the massive lies & corruption at its highest level. Ask your Congress person WHY THEY ARE NOT?? Where is the integrity of Congress?","commenter_a":"So the White House knew full well about Hillary's email after all .. one false narrative after another. This nation cannot survive another 4 years of corruption like this!","post_message":"\"The IT professionals who whitelist devices at places like the White House only add the email addresses authorized by management.\""},{"comment_id":"10154669913269843","commenter_b":"Well some of those people must be women with phones.","commenter_a":"Yay! Maybe traffic will be better!","post_message":"\"A Day Without Immigrants\" actions are planned across the U.S. in cities like Dallas, Austin, Philadelphia, Washington and Boston... bit.ly/2kz5UXf"},{"comment_id":"10153074240773067","commenter_b":"Lol no, A stockholder though, and everything that i put on here were statements from Ford in response to Donald Trump.. Just summarized","commenter_a":"Trump had nothing to do with this. This was because Ford, and the UAW were able to work an agreement, Ford is committed to keeping and creating jobs in the U.S. They have created 25,000 new jobs in the U.S. In the past four years. Over 80% of their manufacturing is done in the U.S. And 97% of their engineering is in the U.S. As they stated. No i dont like seeing jobs being outsourced, but Trumps statement had no effect on the outcome of this. Im happy for all the people who kept their jobs. Ford is a great company! And will do what they can to keep bringing new jobs to the U.S.","post_message":"This comes after Ford Motor Company came under fire for creating thousands of jobs in Mexico. @webpagelink"}]
