[{"comment_id":"1171557939550328","commenter_b":"OBAMA IS A TRAITOR. HE SHOULD LEAVE THE WHITE HOUSE ASAP.","commenter_a":"Obama just sunk lower than even I thought he could sink..as he was trying to be a comedian - he deliberately chastised Donald J. Trump over and over...he should be so embarrassed but he's an idiot so I guess we are still to assume he's above and better than the rest of us. By the way Obama - no one was laughing other than \"AT\" you for being so ignorant. That got you no leverage with anyone in that room if those people attending were normal human beings - only your planted people gave you any recognition and even they must have been devastated by your horribly degrading remarks all made in the name of humor - just as Will Farrell finds Alzheimers disease comedy - this was right up there with it...SHAME ON YOU FOR BEING SUCH AN ASS HOLE!!!","post_message":"PHOTOS and VIDEO of TRUMP RALLY IN CALIFORNIA... Arrests, Cars Smashed, Mexican Flags, Riot Cops.... Can't wait for the deportations to begin. See photos and video from event: @webpagelink"},{"comment_id":"10153404952670399","commenter_b":"Women see him and spontaneously abort.","commenter_a":"Cherry picking keeps religion alive.","post_message":"Way, way too much information."},{"comment_id":"840577339312941","commenter_b":"I can't help but wonder at a few things, if the anti vac parents with children that have Measles now had seen to it that their kids had the MMR vac, would the kids be sick now and also, look at where the majority of the kids that have had and now have measles have in common...vacation to Disneyland...ummmm no illegal alien has that kind of money, unless they are coming from wealth in the first place. It is all too easy to blame the \"illegal aliens\" for everything wrong in out country...not always the case.","commenter_a":"Ya think? Duh....","post_message":""},{"comment_id":"10153922383952894","commenter_b":"Correction: When some women see a celebrity, all they see is their bank account. 🤔","commenter_a":"This is what they get for messing around with these white women, Chris Brown knows, when a some white women see a black male celebrity the first thing they see is a bank account and how can they set them up to get some money, when are you black male celebs gonna learn this, they wouldn't talk to you if you wasn't rich! DAMN!","post_message":"Chris Brown’s Accuser Baylee Curran Speaks, Says Chris Pulled a Gun on Her Over Jewelry [Video]"},{"comment_id":"10156273080720389","commenter_b":"She's a gutless wonder!","commenter_a":"good for you rudy.now call out the queen of liars abad tell her this country does not need a corrupt murdereer of ameicans in bengazi...","post_message":"In Case You Missed It: Rudy can be a little blunt sometimes."},{"comment_id":"818359668354610","commenter_b":"Freaken Muslim foreigner.","commenter_a":"Yes","post_message":"Obama Disrespects Our Nation's Police In A SICKENING Way Right After Dallas Shooting He is the worst president in our country's history. Do you think Obama is a disgrace?"},{"comment_id":"10154330471404087","commenter_b":"....because in a hostile foreign environment you may well have to...I say it's sound advice.","commenter_a":"We will make this World great again!","post_message":"Retired Gen. James “Mad Dog” Mattis once explained his life philosophy to fellow Marines as: “Be polite, be professional, but have a plan to kill everybody you meet.”"}]
