[{"comment_id":"690460261111351","commenter_b":"spelling lady...... come on now.","commenter_a":"I think I will get off here and work. Better than listening to his lioes","post_message":"Watch LIVE as President Obama speaks at a town hall at Fort Lee. Do you know someone taking part in the event?"},{"comment_id":"1134245933335126","commenter_b":"@username sadly I think in a Trumparchy dipsticks like Susan will become Senators. Oh wait, they already have.","commenter_a":"It looks like your allies have a far more accurate picture of Trump that the American morons who vote for him do. He has made America a great laughing stock around the world. If America is to regain any pride, you MUST DUMP HERR TRUMP.; he is a danger to the whole world. If we could all vote, about 6 Billion people would vote No to Trump..","post_message":"These drawings are PERFECT."},{"comment_id":"654547928069119","commenter_b":"Her momma needed to be called..to see what a disrespectful kid she has..","commenter_a":"She deserved what she got..","post_message":"Obama supporter gives lip to police, learns very quick lesson. This is what you get when you disrespect authority. Do you think she got what she deserved?"},{"comment_id":"1265082296896088","commenter_b":"Women get no opinion in Adolf Trump's amerikkka. So stfu and get back in the kitchen","commenter_a":"But not the recount in Detroit, where there r more votes than voters now. Not Russian--democratic votes.","post_message":"Trump supporters are calling the effort undemocratic. What do you think?"},{"comment_id":"10154382279344497","commenter_b":"Aye. Fuck bitches, make money.","commenter_a":"Single man enjoying free milk, basking in savings after not buying cows.","post_message":"Via ClickHole:"},{"comment_id":"10153480378764071","commenter_b":"The only reason I stick with BI! The comments are classic! Love it.","commenter_a":"These comments are killing me!!! 😂😂😂","post_message":"The pricier your brand, the better customer service you provide."},{"comment_id":"958393367537826","commenter_b":"All blacks destroy their housing and no whites do right Shawn?","commenter_a":"Yeah how dare those desperately poor people in Africa decide what they can do with their own resources to get some income from wealthy people who want to spend it.","post_message":"52 percent of all lion trophy exports end up in the U.S., and its share of the trophy trade has been growing. #CecilTheLion"}]
