[{"comment_id":"10153906940493812","commenter_b":"Are you American? If your pro bringing terrorists into the country and giving them free benefits like Medicaid etc. while American citizens starve, how about we send a few to stay with you? Wait... I get it... 'Nuff said!","commenter_a":"After all, some Americans do have a heart. Way to go Pres. Obama.","post_message":"'Apparently, they are scared of widows and orphans coming into the United States of America.'"},{"comment_id":"10155048729377235","commenter_b":"I cannot and will not even listen to this lying disgusting woman! I cannot watch her on TV for even three seconds, she makes me wanna puke!","commenter_a":"Oh shut up!","post_message":"The Trump administration just doubled-down on their attack on one of America's biggest allies."},{"comment_id":"10154478839956636","commenter_b":"'@username without god, noone can hear you get shot. Your worldview is wuite hopeless. Without god, who will punish evil ppl then evil has won. Rofl","commenter_a":"They found the remains of velociraptor Jesus used to ride on.","post_message":"Incredible"},{"comment_id":"10153146701373984","commenter_b":"Scumbag","commenter_a":"He will never get impeached. He has to many people in his pocket. He started crap the second day in office and it just snowballed, and here we are today. Happy you liberals and the people who voted twice for this Muslim","post_message":"This new plan could spell disaster for America...  Should Obama be impeached before he does more damage?"},{"comment_id":"10154001365909497","commenter_b":"There are plenty of nice average looking women that 'nice' average looking guys ignore because they chase hot chicks. It works both ways.","commenter_a":"Local man who would be good provider for area woman`s kid friendzoned while area woman dates unemployed band members. Area woman complains about lack of good men.","post_message":"'If they find a cure for Zika tomorrow, it not like I can afford to get pregnant under my current insurance plan.'"},{"comment_id":"10153266614821336","commenter_b":"California has been sicking for some time! One of the things liberals in CA like to do is drive companies out of the state! Also turn off the water to the small farmers, that put 40,000 farm works out of work! Keep building houses when they don't have the water to supply to them. Build a high speed rail road that no one wants or needs!","commenter_a":"Hard to find anything dumber than a California Democrat.","post_message":"Nobody's laughing, Rep. Loretta Sanchez."},{"comment_id":"10154840376458812","commenter_b":"Yes sir he is.... Charmayne E bradley it saddens me so much to see baby's getting killed for nothing...i will continue to pray for them u and I . I often wonder what this world would be if everybody get together and love one another and stop with all the violence n hate","commenter_a":"Lord Jesus Christ our world is in dire need of ur help Jesus Christ plz help us all this world is beginning to all apart we don't know who to trust people are turning on each other and lord we don't know why r where all this hatred is coming from plz lord take care of all of us show us to love n trust n help one another the world is big enough for us all.respect love n in god we trust.....","post_message":"Video shows Syrian girl rescued from rubble after airstrike on east Aleppo neighborhood that killed at least 23 people, including 16 members of the girl’s family, activists say. @webpagelink"}]
