[{"comment_id":"10153579902226135","commenter_b":"I think it's illegal to drive while drinking whether or not you have a child in the car...","commenter_a":"What's her name? I want to see if she has a Facebook.","post_message":"Initially, the woman is seen on video wearing only a tank top and underwear. Police says she appeared sluggish and smelled of alcohol."},{"comment_id":"1461843750508898","commenter_b":"WHY DO THEY LET THIS GUY DO THIS ? JUST SHOOT HIM AND BE DONE WITH IT .","commenter_a":"Another scumbag trying to blame someone else for his criminal actions. This seems typical of his type. Rot in prison and enjoy your \"foot longs\" until you die, Jared Fogle","post_message":"He is claiming that the PARENTS are to be blamed for her spiral of drug abuse, self-harm suicidal thoughts, which she says was the result of his abuse."},{"comment_id":"1122113947823699","commenter_b":"Her feet are dangling fucking idiot","commenter_a":"And when exactly does he lift her and smash her against the car? Fuckin race baiter, who runs this page yo? Its gotta be a black person, racist bitch","post_message":"He LITERALLY lifted her off the ground and smashed her little body against the car! We just received this, will have more details soon."},{"comment_id":"10153836514883797","commenter_b":"Why don't young ladies have enough sense to do background checks on these idiots before they shack up with them, have kids with them...","commenter_a":"Omg that's so sad","post_message":"HEARTBREAKING: Cecelia has just moved with her two children from the Detroit area for a better life. But Friday night, her ex-boyfriend used a dog leash to strangle her and her two boys. The last thing she ever said to her mother before her death will break your heart:"},{"comment_id":"584112685109576","commenter_b":"Nah that was Sanders @username. Hillary will lead us into an even more corporate America with a short economy and allow foreign threats to come in while the middle class die and Hillary and the elite get richer and richer.","commenter_a":"Clinton will lead us into corruption, loss of independence and freedo,... she will lead us into a socialist communist state bowing to russia and north korea. Vote Trump and save our future.","post_message":"If you've ever wondered what Hillary's like as a friend, you could ask Janelle."},{"comment_id":"10153559590411051","commenter_b":"Lol, she can't read","commenter_a":"If a citizen from another state isn't eligible for in-state tuition, why should someone here illegally from another country have that benefit? I agree with the ruling.","post_message":"The Georgia Supreme Court's decision was clear: Illegal immigrants are not eligible for in-state tuition. Do you agree or disagree with the ruling?"},{"comment_id":"1211673908894956","commenter_b":"ROTTEN NO GOOD PIECES OF CRAP, FIRE LESTER HOLT, DAMM LIBERAL , AND RUN HILLARY TOO PRISON WHERE SHE BELONGS.","commenter_a":"If she gives out free college who do these dumb asses thanks whos going to pay for it _ we are","post_message":"A rigged election!!"}]
