[{"comment_id":"10152747797741051","commenter_b":"Not a nun no more now she's a sum cause that's what she got","commenter_a":"I thought nuns were sworn to celibacy","post_message":"A nun was rushed to the hospital with extreme pains. When the doctors told her what was happening, she couldn't believe it."},{"comment_id":"488489361275658","commenter_b":"Don't think she will get off easy this time.","commenter_a":"She will get off easy because she's a cops wife","post_message":"A cop's wife did this to another cop's wife. I wonder what on earth she was thinking!"},{"comment_id":"996496440403675","commenter_b":"She would take money from a baby for her own use","commenter_a":"The spineless Republican leaders arent getting the word out that Orlando was a terrorist killing in the name of Allah. The lying left has actually convinced their stupid followers the massacre is a \"gun problem\" rather than admitting this was a radical Islamic terrorist event. Our Country is in BIG trouble when we lose 49 innocent people, and the REAL problem has NOT been identified.","post_message":"CROOKED HILLARY CLINTON: FOR SALE!"},{"comment_id":"10154608248221350","commenter_b":"Wonder how many people asked when he was born...\"does he have hair\"?","commenter_a":"Baby cute","post_message":"WATCH: Look at this little guy mane! @webpagelink"},{"comment_id":"10153109185578812","commenter_b":"I hope people know the women in Iowa aren't all like her.","commenter_a":"I'm from Iowa. So embarrassing!","post_message":"The Republican Response to #SOTU2015: Who is Joni Ernst?"},{"comment_id":"10152605770366680","commenter_b":"She certainly has enough raging male testosterone !!!!","commenter_a":"She is totally useless and has done absolutely nothing of benefit to the Democratic Party.","post_message":"Running for Senate might be an elegant solution for a woman with no other way to advance her career."},{"comment_id":"10153233251546350","commenter_b":"No she don't she is a young hoe. Celine is why better the Ariana Grande","commenter_a":"I don't think so! Her voice lacks the richness of Celine's.","post_message":"Ariana Grande's impression of Celine Dion is spot on!"}]
