[{"comment_id":"10155922469974199","commenter_b":"All he's got to do is offer residency or citizenship to all of the workers who are here illegally and who are will to work on the wall for minimum wage and he could probably build that wall for 5 billion. And technically Mexico would be paying for it.","commenter_a":"This man is a joke and you guys really elected him. We are all doomed under his watch","post_message":"President Donald Trump tweeted Saturday that he is aware of the new costs estimates for the proposed wall along on the U.S. border with Mexico.   A government analysis suggests the wall could cost $15 billion, and possibly as much as $25 billion.  How much are you willing to pay for the wall?"},{"comment_id":"10154099546462377","commenter_b":"How about all of us that approve? No one asked me if I approve the transition? Comon, same old story as we heard during the lection!!!","commenter_a":"Awe !! Get used to it .","post_message":"More than of half of Americans disapprove of how Donald Trump is handling his presidential transition, a new Gallup poll reveals."},{"comment_id":"1801266436786153","commenter_b":"Ungrateful bitch what an embarrassment for her team disrespectful I throw her off the team","commenter_a":"Yes","post_message":"Do you think she should be KICKED OUT of the Olympics??"},{"comment_id":"953749507999241","commenter_b":"I don't care if someone is breast feeding, but I cannot stand when attention seeking bitches claim they want equal \"rights\" but actually want to go around showing off their shitty bodies, crying for attention. Don't even try to tell me men and women's chests are the same, our chests have evolved for thousands of years to feed a child, men's have not. Just like men generally have a lot more muscle mass, they have evolved to meet the needs of his family while the mom nurtures and takes care of the babies. You are NOT feminists, you are an embarrassment to the female society. I want to fight for the rights of women who can't leave the house without a male, and are brutally forced into genital mutilation. The ones who are so \"oppressed\" because it's not socially acceptable to be naked in public make my blood boil. Like ...","commenter_a":"sorry, I don't want to see it either and I have 3 children myself. it's wonderful, its necessary and its private.","post_message":"Talk about a great response from the mom. (via TakePart.com)"},{"comment_id":"960457477322681","commenter_b":"Hunt these cops! Good Germans would say this!","commenter_a":"police state","post_message":"Officer Thomas Webster was just found not guilty of assault... even though he was caught KICKING and UNARMED MAN IN THE FACE as he obeyed police commands.  This is America, 2015. Not the Jim Crow Era.  From (Y) Counter Current News - MBD"},{"comment_id":"1911468415618542","commenter_b":"Buy yo mama some food","commenter_a":"All doped up","post_message":""},{"comment_id":"10155325034607439","commenter_b":"Women will be wearing them just to be so called fashionable","commenter_a":"YUK","post_message":"Fascist fashion. It's just plain ugly. Anti-fashion, anti-woman, anti-beauty."}]
