[{"comment_id":"495965727273607","commenter_b":"we don't want that pussy here anyway","commenter_a":"Whatever","post_message":"Bruce Springsteen and Bryan Adams are HUGE Hypocrites!!!  They play their \"music\" in countries that throw gay people off buildings, but ban perverts from going into a little girls room and all of a sudden they got a problem???P"},{"comment_id":"1478041665558122","commenter_b":"@username - very serious! Just wait and you will see!! Thanks for allowing Clinton to be our next president!!","commenter_a":"Sorry- false!! Most military is for Trump!! Voting for Johnson is a vote for Clinton!! Why would the military want a person who believes in open borders!!","post_message":"These pushups are more than Trump has done."},{"comment_id":"1517317031907717","commenter_b":"Lol! I know right! Hate that woman! This,Chicana is for #trump2016 !!","commenter_a":"The most satisfying thing in the world to see, EVER, is watching Megyn Kelly say Trump wins!!!!!!!","post_message":"BREAKING: Initial reports indicate Donald Trump has won the Republican primary in South Carolina. Let's take a poll of our own...would you like to see Trump as the next US president?"},{"comment_id":"10154339330179087","commenter_b":"@username, who is afraid of immigrants? There are laws. Laws need to be followed to become a citizen. Do you want a POTUS ignoring federal laws?","commenter_a":"The left just can't help themselves. They have to cast this Trump... They have to portray him as somebody that's a walking mental midget, that literally has no idea what he's done here by winning the presidency, that has no idea how to talk, has no idea how to behave. They continue to make the mistake of plugging him into their model. They're plugging him into what they think an accomplished politician is, and he's not that, he's never been that, and he's not going to be that.","post_message":"“Trump and Pence, they pulled a dog and pony show on the numbers. I almost threw up in my mouth.”"},{"comment_id":"10153605499851509","commenter_b":"She's doing a great job just having the officers do nothing other then standing around . These Cops should be arresting them instead shes giving these rats a free for all . Disgusting","commenter_a":"Mayor is an idiot. Saw it coming, said had to give people space to destroy, DID NOT CALL A CURFEW, and tomorrow school is cancelled, wonder what the kids will be doing tomorrow DAAAAAAAA","post_message":"What started as peaceful protests days ago have turned violent, with stores being looted, rocks being thrown at police and buildings and cars set on fire. Here's what we know happened today leading up to the violence: @webpagelink #BaltimoreRiots"},{"comment_id":"10153862948491523","commenter_b":"You think women put these objects in themselves? This was a product recommended and approved by from their doctors. STFU","commenter_a":"Stop putting foreign objects in your body!","post_message":"Some of the women experiencing adverse affects from Essure are relieved to get hysterectomies to get the coils out."},{"comment_id":"10153938983386051","commenter_b":"It appears that conservatives are pro-Sharia law after all.","commenter_a":"People willing to vote for a guy married to a former supermodel and who used to sponsor a beauty contest object to a halter top? Really?","post_message":"Some people are very upset over how Megyn Kelly dressed on Fox News last night. Here is what she wore. Decide for yourselves if there's anything wrong with it."}]
