[{"comment_id":"10153533859861615","commenter_b":"Get that creep off the streets, love that area. People are so sick.","commenter_a":"Diane Fickley Pesci","post_message":"“(He) blocked her so she couldn’t go any further that way and says, ‘Hey, want to have a good time?’” NOW ON CHANNEL 11 MORNING NEWS: A man is being questioned in connection with an attempted luring of a teenage girl -- in the parking lot of South Hills Village Mall. Hear what she and her mom did to help police track him down."},{"comment_id":"10158633377120725","commenter_b":"Funny, president Obomba deported more people than any president in us history. Liberals worship him. Trump deports people and out come the crybabies and the protests.","commenter_a":"Why deport the good people? I don't get this ine","post_message":"Advocates believe the roundups and arrests mark a shift in enforcement under the Trump administration."},{"comment_id":"10150959655894999","commenter_b":"f you want a president that - Is a dictator above the law criminal who controls the brainwashing media and FBI Starts a war with Russia, China, Syria because they're not part of NEW WORLD ORDER - Can't be trusted to protect the security of our nations borders, classified information, or lives of our ambassadors and spies - Opens door to Jihad Terrorism and rape culture while our veterans sleep in the streets - Take away your right to protect yourself with a gun from her Isis soldiers she and HUSSIEN created and brought in. - Sells your country to your enemies and gives your enemies nukes - Raise taxes and enslave us while paying our enemies billions - Steals from her charity - \"Loses\" 6 billion of your hard earned taxes money - Defends rapists and bullies the victims - Brainwashes her followers to attack \"deplorables\" and starts fights ...","commenter_a":"I hope you guys will vote for Jill...","post_message":"Our photographers are sharing Election Day scenes from Manhattan, Miami and polling sites across the country. Follow along here: instagram.com/nytimes"},{"comment_id":"2045292995569416","commenter_b":"Oh shes another one who lied.","commenter_a":"Liar liar pants on fire!","post_message":""},{"comment_id":"10153503664933132","commenter_b":"Kourtney hasn't helped things along with Scott. If she thinks enough of him to be with him unless he's a horrible snored and she can't get any sleep her place is in bed with her husband! I love kourtney the most but I think shes too controlling. Scott is using his parents death as an excuse for anything he does wrong and that's not right either. But in my opinion Scott is gorgeous!","commenter_a":"They do make cute kids","post_message":"Cute alert!"},{"comment_id":"536487383205696","commenter_b":"Here's some facts for you Gerry - I NEVER want to be someone's \"arm candy\", I will NEVER marry for money and I don't have relationships with people because of the way they look. I do agree with you when you say we are our worst enemies, but that doesn't give you the right to generalise all women. Unless you're happy to be lumped with the guys that are shallow and only date women with big breasts","commenter_a":"Who the hell cares if she is pregnant? unfortunately women are their own worst enemies, happy to be arm candy of some of the most groteste males alive,providing they are millionaires, fact!","post_message":"Jennifer Anniston has said we’ll be the first to know if she's pregnant. Writing for The Huffington Post, the actor blasted the “sport-like scrutiny” she lives under, saying it’s indicative of society’s warped view of women which sets a dangerous example for girls."},{"comment_id":"10154137959598701","commenter_b":"Dumb tweaker bitch","commenter_a":"Debbie someone actually fell for it.","post_message":"In Case You Missed It on Good Day Oregon: A contender for world's dumbest criminal. A Texas woman fell for a police department joke: a Facebook post with a warning about meth and heroin \"contaminated with Ebola\"."}]
