[{"comment_id":"966056150146121","commenter_b":"Slow learners. Blacks keep voting Democratic even though Dems have done nothing but baby them and keep them down.","commenter_a":"They STILL haven't learned about the democrats !!!!!!!!!!!!!!!!!","post_message":"LANDSLIDE"},{"comment_id":"502346796622132","commenter_b":"Of course she had to remove that ugly mask - if you don't like it go home!","commenter_a":"Most states have laws that read, paraphrasing now, that it unlawful to conceal your identity when entering a place of business. Maybe someone out there with more interest in law or has more time than I do can clarify? But yeah, the owner can refuse service to anyone they choose!","post_message":"She wouldn't unmask herself, so the store owner demanded this.  Do you think the store owner did the right thing?"},{"comment_id":"493465740841719","commenter_b":"Good I will not go there!!","commenter_a":"I wont be there so shove your coffee and other product up your big rich white ass","post_message":"Should we boycott now?"},{"comment_id":"1249007868459199","commenter_b":"Also, where are the women?","commenter_a":"Where are all the 3 year orphans Obummer talked about?","post_message":"Obama couldn't vet the guys I went to school with in Mumbai; how does Mr. Know-It-All plan to vet tens of thousands of #SyrianRefugees?"},{"comment_id":"10153912123821409","commenter_b":"Wow she should be kicked out for that!!","commenter_a":"You signed on the dotted line !! Hate to break it to you . Your job is to protect the freedom of this great nation. To bad you will be in the brig CHILE !!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10155187473209614","commenter_b":"Your armpit makes me gag hahahhaha","commenter_a":"let them do their job.... and yes if you are on list ...GOOD BYE !!!!!!!!!! SUPPORT ICE FOR THE MAKING AMERICA GREAT AGAIN...","post_message":"Los Angeles' top elected officials cosigned a letter  urge in the strongest possible terms that ICE immediately cease this practice in our city.  Since the late 1970s, L.A. police have worked to build trust within the city large immigrant community so those in the country illegally can report crimes and offer information to police without fear of deportation."},{"comment_id":"879451945423561","commenter_b":"The Bimbo queen herself Sarah Palin.","commenter_a":"I hope she doth","post_message":"This is criminal!"}]
