[{"comment_id":"1252245104845317","commenter_b":"So sad, the Hispanic ladies had more class then the racist. Also sad no one had the courage to stand up to her!!","commenter_a":"That's messed up. She forgot that U.S has the freedom of language","post_message":"This racist woman went off on two Hispanic shoppers with a racist rant and no one did anything to stop her. More on this story here: @webpagelink"},{"comment_id":"1544946612212472","commenter_b":"Superior to a chimp maybe.......","commenter_a":"He's such a moron! And his father has the nerve to say he has superior genes!","post_message":"What an idiot!"},{"comment_id":"10153172623814153","commenter_b":"I don't have compassion because of their careers I have compassion because I'm human","commenter_a":"How many of you would be screaming compassion if he wasn't a cop? And a history of DUI? Please. I have no compassion for anyone who drives drunk or gets into a car with a drunk driver.","post_message":"MVC Records: Officer Pedro Abad Jr., driver in deadly Staten Island crash, had 2013 DUI in Rahway. Read more: @webpagelink"},{"comment_id":"1132646906806453","commenter_b":"That hoe lowkey clean 😂","commenter_a":"Alexis Herrera Heberth Perez Johan Ramirez Luis Olmos Epi Benitez @username bet I won't 😂","post_message":"Too much sauce"},{"comment_id":"10154830329021830","commenter_b":"wow what shit if a celb said something worth hearing then ok fine but most are just fucked up losers that cry for attention","commenter_a":"Anthony Turner","post_message":"Ashton Kutcher Helps Reiterate Why Tomi Lahren & Co Are Full Of Shit"},{"comment_id":"1015046351849709","commenter_b":"Science BITCH","commenter_a":"Carlos","post_message":"Sorry folks."},{"comment_id":"10154399903958797","commenter_b":"Idiots!!","commenter_a":"And then people wonder why they are shot. First responders should be licensed to carry and use if needed.","post_message":"WHO DOES THAT?! Two people have been charged with scratching and hitting paramedics on a Red Line platform in the South Loop Sunday night. Officials say the suspects walked up and hit the responders in the face and body before spitting in their faces."}]
