[{"comment_id":"10157044490065093","commenter_b":"The only con-artist is Hillary!","commenter_a":"Wow. You work so hard to justify your position. What a word smith. What's your answer. Third party's ? Just how would that work? How would you fix it. You complain but you don't have any idea of merit to beat Clinton except trumps is wrong. A lot of us know he is a jerk and all the other adjectives. But unfortunately in life we have to make unsatisfactory choices when there are no other options. We have no other options except staying home and electing Clinton.","post_message":"\"I'm talking about his core supporters, the people who didn just enthusiastically buy his con, they helped sell it to the rest of us.\" -- David French"},{"comment_id":"10155373545461162","commenter_b":"Black Women abuse their daughters and worship their sons.","commenter_a":"GM, Giving praise to God, that the baby is home safe","post_message":"HELP FIND THIS GIRL: A 12-year-old girl went missing from the Austin neighborhood on the West Side Wednesday afternoon. Claudia Jackson was last seen about 3:30 p.m. when she left her home in the 400 block of South Laramie after she was reprimanded, police said. Anyone with information is asked to call police at (312) 744-8200. \"SHARE\" to bring Claudia home. @webpagelink"},{"comment_id":"682546678578123","commenter_b":"Historical facts, not rumors, not hearsay just plan undeniable facts. (This is just a small percentage of a much longer list ) Of the two candidates running for president... Only @username was caught lying to congress. Only @username was fired from a job for being unethical. Only @username deleted 30 some thousand emails after she was ordered to hand them over to the Fed. Only @username had that same computer wiped clean by professionals. Only @username got the rapist of a teenage girl off on rape charges then laughed about it. Only @username lied to the American people about Benghazi. Only @username lied to the American people about her emails. Only @username lied about being under sniper fire. Only @username lied about lying to the American people. Only @username was involved in \" Cash Cow \" Only @username has a long list of scandals. Only @username nationally belittled her husband's ...","commenter_a":"If you hate her so much why do you sad feckers bother to be here? And have you actually looked at Trump? The rest of the world are scared shitless that he'll get in. Oh, apart from Russia.","post_message":"Born before women could vote, Ruline just cast her ballot for Hillary in Iowa today. Join her: IWillVote.com"},{"comment_id":"10152656496006680","commenter_b":"No Hillary, 'JUST YOU!'","commenter_a":"Loretta Lynch is another clueless, racist, who will follow Eric Holder with more bad decisions, race baiting, and support for illegal aliens, as indicated by her actions on the bench and answers to questions during confirmation proceedings. She should absolutely be voted down.","post_message":"Clinton’s social media outburst comes after Loretta Lynch has been waiting for Senate confirmation for 128 days."},{"comment_id":"10153571120640779","commenter_b":"It's a bitch...","commenter_a":"Karma.","post_message":"USA Swimming, the national governing body of competitive swimming, has banned convicted rapist Brock Turner for life."},{"comment_id":"1193499157336779","commenter_b":"Poor people. Blessed to live but with these memories. Prayers","commenter_a":"Very sad! I can't imagine the horror! God bless you always!","post_message":"\"We were just about to say the prayer to be released,\" said Felecia Sanders, one of three people who survived when a gunman opened fire during Bible study at her Charleston church on June 17."},{"comment_id":"10153308747171037","commenter_b":"Failing to report 1,100 donations and $145 million in donations isn't sinister. It's just a small bookkeeping error. This is how totally out of touch this moron and his wife are.","commenter_a":"And, I did not have sexual relations with that lady, Miss Lewinski.","post_message":"Former President Bill Clinton used his first interview since Hillary Clinton announced her 2016 campaign to address questions about the Clinton Foundation - by Dylan Stableford in Yahoo Politics."}]
