[{"comment_id":"624394087751170","commenter_b":"SO TIRED OF STUPID RACISTS. !!!!!!!!!!!!","commenter_a":"Doesn't she want her peep to show? What a POS this he/she is.","post_message":"Michelle Obama suffers a humiliating wardrobe malfunction during vacation. This is hilarious. Do you agree Michelle Obama is a disgrace to America?"},{"comment_id":"653404108149099","commenter_b":"@username the wet behind your ears is showing. Now go wipe the turd stains off your teeth.....turd sucker","commenter_a":"My new hero!!!!!Trump is good on embracing bullying and hate!!! Those are the results!!! Trump should go to a nursing home already!!!!","post_message":"Here is the man who tried to kill Donald Trump yesterday:"},{"comment_id":"10150531763884999","commenter_b":"These tacky foreigners need to leave. Find another city to hide your tax-free money in. Please!","commenter_a":"Jia Ying Kho","post_message":"He may be a 'whale' at the clubs, but he's also spending millions on high-end New York real estate."},{"comment_id":"10153539209048487","commenter_b":"Oh please tell us what you know about Locheed /Martin!","commenter_a":"Cuz Lockheed Martin sucks","post_message":"The F-35 was supposed to be inexpensive, adaptable, and reliable. How did it become the most expensive aircraft in history?"},{"comment_id":"10153363483281770","commenter_b":"Vincent N Laiza. He wants to stop illegals crossing the border for 1. Tax payers are taking care of them. We can't afford them 2. Many people coming across the border are criminals. 3. Many people carrying disease and have never had vacinations 4. Terrorists are sneaking into our country. All the above items do not just include just mexicans they are going through mexico to get in","commenter_a":"Florida, Ohio, Illinois, Missouri & North Carolina lets keep winning, vote Trump 2016. Full speed ahead Mr. Trump. We will do this, vote Trump 2016!","post_message":"BREAKING: Donald J. Trump wins the Florida Republican primary.  Read more: @webpagelink"},{"comment_id":"10154244033251519","commenter_b":"So @username does not use gas. Good for you.","commenter_a":"Hey they lost a war. Get over it. Ppl been fighting ppl over land since the beginning of our time, even animals do it. What makes Indians so special?","post_message":"Salon's Charlie May was at Standing Rock as protesters celebrated the recent #DAPL news. Veterans, including Wes Clark Jr., bowed and asked Native elders for forgiveness.  Read more: @webpagelink"},{"comment_id":"612744012249511","commenter_b":"Absolutely! Prison is where she belongs for many reasons.","commenter_a":"And she should go to the one named after her husband and put in solitary confinement so we never have to hear from this troll again","post_message":"A judge just presented new evidence that could put Hillary away for good.  Finally. Put her in jail already.  Do you agree Hillary belongs in prison?"}]
