[{"comment_id":"10153184918416336","commenter_b":"never believe this man promise. that's look errr. that's look that can behead you, rape your children and take your wives.","commenter_a":"The face of evil.","post_message":"Abdul Rahman Shalabi, who allegedly served as a bodyguard for Usama bin Laden, went before a parole board to ask for his release so he can marry and have a family."},{"comment_id":"1187241994648589","commenter_b":"Clinton is dangerous to kids and adults! Lots of her associates end up dead. And she is still married to a pervert! I'm voting for Trump!","commenter_a":"Hillary could care less.","post_message":"CLINTON claims TRUMP PRESIDENCY puts KIDS in DANGER  @webpagelink"},{"comment_id":"1709641872647327","commenter_b":"I cannot believe what is happening in this country. From this moment forward, when my wife or daughters-in-law or granddaughters are in the women's room of any public facility, I will guard the door, and woe to the man who tries to enter while they are in there. There will be blood!","commenter_a":"We are full of IDIOTS in America !","post_message":"\"There isn any doubt that this law was designed to be DISCRIMINATORY ...\""},{"comment_id":"10152767737561636","commenter_b":"I'd happily punch her lights out, evil witch!!","commenter_a":"Hunt without a rifle. Even it up a bit.","post_message":"She has said she will 'never apologise' for being a woman who hunts..."},{"comment_id":"10152899941331336","commenter_b":"Sick woman","commenter_a":"This young lady will burn in her afterlife.","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."},{"comment_id":"1375338609150152","commenter_b":"It's a bit of a give and take, really. Housing bubbles are good for homeowners and sellers, but when they burst, it's good for the people looking to buy homes. Both scenarios benefit real estate speculators in their own way.","commenter_a":"The housing crisis was NOT good for average Americans. It was a terrific thing for the realty speculators.","post_message":"Trump is literally arguing that America needs a president who will act like a selfish billionaire."},{"comment_id":"1015432805157138","commenter_b":"Oh give me a break!! Rape is on a whole other level!!","commenter_a":"This is ridiculous!! He is a legend in the wrestling world. They are letting him go over something that was said 3yrs ago?!!! Shame on WWE!!","post_message":"Reportedly for racist remarks made in 2012"}]
