[{"comment_id":"668462060011039","commenter_b":"kick the racist out of here!!!","commenter_a":"Send him to Guantannamo","post_message":"A scandalous tape of Al Sharpton has been released... He's not gonna like this. Let's make it go viral. Sharpton is a complete hypocrite. Who's the racist now? Let's kick Sharpton out of America... NOW!"},{"comment_id":"10153763080696350","commenter_b":"Of course he is being dismissed.. If he wasn't, there would be another riot. She needs her butt kicked out of school.. Very tired of this..","commenter_a":"This cop was so wrong with is action I am glad he was fired","post_message":"BREAKING: Sources say that the South Carolina deputy seen flipping a student in a classroom will be relieved of duty."},{"comment_id":"1770528716571181","commenter_b":"@username you like being grabbed by the pussy,, I can see that from 100s of miles away. Lmao!!!!!!","commenter_a":"Come on. It's more like a Dr. who accidentally discloses he didn't go to med school, let alone college and is practicing without a listener and has a large number of outstanding malpractice lawsuits against him. But you still trust him.","post_message":""},{"comment_id":"10156687877045725","commenter_b":"you are 100% illegal .","commenter_a":"Yeah you've hired illegal immigrants too","post_message":"I’m the only one on this stage who’s hired people. I’ve hired thousands of people! #GOPDebate"},{"comment_id":"10158321761725206","commenter_b":"Stupid girl","commenter_a":"She initially said he wasn't armed, but then she started screaming at him \"don't do it\" as she had her camera pointed at the ground. Then she started filming them afterwards trying to cover up the fact that he was threatening the police with the gun.","post_message":"A photo has emerged in social media showing a gun at the feet of Keith Lamont Scott lying on the ground after he was shot by a police officer in Charlotte, NC."},{"comment_id":"719778928160572","commenter_b":"SHE'S a lying BITCH!!!!!","commenter_a":"Maybe for your distorted economy, sissy. It's perfect for Free Enterprise Capitalism. Just picture perfect.","post_message":"Clinton says that despite his years of business experience, Trump is dangerous and \"shouldn't have his hands on our economy.\" What do you think about her comments?"},{"comment_id":"481193578737889","commenter_b":"After the shit she did she should be quiet people that live in glass houses should not through stones!!!!!","commenter_a":"A great concept and certainly worth attempting. We pray for success and abolishing obamas illegal actions.","post_message":"Sarah Palin is starting a revolution... and Obama's first to go. She's leading the 50 states and we’re right behind her. Do you support Sarah Palin?"}]
