[{"comment_id":"828087617226661","commenter_b":"Do you think if someone wrung her neck her face would pop off???","commenter_a":"I can't see her face without wanting to punch her in it.","post_message":"A perfect example of the difference between Democrats and Republicans.  This is how they treat allies:"},{"comment_id":"10153448946523984","commenter_b":"We have a process for people to come this country and become citizens. These illegals should should not be put ahead of the people who are doing it the legal way.","commenter_a":"I'm not a crook","post_message":"Barack Obama’s bad week just got even worse...  Are you glad to see this happen?"},{"comment_id":"826509020778685","commenter_b":"LEGAL immigrants, please learn the difference.","commenter_a":"Not surprised ... Coming from a nation of immigrants, you have to be the right kind of immigrant #theyaregonnabusthellwideopen","post_message":"BREAKING"},{"comment_id":"10157848946740389","commenter_b":"The People Must Protect the Republic, since DOJ and FBI are MIA! Trump wins in a landslide; however, the polls are a lie, and her rigging election must prove the lie! It's up to us to stop it, or America becomes just another Brazil. Infowars.com","commenter_a":"By hook or crook, ain't nothing on the books that we can't cook!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154752399793598","commenter_b":"They should be called feminazists","commenter_a":"So true!","post_message":"200 Million Girls Killed in China, Where Are the Feminists?"},{"comment_id":"10155922190175725","commenter_b":"#FuckTrump","commenter_a":"Trump 2016!!!","post_message":"Watch my interview with Eric Bolling that aired today- @webpagelink"},{"comment_id":"10152587064680667","commenter_b":"Yes because white girls don't fight!","commenter_a":"maybe they should stop fighting #worldstar","post_message":"'Like white girls, they face gender stereotypes. Like black boys, they face racial stereotypes.'"}]
