[{"comment_id":"10153475674267452","commenter_b":"Illegals for a living too.. And pay taxes and guess what they don't get a refund. Securing borders? Fix the immigration system it's hard becoming legal.. The system is he problem not the illegals..","commenter_a":"Congratulations on not being an illegal immigrant and working for a living. Trump is not against immigrants he and many other Americans are against ILLEGAL immigrants. Oh and your protest in Canada doesn't mean a thing in the USA.","post_message":"In protest of Donald Trump’s immigration policies, a construction worker hung a Mexican flag atop the Trump Tower in Vancouver, Canada. abc7.la/1W7pFVh  “While working on your tower, Mexicans didn't steal anything nor raped anyone. We just did the best work we could possibly do, for ourselves, our families and the future tenants in your building.”"},{"comment_id":"10154492654832690","commenter_b":"'@username Your belief in polls probably left you disappointed on November 8th didn't it? SMH","commenter_a":"Who actually goes to an inauguration? Ask how many people are happy Obama will no longer have any control. Your poll will be more meaningful.","post_message":"Are you going to President Trump's inauguration?"},{"comment_id":"1046343315386679","commenter_b":"Can two women already have a baby? I mean in a biological way of course...","commenter_a":"Wow","post_message":"No women required."},{"comment_id":"1589593461282497","commenter_b":"What a dork...........","commenter_a":"This guy is putting himself in the same catagory as Trump when he talks this way about anyone. He could have made his point without all the cursing.","post_message":"The very end is the best part.  Thanks to The Liberal Redneck. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"562921477245254","commenter_b":"I'm so sick of that self-righteous hateful woman.","commenter_a":"Are we surprised? She's just reminding us all what a thin skinned vindictive man Trump is.","post_message":"That didn't take long. Not even a week has passed, and the president elect's team is already warning Trump critics to be 'careful' about the way they criticize Trump."},{"comment_id":"10152965639377690","commenter_b":"Evil women have already stole my soul. It's too late.","commenter_a":"Really? Really?","post_message":"Texans hold prayer vigil for Blue Bell Ice Cream after massive recall @webpagelink"},{"comment_id":"10152920340851051","commenter_b":"What we can't stand u either ghetto bitch","commenter_a":"Sad part is my son is mixed with white......I wish I could do magic and make that part of him disappear.........cant stand white racist mtfhs","post_message":"This woman decided to break up a fight by taking out her gun and shooting into the crowd. The problem is, her son was in the crowd."}]
