[{"comment_id":"10153115763853690","commenter_b":"The fundamental pillars of many so called western democracy is to build terrorist groups to fight a government that doesn't serve their needs. But guess what, immediately these terrorist got training and weapons they starts killing their masters Americans and allies. Then the next day their X masters will come out with a BLANK SPEECH called War on Terror. Well am never gona be part of any War on terror coz I never creat any terrorist. Look at Libya; they trained and armed them and later the terrorist killed their diplomat. They trained and armed Bin Laden; we all knows what follows next. They created ISIL; that one is more than I can write. Now U are creating another dead squad in Syria so what follows next no complain please. How can u call others \"Rebels\" and others \"Good Rebels?","commenter_a":"Isn't dat supporting rebellions on another country samething they accuse Russia? ?!","post_message":"Pentagon says 400 troops & support personnel will be sent to train moderate Syrian rebels | @webpagelink"},{"comment_id":"460098450844429","commenter_b":"Idiot, cite a source.","commenter_a":"Homicide and violent crime rates are down, twats. They're lower than they've been since the early 90's-you focus on \"gun murders\" instead of all murders because the facts don't back up your propaganda.","post_message":"America's big problem is lethal violence  and that's driven in large part by guns."},{"comment_id":"10153130654836973","commenter_b":"Having read the Koran and the bible, it's clear that ISIS is justified by their faith. And so where the bigoted bakers, Faith is not an excuse to treat others poorly. You say murder is never okay yet both books are full of it. You are intolerant of both the bible and the Koran. Yet you somehow think a bigoted bakers faith is an excuse? That's a double standards","commenter_a":"The intolerance level for religion on this thread is too dang high! Get yourselves together. If you're going to claim \"BE TOLERANT\" to things, you gotta be tolerant to religion also. They will always exist. There will always be someone or some thing to worship or praise. Spirituality is a great thing. It brings positivity to people's lives. There's nothing wrong with that.","post_message":"But the story isn't as simple as nature versus religion, experts say."},{"comment_id":"1258430004197187","commenter_b":"It will never happen. Hillary will win and that will be the end of America kiss your freedom goodbye and welcome Hillary Clintons new and improved America you fools!!!!!","commenter_a":"The regular polls are rigged. This is what's actually real. We need to find a way to get polls of our own. @webpagelink","post_message":"Despite getting barely any attention from traditional media, our numbers have been surging on social media.   See what the buzz is about at tonight's #GreenTownHall!"},{"comment_id":"2202427943315983","commenter_b":"@username go beat your wife old man","commenter_a":"The ole draft dodger than said McCain wasn't a war hero because he was captured in battle. Yeah he really respects our military to nominate someone who is already part of the problem with the VA. I am a Republican at heart but I'm not going to blindly follow this man like some are. Words have meaning.","post_message":"Watch: President-elect Donald J. Trump and Vice President-elect Mike Pence lay a wreath to honor the nation's fallen soldiers at Arlington National Cemetery."},{"comment_id":"999021020109368","commenter_b":"This is legislature that should ONLY be debated and decided BY WOMEN!!","commenter_a":"mayam merouane ok @username","post_message":"What a brave woman"},{"comment_id":"1704424399796624","commenter_b":"Just shows how retarded womens issues are. realsexism.com","commenter_a":"We're all getting a little over-sensitive about these non-issues, no? Politicians need to smile for likability. Likability is crucial in a candidate. It's why a sweating Nixon went down to JFK. It's why the trope of \"kissing babies\" became a thing for politicians of any level. When I think of male pols who didn't smile, they didn't do so hot. Your Bob Doles, your Ralph Naders, your Jim Webbs. All pols need to be likable, and I can remember accounts of the \"dourness\" of the above males mentioned in the news, but when it's mentioned about a woman, it's not okay? She's running for President, this is fair commentary.","post_message":"Were other (male) candidates called out the same way?"}]
