[{"comment_id":"10154318254146509","commenter_b":"Why don't you look back in G W Bush and Klinton to what they did? The difference between Russia and the USA is that the USA never asked for permission to invade any country. They just did what they wanted, and they destroyed the whole country with it's sovereignty. Another difference is - when you sea how these leaders greet \"dictators\" as they call them, with extremely wide hypocritical smile, and after a while the destroy them. Russian leader doesn't smile that much, but you get the feeling that he doesn't substitute his values and he is a person that can be trusted.","commenter_a":"Closed CAPTIONS, please!","post_message":"Five of CNN's correspondents look back at the role of Russia and President Vladimir Putin this year, and what impact there may be in the future. @webpagelink"},{"comment_id":"10153948150211680","commenter_b":"Someone has butt hurt, I'll keep licking my windows while you keep hoping for your 72 virgins.","commenter_a":"Is Trump seriously just now realizing his supporters are a bunch of window-licking water heads? Donald, you are talking to the craziest people in the country. You could literally take off your shoe mid-speech, hold it up to your ear, say you’re getting a call from Batman and they would be quiet until you hung up your shoe.","post_message":"Donald J. Trump: \"Premiums are going to go up at 116%...Unless I get elected, in which case, you won't have to worry about it.\""},{"comment_id":"10156240306950551","commenter_b":"God, this women is a beast.","commenter_a":"Then bitch move to Africa.","post_message":"This woman is RACIST!"},{"comment_id":"769219589888459","commenter_b":"i have been there over and over the last time a mexican woman tried to give my mother her baby beged my mother to take the child this is a fact and sad but if mexico is so great then way are so many comming to America","commenter_a":"Who would want to move to Mexico? In dire stress, a person could find better options than that Anti American, drug cartel controlled country. Funny how they are so anti American, but so many scramble to get here huh? The citizens of Mexico don't even want to live there, and I can't say I blame them.","post_message":"Americas Freedom Fighters"},{"comment_id":"553770641467261","commenter_b":"Who even cares what that woman thinks? She's a murderer!","commenter_a":"Fricking Amazing, right!?!?! What a POS","post_message":"Is this hypocritical? WATCH: Hillary Clinton called out Donald J. Trump for his lavish lifestyle, despite living in luxury herself."},{"comment_id":"1905981339634270","commenter_b":"O, yea...nothing to do with what a shit candidate Hillary was or the DNC rigging the primary...it's all stupid, racist, immigrant hating, uneducated fools...still don't get it do you. Bullying people you don't agree with by \"being offended\" and calling names lost y'all the election. Try a conversation without inviting your hate first, and stop listening to the alphabet news hate and fear mongers.","commenter_a":"Laura Dittmann watch this. I tell you wutttttt lol","post_message":"Donald Trump's own voters fell for a giant lie. -- Trae Crowder"},{"comment_id":"1532736620362438","commenter_b":"Cool ! I am sure he wants no more illegals!","commenter_a":"Build the wall and lock your self in there","post_message":"Donald Trump speaks live at Indiana State Fairgrounds. For a close-up view, watch our stream on our website: @webpagelink"}]
