[{"comment_id":"10153195782398984","commenter_b":"she is a witch","commenter_a":"She's a BIG box of rancid nuts , and there are plenty more in there with her !!!!!","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"1275473112509215","commenter_b":"#GrabThemByThePussy #MakingSexualAssaultGreatAgain","commenter_a":"Deplorables say don't judge Trump for something he did ten years ago yet they keep bringing up something Bill Clinton did 20 years ago. Deplorables say Hillary is an enabler for standing by her cheating husband.... But Melania is a good wife for standing by her twice divorced husband who cheated on her while she was pregnant? Hypocrisy is the running mate of Donald Trump. And sexual assault. Don't forget that. #GrabThemByThePu$$y #MakeSexualAssaultGreatAgain","post_message":"\"Everyone knows how bright she is and how resilient she is, but...they're going to see how much she cares.\" —Joe Biden"},{"comment_id":"1052489598132806","commenter_b":"A vote for Brad Thor is a vote for lying Hilary!","commenter_a":"beck cares about MONEY & POWER.he has to keep this mess up to TRY and stay in the limelight. just STOP-we want to WIN in nov. TRUMP 2016","post_message":"#Thor2016"},{"comment_id":"10154783600566336","commenter_b":"Did the first plagiarize too?","commenter_a":"Trump talked about immigrants, but first he should deport his own wife who is not even american and come here illegally","post_message":"History Quiz: Can you guess the first?"},{"comment_id":"10157124735195354","commenter_b":"They've no one to blame but themselves.","commenter_a":"Go Trump","post_message":"“Conservatives love to throw conservatives out of conservatism; it’s like an ancestral tic,” Noonan says. “But great political movements should not be run like private clubs. And have the anathemitizers noticed they aren’t in charge anymore? That in the great antiestablishment disruption of 2016 they have been upended, too?”"},{"comment_id":"10154001964165329","commenter_b":"yep these girls need to be fitted properly and get the right size!","commenter_a":"Dude half of them are in the wrong size & the VS bra featured isn't a push up, it has all over padding. This makes me want to give them all personalized lingerie sessions / lessons","post_message":"Do push-up bras actually work? And if they do, do they make us feel any better?"},{"comment_id":"1349098891770012","commenter_b":"She butchers infants, rapes ad sells and children for the sex trade and you wounder she is breaking a promise? I find it hard to understand how people still defend or are associating with her name. No amount of fluoride can explain this type of behavior.","commenter_a":"once a hi-LIAR-y always a liar.","post_message":"Breaking yet another promise: What a way to fade into obscurity and irrelevance..."}]
