[{"comment_id":"480862922104288","commenter_b":"Let them go swim in there on country. We dont need them polluteing our pools.All that goat hair will mess the pool up.You want be able to drain it.","commenter_a":"Send these people packing","post_message":"A judge just ruled that public pools must allow Muslims to swim in 'Burkinis'.  We're tired of Muslims infiltrating our country. This stops now.  Do you agree that 'Burkinis' are WRONG?"},{"comment_id":"10153952322157994","commenter_b":"Stupid young mfs","commenter_a":"#LifeinaPotHole #VOTE #GUNSENSE #VOTE #Hillary2016 #WitchHunt #BroomsUp #BlackLivesMatter #LATINOS #LGBT #WOMANCARD","post_message":"Three teenagers have been charged in the fatal shooting of an 18-year-old at Eastland Mall the day after Christmas."},{"comment_id":"10154654618245575","commenter_b":"@username are you by chance a Libetard? from cali ?","commenter_a":"The President to be mocks the loser that's really Presidential.","post_message":"TRUMP MOCKS HILLARY ON HER CANCELLED FIREWORKS SHOW! ---VIDEO"},{"comment_id":"10154046625596051","commenter_b":"Furthermore what rights will trump take? The right for illegals to get more welfare then born americans? The right for illegals to start a business 7 years tax free and hand it of to their cousin for another 7 years?? I'm hoping for hard labor and prison time for desiccating the American flag on American soil.","commenter_a":"Since when did women become thinkers with their vagina's? Surely not many women are this dumb.","post_message":"With women voters, Clinton is leading by double digits. Why do you think that is?"},{"comment_id":"1585095868182585","commenter_b":"Just go away!","commenter_a":"Isn't mental illness a sad thing?","post_message":"Oh dear god."},{"comment_id":"10153525074207994","commenter_b":"I have one get a wifeyou lesbian","commenter_a":"Gay people should respect non-gay people's Rights and don't be having sexually Haviar out in public keep it in your own home because I don't want to see it","post_message":"Pres. Obama's opening statement on #gaymarriage ruling: \"Our nation was founded on a bedrock principle: That we are all created equal.\" Watch more: @webpagelink"},{"comment_id":"1406386459390310","commenter_b":"OMG this woman is a liar and blowhard","commenter_a":"Does not matter who he picks. Cruz can not win. He will need voters in the general and he has very few of those.","post_message":"This is a big play."}]
