[{"comment_id":"370852156623268","commenter_b":"It appears that She doesn\"t know how to do anything. Maybe she can pole dance or do hoing!!!!","commenter_a":"Guevona!","post_message":"She hasn't done anything..."},{"comment_id":"10154013744111378","commenter_b":"Facepalm! So because we have rapists in this country, we should import more?","commenter_a":"No more refugees! Too many of them seem to be mentally ill.","post_message":"Olango arrived in the U.S. in 1991 as a refugee from Uganda."},{"comment_id":"10155993516865354","commenter_b":"How in da hell can a fine ass hoe like this want to go to hajji land to have a scarf put over that fine ass mug of hers","commenter_a":"what a shame. arrest them !!!","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS. Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"10153537073428352","commenter_b":"Lol she is a freak","commenter_a":"Still dont see why he should loose his life over trafficking drugs, after all he didnt commit murder. I hate indonesia and its stupid laws","post_message":"‘My life is a perfect example of an absolute waste': Andrew Chan’s haunting letter to schoolchildren around the world, warning them about the dangers of drugs"},{"comment_id":"679630052167782","commenter_b":"She needs to be deported.","commenter_a":"i think you belong over there","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"1068079936600104","commenter_b":"Most Mexicans ARE Indians....there for they are home.....my people the INDIANS OWN THIS LAND!","commenter_a":"Dems are the ones dividing the nation by spewing their judgement and hate on all those that don't agree with their views.","post_message":"WATCH: Donald J. Trump hosts campaign rally at the Fox Theatre in Atlanta. @webpagelink"},{"comment_id":"10153846163628984","commenter_b":"So invite some of those Muslim refugees into your home, fool....see how that works out","commenter_a":"The Koran speaks extensively about Jesus Christ. U fools who do not know. Look it up.","post_message":"She was riding the bus when two Muslim men starting attacking, as soon as one started stabbing her she let out four simple but powerful words that she credits to saving her life. This woman's story of survival is truly incredible."}]
