[{"comment_id":"884069771715072","commenter_b":"Remove the traitor ASAP !","commenter_a":"Yes.","post_message":"Obama Announces DEVASTATING Executive Order Right Under All Of Our Noses.  He is completely abusing his power.  Do you think Obama should be removed from the White House?"},{"comment_id":"496097670580813","commenter_b":"better yet, remove them from the planet","commenter_a":"Damn muslims.","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"},{"comment_id":"10153388655343812","commenter_b":"Ugly and disgusting! !!","commenter_a":"ridiculous looking","post_message":"Brazilian bodybuilder claims a synthetic material brought massive muscles -- but also medical danger: @webpagelink"},{"comment_id":"10154172121273010","commenter_b":"They are moving the focus to have room to build a new ranger...","commenter_a":"This is disgusting. All respect for Ford, gone. After 2 Rangers, no more.","post_message":"It's cheaper and more profitable to make the cars in Mexico."},{"comment_id":"10154496192470329","commenter_b":"Jools pls","commenter_a":"@username u at ginger boy","post_message":"Are hand jobs back and better than butt stuff? Is this 9th grade? LET THESE TWEETS DECIDE."},{"comment_id":"10156536159770354","commenter_b":"That's not a woman. It's a guy","commenter_a":"definitely a man","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"},{"comment_id":"1043008155755713","commenter_b":"To prison. Oh that's right she is above she law.","commenter_a":"It wasn't a vacation it was a paid leave of absence. Hello Obama is any body home? You work for us just like Hillary. O yeah she doesn't do anything but lie.","post_message":"Tonight is the biggest fundraising deadline yet of this campaign. It isn’t about money, budgets, or even what our competitor might raise. It’s about you and me, working together to protect and build on President Obama’s progress—making sure our country is strong, safe, and fair. If you're with me, chip in $1 right now: hrc.io/1NXINOf -H"}]
