[{"comment_id":"10153344730251130","commenter_b":"The County Clerk who refuses to issue marriage licenses to gay couples makes the same argument. This job responsibility should be no surprise to her. If she can't do it, then she needs to be in a different job.","commenter_a":"Surely she knew when she took the job that serving alcohol was part of it. Go find a job that fits your lifestyle.","post_message":"\"No one should have to choose between their career and religion.\""},{"comment_id":"10152572021501680","commenter_b":"Jew haters","commenter_a":"This is not the United States of Israel.","post_message":"Israeli officials rushed to meetings on Capitol Hill, trying to calm a furor created by Benjamin Netanyahu’s planned speech. It didn’t work. @webpagelink"},{"comment_id":"10153974201673445","commenter_b":"They don't care about you & me.Ain't it always about the buck & Greed.Karma will get those Clowns.Lawsuits are coming!! Let's put these clowns on Min.wage.We won't have to worry about them working overtime.Take away the free Health Insurance,put them on O'Duma care.Take away their pension.It's the taxpayers money.","commenter_a":"They continue to reject medical marijuana but continue to give out pain killers and other sedatives wow seriously","post_message":"VA Hospitals Will Continue to Reject Medical Marijuana."},{"comment_id":"10153090622101037","commenter_b":"It's not illegal to lie on TV !!! So why is it such a Problem?? The news media is pushing it off on Brian. Brian is representing the News Agency . Brian is not a field journalist the News Media gives the go ahead to spew out the lies of current events. What's on trial should be the publics Distaste of how the news media Ethics have been highjacked. Hopefully this is a eye-opener for most people.","commenter_a":"Who hasn't lied about something, he should still be reporting and if his rating dropped, then fire him.","post_message":"#BrianWilliams has been suspended from \"NBC Nightly News\" without pay for six months, the network announced. Yahoo News' Dylan Stableford reports. Do you agree with his punishment?"},{"comment_id":"10152926517991491","commenter_b":"A predator is a predator no matter what age they are. I'll bet kids who murder should get away with it based on naivety and hormones too right? Hormones drive alot in a human beings, including aggression, so thats an excuse I guess.","commenter_a":"Go figure. Anti-gay bigot who thinks gays are predators is a predator himself. So much self projection among the religious.","post_message":"“I would do anything to go back to those teen years and take different actions.”"},{"comment_id":"10154350204712994","commenter_b":"Have mercy. We need the capital punishment you kill you should be killed","commenter_a":"Carl. , I feel the same way .","post_message":"She was with a friend, and they got in an argument with some people at a liquor store. They left -- but the group followed them for a few blocks and then started shooting."},{"comment_id":"619633688227210","commenter_b":"Why do ugly, trashy white women date jiggers??? oH I THINK I HAVE HEARD WHY...","commenter_a":"Its amazing how hes racist agaisnt white men but not white women whats up with that","post_message":"Obama's ex girlfriend just came forward and dropped a shocking bombshell. This comes as no surprise. He can not be trusted. Are you tired of Obama's lies?"}]
