[{"comment_id":"10152988460430090","commenter_b":"Don't believe this stuuuupiiidd libtard propaganda!!!!!!! 64% of AMERICANS want the PIPELINE built l!!!!!!!!!!!!!! It will create 40000 jobs!!!!!!!!!","commenter_a":"So what that the Keystone has passed the Senate! That makes this oil no less dangerous to the American people! He has every right to veto something that only benefits 2 people, and of course those who were paid, Republicans and Democrats alike. Some \" American people\" you are! Traitors to your own land! My guess is that none of you have read about the countless oil spills going on at this moment in America and Canada. With the Keystone XXL, you get only larger amounts of oil in our ecosystems. Yellowstone already has at least 50,00 gallons of oil in it!","post_message":"The House, the Senate and the American people have spoken.  Tell Obama: DO NOT VETO: @webpagelink"},{"comment_id":"10153543401066336","commenter_b":"You illegal aliens need to self deport along with your anchor babies!!! Get Out!","commenter_a":"\"Mr. Trump's statements are offensive to all Latinos, but especially to the undocumented community,\" said Bertha Sanles, who has lived illegally in Miami for 14 years. \"Trump is focused on promoting hatred and ignores the positive economic contributions we bring to this country.\" You know what, become a citizen so you can vote.","post_message":"A resolution to condemn Donald J. Trump's remarks about Mexican immigrants failed last night to win approval of the city council in Doral, Fla."},{"comment_id":"10153227457334170","commenter_b":"Rush says Ted Cruz is one of the most intelligent people he's ever talked with.thats good enough for me.so tell old has been Pete go jump and take all the other old pretenders with him.if we r only left with the tea party just think what we could do!!!","commenter_a":"Please do.","post_message":"Pete King says he may \"jump off a bridge\" if Ted Cruz is nominated...."},{"comment_id":"551724101692742","commenter_b":"He is the Only Hope we have,,,,,,,,can't keep Letting Career politicians Destroy Our Country!","commenter_a":"Yes I do!!!","post_message":"More than half of Trump supporters say he won't be able to fix America.   Do you think Trump will be able to 'Make America Great Again'?"},{"comment_id":"1059210544118408","commenter_b":"Ramos is a Mexican so he won't listen to reason. When we lived in Temecula, Ca., our Mexican neighbors next door would go down to the Mexico/San Diego border & pick up illegals & bring them up to live in their garage!!! So I know firsthand what goes on at the border!!!","commenter_a":"Immigrants aren't the root of this country's problem. #scapegoat.","post_message":"Do you agree with Bill O'Reilly here?"},{"comment_id":"10153509889673132","commenter_b":"Is there a required dress code? Why are both women wearing the exact 2 shades of blue?","commenter_a":"I thought the Queen always wears a hat in public. I'm surprised to see her here without a hat. I love the Queen.","post_message":"Prince Harry and Queen Elizabeth II make quite the team!"},{"comment_id":"10153835564541002","commenter_b":"@username, LEAVE then!","commenter_a":"What happen to \"Land of the free\" ?","post_message":"President Barack Obama suggested maybe it's time to make voting a requirement.  Share your thoughts on this idea -- good idea or bad idea?"}]
