[{"comment_id":"691444044379507","commenter_b":"Hate Crime.. All of these black criminals are Racists","commenter_a":"This is bullshit! There's hundreds of incidents happening everyday! Want to be fair put them all up everyday!","post_message":"A white father and son were killed by two black teens and there are no riots. The media is completely one sided. Race Baiters are the problem. Do you agree Al Sharpton is the problem not the solution?"},{"comment_id":"1649676571963807","commenter_b":"Oh no she didn't, hand of God should of slap her head...","commenter_a":"I'm very proud of you and the stand you are taking for your Savior. Stay strong, and God bless.","post_message":"Teacher Demands Christian Boy Surrender His Bible, He Says No, See What Happens Next Good for him. Let's show this young Christian our support. Can we get 30,000 'LIKES' for his refusal to surrender his bible?"},{"comment_id":"1048491781950666","commenter_b":"thats the look we give when they let Kellanne dumbass talk..why they ever listen to that dumb blonde i will never understand..","commenter_a":"That is after barfing.","post_message":"So true!"},{"comment_id":"10154129472871509","commenter_b":"Shut up Muslim trash","commenter_a":"Middle East bloodshed happened due U.S invasion of Iraq. Sadam was a great leader. U.S is responsible for Shia occupation of Iraq, syria and Yamen.","post_message":"At least 30 killed after airstrikes hit wedding @webpagelink"},{"comment_id":"10154939979936729","commenter_b":"she belongs behind bars","commenter_a":"Hillary Clinton goes to a gifted-student primary school in New York to talk about the world. After her talk she offers to answer questions from the kids. One little boy puts up his hand. Hillary asks him what his name is. \"Kenny,\" he says. \"And what is your question, Kenny?\" she asks. \"I have three questions,\" he says. \"First -- what happened in Benghazi? \"Second -- why would you run for president if you are not capable of handling two e-mail accounts? \"Third -- what happened to that six billion dollars that went missing while you were Secretary of State?” Just then the bell rings for recess. Hillary tells the students that they will continue after recess. When they resume Hillary says, \"Okay, where were we? Oh, that's right, question time. Who has a question?” A different boy -- little Johnny -- puts his hand up. Hillary points to him ...","post_message":"Yes. She. Did."},{"comment_id":"10152747219056051","commenter_b":"This is soooooo wrong and why can't these cases be corrected immediately when the proof comes out. The women who do this should be prosecuted and pay for All damages!","commenter_a":"Back in 1990 I had to pay 400 a week child support for 3 kids the courts let me have custody of my oldest boy gave the ex-wife custody of the three youngest the day that we walked out of the courtroom the ex wife let me have the other three children two years later the welfare department came to me and told me that I have to pay back the last two years of u living expenses that they was giving her she forgot to tell them that she was getting 400 a week the last 2 years took me 2 years in the court system to fight it the system does not like to put women in jail so I know what you are going through","post_message":"This man had an arrest warrant issued for him and got threatened with jail time over unpaid child support. There's just one problem."},{"comment_id":"10153104580856162","commenter_b":"Them mfs is rodents. And the people who house these things are rodents too","commenter_a":"This is why you don't keep rodents as pets. Technically a ferret isnt a rodent but they are classified as meat eating predators. And who leaves a one month old baby un-attended?","post_message":"BABY ATTACKED: A 1-month-old baby lost a large portion of her face when she was attacked by 3 ferrets inside her home FULL STORY: @webpagelink"}]
