[{"comment_id":"878303132360263","commenter_b":"Just like your whore mother.","commenter_a":"That's no lady. It's a MAN !!","post_message":"Here's the ugly truth about MOOCHELLE. This is disgusting. Do you think Michelle is the worst first lady in history? Comment 'yes' or 'no'!"},{"comment_id":"1709358782672403","commenter_b":"Poor Hillary. Somebody here has mercy for her? What will do happy to Clinton? She needs an oily dildo to be happy again!","commenter_a":"Mr. Trump please get back to talking about jobs and the border problems and ignore the pundits like Matthews. You need to talk more about Cruz being an insider too. That is not stressed enough in your campaign. You can win but have to talk about what the average American is worried about. God Bless you. I will be voting for you in Pennsylvania.","post_message":"Wait until I do not have to take on 16 candidates at once. I will be Hillary's worst nightmare! We are going to WIN!!"},{"comment_id":"10153270653234091","commenter_b":"It should of been called player interference he did not slide with intent to advance to 2nd his sole purpose was to take out the 2nd baseman and break up a double play you can call it dirty call it aggressive I believe the rule says you have to start your slide before you reach the base and that he did not do . With all the new rules to protect the catchers and collisions at the plate this is no different . I believe he should be suspended . Unless you want the benches to clear every time he comes up to hit","commenter_a":"Here are the rules! Evidently, the umps didn't get that memo!!!","post_message":"UNDER REVIEW: Major League Baseball executive Joe Torre will review last night's controversial slide by the Dodgers Chase Utley that broke the leg of Mets shortstop Ruben Tejada for possible disciplinary action. What are your thoughts about the play? Read more: @webpagelink"},{"comment_id":"1128841157202139","commenter_b":"You STUPID, STUPID WOMAN. NO we as you call us\" White Folks\"are NOT going to stop saying ALL LIVES MATTER!!!. That is in no way a RACIST comment. In fact it is a very true comment. Where does all this stupidity come from. You need to read your BIBLE & pray long & hard before you start spouting these comments.","commenter_a":"NOT THE SHARPEST KNIFE IN THE DRAWER !!!!!","post_message":""},{"comment_id":"10153964560712885","commenter_b":"are you fucking dump lock that bitch UP!!!!!!!!","commenter_a":":( :( not cool","post_message":""},{"comment_id":"10154883031433010","commenter_b":"Illegal Immigrants have been paying taxes for the longest time. Look it up. I suppose you don't want that money either.","commenter_a":"Those law makers assume that all Californians want this, many of us don't want lawless immigration, no matter what country they are from. We don't like that our laws aren't being enforced and our budget and resources for our state are being given away to non-Americans.","post_message":"California's fighting back."},{"comment_id":"10154892673543690","commenter_b":"@username Yeah I get it, I'm just evil with white supremacy and global domination on my mind. Nobody with brown or black skin anywhere outside the United States is capable of doing anything wrong, because of white people, right? You're just a victim? I wasn't in the Navy, I am a Marine. But I feel like I have to defend the Navy here. There are sailors representing men and women from every race, not just whites. I guess you didn't know that. You say that the US Navy contributes to human misery but when a tsunami struck Indonesia in 2004, who was there for the rescue effort? When an earthquake struck Nepal, who was there? When a hurricane destroyed Haiti, who was there? I was there distributing food and medical supplies to desperately poor people in Ethiopia and Somalia. The US Navy prevents two-bit pirates with speedboats and AK47's from ...","commenter_a":"All I do is get up to go to work everyday to provide for my family. Ive never oppressed anyone and I Judge people based on the content of their character. I still hear all over the media how I, and people like me, are causing all the problems in this world. I suppose im just tired of it. Please tell me how being born with white skin makes me responsible for societies ills.","post_message":"Marwan Bishara: America needs anger management"}]
