[{"comment_id":"517780028410290","commenter_b":"Send them to a boot camp along with their parents, they soon will learn respect! And cut off their welfare,so tired of supporting these aminals!!!","commenter_a":"THE BOY IS A PUNK","post_message":"INSANE..."},{"comment_id":"1367333429993068","commenter_b":"^^^^ angry feminist.....who'da thunk it","commenter_a":"so much narcicism in society these days...so many women demanding to be seen as 'beautiful'....its ridiculous. And the kicker, if youre a man, and you say they are fat and unattractive then you are a 'chauvanist' or 'intolerant' etc etc etc....but you know what, why do women not go crazy over fat rotund men??? where is the fat acceptance movement for those guys? I rest my case.....no ladies, that isnt attractive.","post_message":"'These are the women you've rolled your eyes at... or joked about with your friends'  (via Daily Mail Australia)"},{"comment_id":"10152872139971130","commenter_b":"Says the bitch who makes more than most men... Lmao","commenter_a":"Says the woman who makes a million dollars a movie for acting while the teacher at her kids school makes 50k or less a year! #equalpay","post_message":"PREACH, Patricia Arquette!"},{"comment_id":"10154315697078984","commenter_b":"That whore needs to go to hell","commenter_a":"She DOES NOT HAVE THE AUTHORITY TO DO THIS. ALL WE NEED TO DO IS IGNORE HER. KEEP BUYING IT SHE WILL BE GONE IN 8 MONTHS","post_message":"Michelle Obama has been messing with our children's food for years, but now she's gone to far.  She just banned one of America's favorite cereals, and there's not a darn thing anyone can do about it.  It's time to throw her and her America-hating husband out of the White House for good."},{"comment_id":"552487634912815","commenter_b":"Your racist dumb fool he's not understanding the concept on the purpose for building the wall","commenter_a":"your not going to stop drugs coming in with a wall, they have already proven that for the last 20 years. there are inventions like aero lights, tunnels, submarines. and boat. not to mention all the ways they catapult drugs over already. your all stupid for supporting this waist of tax payer money. not forgetting all the jobs they do that you office pussys wont and can't do because you have no back bone.","post_message":"Do you agree with Bill O'Reilly here?"},{"comment_id":"1767897086815216","commenter_b":"Stfu u dummy","commenter_a":"She has to be on drugs and was coached for the interview. There is way more to this story. I've never had a cop pull a gun on me when I was pulled over for a speeding ticket.","post_message":"WATCH: ABC News EXCLUSIVE: Woman who live-streamed boyfriend shot by police in Minnesota shares her story: @webpagelink"},{"comment_id":"1677003925887340","commenter_b":"'@username, why do many Americans believe that Obama isn't concerned about protecting America? He has given no indication whatsoever that this is the case. As a matter of fact, he does just the opposite. Do you seriously believe that building a wall at the Mexican border and not accepting any refugees will do anything to stop terrorism? The roots of terrorism are not illegal immigrants or refugees. The roots of terrorism are Americas interferences in the middle east. The roots of terrorism are people who say 'bomb them and take their oil'. How would you feel if someone would say this about the USA? Terrorists can be fought with weapons but terrorism can only be fought with education. And this is exactly what Obama does. Educating people...by talking about Islam, by visiting a mosque, by saying he will stand with the Muslim Americans. That doesn't mean he hates Christians or ...","commenter_a":"Congratulations Mr. TRUMP. We look forward to seeing you here in SC. Our country needs a strong leader that's going to make this country great again. We need someone in the white house that actually is a christian, strengthens our military and will secure our borders. Take care of our people first, the great people of the United States.","post_message":"Good morning America! THANK YOU for your vote, New Hampshire! We will MAKE AMERICA GREAT AGAIN! Off to South Carolina today. Everyone have a GREAT DAY, and again- thank you!"}]
