[{"comment_id":"10153647321457235","commenter_b":"Hide yo wife, hide yo kids...","commenter_a":"Crazy people with guns, what could go wrong?","post_message":"They're advocating open insurrection.   US Marshals are not BLM and this ain't the Bundy Ranch -- and you know what that means?"},{"comment_id":"1021077537953055","commenter_b":"Stupid assbag thug asshole !! Stupid is as stupid does !","commenter_a":"yes","post_message":"Chevez Antwann Fiason wasn’t expecting this homeowner to be armed. This is why Americans have the right to bear arms. Can we get 70,000 ‘LIKES’ for the Second Amendment?"},{"comment_id":"10154406866831037","commenter_b":"give me back the days of stong America when it was 'sticks and stones that brake your bones and (words) can never hurt me' !!","commenter_a":"Weren't people just mad because people get 'artistically enhanced' to be skinnier than normal? Perhaps they should pick a side an stick to it.","post_message":"Disney's new movie has already sent the internet into a rage."},{"comment_id":"631181740405738","commenter_b":"Deport all illegal immigrants. .","commenter_a":"Yes","post_message":"Sheriff Joe and Donald Trump are joining forces to take on illegal immigrants.  It's about time someone put their foot down and stopped this madness.  Do you think all illegal immigrants should be deported?"},{"comment_id":"1061299707312818","commenter_b":"What an ass! Leave already.","commenter_a":"yah these dumbASSES are going to tell me to be tolerant with the beheading of CHRISTIANS in the MIDDLE EAST, hay DUMBass just cause a lot of people cannot believe that you are a focking muzlum dose not mean I'm going to kiss the muzlumz assss as they behead more Christians, BTW who the fock are you to tell us to be tolerant with the shayton muzlumz? name one Christian that has beheaded a muzlum this month, or this year, or even this century, you bass TURD have allowed so many innocent Christians to be killed by your demonic muzlum family, you have their blood on your hands, and their blood is crying out to GOD ALMIGHTY FOR JUSTICE. allahoooo ACHK BARR and GRILL YOU FOCKING BASS TURD.","post_message":"The Obamas have always gleefully kicked Christians to the curb during Christmas. This year was no different."},{"comment_id":"10152956045287093","commenter_b":"Don't leave the drawers open","commenter_a":"'@username pretty sure this is my dresser lol","post_message":"RECALL ~ IKEA is recalling 27 million adult & children’s dressers because of a tipping hazard…2 toddlers were killed when their dressers tipped over on them… @webpagelink"},{"comment_id":"1779215949028239","commenter_b":"#Fuckhillary #Neverhillary #Nevertrump","commenter_a":"#neverhillary","post_message":"Matt Lauer asks Hillary Clinton about the qualities that make her qualified to become Commander-in-Chief.  More coverage on @webpagelink"}]
