[{"comment_id":"10154594345964749","commenter_b":"@username leave arab countries ask you governments to stop killing people there . and the immigrants will go back","commenter_a":"I think the comment has to be taken into context... Looking at Hungary's demographics, Muslims don't even account for 0.1% of the population. The politician is probably representative of the general public mood there. Although in a more colourful tone!","post_message":"The Hungarian politician was described as “a sad old man full of hate” and his comment was branded as “disgusting”."},{"comment_id":"981590648554229","commenter_b":"Let me know if you need any help doing actual research, as opposed to just spouting off your uninformed opinion, Skatie.","commenter_a":"Of course, Mother Teresa was NOT talking about abortion when she said that, she was talking about child poverty.","post_message":"Mother Teresa gets it right! What do you think?"},{"comment_id":"10155391516626729","commenter_b":"make the bitch donate it to charities or homeless people","commenter_a":"Green Party = Communist, it is all about the money","post_message":"Probably the objective all along."},{"comment_id":"1518802311757226","commenter_b":"For people illegally here","commenter_a":"Especially if you are anyone other than the WORKING CLASS !!","post_message":"President Obama just addressed Donald Trump in a not-so-subtle way. Do you agree with the president?"},{"comment_id":"10152771119936051","commenter_b":"Lady, when in America, do as Americans do. Our country was founded on a theocracy. Deal with it.","commenter_a":"Happy to hear it! American laws and rules apply here. NO others. Don,t like it then leave!","post_message":"This woman demanded that she be allowed to swear on the Quran before testifying. Well, she got her answer."},{"comment_id":"10153325338244342","commenter_b":"Stfu Lilia Jimrnez....you dumb woman","commenter_a":"So are we going to start killing police, getting revenge and causing a war in our country? Or are we actually going to try and solve these problems between police and the people they are supposed to be trusted to protect.","post_message":"Hundreds of people are expected to attend a prayer walk slated for Sunday night in northwest Harris County to remember Harris County Deputy Darren Goforth. #abc13"},{"comment_id":"10153782670984838","commenter_b":"Then why are they acting like children when they run around sleeping with random people getting pregnant when they don't want a baby in the first place? So yes those women are children since they don't know how to have safe sex.","commenter_a":"Absolutely ridiculous!! Women are not children.","post_message":"A bill that would impose a 24-hour waiting period on women seeking an abortion is headed to Republican Gov. Rick Scott."}]
