[{"comment_id":"1371649186228159","commenter_b":"There's a Q now, what does that stand for?","commenter_a":"They absolutely deserved it. As a proud member of the LGBTQ+ community I am shocked at half of these comments. You show that crown off with pride honey because you really deserved it.","post_message":"Hateful backlash from jealous female classmates angry at being beaten by a 'boy'"},{"comment_id":"946413835412782","commenter_b":"100% on welfare and too lazy to work. Their freebie food gives them energy to cause protests and riots all the time.","commenter_a":"I wonder if George Soros is funding any of these BLM people. He funded the protesters at Ferguson and Baltimore. Same faces running around protesting....","post_message":"Grassroots Activists Push Black Lives Matter Thugs Off Of Michigan Ave [Video]  This is what the main stream media DIDN'T show you..."},{"comment_id":"10154437809561491","commenter_b":"Sorry, no. She is front and centre in this kangaroo court of #45. She cannot have it both ways.","commenter_a":"Let the woman live her life. Sure, I cannot stand Donald Trump to save my life. But what is going to set us apart him? We do not judge people based off of the behavior of someone else. That's what being a liberal is all about. Acceptance of each and every person on the basis of their individual character.","post_message":"The Internet is not happy with the latest post by Ivanka Trump's brand."},{"comment_id":"10153976851960950","commenter_b":"Hillary husband, Bill Clinton, makes Bill Cosby look like a Saint.....","commenter_a":"Bring it baby. I used to feel sorry for Melania, but she is as bad as her bully pervert of a husband. All Trump cares about is his money. All Melania cares about is Trump's money.","post_message":"She is demanding a retraction and apology."},{"comment_id":"1174478745905487","commenter_b":"The hormonal teenager that's checking people's bags is supposed to make us feel secure?","commenter_a":"I would rather be inconvenienced than shot why I watched a movie","post_message":"The chain said the procedure would inconvenience guests but provide better security."},{"comment_id":"10152528871250667","commenter_b":"What union???","commenter_a":"They get enough through their union","post_message":"President Obama will call on Congress to require companies to give workers up to seven days of paid sick leave a year, a senior adviser said Wednesday. Obama will also take executive action to give at least six weeks of paid leave to federal employees after the birth or adoption of a child."},{"comment_id":"1319359411443456","commenter_b":"LOL...she needs to put her fake boobs away....","commenter_a":"Totes newsworthy!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
