[{"comment_id":"10153269973986167","commenter_b":"Enjoying your tax Magnus rates? And how many refugees and immigrants are you valuing?","commenter_a":"As a Scandinavian, I don't know if I should laugh or cry on your behalf....","post_message":"An actual question from last night's #GOPDebate"},{"comment_id":"1204517232921065","commenter_b":"he's not alone. He has a lot of support!","commenter_a":"He is not alone..he has millions on his side... You got this Mr President..","post_message":"Can Trump do this alone?  @webpagelink"},{"comment_id":"10154137971976323","commenter_b":"You cannot stop it, it's a done deal. The pacific couldn't stop the TPPA, North Americans couldn't stop NAFTA. These deals are done above our heads, I very much doubt you would be allowed to leave the EU even if you wanted to.","commenter_a":"Have you read the EU's conditions on public services they want within TTIP? It looks to me as though these would offer considerable protection to NHS services; are we sure that our Government would have similar protections? See @webpagelink I was very much against TTIP and concerned about EU position until a colleague brought this to my attention.","post_message":"\"If being in the EU has brought us TTIP, it has also brought us the means to stop it.\""},{"comment_id":"10152869187276336","commenter_b":"Yes ... where ??...","commenter_a":"Islamic Cleric: \"Islam is Not a Religion of Peace!\" www,thetrumpet.me","post_message":"In Thursday’s Talking Points Memo, Bill O'Reilly asked: where is America's policy to fight the Islamic jihad?  Watch and weigh in: @webpagelink"},{"comment_id":"10153006139081602","commenter_b":"I think it would help lessen the burden on other welfare programs, if some benefit recipients were getting educated and coming off programs.","commenter_a":"Better to pay for this than all the bums on welfare and any state run handout that people take advantage of.","post_message":"Two years of community college could now be free for all, according to a plan President Obama is scheduled to propose Friday."},{"comment_id":"10153917559886770","commenter_b":"Nah, her girl fans drink boiler-makers.","commenter_a":"Amy Schumer fans do not drink beer. They drink fruity drinks with umbrellas in them. And her female fans drink those, too.","post_message":"This doesn't sound good...."},{"comment_id":"1244871155548303","commenter_b":"You ain't going anywhere you f. Ing. Liars.......where u gonna make your money.....u should feel lucky that this is the only bonehead country that would pay your assets to do anything on film!!! BIG FAT LIARS......THEY R WHAT THEY IS !!!!!","commenter_a":"Yea.........see ya","post_message":"The last slide Don Jr. has a nice surprise for all of them!"}]
