[{"comment_id":"1272631619499754","commenter_b":"There are hundreds of billions of untaxed dollars, probably trillions going to Mexico every year through the boarder in drug profits. An effective wall and boarder security will prevent tons and tons of drugs from coming in, as a result people wont be able to buy as many drugs so the money they would normally be using to buy drugs will be spent on other things that will help the economy. So not only will it prevent drugs from coming in but it will prevent billions from going out to Mexico and that money instead will be cycled through the US economy and taxed every step in the cycle. This wall will also help clean up the drug abuse problem our society has and save many lives to overdose and drug related violence. Not to mention illegal immigrants not paying taxes but also sending their extra money back to Mexico. ...","commenter_a":"LOL..heck he doeesn't even know what he is talking about how can he keep up with himself...just hilarious to watch each day what has changed. Ya know, I think his hairdresser is leaving the bleach on too long and it is affecting his brain..just a thought.","post_message":"As the Trump campaign tries to pitch minority voters, Donald J. Trump's  position on immigration seems to keep changing."},{"comment_id":"10154169270413908","commenter_b":"Tony 'Osman' Andrews","commenter_a":"Ups, that was ,me...:)","post_message":"For those of you who are unaware of this observatory, it's captured some fascinating shots of unexplained aerial phenomena."},{"comment_id":"10156716294680725","commenter_b":"Trump is a scum bag who steals from Veterans!!! @webpagelink","commenter_a":"Never liked Cruz and I thought Rubio seemed like a nice guy. Not anymore...give em hell @username, your the only man that can pull this off. You have had my vote from the beginning.","post_message":"THANK YOU #TrumpTrain! Lets make it a great day! Preparing now for rally at Macomb Community College- here in Michigan!"},{"comment_id":"1088416937887089","commenter_b":"The bill won't pass....however, illegals vote any way. There are organizations who are illegally registering them. Absentee ballots are also one of their goals.","commenter_a":"The American people doesn't want this law to pass..it is unfair to the American people! !!!! They dont pay taxes and most doesn't even speak English. ..They dont have a right to vote....And they shouldn't get any kind of welfare either....","post_message":"THE PARTY OF CRIMINALS: New Bill To Give Illegals Right To Vote!  Do you agree Illegals have NO rights, especially voting rights!?   @webpagelink"},{"comment_id":"872258432910129","commenter_b":"Really Kathy? I can't believe any woman would ever even think of voting for the dumpster","commenter_a":"If you vote Hillary, you're voting for babies to be murdered, etc. She needs to stay home and clean house. She can't even do anything with her husband. How can she run a country.","post_message":"WATCH LIVE: Former NYPD commissioner talks about election day security  — who will win, Donald J. Trump or Hillary Clinton?"},{"comment_id":"10155119419651320","commenter_b":"Looks pumping","commenter_a":"THE ISSUE IS NOOOOTTTTT MUSLIM!!!!!","post_message":"Democrats hold an anti-Trump protest in Washington D.C."},{"comment_id":"1723943734489970","commenter_b":"Not only ridiculous, but stupid. What did Muslims have to do with the Holocaust? There far more people that are not offended by things that offend the Muslims. It is still our country, who make only one race happy all the time. Leave this alone and it may just prevent the horrible era from ever happening again. God please help us.","commenter_a":"WRONG!!!","post_message":"Schools Are Dropping The Holocaust From History Lessons To Avoid Offending Muslims. Things are getting ridiculous. Do you think this is wrong?"}]
