[{"comment_id":"693348717485384","commenter_b":"Someone beat his ass.......again.","commenter_a":"A disgrace to the American oeople...Harry Reid you are way, way past your usefulness, so why don't you just go home","post_message":"SEN HARRY REID (D) UNLOADS ON THE SENATE FLOOR HATE SPEECH AGAINST TRUMP (VIDEO)  @webpagelink"},{"comment_id":"563855710491041","commenter_b":"Such a PIG","commenter_a":"POS!","post_message":"His response is simply \"deplorable.\""},{"comment_id":"10154994136091800","commenter_b":"He probably knee jerked so hard he got a bloody nose and blames it on picking it too much!","commenter_a":"Trevor Noah is a puppet... Go back to south Africa where division is welcome stop trying to divide my country with your shitty humor... #Bringbackstewart","post_message":"The Daily Show recaps President Trump’s flurry of executive orders."},{"comment_id":"919874341467572","commenter_b":"WOW...THAT IS A AWESOME BEAUTIFUL PICTURE...GOD BLESS YOU ISRAEL...","commenter_a":"Beautiful!!!","post_message":"#TelAviv by Chief Eran Yerushalmi  #PicoftheDay #Israel #Beach"},{"comment_id":"1734000846853202","commenter_b":"Yes","commenter_a":"That they do!","post_message":"“When the left starts to lose, they break the law.”  Do you agree with Newt Gingrich?"},{"comment_id":"916716405122968","commenter_b":"@username your name says it all!","commenter_a":"someone needs to mention the senior citizens in this country. We have not had a COLA raise for two years. BS. We might be old, but WE VOTE!","post_message":"Miners have one last shot in this election - the coal industry will be nonexistent if Crooked Hillary Clinton wins the presidency this fall. It is time to MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10152525662890047","commenter_b":"So if God was in America, there would be no border, or ISIS problem? Just how would that happen?","commenter_a":"We need God in America!!!!!!!!!!!!","post_message":"ISIS poses a real threat to the United States, and a large weakness in our security is our porous borders.   Sign & Share our petition to protect the American people from the ISIS threat:  @webpagelink"}]
