[{"comment_id":"10156148528265725","commenter_b":"Trump has the mentality of an 8 year old class bully","commenter_a":"Suzanna Mikolajczak Trump is a Beast","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."},{"comment_id":"1297466373615674","commenter_b":"HOW CAN ANYONE VOTE FOR THIS WOMAN WHO IS SO BLATANTLY FOR THE SUPER RICH !","commenter_a":"GO BERNIE !!! YES ... we surely need to implement a nationwide ban on this problem will destroy our only livable planet, Hillary support fracking... That's totally unacceptable and she is unfit to be pres.","post_message":"Fracking is a reckless, destructive and expensive practice and we must put an end to it all over this country. Add your name to say you support preventing the worst effects of climate change through the Keep it in the Ground Act."},{"comment_id":"885286484921464","commenter_b":"This woman is delusional.","commenter_a":"Bat shit crazy","post_message":"ClashDaily.com"},{"comment_id":"10153647518861350","commenter_b":"This is 100% a mental illness! We would never approve of someone cutting their right hand off b/c they decided they had to be a lefty. So why in the world are we letting these people mutilate themselves?!! It's not about sex it's about the brain. They need help!","commenter_a":"The man with the sign in the background has the heart of the issue correct: girls' rights matter! No way would I want a confused young man using the same bathroom at school as my daughter. These young men and women need help. I have compassion for them because they are confused. Steer them towards counseling and mental health treatment. Caitlyn Jenner isn't a hero. I don't buy the \"if it saves one life\" act. The fact is the majority of suicides in transgenders occur AFTER they've made the devastating and disastrous choice to destroy their own bodies as God created them. They need treatment BEFORE they get to that point, not someone telling them they're fine as a woman when they were born a man or vice versa!","post_message":"\"I'm not the only transgender person at my school, and I won't be the last.\""},{"comment_id":"10154367782019071","commenter_b":"@username...you go girl!","commenter_a":"there u go again with ur propaganda...trying to launch a smere campaign on donald trump..main stream media is pathetic..lol","post_message":"Before becoming Donald J. Trump's chief strategist, Bannon wanted to make a movie with Mel Gibson."},{"comment_id":"589804961210083","commenter_b":"If they don't like it then they can suck chuck","commenter_a":"Love my Marines.","post_message":"These Marines make huge stand and show Muslims they're not afraid. Love it. We need to spread this and show these Marines we have their back. Do you support our troops?"},{"comment_id":"10153329720368701","commenter_b":"They should drop the drinking age to 18 instead. Only Islamic countries are as strict as the US when it comes to drinking age. Raising the tobacco age will simply result in sneak smoking just like raising the drinking age resulted in binge drinking. Adults need to be adults.","commenter_a":"how about the state legislature concentrate on what it was elected to do: keep a balanced budget and not waste taxpayer money.","post_message":"What do you think, should Oregon and Washington follow suit?"}]
