[{"comment_id":"1724806041088528","commenter_b":"@username don't be angry at @username because your ignorant.","commenter_a":"And THAT is why we need @username more than ever. With a life-long career of public service, having been a successful Senator and Secretary of State, and more than tough enough to continue the legacy of Obama, no one is more qualified. #Hillary2016!","post_message":"“The presidency is not an entry-level position.”"},{"comment_id":"10153357244917061","commenter_b":"She should be a shame of herself. A doctor, would not want her to treat me.","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."},{"comment_id":"954186131315786","commenter_b":"Her being revealing? Do you think she picked out the dress herself and made a conscious choice to show her nipples?","commenter_a":"To be so revealing when so young is certainly extremely questionable moral territory.","post_message":"Too young?"},{"comment_id":"470909953099585","commenter_b":"Every state should step up and protect our America, muslims can keep their beliefs to themselves, ban Shariah Law in all 50 states!!!","commenter_a":"WTF","post_message":"Muslims trying to force Shariah Law on Alabama just got owned. Good. We won't stand for Shariah Law in America. Do you agree this should happen in all 50 states?"},{"comment_id":"1787141981532253","commenter_b":"COME ON! Lock this \"thing\" up already!!! People have spent major time in prison doing FAR LESS than she has.","commenter_a":"It honestly doesn't matter to voters or our govt how bad she was and what she did or if she is a criminal. They just don't want Trump so they will be so stupid and vote for her. She is going to win and it will be game over for our nation and sovereignty.","post_message":""},{"comment_id":"822069341254814","commenter_b":"Two egocentric over weight idiots !","commenter_a":"The best news I have heard for I would have voted for Christie and Trump I know can get us back on track for our money and bill problems. way to go Christie hope you make vice President what a great team you two would make for America.","post_message":"Thank you Governor Chris Christie! It is time to MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1033723873315290","commenter_b":"Brian Feltman feltman","commenter_a":"THE MINNOWS CLING TO THE FLOTSAM","post_message":""}]
