[{"comment_id":"1457021290993798","commenter_b":"Bullshit they need to put her ass in prison","commenter_a":"jesse doesn't want her next to him at the gallows","post_message":"But, but...I thought she was innocent, Jesse?"},{"comment_id":"10153596201678984","commenter_b":"Absolutely Support him. He has every right to refuse and shouldn't be forced to preform a same sex marriage if it's against his beliefs!!","commenter_a":"I am supporting the judge who didn't marry the same-sex couple. If gays and lesbians demand justice they also should let those who differ in thought the same right to practice what they believe instead, of trying to force someone to commit something that goes against what they belief..","post_message":"This judge's response has him in hot water. You'll be surprised when you learn his background, then when you see who stepped in for him -- you'll be even more surprised. A totally backwards scenario from what you'd expect... Do you support what this judge did?"},{"comment_id":"10152844274493525","commenter_b":"Burn the witch!!!!!!!","commenter_a":"good....now put him to sleep!","post_message":"The 30 verdicts for Dzhokhar Tsarnaev in the Boston Marathon bombings trial are as follows: Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty."},{"comment_id":"917667135033132","commenter_b":"The ignorance of this bitches statement is mind boggling","commenter_a":"No McDonald's worker anywhere on this planet deserves anything But minimum wage... How are you gonna demand a higher wage but you cant even make sure there are fries in the bag with my order.... Always giving people the wrong shit, no sauce, no straw... Please pull up and wait at our drive thro becuase we cant make fast food fast enough.... Get the fuck outta here... Give that extra money to doctors or something... They cant fuck up or your dead..... Absolutely ridiculous... Fast food isn't a damn Career.","post_message":""},{"comment_id":"1432027056824713","commenter_b":"PUSSY","commenter_a":"Canada doesn't want these idiots any more than we do.","post_message":"Progressives always break their promises."},{"comment_id":"10153147282168701","commenter_b":"Shut up Leah Jesus Christ.","commenter_a":"GUILT BY ASSOCIATION! I GUESS IN AMERICA YOU CAN BE HELD RESPONSIBLE FOR WHAT OTHERS DO, I THOUGHT YOU WHERE INOCENT UNTIL PROVEN GUILTY, BUT THE WHORES OF SOCIETY-AKA THE NEW STATIONS, REPORTERS, OREGONIAN, HAVE TRIED, COVICTED, AND SENTENCED A MAN FOR CRIMES HIS GIRLFRIEND COMMITTED, SOME PRIOR TO THEM EVEN MEETING BUT SOME HOW IT IS HIS CRIME, SHAME ON YOU WHORES!!!!","post_message":"Here's the full resignation letter from Gov. John Kitzhaber, who says: \"I understand that I have become a liability to the very institutions and policies to which I have dedicated my career and, indeed, my entire adult life.\""},{"comment_id":"10153094131986378","commenter_b":"Nothing is going to happen to this so called mother ...because if a white judge sentenced her to prison..she'll pull the race card.......","commenter_a":"Can we leave her in a hot car???","post_message":"TODDLER LEFT IN 117-DEGREE CAR: An Arizona mom has been charged with child abuse after surveillance video showed her leaving her toddler locked inside a hot car while she went shopping at Walmart. See the surveillance footage:"}]
