[{"comment_id":"383422335172981","commenter_b":"There are laws and then there is right and wrong. When you factor out people from the laws, you create an inequity that needs to be handled as Solomon did --- One case at a time. Many years of productive residency DOES erase the fruit of the poisoned tree --- that she came here against a statuary law. Laws were made to cope with inequity. We have immigration laws because we feared overpopulation by the poorest people in the world who would want to come to the \"land of opportunity.\" But, when someone comes and contributes to our fabric, we need to weigh that against a rule made to prevent, in her case, something that doesn't exist.","commenter_a":"The first step in holding conservative views on immigration is that they can't view anyone who might be affected by bad immigration policy as fully human. That's the problem. They've successfully dehumanized Hispanic people so they simply don't care.","post_message":"Now she has the opportunity to apply to stay here legally."},{"comment_id":"467147946806146","commenter_b":"Gary McGowan, an interesting read!","commenter_a":"That headline...shame on you, @username.","post_message":"\"When we get the wrong answer, in medicine, that not a matter of academic sophistry  it causes avoidable suffering, bereavement, and death.\""},{"comment_id":"912811708762070","commenter_b":"Carole finally you sound like a smart girl see you're not an Idiot after all. I like that kid Rubio. send all illegals home including Obama. By the way carole you look like the nurse who use to work for me she was an idiot but she was nice to my patients.","commenter_a":"Since voters usually vote for charisma instead of experience and intelligence, I would expect Rubio to be the greatest challenge.","post_message":"We’re now a little more than a year away from the 2016 presidential election and Hillary Rodham Clinton, long-time Democratic front-runner, has set her sights on the Oval Office. Who in the potential Republican field can beat her? Take our poll. @webpagelink"},{"comment_id":"1145710305499191","commenter_b":"Women are insane! All of them!","commenter_a":"Omg Daniel Melchior","post_message":"This woman has said her ex-fiance hit her, causing a black eye and other injuries. But now his attorney says this home surveillance video tells a different story.  STORY: fox32chicago.com/news/@username-story"},{"comment_id":"932180273594983","commenter_b":"So these women thought it would be cute to be \"bad mom's\". It's a sad world we live in.","commenter_a":"Selfish mothers. Women who should not have children.","post_message":"\"No one had communicated that children under six were not allowed in R-rated movies,\" one of the moms said. \"We had breastfeeding moms with infants, one 4 weeks and one 7 months, and they refused them entry.\""},{"comment_id":"10153035798681336","commenter_b":"Do you support PETA? They are know as animal killers! And it's part of their manifesto!","commenter_a":"I don't support circuses just for the reason that they are notorious for abusing animals.","post_message":"Ringling Bros. and Barnum & Bailey Circus will phase out the show's iconic elephants by 2018 because of growing public concern over how the animals are treated."},{"comment_id":"10153256294124726","commenter_b":"Deport that illegal!","commenter_a":"Put them all on a boat back to Africa and sink it","post_message":"WATCH: Obama on Baltimore: \"Too Many Instances\" of Police Target Poor African Americans"}]
