[{"comment_id":"10153789938206680","commenter_b":"yes there is, put her in jail.","commenter_a":"Former 'Bush' defense official??? Go figure!","post_message":"The United States' adversaries, James Clad says, 'must never hear flippancy or ignorance in America’s voice.'"},{"comment_id":"10158795471470206","commenter_b":"My smartphone is a machine-gun!","commenter_a":"Journalism....there's the headline, then there's the complete opposite being stated in the article. Maybe the journalist just didn't understand that big word 'refuted'.","post_message":"The Superior Court of Justice decided to punish the players for failing to play their match."},{"comment_id":"10153952706726323","commenter_b":"Show the UK the door Lol! We want out and you to go home.","commenter_a":"7 years in England and I have never met an English person that defined themselves as European, British when they want to show how broad their borders can be. We don't even share the same values, we interpret our history in a completely different way. They made of us a 'Brand', neglecting our own background, dignity, honesty, skills, and so on... unless you speak as they do, or you are a CEO,CFO, any kind of abbreviation really will do...only then you will be treated nearly as an equal. Dear Europe, do not succumb to this hypocrisy and show them the door.","post_message":"'I have negotiated a deal to give the UK special status in the EU. I will be recommending it to cabinet tomorrow'"},{"comment_id":"804496683016845","commenter_b":"Fuck pigs","commenter_a":"Beyonce fine do your protest but don't be a hypocrite and be escorted to the stadium by law enforcement. Let the Black Panthers escort you. Don't half ass protest, walk the talk all the way and if you can't then STFU","post_message":"This RACIST liberal meme claims complaints about Beyonce's Superbowl are proof of white privilege and an aggression against blacks. But as usual the left gets it totally wrong and proves they know NOTHING about history.  We take this vile meme and destroy it with historical facts!"},{"comment_id":"1788613674701059","commenter_b":"Shut up hoe","commenter_a":"It amazes me how rude some of you people can be . They're having a fucking child! Like come on now , stop being so immature talking about ' he's carrying the baby , ' or ' his girlfriend looks like a man'. Smh people 😒😑. Congratulations Dj Khaled & Nicole Turk ❤️","post_message":"Baby Alert!"},{"comment_id":"636925316432507","commenter_b":"Fuck yeah, good on them we don't need those greedy pigs.","commenter_a":"Hungary - home country of George Soros, He's a Hungarian Jew.","post_message":"The head of Hungary’s central bank has called for the International Monetary Fund to close its office in Budapest."},{"comment_id":"1264368863598532","commenter_b":"GO straight to HELL...","commenter_a":"God has His own way to handle Him. This man is no match for God.","post_message":"This is why Trump won!"}]
