[{"comment_id":"765077356935066","commenter_b":"Gef mir.","commenter_a":"Amen term limits","post_message":"Bernie Sanders is 73, Joe Biden is 72, Chuck Grassley is 81, Barbara Boxer is 74, Nancy Pelosi is 74, Harry Reid is 75, John McCain is 78, Diane Feinstein is 81. Mitch McConnell is 72, Orrin Hatch is 80, Richard Shelby is 79, Carl Levin is 79, Jim Inhofe is 79, Pat Roberts is 78, Barbara Miklski is 77, Jay Rockefeller is 76, Thad Cochran is 76, Tom Harkin is 74, Patrick Leahy is 73, Lamar Alexander is 73,  Bill Nelson is 71.Charles B. Rangel is 83. In the last 30 years, the number of Senators in the Senate for 20 years or more has tripled. Senility and seniority are not serving us well. (some are now older than listed)  The 50 richest Congressmen and women reported a minimum net worth of at least $7.4 million in 2013, Roll Call discovered in it's review. That represents a steep increase from the $6.7 million benchmark set in 2012.  Wealthiest Members of Congress.  California Rep. Darrell Issa (R): $357.25M  Texas Rep. Mike McCaul (R): $117.54M   Maryland Rep. John Delaney (D): $111.92M   West Virginia Sen. Jay Rockefeller (D): $108.05M  Virginia Sen. Mark Warner (D): $95.13M  Colorado Rep. Jared Polis (D): $73.56M  Connecticut Sen. Richard Blumenthal (D): $62.06M  California Rep. Scott Peters (D):$45.04M  California Sen. Dianne Feinstein (D):$43.72M  Washington Rep. Susan DelBene (D): $37.89M  Florida Rep. Vern Buchanan (R): $37.15M  Maine Rep. Chellie Pingree (D): $34.47M  California Rep. Gary Miller (R): $32.97M  California Rep. Nancy Pelosi (D): $29.11M  Ohio Rep. James Renacci (R): $28.08M  Texas Rep. Roger Willams (R): $28.01M  Florida Rep. Alan Grayson (D): $26.18M  New York Rep. Chris Collins (R): $22.50M  New Jersey Rep. Rodney Frelinghuyson (R): $22.21M  Tennessee Rep. Diane Black (R): $21.24M  Massachusetts Rep. Joseph Kennedy III (D): $20M  Idaho Sen. Jim Risch (R): $19.24  Tennessee Sen. Bob Corker (R): $19.12M  Missouri Sen. Claire McCaskill (D): $18.38M  Wisconsin Rep. Tom Petri (R): $15.64M  New York Rep. Richard Hanna (R): $15.3M  Arizona Sen. John McCain (R): $15.17M  North Dakota Sen. John Hoeven (R): $15.16M  Florida Rep. Curt Clawson (R): $13.53M  Wisconsin Rep: Ron Johnson (R): $13.52M  Wisconsin Rep. Jim Sensenbrenner (R): $13.04M  Kentucky Sen. Mitch McConnell (R): $11.97M  Iowa Sen. Tom Harkin (D): $11.85M  Illinois Brad Schneider (D): $11.71M  Texas Rep. Lloyd Doggett (D): $11.51M  Tennessee Rep. Jim Cooper (D): $11.51M  New York Rep. Nita Lowey (D): $11.48M  Virginia Rep. Scott Rigell, (R): $11.29M  Arizona Rep. Trent Franks (R): $11.01M  California Rep. John Campbell (R): $10.21M  North Carolina Sen. Kay Hagen (D): $9.12M  Louisiana Rep. John Fleming (R): $9.06M  Georgia Sen. Johnny Isakson (R): $8.93M  Georgia Rep. Tom Price (R): $8.87M  Ohio Sen. Rob Portman (R): $8.60M  Pennsylvania Rep. Mike Kelly (R): $8.51M  Texas Rep. Kenny Marchant (R): $8.13M  New York Rep.Carolyn Maloney (D): $7.73M  New Mexico Rep. Steve Pearce (R): $7.72M  Florida Rep. Tom Rooney (R): $7.47M  Source: Roll Call"},{"comment_id":"10154635406324726","commenter_b":"'@username Cowardly weasel!","commenter_a":"I keep reading all these allegations of her but nothing happens. Apparently a revolution against the government is inevitable?","post_message":"Emails suggest Clinton removed diplomatic security officers so private-charity aides could hitch a ride."},{"comment_id":"1111328388897763","commenter_b":"Grow a set you whinny little pussy!","commenter_a":"In America we all have the right to support which ever candidate we choose! Why be afraid God is on your side! I choose Trump! We have that right in America! I do think the present government in America is creating all this fear and I will vote Republican. If you don't want to abide by our Constitution and Congress Approved Amendments maybe you don't belong in America. IN GOD WE TRUST. WE WANT OUR AMERICA GREAT AGAIN","post_message":"'I don’t deserve to feel afraid at my school,” said another student."},{"comment_id":"10154233003321336","commenter_b":"'@username criminal actually the first foreign language spoken by illegals immigrants in the usa territory was English","commenter_a":"Donald Trump he's making our nation the laughing stock of the world but he is not the problem apparently in the usa there are a legions of racists misogynistics and fear filled ignorant people just waiting for a voice of lead and release them ,, he is not our shame the idiocy of some of our citizenry is our shame","post_message":"'I've spent less money than almost anybody else and I'm in first place by a lot.' – Donald J. Trump"},{"comment_id":"1422508754431832","commenter_b":"Yes","commenter_a":"Yes, totally!!","post_message":"Should Washington require drug testing for unemployment benefits?   A. Yes.  B. No, it's spending a lot of money on little gain  C. This is a bit unfair for states that legalized pot  D. Only for those who lost jobs to drug use E. Enter your own anwser"},{"comment_id":"10153163723737377","commenter_b":"She belongs in jail!","commenter_a":"And Huma's email said something about after her nap. Seriously this evil woman is too old to hold the highest office in the United States of America!!!!","post_message":"'These new Benghazi emails are disturbing and show why Hillary Clinton and the Obama administration had to be forced to disclose them,' said Judicial Watch President Tom Fitton in a release to Newsmax. Watch more on this tonight on Newsmax TV- Directv 349, Dish 223, Verizon FiOS 115, or Newsmax App."},{"comment_id":"10157758385010725","commenter_b":"Hillary is a crimnal so are the Radical Muslims and the Fence jumpers deport them all Wait for it","commenter_a":"aye lmao","post_message":"Thank you for the great 'TRUMP' welcoming, Virginia! I realize that takes a lot of time & coordination - and I am grateful to you all, for your support! -DJT"}]
