[{"comment_id":"1201604966547026","commenter_b":"Mortified to be in the vicinity of a penis? Why? You wouldn't be mortified surrounded by vaginas. Why is one suddenly more shocking than another? There's probably at least one lesbian I a crowded changing room and there's a good chance that the transgender woman prefers men. I understand being on guard I do. But not why a bit of dangling body parts suddenly makes that person mortifying to be seen by.","commenter_a":"Ok, I'm sure I will be shot down for this. Firstly, I don't think anyone likes communal changing areas, certainly not anyone I've ever met. I don't think the general issue with this is because you are transgender, although that puts a different slant on it. I don't think many people are happy getting their wobbly bits (of whatever kind!) out in front of strangers in a changing room. I'm sure you've experienced a lot of challenges in terms of getting where you are today and feeling comfortable in your body. I'm sure you have faced threats of and maybe actual physical violence. What I think you may need to bear in mind is that you don't know the 'journeys' of the other changing room users. Maybe they have experienced sexual violence. Maybe they have massive hang-ups about their body for whatever reason. Or whatever. Maybe they are religious. Maybe ...","post_message":"Four things I do to survive the gym locker room because I'm trans. - Parker Molloy"},{"comment_id":"1552392261455878","commenter_b":"You forgot to show the filthy, disgusting women in vagina costumes.","commenter_a":"I'm sick of vagina.","post_message":"Congratulations to the women marching around the world today. We will not go back to the days when women had to risk their lives to end a pregnancy. The decision to have an abortion must remain one for a woman, not the government. And we will not go backward to a time before Planned Parenthood, when millions of women had no access to birth control or cancer screenings. We must go forward to ensure full reproductive justice for all women."},{"comment_id":"10154462492528487","commenter_b":"Depends on your view. How much of the worlds' healthcare systems have you been a part of, witnessed or experienced. We are not perfect but we are so far from \"sucks\"","commenter_a":"The crap we have now sucks","post_message":"What would TrumpCare mean for Americans? Essentially, a public health disaster."},{"comment_id":"910206839098639","commenter_b":"How is this funny, what an ignorant woman!!","commenter_a":"Sarah Silverman is a moron who needs to go back to school and learn what the real Hitler was all about.","post_message":"Was this a good idea?"},{"comment_id":"1210524342343014","commenter_b":"Maybe she's drunk or high. Don't even look good","commenter_a":"Notice how fb took off the video? CNN reporter admitted Obama paying off the media to only cover bits and pieces of Trump speeches, to keep the media from exposing Hillary's corruption","post_message":"What is wrong with Hillary? She just completely froze AGAIN...her handler had to rush the stage, comfort her, and tell her what to say! WATCH..."},{"comment_id":"517177675137728","commenter_b":"here we go lone rider, is he picking up speed","commenter_a":"Looks like he is near Morongo Casino soon.","post_message":"Police pursued a stolen big rig near Riverside, California this afternoon."},{"comment_id":"1345804005472359","commenter_b":"MANY WOMEN HAVE ACCUSED BILLY OF RAPE. THAT PLUS THE TRIPS TO EPSTINES ISLAND TO RAPE UNDER AGE SEX SLAVES THERE.","commenter_a":"WE ALL KNOW THE TRUTH..BILL AND HILLARY ARE AS MUCH OF A DISGRACE AS OBUMMA...GO TRUMP..","post_message":"Weak..."}]
