[{"comment_id":"10154423071206336","commenter_b":"Was she deserves to do is pull her name off the ballot and put yourself in Sing Sing for 25 years","commenter_a":"I wouldn't want it anyway. It would not be sincere.","post_message":"Question Of The Day: Does Hillary Clinton owe the American people an apology for lying about her server scandal? #Hannity"},{"comment_id":"1775783539370851","commenter_b":"Idiots arrest them all","commenter_a":"White lives matter more!","post_message":"WATCH LIVE:  Protesters have gathered in downtown Atlanta. We have several Channel 2 Action News reporters with a group that is marching near the King Center and we'll have live coverage starting at 11."},{"comment_id":"10153799327541336","commenter_b":"He was not hitting her I hope.she spends years in jail,she could have killed that officer","commenter_a":"Got Her.","post_message":"A woman used her car as a weapon and knocked over an Auburn Hills police officer to flee a traffic stop. Breianna Smart was caught and arrested."},{"comment_id":"797236390409541","commenter_b":"Stfu no one wants to hear your mouth.","commenter_a":"Donald Trump is a BIG Government Authoritarian and progressive fraud from New York City He's NEVER been a conservative, and he NEVER will be conservative -- he's an actor, a phony, pretending to be what he's not.","post_message":"I'm getting really tired of this."},{"comment_id":"10153952706726323","commenter_b":"Show the UK the door Lol! We want out and you to go home.","commenter_a":"7 years in England and I have never met an English person that defined themselves as European, British when they want to show how broad their borders can be. We don't even share the same values, we interpret our history in a completely different way. They made of us a 'Brand', neglecting our own background, dignity, honesty, skills, and so on... unless you speak as they do, or you are a CEO,CFO, any kind of abbreviation really will do...only then you will be treated nearly as an equal. Dear Europe, do not succumb to this hypocrisy and show them the door.","post_message":"'I have negotiated a deal to give the UK special status in the EU. I will be recommending it to cabinet tomorrow'"},{"comment_id":"10154291680908701","commenter_b":"You're right. You're a white pig. ^^","commenter_a":"Your choices are, Trump, Hitlary, and everyone gets everything for free Sanders. We're screwed. No Trump isn't a racist.","post_message":"Donald J. Trump wins the Republican presidential primary in Washington, the Associated Press reports. MORE: @webpagelink"},{"comment_id":"10153176907066130","commenter_b":"And not be forcibly altered. Don't circumcise babies!","commenter_a":"Before picture or nahhh","post_message":"'We need to remove the stigma. We should be able to alter whatever we please, free of the judgment of others.'"}]
