[{"comment_id":"10154323067108822","commenter_b":"Fourteen people are DEAD!","commenter_a":"So glad to see everyone is a judge!!! Are the kids wrong for what they did? Yes! Should they be punished for what they did? Yes! No one who made any of these comments could be their parents I'm sure or you wouldn't be saying such hate filled things. No one is going to win in situations like this, I pray all the families and businesses can come back from this, I pray something can be salvaged somewhere. And I pray everyone who has hate in their hearts can change. This world would be a much better place if people loved like they are supposed to, to much greed and hate now. How would any of you feel if they were your family members or if you lost someone. I'm sure some of you are christians?? Think about what you could do for someone instead of spreading hatred and negativity!","post_message":"JUST IN: 2 juveniles have been charged with starting the Tennessee wildfire that killed 14 people."},{"comment_id":"10153415321678812","commenter_b":"Stacey shutup stupid","commenter_a":"So how does something hitting the windshield really effect a train on tracks? It's not like the train swerved to avoid it and hit something...travelling at 106 mph might be the villain in this tragedy.","post_message":"FBI investigating possible links between Amtrak crash and other trains hit by objects: @webpagelink"},{"comment_id":"933893426670406","commenter_b":"I'm sure Myra Hindley was a serial killer @username, that's only one name, I could name a few. Woman r quite capable of becoming serial killers. The statement is true, most serial killers start with killing and torturing animals","commenter_a":"thats how serial killers start!","post_message":"'My first bow kill lol'"},{"comment_id":"10155187473209614","commenter_b":"Your armpit makes me gag hahahhaha","commenter_a":"let them do their job.... and yes if you are on list ...GOOD BYE !!!!!!!!!! SUPPORT ICE FOR THE MAKING AMERICA GREAT AGAIN...","post_message":"Los Angeles' top elected officials cosigned a letter  urge in the strongest possible terms that ICE immediately cease this practice in our city.  Since the late 1970s, L.A. police have worked to build trust within the city large immigrant community so those in the country illegally can report crimes and offer information to police without fear of deportation."},{"comment_id":"10154886644703487","commenter_b":"Yeahhh...I'm not buying it, Atlantic.","commenter_a":"So, arrest him and tell America that Trump isn't going to be President. I dare you. LMAO......","post_message":"'Putin has embraced an opportunistic but sophisticated campaign to sabotage democracy.'"},{"comment_id":"10153141451562894","commenter_b":"She a dub","commenter_a":"'@username 😕","post_message":"Kylie Jenner literally just went from 100 to 0"},{"comment_id":"10152715320866636","commenter_b":"Bc she is a twat!","commenter_a":"But how is this possible? Our esteemed governor immediately came back with, 'Nope, can't afford it,' when the idea of building storm shelters for the schools was put before her...","post_message":"When an E-F 3 tornado passed dangerously close to El Reno Schools, the district took steps to ensure that if it ever happens again, students and staff will be safe."}]
