[{"comment_id":"1056498011103708","commenter_b":"Build a wall and if they want to come into England charge them 1000 pound per day to enter","commenter_a":"If Westminster ? allows a second Scottish referendum then fine but along with there departure goes the and our submarine base etc you can't have your cake and eat it. ?","post_message":"The UK is crumbling"},{"comment_id":"1070107396359933","commenter_b":"She would have to drug me like Bill Cosby does his women","commenter_a":"This gal needs to get laid.","post_message":"“Her conduct and behavior are appalling, and I am not only disappointed, I am angry, that a member of our faculty acted this way.'"},{"comment_id":"606361476221098","commenter_b":"WAKE UP AMERICA! The racists in our White House have no intentions of getting out. *Note* the race baiting going on now and the targeting of police departments. Obama is trying to start a race war so he can federalize law enforcement and declare Marshall Law so he can stay in office. Too many Americans are distracted by gay marriage and flags to pay attention to his real agenda. Look how he has the South stirred up... he knows that's his biggest problem, freedom loving, gun carrying Christens he knows will defend their rights! GOD HELP US ALL!","commenter_a":"Good grief! What do these people want! I have been picked on and had blacks make racist remarks to me all my life! I just keep on keepin on with the Lord! She only feels inferior because she wants to and as usual the whites get the blame!","post_message":"Controversial video just leaked that shows what Michelle thinks about white people.  This is extremely offensive. We need to spread this, and show the country she's a racist.  Do you agree Michelle Obama is the worst first lady ever?"},{"comment_id":"10154705927224255","commenter_b":"Pence is no more Christian then I am, but at least I am not a hypocrite. I don't believe at all.","commenter_a":"For as bad as Trump is, Pence is just as horrible and probably more terrifying since he tries to hide his awfulness behind his bible and has no problem signing bills into law that he doesn't even read. With Trump being 'one of the most impeachment-ready candidates ever” Pence is who would be running the White House. Here are just a few of the deplorable and insane things that Pence has done in his career of screwing over Indiana and what we could expect as a Pence run administration. - He looks up to Dick Cheney as a role model for Vice President...that alone should scare the crap out of folks. - He regularly goes blank, forgetting what he was saying, and seemingly losing track where he is and what he is doing. - He is anti-science. - He has made a career out of destroying Planned Parenthood, Roe v ...","post_message":"Bravo, Tim Kaine!"},{"comment_id":"1007821319338322","commenter_b":"She's a piece of work.","commenter_a":"She is nothing but a conceded witch, only standing by her unfaithful husband because he was the POTUS, and therefore a untrustworthy, spiteful person who only cares about herself. I see a demon in her when she laughs!!!","post_message":"The book claims she repeatedly screamed obscenities at her husband, Secret Service personnel and White House staffers — all of whom lived in terror of her next tirade."},{"comment_id":"704906709652228","commenter_b":"What a joke this lady is. I bet she is protected by Guns every single day... But she doesn't want Americans to be able to protect themselves. Just ridiculous","commenter_a":"Yah, just fill out form ID-10T and they'll ship a gun right to your doorstep Mrs. Douchebag. This is exactly why the establishment left cannot have nice things.","post_message":"“You shouldn’t be able to exploit loopholes and evade criminal background checks by buying online or at a gun show…We have to make it harder for people who should not have those weapons of war.”  – Hillary Clinton reacts to the #OrlandoShooting @webpagelink"},{"comment_id":"10155094195189766","commenter_b":"F Germany! Let the Jihadis have that country! They deserve what they get!","commenter_a":"How pathetic.","post_message":"Here's a German parade with a float of President Trump raping a national icon then getting his head cut off by the same. Thanks, guys.  Credit: Instagram/aladine_saidi via Storyful"}]
