[{"comment_id":"1517317031907717","commenter_b":"Lol! I know right! Hate that woman! This,Chicana is for #trump2016 !!","commenter_a":"The most satisfying thing in the world to see, EVER, is watching Megyn Kelly say Trump wins!!!!!!!","post_message":"BREAKING: Initial reports indicate Donald Trump has won the Republican primary in South Carolina. Let's take a poll of our own...would you like to see Trump as the next US president?"},{"comment_id":"10155091471801579","commenter_b":"Anything to shut down that lying screeching woman!","commenter_a":"She knew it was coming. It was part of her plan. It's all about playing the victim. Raising money.","post_message":"Uh-oh"},{"comment_id":"10153187291468812","commenter_b":"Sex slaves, good job girls!","commenter_a":"What's wrong with people this world is going crazy","post_message":"NEW: Search on for 3 schoolgirls who have fled home to join ISIS: @webpagelink"},{"comment_id":"10154826896060530","commenter_b":"One more time","commenter_a":"Trump won! Get over it! Hillary lost 2 elections and she accepted the loss once she called trump and congratulated him on his win before all the votes were in!","post_message":"#BREAKING: Michigan's Board of Canvassers deadlocked 2-2 on President-elect Donald Trump's objection to a recount of all presidential ballots cast in Michigan."},{"comment_id":"341937372643300","commenter_b":"Do you consider such hate to be Godly?","commenter_a":"It simply explains our Republic ...For which it stands....We are one Nation under under God...ALWAYS....OUR GODFATHERS KNEW THE MEANING OF REPUBLICS...Look it up...The American Flag is Our heritage....Obama is illegal trash....his followers as well...Demorats.s have sunk lower every year...This Obama is a bottom scraper...Clinton And Sanders are also bottom feeders.They NEED to be removed from office ...Ungodly monsters...","post_message":"I agree!"},{"comment_id":"1063108630412332","commenter_b":"Hillary is such a flipflopper!","commenter_a":"If the War in Iraq made your family safer, Hillary is your candidate. If the USA PATRIOT Act secured your family, then Hillary is your candidate. If your family reaps the benefits of institutionalized racism in our justice system, then Hillary is your candidate. If you want more expensive healthcare, vote Hillary. Mine is currently $475/month (compared to my $25/month car insurance from Insurance Panda, or my $10/month dental insurance, but I digress). Hillary is in bed with big pharma, she is your candidate. If you want to vote democrat, but still want to bomb Iran, then Hillary is your candidate. If you really benefitted from the Housing crisis or from Monsanto bankrupting small farmers or Big Pharma price gouging the sick, then @username is your candidate","post_message":"“It’s not just that she’s done her homework—Mrs. Clinton has done her homework on pretty much any subject you’d care to name.”"},{"comment_id":"1143371025741432","commenter_b":"Can't stand this big ass getto fat bitch","commenter_a":"Illuminati whore","post_message":"Obama declared her a great role model for children, now Beyonce has released a sickening video.  But the violence and feminism in it isn't the worst part. Look who actually shows up in the video with her..."}]
