[{"comment_id":"552483671600179","commenter_b":"Hillary does all of the same things too. Get real.","commenter_a":"Its not really gender...its just more crap to throw at our future PRESIDENT Hillary Rodham Clinton..every week its some other lie or smear..you would think people would figure out what republicans have been doing for decades..!! An yawn like I do each time they raise their ugly heads. !! Tell them no an leave it at that !! Go Hillary Clinton🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸","post_message":"The 'transcripts' hit on Hillary is sexism in its purist form: holding a woman to a different standard because of her gender."},{"comment_id":"10153799805727623","commenter_b":"They need to be handcuffed at all times !","commenter_a":"Now report how many inmates are killed by correctional officers every year","post_message":"4 correctional officers are assaulted at a North Carolina prison:"},{"comment_id":"10153389202536051","commenter_b":"Bitch your fake, n ugly to boot !!!! Fake ass , go be with Obama !!!","commenter_a":"Quick somebody wake her up! She's having a nightmare!","post_message":"This model says that after wearing a corset for 7 years and getting four boob jobs, two nose jobs, butt implants and all her teeth removed, she finally has the 'perfect' body. Decide for yourselves if that's true."},{"comment_id":"10153059352079342","commenter_b":"Sick sick person, wonder how she would like that done to her. She looks mean! Glad she is not my grandmother.","commenter_a":"guela knows","post_message":"A grandmother from southwest Houston is accused of burning her 12-year-old granddaughter with a hot tortilla pan after the girl got in trouble at school for writing on the chalkboard.  FULL STORY---> @webpagelink"},{"comment_id":"10153738132321756","commenter_b":"Awesome. catch 'em.","commenter_a":"Loved this story today! Thank you @username! Very interesting and I can't wait to watch the documentary.","post_message":"To track the route of poached tusks, investigative journalist Bryan Christy commissioned a taxidermist to create fake ivory tusks, which he embedded with specially designed tracking devices."},{"comment_id":"496338953890018","commenter_b":"Dumb as hillbilly racist. This ain't your country. You must of been beaten to many times by your hillbilly husband. Stay the fug out of their area then. You KKKrackers have many don't go zones, outsiders not welcomed. Most trailer parks in Auburn CA. and any white town in Mississippi. Live and let live mafaacaas!","commenter_a":"yes spray the area with pig fat","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"10152993021545667","commenter_b":"The Donald brings women to be his wives to the USA so they'll marry him and make them legal citizens, did it twice","commenter_a":"Support Donald Trump.","post_message":"'I cherish women,' Trump told Hannity on Tuesday night."}]
