[{"comment_id":"1166911916662170","commenter_b":"Quit being a girl!!!!!!!!!","commenter_a":"People should remember that clearly there are innocent people in both jails and prisons. How would you like to be an innocent person in jail or prison, getting beaten up....with people cheering on further for you to be additionally brutalized?","post_message":"Inmates at New York's Clinton Correctional Facility say they were beaten, choked and slammed against walls by guards seeking information after 2 convicted killers escaped."},{"comment_id":"1056310464431070","commenter_b":"AND THERE WILL BE MORE THANKS TO OBAMA AND CONGRESS","commenter_a":"Just kill him","post_message":"BREAKING: ACTUAL ISIS FIGHTER ARRESTED IN SACRAMENTO: Aws Mohamed Younis Al-Jayab Lied To Immigration Authorities ISIS is in the USA! We need TRUMP 2016 to eradicate them! @webpagelink"},{"comment_id":"10154054920697093","commenter_b":"Just let this crazy lady live in her imaginary world.","commenter_a":"I feel the closet racists gathering on this post.","post_message":"Small protest happening now at the old Tarrant County Courthouse in response to the Fort Worth viral video arrest. bit.ly/2hYduuA"},{"comment_id":"10153109459178701","commenter_b":"Usually those people are criminals themselves.","commenter_a":"Why people defend the character of criminals, I'll never understand...","post_message":"Two people were caught on camera damaging an ATM to try and get money out of it on the Oregon Coast. After the surveillance photos were posted on Facebook, police made two arrests."},{"comment_id":"10154178335409877","commenter_b":"Well said Jillian. I too believe that BLACKLIVESMATTER! It's not right, it is unacceptable !! We are al the same inside, under the skin of all people. There is only 1 race. The HUMAN RACE, period!! The more that speak out the louder we are!! And I believe this to can CHANGE!","commenter_a":"Enough is enough","post_message":"So, so tired. #TerenceCrutcher"},{"comment_id":"583876271812949","commenter_b":"Niggah Please","commenter_a":"Um....why walmart though?","post_message":"Trump's #1 supporter has a disgusting warning for voters..."},{"comment_id":"1255087781177916","commenter_b":"Get on your knees and suck my big fat hillbilly cock. Lol ....","commenter_a":"Republicans deserve a President Cruz who gets his condoms from dive bar bathroom dispensers.","post_message":"It's not who the party's establishment thinks."}]
