[{"comment_id":"401829593338668","commenter_b":"How very sad to read this. Our vets are not being taken care of properly and it is a shame. The President cared more for illegals then he does our veterans. Shame, shame.","commenter_a":"Semper Fi marine R I P","post_message":"RIP Marine..."},{"comment_id":"10153578637147235","commenter_b":"How much you wanna bet that this nut case is a conservative?","commenter_a":"1st class white privilege on display. We'll get you and your little dog, too!","post_message":"This is insane!"},{"comment_id":"1805566076381553","commenter_b":"Leave it alone!!!!","commenter_a":"I vote no!!","post_message":"They are going to change Ole' Glory to this! Leave our flag alone. Do you think the American flag should not be altered?"},{"comment_id":"1022408774478552","commenter_b":"Why is she walking free?","commenter_a":"since when can a low life irs agent speak with the doj,fbi to cause harm to a tax payer","post_message":"Jaw-dropping abuse of power:"},{"comment_id":"10152782186121130","commenter_b":"I can't even blame her decision(which I do feel is extreme) but seriously what's with these whacky doctors who are willing to do these surgeries, where's THEIR head? Enormous breasts, huge ridiculous lips, 'body fillers' etc it's disgusting.","commenter_a":"Miss dumbdumb. Shame ppl just can't accept what nature gave them. Or at least find safer ways to enhance/change.","post_message":"'I'm paying now for my vanity.'"},{"comment_id":"460098450844429","commenter_b":"Idiot, cite a source.","commenter_a":"Homicide and violent crime rates are down, twats. They're lower than they've been since the early 90's-you focus on 'gun murders' instead of all murders because the facts don't back up your propaganda.","post_message":"America's big problem is lethal violence  and that's driven in large part by guns."},{"comment_id":"1205517149514372","commenter_b":"Go away, Racist, Tax Evader, Liar, Sharkton! No more White House Visits! Hopefully Sharkton and Hillary share the Big House soon!","commenter_a":"Loser!","post_message":"Rev. Al Sharpton warned that 'all that many of us have fought for all our lives is at stake' following Donald Trump's victory in the presidential election and vowed that 'we are not going down without a fight and Donald Trump needs to know that.'"}]
