[{"comment_id":"10152948081757144","commenter_b":"She's just as bad. I will never vote for her.","commenter_a":"Not a fan. She's a liar and a thief. In bed with Walmart and Monsanto. She's a evil war hawk.","post_message":"So much for transparency."},{"comment_id":"10152633763458525","commenter_b":"So because somebody disagrees with you they lack common sense. That's very adult of you.","commenter_a":"And people say that pot doesn't hurt anyone.... That's two deaths due to pot sales just during the holiday season. Pot hurts....even kills.","post_message":"They are just 15 and 16."},{"comment_id":"1002365369819992","commenter_b":"Then why did she have a professional IT tech wipe it?","commenter_a":"The cat is out of the bag. Now they can give up the untrustworthy propaganda about Hillary.. We all know who America can't trust- Republicans","post_message":"Tomorrow, Hillary will testify in front of the House Select Committee on Benghazi. She’ll answer their questions, remember the brave Americans lost in the attack, and outline the need for our country's continued leadership abroad. Let her know you’re with her by sharing this. hrc.io/WithHer"},{"comment_id":"633021916884133","commenter_b":"Handler is not someone who the 1st lady would want to meet with. Talk about the trash...","commenter_a":"Chelsea Handler who is a hardcore supporter of Hillary Clinton and a Democrat. She is actually a racist.","post_message":"Wow..."},{"comment_id":"10155894213345354","commenter_b":"Hillary is a cunt!","commenter_a":"Killary is the epitome of all the ills of this world rolled into 1 savage stinking carcass.","post_message":"Short memory!"},{"comment_id":"10154289456551336","commenter_b":"No it wouldn't be. It's encouraging to see females that still want equality, rather than superiority.","commenter_a":"It's a dress code, then she should be sent home. Would this still be a story if a man was sent home for not wearing a tie?","post_message":"Dress code violation or sexism?"},{"comment_id":"10153082513017169","commenter_b":"Another sold out POS that wants another war. Shoot the c**ksucker.","commenter_a":"Poor outcomes across the board.","post_message":"What does Scott Walker believe? Where the candidate stands on 10 issues (From PBS NewsHour)"}]
