[{"comment_id":"1453852417965437","commenter_b":"Vile scum maggots.","commenter_a":"\"Did Huma have her genitals cut off?\",,,,More projection from Alex Jones?","post_message":""},{"comment_id":"1549351415084883","commenter_b":"Dear Miss Jordan the idiot is not I that's for sure, just remember this this is not your land to start with. I hope you don't have an issue with the Native Americans because if it's true you should go back with you where you from.","commenter_a":"Why does the police have military style vehicles, why does the Native Americans still have to defend their land, why our government doesn't do anything about it.... Same old story oil companies rule the world.","post_message":"Watch as police in riot gear use pepper spray on activists protesting against the Dakota Access Pipeline. Multiple were arrested. More: @webpagelink"},{"comment_id":"925264027533346","commenter_b":"So skinny women aren't real?","commenter_a":"oh look real women","post_message":"Large ladies in lingerie are No Angels"},{"comment_id":"10154489000406336","commenter_b":"She shouldn't even be in this election she should be in prison.","commenter_a":"We all have to watch Hillary very closely as she will surely try to rig the general election like she had done during the primaries. What was recently exposed at the DNC she most definitely should be disqualified. Goes to show that the Clintons are corrupt, above the law and play by their own rules.","post_message":"\"I think what I'm offering are proven results. I think what I'm offering is that we can build on where we are.\" On \"Fox News Sunday,\" Hillary Clinton slammed Donald J. Trump, claiming that he has offered nothing to help people, while she has an agenda to increase jobs, increase incomes, and make the economy grow and be more fair. @webpagelink"},{"comment_id":"10154077625056509","commenter_b":"Keep them out of America !","commenter_a":"Help thousands of Syrian kids and families! Take 30 seconds to sign (and hopefully share) this petition asking the US government to take in 65,000 Syrian refugees.We are almost there...we need your human support! Germany is expected to accept 800,000 refugees this year, while the US has accepted less than 1,500 thus far. Let's do a small part to encourage the U.S. government to be socially responsible. This is a humanitarian crisis and the Syrian refugees have nowhere to go. You can sign no matter where you are from. @webpagelink","post_message":"A call for Dr. Ben Carson to drop out: @webpagelink"},{"comment_id":"717966465023405","commenter_b":"My condolences.","commenter_a":"That's my boy the day after I brought him home. 💜💜💜","post_message":"Mmmoohmygod."},{"comment_id":"10153155550251051","commenter_b":"Oh Erika bitch still has vagina","commenter_a":"HUGE.....SORRY ISRAEL...OUR PRESIDENT IS SETTING US UP FOR WAR....SORRY HES SUCH AN EVIL P.O.S....an i for one stand with my people an Israel....suk it obama....rot!!!!!","post_message":"Israel came out and called President Obama's nuclear deal with Iran a big mistake. Here's how they're going to respond to it. Do you agree or disagree with the idea that the Iran deal is a mistake?"}]
