[{"comment_id":"10152694344065736","commenter_b":"Stupid woman","commenter_a":"But, it's fine to hire a\" doctor\" to kill your baby. That's logical.","post_message":"An Indiana woman's self-abortion has thrust her into the debate over reproductive rights."},{"comment_id":"10153060626041162","commenter_b":"I'm gonna jump a girl I see walk passed me Jk","commenter_a":"Notice how these kids are not American...Im sure it would be a different video here","post_message":"VIDEO: In an experiment designed to explore violence against women, young boys were asked to slap a girl.   Watch how they responded: @webpagelink"},{"comment_id":"10154479942176509","commenter_b":"It's why we need the wall","commenter_a":"I wish the people of Mexico could do something to rid their country of all the corruption and hideous violence there. They deserve so much better.","post_message":"Five years ago Carlos Gutierrez had his legs cut off by Mexican police officers after not being able to give them extortion payments.  Today, he'll join a group of 400 people receiving blessings from the pope."},{"comment_id":"529761760538579","commenter_b":"You ruined it","commenter_a":"@username @username Sam Finch We get the joke :)","post_message":""},{"comment_id":"775477502501275","commenter_b":"I agree with Mark Colwell.one muslim won't go against the other.they are all for crap..","commenter_a":"Gee, really, and what would they do if he made them angry? Another Dem moron speaks in defense of her Beloved Leader and what she says is as stupid as they both are. How do these people get through even elementary school being this dumb?","post_message":"And this is what Democrats think about terrorists... #facepalm"},{"comment_id":"633829223459429","commenter_b":"Stupid stupid girl , the more she talks the dumber she is .","commenter_a":"Do they have no parents","post_message":"From American AF - AAF Nation...This is what's wrong with society TODAY!!"},{"comment_id":"10156618428550354","commenter_b":"And why wouldn't he? His father and step father were Muslim...Is it beginning to make sense?","commenter_a":"They will have to air the whitehouse when they finally get because of the smell he will leave","post_message":"The worst terrorist attack in America since 9-11 and what does Obama do?"}]
