[{"comment_id":"352745464928968","commenter_b":"Her lips weigh more than my kids\"!!!!","commenter_a":"Who cares what she wants. She needs to minf her own business.","post_message":"Michelle Obama Wants to Weigh Your Fat Kids"},{"comment_id":"975168282518593","commenter_b":"Better be sure. Our us h hospital are not allowing this.....What. If. Patient wants non Islamic nurse. Because is this practice?","commenter_a":"STOP with the offending of muslims.....this is the United States of America...land of the free.... Who gives a crap if your offended....","post_message":"Whoa!"},{"comment_id":"10154432896669342","commenter_b":"The first 2 females that get drafted if there is one better be his kids.","commenter_a":"What they need to do is send all the government babies to serve leave the women alone","post_message":"The timing of Obama's support for women registering for the draft makes it mostly symbolic, but where do you stand on the issue?"},{"comment_id":"741381376052440","commenter_b":"Big ugly cow, let her bitch.","commenter_a":"So go to another store, what's the big deal?","post_message":"Welfare Queen Goes BALLISTIC After Seeing THIS Sign At The Grocery Store  Let her be mad, this is what she deserves.  Are you sick and tired of entitled welfare leeches?"},{"comment_id":"248420038902239","commenter_b":"Shouldn't she be starring in class B horror films?","commenter_a":"She's a fucking bitch and a liar and top of it😡😡😡😡","post_message":"\"'Alternative facts' are not facts. They're falsehoods.\" Sean Spicer, Conway, and Trump tried to lie about the size of the inauguration crowd, but Chuck Todd didn't let them get away with it.   Shared by Occupy Democrats, LIKE our page for more! Video from Meet the Press."},{"comment_id":"10154318850908010","commenter_b":"Round them up & deport them!","commenter_a":"You darn California bed wetting liberals are scared, #Trumps going to take your benefits and make you get a job.","post_message":"Some Trump hats were set on fire."},{"comment_id":"1392674554144410","commenter_b":"I assume Soros is paying for all the protests! The Koch brothers provide jobs!","commenter_a":"As Gomer Pyle would say....surprise, surprise surprise! Busted yet again. The little boy who cries wolf......","post_message":"We just found out who the REAL face of the Women's March is... see the funder who's pulling the strings.  Sadly, we should have seen this one coming."}]
