[{"comment_id":"10154526553127550","commenter_b":"'@username SORE LOSER","commenter_a":"All of you supposed adults in here crying are ridiculous, Republicans lived through eight years of Obama, you can survive four to eight years of Trump. Grow up.","post_message":"North Carolina has officially cast its electoral college votes for Donald Trump."},{"comment_id":"10152889795339342","commenter_b":"Thanks to the OTHER hospital! Her hospital didn't even say what Duncan had! They kept it from her!","commenter_a":"Personally, I'd just be happy to be alive.","post_message":"SO CALLED 'EBOLA NURSE' NINA PHAM PLANS TO SUE: The 26-year-old nurse said that the hospital where she had worked in Dallas and its parent company failed her when she contracted Ebola while caring for the first person in the U.S. diagnosed with the deadly disease."},{"comment_id":"1788613674701059","commenter_b":"Shut up hoe","commenter_a":"It amazes me how rude some of you people can be . They're having a fucking child! Like come on now , stop being so immature talking about ' he's carrying the baby , ' or ' his girlfriend looks like a man'. Smh people 😒😑. Congratulations Dj Khaled & Nicole Turk ❤️","post_message":"Baby Alert!"},{"comment_id":"10152804178333445","commenter_b":"I am too good for Reggie foo. Keep that shit.","commenter_a":"Ya dumbasses the shit from cali been growing by the mountains .and guess who growing that the mexicans .indica or sativa its the same shit. Stop acting like you are too good for Reggie. Spoiled ass dudes.","post_message":"Legal Marijuana Screwing the Mexican Cartels  @webpagelink"},{"comment_id":"10153067204246636","commenter_b":"Is she ? So sex with her is ok?","commenter_a":"Slaughter of the baby is hardly justice for the rape. Two wrongs don't make a right.","post_message":"He claimed there are always 'two victims' in an abortion"},{"comment_id":"490645967790363","commenter_b":"Trump thought better of it and he was invited in. Jorge Ramos is a U.S. Citizen, a gentleman and a great reporter for Univision. Shame on Trump!","commenter_a":"trump was right","post_message":"He just got SCHOOLED!"},{"comment_id":"10154866849395329","commenter_b":"Becky with the good hair have a stadium full of seats please","commenter_a":"*21 things no one asked for. There, fixed it. *waits for angry Trump supporters to start complaining in the comments*","post_message":"We asked Donald J. Trump supporters to write down a misconception about them and here's what happened."}]
