[{"comment_id":"10154167828886077","commenter_b":"Oh whoopee!! It will soon b n Indiana! 🙀 Where did June go??","commenter_a":"Kill it with fire!","post_message":"❄️☃"},{"comment_id":"10156924432505354","commenter_b":"No! What people do sometimes astounds me!","commenter_a":"'@username did you hear about this?","post_message":"Tree Hugger Causing Seattle Traffic Back Up  “Issue appears to be between the man and the tree,” Seattle police tweeted...  #ManInTree"},{"comment_id":"1202659629774507","commenter_b":"He should be impeached. If this neighborhood was all white they would have had clean water on day one","commenter_a":"Mr. Snyder you have not done your job so you must go. You looked pathetic.","post_message":"Why hasn't he been arrested?"},{"comment_id":"10154522973374102","commenter_b":"She may be the lesser of two evils, a female, a scapegoat, but she's still a nut job.","commenter_a":"I'm not saying she doesn't deserve disciplinary action, because she does. But I find it disgusting that they are targeting ONLY her, and not Trump's tweets against Nordstrom. I get that she's an easier target for the GOP, but grow a pair of balls, please.","post_message":"BREAKING: The Republican chairman of the Oversight Committee is recommending disciplinary action against Kellyanne Conway for promoting Ivanka Trump products from the White House, including 'reprimand, suspension, demotion, or dismissal.”"},{"comment_id":"10153096349467377","commenter_b":"I agree with Rush. I'm sick of women pushing themselves to the front of every topic. And using their gender to advance themselves. We who have sons and brothers hate to see the way they are pushed to the back of the bus.","commenter_a":"I have listen to Rush for 20 years!! Love him!! I agree with him.. most people who don't like him have never listen to him!! I like Michael Savage to, talk radio is where you find the real news... wake up people we are losing our country!!!!!!","post_message":"Rush Limbaugh says that too many women journalists have led to the 'chickification' of the news — which gives it a female-friendly slant."},{"comment_id":"10155056114144749","commenter_b":"hoorah!","commenter_a":"Good review worth reading.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"662046983985880","commenter_b":"She's not worth the used toilet paper in my toilet","commenter_a":"isnt she the wench thast triex to be a whore on every show, even the disney channel?? shes a meaningless tramp with no talent. her father is a meaningless douche with no talent. who cares whqat the slut thinks? shed vote for anyone who could give her a good orgasm","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"}]
