[{"comment_id":"741809245917684","commenter_b":"THOSE 3 BITCHES...ARE GETTING THE SHIT GANG BANGED OUT OF THEM NOW.","commenter_a":"IS is recruiting sluts for sex only son","post_message":"Aqsa Mahmood, 20, left her home in Glasgow in 2013, and married an IS militant in Syria."},{"comment_id":"1045431208809965","commenter_b":"This is not news worthy.","commenter_a":"Who cares?","post_message":"BREAKING> Beijing wins bid to host 2022 Winter Olympics. China's capital will be first city to host summer & winter games."},{"comment_id":"944012942300794","commenter_b":"I definitely would pitch in for her ticket BACK to HER country. If she said this crap in HER country, she'd have her tongue cut out or be-headed, or better yet killed . Get the blank blank outta MY country. Thank you to all our service men who give their lives for OUR COUNTRY.......","commenter_a":"Don't like it leave !!!!","post_message":"A Muslim woman confronted a female cashier about her flag pin... What happened next is going VIRAL!"},{"comment_id":"10153430601099255","commenter_b":"Proving again that ALL FOOLS AREN'T DEAD YET","commenter_a":"Evil attention seeker. Jealous of President Obama.","post_message":"This guy seems so pleasant."},{"comment_id":"537404189787632","commenter_b":"YOU HAVE FORGOTTEN THAT YOU ARE NOTHING MORE THAN AN ACTOR WITH AN OPINION--AND NOT A VERY INTELLIGENT ONE-MAYBE YOU WOULD LIKE TO JUMP ON THAT PLANE THAT SO MANY OF YOU ACTORS ARE GOING TO BE ON IF TRUMP WINS???!!!!NANCY","commenter_a":"He's a self important cunt, that's what he is. Like his opinion matters. I like his acting, but when it comes to a political opinion, I'll form my own and he can fuck off with his.","post_message":"Robert DeNiro is a ________________."},{"comment_id":"1410810932269586","commenter_b":"What a wanker.","commenter_a":"Demented old cray cray white man, losing touch with his cash cow. He's milking that cow because it's dying and he knows it. Will need to start a new job with no talent!","post_message":""},{"comment_id":"10153866102494160","commenter_b":"Guess he ought to have plenty of money to go on vacation about ten times a year.","commenter_a":"@webpagelink payments By Morgan Chalfant Published March 18, 2016 Washington Free Beacon President Obama sought to increase the amount of money available for the federal government to spend on former presidents in advance of his White House exit. In his budget requests for fiscal years 2016 and 2017, Obama proposed hikes in the appropriations for expenditures of former presidents, according to a report from the Congressional Research Service published Wednesday. The report, which discusses the pensions and other federal benefits offered to former commanders-in-chief by way of the Former Presidents Act, specifies that Obama’s 2017 budget proposes a nearly 18 percent hike in appropriations for expenditures of former presidents. He successfully requested an increase in such appropriations for fiscal year 2016. “The President’s FY2017 budget request seeks $3,865,000 in appropriations for expenditures for former Presidents, an increase of $588,000 (17.9%) from the FY2016 appropriation level. The increase in requested appropriations ...","post_message":"Barack Obama's new digs come with a huge price tag."}]
