[{"comment_id":"1954618021430775","commenter_b":"It aint over till the fat lady sings,lol","commenter_a":"Mark my words, in future presidential elections, candidates will try to do what Donald Trump is doing.","post_message":""},{"comment_id":"991037997658085","commenter_b":"Bitch didn't get cheated, she got outplayed. Sour grapes!","commenter_a":"The American people have had enough I being manipulated by candidates that don't know how to quit when they're beaten. Hey Idon't know where thus 2nd ballot thing comes from but they better knock it off before they a billion pissed off Americans !!","post_message":"CRUZ POACHES NEARLY ALL AZ DELEGATES Jan Brewer: 'I Got Cheated!'..."},{"comment_id":"995560767160480","commenter_b":"Why should he not? The more knowledegable of us that bother to read and comprehend what we read knows full well obummer's allegiance is with his muslim homeland.","commenter_a":"The tyranny in this country almost makes everyone speechless Wake up America Hillary is just an extension of Obama policies","post_message":"Not only did this Syrian immigrant cheer 9/11, in April 2013 she told me to \"go fuc k yourself\" after I called the Boston bombing jihad. This is who Obama assigns to keep us safe. Who is going to keep us safe from this savage?"},{"comment_id":"10154787328718984","commenter_b":"Perhaps she should have kept her mouth shut and the White House wouldn't have to protect her!!","commenter_a":"BS....houses don't talk. We are about to witness the biggest revolt on DC and heads will be rolling. Trump will clean house literally. The most crooked leaders plus the worst media in the world. People are po'ed and WE aren't going to take it anymore.","post_message":"Right after Michelle Obama took the stage and launched an attack on Donald J. Trump that sent the media into a frenzy, the White House delivered a message to the Republican candidate that did NOT go unnoticed..."},{"comment_id":"684790694966567","commenter_b":"He is naturally jumping in the election of this man because he is willingly trying to make this united states and land or\\\\f Muslim's. HE continues to support anything he can by continuing to have open doors for these people and also continues to increase the jobs for them and NOT FOR THE AMERICAN PEOPLE this king of leadership is UNAMERICAN JUST LIKE HE IS.","commenter_a":"No doubt!!","post_message":"Now, it is time for a simple question: Has President Obama launched a political campaign against Prime Minister Netanyahu and his allies? @webpagelink"},{"comment_id":"1248206901866985","commenter_b":"Ali Berdai haha","commenter_a":"Alex Bond","post_message":"By Liz Climo."},{"comment_id":"10153724515436770","commenter_b":"She has no womb or ovaries.","commenter_a":"Transgenders are just psychologically \"challenged\" individuals with a normal complement of either male or female sex chromosomes. A genetically male transgender would (quite correctly) not be allowed to compete in a woman's race whereas a genetically female transgender would only get beaten were she to compete in a male race. Caster is (it seems) totally different. If an intersex she has two X chromosomes that would normally make a female but, unlike true females she also possesses male Y chromosomes that will give some male characteristics. If she has Y chromosomes then she isn't qualified to compete in female races but, as with female transgenders, there is little point in her trying (and she should not with two X chromosomes) to compete in male races.","post_message":"South African runner Caster Semenya dominated the women's 800-meter final Saturday in Rio, finishing well ahead of the competition to take home the gold medal. Turns out Semenya is widely believed to be “intersex.\""}]
