[{"comment_id":"10152986192691491","commenter_b":"You're an odd little woman","commenter_a":"Malala is big drama queen , thousand of girl are raped and kill no body knows why malal","post_message":"Malala gunmen secretly set free in Pakistan @webpagelink"},{"comment_id":"367438390047230","commenter_b":"Devora Sexton and you are a cheap whore","commenter_a":"If a man's children and wife are a measure of him, Trump is a hell of a guy.","post_message":"Another reason Dems are terrified..."},{"comment_id":"1053133688060436","commenter_b":"What!!!???","commenter_a":"We're number 1!! We're number 1!! Oh wait......","post_message":"While the rest of the world is reducing maternal deaths, the number of pregnancy-related deaths in the U.S. continues to rise. In fact, America now has the highest rate of maternal deaths in the Western world."},{"comment_id":"851850534874696","commenter_b":"Loads of respect for her now:) well done woman! Anything to wind those twats up makes my day","commenter_a":"Good","post_message":"Selena Gomez sparks fury by violating religious dress code in mosque."},{"comment_id":"10155347376155389","commenter_b":"She certainly is a cow!","commenter_a":"I would vote for a dead cow before id vote for her. Oh I forgot she is one.","post_message":"It's your turn to answer Sean's Question of the Day! Will the growing list of scandals hurt Hillary Clinton if she runs for president?"},{"comment_id":"828705883906152","commenter_b":"Trump for me all the way! We can't have Hillary. Socialism whatever","commenter_a":"Donald Trump is what we need not another stupid politician. Wake up people stop being so bling of the BS from Hillary, Cruz, Rubio. Those candidates are a joke. We need America back agin the strong country that once was until Obama and now Hillary, please the woman is a liar and a joke. She gets away with everything. Wake. Up America Trump will bring this country back, AMEN!","post_message":"Positive change is not going to come from someone such as Donald J. Trump. He is running for the wrong reasons, nothing good comes out from him. @webpagelink"},{"comment_id":"1340551885984265","commenter_b":"Your a believer if you believe what you said, people been saying that crap every election. I know you don't like either nobody does but someone is going to win Who would you rather","commenter_a":"@username I know you won't but watch this....","post_message":"TOTALLY VIRAL --- HOW TRUMP WINS (VIDEO) @webpagelink"}]
