[{"comment_id":"10153697709133984","commenter_b":"He'd never make it to prison if that was my daughter or granddaughter. But since he will hopefully go to prison, its a shame someone never showed him an illustration on a blackboard about the size of your asshole before prison and the size it is when/if you get out. Maybe he would then have had sense enough not to rape a child. When he goes to prison he's going to find out what real rape is like...good.","commenter_a":"Castration sounds good to me. He wouldn't do it again","post_message":"This sick punk raped a young girl and admitted to it... but the disgusting thing is his absurd excuse.  Our country is in deep trouble and this proves it... this little girl did nothing to deserve this."},{"comment_id":"10153174842954342","commenter_b":"Amyaa Brown what u done did? Lol jk","commenter_a":"Deepan Patel","post_message":"EVACUATION CHAOS: Southwest Airlines evacuated a plane at Hobby Airport when the cabin started smelling like smoke.   WATCH:"},{"comment_id":"887276944740413","commenter_b":"@username, I agree with you're sentiment. However, that's just what they want so they can finish sweeping this crime under the rug and most likely murder you while you were in jail. Count on Yashua Yahwashi to help you win this battle. I came not to bring peace but a sword.","commenter_a":"This is such a travesty. These judges are complicit in the cover-up. I remember when that girl Natalie Holloway was murdered on vacation. That case went on and on until they put that guy Ian Vandersloot (sp?) in prison. White parents rarely have the burden of proof put upon them. They should start a GoFundMe page.","post_message":"Parents of Kendrick Johnson (Teen Found Rolled Up in Mat at H.S Gym) Ordered to Pay Hefty Legal Fees"},{"comment_id":"741587372614642","commenter_b":"Won what???","commenter_a":"You blind-hearted Zionists, you just can't bear it that the Iranians have won and you lost: can you; the barbarians!","post_message":"A year after war with Israel, Gaza rulers boast of revitalized efforts to prepare its fighters for the next round of violence."},{"comment_id":"1022960277760501","commenter_b":"NO Hillary, Monica, & Bill in the White House ever again. TRUMP for PRESIDENT!","commenter_a":"Madame President Hillary Rodham Clinton and First Husband Bill Clinton January 20, 2017","post_message":"“Girls can do anything.”"},{"comment_id":"1272259289466246","commenter_b":"@username, go ride your tricycle on the freeway!","commenter_a":"Funny you take this seriously. Simultaneously dismissing ISIS. REALLY shows your common sense level.","post_message":"Thank you, sir."},{"comment_id":"10155057898721729","commenter_b":"You can't make this crazy stuff up","commenter_a":"So they want equality. They get it but its not the equality they wanted because gasp! The police officers do their jobs. So the black police officers are not REALLY black because they are doing the jobs that the black population wanted them to do (and represent the black community) but didnt expect them to do the job as it is supposed to be done. Eeek! My head is spinning.","post_message":"How's this for a racist stereotype?"}]
