[{"comment_id":"1056082027782443","commenter_b":"She needs to speak for herself. Some of us still clean our own houses.","commenter_a":"Well it's probably good she is his ex wife lol","post_message":"Donald J. Trump's ex-wife spoke out in support of the GOP candidate and the need for legal immigrants."},{"comment_id":"467273093466185","commenter_b":"Hello . It is ok to call this guy a f....t ?","commenter_a":"Haven't we learned that terrorist have the greatest amount of patients and will take years and alter thier lives how ever they need to to carry out a plan. Throwing us off course, that's part of thier plan. Taking our attention away, part of the plan.","post_message":"Orlando shooter who killed 49 people at the Pulse nightclub was himself a regular patron of gay clubs in Florida for years, classmates, friends and club employees say."},{"comment_id":"1277987642251583","commenter_b":"When I say technology, I'm talking about millenia of advancements. Even our simplest tools at one point put someone out of work, probably starting with the wheel. If you want to walk away from technology (or just some technology) that's your choice, just don't try and force others to pay for your choice.","commenter_a":"Low skill workers have been making this argument for generations since the first automation came about and it still doesn't work. Someone still has to design, manufacture, install and service the machine. Someone has to stock supplies for it to use. Still plenty of jobs, just not the job you were doing yesterday. They are also overlooking the other basic problem that the Government doesn't create wealth. If you get a freebie from Uncle Sam, that came out of someone else's hard earned money via taxes. If we're all sitting at home due to this miracle automation, then there's nobody around to pay the taxes to fund the government. It simply doesn't work. Worse, we've seen countless times around the world how it doesn't work and people still don't get it.","post_message":"Simply put, the idea is that Uncle Sam will cut citizens a regular paycheck whether they work or not."},{"comment_id":"1069898906439694","commenter_b":"Trump’s running out of nonwhite ethnics to demonize. And since he needs to keep interest piqued for his free media advertising to continue, I’ve thought of a few white demographics which would work for him: LGBT people are prime. Recently an evangelist speaker at a Ted Cruz related event called for the death penalty for them because the bible has passages calling for that. And there have been comments such as the one claiming that gays are responsible for most urban violent crime. Another is that they are trying to turn us all gay. So Trump could call for making anything but heterosex illegal. That should excite his base and get hyuge media coverage. Planned parenthood employees and doctors would be favorite victims. Trump could call for imprisonment of all PP employees and the death penalty for any doctor who has any abortions already on their record. They are totally ...","commenter_a":"'He has not proven to be somebody that has a firm grasp of policy.' Let alone reality.","post_message":"'He has not proven to be somebody that has a firm grasp of policy.'  - Jeremy Peters"},{"comment_id":"992882130761178","commenter_b":"#__ #__ #StopYazidiGenocide #StandforYazidiWomen","commenter_a":"'@username: .","post_message":"A behind-the-scenes look at a historic night. hrc.io/269ym4J"},{"comment_id":"10153097755761323","commenter_b":"'Oh, climate change beat ISIL.'","commenter_a":"I wish I never clicked on the comments.","post_message":"'Using the weather as a weapon to subjugate the globe sounds like the modus operandi of a James Bond villain'"},{"comment_id":"579776192190480","commenter_b":"Leave now bitch","commenter_a":"Good Bye.","post_message":"Whoopi Goldberg Says She Might Leave The Country If Trump Is Elected. Well I guess she's going to say goodbye. Will you happy to see her go?"}]
