[{"comment_id":"10152964410961130","commenter_b":"It's Bush's fault Duh","commenter_a":"If they'd have shot him it would be all because he's black & a victim of the evil white man lol","post_message":"Have you seen this man?"},{"comment_id":"1310434322356653","commenter_b":"@username you brought the feminism in when you started defending being a hoe","commenter_a":"Only one thing I disagree is he could have waited till the sun came out more to take her and the kids out. I don't blame him for his actions if his busting his ass to provide for her and the kids. If they your kids. Please don't abandon them. And she should be grateful he didn't hurt her. I'm praying they work it out for the kids if their his.","post_message":"He felt the punishment fit the crime. #WSHH #Cheating"},{"comment_id":"1350752595003273","commenter_b":"Michelle is beautiful and elegant. However, she isn't even giving Trump a chance. We gave them 8 years. I'm so grateful Clinton lost.","commenter_a":"Good answer Trump","post_message":"During an interview with Oprah Winfrey, first lady Michelle Obama said that there was \"no hope\" under Donald J. Trump. The president-elect didn't sweat it, though... his response was PERFECT. This is why Trump will be such an epic president..."},{"comment_id":"10153944733281178","commenter_b":"She should be in jail.....sick, liar.....","commenter_a":"She's mentally ill or clinically insane.","post_message":"If this came from a Republican, their campaign would be immediately over. #TTT16"},{"comment_id":"930922740261239","commenter_b":"This will be great and a good female leader not like the arrogant bitchthat we have in BC.","commenter_a":"Albertans are the dummies of politics, what happened the last time a female was in power in that province","post_message":"A ray of hope for Alberta's NDP MPs? via The Huffington Post Alberta"},{"comment_id":"1745160079101455","commenter_b":"No, I am convinced she has a serious mental health issue. She lies and lies about lying. She questions your temperament to lead? She is the psycho, literally, staying with her husband solely for political purposes while constantly defending her indefensible record of blatant corruption. And for what? Her relentless pursuit of more power to abuse. Hillary is not mentally fit to lead","commenter_a":"she looks sedated","post_message":"Bad performance with foreign policy \"speech\" yesterday, by Crooked Hillary Clinton! Reading poorly from the telepromter! She doesn't even look presidential!"},{"comment_id":"10153434193979138","commenter_b":"Time to ban women..","commenter_a":"Women are crazy!","post_message":"DEVELOPING- A St. Paul woman has been taken into custody after her boyfriend was stabbed to death this morning"}]
