[{"comment_id":"984804904949095","commenter_b":"They had the taser pointed at him which caused him to panic most likely why not use the taser??? The other 2 cops didn't shoot and did not feel they were endangered.","commenter_a":"@username keeps stirring the pot against cops. I hope one day, you folks need a cop. Crickets is all you'll hear.","post_message":"In 2013, Officer Randal Kerrick shot former Florida A&M University football player Jonathan Ferrell, who was unarmed, 10 times."},{"comment_id":"1083649161732572","commenter_b":"She belongs on the view , just her type 🐀🐀","commenter_a":"This woman is vicious & full of arrogance! Can't believe she can keep a man as her husband! Poor husband! How can he stomach this woman's character. She seems to be high all the time. Wonder if she's in session with Hillary before coming to her show. She deserves to take a hike & disappear from the Fox news screen so we can watch it again! Shooooooo Kitty!","post_message":"HOLY COW...!!!!!!  The TV fight of the century.  Newt tells Megyn she is obsessed with sex and calls her out for her pitiful coverage of Trump.  Megyn laces into Newt by telling him to get help with his anger issues.  It gets vicious.  VIDEO.  This will be the talk of the news tomorrow.  You get to see it now.  VIDEO  @webpagelink"},{"comment_id":"10154668676208797","commenter_b":"Never mind iam deaf ok that women did it .she just want money ok .","commenter_a":"I don't think johnny deep do that is her she pull her safe for money johnnydepp money I don't like her .is no alway he did her . Johnny Depp don't get married and he have his life .","post_message":"'I LIVE IN FEAR': A judge has ordered Johnny Depp to stay away from his estranged wife after she accused him of repeatedly hitting her during a fight, leaving her face bruised."},{"comment_id":"855612107818751","commenter_b":"So then please elaborate what does happen once that sperm penetrates that egg-I'll wait.","commenter_a":"The egg, once fertilized, then has to implant to become life. Not sure conception counts, not without implantation. Otherwise, you're telling every woman who takes birth control pills she is a murderer.","post_message":"The evidence is clear: life begins at conception!"},{"comment_id":"912438275556018","commenter_b":"I'll bet you make your Momma proud, dumb ass","commenter_a":"Thank you Obama.","post_message":"You got to check out this interview... Could he possibly be any DUMBER??"},{"comment_id":"1026595164030198","commenter_b":"what was this brain dead bitch watching????","commenter_a":"A dues paying member of the old hag society.","post_message":"When did Andrea Mitchell become an official spokesperson for Hillary Clinton?"},{"comment_id":"472703329582291","commenter_b":"How does Trump make Mexico pay for the wall, When America has no authority over Mexico ?","commenter_a":"We need the good people of Florida to Vote Trump!","post_message":"FLORIDA: Early voting is now open! Do not miss this opportunity to #MakeAmericaGreatAgain #Trump2016 Ivanka Trump  Find Florida early polling locations: @webpagelink"}]
