[{"comment_id":"610785519070224","commenter_b":"Check that woman's mouth for raw....","commenter_a":"Keep in mind, these people are not working real jobs.","post_message":"Has anyone seen this Fox host's soul? It appears to be missing.   -Conover"},{"comment_id":"10153141332863984","commenter_b":"She's a complete idiot. Take care of your own bratty girls and leave Americans alone","commenter_a":"Hell yeah it is!!!our kids cant eat that crap","post_message":"Really, Michelle?  Do you think that Michelle's lunch program has been a colossal failure?"},{"comment_id":"10153438263919087","commenter_b":"Lol what a pussy","commenter_a":"I a Democrat and everyone is making a big deal out of this. Give them their snacks and they will leave.","post_message":"Congresswoman Donna F. Edwards slammed the media for condemning activists protesting the deaths of unarmed black men at the hands of white police officers as “thugs, criminals and drug users” while \"a group of armed men illegally occupying a federal building have been referred to as an ‘armed militia,’ or simply ‘occupiers,’ as though that behavior is acceptable in a nation of laws.\""},{"comment_id":"10153486419716680","commenter_b":"Yeah, see you at the polls.","commenter_a":"Only because he has not been Vetted by the Media he's a very flawed man mean and nasty. He's not well like in the Senate he was not an effective Senator! once he is fully Vetted those numbers will go down! for those who are members of his Cult why don't you do more research on him? You all have that Jim Jones Mentality and are drinking his Kool Aid! You may not know who Jim Jones is? because again you know nothing about Politics or Math or Civics! You seem not to have Jobs and Mommy And Daddy never said No to you! The old goat s a lying Fraud and you believe his BS! Those are also his Initials!","post_message":"Bernie Sanders now has 48 percent support nationwide, putting him in a virtual tie with Hillary Clinton, who is at 50 percent."},{"comment_id":"1430637223901951","commenter_b":"Does anyone think she is intelligent or this helps the women's cause?","commenter_a":"I'm sure her mother is very proud.","post_message":"Classy!"},{"comment_id":"421520308036263","commenter_b":"What is this group that has an American flag on the ground to be trampled ?","commenter_a":"stupid ASS COPS.","post_message":"\"I went to pick it up because it doesn’t deserve to be on the ground.”"},{"comment_id":"466533816861832","commenter_b":"I don't know why this is article has been shared today, because it will just upset people on a Holiday and just continues to widen the divide between the people. Because we are celebrating our country, our history, and the couragous people who protect our freedom, it seems a little rude and inconsiderate to share this message. And furthermore, I do not believe the data report anymore than I can throw a cow. I believe most of us are equal in how patriotic we are or not.","commenter_a":"Conservatives only THINK they are more patriotic. Why? God, guns and gays......","post_message":"Is this poll right?"}]
