[{"comment_id":"10153222485020329","commenter_b":"George Bush","commenter_a":"How come the penis got a fun name but not the vagina???? You're all Sexist Pistols.","post_message":"Urethra Franklin FTW. (A BuzzFeed BFF original.)"},{"comment_id":"10150614186964999","commenter_b":"Amen. However they are supposedly there to educate humans. In some cases it is educating them. Unfortunately not in all.","commenter_a":"Happy would be happier with other elephants. However (if you read the article), her buddy Grumpy was killed by the other two elephants when they charged him. The Bronx Zoo is not bringing in any more elephants and would put Happy at risk with the two they have. She does need to be moved to another zoo. Maybe they all do, but there is no guarantee she will be accepted with other elephants. Sad, but maybe it's time to focus on getting rid of zoo's altogether and leave these animals in their natural habitat where they belong.","post_message":"For close to a decade Happy has lived alone, separated from the zoo’s 2 other elephants. Her solitary existence is quite unlike the life of a wild elephant."},{"comment_id":"10154752399793598","commenter_b":"They should be called feminazists","commenter_a":"So true!","post_message":"200 Million Girls Killed in China, Where Are the Feminists?"},{"comment_id":"10153389202536051","commenter_b":"Bitch your fake, n ugly to boot !!!! Fake ass , go be with Obama !!!","commenter_a":"Quick somebody wake her up! She's having a nightmare!","post_message":"This model says that after wearing a corset for 7 years and getting four boob jobs, two nose jobs, butt implants and all her teeth removed, she finally has the \"perfect\" body. Decide for yourselves if that's true."},{"comment_id":"1776189505982322","commenter_b":"dumb blonde","commenter_a":"You can't act like a 10 year old threatening to nuke someone if you don't get your way -- that's what Trump would do. Donald Trump doesn't have the temperament, the intelligence or the conscience to have these codes.#imwithher","post_message":"Republicans agree: We can't give Donald Trump control of our nuclear codes."},{"comment_id":"1700232733582570","commenter_b":"Lose with Cruz.... I like it","commenter_a":"Having recently switched parties for \"one day\" Republican status I will vote cruise to stop Trump in April 26 Pennsylvania primary then probably vote for Hillary in November. Question: what is the brand of the dress Nicole Wallace wore today?","post_message":"Joe and Mika are here to discuss the state of the 2016 race following the Wisconsin primaries – and much more! #24Live"},{"comment_id":"880245452022083","commenter_b":"@username // Lets jail women for miscarriage oh wait we already are -_-// Who's advocating to throw woman in jail for miscarriages. Again how many time's have been through this? Hiring, a contract killer to end the life of ANOTHER HUMAN BEING is NOT a miscarriage. Miscarriage's happen naturally, not by FORCED.","commenter_a":"People who cannot distinguish a fetus from an infant have no right legislating against abortion","post_message":"Tell Congress to protect ALL babies.  Click here to urge your Congressman and Senators to cosponsor the Life at Conception Act! @webpagelink"}]
