[{"comment_id":"10152814329771636","commenter_b":"The LibDems should have fought for a workable PR system when they had the opportunity.","commenter_a":"As much as I don't like the UKIP he is right","post_message":"'I now have to think seriously about my future life, and what I want to do'"},{"comment_id":"1272811836073158","commenter_b":"I wouldn't mind my dick being six feet longer","commenter_a":"Is this before or after birth......if so I know many candidates for editing DNA to make civilised human.....step forward 8b7...there are some 'adjustments' needed.","post_message":"Should we be allowed to edit human DNA?"},{"comment_id":"10153123601201051","commenter_b":"Every one that supports this is freaking stupid put the bitch in jail than when she is ready to pop take the baby put the child in a good home than hang the bitch...","commenter_a":"The woman in this picture is not 7 weeks pregnant. It is also her choice to make not mine.","post_message":"This woman is planning on having an abortion - but she says she'll cancel it on one condition."},{"comment_id":"1004626696250624","commenter_b":"Boy is she getting old!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"They show this picture to men who have had an erection for more that 4 hours, works every time!","post_message":"Make sure you let our politicians know that we will not support their abortion friendly policies! Click below to sign your petition to end Roe v. Wade today! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH15&pid=fb122"},{"comment_id":"693773307470374","commenter_b":"What a pig!!!","commenter_a":"Disgusting, just like his jackass friend! I guess that's how money talks.","post_message":"SPEECHLESS."},{"comment_id":"10153415212958984","commenter_b":"Yes Yes Yes and Amen","commenter_a":"Yes I do and I also believe the Church needs to pray. It's not just the pastors that need to send a message to our government THE BODY OF CHRIST ALSO.","post_message":"These 700 pastors are fed up with Obama pushing this agenda, and now they're sending him a clear message... Do you support what these pastors did?"},{"comment_id":"639543372893417","commenter_b":"As I said the jobs are what this is all about. Yet we continue to give unlimited tax breaks to these major corporations to stay here. Just look at all the money LOANED to GM that has never wholly been repaid and never will. Major corporations are \"pimping\" themselves out so WE the middle class can continue to pay for all their tax breaks. When our American companies relocate outside of our country they should be heavily taxed for importing there product here. Since they're paying these third world workers nothing anyway for once let's get into their profits.","commenter_a":"Oh well thank you is in order for saving those jobs. Too bad we the middle class have to make up for that $7m tax break you just gave them. What should have been done is let them leave and import their products back here and tax the crap out of them. Since they are going to pay some Mexican $2 hour. ONLY IN AMERICA!","post_message":"Trump's Carrier deal shows corporations they can: ✅ Threaten to outsource jobs ✅ Actually outsource jobs ✅ Still get a tax cut"}]
