[{"comment_id":"10153243418332411","commenter_b":"That's one ugly sumbitch!","commenter_a":"will someone puuulease show this guy the Gates of Hell !","post_message":"North Korean dictator Kim Jong Un used his annual New Year's speech to warn that his country is ready for war."},{"comment_id":"485248011623976","commenter_b":"Ugly little bitch.","commenter_a":"Bush murdered 4500 American soldiers for a lie in Iraq, got another 50,000 maimed, killed 100,000 innocent Iraquis, allowed 9-11 to happened, bungled the response to Katrina, bankrupted the nation, allowed our enemy bin Laden to literally go free, and had 9 US embassies/consulates attacked with over 90 dead, yet these mother fuckers stiil pretend to be outraged over this bullshit....republicans investigated this 9 mother fucking times, at a cost of millions of dollars, and found nothing. This is perverse. Conservatives are the worst enemy this country has ever faced.","post_message":"The GOP wants nothing less than the total destruction of Hillary. -Clay"},{"comment_id":"10153309825421770","commenter_b":"Her vagina card won't work!!","commenter_a":"The fix is in. Sorry Sanders supporters. That's bullshit that's the system is rigged against y'all. Don't worry, Trump will smash her dreams in the general election. This will come back to haunt her.","post_message":"BREAKING: Hillary Clinton wins the Nevada caucus over Bernie Sanders."},{"comment_id":"861173230647951","commenter_b":"She is crazy","commenter_a":"Just 12 years? WTF","post_message":"8-year-old Julie died the same day she was going to be a flower girl at a wedding. Her mom has admitted to killing her daughter."},{"comment_id":"10153257299639071","commenter_b":"'@username another Hilidiot who will blindly vote for a woman for no other reason than wanting a female president.","commenter_a":"Let's be honest about this. The only reason they gave back access is because a court battle over this would have revealed to the public that every democratic campaign had access to those records, and when the Sanders campaign reported it, nothing was done. Which would have highlighted not only the DNC favoritism of Clinton, but of the fact that they have been working to shut down Bernie at every turn. Which would have meant public acknowledgement of Bernie actually having a chance to win.","post_message":"Bernie Sanders sued, and the Democratic National Committee backed off, but it's not over yet."},{"comment_id":"615645605262622","commenter_b":"She probably wants to take all the women to Venus!","commenter_a":"I thought Elon Musk was a perfume!?","post_message":"Who wants to go to Mars with Elon Musk?!"},{"comment_id":"10154763479136037","commenter_b":"No surprise to Hillary. She pays for this stuff. @webpagelink","commenter_a":"No matter who ultimately did this, and I hope they are caught and prosecuted, the way both the candidates reacted tells you everything you need to know about how they will govern.","post_message":"Donald J. Trump immediately blamed 'animals representing Hillary Clinton' for the attack."}]
