[{"comment_id":"1039779686062503","commenter_b":"Oh dear Lord! Yet you can have these so called \"Barbies\" walk around nude and no brains or respect for themselves or anyone else! They rob good hearted men and steal their hearts and yet this shyt is okay?","commenter_a":"People need to mind their own business if no one is getting hurt","post_message":"Is any place safe for moms anymore?"},{"comment_id":"116808422164651","commenter_b":"Illegal immigration must first be brought under control. Only then can we regulate all immigration and I doing do Skylake washes to naturally as the flood of cheap labor is ended.","commenter_a":"END THE DRUGS COMING IN US ! WE'RE IN BIG TROUBLE WITH DRUG ADDICTION","post_message":"BORDER WALL: President Donald J. Trump is expected to sign an executive action today to jump start construction of the border wall that he promised would be built during his campaign. MORE: @webpagelink"},{"comment_id":"1140743049271284","commenter_b":"Little girl, you are asking for a theocracy, which America is not. Time for you to leave and go to Iran, pookie. No one wants your cowardly, uneducated, anti-American traitor self here.","commenter_a":"If God said it, it is settled!, no matter what any pervert says! And the supreme court is not supreme!, God is!","post_message":" represent the people, and the people have shown several times that they are opposed to this, and are in favor of traditional marriage, state Rep. Bill Chumley, R-Woodruff."},{"comment_id":"10153470128239497","commenter_b":"Get outta here!","commenter_a":"Strange new cult forming under my guidance 😈","post_message":"\"Somehow, the account management team has forged a society all its own.\""},{"comment_id":"10154421194676545","commenter_b":"My tax dollars sometimes pay for things I don't necessarily agree with. It's called living in society. Grow up.","commenter_a":"Defund Planned Parenthood.","post_message":"She will be the keynote speaker at Planned Parenthood of Greater Texas' annual Fort Worth luncheon."},{"comment_id":"1207240762629769","commenter_b":"She at the very least a pathological lair.","commenter_a":"LIKE if you agree that Hillary Clinton is MENTALLY and PHYSICALLY #UNFIT for the Presidency!!!","post_message":"Today - I outlined a plan for American economic revival - it is bold, ambitious, forward-looking plan to massively INCREASE JOBS, WAGES, INCOMES and opportunities for the people of our country!"},{"comment_id":"1215144131854339","commenter_b":"yup-knew this was coming next illegal immigrants-","commenter_a":"This is only for California elections it does not include the federal or United States presidential elections he cannot sign into law to control the federal government he only has control of the state so only state elections pertain to this law","post_message":"HORRIBLE!!!"}]
