[{"comment_id":"10150751541914999","commenter_b":"Racists get uncomfortable when a mirror is held up to their face! No problem with unarmed Black men and women being slaughtered on a daily basis in a country that prides itself on being the greatest nation on the face of the earth. I mean, even the United Nations thinks there's a problem. Go figure! And any attempt to prove otherwise just simply means you're racist!","commenter_a":"Wah wah. Shut up and do your job.","post_message":"The Miami police union say Beyoncé had aimed to “divide Americans by promoting the Black Panthers” during the Super Bowl 50 halftime show."},{"comment_id":"912646568790348","commenter_b":"@username i have worked in kane country elections for Dems for 27 years I do my home work ! Bernie only got 8 bills passed in all his 40 years in the sen!!!! Hillary in 4 years got double that!!!! Bernie is ALL TALK NO ACTION!! He is in Bed with the NRA and voted against the brady bill 5 times and voted against amber alert!!! are you kidding amber alert!!!! Now that turns me WAY of Bernie!.And I dont HATE Bernie but Hillary I feel will get the job done and I would love to see what a woman can do!!!! And please dont call me DEAR!!","commenter_a":"Bernie is telling people what they want to hear not what he is capable to really get accomplished.His promises are not doable. They are unrealistic. Hillary has already accomplished many many good things for the poor and the middle class. Bernie is running on our ticket and using us. He is not a democrat and refuses to join our party, and has scorned our party for years. He is a left wing socialist. He voted against the Brady Bill and Amber Alert. He voted to protect the gun corporations and manufacturers against any and all law suits. He said that underage teenage girls should be allowed to have sex with their boyfriends not to get cancer. ( Wierdo) He also said toddlers should be allowed to to explore their sexuality with each other. He refused to serve in our military under concientious objection during the Viet Nam War when 55,000 ...","post_message":"It is clear that the views of the right wing do not reflect the views or the needs of the vast majority of the American people. The Koch brothers and the billionaire class are way, way out of touch with where the American people are."},{"comment_id":"10153332153777377","commenter_b":"But yet Megyn cried otherwise. Such a Bimbo.","commenter_a":"BBB gave Trump an A on his Trump University, so Cruz needs to hit the unemployment line","post_message":"Ted Cruz hammered Donald Trump on Thursday, tweeting out what he called a \"Certificate of Deception\" for Trump's now-defunct Trump University."},{"comment_id":"10155187473209614","commenter_b":"Your armpit makes me gag hahahhaha","commenter_a":"let them do their job.... and yes if you are on list ...GOOD BYE !!!!!!!!!! SUPPORT ICE FOR THE MAKING AMERICA GREAT AGAIN...","post_message":"Los Angeles' top elected officials cosigned a letter  urge in the strongest possible terms that ICE immediately cease this practice in our city.  Since the late 1970s, L.A. police have worked to build trust within the city large immigrant community so those in the country illegally can report crimes and offer information to police without fear of deportation."},{"comment_id":"10153314695286051","commenter_b":"get over it, all anyone ever sees is when a black gets shot, stupid bitch","commenter_a":"Hell I don't see anything about our Military any more because all I ever see is about cops","post_message":"Two police officers fatally shot a man in Texas this week, but there’s a catch: The suspect fired multiple shots at them first. Did the officers defend themselves appropriately?"},{"comment_id":"609422632593811","commenter_b":"If it is true Hillary said that, she deserves to lose big time and go to jail.","commenter_a":"this is noy the first time she threathenn to kill him. she did little over a week ago","post_message":"Whoa. You do NOT mess with the Clintons"},{"comment_id":"1222382617796158","commenter_b":"Idiot please don't reproduce","commenter_a":"End of the circus... was a main attraction.... They do away with the side shows...then the tent... now the elephants.... Why would one even want to attend.... another bit of America down the toilet...","post_message":"Elephants performed for the last time in the Ringling Bros. and Barnum & Bailey Circus on Sunday, putting an end to the controversial practice. The animals will live at the 200-acre Ringling Bros. and Barnum & Bailey Center for Elephant Conservation in Florida."}]
