[{"comment_id":"10153184013859255","commenter_b":"ThankYou","commenter_a":"Who was it that said \"You have to have some intelligence to realize how stupid you are\"? No intelligence on display with those who still believe in the KKK. Haters and bigots.","post_message":"Another day in post-racial America."},{"comment_id":"10153896267090329","commenter_b":"How about don't send dick pics to anyone. If she wants to see it she can come over...","commenter_a":"The only one I dont support is the woman who shared a screenshot of the dick pic. Yes, unsolicited nude photos are completely uncool. BUT if a woman sent a boob pic to a dude without Asking him if he wanted one, and he shared it on the internet ... Well this would be a whole different post.","post_message":"More and more every day, women are turning to the internet to find the justice the real world won't give them."},{"comment_id":"10154506752502619","commenter_b":"Call Sarah please let me leave you with this I am Hebrew my tribe is Nazarene but I am not Jewish a lot of people and I know that you're not one of them get that mixed up quite a bit for it is possible to be Hebrew and not to be Jewish","commenter_a":"There were no unions until the 19th century when a bunch of Jewish garment workers in NYC publicly protested and marched through the streets for safe,decent places to work and a living wage. How dare this bunch of ignorant,uneducated pigs discuss human rights. They couldn't find Israel on a map if their lives depended on it. Their hatred is based on jealousy of the achievements of Israel and the will to survive in a world where hatred of Jews is very fashionable.","post_message":"Citing the Jewish state's \"long history of violating the human rights of the Palestinians,\" the United Electrical, Radio and Machine Workers of America have reportedly become the first nationwide union to join the boycott against Israel."},{"comment_id":"1207103952642966","commenter_b":"I'm a democratic and I don't like gay people at all I mean at all.","commenter_a":"I thought she was with the Inquisition.","post_message":"Kentucky clerk Kim Davis, a longtime Democrat, says she is switching to the Republican Party because she feels abandoned by Democrats in her fight against same-sex marriage."},{"comment_id":"10157124735195354","commenter_b":"They've no one to blame but themselves.","commenter_a":"Go Trump","post_message":"“Conservatives love to throw conservatives out of conservatism; it’s like an ancestral tic,” Noonan says. “But great political movements should not be run like private clubs. And have the anathemitizers noticed they aren’t in charge anymore? That in the great antiestablishment disruption of 2016 they have been upended, too?”"},{"comment_id":"915559728526390","commenter_b":"Go f u co.yourself you ugly bitch","commenter_a":"I thought this might be a joke till I opened up and read more. This is absurd. I'm just saying","post_message":"Obama just announced that he is issuing you a new Muslim holiday that you must celebrate. This is ridiculous. He can't make us do anything. Will you refuse to celebrate this holiday?"},{"comment_id":"821054791362772","commenter_b":"Keep your smug ass out of Texas !! YOU are NOT wanted here !!!","commenter_a":"Barff, She is in it for Hollywood, Wall Street and anyone with money who dumb enough to fall for that LIAR THIEF, DOUCHBAG!!","post_message":"This has to be said. Last night AP declared Hillary Clinton had garnered enough delegates -- by way of super delegates -- to secure the Democrat nomination for president. Everyone is expressing how this is a great historic moment. I agree, it is a historic moment. The new American Socialist Party, once known as the Democrat Party, now has a sitting president and a nominee for president who abandoned Americans to die and lied about it. And to all the detractors who would dismiss this, just think about the mother of Sean Smith widow and orphaned child of Tyrone Woods.and the families of Ambassador Chris Stevens and Glen Doherty. This is not a historic moment for them. It is an indictment of how America rewards the most despicable and abhorrent behavior. This is a sad day for our America -- well, at least for the mindless Kool-aid drinking sycophant followers ..."}]
