[{"comment_id":"10154159520288037","commenter_b":"They weren't misbehaving.im sure this girl was engaging in the drama as well","commenter_a":"Should've gone home and put on a Trump for prison shirt. I bet you the administration wouldn't have a problem with a short bashing a conservative","post_message":"She says she was told to change her shirt or go to in school suspension for the rest of the day because her shirt caused a classroom disruption."},{"comment_id":"1571937346447279","commenter_b":"Get a new woman then!","commenter_a":"In the singing voice of Brad Paisley: Im gonna miss her.... I love my husband AND my guns!","post_message":"'Sex strike'  WATCH:"},{"comment_id":"10153584553228010","commenter_b":"time for a woman in the white house now","commenter_a":"Don't blame me for the situation of this nation. I did not vote. I opt out.","post_message":"What if you were automatically registered to vote? Oregon has a history as a ballot-box innovator."},{"comment_id":"10153065626180950","commenter_b":"He's a dayum disgrace. Im sure Subway can't believe this saga.Jared is a sicko that needed mental help yrs ago. He failed to get it & now he pays for his sordid fetish. The inmates will love that ass.. Footlong comin for your ass Jared. Ijs !!!! Karma is a bish :(+","commenter_a":"Hope you bring Vaseline for your new job interview jared.","post_message":"JUST IN: Court hearing for ex-Subway spokesman Jared Fogle ends; he 'expects to go to prison,' his attorney says: @webpagelink"},{"comment_id":"10153100561240329","commenter_b":"She's a pornstar","commenter_a":"I'm like how'd she land that job..like what conversation took place..how's was the interview conducted..do u interview her or her vagina","post_message":"¯\\\\_(ツ)_/¯"},{"comment_id":"610785519070224","commenter_b":"Check that woman's mouth for raw....","commenter_a":"Keep in mind, these people are not working real jobs.","post_message":"Has anyone seen this Fox host's soul? It appears to be missing.   -Conover"},{"comment_id":"10154490644508132","commenter_b":"But she was slimer before","commenter_a":"Her body is not well balanced is too much up in the chest ... too much on her Back .... Kourtney and Kendall bodies are better","post_message":"Kim Kardashian West traded her neutrals and furs for a bold vibrant look! (via PeopleStyle)"}]
