[{"comment_id":"1601162620179200","commenter_b":"Idiot. Build a wall","commenter_a":"Go back to Europe white folks... This is are land","post_message":"We're at a \"wall\" of taco trucks -- a protest in front of Trump International Hotel in Las Vegas ahead of tonight's final presidential debate."},{"comment_id":"10154634366371729","commenter_b":"so now we support the lazy mongrels","commenter_a":"FLORIDA EVEN BETTER, NO INCOME TAX LOW SALES TAX AND NO COMMUNISTS.","post_message":"Of course they're moving to Texas!"},{"comment_id":"599734130175363","commenter_b":"she is such a idiot","commenter_a":"Repeat a lie long enough and loud enough . . . Welcome to Nazi America, 2015","post_message":"Temper, temper, Carly."},{"comment_id":"10153100903362061","commenter_b":"She's ugly!!","commenter_a":"Denise has had some work done.","post_message":"Juicy pop news - first photos of Kermit the Frog and his girlfriend Denise have hit the web: @webpagelink - The Muppets ABC"},{"comment_id":"594130970711496","commenter_b":"She a commie in bad clothing","commenter_a":"I'm just wonderin......Does she feel \"tyred\" these days??","post_message":"Hillary Clinton says people are \"concerned\" by Trump's \"divisive rhetoric\" and he needs to be stopped \"conclusively.\" Is she right?"},{"comment_id":"1022535797795443","commenter_b":"hahaha good one, and accurate.","commenter_a":"I flushed something more qualified than both of them this morning.","post_message":"LOL..."},{"comment_id":"715065121964948","commenter_b":"Good luck competing with India and China for FDI by multinational corporations. Unless you guys are okay with working for <US$1 an hour.","commenter_a":"Correct me if I'm wrong, cost of living will rise and NHS is at serious risk........... As far as I can see we're in real trouble!","post_message":"Is #Dexit on the cards? Could Denmark follow Britain? Paul Adams was in Copenhagen where there are already calls for a similar #EURef. You put your questions to him and Eurosceptic Danish pollster Erik Høgh-Sørensen. #FacebookLive"}]
