[{"comment_id":"890220867779354","commenter_b":"I'm sure she doesn't care. She's a coon. They love being used and abused by white people","commenter_a":"Maybe she didn't swab his knob as good as the other women at Fox News","post_message":"Ex-Fox News CEO Allegedly Referred to Stacey Dash as 'Mean Black Girl'"},{"comment_id":"10153142074684030","commenter_b":"Apparently all the men do. Lol. I've never heard of her","commenter_a":"I love Natasha Leggero!","post_message":"The Bieber roasters get a geography lesson from Natasha Leggero. The #BieberRoast premieres Monday, March 30 at 10/9c."},{"comment_id":"10153328314986051","commenter_b":"she a bitch who needs to be euthanized,,,","commenter_a":"Lost a lot of the respect that I was feeling for the pope. I don't care who he decides to visit, but why the \"secrecy\"?","post_message":"Pope Francis’s message to Kim Davis during their meeting was short and sincere: Stay strong. Do you support or oppose the stand Davis is taking?"},{"comment_id":"1561423844160413","commenter_b":"@username 😜","commenter_a":"@username me","post_message":"One 38-year-old Liverpool man took 39 goes to pass. 🚙"},{"comment_id":"10153981290586519","commenter_b":"@username The war was based on a racist desire to see Arabs burn. That's why the American people wanted it. The goal was simply to slaughter a few hundred thousand of \"them\" after 9/11, and that racism is something Clinton and half her fellow elected Democrats knowingly pandered to.","commenter_a":"The ideological purity of the Left gave us 8 years of Bush while sitting out the midterms. Sanders and his dead-enders repeat every bullshit right wing talking point. Tired of him and then.","post_message":"Establishment liberals have an unhealthy relationship with the left."},{"comment_id":"1276618955685054","commenter_b":"When are these yahoos going to discuss issues that are important to the American people???","commenter_a":"The funniest joke is Rubio not winning his own state. Hysterical. \"Two weeks left buddy, & counting.\"","post_message":"Spray tan? Is Marco Rubio trying to beat Donald Trump by doing his best impression of Donald Trump?"},{"comment_id":"886743024681887","commenter_b":"She dumb as hell she a pretry house but no one is home","commenter_a":"COMING UP NEXT..... - \"STACEY DASH\", \"APOLOGIZES!!!!\" (You SEE IT HAPPEN, All the time :\\\\ )","post_message":"Stacey Dash Believes Rape Victims Are Bad Girls Who Like To Be Naughty... @webpagelink"}]
