[{"comment_id":"514346735420286","commenter_b":"Muslims cause cancer and sure death. Let's ban them...","commenter_a":"Amazing. After all these years they find this out. I think it's a bunch of bullshit. Remember certain people hate bacon and want it out of restaurants","post_message":"WOW! NOT EXPECTING THIS!!!"},{"comment_id":"10153796772929411","commenter_b":"They kill civilians anywhere they go. Worse butchers then IS nearly..","commenter_a":"Terrible.","post_message":"US special operations analysts investigated #Kunduz hospital for days prior to the deadly October 3 attack, describing it as a base of operations for a Pakistani agent coordinating Taliban activities, despite despite repeated pleas by the MSF."},{"comment_id":"825004334282616","commenter_b":"do that and u'll have gallstone in ur bladder","commenter_a":"Dose this truly work?","post_message":""},{"comment_id":"10153647988748145","commenter_b":"She should have hit their dumb a$$es with it. Now run tell that","commenter_a":"WTH?","post_message":"After 40 minutes of trying to convince the security team that removing the prosthetic wasn't necessary, the woman was led to a private room where she was asked to remove her pants and take off her leg."},{"comment_id":"514982215334916","commenter_b":"With all the illegal immigrants crossing our borders daily, we have no control over the diseases they are bringing into the country, diseases that were eradicated here,thanks to vaccines. If there is even a small chance my child could be exposed to diphtheria, whooping cough, or the measles, or polio, you can believe I will do whatever I can to protect them from these horrendous diseases. If you want to play Russian Roulette with those chances, that is up to you.","commenter_a":"Thanks for taking the time to let us see who you really are. I am more and more impressed by you each day.","post_message":"Each night I try and carve out some time to answer questions from my friends on Facebook. You can submit your questions by sending them to me via email at AskBen@BenCarson.com. I am out in Jackson, Wyoming tonight and my, is it pretty out here. The first question tonight is one I see comments on occasionally. It is from Devon and it is about childhood vaccinations. Devon, as you know, I spent my life with a Pediatric specialty. As a Pediatric Neurologist, I feel I have a very solid understanding of the developing brain of a child. Devon as you know, my life's work was in a pediatric specialty, caring for 15,000 children to ensure that they could live full, productive, and healthy lives. I can assure you that I would never advocate for a treatment for children without fully knowing that it is safe and in the best interest ..."},{"comment_id":"1754772134792927","commenter_b":"@username is voting for hillary just because she is a female","commenter_a":"I can't wait for you to be the next POTUS @username. You've got my vote Madam Secretary. #Imwithher.","post_message":"You saw the Democratic National Convention. Now, watch the never-before-seen footage from backstage:"},{"comment_id":"1157612937618557","commenter_b":"Yes we all should judge illegal immigrants as invaders and depot them! good ppl or not they MUST GO","commenter_a":"Color Blind? All Trump has done in his campaign is judge people by there color and culture.","post_message":"Ivanka Trump on the people her father hires: \"He is color blind and gender neutral.” @webpagelink"}]
