[{"comment_id":"10153940739241178","commenter_b":"What a bum bitck","commenter_a":"IDIOT!","post_message":"MSNBC host goes on CRAZY rant about Star Wars being racist."},{"comment_id":"10153020222586051","commenter_b":"No apology for this little lady. She is too ignorant to understand who made sacrifices for her to have the privilege of saying the Pledge! Maybe she should return from whence her ancestors came from a place where I'm sure the reason they left was because they didn't have the freedoms they came to the U.S.A. to enjoy!!","commenter_a":"After all we all should be praying.","post_message":"The teacher told this girl that she had to stand up for the Pledge of Allegiance. The girl's response: No."},{"comment_id":"1733461333592333","commenter_b":"Build that wall! ! !","commenter_a":"Deport them all","post_message":"Democrats gave undocumented immigrants and their concerns a featured role on the first day of the Democratic National Convention, drawing sharp contrasts with Donald J. Trump and his hardline proposals on immigration."},{"comment_id":"1007260792718180","commenter_b":"You can cuck off to bitch","commenter_a":"So----don't sing","post_message":"Hello, it's me. I've been wondering if you think I give a crap what you think..."},{"comment_id":"10153351373259614","commenter_b":"This woman wants to make decisions for you and for me.....","commenter_a":"Dummy","post_message":"A videotaped gaffe by Rep. Loretta Sanchez has sparked outrage among those who found the comment to be racially offensive. Sanchez, a candidate who wants to replace retiring Senator Barbara Boxer, was speaking at a California Democratic party convention event when she made a stereotypical Native American \"war cry.\" Referring to the difference between Indian Americans and Native Americans, the congresswoman tapped her hand to her mouth. Sanchez's main opponent, Attorney General Kamala Harris, was later asked for her reaction to the gesture. \"I don know what to say to that. That that that shocking,\" said Harris, whose mother is Indian. (Video courtesy of Uduak-Joe Ntuk) Read KTLA's story here: @webpagelink"},{"comment_id":"10154457609673812","commenter_b":"#RIP @MuhammadAli #MuhammadAli #TheGreatest @webpagelink","commenter_a":"RIP and praying for your family","post_message":"BREAKING: Boxing legend Muhammad Ali has passed away at age 74, according to family spokesperson. @webpagelink"},{"comment_id":"1105387789537448","commenter_b":"Truly AMAZING she's still walking free, let alone running for ANY office other than cell block Queen!AND NOW the big 30 minute meeting of billy boy and AG L Lynch in Phoenix while under investigation! DEEP DEEP CORRUPTION","commenter_a":"Using her words when she said\" When Bill left office we were flat broke\". Folks that was less than 12 years ago. Pretty good return on her investments. Instead of President, maybe we should make her the Federal Reserve Chairman.------NOT","post_message":"Allen West Republic @webpagelink"}]
