[{"comment_id":"1017722631617599","commenter_b":"@username, you and your daughters are throwing your votes in the TRASH then.......smh @username 2016","commenter_a":"I hope Bill & herself have plenty of room for the Syrian refugees, since She is so kind to the terrorist islamics. #Stupid to BRING THE ENEMY HOME!!! Utterly wrong. SHE HAS #LOST my Vote... and my two daughters Votes. #MARCORUBIO will be my choice now.","post_message":"We cannot allow terrorists to intimidate us into abandoning our values. Turning away orphans, applying a religious test, discriminating against Muslims, slamming the door on every Syrian refugee—that is just not who we are. We are better than that."},{"comment_id":"1108284169190819","commenter_b":"Bitch","commenter_a":"Remember Vince Foster!! He was murdered and the Clinton's look like they did it!","post_message":"Hillary Clinton has got to be sweating this one... Do you think this Dem presidential candidate needs to be held accountable for her actions?"},{"comment_id":"1149843228370020","commenter_b":"1404343676260901house @username","commenter_a":"Chris Weishuhn","post_message":"What happens when you strap a GoPro to a giant sea turtle. Video by the WWF."},{"comment_id":"10153324267994411","commenter_b":"just for the record most women have long skirts in their wardrobes,","commenter_a":"Good decision, if she wants to live in France then she should follow French rules/laws etc and in this case the dress code, the \"its my culture\" card doesn't work in France. Which is a good thing","post_message":"A 15-year-old French Muslim girl was banned from her class for wearing a long skirt reflecting her religious affiliation."},{"comment_id":"10153740918402217","commenter_b":"Good for the women!","commenter_a":"Or are they being left to clean up the rubbish left by the men? When it all goes wrong, people of the masculine variety will blame the women when it was 3 of their number who screwed it up in the first place!","post_message":"It may be a watershed moment."},{"comment_id":"1299289040084712","commenter_b":"It was an independent anti-Trump, Political Action Committee. The chair said she doesn't support Ted Cruz. She is only anti-Trump.","commenter_a":"they attacked Melania first and Trump has as much right as Cruz does to protect his wife. If they don't want to get attacked don't attack him !!","post_message":"Nailed it, Senator."},{"comment_id":"10153558491861051","commenter_b":"Holy hells crybaby slavery ended 150 plus years ago u were no slave no one in america today owned a slave sorry your ancestors got sold to whites by other blacks and were forced to come here and work but no one alive today is responsible for it how about a lil respect for the northern army who marched on thier own people to free the blacks i always hear the we were slaves evil white mans fault but when in history has a race fought itself to free another race?so many northerners died freeing blacks for what so theu can bitch and moan and blame all whites","commenter_a":"By legal you mean taken from Africa to work (no pay, against our will, beaten, raped, broke our families a part and more), on you fields of dreams (plantations), so that American can prosper because you sure tried to make it hards for blacks, than you are white I mean right Mr (Master) Tump","post_message":"Trump says he opposes all illegal immigration, but firmly believes that legal immigrants are the backbone of America. Do you feel the same way?"}]
