[{"comment_id":"10154276693141037","commenter_b":"Hillary needs to start leaning a bit further left, and start actually addressing the issues that the voters she's not getting care about. Her 'don't be so pie-in-the-sky' attitude will cost her the election, and God only knows the price this country will pay with Trump in the Oval. Bernie is hanging tough because Hillary is not!","commenter_a":"I will only cast my vote for Bernie Sanders. Period. I will write him in if need be.","post_message":"Despite Hillary Clinton’s insurmountable delegate gap, Bernie Sanders coasted to victory on Tuesday, yet again."},{"comment_id":"10153693958978010","commenter_b":"It only takes an extra 2 hours in pouring rain. Finally home. BTW, Albert Hammond lied lied to us here. But i love that song. IT NEVER RAINS............","commenter_a":"Thanks.","post_message":"Turn on your headlights!  It's pouring outside. Here's a how-to for Southern Californians confused about driving in the rain.   @webpagelink"},{"comment_id":"10154278216444138","commenter_b":"Ridiculous. Killing all of these gators will not accomplish anything","commenter_a":"Let this had been a black family in a gorilla cage. The media would have been outraged about these alligators lives being snuffed out because of these negligent parents! If is says restricted or no swimming, then they should have checked with the lifeguard before putting their child in harms way!!! Not fair to those alligators and MOST DEFINITELY a tragedy for that child. There are terrible parenting skills on both sides. Black and white. Animal rights should have been on this just like Harambe. But then again, it was never about the animal. These parents should have been charged with the endangerment of their baby. Period.","post_message":"A total of six alligators were removed."},{"comment_id":"1071811879506489","commenter_b":"^ and I can see you sucking my cock @username.","commenter_a":"I can see Cruz flying a plane into a building or mountain.....","post_message":"Ted Cruz recently compared himself to Galileo, and compared those who accept climate change to flat-Earthers.  No. Just no.  Image via Forecast the Facts."},{"comment_id":"1012584022097710","commenter_b":"Yes, it is so obvious, but people in general are very ignorant, they think it will never affect them. Well, it is already affected them in America, in Europe and elsewhere. The Muslim radicalism is taking over the World and nobody cares! Israel is the country that knows what is all about and suffers from constant terror and constant criticising from the stupid World leaders who sold their countries, the culture and civilisation of thousand years to savages.","commenter_a":"Key Positions in our government ! @webpagelink/ CANNOT TAKE THE CREDIT FOR THE BELOW. REPOSTING To President Obama: It was you who told an Islamic dinner - 'I am one of you.' It was you who on ABC News referenced - 'My Muslim faith.' It was you who gave $100 million in U.S. taxpayer funds to re-build foreign mosques. It was you who wrote that in the event of a conflict -'I will stand with the Muslims.' It was you who assured the Egyptian Foreign Minister that - 'I am a Muslim.' It was you who bowed in submission before the Saudi King. It was you who sat for 20 years in a Liberation Theology Church condemning Christianity and professing Marxism. It was you who exempted Muslims from penalties under Obamacare that the rest of us have to pay. It was you who purposefully omitted - 'endowed by our Creator' ...","post_message":"Ignorance isn't bliss if it's harming people..."},{"comment_id":"10155823067465492","commenter_b":"Oh God there she goes again someone gotta find this chick a map","commenter_a":"Thank you Di Blassio!","post_message":"'We are currently investigating and stand ready to assist the NYPD in bringing these individuals to justice,' an Uber spokesman said."},{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx ' you big dummy '","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."}]
