[{"comment_id":"10153182332356051","commenter_b":"i dont read anything about this lying bitch","commenter_a":"Hell no","post_message":"Here is how Hillary Clinton is defending herself against the e-mail scandal. Do you believe her?"},{"comment_id":"1823601691207734","commenter_b":"Share it with everyone, we must insure Hillary is not elected!","commenter_a":"'BILL CLINTON'S LOVING WIFE --- by DICK MORRIS If you happen to see the Bill Clinton five minute TV ad for Hillary in which he introduces the commercial by saying he wants to share some things we may not know about Hillary's background, beware as I was there for most of their presidency and know them better than just about anyone. I offer a few corrections: Bill says: 'In law school Hillary worked on legal services for the poor.' Facts are: Hillary's main extra-curricular activity in 'Law School' was helping the Black Panthers, on trial in Connecticut for torturing and killing a 'Federal Agent.' She went to Court every day as part of a Law student monitoring committee trying to spot civil rights violations and develop grounds for appeal. Bill says: 'Hillary spent a year after graduation working on a Children's rights project for poor kids.' Facts are: Hillary interned ...","post_message":"He actually said it."},{"comment_id":"10152740585827426","commenter_b":"You are happy a man is now dead? Does that make you better than him? If you claim that he was a bad man, how do u know the people he wanted dead weren't bad men too? I'm glad you find satisfaction in a human beings death like some sort of animal","commenter_a":"Heck yeah!","post_message":"An internal investigation into Shannon Crane’s death is underway."},{"comment_id":"1386005081478024","commenter_b":"Thank God! We are the voice of this babies.","commenter_a":"So let me get this straight.. These wingnut lefty/leberial woman who are marching all over today are really attempting to fight over their treasured planned parenthood. They want to keep the free goverment 'healthcare' for women. Correct me if I'm wrong but, isn't their local welfare office giving out medical cards to cover 100% of their 'healthcare' needs?? Oh wait, this is primarily an adult sized temper tantrum because they want the right to abort babies. PLAIN AND SIMPLE. Can't wait for Trump to sign the bill for defunding😡🇺🇸","post_message":"Baby-killing organizations that have been using government money to fund their sick, worldwide abortion agenda just got some seriously bad news... here's what Donald J. Trump just did to send them into total panic.  A lot of liberals are going to be furious about this... what do you think?"},{"comment_id":"10154739260431509","commenter_b":"2","commenter_a":"Let's make a small poll: 1- Donald Trump 2- Hilary Clinton","post_message":"What was meant to be a fun day of riding roller coasters at the amusement park turned into a very scary ordeal for this family."},{"comment_id":"10152988460430090","commenter_b":"Don't believe this stuuuupiiidd libtard propaganda!!!!!!! 64% of AMERICANS want the PIPELINE built l!!!!!!!!!!!!!! It will create 40000 jobs!!!!!!!!!","commenter_a":"So what that the Keystone has passed the Senate! That makes this oil no less dangerous to the American people! He has every right to veto something that only benefits 2 people, and of course those who were paid, Republicans and Democrats alike. Some ' American people' you are! Traitors to your own land! My guess is that none of you have read about the countless oil spills going on at this moment in America and Canada. With the Keystone XXL, you get only larger amounts of oil in our ecosystems. Yellowstone already has at least 50,00 gallons of oil in it!","post_message":"The House, the Senate and the American people have spoken.  Tell Obama: DO NOT VETO: @webpagelink"},{"comment_id":"10152747797741051","commenter_b":"Not a nun no more now she's a sum cause that's what she got","commenter_a":"I thought nuns were sworn to celibacy","post_message":"A nun was rushed to the hospital with extreme pains. When the doctors told her what was happening, she couldn't believe it."}]
