[{"comment_id":"10155922190175725","commenter_b":"#FuckTrump","commenter_a":"Trump 2016!!!","post_message":"Watch my interview with Eric Bolling that aired today- @webpagelink"},{"comment_id":"10153394285461336","commenter_b":"We love them white girls","commenter_a":"All you Mexican ' s love Mexico so much why did you leave ???","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10156846569325354","commenter_b":"Get a life lady.","commenter_a":"Freedom of speech is the culprit! Quick! Stop that first amendment drivel!!!","post_message":"It's starting..."},{"comment_id":"10153494218169705","commenter_b":"If only we had as much passion directed towards stopping child slave hunters around the world","commenter_a":"Betty is a National Treasure and girlfriend can let loose whenever she wants","post_message":"Betty White has some harsh words for the Minnesota dentist."},{"comment_id":"1100432766685506","commenter_b":"F**k Obummer and his illegal aliens...","commenter_a":"Prayers","post_message":"OBAMA'S LEGACY: Veteran Kills Himself After Call To VA Suicide Hotline Goes To Voicemail    Meanwhile Obama Hotline For Illegal Aliens To File Complaints About Border Patrol Remains Fully Staffed"},{"comment_id":"10152781653123717","commenter_b":"That girl needs some help!","commenter_a":"wtf is that on the bottom left?","post_message":"Manchester police say an investigation into prostitution in the Queen City led to the arrest of six people. @webpagelink"},{"comment_id":"1100928479922812","commenter_b":"Do you even beleive in smart women?","commenter_a":"Maybe compared to all the stupid people who support them they seem smart. The one eyed man is king in the land of the blind !","post_message":"I am not one of these people that thinks Hillary Clinton is The Smartest Woman in the World.  I don't think Elizabeth Warren's The Smartest Woman in the World.  What happens here is that whatever liberal female rises to prominence, it's just standard operating procedure that the media and everybody's gonna refer to them as The Smartest Woman in the World."}]
