[{"comment_id":"1522438461149611","commenter_b":"OMG!! She has loads and loads of BULLSHIT in there!!!","commenter_a":"GOT METH?","post_message":"There's been lots of speculation about what might be ailing Hillary Clinton, if anything. One dental expert took a look inside Hillary's mouth... and almost instantly, he said he knew the condition that's been causing all of her health problems. Could this expert be right?"},{"comment_id":"10156409954230354","commenter_b":"DUMBASS BITCH STRIKES AGAIN!!!!!#","commenter_a":"Get her out of the power supply. Feel for your own residents. One bankrupt San Bernardino. Please give our city hope .","post_message":"Nancy Pelosi’s message to Americans this Thanksgiving is that the nation’s “broken immigration system” is “cruel” to illegal immigrants. No mention of the THOUSANDS of victims of criminal illegal aliens. Pass the turkey..."},{"comment_id":"525857150938198","commenter_b":"She is the female anti-Christ.","commenter_a":"Oh but there are plenty of sheep out there that think this idiot is wonderful how stupid can people be???","post_message":"Hillary Clinton's sex slave just exposed her for doing THIS. What a disgrace. She will never be president. Can we get 20,000 'LIKES' to make sure Hillary never becomes president?"},{"comment_id":"1137271292959073","commenter_b":"Sexist sad people. You know your mother is a woman!","commenter_a":"Hillary is amazing she is a rock! She doesn't go after fantasies, She will be a president like no other. As a female she will be challenged more harshly. Where is her compassion? Where is her Honesty? Where is her strength? Please don't forget she is already feeling and applying all these quialities!","post_message":"“I will absolutely protect your children, yourself, and try to bring your family back together.\" At the #DemDebate last night, Hillary spoke with the mother of five children who have not seen their father since he was deported three years ago."},{"comment_id":"726825177508060","commenter_b":"Muslims offend me. Make them leave.","commenter_a":"God help us all. Leave your American Flag flying high. I sure will. It's OUR country. If u don't like it----- get the h---ll OUT. We didn't invite u here.","post_message":"Texas man ordered to take down American flag because it offends Muslims. In our country we fly our flag. This is absurd. Do you think this is ridiculous?"},{"comment_id":"10154590709007955","commenter_b":"Of course. He has already done a lot for the USA. Keep going President Trump. Pay no attention to the meaningless leftists.","commenter_a":"absolutely","post_message":"Do you think Americans need to give Trump more of a chance to succeed as president?"},{"comment_id":"10152659193766680","commenter_b":"Not for the people in charge.","commenter_a":"They're right, our presidential debate system is broken.","post_message":"The group aims to make it easier for independent candidates to get a coveted spot on the national stage in the fall of 2016."}]
