[{"comment_id":"10152594464675927","commenter_b":"Go F♤♤K yourself Hussein, and that thing you call a wife !","commenter_a":"speaking OF ' ignorant'...","post_message":"You should NEVER apologize for being a proud American.  NEVER."},{"comment_id":"1124493864242596","commenter_b":"I'm not sure why he was with her to begin with if that's the way she feels. She apparently doesn't have the same Christian values, which could only result in disaster for any potential marriage. Tim, you can do much, much better!","commenter_a":"Tebow is a good man......I couldn't care less about his football abilities...","post_message":"Tim Tebow loses girlfriend over Christian values."},{"comment_id":"10153259409494060","commenter_b":"Having engaged in a few discussions on the subject of party politics, I think the results of this quiz might suprise some of you. Go on give it a go.","commenter_a":"Could be good if it was resposnsive!","post_message":"Attention all eligible Britons! Not sure how to vote in this year's election? Take our election quiz: a blind test of the parties' policies. Then get yourself to a booth on May 7th @webpagelink"},{"comment_id":"10153171665732235","commenter_b":"LMAO!","commenter_a":"you know who else loves snow days? SATAN.","post_message":"Good grief."},{"comment_id":"371202926416555","commenter_b":"^^^Suck one, racist prick !!!","commenter_a":"What's missing? Blacks!!","post_message":"Real Protest = No Damage www.eaglerising.com"},{"comment_id":"10155339234553132","commenter_b":"Why have this girl on TV really it is ridiculous !","commenter_a":"Take all her electronics away....and Danielle's too!","post_message":"Danielle Bregoli is back, and she not mincing words."},{"comment_id":"10154324674924916","commenter_b":"'@username, She's actually the lesser of two evils.","commenter_a":"When you cast your vote for an out right bull shitter, who hasn't one damn idea of how he's going to run the country, except to say, 'it'll be better', your one dumb son of a bitch, and your dragging the country into the gutter.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
