[{"comment_id":"10153659904056770","commenter_b":"PEOPLE GUESS WHAT SHE WORKS FOR HILLARY NOW...","commenter_a":"Interesting Demcratic take on LGBT, since it's rumored that Hilary herself might fall into this category!","post_message":"Recently leaked emails from the Democratic National Committee revealed staffers had some less than LGBT-friendly comments."},{"comment_id":"10152792831586130","commenter_b":"Nasty booby feeders??? Really thats ignorant! Howbabout you eat on a damn toilet and tell us how that goes","commenter_a":"Do that in private...how is that difficult?! Restrooms...everywhere!","post_message":"In a time when women are often shamed for nursing their children in public, it's good to know that one of the world's most influential leaders is in support of breastfeeding mothers."},{"comment_id":"415868471934780","commenter_b":"as soon as they put one foot on our soil we must be ready to drop bombs on them.","commenter_a":"I am ready for them arats.","post_message":"They're here!!"},{"comment_id":"10154178824428987","commenter_b":"I had guillian.barre in 1976 do i have a greater risk of contracting the disease?","commenter_a":"Nice smile","post_message":"Talk to us. Zika questions?"},{"comment_id":"10152747219056051","commenter_b":"This is soooooo wrong and why can't these cases be corrected immediately when the proof comes out. The women who do this should be prosecuted and pay for All damages!","commenter_a":"Back in 1990 I had to pay 400 a week child support for 3 kids the courts let me have custody of my oldest boy gave the ex-wife custody of the three youngest the day that we walked out of the courtroom the ex wife let me have the other three children two years later the welfare department came to me and told me that I have to pay back the last two years of u living expenses that they was giving her she forgot to tell them that she was getting 400 a week the last 2 years took me 2 years in the court system to fight it the system does not like to put women in jail so I know what you are going through","post_message":"This man had an arrest warrant issued for him and got threatened with jail time over unpaid child support. There's just one problem."},{"comment_id":"1158715757578534","commenter_b":"Jail house for this chick!","commenter_a":"Sorry don't remember any championships","post_message":"It's just a matter of Hillary living the rest of her life out in prison or free.  Do you want to see Hillary go to JAIL?  @webpagelink"},{"comment_id":"1676347295991211","commenter_b":"Of course she would praise him. He is a lying louse like her husband.","commenter_a":"Libtard !!","post_message":"Michelle Obama is sending a message to Donald Trump."}]
