[{"comment_id":"495965727273607","commenter_b":"we don't want that pussy here anyway","commenter_a":"Whatever","post_message":"Bruce Springsteen and Bryan Adams are HUGE Hypocrites!!!  They play their \"music\" in countries that throw gay people off buildings, but ban perverts from going into a little girls room and all of a sudden they got a problem???P"},{"comment_id":"1920926941484648","commenter_b":"Worst president ever... and she's never been a First Lady... low class trash is what she is!","commenter_a":"Not at all","post_message":"Are the Obamas a good representation of the American people?"},{"comment_id":"10153860997211756","commenter_b":"He is a hero","commenter_a":"Traitor!","post_message":"Snowden tweeted \"Can you hear me now?\" then had an exchange with astrophysicist Neil deGrasse Tyson covering Mars, cat pics and labels."},{"comment_id":"10155091471801579","commenter_b":"Anything to shut down that lying screeching woman!","commenter_a":"She knew it was coming. It was part of her plan. It's all about playing the victim. Raising money.","post_message":"Uh-oh"},{"comment_id":"10154380401494071","commenter_b":"Uh oh, there it is again \"Nasty woman\". But she is right.","commenter_a":"Hannity. Your rating might be high among poorly educated Trump supporters who love seeing you licking his butt.","post_message":"Sean Hannity railed against Joe Scarborough in defense of top Trump advisor, Stephen Miller."},{"comment_id":"1589692694655762","commenter_b":"Nothing racist about, I have the same problem. Some do not understand us and takes forever","commenter_a":"How can you criticize this? Who actually likes calling those?","post_message":"\"So I called up, under the guise I’m checking on my card. I say, 'Where are you from?' They say, 'We are from India.' Oh, great. That's wonderful. Thank you very much,\" Donald J. Trump said, signaling as if hanging up a phone."},{"comment_id":"585591074975467","commenter_b":"He must be some form of illegal alien. Where do orange people come from?","commenter_a":"Prepare for 4 years of unrelenting mocking until you take this job seriously and treat people with respect","post_message":"Trump is such a crybaby..."}]
