[{"comment_id":"1178660005508189","commenter_b":"You're a dumb cow lol grow the fuck up","commenter_a":"She is a stupid mom, not the way she feeding the baby, where or when, the way she treat the baby after feeding, you stupid cow, be more gently, you don't have to punch the baby back so bad,","post_message":"Why doesn't she just go into the bathroom to breastfeed her baby? Her answer is perfect. A video by Jess Blank, with special thanks to Rachelvfitness."},{"comment_id":"10154013744111378","commenter_b":"Facepalm! So because we have rapists in this country, we should import more?","commenter_a":"No more refugees! Too many of them seem to be mentally ill.","post_message":"Olango arrived in the U.S. in 1991 as a refugee from Uganda."},{"comment_id":"1752150585035881","commenter_b":"@username WE ARE GOING TO WIN HITH Hillary Clinton","commenter_a":"Interesting double standard. After all the horrendous things he's said about her this campaign, and the pathetic name calling, she offers one funny and spot on zinger and once again he has to have the last word.","post_message":"Watch the moment Donald J. Trump called rival Hillary Clinton \"a nasty woman.\""},{"comment_id":"950601424986485","commenter_b":"It is none of your concern if a person has an abortion, mind your own business!","commenter_a":"if a woman is too careless/stupid to not have 'protected' sex, then she gives up her right to murder an innocent child! BE A RESPONSIBLE PERSON not a murderer!!!!","post_message":"An excellent idea!"},{"comment_id":"1032254556867364","commenter_b":"I wonder if she was addicted to the same drugs smuggled across the Mexican border due to our insufficient border protection... #TRUMP16","commenter_a":"Oh Chelsea, what a story you have now, and a calling for the rest of your life... Nobody can tell the story you have to tell now!!! Hold on to that sobriety and to God, one day at a time... I love this... And love how well Hillary listens... #ImWithHer !!!!!! Sobriety means EVERYTHING!!!!! The best thing, of course, is to never even START drugs....","post_message":"\"I started doing drugs when I was 12 years old. At 15, I was doing anything I could really get my hands on.\" Substance abuse and drug addiction hurt our kids, friends, neighbors, and loved ones. We've got to solve this."},{"comment_id":"10154065834906323","commenter_b":"Britain has more than enough/too many home grown criminals, that's very true. So what kind of imbecile would want to import more? eg: 1,000 immigrants. 999 workers/1 criminal. That's one too many. How to stop the criminal entering? Let none in. How simple is that?","commenter_a":"I didn't know all UK citizens were perfect law abiding citizens. Those who live in glass houses ... The important stat is crimes per person, EU citizen vs UK citizen, but that'll probably be inconvenient for the leave campaign as most EU immigrants are educated, employed, and tax paying.","post_message":"A dossier of murders and rapes committed by 50 EU citizens in Britain has been published by leading out campaign group Vote Leave, in a move described by critics as “scaremongering of the worst kind”."},{"comment_id":"1362231057136004","commenter_b":"Why should prayer bother an atheist? Bc deep down they know that God is real.","commenter_a":"Keep standing up for God, no matter what anyone says.","post_message":""}]
