[{"comment_id":"10154686014913010","commenter_b":"That idiot grabs my pussy and makes it hurt and I dont even have one","commenter_a":"Wow I can sleep better","post_message":"At least one prominent Republican is still backing Trump."},{"comment_id":"10153815263206336","commenter_b":"Don't let illegal immigrants hijack the Democratic Party!","commenter_a":"Kinda trashy.","post_message":"Did this video go too far?"},{"comment_id":"10154949669541037","commenter_b":"Great, ban it in the entire America now. God didn't create us females to abuse our bodies atall. You could always give up for adoption if it's already done. But prevention is better.","commenter_a":"Here we go....","post_message":"The law bans abortion once a fetal heartbeat can be detected, as early as six weeks after conception."},{"comment_id":"1026494337483744","commenter_b":"#MakeWhiteAmericaGreatAgain","commenter_a":"How about instead of protesting they work on getting jobs and off the system. I'd love to go to the inauguration but I have a job and millions of people on welfare are counting on me every day to work so they can freeload.","post_message":"Unbelievable..."},{"comment_id":"10153200958788837","commenter_b":"?","commenter_a":"That cop needs to be arrested for having an illegal \"agresive breed\"","post_message":"PUPPY THROWN - Local 10's Michael Seiden has the latest on a poor little puppy that was thrown from a passing car right near the North Miami Beach Police Department"},{"comment_id":"10153544457476509","commenter_b":"Thanks","commenter_a":"Why are animals doing what animals do all of a sudden national news?","post_message":"What a catch! Hear photographer John Bailey describe stumbling onto the powerful sight of a bobcat pulling a shark from the ocean: @webpagelink"},{"comment_id":"10154243663794160","commenter_b":"I bet he's caring a lot more women. As a woman, couldn't vote for Clinton. As a woman, she's an embarrassment to women.","commenter_a":"I pray, I pray, I pray","post_message":"Donald J. Trump is losing female voters."}]
