[{"comment_id":"10152973367828271","commenter_b":"Now he will have to keep finding more blondes that look like his ex wife","commenter_a":"Where do I apply for this job. I have a lot of worthless information that I would love to be paid for. 😂","post_message":"It's over: @webpagelink"},{"comment_id":"930468930346189","commenter_b":"It's an interesting idea but she is much older. Re pose these with young girls and I guess there would be little difference.","commenter_a":"Stop making stupid people famous","post_message":"Fashion ads recreated by a normal woman"},{"comment_id":"622739101214748","commenter_b":"Yes, what has she done in her young life to deserve a 900,000 dollar a year job? Oh ya, she works at mommy and daddy's \"foundation\", sorry, money laundering facility!","commenter_a":"Is she billys daughrer or NOT","post_message":"Multiple Choice Quiz time, kiddies! Which answer did you chose? A or B? @webpagelink"},{"comment_id":"10154828234334714","commenter_b":"No vote Hillary & she have problem health. Prison Hillary.","commenter_a":"I'D EVERYONE!!!! don the con has his sheep voting twice three times in some places!!!","post_message":"Democrats will seek court action to preemptively block potential voter harassment from Republican poll watchers."},{"comment_id":"10154395372381656","commenter_b":"@username let me guess you stand on a corner and watch to see if there anyone putting up a sign after you park legal must work for city and help a 5 man team screw in a light bulb....","commenter_a":"Don't park in a tow zone and you'll be fine. lol.","post_message":"\"None of us has been arrested for stealing,\" he said."},{"comment_id":"10153880559652411","commenter_b":"I hate to see what she did when she got home!! Poor Billy run bill run!!","commenter_a":"Trump won hands down. Put her on the defense from the beginning and she stayed there. She just gave America that fake smile like she always does and then pretends everything is just perfect. Give me a break! I know she was extremely angry with some of the truthful comments Trump was saying and I could see that in her facial expressions. If it wasn't for the liberal media Trump would be miles ahead!","post_message":"#KenBone's overnight fame was fueled by his snazzy red sweater, white shirt-tie combination, his thick mustache, his disposable camera and of course, his catchy name, according to social media."},{"comment_id":"10154522973374102","commenter_b":"She may be the lesser of two evils, a female, a scapegoat, but she's still a nut job.","commenter_a":"I'm not saying she doesn't deserve disciplinary action, because she does. But I find it disgusting that they are targeting ONLY her, and not Trump's tweets against Nordstrom. I get that she's an easier target for the GOP, but grow a pair of balls, please.","post_message":"BREAKING: The Republican chairman of the Oversight Committee is recommending disciplinary action against Kellyanne Conway for promoting Ivanka Trump products from the White House, including \"reprimand, suspension, demotion, or dismissal.”"}]
