[{"comment_id":"1728764820743963","commenter_b":"That lady is just jealous because she is a mean n nasty lady n because she COULDN'T do it she has to be a d-bag....good job Bindi","commenter_a":"People are very cruel. God bless you bindi and your family. You were amazing and your dad was watching you sweetie .","post_message":"Oh no... I'm praying for Bindi Irwin."},{"comment_id":"1123357077760543","commenter_b":"She's gonna drop-kick Trump in the general election!!!!","commenter_a":"America actually did stop being great, but not for you because you a corporate puppet","post_message":"\"We don't need to make America great again. America has never stopped being great,\" Hillary Clinton delivers victory speech after #SCPrimary win: @webpagelink"},{"comment_id":"982612308510776","commenter_b":"@username killary LIED to the FBI, congress and all of America, she's perhaps the BIGGEST LIAR and MOST CORRUPT politician ever in America, she cares for NO ONE but herself and power, wants OPEN BORDERS, over 600 thousand more refugees to come into this country, continue obummers FAILED agenda, supports abortions up until time for birth and you support her. Neither candidate is a good choice but a vote for killary is a vote to destroy America, soon socialism and like obummer she supports the New World Order, please open your eyes and use some common sense before you vote to destroy America","commenter_a":"No, Hillary is not completely rattled. She's going to win in a landslide and is now closing in on a Democrat-controlled congress. You all need to get real, regroup, and try again in 2020. Good luck.","post_message":"Hillary is completely rattled after Trey pulled this out... It's over. No one can hide from him. Let's him know he's not alone. Can we get 30,000 'LIKES' for Trey to bring Hillary to justice?"},{"comment_id":"10153166986805950","commenter_b":"Your lies are quite bare in the fact that Trump never said Mexicans are problem. He said ILLEGALs are problem. Legal and citizen Hispanics support him because liberals want to keep the illegals to keep wages down. Just like the South wanted to keep slaves for cheap labor. Guess who's hiring underpaid illegals for farming? California!","commenter_a":"The Anti-Defamation League is dead on. There were people with guns that stood up to the Nazis and they were wiped out with brutality. Additionally Hitler campaigned a lot like Trump promising to make Germany great again, riding into power on nationalism. Hitler sold the ubermensch and the German people bought it and you can't have superman without inferior beings to crush. European Jews were the scapegoats he needed, he pinned all German problems on them. Hitler preached that it was their fault, they were the reason Germany wasn't as great as it should be and Germans bought it. (Does that song sound familiar?) Every German could have ten guns and Hitler still would have come to power.","post_message":"Presidential hopeful Dr. Ben Carson Carson said that he believed \"the likelihood of Hitler being able to accomplish his goals would have been greatly diminished if the people had been armed.\""},{"comment_id":"1207859512585616","commenter_b":"Kick her out!!!! Dishonorable discharge!!!!","commenter_a":"She should be discharged, and labeled as an undesirable. Her fellow sailors cannot depend on her to have their back in a time of need.","post_message":"A Navy sailor made national news when she decided to film herself not standing for the flag. Now, she's in trouble... here's the swift justice she received. Do you think she got what she had coming to her?"},{"comment_id":"10156232321860354","commenter_b":"Go make us a sandwich bitch!","commenter_a":"Ah shit","post_message":"Get ready. Here it comes..."},{"comment_id":"1528359970798514","commenter_b":"Hillary is a traitor!","commenter_a":"At what point do you recognize the whole process is a farce and Hillary's presidency has been predetermined and bought since 2008?","post_message":"What questions do you have about the Democratic and Republican primary races? We are live with WSJ's Aaron Zitner and Dante Chinni now."}]
