[{"comment_id":"10153963116971341","commenter_b":"Better one soldier in jail and one terrorist dead then one terrorist in jail and one Israeli dead. That Palestinian is a terrorist who tried to stub innocent civilians.","commenter_a":"A large proportion of the Israeli population supports these extra-judicial killings @webpagelink","post_message":"\"What happened in Hebron does not represent the values of the Israel Defense Forces.\""},{"comment_id":"10154066613342908","commenter_b":"It already IS that way. I'm all for him too, but he's big moneys' worst enemy.","commenter_a":"Tell 'em like it is, Bernie!!!","post_message":""},{"comment_id":"10157024443115354","commenter_b":"But you'll let your politicians scrub the term \"illegal alien\" from your laws!!! Just another step towards amnesty!!!","commenter_a":"We began a WRITE IN campaign for Donald Trump in Colorado. We will show America we can not only Recall Libtard Legislator's who go after our Gun Rights, we will also go after Fascists hidden in the GOP.","post_message":"Colorado Republicans OUTRAGED..."},{"comment_id":"10153543271535950","commenter_b":"If it said \"build a wall to keep the women in their place\" would you be offended?","commenter_a":"OMG get the crisis team there quick. It's a free speech wall that can only be used for their personal agendas and things they agree with . Poor pansies. Oh and make sure the crisis team comes with their prescription pad.","post_message":"The Ohio University wall has been an outlet for free speech for more than 40 years. But some students say the latest Donald J. Trump-related message went too far, and they decided to do something about it:"},{"comment_id":"1211860118868990","commenter_b":"Hopefully Bernie can take control of congress, and we can keep moving this country forward! #DontPushAmericaBackwardsAgain","commenter_a":"It's gonna be ... Huge ...!","post_message":"I hope today we defeat Donald Trump, and we defeat him badly. iwillvote.com"},{"comment_id":"10153260544144614","commenter_b":"What a coward b*tch","commenter_a":"Wow, he smacked that kid like it was a game! He needs his adult status revoked.","post_message":"Disturbing surveillance video shows a young boy being slapped by a man and falling to the ground in a Bakersfield grocery store. Justin Whittington, 23, was taken into custody in connection with the incident after the video was posted on social media and went viral. He was being held on $1,000,000 bail. The boy was not seriously injured, authorities said. Read KTLA's story here: @webpagelink"},{"comment_id":"10153441853036336","commenter_b":"A real lady doesn't hit a man. Haha.","commenter_a":"So how many times did he need to get hit by her before protecting himself?? She swung first...","post_message":"A Florida State Seminoles Football quarterback has been dismissed from the team after police released shocking video footage that shows the freshman punching a woman."}]
