[{"comment_id":"10153024604841037","commenter_b":"Black people should pay more TAX","commenter_a":"Poor Bill, women coming from everywhere trying to get a payout. I believe you Bill.","post_message":"A model who claims #BillCosby assaulted her at the Playboy Mansion met to pursue criminal charges"},{"comment_id":"10153132641871051","commenter_b":"Wow marla racist much? What else can we minorities thank you whites for?","commenter_a":"REMOVE YOUR HEAD DRESS!!!!!I!!!YOU'RE IN MY COUNTRY NOW HABIBA!!!!!!❤","post_message":"The police told this woman: take off your head scarf or you’ll be sorry. She didn’t take it off."},{"comment_id":"10153067204246636","commenter_b":"Is she ? So sex with her is ok?","commenter_a":"Slaughter of the baby is hardly justice for the rape. Two wrongs don't make a right.","post_message":"He claimed there are always 'two victims' in an abortion"},{"comment_id":"10153550726385575","commenter_b":"Idiots! !!!! GO TRUMP!","commenter_a":"Illegals have Togo . They drain our resources , disobey our laws , take our jobs. Trump is right. If you want to be in the USA do it right","post_message":"The Gateway Pundit - Jeb Bush Bashes Donald Trump After Debate – Defends Illegals (VIDEO)"},{"comment_id":"10153155195841323","commenter_b":"It's dangerous to be right when the government is wrong. -Voltaire","commenter_a":"reminds me of the USA..","post_message":"Inside B’Tselem, the Israeli human rights group accused of treason for documenting the violations of its own government."},{"comment_id":"1173282172788559","commenter_b":"Sick sick woman","commenter_a":"How evil can these people be","post_message":"Oh. My. Gosh. Things just got weird really quick. @webpagelink"},{"comment_id":"517409361772081","commenter_b":"Gina, Your hypocrisy is the true embarrassment to this country","commenter_a":"That gold digger hooker and Trump is everything that is wrong with corrupt capitalism. Trump and his bailouts and bankruptcy. People think he loves this Country when all his jobs are overseas! He makes me sick with all his lies. I will turn democratic before that bozo clown gets my vote. Donald Duck is a embarrassment to the American people, especially to the Republicans!! He needs is a psychologist not the White House","post_message":"\"When I don't agree with something, I tell him.\"  Melania Trump, wife of Republican frontrunner Donald J. Trump, said she is not a \"yes person\" to her husband, and in fact told him to go lighter on Jeb Bush earlier in the campaign. @webpagelink"}]
