[{"comment_id":"934398819989704","commenter_b":"Apparently, the right-wing cannot get enough of their failed foreign policies. Now, all they need is another Bush in the White House.","commenter_a":"Derp","post_message":"He's baaaaack..."},{"comment_id":"1437463806270353","commenter_b":"Can Hillary come to Texas?","commenter_a":"We don't care much for you here in Houston either, Trump. Just wanted to let you know that before you get down here and make ya self at home","post_message":"Heading to Houston, Texas now -- just informed that two police officers in Fort Worth have been shot. Please join me in keeping them in your thoughts and prayers this evening."},{"comment_id":"604349323031583","commenter_b":"You're an idiot. It doesn't matter what book you use to swear I could use The Heir to the Empire by Timothy Zhan and that would be acceptable. This is a secular country not a Christian nation if you want to argue that fact look up the 1st ammendment which is the freedom of religion and freedom from religion in addition to separation of church and state. If she wants to use the Quran let her if you want to use the Bible fine if I want to swear on a star wars book damn those corrupt judges I'm going to swear on my Star Wars book","commenter_a":"No. We use the Bible in this country.","post_message":"Should he have allowed her to take her oath on the Koran?"},{"comment_id":"508999315933206","commenter_b":"Well done Doc! I too wish you had more airtime, but we that follow you know!","commenter_a":"You are my 2nd favorite candate running. Would be 1st if not for you shaking hands and smiling with Al, Sharpton! Al Sharton!!!' What good can he possibly do for you?!!!!","post_message":"A leader listens when the American people speak. Unfortunately, our stage was filled with plenty of rhetoric and shouting politicians. I want We the People to know I hear you. Although I didn’t have much time to share my common sense solutions with you on stage, I look forward to continuing my clear, concise vision with the American people as I did tonight. Even more, it’s clear that the people were listening – we gained over 100,000 friends and patriots on Facebook during the debate. I am humbled by our over 400,000 Twitter followers that made us the Most Mentioned candidate on Twitter during the debate. We the People are fighting for freedom, and tonight is proof that the American people are winning."},{"comment_id":"1084846008220301","commenter_b":"It's past time for the GOP to get behind Trump as front runner and he is not a racist the black and Mexicans are voting for him because they know the ILLEGALS are taking their jobs and we need that wall for our security and jobs for real Americans nobody wants to live off of welfare and with this core education makes it hard to get a job VOTE TRUMP 2016","commenter_a":"OK Donald and ted, you need to go to your corners and take a breath. When you have settled down you can no longer sit at the adult table. This is why we cannot have nice things, you two acting like very spoiled children. Enough of this infantile acting, are you trying to give this nomination to kasick?","post_message":"Things are about to get REALLY messy..."},{"comment_id":"1922337691198281","commenter_b":"What easier place to pull off a mass murder? A gun free zone, loser!!! Did your law stop the murderer from having a gun?? Libs just keep getting dumber.","commenter_a":"another freaking retard liberal","post_message":""},{"comment_id":"10153573434494087","commenter_b":"Oh for the love of God, I fear for the United States when that evil emotional vampire gets the keys to your White House!!! Vote Trump. Vote Sanders, for all things decient don't have that evil woman near the White House","commenter_a":"Trump for President and Hillary for Prison","post_message":"Two of the top three most retweeted tweets of last night's Republican debate were from Hillary Clinton, while none of the GOP candidate even entered the top 5."}]
