[{"comment_id":"1004595529587074","commenter_b":"Show me where I said that Jeep!! Assume much?? Many woman have had very easy deliveries and others more difficult. You cannot predict which way it will go. HOWEVER, every successful abortion kills a new human.","commenter_a":"Choose Love, Choose Life! All human beings deserve a chance at life. If you agree with saving trees or animals but, not human beings you are an idiot.","post_message":"Every life is a blessing!"},{"comment_id":"10153143510309575","commenter_b":"That's a woman?","commenter_a":"Good","post_message":"An Indianapolis mother was sentenced to 60 years Friday in connection with the death of her 2-year-old daughter.  In January, she was found guilty of murder, battery and neglect of a dependent."},{"comment_id":"1265724350133686","commenter_b":"Honestly , I couldn't vote for either .. We will have a women in Whitehouse one day.. I want a patriotic POTUS whom puts Americans First always . Male or female makes no difference to me..","commenter_a":"Kirstie ally, was the first one to send Truck loads of supplies during super storm sandy.. 'Truck Loads' I helped distribute.. Great Lady.. Love Trump","post_message":"Good for her!  She's also taking action herself!    @webpagelink"},{"comment_id":"10153896841896636","commenter_b":"Let's talk about what about ... 1. What about Christian imperials from England who colonized, enslaved, stole and murdered people during their colonialism , don't they have Christian knowledge, 2. What about Christian Europeans colonizing America and stealing their land, murdering millions of natives, 3. What about white Christians enslaving blacks people in America treating them like animals and killing blacks for sport. Can you blame these crimes against humanity on Christian faith , NO you cannot , and you cannot blame Islam for the actions of ignorant people. Don't lower your intelligence to the level of ignorant people of past and today who are enemies of humanity .","commenter_a":"Are you trying to defend Islam by claiming that, ISIS recruits have very poor knowledge of islam ? ok, what about the radical Muslim clerics all over Europe, Asia and USA, don't they too have any knowledge on Islam ?","post_message":"Incredible"},{"comment_id":"636870959836816","commenter_b":"Good for her they should all be arrested where the heck is the National Guard?","commenter_a":"Need to arrest everyone on street. Thugs have taken over again ??? Let the police do their job . If they have to shoot a few of them so be it.","post_message":"Ferguson Protesters got in the way, so this patriotic driver does this.  Race rioters are out of control. They are the true menace to our society.  Are you sick and tired of race rioters?"},{"comment_id":"692144217642823","commenter_b":"A lesbian trap in a mans body...say what.","commenter_a":"How can Caitlyn get the award for woman of the year if she still has a dick ????","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award.  This is what our world has come to. It doesn't get more absurd than this.  Do you think this is wrong?"},{"comment_id":"1735699086698296","commenter_b":"HOW - F_N confused is she ---OMG.....totally the opposite.......","commenter_a":"'Yes We Can' :)","post_message":"''Diversity' has come to mean that you have to be accepting of every different thing but you cannot, in any way, celebrate a traditional viewpoint.' – Mike Huckabee"}]
