[{"comment_id":"487132828135264","commenter_b":"What? the lying lame are going to teach other people to be perverts? Really","commenter_a":"OMG!","post_message":"Goooooood Moooooorrning!!"},{"comment_id":"10154229231904411","commenter_b":"If a woman have every right to show off her body or hair; then why can't she have the right to cover it? I haven't met any veil wearing ladies that have offended me in the least.","commenter_a":"The Golden Rule of Civil Rights is, One Mans Rights End Where Another Mans Rights Begin","post_message":"Awkward: Laurence Rossignol, who is ironically founder of the anti-discrimination organization SOS Racisme, compared Muslim women who wear veils to 'American negroes' who supported slavery"},{"comment_id":"10154105407999166","commenter_b":"We are getting sick of black crap. Whites will start an uprising. Just wait","commenter_a":"If it was any other student you would be in an uproar...relax! He was wrong and you know it. We don't need this in schools. If they don't protect the safety of students, can you imagine what they would be up against. You don't wait til something happens then act. Let's think like adults here. This is 2016 not the 50s.","post_message":"JUST IN: Police say they have charged this Clemson student after he admitted to posting comments on a popular social media app, comments like \"let's do the Clemson protesters what Ohio did to the Kent State student protesters 40 years ago.\" He said he did it to \"make people mad\"."},{"comment_id":"773502486092553","commenter_b":"The profit mohammad is a pedophile goat raping POS.","commenter_a":"Even Hitler would hate Obama.","post_message":"OBAMA THROAT: FOLLOW ISLAMIC MONEY? If you look into Obama’s foreign student status the subject is quite involved. It is not just if he was a foreign student, but was he an American posing as a foreign student? Is Obama an American that received funding from foreigners? Did he just get student loans and work hard? Is Obama keeping his records confidential to cover something even bigger than Obama himself? Ask yourself this question, would opening up Obama’s Harvard records cause people to closely examine the influence of oil rich Arabs that may want to impose Islam on the United States? In 1979 Vernon Jarrett, father in law of Valerie Jarrett, wrote about expecting Arabs to help disadvantaged black students. Khalid Abdullah Tariq Al-Mansour, formerly known as Donald Warden, had apparently been working with “rich Arab kingdoms” for this very purpose. Jarrett insisted that this is coming. @webpagelink So a ..."},{"comment_id":"10153715327517894","commenter_b":"These hoes kill me acting like they the only one with a fucking opinion and that their opinion is the only one that's right bitch you got me fucked up Alex Carey and when I see some breast then I'll refer to transgender!","commenter_a":"I love @username, but I don't expect anything objective about Mariah Carey to come out here because @username and Mariah are besties. I'm sure there's more to the story than this.","post_message":"Nick Cannon Is Refusing to Sign Off on Mariah Carey Divorce Papers"},{"comment_id":"10155487456986509","commenter_b":"Hillary is a baby killer.","commenter_a":"He was completely right on everything he called a disaster. The biggest disaster of all was the video proving that she and her campaign incited the violence at his rallies. Perhaps using the word rigged is an oversimplification, but for Christ's sake, she's guilty if inciting riotous behavior. Vote Trump, as middle finger to the corruption in government.","post_message":"- Aleppo - Hillary Clinton's tax plan - Obamacare ...and more things that Donald J. Trump called a \"disaster\" at the final #debate. @webpagelink"},{"comment_id":"10153292336206680","commenter_b":"Given he is so concered about conditions in Eurpose how about opening the borders to more refugees in desperate need . Sharing the burden rather than slamming to door to hope shut.","commenter_a":"I've been to Brussels. I was essentially homeless there for one night as I passed through -- I camped at a vacant fairground. Not a single Muslim tried to commit a violent act against me. The real world isn't nearly as scary as Trump seems to think it is.","post_message":"POLITICO Europe Donald Trump defended his proposed Muslim ban."}]
