[{"comment_id":"10156667193450725","commenter_b":"Only Trump Bernie or Sanders will make it that way","commenter_a":"Please SC, get out and vote to save our country from turning into a 3rd World nation. We are counting on you today.","post_message":"South Carolina voters have the future of our country in their hands. VOTE now (today), and MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10155811623205594","commenter_b":"You are $hit. This is about a little girls recipe. keep your poitical agenda where it belongs. in the crapper","commenter_a":"Must look like SH!T...","post_message":"Barack Obama told her it was a standout dish for him."},{"comment_id":"10153342666393132","commenter_b":"She still is basic!","commenter_a":"He just swerrrved on her! Ayeeee! She needs to remember her roots and remember she was once 'basic'.","post_message":"\"Madonna, you have achieved unbelievable success and while we appreciate your talent and achievement, we expect you to appreciate ours.\""},{"comment_id":"10153659512120667","commenter_b":"add plz","commenter_a":"Put one of these posers up against a Gracie see what happens...dumbed down fighting","post_message":"He did it again."},{"comment_id":"10154356227669641","commenter_b":"Females have orgasms? ;)","commenter_a":"Is everyone who is reading this so dumb or is it just me? The comments seem to be coming from people in deep sleep. OK for starters let's all read the post in detail again then re-align comments.","post_message":"What is the actual purpose of the female orgasm?"},{"comment_id":"10153395340948984","commenter_b":"She's the one who put the hatred for America in his heart, she should be deported immediately!","commenter_a":"Give her the same!!!","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing... Do you think this Boston bomber got what he deserved?"},{"comment_id":"10153855606886336","commenter_b":"How come you mother fu*kers can't just go to school and stfu?","commenter_a":"Yes","post_message":"Are students demanding too much power?"}]
