[{"comment_id":"1297459886999211","commenter_b":"People, people, people, ain't nothing going to happen to this horrible, discussing bitch 🇨🇱","commenter_a":"Nasty woman.","post_message":"It's called \"Orgy Island,\" and there was already evidence linking Bill Clinton to it. Now, though, the FBI just dropped a bombshell involving Hillary Clinton and the sick island... and what agents are saying could turn the entire election in a VERY ugly way."},{"comment_id":"704776766379568","commenter_b":"Yes deport them","commenter_a":"Only if it's to hell. I would never let her lose on another","post_message":"Controversial photo of Michelle Obama has many calling for deportation.  She doesn't deserve to be our First lady.  Would you vote to have Michelle Obama deported?"},{"comment_id":"891291447630577","commenter_b":"Turn the channel from Fox and get educated","commenter_a":"How anyone can back him after everything going on is beyond ignorant!!!! There r reasons he's the worst president ever!!!","post_message":"This one is HILARIOUS.   Thanks to Being Liberal."},{"comment_id":"1650724908525555","commenter_b":"Let's see, she and Obama, on one hand, want to take our guns, and on the other hand, want open borders of illegal aliens and possible terrorists to enter the Country. They are aiming to make all of America a soft target. Whose side are they on, anyway? Never mind, I think we know. Vote out all liberal, progressive, Democrats. Obviously, they are mentally ill.","commenter_a":"Gun control my a$$ - We ALL need to be armed!","post_message":"Wasting no time..."},{"comment_id":"10154628102671800","commenter_b":"@username You're saying bullying didn't work in 3rd grade so it won't work now, but most of Trump's campaign IS based on bullying and it's gotten him pretty far. And Trump has had multiple scandals of his own, including email scandals. It's also a known fact that every politician in history has had some sort of scandal in the course of their career.","commenter_a":"And according to James comey if you do what Hillary Clinton did you would be reprimanded, probably fired and have your clearance pulled if not have criminal charges like in the military, but you can still run for president. Oh the hypocrisy. Say bad things, shouldn't be able to be president, compromise national security and the lives of Americans, no problem.","post_message":"Billy Bush was suspended indefinitely from NBC following the leaked Trump tapes.  ►Full video: @webpagelink"},{"comment_id":"10152960081691051","commenter_b":"My ex wife is a chupacabra!","commenter_a":"Yeah right !!","post_message":"This woman is confident that she found a Chupacabra - and she has proof."},{"comment_id":"1541468506160349","commenter_b":"If, they take away guns criminals will build bombs !","commenter_a":"America has got to be in the grip of a a gun cult. When reason and logic doesn't work, you know the NRA propaganda has got a serious grip on us. We've shown the world how much our armed gun citizenry has worked - America's mass shootings are on a continuous news cycle being aired around the world. They must think we are arrogant when we refuse to look at their own country's statics as proof that less guns indeed do work. It's so logical, so reasonable, less guns, less gun related deaths. Yet we continue to be surprised at each mass shooting and continue to have vigils and prayers only to buy more guns. Other country's must laugh sadly at our arguments of death by spoon, forks or auto or our description of a gun being an inanimate object or that guns don't kill. Other countries must seriously hate ...","post_message":"Mic drop.   Video by Occupy Democrats, LIKE our page for more!"}]
