[{"comment_id":"1714145238857650","commenter_b":"@username pull your head out of your buttocks. 99% of the terrorist are Muslim. Hillary wants to open up the flood gates so they can just stroll on in. Terrorism will be coming to America with them. Wake stupid!","commenter_a":"How about we stop all these moronic memes and make sure everyone is registered to vote, so he doesn't get elected!","post_message":"LOL! It's hard to disagree.  Image by Occupy Democrats, LIKE our page for more."},{"comment_id":"10153242802786336","commenter_b":"She needs to step down. Bad form lady!","commenter_a":"recue her self all the way back to college, and stay awake the second time around , , and learn the law. don't judge out of hate to please your president and holder ,and al.","post_message":"Defense attorneys representing six Baltimore police officers charged in the death of Freddie Gray filed a motion to have the case dismissed, or for the city’s top prosecutor to be replaced."},{"comment_id":"723743707725776","commenter_b":"@username Marco can't stand ya!","commenter_a":"Why don't they go after his immorality.. Didn't he cheat on two of his wives. He is no Christian and then also said he has never had to ask for forgiveness OMG Adultry is a Commandment","post_message":"Donald Trump started a mortgage company (that failed) at the worst possible time -- when the housing bubble was about to burst."},{"comment_id":"10153362253533132","commenter_b":"Please dont let her walk free like Casey Anthony is walking free. If she wants to kill herself let her. She is not a mother. A mother doesnt kill her children AND take pictures of it!!","commenter_a":"Leah Stevens","post_message":"In the arrest report, detectives reported finding an open journal with an entry addressed \"To My Family.\" According to authorities, Jessica McCarty apologized for what she was about to do."},{"comment_id":"10153645733937217","commenter_b":"@username dude your wife looks like a yeast infection","commenter_a":"Oh god. Hillary can potentially become the next president, yet Nixon was almost impeached for missing tapes and she has thousands of missing emails. Wow people are incredibly stupid these days!","post_message":"\"Next January, I want to be sure that it is Hillary Clinton who takes the oath of office, not Donald J. Trump\" writes California Governor Jerry Brown."},{"comment_id":"582449118570531","commenter_b":"Maybe to you but the ladies love me.","commenter_a":"GOP has nothing but Scare Tactics, look at all the fools they have running not a good one in the lot. What Scarey is if one gets elected then it time to be scared, they'll take the whole country down the Hole.","post_message":"The boogeyman will get you. via Grobanites for President Obama."},{"comment_id":"10152958455739071","commenter_b":"If all the Europe will have lider like her then for sure we would have less problems!","commenter_a":"Made in Germany","post_message":"Angela Merkel is a rarity — she's excelled her entire life."}]
