[{"comment_id":"663875460469699","commenter_b":"American news you suck! This story in all of their stories are not real! I cannot believe how many people fall for this b*******! Laughing my f****** ass off! Get a life people go spend some time with your families and try to figure out what you can do to help the country! Unbelievable! American news you suck!","commenter_a":"If they don't like our traditions don't come here...That was easy...","post_message":"The Obama administration is trying to ruin your thanksgiving. This is absurd. We can't let him get away with this. Will you still call it Thanksgiving no matter what?"},{"comment_id":"10158321761725206","commenter_b":"Stupid girl","commenter_a":"She initially said he wasn't armed, but then she started screaming at him \"don't do it\" as she had her camera pointed at the ground. Then she started filming them afterwards trying to cover up the fact that he was threatening the police with the gun.","post_message":"A photo has emerged in social media showing a gun at the feet of Keith Lamont Scott lying on the ground after he was shot by a police officer in Charlotte, NC."},{"comment_id":"10154162143246756","commenter_b":"@username No, it doesn't. As a woman, you should pay attention to who thinks you aren't able to make decisions about your own body.","commenter_a":"Scalia institutionalized his vicious hatred of women and gay people and his lack of respect for the Constitutional rights of every American. If he didn't want people to speak ill of him after he was dead, he should have lived a different life. He was a hateful man and will be rightly remembered as one. Death doesn't suddenly turn a monster into Winnie the Pooh.","post_message":"Perhaps most of all, Scalia will be remembered for his scathing dissents. He was a reliable conservative, but every once in a while he broke rank."},{"comment_id":"10153211590889255","commenter_b":"How on earth did that guy get elected in a logical state like Maine? Maybe he had some help.....","commenter_a":"JUst more proof that Le Page is a nutcase and a liar. So glad he isn't from NH . We have enough nutjobs of our own who scare the bejesus out of 4th gfaders!","post_message":"I think I just became an even bigger Stephen King fan."},{"comment_id":"1402866583068901","commenter_b":"HOW DO YALL EXPLAIN RICE COMMITTING CRIME AGAINST THE U.S, HOW BOUT HOW OBAMA LIED ABOUT ASSAD NOT HAVEING CHEMICAL WEAPONS. OBAMA LIED ! HOW BOUT TRUMP BEING PROVEN RIGHT ABOUT THE SURVEILLANCE ON HIM AND TEAM! HOW DO YOU FELL ABOUT YOUR CHILDREN BEING TAUGHT SHIRA LAW IN SCHOOL. ECT....","commenter_a":"I am glad to see to the media is holding their ground and calling him out. We need them to stay strong and sound the bullshit alert as needed.","post_message":"Trump lied SO much today, CBS had to call him out. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1392423634112580","commenter_b":"MESSAGE TO DONALD TRUMP AND TO THOSE WHO VOTED FOR: THE DEVIL IS AT HOME. EVERYONE MUST PROTECT HIS RIGHT BY LAW. MAKES YOU QUESTION WHY MADE THIS MILLONARY HUMAN BEING MADE OF FINITO DUST? THANK YOU TO THESE COUNTRIES. IN INDIA HAS 16 BUSINESSES, ARAB EMIRATES 13, CANADA 12, CHINA 9, INDONESIA 8, PANAMA 8, SAUDI ARABIA 8, SCOTLAND 7, AZERBAIYAN 5, BRASIL 4, IRELAND 4, ISRAEL 4, CATAR 4, FRENCH ANTILLES 2, SOUTH AFRICA 2, TURKEY 2 URUGUAY 2, BERMUDA ISLANDS 2. AND CASINO IS ONLY YOUR MASK. HOW EASY IS TOMB TO THE GOLIAT. AND IF IT CONDEMNS CUBA? EVERYONE CONDEMNS THEM; UNTIL WHERE THIS DONALD HITLER ADOLF TRUMP DICTATOR HAS ARRIVED. THE CURRENT MOMENT IS OF ABRUMING INTEREST FOR ALL REPUBLICANISMS THAT OCCUPY POSITIONS OF CONFIDENCE, THE REPUBLICANISMS HAVE CHOSEN THE MOST VIOLENT MAN WHO HAD ALREADY HAD SINCE THE FOUNDATION OF THE UNITED STATES OF ...","commenter_a":"So what happens now?? Castro brother takes over???same crap or the people change this?","post_message":"\"Everybody's been partying, basically, all night long.\" Earlier this morning on \"FOX & Friends Weekend,\" Phil Keating gave us a look at the pre-dawn celebrations occurring in Miami, Florida, in response to Fidel Castro's death. @webpagelink"},{"comment_id":"543880552475480","commenter_b":"Let a family move in with you. We The People are tired of paying high taxes for to pave a way for illegal aliens from any country while our veterans are living in the streets and receiving poor healthcare.","commenter_a":"These people shouldn't be here anyways. I am all for the people that are here illegally staying and becoming residents. Most of these people just want a better life for their kids and they are productive, hard working members of society","post_message":"THIS JUST IN: Donald J. Trump in his first post-election interview said he's willing to deport or incarcerate 2-3 million people in the country illegally who \"are criminal and have criminal records...\""}]
