[{"comment_id":"10153122769748145","commenter_b":"Vote the hurricanes out!","commenter_a":"Already started ;)","post_message":"Today is the start of the 2015 Hurricane Season! Are you prepared if a big storm hits Central Florida? #WFTV Check out these must-have supplies: @webpagelink"},{"comment_id":"10152774422166051","commenter_b":"Why are some people allowed to have kids??","commenter_a":"Please, can we eliminate these sh*tbags from the gene pool?","post_message":"Police found this 3-year-old boy sitting in the backseat of a car in freezing cold temperatures. His dad and babysitter had something more important to worry about."},{"comment_id":"1620111051603386","commenter_b":"She is the problem. She is not the solution.","commenter_a":"Why would ya go through all that trouble goin through background check to legally obtain firearms when you can buy plenty of illegal stolen or undocumented firearms anywhere at any time any type sky is the limit . People make a living doin this everywhere !GUN CONTROL IS A FAIRYTALE ! A JOKE ! WASTE OF TAXPAYER S $ so don't buy into Obummers. And Hillary BS ! Think for yourself folks those talking heads are also very empty.","post_message":"“You shouldn’t be able to exploit loopholes and evade criminal background checks by buying online or at a gun show…We have to make it harder for people who should not have those weapons of war.”  – Hillary Clinton reacts to the #OrlandoShooting @webpagelink"},{"comment_id":"10154214106757411","commenter_b":"Girls like this get bigger diamonds","commenter_a":"Kathleen O'Connor ~ too bad they didn't have the first look when we all got married.","post_message":"A bride from Chicago wanted to make sure to give her groom a \"first look\" he would never forget... 😂"},{"comment_id":"1251187991558679","commenter_b":"And a woman who should be in jail should disqualify to...","commenter_a":"This alone should disqualify this poor excuse for a human being from ever getting close to the White House.If I was the parent of that reporter who was mocked I would hurt down Trump and slap the shit out of him.And you can take that to the bank.","post_message":"This tells you everything you need to know about Donald Trump."},{"comment_id":"10153138669086378","commenter_b":"She gets off on it","commenter_a":"Weird","post_message":"BREASTFEEDING FRIEND'S SON: A photo of a Bala Cynwyd woman breastfeeding not only her own son, but her friend's son, is generating controversy.  See more about her decision, and let us know what YOU think in the comments below:"},{"comment_id":"10150911052459999","commenter_b":"She ain't gonna be there folks - Someone on the DT team has a modicum of intelligence - Trump had an affair with his 2nd wife while still married to the first -inviting Flowers would Gain Hillary a Lot of Sympathy - guess what, it isn't the woman's fault when her husband cheats -Trump is Stupid & his handlers have to keep reining him in - Pitiful","commenter_a":"THE BLACK NARRATIVE IS TO COMMIT \"CIVIL DISOBEDIENCE\" PROVOKE THE POLICE INTO INJURING OR KILLING THEM, THAN SUE TO GET A $$$ SETTLEMENT. MOST ALL BLACKS INVOLVED IN THIS SCHEME HAVE A BLACK LAWYER'S NUMBER ON THEIR SPEED DIAL.","post_message":"Donald J. Trump's team flatly denied that Gennifer Flowers would attend Trump's first debate with Hillary Clinton. Flowers's claims of an affair with Bill Clinton imperiled his 1992 presidential campaign."}]
