[{"comment_id":"967810213254438","commenter_b":"Phony bitch","commenter_a":"Good new Ian you can now give blood from your arm instead of your B-hole. Joe Mark and @username can give you a ride","post_message":"There's still a lot of controversy around this."},{"comment_id":"614347815409395","commenter_b":"Easy win! He will roll across her !","commenter_a":"Will she be stoned throughout the debate?","post_message":"Who do you think will win the first presidential debate?"},{"comment_id":"10153389766269203","commenter_b":"NAFTA hurt the American worker,manufacturing jobs are going where thry do not have to pay a living wage to American worker's. The middle class is paying for this by job lost and food stamps the working poor need.If this new trade agreement is good for America why is it fast tracking. America elite can build factories over seas and hire people there pay them enough to be able to buy the products they make.I believe we should start penalizing companies that move out of America for cheap labor abd export products back home. The USA will dominate no one if we do not start paying a living wage here and make jobs not loose jobs.THIS AGREEMENT BENEFITS COUNTRIES WHERE LABOR IS CHEAP THEY WILL HAVE JOB GROWTH EXPORTING TO THE USA,WE WILL BECOME A NATION OF TWO CLASSES THE ELITE AND THE POOR.","commenter_a":"There is nothing worse than a bunch of Puritans who are so sanctimonious that they would give comfort to the enemy -- people like Warren, Sanders, and Nader. But the Democratic Party has great discipline and it will not let a bunch of extremists wreck the party like the Tea Party has for the GOP. Team players make victory. @webpagelink","post_message":"Elizabeth Warren is leading a liberal revolt against a trade deal she insists will hurt workers and unravel Wall Street reforms. But can President Obama muscle it through anyway?"},{"comment_id":"10153569786727522","commenter_b":"What do American soldiers have to do with restriction of future immigrants?","commenter_a":"Barbara Bell","post_message":"'When you question a mother's pain...you are attacking us.'"},{"comment_id":"1172821626098535","commenter_b":"She needed to be shut down 20 years ago!!!!","commenter_a":"What kind of a statement would you expect from somebody as stupid as she is. Her brain is lacking in intelligence","post_message":"Whoopi Goldberg got shut down."},{"comment_id":"1192273137481692","commenter_b":"Isn't this a dam foolish question to be asking of the citizens of US...why would we want Shariah law to begin with...they are taking over and our govt is allowing it...they have to conform to our CONSTITUTION here in America...can't do it, go back to your hole that practices Shariah wicked law..","commenter_a":"Yes! there is NO place in our country for Sharia law so take your laws home, Obay the constitution your in America.","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"1189205214435858","commenter_b":"Go suck or the black dicks racist bitch","commenter_a":"Look black on black crime is the number death rate among blacks! They need to talk to each other. They also need to fix their family unit, that's how young kids make it in life!","post_message":"#BlackLivesMatter were not happy with this speech"}]
