[{"comment_id":"10153969905469575","commenter_b":"Translation ?","commenter_a":"The bus should not pass that test bc there was something wrong if bus driver try back out but it's still jump forward an hit students an a frav principal an it's be proof on wthr new long time ago when they was look why bus have problems pass the test!","post_message":"In their inspection last night, police found nothing mechanically wrong with the bus involved in the fatal crash at Amy Beverland Elementary School.  Police are still awaiting the toxicology results from the mandatory blood draw, but the bus driver showed no signs of impairment."},{"comment_id":"1765902270312370","commenter_b":"Asshole","commenter_a":"P","post_message":"The message from Ted Cruz and Donald Trump is clear: If either of them become president, Guantanamo Bay won't just stay open -- it will be expanded. Does that sound good to you?"},{"comment_id":"10150822941699963","commenter_b":"What an entitled, self absorbed, sniveling whiner she is.","commenter_a":"Grow up Donnie","post_message":"Who saw this coming?!  Everyone. Everyone saw this coming."},{"comment_id":"10153518586283812","commenter_b":"I say if men can do it, so can women. Get over it. If she doesn't want to shave then she doesn't have to. But if you want to then do it.","commenter_a":"No thanks. I think I'll skip this fad too","post_message":"On social media and red carpets, from New York to China, women's hairy underarms are having a mainstream moment: @webpagelink"},{"comment_id":"10153596385394740","commenter_b":"She lied on the form. If she is able to pass a background check she is going to pass a background check. It's not going to stop her from buying it for someone who can't legally buy it. Criminals will get guns no matter what laws are passed.","commenter_a":"This can't be! Everyone knows that background checks stop gun crime!","post_message":"Prosecutors say her boyfriend, a convicted felon, gave her money and told her what to buy."},{"comment_id":"870530659649023","commenter_b":"This seems to imply, the next President has to be a woman...","commenter_a":"I completely agree with her that Hillary is not the woman for the WH. And I'm looking hard to find the one who will do all they can to put us back on track as a Nation, restore our economy, and undo the damages done to our International Affairs across the world. We need to sure up our relationships with our friends and work harder with the ones who threaten the peace and safety of this world to ensure they do not get nuclear capabilities and the ability to use them. We also need to clean up our Nation from illegals and close our Borders so that they are not so easy for illegals to cross them. We need some common sense leadership for this Nation instead of all the socialism and liberalism, lies and corruption that is tearing this Nation apart. Hillary Clinton has already proven she can not ...","post_message":"Want a female president?   Skip Hillary. Look at Carly Fiorina!"},{"comment_id":"1695743490702170","commenter_b":"@username Hillary should be in Prison!!!!","commenter_a":"I'm 18 years old. This will be my first election to vote in. I'm proud to say that I am supporting Donald Trump! Save my generation, Donald! #MakeAmericaGreatAgain","post_message":"I want to win for the people of this great country. The only people I will owe are the voters. The media, special interests, and lobbyists are all trying to stop me. We won't let that happen! #MakeAmericaGreatAgain #Trump2016"}]
