[{"comment_id":"10153004075042061","commenter_b":"These magnificent creatures were never meant to be made to stand on their heads or do any of the other ridiculous tricks they're forced to do.","commenter_a":"Stop hitting elephants.","post_message":"An elephant attacking your car - never a good thing: abcn.ws/1LxMzPP"},{"comment_id":"544427389064045","commenter_b":"Why we allow these Muslims remain in our country. If they hate our traditions, and our ways. LEAVE your ungrateful Muslims.","commenter_a":"Disgusting!","post_message":"Muslim Students Walk Out During National Anthem [VIDEO]  If don't want to show your respect for our country, you can leave.  Are you appalled by their blatant disrespect?"},{"comment_id":"10153475535382894","commenter_b":"She is the epitome of dumb!","commenter_a":"Kids are getting arrested for sexting, why is this not considered pornography and why isn't she being arrested.","post_message":"Kim Kardashian Pens Essay on Empowerment After Nude Selfie Backlash: ‘I Will Not Live My Life Dictated by the Issues You Have With My Sexuality’"},{"comment_id":"10153127374764753","commenter_b":"Pig drug whore doesnt deserve kids","commenter_a":"And I feel like a bad parent because of my mountain of dirty laundry... some people don't deserve children!","post_message":"Kodi Faircloth, though she may look quit a bit older, is only 38 and already the mom of 12 kids with another on the way. But it’s a safe bet that this Tulsa, Oklahoma, woman won’t be winning any Mom Of The Year awards anytime soon — not after what police report that they found in her home last Thursday."},{"comment_id":"598881613578354","commenter_b":"Just shoot her!","commenter_a":"Piece of shit!!!!! Hit up some of the dicks that got you there","post_message":"Cry.............me...........a.............RIVER!"},{"comment_id":"10154507187503690","commenter_b":"By expressing these words u r only humiliating blacks,u r suitable pig to work as the puppet of western world to defeat the black pride.how unfortunate u r","commenter_a":"imagine arabs without islam, great scientist, musicians, world class pretty models, sport heroes, legendary actors both male n female but islam brought d vice. without oil plus islam saudi and d rest would have been worst than somalia. I cause the day that rapist dirty war mongering piglet (mohhamed) was born","post_message":"'Some people skydive, some people race cars, and some people like to fight.'"},{"comment_id":"395052417343306","commenter_b":"We aren't screwed...again, RESEARCH MELLIE! See how much illegal immigrants attribute to the economy, then come back.","commenter_a":"Yay for Texas on this. But too bad Abbott was able to get Obama's immigration reform halted by a federal judge.","post_message":"Did you ever think you'd see this happen? Congrats Texas!!!"}]
