[{"comment_id":"10153639349621636","commenter_b":"It was 25 degrees when I got off at Gatwick-hotter than the Med!","commenter_a":"What do you say POMY wimps!!","post_message":"'I think it might be too hot'"},{"comment_id":"1754494444782298","commenter_b":"If you have to ask what's wrong with him then you need to get a checkup from the neck up and have your ears cleaned out","commenter_a":"I sure hope he's getting 2 a.m. calls in the morning from people who hate his guts","post_message":"THEY DID IT: #Anonymous just released all of Donald J. Trump's personal information to the public..."},{"comment_id":"10152866488206336","commenter_b":"that IS child endangerment..someone needs to be locked up--along with the snake........","commenter_a":"Some are just nuts","post_message":"This video footage of a 14-month-old girl playing with the family pet might make you a little nervous."},{"comment_id":"1084321754934235","commenter_b":"Get the hell out and sell the house.","commenter_a":"I'm literally crying right now hahaha","post_message":"Police in Sydney told the man neighbors heard death threats, screams and the crash of furniture being flung around."},{"comment_id":"10153366169796336","commenter_b":"This chick is STUPID!!!!!!","commenter_a":"Now all the blacks who have been passing themselves off as white will come forward to get media attention!","post_message":"\"She's been white all the way up until 2011, when she started to change the way she looked with the clothes she wore.\" Rachel Dolezal's brother joined \"The Kelly File\" to address his sister's recent claims to reporters."},{"comment_id":"10152995985561130","commenter_b":"shes such an ass!","commenter_a":"@username lol","post_message":"What the..."},{"comment_id":"10153312996021167","commenter_b":"He has also said that Muslims need to be deported, whether the are American citizens or not. 😖","commenter_a":"Brokaw makes a false comparison. In the 1940's, many Japanese were US citizens, and living here already. Their internment was a knee-jerk reaction to a very real fear that the Empire would try to invade our country with help from loyalists living here. Today, there is no nation threatening invasion, but rather a rogue terror group looking to radicalize ideological adherents within our borders, and inspire them to randomly murder us. Trump has suggested that we not allow any more people from Middle Eastern areas known as incubators for terrorists UNTIL we have much better means of sorting out the radicals from the legitimate refugees.","post_message":"This is one of the most powerful segments we've ever seen. Tom Brokaw compares Donald Trump's call to bar Muslims from America to Japanese internment, Nazi Germany, McCarthyism, and Jim Crow - and he didn't stop there. This amazing video is well worth taking a moment to watch, via NBC News"}]
