[{"comment_id":"2205226956370072","commenter_b":"OK so pack your bags and GO...Your people didn't come here to dominate the world and spread hate.","commenter_a":"He was born in New York and he says he's an immigrant? I'd say this chap has been sniffing too much airplane glue. Yeah, if he wants to be deported, make him the first astronaut on Mars.","post_message":"NY-Born Governor: 'If There is a Move to Deport Immigrants, I Say Then Start With Me' [VIDEO]"},{"comment_id":"544801219019682","commenter_b":"No questions from me Dr Carson.I just thank God for you, and know your here because God has plan for you. Dr Ben to win.","commenter_a":"Why do you think intensifying the war on drugs is a good thing?","post_message":"Each night I try to take some time to answer a few questions. You can send your questions to me by texting them to ASKBEN (@username) or you can email them to me at AskBen@BenCarson.com.  Before I get started tonight, I want to remind everyone that I will be on both Meet the Press (NBC) and Fox News Sunday this Sunday morning.  Also, Discovery Life will re-air a special about my medical career on Sunday evening.  Check local listings to find the times in your area.  The first question is about the Benghazi Hearings.  I didn’t get to watch to whole hearing but I have read the press accounts of them.  It is extremely clear that Secretary Clinton knew the attack was a terror attack and not a riot based on a film.  Yet, she and the Administration continued to purposely misrepresent the nature of the attack publicly for days.  Missing emails from that crucial time would no doubt provide better clues for who knew what, when.  Of course, that email has been deleted.  I have thought about this some and I think I know now what Hillary was destroying by erasing that server – her credibility.  It is another sad story in a long line of politicians who failed us.    The next question is about Medicare.  Annette from Ohio wants to know if I really want to abolish Medicare as was reported in a Washington politician tabloid.  The answer is of course NO.  I am interested in how we can both save money and deliver better service to our nation’s seniors.  You will no doubt hear of this kind of reporting which is meant to scare people from making any changes to the Washington power base.  I practiced medicine for 39 years.  Throughout those years, I often was disgusted with insurance companies.  Our current system is spinning out of control.  More and more state exchanges are going out of business.  Premiums continue to spiral out of control for those that can’t afford coverage.  Now reports begin to surface that millions of seniors will face massive premium increases.  We need a system where consumers are empowered and protected.  We need a system where you and your doctor decide what is best for you.  We need a system where each of us can monitor costs and levels of service.  I will soon offer such plan.  Until then, please take these press attacks for what they are…the last gasps of the Washington power class.  Finally tonight, I want to end on what many people sent me regarding the two new polls in Iowa today.  Three polls in two days all with the same results.  Each has me significantly ahead by 8 or nine points in Iowa. While of course I am delighted with the results and all of our hard work, now is the time to work even harder.  I am in Iowa tonight and all day tomorrow.  We will continue to fight to deliver our We the People message not just in Iowa but in every state across the country.  Thank you for standing with me.    Goodnight!   Ben"},{"comment_id":"456493334475707","commenter_b":"Fuck u bitch and that pedophile country PISSRAEL","commenter_a":"PISSRAEL","post_message":"In the following report, we’ve replaced references to Israel with the Islamic State of Iraq and Syria (ISIS) to make a point about how differently they are treated by the media and politicians."},{"comment_id":"927319353970153","commenter_b":"Who cares about whatever Sarah has to say....she's a nobody. Good grief !!","commenter_a":"BO doesn't care he's in office as a fraud perpetuating and feeding the muslime brotherhood on our dime","post_message":"HA HA!"},{"comment_id":"10152871964481491","commenter_b":"Says the woman whose profile pic looks as if she is in drag!!!! You should never talk about anyone's looks!!!","commenter_a":"Quit posting this, she isn't even a woman, so stop it","post_message":"“You’re too young for a 51-year-old!”"},{"comment_id":"1039059936190258","commenter_b":"That's not what Margaret said, and the fact that you think it was is a pretty clear indication of how little you understand about this and comparable situations, Pat.","commenter_a":"Answering for dead soldiers is abusive? If she can't handle this she's absolutely not fit for president.","post_message":"\"Republicans are squandering millions of taxpayer dollars on this abusive effort to derail Secretary Clinton's presidential campaign.\" - Rep. Elijah Cummings"},{"comment_id":"10153182888819060","commenter_b":"Run, Kamala, run!","commenter_a":"@username - her Agenda is TO REPRESENT US, CALIFORNIA, in Washington, D.C., UNlike the Republicans who spout \"The American People Want\" yet they ( GOP ) go for what the 1%ers want.","post_message":"“An entire generation of Democrats, who have been waiting for this moment for years, took one look at Kamala Harris, and quickly backed off.” For the first time since 1992, California has an open Senate seat and only a Democrat can win. That should have been the cue for an almighty dust-up. Yet, one by one, a billionaire environmentalist, a former mayor of Los Angeles, and the lieutenant-governor, have all stepped aside so there is only one serious candidate. Are they scared? Yes. And they have every reason to be: Ms Harris is an intimidating opponent. The daughter of an Indian cancer researcher and a Jamaican economics professor, she is the first woman, first African-American and first Asian attorney-general of California @webpagelink"}]
