[{"comment_id":"10153112075801051","commenter_b":"I love this chick!!","commenter_a":"Really? You guys are jerks. Don't like her or this post, keep scrolling.","post_message":"This mom was complimented on her \"perfect\" body recently. She appreciated it, but she also felt the need to show everyone the difference between what's real and what's in magazines."},{"comment_id":"10153791461399607","commenter_b":"No the home owners are getting a 10 yr break on property taxes. Look up Eager Park Townhomes.","commenter_a":"Who the hell can afford it, hell I bet the city will hit you with a $5,000 a year property extortion, I mean tax..","post_message":"Johns Hopkins University is offering a $36,000 incentive to employees to purchase a home in the new Eager Park neighborhood in East Baltimore through its \"Live Near Your Work\" program."},{"comment_id":"10152582982555950","commenter_b":"Im guessing she's a real bitch...","commenter_a":"he could have just said he wanted a divorce,","post_message":"The man's wife didn't know about or give permission for the demolition, police say."},{"comment_id":"1159055580820855","commenter_b":"China Eddie, we western women have a CHOICE to wear what we want when we want, unlike you poor suckerers who must obay. You poor poor deluded fools.","commenter_a":"Islam will reform when they relinquish women from its oppression","post_message":"Mothers and wives pose in the embroidered boreghehs that some start wearing from the age of nine"},{"comment_id":"1094565510598452","commenter_b":"This is what should happen to Debbie Wasserman Schultz - #PutThatWassholeInPrison","commenter_a":"More like its time for you to take what's yours. Go out on stage and be prepared to accept the nomination please. I hope you pull an FDR. I can't bear to see Clinton win after what wikileaks showed.","post_message":"In the State of New York 3 million Independent voters could not participate in the Democratic nominee. It's time for open primaries."},{"comment_id":"10153931727246162","commenter_b":"She deserved it!! Drunk idiot","commenter_a":"Excessive indeed, but I wonder what happened before he tossed her in.","post_message":"North suburban Skokie has agreed to pay $875,000 to a woman who accused a police officer of using excessive force after a DUI arrest: @webpagelink"},{"comment_id":"1197525123667075","commenter_b":"Time for her to be fired!","commenter_a":"That also includes Mountain Dew, Mug Root Beer and Mist Twist, Aquafina bottled water, Propel water, Gatorade and Rockstar Energy drinks. Also all Frito-Lay products including Fritos, Cheetos, Lay's and Ruffles potato chips and Rold Gold pretzels. All Quaker products. This is only a partial list.","post_message":"Follow us for more at President Trump"}]
