[{"comment_id":"1283300368381949","commenter_b":"Sonny Omelis hmm what do you think?","commenter_a":"Jaouad Jijeli","post_message":"...leaving Paris and New York in its wake!!!"},{"comment_id":"10154949382818010","commenter_b":"Amen Danny. This Ed guy is Obamas gay boyfriend.","commenter_a":"Where do you think they learned that from? Very close ties to the Obama administration, and of course, \"we're with her\" too.","post_message":"You're not supposed to say, “I think we broke the law,\" even in internal emails, according to the lawsuit."},{"comment_id":"10154738183646336","commenter_b":"But who's the hideous woman in the video?","commenter_a":"Well... he's certainly on the right show","post_message":"\"I understand why you're angry. You have every right to be angry – the system has failed you. But he is not the solution.\"  Filmmaker Michael Moore has a message for Donald J. Trump supporters who feel let down by the government. @webpagelink"},{"comment_id":"973103659397159","commenter_b":"Those girls have shallow, ugly, pugnacious souls. All that effort they put into making their hair into rat's nests would have been better spent reading something other than grocery store gossip rags.","commenter_a":"It's really frightening to see, how intolerant and religiously fanatic people can be. I can't see any difference between Christian or Islamic fundamentalism. Both are as dangerous and frightening. It's really sad, that people will believe more in something people has written ages ago, instead of in the scientific facts we have nowadays, and that they will judge people according to some moral standards from the Middle East (by the way the same moral standards as in Islam), instead of thinking for themselves. And before anyone says the Bible is God's word, show me ONE sentence that is written by God, or Jesus, or even anyone living at the same time as Jesus. There is no such sentence.","post_message":"George Takei says it right. Let's \"kick the ick\" out of our public discourse!"},{"comment_id":"838126822975658","commenter_b":"I think it is very interesting when you look closely at all the photos of the refugees....you men, military age. ISIS? Muslim Extremists? Frightening to say the least.","commenter_a":"It is with glee and satisfaction i'm watching Europe's descent ito Islamic morass.They want to replace 6 million killed Jews with 40 million Arabs. Europe's punishment is Islam.","post_message":"\"Generous welcome by Germany created a strong magnet to bring millions of migrants from Asia and Africa to Europe.  This is sheer madness and it is dangerous,\" says Daniel Grynglas."},{"comment_id":"10153273051101051","commenter_b":"The idiotic responses of this lady, smh","commenter_a":"Really? I've never heard Obama saying anything that is anti police.","post_message":"Ted Cruz just made a serious accusation against President Obama. Do you think Cruz is right about this?"},{"comment_id":"10153971160946320","commenter_b":"@username - LOL. That's ok. Some people need a little help to find their funny in the morning.","commenter_a":"The moment you realize the Jon Stewart photobomb.","post_message":"Retired firefighter Ray Pfeifer was honored at City Hall for his work in persuading Congress to extend Zadroga Act benefits for thousands of 9/11 first responders suffering from 9/11 related illnesses.  Thank you for caring and fighting for what was right. Read: @webpagelink"}]
