[{"comment_id":"582449118570531","commenter_b":"Maybe to you but the ladies love me.","commenter_a":"GOP has nothing but Scare Tactics, look at all the fools they have running not a good one in the lot. What Scarey is if one gets elected then it time to be scared, they'll take the whole country down the Hole.","post_message":"The boogeyman will get you. via Grobanites for President Obama."},{"comment_id":"10154773205966037","commenter_b":"Hillary is the liar and murderer deserves to be in prison right now!","commenter_a":"SHUT UP TRUMP","post_message":"WATCH LIVE: Donald J. Trump holds a rally following last night's debate and says he will totally accept results \"if I win.\""},{"comment_id":"10154356048051002","commenter_b":"Women cause cancer to men with there drama lmao. Jk","commenter_a":"What doesn't cause cancer these days???","post_message":"Like your daily hot dog or bacon sandwich? You may want to think again."},{"comment_id":"10153923556708690","commenter_b":"they will unfortunately forever be in western countries, untill all western countries are taken-over by muslims, because western countries have welfare system, none of the arab countries have a social welfare system like western people... so only when social welfare is completely destroyed like in sweden, they will have to get back to survive.. (^_^) sweden has taken in so many muslims it completely destroyed the economy.. destroyed women lives, destroyed everything. welfare is completely drained","commenter_a":"Maybe Muslims should stop migrating to Australia than and instead migrate to the arab countries.. Why don't they? Why do muslims prefer to migrate to democratic Australia and the western countries rather than the sharia-ruled arab states?","post_message":"A November survey by two universities and a research centre suggests that Muslims in Australia experience racism three times the national average. @webpagelink"},{"comment_id":"10153188303164087","commenter_b":"Put this bitch in jail.","commenter_a":"Looks like she gets the \"CHAIR\" same as Ethyl Rosenberg!","post_message":"Hillary Clinton’s personal email server hosted two “top secret” emails, a new report reveals."},{"comment_id":"962901507102931","commenter_b":"Evil mother!!!","commenter_a":"That's just cruel!!","post_message":"This is what happens when a mum feeds her toddler a spicy Jalapeño chilli pepper ... 🌋🔥"},{"comment_id":"10154763479136037","commenter_b":"No surprise to Hillary. She pays for this stuff. @webpagelink","commenter_a":"No matter who ultimately did this, and I hope they are caught and prosecuted, the way both the candidates reacted tells you everything you need to know about how they will govern.","post_message":"Donald J. Trump immediately blamed \"animals representing Hillary Clinton\" for the attack."}]
