[{"comment_id":"859646614169357","commenter_b":"Even the stupid people are starting to figure out that @username is a scumbag. It's not that tough to connect the dots that she's a liar, who's willing to sell our children's safety to the highest bidder. by #AnthonyRamirez #ImAgainstHer #LockHerUp #HillarySucks #NeverHillary","commenter_a":"No mention of Michael Phelps? O yeah, he's a white male and the most successful Olympian in history who also happens to be American. Stupid me...doesn't fit your crooked script.","post_message":"Well said, Coach Auriemma. Keep winning, USA Basketball."},{"comment_id":"10154316871838203","commenter_b":"@username Jesus only chose men to be Apostles - but He had many female followers. The reason that women cannot be priests is that the priest acts in the person of Christ in the Mass. If it's a woman offering the Mass the sacrifice becomes one of bride to bride - and the significance is lost. Humans are sensual creatures. God knew that; that's why He created sensual experiments (the Sacraments) as visible signs of His grace. You cannot baptize someone with motor oil because it's not a sign of cleansing. Similarly, you cannot ordain a woman. It is not possible.","commenter_a":"st paul says there is no difference between men and women now that we are in Christ Jesus. there is nothing to suggest that women cannot be ordained priests or deacons from the mouth of Jesus himself. the fact that only men were chosen by him could be due to the fact that the social fabric of his day could not tolerate or make it possible otherwise. the holy spirit will continue to guide the church according to christ's own promise. let's not bar the way forward when we see he is driving along that path. we need to go to the spirit of our faith and not be kept back by men made rules and practices. WE HAVE TO LET THE LORD SPEAK.....AND LET US BE SILENT.","post_message":"The Catholic Church can never ordain women priests, so why all the confusing signals?"},{"comment_id":"10155761644675725","commenter_b":"The employee should of knocked that bitches teeth out","commenter_a":"Kristin Nugent Grigsby","post_message":"A woman has been arrested after allegedly biting a Macy’s employee over a Michael Kors handbag ---> @webpagelink"},{"comment_id":"10153184134613984","commenter_b":"she is a drama queen & idiot.","commenter_a":"What a crock of crap!","post_message":"People are NOT happy about this, and they're calling her out for it big time.  Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10156388002150389","commenter_b":"Muslims are the problem!","commenter_a":"He was a Muslim. What else is there to know?","post_message":""},{"comment_id":"1059645677404171","commenter_b":"Stop her","commenter_a":"Pero que no fueron capaces de pararlo...","post_message":"LIVE NOW: Police chase in Long Beach, CA."},{"comment_id":"10154357911453812","commenter_b":"Except that some women don't make milk","commenter_a":"Breastfeeding should be promoted! I don't know how much further folks can ride the PC train. Hope it crashes soon.","post_message":"The U.S. Preventive Services Task Force is keeping its 2016 recommendations in support of breast-feeding nearly identical to those issued in 2008, with the exception of deleting one word: “promote.”"}]
