[{"comment_id":"10154173925206498","commenter_b":"She'll give birth at 2-3am like most animals do lol","commenter_a":"The guy in an earlier video said it can take hours to days for the birth to happen it is when nature is ready for it.","post_message":"GIRAFFE CAM: April the giraffe is about to give birth. @webpagelink"},{"comment_id":"10153524776247016","commenter_b":"If you want a female president, Elizabeth Warren would be a thousand times better than WHORE Hillary.","commenter_a":"You can dress HRC any way you choose and she still is a corrupt POS. NEVER $hillary, EVER BERNIE~!","post_message":"Wall Street thinks Sen. Elizabeth Warren would be a \"nightmare\" as Vice President of the United States.  You can't ask for a better endorsement than that."},{"comment_id":"10154362175295329","commenter_b":"In the meantime, STFU. :P Because see below? Where she says, \"I considered myself a feminist before it was cool, now everyone is claiming it?\" She said that a while ago. First, tell that to Gloria Steinem, honey. Second, I think it's not really feminism when one woman decides to deride another because she decides that she's not doing it right? Yeah, no. Sorry. That sucks a lot.","commenter_a":"Stfu demi","post_message":"\"How the fuck am I making this about myself?\" – Demi Lovato"},{"comment_id":"939707739399900","commenter_b":"It used to be fairly common to have a cross on the flag pole representing the same thing as Christ above all.","commenter_a":"I am a Christian but, no flags are to be flown over the flag of the United States. I DO feel his frustration but, this is a no-no. God Bless America !","post_message":"Are you OK with this?"},{"comment_id":"1659698577423598","commenter_b":"she is just cheap fat trash...who cares?","commenter_a":"Get off whatever you are on Mariah!","post_message":"... Oh my god...  I had no idea this happened."},{"comment_id":"1158142194215832","commenter_b":"aw poor huntsman","commenter_a":"Sergio Andrade Sergio Andrade Vergara Gisella Casillas","post_message":"A good reason to always flush the toilet.  Barry Morrissey captured video of a Huntsman spider hiding in a toilet bowl in Australia.  The video has been viewed more than 30-million times around the world."},{"comment_id":"10152759669890779","commenter_b":"let me tell you what happin to RED ASS.","commenter_a":"Today is your birthday? What's today?","post_message":"Twenty years have puff-puff passed since the stoner comedy Friday lit up movie theaters and became not just a cult sensation but a bona-fide classic. Ice Cube spoke with us about the success of the movie, the \"Bye Felicia\" meme and why the film is so beloved. \"It's cool – get high and all that – but the movie is memorable because it's the day that the bully got his ass whooped, and everybody loves that day.\" Click through for the full interview."}]
