[{"comment_id":"1131244553635264","commenter_b":"#BernieOrBust #BernieAllTheWay #DropOutHillary","commenter_a":"Either way it will be a Democrat all the way to the White House again for another eight years along with a Democratic majority in Congress! Many thanks to the GOP for putting up unelectable candidates election after election,those dumb idiots will never learn","post_message":"Trump must be stopped.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153096842961748","commenter_b":"The only thing that is happening is Bigots are being exposed, and shown for what they are!","commenter_a":"As ALWAYS - it is just the opposite! Conservatives are attacking the laws that protect EVERYONE, including themselves, from discrimination. Gays are challenging those attacks in order to preserve and PROTECT freedom. Only backwoods IDIOTS would not understand that.","post_message":"Gay people are lighting America on fire! According to a new anti-gay \"documentary,\" anyone who owns a business or holds public office is under attack."},{"comment_id":"589335207936802","commenter_b":"Can some one please explain to her that her relevancy has expired and she has a court date in ND for vandalism to appear for?!","commenter_a":"IDIOT","post_message":"Ha ha ha ha ha ha ha. She's turning into quite the side show."},{"comment_id":"10153425632179342","commenter_b":"Getting awfully tired of MEN telling WOMEN not to get pregnant. We can not without your sperm.","commenter_a":"This is a disgusting decision. Planned parenthood has done so much for women's health and to cut off funding will kill so many women. Short-sighted idiots. You are not pro life, you are pro birth, to hell with the before or after.","post_message":"Planned Parenthood affiliates statewide were told in a letter why they were being cut off"},{"comment_id":"10153653057081438","commenter_b":"Used to be, \"This may be upsetting to you.\" Then I would close my eyes. Yes, I get triggered, but it's not neuroscience to accommodate folks.","commenter_a":"Ovid yes and no. EVERY single one of the stories includes silencing of one kind or another-- often violent, often sexual violence. But it is a political poem by an exiled poet who was being silenced. HE tells a story about a bad (silencing) king and then says something directly to the emperor-- \" And you oh Augustus...\" Zeus was a rapist but he does not get praise for his philandering; his wife punishes the victim (the mother of nearly every demigod) since her husband is in power, but some god or goddess usually intervenes. Those rapes or dalliances are metaphorical for deeper political angst in Rome.","post_message":"Some professors believe trigger warnings build trust. Others think they stifle free discourse."},{"comment_id":"10156216618090389","commenter_b":"She'll get away with everything , just wait and see.","commenter_a":"I bet she gets away with it that's the way the Clinton's roll","post_message":"Those emails might not be about yoga or Chelsea's wedding. Do you think Hillary is finally feeling the heat?"},{"comment_id":"10152847429722623","commenter_b":"Yeah because throwing fish chunks attracts puppies","commenter_a":"Jessica Kennedy South","post_message":"Check out this photo:"}]
