[{"comment_id":"2076295639262230","commenter_b":"Who is Jill Stein?????","commenter_a":"Throw your support behind TRUMP all of you Bernie supporters!!!!","post_message":"Breaking News: Democratic National Committee Chairwoman Debbie Wasserman Schultz will not preside over her party’s convention in Philadelphia following email leak suggesting anti-Bernie Sanders bias, Fox News confirms. @webpagelink"},{"comment_id":"952115494844980","commenter_b":"Because Mark she would be a WOMAN President!!! That's it!!!","commenter_a":"I'm from Brazil, and i support @username to President of USA. <3 #GoHillary","post_message":"Rising fifth grader Emily had a big question for Hillary in New Hampshire:"},{"comment_id":"10153112407151336","commenter_b":"Doesn't surprise me!!! Lots of liberals there;!!","commenter_a":"What a dullard...","post_message":"“Seattleites know that discrimination has no place in our city,” Mayor Ed Murray said. “That’s just equality 101.”"},{"comment_id":"10152756027891051","commenter_b":"Let your women drive already !","commenter_a":"Its a respect and courtesy issue in a foreign culture. It doesnt hurt to put a scarf on her head. They arent asking her to put on a Burqa","post_message":"People in Saudi Arabia are livid with Michelle Obama for one very specific reason."},{"comment_id":"10155618780610093","commenter_b":"Go stick your head back in the ground Anne...clearly you have failed to realize that unless ISIS is wiped out..they will not stop...period. And yes they want to strike us here. You want that? You rather they come here on our turf? Lady you better do a gut check and wake the hell up.","commenter_a":"Sorry but we should NOT have boots on the ground in Syria.","post_message":"'It involved hand-to-hand combat, the jihadists tried to use women and children as human shields, and about a dozen jihadists were killed.'"},{"comment_id":"10153322373749087","commenter_b":"Ladies, don't embarrass yourselves....you got your asses kicked in both elections. ;)","commenter_a":"Well vote for the Republicans so they can make you feel more comfortable by taking you back to that time.","post_message":"Sister Souljah on Hillary Clinton: “She reminds me too much of the slave plantation white wife of the white ‘master.’ She talks down to people [and] is condescending and pandering. She even talked down to the commander in chief, President Barack Obama, while she was under his command.'"},{"comment_id":"1803612926545625","commenter_b":"I agree ...where they trained to beat the crap out of people because they ran....smh","commenter_a":"What they fail to mention is that even if this man was the actual perpetrator it's still inexcusable for the cops to beat him unless he was resisting. The police's job in this case is to apprehend suspects. Suspects are innocent until proven guilty and should be treated as such.","post_message":"'I've never been cursed, physically abused, beaten and treated like a slave as I was two days ago.' A retired corrections officer says he was assaulted by Garden City Police in a case of mistaken identity. CBS2's Carolyn Gusoff shares his story: @webpagelink"}]
