[{"comment_id":"10153326850769411","commenter_b":"muslims bitch and cry more than the gay. lets just put all of them gays and muslims on 1 island. and blow it the fuck up","commenter_a":"All muslims ever do is make demands.","post_message":"'They behave like the neighborhood bully, persecuting Palestine footballers, athletes and the movement of sporting equipment. Enough is enough.'"},{"comment_id":"10154772615548701","commenter_b":"Od the bitch","commenter_a":"U fux'n C U N T.... Let me c u any where... U will wish ur momma swallowed the load u were conceived...","post_message":"A Washington mother is accused of giving her three young children heroin to sleep. One of the children told investigators his parents gave him and his sisters the \"feel-good medicine.\""},{"comment_id":"10152977675812690","commenter_b":"Cool...but can't we all agree that there are quite a few ILLEGAL immigrants that do NOT speak English?? I'm not talking about immigrants I'm talking about the ones who are here ILLEGALY!!","commenter_a":"But it is also illegal! Just do it right! Learn the language, support yourself and do it LEGALLY!!! Legally!! That is all!","post_message":"WATCH LIVE: Dual rallies have taken over downtown Dallas Friday evening, forcing several businesses to close early: @webpagelink Photos of the protests: @webpagelink"},{"comment_id":"10153237283580329","commenter_b":"Kurt Russell","commenter_a":"Jared padalecki from supernaturals","post_message":"Keanu Reeves or Arnold Schwarzenegger?"},{"comment_id":"10153047880386130","commenter_b":"Oh Florence, you dirty gal!","commenter_a":"Failed attempt at humor...","post_message":"You’ve seen the headlines.   Now it’s time to finally hear from the Brady at the center of the controversy…"},{"comment_id":"10153486509166320","commenter_b":"Stupid woman. Don't vote for her just because she is a woman. You voted for a color. Remember...","commenter_a":"And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course ‘lest we forget’ what has happened to many “friends” of the Clintons. 1- James McDougal – Clinton’s convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr’s investigation. 2 – Mary Mahoney – A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown.. The murder happened just after she was to go public w:th her story of sexual harassment in the White House. 3 – Vince Foster – Former White House councilor, and colleague of Hillary Clinton at Little Rock’s Rose Law firm. Died of a gunshot wound to the head, ruled a suicide. 4 – Ron Brown – Secretary of Commerce and former DNC Chairman. Reported to have died by impact ...","post_message":"Hillary Clinton held her first major rally of her 2016 presidential campaign on Roosevelt Island today. She called for a new era of shared prosperity in America and told supporters that workers can trust her to fight for them."},{"comment_id":"1394286020597209","commenter_b":"@username Cruz voted in the senate to bring in hundreds of thousands of muslims and TRIED TO PUSH THROUGH AMNESTY FOR THEM AND ALL ILLEGALS because he wants NWO and Open borders! Why do you think for the first time in history the BORDER PATROL HAS ENDORSED A CANDIDATE AND IT IS TRUMP? THEY SAY TRUMP IS THE ONLY CANDIDATE THAT WILL BUILD THE WALL AND ALLOW THEM TO DO THEIR JOB!!!! Trump is the ONLY ONE NOT wanting a PRESIDENTIAL SALARY EXCEPT FOR $1 AND NO RETIREMENT! The ONLY ONE who wants AMERICA AND AMERICANS FIRST! The ONLY ONE That wants to KEEP OUR SOCIAL SECURITY for our ELDERLY! The ONLY ONE That wants to rebuild our MILITARY AND HELP OUR VETS! The ONLY ONE Who WILL UNTIE THE HANDS OF OUR POLICE OFFICERS, BORDER PATROL AND MILITARY! And the ONLY WANT TO CUT GOVERNMENT SPENDING AND BRING DOWN ...","commenter_a":"Cruz what are you then?? You change your tone like Hillary does based on whom you are speaking too. Im not pro trump but least he hasnt changed his speech based on whos around him. That says a lot by itself.","post_message":"\"Donald J. Trump is the master illusionist - he is the Harry Houdini... Trump is a phony.\"  Today while campaigning in Pennsylvania, Ted Cruz slammed his rival for the GOP nomination."}]
