[{"comment_id":"1227830950637889","commenter_b":"What a idiot, Mexico is NOT going to pay for any wall","commenter_a":"the worst. the absolute worst.","post_message":"With the inauguration only 15 days away, how are you feeling?  Here's what Donald J. Trump says he will do during his first 100 days in office: kiro.tv/TrumpsFirstDays"},{"comment_id":"10153159279537452","commenter_b":"^^ wrong house","commenter_a":"How about the government stay out of our homes.","post_message":"THIS JUST IN: The Los Angeles City Council unanimously voted to require guns that are stored at home to be kept in locked containers, disabled with a trigger lock. abc7.la/1GGHSUi"},{"comment_id":"653257648132607","commenter_b":"I agree. Fuck Kim Kardashian! She is trash.","commenter_a":"So a woman who's apparently famous for releasing a sex tape of her getting pissed on gets robbed of 10 million dollars worth of jewellery. Who the Fuck cares.?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153347814342426","commenter_b":"glad they got this on camera so she can't talk any bull about this officer!! crazy women","commenter_a":"Should've knocked all her teeth out period.....","post_message":"Going to the DMV can be stressful, but this Florida woman completely lost it at the counter. After she was asked to leave, the 31-year-old woman would not go without a fight -- with a Florida State Trooper."},{"comment_id":"1110020542374518","commenter_b":"She makes me sick to my stomach. What a hypocritical arrogant witch.","commenter_a":"What me worry, the election is in the bag, my lemmings will vote for me regardless of what I do........","post_message":"Hillary Clinton is quickly running out of ways to make herself appealing to voters on the left increasingly turned off by her political corruption and ties to corporate cronyism. Grasping for something to counter her weaknesses, Clinton has decided to patronize black voters with talking points attacking “white privilege.” @webpagelink"},{"comment_id":"10153919889436955","commenter_b":"Trump is the only one who will throw out all of the illegals and anchor babies too stop the influx of Muslims","commenter_a":"Rubio has supporters?????","post_message":"POLL: Who will Marco Rubio supporters vote for?"},{"comment_id":"10153702399577377","commenter_b":"TRUE----BUT SHE OBVIOUSLY HAS THE WHERE WITHALL TO BUY PEOPLE OFF.","commenter_a":"SHE AND OBAMA NEED TO BE IN PRISON","post_message":"Former New York City Mayor Rudy Giuliani said Monday Hillary Clinton could possibly be the worst secretary of state in history."}]
