[{"comment_id":"1790041197906165","commenter_b":"She should behead you #deplorable","commenter_a":"Hillary could behead a school bus full of children on national TV and she wouldn't get arrested.","post_message":"'Based on our review, we have not changed our conclusions that we expressed in July with respect to Secretary Clinton,' FBI Director James Comey wrote."},{"comment_id":"533413536846939","commenter_b":"They all need to go back to thier countries and fight thier own battles against extremist.","commenter_a":"U GO TRUMP","post_message":"Looks like Trump said what many across the world were already thinking..."},{"comment_id":"10153152969586955","commenter_b":"She'll never be president.","commenter_a":"She's going way down in polls.","post_message":"HILLARY 'WIPED HER SERVER CLEAN'"},{"comment_id":"10153447411644087","commenter_b":"Sexist.","commenter_a":"Jennifer Pinto","post_message":"“It’s imperative that you vote. I want you to vote for [Hillary Clinton]. It’s time for women to be seen as real equals,” soccer hero Abby Wambach said at an event for the Democratic front-runner. “That is one hell of a badass woman in my opinion.”"},{"comment_id":"10154265505298188","commenter_b":"Ugly woman???","commenter_a":"Ugly jacket!","post_message":"The hypocrisy of these progressives is beyond shocking."},{"comment_id":"494539450746362","commenter_b":"one ugly woman","commenter_a":"Cruz started this slanderous crap and it backfired on him. But he is still trying to blame Trump for a rags publication. But he's right about one thing, we don't give a shit so he can shut the hell up about it. Trump has already moved on.","post_message":"Carly Fiorina accused Donald Trump of being a serial philanderer. Do you think there's any truth to it?"},{"comment_id":"10153711323820695","commenter_b":"Girl, STOP!","commenter_a":"A true example of faith. My prayers go out to him and his family. They'll get what they deserve, evil doers do not prosper.","post_message":"FORGIVENESS: That's what the wife of a man shot during a home invasion is expressing as her husband recovers."}]
