[{"comment_id":"1079778352065591","commenter_b":"She is cum bumb","commenter_a":"Hillary may be her Girlfriend!","post_message":"Talk about condescending!"},{"comment_id":"10153344423053701","commenter_b":"Is that all you got, being a Grammer police. Yeah have fun with your dike ass girlfriend loser.","commenter_a":"Schools need to start teaching high school kids some kind of trade. So if they decides not to go to collage they still have a skill.","post_message":"\"Our schools are the anchors of our community,\" said Portland Mayor Charlie Hales."},{"comment_id":"10153555593349087","commenter_b":"Please seek professional help. Oh, and by the way...no man knoweth the hour. (Remember that part?)","commenter_a":"America is speaking loud and clear...CAN YOU HEAR US NOW??? As a Christian woman, I believe Donald J. Trump is an answer to prayer for this once great nation and he just might be a temporary reprieve from the judgment that we so rightly deserve and which looms so ominously on the horizon. He is clearly fighting back against the forces that be that are doing everything in their power to bring about global governance, he will fight for us, I believe that...he knows most of these devils personally and knows more than we do about them, I am sure, and he wants a great nation to leave to his own grandchildren...and he is bold and determined enough to want a great legacy to leave to them as well...what better legacy than saving a nation from itself...I have had many people ask me how I, as a Christian woman, could ...","post_message":"“Our borders are like Swiss cheese,” Donald Trump said at tonight's #GOPdebate. \"This is wall that’s going to work. The wall is $10-12 billion if I do it. Mexico will pay for it because they’re not doing us any favors.\""},{"comment_id":"10154218056967439","commenter_b":"The ones in the Muslim communities that haven't done anything are still in Stage 1......just wait until they move to Stage 2 & 3....it is in the Quran: @webpagelink","commenter_a":"Cameron what a d-------","post_message":"And do what exactly? Convert? Christianity is not the problem. How many murders, attacks etc will it take for these craven quisling to realize their appeasement and submission is not working? UK PM Cameron: \"Our brothers and sisters who are Muslims, they want our assistance.\" Uh, no they don't."},{"comment_id":"483503378504622","commenter_b":"Wow!","commenter_a":"This proves someone built something and is no more proof of God than stepping in a cowpie.","post_message":"This Will Shut Their Mouths!!!!"},{"comment_id":"10152700473451051","commenter_b":"Better to stay single. Plan to meet in a well lit public location. Women don't pick up or be picked up.","commenter_a":"I tried this one time! Never again! He scared me!","post_message":"It started out as an ordinary date between two people who met online. It ended very violently."},{"comment_id":"10153379437614411","commenter_b":"To Turchinov's bitches.","commenter_a":"Ukraine have just had a 175 Billion dollar loan about 3 weeks ago, Plus a 1.8 billion dollars this week from the EU and now they are getting ready to default on these debts. Could someone please tell me where all the money has gone in such a short space of time????","post_message":""}]
