[{"comment_id":"10152865807076051","commenter_b":"This was set up by this girl and her friends - she made sure her friend was there with the video going b4 she hit the other girl-she needs to be put away for a long time and have her sorry ass beat in prison and see what a REAL asskicking is. I hope the victim doesn't get scared and not proceed with the charges.","commenter_a":"we can thank our president and people like al sharpton for all of this they have done as much as possible to entice race wars!!!","post_message":"A girl was at the park with her little brother when all of a sudden they were attacked. The little boy tried to stop the beating – but that just drew him into the line of fire."},{"comment_id":"910228435682060","commenter_b":"That's why it's good she'll never be president.","commenter_a":"Communism at work! No freedom of speech if they have their way! Vote them OUT!","post_message":"Are you at all surprised by this?"},{"comment_id":"10152870129557093","commenter_b":"Omg this woman is so racist!!! Just watch! Lol @webpagelink","commenter_a":"He doesn't need to apologize! People need to learn how to act! And how to respect higher Authority. Life would be more peaceful if people just learned to act like decent people","post_message":"Attorney for McKinney Cpl. Casebolt said two suicide calls before pool party put him in \"emotional place\" .... said Casebolt apologizes to those offended by his actions.... @webpagelink"},{"comment_id":"10153212063865950","commenter_b":"U go girl.....GIRL POWER....kick that pussy ass thieves ass","commenter_a":"Wow. Go serena","post_message":"When Serena Williams saw a thief snatch her phone at a restaurant, she took matters into her own hands. Without thinking, she jumped up, leaped over a chair or two and chased the suspect down. She was on him in a flash."},{"comment_id":"10153984867744411","commenter_b":"Saul Mendoza See, even Muslims know that Rapefugees are invaders","commenter_a":"Something is wrong as a muslim i am starting to realize people crossing borders easily are not refugees they are actually invaders , strict action must be taken to control borders","post_message":"Some 20,000 commuters travel from Denmark to Sweden every day"},{"comment_id":"1134360159938174","commenter_b":"My comment here is in no way an attack on this guy. The reality is that he's working an entry level / minimum wage job so that's why he makes minimum-wage. I'm a disabled Marine Corps veteran myself and I spent four years in school so that I could earn enough money to support my family and give them a better life. For those that say that maybe he doesn't have the aptitude to go to college, there are trade schools out there that he would be more than qualified to go to. When fast food workers start making $15 an hour then entry-level welders need to be making $25 an hour and those that are currently making $25 an hour will then need to make $35 an hour and so on and so forth.","commenter_a":"This man risked all he had for this country, got wounded but continued to serve his country and now he gets $7.50/hour and cannot afford to support his family!!! :( While Mr. Cheney does not step his foot on the battlefield once, and his Halliburton makes nearly $40 billion dollars from the Iraq war!!!!!!!!!!!!!!!!!!!!!!!!! How can this country allow such extremely disproportionate treatment of its citizens???? I think the living wage is around $27 to $30 dollars/hour and that's what the veterans deserve....","post_message":"He fought in Iraq, but back home, he's struggling to get by. Fight for $15 advocates that everyone be paid a decent wage."},{"comment_id":"10152477981607434","commenter_b":"I agree. If she lived in Miami in a luxury condo, she'd probably pay more.","commenter_a":"But- that's not a lot of money when you consider she has no mortgage, no car, no food bills- I mean- I don't want it but....","post_message":"The cost of living like a goddamn queen is high."}]
