[{"comment_id":"1632662777034101","commenter_b":"Hope she cheats on you!","commenter_a":"I did the same thing to my fiancee. I told her if didn't register to vote, I'd be mad. She did register. When it came the time to vote early, she feet - dragged. And I told her if you didn't vote for Hillary Clinton, our relationship would be over. She voted. Emails or no emails, Hillary all the way!","post_message":"\"If you didn't vote for Hillary Clinton ... I'll seize your phone, I'll seize the car.\"  Watch this mom's impassioned plea for her son to vote for Hillary Clinton."},{"comment_id":"991442284225448","commenter_b":"Matthew Acheron","commenter_a":"Daniel Kulick","post_message":"Nintendo introduces Linkle, a female version of The Legend of Zelda's Link."},{"comment_id":"10153222485020329","commenter_b":"George Bush","commenter_a":"How come the penis got a fun name but not the vagina???? You're all Sexist Pistols.","post_message":"Urethra Franklin FTW. (A BuzzFeed BFF original.)"},{"comment_id":"10158477951920206","commenter_b":"Hillary needs to be arrested, tried and thrown into a dark cell!","commenter_a":"It's Donald Trump for the New chief of Command...","post_message":"The man once known as “Obama’s favorite general” has now pleaded guilty to the felony charge of lying to the FBI during its investigation into the leaking of classified information."},{"comment_id":"923666907700065","commenter_b":"That hoe better learned how to fight cuz we gon square up lmao","commenter_a":"@username if I ever find out my daughter sucking dick idgaf she can get it . lmao go to her school and embarrass her. lmao","post_message":"Mom Beats Her Daughter In Broad Daylight For Sucking D!"},{"comment_id":"1105360966151580","commenter_b":"this is some amazballs shit man!!!","commenter_a":"Heh. I know the guy getting his arm controlled. Had some classes with him in high school. Punniest guy I've ever met.","post_message":"Control someone else's arm with your brain, with relatively little equipment."},{"comment_id":"10154964809584522","commenter_b":"That is very much understood that was real wow","commenter_a":"What a beast! If only the Saints' defense could move like that and cover that much ground!","post_message":"See video of the massive tornado that caused serious damage throughout New Orleans East. Here's another shot of it from another angle in the Michoud area. (Video by Aundra Woodfin)"}]
