[{"comment_id":"712544572223659","commenter_b":"The devils soldiers are out of control.beating and killing everybody.And they're not going to stop until we start fighting back","commenter_a":"That pig had wonderful training---can't ya see that?","post_message":"The police officer accused the man of a DUI - driving while drunk. He didn't realize that the man was having a stroke. When he didn't answer (because he was HAVING A STROKE), the officer beat the living hell out of him!"},{"comment_id":"1616592381975838","commenter_b":"THAT WOULD BE YOU SUCKER","commenter_a":"Anytime a socialist, communist and the far-left is aware of someone who can reshape our country to what it once was, scares the hell out of them and will say things like the above. Sanders statement, viewpoints make no sense at all and fail miserably in the arena of logic.","post_message":"Sanders says Trump is \"a pathological liar who changes his mind every single day.\" Agree or disagree?"},{"comment_id":"10153324129453984","commenter_b":"HERE you go......And in case You have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clinton convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown.. The murder happened just after she was to go public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock Rose Law firm. Died of a gunshot wound to the head, ruled a suicide. 4 Ron Brown Secretary of Commerce and former DNC Chairman. Reported to have died by impact in a plane crash. A pathologist close ...","commenter_a":"Ugly tranny!!!","post_message":"This is one distinction Hillary did NOT want..."},{"comment_id":"10153235652851519","commenter_b":"He has a brain?","commenter_a":"Trump's hair is getting into his brain, not Mansanto.","post_message":"Very presidential..."},{"comment_id":"1061299707312818","commenter_b":"What an ass! Leave already.","commenter_a":"yah these dumbASSES are going to tell me to be tolerant with the beheading of CHRISTIANS in the MIDDLE EAST, hay DUMBass just cause a lot of people cannot believe that you are a focking muzlum dose not mean I'm going to kiss the muzlumz assss as they behead more Christians, BTW who the fock are you to tell us to be tolerant with the shayton muzlumz? name one Christian that has beheaded a muzlum this month, or this year, or even this century, you bass TURD have allowed so many innocent Christians to be killed by your demonic muzlum family, you have their blood on your hands, and their blood is crying out to GOD ALMIGHTY FOR JUSTICE. allahoooo ACHK BARR and GRILL YOU FOCKING BASS TURD.","post_message":"The Obamas have always gleefully kicked Christians to the curb during Christmas. This year was no different."},{"comment_id":"918430954940350","commenter_b":"Just another pussy!!!","commenter_a":"Hell! Any firearm can be used to hunt.","post_message":"Bernie Sanders Plans to Outlaw all 'Non-Hunting' Firearms!"},{"comment_id":"976154972433526","commenter_b":"thats cause they want illegals to vote","commenter_a":"Buying votes","post_message":"Really?!"}]
