[{"comment_id":"10153019122102060","commenter_b":"So full of it. There are other Drs who can xray women.","commenter_a":"Because god knows in a state as poor as Louisiana, keeping women from accessing basic reproductive care is a GREAT idea. That won't have any long term consequences. Heckuva job, Bobby.","post_message":"Gov. Bobby Jindal's office has announced Louisiana is terminating its Medicaid provider contract with Planned Parenthood."},{"comment_id":"609422632593811","commenter_b":"If it is true Hillary said that, she deserves to lose big time and go to jail.","commenter_a":"this is noy the first time she threathenn to kill him. she did little over a week ago","post_message":"Whoa. You do NOT mess with the Clintons"},{"comment_id":"10154658986437034","commenter_b":"Stop illegal immigration!!!!!!!","commenter_a":"Is it too early to begin impeachment proceedings???","post_message":"THE WHITE HOUSE. We are now exactly 3 weeks into the Trump presidency. Thoughts?"},{"comment_id":"912811708762070","commenter_b":"Carole finally you sound like a smart girl see you're not an Idiot after all. I like that kid Rubio. send all illegals home including Obama. By the way carole you look like the nurse who use to work for me she was an idiot but she was nice to my patients.","commenter_a":"Since voters usually vote for charisma instead of experience and intelligence, I would expect Rubio to be the greatest challenge.","post_message":"We’re now a little more than a year away from the 2016 presidential election and Hillary Rodham Clinton, long-time Democratic front-runner, has set her sights on the Oval Office. Who in the potential Republican field can beat her? Take our poll. @webpagelink"},{"comment_id":"1452044741482218","commenter_b":"You need to put down your crack pipe that crap has fried your brain; dumb witch","commenter_a":"Democrats r a bunch if liars ..republicans are honest and classy","post_message":"\"I knew Ronald Reagan. I worked for Ronald Reagan. Donald Trump, you are no Ronald Reagan.\"  -Republican Doug Elmets says he's voting for a Democrat for the first time in 40 years.  More: @webpagelink"},{"comment_id":"10153647228236336","commenter_b":"Hello...Mr. Mahon? You there? Anything else you can steal from the white race and make you feel like a real man? Got our heritage, took over football, basketball, baseball. What's next? Hunting, nascar, women. Oh well...guess your are a superior race. Except in my neighborhood.","commenter_a":"Execution is exactly what the criminal who did this deserves.","post_message":"An estimated 11,000 people attended Texas Deputy Darren Goforth’s funeral today. The husband and father was killed \"execution-style\" at a suburban Houston gas station last week."},{"comment_id":"745794202277824","commenter_b":"She a fat hoe nuttin moe","commenter_a":"Dumb song.","post_message":"Something DISTURBING Was Just Exposed About Beyonce's Halftime Song  This is sickening. She should be banned from performing at any sports events for this.  Do you Beyonce needs to learn some respect?"}]
