[{"comment_id":"10153309825421770","commenter_b":"Her vagina card won't work!!","commenter_a":"The fix is in. Sorry Sanders supporters. That's bullshit that's the system is rigged against y'all. Don't worry, Trump will smash her dreams in the general election. This will come back to haunt her.","post_message":"BREAKING: Hillary Clinton wins the Nevada caucus over Bernie Sanders."},{"comment_id":"10153717178056002","commenter_b":"why not just peep in their windows?? people are falsely put on these so called \"lists\"","commenter_a":"There already is one of these lists. When a Employer does a deep background check it shows everything. You and I can go on OTIS with the right info on a person like birthday date , ssn and full name you can get all of their info.","post_message":"Two boys from different families are abused by the same woman. See what this mom is doing to protect other children."},{"comment_id":"10153427592702377","commenter_b":"WE NEED TO TAKE THE WHITE HOUSE BACK!!!","commenter_a":"Carefull what you wish for... then stack the $15 minimum wage movement on top of that! :-(","post_message":"April 15 just got a lot worse."},{"comment_id":"10153395223571336","commenter_b":"Pull up your skirt and grow a pair .","commenter_a":"I'm not Mexican but his comments were offensive. There are many honorable Mexican Americans and his words disrespected all Latin Americans. I happen to be a conservative republican, and in favor of tightening up the border issue. Donald Trump is an emotional and impulsive idiot and we don't need that in the White House. We need someone that will unite us, not separate us.","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"509555075871545","commenter_b":"We will never stop fighting for animals! <3","commenter_a":"OMG ! Enough already ! So very very sad...Cruelty to these animals is dead wrong wrong wrong. Aaron for putting this out there for all to see ! Thanks Keep showing everything you can. You are doing important work. This is your real work here on the planet '","post_message":"It takes the feathers of approximately 75 birds who go through THIS to make ONE down comforter.  It's 2016. There is no excuse for this."},{"comment_id":"1865190080165091","commenter_b":"What about the serial killers child molesters child rapists murderers here in the United States we should get rid of all of them as well have them sent somewhere so they can stop all this craziness here and yes there are many Savages right here in the United States","commenter_a":"These people are f--king sick get them out of our Country.","post_message":"Muslim Nurse Mutilates Little Girl’s Genitals, What She Told Her Is Even SICKER"},{"comment_id":"674600329361440","commenter_b":"rep need to get a life","commenter_a":"Look at that! I bet there are at least 100 people there! Maybe unpaid to boot!","post_message":"WATCH LIVE: Hillary Clinton and Elizabeth Warren campaign together in New Hampshire."}]
