[{"comment_id":"903161916494805","commenter_b":"@username because of disparate impact and disparate action. White people can get up out of bed, run a comb/brush through their hair and be out the door in five minutes. Blacks cannot do that so much, unless their hair is cut to their head--shaved. The rules negatively impact Blacks because without those styles, there isn't much left without using relaxers or paying for extensions. When rules or laws are placed for everyone as is here, but negatively impact one racial, religious, gender group, then it's discrimination and needs to be stopped.","commenter_a":"Can I ask an honest question? In that school, is there a ban on long slick hair, mullets or any other \"white hairstyles\". If so then I can actually understand the ban. But if there is no ban on \"white hairstyles\" like long slick hair, but there is a ban on \"black hairstyles,\" then yeah, i agree, it is discriminatory.","post_message":"This school just banned traditionally black hairstyles  and people are outraged.  #MicBrights"},{"comment_id":"10153089934495329","commenter_b":"Nasty ass hoe lol","commenter_a":"Dude this is so fucking ugly @username @username","post_message":"NSFW, obviously."},{"comment_id":"10153308382443145","commenter_b":"How sad ! Ban the Frat !!","commenter_a":"Two bills allowing guns on college campuses are about to be introduced. Alcohol, hubris, testosterone, guns. What could go wrong?","post_message":"The UCF chapter of the Sigma Nu fraternity was suspended after a video surfaced of a member chanting the word \"rape\" and encouraging sexual violence toward women, the university said. The organization will have a formal hearing Thursday. #wftv"},{"comment_id":"988508257851300","commenter_b":"what a women feel when do this?","commenter_a":"Back before social media, women's magazines used to use this as a rule of thumb for whether you could get away with going braless (if the pen falls, you can ditch the brassiere. if it stays, strap 'em in.) Which would be shaming in the other direction, by today's standards, I guess?","post_message":"Why #Underboobchallenge is going viral."},{"comment_id":"10153279901571955","commenter_b":"Good! You made that bed now sleep in it scumbags!","commenter_a":"Excellent! Expose the darkness, Lord of Light.","post_message":"Hacked Adult FriendFinder database reveals extramarital affairs of millions"},{"comment_id":"10154256296041130","commenter_b":"is she for Citizens United? how about the ACA? How about Roe v. Wade, what's her position there? Now compare Republican's position on these...","commenter_a":"Only further proving that Hilary is a Republican, but delusional liberals will still vote for her","post_message":"\"This is not a traditional race, and these are not traditional times.\""},{"comment_id":"1133136583393865","commenter_b":"what an ass!!!","commenter_a":"Pussy","post_message":"Dwayne The Rock Johnson just got candid about his struggles with depression. - Robbie Couch"}]
