[{"comment_id":"10153287604604753","commenter_b":"but she took the oath of offce before the Federal government made the ruling.","commenter_a":"She is an Apostolic Christian. According to #17 in the Apostolic Christian Church's Statement of Faith \"Governmental authority is respected and obeyed. Members serve in a non-combatant status in the military. Oaths are not taken, but truth is affirmed.\" With that being said, she violated her religious beliefs when she took the oath of office, and is violating her beliefs again by disobeying the law and court orders. Source: @webpagelink","post_message":"Kim Davis is reportedly unwilling to resign her position at the court until she is permitted to deny marriage licenses to gay couples on the grounds of her sincerely held religious beliefs. This means the clerk is planning to stay behind bars until someone grants her requests. Her lawyer, Mat Staver, spoke to reporters outside Carter County Detention Center on Friday."},{"comment_id":"10154156442975443","commenter_b":"We did trust remember all Far East and then look what happened American trained Far East pilots flew their planes into our building now because of ISIS we need to take measures don't take all this personal and if ISIs does get in who will be at fault well oh a big war and then how will you feel this is what happened we are too trusting this has nothing to do with RACE do you all have better way to stop this","commenter_a":"One brave Judge saved Muslims from being discriminated against contrary to the constitution. We really need some brave republican congressmen to save America from heading into disaster by stopping this man making hate and racism a normal thing. What we have seen so far and just today banning CNN and The New York times is no joking mater.","post_message":"\"The situation seems to be pretty bad after Trump took over as the U.S. president.\""},{"comment_id":"1152094041550315","commenter_b":"This is Trump he's racist or rapists he brings crime and does drugs is insane and sometimes maybe nice but lies all the time! He only hooks up with foreign women probably keeps them in the basement until needed no American woman would ever marry him no matter how much money he has!","commenter_a":"Make America great again by getting rid of Trump! Check out the smile on that white boys face makes me sick and I'm white! Trump is nothing but a trouble maker and an embarrassment for America! Do any of his supporters listen to him I mean really listen and heed what he says and does?? I doubt it must be mental illness","post_message":"The laughter of the Trump supporters will haunt you."},{"comment_id":"813666455490598","commenter_b":"And she needs to dump her shit in the jungle","commenter_a":"I am so sick of reading about her ,she probably spent more money then all the first lady's in the last few years ,she thinks her shit don't stink now well I got news for her it does .","post_message":"What Michelle Obama Was Just Caught Doing With Her Daughters Will Make You FURIOUS She is the worst First Lady in history. Are you ready for the Obama family to be out the White House?"},{"comment_id":"1266458500080562","commenter_b":"These articles consistently show how unbalanced a frightening amount of women are. Cheating should NEVER result in assault or worse. Never.","commenter_a":"Did he learn anything?","post_message":"She shot him in the groin for having an affair"},{"comment_id":"10154103250631756","commenter_b":"\"Are ya goin' ta prison like my maw??\"","commenter_a":"\"Are you goin' ya prison like my maw??\"","post_message":"Cuteness abounds, but so do questions about whether the kids are plants."},{"comment_id":"139820166538945","commenter_b":"So next time a woman has a child she doesn't want, wil you take it?","commenter_a":"Thank You, @username. Thank you, for keeping this promise. As you have always been pro-life, this is putting action to those words. #ThankU4speaking4Thebabies","post_message":"Today → House Votes to Protect Taxpayers from Funding Abortion"}]
