[{"comment_id":"1099336866769294","commenter_b":"There great on the grill","commenter_a":"they are nasty things.. we have loads of them out here in Texas.. they tear up pasture land and wreak havoc on vegetation and are very dangerous and have been known to maim and kill people who get too close.. I would seriously not encourage residents to take them out unless they are in a rural area and are familiar with how to use caution in hunting them.. get the parks and wildlife involved.. they better know how to deal with them..","post_message":"Update: Wild pigs that have damaged landscaping at Fairmount Park and other Riverside County areas have caused millions of dollars worth of damage, and officials are warning residents to be careful around the animals.  Read KTLA's story here: @webpagelink"},{"comment_id":"1121252964608432","commenter_b":"Shouldn't he be taking on Hillary??? Just another dumb ass between the choice of two dumb asses","commenter_a":"Acting just like hillary","post_message":"Politics."},{"comment_id":"10153006139081602","commenter_b":"I think it would help lessen the burden on other welfare programs, if some benefit recipients were getting educated and coming off programs.","commenter_a":"Better to pay for this than all the bums on welfare and any state run handout that people take advantage of.","post_message":"Two years of community college could now be free for all, according to a plan President Obama is scheduled to propose Friday."},{"comment_id":"667325733458005","commenter_b":"Gloria I agree. Get their muslim butt back where they came from","commenter_a":"Muslims if you don't like the way America's are then leave. Clint Eastwood has every right to be artistic and make true movies about who you really are then leave AMERICA. We have freedoms you do not have so leave because we will not stop being Americans. The movie was very well done and true to the ooint.","post_message":"This angry Muslim group wants Clint's head, but he's not backing down.  He is a true American, and a real patriot.  Can we get 125,000 'LIKES' for Clint Eastwood?"},{"comment_id":"974481335922540","commenter_b":"She's a brat","commenter_a":"She was never hired for the movie... Therefore cannot be fired...","post_message":"Do you agree?"},{"comment_id":"10154932317190690","commenter_b":"\"A bit of a bear\"??? What IS it with this woman and BEARS?","commenter_a":"I hope she takes care of that grizzly bear problem once and for all.","post_message":"Education Secretary Betsy DeVos: \"For me personally, this confirmation process and the drama it engendered has been a bit of a bear.\" Full video here: @webpagelink"},{"comment_id":"10156331517060725","commenter_b":"hurry up become our president and get rid of these thugs","commenter_a":"A Muslim is one born to a Muslim father who takes on his or her parents' confessional identity without necessarily subscribing to the beliefs and practices associated with the faith. In non-Muslim societies, such Muslims may subscribe to, and be vested with, secular identities. Reminder: Obama father was a Kenyan born muslim. ----- al-Taqiyya: deception; the islamic word for concealing or disguising one beliefs, convictions, ideas, feelings, opinions, and/or strategies. Islam Permits Lying to Deceive Unbelievers and Bring World Domination! Muslims lie when it is in their interest to do so and will not hold them accountable for lying when it is beneficial to the cause of Islam. They can lie without any guilt or fear of accountability or retribution. A lie in the defense of Islam is approved even applauded in their books.","post_message":"Under our President, ISIS is gaining great strength."}]
