[{"comment_id":"10152947351429091","commenter_b":"They should send these idiots to go fight Isis since there so big and bad let's see how big n bad they are then..","commenter_a":"I hate ghetto children! Yes hate! That is our future? I'm scared.","post_message":"UPDATE: 2 arrests were made in a vicious beating at a McDonald's in Brooklyn. Teens were trading blows when a Good Samaritan jumped in...then he became a target, too. MORE: @webpagelink"},{"comment_id":"394094587445502","commenter_b":"No they are everything that is wrong with our world now!! We need to remove them from America!!","commenter_a":"Desert is calling. ...","post_message":"“You Are Everything That is Wrong in America”"},{"comment_id":"10156625299625354","commenter_b":"Give that girl a cigar!","commenter_a":"Oh, look everyone! It's another one of Obama's useful white idiots. She's never held a job in the real world. She's one of those who teaches, because she cannot do, and that's a trend that needs to come to a screeching halt worldwide. Meanwhile, the Muslim in Chief can use the foul mouthed, petulant child to help further his agenda of U.S. Islamization, because using dummies as incidious devices is what radical Islamists do best","post_message":"Liberal Values on grand display..."},{"comment_id":"10153848371885779","commenter_b":"Not*","commenter_a":"RS, why in the world does a music magazine now consider itself a forum for serious topics and an authority on what people ought to think? You are obviously pushing a liberal agenda when Noone with any sense is turning to you for any of this. Go cover a Backstreet Boys reunion show and leave these matters to serious adults in unbiased forums.","post_message":"At last night's #VPdebate, Mike Pence explained that his faith controls his position on abortion. But Pence's stance is nothing short of cruel toward women."},{"comment_id":"252211541884990","commenter_b":"Not worry about it.. woman should be seen, not heard","commenter_a":"Why don't you just take your ball and go home","post_message":"I’m deeply disappointed that the Senate voted to confirm Jeff Sessions as Attorney General tonight. Deeply disappointed that the Senate confirmed an AG whose record does not show he will faithfully and fairly enforce the law.   Thanks to you, everyone now knows the concerns that Coretta Scott King had about Jeff Sessions. Concerns that millions of people still have. There’s no Rule 19 to silence me from talking about Jeff Sessions anymore. So let me say loudly and clearly: This is just the beginning.   If Jeff Sessions turns a blind eye while Donald Trump violates the Constitution or breaks the law, he'll hear from all of us. If Jeff Sessions makes even the tiniest attempt to bring his racism, sexism, and bigotry into the Justice Department, he'll hear from all of us. And you better believe every Senator who voted to put Jeff Sessions’s radical hatred into the Justice Department will hear from all of us, too.   Consider this MY warning: We won’t be silent. We will speak out. And we WILL persist."},{"comment_id":"1454008947960907","commenter_b":"Just stop we will help them build a wall gladly","commenter_a":"Not going to happen. Not only has it been deemed unconstitutional, isolationism DOES NOT WORK in a multinational economy. This makes me roll my eyes just like when Texans were crying the same thing after Obama was elected (both times).","post_message":"Group calling for California to secede from the U.S. hopes to put question on the ballot authorizing vote on independence."},{"comment_id":"633540503462936","commenter_b":"Whoooo so what. It's not like he left guys to die in Benghazi.","commenter_a":"Jesus who cares. How many years ago was it? Too many! I don't care what crap they find out about him, I will still vote TRUMP!","post_message":"Did he or didn't he? Listen to the recordings here and weigh in below: @webpagelink  (CC: Donald J. Trump)"}]
