[{"comment_id":"10153479348993812","commenter_b":"Nobody wants to see your tears lady, we are saving them for the hero you murdered and left to die. Piece of crap.","commenter_a":"She got what she so obviously deserves!!!","post_message":"Woman charged with murder, accused of killing US Navy sailor in fit of road rage: @webpagelink"},{"comment_id":"10153174947101545","commenter_b":"So what's your excuse then casey?! Bahahaha!!! Mama was drinking when she was pregnant with you?!","commenter_a":"Now she and her followers will claim that she was jailed for being a christian, as opposed to a bigot hiding behind Christianity.","post_message":"A Kentucky county clerk was found in contempt of court Thursday for her refusal to issue marriage licenses in wake of the Supreme Court decision to allow gays to wed."},{"comment_id":"1080594048640963","commenter_b":"Yes, no one was eating as much sugar in the ancient world as we do today. You can't in your right mind insist there was no tooth decay until the 20th century based on a small sampling from a small area when this \"Mediterranean Diet\" was the norm the world over. Ask any archaeologist. This article is using bad logic for clickbait.","commenter_a":"of course there's no sugar in any of these fruits and figs and honey they were eating.","post_message":"Pompeii citizens never used toothbrushes or toothpaste."},{"comment_id":"746525202204724","commenter_b":"how stupid is she in the first place.","commenter_a":"Yes","post_message":"Clinton's Panic After Mistress Does THIS In Public [VIDEO] They never ever wanted this to happen. Do you think Hillary will lose?"},{"comment_id":"10154359999193132","commenter_b":"She is bigger in size for sure","commenter_a":"Even though he won, I think La'Porsha is going to be a bigger star. We haven't seen the last of her. :-)","post_message":"Congratulations to the fifteenth (and final!) winner of American Idol!"},{"comment_id":"608701745929674","commenter_b":"@username-I usually stay out of this topic area since it isn't making a huge impact on my life. However, science has shown that when populations of a certain group go up too high, homosexual bonds do come to play. For instance in Africa way back when, sometimes today, if the village had to many mouths to feed, the men would start mounting each other to prevent population growth. In animals, like dogs or cats, you have some that put off the opposite animals pheromones. For instance we use to have 2 female&spayed cats? The one kept dry humping the other.","commenter_a":"Considering most people don't get a sexual attraction until they hit puberty, how would they even know which students are homosexual unless the students are just acting out because of what they've seen their parents do...","post_message":"Pre-K? REALLY?!"},{"comment_id":"737091973148047","commenter_b":"Imigrants that come here with four wives and ten kids need to be kicked off welfare they cost tax payers a 100.000 dollars a year per family","commenter_a":"Cut her off.","post_message":"Debbie Merton lives off of government tax money. But it’s what she’s doing NOW that will make you want to punch a wall. Should this woman be cut off from the government?"}]
