[{"comment_id":"1017389715024162","commenter_b":"@username Muslim terrorist ? Kill them simple.","commenter_a":"When you head to the polls in November, remember, Hillary Clinton tweeted this : \"Let’s be clear: Islam is not our adversary. Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" — Hillary Clinton (@HillaryClinton) November 19, 2015..","post_message":"Newt Gingrich said President Barack Obama and Hillary Clinton are \"misleading\" the American people about the #OrlandoShooting by refusing to say \"radical Islamic terrorism.\" @webpagelink"},{"comment_id":"10153425250862217","commenter_b":"I had a design like that when I was in seventh grade in 1993. It was an idea from Dick traci and knight rider. Knight could talk to kit with. Glade it took so long for this to happen 23 years was all! lol","commenter_a":"Yall now getting this lol to late","post_message":"It's a lot more hi-tech than our day. Times tables written on our arms was the height of sophistication back then..."},{"comment_id":"10153540502734411","commenter_b":"Wow--look at that face. That woman needs to smile more.","commenter_a":"Links of blood and marriage tied Battenbergs/Mountbattens to Germany/or.also Saxe-Coburg-Gotha into \"Windsor\" didn't transform Edward..","post_message":"'She was a child when this film was shot, long before the atrocities of the Nazis became widely known. But Edward was already welcoming the regime as Prince of Wales in 1933 and remained pro-Nazi after war broke out in 1939. He could well be teaching the Queen and Princess Margaret how to do the salute.'"},{"comment_id":"10153329101624087","commenter_b":"Shut em down and bulldoze em!","commenter_a":"HAHAHAHAHAHHAHAHAHAHAH HE HAS 0% CHANCE TO WIN!! WORRY NOT NON- RACISTS!!!!!","post_message":"\"You're going to have to watch and study the mosques, because a lot of talk is going on at the mosques,\" Donald J. Trump said. \"I would hate to [shut down the mosques], but it's something that you're going to have to strongly consider because some of the ideas and some of the hatred, the absolute hatred, is coming from these areas.\""},{"comment_id":"953797061420139","commenter_b":"@username hahaha","commenter_a":"And this witness is just as big a piece of shit, like the article ends with. Haha you cats are seriously not right. Good luck in the big scary liberal future. It's called progress get on board or get left behind.","post_message":"HERE WE GO.............."},{"comment_id":"584218068426739","commenter_b":"For sure playing the women card. Wouldnt have 5% of the vote without a vagina. Whos voting for vagina????","commenter_a":"Are you going to play the women card for the rest of the election? it's getting really old really quick....","post_message":"Like a boss."},{"comment_id":"10155487950195354","commenter_b":"Then will she pay for all her vacations, her clothes, her helpers!","commenter_a":"44.4 Million on vacations alone...She need to pay that back! ..........She's NOT an elected official.........","post_message":"“I want a big paycheck for Michelle.”"}]
