[{"comment_id":"10156146715050354","commenter_b":"Who the fuck is indoctrinating children?","commenter_a":"It is what perverts do !","post_message":"Cha-ching! Tax dollars, y'all!"},{"comment_id":"10153460596675779","commenter_b":"Complete agree David!!! Oh, by the way, I'm a female gun owner ;)","commenter_a":"She is a genius. I hope she realizes how hard your life can get when you make an enemy of the NRA! All you have to do is casually mention gun control or background checks and 50 whack - jobs will jump down your throat. If you're on t.v. it must be much much worse. Look what happened with Amy Schumer.","post_message":"Samantha Bee highlighted a glaring, surreal NRA double standard on Full Frontal with Samantha Bee yesterday, stockpiling a small weapons arsenal while trudging through red tape as she tried to nab her own Eddie Eagle costume, the NRA's gun safety mascot. Watch below."},{"comment_id":"10152927219763721","commenter_b":"Jason Milosh","commenter_a":"Fiona Yeamans Mia might like some of these creatures 😄","post_message":"Scientists just captured stunning images of deep sea creatures off the coast of Puerto Ricosome are so new to us, they don even have names. (via Quartz)"},{"comment_id":"10157769548850725","commenter_b":"Go kick her butt.","commenter_a":"you go donald !","post_message":""},{"comment_id":"621998441316699","commenter_b":"Sadly many get all their\"information\" from the globalist owned main Street media........the sheep are being led to slaughter!!!!!!","commenter_a":"The problem is, NO BODY WHO SUPPORTS HILLARY CARES!!! The amount of hard evidence, current criminal offenses is mind boggling... but her supporters just don't care... she shouldn't even be allowed to run...","post_message":"Uh oh..."},{"comment_id":"1487251671334957","commenter_b":"That bitch could stick her face in dough and make gorilla cookies !!","commenter_a":"No matter what she wears it looks like it came off the rack at Walmart and she looks like aunt Esther. The only problem is us taxpayers are paying the big bucks for her to look like a curtain hanging over a big black window","post_message":"I'm SICK of my hard-earned tax dollars funding their lavish lifestyles!"},{"comment_id":"10154629508429099","commenter_b":"Poor woman, but yet another reason as to why the elderly need to be tested at every license renewal after a certain age","commenter_a":"Poor thing.","post_message":"An 83-year-old woman died after her friend drove over her while backing out of a parking space @webpagelink"}]
