[{"comment_id":"10153353712173984","commenter_b":"Ugly BASTARD.","commenter_a":"Wow Al really got hammered but Al doesn't care he's laughing all the way to the bank.","post_message":"Wow! One of the top conservatives on the internet just lowered the boom on Sharpton in a big way. Many people were thinking it, but only one had the guts to say it..."},{"comment_id":"10153727550292300","commenter_b":"Go naked girl! Again and again!","commenter_a":"South beach is super ghetto now.","post_message":"In video taken by witnesses and posted on a website where it went viral, Angelic Valle is completely naked when she “placed a steel chair leg into her buttocks,” according to the police report."},{"comment_id":"10153706067582490","commenter_b":"tell them to come get they're money!!!!","commenter_a":"please remember they hold 46% of our debt right now, sure dont to piss off the banker","post_message":"SENDING A MESSAGE: The Navy plans to send a warship to directly challenge China's recent aggression."},{"comment_id":"10153921224283132","commenter_b":"They tend to get bigger when you are pregnant","commenter_a":"Are her tits hanging out far enough?","post_message":"Kim Kardashian West and her family are rallying around Lamar Odom."},{"comment_id":"859334654119032","commenter_b":"Btw, military grade doesn't always mean what you think it means.","commenter_a":"There is no such thing as an assault rifle. It's a made up term to scare ppl.","post_message":"DEVELOPING - Father of Patient Takes Hostages at Houston Hospital with Rifle   Hoping for a peaceful resolution."},{"comment_id":"10153520082123132","commenter_b":"YES CANCEL, PLEEEEASE!! ONCE A CHILD MOLESTER ALWAYS A CHILD MOLESTER!!! CHILD MOLESTERS NEVER GET REHABILITATED!!! IT'S BEEN PROVEN!!!","commenter_a":"NO!!!","post_message":"Do you think TLC should cancel 19 Kids and Counting?"},{"comment_id":"10158316523410578","commenter_b":"Lock up homegrown terrorists!","commenter_a":"OUT OF HERE ILLEGALS.","post_message":"Do you support the Immigration Crackdown? 'As we speak, immigration officers are finding the gang members, the drug dealers, and the criminal aliens and throwing them the hell out of our country. And we will not let them back in. They not coming back in, folks. They do, they going to have bigger problems than they ever dreamed of.' - President Trump @webpagelink"}]
