[{"comment_id":"10155055910404411","commenter_b":"RACISMRACISMRACISM!!!!blahblah blah","commenter_a":"Funny how it's white people who are quick to discredit this as well as add in fake stats. But you're not racist right?","post_message":"D410 Code - 'to alert co-workers that  black person is in the store'"},{"comment_id":"10153358341224726","commenter_b":"She need to get out of there","commenter_a":"the mayor of Baltimore is what you have a news conference but she cant handle a news reporter how did she get the job ,WE ALL KNOW ????????????dumb. .","post_message":"WATCH: Baltimore Mayor Snaps At Fox News Reporter for Asking Questions"},{"comment_id":"1044102145610796","commenter_b":"Stay at home moms!","commenter_a":"See Travis Kuras i dont drink that much coffee!!! Lol","post_message":"Who drinks the most coffee?  Image by I Love Coffee via AsapSCIENCE."},{"comment_id":"10153106076119255","commenter_b":"We have so many publications on both side that are mudslingers with out facts--about time both sides clean up their act and print thing to promote and support","commenter_a":"@username only wants to stir the pot recently!","post_message":"They were insiders. Home grown. Godly. Our neighbors, friends, and kin. People like us.  By Bill Moyers"},{"comment_id":"10153166814916770","commenter_b":"Crook!","commenter_a":"Keeping it in the family.","post_message":"As secretary of state, Hillary Clinton sought to help a friend of her wealthy hedge fund son-in-law who was seeking a meeting with the State Department and Clinton herself to discuss a deep sea mining he had invested in."},{"comment_id":"10154388813222144","commenter_b":"@username and Obama won election twice and he didn't need Putin to help him.","commenter_a":"He will never be able to admit (or understand) that he will never be a \"legitimate\" president. He lives to win, but he knows he really LOST... BIGLY! (all together now.... 3 million votes.)","post_message":"But that's what happened."},{"comment_id":"670200283170550","commenter_b":"Yeah,Yeah,Yeah...I keep hearing this on FB but NOT anywhere on any news network....I just HOPE this true and NOT a fantasy!","commenter_a":"The sooner the better!!! Hopefully he will take Biden, Kerry, Pelosi, Killary, Harry Reid, Al and Jesse with him when he goes. Preferably out of the country. Let them go live with the Muslim terrorist that they love so much.","post_message":"Obama's time in the white house could be coming to a screeching halt.  This is the best news of the year. Get rid of him.  Would you be happy if Obama was forced out of office?"}]
