[{"comment_id":"528487337334584","commenter_b":"#FUCKTRUMP #FUCKTRUMPLATINOS & YOU","commenter_a":"Latino for Trump! You don't have the explained anything. The system is crooked!","post_message":"STATEMENT REGARDING TRUMP UNIVERSITY It is unfortunate that my comments have been misconstrued as a categorical attack against people of Mexican heritage. I am friends with and employ thousands of people of Mexican and Hispanic descent. The American justice system relies on fair and impartial judges. All judges should be held to that standard. I do not feel that one’s heritage makes them incapable of being impartial, but, based on the rulings that I have received in the Trump University civil case, I feel justified in questioning whether I am receiving a fair trial. Over the past few weeks, I have watched as the media has reported one inaccuracy after another concerning the ongoing litigation involving Trump University. There are several important facts the public should know and that the media has failed to report. Throughout the litigation my attorneys have continually demonstrated that students who participated in Trump University ..."},{"comment_id":"10153949819826770","commenter_b":"Trump is not against Muslims. He wants Muslims coming into the country right now to be stopped and vetted completely with what is going around in the world. He wants all the law breakers in the country that are illegally gone. And its not just them it means everyone for now till we can get a handle on jihadists trying to come in to the country. What is wrong with that!??","commenter_a":"A woman protesting in New York City just said she was protesting because Trump doesn't represent her beliefs! Well that's why we had an election yesterday and America spoke clear and loud that they were fed up with the way our country was going. The American people are tired of the murder of our unborn children. We voted!! The American people are tired of people who don't work being rewarded while people who do work are being punished. We voted!! The American people are tired of activists judges making new laws without the approval of we the people. We voted!! The American people are tired of foreigners being treated like first class citizens while our veterans needs are put on the back burner. We voted!! The American people are tired of our enemies disrespecting us. We voted!! The American people are tired of our policemen and other law enforcement people ...","post_message":"Asra Nomani is sick of the \"liberal honor brigade\" turning a blind eye to radical Islamic terrorism..."},{"comment_id":"1054613801267881","commenter_b":"If they don't want to abide by our laws then go back to where you came from.","commenter_a":"I am sorry, but if you live in America, our laws trumps your religion.","post_message":"Muslim who refuses to remove head covering for officers gets rude awakening. Regardless of religious law, this is a safety concern. Do you think she got what she had coming?"},{"comment_id":"10154647718578132","commenter_b":"Ahhhh...women tearing other women down! How mature!","commenter_a":"At least she did the mop on her head somewhat decent tonight","post_message":"First Lady Michelle Obama delivered an unusually personal and emotional speech at tonight's #DNC."},{"comment_id":"10152577498117623","commenter_b":"Just. ..whatever you do....please don't refer to her as female,","commenter_a":"I couldn't care less who marries whom, who lives with whom, who bangs whom...my question is. .how did that goofy masochistic idiot find 4 women dumb enough to want to be involved with him.","post_message":"A big announcement for the world's highest-profile polygamist. Kody Brown, of TLC's \"Sister Wives,\" has divorced his first wife in order to marry his fourth..."},{"comment_id":"10152763572857434","commenter_b":"#whitegirlsbeefin","commenter_a":"Alcoholism is funny if it's at a wedding #sarcasm","post_message":"To say the bride was displeased is a major understatement"},{"comment_id":"10154884386731509","commenter_b":"Irrelevant, and you obviously miss the point.","commenter_a":"I do not support Trump. Let me get that out of the way first. That said, this is a terribly undemocratic, anti-American thing for Buzzfeed to do. Anyone who disagrees is sadly unable to separate partisan politics from basic principles.","post_message":"\"We don't run cigarette ads because they are hazardous to our health, and we won't accept (Donald J. Trump) ads for the exact same reason.\""}]
