[{"comment_id":"870530659649023","commenter_b":"This seems to imply, the next President has to be a woman...","commenter_a":"I completely agree with her that Hillary is not the woman for the WH. And I'm looking hard to find the one who will do all they can to put us back on track as a Nation, restore our economy, and undo the damages done to our International Affairs across the world. We need to sure up our relationships with our friends and work harder with the ones who threaten the peace and safety of this world to ensure they do not get nuclear capabilities and the ability to use them. We also need to clean up our Nation from illegals and close our Borders so that they are not so easy for illegals to cross them. We need some common sense leadership for this Nation instead of all the socialism and liberalism, lies and corruption that is tearing this Nation apart. Hillary Clinton has already proven she can not ...","post_message":"Want a female president?   Skip Hillary. Look at Carly Fiorina!"},{"comment_id":"641559742659462","commenter_b":"This woman is either a complete idiot or a pure propagandist.","commenter_a":"Oh how people forget that gore won the votes of the people","post_message":"'Not since the American Revolution has the ruling class tried so hard and so blatantly to take away our vote.' – Judge Jeanine Pirro @webpagelink"},{"comment_id":"10152987066401336","commenter_b":"She is a f*&king idiot","commenter_a":"Once again the State Department speaks nonsense. Save your money - don't send your kids to Universities if she is any example of what they are turning out.","post_message":"“This is an insult to all the people in the world who are actually poor and are not blowing people up and not targeting Christians.'  Laura Ingraham slammed U.S. State Department spokesperson Marie Harf’s suggestion that job opportunities are a way to fight ISIS. @webpagelink"},{"comment_id":"10155873946605354","commenter_b":"Ass wipe.","commenter_a":"Because he's a Libtard","post_message":"Why would a Cuban rapper take offense at remarks against crime by Mexican illegal immigrants?"},{"comment_id":"521171901404436","commenter_b":"No I sure hope they stop these refugees from coming to our state in Arizona!!! Don't want them here!!!","commenter_a":"Come on fla...join texas","post_message":"Is your state in this MAP?"},{"comment_id":"10153721547731378","commenter_b":"Says a skinny woman","commenter_a":"Life is short. Eat the cake.","post_message":"Are 'Cheat Days' helpful or harmful to your diet? Some say giving into cravings can decrease your appetite. What do you think?"},{"comment_id":"870392283014938","commenter_b":"Just deport them","commenter_a":"Let them starve","post_message":"ILLEGAL ALIEN CRIMINALS ON HUNGER STRIKE IN AZ PRISON Give List Of Demands Including Removal Of Threat Of Deportation"}]
