[{"comment_id":"10152969881283188","commenter_b":"Leave Sarah alone!","commenter_a":"I agree with ya Glenn. Any dog will let you know if they don't like being bothered- for whatever reason. If the dog had wanted to move, he would have done so. Some people just like causing grief for others.","post_message":"On hate and Sarah Palin  In seeing that we have not seen or spoken to one another in maybe two years, sadly, I would not describe Sarah and I as \"friends\".   With that being said, \"lay off her!\"  As a huge dog lover myself, and two dogs that are like members of the family, I know that NO dog is going to lay around or take abuse.   For their dogs to lay down and allow trig to \"use him as a stepping stone\" shows that this dog loves, understands and is one with trig.  What is wrong with people.  Don't you have any cops to shout down, or chant \"kill, kill, kill\" or worse yet, don't you have any cops to gun down and execute in cold blood?\"  Where is the outrage?  Where is the media?  Where is our God?  Forgive me.  I know where he is.  We have exchanged Him for a cheap electronic, silicon filled or Wall Street version of God.     \"The gods of the copy book heading with terror and slaughter return.\"  Look out here they come.  I have been unplugged from the news for two weeks.  As I am making my final leg home with my dogs by my side, I decide that I would catch up on the news only to click on this story on the blaze.  What a mistake.  My wife always says, \"stop looking, it will all still be there in a week or two.\"   How right she is.  Look at what we have become.   Get a life.   Stop hating people.  We are not all going to agree.  As I said, the well between Sarah and I was poisoned by those who wished to control and hate.  I think.  Maybe I did something to poison it myself.  Could be.  I have done stupid stuff in the past without realizing it.  Her, them or me, makes no difference.  History bends toward justice and this it will all sort itself out.   That is okay.  We are not meant to agree nor am I someone that \"needs\" celebrity friends.   She doesn't always agree with me I am sure AND THAT IS OKAY!     I bring this up for all those on the left that think that we are all cut from the same cloth politically or socially.  We are not.   I have nothing to gain politically here, what I do have in common with Sarah is what I have in common with you too ... HUMANITY.    Do we even understand that concept anymore?  This has nothing to do with dogs, and if it does, you don't know what the hell you are talking about.  Maybe you have one of those little purse dogs.  This is a lab.    A boy and his dog.  This is all about hate for the Palins.    What is the meaning of diversity on the planet on which you live?    Sure there are crazy haters on the right and it is up to those who choose to set examples to shun them from our own personal ranks, but Personally, I have found the most violent and hateful are those who preach tolerance.   If you think it is horrible what a little sweet boy is doing with his dogs permission, Let me show you what millions of girls and women are doing to their children in the death camps of planned parenthood,  Black lives matter!   White lives matter!   Blue lives matter!    ALL LIVES MATTER!  I despise what we are allowing ourselves to become.  I will not join any one on this journey to the gates of hell.    LOVE and charity, forgiveness and understanding are the answers.  We all want to belong to something bigger and better than what we currently see.  We want to know we are being heard and can make an impact and we want control of our lives.  No one in Washington, republican or democrat, is helping us build that world.  The parties, universities and the media are shaping a culture of the silence of the lambs.    I reject that view and personally, because I can only effect me and those around me, I will take the beam out of my own eye first.   I have changed how I say and approach much of what I do, with the understanding that tables need to be upturned from time to time, but I will also work to wake those willing to be awakened about who is helping shape this culture.  Defund the GOP.  Democrats, unite.  When you clean out your house and we clean out ours, with malice toward none and charity toward all, we will be on the road of recovery and maybe our children will be able to live in a world where you income, sexuality, gender or political leanings mean exactly what they should mean:  NOTHING.  \"Forgive them Father, for they know not what they do.\" @webpagelink"},{"comment_id":"1069939893102262","commenter_b":"Agree ^^^","commenter_a":"More far right wing Christian terrorism supported by fox news and the NRA.","post_message":"Anti-Muslim rhetoric has spiked since San Bernardino."},{"comment_id":"884237154958166","commenter_b":"I would rather help pay his court fees than support all the illegals obummer opened the door for.","commenter_a":"Once Joe is gone the new one will see what it is costing the county and shut it down. The court problems Joe is going through now is just the beginning of his downfall.","post_message":"SOUND OFF: Tent City Jail turns 22 years old, and some people think it is time for Sheriff Joe to shut it down. Let us know what you think, then tune in to FOX 10 Arizona Morning and we will use some of your comments on the air."},{"comment_id":"681728708652647","commenter_b":"why would anyone want a sick old lady in office @webpagelink","commenter_a":"We are stronger together unless you're a minority! Then people like @username and Obama will use your vote every single election while destroying your family and destroying your wealth! If you do get out of the horrible system that they have helped create, they will take credit for it when you have success! She is an embarrassment!","post_message":"We're stronger together—and the diversity of our athletes in Rio proved it."},{"comment_id":"10154773746046350","commenter_b":"That is so awesome-we need more of this-people helping other people-","commenter_a":"I was in an abusive relationship with an alcoholic constantly trying to keep him out of jail, take care of our 2 young children and working as a bartender. I lost a job due to not having a sitter while their father was in jail. Little did I know, 2 people who used to come into my old employment owned a small family bar and needed help. They contacted me and offered me a job. I had only been there for a short time and my boss lent me money to get my boyfriend out of jail. After a month when I reached the end of this relationship my boss lent me his car and more money to get a place and get on my feet. He never took the money I owed him out of my check. He told me to pay when I could. Every year for 3 ...","post_message":"What's the kindest thing that someone has ever done for you? Tell us in the comments below.    TODAY is kicking off our second annual #ShareKindness campaign with a goal of inspiring 1 million acts of kindness by the new year. @webpagelink    Our sponsor The Y is helping us out by committing to the first 10,000 acts."},{"comment_id":"930444230329383","commenter_b":"And big SUCK IT to rupert & roger, FUCK the both of ya weasels!","commenter_a":"Awesome","post_message":"The folks over at Fox News had hoped to bully Dish Network into giving their toxic channel the cheap air time it demands, but going into a second week of being banished from the television lineup is only proving that Dish has more clout."},{"comment_id":"10153448214053984","commenter_b":"That lady has a problem nice in front of kids","commenter_a":"He was absolutely right in what he did. People like her should be called out. They have no respect for any rules, they think they don't apply to them.","post_message":"I would have done the same thing.  What do you think?"}]
