[{"comment_id":"10153754020631337","commenter_b":"Little Crybaby Bitches....aww","commenter_a":"Mets fans are always crying.","post_message":"'AN ABSOLUTE SCUMBAG': Folks were not happy with Chase Utley's slide against the New York Mets, to the point that they almost went too far..."},{"comment_id":"10153218753159270","commenter_b":"God will deal with this! He did it once.","commenter_a":"But your only going to enforce Christians to marry gays, but muslims can do whatever they want?","post_message":""},{"comment_id":"1259567494078669","commenter_b":"Just stop the CRYING,We didnt cry when Obama got in.Grow up!!","commenter_a":"Stupid is as stupid does.","post_message":"This just in..."},{"comment_id":"1731231320495188","commenter_b":"Fool","commenter_a":"Now ratify Obama's choice for Supreme Court judge.","post_message":"Backed into a corner, Senate Republicans have given up trying to repeal Obamacare."},{"comment_id":"10152552248390736","commenter_b":"Obama doesn't want anything that will improve the country. It is against his plan for a Muslim takeover.","commenter_a":"Get started on the over-ride and start taking with the House to get this president impeached!","post_message":"The Keystone pipeline would bring a reliable supply of energy into our country – providing opportunity, creating jobs and lowering the cost to ship goods, products and crops. The idea that Congress is sidestepping the normal process is out-of-touch with reality. This project has been studied for more than six years and has been given the green light at every obstacle. Arkansans and all Americans can see that President Obama is the real hurdle to Keystone. I will continue to support this project, and I urge the Senate to quickly vote to override this veto."},{"comment_id":"10154406577771051","commenter_b":"Ray >Melania isn't even from the US can't speak English an is a HOE!!!!!","commenter_a":"There is nothing wrong with her dress.","post_message":"This photo of Melania Trump sparked serious backlash after people noticed one thing about her dress."},{"comment_id":"10153093023857293","commenter_b":"Ha Ha Ha!","commenter_a":"the Republican brand has been damaged long before Trump! He is just icing on the top!","post_message":"The head of the Republican National Committee wants Donald J. Trump to tone it down."}]
