[{"comment_id":"10152703267277217","commenter_b":"64% of voters didn't vote for the Conservatives in 2010, so not that popular.","commenter_a":"Best PM ever. Don't even know why the others have bothered...","post_message":"What do you make of David Cameron's cufflinks? Follow our UK election coverage: @webpagelink #GE2015"},{"comment_id":"10153322835227994","commenter_b":"Sounds like something fishy. The devils monster wouldn't kill my kids before me.","commenter_a":"Don't strollers have brakes on the back I don't know this story is impossible to believe","post_message":"So sad. Her 18-month-old twins were killed."},{"comment_id":"10153722838823984","commenter_b":"Pussy breath","commenter_a":"Through the key away","post_message":"A federal judge has ordered Kim Davis to remain in a jail cell until she agrees to issue marriage licenses to same-sex couples. The state is holding a metaphorical gun to her head, yet all she has done is stand firm in her conviction that marriage is between one man and one woman. Stand with us and sign the petition for Kim Davis to be released from jail immediately!"},{"comment_id":"1089512117777571","commenter_b":"YEP CLINTON RAN TO CANADA","commenter_a":"Blame Carter. If he hadn't pardoned Clinton for draft dodging we wouldn't be in this pickle.","post_message":"SHOCKING VIDEO: US Marine Booed, Removed From Clinton Rally For Asking Legitimate Question WATCH THIS! @webpagelink"},{"comment_id":"10156291676570500","commenter_b":"So so sad!","commenter_a":"Was it her baby or was she babysitting ?!","post_message":"Deputies say they found him in possession of child porn sent to him by his wife. @webpagelink"},{"comment_id":"1180266452035470","commenter_b":"@username... Exactly! They're just drugged and/or drunken hoes.","commenter_a":"I FEEL YOU SHOULD HAVE A LIMITED AMOUNT OF KIDS IF YOU ARE ON WELFARE.","post_message":"WHOA! This judge goes off on this arrogant and ungrateful mother of 12 kids who has gotten a ridiculous amount of freebies from the state. What this mother says will disgust you. Can we get 2,000 'LIKES' to take back all the benefits this ungrateful moocher has gotten?"},{"comment_id":"1528594670781352","commenter_b":"Death penalty. Nothing less. Deporting them isn't going to change anything. They'll be back and will do this again.","commenter_a":"I love Obama","post_message":"If we don't have a border, we don't have a country. I want people to come in LEGALLY and follow the laws of our great country!"}]
