[{"comment_id":"10153916167801178","commenter_b":"Mommas ain't no saints in this passion play either.","commenter_a":"I agree. Black on black crime is so out of control and too many momma's ate losing their children to death. It needs to stop, all drivebys gang shooters need to be prosecuted to the entire law, not just slaps on the wrist.","post_message":"Sheriff Clarke slams Jesse Jackson for refusing to 'talk about the black-on-black crime in South Chicago.'"},{"comment_id":"10153282671259087","commenter_b":"@username We, obviously, are not idiots. Kinda shows with other comments. I have a fgreat idea, let's let all the illegals move in with you. Open your arms, and say welcome!!!!!","commenter_a":"Facts that can't be argued about Donald Trump. The man has been under attack since the day he announced. He has exposed how special interest groups, lobbyists and campaign donations corrupt our government admitting he himself has purchased favors. He has exposed media to be the bias self-serving thing they are. We've seen that he is right. Trump has told us what needs to happen to turn this country around. It's the cold hard truth. Trump has spent decades negotiating billion dollar deals with the toughest business minds on the planet and come out on top huge. Bankruptcy? Never has Trump gone bankrupt. He has over decades purchased failing businesses and used bankruptcy laws to restructure those and prevented those from failing. But 4 out of hundreds? Let's say 100. That is a 96% success rate. What experience does he have? He has dealt with politicians, world leaders and perfected ...","post_message":"“If anyone else was in Trump’s position they’d be viewed as the inevitable nominee,” said one former Reagan administration official who supports Donald J. Trump. “I have never seen a group of people so obtuse as to what is going on outside of Washington that they feel comfortable writing Trump off. They’re finally just now coming to the realization that he’s going to win.”"},{"comment_id":"10153571738266350","commenter_b":"This gotta be the dumbest bitch on this plant","commenter_a":"She has a lot of nerves, respect WHAT! killing the animal is not respect, shooting them with a camera is respect. Love to hunt and after your dead.... I respected her so much!","post_message":"\"Everybody just thinks we're cold-hearted killers, and it's not that. There is a connection with the animal, and just because we hunt them doesn't mean we don't have a respect for them.\""},{"comment_id":"1333958173358453","commenter_b":"@username you racist prick","commenter_a":"#FakeNews THIS is what it really looked like.","post_message":"An estimated 700,000-900,000 people attended President Donald J. Trump's inauguration today, about half the number of people who attended Barack Obama's eight years ago. @webpagelink"},{"comment_id":"10158633377120725","commenter_b":"Funny, president Obomba deported more people than any president in us history. Liberals worship him. Trump deports people and out come the crybabies and the protests.","commenter_a":"Why deport the good people? I don't get this ine","post_message":"Advocates believe the roundups and arrests mark a shift in enforcement under the Trump administration."},{"comment_id":"10156020385660725","commenter_b":"#FameWhoresDo","commenter_a":"Brooke the has been dethroned...","post_message":"A new celebrity has claimed the top spot on Instagram, setting a record on the social media site ----> @webpagelink"},{"comment_id":"999294776794334","commenter_b":"An epic read to do at 5.45am but i feel it went nowhere","commenter_a":"Sean Weir @username","post_message":"What if you found out there was a key that would enable you to open and close your doors of perception at will, void of psychedelics? What if you found out you not only held the key, but you were the key? Would you unlock the doors, or keep them shut? This is a good read."}]
