[{"comment_id":"10154567699055399","commenter_b":"cuts? cuts!? SS gave out a wonderful COLA increase for 2017 of ONLY .03%! That amounts to about $2.00 more per month while Medicare just raised their rates over 149%.....FAIR? It is insanity!","commenter_a":"Full severance packages for Medicare/Social Security recipients and contributors. Give them their money back and kiss them good bye. Get politicians out of the retirement/pension/health plans completely","post_message":"It would, among other things, gradually raise the retirement age from 67 to 69 on Americans 49 or younger at the present."},{"comment_id":"1377095295664272","commenter_b":"And she will WIN !","commenter_a":"killery is an ass...panders to any voter cause","post_message":"Clinton isn’t letting this bigotry go unnoticed."},{"comment_id":"10153261514799586","commenter_b":"There is no hope for trash like her, none. Evil cannot be cured by any medical means, can not be rehabbed by any therapy or therapists; its bone deep imbedded and what creates their DNA. The ONLY means of eradicating this evil is to permanently remove their existence from inhabiting the earth. Once removed, incinerate the physical carcass so there is absolutely no way of the evil occupying an ounce of space ever again, starting with animal and child predators of all existences such as this female beast.","commenter_a":"Word","post_message":"SHARE if you wonder the same thing. CC: Ricky Gervais #BanHunting"},{"comment_id":"722432601238848","commenter_b":"Idiot bitch","commenter_a":"No clue what-so-ever.","post_message":"She doesn't have a clue, does she? No idea how totally ignorant she sounds. --Andrew"},{"comment_id":"10153814092279740","commenter_b":"Gear up and hit the streets or shut up these KEYBOARD WARRIORS Crack me up !","commenter_a":"Great Job by the Police....Suspect had ample opportunity to surrender peacefully and the KILL ZONE for an edged weapon is 21 FT..he was well within that zone and a threat to police, who are not required to retreat nor should they...","post_message":"Fla. police shot and killed a razor-wielding man suspected in a bank robbery early Saturday. Video captured the shooting:"},{"comment_id":"923712007745578","commenter_b":"They and we need to not bring these people into our countries they can not and will not adapt to our cultures. Has there not been enough proof of that yet.","commenter_a":"Then, 10 infidels need to hunt down the five assholes that did this and, repay them ten fold.","post_message":"A Florida College Student Is Brutally Attacked By Five Muslims On Patrol Enforcing Sharia Law."},{"comment_id":"608860039265106","commenter_b":"@username Beautiful? NO!! She's SICK!!","commenter_a":"So real girls will have their dreams of becoming prom queen crushed because this school will more than likely give the award to a man in a dress just so the school can appear to be progressive.","post_message":"\"I'm not going to let anyone discourage me from being who I am.\" 18-year-old Dakota is one of four finalists running for prom queen her Portage, Indiana high school. The transgender teen is becoming an unlikely hero for some."}]
