[{"comment_id":"10156224607550354","commenter_b":"Thought she was an illegal immigrant.","commenter_a":"Is it any surprise she is black","post_message":"The Obama Administration continues to deny the food stamp fraud crimewave exists.   Instead, it continues to balloon the already exploding program. Check out the numbers..."},{"comment_id":"10154371429036491","commenter_b":"@username good luck having sex. I dont mind your sex life... duh","commenter_a":"The best birth control method is abstinence and celibacy.","post_message":"A leading medical group recommended IUDs as the best form of birth control for teenage girls today."},{"comment_id":"10153134788679411","commenter_b":"Punk assed bitch!","commenter_a":"Blah! Blah! Blah!","post_message":""},{"comment_id":"10153425632179342","commenter_b":"Getting awfully tired of MEN telling WOMEN not to get pregnant. We can not without your sperm.","commenter_a":"This is a disgusting decision. Planned parenthood has done so much for women's health and to cut off funding will kill so many women. Short-sighted idiots. You are not pro life, you are pro birth, to hell with the before or after.","post_message":"Planned Parenthood affiliates statewide were told in a letter why they were being cut off"},{"comment_id":"10158042812305551","commenter_b":"I have trouble with Rhinos who profess to be one thing, but are LYING. I have not trusted John McCain for several years. I am beginning to wonder about Marco. Time will tell. As for Hillary and John Kerry, They are trying to destroy what America stands for and that is FREEDOM. Than there is Eric Holder who along with Obama and Clinton, sold guns to Mexico Mafia. Corruption is what WE THE PEOPLE are sick of.","commenter_a":"Trump is right again. John McCain is no war hero and never has been.","post_message":"Two Senators Have a Problem with Tillerson, but not Hillary Clinton or John Kerry"},{"comment_id":"10154217110321770","commenter_b":"We have a lot of work to do in America cleaning our schools of these liberal crazy teachers.","commenter_a":"This country, well the insane left, has lost it completely. Just flat out have gone rabidly insane. They need STOPPED. Now.","post_message":"These are the people teaching your children"},{"comment_id":"1152390574850299","commenter_b":"Wish these women would press charges! That would be wonderful...","commenter_a":"This woman should bring legal charges. It is too bad she did not haul off and slug him then and there. There are too many honest credible women coming forward to ignore. Even die-hard Trump supporters should think twice about supporting such a lech. And no, the Clintons are not paying all these women to come forward. Use spell check if you want to be taken seriously Maynard.","post_message":"This makes 12 women that Trump is accused of not being able to keep his grubby, tiny hands off of."}]
