[{"comment_id":"848274368622676","commenter_b":"I tryed to watch it but everything else came up.... I agree with her 100% they are to demanding going into a new country.... You Muslims have good strong boy's ( can;t call them men chicken shits) send them back to fight you own war and not us !!!!!","commenter_a":"Makes me wonder what the hell is the matter with Islamic women? Can anyone answer why any women, with the way they are treated under Sharia, would want to be part of that? Disturbing","post_message":"OMG. If you only watch one video tonight, watch this Brit go off... on a Religion Of Peacer who told her to 'Shut Up!' This is an EPIC, unscripted, blast that you will probably love. @webpagelink"},{"comment_id":"10153605499851509","commenter_b":"She's doing a great job just having the officers do nothing other then standing around . These Cops should be arresting them instead shes giving these rats a free for all . Disgusting","commenter_a":"Mayor is an idiot. Saw it coming, said had to give people space to destroy, DID NOT CALL A CURFEW, and tomorrow school is cancelled, wonder what the kids will be doing tomorrow DAAAAAAAA","post_message":"What started as peaceful protests days ago have turned violent, with stores being looted, rocks being thrown at police and buildings and cars set on fire. Here's what we know happened today leading up to the violence: @webpagelink #BaltimoreRiots"},{"comment_id":"755539251303319","commenter_b":"Send the bitch to jail and strip the bed sheets off of her","commenter_a":"Your in US lady you must obey the law... I'm sure when your in Muslim country your not even allowed to drive ....","post_message":"Burqa-Clad Woman Pulls Race Card On Cop, Gets Brutal Wakeup Call That's not how it works in America... Sorry. Do you think she got what she deserved?"},{"comment_id":"1102034899855986","commenter_b":"You all want a Muslim hater so kinda breaks out even don't you think?","commenter_a":"Fuck 'em.","post_message":"American Islamophobes are beside themselves because human rights activist Sadiq Khan was elected mayor of London."},{"comment_id":"10153855338620047","commenter_b":"Nothing will happen to any of this mafia, unless Trump is elected. I hope everyone saw the video on TV, where Obama actually told an illegal to vote tomorrow and to tell her friends it was OK for illegals to vote. It is simply a TAKE OVER OF AMERICA!!!! It is a WAR by ballot!!!! Wake up Americans because if we lose tomorrow, we lose America!","commenter_a":"Prosecution","post_message":"Sign and Share our urgent petition to demand the Attorney General's immediate resignation for breaking the sacred trust of the American people."},{"comment_id":"10153562430331350","commenter_b":"Shut up you stupid woman","commenter_a":"Why do white think they can break rules ? Anyone hunts is a savage, and they are going to suffer, that's the way they think you can treat black people also, you and your seeds will suffer, and it's long overdue, there is no way God gave me this same book to worship as the white man. Break the curse and burn the bible.","post_message":"Legal analyst Lisa Bloom explains what could be next for the dentist."},{"comment_id":"1104058139606442","commenter_b":"Not a politician but an accomplished business man, with a reputation for getting things done right! he's got my vote and the illegals can build the F-N wall for trespassing and then get their a** on the other side. And all those anchor babys adios amigos","commenter_a":"Why did you cut him off? He was still talking. That's very disrespectful. You do that again and I will unfollow this page.","post_message":"GOP DEBATE  Watch Donald Trump affirm his commitment to not only building a wall on the US/Mexican border, but making MEXICO pay for it."}]
