[{"comment_id":"10153205504771336","commenter_b":"You need to get the Fffff out there's you are useless Lady or what ever you are. You are a disgrace.","commenter_a":"Recall this mayor!","post_message":"“I never said, nor would I ever say, that we are giving people space to destroy our city. So my words should not be twisted.” Mayor Stephanie Rawlings-Blake spoke to reporters moments ago amid growing violence and chaos tonight in #Baltimore."},{"comment_id":"10153783158317894","commenter_b":"Where do you find women naturally shaped like that without intense waist training?","commenter_a":"I do question if she's had work but there are woman shaped like that in life actually. Not all women have that tire around their waist. Only reason I question her because her butt never changes size despite increasing or loosing weight and mine definitely does.","post_message":"Kim Kardashian Claps Back at ‘M.I.L.F. $’ Photoshop Accusations: ‘F*ckYoPhotoshop’ [Photos + Video]"},{"comment_id":"10153238674498984","commenter_b":"this bitch will have blood on her hands","commenter_a":"good now i have more reasons to cut myself and attempt suicide.... this really set me off ..","post_message":"What she said about \"fat white Americans\" and \"racist white conservatives\" is absolutely sickening... Are you outraged by these comments?"},{"comment_id":"10153036681682235","commenter_b":"You bitch I hope he shoots you right between your eyes.","commenter_a":"it is a sick movie about a truly sick man who was used by his government. Instead of treating his sickness they increased it and used it to kill.","post_message":"Fox News host gets off on killing."},{"comment_id":"946471268733575","commenter_b":"Sit down an be quiet Mitt!","commenter_a":"Trump is not my choice, but why do Republicans do this to themselves? And who cares what Mitt Romney thinks - he blew his chance and I do mean blew it!","post_message":"Donald J. Trump fires back at Mitt Romney's claim that there may be a \"bombshell\" in his taxes. @webpagelink"},{"comment_id":"10153659512120667","commenter_b":"add plz","commenter_a":"Put one of these posers up against a Gracie see what happens...dumbed down fighting","post_message":"He did it again."},{"comment_id":"10152969196420796","commenter_b":"So?!","commenter_a":"I am very pleased not to be surrounded by poorly educated, I'll healthed, no skilled illegals and newly landed muslims. Maine people do well to care for Our own. Let the world work it out. America is not a dumping for human trash. Coe with skills and be ready to fly our flag, defend our Constitution, and become a citizen.","post_message":"The state's current demographics resemble what the rest of the country used to look like. In 1940."}]
