[{"comment_id":"10153650644833812","commenter_b":"Feminism at its finest.","commenter_a":"Hillary Clinton has a beautiful spirit God bless","post_message":"Hillary Clinton's mom, family life at center of $2,000,000 TV ad buys directed at Iowa and New Hampshire: @webpagelink"},{"comment_id":"615645605262622","commenter_b":"She probably wants to take all the women to Venus!","commenter_a":"I thought Elon Musk was a perfume!?","post_message":"Who wants to go to Mars with Elon Musk?!"},{"comment_id":"602527166571478","commenter_b":"Certain ppl should stop reproducing","commenter_a":"@username fuckin retard","post_message":"So Dumb: She Thought She Found A Hack To Charge Her Iphone!"},{"comment_id":"10153250211681336","commenter_b":"Seems like a lot of immigrants spouting out of their pie holes when no one knows what happened yet.","commenter_a":"AM I THE ONLY ONE WHO THINKS ALL THESE DERAILMENTS IN THE LAST FEW YEARS ARE BY TERRORISTS????","post_message":"“It is an absolute disastrous mess. Never seen anything like this in my life.”  Philadelphia Mayor Michael Nutter confirms at least five people are dead and 53 have been transported to hospitals with six in critical condition after Amtrak train 188 traveling from Washington, D.C. to New York derailed Tuesday night. @webpagelink"},{"comment_id":"10155447745046509","commenter_b":"HAHAH NNeta Fitria","commenter_a":"She works at Comcast now and has hung up on me 7 times.","post_message":"\"Ain't nobody got time for this.\""},{"comment_id":"927501820717545","commenter_b":"Perfectly stated.","commenter_a":"Translation: \"I am begging all my supporters, that despite conning you into voting for me, you need to come to DC. I need a display of reverence and adoration. I will be mostly alone but I am terrific and I alone make a great show!... Oh, come as you are... preferably in white sheets.\".","post_message":"Twitter reply of the year goes to Tony!  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1110149189061308","commenter_b":"criminals do know each other and apparently marry their offspring to each other's families!","commenter_a":"Father a criminal politician, Ex., asked for Clinton's support in Mizzou 2 years ago, not to be, and there is some concern that Hillary supported with information received as Secratery of State, investments made by Mezvinskey the younger, including a deep water construction opportunity...............!","post_message":"Allen West Republic"}]
