[{"comment_id":"10154494540149586","commenter_b":"T p dig n jag s denna Jenny!","commenter_a":"Giulia","post_message":"\"I resist the systems that oppress people & animals alike.\" #WomensEqualityDay"},{"comment_id":"10152853063786748","commenter_b":"Know what, dude, if you and Obama went to a lunch counter in the deep south in the '50s, you would both stand an equal chance of getting abused and assaulted. And if the right wing scum you shill for ever get back in power, you'll find yourself right back in the 'separate but equal' category tout suite. :P","commenter_a":"right. cause Alan West is the epitome of \"blackness\"","post_message":"Right-wing pundits claim Obama isn't *really* a black American"},{"comment_id":"10154450700759411","commenter_b":"Not Only Gay, what about all females that Catholic Church burned at dark age?.","commenter_a":"We all need to REPENT turn from our wicked ways and worship the Lord Jesus. Judgment will come to all when the lord returns... Even the Pope will be judged for his words and actions.","post_message":"'The questions is: if a person who has that condition, who has good will, and who looks for God, who are we to judge?'"},{"comment_id":"530424503814796","commenter_b":"I'd be out of a job!","commenter_a":"what is illegal is letting ASS HOLE groups like the GAY patriot put their STUIPD SHIT on facebook they should be put in jail for life","post_message":"A popular company is forcing their employees to wear head scarfs.  This has to be illegal.  Would you quit if they tried to force you to wear a headscarf?"},{"comment_id":"10156761765540354","commenter_b":"Beyonce should eat a bullet.","commenter_a":"just go away already","post_message":""},{"comment_id":"10153388655343812","commenter_b":"Ugly and disgusting! !!","commenter_a":"ridiculous looking","post_message":"Brazilian bodybuilder claims a synthetic material brought massive muscles -- but also medical danger: @webpagelink"},{"comment_id":"1754592891449959","commenter_b":"@username totally 💞","commenter_a":"@username 💖👻💖","post_message":"It's literally the most magical thing of all time, Harry Potter fans."}]
