[{"comment_id":"577042442420795","commenter_b":"Lmao and crystal you're vote dosent count dumb ass. Have fun. In the end the government is choosing hillary over the rest of the puppets. This country was never and will never be good. And like I said cunt. He ships jobs out of fucking state. But hey research dosent count when a babbling moron says shit you like does it fucking broad? And you're voting for another greedy old men who has already said we're going back to war. And starting another war with Mexico if they don't pay for his little wall. You're stupid as fuck. Fucking little sheep. No a pig. Eating the shit they tell you. Fuck the media. It's all bull shit. Just like your vote. The world would be better without trump and his little feeble supporters. All so violent. All short of a few brain cells. Lmao you all get dumber and dumber ...","commenter_a":"This really exposes the mass ignorance in this country. The media brainwashed assses will stoop to any level. I remember when nobody hated Trump. Then the government owned media started a smear campaign. Wonder why the media would tell so many lies on one person. He's obviously a threat to the punks running things in this country.","post_message":"Because Donald Trump’s star continues to be vandalized, the Hollywood Historic Trust is considering removing it from the Hollywood Walk of Fame."},{"comment_id":"1106451702729020","commenter_b":"Go girls. Rape is never justified!","commenter_a":"It's sick that they were still trying to give excuses even though there is never an excuse for rape. Once that girl brought up raping 6 year olds they shut right up! They know it's not right but they're still trying to make up ways to say it's the women/girls' fault. This is so unacceptable and disheartening. 😔","post_message":"These teenage girls are confronting rape culture in India. This is what bravery looks like. (via AJ+)"},{"comment_id":"10153231132726336","commenter_b":"they should leave and not allowed back","commenter_a":"Look all black","post_message":"'If you don't like what that flag stands for... leave!'  On 'Fox & Friends,' Medal of Honor recipient Dakota Meyer called for a social media campaign to counter a movement encouraging Americans to stomp on the flag."},{"comment_id":"10154726138223812","commenter_b":"Fact for cowards. Unlike political girly men now. ENFORCE LAW and ORDER--GO TRUMP. Law and order will be immediately restored. Immediately Trump start Rounding up, deporting illegal swine criminals, illegal swine drug dealers, illegal swine drug cartel members. This will solve a lot of the problems.","commenter_a":"How many clowns can you fit in your trunk Mr, King?","post_message":"Rep. Steve King, a conservative immigration hawk who has expressed skepticism about Donald J. Trump's shifting tone on immigration, says at Joni Ernst's Roast & Ride: 'I'm not only going to go into the polls and vote for Donald Trump in November, but I'm going to bring everybody I can with me.' @webpagelink"},{"comment_id":"10153415193876833","commenter_b":"I no Right, They Don't Want The Public Safe!!!!!! Then the Rioters and Looters would be Looting and Rioting even More and getting away with it as always!!!!","commenter_a":"Does this mean our murder rate will plummet because the gang members won't have guns?","post_message":"The U.S. Seventh Circuit Court of Appeals issued a decision on Monday allowing a Chicago-area gun and magazine ban to stand. Such bans are justifiable, according to the court, merely on the basis that they 'may increase the public's sense of safety.'"},{"comment_id":"895449430498298","commenter_b":"Both are DICKS!","commenter_a":"A shame that both our prez and attorney general drew the guilty card before any investigations. Instigators to anti-police sentiment? Comments like Paul's are simply deniers to the findings of two separate independent investigations that produced identical findings. That is, Brown never had his hands up, was never surrendering and he was the aggressor.","post_message":"The Justice Department has finally confirmed what many of us were certain was the case: Ferguson police officer Darren Wilson told the truth about what happened when he said he shot Michael Brown in self-defense. After a six-month investigation, the DOJ concluded that Brown, allegedly a thug and a thief, was not trying to peacefully surrender when the incident occurred. He did not hold his hands up and say, “Don’t shoot.” And he was not shot in the back, as some alleged. @webpagelink"},{"comment_id":"736534466449620","commenter_b":"RADICAL ISLAMIC TERRORIST MURDERED THE 49 PEOPLE IN ORLANDO!! ...NOT GUNS!! KEEP AMERICA ARMED! OBAMA WANTS TO DISARM EVERYONE EXCEPT RADICAL ISLAM.","commenter_a":"What the heck? How ridiculous is this?!!!!! These are grown people in huge positions of leadership acting like fools. This is messed up!","post_message":"Louie Gohmert crashes the 'sit-in' and drops some truth."}]
