[{"comment_id":"1724833864402419","commenter_b":"We're going to drive one right up that midgets rectum","commenter_a":"Hey its cool. He's just demonstrating our first amendment rights. Lol","post_message":"NKorea claims could wipe out Manhattan with hydrogen bomb..."},{"comment_id":"977678122350240","commenter_b":"Hillary is NOT with us, we are NOT with her.","commenter_a":"The Revolution!!!!! Bernie !!!!","post_message":"Bernie or Bust rally in downtown Philadelphia"},{"comment_id":"10153143736247434","commenter_b":"Bitch, I will snatch the wig off your f'ing head! Don't come for us gays, whore. We don't play!!!","commenter_a":"Another example of LGBT being absolutely clueless when it comes to racism.","post_message":"These are by no means new rumors but now’s not the time for this, Alexis!"},{"comment_id":"10154040772674778","commenter_b":"You're an idiot and idiots should not reproduce!","commenter_a":"Same sex marriage is not about love....it's about lust and sex...and it's nasty","post_message":"Here's the final paragraph of the Supreme Court decision legalizing same sex marriage across the nation. @webpagelink"},{"comment_id":"1107229992636988","commenter_b":"This old Killer Bag just never gives up with her Lies. LIER, LIER, YOUR PANTS SUIT IS ON FIRE AGAIN.","commenter_a":"The thought of getting ready for Hillary is like getting ready for an 8 year long colonoscopy except the colonoscopy would be more pleasant.","post_message":"Ready or not, here she comes! Hillary is getting ready to announce, and I am getting ready for Hillary.  #HillarysBigAnnouncement #Hillary2016"},{"comment_id":"10154033420732293","commenter_b":"He is just a Gangster! Sick! Abnormal!! Frighten thing!! If they indeed build the wall and this crooked man wins, every American is going to regretted as the will try to jump to the other side (Mexico) trying to be safe from his menace. He wouldn't care about America as long as him and his family gets their hands on the treasure, Money, Power and Threats!!! And American who voted for him, will find a job in Mexico planting food and cleaning, karma!!! Just let him win and you will see and live as Latinos, Africans and Chinese after a war.","commenter_a":"Imagine if you will 'The Donald' as POTUS - and after a speech, address, whatever.....people are scrambling to yet once again 'explain' what he said, to have to diffuse a potentially volatile situation with another country or world leader. I want my President to have clarity of thought, to speak in a measured, thoughtful and highly educated tone. I don't want her or his words to be subject to interpretation. His rhetoric is inflammatory, bigoted, and often without thought. His use of language is at best that of an arrogant, whiny, teen-ager. No way does this man possess the skill-sets needed to be my president.","post_message":"There have been multiple explanations. There haven't yet been any that work."},{"comment_id":"10153395061888690","commenter_b":"Saudi is bad for woman, Iran is worst. Pakistan is the best Muslim country for Muslim woman.","commenter_a":"Iranian cancerous mullah regime needs to be removed surgically.they are biggest violators of human rights.","post_message":"Prominent Iranian activist \"forcibly arrested\" by security forces in Tehran @webpagelink"}]
