[{"comment_id":"10154501984339087","commenter_b":"@username So they get deported five or six times then come back and kill innocent people. Did you know that most of them send money back across the border to help their families come here.","commenter_a":"Trump cost himself the popular vote. He already said he is keeping Obama's amnesty in place. So if he's blaming the illegals why would he keep them here? He is such a lying fool and his supporters suck it up.","post_message":"\"He said 3-5 million 'illegals' voted so that's why he lost popular vote,\" one Democratic aide said about President Trump's comments at the meeting."},{"comment_id":"10152575387122217","commenter_b":"It should be illegal to sell cigarettes to pregnant women!!","commenter_a":"I think women who smoke during pregnancy are just selfish vile people. ..thinking of themselves and not there babys health....it should be illegal to smoke while pregnant !","post_message":"Should pregnant women be paid to give up smoking?"},{"comment_id":"904121959720983","commenter_b":"Lock Her up!","commenter_a":"Behind bars fits her","post_message":"America is waking up!"},{"comment_id":"778104105644597","commenter_b":"CNN reported on this at its finest. Condemned those who stand as patriots while providing excuses for those who slaughter innocent people . Nothing but hypocrisy!","commenter_a":"Love this lady!","post_message":"Report: Man slain by police in Boston sought to behead Pamela Geller"},{"comment_id":"1815605405326385","commenter_b":"CSI!!! That bitch bit me... great episode.","commenter_a":"Is no one concerned that she is really a giant lizard? #reptilian","post_message":"Is this an indicator that we really should be concerned with her health?"},{"comment_id":"1140950715967044","commenter_b":"Lying two faced cutthroat hag.","commenter_a":"If mouth is open lies are being told.","post_message":"BOOM! Coal Miner Calls Out Hillary to Her FACE! Watch her try to \"umm umm babble babble\" a way out of it VIDEO  The entitled hag gets slapped with karma! WATCH!"},{"comment_id":"1220599301301398","commenter_b":"@username where is your weed now","commenter_a":"That will soon become illegal for sure","post_message":""}]
