[{"comment_id":"10154767711621729","commenter_b":"There is a possibility that he wont be Trumps VP ,....because he is considering the VP job with Hilary....just saying","commenter_a":"don't wanthe little bitch","post_message":"Never say never?"},{"comment_id":"10153171709824456","commenter_b":"HISTORY","commenter_a":"I am so glad I took part in history glad to be a Masonic brother","post_message":"The march to Montgomery is underway...  @webpagelink"},{"comment_id":"10153694890631323","commenter_b":"What are black women always the ones who show so much ignorance","commenter_a":"If they aren't defined by it than why change your sex medically? Come on","post_message":"They could have made something positive, but the new Channel 4 series Girls to Men is demeaning to trans people on so many levels: \"Greater visibility for trans people should not mean even more close-up shots of genitalia and 'Ooh, don’t they look different – almost like real men' montages. It should be about taking the focus off surgery, suffering and sensation, because a transgender man is not defined by those things any more than the next person\""},{"comment_id":"10154014383211636","commenter_b":"hmmmmmmmmmmmmmmmmmmm, she needs to be hanged.","commenter_a":"good! even the uk police can be corrupted.","post_message":"She was shot in the stomach, but not by the man she claimed"},{"comment_id":"10153660041871770","commenter_b":"Shes a idiot to.like we care what a gold digger has to say oh she fits in with crooked Hilary","commenter_a":"Who cares care","post_message":"What?!"},{"comment_id":"10153055939596051","commenter_b":"Prayers for the puppy and the staff taking care of her.","commenter_a":"Jail the creep, with his mouth treated the same.","post_message":"Remember the dog they found with her mouth taped shut? Well, good news."},{"comment_id":"10152567053540927","commenter_b":"Rice did the same thing with her emails. Is she evil too?","commenter_a":"She is one evil person.","post_message":"They're taking her own staff's word for what could possibly have been a major national security risk!?!"}]
