[{"comment_id":"236858020109682","commenter_b":"Get the lady off the pic","commenter_a":"He got in there by something called \"voting\". Just saying","post_message":"LIVE VIDEO: 'Not My Presidents Day' anti-Donald J. Trump protests are happening across the country. WARNING: Viewer discretion is advised"},{"comment_id":"10153793853959714","commenter_b":"You know how you don't want to date every girl you see? Girls don't want to date every guy they meet :)","commenter_a":"I don't understand why women say being too nice is unattractive when all they can talk about is how they wish they had a nice guy and someone who would finally treat them right but when they find a good man who does they say \"i can't be with you cause you're too nice\" and end up with the same type of guys who treat them bad I know part of it is because some girls aren't use to being treated like that so they go back to what they are use to or they just think we want something out of them give people a chance there are still good people left","post_message":"We don't know about this one..."},{"comment_id":"1024169244346094","commenter_b":"So basically, nobody proofread the most important speech this woman will probably ever make. Yah, right. Wish there were SOMEONE I wanted to elect.","commenter_a":"all the first ladies speeches hold such content,, it is a speech of genuine concern and well they all have the same ideals,, so look up some other first lady speech's,, it will be a great opportunity to learn s0mething new and see what content the other first lady speech's hold,,you might find out something very interesting,,","post_message":"A speechwriter for Melania Trump is taking the blame for lifting passages from a 2008 Michelle Obama speech, admitting she made a 'mistake' – while saying she offered her resignation, but it was rejected. Full statement: @webpagelink"},{"comment_id":"10152612107376636","commenter_b":"Women have to cover their hair in 2015 Ffs as if hair tempts men into sinning, give me a break.","commenter_a":"Not true! I am a Muslim woman and NEVER been pushed away from any mosque; whether it be in my home country Egypt or in Tunisia where I currently live with my husban. I am totally sick of the Independent and of all the bogus they keep spreading on Islam","post_message":"This is a problem that has been going on for decades, and little has been done to change it"},{"comment_id":"1311513512199990","commenter_b":"So Slick Willies wife is the answer, LOL","commenter_a":"Trump is a symptom. He makes it easy for people to place the blame on him because, let's face it, he thinks he's smarter than he's capable of being. But, the vitriol and hate that is so easy to see NOW has always been there, simmering. Trump is a boil, a symptom of an untreated infection. People need to take a good look at themselves, their friends, their families, and their neighbors if they really want to understand the \"virus\" and the \"unreason\". It isn't as distant as Donald Trump.","post_message":"American history is littered with \"narcissistic demagogues who lie and distort in pursuit of power and self-promotion. Bullies all, swaggering across the landscape with fistfuls of false promises, smears, innuendo and hatred for others, spite and spittle for anyone of a different race, faith, gender or nationality.\" -- Bill Moyers and Michael Winship."},{"comment_id":"10153861308944087","commenter_b":"@username and u so fucking stupid","commenter_a":"The sad part is people in this country seriously think she is worth voting for...","post_message":"#BREAKING: A federal judge blocked Judicial Watch’s effort to begin interviewing State Department officials under oath and collecting evidence as part of a lawsuit over Hillary Clinton’s private emails."},{"comment_id":"10153364359422411","commenter_b":"Female castration","commenter_a":"What do they do about the women?","post_message":"A Republican from Alabama has introduced a bill that would require sex offenders to pay for their own surgical castration before being released from state custody."}]
