[{"comment_id":"1218171641599870","commenter_b":"She's a COOK","commenter_a":"Wow! Mr. Anderson Cooper. Thank You!! It gives me hope for CNN.","post_message":"Anderson Cooper must have hit a nerve! He just suggested to Elizabeth Warren that the Democrats might be \"out of touch\", and she was NOT happy."},{"comment_id":"10154241809909411","commenter_b":"@username yes they can. They feel more comfortable in turkey then Europe. Lots of racist people giving them dirty looks in Europe.","commenter_a":"Europe should consider making a deal with Greece rather then Turkey who is playing its proxy war over Refugee crisis.. European Parliament Greece is honesty and has no evil or greed sort of motive behind this cause. They can handle refugees better then turkey. Who by the way is taking advantage of the European Parliament by making a deal and asking a free hand to strike and bomb Kurds who are basically fighting ISIS which turkey is making it hard for kurds by attacking them and making it easy for ISIS to freely invade other save areas of Iraq and Syria..","post_message":"'People detained on Lesbos and Chios have virtually no access to legal aid, limited access to services and support, and hardly any information about their current status or possible fate'"},{"comment_id":"446969245501847","commenter_b":"We need a first lady with her boobs hanging out ?? Geeeez - that is classy","commenter_a":"Beautiful family! Trump got good taste when it comes to women!","post_message":"Thank you!!"},{"comment_id":"1065496103473179","commenter_b":"J.K. needs to mind her business.","commenter_a":"WOW! She shut it down! OMG! Trump is backing down because a writer...no wait! This article isn't about the writer...it's not about Trump. It's about Pierson. No wait, it's about a writer comparing to one of her make believe characters. Jesus, if your going to attack; pick an opening paragraph and stay on topic. If you can't do that...atleast get the headline to reflect the topic...","post_message":"Just 5 words  and they say it all."},{"comment_id":"1141758235909203","commenter_b":"Bucket of losers and needy Mexicans. She was right.","commenter_a":"Actually, The founding fathers were rich aristocrats who valued property rights at a premium, so much so that they limited the right to vote to land owners, who at the time were the billionaires of their day. It isn't right that billionaires can buy elections, but that probably would have been the intention of the founding fathers.","post_message":"When the Founding Fathers wrote the Constitution, I’m pretty sure they weren’t thinking “Let’s make sure billionaires can buy elections.”"},{"comment_id":"10154325852416323","commenter_b":"The woman is a perpetually grinning dimwit. She'll probably become PM.","commenter_a":"Fucking moron","post_message":"\"At least 50% of her public statements sound as if they were said for a dare. 'Let’s banish pessimists.' 'Boris Johnson is a lovely man.' The rest sound like she’s assembling endtimes magnetic fridge poetry.\""},{"comment_id":"10154172496221717","commenter_b":"Indiana needs to leave the transgenders alone!!!","commenter_a":"They refused to hear the bill and it's officially dead.","post_message":"Freedom Indiana warns that the the proposed legislation \"could be used to target transgender individuals for discrimination and harassment.”"}]
