[{"comment_id":"10152487852365927","commenter_b":"Maybe your parents should have aborted both of you!!","commenter_a":"Hang them together.","post_message":"They're PROUD!?! Wow..."},{"comment_id":"10153237283580329","commenter_b":"Kurt Russell","commenter_a":"Jared padalecki from supernaturals","post_message":"Keanu Reeves or Arnold Schwarzenegger?"},{"comment_id":"10156932201230389","commenter_b":"Good answer. She is a sellout.","commenter_a":"NOT EVEN HONEST TO THE PEOPLE THAT PAY HER?","post_message":"David Webb: “Do you think Hillary Clinton’s honest?”  Answer: “I think she’s honest to the people who pay her.”  MORE: @webpagelink"},{"comment_id":"10154383170579877","commenter_b":"Right","commenter_a":"He didn't become \"more racist\", he already was. Trump just brought out their TRUE COLORS throughout his campaign. Big difference.","post_message":"This woman claims her ex became a \"monster\" during Trump's campaign."},{"comment_id":"701393549998426","commenter_b":"Get them out of US STOP PC they do not deserve to speak in N TV , no Christian or Jewish leaders were invited to speak to reporters. Muslim Imam just said it in Press conference (is like we did it n so what) is just mass shooting Hello THIS IS TERRORIS AT ITS BEST ISIS STILE, wait our Muslim President blame gun control","commenter_a":"IF he really wants to stop shootings he should go to Iraq or Afghanistan .where shootings hangings, stoning, acid baths, beheadings, gas weapons, all take place on the regular. WE have been saying this is going to be a problem here. we already have too many whack a do 's to deal with, and letting people who have an intense hate for a certain segment of our society in to this country with NO understanding of our population and LAWS other than it picks up the tab, is a recipe for this very thing. But IS NOT a good enough reason to give up my gun rights. I will just cling to my weapon and bible thank you very much. gay people everywhere should understand this now, weather it's a gun or a bomb, you are on their hit list.","post_message":"Speechless."},{"comment_id":"10153475674267452","commenter_b":"Illegals for a living too.. And pay taxes and guess what they don't get a refund. Securing borders? Fix the immigration system it's hard becoming legal.. The system is he problem not the illegals..","commenter_a":"Congratulations on not being an illegal immigrant and working for a living. Trump is not against immigrants he and many other Americans are against ILLEGAL immigrants. Oh and your protest in Canada doesn't mean a thing in the USA.","post_message":"In protest of Donald Trump’s immigration policies, a construction worker hung a Mexican flag atop the Trump Tower in Vancouver, Canada. abc7.la/1W7pFVh  “While working on your tower, Mexicans didn't steal anything nor raped anyone. We just did the best work we could possibly do, for ourselves, our families and the future tenants in your building.”"},{"comment_id":"1023827831012269","commenter_b":"Darlene Daniel not fair to Americans. Take way American jobs with low wage illegal invaders","commenter_a":"We \"ALL\" know that Donald Trump is \"NOT\" afraid of Megyn Kelly. Actually it is just the opposite. Fox News is AFRAID OF DONALD TRUMP.","post_message":"Michael Moore chided Donald J. Trump for being afraid of Megyn Kelly and backing out of the upcoming Republican debate Tuesday night on \"The Kelly File.\""}]
