[{"comment_id":"807827122679666","commenter_b":"@username I think that the Muslims that really care must get out the message open the Mosque no more secreats or hit the F g road and go home two sharia law","commenter_a":"I'm so sorry for any Muslim reading these comments. Truly. People are so horrible. I can't belive I identify as a Republican along with this people. You are welcome in my world.","post_message":"Ban all Muslims? Seriously, Donald J. Trump? #GOPDebate"},{"comment_id":"10154586302758822","commenter_b":"Nobody hire ur nasty bitch ass","commenter_a":"Kdka u must b gettn pressure from ur execs to push all this liberal garbage ur only local news i watch but its gettn harder and harder to watch","post_message":"Have you noticed a drastic spike in Insulin costs? What gives? Is there anything you can do about it? #KDKA-TV News at 5:45"},{"comment_id":"10154288935233984","commenter_b":"What a bitch!","commenter_a":"You will know for sure when we run out water","post_message":"Dem Sen. Barbara Boxer just laid into this Catholic priest for appearing to question Pope Francis's warning on the dangers of global warming. Do you think global warming is a hoax?"},{"comment_id":"10154701801396002","commenter_b":"Just like this woman doesn't care if you believe her or not.","commenter_a":"I'm not believing this, you're leaving prescription drugs in the house and know you're going to be gone for 5 days? We never leave ours behind Fir any reason because of what you have to go thru to replace them. I also can't believe they stole video games and not the TV. According to the report and the time limit, they would of wiped them out. Just my opinion.","post_message":"Standing in the middle of her ransacked living room, Taylor resident Janice Mulholland is in disbelief."},{"comment_id":"10155239406179199","commenter_b":"Wow, you're an a**h**e","commenter_a":"I bet you they're trump supporters.. them","post_message":" still a person, you should still treat me with respect."},{"comment_id":"10154278742015329","commenter_b":"Thats that lingo dang old times lol","commenter_a":"Diego X Flores Pringle","post_message":"Single and ready for a PRINGLE."},{"comment_id":"10156151601990294","commenter_b":"She was underage.... Huge mistake......","commenter_a":"I find it funny that people are actually defending him.... If this was any regular person he would've been considered a pervert, a pedophile, a sick man But who am I kidding, he's a ( white ) cop He's above the law","post_message":"The 17-year-old says the officer only received \"a slap on the wrist.\""}]
