[{"comment_id":"10154324384701600","commenter_b":"This has been going on, way before the flood of people started moving here. this is what happens when a predator looses it's fear of humans","commenter_a":"Its because so many people are moving to Colorado. There are more homes and apartments being built and the more we build the more we invade their homes. It becomes harder for then to hunt for food. So then they move into our towns and cities because people leave trash around everywhere.","post_message":"Update: 5-year-old boy survived the attack. His mom fought the animal off. The boy is being transferred to a Denver hospital in fair condition."},{"comment_id":"10153203727769342","commenter_b":"Way to go ladies","commenter_a":"Smdh","post_message":"It was an all-out brawl in the middle of the day, and ultimately, it was two women armed with a bat who came to the rescue of a young man in serious trouble. The incident was caught on camera."},{"comment_id":"10153231905295047","commenter_b":"Obama must be stopped, or the Supreme Court is complicit in his wrongful actions.","commenter_a":"Qut saying it, DO IT.","post_message":"When President Obama circumvents Congress to rewrite the law, he's acting more like a king than a President. His illegal Executive overreach must be stopped. Sign and Share our Supreme Court brief to take action: @webpagelink"},{"comment_id":"1703000273311505","commenter_b":"If they want want to demand, tell them to go home!","commenter_a":"First of all, you can buy any kind of food you choose on food stamps ( I work in a grocery store, if you could see what people buy with food stamps ) , secondly you can't DEMAND anything. If you have demands, demand it from your own country.","post_message":"Muslims On Welfare Benefits Make RIDICULOUS Demand About Food Stamps If you want special treatment, then go get a job. Do you agree beggars can't be choosers?"},{"comment_id":"1532736620362438","commenter_b":"Cool ! I am sure he wants no more illegals!","commenter_a":"Build the wall and lock your self in there","post_message":"Donald Trump speaks live at Indiana State Fairgrounds. For a close-up view, watch our stream on our website: @webpagelink"},{"comment_id":"694257180764860","commenter_b":"Oh please, these people are untouchable or she would have had in jail a long time ago.","commenter_a":"Throw her off the face of the earth along with Obama. .that would be the best thing for this country","post_message":"Insider information surfaces that will ruin Hillary's career forever. She's finished. Let's spread this. Can we get 30,000 'LIKES' to keep Hillary out of office forever?"},{"comment_id":"10153880483259705","commenter_b":"Samantha, this is your life.","commenter_a":"The driver?","post_message":"Mind... doesn't... understand..."}]
