[{"comment_id":"902035299831892","commenter_b":"Then don't eat the Damn thing, leave now.","commenter_a":"im so sick of people trying to make racism out of nothing u people r pathetic","post_message":"What do you think? Is this food racist?"},{"comment_id":"10154394600380695","commenter_b":"Girl sit down... Really","commenter_a":"Why is this disgusting waste of human flesh still walking amongst us? Lock this rapist up already and throw thr key in the bottom of the Pacific","post_message":"BREAKING: The 78-year-old actor faces up to 10 years in prison if convicted."},{"comment_id":"1707816392795801","commenter_b":"Kim Kardashian is a fucking douche, she and her asshat husband need to go the fuck away.","commenter_a":"Pity the no talent wannabe Kim Kardashian. Her only claim to fame is exhibition. So sad.","post_message":"Bette Midler isn't going to like this."},{"comment_id":"1759075771038433","commenter_b":"@username...No evidence??? HOW ABOUT 4 DEAD AMERICANS.... HOW ABOUT ERASING YOUR EMAIL TO HIDE IT, WHEN ASKED...HOW ABOUT MISHANDLING TOP SECRET INTELLIGENCE... THAT'S ALL BEEN PROVEN. .. YOU CAN'T PICK AND CHOOSE....YOU CAN LEAD A HORSE TO WATER, THEN HOLD HIS DAMN HEAD UNDER, UNTIL IT QUITS KICKING...THAT'S WHAT IT TAKES, WITH PEOPLE LIKE YOU, IT SEEMS.","commenter_a":"So would we all. As a matter of fact, orange jump suits would look good on all Socialist-Democrats.","post_message":"“Hillary, I’m waiting for what you promised me. All I heard was you getting on TV, calling me a liar. That’s not true, Hillary. I am not the liar. You are the liar.”"},{"comment_id":"10153666245398984","commenter_b":"All this just so the Dems can have more illegals to for for them....Could Trump be more dead on?","commenter_a":"Thank Obama for all these murders, he is the one responsible for letting thdm in the country!!!","post_message":"This is a horribly tragic story, especially since it involves an illegal who should never have been in this country. Please join us in sending thoughts and prayers to the families of the victims.  Are you against amnesty for illegals?"},{"comment_id":"10152694344065736","commenter_b":"Stupid woman","commenter_a":"But, it's fine to hire a\" doctor\" to kill your baby. That's logical.","post_message":"An Indiana woman's self-abortion has thrust her into the debate over reproductive rights."},{"comment_id":"714422425388653","commenter_b":"Get out of this country!!! The USA was great until you damn Devils Muslims started to come here!!!","commenter_a":"I don't care. Take that shit off. What do you have to hide. You want to wear it , wear it at home.","post_message":"She filmed it.   WATCH the video very closely..."}]
