[{"comment_id":"10153794023656051","commenter_b":"If she had broken into my house, I would have gotten in bed with her and just laid there waiting for her to wake up.","commenter_a":"I'd shag her then call po po","post_message":"This wife came home early and found this woman in her bed. She immediately assumed her husband was having an affair. It was only after she ordered him to come home and confronted him about it that she finally discovered the truth."},{"comment_id":"1362983927059832","commenter_b":"Found the \"run the USA into the ground\" voter.","commenter_a":"In a close election, to falsely broadcast that a candidate \"faces indictment\" is an act of sedition, especially when they know their viewers are hungry to believe such a ridiculous lie and would eat it up. Absolute treachery!","post_message":"In fact, Baier said, after checking with his sources, there is no evidence at this time for either statement."},{"comment_id":"10155879050540354","commenter_b":"Stop these muslims from coming into our country. Please. Trojan horse.","commenter_a":"I can't wait to force them to bake my gay wedding cake.","post_message":"Some truly shocking statistics in this article..."},{"comment_id":"10154094410781051","commenter_b":"Again, there are more good cops than bad cops.","commenter_a":"Media is the reason we don't see or hear of these Good Deeds....stopped watching the news & buying the paper...All liberal bias crap & I'm sick of it!!❤️👮🏻❤️","post_message":"When these police officers learned that a local teen was walking two hours to work each day, they immediately stepped up to the plate and helped him out. Do you think America needs to hear more stories like this?"},{"comment_id":"10153189366828132","commenter_b":"Yes for real!!! That's hilarious.. but just a secret, I do it to. Except when they stare, I sing to them. And they sometimes laugh or look at me like","commenter_a":"I could so see Mervin doing Danielle!","post_message":"This police officer from Dover, Delaware, has some serious moves!"},{"comment_id":"906670476046247","commenter_b":"And you just said you are not for choice. You care less for the hungry And homeless. You want them killed. You want them to have no choice. Giving money to kill the child of someone who really wants to keep their child but can't because you gave money to have it murdered instead of giving money to her to help her with her choice to keep her child. Yeah. Pro abort!!!! Force abort!!!! Force te 11 year old against her will. Give money to murder mills to force a helpless woman have no other option because people like you pay to kill her child and not help support it.","commenter_a":"Stop Death Camps For The Unborn!!! Abortionists Are No Better Then Murderers!!!!!","post_message":""},{"comment_id":"1923069711254227","commenter_b":"so far 1.5 million people have liked my last comment PERIOD!!!","commenter_a":"My gawd it's an immigrant disrespecting the flag! Shouldn't O'Reilly and Hannity be all over this? Lqtm","post_message":"Oh, how they would SCREAM! Shared by Occupy Democrats, LIKE our page for more!"}]
