[{"comment_id":"10153097012535329","commenter_b":"Lauren Youssef","commenter_a":"Lily, Marielle we need this!","post_message":"BuzzFeed Life can confirm that these delightful Oreos are VERY REAL AND VERY GOOD."},{"comment_id":"10153129778526336","commenter_b":"Women can't do it. Its physically impossible unless the standards are lowered (this has been repeatedly proven in Marine infantry officer course) and lower standards WILL KILL PEOPLE IN COMBAT. People that want women in ground combat either have not the slightest idea what it is OR had a far different experience than most infantrymen of my generation had. There are no bathrooms in the field. There are no showers for weeks or months sometimes. But maybe its easier now. But I doubt SF or Seals are.","commenter_a":"Everybody should be held to the same physical standards to do the job. Man or woman. That's equality.","post_message":"Controversial new surveys about women serving in the special forces found that men in special ops fear women aren't up to the task."},{"comment_id":"10152606948662093","commenter_b":"Idiot get a life","commenter_a":"Huh! Happy to hear that they didn't get shot. Wonder if they were white. ......","post_message":"There are good people all around us.... Carrollton Police officers found a family of three sleeping in a car, and instead of being told to leave, they put them in a hotel and bought them necessities."},{"comment_id":"1800084686916109","commenter_b":"Since 1952 Muslims are here ILLEGALLY. They need to get the hell out.","commenter_a":"Dear Democrats and Liberals, I'm noticing that a lot of you aren't graciously accepting the fact that your candidate lost. In fact you seem to be posting even more hateful things about those of us who voted for Trump. Some of you are apparently \"triggered\". Because you are posting how \"sick\" you feel about the results. How did this happen you ask. You created \"us\" when you attacked our freedom of speech. You created \"us\" when you attacked our right to bear arms. You created \"us\" when you attacked our Christian beliefs. You created \"us\" when you constantly referred to us as racists. You created \"us\" when you constantly called us xenophobic. You created \"us\" when you told us to get on board or get out of the way. You created \"us\" when you forced us to buy health care and then financially penalized us for not participating. You created ...","post_message":"President-elect Donald J. Trump​, Melania Trump, Speaker Paul Ryan​ and VP-elect Mike Pence​ meet at Capitol Hill."},{"comment_id":"10152785056866051","commenter_b":"how dumb are these women","commenter_a":"WTH!","post_message":"This prisoner impregnated not one, not two, not three, but four prison guards."},{"comment_id":"10153814092279740","commenter_b":"Gear up and hit the streets or shut up these KEYBOARD WARRIORS Crack me up !","commenter_a":"Great Job by the Police....Suspect had ample opportunity to surrender peacefully and the KILL ZONE for an edged weapon is 21 FT..he was well within that zone and a threat to police, who are not required to retreat nor should they...","post_message":"Fla. police shot and killed a razor-wielding man suspected in a bank robbery early Saturday. Video captured the shooting:"},{"comment_id":"10152775597868299","commenter_b":"Who does she work for?","commenter_a":"How about you get a job darlin????","post_message":"Chelsea Asks for Clinton Foundation Cash ... @webpagelink"}]
