[{"comment_id":"1069162493180002","commenter_b":"Black LIES Matter!","commenter_a":"Life is what you make it....if you obey the laws and live a clean life none of this would happen....put the blame where it belongs.","post_message":"\"The idea that there are tensions between police and particularly black youth is something that kind of went without saying.\""},{"comment_id":"1253710404722011","commenter_b":"@username you nailed it","commenter_a":"Actually, it's bullying - in his case, you know he would be doing just the same to a male competitor. I believe sexism is a river that runs through him, but I see a ogre of a bully when I see him...","post_message":"TRUTH. Thanks to Hostile Politics."},{"comment_id":"991233837660061","commenter_b":"Fuck them, go back to the shit hole you crawled out of.","commenter_a":"If our culture offends u get out!","post_message":"First bacon, then bikinis, then beer and now sports fans should watch their ... wardrobe selection so not to offend The Religion Of Peace? @webpagelink"},{"comment_id":"1754494444782298","commenter_b":"If you have to ask what's wrong with him then you need to get a checkup from the neck up and have your ears cleaned out","commenter_a":"I sure hope he's getting 2 a.m. calls in the morning from people who hate his guts","post_message":"THEY DID IT: #Anonymous just released all of Donald J. Trump's personal information to the public..."},{"comment_id":"1090578067658503","commenter_b":"Then came Tuesday, \"decades day.\" Ibe dressed as a slave. The student said that, through his outfit, he had wanted to keep the dialogue about slavery going. He felt that at school the topic was sometimes covered up. \"I was like, OK, I need to make my voice heard and make sure these people did know that slavery did happen back in the day,\" he said in a phone interview Wednesday. Ibe's look didn't last long. He arrived Tuesday to the school in Missouri City about 30 minutes early, he said. When he walked through the main entrance and began down the hallway, he said an assistant principal pulled him into an office. They waited for the principal, who told him the outfit was inappropriate and that he needed to change, Ibe said. But taking off the outfit didn't mean he would drop the issue. At 9:29 a.m., Ibe asked ...","commenter_a":"Deplorable behavior!!! Trump has brought out the worst in people. God helps us.","post_message":"This is BEYOND deplorable..."},{"comment_id":"10153233810444087","commenter_b":"She is lying","commenter_a":"They didn't bring their girlfriends","post_message":"“I think there are lots of people who wanted there to be a race for different reasons and they thought the only way to make it a race is a full-scale, frontal assault on her. This email thing became the biggest story in the world.\" said President Bill Clinton about the controversy over Hillary Clinton's email."},{"comment_id":"1104255989636871","commenter_b":"#westoppedtrump #fucktrump","commenter_a":"You saved countless lives last night on the streets of Chicago, they stopped the gang banging for a few hours to come together in your honor...you've already made America great again.","post_message":"Good morning! Departing for Dayton, Ohio now! WE ARE GOING TO MAKE AMERICA GREAT AGAIN!"}]
