[{"comment_id":"820316618158915","commenter_b":"Kick his ass out of this country,","commenter_a":"Black price of shit","post_message":"Trump Hating Thugs Split On Flag… Look What Happens Next [VIDEO]. If he was a real man and doesn't like this country or our flag he should leave. Do you think he should deported?"},{"comment_id":"10152943147236680","commenter_b":"Nowadays we have male, female and family bathrooms!!! If you can't hold it in look for a tree!!!","commenter_a":"There's a term called friendly fire...","post_message":"The senior member of the Senate Armed Services Committee opposes the plan announced last week by the Pentagon to allow transgender troops to serve in the military, saying “it wouldn’t work.”"},{"comment_id":"10153337404314454","commenter_b":"Just be thankful that our atmosphere isn't filled with Volcanic ash from a bunch of volcanoes erupting.... We could go into a hundred year mini Ice Age.","commenter_a":"The earth will one day shake humans off like fleas off a dog. But how sad we couldn't have done better.","post_message":"Using data collected by NASA satellites, researchers have found that more than 1/3 of the world's largest aquifers are drying up faster than they being replenished."},{"comment_id":"1264248823618692","commenter_b":"@username Trump lost the entire west coast, not just California. But, for the sake of your argument, such as it is, yes, take away California...take away the most populous state in the Union, the state with its own fucking economy, the state that has to give more than it takes from Federal coffers in order to support the welfare red states who take more than they give to Federal coffers...disenfranchise those people...disenfranchise the many for the few. Lady, and I use the term very loosely with you, that's how tyranny starts.","commenter_a":"Trump and his little army, are the most corrupt bunch. Electoral College...do your patriotic duty, the duty Alexander Hamilton intended you to do when faced with a Demagogue who has ties to our enemies in foreign lands. UPDATE: I have thoroughly enjoyed the response of you moronic Trumpbots...more than I know. You have validated my assessment of you folks...an assessment that can be summed up in one sentence, \"Dumb as a bag of rocks.\" So while y'all keep going on about Liberals, Dems, 'Killary', the bogus line about Hillary selling uranium, blah..blah...blah, \"We won, you lost,\" etc., etc., etc., a few pointers: You might have some valid points about some Liberals...if only you would learn to use proper analysis techniques and then had the ability to form a proper sentence to explain said analysis; yes, Dems can be as bad as Repukes...both are corrupt, and both sides are hypocrites...as are ...","post_message":"So: Shep Smith just called out Donald Trump's lies about Russian election interference on Fox News. \"It was brought up before the election. Over and over and over again.\""},{"comment_id":"659276420929603","commenter_b":"I guess she could go back to Africa Ebola does that ring a bell","commenter_a":"Dam she's got lips like monkey boy.I bet she could suck the crome off a trailer hitch.","post_message":"This entitled woman just demanded a free drink... Because of slavery? This is absolutely ridiculous. We owe her nothing. Should she be compensated for slavery?"},{"comment_id":"10154180577936770","commenter_b":"no he isn't","commenter_a":"He is violating the constitution again. Smh.","post_message":"Liberals are accusing Donald Trump of implementing a \"Muslim ban\""},{"comment_id":"766553903477790","commenter_b":"Obama will call it workplace problems.","commenter_a":"It's not ISIS committing these violent crimes it's the guns, we have to start a war against guns!!!!!","post_message":"Oh my God.....BREAKING NEWS. Share it folks. We need you."}]
