[{"comment_id":"10153981739504091","commenter_b":"Go stick your head in a latrine!","commenter_a":"What did he know about the Clintons?","post_message":"RIP: The star of reality series Ice Road Truckers on HISTORY was killed in a plane crash while he was planning to film a show about recovering plane wrecks."},{"comment_id":"10153768028339614","commenter_b":"Lol Olivia you sound butthurt or does truth hurt as Ben Carson state all black lives matter not just criminals","commenter_a":"Where's the black lives matter people at? Or is only white on black that matters","post_message":"An anti-violence advocate is now paralyzed after being shot in the back during an attempted robbery, and the teenager arrested was supposed to attend one of his speeches on reducing juvenile crime rates. The Cal Poly Pomona student turned his life around after a criminal history beginning at the age of 12 and facing abuse in foster care. But while in Georgia to share his message of peace, Semaj Clark was shot. won be able to walk anymore, and that hurts me, but it not going to stop be from doing what I got to do, he said tearfully from his hospital bed in Georgia, where he continues to recover. Watch KTLA video here: @webpagelink"},{"comment_id":"585702171625401","commenter_b":"REAL MEN FOLLOW THROUGH WITH PROMISES MADE REGARDLESS OF WHO OBJECTS!!!","commenter_a":"Well fuck you too!","post_message":"Do you side with Garth Brooks? or DONALD TRUMP? Comment your answer below!"},{"comment_id":"1793905347490203","commenter_b":"Plus she is nasty and disgusting","commenter_a":"This young lady is very talented, but she has no clue what this country is all about. It happens when you grow up with the world revolving around you. She has no idea what she supports! Or Who!","post_message":"Miley Cyrus is begging people to vote for Hillary Clinton"},{"comment_id":"10153647988748145","commenter_b":"She should have hit their dumb a$$es with it. Now run tell that","commenter_a":"WTH?","post_message":"After 40 minutes of trying to convince the security team that removing the prosthetic wasn't necessary, the woman was led to a private room where she was asked to remove her pants and take off her leg."},{"comment_id":"10154440259724060","commenter_b":"Bitch i know everything","commenter_a":"@username stay humble","post_message":"Our quote of the day is from English poet Percy Bysshe Shelley"},{"comment_id":"10153649421859138","commenter_b":"Why would you post such a thing Dan??? Wtf?","commenter_a":"Meanwhile in Chicago this weekend, more people were gunned down by those whose lives matter. But let's not protest that.","post_message":"The Twin Cities Marathon went on today without major disruptions, and police did not make any arrests."}]
