[{"comment_id":"10153850610670575","commenter_b":"We will see...won't we? Vote Trump and Mexico will pay for the wall. All the others will not put up a wall. All the other candidates don't care about how many drugs are coming across the borders to ruin America and her children. Trump 2016.","commenter_a":"If he doesn't check his tone, he'll be out there with shovel in hand building the well.","post_message":"Maybe not you sir, but Mexico is paying for it!"},{"comment_id":"971388089566977","commenter_b":"Trump is a power hungry man.. Who only cares about being at the top Who could not relate to 99% of you if he tried.... Giving a man like that the power of presidency is like giving an eight-year-old a loaded shotgun","commenter_a":"We have to secure our borders and all the Visa programs , This country can't survive the way it is heading. #TRUMP2016 The man that can put this country back on the right track. #TRUMP2016","post_message":"Thank you to the great crowd at the #USSYorktown in Mt. Pleasant, South Carolina. Listen to the the response from the crowd to my latest proposal - and let me know if you agree with these PATRIOTS?"},{"comment_id":"10152660516532894","commenter_b":"After u,dumb bitch!","commenter_a":"Girl,run b4 they kill u! Run girl! Run!!!!!","post_message":"Look at God: 26-Year-Old Mother of 4 Quit McDonald's Job to Take Care of Her Disabled Son, Hits $561.4 Million Powerball Jackpot"},{"comment_id":"10155297083883132","commenter_b":"Kimberly, you're obviously not paying attention. That's exactly what's happening. Also, the acts of past presidents don't take away from how terrible this is. Everything is quicker now. It's on fb as soon as it happens and people are less lax then they were to speak their minds. Don't act as if no one cared before. That directed to all the \"people losing their minds\" comments.","commenter_a":"So Trump bans certain people from entering the country and people lose their minds? Obama murdered how many women and children in those same exact countries using bombs and no one bats an eye? Funny how that works.","post_message":" one warned me when I was leaving, no one cared what will happen to my dog or my job or my life there, she said. one told me what I should do with my car that is still parked at the airport parking. Or what to do with my house and all my belongings. They didn say it with words but with their actions, that my life doesn matter. Everything I worked for all these years doesn matter."},{"comment_id":"10154408526388352","commenter_b":"Boobs are for food NOT fun!!!","commenter_a":"Well that was mean","post_message":"'Step outside and button up': Judge blasts mother and kicks her out of courtroom for breastfeeding her eight-month-old son during custody hearing"},{"comment_id":"1701770233407796","commenter_b":"The Muslims should start their own food chain. They could have whatever Muslim food they wanted. Then Americans could be outraged that they don't have cheeseburgers.","commenter_a":"I agree with these companys","post_message":"There is no reason why they should have to change their business for them. Do you support these food chains?"},{"comment_id":"10152866488206336","commenter_b":"that IS child endangerment..someone needs to be locked up--along with the snake........","commenter_a":"Some are just nuts","post_message":"This video footage of a 14-month-old girl playing with the family pet might make you a little nervous."}]
