[{"comment_id":"10153239073114087","commenter_b":"Becky, you ignorant slut.","commenter_a":"Why is the fact shes a woman the issue? This kind of rhetoric just signals their hypocrisy, in one breath decrying sexism and then in the next taking advantage of it.","post_message":"\"I first would like to register my opposition and my objection to the chairman beating up on a woman, on our witness today, for making a good salary,\" Rep. Carolyn Maloney at today's Planned Parenthood hearing. \"The entire time I've been in Congress, I've never seen a witness beaten up and questioned about their salary. Ms. [Cecile Richards] heads a distinguished organization providing health care services to millions of Americans. I find it totally inappropriate and discriminatory.\""},{"comment_id":"1081904121885815","commenter_b":"I do believe I posted my suspicions about this yesterday, keep in mind that Hillary is also under scrutiny of her campaign funds and Clinton Foundation.","commenter_a":"What a loser.","post_message":"WHOA!"},{"comment_id":"939419102765615","commenter_b":"If I was to make a point it would be that there should be an easier path to citizenship. People are coming over our boarders. Like or not, they are here. We can do three things at this point. We can continue the way we are. We can make a path to citizenship easier and less likely they're going to be expelled if they try. Or we can get all crazy and build a Great Wall around our boarders. Illegal citizenship builds poverty. Poverty creates crime. We all know this. I must remind you that precious few of us are truly Native Americans.","commenter_a":"People just don't understand how much America depends on Immigrant labor. If they were all to go on strike we'd all be paying more for things we take for granted. If they're here and not hurting anything what's so wrong with letting them stay and contribute to \"The Great American Melting Pot\"? Maybe, Just Maybe, They can become more than they started out when they got here. Never hurts to give them a chance.","post_message":"What a huge mistake. Except it shouldn't be one. - Laura Willard"},{"comment_id":"10153514022490047","commenter_b":"Why couldn't they give birth control wouldn't that been cheaper going have to do better than that","commenter_a":"Except what little they give women for birth control. When I couldn't afford birth control, much less a birth, they were there to help.","post_message":"A senior Planned Parenthood abortionist was caught on camera detailing how they \"crush\" the baby and sell the organs.       Planned Parenthood must be stopped.  SIGN our petition to take action: @webpagelink"},{"comment_id":"10153074180200090","commenter_b":"she is evil and lies so much her nose is growing!","commenter_a":"Question? Why do Hiliary, Rosie and Michelle always have their mouth open when they never say anything.","post_message":"Take the survey if you know Hillary Clinton is trapped in a web of lies: @webpagelink"},{"comment_id":"10151085765109999","commenter_b":"@username, There is an \"illegal alien\" in the penthouse of Trump Tower. She came to this country without a visa but persisted in working illegally until she found a sugar daddy who would marry her out of convenience. ICE needs to go there and interrogate her to determine if her marriage is a sham marriage for legal status or not.","commenter_a":"Let's face it, Trump does not care about Jews or Israel. It is up to Israel to save itself and work on two states solution. It is the only option to maintain a viable democratic Jewish state.","post_message":"\"President Donald J. Trump may be the last man standing between Israel and a complete, self-inflicted disaster,\" Thomas Friedman writes in The New York Times Opinion Section."},{"comment_id":"10155176603990389","commenter_b":"Don't know of anyone who did. Won by fraud.","commenter_a":"I didn't vote for this useless President!!!","post_message":"ICYMI: Republicans cheered as President Barack Obama said “I have no more campaigns to run.” Obama, cracked a smile and responded: “I know because I won both of them.”"}]
