[{"comment_id":"749959158486192","commenter_b":"Lots of people spoke up and condemned him for the remarks you speak of. This time he just happened to use a word that always triggers outrage.","commenter_a":"Is it just me or are we seeing all these white women and men speaking up because Trump spoke about another white woman? they didn't care about the Latino beauty queen, or black women, gay women, heavy women and 'not a 10 women'....Why now?","post_message":"Looks like all the rats are jumping the Trump ship. --Andrew"},{"comment_id":"10152776407520047","commenter_b":"Good someone see him for what he is , wake up. Before its to late .","commenter_a":"Thank you ACLJ","post_message":"Today, a federal appeals court upheld a previous ruling against the Obama Administration's unconstitutional Executive overreach.  Impatient Presidents don't get to change the law. READ MORE."},{"comment_id":"10155018398498258","commenter_b":"Who cares She is not that important anyway","commenter_a":"When they go low , we go high","post_message":"Congresswoman Katherine Clark is breaking from tradition to protest Donald J. Trump by boycotting his inauguration."},{"comment_id":"1833117833414623","commenter_b":"Migrants coming in to work for the NHS?","commenter_a":"its only going to get worse with all the immigrants coming in","post_message":"Worst NHS week in 15 years"},{"comment_id":"10153115200467217","commenter_b":"He would embrace you but insist you stop sinning if his embrace is to continue . John 5:1-14..\"SIN NO MORE\"....","commenter_a":"Gemma Dunnell homophobes Homophobes everywhere","post_message":"\"I found a relationship with God... right around the same time I realised I was gay.\""},{"comment_id":"10153541764830779","commenter_b":"Lmao ugly her ugly ass","commenter_a":"Of course she feeling lemonade considering how many times Bill cheated lol @username","post_message":"Hillary Clinton visited 'The Ellen DeGeneres Show' for an interview that airs today, with the Democratic candidate discussing a variety of topics from potential vice president picks to her admiration for Beyoncés 'Lemonade.' Watch her play \"Who'd You Rather: VP Edition\" below, and see who she would choose as her running mate."},{"comment_id":"1296455407059683","commenter_b":"No they should be given sentences building the wall then deported for ever","commenter_a":"Agree","post_message":""}]
