[{"comment_id":"10156887460220093","commenter_b":"@username @webpagelink","commenter_a":"Trump is a die hard Liberal","post_message":", I lived in New York City and Manhattan all my life, okay? So, you know, my views are a little bit different than if I lived in Iowa, perhaps. -- Donald J. Trump"},{"comment_id":"10156612932690354","commenter_b":"Washed up schmuck","commenter_a":"The difficulties were not due to him being black.","post_message":"WATCH Geraldo Rivera blame, well, YOU for Obama's failed presidency!"},{"comment_id":"10152911718959342","commenter_b":"Start lining up Muslims and illegals until they leave!","commenter_a":"Amen and Amen!!!","post_message":"FIRING SQUADS MAKING A COMEBACK? Utah -- the only state in the past 40 years to carry out a death sentence by firing squad -- is poised to bring back the Old West-style executions if the state cannot track down drugs used in lethal injections."},{"comment_id":"10156121117545354","commenter_b":"Go after his sorry ass also","commenter_a":"Kerry is a fool. I respect Gowdy. Great research Elizabeth ...","post_message":"You need to see this..."},{"comment_id":"1052165474817204","commenter_b":"Problem with getting help for these people is that they have to realize they have a problem and want to get help. Otherwise, it's a moot point.","commenter_a":"Why take his photo down? This is the poster boy for the NRA. His photo along with the rest should be displayed everywhere guns and ammo are sold.","post_message":"Chris Harper, 26, had posted on a blog about the TV reporter and cameraman who were shot dead: \"Seems like the more people you kill, the more you're in the limelight.\""},{"comment_id":"826951857397870","commenter_b":"Don't listen to all the crap! Half of it has been proven a lie and who knows about the rest? What kind of woman has these accomplishments? Surely not the ones they're talking about! @webpagelink","commenter_a":"too much baggage for me","post_message":"You know what to do!  Thanks to Liberal And Proud Of It."},{"comment_id":"1096005223798926","commenter_b":"Here we go with the wall...","commenter_a":"Trump would have never left that Marine in Mexico like Obama did...","post_message":"Donald J. Trump and Mexican President Enrique Peña Nieto give statements after meeting in Mexico City."}]
