[{"comment_id":"1234377609916581","commenter_b":"Euuuuuw you wouldn't bitch!!!!!!","commenter_a":"Shieeet om det här hade hänt... :S xD @username","post_message":"Just going to grab a nice handful of san - WHAT IS HAPPENING."},{"comment_id":"10153210594174270","commenter_b":"Every female to attempt the Marine Corps Infantry Officer Course...failed. And that's a fact","commenter_a":"Come on you all should know that males have to make second attempts at ranger school sometimes. This is not a female only type thing. Please for your sake do at least a google search of something before acting like only females get the second attempt","post_message":""},{"comment_id":"10154402963106729","commenter_b":"and..... Beyonce needs to get the hell out of the United States of America!...","commenter_a":"Our police are just doing their job and taking out the trash.","post_message":"Everyone needs to see what he sent Obama...POWERFUL."},{"comment_id":"10153197747769094","commenter_b":"He doesn't shoot them for 30+ seconds.... You have to go out of your way to watch it.","commenter_a":"I made the mistake of watching the video from the shooter as he committed these awful murders. I wish I could take back watching that.","post_message":"Video of the fatal Virginia shootings shocked users of Twitter and Facebook when the “autoplay” function showed them what they didn’t want to see. @webpagelink"},{"comment_id":"10154325852416323","commenter_b":"The woman is a perpetually grinning dimwit. She'll probably become PM.","commenter_a":"Fucking moron","post_message":"\"At least 50% of her public statements sound as if they were said for a dare. 'Let’s banish pessimists.' 'Boris Johnson is a lovely man.' The rest sound like she’s assembling endtimes magnetic fridge poetry.\""},{"comment_id":"1803773783230243","commenter_b":"This woman is nuts.","commenter_a":"Too bad she failed to get the same treatment for Hillary Clinton.","post_message":"Dems are already talking Impeachment.  Check out this load of BS."},{"comment_id":"10153620766011337","commenter_b":"I would only wish there were black only sororities, but no, whites are free to join and pollute the heritage","commenter_a":"So I'm just asking. On campus at Grambling University pretty sure there are ALL BLACK sorority houses. Why no uproar over that ?;","post_message":"RACIALLY INSENSITIVE? This Alabama sorority video had to be deleted after a diversity backlash.  Watch it and judge for yourself..."}]
