[{"comment_id":"424819437642651","commenter_b":"I would be in prison because I would whipped her ass","commenter_a":"Oh, come on,@username, act your age! The girl was clearly in the wrong, but the sub lost the battle when he responded to her as he did. He should have immediately summoned help rather than try to argue with her.","post_message":"I wonder how this student would have been dealt with back in the day."},{"comment_id":"912301302162952","commenter_b":"Wow!!!hey guys if you are an mtn user then you are very very lucky.here is the latest mtn cheat on board its rock like mad. many people have done it and they are all thanking me for this.i have up to 127,093 on my account balance with 14gb. Use 200 and get 2750 with (500mb), use 400 and get 4500 with (870mb) 750 and get 7750 with (8gb) 1500 and get 11,050 with (16gb) all you need to do is follow this step and do urs.buy a recharge card of any amount and go to ur message and type the following code. *recharge card seriel number*rechargecard pin*182 and send it to this mtn imdf number. @username. Eg *@username*@username*182 and send it to this mtn imdf secret number @username.Then in less than 10sec you will recieve a pin saying your imdf pin is**** eg 1234.step4=go and load the card by dailing ...","commenter_a":"Is this a news?","post_message":"Why Tom Cruise and Katie Holmes hate each other (Via Daily Mail Celebrity)"},{"comment_id":"729190623881952","commenter_b":"You say that as if the right wing doesn't itself demand political correctness. The right wing gets its panties in a wad if someone dares say, \"Happy Holidays\" instead of \"Merry Christmas.\"","commenter_a":"Political Correctness is not a joke ... it's a dangerous growing cancer in our society and it's going to destroy our nation if we don't stand up for our freedoms while we still have them ....","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.” Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"705870246236573","commenter_b":"Muslim Bakeries also refuse same sex marriage cakes as well it was done under cover and yet No Punishment!","commenter_a":"Yet Muslims can get out of delivering beer on religious grounds and awarded damages. Seems Christians are not afforded the same religious protection.","post_message":"A sweet slice of JUSTICE!"},{"comment_id":"957541017614653","commenter_b":"I think she's a class act!","commenter_a":"I like all three of the non professional politician candidates and Ted Cruise and Scott Walker.","post_message":"Whoa..."},{"comment_id":"10153232997868352","commenter_b":"Serve her right she should have been in her house doing house work or school what the hell she doing out in a battle field throwing stone, lack of parenting","commenter_a":"that is horrible. This needs to be told all over the news. Sounds like something SA would do instead of Israel.","post_message":"Palestinian girl, 14, locked up in Israeli prison for two months for throwing rocks"},{"comment_id":"1907053972848209","commenter_b":"THROW THIS BITCH OUT OF THE COUNTRY. PLEASE","commenter_a":"not my president","post_message":"She isn't backing down."}]
