[{"comment_id":"10153531244887377","commenter_b":"If she wanted privacy then don't run hypocrite","commenter_a":"they nef to vote you also a has been","post_message":"Sen. Dianne Feinstein: Criticism against Hillary Clinton is taken out of context and she broke no laws."},{"comment_id":"1228480800579306","commenter_b":"also don't worry about the food, mods gave another interesting fact Eagles do not waste food they will eat it!","commenter_a":"Watching from Buckley Michigan","post_message":"SNUGGLE TIME: Fuzzy eaglet is snuggling as lunchtime approaches! VIDEO: Southwest Florida Eagle Cam"},{"comment_id":"10153814451294203","commenter_b":"Rebecca shut up","commenter_a":"Nicki Minaj's dad was a financial executive. She's not exactly on Lil Kim's level. Plus she attacks Taylor swift and Miley. These kids are 10 years+ younger than her. It's a little pathetic","post_message":"\"You in videos with black men, and you bringing out black women on your stages, but you don want to know how black women feel about something that so important?\""},{"comment_id":"10154438030826336","commenter_b":"Fat lesbians...","commenter_a":"Disgusting that Chick Fil HITLER would laugh about genocide.","post_message":"Celebrate #CowAppreciationDay at Chick-fil-A!"},{"comment_id":"10153351807966130","commenter_b":"*you're behind a foolish *woman","commenter_a":"GO GIRL. WE'RE BEHIND YOU!!'","post_message":"Ashley Burnham was the first Canadian and aboriginal contestant to win the Mrs. Universe contest."},{"comment_id":"10152847470758869","commenter_b":"that's pure BS... ok, Stewart is above the silly vampire stories here, but Binoche is one class above her throughout the film ... and in general","commenter_a":"I haven't seen the film, but I highly doubt that Binoche is nondescript: her screen 'presence' is astounding.","post_message":"“It is [Stewart], rather than Binoche, who lingers in your mind when the film is over.”"},{"comment_id":"1778494812377732","commenter_b":"@username, so your point will be valid according to the justifications of the San Bernardino and Paris Massacre victims and their families? How much more American people must die before you realize even 1 terrorist is unacceptable for the sacrifice of our lives just to be nice to foreigners?","commenter_a":"Does anyone remember FDR's ban on Japanese and Jimmy Carter's ban on Iranians? Oh, and they were both Democrats, but Trump is being compared to Hitler for suggesting we ban Muslims. Funny how that works.","post_message":"Skyscrapers. Music. Athletics. Comedy. The list goes on and on ... After Donald J. Trump's recent controversial remarks, here's a look at the United States without the influences of Muslims."}]
