[{"comment_id":"10153160382606491","commenter_b":"Lauren Kirby","commenter_a":"1577961212219543s","post_message":"\"Amy and I were creatively made for each other,\" Jennifer Lawrence said."},{"comment_id":"10154153338147908","commenter_b":"@username norway. now stfu","commenter_a":"Commie Bernie vs. Socialist Hillary= end of Freedom.","post_message":""},{"comment_id":"10154082148493797","commenter_b":"Who cares. If they are here illegally they need to be gone!","commenter_a":"Tell them to show how they got the money to open their busines....... See fox should search before they put these articles. They did not pay taxes on one penny also they were on welfare so hmmmm think it through collecting welfare and saved a lot of money to open a business . That is fraud.......","post_message":"THE AMERICAN DREAM: Donald Trump's plan to end birthright citizenship is drawing fire from Republican challengers. In particular, one successful family from Little Village that would be torn apart if Trump got his way. That couple owns Los Mangos, which has been open since 2012 and is growing."},{"comment_id":"962496207173455","commenter_b":"#trumpnation #teamtrump #trump #votetrump #riseup #crushpoliticalcorrectness #getourjobsback #deporttheillegals #stirupwashington #shakeupDC #BANMUSLIMS #rebelflag #no2NikkiHaleytheTraitor #merrychristmas #makeourmilitarygr8again #keepguitmoOpen","commenter_a":"Go F your self Cruz! Voting for TRUMP!","post_message":"\"The truth of the matter is if Donald Trump became president, nobody knows what the heck he would do. He doesn't know what the heck he would do,\" Ted Cruz said."},{"comment_id":"10153555150776680","commenter_b":"Hillary is not the nominee. Thanks to Selfish Bernie","commenter_a":"They're in a dead heat in virtually all polling that has come out this month. Sanders, on the other hand, consistently beats Trump by double digits. #SeeYouInPhilly","post_message":"Donald J. Trump holds a razor-thin lead over Hillary Clinton."},{"comment_id":"10154117149131491","commenter_b":"@username let me see your nudes.","commenter_a":"18 months is not enough, in my eyes what he did was a form of sexual assault","post_message":"It all comes after private photographs from celebrities like Jennifer Lawrence and Kate Upton were leaked online."},{"comment_id":"10158695661875206","commenter_b":"Check this out i mean Inc.org","commenter_a":"Humans have souls and can live etrnally and that is according to what is written in the holly scripture \"the bible.\" God forwarned us that earth will be burned during the secon d coming of jesus ... judgement day.. The bad ones will be burned and gids chosen people will be saved and have second life eternally","post_message":"If there really are multiple, interacting universes, then it would be possible for time travellers to visit Earth, and every imaginable scenario would be played out in a parallel universe at some point."}]
