[{"comment_id":"10153397291788984","commenter_b":"Couldn't agree more.","commenter_a":"Great message...lousy article.","post_message":"Famous actor Matthew McConaughey just spoke at a graduation, and he had a very blunt message for whiny college kids...  What he said is going viral... and it couldn't be any more perfect."},{"comment_id":"421520308036263","commenter_b":"What is this group that has an American flag on the ground to be trampled ?","commenter_a":"stupid ASS COPS.","post_message":"\"I went to pick it up because it doesn’t deserve to be on the ground.”"},{"comment_id":"10153572357110667","commenter_b":"Penny Henderson can you imagine all the hysterical women...","commenter_a":"There are no wrongs or rights in that situation.. But... I wish everyone had gone quiet and not screamed out, if everyone was silent I wonder would the animal have behaved differently.. Just a thought.. And if the animal was not scared by the screaming, perhaps a tranquilizer shot could have been used... Perhaps we need to have some strict guidelines for us humans visiting zoos,","post_message":"If a tranquilizer dart, which takes five minutes to 10 minutes to work, had riled Harambe, the child might have been killed. Imagine the uproar then.  More from USA TODAY Opinion:"},{"comment_id":"10154348215444609","commenter_b":"You only want your daughter to learn to suck dick?","commenter_a":"This is very wrong. If someone like same sex that's cool jus don't teach my child about it!!!!","post_message":"In case you missed it: Read about these newly approved changes in classroom instruction, put in place to comply with the nation's first law requiring public schools to include prominent gay people and LGBT rights milestones in history classes."},{"comment_id":"985543698152769","commenter_b":"This old lady sounds like she's craving for big nigga dick :)","commenter_a":"See ya bitch... Cracker ass Cracker!","post_message":"Like housemother like house sons."},{"comment_id":"635288009979398","commenter_b":"How silly. Some people will sign anything.","commenter_a":"idiot","post_message":"An online petition to remove all air conditioning from Department of State property has gotten more than 1,800 signatures since it was posted online Sunday."},{"comment_id":"10154905959166320","commenter_b":"Women hate liars...","commenter_a":"no they just hate the mean ones 😬","post_message":"What do you make of this? In an interview Madonna said, 'Women Betrayed Us' by Voting for Donald Trump.  Also she said that she has not had a good night's sleep since the election.  (Image: Fox News/AP)"}]
