[{"comment_id":"10154083377471433","commenter_b":"Good keep your foreign diseases in your own countries","commenter_a":"Oh you mean the country that out right said ....\"Death to America\"??? WHO CARES!!!!","post_message":"BREAKING NEWS: Iran suggests it will limit issuing visas to American tourists in retaliation for President Donald Trump's ban on refugees from Muslim-majority countries."},{"comment_id":"10153436202258855","commenter_b":"No a chick with a dick Courtney Danielle Banks","commenter_a":"That one ugly dude","post_message":"Go get 'em, Vanessa!"},{"comment_id":"1160749183945110","commenter_b":"Lol, the next president will be Hillary!","commenter_a":"One of candidate from these group will be the next president of United of America. The name of that candidate is ......................... ?","post_message":"Here's what some of the candidates have been up to."},{"comment_id":"10153127710904726","commenter_b":"This woman is as stupid as she is ugly!","commenter_a":"Brilliant question.","post_message":"WATCH: State Department is called out: Why Have Russian Hackers Seen More Emails Than American Public?"},{"comment_id":"10153441853036336","commenter_b":"A real lady doesn't hit a man. Haha.","commenter_a":"So how many times did he need to get hit by her before protecting himself?? She swung first...","post_message":"A Florida State Seminoles Football quarterback has been dismissed from the team after police released shocking video footage that shows the freshman punching a woman."},{"comment_id":"690501341083047","commenter_b":"We don't have to deport them all. 1. Enact extremely harsh prison sentences and fines for their employers. 2. Cut off all government entitlements to them, including drivers licenses. 3. Open service centers South of the border specializing in United States work permits for any company needing cheap foreign labor. Said employer would be responsible for all housing , food , transportation costs and hospitalization. The only way to get a job here would be to sign up in Mexico! Then wait just like the rest of the world has to. Enact those measures and most will self-deport! Those who don't are criminals and harshly dealt with! All anchor babies should be stripped of citizenship and also deported. Enough of these criminal aliens!","commenter_a":"What George Lopez said ain't much better than what Trump said! They are both wrong! This country was built by immigrants and most of them came here illegally including the white man! The only Americans are the native Americans everyone else is an immigrant! Native Americans didn't invite immigrants here! So don't fool yourselves! White man came here illegally! Massacred native Americans brought black slaves illegally and now have a problem with Mexicans! What a joke! Mexicans don't come here to take your jobs! They do the jobs that your too lazy to do and won't do them! White people go to these countries to get there labor and no one says nothing about that!","post_message":"Ummm ok?"},{"comment_id":"10154771311354312","commenter_b":"Suck it up buttercups, she lost, move on!","commenter_a":"Trump won so how is it that anyone can change that! that would be like all the Indian fans protesting the Cubs winning the world series and changing it to the Indians winning! he won just like any other president has won! I did not want Obama in for the second 4 years as a lot of people didn't but you did not see all of us out there doing what Clintons people are doing. If you ask me all of Clintons people are the problem here. If Trump does not do his job then impeach him! but give the guy a chance to MAKE AMERICA GREAT AGAIN!!","post_message":"People upset about Donald Trump's election floated an option that could deny him the White House."}]
