[{"comment_id":"606850699417060","commenter_b":"What a pussy","commenter_a":"Remember these Libatards,I never forget !","post_message":"List Of 31 Democrats Who Will Be Giving Netanyahu The Middle Finger, SKIPPING His Speech ⋆ UFP NEWS... @webpagelink"},{"comment_id":"449908955134145","commenter_b":"Can't answer the question, Joey?","commenter_a":"This is absolute overkill. I get we should police the police but come on. You're going out of your way to stop an officer from doing his job","post_message":"This baby faced cop looks fresh out of the academy and willing to follow any order he is given. Luckily this veteran government accountability activist planted some seeds in his mind about who he is actually working for and how liberty is a better solution.  Watch the epic schooling RANT: @webpagelink"},{"comment_id":"555840684604224","commenter_b":"Look how christianity views woman it's almost as bad","commenter_a":"What confuses me is why women would want to stay in this horrific religion that view women and children less than animal's. Mohammed is dead he isn't coming back !!!","post_message":"Spread this..."},{"comment_id":"1048025435218467","commenter_b":"Lol I really do it's weird, this morning I saw white gold but then it changed and has been black n blue since haha!!!","commenter_a":"I see black and blue","post_message":"And no, it's not magic."},{"comment_id":"10153877660438812","commenter_b":"Wow, you're just full of fear. They're just people that want to use the bathroom. Get over yourself. No one wants to look at you or your ugly daughter anyway","commenter_a":"This just in! All teenage boys are claiming to be trans to gain access to girls' locker rooms.","post_message":"The DOE says an Illinois school district is violating the rights of a trans student by denying her access to the girls' locker room."},{"comment_id":"10152698000912452","commenter_b":"I would still as long as she doesnt talk.","commenter_a":"Jessica acting like she ain't asking for attention lol girl you would be doing the same crap. Earn the beads Jessica","post_message":"UPDATE: The girl in the photo had been identified. She is 17 years old and does not attend college. Although she says her interaction with the group was consensual, she did not realize her photo was being taken. @webpagelink  Do you know her? Police in Florida are concerned this spring breaker, spotted in naked photos, may be in danger."},{"comment_id":"694571907348646","commenter_b":"Lmao!!! @username","commenter_a":"Josh Wilson Connor Bobthebuilder Bithell","post_message":"Chocolate lovers can't seem to get enough of this nose candy. #MicBrights"}]
