[{"comment_id":"10153375560764087","commenter_b":"'We should let all the Muslims in or they'll kill us.' -What Liberals actually believe","commenter_a":"Is rep McCaul suggesting that a large percentage of otherwise peaceful and law-abiding Muslims are ready to put that to one side and become violently active simply because someone like Trump says something outrageous? Why does McCaul place such low faith in the Muslim community? And if he is right then isn't he proving Trumps point?","post_message":"“Anytime somebody is making inflammatory statements about Muslims or whatever, they can take that and use it to their advantage for recruiting purposes,” House Homeland Security Committee chairman Rep. Michael McCaul. “They take things like this and they spin it, to inflame the Muslim world, to get more recruits to join the cause to fight in Syria.”"},{"comment_id":"10155065453241323","commenter_b":"You still refuse to answer the question.","commenter_a":"An admirable academic for sure . But; one line in the video had me chuckling 'And then population growth will stop'. Naive to think population growth will ever stop. Deluded dreamy lefty thinking.","post_message":"'Let me show you the world', said Swedish academic Hans Rosling, who has died aged 68.   Here he demonstrates the dynamics of population growth, child mortality and carbon dioxide emissions. The challenge for the world is to get everyone out of extreme poverty and get the richest people to use less fossil fuels, he said."},{"comment_id":"10155091022728734","commenter_b":"Look at these white American men!! Hahahah! Look at these savages","commenter_a":"Disgusting","post_message":"A 37-year-old man has been arrested after allegedly trying to pay a mother to have sex with her seven-year-old daughter."},{"comment_id":"10154092643775950","commenter_b":"FUCK OFF RACIST","commenter_a":"who cares, just get out","post_message":"What are Barack Obama's post-presidency plans? 'Take Michelle on vacation. Get some rest. Spend time with my girls and do some writing, do some thinking.' Watch more from his press conference in Peru: @webpagelink"},{"comment_id":"10153634086331130","commenter_b":"It's not the point! The point is that it was NOT any of her, or YOUR, for that matter, business what that girl should or should not wear in this FREE society!! Put on your Spanx, cover your own fat, & shut the hell up!","commenter_a":"Sorry but in order for the dress to have the smooth look she does need spanx. She getting upset when she know damn well she put on spanx under her dresses. Many women fat or skinny wear spanx it's part of a woman's closet.","post_message":"'I hope this is shared and gets back to you...'"},{"comment_id":"10153334360476051","commenter_b":"Put that mother fucker in jail","commenter_a":"Now now you did it now.","post_message":"Officials took one look at what this government employee was trading food stamps for and arrested him immediately."},{"comment_id":"1633936340229657","commenter_b":"TWISTY IS REAL","commenter_a":"'@username well this sounds like fun","post_message":"Residents in this neighborhood are saying creepy clowns are trying to lure children into the woods.  #MicBrights"}]
