[{"comment_id":"10154732148698961","commenter_b":"You recently proclaimed that you would rather see a move toward screening and the passage of more gun control. Are you serious? American citizens are being raped and murdered by illegal aliens streaming into our borders and you want them all to come on in, collect benefits paid for by American taxpayers, yet take away guns that can protect us from these illegals. You are a very disturbed person and even worse are those endorsing you and voting for you. It's a state turned upside down by liberal sycophants.","commenter_a":"Senator Murphy, how about a little get together down here in the New Haven area?","post_message":"A huge THANK YOU to everyone who came to the town hall tonight. For those who couldn't join, check out the full video here."},{"comment_id":"542951289163244","commenter_b":"That cunt, is one letter away from ruining my name!","commenter_a":"This whole thing just happens at the EXACT SAME TIME OBAMA ANNOUNCES ILLEGAL EXECUTIVE GUN CONTROL ORDERS! This was a set up to drum up support from the sheep for this gun control garbage that will circumvent or HIPPA privacy. I for one feel that the government shouldn't have access to anyones medical records to see if they are crazy by THEIR STANDARDS, which are pretty fucked in the first place... I do not trust the most narcissistic, psychotic, murderous people in our country to choose who gets to protect themselves and the rest of us. This whole thing is under the guise of mentally ill not being armed. People that have guns will now redusr to get treatment they may need for fewer of the government coming and taking their guns by force. anyone that has EVER had treatment will loose their guns by a man with a gun ...","post_message":"So much for taking on the tyrannical federal government, ehh?"},{"comment_id":"10153467245366770","commenter_b":"@username are you doing your homework?","commenter_a":"According to Roger Stone, 182919686769s Mens Fashion Editor and the only named \"source\" in the National Enquirer smear story about Ted Cruz cheating on his wife with five women. Ted Cruz doesn't have time for that crap, he's too busy pushing back the establishment.","post_message":"\"Despite the old guard and amateur pundits blaming Donald J. Trump and the majority of GOP voters who support him, much of the rift in the Republican Party has been caused by Texas Senator Ted Cruz conning nationalists into believing he is one of them.\""},{"comment_id":"10154840580075695","commenter_b":"Go Hillary!!!!!! Vote blue!!!!!!","commenter_a":"#voteblue","post_message":"People fainting, 3-5 hour waits in line and it's only day 1 of voting. Local elections officials say today was the biggest turnout they have ever seen for early voting in an election. @webpagelink"},{"comment_id":"10158282673955294","commenter_b":"Today????????","commenter_a":"Does this mean Chris Jericho, aka Y2J, has been signed to a lifetime contract with WWE? If not, they're stupid idiots!","post_message":"A group of scientists have moved the \"Doomsday Clock,\" a symbolic countdown to the end of the world, to two and a half minutes to midnight."},{"comment_id":"477818462421667","commenter_b":"Good for him, we support him 100%. If the Muslims can burn our Flag we can burn theirs.","commenter_a":"Burn it!!! And send it back to hell where it came from.","post_message":"VIDEO: College Students Burn ISIS Flag And Muslims Are Outraged. SHARE to support these students are taking a stand against those ISIS pigs!"},{"comment_id":"10152546378774071","commenter_b":"Same thing as Pie-o-logy?","commenter_a":"This has been around for years...finally blowing up I guess. Thank you Cosmo Kramer lol","post_message":"Pizza Studio hopes to expand to 100 locations by the end of 2015."}]
