[{"comment_id":"10154691937306509","commenter_b":"She's a big crock!","commenter_a":"Great job @username....this debate is @username attacking Bernie Sanders....your agenda is so obvious....I'm not sure why I bother to watch this.","post_message":"'Talk about the kinds of problems he had answering questions about even his core issue: breaking up the banks...'  Hillary Clinton criticizes Bernie Sanders' answers to questions from The New York Daily News.   Live updates from the #DemDebate: @webpagelink"},{"comment_id":"1102153109844436","commenter_b":"Women need sex","commenter_a":"She should be locked up! She's sick! And just to say a massive thankyou to this brave soldier for looking after us and our country x","post_message":"How can a wife be so heartless?"},{"comment_id":"1048332608520428","commenter_b":"Lmao Persian women though.. Gorgeous.","commenter_a":"You are free to choose between Arab uneducated fundamental extremists and moderate enlightened Persian Cats..","post_message":"Iranian Foreign Minister Mohammad Javad Zarif said on Wednesday a new U.S. law putting visa restrictions on Iranians and those who had visited Iran would, if implemented, breach a nuclear deal Tehran had struck with world powers earlier this year. Read more: @webpagelink"},{"comment_id":"1704858546467924","commenter_b":"Ha-Ha! She is starting to look like James Earl Jones. Too bad she's a dumbass.","commenter_a":"Black Mrs Potato Head. yikes.","post_message":"Whoopi Goldberg is just plain GROSS...   I hope this means the end of The View!"},{"comment_id":"1165649100139095","commenter_b":"All he's ever done is ramble on. His supporters are just too stupid to realize it.","commenter_a":"I'm still waiting for Obama to answer the 2nd part of his question, which was, 'Why won't you light up the White House in blue'? He just rambled on for about 5 minutes and completely dismissed the question.","post_message":"'I'm not happy.'"},{"comment_id":"10153580518686749","commenter_b":"'@username The narrative BARACK HUSSEIN OBAMA has been pursuing is based on twisted facts and a long standard hatred against liberty and against our Republic', which he calls it America. HILLARY CLINTON being in lockstep with him, and just like him, she also felt the need to go around the world and apologize for all the things we supposedly did in the past. Never mind of all the aid and the freedom many Democracies are enjoying because of us and the blood we shed for them. We helped them and still helping them not because we but because is our duty to all the Millions of American citizens who came from those places and all their loved ones who are still living there! So, instead of leading from behind, when will our Nation have a pious and righteous President, a Constantine, a Theodosius, a Justinian, who will not be afraid, ...","commenter_a":"You're the best president, I'm from England but thanks for everything you have done Obama, especially for the LGBTQ+ community.","post_message":"President Obama's final State of the Union is on January 12. Say you'll be watching—and join the conversation. @webpagelink"},{"comment_id":"639736896151349","commenter_b":"That's great and all but how do these women make money now?","commenter_a":"yeah and there'll be some bleeding heart liberal who'll be out fighting for robots rights and defending human trafficking because 'pedophelia is a disease!' and we 'shouldn't judge'.","post_message":"Experts believe that cyborg prostitution will help ‘clean up the industry’ by reducing sexually transmitted diseases and ending sex slavery."}]
