[{"comment_id":"985543698152769","commenter_b":"This old lady sounds like she's craving for big nigga dick :)","commenter_a":"See ya bitch... Cracker ass Cracker!","post_message":"Like housemother like house sons."},{"comment_id":"488461684677745","commenter_b":"There idiots ,this woman can handle a weapon and herself ,and shes beautiful to boot","commenter_a":"beside ,in front,behind shes good from any view, wish she was President ,one smart lady !","post_message":"Controversy erupts after this video of Palin surfaces. Sarah is in trouble. She needs our help. Do you stand behind Sarah Palin?"},{"comment_id":"1704753069786736","commenter_b":"THEY SHOULD BE TAKEN TO GITMO NEVER TO GET OUT!","commenter_a":"Need to be hung by the balls","post_message":"If you were in charge, would you have these deported back to where they came from? @webpagelink"},{"comment_id":"806970826068192","commenter_b":"shes a scum and should of been executed","commenter_a":"20 years later omg you mean this scum is not dead yet?","post_message":"\"I was a good mother and I loved my boys.\""},{"comment_id":"10153947256054369","commenter_b":"You don't know much about the Black Hills or surrounding areas, do ya there, Todd and friends.","commenter_a":"What the hell is there to do in South Dakota","post_message":"You work hard, here's where to retire well."},{"comment_id":"699812546852263","commenter_b":"Perhaps she's had enough of grabbing pussy","commenter_a":"As far as I'm concerned the whole family can go straight to hell.","post_message":"Donald Trump said his wife and youngest son would move \"very soon. After he’s finished with school.\""},{"comment_id":"1096108950465633","commenter_b":"Let em go and then build a wall around it so they stay gone","commenter_a":"I say let them go. Pull all the military bases and all the government jobs and everything that belongs to the United States of America, and that includes the dollar. Then round up all of the other Racists and Dumb Shits who blame all their trouble on Obama when it was Bush and the Republican majoritys falt and send them down to the new nation of Texas where they can be happy ever after. The United States will be better for it too.","post_message":"The majority of Texas Trump supporters say they'd rather secede from the U.S. than live under Hillary Clinton as president. Do you feel the same way?"}]
