[{"comment_id":"10154312691707577","commenter_b":"Only cowards suck on another cowards goat dick the system been broken since mr queer got in office the fact that our government already let the enemies in our country soon there will be more of this false flag shootings","commenter_a":"According to Breitart...the Orlando shooter worked as a security guard for a company, G4S who has a contract with Homeland Security to pick up illegal aliens at the border & transport them inland & just release them. No legal repurcussions nothing. Obama's policies are very sinister & treasonous. And why has nobody done anything?!","post_message":"The brother-in-law of nightclub jihadist Omar Mateen hates Donald Trump, works with refugees, and liked a video on YouTube that argued Islam isn’t violent, according to his social media profiles."},{"comment_id":"10153332153777377","commenter_b":"But yet Megyn cried otherwise. Such a Bimbo.","commenter_a":"BBB gave Trump an A on his Trump University, so Cruz needs to hit the unemployment line","post_message":"Ted Cruz hammered Donald Trump on Thursday, tweeting out what he called a 'Certificate of Deception' for Trump's now-defunct Trump University."},{"comment_id":"801468519888245","commenter_b":"The female judge is pathetic.","commenter_a":"Wow....","post_message":"The cop sexually violating her body is evil enough, and to see the judge's reaction is absolutely chilling. Watch now (WARNING: GRAPHIC): @webpagelink  -Via Filming Cops flashback files."},{"comment_id":"10153717076186680","commenter_b":"Hillary Clinton is unfit!","commenter_a":"Odummy you aren't fit to tie Trumps shoe laces sorry doesn't even begin to describe you.You are just a halfbreed SOB that got elected for your skin color nothing more.","post_message":"President Obama on Donald J. Trump : 'The Republican nominee is unfit to serve as president.'"},{"comment_id":"1258337087519652","commenter_b":"Found the domestic enemy of our Constitution. As a soldier, I vowed to defend against you.","commenter_a":"Time to disband the Supreme Court. Time to hold all these people who violate our Constitutional rights accountable.","post_message":"The U.S. Supreme Court Monday handed a legal victory to advocates of banning firearms commonly known as assault weapons."},{"comment_id":"10154487307161336","commenter_b":"Unfortunately, Hillary and company think they are above reproach. She is doing the 'granny good witch' routine for awhile and the cutesy lovers are falling for it. Did they honestly forget that Bill is a womanizer and she has ruined the lives of the women he was involved with? Barbra Streisand made a comment, 'We didn't elect the Pope' and that tone of morality has taken its toll,","commenter_a":"Amen to that!","post_message":"'If they can't control their own email maybe they shouldn't be controlling the state secrets of the United States.'  Today on 'FOX & Friends Weekend,' Mike Huckabee talked about how the hacking of Democrats calls into question national security. @webpagelink"},{"comment_id":"10153762341043869","commenter_b":"look in g good.","commenter_a":"legend cinemas click the here ..... do not insult before trying X-Men: Apocalypse Full Movie @webpagelink Rangoon 2016 @webpagelink All Ladies do it (1992) @webpagelink Monella @webpagelink captain-america-civil war @webpagelink The Jungle Book Full Movie @webpagelink Batman v Superman: Dawn of Justice Full Movie @webpagelink Barbershop: The Next Cut Full Movie @webpagelink London Has Fallen Full Movie @webpagelink zootopia Full Movie @webpagelink Central Intelligence Full Movie @webpagelink deadpool movie 2016 @webpagelink ride-along @webpagelink The legend of Tarzan @webpagelink fifty shades2016 @webpagelink","post_message":"Like most of his predecessors, Barack Obama used the bombing as a generic invocation of the nuclear age—past tense, passive voice, Alex Wellerstein writes."}]
