[{"comment_id":"10154174806427293","commenter_b":"Girl...you need some self respect letting yourself get played like that How much are you getting paid.You ARE getting paid right?","commenter_a":"Basically she saying HE'S CLUELESS","post_message":"Donald J. Trump's campaign manager was pushed today on \"Morning Joe\" to explain some of his recent comments."},{"comment_id":"10154113353450329","commenter_b":"@username the souls one makes me think of you lol","commenter_a":"Elyse Landolfi","post_message":"keep it simple"},{"comment_id":"855612107818751","commenter_b":"So then please elaborate what does happen once that sperm penetrates that egg-I'll wait.","commenter_a":"The egg, once fertilized, then has to implant to become life. Not sure conception counts, not without implantation. Otherwise, you're telling every woman who takes birth control pills she is a murderer.","post_message":"The evidence is clear: life begins at conception!"},{"comment_id":"1671785493043668","commenter_b":"Bitch..... Get a life. Stop using racism.","commenter_a":"Tactical shit is racist... says the man who uses \"Redneck\" over and over and over and then blankets all veterans as being PTSD, drunks, llamaphobes, ect. the ignorance level is... OVER 9000!","post_message":"What he says about Red White and Ben is priceless."},{"comment_id":"1027413480657895","commenter_b":"Cause he wanted to, yall white people ready to see a brother arrested","commenter_a":"He has already turn himself in people are so stupid","post_message":"UPDATE: The brother of the man identified as a person of interest in the downtown shooting tells NBC 5 his brother has nothing to do with the shooting - in fact he said his brother handed his gun over to officers when the shooting happened: @webpagelink"},{"comment_id":"10153962547876519","commenter_b":"@username Wrong. No Muslim structures where they killed real Americans. You have a lot of anger. Try whimpering in a corner.","commenter_a":"Oh shut the fuck up you unhinged idiots. By this standard, I had two health episodes yesterday. It's really scorching in this city right now.","post_message":"Clinton was observed \"fainting\" in a departure area..."},{"comment_id":"10153034761287235","commenter_b":"you learn to write, bitch...","commenter_a":"oh boo hoo it's fucking war get a life moron","post_message":"“My uncle killed by sniper in WW2. We were taught snipers were cowards. Will shoot u in the back. Snipers aren’t heroes. And invaders r worse.” -- Michael Moore"}]
