[{"comment_id":"1030946370280768","commenter_b":"She's full of pride, disloyalty and all together wicked.","commenter_a":"I don't think she knows how to be honest","post_message":"Hillary claims she's always tried to tell the truth to the American people - but I think many of them would beg to differ...  Do you think Hillary Clinton has been dishonest?"},{"comment_id":"992882130761178","commenter_b":"#__ #__ #StopYazidiGenocide #StandforYazidiWomen","commenter_a":"@username: .","post_message":"A behind-the-scenes look at a historic night. hrc.io/269ym4J"},{"comment_id":"980308098739718","commenter_b":"Who in the hell watches Cnn anyways. Tell that bitch to go to there country and try an speak her mind they will cut her head off. Hopefully.","commenter_a":"More Leftist Fuckers !","post_message":"Alisyn Camerota is the CNN hack who cross-examined me after the jihad attack on our Garland free speech event, as if it had been my fault that we were fired upon by Muslims. So it is no surprise that she is calling on Americans to be sharia-compliant."},{"comment_id":"1693302644277794","commenter_b":"Great news. She does anything to get publicity","commenter_a":"Good the left wing nut.How does this broad even have a job?","post_message":"Melissa Harris-Perry is refusing to host her show this Saturday due to weeks of pre-emptions that she says has left her \"silenced.\""},{"comment_id":"10154556355598690","commenter_b":"Some women just cant understand that others wish to cover up. Brainwashed since childhood to wear hardly anything.","commenter_a":"If the burkini is a symbol of Islamic extremism, then does that make the bikini a symbol of Western extremism or rather, Western subjugation of women? Surely freedom works both ways? Why should women be forced to show skin if they choose to cover up?","post_message":"Cannes Mayor David Lisnard called the full-body, head-covering swimsuit worn by some Muslim women \"the uniform of extremist Islamism\"."},{"comment_id":"10153229519907377","commenter_b":"sick of protesters .come to our country and complain ,get them back to the life they love","commenter_a":"Who let the trash in in the first place ?","post_message":"\"There is hatred against us that is unbelievable,\" Trump told the rally, according to CNN, after Hamid and several others were ejected."},{"comment_id":"10155314611590652","commenter_b":"hahaha! this is amazing","commenter_a":"@username apparently the jar of mayonnaise episode anticipated this.","post_message":"\"Life is best when it's a bit strange.\"  This weird new reality show has millions of people pretty much watching paint dry:"}]
