[{"comment_id":"1678080125806065","commenter_b":"THE ONLY GOOD FILTHY MUSLIM IS A DEAD ONE.........KILL ALL THE BARBARIC BASTARDS........KEEP THEM OUT OF THE UNITED STATES....THERE IS NO PLACE IN THE WESTERN WORLD FOR SUCH 3RD. WORLD SCUMBAG BASTARDS LIKE THEY ARE.......GOD BLESS HIM AND HER FAMILIES......ODUMMER IS TO BLAME FOR THE RAPES AND KILLINGS HIS BARBARIC BROTHERS ARE DOING.....HE HAS COMMENTED MURDER FROM LETTING THOSE BASTARDS INTO \"OUR\" COUNTRY.....ODUMMER IS TO BLAME FOR ALL THE RAPES AND KILLINGS THOSE MUSLIMS ARE DOING............HE SHOULD BE BROUGHT UP FOR TREASON AND MURDER JUST LIKE KILLARY.........","commenter_a":"Oh yeah, we need to b ring them all here with their religion of love!!!!When is our government going to wake up and smell the coffee????","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack  This is tragic. His died with honor, let's send our prayers for his family.  Can we get 100,000 'LIKES' for him and his family?"},{"comment_id":"1029734007098210","commenter_b":"Poor old bitch. Still eat up with dumbass","commenter_a":"Cannot wait! This should be fun. Trump has his problems but hillary is such a liar that I hope she turns pknk.","post_message":"Democratic presidential candidate Hillary Clinton took aim at Republican rivals saying she is looking forward to debating with them about the economy if she becomes the Democratic nominee."},{"comment_id":"861030830662191","commenter_b":"That's why we can't allow Muslims in","commenter_a":"Tragic.","post_message":"THE LATEST: At least 100 killed inside Paris concert hall"},{"comment_id":"487739541416626","commenter_b":"She is an Ass","commenter_a":"Ann is not afraid to speak out she is a very brave lady","post_message":"This brave woman just called Obama a primate on national television.  She made a huge stand against our president, let's show her our support.  Do you endorse her public defiance against Obama?"},{"comment_id":"10152793243512144","commenter_b":"They all want to save these illegals l, as long as someone esle does it. I say for every liberal who wants a say in this, place one illegal in thier home. That's immigration reform!","commenter_a":"'Overflowing sewage'.......yes liberals are","post_message":"\"Overflowing sewage\" will do that."},{"comment_id":"1020783114655014","commenter_b":"Hillary is a racist!!!","commenter_a":"always my president hillary clinton the best of live 100% help fanta t jolie kant","post_message":"Hillary Clinton holds a net favorability rating of 58 percent among Democrats -- an increase of nearly 10 points since October."},{"comment_id":"10153675997090779","commenter_b":"Dumb ass","commenter_a":"Good for him.","post_message":"Joe Walsh has revealed that, come November, he won't be casting his vote for Hillary Clinton or Donald J. Trump. Watch him explain why below."}]
