[{"comment_id":"10153943482835579","commenter_b":"Pregnant German girl burned alive by Turkish immigrants Two Turkish men burn 19 year old Germany girl alive in honor killing. conservative-headlines.com","commenter_a":"Nice one Obama, now they'll be hauling the \"skunk\" sludge through our country on trains and trucks. But it's easy to fool your numb skull followers isn't it.","post_message":"Pres. Obama kills Keystone XL pipeline, saying it's not in U.S. interests. Your comments? @webpagelink"},{"comment_id":"10153283210126770","commenter_b":"Stupid people","commenter_a":"Go back to sleep.","post_message":"MSNBC host Melissa Harris-Perry criticizes the Democratic presidential field for being anemic, old, and “whiter than the Oscars.” Read more: @webpagelink"},{"comment_id":"1022130381169318","commenter_b":"CUMMING are stupid brats !","commenter_a":"OMG what a crock","post_message":"Come on..."},{"comment_id":"10153722562581800","commenter_b":"Gosh, I hope you are not able to reproduce. Idiot!!!","commenter_a":"I think no one bars militant Christians from the country, or seeks to deport them, just because Christians are responsible for most acts of violence and terror in this nation.","post_message":"Mike Huckabee went on an alliteration spree on cable news recently, saying the following about the response to the Paris attacks: \"[Democrats are] more interested in protecting the image of Islam than they are in protecting Americans...If these were Militant Methodists, Extreme Episcopalians, Bad Boy Baptists, do you think we would be afraid to say that?\" \"No we would not be afraid to say that. Because Bad Boy Baptists is an awful name for a terrorist group, but a GREAT name for your Christian Soul Rock, one man, bass-only album.\" - Trevor Noah ►Watch now: @webpagelink"},{"comment_id":"10153213531701336","commenter_b":"I will bet she cannot fix anything, maybe breakfast if she knew how to turn the stove on.","commenter_a":"Sounds like she's twisted","post_message":"Moments ago, Baltimore Mayor Stephanie Rawlings-Blake defended her decision-making to critics and vowed there will be justice for Freddie Gray."},{"comment_id":"10153500482753598","commenter_b":"nothing that comes out of this woman's mouth is ever true!!!!!","commenter_a":"She is an idiot..","post_message":"Hillary Clinton Claims “All of Us Want to Fund Planned Parenthood”"},{"comment_id":"10156146620705354","commenter_b":"Europe","commenter_a":"It's probably too late for Europe. It's not too late for the USA, but economically and socially we are following Europe's example.","post_message":"\"Islam Will Be the Death of Europe\""}]
