[{"comment_id":"10154554439281602","commenter_b":"@username you must be a very lonely man","commenter_a":"The metal scrap yard is located on the same street as the historic Colt Factory. To pretend they had no knowledge of it's origin is BS. They should be fined and held accountable. I lived across the street from this monument for two years and while the area does have its issues, there is no reason to bash Hartford. There is a multitude of beautiful and historical architecture to see in that area if you are willing to get out of your car. Many state and local residents have worked long and hard to have the Colt area designated as a National Park. This is a slap in the face to a city that is trying to restore some remnants of it's former glory. Take the tour - learn a little history and have an appreciation for some of the treasures in our own back yard.","post_message":"\"When I first saw it, it almost made you want to cry.\""},{"comment_id":"934633189910873","commenter_b":"Ah, Danielle, so you had the choice because of feminists who paved the way for you to do so.","commenter_a":"It user to be Matt but anymore it's just crazy man hating women destroying family dynamics in this country. I believe in equality, rights and fair treatment of all. Men, women, and all races, but I'm not a feminist. I support my family the best way I can now which is to stay home and take care of them. My children are smarter and safer with me here, plus they have a structured living environment. I plan on getting a p/t job when they both start full time school but as for now this is where I'm needed. And I love every minute of it even the hard days.","post_message":"Ellen Page has a point here, ya know... Thanks for the photo, MTV Act!"},{"comment_id":"1667182103568902","commenter_b":"Obama doesn't like this country or anyone who isn't Muslim. Everything he has done has been to weaken this country. He has opened our doors to terrorists, communists, illegals and Ebola. He has no respect for our military at all. It doesn't take a genius to figure out what he's doing.","commenter_a":"Love Sheriff Clark.","post_message":"Barack Obama is a USELESS president. I am counting down the days till he's gone!"},{"comment_id":"10153013352396336","commenter_b":"Once again, an illegal alien!","commenter_a":"sounds like sabo tage to me. maybe even terroristic.","post_message":"\"A brush of death definitely came over me.\" – passenger Joel Bingham As more details emerge in a California train derailment that left dozens injured, investigators say the truck involved was not stuck on the tracks."},{"comment_id":"1013838895312830","commenter_b":"That's what girls get, cause they want to grow up fast n experience sex.... Don't blame the man... They r just man... Like a dog give him a bone n he would eat it no matter what...","commenter_a":"Sadly this happens a lot. My neighbors daughter was 14 with a 22 year old. Her parents knew. Let her go to the beach with him, let him stay the night ect.. then they broke up and he broke her heart. The parents put him jail. He now has to register as a sex offender for life. : (","post_message":"FUGITIVE WANTED: The Dickinson Police Department is looking for a 24-year-old man accused of sexually assaulting a 14-year-old. Authorities say they have been unable to locate Joshua Dwight Blair at his residence or last known place of employment. If you know any information about his whereabouts, you are asked to call police or Crime Stoppers. MORE ---> @webpagelink"},{"comment_id":"930922740261239","commenter_b":"This will be great and a good female leader not like the arrogant bitchthat we have in BC.","commenter_a":"Albertans are the dummies of politics, what happened the last time a female was in power in that province","post_message":"A ray of hope for Alberta's NDP MPs? via The Huffington Post Alberta"},{"comment_id":"10155210015483132","commenter_b":"What about him he deserves a good women she's nasty","commenter_a":"Good for her! She deserves a good guy","post_message":"Things are heating up between Valentin Chmerkovskiy and Amber Rose!"}]
