[{"comment_id":"526657100877562","commenter_b":"@username that's why I'm voting Jill Stein.","commenter_a":"I'd rather vote for the one who may have evaded taxes than the one who led the charge on foreign policies that killed millions of people and now possibly could cause WW3 by taunting Russia with the no-fly zone in Syria. But I digress...Jill Stein is who I'm voting for because I don't vote for monsters.","post_message":"So, Trump goes around and says, \"Hey, I'm worth billions, I'm a successful businessman, but I don't pay any taxes. But, you, you make 15 bucks an hour, you pay the taxes, not me.\" That's why people are angry and want real change in this country."},{"comment_id":"1393293527430364","commenter_b":"Run us over girl. I'd love to have universal healthcare and lose this moron in command.","commenter_a":"All of this it's so true I've said this exact thing to you @username being Canadian fucking rocks 🇨🇦🇨🇦🇨🇦 y'all could learn a bunch from us if you could see past the orange dildo standing in front of you guys.","post_message":""},{"comment_id":"10153099824304753","commenter_b":"This bitch should burn in hell and die of slow painful death","commenter_a":"Look at this demon shaking my damn head","post_message":"She murdered two of her children, one of them in front of her 8-year-old son. At today's custody hearing, she wanted the whole world to know it and was kicked out of the courtroom. What do you think should happen to this woman? @webpagelink"},{"comment_id":"873492039433845","commenter_b":"make all the illegals-legal so thats 10 million persons paying taxes. we could sell the republicans to the dog eating festival. thats say 100 dollars.","commenter_a":"cool give them texas. that would be hilarious!!!!!!","post_message":""},{"comment_id":"10153457248972464","commenter_b":"0NE VOTO OVER 2/3 DO OK DEAL (WE THE POEPLE DO) WILL KICK YOU OUT IF YOU VOTO FOR IT NO RETIREMENT PUT YOU IN obamacare !!!!! TRUMP 12016","commenter_a":"Ted, this is one thing that you are exactly correct on !","post_message":"The #IranDeal is a catastrophic mistake. Help stop it: @webpagelink"},{"comment_id":"10153127976631162","commenter_b":"You sound ignorant you stupid old lady","commenter_a":"A 3, 2, year old and she is 8 months pg. give her birth control.","post_message":"TODDLER SHOOTS PARENTS: A 3-year-old boy shot his dad and his 8-months-pregnant mom when he found a loaded handgun in her purse while looking for an iPod. READ MORE: @webpagelink"},{"comment_id":"10153476529996756","commenter_b":"I think they assume they can just take take take, and someone will eventually design a self sustaining space station and then they'll buy it.","commenter_a":"I don't understand why the Masters of the Planet want to destroy the planet.","post_message":"A provision in the TPP allows corporations to sue governments for limiting their ability to compete in a market, which critics say could undercut food labeling policies that promote healthier food choices and make it more difficult to battle rising obesity rates."}]
