[{"comment_id":"1177607535665632","commenter_b":"That is sickening! Who are these wild, viscious, beasts that we allow to walk our streets with a loaded weapon \"in the name of the LAW\"? They are just low life sub 60 IQ, sociopaths. They are over paid and forget who signs thier paychecks. Wake up Americans!","commenter_a":"That poor soul...you can see his body struggling to stay alive. I sure hope these fuckin cops don't get away with this...disgusting!","post_message":"There was no reason to kill him."},{"comment_id":"444744122316849","commenter_b":"YES IMPEACH Obama and his Administration","commenter_a":"The state of affairs in America is so sad. All about obama.","post_message":"Did President Obama do this on purpose or could it have been by accident?"},{"comment_id":"1125221904203952","commenter_b":"Wow...you can't judge an entire religion by the actions of a few?!!! wow...where have we heard that before? yet...it goes ignored, until that line of thinking works for the christian cult members....then its supposed to be real........nice one cindy! this is just more proof that there is no such thing as \"GOD\"....or if one is up there, he is a mean spirited, vindictive SOB and i want nothing to do with him","commenter_a":"I hope all these co called Christians that praise what has happen have something awful happen to them Human beings were killed it does not matter who or what they were. You poeple should be ashamed","post_message":"This is not how decent people react to tragedy."},{"comment_id":"1758000121104260","commenter_b":"It doesn't take a week to get your citizenship, however there is help to those who can't afford the fees.","commenter_a":"What is wrong w ppl this country is about FREEDOM I don't agree w trump but that doesn't mean I will hurt or disrespect anyone that does..","post_message":"WATCH: Trump rally riots - supporters attacked by a mob of protesters at a rally in California."},{"comment_id":"10153145592901336","commenter_b":"I bet if not for her panties her guts would fall out","commenter_a":"Hope they send all the men back.","post_message":"Liana Barrientos, 39, who took six trips down the aisle in 2002 alone, will now be walking into court to face felony charges."},{"comment_id":"1270088773057875","commenter_b":"@username cocain bottles and bitches *","commenter_a":"Let me get a 300$ tip in Christmas I'll spend that shit on cocaine and bitches","post_message":"Faith in humanity restored!  #WSHH"},{"comment_id":"10153188400962894","commenter_b":"@username pediatricians have long ago said this is unsafe for children. Their immune systems cannot fight off adult germs. I am sure you want to keep your niece safe, right?","commenter_a":"North West is really cute. Kim should probably stopped letting Khloe kiss her baby in the mouth tho","post_message":"Kim Kardashian Shares Adorable New Photo Of North West With Her Curly Hair"}]
