[{"comment_id":"10152747594996051","commenter_b":"@username smart lady","commenter_a":"All this complaining about someone suggesting that one be responsible when getting our tax money. This is crap something needs to be done but then again the bleeding heart unimformed idiots will start crying. Look around and show me the starving people just look at the size u don't get that size while starving.","post_message":"People getting food stamps in this state need to get ready for some big changes."},{"comment_id":"10153836803272623","commenter_b":"Good players But it's another\"L\"","commenter_a":"Ga...NO ....Riverboat must have sank and Cam Ain't ..... stupid Panther Fans","post_message":"The New Orleans Saints beat the Carolina Panthers in a 41-38 victory Sunday in New Orleans."},{"comment_id":"1800961159929656","commenter_b":"This is not the true Ekklesia of Christ! I keep saying it, the true Ekklesia of Christ will have to return to the home, where it never should've come out from!","commenter_a":"You can't call this a Christian church if it goes totally against Gods word and if all that is allowed it is totally wrong to change the bible to fit your agenda. The bible says beware of wolves in sheep clothing it also says we are in this world but not of it. We true Christians are to be aware of these wolves and Not join in the sin with them but we are to pray that God will remove the scales from there eyes and pierce there heart so they can see and repent of what is so wrong that they think is right.may God have mercy on these people","post_message":""},{"comment_id":"10153816352544726","commenter_b":"This dumb bitch deserved it!!!","commenter_a":"I'm sure it was a hate crime right?","post_message":"WATCH: Trooper Orders Woman To Leave Florida DMV, But She Refuses...Then Goes Nuts!"},{"comment_id":"10155973415020354","commenter_b":"Shame on you Fox. Personal feelings are so beyond this forum. You putzes might as well learn how to say, \"large sized or regular?\"","commenter_a":"I'm for Ted all the way, but if Fox wanted to hurt trump it was a mistake,","post_message":"Trumpnado!"},{"comment_id":"10155930528244657","commenter_b":"Little brat!","commenter_a":"Disgusting beyond words!","post_message":"Even kids are joining in on the protesting."},{"comment_id":"991442284225448","commenter_b":"Matthew Acheron","commenter_a":"Daniel Kulick","post_message":"Nintendo introduces Linkle, a female version of The Legend of Zelda's Link."}]
