[{"comment_id":"10153727550292300","commenter_b":"Go naked girl! Again and again!","commenter_a":"South beach is super ghetto now.","post_message":"In video taken by witnesses and posted on a website where it went viral, Angelic Valle is completely naked when she “placed a steel chair leg into her buttocks,” according to the police report."},{"comment_id":"604189559765558","commenter_b":"Hang the fat pig","commenter_a":"Does anybody really think the Demarcate run US justice system is going to Prosecute, NO","post_message":"One can only hope that this ultra left wing hate monger will meet up with some justice soon."},{"comment_id":"10153740264340667","commenter_b":"This woman is unethical and unprofessional and immoral @webpagelink","commenter_a":"It's not just him who sees it. Many people see how biased and one-sided the media is. Very unprofessional. No shame left. I'm not against anyone here. I simply criticize the corrupt system.","post_message":"Not the first time it's happened this election cycle."},{"comment_id":"10155207761586509","commenter_b":"We don't do that to white people Bill....","commenter_a":"Just imagine if it was the other way around. They would have been met by heavily armed border guards pointing automatic weapons at them. They would have been put in handcuffs and leg irons and paraded before a judge and then be jailed for a ridiculous amount of time.","post_message":"Oops. 1,500 Americans accidentally floated over to Canada. @webpagelink"},{"comment_id":"10153980476181336","commenter_b":"She's a United States Soldier . How dare they ? Iran will soon remember what respect is .","commenter_a":"When you are in a foreign country, you follow the laws, customs, and rules of that country. The female sailor is covering her head because that is what women do in Iran.","post_message":"Megyn Kelly: “What is our female sailor doing with a headscarf on?\"  Newt Gingrich: “She’s being imposed upon by a dictatorship that is deliberately humiliating her and deliberately imposing their value system.”"},{"comment_id":"10153228975447452","commenter_b":"*facepalm* ... She is an idiot. She should have respected their religion.","commenter_a":"Charge the lady for assault","post_message":"Attacked as they prayed?  A group of Muslim men say a worshiper was hit in the face and doused with coffee in a confrontation with an irate woman in a NorCal park. abc7.la/1Qgwbam  “You are very deceived by Satan,” the woman yells as the wild scene is caught on camera. Should she face criminal charges? Why she’s not backing down, in her own words."},{"comment_id":"1234562866583168","commenter_b":"Hillary can sell pieces of our country, lie to investigators, channel campaign money, donations and contributions to her \"charity organization\" into her own personal slush fund, and she uses one technique to keep her out of the limelight for very long........she deflects whatever she does to whomever challenges her. Harry Reid is a complete idiot. Obama's constant comments of ridiculing Trump is the same technique. How dare that piece of trash accuse Trump of not being American!!! He is lawless, devious, lying, aids the enemies to be able to be in a position to kill us, takes money and feeds people who are illegal, criminals and he DARES to call Trump Un-American??!! He is seriously sick in the head...he THINKS he is the ideal American. Why do we still have a nut in the oval office? Shame on anyone who listens to this crap....and I can't wait to have both ...","commenter_a":"Just shut up, sounds like squeaky mice got caught, just go away quietly no one will miss you...","post_message":"HEAVEN HELP US  @webpagelink"}]
