[{"comment_id":"10153879601166545","commenter_b":"Thugs.","commenter_a":"Sometimes it's the company you keep, parents need to know who their kids are hanging out with...and for the people with the insults etc it could be very well your child, then you would think differently, and you will still be help accountable for your ill words against another.","post_message":"Arrest warrants have been issued for three more teens believed to be connected to the Aug. 2 robbery."},{"comment_id":"908658009268823","commenter_b":"@username still smarter than that orangutan! That orange menace!","commenter_a":"Hillary Clinton is a walking oxymoron... Innocent yet Guilty!","post_message":"Hillary Clinton rips into Donald J. Trump for his critique of retired four-star Gen. John Allen, saying it's unpresidential to \"insult and deride our generals.\" @webpagelink"},{"comment_id":"10153264748117690","commenter_b":"I Hope she gets fired! She obviously can't do her job.","commenter_a":"Why does she still have a job? Bottom line she should of been fired end of story.","post_message":"A Kentucky courthouse clerk who refuses to issue same-sex marriage licenses is scheduled to appear before a federal judge Thursday. @webpagelink"},{"comment_id":"729509567174081","commenter_b":"Oh shit here comes Ronda, there going to kick our ass for sure now she here. Lol","commenter_a":"Better hope she doesn't bring her losses with her","post_message":"The UFC fighter made a trip to North Dakota and donated fruits, vegetables, bread, tents and wood-burning stoves to “water protectors” who are protesting the Dakota Access Pipeline."},{"comment_id":"10156397990805354","commenter_b":"Maybe one testical...he is a RINO.","commenter_a":"At least he has balls to stand up to Obama","post_message":"Which do you want: a \"pause\" or an \"immediate halt\"?"},{"comment_id":"10154363261003816","commenter_b":"Pack your bags libs, because the wall is going up.","commenter_a":"If you're to dumb to get an ID you don't deserve to vote","post_message":"In testimony and filings in the case, the plaintiffs said that blacks and Latinos make up 44% of those seeking a free ID to ensure they can vote but only 9% of the overall voting age population in Wisconsin."},{"comment_id":"10153380129759087","commenter_b":"The countries that ban him should take the refugees. If they want to stand up for them so bad, take them. Oh ya, Dubai won't take any refugees. They are just hypocrites.","commenter_a":"Another great endorsement to vote for Donald Trump. Way to go Dobye.","post_message":"Donald Trump's name has been removed from a multi-billion-dollar luxury golf course project in Dubai in the wake of public outcry over the GOP presidential candidate's proposal to ban Muslims from entering the US."}]
