[{"comment_id":"1848439335433149","commenter_b":"Keen 😜","commenter_a":"@username @username Mari Funfax","post_message":"Put us on the next plane to Dubai."},{"comment_id":"1098378433550493","commenter_b":"Gore's win was not robust enough and Bush et al weaseled their way into the White House and blew up the Middle East nearly blew up Roe V Wade - even if you have to hold your nose it will be worse if Hillary loses - people will die, the environment will be further destroyed, social security will be looted. Please reconsider. Fight for a third party after the election or begin now but please don't let Trump win - the pleasure of the spite will not be worth it. Just look at the destruction, devastation, the inhumanity, wreckage of Bush presidency. If Hillary is defeated because of the spite of Bernie people it will be a Pyrrhic victory certainly.","commenter_a":"Bernie, I will follow you anywhere... but I won't be able to vote for HER. I don't begrudge you supporting her... I'm sure there was a lot of pressure to do so as well as strategic reasons. I CAN get behind down ballot progressives though! Love you, Bernie!","post_message":""},{"comment_id":"761832037248738","commenter_b":"The Dell was your first mistake buy a Mac or a HP","commenter_a":"Bubba killed the jukebox last night...","post_message":"\"Man Kills His Computer.\""},{"comment_id":"10155790474957316","commenter_b":"*she's a woman","commenter_a":"Um...He's a guy so....","post_message":"Manning had been a candidate for gender-reassignment surgery, which would have been paid for under the Pentagon’s new policy for transgender troops. But the terms of the 35-year sentence the court-martial imposed includes a “dishonorable discharge,” which the commutation did not affect, Army spokeswoman Cynthia Smith said Wednesday."},{"comment_id":"10153450529443352","commenter_b":"Livid??????? I would shut that MF down. ...Bastards","commenter_a":"Omg some one is responsible for this ok.who","post_message":"Mom Livid When Her 3-Month-Old Baby Girl Has Bruises on Her Face After Daycare"},{"comment_id":"1326722587387039","commenter_b":"Lock her up!","commenter_a":"These people man!","post_message":"Guess what her alias is..."},{"comment_id":"1693802114227741","commenter_b":"The towers that Donald Trump built ... Border Patrol endorses you to build that wall too, Mr. Trump ... A BUILDER ... not a destroyer ... of American liberties/freedom FOR POTUS!!! @webpagelink @webpagelink #DONALDTRUMP #POTUS #REPUBLICANPARTY #GOP #2016ELECTION #BORDERWALL #BORDERPATROL #TRUMPTOWERS #PRESIDENTIALPRIMARIES #VOTETRUMP #TRUMPTRAIN #MAKEAMERICAGREATAGAIN","commenter_a":"We have said that for years,They dont need us to protect them anymore.If they do,they pay for it.","post_message":"Changing times call for changing perspectives. I am proud to have started this conversation."}]
