[{"comment_id":"1204140369633795","commenter_b":"Did Queen Elizabeth die and they forgot to tell us about it? Holy hell had busted out all over England and some muslim dude is acting like the king! What's up England?","commenter_a":"Dear God, what will happen next? Aren't things crazy enough?","post_message":"Yes, this is real..."},{"comment_id":"10154993367323245","commenter_b":"legal immigrants OK ILLEGAL immigrants NOT OK any Qs","commenter_a":"Not an easy job.....People need to stop attacking every thing he says and does.","post_message":"LIVE: Trump press conference"},{"comment_id":"1152891968103883","commenter_b":"She is very cute and beautiful little baby but don't present her like,\" world's most beautiful girl\". You are ruining her childhood, i guess it's already been ruined but better late than never. Let her live her normal life please. I could see her turn into justin bieber like child in the future. He was no doubt blessed child but what media attention has done to him?? Spoliled him forever. One thing more how can you claim WORLD'S most beautiful child? World means 200 countries and over 7 billion human beings! Have you seen all of them?","commenter_a":"Not being funny but kids are cute not beautiful..that really sounds wrong unless it's you perents saying it.","post_message":"The controversial ten-year-old has been dubbed 'the most beautiful girl in the world'"},{"comment_id":"963715427023908","commenter_b":"Thugs is a nice word for these fools...","commenter_a":"Disgusting!!","post_message":"SAVAGE THUGS DIG UP CONFEDERATE SOLDIER: Group Fed Up With Waiting Begin Digging Up Confederate General Grave (VIDEO)  NO RESPECT!   @webpagelink"},{"comment_id":"10153663985481509","commenter_b":"Americans don't know half the stuff the government does.","commenter_a":"Loose lips don't sink ships anymore or what?","post_message":"The U.S Air Force's 'secretive space plane'... what exactly is it? CNN Rachel Crane reports: @webpagelink"},{"comment_id":"1724969627717594","commenter_b":"@username they don't do anything considering the billions of dollars we give them in aid that we couldn't attain ourselves. I'm not saying give Palestine money either just why give Isreal money to kill Palestinian children and so Israelis can have abortions?!","commenter_a":"If you realized what Isreal has done to the Palestinians you might donate to Hamas as well.","post_message":"WATCH: Filmmaker Ami Horowitz discovers that some American college students are willing to donate money to the militant group Hamas, after being told it will help “destroy Israel.” @webpagelink"},{"comment_id":"10153579944776438","commenter_b":"If he hates it that much, he can step down and we can keep his paycheck.","commenter_a":"lol @ headline","post_message":"\"He hates it.\""}]
