[{"comment_id":"10153258325486680","commenter_b":"Dear Airlines:* Dump the male flight attendants. No one wanted them in the first place. Replace all the female flight attendants with young good-looking strippers. They don't even serve food anymore, so what's the loss. The strippers would at least triple the alcohol sales and get a \"party atmosphere\" going in the cabin. And, of course, every businessman in this country would start flying again, hoping to see naked women. Because of the tips, female flight attendants wouldn't need a salary, thus saving even more money. Muslims would be afraid to get on the planes for fear of seeing naked women. Hijackings would come to a screeching halt, and the airline industry would see record revenues. This is definitely a win - win situation if we handle it right -- a golden opportunity to turn a liability into an asset. Why didn't Bush or Obama think of this? Why do ...","commenter_a":"Bernie would trounce him! Trump would get absolutely destroyed! Lmao 😂","post_message":"Donald J. Trump: \"Oh would I love to run against Bernie. That would be a dream come true.\""},{"comment_id":"10153562770079228","commenter_b":"Lol right^^^?","commenter_a":"Should be fired","post_message":"She complained about protesters blocking rush hour traffic on I-70"},{"comment_id":"10154033192724087","commenter_b":"The white trash vote can win you the primary, just not a GE. They don't have enough Electoral votes.","commenter_a":"At this point, should really stop insisting he can't possibly become president. If we lived in a sane world, he wouldn't even be the nominee. But, here he is, and no matter what he does, people continue to support him.","post_message":"\"Donald Trump won’t be our next president come January 20, 2017, and here are 5 reasons why.\""},{"comment_id":"1766049700310185","commenter_b":"She better look deeply into Muslim beliefs and get used to sexual assaults because these heathens think it's their right","commenter_a":"The White House is warning Trump not to retaliate against her. Is that a red line? They going to write a mean letter to him if he does?","post_message":"Right after Michelle Obama took the stage and launched an attack on Donald J. Trump that sent the media into a frenzy, the White House delivered a message to the Republican candidate that did NOT go unnoticed..."},{"comment_id":"10153704026896350","commenter_b":"And what kind of Kenyan or African name was it. Something no-one can pronounce or spell I'm sure.","commenter_a":"s","post_message":"Aww, we think the name is perfect!"},{"comment_id":"10154467699462675","commenter_b":"Let's be clear to all Trumpicans about at least one thing: not all terrorists are or have been Muslim. America isn't the only country to be attacked by terrorists. Terrorists have one thing they all share, they're Terror-ISTS","commenter_a":"guess what, you should leave too. you are an imagrant. give this country back to its rightful people, the native indian. !!!!!!!!!!!!","post_message":"British Foreign Minister Boris Johnson addresses parliament on President Trump's immigration policy. President Trump's executive order bans U.S. entry to migrants, refugees and green-card holders from seven predominantly Muslim nations."},{"comment_id":"10154701801396002","commenter_b":"Just like this woman doesn't care if you believe her or not.","commenter_a":"I'm not believing this, you're leaving prescription drugs in the house and know you're going to be gone for 5 days? We never leave ours behind Fir any reason because of what you have to go thru to replace them. I also can't believe they stole video games and not the TV. According to the report and the time limit, they would of wiped them out. Just my opinion.","post_message":"Standing in the middle of her ransacked living room, Taylor resident Janice Mulholland is in disbelief."}]
