[{"comment_id":"10154001737221509","commenter_b":"Because marriage is between a man and a woman, look up sodam and gamora","commenter_a":"Why has she not been fired? Seriously, find another job if performing your duties as a PUBLIC SERVANT conflicts with your religious beliefs. BTW, homosexual marriage is NEVER mentioned in the bible.","post_message":"This Kentucky woman is still refusing to issue marriage licenses to same-sex couples on \"God's authority\" -- and in defiance of the Supreme Court. @webpagelink"},{"comment_id":"814458771980512","commenter_b":"Hillary represents the quinteseential establishment politician. Get some newer blood in Washington that hasn't been purchased already. I'm all up for a woman President, just not Clinton.","commenter_a":"Let the voters decide. But I'm going in the direction of a woman at the helm.","post_message":"I guess this Republican double standard is okay because Ted Cruz is white? Obama's grandfather, who raised him, served as a sergeant in the U.S. Army during World War II. From Wikipedia: \"Ted Cruz's father fought for Fidel Castro in the Cuban Revolution when he was 14 years old...\" Image by Occupy Democrats."},{"comment_id":"483457381844842","commenter_b":"Stupid,, Stupid,,, Stupid,,dumb bitch","commenter_a":"who voted for her?","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10154230829439877","commenter_b":"@username that's horrible Florida teachers do get raises the website says the pay is negotiable but I only co-teach so my salary is non negotiable. I suppose it depends on what one perceives as good pay the teacher I work with gets grants and other stipends but she also buys many things. My aunt who's taught for about 11 years in Arkansas buys many items but keeps her recipient for discounts and tax write offs I imagine you don't get nearly back what is put in. I subbed for a little over a year and I found myself buying many items I didn't care to file on my taxes even though the district gives you that option. I understand","commenter_a":"I've worked at many schools many of them teach our babies and cannot stand them this is a fact. I will add I chose my profession after having my well behaved straight A children repeatedly coming home telling me their teacher was mean or did not appreciate their good behavior and Good citizenship. So I began to substitute and get an inside view. 68 job assignments later I saw many teachers that were jaded not just by the lack of parental involvement but by the lack of pay. I think more parents should better discipline and I also believe teachers lacked empathy and understanding. I will add prejudices and biases had a part as well. I really noticed it at mostly white schools that had few Hispanic students and it is truly heart breaking. Therefore, I am pursuing my teaching certification with everything in me to become the/an advocate for ...","post_message":"Who are we allowing to teach our babies?"},{"comment_id":"419941198130475","commenter_b":"Yes, Yes, she is a ruthless women!","commenter_a":"Youll keep up the good work","post_message":"Republican Presidential candidates are all ganging up on Hillary Clinton. Is this fair?"},{"comment_id":"10154125153407169","commenter_b":"STOP Election Fraud: Do NOT use Soros voting machines. Please vote to put Billery/Killery on trial for TREASON. She broke the law and belongs in jail. She risked our country and put our people in harm's way, and had Democratic whistleblowers murdered. Not only Billery is very dangerous, she will bring this country to a security collapse with cutting our military and a financial collapse by choosing a fight with Russia and ruining small businesses while sending all jobs overseas. Please don't vote for the DEVIL. This country needs to be free and strong, where people have a real chance at the American Dream. Billery should have never been the Democratic candidate to start with and stole the nomination from Bernie Sanders. She is the most corrupt candidate ever and works for the elite new world order who wants to make people obsolete with new robotic technology. She brings with ...","commenter_a":"It will make money for the drug companies!!!","post_message":"Primary care doctors and nurses are well-positioned to treat addiction and champion care for those struggling with the use of opioid pills or heroin (From PBS NewsHour)"},{"comment_id":"1259707477396285","commenter_b":"@username a much better caption for that sound","commenter_a":"Ali Finneran","post_message":"Once you hear it, you can’t un-hear it. It will be forever with you. Just a warning."}]
