[{"comment_id":"1222107054548141","commenter_b":"Fucking weird bitch","commenter_a":"'@username @username wdf","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"990097811101554","commenter_b":"That looks disgusting 😱","commenter_a":"'@username BONG","post_message":"Not all heroes wear capes. 🍔+🌭"},{"comment_id":"569916976504180","commenter_b":"'@username, different country different faith but people still using the text to justify murdering gays. Was it the predominantly Muslim US States that passed the 'Gay panic defense?' @webpagelink","commenter_a":"Good on you, Bruce. Christians warned us about Sharia law, and now they've imposed their version of it on us. Irony?","post_message":"'Some things are more important than a rock show.'"},{"comment_id":"925848087500236","commenter_b":"SHE BE A COMMIE SOCIALIST. FIRE HER!!!","commenter_a":"he needs to take about three weeks of anger management and then come back child behavior period","post_message":"BOMBSHELL!!  This changes everything..."},{"comment_id":"10152959292394753","commenter_b":"I don't think you can read lady. Either that or human compassion is lost on another bitter old woman.","commenter_a":"that is jus nasty to have sex with your stepdad","post_message":"North Las Vegas police are still investigating the rape and child abuse case. The law enforcement are continuing to review what they have a “three-generation case of child abuse” involving the teen rape victim’s mother, Kellie Cherie Phillips, 38, and the man she described as her stepdad, Jondrew Magil Lachaux, 39."},{"comment_id":"10154980169065789","commenter_b":"'@username poor little bitch, guess what trumps your president now ! Lol","commenter_a":"He's accomplished so much in such a short period of time, compared to the last administration. So thankful we have someone who will strengthen our nation and our military. God bless you President Trump!!","post_message":"Donald Trump has been in the White House for 13 days. Do you like or dislike what you've seen from his administration so far?"},{"comment_id":"10156567119170725","commenter_b":"U R A NUTJOB AND A #FRUITCAKEFORILLEGALCRUZ ! #MAKEAMERICAGREATAGAIN #DONALDJTRUMP 2016 #ONLYAMORETRUMPNATIONCANSURVIVE!","commenter_a":"The sycophant behavior of many Trump supporters is identical to Obama Libtards, complete with vile hatred of anyone who disagrees and scummy ethics based on Utopian promises. I am starting to think maybe Americans do need to surrender their liberty and let the government take care of them like little retarded babies. Iowa better prove me wrong","post_message":"Ted Cruz isn’t tough on immigration. He stood up for amnesty, not for Americans. President Trump will be the tough leader that America needs. #MakeAmericaGreatAgain"}]
