[{"comment_id":"10155169022694411","commenter_b":"I think the Mexicans are just being drawn back to their ancestral lands annexed into parts of the US. God gave the poor Mexicans more land but the Devil took some of it. Now the population is over flowing into another country. Build the wall on the pre annexed land boundary and the problem will be solved...","commenter_a":"That wall devided a nation. This wall divides two seperate nations. Fuck outta here","post_message":"'We Berliners know best how much suffering a division of an entire continent, cemented by barbed wire and wall, has caused'"},{"comment_id":"10158014853220594","commenter_b":"Mariah Neu and @username. You both say the state of Illinois has lax gun control. In the city of Chicago, not the state of Illinois gun crime very high and so is gun control. Now to my point about Chicago and how gun control affects crime. It is stated that affectguns are imported into the city and these guns are used in the crime. If close carry by law abidi ng citizens was allowed in the city then law abiding could and would protect themselves. It should be of no surprise to anyone that a thug will not follow the gun law, but common citizens will. Gun control laws don't stop crime they just reduce the law abiding citizens ability to protect themselves. You folks use data about the state of Illinois, that has nothing to do with this discussion. Do a comparison of the city of Chicago and the ...","commenter_a":"As is often the case Oreily misses the point, the elites left are the the white spremest. The left just plain want control of all our lives. Taking all freedoms starting with gun ownership","post_message":"The Fox News anchor drew criticism after he said liberals' call to abolish the Electoral College is \"all about race.\""},{"comment_id":"10154991280103812","commenter_b":"Make America Hate Again","commenter_a":"Hopefully trumps followers do not take this the wrong way and try to overturn the world if he looses.... smh","post_message":"In final campaign stop before Election Day, Donald J. Trump calls on working class to 'strike back.' \"Today is our Independence Day.\" @webpagelink"},{"comment_id":"10153496475494575","commenter_b":"\"She has since filed an appeal.\" Wow! She has some f***ing nerve!","commenter_a":"Horrible, horrible person.","post_message":"An 8-month-old baby girl died after an EMT refused to respond to the call.  The EMT told her boss, “I'm not about to be on no scene 10 minutes doing CPR, you know how these families get.\""},{"comment_id":"10153362630049641","commenter_b":"Whatever tickles your fancy. Hope you get a free lifetime of ky jelly .","commenter_a":"This country is going to hell in a hand basket.","post_message":"The White House takes on rainbow hues to celebrate the Supreme Court's marriage equality decision: @webpagelink"},{"comment_id":"10152908801970927","commenter_b":"No body forced you to spread your legs; and, no body forced you to have unprotected sex!!!!","commenter_a":"Cross your legs","post_message":"It's no surprise that Satanists support Planned Parenthood, but what is SURPRISING is how they showed that support ..."},{"comment_id":"1720347271558389","commenter_b":"What a pathetic slut !!!!!!!","commenter_a":"Just another Wacko;showing her ignorance.","post_message":""}]
