[{"comment_id":"1128870593839354","commenter_b":"They not are migrants ffs, They are invaders. When will our government's wake the duck up!!!","commenter_a":"These people are deranged.... Catch them and give them an immediate death sentence............Shut all the boarders..... Keep filth out to protect our own...","post_message":"Migrant rape fears spread across Europe"},{"comment_id":"10154194875640009","commenter_b":"This woman is a black retard, like the retarded black guy that was standing behind her when she spoke about the Kremlin invading KOREA. You let goofballs like this in a leadership position, you'll get a 3rd world country.","commenter_a":"the poor that is","post_message":"ICYMI"},{"comment_id":"10153618625791130","commenter_b":"How many more will emerge before she is 30? She is off to an excellent start!","commenter_a":"Sarah Palin has banned all Liberals from entering Bristol Palin","post_message":"Sarah Palin used some very creative English in her Donald J. Trump endorsement."},{"comment_id":"410802195930600","commenter_b":"Stupid.. Beyonce has enough awards, no way in hell I would have broken it to give half to Beyonce.. Adele is so much more talented..","commenter_a":"It was ADELE'S moment - and BTW, that narcissistic fur hag is NOT a queen - except maybe of BAD TASTE","post_message":"Adele may have broken her Grammy award in half for Beyonce."},{"comment_id":"1118389778239557","commenter_b":"The question is, \"Is there a discernible difference between \"Radical Muslims\", and Muslims?\" When people close their eyes, get on their magic carpets five time a day and pray to Mecca, it is clear that Islam is the most important thing in their existence. Far above Nationalism, for the country they are in. For our own security, we must stop Muslims from entering this country. In addition, existing Muslims here should be asked and paid handsomely to leave. Finally we should ban all business dealings with Muslims and abandon the Middle East.","commenter_a":"Non't kid yourself islam is all radical at the core.","post_message":"This guy is EXACTLY right about radical Islam. Let's share this everywhere, because you know the media never will."},{"comment_id":"965089543550794","commenter_b":"Sounds like pure jealousy. Cal looks better than some women","commenter_a":"but why do they all have the need to look like hookers?","post_message":"She only realised she was transgender when she dressed up in hot pants and a wig for a joke"},{"comment_id":"749306348569686","commenter_b":"@username - free cell phones started under Bush administration, food stamps under FDR.. try again.","commenter_a":"He is a real man.Best president with class and a brain. That'swhat make people hate him because he has education . and know how to be humble even when haters come along with silly response. HATERS","post_message":""}]
