[{"comment_id":"1238359136216847","commenter_b":"Ah shut up!!!","commenter_a":"Ding- Dong.","post_message":"Come again??"},{"comment_id":"539030936307389","commenter_b":"@username you're not paying for my uterus. Lol.","commenter_a":"So, Kaine, a Roman Catholic, has a moral conflict with his faith when it comes to the death penalty (killing criminals) but no qualm whatsoever promoting the killing of unborn babies?","post_message":"Mike Pence is a good man who had a strong performance tonight. This evening Tim Kaine demonstrated that he would serve as just another enabler of the failed Obama-Clinton policies that have hurt our economy, taken away our freedom, and weakened our security. The choice for Americans is clear. We cannot afford a third term of President Obama, and Clinton-Kaine would only continue the disastrous policies of the last eight years."},{"comment_id":"10154473881370329","commenter_b":"Ivan Roy Rasmussen YESS!!!!! Hahahahaha","commenter_a":"Katie KocajSierra Weiner squid ward tortellini","post_message":"\"Am I a pretty girl?\" // SpongeBob SquarePants"},{"comment_id":"1905981339634270","commenter_b":"O, yea...nothing to do with what a shit candidate Hillary was or the DNC rigging the primary...it's all stupid, racist, immigrant hating, uneducated fools...still don't get it do you. Bullying people you don't agree with by \"being offended\" and calling names lost y'all the election. Try a conversation without inviting your hate first, and stop listening to the alphabet news hate and fear mongers.","commenter_a":"Laura Dittmann watch this. I tell you wutttttt lol","post_message":"Donald Trump's own voters fell for a giant lie. -- Trae Crowder"},{"comment_id":"10153197324656491","commenter_b":"@username if you don't have weapons, then vermin thugs might get your food and water.","commenter_a":"I wonder if this is how walking dead started","post_message":"The researchers plan to “revive” the virus in a safe laboratory setting."},{"comment_id":"1344505415570466","commenter_b":"yes 1999 ...only recently explore in earnest","commenter_a":"Actually it was found few years ago.","post_message":""},{"comment_id":"525940174197243","commenter_b":"And that is why we need to vote for Trump...with Cruz you will get an open southern border and amnesty.","commenter_a":"No vote for Cruz, he is a politician, just cannot trust politicians democrat or republican. Politicians will tell you anything to get you to vote for them, they get into office and do not follow thru.","post_message":"Agree or disagree?"}]
