[{"comment_id":"10153361395611107","commenter_b":"Class on the left, and no class on the right. She is just another, inept, liberal, lying skank. I put her in the samne group with that traitor, Hanoi Jane.","commenter_a":"Better yet , hit her at her cankles. Paul/Trump ... Trump/Paul for America, not the establishment","post_message":"Guess who I ran into? Tune in to @CBS now to find out why I think she should forever be precluded from being potus"},{"comment_id":"10155033056251350","commenter_b":"you alice are the lame one.... bet u r fun at parties....not!","commenter_a":"how can americans put the flynn event in context. flinn's entry into the trump power structure was vigorously opposed from the beginning: one might even consider his a marked man. part 2: media has propogated trump's comments on intelligence agencies extensively. so one could ask the question how does the leak on flynn occur in the first place: NSA surveillance or other. it would appear a US intelligence agency leaked to the anti trump news media:))) could one consider that a direct attack on this nation to influence American government: yes. trump must drain the swamp in the intelligence community now. the entire establishment apparatus that supported the status quo is now actively working against change middle class voted for: start the purge. there is an outlier that must be considered: Israel. trump is surrounded by Israel firsters. was flynn one of those or was he an American firster. did ...","post_message":"On this Valentine Day, watch George H.W. and Barbara Bush share their touching love letters on TODAY in 2011 (and try not to cry!) @webpagelink"},{"comment_id":"10156393524070389","commenter_b":"Isis , of course,climate change is a myth! It gives obama something to talk about beside the real problem, his muslim brothers.","commenter_a":"Odummy is the Threat!!!!!!!!!!","post_message":"Question of the Day: Which do you think is a bigger threat: Climate change or ISIS?"},{"comment_id":"10152998005499753","commenter_b":"Woman you have no clue.","commenter_a":"I think this mom did the right thing with her son. She is a hero to me and I for one would have done the very same thing. This columnist is way off base here and I think she needs to shut it.","post_message":"Toya Graham smacked her son and dragged him away from the Baltimore riots. Now a columnist is ridiculing her and those who support her for the \"abuse.\" @webpagelink"},{"comment_id":"10152700019752212","commenter_b":"While I understand what they are trying to do, forcing a certain body shape (or denying a certain body shape) under penalty of law is rather draconian. They might better serve the public through education.","commenter_a":"In this day of unrealistic, unattainable goals for what is beautiful, unless you go under the knife or starve yourself. I say Amen. Keep it real.","post_message":"HOT TOPICS: France has passed legislation banning models deemed excessively thin. The law also imposes steep fines and possible jail time for any agent and modeling agency who hire them. The law focuses on the model Body Mass Index (BMI) and bans anyone whose BMI is, according to the law, than levels proposed by health authorities and decreed by the ministers of health and labor. Opponents of the law think that the criteria for banning a model is too rigid; that BMI alone is not a good judge of who is and isn healthy. Others, though, say they happy the law is put in place. They think the law will stop glorifying an unhealthy body image. #9HotTopics What do you think? Robin Marsh and Lacie Lowry may share your comments today on News 9 at Four!"},{"comment_id":"903890666313022","commenter_b":"She better bring a big army.","commenter_a":"Well michelle said before she is out of the White House she is going to have guns taken away from the American people","post_message":"Outrageous!"},{"comment_id":"10154250290881337","commenter_b":"YES, WE UNDERSTAND THAT YOU ARE NOW A WOMAN, DO US ALL A FAVOR & STOP THROWING IT IN OUR FACES YOU BINT !!","commenter_a":"Please go away now. Everybody's over it","post_message":"Caitlyn Jenner is taking Donald J. Trump at his word..."}]
