[{"comment_id":"10157707332290354","commenter_b":"Deport her ass","commenter_a":"If you vote Hillary you are just inviting scum like this into our country.","post_message":"What did she mean by this?"},{"comment_id":"10152808314825736","commenter_b":"Hope everyone has their General Lee from \"The Dukes of Hazard\" cause you can't buy one from amazon, ebay or etsy now!","commenter_a":"Confederate flags have just become collectable.","post_message":"More retailers, including Amazon and eBay, joined Walmart to remove rebel-flagged items from their shelves and websites."},{"comment_id":"927164187324440","commenter_b":"A real woman appreciates foreskin and it's functions. I prefer a whole full functioning penis.","commenter_a":"Yeah well.. circumcised guys get blown more often scientific fact","post_message":"And now for a quick but fun history break from CollegeHumor. - Rollie Williams"},{"comment_id":"769219589888459","commenter_b":"i have been there over and over the last time a mexican woman tried to give my mother her baby beged my mother to take the child this is a fact and sad but if mexico is so great then way are so many comming to America","commenter_a":"Who would want to move to Mexico? In dire stress, a person could find better options than that Anti American, drug cartel controlled country. Funny how they are so anti American, but so many scramble to get here huh? The citizens of Mexico don't even want to live there, and I can't say I blame them.","post_message":"Americas Freedom Fighters"},{"comment_id":"10152558711931770","commenter_b":"When was the last time the Climate beheaded, butchers and burned to death with gas someone?","commenter_a":"what a goof","post_message":"The president compares climate change with ISIS..."},{"comment_id":"10153647518861350","commenter_b":"This is 100% a mental illness! We would never approve of someone cutting their right hand off b/c they decided they had to be a lefty. So why in the world are we letting these people mutilate themselves?!! It's not about sex it's about the brain. They need help!","commenter_a":"The man with the sign in the background has the heart of the issue correct: girls' rights matter! No way would I want a confused young man using the same bathroom at school as my daughter. These young men and women need help. I have compassion for them because they are confused. Steer them towards counseling and mental health treatment. Caitlyn Jenner isn't a hero. I don't buy the \"if it saves one life\" act. The fact is the majority of suicides in transgenders occur AFTER they've made the devastating and disastrous choice to destroy their own bodies as God created them. They need treatment BEFORE they get to that point, not someone telling them they're fine as a woman when they were born a man or vice versa!","post_message":"\"I'm not the only transgender person at my school, and I won't be the last.\""},{"comment_id":"10154319616791337","commenter_b":"???????????? LOL ????????????","commenter_a":"Looking forward to Colbert's inevitable rant about this, since he has Cap's shield.","post_message":"PURE FURY! Captain America fans are losing their sh*t over this decision..."}]
