[{"comment_id":"10154262917016800","commenter_b":"I am the tool to build that damn wall!","commenter_a":"Trever, don't be an idiot.... I know your just a puppet... but cut the strings man...","post_message":"Donald Trump's campaign funding is running low while his personal spending is running very, very high."},{"comment_id":"10153330006631051","commenter_b":"11 died in the C130 crash in Afganistan today, thats 11 more murders for Obama.I had more respect for the Black Panthers than Obama.The Black Panthers at least admitted to being Racist and they did not murder our troops, as Obama has.","commenter_a":"More guns = less violence","post_message":"Does President Obama have a point here?"},{"comment_id":"10154929144129657","commenter_b":"You're actually describing her as intelligent? Seriously?","commenter_a":"Intelligent strong ladies don't need NOW to fight their battles for them. They are capable of doing it themselves.","post_message":"Looks like she doesn't need NOW's help after all."},{"comment_id":"10158070336085231","commenter_b":"There is no Muslim Ban. Ban is against potential terrorists not against Muslims.","commenter_a":"This is what discrimination looks like to the Black's, sorry to see another people of color experience this!","post_message":"The American people are putting their money where their mouth's are."},{"comment_id":"1318403084859330","commenter_b":"They wont be missed","commenter_a":"Awwww!","post_message":"There are some deaths that don't make us cry."},{"comment_id":"10153008628783721","commenter_b":"of course I'm involved!","commenter_a":"Sara Kasperski are you involved? I know Shia is...","post_message":"The watchers become the watched."},{"comment_id":"951619314934321","commenter_b":"She is a moron.","commenter_a":"Fox news, God love em, is like all old line Republicans, afraid of the truth that Palin tells. Sarah may never be president, but she sure should be. She represents working Americans better than any other.","post_message":"Don't worry, Palin fans. You'll still be able to see “the First Lady of the Outdoors” on the Sportsman Channel."}]
