[{"comment_id":"596965907173588","commenter_b":"They BORN there.need to FIX their OWN Country..DON'T COME MESSING UP 'OURS;~~","commenter_a":"Trump will make american tax payers build the wall not mexico","post_message":"Trump Better be Serious about Border Security Promises"},{"comment_id":"10153040281701051","commenter_b":"And don't go back for her. Let her walk her crazy ass home.","commenter_a":"Dump her ass at the lake then go take care of your business","post_message":"This husband was so stunned by his wife’s behavior that he took out his phone and started recording the whole thing."},{"comment_id":"575161529335569","commenter_b":"That sick women will never be fine ! Who you kidding !","commenter_a":"Why is this such a big deal? After some rest, and antibiotics she will be fine.","post_message":"Is Hillary Clinton just run down, or is it more serious?"},{"comment_id":"1668611910083188","commenter_b":"She ain't done nothing I wouldn't have done. I do not think any red blooded American should have to put up with this nonsense!!","commenter_a":"Stacey said what we all think, good for her.","post_message":"Stacey Dash has been suspended by Fox News for saying this to Obama. She needs our support. Should Stacey Dash be reinstated?"},{"comment_id":"10154553649688812","commenter_b":"This is getting ridiculous... Killing them is not necessary..","commenter_a":"As for sending these animals to zoos sanctuaries, etc. That would be the best solution, but those places have limited space and resources. Sometimes there just isn't any option.","post_message":"Colorado officials euthanize baby deer that was picked up by people who likely mistakenly thought it had been abandoned."},{"comment_id":"10154266056696051","commenter_b":"She looks dreadful!!!","commenter_a":"the VALUES are no 'right' unless they are YOUR values?? I don't think so...........the American people have spoke. Donald Trump Is Our President","post_message":"Hillary Clinton made her first major appearance since losing the presidential election last Tuesday. Do you agree with what she's saying?"},{"comment_id":"10153313662524342","commenter_b":"No...not white people get away with murder No white lady who spoke nasty to an officer then killed herself ever got a street named for her... Thats just a black thing Just check statistics n wow Stereotypes proven true;)","commenter_a":"White people issues:/","post_message":"Police say an investigation into a mail theft led them to a drug lab   in a Pearland apartment.  DETAILS/MUG SHOTS --> @webpagelink"}]
