[{"comment_id":"912381755524744","commenter_b":"Cruz no need for explanation,ur vote wud be insignificant bc she is still the AG.Drop dead!","commenter_a":"We don't want Ted Cruz","post_message":"Ted Cruz was the only senator to miss the vote."},{"comment_id":"10153704706699170","commenter_b":"She got robbed! She should be #missamerica!","commenter_a":"Well, if their question was addressing 'gun related accidents', she was right on point. However, that was not their aim ( no pun intended) - their 'aim' is to ban weapons period. Their question does not address any of the mitigating circumstances that surround each of the recent incidences of gun violence and they know it. You can see it in the eyes and expressions of the questionners once Miss S.C. gave her answer.","post_message":"Wow. I don't think ANYONE was expecting this... Do you agree with Miss South Carolina's answer?"},{"comment_id":"10153660069974456","commenter_b":"You never know what goes on behind closed doors... He probably threw all disgression out the door after she found out about it and agreed to wait. A woman will only take so much and then it's Katy bar the door!!!","commenter_a":"A Sad Story Here...He Broke His Vows...I Want 2 Know Why He Cheated On His Wife...They Look Like They Was Very Happy 2 In There Marriage!!","post_message":"JUST IN: Gov. Bentley says recent allegations that he misused state property aren't true, and he will show that."},{"comment_id":"10153436441037439","commenter_b":"STFU mooslins and go back home.","commenter_a":"Not me Jesus is Lord.We are not under any bondage to fear any thing.They are fighting a losing battie.","post_message":""},{"comment_id":"10153551995732217","commenter_b":"Darn foreigners, coming over here putting mosaics under our gardens....","commenter_a":"Claire O'Regan","post_message":"This farmhouse owner was renovating his barn in Wiltshire when he uncovered... a Roman villa built around 200AD 😮 Full story: @webpagelink"},{"comment_id":"1007444045971350","commenter_b":"don't change anything","commenter_a":"STOP","post_message":"First The 20, Now The $5 Bill - Obama Announces More 'Diverse' Face For The Bill Stop it. Leave our money alone. Do you think they should keep honest Abe on the 5$ bill?"},{"comment_id":"1057253901026942","commenter_b":"and raising the min wage only cuts jobs, hrs, and closes busnesses","commenter_a":"We've seen this movie! And it doesn't end well for most Americans","post_message":"Research has found that massive tax breaks for the wealthy don’t trickle down into economic growth."}]
