[{"comment_id":"10154266348729203","commenter_b":"Go on sis!","commenter_a":"It seems that people are pushing their agenda however way they can... Big changes are coming soon... @webpagelink","post_message":"'Captain America: Civil War' screenwriters on the importance of Cap in light of Trump: 'It important to have someone remind people that that is not what this country is about, and you being kind of an ugly fool, and reductive.'"},{"comment_id":"1388976751118684","commenter_b":"STOP KILLING BLACK PEOPLE","commenter_a":"معقول يصير بامريكا","post_message":"Courtesy: Ruptly"},{"comment_id":"10153455356180779","commenter_b":"'@username Yes, she is, without a doubt!","commenter_a":"Dude is garbage. Talented but garbage. LOL trying to spark a feud with Taylor swift, makes a song about gold diggers then marries one...","post_message":"Nearly two months after 'The Life of Pablo' debuted at Madison Square Garden – followed by a Tidal stream-only release, a declaration that the album would never be on Apple Music, then the eventual dispersion of 'The Life of Pablo' to Apple Music and other streaming services – Kanye West's latest LP has finally found its way to the top of the Billboard 200."},{"comment_id":"10154260914771130","commenter_b":"'@username and she's gonna tell her fake mom too!","commenter_a":"'@username and @username this reminds me of some of our students.","post_message":"Boy, bye. 👋"},{"comment_id":"10153724000373132","commenter_b":"Then she will have another kid.","commenter_a":"If she's stupid they will. So yes they'll end up back together","post_message":"In this week's PEOPLE, we learn why Scott Disick blew a second chance with Kourtney Kardashian.  Do you think they'll ever get back together?"},{"comment_id":"416896861831941","commenter_b":"I do not think Hillary will win (fairly anyway).","commenter_a":"The even bigger issue is that 46% of people still think he's a good president.","post_message":"I am ONE of them...do you?"},{"comment_id":"10153200958788837","commenter_b":"?","commenter_a":"That cop needs to be arrested for having an illegal 'agresive breed'","post_message":"PUPPY THROWN - Local 10's Michael Seiden has the latest on a poor little puppy that was thrown from a passing car right near the North Miami Beach Police Department"}]
