[{"comment_id":"10154291814626178","commenter_b":"Everything she touches goes to h**l.","commenter_a":"Well if they have a remake of the Munsters she might have a chance. Looks like a cross between Grandpa and Eddie.","post_message":"Michelle Obama to appear on another television show. Is this an appropriate role for the FLOTUS?"},{"comment_id":"10153193599506770","commenter_b":"I think Audrey had her brain aborted !","commenter_a":"Will she have an abortion since Grandma Hillary wants everybody to have abortions.","post_message":"Hillary's going to be a grandma again."},{"comment_id":"10153166751996336","commenter_b":"CIA is the source of evil, they create such groups like ISIS, Al-Qaida to fight its dirty proxy war in other countries","commenter_a":"Haha go ahead smash the headstones. They are just mad the one thing they can't take is our eternal life with Jesus.","post_message":"ISIS continues with their calculated campaign of terror across the Middle East, destroying Christian graves in the Iraqi city of Mosul."},{"comment_id":"1034964553205670","commenter_b":"@username I do not know of anyone who has demanded to, \"get even\" with whites. Not sure who you are referring to.","commenter_a":"Idk, I was bullied and made fun of for being white by black girls. It's just racism, saying \"reverse\" racism implies that only white people can be racist. That's pretty racist, in of itself. :/","post_message":"News flash: Reverse racism doesn't exist."},{"comment_id":"10150858432674999","commenter_b":"She s a crook and a liar","commenter_a":"Hillary is going to make a great president. Very much looking forward to seeing who she adds to the supreme court. Nice to see a woman deciding how American culture will be defined for our children and children's children. She's going to shape society for hundreds of millions of Americans. We love you #hillaryclinton","post_message":"\"There has never been a man or a woman — not me, not Bill, nobody — more qualified than Hillary Clinton to serve as president of the United States of America,\" President Obama said. Read more: @webpagelink"},{"comment_id":"1085472271464242","commenter_b":"If they are on there with consent, are actually single, or are polyamorous, this breech will not hurt any relationship. But this site advertises directly to cheaters.","commenter_a":"How many users on am are there with full consent of their partners? How many are actually single? How many are polyamorous? These things you don't know, and here you are cheering on this invasion of privacy for all am users, because you don't align morally with a subset of users. This kind of punishment never goes away, and that is especially a problem for those who don't deserve it.","post_message":"Will this hack be the one to get people to care about digital privacy?"},{"comment_id":"10155297083883132","commenter_b":"Kimberly, you're obviously not paying attention. That's exactly what's happening. Also, the acts of past presidents don't take away from how terrible this is. Everything is quicker now. It's on fb as soon as it happens and people are less lax then they were to speak their minds. Don't act as if no one cared before. That directed to all the \"people losing their minds\" comments.","commenter_a":"So Trump bans certain people from entering the country and people lose their minds? Obama murdered how many women and children in those same exact countries using bombs and no one bats an eye? Funny how that works.","post_message":" one warned me when I was leaving, no one cared what will happen to my dog or my job or my life there, she said. one told me what I should do with my car that is still parked at the airport parking. Or what to do with my house and all my belongings. They didn say it with words but with their actions, that my life doesn matter. Everything I worked for all these years doesn matter."}]
