[{"comment_id":"1059551124091179","commenter_b":"Surprise, I don't want women in mine either!","commenter_a":"Don't want some guy in bathroom with any girls. Whose to say he really is gay. ! Don't care if he is though don't belong there.","post_message":"Why is this so hard to understand?"},{"comment_id":"10152864140411051","commenter_b":"She should be afraid not to file for divorce!","commenter_a":"Is time that she buys a gun and it will be the last time that he ever hurts her again.","post_message":"A mom was picking up her children from daycare when, all of a sudden – boom."},{"comment_id":"10154058052466336","commenter_b":"the muzroach must not remain on the face of the earth no more","commenter_a":"He probably wouldn't have been caught coming across Obama's border.","post_message":"Police say they seized four air rifles, eight scopes and 200,000 .22-caliber bullets."},{"comment_id":"917358028382410","commenter_b":"off with her head!","commenter_a":"Behead here to.","post_message":" ordered me to kill child"},{"comment_id":"10153700802697235","commenter_b":"Untrue. Unfair. The DC snipers were/are referred to as mentally ill, not as \"thugs.\" I can't think of another black mass shooter offhand. Most U.S. mass shootings are either non-blacks with histories of mental illness, or gang/drug related shootings committed by blacks.","commenter_a":"It's because he was white. That's why now it's about mental illness next week a black kid will be a thug or a menace to society","post_message":"This is a big lie we're always told so that we can avoid talking about the obvious -- GUNS."},{"comment_id":"10156112188370354","commenter_b":"this woman is an idoit drinking kool aid","commenter_a":"This woman looks exactly as Bruce Jenner, do we care what she says??? Nooooo.","post_message":"Enforcing the law fairly and equally is not \"beating up\" on poor illegal aliens. Rather, it is honoring the Constitution and respecting those who have respected America enough to LEGALLY apply for citizenship and LAWFULLY wait in line. Face it, Leftists: you're losing--and you know it."},{"comment_id":"10153563509195329","commenter_b":"Obviously if you're not as fat as a cow then you're not a real woman","commenter_a":"Dammit! What EXACTLY is a 'real' woman?!?!","post_message":"After years of admiring the models in Victoria's Secret catalogs, we decided to make ourselves into models."}]
