[{"comment_id":"10154034711816770","commenter_b":"You know damn well its the ladies who wizz all over the seat when they do their \"hover\"","commenter_a":"Tired of people thinking they can change the law because they are a part of a small percent of people married to same sex. It's bad enough we have men in a dress pissing all over the toilets in the ladies room.. Being gay shouldn't give you special entitlement.","post_message":"The Supreme Court of Arkansas ruled late this week that LGBT persons who are married to a child’s birth parent but not biologically related to the child do not have a constitutional right to be listed on the child’s birth certificate."},{"comment_id":"1687537648127046","commenter_b":"Allison Henn","commenter_a":"I had to solve this once lol","post_message":""},{"comment_id":"1053645448090460","commenter_b":"Jihad Malik ..get off this post ..your mama was stupid for making you","commenter_a":"Why don't you post a story of the anti Semites throwing people off of buildings in the countries surrounding Israel....they are the people you should be fearing and writing about ...The JP has joined the Shrillary camp","post_message":"Schmitz has called the accusations defamatory, but reports of anti-Semitic tendencies at the top of the Trump team reinforce the narrative."},{"comment_id":"1146022832118940","commenter_b":"How much did this investigation cost you???? Lying bitch.","commenter_a":"Hey liar, the FBI doesn't release information on investigations.","post_message":"Clinton is calling for the FBI to release more details on the investigation, saying \"the American people deserve to get the full and complete facts immediately.\" Agree or disagree?"},{"comment_id":"1232217873516420","commenter_b":"Female dog","commenter_a":"Convicted felon","post_message":"I want to see what you all come up with... Describe Hillary in just two words... Ready, set, go!"},{"comment_id":"10154037878823984","commenter_b":"Mr. Trump from the time he started his campaign he has always states that all the illegals have to go back have to go back to Mexico and Central America but yet he is one of the largest employers in the Real Estate , Casinos , Hotels, and Golf Courses business, has bragged about hiring illegals to including his contractors and subcontractors and they love him 1. did he use e-verification to see if he or his contractors and subs to see if they had a work permit or they are who they say they are. 2. you claim you want to help the veterans but your company hires more illegals than vets. 3. if you are serious about what you are campaigning on why not be the first to fire or dismiss the illegal aliens and fill those jobs with veterans lead by example and make America great again ...","commenter_a":"Yup another lifer. GET RID OF POLITICAL LIFERS THAT ARE FEATHER BEDDING Stump for Trump. You Go Don, Go Don all the way to the WHITE HOUSE.","post_message":"Wow. The governor of Iowa is actively working against one of the GOP's most popular presidential candidates. This is very unusual for the Iowa caucus... the Iowa governor must feel very strongly about this.  Do you agree with the Iowa Gov.?"},{"comment_id":"127969217779704","commenter_b":"@username go away criminal","commenter_a":"Great job police and K9. POS got what he deserved. Just hope the dog doesn't get any disease from the scumbag!!","post_message":"A police dog takes a big bite out of crime, subduing a carjacking suspect involved in a high-speed chase and spectacular injury crash.  Eyewitnesses capture the drama on camera as the suspect tries to flee. Eyewitness News live with the condition of the innocent driver injured in the La Puente crash. Tonight at 11 from ABC7. abc7.com/@username/"}]
