[{"comment_id":"10156346841015725","commenter_b":"Build the wall","commenter_a":"America should close the borders. You do not lock the front door of your house because you hate the people outside. You lock it because you love the people inside. A country's border is its front door.","post_message":"From South Carolina last night- this is what I call a real supporter! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"10153289786066491","commenter_b":"Here's the thing. You need to go # 1? You need to go # 2? Go to bathroom of your current sex. Drop the bomb, Cut loose, wipe clean, get out. That simple. Bathroom is not social grounds It's not grounds to dispute how you feel as gender. Do your business, in out less than 2 minutes..... WTF is wrong with the world today. Everyone wants to be special.","commenter_a":"Are we that far gone from reality that we want to make bathrooms for the trans in our society. Im sorry you were born as a boy or girl. How about you just stick with that while you are in public. Problem solved and no money spent on suppling a unneeded bathroom","post_message":"\"Before the 5th grade, my classmates were able to accept and be friends with me.\""},{"comment_id":"1863352450575527","commenter_b":"She's a nasty which!!! I really felt sorry for Joy she was totally rude to her and had the look of revenge in her eyes toward Joy she should be ashame!!!!=","commenter_a":"Omarosa achieved \"fame\" by being nasty. She is perfect for Trump. She was a disgrace with her last comment to Joy. She literally gave me the chills. I was concerned about Joy's health (and mine) - Omarosa was so vile and consistently lied. She (along with Trump and his Trumpettes) could give good, caring people a stroke!","post_message":"It wasn't pretty."},{"comment_id":"1920123994941377","commenter_b":"Thought she was said she was leaving. Oh that's right she is an actress. Bad one at that.","commenter_a":"Hate to tell you this whippee but nobody really thinks you know anything you stupid bitch, and if you have any compassion for people at all, for God's sake cover your fugly ass face!","post_message":"Nobody saw this coming..."},{"comment_id":"10152776744107217","commenter_b":"Vicki Wray better start thinking of other names 😂😂😂😂","commenter_a":"Beautiful names xxx","post_message":"#RoyalBaby: Introducing Charlotte Elizabeth Diana - she'll also be known as HRH Princess Charlotte of Cambridge"},{"comment_id":"10154729419757699","commenter_b":"Aww Gee must really be scared of Trump . Just use all the money we send them and rest of south America and build the wall that will do it","commenter_a":"TRUMP 2016 !","post_message":"FOX's Gurnal Scott reports."},{"comment_id":"10156455116700354","commenter_b":"Plenty of real women out there that they could have photographed","commenter_a":"A fucking lie from the liberal media why pretend.","post_message":"All 8 PHOTOS here..."}]
