[{"comment_id":"10155922805640725","commenter_b":"He will. Ana Smith . you are sick. Nasty mouth.","commenter_a":"Trump 2016 !! Make this country GREAT again!","post_message":"My #GOPDebate Facebook question for the other candidates-"},{"comment_id":"10153283527870950","commenter_b":"This BITCH makes me sick","commenter_a":"She should be treated as she treated this poor child.","post_message":"The 11-year-old girl's cousin told investigators that the young girl had a medical condition that caused her to lose control of her bladder and bowels. A family friend said the woman was upset that her daughter had the condition, and liked to keep the house spotless with bleach."},{"comment_id":"991088854247496","commenter_b":"It's about time we had somebody who will stand up and speak the truth!","commenter_a":"Who determines what is Polically Correct? The liberals trying to manage free speech.","post_message":"WATCH: The Donald gets into a heated exchanged with a member of the PC police at press conference."},{"comment_id":"976055745789876","commenter_b":"Load these pos up and ship them back to where they crawled out from under a rock!","commenter_a":"If things in this category really get bad, just like an ISIS, looking at the black white demographics in the U.S. these guys could be in big trouble if there is ever a major backlash revolt.","post_message":"Woman planning F*ck Your Flag Day on 9/11 says,  White People Must Die (VIDEO)  @webpagelink"},{"comment_id":"1331072000266602","commenter_b":"I guess it's just disappointing to think of anyone being THAT stupid . Smdh .","commenter_a":"Why make a video of this ? It has to be trolling .","post_message":"The teens said they will make Black people slaves, burn them, brand them and make them swim the Atlantic Ocean."},{"comment_id":"10153338017932411","commenter_b":"So the nets they snag your tuna in make those fisher people littler dicks?","commenter_a":"All the idiots who says no different then fishing. Big men that kill nature as sport. Little dicks!","post_message":"The Facebook video of the incident quickly went viral, attracting comments like, “Someone should drag that guy around in the water just for pictures.”"},{"comment_id":"906697222720307","commenter_b":"Only people with integrity should be allowed to immigrate to our country! If they don't respect our immigration laws, what other laws will they break? They must be ready to work and learn English to contribute to the economy and not leach off of the welfare system. Cut welfare and close the border. Enforce a high standard for admittance for immigrants .","commenter_a":"Yes","post_message":"Click to see where most American voters stand on immigration..."}]
