[{"comment_id":"10153185044695950","commenter_b":"And without reading anything, you're a jealous dumb girl who don't know kids are kids.","commenter_a":"Yeah except when you read his school behavior record you realize he's a little shit.","post_message":"Ahmed Mohamed attended Astronomy Night at the White House last night, where he met scientific stars, astronauts and President Obama. During his visit, he had a chance to chat with the president, passing along a valuable lesson: \"...You shouldn't judge a person by what they look like. You should always judge a person by their heart.\""},{"comment_id":"10153840102456523","commenter_b":"Your ignorant Jessica. Just Stfu","commenter_a":"Gang members shoot people to they do drive byes or just randomly shoot somebody it could be any if us blk kill blks latinos kill latinos white kil whites wow only in America","post_message":"The graphic video shows the three men listening to music, and a man in the front passenger seat holding the phone.   Suddenly, the phone drops to the floor of the car as what sounds like at least 30 gunshots can be heard in the background."},{"comment_id":"10153208513188812","commenter_b":"WWF on wheels....","commenter_a":"He should b able to race it wasn't his fault his car got stolen they should make an acceptation","post_message":"UPDATE: Police find stolen NASCAR Sprint Cup race car: @webpagelink"},{"comment_id":"1096195137073807","commenter_b":"Why are democratic women so scary looking? See what lies do to your face?","commenter_a":"Obama praising himself Hillary looks like she needs to go to the restroom while being admired","post_message":"A note for 2016: the Democrats are the party that abandoned #Israel, enabled the rise of #ISIS and is now helping #Iran to get a nuclear bomb."},{"comment_id":"1435936396466104","commenter_b":"Fool","commenter_a":"Excellent job President Duterte..","post_message":"The death toll has risen to 1,500"},{"comment_id":"10156385306200231","commenter_b":"She nonce play a white girl maybe she believe she one of them","commenter_a":"Can she be traded in???","post_message":"Why Stacey Dash? Why?"},{"comment_id":"10153823780186051","commenter_b":"No. In fact, I wouldn't piss in her mouth if her teeth were on fire.","commenter_a":"Vote Blue no matter who!","post_message":"Simple question: Will you be voting for Hillary Clinton this November?"}]
