[{"comment_id":"501575200039916","commenter_b":"WANTS TO KEEP AMERICANS STAGNANT, MOVING BACKWARDS AND PAY HIGHER TAXES TO SUPPORT IMMIGRANTS COMING OVER OUR BORDERS FROM ISIS COUNTRIES TO PUT AMERICANS IN GREAT DANGER, WANTS TO KEEP MINORITIES IN DEMOCRATIC OPPRESSION, POVERTY, JAIL, AND HIGH CRIME, NO FUTURE, WELL WHY NOT VOTE FOR HILARY CLINTON.","commenter_a":"Yes","post_message":"Question of the Day: Should the media be giving Tim Kaine's past comments about President Bill Clinton more attention? Share your thoughts below."},{"comment_id":"1055977171151281","commenter_b":"What do you expect from this Muzzie piece of shit.","commenter_a":"...and what did Obummer fight...Oh I know...golf par...didn't happen !","post_message":"***PATRIOT ALERT*** \"It is the inescapable duty of the Congress of the United States today to censure President Barack Obama for casting doubt on the sacrifices and motivations of the Americans who fought the Second World War—on the eve of Memorial Day, no less.\""},{"comment_id":"10156451475900500","commenter_b":"Fire her","commenter_a":"So this woman or all the people she was ordering food for did not have a cell phone to order lunch? It should have never been done with a 911 phone.","post_message":"DANGEROUS SITUATION- What do you think of her punishment?  @webpagelink"},{"comment_id":"1538992396141613","commenter_b":"Are these women able to drive their car alone?","commenter_a":"Sorry, I may sound ignorant of the culture, but these women appear to be upper class, mostly because they speak English well, they are educated. I wonder what life is like for poor Muslim women, if their freedoms are the same?","post_message":"These Muslim women are calling out stereotypes, throwing out labels, and asking others to see them as people first and foremost. (via Bustle with more info at u.pw/1qv4Eb0)"},{"comment_id":"10153621420851045","commenter_b":"Uncle had custody of her, I don't think it's what it sounds like. Parents don't just lose custody.","commenter_a":"🙏🙏🙏","post_message":"We have some fantastic news to share with you. Carlie Trent has been found safe and her uncle is in custody! #BringCarlieHome"},{"comment_id":"10153326828766350","commenter_b":"Why would you call her a whore?","commenter_a":"Nobody cares!!!! Kardashians are talent less media whores!","post_message":"Kourtney Kardashian's response to critics? To just keep posting those pics!"},{"comment_id":"486046958252551","commenter_b":"What gets me though is why are these atheist bitches so offended by something they don't even believe exists Just proving their true ignorance I guess...!","commenter_a":"GOD BLESS AMERICA!!!!!!!(keep it going!)","post_message":"This student was told not say 'God bless America', but he's not backing down.  Amen. We stand strong with this student and his flag.  Do you support 'God bless America' staying in schools?"}]
