[{"comment_id":"10152995336151037","commenter_b":"This chick is nuts lmao. Anyone who pretends to know what happened is dillusional.","commenter_a":"This was NEVER about a RACIST Cop shooting someone. The Lame Stream Media made Darrin Wil\\bson into a Racist, despite NO Evidence ever being presented that showed Mr. Wilson as being racist. It is sickening.","post_message":"A member of the grand jury that declined to indict the white Missouri police officer who fatally shot an unarmed black 18-year-old sued the prosecutor in the case, criticizing the way evidence was presented to grand jurors and seeking court permission to speak publicly about the way the case was handled."},{"comment_id":"847757325414844","commenter_b":"fly your flag and tell these invaders to get out","commenter_a":"Let him fly his flag, this is America","post_message":"There is nothing threatening about an American flag.  He wants to show his pride for his country, let the man!  Do you think he should be able to fly his flag?"},{"comment_id":"10154284968796336","commenter_b":"Because an orange narcissistic with a fake wig is better","commenter_a":"Because he promises free stuff, and doesn't say he's gonna take your jobs, but you'll lose your wealth if you try and make something of yourself! Both democrats running are a joke!","post_message":"BREAKING NEWS: Fox News projects Bernie Sanders as the winner of the West Virginia Democratic primary."},{"comment_id":"10154883119407969","commenter_b":"1. Asylum isn't the same status as refugee. 2. Kyrgyzstan isn't Syria Yikes.","commenter_a":"George. I hate to break it to you but your reporting is a little faulty! You said no Syrian Refugee ever did any harm to us? You clearly aren't familiar with The Boston Bombers. Both Syrian Refugees! BTW George, OBAMA BANNED MUSLIMS FOR 6 MONTHS IN 2011. ANY THOUGHTS?????","post_message":"WATCH: George Stephanopoulos interviews Kellyanne Conway about President Trump's immigration ban, countries not included and comments from Republicans on the order: @webpagelink"},{"comment_id":"10153184382439255","commenter_b":"History has lots of examples of jobs we don't want. Thank of all those guys running the gas chambers who were out of work when the Nazi Death camps closed. You are truly pathetic.","commenter_a":"Stunning. You're actually in favor of businesses shutting their doors, laying off people and possibly going under all in your vendetta against one man? You are truly pathetic","post_message":"A sign of victory."},{"comment_id":"10154165693441748","commenter_b":"wanker","commenter_a":"Was it this way? @webpagelink","post_message":"lol"},{"comment_id":"1003724273013669","commenter_b":"This woman is dumber than a box of rocks!","commenter_a":"freaking nut case!","post_message":"Dems know where to get their votes..."}]
