[{"comment_id":"10153516000908984","commenter_b":"If they want want to stay in America, they should have to obey our laws","commenter_a":"Give them all a one way ticket to Iraq. Let them embrace their Shariah Law and the ISIS.","post_message":"I have to admit, I was quite startled when I saw these numbers. It seems that a real problem could be brewing... Is Sharia law in America a major concern of yours?"},{"comment_id":"10153669076314641","commenter_b":"Stop immigrant in Europe","commenter_a":"ISIS/ISIL/ the so called religious GROUP they r not MUSLISMS they created by americans & isreal 2 blacklash islam! ABOUT JAHADY JOHN as his from where he born said AN \"ANIMAL A DOG\"","post_message":"\"Jihadi John,\" who may have been killed in a U.S. airstrike, is a Kuwaiti-born, middle-class Londoner."},{"comment_id":"874546065914187","commenter_b":"Buy a boat move in land !","commenter_a":"Not just act, but act urgently. Right now, it's all but inevitable that there will be some serious sea level rise from melting glaciers over land.","post_message":"Barack Obama is right. It's time to act. Like ATTN: for coverage of climate change and the environment."},{"comment_id":"10152965778679641","commenter_b":"Nigeria should not only recall her ambassador but,should ask all indonesians to leave within 7days. Including \"INDOMIE NOODLES\" A Nigerians should stop patrpnizing INDOMIE NOODLES and anything associated with Indonesia","commenter_a":"I guess you better think twice before messing with illegal drugs in Indonesia.","post_message":"Indonesia executes six people, including five foreign nationals, by firing squad; Brazil and the Netherlands recall their ambassadors in response. @webpagelink"},{"comment_id":"10156776105275354","commenter_b":"Difference between American and European women...","commenter_a":"And we pay $260 billion a year for our government.","post_message":"CHAOS IN AMERICA'S STREETS..."},{"comment_id":"1011635658879674","commenter_b":"And this bimbo is our Sec of State😂😂😂😂 No wonder the world is laughing their asses off at America if this is the best we can do","commenter_a":"And thinks the idiot he works for had ANY real experience when he was put in office. Trumps runs a global business","post_message":"When it comes to meeting the constitutional requirements to seek the nation’s highest office, Donald Trump appears to have all the boxes checked: He’s older than 35; he’s a natural born citizen, and he’s lived in the U.S. longer than 14 years. But for John Kerry, constitutional requirements aren’t enough. Because Trump does not believe in global warming, he, and all “global warming deniers,” are automatically disqualified. @webpagelink"},{"comment_id":"10153083604111350","commenter_b":"They have noses ! Lori Askeland","commenter_a":"Please be sure to share that Etsy link when she does start a page up!! I'm interested in these adorable dolls!","post_message":"We just love the way this artist transformed these dolls -- they look like kids again! Click to check out all the awesome make-unders."}]
