[{"comment_id":"10153307488209087","commenter_b":"Read it again, silly bitch.","commenter_a":"Clinton was the one who started the whole \"birther\" movement against Obama. I wonder what she has planned for Sanders.","post_message":"“She is very much trying to put Bernie Sanders on the defensive, and it may be that she feels she has a chance to put this race away,” one Democratic strategist said about Hillary Clinton. “I think a lot of this is trying to end this campaign as early as possible and basically blow Bernie Sanders out of the race.”"},{"comment_id":"10153387072137869","commenter_b":"Agree, illegal must not be here in American Soil to live and receive any government aide at the first place.Gosh, our Social Security money and taxes we are paying will be given to these illegal people who enter here in our country. BTW, before you No Brain people forget, we have more American Citizens who are diasable, and have low income but working who needs help from our government and now, who gets more benefits, these illegal. Enough is enough.","commenter_a":"STOP THE REFUGEE PLAN! Obama you are shameful sir, putting Americans in harms way! At least France understands what we are up against! You are not a King! We need to cleanup DC and his cartel and vote them all out 2016. Implement term limits and background checks to stop the corrupt career politicians. We want leaders who will enforce our CONSTITUTION the SUPREME law of the land. Enough is enough! Vote Donald trump 2016","post_message":""},{"comment_id":"1555862094712251","commenter_b":"@username your mom should be happy because I will leave the country","commenter_a":"@username and by the way why is he paying his staff 12$ an hour??","post_message":"\"If you're both screaming at each other, the viewers won't be able to hear either of you\": Bernie Sanders and Hillary Clinton trade back-and-forths on minimum wage.   Live updates from the #DemDebate: @webpagelink"},{"comment_id":"1490217797705011","commenter_b":"She's not a Christian,the BIBLE says we will know them by their fruits , her fruit is rotten !!!","commenter_a":"That is because liberals are REALLY, REALLY STUPID!!!","post_message":""},{"comment_id":"10153829963431130","commenter_b":"@username The two go hand in hand. you would have to post a naked pic to really prove you point but I doubt that is going to happen. She has blubbery arms and obviously fat hips and thighs.","commenter_a":"She looks amazing. I am a size 6 and I don't look that good naked. She seriously has a bomb AF body","post_message":"“This is for anyone who has ever been called FAT.\""},{"comment_id":"10153238798269255","commenter_b":"OMG! Saved from the menace of foreign wine!","commenter_a":"Hahahahahahahaha.","post_message":"Dummy."},{"comment_id":"10153608158096336","commenter_b":"Takes all kinds of a--holes to make up this world and he/she is certainly the biggest one!!!","commenter_a":"Why is this getting news? It's not mandatory to tip. If you don't get good service you don't tip. Shut up, stop whining and do right by the next customer.","post_message":"A Rutgers University student who is waiting tables at a Jersey Shore restaurant this summer to help put herself through school was given no tip on a $112.03 bill and instead a taunting message."}]
