[{"comment_id":"10156112421560293","commenter_b":"LIFE is what they should get. turn their a**holes inside out by the sisters...","commenter_a":"These people should be charged with sexual slavery of a minor. They should have a very long prison sentence.","post_message":"Phone calls about possible human trafficking and a missing teenager led Tuscumbia police to arrest these three suspects:"},{"comment_id":"601518073347996","commenter_b":"@username she won't. Madame President!","commenter_a":"Before you write him off, remember mcain was all bug out of the race, and he ended up getting the nomination, and Dr Carson is a better man than mcain for sure","post_message":""},{"comment_id":"10153457248972464","commenter_b":"0NE VOTO OVER 2/3 DO OK DEAL (WE THE POEPLE DO) WILL KICK YOU OUT IF YOU VOTO FOR IT NO RETIREMENT PUT YOU IN obamacare !!!!! TRUMP 12016","commenter_a":"Ted, this is one thing that you are exactly correct on !","post_message":"The #IranDeal is a catastrophic mistake. Help stop it: @webpagelink"},{"comment_id":"10154721377651320","commenter_b":"Don't forget Al Sharpton hanging there too.. shes a joke!","commenter_a":"Really ? So how do you handle having Jay Z in the Whitehouse with the crap that comes out of his mouth that he makes money off. Shaken to your bones ?","post_message":"Thoughts?"},{"comment_id":"1045180198948491","commenter_b":"Yeah @username all seemingly Noble reasons however... Trump is a sleazebag so regardless of whatever Noble reasons you may have... The end result is still the same. Let me explain to you about how Germany does things. They have what's called social democracy. Everybody gets Healthcare everybody gets an education not just the wealthy. Donnie's cabinet controls more wealth then 95% of the country and you honestly believe he is going to do what's best for America. You're a bigger fool than I could have imagined","commenter_a":"You people are more ridiculous than I ever imagine... What are you think she's going to do privatize public education... The woman barely has a clue as to how the education system works in the first place she has no real understanding of Education in general and yet she's going to revolutionize education in America... Sure she is... Another far-right right hair-brained scheme to put dollars in somebody's pocket","post_message":"Ignore the noise!"},{"comment_id":"10154160813994657","commenter_b":"She is a criminal","commenter_a":"She's a disgrace, so are the people that support this nonsense","post_message":"Playing by her own rules?"},{"comment_id":"10154715866881077","commenter_b":"A real woman would provide a chicken pot pie, just saying...","commenter_a":"Kiss my what? Real women can provide their own and don't need any man. After all, I have done just fine on my own with my 2 special needs children (because their father wasn't any sort of real man: his moto provide, but beat and refuse basic needs or the right for me to work) That being said real men and woman work together to get through life together. Men nor women are above one another. This billboard only assists in the purpose of one being better than the other and undermine equality, which we have been fighting so hard for.","post_message":"What do you think about this billboard?"}]
