[{"comment_id":"10153842177281636","commenter_b":"In other news, unelectable man set to win another election.","commenter_a":"hahahahaha where are the haters now? suckers!","post_message":"BREAKING"},{"comment_id":"10153067823099411","commenter_b":"My respected fellow u explain very nicely like a poet and blame to muslim now one question who attack on Afghanistan who is killing innocent people in Pakistan by drawn attacks who is killing Muslims in burma. who is killing Muslims in Africa,and one thing listen Islam is the religion of peace not terror first study islam than make justice infront of me 10 cristians got Islam its not the issue main point is that dont try to impose religion war make the world peaceful place not hell thank you","commenter_a":"Copy and paste this on ALL muslim stories! Flood them with the truth! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The underwear Bomber was a Muslim The U-S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bafi Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Muslims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The Besian Russian School Attackers were ...","post_message":"Hundreds of thousands have flooded the streets of Chechen capital of Grozny in a rally against the publication of the Prophet Muhammad by Charlie Hebdo magazine. The demo, dubbed to Prophet Mohammed, was organized by region clerics and united muslims from various regions of Russia."},{"comment_id":"10153829550465575","commenter_b":"Go home Cruz we want trump !","commenter_a":"Trump is a strong supporter of the Second Amendment! This post is another poor attempt to win votes for Cruz. If Killery or Bernie win the Second Amendment is in trouble as will be the first. I am sure the Feds are wanting to shut the internet down so we can't inform each other on what they are up too. Lets face it! The internet has shown America how corrupt our Government has become. Without it we would never have known.","post_message":"These are the lies that TRUMP is referring to. . . ."},{"comment_id":"1169952976350143","commenter_b":"Nope. I have worked in Criminal Court, and this was battery.","commenter_a":"Yup","post_message":"POLL: Should charges be dropped against Donald Trump's campaign manager Corey Lewandowski? (VOTE NOW)"},{"comment_id":"10153234639738701","commenter_b":"Portland should be really embarrassed","commenter_a":"Really??? With all the real people who have contributed their time and energy to the Parade over the years all they can come up with is a old smelly piece of rug???????????????????","post_message":"Just in case you were starting to think Portland's obsession with the #pdxcarpet was over..."},{"comment_id":"982153291907152","commenter_b":"The wall wont be anywhere as effective as you think. All it will do is provide more cover for traffickers.","commenter_a":"Texas here! We NEED THAT WALL!! 1 million dollars worth of drugs just confiscated last week that came from Mexico! Happens ALL the time! It must stop!","post_message":"Watch: Donald J. Trump addresses the American Legion National Convention in Cincinnati, Ohio"},{"comment_id":"10153588638028203","commenter_b":"Really an evil woman. Whether intentional or not. Please God, open her eyes and heart.","commenter_a":"This one is heading for hell also .","post_message":"Nancy Pelosi: Planned Parenthood videos are a 'distraction' @webpagelink"}]
