[{"comment_id":"10153245155862550","commenter_b":"Candace, those who are offended by the American Flag can move!!! HAPPY INDEPENDENCE DAY Ladies!","commenter_a":"I hope they catch them...my ancestor is buried there. And who knows...some of those soldiers that they dishonored are probably non-white....my ancestor is NA. All lives matter....","post_message":"#BreakingNews Update: The Durham Police Department is investigating after a Confederate memorial in Maplewood Cemetery was vandalized.  More details here: @webpagelink"},{"comment_id":"10152797088006051","commenter_b":"Burn em all down. And roast a pig in the process.","commenter_a":"That is deplorable. He is entrusted to safeguard civilians, he does not have the right to pick and choose based on his personal beliefs and bigotry. One cannot condemn an entire religion because of a group of extremist radicals. EVERY religion has its bad...Catholics raping little boys, Christians murdering and blowing up abortion doctors and clinics. With the hateful logic all mosques should burn, burn all churches as well, right? I so sincerely hope he is removed from his station. Hate begets hate.","post_message":"This fireman tweeted out the first thing that popped into his head when he heard that an Islamic Center was on fire."},{"comment_id":"871266669599749","commenter_b":"Liars lie","commenter_a":"It's odd how no one in the comments section mentions the fact he was beaten over and over again. Good one, anglosaxon humanity!","post_message":"'We're gonna teach you about great American sex'"},{"comment_id":"10152713060892623","commenter_b":"Those disgusting guys would not have made it off the beach if I was there. I know I'm just a women but I would hv done everything I could to hurt them","commenter_a":"I don't understand why they did nothing? ! I think I would have screamed, throw things at them, run for help, SOMETHING!","post_message":"'There’s hundreds, hundreds of people standing there. Watching, looking, seeing, hearing what’s going on.'  Police say spring break in Panama City Beach will change big-time after video of an alleged gang rape went viral:"},{"comment_id":"10153709197621336","commenter_b":"Was he having a stroke?","commenter_a":"Billynyvy Martinez","post_message":"WATCH: One Southwest Airlines employee could barely get through his safety spiel without nodding off and slurring his words."},{"comment_id":"10153655296938854","commenter_b":"Kerry is no better than anyone else, if he was involved...Then buddyboy...fess up. This whole situation is starting to smell like Watergate. Where's Woodward and Bernstein...Let them have a crack at it!!! Somebody needs to tell Trey Howdy you have full reign, do whatever you need to do, just get to the bottom of this!! And I'll bet you BARACK OBAMA'S NAME is all over it, just like Richard Nixon's was in Watergate. The major difference between the two is that PEOPLE DIED IN BENGHAZI. And just to show the impertinence of Hillary when she said, 'What difference does it make now?!!' The difference is you Communist is that AMERICANS DIED YOU HEARTLESS WITCH!!","commenter_a":"Elijah Cummings is one of the dumbest mf'rs on this planet....voted for by a large number of even dumber mf'rs in his illegally gerrymandered district. He is so stupid, that he has no business in congress, and along with the rest of the liberals in Congress and the white house, he should be swinging at the end of a rope. He knows what he's done....we know what he's done.....","post_message":"Elijah Cummings: “Shockingly Disrespectful” To Subpoena John Kerry About Benghazi…"},{"comment_id":"10153218446741051","commenter_b":"she wont care, she has another kid to take her spot. i bet she will continue to see him, and probly get married. sick nasty world!","commenter_a":"That is one sick family hope that mother feels real good abouit that sex, it cost her daughter and grandchild[s life.","post_message":"A pregnant lady walked in on her husband with another woman. When she realized who the woman was, she killed herself."}]
