[{"comment_id":"10154883119407969","commenter_b":"1. Asylum isn't the same status as refugee. 2. Kyrgyzstan isn't Syria Yikes.","commenter_a":"George. I hate to break it to you but your reporting is a little faulty! You said no Syrian Refugee ever did any harm to us? You clearly aren't familiar with The Boston Bombers. Both Syrian Refugees! BTW George, OBAMA BANNED MUSLIMS FOR 6 MONTHS IN 2011. ANY THOUGHTS?????","post_message":"WATCH: George Stephanopoulos interviews Kellyanne Conway about President Trump's immigration ban, countries not included and comments from Republicans on the order: @webpagelink"},{"comment_id":"10154513663831051","commenter_b":"A bitch will always be a bitch","commenter_a":"I am sorry, what is her position in the administration? Oh right nothing.","post_message":"This photo of Ivanka Trump is sparking tons of controversy after people realized something about what's right there in plain sight. Look closer."},{"comment_id":"10157668685335389","commenter_b":"This woman is not!!","commenter_a":"I know women are going to hate me but if Hillary becomes president I can see why they didn't allow women to vote until the 1920s?.... women are overwhelmingly voting for Hillary over Trump this is how stupid most women are...MOST...not all... their kids and grandkids will be screwed for life","post_message":"Perspective."},{"comment_id":"10153278392893352","commenter_b":"Bitch,just ruined my happy day.","commenter_a":"She neither loved her children or deserve to be called their mother. Her hatred for her husband superseded the lives of her children.","post_message":"Mother ‘burned her three children to death and rang their father so she could tell him “Listen to their screams – they won’t survive” after he demanded custody in Belgium’"},{"comment_id":"10153985264843984","commenter_b":"She is hot","commenter_a":"You go girl","post_message":"Fox News superstar Andrea Tantaros just hit Instagram with an awesome selfie.  She's pretty, but it's the t-shirt that makes the pic amazing."},{"comment_id":"10154038430603812","commenter_b":"Arrogance is all she has left to run on.","commenter_a":"Differences are fine but you should not say that you are all so much better than the Republicans. I will not be voting for a person who thinks they are better than others!!! Shame on you","post_message":"“I think it’s time for us to have the kind of spirited debate that you deserve us to have. We’re so much better than the Republicans, but we do have differences and you deserve to know what those differences are.\""},{"comment_id":"10153644045081037","commenter_b":"Democrats do not want her. She can go away now.","commenter_a":"It's mean she's a Democrat, Yahoo.","post_message":"Should the candidates be concerned that a large portion of the “people” reading their tweets are fakes?"}]
