[{"comment_id":"1777601655795113","commenter_b":"Hilary is such a hypocrite. She is lighting the matches.","commenter_a":"But hey, Hillary over Trump for sure.","post_message":"The divisive rhetoric and encouragement of violence we're hearing from Donald Trump isn't just wrong—it's dangerous."},{"comment_id":"10153167789731336","commenter_b":"Wow only they can attack ppl...what happens to them a slap on the hand!!! When does all this stop? The violence is out of control.. I no if they would of attack my husband an I was in my car..probably would of ran them over or use the gun to scare them off.... Sad that no one helped!!!!","commenter_a":"This is why you carry. Been a few dead teens if it had been me.","post_message":"Caught on camera: A man was viciously attacked in broad daylight by a mob of teenagers while helping an elderly woman at a gas station."},{"comment_id":"869042603191993","commenter_b":"Good! Then STFU you two!","commenter_a":"So they jab him when they invite what's his face to address the congress, now they jab him with this letter to Iran. I mean are you kidding me?","post_message":"\"The letter sent on March 9th by forty-seven Republican Senators to the Islamic Republic of Iran ... is beneath the dignity of an institution I revere.\" - Vice President Joe Biden"},{"comment_id":"590256634486210","commenter_b":"Haha america was never great and with you or Hilary as our president it will continue to never be great !","commenter_a":" Vote strong Vote Trump","post_message":"This is only the beginning. Hillary is CROOKED! She is not capable of making America great again. Sadly, she would do the opposite."},{"comment_id":"864523933643860","commenter_b":"Judy. Are you really that stupid? She's a doormat that stayed with a moral less husband for decades just for power. You have low standards.","commenter_a":"Hillary is such a threat to them, they will do anything to hurt her.","post_message":"“Secretary Clinton used one email account when corresponding with anyone, from Department officials to friends to family. A month after she left the Department, Gawker published her email address and so she changed the address on her account.” -Clinton attorney David Kendall"},{"comment_id":"10152813780680950","commenter_b":"Kill the devil baby it comes from a rapist. The seed of evil grows within her.","commenter_a":"EVERYONE SHOULD REMEMBER U WERE ALL A FETUS AT ONE POINT TOO, MAYBE SOMEONE DEBATED ABORTIONING U WHEN THEY WERE PREGNANT, BUY UR HERE!!! I BET ALL U PEOPLE ARE AGAINST THE DEATH PENALTY TOO.....DAMN HYPOCRITS DONT WANT TO KILL AN ADULT BUT U WANT TO KILL A BABY!?!?!?!?","post_message":"In Paraguay, abortions are banned in all cases — even rape — except when the mother's life is in danger."},{"comment_id":"557086307813348","commenter_b":"AHHAH u need a matching one","commenter_a":"@username one for mal","post_message":"That pose though"}]
