[{"comment_id":"10157030256485615","commenter_b":"'The Tennessee hardware store owner who banned 'the homosexual people' and posted a 'No Gays Allowed' sign at his business last year recently constructed an outhouse that he's calling a 'Transgender Bathroom.' @webpagelink","commenter_a":"yeah he test each person that comes in his store","post_message":"And yes, he sells 'choose god or gays' hats, too..."},{"comment_id":"775477502501275","commenter_b":"I agree with Mark Colwell.one muslim won't go against the other.they are all for crap..","commenter_a":"Gee, really, and what would they do if he made them angry? Another Dem moron speaks in defense of her Beloved Leader and what she says is as stupid as they both are. How do these people get through even elementary school being this dumb?","post_message":"And this is what Democrats think about terrorists... #facepalm"},{"comment_id":"10153557927894411","commenter_b":"they should allow rocket launchers and rpg's to blow out anyone who draws out the frigging gun","commenter_a":"We need to make sure movie theater workers all carry guns so they can pull one from their holster and save the day!","post_message":"BREAKING: One of the deceased is the suspect, who reportedly turned the gun on himself."},{"comment_id":"10152949136921130","commenter_b":"Instinct ?most times women don't know what they want","commenter_a":"This is why women are usually attracted to them. It's instinct. Beard equals protection and strong genes. Science is fun.","post_message":"It's just evolution."},{"comment_id":"10153139326127293","commenter_b":"just facts he was no hunter just by what was done and his lousey shooting . he had no business hunting.","commenter_a":"he didnt know what he was doing and the guides were obviously dirty.","post_message":"How a dentist who killed Cecil the lion shelled out $50,000 for the trip."},{"comment_id":"10156257244825725","commenter_b":"'Multiple woman.'","commenter_a":"Is that dan blizerian","post_message":"A man is accused of secretly recording himself having sex with multiple woman. One who was informed that she had been recorded didn't even know a sexual encounter had occurred ----> @webpagelink"},{"comment_id":"10153980841689062","commenter_b":"Good glad yall didn't. One thing you can't replace is a life/lives. Hopefully everyone understands","commenter_a":"'@username did u still go to Houston","post_message":"Hail is coming down with heavy rainfall off Beltway 8 and Antoine as heavy storms begin to move into the area. Stay safe out there!  Radars: @webpagelink Share your pics/videos: photos@khou.com."}]
