[{"comment_id":"10153229424353352","commenter_b":"What a crock of shit. She's a crazy bitch who needs life in prison.","commenter_a":"Postpartum depression is a real illness. This women obviously is in psychosis; not recognizing her action at the time. Praying for these babies, her husband and her. When she is in her right mind; she will have to live with this action for the rest of her life. Also, if her husband and doctors were aware of her illness; they should also be accountable. A women this sick should never be unattended with her children. I pray for these babies health.","post_message":"Army wife says she slashed throats of her three crying babies with kitchen knife to keep them from disturbing her Special Forces husband"},{"comment_id":"956349277815184","commenter_b":"To keep the bad guys out.....Tear down that wall and invite them in.","commenter_a":"This is why liberals suck, do as I say not as I do.","post_message":"ClashDaily.com"},{"comment_id":"1845364932419184","commenter_b":"Little girl go sit down and shut the hell up.","commenter_a":"she is an bitter root from the tree","post_message":"Not a good choice of words, Bristol."},{"comment_id":"10158119548295603","commenter_b":"We have to hate ILLEGAL immigrants.... GOT IT!","commenter_a":"Maybe it could be an anti-bullying lesson...? You know, if he says or does anything like he did THOSE OTHER TIMES... That we have recordings and videos of him... Doing horrible things.... And saying horrible things...","post_message":"Thoughts?"},{"comment_id":"1022737904430216","commenter_b":"Yuge piss on Shillery Clinton. Name ONE more disgusting pig who ever lived?","commenter_a":"Nobody kicks a dead dog. Hillary's attack shows that her campaign sees Cruz as a real threat. Ron Nehring, keep up the good fight.","post_message":"Ted Cruz: “John Kerry was not a little wrong, he was wildly, extraordinarily wrong. Facts matter. Science matters. Data matters.\""},{"comment_id":"10152969596402452","commenter_b":"Exactly @username, you apply these same rule to your god daughters.😊","commenter_a":"No one cares about the children lol pets ftw!","post_message":"PET SAFETY: Arizona Cardinals player Tyrann Mathieu sits in an SUV with the windows rolled up on a sunny day in a new PSA about the dangers of leaving pets in a hot car. He lasted only eight minutes. WATCH: @webpagelink"},{"comment_id":"1107115119405265","commenter_b":"I've heard more sense coming from a crack head","commenter_a":"Can't these people realize somebody is going to have to pay for \"free school\"?","post_message":"ClashDaily.com"}]
