[{"comment_id":"659659264197547","commenter_b":"We all know why he said this... Statistically speaking illegal immigrants will vote Democrat.. This is another reason why they do not want voter ID... It is not racist to want voter ID... everyone carries an ID.. Again a narrative from the left, In 10-15 years will we will be a one party country... We will also have a single-payer system, so get in line and prepared to wait for your doctor because you are now dealing with the government which is like dealing with the department of motor vehicles.. We will also have 500,000 more Syrian refugees in this country, A pay for play with Soros, she is a puppet for him... All of our tax dollars will have to pay for these refugees and all of the entitlement programs, along with all of the illegal immigrants in the country currently... We are on our way to socialism, open ...","commenter_a":"Well, in the next three days you will see our crooked media , led by CNN and NBC , run all the dirt they can dream up on Trump and absolutely nothing negative on Hillary despite all the information. It's our last chance to get rid of corrupt Washington insiders like the Clintons. VOTE TRUMP !!!","post_message":"***SHOCK*** Days before presidential election, Obama is openly and blatantly thumbing his nose at the rule of law that governs American elections..."},{"comment_id":"655073504617242","commenter_b":"She will try anything, needs to get a life","commenter_a":"LOONY TUNES HILLARY...........GO HOME BEFORE TREY GETS TO YOU............","post_message":"The Clinton campaign thinks members of the electoral college should receive a national security briefing about Russia's involvement in the election before casting their votes for president.   Is this a good idea, yes or no?"},{"comment_id":"10153836657664714","commenter_b":"Sorry!!!!","commenter_a":"@username ...","post_message":"Pizza, chocolate and french fries all make the top 10."},{"comment_id":"10153479859171337","commenter_b":"Shut up hoe","commenter_a":"Love him. And you know what HE DONT GIVE A SHIT!!!! He tells it like it is. Everybody put your big boy or girl pants on and DEAL WITH IT!","post_message":"WHOOPS: Donald J. Trump made some inflammatory comments about Mexican-Americans, and they're coming back to haunt him..."},{"comment_id":"10153589265781782","commenter_b":"Honestly I don't care if she kills herself or what she does rot in hell ask forgiveness I don't care but the hurt she caused the family and the pain she caused that sweet innocent baby is my concern that lady is no concern of mine whatever happens to her happens I just pray peace to the parents of a baby that they don't have any more and she is accessory to that !!!","commenter_a":"I don't understand how any one can have sympathy for this lady she killed some ones child are you kidding ...there ain't enough stress in the world to cause you kill someone else's child kill yourself for God sake !!!!!!","post_message":"DAY CARE DEATH: Jonathan Cooper goes through the court documents that say a Noble day care operator, who now faces a murder charge, admits to throwing and dropping a baby last week. @webpagelink"},{"comment_id":"10153622480508690","commenter_b":"Nna, infact you get am","commenter_a":"And this is not a problem at all to the world peace, unless when Israel bombs Hamas terrorists, then it will be a problem for the world peace. Hehehehehehehehe One good thing people should learn is that Muslims from the unset, have always wanted to dominate. Whether Muslims like it or not, Israel of today will never succumb to them again. If Israel is the problem of the world, then Palestinians should try and leave the land of Israel and let's see whom Israel will kill again. Thousands are dying in Syria, Yemen and Iraq, yet it's not a problem to the world peace. Tell that to the birds. Never ever succumb to the demands of any Muslim community, if u give them one today, tomorrow they will demand for 3. Always push them back or they will over run u. This is why i pity Europe,maybe they are not ...","post_message":"Syrian government has conducted nearly 7,000 air strikes during the month of July, according to the Syrian Observatory for Human Rights, making it the most intense bombing reported in one month since the beginning of the conflict in 2011. @webpagelink"},{"comment_id":"10152877245671051","commenter_b":"The woman with the prosthetic leg should be able to get a first floor apartment as soon as one is available, and the other person should be evicted.","commenter_a":"Boy there are some sick people out there! I would evict her!","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."}]
