[{"comment_id":"1628105883873422","commenter_b":"And your a bitch DANI KAYE","commenter_a":"Sandy if you like him so much. Why don't you just go and live with him at the white house.","post_message":"Tomorrow, we will leave behind a president who has carried himself with quiet dignity for eight years and replace him with a man who is neither quiet nor dignified."},{"comment_id":"10154791254721756","commenter_b":"And cue the superficial bitch...","commenter_a":"He's ugly as fuuuuck though. Great actor though... Turkey neck goes gobble gobble","post_message":"\"It's a perfect role,\" Jeffrey Tambor says. \"... I thought I was gonna do Lear, but I'm gonna do Maura.\" Season 3 of Transparent comes out on Friday."},{"comment_id":"10153260713478690","commenter_b":"Scrw U, Scrw Saddam, and Scrw Isis... Saddam killed 300,000 innocent kurdish moslems most of them by mass graving and gassing them, u pathetic peace of scm.","commenter_a":"Sadam was much better than ISIS...","post_message":"The statement said that a lorry loaded with around 20 gas canisters exploded on a highway between the Iraqi city of Mosul and Syria, as Kurdish fighters were being deployed following an offensive against ISIL fighters. @webpagelink"},{"comment_id":"10153866703120575","commenter_b":"Yeah she has hate written all over her face. Smug bitch","commenter_a":"Megyn's dislike of Trump is obvious.,and a bit over the top, clouding her Demeanor, Neutrality, and Professionalism.,she may have to pay the Piper if Trump goes all the way,!! Though, I don't feel Trump is a Vengeful person,!!","post_message":"66,000 Signed Petition to Boot Megyn Kelly from FOX News Debate!"},{"comment_id":"10153523680568606","commenter_b":"God Bless ♡ Hearts broken♡","commenter_a":"It time to vote trump","post_message":"The remains of the four Marines gunned down in the Chattanooga attack were transported through Northern Virginia. @webpagelink"},{"comment_id":"10152777855631717","commenter_b":"Totally disgusting, the bastard should be locked up for life!","commenter_a":"Are you serious? Time to pull them off the bench!","post_message":""},{"comment_id":"1461062437286833","commenter_b":"Glad he found out before she gave him a STD nasty hoe","commenter_a":"who cares","post_message":"Brutal. (From Elite Daily)"}]
