[{"comment_id":"606991596121137","commenter_b":"BLUE LIVES MATTER ! AMERICA SAY'S LOAD THEM UP , HEAD THEM OUT ! NO MORE ILLEGAL IMMIGRANTS BY AIR , LAND OR SEA ! NO MORE NICE GUYS , WE NEED THE RIGHT GUY TO GET THIS JOB DONE ! TRUMP IS THE ONLY CANDIDATE THAT WANTS TO DO THIS JOB / THAT CAN DO THIS JOB , VOTE TRUMP ! BUILD THE WALL AND NEVER FORGET WHAT verry husINsein oBUMa , Killery AND THE DEMislamOCRAPS HAVE DONE TO AMERICA ! PASS IT ON !! MAKE AMERICA SAFE AND GREAT AGAIN , IT'S YOUR VOTE FOR TRUMP THAT WILL MAKE AMERICA SAFE AND GREAT AGAIN !!! THERE IS NO PLACE FOR SHARIA LAW ANYWHERE IN AMERICA , THE CONSTITUTION IS THE LAW OF THE LAND EVERYWHERE IN AMERICA !","commenter_a":"Mr. Trump has this vote locked down in Florida ... hopefully the senators will get back to work soon because Mr. @username starts work on day 1... congress would be smart to have legislation ready to go across his desk","post_message":"GOOD MORNING AMERICA! New CBS poll just released. A strong indication that we are on our way to MAKING AMERICA GREAT AGAIN! Lets keep up the momentum, and have a great day!"},{"comment_id":"1128902297147109","commenter_b":"go home...STFU!","commenter_a":"Kasich you are an idiot!!!!!","post_message":"John Kasich said of the idea: \"It doesn't feel right.\""},{"comment_id":"10153313439013984","commenter_b":"Sick bitch...you go girl..to hell","commenter_a":"She fed the hungry so all you people that have never been hungry think about that you idiots some people don't know what its like to have an empty belly so you go girl","post_message":"The disgusting hatred from the left never ceases to amaze me. Do you support this young woman?"},{"comment_id":"10153475201369170","commenter_b":"Unreal. Liberal democrats are NOT AMERICANS!!","commenter_a":"And how many admirals and generals have been \"retired\" for their conservative, pro strong military views during the current administration?","post_message":"How can we have possibly let it get to this point?"},{"comment_id":"686077748183930","commenter_b":"so many fucking idiots in america, cant you arseholes get your shit together and just kill each other off ?","commenter_a":"He needs to normalize his fucking hair. I can't trust someone who can't accept the painful fact that his hair is gone. Fucker has been lying to himself for years. Perfect example of his personality.","post_message":"Putin talked to reporters over the weekend about his first phone call with Donald Trump..."},{"comment_id":"1271166009570419","commenter_b":"Get some sleep pretty lady","commenter_a":"The story that will never die.","post_message":"The DNA analysis that prompted a Colorado prosecutor to exonerate the family of 6-year-old beauty queen JonBenet Ramsey in her 1996 murder was not as clear cut as she portrayed it at the time, a newspaper reported on Friday."},{"comment_id":"1720347271558389","commenter_b":"What a pathetic slut !!!!!!!","commenter_a":"Just another Wacko;showing her ignorance.","post_message":""}]
