[{"comment_id":"1515851598455693","commenter_b":"That's ok i love the 6 i have","commenter_a":"I REALLY HATE TATTOOS BUT THIS IS GOOD","post_message":"It's not just about the conversation — it's about providing tangible support and help too."},{"comment_id":"410802195930600","commenter_b":"Stupid.. Beyonce has enough awards, no way in hell I would have broken it to give half to Beyonce.. Adele is so much more talented..","commenter_a":"It was ADELE'S moment - and BTW, that narcissistic fur hag is NOT a queen - except maybe of BAD TASTE","post_message":"Adele may have broken her Grammy award in half for Beyonce."},{"comment_id":"10150520192784999","commenter_b":"Muslims are killling every one left and right, with in and out side religion people. They should not live in the well of ignorance and they should accept other cultures. Most of the muslim managed countries are in bad shape, their contribution to the science and technology is zero. All the gulf countries were on donkeys before and now with oil they have money but the cannot compete with any one as they live with women, wine all the time. They fund money to third world country people to kill others and they sit and watch. No religion is bad, all we need is education and awareness.","commenter_a":"Who is #muhammad(PBUH) : He is the one who defended the rights of all humanity 1400 years ago. He defended men's, women's and children rights He commanded and fostered the love between relatives and neighbors.He established a coexistence relationship between Muslims and Non-Muslims He organized the relationship between the members of the family putting duties on sons and daughters towards the parents He fought injustice, called for justice, love, unity and cooperation for the good. He called for helping the needy, visiting the patients, love and exchanging advises between people. He prohibited (by orders from God) bad manners such as stealing, lying, torturing and murdering.He is the one who changed our lives and manners to be better. A Muslim doesn't steal A Muslim doesn't lie A Muslim doesn't drink alcohol. A Muslim doesn't commit adultery A Muslim doesn't cheat A Muslim doesn't kill innocent people A Muslim doesn't harm his ...","post_message":"How governments and other authorities in Mideast countries responded to the new Charlie Hebdo Officiel cover."},{"comment_id":"1107115119405265","commenter_b":"I've heard more sense coming from a crack head","commenter_a":"Can't these people realize somebody is going to have to pay for \"free school\"?","post_message":"ClashDaily.com"},{"comment_id":"972471592821368","commenter_b":"Don't beleave this is west point?","commenter_a":"yes they are acting like beyonce,stupid","post_message":"The image has spurred questions about whether the gesture violates military restrictions on political activity."},{"comment_id":"912506822117747","commenter_b":"Grow up racist","commenter_a":"Thanks Fox, again you nailed it..","post_message":"Just when you thought #FoxNews couldn't get any crazier... @webpagelink From (Y) Counter Current News - MBD"},{"comment_id":"10153203581878984","commenter_b":"Didn't a bunch of people get in trouble for using their own private email accounts for using government email accounts during an election. Why is it different with this woman she should have to open up every single email ever written or received just because it was her so called private account she did government business on it so that exams her from any protection","commenter_a":"God Bless you, Trey Gowdy !!!","post_message":"Hillary’s private emails could contain the smoking gun regarding the scope of her involvement in the Benghazi attacks… Send an email to Rep. Gowdy demanding answers from Hillary and the State Department!"}]
