[{"comment_id":"541791876011392","commenter_b":"Isnt it still a punishable offense in the eyes of the law if it is then the people who are doing this should be arrested and jailed and fined of course i meen after they get their ass's stomped .","commenter_a":"Needs a beating","post_message":"This liberal thought he could burn an American flag, big mistake.  That's what happens when you disrespect our flag. If you don't like it… LEAVE.  Do you support these patriotic students?"},{"comment_id":"918834358153905","commenter_b":"It's not liberalism it's victimism. Justifing everything you do and tring to force others to change by acting like everything that happens is victimizing you","commenter_a":"Agreed.","post_message":"The latest COMMENTARY from Matt Walsh:"},{"comment_id":"595052750663656","commenter_b":"So RACIST I used to really like her. Now o can't stand her..","commenter_a":"And we don't want to hear you talkm","post_message":"THE VIEW’S Whoopie Goldberg To Co-Host: “This Is Why Black People Don’t Wanna Talk To White People” [VIDEO]"},{"comment_id":"10153800001886336","commenter_b":"OK all immigrants should loose there language and culture. Derp","commenter_a":"Gop crybabys don't ask me questions the Fox news debate asked basically the same questions does Reince Priebus realize that was the only gop debate to be simulcast on a Spanish network effectively telling Spanish Americans we don't care about you","post_message":"Reince Priebus  told Fox News that aside from making sure “CNBC isn’t hosting and moderating another debate with our candidates,” the Republican Party is going to review “everything” about the debates. @webpagelink"},{"comment_id":"10153739704671051","commenter_b":"Dumb ass","commenter_a":"For recreational usage YES, only and dope does dope for no reason other than to escape reality. For MEDICAL use, HELL NO, it should be 100% illegal. BUT, that is not the real issue here..... the REAL issue is, THE LAW Follow it, or pay the price, SIMPLE","post_message":"Do you think marijuana usage should be illegal?"},{"comment_id":"10153359134519060","commenter_b":"Oh! You are a geographer or a history specialist Scott. Sounds good. For sure you know Europe is more than UK, Latin America is more than Mexico, and that Egypt is in Africa. Glad to know you really understand the reality and the specifics outside US. It is rare.","commenter_a":"When I read \"Latin America\" as a generalization in an article, I tend to be skeptic. You can not compare Guatemala with Chile, Argentina with Mexico. Completely different cultures, histories, corruption level, etc, although all of them are Latin American countries.","post_message":"Crisis in Guatemala: the vice-president quits, the heads of the central bank and social-security institute are arrested and three ministers sacked. Corruption scandals are two-a-penny in Latin America. Few inflict this much damage @webpagelink"},{"comment_id":"10153839252314087","commenter_b":"@username He was a natural born citizen of the US and so was the LA Shooter who is from New Albany, Indiana. Why do you hate the Constitution, there is no racial component to citizenship. We must stomp out Christian and ISIS terrorism!","commenter_a":"I agree we must stomp out Jihadi and Christian Fundamentalism. The LA shooter was a Hoosier (Indiana). A disgruntled white man with fascist leaning aka the type of voter Loser Cruz tried to get but the Trumpster got. Is this un- PC enough for you gusano?!","post_message":"\"Enough is enough. What we need is for every American -- Democrat and Republican -- to come together, abandon political correctness, and unite in defeating radical Islamic terrorism,\" Ted Cruz said after the Orlando attack."}]
