[{"comment_id":"569782366553109","commenter_b":"Christ. Any more soft lobs? Take off the freakin kid gloves already","commenter_a":"falling asleep?","post_message":"Tom Price, Donald Trump's pick for secretary of Health and Human Services, is expected to face tough questions on Obamacare, his financial disclosures, drug prices and more in his appearance before the Senate Committee on Health, Education, Labor and Pensions."},{"comment_id":"10153722896533690","commenter_b":"How Iran can Accept refugees while Iran is very poor country and its people are migrating to Europe","commenter_a":"Europe is christian place so send rufugees there,, iran is a shia muslim country, so send refugees there. Why don't you send these refugees to sunni dominating countries like pakistan, turkey??????","post_message":"Opinion: \"Of the more than four million Syrian refugees, almost half of them, the largest concentration, have gone to Turkey. In addition to Turkey, Camp Zaatari in Jordan has received tens of thousands of Syrian refugees. There are also Syrian and other refugees scattered throughout the Arab and Muslim world, particularly in Lebanon. There is one glaring case of a Muslim country that is heavily involved in Syria but has yet to accept a single Syrian refugee, and that is the Islamic Republic of Iran.\" Hamid Dabashi, Hagop Kevorkian Professor of Iranian Studies and Comparative Literature at Columbia University, writes for Al Jazeera."},{"comment_id":"1122771727815880","commenter_b":"I wouldn't want that pussy fighting next to me.","commenter_a":"Draft Dodging Coward","post_message":"Donald Trump is just another Republican chicken-hawk. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153469277832093","commenter_b":"You know right off the back it wasn't a girl bc the rims aren't scraped from the curb lol","commenter_a":"Jeffrey id say that his parking skills are top notch.","post_message":"File this under the 'smart criminals' tab. @webpagelink"},{"comment_id":"10153266523095927","commenter_b":"Should have BABY MURDERER on the FRONT of that DRESS!!","commenter_a":"DISGUSTING!!","post_message":"Dress is part of a social media campaign that encourages women to share \"POSITIVE STORIES about their abortion experience ...\""},{"comment_id":"10153935705086756","commenter_b":"@username And millions of flys eat shit daily.","commenter_a":"I agree with Paul Ryan. I didn't want him to have the job either. Or any other job. Anywhere.","post_message":"Ryan has said at least three times in the past year that he did not want the job. Now it's his."},{"comment_id":"10155225064836509","commenter_b":"I always wondered how these bathrooms would cleaned. A typical janitor would violate the law twice if he/she cleaned these bathrooms. Or maybe they just don't get cleaned at all","commenter_a":"Hillary's a racist bigot!! She's disgusting! Calling all black people \"Super Predators\" is beyond uncalled for and her beliefs and policies have shown her disdain for the community. Only racists and bigots could support a lying criminal old white lady like her. We arent in the 60s anymore, the \"good 'ol Goldwater\" years are over. Ya know Hillary, you remember saying you were a \"goldwater girl\"?! The same group that opposed the civil rights movement?!!","post_message":"JUST IN: A federal judge has temporarily blocked the University of North Carolina from enforcing the state's so-called \"bathroom bill\" from applying to three transgender plaintiffs."}]
