[{"comment_id":"543511749143213","commenter_b":"@username hell don't exist kid you will rot just like eveyone else when you die and are burried","commenter_a":"we aren't animals anymore we used our intelligence to go beyond that, why would we want to back track? I wouldn't want my kids seeing them sexual or not. Or my husband sexual or not. No matter how much we try to \"not sexualize\" them, they always will be and there will be women and men who will sexualize them. It's not hard to leave a fucking shirt on","post_message":"Women everywhere are freeing the nipple  but Facebook doesn't want us to show it. #MicCheckDaily"},{"comment_id":"10152821814048717","commenter_b":"Lmao truth hurts!","commenter_a":"good job Rivas. leave the cheaters behind","post_message":"After helping the New England Patriots win the Super Bowl, Darrelle Revis has decided to go back to New York. The cornerback agreed to terms with the Jets Tuesday, his agent said. @webpagelink"},{"comment_id":"1439684252723748","commenter_b":"Hilary is definitely not as bad. You got complacent about gore in 2000 and inflicted gwb and eight years of mayhem on the rest of the world","commenter_a":"Lord have mercy on everyone in the world if he's elected president. Somebody keep that from happening - pleeeeeease ...","post_message":"Donald Trump is spiraling out of control."},{"comment_id":"579018038952469","commenter_b":"Safi Cedrick Varda this actually aired like today ..... in 2016!!!","commenter_a":"What was the point of this?","post_message":"They actually aired this."},{"comment_id":"10157410522280294","commenter_b":"Love these type of storms..","commenter_a":"Thanks for the pictures. Please stay safe. If you have reports of any damage please let us know","post_message":"Dark storm clouds roll into the Cleveland area"},{"comment_id":"1169723563063063","commenter_b":"SHES ONE HELL OF ALOT BETTER THAN THE TRANNY AMERICA HAS PARADING AROUND AS A WOMAN NOW! THE TRANNYS NAME IS MICHAEL! ODUMBASS LOVES HIS GAYS! DAMN THAT IS ONE BUTT UGLY GORILLA FAVED TRANNY! MELANIA HAS MORE CLASS IN HER CRAP THAN THE TRANNY HAS IN HIS WHOLE BODY! P.S. TUCK THAT SCHLONG TRANNY!","commenter_a":"Agree","post_message":"I agree!"},{"comment_id":"10154282807343984","commenter_b":"You need to think about the children you putting in danger ,it would be taking advantage of !!!!!!! NC don't back off","commenter_a":"@username my head hurts over all the rucus about this law. My suggestion was to make it ALL about bathrooms and leave the employment issues out of it. I was happy to see he is still standing by his decision to keep bathrooms limited to the actual sex you are physically. I have been amazed by the number of employers threatening to leave and all the other boycotts. At least I still don't have to worry about a man walking into the friggin ladies room. Urghhhhhh","post_message":"North Carolina has come under INTENSE criticism lately for its stance on the LGBT community. After weeks of outrage, the state's governor has just come out with a stunning announcement that ANGER many Americans.  Do you support North Carolina's governor?"}]
