[{"comment_id":"1285543264804515","commenter_b":"No, and unless her ancestors were Native Americans, they were illegals and traitors to the Crown.","commenter_a":"She's as ignorant as she is ugly, does she not know anything about American history for Christ sake.","post_message":"Someone should tell Ann Coulter cocaine makes you age poorly."},{"comment_id":"10153184314438984","commenter_b":"This lady is a disgrace to our country. She needs to retire or get voted out so she can get a real life.","commenter_a":"Nancy Pelosi needs to shut up. Who cares what she thinks. She knew what to expect of the speech, stay away. People were there to support the PM not to listen to her senseless sniveling.","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10154780331641072","commenter_b":"Nm wait for her to have this baby lmfao","commenter_a":"Exactly Kelly","post_message":"Giraffe Watch: Is today the day? April the giraffe at Animal Adventure Park is expecting a calf anytime. More: on.kgw.com/aprilgiraffe"},{"comment_id":"10155027451044411","commenter_b":"Boooo :) make them strong :) We kick your ass in Afghanistan... @username should respect other cultures and their traditions.. These Indian Muslims doing this due to their believes.. This is racism what is @username doing..","commenter_a":"What about you Russian whores bathing their babies in Ice cold water... shit heads @webpagelink","post_message":""},{"comment_id":"10153382960318717","commenter_b":"I used to not like Mr. Trump. Then started to like him...sort of. Now I dislike him again.","commenter_a":"He's a prick","post_message":"The New York Times is angry that Donald J. Trump mocked one of its reporters who has a physical disability: @webpagelink"},{"comment_id":"512454232283082","commenter_b":"To the person who said go back to Africa.... Pack your bags too & head back to Europe! Cuz white ppl ain't native to this land either. Dummy!","commenter_a":"Not worthy of my ear wax!","post_message":"Hip-hop legend Q-Tip is here talking about race and policing in America. Leave your questions in the comments."},{"comment_id":"1090391007723817","commenter_b":"Arrest the bum and let him drink the water","commenter_a":"A shame","post_message":"The city has confirmed 200 cases and 9,000 exposures to lead poisoning in kids under age 6."}]
