[{"comment_id":"10154284247599575","commenter_b":"Throw her in with the hardened inmates. Id love to see how \"pretty \" shed look then","commenter_a":"Oh god not another one...","post_message":"This bad girl is getting lots of social media love for her attractive mugshot.  Just keep in mind she's charged with aggravated robbery, kidnapping, first degree battery, hindering prosecution, and tampering with physical evidence."},{"comment_id":"910223922377697","commenter_b":"She a hoe messing with all them porch monkeys","commenter_a":"Narsha Gafar HAHAHAHHAHAHAHAH","post_message":"Before & After"},{"comment_id":"10154073349643132","commenter_b":"Piss off you twit and merry Christmas","commenter_a":"Why would you congratulate someone who goes out of their way to shame woman for pre-marital sex yet does it herself?","post_message":"Congratulations are in order for new mama Bristol Palin!"},{"comment_id":"1106010656085353","commenter_b":"Barf.","commenter_a":"Agreed @username.","post_message":"Seattle Seahawks players kneel together after a #beautiful win at home.  >> kiro.tv/SFvsSEAPhotos // >> @webpagelink  [Photo: Associated Press.]"},{"comment_id":"1243855252377391","commenter_b":"Jennifer, Donald trump doesn't care who you sleep with. Yes, it's better to vote GOP than to vote to import non assimilating Muslims who will cost a fortune and harm our citizens.","commenter_a":"I'm a Bernie supporter who's voting for Hillary whom I think is going to lose to Trump","post_message":"These names would be a huge draw in any feature film, but on Tuesday they lent their star power to another production -- the Democratic National Convention."},{"comment_id":"1800960313527053","commenter_b":"She should wait till 2024 after Trump can't beat her again...","commenter_a":"She can't even walk right. Go to you jail cell and rest.","post_message":"Did I ever tell you the definition of insanity?"},{"comment_id":"10153018136071130","commenter_b":"I think ikea is a great test to the relationship for sure. I've gone with many friends who argue with their SO the whole time, who later break up... Whereas me and my bf of almost 10 years have gone together many times and have a blast","commenter_a":"Jacob opppsss","post_message":"Attention couples: this store will make you want to kill each other."}]
