[{"comment_id":"10153061163329138","commenter_b":"Go home!!! We don't want the likes of you here","commenter_a":"We are here to stay and there's nothing you can do about it.","post_message":"\"Many of these folks may have not been to a doctor because they don't have health insurance or because they don't really understand how the system works,\" one Somali advocate says."},{"comment_id":"516205071910642","commenter_b":"The white lady isn't a part of the scam, but she made upwards of a million dollars in a year, okay ojay,we believe that the white woman's hands are clean, not!!!","commenter_a":"This a way to steal African children, a form of modern day slavery. African children was stolen from their parents over 400 years ago, and they were paid to do that then. What is wrong with you people?","post_message":"Watch How Thousands of Children Are Currently Being Stolen From Africa"},{"comment_id":"10153858888594474","commenter_b":"Actually, she needs to go to jail.","commenter_a":"Not soon enough!!!!! We might get Hillary so it will just be like having Obama in the White House.","post_message":"Let the countdown begin. Share if you're ready for the end of the Obama era!"},{"comment_id":"10153428290568487","commenter_b":"?? Do you think it while turn a woman into a fuck machine? Does Viagra turn men into drooling cock monsters?? WTF are you even talking about??","commenter_a":"Am I the only one with a slight concern that this could be used to spike women's drinks? Just a thought in the back of my mind....","post_message":"A FDA panel has recommended approving female Viagra for the market. Is it even necessary?"},{"comment_id":"10154630388634877","commenter_b":"why is anybody still giving Conway any attention at all, unless it is because she is an alien from another planet?","commenter_a":"Ummmm, maybe because she hasnt done anything","post_message":"Is Melania Trump not getting enough attention for being an immigrant herself?"},{"comment_id":"1072715589511885","commenter_b":"I would call him much worse than a monkey.","commenter_a":"That's insulting to monkeys the world over!!! Ann PLEASE think before bad mouthing the monkeys...","post_message":"VIDEO: Ann Coulter Just Created A HUGE Firestorm, Outrage after Calling Obama A  On National TV Ann Coulter is under attack over this.  Can we get 5,000 'LIKES' for Ann Coulter?  @webpagelink"},{"comment_id":"10153854379994486","commenter_b":"Criminal Hillary, silly Bernie out, Biden in without costing him a cent","commenter_a":"Good!","post_message":"If they're not panicking yet..."}]
