[{"comment_id":"449954205192873","commenter_b":"\"IF YOU CAN'T FEED'EM DON'T BREED'EM! Stop breeding all these kids you expect the taxpayers to feed.","commenter_a":"A border, by definition, is a division. Do they expect us to forfeit our sovereignty ?","post_message":"They think our borders create division..."},{"comment_id":"10153988476564255","commenter_b":"Who is this dumb bitch this must be Stacy dash sister","commenter_a":"Unbelievable!!!","post_message":"This is how Fox News celebrates Black History Month."},{"comment_id":"10155207761586509","commenter_b":"We don't do that to white people Bill....","commenter_a":"Just imagine if it was the other way around. They would have been met by heavily armed border guards pointing automatic weapons at them. They would have been put in handcuffs and leg irons and paraded before a judge and then be jailed for a ridiculous amount of time.","post_message":"Oops. 1,500 Americans accidentally floated over to Canada. @webpagelink"},{"comment_id":"10154016179049411","commenter_b":"Merkel admits multiculturalism in Germany a failure, yet continues to accept refugees @webpagelink/ After Muslim rape epidemic, Merkel admits Germany refugee crisis out of control. German Chancellor admitted Europe is 'vulnerable' and said countries do not have control of the situation @webpagelink @webpagelink","commenter_a":"Magyarország <3","post_message":"'If we cannot secure the outer border [of the EU], regardless of how costly or demanding that is, we will destroy the Schengen regime by ourselves'"},{"comment_id":"1234054046635197","commenter_b":"Mary Williams jealous of a Roger Ailes flunkie?","commenter_a":"I freaking hate Megyn Faux News Kelly. Arrogant, narcissistic twit.","post_message":"Holy crap! D.L. Hughley called out Megyn Kelly and Fox News for their coverage of police brutality and he did not mince words."},{"comment_id":"10156430237125294","commenter_b":"Lol the military spread photos with weapons like we were suppose to","commenter_a":"As a photographer I wouldn't have taken this picture. A girl and her bow is a great idea. But not in a threatening manner like this.","post_message":"She has to give the school another photo. But, her mom is asking why someone else was allowed to do it in the past..."},{"comment_id":"1485309454835270","commenter_b":"Yes","commenter_a":"@username are these the leggings you were telling me about?","post_message":"Buyers beware: LuLaRoe is being sued for overcharging customers on sales tax. yhoo.it/2lEtUdq"}]
