[{"comment_id":"10153880843542293","commenter_b":"Really? Because people can remember actual facts that happened 15 years ago. Right.","commenter_a":"@username you were right!","post_message":"New details emerge about Omar Mateen, including his strange reaction to 9/11."},{"comment_id":"10153362031969087","commenter_b":"BAN ISLAM! BAN MUSLIMS! CLOSE THE MOSQUES NOW!!!","commenter_a":"I see we owe the NRA and Republican a big thank you for allowing another mass shooting DROP DEAD YOU MOTHER FUCKERS","post_message":"\"Upwards of 14\" people are dead and \"upwards of 14\" people are injured after \"up to three people\" opened fire at a holiday party inside the Inland Regional Center building in #SanBernardino, California. WATCH LIVE:"},{"comment_id":"10154635398261037","commenter_b":"To impregnate your mom? Yes.","commenter_a":"And she'll be knocked up again within the month","post_message":"Panna Krom, now 26, was convicted at 17 of killing her newborn in a toilet to hide the pregnancy from her parents."},{"comment_id":"935666689826142","commenter_b":"Tom thats only because fox hires those wannabe dumb blonde bimbo beauty queens who are only good for getting idiots who watch them get a hard on.","commenter_a":"How low does your IQ have to be to qualify as a Fox viewer?","post_message":"Um......what?"},{"comment_id":"1292853950724756","commenter_b":"Or marry him, or bear his children, or even be in the same room with him. Not worth any amount of money could buy a smart woman.","commenter_a":"Always a lady with class, dignity and honesty.","post_message":"She's absolutely right."},{"comment_id":"10152747797741051","commenter_b":"Not a nun no more now she's a sum cause that's what she got","commenter_a":"I thought nuns were sworn to celibacy","post_message":"A nun was rushed to the hospital with extreme pains. When the doctors told her what was happening, she couldn't believe it."},{"comment_id":"1366520420044674","commenter_b":"Hope you get well soon. Your health is what's important. Take your time so you can heal completely before you return.","commenter_a":"Do what you need to get completely healed because we need you when the football season comes.","post_message":"Wishing you a speedy recovery, JJ Watt!  MORE-->@webpagelink"}]
