[{"comment_id":"1754857141240693","commenter_b":"@username The trash should be put down !","commenter_a":"They saying there's no tv the food crap and can't go to the gym well you shouldn't do the crime","post_message":"Britain's third biggest prison is in the midst of a riot."},{"comment_id":"1775585642697945","commenter_b":"The dresses are hideous, in my opinion, but leave that baby ALONE! She's beautiful!","commenter_a":"She ain't that cute now but y'all watch she will be a real life ugly duckling story when she gets older","post_message":"Blue Ivy is getting harassed on the internet again."},{"comment_id":"1321112227930500","commenter_b":"I reckon there's still a chance he'll be persuaded to step aside, and Pence will be inaugurated on Jan. 20.","commenter_a":"Looking forward to the impeachment.","post_message":"It's official"},{"comment_id":"10155187211337871","commenter_b":"Two out of 54 are not very good odds but we can't give up hope.","commenter_a":"Thoughts to the EDITOR of a Free Press by President Jefferson... \"Perhaps an editor might begin a reformation in some such way as this. Divide his paper into four chapters, heading the 1st, Truths. 2nd, Probabilities. 3rd, Possibilities. 4th, Lies. The first chapter would be very short, as it would contain little more than authentic papers and information from such sources as the editor would be willing to risk his own reputation for their truth. The second would contain what, from a mature consideration of all circumstances, his judgment should conclude to be probably true. This, however, should rather contain too little than too much. The third and fourth should be professedly for those readers who would rather have lies for their money than the blank paper they would occupy.\" --Thomas Jefferson to John Norvell, 1807. ME 11:225","post_message":"\"I hate the press. I hate you especially. But the fact is we need you.\" - Senator John McCain jokes, but stresses the importance of a free press to a democracy, adding that \"the first thing that dictators do is shut down the press.\" Read more: @webpagelink"},{"comment_id":"934398819989704","commenter_b":"Apparently, the right-wing cannot get enough of their failed foreign policies. Now, all they need is another Bush in the White House.","commenter_a":"Derp","post_message":"He's baaaaack..."},{"comment_id":"1170311373061915","commenter_b":"Bitch, YOU'VE been punked and you're too stupid to grasp that fact!!!","commenter_a":"Will has a right to do what he wants to do.!!!!!!!!!! Who the f- -k does Trump think he is?!!!!!!!!!!!! It's time he kept his trap shut.!!!!!","post_message":"Brilliantly played, George Will!"},{"comment_id":"10153003248257383","commenter_b":"And boot bitches like you.","commenter_a":"I wonder how many of you bitching about Audie Murphy are going to do something about getting him a day. He did a good job, told a good story, and Texas is proud of him. Get your panties out of a bunch and carry on.","post_message":"There is now an official 'Chris Kyle Day' in Texas."}]
