[{"comment_id":"597418893776211","commenter_b":"@username Jill stein is a communist and belongs in jail for vandalizing construction vehicles at standing rock and she's crazy","commenter_a":"Bernie needs to take a young politician under his wing and mentor them so one or two elections down the road the only politician in america with a moral bone in their body isn't pushing 90.","post_message":"Mr. Trump, you told working people you were on their side. You know what? Millions of us are going to demand you keep your promise."},{"comment_id":"966104673465761","commenter_b":"Islam. Definitely will Dominate. ....... Hell of Course","commenter_a":"So America here is the hope and change policy everyone voted for. And the new world order. Question. When are we as voting and tax paying Americans going to say enough is enough. These punks can speak bad about God and Jesus. But God forbid if you speak bad about a child molesting prophet like mohmed. Or that false god like allah. Islam is a belief base and history and likes. We all know that Mohamed made promise to entice the people to fight lIke animals by promising them virgins. Where in the middle east are you going to find a virgin. All the goats are taken. Our courts need to grow a spine.","post_message":"Is Obama Trying to Establish Islam as our State Religion?"},{"comment_id":"10153766225688132","commenter_b":"the laws about women showing constant pictures of themselves naked have to change, really sick of seeing all her plastic body parts.","commenter_a":"Please change yourself first phony woman","post_message":"\"These gun safety laws have to change!\" - Kim Kardashian"},{"comment_id":"10153138055390329","commenter_b":"You're an idiot, Michelle.","commenter_a":"Fuck you buzzfeed. Articles like this are the reason half the country has measles. So irresponsible for you to publish something like this","post_message":"Why would you ever want to get vaccinated? (WARNING: Contains images that some may find disturbing.)"},{"comment_id":"10155939290119012","commenter_b":"No he's creating a disaster!! You cannot fix something that has been left go for decades! You can find a way to manage it and try and prevent the same things to keep happening! That is why Obama was smarter about it! He deported the ones that were a threat not a mother with kids! But I don't expect the right to understand this! You think acting like a dictator is going to help this country your dumber than I thought!","commenter_a":"Yes.","post_message":"YES or NO: Is President Trump making America safer?"},{"comment_id":"893865083995373","commenter_b":"Ha! That ones funny","commenter_a":"It's bullying and an example of bigotry BUT so are a lot of costumes. People get offended a bit too easy these days","post_message":"Halloween costumes are often inspired by pop culture and one store selling the Caitlyn Jenner inspired \"Call me Caitlyn\" costume is taking flack from activists saying it's bullying and an example of bigotry."},{"comment_id":"10152602108687061","commenter_b":"And a fat hoe","commenter_a":"Michelle looks more like a hoe everyday","post_message":"Pres. Obama: \"I have no more campaigns to run.\"  (audible clapping in chamber; pause)  Pres. Obama: \"I know, 'cause I won both of 'em.\" #SOTU2015 -- (click for audio) abcn.ws/1JbdOLY"}]
