[{"comment_id":"1224890174198658","commenter_b":"Alexandre Brault c'est ca le vidéo que je te parlais!!","commenter_a":"Akam HS and yeah as I told you we are a cell of another humans ass","post_message":"This is so trippy. From galaxies all the way down to quarks."},{"comment_id":"1328638283841395","commenter_b":"Generational behavior.","commenter_a":"I've been saying that for over 20 years and people look at me like I've got two heads. Everyone feels entitled including the adults and they pass it on to their children and the problem get exponentially worse. Where and how does one put an end to this......","post_message":""},{"comment_id":"923696117653244","commenter_b":"She's not that pretty. Having breast implants make her look more like a man","commenter_a":"I heard she was back. What's Botched about?","post_message":"“One Tit Is In Africa And The Other One Is In Europe.” Tiffany “New York” Pollard To Appear On “Botched”"},{"comment_id":"912633472136742","commenter_b":"She probley doing wat she was raised watching het monster mother do... it's disgusting how she was beating het child like she was beating a street bitch... she ain't shit,!!!","commenter_a":"Alan Connell","post_message":"Mom Beats Her Daughter In Broad Daylight For Sucking D!"},{"comment_id":"1302575163172066","commenter_b":"@username and why isn't Hillary in jail right now? Oh yeah, dirty politics.","commenter_a":"He's a fraud. Last night he said he would (be able to) release his tax returns if Hillary released the emails. So according to Trumb...HE CAN RELEASE HIS TAX RETURNS IF HE WANTS Period","post_message":"“If not paying taxes makes him 'smart,' what does that make all the rest of us?”  - Hillary Clinton"},{"comment_id":"10152657458940047","commenter_b":"First get your children out of that muslim so called college. Stop paying tuition. Shut it down. It is now a muslim training camp. Congress must shut off funding. Senate and House must stop acting like they dont work for us and get all Muslims out of this country. Enough is enough!","commenter_a":"Operation Paperclip: 69 Years Later: @webpagelink","post_message":"ISIS militants and Hamas jihadists conducting training camps on American college campuses is no different than a training session for student athletes?    According to the Assistant Dean of Students at Cornell University they are.  Astounding."},{"comment_id":"10153087486466162","commenter_b":"She is hot","commenter_a":"Sicko","post_message":"STUDENT SAYS THEY HAD SEX AGAIN: A high school teacher charged with having sex with several students is back in jail after one student claimed that they continued to have sex while she was free on bail @webpagelink"}]
