[{"comment_id":"10153092200332869","commenter_b":"Mrs.Clinton will never be president and a Democrat will not get the presidential office. Either republicans or the third party is getting the presidential office. I do not accept the same-sex marriage.","commenter_a":"So proud of Gov Huckabee's strong stand against same sex marriage. Sets him apart from others who shun the issue. Will be a strong president!!","post_message":"Governor Huckabee was on Fox News tonight to discuss the Supreme Court's divided ruling on gay marriage, and the need to reject judicial tyranny and protect religious liberty. WATCH ⬇️"},{"comment_id":"10154246053623797","commenter_b":"They are being peaceful.","commenter_a":"No reason to protest. Have a vigil. Be peaceful!!","post_message":"#CHICAGO PROTESTS: Protesters swarm the Chicago Police HQ"},{"comment_id":"10153168410293690","commenter_b":"In ind had been an individual liber,on account of each mob should be admit each religion.its actual substance,besides already has recognized via Basic R8s","commenter_a":"Its expected from modi sarkar, as he has the record of massacaring muslims in Gujrat..","post_message":"Are India minorities under attack? Christians and Muslims say the government is not doing enough to protect them from hardline Hindus. But is prime minister Narendra Modi being compromised by his nationalist roots? @webpagelink"},{"comment_id":"610453139087868","commenter_b":"Fuck that arrogant asshole","commenter_a":"I hate this motherfucker.","post_message":"You piece of garbage."},{"comment_id":"1112602185474010","commenter_b":"FFFFFFFFFFFFFFFFFFFFFF trump he is a orange bigot! #Ftrump","commenter_a":"trump 2016","post_message":"Former Mexico President Vicente Fox is sorry, not sorry about his big middle finger to Donald J. Trump and his proposed wall along the U.S. southern border."},{"comment_id":"970468323009697","commenter_b":"@username PLEASE vote for Hillary she is on her way out, just ask Biden, ask Obama, ask Bernie, ask the FBI. So plz do us a favor and vote for her, she will need something to read in jail and your voting ballot will be perfect.","commenter_a":"She might have a college plan but how could she do it from jail?","post_message":"How much could your family save with Hillary’s college plan? In Oklahoma, a family earning $75,000 per year could save $22,300."},{"comment_id":"409789959202885","commenter_b":"@username SUCK ON AN ASS","commenter_a":"All you white assholes should walk in a black mans shoes for one day. It may just change your perspective about racism, and how black people feel in this country.","post_message":"Why the secrecy?"}]
