[{"comment_id":"902999723068783","commenter_b":"The ones he just released did return to the battlefield and for a traitor that is a fact ! Stop with Bush,","commenter_a":"Impeach him now ! Sending prisoners to the battle field is treason !","post_message":"The WORST!"},{"comment_id":"859635514085473","commenter_b":"Go home ma","commenter_a":"If she is going to run like a man then she should not be treated any differently than a man would be.","post_message":"After laying out plans to 'run as a woman,' Hillary Clinton is outraged at a Republican for bringing it up"},{"comment_id":"541837822650909","commenter_b":"blow hard............lies lies lies.....#USA4DJT, #MakeAmericaGreatAgain, #VoteTrumpForPresident","commenter_a":"So sorry this is his last year","post_message":"Your reaction to President Obama's State of the Union Address?"},{"comment_id":"10154433599628812","commenter_b":"Good for you, we have got to keep Hillary out of WH we cant take 4 more years of failure!!","commenter_a":"Neither believe in Science/ man made climate change- Disqualified to hold office!!","post_message":"Senior level Trump campaign sources confirm to ABC News that Speaker of the House Paul Ryan will be endorsing presumptive GOP nominee Donald Trump: @webpagelink"},{"comment_id":"1069240676520375","commenter_b":"I'm confident Mr. Trump is the answer to America's future. With Obama (or Clinton) . . . America had no future. God Bless President Elect Trump.","commenter_a":"Depends on whom U ask?! Do not TRUST him. He will NOT b under a microscope as Pres. Obama was. He will NOT make America great...agn This country will never UNIFIED....","post_message":"Yes or no: Will Donald Trump be a good president?"},{"comment_id":"1391127634238463","commenter_b":"You poor Republicans. You are so lost in your stupor that all you can do is harp again and again over Hillary's e-mails. Sure, it was a mistake. But in the final analysis you can not find any harm caused by that. In the mean time just consider the damage caused to our nation by the rigidity caused by the Republican Congress over the past eight years. Your solution is to nominate a man devoid of any moral compass. Thanks Republicans. I can only hope that what rises from the ashes of the Grand Old Party will come closer to Abe's vision and that Rush L. stays buried in the ashes.","commenter_a":"I just do not understand how any true red blooded America could even think about voting for Hillary after her cover up of Benghazi and Emails !! The only thing she has proven is she is a BIG lair and above the law ! She is truly a woman of zero integrity and belongs in prison NOT running for our president !","post_message":"\"It took the socialist to remind us that you supported the trade agreements that cost millions of American jobs and millions of dollars.\" Last night on \"Justice,\" Judge Jeanine Pirro slammed Hillary Clinton over her Wall Street ties, failure to help the Middle Class, and backtracking over her husband's crime bill. @webpagelink"},{"comment_id":"10153846244313984","commenter_b":"Dumb bitch","commenter_a":"Well said Rubio!","post_message":"WOW. Out of all the things she could have been doing, or should have been doing - THIS is what she chooses. It's pretty unreal to think that some people actually want her to become the next POTUS... Do you think it's time for Hillary Clinton to drop out of the 2016 presidential race?"}]
