[{"comment_id":"10154438861719726","commenter_b":"While I can understand the basis for some of these observations, the main thing I firmly believe is that perhaps just over half the Democrats who actually voted for Obama in the last election will turn out to vote this cycle. I do not see near the support, energy, emotion, or urgency that I saw in the last two Obama campaigns, and lets be honest here folks... Hillary Clinton IS NOT barak obama. She does not have the well-oiled campaign machine Obama had. All she has is a character-assassination campaign, that's it, and it's exactly what I expected from her too. It honestly would not surprise me if Trump carried a lot of the swing states simply because democrat voters know she's a damaged candidate. Add to that that about half of the Democrat voter bloc in play this cycle was Bernie Sanders supporters of which many of them won't ...","commenter_a":"HIllary doesn't want to talk about the issues because she has no plans except what Obama has told her to say.","post_message":"This is the strategy Trump can use to defeat Clinton:"},{"comment_id":"10153118499596955","commenter_b":"Hemlock, anyone?","commenter_a":"These stories are being given as some form of programming... The nation was taken over and completely changed post Lincoln and forever altered for the globalists post JFK... If they want to move a major agenda forward they throw the nation off by creating spectacular distractions... This is subtext leading to a possible grand piece of theater.","post_message":"'Drunk' Secret Service agents disrupted bomb probe..."},{"comment_id":"10153731246222217","commenter_b":"VOTE FOR TRUMP!! Screw this hoe","commenter_a":"Isn't that what Trump is actively doing? At least Clinton only accidently put others in danger, where as trump is one bad day away from bringing back Lynching, well try to anyway.","post_message":"He added that she would make \"such a lousy president\"."},{"comment_id":"1759728807637196","commenter_b":"Vicente Fox..You're not welcome in OUR Country!!","commenter_a":"Good then you'll get what you deserve 😉","post_message":"The former president of Mexico, Vicente Fox Quesada, says Donald J. Trump is using his visit to Mexico with President Enrique Peña Nieto to boost his sinking poll numbers. @webpagelink"},{"comment_id":"10153402845063352","commenter_b":"Sheila cant make a hoe a housewife lol","commenter_a":"Sheila Ryan Jonathan omg","post_message":"Boyfriend Sets Up GoFundMe Account Begging For $325 to Follow Girlfriend to SpringBreak to Make Sure She Doesn't Cheat!"},{"comment_id":"10152777670593525","commenter_b":"Hahaha she can do it, especially since she has that walker she'll smoke that nigga","commenter_a":"@username Xana Smith @username Alice needs to get on her grind! Lol","post_message":"95 years old and still setting records on the track…"},{"comment_id":"1202725173156591","commenter_b":"@username Seriously? Class, the next one? Give me a break. Michelle has more class in her pinky than Trump's wife has in her entire body.","commenter_a":"You would make me proud if you would return all the millions and millions of taxpayer money you spent on vacations! p.s. Your fired!","post_message":"Michelle Obama chokes up in final speech: 'Being your First Lady has been the greatest honor of my life.' @webpagelink"}]
