[{"comment_id":"10152510366081813","commenter_b":"Sound like another feminists that loves the idea of discrimination. Gee, imagine finding you here.","commenter_a":"And then ACLU discriminates by stating \" This one is dedicated to all the girls out there\".. LOL","post_message":"This one is dedicated to all the girls out there who prefer reading science fiction and history books to love stories.  @webpagelink"},{"comment_id":"10153974974065329","commenter_b":"Bye bitch","commenter_a":"My belief she is every bit as responsible of what that animal inflicted on the child. As a mother, you are to protect your child by any means necessary. Battered or not she bought that animal in her baby's life and chose him over her child. Save your hate post siding for the battered women of the world the only person I care about that needed defending is the child.","post_message":"Tondalo Hall will not be released early from her 30-year sentence in Mary Fallin's Oklahoma for failing to protect her children from her abusive partner. The man who actually harmed her child got just two years. (via BuzzFeed News)"},{"comment_id":"894646007249901","commenter_b":"Go home","commenter_a":"Shut your eyes or put a bag over your head !!!","post_message":"This is the real agenda of radical Muslims."},{"comment_id":"10153645551275575","commenter_b":"Who cares about Mexican officials ? Why don't they keep their people there in Mexico ?","commenter_a":"I STAND WITH TRUMP!!!","post_message":"Sounds like a good idea!"},{"comment_id":"10153514086261955","commenter_b":"Still trying to jump that fence huh? @username ...better hurry before that Trump wall gets built.","commenter_a":"It's not that hard to figure out why Trump is doing so well. People are so tired of politically correct politicians.","post_message":"Pollsters dumbfounded by Trump..."},{"comment_id":"10154475429571336","commenter_b":"One could only hope. But she seems to be too slimy to catch!","commenter_a":"Wikileaks founder, Julian Assange, has said that Wikileaks has obtained information that, when released soon, will guarantee a Hillary Clinton indictment. During a recent interview with ITV, Assange said his next release will “provide enough evidence” to see Hillary arrested.","post_message":"At the Veterans of Foreign Wars VFW convention, Donald J. Trump slammed Democrats for not mentioning ISIS during their DNC speeches. @webpagelink"},{"comment_id":"10154126843971254","commenter_b":"Yeah what ever and if the western woman didn't she'd be killed Mu idiots","commenter_a":"If a muslim man approached a western non muslim woman in the middle east and threw a niqab on her asking to wear it because she is in their country it would have went viral and all muslim would have been accused as extremists. We live in a world full of contradictions.","post_message":"'Our Britain, you live by our f****** rules'"}]
