[{"comment_id":"10153681874356130","commenter_b":"Did he build the wall?","commenter_a":"The Pope is a hypocrite. Take down the Vatican walls and let people enter freely and demand to be taken care of.","post_message":"Satan For President? @webpagelink"},{"comment_id":"617790755078170","commenter_b":"She a geto gutter hoe send her back","commenter_a":"I agree with Brooks.And Steven Joseph Sr.God bless that soldier .And thank you for your service","post_message":"Michelle Obama wanted this army staff sergeant to do this, but he refused.  This is amazing. We stand behind this soldier 100%.  Do you support this war hero stand against Michelle?"},{"comment_id":"10153408271028338","commenter_b":"The mom didn't! The dog was roaming loose around the neighborhood when it attacked the child","commenter_a":"Sue the dog owner...? Why did the mom have the kid there around the dog?","post_message":"The boy's grandfather says he already spoken to a lawyer and plans to sue the dog owner in his grandson death."},{"comment_id":"10152967828847061","commenter_b":"Yes legal immigrants ma'am","commenter_a":"I am ashamed at the negative narrow minded comments. Check your heritage. We are all immigrants","post_message":"America Ferrera to Donald Trump: Thanks, your comments will send more Latino voters to polls: abcn.ws/1Iw7NNn"},{"comment_id":"10153860133856336","commenter_b":"He just figured this out LOL i knew ever since he took office.","commenter_a":"Absolutely.","post_message":"Do you agree with Mike Huckabee?"},{"comment_id":"10152780915443124","commenter_b":"the person who insists on letting everyone know their phone conversation in a public place #AmazonGiveaway","commenter_a":"The GravyMaster","post_message":"Add a name to the  and live like  by entering the Amazon.com  Blacklist Villain Sweepstakes for a chance to win a trip for you and a guest to NYC including airfare, hotel accommodations, and more. To enter for a chance to win, respond to this post in the comments below with one sentence or less naming your own The Blacklist villain (please include #AmazonGiveaway in your comments). @webpagelink  Don forget to watch  Blacklist, available on Blu-ray, DVD, and Amazon Instant Video US. @webpagelink  Ends 2/2/2015 at 11:59 PDT. We will reply to the winner's randomly selected comment with instructions on how to claim the prize. NO PURCHASE NECESSARY. See Official Rules: @webpagelink"},{"comment_id":"1727798617495109","commenter_b":"She's a hottie","commenter_a":"Megyn Kelly is a dream come true.. Smart and beautiful","post_message":"“When I am wounded, I go after people hard, okay? And I try and ‘un-wound myself.’” — Donald J. Trump"}]
