[{"comment_id":"1776934572577306","commenter_b":"I will be voting for Hillary, because trump is grabbing pussy","commenter_a":"If you still plan to vote for HilLIARy after this, you must hate Trump more than you love your country. Think about it. Long and hard. Is your pride worth placing an untrustworthy, corrupt criminal, who flippantly handles our national security, in the highest office in the land?","post_message":"Hillary Clinton's campaign is waging a full-out war on FBI Director James Comey in the final 10 days of the election."},{"comment_id":"10154506488603487","commenter_b":"Non-issue. Couldn't and wouldn't happen. Too much of our power structure is in Texas.","commenter_a":"If they do not want their Social Security, Medicare, Medicaid, and Veteran Benefits. We will gladly keep their share for the USA. Of course Hillary has a chance to win Texas.","post_message":"Hypothetical question: Would you support or oppose Texas seceding from the United States?"},{"comment_id":"1213204015381722","commenter_b":"Trash talk was and currently still is part LJ personality. Nice try though . Gotcha bitch","commenter_a":"STICK TO BASKETBALL.","post_message":"LeBron is leaving no room for interpretation here."},{"comment_id":"10153180567873690","commenter_b":"its for this reason lisa muslims want to have it all they fight amongst each other blame the west and on top of it want sympathy from westerners as you said americans fought to be where america is today we still struggle with our own issues but theres a constant progression all be it slow .. why is it that muslims are dying to come here ? why cant they look around at the state of their people and see its something wrong with their way of life ? why is the rest of the world capable of governing their own but arab leaders oppress and steal from their citizens speak to arabs off record they all say they hate arabs and wish they werent arab .. very telling .","commenter_a":"my favorite is when muslims say 1400 years ago christians did this or that f off! the world has moved on everyone except muslims. ha and ohh in the time of muhammed this or that again f off that was 3500 years ago not relevant .","post_message":"Opinion: The religious identity of violent perpetrators is only highlighted when they're Muslim. @webpagelink"},{"comment_id":"10153331816764087","commenter_b":"Time to make another donation to PP!","commenter_a":"and this is how our tax money is spent! Disgusting, we should defund all these Republicans, 1 month no pay for each time you waste our money on senseless, going nowhere bills. Aren't there bigger problems to solve?","post_message":"Senate Majority Leader Mitch McConnell on Tuesday dispelled speculation that Republicans might drop a provision defunding Planned Parenthood from an ObamaCare repeal package."},{"comment_id":"10154526553127550","commenter_b":"@username SORE LOSER","commenter_a":"All of you supposed adults in here crying are ridiculous, Republicans lived through eight years of Obama, you can survive four to eight years of Trump. Grow up.","post_message":"North Carolina has officially cast its electoral college votes for Donald Trump."},{"comment_id":"10153860038833812","commenter_b":"We can't erase history, if we could, blacks wouldn't be here ! We'd have gotten rid of them and shipped them back to Africa.","commenter_a":"Idiots!","post_message":"University of Mississippi quietly removes the state flag with its Confederate battle emblem from its place of honor on campus after students and faculty called it a divisive symbol that undermines efforts to promote diversity, tolerance and respect."}]
