[{"comment_id":"1101968433174725","commenter_b":"Okay? That doesn't mean he wasn't talking to all Americans in this quote.","commenter_a":"He was actually talking to the wealthy in America with that phrase. He was about to raise their taxes.","post_message":"BOOM!"},{"comment_id":"737091973148047","commenter_b":"Imigrants that come here with four wives and ten kids need to be kicked off welfare they cost tax payers a 100.000 dollars a year per family","commenter_a":"Cut her off.","post_message":"Debbie Merton lives off of government tax money. But it’s what she’s doing NOW that will make you want to punch a wall. Should this woman be cut off from the government?"},{"comment_id":"10153703339506509","commenter_b":"Hillary will be in jail before she ever becomes president!","commenter_a":"the entire republican party is a joke","post_message":"Rick Santorum officially announces that he's running for president. @webpagelink"},{"comment_id":"991233837660061","commenter_b":"Fuck them, go back to the shit hole you crawled out of.","commenter_a":"If our culture offends u get out!","post_message":"First bacon, then bikinis, then beer and now sports fans should watch their ... wardrobe selection so not to offend The Religion Of Peace? @webpagelink"},{"comment_id":"1233538923335820","commenter_b":"Well she can shove it in my face.","commenter_a":"Climb back into your closet. We are sick of all of you being shoved in our faces.😈😈😈😈","post_message":"\"I knew going in that I had the opportunity to make history ...\""},{"comment_id":"1656355127989110","commenter_b":"@username Hahahahah devil bitch!!!!!😂😂😂😂😂😂","commenter_a":"I don't blame him. Look at his filthy, disgusting, whiny, wrinkly, pant suit wearing, adult diaper using, Parkinson ridden, messy asss cunt of a wife.","post_message":"Bill 'still dicking bimbos at home'..."},{"comment_id":"956349277815184","commenter_b":"To keep the bad guys out.....Tear down that wall and invite them in.","commenter_a":"This is why liberals suck, do as I say not as I do.","post_message":"ClashDaily.com"}]
