[{"comment_id":"10154310886941178","commenter_b":"Spanish came from Spain which invaded south and north america long,long ago.So yes,spanish speakers invaded,killed and stole land long before white people.Feel better now?","commenter_a":"All you Mexican flag holders need to go back to the country you remain loyal to. Only legal Mexican are loyal to the USA. We welcome the ones that come in legally to assimilate and make America their country.","post_message":"The LA Times gets political over the Trump protests.  Here's their biggest concern..."},{"comment_id":"10153208487503124","commenter_b":"A hole where I tried to hang a coat rack and it went clear thru to the bedroom behind the wall.....ooops....two holes...walls need patched now and still don't have the coat rack hung.....#AmazonSweeps #DDIY Thanks for the chance.","commenter_a":"We want to install slide out shelves in our pantry! #AmazonSweeps","post_message":"What project needs to get done around your house? Comment with #AmazonSweeps to enter to win a $250 gift card to be used on Amazon Home Services. Hire a pro to handle the hard work - don't do it yourself. #DDIY  Ends 7/30/2015 at 11:59 pm (PT). We will reply to the winner's randomly selected comment with instructions on how to claim the prize. See Official Rules: @webpagelink NO PURCHASE NECESSARY"},{"comment_id":"996990363669718","commenter_b":"@username, if those that come from Mexico are such a hard working people like liberals claim, then they should use all the energy to fix their own place. Mexico required voter ID which in turn gives them capabilities of voting people into office. Fast forward to illegals here from Mexico claiming that is racist to require voter ID, while their own place mandate that they have one. Is all about getting free stuff without any output. For that reason I say screw everyone of them that break the law and move here.","commenter_a":"I live in a Muslim country here is like a hell because of being Muslims. Killing, kidnaping and beheading is an usuall action. If you want to be safe, don't let any Muslim live in America.","post_message":"NOT IN OUR COUNTRY."},{"comment_id":"10153058283284411","commenter_b":"Carlan those who behead people in the name of fake Islam are created by Mossad , CIA and MI6 have been given training by them please wake up to the reality CNN and fox news are not just the lives stop your hatred against us muslims please leave us alone , those isis members have kept their fake muslim names","commenter_a":"Germany starting shit again... Shocker.","post_message":""},{"comment_id":"10153696423508717","commenter_b":"And are spelled out for me in MY bible","commenter_a":"Hi! I'm an ignorant Facebook commenter. I disagree with/HATE anything that makes me uncomfortable and refuse to believe studies that are in contradiction of my beliefs. Only studies that agree with me are real. God bless!","post_message":"A new study in the Journal of Developmental and Behavioral Pediatrics finds that the kids really are alright."},{"comment_id":"10152885307051336","commenter_b":"Totally totalitarian and just plain wrong","commenter_a":"Start pushing back people!!! They care nothing about your kids.","post_message":"UPDATE: The Goochland County School Board has now voted down the controversial policy on religious homeschooling. @webpagelink   Virginia parents are outraged over a new policy that demands home-schooled children justify their religious beliefs to a school board within 30 days of their 14th birthday."},{"comment_id":"941193142664131","commenter_b":"Hope it blind the liberal bitch! LOL","commenter_a":"Get more of them","post_message":"Mace to the face = ouch. Did she deserve it? Did the old man deserve getting punched by her? And for a bonus for being nice I've added a video of a high protester doing a backflip and landing on his head. #theplacewecallthezoo @webpagelink"}]
