[{"comment_id":"10158695661875206","commenter_b":"Check this out i mean Inc.org","commenter_a":"Humans have souls and can live etrnally and that is according to what is written in the holly scripture \"the bible.\" God forwarned us that earth will be burned during the secon d coming of jesus ... judgement day.. The bad ones will be burned and gids chosen people will be saved and have second life eternally","post_message":"If there really are multiple, interacting universes, then it would be possible for time travellers to visit Earth, and every imaginable scenario would be played out in a parallel universe at some point."},{"comment_id":"1806555102961372","commenter_b":"Why does she keep bringing up controversy. Be done with it Megan! And get over yourself!!!","commenter_a":"Obama has flooded our country with muslims over the last 8 years to buy votes and destroy our country. America First an no PC.","post_message":"\"I welcome immigrants. I welcome people from all over the world to join us here. But I want to make sure that it's safe for Americans in my country that I fought for,\" Carl Higbie told CAIR Florida leader Hassan Shibly."},{"comment_id":"1015814318563348","commenter_b":"Illegals are getting benefits. Its not my fault that youre too much of an idiot that you cant see that. And because of our backwards government giving handouts to everyone of these assholes, theres not enough resources left to give them to the people who really deserve them. Stop being such a dumb cunt. Every chance i have to take part in getting rid of these parasites, you better god damn well believe that i will!","commenter_a":"And illegal immigrants shouldnt be in the us either. Have you seen the jails in this country? If you break the law, they lock you in nasty, unsanitary cages like fucking animals. If you break yhe law, you get what you deserve!","post_message":"These conditions should not be allowed anywhere, especially in the U.S."},{"comment_id":"10154464695802994","commenter_b":"If it is against her religion for birth control, she shouldn't be having sex out of wedlock either then","commenter_a":"Babies are blessings and I'm sure she loves them. But it's probably time for some birth control. 3 kids at 20 is quite a bit, but 6 is a lot (seeing as if they weren't twins someone would have to start around 13 and have a baby every year so I'm sure it hasn't happened much)","post_message":"\"My regrets would be timing, but I'm really happy that I can even create babies or have life because some women can't do that,\" 20-year-old Danesha Couch said."},{"comment_id":"10155218043119411","commenter_b":"But I am American...maybe its not just what is in your dna but what is in your ideals and thoughts","commenter_a":"Just because he lives in one of the countries of europe does't make him a European, Europeans are people just like Asians, Africans or Indians with roots and ancestry from the said places. If I moved to Japan I wouldn't automatically become an Asian.","post_message":"'He European, just like you. [He] has a university degree, a figure that you never have, and a beautiful wife at home (who is white and blond)'"},{"comment_id":"10155160536813132","commenter_b":"I can't stand her...","commenter_a":"I don't know about her being an A-lister...","post_message":"Donald J. Trump spoke out about the decision on Twitter."},{"comment_id":"10152487852365927","commenter_b":"Maybe your parents should have aborted both of you!!","commenter_a":"Hang them together.","post_message":"They're PROUD!?! Wow..."}]
