[{"comment_id":"10154734635153797","commenter_b":"I can't believe this! That's why having your ccw's is so important. I will not leave without my .22, might not kill you, but it could save my life. Idk how the laws are there but here in Ohio, especially in Cleveland where I'm from. You need to be carrying. I would've helped her in a heartbeat. No questions asked. Then criminals would think twice, if we all start defending ourselves.","commenter_a":"I'm so mad right now not only at the whole situation but nobody had the compassion to help her I'm thinking of that was my Mother, sister auntie etc... praying..","post_message":"CTA VICTIM ID'D: The woman who was stabbed repeatedly on a crowded Red Line train Thursday afternoon has been identified as 25-year-old Jessica Hampton."},{"comment_id":"1683593111700811","commenter_b":"That's why they have a little pill now called Plan B...take that the day after you're raped if you can't stand to carry the baby and put it up for adoption to a family who doesn't care how the child was conceived! Abortions, especially late term abortions are cruel and inhumane!","commenter_a":"It's planned parent hood they do a lot more then abortions. And @username women chose well some prolly forced so @username women got knocked up because they didn't practice safe sex. I thought women wanted the right to chose what they do with there bodies planned parent hood also helps with women's health who can't afford insurance or hospitals the government cut there funding right? So how can they help these people and if they closed right now you don't think @username people won't find someone else to do abortions. I promise if there not smart enough to use protection and pph closed you would see a lot of dumb young women ending up in ER with a coat hanger hanging out of them. Americans are such pussies anymore of it is not your baby or body and you don't know the person making there chose mind your fucking business","post_message":"Ugh why?!"},{"comment_id":"1067809293363821","commenter_b":"Trump is sending all illegal aliens to Mexico even if they are NOT from Mexico?","commenter_a":"Lets see now which border are they coming over? Oh that would be the Mexican border you say. So if they are detained at that border, no matter where they come from, why shouldn't they be sent right back over that border? It should be Mexico's responsibility to police those that are breaking their immigration laws and not letting them flow freely over our border. What is so funny and absurd about this?","post_message":"'See? Justice isn't blind, she just can't tell Hispanics apart.'"},{"comment_id":"10154356585776509","commenter_b":"The mass shooter in California, were not by Americans. They should establish a law that anyone who comes into this country looking for citizenship should established themselves as Americans ,have at least 2 year or more waiting period. Until they do an extensive background check","commenter_a":"When black people kill white people and rape white women you don't see no tears from Obama. When Muslims terrorize and kill people cut Christians heads off you don't see no tears from Obama","post_message":"President Barack Obama wipes away tears while speaking about victims of gun violence: 'Every time I think about those kids it gets me mad.' @webpagelink"},{"comment_id":"10157307268915354","commenter_b":"Definitely yes. We do not want them here. Security risks.","commenter_a":"Go back to your shithole of a country and wear your burqas there.","post_message":"WOW.  Can you name the other 2 countries?"},{"comment_id":"565700806961575","commenter_b":"Don't they get it! We don't want her!","commenter_a":"Hillary will probably die before then of karma and natural causes!","post_message":"Trump-Clinton rematch for 2020?"},{"comment_id":"847928802003105","commenter_b":"I am not Impressed with a government that steals elections so they can choose the president.","commenter_a":"This will give Rise to the Libertarian party who is right now starting to gain traction The GOP thought they had issues with @username...they wont be able to control a Libertarian Party candidate The establishment is destroying their 1 party 2 party system .... Thank you @username even if you get screwed out of the nomination you have accelerated the cause of freedom and liberty","post_message":"This is happening all over our country—great people being disenfranchised by politicians. Republican party is in trouble!"}]
