[{"comment_id":"10152844274493525","commenter_b":"Burn the witch!!!!!!!","commenter_a":"good....now put him to sleep!","post_message":"The 30 verdicts for Dzhokhar Tsarnaev in the Boston Marathon bombings trial are as follows: Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty."},{"comment_id":"10153600653569062","commenter_b":"Usa, invaded my country,so they have to clear the mess that's,they did over there then we'll back","commenter_a":"All you Muslim loving people need to move to a Muslim country and enjoy your Muslims.","post_message":"Your thoughts on this? Roughly two dozen sign-wielding protesters repeatedly tried to vocally overpower speakers at Texas Muslim Capitol Day."},{"comment_id":"1004765479656630","commenter_b":"That's no lady. Bigger dick than Barry.","commenter_a":"Disgraceful First Lady","post_message":"Hot diggity dog..."},{"comment_id":"10152809314113645","commenter_b":"It SHOULDN'T MATTER SHE IS A MURDERER !!!!!'","commenter_a":"murder charge now!!!","post_message":"Sad update to pass along, family tells FOX 4 that a teenage girl who was critically injured last Friday after being hit by a car was taken off of life support today."},{"comment_id":"999119110145234","commenter_b":"I like the term \"political whores\". Appropriate. They were all PAID millions of dollars by Monsanto to vote this way. (I suspect this is just the tip of the iceberg.) We should throw them all out and start over.","commenter_a":"I'm very against genetically modified foods, but the fda is supposed to be a small little entity. They aren't supposed to tell me what to eat. You guys are cutting off your noses to spite your face, and until you are willing to look at both sides of the argument and find the truth, you might as well just keep eating it like the little sheep you are.","post_message":"Despite the fact that some polls show that up to 95 percent of the American people want foods that contain genetically modified organisms to be labeled, there are a lot of politicians that don't seem to agree. Here's who they are:"},{"comment_id":"10153278870867217","commenter_b":"Some woman wear a hijab out of choice !","commenter_a":"With a Hijaab. . ? 1st education they need. . Is to get out of hijaab slavery m8, , Pls convey this to them","post_message":"\"We want to inspire young girls to stand up for their rights.\""},{"comment_id":"10153483045518812","commenter_b":"She just wanted to be a hoe","commenter_a":"Is she right or is she wrong? If the male students have some privileges, so should the female students.","post_message":"High school graduate, who says she was penalized for what she said teachers and administrators described as “distracting” clothes, uses yearbook quote to strike back at school dress code: @webpagelink"}]
