[{"comment_id":"449537148504213","commenter_b":"Lindsay Graham needs to shut the Hell up","commenter_a":"I guess I am part of the dark side and this asshole is one of the bright politicians that are bankrupting America!??","post_message":"Lindsay Graham made this highly controversial comment about Donald Trump. Do you agree or disagree with him?"},{"comment_id":"10155303562011756","commenter_b":"'@username stfu and gtfo. Now.","commenter_a":"I get where the author is coming from and she makes a valid point. In this case though I think the mommy comments were engendered by Beyonce's show stopping 10 minute celebration of being black, being a woman, and being pregnant. Her presentation as an Isis figure/fertility goddess all flowed into the dynamic she created, so it's understandable that Adele and Faith related to her that way. Beyoncé was the mother of the night and that's how she planned it. If she performed formation and wasn't pregnant for example, this article would be more warranted. I think the whole mammy/mommy comparison arises because it's impossible to escape the history and application of white supremacy whenever colored people deal with Western institutions like the Grammy's. The concept of disposable black women, which Beyoncé essentially demolished in her performance, is baked into our society and forms a large part of the reason ...","post_message":"On the Grammy stage, both Adele and Faith Hill commented that they wanted Beyonce to be their . Those comments came across as absolutely bizarre for Denene Millner, writing for NPR's Code Switch:"},{"comment_id":"10154319507055329","commenter_b":"Haha complete and utter shit show Xxx","commenter_a":"Charlotte, number 4 and not number 5 lol!","post_message":"Here's to the tea addicts!"},{"comment_id":"10152581007932894","commenter_b":"She too old to want that hoe bag to be her damn role model.. Smh lol","commenter_a":"^^^^ Shes your Role Model???? Sis....","post_message":"Mag Swag: Kim Kardashian & Her Bleached Eyebrows Cover LOVE Magazine [Photo]"},{"comment_id":"10154633905401336","commenter_b":"LOL, Yahoo doesn't have that many accounts....is this a hoax for attention?","commenter_a":"Your World with Neil Cavuto----- You are talking to a brick wall today,","post_message":"Breaking News: Yahoo says at least 500 million accounts were hacked in 2014, and reportedly believes the culprit was a “state-sponsored actor.” @webpagelink"},{"comment_id":"1189264781194585","commenter_b":"Bet you swat flies, stomp spiders and spray bug spray around. Insects are living creatures and so is mold.","commenter_a":"Sick !!! Well no excuse weither crocodiles kill humans or not humans are the sickest living creatures on earth they do things to get kicks and enjoyment","post_message":"Vile."},{"comment_id":"10153669770570950","commenter_b":"My thought exactly. If you see the pictures and videos, there are lounge chairs and tables just feet away from the water. People can read the 'no swimming' sign, but an alligator is not going to think twice about coming on land. I think Disney needs to close off areas where there are gators. I lived in Tampa for four years, and gators were everywhere near water. You just knew where they were, and if you didn't, there were signs. I doubt people did not know about the alligators; you can always spot them especially if there are more than three. This could have been prevented.","commenter_a":"Why were alligators allowed to be so close to where human activity is? Especially DISNEY WORLD where 1000's of children are on a daily basis??","post_message":"Officials are pulling alligators from the nearby lagoon and putting them down to check for the boy's body; so far, they haven't found him."}]
