[{"comment_id":"1666312230322556","commenter_b":"what an idiot. she luck to b alive","commenter_a":"@username Whosoever","post_message":"This is why you don't mess with truckers."},{"comment_id":"10154295725641162","commenter_b":"@username Says the ignorant person. I'm not trashy, so I won't stoop to your level.","commenter_a":"Time to take the trash out. Waited 8 years for this.","post_message":"Pres. Obama *literally* drops the mic at the end of his last White House Correspondent's Dinner: @webpagelink"},{"comment_id":"1564121906980885","commenter_b":"Such a nasty woman","commenter_a":"Ew","post_message":"😍😍😍 (Via Daily Mail Celebrity)"},{"comment_id":"1065116426845174","commenter_b":"She's thick. And frankly looks weird with the stretch marks photoshopped out.","commenter_a":"Ashley Graham, the model is size 16. She's NOT EVEN PLUS SIZE. That's what's wrong!!","post_message":"You decide..."},{"comment_id":"10153551784963984","commenter_b":"She wants some air time don't give it to her","commenter_a":"Yep","post_message":"These days, Donald Trump seems to be at the center of every controversy. He might just be in the midst of another one after this actress just thanked him for his stance on immigration... Do you agree with Donald Trump's views on immigration?"},{"comment_id":"1350273158317846","commenter_b":"It's about time this evil and corrupt woman FINALLY gets the justice she deserves!!!","commenter_a":"The corruption is rampant which explains why she could run...and sadly win her party's nomination","post_message":"With just five days to go..."},{"comment_id":"930011010437419","commenter_b":"Lady u need help fuck grump","commenter_a":"\"Semame?\" Really, is spell checking really that difficult? I'm only pointing this out because it's a constant with your memes and videos. As funny as they are and as much as I enjoy them, please, for the love of God, use spell check. You look like buffoons when you misspell such easy words.","post_message":"WATCH: 10 years ago, Sesame Street called out trashy Donald Grump. Shared by Occupy Democrats, LIKE our page for more!"}]
