[{"comment_id":"10154887847131729","commenter_b":"Take your head rag with you. Ungrateful bitch","commenter_a":"You are disgrace to my country! Pack your bags and go to one of the Muslim countries where you will be treated like a dog because you are female. What an ungrateful idiot.","post_message":"Seriously?"},{"comment_id":"1113637395343398","commenter_b":"Bye Bitch!","commenter_a":"Now that is ridiculous! Waste of time and very presumptuous woman.","post_message":"Fox News host Harris Faulkner is furious that a cute hamster toy bears the same name as her -- and she wants $5 million from the company that created it."},{"comment_id":"614198468735487","commenter_b":"They died due to your lack of investigation! !!!!! Say it it was a terror attack. We MUST STOP THE MUSLIMS COMING IN.","commenter_a":"So sad","post_message":"FBI – Federal Bureau of Investigation Director Comey and Deputy Attorney General Yates brief on the latest in the Orlando shooting investigation. @webpagelink"},{"comment_id":"10153123243420950","commenter_b":"Love that show!","commenter_a":" and still my favorite show","post_message":"Betty White is the lone survivor of the cast; RIP Bea Arthur, who played sensible Dorothy Zbornak, Estelle Getty, who portrayed Dorothy's mother Sophia Petrillo, and Rue McClanahan, who played the sultry Blanche Devereaux. The show lives on, though."},{"comment_id":"1186141524764191","commenter_b":"That is right they would have convicted her already .","commenter_a":"IF there was anything to charge Hillary Clinton for related to Benghazi or her emails, (or anything else Fox Entertainment lies about) then wouldn't you think, after a decade of trying to convict her of something, the Republicans would have done it by now. There is NO basis to convict her of any wrong doing. The Republicans have lied about her for years and I'm sure they will continue. In the meantime I won't vote for anyone as repulsive as Donald Trump. He will, in my opinion, destroy this Country and our reputation around the World.","post_message":"How does this make ANY sense? From CNN: \"Donald Trump may say he's concerned about the little guy, but his tax plan would give the wealthy far bigger breaks than the middle class or working Americans. The Top 1% would see a whopping $275,250 reduction in their federal tax bill, or 17.5% of their after-tax income.\""},{"comment_id":"582726195242593","commenter_b":"Omg seems that all woman are becoming liars now ^ smh^ unbelievable","commenter_a":"There are two women Trump doesn't want to tangle with. Elizabeth Warren has forgotten more about economics than he ever knew. And Hillary's foreign policy knowledge is something he will never acquire. She will decimate him in a debate because he will have to be ready to speak on issues, not just make personal attacks. He is so thin skinned that he will self destruct as soon as she holds his feet to the fire. He and his followers don't have a clue. They have demonstrated time and again that when all else fails, thuggery rules. That doesn't win elections once reasonable people make up their minds not to put up with it any more. Now I just hope that reasonable people do that sooner than later. Put him out of his misery as quickly as possible.","post_message":"He's got a problem."},{"comment_id":"10153535023142522","commenter_b":"fine, let's see what you got","commenter_a":"@username reckon you can make one of these with those design skills of yours?","post_message":"Grill while you chill:"}]
