[{"comment_id":"10153126312326028","commenter_b":"I don't understand Americans... This is the land of the free, right? No one's free! One is not free to speak Spanish and the other one is not free to be stupid. All my respect for the Latina lady, because at least she tries to speak English, thing that doesn't happen often.","commenter_a":"White 'Murican hates a woman that speaks TWO languages and she can't even form proper sentences, or thoughts, in one language..","post_message":"'I FELT AWFUL': All Norma Vazquez wanted was to treat her son to some birthday IHOP on her time off from her job cleaning office buildings. Instead she was berated by another patron who told her to 'stop speaking Spanish' and invoked the Nazis, Castro and Russia.  Watch the entire exchange, which Vazquez's son recorded on his cell phone: @webpagelink"},{"comment_id":"1172494429493450","commenter_b":"These dumbasses should be ashamed ... No one will ever vote for either of these liars again . No Honor ..No Vote","commenter_a":"These three men will never get my vote in the future. Anyone that is with her is corrupt... Republican or not you need to go.","post_message":"GOP 'Never Trump' Candidates get a Warning"},{"comment_id":"1104019902949566","commenter_b":"If she would screw a muslime she would bang anyone , they are animals","commenter_a":"Why does his 15 minutes of fame feel like 15 years?","post_message":"Apparently angry that his girlfriend cheated with a “dirty Muslim,” Zimmerman posted nude pics and contact info for his now ex-girlfriend."},{"comment_id":"361328087404039","commenter_b":"She is worse than Holder . America keeps going down hill and it will get worse .","commenter_a":"Disgrace to America","post_message":"Squishy and Weak Senate Republicans Lead the Way in Confirming Loretta Lynch as Attorney General  Real Conservatives Outraged"},{"comment_id":"10153236448557042","commenter_b":"What's she trying to prove? Don't let her use her bank account or any money she has.","commenter_a":"And what about cheap clothes too , as well as cheap beauty products .","post_message":"OSCAR WINNER LIVES OFF FOOD STAMPS: Gwyneth Paltrow, often criticized for elitist comments she made in the past, is going on food stamps.   The actress will live off just $29 in groceries for a week to bring awareness to the difficulties of living under the program."},{"comment_id":"712544572223659","commenter_b":"The devils soldiers are out of control.beating and killing everybody.And they're not going to stop until we start fighting back","commenter_a":"That pig had wonderful training---can't ya see that?","post_message":"The police officer accused the man of a DUI - driving while drunk. He didn't realize that the man was having a stroke. When he didn't answer (because he was HAVING A STROKE), the officer beat the living hell out of him!"},{"comment_id":"689148981239347","commenter_b":"That's one way to get rid of the Muslims and have them leave on their own Trump wins","commenter_a":"These guys can go to? Just go! Scum.","post_message":"Donald Trump will win, and then they will have to face reality.  If they don't like it, good riddance.  Do you support Donald Trump?"}]
