[{"comment_id":"10153452421356323","commenter_b":"\"Tear down this wall.\" ;)","commenter_a":"America will elect a Socialist when China democratically elects Ronald Reagan as its President.","post_message":"If Democratic socialist Bernie Sanders is elected president of the United States, how do you think it could impact global politics?"},{"comment_id":"1602329080072552","commenter_b":"Didn't he say \"it's easy for us to be around this everyday. It's hard for them to adjust after coming back from war\".","commenter_a":"Vote for Hillary...to finish the job on America that Obama started....","post_message":"Trump's message to veterans with PTSD isn't just wrong. It's dangerous. - Jon Comulada"},{"comment_id":"10152982642761336","commenter_b":"Where are the sires of these brooding mares? I know they are out making many more welfare babies! Really!","commenter_a":"Let me clear this up for y'all make it real simple. I grew up in Jackson and the school is in the heart of the ghetto. I am talking section 8 housing, five homeless shelters with in a five block radius of each other. This is the part of town most people don't like to be in after dark. Most of the children you will run into at the school will be children of welfare brood mares. Jacksonville is very lenient on getting welfare and other government assistance, so a lot of welfare babies are born and never taught respect or manners. Most of the people living in the zip codes surrounding the school have six to eight children and are on welfare and any government assistance they can be on. So schools are over crowded and under staffed. Also these parents are either not going to care or get ...","post_message":"A Florida kindergarten teacher has been suspended without pay after she videotaped a boy beating other students on three occasions."},{"comment_id":"10153783532251336","commenter_b":"You drug addicts are so jealous that it went to the police station. I will say it again. I'm glad it went there. get yourselves off the streets. IDIOTS!!","commenter_a":"Glad it went to the police station. Keep it off the streets!","post_message":"Officers wrote in a Facebook post, \"If you were expecting these packages and would like to claim them, please come to Police Headquarters.\""},{"comment_id":"1154295914627380","commenter_b":"This woman is crazy for thinking of that.","commenter_a":"You remind me of the politicians who turned away boats full of Jewish refugees, and sent them back to Germany to suffer in the Holocaust.","post_message":"Hillary Clinton will increase Syrian refugees by 550% without a realistic screening process."},{"comment_id":"10153655864652217","commenter_b":"Allah the greatest ever 💖💖💖","commenter_a":"“This life is not real. I conquered the world and it did not bring me satisfaction… God gave me this illness to remind me that I’m not number One; He is.” Muhammad Ali You will be missed #Champ #RIP","post_message":"Muhammad Ali was famous for his pre-fight braggadocio, predictions and quips."},{"comment_id":"1155027644532693","commenter_b":"ignorants are eating Donald shit with lying pence","commenter_a":"NEW RULE : MAKE GRABBING PUSSY GREAT AND SAFE AGAIN.....LYING PENCE IS DONE FROM EATING DONALD SHIT .....BREAKING NEWS : HURRICANE DONALD DUMB IS ENDING THE PRESIDENTIAL RACE AND IT IS MORE POWERFUL THAN MATTHEW HURRICANE .... PAUL RYAN AND THE RNC CHAIR WASHED THEIR SMALL HANDS FROM DONALD DUMB AFTER WATCHING DUMB TRUMP PUSSY GRABBER CLIP ..... THE RACE IS OVER ...CONGRATULATION I ANNOUNCE .HILLARY CLINTON IS THE PRESIDENT OF USA ,,DONALD JOKE DUMB HIJACKED REPUBLICAN PARTY (LINCOLN AND REGAN PARTY ) LIKE ISIS HIJACKED ISLAM AND KKK HIJACKED CHRISTIANITY ,, I AM CALLING FOR COMPLETE SHUT DOWN OF DONALD JOKE DUMB FROM TALKING TO ANY WOMAN UNTIL WE FIGURE OUT WHAT THE HELL IS GOING ON .INCLUDING DEBATING WITH PRESIDENT Hillary Clinton","post_message":"She wants textbooks changed."}]
