[{"comment_id":"1218898121528016","commenter_b":"@username ..... What I really believe , is that the Republicans will have Trump tossed out of office within the first year. He is a Dangerous person , and he also has far too many enemies within the party. That is why he is surrounding himself with people he feels are loyal to him instead of people that actually have some knowledge of what really needs to be done. They are not going to forgive and forget his insults and his horrible attacks on them and their families. Ted Cruz and the gang are just biding their time until the inauguration. Pence Will be President and then the country will be run as a Christian Caliphate.","commenter_a":"Exactly right ! And make no mistake , Pence IS going to be president ! Seriously ... I don't know which one will be worse !!","post_message":""},{"comment_id":"10152869461365927","commenter_b":"\"kill another Fetus now, we don't like Children anyhow\"","commenter_a":"If Republicans supported an organization that murdered 90,000 black babies last year OMG. PP would be the worst place since the death camps of the Nazi's. But godless \"Demon\"crats like Hillary are the true racist as they use PP as a form of population control to keep black birth rates down and the black population under control. Dems have always been the party of hate(KKK) and division, they still are they have just convinced the black race that they are their friends and supporters,,,,, really","post_message":"Planned Parenthood Director of Research Melissa Farrell makes STARTLING statement about dissecting aborted babies ..."},{"comment_id":"818563178203701","commenter_b":"For what? Please elaborate...","commenter_a":"Impeachment now","post_message":"Before we voted to defund President Obama's unconstitutional actions on immigration, Speaker Boehner read 22 direct quotes where President Obama argued, in his own words, that he couldn't act alone on immigration. Here are the quotes: March 31, 2008: “I take the Constitution very seriously. The biggest problems that we’re facing right now have to do with [the president] trying to … not go through Congress at all. And that’s what I intend to reverse when I’m President...” May 19, 2008: “I believe in the Constitution and I will obey the Constitution of the United States.” May 5, 2010: “Anybody who tells you … that I can wave a magic wand and make it happen hasn't been paying attention to how this town works.” July 1, 2010: “[T]here are those … who have argued passionately that we should … at least ignore the laws on the books... I believe such ..."},{"comment_id":"10153941213411162","commenter_b":"Lacey why are women lazy for not changing their last name? You should speak for yourself only.","commenter_a":"isnt her name Erica Crosby.. ijs.., she was his wife.... right","post_message":"HUSBAND PLEADS GUILTY: Kyle Crosby, 29, has pleaded guilty to murdering his wife who went missing on New Year Eve, 2014. Erica Crippen body was found March 17. As part of a plea deal, charges against Crosby mother have been dropped. FULL STORY: @webpagelink"},{"comment_id":"1197700750270781","commenter_b":"Get over it. The water is theirs. Respect it.","commenter_a":"@username I just adore you!!!","post_message":"These sharks aren't actually all that scary when you get your facts straight. Something else is, though."},{"comment_id":"467133756816336","commenter_b":"That is a disgusting fact. Those people should be ashamed to call themselves 741915279236631s","commenter_a":"That is a shocking testament of liberal standards & ethics!","post_message":"A new poll found 71 percent of Democratic voters believe Hillary Clinton should keep running even if indicted, a view shared by only 30 percent of Republicans. Where do you stand?"},{"comment_id":"1734008936814080","commenter_b":"Kill them all with the wall","commenter_a":"Now time to sue the ones that let this happen","post_message":"Unacceptable..."}]
