[{"comment_id":"10153154293302293","commenter_b":"Oh please. Stop being a pussy.","commenter_a":"Thanks Fox News for causing hysteria among your psyco viewers and almost getting my buddies killed.","post_message":"The men had a deadly plot to lure government forces into a trap, federal officials say."},{"comment_id":"519362884912406","commenter_b":"Unfortunately, the difference is usually that they are dead after interacting with her...","commenter_a":"Bye","post_message":"Hillary Clinton: \"I am not a natural politician like my husband or President Obama...I just have to do the best I can, get the results I can, make a difference in people's lives.\""},{"comment_id":"10154242244603635","commenter_b":"\"I agree you can still do all those things.\" So then you were making things up before. Glad we got that straightened out. \"I've known of kids getting suspend from school for praying before they ate lunch\" If that actually happened, the school involved broke the law. \"Employees were not allowed to say Merry Christmas it was happy holidays. She told me that.\" Right, because saying \"happy holidays\" is more inclusive. Of course, while not on the job, she was completely allowed to say \"Merry Christmas\" to her heart's content. \"There has been a huge change in this country for the last 25 years of Christianity being slowly phased out by our government.\" Not really. Christianity has never been part of our government, since it's not supposed to be. The first amendment makes that clear.","commenter_a":"I guess this is another step on kicking God out of this country.","post_message":"Indiana city renames Good Friday \"Spring Holiday\" to be more inclusive"},{"comment_id":"10153955448341350","commenter_b":"She's a cold, calculating bitch.","commenter_a":"From her big warm embracing feminine heart ... are you kidding me? Voting for Hillary because she is a woman, makes no sense at all.","post_message":"\"I want my president of the United States to make decisions on my behalf based on her experience, her command, her intelligence, and from her big, warm, embracing, feminine heart.\""},{"comment_id":"10153238484143984","commenter_b":"Screw the bitch and her lying ass husband.","commenter_a":"Move out bitch","post_message":"People are furious, and I can understand why. Do you think Michelle is an out of touch First Lady?"},{"comment_id":"1415750351836830","commenter_b":"She was with the head writer of SNL and the woman who plays her on SNL skits. They All suck!!!","commenter_a":"id bet they were laughing at each other because they couldn't decide who was SKANKIEST.....","post_message":"Hillary raised a lot of eyebrows with her dinner guest..."},{"comment_id":"10154431289101523","commenter_b":"Can they deport you with him?","commenter_a":"Throw the books at them.........I'm calling for 10 yrs! Better yet deport them!!","post_message":"Guns, body armor and marijuana located during a traffic stop in Germantown."}]
