[{"comment_id":"1038422129567160","commenter_b":"What a POS !","commenter_a":"Go home to Canada and take hiller with you.","post_message":"CRUZ F*CKS CONSERVATIVES, VOTERS and TRUMP  @webpagelink"},{"comment_id":"1021881241225156","commenter_b":"@username bildim niye chocolate sevirsen :D","commenter_a":"Turkan M. Devrijova, @username duz deyirmish :D chocolate is good","post_message":"People who love chocolate are more likely to be clever"},{"comment_id":"10154705927224255","commenter_b":"Pence is no more Christian then I am, but at least I am not a hypocrite. I don't believe at all.","commenter_a":"For as bad as Trump is, Pence is just as horrible and probably more terrifying since he tries to hide his awfulness behind his bible and has no problem signing bills into law that he doesn't even read. With Trump being \"one of the most impeachment-ready candidates ever” Pence is who would be running the White House. Here are just a few of the deplorable and insane things that Pence has done in his career of screwing over Indiana and what we could expect as a Pence run administration. - He looks up to Dick Cheney as a role model for Vice President...that alone should scare the crap out of folks. - He regularly goes blank, forgetting what he was saying, and seemingly losing track where he is and what he is doing. - He is anti-science. - He has made a career out of destroying Planned Parenthood, Roe v ...","post_message":"Bravo, Tim Kaine!"},{"comment_id":"10153759258966694","commenter_b":"Do not compare this to GOT...or dr who....or any other shit please...","commenter_a":"Oh, gee, you don't really mean it's going to make my brain explode, do you? Like The Walking Dead was supposed to make my BRAIN EXPLODE, and Game of Thrones was supposed to make my BRAIN EXPLODE, and Dr. Who was supposed to make my BRAIN EXPLODE...Seriously, how much did Raimi and Co. pay you guys to headline Ash vs. Evil Dead as an exploding-brain event? Because, you know what? Every time @username claims some stupid TV show will \"explode your brain,\" viewers barely end up with a BRAIN TWINGE. So instead of over-hyped praise, why don't you guys try something different? Something along the lines of: \"WE SAT THROUGH THE FIRST EPISODE OF ASH VS. EVIL DEAD AND WE DIDN'T GET CRAMPS IN OUR ASS.\" In short, Lower Expectations = More Pleasurable Viewing Experience. You're welcome!","post_message":"Ash vs Evil Dead is going to make your brain explode in the best way"},{"comment_id":"10153666245398984","commenter_b":"All this just so the Dems can have more illegals to for for them....Could Trump be more dead on?","commenter_a":"Thank Obama for all these murders, he is the one responsible for letting thdm in the country!!!","post_message":"This is a horribly tragic story, especially since it involves an illegal who should never have been in this country. Please join us in sending thoughts and prayers to the families of the victims.  Are you against amnesty for illegals?"},{"comment_id":"10152822135907434","commenter_b":"You are no gentleman.","commenter_a":"Sure, dude.","post_message":"\"It’s not just about me. It’s about all of us accepting one another.”"},{"comment_id":"908006605999185","commenter_b":"Just try to take mine down!","commenter_a":"Good for USA...fuck obama","post_message":"This is HUGE!"}]
