[{"comment_id":"1652238444998373","commenter_b":"White girl runs around in black face and its fine, yet if I were to do it the liberals would lynch my saltine american hindquarters.","commenter_a":"She went full retard","post_message":"Wait,... what?  @webpagelink"},{"comment_id":"968795919903853","commenter_b":"The woman is so stupid, only reason she is in because of her color.","commenter_a":"Punta","post_message":"VIDEO: Congresswoman Stands Up For Sharia Law And Actually Gets This Disgusting Response.  'LIKE' if you think Rep. Maxine Waters should be kicked out of office for showing such strong support of ShariaLaw."},{"comment_id":"10154282425457439","commenter_b":"Pussy's","commenter_a":"They are clueless","post_message":"The Armenian and Greek genocide by the Muslim Turks is reason enough not to build such a mosque. And what makes these knuckleheaded officials so sure that the imam won't teach and preach jihad. The jihadic doctrine is a critical component of Islam."},{"comment_id":"1131244553635264","commenter_b":"#BernieOrBust #BernieAllTheWay #DropOutHillary","commenter_a":"Either way it will be a Democrat all the way to the White House again for another eight years along with a Democratic majority in Congress! Many thanks to the GOP for putting up unelectable candidates election after election,those dumb idiots will never learn","post_message":"Trump must be stopped.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1118930614814076","commenter_b":"Palin has a mental disorder, do not vote for this woman at all Americans.","commenter_a":"She gives all Alaskan women a bad name. Duct tape would be useful over her mouth.","post_message":"She's mind-bogglingly dimwitted."},{"comment_id":"10153070035530399","commenter_b":"I thought I saw this woman at Hooters the other night. That's always been a good source of Broadcast talent for Faux.","commenter_a":"Just a new way for the Dummycrats to steal more votes!!!!!!!!!!!!!!!!!","post_message":"It's always Andrea Tantaros."},{"comment_id":"10154945345047439","commenter_b":"How about America waking up? You have elected a Muslim President and Muslim administration twice, and sat back idly whilst a Muslim has destroyed America and flooded it with millions of Muslims and illegals. Unbelievably, after 9/11 with almost three thousand victims, America elected a Muslim, built a further 1000 mosques and sent $770 million of US tax payers money, to restore mosques overseas. Since 9/11, you have suffered a further 51 Islamic related/honour killing attacks, with another long list of victims. Millions of illegals have simply walked into America and massively include, rapists, drug users, hardened criminals and sex traffickers. Despite thousands upon thousands of unscreened Syrians entering America each month, millions of white Americans are voting a 550% increase in unscreened Muslims, amnesty to over 11 million illegals and 650 miles of open borders. Trump is telling the world that American's are an absolute embarrassment, on how they ...","commenter_a":"Europe needed to wakeup 10 years ago, at this rate they are FINISHED, I hate to say it but this is what You get when You let Females rule countries... I know that sounds sexist, but there are not many M. Thatchers out there!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
