[{"comment_id":"10152722810447014","commenter_b":"Go back to your country, boy! 'We don't like yo kind around here!' WHITE POWER!!! Lol","commenter_a":"Her come the racist white people...","post_message":"Do you agree with President Obama's executive action on immigration, which shields millions of undocumented immigrants from deportation?"},{"comment_id":"1306220052736740","commenter_b":"Trump has everything a person could want so he just wants to pay American back!! Hilary tried to steal furniture from the white house the first time around","commenter_a":"Hillary should be in prison! Treason and lying are her crimes. Benghazi will never be forgotten as she turned a deaf ear to our own and did absolutely nothing! Trump in 2016! 🇺🇸🇺🇸🇺🇸","post_message":"As of now, Donald Trump and Hillary Clinton appear headed for a showdown in November. Who gets your vote in this matchup: Trump or Clinton?  LIKE Opposing Views for more breaking news and analysis!"},{"comment_id":"10153475865743645","commenter_b":"Yes and she is a real b:tch","commenter_a":"Was the gator named karma ?","post_message":"He jumped into a pond to hide from authorities and an alligator attacked him."},{"comment_id":"10153633872565950","commenter_b":"Yeah! Lets send everyone back to where they came from! Build a wall ! Its back to Europe with you my friend:)","commenter_a":"And this is NEWS , Why??? Don't even care or know who this guy is... Stay out of Mexico and South America and guess what?? You will be safe...","post_message":"25-year-old Alan Pulido is a forward for Olympiacos of Greece and was part of Mexico's 2014 World Cup team."},{"comment_id":"932212166798963","commenter_b":"MEN are selfish!","commenter_a":"people can look at ass and other provocative videos all day. Things that children have easy access to and could potentially mess their mind, but yet everyone continues to make a big deal of pregnant/breastfeeding women. We need to get our priorities straight. #FirstWorldProblems.","post_message":"Pregnant meteorologist Kristi Gordon has been getting emails like this: '... it is not pleasing to look at hump every day PLEASE have her take her mat leave now.'  (Via The Huffington Post British Columbia)"},{"comment_id":"756897567834154","commenter_b":"Bitch","commenter_a":"We all talk on facebook but it does no good.The women can't see what Hillary is or they haven't Google her.She was not brought up poor.never went one day without food clothes or shoes .She is a liar er and a traitor. And those who are voting for must be as bad as she is She will end USA as we see it.Hasnt the zebra done enough destroy our country? Apparently not for you dumb asses voting for the murder.I guess you have no relation in the armed forces. Because if you do there's no way you would even consider voting her in.Open your eyes","post_message":"Hillary Clinton's Career Could Be Over After She Was Caught Endorsing The KKK [VIDEO]  She is doing everything she can to get this video taken down. Let's spread it.  Do you think Hillary Clinton is not fit to be president?"},{"comment_id":"1111727715607435","commenter_b":"sick woman in many ways and not to be respected!!","commenter_a":"Clinton stood tall and showed she was someone to be respected, unlike the baby bully who consistently showed his ignorance and called name likes like a third grader.","post_message":"The final presidential debate is in the books. Which candidate made the best case for themselves: Trump or Clinton?"}]
