[{"comment_id":"10153224206704726","commenter_b":"What is this surprising? That's what her husband preaches to us all... GIVE ME..GIVE ME","commenter_a":"She needs to be charged Millions for just being allowed to live in WH.","post_message":"WATCH: Obama: Michelle Upset She's Not Being Paid as First Lady"},{"comment_id":"10152956638371051","commenter_b":"Clueless jerk off!","commenter_a":"I\"d tell them to kiss my ass!!!!!!!!!!!!!!!!!","post_message":"When a mom received this note about her son from a neighbor, she thought it was a joke."},{"comment_id":"10154136860436051","commenter_b":"She does crack","commenter_a":"Clinton and what is that obsessive sniffing","post_message":"Who won the debate: Trump or Clinton?"},{"comment_id":"593997884104848","commenter_b":"God help us all...God please Bless America! No Hillary!!!","commenter_a":".......President means MAN! .amen.","post_message":"Nancy Pelosi said confidently today that Hillary Clinton will be the next president of the United States. Do you hope she's right?"},{"comment_id":"10153519405836680","commenter_b":"You are exactly right @username. It's so sad how ignorant and blind people have become. Saying we need illegal immigrants. Wow. Have you people not seen what's going on in Europe. No they need to come to this country legally people... Thank God we are gonna get it fixed this November. And that's how it will be. We will have a safer country. Trump2016!!!!!!!!!!!!","commenter_a":"Let us call it what it really is \"Bernie Sanders hugs illegal aliens at campaign rally.\". They are not undocumented immigrants because they have not followed the immigration process to get here. They are criminals. Justice needs to be dealt out to them.","post_message":"Bernie Sanders hugs undocumented immigrants at campaign rally."},{"comment_id":"10158473040100354","commenter_b":"What a TERRIBLE thing to say","commenter_a":"They all need to be put in Prison. Oh, after their asses are beat.","post_message":"~~~FIRESTORM~~~"},{"comment_id":"1388314524545146","commenter_b":"Someone should kick this Muslim Animal out of our country years ago.","commenter_a":"Delusional moron!","post_message":"Just another scumbag black leader who hates Jews...boy, sure glad we helped them with their civil rights in the 60's - WE WERE THE ONLY ONES!"}]
