[{"comment_id":"10153293386166051","commenter_b":"And he should step down.....","commenter_a":"I'm with him!","post_message":"Do you agree or disagree with this judge's position on marriage?"},{"comment_id":"779978185438256","commenter_b":"And she is responsible for 100s of men being killed.","commenter_a":"In the Commander In Chief Debate tonight, wondered if anyone noticed that Hillary was wearing an earpiece. See picture here at @webpagelink Only thing that makes sense was that she was being fed the answers. That's why she sounded so scripted and robotic. Donald Trump was Presidential tonight. Hillary's \"in you face\" lies to the Veteran who asked the question about National Security cannot inspire confidence in the American public. How can anyone still support her? Trump is the only choice! America First is the plan!","post_message":"THANK YOU to our fantastic veterans. The reviews and polls from almost everyone of my Commander-in-Chief presentation were great! In addition, THANK YOU for hosting us this evening, Intrepid Sea, Air & Space Museum! -DJT"},{"comment_id":"861030830662191","commenter_b":"That's why we can't allow Muslims in","commenter_a":"Tragic.","post_message":"THE LATEST: At least 100 killed inside Paris concert hall"},{"comment_id":"10153184020474726","commenter_b":"What a disgusting a hole.","commenter_a":"what a piece of dog feces","post_message":"\"He didn't win, did he?\"    Harry Reid confronted on his lies, with no regrets."},{"comment_id":"10155604314476509","commenter_b":"I love it. Obama Obama Obama. Biden Biden Biden best Pres and Vice President ever","commenter_a":"At this point what difference does it make","post_message":"Biden: I'm not giving them the wifi password  Obama: Joe..."},{"comment_id":"1065968390113738","commenter_b":"William Tryon WOW...totally makes sense NOW, 10 Celebs Moving that Already Own homes in Other Countries, In Exchange FOR LUNATIC Trump Promising TO Send OUR KIDS to WAR...Excellent Logic!!! NOT!!! Our Country is Not A Business For Trump To Practice HIS Failures ON--IT'S OUR COUNTRY!!! MoonStruck \"SLAP\" Snap Out Of IT!!!! Trump has Infected Our Country With IGNORANCE The Worst EPIDEMIC! Trump Rising! DID the Hiel Hitler Salute On National TV for the World TO SEE..Disgusting!! VOTED For TRUMP & Got KIM JONG UN & Porn Star.... WWIII-- DO WE Want ALL Our Kids To Get Drafted Into A Greed WAR for Trump!! THE Epidemic in Our Country by OUR OWN Citizens Addiction TO Porn, Drugs & Human Trafficking is a Major Problem IT Comes By Boats, Planes, Trains & Automobiles CUT the Consumption Solve The Problem that Huge Problem. MEDIA Has Attached ITSELF TO Trump's BOOB because MASSIVE Orange ...","commenter_a":"Another reason not to vote for Ted Cruz. #Trump2016","post_message":"“The only guy who can beat [Donald J. Trump] is Ted Cruz.”   Breaking News: Carly Fiorina has endorsed Ted Cruz for president."},{"comment_id":"573149506180643","commenter_b":"They don't get nearly enough credit. Donald is right....stop them from entering the U.S. temporarily. We are in danger.","commenter_a":"Obama will probably have him fired for roughing up a terrorrist.","post_message":"Federal Agent Risks Everything To Stop ISIS Terrorist Disguised As Refugee From Setting Off Bomb In Texas  This man is a hero. Let's show him our support.  Can we get 50,000 'LIKES' for this federal agent?"}]
