[{"comment_id":"1141577959271788","commenter_b":"Then do you forgive slavery?","commenter_a":"I see nothing wrong with it. It is inappropriate to judge a previous generation by the information and ethics of another generation.","post_message":"\"The first thing I thought when I stepped off the train was, 'I don’t belong here.' \"  - Jim Tanimoto, recounting his life spent behind the camp's barbed wire."},{"comment_id":"10153162579468908","commenter_b":"Unfortunately A LOT of people fall into this category. Sex is everywhere and to too many it is everything.","commenter_a":"When sex rules your life you have zero power and nothing to contribute to society. No better than an addict. No power No control over your own life. Puppet. Set yourself free.","post_message":"Something we should all consider when it comes to porn.."},{"comment_id":"10154992075558256","commenter_b":"I agree","commenter_a":"Nobody equates \"America First\" with WWII references anymore - most of that generation is no longer alive. If you walk up to the majority of Americans on the street they will not be able to identify that historical reference. You are stretching for a story here.","post_message":"The phrase galvanized a mass populist movement against U.S. entry into WWII. While it attracted a wide array of support, its highest profile spokesman, Charles Lindbergh, blamed American Jews for pushing the country into war.  Trump started using the slogan in the later months of his campaign, and despite requests from the Anti-Defamation League that he drop it, he stuck with it."},{"comment_id":"10153494400717093","commenter_b":"They some hoes","commenter_a":"@username Mayra Castaneda","post_message":"Instead of going into a legal battle, the Dallas owners want the public's help picking a new name for the restaurant. @webpagelink"},{"comment_id":"10152850762031748","commenter_b":"Whose boobs is he reaching for? :)","commenter_a":"This is beyond bizarre!","post_message":"Religious Right pundit claims Satan is using gay rights to persecute Christian athletes"},{"comment_id":"10152987846462483","commenter_b":"Stfu fat cunt","commenter_a":"Chattanooga did lower the flags. A presidential declaration is not necessary for every death that occurs unless it is someone who has national level. A state or city can lower the flags without a presidential declaration. People need to inform themselves about the flag lowering issues. If we lowered the flag for every person that got killed, the flag would never be flown at full staff.","post_message":"Former U.S. Navy SEAL Marcus Luttrell pleads on his Facebook page, \"Think on it. RIP brothers, your families will miss you, the country will mourn you, and those still wearing the uniform will never forget you...Oh one more thing, lower the FLAG!!!!!!!! Sir.\"   The flag has been lowered at the United States Capitol in Washington, D.C., but no word yet on whether the flag will be lowered at The White House."},{"comment_id":"984804904949095","commenter_b":"They had the taser pointed at him which caused him to panic most likely why not use the taser??? The other 2 cops didn't shoot and did not feel they were endangered.","commenter_a":"@username keeps stirring the pot against cops. I hope one day, you folks need a cop. Crickets is all you'll hear.","post_message":"In 2013, Officer Randal Kerrick shot former Florida A&M University football player Jonathan Ferrell, who was unarmed, 10 times."}]
