[{"comment_id":"10154916215254330","commenter_b":"She should be arrested and lose her job.","commenter_a":"I am not saying this is right but I have seen countless similar things of people doing this type of thing to images of Obama so everyone should just chill with the outrage , where was the outrage when it was Obama images being hung !!","post_message":"The video shows a woman pointing what appears to be a toy gun at a video of President Donald Trump and pretending to shoot at him several times, saying \"Die!\" ---> @webpagelink"},{"comment_id":"10153871207061336","commenter_b":"No dear, Hillary Clinton was First Lady, a US Senator and Secretary of State. This little nobody was never anything close. Glad to help you. Leave the comedy to the professionals.","commenter_a":"This little nobody from Arkansas with no job is still making noise? LOL!","post_message":"\"That's one of the frustrating things about this president – he always tries to make it that he has the moral authority and everybody else is wrong.\" This morning on \"FOX & Friends Weekend,\" presidential candidate Mike Huckabee slammed President Barack Obama's approach to policy disagreements. @webpagelink"},{"comment_id":"935661276474731","commenter_b":"Entitled because men who sit that way feel entitled to the space they take up. If they take up 3 spaces those are two people who are standing that could have been seated. Not only are they denying people access to a seat, these men are making whoever is sitting next to them very uncomfortable. These men have no idea they are doing this, therefore their taking up of incredibly more space than others is more important than others feelings, never mind they feel they are more entitled to take up 3 spaces than 2 more people are entitled to a seat. Did you see the picture from Seattle? Two men were encroaching on this poor girls space! Yes there are other issues in the world but do you see that feminists ALSO pay attention to them as well? We are capable of multiple thoughts you know. And keep in ...","commenter_a":"..... why is this seriously an \"entitlement\" issues? Do you not see how pathetic it is to be upset because of \"spreading \"? For fuck sake, you're criticizing posture, might add well discuss \"man shaving\" why can't a woman shave get fave without feeling ostracized? Or \"man shoing\" why can't shoes be unisex, why are they discriminating against what gender you have to be to wear a pair of shoes? Or my personal favorite \"man shirting\", why are men's buttons put on one side and women's buttons on they other side. Dear god, these misogynistic assholes have gone to far with their shirts... give me a fucking break. This is, by far, the most unflattering and pathetic issue discussed in the feminist movement. Take on real issues and matters that actually affect these everyday women, the glass ceiling, wage differences, rape offenses. Giving time and thought into little things like ...","post_message":"They both spread their legs on the subway, but only one raised eyebrows. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"236889993435379","commenter_b":"What a lousy excuse of a woman! You do not speak for me!","commenter_a":"What the hell was that","post_message":"Holy mother of batsh*t!"},{"comment_id":"483464435177470","commenter_b":"Fuck you cunt lips","commenter_a":"The reason you are seeing her all of a sudden is to take the heat off of Obama . When thing get sticky with Obama his handlers bring out Michelle, or Biden. It is to take our minds off of Obama. Don't be fooled, Michele has no power, she is a fixture . I would venture to say she and her husband have very little to do with each other. It's for the television camera only. She was bought and paid for just like he was but her thing is just until he leaves office..","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"823822871141623","commenter_b":"Every intelligent person knows about Hillary what she is. LONG TIME AGO SHE HAVE lost people trust","commenter_a":"YES, I SURE DO!!","post_message":"Once considered for Hillary's VP, this Navy Admiral wants nothing to do with her. Hillary is a criminal and belongs in jail. Do you support this Admiral's act of defiance?"},{"comment_id":"729190623881952","commenter_b":"You say that as if the right wing doesn't itself demand political correctness. The right wing gets its panties in a wad if someone dares say, \"Happy Holidays\" instead of \"Merry Christmas.\"","commenter_a":"Political Correctness is not a joke ... it's a dangerous growing cancer in our society and it's going to destroy our nation if we don't stand up for our freedoms while we still have them ....","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.” Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"}]
