[{"comment_id":"10155074124493258","commenter_b":"Hold fast against the Turd !","commenter_a":"\"A man reaps what he sows.\" Galatians 6:7. If you sow hate during the primary and the general election campaign, you reap hate, if you sow discord, you reap discord. #Galatians6","post_message":"‘‘We march today for the moral core of this nation, against which our new president is waging a war,’’ America Ferrera told the crowd at Women's March on Washington."},{"comment_id":"836801636436616","commenter_b":"Any one doing this should be around up put in jail and when it is time to get out they should be deported","commenter_a":"And those BASTARDS in DC want to bring in over @username in the next two years. HELL NO","post_message":"Broad daylight in Germany. Watch Muslim 'refugees' beat the crap out of this mom and daughter. Can you say, 'extended magazines?' @webpagelink"},{"comment_id":"1130843966969767","commenter_b":"Good keep them there and deport them","commenter_a":"Like packs of hyneas.","post_message":"UNREAL! SOMALI MUSLIMS RAMPAGE Through Mall Of America In Minnesota...10 Arrested [Video]"},{"comment_id":"10154342587333258","commenter_b":"David Mayhew The problem with your statement is that your assumption is that just because they have been drinking, they are going to use a gun. Just because a guy drove to a bar with his car does not mean that he's going to do something irresponsible with it. I guess we should start seizing the cars of bar hoppers. Or we could categorize those cars that are most often DWI that injure or kill someone as \"assault cars\" and start seizing those.","commenter_a":"Fewer guns would not have stopped this lunatic. We need more good people to be able to lawfully carry guns into more public places because the criminals will carry them wherever they want.","post_message":"The common thread in too many mass shootings was the availability of powerful semiautomatic weapons that serve no purpose but to kill. | Via Boston Globe Opinion"},{"comment_id":"453510694837224","commenter_b":"I love it! muslims do not belong within our borders!","commenter_a":"Arkansas get on the ball, and do the same.","post_message":"If you don't like our laws and constitution...we can help you pack and leave!!!"},{"comment_id":"10153401105516350","commenter_b":"She was rude","commenter_a":"He was very rude with Savanna this morning with the \"would you rather\" bit.","post_message":"\"I've been to therapy since,\" the America's Got Talent judge said."},{"comment_id":"10153863416478812","commenter_b":"Lmaooo @username","commenter_a":"@username @username @username Abbas Maki @username @username the title and the caption are hilarious! I feel bad laughing lmao","post_message":"UNEXPECTED VISITOR: An 83-year-old thought the loud noise she heard was just the weather. When she looked outside, she found a Ford Mustang parked…on her roof. @webpagelink"}]
