[{"comment_id":"517780028410290","commenter_b":"Send them to a boot camp along with their parents, they soon will learn respect! And cut off their welfare,so tired of supporting these aminals!!!","commenter_a":"THE BOY IS A PUNK","post_message":"INSANE..."},{"comment_id":"967437919978383","commenter_b":"Bruce, you're just doing way to much now....you've had your 'fun' trying to outdue the Tupperware Girls and all, but this is enough now","commenter_a":"Ratings dropped.","post_message":"In one tweet, it seems Caitlyn Jenner's political support may have shifted."},{"comment_id":"923666907700065","commenter_b":"That hoe better learned how to fight cuz we gon square up lmao","commenter_a":"'@username if I ever find out my daughter sucking dick idgaf she can get it . lmao go to her school and embarrass her. lmao","post_message":"Mom Beats Her Daughter In Broad Daylight For Sucking D!"},{"comment_id":"10153198531370950","commenter_b":"Yes, she was just hoping some cop would come in and throw her across the room. See how stupid that sounds?","commenter_a":"def smell a get rich quick scheme in the works :( ugh ...........it was all her own damned fault ,,,,,,,,,,,no payment is deserved !!!!","post_message":"'She now has a cast on her arm, she has neck and back injuries. She has a Band-Aid on her forehead where she suffered rug burn...,' the student's attorney told ABC's 'Good Morning America.'"},{"comment_id":"1023389334348744","commenter_b":"freaking australia","commenter_a":"How so they come up with 95 millions years?","post_message":"This bizarre species of shark is thought to date back at least 95 million years."},{"comment_id":"936584933056721","commenter_b":"Well bye bye you illegal immigrant because your ancestors aren't from here .","commenter_a":"Black life's matter movement is a threat to law enforcement! The Obama administration is a threat to law enforcement! Islam is a threat to law enforcement! Illegal immigration is a threat to law enforcement!...... This man is not!","post_message":"In a video he apparently posted last week on Facebook, Jon Ritzheimer calls out New York-based The Islamic Post for calling him the 'American Taliban.' Now the FBI has issued an alert, citing he is a  threat to law enforcement."},{"comment_id":"10153244539676756","commenter_b":"And women like @username have no problem eating corn on the cob with those buck teeth!!","commenter_a":"Glad I live in the U.S.!!","post_message":"In Russia, women are prohibited from doing 456 types of work.   In Nigeria, it's not a crime to hit your wife for the purpose of 'correcting' her.   In Iran, a woman can be jailed for not following the Islamic dress code, which includes wearing a hijab."}]
