[{"comment_id":"1805566076381553","commenter_b":"Leave it alone!!!!","commenter_a":"I vote no!!","post_message":"They are going to change Ole' Glory to this! Leave our flag alone. Do you think the American flag should not be altered?"},{"comment_id":"10153534003896336","commenter_b":"He's also a Democrat","commenter_a":"our Massachusetts senator markey voted not to defund planned parenthood","post_message":"BREAKING NEWS: Senate blocks Republican legislation to defund Planned Parenthood. @webpagelink"},{"comment_id":"10153050664571615","commenter_b":"@username stfu","commenter_a":"Omg abortions cops killing people rape wtf were talking about a dog killer people come on try and keep up lol people make me laugh","post_message":"NEW FALLOUT: Last night we told you how the Animal Rescue League was distancing itself from The Pittsburgh Steelers following the signing of quarterback Michael Vick.   The second organization that has decided to suspended all activity with the team plus reaction from fans – tonight on Channel 11 News at 11."},{"comment_id":"10153875046907235","commenter_b":"So did Ollie North! The fuckery.......","commenter_a":"\"Former United States Attorney general sold guns to drug cartels.\"","post_message":"WHOA"},{"comment_id":"1728040457449467","commenter_b":"She is bad to the bone","commenter_a":"She is bad to he bonem","post_message":"“Here’s Hillary Clinton campaigning in favor of women, while the foundation that she and Bill own pays men 38% more than women.”  Newt Gingrich shared some shocking statistics with Sean Hannity regarding the Clinton Foundation."},{"comment_id":"10153064039634411","commenter_b":"Apart from the many proven lies? He was a cold blooded killer, how's that heroic?","commenter_a":"That bit about Jewish controlled media ... Whoa! How repetitive. And untrue. A sniper's job is to reduce the length of war by taking out one person at a time who appears to be aiding the killing of Americans. Thus Not mowing down a big group, thus not continuing backlash. Yes, he died young, at age 38. The movie is portraying the truth.","post_message":""},{"comment_id":"10153629866881336","commenter_b":"She is pathetic and out of control.","commenter_a":"Miley is a marginally talented girl with very little respect for herself. Billy Ray should be ashamed.","post_message":"What did you think of Miley Cyrus' barely-there ensemble?"}]
