[{"comment_id":"1851627945062122","commenter_b":"Rosie would hate it if her wife has a pic out there like Melania's and she were compared to other lesbians, just saying","commenter_a":"Rosie lacks any semblance of class... what a hateful, mean thing to do. Thank you God that Trump is our next president! This left wing ugliness is hard to take..","post_message":"OUTRAGE...! Rosie O'Donnell TWEETS naked photo of Melania Trump when comparing her to other First Lady photos. WARNING: Nudity. @webpagelink"},{"comment_id":"1339288666111988","commenter_b":"🙄🙄🙄 could have killed thatboy","commenter_a":"@username when @username used to wake us up every morning with his music","post_message":"Peace, love, and coexistence — this Christian man helps Muslims observe their holy month. (via NowThis)"},{"comment_id":"1269332673102189","commenter_b":"Becky, RAISE YOUR HEAD UP OUT YOUR BOYFRIENDS LAP, CHILD!","commenter_a":"Sorry but safety of USA citizens comes before everyone else!! This is All on Obumfuck!","post_message":"The youngest Nobel Prize winner says it perfectly."},{"comment_id":"1168788129800109","commenter_b":"******TRUMP..... 2016 **** DESTROY ISLAM AMEN....pass the ammo \"SWIPER NO SWIPING\" *no illegals voting Quote..DORA THE EXPLORER *BLACK LIVES MuRDER ...jokes","commenter_a":"Lol She should have to wear a lie detector at all time....that zaps her when she fibbs","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"},{"comment_id":"1214214798614861","commenter_b":"From Chris (Author of this article) he mentioned \"dangerous batteries\". Well what did you know the whole world is putting blames on a company instead of the provider. Talented consumers indeed. Personally the problem probably lies with the performance output and the batteries supplying the phone. Note 7 is a heavy powerhorse so... overexerting the battery could damage it.","commenter_a":"This is worst than the BlackBerry disaster.","post_message":"BREAKING: Samsung ends production of the Galaxy Note 7."},{"comment_id":"10153598011598812","commenter_b":"She is like.... Told you to stay away from those blonde white bitc... lol","commenter_a":"With his mommy right beside him worried about where her money is going to come from now","post_message":"Former FSU quarterback says \"I totally should have walked away\" after video surfaces showing him punching woman in the face."},{"comment_id":"10153888153653352","commenter_b":"You said it all...Thank you!","commenter_a":"I feel she should have been fired.... possibly fined. Holding her in jail until she changes her mind is a waste of tax dollars and time.... yes this woman stood up for what she believed but she still had a job to do .... not only did she refuse to issue same sex marriage license but she didn't allow the people under her who were willing to issue them either.... that is wrong..... this woman used her title and athority and held an entire government staff to her religious beliefs ... she didn't have to issue them she could have let someone else do that and still be faithful to God's law.... this country was built on freedom of religion. That means no law can be withheld or upheld based on religious beliefs.... she made an oath to follow the laws of the US , as soon as the laws ...","post_message":"Defiant Court Clerk, Kim Davis, Will Be Held In Jail Until She Agrees To Issue Same-Sex Marriage Licenses! CHRISTIANS WHAT IS YOUR REACTION?"}]
