[{"comment_id":"915027651932695","commenter_b":"Yes","commenter_a":"YES!","post_message":"Follow us for more at BuzzKix"},{"comment_id":"10153508194124087","commenter_b":"Paid shills","commenter_a":"Twenty-six years ago when Savvy Woman ran him on the cover, four of the eight people in Trump innermost circle were women, including his then wife Ivana, who was not in any of these particular photos but who was running the Plaza Hotel at the time. The others, all executive vice presidents, were: Barbara Res, who was in charge of construction of Trump Tower and then the Plaza; Blanche Sprague, head of project development; and Susan Heilbron, who was Trump chief lawyer.","post_message":"“Nobody has more respect for women than I do,” Donald J. Trump said. “Thirty years ago I had a woman building a major construction project in New York City. That never happens. I’ve been great to women and they’ve been great to me. I’ve had so many women executives [and] they’ve done a great job.”"},{"comment_id":"1676407832621088","commenter_b":"#TrumpTrain #StopHillary #BernieSucksCock","commenter_a":"Based Ben AMIRIGHT @username","post_message":"Thank you Dr. Ben Carson! An honor to receive your endorsement this morning."},{"comment_id":"1009572635788547","commenter_b":"That's terrible!!! I worry about my children everyday at school!!!!","commenter_a":"Really. Bullying. Is wrong","post_message":"A sixth-grader died Tuesday after a bully stomped on his chest during a P.E. class at a Colton elementary school, the boy's parents told KTLA.  \"This kid did it on purpose,\" said Jose Gallegos, whose 12-year-old son Dominick died after losing consciousness on the field.   However, detectives who went to the hospital where Dominick was taken said there was no evidence of an assault or physical injury that would have caused his death. Investigators are waiting for a report from the coroner's office.   Read KTLA's story here: @webpagelink"},{"comment_id":"10153727923344153","commenter_b":"Leave them where they are at!!! Fix their country!!! Build camps at their country, protect their country and teach them to protect themselves against their issues as we still have to learn to deal with ours and protect our people and shelter our vets and homeless and dude in 30 more years I better have my social security I put into that pot religiously for me not for them !!!!!!!","commenter_a":"I still feel the same way : JUST SAY NO TO SYRIAN \"MIGRANTS!!!!\"","post_message":"Has your opinion on taking in Syrian refugees changed since the Paris attacks?"},{"comment_id":"10153992409688132","commenter_b":"Bet she can't do it again! Lol","commenter_a":"Bye Felisha","post_message":"The force of the blast tore her body apart, complicating officials' efforts to identify her."},{"comment_id":"10153623259427623","commenter_b":"@username coming here isn't a right. And yes, it is the same thing. Building a wall to keep people who don't belong here out is no different than you locking your door. You lock your door to keep people out.","commenter_a":"If you lock your doors at night then you agree with Donald J. Trump. I expect my government to be at least as security conscious about my country as I am about my family. This is not racism or rudeness, but common sense safety measures in a time such as this.","post_message":"All of Donald Trump's talk of constructing a wall between the U.S. and Mexico has inspired an artist to build a little border wall around Trump's star on the Hollywood Walk of Fame."}]
