[{"comment_id":"585287011661878","commenter_b":"We don't need Muslims here for s*** this is America... They need to stay the f*** home...","commenter_a":"Get out of my country.","post_message":"Furious Muslim students rush stage during American Sniper showing.  They have no respect. If they don't like American Sniper they can leave.  Do you agree these Muslims are out of line?"},{"comment_id":"911046885608046","commenter_b":"LIKE I SAID, SHE KILLED THOSE KIDS. A BEE?! Get out of here with that mess. Throw the book at her. @username,","commenter_a":"Whatever!! She killed those kids.","post_message":"Two 18-month-old twins drowned in an Arizona canal Friday after their mom briefly let go of their stroller to fend off a bee: @webpagelink"},{"comment_id":"10156388253550389","commenter_b":"isis thinks if you get killed by a woman you go to hell.. lmao go get them girls!","commenter_a":"Just remember one thing, ladies. If you are in a position of fighting the enemy first hand like men do, the enemy will be just as fierce against YOU as they are against any man. Your feminism will not be a factor. And, if you become a POW, they will then treat you differently, but not In a way you will like.","post_message":"Defense Secretary Ash Carter announces plan to open all combat jobs to women, the Associated Press reports."},{"comment_id":"10153992409688132","commenter_b":"Bet she can't do it again! Lol","commenter_a":"Bye Felisha","post_message":"The force of the blast tore her body apart, complicating officials' efforts to identify her."},{"comment_id":"1555989074419098","commenter_b":"We'd have have a democracy in the first place to lose. Seem that ideal is long gone","commenter_a":"This is a response to the hard tack to the left by progressives. This is the fruit of your insane policies and social engineering. You have created the potential for an authoritarian American government. It won't happen instantly, but in increments. I have to admit, I prefer this future to a nation that celebrates stomping upon our flag, allowing veterans to die waiting for medical treatment in favor of allotting medical benefits to illegal aliens, and referring to children as purple penguins.","post_message":"The frightening rise of authoritarian populism in the West is a very real, clear and present danger, writes Mike Lofgren, a former congressional staff member."},{"comment_id":"10153639666243138","commenter_b":"You, m'dear, are brilliant. Wish I was a Floridian.","commenter_a":"Since we have Debbie Wasserman Schultz to hold to the fire for unfairly slanting the elections, I thought it might be productive to take her to task and donate to her democratic rival in Florida's 23 district Tim Canova. Knock her right the hell out of her seat in congress. Might wanna throw him 5 bucks and help him send her packing. It matters.You don't have to live in Fla to donate, it affects us all. @webpagelink #TellHimBernieSentYa","post_message":"I'm not saying Donald J. Trump won by appealing to the KKK, but if the hood fits…"},{"comment_id":"10153165284351770","commenter_b":"This woman is so wrong for our country.","commenter_a":"This lady is delusional, don't they do mental checks before putting people in these high ranking positions??","post_message":"Attorney General Loretta Lynch suggested that President Barack Obama could call for Congressional action for increased gun control in the wake of the San Bernardino terrorist attack.  Read more: @webpagelink"}]
