[{"comment_id":"670195519853865","commenter_b":"LEARN TO SPELL NIGGA DAMM Y'ALL BITCHES OVER TRYING TO TELL US SHIT GO BACK TO SCHOOL.","commenter_a":"Not in a million years, she is a traitor, liar, con artist, she left 4 Americans to die with out any help but then what difference does it make anyway- Bitch, hope you go to prision!","post_message":"Hear, hear!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1038357019610877","commenter_b":"If BERNIE goes Independent, or goes Green, then Good, Hillary is a bitch, a liar, a thief. BERNIE should do anything and everything he can to defeat the nasty bitch. #NeverHillary #BernieSanders2016","commenter_a":"We may still be able to achieve some things of value at the convention. Bernie's current top priority at the convention (as stated in a conference call with his delegates) is to change the Democratic party rules to 'un-rig' future Democratic primaries so they will be fair to future Democratic party presidential candidates. For him (and our delegates) to have any chance of making future Democratic primaries more fair via votes in the rules committee at the convention, we need to get all our pledged Bernie delegates funded. We are still at risk of losing over 100 pledged Bernie delegate votes, purely due to lack of funds. That's down from over 200 a couple of weeks ago because we have never stopped trying to get them funded. For everyone who is #StillSanders, can you please consider donating $2.70, $5 or $10 (if you can spare a few dollars) to help ...","post_message":"We are building a movement because this country belongs to all of us - not just a handful of billionaires and wealthy campaign contributors. And I'm asking people across the nation to come together and organize an unprecedented grassroots movement."},{"comment_id":"1184765608230962","commenter_b":"That works too","commenter_a":"Jenni Mahtinez","post_message":"Have you ever wondered how voting in the caucus even works? Because the answer is pretty weird. - Jon Comulada"},{"comment_id":"10155058445841509","commenter_b":"Well shoot - if Queen says no to him, how dare he run for President...lol - let the woman with the impeached husband take over!","commenter_a":"Not only was part of Melania Trump's speech plagiarized (word-for-word) from Michelle Obama... Also...Both the guitarist and the record company for Queen refused to authorize Trump Inc (and all political groups) to use their song 'We Are The Champions'...but of course that boundary was disrespected by Trump. Is this a Prank Show ??? THIS is stranger than fiction. When are they going to say: 'Ta-Dahhh!!! Y'all just got Punk'd!!!'","post_message":"JUST IN: Speaker Paul Ryan announces Donald J. Trump 'has been selected as the Republican party nominee for President of the United States.' @webpagelink"},{"comment_id":"10154370280236519","commenter_b":"Dear mikka, your existence proves that feminism is still very much needed in this day and age. As long as drooling troglodytes such as yourself still talk shit like this, there still is work to be done. Thanks for confirming.","commenter_a":"modern feminism is not related to feminism of the past..... modern feminism is pointless","post_message":"The plight of the bitter nerd."},{"comment_id":"1088733604470282","commenter_b":"If these teachers are not immediately fired, you can assume that there is something pretty sinister going on at that school. And just where are they getting their lesson plans, and who is allowing this?","commenter_a":"Muslims are the fastest growing bloc of Immigrants published by the Center for Immigration Studies. Also another study by American Community Survey (ACS) finds that foreign-born population in the U.S. hit a new record high 42.4 million in July 2014. Since 2008-2013, according to (ORR) Office of Refugee Resettlement, U.S. has admitted 115,617' Refugees from the Middle East and granted another 10,026 asylum. Granted Green Cards to 308,805 immigrants from the Middle Eastern countries identified by ORR as Refugee Nations making them lawful Permanent resident (LPR`s) eligible for citizenship in [5] years and petition their family members to come to the U.S.. Middle Eastern Refugees are immediately eligible for Public benefits -to the U.S. particularly the Syrian Refugees. ORR defines asylaes from the Middle East as being: Afghanistan, Iran, Iraq, Jordan, Kuwait, Lebanon, Saudi Arabia, Turkey and Yemen. As of 2013, top ten Countries for admission to the U.S. were ...","post_message":"Middle school instructs students to create ISIS propaganda"},{"comment_id":"992902970750561","commenter_b":":/ I think misogyny runs pretty rampant here. Look at what happened recently in Alberta. A dead woman's genitals were presented in court as evidence that she was stabbed in the vagina after she died from internal injuries to that organ. Usually, a doctor simply saying 'there was a stab wound' would be alright.","commenter_a":"How long before someone argues some ridiculous point on this?!","post_message":"Thanks for the image, ATTN:!"}]
