[{"comment_id":"10154374417982894","commenter_b":"Bitch u real life bitter","commenter_a":"Lol I hope someone run on stage and snatch that prosthetic belly off and expose her lying ass!!!!","post_message":"The Show Must Go On: Pregnant Beyoncé WILL Perform at Coachella...As of Now"},{"comment_id":"1174759955897808","commenter_b":"And assholes will be assholes!","commenter_a":"They are F'n PIGS... We learned that in the sixties... How soon the ignorant forget. PIGS BE PIGS... NOTHING HAS CHANGED","post_message":"We FINALLY have the proof!"},{"comment_id":"10152564279192623","commenter_b":"Notice everytime it moves up and down is when she brakes. It falls forward when she brakes. And honestly this woman in the front car has been a menace for a while now! It's about time someone got proof of her ridiculousness.","commenter_a":"the cops were called. she started in back of driver redneck lady tried to run lady and child off road first time. and slowed down to let the other in front. the phone was in a dashboard holder while taping driver not holding phone.","post_message":"WATCH: Road rage out of Randleman.   Just tilt you head and wait until about the 3-minute mark.  Egads.  Warning: Language and gestures may be offensive to some."},{"comment_id":"10153863416478812","commenter_b":"Lmaooo @username","commenter_a":"'@username @username @username Abbas Maki @username @username the title and the caption are hilarious! I feel bad laughing lmao","post_message":"UNEXPECTED VISITOR: An 83-year-old thought the loud noise she heard was just the weather. When she looked outside, she found a Ford Mustang parked…on her roof. @webpagelink"},{"comment_id":"10152653302261167","commenter_b":"Females can't pass Marine tests. In other words, they can't get out of a foxhole with loaded backpack on. What harm could that cause?","commenter_a":"Those women go through the same training as the men, do they not? Are you going to insult all of our enlisted women by telling them they aren't combat capable?","post_message":"The man who the U.S. military kicked out of Iraq for divulging  sensitive information about troop locations has some thoughts on women in combat."},{"comment_id":"10158310227560389","commenter_b":"I think they are GRRRRRRRREAT!!!!! For the first time in my adult life, in a long, long time, I feel very proud to be an American!!! President Trump has done more in his first few days, than Obama did in 8 years!!!! Thank God we are rid of Obama and his family!!!","commenter_a":"He is doing great as we expected doing what he said he would do !!","post_message":"Question of the Day: What do you think of the moves President Donald J. Trump has made so far?"},{"comment_id":"977246632310796","commenter_b":"Wth is a 'male feminist'? This term is a total failure to understand what a feminist is.","commenter_a":"Amazing! A way for men and women to share the responsibility of contraception. This is the true mark of a male feminist.","post_message":"This is ballsy."}]
