[{"comment_id":"1066627293358281","commenter_b":"You killed a clumsy one. No more clumsy spiders","commenter_a":"How is that possible? The spider isn't going to breed after it gets killed. Shouldn't TRYING to kill spiders have that effect?","post_message":"Just sayin."},{"comment_id":"10154796294188256","commenter_b":"Hahaha poor Kellog was trying to introduce cereal to inbreds that eat steaks and drink Budweiser for breakfast. I bet they realized that was a wade of money!","commenter_a":"That will not bring in any more business, only lose customers..","post_message":"Kellogg is pulling its ads from the website Breitbart News, the right-wing news organization whose former chairman Steve Bannon was tapped as a top adviser to President-elect Donald Trump ."},{"comment_id":"1131210870268774","commenter_b":"We don't care!!! So don't vote for her and fly off to your birdie page! HILLARY FOR PRESIDENT!","commenter_a":"I am a DEMOCRAT and Hillary does NOT have my vote in the Presidential Election. @webpagelink","post_message":"In 1990, American explorer and marine biologist Sylvia Earle became the first woman chief scientist at the National Oceanic and Atmospheric Administration (NOAA). For nearly six decades, she has led an international community of scientists in the study, protection, and restoration of our planet's marine life. Her unyielding curiosity and commitment to reversing the effects of climate change are a source of inspiration for environmentalists worldwide. Thank you, Sylvia."},{"comment_id":"1154229454616510","commenter_b":"Our family women don't fit in that poll.","commenter_a":"Someone is getting the wrong polls . I will only vote Trump . #He gets us","post_message":"2/3 of Women Hold UNFAVORABLE Opinion of TRUMP.  One of his senior advisors says not to worry...  details: @webpagelink"},{"comment_id":"710336325799525","commenter_b":"U R A STUPID BITCH !!","commenter_a":"Yes she is a well educated lady. She puts family first and shows alot of class. She was a model you don't hear people caalling actresses names for their jobs. She also is a women who knows how to work hard , she understands the immigration system. She also understands the average needs of the normal everyday person.","post_message":"Will Melania Trump make a good First Lady?"},{"comment_id":"10153590364786409","commenter_b":"What a bunch of caddie women","commenter_a":"Oh I could never stand her....once Regis was gone,so was the show.....","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."},{"comment_id":"911844395571846","commenter_b":"Hillary is Hillaryous!!!","commenter_a":"Oh great, more solar energy... Solyndra anyone? $535 million more in gov't grants to a failed technology? Better to build a nuke plant AND it doesn't take up as much space, it would take miles and miles of solar panels to even come close to a nuke plants energy output!","post_message":"Do you agree with Hillary Clinton? #DemDebate"}]
