[{"comment_id":"739998596133321","commenter_b":"Jesus Christ the arguments against guns here are fucking stupid. To fellow pro 2a people, don't play into their hands like this. Look. Let's pretend you were right. That the good guy with a gun scenario doesn't really deter anything. fine. Let's pretend you are right. That having guns so that people can defend themselves against tyranny isn't going to do anything. Fine. Let's pretend that we can depend on our government officials to protect us against foreign invaders 100 percent of the time without fail. Fine. Let's also pretend that you get all the gun control laws you want passed. Done. Now let's pretend that so far a vast majority of the recent shootings weren't perpetrated by individuals who up until the shooting had little to no signs of deteriorating mental health and zero criminal history. Let's also pretend that those same individuals did not purchase their firearms LEGALLY ...","commenter_a":"Liberal code. NEVER TAKE RESPONSIBILITY!!! Blame blame blame","post_message":"I know he's a grieving father but this is so WRONG."},{"comment_id":"10155148589429614","commenter_b":"Yes send them to jail!","commenter_a":"@username if I was that teacher I would have been calling the cops EVERY DAY about the abuse of that baby!! ESPECIALLY after he asked her to call the social worker!! That poor little boy knew there were people out there that could help him, and then realized how bad he was being failed by everyone","post_message":"In testimony during the preliminary hearing, teacher Jennifer Garcia said in the months before Gabriel Fernandez's death, she repeatedly reported to county child service workers new signs of abuse that prosecutors say came at the hands of his mother and her boyfriend.   In one instance, Gabriel came to school with swollen eyes and a pockmarked face, she said. At first, he said he had fallen, but he then told her,  mom shot me in the face with a BB gun, she testified.  On two occasions, she testified, a fearful Gabriel asked,  you call that lady?, referring to the county social worker. But as months passed, and the boy remained with his mother, Garcia said she began to lose confidence in child protective services."},{"comment_id":"522395871281301","commenter_b":"@username then tear it down and build bridges smh","commenter_a":"The wall was already built before he ever thought about becoming pope. Trump is a moron and needs to have people tell him how it is.","post_message":"@webpagelink"},{"comment_id":"1119178091433245","commenter_b":"She's going crazy from lack of schlong!!!!!!","commenter_a":"She is both a liar and totally stupid....and murderer.","post_message":""},{"comment_id":"1834572823431236","commenter_b":"\"Sick\" being the operative word in this article, I and the whole world are Im sure sick of these people and their outwardly show of solidarity to the outside world to get what they want, they will never integrate, that's a fool's paradise, so all those do gooders, I hope you are happy with what you have welcomed into Christian Countries. Im off to celebrate CHRISTMAS and Happy Christmas a million times over to these sick perpetrators of evil, may our God show no mercy on you.","commenter_a":"Insane, on the highest level. How dare they exploit children like this.","post_message":"Sick parents say goodbye to their children before one of them blows themselves up in suicide attack."},{"comment_id":"919874341467572","commenter_b":"WOW...THAT IS A AWESOME BEAUTIFUL PICTURE...GOD BLESS YOU ISRAEL...","commenter_a":"Beautiful!!!","post_message":"#TelAviv by Chief Eran Yerushalmi  #PicoftheDay #Israel #Beach"},{"comment_id":"798927580297819","commenter_b":"What a mouth","commenter_a":"Run those @ssholes out of the country...!!! Freedom of speech does not include burning our flag...!!!","post_message":"Protestors Start Burning American Flags, Immediately Receive Instant Justice From Patriotic Bikers [VIDEO]   Click the link below to watch the full video    @webpagelink/  SHARE this if you support these patriotic bikers!"}]
