[{"comment_id":"10154153789003010","commenter_b":"Gee, I bet General Petraeus wishes people held him to the same standard they hold Clinton. Maybe if he put a (D) next to his name, he could have gotten away with it.....","commenter_a":"Hillary Clinton has been a dedicated public servant for decades and she will be an awesome president.","post_message":"Let's not mince words: Clinton screwed up. But did she commit a crime, asks columnist Doyle McManus.   (via Los Angeles Times Opinion)"},{"comment_id":"10153550726385575","commenter_b":"Idiots! !!!! GO TRUMP!","commenter_a":"Illegals have Togo . They drain our resources , disobey our laws , take our jobs. Trump is right. If you want to be in the USA do it right","post_message":"The Gateway Pundit - Jeb Bush Bashes Donald Trump After Debate – Defends Illegals (VIDEO)"},{"comment_id":"10154450737471909","commenter_b":"Please do elaborate and share your knowledge with the rest of us","commenter_a":"Anton Deni Pamela Note the what it's about and the symbolism. I found the pine cone staffs to be interesting knowing what they really mean.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154020579286051","commenter_b":"Old dumb bitch","commenter_a":"This is a GOP lying bash Hillary bunch of bitches","post_message":"Describe Hillary Clinton in one word."},{"comment_id":"10155007053899641","commenter_b":"Wow people","commenter_a":"Good for them. Sad dt did this to them.","post_message":"Mexico is ready to hit the US where it hurts: Corn."},{"comment_id":"988508257851300","commenter_b":"what a women feel when do this?","commenter_a":"Back before social media, women's magazines used to use this as a rule of thumb for whether you could get away with going braless (if the pen falls, you can ditch the brassiere. if it stays, strap 'em in.) Which would be shaming in the other direction, by today's standards, I guess?","post_message":"Why #Underboobchallenge is going viral."},{"comment_id":"10154409316811336","commenter_b":"I think like all of us Trump thought no this can't be and thus he thought it was a joke! Then reality of course set in and the man thought as we all do who would expect anything different from the Clintons? My question what is next to come it is something every single day?","commenter_a":"Why would Trump think that such a meeting would be just a joke? All of these democrats are capable of any despicable act imaginable! They have proven it over and over again, but all we ever do about it is whine like little punks! obama should be in prison, hillary should be on trial and lynch should be removed and arrested as well! ENOUGH with the beating around the bush! We need to hit them on the head! They need to be punished severely NOW!!!","post_message":"“I'm flabbergasted by it.”  Donald J. Trump reacted to the news that Attorney General Loretta Lynch met privately with former President Bill Clinton amid the DOJ’s investigation into Hillary Clinton’s emails. Full interview tonight at 10p ET."}]
