[{"comment_id":"10154291301186337","commenter_b":"They better pay that woman right this time, she'll put your ass on blast if you negotiate her pay in any way.","commenter_a":"So they are doing a reboot of a remake? Hollywood has really run out of ideas.","post_message":"J-LAW BREAKIN' THE LAW! If Sandra Bullock plays Clooney, then is Jennifer Lawrence Brad Pitt?"},{"comment_id":"1199159113429677","commenter_b":"Pay for your own abortions, which you can find probably within a couple of miles of your campus. Grow up, get a job and don't bother adults.","commenter_a":"Keep your legs together and study.","post_message":" who are condemning my bill because it is   having the right to live a healthy life is NOT immoral and every student should have access to safe and accessible abortions especially because being a student at Cal is already so demanding. [] This is a womxn [sic] issue, a students issue, and a humxn [sic] issue. If you do not support abortions, don get one."},{"comment_id":"10153182332356051","commenter_b":"i dont read anything about this lying bitch","commenter_a":"Hell no","post_message":"Here is how Hillary Clinton is defending herself against the e-mail scandal. Do you believe her?"},{"comment_id":"10152989925996234","commenter_b":"Guess women will always be in danger after all. Even from those who sworn to serve and protect. Never marry to a cop with a badge, a gun, and a bad attitude","commenter_a":"Wow They did not hesitate to shoot an unarmed blacks. But hesitated when one of their own goes rough and shoot his wife killing her.","post_message":"A witness had a front-row seat to the tragedy that unfolded as Sgt. Phillip Seidle, police said, ambushed Tamara Seidle with a hail of bullets before surrendering."},{"comment_id":"404253609734988","commenter_b":"FEDERAL LAW says they shouldn't be here","commenter_a":"Sheriff Joe should deport himself.","post_message":"Judge blocks sheriff Arpaio's workplace raids of undocumented workers"},{"comment_id":"10153715486157144","commenter_b":"Boom bitch!","commenter_a":"Y u gotta say boom","post_message":"BOOM."},{"comment_id":"1233979523321475","commenter_b":"@username This is what I do know. He has had more than 1 stance on this. So Will the real Ted Cruz please stand up? Maybe you should learn a few things? Research... Trump does not have to do Cruz in. Give him enough rope and he will hang himself.","commenter_a":"Cruz will say anything to get elected so he can do nothing for the American people and everything for himself. Don't believe anything he said.","post_message":"Believe him?"}]
