[{"comment_id":"971724402865796","commenter_b":"Why does having a child who is American entitle one to come to USA to live? Child should leave when parents leave due to illegal status or visa expiration. They can come back on their own when of age.","commenter_a":"this is not all that is in the 14th amendment. It is only a part. there are other antiquated clauses that really formed America after the Civil War. Section 2 guaranteed that southern people would not have a say in politics for at least 2 decades. We have a president now that should be impeached for treason per this amendment, bill Clinton should never had been allowed in politics per this amendment, America's judiciary ignores whatever they want. the entire amendment needs reviewed not just one sentence.","post_message":"This may surprise a lot of liberals and Republicans alike. Spread this everywhere!"},{"comment_id":"1700042326929352","commenter_b":"Right here with my eyes open....much wider than your evidently.","commenter_a":"I just saw a posting with Trump and the same headline....too easy to to photoshop pictures these days. If you remember, bush didn't salute a Marine coming off AF1, as did President Obama....they've all done it at one time. However, I think Obama has been a great job....kept us out of a bigger depression than the big depression the last president create, but Americans have very short memories.","post_message":"Obama Refuses To Salute During The Pledge Of Allegiance [VIDEO].  Hands down the worst president of all time.  Do you think Obama is a disgrace?"},{"comment_id":"873720596067983","commenter_b":"Hey the Fuck out ugly bitch","commenter_a":"Good bye","post_message":"Well I guess she's going to say goodbye.  Will you happy to see her go?"},{"comment_id":"1485178544875222","commenter_b":"Of course we had an impact in the region through corruption but Saudi armed Sunni rebels in Syria to overthrow Assad which formed ISIS, the US is supporting groups against Assad so that Saudi can build a pipeline to Europe and destroy Russia's main source of income","commenter_a":"It does make sense though, when you think about it. Would you just accept thousands of people without carrying out appropriate checks (ie checking if they have criminal record, etc)? You wouldn't. Seeing what has happened in Europe in the last year or so is all the more reason for countries to tighten their borders. Also, people have been spreading this meme for ages so it's nothing new.","post_message":"So crass"},{"comment_id":"603575639802390","commenter_b":"Dumb bitch but I completely understand there decision to shoot the Silverback.","commenter_a":"If you are such a negligent parent that you allow your 4 year old child to fall into the pen of a wild animal, you should have to descend into the pen yourself and fight the animal with your bare hands to show society that you are still fit to be a parent.","post_message":"The zoo's decision to kill a 17-year-old, critically endangered gorilla after a 4-year-old boy fell into the animal's habitat has sparked outrage."},{"comment_id":"944282629025715","commenter_b":"Yes","commenter_a":"Yes absolutely","post_message":"Yes!"},{"comment_id":"817721241706741","commenter_b":"She hasn't even a woman very long.....","commenter_a":"I'm very happy that you are living the life you want to live, Caitlyn- but that by no means makes you an expert on all women or what is good for them.","post_message":"It takes a lot of nerve for a Ted Cruz supporter to say something like this..."}]
