[{"comment_id":"10154525720961323","commenter_b":"@username: \"In any case, the only way to deal with migration is to recognise what really causes it (inequality, proxy wars, global warming you name it) and to start coming up with responsible and honest solutions rather than shutting yourself off.\" I definitely agree. Our high levels of foreign aid and international development is only the beginning. We need to stop bombing other peoples countries and begin accepting a LOT more refugees. ------------------------------------- \"Voting yourself out of the EU has not solved that problem at all and it will most certainly not lead to more non-EU migration\" But with control of our own borders we can stop priority status for Europeans over non-Europeans and decide our immigration policies at election time. ------------------------------------- \"And if you are so concerned by population control on your island\" I'm concerned about population control on earth. I've absolutely no idea what we do about never-ending ...","commenter_a":"That is the future the masses chose. If you don't like it, do your research next time instead of foolishly buying into far-right propaganda.","post_message":"\"There is very little evidence of people knowing what they are trying to do.\""},{"comment_id":"10153394561766336","commenter_b":"Only one I see judging is you","commenter_a":"Her Christian mother must be so proud. This is why you don't preach and judge. Once you put yourself out there, you are now the target to being judged.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child. “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"10153197491081051","commenter_b":"She's already proven she's delusional","commenter_a":"Nancy - Have Another Drink !","post_message":"Nancy Pelosi says President Obama's Iran deal is simply brilliant. Agree or disagree with her?"},{"comment_id":"959728980774046","commenter_b":"This is ridiculous ! We are a Christian based country . Muslims need to get the hell out and take their evil ideology with them ! NOW !","commenter_a":"YES !!!","post_message":"Obama Gave Millions To This Mosque In America, But Look Who Owns The Mosque This shows you exactly where his true allegiance lies. Do you think Obama is a traitor?"},{"comment_id":"890208664347927","commenter_b":"That's a woman^ Meant Selena.!","commenter_a":"Everything is so over sexualized in America. That's what the real problem is. If everyone didn't think of pornography whenever they saw a nipple it wouldn't be such a big deal!","post_message":"#FreeTheNipple is fighting against censorship."},{"comment_id":"1328913090468676","commenter_b":"You are kidding! Bush was criticised for reading to kids in a school soon after 9/11, which was actually thoughtful and humane. While Obama is on a world tour with the family!","commenter_a":"We have to be honest. If that was George Bush we wouldn't have cared. This doesn't bother me so much, he was being polite as a guest at a State Dinner. Gallivanting with communists just hours after the bombing (and his dismissive <60 second remarks) was disgraceful, though.","post_message":"Nero has nothing on this guy! Obama shows how he feels about the #BrusselsAttacks."},{"comment_id":"10154092020795950","commenter_b":"Understood but will be a taxpayer nightmare of added security details. I am sure there are comparable private schools in DC.","commenter_a":"Can you imagine if any other President did this? In addition to taking his grown CIVILIAN kids to meetings with foreign leaders. And people are actually defending this...lol","post_message":"America could soon have a long distance FLOTUS."}]
