[{"comment_id":"10152669035866135","commenter_b":"Me too","commenter_a":"Me too, worst sound i have heard from my phone! I try to read the alert and they want me to answer a survey! Are you freaking kidding me?!?","post_message":"UPDATE: Police have now released a picture of missing 6-year-old Hailey Betts.  READ MORE: @webpagelink  Have you seen her? Please call police right away if you have any information."},{"comment_id":"1038727149505600","commenter_b":"Trump, get your ass to basic training, and stop with your faux patriotism act.","commenter_a":"Hahaha.","post_message":"Trump 'always felt that I was in the military' when he was at military-themed boarding school @webpagelink"},{"comment_id":"1802927083306226","commenter_b":"Well you got what you wanted...he called Illegal Aliens, \"Guests\" Now wallow in it.","commenter_a":"Only people glad he's gone are the criminals and illegals","post_message":"LIVE VIDEO: There's a new sheriff in town as Paul Penzone is sworn-in as Maricopa County's 37th sheriff after defeating Joe Arpaio in November's election. Arpaio served as sheriff for the last 24 years."},{"comment_id":"395052417343306","commenter_b":"We aren't screwed...again, RESEARCH MELLIE! See how much illegal immigrants attribute to the economy, then come back.","commenter_a":"Yay for Texas on this. But too bad Abbott was able to get Obama's immigration reform halted by a federal judge.","post_message":"Did you ever think you'd see this happen? Congrats Texas!!!"},{"comment_id":"1325725004111513","commenter_b":"They're both adulterers. Trump cheated on his first 2 wives","commenter_a":"It is actually possible for both to be true: Trump is a conniving, egomanical pig who won't stop at destroying others to get to the White House and Cruz is a lying adulterous pig who would also be a big hypocrite. Sigh. And all of it unfolding on Good Friday. You can't make this stuff up....","post_message":""},{"comment_id":"783518591838718","commenter_b":"Hillary needs to change her tampon..","commenter_a":"Eat shit bitch","post_message":"Hillary Clinton Says ‘Christians Have To Change Their Beliefs’ Or Else… [VIDEO].  She is the one who should change her beliefs.  Do stand strong behind your faith?"},{"comment_id":"1644362728922565","commenter_b":"But haven't you heard....those votes are all from dead illegals","commenter_a":"Electoral College must do the right thing and prevent Trump becoming president. Now 2.5 million more people voted for Clinton than Trump!","post_message":"Were you wondering why Trump talked to Taiwanese President?"}]
