[{"comment_id":"480289475501690","commenter_b":"Read thru all the comments before insinuating, fucking bitch","commenter_a":"What about womens rights? What about the Muslim teens who made a mistake? Or the children & women getting raped? What about the women who are clearly not mentally capable of handling pregnancy or a baby? Id rather an aborted baby than a murdered baby left in the dumpster.","post_message":"The bill has been called the first of its kind in the nation:"},{"comment_id":"10154061820451955","commenter_b":"It is just amazing that she can't take both of Bernie's knees out with a snap of her fingers. Something is brewing...","commenter_a":"Time to start planning a street party when Donald J. Trump wins the election. One thing for sure, Hillary Clinton won't be elected DOG CATCHER!","post_message":"SHE LOSES AGAIN"},{"comment_id":"1301129679938665","commenter_b":"Would it be ok if you calmed your titties and stopped being such a butthurt faggot?","commenter_a":"(Cough) tarnak farm friendly fire incident (cough)","post_message":"Sometimes it's not the enemy you need to worry about. ~Will"},{"comment_id":"10153657606683984","commenter_b":"Bitch--boycott her--hurt her where it counts","commenter_a":"\"Big Mike\" is 200 lbs (after autopsy) of year old worm food. Nothing more no matter how many highways you block.","post_message":"This was probably NOT the outcome Beyonce was expecting when she shared this..."},{"comment_id":"937622143000705","commenter_b":"She can't win.","commenter_a":"Republicans are in total disarray! Hillary 2016","post_message":"According to the Washington Post, the four recent resignations have “gutted the core of Carson’s apparatus and left the 63-year-old first-time candidate with only a handful of experienced advisers.”"},{"comment_id":"750335681823676","commenter_b":"Trump and his mindless supporters are a NATIONAL EMBARRASSMENT !!","commenter_a":"Trump gonna have alot obama f-ups to fix right","post_message":"BREAKING: Trump Drops Bombshell About Obama... He Just Exposed The Unthinkable He is trying to cover this up as quickly as possible. Let's spread it. Do you think Trump would make a better president than Obama?"},{"comment_id":"10152691243492217","commenter_b":"@username we're good at sports that don't matter","commenter_a":"Jason Mulford","post_message":"Watch out, Katniss Everdeen."}]
