[{"comment_id":"10155588637195389","commenter_b":"Amen!!! Good post...","commenter_a":"Every police officers in this country should take their badges to the white house and give it to the biggest racist in the country.","post_message":""},{"comment_id":"508257596043081","commenter_b":"His wife destroyed that college but gave herself $200k severance pay. They are crooks","commenter_a":"If Sanders were to be nominated and elected in Nov, big problem is that he has not raised money, or campaigned for, congressional Democratic candidates. In other words, Sanders will be no better off than Obama has been if he can't get enough members of Congress to pass his initiatives.","post_message":"The attacks are going to get more unhinged."},{"comment_id":"10153257325640950","commenter_b":"Quit smoking dumb ass broads or don't get pregnant!!!","commenter_a":"Smoking while pregnant should be child abuse. The reason it is not is that Planned Parenthood and the rest of the abortion industry wants no rights assigned to kids when they are in utero, because doing that would admit that they are a person.","post_message":"Smoking during pregnancy can lead to complications including sometimes dangerous premature births and sudden infant death syndrome."},{"comment_id":"10153673793456336","commenter_b":"Please don't find your way to StL!","commenter_a":"That is great, she prolly is afraid of going to prison!! She is about as racists as they come, she showed her true colors!!","post_message":"Breaking News: Baltimore Mayor Stephanie Rawlings-Blake announced Friday that she will not seek re-election.  @webpagelink"},{"comment_id":"10155047636614657","commenter_b":"AND SHE WANTS EVERY WOMAN TO BARK LIKE A DOG !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Should every single woman in America have a federally mandated abortion, too? Is that where we're heading?","post_message":"A specious, simplistic pander."},{"comment_id":"1613037799000233","commenter_b":"Thanks to Trump! He has successfully stirred up America. I'm still with Hillary Clinton!","commenter_a":"Ever since the election, the real closet racists have come out..","post_message":"A teacher shouted the N-word in the middle of class, stunning her eighth grade students. The video has millions of views and the teacher has since been fired. @webpagelink"},{"comment_id":"10153089105414753","commenter_b":"I had twin daughters at 18, me and their mother had been married over a year when she got pregnant. My daughters have NEVER been abused, so yes teens can be good parents. This is a fucking offending question","commenter_a":"A lot of adults do the same to. Their children and i was a teen parent without any help and my children are fine and i am married now so it had nothing to do with him being young","post_message":"Should teens be allowed to have babies? What do you think should happen to this 19-year-old father? @webpagelink"}]
