[{"comment_id":"10153288291318812","commenter_b":"That is great! I had to tell a mom to stop playing games on her phone in the theatre once. She was playing for nearly half an hr into the movie & it was totally distracting cuz of her huge bright screen & she was holding it up right in front of her face.","commenter_a":"Praise God it is so good to know that some people do still believe in kids being obedient and respectful to their elders.","post_message":"\"This rude, disrespectful, and awful behavior is unacceptable and they owe you an apology.\"  Mom's Facebook apology for kids' bad behavior at the movies brings recipient to tears: @webpagelink"},{"comment_id":"1033066763409083","commenter_b":"Maybe we could stop the flow of heroin coming into the U.S.","commenter_a":"To associate with Hillary Clinton, you are an EMBARRASSMENT to the residents of VA and to the military who live and serve here!! DISGUSTING!!","post_message":"I’ve seen firsthand how significant an impact the opioid and heroin abuse epidemic is having on communities and families in Virginia. More Virginians now die from these overdoses than car accidents, and law enforcement currently lacks the tools to save more lives. I’m pleased the just passed Comprehensive Addiction and Recovery Act (CARA) will encourage co-prescribing of naloxone – a life-saving drug – alongside opioid prescriptions and also implements a measure to protect the elderly from medication abuse. I worked with a bipartisan group of colleagues to draft and introduce these provisions. Lastly, while I am pleased Congress was able to work in a bipartisan way to address this crisis, we should keep working to provide emergency funding that is critically needed for state substance abuse programs, law enforcement, treatment and other priorities authorized in this bill."},{"comment_id":"10155329030581002","commenter_b":"What's wrong with these racist black women?","commenter_a":"What is wrong with these nasty white bitches?","post_message":"A former Santa Fe Independent School District teacher is accused of having sex with two students over the last year and a half."},{"comment_id":"10155086902812235","commenter_b":"UK agrees Americans you created this problem now fix it Europe do not want a war","commenter_a":"How much longer are the American people, the ones who didn't vote this idiot in, going to let this go on, this ego maniac is ruining your beloved country, it is the laughing stock of the world thanks to him, how can any government anywhere take this moron seriously and trust him with anything, he lies through his teeth, blames everyone else for whatever is going on, it has only been 4 weeks and look at the state of things ! My thoughts are with the American people who didn't vote for this buffoon, i hope your country can get rid quick and recover from his dreadful influence !","post_message":"\"I was hoping you could tell me what the f*ck is going on over there?\" - European security services ask."},{"comment_id":"689708227853298","commenter_b":"Evidently the back of your father's hand never helped you because you're still talking crap go home Joe go home","commenter_a":"Hypocritical scum. \"This is a Big f---ing deal\". Didn't you say that?","post_message":"Vice President Joe Biden: Donald J. Trump's language would have gotten me \"the back of my father's hand\" abcn.ws/2fOBDpy"},{"comment_id":"1292924254103022","commenter_b":"RACISTS EVERYWHERE! SMDH! HILLARY DOESN'T have to PAY for the BLACK VOTE! RACISTS SHOULD KNOW that by NOW! Lol! She was under PRESIDENT OBAMA! The BLACK VOTE IS HERS from the beginning.","commenter_a":"lets see, hillary was SHOCKED at trumps language 30 years ago and then invites and praises someone who uses language that would even make a sailor blush......shame, shame, shame........disgusting is disgusting is disgusting and TRASH is TRASH no matter who is saying or singing the words.......and hillary not only apparently supports this type of language and music, but invites them to share her state.......so disgusting","post_message":"CROOKED Hillary Praises Cop Haters Beyonce And Jay-Z Who Drop N-Word Bombs All NIGHT! BOYCOTT!!!"},{"comment_id":"10153231679439071","commenter_b":"But they're so nasty lol","commenter_a":"Hnsh Ltif ewwwww","post_message":"A company has created a replacement for water bottles that you can actually eat."}]
