[{"comment_id":"10154056899827541","commenter_b":"Did you know that one the kkk used to lynch Italians as well?","commenter_a":"All you morons. This is an italian thing. And they are white. Get over it already. Its 2017 almost","post_message":"A high-ranking mob enforcer from Queens told a gambler who owed his boss money he was saved by the color of his skin."},{"comment_id":"979572065469181","commenter_b":"They need to pay taxes!","commenter_a":"If you bunch of socialist morons would adopt the fair tax it would do away with this along with the burdensome irs but yall don't want real answers just partisan socialist big govt","post_message":"It's time for them to start paying their fair share."},{"comment_id":"10154173812304205","commenter_b":"As long as she keeps getting elected, she wont feel the need for change!","commenter_a":"If she was a basketball coach, she'd be fired. Continue to work for your district in CA, but someone else from another part of the country like for example a representative from Wisconsin or Michigan should lead. The Democrats are pussies.","post_message":"Nancy Pelosi wants to assure you that everything is fine in the Democratic party. She is wrong."},{"comment_id":"10154196330336770","commenter_b":"Beverly your character flaw is showing again! You need to get a job at disney oh I forgot your not a foreigner# you need to get a hobby!","commenter_a":"He isn't coming cause Trump plans to change the Visa programs so Disney will not be able to bring over cheaper labor and have Americans train their replacement anymore.","post_message":"Are you buying his reason?"},{"comment_id":"10153619794460575","commenter_b":"You can see how they are when they don't get their way they are illegal illegal illegal shoot shoot shoot","commenter_a":"Cant wait for Trump to win and stop these third world demonstrations by illegals that dont belong here","post_message":"Trump refuses to be silenced. . ."},{"comment_id":"1192730294142303","commenter_b":"Sherry Ashrof","commenter_a":"Mike Simm","post_message":"Nice ice baby!"},{"comment_id":"10153622148174497","commenter_b":"women can have some rights, just so long as they arent black mexican atheist homosexuals or anything.","commenter_a":"are men hogging up all of the rights again? come on guys... let the women have some of the rights.","post_message":"What is the path forward for women given the barriers to equality they face worldwide? The Onion explains women rights."}]
