[{"comment_id":"10154427228206162","commenter_b":"Clearly the women in this case is at fault she bought the cheaper tickets and tried to pull a fast one.","commenter_a":"Leave it to ABC news to make a bigger deal out of a story than what it should be.","post_message":"A mother was devastated after she and her five children were forced off an Amtrak train in the middle of the night. READ MORE: @webpagelink"},{"comment_id":"10154578809696336","commenter_b":"They are all corrupt !!! Time to clean house !!!","commenter_a":"Lol , I just remembered that Obama said hillary is more qualified than he is .","post_message":"\"The FBI's not supposed to be involved in spinning the news. Whenever you release sensitive materials on the Friday of a holiday weekend you are trying to affect the news cycle.\" Tucker Carlson said the timing of the FBI's release of documents relating to the Clinton server scandal \"discredits a venerable agency.\" @webpagelink"},{"comment_id":"10153689334397869","commenter_b":"Locked away in a prison? So that your tax dollars can feed him, cloth him and pay for the medicine when he is sick. There is already a fence up and they scale it. If you build a bigger wall then they will just dig tunnels.","commenter_a":"Governor, I've always respected you. I voted for you when you ran for president eight years ago, and I was proud to cast that vote. That said, wouldn't it be better to have him arrested and locked away where he can't do any more harm, regardless of what side of the border he's on? I'm concerned that having a \"deport the criminals\" stance fuels a xenophobic mentality that all illegal immigrants are dangerous criminals. Also, there's no way to ensure he stays deported for good, even with a wall. Lastly, it seems to imply that if he's a danger to society that we don't care about the lives of people outside of our borders. Aren't humans worthy of human dignity regardless of what side of the border they're on? Imprisonment seems like the best option. I'm genuinely curious, and would appreciate an honest, civil discussion.","post_message":"Prayers today for the family of North Texas firefighter Captain Peter Hacking, who was killed along with his four-year-old stepdaughter and 22-month-old son when a van veered into their lane and hit their car head-on. If the van driver recovers, he’ll be charged with criminally negligent homicide. Let’s hope that’s also enough to get him deported for good, since he’s an illegal immigrant who was already deported in 2008, but came right back across the border. Normally, I’d link to a news site for more, but I’d rather that you read it here. It’s the GoFundMe page set up to help Captain Hacking’s widow and his surviving son and four step-children:"},{"comment_id":"10154001620082377","commenter_b":"I don't think that would work here, just look around now, pants below waist so nasty drawers complete with nasty skid marks being worn, woman with breasts hanging out of clothes and jeans with the butts completely exposed, (men and women), FU t-shirts, and on and on. Burkas would improve these types, so no, let them wear burkas.","commenter_a":"The thing is that it is part of their religion and I think we should respect their right to wear it, it is not indecent. I can think of a lot of people who benefit from it , you know to cover up too tight pants on someone who is obese and so on.","post_message":"Angela Merkel calls for Germany to join France, Belgium and others in banning the burqa. Should America be next?"},{"comment_id":"997192570318083","commenter_b":"She should run","commenter_a":"The horrifying thing about Ann Coulter is that.....someone has sex with her. The more horrifying thing is....there's a chance it's consensual.","post_message":"Many of Ann Coulter's fans were not happy with her dream ticket."},{"comment_id":"605117769694222","commenter_b":"WE DONT BUY IVORY PERIOD!!! WE NEED TO BOYCOTT CHINA ESPECIALLY AND DONT EVEN BUY DOLLAR STORE THINGS THAT ARE MADE IN CHINA!!! IVE BEEN TO HONGKONG AND TAIWAN IN 87. SAW MEGA IVORY BACK THEN👿💔👹 FOR SALE! NOTHING HAS CHANGED! CHINA HAS NO PUNISHMENT! AFRICAN COUNTRIES NO TRADE PUNISHMENT! EVENTUALLY THE COUNTRIES IN AFRICA WILL STARVE OUT IF WE BOYCOTT TOURISM!!!","commenter_a":"Every country involved in the purchase of animal products from Africa as well as gaming in Africa are the reason why we have this problem. It's not only Africa's problem this is a world wide issue. Next time you hear a piano play or go to the pub to play some billiards question what they are made of. Ivory poaching legally ended in 1989, but the demand will always be there and countries like China and Japan will always buy their way through these bans as long as we keep buying tacky souvenirs from Asia containing Ivory. Education is the key, we have to take an interest and ask what is the item I'm about to purchase made from? This is what we can do to reduce the demand of items made from threatened species.","post_message":"Poachers, beware. These dogs are coming for you from the air. @webpagelink"},{"comment_id":"955398181243627","commenter_b":"And we will ship them out idiots","commenter_a":"BIGGEST WANKER MUSLIM OF ALL TIME","post_message":"This is only the beginning..."}]
