[{"comment_id":"1231862310212247","commenter_b":"We better get building that wall","commenter_a":"This will be interesting. Will President Trump undo what Obama did to lift sanctions and travel restrictions to Cuba?","post_message":"Live Look: Celebrations in Miami over the death of Fidel Castro, and images from Cuba."},{"comment_id":"620923104721955","commenter_b":"😂😂😂 dumb ass girl","commenter_a":"Cukukrazi Sociallyawkward Arsonist Tweak Monsta 😂😂","post_message":"This Is Terrible!"},{"comment_id":"10153140087886037","commenter_b":"@username I have a friend who works as an ICE agent and their hands are often tied when getting rid of criminals and they already deport the serious criminals.","commenter_a":"My mother-in-law went through the process legally and in November she took the oath. She took the process seriously, learning US history, learning english, and working hard to pay the fees. Freely handing out citizenship is an insult to those who went through the process legally. Laws are put in place for a reason, we cant pick and choose which ones we follow. And the President can't be allowed to give millions of people citizenship when it goes against our laws. I don't care if the president is Democrat or Republican, this is not legal.","post_message":"Confident Obama predicts success in immigration appeal, has message for millions facing possible deportation @webpagelink"},{"comment_id":"512998138876699","commenter_b":"We certainly need to close our borders, so these warmongering murdering Isis people don't creep in, for that is what they plan to do. We need to do that immediately! The infiltration of this violence is not needed here.","commenter_a":"We need to stand united with the world on this issue of terrorism. We are not doing enough and hundreds of thousands have died already.","post_message":"To the people of France, we stand united with you and all of France is on our hearts and in our prayers. If history has taught us anything, it proves we must remain vigilant against such cowardly, terrorist attacks. America can lead, and we have the strength to do so, but currently lack the leadership. My hope is that our national leaders grasp why so many Americans, including myself, want the Border secured so that we not only deal with the issue of illegal immigration but we also ensure terrorists do not cross our border to do us harm. Never has the old adage been more true: The World is safer when America is Strong: Our People know it, Our Allies know it, and most importantly, Our Enemies know it."},{"comment_id":"902484503120305","commenter_b":"She will never be a first lady! She spouts her mouth in the wrong direction! Lady you are suppose to set an example for red white black brown or any other color of people in United States! Instead you keep things stirred up, you and your so called husband!!","commenter_a":"Oh, she is the racist. She hate her own kind. Disgusting.","post_message":"Jaw-dropping!"},{"comment_id":"660919517348095","commenter_b":"People who live in glass houses shouldn't throw rocks !","commenter_a":"Shame on this evil woman, in my opinion....Netanyahu is a friend, and what he has to say matters...If they, meaning the President, White House and Senators are worried about his visit, then WHAT ARE THEY COVERING UP? That is the question.....Bibi is an honorable man, and Americans trust him, more than someone like Feinstein.....Sit down, and let Bibi speak, Americans want to hear him.","post_message":"Senator Dianne Feinstein says Bibi is ‘arrogant’ when he claims to speak for all Jews. But, she still plans to attend the controversial speech."},{"comment_id":"1790088647891885","commenter_b":"Lois did you listen to Hillary's speech . It sounded like she didn't know democrats policies or didn't take thousands from PP and believes in term abortion . Oh she forgot thAt, 🇺🇸Trump🇺🇸","commenter_a":"Hillary calling someone corrupt? Wtf kind of drugs is she on? Her and her so called husband are the biggest, most corrupt crooks ever involved in American politics!","post_message":"Donald J. Trump: \"Hillary Clinton may be the most corrupt person ever to seek the presidency of the United States.\""}]
