[{"comment_id":"1113947365314026","commenter_b":"@username you piss with the men, but u have no balls,bitch","commenter_a":"PRETTY SOON IT WILL BE A JOY TO VISIT NORTH CAROLINA","post_message":"North Carolina: Land of Fewer and Fewer Progressive Wingnuts by the Day!"},{"comment_id":"10152746962915950","commenter_b":"We get your point. She is NOT a man. Therefore she must be a Woman. Congratulations to her.","commenter_a":"She's not a female pilot, she's a Marine Corp Aviator! Semper Fi!","post_message":"Meet the first female pilot in the Navy's Blue Angels' 69-year history, Marine Corps Capt. Katie Higgins: @webpagelink"},{"comment_id":"899262110108885","commenter_b":"So Damian... You too... Just bAck up bitch .... READ THE 4TH AMENDMENT !!!!","commenter_a":"I saw this video when it first came out. During the struggle the kid mounts the cop and beats his face in.. Consistently , cop struggled and shot him. Tall goofy for this one. Watch the full vid , kid is a douche asking for trouble","post_message":"\"I don't have a weapon..\" -- Some of Deven's last words. He was shot 7 times by a cop. Get RISE OF THE WARRIOR COP for free: @webpagelink WARNING: This video contains graphic content. The full story has finally been exposed, thanks to Matthew Cooke."},{"comment_id":"542727622584484","commenter_b":"she need to go home back where she came from","commenter_a":"They all look like robbers and murderers with that shit on there head.","post_message":"This Muslim woman was just kicked out of the mall because of this. If you can't follow the rules, you can't shop here. Do you think Muslims should obey the rules or leave?"},{"comment_id":"10154056167770329","commenter_b":"For Christ's sake lady give it a rest!!! Please get yourself fixed and do my reproduce we don't anymore people like you. And if you've already reproduced I pray for your children. Now kindly fuck off and go find someone else to annoy. Seriously anyone else. The other girl got the message why can't you??","commenter_a":"So stupid. Blackface doesn't make someone racist.","post_message":"IMPORTANT REMINDER: It's never okay to wear blackface!"},{"comment_id":"10153124003659312","commenter_b":"Did you forget there also was Barry Bonds and others? And yes, there was McGuire! This is old and it happened over 10 yrs ago! Move On!","commenter_a":"Handcuff needs to be in handcuffs for picking the Patriots cheaters! Lol","post_message":"This morning, Handcuff, one of several dogs rescued recently by local law enforcement, made his St. Louis television debut with Rene Knott, to make his pick of a winner in today's Super Bowl. See who he picked and then call Stray Rescue to inquire about adopting him. (314) 771-6121 @webpagelink"},{"comment_id":"1754512868165576","commenter_b":"Hillary will follow him ..........because she also wants Muslim invasion in United states.","commenter_a":"Barack Obama is the worst president ever in the history of the United States of America","post_message":"\"I fully expect by tomorrow morning that President Obama will ... give a press conference in which he'll explain that the problem is too many trucks. If only we had truck regulation then we wouldn't have problems like Nice, because it is trucks that are dangerous.\" – Newt Gingrich"}]
