[{"comment_id":"10153026927846051","commenter_b":"Cut down on fraud and kick out the illegals","commenter_a":"I live in Arizona. Thank you Gov. Ducey. So much welfare fraud. So many illegals getting enough benefits, to make you see red! 4 million people waiting in line to come here legally. They have been put on hold to accomodate the illegals. This is sooooo wrong.","post_message":"This state just reduced the amount of time people can spend on welfare to the shortest in the whole country."},{"comment_id":"10151085765109999","commenter_b":"@username, There is an \"illegal alien\" in the penthouse of Trump Tower. She came to this country without a visa but persisted in working illegally until she found a sugar daddy who would marry her out of convenience. ICE needs to go there and interrogate her to determine if her marriage is a sham marriage for legal status or not.","commenter_a":"Let's face it, Trump does not care about Jews or Israel. It is up to Israel to save itself and work on two states solution. It is the only option to maintain a viable democratic Jewish state.","post_message":"\"President Donald J. Trump may be the last man standing between Israel and a complete, self-inflicted disaster,\" Thomas Friedman writes in The New York Times Opinion Section."},{"comment_id":"10156726524125725","commenter_b":"Hide yo kids, hide yo wives.","commenter_a":"Will he be blocking polling places and stopping people from voting like he did in MA? After all, if you can't win an election honestly CHEAT, just like you did TO your wife!","post_message":"Illinois is shaping up to be an important state in the Democratic presidential race, so much so that former President Bill Clinton will be stumping in the Chicago area this week ----> @webpagelink"},{"comment_id":"10154427050921037","commenter_b":"Illegals do jobs that the \"Americans\" won't do!!! Besides I have never seen any white person working in the field picking your precious organic fruit and vegetables","commenter_a":"no not working and supporting their families in the states and the ones back home. here I thought they just come over and sit around doing nothing but taking naps and drinking beer. lmao this is a joke.","post_message":"The ~11 million unauthorized immigrants in America are not “taking” jobs from US citizens, either."},{"comment_id":"10154500289369091","commenter_b":"Build that wall","commenter_a":"Trump is making up his own stories !! What would he like the ppl to do with the Syrians kill them ? They are human beings ! Smh.. All the other countries took them in ...Trump has No heart , Maybe we should put him in Syria and see how he likes it !","post_message":"Swedes have been ridiculing President Trump's remarks at his rally yesterday that suggested a major incident had happened in the Scandinavian country."},{"comment_id":"10153548365891350","commenter_b":"You girls are so funny I love how jealous women can be towards each other. GET OVER IT! there are lots of work out clothes like this. Just cause YOUR ASs can't fit in it doesn't mean everyone else that looks good in this type of workout clothes has to stop wearing them! Jealouse? Shut up bitch go run in the treadmill then!!!!","commenter_a":"What's the issue...? Some moms look like this, some are chunky. I had a very nice body after my first son, trying to get back to that now after having my second. There's nothing offensive about this at all, some women are just bitter and resentful.","post_message":"This was probably not the reaction Bugaboo was expecting..."},{"comment_id":"10153950585516491","commenter_b":"I really wish it had been 'Let the bodies hit the floor\" by Drowning Pool","commenter_a":"What this guy have to do with music? This show is a joke nothing to do with real music talent onlyma bunch of show offs","post_message":"Michael Phelps:  \"I might have a lot of gold but this guy’s got all the platinum.\""}]
