[{"comment_id":"10153223686721336","commenter_b":"Why is she still walking around and not in an orange jumpsuit?","commenter_a":"Is she resigning? That would help B'more get better.","post_message":"Moments ago, Mayor Stephanie Rawlings-Blake said Baltimore will get through the devastation of the last few days and that the city will only get better."},{"comment_id":"10152977675812690","commenter_b":"Cool...but can't we all agree that there are quite a few ILLEGAL immigrants that do NOT speak English?? I'm not talking about immigrants I'm talking about the ones who are here ILLEGALY!!","commenter_a":"But it is also illegal! Just do it right! Learn the language, support yourself and do it LEGALLY!!! Legally!! That is all!","post_message":"WATCH LIVE: Dual rallies have taken over downtown Dallas Friday evening, forcing several businesses to close early: @webpagelink Photos of the protests: @webpagelink"},{"comment_id":"10153041187141037","commenter_b":"Which one Rebecca?","commenter_a":"Life begins when that egg is fertilized life begins when that baby Not a fetus has a heart beat life begins when that baby can survive outside the body. This isn't religion this is real talk","post_message":"In an embarrassing setback, House #Republicans abruptly decided to drop planned debate of a bill criminalizing virtually all late-term #abortions after objections from GOP women and other lawmakers left them short of votes."},{"comment_id":"10153047455238984","commenter_b":"would not let that les hatefull bitch raise a golld fish, fel sorry fr her children","commenter_a":"Rosie O'Donnel's son is still trying to deal with the fact that his mother bought him from a cash strapped viewer of her tv show.","post_message":"Oops. This isn't what the left wanted them to say..."},{"comment_id":"10154331327221320","commenter_b":"Sounds like Jane is drunk. See Jane get drunk.","commenter_a":"The Dad was making a legal turn on red. The child didn't understand that this was a legal thing to do. I know plenty of kids who have become upset, because their parents take a sip of a soft drink while driving. They take \"don't drink and drive\" literally.","post_message":"A little boy rats his dad out to 9-1-1. Listen to the call: @webpagelink"},{"comment_id":"714422425388653","commenter_b":"Get out of this country!!! The USA was great until you damn Devils Muslims started to come here!!!","commenter_a":"I don't care. Take that shit off. What do you have to hide. You want to wear it , wear it at home.","post_message":"She filmed it.   WATCH the video very closely..."},{"comment_id":"10154588771167178","commenter_b":"Are expecting any more snow or ice around Roanoke Rapids?","commenter_a":"Is it going to be windy today?","post_message":"WRAL Elizabeth Gardner is taking questions now about today's forecast and what you should expect. For the latest weather conditions go to wral.com/weather."}]
