[{"comment_id":"10152969053772293","commenter_b":"Well scumbags cat got your tongue","commenter_a":"It is not racism.It is about illegal bangladeshis entering every bordering country. Half of Bangladesh is in India. Burma or Malaysia are not like India.These Bangladeshis create all sorts problems from drug peddling, to prostitution, thievery, robberies, kidnapping & rapes. Recently bangladeshis raped a 70 year old nun at a church.","post_message":"A tragedy no one wants to own."},{"comment_id":"10157202420850354","commenter_b":"Pause for now....put them in his house","commenter_a":"You MUST be on the 'take', Ryan!! YOU CRIMINAL PIECE OF SHT!!! Get him OUT of there!","post_message":"\"That's not who we are,\" said Paul Ryan."},{"comment_id":"1090368724307930","commenter_b":"Women fought for many, many decades for the right to vote.","commenter_a":"Yay, and now we will get to vote in an awesome woman as president!","post_message":"The United States is 239 years old. Women have been able to vote for only 95 of those years."},{"comment_id":"10156257885050389","commenter_b":"What the hell are they waiting for?? Indict her already !!!","commenter_a":"she sure is aging fast","post_message":""},{"comment_id":"10153227857229330","commenter_b":"I'd do the same thing - little punk needs a good whipping from his mom","commenter_a":"There is one parent in Baltimore that has her priorities straight.","post_message":"Mom of the Year? Check out what a mom did when she caught her son out rioting in Baltimore. ---> @webpagelink What would you do?"},{"comment_id":"10154093601280695","commenter_b":"Beautiful ladies","commenter_a":"People say the same about my mom. That we look like sisters. :)","post_message":"We totally guessed wrong."},{"comment_id":"10153042580654411","commenter_b":"What a bitch ^^","commenter_a":"I condemn whatever happened in Paris and whoever did it wasn't a human for sure. But this is a shame. They kinda provoking people to do stupid stuff and it's like fuel on the fire. Shame on Charlie Hebdo","post_message":"'We will not give up, otherwise all of this will not have any sense.'"}]
