[{"comment_id":"10153315530254203","commenter_b":"Yes,Everywoman has a right to choose.","commenter_a":"Here's one for ya: \"WHAT DIFFERENCE AT THIS POINT DOES IT MAKE!??!?!?!\" (With appropriate accompanying \"toddler having a tantrum\" body language). That's one of MY faves.","post_message":" rights are women rights and women rights are human rights once and for all."},{"comment_id":"10153111433392483","commenter_b":"Awwww lets cater to the criminals AGAIN shoot the bastard and be done i cant stand a fucking pedophile sick sick sick","commenter_a":"Their gonna let this perve go","post_message":"A gag order was issued today in the case of an Alabama pastor accused of sexually torturing, abusing and raping multiple children and teens."},{"comment_id":"869922156376214","commenter_b":"And this chick got her hair pulled and sat on","commenter_a":"This cop is a asshole point gun on kids wtf!! Is wrong with this pig!! His a punk bitch with a badge!!","post_message":"This cop should be prosecuted to the fullest extent of the law, not let off with a loophole. WTF?!"},{"comment_id":"1121791217896305","commenter_b":"Go back to school. Its not just to slow things down so you can understand!!","commenter_a":"\"We will reject bigotry and hatred and oppression' IM DONE LOL also you forgot a comma","post_message":"This is my pledge to the American people: as your President I will be your greatest champion. I will fight to ensure that every American is treated equally, protected equally, and honored equally. We will reject bigotry and hatred and oppression in all its forms, and seek a new future built on our common culture and values as one American people. -Donald J. Trump"},{"comment_id":"10153678565299062","commenter_b":"*** Important","commenter_a":"Support tradition marriage","post_message":"SHOWDOWN: Officials and lawmakers continue to clash over same-sex marriage debate in Austin."},{"comment_id":"10156036512370294","commenter_b":"Why doesn't she just create her own page?","commenter_a":"U r beautiful don't forget that","post_message":"'We recommend that you avoid focusing on certain body parts...' A mother and blogger who suffers from a chronic skin disorder that affects her face wanted to post a photo of herself without make-up to teach others about her disease. Facebook said no:"},{"comment_id":"843350562368952","commenter_b":"With the UK refusing to stop child molesting rings, why is it surprising that thier corruption extends to the zoo.","commenter_a":"Not a fan of any of the stories that start...\" You won't believe what happened after this....\" It's The Star magazine hook line and sinker. It's like the Kardashians are the publishers.","post_message":"\"Zoo of Horrors\""}]
