[{"comment_id":"10152950804022434","commenter_b":"Just a bunch of liberal bitches that have no fucking brains. Their full of their self","commenter_a":"The view is always just a bunch of dumb bitches!","post_message":"Eggland's Best Eggs and Johnson & Johnson have pulled out as show sponsors."},{"comment_id":"682877985236113","commenter_b":"Carrie is a rich beeeatch!","commenter_a":"Liberals need to keep their views to themselves....Carrie, is a sweet mother and wife, and can teach her son what she wants to teach him, regardless what others might say: Because, He is HER child not the Liberal idiots, out there...!!!!!!","post_message":"Liberals are going after Carrie Underwood for her faith, she needs your support.  She is a true Christian. Let's get her back.  Can we get 85,000 'LIKES' for Carrie Underwood's faith?"},{"comment_id":"10154010252346350","commenter_b":"The kid didn't make a mistake. If she was driving drunk then she committed a crime. Having someone plow into your home is not only traumatic at the time of the event, but then there are all of the repairs to deal with. It can take months to get it all put back together. And insurance doesn't cover all of the costs. Guess who gets to pick that up. Not the kid. She wasn't over reacting. If anything, she was quite conservative. I would have gladly beat the stuffing out of the one that hit us.","commenter_a":"I'm probably the only one who is think Kim... Is.. Well... Being a little actress like in all these tweets. We get it. The kid made a mistake. One that could of been fatal. One tweet is probably good enough (if at all) but like 4? Get a grip Kim. Ridiculous.","post_message":"'This young girl could have killed herself, her friends, and me. Frightening.'"},{"comment_id":"688195661362262","commenter_b":"You are awesome president Obama! !!! Thank you for all you've done","commenter_a":"This guy is a crook 2","post_message":"LIVE - President Obama on the Election Night win of President-elect Donald Trump."},{"comment_id":"1246176155450245","commenter_b":"And don't come to Canada go back home we don't have any room for you either","commenter_a":"That's so true","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10155845816789778","commenter_b":"Idiots...its about illegal immigrants and nothing more....drama is what they thrive on","commenter_a":"stupid is as stupid does. these people are here legally and commit no crimes, yet they do not want the president to deport those who would cause harm or come in illegally.","post_message":"Delia Goncalves was live with Jose Andres about #ADayWithoutImmigrants.   Several DC-area restaurants will be closing as a part of the movement."},{"comment_id":"10153945679949087","commenter_b":"Don't care for Michael Moore but im with him on this, gooo Trump!! Beat that lyin corrupt Hillary.","commenter_a":"Alyssa Hohorst","post_message":"Liberal filmmaker Michael Moore is doubling down on his prediction that Donald J. Trump will win the White House with a list of 5 reasons why."}]
