[{"comment_id":"10154664462516337","commenter_b":"Blaming a group of people before you even know the full story = ignorance","commenter_a":"Please bring more Syrian refugees to this country","post_message":"Explosions and IED discoveries continue to rock the northeast."},{"comment_id":"10152708840057014","commenter_b":"The only ones wanting her are the freebie seekers. And the ILLEGALS !!!!!!!!","commenter_a":"Absolutely. Sorry to the GOP because all of their candidates are LOSERS","post_message":"Would you consider voting for Hillary for President?"},{"comment_id":"10153687019896800","commenter_b":"Maybe abortion opponents could just focus on those things that actually reduce abortions. The #1 cause of abortion is unplanned pregnancy. Universal coverage for birth control has done a great job of reducing abortions in other countries. Equal pay guarantees also work - mothers in this country experience a greater wage gap than childless women. Job protection is an issue here. Women in this country still experience job loss solely because of pregnancy. And, child support is a huge problem here. Civilized countries pay custodial parents child support, and THEN collect it from the non-custodial parent. Knowing that you can afford to feed, house, and clothe a child is a factor when deciding whether to continue a pregnancy.","commenter_a":"If these conservatives really wanted to prevent abortions -- they should be handing out birth control like it was candy. After all, if you prevent an unwanted pregnancy you automatically prevent the need for an abortion. But I guess that kind of logic is beyond the comprehension of most conservatives. Considering the conservatives are trying to restrict or elimiminate access to birth control as well -- I don't think this is about preventing abortions at all. It seems like it's about a group of morally uptight religious busybodies going around poking their noses into other people's private matters and wanting to have total control over those people's lives.","post_message":"Trevor encourages abortion opponents to extend their pro-life stance beyond fetuses."},{"comment_id":"1708300706077756","commenter_b":"Not true! The muslims were the problem then and they were stopped because the world won't lie down and let them take over.","commenter_a":"Even if this was completely true. That justifies what muslims are doing now. In this modern day & age. I truly believe this guy wants to destroy AMERICA.","post_message":"A complete fabrication. The crusades were carried out as a direct response to Islamic aggression. This is a 1400 year old problem..."},{"comment_id":"10153603206034342","commenter_b":"Make her Vice President...you will truly be elected","commenter_a":"Sarah Palin is Hott","post_message":"Sarah Palin is endorsing Donald Trump..."},{"comment_id":"10154034067333701","commenter_b":"Is that a dude in drag? Or a real girl","commenter_a":"It is a bad eyebrow day.","post_message":"Court documents showed Perry had at least 15 prior criminal convictions, including five felonies and driving violations, along with a felony warrant for ID theft, methamphetamine possession and providing false information to police."},{"comment_id":"10153379026314205","commenter_b":"Seriously , I don't know how these fraudsters were able to deceive their unsuspecting poor followers. Acquiring jets and planes at their expense. This is exploitation. The worst is that , it is these followers of them that will come and defend them. So sad indeed.","commenter_a":"I posted that video a few weeks ago. Shameless. I'm bustin' a gut. Hee, hee","post_message":"Televangelists: God Says We Need Another Private Jet!"}]
