[{"comment_id":"10153111787816051","commenter_b":"I think girls are more likely to want to fight for what they feel at the moment and most of the time it's about nothing. Hopefully when they grow up they will become ladies","commenter_a":"Awwww. Look at that gentle giant trying to help that girl up off that park bench","post_message":"This girl was holding a baby when they surrounded her. She didn't want any trouble, but it didn't matter."},{"comment_id":"10156017725535405","commenter_b":"Btw, Bob, Walker has never had a surplus. He borrowed $3 billion in a series of loans, threw it in the bank and called it a \"surplus\" withput taking into account the 30 debt payments on his loans. Links to the official records are here, mostly oin the footnotes: @webpagelink","commenter_a":"Scott's ok in my book. He reduced my property tax by about $500. Better than tax and spend Doyle who raised every tax and fee he could, typical tax and spend democrat. Scott let's clean house, enough with the time for a change, it's definitely time for a change.","post_message":"Governor Walker was on \"The Kelly File\" last night, highlighting his plan to challenge big-government special interests at the national level and put the hardworking people of America back in charge."},{"comment_id":"686756008181644","commenter_b":"Yes she is a Scumbag!!","commenter_a":"Yes she is","post_message":"The father of a victim from Benghazi calls Hillary A 'Scumbag' We send our condolences for his loss.  Do you think Hillary Clinton is a scumbag?"},{"comment_id":"403639093305500","commenter_b":"LEGAL IS THE WORD... What's a phony!","commenter_a":"Riding on the coattails of his dead son, he will burn in hell...","post_message":"Watch as the ACLU and Gold Star father Khizr Khan hold a news conference on President Trump's immigration ban.  Read more about Khan: @webpagelink"},{"comment_id":"1216368028409389","commenter_b":"Allyson the bitch","commenter_a":"Donald the Clown and his Republican surrogates will lose big time !! Only imbeciles will believe he stand by working class Americans","post_message":"I stand for ALL AMERICANS! Deplorables, basement dwellers, I stand for ALL of YOU!"},{"comment_id":"1503406889676883","commenter_b":"Are people really this stupid its kinda hard to belive","commenter_a":"She certainly has enablers on her death wish trip. Medical bills should be paid by her.","post_message":"Do you agree our tax dollars should NEVER be used on any of her medical bills? This is unreal!"},{"comment_id":"585280771667035","commenter_b":"This photo is liiiiiiiife!!!! :D :D :D","commenter_a":"Brian Rungeling don't you like Trump's new \"Make Russia Great Again\"?","post_message":"Alec Baldwin just trolled Trump again by walking around New York City wearing a “Make America Great Again” hat — with the embroidered logo in Russian.  The timing for Baldwin’s hat couldn’t be better, coming as the president-elect sat down with security officials on Friday who told him the Russians helped him win the election — an assertion Trump flatly denies because it would contribute to the belief that his win is suspect having lost by over 3 million in the popular vote."}]
