[{"comment_id":"1521185254588608","commenter_b":"You're talking dt supporters, wd you expect anything else?? RFLMAO!!","commenter_a":"Honest to god this is the dumbest shit I've ever seen.","post_message":"Starbucks is probably guffawing over how effective this isn’t."},{"comment_id":"10154679365898797","commenter_b":"Let him alone","commenter_a":"Let him go! He did what any man would do for his wife! If that happened to me I'd have shot him! Either way the man would have died! Let him go!","post_message":"HUSBAND PROTECTS WIFE: A man has been arrested after beating and killing another man who had broken into his home and sexually assaulted his wife."},{"comment_id":"10153510348059411","commenter_b":"serious lips on that lady, shes got Grace Jones beat even.","commenter_a":"She has no ideas worth repeating-FIRE her.","post_message":""},{"comment_id":"10152957563376770","commenter_b":"she should have already been locked up!...","commenter_a":"She has helped fuel the fire instead of being unbiased like she is supposed to be.","post_message":"A veteran Baltimore prosecutor is blaming state's attorney Marilyn Mosby for contributing to dramatic spike in violent crime that has gripped the city in the aftermath of the Freddie Gray case."},{"comment_id":"10153270179214087","commenter_b":"Wrong @username, when people come across any countries borders without proper papers in hand they are criminals hence they commit a crime. Trump is correct illegal immigration is the most pressing problem for this country of whi h it is not in the least ludicrous. If you are much wanting illegals here then why don't all you democrats join together, invite them to live with you and pay their way instead of demanding we tax payers pay for all the freebies they get, not to mention all those ancor babies that we have to pay for to be born then pay for them and all the freebies they will be getting for the rest of their live.","commenter_a":"real change like we have never seen before. Go Trump!","post_message":"When immigration activists began heckling Donald J. Trump for his remarks on illegal immigration at a rally Wednesday night, his supporters came to his defense."},{"comment_id":"10154892673543690","commenter_b":"@username Yeah I get it, I'm just evil with white supremacy and global domination on my mind. Nobody with brown or black skin anywhere outside the United States is capable of doing anything wrong, because of white people, right? You're just a victim? I wasn't in the Navy, I am a Marine. But I feel like I have to defend the Navy here. There are sailors representing men and women from every race, not just whites. I guess you didn't know that. You say that the US Navy contributes to human misery but when a tsunami struck Indonesia in 2004, who was there for the rescue effort? When an earthquake struck Nepal, who was there? When a hurricane destroyed Haiti, who was there? I was there distributing food and medical supplies to desperately poor people in Ethiopia and Somalia. The US Navy prevents two-bit pirates with speedboats and AK47's from ...","commenter_a":"All I do is get up to go to work everyday to provide for my family. Ive never oppressed anyone and I Judge people based on the content of their character. I still hear all over the media how I, and people like me, are causing all the problems in this world. I suppose im just tired of it. Please tell me how being born with white skin makes me responsible for societies ills.","post_message":"Marwan Bishara: America needs anger management"},{"comment_id":"10156248973870354","commenter_b":"that bitch!","commenter_a":"i was sexually harassed by Ashley Judd, she had her way with me, then tossed me aside","post_message":"When will liberal Hollywood stop its War on Women?"}]
