[{"comment_id":"10153395954276051","commenter_b":"It's a deformed pig fetus.","commenter_a":"Yea right.","post_message":"When a woman found this bizarre creature in her backyard, she was completely horrified."},{"comment_id":"1348467338501928","commenter_b":"Totalbitch","commenter_a":"Fake","post_message":"If you had one word to describe Hillary Clinton, what word would you use? (Be nice.)"},{"comment_id":"833545303358765","commenter_b":"She's a idiot!","commenter_a":"Abortion is not the answer - Pro-Life is!","post_message":"How many of you would have been aborted under this perverted logic?"},{"comment_id":"10154496006728689","commenter_b":"@username I guess you're right with your saying!!","commenter_a":"Many people are saying.....not me, but many people. They might be right. I haven't fully investigated it yet, so I don't know,, but from what I'm hearing from many people........Things, I've heard things. Lot's of things. Not so good things...many bad things,I don't know, but it's what I'm hearing lately, from many people. They could be right. And then what? These things I've heard, from many people. Could be trouble...We're in trouble, folks.","post_message":"WATCH: Donald J. Trump: If Hillary Clinton gets to pick her US Supreme Court judges, \"nothing you can do, folks — although the 2nd Amendment people, maybe there is. I don't know.\" Read full story: @webpagelink"},{"comment_id":"1258250390858975","commenter_b":"She's trash too,","commenter_a":"No jobs or their boss refuses to buy group health insurance and a heavy extra tax next year for not having health insurance. All those young healthy folks need to buy premiums so the insurance companies keep up their profits.","post_message":""},{"comment_id":"974401272656125","commenter_b":"If he is not im sure he has been watching and waiting for his next money making endeavor.","commenter_a":"And here come the riots.","post_message":"JUST IN."},{"comment_id":"2045292995569416","commenter_b":"Oh shes another one who lied.","commenter_a":"Liar liar pants on fire!","post_message":""}]
