[{"comment_id":"10154229049319369","commenter_b":"Being against Christians isn't a religion.","commenter_a":"I am against Christianity so that means I can not serve Christians in Mississippi because it goes against my beliefs?? This law is stupid.","post_message":"The measure allows churches, religious charities and privately held businesses to decline services to people whose lifestyles violate their religious beliefs."},{"comment_id":"10153917581018010","commenter_b":"Humans. When will humans realize that we are the most dangerous species.","commenter_a":"Pit bulls. When will humanity accept that this breed of dogs is classified amongst the most dangerous in the world? Hence why they are mostly bred for illegal dog fights","post_message":"A woman's 3 pitbulls mauled to death her 9-year-old brother."},{"comment_id":"1614697422150704","commenter_b":"We don't need these radicals in United States we have enough radicals of our own homeborn.","commenter_a":"Let her 'NEXT SPIT' be in Saudi Arabia !!!","post_message":"Deport these radicals NOW!"},{"comment_id":"10154394005871337","commenter_b":"I love Salma Hayek's ass.","commenter_a":"i like the scene in wild wild west, where salma hayek shows her naked behind. nice butt.","post_message":"Will Smith is really, really sorry about Wild Wild West..."},{"comment_id":"1800961159929656","commenter_b":"This is not the true Ekklesia of Christ! I keep saying it, the true Ekklesia of Christ will have to return to the home, where it never should've come out from!","commenter_a":"You can't call this a Christian church if it goes totally against Gods word and if all that is allowed it is totally wrong to change the bible to fit your agenda. The bible says beware of wolves in sheep clothing it also says we are in this world but not of it. We true Christians are to be aware of these wolves and Not join in the sin with them but we are to pray that God will remove the scales from there eyes and pierce there heart so they can see and repent of what is so wrong that they think is right.may God have mercy on these people","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154856564546438","commenter_b":"Fake IDs fake visas...so why are we sure illegals never voted?? Illegals pose threat because of how much they owe coyotes that families back in Mexico maybe threatened if they dont run drugs for cartels...Trump is right to close this border.","commenter_a":"Ooooo","post_message":"'You notice the Republicans are not saying, 'Hey, those aren the facts,' or 'something has changed,' or 'he did all these other things afterward.' No, what they saying is, 'You don get to talk about that.'"},{"comment_id":"10153184020474726","commenter_b":"What a disgusting a hole.","commenter_a":"what a piece of dog feces","post_message":"'He didn't win, did he?'    Harry Reid confronted on his lies, with no regrets."}]
