[{"comment_id":"1794488717482719","commenter_b":"Entertainers are daydreamer & live in fairytale world. Reality is not their attribute or focusing on oneself identity. Most live in denial & are good at role playing an artificial character. I'm not shocked at their liberal idealism & doing whatever for attention. These are individuals that struggle with growing up.","commenter_a":"Are they all just insane. Who cares if you cut your hair or any other stupid thing. It only hurts you no one else. So asinine.","post_message":"This is how some liberal women are coping with Trump's election win."},{"comment_id":"1110020542374518","commenter_b":"She makes me sick to my stomach. What a hypocritical arrogant witch.","commenter_a":"What me worry, the election is in the bag, my lemmings will vote for me regardless of what I do........","post_message":"Hillary Clinton is quickly running out of ways to make herself appealing to voters on the left increasingly turned off by her political corruption and ties to corporate cronyism. Grasping for something to counter her weaknesses, Clinton has decided to patronize black voters with talking points attacking “white privilege.” @webpagelink"},{"comment_id":"10156482909420354","commenter_b":"Take your hijab and stick it where the sun does not shine.","commenter_a":"How about a 'dress American day' for the Muslims? I thought not.","post_message":"Wear-a-Hijab-for-a-Day Events at Universities!"},{"comment_id":"10153902791784087","commenter_b":"'@username : Shattup Trump whore","commenter_a":"Perfect. No one should be above the law and it's disgusting how her supporters are okay with her getting away with it but when repubs get away with it they act like babies. I'm not Republican either, mind you.","post_message":"#BREAKING: The House Oversight Committee will send a formal request to the FBI as early as next week asking to open a criminal investigation into allegations that Hillary Clinton lied to Congress."},{"comment_id":"10155066492903352","commenter_b":"this dirty ass white trash have nerve to say something rude tlking about in my mother country do Thy use punctuation marks Bitch u just went thru ur pic on Facebook first of all you hve two boys how wuld I feel if some one were to follow the boys in rape them but then again you look like a crak head so u wuld not give two fucks right stop hittin that pip b4 you wanna tlk about other people in there country trailer trash Bitch don't u hve some beans to go warm up in the fire in eat","commenter_a":"Fa real if you can have the nerve to to that to a child who barley can right his name an innocent baby in the Lord's house you shuld get more than yur face ate in my mother country we wuld have tie his ass up in take turns slicing his body parts mKe him then make hungry stray dogs eat his freaking dick in his balls then when thats over set his ass on fire wile the mother stabs him his ass to see","post_message":"A mother let her 4-year-old go to the bathroom alone during Sunday Service…Rolls Wheeler, 39, followed the boy when he got up, and raped him in the restroom. ----> @webpagelink"},{"comment_id":"10154575005093645","commenter_b":"Beyonc sucks..adele is 10 times the singer","commenter_a":"It's crazy because BEYONC deserved that award. Everyone knows it.","post_message":"She beat Beyonce in the top three categories with her comeback album , and repeated her accomplishments from 2012, when the British star also won album, song and record of the year at the Grammys.  She used her speech to honor Beyonce and her groundbreaking  album, which was also nominated."},{"comment_id":"2169846419907186","commenter_b":"Don't listen to Nikki's Parra she needs to go back to school and take a history class or two cause slavery wasn't about a protest and it didn't end cause of one as well","commenter_a":"These people doesn't really know anything. They only wanna learn and hear what they want to hear and learn that is not against to them. Shame on you all! Get back to class and get a better future rather than this. Best revenge is to get educated!","post_message":"Students at East Los Angeles College and more than 100 colleges across the country walked out of classes and held rallies in protest of Donald Trump’s election as president. @webpagelink"}]
