[{"comment_id":"994492227347127","commenter_b":"Where is sound. Its just like showing a 360 picture.","commenter_a":"Watching from Yorkshire","post_message":"We were live at the demolition of one of the UK's tallest buildings. The Grain power station in Kent came down at approximately 11:00BST. Do you live in the area? Were you happy or sad to see it go? (Skip to 10 minutes in for the demolition moment)"},{"comment_id":"10153283660836770","commenter_b":"This woman is an utter moron! There's more people watching the GOP debate tonight than all the democratic debates!","commenter_a":"Freud would be laughing at DWS totally projecting on the GOP.....exactly what she has been doing .....burying dem debates on Saturday nights!","post_message":"Democratic National Committee (DNC) Chairwoman Debbie Wasserman Schultz tweeted Saturday night suggesting the Republican Party was “trying to hide” a debate by scheduling it on the same weekend as the Super Bowl."},{"comment_id":"1180908731937011","commenter_b":"YOU SUCK","commenter_a":"The Chinese asked the mongols the same thing","post_message":"ON IMMIGRATION: \"I have a hard line on this. We have a country or we don’t have a country. WALLS DO WORK! Just speak to the people in Israel. #GOPDebate"},{"comment_id":"1117421238280665","commenter_b":"Mary please do your homework. It would be great to have a woman president but not her. She's a chameleon. If she hasn't flip flopped on something that matters to you just wait...","commenter_a":"Hillary Clinton is the single most qualified candidate in the race, and of the last 60 years. she is the right woman for the job, and in 284 days, i will be proud to call her Madam President.","post_message":"EXCLUSIVE: Vice President Joe Biden reveals what he thinks about the US electing a female president. \"This country's ready for a woman.\""},{"comment_id":"10154096088722373","commenter_b":"a monstrous buffoon!!","commenter_a":"I agree Senator! So where have you been while former Presidents, candidates and officials broke the law? President Obama ruled by EO so Trump is picking up where his predessor left off. Just going at it from different direction. We need to get back to changing law via legislative process rather than by fiat.","post_message":"Donald Trump is going to have to learn, in one way or another, the very important truth recently stated by the Attorney General of Washington, Bob Ferguson: \"We are a nation of laws. Not even the president can violate the constitution. No one is above the law, not even the president.\""},{"comment_id":"10153806284196509","commenter_b":"He is representing the USA is a PATRIOT with money. MANY MANY AMERICANS R Rich! PRAISE GOD WHOM ALL BLESSINGS FALL! RICH People make employment for others! RICH people can pay well & most do! Rich people donate to causes that heal, give to the poor, spread for GOOD! They are AMERICAN CITIZENS with opinions that this country needs fueled now!","commenter_a":"TRUMP is an AMERICAN that is ENTITLED to a VOICE! We support TRUMP!","post_message":"Both co-hosts of Miss USA, Cheryl Burke and Thomas Roberts, have pulled out of the pageant in light of recent comments from Donald J. Trump. @webpagelink"},{"comment_id":"576110785930150","commenter_b":"@username did she grab them by the pussy?","commenter_a":"Read stories that when Slick Willie was president, the spent more of their time protecting him from Killary than anything or anyone else when she went on her ballistic tantrums.","post_message":"Not only is she corrupt, she's also beyond rude and disrespectful to those who protect her very life. So many who've worked for her attest to her nasty nature. natl.io/ghciVB"}]
