[{"comment_id":"10152833752231130","commenter_b":"Hell yea older woman know what's up:) Amber Gray","commenter_a":"Lol. Ian.","post_message":"Yet women prefer to be younger than their partner."},{"comment_id":"481313708745082","commenter_b":"nimby. they do not want to see oil rigs, how ever it is okay to strip mind in my back yard to get sand to build the roads to their beachfront homes. what a bunch of hypicrites.","commenter_a":"Thank you @username for your support for our coast !!","post_message":"With all the updates today, I wanted to make sure that you caught this earlier post with my statement on the Administration’s decision to protect the Atlantic from offshore drilling...so I’m sharing it again."},{"comment_id":"10153686958951028","commenter_b":"Not her? This is total and a unpleasant BS!!!","commenter_a":"Joseph & Christine wowwww","post_message":"Former professional wrestler Chyna has died at age 46, her manager confirmed to NBC4. @webpagelink"},{"comment_id":"10154109773821491","commenter_b":"I watched the video. And I know horrible treatment of animals in factory type production of food. I know a guy right after high school that had a job for one day catching two chickens at a time and melting their beaks with a hot iron. That was done so they wouldn't peck at each other. But that's not what the post is about.","commenter_a":"One egg yolk has 62% of your daily allowance of cholesterol. One strip of bacon has 3% of your daily allowance of cholesterol.","post_message":"Eat those yolks, folks."},{"comment_id":"10153732980425530","commenter_b":"wow this is news someone reports to Jury duty and they also have a book what a novel idea, I haven't done that at least on 3 separate occasions.....oh wait I did......what people consider news now a days is idiotic.","commenter_a":"Kate Crispignani","post_message":"Kid Rock showed up to jury duty this morning along with a paperback book to help pass the time."},{"comment_id":"10153275307228132","commenter_b":"You're a total dick!!!","commenter_a":"Junkie","post_message":"\"So funny, honest and loving. We lost a great one today.\""},{"comment_id":"10154921930118690","commenter_b":"Karim Alyaa Dina","commenter_a":"Bal","post_message":"Integrating into a new country can be hard. That's why Horst Wenzel is teaching refugees the ins and outs of German dating culture."}]
