[{"comment_id":"10152643081825496","commenter_b":"Sadly, it's the day and age were in. My mother died of ALS in June 1973 but was in the hospital and out many times and was never denied care. In fact she spent the last 3 months of her life in the hospital and had her nightly beer with my dad. Hopefully at some point in time they will get it figured out but sadly will probably not happen in my lifetime.","commenter_a":"That's exactly how they work. They deny, deny, deny until the person /family gives up hope. It is terrible how these people can get away with stealing/withholding money that these precious people put in and need.","post_message":"A few weeks ago, 11Alive shared the moving story of 42-year-old Melissa Kern. She had been battling ALS for almost a decade, and had reached a point where she could only move her eyelid to communicate. While she fought the disease, her husband Chris struggled to pay the bills, getting nothing from Social Security for disability benefits. Bill Liss 11Alive took on the case. They succeeded. Tragically, it was too late. See more: @webpagelink"},{"comment_id":"10153981739504091","commenter_b":"Go stick your head in a latrine!","commenter_a":"What did he know about the Clintons?","post_message":"RIP: The star of reality series Ice Road Truckers on HISTORY was killed in a plane crash while he was planning to film a show about recovering plane wrecks."},{"comment_id":"1461843750508898","commenter_b":"WHY DO THEY LET THIS GUY DO THIS ? JUST SHOOT HIM AND BE DONE WITH IT .","commenter_a":"Another scumbag trying to blame someone else for his criminal actions. This seems typical of his type. Rot in prison and enjoy your \"foot longs\" until you die, Jared Fogle","post_message":"He is claiming that the PARENTS are to be blamed for her spiral of drug abuse, self-harm suicidal thoughts, which she says was the result of his abuse."},{"comment_id":"831982023505806","commenter_b":"This woman needs to take the beam out of her eye before plucking the speck out of mine.","commenter_a":"The key point is she CHOOSES what to wear. So long as it is her choice, and not forced upon her, that's fine.","post_message":"Christian mom explains why she decided to stop wearing leggings:"},{"comment_id":"1814664762098886","commenter_b":"But you sure don't mind taking white people's money do you Colin?","commenter_a":"Then have him sit on the locker room bench and not the field","post_message":"NFL player Colin Kaepernick isn't apologizing for his controversial decision to not stand during the national anthem."},{"comment_id":"10156085666465354","commenter_b":"@username Nah ..shes a Wanna be Black!!","commenter_a":"Why are these F*%^ ers not being hunted down, arrested and prosecuted as the 60's radicals were? Why do we even have an FBI????","post_message":"“The revolution is on…Off the pigs.”"},{"comment_id":"10153792948033352","commenter_b":"@username you are entitled to an opinion like everyone else but nobody said black women don't commit suicide. Infact it's about human rights so forget the colour of her skin & remember she's a human like all of us. Even if that is her in that video, it doesn't rule out the fact she could of been killed. There is more to the story the system has a duty to protect not harm, so they will do everything in their power to clear their name. So if her death was a result of any officers wrong doing, I hope her family gets justice","commenter_a":"Clearly that's 2 different oranges and the lady in the video is slightly thicker than sandy. BELIEVE THAT FOOLERY IF YALL WANT TO. #SANDYSPEAKS","post_message":"Authorities in Texas release Sandra Bland booking footage in response to death threats over social media rumors that she was actually dead in her mug shot"}]
