[{"comment_id":"10153217406773812","commenter_b":"You dont seem like the kinda girl that could shoot a dog more the poisening type.","commenter_a":"Nope nope nope. A dog bites my kid and he's lucky to die by gun.","post_message":"Man charged after shooting, killing family dog that bit 4-year-old boy: @webpagelink"},{"comment_id":"10153921857951323","commenter_b":"seductive dancing is an ancient art form...and a rare 5% of woman have any natural talent at it at all.","commenter_a":"'Sex industry' is not an industry. Sadly you were not given enough opportunities and maybe this is why you think this is a job.","post_message":"\"The sex industry is one of the very few industries in which middle-class to upper-class men regularly give large sums of money to working-class women. I wonder if that’s one of the reasons why people hate us.”"},{"comment_id":"10153185123243984","commenter_b":"For all the rhetoric and obfuscation, will Gowdy, or anyone else, really have the stones to put this bitch in jail? Lord knows she and many others in this government belong there!","commenter_a":"Please... don't tease me.","post_message":"Trey Gowdy just hit Hillary Clinton with an attack that could end her presidential ambitions... Do you have Trey Gowdy's back?"},{"comment_id":"10153647518861350","commenter_b":"This is 100% a mental illness! We would never approve of someone cutting their right hand off b/c they decided they had to be a lefty. So why in the world are we letting these people mutilate themselves?!! It's not about sex it's about the brain. They need help!","commenter_a":"The man with the sign in the background has the heart of the issue correct: girls' rights matter! No way would I want a confused young man using the same bathroom at school as my daughter. These young men and women need help. I have compassion for them because they are confused. Steer them towards counseling and mental health treatment. Caitlyn Jenner isn't a hero. I don't buy the \"if it saves one life\" act. The fact is the majority of suicides in transgenders occur AFTER they've made the devastating and disastrous choice to destroy their own bodies as God created them. They need treatment BEFORE they get to that point, not someone telling them they're fine as a woman when they were born a man or vice versa!","post_message":"\"I'm not the only transgender person at my school, and I won't be the last.\""},{"comment_id":"10154441251316756","commenter_b":"Dousing has been around for a long time.","commenter_a":"Funny how those diving rods never find the plumbing or septic tanks..","post_message":"Our reporter says the rods she was holding \"forcefully cross[ed],\" without her moving them. She doesn't know how it happened."},{"comment_id":"10152995429007507","commenter_b":"So you won't procreate?","commenter_a":"Ha-ha.","post_message":"Clock started...."},{"comment_id":"676882525784251","commenter_b":"STOP IT !","commenter_a":"When did this actually happen? Yikes...............","post_message":"An oil spill the size of Manhattan is devastating the Gulf of Mexico, and nobody's talking about it. #MicBrights"}]
