[{"comment_id":"404872436304464","commenter_b":"Pieces of shit like her need to be culled, slowly an painfully.","commenter_a":"Now I've heard everything. Hurry up with the \"Big Payday,\" Lord.","post_message":"A woman and her cop husband were at a bar for a drink before she got on the road and ran over three teenagers riding their bikes. Now she is suing the boy's family for the \"trauma\" she was put through by hitting and killing one boy and permanently injuring two others."},{"comment_id":"1210524342343014","commenter_b":"Maybe she's drunk or high. Don't even look good","commenter_a":"Notice how fb took off the video? CNN reporter admitted Obama paying off the media to only cover bits and pieces of Trump speeches, to keep the media from exposing Hillary's corruption","post_message":"What is wrong with Hillary? She just completely froze AGAIN...her handler had to rush the stage, comfort her, and tell her what to say! WATCH..."},{"comment_id":"496205537248565","commenter_b":"@username OK crazy lady, you might need some medication","commenter_a":"I'm a full supporter of Bernie but I'm guessing he is done?? If so I'll have to support Clinton. One I support Democrats. Two. Trump is a disgusting fraud who makes us look horrible. So if it comes down to Clinton and trump VOTE CLINTON!!!","post_message":"Thank you, Ohio."},{"comment_id":"1120997057921304","commenter_b":"In my way to get wine lol!!!!!!","commenter_a":"Bad science!","post_message":""},{"comment_id":"10153898128831509","commenter_b":"Stay home until your baby is weaned? Seriously stop! If you want to live some backwards, 1950s lifestyle, you go right ahead. While you're at it, why don't you just keep your opinions to yourself, since that's what a nice housewife would do, right? Give me a break. This misogynist refused to give her a break. There is also nothing to be modest about when it comes to breast feeding or pumping. Maybe you're the one who should work on modesty when you're over there over sexualizing a part of the female anatomy that is meant to help sustain life.","commenter_a":"She should have Left the room To Pump! Really Embarrassing for the female and males in a business Meeting! Have you no Modesty or even Selfrespect ! Stay home till your baby is weaned !!","post_message":"Donald J. Trump's attorney says Trump's language wasn't about her decision to pump breast milk, but solely on where she chose to do it: @webpagelink"},{"comment_id":"1153132958040066","commenter_b":"All 3 should be skinned and decapitated!","commenter_a":"And everyone \"outraged\" are all Vegen, right?!! Where is the outrage for the 100's of 1000's of innocent babies murdered every year???!!!","post_message":"The U.S. tourist who who killed Zimbabwe's beloved lion, Cecil, received global condemnation as news spread. Read more here: @webpagelink"},{"comment_id":"10154617085889714","commenter_b":"@username you have a hot wife!","commenter_a":"He dressed as a gypsy gives savvy. This is the bottom for America...","post_message":"Hillary Clinton is “our new president.” Barack Obama is “the greatest president we ever had.” And Donald J. Trump is…. “No comment,” says DJ Khaled. Full interview: @webpagelink"}]
