[{"comment_id":"10156857801965093","commenter_b":"Who will women vote for if Trump and Clinton are both running in the Fall?","commenter_a":"Maybe America have more young vaginas thann old vaginas!","post_message":"It's hard to believe America's first female Presidential front-runner is doing THIS badly among women."},{"comment_id":"692747934208970","commenter_b":"If illegal aliens must be allowed into our colleges, they should be charged twice the tuition as out-of-state students, with no eligibility for any financial aid, and any courses that legal aliens are taking in order to obtain citizenship be mandatory.","commenter_a":"He'll no!","post_message":"Do you think illegal aliens have a right to attend taxpayer funded public universities?"},{"comment_id":"1008212159219442","commenter_b":"So....according to your thinking...If the CEO of a company steals a million dollars from stockholders....and a New CEO is elected, then it is the 1st one's fault if the new one steals 2 Million???","commenter_a":"Since Obama loves releasing terrorist from Gitmo - and \"trading them for Americans...looks like he could have negotiated a trade for these prisioners, afterall he did it for a deserter!!","post_message":"Iran continues to unjustly imprison and abuse at least three Americans: a Christian pastor, a former U.S. Marine, and a journalist. They must all be allowed to come home to their families immediately. This should be a condition of any potential agreement the Obama administration discusses with Iran."},{"comment_id":"10153097498516636","commenter_b":"She's attention seeking plain and simple","commenter_a":"She makes a good, logical point in my book. Why should menstrual blood be considered different than any other blood depicted in film, TV or video games? Can't have it both ways... I admit it's a pretty extreme way to make that point but you can't argue with the logic.","post_message":"Period drama"},{"comment_id":"10153699132454060","commenter_b":"Do you mean the hate speach espoused by the feminist campaigners? Such as the hashtag killallwhitemen and maletears","commenter_a":"hate speech is hate speech. We must identify and stop it.","post_message":"“Just because you lop off your dick and then wear a dress doesn't make you a fucking woman.\" Hate speech or just offensive? Cardiff University students think the former"},{"comment_id":"1789421224648085","commenter_b":"Ohio RED","commenter_a":"Trump 2016 #MAGA vote","post_message":"Donald Trump rallies at Michigan"},{"comment_id":"10153831797228132","commenter_b":"She is not doing her job!","commenter_a":"I love all these comments","post_message":"\"Kim Davis should have never been locked-up for being a Christian,\" said Mike Huckabee."}]
