[{"comment_id":"10155170960495093","commenter_b":"You know, the more I see about Manspreading and Manslamming and Mansplaining and etc...the more I think \"Womanwhining\"","commenter_a":"How bizarre that a feminist would lie while trying to make a (man-shaming) point. First time for everything, I guess","post_message":"The term \"manslamming\" comes from one woman's claim that she walked around NYC without moving out of anyone's way and almost every man slammed into her but almost no women did.   So National Review's Katherine Timpf decided to try it out herself  and 66 women ran into her vs. just 23 men. You can see video of all the slams here:"},{"comment_id":"10153697405309712","commenter_b":"Libs can flush millions on social programs and illegal non-citizens, but get their panties in a bunch over a blimp downed for not paying \"air tax\".","commenter_a":"Ikr","post_message":"An Army surveillance balloon's escape seemed a bit of a lark, but the long running program has been beset by high costs, low reliability and questionable performance."},{"comment_id":"1827275810826011","commenter_b":"Fuck you, bitch. Your head is up your little ass.","commenter_a":"vote for none of the above, the masses need to start a revolution and jail the corrupt 1% who pretend to give democracy in a nwo dictatorship , wake up and fight for your human rights","post_message":""},{"comment_id":"1288485644498385","commenter_b":"she was going to get nailed for perjury and they KNEW IT","commenter_a":"Well.... Bye!","post_message":"In case you missed the bombshell late last night, Ben Shapiro resigned from his post as Breitbart News’ editor-at-large over the management’s “disgusting” treatment of Michelle Fields."},{"comment_id":"1558210104487104","commenter_b":"So we fib a little bit.","commenter_a":"Lol BRUHHHHH 😲😲😲 Mike Scott","post_message":"This skydiver performed some of the stunts when Iron Man 3 was filmed in NC. Tomorrow night on FOX, he's performing a huge stunt without a parachute. Will you be watching?"},{"comment_id":"979819422085921","commenter_b":"@username don't curse Canada with the likes of people like her. Send them to mexico!","commenter_a":"Just because a person is an actor/actress does not mean they know their head from their a$$ ... proof right there in that statement","post_message":"Americas Freedom Fighters"},{"comment_id":"10152950804022434","commenter_b":"Just a bunch of liberal bitches that have no fucking brains. Their full of their self","commenter_a":"The view is always just a bunch of dumb bitches!","post_message":"Eggland's Best Eggs and Johnson & Johnson have pulled out as show sponsors."}]
