[{"comment_id":"10156253683750594","commenter_b":"Tickets better get cheaper!","commenter_a":"He got too confident and thought maybe too good and should have stayed a little more humble and kept his head down in his work. But the whole team was over hyped these last two seasons","post_message":"Just three years ago, Colin Kaepernick was considered the prototype for the quarterback of the future."},{"comment_id":"10153882229389062","commenter_b":"Man she looks like a man!","commenter_a":"I don't think she got the memo.","post_message":"The 6 officers charged in Freddie Gray's death have been released on bail @webpagelink"},{"comment_id":"911046885608046","commenter_b":"LIKE I SAID, SHE KILLED THOSE KIDS. A BEE?! Get out of here with that mess. Throw the book at her. @username,","commenter_a":"Whatever!! She killed those kids.","post_message":"Two 18-month-old twins drowned in an Arizona canal Friday after their mom briefly let go of their stroller to fend off a bee: @webpagelink"},{"comment_id":"10153490516091337","commenter_b":"You mean unlike theAmerican Killers of babies, rapist, serial killers, the ones signing up to be terrorist! Jake you're a blinded fool!!","commenter_a":"Illegal immigrants are coming in from all over South America , through Mexico, and the Mexican government is doing nothing to prevent it. And if you people watched anything besides cnn and msnbc, you would know that a lot of them, not all, maybe not a majority, but a lot, are killers, rapists, or drug cartel agents, and since crossing our border which is leaking like a sieve have continued those harmful activities in the US. But obviously Trump is a bigot for describing what is really occurring. The fact is he is one of the few candidates who has described a coherent plan for what he would do as president, and been more open to the media by far in the short time since announcing his candidacy than Hillary ever has. I hope he blasts her back into the Stone Age in the general election if he wins the ...","post_message":"\"It’s not Mexicans necessarily. They’re coming from all over.\"  2016 GOP presidential candidate Donald J. Trump talked about \"killers\" and \"rapists\" again..."},{"comment_id":"10152621933698067","commenter_b":"You nuts lady!","commenter_a":"Of course it is not free but at least your taxes are going to education instead of wars all the time. I can't believe how many Americans are so brainwashed against a little socialism. You guys at \"the top\" gotta get back to basics. The greed in your country is appalling. We are the lucky ones to still have subsidized healthcare. Taxes should go first to education and not onky spelling and writing, but to teaching life-skills, budgeting, health. 2nd to health including dental health. Tax the crap out of the fat and sugar laden processed foods. Start caring for community and stop supporting the conglomerates. Yay for Obama. The best president since JFK, only mote moral in his private life.","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."},{"comment_id":"10154666787286756","commenter_b":"But it's entirely not up to me how Islamic women choose to dress.","commenter_a":"It's crazy to me that the same people who are so feminist and or very liberal seem to not care at all about how Islam treats women. This is a great example of how they are extreme...even at the beach they have to be mostly covered.","post_message":"The Cannes mayor calls the burkini \"the symbol of Islamist extremism.\""},{"comment_id":"483283155193311","commenter_b":"Good ridance! Sorriest show on TV. Sorriest people on a show on TV. Both of the women above should be in a mental institution. Lock them two and Obama in a room together and let them live out their lives in peace. :)","commenter_a":"Hope so , it will be a blessing","post_message":"FINALLY!"}]
