[{"comment_id":"530303733802764","commenter_b":"Today is your Birthday? Well, then Happy Birthday!!!","commenter_a":"Happy birthday! God bless","post_message":"My birthday wish is that our nation would once again recognize God as our leader."},{"comment_id":"10152885307051336","commenter_b":"Totally totalitarian and just plain wrong","commenter_a":"Start pushing back people!!! They care nothing about your kids.","post_message":"UPDATE: The Goochland County School Board has now voted down the controversial policy on religious homeschooling. @webpagelink   Virginia parents are outraged over a new policy that demands home-schooled children justify their religious beliefs to a school board within 30 days of their 14th birthday."},{"comment_id":"10153921301277217","commenter_b":"'@username has lost their integrity!","commenter_a":"Hahaha.sorry for the laugh. But @username Please investigate first before you conclude on this report. These are all accusations to our beloved president . even his rival denied those witnesses that testified in the senate. sad to say our president's rival now is doing the best they can to destroy our only hope to have a drastic change in this country . BTW You need to go to our country first to know more abt the facts and whats really happening here. :3 -_- #PostResponsibly -_-","post_message":"Gruesome gangland-style hits, including feeding one victim to a crocodile, were described to a Senate hearing by a former death squad member."},{"comment_id":"1684551998460631","commenter_b":"I am not an American, but I and we all are interested in your politics. Because we other part of the world are concern for peace and prosperity. And Why so much hate? Why so many wars? Do you think that is the solution? What is the meaning of diplomacy for you guys? Is it only war? Do you think that in this 21st generation you are again doing politics for religion ? And certain race? Is that how you want to see American politics ? How come you think Obama foreign policy is miss leading you guys? Do you got the proper answer? He talks about climate change, which is happening and strongly scientist also believe that, he try to bring your army back in your country from Iraq and afganishtan, he shown us that diplomacy and foreign policy is not only about to hate and make enemy. He ...","commenter_a":"Trump doesn't back down from our enemies Obama. You are nothing but a coward. Your nuclear and foreign policy has only weakened us, and made it easier for Iran and ISIS to kill us.","post_message":"Speaking at the close of the Nuclear Security Summit, President Obama said Donald J. Trump's nuclear comments show he 'doesn't know much about foreign policy or nuclear policy or the Korean peninsula or the world generally.' @webpagelink"},{"comment_id":"946981455339195","commenter_b":"Lesbians...ya gotta love 'em, or give 'em to ISIS to be burned alive.","commenter_a":"Al Sharkton must go too!","post_message":"Well, that's one way to go out."},{"comment_id":"801111976648525","commenter_b":"Wow that's all I can muster after reading these comments","commenter_a":"copy that.....","post_message":"This brave, hard-working man has accomplished so much in the face of unprecedented obstructionism and hate. History will treat him kindly.   Thanks to Roy Mark Ramdas."},{"comment_id":"10153263448855095","commenter_b":"Arguments about religion, politics are a useless battle people nobody wins and about the refugees coming in i'm highly against it, there is no way we will know the good from the bad and I believe there are good and honest people that have been brought to America but you can bet your ass that there's a radical somewhere in the 10,000. I love my country and I'll be damned if we're gonna stand by and let our government bring in a possible threat and believe me it's very possible with the insane actions our president is taking, this will turn out bad and it will be the American people who will suffer in the end","commenter_a":"' My parents came to this country 45 years ago searching for freedom and a chance.' But you dont want to afford that same chance to others? What a hypocrite.","post_message":"I cannot tell you what an honor it has been to run for President of the United States of America. My parents came to this country 45 years ago searching for freedom and a chance.  When I was born, we lived in student housing at LSU, and never in their wildest dreams did they think their son would have the opportunity to serve as Governor of Louisiana or to run for President.  They raised me to believe Americans can do anything, and they were right, we can. But this is not my time, so I am suspending my campaign for President.  Going forward, I believe we have to be the party of growth and we can never stop being the party that believes in opportunity. We cannot settle for The Left’s view of envy and division. We have to be the party that says everyone in this country - no matter the circumstances of their birth or who their parents are – can succeed in America.  One of the things I will do is go back to work at the think tank I started a few years ago - where I will be outlining a blueprint for making this the American century.  We must show the way forward on growing our economy and winning the war against terror, and especially defeating radical Islam.  I realize that our country is off on the wrong track right now. Everyone knows that, but don’t forget, this is still the greatest country in the history of the world – and every single one of us should start every day by thanking God that we are fortunate enough to be US citizens.  Now is the time for all those Americans who still believe in freedom and American exceptionalism to stand up and defend it.  The idea of America – the idea that my parents came here for almost a half a century ago - that idea is slipping away from us.  Freedom is under assault from both outside our borders and from within.  We must act now, we do not have a moment to spare."}]
