[{"comment_id":"1056097081119075","commenter_b":"These lowlife Muslims are doing that in every country they are aloud into ! It's even going on here in America . It's how they take over a country without fireing a shot , they just out reproduce the natives and within a decade or two they will out number and be able to inpliment sharia laws ! We know Muslims have completely taken over one American city and are working on many more ! All these Muslims Obama has been bringing in are sent to certain cities for a reason ! Obama and Hillary are traitors and she will just pick up were Obama left off !","commenter_a":"Surprise, surprise.","post_message":"Muslim Pig Explains How He LIED To European Authorities To Bring In 4 WIVES  They are all about gaming the system and abusing our freedoms.   @webpagelink"},{"comment_id":"10153436372151337","commenter_b":"But Mariah has the booty","commenter_a":"The only reason this game sells is because of kate upton's nice tits. Big mistake","post_message":"A NEW \"FACE\": Those Game of War - Fire Age commercials will no longer feature Kate Upton..."},{"comment_id":"10153762499342483","commenter_b":"@username but she taking millions of dollars from terrorist country and support Obama funding Iran and terrorist","commenter_a":"Why would anyone vote for lying Hillary","post_message":"Forecasters give Hillary Clinton a big chance to win, noting that the odds of her losing the race are about the same as an NFL kicker missing a field goal from the 20-yard line."},{"comment_id":"10153114597787507","commenter_b":"I thought women were the snakes","commenter_a":"An old lady told me about 30 years ago: Some men would screw a snake if someone would hold the head. So there you go!","post_message":"Go get em!"},{"comment_id":"10154291301186337","commenter_b":"They better pay that woman right this time, she'll put your ass on blast if you negotiate her pay in any way.","commenter_a":"So they are doing a reboot of a remake? Hollywood has really run out of ideas.","post_message":"J-LAW BREAKIN' THE LAW! If Sandra Bullock plays Clooney, then is Jennifer Lawrence Brad Pitt?"},{"comment_id":"1316522848388184","commenter_b":"Trust me, women punish themselves way more than is good for them.","commenter_a":"He makes no sense why this man Willi never be president we heard what u said","post_message":"Trump manages to offend women in a completely new way."},{"comment_id":"10154026224212869","commenter_b":"I agree! There are plenty of legitimate issues that should convince anyone paying attention that Clinton does not belong in the White House. I feel like spinning 100 different (and in many cases overwhelmingly mean spirited) conspiracy theories makes the relevant confirmed issues on either side carry a lot less weight. I'm not saying that I don't think her health may be an issue, or even that it shouldn't even be written about, but there are 100 different reasons for a vehicle like that to include a wheelchair lift.","commenter_a":"Is anyone else tired of these feeding frenzies, I for one am.","post_message":""}]
