[{"comment_id":"10150849465384999","commenter_b":"Canada only lets rich Asians in obsessed with money!","commenter_a":"Keep letting Hordes of Immigrants into Europe!!!...Same goes for the U.S. of A., Canada & Australia!!!","post_message":"Victims of the terror attack on Bastille Day were honored on Friday in Nice, Paris, Rome, New York and Moscow."},{"comment_id":"1550216494995180","commenter_b":"I think Parkinsons...she looks like hell in that picture. Go home Killary and be a grandma","commenter_a":"I don't get the whole thing of her making appearances looking like a crazy cat lady. She's either sick, gone off the deep end, or trying to pull something. I don't know which, but she really just needs to find something else to do. She can still have a full life, but this is over.","post_message":"“As a Democrat, I am frustrated and ashamed. Unlike Hillary Clinton, I realize that America’s history was built not just on its gallant winners but also on its noble losers.” — Bryan Dean Wright, former CIA ops officer and member of the Democratic Party"},{"comment_id":"10155769419940231","commenter_b":"My thought is this Ladies; the occurrences, that we are know seeing unfold are strategic! I hope that you will agree that the system has removed a majority of our \"Black\" men who would physically engage in battle with the injustices. They are being removed from society and that weakens us as a people. They are imprisoned for a greater length of time, killed in unlawful ways right in our faces (bullets in the back, strangled and held by more than one, ect...). A great majority of our women are now out and about alone and really can not defend themselves physically against the powers that be! In addition I see more \"Black\" women, more than ever going to be the next victims of murder. This leaves our children more venerable than ever before!","commenter_a":"It would of not been like that if a man was in the car with her!","post_message":"It may not be in the way that she thought she would, but she has, indeed, changed history."},{"comment_id":"474408059350901","commenter_b":"Stay off their land!","commenter_a":"Err... They only kill white people because their other fellow tribes who join the \"democratic\" world suffered a lot of losses and they warned them. There is a documentary on this. You should check it out.","post_message":"Anyone who has ever tried to come ashore the island was attacked or even killed."},{"comment_id":"1090391007723817","commenter_b":"Arrest the bum and let him drink the water","commenter_a":"A shame","post_message":"The city has confirmed 200 cases and 9,000 exposures to lead poisoning in kids under age 6."},{"comment_id":"10157007192550354","commenter_b":"But illegal aliens have Constitutional rights..yeah,she can go fk herself right about now","commenter_a":"tell that to chelsea you a hole","post_message":"\"...the Left is very energetic about inventing myriad rights for people who weren’t born in the United States or naturalized as citizens. How can the absolute denial of rights for unborn persons, whose parents are indisputably U.S. citizens, be logically squared with the Left’s zeal for handing out rights to foreign persons who just happen to be standing on U.S. soil?\""},{"comment_id":"1576359559329284","commenter_b":"She's enabled men her entire life! Her big weakness ... Last thing we need is a woman enabler running America.","commenter_a":"Did she really just compare Donald trump to native Americans going off the reservation?","post_message":"Hillary Clinton brushes off Donald J. Trump's sometimes personal attacks against her as him being \"off the reservation\" — something she said she has experience with. @webpagelink"}]
