[{"comment_id":"10153100917462994","commenter_b":"And crazy women too","commenter_a":"Try a tour of Detroit, New York, and Green Bay. Anyone can do Florida lol.","post_message":"'I get treated really horribly. Actually the emotional part is much worse than any physical pain I go through.'"},{"comment_id":"873586192785317","commenter_b":"U feel sorry!!! Speak up your no better than them if u witness it and say nothing. Damn","commenter_a":"When I worked at the hospital in the lab..I can't tell you how many times I saw cops get unnecessarily rough with women ..women of any color. Not all but a lot..it actually made me start to feel sorry for their wives . If they do that on the job I hate to see what happens when they know they aren't being watched","post_message":"BRUTAL CONFRONTATION: Pennsylvania police officer charged after being caught on video appearing to punch a woman during a traffic stop: @webpagelink"},{"comment_id":"1514259995548132","commenter_b":"... People do realize the article isn't about humans right? None among us can store the seminal fluid of various males and asses it for quality before choosing our baby daddy's, just FYI. ;)","commenter_a":"Rachel Pratt :)","post_message":"There's more to semen than just sperm."},{"comment_id":"10154130033413797","commenter_b":"so she should keep her legs together","commenter_a":"you have a brain tumor and you are suing bc you want your tubes. out.. are you sure you are just not brain dead?","post_message":"A woman suffering from a brain tumor is threatening legal action against a Catholic health system because the hospital is allegedly refusing to tie her fallopian tubes based on religious belief. The procedure could be life saving for the woman..."},{"comment_id":"10154383747512908","commenter_b":"Pussy","commenter_a":"It will never stop. Americans absolutely love guns and violence. The NRA owns this country. I got my passport so I'm outta here.","post_message":"Mass shootings are becoming an almost-everyday occurrence in this country. This sickening and senseless gun violence must stop."},{"comment_id":"10153085331829205","commenter_b":"she would","commenter_a":"He needs to be charged with AT LEAST manslaughter... she w","post_message":"New Sandy Bland Dash Cam Footage Released"},{"comment_id":"10153278392893352","commenter_b":"Bitch,just ruined my happy day.","commenter_a":"She neither loved her children or deserve to be called their mother. Her hatred for her husband superseded the lives of her children.","post_message":"Mother ‘burned her three children to death and rang their father so she could tell him “Listen to their screams – they won’t survive” after he demanded custody in Belgium’"}]
