[{"comment_id":"10154759698326509","commenter_b":"Then no sex allowed","commenter_a":"What if you're bulking","post_message":"You're human, so chances are, you're interested in getting more sleep, having better sex and improving your mood..."},{"comment_id":"10152955099256336","commenter_b":"They sound like a bunch of babies saying the same thing over and over again. Do it don\"t just say words.that mean nothing. You are not scaring these animals do something.","commenter_a":"Lt. Col. Peters ,just another fool on FOX, Susan Rice.... heads the NSA.","post_message":"“Secure, expand, defend, leverage – her four points. Bill, that’s not a strategy, that’s a bumper sticker. The yogurt I had for breakfast had more intellectual structure.\"   Lt. Col. Ralph Peters slammed National Security Advisor Susan Rice’s speech on the United States’ national security agenda."},{"comment_id":"10153541203558690","commenter_b":"She's a recovering alcoholic...... That says it all right there","commenter_a":"Living within your means should not mean living in a cardboard box or struggling to pay for minimum needs! What a selfish ignorant thing to suggest! Low wages determine the quality or lack of it in your life, it also means absolute lack of choice!! It absolutely sickens me to read the suggestion that if you are working and struggling it is automatically your own fault! Life happens and not always by our conscious choice! There are many many external influences that can alter your existence negatively! The American dream is a distant illusion for millions of people! In many instances through the greedy manipulation of conglomerates and the loaded banking system! Please don't give me the tired \" think and grow rich \" schemes! I am an old chook, I've known uber wealthy and the other end of poverty throughout my life! Wealth is mostly \" built upon the ...","post_message":"While the debate over minimum wage continues in the US, Emilia Stancati , a 50-year-old who has worked as a waitress for most of her life,  falls further into credit card debt as her  job fails to cover her bills.    Watch the latest episode of Hard Earned:   @webpagelink"},{"comment_id":"10155900570730354","commenter_b":"IRAN PUT OUT A MESSAGE TODAY SAYING \"DEATH TO AMERICANS\". THAT WAS TODAY FOLKS TODAY....OBAMA IS THE WORST MAN IN THE HISTORY OF THE WORLD. HE WILL HAVE PAY FOR WHAT HE IS DOING TO THIS COUNTRY. IT WONT BE TOMORROW BUT IT WILL HAPPEN. KARMA IS A BITCH.","commenter_a":"AND IS ANYBODY REALLY SURPRISED OR SHOCKED THAT OBAMA LIED? THAT'S WHAT HE DOES BEST.","post_message":"See the updated language comparison... this just keeps getting more PATHETIC:"},{"comment_id":"10153370720431509","commenter_b":"Well the real word is cold and full of corruption and greed. This type of harvesting happens on a daily basis in 3rd world countries, poor desperate individuals selling their kidneys in back allies to rich benefactors. Most illegal organs are stolen form human trafficking.","commenter_a":"Organ harvesting and transport is complicated. You can't just slash a body and grab them out. This sounds like a ploy by the Iraqi govt to get headlines","post_message":"It's a startling claim. If true, what could be driving increasingly extreme tactics #ISIS is employing? @webpagelink"},{"comment_id":"1801831173397468","commenter_b":"Michelle and Hillary are 2 of the most dishonest people ever!! If Hillary wins then you can tell your daughters and grand d aughters as you watch them being raped by the refugee's , how you are soo happy you voted for this evil..woman .. Get ready for it, with a Hillary win, it will be Sharia Law...","commenter_a":"Want more of THIS, America? Vote Hillary and you just might get it!~ >","post_message":"\"This is a country where a girl like me from the South Side of Chicago whose great great grandfather was a slave can go to the finest universities on Earth. A country where a biracial kid from Hawaii, the son of a single mother, can make it to the White House. A country where the daughter of an orphan can break that highest and hardest glass ceiling and become president of the United States. That is who we are, that is what's possible here in America—but only when we come together, only when we work for it and fight for it.\" —First Lady Michelle Obama today in North Carolina IWillVote.com"},{"comment_id":"10155518343016729","commenter_b":"This is a repost .....As For Barack Obama, We watched him sit for 20 years in a Church whose preacher condemned America . We watched him travel the globe apologizing for America's greatness .We watched him allow guns to be shipped to Mexican criminals so they could later turn up at crime scenes to mislead American opinion. We watched him use the IRS to punish those with opposing views . We watched him shrink America's military defences ,We watched mistreatment of our veterans , We watched the Ambassador and his protectors be left to die and be covered up by a lie , We watched our nation debt be doubled , We watched the nation's food stamps recipients climb to 25% , We watched a health care system nearly implode to promote some utopian fairy tale. We watched our police be disrespected , race relations fall to an all time ...","commenter_a":"Facebook is so liberally biased. Had this been a post by a Conservative toward Clinton or Obama supporters, the account would have been terminated. Also the person would have been fired from their position immediately. So the school not yet terminating him is garbage.","post_message":"Despicable!"}]
