[{"comment_id":"10154521011917098","commenter_b":"You a hoe","commenter_a":"Hahahahaha trying to get his dick wet but caught a case of the zzzzzzz","post_message":"#HEARTBREAKING: When police arrived, they found the 17-year-old dead in the foyer."},{"comment_id":"1571937346447279","commenter_b":"Get a new woman then!","commenter_a":"In the singing voice of Brad Paisley: Im gonna miss her.... I love my husband AND my guns!","post_message":"\"Sex strike\"  WATCH:"},{"comment_id":"1077871268936068","commenter_b":"I guess being a lawyer, U.S. Senator and Secretary of State aren't real jobs?","commenter_a":"So fun to meet someone whose actually worked a real job..eh Hillary?","post_message":"The best part of being at Caesar's Palace at midnight? Meeting the amazing staff."},{"comment_id":"10153567844472434","commenter_b":"Carol Adams you're mentioned here and might enjoy, grrrl!","commenter_a":"Unfollowing. I'm tired of your anti-vegan rhetoric. The fact is that eating meat is the largest contributor to climate change. It is an industry that is notorious for violating human and animal rights and destroying the global environment.","post_message":"Anything mass produced is shitty for the environment, including almond milk."},{"comment_id":"10153731368766756","commenter_b":"Aubrey A Price","commenter_a":"Jay Stephan Steinmetz, oh the La Fee!","post_message":"It was not art, but necessity that first helped popularize absinthe: It was included in the rations of French soldiers who marched off to colonize Algeria in the 1840s, issued \"for the prevention of fevers and treatment of dysentery.\"  It was only later that drinking absinthe came to be viewed as an indulgence for both the eyes and the tongue."},{"comment_id":"10152734752671051","commenter_b":"Unbelievable! some women should not children and she is one. Discipline begins at home.","commenter_a":"Needs a good ole fashion spankin.","post_message":"This 11-year-old boy is responsible for a fifth of the crime in his town – and his mother knows exactly who to blame for that."},{"comment_id":"10155938644580354","commenter_b":"OF COURSE NOT! Did anyone actually think these weasels with their blood money in their pockets would do anyting to regulate Planned Parenthood? LOLOLOLOL Fell off the dumb truck, did ya?","commenter_a":"Go back to work useless bastards","post_message":"GOP consultants who hate the grassroots--and their values--continually boast about the historic majority they won in the House, purely by their own DC insider wisdom.  But if these are the best results we can get from that majority, what have they actually accomplished?"}]
