[{"comment_id":"10156622282140354","commenter_b":"Al Sharpton can kiss my all white hairy ass..","commenter_a":"AL SHARPTON---STILL FLAPPING HIS LIPS---HEY AL --Where were you when those three Black Thgs killes that 3 year od Black girl playing on her porch Christmas Day---oh thats right--there was no pay day in that one for you..","post_message":"Liberals are FUMING over these 2 tweets from Al Sharpton blasting liberal Hollywood hypocrites..."},{"comment_id":"1185753454849738","commenter_b":"Hope to hell this arrogant prick gets put in prison !!","commenter_a":"Who cares...arrogant classless racist. Good riddance.","post_message":"It's always about him. Always."},{"comment_id":"10154190789236336","commenter_b":"This is so exaggerated. I bet this was seen as an opportunity and she had someone else bruise her. She did not almost go down and showed no pain or upset on the video. She also shouldn't have approached Trump like that in the crowd. His life has been threatened so someone would have pushed her back. Maybe she should stay home. Also it sounds like this is her M.O","commenter_a":"Too bad...she wasn't in ANY way hurt...she's shooting for her 15 minutes of fame...","post_message":"\"We saw libel, defamation, slander, smearing of her reputation, simply for trying to do her job,\" Katie Pavlich said. \"This isn't just about simply one reporter. It's a bigger issue of the role of the press in America.\""},{"comment_id":"10153823780186051","commenter_b":"No. In fact, I wouldn't piss in her mouth if her teeth were on fire.","commenter_a":"Vote Blue no matter who!","post_message":"Simple question: Will you be voting for Hillary Clinton this November?"},{"comment_id":"843506072460327","commenter_b":"Nina Turner is wrong and she knows it!","commenter_a":"She obviously never Studied JFK","post_message":"Sanders’ camp: Democrats ‘court disaster’ with Clinton"},{"comment_id":"10155618780610093","commenter_b":"Go stick your head back in the ground Anne...clearly you have failed to realize that unless ISIS is wiped out..they will not stop...period. And yes they want to strike us here. You want that? You rather they come here on our turf? Lady you better do a gut check and wake the hell up.","commenter_a":"Sorry but we should NOT have boots on the ground in Syria.","post_message":"\"It involved hand-to-hand combat, the jihadists tried to use women and children as human shields, and about a dozen jihadists were killed.\""},{"comment_id":"10153187291468812","commenter_b":"Sex slaves, good job girls!","commenter_a":"What's wrong with people this world is going crazy","post_message":"NEW: Search on for 3 schoolgirls who have fled home to join ISIS: @webpagelink"}]
