[{"comment_id":"390976721026923","commenter_b":"She needs a new Do!!! Lol","commenter_a":"Yep holder in a skirt","post_message":"What do you think of the White House nominee for Attorney General?"},{"comment_id":"10157349438290354","commenter_b":"She needs to shut up! We don't care!","commenter_a":"Rosie needs to check in at the local mental health clinic ASAP","post_message":"And that's not all Rosie O'Donnell said about Donald Trump either..."},{"comment_id":"10153876614269024","commenter_b":"Kick this fucker right in the mouth","commenter_a":"What a poor excuse for a Mayor.","post_message":"@conservativebyt"},{"comment_id":"10153721390631800","commenter_b":"@username Girls, that's who.","commenter_a":"I can't see the humor in girls trying to look sexy and then being offended by aroused boys and then also being offended when boys don't care about them. I think the problem here is with the girls identity crisis rather than with boys boners.","post_message":"Kristen Schaal finds a way to prevent teenage boys from being too \"distracted\" by girls in leggings. @webpagelink"},{"comment_id":"842369659142996","commenter_b":"Child abuse has actually increased since Roe v Wade. Abortion logic 101...the baby \"might\" be abused later so we'd better kill her now; the baby might actually get to LIVE in a non-traditional home so we'd better kill her now\". Sheeeesh, the stupidity.","commenter_a":"So many young couples would love to take that precious angel growing inside of you. Please don't murder that innocent baby..","post_message":"You don't get to \"choose\" to kill another human being."},{"comment_id":"10153548972367093","commenter_b":"LOL. Go back to California.","commenter_a":"This Texan will be voting ALL BLUE in November! Bigotry and hatred has to end! #voteTxBlue - you #GOP small minded idiots don't remember that Texas WAS a blue state for a long time! LBJ was a Democrat from Texas, and TX was a Blue state until 1994!","post_message":"With Trump as the Republican nominee, Clinton thinks a large turnout of minority voters could put Texas in play... @webpagelink"},{"comment_id":"403639093305500","commenter_b":"LEGAL IS THE WORD... What's a phony!","commenter_a":"Riding on the coattails of his dead son, he will burn in hell...","post_message":"Watch as the ACLU and Gold Star father Khizr Khan hold a news conference on President Trump's immigration ban.  Read more about Khan: @webpagelink"}]
