[{"comment_id":"595246650649268","commenter_b":"You're not a woman... so we don't expect you to get it...","commenter_a":"what brand of dope is she smoking? Seems to be effective in blocking reality","post_message":"\"I think [Trump] would be very good for women’s issues.\" - Caitlyn Jenner"},{"comment_id":"974273862659225","commenter_b":"We get it Hillary you and the democrats are buying the immigrates votes!","commenter_a":"Hillary Clinton is saying we must be guided by laws? Comedy gold!","post_message":"Hillary Clinton said the deportation raids had \"sown fear and division in immigrant communities across the country.\""},{"comment_id":"998045550284803","commenter_b":"i i think trump should have an abortion and have his you know w hat removed along with his tongue","commenter_a":"Is he going to waterboard women too?","post_message":"BREAKING:"},{"comment_id":"642366659287246","commenter_b":"Megan, you do a great job for Fox. They are lucky to have you.","commenter_a":"Fair and Balanced?!?!?","post_message":"Megyn Kelly may be getting kicked off the air... FOX needs our support, let's give it to them. Do you support FOX News?"},{"comment_id":"1666280716731910","commenter_b":"When she gets out she will be deported.","commenter_a":"she'll get out in less than 8 years...crime has consequences...and people exploit illegals...that's one of the reasons we need to build the wall and reform and enforce immigration laws!","post_message":"The Democratss tell illlegals, \"Yes, go ahead & vote\"—this woman does it five times and gets eight years in the slammer."},{"comment_id":"1211550438923490","commenter_b":"Hope they kicked her muslim loving ass!","commenter_a":"It's all about lying and money....HO B. Are they peace loving people haha.!!!!","post_message":"In Indiana, a Muslim woman is making news after she thought the rules didn't apply to her. She demanded special treatment from an establishment and got something very, very different... what this manager gave her instead is going viral, and not everyone is in agreement with it."},{"comment_id":"10154831608750211","commenter_b":"Selfish whiner","commenter_a":"What a crock of crap. Just trying to get some attention and get noticed as someone \"special\". Whatever......his loss.","post_message":" don feel accepted in the White House. With the president having so many strong opinions and prejudices I believe certain people might feel accepted there while others won."}]
