[{"comment_id":"10153847766591336","commenter_b":"That's Air Craft Carriers in english.","commenter_a":"So let's tell everybody what our Navy is doing!! Stupid media.","post_message":"On Monday, the aircraft carrier USS Harry S. Truman departed Naval Station Norfolk to head to the Middle East to combat ISIS. (Credit: U.S. Navy)"},{"comment_id":"10153773357374877","commenter_b":"WTF... Where I live... White people be blasting they music so cut the crap!","commenter_a":"Ugh","post_message":"Driving While Black: Cops drag black man from his car and Taser him for playing loud music.   Grio fam, this is wild!"},{"comment_id":"10154270105832293","commenter_b":"Feminist spotted","commenter_a":"If you have an ounce of common decency, you're statistically more likely to support Hillary Clinton.","post_message":"If you have daughters, you're statistically more likely to support Hillary Clinton."},{"comment_id":"932180273594983","commenter_b":"So these women thought it would be cute to be 'bad mom's'. It's a sad world we live in.","commenter_a":"Selfish mothers. Women who should not have children.","post_message":"'No one had communicated that children under six were not allowed in R-rated movies,' one of the moms said. 'We had breastfeeding moms with infants, one 4 weeks and one 7 months, and they refused them entry.'"},{"comment_id":"10153232997868352","commenter_b":"Serve her right she should have been in her house doing house work or school what the hell she doing out in a battle field throwing stone, lack of parenting","commenter_a":"that is horrible. This needs to be told all over the news. Sounds like something SA would do instead of Israel.","post_message":"Palestinian girl, 14, locked up in Israeli prison for two months for throwing rocks"},{"comment_id":"584420751713216","commenter_b":"STOP muslim immigration permanently !","commenter_a":"Yes!!!! And not just muslins!!!!","post_message":"Question of the Day: Should we halt Muslim immigration until the federal government can get it under control?"},{"comment_id":"10155266404471756","commenter_b":"I bet the indigenous Indians would love all of us to go home and leave their water alone !!!","commenter_a":"Bull! Obama and Clinton too!","post_message":"Protesters 'March to the Arch' to oppose Trump immigration order"}]
