[{"comment_id":"1104014366324977","commenter_b":"How is that racist lol Muslims are a ravery of people haha and no makes them follow a old book written by a peodphie that married a 9 year old girl","commenter_a":"Hey! Don't forget that ISIS are not \"real\" muslims. And it is just a coincidence that 100% of those who join or support are muslims. This has NOTHING to do with islam. And it is only 8% of the entire population of Turkey who supports ISIS. (according to a recent Pew Research poll) But don't worry about it, they are not \"real\" muslims either. Anyone who says that the world has a problem with islam is just a racist. We all know that islam is a religion of peace. Case closed.","post_message":"EXCLUSIVE"},{"comment_id":"778104105644597","commenter_b":"CNN reported on this at its finest. Condemned those who stand as patriots while providing excuses for those who slaughter innocent people . Nothing but hypocrisy!","commenter_a":"Love this lady!","post_message":"Report: Man slain by police in Boston sought to behead Pamela Geller"},{"comment_id":"1629456670679882","commenter_b":"Little Winnie bitch","commenter_a":"Toddler, bigot, lier","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153962547876519","commenter_b":"@username Wrong. No Muslim structures where they killed real Americans. You have a lot of anger. Try whimpering in a corner.","commenter_a":"Oh shut the fuck up you unhinged idiots. By this standard, I had two health episodes yesterday. It's really scorching in this city right now.","post_message":"Clinton was observed \"fainting\" in a departure area..."},{"comment_id":"10153469277832093","commenter_b":"You know right off the back it wasn't a girl bc the rims aren't scraped from the curb lol","commenter_a":"Jeffrey id say that his parking skills are top notch.","post_message":"File this under the 'smart criminals' tab. @webpagelink"},{"comment_id":"10153121038682212","commenter_b":"Ugh. You're a woman. Why are you being so dense?","commenter_a":"Isn't there a disclaimer that states not all birth control is always 100% effective??","post_message":"More than 100 women are suing a drug company for a birth control packaging error they say resulted in unplanned pregnancies; three of whom are from Oklahoma. #News9 #CBSNews"},{"comment_id":"10153442091264877","commenter_b":"That's right, Westley :) * waits for the obligatory hoteper insult about evil black feminists*","commenter_a":"This song is not about Black women. At best, the song attempts to denounce negative stereotypes of Black men. I appreciate the effort, but he has a lot more work to do.","post_message":"David Banner Shows Support for Black Women in New Song 'Marry Me.' It's the rapper like you've never heard him before. Listen to the audio below.   Grio fam, what do you think of Banner's tribute? Sound off!"}]
