[{"comment_id":"10154660299872501","commenter_b":"She can work anywhere in these United States.","commenter_a":"So she can be a lawyer not a judge cool.","post_message":"We reached out to Angela Stokes today to ask about her future legal plans. If she responds, we'll add her comments to the story."},{"comment_id":"10152841390816491","commenter_b":"Men wouldn't would they!!!","commenter_a":"What the hell? Who cares? I mean honestly. Who the hell cares?","post_message":"“Every ounce of milk I’m able to produce for my child is nothing short of a miracle and to watch that milk be thrown away without any regard for my baby was heartbreaking.”"},{"comment_id":"10152991363976336","commenter_b":"We know what we have to do!So what's the holdup !! Being our borders are wide open where just gonna wait till it starts in America! The longer this builds the harder it will be to totally defeat!","commenter_a":"Well, we could talk about why the government is giving Tonto National forest to a foreign mining company. Gold?","post_message":"Attorney General Eric Holder lashed out at Fox News, defending the Obama administration's reluctance to say \"Islamic extremism.\"  \"If Fox didn't talk about this, they’d have nothing else to talk about,\" Holder said."},{"comment_id":"1016134701742911","commenter_b":"@username OK as soon as I take mine out of a white woman's mouth","commenter_a":"I not very religious, but I stand with them. Obama will have you believe this country was found on Islam. I'm a proud American that enjoys the mention of God on my money, the pledge and so forth.","post_message":""},{"comment_id":"1238709539473364","commenter_b":"You are one disturbed individual...","commenter_a":"That is a symbol of bigotry and hatred towards gay people, and Chris Pratt should know better than to insult an entire sexuality with this stunt.","post_message":"Actor Chris Pratt spent Easter building a giant cross."},{"comment_id":"551602895008576","commenter_b":"Every time he speaks I vomit in my mouth","commenter_a":"Obama said on Nation wide TV that the Syrians are like people who came over on the Mayflower. Oh really. We know how he came over. On an elephant from Kenya. Too bad today isn't his last day.","post_message":"Here's why President Obama says accepting Syrian refugees is the ultimate American thing to do. Do you agree with his message?"},{"comment_id":"985729194809437","commenter_b":"Having the private server in itself is breaking the law Please get her out of the nomination cycle now","commenter_a":"Coverup","post_message":"Why did the State Department do this?"}]
