[{"comment_id":"10153317149514087","commenter_b":"'@username Ok I demand that and also anyone who rents to an illegal be punitively fined. Good enough? Oh yeah and build that wall and shovel the illegal bastards out of the country. Ok Tommy-boy?","commenter_a":"No the majority of Americans do not want to keep the illegal bastards, but they do want immigration reform- it's called a wall! To hell with Sanders vote Trump!","post_message":"“We cannot and must not sweep up millions of men, women and children, many of whom have been here for years, and throw them out of this country,” Bernie Sanders said Monday. “As president, passing a legislative solution to our broken immigration system will be a top priority. But, let me be clear—I will not wait around for Congress to act.”"},{"comment_id":"10153114585296130","commenter_b":"but feminism isn't about equality or justice.. it is about hatred for males and the destruction of the family..","commenter_a":"a male feminist.. wouldn't that be a bitch boy?","post_message":"Mark Ruffalo takes the (feminist) cake."},{"comment_id":"1765071860379740","commenter_b":"damn elizabeth coming out swinging","commenter_a":"That was EXACTLY what happened to another person that was supposed to be deposed and speak out against the Clintons years ago, and was found three days later by the FBI after the guy missed his deposition:-(","post_message":"Do you think the Clinton's were involved in his death?"},{"comment_id":"10155373545461162","commenter_b":"Black Women abuse their daughters and worship their sons.","commenter_a":"GM, Giving praise to God, that the baby is home safe","post_message":"HELP FIND THIS GIRL: A 12-year-old girl went missing from the Austin neighborhood on the West Side Wednesday afternoon. Claudia Jackson was last seen about 3:30 p.m. when she left her home in the 400 block of South Laramie after she was reprimanded, police said. Anyone with information is asked to call police at (312) 744-8200. 'SHARE' to bring Claudia home. @webpagelink"},{"comment_id":"10153873551727550","commenter_b":"Scores girls accept nothing less!","commenter_a":"As long as liquor stores, bartenders, strippers and cigar shops accept them who cares who is on the twenty dollar bill?","post_message":"ABC News has confirmed through a Treasury spokesman that Harriet Tubman will replace Andrew Jackson as the face of the $20 bill.  Full Story --> @webpagelink"},{"comment_id":"647855782048269","commenter_b":"'@username, no, she's a 'feminist' and 'peace activist' from Argentina. All my friends would describe themselves as feminists (male and female). None of them support Trump. Funny that.","commenter_a":"The insult 'a basket of deplorables', is the best exhibit of Hillary Clinton discriminating personality. There is a big number of registered democrats (like myself) for Donald J. Trump. So all democrats and independents (forget the republicans) supporting Trump, are that? That is how cheat this woman is. If elected, she will do the same to any ethnic group rejecting her, and will blow up one country after another, starting with Russia. Deplorable, is Hillary Clinton for expressing herself that way about the 75% of US citizens. (Ivan Mintz/Eric Trump)","post_message":"Republicans slammed Hillary Clinton for saying that half of Donald J. Trump’s supporters fit into a “basket of deplorables.'"},{"comment_id":"1243719872306934","commenter_b":"I would kill radical's in a minute for these women!","commenter_a":"These guys need to be exterminated!","post_message":"Of all the atrocities committed by ISIS, this just might be the most horrific of all. Kidnapped girls and women caged like animals and then set on fire for refusing to have sex with their Islamic captors"}]
