[{"comment_id":"10153457931491130","commenter_b":"Zane Gutierrez","commenter_a":"The politics of this is, scandalously ,that its a way for the establishment to write people off , they do not want to understand., There is so much hypocricy on this particularly in relation to alcohol : whats wrong with wanting to feel good , which is why anyone tries to get high off anything ?How we try to achieve this might be questionable but anything can be abused, does not make it bad in itself . people would not do self-destructive things if they felt self-worth. As some people here have said in their comments here,learning to love themselves was key to giving up the addiction .(not read the article btw)","post_message":"\"We put people who are not well in a situation that makes them feel worse and hate them for not recovering.\""},{"comment_id":"523635814493665","commenter_b":"Give the lady her job back, NOW!!!!!!","commenter_a":"Too bad- Boo Hoo Hoo","post_message":"A lunch lady was fired for serving pork to a Muslim student.  We are in America, give that poor lady her job back.  Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"1180631801992422","commenter_b":"THE wall is necessary","commenter_a":"Hell no!!! I don't want to see a big freakin wall between my state (Texas) and Mexico (with whom we've been friendly for a LONG time). Way to go, Trump...maybe you can start a war with Mexico 😠 Brilliant!","post_message":"Agree or disagree: It's time to build Trump's wall at the border."},{"comment_id":"10154689577603812","commenter_b":"He also has many lawsuits in the 80's and 90's for discrimination against blacks and people of color.","commenter_a":"TRUMP STOOD UP FOR BLACKS AND JEWS: About 20 years ago the rich elites ran Palm Beach and wouldn allow Jews and blacks to use the golf and country club facilities. When he bought Mar-a-lago, MR. TRUMP WENT TO COURT TO END THAT DISCRIMINATION, won in court and forever changed how minorities are treated in Palm Beach. That THE REAL Donald Trump. What has Hillary or ANY politician done? @webpagelink","post_message":"A potentially record-breaking gap between two groups marks one of the most striking elements of preferences in the 2016 presidential race: college-educated white women for Hillary Clinton vs. non-college white men for Donald J. Trump."},{"comment_id":"404934952964433","commenter_b":"We will be screwed with either of these two jackasses!","commenter_a":"I hope I never hear of either ever again","post_message":"Will Jeb Bush face Hillary Clinton in next year's race for president?"},{"comment_id":"10157820905645389","commenter_b":"She can't be trusted","commenter_a":"God bless our first responders and their loved ones during this time of unspeakable tragedy. These premeditated murders were likely politically motivated acts of terrorism. This is the same stuff we saw when the American left attempted to impose their will on peace loving citizens through bombings, political assassinations, physical attacks on returning service members, and violent protests back during the 1960s. For those of us who were children at the time, watching this stuff on the nightly news became indelibly burned into our psyche. It was a scary time for our country. Terrorist groups like the Weather Underground were one of a number of groups that committed acts of terror against some of our most honored institutions. Bill Ayers was a member of the Weather Underground. The same Bill Ayers who was recently seen in attendance at a violent anti Trump protest in Chicago.which we now know via WikiLeaks ...","post_message":"\"Hillary Clinton has changed her story about the use of a private server so many times, how can you believe any of this?\" – Sean Hannity"},{"comment_id":"415868471934780","commenter_b":"as soon as they put one foot on our soil we must be ready to drop bombs on them.","commenter_a":"I am ready for them arats.","post_message":"They're here!!"}]
