[{"comment_id":"10154317818991336","commenter_b":"F*** Donald Trump's daughter she a hoe and she look like sid from the ice age BOIIIIIIIIIIIIIIIIII","commenter_a":"The one Trump said he'd sleep with if she wasn't his daughter . What a sick disgusting man","post_message":"Ivanka Trump is a natural!"},{"comment_id":"1135192056570151","commenter_b":"Margaret, did you even watch the debate? I think you were the one snorting. Poor Hillary was having a meltdown. Her rigged plan with crooked moderators backfired.","commenter_a":"They are calling the debate the \"sleazy stalker\" debate! Trump not only was of absolutely no substance but he was creepy! Hillary WON! Go Hillary!","post_message":"A good night for Democrats."},{"comment_id":"1115555701831927","commenter_b":"Get and keep satan out of the White House!! SAVE AMERICA TRUMP 2016 ALL THE WAY!!!!!!!!!!!","commenter_a":"Done","post_message":"LAUGHABLE: Clinton Press Secretary Gives Conditions Under Which She Will Give A Press Conference Let's just plan on this not happening...EVER!"},{"comment_id":"10153922383952894","commenter_b":"Correction: When some women see a celebrity, all they see is their bank account. 🤔","commenter_a":"This is what they get for messing around with these white women, Chris Brown knows, when a some white women see a black male celebrity the first thing they see is a bank account and how can they set them up to get some money, when are you black male celebs gonna learn this, they wouldn't talk to you if you wasn't rich! DAMN!","post_message":"Chris Brown’s Accuser Baylee Curran Speaks, Says Chris Pulled a Gun on Her Over Jewelry [Video]"},{"comment_id":"10153772983356813","commenter_b":"Does that mean pardoning him for his rape accusation that he fled the country for as well?","commenter_a":"Snowden deserves a pardon. More than Obama deserves to be POTUS.","post_message":"Now's the time for Barack Obama to pardon Snowden."},{"comment_id":"10153518944503984","commenter_b":"It's the Holy Spirit's job to convict or convince the unbeliever that they need a Savior. We can share the GOOD news that Jesus died and took our punishment for our sins but it is not our job to make people feel bad. Their hearts will know because of the Holy Spirit. We can share the news that we, too, were once sinners but now we are saints. People who come to God out of fear or condemnation usually won't stick around long because those emotions go away. People need to know that Someone has taken their punishment for sin for them and that they are loved more than words can say. We ALL are searching for love. Hope this helps.","commenter_a":"The Bible says it is the KINDNESS of God that leads people to repentance which is what it sounds to me like Joel Osteen is giving. Read the Word!! Jesus was not a hater no matter what people did. Paul or Saul, killed Christians too.","post_message":"Mega-church TV pastor Joel Osteen just made a sickening announcement about Muslims... Spread this absolutely everywhere... the REAL Joel Osteen needs to be exposed. Do you agree that Osteen is a fraud?"},{"comment_id":"613516002130239","commenter_b":"Women wear ties","commenter_a":"Men are expected to wear ties, that's also sexist.","post_message":"Nicola Thorp says she was laughed at for asking if a male colleague was expected to wear heels too. 👠👠"}]
