[{"comment_id":"10153307243877217","commenter_b":"Holly Allcock sucks all cocks","commenter_a":"Trump is the most hated man in the world. What a disgrace!","post_message":"About 568,000 people have called for action against the presidential hopeful."},{"comment_id":"10153797602872060","commenter_b":"Bless you Chase!","commenter_a":"Thanks Chase!","post_message":"Chase Landry of The History Channel's \"Swamp People\" hitched his 20-foot aluminum flat-bottom boat and has rescued more people than he can count."},{"comment_id":"10153460035986545","commenter_b":"Dana Cobb was this you/ hahaha","commenter_a":"Terry Jetton @username","post_message":"A 911 call came in from a neighbor who heard “screaming from a house about someone having a gun,” according to Great Falls Police Department notes from the call, but it turns out the family inside was just seeing the latest horrors to befall Rick, Carl, and the gang."},{"comment_id":"1400798166615856","commenter_b":"Bye bye bitch","commenter_a":"KICK ROCKS, THAT'S RIGHT RUN RABBIT RUN","post_message":"BYE! You won't be missed."},{"comment_id":"10153847766591336","commenter_b":"That's Air Craft Carriers in english.","commenter_a":"So let's tell everybody what our Navy is doing!! Stupid media.","post_message":"On Monday, the aircraft carrier USS Harry S. Truman departed Naval Station Norfolk to head to the Middle East to combat ISIS. (Credit: U.S. Navy)"},{"comment_id":"10153864924433984","commenter_b":"she should be sent to self defense classes .","commenter_a":"Sadie, the bully, should be charged with felony assault. Punishment: lengthy juvenile detention and expulsion from school AFTER standing in front of her school during AM student drop-off and PM student pick-up wearing a sign stating, \"I am a BULLY!\" Her parents should also be made to stand beside her donning signs stating, \"We raised a BULLY!\" and have to pay restitution to the victim's family.","post_message":"A 5th grade bully decided she was going to throw her weight around to torture another student at her school. However, she was about to find out that's not how things work...  She got justice, and she got it fast."},{"comment_id":"1681790358712525","commenter_b":"what a liar.....she is so happy to have a plane....go away","commenter_a":"Clinton=","post_message":"Hillary Clinton traveled with the press for the very first time today in her new campaign plane. Critics are still pressuring Clinton to hold a press conference, which she has not done in 275 days. @webpagelink"}]
