[{"comment_id":"907989709297282","commenter_b":"This story will be huge until the next huge story comes along.","commenter_a":"Don't care .","post_message":"Could Bruce Jenner's announcement be a turning point for the transgender community?"},{"comment_id":"844972862206722","commenter_b":"Why don't women have enough sense to take care of there sex life. U play u pay. Use birth control.","commenter_a":"The guy in the photo wants to be aborted NOW!!!","post_message":"“There are thousands of unborn babies who need us to fight.\""},{"comment_id":"10153692267024087","commenter_b":"Li'l ol' ladies with landlines","commenter_a":"In New York,Hillary has a 4-point lead over Sanderss...There is no doubt that she will win N.Y thanks to black votes but by a small margin......She is so popular among African Americans despite that her husband sent 2.4 million black males in jails..It is difficult to explain or justify thier desire to vote in favor of their oppressor..She has 16 points ahead of Sanders in the city of Philadelphia (Pennsylvania) once again thanks to black voters.Hlllary clinton is unpopular among independents and blue collars .It will be impossible for her to win the general election in November without these voters.. ..Only Sanders can persuade independents,and blue collars to vote for democrats in the next election...Sanders is also the only leading candidate with positive favorability at the national level. .","post_message":"\"This is the best territory for him on the calendar,\" Hillary Clinton's campaign chairman John Podesta said of Bernie Sanders's recent wins. \"Most of those were Western caucuses. But when you look at what happened overall in this election, she's gotten 2.4 million more votes than Bernie Sanders.\""},{"comment_id":"1275473112509215","commenter_b":"#GrabThemByThePussy #MakingSexualAssaultGreatAgain","commenter_a":"Deplorables say don't judge Trump for something he did ten years ago yet they keep bringing up something Bill Clinton did 20 years ago. Deplorables say Hillary is an enabler for standing by her cheating husband.... But Melania is a good wife for standing by her twice divorced husband who cheated on her while she was pregnant? Hypocrisy is the running mate of Donald Trump. And sexual assault. Don't forget that. #GrabThemByThePu$$y #MakeSexualAssaultGreatAgain","post_message":"\"Everyone knows how bright she is and how resilient she is, but...they're going to see how much she cares.\" —Joe Biden"},{"comment_id":"10153396685831320","commenter_b":"Time to keep the animals out of Mc Donalds!!","commenter_a":"Also known as Black Brooklyn Beatdown!","post_message":"It happened again! A mob of teens take part in a nasty brawl inside a Brooklyn McDonald's. Watch the video here: @webpagelink"},{"comment_id":"1794738107245611","commenter_b":"Mexico has no standing in America. The reason Mexico is upset is because the majority of Mexico!s economy depends on money sent from Illegals in America and illegal drug traffic. The rich in Mexico will lose their illegal source of income and Mexican economy may crash.","commenter_a":"Screw you.","post_message":"Yea, good luck with number 11..."},{"comment_id":"10155165115483010","commenter_b":"Preach it lady!","commenter_a":"It's the parking lots and the teenagers. I don't care to fight with people vying for a parking spot or those backing out without looking and those who think they can drive at freeway speed in a parking lot. The kids! I know they love to hang out where they can see and be seen, but I don't like their fresh mouths and their \"It's all about me\" attitudes. Their parents didn't teach them how to be respectful.","post_message":"Department stores are struggling."}]
