[{"comment_id":"10153576717714024","commenter_b":"This is what's wrong with our country. Not just the BRAINLESS, CLUELESS, MORONS like her in congress, but THE SAME ONE'S THAT PUT HER THERE!","commenter_a":"They do indeed walk among us and get elected","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink #BB4SP"},{"comment_id":"10153912025664030","commenter_b":"Kiss my ass.","commenter_a":"@username lol sleep tight","post_message":"Not Safe with Nikki Glaser asks the questions you didn't know you wanted answered.  All-new episode, tonight at 10:30/9:30c."},{"comment_id":"10153649555779705","commenter_b":"I'd be pissed off too.","commenter_a":"She's 25 and her last movie made her $20MILLION. You know what, I'd be pretty happy with that, I'd consider myself a glass-is-half-full kind of person if I was making that much at that age. This is not the way to campaign for equality.","post_message":"\"I'm over trying to find the ‘adorable’ way to state my opinion and still be likable! F*ck that.\""},{"comment_id":"10153394655753908","commenter_b":"is anyone here surprised by this information?","commenter_a":"Get a grip","post_message":"For those who haven't seen this yet. \"Ever single terrorist attack in the US was a false flag attack.\"  There is a tremendous amount of research to back up this statement."},{"comment_id":"10153066092873445","commenter_b":"I bet the strippers were forced to strip and what not","commenter_a":"Okay... Retracting previous statement, these fucks need to be jailed... Illegal immigrants being forced into prostitution... Nope! Pigs","post_message":"More DEA Scandal!  DEA Agents Arrested for Lying About Owning a Strip Club"},{"comment_id":"1333030216717005","commenter_b":"She has no talent and is trash","commenter_a":"Levy a fine, and move on. That show was one of the best in a long time. Grande was very good.","post_message":"Singer and actress Ariana Grande surprised the \"Saturday Night Live\" audience and crew with an unexpected profanity during her monologue."},{"comment_id":"999092436786383","commenter_b":"Somebody needs to go to jail, start with Lois Lerner.","commenter_a":"About fucking time","post_message":"Here at RedState, we’ve already spilled a lot of digital ink covering the IRS scandal."}]
