[{"comment_id":"10153542094851509","commenter_b":"@username wow your German? That sucks Germans can't reproduce, their birthrate is below 0% by 2060 there will be more muslims in Germany than Germans. LMBAO enjoy your day.","commenter_a":"Oh yet another white on black crime receiving national.media coverage. Way to keep the racial divide strong. But i am glad to see some justice is being served.","post_message":"Demonstrators have flocked to North Charleston City Hall to protest the shooting death of Walter Scott. The following report contains graphic content. Viewer discretion is advised: @webpagelink"},{"comment_id":"416029885255267","commenter_b":"@username why your government killing cows on throw them on street to make violence ?","commenter_a":"If Islam follows their one and only Prophet Muhammad who was a rapist, murderer, and pedophile be peaceful? Remember his youngest wife being 6 and forced to have sex at 9. Please tell to me how this is possible? No jokes or hate being meant just really need answers.","post_message":"For the past 5 months - media poll experts & establishment politicians have predicted that my campaign will fail. As the polls indicate - we are growing, and will continue to do so - thanks to your support!  What else do you think they are capable of under estimating? Terrorism? Threats of cyber-attacks? I DO NOT WANT TO FIND OUT! When I am elected #POTUS - I will see to it that we DO NOT find out!"},{"comment_id":"10155455512331509","commenter_b":"Victim shaming is another way trump supporters are deplorable","commenter_a":"Ok time for JIMMY to come forward! Killery Klinton once fatshamed me at an OutBack SteakHouse in St Louis MIssouri! When eating i accidently flung my porkchop underneath her table where her dog was ( guess SHE is allowed to bring dogs). When i was wrestling the dog to get my porkchop back she called me a FAT idiot! #JimmyComesForward #FatShamerKillery","post_message":"Another woman is accusing Donald J. Trump of groping her, saying he allegedly put his fingers up her skirt"},{"comment_id":"10153039031790329","commenter_b":"Kriti Kothari","commenter_a":"One for you Bella La Verde","post_message":"Find out which one of these redheads will light your fire."},{"comment_id":"10153987272260667","commenter_b":"Readup Trump's plans for America @webpagelink","commenter_a":"I'm over this, I am over ALL of this nonsense!!! This entire Campaign is an embarrassment to the world!! #AbrahamLincoln2016","post_message":"Here’s how it all started."},{"comment_id":"10153209058106509","commenter_b":"Oooh looks like you are a dumb chick trapped inside human body. Go get an operation...free yourself ha!","commenter_a":"All the people who think he was a girl trapped in a boy's body are sick and have missed basic biology lessons. For that punk - rot in hell.","post_message":"Crossing out \"Josh,\" the 17-year-old signed \"Leelah\" in a suicide note.  @webpagelink"},{"comment_id":"10153204502459087","commenter_b":"Mar G Her go back to mexico. this country is for LEGAL immigrants who want to be Americans.","commenter_a":"Trump is for all Americans, whether you're democrat or republican. Go Trump 2016!","post_message":"GOP front-runner Donald J. Trump continues to pull away from the rest of the Republican pack, drawing 33 percent support in the latest Washington Post/ABC News poll."}]
