[{"comment_id":"10153971816072869","commenter_b":"Ugly nasty ol bill has givin her what she never wanted ol monica. Diseased up hoes.","commenter_a":"Why isn't the Mainstream Media talking about this Story?? News - 1) ABC News executive producer Ian Cameron is married to Susan Rice, Obama's National Security Adviser. 2) CBS President David Rhodes is the brother of Ben Rhodes, Obama Deputy National Security Adviser for Strategic Communications. 3) ABC News correspondent Claire Shipman is married to former Obama Whitehouse Press Secretary Jay Carney. 4) ABC News and Univision reporter Matthew Jaffe is married to Katie Hogan, Obama Deputy Press Secretary. 5) ABC President Ben Sherwood is the brother of Obama Special Adviser Elizabeth Sherwood. 6) CNN President Virginia Moseley is married to former Hillary Clinton Deputy Secretary Tom Nides.Etc... etc... Get the picture? Please copy and share *Muslim influence in America*: John Kerry's son in-law is an Iranian Muslim and, the best man at their daughter's wedding was the son of the man Kerry negotiated the Iranian Nuke Deal with. John ...","post_message":"NO deed goes unpunished..."},{"comment_id":"899517350083687","commenter_b":"GOD BLESS AMERICA ! We really need His Help !!","commenter_a":"Screw the Muslims and the Camels they rode in on!!!","post_message":"Pathetic! (MUST READ)"},{"comment_id":"1024965370917718","commenter_b":"@username Agreed!","commenter_a":"Being vegetarian doesn't change much in the lives of cattle however. Nor hens. It's better than being an omnivore, yes, but still not cruelty free. Although nothing truly is. From medical treatments, medicine, to our pets sustenance, to palm oil, to beauty and household products, etc. As for diet, we are naturally omnivorous. We would not have survived very well as a species without meat as sustenance and the remainder for clothing/tools, along with plants, fruits, nuts, etc. Especially in the North.","post_message":""},{"comment_id":"10152908271969753","commenter_b":"You are absolutely right! She's disgusting","commenter_a":"if a man did this he would get prison time she needs this also..she is a guilty..","post_message":"The married mother-of-two admitted to having sex with the student on seven separate occasions both in her vehicle and at her home."},{"comment_id":"10153355392014087","commenter_b":"Frank, public services are for the good of the whole. Socialism is when you have a garden with beautiful tomatoes and I, being too lazy to grow a garden, get my share of your tomatoes. Not because I deserve them, because the government said you have to give them. How ling do you think you will continue to grow that garden to feed my lazy butt? Socialism fails because the workers quit working also because there is no reward to their labor. The workers will become the lazy also and there will be no tomatoes. Figured I had better break it down to kindergarten level for you.","commenter_a":"If you support sanders, go live in Cuba. Democratic socialism there already.","post_message":"Bernie Sanders is increasing the size of his campaign staff and boosting state budgets, according to a new report."},{"comment_id":"10154753086323967","commenter_b":"He is building a wall","commenter_a":"Come on, guys. Our new president told us this was all a hoax perpetrated by the Chinese. We're clearly in good hands.","post_message":"Unstoppable."},{"comment_id":"10152578653426636","commenter_b":"Crazy moms be crazin","commenter_a":"Jeremy Blackwater Lopez","post_message":"A mother is now facing charges after she allegedly forced her children to drink poisoned apple juice.  According to authorities, she came up with the plan because she was mad at their father."}]
