[{"comment_id":"1803336319885605","commenter_b":"@username \"She can watch the oath from a cell like she deserves\" Proof or you're a dirty liar.","commenter_a":"I borrowed these words from Daniel Greenfield who wrote them a few months ago in Front Page Magazine: Clinton has spent a third of her adult life trying to become president. are hoping that Hillary will go to jail. But the anger, frustration and bitterness that will gnaw on her after wasting decades and a small fortune on two failed efforts to win the White House in which she had every advantage only to lose before even leaving the starting gate will be worse than any prison. January 2017, Hillary Clinton will be sitting in front of a television set watching someone else take the oath of office. Nothing the penal system has to offer would be a harsher punishment than that moment.","post_message":"Six of the biggest takeaways from the FBI's investigation."},{"comment_id":"10153548972367093","commenter_b":"LOL. Go back to California.","commenter_a":"This Texan will be voting ALL BLUE in November! Bigotry and hatred has to end! #voteTxBlue - you #GOP small minded idiots don't remember that Texas WAS a blue state for a long time! LBJ was a Democrat from Texas, and TX was a Blue state until 1994!","post_message":"With Trump as the Republican nominee, Clinton thinks a large turnout of minority voters could put Texas in play... @webpagelink"},{"comment_id":"10153174163477452","commenter_b":"he better not get fired. @username","commenter_a":"GET SOME!!!!","post_message":"Big Mac attack!   A McDonald's worker wasn't \"Lovin' it\" when an irate and apparently drunken customer launched into a vicious attack at the drive-thru window. But the worker wasn't going down without a fight. abc7.la/1KYEgIq  It's just the latest case of a service worker attacked on the job."},{"comment_id":"1178124042307867","commenter_b":"No brains--no headaches. Maybe he should leave with Whoopie. They would be happy in Iran, take Rosie with you.","commenter_a":"Some of these people have lost their f##ing minds!!","post_message":""},{"comment_id":"966904363440661","commenter_b":"Says the liberal tard cat lady","commenter_a":"What would you expect from a woman with 1000's of nude/lesbian porn pics on the internet to wear? She's a hoe and trump a con artist. The Whitehouse is going from class to trash.","post_message":"When people saw what Melania Trump wore to mass, they were simply outraged. Do you think what she wore was appropriate?"},{"comment_id":"959009797494471","commenter_b":"Any politician that don't one our soldiers to be armed there traitor to our country","commenter_a":"I can see maybe arming an NCO or someone at a recruiting station as a deterrent against the crazies out there.","post_message":"NO CHANGE IN POLICY: Army chief urges caution on calls to arm more US soldiers in wake of fatal shooting (VIDEO)  @webpagelink"},{"comment_id":"1081030328612686","commenter_b":"Go bang your mother with a mace","commenter_a":"All you people saying taxation is theft are such complete morons. Taxation is a membership fee to live in the USA where we have benefits that greatly outweigh the cost. Why don't you renounce your citizenship and gtfo out of the USA and move to Antarctica if you don't want to be taxed. Bunch of unpatriotic pieces of human garbage in here.","post_message":"Wouldn’t it be great if you could refuse to pay your taxes until you decided your tax rate was “fair”?"}]
