[{"comment_id":"10155050203774369","commenter_b":"It wouldn't have meant a thing if Hillary didn't lie to the congressional hearing. She's the one that committed perjury and gave Russia the opportunity. .","commenter_a":"All I can say if they didn't have anything to hide, why so angry?","post_message":"The 2016 U.S. election was NOT the first to be the object of \"malicious cyber activity,\" Barack Obama said."},{"comment_id":"10153157843033984","commenter_b":"I am thrilled! I pray someone stops the madness. We must enforce our immigration laws abs seal our borders.","commenter_a":"A judge with Balls","post_message":"Obama received a major smackdown last week! Amnesty plans halted!! Are you as happy about this ruling as we are?"},{"comment_id":"1280033575423027","commenter_b":"She didn't say anything that hasn't been said before.","commenter_a":"The trouble with Trump is he doesn't his rallies long enough to study for the job he is trying to get elected to which is so important. Hillary has the experience plus she takes off for a few days to study what is going on in this country and around the world. Hillary gets an A+ and is definitely ready to take over the Oval Office on day one. Go Hillary!","post_message":"Another right-wing conspiracy bites the dust."},{"comment_id":"10154645739237178","commenter_b":"Rather have snow than ice in Wake Forest !","commenter_a":"Sketchy in so pines","post_message":"Winter weather update with WRAL Elizabeth Gardner. (Stick around for the end to watch a little gloating from Brian Shrader's Anti-Snow League)"},{"comment_id":"10153731561481336","commenter_b":"You're an idiot Elizabeth!","commenter_a":"The shooter was a conservative republican. That seems to be a common theme in mass shootings.","post_message":"One law enforcement official described the shooter as an \"angry young man who was very filled with hate.\""},{"comment_id":"587546098014187","commenter_b":"It's ok, SHE has 24/7 armed guards, surrounding her...we just need to suck it up","commenter_a":"diane can have my gun, I will put it right where her head is at :))","post_message":"Diane Feinstein admits their are probably sleeper cells in America. So why does she want to take away your guns?"},{"comment_id":"10152749769427894","commenter_b":"Fuck u Im beautiful somebody love it and u must love I don't have time to entertain your stupid ass go suck a sick dick bye bitch. Go suck Bruce Jenner dick look like u in love with him","commenter_a":"Bruce Jenner is a joke wtf look how he look","post_message":"Too Far? Jamie Foxx Jokes About Bruce Jenner During the iHeartRadio Music Awards [Video]"}]
