[{"comment_id":"533893623467884","commenter_b":"Lol. Fuck off bitch.","commenter_a":"He has the truth. God Blessbhim.","post_message":"Obama is furious after Ted Nuget takes an epic stand against him.  He speaks the truth. Nuget needs your support.  Can we get 10,000 'LIKES' for Ted Nugent's epic stand against Obama?"},{"comment_id":"10153929324394586","commenter_b":"WAIT WHY DID HE KILL IT ANYWAY WAS IT HIS TO BEGIN WITH IS HE IN JAIL HE NEEDS TO BE FOR ANIMAL ABUSE HAS The Dodo HEARD ABOUT THIS?!? I CANT BELIEVE SUCH AN INNOCENT CREATURE WOULD BE HURT LIKE THIS HUMANS ARE SUCH IDIOTS HE/SHE NEEDS TO BE LOCKED UP IM JUST SO MAD","commenter_a":"Where is the proof that this specific coyote was killed for the fur? I've witnessed coyotes stalking my dogs while they're in the back yard, and I can't have barn cats because the coyotes kill them. The coyotes get closer and closer to my house every chance they get. I'm all for nature taking its course, but you can guarantee I'm going to protect my pets' lives over the life of a coyote. How do you know this coyote didn't just attack a farmers chickens or livestock? How are you so sure this guy executed this specific coyote for the sake of its fur? I don't think you are. Posting graphic videos for awareness is one thing, but posting a graphic video with the wrong facts is nothing but propaganda.","post_message":"WARNING: EXTREMELY HARD TO WATCH.   Coyotes bark just like dogs when they're scared. Even the coyotes killed for fur trim.   CC: Canada Goose   [via Robert Banks]"},{"comment_id":"827935373908552","commenter_b":"A straight shooter, she would do this country good","commenter_a":"Barack Obama is NOT furious about anything Sarah Palin does or says; he is the President of the United States, and she is a moron.","post_message":"Sarah Palin lays into Obama for this reckless call!  Do you agree with her?"},{"comment_id":"1006387419398598","commenter_b":"Go away upchuckie!","commenter_a":"Where do these NUTS come from? Is there some unknown idiot tree orchard somewhere in the U.S.?","post_message":"\"Schumer’s proposed anti-gun plan takes government “overreaching” to a whole new level.\"  Blaze contributor Susan Calloway Knowles:"},{"comment_id":"10153204698059712","commenter_b":"It looks like the New Anti Gun Laws are working for the Criminals. It's taking Guns out of the hands of the Law Abiding Citizen and putting them in the hands if the Criminals because Criminals Don't Follow the Law. Good Job Liberals for putting Maryland back at #1 for Murders.","commenter_a":"Violence in Baltimore, gee would neva had thunk that!!","post_message":"Baltimore has had 54 homicides in 2015 — 8 more than at this time last year. Nonfatal shootings are also up 40%."},{"comment_id":"765775893538794","commenter_b":"What about women that do?","commenter_a":"Wonder what this means for me","post_message":"Research Says Men Who Take Selfies Have More Psychopathic Tendencies"},{"comment_id":"2193117860914394","commenter_b":"As if I would let her lick my face when she cleans her asshole 😂😂😂 come on now","commenter_a":"@username Munro","post_message":"It's not just gross, it's dangerous."}]
