[{"comment_id":"786106801492916","commenter_b":"How in the world someone in the right mind, not see how how corrupt this woman is! She meeds to go back to school , she needs to learn what the meaning of 'C' is. Not recalling 39 very important information, i think this Rat should be in jail. Go Trump, keep doing your thing, I'm sure you can destroy her nerves, and soon she will have a nervous breakdown. This is America, American decide our President, not immigration or the Latinos. I'm a Cuban American and very proud, of this country! Trump for America","commenter_a":"Its already been answered. Its because she is CROOKED!","post_message":"The polls are close so Crooked Hillary is getting out of bed and will campaign tomorrow. Why did she hammer 13 devices and acid-wash e-mails?"},{"comment_id":"10152549413699071","commenter_b":"So true, reason why women throw themselves on celebrities","commenter_a":"Healthy man not attracted womens .attrating gods grace","post_message":"The most valued trait in a potential mate isn't beauty or wealth."},{"comment_id":"1028894700543062","commenter_b":"Is that a slit in her dress up to her you know what? Inappropriate for the First Lady. Not running for first slut!","commenter_a":"Moochie, it's gonna take more than $12000.00 to make you the Lady of Camelot.","post_message":"Woman of the People"},{"comment_id":"10154710318354062","commenter_b":"GTFOH... U don't own this planet girl!! GOD knows no borders right Angie? Get off ur high horse! Stop looking down n help another up!!","commenter_a":"what part of ILLEGAL do people NOT get??? GO HOME!","post_message":"Dozens of protesters have gathered on the University of Houston campus in advance of tonight's debate. Live team coverage coming up at 6."},{"comment_id":"10153856538795575","commenter_b":"Great post😀","commenter_a":"People say that Mr Trump doesn't have a platform, that he just wants to make America great again. I have something to say about that, Donald Trump is not telling you his plan he's giving you an outline. Why? Every time he brought something to the table, the other candidates take it and run. Such as immigration, the wall and other issues. I can guarantee you that he won't give you his full plans in detail until he standing at the podium next to one of the Democrats. That is when he will reveal everything. He doesn't need to do that now. Donald Trump is a visionary. He doesn't go into business without a strategy, and a form of negotiation already set. This man is prepared in business and it will be prepared when the time is right in a debate. He is a brilliant man, and he will not ...","post_message":"CHAOS in Alabama --  20,000 EXPECTED AT TRUMP RALLY!"},{"comment_id":"10154522868449087","commenter_b":"Fuck this old communist bastard!!!!","commenter_a":"Your anti Muslim propaganda does that! Trump is anti Radical Islamic Jihadists! Got a problem?","post_message":"Bernie Sanders: 'Trump's anti-Muslim order plays into the hands of fanatics wishing to harm America. Love and compassion trump hatred and intolerance.'"},{"comment_id":"10153706067582490","commenter_b":"tell them to come get they're money!!!!","commenter_a":"please remember they hold 46% of our debt right now, sure dont to piss off the banker","post_message":"SENDING A MESSAGE: The Navy plans to send a warship to directly challenge China's recent aggression."}]
