[{"comment_id":"10155955897895354","commenter_b":"The nasty b*tch just wanted attention and guess what? Now everybody is giving it to her.","commenter_a":"For the life of me I will never understand killing these magnificent animals. I just don't understand how it can be wonderful, thrilling, exciting or in any way fulfilling to kill an exotic animal. And then chop it's head off or whatever you do with that giraffe and have it mounted. Makes not one bit of sense let alone any kind of satisfaction.... Just don't get it.STOP IT NOW!!!!","post_message":"This hunter is single-handedly breaking the Internet today.   Check out the photos of her other controversial kills..."},{"comment_id":"10153428772146509","commenter_b":"Cause she was worthless and weak that's why!!","commenter_a":"Why would you choose the classroom to do that?","post_message":"There was no indication of foul play, and every indication that she took her own life, officials said. @webpagelink"},{"comment_id":"10154767405540575","commenter_b":"So surprised (NOT)!","commenter_a":"That has been standard operating procedure for n0bama and his corrupt administration since day one........","post_message":"BREAKING NEW REPORT FROM FEDERAL AUDIT...  Stupid Facebook pulled in the old title which has a typo!"},{"comment_id":"10153123153839094","commenter_b":"Behind what.....the Jettsons?","commenter_a":"We are only behind because the city deferred maintenance and closed one of the terminals to make flyers more crowded and make the airport look awful.","post_message":"Kansas City should focus on planning for a single new terminal at Kansas City International Airport, airlines and the city’s aviation department said today."},{"comment_id":"10153845645645871","commenter_b":"I would say that since both ladies are jewish and liberal, they don't really care about the women who are raped, stoned, disfigured and killed because they are Muslim. I believe ini just telling it like it is.","commenter_a":"Have any of you followed Naomi Wolf's facebook page? I have for the past couple of years. She's an anti-Israel bigot, and she ignores women's issues whenever they involved Islam. I called her out on it many times. Here's an example.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153016776944117","commenter_b":"Cause she was terrible. @webpagelink","commenter_a":"Because they are willing to sell out.","post_message":"From RUSH drummer Neal Peart to Rep. Paul Ryan to Uber CEO Travis Kalanick. Why do famous people deny that they admire Ayn Rand?"},{"comment_id":"10156327050085725","commenter_b":"A HUUUUUGE WALL. the next 11 months are gonna be a nightmare. Get in there and fix it asap donald trump. Please","commenter_a":"Caught and turned themselves in are two different things.","post_message":"Eight Syrians were just caught on the southern border trying to get into the U.S. ISIS maybe? I told you so. WE NEED A BIG & BEAUTIFUL WALL!"}]
