[{"comment_id":"10152972266751051","commenter_b":"No, phuck you, Eric! Get out of my country if you can't respect it. And that stupid bitch is just another moron who probably thinks we have a black president, too. Can't have a white momma and be black........DUH!","commenter_a":"Go to a country who has a flag you like, BITCH.","post_message":"This American flag social media challenge has become increasingly popular over the past week."},{"comment_id":"10152911974179071","commenter_b":"I dont think you really listened to his speech. He said they meaning mexicans!! illegals or not he is still refering to the RACE!! Are RAPIST!!! That alone is disgusting to label mexicans that are trying to find a new country.","commenter_a":"He didn't express hatred for Mexicans. He expressed hatred for the illegal immigrant problem Mexico presents the U.S. with. Those are two very, very different subjects.","post_message":"Behold, the Donald J. Trump piñata."},{"comment_id":"10153894992921336","commenter_b":"@webpagelink Wake up my friends. Biological Jihad being preached all over Islam is the most dangerous problem to ever face the world because the world is still ravaged by fake political correctness, and many countries are not united as they once were. Immigration without assimilation is invasion. Be a Guardian for good. #CognitiveAwareness #KnowledgeIsPower #Guardians #ProtectYourCountries #AlwaysBeReady #UniteAgainstIslam","commenter_a":"I heard that Obama does come from a family that is muslim. maybe his father but either way he does believe in their ways and as for Hilary Clinton she is a liar a thief and has no business running for president. we do not need anymore murders caused because she has better things to do like warning her family and not America about anything.","post_message":"“President Obama and Secretary Clinton just won’t say it—radical Islam. And they’re making a big mistake…They somehow think that is a declaration of war on religion. And I don’t know where they get that idea. It’s not. It is specifically identifying the enemy.” – Greta Van Susteren  MORE: @webpagelink"},{"comment_id":"634938303363415","commenter_b":"god i hope his on his way to you for judgment","commenter_a":"Hey Obama time for you to step down!!!","post_message":"Obama's health is at risk, he may not finish his presidency.  He should resign. If his health is becoming an issue, it's a no brainer.  Would you be happy to see Obama resign from the presidency?"},{"comment_id":"697700797087165","commenter_b":"No refugees, there only intent to come here is to bring harm to us and destroy our country.","commenter_a":"Yes..... Take care of our own homeless people","post_message":"The refugee program has resulted in the death of two American soldiers. This is sickening. Should the US deny access to all refugees?"},{"comment_id":"10152843996092293","commenter_b":"White mid-western girls fall for it...talk to your daughters about that life...","commenter_a":"are they really women or","post_message":"The caption: \"chillin in the khilafah, lovin life\""},{"comment_id":"897791007078142","commenter_b":"Shes ugly","commenter_a":"Gosh is she going to lose in PA again?","post_message":"Hillary makes disturbing announcement about development in Pennsylvania. We could be looking at history right now. Will you refuse to let Hillary be your president?"}]
