[{"comment_id":"638058836332906","commenter_b":"Keep praying! @username is a Warrior for Christ!","commenter_a":"I was born and raised in Pennsylvania, and I'm hoping and praying that come election day the good people of PA will vote for a Presidential candidate who is a life long Conservative, versus an Entertainer!","post_message":"For seven years we've seen an administration that abandons our friends and allies.  That ends when I am president!"},{"comment_id":"10154689857838487","commenter_b":"What a complete idiot","commenter_a":"He gave his brain away, didn't he. That's got to be the reason. He was selfless and gave his brain away.","post_message":"Carson accused Kay of making him  bad guy, and asked Joe Scarborough, the show's host, to  her microphone off so I can talk."},{"comment_id":"936129599822500","commenter_b":"Why did they come here? Get out, do back from whence you came.","commenter_a":"Get the hell out of our Country!!","post_message":"RT If these people want Sharia Law they should go back to their own country."},{"comment_id":"1419706908060869","commenter_b":"What rights do women not have again?","commenter_a":"Suck it up... lol he won and he IS your president. I love liberal whining people it makes it all that more enjoyable to get on here and see them crying.","post_message":"\"You're orange, you're gross, you lost the popular vote,\" a crowd at the Women's March in Washington chanted today.  Millions marched in D.C. and around the world for women's rights and against President Donald J. Trump's inauguration: @webpagelink"},{"comment_id":"1030585200364962","commenter_b":"DON'T TRUST HER ... Obama and Hillary want to rescue 200,000 Muslims. This is the same two that couldn't rescue four Americans in Benghazi. ... #VoteTrump2016","commenter_a":"Hillary's background If you happen to see the Bill Clinton 5-minute TV ad for Hillary in which he introduces the commercial by saying he wants to share some things we may not know about Hillary's background, beware. A person who was there for most of their presidency and knows them better than just about anyone has listed a few corrections. Bill says: \"In law school, Hillary worked on legal services for the poor.\" The facts are: Hillary's main extra-curricular activity in law school was helping the Black Panthers, on trial in Connecticut for torturing and killing a federal agent. She went to court every day as part of a law student monitoring committee trying to spot civil rights violations and develop grounds for appeal. Bill says: \"Hillary spent a year after graduation working on a children's rights project for poor kids.\" The facts are: Hillary interned with Bob Truehaft, the ...","post_message":"Hoy, el Departamento del Trabajo acaba de anunciar nuevas reglas laborales que garantizarán el pago de horas extras a trabajadores que ganan hasta $913 dólares a la semana o $47,476 al año. Esto es más del doble que el límite pasado de $455 a la semana.   Hillary: \"Aplaudo al presidente Obama y al Secretario del Trabajo, Pérez, por estas reglas sobre horas extras laborales, las cuales levantarán a trabajadores a nivel nacional y ayudará a que los salarios aumenten nuevamente para las familias trabajadoras. Durante el primer año de la implementación de estas reglas, millones de trabajadores adicionales serán elegibles para el pago de horas extras, finalmente cobrando totalmente por las horas que le dedican a sus trabajos... Nadie que trabaje 40 horas a la semana debería tener que mantener una familia en la pobreza”."},{"comment_id":"10153200495384411","commenter_b":"leave the fukers there ,revoke their passports","commenter_a":"They weren't British....","post_message":""},{"comment_id":"10153612165593984","commenter_b":"My, my, my....Welcome Home....but, don't ever come back!!!!","commenter_a":"Way to go kenya","post_message":"Wow. These 10 million Kenyans just sent Obama a VERY bold statement about his visit... they aren't pulling any punches.  Obama needs to pay attention to this...  Good for Kenya..."}]
