[{"comment_id":"10153678409374641","commenter_b":"I say make email really sick for weeks with water damage so much so that they want to die lol....but can't get off the looploo","commenter_a":"You have to kill there soldier first then go after the leaders.","post_message":"\"I think it's futile to respond to terrorist violence with more violence in a way that creates more terrorists,\" says Sally Kohn."},{"comment_id":"665987530270126","commenter_b":"Don't forget though we will have to build an impervious penetrating wall around California to keep them there!","commenter_a":"So how about where ever the idiot pelosi lives at, lets make the area around her house and city a sanctuary city and move the unvetted refuges there. Put your monry where your mouth is wacko!","post_message":"Nancy Pelosi Has To Be The Stupidest Person To Ever Walk The Planet!"},{"comment_id":"10155222561152316","commenter_b":"Can you prove she rigged the election?","commenter_a":"Killary is our threat not TRUMP. Why wasn't she arrested for rigging the election? Yall are not covering her criminal acts, are you ?","post_message":"Republican presidential nominee Donald Trump is asserting that countries like France that he says are compromised by terrorism may be subjected to the \"extreme vetting\" he proposes as a deterrent to attacks in the U.S."},{"comment_id":"1190973280940010","commenter_b":"All these lackluster punks would do anything for the limelight even give Killary 8 years in White House. Just punks selling junk.","commenter_a":"I used to always watch and listen to GB. No more, lost a lot respect for him.","post_message":"GB getting shoot notes from his team."},{"comment_id":"10152575387122217","commenter_b":"It should be illegal to sell cigarettes to pregnant women!!","commenter_a":"I think women who smoke during pregnancy are just selfish vile people. ..thinking of themselves and not there babys health....it should be illegal to smoke while pregnant !","post_message":"Should pregnant women be paid to give up smoking?"},{"comment_id":"10152629894111519","commenter_b":"It is my business when you try to regulate contraception based on a book of myths, try to keep kids from learning factual science based off a book of myths, and try to keep people from marrying there loved ones based on a book of myths. Keep religion but don't ask for tax's breaks, don't try to teach kids pseudo science and don't knock on my door asking me to believe. A free country is where people can get elected even if they don't believe, a free country is where any two consenting adults can marry, and women can choose what they do with their bodies. This is not a perfect union, yet but well keep pushing forward while you try to stop rational thinking.","commenter_a":"Turning people against their own beliefs in an attempt to get them to believe yours. This is what you accuse religions of doing. Hypocrite much?","post_message":"Bill Maher makes a compelling case for secularism..."},{"comment_id":"699361250167548","commenter_b":"Terrorist and traitor!!! And an illegal!!","commenter_a":"The Wall of China has worked tremendously for China. Id expect the same results here","post_message":"“Good luck with that…We’ve got serious problems here.”  President Barack Obama addressed Donald J. Trump's plans to build a wall and get Mexico to pay for it."}]
