[{"comment_id":"1488225507869622","commenter_b":"LOSER !!!","commenter_a":"Good should have done that long time ago","post_message":"HAHA! He's FIRED!"},{"comment_id":"559259350942537","commenter_b":"Lord,bless this precious child, hold this family in your loving arms. In the name of Jesus. Amen","commenter_a":"Sad, she is a pretty young lady! Prayers for Hannah and her family!","post_message":"\"We have all been waiting and praying for a miracle,\" a post on the Facebook page 'Prayers for Hannah Katherine' said. \"We are now waiting for her to join the angels in heaven.\""},{"comment_id":"638229933016362","commenter_b":"Yeah. There just has to be some reason why hitliery didn't win other than the fact that she is a worthless lier.","commenter_a":"no they did not more lies","post_message":"The CIA says Russia intervened in the election in order to help Trump win. How do you feel about this?"},{"comment_id":"1187509331305594","commenter_b":"She's losing Florida.","commenter_a":"She's losing in national polls !!! Americans don't trust her!!!","post_message":"Let’s think better of each other, and hold together in the face of our challenges—not turn on each other or tear each other down."},{"comment_id":"10153840747221336","commenter_b":"Let every congressman in Washington put up 10 \"refugees\" each in their own homes. The White House could take care of at least 100 of them. Just keep them out of our towns and cities.","commenter_a":"\"Stupid is as stupid does.\" - Forrest Gump","post_message":"On Monday, Governor Greg Abbott announced that he sent a letter to President Barack Obama saying that Texas will not take any Syrian refugees in light of the Paris attacks."},{"comment_id":"1122771727815880","commenter_b":"I wouldn't want that pussy fighting next to me.","commenter_a":"Draft Dodging Coward","post_message":"Donald Trump is just another Republican chicken-hawk. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1004203859620086","commenter_b":"Awful woman !!!","commenter_a":"I don't want to see this face in my newsfeed.","post_message":"Leave it to Michele Bachmann to exploit a tragedy to take a swing at President Obama"}]
