[{"comment_id":"10152535157075496","commenter_b":"And she protects children!!!","commenter_a":"Just because you make some mistakes in life does not mean you should not be able to work! DFACS clearly states in their policy that she is okay to work for them! There's no need to put this woman on blast like that. Making some mistakes doesn't make her incapable of helping children in need. It's unfortunate people are being so judgemental. I'm glad DFACS is protecting her in the workplace.","post_message":"HOLDING THE POWERFUL ACCOUNTABLE: A state investigator responsible for ensuring the safety of Georgia's children can be convicted of forgery and pulling a gun in a road rage incident and apparently still keep her job.   See more: @webpagelink"},{"comment_id":"10153550456286337","commenter_b":"Fat lisa loeb looking bitch","commenter_a":"Yeaaaaaah... That guy can fuck directly off.","post_message":"\"Somebody who’s overweight? I find that utterly repulsive and disgusting.\"  WORST. TRAINER. EVER."},{"comment_id":"10155189081740354","commenter_b":"She ought to steam clean the empty space between her ears.","commenter_a":"There's a fool born every minute!!","post_message":"Who Says The Hollywood Left Is Out of Touch?"},{"comment_id":"10153127223956800","commenter_b":"Jodi, you are a serious bitch. And an ableist, uninformed, obnoxious bitch at that.","commenter_a":"I urge every parent with a child with autism (I have two children dx autism) to seek out proper IGenex testing for Lyme. Lyme mimics autism. Both of my children recovered from autism w proper Lyme treatment.","post_message":"\"The whole show is about raising money -- not to cure autism. Because a lot of people are working on biomedical research. My wife and I couldn't get our kid into any kind of school or program that was adequate for him until he was 7 years old. And people with fewer resources than us -- it's unimaginable to us what they have to go through. And the kids. They deserve better.” — Robert Smigel discusses Night of Too Many Stars   ► Watch the interview: @webpagelink ► Support autism programs: @webpagelink"},{"comment_id":"1353674218062160","commenter_b":"Dawn you're clearly a sexist. Lol.","commenter_a":"Yeah and the Republicans made such a big deal about Hillary's reset with Russia. The Donald just might sell out to Russia. Just how many millions did the Donald get from Putin?","post_message":"Donald J. Trump can scrap U.S. sanctions on Russia and other national security policies with just a signature."},{"comment_id":"10154882133170329","commenter_b":"Really people! No arguments please","commenter_a":"The correct term is Native American.","post_message":"\"I realized that half the world made such an effort to get what I am naturally blessed with.”"},{"comment_id":"1117955828258960","commenter_b":"Smart girl","commenter_a":"Why doesn't he acknowledge Tiffany??--- his daughter with Marla??","post_message":"Donald J. Trump has asked the White House if his adult children can have top-secret security clearances."}]
