[{"comment_id":"10153745171813837","commenter_b":"She lied. There's a difference.","commenter_a":"Far more honest about her mistakes than Hillary Clinton.","post_message":"MRS. TRUMP: Melania Trump announced Thursday that she took down her website, acknowledging that it contained inaccuracies."},{"comment_id":"738344672965380","commenter_b":"They'll never get in!","commenter_a":"I wouldn't say he told Obama off...more like explaining the way of things in Radical Islam...because that moron needs to have it explained to him...2016...get here quick!!!","post_message":"Ohhhhhhbama."},{"comment_id":"10153085660518010","commenter_b":"@username - Why are you afraid of strong women?","commenter_a":"If women can complete the same physical testing that men have to then they should be allowed to become full combat ready Army Rangers","post_message":"About 60 women will be allowed to take the next Army Ranger course assessment for the first time ever.  But women are still not allowed to become members of the regiment and will not serve as Rangers in combat."},{"comment_id":"1756436014601478","commenter_b":"Bye BITCH","commenter_a":"Makes me want to vote Trump","post_message":"The Fate of the Republic Hangs in the Balance..."},{"comment_id":"544054039123949","commenter_b":"Drain the SWAMP","commenter_a":"President TRUMP 🇺🇸","post_message":"REPLAY: Republican presidential nominee Donald Trump at a rally in Tampa, Florida."},{"comment_id":"10154306039388812","commenter_b":"How so @username, what was the childish remark. Do tell...","commenter_a":"This is awesome! Every child should have someone to tell them they're loved and accepted. Growing up is hard enough I can't imagine what transgender teens must go through everyday and I'm glad there are people willing to stand up for them and do the right thing.","post_message":"After an uphill battle involving protests and a petition, Wisconsin school will allow transgender high school student to run for Prom King: @webpagelink"},{"comment_id":"1734000846853202","commenter_b":"Yes","commenter_a":"That they do!","post_message":"“When the left starts to lose, they break the law.”  Do you agree with Newt Gingrich?"}]
