[{"comment_id":"1792151467673200","commenter_b":"Right a true nasty woman!","commenter_a":"The only \"educational\" facet in Rosie is her nastiness! Period.","post_message":"Rosie O'Donnell says she posted a tweet questioning whether Donald Trump's 10-year-old son is autistic because she found it \"educational.\""},{"comment_id":"10153959431701756","commenter_b":"10,000 troops + ??? = Peace. Duh.","commenter_a":"Sure, send ground troops, take out Isis on a matter of weeks and then... What?","post_message":"Sen. Lindsey Graham says he wants to send in upwards of 10,000 ground forces as part of a coalition to fight ISIS."},{"comment_id":"1833633870187083","commenter_b":"Whatever her position, she chose it. I have researched her & she was looking for a meal ticket. Hopefully she knows now the real meaning of money. She has a mouth & 2 feet & she could walk. No matter if there is a prenup & what it says, this bastard is going down & in the end she would probably prevail.","commenter_a":"we have more important things to do with our words and our time--feel sorry for Melania and the Barron--or get our Country back--it's a choice-Can't do both---you people better choose------Bleeding Heart will only go to degree---We have a choice...to allow a Dictator or feel sorry for his family? Cut me a break!!","post_message":"WOW. Melania's face says it ALL! #freemelania"},{"comment_id":"10153220731196234","commenter_b":"She should be fired and thrown in jail","commenter_a":"Should have had her license taken away!","post_message":"The nurse who re-used syringes for the flu vaccine at a West Windsor company has agreed to a temporary suspension of her license."},{"comment_id":"870850106350450","commenter_b":"She's desparate and we already know that she'll say anything to get a vote. I wouldn't be mad if she stroked out.","commenter_a":"Yeah ok","post_message":""},{"comment_id":"10153919889436955","commenter_b":"Trump is the only one who will throw out all of the illegals and anchor babies too stop the influx of Muslims","commenter_a":"Rubio has supporters?????","post_message":"POLL: Who will Marco Rubio supporters vote for?"},{"comment_id":"982872948473970","commenter_b":"These people are what is wrong with America! I can't wait for them to occupy Canada","commenter_a":"these are the hate american soros funded kids who still live at home and hacve ebt cards and dont pay for health insurance..","post_message":"DEVELOPING: Leftist Radicals in New York City and Arizona launching anti-Trump uprisings...TRUMP PROTESTERS BLOCK ROADS TO PHOENIX RALLY....MORE..."}]
