[{"comment_id":"1038763572850057","commenter_b":"That is why UK and USA loves family rulling there in the midle eastern countries. Democracy, peace and stability there in M.E does not help uk and usa that is not what they after it is the mess and the chaos they are after and this is what they benefits from. Unfortunately it has always been like this. If not why they remove all thse regeme in ME but not even one country could not see better? IRAQ Libya are tw good examples","commenter_a":"The only people who should be ashamed are the terrorists bombing their own country, who made these refugees flee in the place.","post_message":"'Humanity washed ashore. SHAME SHAME SHAME...'"},{"comment_id":"1179704828736654","commenter_b":"What do you expect their natural prey is vermin after all!","commenter_a":"Omen? It probably thought his hair was a nest.","post_message":"This might be the greatest story of the week."},{"comment_id":"10153238439315950","commenter_b":"seeing as every single non 1st nations person is an immigrant they need to stfu","commenter_a":"Guess you \"forgot\" to mention yr phony ISIS had 20,000 twit-sites taken out by Annonymous? CIA must be a tad depressed today? Not to worry guy's....it's only REAL NEWS! We can find it anywhere but here. Jokers! Shame on the lot of you!!!","post_message":"UPDATE: More states are saying \"no\" to Syrian refugees in the U.S., call for stricter screening @webpagelink"},{"comment_id":"931654693541670","commenter_b":"It's not just barbaric, it is one more tool of the rich used to keep the not-rich \"in their place\".","commenter_a":"I guess when you have universal medical coverage you don't realize what a nightmare our system is.","post_message":"The headline really begs the question, who the hell would ever want to visit the United States knowing they could be bankrupted if they should need medical care while they are here?/"},{"comment_id":"483365738520673","commenter_b":"Worthless hoe bag","commenter_a":"MYOB WITCH!","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10155187133853029","commenter_b":"Your literally the only one what finds this funny","commenter_a":"@username listen to the end","post_message":"Video captures a Syrian mother and father preparing their two daughters, ages 7 and 9, for jihad suicide missions."},{"comment_id":"1066819213408210","commenter_b":"Welcome home honey, Americans take care of each other. We want more proud immigrants like you!","commenter_a":"I am not a us citizen yet,but I hate seeing american burning a us flag..she not the one to fight for her freedom..she didn't even think to the forefathers that fight for her freedom right now..that has no respect at all..","post_message":"WATCH: A police officer takes an American flag away from a protester who was trying to burn it outside the GOP Convention in Cleveland."}]
