[{"comment_id":"10153188126467293","commenter_b":"What is this, then? \"That multicolored background is not gonna save you.\"","commenter_a":"That qualification was executed with a double standard.","post_message":"For all those who doubt the women's accomplishments."},{"comment_id":"10154146599832541","commenter_b":"Can we deport you? Bigots not needed in America.","commenter_a":"Aren't Obama's illegal immigrant aunt and uncle still here? They should be top priority for deportation.","post_message":"Joel LaPierre will have to keep his racist thoughts to himself from now on."},{"comment_id":"10154465918697235","commenter_b":"She might have been taken off because she is a hateful bitch. I cannot imagine someone would want to have sex with her.","commenter_a":"He should have taken you off the air YEARS AGO, Andrea Tantaros for being a LIAR and ILL-INFORMED. Good Luck with your impending lawsuit. Hope to never see you on the air ever again.","post_message":"WHOA"},{"comment_id":"10153236337040047","commenter_b":"This is an evil,should be exterminated.","commenter_a":"So sad","post_message":"This week, the European Parliament voted unanimously to recognize ISIS's atrocities against Christians as genocide.  When will the U.S. do the same?       Sign and Share our critical legal letter to Secretary of State John Kerry to demand immediate action: @webpagelink"},{"comment_id":"10154242038366323","commenter_b":"If someone voluntarily choses this classless \"job\", they deserve anything and everything that might come their way. I have no sympathy with whores and sluts, be they male or female. Why should I?","commenter_a":"Are you kidding me? Political correctness has come to THIS? The authors ersatz rationalization is nothing more than a peurile legitimization of prostitution. Call it whatever you like and for whatever reason, prostitution is prostitution, period. The whole point of the world's oldest profession is to exchange sexual favors for money. That prostitutes, no matter the reason, willingly engage in the services they offer is no reason to create bogus excuses for the consequences. If the sex worker - and make no mistake, that's what they are, regardless of their sex - comes away psychologically damaged, well, that rather goes with the territory of the profession. That is their problem, not anyone elses. In case they hadn't heard, prostitution is illegal. Why should taxpayers be burdened with caring for their psychological ills? As it is, sex workers already reap the benefits of medical attention at emergency rooms or through state ...","post_message":"\"If, while having sex with someone, you feel repulsed by them touching you, afraid of what they might do, degraded and humiliated by the sexual acts – the fact that you’ll get a bit of cash at the end does not change anything. There is no invisible hand in the prostitution market that magically disappears the lived experience of sexual abuse.\""},{"comment_id":"990765034279620","commenter_b":"Not empowering ,because ur shity woman","commenter_a":"I love them","post_message":"Photoshop this."},{"comment_id":"1737893789788061","commenter_b":"HE LIST THEM ALL WITH NAFTA AND BANK DEREGULATION TRY AND LEARN TRUE HISTORY.","commenter_a":"he has a great track record on creating jobs, just not in the USA","post_message":"Hillary Clinton is making plans for the future."}]
