[{"comment_id":"10153389927718598","commenter_b":"She seems to be for all things bad!!! And she is suppose to be a christian...","commenter_a":"You are nothing but. Trash joy behar ,,","post_message":"Joy Behar Trashes Carly Fiorina for Being Pro-Life “She Should be Ashamed of Herself”"},{"comment_id":"957019640987493","commenter_b":"It's normally women who wear high heels that shame women who don't if we are going to be honest. As a woman you can't get into many clubs if you're not in heels.","commenter_a":"On the other hand, I don't think it's right to \"shame\" women who likes to wear heels either.","post_message":"Looks like somebody learned his lesson."},{"comment_id":"10152912269504071","commenter_b":"Idiot white people","commenter_a":"Why is it still okay to use the n-word in rap music? Why haven't people of color stood up against those of the same color that use that word?","post_message":"There a few other words more volatile than this one."},{"comment_id":"685418174982094","commenter_b":"Why don't they take those liberal bitches off the air","commenter_a":"These women need to think before they speak","post_message":"The View is going to be taken off the air after host says this about candidate on live TV. This show is disgusting liberal trash. Put an end to the show already. Can we get 100,000 'LIKES' to have The View cancelled?"},{"comment_id":"10153970648079091","commenter_b":"Just string her up!","commenter_a":"Sick people!","post_message":"UPDATE: New Mexico mom out of hospital, taken to jail after the brutal murder of her 10-year-old daughter in which police say she was injected with meth, raped, killed and dismembered."},{"comment_id":"10154325578499255","commenter_b":"hurry with that wall.and maybe with all the money they make they will build it for you.","commenter_a":"The Republican Establishment goes nuclear.","post_message":"This has to sting.  By Daily Kos user ericlewis0"},{"comment_id":"783181045136903","commenter_b":"Because jerusalem is Israel. This fact will not change no matter what this president says.","commenter_a":"Why we should consult Israel? What you guys think you are? How many Palestinians have been killed in the holly land since creation of Israel? You got a country out of nothing and there is nobody who could satisfy you people.","post_message":"In new book, former ambassador and now Knesset legislator describes his impressions from when he was Israel's envoy in Washington between 2009-2013."}]
