[{"comment_id":"10154382279344497","commenter_b":"Aye. Fuck bitches, make money.","commenter_a":"Single man enjoying free milk, basking in savings after not buying cows.","post_message":"Via ClickHole:"},{"comment_id":"499007870289793","commenter_b":"She's an ass. She's not an elected official. Tell her to stuff it.","commenter_a":"Go away Michelle.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153745675114641","commenter_b":"The most beautiful mistake in history. It was like a fairy tale that came true. Both ladies got a chance to win. They are all winners.","commenter_a":"Que estUpido!","post_message":"The moment when Steve Harvey crowned the wrong Miss Universe. Full story: @webpagelink"},{"comment_id":"10155255088631037","commenter_b":"Don't hate cause I'm not morbidly obese","commenter_a":"Where are all those kind hearted liberals who are protecting the refugees now?, you all show your true colors you will snub a American Woman just because of the job her dad has.. This is why the DNC is a sinking ship. Just look at all the red republican states now.","post_message":"Did Whoopi Goldberg think this is how Tiffany would react?"},{"comment_id":"10153243710196523","commenter_b":"Give her ass the death penalty!!!!!","commenter_a":"Poor angel baby...rip. Your POS mother should now get the death penalty. Horrible!!!!!!!!","post_message":"A 33-year-old woman has been charged with murder in the death of her newborn baby girl after the child was allegedly thrown from the 7th floor window of an apartment building."},{"comment_id":"947324245313643","commenter_b":"Sick witch, heartless.","commenter_a":"Arrested her","post_message":"Police say woman hid body of dead son in trunk of her car. According to police, the boy was last seen in 2004. @webpagelink"},{"comment_id":"1006229472770134","commenter_b":"You seem a lovely Christian...","commenter_a":"Scum bag,evil,man!! He's a Muslim running America,funding ISIS","post_message":"'Welcome home, Mr President'"}]
