[{"comment_id":"1740459202903983","commenter_b":"SHE IS A FELT POINT SPOILED BITCH THAT HAS NEVER WORKED A DAY IN HER LIFE","commenter_a":"Having second and third generation entitled political hacks like Pelosi is what breeds assholes like Trump. In the end, Karma is a bitch. This country can do better.","post_message":"Nancy Pelosi blasted her Republican colleagues for not taking action on gun control, saying after every shooting there is a moment of silence, which means nothing without action. Pelosi states \"a moment of silence just left there is a moment of denial.\" Do you agree?"},{"comment_id":"1762485630649940","commenter_b":"In the world of medicine, an incorrect diagnosis could possibly be as good as death. So in this case, yeah. Alternative medicine does kill.","commenter_a":"\"Alternative medicine kills\" what the heck?! It didn't kill her, sure it didn't save her, but it certainly wasn't the cause of her death.","post_message":"Being vaccinated could have saved this child. Being taken to a qualified medical doctor rather than a quack could have saved this child. Alternative medicine kills."},{"comment_id":"10154383180609641","commenter_b":"Now this is the kind of stories we want to see and hear... Not lesbian kissing in public yet in their hearts they know too that unless they repent and accept Jesus as Lord they are on their way to Hell","commenter_a":"Moms...","post_message":"Meet the woman behind Usain Bolt."},{"comment_id":"1111126252261565","commenter_b":"Bigger the caliber smaller the cock.","commenter_a":"Maybe she should just use the dildo then relax a little. Nothing wrong with open carry. All of these other campuses getting shot up didn't allow guns and that didn't work either.","post_message":"If this doesn't get people to pay attention to how ludicrous our gun laws are, I don't know what will. - Eric March"},{"comment_id":"10153502660004087","commenter_b":"Obviously! She won by less than 2 delegates- 6 of which were won by COIN TOSS.","commenter_a":"She will enjoy in prison","post_message":"“Obviously, Secretary Clinton has won. So congratulations to her,\" said White House press secretary Josh Earnest said. I am sure they feel good about that. They should.\""},{"comment_id":"755708104563829","commenter_b":"And what happened when bush was president. This woman is going to do what's best for our country","commenter_a":"Didn't isis grow under her watch, and lybia burn. Nothing was accomplished while she was secretary of state.","post_message":"There's one candidate who's ready to be Commander-in-Chief on Day One."},{"comment_id":"1084846008220301","commenter_b":"It's past time for the GOP to get behind Trump as front runner and he is not a racist the black and Mexicans are voting for him because they know the ILLEGALS are taking their jobs and we need that wall for our security and jobs for real Americans nobody wants to live off of welfare and with this core education makes it hard to get a job VOTE TRUMP 2016","commenter_a":"OK Donald and ted, you need to go to your corners and take a breath. When you have settled down you can no longer sit at the adult table. This is why we cannot have nice things, you two acting like very spoiled children. Enough of this infantile acting, are you trying to give this nomination to kasick?","post_message":"Things are about to get REALLY messy..."}]
