[{"comment_id":"884400811644417","commenter_b":"Once again, that blonde bimbo has diarrhea of the mouth!","commenter_a":"this guy has an ego like no other. he is disgusting to look at and if he weren't rich he would probably be a homeless pervert or a wall street runner.","post_message":"The Oracle of the Republican Party speaks out."},{"comment_id":"10153664912304726","commenter_b":"There are Syrian refugees already there!!","commenter_a":"Yeah, let the refugees all live at the vatican. they got lots of money and plenty of room.","post_message":"The Vatican keeps out the throngs while the Pontiff urges the U.S. to open borders."},{"comment_id":"2076295639262230","commenter_b":"Who is Jill Stein?????","commenter_a":"Throw your support behind TRUMP all of you Bernie supporters!!!!","post_message":"Breaking News: Democratic National Committee Chairwoman Debbie Wasserman Schultz will not preside over her party’s convention in Philadelphia following email leak suggesting anti-Bernie Sanders bias, Fox News confirms. @webpagelink"},{"comment_id":"2202427943315983","commenter_b":"'@username go beat your wife old man","commenter_a":"The ole draft dodger than said McCain wasn't a war hero because he was captured in battle. Yeah he really respects our military to nominate someone who is already part of the problem with the VA. I am a Republican at heart but I'm not going to blindly follow this man like some are. Words have meaning.","post_message":"Watch: President-elect Donald J. Trump and Vice President-elect Mike Pence lay a wreath to honor the nation's fallen soldiers at Arlington National Cemetery."},{"comment_id":"572406196218003","commenter_b":"'@username bigotry people?!? First learn to compose a literate sentence, then read your comic book.","commenter_a":"Unfortunately, anti-gay bigots never seem to go away since we're still dealing with them 40 years later. When will we, as a people, learn to stop hating people who are different than us?","post_message":"TV's 'All in the Family' was way ahead of its time.   Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153274848901600","commenter_b":"Just send a card. She should get the hint.","commenter_a":"Decline the invitation","post_message":"A mom is causing a backlash online for an apparent email she sent before her son’s first birthday party. The email includes specific requests about acceptable gifts for her son."},{"comment_id":"908658009268823","commenter_b":"'@username still smarter than that orangutan! That orange menace!","commenter_a":"Hillary Clinton is a walking oxymoron... Innocent yet Guilty!","post_message":"Hillary Clinton rips into Donald J. Trump for his critique of retired four-star Gen. John Allen, saying it's unpresidential to 'insult and deride our generals.' @webpagelink"}]
