[{"comment_id":"1301607906602125","commenter_b":"sharon when and if hillar y gets on i hope she puts the syrian refugees near u look what happened in europe well maybe u can get 1st taste of the syrian refugees in ur neighborhood","commenter_a":"Trump totally blew that first questions......He's the greatest at deflection.....LOL.......all he can say is we got to stop the jobs from leaving.","post_message":"WATCH LIVE: Hillary Clinton and Donald J. Trump square off in their first debate."},{"comment_id":"2202427943315983","commenter_b":"@username go beat your wife old man","commenter_a":"The ole draft dodger than said McCain wasn't a war hero because he was captured in battle. Yeah he really respects our military to nominate someone who is already part of the problem with the VA. I am a Republican at heart but I'm not going to blindly follow this man like some are. Words have meaning.","post_message":"Watch: President-elect Donald J. Trump and Vice President-elect Mike Pence lay a wreath to honor the nation's fallen soldiers at Arlington National Cemetery."},{"comment_id":"10153830223561756","commenter_b":"why were they refugees and not called migrants... humm good for the goose good for the gander..","commenter_a":"Thank you for calling them migrants. The \"refugees\" stayed in Turkey, Greece, Lebanon etc. The ones migrating all the way to Germany - some 10 countries' borders away! - are economic migrants who risk their and their poor kids lives to get to the country with the highest GDP and best social services about 2,000 miles away. Hungary has had enough of them coming through, demanding food and services all the while disrespecting Hungarians laws and badmouthing the country. Enough! Go around or go back, Hungary has no interest in catering to this group, the country has enough problems already with unemployment etc. Watch this video, Hungarian cops trying to disperse food and drinks to migrants and refugees: @webpagelink","post_message":"The scene at at least one processing area in southern Hungary is starkly different from recent days. Aid agencies are dismantling huge tents. Cleanup crews rake trash into piles.  Migrants who slept in a cornfield here for days have been bused to the Austrian border. The Hungarian border is now closed."},{"comment_id":"10153956730069411","commenter_b":"You poor thing! (Jk)","commenter_a":"I know where I came from :) I am 20% from Asia, 20% from North America, 20% Pacific Islander and 40%European Meztizo. That is why I look like this. My eyes are brown and blue (blue edges, brown interior).","post_message":""},{"comment_id":"10153515610223984","commenter_b":"Tough shxt! If you want Muslim crap, go back to the sand fleas, get the hell out of America!","commenter_a":"If I was to go to another country would they change their laws for me change their religion.. NO THEY WOULD NOT!! SO WHY ON EARTH WILL AMERICA CHANGE WHY !! GOD FORGIVE AMERICA FOR THEY RE GOVERNMENT IS STUPID!","post_message":"I have to admit, I was quite startled when I saw these numbers. It seems that a real problem could be brewing...  Is Sharia law in America a major concern of yours?"},{"comment_id":"163756660695086","commenter_b":"She's unbelievable. I swear she better not get into office. WAKE UP AMERICA!!!","commenter_a":"I think Hillary is channeling Marie Antoinette.","post_message":"Hillary Clinton just landed her plane in Nantucket...   Almost immediately after people saw her, this HUGE problem went viral..."},{"comment_id":"10156221471665725","commenter_b":"Trump is only enforcing a fedral law, by deporting illegals !!! This is already the law !!!","commenter_a":"I am inviting all of TRUMP FAN to PRAY , from the HEART everyday and all the time, he need it and we need him, please let get together , for our country and for our new president TRUMP, TRUMP 2016, AMEN !!!!","post_message":"I will be hosting Saturday Night Live on November 7th. Looking forward to it!"}]
