[{"comment_id":"10154014226755329","commenter_b":"Wants it now","commenter_a":"Luis Lkns","post_message":"This is fact."},{"comment_id":"669515329853116","commenter_b":"obama's peaceful religion! muslim Orcs bring intolerance, hate, terror, destruction, and death. The culture and \"civilization\" manufactures nothing else but!","commenter_a":"Just why would you call her crazy. They can flip into terrorism at any time. The parents should not have hired her. Stupid.","post_message":"Russian police arrested the nanny and charged her with murder after she was found at a subway station holding a child’s severed head, yelling \"Allahu Akbar,\" according to reports."},{"comment_id":"10152763354566051","commenter_b":"kill the bitch","commenter_a":"They need to wrap her head completely in duct tape !!","post_message":"When her fiance broke up with her, this woman decided to make his 3-year-old daughter pay."},{"comment_id":"10155201901781162","commenter_b":"Maybe the writers can be more select on how they word their headlines. Maybe they do this on purpose cause they get a kick out of reading the comments. You never know.","commenter_a":"Reading is key... trumps pic did employ an illegal, but upon finding out ended her employment and aided in getting her assistance in getting legal status ... this is why america is the way it is... read a title and jump to conclusions... most of the people protesting can't really hold a conversation about why there out there.. other than 1 line headlines they repeat over and over... it's sad","post_message":"President Trump's labor secretary pick, Andrew Puzder, admits that he and his wife employed an undocumented housekeeper for years...@webpagelink"},{"comment_id":"10153120906398205","commenter_b":"95percent of the illegal immigrants are hard workers.... So much so that many citizens feel threatened will take their jobs.....i would never be scared if an illegal taking my job......","commenter_a":"Thus is what you spend your time on. Your dedication should be the American people I think your priorities are screwed up. As a congressman you work for the citizens of this country.","post_message":"Central Florida - I'm coming to talk about how to get ready for DACA and DAPA!"},{"comment_id":"10153639666243138","commenter_b":"You, m'dear, are brilliant. Wish I was a Floridian.","commenter_a":"Since we have Debbie Wasserman Schultz to hold to the fire for unfairly slanting the elections, I thought it might be productive to take her to task and donate to her democratic rival in Florida's 23 district Tim Canova. Knock her right the hell out of her seat in congress. Might wanna throw him 5 bucks and help him send her packing. It matters.You don't have to live in Fla to donate, it affects us all. @webpagelink #TellHimBernieSentYa","post_message":"I'm not saying Donald J. Trump won by appealing to the KKK, but if the hood fits…"},{"comment_id":"1422508754431832","commenter_b":"Yes","commenter_a":"Yes, totally!!","post_message":"Should Washington require drug testing for unemployment benefits?   A. Yes.  B. No, it's spending a lot of money on little gain  C. This is a bit unfair for states that legalized pot  D. Only for those who lost jobs to drug use E. Enter your own anwser"}]
