[{"comment_id":"913510862078500","commenter_b":"This women is a idiot and if she thinks that these charges are going to stick she is crazier than hell.. She is a real nut job.. Glad she is in Baltimore hope the hell that is where she stayed..","commenter_a":"She's doing a great job and that's a signal for critics and whiners to just move along!","post_message":"Competing interests?"},{"comment_id":"10153693549314087","commenter_b":"Well Donald was a life long Republican","commenter_a":"Why are the rules in a way that you have to register so long before the actual vote? Isn't this a form of voter suppression? Ps. I'm not a trump supporter.","post_message":"'They were unaware of the rules, and they didn't register in time,” Donald Trump said of his kids, Ivanka and Eric. 'So they feel very, very guilty.”"},{"comment_id":"10154130637278352","commenter_b":"I'm positive with all the comments you got some backlash lol, but keep in mind they're fucking disgusting bitches ha ha ha ha","commenter_a":"There's nothing wrong with breast feeding, but this is disgusting to put your almost 4 year old on the boob.... Want your child to drink your breast milk? invest in a pump....","post_message":"Mother defends breastfeeding her three-year-old son claiming cows' milk is bad for children as she encourages more women to feed toddlers this way"},{"comment_id":"10154557639632619","commenter_b":"Jerusalem is the old city of Israel.","commenter_a":"IDIOT COMES IN ALL SHAPES & SIZES & STATUSES!!!!!!! ISRAEL FOREVER!","post_message":"Jordan's King Abdullah II threatened an 'explosion' over Israel cracking down on violent Muslim riots on the Temple Mount, stating that he will broach the issue at the UN next week."},{"comment_id":"1584761528498475","commenter_b":"Women should have the right to decide, but whomever is willing to oblige her and perform the abortion should be arrested and thrown in prison for being willing to be an accomplice to a murder. If it were illegal for doctors to perform abortions then she can decide all she wants. Decide away!","commenter_a":"Nicholas Moore","post_message":"If you think Trump has bad ideas - Gov. Mike Pence has actually taken women's rights away. These two make up one of the most anti-woman tickets in history!"},{"comment_id":"10153446072426545","commenter_b":"Why would that CRAP sell out? It looks like a hooker dress. Either that or she LOST the other half.","commenter_a":"I want to hear more about why the SWAT team was deployed in W FTW.","post_message":"The sisters, who have previously collaborated on clothing lines with PacSun and Topshop, celebrated the launch of their 'first-ever ready-to-wear collection.'"},{"comment_id":"10153885914416336","commenter_b":"Because of the way, they TREAT WOMEN!","commenter_a":"This woman is totally ignorant. How many Muslims live in the US? Are they all terrorists? How many such shooting have taken place in the US? Are these all terrorist acts done by Muslims? Why dont you open your eyes and find out that all these terrorists have links with Pakistan and Saudi? Why nobody dares to say where all these terrorists come from or have link with? Why do you stamps all Muslims as terrorists?","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.”  Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"}]
