[{"comment_id":"10156224999290551","commenter_b":"Go back to your own shithole country.","commenter_a":"Let's wrap them up in bacon and send em back to where they come from😎","post_message":"Trump was right - Muslims did celebrate 9/11."},{"comment_id":"10154428914569411","commenter_b":"What refugee crisis? These invaders are not refugees.","commenter_a":"I have never seen such inhumanity as I have seen in the west where personal freedoms are more important than justice and what is right. The REFUGEE crisis is just the latest example of this.","post_message":"'Our chancellor has given up the sovereignty of the country, she has given up our borders, she has given up our rules and regulations'"},{"comment_id":"796156163908294","commenter_b":"Yeah and make all those fat bitch bags move to another country","commenter_a":"No one watching it anyway put whoopi on a plane","post_message":"'The View' Made THIS One Fatal Mistake, And Will Likely Be Shut Down Because Of It  Good. Get this liberal trash off the air. We've had enough.  Would you be happy to see the View get thrown off the air?"},{"comment_id":"10153378758554575","commenter_b":"Would this woman have been willing to pay the stewardess' salary when the stewardess got fired for allowing her to make the phone call? Bet not....","commenter_a":"Why is she leaving if her husband was suicidal","post_message":"A woman says Southwest Airlines refused to let her call her husband after she received a troubling text message shortly before her flight was scheduled to take off.  The woman said the text read, “Karen, please forgive me for what I am about to do, I am going to kill myself…” She said she replied \"no\" and immediately tried to call her husband, before a steward \"slapped the phone down\" and told her to put her phone on airplane mode."},{"comment_id":"1389869284386873","commenter_b":"Nothing, absolutely nothing. Vote them all out, they deserve to be jobless.","commenter_a":"They took a lot of time off, which means they weren't doing even more stupid hurtful stuff.","post_message":"We'll wait.  Like Addicting Info for more great content!"},{"comment_id":"10156195234480093","commenter_b":"Guns are not only made here...","commenter_a":"People said America is full of nuts but before reading these comments i did not believe it. Take all the guns and destroy all the gun factories and find out what living in peace means","post_message":"Let's have an HONEST conversation about it."},{"comment_id":"828526300671280","commenter_b":"Hillary can't control own husband......let alone our country.","commenter_a":"incompetent bitch would not have far to go thanks to obummer .","post_message":"This is the worst thing that could of possibly gotten out.  America has to do whatever it takes to keep them away from the White House.  Do you think Hillary will run our country into the ground if she gets elected?"}]
