[{"comment_id":"1786545848249097","commenter_b":"@username What's that? No one has been able to get him to say what that is. Oh I forgot, he's going to build a wall.","commenter_a":"Agree Obama put us in a real position with his foreign policy. Now all the people saying Hillary should be our next president she is just as bad or worst then Obama. We need Trump to get in office and try to clean up there messes !!!","post_message":"House Speaker Paul Ryan says \"Our enemies no longer fear us and too many of our allies no longer trust us,\" all because of President Obama's foreign policy. Do you agree or disagree?"},{"comment_id":"10153007291820667","commenter_b":"yes... weed is as bad as crack. and if they made crack legal, will you or anyone you know start using it? if not why? its legal.... everyone will use it if its legal....","commenter_a":"Crack Cocaine is next! Woo hoo!","post_message":"Cloudy with a chance of pot smoke."},{"comment_id":"10158110141675500","commenter_b":"Why do u say that? I totally disagree!","commenter_a":"Disney sucks","post_message":"DISNEY DISCOUNT! Sunshine State residents can save big on Disney park tickets. Details >> @webpagelink Disney Walt Disney World Epcot - Walt Disney World"},{"comment_id":"1082059028539299","commenter_b":"And whites don't hey dumbass All lives matter you would know that if you stayed in school 😬","commenter_a":"Because Black LIES Matter to those thugs.","post_message":"It's no surprise that the people at Black Lives Matter aren't exactly known for their ability to stick to the facts. However, this new data about black \"victims\" absolutely DEMOLISHES their whole agenda. I guarantee the media doesn't report on this... let's spread this everywhere."},{"comment_id":"558632694347761","commenter_b":"Oh Karen, you drank the Kool-Aid!","commenter_a":"Clinton News Network is the Communist News Network! Suppressing the american people and the truth and shutting down live feed the minute anyone mentions anything negative about your Wicked Queen is disgraceful! Your network is just as bad as the National Inquirer with fake reporting! You continue to try and brainwash americans into believing the left wing propaganda. News Flash...millions of americans are starting to use their own brains, which you can no longer control! Continue to cheer for Killary, because you're proving to the american people that your network is as crooked as she is!","post_message":"“There’s no quote. You’re not gonna find a quote from me,” Donald J. Trump told Hillary Clinton. Well, we found a few. Watch 4 of Trump's statements from the debate stage that don't seem to match up with what he previously said @webpagelink"},{"comment_id":"1784144245187941","commenter_b":"Oh shut up!","commenter_a":"If African Americans don't understand that they're being exploited and used for their votes by this woman, well then they'll get what they deserve after they elect her, a lot of nothing! So sad to see them falling for this. She's using a black rapper to pull in votes, amongst other things. Using a group of people for a vote is so wrong, nothing more. She's disgusting to do this.","post_message":"Hillary Clinton quotes Jay-Z during Cleveland rally: “Rosa Parks sat so Martin Luther could walk, and Martin Luther walked so Barack Obama could run, and Barack Obama ran so all the children could fly.” Read more here: @webpagelink"},{"comment_id":"10152780954836094","commenter_b":"A whore doesn't care who pays them, but whomever pays them calls the shots of the services to be rendered.","commenter_a":"The \"corporate system whores\" can't make treaties with foriegn governments. Only political whores can do that.","post_message":"Within the economics discipline, Joseph Stiglitz has been one of the Trans-Pacific Partnership's most outspoken critics. The Nobel Prize winner in economics recently shared his concerns about the TPP at a community meeting in Queens, New York City."}]
