[{"comment_id":"10153454337713984","commenter_b":"BITCH","commenter_a":"Garbage! They want us to kidos their feetj!","post_message":"This incident has led to calls for a boycott of United Airlines, but not everyone is jumping on board...  Do you think this airline attendant acted fairly?"},{"comment_id":"10153397415338984","commenter_b":"Guess you are be careful about who you ask to suck your dick!","commenter_a":"Very old","post_message":"Watch what happens when this bully starts a fight with the wrong guy... he didn't see this coming.  The cameras caught this entire fight... Are you happy he got a giant slice of justice?"},{"comment_id":"1757450071143314","commenter_b":"Get your foot off the furniture! What an embarrassment she is!!!","commenter_a":"Chewbacca!!!! Lol","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"885087015015208","commenter_b":"She needs to move on and except defeat u fucking scumbag criminal","commenter_a":"Yes","post_message":"What a sore loser. She needs to come grips with reality. Are you glad Hillary is not going to be our president?"},{"comment_id":"10153881396091336","commenter_b":"It doesn't take rocket science to figure out the motive","commenter_a":"But it was probably just workplace violence.... We just don't know...","post_message":"According to police, here’s what we know about the #SanBernardino shooting: @webpagelink • 12 pipe bomb type devices were found in the home at the center of investigation • All four guns were legally purchased • The motive has not been determined • There are no credible threats at this moment   According to the FBI, here's what we know about the suspects: •  Male came back into the U.S. in July 2014  •  Female came to the U.S. on a K-1 visa under Pakistani passport"},{"comment_id":"1242469175793552","commenter_b":"Righto. Execute the little bitches! That will teach them a lesson!","commenter_a":"Sorry. If you watch the news you cannot just let things go with kids anymore. This time it was pepper that choked the teacher, who knows what would have happened in a few years if another teacher pissed them off........rat poison?? Good lesson to learn early.......being a little psycho bitch is not going to pay off.","post_message":"Three 12-year-old girls have been charged with first-degree felonies in the latest example of America’s insane rush to criminalize children."},{"comment_id":"10153595852746336","commenter_b":"Which one is the women??","commenter_a":"Girl power!!!!","post_message":"26-year-old Capt. Kristen Griest and 25-year-old 1st Lt. Shaye Haver will become the first women to wear the U.S. Army's coveted Ranger tab when they graduate alongside 94 male soldiers Friday at Fort Benning."}]
