[{"comment_id":"545673352289911","commenter_b":"Bitch","commenter_a":"Well the bitch is rich and scared of her own shadow... I will never watch a show hers again","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way. What a disgrace. She needs to deported to the Middle East. Do you think Nicole Kidman is a sell out?"},{"comment_id":"961148523904901","commenter_b":"Every female I pursued that said \"No, I am not interested in more than being friends\" at some point had sexual relations with me and enjoyed it after I kept pursuing her in ways she WAS responsive to! some women want gifts and loads of flattery before they say. When they dont want to be friends, I stop pursuing them, until then its their choice to hang or not. The only clause is when they ended up being lesbian women!","commenter_a":"No means No! Some people don't get it. If someone is not interested in you move on.","post_message":"After a 14-year-old girl told her mom that a boy was aggressively pursuing her at school, her mom, a clinical sexologist and video blogger, decided to post a video to the boy on YouTube. >>@webpagelink"},{"comment_id":"1368750766478283","commenter_b":"She was with a child!","commenter_a":"This women is a stupid and ignorant person I hope there were no kids around that can very easily copy this stupid act","post_message":"Toronto Zoo officials said the apparent retrieval of a hat was \"a very bad idea\" @webpagelink"},{"comment_id":"1229145840456983","commenter_b":"Clinton can't tell the truth! Can't remember her lies ! Gives her daughter 1,000,000$ a year of stolen money gained from corruption even year making Chelsea an accomplice ! As well as an accomplice to her email crimes! Arrest them all 2017!!!! Obama and Clintons open boarder policy and the invasion led by both to destroy America while millions come their way ! A record number of illegal aliens penetrate our wide open borders and manipulate a dysfunctional visa system, the boys now urinate in the girls bathroom if they identify as a female, the growth of Islam in America is unstoppable, the debt is so high the number appears fake, the shrinking of the military is sickening, veterans are killing themselves at alarming rates, the war on cops is an epidemic, we back to segregating college campuses, Obamacare is worse than what we had before it was a law, ...","commenter_a":"Hello she bed IP with people ehp kills hays","post_message":"She is the LAST person in the world who should be lecturing anybody about respecting anybody's rights, with her own HORRIFYING connections..."},{"comment_id":"1686144921672620","commenter_b":"Sixty percent of the donations to his church are by mail. I'll wager sent in by those that can least afford it.","commenter_a":"I am thoroughly confused. Why does a preacher have to be a millionaire? Jesus did not need a million dollars to spread the Word of God and there is no other as Him. Nor did his disciples. They taught the Word and lived the Word and never did they live as lavishly as these preachers. Many of you are saying that IRS should not get involved and the people should do something about it. The problem is that no one is and the blatant greed and lavish lifestyles is out of control - and what is the absolute worst- it is all done \"in the name of the Lord\". Sorry folks, these are not churches. They are tax free money making machines that feed off of very good hearted Christian people that just want to do their best to live according to the Word and these \"preachers\" know just what ...","post_message":"I can't believe this is happening. Sending prayers for Joel Osteen and the rest of America's churches that are being attacked."},{"comment_id":"1663183500635910","commenter_b":"That sumbitch looks like death warmed over.","commenter_a":"Soros is a subversive ShitBag and should be brought up on charges.","post_message":"George Soros is a _____________."},{"comment_id":"10154532714726162","commenter_b":"England, and yes it is my city is run by the labour party","commenter_a":"Where's white live matter, oh wait their not black","post_message":"A father and his two sons have been charged with molesting three young girls in their home... @webpagelink"}]
