[{"comment_id":"10154144312645861","commenter_b":"I'm sure they don't assume Christians drink wine and eat tiny pieces of bread for attention, nor insult their robes or any other attire calling it dress up. OR stand up and interrupt their prayers/services when they disagree with it! Freedom of religion, and simple respect...ever heard of it? I hope you don't expect anyone to respect your religion!","commenter_a":"He wanted attention, he wanted to upset people. Someone should tell him his dress is too big for him/her....but not to worry Halloween will be here soon enough, and he can go get a new costume to play dress up in.","post_message":"\"I saw community of people come together and take a stand for what was right.\""},{"comment_id":"1043787832310738","commenter_b":"So she cooks for him he does not eat rigjt away he showers then she but instead of making a plate of cooked food he decides to cook something different and its her fault.no he just know he can take advantage.nothibg wrong fixing a plate but he was petty.its childish","commenter_a":"This lady has time to waste, why is she asking the internet for advice when she could simply have a conversation with her man about this habit or preference. if she has an issue with making him a plate, then she should make it known..........geesh, communicate with the man instead asking us for our opinions since we do not know the whole story.","post_message":"Are his legs broken?! Anywho, what should this woman do?"},{"comment_id":"10153644073950861","commenter_b":"They can get married with benefits now. What the hell else do they want?","commenter_a":"The Florda man is at it again","post_message":"The display, based on the holiday depicted in \"Seinfeld\", will be 6-feet tall, wrapped in the colors of the gay pride rainbow flag and topped with a disco ball."},{"comment_id":"1713716002223281","commenter_b":"@username Bill Clinton is the one that suggested the wall u retard. Plus trump will hold people hiring illegals accountable.","commenter_a":"Yep. Actually, does sound like Trump's current talking points. Someone's a hypocrite. And it's not Trump. #Trump2016!","post_message":"Do you think this sounds a lot like Donald J. Trump? MORE: @webpagelink"},{"comment_id":"10152871641536051","commenter_b":"My husband served 20 years for this country and then a bitch like u get the freedom. U need to get the hell out of here and there may be someone out there that will really get mad and look for u bitch.","commenter_a":"Then WHY IS SHE HERE??? OHHHHH!!!! Cause she makes her $$$$$ here. Proud Americans STOP SUPPORTING THIS LOSER!!!!","post_message":"This musician says she hates absolutely everything about America."},{"comment_id":"10155704643444199","commenter_b":"No we dont want that woman in office.","commenter_a":"People don't want a woman in office. It's that simple! You can tell yourself and the rest of us that that's not the case. But it is.","post_message":"It the first time in four decades the state electors have broken from the popular vote for president. At least one vote was cast for Faith Spotted Eagle."},{"comment_id":"10153729476553433","commenter_b":"Why oh why does she lie so?","commenter_a":"Both parties are dead, the American Political System is dead. We need a complite overall. Let's start by Bernie and go from there!!! Two things need to happen A major bring out the vote campaing.....Bernie need to win by a landslide If that is not enough we need to come out into the streets by the millions and demand justice....even the day of the convention.....send a clear message that we are not going to take it anymore!!! THE AMERICAN PEOPLE ARE READY FOR A REVOLUTION TOGETHER WE WILL WIN BERNIE SANDERS 2016 President for ALL People The only choice #Bernie 2016 #FeelTheBern #WeWillWin","post_message":"Carly Fiorina said Gens. Petraeus, McChrystal, Mattis, Keane, Flynn all \"retired early because they told President Obama things that he didn’t want to hear.\" Well, Gen. John Keane retired in 2003, for starters. @webpagelink"}]
