[{"comment_id":"10153738613786955","commenter_b":"And black people wonder why white people view them the way they do. When you act like a classless piece of crap, we are going to view you as a classless piece of crap. And this woman is a classless piece of crap","commenter_a":"Should have dragged this Nappy-headed skank out by her hair & shown her the gutter where she belongs......Good luck in Prison Ho'","post_message":"WHAT HAPPENED TO MANNERS IN THIS COUNTRY?"},{"comment_id":"10157254857370354","commenter_b":"Punch that Bitch","commenter_a":"If he had a background like that, other wives would come forward. She wasn't going to get alimony...hummmm","post_message":"The latest twist..."},{"comment_id":"10153714763793132","commenter_b":"I seriously dislike this arrogant woman who will not be kind to Shannon, she's stupid not to learn from the others. She's annoying...","commenter_a":"The color is BLUE!!!!","post_message":"The Real Housewives of Orange County star made a beautiful gesture."},{"comment_id":"10154497186563445","commenter_b":"Our friends in england's women and children are also being raped to death or enslaved by 'refugees' and have some of the strictest gun laws ever so I think we can cut our losses there, drug addicts.","commenter_a":"Shit","post_message":"While the DEA has been busy reclassifying CBD as a Schedule I drug, our friends in England are rightly classifying it as a medicine."},{"comment_id":"591316744410090","commenter_b":"Rachel is such a Clinton lover.","commenter_a":"She is as Slimy as he is. All they have is harass Hillary. Guess what. It doesn't touch her. #ConManTrump #Hillary2016 #imwithher #StongerTogether #Trumpstaxreturns","post_message":"What is Donald J. Trump's stance on immigration? Trump campaign manager Kellyanne Conway stops by The Rachel Maddow Show to shed some light.  More from Rachel Maddow's interview with Kellyanne Conway: @webpagelink"},{"comment_id":"10153923340133635","commenter_b":"Vicki C: So true re immigrants across the border. They caused more than half our hospitals and emergency rooms to close in Los Angeles years ago!!! Now, it's difficult for REAL Americans to get care when they require it. Just disgusting! Add to that, the planeloads of moozies Ovomit has been bringing in for years and I'm surprised any healthcare is available at all! Even our Vets can't get care and they should be first!","commenter_a":"Border Patrol Agent Defies “Gag Order” to Expose Obama The massive exodus of illegals crossing over into Texas and other border states is becoming more than local communities can handle. This influx of illegal immigration is causing emergency shelters, areas typically designated for use during catastrophes, to overflow, leaving local government scratching their heads as to what to do with immigrants who have no place to go and can’t be deported back to their home country.... Border Patrol agent Hector Garcia accused the Obama administration of “aiding, abetting and facilitating the smuggling of illegal aliens across the border.” In an interview with CNN, Garza said the current influx of illegal immigrants is “organized” and “orchestrated” by the drug cartels. Additionally, he said the federal government is giving illegal immigrants a “free pass.” He said the feds are using the equivalent of the honor system in asking illegal immigrants to later ...","post_message":"#1 Republican President Teddy Roosevelt was also a proponent of eugenics theories by Planned Parenthood founder Margaret Sanger"},{"comment_id":"700735873407794","commenter_b":"No you dumb whore check history That would be the other dumb whore Hillary","commenter_a":"Why don't you just sit down and be quiet, because you haven't a clue hat you are talking about. You never experienced a thing of what you suggested, and doubt you know that history!","post_message":"According to the great celebrity-turned-philosopher Cher, Trump is now a genocidal murderer..."}]
