[{"comment_id":"561569204031372","commenter_b":"Sounds like grounds for a great law suit.","commenter_a":"I absolutly think it's wrong. Who has the right to tell someone to take of the flag when it fly's high and proud for our country. I'm proud to be an American but absolutly hate our govt.","post_message":"lorida Man Fired For Refusing To Remove His American Flag Pin  This man is a patriot, we live in AMERICA.  Do you think this is wrong?"},{"comment_id":"10150622928829999","commenter_b":"She needs to go and work with Al Dunlap. They both do jobs that no one else has the guts to.","commenter_a":"Joe Jack","post_message":"Ellen Pao is resigning from reddit after a week of ceaseless criticism from angry users."},{"comment_id":"10153327022163984","commenter_b":"I hope that he succeeds She is Satan","commenter_a":"Go all the way with this!!!!","post_message":"It’s been just over a week since Hillary’s announcement set off a firestorm of negative press about her past.   But one scandal stands out… Benghazi! Send an email to Rep. Trey Gowdy and tell him to pry the truth out of Hillary Clinton!"},{"comment_id":"10154950558833256","commenter_b":"How on earth can you make this RACIAL?. It grabs EVERYONE!","commenter_a":"I wish I can say I am shocked; but just about every one black who's trying to make a difference is going through it' other races probably are also' its horrible '","post_message":"Calling the practice of intercepting cellphone information secretive and widespread, a federal lawsuit alleges Chicago has an \"arsenal\" of cell site simulators (or \"Stingrays\"). When deployed by police, these devices capture data from any phone in its range — not just the intended target.  \"Government spying on its citizens without appropriate judicial oversight is inconsistent with the freedoms guaranteed by the Constitution,\" said Jerry Boyle, a Chicago attorney who brought the case."},{"comment_id":"10153371305674575","commenter_b":"Strip the Super Bowl, the ring, one year suspension (if not more) and mega fines","commenter_a":"He makes millions of dollars you think four games is really going to teach him a lesson? Dude strip the superbowl from them. Didn't you learn that a slap on the hand solves nothing!","post_message":"#BREAKING: Tom Brady has been suspended for the first four games of the season for his role in #Deflategate. Among other punishments, the Patriots were fined $1 million.  Brady will return from his suspension the week the Indianapolis Colts take on the Patriots at Lucas Oil Stadium."},{"comment_id":"10153177942114170","commenter_b":"Once a LIAR, always a LIAR! But what difference does it make at this point! Hillary is Obama in a skirt! Another Democrat that Bows to ISLAM and leaves Americans being attacked by Muslim Terrorists, TOO DIE!","commenter_a":"She should go to jail rather than the White House. Worst Secretary of State ever along with Obama the worst President ever.","post_message":"How stupid does she think we are?"},{"comment_id":"718993818288909","commenter_b":"They're here illegally they don't get rights moron!","commenter_a":"No one is saying we cant police our borders...but we must do so with Constitutionally appropriate actions. After all isnt it our CONSTITUTION that we are protecting, that we are asking out service member to protect with their lives. It makes no sense to me that we are willing to throw out the very basis of our great country because we are so fearful. We must be strong and remember our core values.","post_message":"Trump is keeping his promise! I don’t care how much liberals scream and protest… A NATION HAS A RIGHT TO POLICE ITS BORDERS, ESPECIALLY FROM VIOLENT CRIMINALS!   LET'S get 10,000 SHARES for our President! No Judge Can STOP His plans To Make America GREAT AGAIN!"}]
