[{"comment_id":"1081696675193718","commenter_b":"Y.e.s. lol","commenter_a":"@username is this the lovely place you worked?","post_message":"Thanks to #KPRC2 viewer Harold K. for this video of a manhole cover flooding outside the Houston Museum of Natural Science. Live coverage --> @webpagelink Radar --> @webpagelink Photos --> @webpagelink"},{"comment_id":"1114642831881306","commenter_b":"We Can't seem to Pin Point The Problem!!! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The Underwear Bomber was a Muslim The U.S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bali Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Muslims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The Besian Russian School Attackers were Muslims The first World Trade ...","commenter_a":"Where are the women & children ???","post_message":"A sound strategy, considering Obama's strategy is basically, \"You're a bigot if you don't accept Islamization of America.\""},{"comment_id":"981141605287036","commenter_b":"She belongs in a freak show. Why do people do that to their self.","commenter_a":"How disgusting I wouldn't hire you","post_message":"Americas Freedom Fighters"},{"comment_id":"10153333360391130","commenter_b":"@username, how is she a cheat? Please validate your contention.","commenter_a":"She's a bit of a cheat though and how she treats officials... Great player, not a great person","post_message":"These attacks aren't anything new."},{"comment_id":"956407617772796","commenter_b":"Really?? No, really. Once again giving twits a bad name!","commenter_a":"Whites freed,WTF How many Northern soldiers had to die for southerners idea that it is ok to enslave others.Sad thing is there's still bands of ignorant racist That still feel the same way now a days.","post_message":"Leave it to two David Barton and Glenn Beck to have a historically inaccurate and completely offensive conversation about race... Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153202645506350","commenter_b":"This women should go talk to parents.","commenter_a":"Everyone saying \"she could have dealt with this privately, how embarrassing for the kid\". She never even mentioned his name... She is just addressing him along with all the other boys out there who do this. Something similar happened to me when I was in grade school and instead of having my back, all my friends labeled me as a bitch for not giving this guy a chance. He WAS harassing me but it was seen as \"cute\" because women are taught to appreciate male attention no matter the circumstances. We are taught it is the best thing that could ever happen to us. Just bear in mind that if a teenage daughter willingly comes to her mother for help, during a time when most teens seek distance from their parents, there is clearly a huge problem. This is video that can help a lot of other parents and teens ...","post_message":"This mom has a message for the boy repeatedly being rejected by her 14-year-old daughter: No means no."},{"comment_id":"10153106076119255","commenter_b":"We have so many publications on both side that are mudslingers with out facts--about time both sides clean up their act and print thing to promote and support","commenter_a":"@username only wants to stir the pot recently!","post_message":"They were insiders. Home grown. Godly. Our neighbors, friends, and kin. People like us. By Bill Moyers"}]
