[{"comment_id":"1178124042307867","commenter_b":"No brains--no headaches. Maybe he should leave with Whoopie. They would be happy in Iran, take Rosie with you.","commenter_a":"Some of these people have lost their f##ing minds!!","post_message":""},{"comment_id":"10153411890906167","commenter_b":"Nah. Satan and the Mrs, would have had an abortion before bringing this creep into the world. ;)","commenter_a":"the son of satan.","post_message":"Troy Newman's views are so extreme that, as The New York Times reported in 2015, Australia cancelled Newman's visa over \"concerns that he might encourage violence against abortion providers or women seeking the procedures.\""},{"comment_id":"10154055005061167","commenter_b":"Oh God! !!! really this happened! What a nasty Woman!","commenter_a":"Artistry, get a clue humans.","post_message":"Beyoncé and JAY Z appeared with Hillary Clinton -- and Fox News completely lost it."},{"comment_id":"10153288204601130","commenter_b":"@username And don't even get me started on that bullshit that women think they \"feel free\" because they can hide their faces and bodies behind that stupid piece of cloth. That's not freedom dummies, that's another way of mind fucking, you can also feel free of not needed to know how you look if you spend 40 years in jail in a separate cell where no one will even know you exist.","commenter_a":"He's not holy, no one has ever been a holy person , enough your closed mind religious bullshit.","post_message":"No one rocks a baseball cap quite like the Holy Father."},{"comment_id":"10153043301434411","commenter_b":"probably a women could define.","commenter_a":"So does this apply to women?","post_message":"Warning! Selfie men!"},{"comment_id":"10152949754631336","commenter_b":"Being the measles were literally wiped out in the US, it had to come from somewhere else. I propose instead of making us get vaccines, we send all the illegals back to their 3rd world countries! Hence, problem solved! Oh, I'll go to jail before I have the government make me have one.","commenter_a":"I'm old school. I remember when country was more important than individuals. I nor my children COULDN'T start school unless I had my shots. What happened? ONLY in America do we have medicine to prevent sickness and ONLY in America does vaccines turn into a political stance. I voted for so and so because of their vaccination policy. WHAT?","post_message":"\"The government believes it owns your body.\"  Judge Andrew Napolitano chimes in on the great vaccine debate. Where do you stand on the controversy?"},{"comment_id":"698051370361332","commenter_b":"13th amendment, 14th amendment , 15th amendment. How many democrats wanted to abolish slaves, give citizenship to freed slaves ,and allow black to votes. And how many republicans wanted that. We can start there.","commenter_a":"@username @username learn from this man. Love you ladies","post_message":"Standing up for his beliefs!"}]
