[{"comment_id":"10153257370521130","commenter_b":"She probably wouldn't be as beautiful as you are","commenter_a":"Mehul","post_message":"He said she looked very beautiful and attractive before marriage, but when he woke up in the morning and found that she had washed the [makeup] off her face, he was frightened as he thought she was a thief."},{"comment_id":"10153293762581037","commenter_b":"Jack, most straight couples procreate. Those who don't are a minority. Marriage rights are supposed to encourage people to procreate so we have The Next Generation. It's just a matter of practicality. If you want to be gay, go be gay. No one is stopping you from being gay.","commenter_a":"Wow....she is EVIL.","post_message":"Ruth Bader Ginsburg, a former civil rights lawyer, has been uncharacteristically outspoken in advance of one of the most significant civil rights decisions in decades - by Liz Goodwin in Yahoo Politics."},{"comment_id":"10154346437467464","commenter_b":"Because of Ted and politicians like him, we are going to have Hillary for president. There won't be a America left for another president. They will bring in millions more illegal aliens that will vote democrat and the republicans will be an endangered species.","commenter_a":"Too bad Cruz's Pride is giving it away to the democrat socialist party!!!","post_message":"Texas is blessed to be home to so many of our men and women in uniform, and El Paso’s Fort Bliss is a crucial base for those who serve on the front lines to keep our entire nation safe and secure."},{"comment_id":"10153162026679091","commenter_b":"Stephanie, he wants ILLEGAL immigrants gone. And Americans have been doing just fine before the influx of Mecican Illegals before and will after!","commenter_a":"He'll be crying when there is nothing for him to eat because its the immigrants that work the field for our food, and run our plants that provide our meat. He wants immigrants gone, he should be the first to leave. Give this land back to native American people, the earth was pure and clean. Be a leader Trump, lead yourself out","post_message":"Donald Trump has released his specific plan for immigration reform: @webpagelink"},{"comment_id":"229274887547012","commenter_b":"Total hero! Heart of gold💛 Communities need to set up places where showers and washer/dryers are available to those in need.","commenter_a":"That was so awesome God bless you it should be more people like you in this world I'll be a better place to live in if people learn to help each other no matter what color we are","post_message":"A California man helps a homeless man get a job."},{"comment_id":"10153322540253271","commenter_b":"It is probably easier to do that surgery when the 'boy is younger He looks better afterwards","commenter_a":"Stupid! I grew up being bullied and NO ONE did anything to protect me. There are better ways to help him with the problem","post_message":"PARENTS: How young is too young for plastic surgery? A 6-year-old boy got his ears pinned back to stop bullies from calling him 'elf ears.'  What do you think? Is this a good way to handle bullying? We're sharing your opinions on 7NEWS at 11:00. @webpagelink"},{"comment_id":"10150721738224999","commenter_b":"To bad nothing could have been done to stop the shooting of the first graders. If Obama wants to stop senseless violence he should stop pursuing senseless executive orders and do something like support Kates law. Crimes that are preventable through deTerence and viligiliant police enforcement can actually stop senseless gun violence. Almost nothing at all can stop a crazy person from attacking an elementary school and killing first graders. Fortunately it is an extremely rare event. The vast majority of senseless killings are actually far more preventable. Obamas convictions are misdirected. How about deporting all the illegals from the country. That right there would prevent thousands of senseless violent crimes. Read the stats. Not all illegals are criminals but none of them have the right to be here so if one of them commits a murder its because our goverment is to spineless to enforce the law. Enforce the ...","commenter_a":"I still think about Sandy Hook so much. I can't get past it. My heart still aches for those precious little ones & I still cry. Thank you Mr. President for taking a step in gun control.","post_message":"Shedding tears over the 2012 deaths of children in a Newtown elementary school, President Barack Obama announced executive actions he will take on gun laws. @webpagelink"}]
