[{"comment_id":"1561742504135313","commenter_b":"Gonna try this for sureeee","commenter_a":"@username yess","post_message":"Making your own crepes is the perfect way to start the weekend. (via Real Simple)"},{"comment_id":"10154335910931130","commenter_b":"Just a joke? Really? So if you ever get assaulted verbally or sexually it's just a joke?","commenter_a":"Oh please. Hillary laughs at getting a guilty rapist off, what does it matter now, and trump was just making a joke. Get real.","post_message":"Talk about RIGGED!"},{"comment_id":"10153526308641509","commenter_b":"Christians are freaked out because there will be more muslims in the world than Christians soon enough...ha, ha...paranoid! Be very afraid republicans and pee farty hatriots oh and BUY GOLD will ya? lol.....","commenter_a":"Relax people, we got those Iranians right where we want them...","post_message":"President Barack Obama says if a nuclear deal is fully implemented, it will prevent Iran from obtaining a nuclear bomb: @webpagelink"},{"comment_id":"1068924329809654","commenter_b":"I would hope so Peter! Because she is a women","commenter_a":"I've always considered myself conservative, I box, hunt, camp, work hard, and don't support socialism, but I believe Bernie is the best canidate.. I know for a fact I'm more manly than the person who typed this weak paper","post_message":"An open letter from a real woman to \"male adults\": \"We can and we should cherish men who exhibit traditionally masculine characteristics. They have made the world what it is today. I raise my glass to you gents. I've even made you a sandwich. But on the flip side of these strapping, rugged men there's you. A Bernie Sanders sycophant with not quite enough self-worth to fill an egg cup. Or a teaspoon. Certainly not enough to fill your bong. Take a good long puff before you read the rest of this, it's not going to get any better. I'm not going to make you a sandwich either. May I recommend a Hot Pocket? What is a man? A man, as defined by this woman, exemplifies the evolutionary behavior of a provider. This can take one of two forms (maybe both) of hunting and/or gathering. The more successful the man ..."},{"comment_id":"10153861358541680","commenter_b":"@username killary has had her head inside hitlers butt","commenter_a":"He'd tap that","post_message":"President Bill Clinton and Melania Trump greet one another before the first presidential debate begins."},{"comment_id":"10152940519275933","commenter_b":"Mr. Kasich is a nice man but Donald Trump is right about everything he states - if we don't deport ILLEGALS then we will have to grant them amnesty. I know the deportation is not feasible - but it could be done but I know it won't happen - but we most certainly should deport the criminals who are here illegally. Illegals should have NO RIGHTS - first of all they break the law when they enter here. I'm voting for Trump. Mr. Kasich - what about OUR rights? Do the citizens of America have any rights ? are we protected any more? Now, what's happened is that these illegals are stuck here - that's why we MUST STOP IT. We cannot support the entire world no matter how sympathetic we are to them.","commenter_a":"The strong leader is not @username......he says deporting 20 million illegals is inhumane! You're part of the problem! How patriotic can you be, how much can you love your country to condone an invasion by 20 million illegals into our country that is now a welfare state with very high unemployment. The 11 million came from the 2010 census.....but many hispanics refused to answer the questionaire out of fear.....also, since 2010, millions more have come acrtoss the border. It's 20 million, folks!","post_message":"America deserves a strong leader back in the White House. America needs John Kasich."},{"comment_id":"10154359999193132","commenter_b":"She is bigger in size for sure","commenter_a":"Even though he won, I think La'Porsha is going to be a bigger star. We haven't seen the last of her. :-)","post_message":"Congratulations to the fifteenth (and final!) winner of American Idol!"}]
