[{"comment_id":"10156323559275294","commenter_b":"I will respond honestly. I am on the fence with medicinal use. Not sure it needs to be legalized for this purpose but not totally against it. I am totally against recreational usage because the bad outweighs any benefits in my opinion. I do not see it helping the economy or benefitting society at all. Plus the 10 only benefitted from the bill did not help and it should be a law only not a change to the constitution.","commenter_a":"To everyone that voted no I want a legit response on to what was so wrong with amendment???","post_message":"Issue 3, which would have legalized marijuana in Ohio, was voted down by a nearly two to one margin yesterday -- but officials with Responsible Ohio say the fight isn't over. Click below for more, including a complete list of election results:"},{"comment_id":"606991596121137","commenter_b":"BLUE LIVES MATTER ! AMERICA SAY'S LOAD THEM UP , HEAD THEM OUT ! NO MORE ILLEGAL IMMIGRANTS BY AIR , LAND OR SEA ! NO MORE NICE GUYS , WE NEED THE RIGHT GUY TO GET THIS JOB DONE ! TRUMP IS THE ONLY CANDIDATE THAT WANTS TO DO THIS JOB / THAT CAN DO THIS JOB , VOTE TRUMP ! BUILD THE WALL AND NEVER FORGET WHAT verry husINsein oBUMa , Killery AND THE DEMislamOCRAPS HAVE DONE TO AMERICA ! PASS IT ON !! MAKE AMERICA SAFE AND GREAT AGAIN , IT'S YOUR VOTE FOR TRUMP THAT WILL MAKE AMERICA SAFE AND GREAT AGAIN !!! THERE IS NO PLACE FOR SHARIA LAW ANYWHERE IN AMERICA , THE CONSTITUTION IS THE LAW OF THE LAND EVERYWHERE IN AMERICA !","commenter_a":"Mr. Trump has this vote locked down in Florida ... hopefully the senators will get back to work soon because Mr. @username starts work on day 1... congress would be smart to have legislation ready to go across his desk","post_message":"GOOD MORNING AMERICA! New CBS poll just released. A strong indication that we are on our way to MAKING AMERICA GREAT AGAIN! Lets keep up the momentum, and have a great day!"},{"comment_id":"10156136666730725","commenter_b":"@username..so the Democrats will bring in foreigners who despise us and our way of life. Yes that will certainly help.","commenter_a":"Why are we not taking care of our homeless veterans better first?","post_message":"BREAKING: Secretary of State John Kerry says the U.S. will significantly increase the number of worldwide refugees it takes in over the next two years to help ease the Syrian refugee crisis ----> @webpagelink"},{"comment_id":"10154424174381162","commenter_b":"It's the Ocean. Dangerous animals live there. Leavem alone","commenter_a":"Or he could have just left it alone and the family move to a safer place? Sounds so unnecessary...","post_message":"A dad celebrating Father's Day wrestling an alligator on a beach before it's able to attack his family and others. FULL STORY: @webpagelink"},{"comment_id":"1907053972848209","commenter_b":"THROW THIS BITCH OUT OF THE COUNTRY. PLEASE","commenter_a":"not my president","post_message":"She isn't backing down."},{"comment_id":"10153986738115667","commenter_b":"She is a joke","commenter_a":"Haters go away","post_message":"\"The American people deserve to get the full and complete facts immediately,\" Clinton said in her first comments about the newly discovered emails. She added that she is \"confident\" the FBI won't change its mind about bringing charges against her."},{"comment_id":"10154333235104726","commenter_b":"So all the gun owners need to boycott Hawaii. See how they do when there money source dries up.","commenter_a":"It's begining","post_message":"Hawaii became the first U.S. state to sign into law a bill requiring all residents who register as gun owners to be placed in a federal criminal records database that monitors them for any crimes committed."}]
