[{"comment_id":"10153148918692217","commenter_b":"@username yeah because he will send you back to Mexico..... and will put a full stop to cross jumping.... All those tunnels on the US border in Texas will also be sealed.","commenter_a":"old news.","post_message":"Using their tune? Donald J. Trump needs to \"Dream On\" 🎶"},{"comment_id":"10155207800518132","commenter_b":"She looks like a drag queen!","commenter_a":"Sad she hates herself so much to keep mutilating her body.","post_message":"Kim Zolciak Biermann is feeling nostalgic!"},{"comment_id":"10153571769331545","commenter_b":"She prolly can throw baseball better than you","commenter_a":"@username hope I look half as good as her if I make it to 105!!!","post_message":"She's 105 and about to make you smile!  Her story: @webpagelink"},{"comment_id":"10154319112003812","commenter_b":"Cover that nipple, girl.","commenter_a":"Time and a place for everything that was not the place. Plain and simple.","post_message":"Woman says she was kicked out of a North Carolina courtroom for breastfeeding during a child custody hearing. \"Ma'am, you need to cover up.\""},{"comment_id":"10153394561766336","commenter_b":"Only one I see judging is you","commenter_a":"Her Christian mother must be so proud. This is why you don't preach and judge. Once you put yourself out there, you are now the target to being judged.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child.  “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"479436158913631","commenter_b":"She is a POS that has never done anything but take all she can get. She's an entitlement ho that plays the race card to get her way.","commenter_a":"VETERANS I'VE GOT NO RESPECT FOR THIS WOMAN WHAT SO EVER.","post_message":"Michelle Obama just made an outrageous claim...  Our soldiers fight and die for our country, Michelle takes lavish vacations.  Do you respect our veterans over Michelle?"},{"comment_id":"10152892448302894","commenter_b":"Guess she should be a chemistry teacher now!","commenter_a":"Damn shame","post_message":"Say What Now? Elementary School Teacher Busted for Having a Meth Lab in Her Home"}]
