[{"comment_id":"10152822886591130","commenter_b":"SHE* isn't 'dressed up as a woman. She is a fucking woman.","commenter_a":"Hold on a minute here, it's make your mind up here time fella/gal or whatever make & model you wake up wanting to be today as others (me) do mind where you take a piss as kids use these toilets and we need to protect from people who don't even know what sex they are from one toilet visit to the next !!!","post_message":"\"How we go about our business is none of yours.\""},{"comment_id":"10156484375905354","commenter_b":"MmmmHmmm so should welfare bitch!","commenter_a":"Chicago thugs on welfare should be fedubded.","post_message":"\"One of our major demands is that police be defunded and that that money used to fund police be used to fund black futures....\""},{"comment_id":"1607625002874515","commenter_b":"Whole Lotta good talking to your imaginary friend in the sky did her...","commenter_a":"Man, I was on Atlantic and Nostrand earlier this year, when Girl must've have been under the influence of this mess dropped her pants and ran across Atlantic avenue into on coming traffic. It wasn't no one but the angels that carried her to the other side of that street... Idk what jumped in my soul, but all I could immediately do was pray over her.","post_message":"Some are calling it 'Zombieland.' Bed-Stuy in Brooklyn is where 33 people were seen wandering around Tuesday, in what police say appear to be K2 overdoses. This video shows some of those who were treated."},{"comment_id":"10154254891359411","commenter_b":"@username I'll piss on your sphincter","commenter_a":"I love anal sex. Anal orgasms are stronger than vaginal ones. Personally, I waited til I had kids to do it coz I didnt want to stretch out both holes, but if teens want to prematurely stretch out both holes simultaneously, that's their business.","post_message":""},{"comment_id":"10153721560403984","commenter_b":"We are protected by the Constitution. Christians founded this country. Gay people are harrassing HER, as there are dozens of other local offices that are issuiing these licenses for them. She is defending her faith and beliefs, not harrassing others. Do away with freedom of religion, and America is nothing.","commenter_a":"500%","post_message":"County Clerk Kim Davis has found herself at the center of a national firestorm after refusing to issue gay marriage licenses, even after the Supreme Court's decision. She's even being dragged to court herself, but she refuses to back down. Do you stand with Kim Davis?"},{"comment_id":"10153431114481782","commenter_b":"@username, so this is a woman? @webpagelink","commenter_a":"It means that a child who is enrolled as a girl goes to the girls' restroom and a boy goes to the boys' restroom, regardless of what's listed on their original birth certificate. Some kids are born with indeterminate sex and as they get older they transition from the sex they were assigned to the one that really fits. Don't make this something it's not.","post_message":"The Obama administration is telling public schools that they must allow transgender students to use bathrooms and locker rooms consistent with their gender identity. @webpagelink"},{"comment_id":"742199012637343","commenter_b":"No sharia law here. Go back where you came from.","commenter_a":"What many have said thy plan to take over the country. CAIR","post_message":"Muslims Trying To Enforce Sharia Law In America Just Got Some Very Bad News [VIDEO] If you are going to live in America, you will have to abide by our laws. Do you think Sharia Law has no place in America?"}]
