[{"comment_id":"929882070454889","commenter_b":"Hillary is only winning by fraud.","commenter_a":"I can't tell the Bernie and Trump supporters apart until they end their angry rants with \"Bernie or Bust\" or \"Make America Great Again\". Two sides of the same coin...","post_message":"\"To be great, we can't be small. We have to be as big as the values that define America. And we are a big-hearted, fair-minded country. We teach our children that this is one nation under God, indivisible with liberty and justice for all, not just for people who look a certain way or worship a certain way or love a certain way, for all.\" —Hillary"},{"comment_id":"10154229601211179","commenter_b":"Ash Kay- see? I'm not the only one thinking this! 😂","commenter_a":"That is sadly amusing","post_message":"via @buzzfeed"},{"comment_id":"10152982403506051","commenter_b":"Good grief....is she for real? She willingly showed up at his house to engage in sex with whom she was gullible enough to think was a male model... Really?????????? She DOESN'T have a leg to stand on in court... STUPID does as STUPID is...smh","commenter_a":"She had to be incredibly stupid and he is a douchebag","post_message":"A woman thought she had been chatting online with this man. They met in a dark hotel room and she wore a blindfold while they got intimate. When she took it off, she saw someone she wasn't expecting."},{"comment_id":"525682007598270","commenter_b":"The man is awesome!","commenter_a":"Yes Ben Carson Says truthfully he is an OBAMANITE~~~ TRUST HIM....!!!","post_message":""},{"comment_id":"1150655941656075","commenter_b":"@username SUCKER !!!","commenter_a":"We wish no illness upon Secretary Clinton, but the reality is if she steps aside and you become the nominee, the democrats will win the White House with a double digit lead. If she decides to be selfish and stays in, Trump will win. #bringbernieback","post_message":"The United States has the duty to guarantee equal opportunity and justice for all citizens, including our Native American brothers and sisters. And let us be honest and acknowledge that we are not doing that today."},{"comment_id":"1813669392186653","commenter_b":"I believe the only way to stop 5.O Is to kill em all Or stop bitch in, the popo gotta Gun n they Evil law,,Bt every nigga in the hood can shoot back,so kill em before they kill one u","commenter_a":"America you're gone so far.","post_message":""},{"comment_id":"10153214662726130","commenter_b":"Mmmm lies","commenter_a":"@username Sezer Yazar Karl Ervine","post_message":"This. Is. Amazing."}]
