[{"comment_id":"1224318647634888","commenter_b":"@username BUILD THE WALL PUSSY. BYE BYE.","commenter_a":"LOL AYEEEEE","post_message":"Aren't teachers suppose to be the example? #WSHH"},{"comment_id":"10153244744761378","commenter_b":"Stfu","commenter_a":"Stop chasing people in residential communities!","post_message":"DEVELOPING: Police tell Action News officers were chasing a sedan when the driver lost control, hitting several parked cars, trapping one person in the wreckage. It began before 7:00 this morning in Glenolden, Delaware County. @webpagelink"},{"comment_id":"10153587068405329","commenter_b":"Dolphins are such vicious, terrifying monsters!","commenter_a":"@username \"It hit my wife and knocked her over, and punched my daughter.","post_message":"The dolphin jumped in, broke someone’s ankles and “punched” a 16-year-old girl."},{"comment_id":"10152950876076130","commenter_b":"They're such bitches.","commenter_a":"Emma Green @username","post_message":"\"I cleaned the counter for you.\""},{"comment_id":"1267878706625395","commenter_b":"I'm pretty sure she wouldn't need your worthless vote anyway. Trash","commenter_a":"Can't wait til January 20th when your gone!! If you run for president in 2020 you won't get my vote! You put your nose into eating healthy school lunches thatgo into the trash everyday and restaurants.","post_message":"Happy Birthday to outgoing First Lady Michelle Obama!"},{"comment_id":"1032739630099842","commenter_b":"Bigotry must be confronted every time it raises it's ugly head. Shamefull Republicans","commenter_a":"Newsflash! Only God can judge. These so-called phony 'christians' will go to hell before anyone else....","post_message":"A Florida church and anti-gay pastor saw a quick backlash from residents of the community after putting up a hateful anti-gay sign."},{"comment_id":"1133405013362371","commenter_b":"She looks that way from years of only having a tiny withered Cheeto to satisfy her","commenter_a":"Why does every picture of Melanie look constipated or disgusted. Her eyes are always squinted, and her lips are always tight. I mean it is not a happy look. This is not a rant because she is female, and it is not a comment on her worth or attractiveness. It is a comment on how people show expression in their face. She doesn't look happy at all.","post_message":"Could you imagine the right-wing reaction if the Obamas did this?"}]
