[{"comment_id":"10152817930862169","commenter_b":"Because vaccines are no longer mandatory and with all the immigrants coming into the country are bringing the diseases and worse into America. And our govt doesn't give a crap.","commenter_a":"bandwagon idiocy","post_message":"Tonight on FRONTLINE: How the Disneyland measles outbreak has redrawn the battle lines in the bitter vaccine war. @webpagelink See it at 10/9c"},{"comment_id":"10153611687931602","commenter_b":"And the fact that a grown woman liked it is equally disgusting. Grow up","commenter_a":"You know who also spoke his mind? ... Hitler.","post_message":"\"Trump? I love everything about him,'' said one voter. \"He speaks his mind and doesn't care if he offends anybody. He's saying, 'This is who I am — take it or leave it.'\""},{"comment_id":"10153653685189099","commenter_b":"Go burn your bra somewhere else please","commenter_a":"If she got things done Monica wouldn't have had to step in.","post_message":"Asked whether she's progressive or moderate, Hillary Clinton described herself as a \"progressive\" with \"a long history of getting things done\" @webpagelink #DemDebate"},{"comment_id":"10156091487575389","commenter_b":"They're socialists, not Americans. They should be deported with the illegals.","commenter_a":"I think they would vote for Hitler if he ran as a democrat. SO many in this country have no concept of reality any more.","post_message":"Question of the Day: Do you think Bernie Sanders can beat Hillary Clinton in Iowa and New Hampshire?"},{"comment_id":"602611366596109","commenter_b":"She needs to shave her pits.....ugh, she's so nasty!!!","commenter_a":"remember...she is a singer, she is a singer, she is a singer,.....","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'. This is unacceptable, we stand against Miley 100%. Do you agree Miley should be kicked out of the country?"},{"comment_id":"10153069061709342","commenter_b":"Has She wore it all year? Then it would of been out of respect and not show","commenter_a":"Let her wear it!!!!","post_message":"A Native American high school senior is fighting for her right to wear an eagle feather with her cap and gown. She says its about respecting her heritage. School officials call it decoration."},{"comment_id":"10158298295275206","commenter_b":"@username Memisevic you want to be a victim so bad. Girl go lay down.","commenter_a":"This is exactly why NFL players are doing what they are doing, and you are pissed at them!?","post_message":"“We saw that Terence did not have any weapon. Terence did not make any sudden movements. We saw that Terence was not being belligerent.”"}]
