[{"comment_id":"10153445751101782","commenter_b":"for the people that want abortions i ask you one question why did you allow yourself to get knocked up in the first place?","commenter_a":"Thank God!","post_message":"Gov. Mary Fallin has vetoed Oklahoma's anti-abortion bill."},{"comment_id":"10154071433569778","commenter_b":"You know him or something?","commenter_a":"Gordon","post_message":"A 9-year-old boy beaten by his mother's boyfriend over birthday cake died from his injuries."},{"comment_id":"10153888604683812","commenter_b":"Bye dumbass. Take the illegals with you, of ALL nationalities","commenter_a":"I respect our president and all past Presidents. I will respect all future Presidents. ( unless Donald Trump is elected, I will move to MEXICO AND HELP BUILD THE WALL!!!!!!)","post_message":"President Obama has joined Facebook! Here's what the President wrote in his very first post: @webpagelink"},{"comment_id":"10153839661300950","commenter_b":"Hell NO! I won't vote for that woman!! She needs to be in prison!","commenter_a":"Don't believe Trump - don't believe Trump Campaign VOTE HILLARY VOTE TIM KAINE VOTE DEMOCRAT","post_message":"The Democratic nominee will tie Trump to the 'alt-right' in a speech on Thursday."},{"comment_id":"10153573437688984","commenter_b":"That makes sense since she's a woman","commenter_a":"Bruce Jenner is a disgraceful, sick, fake excuse of a man. ..","post_message":"Wow. Franklin Graham just made a massive statement about 'Caitlyn' Jenner on Facebook... now it's going viral.  Nearly half a million people just 'liked' this post... because it's absolutely perfect.  Spread this absolutely everywhere."},{"comment_id":"1739251936290298","commenter_b":"exactly. Women belong in the kitchen, this is stupid.","commenter_a":"Great. Ahmed, the suicide bomber, will be next. Anything to appease the muslims, right?","post_message":"The six-year-old girl is the first-ever Afghan Muppet, and she is aimed at promoting female empowerment in Afghanistan."},{"comment_id":"729424187224050","commenter_b":"'@username , The Refugees and Illegals are Already receiving benefits. THEY ALL have more benefits and Rights than the average American Citizen does!!!","commenter_a":"You want your kids seat taken at school? You want grants and scholarships used and sucked up dry by illegals and refugees? There are terminally ill, Vets, single mother and fathers and maybe you someday may need those welfare and social security benefits..but its not going to be there because of illegals, refugees, mouches and leeches will suck it all up dry...VOTE #TRUMPPENCE","post_message":"The apple doesn't fall too far from the tree..."}]
