[{"comment_id":"10154080065336051","commenter_b":"@username you just piss yourself when you see women.","commenter_a":"The \"man\" isn't qualified to even be mentioned for the job. Donald J Trump is a complete and utter embarrassment to our already great nation","post_message":"The majority of Americans say that Trump is not qualified for the presidency. Do you agree?"},{"comment_id":"10153395749836336","commenter_b":"Well what if I said I'm tired of boarder jumpers and we need a 50' tall concrete wall put up to keep them out cuz I'm tired of dealing with them. But I do love Mexicans. I mean all of it. I love the ppl just don't care as much for those who try to come to the states illegally.","commenter_a":"I'm totally on Trump's side here. The U.S. does need to end its TPA with ALL FOREIGN COUNTRIES! Regardless of how the ppl feel. Mexico is taking this offensively because they know that Trump will keep his word, he will stop doing business with them, he will put up a wall to stop immigration and Mexico doesn't want to deal with losing our money and then having to take care of all of their people who have illegally made a life in the states and are sent back to their homeland. I think the U.S. should do as Canada does and anyone who wants to become a citizen should have a sponsor.","post_message":"“I’m going to have to sue Univision now.” Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10153096190609614","commenter_b":"What kind of women gives up their child?","commenter_a":"Great daddy! This baby is so LUCKY to have such loving and loyal to baby kind of daddy!","post_message":"After this baby mom abandoned him because he was born with Down syndrome, his father stepped in to raise the son he calls and as a single dad. Leo Forrest was born in Armenia last month. Upon learning of the genetic condition, his mother and her family gave up on the child. They also told Samuel Forest he would no longer be welcome in their home if they decided to keep him, according to a GoFundMe page set up to help Forrest and the baby. Faced with a difficult choice -- his wife or his infant son the new father chose Leo. She has since filed for divorce, he says. Forrest is returning to Auckland, New Zealand, where he is originally from, to raise the baby. Read KTLA story here: @webpagelink"},{"comment_id":"1054929361214588","commenter_b":"She* is a woman.","commenter_a":"Sorry Siri, but according to his DNA, he's still Bruce! A rose by any other name.....","post_message":"Siri knows Caitlyn's name and she's going to correct anyone who forgets."},{"comment_id":"1160837804033382","commenter_b":"This is so STUPID....If you dont like America LEAVE","commenter_a":"National Guard please.","post_message":"Protest in dc"},{"comment_id":"10153090141861680","commenter_b":"So what? Nothing should be said about mass shootings? Thugs and criminals are not mass shooters. There is crime everywhere. In every state and city. Our second amendment has been a shield for evil doers. Most criminals and thugs or gangs are trying to survive a life of under privilege and zero opportunities...jmo","commenter_a":"I live in the Atlanta area and every day, I say again, every day there are 3, 5 and some days more murders, carjackings, home invasions, bank robberies all committed by thugs, gangs and criminals. Yet, you don't hear one word, not one word of anger or control to get the guns out of the hands of these criminals. There are more murders in one week in the Atlanta area than the 10 souls that were lost in Oregon. If politicians really cared about every life, there would be more done to dismantle the gangs and thugs in our country. But instead all they care about is how they can take advantage and politicize a senseless crime to advance their agenda to take guns away from US citizens. They know that CRIMINALS DON\"T CARE ABOUT THEIR F'n LAWS!!!! So their true intentions must be to disarm the people.","post_message":"POLITICO takes a look back at some of his stronger words on the issue."},{"comment_id":"807827122679666","commenter_b":"@username I think that the Muslims that really care must get out the message open the Mosque no more secreats or hit the F g road and go home two sharia law","commenter_a":"I'm so sorry for any Muslim reading these comments. Truly. People are so horrible. I can't belive I identify as a Republican along with this people. You are welcome in my world.","post_message":"Ban all Muslims? Seriously, Donald J. Trump? #GOPDebate"}]
