[{"comment_id":"860452347398311","commenter_b":"What an idiot, can she really be this stupid? If this passes for high intelligence, I must be a genius","commenter_a":"You really cannot fix stupid","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153578637147235","commenter_b":"How much you wanna bet that this nut case is a conservative?","commenter_a":"1st class white privilege on display. We'll get you and your little dog, too!","post_message":"This is insane!"},{"comment_id":"10153163075739091","commenter_b":"Resorting to name calling shows the classless women you are! Good job!","commenter_a":"What? Do you want him to ride public transport?! He's the NEXT PRESIDENT OF THE UNITED STATES!!!! #TRUMPTASTIC Man!!! @webpagelink","post_message":"How Donald Trump does jury duty... here's his arrival at a NYC courthouse. STORY HERE: @webpagelink"},{"comment_id":"10153987601378908","commenter_b":"And another commenter who didn't read the article.","commenter_a":"And this is the article that should prove to all of you that collective evolution spreads bullshit ... Yellowstone has a big herd over 4000 bison .... And they are to slaughter 4-600 of them to prevent spread of disease !!!!!","post_message":"Park rangers have begun capturing wild bison in the Stephens Creek trap within Yellowstone National Park. Since Feb. 20, approximately 150 of America last wild buffalo have been trapped. According to park officials, all are destined for slaughter."},{"comment_id":"10153854981326509","commenter_b":"No mardi, flo is absolutely correct. There's no mass influx of Mexicans if that fence comes down. They can already cross the border with very little paperwork anyhow. Your fears are quite blown out of proportion.","commenter_a":"Highly dislike this man. He's everything America doesn't stand for.","post_message":"To quote the businessman himself, Donald J. Trump seems to be a 'very rich' man. @webpagelink"},{"comment_id":"1482796298404171","commenter_b":"'@username that's such a nice thing to say","commenter_a":"As an Asian non-American, I have a lot of similar feelings with people from the video. However, one thing I do not share is the that even I am not American, not born here, you still don't get to say 'go back to China' to me. I go where I want and I came here legally. America could be more friendly.","post_message":"An editor for The New York Times wrote an open letter to a woman who told him to 'go back to China.' Asian-Americans responded by sharing their own racist moments using #thisis2016. Here are some of those moments.  Warning: This video includes racial slurs and vulgarities."},{"comment_id":"10152723867461680","commenter_b":"No, LIb. First of all you ASSume that every business owner in the country is a Republican, which is just more made up shyte by a LIb. Secondly, its called supply and demand. By flooding the labor market via illegal immigration and REWARDING illegal immigration, Libs increase the supply of labor in relation to the demand for labor, which lowers the price of labor.","commenter_a":"IT is amazing how those who vote republican seem to forget that Reagan and both Bush's gave amnasty to illegals, Reagan even went on to say that he would like to see an open border where the Mexicans could come and go any time they wanted, For all of you simpleminded republicans who want proof you have a computer look it up,","post_message":"Texas and other states suing over the moves say that only Congress can authorize the kind of sweeping actions Obama took."}]
