[{"comment_id":"10155618787016002","commenter_b":"Only if you are a pussy","commenter_a":"I thought dodge ball was thought to be bullying.....","post_message":"Note to self: Don't play dodgeball with softball pitchers."},{"comment_id":"10152972310600950","commenter_b":"She didn't have to do or not do anything. Her life doesn't go by some imaginary rulebook that you made up for social and community etiquette in the trans community. She can do whatever she wants however she wants, regardless of who it offends.","commenter_a":"If you have to ask if you are supporting your community the right way, then maybe you should be questioning your actions in the first place and the reasons behind them. He/she should have started a discussion forum with the transgender community prior to his/her transformation","post_message":"Caitlyn Jenner is starting to write about \"serious issues and lessons that I am learning through this process.\""},{"comment_id":"1153444948105615","commenter_b":"To bad she didn't get her way !!! Sick ass bitch !! And fugly as shit too !!! F&skin cry baby !!!","commenter_a":"Are you all that stupid she treats everyone that way she belives you all our not to smart","post_message":"THIS sounds about right. @webpagelink"},{"comment_id":"1749284951998475","commenter_b":"I love this","commenter_a":"@username @username me in second year","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"},{"comment_id":"1103535999742651","commenter_b":"she is at best...an annoyance...go home and look for russia...","commenter_a":"I spent ten years in the military just got home three years ago been through all sorts of problems and have been diagnosed for ptsd and through everything that's been going wrong since I've been back I still never not once didn't have control of myself even when I caught my ex-girlfriend of six years sleeping with a coworker of hers she started seeing when I was on duty.I just asked her to I'll say made her move out. And every brother from the core I was at salute President Obama and there were over hundred of thousands of us there so don't believe what people are saying here about the military disliking President Obama we salute you sir.","post_message":"“What did I say that’s offensive? I don’t regret any comment I made, because I didn’t lay PTSD at the foot of the president.\"  - Sarah Palin"},{"comment_id":"1013523678688104","commenter_b":"Stupid bitch !!","commenter_a":"Shameful","post_message":"Comedian Ricky Gervais was so appalled by the image of Rebecca Francis grinning next to the freshly-killed giraffe that he tweeted it to his 7.52 million twitter followers, and almost broke the internet."},{"comment_id":"10156320084670354","commenter_b":"The most disgusting women on this planet !!!!","commenter_a":"why are these women so adamant on murdering of innocents?","post_message":"WATCH Whoopi Goldberg and Joy Behar unload on Dr. Ben Carson..."}]
