[{"comment_id":"10153122540893984","commenter_b":"This lady need to go and get a life !!!","commenter_a":"She hit the old nail right on the head! Hopefully, this congress will \"grow a pair\" and knock him right off his \"High Horse\"!","post_message":"This lady's fightin' words will get your blood flowing on a Monday.  Do you support this kind of boldness on Fox News?"},{"comment_id":"1283300368381949","commenter_b":"Sonny Omelis hmm what do you think?","commenter_a":"Jaouad Jijeli","post_message":"...leaving Paris and New York in its wake!!!"},{"comment_id":"1223281327711322","commenter_b":"PUT HER IN JAIL.","commenter_a":"They couldn't vote for her if she was in prison where she belongs America needs JUSTICE","post_message":"Read WHY!! @webpagelink"},{"comment_id":"10156228497460725","commenter_b":"Evil woman with lying eyes.","commenter_a":"Socialist controlled media ?","post_message":"Hillary Clinton is on the front page of The New York Times waving to 200 people in New Hampshire. My crowd next door was 5,000 people – no pic!"},{"comment_id":"1412614535483745","commenter_b":"Hey opee what the fuck did you ever do for our country. Not a damn thing. Any thing you have to say a worth shit. And as far as that POS obummer did even less.","commenter_a":"Keep you nose out of politics...you are best doing commericials for Weight Watchers...I am sure you need the money! Why don't celebraties keep their big mouths shut!","post_message":"This is a coordinated, collaborative effort on the part of the news and entertainment media to destroy Donald J. Trump, his administration, and the half of the country who supports them.  But notice the part of the Oprah story the media WON'T want to report."},{"comment_id":"10153122769748145","commenter_b":"Vote the hurricanes out!","commenter_a":"Already started ;)","post_message":"Today is the start of the 2015 Hurricane Season! Are you prepared if a big storm hits Central Florida? #WFTV Check out these must-have supplies: @webpagelink"},{"comment_id":"1755937964626463","commenter_b":"Then. Fuck u bitch","commenter_a":"He also said white people are the Devil, that Jews and whites are evil and he proposed racial segregation in his speeches to the Ku Klux Klan. Be like him? No thatnks","post_message":"He was truly the greatest, and not just because of his accomplishments inside the ring.  The Free Thought Project  #RIP #MuhammadAli"}]
