[{"comment_id":"10153664912304726","commenter_b":"There are Syrian refugees already there!!","commenter_a":"Yeah, let the refugees all live at the vatican. they got lots of money and plenty of room.","post_message":"The Vatican keeps out the throngs while the Pontiff urges the U.S. to open borders."},{"comment_id":"10153171709824456","commenter_b":"HISTORY","commenter_a":"I am so glad I took part in history glad to be a Masonic brother","post_message":"The march to Montgomery is underway...  @webpagelink"},{"comment_id":"1916222085104197","commenter_b":"I thought Barbie vaginas were that lot marching in London recently lol","commenter_a":"Haha a what can I get a KenCock then in bits ere me like!!!","post_message":"Increasing numbers of women are going under the knife to have a 'Barbie vagina'  as a result of watching internet porn"},{"comment_id":"10154724995284197","commenter_b":"Good dog. Take a bite out of crime!","commenter_a":"Another morning of bumper to bumper. And another police chase. Thank goodness no innocent people involved.","post_message":"JUST IN: #Milford police said they were pursuing shed burglary suspects down I-95 when it resulted in a crash with one of their own cruisers: @webpagelink"},{"comment_id":"10154725067651341","commenter_b":"Now I wonder which side is truly the terrorist nation","commenter_a":"'Netanyahu Warned New Zealand It Was Declaring War' - what, by adhering to international law which was administered to PREVENT war?? Repeatedly violating resolutions and stealing land on some warped justification of ancestors IS a declaration of war!!! Thanks Israel for finally showing your true colours to those who remained unsuspected and blind to your callous actions.","post_message":"EXCLUSIVE: New details on Israel's last-ditch scramble to stop the UN settlements vote"},{"comment_id":"760301420735133","commenter_b":"She should be Punished!","commenter_a":"Smh so much attention on my comment i got exactly what i was looking for... #Exposed","post_message":"Terrible."},{"comment_id":"10153753811221051","commenter_b":"So tell me, how does a colored woman have a bronzed beachy glow? They want whites only.","commenter_a":"Oh lame. So now every ad for everything (make-up, sports, clubs, restaurants...) has to have a picture of male and female, old and young, straight and gay and transgendered, and ever single culture/race, etc. on EVERY single ad so as not to exclude? STOP IT.","post_message":"It only took a few hours for this photo to spark outrage. Take a look and decide for yourself if it's worthy of the controversy."}]
