[{"comment_id":"492044497655936","commenter_b":"Is she for real? Did someone really vote her stupid ass into office?","commenter_a":"Elizabeth Warren is a Douchebag","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"699361250167548","commenter_b":"Terrorist and traitor!!! And an illegal!!","commenter_a":"The Wall of China has worked tremendously for China. Id expect the same results here","post_message":"“Good luck with that…We’ve got serious problems here.”  President Barack Obama addressed Donald J. Trump's plans to build a wall and get Mexico to pay for it."},{"comment_id":"1184451798317737","commenter_b":"Foolish, foolish woman.","commenter_a":"SHE IS INSANE TO WANT DONALD TRUMP! I HOPE SHE KNOWS THAT SHE AND ALL THE REST WILL BE THROWN OUT ON THEIR HEADS!!! CAN NOT BELIEVE THIS!!!","post_message":"Saba Ahmed is trying to convince other Muslims to support Donald J. Trump."},{"comment_id":"1448117561874659","commenter_b":"They generally don't prohibit it but they train the employees to give the robbers the money because the owners have insurance for that.","commenter_a":"Looks like 30 people who should have been able to defend themselves and their businesses.","post_message":"A trio of armed teenagers is now accused of more than 30 robberies across King and Pierce counties."},{"comment_id":"1561091183908226","commenter_b":"I'll contact everyone of these cunts. I'll fly our and found your bitch ass into the ground since they are so profoundly sure I am not the face of death they never danced with. Boom...","commenter_a":"Boo hoo, my pussy hurts because I didn't get my war queen!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1227725310657052","commenter_b":"Please don't reproduce.","commenter_a":"Trump incites violence. He is bringing the racists out in droves and he is dividing this country. Since he came on the scene, there has been more hate crimes than I've ever seen. Wake up people!","post_message":"The sniper attack on Dallas police officers now ranks among the deadliest against U.S. law enforcement since 1900."},{"comment_id":"10153868198207994","commenter_b":"There is a need to protest because even though this vile cop has been charged, he hasn't been convicted. We know how sympathetic jurors are to police. Hell most of the people commenting here would probably find him not guilty. This is more than just one bad cop. This is institutional.","commenter_a":"I sure hope it don't escalade into a riot and looting, that's all Chicago needs","post_message":"Protesters are beginning to march in Chicago right now just after disturbing video of a white police officer shooting a black teen was released. CAUTION: Viewer discretion is advised."}]
