[{"comment_id":"10154550859487464","commenter_b":"There are much better health coverage alternatives out there. Feel free to private message me for details.","commenter_a":"We tax payers all got fleeced big time.","post_message":"“The reality is the Affordable Care Act is no longer affordable for increasing numbers of people.”  #FullRepeal: @webpagelink"},{"comment_id":"10152727652141051","commenter_b":"LOL dumb ass bitches","commenter_a":"Wow how sick.could they wait until they got home","post_message":"These two women were chased out of a movie theater bathroom because the security guard thought they looked too much like men."},{"comment_id":"10158042812305551","commenter_b":"I have trouble with Rhinos who profess to be one thing, but are LYING. I have not trusted John McCain for several years. I am beginning to wonder about Marco. Time will tell. As for Hillary and John Kerry, They are trying to destroy what America stands for and that is FREEDOM. Than there is Eric Holder who along with Obama and Clinton, sold guns to Mexico Mafia. Corruption is what WE THE PEOPLE are sick of.","commenter_a":"Trump is right again. John McCain is no war hero and never has been.","post_message":"Two Senators Have a Problem with Tillerson, but not Hillary Clinton or John Kerry"},{"comment_id":"847928802003105","commenter_b":"I am not Impressed with a government that steals elections so they can choose the president.","commenter_a":"This will give Rise to the Libertarian party who is right now starting to gain traction The GOP thought they had issues with @username...they wont be able to control a Libertarian Party candidate The establishment is destroying their 1 party 2 party system .... Thank you @username even if you get screwed out of the nomination you have accelerated the cause of freedom and liberty","post_message":"This is happening all over our country—great people being disenfranchised by politicians. Republican party is in trouble!"},{"comment_id":"1708937832702911","commenter_b":"I would like one illegal immigrant or one Mexican to please answer this question. Why is an American considered a racist because we want a wall to control the people that we allow in this country. You just can't have open borders and allow anybody and everybody to come in that is not a country anymore. Furthermore why is it that Mexico has a Huge fence with Barbwire and guards in towers with rifles by the Mexican Guatemala border??? What hypocrites!!! Maybe because Mexico does not want illegal immigrants coming into their country from the Guatemala border but Americans are racist if we don't want illegal immigrants coming into our country. Totally absurd!!","commenter_a":"And they have the Bundy 's in jail and killed Levoy . These violent protesters get to go home alive .","post_message":"HOW INSANE! Photos and videos you must see from last night:  @webpagelink"},{"comment_id":"10153567353788984","commenter_b":"I will have one long after your ass is gone","commenter_a":"that just show the driver of the truck isn't paying attention what is going around his ride. That ass hole would be wearing salt rock in his britches","post_message":"I don't care what your opinion on the Confederate flag is, there's no denying that what this guy did is truly insane..."},{"comment_id":"1445788068782419","commenter_b":"If that bitch wins it will not be USA any more cause she will screw it over and over. Immigrants will take over.","commenter_a":"Never Hillary","post_message":"ELECTION POLL! Who should win the 2016 Presidential election?  LIKE Qpolitical for the results."}]
