[{"comment_id":"10153337670592061","commenter_b":"Omg your so ignorant lady!","commenter_a":"I've had enough of this 'let's show black crimes in the news disproportionately bs' what's up with those occupy federal land militia and who's going to right the Steve Avery corruption wrongs. What he has to be an affluenza to qualify for civil rights in America?","post_message":"WATCH: Kidnap victim explains how she escaped after an alleged carjacker jumped into her car and forced her to drive nearly 150 miles: @webpagelink"},{"comment_id":"10153099040499726","commenter_b":"I'd like to get rid of your ass.","commenter_a":"Just another lie.","post_message":"WATCH: Democratic Representative: 'Tea Party People' Want To Bring Back Segregation, Get Rid Of Women's Rights."},{"comment_id":"10154184530456167","commenter_b":"And before anyone gets on me for it, personhood is moot and an unsupportable argument because of bodily sovereignty. Nobody, adult or child or fetus, is entitled to use someone else's body parts without their permission, EVER. If you have kidney disease you don't get to take someone else's kidney by force - not even if your life depends on it and you'll die painfully if you don't get it. If you have leukemia and need bone marrow, you cannot take it from someone else without their consent - even though marrow is fully replaceable by a healthy adult and it'd only be a temporary inconvenience to them. Men can't use a woman's genitals for their own pleasure unless she consents - that's why rape is (supposedly) a crime (even though punishment for it has been tragically lax these days). A woman's uterus is HER body part, she has it ...","commenter_a":"It's just a political witch hunt, like usual. It's not about women's safety or anything like that - it's about earning points with their base on the backs of Texas' poor women.","post_message":"**Fourteen** investigations have cleared Planned Parenthood of all wrongdoing, for starters."},{"comment_id":"1746704652254245","commenter_b":"Wow really Michelle Pugh, you put yourself in that situation for sleeping with her father' a married man: but you won't tolerate public shaming Really looks like an excuse to try to squeeze money out of someone which is his daughter SMH say;s a whole lot of type person you are!!!!!!!!! No class!!!!!!!!!!!!!!!!!!!!","commenter_a":"Nasty is all I can say","post_message":"Michelle Pugh's life has changed dramatically in the short few months since her four-year affair with Ozzy Osbourne was revealed."},{"comment_id":"598432576983363","commenter_b":"No it's only ok for racist rednecks to say shit like that. Those lost European immigrants who assume they're original Americans.","commenter_a":"Too bad Trump wasn't on it.","post_message":"'Looks like yet another terrorist attack,' Trump tweeted. French and Egyptian authorities have repeatedly warned against such speculation."},{"comment_id":"10154506279023812","commenter_b":"Lana Mushamel Rico","commenter_a":"Rip Rico!","post_message":"Marine combat dog that served two tours in Afghanistan and went on 240 missions is laid to rest. RIP Rico."},{"comment_id":"804306716336257","commenter_b":"I have no problem with that bitch being on Air Force one. If they are traveling for her campaign then she should be flipping the bill for the personnel onboard, food consumed and fuel. I would much rather see her ass sitting in a jail cell though.","commenter_a":"SCREW THEM BOTH","post_message":"Donald J. Trump's wondering why President Obama's allowed to hit the campaign trail with Hillary Clinton on Air Force One: 'Who pays?'"}]
