[{"comment_id":"1033509070100318","commenter_b":"@username yes you god damn do! Women throw sex parties and drink alcohol through dick straws for Christ sake! Most women are guilty of cheating at some point in their life. That's what we as a species do, we eat and have sex. Like or hate it, men hunt for women and women love it","commenter_a":"I find it very sad that WOMEN are defending it, what the fuck is wrong with you? I'm sorry you feel that you should allow a man to have his way with you. It's sickening.","post_message":"EPIC! Oh, and the woman in red is a REPUBLICAN! This happened tonight on CNN. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"10153633611351337","commenter_b":"Joey Nicgorski Edward Contreras","commenter_a":"Thank god!","post_message":"POSSIBLE REUNION? Slash reveals that he and Axl Rose are buddies once more. What does this say for the future of Guns N' Roses?"},{"comment_id":"10153598011598812","commenter_b":"She is like.... Told you to stay away from those blonde white bitc... lol","commenter_a":"With his mommy right beside him worried about where her money is going to come from now","post_message":"Former FSU quarterback says \"I totally should have walked away\" after video surfaces showing him punching woman in the face."},{"comment_id":"10153101171403417","commenter_b":"Put sheldon Silver in JAIL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"I wonder why it seems that so many Americans take homeland security so lightly?","post_message":"Last night on CNN, I discussed the impact of #Blizzard2015 on Long Island as well as security concerns after a drone crashed on White House grounds. Watch: @webpagelink"},{"comment_id":"930468930346189","commenter_b":"It's an interesting idea but she is much older. Re pose these with young girls and I guess there would be little difference.","commenter_a":"Stop making stupid people famous","post_message":"Fashion ads recreated by a normal woman"},{"comment_id":"1054288197942749","commenter_b":"Even if that is the case (and that is some BULLSHIT) that is not what the feminist gender gap argument is all about. What happened to you is illegal, what THEY are bitching and whining about is NOT, nor should it ever be.","commenter_a":"And many women support kids on what they earn while the fathers of their children do no pay child support. Talk about discrimination!","post_message":"BOOM!"},{"comment_id":"10154421194676545","commenter_b":"My tax dollars sometimes pay for things I don't necessarily agree with. It's called living in society. Grow up.","commenter_a":"Defund Planned Parenthood.","post_message":"She will be the keynote speaker at Planned Parenthood of Greater Texas' annual Fort Worth luncheon."}]
