[{"comment_id":"10153528631451955","commenter_b":"What a cunt! I hope she ends up in jail!","commenter_a":"She's been divorced 3 times. If god forgave her for that 3 times, he'll forgive her for issuing a gay marriage license once haha","post_message":"DEFIANT: Judge orders KY clerk to appear in court after she again denies gay marriage licenses..."},{"comment_id":"1227830950637889","commenter_b":"What a idiot, Mexico is NOT going to pay for any wall","commenter_a":"the worst. the absolute worst.","post_message":"With the inauguration only 15 days away, how are you feeling?  Here's what Donald J. Trump says he will do during his first 100 days in office: kiro.tv/TrumpsFirstDays"},{"comment_id":"10154073514135950","commenter_b":"Are those ACTUAL immigrants or illegal trespassing criminals?","commenter_a":"'Anyone not willing to accept the results of an election is a danger to democracy.' ~ Hillary Clinton","post_message":"Immigrants and their advocates take to streets in major cities from coast to coast to voice their dissent."},{"comment_id":"10153656357399726","commenter_b":"Gray is a puss !","commenter_a":"Not just NO but Hell No! Graham cracker thinks alot like Obummer!","post_message":"Should Ben Carson apologize?"},{"comment_id":"10153949454199087","commenter_b":"This idiot is a democrat? I bet no one saw THAT coming...","commenter_a":"Send this loser to another planet.","post_message":"Democratic congressman Hank Johnson on Monday compared Israeli settlers to termites while discussing Israel-Palestine relations."},{"comment_id":"1150215321713025","commenter_b":"Yes and I only saw a women that look drugged","commenter_a":"YES YES YES! Are you guys blind. I only saw a pathetic man sniffing,drinking water, making faces. acting like the idiot he is. Never answered a question. Talked about himself. Never said what he would do as president. Next to him stood a confident women who answered questions, with plans for our country future.","post_message":"Would you like to see Hillary Clinton win big this November?"},{"comment_id":"755539251303319","commenter_b":"Send the bitch to jail and strip the bed sheets off of her","commenter_a":"Your in US lady you must obey the law... I'm sure when your in Muslim country your not even allowed to drive ....","post_message":"Burqa-Clad Woman Pulls Race Card On Cop, Gets Brutal Wakeup Call That's not how it works in America... Sorry. Do you think she got what she deserved?"}]
