[{"comment_id":"10153448398281350","commenter_b":"She lied to get jobs","commenter_a":"Why is ok for Bruce Jenner to claim to be a woman and not ok for Rachel to be black if that is what she wants ?","post_message":"\"I did feel at some point I would need to address the complexity about my identity.\""},{"comment_id":"960457477322681","commenter_b":"Hunt these cops! Good Germans would say this!","commenter_a":"police state","post_message":"Officer Thomas Webster was just found not guilty of assault... even though he was caught KICKING and UNARMED MAN IN THE FACE as he obeyed police commands.  This is America, 2015. Not the Jim Crow Era.  From (Y) Counter Current News - MBD"},{"comment_id":"10155064838244497","commenter_b":"Cankles, in Hillary's case","commenter_a":"Mike Pence is worried that those shameless hussies will show a flash of their ankles during the march.","post_message":"\"I can tell you how let down I feel by the heads of these households who did not simply give their wives and daughters a firm, decisive  when they asked to participate in today demonstration.\""},{"comment_id":"10153580364618797","commenter_b":"Lol @username she's definitely stupid and disgusting. ..","commenter_a":"Nothing racist about my comment! i simply wouldn't have called anyone to help. Now be mad if you like so what because","post_message":"WOW! A police officer collapsed on the job. The teen in handcuffs whom he arrested was sitting right there.   What the teen did next saved the officer’s life. See here:"},{"comment_id":"451917294996564","commenter_b":"As far as I know, no Subway in America has made this kind of change.","commenter_a":"So how many muslims vs AMERICANS are there in the U.S. that needs changes. REALLY?","post_message":"Should we boycott Subway?"},{"comment_id":"558362490993134","commenter_b":"Why is it we are so intent to run our country into the ground?? Follow Trump, and mark my words, there will be a WWIII, and everyone will be pointing their guns here. We will have no allies as he will insult them all. Wake up, America.","commenter_a":"\"I will not forget.\" What in the hell do that suppose to mean?","post_message":"Do you agree with Donald J. Trump's tweet?"},{"comment_id":"552107031615918","commenter_b":"Jordan get out of here with that nonsense.","commenter_a":"Doesn't affect me. I'll be voting for Bernie.","post_message":"In response to a VICE News FOIA request, a federal judge on Thursday ordered the State Department to release the bulk of the remaining Clinton emails before the February 27 contest."}]
