[{"comment_id":"10153473377133132","commenter_b":"She needs a vaginal reconstruction!","commenter_a":"WEIRDO","post_message":"Still haven't bought a gift for mom? The 19 Kids and Counting matriarch is going to fix that."},{"comment_id":"10153946118774071","commenter_b":"He is a #WhinyLittleBitch","commenter_a":"If he is not blaming it on the Mexicans, the women, the Muslims, the Democrats, the media or the moderator, it's the microphone. My God what a crybaby. I think Donald need a diaper change 😂","post_message":"Clinton slams Trump's debate performance: 'Anyone who complains about the microphone is not having a good night.'"},{"comment_id":"410796369044958","commenter_b":"Wasn't there a time when people were suppose to be Christian? We go backwards insread of forward. We may offend another religion, but it is OK for them to offend Christians. We are feeding the Christians to the lions again.","commenter_a":"Christians has the rights , just like the mustuims do. Let them do","post_message":"Another group was kicked off campus, but the reason will shock you. Are Universities going too far?"},{"comment_id":"10153997969131770","commenter_b":"No we want our WALL","commenter_a":"I bet she does. I want the wall right now.","post_message":"Mexico foreign affairs minister says her dream is OPEN BORDERS, with no walls."},{"comment_id":"10154043389689411","commenter_b":"well.... you can still get it from my throat and eat it eh? #NoWaste Stop world hunger lel","commenter_a":"Robert Pavle Dulić how my life will die prob. lel","post_message":"His last words were 'Watch this'"},{"comment_id":"1039093332808969","commenter_b":"Probably its the smell coming from your stinky vagina bitch...","commenter_a":"Turkish people smell like fart. In the elevator, I aways have to cover my nose 👃 just to bear with their revolting smell. Russia should retaliate.","post_message":"Should be an interesting next few days..."},{"comment_id":"1028137907274272","commenter_b":"I just want to know all you people that are here illegally, if you love it here so much why haven't you went through the process of becoming legal? And if not then bye bye. I mean it's pretty fu**ing simple. Get legal citizenship or get booted back to wherever you came from. You need the United States, the United States doesn't need you.","commenter_a":"It's all fun and games until she gets deported with the rest of us.","post_message":"Meet Miriam Cepeda, a 24-year-old Latina and a self-proclaimed \"Trump girl\" campaigning for Donald J. Trump in Texas, 8 miles from the Mexican border. @webpagelink"}]
