[{"comment_id":"1477546275595181","commenter_b":"Hillary Clinton is a phony champion of the working class! She takes millions from Wall Street the same people who have made Billions shipping are jobs out of the country!","commenter_a":"As it should be...when is the rest of the nation gonna wake up and at least acknowledge what's happening?","post_message":"Donald J. Trump leads Hillary Clinton by 5 points among likely voters in Ohio, according to a new poll."},{"comment_id":"1681608915392702","commenter_b":"@username it made it to the internet via facebook / twitter etc , not sure about the mainstreeam","commenter_a":"with innocent doctors inside","post_message":"Pretty much sums it up... The Free Thought Project.com (Y)"},{"comment_id":"10153832600184087","commenter_b":"She is simply unwilling to burn her country to the ground with a Trump presidency. That makes her a phony? Good grief.","commenter_a":"Elizabeth Warren is a phony. I am so disappointed. I wish I had never donated to her campaign. She is trash. They can put her on the ticket as their little bone to throw at progressives, but I am not biting. #stillSanders","post_message":"Elizabeth Warren will meet with Hillary Clinton Friday morning just hours after hinting she would be open to being Clinton's vice president."},{"comment_id":"10153493964774060","commenter_b":"And she could have foiled the whole dastardly plot by wearing a seatbelt!","commenter_a":"it's a shame the British had her murdered...","post_message":"On this day in 1981, Lady Diana Spencer married Prince Charles. At the time, The Economist gushed \"God save the next queen\". It was not to be. Read our obituary from 1997 @webpagelink"},{"comment_id":"10153401840176336","commenter_b":"idiot and she if she would have fell and killed herself, her family would be suing. Stupidity NEVER ends.","commenter_a":"To me the flag symbolizes opposing the fed. I think that unites me with a lot of those flying the flag. Blessed to have made it to south carolina.","post_message":"A woman was arrested after climbing the flagpole in front of the South Carolina Statehouse and removing the Confederate Flag. @webpagelink"},{"comment_id":"10154598591011756","commenter_b":"Ooh never heard that one...sweet","commenter_a":"Yes, I'm sure the Trump children know all about working. What's that saying? Born on third and think they hit a triple.","post_message":"The theme of day two of the Republican National Convention is \"Make America Work Again,\" with speakers ranging from House Speaker Paul Ryan to Tiffany Trump and Donald Trump Jr."},{"comment_id":"1254862731220863","commenter_b":"Take your wife to Russia like bernie sanders","commenter_a":"Communist piece a shit. That's what happened in chigago last night communism","post_message":"Bernie Sanders gave an epic response after Donald Trump blamed him for violence at his campaign rally."}]
