[{"comment_id":"10155313897730231","commenter_b":"Oprah, don't do it!","commenter_a":"He need two jobs!","post_message":"Own gives reality show to man with 34 children. ‘Fix My Life’ coach to guide him during the show."},{"comment_id":"10154809033061320","commenter_b":"Whoopi goldberg should move now she is very hard on the eyes","commenter_a":"Hillary 2016❤️❤️","post_message":"REPLAY: Donald Trump in Raleigh, North Carolina."},{"comment_id":"10153831418716336","commenter_b":"The wall is a good thing and will create thousands of jobs on both sides of the border. It will diminish drug trafficking and illegal entries. Trump has many options with regard to financing this colossal project. Furthermore, there will be no need to round up and deport millions. Simply register and background check everyone that is here illegally. Anyone beyond the dead line to register will be deported when discovered during routine traffic stops for example. The remainder should pay into the system until they complete the legal entry process, whatever that may be.","commenter_a":"Bryan NY Chow","post_message":"\"It's not only deportation. It's building a wall, and I mean a real wall. Mexico will pay for the wall.\"  Tonight on \"Special Report with Bret Baier,\" Donald J. Trump explained his plans for dealing with illegal immigration. @webpagelink"},{"comment_id":"10154219980731336","commenter_b":"Oh well....","commenter_a":"Aww. Poor things. I'm sure daddy will throw money at someone to make it happen.","post_message":"“They feel very guilty, but it’s fine.”   Donald J. Trump spoke to 'Fox & Friends' about his children Ivanka and Eric not registering to vote in the New York primary. Plus, hear what he said about choosing Ivanka Trump for VP."},{"comment_id":"445100202281687","commenter_b":"Hey here is an idea to the asshole who runs this page, stop defending these fucking criminals. Weed is ILLEGAL. Don't fucking run asshole. The fucking cop should have curb stomped him","commenter_a":"this police guy is a liar ,you deserved your termination,your insane....","post_message":"This is just disturbing. What a lame excuse this cop who has been reported multiple times in the past used for his violent behavior. Now he is defending his actions.   Do you think his violence is justified?  *Warning* GRAPHIC Video: @webpagelink"},{"comment_id":"838486396292823","commenter_b":"I know how is she sleeping with the light on it should be a heat lamp!!!","commenter_a":"drink :D","post_message":"Late night eaglet stream!  Thankfully baby E9, Harriet and M15 will be warmer tomorrow!  Where are you joining us from this evening? @webpagelink  Pix courtesy Southwest Florida Eagle Cam"},{"comment_id":"10154397036584205","commenter_b":"Way to stop women success!","commenter_a":"I work for Overstock and voted to pull all Trump, both he and his spawn, off our website. Proud of our CEO for putting it to his employees to make the final cut. I can't wait for the results!","post_message":""}]
