[{"comment_id":"868568856511870","commenter_b":"Chuck is right!","commenter_a":"You go Chuck.","post_message":"Chuck Norris puts Hillary to shame!  His liberal fans will hate what he said about her candidacy! But you'll love it!"},{"comment_id":"848788448587668","commenter_b":"'@username is trying to use bully tactics to shut up anyone that doesn't agree with him. It won't work. We're fed up!! We will not call evil good and good evil, so crawl back to your safe space and stay out of the women's bathrooms!!","commenter_a":"I am NOT a bigot and i hate being told i am because i do not like what Target did.. that is crazy !! i really do not care what they do.. but not in the little girls room","post_message":"I hope this video makes the rounds....Target has completely LOST IT at this point....shame on them."},{"comment_id":"10153167814539203","commenter_b":"typical, bend over asshole, and I'll shove a hammer up your ass. 😊","commenter_a":"leave it to a man, to be an ass.","post_message":"Will Smith on After Earth PTSD: 'After the failure of 'After Earth,' a thing got broken in my mind...'"},{"comment_id":"1362411960521719","commenter_b":"'@username Oh snap, you go mean girl. Can I sit next to you in the cafeteria? I didn't vote for the Orange white trash. but carry on with your brilliant repartee. I'm so put in my place. Yawn, on to the next idiot.","commenter_a":"Well, it's what I always say, 'if everybody says it, it must be wrong.' The only thing wrong with @username is they are PH.D. reporting to a Honey Boo Boo and Duck Dynasty population. We are a white trash nation, of course nobody watches.","post_message":"Would launching a trade war with China help 'make America great again'?"},{"comment_id":"1221087354570479","commenter_b":"It is French and Spanish ancestries some of the women probably do have more hair than the guys... I should know I was one pretty hairy teenage girl growing up in New Orleans!","commenter_a":"school board has a policy that does not allow any facial hair on male students, Tangipahoa Parish school superintendent Mark Kolwe told ABC News. So female students can have facial hair? Seems sexist to me.","post_message":"The school told all students with facial hair that they had to shave before the ceremony, but the rule was not enforced during the school year."},{"comment_id":"980308098739718","commenter_b":"Who in the hell watches Cnn anyways. Tell that bitch to go to there country and try an speak her mind they will cut her head off. Hopefully.","commenter_a":"More Leftist Fuckers !","post_message":"Alisyn Camerota is the CNN hack who cross-examined me after the jihad attack on our Garland free speech event, as if it had been my fault that we were fired upon by Muslims. So it is no surprise that she is calling on Americans to be sharia-compliant."},{"comment_id":"10153534003896336","commenter_b":"He's also a Democrat","commenter_a":"our Massachusetts senator markey voted not to defund planned parenthood","post_message":"BREAKING NEWS: Senate blocks Republican legislation to defund Planned Parenthood. @webpagelink"}]
