[{"comment_id":"10150636075789999","commenter_b":"Lmao is this satire","commenter_a":"@username remember when we were talking about this at work the other day","post_message":"The tyranny of \"resting bitch face\" is real."},{"comment_id":"10152810811021130","commenter_b":"It absolutely shocks me that this many woman are grossed out by their own bodies. What a shame!","commenter_a":"I'm glad to see this getting publicity. I love my cup and would love to see more acceptance and less \"ewwwwww\" about it. It's great!","post_message":"Menstrual cups could be a great alternative if you don't like tampons or pads."},{"comment_id":"787563944661438","commenter_b":"No more shrubs!","commenter_a":"What do you expect from him, he is a Bush.","post_message":"Democrats have a field day mocking Jeb Bush for pretending to be \"his own man\" despite the fact his policy advisors list reads like a Who's Who from the Reagan administration and those of his father, George H.W. Bush, and his brother, George W. Bush #ItDoesntFallFarFromTheTree"},{"comment_id":"884276841629012","commenter_b":"I'm not for it but I will say this: the government has known and has collected millions of dollars from illegals with fake social security numbers. Republicans and democrats both. To work here the illegals have had to come up with a fake s.s. number and pay on every check. This is a fact. I've seen it, known people who pay into it and will never see a dime from it. Our government is full of lies. They take that money and our legal money and blow it. Like I said I'm not for illegals but don't be blinded any side of the aisle in Washington D.C.","commenter_a":"This ia considered buying votes and that's illegal...but then everything Obama does is illegal. ..STOP HIM","post_message":"Thousands of illegal aliens could begin collecting from Social Security as a direct result of the president’s executive amnesty."},{"comment_id":"10153252345186990","commenter_b":"Roger Morris it is Justin Bieber!","commenter_a":"Lisset Medina","post_message":"#SB50 SIGHTING: Justin Bieber spotted taking pictures with fans in San Francisco. @webpagelink Have you spotted any Super Bowl celebs yet? Tell us below! [Via @JBCrewdotcom]"},{"comment_id":"1738986173036273","commenter_b":"@username : go away Trump or Bernie lover . Vote for Hillary","commenter_a":"Love Her! @username will be our next President of the United States of America!","post_message":"\"Clinton is a master at identifying problems and coming up with plans to solve them. There is seemingly no crisis too small to escape her attention, no subject outside her wheelhouse.\""},{"comment_id":"971579579554776","commenter_b":"Trump.. love him","commenter_a":"The hugs he remembers were on September 11th? I believe what rand Paul was talking about was when New Jersey got slammed with a hurricane and he was thanking Obama for sending assistance so quickly. That isn't anything more than being an adult professional. Something 99% of republicans are incapable of being.","post_message":"ICYMI: Here are the top moments you were talking about during the #GOPDebate. Who do YOU think won? @webpagelink"}]
