[{"comment_id":"10153814122893984","commenter_b":"I think if gay couples have to go to another office in another county, then their taxes should follow where they get services. I'm sure if Kim's paycheck was affected by how many licenses she issued then her religious beliefs would't be as important.","commenter_a":"Hey, wait a minute.....where's the outrage towards the Muslim bakeries (several) who refused service to gay couples planning weddings because of their religious beliefs? And why did the Muslim Target store cashier get an allowance to her job description to specify items she refused to ring up for a customer when they wanted to purchase a bottle of wine? And why did the Muslim flight attendant (<----surreal, isn't it?) get a religious liberty allowance to her job description by refusing to serve alcohol to a passenger? Yeah, okay. Had Kim been a Muslim, this narrative would have flipped to sympathize on the side of religious liberty. But she's not Muslim. She's just a Christian adhering to her religious rights, and in a respectful way, might I add. Respectful. Take a page, all you vulgar-mouthed, whiny, double standard hypocrites. It is what it is: religious liberty. Further, as stated in the ...","post_message":"The letters from Kim Davis that were just uncovered could drastically change how people think about this case. Do you stand with Kim Davis?"},{"comment_id":"10152805783329342","commenter_b":"Kristine Bak","commenter_a":"It's been ALWAYS happening ....everywhere","post_message":"WARNING FOR PET OWNERS: There's a growing trend called dog flipping; someone takes your dog and then tries to sell it, and it is happening right here in Houston. FULL STORY ---> @webpagelink"},{"comment_id":"10153174192806694","commenter_b":"Hate-watching is incredibly stupid and masochistic *unless* you're getting paid to do it, in which case I get it. I get why I09 \"hate-watches\" - it's part of their business. But how the hell can someone who isn't getting paid justify it? Lots of bored, boring, aesthetically masochistic, profoundly lonely people looking for attention I guess?","commenter_a":"Stop watching it if it's so bad","post_message":"And the one moment that exemplifies every single problem with the series."},{"comment_id":"10153253794632756","commenter_b":"Lol but she has a product of the worthless bum","commenter_a":"Go kkk.you have my support","post_message":"More flyers advertising the Ku Klux Klan turned up in a neighborhood in Luzerne County and authorities say there's not much they can do much about it."},{"comment_id":"710582602423848","commenter_b":"Ann Coulter shows her true colors like Trump. They both need a good dose of DUCK TAPE over their mouths.","commenter_a":"If this wasn't an election year, the Republican's would be silent about what Ann \"the Bigot\" Coulter said. In the past she has said terrible things about Muslims, Blacks, Mexicans & liberal Women & they were silent then !!!","post_message":"Ann Coulter needs to slither back into the snakepit she came from. --Andrew"},{"comment_id":"1772911969633181","commenter_b":"Trump says they can come back legally. Why deport them?","commenter_a":"Try this Clinton: Little girl: \" Does my family have to go back to wherever?.\" Clinton: I'm afraid you do, you see your parents are criminals.\" Little girl: \"Criminals?\" Clinton: \" Yes your parents came into this country, illegally, they broke the law.\" Little girl: My parents are criminals? Don't bad people go to jail? At school the teacher, told us you belong in jail. Is that true?: Clinton: Just like your parents, only if I get caught\" Little Girl \" Oh Clinton I want to grow up to be just like you. Circumvent the law, lie, cheat, steal. I'll vote Democrat forever.","post_message":""},{"comment_id":"10155970638220354","commenter_b":"Megan Kelly is a jerk,","commenter_a":"Hehe!!!","post_message":"Donald Trump vs. Megyn Kelly? Fireworks are already flying!"}]
