[{"comment_id":"10153513286844575","commenter_b":"This lady is clueless lol","commenter_a":"This is sad leave churches alone go to a justice of peace & get married the ones trying to sue they think it is a way to get rich it makes me sick","post_message":"Four Kentucky couples are suing a clerk who is refusing to issue gay-marriage licenses — or any marriage licenses at all.  Rowan County Clerk Kim Davis says her Christian beliefs prevent her from complying with the #SCOTUSMarriage decision, so she will no longer issue marriage licenses to any couple, gay or straight."},{"comment_id":"582952285239212","commenter_b":"Vote Trump! Not crooked Hillary","commenter_a":"Trump is nothing but a narcissistic coward. He likes to dish it out but he can't take it. Semper Fi","post_message":"Watch: POWERFUL and MOVING... This WWII Veteran and former POW is literally brought to tears in this impassioned plea to Americans to keep Donald Trump away from the presidency. Let's make this brave veteran go viral.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154048575244456","commenter_b":"Joke","commenter_a":"Prayers for Gunn's mom and prayers for Officer Smith. I pray that the whole truth be revealed and this young man will be safe.","post_message":"'MPD supports their men and women in blue. #it'sok2hitthelikebutton,' the post on a MPD Facebook page stated.  Here's what we learned today:"},{"comment_id":"1720347271558389","commenter_b":"What a pathetic slut !!!!!!!","commenter_a":"Just another Wacko;showing her ignorance.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153779566119170","commenter_b":"Bush is a tush","commenter_a":"They need to stop this childish back and forth banter, and get back to the serious problems that need to be solved in this country! SMH...","post_message":"Jeb is pulling out all the stops on trashing Donald J. Trump, even comparing the billionaire to ultra-liberal filmmaker, Michael Moore. Of course, Trump had to respond!"},{"comment_id":"10153443636529087","commenter_b":"She is another racist B*t*&","commenter_a":"Influential? I think her 15 minutes were up some time ago.","post_message":"Influential conservative commentator Ann Coulter called claims that Ted Cruz was a natural born US citizen 'absolutely false,' joining Donald Trump in questioning whether Cruz can legally run for president."},{"comment_id":"880245452022083","commenter_b":"'@username // Lets jail women for miscarriage oh wait we already are -_-// Who's advocating to throw woman in jail for miscarriages. Again how many time's have been through this? Hiring, a contract killer to end the life of ANOTHER HUMAN BEING is NOT a miscarriage. Miscarriage's happen naturally, not by FORCED.","commenter_a":"People who cannot distinguish a fetus from an infant have no right legislating against abortion","post_message":"Tell Congress to protect ALL babies.  Click here to urge your Congressman and Senators to cosponsor the Life at Conception Act! @webpagelink"}]
