[{"comment_id":"343579349178913","commenter_b":"Nobodynis beyond the law!! ARREST OBAMA AND CHARGE WITH TREASON!!!","commenter_a":"That's because they are all STupid, and follow their leader and Nancy P.","post_message":"ICYMI - Nearly Half of Democrats think Obama Should Have the 'Right' to IGNORE the Courts!"},{"comment_id":"687880108038609","commenter_b":"of course they arn't all murders and gang members that's why the wall will have a door or did you miss that part in the cnn chopped up version of that speech? the ones who want to be Americans can stay the rest can f off.","commenter_a":"These comments are disturbing. These are parents, children, families...not murders, drug dealers or rapists. Instead of \"building a wall\" or treating them like shit we should be coming together with Mexico so that they don't need to come here. They need help, we have a problem, so why are the two countries not putting their heads together to figure out a way to HELP","post_message":"Thousands of Central American children and families are arriving in Texas."},{"comment_id":"1085502584794544","commenter_b":"Good thing the fetuses don't care","commenter_a":"butchering humans is not health care","post_message":"Americans want funding for women's health."},{"comment_id":"422474541282890","commenter_b":"Bring it on motherfucka","commenter_a":"1490882780941608ing Joseph Cortes @username Matt Flambard Leigh Cramphorn","post_message":"Xbox One vs. Sony PlayStation 4 gaming is finally becoming a reality."},{"comment_id":"1166911916662170","commenter_b":"Quit being a girl!!!!!!!!!","commenter_a":"People should remember that clearly there are innocent people in both jails and prisons. How would you like to be an innocent person in jail or prison, getting beaten up....with people cheering on further for you to be additionally brutalized?","post_message":"Inmates at New York's Clinton Correctional Facility say they were beaten, choked and slammed against walls by guards seeking information after 2 convicted killers escaped."},{"comment_id":"1250923198278313","commenter_b":"Another add payed for by the Clintons","commenter_a":"What happened to the American people deciding who will represent us. I'm so tired of this political old timers dictating our path","post_message":"“[Donald J. Trump] is a dangerous demagogue completely unsuited to the responsibilities of a United States president.” - Bruce Kovner, who has donated nearly $3 million to the Republican party"},{"comment_id":"912381755524744","commenter_b":"Cruz no need for explanation,ur vote wud be insignificant bc she is still the AG.Drop dead!","commenter_a":"We don't want Ted Cruz","post_message":"Ted Cruz was the only senator to miss the vote."}]
