[{"comment_id":"10153063204299726","commenter_b":"What a mouth full of shit that is!","commenter_a":"They promised to kill all in the Us if you will recall as well as Israel called us the great satan","post_message":"WATCH: Obama says Islam will cause Iran not to pursue nuclear weapons!"},{"comment_id":"1712583705672199","commenter_b":"What happens when fish over populate and end up eating up their whole ecosystem..","commenter_a":"They're fucking fish were at the top of the food chain","post_message":"If you know anyone who still goes fishing, show them this."},{"comment_id":"10153169832344087","commenter_b":"Can you give an educational description of what is a liberal and a conservative","commenter_a":"Maybe he should have gave the same talk to the average liberal they are after all at the same mental stage as a second grader","post_message":"“The congressman chose to give an example of the current situation in Iran, and made some inappropriate comments about ‘Do you know what a nuclear weapon is? Do you know that there are schools that train children your age to be suicide bombers?'\" one parent said."},{"comment_id":"1829596377287822","commenter_b":"I don't think Zippy Goldberg never looked up anything and that's why she always sounds like an idiot that hates America I just hope that if white people finally start rioting , go to wherever she lives to take her things and burn her cars so she can get a feel for what it's really like.","commenter_a":"Who watches that nightlight anyway?","post_message":"Whoopi Goldberg just scolded millions of Americans on The View. Apparently if you voted for Trump, it's because you \"didn't do your homework\" on Hillary."},{"comment_id":"10154465654928908","commenter_b":"@username Now you want to talk about owning slaves, I don't know, maybe you do, but it is the year 2016... time for major changes in this world....","commenter_a":"Is this a good thing or a bad thing... killing of new born male chickens is a bad thing, but now genetically creating only females doesn't seem right... maybe people should just quit eating chickens.....","post_message":"Newly developed technology will determine the sex of each fertilized egg before the chick inside develops - enabling the removal of all male-identified eggs from the hatchery. This will eliminate the industry need to heartlessly grind male chicks once hatched"},{"comment_id":"1805298753047564","commenter_b":"I know Jim, I'm a diehard liberal, but when people like this commit these acts they prove that they are complete wastes of oxygen and need to be taken out of society. They are sociopaths and can never change. They must go for the safety of society!! Lethal injection is easy compared to what some people do to others. They actually are dying a much easier death than their victims.","commenter_a":"again everytime i think there should be no capital punishment, assholes like these come along and changes my mind","post_message":"The man had to crawl to save his wife."},{"comment_id":"1214141488640014","commenter_b":"See what happens when the Muslim population increases? Get It?","commenter_a":"FYI","post_message":"WOMEN IN FRANCE Fight Back After Muslim Men BAN Them From Sharing Public Spaces [VIDEO]"}]
