[{"comment_id":"10153475201369170","commenter_b":"Unreal. Liberal democrats are NOT AMERICANS!!","commenter_a":"And how many admirals and generals have been \"retired\" for their conservative, pro strong military views during the current administration?","post_message":"How can we have possibly let it get to this point?"},{"comment_id":"1151612978215863","commenter_b":"Nah, Katie. You want to talk about the real world?? Hillary Clinton is the candidate of the \"real world,\" where people DO suffer, most certainly. They are primarily people of color. They are Arabs and Persians living under constant threat of US drones. They are black youth who have been dubbed super-predators by Hillary, who have been beaten and bloodied by the police that she helped arm, and that she helped expand. They are Hondurans and Egyptians and Libyans who have been subjugated by the regimes in their countries, regimes that only exist because we can't seem to keep our fingers out of everyone else's pie. Neoliberal policy has caused more suffering in this world than even Trump promises to bring. Secondly, voting in line with ones genuine ideology is not reprehensible in the slightest. If everyone understood that, maybe we wouldn't be stuck in the two-party, lesser-of-two-evils rut that ...","commenter_a":"Lmao, fat chance on that one. His endorsement solidifies that he has been enveloped into the Democratic Party, where social movements go to die. His most ideologically loyal supporters will be voting for #JillStein, because #NeverHillary , and #NeverTrump","post_message":"Most of the #FeelTheBerners who now say they’ll go third party would otherwise be backing Clinton."},{"comment_id":"10153957381501336","commenter_b":"FAIR TAX on consumption, please. Get the hookers, pimps, drug dealers etc. To pay tax! They have to eat too.","commenter_a":"Make states lower property tax too. It's screwing me on buying a house","post_message":"“No deductions, no loopholes.” Dr. Ben Carson revealed his tax plan this morning and said he would replace the current tax code with a 14.9% flat tax. (Via: Fox & Friends)"},{"comment_id":"10155009134559411","commenter_b":"So why can't they do the same over here when the terrorists return","commenter_a":"Danes are fucked-up in the head except her. Brave and lovely lady ! You should run for whatever kind of Governmental election and you`d do very well. All the best to you .","post_message":""},{"comment_id":"1039629819427046","commenter_b":"Americans could get jobs if they'd get off their fat asses and go to school. All these uneducated Trailer Trash need to go back and graduate 3rd grade.","commenter_a":"We have Americans that are finding it hard to find work because of the flooding of all the refugees just think that will be 50000 more Americans that won't be getting a job because they will","post_message":"BREAKING: Two Iraqi refugees in the U.S. were arrested on Thursday for supporting terrorist groups in the Middle East. The FBI Director has repeatedly said that the U.S. does not have the ability to thoroughly screen refugees for terrorist ties."},{"comment_id":"1266472966743179","commenter_b":"But why are their boobs exploding tho?","commenter_a":"Amen","post_message":""},{"comment_id":"421525971373828","commenter_b":"Stop apologizing women! I had an abortion, cause I wanted to and no one ever new! Lol! Ya know why, cause its not your business! Stop saying ,well my birth control didn't work, blah blah blah. Its not illegal! If you don't like abortions, don't have one.","commenter_a":"What does that actually have to do with abortion? Viagra is not causing the death of a living being. It's not about hurting women's reproductive decisions. I mean, I'm all for birth control methods. Just imagine how many abortions could've been avoided if the women were using a very effective form of birth control? And, before anyone says that you can get pregnant on birth control or while using condoms, let me just state that it is over 99% effective if used properly. Although it is possible, it would be a fairly rare occurrence.","post_message":"\"I purposely tried to make it as invasive, as intrusive, as hypocritical and unnecessary as possible,\" the lawmaker said."}]
