[{"comment_id":"2088211734736585","commenter_b":"Stupid cow!","commenter_a":"Your a stupid person","post_message":"Cokie Roberts called supporters of Donald Trump \"morally tainted\" on MSNBC's \"Morning Joe,\" then received a heavy dose of push back."},{"comment_id":"10154944041488700","commenter_b":"They are ALL criminals!! It's why they are called ILLEGAL aliens!! All must go!","commenter_a":"If your illegal you will be going ...remove all the illegals criminals and violent sex offenders welcome to the deplorable nation of deportation to keep America safe","post_message":"\"Let me repeat this: Our country, not theirs. It is our country. And we are not going to leave,\" said Jorge Ramos to the Spanish-speaking audience."},{"comment_id":"1082109501809405","commenter_b":"Illegal refugee returns?","commenter_a":"what about the human rights of the children and women raped and molested by islamic immigrants ??","post_message":"Amnesty Secretary General Salil Shetty said that short-term national self-interest and draconian security crackdowns had led to an \"unprecedented assault on human rights\" in 2015. Read more: @webpagelink"},{"comment_id":"10153966040516680","commenter_b":"Really Denny? Look back at this entire election process; every single act of violence was committed by the left, either A Bernie or a Hillary protester. EVERY single one of them.","commenter_a":"Tim like all rightwingers always blame someone else; it's SOP. This and other acts of violence is just a taste of what will happen if Trump is elected. Those prone to such acts will take it as de facto permission for violent acts against blacks, Latinos, Muslims, immigrants and of course their most hated enemy, liberals.","post_message":"“This act is a direct assault on people’s right to freely worship,” local authorities say."},{"comment_id":"1603977773244161","commenter_b":"Revoke her clearance!","commenter_a":"BREAKING: HILLARY SET TO RECEIVE SECURITY CLEARANCE ANY DAY NOW!!! She broke the law. She exposed our nation secrets. She lied to the American people countless times. And yet, this week she is set to receive access to information she already proven she can handle. We cannot allow Hillary to put America safety at risk. Demand the FBI revoke her security clearance","post_message":"Tom Fitton is LIVE to discuss our Judicial Watch weekly update on the Obama IRS Scandal and more!   [touch sound icon at bottom right to increase the sound or turn your own volume up. Thx! . ]"},{"comment_id":"10153617541751770","commenter_b":"As Hillary would reply, \"What difference does it make now? I've WON! Sadly, has she?","commenter_a":"You have no anything to go on except you love to hear your lips flap self righteousness find some proof not just the dolts you hang with","post_message":"Dana Perino destroyed Hillary Clinton in an epic rant over her use of a private email server..."},{"comment_id":"10153208487503124","commenter_b":"A hole where I tried to hang a coat rack and it went clear thru to the bedroom behind the wall.....ooops....two holes...walls need patched now and still don't have the coat rack hung.....#AmazonSweeps #DDIY Thanks for the chance.","commenter_a":"We want to install slide out shelves in our pantry! #AmazonSweeps","post_message":"What project needs to get done around your house? Comment with #AmazonSweeps to enter to win a $250 gift card to be used on Amazon Home Services. Hire a pro to handle the hard work - don't do it yourself. #DDIY  Ends 7/30/2015 at 11:59 pm (PT). We will reply to the winner's randomly selected comment with instructions on how to claim the prize. See Official Rules: @webpagelink NO PURCHASE NECESSARY"}]
