[{"comment_id":"993534210682000","commenter_b":"These illiterate students should be in class learning something !!!","commenter_a":"I agree with every post here! They should have forfeited the game and then raised the tuition to cover what loss incurred that reduces tuition. End of story. But know we have encouraged the sports programs to make policy and remove employees at their will. Just crazy.","post_message":"Literally no understanding of 1st amendment rights whatsoever!  Behold your \"tolerant\", liberal colleges..."},{"comment_id":"1177607535665632","commenter_b":"That is sickening! Who are these wild, viscious, beasts that we allow to walk our streets with a loaded weapon \"in the name of the LAW\"? They are just low life sub 60 IQ, sociopaths. They are over paid and forget who signs thier paychecks. Wake up Americans!","commenter_a":"That poor soul...you can see his body struggling to stay alive. I sure hope these fuckin cops don't get away with this...disgusting!","post_message":"There was no reason to kill him."},{"comment_id":"10151085765109999","commenter_b":"@username, There is an \"illegal alien\" in the penthouse of Trump Tower. She came to this country without a visa but persisted in working illegally until she found a sugar daddy who would marry her out of convenience. ICE needs to go there and interrogate her to determine if her marriage is a sham marriage for legal status or not.","commenter_a":"Let's face it, Trump does not care about Jews or Israel. It is up to Israel to save itself and work on two states solution. It is the only option to maintain a viable democratic Jewish state.","post_message":"\"President Donald J. Trump may be the last man standing between Israel and a complete, self-inflicted disaster,\" Thomas Friedman writes in The New York Times Opinion Section."},{"comment_id":"10153635150260950","commenter_b":"Create a sanctuary for endangered animals instead of putting them on display for arrogant humans... This mother is at fault.. That simple.. Cincinnati Zoo should have never been given this gorilla.. They aren't equipted to protect him... If a parents negligence causes the death of an animal like this, it should be treated as a crime.. On the parents.. Shameful.. I will never go back to the zoo.. My grandkids can Google animals until they are old enough to one day take a safari...this is disgusting and unessesary..","commenter_a":"I HOPE THE PARENTS OR ADULTS THAT WERE RESPONSIBLE FOR THIS CHILD WAS IMMEDIATELY ARRESTED..","post_message":"The four-year-old boy spent a terrifying 10 to 15 minutes alone with the adult primate before the decision was made to kill it."},{"comment_id":"1442259229136366","commenter_b":"tell me what he lied about?","commenter_a":"Trump has NEVER had a alcoholic drink in his life ,you idiot.","post_message":"His Fakeness speaketh."},{"comment_id":"10154294125329614","commenter_b":"Just in case she was looking for fame .....","commenter_a":"If this is the only problem, what we face as a nation , we are doing great ;)","post_message":"KTLA meteorologist Liberte Chan and the morning news team address the dress moment from the show over the weekend that has gained national and international attention."},{"comment_id":"942693669149238","commenter_b":"None of the name calling is necessary... My views and opinions stand. ... And I can get my own personal point across WITHOUT name calling :)","commenter_a":"Wooooow people are so ignorant!! Since when is it \"crazy\" to fight for freedom from a tyrannical government? They aren't trying to hurt anyone. They are wanting the ability to live free!! People are fined and jailed for living \"off the grid.\" THIS IS WHAT WE CALL TYRANY PEOPLE!!! The constitution was created to help protect us from corrupt government... hence the ability to bear arms. This is why. GUNS DONT KILL PEOPLE, PEOPLE KILL PEOPLE!!!!","post_message":"BREAKING: Ammon Bundy says he, 150 militiamen taking over national forest reserve in Oregon to  up lands for ranchers, miners, loggers & to oppose  of the federal government. The group is also calling on  patriots to join them with arms."}]
