[{"comment_id":"10153607710971336","commenter_b":"Stfu pussy","commenter_a":"How stupid do you have to be to do something like this?? Idiots!","post_message":"One student “thought seriously about going back home” after seeing the signs."},{"comment_id":"10158155070740206","commenter_b":".. And why is anyone still endorsing hillary clinton?","commenter_a":"so the NYP takes a run at Ryan Lochte for lying but gives crooked Clinton a walk ? hmmmmm","post_message":"Liar liar, swim trunks on fire. @webpagelink"},{"comment_id":"10154823227721162","commenter_b":"Africa still enslaves it's own people, but ok white people are the problem hahaha","commenter_a":"The kicker of the team is a black female this is clearly raciest read the article people ...you would be offened to if you where made fun of in such a manner comparing you to a gorilla but its funny and people are too sensitive because its not directed to you or your race #facebookBigots","post_message":"RACIST POST? The photo shows a white young woman hugging someone in a gorilla suit."},{"comment_id":"10153372708775950","commenter_b":"Yuck!","commenter_a":"Wahhabism is not about freedom , except the freedom from disbelief in Islamism . Obama loves the Muslim Brotherhood , just like this mosque does . How much Wahhabist / Muslim Brotherhood money is funding Hillary Clinton's campaign ? Since when did Political Islam become a fifth column in American Politics ? Who let them in ? NAIT ( North American Islamic Trust ) is the pass through for Political Islam ( Muslim Brotherhood / Wahhabist ) political activity in America . Islam is both a religion and a political entity .","post_message":"JUST IN: Hillary Clinton won the Iowa caucuses, defeating Bernie Sanders, according to final Iowa Democratic Party results @webpagelink"},{"comment_id":"836603479863562","commenter_b":"Prayers and positive messages on the Internet along with taking as many polls as possible. Drive elderly Trump supporters to polls and escort them in. BLM and Black Panthers plan to block the elderly and Veterans from voting. Black Panthers alone blocked them last election","commenter_a":"Yes , with all my heart, since I can't help him with money...I wish him good luck..","post_message":"He truly does want to make our country great again. Let's show him we stand behind him. Do you support Donald Trump?"},{"comment_id":"10153399368892964","commenter_b":"I'm sorry but I didn't see a post about the TPA for the last vote or this one coming up probably this next week to put it in...do you think there is a reason for that? Something this important? And nowhere else to post so I would guess that means he doesn't want to hear it. But it's his job, so yes he is going to hear about it whether he wants to or not!","commenter_a":"We need to keep OUR laws and get rid of these fake \"free trade\" treaties that make us beholden to an unelected foreign tribunal that frowns on anything that allows us to favor buying American, calls it unfair and forces us to change our laws or pay through the nose for the privilege of keeping them. You need to STOP this subversive attempt to undermine our Constitution NOW and vote NO on the TPA Revote...this does not need to go to an up or down vote! @webpagelink","post_message":"I successfully added a measure protecting jobs at the Lighthouse for the Blind to the National Defense bill."},{"comment_id":"10152980958545399","commenter_b":"This may help. My feelings as a Christian points me to my Lord and Savior as a fighter. It points me to the man who once in loneliness, surrounded only by a few followers, recognized these Jews for what they were and summoned men to fight against them and who, God's truth! was greatest not as a sufferer but as a fighter. In boundless love as a Christian and as a man I read through the passage which tells us how the Lord at last rose in His might and seized the scourge to drive out of the Temple the brood of vipers and adders. How terrific was His fight for the world against the Jewish poison. To-day, after two thousand years, with deepest emotion I recognize more profoundly than ever before in the fact that it was for this that He had to shed His blood upon the Cross. ...","commenter_a":"Just what was the religion of the people loading Jews into ovens in Europe?","post_message":"\"When you take Christianity, Judaism, Hinduism, Buddhism, whatever, their combined killings in the name of religion -- well that number would be zero.\""}]
