[{"comment_id":"1749918878564870","commenter_b":"What a bitch.","commenter_a":"American Ignorance. Do whatever you will anywhere in the world. Act as if whole world is America. He should humbly accept his sentence and after 15 years teach his fellow Americans how to behave abroad. With respect to other countries and their cultures.","post_message":"Otto Warmbier, a 21-year-old economics student at the University of Virginia, was found guilty of committing “severe crimes” against the North Korean state after he was held for allegedly attempting to steal a political banner from the hotel where he was staying."},{"comment_id":"516585565198690","commenter_b":"Leave America, why are you here? Go back where you belong, we don't want you.","commenter_a":"Ship them all back to the hell hole they came from. We don't need or want them.","post_message":"This state just voted to ban Islamic laws… Good.  We won't stand for Shariah in America and neither should you.  Do you support banning Islamic laws in all 50 states?"},{"comment_id":"10154838138336509","commenter_b":"If she does a good job, why should anyone care that she is single?","commenter_a":"China, it's non of your business. So proud of our new president.","post_message":"\"As a single female politician, she has no emotional encumbrances of love, no family restraint, no children to worry about. Her political style and tactics are often emotional, personalized, and extreme.\""},{"comment_id":"1236747943048399","commenter_b":"#NeverEverHillary #CrookedHillary #LockHerUp","commenter_a":"I can't believe the uneven coverage you get. Trump lies daily and people don't care. You don't even have to do anything wrong and the republicans and media blow it out of proportion.","post_message":""},{"comment_id":"10153486710565779","commenter_b":"You, madam, are an idiot","commenter_a":"Well Bruce would allow a hairy old pervert in the restroom with that 10 year old girl, as long as he thought he was a woman. Let's all go to the zoo, and think we are lions and tigers, and go in their cage to do our business....... See how that works out Bruce. ;)","post_message":"Bruce Springsteen and the E Street Band closed out the U.S. leg of their 'The River' tour at Barclays Center last night with a three-and-a-half hour set that included covers of Prince's \"Purple Rain,\" John Lee Hooker's \"Boom Boom\" and Jimmy Cliff's \"Trapped.\" But it was a 10-year-old fan that provided one of the night's biggest highlights. Watch their performance of \"Blinded by the Light\" below."},{"comment_id":"10152987943491636","commenter_b":"We all foreigners no one stay for ever on this big country called earth.","commenter_a":"She's not banning foreign students only getting them to leave after they have qualified. It's not part of the deal that they can settle in The UK","post_message":"It's not a very popular decision"},{"comment_id":"841598805896172","commenter_b":"Ok. And then we Will kill you and take OUR White House back !!!!!!!!","commenter_a":"Nah....he'll invite you in.","post_message":"Who has Obama betrayed the most, us or them? Uh oh...  ~Bandit"}]
