[{"comment_id":"10153792948033352","commenter_b":"@username you are entitled to an opinion like everyone else but nobody said black women don't commit suicide. Infact it's about human rights so forget the colour of her skin & remember she's a human like all of us. Even if that is her in that video, it doesn't rule out the fact she could of been killed. There is more to the story the system has a duty to protect not harm, so they will do everything in their power to clear their name. So if her death was a result of any officers wrong doing, I hope her family gets justice","commenter_a":"Clearly that's 2 different oranges and the lady in the video is slightly thicker than sandy. BELIEVE THAT FOOLERY IF YALL WANT TO. #SANDYSPEAKS","post_message":"Authorities in Texas release Sandra Bland booking footage in response to death threats over social media rumors that she was actually dead in her mug shot"},{"comment_id":"10154721377651320","commenter_b":"Don't forget Al Sharpton hanging there too.. shes a joke!","commenter_a":"Really ? So how do you handle having Jay Z in the Whitehouse with the crap that comes out of his mouth that he makes money off. Shaken to your bones ?","post_message":"Thoughts?"},{"comment_id":"10153853111962217","commenter_b":"Well done Team GB proud to be British and the achievements of our wee islands athletes.","commenter_a":"US is winning the olympics. That's good. I heard who ever wins the olympics has home field advantage during the next world war.","post_message":"Good job Team GB 👏🇬🇧"},{"comment_id":"10154954307148984","commenter_b":"You're the dumbass,bitch!","commenter_a":"Lol.you dumbasses believe in stump???lol. I hope you get what he gives you lol and more","post_message":"Paul Ryan is shaking things up with this unexpected announcement. He feels so strongly about this, he decided to make his feelings known during Donald Trump's crucial transition period..."},{"comment_id":"10154170958189586","commenter_b":"Ouiii","commenter_a":"@username on dirait misha","post_message":"Wait until you see Rupert's face when he discovers #vegan nachos. All rats should be this happy! #StopAnimalTests #WW4AIL"},{"comment_id":"10156663817835294","commenter_b":"That nasty women needs mandatory life in prison. Piece of garbage","commenter_a":"She didn't give the baby up! She left it in the toilet to die. That's not surrendering that poor baby.","post_message":"The police are releasing the photo and the video to bring awareness to California’s safe surrender law, which allows any newborn under 72 hours old to be surrendered without criminal charges."},{"comment_id":"573047149521906","commenter_b":"God bless White people","commenter_a":"Wow if any of us \"peasants\" had our name attached to an on-going FBI investigation we wouldn't be able to get a job at Seven-eleven. Must be nice being that rich and connected","post_message":"\"This is an active and ongoing investigation.\""}]
