[{"comment_id":"484066138450614","commenter_b":"@username any woman who needs a leader is not going to be the best wife.","commenter_a":"If that was my husband, he'd know his place, and it wouldn't be in my house. More like on the pavement.","post_message":"Kirk Cameron:  'Wives shouldn't tell their husband how he ought to be a better husband'"},{"comment_id":"10156214197580725","commenter_b":"Right!!...She belong in JAIL, PERIOD!! PERIOD!!!!","commenter_a":"You're all ignorant","post_message":"Check out OAN and compare to what you are watching now! #DemDebate"},{"comment_id":"384727298550424","commenter_b":"So twisted. Islam has been illegal here since 1952","commenter_a":"Not my pOtus not my kkk","post_message":"LIVE VIDEO: 'Not My Presidents Day' anti-Donald J. Trump protests are happening across the country.  WARNING: Viewer discretion is advised"},{"comment_id":"10155194763231178","commenter_b":"why r these liberal women ,so f-in ugly?","commenter_a":"Just another hypocrite.","post_message":"The New York Times reporter smeared the Tea Party as racist a few years ago.... now she's urging the left to start copying it."},{"comment_id":"10153665284600163","commenter_b":"and what's wrong with PUSSY? I never had any complaints about it","commenter_a":"What a Bunch of Wussies .. What happened to free speech and \"Sticks and Stones may break my Bones .. But Words will never Hurt Me \" ?????? Damn we are becoming such a Pussy Country.","post_message":"Sad to say, this comes as no surprise... @webpagelink"},{"comment_id":"10153496846973132","commenter_b":"I highly doubt they kept having them JUST to have a girl.","commenter_a":"How selfish, to keep having kids only hoping for a gender. That 13th boy will someday realize he was only born because his parents hoped he'd be a girl.","post_message":"Maybe the 14th time's the charm?"},{"comment_id":"1114415161915837","commenter_b":"Sweet! Kill all the muslims too!","commenter_a":"Two wrongs do not make it right.","post_message":"#Canada #EndTimeHeadlines #Quebec"}]
