[{"comment_id":"1074790329229886","commenter_b":"You're going to be the sad one when this country has the problems all countries that Muslims populate have, rape murder persecution. All countries that are being invaded by \" refugees \" are living in fear, there are NO success stories of peaceful Muslims coexisting","commenter_a":"These comments reflect a said piece of America that just wont die... Progress has left you behind, blind and ignorant. You worship a billionarw who says he cares about you while sending your jobs overseas, knows nothing of history, and can't answer direct questions about policy. The world mocks you, I pitty you","post_message":"A GREAT NIGHT IN IOWA! Thank you for all of your support. Get out and VOTE! TOGETHER we will MAKE AMERICA GREAT AGAIN! #IACaucus #FITN"},{"comment_id":"979192058784862","commenter_b":"LOL! You are So Silly. That Will Be The Last Win For Cruz in The Primary elections now. There is NO way Cruz can Get Anywhere Near The Delegates Trump Has and after the Next 5 elections all in the Northeast Where Trump Will Win In a Landslide, Cruz is Now Done!!! BYE BYE LYIN TED!","commenter_a":"thanks Gov. @username for endorsing Ted Cruz! I always respected you and prayed for you when all those protesting liberals gave you a hard time. and I don't even live in Wisconsin. we are 741915279236631s and we do need to pray for each other. 2 chronicles 7:14.. prayer does help!. Congrats to Ted Cruz for a great win. thank you Lord!","post_message":"Thanks Wisconsin for showing that common sense conservative leadership is valued! #TedCruz"},{"comment_id":"10154173925206498","commenter_b":"She'll give birth at 2-3am like most animals do lol","commenter_a":"The guy in an earlier video said it can take hours to days for the birth to happen it is when nature is ready for it.","post_message":"GIRAFFE CAM: April the giraffe is about to give birth. @webpagelink"},{"comment_id":"10153006205351051","commenter_b":"I would have shot him.","commenter_a":"I am glad he did what he did. This is what you do instead of standing around recording.","post_message":"This dad was driving his daughter to school when he saw a police officer on the ground with a guy on top of her. The guy was reaching for her gun. The dad didn't hesitate."},{"comment_id":"10152757562815950","commenter_b":"Who really gives a fuck!! Fuck em both bitches!!!","commenter_a":"Kind of skips the part where police tell the suspect to comply . On the other hand ,it avoided death by cop gun.","post_message":"The police chief said the officer who hit the suspect with his car at full speed made a \"tough, tough, tough decision\" that probably saved lives."},{"comment_id":"822379027897898","commenter_b":"How will she do that? She is one of the causes for the problem !!!!","commenter_a":"No they just rather let America be filled and run by people who hate America.","post_message":"“We are not going to be Donald J. Trump’s hate-filled America. Not now, not ever.”  Sen. Elizabeth Warren told a fired up crowd that Hillary Clinton will fight to end discrimination in America."},{"comment_id":"10154452763505575","commenter_b":"That is bullshit...Rasmussen has Trump ahead of that bitch!","commenter_a":"FOX News just reported that Hillary Clinton leads Trump 48 to 41. Basically, they say Trump has lost 3 more points since the debate. Sorry FOX, but I don't believe your bullshit poll and you can take it and shove it up your #NeverTrump asses.","post_message":"It's Happening! Black Vote SURGES for Trump in last two weeks!"}]
