[{"comment_id":"942000482502078","commenter_b":"Celebrities = whores. Whatever pays the bills","commenter_a":"(And yet he keeps playing bond...?)","post_message":"Wow."},{"comment_id":"10152820448531051","commenter_b":"John Jo, you say, don't fight the battle until they come knocking on your door, well how many Americans have been killed, beheaded, this isn't knocking on our door ,than what is. He's the BIGGEST POS TRAITOR WE HAVE EVER HAD, HE WILL GO DOWN AS THE WORST PRESIDENT IN HISTORY. HIS ONLY CLAIM TO FAME, HE TRIED TO DESTROY THE UNITED STATES. HIS ASD SHOULD BE IN PRISON.","commenter_a":"Thanks to Obama!!!","post_message":"As if ISIS didn’t have enough weapons at their disposal – now they have chemical weapons."},{"comment_id":"1067105896689813","commenter_b":"She's a bitch !!!!","commenter_a":"I've always believed we get what we've paid for .","post_message":"Do you support or oppose the stand these officers are taking?  LIKE Opposing Views for more breaking news and anaylsis"},{"comment_id":"10154777446051336","commenter_b":"she's a prick","commenter_a":"It's disgusting Megan Kelly should shut up and be suspended with her biased comments shut her up! And stop playing Miley Cyrus music in the background! She said she is leaving if Trump wins. Bye Miley!","post_message":"\"The American people have spoken and the American people have elected their new champion.\"  Tonight, Vice President-Elect Mike Pence thanked the American people for his and Donald J. Trump's election victory, before introducing the President-Elect."},{"comment_id":"10153181393497377","commenter_b":"Putin gives you a hard on? What's that say about you?","commenter_a":"Yah , They cant hide from the Russians is what he ment .","post_message":"Obama to ISIS Leaders: \"You Cannot Hide\""},{"comment_id":"1786899774881601","commenter_b":"All you liberal women should really read this. You don't know who Hillary is. @webpagelink","commenter_a":"Don't continue to fall into Hillary's trap; she's laughing and the Press loves it....forget the Bimbo beauty queen of years past; we have urgent needs in this country that must be addressed and fixed, not to mention Christians being slaughtered by ISIS.","post_message":"'Donald Trump is ready to lead.' Gov. Mike Pence"},{"comment_id":"941709942541740","commenter_b":"Stay out of my relationship","commenter_a":"This is clearly propaganda to boost the cause to have people see same sex marriage in the same light; it's a ploy, not that I have anything against racial marriage, I'm 100 hundred percent for it but it's no coincidence this is being addressed in light of what is happening this month. When a black man or white man marries a latina woman or black or white woman or Aborigine woman, that is still a man marrying a woman, the way that God had intended. The sexes are complementary and marriage has been since the beginning of mankind, the core unit to propagate the family and for mankind to spread and to flourish. Two males and two females cannot propagate the family that is why they have to take other unnatural alternative measures to achieve this because that is the only way they can. Please don't think I'm putting down ...","post_message":"On this day in 1967, the Supreme Court legalized interracial marriage in the United States. Happy Loving Day! #LovingDay"}]
