[{"comment_id":"10154534822598132","commenter_b":"The only way,she should have stop him is by calling the authorities. She need to go to jail,knonkle head","commenter_a":"She is as guilty as that stupid dude!!! She knows a thing or two she should be charged!!!!","post_message":"The second wife of #Orlando killer Omar Mateen has reportedly said she pleaded with him not to do anything violent."},{"comment_id":"10153698259961320","commenter_b":"She's the devil in disguise.","commenter_a":"She doesn't have to worry about any boyfriend and hopefully for a long time!","post_message":"What a horrible human being.  Authorities have released text messages that allegedly detail how 18-year-old Michelle Carter texted her boyfriend, Conrad Roy III encouraging him to commit suicide. Read what she said: @webpagelink"},{"comment_id":"10153639666243138","commenter_b":"You, m'dear, are brilliant. Wish I was a Floridian.","commenter_a":"Since we have Debbie Wasserman Schultz to hold to the fire for unfairly slanting the elections, I thought it might be productive to take her to task and donate to her democratic rival in Florida's 23 district Tim Canova. Knock her right the hell out of her seat in congress. Might wanna throw him 5 bucks and help him send her packing. It matters.You don't have to live in Fla to donate, it affects us all. @webpagelink #TellHimBernieSentYa","post_message":"I'm not saying Donald J. Trump won by appealing to the KKK, but if the hood fits…"},{"comment_id":"10153302293701051","commenter_b":"EVERY country is populated at some point in its history by people who migrated to it ... THAT is how all countries began.... good grief. No one is against LEGAL immigration.","commenter_a":"Nearly 100% Americans ARE immigrants. Through their ancestors. :-))","post_message":"Do you agree with the vast majority of Americans on this?"},{"comment_id":"1216368028409389","commenter_b":"Allyson the bitch","commenter_a":"Donald the Clown and his Republican surrogates will lose big time !! Only imbeciles will believe he stand by working class Americans","post_message":"I stand for ALL AMERICANS! Deplorables, basement dwellers, I stand for ALL of YOU!"},{"comment_id":"10155406467768812","commenter_b":"Didn't miss em. Had same day as any other.","commenter_a":"Idiots. Proof of the problem","post_message":"People protest around the country in support of a 'Day Without Immigrants,' a protest against President Donald J. Trump's promises to crack down on illegal immigration. abcn.ws/2kX8c5V"},{"comment_id":"1854247478194959","commenter_b":"Why you do this to me","commenter_a":"'@username try not to cry","post_message":"Walnut the whippet was not alone on his final walk 🐶😢 #walkwithwalnut (via BBC England)"}]
