[{"comment_id":"516575861835702","commenter_b":"Just shut the fuck up.","commenter_a":"Here a question , if tuition is free in the next years , does my daughter get a \" Refund \" on what she has paid in so far ?If Debt relief is on the table then she should be paid back for having the cash up front to pay for her school....right ?","post_message":"\"He said if a million students march on Washington for free college, that's the only way we're going to win. That's a really inspiring thing to hear.\""},{"comment_id":"10153562677106680","commenter_b":"She wouldn't work for him with a gun to her head.","commenter_a":"Please please trump get CONDOLEEZA RICE as ur running mate. I understand that u do not want to pander, but like it or not, this elections , the woman card has been dealt unfairly by crooked Hilary. But i think looking at it positively , trump has an opportunity with CONDOLEEZA RICE. She was a magnificent SOS. Hardworking as hell , logged more air miles then any other SOS. By choosing CONDOLEEZA , trump will also show to the American voters a good example of a SOS. Besides she has great Christian values, very very qualified and better then most of her male counter part","post_message":"Paul Manafort said he'd also be 'surprised' if the front-runner put out his tax returns."},{"comment_id":"694546357374506","commenter_b":"Bullshit. She should go back under a rock!","commenter_a":"U MEAN HIS SON IN LAW IS INVISABLE?","post_message":"...says the woman who trashed tens of millions of working class Americans."},{"comment_id":"10153760564233812","commenter_b":"Douche","commenter_a":"Well, they did turn off the steelers radio headsets, but hey it is the cheating Pats!","post_message":"With \"Deflategate\" behind him, Tom Brady was back to his unstoppable self: @webpagelink"},{"comment_id":"539331949590718","commenter_b":"Amen @username! That's right, get out of our Country!","commenter_a":"No","post_message":"Burger King just bowed to Muslims in this sickening way.  This is such a joke. They just lost our business forever.  Will you support Burger King after finding this out?"},{"comment_id":"939907909435597","commenter_b":"Aren't most Americans \"Economic Migrants\"?","commenter_a":"Then we have to accept everyone that comes to America theyre refugees well so are people who are running from drug cartels","post_message":"It's the American thing to do. What better way to show Trump and the rest of his racist rivals that they do not represent us?"},{"comment_id":"10153533564596438","commenter_b":"This is why people are turning against feminism. Jeremy makes a legitimate point, and everyone attacks him because they don't like what he has to say, but he is totally right. Women like her don't need to have a victim mentality because she is more successful than the majority of men on this planet. Victim playing just holds people back and places limits on you before you even get started. Why not go out there, be confident, and refuse to let anything keep you from achieving your goals?","commenter_a":"Wealthy ladies are almost never feminists in actuality. They'll say they are because they need to in order to keep up a certain facade. But they've proven that women are able to be (more) successful and that most of the BS spouted by modern feminism is just that. It's not like someone's political views should matter anyway for the most part. Celebrities are human too.","post_message":"Marion Cotillard says she's not a feminist. Should we care?"}]
