[{"comment_id":"10152769166208271","commenter_b":"Tauna Corbin so a dead woman can drive a car?","commenter_a":"She broke the law. She could have KILLED the officer if she ran over him. Its called consequences for YOUR PERSONAL CHOICR.","post_message":"#BREAKING Denver Police Chief Robert White spoke to the public about the shooting Monday that killed a teenage girl in a stolen car. We are updating this report: @webpagelink"},{"comment_id":"483503378504622","commenter_b":"Wow!","commenter_a":"This proves someone built something and is no more proof of God than stepping in a cowpie.","post_message":"This Will Shut Their Mouths!!!!"},{"comment_id":"10153644040068967","commenter_b":"Yeah but women can not, not without getting sexually harassed","commenter_a":"Common place in Denmark as well. Alone and in school groups. Take your pick.","post_message":"Japan is awesome"},{"comment_id":"10153101900003010","commenter_b":"WORTHLESS PIECE OF HUMAN FLESH...","commenter_a":"This world is coming to an end . I feel sick after reading this","post_message":"A 30-year-old Newhall man told sheriff's deputies his newborn daughter was missing. But investigators say he sexually abused, tortured and killed the 19-day-old child."},{"comment_id":"10153635664936717","commenter_b":"Lock her up! Oh wait she's careless just like Hillary!","commenter_a":"At this point, this is just funny.","post_message":"Here she goes again..."},{"comment_id":"534617120056639","commenter_b":"Mike Bassenti This is what they get for coming here !! We have to pay for this ! @webpagelink","commenter_a":"Big news is Trump is earning MAJOR support from segments of the population which almost exclusively vote for Democrats. SurveyUSA announced that Donald Trump would receive 25% among black registered voters. That is news that has Hillary Clinton terrified, and is shaking the political establishment to the core!","post_message":"I had an incredible time in Detroit yesterday. A great experience - learned a lot by listening to everyone. I am grateful for their support - and time. You can catch what I had to say to everyone, right here. Thank you! -DJT"},{"comment_id":"10152931413566491","commenter_b":"Love how in America, its the land of free ONLY if you don't go against the status quo or what's defined as \"normal.\" I'm a straight dude, and guess what? When it comes to gay people, I mind my own business. I support the human right to love, so long as no one is hurt. I just wish minding one's business was actually expressed by the many who love to use it for themselves only.","commenter_a":"Obviously there are a lot of Christians or Islamists or whatever commenting on here with a ton of negativity about this. Being a Christian myself, God does not teach us to hate on people for choosing to marry the same sex. He teaches us to love others amd treat them fairly. Give your head a shake people.","post_message":"After the historic Ireland vote, here's where else gay marriage is legal."}]
