[{"comment_id":"10156137722715093","commenter_b":"(If we support refugees by letting them into our country ISIS wins.","commenter_a":"And if we accept Syrian refugees without adequate screening America loses.","post_message":""},{"comment_id":"982881765080578","commenter_b":"I hope so how can that woman even sleep much less lead a country would she do that to all Americans how can anybody vote for her","commenter_a":"I look at this picture and am reminded of the horrible torture this man endured, before his death, and wonder what really happened and who was responsible for not seeing the embassy was secured for their safety. It may not matter to Hillary, but it does to us and the the family members of those who died.","post_message":"Could we finally bring Hillary to justice?"},{"comment_id":"10155543749229778","commenter_b":"Perhaps she is the right choice since we'll be obstructing the GOP for the next four years...","commenter_a":"Things are going great. More of the same!!!","post_message":"Rep. Nancy Pelosi won another term Wednesday morning as the leader of House Democrats, turning back calls from some in recent weeks who said it was time for a change."},{"comment_id":"805029612967642","commenter_b":"She knew and never said anything?? She's should be locked up smh","commenter_a":"So if she knew he scouted both places why didn't she report him?","post_message":"The gunman's wife said that he scouted both Pulse, the nightclub where the mass shooting took place, and Downtown Disney, recently renamed Disney Springs."},{"comment_id":"985288268192005","commenter_b":"she looks like the Queen of Qualudes.","commenter_a":"Or if she is in jail","post_message":"The Democrat Party WILL NOT let Bernie Sanders be the nominee – no matter how many States he wins, how many delegates he has or an other reason.   Watch this and tell me if you agree:"},{"comment_id":"736103763189471","commenter_b":"I hope the police are called for every item he, or anyone else, takes to school that appears to be an explosive device of any sort. Truly Americans can't be this ignorant. Oh, wait! We are! Obama is president and was not only elected once, but twice! For those that truly believe in tolerance and are willing to allow Islam to infiltrate our country, just wait and see how tolerant they are of you, your children, and your children's children when they become the majority. Remember this, Obama is moving in thousands of \"refugees: next year and the current Muslim population is already having children at a much higher rate than the average American family. SURPRISE!!!!!","commenter_a":"No, comments.","post_message":"Of COURSE."},{"comment_id":"10154338661984087","commenter_b":"Keep sucking off your Arab whore","commenter_a":"Raper of Ex Wives and groper in chief","post_message":"“Look to his past to see what he will do for women in this country,” Omarosa said about Trump."}]
