[{"comment_id":"1155155194501829","commenter_b":"Get over it. There are two different justice systems, if not more; operating within one....","commenter_a":"white privilege","post_message":""},{"comment_id":"10154413967139087","commenter_b":"The British started this mess, no one including the US wanted this \" trash of Europe so they found a desert to dump them in, let get along or die, who cares, why do we have to pay for these spoiled perpetual \" victims \"","commenter_a":"Israel will never be at peace, if they don't work for it. Sorry about the comparison but that sounds like something Hitler would do, obliterating a group of people to put your own. Have you ever heard about Divine intervention? God doesn't like when you prosecute His children.","post_message":"#BREAKING: The Israeli government says it plans to move forward with the construction of thousands of settlements in East Jerusalem despite a U.N. Security Council resolution demanding an end to settlements in the occupied territories."},{"comment_id":"10150759349264950","commenter_b":"Bam","commenter_a":"Are they going to address the facts that trump is pushing his daughter merchandise?","post_message":"WATCH LIVE: White House press secretary Sean Spicer takes questions from the press."},{"comment_id":"10152853716122894","commenter_b":"I get tired of hearing about this lil hoe everyday","commenter_a":"Biancaa Ft Blue","post_message":"Watch: Kylie Jenner Gets 'High as F*ck', Tries Popeye's Chicken for the First Time [Video]"},{"comment_id":"1759425104296851","commenter_b":"So how come she is now for crooked Hillary?","commenter_a":"michelle you said that Hillary was not fit for the white house nothing has changed since 2008 except she committed more crimes","post_message":"The first lady who did pushups on Ellen, whose hubby sang Al Green, claims Trump's immature."},{"comment_id":"452202411637006","commenter_b":"There here in the us feed them pork to hell with them if they don't want to eat pork go back where they come from keep the. Lunch day she should not of been fired that bull shit vesta","commenter_a":"pork them all!!!!!","post_message":"Lunch Lady Fired For Serving Pork To Muslim Student.  'LIKE' if this is WRONG!!!!!!"},{"comment_id":"1452044741482218","commenter_b":"You need to put down your crack pipe that crap has fried your brain; dumb witch","commenter_a":"Democrats r a bunch if liars ..republicans are honest and classy","post_message":"\"I knew Ronald Reagan. I worked for Ronald Reagan. Donald Trump, you are no Ronald Reagan.\"  -Republican Doug Elmets says he's voting for a Democrat for the first time in 40 years.  More: @webpagelink"}]
