[{"comment_id":"10152957950051051","commenter_b":"You know yall need too look back in historey books .do yall remember this wasn't the first flag made back then.","commenter_a":"That's right keep it up","post_message":"This man doesn't care what anyone says – he refuses to take down the decorations on his yard."},{"comment_id":"10153443453313145","commenter_b":"It's not the agents it's the folks who can't seem to follow simple instructions or get grumpy when asked to do what everyone else has to.","commenter_a":"I fly weekly and it is always slow. Putting the tourist with five kids in pre check just slows it down even more. Nothing at OIA is for the business traveler only the tourists. Wish I had a choice of airports","post_message":"A study of the speed with which TSA agents get passengers through security lines at Orlando International Airport shows that times aren't what airport officials want to see. So how have you're experiences at OIA been?"},{"comment_id":"908796952508643","commenter_b":"@username, I think the big difference is that a brain dead person has NO CHANCE of neurological recovery. The same cannot be said for the vast majority of fetuses. A young fetus does have brain waves, does have a heart beat, and if left alone, an excellent chance of normal neurological function. We certainly would not be discontinuing life support in this situation on an older person.","commenter_a":"Women already have more access to healthcare than men. Show me a government funded chain of facilities specifically there for prostate cancer treatment. At any rate, cutting a living human out of a woman's body isn't healthcare and the living child certainly doesn't have a choice to be murdered or not during an abortion.","post_message":"When you tell a woman that she cannot control her own body, that’s extremism. Let's say it loud and clear: women control their bodies, not the government."},{"comment_id":"10153259509053010","commenter_b":"I bet she could crush Eddie lol","commenter_a":"Had the biggest crush on Eddie Van Halen growing up...LOL..He DOES NOT look the same anymore!!!","post_message":"Van Halen's David Lee Roth put it best: \"We waited 45 years for this.\" More than four decades after it formed, Van Halen played its first nationally televised gig, on Jimmy Kimmel Live. (Roth ended up with that bandage on his nose.)"},{"comment_id":"10152988203790861","commenter_b":"You act like kids don't figure stuff out.","commenter_a":"I can just see a kid planning it out to steal the gun and shoot up the classroom.","post_message":"A Texas school district wants to allow teachers to carry guns in the classroom. Tell us what you think about arming teachers."},{"comment_id":"963311450392051","commenter_b":"WILL MR. TRUMP STAY AHEAD ?! - @webpagelink","commenter_a":"Iiar liar pantsuit on fire.","post_message":"Hillary has been a champion for everyday families her whole life. That's why she's running for president."},{"comment_id":"1104177846295508","commenter_b":"@username Actually the major of women that have Abortions are Christian @webpagelink","commenter_a":"thats is because the democRATs favorite sport is killing our unborn babies...","post_message":"There is something very important missing here..."}]
