[{"comment_id":"10156236766360354","commenter_b":"WHAT??? It doesn't designate the Black Lives Matter and the Black Panthers as terrorist organization for constantly calling on blacks to kill cops and white people and CAIR, but they want the NRA designated as one even though they threaten no one? This is absolute bullshit & I'm so tired of the attack on our 2nd Amendment rights!!! We MUST stand against this!","commenter_a":"NOT","post_message":"Here's how far the Left is going with this..."},{"comment_id":"10154325852416323","commenter_b":"The woman is a perpetually grinning dimwit. She'll probably become PM.","commenter_a":"Fucking moron","post_message":"'At least 50% of her public statements sound as if they were said for a dare. 'Let’s banish pessimists.' 'Boris Johnson is a lovely man.' The rest sound like she’s assembling endtimes magnetic fridge poetry.'"},{"comment_id":"10154697358601037","commenter_b":"Where's Hitlery?-Oh Yea, Taking ANOTHER Sick Day Because Yesterday She Had 300 Supporters Show Up To One Of Her Rallies While President Trump Was Speaking To 3 THOUSAND Of His Supporters.....#Laughable #HitleryIsToast #RepublicansWinning","commenter_a":"In business you make profits If you don't. Then you not in Business.","post_message":"“Can you imagine Ronald Reagan ... saying, ‘It’s good business to take advantage of people’s misery’? Rooting for that misery?” — Joe Biden on Donald J. Trump"},{"comment_id":"10153190295751336","commenter_b":"Nothing better than a HOT conservative woman.","commenter_a":"Looks like the Catatonic Parkway. No cowboys in that area, maybe a few cowgirls, but they ride English.","post_message":"Fifteen buffalo who escaped an upstate New York farm have been shot and killed."},{"comment_id":"10156386712435354","commenter_b":"Dumb asses.. Nuclear terrorism ( round the corner) is far worse than gradual climate change..","commenter_a":"And he is a greater threat than Climate change. So I guess that makes him a greater threat than terrorism too !","post_message":"A DEVASTATING indictment every American should see..."},{"comment_id":"10153694133994330","commenter_b":"Feminists live in fantasy land","commenter_a":"She should be in a cheer outfit not a football jersey if she was to play that's fine make a all female team","post_message":"She's in 8th grade and she's no joke on the football field.  That's right, we said she!!  Watch NBC Connecticut news at 6:20 tonight as NBC Connecticut's Kevin Nathan brings you her amazing story. --> @webpagelink"},{"comment_id":"1749918878564870","commenter_b":"What a bitch.","commenter_a":"American Ignorance. Do whatever you will anywhere in the world. Act as if whole world is America. He should humbly accept his sentence and after 15 years teach his fellow Americans how to behave abroad. With respect to other countries and their cultures.","post_message":"Otto Warmbier, a 21-year-old economics student at the University of Virginia, was found guilty of committing “severe crimes” against the North Korean state after he was held for allegedly attempting to steal a political banner from the hotel where he was staying."}]
