[{"comment_id":"10153785163219411","commenter_b":"wastemans all just talks.now putin has to deal with it 😂","commenter_a":"Taliban, Isis, Hamas, Al-Qaeda, Boko Haram, Hezbollah, Al Shabab. All products of the religion of peace.","post_message":""},{"comment_id":"1306332122711020","commenter_b":"This is America. Let them all leave. We love our National Anthem.","commenter_a":"Oh say can you see your way out of here muslims","post_message":"MUSLIMS ARE OFFENDED AT NATIONAL ANTHEM: They Say It Forcing Them...  THEY WILL NEVER ASSIMILATE!"},{"comment_id":"10153650644833812","commenter_b":"Feminism at its finest.","commenter_a":"Hillary Clinton has a beautiful spirit God bless","post_message":"Hillary Clinton's mom, family life at center of $2,000,000 TV ad buys directed at Iowa and New Hampshire: @webpagelink"},{"comment_id":"10153535797471336","commenter_b":"That's because they have a thug for a governor ..A Hood Rat..","commenter_a":"It's pretty obvious why there is so much crime in Baltimore. The cops are afraid to do their jobs! I'm surprised most cops haven't left Baltimore!","post_message":"Ten federal agents will work with Baltimore's homicide detectives in the latest bid to curb a surge in violent crime."},{"comment_id":"1724725117769666","commenter_b":"Hey Matt good thing she doesn't have a dick or you would be down sucking it","commenter_a":"No. She is above the law, and we all know it.. Anyone else would have been charged by now!","post_message":"Hillary Clinton has just declared that there's \"not even the remotest chance\" that any charges against her will stem from the investigation into her emails, but I am sure MANY Americans are hoping she's wrong..."},{"comment_id":"10154667232099270","commenter_b":"But lord lord that wall has to go up!","commenter_a":"Axe the F35 and you got your new engines","post_message":"The Air Force wants new engines for its venerable B-52 Stratofortress bomber fleet, but there’s no money in the budget to pay for them."},{"comment_id":"10153293386166051","commenter_b":"And he should step down.....","commenter_a":"I'm with him!","post_message":"Do you agree or disagree with this judge's position on marriage?"}]
