[{"comment_id":"10153801376773822","commenter_b":"Sean Hile lol","commenter_a":"Chelsea Nichole","post_message":"Burgers, Wings, and Country music... A taste of Nashville is set to move into #Pittsburgh's North Shore."},{"comment_id":"10153836785761350","commenter_b":"Lady do you even know.what the truth is? Doesnt seem like it","commenter_a":"Trump is the ONLY one telling the truth and saying like it is,,,,,,Obama just lies,,,,","post_message":"\"We have a whole bunch of Americans, Trump supporters and his support I think will grow after this moment who feel that no one is telling them the truth and no one is saying what is obvious to them.\""},{"comment_id":"10154291975578701","commenter_b":"Looks like he will have plenty of room for some illegals there","commenter_a":"Must be nice when all we have is homeless people living on the streets working their ass off just to get by","post_message":"The house was built in 1928 and has nine bedrooms and eight-and-a-half bathrooms. It was sold in 2014 for more than $5 million."},{"comment_id":"935958373261405","commenter_b":"Can she get any uglier.","commenter_a":"Trash just like her parents glad they are gone","post_message":"This speaks volumes about who they are as people. Thank the good lord we are done with them. Were the Obama's the worst first family ever?"},{"comment_id":"755708104563829","commenter_b":"And what happened when bush was president. This woman is going to do what's best for our country","commenter_a":"Didn't isis grow under her watch, and lybia burn. Nothing was accomplished while she was secretary of state.","post_message":"There's one candidate who's ready to be Commander-in-Chief on Day One."},{"comment_id":"10154321620193188","commenter_b":"When are women going to start taking responsibility for their choices?","commenter_a":"Does this mean @username is going to stop telling women what to do with their bodies?","post_message":"While we may disagree on specific issues, if we stop trying to control each others’ lives, those issues (for the most part) become irrelevant."},{"comment_id":"10153189307188352","commenter_b":"I Understand hw U feel. U will ask d Grace frm God 2 give U a woman,I mean a \"Virtous Woman\". God wil give U a Good woman as a Wife. Remember d Bible says, He who finds a Wife,finds a good thing n Obtain Favour frm God. U jst av to b HAppy wit Urslf.","commenter_a":"How is that when everything you are she just crap on me rip my heart out and then go to our church act like I don't even exist understand how you can say you love me 1 minute and then say you don't want to be with me the next and all I hear from people is get over it and just move on wow so easy to say I am not a man that has the gift of words to woo a woman love one forsake all others that is how I was raised","post_message":"Breakups hurt, but losing someone who doesn't respect and appreciate you is actually a gain, not a loss."}]
