[{"comment_id":"10153637464097377","commenter_b":"@username That's lame .The females in my family would not let it go for 10 seconds much less 10 years .","commenter_a":"10 years ago? It's not that I don't believe it, but you wait 10 years to report . Does not sound kosher .","post_message":"BOMBSHELL: Megyn Kelly has accused Fox News Chairman Roger Ailes of sexual harassment! New York magazine reports that Ailes has until August 1 to resign or be fired. Read the story: @webpagelink"},{"comment_id":"10153812038063984","commenter_b":"We need to demand that our governor 's refuse to accept them in our states !!","commenter_a":"Totally against it.","post_message":"Wow. This definitely makes Obama's plan to accept refugees from war-torn Syria \"nothing short of crazy\" - as Ted Cruz would put it. America could be the next country to face this... Are you against allowing Syrian refugees into the U.S.?"},{"comment_id":"10152633763458525","commenter_b":"So because somebody disagrees with you they lack common sense. That's very adult of you.","commenter_a":"And people say that pot doesn't hurt anyone.... That's two deaths due to pot sales just during the holiday season. Pot hurts....even kills.","post_message":"They are just 15 and 16."},{"comment_id":"2026860724207699","commenter_b":"Dumb bitch","commenter_a":"leftist hypocrite","post_message":"Racist blacks cried foul when Republicans wouldn't support the policies of Barack Obama. But what are you if you don't support Trump? For Leftists, a hero."},{"comment_id":"10154146270706218","commenter_b":"@username change the fucking tampon","commenter_a":"President Obama and First Lady Michelle are a class act and what a President should act like with intelligence, calmness and responsibility to the American people, not the train wreck we currently have.","post_message":"Do you miss Barack and Michelle Obama?"},{"comment_id":"10154308698454607","commenter_b":"Do these liberal protesters have jobs!!!!!!","commenter_a":"The US is being ridiculed by idiotic liberals who are obviously clueless on what President Trump is doing, protecting Americans!!! I live less than 20 miles away from that radical Islamic terrorist attack in San Bernardino, where 14 innocent people were murdered!! It's not Trump's fault that our government is so corrupted and does not have an immigration accountability system to know who exactly is entering our country! There are Isis training camps all over the United States! If you don't believe me Google it!!! There is an Islamic training camp less than 10 miles away. They are spreading like a disease everywhere! Last year local law enforcement caught 16 radical Islamic Muslims training near the a river bed all of them had AK-47's!!! All of them are now being investigated by FBI! 5 of which are on the top 10 most wanted list!!! Do you want to know why ...","post_message":""},{"comment_id":"1694550140816786","commenter_b":"Misogyny!... misogyny everywhere!","commenter_a":"RIP, Chyna. But in your next life don't be a wrestler and a pornstar. Two terrible choices for a woman.","post_message":"She was known as the \"Ninth Wonder of the World\". #RIPChyna"}]
