[{"comment_id":"10154391866961130","commenter_b":"One track mind girl!","commenter_a":"lawd hep us!!","post_message":"Mazel tov for (unintentionally) making us laugh before the election."},{"comment_id":"1222871987767261","commenter_b":"@username no yo are for supporting that muslim scum","commenter_a":"HES DONE MORE FOR THE USA THEN OBAMA DID IN 8 YRS YOU PPL NEED TO GET A LIFE AND MOVE ON","post_message":"BREAKING NEWS: President Trump holds surprise press conference at the White House"},{"comment_id":"1042921652395512","commenter_b":"Clams don't eat salt. That's its foot anyway.","commenter_a":"Now who wants to lick salt off a clam","post_message":"It's easy to forget that shellfish are animals ... until you see something like this."},{"comment_id":"10153516705331337","commenter_b":"I'm sorry but what did he expect...how sad that I grew up.on this family show N all his family n friends stood by him while he lied","commenter_a":"Bye asshole.","post_message":"FALL FROM GRACE: The Bill Cosby saga continues as word has broke that the comedian's talent agency has cut ties with him over his sexual allegations..."},{"comment_id":"10152653245300671","commenter_b":"Then get off of their butts and go through and jump the hoops just like all of our legal immigrants.","commenter_a":"this is so wrong. Take care of Americans first. Illegal immigration is wrong. I don't care what country or why you came here illegally, if you were a kid you have had plenty of time to do it legally, yet too lazy......","post_message":"The Migration Policy Institute says about 1.2 million people are eligible for the plan under the DACA rules. But now many more would become eligible if the president expands the program to eliminate the age cap. That cap includes a Modesto woman who’s been in the U.S. since she was a teenager. Ron Jones has her story."},{"comment_id":"623778954497467","commenter_b":"Hoes fuck over A by picking B. Once B fucks over the woman, woman tries to go for A to save face... but A ain't having that shit and tells her to go fuck herself sideways.","commenter_a":"I believe A is from the Amazing Spiderman...","post_message":"A or B? #WSHH"},{"comment_id":"10153333951429575","commenter_b":"We do.","commenter_a":"It's called intuition. But I'm glad it happened.","post_message":"\"I just said I need to go check on him working on the car. I just believe a spirit told me.\" She felt something was wrong with her husband--and she was right."}]
