[{"comment_id":"10153155614114411","commenter_b":"Circumcision removes most of the nerve endings from the penis - so no, it is not good for intercourse.","commenter_a":"curcumstich is good for the sexual intercorse between man woman. But the preast outbreath and homosex agenda and child melest could make Even God leave the churche..and the girls virganity and boys firs blow job...fuck them. Herpes is an evel sicknes related both to rosesicknes that makes your body ..","post_message":"Via RT America: City health officials said 17 cases of infant herpes since 2000 have been connected to the traditional Orthodox practice of sucking blood from the circumcision wounds of infants penises."},{"comment_id":"10153579944776438","commenter_b":"If he hates it that much, he can step down and we can keep his paycheck.","commenter_a":"lol @ headline","post_message":"'He hates it.'"},{"comment_id":"10153476534618721","commenter_b":"You do not turn the Super Bowl into a platform for any agendas. The Super Bowl is about the teams on the field. That is all. If she wants to do that at her concerts, fine. But she was out of line doing it at the Super Bowl.","commenter_a":"Is Beyonce just another ghetto ho?","post_message":"'Is Beyonce pregnant?' and other dumb things people Googled during the singer's Super Bowl performance. (via Quartz)"},{"comment_id":"10153956190753797","commenter_b":"She better go to juvenile....period.","commenter_a":"those other kids should be charged also for not stopping it and cheering it on! makes me sick!","post_message":"UPDATE:  Last week, a controversial video went viral that shows a 3-year-old child being dragged and beaten by two young girls. Over the weekend, officials identified the girl and brought her in to custody. The shocking details involving the attack, here:"},{"comment_id":"10153478653615950","commenter_b":"Here come the pro-trump/Hillary is the devil comments. I stand by Hillary and will gladly vote for her in November. #Hillary2016","commenter_a":"She does not care, just wants them votes!!!","post_message":"Hillary Clinton  takes a swipe at Donald J. Trump's 'neutrality' during her AIPAC speech: America 'can't ever be neutral when it comes to Israel's security or survival' @webpagelink"},{"comment_id":"10153523440189071","commenter_b":"You should always bet with Olly when he's had a few, he always loses.","commenter_a":"Olly Cairns @username","post_message":"It has a ton of benefits."},{"comment_id":"10154533840951509","commenter_b":"well you certainly are a hateful person!! Jealousy is a evil trait poor girl.","commenter_a":"I dont know if rock hudson was at the gates to meet nancy reagan if she even made it shame shame shame on you nancy","post_message":"1980s star Mr. T did not pity the fool as he recalled his seemingly odd-couple friendship with Nancy Reagan."}]
