[{"comment_id":"10153729892456509","commenter_b":"I'm certainly not by any mean defending China's actions but it's quite hypocritical to criticize them while America commits terrible animal crimes too. That chicken, beef, bacon, etc. are almost from animals living in poor conditions and slaughtered. It's just favoritism to defend one animal and not another. To condemn one country and not another. Like Ramapriyan says, stop trying to be the world police.","commenter_a":"Just returned from Singapore and Hong Kong. Both very awesome cities.","post_message":"Plan on visiting any of these cities this year? @webpagelink"},{"comment_id":"10152777670593525","commenter_b":"Hahaha she can do it, especially since she has that walker she'll smoke that nigga","commenter_a":"@username Xana Smith @username Alice needs to get on her grind! Lol","post_message":"95 years old and still setting records on the track…"},{"comment_id":"779978185438256","commenter_b":"And she is responsible for 100s of men being killed.","commenter_a":"In the Commander In Chief Debate tonight, wondered if anyone noticed that Hillary was wearing an earpiece. See picture here at @webpagelink Only thing that makes sense was that she was being fed the answers. That's why she sounded so scripted and robotic. Donald Trump was Presidential tonight. Hillary's \"in you face\" lies to the Veteran who asked the question about National Security cannot inspire confidence in the American public. How can anyone still support her? Trump is the only choice! America First is the plan!","post_message":"THANK YOU to our fantastic veterans. The reviews and polls from almost everyone of my Commander-in-Chief presentation were great! In addition, THANK YOU for hosting us this evening, Intrepid Sea, Air & Space Museum! -DJT"},{"comment_id":"10153001992671770","commenter_b":"discusting","commenter_a":"Who cares ?? I DO NOT CARE !!","post_message":"Lather, rinse, repeat. Kim Kardashian's posting cleavage shots again."},{"comment_id":"10154262927371519","commenter_b":"What a faggot","commenter_a":"She was just on Rachel Maddow. I was in tears. This has to stop.","post_message":"He also threatened to rip off her hijab."},{"comment_id":"642968752533659","commenter_b":"Amazing that this man who is causing all this problem is in cahoots with the Clinton foundation. Also the Muslim brotherhood. Look it up. He's also a lawyer who helps to bring in people illegally. Real \"good\"guy...and why was he attacking Trump? Trump did not want the war nor was he president or a senator who voted for the war. Nor is he the president now who has let ISIS run amok.","commenter_a":"He doesn't need to apologize. Hillary Clinton needs to apologize. If we did not go to Iraq their son would still be Alive. Hillary is to blame for running arms to muslim brotherhood. Khan attack Trump on national television. Trump responded. And cnn is Hillary Clinton fan club. Lol","post_message":"\"Is it difficult for your father to apologize?\" a co-host asked Eric Trump"},{"comment_id":"452057048331142","commenter_b":"I'm in love I think! She hit the nail on the head.","commenter_a":"You tell'em Grans....","post_message":"Race-Baiting CNN Host Is Shocked At Grandma Answers To His Questions:  is no such thing as  privilege' [VIDEO]"}]
