[{"comment_id":"471958379619606","commenter_b":"People like carl can't help themselves... He is a result of stupid people having children.... they raise more stupid people... in turn that have more children.....which sadly are unleashed on the rest of us..... It's and incredible and sadly unstoppable event...... OR its that he has to call his mommy Aunt Mommy and his daddy Uncle Daddy... Showing us why incest is illegal... . either way they unleash these morons on the rest of us to deal with....","commenter_a":"Wow talk about prostituting your site @username. Look what I found as an advertisement on your story.","post_message":"Unbelievable."},{"comment_id":"1005002076233312","commenter_b":"We do but not you please.","commenter_a":"She doesn't have a heart","post_message":"Do you agree with Hillary Clinton? #SCPrimary"},{"comment_id":"1024169244346094","commenter_b":"So basically, nobody proofread the most important speech this woman will probably ever make. Yah, right. Wish there were SOMEONE I wanted to elect.","commenter_a":"all the first ladies speeches hold such content,, it is a speech of genuine concern and well they all have the same ideals,, so look up some other first lady speech's,, it will be a great opportunity to learn s0mething new and see what content the other first lady speech's hold,,you might find out something very interesting,,","post_message":"A speechwriter for Melania Trump is taking the blame for lifting passages from a 2008 Michelle Obama speech, admitting she made a 'mistake' – while saying she offered her resignation, but it was rejected. Full statement: @webpagelink"},{"comment_id":"10153952900813984","commenter_b":"She should Benin jail!","commenter_a":"How many of those radical Islamic terrorist countries donated to the Hillary fund. She knows they did.","post_message":"Hillary thought she'd jump on the opportunity to steal some attention from the Republicans during the debate, but it did NOT go as planned. Critics immediately fired back and pointed out something hilarious... Is Hillary Clinton one of the last people you would ever want to become president?"},{"comment_id":"10152474320835927","commenter_b":"The ones I know aren't allowed to voice an opinion.","commenter_a":"The rest can't say anything 'cause they're still in boot camp.","post_message":"Does President Obama deserve this low approval rating for military personnel? Leave a comment... Read More: @webpagelink"},{"comment_id":"1322047887828041","commenter_b":"seriously these 2 girls acting like trash why would you act like that in front of your kids??","commenter_a":"Eddie Fregoso @username lol","post_message":"BRAWL AT CHUCK E. CHEESE: A huge fight broke out among parents at a Chuck E. Cheese. This scene went on for about 10 minutes until officers finally arrived to break it up. VIDEO: Philip D. MORE: @webpagelink"},{"comment_id":"1736894583244313","commenter_b":"Jenny Fabbri Some of the images leaves much to be desired. Efforts are commended.","commenter_a":"Good, but they cannot do same for migrants?","post_message":"Awww... some amazing footage of a kitten revived by Italian coastguard's kiss of life..."}]
