[{"comment_id":"1267032153376522","commenter_b":"What with the Department of Health Services do to \"right size\" the Wisconsin Well Woman Program again if women coming flooding back to the program if the Marketplace goes away?","commenter_a":"How do we make people aware of Ryan's many sleights-of-hands that harm people?","post_message":""},{"comment_id":"950439771634160","commenter_b":"Yeah you are a coward you b*tch","commenter_a":"Didn't any of you read this Bill or just the miss leading article Think Progress put up. Probably not the Bill will make it a CRIMINAL offence to conceal you're Identity by using a hoodie. Read the Bill you look Stupid making comments you know nothing about","post_message":"Ugly stereotypes shouldn't be enshrined into law"},{"comment_id":"10153306499856770","commenter_b":"She's pathological. Plain and simple.","commenter_a":"Yeah Hillary, you are just the best liar around!!!","post_message":"Hillary Clinton claimed, \"I have tried in every way I know how, literally from my years as a young lawyer, all the way through my time as Secretary of State to level with the American people.\""},{"comment_id":"10153146614743984","commenter_b":"You Dum bitch","commenter_a":"IMPEACH OBAMA NOW that damn MUSLIM","post_message":"Wow. I'm sure this is the last thing Obama wanted to slip out to the public. Do you think Obama is one of our worst presidents ever?"},{"comment_id":"10153301412809641","commenter_b":"tuch","commenter_a":"Warning: china is about to end... u.s. is the most powerful country in the world!","post_message":"BREAKING: Nearly every U.S. federal government agency has been hit by a massive hack thought to originate from the Chinese military, and millions more workers could be affected: @webpagelink"},{"comment_id":"916372545089161","commenter_b":"She is beautiful. But ugly women and men with little dicks see the opposite! :-)","commenter_a":"She is still pretty","post_message":"Where HAS Michelle Obama's hair gone?"},{"comment_id":"1116440755118842","commenter_b":"O the transcripts, that was so lame lady. #LameLady","commenter_a":"Bernie did well as always I believe him. I'd like to remind he Secretary you have to win the primary first. I'm checking out now, I just can't stand to listen to her. I don't believe her I don't trust her.","post_message":"For updates from the #DemTownHall in Nevada, check out our liveblog: @webpagelink"}]
