[{"comment_id":"632963596894219","commenter_b":"No one with half a brain watches her ANYWAY!!!","commenter_a":"WHO'S OPRAH","post_message":"People are finally getting fed up with Oprah... Great. Let's get this hack off the air once and for all. Should Oprah be kicked off TV?"},{"comment_id":"990875947619544","commenter_b":"Such an evil, self-serving, grandstanding waste of oxygen!","commenter_a":"Wasn't he born in Canada?","post_message":"At least he's fighting imaginary foes, this time."},{"comment_id":"1763785047184730","commenter_b":"Nice mouth for a lady?","commenter_a":"and this is supposed to negate every racist, woman hating, derisive thing he's said in the past 9 months???? Fuck off!","post_message":"Do you support Trump?"},{"comment_id":"1988963441329253","commenter_b":"LOL I never ever listen to any of her crap music.","commenter_a":"Thats right America! Keep giving your money to hollywood libs! Making them millionaires! She and her thug hubby laughing all the way to the bank...","post_message":"***FIRESTORM*** An online #BoycottBeyonce campaign to boycott Beyoncé and her music has picked up steam since the pop star performed a controversial tribute to the Black Panthers during the Super Bowl halftime show on Sunday....Developing..."},{"comment_id":"10154369386511545","commenter_b":"Imagine if someone came and ruined America and a civil war started. People killing and fighting everyone. Not everyone has the money to buy guns or the nads to pull a trigger. Hopefully that never happens but I am guessing people would try and leave, some in a hurry to wherever is better and closest....and hopefully don't get turned away at borders.","commenter_a":"Why, oh why, can't the pot stirrers understand the difference between LEGAL and ILLEGAL when it comes to immigration?!? The US was indeed made up of immigrants, and we love immigrants still, WHO COME HERE LEGALLY. And while I'm at it, why should we take in refugees WHEN WE HAVE NEEDY AND HOMELESS AMERICANS IN EVERY MAJOR CITY IN THE US? Let's give the CITIZENS all the benefits first. Why is that such a hard concept for some people? Seriously! Do you really think any other country in the world would put refugees AHEAD of its own citizens?!? No! Americans first, then help others. Just like in an airplane, put YOUR oxygen mask on first, then help the ones around you. Oy!","post_message":"The full commercial didn't appear on television during the big game after it was rejected by Fox. The full ad, which is nearly six minutes long, is available on the company's Twitter account."},{"comment_id":"10153590629541336","commenter_b":"Lady?","commenter_a":"How the hell is this \"lady\" not behind bars","post_message":"Ed Henry: “You were the official in charge. Did you wipe the server?” Hillary Clinton: “Like with a cloth or something?” WATCH: Today at a news conference, Ed Henry pressed Hillary Clinton as to whether or not she wiped emails from her personal server."},{"comment_id":"541360652655195","commenter_b":"Muslims are buggering parasites that get alone with no one","commenter_a":"NO ONE FORCED THE MUSLIMS TO LOOK. THAT WAS THEIR MISTAKE. KEEP YOUR NOSE OUT OF OTHER POEPOLES BUSINESS.","post_message":"A pastor posted this controversial sign outside his church and it caused a huge stir in the community. His response to his critics was very simple."}]
