[{"comment_id":"10153509891501051","commenter_b":"Oh ya.....that'll stop the criminals from getting illegal guns!","commenter_a":"AGREE all the way","post_message":"Do you agree or disagree with the majority of Americans on this?"},{"comment_id":"1204572852997751","commenter_b":"Oh man....","commenter_a":"Alex Chapman WTF is it even gonna be worth watching that's 3/4 out of it now","post_message":"'No more soggy bottoms'"},{"comment_id":"1848158328804181","commenter_b":"Why would he not mention her. The media is so biased you know they won't mention her in any other way then to make excuses for her.","commenter_a":"Can he EVER answer a question WITHOUT mentioning Hillary Clinton??","post_message":"Donald J. Trump to George Stephanopoulos on being criticized for taking time off campaign trail to open new hotel: “Nobody complains when Hillary Clinton goes to an Adele concert.\" @webpagelink More tonight on ABC World News Tonight with David Muir and tomorrow morning on Good Morning America."},{"comment_id":"596422073879016","commenter_b":"Its fake.. its fraudulent votes, illegal aliens paid to vote.. pay to play.. if you vote for horrible hillary you can come and you can stay.. I do not believe for one single moment that those votes are legitimate.. Horrible Hillary couldn't win an honest election. She has to cheat as she has cheated and conived her way all along the trail from Arkansas to Washington D.oesn't C.are..","commenter_a":"And yet, none of this matters WHATSOEVER. And by the way, why does it take two weeks after an election to get a final tally?","post_message":"Thanks to votes still being counted in California and other western areas, Hillary Clinton's vote advantage hit the 2 million mark."},{"comment_id":"1528359970798514","commenter_b":"Hillary is a traitor!","commenter_a":"At what point do you recognize the whole process is a farce and Hillary's presidency has been predetermined and bought since 2008?","post_message":"What questions do you have about the Democratic and Republican primary races? We are live with WSJ's Aaron Zitner and Dante Chinni now."},{"comment_id":"10154391127173181","commenter_b":"Good grief, this woman needs to get a life!","commenter_a":"Me, me, me, me, me, me, me, me, me, me,me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me,me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me,me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me.","post_message":"...continues, globally, to overwhelm my appearance at the Oscars, on the occasion of my record-breaking 20th nomination, and to eclipse this honor in the eyes of the media, my colleagues and the audience, wrote Meryl Streep in a scathing statement about the Oscar dress dustup."},{"comment_id":"10154336216583010","commenter_b":"An illegal aliens will take the job for pennies on the dollar...or a machine will replace you.","commenter_a":"But..but, if we raise minimum wage and pay people overtime, that would just create \"Dependency\". Then everyone who works for a living will expect to be paid a fair wage. Because you know, minimum wage jobs weren't meant to teenagers the hoopnard tractor socks because the hoodad ya ya. You're not supposed to pay for stuff like luxuries like food and rent because inflation. Death. Destruction. Burger flipping robots, twenty dollar Big Macs, dogs and cats sleeping together, locusts with the face of man, all because a soldier gets less than a french fries cook. Benghazi. Save up 112 years and go to school if you want $15 an hour, moochers ! Tuition isn't that expensive if you sell a kidney. You have TWO, stop feeling entitled to your organs. If you really want to help people get ahead, give MORE TAX breaks to the rich and keep the gay ...","post_message":"More than two-thirds of Californians support the state gradually increasing the minimum wage to $15 an hour."}]
