[{"comment_id":"10153836733820950","commenter_b":"You are a sick women. Hope you burn in hell","commenter_a":"Disgusting","post_message":"The mother reportedly removed the infant from the closed fridge after 3 hours."},{"comment_id":"10152889547313299","commenter_b":"I thought I could not dislike this so called woman any more than I do, but, taking a disabled parking spot is outrageous!!! Did she get a fine? Everyone else would have. Do you really want to see this self-centered, rule breaking murderer as president???","commenter_a":"Hilliary is entitled to be queen and all the common people are her court. she can be charming but she's Danger with a capital Dl . she is deceptive with a capital D and isn't that strange Democrats. Is a capital D too","post_message":"Hillary Parks in Handicap Spot ... @webpagelink"},{"comment_id":"10153249048488352","commenter_b":"Pure evil heartless bitch","commenter_a":"The same thing should happen to her no doubt about it","post_message":"Texas woman, 26, found guilty of suffocating fiancé's two-year-old daughter to death using duct tape after he broke up with her"},{"comment_id":"10155111433599614","commenter_b":"'@username in Oregon not her she stinks hahah","commenter_a":"Jessica @username Davenport what an idiot lol","post_message":"The woman said she tried to get her pet ball python -- 'Bart' -- out using cooking oil, but that didn't work.  She went to the hospital, where her ear was numbed and stretched even more, freeing Bart.  'He acted like nothing even happened and was totally chill,' she said."},{"comment_id":"937512336383801","commenter_b":"What goes around comes around ppl remember that !! They will get theres !","commenter_a":"If I find out you were ask and turned them down I wiil. O longer listen to your music. Bon Joni is off my list. Even Adele since she supported Hillary.","post_message":"Seriously?!"},{"comment_id":"10153638763994342","commenter_b":"'@username he's not interested in your girlfriend","commenter_a":"Breaking: Lavoy Finicum, Marine, Rancher, father, and grandfather will be laid to rest today. He loved God, the constitution, The United States of America, and his family.","post_message":"Police say the local rapper was shot four times. He is expected to survive. #abc13"},{"comment_id":"10154440121543525","commenter_b":"ARE YOU WITH NO SIN, MAYBE YOU SHOULD NOT THROW STONES AT GLASS HOUSES. YES MICHAEL JACKSON AND PRINCE MAY HAVE BEEN DRUG ADDICTS, BUT THEY WERE BOTH AN INCREDIBLE TALENT, AS WAS WHITNEY HOUSTON ON THE FEMALE SIDE. SHE UNFORTUNATELY WAS A DRUG ADDICT. BUT SHE HAD AN INCREDIBLE VOICE. BUT ALL I AM SAYING IS LEAVE THE JUDGEMENTS TO GOD, BECAUSE I AM SURE YOU ARE NOT WITHOUT SIN.","commenter_a":"Who cares, he was a drug addict just like Jackson. Both were not exactly someone to look up to.","post_message":"Ten years ago today, Prince performed what's been called the greatest Super Bowl halftime show ever -- belting out 'Purple Rain' amidst a driving Florida rainstorm. #RIPPrince  WATCH HERE: @webpagelink"}]
