[{"comment_id":"10159170889790206","commenter_b":"Oh he will make it 8. So grow up big sissy babies.","commenter_a":"Good. He's embarrassing enough here. We don't need him going abroad and doing his clown act live for the rest of the world.","post_message":"JUST IN:"},{"comment_id":"10153354052466770","commenter_b":"Who cares what a woman beater thinks fk off chrissy","commenter_a":"Racist lives matter","post_message":"He had nothing good to say."},{"comment_id":"10153244539676756","commenter_b":"And women like @username have no problem eating corn on the cob with those buck teeth!!","commenter_a":"Glad I live in the U.S.!!","post_message":"In Russia, women are prohibited from doing 456 types of work.   In Nigeria, it's not a crime to hit your wife for the purpose of 'correcting' her.   In Iran, a woman can be jailed for not following the Islamic dress code, which includes wearing a hijab."},{"comment_id":"10153240103694575","commenter_b":"Don't nobody wanna hear that mess they need to charge her as an adult.","commenter_a":"You failed at parenting now it's time the state steps in with a real punishment!!! I don't know why that woman is trying to act like if someone beat her kids like that she wouldn't want to beat the crap out of them! Fact is you raised the one that did it. SHE MADE HER BED NOW IT'S TIME TO LAY IN IT!!","post_message":"Russ McQuaid spoke today with the mother and grandmother of the teen girl accused of attacking another girl and a young boy in Brookside Park.  The suspect's mother says her daughter suffers from PTSD and other ailments.  See more of the interview here: @webpagelink"},{"comment_id":"1668356646775381","commenter_b":"The truth will set you free and she spoke the truth.","commenter_a":"Fox should listen to its viewers. Go Stacey","post_message":"Stacey Dash has been suspended by Fox News for saying this to Obama. She needs our support. Should Stacey Dash be reinstated?"},{"comment_id":"1062563810499126","commenter_b":"Proud to be a new yorker","commenter_a":"What a bunch of BS!!!","post_message":"Former New York City Mayor Rudy Giuliani speaks at the RNC.  Donald J. Trump introduces his wife Melania Trump and she speaks at the Republican National Convention."},{"comment_id":"841624465874895","commenter_b":"Feminazi to the ugly bone!","commenter_a":"Good for him, shame on his wife.","post_message":"'When the doctor came out, he said 'there’s a real problem with your son.''"}]
