[{"comment_id":"890066024388849","commenter_b":"Our own government is gonna put us in a civil war to survive all this mess.....SOMEBODIES GOT to be making dirty money off all this illegal stuff going on....unbelievable","commenter_a":"Send all of them packing NOW.","post_message":"ILLEGAL TSUNAMI 2.0: 12,509 Illegal Kids Already Over Border In New Wave (VIDEO)  The next explosion of illegal teen border crossing is in full swing, but just one-in-six are being sent home, with most of the rest settled in the United States,...  @webpagelink"},{"comment_id":"1733272846942683","commenter_b":"Girl bye! Ain't nobody listening to your BS. Ms Lori.","commenter_a":"Poof Obama creating race card and divide.... Michelle just made it clear she lives in the house built by slaves! REALLY?! A spokeswoman for the first lady says that Michelle Obama currently has a staff of 24. So, she has slaves using taxpayer money too, huh?! You have done nothing but create racial divide while in that house! Nothing deserving or anything to brag about....You could have gone down in history as a great black leadership in that house. Instead, you have did the biggest disservice to people of color by creating the deepest racial divide I have ever witnessed in my well over 50 years of life! You have weakened our country security and will go down in history as one of, if not the worst President in USA history!","post_message":"'Don’t let anyone ever tell you that this country isn’t great.' - Michelle Obama delivers an emotional testimony to the greatness of the United States of America. @webpagelink"},{"comment_id":"551724101692742","commenter_b":"He is the Only Hope we have,,,,,,,,can't keep Letting Career politicians Destroy Our Country!","commenter_a":"Yes I do!!!","post_message":"More than half of Trump supporters say he won't be able to fix America.   Do you think Trump will be able to 'Make America Great Again'?"},{"comment_id":"623158744555639","commenter_b":"Oh my that thing looks scary","commenter_a":"Adriana R. Eiro","post_message":"A baby chameleon is born"},{"comment_id":"10153748697767629","commenter_b":"If white women didn't flunk every black and Latino out we might have the blacks in college and in education that we need.","commenter_a":"When are we going to start making teachers uncomfortable and scared? its a white, more privileged profession with more time off. Especially at the college level. Shouldn't they fear being shot in the head too? Thankfully we are getting guns on college campuses so that all authority can be radically challenged with an in your face confrontation. The Russian left has always known the power of confronting authority so I'm glad America is catching up. War and Revolution baby! Just like the founding fathers intended.","post_message":"This is beautiful."},{"comment_id":"10154115958779740","commenter_b":"How is chatting about baseball anything like questioning someone about their personal relationship with religion...?","commenter_a":"If they can't talk about repentance and God then they can't talk about anything else either outside of the law and professionally defined parameters consistent with law enforcement . We can't be picking and choosing what a man can talk about. What? Are we going to ban cops from discussing baseball? What about 'hello Mrs Jones, how's the husband and kids, has Mr Jones been staying sober?'","post_message":"Should officers be allowed to preach to civilians while on duty?"},{"comment_id":"10153628855141336","commenter_b":"What is wrong with this girl?","commenter_a":"Her poor parents. Bet they wish they could raise her all over again.","post_message":"What did you think of Miley Cyrus' barely-there ensemble?"}]
