[{"comment_id":"10153404466085950","commenter_b":"Go Trump!!! Scared?? Everyone's voting for him!!!! I'm scared of Hillary lying Clinton!!!! Speak for yourself sweetheart","commenter_a":"I'm hoping that if he's the Republican candidate, people will be scared to vote Republican and will therefore vote Democrat.","post_message":"BREAKING: Donald J. Trump will win the South Carolina Republican primary, CBS News projects @webpagelink"},{"comment_id":"10155170960495093","commenter_b":"You know, the more I see about Manspreading and Manslamming and Mansplaining and etc...the more I think \"Womanwhining\"","commenter_a":"How bizarre that a feminist would lie while trying to make a (man-shaming) point. First time for everything, I guess","post_message":"The term \"manslamming\" comes from one woman's claim that she walked around NYC without moving out of anyone's way and almost every man slammed into her but almost no women did.   So National Review's Katherine Timpf decided to try it out herself  and 66 women ran into her vs. just 23 men. You can see video of all the slams here:"},{"comment_id":"10153043301434411","commenter_b":"probably a women could define.","commenter_a":"So does this apply to women?","post_message":"Warning! Selfie men!"},{"comment_id":"10156981805725725","commenter_b":"Someone should exterminate these lowlifes","commenter_a":"You sorry protesters making violence! Mr. Trump paid for that rally in Cali you only making yourself look bad @username will even make America great for you guys. Stop making yourselves look like fools!! Thanks Bernie for the awesome soundbite!! I think that is personally the best campaign slogan to help @username. \"Hillary Clinton had bad judgement.\" @username 2016!! MAGA! Get out and vote Indiana and California!!! We are behind you 100% Mr. Trump in Mississippi!! My in laws in California are voting for @username!! Across the nation Trump 2016!! Your vote matters love America and vote Trump!","post_message":"Thank you Costa Mesa, California! 31,000 people tonight with thousands turned away. I will be back! #Trump2016"},{"comment_id":"10153501091738690","commenter_b":"Afgan want peace but usa want target killing of muslims.","commenter_a":"Afghan was peaceful peoples. Bu when usa attack on afghan they become defender and now usa and others calling terrorist. Shame on you.","post_message":"At least 17 policemen have been killed in Afghanistan's Helmand province after \"hundreds of Taliban fighters\" attacked the police compound, officials said. @webpagelink"},{"comment_id":"1272631619499754","commenter_b":"There are hundreds of billions of untaxed dollars, probably trillions going to Mexico every year through the boarder in drug profits. An effective wall and boarder security will prevent tons and tons of drugs from coming in, as a result people wont be able to buy as many drugs so the money they would normally be using to buy drugs will be spent on other things that will help the economy. So not only will it prevent drugs from coming in but it will prevent billions from going out to Mexico and that money instead will be cycled through the US economy and taxed every step in the cycle. This wall will also help clean up the drug abuse problem our society has and save many lives to overdose and drug related violence. Not to mention illegal immigrants not paying taxes but also sending their extra money back to Mexico. ...","commenter_a":"LOL..heck he doeesn't even know what he is talking about how can he keep up with himself...just hilarious to watch each day what has changed. Ya know, I think his hairdresser is leaving the bleach on too long and it is affecting his brain..just a thought.","post_message":"As the Trump campaign tries to pitch minority voters, Donald J. Trump's  position on immigration seems to keep changing."},{"comment_id":"10153336702199342","commenter_b":"Like my GRANDMOTHER WOULD TELL KEEP YOUR DAM MOUTH CLOSE .","commenter_a":"Pearland officers cool cops!","post_message":"What really happened when former Houston Oilers player Lamar Lathom was pulled over by Pearland police?  Lathon says one thing, while police say something else.  Now, we have the dash cam video .  STORY/VIDEO --> @webpagelink"}]
