[{"comment_id":"10152738126476051","commenter_b":"What a dumb woman","commenter_a":"Just give her the money and don't accept any more invitations from her, damn !!!","post_message":"The woman who invoiced a 5-year-old for missing her child’s birthday party has a message for all the haters."},{"comment_id":"1382876735088925","commenter_b":"This bitch is evil","commenter_a":"I bet bin laden isn't dead. !","post_message":"THIS IS ABSOLUTELY HORRIFYING!"},{"comment_id":"10155348213273132","commenter_b":"Oh boo hoo! Get over yourself! The world doesnt revolve around Queen B! Plus she is not the same artist she used to be... of course her sister would be the one to start the unnecessary drama lol","commenter_a":"Beyonc is not all that any more ADEL IS ABSOLUTELY THE BEST SINGER EVER Beyonc did not get snubbed She lost GET OVER IT","post_message":"have only been two black winners in the last 20 years for album of the year.'"},{"comment_id":"10152864782686336","commenter_b":"Musa, you're butt ugly!!","commenter_a":"Please disclose his identity so that these western pigs would stop blaming islam for all their atrocities.","post_message":"Breaking News: 1 of 3 suspects in Paris terror attack surrenders to police, French judicial official tells the Associated Press. @webpagelink"},{"comment_id":"10153666671338797","commenter_b":"But Jennifer Fillpone u did not lose he's a smart man Rham don't vote just for race.","commenter_a":"Ha~ha :) :)","post_message":"#BREAKING: Mayor Rahm Emanuel did not receive the 50 percent majority needed to avoid a runoff election.   Emanuel has been forced into a runoff with Jesus Chuy Garcia. Details here:"},{"comment_id":"521952154659744","commenter_b":"When pigs fly, I'll believe it when I see it!","commenter_a":"Thank you for finally thinking of Americans and our safety !","post_message":"BREAKING..."},{"comment_id":"10154874760616037","commenter_b":"He said he was deporting illegal CRIMINALS not all illegals.","commenter_a":"it would cause a shitstorm...seeing police officers pulling parents out of their homes while kid's look on crying...meanwhile it would be all over CNN...and the divide between people and officers would be even greater","post_message":"Officers are 'not going to engage in law enforcement activities solely based on somebody's immigration status.'"}]
