[{"comment_id":"10153150337159607","commenter_b":"He didn't live there 6 years. Stop believing everything you read, or make up in your head. Respect his family and friends right now and stop thinking this was a conspiracy","commenter_a":"Police did it he was going to expose the police for the dirty","post_message":"A Baltimore City police officer was found facedown in the water in South Baltimore Tuesday night. Officer Prashanth Davis, 34, was pronounced deceased at the scene."},{"comment_id":"10154023438494486","commenter_b":"WHERE IS HILLARY? SHE SHOULD BE THERE, SHE WOULD HAVE GIVE HIM A BIG HUG OR A BIG KISS.....LMAO","commenter_a":"I don't think Obama was trying to shake his hand. it was almost like he tried to put his arm around Castro's shoulder and Castro stopped him or something. It was weird.","post_message":"Be careful! That's his THROWING ARM"},{"comment_id":"10155207615341037","commenter_b":"No politics?!?!?! You are not paying attention. 😂😂😂 LOVED it. AND what she stands for....only few understand. Good for her. NASTY WOMEN!!!!!!","commenter_a":"There was a subtle political statement in her opening songs but I felt it was out there to move people together. She was nothing less than I expected. She brought down the house. The show was amazing","post_message":"Did Lady Gaga win the Super Bowl?"},{"comment_id":"945737062128382","commenter_b":"Most Muslims are opportunists & try to take advantage of our awesome OPEN accepting country and are trying to push their false religious bogus rules and regs on us. Too late. Two wars have been fought on our soil and much blood shed to protect our American way of life and that includes the right to run a busniess free of foreign rules... do not continue trying to bring foreign laws into the equation..it doesnt fit!!!. America's laws are the way we live life..NOT islam..thats for syria etc..those rules are SOOO not ever going to work here so just try to relax and accept it. Get some counseling. Maybe then you will be happier and free from manmade male imposed non Christian laws. They always seem so negative..no joy in life! You're in America..rejoice..embrace your new life here. Jesus will set you free from the bondage of FALSE RELIGION...ask the ...","commenter_a":"She must follow the rules of the country where they live and enjoy the luxury of that country. If they don't, they must return back where they came from.","post_message":"Muslim woman wouldn't remove hijab, but hypocrisy bit her in a BIG WAY!"},{"comment_id":"10153938743204087","commenter_b":"Karma is a Bitch!!! #NEVERHILLARY #STILLSANDERS #JILLNOTSHILL. #DEMEXIT","commenter_a":"And Bernie wants us to support her boss Hillary.","post_message":"DNC chairwoman Debbie Wasserman Schultz referred to Bernie Sanders' campaign manager as 'scummy' and a 'damn liar' in a leaked email published on Friday by Wikileaks."},{"comment_id":"10154451806701336","commenter_b":"'@username no he wants to ban people ! Refugees are properly vetted - since we have had close to a million come in since 911 !","commenter_a":"Something is wrong with the America I grew up in.. it's called liberalism!","post_message":"Just In: Elderly patient and nurse shot and killed at hospital in Titusville, Florida. Police have not released information on suspect or motive. More: @webpagelink"},{"comment_id":"1085742424820999","commenter_b":"Steven Lumb then ask yourself why. She must be doing something right.","commenter_a":"So after my 12 years teaching and three post-grads I am still not allowed to call myself a professor but she can, in her first teaching job, what a joke.","post_message":"2016"}]
