[{"comment_id":"1084748028260016","commenter_b":"@username like they said there would never be a GREAT WALL OF CHINA. There will be a wall!!!!!","commenter_a":"Oh my god, people keep talking about Trump's \"wall\" as if it's an actual thing. It's not a thing. It will never be a thing. It's just a distraction so people don't ask him about real issues that he has no answers for!","post_message":"\"At the start of my conversation with Donald Trump I made it clear that Mexico will not pay for the wall,\" Mexican President Enrique Peña Nieto tweeted in Spanish from his official account."},{"comment_id":"10153767932239411","commenter_b":"Anna Tagintseva shut your mouth bitch","commenter_a":"I know those Chinese universities are bullshiting all the time and yet @username believed it. And someone believe that China will go against US with the help from Russia? Come on, China and US need each other, while Russia will have to stand back and watch.","post_message":"'The increasing pro-active position by China is built on increasing sophisticated and powerful military technology in China defense and military sector. This factor makes US increasingly worried.' - Xin Zhang, Research Fellow at East China Normal University. (Op-Ed)"},{"comment_id":"10153653685189099","commenter_b":"Go burn your bra somewhere else please","commenter_a":"If she got things done Monica wouldn't have had to step in.","post_message":"Asked whether she's progressive or moderate, Hillary Clinton described herself as a \"progressive\" with \"a long history of getting things done\" @webpagelink #DemDebate"},{"comment_id":"10152862008521336","commenter_b":"I'm so glad they caught those scumbags without more bloodshed. It still is b@llshit that some people think shooting at cops is an appropriate action to try and prove a point. If you want a lawless society I'm sure there is some third world country that will accept your dumb@ss.","commenter_a":"He Could Be Obama's Son!","post_message":"UPDATE: Two suspects are in police custody Tuesday for allegedly shooting two plainclothes NYPD officers responding to a robbery."},{"comment_id":"1121552027901325","commenter_b":"@username What percentage of women are voting for Hillary only because she is not a man?? Works both ways ladies!","commenter_a":"@username is a disgrace and is absolutely unfit to be Commander in Chief. Period.","post_message":"We can't accept this as \"normal.\" It's time for commonsense steps to help stop gun violence: hrc.io/GunViolence"},{"comment_id":"10156484375905354","commenter_b":"MmmmHmmm so should welfare bitch!","commenter_a":"Chicago thugs on welfare should be fedubded.","post_message":"\"One of our major demands is that police be defunded and that that money used to fund police be used to fund black futures....\""},{"comment_id":"1160371997392384","commenter_b":"She made us women proud!","commenter_a":"Proud of you, and I don't even know you! I spend a lot of time in Florida although I don't live there. If I ever encountered Scott, I'd like to think I'd tell him off, perhaps not so 'eloquently'!","post_message":"\"In some ways this is about me and my personal interaction, but it's also about all of us who are having to live under the reign of Governor Scott.\" - Cara Jennings"}]
