[{"comment_id":"490217177839688","commenter_b":"YOU BITCHES DON'T MISS ANY WELFARE MEALS DO YOU!","commenter_a":"Only thw Daily Dummies would bring more media attention to something like this. Learn the legal system who iduots. This guy wasn't guilty ever and the rest of Baltimore now knows it too.","post_message":"Baltimore city residents expressed disappointment in response to the city circuit court Monday finding a police officer not guilty in connection to the death of Freddie Gray."},{"comment_id":"10154026090214087","commenter_b":"Obama give the worlds largest terror sponsor a nuke deal. What the hell is that shit about? I know whats going on. You are just stupid. Hillary's top aide huma is a fucking muslim terrorist. This bitch lived in the middle east and wrote for Islamic extremist magazine. She wrote all kinds of anti american articles. And you dumb dip shits run around blind as a damn bat. You people have some real issues. Liberals are whack.","commenter_a":"I think Obama being the first Black President/so awesome set the bar too high for the first female President. We know many stellar women before Hillary never got a shot in politics. Hopefully Hillary breaking the glass ceiling improves equality even tho shes not ideal.","post_message":"\"Hillary Clinton is still changing the way we thought about women as spouses and politicians.\""},{"comment_id":"850412481815995","commenter_b":"Ungrateful bitch deserve to be slaped","commenter_a":"Y can't fix stupid","post_message":"If you disrespect our troops, you don't deserve to live in this country. They are the reason you have freedom. They keep us safe. What do you think her punishment should be?"},{"comment_id":"10153571133258132","commenter_b":"Shut up Tina","commenter_a":"Regardless of what this family would've, could've, should've said...90% of you made your judgement the second you heard \"the news\". Until it happens in our own family, none of us have the right to judge. Just as I don't have the right to judge all of you with your incredibly hateful comments. So I won't.","post_message":" watched him like all the time. I took him to work with me. We just poured our life into him.\""},{"comment_id":"10154312259097654","commenter_b":"yes yes","commenter_a":"absolutely!","post_message":"Kellyanne Conway says the media is flat-out refusing to cover the Trump administration fairly. Is she right?"},{"comment_id":"1150014275011477","commenter_b":"Will miss this talented actor....such a great sense of humor intertwined in his roles as \"the villain\".","commenter_a":"Quigley Down Under with Tom Selleck","post_message":"JUST IN: British actor Alan Rickman, known for roles in Robin Hood, Harry Potter, Die Hard, more, passes away at 69: @webpagelink"},{"comment_id":"896491237077292","commenter_b":"Give me a break with the martyrdom... I don't think this is an appropriate way to handle this.. Sian is right.. her's will fade and you will be left with nasty looking legs.","commenter_a":"The things you do for love","post_message":"Their daughter couldn't be happier...she even points at the tattoos and yells 'match!'"}]
