[{"comment_id":"10156697390890354","commenter_b":"I wouldnt be a cop there for any amount of money. I say, disband the police, send those trained officer where they are really needed...and let the animals rape, rob and kill each other. Liberalism worked so well in all the other major inner cities (Detroit - a decaying liberal sh*t hole, Philly, East St. Louis, etc...), let Berkley have a peek at reality.","commenter_a":"--- I recommend abolishing 'UC Irvine\"----much more accomplished----","post_message":"You're not going to believe what they say in their demands letter. As you read it, just remind yourself that these are tomorrow's college educated \"leaders.\""},{"comment_id":"1671482303102466","commenter_b":"I bet he dreams about it!","commenter_a":"Trump is a vulgar idiot yet Rubio is a hero? Seriously people, Trump didn't walk out on stage and say hey I got a big package. Rubio has insulted him for a week about this and Trump ended the insults. Rubio is the one that's vulgar and obsessed with Trumps Package.","post_message":"\"Did he just say that?!\""},{"comment_id":"1359888287387770","commenter_b":"Stupid silly bitches","commenter_a":"And this is who women follow?","post_message":"SADLY, LIBERALS ARE TOO STUPID TO REALIZE WHAT THIS SIGNAL MEANS!"},{"comment_id":"1179490578805054","commenter_b":"@username Little girl please... You have zero inclination of who I am, where I've been and with whom I've walked. My dad always said, \"Never argue with an unarmed person\". Go away before your feelings get hurt.","commenter_a":"A gentleman named Bill Howell eloquently wrote the below letter. Dear Mr. Trump, It’s taken me a while to realize this and to admit it, but I’m grateful to you. For the past few months I’ve spent a good deal of time lamenting your campaign and the poison it has so effortlessly generated. I’ve watched our country imploding, our public discourse become polluted, our political climate grows ever more corrosive, and wrongly assumed you were to blame. It’s only lately I’ve come to understand that you haven’t manufactured our current national ugliness—you’ve simply revealed it. By saying the irresponsible, mean-spirited, ignorant things you say so freely and so frequently, you’ve given other like-minded people license to do the same. You’ve opened up the floodgates for our corporate sewage to flow fully. People no longer conceal their vile mess, they now revel in it, they broadcast it and retweet it. You’ve ...","post_message":"Trump appears to be ready for victory. Do you think he should win in November?"},{"comment_id":"10153359647714138","commenter_b":"Get the place shut down, then sue them for everything.","commenter_a":"Oh no!!","post_message":"When the family didn't hear back from Petco after a few hours they called the store and were told to meet the manager at an animal hospital."},{"comment_id":"10153330634768128","commenter_b":"I saw her get whipped in Cali....she is weak.","commenter_a":"I would support Carly over Hillary. Carly has a record of solid leadership.","post_message":"The former Hewlett-Packard CEO will formally declare her Republican campaign online on May 4."},{"comment_id":"10153362630049641","commenter_b":"Whatever tickles your fancy. Hope you get a free lifetime of ky jelly .","commenter_a":"This country is going to hell in a hand basket.","post_message":"The White House takes on rainbow hues to celebrate the Supreme Court's marriage equality decision: @webpagelink"}]
