[{"comment_id":"1071556556193998","commenter_b":"So true , I love this","commenter_a":"It all starts within by releasing denial, accepting where we are, and then seeing what opportunities are there. <3","post_message":""},{"comment_id":"1551402911832466","commenter_b":"You should check asians' homework","commenter_a":"I absolutely agree!! My husband and I found this to be a problem we felt,for our daughter. We were sending her to a private school until fifth grade,and we enrolled her in the public schools instead. I believe she had somewhat less homework in the public schools but it still seemed a lot. Children definitely need time to be children and to be able to play, make friends,and have free time.","post_message":"American school kids are drowning in homework compared to other countries. Like ATTN: on Facebook."},{"comment_id":"1166185690114851","commenter_b":"I agree Awesome comment thanks :/","commenter_a":"OG gives zero fucks","post_message":"Uber driver loses it after man smokes weed in his car"},{"comment_id":"10153828491470329","commenter_b":"marry me","commenter_a":"@username 2, especially 2","post_message":"We might as well put a ring on it at this point."},{"comment_id":"712201488878460","commenter_b":"Just can't stand that a black woman dresses better than you eh? Jealousy is a sin ya know.","commenter_a":"funny how ms obamas wardrobe has gotten mote expensive over the years. guess jcrew too cheap for her now. oh well, shes outta here soon anyways ;)","post_message":"Michelle Obama wore a familiar outfit last night ..."},{"comment_id":"10153179541492014","commenter_b":"Who cares? She's giving a great Christmas! Good for her!!!!! People need to butt out and mind their own business!!!","commenter_a":"What's the problem? It's her money she works for her family.","post_message":"Sound Off: Is this a great Christmas or way too much?"},{"comment_id":"10153095122281770","commenter_b":"Screw her","commenter_a":"DONALD TRUMP for PRESIDENT","post_message":"Hillary Clinton urged attendees at her Alexandria, Virginia, campaign rally on Friday to “start a competing organization” to the National Rifle Association and join her fight to end the “plague of gun violence.”"}]
