[{"comment_id":"10155088338670615","commenter_b":"The fact he did beaky at Buckingham Palace means he has risen in my expectations.","commenter_a":"Jamie Taylor","post_message":"We ♡ Stephen Fry! Congratulations to the happy couple!  @webpagelink"},{"comment_id":"10153034720411130","commenter_b":"Biggest problem, IMO,is the black daddies who make kids then disappears.The moms are just as bad with 5 kids and 5 different Fathers.","commenter_a":"All lives matter, saying only one race matters is why there is much violence going on. Race should not factor in to it. LIFE matters period, unborn baby, elderly, black, white, or purple with pink polka dots.","post_message":"'How many more minorities have to die at the hands of the police who are supposed to protect us before we finally wake up? How many?'"},{"comment_id":"10154475125548812","commenter_b":"STOP GLORIFYING THIS RAPIST POS.","commenter_a":"I don't think it's real remorse probably embarrassment. Which is great. So it means that the power of social media is effecting thing Even the Vice President commented eloquently. So keep it up share this post pictures and sign the petitions","post_message":"Women who provided character witness statements for the Stanford University swimmer convicted of sexually assaulting an unconscious woman on campus are expressing regret for supporting him."},{"comment_id":"484307825084431","commenter_b":"Funny women are one of the fastest growing group of gun owners .She loses all credibility when she mentions dicks ....so pitiful and uninformed ...","commenter_a":"300 million guns in this country - not enough?","post_message":"How about not...."},{"comment_id":"244406076005864","commenter_b":"'@username drug cartels make millions on drug sales they will find a way around it but okay build a billions worth of wall that will stop evrything","commenter_a":"Thanks for the post, I knew he was good, but I didn't realize he was THAT GOOD!! Awesome! It's sad he has to mop up this big mess from Obummer before he can get around to some other great changes.","post_message":"Give Donald J. Trump a chance? Here's what he's done in the past 36 hours..."},{"comment_id":"506647236198456","commenter_b":"That will get her dinner at the White House.","commenter_a":"I want proof. Then it's not just a vague fb post...","post_message":"Beyonce Posted Letter Hours Before Dallas Shooting, Calling Blacks to  Against Police, That Murder Should Not Go   CHARGE HER WITH INCITING VIOLENCE!   Let's get 5000 SHARES if you think she should be held accountable!"},{"comment_id":"936212533138468","commenter_b":"Stupid bastards, Mexicans are not the only illegals in this country, canadians, europeans and some Asians... Also blacks are not leading the welfare race, more whites are on welfare than the rest of the races! Let that marinate..... Get your assets out there and pick strawberries if you support trump so readily","commenter_a":"Americans will be lining up - lining up - I tell you - for those lucrative strawberry picking jobs.","post_message":"Turns out America's food production relies heavily on immigrant labor, and our farmers are NOT pleased."}]
