[{"comment_id":"1082496428446957","commenter_b":"Taxpayers fund churches!! Churches don't pay taxes! Planned Parenthood is doing a service that they are legally allowed to preform because there are women choosing to have those services done. Christians have no right do insist this be stopped just because of their religious beliefs. I'm sick of Christianity being all high and mighty thinking that it is the end all be all of decision making for everyone else on the planet. Not everyone is a Christian and not everyone must be. Defund your churches!! Make the churches pay taxes!! Every time a Christian stops an abortion make a Christian take in an illegal alien and put him/her through school/college!! Stop hiding behind your bible and pretending to actually care about the embryos because we all know when you're not cursing abortion your wishing gays would go away and praying extra hard that your children won't turn out to be ...","commenter_a":"You know what's really ironic? Your religious organization doesn't pay taxes yet you're complaining about the money spent on abortions. Another thing is that you want to stop abortions but there's starving children right there in your neighborhood and your church and its congregation all have food on their tables, cars, cell phones etc. Then, you even complain about paying for birth control because it goes against your religious beliefs but then you expect non Christian tax payers to pay for your churches. In addition, you believe that your Christianity should trump my rights as a woman and you should decide what I should do with my body because of what your bible says. Well, I'm telling you NO!! Abortion is legal and its going to stay that way because of people like you. Women like me will always be here to stand up for our rights not only just ...","post_message":"Planned Parenthood has made a business out of destroying that which God has created. The one-sided relationship between it's ever-growing bank account and American taxpayers must be severed. That is why I introduced the 'Defund Planned Parenthood Act of 2015.'   #ProLife #DefundPP"},{"comment_id":"1101655299855480","commenter_b":"Can't be bothered. This isn't science its novelty","commenter_a":"I'm skeptical. Tree rings are concentric not spiral. How would the needle track?","post_message":"Find out what tree rings sound like:"},{"comment_id":"10153230104286051","commenter_b":"I agree with that woman keep your garbage with you","commenter_a":"Just a ? For all who are being so harsh. Witch one of you would want that sign by the grave of your loved one. I sure wouldn't want it by my nephews grave. He died from a drug over dose. Oh yes I fully understand and can see both sides.","post_message":"These grieving parents went to visit their teenage son's grave one day when they noticed something on a tree behind his headstone."},{"comment_id":"741587372614642","commenter_b":"Won what???","commenter_a":"You blind-hearted Zionists, you just can't bear it that the Iranians have won and you lost: can you; the barbarians!","post_message":"A year after war with Israel, Gaza rulers boast of revitalized efforts to prepare its fighters for the next round of violence."},{"comment_id":"10152584446122014","commenter_b":"No money for illegals!","commenter_a":"He's not an immigrant. He's a POS rock-throwing illegal alien coyote that's had 14 prior incidents with the border patrol.","post_message":"The judge ruled that the officer was not justified in opening fire on the immigrant who was crossing illegally into Arizona."},{"comment_id":"10153999668791756","commenter_b":"Rapists and murderers... Yeah, idgaf about them. Kill them right away and stop wasting tax payer money.","commenter_a":"Not only 27. 27 too many. How many people were proven innocent after decades of being in jail?","post_message":"'We get it wrong sometimes, and in the death penalty, we just can't get it wrong.'"},{"comment_id":"10154119887406167","commenter_b":"LOCK HER UP!","commenter_a":"Why hasn't Hillary been arrested for money laundering and racketeering?","post_message":"It's not just Trump that's the problem -- it's his family too."}]
