[{"comment_id":"10153557938016438","commenter_b":"That woman is a criminal with a capital C.","commenter_a":"This is why I love Hillary Clinton!","post_message":"Clinton knows the only word a politician enmeshed in scandal needs."},{"comment_id":"1014939015229294","commenter_b":"Then stop importing Muslims.","commenter_a":"Brought to you by liberal idiots like Billary and Obummer: @webpagelink","post_message":"All our prayers are with the people of France. We must stand side by side every step of the way with France and our allies around the world to wage and win the struggle against terrorism and violent extremism.   Even after this darkest night, Paris remains the City of Light. No terrorist attack will ever dim the spirit of the French people or our common commitment to the democratic values we share."},{"comment_id":"10154515362469087","commenter_b":"Way too big of words for this crowd guys. Need to simplify it. Mexicans are the cause. Build a wall and it will rain in California.","commenter_a":"Science is no longer about science. It has become driven to support a liberal socialistic goal. They are as political as anything else and just as suspect of being true.","post_message":"Bernie Sanders: \"A modern society cannot survive unless decisions are made on evidence-based research. Congratulations to those scientists and researchers who are fighting back.”"},{"comment_id":"10153401880031336","commenter_b":"Way to show tolerance","commenter_a":"pft just toss it in the garbage with all the other religious hog wash biblical nonsense!","post_message":"Police have recovered a relic believed by some to be the Holy Grail – the cup Christ drank from at the Last Supper."},{"comment_id":"10152813335961770","commenter_b":"What is he smoking???","commenter_a":"He lies!","post_message":"Whatever you say, Mr. President."},{"comment_id":"10153210557951336","commenter_b":"She said she \"did not want him to be a Freddy Gray\" meaning dead. And no Sharon P ... If people would stop voting for fools like the ones running our congress 80% of our countries problems would be gone... maybe more..","commenter_a":"What she did was what she needed to do at that moment in time. She is a real Mother..who loves her son and wants him to grow up to be a MAN!","post_message":"\"So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.\" – Ruben Navarrette"},{"comment_id":"10153829963431130","commenter_b":"@username The two go hand in hand. you would have to post a naked pic to really prove you point but I doubt that is going to happen. She has blubbery arms and obviously fat hips and thighs.","commenter_a":"She looks amazing. I am a size 6 and I don't look that good naked. She seriously has a bomb AF body","post_message":"“This is for anyone who has ever been called FAT.\""}]
