[{"comment_id":"10153344405883984","commenter_b":"what more does this witch have to do before they put her where she belongs, PRISON!!!!!!!","commenter_a":"Hillary's political career ended with her departure from the State Department as far as I'm concerned. She's never been a vialble candidate for that office.","post_message":"I don't see any way Hillary can escape from this one. She's probably kicking herself right about now... Do you hope this ends Hillary's presidential chances?"},{"comment_id":"10153750780819062","commenter_b":"Why would you trust two gals that looked like that for anything cosmetic?","commenter_a":"Hope they catch them","post_message":"Police have issued arrest warrants for two people in connection to the death of a woman who police say received injections of a substance in her buttocks in a botched cosmetic procedure."},{"comment_id":"10153301412809641","commenter_b":"tuch","commenter_a":"Warning: china is about to end... u.s. is the most powerful country in the world!","post_message":"BREAKING: Nearly every U.S. federal government agency has been hit by a massive hack thought to originate from the Chinese military, and millions more workers could be affected: @webpagelink"},{"comment_id":"477887179066242","commenter_b":"That is so sick why would anyone want abort a unborn baby must one that already born i'll tell you who a sick mf that's who","commenter_a":"They have abortions like it's nothing, no big deal. I used to work with a woman that loudly explained to 2 co-workers how her Dr gave her some pills. She took the pills over a weekend and when she went to the bathroom the fetus fell out. I couldn't believe what I was hearing and was stunned. Made life seem cheap.","post_message":"This is INSANE...STOP THEM NOW! PLEASE SHARE TO EXPOSE THEM!"},{"comment_id":"1921686894724985","commenter_b":"Looks like paid protesters to me....LOL ...Your here with no papers take your happy azz home.....","commenter_a":"Arrested all","post_message":"Protests at the RNC in Cleveland - \"A Human Wall\""},{"comment_id":"10153109594476519","commenter_b":"Women always tell there sob stories, leaving out key facts and events, seen it, been through it, went to jail over it!","commenter_a":"Men that beat woman usually don't get in fights with men.","post_message":"You'll never look at unrepentant woman-beater Dr. Dre again the same way after reading this..."},{"comment_id":"1728765537410558","commenter_b":"She's a Bitch!","commenter_a":"vanstone is an idiot","post_message":"Oh no... I'm praying for Bindi Irwin."}]
