[{"comment_id":"645079822349263","commenter_b":"Get Him the Hell out of the White House!!!!!","commenter_a":"Yeah no! Maybe make some toilet paper with his face on it","post_message":"Obama is trying change our countries money. He has absolutely no right to even consider this change. Do you think Obama deserves to have his face on a dollar bill?"},{"comment_id":"10152768793527377","commenter_b":"I am white and I criticize him because he is an nut. I voted for Obama twice and decry racism. Much of the criticism toward Obama was WAY over the top that NO white guy with the same basic Democrat policies would have faced. The fact that Snopes had to crerate a whole separate page dedicated to just the massive amount of fake viral emails smearing Obama and outright lying with claims so outrageous that any snae person would immediately question but Conservatives swallowed hoook, line and sinker because of their hateful, irrational, racist bias says it all","commenter_a":"He's a good man and could be a good leader , Vice President too!","post_message":"Black “mascot,” “court jester,” “minstrel show”? Tucker says about Dr. Carson."},{"comment_id":"1773052759611713","commenter_b":"Rosemary cant even spell.....","commenter_a":"To the ones claiming that the \"media picks him apart\", news flash guys... the media doesn't have to do anything! Every time he opens his mouth terrible things come out, its not the media, its him!","post_message":"Donald J. Trump and his aides refused to allow reporters to travel with him to D.C. yesterday, breaking decades of traditional press protocol and setting a new precedent for coverage of his administration."},{"comment_id":"1005094719524280","commenter_b":"Well lets send Trump to the southern border...im sure he will find all the rapists he is looking for....as matter of fact he should say to the all latino people in their faces,..you all bring nothing but rapists here....im sure when people came thru Ellis Island to start a new life Trump would have greeted them as well.","commenter_a":"Too bad the Coast Guard isn't on the southern border. The Cubans are actually fleeing a dictatorship.","post_message":"A USA Today reporter observed a U.S. Coast Guard crew intercepting Cuban rafters attempting to reach freedom on U.S. shores. Despite the recent news of normalizing relations between the U.S. and Cuba, these rafters were sent back to Cuba before they could celebrate on the 4th of July."},{"comment_id":"10153293825958132","commenter_b":"Yes, she's milado so she needs to stop.","commenter_a":"She's black and white..so this always confuses me. I guess you can pick your race when it suits you.","post_message":"Halle Berry admits she's \"disappointed\" that no other black women have won the top acting prize."},{"comment_id":"623778954497467","commenter_b":"Hoes fuck over A by picking B. Once B fucks over the woman, woman tries to go for A to save face... but A ain't having that shit and tells her to go fuck herself sideways.","commenter_a":"I believe A is from the Amazing Spiderman...","post_message":"A or B? #WSHH"},{"comment_id":"10153735329829205","commenter_b":"Fuck clinton and her globalist allies","commenter_a":"Come on Loretta lynch meets bill Clinton on the Tarmac before the Benghazi report. See the movie 13 hours in Benghazi please don't tell me that every person in that movie was lying about what happened that night. There was no reason why they all resigned? Like you yourself said maybe technically they did nothing wrong but morally ? And who was to blame ? And what happened after ? And let's not forget the laugh. I would never vote or defend the Donald but let's not call a word on cnn anything but spin for Hillary. They have not even reported on the so called technical issues with the voting errors or for what went wrong with Nevada. Seriously do you honestly think that your viewers cannot see through your crap when you are crapping too ?","post_message":"Michael Cohen is one of Donald J. Trump’s top advisors, an a lawyer. He may have just committed libel against Hillary Clinton."}]
