[{"comment_id":"10154128572736378","commenter_b":"Shouldn't they have to go back home before mommy and daddy lock the basement door","commenter_a":"Wonder if they voted?","post_message":"#BREAKING - Hundreds of protesters are marching through Center City, Philadelphia tonight, near City Hall. They are unhappy with Donald Trump's election. Many of these protesters are local college students, others say they are supporters of former democratic presidential candidate Bernie Sanders. @webpagelink"},{"comment_id":"10153314267037434","commenter_b":"\"Just fly to the UK, no biggie\" except this woman couldn't raise the money to fly to the UK and pay for the procedure that others get for free, and so she ended up in the above situation. \"Fly to the UK, prpblem solved!\" Easy to be callous and glib when its some other poor sucker's life and you're ignorant of the facts, isn't it?","commenter_a":"Yay, Ireland. I live in terror of an unwanted pregnancy because of this kind of insanity. :/","post_message":"Had the woman been living anywhere else in the United Kingdom, she would not have seen a courtroom. However, abortion remains illegal in Northern Ireland."},{"comment_id":"10153656714955575","commenter_b":"Well Baltimore is already torn up for them!!! Wonder what the blacks think about them coming.","commenter_a":"Obama is bringing Mexicans and Syrians in to train them. Terrorist that kill with weed whips","post_message":"Baltimore politicians defying logic once again. . . ."},{"comment_id":"10153183843753188","commenter_b":"Boy if they can do all that in Mexico why are they crossing our borders","commenter_a":"i just came home to Seattle from 10 days in Mexico and it made me think. I think it would be better to be in a country like Mexico if the world went crazy. Those people know how to survive on nothing because they have done it all their lives. They know what to do when the lights go out... they know how to grow food and take care of themselves. I can't even imagine what Seattle would be like if this area was thrown into the same poverty level as Mexico... it would be a mad house!!!","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"10154627536394203","commenter_b":"And Hillary is in a self-serving line person all my God where are you woman you're in dreamland what are you smoking","commenter_a":"The man is entirely self-serving. His ego is his God. Bravo to Rev. Timmons for putting him in his place.","post_message":"Donald J. Trump's latest target? Rev. Faith Green Timmons of Bethel United Methodist Church."},{"comment_id":"10153386310193869","commenter_b":"Not from NYC... but upstate. Older and forgot spelling.","commenter_a":"Concerto for Horne and Hardart (spelling?)","post_message":"Alex Ross listens to both satirical and serious compositions by Peter Schickele, the man behind the comic persona of P.D.Q. Bach."},{"comment_id":"481924841998096","commenter_b":"No Islam. This is The USA, not the Middle-East.","commenter_a":"Yes i support him completely get that islam shit out of our schools and our country","post_message":"A veteran was banned from his daughter's school... for speaking out against Islam? This is absurd. We support this veteran 100%. Do you support his stand against Islam?"}]
