[{"comment_id":"1184449068295865","commenter_b":"A greedy witch !","commenter_a":"Clinton just wants votes she doesn't care about the American People","post_message":"“He used every word in the book. Can you imagine if I said that?” asked Donald J. Trump."},{"comment_id":"10154099091458984","commenter_b":"He is another politician and a big lier as well he cheated in the other debate with Ben Carson he will say anything to get a vote and he will owe a million favors for all the lobbyist sending him,all this money","commenter_a":"Why are people at war all the time with a Democrat or a republican let's change this to U.S. political leaders and vote for a person not a party. They always have to make people take sides and it needs to be changed.","post_message":"With the South Carolina primary right around the corner, Ted Cruz is doing his best to diminish Donald Trump's lead. Cruz's latest attack is getting a lot of attention, and it may cause some voters to ditch 'The Donald.' Is Ted Cruz right about Donald Trump?"},{"comment_id":"786447821458391","commenter_b":"And that woman belongs in a jumpsuit behind bars so what's your point","commenter_a":"Only people with dignity responded! The rest???? This man belong to a mafia organization! Not the White House!","post_message":"Former anchorman Dan Rather has issued a challenge to his colleagues: \"This cannot be treated as just another outrageous moment in the campaign.\""},{"comment_id":"10154355616737293","commenter_b":"He deserves a bullet.","commenter_a":"He looks like Gov. Christie","post_message":"The gruesome revelations are a stark contrast to Kohlhepp’s professional image. But details from his childhood hint at a deeply troubled individual."},{"comment_id":"10153335992009071","commenter_b":"Malia Young-Williams","commenter_a":"Omar Kashmir","post_message":"We tried Shake Shack’s new Chick-fil-A killer."},{"comment_id":"10154473639164749","commenter_b":"Rebecca Jara","commenter_a":"carry knife free zone signs with them. they are very powerful deterrents.","post_message":"\"I would urge parents to speak to their children about the app and the best ways to make sure they stay safe.\""},{"comment_id":"10153706895136680","commenter_b":"Go to hell","commenter_a":"We should be afraid of those 'people' who are different, they're culture and values are incompatible with western cultures and values, they claim their holy book teaches that we must convert of they must kill us... Sounds like these 'people' are going to be a great fit in our country... A nation that was built of immigrants who DID assimilate and welcome the new culture and values of the country they moved too","post_message":"New York Governor Andrew Cuomo says Donald Trump's campaign message is: \"Be afraid of people who are different.\""}]
