[{"comment_id":"848078538560940","commenter_b":"Only fucking idiots want her","commenter_a":"Am I the only person who likes her? Yikes.","post_message":"Hillary Clinton could finally shatter that glass ceiling."},{"comment_id":"10153237393021350","commenter_b":"Great idea but this lady ain't fat...","commenter_a":"You look fantastic!!","post_message":"This mom has become a swimsuit role model."},{"comment_id":"10153567844472434","commenter_b":"Carol Adams you're mentioned here and might enjoy, grrrl!","commenter_a":"Unfollowing. I'm tired of your anti-vegan rhetoric. The fact is that eating meat is the largest contributor to climate change. It is an industry that is notorious for violating human and animal rights and destroying the global environment.","post_message":"Anything mass produced is shitty for the environment, including almond milk."},{"comment_id":"10153198531370950","commenter_b":"Yes, she was just hoping some cop would come in and throw her across the room. See how stupid that sounds?","commenter_a":"def smell a get rich quick scheme in the works :( ugh ...........it was all her own damned fault ,,,,,,,,,,,no payment is deserved !!!!","post_message":"'She now has a cast on her arm, she has neck and back injuries. She has a Band-Aid on her forehead where she suffered rug burn...,' the student's attorney told ABC's 'Good Morning America.'"},{"comment_id":"1404359436262533","commenter_b":"Craigslist HIRED HACKS.","commenter_a":"Sorry not happening!","post_message":"WATCH LIVE: Local organizations are protesting at Phoenix City Hall to call upon Mayor Greg Stanton to make Phoenix a sanctuary city, among other actions."},{"comment_id":"10153835379166336","commenter_b":"Cause white people suck","commenter_a":"That door was racist against white people! Ban all cruise ships and doors.","post_message":"A jury has awarded a man $21.5 million in damages after he was hit by a sliding door on a cruise ship.   MORE: @webpagelink"},{"comment_id":"842682652588978","commenter_b":"She needs to be kicked out of our country, we don't need trash like her kind around.","commenter_a":"Here's another puke, wants everything America has to offer but can't be happy with that, maybe the next time she appears in public, the police should not lift a finger to give it any protection, then she'll probably get stomped under the crowd, and she deserves every foot that would trample her arse!","post_message":"It is people like her that perpetuate hate.  Police are the people that keep her safe.  Do you think Beyonce needs to learn some respect?"}]
