[{"comment_id":"1026050264097061","commenter_b":"illigals should not be able to vote period","commenter_a":"I agree, if sending all illegals back to where they came from will save lives, then do it and to the illegals be damned!!","post_message":"YES!!"},{"comment_id":"1073645179326169","commenter_b":"^^^boom^^^","commenter_a":"Christian's don't commit Adultery Hypocrites Do God is Revealing what is done in the Dark. Nothing is hidden from God","post_message":"DEVELOPING: Possibly Millions More Christians Have Committed Adultery Using Ashley Madison Than Previously Thought. #FallingAway #AshleyMadison"},{"comment_id":"1190103767694524","commenter_b":"SOROS supposedly promised her the election so that is why she thinks she has it. THEY WERENT COUNTING ON TRUMP TO TAKE OVER!!! LOL GO TO HELL BITCH> WE NEED TRUMP NOT SOME GANGSTER BITCH AND HER CULT!!!","commenter_a":"Nobody bothers to mention that the last time the Clintons were in the white house they stole furniture and silverware and were forced to pay or return it.","post_message":"Hillary thinks she's already won. This kind of sick behavior is UNACCEPTABLE in a constitutional republic!"},{"comment_id":"594779170700056","commenter_b":"Really bitch.💤💤💤💤💤🖕🏻","commenter_a":"Sick and tired of her ignorance","post_message":"Anti-Cop Black Panther Party Supporter Beyonce: \"Stop Killing Us\""},{"comment_id":"894537217346746","commenter_b":"These damn emails enough already. So how do you handle your text or emails? Do keep them or do you delete them? Keep that national security was a what risk BS! Are you being bombed or shot at by Islamic radicals are they taking over your house? What the hell you got a gun use help the military out by the way according to Trump is a mess a total disaster.Trump is a man with no plan.#you many people say that. Its true he himself can't put one concrete issue and have a real solution not one. He has all the best people no really the best people helping him according to him. Loom, doom, and gloom are the same people who will run this country because Trump won't have a voice. Those same so call good people will run this country really. They know he's not qualified. They will ...","commenter_a":"You are wrong if you think Trump is a Republican.Yes he is their candidate, but his views are far from it.","post_message":"This guy needs to wake up and smell the coffee."},{"comment_id":"10153046800841717","commenter_b":"Thats one stupid bitch.","commenter_a":"Ok, now it should be the electric chair! This woman is a menace to society and to the rule of democratic law. What a pity she is incapable of learning new skills like other related species! Lol...next she wll have her own TV show!","post_message":""},{"comment_id":"10153451761433701","commenter_b":"That is NOT a tranny yo gooF! WOWO!! how do you not know a drag queen when you see one.. and btw... he would knock you out for identifying him inappropriately. so your surround sound is broken Debbie","commenter_a":"Seriously posting this in that manner is bullying. Wild interview? About to go viral? More like a compassionate individual & who cares what she looks like or which way she swings.","post_message":"It's a story about a bad crash in Mississippi, but the animated eye witness is stealing the spotlight. This is one wild interview that's about to go viral. Take a look"}]
