[{"comment_id":"10153542319922629","commenter_b":"Do you job or get the hell out of the way. She should have been fired weeks ago when she first refused to do the job she is being paid to do.","commenter_a":"a woman that has been married 3 times is turning down marriage licenses... go figure","post_message":"Citing religious beliefs (as opposed to, say, deep-seated, bigoted hangups), the county clerk refuses to treat gay people as equal to straight people."},{"comment_id":"524517941072119","commenter_b":"This is USA .Muslims can eat pork and go to hell.","commenter_a":"Yall think they are pissed now ????? we aint done with them yet, still gotta play Cowboys and Muslims and then those who are left get to play the part of the Mexican Army at our reenactment of the \":Battle of San Jacinto\" although this time we aint takin prisoners ... Remember the Alamo !!!!!!","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy. Let them be angry. This America and if you don't like it, get out. Do you agree that Muslims should assimilate or leave?"},{"comment_id":"10152976505127507","commenter_b":"Kiss my ass!!! Idiot!!!","commenter_a":"NRA go to hell. Enough is enough!!","post_message":"Far too many times. Watch the video here: @webpagelink #CharlestonShooting"},{"comment_id":"1685004025117138","commenter_b":"What you sayin little girl?","commenter_a":"Love you all... Well except Muslims... And Mexicans and ....","post_message":"Merry Christmas & Happy Holidays!"},{"comment_id":"656793474487890","commenter_b":"Hillary the Felon says Trump is prejudice and she is just telling the same manipulative lies over and over. Mexicans do need to be properly vetted and screened because they are coming from a country knee deep in political corruption and organized crime. This lying fraud is trying to get her voters to think Trump is racist and prejudice but fails to acknowledge the gallons of red blood leaking into mexican streets because GOVERNMENT DISARMED ALL LAW ABIDING CITIZENS. It is NO QUESTION, Hillary wants Australian styled gun abolition, want proof? Ask and you will receive! She fails to acknowledge mexico is sending rapists and drug dealers en masse to deal much like Fidel sent his POW to Miami. There IS NO DOUBT this Felon is going to drag us into a civil war with her ideologies on government. Syrian and muslim refugees who have turned Germany into the brink ...","commenter_a":"#Trump2016 #HillaryForPrison #DNCLeak #DNCWalkout #CrookedHillary #ClintonCorruption #RiggedSystem Debbie Wasserman Schultz was the co-chair of Hillary's 2008 presidential run, where she lost the nomination to Obama. So, in order to lock down the nomination for 2016, Hillary would've had to put Schultz in charge of the DNC and manipulate it from within. In order for this corruption scheme to work, the Clintons would have needed first to, not only get the current DNC chair at the time to step down, but also get them to recommend Schultz for the position. A big request. And the Clintons would have likely needed to promise a powerful favor to that DNC chair, something more prestigious than being head of the Democratic party. So who was that person and what did they get in return? The previous chair of the DNC prior to Debbie Wasserman Schultz was... Tim Kaine. Let that sink in for a ...","post_message":""},{"comment_id":"1665959326994845","commenter_b":"What an ass hole!!!","commenter_a":"He sure didn't forget to LOOK at the camera though. Or.. salute the pilot in the plane. Dipsheep!!!!","post_message":"Obama refused to salute marines exiting Air Force One. That does it. Obama is anti-American and unfit to lead our country. Do you support our Marines?"},{"comment_id":"2095517547254171","commenter_b":"Anastasia wants the GOP controlling her lady parts!","commenter_a":"WHY IS MEGAN STILL ON FOX??? Please fire her and let her go hang with her liberal media friends. We deserve to have at least ONE station without this crap. Yellow journalism at its worst.","post_message":"\"I love this country because I understand that I'm living in one of the few places on God's given planet in which a person like me ... could live the life I've been able to live, but I didn't live it by going and screaming and burning the flag,\" Mike Huckabee said."}]
