[{"comment_id":"10153889343021770","commenter_b":"i bet she tried to touch trump with her boobs..","commenter_a":"Lmao liberals","post_message":"BREAKING: Karena Virginia, a yoga instructor and life coach, appeared at a press conference Thursday morning accusing Donald Trump of touching the inside of her right breast in 1998."},{"comment_id":"10153486710565779","commenter_b":"You, madam, are an idiot","commenter_a":"Well Bruce would allow a hairy old pervert in the restroom with that 10 year old girl, as long as he thought he was a woman. Let's all go to the zoo, and think we are lions and tigers, and go in their cage to do our business....... See how that works out Bruce. ;)","post_message":"Bruce Springsteen and the E Street Band closed out the U.S. leg of their 'The River' tour at Barclays Center last night with a three-and-a-half hour set that included covers of Prince's \"Purple Rain,\" John Lee Hooker's \"Boom Boom\" and Jimmy Cliff's \"Trapped.\" But it was a 10-year-old fan that provided one of the night's biggest highlights. Watch their performance of \"Blinded by the Light\" below."},{"comment_id":"10152879286473961","commenter_b":"Only ridiculous and delusional if you think like a liberal Democrat.","commenter_a":"We've had 6 years of progressive liberal foreign policy. It can be summed up as alienate our allies, embolden our enemies, abandon our gains and weaken American prestige throughout the world. Obama has managed to squeeze this in between rounds of golf.","post_message":"It’s time for progressives to outline a coherent, proactive foreign policy vision. Check out my op-ed on Medium where I share my ideas and add yours at www.chanceforpeace.org."},{"comment_id":"10153861210290950","commenter_b":"You kiss your Moms with that nasty mouth?","commenter_a":"Here is my thought. Don't show him on TV!! Focus on the team, the stands, and the rest of the stadium and to hell with him. If everyone stops making him big news, maybe we can all go back to watching football and the rest of the players on the field. Make him prove he even deserves to be out there, and sorry 49er fans, but before all this crap by him became news, I couldn't even tell you who he was. Maybe this is his way of getting some publicity because he ain't no Tom Brady or Peyton Manning!!! Let him sit, he may just earn the right to sit there all season!!!","post_message":"A veteran who supports the San Francisco 49ers quarterback tweeted: \"Don't use my service--or that of any veteran--to justify the silencing of black Americans.\""},{"comment_id":"10157276340925354","commenter_b":"Round up every muslim ship them home unless they are legal immigrants that speak english and have a job and no ties to isis otherwise build a wall shoot everyone of them that comes into the u s","commenter_a":"Vote Billary or Bernie for more lies, deceit, corruption,treason, gun control, Homophobia under Islam and 4 more years of obama. Almost forgot no more Country Girls having fun in the water. Cowboys, Liquor Stores, Smoking Marijuana are next. NOTE: Comments protected under the 1st Amendment.","post_message":"VIDEO:"},{"comment_id":"10152715320866636","commenter_b":"Bc she is a twat!","commenter_a":"But how is this possible? Our esteemed governor immediately came back with, \"Nope, can't afford it,\" when the idea of building storm shelters for the schools was put before her...","post_message":"When an E-F 3 tornado passed dangerously close to El Reno Schools, the district took steps to ensure that if it ever happens again, students and staff will be safe."},{"comment_id":"446969245501847","commenter_b":"We need a first lady with her boobs hanging out ?? Geeeez - that is classy","commenter_a":"Beautiful family! Trump got good taste when it comes to women!","post_message":"Thank you!!"}]
