[{"comment_id":"10154985622284687","commenter_b":"She schould blame her father for this","commenter_a":"Brilliant ! Will do","post_message":" is just it's a wonderful line. I own some of it. I fully I'm going to give a free commercial here. Go buy it today, everybody. You can find it online."},{"comment_id":"1072744952785252","commenter_b":"Stacey Wilson this is the women I was on about on tv the other day","commenter_a":"Ben Haymes","post_message":"She wants YOU to pay to improve her sex life"},{"comment_id":"10154212889868822","commenter_b":"2 fecking idiots!!! That is all I have to say!","commenter_a":"Just look how dangerous Pittsburgh has become in itself!! There are murders every single day and crime is most def on the rise!! Jobs are scarce unless you want to work part time in fast food or at a gas station","post_message":"Boston Mayor Marty Walsh joined Pittsburgh Mayor Bill Peduto for breakfast before hitting the campaign trail to drum up support for Hillary Clinton ."},{"comment_id":"10153679869402629","commenter_b":"Who cares... Let her be a kid!","commenter_a":"good for her","post_message":"Malia Obama. is touring colleges to decide where she will go to school (and maybe play beer pong?) next year."},{"comment_id":"10153947256054369","commenter_b":"You don't know much about the Black Hills or surrounding areas, do ya there, Todd and friends.","commenter_a":"What the hell is there to do in South Dakota","post_message":"You work hard, here's where to retire well."},{"comment_id":"1159562730832064","commenter_b":"@username what refugees ! Go back to Jordan !","commenter_a":"Haha.... What about millions of refugees whose right to return is banned by Israel? But o o no emotions for Palestinians? Why?","post_message":"Group travelers told to cancel reservation at lodging in Bavaria because they are Israeli."},{"comment_id":"1625393254140954","commenter_b":"This guy is a certified idiot!","commenter_a":"This Cummings punk is the king of demegogoury. The only person I find more dispicable is Chucky Schumer.","post_message":"The Democrats have been parodies of themselves for so long they fell for another parody."}]
