[{"comment_id":"458641870995513","commenter_b":"Can't stand this idiot...she has always been a crude, rude, big mouthed jerk. I don't find her humor funny, never have and never will. She does things like this just to try to be relevant and she will never be relevant. Hopefully she will also leave America with the rest of these so called celebrities if Trump gets elected.","commenter_a":"Idiot!!!!!","post_message":"Sarah Silverman is a _____________."},{"comment_id":"836603479863562","commenter_b":"Prayers and positive messages on the Internet along with taking as many polls as possible. Drive elderly Trump supporters to polls and escort them in. BLM and Black Panthers plan to block the elderly and Veterans from voting. Black Panthers alone blocked them last election","commenter_a":"Yes , with all my heart, since I can't help him with money...I wish him good luck..","post_message":"He truly does want to make our country great again. Let's show him we stand behind him. Do you support Donald Trump?"},{"comment_id":"849416281771667","commenter_b":"Not all women are evil feminists... Only feminists are evil...","commenter_a":"Abortion was legal by common law we brought with us from England at the very beginning of this country, the 1600's, women could abort up until quickening using herbs, falls, punches to the stomach, abortion potions were big business and freely advertised. The Founders did nothing to change this either. Try Googling the history of abortion in the US.","post_message":"Pretty much."},{"comment_id":"10153196622799753","commenter_b":"FUCK U CUNT.......","commenter_a":"She committed suicide now let it go.","post_message":"Do you think Sandra Bland was murdered?"},{"comment_id":"1145080512196207","commenter_b":"@username, no. The crime is to be caught crossing the border into this country. Once you're in the country, it is a CIVIL offense and people are due a hearing and disposition before a judge.","commenter_a":"It'll literally distract them from focusing on real crimes","post_message":"\"If the federal government takes a more aggressive role on deportation, then they’ll have to do that on their own.\""},{"comment_id":"10153660734489726","commenter_b":"what a mess she is!","commenter_a":"You mean murder!!!","post_message":"WATCH: Goldberg: Planned Parenthood Founded for Abortions"},{"comment_id":"10155755235340725","commenter_b":"U mean I have to marry ur ass!? Ugh","commenter_a":"Patti McGough, let's meet at Daley center on tuesday.","post_message":"#BREAKING: Supreme Court rules all gay couples have a constitutional right to marry-----> @webpagelink"}]
