[{"comment_id":"10153167392250090","commenter_b":"Take out the trash... She is trash...!!!","commenter_a":"She should not be a president of anything","post_message":"We've seen what happens when our president ignores the American people—we WON'T let it happen again.  It's time for the truth about Benghazi. Demand answers from Hillary Clinton: @webpagelink"},{"comment_id":"10152862835371336","commenter_b":"The ft hood shooter was an American serviceman","commenter_a":"What about Benghazi and Ft. Hood?","post_message":"\"This is an act of violence, an act of terrorism that we condemn in the strongest possible terms, and we are going to stand shoulder to shoulder with our allies in France.\" – White House Press Secretary Josh Earnest on America's Newsroom moments ago"},{"comment_id":"1414587195226950","commenter_b":"2 all the women in pink why not just pack up ur pink panties and move 2 Cuba now that we have relations again I hear it's a paradise.","commenter_a":"GROW UP","post_message":"Female supporters of President Donald Trump aren’t sure why the Women’s March was necessary."},{"comment_id":"1560863080640101","commenter_b":"Moron! She got what she deserved.","commenter_a":"VERY SAD","post_message":"This craze is out of control.  (From Elite Daily)"},{"comment_id":"619358388197343","commenter_b":"All he did was to let Iran know about our constitution .......","commenter_a":"It was well deserved. #1traitor of #47traitors","post_message":"What the heck is wrong with this dude?!"},{"comment_id":"1728684567380415","commenter_b":"#NotMeUs hillary just want your vote so she can work hard for the rich people!","commenter_a":"Please exit out of video , share the post by clicking SHARE button on bottom right. Come back and join us❤️","post_message":"Bernie Sanders rally in Pittsburgh: Part I"},{"comment_id":"10153061707381051","commenter_b":"Stupid bitch needs her face slapped until she falls out..","commenter_a":"She is no mother, glad to see someone finally called the police on one of these child abusers rather then just posting it.","post_message":"Onlookers were genuinely shocked when they saw how this teen mom was treating her child."}]
