[{"comment_id":"10152921219620090","commenter_b":"@username , do not believe Florence , we everybody chosen by God. Not Jew , only, hahahaaaa","commenter_a":"Israel can take care of itself! We need to take care of USA and quit spending, spending, spending!","post_message":"We're proud to stand with Israel & stand against terrorism.  We're calling on Arab governments throughout the Middle East to help advance this goal. Join us, here: @webpagelink"},{"comment_id":"880834145309668","commenter_b":"Yeah the cunts wife found out through facebook hahah","commenter_a":"@username Will Woods","post_message":"It just keeps getting worse."},{"comment_id":"1879145055641043","commenter_b":"I bet her husband can't wait to their son Ben turns 18 so he can leave this psycho b****","commenter_a":"She went from 102 pound to 104 pound woman in a matter of minutes. Proves that she's full of shit and gaining.","post_message":"I bet she has at least seven cats.   -Admin Rick Birdsall"},{"comment_id":"1712583705672199","commenter_b":"What happens when fish over populate and end up eating up their whole ecosystem..","commenter_a":"They're fucking fish were at the top of the food chain","post_message":"If you know anyone who still goes fishing, show them this."},{"comment_id":"10152934995226680","commenter_b":"Seems you want to engage in gossip. I got better things to do with my time. Scoot along Andrew.","commenter_a":"Bernie's right. The biggest mistake of the Clinton administration was dismantling Glass-Steagall.","post_message":"Bernie Sanders: \"Allowing commercial banks to merge with investment banks and insurance companies in 1999 was a huge mistake.\""},{"comment_id":"1068655089908149","commenter_b":"Beautiful!","commenter_a":"Beautiful!!!","post_message":"Happy 24th anniversary, Barack Obama and Michelle Obama! Here's a look back at the First Couple's sweetest moments."},{"comment_id":"10155329030581002","commenter_b":"What's wrong with these racist black women?","commenter_a":"What is wrong with these nasty white bitches?","post_message":"A former Santa Fe Independent School District teacher is accused of having sex with two students over the last year and a half."}]
