[{"comment_id":"10153249048488352","commenter_b":"Pure evil heartless bitch","commenter_a":"The same thing should happen to her no doubt about it","post_message":"Texas woman, 26, found guilty of suffocating fiancé's two-year-old daughter to death using duct tape after he broke up with her"},{"comment_id":"1045431208809965","commenter_b":"This is not news worthy.","commenter_a":"Who cares?","post_message":"BREAKING> Beijing wins bid to host 2022 Winter Olympics. China's capital will be first city to host summer & winter games."},{"comment_id":"1559763640995949","commenter_b":"What the hell is wrong with this women? What the hell was she thinking? She is going to jail. What a slime bag.","commenter_a":"Good! She should!","post_message":"Dani Mathers could now face criminal charges"},{"comment_id":"10153162975649205","commenter_b":"Assholes","commenter_a":"JAYWALKING noting wong","post_message":"Cops Beat Black Teen For \"Resisting\" His Jaywalking Ticket"},{"comment_id":"10154738811856336","commenter_b":"THE MINUTE YOU VOTE FOR HILLARY CLINTON YOU BECOME GUILTY BY ASSOCIATION FOR HER CRIMES. Think about that for a minute...yep every time you see her, hear her she will be lying, and you become one too...a horrible person! She let 4 beautiful men get tortured, sodomized, and killed, all because she didnt answer her phone. She deleted 33,000 classified emails after she got a supena. She will Open borders for hell to get in. ISIS will kill and you will be guilty of this. You will be guilty by association and all your friends will turn on you! All because you wanted the first woman President...We pitty you if she gets in....you won't get help from us....we will be to busy fighting for our guns to save America from her!...We choose TRUMP, a MOVEMENT beyond your reach.","commenter_a":"r I have watched Megan Kelly for a while now and use to love her show. However, I am so disappointed in her need to make a name for herself that she has sold herself to the devil and we all know who that is. Seriously, the sexual predator comment??? And you call yourself a lawyer, what happened to innocent until proven guilty or does that just apply to the Clintons! Why don't you call out Killary for disgracing the office of Secretary of State or even better her husband who has actually paid money to women for his sexual indiscretions. Oh, and how many people close to them are in the grave?? So @username...get rid of the trash and get some class....Hint\"...The Ainsley Earhardt File!!!!","post_message":"\"That's not law enforcement. That's selective prosecution.\"  Newt Gingrich reacted to the perceived double standard with the investigation into Hillary Clinton's private server, saying \"this is the kind of stuff that in a place like Venezuela, you'd understand.\""},{"comment_id":"1238572816162746","commenter_b":"...aaaaaand to jail this woman will go.","commenter_a":"A real action star. Give him an oscar award!","post_message":"Watch the moment a suspect hit an officer's car with her SUV during a high speed chase. The officer escaped with only minor injuries.  Full story: @webpagelink"},{"comment_id":"1234562866583168","commenter_b":"Hillary can sell pieces of our country, lie to investigators, channel campaign money, donations and contributions to her \"charity organization\" into her own personal slush fund, and she uses one technique to keep her out of the limelight for very long........she deflects whatever she does to whomever challenges her. Harry Reid is a complete idiot. Obama's constant comments of ridiculing Trump is the same technique. How dare that piece of trash accuse Trump of not being American!!! He is lawless, devious, lying, aids the enemies to be able to be in a position to kill us, takes money and feeds people who are illegal, criminals and he DARES to call Trump Un-American??!! He is seriously sick in the head...he THINKS he is the ideal American. Why do we still have a nut in the oval office? Shame on anyone who listens to this crap....and I can't wait to have both ...","commenter_a":"Just shut up, sounds like squeaky mice got caught, just go away quietly no one will miss you...","post_message":"HEAVEN HELP US  @webpagelink"}]
