[{"comment_id":"10153672451109062","commenter_b":"He's a lady","commenter_a":"Michael Keaton was robbed!","post_message":"BEST ACTOR goes to Eddie Redmayne for \"The Theory of Everything.\" More: @webpagelink  Photo: Dan MacMedan, USA Today"},{"comment_id":"647096885477917","commenter_b":"If those prostitutes have balls.","commenter_a":"what could black mail TRUMP","post_message":"It sounded like a major development in the unconfirmed allegations that the Russian government had blackmail material on Donald Trump. It's not."},{"comment_id":"533721010147110","commenter_b":"Or maybe we should learn from history instead of repeating the same mistakes over and over. Illegal immigration didn't work out too great for the Native Americans. Has illegal immigration worked out for any culture? We all have a set of keys for our lives, hence I believe we all can agree on a measure of security. I say who comes into my home, you say who is allowed into your home. We can decide on who we let into our community. I wholeheartedly welcome people wishing to be an American. I am against the culture of Islamization and separatists who don't value American principles or agree with our civil rights. There are many different developmental frameworks: Republics, Monarchy, Communism, Islam, etc. Islam is an entire framework of religion, social, economic, legal, political, and military standards which is completely incompatible with American laws, Bill of Rights, and the principles I ...","commenter_a":"I believe this is a good moment to revisit Donald J. Trump policy on going after the families of known terrorists. Seddique Mateen supported the Taliban. His son Omar Mateen should have been deported already. Trump Fan Network get the word out. Donald J. Trump will institute policies to prevent these tragedies. Furthermore, the laws designed to go on the offensive for this threat should be a mix of \"aiding and abetting felons\" with counter-terrorism.","post_message":"The FBI interviewed him twice in 2013 and again in 2014, but determined he was \"not a threat at that time.\""},{"comment_id":"10154526253322464","commenter_b":"Want to bring some refugees? Bring the Yazidi!!!","commenter_a":"We want to live in peace I Yazidi from Iraq There's no one feels Us #StopYazidiGenocide #StandforYazidiWomen #StopYazidiGenocide #StandforYazidiWomen Nadia Murad","post_message":"Washington Examiner: Oklahoma Obamacare plans face 76 percent hike.  #FullRepeal: @webpagelink"},{"comment_id":"10154215455576770","commenter_b":"Lock her up","commenter_a":"As a retired military wife she Makes me sick!!! Like she ever cared about America!! She cares only for herself and if you support her I feel sorry for you!!!","post_message":"Hillary Clinton responded within minutes."},{"comment_id":"10153304280001051","commenter_b":"She is a fence jumper!!!","commenter_a":"I approve he's the best President we ever had I love America !!!","post_message":"Simple question: Do you approve or disapprove of the job President Obama is doing in office?"},{"comment_id":"10155993779265389","commenter_b":"Carson and Fiorina PERIOD","commenter_a":"Dr. Carson","post_message":"From fiery criticism of ObamaCare and the Iran nuclear deal to support for Israel and the rights of the unborn, the top 10 Republican presidential candidates did all they could to define and separate themselves Thursday night during the Fox News debate in Cleveland, Ohio.  Who do you think won?"}]
