[{"comment_id":"10153739704671051","commenter_b":"Dumb ass","commenter_a":"For recreational usage YES, only and dope does dope for no reason other than to escape reality. For MEDICAL use, HELL NO, it should be 100% illegal. BUT, that is not the real issue here..... the REAL issue is, THE LAW Follow it, or pay the price, SIMPLE","post_message":"Do you think marijuana usage should be illegal?"},{"comment_id":"1716657778577521","commenter_b":"no not true.I have seen proof LOL","commenter_a":"When faced with criticism of their candidate, Trump fans are quick to argue that Trump is better suited to be president than Obama or Hillary. The choice is NOT between Trump and Obama or Trump and Hillary. The GOP is choosing THEIR standard-bearer. The choice before us AT THIS CRITICAL MOMENT is between Trump and anyone of three other Republican contenders. Who will have the moral character to stand up against Hillary or Bernie? I choose CRUZ!","post_message":"Is there a real connection between hand size and penis size? We decided to investigate what the science says on the matter..."},{"comment_id":"1667152256905944","commenter_b":"Why do we have this question. If they are illegal the only right is to be fed on their plane ride back home. On the other hand I have the right to protect my family, land and myself from these criminals. If they have kids then they have a choice, leave with the kid or leave without the kid and never see him or her again. All connections to the child will be erased from our records so you can't track them.","commenter_a":"They are NOT U.S. Citizens, so they shouldn't be allowed to vote.","post_message":"I agree!"},{"comment_id":"387361158112432","commenter_b":"the WHAT?","commenter_a":"A lot better then the B.N.R. CRAP","post_message":"What did the Christian left do to draw the ire of Fox News?"},{"comment_id":"10153952322157994","commenter_b":"Stupid young mfs","commenter_a":"#LifeinaPotHole #VOTE #GUNSENSE #VOTE #Hillary2016 #WitchHunt #BroomsUp #BlackLivesMatter #LATINOS #LGBT #WOMANCARD","post_message":"Three teenagers have been charged in the fatal shooting of an 18-year-old at Eastland Mall the day after Christmas."},{"comment_id":"1436806433003369","commenter_b":"@username Your vagina is showing....","commenter_a":"#NeverHillary #DNCLeaks #DemExit #StillSanders","post_message":""},{"comment_id":"1158332250952774","commenter_b":"I am an American who moved abroad and I get better healthcare for very cheap and birth control and maternity leave and the whole shebang... Anyone working gets rights to this in other countries. I can't believe America is fighting such a simple idea. A healthy population is a productive population. You want more able workers? Make sure they can remain healthy enough to work!","commenter_a":"Todd...more than 3 million more said No to Trump than yes!","post_message":"WATCH LIVE: The Women's March on Washington following Donald J. Trump's inauguration –— over 500,000 are in attendance."}]
