[{"comment_id":"10154391866961130","commenter_b":"One track mind girl!","commenter_a":"lawd hep us!!","post_message":"Mazel tov for (unintentionally) making us laugh before the election."},{"comment_id":"10153874445353132","commenter_b":"Women WE MUST UNITE AGAINST STUPIDITY!,","commenter_a":"Did y'all read the article or just start running off at the mouth?! I, too, had the same reaction until I actually read the article. This congressman did not come up with this if his own accord. It was reported to him by the ones who trained them. THEY said there was special treatment.....not the congressman.","post_message":"\"Fighters must be prepared and capable. If they are not, people will die.\""},{"comment_id":"10153780845375530","commenter_b":"You can look it up!","commenter_a":"Columbus is neither hero nor monster. Indigenous people were screwin' each other over long before Columbus arrived. Don't like Columbus Day? Don't celebrate it.","post_message":"It was not clear when exactly the statue was vandalized. Detroit police were still looking into the incident when contacted."},{"comment_id":"565700806961575","commenter_b":"Don't they get it! We don't want her!","commenter_a":"Hillary will probably die before then of karma and natural causes!","post_message":"Trump-Clinton rematch for 2020?"},{"comment_id":"10154497878598145","commenter_b":"So much White Trash in Florida!","commenter_a":"Omg @username I freaked out for a second....","post_message":"Authorities said the couple and the victim's son were having dinner, and when the child refused to eat his food, Stephen Collins became angry."},{"comment_id":"10154256753938701","commenter_b":"ONLY IN AMERICA RACIST GET REWARDED","commenter_a":"Regardless of if you think the shooting was justified or not this is just callous and tacky. He honestly makes me feel ill.","post_message":"UPDATE: The gun listing has been taken down from the auction site."},{"comment_id":"963694916975312","commenter_b":"Actually, Pro-Life is fighting for the rights of unborn females while Pro-Choice believes that unborn females have no worth. If anybody is hating women, it is those who don't mind if they are killed while still very young.","commenter_a":"go ahead and have your abortion if you want it, but one day the consequences will come back to you, there are consequences to everthing","post_message":"\"People need to know that women have abortions every day and they go on and live their lives”"}]
