[{"comment_id":"1109139419126529","commenter_b":"They are discontinuing these items because they are not being purchased. Pure business decision. They are not trying to bs socially responsible.","commenter_a":"Posturing","post_message":"Walmart made a major decision regarding guns that is going to surprise more than a few people."},{"comment_id":"10153344730251130","commenter_b":"The County Clerk who refuses to issue marriage licenses to gay couples makes the same argument. This job responsibility should be no surprise to her. If she can't do it, then she needs to be in a different job.","commenter_a":"Surely she knew when she took the job that serving alcohol was part of it. Go find a job that fits your lifestyle.","post_message":"\"No one should have to choose between their career and religion.\""},{"comment_id":"10153019604880399","commenter_b":"Yes we do!","commenter_a":"We NEED to get rid of THE TYRANTS","post_message":"Dr. Ben Carson wants a country that \"puts our Constitution on the top shelf — and for those who have any doubt, that includes the Second Amendment.\""},{"comment_id":"1023513341058227","commenter_b":"Go figure. A business in business to make money. She should know, she's the biggest criminal of them all.","commenter_a":"imagine that, a company in business to make money. You can't fix stupid, but you can vote it out of office, or in this case make sure it doesn't get into office.","post_message":"This is most likely the dumbest comment she has made to date..... so far."},{"comment_id":"10154984816883797","commenter_b":"I hope this women knows that dying is the easy way out that she is not going to get.","commenter_a":"I utterly despise anyone who would harm and even go so far as to kill a child, ESPECIALLY the parent of the children.","post_message":"BREAKING: A statewide Amber Alert in Indiana has been canceled after a 7-year-old girl and 6-year-old boy were found dead Monday."},{"comment_id":"10153091950239205","commenter_b":"IF YOU'RE ILLEGAL ALIENS IN AMERICA, THEN YOU HAVE NO BUSINESS HERE, JUST LIKE MEXICO TREATS AMERICANS! PEOPLE WHO WANT TO COME HERE LEGALLY ARE WELCOMED.","commenter_a":"The mexican solution (Donald Hitler )","post_message":"Donald J. Trump's detailed and foolish immigration plan explained."},{"comment_id":"1128329537202466","commenter_b":"That says it all! Those flag burners and dissenters can leave.","commenter_a":"I'm a proud veteran too.","post_message":"I'm A PROUD AMERICAN!!"}]
