[{"comment_id":"10153860760766135","commenter_b":"You are so right.","commenter_a":"It was not a mistake, it is business as usual at Detroit Animal Control.","post_message":"\"As a result of a computer status error, a tragic and unacceptable euthanasia was authorized.\" -- Detroit Animal Control"},{"comment_id":"10153898297209726","commenter_b":"I know someone that used to be a neighbor to one of Bill's party friends and Bill partied there all the time. They would bring in scores of prostitutes.","commenter_a":"Look this stuff is 20 years old. Bill chased women. A lot. Hes not the first and wont be the last man to do that lets move on","post_message":"WATCH: The central figure in the Lewinsky affair is speaking out about scores of Clinton affairs unknown to the public!"},{"comment_id":"1096205787130648","commenter_b":"this bitch looks horrible","commenter_a":"He sure doesn't call the Super predators you pos","post_message":"...says the woman who trashed tens of millions of working class Americans."},{"comment_id":"10153946118774071","commenter_b":"He is a #WhinyLittleBitch","commenter_a":"If he is not blaming it on the Mexicans, the women, the Muslims, the Democrats, the media or the moderator, it's the microphone. My God what a crybaby. I think Donald need a diaper change 😂","post_message":"Clinton slams Trump's debate performance: 'Anyone who complains about the microphone is not having a good night.'"},{"comment_id":"10155070444570603","commenter_b":"This disease is curable with treatment. If she puts it off she will die. Just as an abortion her parents still have the right to choose life for their child.","commenter_a":"This is crazy!","post_message":"UPDATE: Cassandra was diagnosed with Hodgkin Lymphoma in September. For three weeks she was getting chemotherapy, but then changed her mind and decided she didn't want it."},{"comment_id":"10154664283754778","commenter_b":"We can see all the ex cons..right in this thread...","commenter_a":"He would look good in any back alley dumpster","post_message":"\"If I had to bet, I would say to Kalorama or a neighborhood called Mass Ave. Heights.\" Where do you think?"},{"comment_id":"10153366308391336","commenter_b":"Ewww! What a scanky hoe!","commenter_a":"I bet they didn't even use condoms... - Don't they care about STD's on DEATH ROW or in Maximum Security?","post_message":"Shepard Smith reported that Joyce Mitchell, the prison worker accused of helping two convicted murders escape from Clinton Correctional Facility, reportedly had sexual relationships with both killers."}]
