[{"comment_id":"10153725083142464","commenter_b":"@username YOU'RE A COMPLETE MORON !!","commenter_a":"I remember my thanksgiving in Iraq and the Stan. Prayers for all those away from the families eating thanksgiving in a to-go box","post_message":"Tomorrow and every day, don't forget to say a prayer of Thanksgiving for our men and women in uniform spending the holiday away from home."},{"comment_id":"10154212521629087","commenter_b":"The best present she could give America would either be a full confession of her crimes or better yet, get a pistol, load it, put it in her mouth and pull the fucking trigger.","commenter_a":"I believe it was the other way around. Liberal loons twisting facts to make it look good for them. Lol. Happy birthday Hillary! The best present you can offer to the American people would be to quit! :) #NeverHillary!","post_message":"\"Can we call Megyn Kelly’s total obliteration of Newt Gingrich on live television the kick off to Hillary Clinton’s 69th birthday celebration?\""},{"comment_id":"10154766410094714","commenter_b":"Let us wave a wand and turn you into a woman...then comment about this. Have a nice day!","commenter_a":"Wow! All of a sudden women in distress coming forward. I wonder how many more will jump on the dollar filled band wagon? Doesn't this look a little suspicious? Clinton filling their pockets!","post_message":"The Donald J. Trump campaign is planning to fight fire with fire: “We’re bringing out tactical nukes now, with thermo nukes later.” @webpagelink"},{"comment_id":"10155911765540389","commenter_b":"hillary can win if they let enough illegals in","commenter_a":"Stay on her, Mr. Trump!!!","post_message":"\"Hillary was the worst secretary of state in the history of our country.” – Donald J. Trump"},{"comment_id":"10153480105418132","commenter_b":"Who gives a crap about her boobs. Let em hang out if she wants, or cover em up. They aren't your tits.","commenter_a":"Too much boobs","post_message":"What do you think of JWOWW's wedding gown?"},{"comment_id":"1761764947438429","commenter_b":"@username you do realize Hilary wants to deport illegal immigrants too right? She announced it this last week.","commenter_a":"Women should feel insulted that the first female ever to be nominated also happens to be a corrupt, cold, calculating, ruthless, lying crook. If we're going to give the distinction of 'first woman nominee' or, God forbid, 'first woman president' to anyone, she is, quite literally, the last woman in the country who deserves the honor.","post_message":""},{"comment_id":"10153123681123690","commenter_b":"Every hindu rapist must killed.","commenter_a":"well done israel.. every terrorist should be killed..","post_message":"The mood was sombre as mourners gathered in Beirut southern suburbs to pay their respects to Jihad Mughniyeh, one of the six Hezbollah fighters killed in an alleged Israeli air strike in Syria. @webpagelink"}]
