[{"comment_id":"10153078698497994","commenter_b":"Ucs ? Every district around them closed! who are they competing with? This lady shouldn't be a superintendent of a kennel let alone of our children!!!","commenter_a":"378 schools closed today and a handful of are schools still open that has to be frustrating to parents, teachers and students. This is one situation it's not okay to stand out","post_message":"Nearly 300 schools are already closed this morning (including Detroit Public). You can check out the list here."},{"comment_id":"10154256686314641","commenter_b":"What a horrible woman.","commenter_a":"i'hve ,ever seen something like that until she was suffer from mental illness","post_message":"\"Mr. Sheats will have to live the rest of his life with this horrible memory.\""},{"comment_id":"769219589888459","commenter_b":"i have been there over and over the last time a mexican woman tried to give my mother her baby beged my mother to take the child this is a fact and sad but if mexico is so great then way are so many comming to America","commenter_a":"Who would want to move to Mexico? In dire stress, a person could find better options than that Anti American, drug cartel controlled country. Funny how they are so anti American, but so many scramble to get here huh? The citizens of Mexico don't even want to live there, and I can't say I blame them.","post_message":"Americas Freedom Fighters"},{"comment_id":"236462700148781","commenter_b":"I heard he won by a lot and everyone is happy. Next please","commenter_a":"Dagmar! Free Press just means that they can't be censored or jailed! He doesn't have to speak to the press! No ....NO VIOLATION OF THE 1ST!!","post_message":"Join us as President Donald J. Trump delivers the Weekly Address."},{"comment_id":"10153489348776756","commenter_b":"Only a woman could find something completely fucking trivial to bitch about a great thing.","commenter_a":"#FirstWorldNonProblems","post_message":"\"Can I just passively refuse to pass the beach balls back up until they collect around my feet in one incriminating pool? How coldly can I glare at the people who try to resurrect the beach balls I've silently condemned to the ground?"},{"comment_id":"1798905343724193","commenter_b":"\"She doesn't want guns, take their let's see what happens to her,\" Trump said. \"Take their guns away, okay? It'll be very dangerous.\"","commenter_a":"How can this extremely ignorant, sorry excuse for a human, still be in office? and in Texas???","post_message":"What say you, Texas?"},{"comment_id":"606223439551496","commenter_b":"Cough cough a lady? Your kidding me! She is one of the most evil murderous woman alive.","commenter_a":"Oh yes Vicente like a mother that does nothing. One who allows her children to run amuck without obeying any rules or following the law. One who lies and deceives others for her own monetary gain. A mother who blames others for her mistakes. Yes Former President Vicente Fox this is your kind of Mother. Your people would continue to invade America. Our country would suffer greatly. Your drugs would kill and maim our children and others. She is just the Mother for you. However in America we want a different leader. We want Donald Trump. He will protect and defend America where others would not.","post_message":"\"I envision the presidency of the United States to be like a good [loving] and caring mother, a real lady,” said Vicente Fox."}]
