[{"comment_id":"10154976880629614","commenter_b":"Ok","commenter_a":"The car man was driving was a stolen car ?","post_message":"El Monte police are heard firing multiple shots at a suspect tonight in a video provided by a witness.   One man was shot and injured after a slow speed pursuit. His current condition is unknown.   Read KTLA's story here: @webpagelink"},{"comment_id":"10153660041871770","commenter_b":"Shes a idiot to.like we care what a gold digger has to say oh she fits in with crooked Hilary","commenter_a":"Who cares care","post_message":"What?!"},{"comment_id":"658477470966222","commenter_b":"I'm sorry this woman is no good for this country I'm sure there is the woman that be a Great president for this country but she is not the one she is evil and corruptive I see a whole lot of old women who think I got 1 foot in the grave I should vote for a womanwrong","commenter_a":"It still look's like a trash bag on her.","post_message":"Hillary Perón"},{"comment_id":"10153005348800496","commenter_b":"So it's from not walking?","commenter_a":"Can someone explain to me how they grow like that? What about wild horses? Thanks.","post_message":"Disturbing: @webpagelink"},{"comment_id":"10156410831030725","commenter_b":"U not Gona win ginger bread","commenter_a":"Letssss go !!!!!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"},{"comment_id":"10153279327706973","commenter_b":"Your saying this restaurant chain is hateful and kills animals when dozens of others do exactly the same thing? You do know that cows and fish are animals and killed in order to make the food you find at McDonald's, Burger King, Wendy's, Arby's, Subway, Taco Bell, Panda Express, Red Robin, Dennys, IHOP, etc. right?","commenter_a":"Don't do it! They're a little too conservative for our area. Do people really want to support a company that not-so-secretly opposes equal rights (not to mention the whole killing of animals thing...)? @webpagelink","post_message":"The fast-food chain is looking to to add one or two restaurants a year until there are 10 to 12 locations in the greater Portland area."},{"comment_id":"10153192015881162","commenter_b":"Hell is too good of a place for her, bring her to me.","commenter_a":"They should have allowed me to drive her to hail. She wouldn't make it there.","post_message":"HORRIFIC: A mother is accused of stabbing her 4-year-old son and partially mutilating his genitals. Authorities say the 23-year-old woman then dragged him out and continued the assault in the driveway, beating the boy with a garden tool and slamming him to the ground.   FULL STORY: @webpagelink"}]
