[{"comment_id":"10154307174989411","commenter_b":"the reasons for building a wall are based on racism. Migrants dont steal jobs, dont increase crime, and create more wealth for everyone given the correct conditions. only reason to appose migration is fear of differences.","commenter_a":"Think the candidates suck? vote libertarian. check out Gary Johnson. Some socialists might not get it at first but its really the political party that represents the most freedom. Are you for gay marriage? so are libertarians. Are you for smoking weed? so are libertarians. Are you against foreign wars of aggression? so are libertarians. are you against corporate collusion with the government? so are libertarians. Are you against too big to fail banks? so are libertarians. hold on republicans, theres stuff for you too. Are you for lower taxes? so are libertarians. Are you for property rights? so are libertarians. Are you for a business owners right to deny service to whomever he pleases? so are libertarians. are you for gun rights? so are libertaria","post_message":"#DropOutHillary: 300,000+ tweets"},{"comment_id":"672161809583667","commenter_b":"This gal is a piece of .......","commenter_a":"Nothing quick about judging this one. It's been years in the coming","post_message":"I'm sorry....I'm not a fan."},{"comment_id":"10153314247693812","commenter_b":"She beautiful","commenter_a":"Amaxing love the smiles love technolgy","post_message":"Girl all smiles 6 months after major surgery to reshape her face with help of 3D printing: @webpagelink"},{"comment_id":"650574988427913","commenter_b":"Marco Judilla bwahahahahaha","commenter_a":"Michelle Balisado","post_message":"Ewwwww."},{"comment_id":"10154950558833256","commenter_b":"How on earth can you make this RACIAL?. It grabs EVERYONE!","commenter_a":"I wish I can say I am shocked; but just about every one black who's trying to make a difference is going through it' other races probably are also' its horrible '","post_message":"Calling the practice of intercepting cellphone information secretive and widespread, a federal lawsuit alleges Chicago has an \"arsenal\" of cell site simulators (or \"Stingrays\"). When deployed by police, these devices capture data from any phone in its range — not just the intended target.  \"Government spying on its citizens without appropriate judicial oversight is inconsistent with the freedoms guaranteed by the Constitution,\" said Jerry Boyle, a Chicago attorney who brought the case."},{"comment_id":"1173335299353316","commenter_b":"Lady...Just give it up and go home!!!!","commenter_a":"Pathetic!!","post_message":"\"I don't think what Donald J. Trump says is worse than actually what Hillary Clinton in fact has done.\"  - Green Party presidential nominee Dr. Jill Stein"},{"comment_id":"10153115763853690","commenter_b":"The fundamental pillars of many so called western democracy is to build terrorist groups to fight a government that doesn't serve their needs. But guess what, immediately these terrorist got training and weapons they starts killing their masters Americans and allies. Then the next day their X masters will come out with a BLANK SPEECH called War on Terror. Well am never gona be part of any War on terror coz I never creat any terrorist. Look at Libya; they trained and armed them and later the terrorist killed their diplomat. They trained and armed Bin Laden; we all knows what follows next. They created ISIL; that one is more than I can write. Now U are creating another dead squad in Syria so what follows next no complain please. How can u call others \"Rebels\" and others \"Good Rebels?","commenter_a":"Isn't dat supporting rebellions on another country samething they accuse Russia? ?!","post_message":"Pentagon says 400 troops & support personnel will be sent to train moderate Syrian rebels | @webpagelink"}]
