[{"comment_id":"10155031331646320","commenter_b":"You are on my prayer list.","commenter_a":"Stay strong","post_message":"Detective Steven McDonald was hospitalized earlier today after suffering a heart attack. Our thoughts and prayers are with the McDonald family. A former U.S. Navy hospital corpsman and third generation police officer, Steven McDonald was shot three times in the line of duty on July 12, 1986. The shooting left him quadriplegic. Several months after his injuries, he said that he had forgiven the 15 year-old who had shot him."},{"comment_id":"10153498381391523","commenter_b":"Someone needs to throw this evil bitch out of a car. The same way she did to these innocent pups.","commenter_a":"Awe poor baby","post_message":"A woman let three dogs out of her vehicle and sped off on Farmlane Drive in Slinger -- with the dogs chasing after her. Now, police are searching for answers. Please spread the word."},{"comment_id":"10152691243492217","commenter_b":"@username we're good at sports that don't matter","commenter_a":"Jason Mulford","post_message":"Watch out, Katniss Everdeen."},{"comment_id":"10153338869724411","commenter_b":"hey asylum seekers, if you don't like it in italy, then don't go to italy!","commenter_a":"Modern slavery and the should be thankful for that. Hate this shit!","post_message":""},{"comment_id":"10153360842296162","commenter_b":"Hope they enjoy their 72 male virgins.","commenter_a":"Fuckkkkkkkkkkkk Muhammed!!!!!","post_message":"COP SAVED LIVES: The officer who returned fire at two men who shot assault rifles outside an event displaying cartoons of the Prophet Mohammad \"saved lives,\" according to authorities @webpagelink"},{"comment_id":"10153280743327042","commenter_b":"Let them shoot to kill and get shot whilst doing it!!","commenter_a":"Shoot to kill.... I'm talking to the cops !!!","post_message":"GANGS TEAM UP TO 'TAKE OUT' OFFICERS: Video shows \"lawless\" teens destroying police cars and injuring multiple officers. Today, police learned of a new threat from the city's notorious gangs."},{"comment_id":"1183171455046239","commenter_b":"Who is she to decide who the child should live with","commenter_a":"I just read another story that he had reversed his decision, probably due to pressure from above.","post_message":"SOUND OFF: Judge believes a child is better off with a heterosexual couple."}]
