[{"comment_id":"10154131351242232","commenter_b":"She doesn't stand a chance against Trump","commenter_a":"Well we are screwed","post_message":"#Breaking. Hillary Clinton has won the Pennsylvania Primary and is about to take the stage. @webpagelink"},{"comment_id":"1202659629774507","commenter_b":"He should be impeached. If this neighborhood was all white they would have had clean water on day one","commenter_a":"Mr. Snyder you have not done your job so you must go. You looked pathetic.","post_message":"Why hasn't he been arrested?"},{"comment_id":"10153932654413854","commenter_b":"He has cornered the market on STUPID...","commenter_a":"This guy is absolutely INSANE.","post_message":"Obama cites American Revolution as example of Americans being falsely paranoid about gov’t tyranny"},{"comment_id":"1559248597428498","commenter_b":"Trump is a friggen rapist!","commenter_a":"Donald Trump and Hillary Clinton walk in to a bar. Donald leans over, and with a smile on his face, says, \"The media is really tearing you apart for that Scandal.\" Hillary: \"You mean my lying about Benghazi?\" Trump: \"No, the other one.\" Hillary: \"You mean the massive voter fraud?\" Trump: \"No, the other one.\" Hillary: \"You mean the military not getting their votes counted?\" Trump: \"No, the other one.\" Hillary: \"Using my secret private server with classified material to Hide my Activities?\" Trump: \"No, the other one.\" Hillary: \"The NSA monitoring our phone calls, emails and everything Else?\" Trump: \"No, the other one.\" Hillary: \"Using the Clinton Foundation as a cover for tax evasion, Hiring Cronies, And taking bribes from foreign countries?\" Trump: \"No, the other one.\" Hillary: \"You mean the drones being operated in our own country without The Benefit of the law?\" Trump: \"No, the other one.\" ...","post_message":"A 36-foot model of Donald J. Trump holding Hillary Clinton's head was burned during annual bonfire celebrations in a British town."},{"comment_id":"636990926431695","commenter_b":"Let her go to a country that enforces Sharia law and see how she really likes being beat.","commenter_a":"She is insane!","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"10153187905664087","commenter_b":"If posting in the comment section of a facebook page is being \"involved in politics\" then we really are in trouble.","commenter_a":"For better reasons why we should have retention elections of these SCOTUS. Congress can't be trusted to impeach these first year lawyers in black robes!!","post_message":"#BREAKING: Rowan County Clerk Kim Davis was released from federal custody today and ordered not to interfere \"in any way, directly or indirectly, with the efforts of her deputy clerks to issue marriage licenses to all legally eligible couples.\""},{"comment_id":"1695824464005067","commenter_b":"@username here I even did your researching for you but you can pick from numerous articles about him dodging the draft. @webpagelink","commenter_a":"Trump you spent all night at your rally tonight, calling Cruz a liar and cheater. Your supporters don't seem to concerned about your non polices and non plans. Keep dodging Cruz in a one on one debate, it just proves that you're the real liar! Since you said you wanted a one on one debate with Cruz, you're a dodger in every way.","post_message":"Donald J. Trump said he didn't call Ted Cruz 'Lyin' Ted' in his New York victory speech because \"I thought it would be very undignified for me to get up at that particular moment with ... pretty much the world watching.\""}]
