[{"comment_id":"1665697853729274","commenter_b":"@username How do you know Obama didn't do half the stuff he's accused of? I say he did and another half we haven't heard of yet! There isn't going to be a recount of every state, but if there was Trump probably would win by a landslide. Hillary has done nothing but lose ground!","commenter_a":"I think you guys are forgetting this is a FREE country and people don't have to perform for someone they don't respect. He hasn't earned any respect and indeed, he has done quite the opposite. Insulting people left and right and you guys just cheered. Trump believes people should bow to him and perform for him. He is NOT a king. It is his own people that were crying that no one wanted to come and all of a sudden he wants \"just the people\" Please...don't make me laugh! He is already claiming he helped keep jobs here and claiming success for Obama's successes. He has already been caught in outright lies about it. Oh I saved Sprint, they are coming back...no, that deal had nothing to do with Trump. It's laughable! Why do you ignore it? Is it too uncomfortable for you people to acknowledge he has lied to ...","post_message":"They turned up their nose at our future president."},{"comment_id":"10153631429237098","commenter_b":"Get your mind out of the gutter ladies.","commenter_a":"What a pig, No little girl's first introduction to sex should be with some slime like this.","post_message":"#BREAKING - The dental assistant was arrested over the weekend for allegedly molesting a sedated 8-year-old girl  Police say there may be more potential victims"},{"comment_id":"1079564272093616","commenter_b":"Keep the Government off our backs and away from our wallets President Trump, and put up that Wall, enforce The US Constitution, and Bill Of Rights and that should help Us all to have a Better 2016 !","commenter_a":"Happy New Year Mr. Trump! My son loves the Christmas card you sent him.. God bless you.. We love you! Trump 2016!!!!!!","post_message":"I would like to wish everyone A HAPPY AND HEALTHY NEW YEAR. WE MUST ALL WORK TOGETHER TO, FINALLY, MAKE AMERICA SAFE AGAIN AND GREAT AGAIN!"},{"comment_id":"10154512331514087","commenter_b":"I don't blame them! I wouldn't want to work with the Chump either. But is that more inexperienced, mindless sheep the Chump can put in their place?","commenter_a":"LOL, I wasn't fired, I quit","post_message":"BREAKING: All State Department senior management officials have abruptly resigned."},{"comment_id":"10155007911979228","commenter_b":"Couldn't agree more. This is a global women's health issue and we put so many women at risk by this gag. Women will be dying from this order.","commenter_a":"Thankyou for showing positive leadership against these attacks on women's rights! This is the kind of action we need in DC right now!","post_message":"Two days after millions of women marched to oppose the new president's backward policies, he reinstated the Global Gag Rule, a federal ban that will directly affect a woman's access adequate healthcare in the U.S. and abroad. It's up to Congress to permanently repeal this dangerous rule and I've cosponsored the Global HER Act to end this outdated policy once and for all.  @webpagelink"},{"comment_id":"10153523843241323","commenter_b":"Get a gf!","commenter_a":"In good times and bad times ........dick head there is prob shit about you but she's doesn't tell you ! She just except the idiot you are !","post_message":"How do I tell her how I feel without hurting her feelings?"},{"comment_id":"10152762563712894","commenter_b":"I can't stand that Bitch.","commenter_a":"For some reason i like the color & hair, I just don't fuck with Kylie like that tbh . Then again I feel as though she low key disrespecting black folks with this shit. She tried it with the lips & butt but this shit right here just made me feel like she's doing the most now","post_message":"Say What Now? Kylie Jenner Says She Wishes She Looked Like THIS All The Time [Photo]"}]
