[{"comment_id":"10153563509195329","commenter_b":"Obviously if you're not as fat as a cow then you're not a real woman","commenter_a":"Dammit! What EXACTLY is a 'real' woman?!?!","post_message":"After years of admiring the models in Victoria's Secret catalogs, we decided to make ourselves into models."},{"comment_id":"10154880634893984","commenter_b":"Move out!","commenter_a":"So, who packs there bags first","post_message":"Just as Trump begins to defy the odds, Hollywood is losing it in an unforgettable way..."},{"comment_id":"10154289283474149","commenter_b":"Why does she keep hitting he neck","commenter_a":"Push it out already lol.","post_message":"We're on #GiraffeWatch2017! When do you think the baby giraffe at Animal Adventure Park will make its debut? Read more: @webpagelink"},{"comment_id":"1616469018618909","commenter_b":"Trending: Obama's Fault Racism Gun Violence Marines holding umbrellas Climate change (that is simultaneously not real) ISIS Al Queda Hot days Cold days Rainy days The economy Abortion rate Teen pregnancy rate Hurricanes Tsunamis Butterflies that flap their wings and cause Tsunamis Terror attacks in Paris Russia attacking Ukraine North Korea hating everyone Syrian Refugees Illegal Immigration Muslims Christians hating Muslims Cops \"fearing for their lives\" #BlackLivesMatter Fox News hatred The wealthy 1% Everyone else Fantastic Four being a horrible movie _________ Fill in the blank.","commenter_a":"I don't see how you blame our first African American president for racists coming out of the wood work.","post_message":"Barack Obama is seen as one of America's most racially polarizing presidents, numerous polls show. So will tensions ease once his term ends? #RaceAndReality"},{"comment_id":"10153342655734411","commenter_b":"What is the difference between greeks and prostitutes? Prostitutes earn their money through an honest living","commenter_a":"Let's just carpet bomb western makedonia all the way to Tirana and rid the world of this problem.","post_message":"UPDATE: 8 police officers, 14 killed in Macedonia stand-off - authorities"},{"comment_id":"10153175852531990","commenter_b":"That ain't no woman either !","commenter_a":"400 lbs with a beard.....that ain't no woman!","post_message":"BEARDED WOMAN: So this happened. @webpagelink"},{"comment_id":"10154478839956636","commenter_b":"@username without god, noone can hear you get shot. Your worldview is wuite hopeless. Without god, who will punish evil ppl then evil has won. Rofl","commenter_a":"They found the remains of velociraptor Jesus used to ride on.","post_message":"Incredible"}]
