[{"comment_id":"10153353457471037","commenter_b":"@username he fondled them vaginally. He violated them. Fine line when denying it is rape...","commenter_a":"How can they know he touched his sisters and allow him to continue to live in their home?","post_message":"Josh Duggar of 19 Kids and Counting is embroiled in scandal"},{"comment_id":"1777981479109906","commenter_b":"Karma will catch this hag","commenter_a":"Vote her out !!!!!","post_message":"This Florida prosecutor tried 77 kids as adults in a year  65 of them were black.  #MicBrights"},{"comment_id":"10156168064325594","commenter_b":"Asians women are Crazy hands down!","commenter_a":"Well this certainly doesn't fit the regular narrative.","post_message":"The tearful and frantic 911 call was clear: “We got into a fight. I stabbed him. He’s bleeding.”"},{"comment_id":"10153214035528433","commenter_b":"Russ, that is exactly what legalizing same sex marriage will do. No church will be forced to perform a same sex marraige, but some already do. Heterosexuals are considered married if they have a civil ceremony, so why do we need some 'different' classification just for same sex couples??? That is called 'seperate but equal' and was ruled on by the Supreme Court in the 60s. Seperate is NOT equal.","commenter_a":"Why is civil union treated exactly like marriage between a man and woman not good enough for the homosexual activists??? IMO these radical activists just want to stick it to those with strong religious beliefs.","post_message":"Today, the Supreme Court hears oral arguments about same-sex marriage. Here's some fact-checks on the issue. bit.ly/1GyIiZb"},{"comment_id":"10154235366227060","commenter_b":"Yea and Mardi Gras day they'll be showing their breasts for beads!!!","commenter_a":"Yall be safe.....show them","post_message":"The Women's March New Orleans begins now from Washington Square Park."},{"comment_id":"10152722810447014","commenter_b":"Go back to your country, boy! \"We don't like yo kind around here!\" WHITE POWER!!! Lol","commenter_a":"Her come the racist white people...","post_message":"Do you agree with President Obama's executive action on immigration, which shields millions of undocumented immigrants from deportation?"},{"comment_id":"1747275395512005","commenter_b":"@username if it isn't Mr. Trump YOU will be voting in Hillary","commenter_a":"The only thing that needs to change is HIM OUT OF THE WHITE HOUSE.","post_message":"Obama says \"we\" need to pray for the \"strength to change.\" It's yet another of his disgusting refusals to acknowledge the realities we face."}]
