[{"comment_id":"865762326792523","commenter_b":"She needs to go home and git her dildo and go for a ride","commenter_a":"I'm sure Netanyahu is ignoring them...","post_message":"Why does the Democratic Party hate #Israel so much?"},{"comment_id":"10153155555711051","commenter_b":"sick bitch!!!!!!!!!!!!!!!!!!! Nancy P","commenter_a":"Are these women brain dead ??? Do they think they won't get caught????","post_message":"A teacher was arrested after the authorities found out what she had been doing to a student. Now she wants her bond reduced. Initially the request was going to be rejected - then she presented her reason."},{"comment_id":"10153869614430329","commenter_b":"She's not even made up of gasses, geez","commenter_a":"We throw the term \"star\" around way too often","post_message":"She tells BuzzFeed News, “I don’t regret it for a second.”"},{"comment_id":"915117481938364","commenter_b":"One day her money,scheming,and life of cards will come crumbling down in front of the world. How can billy bob clinton show his adulteress face. They are shamefull. And not the only ones. They better get their life righ fir the next.","commenter_a":"yes...why should Hillary get away with what she has done,if it was any of us we would go to prison,so yes send her to prison along with Obama","post_message":"No wonder The Hildebeest hates... The Donald. @webpagelink"},{"comment_id":"835588663194002","commenter_b":"As I was reading this article and the comments it evoked, which as a believer I support 100%, this thought came to me - what's to prevent a Godless government from forcing churches to perform gay marriage ceremonies much as they've strong armed bakeries and wedding venues?","commenter_a":"They will have to be married @ the Justice of the Peace. You can't force ministers, priests, rabbis, etc to marry them.","post_message":"The Supreme Court's decision on same-sex marriage doesn't change anything. The position of the Bible on marriage is not negotiable. #marriage #SupremeCourt"},{"comment_id":"10154542878929714","commenter_b":"Their professionals,and should set an example.","commenter_a":"Morals clauses","post_message":"This school district wants teachers to stop wearing graphic T-shirts and flip-flops to work."},{"comment_id":"10154667540793812","commenter_b":"#theybothsuck","commenter_a":"#VOTETRUMP","post_message":"UPDATE: One person in custody after two officers are injured in shooting in Arkansas. abcn.ws/2aGeleD"}]
