[{"comment_id":"10153530669581955","commenter_b":"HahahahahagagagagagahahahahahagahahahahagahahahagahahahahahahahahahahahahahahahahahahHahahahahahahahahahahahahahahahahahahahahahaha. Fucking HA! The bitch was married FOUR FUCKING TIMES. Maybe..... Just... Maybe..... SHE'S the one fucking our morals over? Hmmmm maybe YOU are the one fucking our morals over? Hmm","commenter_a":"I admire you..I would have done the same thing if I were in YOUR position..they are destroying the morals of our society..","post_message":"JAILED FOR NOT MARRYING THE GAYS"},{"comment_id":"10153523667426336","commenter_b":"Please don't reproduce, the stupid must stop with you!","commenter_a":"TRUMP ALL THE WAY!","post_message":"The 2016 election kicks off on Fox News Channel August 6th!  Fox News and Facebook are teaming up to bring you the first Republican presidential debate! LIVE coverage begins at 5p ET. Don’t miss it."},{"comment_id":"10152996938497293","commenter_b":"Sorry you can't understand science. Maybe you should go back to high school.","commenter_a":"So the WaPo says evolution is fact, even though it's theory that can't be demonstrated? Bias is a wonderful thing.","post_message":"This can go down as one of the best examples ever of why it's downright impossible to convince someone who's \"opposed\" to evolution that it's a basic fact."},{"comment_id":"868334796545922","commenter_b":"Heather go live in that cave","commenter_a":"If the public would STOP using Craigslist, it would shut down...as long as people continue using it they will stay open.","post_message":"Georgia police have confirmed that two bodies found Monday were identified as Elrey and June Runion. The elderly couple vanished last Thursday after they went to meet someone who had responded to a Craigslist ad they posted: @webpagelink"},{"comment_id":"10156543098270354","commenter_b":"So he opens the gates to let them in and then starts deporting them. I smell a RAT.","commenter_a":"Great but post it on obama and hillarys pg","post_message":"Obama Photo-Op Head Fake.  Don't Believe the Hype..."},{"comment_id":"1707461899536305","commenter_b":"This lady is lady has her own set of rules","commenter_a":"From you? Yeah right!. . . The Ambassador and thsoe Marines are - ROLLING IN THEIR GRAVES. . . right now. . .","post_message":"Do you agree with Hillary Clinton? #SCPrimary"},{"comment_id":"10155066492903352","commenter_b":"this dirty ass white trash have nerve to say something rude tlking about in my mother country do Thy use punctuation marks Bitch u just went thru ur pic on Facebook first of all you hve two boys how wuld I feel if some one were to follow the boys in rape them but then again you look like a crak head so u wuld not give two fucks right stop hittin that pip b4 you wanna tlk about other people in there country trailer trash Bitch don't u hve some beans to go warm up in the fire in eat","commenter_a":"Fa real if you can have the nerve to to that to a child who barley can right his name an innocent baby in the Lord's house you shuld get more than yur face ate in my mother country we wuld have tie his ass up in take turns slicing his body parts mKe him then make hungry stray dogs eat his freaking dick in his balls then when thats over set his ass on fire wile the mother stabs him his ass to see","post_message":"A mother let her 4-year-old go to the bathroom alone during Sunday Service…Rolls Wheeler, 39, followed the boy when he got up, and raped him in the restroom. ----> @webpagelink"}]
