[{"comment_id":"10153739079978812","commenter_b":"Waste of my energy girl..","commenter_a":"Hillary","post_message":"A new poll produced for ABC News/ Washington Post suggests negative views of Hillary Clinton have jumped since midsummer, while Donald Trump's popularity has grown more polarized along racial and ethnic lines: @webpagelink"},{"comment_id":"10152987263776130","commenter_b":"@axelnieto and @hugoaguilar. I never said people in Latin American countries aren't happy. I also never said that there is absolute no wealth or opportunity. I agree with you that it's not easy (which is what I was trying to make a point of to begin with) but it is there.","commenter_a":"They don't make work, wealth, and success important because their country doesn't give them the opportunity for that. Duh huffington post.","post_message":"\"Instead of making work, success and wealth the most important things in life, Latin Americans typically have family and community firmly at the top of their priority list.\""},{"comment_id":"10154044965451717","commenter_b":"The school I taught at had GSA. Admin discovered they HAD to allow it because they had FCA (Fellowship of Christian Athletes). Best use of irony. If a school has a non-curricular club it must allow other non-curricular clubs on campus. Federal law!","commenter_a":"When I was in high school we had one, he next year we got a new principal and he shut it down","post_message":"The ACLU says the ruling strengthens the rights of middle school students, putting them on the same level as high school students."},{"comment_id":"10154282373471636","commenter_b":"@username the uk intends on putting it's own citizens first. .to achieve this we intend to control the flow of immigration here ( not close them) the problem with the EU free movement is that the poorer member citizens prefer to go and live in the more welthiest members causing a flood in the labour market. .all other countries outside the uk have this policy","commenter_a":"They realise they can't risk all the british emigrants in the EU, the majority of them being pensioners, returning to the uk and putting a financial and physical strain on things like the health service.","post_message":"Excellent"},{"comment_id":"10153410031966615","commenter_b":"Oh man. This breaks my heart. I FOUGHT for my baby to live and can't even begin to imagine this happening to my children. :(","commenter_a":"Horrible story, horrible people to treat their kid like that. But I still can't figure out where was that carseat? Is it so hard for wpxi to say if carseat was in the car or in the house? Every time I read the story it just says child was left in carseat.","post_message":"BREAKING: The parents of a 23-month-old girl who died after police said she was left in her car seat for 13 hours have been arrested -- and will face homicide charges. WPXI Cara Sapida is talking with police and will have the latest on Channel 11 at Noon."},{"comment_id":"1554819554825337","commenter_b":"i dont have to even listen , i can tell by how stupid she looks","commenter_a":"Lunatic left.","post_message":"This is downright shameful."},{"comment_id":"965394473500060","commenter_b":"That's what happens when unqualified people get put in jobs, for fear of hurting someone's feelings!!!!!","commenter_a":"THIS WAS PLANNED , THIS IS HOW NEGRO'S GET RICH !!! I HAVE SAID THIS MANY TIMES BEFORE !!! DUMMY'S","post_message":"A New York City firefighter who was allowed to graduate from the New York City Fire Department (FDNY) training academy despite failing physical fitness tests is now on medical leave after less than two weeks on the job."}]
