[{"comment_id":"10153249679689384","commenter_b":"They are not saying that they are not going to fund the DHS- just the portion that supplies billions to illegal immigrants. The mess that the Dumbocrats likes you and Nag Nancy supported along with the idiot in the White House. You and the fools like you are no longer \"hilarious\" you are dangerous! You need to educate your foolish self and quit endangering the rest of us!","commenter_a":"Hilarious!!! GOP makes us think we are in momentary threat of something or other and then Refuses to Fund the operating system for oour Defense!!!","post_message":"The clock is ticking and still, Republicans are trapped in a dangerous, anti-immigrant fantasy. This is the second time this week that Republicans have voted to continue threatening the security of American families, doubling down on their breathtaking irresponsibility. My full statement: @webpagelink #DontShutDownOurSecurity"},{"comment_id":"1737362022990205","commenter_b":"#fingersinthebootyassbitch","commenter_a":"He looks miserable. ..","post_message":"Kim Kardashian West is reportedly 'annoyed at him for refusing to rest' following 'psychotic break' (Via Daily Mail Celebrity)"},{"comment_id":"10154858734646002","commenter_b":"@username I was shocked at the same thought, why would Disney have a man made Lake that wasn't somehow protected from alligators with a border fence ?!?! We've been there, never thought about alligators because it's Disney, they have safety rules and barriers everywhere.","commenter_a":"So let me get this straight ... Another parent is not watching their child in an area where it clearly says NO SWIMMING so now we are killing alligators for feeding in their habitat where once again it SAYS NO SWIMMING!! What is wrong with people ?!","post_message":"\"We have been to Yellowstone and encountered grizzly bears, but this is just freaky.\""},{"comment_id":"10154505706873812","commenter_b":"If you create terror among a group because you are shooting them and killing them, you are a terrorist. If you align yourself with a KNOWN terrorist group, you become part of that terrorist group. I don't believe any domestic terrorist has EVER sworn allegiance to God and commenced to killing folks though.","commenter_a":"Just because it's deleted doesn't mean it wasn't said!!! He swore his allegiance to isis! We already know this. I guess offending those of the same belief and/or faith is more important than the entire truth being released so it's sugar coated and deleted. Sickening!! Why bother releasing any of it if you delete the parts where he ADMITS he's a freaking terrorist?!!!!!","post_message":"UPDATE: DOJ and FBI release full transcript from Orlando shooter's 911 call to provide the \"highest level of transparency.\" abcn.ws/28It1Ld"},{"comment_id":"10153091643525496","commenter_b":"This woman is unreal and needs to get a life!!!","commenter_a":"Bet he won't be excited to see her any more! What kind of aunt does that! She should be ashamed!!","post_message":"The woman says her nephew, whose mother died last year, was so excited to see her arriving at his birthday party that he caused her to break her wrist: @webpagelink"},{"comment_id":"10156390568200354","commenter_b":"Then why has socialism worked anywhere ??????","commenter_a":"No.","post_message":"\"...the word ‘socialist’ has become a dirty word.\""},{"comment_id":"10153114280311037","commenter_b":"Obama called isis JV team and gave Iraq back to isis ... Soldiers died for nothing .. Iraq had nothing to do with 9-11","commenter_a":"Probably a bullet. Unfortunately","post_message":"Tomorrow, President Obama will host a summit on \"Countering Violent Extremism\" - focusing on the root causes of extremism and find ways to stop young people from joining terrorist groups. What do you think is the solution?"}]
