[{"comment_id":"10153675678941037","commenter_b":"I always thought I was a billionaire on Fridays, but by Monday reality always let me know otherwise.","commenter_a":"Hey John J. Reardon check out this guy disrespecting the Marines !","post_message":"From the upcoming Donald J. Trump biography"},{"comment_id":"1265274246854453","commenter_b":"Checks and balances in government is what our forefathers had in mind when creating this country -- to offset those may use position to do heinous things. Banning an entire religion isn't the answer - and yes, it IS banning a religion if you say Christians from these countries can come, just not Muslims.","commenter_a":"But how come , you know , if one who comes over , has bad intentions or not ? This kind of mindset is not too much different , from the mind set of nazis","post_message":"President Donald J. Trump tweeted a message about the federal judge who halted his travel ban."},{"comment_id":"1312277812121210","commenter_b":"If AMERICANS don't put a stop to this ANTI American travesty NOW, IT WILL BECOME harder to stop from behind when more tragedies are hitting us from all sides!","commenter_a":"Sanctuary Cities will become Brussels in the next 10 years.","post_message":"If you're gonna openly allow people to emigrate to your country who are not going to assimilate -- and we have been doing that. We have not been requiring assimilation. That's a stark difference between the immigration of today and the immigration prior to 1986."},{"comment_id":"587659781407559","commenter_b":"I bet those predestinarians didn't know anything about her past !","commenter_a":"Please just drop out Hillary! Give Bernie a shot!","post_message":"A special moment with a (new!) supporter and his mother in Henniker, New Hampshire."},{"comment_id":"10153915589591336","commenter_b":"Russian women are hawt !!!!","commenter_a":"Putin thinks Trump is great Could this mean that we could be friends again with Russia if Trump wins? I think so","post_message":"Donald J. Trump has plenty of admirers, and you can apparently count Russian President Vladimir Putin among them."},{"comment_id":"10156750651870551","commenter_b":"Any one who eats pizza with a folk should get out of the country .WHAT A DOUCHEBAG","commenter_a":"He's a loser! Go down the tubes! And another one bites the dust!","post_message":""},{"comment_id":"1015138285280684","commenter_b":"To the bone","commenter_a":"They cut his head","post_message":"Ron Mott said the four Chicago teens who kidnapped and tortured a mentally challenged young man weren't \"trying\" to be criminals."}]
