[{"comment_id":"10153500393969087","commenter_b":"Lmao!! Yes that woman really said that. She's a looney bin","commenter_a":"@username did you really just say \"Kid Rock is a patriot and has billions of fans that respect him?\" You really just summed up the average Trump supporter quite perfectly: someone who doesn't quite know the difference between an extra 0...","post_message":"\"I'm digging [Donald J. Trump],\" Kid Rock told Rolling Stone magazine. \"I think he will [win]. To me, I'm just like, 'We gotta try something else.'\""},{"comment_id":"10154865700468256","commenter_b":"Aaaaaaannnnndddd just fortifying my position even more!! Lmfao!","commenter_a":"I sit back, a giggle my butt off at all these liberals grasping at straws to stop Donald Trump. Such hypocrites, because just 8 years ago when Obama was elected, they were so critical of the \"birther\" cries from conservatives...... I guess when your horse loses the race, you go chasing unicorns!!","post_message":"Pressure on members of the electoral college to select someone other than Donald Trump has grown dramatically - and noisily - in recent weeks, causing some to waver ahead of the Monday vote."},{"comment_id":"545037952353451","commenter_b":"Racist people!","commenter_a":"He is right ON. Sick of all this PC!!","post_message":"This man chose to stand up to Obama's lies, and now he's facing this. What a sick joke. This man needs our help, let's show him we have his back. Do you support this Sheriff standing up to Obama?"},{"comment_id":"961399343937315","commenter_b":"Polls mean nothing, Remember Reagan! Go Trump!","commenter_a":"Are you sure it is Cruz and all the lies he told and putting the blame on others like Obama well I am not there is others was ways to do it like the Gop and the liberal party L","post_message":"\"Ted Cruz SEVERELY CUTS Trump's national lead from 18% to 3% in ONE MONTH!\" Let's go, #CruzCrew!"},{"comment_id":"10154799760844641","commenter_b":"Stop being such a yes woman","commenter_a":"Lol!!! It's Obama fault that a Multinational move jobs overseas!!!! Lol Let's blame Obama for the KKK, Osama, Sunspots, AIDS, making it late to work, and etc..... Daddy Trump is going to fix everything.... hahahhahahaha","post_message":"Some Rexnord workers said they felt left behind by President-elect Donald J. Trump"},{"comment_id":"832762386834955","commenter_b":"Little bitch alert","commenter_a":"Use thc dumbasses","post_message":""},{"comment_id":"476667025791225","commenter_b":"I agree","commenter_a":"He's right on!","post_message":"Donald Trump spoke out against gun-free zones in last night's debate, calling them \"target practice for the sickos.\" Agree or disagree? Via Opposing Views"}]
