[{"comment_id":"10155017409098896","commenter_b":"I'm ok with a trump wall.","commenter_a":"Figures !","post_message":""},{"comment_id":"10154135528287541","commenter_b":"Cops can not go around just asking people to show their ID without them committing a crime or breaking the Law!!!","commenter_a":"The Police needs to know and learn what the Law actually states!!! Because what they did is against the Law... American Citizens do have Rights!!! If they oppose to it or not!!! The cops should not be above the Law!!!","post_message":"They Tasered a black man in the face who was actually a part of their team."},{"comment_id":"10155790474957316","commenter_b":"*she's a woman","commenter_a":"Um...He's a guy so....","post_message":"Manning had been a candidate for gender-reassignment surgery, which would have been paid for under the Pentagon’s new policy for transgender troops. But the terms of the 35-year sentence the court-martial imposed includes a “dishonorable discharge,” which the commutation did not affect, Army spokeswoman Cynthia Smith said Wednesday."},{"comment_id":"10153548931652550","commenter_b":"my only solution to this and advice to the american government is to stop allowing foreigners to come into the united states... I think this country has the worst imigration problem.","commenter_a":"Who trusts the Obozo regime to make sure no terrorist enter our country masquerading as refugees?","post_message":"Welcome to America: New photo shows newly-married couple who killed 14 people in California last week in a suspected ISIS-inspired attack, entering the U.S. together for the first time last year ... @webpagelink"},{"comment_id":"10152653245300671","commenter_b":"Then get off of their butts and go through and jump the hoops just like all of our legal immigrants.","commenter_a":"this is so wrong. Take care of Americans first. Illegal immigration is wrong. I don't care what country or why you came here illegally, if you were a kid you have had plenty of time to do it legally, yet too lazy......","post_message":"The Migration Policy Institute says about 1.2 million people are eligible for the plan under the DACA rules. But now many more would become eligible if the president expands the program to eliminate the age cap. That cap includes a Modesto woman who’s been in the U.S. since she was a teenager. Ron Jones has her story."},{"comment_id":"766086360248608","commenter_b":"Because he hits women! He is no man!","commenter_a":"This punk need to be behind bars in jail lock him up.","post_message":"Rapper Chris Brown Blasts Trump And Police: \"F*** Trump And F*** The Pigs\" This punk needs to learn some respect. Can we get 30,000 'LIKES' to have him deported?"},{"comment_id":"1353532451354276","commenter_b":"Said the blond headed, blue-eyed white woman.","commenter_a":"I am so sorry if this happens, your fear, only because your skin is darker than mine. But I kinda think all of this has happened to white skinned people as well. If we could all walk argh nd inside out we would see assholes right up and recognise good when we see it. Its not about race for everyone. Some of us see us all as people!!!","post_message":"This man shares his haunting testimony: He too is afraid of being killed by the police. (via KevOnStage)"}]
