[{"comment_id":"1112699392133505","commenter_b":"Where do the vaginal secretions necessary for intercourse come from then???","commenter_a":"from a biological/anthropology standpoint, there's nowhere for it to come from besides the bladder. you're pissing on people. discussion over.","post_message":"Can women squirt, or is it just pee?"},{"comment_id":"1813669392186653","commenter_b":"I believe the only way to stop 5.O Is to kill em all Or stop bitch in, the popo gotta Gun n they Evil law,,Bt every nigga in the hood can shoot back,so kill em before they kill one u","commenter_a":"America you're gone so far.","post_message":""},{"comment_id":"1312058212172984","commenter_b":"Pandering witch.","commenter_a":"We're going to miss Michelle!","post_message":"“Como saben, estamos en medio del Mes de la Herencia Hispana. En las aulas por todo el país los niños aprenderán sobre Dolores Huerta y César Chávez… Julián y Joaquín Castro y la jueza Sotomayor… Roberto Clemente y Laurie Hernández… Gloria Estefan y Lin-Manuel Miranda e innumerables latinos más. Nombres que conocemos y nombres que tal vez no conozcamos, pero que han enriquecido a este país por generaciones. Si eres mexicano, puertorriqueño, cubano, latinoamericano o afrolatino… si tu familia acaba de llegar o ha estado aquí antes de que los Estados Unidos existiera… no eres un extraño. No eres un intruso. Ustedes son nuestros vecinos, nuestros colegas, nuestros amigos y nuestras familias. Ustedes hacen a nuestro país más fuerte, más inteligente, más creativo. Quiero que sepan que yo los entiendo y estoy con ustedes. Y una y otra vez hemos visto que cuando invertimos en la comunidad ─ cuando hacemos ..."},{"comment_id":"10153314569635950","commenter_b":"Lol yup","commenter_a":"Trump is great at selling fear. Notice how there is almost a \"Trump's fear of the week\" going on? He's great at pitching things and selling himself. Republican voters are eating this up because they like to be scared because they love having an excuse to fight someone or something. Go ahead and cling to your guns and foam at the mouth screaming about the next conspiracy,. I'm over here sipping coffee and watching the GOP sink like the Titanic.","post_message":"\"I don't like anything having to do with changing our Second Amendment. We have plenty of rules and regulations.\""},{"comment_id":"10154608110303701","commenter_b":"She's a real winner. Just block her idiot ass.","commenter_a":"Good hes a pos","post_message":"A Sherwood man is being charged with manslaughter for a crash that killed a 2-year-old in Deschutes County, according to police."},{"comment_id":"10153322465354575","commenter_b":"That's no lady.","commenter_a":"F that lady","post_message":"A veterinarian posted this picture on Facebook with the caption: \"My first bow kill, lol. The only good feral tomcat is one with an arrow through it's head! Vet of the year award ... Gladly accepted.\" The cat was a family pet named Tiger, and now she could face charges."},{"comment_id":"10154566967589369","commenter_b":"She should have got the 11 yrs!","commenter_a":"5 years? That's it? Someone please give her real sentence when she gets to prison.","post_message":"Lethal doses of heroin and fentanyl were found in the body of 14-month-old Annabella Sagstetter last May."}]
