[{"comment_id":"986811718026353","commenter_b":"\"The kids will eat it up, if it's packaged properly Steal a sound and imitate\"","commenter_a":"And thats why i loved him 👊","post_message":"Nirvana's Kurt Cobain is known for being something of a legend in music, but that's not all. In fact, he said some pretty on-point things during his time, especially about rape, bigotry, racism, and feminism."},{"comment_id":"1708300706077756","commenter_b":"Not true! The muslims were the problem then and they were stopped because the world won't lie down and let them take over.","commenter_a":"Even if this was completely true. That justifies what muslims are doing now. In this modern day & age. I truly believe this guy wants to destroy AMERICA.","post_message":"A complete fabrication. The crusades were carried out as a direct response to Islamic aggression. This is a 1400 year old problem..."},{"comment_id":"10154376449396636","commenter_b":"Sorry but the open door immigration you referred to doesnt apply to North Africans. No African countries are in the EU.","commenter_a":"I don't think the opinions of someone who has ruined an entire continent with her open door immigration policy are worth listening to....","post_message":"Strong words"},{"comment_id":"10154816797908812","commenter_b":"There's a pattern here Trump women seem to be dumber than crash dummy's","commenter_a":"She means softer because he hasn't had as many scandals and the extent of those scandals would be scary enough facing the press. I would definitely start coughing if I were in her shoes...she could pretend to faint again just as the van arrives and that way she can be saved from her own embarrassing actions. Being held accountable to the public is not in her best interest.","post_message":"The Trump campaign’s major concern: The candidate’s limited preparation. The Clinton camp’s biggest worry: That Donald J. Trump will be asked softer questions than Hillary Clinton."},{"comment_id":"10155928923344199","commenter_b":"This is the best.","commenter_a":"Breanna Barrick","post_message":"'Church, singing and sex:' That's what this couple says has kept them together for 75 years! More: via.q13fox.com/Xirhe"},{"comment_id":"10154799380074486","commenter_b":"Suck it up, cupcake.","commenter_a":"The Feminist Movement emasculated men and created this generation of Pajama Boys.","post_message":"Spot on."},{"comment_id":"916180815144838","commenter_b":"She is still the best when compared to the other guys. Run, Hillary, Run.","commenter_a":"Rut-roh!","post_message":"Are Clinton's numbers doing better or worse since she formally entered the 2016 race?"}]
