[{"comment_id":"10154083173838132","commenter_b":"They're usually thrown in an institution from a young age. They don't get job or skill training being they are looked at as \"useless.\"","commenter_a":"This is an awesome story and I am so thankful for the children that have found forever homes. I have one question if these children were left in China would they receive an education?? Or are they just forgotten about?","post_message":"What an incredible moment for these children. "},{"comment_id":"10153984129784497","commenter_b":"Area woman would have crashed car regardless of spider's presence.","commenter_a":"Area woman crashes car trying to get away from spider","post_message":"Report: Spider"},{"comment_id":"1244573758893966","commenter_b":"I Absolutely agree! A party of the people. Even a small number of seats in the Senate will be very influential. This would apply to the House, state governors, all the way through to mayors and local city counsels are all controlled by big money politics. We must stop trans-national corporations, and their billionaire owners from sucking the life out of us! STop the vampire billionaires!","commenter_a":"There IS at least one viable and active third party, progressive and non-corporatist: The Green Party. but pundits don't like to acknowledge they exist. It's a weird denial-fetish.","post_message":"\"We need third parties in this country. And by that I don't mean another third party supported by billionaires, that centrist, you know, in the sort of Ross Perot manner. I mean parties that represent different opinions on the spectrum in the manner of the populist party in the 1890s which was really the last time we saw a third party movement, that contested the ballot from the bottom all the way to the top and they were a real political party.   Unfortunately the techniques that the populists used are against the law in most states. If we were to repeal those laws you might have a vibrant third party scene again.\" - Thomas Frank, author of the new book \"Listen Liberal\" in a 2012 conversation with Bill Moyers."},{"comment_id":"1026655844022093","commenter_b":"so, we didn't have Zero cases of measles in the US in 2000 then?","commenter_a":"Wake up. Measles has NEVER been ERADICATED!","post_message":"Let's take a moment to remember that measles was ERADICATED from the USA in 2000. Nice job, anti-vaxxers."},{"comment_id":"1176769975734870","commenter_b":"Hell yes, it's about tyme someone stand up the the World Biggest Bully Obama, You Go Donald Trump.","commenter_a":"Trump is our only way out he is our only Vote we got to stay in touch @ all times","post_message":"Liberals are demanding that Donald J. Trump walk back his rhetoric against President Obama in the wake of the Muslim terror attack in Orlando. Trump isn't going to do that, though... he just doubled down and accused President Obama of TREASON.  This are Trump's most stunning remarks on President Obama yet. Do you agree with what Trump had to say?"},{"comment_id":"10153839661300950","commenter_b":"Hell NO! I won't vote for that woman!! She needs to be in prison!","commenter_a":"Don't believe Trump - don't believe Trump Campaign VOTE HILLARY VOTE TIM KAINE VOTE DEMOCRAT","post_message":"The Democratic nominee will tie Trump to the \"alt-right\" in a speech on Thursday."},{"comment_id":"10155036585354108","commenter_b":"The first lady also has shown everybody her breast","commenter_a":"again","post_message":"LIVE | BREAKING: President Donald Trump will soon speak to supporters at a rally in Melbourne, Florida."}]
