[{"comment_id":"1329754913767400","commenter_b":"Both those women have lost their minds.","commenter_a":"The comedy act of Waters and Pelosi are more entertaining than SNL. Keep up the good work, this will assure another republican landslide in 2018","post_message":"TIME TRAVELER NANCY PELOSI Says She Just Can't Work With...President Bush??? [Video]  Haha! Check out Maxine Waters!"},{"comment_id":"936764406358981","commenter_b":"what tits. he was smelling her fart","commenter_a":"\"Joe stop staring at my tits, thanks.\" ~ Hillary","post_message":"Can you imagine?  Talk about our country going to hell in a handbasket…"},{"comment_id":"930249893698207","commenter_b":"@username tell that to these women and many more @webpagelink","commenter_a":"Hillary takes millions from country's that rape girls at 9... Legally. And where woman can be beat stoned or imprisoned just for reporting rape.. What happened to the war on woman? Oh, big $$$$$$$$ Oops, my bad","post_message":"Hillary can't do it without you. Sign up to volunteer: @webpagelink"},{"comment_id":"10153782621653869","commenter_b":"That's been exactly the narrative. It's about time for a woman president. There's a special place in hell. Bernie girls are just boy-crazy. It's her turn. Thou shalt not question Her Inevitability.","commenter_a":"The media have been crowning her daily since 2015. Your daily reminder that at this point in 2008, her backers (motto: \"Party Unity My Ass!\") were still promising a bloody floor fight at the convention and demanding she be awarded all the illegal Florida delegates. Something to remember when you hear Hillarrhoids calling for you to \"line up behind her.\"","post_message":"Today's Daily Cartoon by Kim Warp. See more cartoons with our randomizer: @webpagelink"},{"comment_id":"10152763984611051","commenter_b":"they need to fire those officers, charge them criminally and hope she wins the lawsuit","commenter_a":"I'm thinking alot of you didn't read the article. Female police officer, in Canada, one month on the job, immediately suspended from the job after the attack, has since resigned.","post_message":"This officer arrested two people: a drunk teen and a rapist. She put them in the same backseat but only handcuffed one. Guess which one."},{"comment_id":"10154289426723797","commenter_b":"@username I am an alcohol manufacturer.","commenter_a":"They should never have been in prison to begin with.","post_message":"OBAMA COMMUTES DRUG SENTENCES: Nine people from Illinois are among the 95 whose prison sentences have been commuted by President Barack Obama."},{"comment_id":"933394380031531","commenter_b":"Good girl tell it like it is","commenter_a":"No one should lose their job for honesty","post_message":"Judge Jeanie Could Lose Her Job After Job After Publicly DESTROYING Obama On Live TV [VIDEO]  She just put everything on the line. Let's show her our support.  Can we get 30,000 'LIKES' for Judge Jeanie?"}]
