[{"comment_id":"974683422567079","commenter_b":"Ignore this woman! NWO!","commenter_a":"The people that surround her, and adore her, are walking dead at best....gonna be a blast to watch her debate a Socialist in the Democratic debate, hope the POS screws up royally.","post_message":"PROOF that the liberal media is in the bag for Hillary!"},{"comment_id":"10153551995732217","commenter_b":"Darn foreigners, coming over here putting mosaics under our gardens....","commenter_a":"Claire O'Regan","post_message":"This farmhouse owner was renovating his barn in Wiltshire when he uncovered... a Roman villa built around 200AD 😮 Full story: @webpagelink"},{"comment_id":"940585612654173","commenter_b":"Aleeyah your FB page is wacked out!! Girl I feel sorry for your kid. Get yourself some help. God don't like ugly!!","commenter_a":"Whitefolks did the same thing to Black Slaves, yes it is demonic and insanity. Look whom and what rule we have been unjustly livong under. The girl is showing the affect of what she was taught and learned from her step forefathers the Slavemasters children.","post_message":"Mother accused of intentionally setting her newborn baby on fire enters a not guilty plea, will undergo a mental health evaluation: @webpagelink"},{"comment_id":"611652445656331","commenter_b":"USE'N The Words \"Protect & Serve\" Is An Excape For Majority Of Ths Police Officers Who Shoot & Kill Inoscent' Civilians ... SMH* It Is A Shame ...Need To Weed -Out The B.A.D. - POLICE OFFICERS Sister Asiyah Hensley Ka'Bah Brother Abdul Azim Ka'Bah","commenter_a":"Thank you for standing up and stating the truth","post_message":"\"These shooters aren't my brothers in blue, they're murderers.\" - Rep. Andre Carson, a former law enforcement officer, joined other members of the Congressional Black Caucus to condemn the recent police shootings of Alton Sterling and Philando Castile Read more: @webpagelink"},{"comment_id":"10153605674442042","commenter_b":"They will just go somewhere else, maybe near you?","commenter_a":"I have lived in jersey city for 30years and i left six years ago....those buildings need to go...it housed alot of violent ppl....and drugs","post_message":"KABOOM! Watch the dramatic implosion of three 62-year-old Jersey City public housing buildings as the city makes room for pricier pads. READ MORE: @webpagelink"},{"comment_id":"1172600979417284","commenter_b":"She is nothing. Melanie has class!","commenter_a":"Cruz is a desperate man and a liar and will do anything !!! Go Trump!!","post_message":""},{"comment_id":"710565325800712","commenter_b":"Get out","commenter_a":"Just what? About this woman isn't alarming?","post_message":"Muslim picks fight with patriotic cashier, and then this happened. If you don't like our country's flag, you don't have to live here. Can we get 75,000 'LIKES' for this patriot?"}]
