[{"comment_id":"216170728787107","commenter_b":"She is a dried up piece of human flesh!","commenter_a":"This is a crazy idiot sue her but her out of business","post_message":"The heck!"},{"comment_id":"10154383747512908","commenter_b":"Pussy","commenter_a":"It will never stop. Americans absolutely love guns and violence. The NRA owns this country. I got my passport so I'm outta here.","post_message":"Mass shootings are becoming an almost-everyday occurrence in this country. This sickening and senseless gun violence must stop."},{"comment_id":"1211132575573437","commenter_b":"In the end, no ones opinion will matter; only God's word... Read it... One God, One way to heaven and One way of marriage- Man and woman... not two men, or two women or two women and a man or one man and 10 women.... Marriage is between a man and a woman...The bible says be fruitful and multiply so if you want to convince bible believers, let two men physically produce an offspring from their body or two women or one woman without the help of a male sperm .... that alone should convince you it's not natural or right...","commenter_a":"Gov needs to step in and force her out!! Call for that emergency meeting and have her step down!! Why are we entertaining this woman...","post_message":"'Davis is simply wrong,' lawyers for Kentucky Gov. Steven Beshear said."},{"comment_id":"1734065923549548","commenter_b":"This is exactly why we shouldn't have zoo's . So that dumb mf could have been eaten. Probably would have fed a family of little lion cubs. Too bad it's a shame . Literally shot the lions for doing something completely natural smh","commenter_a":"I would have let him be eaten","post_message":"Poor lions :( Note: people suggesting that the keepers should have let the man be eaten will be banned. Mental illness is not a joke."},{"comment_id":"10154486543656037","commenter_b":"Hillary has deceived all of u!!' Rosanna, this is what she wants. You're just as disgusting as her😎😎😎","commenter_a":"Trump has been saying the system aka Democraps is Rigged. I guess they gonna start saying build a wall next lol copy cat libtards!","post_message":"Elizabeth Warren: 'The system is rigged, and Donald J. Trump would make it worse.' @webpagelink"},{"comment_id":"493705967486650","commenter_b":"She should be in prison anyway!","commenter_a":"Finally justice might be done!","post_message":"Hillary's career could be over after she was exposed doing this.  Good. Let's end it right here, right now, once and for all.  Do you agree Hillary Clinton should be relieved of her duties?"},{"comment_id":"10152893596581336","commenter_b":"Oh look, Obama making his own rules again...surprise","commenter_a":"Who's the party of NO now.","post_message":"'Congress needs to show patience.'  Moments ago, President Barack Obama said he will veto any legislation from Congress that added new sanctions against Iran. @webpagelink"}]
