[{"comment_id":"10153603055668984","commenter_b":"Illegals and Muslims are part of the planned destruction of the US!","commenter_a":"What's it going 2 take we the people need to take a stand on all the corruption, when 5 of our military men who risk everything 4 us get killed on American soil this racist president doesn't have the decency 2 have flags at half staff my grandchildren would do a better job! !!!!!!IMPEACHMENT NOW PLEASE ENOUGH ALREADY","post_message":"I can't believe these actions by Barack Obama...This is downright shocking.  Do you think it's time for Obama to go?"},{"comment_id":"10154680917183352","commenter_b":"What these women would really look like without the weave an fake eyes an their natural color so much plastic they can make Tupper ware","commenter_a":"Are you removing that photo method man asked you to remove?","post_message":"BREAKING: T.I.’s Wife Tiny Reportedly Caught on Video Fighting and Beating Her Husband’s Alleged Mistress! ---> @webpagelink"},{"comment_id":"10154462240499087","commenter_b":"No, former president Bush didn't listen to the Intelligence Community and he didn't wait for their final report: he ordered them to leave to start his war!!","commenter_a":"It seems funny to me that all you Democrats were screaming with President Bush took the intelligence community advice on \"weapons of mass destruction\"! How quickly we change our minds....but now we are to trust the intelligence community?","post_message":"\"Lesson #1: don’t mess with the intelligence community.\""},{"comment_id":"10153764783192235","commenter_b":"Right on!!! Most religious women are thought of as breeders. According to religion they were put on this Earth to procreate and nothing else.","commenter_a":"They're not moms, they're breeders. If they were moms, they'd be in favor of children having loving homes instead of languishing in foster care. If they were moms, they'd have been doing what these guys are doing.","post_message":"This little girl is awesome."},{"comment_id":"10153545958041509","commenter_b":"Did @username edit something out of the audio the first time the guy got out of the car?","commenter_a":"He was definitely not a threat running away.. He should have sat in the car.. But the officer's job was to arrest him.. But instead he chose to execute him and then tried to frame him.. Both made wrong choices but the officer took a life!","post_message":""},{"comment_id":"572844126217923","commenter_b":"Before you build the wall could we please shut down all the tunnels underneath the fence?","commenter_a":"Jason Messenger","post_message":"WOW! An honor to be the first-ever presidential candidate in a primary- to be endorsed by the National Border Patrol Council. WE WILL BUILD THE WALL-- WE WILL MAKE AMERICA SAFE AGAIN! Thank you."},{"comment_id":"366282870162354","commenter_b":"Shot in head","commenter_a":"Death","post_message":"89 Year Old WWII Veteran Beaten To Death By Thugs. This is tragic. Please send your prayers. What do you think their punishment should be?"}]
