[{"comment_id":"10154315230081051","commenter_b":"Kelly knows the enemy is coming from the south and must be stopped . Declare war and deport all foreigners !!!","commenter_a":"Military to the front again Obama to da back of the","post_message":"Trump's Homeland Security pick is dead serious about stopping the flow of illegal immigration into America. Does that sound good to you?"},{"comment_id":"1165479466892468","commenter_b":"Bitch please","commenter_a":"@username HAHAHAHAHAHA","post_message":" #WSHH"},{"comment_id":"10154339492484087","commenter_b":"@username, good luck trying to deport a Native, you racist bigoted POS.","commenter_a":"Meanwhile, Boeing stocks take a hit because of this asshole.","post_message":"Boeing released a statement saying it was under a $170 million contract with the Air Force, not $4 billion as Trump claimed."},{"comment_id":"472935749563672","commenter_b":"Able bodied people that are on welfare should be required to work. Taxpayers have to work, why not the leeches on welfare.","commenter_a":"If they are able to work,then yes. They should have to work. Same as they should be drug tested.","post_message":"These free loaders just got some very bad news.  Awesome. It's about time these people are put to work.  Do you agree that people on welfare should have to work?"},{"comment_id":"10154177899058812","commenter_b":"shut up and go away","commenter_a":"and now back to the real news","post_message":"JUST IN: President Obama orders flags flown at half-staff in honor of Nancy Reagan. abcn.ws/1M2M51P"},{"comment_id":"660481514127059","commenter_b":"She paid him off!!","commenter_a":"Why is she using Mr. Kahn so much? I thought his family is still distraught about the horrific death of his son?","post_message":"Replay: Hillary Clinton was in New Hampshire."},{"comment_id":"1211910735512691","commenter_b":"Duck you you racist old bitch","commenter_a":"Stop drinking you juice head.","post_message":"This racist woman went off on two Hispanic shoppers with a racist rant  and no one did anything to stop her.  More on this story here: @webpagelink"}]
