[{"comment_id":"10152928923462293","commenter_b":"His twin appears normal. She also got a lead paint settlement?","commenter_a":"\"Didn't Die In Vain\" . . . but he lived in vain . . .","post_message":"Reports of Gray’s history with lead come at a time when the city and nation are still trying to understand the full ramifications of lead poisoning."},{"comment_id":"1052573001452785","commenter_b":"Absolutely fuck a gun i don't hit women but that ghetto trash should've been slapped in the face","commenter_a":"This is the norm for these racist cockroaches, get a gun people because we're at war whether you like it or not................It's all thanks to that sorry POS Obama and his corrupt administration that led us here!","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO] Racebaiters will never say anything about this. What would you do in this situation?"},{"comment_id":"1079981378728005","commenter_b":"Sick Bitch","commenter_a":"She's an immigrant through and through!","post_message":"WOW. Just...Wow."},{"comment_id":"10152808578696130","commenter_b":"Sadly, I could post these articles about pitbulls all day long and never be finished","commenter_a":"The purebreds are a very dangerous breed. Statistics do not lie.","post_message":"\"This bill would make Mississippi the only state in the nation with a statewide policy discriminating against a specific dog breed, and the impact on local communities, animal shelters, and law enforcement would be disastrous.\""},{"comment_id":"10154096917590329","commenter_b":"Grade 6 gym class. Ran face first into a cement wall during a game of dodgeball. I had two black eyes, one of which was swollen shut, and a nasty bump on my forehead. Our picture day was the following week. Best school picture ever!","commenter_a":"Jon Maloney you could add a story to this","post_message":"LOL"},{"comment_id":"10153252592734138","commenter_b":"R u mad or naw?","commenter_a":"All the white people would try to escape n end up north side n get beat up","post_message":"Today, Gov. Mark Dayton blasted Newberger's remarks, calling them \"disgraceful.\""},{"comment_id":"1668356646775381","commenter_b":"The truth will set you free and she spoke the truth.","commenter_a":"Fox should listen to its viewers. Go Stacey","post_message":"Stacey Dash has been suspended by Fox News for saying this to Obama. She needs our support. Should Stacey Dash be reinstated?"}]
