[{"comment_id":"1772017636373096","commenter_b":"Women have no business being police officers. Would you give her the Nuke Codes? Imagine Hillary Clinton","commenter_a":"Surrounded by 5 fellow officers? Whatever! You murdered a father of 4 on a disabled Vehicle call.","post_message":"The attorney for Tulsa Police Officer Betty Shelby says she believed Terence Crutcher was attempting to reach into his car to retrieve a weapon. In her interview with homicide detectives, she said, \"I was never so scared in my life as in that moment right then.\""},{"comment_id":"966056150146121","commenter_b":"Slow learners. Blacks keep voting Democratic even though Dems have done nothing but baby them and keep them down.","commenter_a":"They STILL haven't learned about the democrats !!!!!!!!!!!!!!!!!","post_message":"LANDSLIDE"},{"comment_id":"10153713110753690","commenter_b":"a philistian women","commenter_a":"some facts from the bible samson an delila samson the israel lite wasted gaza","post_message":"Israeli authorities have issued more than 13,000 demolition orders against Palestinian-owned structures, including homes, in Area C of the occupied West Bank between 1988 and 2014, according to a new report by the United Nations Office for the Coordination of Humanitarian Affairs.  Area C is a designation from the Oslo Accords' era that indicates the region is under full Israeli military and administrative control. The area, home to around 300,000 Palestinians, covers 60 percent of the West Bank and is also where most Jewish settlements are built."},{"comment_id":"1538102683151787","commenter_b":"What a bitch","commenter_a":"That was totally uncalled for she was just trying to start trouble!","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO]  Racebaiters will never say anything about this.  What would you do in this situation?"},{"comment_id":"1553360474683977","commenter_b":"This sellout Hispanic wants to sell you some crappy shirt","commenter_a":"As American hispanics, we are tired of how all of these coward racist liberals that hate America like Obama, Clinton, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, we're supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of our skin... disgusting. That's why we support Donald Trump. Show everyone your support for Trump by buying the fantastic Trump Strong t-shirt at: www.teespring.com/trumpstrong . And let's Make America Great Again! Thank you.","post_message":"During a Colorado rally on Sunday, Trump unfurled an upside-down rainbow flag with the words \"LGBTs for Trump\" written on it."},{"comment_id":"1603977773244161","commenter_b":"Revoke her clearance!","commenter_a":"BREAKING: HILLARY SET TO RECEIVE SECURITY CLEARANCE ANY DAY NOW!!! She broke the law. She exposed our nation secrets. She lied to the American people countless times. And yet, this week she is set to receive access to information she already proven she can handle. We cannot allow Hillary to put America safety at risk. Demand the FBI revoke her security clearance","post_message":"Tom Fitton is LIVE to discuss our Judicial Watch weekly update on the Obama IRS Scandal and more!   [touch sound icon at bottom right to increase the sound or turn your own volume up. Thx! . ]"},{"comment_id":"895114997196955","commenter_b":"Your mother is a rat","commenter_a":"for press tv and iran the houthi rebels who tried to overthrow the govt are not terrorists. Instead the forces fighting houthi rats are terrorists. and iran claims to be a democracy. wtf","post_message":"Saudi warplanes airdrop weapons to militants in #Yemen  Read more: @webpagelink"}]
