[{"comment_id":"1144427122283701","commenter_b":"Seriously this woman obviously needs help.","commenter_a":"My cat thinks she's a human","post_message":"She hisses at dogs and often crawls on all fours"},{"comment_id":"10152947351429091","commenter_b":"They should send these idiots to go fight Isis since there so big and bad let's see how big n bad they are then..","commenter_a":"I hate ghetto children! Yes hate! That is our future? I'm scared.","post_message":"UPDATE: 2 arrests were made in a vicious beating at a McDonald's in Brooklyn. Teens were trading blows when a Good Samaritan jumped in...then he became a target, too. MORE: @webpagelink"},{"comment_id":"10153237393021350","commenter_b":"Great idea but this lady ain't fat...","commenter_a":"You look fantastic!!","post_message":"This mom has become a swimsuit role model."},{"comment_id":"10153779454116336","commenter_b":"She's a snake!","commenter_a":"Shes all done for now, goodbye Hillary","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."},{"comment_id":"10153017146936973","commenter_b":"But history is written by the victor i suppose.","commenter_a":"I'm from Mississippi and have been living in Oregon this pass year going school, work, etc. The Confederate flag represents our heritage and the hard working people like the farmers that supply food for you, and feed for the animals people in the U.S consume. Majority of the military that protects this country is Southern. People think they can just so publicly shit on us for something they know nothing about. Let me tell you something my family has been there for generations they had no slaves had to bust their asses having their children working hard picking cotton and corn using wood stoves until the damn 70s. Only the rich had slaves and that made up what 2% of our population ha. Bunch bullshit putting down an entire cultures heritage because of a few bad seeds that had the money and could call the shots.","post_message":"As the nation struggles with the legacy of a historic icon commonly brandished by hate groups, the outcome of that conversation could resonate in Oregon, too."},{"comment_id":"1457146887628950","commenter_b":"She's singlehandedly responsible for the murder of countless unborn babies! She can burn in Hell!","commenter_a":"Rest In Peace Norma. God bless you","post_message":"Norma McCorvey, 'Jane Roe' of Roe v. Wade, dies at age 69"},{"comment_id":"10153243418332411","commenter_b":"That's one ugly sumbitch!","commenter_a":"will someone puuulease show this guy the Gates of Hell !","post_message":"North Korean dictator Kim Jong Un used his annual New Year's speech to warn that his country is ready for war."}]
