[{"comment_id":"10153653825589641","commenter_b":"Barbaric ... Disgusting behavior . Poor woman. I thank God every day that I was not born in an Islamic country and pity all those women who are oppressed . May she rest in peace .","commenter_a":"What happened to the man she was supposedly cheating with ? Let me guess ....nothing. That country is nothing but a bunch of murderers","post_message":"The victim was in a forced marriage, and had tried to flee with another man."},{"comment_id":"10154710996716800","commenter_b":"HHHHHHHHHHHHHH MRDOH hhhhhhhhhhhhhhhhhhh","commenter_a":"Ilyass darori tchouf had lvid XD","post_message":"Ronny Chieng makes a desperate plea to a batch of undecided voters ahead of Election Day. #election2016"},{"comment_id":"1360158044010314","commenter_b":"Yup :)","commenter_a":"Yes, America will get it right. Our next President will be Donald Trump. I pledge to all the women like me not to listen to the media who wants to portray Mr Trump as being against women, please don't listen to it. Mr Trump will be good to everybody in his administration. He is a fair man.","post_message":"THANK YOU, AMERICA! I love you!"},{"comment_id":"10155252266929411","commenter_b":"Wheres the music coming from?","commenter_a":"77","post_message":"#1917LIVE: The sun sets on the Russian Empire Romanov rule is collapsing. Martial law imposed in #Petrograd. Authorities fear violence can erupt anytime. Russia is like a boiling cauldron, that can explode at any second. Follow #1917LIVE - Retweet the Revolution @webpagelink @webpagelink/ 27.02.2017"},{"comment_id":"10153262054135779","commenter_b":"It's funny cuz it's true.","commenter_a":"\"...MTV then responded by phasing music out altogether over the course of the next few decades, essentially defeating the entire point of why they're there in the first place.\"","post_message":"In 1983, while promoting 'Let's Dance,' David Bowie takes the then two-year-old network MTV to task for playing virtually no videos by black artists. Watch the amazing interview below."},{"comment_id":"10156197191420354","commenter_b":"A CULT that needs to be extinguished!","commenter_a":"Islam is NOT a religion of peace!!!!!","post_message":"The full statement is SCORCHING..."},{"comment_id":"10154088708589087","commenter_b":"Including Melania Trump, she's illegal so vote for Hillary Melania!! LOL!","commenter_a":"the legal immigrants (hispanic and otherwise) should get onboard the Trump train...the illegal immigrants should vote for Hillary.","post_message":"House Hispanic Democrats said Trump is a \"cloud hanging over us\" as they begin celebrating Hispanic Heritage Month."}]
