[{"comment_id":"674485572723233","commenter_b":"she needs to sit down and shut up","commenter_a":"Talk about a nightmare! Handler, look in the mirror!","post_message":"Lefty comedienne Chelsea Handler goes on a racially charged rant against Trump.  Just imagine if a conservative said anything like this?"},{"comment_id":"10154437809561491","commenter_b":"Sorry, no. She is front and centre in this kangaroo court of #45. She cannot have it both ways.","commenter_a":"Let the woman live her life. Sure, I cannot stand Donald Trump to save my life. But what is going to set us apart him? We do not judge people based off of the behavior of someone else. That's what being a liberal is all about. Acceptance of each and every person on the basis of their individual character.","post_message":"The Internet is not happy with the latest post by Ivanka Trump's brand."},{"comment_id":"10154735713113132","commenter_b":"She lives for the fame..controversy and all.","commenter_a":"Why discuss this with tabloids? What does her children gain from it? That's private. Quit putting your kids out there to be vulnerable like this.","post_message":"Kate Gosselin is opening up about her son Collin."},{"comment_id":"10153448669913984","commenter_b":"All she had to do was say she was to fat to walk any farther and lazy. Should of called the cops and let them tow her.","commenter_a":"I want to have cards printed that say \"Congradulations! You have just won Jerk Of The Year Award for parking in a handicap parking space. Because of you my Mother could not get into her wheelchair. May you never have to be in the same situation.\"","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"10153301839268854","commenter_b":"Why isn't sharpton in jail for not paying his taxes instead of running around free doing nothing but causing trouble. That is the question.","commenter_a":"Douche bag!","post_message":"Sharpton Calls for Federal Police Laws... 'There must be national policy'..."},{"comment_id":"10153546316384714","commenter_b":"Piss off Clinton and go smack your ugly wife.","commenter_a":"You can take the black out the ghetto, but you can't take the ghetto out the black.","post_message":"Johnson was dismissed just hours after a video of him punching a woman was released"},{"comment_id":"897132857052677","commenter_b":"i can deal with trump and cruz. NO RUBIO! or KASICH! let illegals stay here at no price. do not understand why people hate common core. soros giving them bucks. not them!","commenter_a":"Trump/ Carson","post_message":"Who are you voting for?! Let us know!"}]
