[{"comment_id":"1136752646369001","commenter_b":"No the world is laughing at America","commenter_a":"The most pathetic, delusional president in history by far. Terror, hatred, murder and division all over the world like none in recent history and he says something so outrageous? Embarrassing and the world is laughing at this fool.","post_message":"Obama thinks we're living in the most peaceful time in history."},{"comment_id":"10153661042541523","commenter_b":"You dumb white bitch!! THE SAME WAY YOU CELEBRATED CHRIS FAIRLY, AMY WINEHOUSE, AND THE REST OF THE HEROIN ADDICTS IN YOUR Neighborhoods......I will be so glad when your evil race is nearly extinct! Take your evil back to the caves of Europe!!!!","commenter_a":"RIDICULOUS!! The freak had mental issues and died of an overdose- why would a church celebrate this idiot??","post_message":"A Tulsa church’s tribute to Prince is going viral."},{"comment_id":"10153409489988010","commenter_b":"AIR COOLED vs. WATER COOLED. Not all motorcycles are designed alike. Bikes also have a tendency to overheat in higher/hotter temperatures.","commenter_a":"I've heard a common argument in favor of lane-splitting from motorcyclists that it's a necessary practice due to the lack of cooling on motorcycle engines. To avoid overheating, motorcyclists cannot sit idle very long as automobiles do. I've always wondered what the full truth is behind that.","post_message":"Motorcycle lane-splitting — the rush-hour time saver for bikers that enrages many drivers — may be poised for formal legalization."},{"comment_id":"1665137810414324","commenter_b":"Beyonce is a racist and a cop hater.","commenter_a":"God Bless You.","post_message":"Whoa, this outspoken Obama critic didn't hold back at all when discussing Beyonce's Super Bowl halftime performance... and he pointed out EXACTLY what made it so hypocritical.  If you thought Beyonce's halftime performance was unacceptable, spread this video far and wide,,,"},{"comment_id":"10154202111261037","commenter_b":"The real question is why she felt it necessary to do it!!","commenter_a":"Here you go: These are not my words. This was a comment from a woman named Laura Johnson who posted on TYT thread, and I thought it was worth the share. When Bill Clinton was president, he allowed Hillary to assume authority over a health care reform. Even after threats and intimidation, she couldn’t even get a vote in a democratic controlled congress. This fiasco cost the American taxpayers about $13 million in cost for studies, promotion, and other efforts. Then President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were Zoe Baird and Kimba Wood – both were forced to withdraw their names from consideration. Next she chose Janet Reno – husband Bill described her selection as “my worst mistake.” Some may not remember that Reno made the decision to gas David Koresh and the Branch Davidian religious sect in Waco, Texas resulting ...","post_message":"In a wide-ranging interview with FoxNews, President Obama says he failed to adequately plan for the day after the U.S. helped toppled Libya's dictator in 2011."},{"comment_id":"1351703334882522","commenter_b":"He should be raped to death by chainsaw","commenter_a":"Place him in the general population of prison. He won't last. That is the one crime they don't tolerate.","post_message":"Petition Created To Publicly Hang Benjamin Taylor, Who Raped 9-Month-Old To Death!  This guy is sick, its our duty to make sure he never harms another child."},{"comment_id":"10155182978984369","commenter_b":"We are animals no different then lions killing each other in self self-defense. i believe killing for money power drugs and such is a sin. Killing for self-defense would be justified","commenter_a":"A few people on here are saying that a gambling debt or drug debt isnt a good enough reason to kill someone. Maybe not for you but obviously a good enough reason for someone who kills...","post_message":"NEW INFO: The victim girlfriend told investigators she drove her boyfriend to the location of the shooting to collect on a Super Bowl bet and when he exited the vehicle, he was shot"}]
