[{"comment_id":"10153005489041770","commenter_b":"And who says this female is not a partisan hack?","commenter_a":"This woman is an enemy to our country.","post_message":"\"There’s nothing more important to me as a Jew to ensure Israel’s existence is there throughout our generations.\""},{"comment_id":"1037567749698799","commenter_b":"Facebook is trying to silence him tonite","commenter_a":"Completely cut off","post_message":"Watch Live: Donald J. Trump holds a rally in Sterling Heights, Michigan."},{"comment_id":"10155065257093984","commenter_b":"There is no doubt Israel or Jews were there first. As far back as 2166 B.C., some say as far back as 4000 B.C.. Arabs or Muslims first recorded being there 853 B.C., Mohammad wasn't born until 570 A.D..... The size of Israel is 12,877 Sq. mi. about the size of New Jersery... The size of Arab, Muslim land is 8,368,272 Sq. mi., and consist of 20 countries. That would be the size of putting together (Texas and Alaskas) 8 times.... Over the years Muslims have attacked Israel, even combining countries to fight Israel and have lost every time to Israel's strong military. During peace talks, Muslims have never given up anything to Israel. Whereas everytime Israel has given up land to Muslims, they have used the land to move closer for attacks against Israel. Muslims do not want peace with Israel. They have said they will not coexist with ...","commenter_a":"NBC is one of the least creditable news sources. The beat goes on ! Time to boycott them.","post_message":"Talk about \"fake news!\" Here's how NBC was just BUSTED in a massive lie designed to make people think less of Israel. Here's what they had to say that has a lot of people outraged... This proves EXACTLY how the mainstream media feels about Israel..."},{"comment_id":"739879102780921","commenter_b":"She's biding her time!!!","commenter_a":"Let me offer you, @username, some unsolicited and unqualified advice since I'm not a politician. There is no way you should be neck and neck with Bernie Sanders. But you're playing weak. Go on the attack. Use your willingness to stay in a marriage regardless of your husband's infidelity as a selling point. We all know people make mistakes. Marriages often dissolve over a hint of unfaithfulness and unforgiveness. Only the extremely strong can take a mistake made by a spouse to demonstrate their character. If I'm not mistaken this is Sanders' second wife and 'The Donald' has had three wives and several affairs. How many times have you been married? They can't use President Bill Clinton's infidelity to their advantage, but you can. Who are the people advising you?","post_message":"Jimmy Fallon: Can we do a Snapchat? Hillary: Sure! 👻"},{"comment_id":"10154357996114203","commenter_b":"innocent guns. why do we ban drugs such as cocaine? if the entire responsibility is on the abuser","commenter_a":"line up Americans arguing what the definition of assault rifle is.","post_message":"Conan O'Brien: \"I am a father of two, I like to believe I have a shred of common sense, and I simply do not understand why anybody in this country is allowed to purchase and own a semiautomatic assault rifle. It makes no sense to me. These are weapons of war, and they have no place in civilian life.\""},{"comment_id":"1607625002874515","commenter_b":"Whole Lotta good talking to your imaginary friend in the sky did her...","commenter_a":"Man, I was on Atlantic and Nostrand earlier this year, when Girl must've have been under the influence of this mess dropped her pants and ran across Atlantic avenue into on coming traffic. It wasn't no one but the angels that carried her to the other side of that street... Idk what jumped in my soul, but all I could immediately do was pray over her.","post_message":"Some are calling it 'Zombieland.' Bed-Stuy in Brooklyn is where 33 people were seen wandering around Tuesday, in what police say appear to be K2 overdoses. This video shows some of those who were treated."},{"comment_id":"769122743278303","commenter_b":"Your right just little bitches","commenter_a":"Three armed thugs couldn't handle one 67yr. old man. Punk ass b!tches, take note; One responsible, LEGALLY armed American Citizen is better than three worthless, no job pussies with mothers on welfare with multiple kids from multiple donors. And they wonder why they get shot.","post_message":"Thugs Attack Little Girl, Grandpa Immediately Blows Them Away With Shotgun. Thank god for the 2nd amendment. Let's show him our support. Can we get 75,000 'LIKES' for this grandpa?"}]
