[{"comment_id":"1121791217896305","commenter_b":"Go back to school. Its not just to slow things down so you can understand!!","commenter_a":"\"We will reject bigotry and hatred and oppression' IM DONE LOL also you forgot a comma","post_message":"This is my pledge to the American people: as your President I will be your greatest champion. I will fight to ensure that every American is treated equally, protected equally, and honored equally. We will reject bigotry and hatred and oppression in all its forms, and seek a new future built on our common culture and values as one American people. -Donald J. Trump"},{"comment_id":"611126095746235","commenter_b":"That's less people for Iran to jail and then demand ransom money for.","commenter_a":"Yeah they want to kill us but they want to take our money first good riddens who the hell would want to go there with those barbarians","post_message":"New post (Cancel your vacation plans: Iran bans US citizens, says US ban is \"obvious insult to the Islamic world\") has been published on Jihad Watch"},{"comment_id":"10154326726666729","commenter_b":"None... Technically. I do think they may have accidentally drifted into their waters..","commenter_a":"Why did our sailors surrender and why didn't we have any support for our sailors such as a helicopter? Something isn't right here, this stinks like Benghazi.","post_message":"We REALLY wish we didn't have to show you this, but this is what the results of feckless foreign policy leadership look like..."},{"comment_id":"704368863070943","commenter_b":"He covered the swamp with scum!!","commenter_a":"Tge ma is a F-ing Con-artist!!","post_message":"Did Trump \"drain the swamp\" like he promised during the campaign? Vote below! LIKE Occupy Democrats for more anti-Trump content!"},{"comment_id":"10153427070736749","commenter_b":"BAN ALL THE POLITICIANS AND YOU WON'T HAVE ALL THESE STUPID IDIOTIC LAW'S WE HAVE TODAY WHERE THEY ARE TRYING TI TAKE ALL OUR GUN RIGHTS AWAY! OUR FOUNDING FATHERS OF THIS GREAT NATION ARE PROBABLY TURNING OVER IN THEIR GRAVES RIGHT NOW THINKING WHAT, WHERE AND WHEN THE NEXT CIVIL WAR WILL BE HERE IN THE U.S.A. WE NEED TO CLEAN HOUSE OF ALL THESE ELECTED OFFICIALS AND ELECT NEW BLOOD INTO THE OFFICE! CASE AND POINT MADE.","commenter_a":"Time to get EVERYONE trained properly on gun safety! Time to re-address the mental illness issues...","post_message":"Gun violence shouldn't be so commonplace. It's time for Congress to do something about it. @webpagelink"},{"comment_id":"10153322754305667","commenter_b":"On an earlier USA today post the majority were celebrating a mans death. I used the word moron it was deleted and USA today had me banned from FB for seven days see a lot worse then that.","commenter_a":"I have been noticing that on comments sections of news articles on Facebook regarding the death of Supreme Court Justice Antonin Scalia, it is the Bernie Sanders supporters/Bernie Bros who are celebrating the death of the late Supreme Court justice. I may have disagreed with his ideology and beliefs, but that is not a reason to celebrate and be happy of someone's death. Says a lot about the mentality of many Berniebots... especially the younger generations.","post_message":"In 1986, he was nominated by President Reagan to the Supreme Court. His confirmation that year made him the first Italian American justice."},{"comment_id":"429495940593558","commenter_b":"The racists are AGAINST Trumo!","commenter_a":"The days of Nazi Germany are coming back if we don't stop this racist Trump. Blacks and Latinos must unite power to end this nonsense.","post_message":"The Secret Service rushed to shield Donald J. Trump after someone tried to jump a barrier during an Ohio rally on Saturday."}]
