[{"comment_id":"1858429714391337","commenter_b":"Canadian has no say. Go home","commenter_a":"He's a fat, ugly, ignorant pig. Hit the sty.","post_message":"Simply pathetic."},{"comment_id":"607183962802381","commenter_b":"@username then maybe you should move out of America if you can't handle it. Bye Felicia","commenter_a":"Only reason big cities elect her is Bc they are the low life's looking for their hand outs... Guess what?! You'll be returning your Obama phones soon :) haha","post_message":"We’re in New York with Chris Moody and Vanessa Yurkevich who are talking to voters about tonight’s dramatic election results. Any questions? Let us know! #CNNElection #ElectionNight #MyVote"},{"comment_id":"10154522973374102","commenter_b":"She may be the lesser of two evils, a female, a scapegoat, but she's still a nut job.","commenter_a":"I'm not saying she doesn't deserve disciplinary action, because she does. But I find it disgusting that they are targeting ONLY her, and not Trump's tweets against Nordstrom. I get that she's an easier target for the GOP, but grow a pair of balls, please.","post_message":"BREAKING: The Republican chairman of the Oversight Committee is recommending disciplinary action against Kellyanne Conway for promoting Ivanka Trump products from the White House, including \"reprimand, suspension, demotion, or dismissal.”"},{"comment_id":"10154910667241162","commenter_b":"We both like thick @username, but for some strange reason she wanna be thin.","commenter_a":"Demetrius DaInfluence Hardy and @username told y'all it was debatable.","post_message":"We all agree that Chicago has the best pizza - but the debate in our newsroom is over deep dish or thin crust. What your pick? Our Hungry Hound did some research for you: @webpagelink"},{"comment_id":"1023513341058227","commenter_b":"Go figure. A business in business to make money. She should know, she's the biggest criminal of them all.","commenter_a":"imagine that, a company in business to make money. You can't fix stupid, but you can vote it out of office, or in this case make sure it doesn't get into office.","post_message":"This is most likely the dumbest comment she has made to date..... so far."},{"comment_id":"10154326925529586","commenter_b":"The same thing happened to me! A few neighbors found it funny to toss their firecrackers over the fence during some lunch party. We came home to find our poor baby scratched up and shaking - stuck between a rose bush and fence. Horrible horrible how lightly some people take this!","commenter_a":"I used to love July 4th until someone decided to throw firecrackers in the yard with my dog. She passed her fears on and my dogs are so afraid they huddle against me and shake. I dare not leave my home out of concern for what my pets go through.","post_message":"URGENT: Your dogs & cats can be TERRIFIED of fireworks. Keep them safe this #FourthOfJuly."},{"comment_id":"10156809440295725","commenter_b":"Time to get tough with these vermin muzzies. We need to kill them before they kill us. Wake up, America, this is not CandyLand anymore.","commenter_a":"It is time! We have been too relaxed on this matter for too long. It is not that we do not love and welcome diversity and other nationalities and cultures into the amazing USA; however, we must have order and we must have processes in place to be proactive rather than reactive about our safety. We must take care of the people in our country first and then use the wealth that those resources will bring to help others throughout. My mother always said, if you cannot take care of yourself first, you cannot take care of anyone else and that simple advice applies here greatly.","post_message":"As president- I would be very, very tough on the borders, and I would NOT be allowing certain people to come into this country without absolute perfect documentation!"}]
