[{"comment_id":"10156141485930725","commenter_b":"How does DNA on her body prove it was rape???","commenter_a":"DNA was found on her body. Is this not enough? Oh, I forgot. He is a sport star.","post_message":"More than six weeks after news broke that Patrick Kane was under investigation for an allegation of assault, findings from a rape kit conducted on the alleged victim have been revealed ----> @webpagelink"},{"comment_id":"10153192741541336","commenter_b":"@username you sit there and bad mouth President Reagan about low wages and high debt well buddy you ain't seen nothing yet. obozo is bringing in all the illegals and he is giving all the companies a bonus to hire illegals over American citizens because they will work for lower wages so all wages will be kept low and where do you think obozo is getting all this money that he is passing out? It is not all taxes because if you don't work you don't pay taxes and the illegals don't pay taxes on what they earn. He is adding to the national debt by borrowing more money.","commenter_a":"I am 17 and a college student and this breaks my heart. Do people know what he did for the country? He was not perfect but he made America strong.","post_message":"Can you identify this man?"},{"comment_id":"952596034775492","commenter_b":"@username Shooter FU! You are a whinny little bitch.","commenter_a":"lol we are fucking idiots, we believe in make believe deities, we salute the flag of the sickest country in the history of existence, we salute brainwashed troops who murder innocent people behind imaginary lines, welcome to brain dead Georgia lol","post_message":"If you don't love the nationalistic rhetoric of the state, LEAVE! Police The Police | The Free Thought Project.com"},{"comment_id":"1308350412560406","commenter_b":"She looks like a black snowman... Where's her neck..?","commenter_a":"Who cares what this fat cow thinks???","post_message":"Whoopi Runs Her Big Mouth at Mike Pence GETS A BRUTAL RESPONSE! Wow... she should just shut her mouth! Lets get 5000 SHARES if you agree she should be FIRED!!!"},{"comment_id":"1181726388516881","commenter_b":"Yep, infidelity has nothing to do with a woman's looks. It's opportunity.","commenter_a":"Been there done that ....it sickens me even the prettiest girls get cheated on which tells me that it is not about how good you look,how skinny you are, or even how rich you are you see how when they make their minds up and don't want to work at fixing anything well we need to stop giving second chances too.","post_message":"Check out what Keshia had to say about the lie that was their relationship. What do you think of her comments?"},{"comment_id":"1191908450861681","commenter_b":"wake up and smell the flowers Jill.... get the Frack out of the race...\\\\","commenter_a":"Plus, the Green platform is 50 good, 50 incoherent","post_message":"(LU) Your run will strip votes away from Clinton. Bernie Sanders knows this. That’s why he isn’t running as a third party candidate."},{"comment_id":"10153129778526336","commenter_b":"Women can't do it. Its physically impossible unless the standards are lowered (this has been repeatedly proven in Marine infantry officer course) and lower standards WILL KILL PEOPLE IN COMBAT. People that want women in ground combat either have not the slightest idea what it is OR had a far different experience than most infantrymen of my generation had. There are no bathrooms in the field. There are no showers for weeks or months sometimes. But maybe its easier now. But I doubt SF or Seals are.","commenter_a":"Everybody should be held to the same physical standards to do the job. Man or woman. That's equality.","post_message":"Controversial new surveys about women serving in the special forces found that men in special ops fear women aren't up to the task."}]
