[{"comment_id":"10153255952000950","commenter_b":"Isis days are numbered. They are not long for this world. Believe it or not theres more important fish to fry","commenter_a":"I think he's so creative!! Instead of CNN just cashing in on the money for no good reason - let's do something for those that have done so much for this country! You guys who think this is Mr Trump being cocky or greedy just don't get it...","post_message":"Donald J. Trump is demanding that CNN — the host of the next GOP debate — pay him $5 million dollars to participate, with the proceeds to be donated to veterans."},{"comment_id":"670286056475622","commenter_b":"@username Andrew Givney","commenter_a":"Jordan Monroe","post_message":"'Tis the season to turn up."},{"comment_id":"10153176047249255","commenter_b":"His wife should also go to jail .","commenter_a":"Such a self proclaimed victim.","post_message":"This story gets crazier every hour."},{"comment_id":"10153811495701316","commenter_b":"God's will & Grace","commenter_a":"Corrine Amin","post_message":"There's a time for everything."},{"comment_id":"934898123236603","commenter_b":"COWARDS!!!!!!","commenter_a":"Yes stop and we can just pretend it's not happening....?","post_message":"This is sickening"},{"comment_id":"1117181214965894","commenter_b":"@username , It is kind of a long story... But just as we have labels on cans to tell us whether it's Corn or Peas the label on our Faith denotes how accurately we wish to follow Jesus .","commenter_a":"Many are walking away from Christianity, because not all...but the few, out there in this world use God and the Bible to push their own personal and political agandas! People are so tired of so-called Christians who act so self-righteous and who's actions are far far from what Jesus would do! As a Christian...Many of us do not want to be represented by Greed, bigotry and hatred!","post_message":""},{"comment_id":"10158574220485206","commenter_b":"Ur a racist #sitthefuckdow","commenter_a":"We cannot wait for a Trump presidency. #WeThePeople must rise now & take back America which has been stolen from us!!! Trump touched me a year ago. He reached inside me and touched my heart and built a patriotic fire that flows deep through my veins and has given me hope that we can save America from the elitist New World Order Puppet Masters who would end our freedoms forever God bless Donald Trump!","post_message":"It would be a rare revolt."}]
