[{"comment_id":"641480782679805","commenter_b":"She bad as fk though!!!","commenter_a":"@username wwyd? 😂😂😂","post_message":"What would you do???  #WSHH"},{"comment_id":"10152832059200927","commenter_b":"Only in PRC (People Republic of California)","commenter_a":"This guys also looking for a raise, he says he can't make it on $174,000 a year with free medical, vehicle, and perks. I think he needs to be deported.","post_message":"So the murder of an innocent woman by an illegal alien is little thing?  That's what this congressman thinks!"},{"comment_id":"10155057898721729","commenter_b":"You can't make this crazy stuff up","commenter_a":"So they want equality. They get it but its not the equality they wanted because gasp! The police officers do their jobs. So the black police officers are not REALLY black because they are doing the jobs that the black population wanted them to do (and represent the black community) but didnt expect them to do the job as it is supposed to be done. Eeek! My head is spinning.","post_message":"How's this for a racist stereotype?"},{"comment_id":"10153361519746813","commenter_b":"That's the point. You said it yourself. Men have been using the men's room and women have been using the ladies room without an issue since forever without any problems. My point is that the law allows for men to use the ladies room and women to use the men's room, that is the basis of this law.","commenter_a":"I want to know why this is such a \"hateful\" law. The \"party of science\" is arguing against a law that basically says \"You know this restroom that's for boys/men? Only boys/men can use it. You know this bathroom that's for girls/women? It's only for girls/women\". So you think if women feel uncomfortable that a man that says \"Hey, I feel like a woman\" goes into a woman's locker room must hate LGBT people? Really? It's not the trans people I'm concerned about. It's the people POSING as trans people. Why should women be made to feel uncomfortable just so a man that thinks he's a woman can use the women's restroom/bathroom? Wanting people to use the bathroom of the sex they were BORN with (and actually STILL are, as science dictates) does NOT = hate.","post_message":"After nationwide outcry about North Carolina's harmful anti-LGBT law, Gov. McCrory said let's \"work on solutions that will make this bill better\" because NC is \"a state of inclusiveness, openness and diversity.\" Let’s make it clear - that means REPEAL HB2. Keep the pressure on. Add your name: @webpagelink"},{"comment_id":"10153030782377434","commenter_b":"Thank you. However, white women wear wigs and added hair too. 95% of them in hollyweird do.","commenter_a":"I think this is significant when many African American female celebrities wear wigs that look like Caucasian hair, because of our so-called standards of beauty. I think the natural look is much more attractive and empowering for girls who look to them as role models.","post_message":"“If you say you’re beautiful without hair and makeup, then they will believe you,\" Maria Borges said of the hairstyle she walked during the Victoria's Secret Fashion Show."},{"comment_id":"1044965742191103","commenter_b":"So lern ich ja vielleicht doch noch was Mathe 😂","commenter_a":"@username :D","post_message":"Original image by Cath Ennis"},{"comment_id":"10153689211286438","commenter_b":"Are uggos ugly women who like to hire pretty secretaries for pay raise kitty chow.","commenter_a":"Lesbians can rape just as easily as men.","post_message":"It’s time to stop pretending that only men perpetuate violence and women are only victims of it."}]
