[{"comment_id":"1085637111459772","commenter_b":"Y'all sound like a bunch of cheating mistresses!!!","commenter_a":"Here you go If you plan to vote for Ted Cruz, you MUST know these things! Educate yourselves on him and his wife * Heidi Cruz has been employed by Goldman Sachs since 2005. She is currently on leave. * Heidi Cruz is a member of the leftist council on foreign relations, advocates of world Government and a New World Order. * Ted Cruz was George Bush's top policy advisor. * Ted Cruz was in the federal Trade Commission. * Ted and Heidi met when they were both Bush staffers. * Cruz advised on legal affairs and Heidi on economic policy for the bush administration. * Heidi was director for the Western Hemisphere on the national security council under Condoleeza Rice. * Heidi served as deputy U.S. Trade Representative to USTR head, Robert Zoellick, working on China trade policy. * Ted Cruz' campaign chairman, Chad Sweet, is a former CIA ...","post_message":"The story the whole Internet is buzzing about..."},{"comment_id":"10154208108446717","commenter_b":"I want to punch that bitch in her ugly face","commenter_a":"Disgusting.....","post_message":"His sympathy is with the first responders, and not the victims."},{"comment_id":"10154994136091800","commenter_b":"He probably knee jerked so hard he got a bloody nose and blames it on picking it too much!","commenter_a":"Trevor Noah is a puppet... Go back to south Africa where division is welcome stop trying to divide my country with your shitty humor... #Bringbackstewart","post_message":"The Daily Show recaps President Trump’s flurry of executive orders."},{"comment_id":"10154684431129614","commenter_b":"They should both be arrested Alisa Perne. Neither acted like an adult should, that lesson never suck","commenter_a":"He wasn't acting like a man and she wasn't acting like a woman. He had no right to hit, but she kept provoking still not right. He could of called the police or walked away..both at fault, but he hit so physical violence on his part.","post_message":"Police are searching for a man seen punching a woman in the face in a disturbing surveillance video taken outside a store in Venice over the weekend. The victim apparently had seen the man at a festival in the city on Sunday but does not know him. The two bumped into each other again at the store and got into an argument before the man punched her. Bystanders tried to stop the man but he managed to escape and ran away from the scene. read KTLA's story here: @webpagelink"},{"comment_id":"907985779261171","commenter_b":"Wish she would cover up more. Less boobs and rear. Just sayin","commenter_a":"she is incredible and I am so happe for them","post_message":"One-armed shark attack survivor Bethany Hamilton surfs the waves at six months pregnant"},{"comment_id":"10153938173248967","commenter_b":"That girl a punk","commenter_a":"It's been crazy windy. Was hard to walk.","post_message":"What's that nickname for Chicago, Illinois, again? Stay safe, people"},{"comment_id":"1795597093801212","commenter_b":"But Hillary won the popular vote..at least you won something","commenter_a":"Hopefully they get deported","post_message":"BREAKING: A massive protest of President-Elect Donald Trump is happening in downtown Chicago. It started outside the Trump Tower and is growing @webpagelink"}]
