[{"comment_id":"10154692887376336","commenter_b":"Deplorable Californian here","commenter_a":"Ga.here","post_message":"Live Now: Donald J. Trump speaks in Columbus, Ohio."},{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"10153321006269087","commenter_b":"What fucking jobs are the illegal immigrants are taking dum ass?? Please fucking tell me!!!","commenter_a":"94 million Americans are not working. Is it because they have become dependent upon the government? Or is it because the Illegal immigrants have all the jobs? 30 percent of all federal prisoners are illegal immigrants. Immigrants are killing Americans: According to the Center for Immigration Studies, 57 percent of the 76 fugitive murderers wanted by the FBI in 2009 immigrants entering the country illegally have a criminal record in the U.S.: In 2010, the Border Patrol reported that 212,000 illegals were caught in the Tucson, Ariz., sector alone, and as many as 30 percent of them already had a criminal record in the U.S. The Pew Research Center estimated that there are nearly 12 million illegal aliens in the nation and the key word is 'estimated'. What's wrong with deportation of illegals? The answer is: nothing. The country would be greater without them.","post_message":"'The idea of tracking down and deporting 11 million people is absurd, inhumane, and un-American,' Hillary Clinton tweeted. 'No, Trump.'"},{"comment_id":"10153289786066491","commenter_b":"Here's the thing. You need to go # 1? You need to go # 2? Go to bathroom of your current sex. Drop the bomb, Cut loose, wipe clean, get out. That simple. Bathroom is not social grounds It's not grounds to dispute how you feel as gender. Do your business, in out less than 2 minutes..... WTF is wrong with the world today. Everyone wants to be special.","commenter_a":"Are we that far gone from reality that we want to make bathrooms for the trans in our society. Im sorry you were born as a boy or girl. How about you just stick with that while you are in public. Problem solved and no money spent on suppling a unneeded bathroom","post_message":"'Before the 5th grade, my classmates were able to accept and be friends with me.'"},{"comment_id":"1182572491799444","commenter_b":"Mj we are talking about the ones that come here and are here illegally. You became a marine and I bet you did it the right way. Now we have a big problem with terrorist that are sneaking into all the countries. Sorry but we have to take care of all Americans first. You have to admit a country can only hold so many. Thank you for your service I am a vet myself so are my son and daughter.","commenter_a":"All these racist comments and generalizations. You should all be ashamed. I am cuban and came to the US. Im sure not many of you can say the same but i actually benefitted from government programs. I served our countries military as a marine, i hold three different degrees - accounting, finance and im a registered nurse- sonif an immigrant is taking your jobs then you didnt take full advantage of what the US has to offer, no just arrived unprepared laborer will ever take any of thoae jobs from me. I love thia country but i hate people like you that put down immigranta that only want to make a better life for themselves and family. You are whats wrong with the US today!","post_message":"Right?"},{"comment_id":"908007962567959","commenter_b":"Look at that nasty excuse of a woman.","commenter_a":"That family is severely screwed up. Corrupt financially, politically, and morally! Any wonder why this society is so bad? No. Just pathetic. And they smile in the face of this country with absolutely zero remorse or accountability.","post_message":"GROSS!"},{"comment_id":"533111413538548","commenter_b":"This idiot already built a wall and call it over taxation, high gas prices, sanctuary cities.","commenter_a":"I'll help, maybe they will leave the union. Or better yet, fire their idiot governor.","post_message":"Liberal California Governor Jerry Brown: ‘If Trump Wins, we’ll build a wall around California’"}]
