[{"comment_id":"10155879050540354","commenter_b":"Stop these muslims from coming into our country. Please. Trojan horse.","commenter_a":"I can't wait to force them to bake my gay wedding cake.","post_message":"Some truly shocking statistics in this article..."},{"comment_id":"10155525709475603","commenter_b":"She is a scam artist and charlatan anyway.","commenter_a":"Ok now what about the big Joyce Meyer's Women's Conference that comes to St. Louis in Sept.? That's why I can't travel by myself down there. It's sad.","post_message":"Three people shot overnight including at 16-year-old boy. If you think you’re hearing more about crime this year in St. Louis, we have new statistics to prove it. Right now on News 4 This Morning, Laura Hettiger is breaking down all the violent crime we’ve seen so far in the first 4 months of the year."},{"comment_id":"10157202420850354","commenter_b":"Pause for now....put them in his house","commenter_a":"You MUST be on the 'take', Ryan!! YOU CRIMINAL PIECE OF SHT!!! Get him OUT of there!","post_message":"\"That's not who we are,\" said Paul Ryan."},{"comment_id":"1709971309289981","commenter_b":"How can you like these ignorant witches","commenter_a":"only reason l watch it, for Whoopee and Joy, still very good and stimulating\\\\","post_message":"The View just dug their own grave, FINALLY! Cancel this show now."},{"comment_id":"1791974164423219","commenter_b":"@username Mexico has a wall at the south boarder but yet it's all ok for them? They built it to keep the freeloaders out, but it's so wrong for America to do it? Sorry if you want to be over run with illegals go move to Mexico. Otherwise support YOUR COUNTRY FIRST!","commenter_a":"Difference Clinton isn't a racist all Hispanics rapist, murders and thieves. Name one nation that has put a wall to keep a bordering country out. If every country in Europe can their border without a wall so can we.","post_message":"Controlled immigration wasn't \"extreme\" 20 years ago and its not \"extreme\" today..."},{"comment_id":"960803304010619","commenter_b":"That is where it starts. Where does it end?","commenter_a":"For Gods sake, no one is trying to unlock your average Americans phone. They want to unlock the California couple, Christmas party killer terrorists, phone. And for good reason. To find other connections.","post_message":"JUST IN: Donald J. Trump is calling for a boycott of Apple until the company agrees to the government’s demands and unlocks the phone used by one of the San Bernardino terrorists. What do you think?"},{"comment_id":"784480358346621","commenter_b":"The whores knew what they went to Mr. Cosby room for money and sex. I say they didn't get pay they got laid .","commenter_a":"My lord there is a lot of racists here!","post_message":"We can only dream! Cheney masterminded a war based on lies to funnel $37 billion in no-bid contracts to his \"former\" defense contractor company, Halliburton. When will his time be up? Image by Occupy Democrats, LIKE our page for more!"}]
