[{"comment_id":"1146546865428217","commenter_b":"Melania doesn't even know where she is right now...","commenter_a":"Yep preparation H.","post_message":"Donald Trump and Hillary Clinton attend the Al Smith Dinner in New York"},{"comment_id":"10153291339743188","commenter_b":"Under our current president and democratic leaders the constitution is officially thrown out the window. Many thousands of illegal immigrants will be pushed to vote ending our two party system, Obama's ultimate goal.","commenter_a":"The more people taking hits at Killary before the election, the better! And likewise, she doesn't know who the Republican nominee will be. So all she can do is lie low until she knows who to go after.","post_message":"From Stu Burguiere: There are now 6 officially announced candidates for the 2016 GOP nomination, and there are a lot more coming. Are there any of these that you think probably WON'T run? RubioWalkerPaulBushHuckabeeCruzCarsonChristiePerryGrahamSantorumFiorina That super long run-on name is packed with 12(!) options, and doesn't include others like Jindal, Trump, Kasich etc, who might get in. On that note, it's time to refresh our monthly poll. You vote for each candidate by giving them a letter grade. Just remember not to vote on what you think is going to happen. Vote on what you want to happen. Results coming on the radio show Friday."},{"comment_id":"10153068896931323","commenter_b":"Real Women Have Pulses.","commenter_a":"All this \"Men like curves\" stuff is crap. Most men will fuck anything with a pulse.","post_message":"\"There is no better way to celebrate and show off than by donning a bikini. When the #CurvesinBikinis ad in Sports Illustrated is released, the world will be watching and they’ll like what they see.\""},{"comment_id":"10153708332298984","commenter_b":"Omg. Women bitching. Grow up","commenter_a":"i will always agree with Dana...............jan","post_message":"These woman got into a debate so intense, there was only one way for Megyn Kelly to cool them off... Do you agree with Dana Loesch?"},{"comment_id":"10153990315029062","commenter_b":"So sad.......where are the parents???","commenter_a":"Seriously? the kids are really that dumb/stupid......those grades are apalling......what did the students/teachers do from the start of the school year until now?","post_message":"Monroe demanded the HISD Superintendent Terry Grier immediately step down."},{"comment_id":"1168788129800109","commenter_b":"******TRUMP..... 2016 **** DESTROY ISLAM AMEN....pass the ammo \"SWIPER NO SWIPING\" *no illegals voting Quote..DORA THE EXPLORER *BLACK LIVES MuRDER ...jokes","commenter_a":"Lol She should have to wear a lie detector at all time....that zaps her when she fibbs","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"},{"comment_id":"10152980958545399","commenter_b":"This may help. My feelings as a Christian points me to my Lord and Savior as a fighter. It points me to the man who once in loneliness, surrounded only by a few followers, recognized these Jews for what they were and summoned men to fight against them and who, God's truth! was greatest not as a sufferer but as a fighter. In boundless love as a Christian and as a man I read through the passage which tells us how the Lord at last rose in His might and seized the scourge to drive out of the Temple the brood of vipers and adders. How terrific was His fight for the world against the Jewish poison. To-day, after two thousand years, with deepest emotion I recognize more profoundly than ever before in the fact that it was for this that He had to shed His blood upon the Cross. ...","commenter_a":"Just what was the religion of the people loading Jews into ovens in Europe?","post_message":"\"When you take Christianity, Judaism, Hinduism, Buddhism, whatever, their combined killings in the name of religion -- well that number would be zero.\""}]
