[{"comment_id":"1186888831331145","commenter_b":"Hold her in contempt and lock her up.","commenter_a":"What's next stone her.....","post_message":"Her act of resistance has rocked her small Appalachia community 60 miles east of Lexington and made headlines nationwide."},{"comment_id":"10152861965631130","commenter_b":"Is that the END OF YOUR BULLSHIT?? Nothing to do with illegal immigrants. Whooping Cough outbreaks happening ALL over the world. The bacteria is mutating in two ways: one strain of bacteria lacks the primary protein used in the vaccines; the other strain has new proteins. These are found in Europe, Japan and elsewhere @webpagelink","commenter_a":"Vaccines can force the bacteria to mutate, did you know that? 100,000 Americans have gotten whooping cough in the last three years. 32 babies have died. C.D.C. scientists speculate that the current vaccine may be helping to drive the bugs’ evolution. “The fact that this happened so quickly, to the proportions we’re seeing now, clearly suggests some selective pressures …. Vaccine pressure is probably one of them. @webpagelink","post_message":"\"I believe in trusting doctors, not know-it-alls.\""},{"comment_id":"534617120056639","commenter_b":"Mike Bassenti This is what they get for coming here !! We have to pay for this ! @webpagelink","commenter_a":"Big news is Trump is earning MAJOR support from segments of the population which almost exclusively vote for Democrats. SurveyUSA announced that Donald Trump would receive 25% among black registered voters. That is news that has Hillary Clinton terrified, and is shaking the political establishment to the core!","post_message":"I had an incredible time in Detroit yesterday. A great experience - learned a lot by listening to everyone. I am grateful for their support - and time. You can catch what I had to say to everyone, right here. Thank you! -DJT"},{"comment_id":"10154496006728689","commenter_b":"@username I guess you're right with your saying!!","commenter_a":"Many people are saying.....not me, but many people. They might be right. I haven't fully investigated it yet, so I don't know,, but from what I'm hearing from many people........Things, I've heard things. Lot's of things. Not so good things...many bad things,I don't know, but it's what I'm hearing lately, from many people. They could be right. And then what? These things I've heard, from many people. Could be trouble...We're in trouble, folks.","post_message":"WATCH: Donald J. Trump: If Hillary Clinton gets to pick her US Supreme Court judges, \"nothing you can do, folks — although the 2nd Amendment people, maybe there is. I don't know.\" Read full story: @webpagelink"},{"comment_id":"10153141733752293","commenter_b":"I think you all forget that even if abortion was illegal, it would still happen. Illegal abortions were horrible, many women died. And if you think that only poor women had them or only uneducated women had them, you are badly mistaken. They happened in every economic group. Abortion needs to be legal, safe and rare!!!","commenter_a":"Yay for more fake videos. Planned Parenthood is a great organization. These people trying to create fake and misleading videos are the real enemy.","post_message":"In the video, the group discusses a potential contract for fetal parts."},{"comment_id":"10152691243492217","commenter_b":"@username we're good at sports that don't matter","commenter_a":"Jason Mulford","post_message":"Watch out, Katniss Everdeen."},{"comment_id":"1828581784096492","commenter_b":"You can be my snowflake anytime brother❤ the majority","commenter_a":"Snowflake. Go ahead. You can call me a snowflake. I don’t mind. In fact, I kind of like it. A snowflake travels through the atmosphere molded by the climate and emerges as a distinct crystal. Shaped by its environment but maintaining a steady path to become grounded on this earth. I am not the only snowflake. There are 65 million of us and together we are a blizzard. A sustained storm enveloping everything it its path. Clearing the air and blanketing the earth in a fine powder. Covering over the dirt and the grime along with strong winds exposing corruption, bigotry, misogyny, nepotism & cronyism. 65 million snowflakes are an avalanche. Once triggered, we are unstoppable. Accelerating rapidly and gaining strength. Overcoming all resistance. Scouring the landscape and hauling away the detritus and the scum. Leaving no place for prejudice and hatred to gain a foothold. Tearing down walls and ...","post_message":"Robert de Niro just said it ALL about Trump! Video by Occupy Democrats, LIKE our page for more!"}]
