[{"comment_id":"10153238417336717","commenter_b":"Like regular hetero marriage is such a fountain of virtue. LOL","commenter_a":"What a nice slap in the face for marriage equality. They say they dont care what anyone thinks....I think they look like whores, when's number 4 coming?","post_message":"In case you missed it:"},{"comment_id":"476652309189729","commenter_b":"donnnnt wanna hear it..cant stand her...","commenter_a":"Someone should us duck tape over her lips. She takes the cake for the most disgraceful women in the White House ever","post_message":""},{"comment_id":"10154069182538128","commenter_b":"You're disgusting!","commenter_a":"Disgusting crap Chris Rock!!","post_message":"Chris Rock didn’t waste any time diving into the controversy over the lack of diversity at this year’s Academy Awards."},{"comment_id":"10153227857229330","commenter_b":"I'd do the same thing - little punk needs a good whipping from his mom","commenter_a":"There is one parent in Baltimore that has her priorities straight.","post_message":"Mom of the Year? Check out what a mom did when she caught her son out rioting in Baltimore. ---> @webpagelink What would you do?"},{"comment_id":"327851404005511","commenter_b":"Trump supported assault weapon ban","commenter_a":"And you guys don't have an enemies list? Apparently, Trump is at the top of your list. You really have to quit with the Hitler and Facist rhetoric. All that does is make me want to vote for Trump even more.","post_message":"Erick Erickson, you said it. Fascists and tyrants always have enemies lists."},{"comment_id":"10152781007061615","commenter_b":"Our veterans go without while lazy a**es and foreigners collect cash, food stamps and free medical. What's wrong with this picture??? VETERANS AND ALL MILITARY SHOULD COME FIRST! They put their lives on the line so the lazy idiots and illegals don't have to. WAKE UP AMERICA AND GET YOUR PRIORITIES STRAIGHT!!! Rant over.","commenter_a":"but it was OK that he put his life on the line for this country give the man what he deserves","post_message":"DENIED. An American hero, unable to collect his military benefits when he needed them most. WPXI Rick Earle gets help for this veteran. His story is coming up tonight at 5:45 p.m."},{"comment_id":"350626235140891","commenter_b":"She needs to be gone","commenter_a":"Then take Kenyatta West and get the hell out of the USA I think Iran would be a good place for you .","post_message":"Hip-Hop Artist Hates America, White Americans and Conservative People!"}]
