[{"comment_id":"10155240272548132","commenter_b":"@username go away","commenter_a":"4 beautiful and classy young women! All 4 parents should be proud!","post_message":"The Bush Sisters wrote a heartfelt letter to the Obama Girlsand it's really sweet. @webpagelink"},{"comment_id":"1205061579572376","commenter_b":"Christina @username you stupid c-unt you clearly can't read into my post. Go suck on Killerys nip..... Trump 2016","commenter_a":"For all of you who want to tell us it's a leased Eastern Airlines plane. Save it we got it and read it.....","post_message":"Barely 24 hours after Donald J. Trump accepted the GOP nomination for president, something incredible happened with his plane.  What Trump ordered for the plane has conservatives cheering and liberals pitching a hissy fit."},{"comment_id":"10153469800395671","commenter_b":"The fact she had felony DUI charges in the waiting... leads one to think she has done this more than once. \"...facing felony drunken driving charges and cruelty to a child stemming from a previous incident.\" I doubt that she was so unlucky that the one time she went drinking then driving, she got into an accident and was arrested for DUI. This is usually a pattern behavior.","commenter_a":"Your not innocent when you drive drunk, multiple times. Your a murderous person that cares less about others even your own children! Wake up !","post_message":"The woman who was driving a car that crashed and killed five people this past weekend was facing felony DUI charges and cruelty to a child stemming from a previous incident."},{"comment_id":"596965907173588","commenter_b":"They BORN there.need to FIX their OWN Country..DON'T COME MESSING UP 'OURS;~~","commenter_a":"Trump will make american tax payers build the wall not mexico","post_message":"Trump Better be Serious about Border Security Promises"},{"comment_id":"1050187868329829","commenter_b":"Die already you old prick !","commenter_a":"lol I see the libturd heads exploding in here! Deport them all!","post_message":"On the Texas immigration ruling: President Obama is well within his established Constitutional authority and the legal process will bear that out. The only effect of this ruling is to delay justice for thousands of families in Nevada and across the country. Governors, mayors and law enforcement officers have emphasized that these programs are good public policy, help our economy and keep our communities safe.  Courts are only involved in the first place because Republicans have spent years blocking Congress from fixing our broken immigration system. Congress should live up to its responsibility and pass an immigration bill that secures our borders, keeps families together and provides an earned path to citizenship.  There is nothing stopping the Senate from debating immigration legislation immediately. Unfortunately, the Senate is mired in a completely avoidable impasse over funding the Department of Homeland Security. Senate Democrats have a simple solution for getting out of this jam: take up and pass a clean bill to fund Homeland Security, then move on to a robust debate on immigration legislation.  Democrats’ offer to first fund Homeland Security and then debate immigration stands. All Republicans have to do is say yes."},{"comment_id":"528596753997571","commenter_b":"Yes the airline acted as they should have! If these people don't want to be put into ituations like this they should dress in such a way as not to bring question upon themselves. They should also understand the airlines concern where muslims are involved from prior experience. Personally, I think all illegals should be deported along with Obama!","commenter_a":"Yes. They've already proven they cannot b trusted","post_message":"These Muslims were thrown off the plane for this frightening reason.  It is always better to take necessary safety precautions.  Would you want them off your plane too?"},{"comment_id":"10153976487996130","commenter_b":"we are living in the country that has no national insurance and crazy people can have a gun. poor sick people will die without government help and crazy people can massacre a lot of people easily and at one time with a gun.","commenter_a":"Kasa","post_message":"Another mass shooting. Another national address by President Obama."}]
