[{"comment_id":"10154645130189062","commenter_b":"Woman should be lucky for not being arrested ,for interfering with \"police business \".","commenter_a":"So he was a really nice guy she said. But, let's post this to social media to ensure really nice guy loses his job instead of giving him the opportunity to learn from his mistakes.","post_message":"\"The reason I pulled you over today...I just want to know, what's the emergency?\" said the woman."},{"comment_id":"1595582267404994","commenter_b":"Where in the work would you ever get an idea like that???? You stupid woman!!!!","commenter_a":"This person is so ate up","post_message":"not too bright..."},{"comment_id":"10154874760616037","commenter_b":"He said he was deporting illegal CRIMINALS not all illegals.","commenter_a":"it would cause a shitstorm...seeing police officers pulling parents out of their homes while kid's look on crying...meanwhile it would be all over CNN...and the divide between people and officers would be even greater","post_message":"Officers are \"not going to engage in law enforcement activities solely based on somebody's immigration status.\""},{"comment_id":"1151019624929597","commenter_b":"Krissy L Gucciardo Nice mouth. Do you eat with that filthy mouth.","commenter_a":"I actually had a friend say she never sees him with his hand over his heart during the Pledge of Allegiance. I then supplied her with about 25 pics of different events, all with his hand over his heart. I told her google is her friend, and Fox news is not.","post_message":"\"What EXACTLY has Obama ruined in this country?!?!\"  Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153585954722994","commenter_b":"White people are the terrorist.....not Muslims","commenter_a":".","post_message":"After last week's attack in Tennessee, this man showed up at a military recruitment center with his AR-15 - but preventing another attack isn't why he did it."},{"comment_id":"10153171665732235","commenter_b":"LMAO!","commenter_a":"you know who else loves snow days? SATAN.","post_message":"Good grief."},{"comment_id":"10153506757381509","commenter_b":"Maybe the people voting on abortion laws should reconsider......","commenter_a":"She needs to be charged with murder.","post_message":"Dynel Lane, 34, has been charged with criminal attempt to commit murder in the first degree, unlawful termination of pregnancy, and seven other counts for allegedly cutting a fetus from a pregnant woman's womb. @webpagelink"}]
