[{"comment_id":"10153976625678162","commenter_b":"Zionists let jews die that didn't obey the transfer agreement","commenter_a":"Just shows how much the Zionists have in common with the Nazis. They killed defenceless people and celebrated the murderers. The fact 35,000 Israelis have signed a petition to get the IDF member a medal is astonishing. @webpagelink","post_message":"As a video recording of an Israeli soldier killing a wounded Palestinian in Hebron on Thursday emerged hours after the shooting Israeli government officials and civil society representatives were split in their responses. Some quickly moved to condemn the shooting, while an outspoken group of Israeli leaders applauded the soldier and circulated a counter-theory of self-defense and heroism."},{"comment_id":"10153913133146130","commenter_b":"Wtf is a \"puff hoe\"?","commenter_a":"I get all of my political advice from rich Hollywood actors, said no human ever. This just made another 100,000 people vote for trump,, keep it up puff hoe,, you're helping!","post_message":"Nailed it, Angelina Jolie."},{"comment_id":"10153907246193812","commenter_b":"I don't want them in California!! I don't want them in the United States. Send them all back with a rifle and ammunition to fight for their own country!!!","commenter_a":"But, but, refugees are not terrorists......","post_message":"JUST IN: Turkey arrests 8 suspected ISIS members who planned to travel to Germany posing as refugees, Turkish officials say."},{"comment_id":"1788072574740832","commenter_b":"jesus Christ those girls look petrified","commenter_a":"@username @username 😱😱","post_message":"Parents in remote parts of Malawi are sending their daughters to be sexually initiated by local men - called \"hyenas\" - when they reach puberty. Meet Eric, he’s proud of his role as a \"hyena\". Learn more from BBC News Magazine: @webpagelink Listen to the documentary: @webpagelink"},{"comment_id":"10153518818316162","commenter_b":"Well, some women are just total knockouts....","commenter_a":"Women injured and pride parade. The pride parade should be banned!","post_message":"A 25-year-old woman was knocked out when a drone struck her in the head during the pride parade @webpagelink"},{"comment_id":"1183772531660175","commenter_b":"However, he will be a much better President for the nation then fumbling Obama. Rather have competent than classy.","commenter_a":"I agree","post_message":"AMEN."},{"comment_id":"10153124356001336","commenter_b":"IDIOTS PUT IDIOTS IN OUR WHITEHOUSE!!!","commenter_a":"It is not up to obama it is supposed to be congress and senate this is illegal","post_message":"\"Please just give this soldier the dignity of life! We give it to these guys down in Gitmo!\" Montel Williams questioned how Amir Hekmati, a Marine held in Iran's worst prison, is still in captivity while the Obama administration makes a deal with Iran. #FreeAmirNow"}]
