[{"comment_id":"10153155824991770","commenter_b":"My all time favorite woman. Great leader, strong, respected. Leader@","commenter_a":"Certainly an Iron Lady! Lest you forget she helped cover-up atrocities committed to the Irish people in the occupied 6 counties. Allowed 10 hunger strikers to die and was forced out of office. Thatcher came under intense pressure from Ronald Reagan to avoid a military response from the Falkland Islands.","post_message":"Margaret Thatcher has been voted the most influential woman of the last 200 years in a recent poll."},{"comment_id":"10153645551275575","commenter_b":"Who cares about Mexican officials ? Why don't they keep their people there in Mexico ?","commenter_a":"I STAND WITH TRUMP!!!","post_message":"Sounds like a good idea!"},{"comment_id":"10154001679275927","commenter_b":"Every time she opens her mouth out comes more drivel!","commenter_a":"She owns a vineyard in California, I think she personally does all the wine tasting herself!","post_message":"WATCH-- President Clinton, as well as President Obama, we operating on a pay-as-you-go basis ...\""},{"comment_id":"1603960996557680","commenter_b":"Deport her","commenter_a":"Racist pig!","post_message":"Ridiculous...  Take Oprah Winfrey off TV right now."},{"comment_id":"10154654748316320","commenter_b":"What barbarians","commenter_a":"Savages","post_message":"SHOCKING:  Video posted on social media during demonstrations Wednesday night in Charlotte appears to show a group of protesters beating up a man and stripping him of his clothes as he begs for mercy.  @webpagelink"},{"comment_id":"1006387419398598","commenter_b":"Go away upchuckie!","commenter_a":"Where do these NUTS come from? Is there some unknown idiot tree orchard somewhere in the U.S.?","post_message":"\"Schumer’s proposed anti-gun plan takes government “overreaching” to a whole new level.\"  Blaze contributor Susan Calloway Knowles:"},{"comment_id":"1014939015229294","commenter_b":"Then stop importing Muslims.","commenter_a":"Brought to you by liberal idiots like Billary and Obummer: @webpagelink","post_message":"All our prayers are with the people of France. We must stand side by side every step of the way with France and our allies around the world to wage and win the struggle against terrorism and violent extremism.   Even after this darkest night, Paris remains the City of Light. No terrorist attack will ever dim the spirit of the French people or our common commitment to the democratic values we share."}]
