[{"comment_id":"489237724600141","commenter_b":"Fuck that dumb wench","commenter_a":"How about if you criticize a Catholic, a Jew or any Christian. What hell makes Muslims so special?","post_message":"Hillary Clinton is attempting to make it punishable by law to criticize Islam.  She just crossed the line. We can put a stop to this, let's end this right now.  Can we get 20,000 'LIKES' for freedom of speech?"},{"comment_id":"10153396046867452","commenter_b":"what if they didn't do it... cut it off anyway????????????????","commenter_a":"Thats the best freaken law ever. Pass it nation wide","post_message":"\"They have marked this child for life, and the punishment should fit the crime.\"  If an Alabama lawmaker gets his way, part of the punishment for people who commit sex crimes against children will be castration."},{"comment_id":"10153860707103812","commenter_b":"@username So she should just be allowed to sit there and disobey?","commenter_a":"Guess you should do what your told instead of thinking your above the law because your a minor. This should happen more often. It is no wonder law enforcement is backing down because everytime they do thier job they get ridiculed.","post_message":"WATCH: Video shows uniformed deputy grab a female high school student and wrestle her out of the seat and to the ground. @webpagelink"},{"comment_id":"854169234726517","commenter_b":"How about rapist?","commenter_a":"If trump is despicable, what does that make Hillary ?","post_message":"\"He’s just despicable,\" Letterman said, adding that Donald J. Trump may very well prove the saying that \"anyone can grow up to be president.\""},{"comment_id":"10153279358959087","commenter_b":"You're a stupid bitch","commenter_a":"Democrats have become the party that endorses Corrupt Liars. Next time a Democrat points a finger at Republicans they should point 5 back at themselves first.","post_message":"Nearly twice as many Americans say they are unsatisfied with Hillary Clinton’s response to the 2012 attacks in Benghazi as say they are satisfied, according to a new NBC News/Wall Street Journal poll released today."},{"comment_id":"10154292449213525","commenter_b":"She didn't sleep with babe in bed purposefully by the sounds of it... She fell asleep. Big difference in that one is purposeful, one is accidental. New moms are exhausted.","commenter_a":"So sad..so dangerous. I had my baby in his crib until he was 1","post_message":"\"Do not co-sleep with an infant,\" Sheriff Grady Judd insists.  \"Co-sleeping with infants is just an absolute no.\"  His deputies have arrested a Winter Haven woman after they say her \"horrific negligence\" while co-sleeping with her newborn baby led to his death -- for a second time: @webpagelink"},{"comment_id":"10152944650032894","commenter_b":"Bitch suck a dick and eat shit with you shit faced ass @username","commenter_a":"Whet? 😕","post_message":"Caitlyn Jenner is Already in Talks to Become the New Face of MAC Cosmetics"}]
