[{"comment_id":"620543131446096","commenter_b":"She's a LIAR!!!!!","commenter_a":"So, she's going to declare bankruptcy and drop out of the presidential race???","post_message":"Wow. I don't think she thought this one through... Do you think a Hillary Clinton presidency would be terrible for America?"},{"comment_id":"1041909399153863","commenter_b":"Craig your brain isn't fully developed until you're in your 20's. Please just shut up.","commenter_a":"GOOD!...i hope she get life in prison...she killed a human being , not just a blob of cells....after 20 weeks the baby has feelings when touched...full lungs , full body parts , a full brain...it was murder plain and simple....why would ANY WOMAN wait sooo long to decide to kill her baby???","post_message":"The criminalization of pregnancy continues"},{"comment_id":"10157043455730206","commenter_b":"May God keep you stronger, Celine","commenter_a":"So sorry for your loss!","post_message":"Celine's brother Daniel had been battling cancer of the the throat, tongue and brain."},{"comment_id":"197882667406213","commenter_b":"Get fucked cunts","commenter_a":"No regard for life! !!!!","post_message":"SICK & WRONG: Slaughterhouse worker caught on tape dancing with body of a freshly killed pig :( The other workers just laugh. #Reasons2GoVegan"},{"comment_id":"10153647988748145","commenter_b":"She should have hit their dumb a$$es with it. Now run tell that","commenter_a":"WTH?","post_message":"After 40 minutes of trying to convince the security team that removing the prosthetic wasn't necessary, the woman was led to a private room where she was asked to remove her pants and take off her leg."},{"comment_id":"10153315079826680","commenter_b":"Women are voting for her because she's the most qualified and she's been speaking up for us her whole political career. Not because we're shamed or bullied into it.#Imwithher","commenter_a":"And join her in hell","post_message":"POLITICO's Roger Simon says: It's a strange world when women are being shamed into voting for Clinton."},{"comment_id":"970236133016859","commenter_b":"Dumber than dumb. She thinks she is a republican because...?","commenter_a":"I'll bet dollars to donuts that she'll still vote republican in the next election. Dimwits gotta be dim......","post_message":"To save Obamacare, we need many, many more people like Erin to come forth."}]
