[{"comment_id":"10154312935051337","commenter_b":"All i can say is wow! I mean since Bran can use his powers to enter into a body does that mean he will eventually enter into the white walkers body an control him by pushing out what was put in now that would be awesome.","commenter_a":"That was by far the saddest moment of this show! Rip hodor/direwolf.","post_message":"OH. MY. GOD. Craziest Game of Thrones yet?"},{"comment_id":"10154343066022507","commenter_b":"'@username But they were to be submissive to white brutes if married to them. And she was married to a white brute. Her lies did not influence either Till's murder or the trial's outcome.","commenter_a":"People are quick to point out how different things were back then for blacks but don't forget how different they were for women, especially in the Deep South. What she did was horrendous, don't get me wrong, but I have no doubt that she feared for her own life. She was married to a man that could commit that kind of a crime. The article said that she was hidden away around the time of the trial with HER HUSBAND'S FAMILY. Don't you think she was threatened by them? I have no doubt of it. Being a women, even a white woman, was only marginally better than being black down there at that time. She will answer to God but, have no doubt, she has had to live with the knowledge of what she's done and had reminders along the way of what that entailed with reminders in her own ...","post_message":"60 years after this poor boy was brutally murdered, she finally admits the truth?"},{"comment_id":"793441997371016","commenter_b":"If they don't want to be detained. The scum should not steal. We pay for that! We need to get tougher on criminals","commenter_a":"Don't break the LAW!!! Then resist as well! Quit sticking up for criminals. This lady is an idiot to begin with don't do the crime. Choices... Make the right ones or like anyone else suffer the consequences from your choices. Maybe crime will go down if we actually don't try to protect the criminals and support our police forces. Remember enforcing the Law is for our safety. So for all you law breakers don't break the law if you don't want to take the risk of suffering the consequences.","post_message":"RAW VIDEO: A shopper claims she caught security guards at a Chandler Walmart putting a suspected shoplifter in a chokehold.  She took the video below on her cell phone. You can hear the woman shouting 'I can't breathe. I can't breathe.' She then appears to be passed out on the ground.   Do you think security was too rough, or just doing their job?  FULL STORY: @webpagelink"},{"comment_id":"10153688042296028","commenter_b":"No way!! Frankie","commenter_a":"He not dead tf","post_message":"Update: Prince's publicist confirms that the pop superstar has died.  A death is being investigated at the Minnesota property of singer Prince. The identity of the person has not been released. @webpagelink"},{"comment_id":"10153937424304205","commenter_b":"This is why rape is so prevalent these days","commenter_a":"Every kids goes to thier mom in utah for this like this. Go spend a few years here then bitch about utah. Your making fun of thier Mormon culture... Look I've grown up in utah and I don't disagree that it's ridiculous. But your making fun of thier religion.","post_message":"A Utah high school student was having what he believed to be impure thoughts toward his female classmates when they wore their cheerleader uniforms in class."},{"comment_id":"558362490993134","commenter_b":"Why is it we are so intent to run our country into the ground?? Follow Trump, and mark my words, there will be a WWIII, and everyone will be pointing their guns here. We will have no allies as he will insult them all. Wake up, America.","commenter_a":"'I will not forget.' What in the hell do that suppose to mean?","post_message":"Do you agree with Donald J. Trump's tweet?"},{"comment_id":"10153204698059712","commenter_b":"It looks like the New Anti Gun Laws are working for the Criminals. It's taking Guns out of the hands of the Law Abiding Citizen and putting them in the hands if the Criminals because Criminals Don't Follow the Law. Good Job Liberals for putting Maryland back at #1 for Murders.","commenter_a":"Violence in Baltimore, gee would neva had thunk that!!","post_message":"Baltimore has had 54 homicides in 2015 — 8 more than at this time last year. Nonfatal shootings are also up 40%."}]
