[{"comment_id":"10153170586384255","commenter_b":"Yay!! We already have enough leaking pipelines crisscrossing America...","commenter_a":"Eight treacherous Democrats. They should have to fight for their seat sin primaries.","post_message":"As expected."},{"comment_id":"975573942535660","commenter_b":"I'm not American but,I live here and I love to live here!And Hope to be in army or something one day I think dems are so much smarter! Let's go dems!","commenter_a":"brain dead","post_message":"RIGHT ON! Bernie just hit it out of the park at the Democratic debate when asked if he's a capitalist."},{"comment_id":"867088560054064","commenter_b":"A SMART WOMAN....not that stupid one!","commenter_a":"Ann Coulter","post_message":"There’s a growing movement to have a female hero replace Andrew Jackson on the $20 bill."},{"comment_id":"891336577589705","commenter_b":"Americans, protect your selves!","commenter_a":"Thanks Obama","post_message":"Click to see these alarming new numbers..."},{"comment_id":"1041013112628492","commenter_b":"COUGH ON ALL YOUR LIES BITCH! THE WRATH OF THE LORD IS COMING FOR HER!","commenter_a":"Is she still alive? Damm she is","post_message":"Well this was just revolting. Clinton cannot stop coughing during speech."},{"comment_id":"911884798904575","commenter_b":"\"I guess if you favor the right, the debt will grow, more jobs will be lost\" - The current President who is on the left raised the debt more than every other President combined. You acknowledge that there can be different factions on the left but not right apparently as well. If your main concern is the debt then you should lean more conservative as the primary goal is financial stability. Bush was not a conservative btw, he was more liberal. The main difference in policy between Obama and Bush (and possibly both parties in general atm) is \"what\" they wanted to spend money on but they both want to spend as much as they can get away with. I also do not accept your copy and pasted answer to Octavio's question. A definition doesn't tell anything. He's asking where you see the differences. It's also dishonest to call America ...","commenter_a":"Socialism works, as designed by the Founding Fathers, all of whom were socialists.","post_message":"Republican liar: 1 Bill Maher: Infinity"},{"comment_id":"474902102708278","commenter_b":"Suck a dick cnn","commenter_a":"The Dallas Police Officers were not killed by BLM members, but by an ex military man who was involved with ISIS! Pay attention!!! So much hate in this state. Disgusting. Thankful for the police protection here and their professional attitude. Stay safe all !","post_message":"We're in Phoenix, Arizona, where residents have gathered at City Hall to protest police violence and the recent shootings in Minnesota and Louisiana. (Source: CBS 5 AZ - KPHO/KTVK)"}]
