[{"comment_id":"10153464006023132","commenter_b":"IAN!!!!! Noooooo!!! We had plans to run away! Well, I did anyway! Oh well, Nikki rocks so that's cool!!!","commenter_a":"@username @username I am so sorry to hear of your loss!!! ;-)","post_message":"Nikki Reed and Ian Somerhalder aren't the only ones."},{"comment_id":"1563692830591111","commenter_b":"@username We don't need to build a wall... we need to make all employers use E2Verify, get our Congress to quit allowing corporations to import H1b and H2b workers... Then move military bases from sanctuary cities and put them along the border...use the open spaces for war practice and bombing ranges to collapse the tunnels.","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, preserve the sanctity of the unborn life, preserve the sanctity of the 2nd amendment ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness","post_message":"We cannot pretend the problem does does not exist. We need to build the wall- in order to make America safe now-- and for future generations!"},{"comment_id":"1394356603915019","commenter_b":"Odds Hillary Won Without Widespread Fraud: 1 in 77 Billion Says Berkeley, Stanford Studies After applying various statistical models to subsets of 2016 primary voting data several academic researchers conclude Hillary Clinton win was only possible through widespread vote fraud.","commenter_a":"#HillaryDNCRiggingCrooks","post_message":"It turns out that Bernie Sanders may not fight all the way to Philadelphia after all."},{"comment_id":"10152587064680667","commenter_b":"Yes because white girls don't fight!","commenter_a":"maybe they should stop fighting #worldstar","post_message":"\"Like white girls, they face gender stereotypes. Like black boys, they face racial stereotypes.\""},{"comment_id":"1751693101711200","commenter_b":"Who is this women?...wait nevermind. I don't care!","commenter_a":"Everything we say anymore is considered to be racist","post_message":"Blake Lively is being accused of racism after using a famous line from Sir Mix-a-Lot’s 1992 song “Baby Got Back (I Like Big Butts)” to describe her assets."},{"comment_id":"10153724288582577","commenter_b":"Your wife is ugly.","commenter_a":"Fuck you Zuckerberg. I'm gonna blast Facebook non stop u faggot piece of shit","post_message":"Facebook CEO Mark Zuckerberg was caught discussing the censorship of anti-migrant posts at the United Nations development summit Saturday while speaking with German Chancellor Angela Merkel."},{"comment_id":"10153517218270329","commenter_b":"Yes, we do want what we can't have. Love what you have (unless you hate your big boobs. Then know there are ways to help a girl out).","commenter_a":"Having big boobs is a nightmare. I would never ever ever want big boobs again EVER!!!! Ladies with small ones have no clue what it is like and should stop pretending like they have the same issues. It is patronizing to women that really do suffer. And men, shut it because your opinion is not important when it comes to living with the issues that come with big boobs. OK, so have a great day everyone :))","post_message":"Hey there, boob sweat."}]
