[{"comment_id":"385075118347449","commenter_b":"She's not worth two cents the skank","commenter_a":"How about we take oboma's pay to pay for this.","post_message":"This is CRAZY..."},{"comment_id":"10153980841689062","commenter_b":"Good glad yall didn't. One thing you can't replace is a life/lives. Hopefully everyone understands","commenter_a":"@username did u still go to Houston","post_message":"Hail is coming down with heavy rainfall off Beltway 8 and Antoine as heavy storms begin to move into the area. Stay safe out there!  Radars: @webpagelink Share your pics/videos: photos@khou.com."},{"comment_id":"1769361876675571","commenter_b":"Chinguen su puta madre ,al igual sigana trump nos seguiremos pasando i cruzando la frontera ,pongan ipongan sercas siempre los burlaremos 100% mexicanos gustele aquien leguste somos los #1 .","commenter_a":"Nice honest, rich family.","post_message":"In an impassioned speech, Eric Trump called on Americans to \"vote for the candidate who can’t be bought, sold, purchased, bribed, coerced, intimidated or steered from the path that is right and just and true!\" @webpagelink"},{"comment_id":"579381068889728","commenter_b":"BUILD THAT WALL AROUND TRUMP","commenter_a":"#BUILDTHATWALL","post_message":"Donald J. Trump joins supporters in chanting, \"Build that wall!\""},{"comment_id":"10154796309533010","commenter_b":"She always plays the race card","commenter_a":"If Donald wins When he goes to court for trump university fraud and is convicted. Its a criminal act. And impeachment process can began","post_message":"Like Al Gore, Clinton may be on track to still earn more votes across the country."},{"comment_id":"1902414739981573","commenter_b":"Do these woman have any idea how stupid they are?","commenter_a":"How stupid","post_message":"Whoopi Goldberg: Right to Celebrate Christmas is the Same as a “Woman’s Right” to Abortion"},{"comment_id":"1554742308153991","commenter_b":"IM A WOMAN...A STRONG WOMAN...AND I SAY TRUMP 2016!!!!!!!!!!!!!!!!!","commenter_a":"Classless joker","post_message":"What do you think about President Barack Obama's statements regarding Republican women and Donald J. Trump?"}]
