[{"comment_id":"835165216569680","commenter_b":"Don't accept it. Doesn't matter to me. I still have the right to marry...whether you like it or not.","commenter_a":"We Christians do not recognize this, not accept this, just ignore this. Just because MAN says it does NOT mean it is true. God is our Commander, Lord and Leader. Whatever He has stated is so; with His statutes we will stand, and believe Him forever. Look up everyone, for our redemption draweth nigh. . .","post_message":"So much for state rights. Where do we go from here? #SCOTUSmarriage"},{"comment_id":"10153706263011336","commenter_b":"Who cares.. She's an old dried up prune!","commenter_a":"Oh dear... Am I surprised or what? NOT!!! :)","post_message":"BREAKING NEWS: After declining to state her position for years, Democratic presidential candidate Hillary Clinton says she opposes the Keystone XL oil pipeline."},{"comment_id":"10156482909420354","commenter_b":"Take your hijab and stick it where the sun does not shine.","commenter_a":"How about a \"dress American day\" for the Muslims? I thought not.","post_message":"Wear-a-Hijab-for-a-Day Events at Universities!"},{"comment_id":"10157445323790093","commenter_b":"Because they wanna control things...U know the hands on your mind effect","commenter_a":"REMEMBER THE REPUBLICANS WARN US ABOUT AFFORDABLE HEALTH PLAN.","post_message":"Thanks Obamacare."},{"comment_id":"10152739973466519","commenter_b":"The Democrats are the snakes. Here come the eagles.","commenter_a":"At least the Republicans are growing a spine and starting to stand up to the Democrats properly rather than just whining about impeaching Obama.","post_message":"It took long enough, but here's how Obama realized that playing nice with Republicans is a sucker's game..."},{"comment_id":"10155033056251350","commenter_b":"you alice are the lame one.... bet u r fun at parties....not!","commenter_a":"how can americans put the flynn event in context. flinn's entry into the trump power structure was vigorously opposed from the beginning: one might even consider his a marked man. part 2: media has propogated trump's comments on intelligence agencies extensively. so one could ask the question how does the leak on flynn occur in the first place: NSA surveillance or other. it would appear a US intelligence agency leaked to the anti trump news media:))) could one consider that a direct attack on this nation to influence American government: yes. trump must drain the swamp in the intelligence community now. the entire establishment apparatus that supported the status quo is now actively working against change middle class voted for: start the purge. there is an outlier that must be considered: Israel. trump is surrounded by Israel firsters. was flynn one of those or was he an American firster. did ...","post_message":"On this Valentine Day, watch George H.W. and Barbara Bush share their touching love letters on TODAY in 2011 (and try not to cry!) @webpagelink"},{"comment_id":"10154437809561491","commenter_b":"Sorry, no. She is front and centre in this kangaroo court of #45. She cannot have it both ways.","commenter_a":"Let the woman live her life. Sure, I cannot stand Donald Trump to save my life. But what is going to set us apart him? We do not judge people based off of the behavior of someone else. That's what being a liberal is all about. Acceptance of each and every person on the basis of their individual character.","post_message":"The Internet is not happy with the latest post by Ivanka Trump's brand."}]
