[{"comment_id":"10153682330001037","commenter_b":"She's nuts.","commenter_a":"Just sad","post_message":"“I honestly regret what I have done and take responsibility for it,\" wrote Petra Laszlo in a letter to a Hungarian newspaper."},{"comment_id":"218545795283614","commenter_b":"Children in poor areas should not be doomed to poor schools.","commenter_a":"Yes, The GOP has lost every bit of self-respect they ever had. To vote Betsy DeVos in as education secretary with no educational experience is just irrational. If Betsy were smart she would decline the office and get the hell out of town now. She will not survive as educational secretary.","post_message":"Republicans just sold our public schools to the highest bidder.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153530234038854","commenter_b":"We knew this was coming, all part of the homosexual agenda.","commenter_a":"By Law, Churches are automatically Tax Exempt, so there's no need for them to have an IRS 501C-3 status. If you don't believe it, I suggest you research it.","post_message":"This is going to get ugly… Obama’s Lawyer To Supreme Court: Religious Institutions May Lose Their Tax-Exempt Status If They Don’t Back Gay Marriage…"},{"comment_id":"1012961912156618","commenter_b":"I would give my share to put there asses on a boat and send the ass holes somewhere else","commenter_a":"Big mouth and no brains. This is what Obama has done for this country. What a disappointment.","post_message":"\"Pay me consistently, provide me safe housing, offer me a job with benefits, run me those Beyonce tickets\" She must have lost her mind, if she thinks we are going to pay her anything. Will you pay for this entitled BLM organizer to go to a Beyonce concert?"},{"comment_id":"10154288676688445","commenter_b":"Ding Dong: who's there? Your local sheriff lol","commenter_a":"Throw them in the fireplace and share the lovely smell with the whole neighborhood!","post_message":"Grow Q&A: What Can I Do With The Pot Leaves I Trimmed Off?"},{"comment_id":"10153257305683445","commenter_b":"The irony in your statement, it's because of the illegal immigrants that America discovered weed","commenter_a":"So what if be had 'pounds' across state lines..!? Life for sh*t like that when, let's see, all the illegal immigrants get to roam free and even if they do get busted they will never see life behind bars..! Our drug laws for marijuana need to change.","post_message":"HUGE News! Marijuana Lifer Jeff Mizanskey Gets Parole."},{"comment_id":"10152858304201336","commenter_b":"Enough is enough time to start locking these mothers up. They think they can just take over everything","commenter_a":"Man why doesn't this stuff happen in areas I'm in? I would never try to shout these people down. I'm going to physically knock them down. I simply cannot stand, nor will tolerate, this level of open disrespect. You have a right to protest, my right to protest in return is my choice, by the means I choose necessary.","post_message":"The protesters did not stop shouting until 100-year-old U.S. Navy vet Dario Raschio spoke up and said, \"Give me a chance. At least let us show a little respect for this occasion.\""}]
