[{"comment_id":"645397708975441","commenter_b":"Wow, does he have any world facts available to him?","commenter_a":"My 15 year old answered the question","post_message":"This is just laughable."},{"comment_id":"10152817676244877","commenter_b":"Wonderful woman","commenter_a":"RIP Queen of Gospel Music.","post_message":"ON THIS DAY IN HISTORY: On January 27 1972, The Queen of Gospel, Mahalia Jackson passed away at age 60. She became one of the most influential gospel singers in the world and was heralded internationally as a singer and civil rights activist. LIKE and SHARE to remember the Queen of Gospel!! >>@webpagelink"},{"comment_id":"867346193401426","commenter_b":"US American’s must again flush ALL these scurvy republiCon knaves from the once sacred halls of our Government…just like our Grandparents HAD to TAKE BACK AMERICA 86 years ago. CLEAN THE LATRINE…IN 2016! VOTE BLUE","commenter_a":"I can only assume God had a long talk with him last night ,or someone hit him over the head with a two by four.I hope it was God those two by fours realy hurt.","post_message":"Even a broken clock is right twice a day. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154169606919160","commenter_b":"She set the standard in lying. And is great avoiding prison","commenter_a":"Madam President Hillary Rodham Clinton: Hillary has always put up a fight for the everyone! Hillary Clinton's contributions to American society as a woman are many, but the overall theme of her efforts is that she has continued to stay involved in the great issues of her time, despite setbacks and criticism of her actions. Throughout her life, she has been a strong advocate for women, children and families. In 1988 and 1991 she was listed as one of the 100 most influential Lawyers in America by the National Law Journal. As a Senator she sponsored such measures as: (1) The Best Pharmaceuticals for Children Act, to ensure the safety of prescription drugs for children; (2) She worked to increase provisions in the Children's Health Insurance Program to help schools address environmental hazards; and (3) She introduced legislation to help recruit and retain nurses to fight AIDS and to expand ...","post_message":"Hillary Clinton's numbers fall in liberal California."},{"comment_id":"1303998932977651","commenter_b":"Your a straight up pussy for that one. News flash dumbass your girls a ho","commenter_a":"A \"real nigga\" dont sneak shit..look like he aint wake dude up till bout the 5th punch..weak shit 😂😂","post_message":"He beat his a$$! #WSHH"},{"comment_id":"10154009579409255","commenter_b":"It's an intense embarrassment for us here in Nevada. It's what happens when rational people don't vote in the midterm elections.","commenter_a":"Nevada? How about every other state in this country?! 😕","post_message":"How in the world are these people getting elected to office in Nevada?"},{"comment_id":"10154826794495673","commenter_b":"@username is the picture of white privilege. Southern white belle. She was raised that way. She can't help it that she was taught to not think for herself and be afraid of being touched by a black person.","commenter_a":"HELL NO!!! This black racist woman is a poor excuse as a human being, she would only use and abuse the American people just as her failure of a husband did. No more Obama's or Clinton's should be allowed near The White House!!","post_message":"Do you think Michelle Obama could make a good president some day?"}]
