[{"comment_id":"10153902979083812","commenter_b":"Then please answer the dreams of the other 49 states and build that wall around Texas and secede.","commenter_a":"Texas? Secede already will you?","post_message":"JUST IN: Texas Governor Greg Abbott joins the governors of Alabama and Michigan in saying his state will not accept any Syrian refugees in the wake of #ParisAttacks. @webpagelink"},{"comment_id":"870555189755929","commenter_b":"Fuck that! Teach those fucks the appropriate way to interact with us.","commenter_a":"POLICE=Political.Oppressors.Lynching.Innocent,Citizens.Everywhere.","post_message":"Thoughts?"},{"comment_id":"1763482420575354","commenter_b":"@username your savor is going back on his own immigration stance. He was so bold at first, but now he's retreating lol. #typicalChump","commenter_a":"\"Today in his Mexico press conference, Donald Trump lied about discussing how to pay for his wall with the Mexican president. Trump has boasted for months that he is going to get Mexico to pay for his ridiculous wall but when he came face to face with the Mexican president he got out maneuvered and then tried to cover it up on worldwide TV. Simply put, Donald got rolled. It turns out Trump didn just choke, he got beat in the room and lied about it.\"","post_message":"Hillary Clinton didn't go to Louisiana, and now she didn't go to Mexico. She doesn't have the drive or stamina to MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10152686509170950","commenter_b":"Inbreds","commenter_a":"James Carville writes, \"There was nothing in the law that prohibited Secretary Clinton from using her personal email to conduct business as long as those emails were preserved, which they were. She preserved them and turned over all of them that had to do with State Department business -- 55,000 pages of them. But that's not enough for the right wing, who will continue to obsess over this issue until they find a new one. Let's watch the Clinton Rule in effect: Colin Powell and Jeb Bush also used their personal email, but they are held to a different standard in the press. Colin Powell admitted on ABC's This Week on Sunday that not only did he also use his personal email while secretary of state, but that he didn't preserve them or turn any of them over to the State Department as requested. Everyone went wild when they heard ...","post_message":"An archives expert tells \"Time\" that Hillary Rodham Clinton's methods for determining which emails to hand over to the government \"did not meet best practices.\""},{"comment_id":"10153069431726045","commenter_b":"Don't run pretty girls. You're just gonna trip over that invisible tree branch and fall at his feet.","commenter_a":"90model gold marque mercury. Missing a hub cap. Asking anyone know the CAR...not the man.","post_message":"Huntsville Police hope you can recognize the car this man drove when he robbed the PNC Bank at 1470 Perimeter Parkway Wednesday afternoon."},{"comment_id":"10154830329021830","commenter_b":"wow what shit if a celb said something worth hearing then ok fine but most are just fucked up losers that cry for attention","commenter_a":"Anthony Turner","post_message":"Ashton Kutcher Helps Reiterate Why Tomi Lahren & Co Are Full Of Shit"},{"comment_id":"633906553463617","commenter_b":"Bitch got booooooom roasted!","commenter_a":"Gladys Bernieeeee","post_message":"Bernie Sanders: \"Do you think that if your family had not made hundreds of millions of dollars of contributions to the Republican Party, that you would be sitting here today?\""}]
