[{"comment_id":"1754805464735210","commenter_b":"You are a dumb whore","commenter_a":"I don't know if she's the MOST qualified (Al Gore), but she's way more qualified than the joke running on the Republican side.","post_message":"Obama: Hillary Clinton is the most qualified presidential candidate in history Just weeks after pledging his support for Hillary Clinton President Barack Obama has said the former Secretary of State is the best possible candidate ever for the White House. Do you agree?"},{"comment_id":"541079112748211","commenter_b":"Well then lady's better take another look at HiLAIRy nothing respectable there","commenter_a":"Both Hillary & Donald Trumpet don't belong as our President! Trumpet definetely can't be our President. He's full of so much anger & rage! Lord help us all! And, with Hillary, we risk open borders & even bigger issues with illegal immigrants! Our poor country doesn't stand a chance with either candidates! I don't trust either candidates!","post_message":"WATCH: Undecided voters describe Donald J. Trump and Hillary Clinton's debate performance in one word. #FoxNews2016 #Debates2016 How would you describe their performances? @webpagelink"},{"comment_id":"10154078689087894","commenter_b":"Smh! I find it hard for woman to think they can touch people and think its ok. Everybody don't like to be touched. Yes his a artist performing, not for you to be there grabbing all on his or her clothes just to say \"Oh I grabbed his pants\"!! Sit back and enjoy the show....without touching me!","commenter_a":"Oh please he didn't take his foot and shoved it down her throat! He tapped that girl with the top of his shoe. And because he's a big dude it look harder then what it probably was. She still stay at the show, so she must wasnt hurt that much! 6months is ridiculous!!!","post_message":"Kevin Gates Sentenced to Six Months in Jail for Kicking Female Fan [Video]"},{"comment_id":"10154099164360329","commenter_b":"DREAM HUBS","commenter_a":"@username your future hubby","post_message":"He never even read the books, but he researched them and made all the magical decorations himself. Read more: @webpagelink"},{"comment_id":"898756240177140","commenter_b":". . . and it's just going to get worse until we deport them all ! ! ! !","commenter_a":"LOL. LOL. These retarded Liberals! Can't we all just get along... you stupid liberals have brought this into our country... and now it will be like the middle east... Socialist DEMOCRATS SUCK!","post_message":"(Video) Is 2015 the year we see outright war between radical Muslims and Americans on our streets? As exemplified by the actions of these Texans, Americans will push back against Islamization with highly provocative moves. Will Obama be able to keep his jihadists in check until he declares Caliphate? Read More + Video: @webpagelink"},{"comment_id":"10159083149270206","commenter_b":"I'll lick your eyeballs #nohomo","commenter_a":"@username do u think this works for pink eye?","post_message":"This woman gets paid to lick people's eyeballs."},{"comment_id":"10152861965631130","commenter_b":"Is that the END OF YOUR BULLSHIT?? Nothing to do with illegal immigrants. Whooping Cough outbreaks happening ALL over the world. The bacteria is mutating in two ways: one strain of bacteria lacks the primary protein used in the vaccines; the other strain has new proteins. These are found in Europe, Japan and elsewhere @webpagelink","commenter_a":"Vaccines can force the bacteria to mutate, did you know that? 100,000 Americans have gotten whooping cough in the last three years. 32 babies have died. C.D.C. scientists speculate that the current vaccine may be helping to drive the bugs’ evolution. “The fact that this happened so quickly, to the proportions we’re seeing now, clearly suggests some selective pressures …. Vaccine pressure is probably one of them. @webpagelink","post_message":"\"I believe in trusting doctors, not know-it-alls.\""}]
