[{"comment_id":"10152938707421130","commenter_b":"So did God fall of his throne and let Obama take over until he's better . I think not Obamas words are and have the hissss of a ankle butting supreme.","commenter_a":"I agree with the president. BB is a dick","post_message":"President Barack Obama tells HuffPost that he dismisses Israeli Prime Minister Benjamin Netanyahu's backtrack on Palestinian statehood."},{"comment_id":"10156386712435354","commenter_b":"Dumb asses.. Nuclear terrorism ( round the corner) is far worse than gradual climate change..","commenter_a":"And he is a greater threat than Climate change. So I guess that makes him a greater threat than terrorism too !","post_message":"A DEVASTATING indictment every American should see..."},{"comment_id":"1864804617087505","commenter_b":"Are you high lady??","commenter_a":"President elect Donald Trump is a very sharp guy... He understands how bad America has been divided. Maybe Trump is trying to get a message through Kanye to America, that we need to stop all the violence and hatred. United States! Not Divided States!","post_message":"Mr. West is in the building.   Watch Kanye walk into Trump Tower and read more about his visit with Donald J. Trump here: @webpagelink"},{"comment_id":"10157067954080354","commenter_b":"FEMINISTS ARE THE NEW NAZIS.","commenter_a":"Where I work at, women who do the same job, get the same pay! It was even like that at my last job! Corporations cannot discriminate based on sex or they will face lawsuits! Feminists are always pushing the lie that women don't get paid the same! I've seen it first hand that it is just a LIE!","post_message":"\"It would be nice to be able to have a more complex conversation and to be able to look at it more than just a quota or numbers.”"},{"comment_id":"10154716865434586","commenter_b":"Omg idiots","commenter_a":"What's wrong with people they don't use there heads","post_message":"Dear everyone: Animals are NOT selfie props. This has to stop."},{"comment_id":"818380371637006","commenter_b":"These women supporting Hillary are the most delusion bunch I have ever encountered... I'll leave this video of a woman providing facts about Hillary, so that you know just how delusional to are, and if you still support her after watch this video, you are just as bad as she is. ALL WOMEN SHOULD WATCH THIS BEFORE VOTING FOR HILLARY CLINTON: @webpagelink","commenter_a":"I was delighted and elated to put my vote for y-o-u Hillary! Ive been waiting for this moment and plan to bake cookies to celebrate your election. Much love kindness snd goodwill, Jean","post_message":"\"Get this Donald: Nasty women are tough. Nasty women are smart. And nasty women vote.\" —Elizabeth Warren IWillVote.com"},{"comment_id":"10154415987472908","commenter_b":"DUMP TRUMP!","commenter_a":"Quite right. Remember Lincoln : \"A house divided agaisnt itself cannot stand\". Tell that to Trump who is SUPPOSED to be a Republican but he's a disgrace to their histoy.","post_message":"I do not want to see the frustration and the despair that so many people feel being picked apart by people like Donald Trump, preyed upon, in order to divide us again. A few months ago we were supposed to hate the Mexicans who according to Trump were all racists and criminals. And now we're supposed to hate the Muslims. That's not what this country is supposed to be about. We are strongest when we stand together."}]
