[{"comment_id":"10153564798429614","commenter_b":"Don't crucify this jesus but put his head on a rope and pull him on a tall tree. Hope am communicating?","commenter_a":"Another senseless act of violence, may the victims RIP","post_message":"Two parents were killed and their daughter wounded when they stopped to help a man who appeared to be having car trouble on a road inside a Montana reservation. When the family approached Jesus Deniz Mendoza, he pulled out a gun and ordered them out of their car, the surviving daughter said. He then told them to walk away from their car. As they turned to leave, the daughter heard a gunshot. She looked back and saw her father lying in the road, she said. The next shot killed her mother. The third shot hit her in the back. Mendoza said he the victims because he was getting tired of waiting around, and because the daughter laughed at him, the criminal complaint says. Read KTLA's story here: @webpagelink"},{"comment_id":"495141487277558","commenter_b":"And you do? Cause your so fucken righteous and enlightened?? Get the fuck out of here it's called war we didn't start it but we damn sure finished it fuck them! They killed our people, we killed theirs.","commenter_a":"So your all saying they blew up a few ships of ours and that justifies nuking a whole city your all a bunch of in breed morons that lack logic and intelligence and have no awareness of the real world around you","post_message":"Since the bombs were dropped, the U.S. government, U.S. high school history texts, and the American public have asserted that dropping the bombs was necessary. But is that really the case?"},{"comment_id":"10155442182635615","commenter_b":"Fix that damn grill! She looks like a damn key maker!","commenter_a":"get a new haircut, for starters...","post_message":"What do you think they should do with it?"},{"comment_id":"485272544994977","commenter_b":"I'm so sick of her","commenter_a":"So says the compulsive liar.","post_message":"The video shows Hillary Clinton snapping at an activist and calling out the Bernie Sanders' campaign for lying."},{"comment_id":"10154840389483256","commenter_b":"Mine Fuhror has a real hard on for the $500BILLION dollar oil deal with the Russians.","commenter_a":"Trump keeps finding the billionaires who will so care about the United States and her citizens, I am sure. Are the pigs flying yet?","post_message":"President-elect Donald Trump is expected to select Exxon Mobil chief executive Rex Tillerson as secretary of state, elevating a dark-horse prospect who seems to have surged past seasoned political actors like Mitt Romney and Sen. Bob Corker, R-Tenn., in the stretch."},{"comment_id":"10154837209509657","commenter_b":"Gowdy did you just find out that democraps cant be trusted? I could have told that to you years ago.","commenter_a":"The only thing that will cause changes is to put Hillary Clinton in jail. Make an example of her. Set an example that shows that politicians cannot go around lying and mishandling classified information without dire consequences happening to them. You have got to get that train back up on its tracks.","post_message":"Desperate times call for desperate measures."},{"comment_id":"10156409954230354","commenter_b":"DUMBASS BITCH STRIKES AGAIN!!!!!#","commenter_a":"Get her out of the power supply. Feel for your own residents. One bankrupt San Bernardino. Please give our city hope .","post_message":"Nancy Pelosi’s message to Americans this Thanksgiving is that the nation’s “broken immigration system” is “cruel” to illegal immigrants. No mention of the THOUSANDS of victims of criminal illegal aliens. Pass the turkey..."}]
