[{"comment_id":"10155192232363984","commenter_b":"Amen. These Thugs are going Down.","commenter_a":"Thank you Mr. President Donald Trump. I hand it to you for everything your doing for this country and everything your about to do. It's about time we got a president who's looking after his own country first. GOD BLESS you President Trump. Trump train full speed ahead.","post_message":"That didn't take long. This says everything about Donald Trump's presidency..."},{"comment_id":"10154212889868822","commenter_b":"2 fecking idiots!!! That is all I have to say!","commenter_a":"Just look how dangerous Pittsburgh has become in itself!! There are murders every single day and crime is most def on the rise!! Jobs are scarce unless you want to work part time in fast food or at a gas station","post_message":"Boston Mayor Marty Walsh joined Pittsburgh Mayor Bill Peduto for breakfast before hitting the campaign trail to drum up support for Hillary Clinton ."},{"comment_id":"10154962501399609","commenter_b":"And I love Mexican women too.","commenter_a":"This will bring in more money for our economy and more jobs to the US and lessen our trade deficit with Mexico. The demand for US products will go up and continue to stimulate our economy. Finally, we have a president making decisions that loves Americans and his country.","post_message":"JUST IN: President Trump wants to pay for the border wall by imposing a 20 percent tax on imports from Mexico. @webpagelink"},{"comment_id":"537465956461211","commenter_b":"You are a total BS'er bitch ...","commenter_a":"Total billshit. I am part owner of a restaurant and we don't have this problem. We have health care for all employees and it didn't hurt our bottom line. The owner is just greedy and doesn't care about the employees.","post_message":" don have that kind of money. So instead of 50 or 60 people without health care, we have 50 or 60 people that aren employed anymore. It makes no sense."},{"comment_id":"10152659193766680","commenter_b":"Not for the people in charge.","commenter_a":"They're right, our presidential debate system is broken.","post_message":"The group aims to make it easier for independent candidates to get a coveted spot on the national stage in the fall of 2016."},{"comment_id":"457639131093334","commenter_b":"Fuck her","commenter_a":"She doesn't even have the power to shut down a lemonade stand.","post_message":"Will You Cave To Michelle And Only Eat Where She Wants? Comment 'yes' or 'no'."},{"comment_id":"10153270797394342","commenter_b":".","commenter_a":"Climate change. The earth is warmer than it has ever been, which means bacteria, viruses, diseases, all have the perfect breeding ground to multiply in larger numbers than we have ever seen before.","post_message":"LEGIONNAIRES' DISEASE LATEST: As New York City grapples with its worst-ever outbreak of Legionnaires' disease, health experts are trying to understand why reported cases of the illness have risen across the country in recent years."}]
