[{"comment_id":"10154012731783352","commenter_b":"You know there has to be issues with her if the white men think you are crazy!","commenter_a":"I hate when you left a man they started to talking shit Dave Justice go sit your ass down some place and stop talking smh","post_message":"Halle Berry’s ex Dave Justice tells why he’s finally speaking out about the A-list actress, who tried to ruin his life and did the same thing to ‘Eric, Gabriel and Olivier’"},{"comment_id":"949528478479092","commenter_b":"why can't they just leave things alone change this change that !!!!!","commenter_a":"The man who stopped the corrupt bankers is dumped. How extraordinary.","post_message":"Not everyone is happy about the change."},{"comment_id":"10153205553056782","commenter_b":"@username...the difference is that I am a legal United States Citizen and the illegal criminal is not. They broke the law so that makes them a criminal..and as for pushing...the illegals are the ones that are not going to like the results.. You come to the U.S. legally and you are welcome with open arms. Illegals come here by breaking the law and then refuse to learn English and then demand they be given the same rights as American citizens and for things to be changed to fit them...BS!!!!","commenter_a":"This is complete BS!!! They are illegals!! NOT undocumented.... In Oklahoma you have to prove you are here LEGALLY, not an illegal criminal to get an Oklahoma ID or DL. Sign up for a DL as an illegal and get deported.","post_message":"An Oklahoma City grassroots effort to get undocumented immigrants drivers licenses is gaining momentum."},{"comment_id":"10154490094079342","commenter_b":"@username so it's okay for a woman to put her hands on a man and act like a man but the second she get treated like a man she wanna cry and say, \"I'm a girl!\" FOH! Keep your hands to yourself. Period!","commenter_a":"Kindergarten lesson, first rule. Keep your hands to yourself.","post_message":"The video shows the woman shove Mixon, then he punches her in the face."},{"comment_id":"10153357415706782","commenter_b":"They should all be illegal They cause cancer.","commenter_a":"Waste of time and money","post_message":"Lawmakers passed a tanning bed bill through a committee Monday. The bill would make it against the law for anyone under 18 to use a tanning bed.  What do you think of the bill?"},{"comment_id":"10154732031694411","commenter_b":"Well you said yourself 'you feel sorry fkr iranians lving in primitive conditions ' and i drew a comparison with Saudi Arabia just to show you its worse there but you won't see that on your tv because saudi arabia is an ally of the west so western media will cover them up... the same iranians you said are living in primitive conditions, make cars, fighter jets, warships, commercial ships, helicopters and are very independent meanwhile saudi arabia doesnt even make a pen so whats primitive to you?","commenter_a":"Good to hear.. Iran and Italy are ties in a relationship against the Israeli brutalities. (Y) it seems that Iran is going to change her policy. Undoubtedly Iran is at right path..","post_message":"'Unprecedented': Maneuvers come despite several controversial incidents involving US warships in the same area"},{"comment_id":"10152771526960950","commenter_b":"She didn't tell people to do this so she isn't responsible for what happens. She is only on the show since her older sisters were in the lime light to begin with and then as she got older she got in the light! It's not her fault these girls are dumb af!!! She paid money to get filler in her lips she didn't suck her lips into a bottle!","commenter_a":"I know kids who have done is following that crazy K lead. She should be held responsible if anyone becomes disfigured. Time for a public statement, Kylie.","post_message":"WARNING: Teens who participate in the #KylieJennerLipChallenge by suctioning their lips with a bottle or jar could be left permanently disfigured or deformed, doctors say."}]
