[{"comment_id":"10153498336211955","commenter_b":"Why would anyone go? Build the freaking wall.","commenter_a":"Are they trying to raise money for the wall?","post_message":"MEXICO ORDERS TOLL TO CROSS IN"},{"comment_id":"102418186941623","commenter_b":"@username 99% of the Republicans that seem to comment in these venues seem to share the same ugly views. Those that aren't like that need to speak up more.","commenter_a":"That's because Republicans are selfish, self-righteous, hypocritical pieces of shit who are blowing loads over their new ability to grab power.","post_message":""},{"comment_id":"10155201901781162","commenter_b":"Maybe the writers can be more select on how they word their headlines. Maybe they do this on purpose cause they get a kick out of reading the comments. You never know.","commenter_a":"Reading is key... trumps pic did employ an illegal, but upon finding out ended her employment and aided in getting her assistance in getting legal status ... this is why america is the way it is... read a title and jump to conclusions... most of the people protesting can't really hold a conversation about why there out there.. other than 1 line headlines they repeat over and over... it's sad","post_message":"President Trump's labor secretary pick, Andrew Puzder, admits that he and his wife employed an undocumented housekeeper for years...@webpagelink"},{"comment_id":"10153817478256320","commenter_b":"@username he will never be a woman","commenter_a":"Um. No. Besides i hear she doesnt even want to be a woman anymore.","post_message":"Happy Birthday!  Caitlyn Jenner celebrates what she considers to be her 'first birthday.'"},{"comment_id":"10153220467940950","commenter_b":"Lets hope for something known as KARMA, mf'r.","commenter_a":"That's so wrong","post_message":"A video showing a McDonald's drive-through worker offering a reportedly homeless man a burger and then throwing water in the man's face is quickly moving through social media waves."},{"comment_id":"1738525546372400","commenter_b":"Amen","commenter_a":"Amen","post_message":""},{"comment_id":"10154029353788352","commenter_b":"dont save these hoes","commenter_a":"Wow","post_message":"17-Year Marriage Ends in Three Dead When Wife Drops Husband Off to Catch Flight, But He Follows Her Instead – Catches Her Meeting Lover at Hotel: Husband Murders Man, Wife and Self"}]
