[{"comment_id":"10153216491624877","commenter_b":"I just saw a story about her on the ID channel on Sunday. She's ridiculous and should be ashamed of herself. She actually chose a life of crime over her kids when they were younger. There's nothing cute about what she's doing or has done. She should be locked up.","commenter_a":"She needs to sit her old, thieving behind down somewhere.","post_message":"Notorious jewel thief Doris Payne strikes again. Fresh out of prison, Payne is linked to a missing $33,000 diamond ring. Watch how it unfolded below.  Grio fam, 84 years old and Doris is still doing her. What do you think?"},{"comment_id":"10154838480761729","commenter_b":"Nothing will stop this because they want to become martyrs and are ready to die for Allah. Killing them before they kill you is the only solution.","commenter_a":"Here we go again, it's the guns! Oh wait, I thought ALL guns were illegal in Germany? They need to tell these criminals that they are not supposed to have guns! How dare them break the law and get illegal guns! They need to make more gun laws because that will make it harder to get guns.","post_message":"UDPATE: Authorities warning MASS TERROR ATTACK UNDERWAY  Manhunt underway, public transit shut down..."},{"comment_id":"10153170406841770","commenter_b":"I SAY MERRY CHRISTMAS And Happy Easter !! NO MORE REFUGEES ! THE PEOPLE NEED TO BE REMINDED THAT FDR AND CARTER DID WHAT TRUMP IS SUGGESTING ! THE PEOPLE NEED TO HELP DONALD J TRUMP [ MAKE AMERICA SAFE AND GREAT AGAIN ] VOTE FOR AMERICA ! ABOLISH ALL GUN FREE ZONES AND ESTABLISH A NATIONAL RECOGNIZED CONCEALED CARRY ! NEVER FORGET WHAT THE DEMislamOCRAPS AND obuma HAVE DONE AND ARE TRYING TO DO TO AMERICA ! PASS IT ON !","commenter_a":"Saying a specific group of people matter above others is highly racist and prejudicial.","post_message":"Black Lives Matter protesters are filling the streets of Chicago Wednesday, blocking traffic and disrupting the city to protest police actions relating to the death of 17-year-old Laquan McDonald."},{"comment_id":"1104396149581395","commenter_b":"Because women aren't people?!","commenter_a":"*women with depression","post_message":""},{"comment_id":"10155404050665492","commenter_b":"Your entitled to carry your personal property anywhere you want . Just put it away when you spot the vermin .","commenter_a":"Having your phone in hand is tantamount to having wad of cash in hand.","post_message":"The subway rider was also punched in the face."},{"comment_id":"10154481356497098","commenter_b":"You a dumb hoe kris","commenter_a":"The awkward moment when you spent all of your infrastructure funds on illegal immigrants and government handouts. 😂 #ihopetrumpmakesyougetonyourkneesandbeg","post_message":"FEDERAL FUNDS REQUESTED: Gov. Jerry Brown is asking the Trump administration for federal assistance in responding to a potential failure of a spillway at the Oroville Dam in Northern California."},{"comment_id":"1792270164372790","commenter_b":"She's an old nasty hag!","commenter_a":"Not worth it!","post_message":"SAY WHAT?"}]
