[{"comment_id":"514982215334916","commenter_b":"With all the illegal immigrants crossing our borders daily, we have no control over the diseases they are bringing into the country, diseases that were eradicated here,thanks to vaccines. If there is even a small chance my child could be exposed to diphtheria, whooping cough, or the measles, or polio, you can believe I will do whatever I can to protect them from these horrendous diseases. If you want to play Russian Roulette with those chances, that is up to you.","commenter_a":"Thanks for taking the time to let us see who you really are. I am more and more impressed by you each day.","post_message":"Each night I try and carve out some time to answer questions from my friends on Facebook. You can submit your questions by sending them to me via email at AskBen@BenCarson.com. I am out in Jackson, Wyoming tonight and my, is it pretty out here. The first question tonight is one I see comments on occasionally. It is from Devon and it is about childhood vaccinations. Devon, as you know, I spent my life with a Pediatric specialty. As a Pediatric Neurologist, I feel I have a very solid understanding of the developing brain of a child. Devon as you know, my life's work was in a pediatric specialty, caring for 15,000 children to ensure that they could live full, productive, and healthy lives. I can assure you that I would never advocate for a treatment for children without fully knowing that it is safe and in the best interest ..."},{"comment_id":"10152777855631717","commenter_b":"Totally disgusting, the bastard should be locked up for life!","commenter_a":"Are you serious? Time to pull them off the bench!","post_message":""},{"comment_id":"992434430797029","commenter_b":"That woman needs to be locked up in the nearest lunatic asylum.","commenter_a":"Pathetic & scary scenario is these lunatics own guns! She probably packs a gun in her Walmart plastic purse! When these nut jobs escalate as she did, back up & run!","post_message":"Something tells me this nut is a Tea Partier."},{"comment_id":"10155095813944203","commenter_b":"KEEP IT UP DEMS!!!👍🗽🇺🇸","commenter_a":"There should also be a petition to all cable carriers to remove FOX from their channel line up as this network is a danger to America. Tell advertiser to boycott FOX.","post_message":" misled the Congress and he misled the American people."},{"comment_id":"896989227005981","commenter_b":"How much longer are we going to let this jackass destroy OUR country","commenter_a":"Will they cover whitr slaves also...or will they remain color blind???? NEVER HAPPEN ON AMERICAN SOIL WOTHOUT ANOTHER CIVIL WAR........JUST WHAT OBAMA WANTS...DIVIDE AND CONQUER","post_message":"Wait. WHAT?!"},{"comment_id":"418030251654903","commenter_b":"Why not, she gets away with murder!!","commenter_a":"Bad, evil, lying laugh quack! 👎","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"},{"comment_id":"10153134542104705","commenter_b":"Marianne Hutchinson maybe you should move to NZ???","commenter_a":"Merriam Mistlebauer","post_message":"The only thing we have to fear is fear itself.........and spiders."}]
