[{"comment_id":"1153858647985703","commenter_b":"It's the 'Chicago way'.... the end justifies the means.","commenter_a":"And all his ISIS appointees and advisors!","post_message":"Does this about sum it up?"},{"comment_id":"10155024301581600","commenter_b":"Yeah, what's a whinner?","commenter_a":"Proof we have become a nation of whiners.","post_message":"Tens of thousands packed into downtown."},{"comment_id":"1417299944952004","commenter_b":"They are illegal immigrants. Reagan granted amnesty in the 80's and it was to be a one time thing for those already here. Settled once and for all. But they keep coming. And this problem is not just from Hispanics although they make up the majority of inflow. If they couldn't come legally then they shouldn't be here. People have been coming legally for 100 years (like my father and his parents). No excuses. They are breaking the law and need to be deported.","commenter_a":"All he has is big ego","post_message":"Dude! Really??!"},{"comment_id":"10157252246585354","commenter_b":"Lorena Bobbitt needs to take care of this demonic trash creature!","commenter_a":"Deplorable.","post_message":"**UPDATE**  That's it?!"},{"comment_id":"1148491358514249","commenter_b":"She would not make a good POTUS. She ran HP into the ground.","commenter_a":"I have thought the same thing about Carly Fiorina. I like her and believe technically she might make a good president. But she has a 'look' about her, not about beauty or sexiness, but a look like she's been hurt badly sometime in her life and is going to have a nervous breakdown at any minute. Leadership also relies heavily on appearance and Ms. Fiorina's 'look' just isn't motivational. It's almost all about appearance...when is the last time you've seen a multi-million dollar preacher that looks like he/she just lost their puppy? This country is going to need vitality to rebuild itself and she does not project that; FDR would not be photographed in his wheelchair and people still talk about Jimmy Carter's preacher look. We need and I haven't seen anyone that 'appears' to resemble him, except maybe Sen. Marco Rubio, and only somewhat, a JFK.","post_message":"Trump was watching a newscast when a video clip zoomed in on rival Republican 2016 candidate Carly Fiorina. 'Look at that face! Would anyone vote for that?'said Trump."},{"comment_id":"10153216973363855","commenter_b":"Good let the idiots divorce","commenter_a":"overinflated sense of their own importance much? idiots","post_message":"Here's to a speedy divorce!"},{"comment_id":"10154229905709170","commenter_b":"Stop it. This kind of game playing makes you look more the fool. Most people today couldn't pick a transgender out of a line-up of people. They've been using our public bathrooms according to the sex they identify with, live and dress as, all these past decades to no uproar. Now all of the numskulls have come out of the woodwork claiming their women and children will be raped in the toilet stall because men are going to swarm into the ladies room because the law says they can. Get this: sexual predators don't follow laws in the first place and no law will stop them from getting their next victim be it in a bathroom or anywhere else.","commenter_a":"I will be packing better know what you are doing or you will be peeing like a girl for real !!!","post_message":"You want to try using the ladies' room, bro . . . the politicians and the media might be OK with you, but as for the ladies themselves, I wouldn't be so sure."}]
