[{"comment_id":"1309663882411384","commenter_b":"Thank you! Someone with a little logic about the abortion! It should not be tax payer funded and it should NoT be past 12 weeks and it should not be used just because some idiot woman didn't use birth control and doesn't wanna deal with the consequences of her actions !","commenter_a":"I can not believe that abortion is a right to be discussed in 2016. It is a womans right to decide! It is our bodies!! As long as it happens before the 12th week...but women need to use their head and not use this as birthcontrol! Protect yourself if you don't want a kid! As I said, it is 2016 and we do have many types of birthcontrol!","post_message":"Obama's last stand"},{"comment_id":"893596794095327","commenter_b":"Obama lead the ludicrous Iran Nuclear Deal. That was it for me. Iran has already violated the 5 year ban on developing and testing ballistic missiles which was part of the nuclear deal and guess what - do nothing Obama is just ignoring it. As far as national security goes - Obama is a disaster. And now he wants to bring in 10,000 refugees from ISIS territory who can not be vetted. Obama is not good for America or Israel.","commenter_a":"CORRECTION: It is under Obama that Israel has received more defense material than under any other previous administration! And these people have the gall to call him the worst President for Israel! And with His Highness' present standing in international diplomatic circles, his voice is hardly more than a \"whisper\" in the globalized wind! It's about time that people become aware of what he has wrought on Israel's reputation.","post_message":""},{"comment_id":"10154490897799657","commenter_b":"That bitch wants your guns so she wont get shot.","commenter_a":"she is brain damaged","post_message":"How far is Hillary willing to go to get your guns?"},{"comment_id":"606606769472505","commenter_b":"Karma's a bitch!","commenter_a":"not that I don't think this would be a good thing, but what's shown isn't likely. Unless this particular suicide bomber killed himself without using the bomb he was wearing, that bomb has been used. somebody would have had to put the scraps of his body into a new wearable bomb for this to happen... without anyone noticing.","post_message":"Video: This funeral for a suicide bomber is about to take a MAJOR unexpected turn for these terrorists. Karma?"},{"comment_id":"1193853800707672","commenter_b":"Cause she's a lesbian LMAO","commenter_a":"i blam obam lol","post_message":"She has the most pro-LGBT platform ever. Here's why."},{"comment_id":"1398558810203863","commenter_b":"Stay off facebook lady.","commenter_a":"I'm not a hater, and love fashion, but, this dress is absolutely unprofessional! Why would she do something like this...makes a person wonder!!!","post_message":"'She looks like she's working for an escort agency!'"},{"comment_id":"10156131278050725","commenter_b":"only one that needs to apologize is hillary the corupt crook who lined her pockets and sold out the entire USA to make millions. where are those emails hillary?","commenter_a":"HELL NO!!! He doesn't defend America. When he starts defending America and her citizens, then we can start defending him.... if he does something right, that is.","post_message":"Am I morally obligated to defend the President every time somebody says something bad or controversial about him? I don't think so!"}]
