[{"comment_id":"1055483257833554","commenter_b":"Hell no lol","commenter_a":"@username Marcela Guzman-Medina","post_message":"NIGHTMARE: What began as a normal day at the beach ended with amputation after a man contracted a flesh-eating virus."},{"comment_id":"373714942816800","commenter_b":"these two remind me of demons..... boy are they in for a surprise on judgement day... I will pray for them.........they are so misguided........","commenter_a":"It is my understanding that there are some Seal team guys in the middle east that would like these guys to come and visit....and they will be glad to indoctrinate you about how things work in their part of the world...please make a reservation as soon as possible.","post_message":"Bill Maher joins Michael Moore in the war against Chris Kyle..."},{"comment_id":"1453852417965437","commenter_b":"Vile scum maggots.","commenter_a":"\"Did Huma have her genitals cut off?\",,,,More projection from Alex Jones?","post_message":""},{"comment_id":"1090845874295643","commenter_b":"Maybe two life sentences are appropriate for such an individual. Think of the trauma that poor child will go through all his/her life.","commenter_a":"We can only hope.","post_message":"A burglar caught on a nanny camera brutally beating a mother in front of her young child was sentenced to life in prison. @webpagelink The mother survived the onslaught and testified against her attacker."},{"comment_id":"1311726352220443","commenter_b":"Percy Lopez. ...taken to the cleaners, you have been schooled Percy, what's it like being a moron","commenter_a":"The best president ever!! Turned the economy 360 degrees after Bush's administration crashed it to the ground. You have done everything you could to help america Mr president. Your courage, dedication and integrity brought tears of gratitude to so many american people.","post_message":"'I can drink beer at 11.30am and Michelle won’t even know?'"},{"comment_id":"10153055275424877","commenter_b":"How can a woman rape a man..??","commenter_a":"interesting turn of events","post_message":"Mother of 3 arrested for breaking into a man's apartment and raping him while he slept. Grio fam, if she was a man do you think her sentencing would have been more severe? Sound off below!"},{"comment_id":"1239601439418363","commenter_b":"kill yourself then you basic bitch","commenter_a":"yo this shit is funny as fuck and if you disagree you're definitely not lit kill yourselves if you didn't laugh when the girl dialed 911 on the microwave and the first few notes of the x-files theme song plays as you hear the operator lmaoo im deaaaaaad if you didn't like this vid fuck u, ur bitch, ur fam, and the clique u claim","post_message":""}]
