[{"comment_id":"10156393524070389","commenter_b":"Isis , of course,climate change is a myth! It gives obama something to talk about beside the real problem, his muslim brothers.","commenter_a":"Odummy is the Threat!!!!!!!!!!","post_message":"Question of the Day: Which do you think is a bigger threat: Climate change or ISIS?"},{"comment_id":"10153237393021350","commenter_b":"Great idea but this lady ain't fat...","commenter_a":"You look fantastic!!","post_message":"This mom has become a swimsuit role model."},{"comment_id":"1142853059119585","commenter_b":"So's my father. Personally, I served a three year tour in the US Army.","commenter_a":"No! George Bush was in the service. But no one knows how he got out.","post_message":"Don't you EVER forget this... nor let these Republican chicken-hawks send your children off to die in wars for profit."},{"comment_id":"1044972152190462","commenter_b":"My penis book says the penis breaks off and swims after her! !Get away from me you dick!!","commenter_a":"lol","post_message":"Via Sciencegasm."},{"comment_id":"10155176603990389","commenter_b":"Don't know of anyone who did. Won by fraud.","commenter_a":"I didn't vote for this useless President!!!","post_message":"ICYMI: Republicans cheered as President Barack Obama said “I have no more campaigns to run.” Obama, cracked a smile and responded: “I know because I won both of them.”"},{"comment_id":"1702718559987828","commenter_b":"Vote Trump & #MakeAmericaHateAgain","commenter_a":"Enjoyed seeing everyone and the interaction. Refreshing to see and will support Trump all the way. Vote Trump and let's Make America Great!!","post_message":"GOOD MORNING! If you missed last nights #TrumpFamily Town Hall on CNN with Anderson Cooper- you can watch the full version here! My family and I had a wonderful time. Enjoy!"},{"comment_id":"1941882042704784","commenter_b":"And some will just because it's a female!!","commenter_a":"I'm speechless!!! It's incredible what that vile woman has gotten away with! I've lost all hope in this government and country! It's bad enough she's gotten away with MURDER but to think of the multitude of fellow Americans who'll vote for her is an atrocity!!","post_message":"\"Yes, [Donald J. Trump] is far better to be commander-in-chief than Hillary Clinton in my mind. I don't think Hillary Clinton is going to do any of the things we need to do to get this country back on the right track. More importantly, I think she has been holding herself to a different set of standards, and I don't think that is representative of what we want to see in the White House.\" — Speaker Paul Ryan"}]
