[{"comment_id":"10153030490451800","commenter_b":"Pageants are Insults to women and we should be past these DOG and PONY shows by now.","commenter_a":"Evidence That Beauty Pageants are Epic failures \" SARAH PALIN\". VAPID AS ANY CANDIDATE FOR ANY OFFICE ANYWHERE ANYTIME THE ONLY BIGGER IDIOTS ARE HER DONORS AND PERSONS STUPID ENOUGH TO BUY HER BOOKS. When I find one of her books for 15 cents at a Thrift store I will shred it and use it to Line my cats Litter BOX. ( If i don't find a Donald trump book first)","post_message":"\"Good for Miss Lebanon and Israel for rising above your countries' political squabbles to say to the world that on the inside, we're the same. And also on the outside, apparently they're the same. They're almost completely identical, it's really inspiring.\" -- Jon Stewart @webpagelink"},{"comment_id":"505124579675835","commenter_b":"Kiss my ass!!","commenter_a":"You have no rights!","post_message":"The most chilling and honest interview about Islam you’ll ever watch…"},{"comment_id":"1158653037490292","commenter_b":"HOW can he be such a hypocrite??? His companies ship jobs overseas, and he ships in illegals to work for cheap saying Americans won't do the jobs","commenter_a":"When his ties are made in China really dude???","post_message":"Donald J. Trump lamented Nabisco's decision to move jobs to Mexico, then pointed to Chris Christie: \"You're not eating Oreos anymore, are you?\" @webpagelink"},{"comment_id":"1616274731928330","commenter_b":"Did you see where in California they are registering Illagals to vote, guess who they will vote for?","commenter_a":"Obama distracts us while he slips his executive orders by us with out much attention. Democrats weren't for gay and lesbian or transgender rights until Hillary needed more votes. Last election Hillary ran in, she is on video saying marriage is between a man and woman. She flip flopped and so did the party for more votes.","post_message":"Hey, Leftists: you want to stand up for LGBT folks? How about joining conservatives in speaking forcefully and honestly about the MURDER of gays and lesbians by MUSLIM terrorists inflicting SHARIA LAW?  Oh...that's right, Obama doesn't allow you to talk about that. So instead you \"boldly\" focus on men using women's changing rooms and bathrooms and ignore the DEATHS of hundreds of gays and lesbians, because identifying their killers would require you to utter the words \"Islamic terrorists.\"  Gee, how \"noble\" of you, how \"brave.\"  #phonies #poseurs"},{"comment_id":"10153800001886336","commenter_b":"OK all immigrants should loose there language and culture. Derp","commenter_a":"Gop crybabys don't ask me questions the Fox news debate asked basically the same questions does Reince Priebus realize that was the only gop debate to be simulcast on a Spanish network effectively telling Spanish Americans we don't care about you","post_message":"Reince Priebus  told Fox News that aside from making sure “CNBC isn’t hosting and moderating another debate with our candidates,” the Republican Party is going to review “everything” about the debates. @webpagelink"},{"comment_id":"1129299917126536","commenter_b":"Hillary is the real war on women.","commenter_a":"Together we Move Forwards Vote to President @username 2016.","post_message":"In ten years, we can generate enough renewable energy to power every home in America. #EarthDay"},{"comment_id":"10155234005228984","commenter_b":"Shut off the money! Mandate Everify with suspension of business & huuuuge fines if caught hiring illegals. No Welfare or any other benefits to non citizens. Proof of citizenship to attend schools! They will self deport! As for DACA? Ok. Let those poor kids who were dragged here as children BUT deport the parents that dragged them here!","commenter_a":"They are pissed off because of our policies but let ne of us cross their broader and see what happenes.","post_message":"WATCH LIVE: Secretary of State Rex Tillerson, DHS Secretary John Kelly and Foreign Secretary Luis Videgaray make statements from Mexico City on President Donald J. Trump's new immigration proposals."}]
