[{"comment_id":"10152732275938645","commenter_b":"fat a** hoe.","commenter_a":"Report me all you want trick","post_message":"The victim said the attacker threatened her during the rape, saying he knew where she lived and would return to kill her if she called the police."},{"comment_id":"10154521011917098","commenter_b":"You a hoe","commenter_a":"Hahahahaha trying to get his dick wet but caught a case of the zzzzzzz","post_message":"#HEARTBREAKING: When police arrived, they found the 17-year-old dead in the foyer."},{"comment_id":"1155787421127301","commenter_b":"lmao ...#NeverCrookedHillary #JillnotHill","commenter_a":"Hillary for the love of God stop drinking!!! Your pandering is psychotic, you're losing touch with reality and becoming paranoid!!! You look old and tired!!! Put the vodka bottle down and go to bed!!! VOTE TRUMP MAKE AMERICA GREAT AGAIN !!! '","post_message":"A young girl asked Hillary, 'Do you think when you're president, you'll be paid as much as a man?'"},{"comment_id":"1065131623520589","commenter_b":"R.I.P.","commenter_a":"Awwww, RIP, Al","post_message":"RIP Al from Happy Days. He passed away on Friday at age 96."},{"comment_id":"1582128638759914","commenter_b":"Normal people don't put bombs in dumpsters......terrorists do....","commenter_a":"Tell us again how this isn't an act of terror?","post_message":"Breaking News: FBI releases a 'Wanted' poster identifying 28-year-old Ahmad Khan Rahami, a suspect in the bomb blast in New York City Saturday night.   The FBI's wanted poster identifies Rahami as a naturalized U.S. citizen of Afghan descent. MORE DETAILS: @webpagelink"},{"comment_id":"10153203209001336","commenter_b":"THANK GOD THERE ARE MOTHERS LIKE HER I WOULD DO THE SAME THING IF IT WAS MY KID!!","commenter_a":"Lets hope she isn't accused of child abuse!","post_message":"VIDEO: A woman is seen beating a rioter in Baltimore. It turns out he is her son."},{"comment_id":"438573499666627","commenter_b":"'@username. She's an idiot","commenter_a":"Another liberal sheep just voting for a female!","post_message":"Lena Dunham isn’t worried about Michael Bloomberg."}]
