[{"comment_id":"10153739265778984","commenter_b":"No need to wonder what you are, being from Liberfornia and all.","commenter_a":"I 100% support her staying in jail until she agrees to do her job as ordered by a federal judge.","post_message":"For Kim Davis, this is Day 5 of her incarceration - but her lawyers just made an announcement that could turn things around.  Do you support Kim Davis?"},{"comment_id":"1227897690610317","commenter_b":"She racis af","commenter_a":"Line your Ass up and get on the Trump 🚌 bus get your no 🚿 showering Ass out the U.S. take your stank mama with you.💩💩💩💩💩💩😄","post_message":"He went in with no shame!  #WSHH"},{"comment_id":"10153469277832093","commenter_b":"You know right off the back it wasn't a girl bc the rims aren't scraped from the curb lol","commenter_a":"Jeffrey id say that his parking skills are top notch.","post_message":"File this under the 'smart criminals' tab. @webpagelink"},{"comment_id":"871197372940012","commenter_b":"What a vile creature! Hope she rots in jail!!!","commenter_a":"Some people don't deserve to work in child care, I worked in child care for 25 yrs & I have seen some things as well, I worked in a nursery room at my last job( where I got injured & can't work again) & my assistant at the time picked up a 7 month old baby by 1 arm which is a major NO NO, carried him across the room & dropped him 1 metre onto cushions, I spoke to her about it & told her it wasn't on & she went & dobbed to the directors & i was the one who got into trouble, at another centre I sw someone tie a 5 yrs feet up & put them in the resource cupboard so they wouldn't wander around during sleep time, they lost their job for it. so many sickos.","post_message":"Footage shows her attacking girl who fell asleep on nursery floor cuddling her teddy bear"},{"comment_id":"10154273295026051","commenter_b":"Illegals cant vote genius, doesnt Trumps morin base know 95% of his workers are illegals working on HB2 visas ? He games the laws to get illegals to work for less money because he says he cant find experienced US workers, he thinks Americans are fucking idiots and lazy and Boy did he get that right !!","commenter_a":"Once you take all the illegals out, she will have lost the popular vote too. The electoral college was created for a reason. Should not be changed!","post_message":"Hillary Clinton continues to increase her lead in votes over Trump despite losing the election. Do you think the electoral college should stay?"},{"comment_id":"949147745161454","commenter_b":"Nancy Pelosi said on the House floor that 30 million people were uninsured in the United States. After Bummercare, we were told that 40 million Americans were still uninsured. One year later, we were told that 55 million Americans were either uninsured for under insured. Islamic religion prohibits insurance because they claim it's gambling and are exempt from getting insurance. With the current influx of refugees and people sneaking into our country and getting free medical, welfare and food stamps, how many millions are now in this country unisured or under insured? Why would anyone bother to get insurance? Hospitals still take patients, doctors still see patients, and medicine is still sold at the pharmacies. If no one has insurance, costs will immediately be adjusted and negotiated at a lower cost. People will stop running to a doctor for every sniffle.","commenter_a":"amazed it lasted as long as it did, now the states are left holding the bag right along with those folks who tried to abide by that totally damaging obummercareless law.","post_message":"Oh Not Again! 400,000 Americans Enrolled In Obamacare Need To Find A New Plan"},{"comment_id":"1281382285238371","commenter_b":"Well said. If this Jolie live in Muslim country like we do ,then her opinion about Islam will radically change. She should know the Muslim will never compromise with others..stupid","commenter_a":"I don't listen to rich new world order liberal fucking wackos. If the come out and try to tell us all to do something. Its never ever good. This Bitch is rich living in nice safe places. Safe from the hell the rest of us would have to deal with","post_message":"DOES ANYONE CARE WHAT THIS LOSER HAS TO SAY?"}]
