[{"comment_id":"1786545848249097","commenter_b":"@username What's that? No one has been able to get him to say what that is. Oh I forgot, he's going to build a wall.","commenter_a":"Agree Obama put us in a real position with his foreign policy. Now all the people saying Hillary should be our next president she is just as bad or worst then Obama. We need Trump to get in office and try to clean up there messes !!!","post_message":"House Speaker Paul Ryan says \"Our enemies no longer fear us and too many of our allies no longer trust us,\" all because of President Obama's foreign policy. Do you agree or disagree?"},{"comment_id":"10152670445845927","commenter_b":"Give that money to the Border Patrol, and arm them to convince aids-ridden latinos to stay on their side of the fence !","commenter_a":"Sick! No matter how sinful humans try to avoid the consequences of this horrible sin, God's word (Romans 1:26,27) assures that they will receive in their bodies the automatic payment for their wrong. God doesn't lie and He never fails.","post_message":"The study is to find the best ways to convince gay Latino men to wear condoms and get tested for HIV."},{"comment_id":"1034820419922610","commenter_b":"Fuck her","commenter_a":"Oh please she has an easy life it's the soldiers and other people have it hard and uncomfortable not her","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"10153218753159270","commenter_b":"God will deal with this! He did it once.","commenter_a":"But your only going to enforce Christians to marry gays, but muslims can do whatever they want?","post_message":""},{"comment_id":"1211880145496741","commenter_b":"No to illegals.","commenter_a":"Mr. Gowdy, enlist some of your \"sleeping\" colleagues to assist!","post_message":"Thank you!"},{"comment_id":"10153746372034607","commenter_b":"Lock them all up!","commenter_a":"But there is people out there committing crimes, just showing the blue and white power","post_message":"Police have corrected the total number of people arrested during the protests on Friday night to four people. Those individuals were arrested after they refused to move from the roads during demonstrations."},{"comment_id":"1062077417179756","commenter_b":"She is a fraud !","commenter_a":"bad squaw","post_message":"WATCH: CHEROKEE PEOPLE Express Disgust Over \"Lying\" Elizabeth Warren Faking \"Native American Heritage\" To Get Prestigious Law Professor Job [VIDEO] @webpagelink"}]
