[{"comment_id":"10153563067675667","commenter_b":"@username Americans are seeing the true colors of Democrats. Most are trash that don't pay taxes. They live off the taxpayers!! They riot. They block traffic. They destroy property. They commit the majority of crimes.","commenter_a":"Democratic TRASH. The party of thugs, Illegals and criminals. The trash of America. The more you riot. The more we want Trump 2016!!!","post_message":"At least 35 Trump protesters were arrested in San Diego. @webpagelink"},{"comment_id":"665156860339272","commenter_b":"@username God loves Christians and hates all other religions..... Look at how God backed the Christians when they slaughtered 100 million native Indians because they foolishly loved their land and their own spirits, not accepting Christ as the son of God..... so, they were slaughtered... but, they told the men not to waste the ammunition on the women and kids, so they slashed them to death with sabers and machetes.... and God smiled at them...... And, since WW II the Christian Americans have invaded 37 countries killing between 20 and 30 million people, none of them were white Christians though, so God again smiled and nodded with His approval...... We spent $3 trillion on killing 500,000 innocent Iraqi citizens.... or $6 million per person killed..... it is really getting expensive to kill people nowadays isn't it..... Just think if we had spent that $3 trillion on food, we would have ...","commenter_a":"The Hillary and government set up is trying to keep the polls low for trump an high for hilkery, with the media and asking him politely bow out when Hillary wins it's all to hide the fact that they are cheating and they expect to win by their cheating so it will look good when they say she has won and Obama said he would not leave the White House and would blockade anyone coming in but they are trying to make Trump say that he won't fight. Because they know the system is rigged and ready for Hillary but God it's the boss.","post_message":""},{"comment_id":"10154963463661320","commenter_b":"Prayers yes! How about the right time defend themselves with firearms?????","commenter_a":"Praying for peace once again. Sorry for all the victims and their families.","post_message":"The people of Berlin are in our thoughts after today's deadly truck attack at a Christmas market."},{"comment_id":"10153704994641337","commenter_b":"Fuck off fag","commenter_a":"Here come the \"cause Obama is a Muslim\" comments","post_message":"#IStandWithAhmed: Even Barack Obama is showing his support for Ahmed Mohamed..."},{"comment_id":"10154409316811336","commenter_b":"I think like all of us Trump thought no this can't be and thus he thought it was a joke! Then reality of course set in and the man thought as we all do who would expect anything different from the Clintons? My question what is next to come it is something every single day?","commenter_a":"Why would Trump think that such a meeting would be just a joke? All of these democrats are capable of any despicable act imaginable! They have proven it over and over again, but all we ever do about it is whine like little punks! obama should be in prison, hillary should be on trial and lynch should be removed and arrested as well! ENOUGH with the beating around the bush! We need to hit them on the head! They need to be punished severely NOW!!!","post_message":"“I'm flabbergasted by it.”  Donald J. Trump reacted to the news that Attorney General Loretta Lynch met privately with former President Bill Clinton amid the DOJ’s investigation into Hillary Clinton’s emails. Full interview tonight at 10p ET."},{"comment_id":"10153632198263908","commenter_b":"These girls suck. There's no way around it.","commenter_a":"So enlightened yet judging girls because they take a selfie..","post_message":""},{"comment_id":"1260170427412540","commenter_b":"Rudy Giuliani, just said, before president Obama there was no successful terrorist attack on America. I loved it! these so-called educated white men show their stupidity, every time they open their mouths, he just spit and pissed on the graves of all the 911 victims! , it happened not once, but twice in New York (terrorist attacks), and how could sun-bleached bleached Donald Trump care about the veterans when he said he doesn't like the ones that got captured? And before running for president he has never! donated to any veterans organization, but he's going to take care of the veterans and loved the veterans, he's a real sleaze ball!","commenter_a":"We got nothing","post_message":"Is Donald J. Trump likely to double-down on his proposed immigration ban?"}]
