[{"comment_id":"595073377334106","commenter_b":"In GOD WE TRUST","commenter_a":"Where do we get it","post_message":"July 30th marks the 60th Anniversary of “In God We Trust” being written into law as America’s national motto. Our Motto has been referenced by our Presidents, written on our money, and is in our National Anthem. Although some would like to erase God from the public square, we see this as an opportunity to proudly proclaim that “In God We Trust” is still the bedrock upon which our nation is built. On July 30th, let’s sweep the nation with our National Motto! Hundreds of Thousands of people have already join the One Million Window Campaign Get your sticker today and be a part of the Movement!"},{"comment_id":"937893629592518","commenter_b":"men especially infantry like women.. all i can see this now is rape allegations and pregnancy going UP, that and men are biologically inclined to put a women's life first. thus taking away from the mission at hand.","commenter_a":"@username @username intentionally weakening our ground forces. Not because women can't hack it (most can't) but because they will be a distraction for the males and a logistical nightmare.","post_message":"#BREAKING: In a historic decision, the U.S. Secretary of Defense has ordered all military combat positions to be opened to women. STORY: @webpagelink"},{"comment_id":"370446236477004","commenter_b":"Take the bastards OUT!","commenter_a":"Time for drone, and Hell Fire missles.","post_message":"Is your state on the list?"},{"comment_id":"1187051574713979","commenter_b":"She don't care why try and make her lower her standards. Melania is a very classy lady and you want her to lower herself and dress down.","commenter_a":"I'm sure she can find another dresser! No big deal!","post_message":"Michelle Obama's favorite designer, a woman who dressed the First Lady for 8 years in a row, just refused to dress Melania Trump. The reason? She isn't tolerant of her despite asking everyone else to be tolerant of her. The self-professed liberal meant to snub the new First Lady -- but she never saw this coming."},{"comment_id":"10154394163921509","commenter_b":"It's the food were eating gmo and all the chemicals they put on our food","commenter_a":"Rest In Peace Great Grang Pa. How Comes Our Generation Dies Too Young?","post_message":"Yasutaro Koide was born a few months before the Wright brothers made the world's first powered flight."},{"comment_id":"10153205140467426","commenter_b":"Lady shut the hell up negative nancy","commenter_a":"Please get some bike helmets for these young riders and teach them to wear it.","post_message":"Inspired by #Richmond2015? Happy riding kids!"},{"comment_id":"1201903546502686","commenter_b":"No way, he works at Wal Mart today. He made something of himself.","commenter_a":"Is she related to the banjo player in \"Deliverance\"???? Same eyes!","post_message":"It’s a shame, but I guess we shouldn’t be surprised by Hillary Clinton’s attempt to politicize another tragedy to advance an anti-gun agenda. As this analysis rightly points out, Oregon has some of the strictest gun laws on the books, and none of these proposed new laws would have stopped these awful shootings in the first place. We all want to stop these senseless tragedies, but using them to push unconstitutional, unrealistic, and ineffective new laws in order to win favor on the left isn’t going to help. I’m a gun owner myself, and I strongly value the rights guaranteed in the Second Amendment. The overwhelming majority of gun owners are law-abiding citizens who strictly follow all applicable state and local regulations. I will oppose any effort to take away the rights of law-abiding American citizens to own firearms."}]
