[{"comment_id":"464432047077736","commenter_b":"Bye, Felicia....go to that other planet where NOTHING will be different. ...the More of you we get rid of here, the sooner We can straighten the SHIT YOU CAUSED out","commenter_a":"Secondhand rocket for hire. Use at own risk.","post_message":"Elon Musk called the rocket landing \"absolutely perfect.\""},{"comment_id":"10153200218821636","commenter_b":"Not even a single Scottish one who wrote this article....","commenter_a":"@username waaaay yours didn't get a mention","post_message":"Warning: reading this will make you hungry"},{"comment_id":"1029438293779366","commenter_b":"Keep Bill away from those girls Hillary!! You know he acts around other girls!!","commenter_a":"The next Americans president and expected cabinet members came 2015","post_message":"On the set of Broad City season 3 with Abbi, Ilana and Amy! #yas"},{"comment_id":"10152547170886636","commenter_b":"@username. ..rode hard...and put away wet..too bad she didn't stay away wet","commenter_a":"This is a stupid law. If it gets passed. For the reasons you idiot liberals think. It is only a crime if you are wearing it in the commission of a crime. Think about that for a moment. If they charge you with a felony. They will add on a misdemeanor for wearing a hoodie. And then run it all together. So basically it's a nothing law","post_message":"Wearing your hoodie in public could soon be illegal in the state of Oklahoma"},{"comment_id":"10153856262981167","commenter_b":"And what do they show? Nothing in the previous 30K!","commenter_a":"Fixtion(sic) for Fox viewers like screaming \"fire\" in a theater.","post_message":"Really scraping the bottom of the barrel here"},{"comment_id":"10156300548230389","commenter_b":"Gilbert, go back to the ignorant liberal hole you slithered out of. You spineless snake.","commenter_a":"Who in the Hell is Race baiting? It is Fox Propaganda Channel and @username. Who in the Hell supported the Racist Tea Party? Fox Propaganda channel. I see by the comments that you are the problem, not Obama. Your commenters would rather cut off their heads to spite their faces. That is why they listen to you, for the same reason the German people listened to Hitler.","post_message":"Question of the Day: Do you think President Obama has made race relations better or worse in this country?"},{"comment_id":"566112886870821","commenter_b":"another one to kiss that ring and feet","commenter_a":"if donald trump is a racist why to people of many different races show up to his rallies? why aren't they kicked out? He hasn't singled out any one particular ethnic group that he has singled out by saying he hates them.","post_message":"Welp, Donald Trump sure has that racist vote down pat. -Conover"}]
