[{"comment_id":"10153814451294203","commenter_b":"Rebecca shut up","commenter_a":"Nicki Minaj's dad was a financial executive. She's not exactly on Lil Kim's level. Plus she attacks Taylor swift and Miley. These kids are 10 years+ younger than her. It's a little pathetic","post_message":"\"You in videos with black men, and you bringing out black women on your stages, but you don want to know how black women feel about something that so important?\""},{"comment_id":"995560767160480","commenter_b":"Why should he not? The more knowledegable of us that bother to read and comprehend what we read knows full well obummer's allegiance is with his muslim homeland.","commenter_a":"The tyranny in this country almost makes everyone speechless Wake up America Hillary is just an extension of Obama policies","post_message":"Not only did this Syrian immigrant cheer 9/11, in April 2013 she told me to \"go fuc k yourself\" after I called the Boston bombing jihad. This is who Obama assigns to keep us safe. Who is going to keep us safe from this savage?"},{"comment_id":"10156931883630294","commenter_b":"Next he goin dangle his white hoe","commenter_a":"I pray for that poor pup, hope they freaking charge this POS to the fullest extent allowed by law, poor thing!!","post_message":"The suspect turned himself in after feeling the pressure on social media."},{"comment_id":"10153046800841717","commenter_b":"Thats one stupid bitch.","commenter_a":"Ok, now it should be the electric chair! This woman is a menace to society and to the rule of democratic law. What a pity she is incapable of learning new skills like other related species! Lol...next she wll have her own TV show!","post_message":""},{"comment_id":"10154444403041337","commenter_b":"Yeah IF you were, possibly. But you're not. You're just a shit talking bitch who hides on FB and acts tough. Again, you impress no one. Go fuck yourself.","commenter_a":"Everyone on here that's against Chris kyle show some respect I come from a marine family and by God if they heard the negativity about this legend a urban war would uprise show some respect ppl","post_message":"CHANGING HISTORY? American Sniper Chris Kyle's record has officially been changed..."},{"comment_id":"337340083398778","commenter_b":"It’s the crazy lady","commenter_a":"Sounds like a republican did not see this coming from her good job","post_message":"If you can drive a military truck in combat, with hazardous cargo, at night, through a sandstorm, then you can drive a commercial truck on an interstate. If you can dock or anchor a 10,000 ton warship under extreme stress, you can do the same thing for a small commercial ship. We spend hundreds of millions to train our servicemembers to do highly skilled jobs, and they are the best at what they do. But too many still struggle to transition into civilian jobs because they don't have the right certifications and licenses – even when they’re being hired to do the exact same thing under much less taxing conditions. We've made progress on this issue over the last few years, and I don’t want to lower civilian standards – but I don’t believe for one second that these individuals aren’t ready to do the equivalent civilian jobs the day ..."},{"comment_id":"10152587508455163","commenter_b":"She read them their rights! Envyherlashes Tawana","commenter_a":"@username girl yes I was so happy Amber told them hoes wat it really IZ it's was going on ALLDAY yesterday!!!!!","post_message":"Amber Rose responds to Khloe Kardashian after calling her out for Kylie and Tyga comments"}]
