[{"comment_id":"10153238960151438","commenter_b":"Ok clark. You win. All lesbians are fat hairy and ugly. That is completely accurate. No bullshit. You are a really smart person. So glad we had this talk.","commenter_a":"why are most queer women obese now thats a question","post_message":"Why don’t queer women flirt with other queer women?"},{"comment_id":"10157094830145354","commenter_b":"@username imagine if all illegals and invaders were deported!","commenter_a":"Will a moat filled with gators and sharks be next? Just make sure the fence has a gate so he can GTFO in a few months.","post_message":""},{"comment_id":"10152837029192894","commenter_b":"I do the housewives should be married","commenter_a":"I kinda have to agree @username what do u think ?","post_message":"NeNe Leakes Says Bravo Should Get Rid of All the 'Unmarried' Housewives -- Do You Agree?"},{"comment_id":"10153181723473984","commenter_b":"Put all of them in jail there all criminals","commenter_a":"He needs to go!!!!!!!!!","post_message":"Unbelievable! Boehner just gave Obama exactly what he wanted... Do you feel betrayed?"},{"comment_id":"10155404286440389","commenter_b":"she needs go home shut up and bake pie","commenter_a":"Benghazi won't go away...no matter how many deletes","post_message":"\"A left-leaning agenda won’t get [Hillary Clinton] the presidency – it’s only part of the battle.\" – Doug Schoen, pollster for former President Bill Clinton Question of the Day: Will Bill’s shenanigans hurt Hillary if she runs for president?"},{"comment_id":"1029601670427380","commenter_b":"Waiting for Drumpf to deport his first and third wife. Apparently jobs aren't the only thing he likes to outsource.","commenter_a":"Kurt Schultz think you may enjoy. Just saying. Miss you, partner","post_message":"Trevor unpacks Donald Trump's response to the mass shooting in Orlando. @webpagelink"},{"comment_id":"710582602423848","commenter_b":"Ann Coulter shows her true colors like Trump. They both need a good dose of DUCK TAPE over their mouths.","commenter_a":"If this wasn't an election year, the Republican's would be silent about what Ann \"the Bigot\" Coulter said. In the past she has said terrible things about Muslims, Blacks, Mexicans & liberal Women & they were silent then !!!","post_message":"Ann Coulter needs to slither back into the snakepit she came from. --Andrew"}]
