[{"comment_id":"10152841582006130","commenter_b":"Yas girl","commenter_a":"Phebe Kim Gignac","post_message":"Your taste buds are going to explode."},{"comment_id":"10153539858966943","commenter_b":"Remove them all and start over!!!' No one connected in anyway to ANY family ties whatsoever should be allowed to remain in office ... Mass re-election for both democrats and republicans!!! These people are not American to continue sabotaging the hard working people of America! I don't go to work to pay tax to support ILLEGAL aliens!!!!","commenter_a":"take care of our unemployed that you as president have created then you might leave a legacy dumbass","post_message":"Next week the U.S. Equal Employment Opportunity Commission will sign a deal with Ecuador to Ecuadorian nationals with information, guidance and access to education and training resources to help them exercise their workplace rights. SHARE if you think the federal government should help American workers - not foreign workers!"},{"comment_id":"928579767188091","commenter_b":"and by the time the police come the dog is probably dead by then.","commenter_a":"Whenever you take justice into your own hands you're committing a crime, call the police that's what they're there for and that's what we pay our taxes for, if we didn't pay the taxes to have those brave police officers do their jobs and we all win that round doing vigilante justice what we paying taxes for","post_message":"Charges against the veteran who was arrested for breaking a window to save the life of a dog left in a hot car have been dropped: on.hln.tv/2QzbEY"},{"comment_id":"10156478047465231","commenter_b":"Her lips are gorgeous","commenter_a":"Somebody is jealous of this beautiful lips!!! :* :* :*","post_message":"Some people just don't know how to cope when they see beautiful melanin and full lips."},{"comment_id":"10153401491811323","commenter_b":"Talentless bleeder only got a gig in the first place because she was a woman.","commenter_a":"Was this the same BBC that was busy implementing their towards 2000 policy at this time?","post_message":"“I was told by the producers that they preferred my version, but the channel decided they couldn’t have a woman in charge.”"},{"comment_id":"10153679866377217","commenter_b":"She was vile","commenter_a":"She was rude!","post_message":"\"I'm in favour of migration, I simply want to control the numbers\" - Vote Leave's Michael Gove tells BBC Question Time audience. @webpagelink #bbcqt #EUref"},{"comment_id":"10152821539741051","commenter_b":"who teaches bulling in school better than teachers?there are people out there that have no business interacting with young people at all. she should be put in the stocks, in school, let her feel what he felt. sue them all back to rubble","commenter_a":"Unbelievable, how could this type of bulling be tolerated? That school needs new policy's.","post_message":"When this woman found out that her grandson had been publicly punished like this, she couldn't believe it."}]
