[{"comment_id":"953451111362414","commenter_b":"Feminists are annoying","commenter_a":"I think there all cunts so I suppose I am humanist ha...","post_message":"Tonight, Ed Sheeran performed a song about his love life. Feminist Taylor Swift wants to know why no one called him sexist. #Grammys"},{"comment_id":"619645721526492","commenter_b":"I bet this woman also looks good with clothes on (y)","commenter_a":"Please don't take any advise from the Kardashian's. Look at their lives, they have no right to give out advice","post_message":"Would you contour your bum? We're trying out the 3D tan loved by Kim Kardashian West and Olympia Valance"},{"comment_id":"587546098014187","commenter_b":"It's ok, SHE has 24/7 armed guards, surrounding her...we just need to suck it up","commenter_a":"diane can have my gun, I will put it right where her head is at :))","post_message":"Diane Feinstein admits their are probably sleeper cells in America. So why does she want to take away your guns?"},{"comment_id":"10153653886305950","commenter_b":"Shut up, whore.","commenter_a":"The teen should have complied. And his parents did a terrible job.","post_message":"The aggressive confrontation nearly cost the teenager his life."},{"comment_id":"1043726442390274","commenter_b":"We have our own problems here, send em to other Arab countries","commenter_a":"Not only a great actor, but an absolute class act.","post_message":"\"The show was fantastic, but you left in tears after [Benedict Cumberbatch's] speech. It was very eloquent, emotional, and beautifully put … He gave a 4-letter word to the politicians and said, ‘We’ve got to do something about it.’” - Rachel Martin, audience member"},{"comment_id":"10154668593434062","commenter_b":"Yes, and the NFL approved it and promoted it. If you're going to boycott anything it should be NFL products.","commenter_a":"For those that are clueless or ignorant, she endorses and is promoting the black panther party, which is a racist militaristic organization whose motto is literally \"kill whitey\".","post_message":"Online opinions are intense."},{"comment_id":"10152921328085950","commenter_b":"Wow, Janet Fix, your comment just proves how uninformed you are. Or are you just trying to be obnoxious?","commenter_a":"lol If its Michelle Obama I'm asking for two fives.","post_message":"Move over, Alexander Hamilton... A woman is about to replace you on the $10 bill."}]
