[{"comment_id":"935330543153792","commenter_b":"Kiss your mother with that tongue Karen?","commenter_a":"Excellent news. The courts have prevented the Harper regime from taking over the judicatory.","post_message":"It was the third time Khadr's case has been before the Supreme Court of Canada, and the third time the justices have ruled in his favour."},{"comment_id":"10153250521056509","commenter_b":"It's not just FL, horrible people live everywhere...","commenter_a":"Why does so much f*d up sh*t happen in Florida!?!?","post_message":"A 5-year-old Florida girl was killed after her father tossed her off a bridge from his car, police said Thursday. @webpagelink"},{"comment_id":"1297388806970322","commenter_b":"Being ashamed of himself is not enough. Fire this idiot and boycott the idiots who hired him, and him being a professed republican. Rino.","commenter_a":"Con Hannity always a victim! Lester Holt is a registered Republican. FACT!","post_message":"The numbers don't lie."},{"comment_id":"10153365745456749","commenter_b":"playing to the media.. he has done more to MAKE it happen again than anyone in history","commenter_a":"ALLAHU AKBAR!!!! #MMBR #M23BR","post_message":"\"In memory of those we lost, we resolved to shape a world where events like those of September 11, 2001, could never happen again, and we see this unbreakable spirit live on every day across America.\" —President Obama"},{"comment_id":"1338951096148716","commenter_b":"Anthony - Huh? Who proposed that? If you're not a citizen, you don't get to vote. If undocumented get amnesty (which can only be done by Congress), that doesn't necessarily make them a citizen. If we decide (via legislation) they should have a path to citizenship, then citizens get to vote. Your comment makes no sense, and is a total strawman.","commenter_a":"If you can't win on the merits of your policy ideas, change the system. The GOP should be ashamed.","post_message":"Republicans are pushing, in Virginia and elsewhere, to make it harder for Democrats to win the Electoral College."},{"comment_id":"10153661436973352","commenter_b":"She just ain't shit","commenter_a":"I dont get it.. She was turning herself in to be locked up?!? And left the kids in the car......","post_message":"Mother caught leaving 1- and 6-year-old children in a hot car…while she was turning herself into police for doing the SAME thing last month. SHOULD THEY TAKE HER KIDS AWAY FROM HER?"},{"comment_id":"10153533859861615","commenter_b":"Get that creep off the streets, love that area. People are so sick.","commenter_a":"Diane Fickley Pesci","post_message":"“(He) blocked her so she couldn’t go any further that way and says, ‘Hey, want to have a good time?’” NOW ON CHANNEL 11 MORNING NEWS: A man is being questioned in connection with an attempted luring of a teenage girl -- in the parking lot of South Hills Village Mall. Hear what she and her mom did to help police track him down."}]
