[{"comment_id":"10153990525422452","commenter_b":"Jayleen Guadarrama","commenter_a":"LAPD. Respect the rights of the people.","post_message":"Anti-Donald Trump protesters marched through downtown Los Angeles for hours before LAPD tactical officers blocked in the crowd and began dispersing people in small batches. @webpagelink  The protests were generally peaceful, aside from scattered reports of bottle throwing and graffiti."},{"comment_id":"1201176699902507","commenter_b":"Beverly, there's already plenty of porn out there. I highly doubt anybody's going to get their jollies from our veiny mom-boobs. In all seriousness, though, in 99℅ of cases, you can't see any more breast than you would if wearing a bikini. And yet, we don't shun the beach for fear of perverts with cell phones, right?","commenter_a":"There is a big difference between how breastfeeding is depicted here and what the majority actually look while breastfeeding in society. , Here its done Discreetly and beautifully, If all women breast fed like this NO one would have issues with it,","post_message":"'Let's support mothers to breastfeed anytime, anywhere.'"},{"comment_id":"968715303188218","commenter_b":"There's a problem with this ???? Just a couplah boyz havin' some fun !!!","commenter_a":"Now thats how you settle a score without using violence. !","post_message":"This is NOT what fireworks are for"},{"comment_id":"10153632735051636","commenter_b":"'@username typical this comes out after assignment submission","commenter_a":"Just wondering how many u turns this is now ?","post_message":"A good day to bury bad news"},{"comment_id":"10156869276120725","commenter_b":"Thank you Wisconsin! #TRUMPTRAIN #makeamericagreatagain","commenter_a":"The era of appeasement is coming to an end! They are only making the majority stronger and more galvanized than ever! All are welcome on the Trump Train - GO TRUMP!!! #Trump2016 #TrumpTrain","post_message":"THANK YOU, AMERICA! I love you!"},{"comment_id":"10155352061210597","commenter_b":"While I'm not a fan of the president either, I'd like to point out that a terrible congress is not a reflection of the president. That is a reflection of voters failing to elect officials who actually do their job. Our government was originally structured in order to make congress the most powerful branch. Unfortunately, modern Americans think the president holds all of the power and are far too ignorant of what their congressmen are doing. Despite an approval rating below 40%, reelection rates within congress are still at 96%. That is your problem, not the president. Granted, Obama doesn't really help matters, but even as a republican I must concede that it isn't ALL his fault, and quite honestly regardless of the fact that he is a poor president there are no grounds for impeachment.","commenter_a":"Why don't you impeach this man. History is going to show this congress as the most inept and corrupt congress in history and is being complicit in the destruction of our country by inaction","post_message":"Mandatory voting? 'The president whose major policy achievement is mandatory health insurance thinks maybe voting should be mandatory, too.' What do you think?"},{"comment_id":"1629939420634866","commenter_b":"I agree with Trump. YOU WANT TO SELL IT HERE,THEN BUILD IT HERE!","commenter_a":"Protectionist policy won't work. America is not making any friends with actions like this. Don't buy American will soon be the global response.","post_message":"Checkmate!"}]
