[{"comment_id":"10153950458738690","commenter_b":"Actually another problem is that we have a long border with Afghanistan which is called Durand Line and Afghanistan does not accept it as an International Border and those terrorists move in between both countries and attack and then we blame to each others.","commenter_a":"This the same Pakistan my country Nigeria, training army to fight terrorism, have Pakistan already solved there Taliban terrorist? Terrorist are political party, negotiations is the solution to terrorism.","post_message":"At least 12 dead as suicide bomber on a motorbike crashes into government office."},{"comment_id":"1861987967361615","commenter_b":"This woman is sick!","commenter_a":"PLEASE FRY THIS RAPPER!","post_message":"*** Sarah Palin is About to Teach Rapper Azaleia Banks the Lesson of a Lifetime ***"},{"comment_id":"10153319556628352","commenter_b":"She's got meth face.","commenter_a":"Fuck y r sum moms like dat not fair for children they deserve better","post_message":"Mother arrested for child neglect after her young daughters traveled barefoot trying to sell their toys door to door as she slept"},{"comment_id":"10152694335031094","commenter_b":"^Calls other women whores^","commenter_a":"Anti-science lunatics...UGH!!!!!!","post_message":"The federal government has confirmed more than 100 people across 14 states have now developed measles. Will state governments respond by rescinding personal belief exemptions for parents who choose not to vaccinate their children?"},{"comment_id":"1085736288142060","commenter_b":"Crazy woman!","commenter_a":"So sick of these lifer politicians & their lies.","post_message":"Nancy Pelosi's pointing fingers (again)...."},{"comment_id":"522407631280177","commenter_b":"Translation: her vagina scares me.","commenter_a":"Maybe it is because Hillary Clinton is just plain unlikable. I am not a Trump fan but will hold my nose and vote for him over her. Her voice scares people, she just can't connect with anyone. She is the female John Kerry.","post_message":"Hillary Clinton and Democrats think  or hope  that once the primary wraps up, tensions will subside."},{"comment_id":"10152946576794099","commenter_b":"doesnt matter, she is still an adult","commenter_a":"i worked the front desk at a college dorm and i cant tell you how many times ive had mommy's call and ask me where their child is because they didnt answer their phone. shes 19! give her a break.","post_message":"A Connecticut teen who was reported missing after going out with a man she met online has been found safe, police say @webpagelink"}]
