[{"comment_id":"10154373369462042","commenter_b":"I like Hillary. Good luck Hillary","commenter_a":"Love and support my President and #ImWithHer...","post_message":"President Barack Obama and Hillary Clinton make their first joint campaign appearance in North Carolina."},{"comment_id":"10153445603501051","commenter_b":"If I was the Dad I would be the one in jail...I would had killed that bitch over and over again","commenter_a":"Sorry if I was dad he wouldn't be in Jail he would be in the ground dead!","post_message":"When the boy's 11-year-old sister saw what was happening, she threw herself at the attacker and screamed for her father. But at that point it was too late."},{"comment_id":"818351058200569","commenter_b":"If he is here illegally, he should return home and come back through the front door!","commenter_a":"quality I would most like to magnify in human race is empathy. It brings us together in a peaceful, loving state, A very wise and educated man say it.","post_message":"New Latthivongskorn was brought to the United States from Thailand when he was 9 years old. New grew up in San Francisco, California, became an excellent student, and dreamed of becoming a doctor. A month after New graduated from Cal-Berkeley with honors, a 3.7 grade point average, and a major in Molecular and Cellular Biology, President Obama established the DACA program. DACA has allowed New to begin medical school and pursue his dream of becoming a doctor. New and other Dreamers like him have so much to contribute to our country. But if the Republicans have their way, New will be deported back to Thailand. Let’s remind them that #DACAworks."},{"comment_id":"10153815263206336","commenter_b":"Don't let illegal immigrants hijack the Democratic Party!","commenter_a":"Kinda trashy.","post_message":"Did this video go too far?"},{"comment_id":"10153081593500090","commenter_b":"She is also a terrible so called human being !","commenter_a":"esta esta mas choteada que cantante desafinado","post_message":"She may be hiding emails, but there's no hiding this fact: Hillary Clinton would make a terrible president.  Tell us WHY you don't want another Clinton in the White House: @webpagelink"},{"comment_id":"10153479315413984","commenter_b":"2 wonderful women !!! just shoot me now....","commenter_a":"Thank you Bristol ! Well said. We all need to start standing up to these people.","post_message":"BOOM! Bristol just dropped a major truth bomb on Miley, and there's NO way she can argue the young Palin's point...  Do you agree with what Bristol Palin said here?"},{"comment_id":"10153277275566336","commenter_b":"Thugs!!! This has got to stop!","commenter_a":"Breaks my heart!","post_message":"Omaha, Nebraska police officer Kerrie Orozco was killed in a shootout a day before she was scheduled to go on maternity leave."}]
