[{"comment_id":"10154177327588984","commenter_b":"Don't want her anywhere near the White House.","commenter_a":"Lies more lies everytime she opens her corrupted mouth","post_message":"Hillary's campaign is once again doing damage control...  Is Hillary Clinton one of the last people you'd want to become president?"},{"comment_id":"1515340161809773","commenter_b":"Well... he lost the popular vote, so that's clearly not true. But you're right, Bernie supporters should feel cheated.","commenter_a":"Obviously people approve of Trump more then Hillary 🤗🙃 Let's be honest he won because of crocked Hillary's disapproval. Bernie supports should feel cheated... he'd be the next president if she hadn't been the democratic candidate.","post_message":"Do you approve of Donald J. Trump?"},{"comment_id":"10153867280412377","commenter_b":"When illegals, dead people and multiple pollers etc, wait c and see how it goes, did the blm intimidate or black panthers block door or maybe machines were screwed up again Save your voting receipt just incase","commenter_a":"Donald Trump has 0% chance of winning the election. Gary Johnson 2016","post_message":"Pete Hoekstra to Newsmax TV: Trump reserved the right to reject. Watch coverage on @webpagelink"},{"comment_id":"943670819034115","commenter_b":"lol..that is a joke...that skank aint pretty at all..not cause her skin color..its because shes ugly..Id rather hit precious","commenter_a":"She is the most racist, evil, conniving bitch to ever be in the white house! With her 22 'assistants'! And you know most of them are probably white so she can treat them like slaves!","post_message":"Americas Freedom Fighters"},{"comment_id":"10153600714709087","commenter_b":"This lady represents Trump.","commenter_a":"Good! Pepper spray the idiots! There's a difference between protesters and violent rioters! Stand there with your picket signs! And speak your mind but stay out of an arena full of supporters who came to hear Trump speak! This is a travesty of the 1st amendment! No one in the media even shows and exposes the idiocy and rhetoric espoused at BLM movements where they threaten to assault or kill police! Or threaten and degrade black officers maintaining the peace. This is ridiculous! All of these protesters won't have enough time to protest when Trump is in office because they'll be put back to work!","post_message":"#BREAKING: As Donald Trump comes under fire for escalating violence at his rallies, video shows police in Kansas City, Mo., using pepper spray against protesters. WATCH:"},{"comment_id":"981969021843756","commenter_b":"Republicans want to end abortions so that they will have more population to draw on for their future wars. Think about it: End abortions, brings on many children that the parents can't care for (likely because of finances). The child likely grows up in poverty, being told (by the same people that ended abortions) he/she is a leech on society (parents likely getting assistance), so that child will grow up and most likely do one of two things (a few will take a different path, of course). 1) begin a criminal career 2) join the military to be fodder Republicans want to abort YOUR children when they are adults....THAT is why they want to end the termination of unwanted pregnancies.","commenter_a":"Attack on women!!!!! All you saying baby killers start adopting them then...start helping poor young women survive during pregnancy and after child is born, start fighting for wic, head start, etc...how many severely disabled children have you adopted? Big mouths refuse to help real babies only care for fetus","post_message":"Every child is a gift from God.  That's why the House just passed some of the most pro-life legislation to ever come before Congress – banning abortions after 20 weeks."},{"comment_id":"10154061115835530","commenter_b":"Someone blow smoke in this chicks face please","commenter_a":"Gross. Second hand smoke from cigarettes is disgusting enough, I get to choke on obnoxious people's vape fumes everywhere, and now we can add weed to the mix. Wonderful.","post_message":"Introduced by state Sen. Coleman A. Young II, D-Detroit, the bill is being called the “non-medical marijuana code.’’"}]
