[{"comment_id":"959701630828566","commenter_b":"Joel Mata 😂","commenter_a":"Jasmine Lopez","post_message":"Smh! #WSHH"},{"comment_id":"1115675945183452","commenter_b":"Your the one that is shaming Donald @username, you have found him guilty in public opinion.","commenter_a":"I don't believe her! She said it went on for 15mims, could have done something to stop it in that amount of time, and in a plane at that.","post_message":"Jessica Leeds said Donald J. Trump kissed her \"wherever he could find a landing spot\"  @webpagelink"},{"comment_id":"10152624556380667","commenter_b":"He was a true man in every word about iranian government. Thanks Mr President","commenter_a":"America gives you billions, trillions over time and when you include weapons, Iron dome, etc and America does it while American children and American poor struggle and as America infrastructure crumbles, really?????","post_message":"Israeli Prime Minister Benjamin Netanyahu pleaded with Congress  on Tuesday to take a harder line against Iran, saying the nuclear deal being negotiated \"doesn't block Iran's path to the bomb; it paves Iran's path to the bomb.\""},{"comment_id":"10153526527726770","commenter_b":"What a buch of sissys can't block it","commenter_a":"It is this lack of backbone to do the right thing that is causing people to be so angry at the establishment! Stand up and be counted! You might be surprised at the response!","post_message":"A former Delta Force commander,says President Obama is letting terrorists flow across the U.S.-Mexico border --- and that Republicans are too \"paranoid\" to stop it."},{"comment_id":"10155173773771320","commenter_b":"Barbie has Ken what's the difference....","commenter_a":"Good grief!! My oldest granddaughter collected them, but this is plain stupid! Why don't you make an American Boy series???","post_message":"Big news in the world of toys. One of the newest American Girl dolls is... A BOY! It is the brand's first boy character. He is a drummer in a Nashville band. Thoughts? @webpagelink"},{"comment_id":"971252449561175","commenter_b":"Hat's off to this chick!!!! Good for her! To bad she didn't kill the s.o.b.!","commenter_a":"Well done! I would want to do the same thing. These perverts cannot be rehabilitated.","post_message":"The woman took matters into her own hands when she caught  her boyfriend trying to sexually assault a 12-year-old -- by running him over with her car. >> kiro.tv/RunOver  She, and her boyfriend, were arrested."},{"comment_id":"10154550046141037","commenter_b":"Bring them here, give them free stuff and they will be lifelong democRAT voters.","commenter_a":"So ...basically illegal immigrates are ok by her standard?","post_message":"The 730,000 young people brought to the U.S. as children without legal status are prohibited from voting, but they are still a powerful political force."}]
