[{"comment_id":"898221040294675","commenter_b":"Kill the mother fucker","commenter_a":"I would put a shotgun up his ass and let the trigger fly!","post_message":"Multiple Choice Quiz time, kiddies. I chose option 'C'. What about you? @webpagelink"},{"comment_id":"10153967226386756","commenter_b":"Don't they have strict gun control laws? The criminals don't follow these laws? Shocking!","commenter_a":"Here are the huge protests over this? Why is the black community not absolutely outraged by this?","post_message":"These stones are a handful of those youths killed in Chicago. Diane Latiker of Kids Off The Block, Inc. (KOB) is trying to keep more names of children off the wall."},{"comment_id":"1813322542237935","commenter_b":"Then what makes her capable of running our country","commenter_a":"Mrs Magoo👹","post_message":"Hillary Clinton tells the public: Don't bring up my health! Then she tells the FBI: My health kept me from remembering the answers to your questions!"},{"comment_id":"10154312646744726","commenter_b":"For those confused about how an attack like the one in Orlando, Florida, could happen, I'll try to catch you up: Barack Obama's #1 goal has been to turn this nation into an Islamic wasteland. To that end, he appointed Hillary Clinton to be his dirty-dealing Secretary of State, in order to funnel military grade weapons to a then very inchoate ISIS. Hillary Clinton decided that it was appropriate for her to set up a fake Canadian charity, the Clinton Global Initiative, so that she could accept donations from dangerous nations, in return for personal political favors from the Secretary of State. This is the very definition of treason. However, Hillary didn't want anyone to have a paper trail of all her crooked dealings, so she set up a private email server in an attempt to thwart Freedom of Information Act requests. Barack Obama is now protecting Hillary, because he's ...","commenter_a":"It's truly disgusting and disturbing to use a massacre to push a political agenda. It was an Islamic terrorist attack now it's been used by democrats for an anti gun campaign, sickening.","post_message":"Liberals immediately urge gun control measures as terror link emerges in Orlando shooting"},{"comment_id":"10154303703286178","commenter_b":"You sound like a feminist bro.","commenter_a":"So does this mean only woman can understand how to run a home ? What a CROOKED crock of chit HILLARY !","post_message":""},{"comment_id":"10153445338169170","commenter_b":"The best government is the least government!!!!","commenter_a":"Never","post_message":"Net neutrality regulations kick in today. ...So when has government regulation actually helped?"},{"comment_id":"10153135798986323","commenter_b":"oh no Claire Leivers you are being invaded by more vikings!","commenter_a":"Martin Theander ...thoughts ?","post_message":"A bridge too far?"}]
