[{"comment_id":"10153308958722411","commenter_b":"Beyonce ruins everything!","commenter_a":"Blah","post_message":"What did you think of the Super Bowl 50 Halftime Show? Highlights: @webpagelink"},{"comment_id":"1785689904981470","commenter_b":"I'm considered a minority, but I will NEVER support a lying pandering corrupt person no matter the gender. Many of us are onto her regardless of her pandering. I hope that bottle of hot sauce that she carries in her bag at all times, helps her because she's going to need it. I'm happy she dodged sniper fire in Bosnia, but at this point, \"What difference does it make?\"","commenter_a":"Women and minorities will elect Hillary. We do not need an inexperienced, ignorant, unpatriotic misogynist as President. He isn't even familiar with the Constitution or how our system of government works and he is a horrible human being who brags about not paying taxes, crushing small business, defaulting on loans and being sexually attracted to his daughter. It is hard to imagine someone less qualified being nominated but then he ran against a group of people without a clue.","post_message":"After their hard-fought primary battle in 2008, President Obama asked Hillary to serve as his secretary of state. Here's what foreign policy experts and world leaders think about her four years as America's chief diplomat:"},{"comment_id":"1192453620787838","commenter_b":"Pitiful female !","commenter_a":"She's not the teacher she could be a student","post_message":"The report said the teacher ended up having an abortion after she got nervous when Child Protective Services unexpectedly showed up at school in February to question her and the student about their relationship."},{"comment_id":"10154357996114203","commenter_b":"innocent guns. why do we ban drugs such as cocaine? if the entire responsibility is on the abuser","commenter_a":"line up Americans arguing what the definition of assault rifle is.","post_message":"Conan O'Brien: \"I am a father of two, I like to believe I have a shred of common sense, and I simply do not understand why anybody in this country is allowed to purchase and own a semiautomatic assault rifle. It makes no sense to me. These are weapons of war, and they have no place in civilian life.\""},{"comment_id":"1260728277356755","commenter_b":"Can we talk about your taxes Trump and some of your wife's well kept secrets since you are always pointing your finger at everybody else!!!","commenter_a":"Instance 302-A when Trump is actually projecting himself.","post_message":"\"She also lacks the mental and physical stamina to take on ISIS and all of the many adversaries we face.\" - Donald J. Trump questions Hillary Clinton's health"},{"comment_id":"470896363098657","commenter_b":"That's called free speech in Obama America. Sad. I would love to see them meet their maker. Hell is going to be a busy place.","commenter_a":"They will do anything to RUB their ideas into our faces. If your part of this just keep it in your bedroom(house). Enough is enough.","post_message":"This is INSANE!"},{"comment_id":"10153228594071615","commenter_b":"Does it involve SPIDERsSsssssss????","commenter_a":"What doctor would even do this?","post_message":"Are you afraid of spiders? If so, there might be hope for you..."}]
