[{"comment_id":"995165647267071","commenter_b":"Ignorant fucking racist bitch","commenter_a":"Today is the first time I listened to his so-called speech, I usually either hit the mute button or change the channel. I sat through his speech and was dumbfounded...The lies were spewing all over the place, he is such a narcissist and egomaniac I could not believe what I was hearing. I hope and pray that Crooked Hillary, the Benghazi Butcher does not get elected because if she does, we are in for four more years of the same!","post_message":"Simple question: Are you happy or unhappy with the way President Obama has responded to the Orlando attack?"},{"comment_id":"10153308267139641","commenter_b":"Give her a million and send her on her way.","commenter_a":"Probably be on ID How I almost got away with it","post_message":"Russia's richest man faces $7 billion divorce bill: @webpagelink"},{"comment_id":"10157704194035725","commenter_b":"MAKE SURE SHE HAS NO EAR PIECE IN HER EAR.","commenter_a":"Great show this morning!","post_message":"I am truly honored and grateful for receiving SO much support from these military leaders -- American heroes -- who have defended our freedoms. THANK YOU for your service and sacrifice, as well as your confidence in me to serve as Commander-in-Chief. #AmericaFirst!"},{"comment_id":"10152552248390736","commenter_b":"Obama doesn't want anything that will improve the country. It is against his plan for a Muslim takeover.","commenter_a":"Get started on the over-ride and start taking with the House to get this president impeached!","post_message":"The Keystone pipeline would bring a reliable supply of energy into our country – providing opportunity, creating jobs and lowering the cost to ship goods, products and crops. The idea that Congress is sidestepping the normal process is out-of-touch with reality. This project has been studied for more than six years and has been given the green light at every obstacle. Arkansans and all Americans can see that President Obama is the real hurdle to Keystone. I will continue to support this project, and I urge the Senate to quickly vote to override this veto."},{"comment_id":"1146187242090421","commenter_b":"Lordy...I'd wear that brownish ass out...then marry her!","commenter_a":"My opinion is that, it is not nasty, is just a big booty, so whatever.","post_message":"Big booty problems."},{"comment_id":"10154524451224885","commenter_b":"I will guess her assets will be liquidated to pay the girls back.","commenter_a":"Serial killer.... I called it the day it happened. I hope those little girls in Troy get a pay out from the insurance company for their mothers life insurance now!","post_message":"BREAKING: A prosecutor filed charges of first-degree murder and armed criminal action Tuesday against Pamela Hupp in last week's killing of Louis R. Gumpenberger at her home."},{"comment_id":"10154969761261509","commenter_b":"The same reason they have the Latin Grammys. When you are not represented in mainstream, you create your own.","commenter_a":"Imagine if there was a \"White Entertainment\" awards show, or a \"White Entertainment\" channel Oh the chaos Hypocrites","post_message":"Tracee Ellis Ross and Anthony Anderson's hilarious hosting, Beyoncé and Kendrick Lamar's surprise performance, Jesse Williams' powerful speech, and more from last night’s BET awards."}]
