[{"comment_id":"10155027451044411","commenter_b":"Boooo :) make them strong :) We kick your ass in Afghanistan... @username should respect other cultures and their traditions.. These Indian Muslims doing this due to their believes.. This is racism what is @username doing..","commenter_a":"What about you Russian whores bathing their babies in Ice cold water... shit heads @webpagelink","post_message":""},{"comment_id":"10153465142866037","commenter_b":"Regina just stfu. Idc","commenter_a":"who cares. its their country their rules. i dont see why people like to police other countries because they find their practices to be disgusting. no different than people consuming pigs, goats, cows and chicken. don like it? donate other possible food sources then. if not stfu","post_message":"\"There are all sorts of cultural norms about what you can eat; you eat turkey, so why are you trying to force us to not eat dog meat?\""},{"comment_id":"10153805413233352","commenter_b":"There is no such thing as going to far I would do the same shit....I'll kill a little bitch or nigga that lay a had on my child....no matter your age..or gender..daddy got your back....","commenter_a":"And???","post_message":"Shocking moment angry dad ‘tried to run over a group of teens for bullying his 13-year-old daughter’"},{"comment_id":"10154663245784657","commenter_b":"Who wants to watch a liar. He is so delusional, he should have been removed from office years ago. Except Congress has no spine !","commenter_a":"Heard one from this 'fella, you've heard them all !!! Only said \"I\" 84 times in this one, --- he's gettin' better ???","post_message":"Obama, the celebrity president, may not be as popular as he thinks he is."},{"comment_id":"1513700471996539","commenter_b":"I agree with a person that wants sources: he is right to ask for them. I did not give some simply because it would take too much time on my part to gather them (about the same it would take to do the research on CRS and FATCA's actual consequences). These are the keywords you want: FATCA CRS money laundering Nevada","commenter_a":"Jumping on the demonize Putin wagon eh, big surprise coming from vice. This has nothing to do with Putin, but I see his name a hundred times. Clearly this leak came from the u.s. How about the American banks laundering drug money, or the us govt selling weapons to drug cartels, or CIA plane crashing full of cocaine, or u.s Senator macconell s boat full of cocaine. Won't touch that, because that's actual truth, stay away from that. Just another propaganda outlet for the u.s government.","post_message":"The Panama Papers were a big deal."},{"comment_id":"1086698044698949","commenter_b":"THINK ABOUT THIS ,TRUMP SAYS HE'LL ADD A 45% TARIFF ON IMPORTS FROM MEXICO AND CHINA ,STOP MONEY TRANSFERS OUT TO MEXICO TO GET THEM TO PAY FOR A WALL ,WE EXPORT 236 BILLION A YEAR TO MEXICO IF WE ADD A 45% TARIFF TO IMPORTS THEY WILL DO THE SAME ,BOOM! THOUSANDS OF PEOPLE OUT OF WORK !! CHINA IMPORTS 116 BILLION FROM AMERICA INCLUDING ALMOST OUR INTIRE CROP OF SOYBEANS ,WE MESS WITH THEM THEY GO SOMEWHERE ELSE ONCE AGAIN FARMS SHUT DOWN, FARM HANDS OUT OF WORK .WE'RE TALKING 1930'S STYLE DEPRESSION.WHY ?..........DONALD TRUMP WE IMPORT MORE FROM MEXICO THAN WE EXPORT TO THEM TRUE 5 BILLION A YEAR IS DIAMONDS AND PRECIOUS METAL,14BILLION A YEAR IN OIL,AND 11 BILLION A YEAR IN FRUIT,NUTS AND VEGETABLES ,YOU WANT YOUR FOOD AND FUEL COST TO GO UP 45 % IT WON'T BOTHER TRUMP HE'S WORTH 10 BILLION","commenter_a":"Our current administration is a joke. They have been living off of the tax payers for years without one concern for the US Citizens. People, wake up. Take a good long look at your life, are you living better now or five years ago? or even 10 years ago, Is your income the same, are you now needing to work 2 jobs just to make ends meet. People, we are now competing with our teenagers for the jobs we held as teenagers to learn responsibility just to make ends meet. Wake up people, I don't think this is what our parents believed was the American Dream. And we certainly aren't living better than they did. Think long and hard about your future and that of your children and the generations to come, will they have a FUTURE!!!!!!","post_message":"Whoa!! Do you still support Trump?"},{"comment_id":"10153124217341051","commenter_b":"Ive seen women pulling crap everything from getting a friend to flirt to wrecking a guys car.Stupid and insecure....","commenter_a":"she was watching too much titanic","post_message":"This woman wanted to test her boyfriend's love for her by climbing over the railing on a cruise ship to see if he'd come to her rescue. You can probably guess how that worked out."}]
