[{"comment_id":"937143676339798","commenter_b":"And deport a politician who supports closed borders for every American murderer.","commenter_a":"Excellent .","post_message":"LIKE and SHARE if you agree...  100percentfedup.com"},{"comment_id":"10154303589011051","commenter_b":"Immigrants are always welcome, if they come legally and come to be A PART OF AMERICA. If they come to just spread their own countries ideals that conflict with the ideals of the USA, then why come at all? As for who said anything about Sharia Law...that is one of the biggest current issues with immigrants going to the US. They believe in it. They shouldn't be in our country if they do.","commenter_a":"What a wonderful way to make immigrants feel welcome (ps: that's sarcasm) or perhaps immigrants aren't really welcome? In your hearts do you hate people who haven't been born here or speak with an accent or celebrate holidays differently than you do? Whatever happened to 'We hold these truthes to be self-evident- that ALL men are created equal.'? Or do we really mean all white northern European men are created equal?","post_message":"Do you agree or disagree with this Theodore Roosevelt quote?"},{"comment_id":"1355437474524022","commenter_b":"Open season. Was Michelle off limits for you? No? Then neither should this ex porn model.","commenter_a":"Funny, not funny.... Who's paying for the wall? Mexico Mexic Mexi Mex Me.","post_message":"Today we celebrate one week since making history with the swearing-in of President Donald J. Trump and Vice President Pence! Watch the unforgettable inauguration:  @webpagelink"},{"comment_id":"10156057396095551","commenter_b":"Everybody knew that! No way does a great 5 yr old know anything about imigration. This was a liberal setup!","commenter_a":"The Mexicans played a dirty trick on On the Pope. Perhaps they will be rewarded in hell.","post_message":"I KNEW there was something fishy about this..."},{"comment_id":"10152767737561636","commenter_b":"I'd happily punch her lights out, evil witch!!","commenter_a":"Hunt without a rifle. Even it up a bit.","post_message":"She has said she will 'never apologise' for being a woman who hunts..."},{"comment_id":"10153428324682293","commenter_b":"Yes but she identify as female sexually fluid","commenter_a":"My daughter is sexually fluid, she identified herself as a lesbian during high school years and she wasn't allowed to have girls sleep over ( unless they were childhood friends), my other two daughters were not allowed to have teenager males sleeping over.","post_message":"'I wouldn’t have dared bring a boy into my room while I was in high school. Do the same house rules apply to same-sex relationships?'"},{"comment_id":"10152660171235950","commenter_b":"My favorite science fiction tv show and movies i like them all i grew up watching Star Trek Spock was my favorite","commenter_a":"I have been and always I shall be your friends. Star Trek II.","post_message":"What's your favorite 'Star Trek' moment involving the Enterprise's chief science officer?"}]
