[{"comment_id":"382025331922062","commenter_b":"When pigs fly","commenter_a":"Yes","post_message":"Is this good or bad news for the GOP?"},{"comment_id":"1053645448090460","commenter_b":"Jihad Malik ..get off this post ..your mama was stupid for making you","commenter_a":"Why don't you post a story of the anti Semites throwing people off of buildings in the countries surrounding Israel....they are the people you should be fearing and writing about ...The JP has joined the Shrillary camp","post_message":"Schmitz has called the accusations defamatory, but reports of anti-Semitic tendencies at the top of the Trump team reinforce the narrative."},{"comment_id":"712967945491547","commenter_b":"Gals, you are missing the point.The birds ARE god","commenter_a":"Tom Beyer","post_message":"One of the prettiest scenes we've ever seen: A flock of starlings form spectacular flyover in Israel's sky (Video: Reuters)"},{"comment_id":"10154265565576130","commenter_b":"@username ummm no! You assume we are stupid I guess because not voting is the equivalent to helping trump win! I might not like Hilary's ass either but I won't be sitting around wondering if the bitch is going to blow the country up like her opponent would if he doesn't get his way like a two year old!","commenter_a":"You realize the black vote is staying home right? Nothing screams white privilege more than hillary's ability to skirt laws and get away with it. A black man would be doing 25 to life for the crimes she has committed.","post_message":"Here are all the dumb things Donald J. Trump said about race at the first debate. Sorry in advance."},{"comment_id":"10154815795872936","commenter_b":"Maybe Canada would take us. They always wanted the Pacific Northwest.","commenter_a":"The rest of the country is dragging California down.. do we really have to be in the same union as knuckle draggers Mississippi, Kentucky, West Virginia, etc.? I'm beginning to agree that California should secede, go our own way.","post_message":"Gov. Jerry Brown's fiery take-down of Donald Trump: \"We've got the scientists, we've got the lawyers, and we're ready to fight.\""},{"comment_id":"475003736018845","commenter_b":"He SHOULD WORRY ABOUT DOING HIS JOB! ALSO, STOP BEING A RACIST @webpagelink","commenter_a":"Thank you Mr President for being the last President w class and dignity. Im very pleased w what youve done thats affected my life these past 7 years. Too bad Congress coukdnt back you more.","post_message":"Extreme voices in the Senate shouldn't stand in the way of a fair hearing for the next Supreme Court nominee. @webpagelink"},{"comment_id":"10153786734045329","commenter_b":"Hahahahahahaha!!!! Omg!!!! It's like we're on the Truman Show!!!","commenter_a":"@username!!!! Holy moly!!! Lmao","post_message":"\"If we're still single when we're both 39, can we have babies together?\""}]
