[{"comment_id":"1124947717560231","commenter_b":"Hurry up woman!!","commenter_a":"Alright, that's it...we're moving to Colorado. @username","post_message":"It is absurd that here in America, we remain the only major country on earth not to guarantee health care to all people. If this proposal for universal health care can win in Colorado, I believe it will spread around the country."},{"comment_id":"10157152156085354","commenter_b":"BUILD THAT WALL!!!","commenter_a":"I hope he is the first to meet with them. He will only make the news one more time.","post_message":"WOW"},{"comment_id":"785168271673750","commenter_b":"These BUTTs ( Bad Uncivilized Terrorist Thugs ) are just showing what they are, BUTTs, they are just showing their colors, this is a sign of ignorance. If this people would listen to intelligent people they would know that pants up don't loot is the best way to go.","commenter_a":"If they want to look like idiots....it's their choice....there are other more pressing issues that is worrisome !!!!","post_message":"Louisiana Passes New Law That Will Fine Anyone Wearing Saggy Pants.  This is amazing. It should be a law in all 50 states.  Do you support this new law?"},{"comment_id":"10153735112473984","commenter_b":"No joke you heathen bitch.","commenter_a":"Let's make an example of liberals and nonChristians by getting rid of them permanently. Bullets are cheap.","post_message":"For Kim Davis, this is Day 5 of her incarceration - but her lawyers just made an announcement that could turn things around.  Do you support Kim Davis?"},{"comment_id":"431964536928587","commenter_b":"Sluts should be treated like people. So that's fine if you treat a slut \"like a slut\" as long as you consider them people and treat them accordingly","commenter_a":"I don't understand the negative stigma behind girls being sluts. God Damnit, Men love sluts.","post_message":"Regardless of what a person wears, they are worthy of your respect."},{"comment_id":"10153081622630329","commenter_b":"Yeah because all Muslims are terrorists....you absolute dickhead","commenter_a":"I've been saying this for many many years now and this just proves me right. Especially after 911 we should have turned that entire part of the world into a sheet of glass. The women breed them, the kids are trained like them and are used as mercenaries. KILL THEM ALL. There are to many to sort out and sift through to decide who's good and who's not. Point blank end them all.","post_message":""},{"comment_id":"10153521099233010","commenter_b":"save your water for your illegal aliens...smfh","commenter_a":"Typical republican: \"entitled\".","post_message":"More than a dozen times, a white truck filled up at a Thousand Oaks hydrant and hauled the water to Selleck’s 60-acre ranch in Westlake Village -- court documents allege."}]
