[{"comment_id":"10153678323388908","commenter_b":"Interesting - are Israelis more tightfisted than racis","commenter_a":"Luisa","post_message":"A cafe in Israel has decided to give a 50 percent discount to tables mixing Jewish and Arab diners, in an attempt to ease racial tension..."},{"comment_id":"10153968461605579","commenter_b":"Absurd! There are 50 muslim countries to accept muslim refugees!","commenter_a":"You know why I support the Syrian refugees coming to America? Because I'm not going to let the terrorists dictate my beliefs, ISIS doesn't scare me. What scares me is that we, Americans, are losing our sense of direction. I've thought about this refugee crisis for for quite some time now, if you don't believe me ask the Marines who I taught about the Syrian civil war in 2012. I've been aware of this conflict for quite awhile now, while the rest of the world turned a blind eye. Islamic extremists aren't going to scare me and they are not going to change my way of life or thinking. I am an American and I cower to nobody. When I see people fleeing danger I want to help, we as Americans want to help. If you turn away women and children fleeing death and destruction because of terrorist attacks then ...","post_message":"Should the U.S. accept Syrian refugees?  WATCH: U.S. House debate on #SyrianRefugees  LIVE on C-SPAN @webpagelink    WATCH: House Judiciary Committee SubCmte hearing on #SyrianRefugees,  LIVE on C-SPAN3 @webpagelink    Senate Homeland hearing on #ParisAttacks  LIVE at 2pm ET on C-SPAN3 @webpagelink"},{"comment_id":"1850656938526347","commenter_b":"Good put her away . Let her spend her millions on appeals .","commenter_a":"They should!!!!!","post_message":"My, my, my..."},{"comment_id":"530887710369602","commenter_b":"fuck that cunt","commenter_a":"'@username explain this","post_message":"Thoughts?"},{"comment_id":"10153229519907377","commenter_b":"sick of protesters .come to our country and complain ,get them back to the life they love","commenter_a":"Who let the trash in in the first place ?","post_message":"'There is hatred against us that is unbelievable,' Trump told the rally, according to CNN, after Hamid and several others were ejected."},{"comment_id":"867191473393219","commenter_b":"'@username illegal. Get ready to be deported or just leave. Leech","commenter_a":"I am not even American, i live in New Zealand and i support @username. Long before Trump ran for president i believed he is the man for the job. Smart, strong, dedicated and beyond all else brave enough to stand up for his vision and commitment, if anyone has what it takes to make change for the better it is Donald Trump. From all the way here in New Zealand - i have confidence in Donald Trump to clean up and create change. THANK YOU!","post_message":"Thank you FLORIDA! #VoteTrump on March 15th! #MakeAmericaGreatAgain"},{"comment_id":"1135264553151680","commenter_b":"Only you idiot liberal want these invaders here... Morons","commenter_a":"But who would want to live there? Especially a refugee, who will be treated worse than they treat their own minorities and poor (which is pretty terrible).","post_message":"Fact check."}]
