[{"comment_id":"1695225903839696","commenter_b":"Oh that won't be left leaning or anything....","commenter_a":"Didn't know 60 minutes was still on","post_message":"You get a story. And you get a story."},{"comment_id":"1033897839973602","commenter_b":"God bless you and your mommy","commenter_a":"Welcome little one","post_message":"Do you remember our story of the pregnant woman who was carjacked on the way to the hospital?  Story --> @webpagelink Well, she had her baby yesterday. Help us in welcoming the adorable Malcolm."},{"comment_id":"10153502951211336","commenter_b":"Anyone who votes for her does not have a brain!","commenter_a":"She will be the next president","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153738419359062","commenter_b":"How about we stop the meth, heroine and cocaine on the streets?","commenter_a":"There's go's the neighborhood","post_message":"Not just limes in the back of this truck!"},{"comment_id":"10157626698695603","commenter_b":"Stupid woman needs to be arrested .","commenter_a":"Thank God someone called the police and didn't just stand around videotaping it.","post_message":"Thankfully, the cats were not injured during the rampage."},{"comment_id":"1068442033272574","commenter_b":"If they don't like this country they should leave. Why don't they each donate a couple of million each to some of these black communities that need the money to make things better. They won't because they are talkers not doers.","commenter_a":"If the Giants do this I will give up my Tickets","post_message":"#BoycottNFL is gaining MASSIVE momentum online. Fans are FED-UP and FURIOUS with the anti-American hatred NFL players are increasingly showing.  Let's get 5,000 SHARES and LIKES to Boycott the NFL!!!  @webpagelink"},{"comment_id":"10153206999136336","commenter_b":"I love it. She should have her wooden spoon with her","commenter_a":"She is going to be arrested. She beat him that is abuse. Some Social worker will have her arrested.","post_message":"'So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.' – Ruben Navarrette"}]
