[{"comment_id":"10153021829314712","commenter_b":"If you thought my tone was rude then you should not have replied to me with a lecturing tone. Because clearly you thought that was productive.","commenter_a":"Lauren it isn't dumb and you are rude... I am married 17 years to a bus riding bike riding no driving city worker here in Baltimore and he has made the same observations..riders... walkers..and especially drivers need to do a better job observing traffic laws...but your tone and answer is counter productive..have a safe day and as the Irish say.... Safe home","post_message":"Commentary: Car-centric systems cost lives, and diminish quality of life."},{"comment_id":"485707381619842","commenter_b":"Shariah Law is \"TORTURE OF WOMEN\". It demands that women be covered from the top of their heads to their toes. HOW STUPID is that. But this is just a small portion of the TORTURE. We are America. We will NOT HAVE SHARIAH LAW. BB","commenter_a":"No sharia !!!!!!!!!!","post_message":"Enough is enough. It's time we as Americans stand up and say 'NO' to Shariah Law. Spread the word and SHARE, we need people aware of radicals in this country. Do you agree Shariah Law should be banned from America?"},{"comment_id":"10153318242754087","commenter_b":"I'm not a gynecologist, but I know a cunt when I see one.","commenter_a":"Bernie doesn't accept SuperPAC money, yes, which is very honorable. But he still takes money from unions. Trump is the only candidate who is self-funding his campaign.","post_message":"“I’m voting for Bernie Sanders, because he doesn’t take any corporate money,” said undefeated UFC champion Ronda Rousey. “I don’t think politicians should be allowed to take money for their campaigns from outside interests.”"},{"comment_id":"1414587195226950","commenter_b":"2 all the women in pink why not just pack up ur pink panties and move 2 Cuba now that we have relations again I hear it's a paradise.","commenter_a":"GROW UP","post_message":"Female supporters of President Donald Trump aren’t sure why the Women’s March was necessary."},{"comment_id":"486656498389047","commenter_b":"Fuck the fist wtf she got on the left beside the fist!!!? DAMN","commenter_a":"Asking for head. You know all those been about 12\" deep","post_message":"What you doing fellas?????? #WSHH"},{"comment_id":"10153700802697235","commenter_b":"Untrue. Unfair. The DC snipers were/are referred to as mentally ill, not as \"thugs.\" I can't think of another black mass shooter offhand. Most U.S. mass shootings are either non-blacks with histories of mental illness, or gang/drug related shootings committed by blacks.","commenter_a":"It's because he was white. That's why now it's about mental illness next week a black kid will be a thug or a menace to society","post_message":"This is a big lie we're always told so that we can avoid talking about the obvious -- GUNS."},{"comment_id":"10155463176480294","commenter_b":"Jordan Beier","commenter_a":"I saw about at two points when the injury could have happened (the roll, and when he was thrown out of the ring) and the dropkick could have finished off the injury but the way he was handled after the injury didn't help matters. According to the earlier reports he died at the hospital but he didn't look alive to me.","post_message":"When the bout ended, medical personnel transferred Aguayo to the hospital, where local media reports he was pronounced dead:"}]
