[{"comment_id":"10153083814076051","commenter_b":"Americans! Utilitarians. They have no use for you unless they can use you.","commenter_a":"@username said it all.","post_message":"This dog has one little deformity. Still, his owner decided it was just too much to deal with and opted to get rid of him."},{"comment_id":"10153231600851491","commenter_b":"Well the last 3 harry Potter movies should had been directed by a woman then","commenter_a":"thats not how sexism works. Sexism is if there are qualified female directors available to direct, and they choose to hire a less qualified male director. If there are no qualified female directors available thats not sexism","post_message":"Emma Watson: \"I have been directed by male directors 17 times and only twice by women.”"},{"comment_id":"10152771526960950","commenter_b":"She didn't tell people to do this so she isn't responsible for what happens. She is only on the show since her older sisters were in the lime light to begin with and then as she got older she got in the light! It's not her fault these girls are dumb af!!! She paid money to get filler in her lips she didn't suck her lips into a bottle!","commenter_a":"I know kids who have done is following that crazy K lead. She should be held responsible if anyone becomes disfigured. Time for a public statement, Kylie.","post_message":"WARNING: Teens who participate in the #KylieJennerLipChallenge by suctioning their lips with a bottle or jar could be left permanently disfigured or deformed, doctors say."},{"comment_id":"10153400883926813","commenter_b":"@username SHE is a girl.","commenter_a":"I love this brave kid.","post_message":"Great victory today! Court rules in favor of our client, transgender student Gavin Grimm, in his challenge to Gloucester High School’s discriminatory restroom policies!  Watch Gavin's video where he stands up for students everywhere."},{"comment_id":"10153817887769203","commenter_b":"Michelle will body slam Barry!","commenter_a":"Coming from the first female POTUS this is funny. Obummer, you can't handle your own angry wife let alone Putin....get out of the White House you effeminate jackass","post_message":" can handle a bunch of CNBC moderators at the debate. Let me tell you, if you can handle those guys, then I don think the Chinese and the Russians are going to be too worried about you."},{"comment_id":"10153544587506350","commenter_b":"Real women dont need all that! They are content with the gift of life they just grew in their body for months!!!! This is a little overkill.","commenter_a":"Oh good grief...isn't the baby enough to show off? Must one be materialistic to have to have a push ring?","post_message":"Push presents (the bling or gift an expectant mom is given for, um, pushing) are getting more and more popular."},{"comment_id":"960118844029903","commenter_b":"Umar hayat, do u know people are injected with relegion, so they r blind what happent to u , u r a muslim and should not speak like this. See irain is only state which helps palsitane , a sunni state but our Arab the grand state of muslims is quite , wht does that mean. Leave blindness and b a responsible muslim","commenter_a":"which islamic republic ? Iran is a shia majoosi state dont use the name of islam with a sheetani state","post_message":"The Iranian president says the Islamic Republic will firmly deal with any acts of aggression: @webpagelink"}]
