[{"comment_id":"1765051320401865","commenter_b":"Trump gave a rousing speech to cheers and shouts. Just checked in at Fox programming and all they have is same regurgitated talking heads spouting how bad this last week has been. I'm sick of seeing same boneheads saying same thing EVERY show. ME TV reruns from now on!","commenter_a":"This is what the people want Trump any Republican that does not support him is not supporting the people of America who choose him","post_message":"\"In our shared mission to make America great again, I support and endorse our Speaker of the House, Paul Ryan.\"  Donald J. Trump endorsed Ryan at a rally in Green Bay, while also endorsing John McCain and Kelly Ayotte in their reelection bids, after earlier comments implying he might withhold his support."},{"comment_id":"10153722857026336","commenter_b":"How sad! God be with his family at this time.","commenter_a":"Who won the game ?","post_message":"17-year-old Evan Murray was a victim of internal bleeding caused by a ruptured spleen, an autopsy revealed Monday."},{"comment_id":"1144750032228005","commenter_b":"Here we have someone taking things just a lil too seriously","commenter_a":"\"Discovered\" more like created...","post_message":"Pokemon are a diverse class of creatures that were first discovered by Japanese scientists Satoshi Tajiri and Ken Sugimori in 1996."},{"comment_id":"10154502038936077","commenter_b":"There is no good reason to watch episodes I, I I, or I I I. They suck, and you know most of the back story just by watching the originals. Episode VII was a great movie and I imagine this one will be as well. The second set of three are trash.","commenter_a":"Daniel Roach","post_message":"Do you agree?"},{"comment_id":"520985371427355","commenter_b":"Come get it I live in bend oregon I will be waiting","commenter_a":"come and take it buckwheat","post_message":"They are demanding that we give them money for their ancestors slavery. 'LIKE' if you will REFUSE to pay slave reparations!!"},{"comment_id":"10153660324311491","commenter_b":"@username Girl, your HR prowess is EVERYTHING. Reading these comments with a cup of tea. *sips slowly*","commenter_a":"Earned the right to what? To throw a tantrum and not show up for work? They did tell her but she did not like the news? When, how it was delivered? Kelly is not responsible for Michael's career! If she is acting unprofessionally and retaliating or is having behavior that is inappropriate in a workplace, the network will need to enforce the EEOC policies and review her contract for creating a hostile environment. The decision to move his day to depart is in everyone's best interest. Maybe after 26 years she should look for a new job, maybe advance herself too. She does not decide when any employee leaves. I now refuse to even watch this show anymore since the Kelly drama and I hope family and friends turn her off and let the network see who has the power to decrease ratings here! He's advancing his career period. If ...","post_message":"“I needed a couple of days to gather my thoughts. After 26 years with this company, I earned the right.”"},{"comment_id":"1349180015160531","commenter_b":"I'm guessing it won't be Christians?","commenter_a":"Now we know what iran is using all that money obama gave them for. Old Valerie has been running the government for some time. Once these nuts get you guns guess who will march in.","post_message":"In a sickening op-ed piece for The Huffington Post, Valerie Jarrett basically \"killed off\" her own grandpa in order to push for her agenda... GUN CONTROL.  This is absolutely revolting... take a look at what she did."}]
