[{"comment_id":"10153257961321162","commenter_b":"They should crucify her.","commenter_a":"Wtf people come on!!","post_message":"DEVELOPING: The bodies of two children, ages 11 and 14, were found dead in a freezer, and the mother is being held as a person of interest @webpagelink"},{"comment_id":"1056318254456150","commenter_b":"It's not an illusion. It's fact. Nothing like this has happened in 38 yr. Life comes with no guarantees. Accidents happen!","commenter_a":"Yeah, but I'm sorry . . . Disney has created this illusion of fantasy and safety. The illusion that one can experience fear and threat in a safe environment. In fact, they have made millions (billions) of dollars designed on that premise!","post_message":"\"This is Florida, and it's not uncommon for alligators to be in bodies of water.\""},{"comment_id":"10155151298004170","commenter_b":"@username And what disappointed me the most was our President never called for people to work together and come together as a Nation. It was like he wanted the divide! So sad for this nation!!","commenter_a":"I figured this out after his first term. If you believe the media, he did a great job. The numbers don't lie. He did zero except stir up racial divide. That is his legacy.","post_message":"Years in office: Eight. Years with GDP growth of 3 percent or better: Zero. The final report on 2016 seals his fate as a historic failure."},{"comment_id":"10153080181251519","commenter_b":"Like StepFord Wives.. Im ashamed that A Women could trash and allow other sisters to have their rights taken away!!","commenter_a":"How can these people especially GOP WOMEN accept that party????","post_message":"Megyn Kelly slams Trump for calling women ‘fat pigs,’ ‘dogs,’ ‘slobs,’ and ‘disgusting animals'... and he laughs -- and so does the GOP crowd."},{"comment_id":"1411220458918808","commenter_b":"I honestly think you just don't understand because you have never been through it. Hopefully you never will. It's a tough road as a parent. But My SON JASON is the love of my life!","commenter_a":"why do people with autistic children often talk about \"mourning the death of the child they thought they had\"?? its the same kid. we're not car accidents to be grieved over. we are people.","post_message":"Greg and Maya are doing everything they can to make sure their son with autism is safe, comfortable, and — most of all — happy. Parenting 2.0 | An Upworthy Original Series"},{"comment_id":"10153581173261337","commenter_b":"Get fucking jobs you fucking losers ass faggots !!!!!","commenter_a":"I'm pretty sure these people have more money than God! Please don't help them in there time of wrong doings!!","post_message":"DUGGAR DISASTER: After TLC cancelled 19 Kids and Counting, the Duggar family is asking for donations..."},{"comment_id":"10153278015134575","commenter_b":":) Exactly","commenter_a":"If you're going to do BUSINESS in a free society that is supposed to separate religious beliefs from law of the land then we must require you to be tolerant & serve anyone & everyone who walks through your doors. (Remember? Separation of church & state? One of our country's founding principles?) Besides-supporting intolerance & bigotry is an abuse of the word Christian. Jesus would not turn anyone away.","post_message":"\"If a gay couple was to come and they wanted us to bring pizzas to their wedding, we'd have to say no.\" An Indiana pizzeria finds itself at the center of the debate over the state's religious freedom law."}]
