[{"comment_id":"1569194983095765","commenter_b":"Immigrants need to assimilate","commenter_a":"I feel sorry for this woman, she is so ignorant. The capability of her brain being able to handle one language and one culture is probably the siza if a pea.","post_message":"A woman captured on video yelling racial slurs at a Spanish-speaking woman as they waited in line at a JCPenney store will be \"permanently banned\" from the mall where the incident took place once she is identified, Jefferson Mall officials say."},{"comment_id":"10153125857102994","commenter_b":"Just wondering if she is 13 or 14? Or is there 2 different shootings..? Because some sites says a different age than the others.","commenter_a":"Its called ignorance people. Doesnt matter if your black, white, asian or blue, these families live a life that involves violence, or may have experienced violence, try to take precautions to keep family safe but are ignorant to what \"safe\" really means. DPD can only do so much, with stupid people. Another tragedy, that will soon be replaced by another, unfortunately, probably by tomorrow evening. Stop the violence and ignorance everyone, and help save our children, who are the future.","post_message":"Police say no adults were home at the time. We'll have more @10 p.m."},{"comment_id":"10153957663196509","commenter_b":"i would run away too if rosie was my embarassing mother, RUN GIRL RUN......","commenter_a":"Gay parents would make any child go crazy!!!","post_message":"The 17-year-old had stopped taking medication for an undisclosed mental illness, Rosie O'Donnell said in a statement. @webpagelink"},{"comment_id":"952585388112135","commenter_b":"That is true @username however they will find no virgins on the other side.","commenter_a":"only way to deal with those ISIS thugs.","post_message":"“A tall bearded man emerged and drew a long knife...He began addressing the crowd and slapping the father and his son around the head and kicking them onto the floor.” That's when three shots rang out."},{"comment_id":"1689272294667942","commenter_b":"@username Bernie raises money for the party too! You didn't hear that right at all. None of Hillary's money goes to Bernie, that would be ridiculously counter productive. Duh! Both Bernie, and Hillary do raise funds for the rest of the Democratic party. This is done, to insure more Democrats get elected. That way we won't have another lame duck president. Bernie still as a very good chance, and with all the controversy, Hillary, and supporters, may have just crossed the line! Don't count chickens before they are hatched! Be ready to vote blue, no matter who the nominee. On that note, I'm voting for Bernie, it's the right choice for the majority of Americans. The wealthy don't mean a damn thing to me, as most of them feel the same about us.","commenter_a":"Wise words my ass. How can you even sit there and tell us to join together with the blatant fuckery Shillary Clinton is doing. The voter suppression. Not releasing her transcripts. Her lies. She's a corporate slug that doesn't even deserve to be in office or the government. She's as bad as the republicans. The worst part is she would probably lose to the republican nominee and y'all keep trying to shove her down our throat. What the hell are we voting for if the DNC is just gonna cheat us. Bernie or bust.","post_message":"Wise words from Robert Reich. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10156390568200354","commenter_b":"Then why has socialism worked anywhere ??????","commenter_a":"No.","post_message":"\"...the word ‘socialist’ has become a dirty word.\""},{"comment_id":"10157177074000354","commenter_b":"And she will continue where he leaves off","commenter_a":"We've had more terrorist attacks on our soil during the Obama administration than on GW Bush's watch. I think Obama is doing a fine job of recruiting terrorists.","post_message":"So the basis of Hillary Clinton's corrupt candidacy is that she is more popular with terrorists? WATCH:"}]
