[{"comment_id":"10153126028062235","commenter_b":"Shame on her !!!","commenter_a":"Oh please! Hahahahahah!","post_message":""},{"comment_id":"10156170333030354","commenter_b":"I think they just said on Fox and Friends he didn't want to go back to that school. They never reported any of this. The kids dad said he was not going back to that school and the president is involved so probably private school.","commenter_a":"The kid is probably probing...dont trust Muslims","post_message":"Have the media given you the police's side of this story?"},{"comment_id":"10154216444386350","commenter_b":"She should have been left the freak!!!","commenter_a":"After 30+ years of cheating and drugs nowwww she finds her inner strength?","post_message":"\"It right for me, because I honestly, at this point today, have no idea what I doing with the rest of my life.\""},{"comment_id":"10152954070746336","commenter_b":"She is an idiot","commenter_a":"More hot air.","post_message":"In a speech at the The Brookings Institution on Friday, Obama's National Security Adviser Susan Rice said while ISIS is dangerous, it is not a threat of \"existential nature\" like World War II or the Cold War. @webpagelink What do you think of her comments?"},{"comment_id":"10158515262905725","commenter_b":"Gomez u bitch u","commenter_a":"fukin who're","post_message":"All eyes were on Melania as she stepped into the ballroom."},{"comment_id":"10153190438888812","commenter_b":"Plus many red states consider sand and salt a slippery slope toward Socialism.","commenter_a":"All the Yankees talking about \"that isn't snow!\" Must not realize how right they are. It's ice. It's infinitely more dangerous and icy in the south than it ever gets in the north.","post_message":"WATCH: \"It's over\" -- Snow and ice are still triggering dangerous, cringeworthy conditions on roads in much of the eastern US, including this Huntsville, Alabama, neighborhood - ABC News Weather"},{"comment_id":"1675801449377863","commenter_b":"Better yet: Buh bye racist ahole!","commenter_a":"Buh bye, racist!","post_message":"Serves him right."}]
