[{"comment_id":"10155797026705354","commenter_b":"To someone above, I wash my own car. More Americans are growing their own gardens. I rarely go to hotels. Their whole argument is false though because we have had immigrant worker programs for decades. Obama is intentionally flooding the country with illegals. Read about George Soros and his open border group. The man is evil.","commenter_a":"We are the force that keeps the country afloat.\" is she for reals? we were floating right along wa before illegals came along.","post_message":"\"Mexicans, like all Latinos, contribute positively to this great nation. We are the force that keeps the country afloat.\""},{"comment_id":"10153121748346615","commenter_b":"Ok. Let them run free then","commenter_a":"Start turning in the shooters.... It's that simple","post_message":"A call for peace and justice: Coming up on Channel 11 News at 6, see how dozens of residents in Homewood held a rally to honor lives lost to violence in the city."},{"comment_id":"1684551998460631","commenter_b":"I am not an American, but I and we all are interested in your politics. Because we other part of the world are concern for peace and prosperity. And Why so much hate? Why so many wars? Do you think that is the solution? What is the meaning of diplomacy for you guys? Is it only war? Do you think that in this 21st generation you are again doing politics for religion ? And certain race? Is that how you want to see American politics ? How come you think Obama foreign policy is miss leading you guys? Do you got the proper answer? He talks about climate change, which is happening and strongly scientist also believe that, he try to bring your army back in your country from Iraq and afganishtan, he shown us that diplomacy and foreign policy is not only about to hate and make enemy. He ...","commenter_a":"Trump doesn't back down from our enemies Obama. You are nothing but a coward. Your nuclear and foreign policy has only weakened us, and made it easier for Iran and ISIS to kill us.","post_message":"Speaking at the close of the Nuclear Security Summit, President Obama said Donald J. Trump's nuclear comments show he \"doesn't know much about foreign policy or nuclear policy or the Korean peninsula or the world generally.\" @webpagelink"},{"comment_id":"572844126217923","commenter_b":"Before you build the wall could we please shut down all the tunnels underneath the fence?","commenter_a":"Jason Messenger","post_message":"WOW! An honor to be the first-ever presidential candidate in a primary- to be endorsed by the National Border Patrol Council. WE WILL BUILD THE WALL-- WE WILL MAKE AMERICA SAFE AGAIN! Thank you."},{"comment_id":"10153287384469714","commenter_b":"We never like skinny models.we love skinned and boned and toned models that should take the run ways","commenter_a":"I think people don't get it. It's attractive to be thin but you don't have to starve yourself. You don't have to be super skinny. People like a nice figure but above all a nice personality. You don't have to kill yourself to have a nice figure. Eating right and working out makes you look nice and feel better .","post_message":""},{"comment_id":"910100355702699","commenter_b":"She should have gotten the death penalty!!!","commenter_a":"Hey like they say, you get what you sew!","post_message":"Convicted killer Jodi Arias will now spend the rest of her life behind bars. Watch Travis Alexander's sisters beg the judge for a maximum sentence: @webpagelink"},{"comment_id":"825517894248057","commenter_b":"Sure I can agree with that but you need a way to pay off debt. Taxes are revenue for the government which are used for various expenses. When you balance the budget that means you are simply not paying down debt but spending less than you have. We need to start moving in a direction where we will run surpluses and thereby pay off previous debt. Just like a company, a government should not be run by debt. Now theoretically by increasing taxes = more revenue which could be used to pay off debts but that doesn't always work in modern society. We are a people who now are all run my debt, we own nothing anymore.","commenter_a":"Realistically the only way to reduce the deficit is increasing taxes. The problem is Hilary wants to increase to help her buddies and Bernie wants to increase taxes to add more social services. The other two will uses those taxes, cut spending and find other ways to be more efficient to reduce deficit.well trump will cuz Cruz will just have to give money to his buddies in the establishment","post_message":"HA! Look at how much the tax plan of each candidate will directly affect your paycheck...  Your jaw will drop when you get to Bernie Sanders..."}]
