[{"comment_id":"10153823979101107","commenter_b":"And then Hillary would be the next POTUS.","commenter_a":"Rand can still be nominated by the libertarian party and would be a viable third party to trump and Hillary...he could take at least 20 percent from the GOP and DEM... The sore loser laws in many states shouldn't apply to him because he dropped out after Iowa","post_message":"\"Sen. Rand Paul (R-Ky.) has put a hold on the plan, with the intention to protect the Constitution, American taxpayers, businesses, and the nation’s economic health by blocking these dubious treaties.\""},{"comment_id":"10153495156678132","commenter_b":"Gosh, her voice is so heavily autotuned in this song, it sounds robotic!","commenter_a":"I dont get how she has music contract when literally all of her songs are autotuned. That means you're not a good singer. Anyone can sing when their voice is manipulated like that.","post_message":"Don't expect us to get anything done for the rest of the afternoon."},{"comment_id":"10153076176308188","commenter_b":"Should have called Tiffany. Nothing like a woman to get the boys back on task.","commenter_a":"Did you save the fly or just let it suffer...","post_message":"So a fly landed in my breakfast juice.    Jeffy became fascinated with it struggling to live.  Next thing I know Keith is taking a picture of jeffy taking a picture of the fly and stu on skype with Wilson about the fly.  I had to join in and take a pic of the three of them taking a pic of the three of them with the fly.   Lord please help us.   Sometimes we are small and easily distracted and other times we are positively 12 year old boys."},{"comment_id":"10152793243512144","commenter_b":"They all want to save these illegals l, as long as someone esle does it. I say for every liberal who wants a say in this, place one illegal in thier home. That's immigration reform!","commenter_a":"'Overflowing sewage'.......yes liberals are","post_message":"\"Overflowing sewage\" will do that."},{"comment_id":"10154487307161336","commenter_b":"Unfortunately, Hillary and company think they are above reproach. She is doing the \"granny good witch\" routine for awhile and the cutesy lovers are falling for it. Did they honestly forget that Bill is a womanizer and she has ruined the lives of the women he was involved with? Barbra Streisand made a comment, \"We didn't elect the Pope\" and that tone of morality has taken its toll,","commenter_a":"Amen to that!","post_message":"\"If they can't control their own email maybe they shouldn't be controlling the state secrets of the United States.\"  Today on \"FOX & Friends Weekend,\" Mike Huckabee talked about how the hacking of Democrats calls into question national security. @webpagelink"},{"comment_id":"941945919231796","commenter_b":"Lol. They immigrated too #landbridge","commenter_a":"Should learn wut? Now listen here sis... You are just brainles jerky What the hell is American? You mean English????","post_message":"She fits right in with Donald Trump."},{"comment_id":"1221148801300111","commenter_b":"Such a demented mind-set. Let us all pray that the Lord will convict her and turn her from her wicked ways.","commenter_a":"Evil","post_message":"“Christian” Abortion Doc Says: “I Love” Killing Babies in Abortions, “I’m Proud to Do So”"}]
