[{"comment_id":"10153215250940329","commenter_b":"You clearly don't live in the country.","commenter_a":"\" Why are your large pizzas the size of our personal pizzas?\" because we aren't a country full of fat fucks.","post_message":"Dear BuzzFeed Oz."},{"comment_id":"474933522694941","commenter_b":"No! We don't want any more of these people!","commenter_a":"AHH HELL NOO!!","post_message":"60,000? Can you imagine how many terrorists among them?"},{"comment_id":"10153176047249255","commenter_b":"His wife should also go to jail .","commenter_a":"Such a self proclaimed victim.","post_message":"This story gets crazier every hour."},{"comment_id":"1075271249191177","commenter_b":"Surprise bitch","commenter_a":"Isso te lembra algo? Matheus 😂😂😂","post_message":"\"I see you.\" ~Will More combat footage at > Afghanistan Combat Footage - Funker530"},{"comment_id":"1811899142196174","commenter_b":"Then honey you an your country will be taken over. Woman you have made that country weak.","commenter_a":"Turn the other cheek!! Weakness will not be seen as strength by Muslims! They will eventually control and rule Germany! She is a liberal nut job and her options are few at this point! Damage is done!","post_message":"The insanity continues..."},{"comment_id":"1516899938343259","commenter_b":"Yet when guys write this type of stuff all women are emotionally hurt ad need to bitch to the moon. Regardless, these women are virtually worthless. Never date a feminists they have nothing to offer a man at all. Zero. Let them die 60 and single","commenter_a":"I can say with 100% honesty that I would avoid every one of those selfish cunts as if they carried the plague. And i feel certain that these are the same daft cunts that will cry about the matriarchy if men were to make an article just like this.","post_message":"\"If someone was quite a weird child, he tends to be a great date.\""},{"comment_id":"10153456483261051","commenter_b":"I suggest you keep your bitch ass on the internet @username. You don't want to handle it in person.","commenter_a":"Most of the commenters here are transphobic scum. I hope none of you end up with a transgender child.","post_message":"This man handled his child’s funeral arrangements. When her friends showed up and looked inside the casket, they couldn’t believe their eyes."}]
