[{"comment_id":"1711366762447074","commenter_b":"@username don't worry when trump gets in office you'll be deported! Hurry up trump get this Mexican out of here!!!! Let's make America great again!","commenter_a":"So unprofessional. What happened to the president being formal. Not making himself a meme. It's pathetic. The Obama administration is an embarrassment to this country.","post_message":"WATCH: In celebration of Star Wars Day, The White House posts video of President Barack Obama and First Lady Michelle Obama dancing with R2D2 and stormtroopers. @webpagelink #MayThe4thBeWithYou"},{"comment_id":"1203432829732943","commenter_b":"She'll pardon herself the first day in office","commenter_a":"If Killary gets elected, it may well really become illegal to read anything that could be detrimental about her and her actions.","post_message":"CNN: Remember, it's ILLEGAL to Read WikiLeaks Emails [VIDEO]"},{"comment_id":"10158044749370294","commenter_b":"@username nothing about him says he would do any of that....he got into a car crash lol stop making these puppets look like heros","commenter_a":"Why was he even shot when he had no weapon e could have been taken in to custody without killing him. That officer needs to be investigated and put on leave of absence","post_message":"There's still a lot of question about what happened leading up to the fatal shooting of a college student."},{"comment_id":"10154040095578701","commenter_b":"Build that wall","commenter_a":"Juan Wheeler","post_message":"Oregon State Police say a traffic stop on Highway 97 in Sherman County led to the seizure of $2.3 million worth of meth and cocaine."},{"comment_id":"1043755919078659","commenter_b":"White people...now hear this...You have no right to tell us black people, when, where, why, and most definitely how to protest anything at all. Besides, your ancestors brought us here, enslaved us here, discriminate us here, hang, and shoot us here...We're still trying to figure out why? 95% of the last 15 shootings since Kaepernick starting protesting, like many before, have been unarmed black males. He just started protesting 3-4 weeks ago. Do the math on that. There is an eradication of my people in progress. We're fed up. It won't be long before WE start shooting back. Bank on it","commenter_a":"322 white people killed by police this year vs 172 backs. How come the media doesn't report on those lives. Stop reporting 1/2 truths and creating race riots.","post_message":"Police confront protesters in Charlotte, N.C., who were demonstrating after police confirmed they'd shot and killed a man while seeking a different person.  FULL STORY: @webpagelink"},{"comment_id":"908423465917375","commenter_b":"And all this time the US is an OLIGARCHY","commenter_a":"Never could understand how socialist was an insult to Americans","post_message":"Do they even really know what that word means?  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153672451109062","commenter_b":"He's a lady","commenter_a":"Michael Keaton was robbed!","post_message":"BEST ACTOR goes to Eddie Redmayne for \"The Theory of Everything.\" More: @webpagelink  Photo: Dan MacMedan, USA Today"}]
