[{"comment_id":"10153625386991179","commenter_b":"@username. Thought you would like this!","commenter_a":"Tracy McElfresh Jesy Anderson","post_message":"Here's another one! Who is the genius behind these?"},{"comment_id":"1584390601848053","commenter_b":"12 years old. She looks 30 !","commenter_a":"Of course she sings well.....her mother is FAITH HILL!","post_message":"Wow. She is incredible. Just like her mother!"},{"comment_id":"998442540272524","commenter_b":"She is bought and paid for and if she's president what happens then?","commenter_a":"She's a crook and lies about where money comes from and buys the illegal immigrants vote","post_message":"By the way, it ILLEGAL for foreign nations to influence the outcome of an election. Just so you know. @webpagelink"},{"comment_id":"409403839241497","commenter_b":"The tea baggers mistresses have abortions too.","commenter_a":"It's funny how the party of limited govt wants the govt in every OBGYN office in America. Sounds like big govt to me. Teabaggers, why not just attach cameras to every uterus to make sure women are doing what you say at all times? The tea party lunacy and hypocrisy is too much. I don't like abortion but it is legal and what others do is no one else's business. You ass backwards tea baggers seem to forget that your southern women have abortions too.","post_message":"He went too far."},{"comment_id":"10153303433876162","commenter_b":"Hope not. There is nothing wrong with having a woman president. However other countries in particular the middle east countries dont see women as equals.","commenter_a":"I seriously hope people don't vote for her to have a \"first\" female president.","post_message":"CLINTON 2016? Hillary Clinton is expected to announce her candidacy for President tomorrow. Here's what you need to know: @webpagelink"},{"comment_id":"10153181723473984","commenter_b":"Put all of them in jail there all criminals","commenter_a":"He needs to go!!!!!!!!!","post_message":"Unbelievable! Boehner just gave Obama exactly what he wanted... Do you feel betrayed?"},{"comment_id":"10155037125378459","commenter_b":"Hey the angry ex wife is back!!!!!","commenter_a":"You know when there is a big headline telling you the absolute truth about anything on social media that you are in for a load of bullshit.","post_message":"The Truth About Oprah Winfrey Oprah Winfrey meets in secret with THE MOST evil men and women in the world every year and is given talking points to push on her audience..."}]
