[{"comment_id":"10153084847781350","commenter_b":"Cheaters","commenter_a":"Latest reports state balls were checked at halftime and found deflated. They were changed out for fully inflated ones. And...PATS won the game in second half! What else is there to say? Enough already!","post_message":"\"It's cheating, regardless of how you may want to spin it.\""},{"comment_id":"689148981239347","commenter_b":"That's one way to get rid of the Muslims and have them leave on their own Trump wins","commenter_a":"These guys can go to? Just go! Scum.","post_message":"Donald Trump will win, and then they will have to face reality.  If they don't like it, good riddance.  Do you support Donald Trump?"},{"comment_id":"921271484601636","commenter_b":"she spends our tax dollars on all kinds of expensive garbage. the woman needs a clue. race is not the issue. her habits are.","commenter_a":"And didn't they take her law degree away from her? And he apparently didn't even pass the bar exam.","post_message":"Everyone is racist at me!!  Michelle Obama whiny, self-centered commencement speech  @webpagelink"},{"comment_id":"10154136361277293","commenter_b":"@username Oh! Just saw the guns!!!! You can live in your own basket. Would not want you as my neighbor. I'll live near a refugee.","commenter_a":"All these \"deplorable\" comments make me truly ashamed of my fellow Americans. SMDH at all the lies, irrational hate and fear mongering.","post_message":"Kerry told lawmakers \"that if it is possible to do more\" in terms of accepting refugees, \"we would.\""},{"comment_id":"10153982553531955","commenter_b":"Fire her!","commenter_a":"Where is this? Chicago..oh yeah..that crime riddled LIBERAL MESS..that place where there are 100's of black on black murders each week..that place where black lives matter the LEAST...that place where this ignorant fool of a so called teacher is. SAD AND IGNORANT.","post_message":"Public School Teacher Preaches \"Fuck The Police\""},{"comment_id":"1297175820325446","commenter_b":"IF TRUMP IS SO PRO-ISRAEL THEN WHY NOT A 2 TIER SYSTEM AND HUMANE PRISON REFORM SYSTEM HERE 2?!!!!!!!!!!","commenter_a":"Once the ACA is dismantled, people are in for a RUDE awakening. If you thought premiums/pricing was bad before, they will only get higher once \"Obamacare\" is gone. Trump voters are, essentially, like the dog with the bone who sees a reflection in the water of another dog with a bone, and tries to snatch it, losing both bones. I guarantee that you will be severely disappointed.","post_message":"LIVE: Sen. Bernie Sanders is holding a town hall meeting on CNN, talking about how we can fight back against Trump's bigotry and fascism.   *** audio is missing from the first few seconds, please stay tuned and it comes on shortly***  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152820559047144","commenter_b":"To hell in a hand basket. The women will have to bale them out.","commenter_a":"Most of those pharma pain killers are just synthetic heroin.","post_message":"A recent study found heroin abuse was 19 times higher among people who had previously abused pain relievers."}]
