[{"comment_id":"975345569191587","commenter_b":"Mr, Dugger wanted a woman with no personality.","commenter_a":"Depends on what viewpoint your looking at. A successful marriage is not solely dependent on sex which is something your husband didn't know or taught to his son","post_message":"Michelle Duggar also says she's saving she and husband, Jim Bob’s, 'intimacy notes' to share with her daughter, Jill. Can you say, “EW!”?"},{"comment_id":"1794738107245611","commenter_b":"Mexico has no standing in America. The reason Mexico is upset is because the majority of Mexico!s economy depends on money sent from Illegals in America and illegal drug traffic. The rich in Mexico will lose their illegal source of income and Mexican economy may crash.","commenter_a":"Screw you.","post_message":"Yea, good luck with number 11..."},{"comment_id":"947714872011958","commenter_b":"Thereeeesss Billl---","commenter_a":"This is just an endorsement for trump.. it has nothing to do with Cruz.. Why is it that everything to do with t rump is exaggerated , or just outright lies ? Every time he opens his mouth the stooges have to run around for three days explaining \"what he meant to say\"? he didn't mean women should be jailed for abortions, he meant they should be celebrated.. he didn't mean mexicans were rapists he was talking about \"the bad ones\".. he didn't mean single payer health care he meant government paid health care.. he didn't mean to call Carson a child molester he equivocated that he was LIKE a child molester.. He didn't mean to hire all those immigrants for his hotel, he meant to say Americans are lazy and won't take the low paying jobs.. He didn't mean to imply that his wife is just a \"piece of ...","post_message":"Ted Cruz is having a hard time with Latinos for one EPIC reason. When I heard it, I couldn't stop cheering! All aboard the Donald J. Trump train! Do you think Ted is finished?"},{"comment_id":"10153899615080329","commenter_b":"They can go f****** themselves. Ur beautiful.","commenter_a":"I'm not Latino but I'm half Black and half American Indian and I've felt and been told I wasn't enough of either.","post_message":"Spoiler: You're perfect."},{"comment_id":"10153400550747042","commenter_b":"Good thing those girls were white, if they were black they probably would've been arrested","commenter_a":"The cops are doing their job! These girls are breaking the law. Now let's give the cops a big round applause (being sarcastic)","post_message":"KIDS' STAND SHUT DOWN: They were trying to earn money to buy their dad a special gift for Father's Day."},{"comment_id":"1294109124000954","commenter_b":"Not crazy just tired mostly gonna watch YouTube and eventually fall asleep","commenter_a":"Americas doomed if trump becomes president same can be said about hilary just sayin","post_message":"Glenn Beck caught his listeners off guard today with THIS massive announcement. He's been one of Donald Trump's harshest critics, and no one thought that this would happen."},{"comment_id":"1209844019025849","commenter_b":"But she will claim , its someone elses fault and she knows nothing !","commenter_a":"Better watch himself or he will have an accident like all the others!!","post_message":"WATCH: Romanian hacker \"Guccifer\" tells Fox News he easily breached then-Secretary of State Hillary Clinton's email server. @webpagelink"}]
