[{"comment_id":"956871837686622","commenter_b":"This mother is insane.","commenter_a":"Not cute or darling...it is ANIMAL ABUSE..this child will grow up not respecting animals or people a a result of mommy's abuse to her and to animals...kids do not know...they have to be taught...","post_message":"This is not “cute” or “playful” or “darling” or “harmless” — it’s ANIMAL ABUSE, indirectly perpetrated by a mother too ignorant to keep her clueless (and ultimately innocent) toddler from treating a LIVING, FEELING creature like an inanimate rag doll. Disgusting…"},{"comment_id":"10152987522331336","commenter_b":"Hahaha stupid white girls","commenter_a":"Wish we could deport him..","post_message":"Moments ago, President Barack Obama vowed to appeal a federal judge’s ruling to block executive action on immigration. @webpagelink Don't miss Texas Governor Greg Abbott's response tonight at 10p ET on 'Hannity.'"},{"comment_id":"977484695718405","commenter_b":"You know all this for a fact?? Otherwise move along snowflake","commenter_a":"That was awkward to watch she was looking like she can't wait to get away from him seriously but her face never moves Botox much","post_message":"President Trump and First Lady Melania Trump just shared their first dance at the inaugural ball. @webpagelink"},{"comment_id":"606686526157968","commenter_b":"@username I'm coming to rape and murder ur whole family","commenter_a":"Why not use that time, money, and tech to sniff out cancer, instead of destroying addicts lives by throwing them in a cell with rapists and murders?","post_message":"It's so powerful, it had to be calibrated in the pristine air of Antarctica — one of the few places in the world where it would read true zero."},{"comment_id":"1157455867648336","commenter_b":"Or get the hell out of our country","commenter_a":"Think again. This is the United States, not some Middle Eastern Country. Assimilate or leave!!!!","post_message":"Muslim Leader : we are practicing Muslims, we are above the law of the land. Like if you think practicing Muslims need to follow our laws just like everyone else. @webpagelink"},{"comment_id":"10154137959598701","commenter_b":"Dumb tweaker bitch","commenter_a":"Debbie someone actually fell for it.","post_message":"In Case You Missed It on Good Day Oregon: A contender for world's dumbest criminal. A Texas woman fell for a police department joke: a Facebook post with a warning about meth and heroin \"contaminated with Ebola\"."},{"comment_id":"10154496628933132","commenter_b":"@username she didn't say anything to the girls. She simply gave them a card. If my daughters were acting like spoiled brats I would not mind if someone put them in their place!","commenter_a":"Sorry Helicopter Mom, if I were those girls parents I'd jump down your throat for trying to police the thoughts and opinions of this group of girls, from what it sounds like to me it was the equivalent of a negative review among peers, I for one applaud the young ladies for exercising their First Amendment rights of free speech and I place the mother in question for violating those young ladies personal and intellectual autonomy","post_message":"The author and parenting expert shared the importance of being beautiful both inside and out."}]
