[{"comment_id":"10153366601141770","commenter_b":"Where is our freedom of speech??? Keep your rioters away from TRUMP! You all send them with your lies of deceit...so you can have business as usual in Washington! We Americans see right through you...the uneducated don't...or the naive youth..","commenter_a":"what happened to freedom of speech? trump had nothing to do with the violence at his rally in chicago these were paid punks to not let him speek","post_message":"Mitch McConnell told reporters he and Donald J. Trump spoke by phone Tuesday and he encouraged the New York businessman to “condemn” the “violent expressions” at some of his political rallies."},{"comment_id":"10152732788836028","commenter_b":"That sick","commenter_a":"Aww, that's awesome! :)","post_message":"Thomas Sawicki and his boyfriend Shawn Brier were the lucky couple chosen to share the first kiss off the ship as fast-attack submarine USS San Francisco reunited with its home port at Naval Base Point Loma Monday afternoon. Families lined the dock awaiting the arrival of husbands, sons, dads and brothers returning from a seven-month stint in the Western Pacific: @webpagelink"},{"comment_id":"1214784961920643","commenter_b":"all these woman marching i wish they would say samething about us senior that can not get out of the house to help fight for our medicare and social security","commenter_a":"Marching in Tucson, AZ!! Yea! Ladies!","post_message":"LIVE NOW: Women's March in D.C., just one day after Trump's inauguration. MORE MARCH INFO: @webpagelink"},{"comment_id":"10154455818619705","commenter_b":"She referred specifically to people who are \" ..racist, sexist, homophobic, xenophobic, Islamophobic.\" If you don't find those things deplorable then you're in the basket and you might as well wear the shirt so the rest of us can more easily identify you.","commenter_a":"Trump supporters take being referred to as \"deplorables\" like a badge of honor","post_message":"The shirts stem from a comment Democratic presidential nominee Hillary Clinton made at a fundraiser."},{"comment_id":"10158461091345206","commenter_b":"I wouldn't put it past that liar!!","commenter_a":"Dan Elsa","post_message":"“Early in Clinton’s tenure as secretary of state, she and her staff were observed removing lamps and furniture from the State Department which were transported to her residence in Washington, DC.\""},{"comment_id":"10153017975939205","commenter_b":"Well you'll have to fuck off back to Europe then, cunts !","commenter_a":"I worship Ana.....Every square inch...","post_message":"Who knew Jesus was against immigration!"},{"comment_id":"10153622148174497","commenter_b":"women can have some rights, just so long as they arent black mexican atheist homosexuals or anything.","commenter_a":"are men hogging up all of the rights again? come on guys... let the women have some of the rights.","post_message":"What is the path forward for women given the barriers to equality they face worldwide? The Onion explains women rights."}]
