[{"comment_id":"723350911147017","commenter_b":"All this after making remarks that all Mexicans are criminals and rapists and we need to isolate ourselves from them by building a wall between the United States and Mexico at the expense of the Mexican Government. Then hiring undocumented Mexicans to work in his hotels and casinos with no unions to represent them, offering to compensate them under the minimum wage, then refusing to pay them. Now, trying to entice them into voting for him? Unbelievable!","commenter_a":"Say whatever?","post_message":"This should go over good with the GOP! ~Kay"},{"comment_id":"1334326533266897","commenter_b":"For the first time in American history a foreign hoe for first lady","commenter_a":"I wouldn't be Melania - even for a billion dollars!! I lived with a narcissist. She has my pity! I'm sure she is paid well to stay with him, and her frozen Botox face and designer wardrobe says it all.","post_message":"Politics aside, Melania Trump's modeled some winning looks on the campaign trail."},{"comment_id":"10157549372250725","commenter_b":"Suck it up buttercup. Should've been a little more gracious and not acted like a douchewagon! Then u go on TV and act all sorry and \"accept full responsibility\" , then still weasel and lie around the truth about what totally happened and cop-out of some questions with the \"i was really drunk and don't quite remember\" garbage excuse! Pull up your Speedo and get over it! The media and Olympic committee are the only ones who really care about your little hissy fit , the most of us could really give a crap! You won a gold medal and now your sad because your entitlements are going bye bye! Well, if you were more grateful and less of an egotistical stroke then maybe you wouldn't be in this situation! Lessons learned and move on! Accomplishing something as difficult as you have, you would think you can find the gumption ...","commenter_a":"How old is he???","post_message":"The Olympian swimmer, who has now lost all of his sponsorships following the Rio robbery scandal, is \"not doing well.\""},{"comment_id":"1146551715438403","commenter_b":"@username Why did you just not turn over your emails Hillary? Why are they finding them now on Huma's deranged husband's shared lap top? Extremely Negligent come to mind? You forgot to Bleachbit and smash this one!","commenter_a":"What's Huma and Anthony's plan? Soon as the election's over get back together?","post_message":"“The Director owes it to the American people to immediately provide the full details of what he is now examining.\""},{"comment_id":"1218431098240658","commenter_b":"May be time for this earth to be cleansed ethnically.... all with religions other than HUMANITY should be wiped off...","commenter_a":"When will it all fcking stop!!! I think when religion stops their will be peace once again","post_message":"BREAKING: Russian ambassador shot dead in Turkey by gunman screaming 'We die in Aleppo, you die here'"},{"comment_id":"10152965639377690","commenter_b":"Evil women have already stole my soul. It's too late.","commenter_a":"Really? Really?","post_message":"Texans hold prayer vigil for Blue Bell Ice Cream after massive recall @webpagelink"},{"comment_id":"839844146064134","commenter_b":"Women want it all, money,, looks, and a man who does everything right?, that has made me want all the same from a woman, sO far no luck, it's not a hero juzca person who shows love everyday, in everyway and a REAL woman not a Queen to appreciate it!","commenter_a":"If only we were all blessed with that. He's a hero plus a husband who gets it!!","post_message":"SO SWEET! The way to a man's heart may be his stomach, but one devoted husband has proven that women's love can come from a man who can"}]
