[{"comment_id":"1134794909920596","commenter_b":"He bitch ya breathe smells like shit I can prove it.","commenter_a":"Well thats what the little shit gets for fucking with a monkey","post_message":"Angry baboon throws poop in little girl's face! #WSHH"},{"comment_id":"10154264238746509","commenter_b":"We have been since before 9/11, WTC was hit twice by them","commenter_a":"No we are not at war......but we do have a cancer growing that needs to be eradicated !!!!","post_message":"U.S. Senator Ted Cruz said Thursday that the deadly mass shooting in San Bernardino, California, shows that the country is \"at war.\""},{"comment_id":"1276342415734510","commenter_b":"Well they didn't because Peter Falk hadn't even been born yet.","commenter_a":"I VOTE FOR THE AMERICAN INDIANS.TELL ME WHY DID THE EUROPEANS KILL THE NATIVES ,IF THEY WERE BARBARIC THEY WOULD HAVE KILLED COLUMBO AND BURNED HIS SHIPS.","post_message":""},{"comment_id":"10153384836141756","commenter_b":"And they're thin from getting anal leakage from eating all that spam!","commenter_a":"And they are still thinner!","post_message":"South Koreans eat three times as much Spam per capita as Americans. Customers buy it in bulk packages and as fancy holiday gift boxes. \"It's a luxury that really has kind of cemented itself in Korean society,\" says the president of a food tour company in Seoul."},{"comment_id":"1253188708034490","commenter_b":"Made me laugh!! Stupid B!TCH she is!!","commenter_a":"lets have fun with duct tape and her, and then post a pic to shame her going \"this is what happens when your an abusive POS pet owner who has no morals or respect for what we call mans best friend\"","post_message":"A woman first shared the disturbing photo Friday morning on Facebook, with the caption, \"This is what happens when you dont shut up!!!\""},{"comment_id":"1337743466286160","commenter_b":"How about we deplorables boycott all of you talentless walking DUMB LIBTURDS!!!","commenter_a":"These slobs have sold their souls years ago on the casting couch of Hollywood! What do they know about the struggle of the everyday @username! Go back to your fantasy world of make believe, most people live in the REAL world!","post_message":"Hollywood Hail Mary: See who's begging the Electoral College to vote against Donald J. Trump."},{"comment_id":"10154278344319497","commenter_b":"Also @username","commenter_a":"Melissa Tim @username","post_message":""}]
