[{"comment_id":"1466279580067766","commenter_b":"Yes!","commenter_a":"Yes !!! What choice do we have...?","post_message":""},{"comment_id":"1016709065044307","commenter_b":"Camille Valdez I don't think nothing would of happened if she was there unless she a trouble maker","commenter_a":"Cesar Chavez beginning down 9 days and not going to that school and it's Mexicans vs. blacks that's what it is there's going to be War","post_message":"#ALERT Police are at the scene of Cesar Chavez HS where several fights have broken out."},{"comment_id":"510712935755721","commenter_b":"...via the food scraps from their Whole Foods trips found in dumpsters! Now I see the trickle!","commenter_a":"This sounds like a problem that a few more tax cuts for Billionaires will fix. It's really simple. You give ALL the $$$ to a few people, and then it just \"trickles down\", and eventually reaches the homeless.","post_message":"A 2015 report found that an estimated 44,359 homeless people live in LA County — a 12% increase since 2013."},{"comment_id":"1788246978118850","commenter_b":"She is garbage.....","commenter_a":"Your a f*cking idiot. Please leave the country. I'll buy your ticket.","post_message":"During a show in Tampa, Amy Schumer brought an audience member on stage and quizzed him about his decision to vote for Donald J. Trump."},{"comment_id":"1239053882772316","commenter_b":"@username They are ALL connected. Mcain, Obama, Hellary, Bush. If you think it is the \"other party\" that is bad, then they have been successful at controling your mind. The Dem/Rep thin is a HOAX!! Stop blaming obama. He is terrible, but he is just a puppet! Cut the strings of the puppet masters. vote for the guy they hate! Trump!","commenter_a":"As did the decision to try to overthrow Syria by giving unlimited weapons to \"rebels\" of unknown origin.","post_message":"\"Obama's decision to pull the troops out of Iraq may have helped to create ISIS. As did the decision to disband Saddam's army. As did the decision to invade a country that had nothing to do with 9/11.\" -- Jon Stewart @webpagelink"},{"comment_id":"10153997969131770","commenter_b":"No we want our WALL","commenter_a":"I bet she does. I want the wall right now.","post_message":"Mexico foreign affairs minister says her dream is OPEN BORDERS, with no walls."},{"comment_id":"1069087446447636","commenter_b":"Put her on the street .","commenter_a":"She looks flashy","post_message":"The liberal media loved Michelle Obama's tang SOTU dress. Take a guess at how much it cost."}]
