[{"comment_id":"10153574681028010","commenter_b":"To bad DHS doesn't enforce our laws...she should be returned with millions more just like her.","commenter_a":"Go back then.","post_message":"“I thought I came to this country to escape abuse, mistreatment and disrespect. But it's the same here.”"},{"comment_id":"10154818512036729","commenter_b":"Some people are just slow to get it.","commenter_a":"Polls should mean nothing, she should be in jail. She represents everything wrong in government.","post_message":"Whoa!"},{"comment_id":"10152565333134071","commenter_b":"Both of them are idiots !","commenter_a":"Legalize it, is the best way to keep it out of minors and kids.","post_message":"#Pot2Blame?"},{"comment_id":"1251860331547386","commenter_b":"She probably cheated..can't blame him","commenter_a":"Seems like all the guys in Berlin are pussies","post_message":"Cold blooded! #WSHH"},{"comment_id":"10152974957394641","commenter_b":"shame on u black woman.","commenter_a":"They will mit with Muhammed in hell enjoy the fire","post_message":"Saudi Arabia has announced the successor to the throne: cnn.it/1t3xpeS"},{"comment_id":"1143931678960194","commenter_b":"Say Ms white woman...dismissed!","commenter_a":"Idiot!!!! Every race suffers racism!! And all lives matters. Not just blacks. An American is an American! I'm not a Caucasian American! They shouldn't say African Americans either. Get with this century!","post_message":"Clinton: \"We need to acknowledge some hard truths about race and justice in this country, and one of those hard truths is that that racial inequality is not merely a symptom of economic inequality. Black people across America still experience racism every day.\""},{"comment_id":"1522438461149611","commenter_b":"OMG!! She has loads and loads of BULLSHIT in there!!!","commenter_a":"GOT METH?","post_message":"There's been lots of speculation about what might be ailing Hillary Clinton, if anything. One dental expert took a look inside Hillary's mouth... and almost instantly, he said he knew the condition that's been causing all of her health problems. Could this expert be right?"}]
