[{"comment_id":"10158477951920206","commenter_b":"Hillary needs to be arrested, tried and thrown into a dark cell!","commenter_a":"It's Donald Trump for the New chief of Command...","post_message":"The man once known as “Obama’s favorite general” has now pleaded guilty to the felony charge of lying to the FBI during its investigation into the leaking of classified information."},{"comment_id":"1653212978299148","commenter_b":"You two bitches are so very stupid","commenter_a":"John. I agree with you.","post_message":"It's about time...  I'm tired of these two."},{"comment_id":"667824530017395","commenter_b":"THROW them out of the country after incarceration. This disgusting behaviour does NOT belong here","commenter_a":"Yet no justice for the douggler girls.......","post_message":"GROSS."},{"comment_id":"1163941390354988","commenter_b":"I'm also mad that she is not wearing the gloves. I couldn't care less about a corset. Wear the gloves!","commenter_a":"Ummmm...okay?","post_message":"Emma Watson isn't wearing a corset under that yellow dress. // Beauty and the Beast"},{"comment_id":"10155445943810725","commenter_b":"Sadly though it still happened :(","commenter_a":"Everyone who leaves their child with anyone should have a nanny cam.","post_message":"Nanny cam video reveals horrific new details on how a babysitter tortured a 3-year-old girl (Warning: Disturbing content)-----> @webpagelink"},{"comment_id":"10153359134519060","commenter_b":"Oh! You are a geographer or a history specialist Scott. Sounds good. For sure you know Europe is more than UK, Latin America is more than Mexico, and that Egypt is in Africa. Glad to know you really understand the reality and the specifics outside US. It is rare.","commenter_a":"When I read \"Latin America\" as a generalization in an article, I tend to be skeptic. You can not compare Guatemala with Chile, Argentina with Mexico. Completely different cultures, histories, corruption level, etc, although all of them are Latin American countries.","post_message":"Crisis in Guatemala: the vice-president quits, the heads of the central bank and social-security institute are arrested and three ministers sacked. Corruption scandals are two-a-penny in Latin America. Few inflict this much damage @webpagelink"},{"comment_id":"1238351549542994","commenter_b":"Take this woman's FB from her. That's stupid!","commenter_a":"No! Edwards did not ask Obama and liar Hillary to stay away! He's lying! He wanted them there but Obama did not want to give up his golf! Hillary is having serious health issues with seizures and needs her sleep!!!!! Trump Landslide!!!!!","post_message":"Donald J. Trump slams President Obama for not interrupting his vacation to visit Louisiana after deadly flooding in Baton Rouge and parts of Lafayette."}]
