[{"comment_id":"916949761698106","commenter_b":"Stupid woman","commenter_a":"she cant find anyone who has a visa already ! ? :O","post_message":"Some women never learn"},{"comment_id":"1283819971638030","commenter_b":"She's a disgusting wombat","commenter_a":"Looks like big bird. We paid over 2 grand for that dress?","post_message":"The Narciso Rodriguez dress sold out online before the president had even finished speaking."},{"comment_id":"508257596043081","commenter_b":"His wife destroyed that college but gave herself $200k severance pay. They are crooks","commenter_a":"If Sanders were to be nominated and elected in Nov, big problem is that he has not raised money, or campaigned for, congressional Democratic candidates. In other words, Sanders will be no better off than Obama has been if he can't get enough members of Congress to pass his initiatives.","post_message":"The attacks are going to get more unhinged."},{"comment_id":"497783407099419","commenter_b":"Kill the pigs.","commenter_a":"Killing of police officers is WAY UNACCEPTABLE!!!! I am sure that he didn't know if these police officers were empathizing with the protesters but was doing their sworn duty to protect and serve!","post_message":"\"Oh my god. There's people laying on the ground.\" Video from #Dallas via Twitter user @allisongriz includes audio of what sounds like multiple gunshots. @webpagelink"},{"comment_id":"10153612119195530","commenter_b":"Nobody at the restaurant saw anything?","commenter_a":"How come nobody saw anything?","post_message":"So what really happened that Wednesday afternoon in 1975?"},{"comment_id":"836075406488713","commenter_b":"Punch her out, Sarah!","commenter_a":"Between Hillary or Sarah it would be Sarah in a heartbeat.","post_message":"“I’m ready for Hillary, are you? Are you coming?”  - Sarah Palin"},{"comment_id":"1134738373236015","commenter_b":"Actually female secretions do have some nutritional value. And ok, and maybe you should suck some more dick.","commenter_a":"Ha! Says a study funded by the patriarchy and trying to get women to scientifically be cool with swallowing men's Semen. If you're gonna be anti media, don't be pro patriarchy. It's all a part of the same machine. It's all part of the same manipulation. Fuck the patriarchy.","post_message":"And now you know..."}]
