[{"comment_id":"1298762416842950","commenter_b":"Actually W paints pretty darn decent pictures.","commenter_a":"nobody expected Bush to paint like a 5th grader. Okay, yeah we did.","post_message":"Don't expect him to stay home and take up painting."},{"comment_id":"10153380669974135","commenter_b":"you again? really , go away you angry negative bitter woman!","commenter_a":"Why don't you open you wallet and pay NJ back for the money you stole from them for your bridegate \"investigation\" and your campaign expenses. Oh, don't forget $82,000 for hot dogs and beer at the ball games.","post_message":"I opened my heart to you"},{"comment_id":"895880550545124","commenter_b":"An actual woman.","commenter_a":"This is a weak argument.","post_message":"Maybe liberals should have thought about how much they wanted to focus on Michelle and Melania's speeches before they started losing their minds. With so many people looking at the speeches this was gonna happen."},{"comment_id":"513918755467368","commenter_b":"Screw that fat ass bitch","commenter_a":"Her and the view should of been gone long ago","post_message":"Joy Behar took a turn attacking the mother of the Benghazi victim. #RNCINCLE"},{"comment_id":"496205537248565","commenter_b":"@username OK crazy lady, you might need some medication","commenter_a":"I'm a full supporter of Bernie but I'm guessing he is done?? If so I'll have to support Clinton. One I support Democrats. Two. Trump is a disgusting fraud who makes us look horrible. So if it comes down to Clinton and trump VOTE CLINTON!!!","post_message":"Thank you, Ohio."},{"comment_id":"10153756780250695","commenter_b":"Respect everybody-easy on the sir crap","commenter_a":"the police and are like any other person they put there pants on and go to work ........they chose the job we didnt force it on them.i see no reason to buy there meals and say sir and ma'am to them.i work hard for what i have and i get nothing free so why should police get anything free.they have to come if you call them anyway........................!","post_message":"\"Put their charities on your giving list. If your local law enforcement has volunteer-citizen job opportunities, sign up.” Do you agree with his idea?"},{"comment_id":"10156410445115354","commenter_b":"Rebecca the clan was founded in 1865....u ignorant slut....","commenter_a":"If this paper had any business sense and compassion, they would fire that guy.","post_message":"When you see the CARTOON mocking Republican Gov-elect Matt Bevin's adopted children from Ethiopia, just remind yourself: it's only racist when attacks are against Democrats, not Republicans."}]
