[{"comment_id":"10154339330179087","commenter_b":"'@username, who is afraid of immigrants? There are laws. Laws need to be followed to become a citizen. Do you want a POTUS ignoring federal laws?","commenter_a":"The left just can't help themselves. They have to cast this Trump... They have to portray him as somebody that's a walking mental midget, that literally has no idea what he's done here by winning the presidency, that has no idea how to talk, has no idea how to behave. They continue to make the mistake of plugging him into their model. They're plugging him into what they think an accomplished politician is, and he's not that, he's never been that, and he's not going to be that.","post_message":"“Trump and Pence, they pulled a dog and pony show on the numbers. I almost threw up in my mouth.”"},{"comment_id":"872932106099872","commenter_b":"Immigrants built this country","commenter_a":"Why can't the homeless get benefits? Or a hostel? but when immigrants come over they get everything at there feet!! How about giving the homeless everything they get and let the immigrants sleep in a fking box!!","post_message":"It has a solar panel to power radio, light and phone"},{"comment_id":"10156778240410354","commenter_b":"If he can't handle her, Hillary will make him her bitch. The bitch Trump. Has a ring to it.","commenter_a":"Enough of FOX NEWS 'debates', Time to vote, enough of Rubios super pac trying to make him look good","post_message":"But the campaign's stated reason for the decision may be different than one might expect..."},{"comment_id":"1281596298596888","commenter_b":"I physically couldn't go eaither. But we can still stand in solidarity on social media. #IBiteGrabbers #MyVaginaMyRules #NastyWomenUnite","commenter_a":"Not starting a fight here, you right I'm old the same age as Madonna but just never followed her. I wish I had gone. What a great way for women to express themselves. Sorry no harm intended","post_message":"LIVE VIDEO: More than 500K are downtown at a rally for the Women's March on Washington MORE: @webpagelink"},{"comment_id":"1026275800718010","commenter_b":"Oooooh. Oh Oh someone is actually deciding that the Manchurian fraud president could actually be an Islamic terrorist. Well the grasshoppers may actually be waking up to that fact. What the hell do you think I have been saying for the last six years. In the movie the Manchurian candidate American prisoners were being brain washed by the Chinese to undermine America and it's politicians and kill them. In Obummer's case he was indoctrinated into the Muslim cult and communism by his father mother and his in-law's. There are no Muslim or Islamic American's because they will give their lives for Islam. They are instructed by the Koran to deceive the infidel's and make them think that you are their friend. When the time is with us we will torcher them and then kill them in the name of Islam There are no good Muslim's . That is for outward ...","commenter_a":"Yes","post_message":"Millions of Americans have suspected for quite some time about Barack Obama's ties to the Muslim Brotherhood. Now, there's a document that's being called 'the smoking gun.'"},{"comment_id":"1755937964626463","commenter_b":"Then. Fuck u bitch","commenter_a":"He also said white people are the Devil, that Jews and whites are evil and he proposed racial segregation in his speeches to the Ku Klux Klan. Be like him? No thatnks","post_message":"He was truly the greatest, and not just because of his accomplishments inside the ring.  The Free Thought Project  #RIP #MuhammadAli"},{"comment_id":"10153299711818037","commenter_b":"We'll have the latest on @username @ 5. New reports say 60 dead.","commenter_a":"Silvia, so glad yall are already back, scary 😁","post_message":"UPDATE: Paris police prefect Michel Cadot said all the attackers are believed dead, although authorities are hunting for any possible accomplices."}]
