[{"comment_id":"10150977696104999","commenter_b":"No, the representation in the Senate is not of the people, but of the states. Each state has two Senators. That's equal representation. If you want representation of the people, you're looking in the wrong chamber.","commenter_a":"It is a very good thing that urban power centres cannot set the taxes of their rural neighbours. If they could the rural producers would become slaves and would have no quality of life in the pursuit of urban consumers actively destroying rural methods of negotiation. This is NOT a failing of the system, it is exactly why the system is in place. It is a good thing that farmers are not economic slaves of nearby cities.","post_message":"In the U.S. Senate, the least populous states are now more overrepresented than ever before."},{"comment_id":"10153847287078984","commenter_b":"She's a lying bitch","commenter_a":"Yes I Support Grey I agree He is doing what is expected of any Lawyer expected I","post_message":"BOOM! 'Bulldog' Gowdy just welcomed Hillary to the Benghazi Select Committee hearing in a way that probably had her wanting to run and hide. He had his chance to address her right to her face, and he did NOT hold back. Do you support Trey Gowdy's fight to unveil the truth about Benghazi?"},{"comment_id":"569159163208677","commenter_b":"Ohhhh....the irony. An 'upgraded' fence around the WhiteHouse to keep 'intruders' (i.e., we the legal citizens of the U.S.) out, but Obama and Hitlery refuse to support fencing our borders to keep illegals out. SMH","commenter_a":"Voting Trump a real American","post_message":"President Obama just unveiled the new White House fence and a lot of people are upset. This new design feature has Americans demanding it be torn down."},{"comment_id":"10153556909588132","commenter_b":"I know!!!","commenter_a":"Krystal Frederick","post_message":"Another The Bachelor couple bites the dust."},{"comment_id":"888390488018194","commenter_b":"Feminazi bitches","commenter_a":"This program has got to go...what is Disney thinking...stopped watching it long ago....they have become left extremists...they are just like the long time politicians...our view is the one that you people should be thinking...totally out of touch with common people...don't these so called stars get it...we don't care what you think","post_message":"Let's help them pack their bags. Do you want The View gone?"},{"comment_id":"10152763572857434","commenter_b":"#whitegirlsbeefin","commenter_a":"Alcoholism is funny if it's at a wedding #sarcasm","post_message":"To say the bride was displeased is a major understatement"},{"comment_id":"10152947380749099","commenter_b":"Yes, because women never get pregnant on birth control....","commenter_a":"If women would practice birth control then these horrible things wouldn't happen. Bless their little souls. May God have them in his embrace.","post_message":"A man found two dead fetuses wrapped in a blanket on the street @webpagelink"}]
