[{"comment_id":"10152867281821051","commenter_b":"Give it your best shot bitches","commenter_a":"Full of crap","post_message":"ISIS just announced the specific targets they’re looking to blow up – including the American ones."},{"comment_id":"1030052270365446","commenter_b":"If she is afraid her flatulence will be recorded maybe she should stop opening her mouth.","commenter_a":"Up here.... they would call that problem... The Rocky Mountain Quick Step..... apparently it isnt that quick with the carpet bagger of the east","post_message":"\"Sorry.\""},{"comment_id":"1270356769653367","commenter_b":"She is so gross, just sickening!","commenter_a":"Whatever That idiot should move to Mexico","post_message":""},{"comment_id":"1359940970684036","commenter_b":"wish they would lock her up and throw away the key.","commenter_a":"That Lady makes 18 million maybe she could give up some of her salary for the poor kids that need pen to not die...something wrong with this.","post_message":"UK's price: $69 Germany's price: $218 America's price: $600"},{"comment_id":"10153052525021748","commenter_b":"Does she know how many Muslims Obama kills every day?","commenter_a":"She's really losing it.","post_message":"\"Muslims would like to take over the world and establish their caliphate, and Obama has let so many Muslims in.\""},{"comment_id":"10153156333212093","commenter_b":"Agree @username, I appreciate your candor.","commenter_a":"I would have to say too bad. There are reasons why adoption laws are written the way they are. Just because various individuals attempted to circumvent the prior marriage laws to gain legal status instead of going about the legal routes and legal boundaries others have until the recent decision on same sex unions, is not a good enough reason to change the laws surrounding adoption and the laws against adoptive parents becoming involved with adopted children. Do they think they are the only \"couple\" who have this issue. There are countless stories of parents who adopted a child, got divorced, and one of the \"parents\" wanting to change the legal definition of the legal parent-child relationship. How about you made your bed when you tried to circumvent the laws to get around state and federal laws regarding things like insurance eligibility, income tax deductions, ect., just because there are ...","post_message":"Roland and Nino want to get married now that same-sex marriage has been legalized. The only catch is that they are already legally father and adopted son... @webpagelink"},{"comment_id":"384888735032754","commenter_b":"Beautiful.","commenter_a":"just awesome just like his dad great job","post_message":"Just like his Father...AWESOME!"}]
