[{"comment_id":"10153913133146130","commenter_b":"Wtf is a \"puff hoe\"?","commenter_a":"I get all of my political advice from rich Hollywood actors, said no human ever. This just made another 100,000 people vote for trump,, keep it up puff hoe,, you're helping!","post_message":"Nailed it, Angelina Jolie."},{"comment_id":"10153387791927690","commenter_b":"Amen. If another female in heat walked by, he'd have been on it. He's safe now. But if both had been fixed, neither would have been out by the road.","commenter_a":"Dogs are indeed wonderful. This is a sad story and an all too common story. However, as is the case in many of these sad stories, the male gets loose to chase a female that is in heat. She gets hit by a car and he refuses to leave her side , not because they were best friends or because he is a loyal friend, but rather because he is fixated on the female in heat. The moral of this sad story should be to have your dogs fixed.","post_message":"A heart-wrenching photo tells the story of a loyal dog found by his friend side Sunday morning in Dallas: @webpagelink"},{"comment_id":"1231979063521740","commenter_b":"OF COURSE IT WAS RANSOM!! AND NOW OBAMA HAS PUT THE AMERICAN TOURISM IN HARMS WAY HE IS THE VERY WORST THING THAT WE HAVE EVER HAD IN OUR WHITE HOUSE AND WE CAN'T WAIT FOR THEM TO GET OUT OF OUR WHITE HOUSE!!! HE HAS TRIED TO DESTROY AMERICA AND HAND IT OVER TO THE MUSLIMS AND THE ILLEGALS AND NOW THE TERRORIST !! LOOK AROUND YOU THEY ARE EVERYWHERE AND GROWING !!! YOU DEMOCRATS BETTER THINK ABOUT IT !!! TRUMP FOR PRESIDENT AND LETS WIN THIS TIME !! AND SAVE AMERICA AMEN","commenter_a":"Yeah right it was more like Money Laundering.","post_message":"“This was not ransom. Any suggestion that it had anything to do with ransom is absolutely and utterly false.” State Department spokesperson John Kirby defended a $400 million cash transfer to Iran during the release of U.S. hostages. @webpagelink"},{"comment_id":"10153077388711051","commenter_b":"What she can't read? So they don't like what your wearing take your business elsewhere duh but what she is wearing I see nothing wrong with she has more close on then most. The owner is an ass","commenter_a":"Seafood Nazi.","post_message":"When this woman was told that she was being kicked out of a store for her 'inappropriate' outfit, she thought it was a joke. Nope."},{"comment_id":"900278129995043","commenter_b":"No","commenter_a":"They're great to look at and their love is cute and all but not sure if their personalities would work for a talk show. Maybe a dating game show would work better.","post_message":"Would You Watch? Boris Kodjoe And Nicole Ari Parker Get Their Own Talk Show On Fox"},{"comment_id":"904212379645518","commenter_b":"These thugs and hoodlums should be arrested .","commenter_a":"Thugs","post_message":"He Wasn't Ready!"},{"comment_id":"1788499241368226","commenter_b":"Right. She has breasts. Ducks don't have breasts.","commenter_a":"Talks like a duck... looks like a duck... acts like a duck... must be a fucking duck","post_message":"Police Forcibly Remove Woman From Ladies Restroom Because She \"Looked Like a Man\" - is this what #MakeAmericaGreatAgain looks like?"}]
