[{"comment_id":"992365204151742","commenter_b":"Since the dawn of evolved time mankind has migrated so that won't stop. I agree the need know who is entering the nation if I remember a European country found that immigrants were part of protest. And terrorist will use this to build cells to attack. However I don't see how Trump will get Gulf States to build security safe zone since the 'fountain is running dry' or maybe he will reignite the polluting of the environment with fossil fuels and take action to get fossils prices back to 110 which will create more bad than good but greedy and gluttony will prosper. His positions may have down sides for any real growth. And I agree that America needs to stop providing bulk funding, to the UN and other, let the world let the new imperialists do it and they, US, rebuild and make the world positive, green, clean and ...","commenter_a":"Republican Party souls have been sold to highest bidders, \"The Sneaky Wolves\". Lincoln Party is officially dead. So sad, Republican primary election is fraud, unfair and rigged, it seems every bigot and racist hiding behind the conservatism came out the closet to poisoned the election process in order to hijacked the Republican Party. I feel sorry for the gullible and naive Republicans who have been mislead, bluffed, lied and manipulated. Trump’s gang for hostile takeover of Republican Party maybe the worst case scenario in the American political history. Thanks a lot media for giving Trump’s gang free ride. Media is sold out to the highest bidders and freedom of press is no longer relevant to corrupt bosses and greedy investors Not again, another Hitler era, never again. @webpagelink Going in and out of building makes a person a Christian no more than going in and out of a barn makes ...","post_message":"“No. I would not allow people to come in from Syria. They’re not vetted properly. They’re moving in by the thousands.” Donald J. Trump reaffirmed his commitment to a ban on Muslims immigrating to the United States, arguing that it is better to build \"safe zones\" in Syria. What do you think?"},{"comment_id":"707988442725067","commenter_b":"Then they need to leave this country.","commenter_a":"This really makes me angry....","post_message":"The court has just ruled against the American flag. This is un-American. We stand for the flag forever and always. Can we get 30,000 'LIKES' for the American flag?"},{"comment_id":"10153127976631162","commenter_b":"You sound ignorant you stupid old lady","commenter_a":"A 3, 2, year old and she is 8 months pg. give her birth control.","post_message":"TODDLER SHOOTS PARENTS: A 3-year-old boy shot his dad and his 8-months-pregnant mom when he found a loaded handgun in her purse while looking for an iPod. READ MORE: @webpagelink"},{"comment_id":"10153140551051051","commenter_b":"Absolutely. It's a broken system. What I don't get is that in any other country if you enter the country illegally, you get sent back. Why is it soo hard here for that to happen? It's a bigger problem then an illegal person killing another person. Maybe it's time to close the borders and get our country and its laws in order?","commenter_a":"deport trump to mexico...","post_message":"The man who had been deported 5 times before killing an innocent S.F. woman entered a surprising plea. Do you think he's an example of how the current immigration policy isn't working?"},{"comment_id":"832375306811018","commenter_b":"Fire her, is this what she is teaching kids? She need to teach the prisoners not the kids!","commenter_a":"What an idiot teacher, she should be suspended and never get anymore money !!","post_message":"An elementary school teacher has been suspended for having her 3rd-grade students write \"get well\" letters to an inmate convicted of killing a police officer. What would you do if your child was in that classroom?"},{"comment_id":"1670051896580847","commenter_b":"Hell yes","commenter_a":"Definitly YES !","post_message":"OMG! Obama shortchanged the VA by 2 billion and gave away 4 billion to Muslim migrants! He hates our vets! FOLLOW US----> Freedom Daily"},{"comment_id":"1264248823618692","commenter_b":"@username Trump lost the entire west coast, not just California. But, for the sake of your argument, such as it is, yes, take away California...take away the most populous state in the Union, the state with its own fucking economy, the state that has to give more than it takes from Federal coffers in order to support the welfare red states who take more than they give to Federal coffers...disenfranchise those people...disenfranchise the many for the few. Lady, and I use the term very loosely with you, that's how tyranny starts.","commenter_a":"Trump and his little army, are the most corrupt bunch. Electoral College...do your patriotic duty, the duty Alexander Hamilton intended you to do when faced with a Demagogue who has ties to our enemies in foreign lands. UPDATE: I have thoroughly enjoyed the response of you moronic Trumpbots...more than I know. You have validated my assessment of you folks...an assessment that can be summed up in one sentence, \"Dumb as a bag of rocks.\" So while y'all keep going on about Liberals, Dems, 'Killary', the bogus line about Hillary selling uranium, blah..blah...blah, \"We won, you lost,\" etc., etc., etc., a few pointers: You might have some valid points about some Liberals...if only you would learn to use proper analysis techniques and then had the ability to form a proper sentence to explain said analysis; yes, Dems can be as bad as Repukes...both are corrupt, and both sides are hypocrites...as are ...","post_message":"So: Shep Smith just called out Donald Trump's lies about Russian election interference on Fox News. \"It was brought up before the election. Over and over and over again.\""}]
