[{"comment_id":"10153562770079228","commenter_b":"Lol right^^^?","commenter_a":"Should be fired","post_message":"She complained about protesters blocking rush hour traffic on I-70"},{"comment_id":"10155246118099749","commenter_b":"Just the words am looking for..... Thanks Gladys!!!!!!","commenter_a":"Awww! Whoever is using this little girl for political propaganda should know that she just won't get him or her any positive result.","post_message":"The seven-year-old girl, who became the symbol of the tragedy unfolding in Syria, has addressed President Trump in a moving video."},{"comment_id":"1133897243307426","commenter_b":"Matt AtkinsonJack Nicholls looks like im moving","commenter_a":"Luis Barillas this reminds me of donuts after work. Hahaha","post_message":"Not recommended for our home viewers.... @webpagelink"},{"comment_id":"10153373415836130","commenter_b":"That's right.","commenter_a":"They NEVER thought it was a bomb. If they had, why was the school NEVER evacuated? They were racist, bigoted asses who lied when their hatred was bared to public scrutiny","post_message":"The family is “still deciding where he will go next.\""},{"comment_id":"1831610420459597","commenter_b":"This woman is a lunatic.","commenter_a":"Just when I thought no-one could possibly be worse than Trump..","post_message":"Forget that Donald J. Trump is accused of sexual assault...and that President Bill Clinton is not on the ballot."},{"comment_id":"1218898121528016","commenter_b":"@username ..... What I really believe , is that the Republicans will have Trump tossed out of office within the first year. He is a Dangerous person , and he also has far too many enemies within the party. That is why he is surrounding himself with people he feels are loyal to him instead of people that actually have some knowledge of what really needs to be done. They are not going to forgive and forget his insults and his horrible attacks on them and their families. Ted Cruz and the gang are just biding their time until the inauguration. Pence Will be President and then the country will be run as a Christian Caliphate.","commenter_a":"Exactly right ! And make no mistake , Pence IS going to be president ! Seriously ... I don't know which one will be worse !!","post_message":""},{"comment_id":"507498396098707","commenter_b":"You guys are all nuts if you think Hillary will make a good president! She is a lier, cheat, she would bring this country down the tubes. She is insane, she is a felony and belongs in jail. If anyone else did what she did they would be in jail for life. Wake up democrats I'm sure there is someone else out there, who can do a much better job! Just because you guys want a woman in the White House she is definitely the wrong choice!","commenter_a":"She's a chameleon who will do anything for power, prestige and to keep her ego stoked.","post_message":"No one does politics as good as a Clinton."}]
