[{"comment_id":"514850542008234","commenter_b":"Tyler, youz a lil bitch!","commenter_a":"Psshh* his Dad is a fucking Islamic nut, we all know what that kid was up to, this kid is PROOF how dog shit socialists insane the media is. What an embarrassing joke.","post_message":"“Wow. Just wow.”"},{"comment_id":"10153359522561051","commenter_b":"I'd be waiting every day to catch those bitches.","commenter_a":"I hope she caught her in the parking lot.","post_message":"When this woman's 2-year-old son came home with these marks on his leg, she marched down to his school and demanded to see the surveillance footage. Now she's even more outraged."},{"comment_id":"1089143724523512","commenter_b":"Jenny Magnanelli I would pummel him.","commenter_a":"Travis Kieska","post_message":"A Texas mother wants everyone to stay aware when out shopping with your baby. A man walked up picked up her 14-month-old without permission. When confronted, the man never spoke to the mom, just addressed the baby, then left the store with no merchandise. #NBC5Now More: @webpagelink"},{"comment_id":"10153163452101770","commenter_b":"sick thugs","commenter_a":"Good! Time to show respect..","post_message":"Two students who attend a public high school in small-town Tennessee are reportedly spending the first weekend in December in jail because they wore saggy pants to school one too many times."},{"comment_id":"843529112375874","commenter_b":"About time someone takes a stand. Great job now everyone else needs to fall in line and do the same.","commenter_a":"Good for them","post_message":"REVENGE: French Attack Mosques And Blow Up A Muslim Kebab Shop Looks like the French have had enough of the Muslims immigrants living there and are fighting back! @webpagelink"},{"comment_id":"1369450476431551","commenter_b":"take your Muslim BS and shove it !","commenter_a":"The current jews inhabiting Israel now are not the descendants of Prophets Jacob/Israel. . The true descendants of Prophet Israel moved to Egypt and they inhabit Egypt currently.. do not forge the history","post_message":"WHO SAYS THERE IS NO GOOD NEWS IN THE WORLD?"},{"comment_id":"10156528764475594","commenter_b":"shut up, entitled lady","commenter_a":"Wow! A plethora of opinions...negativity abounds! What happened to \"if you can't say anything nice, don't say it at all\". I usually don't post but...","post_message":"#BREAKING: According to a report, Scalia arrived at the ranch Friday and attended a private party. When he did not appear for breakfast, a person associated with the ranch went to his room and found a body."}]
