[{"comment_id":"10154776227370399","commenter_b":"Listen to all the cry baby's all the little bitches are just jealous because they don't have what she has and besides it don't make a damn if her daddy gave it to her. So just shut the fuck up","commenter_a":"It's called Democracy. Don't like a company, don't buy it. It's evident large companies want to distance themselves from tRump and his administration.","post_message":"\"If Ivanka were anyone else’s daughter, she would be praised as a trailblazer.\""},{"comment_id":"1026050264097061","commenter_b":"illigals should not be able to vote period","commenter_a":"I agree, if sending all illegals back to where they came from will save lives, then do it and to the illegals be damned!!","post_message":"YES!!"},{"comment_id":"1687768148176964","commenter_b":"Just love that woman","commenter_a":"Love it","post_message":"YES This is why we LOVE you, Reba McEntire!"},{"comment_id":"10153715951406002","commenter_b":"There are not enough words to describe the opinion I have of this woman and the her unspeakable actions.","commenter_a":"In my eyes what she did is not much different than an abortion.","post_message":"A 24-year-old Eastpointe woman who already has three children is charged in connection to the death and abandonment of a newborn who was found at a Roseville recycling center."},{"comment_id":"10153784012776337","commenter_b":"Bitch you won't riot. You'll cry !","commenter_a":"if you kill glen we riot","post_message":"HE TRIED! One The Walking Dead character would still be alive if producers had listened to Andrew Lincoln..."},{"comment_id":"10152867281821051","commenter_b":"Give it your best shot bitches","commenter_a":"Full of crap","post_message":"ISIS just announced the specific targets they’re looking to blow up – including the American ones."},{"comment_id":"1455671454485613","commenter_b":"I thought alcohol is not allowed in their religion of peace.","commenter_a":"Drunk and drugged? Classic!","post_message":"The Rabbi looks like a natural at Jew Jitsu..."}]
