[{"comment_id":"544768002395182","commenter_b":"No election has ever seen such sore losers! And they were accusing Trump of this type of behavior if he lost.","commenter_a":"what a jerk and pathetic American---","post_message":"He's crossed a line."},{"comment_id":"1402866583068901","commenter_b":"HOW DO YALL EXPLAIN RICE COMMITTING CRIME AGAINST THE U.S, HOW BOUT HOW OBAMA LIED ABOUT ASSAD NOT HAVEING CHEMICAL WEAPONS. OBAMA LIED ! HOW BOUT TRUMP BEING PROVEN RIGHT ABOUT THE SURVEILLANCE ON HIM AND TEAM! HOW DO YOU FELL ABOUT YOUR CHILDREN BEING TAUGHT SHIRA LAW IN SCHOOL. ECT....","commenter_a":"I am glad to see to the media is holding their ground and calling him out. We need them to stay strong and sound the bullshit alert as needed.","post_message":"Trump lied SO much today, CBS had to call him out. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1391331507694716","commenter_b":"Shut up hoe","commenter_a":"It's really hard to see the rest of us as people when you have to distance yourself with your extreme views and lifestyle to find some amount of self esteem. Keep fooling yourself apparently NBC loves putting you out there to keep poking us in the eye, but we know we are right and you are wrong. That is the standing in America right now.","post_message":"Rachel Maddow was nearly hysterical over Trump's speech. #RNCINCLE"},{"comment_id":"10154471840033433","commenter_b":"John Mossman well then he took one for the team when he helped conceive his daughters.","commenter_a":"Worst Muslim eva. Eating bacon on a non zabihah beef burger, drinking beer, smoking, wearing shorts, not observing Ramadan...","post_message":"Pants on Fire for town hall audience member: \"You know our current president is (Muslim). You know he's not even an American.\""},{"comment_id":"10153558491861051","commenter_b":"Holy hells crybaby slavery ended 150 plus years ago u were no slave no one in america today owned a slave sorry your ancestors got sold to whites by other blacks and were forced to come here and work but no one alive today is responsible for it how about a lil respect for the northern army who marched on thier own people to free the blacks i always hear the we were slaves evil white mans fault but when in history has a race fought itself to free another race?so many northerners died freeing blacks for what so theu can bitch and moan and blame all whites","commenter_a":"By legal you mean taken from Africa to work (no pay, against our will, beaten, raped, broke our families a part and more), on you fields of dreams (plantations), so that American can prosper because you sure tried to make it hards for blacks, than you are white I mean right Mr (Master) Tump","post_message":"Trump says he opposes all illegal immigration, but firmly believes that legal immigrants are the backbone of America. Do you feel the same way?"},{"comment_id":"10153226517872232","commenter_b":"Probably...","commenter_a":"And while all were watching the fight 1 or more were most likely walking out with merchandise","post_message":"CAUGHT ON VIDEO: Several women got into a brawl Friday afternoon inside the popular Rittenhouse Square clothing store, Zara --> @webpagelink"},{"comment_id":"10153951989588701","commenter_b":"Is not like police had other things to do","commenter_a":"Seriously a 38 year old man. Grow up","post_message":"The Camas Police Department said every available officer responded to the scene and canvassed the neighborhood looking for a suspect that didn't even exist."}]
