[{"comment_id":"10153552144846636","commenter_b":"Wow.. boo hoo. There's no \"controversy.\" Just a few crybaby parents who probably don't like soccer. This team is generating money in the Yukon community and also generating money for the school during a time of need. People should be thankful, not critical. This team isn't cutting into the school budget in any way, chill out.","commenter_a":"KFOR you need to get rid of the pop up ads your page uses!! Can't read a complete story or watch a video without getting a redirect to somewhere else. You are the only news station page there are issues with!","post_message":"\"By no means was it ever intended to say hey this is ours now.\""},{"comment_id":"10153382839234312","commenter_b":"No not sisters I read THEIR blog. Girls visiting - NOT SISTERS.","commenter_a":"No charges were filed. He was a minor. The girls were not his sisters! MOVE ON!","post_message":"Josh Duggar apologized Thursday and abruptly resigned his job at the Family Research Council in Washington, one of the leading conservative groups fighting abortion and gay marriage among other causes."},{"comment_id":"1043158469105219","commenter_b":"That's the spirit. Women, don't let anything keep you from making sandwiches!","commenter_a":"Suck it up buttercup,not everyone likes tattoos..","post_message":"'I don't understand how tattoos can stop me from making a sandwich'"},{"comment_id":"1594655060832823","commenter_b":"Put her out there in the line of duty unarmed and we'll see how fast her mind changes!!!!!!!","commenter_a":"Impressive stupidity","post_message":"SHE'S INSANE!!! There's no GREATER Threat to America than these liberals who believe our Military, Guns and Police Officers are Dangerous! Lets get 5000 SHARES if you think these people dont DESERVE the freedom our military provides them!"},{"comment_id":"682571568600088","commenter_b":"I am so sick of hearing this offends the Muslims that offends the Muslims what the hell are they living here in America this is our country go back to where you came from because you offend us","commenter_a":"DONT LET THEM DO IT!!! Don't keep the truth away from AMERICA. Don't let them do it.","post_message":"Schools are removing the Holocaust for curriculum because it offends Muslims. This is could be the most ridiculous thing I've ever heard. Do you think they should keep the Holocaust in history lessons?"},{"comment_id":"10153233109924170","commenter_b":"DEPORT ALL ILLEGALS !!!!!! Put Americans back to work !","commenter_a":"hes an idiot","post_message":"Chuck Schumer is doing his absolute best to play the blame game in regards to his terrible immigration bill. ...And it's all about paving the way for 2016 race-baiting."},{"comment_id":"670286056475622","commenter_b":"@username Andrew Givney","commenter_a":"Jordan Monroe","post_message":"'Tis the season to turn up."}]
