[{"comment_id":"537397173122691","commenter_b":"Letting illegals into the country","commenter_a":"Is there anything that does not get lefties in an uproar? Anything at all?","post_message":"This photo has San Francisco Leftists in an uproar!"},{"comment_id":"576110785930150","commenter_b":"@username did she grab them by the pussy?","commenter_a":"Read stories that when Slick Willie was president, the spent more of their time protecting him from Killary than anything or anyone else when she went on her ballistic tantrums.","post_message":"Not only is she corrupt, she's also beyond rude and disrespectful to those who protect her very life. So many who've worked for her attest to her nasty nature. natl.io/ghciVB"},{"comment_id":"10153353453448132","commenter_b":"She is a brat !","commenter_a":"I love her ! Hopefully she doesn't become a total brat","post_message":"AMAZING!"},{"comment_id":"1313910325313867","commenter_b":"Some body give me one logical reason to have women in combat.","commenter_a":"There are some exceptional women who can and have performed well. However, truth in science shows overall. Men hold up better. Women break down faster. So many things women do better. Leave the grunt work to us grunts.","post_message":"When will \"the party of science\" accept the truths that science tells us?"},{"comment_id":"10153724515436770","commenter_b":"She has no womb or ovaries.","commenter_a":"Transgenders are just psychologically \"challenged\" individuals with a normal complement of either male or female sex chromosomes. A genetically male transgender would (quite correctly) not be allowed to compete in a woman's race whereas a genetically female transgender would only get beaten were she to compete in a male race. Caster is (it seems) totally different. If an intersex she has two X chromosomes that would normally make a female but, unlike true females she also possesses male Y chromosomes that will give some male characteristics. If she has Y chromosomes then she isn't qualified to compete in female races but, as with female transgenders, there is little point in her trying (and she should not with two X chromosomes) to compete in male races.","post_message":"South African runner Caster Semenya dominated the women's 800-meter final Saturday in Rio, finishing well ahead of the competition to take home the gold medal. Turns out Semenya is widely believed to be “intersex.\""},{"comment_id":"10154422219571509","commenter_b":"Guys it's an easy fix. Just vote for whoever is black in any movie that's how they want it","commenter_a":"I never watch that mess anyway. I do love movies but I'm not into Hollywood all patting each other on the back.","post_message":"When it comes to diversity at The Academy Awards, most Americans shrug their shoulders."},{"comment_id":"10153880559652411","commenter_b":"I hate to see what she did when she got home!! Poor Billy run bill run!!","commenter_a":"Trump won hands down. Put her on the defense from the beginning and she stayed there. She just gave America that fake smile like she always does and then pretends everything is just perfect. Give me a break! I know she was extremely angry with some of the truthful comments Trump was saying and I could see that in her facial expressions. If it wasn't for the liberal media Trump would be miles ahead!","post_message":"#KenBone's overnight fame was fueled by his snazzy red sweater, white shirt-tie combination, his thick mustache, his disposable camera and of course, his catchy name, according to social media."}]
