[{"comment_id":"10153511380259641","commenter_b":"I can't believe some of the comments here - So much hate {that's not justified} :/","commenter_a":"RIP the old England, lost to Islam now.","post_message":"#TBT:"},{"comment_id":"10153759061706051","commenter_b":"This is soo EVIL & SICK!!! Where were\\\\ R the kids parents??? Future Monsters in Society?","commenter_a":"poor little guy. he wanted to belong with the older ones. I hope the parents of this little guy sue the crap out of the murder's parents. The older kids had to be displaying signs of aggression.","post_message":"A 6-year-old boy was brutally tortured and killed by 5 other children. It gets worse."},{"comment_id":"10155548661776509","commenter_b":"You are right, it isn't Trump supporters, this latest hidden Veritas video will give you a hint: @webpagelink","commenter_a":"I don't think it was Trump supporters who did this, everything is spelled correctly.","post_message":"Vandals set this black church ablaze and scrawled the words 'Vote Trump' in crude, white spray paint. @webpagelink"},{"comment_id":"10152605770366680","commenter_b":"She certainly has enough raging male testosterone !!!!","commenter_a":"She is totally useless and has done absolutely nothing of benefit to the Democratic Party.","post_message":"Running for Senate might be an elegant solution for a woman with no other way to advance her career."},{"comment_id":"1095502743841518","commenter_b":"Jenny Davis so sorry you are correct. It was friends nothing to show.","commenter_a":"Lets all stand behind trump, the winner of the republican party!","post_message":"Who do you think Donald J. Trump should choose as his running mate?"},{"comment_id":"10154357156724062","commenter_b":"Short girls struggle too the regular is always too long😔","commenter_a":"Does she wear jeans & where does she purchase them? I'm nowhere near her height but have a helluva time finding them long enough. lol","post_message":"Who is the model with the longest legs in the world? Turns out a Houston girl can now claim that title..."},{"comment_id":"10153148530580329","commenter_b":"It's not a fuckbuddy it's a weak ass pussy who ain't bout shit","commenter_a":"What is a f*ckboy? I must be getting old...","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
