[{"comment_id":"10155201901781162","commenter_b":"Maybe the writers can be more select on how they word their headlines. Maybe they do this on purpose cause they get a kick out of reading the comments. You never know.","commenter_a":"Reading is key... trumps pic did employ an illegal, but upon finding out ended her employment and aided in getting her assistance in getting legal status ... this is why america is the way it is... read a title and jump to conclusions... most of the people protesting can't really hold a conversation about why there out there.. other than 1 line headlines they repeat over and over... it's sad","post_message":"President Trump's labor secretary pick, Andrew Puzder, admits that he and his wife employed an undocumented housekeeper for years...@webpagelink"},{"comment_id":"1809742349269568","commenter_b":"IF YOU CAN DUMP TRUMP OVER SOMETHING HE DID YEARS AGO IN PRIVATE LIFE. THEN HILLARY SHOULD BE IN PRISON NOW.LOOK AT 5HE TREASONOUS ACTS AGAINST AMERICANS. THIS IS ALL SHE CAN COME UP WITH TO DEBATE TRUMP SHE HAS LOST ALREADY.","commenter_a":"It's not happening folks, he IS our next president !!!! He has done nothing most guys haven't done around a bar table or a camp fire with their friends, and most girls have done talking to their girlfriends and men, his words can't even come close to what that female has done, so get over it he is the only smart choice !!!!!","post_message":"Lawyers at the Republican National Committee are assessing what legal remedies, if any, could allow the committee to remove Donald Trump as the party’s standard bearer."},{"comment_id":"10153628379818145","commenter_b":"Feed your own kid. Simple fix. And teach the little demon to sit still and learn.","commenter_a":"My son is 6, and gets recess twice a week!!!! Twice!!! He then gets in trouble because, as most 6 year old boys, he gets out of his seat and wiggles all day. But the kicker is what he's fed! Sugar sugar sugar for school breakfast! He's even come home and told me he had a freaking pop tart! What the crap! Then he's punished for their stupidity. Schools need to lay off the sugar, and allow for atleast 20 minutes for recess. I vote for 20 mins twice a day. My son would be SO much better for his teacher! (Oh, and I agree with many comments....get rid of this common core crap! It's just that....CRAP!!!)","post_message":"Do you think that Florida elementary schools should be required to provide 20 minutes of recess every day?"},{"comment_id":"10153163723737377","commenter_b":"She belongs in jail!","commenter_a":"And Huma's email said something about after her nap. Seriously this evil woman is too old to hold the highest office in the United States of America!!!!","post_message":"\"These new Benghazi emails are disturbing and show why Hillary Clinton and the Obama administration had to be forced to disclose them,\" said Judicial Watch President Tom Fitton in a release to Newsmax. Watch more on this tonight on Newsmax TV- Directv 349, Dish 223, Verizon FiOS 115, or Newsmax App."},{"comment_id":"1072932319412282","commenter_b":"#BuildTheWall","commenter_a":"I hear the Train a comin, It's rollin' 'round the bend. And I ain't seen the sunshine Since a Trump win. I'm stuck in Obama's nightmare, And I just want to be free. But the TrumpTrain keeps a rollin' Down to Washington, DC. I bet there are voters, eating in dining cars, They're probably cheering and smoking big cigars. I know Obama had it coming, I voted for hm and can't be free. But the train keeps a movin' And that's what tortures me. Watching the TrumpTrain Rollin' down to Washington, DC.","post_message":"Join us in Indianapolis at 4 pm today for a major announcement!   RSVP here: @webpagelink"},{"comment_id":"518655931675108","commenter_b":"@username no all men do not have affairs!!","commenter_a":"Thank you Marine for speaking the truth Hillary is a liar and murderer and should be put in the electric chair, Bill is as bad as Hillary and I can understand why he was screwing Monica. From what I read Hillary likes screwing with other women","post_message":"Marine Confronts Hillary To Her Face About Benghazi, And Then THIS Happens [VIDEO]  Let's show this man our support!  Can we get 30,000 'LIKES' for this Marine?"},{"comment_id":"539180629598484","commenter_b":"Good one. That made me chuckle.","commenter_a":"Because nothing screams, \"I'm protecting the environment\" like flying your private jet to accept an environmental award.... lol","post_message":"Some eyebrows were raised when DiCaprio took a private jet from Cannes to New York City to pick up an award from Robert De Niro's clean water advocacy group."}]
