[{"comment_id":"636643946488247","commenter_b":"WHY DON'T YOU JUST SHUT UP-SAVE YOUR MUSLIM THREATS FOR THE MUSLIMS ! LONDON SURE SCREWED UP WHEN THEY LET SO MANY OF YOU MOVE INTO LONDON-AMERICA WILL NOT MAKE THAT MISTAKE !","commenter_a":"They will try to attack us anyway so if we don't allow them in it will be easier to contain the ones who are here already.","post_message":"The new Muslim mayor of London has issued a warning to Donald J. Trump: Moderate your stance on Muslims, or they will launch more attacks against America."},{"comment_id":"1030297853698998","commenter_b":"Wow NOW THIS IS A TRAGEDY! A YOUNG BOY GUNED DOWN FOR NO REASON BY A THUG GANG MEMBER ! I GUESS IF A BLACK MAN KILLS A BLACK CHILD IT DOESN'T MATTER! BUT IF A WHITE COP KILLS A BLACK THUG COMMITTING A CRIME IT'S A BIG DEAL ! LORD FATHER GOD TAKE THIS PRECIOUS CHILD AND HOLD AND CHERISH HIM IN YOUR ARMS ! COMFORT HIS FAMILY AND SEE THE JUSTICE IS FOUND FOR THIS CHILD ! AMEN","commenter_a":"So where is the Black Lives Matter group now?","post_message":"Chicago Black Gang Member Lured Child From Playground And Executed Him Point Blank  You mean #blackLivesMatter protestors are not rallying for this 9 year old boy who was executed by a thug! I guess his Black Life Didn't matter   @webpagelink"},{"comment_id":"959204997435717","commenter_b":"Well.... sometimes women are raped...","commenter_a":"Will this decision really stand? Don't get my hopes up.... Can it be vetoed? Will it stand? (I hope it stands but We the people have been asking them to defund PP for a long time and they haven't listened!)","post_message":"This Congress and its relevant committees must complete a thorough investigation of the disturbing accusations evidenced in the Planned Parenthood videos before another taxpayer dollar goes to this controversial organization. These funds can be better used providing legitimate health services for women in places like North Dakota"},{"comment_id":"10158146730430354","commenter_b":"'@username pay up bitch @webpagelink","commenter_a":"No way. Not a sanctuary city.","post_message":"***BREAKING***"},{"comment_id":"1548781162079004","commenter_b":"Found the stupid feminist.","commenter_a":"if U want to End ALL Abortions, eliminate the NEED for abortions!! STOP RAPE First!!!","post_message":"Flip the Script is back!  We asked pro-lifers why they think abortion is murder  and then they sorta threatened to kill us."},{"comment_id":"899588953421066","commenter_b":"Even Satan and the demons in Hell believe God exists. They know He does. Why aren't they in Heaven?","commenter_a":"There Will Never Be An Excuse Big Enough To Convince Our GOD That Killing Innocent Babies Is Okay! :(","post_message":"Do you agree?"},{"comment_id":"10156316346195725","commenter_b":"'@username , but Muslims will not vote for him","commenter_a":"We need you now Donald Trump!!!","post_message":"Remember, I was the one who said attack the oil (ISIS source of wealth) a long time ago. Everyone scoffed, now they're attacking the oil."}]
