[{"comment_id":"849951858441198","commenter_b":"This guy is a freakin joke.","commenter_a":"Thank you, much respect to you for not being one of the okie dokie.","post_message":"This one says it ALL!   Video by Occupy Democrats, LIKE our page for more."},{"comment_id":"10153001992671770","commenter_b":"discusting","commenter_a":"Who cares ?? I DO NOT CARE !!","post_message":"Lather, rinse, repeat. Kim Kardashian's posting cleavage shots again."},{"comment_id":"825517894248057","commenter_b":"Sure I can agree with that but you need a way to pay off debt. Taxes are revenue for the government which are used for various expenses. When you balance the budget that means you are simply not paying down debt but spending less than you have. We need to start moving in a direction where we will run surpluses and thereby pay off previous debt. Just like a company, a government should not be run by debt. Now theoretically by increasing taxes = more revenue which could be used to pay off debts but that doesn't always work in modern society. We are a people who now are all run my debt, we own nothing anymore.","commenter_a":"Realistically the only way to reduce the deficit is increasing taxes. The problem is Hilary wants to increase to help her buddies and Bernie wants to increase taxes to add more social services. The other two will uses those taxes, cut spending and find other ways to be more efficient to reduce deficit.well trump will cuz Cruz will just have to give money to his buddies in the establishment","post_message":"HA! Look at how much the tax plan of each candidate will directly affect your paycheck...  Your jaw will drop when you get to Bernie Sanders..."},{"comment_id":"10156390039050725","commenter_b":"That would be the best way to guarantee Hillary into the White House!","commenter_a":"I will!","post_message":"A new poll indicates that 68% of my supporters would vote for me if I departed the GOP & ran as an independent.   @webpagelink"},{"comment_id":"10153177685071800","commenter_b":"Lol all these super women who, according to themselves, work so much harder.... Men work more hours, more dangerous jobs. Statistics are a bitch. The pay gap is a myth. Plain, simple. Even a feminist can see it. But yall keep pretending. Keep that victim thing going.","commenter_a":"People. It takes literally five minutes or less to find a credible publication explaining exactly what the wage gap is, and it really isn't anything in fact. It's just kind of inherently flawed, it is NOT based on men / women doing the same work but rather every man's wage and every woman's wage for EVERY FULL TIME JOB PERIOD, from waitress to business executive. It doesn't mean men are paid more automatically for being men, it just means men are generally getting the higher paying jobs (which there are legitimate sociological reasons for), OR men are more willing to do dirty / dangerous jobs that women are generally unwilling to do. So assuming of ten... Oh I don't know, sewer workers making 20 dollars an hour , eight are men and two are women, and of ten store clerks making 13 dollars an hour , eight are women and ...","post_message":"Jon: You're telling me we're going to print a human heart out of a Xerox machine before women get pay equality? Kristen Schaal: I'm telling you we're going to print human hearts out of Xerox machines 30 years before women get pay equality!    ► Jon and Kristen Schaal discuss the gender pay gap: @webpagelink"},{"comment_id":"1176020919129046","commenter_b":"People are saying trump is unfit to lead the country","commenter_a":"Guys I'm scared... Polls are showing crooked Hillary leading by double digits now.... Someone please give me a virtual hug and tell me everything is going to be okay","post_message":"Many people are saying that the Iranians killed the scientist who helped the U.S. because of Hillary Clinton's hacked emails."},{"comment_id":"1765509470395082","commenter_b":"This morning someone on ABC said Trump supporters don't take him seriously. Republicans never gave President Obama a chance. They blamed him for everything and they worked tirelessly to make him a one term president. If Trump wins America will be the laughing stock. Even the Russian government knows that. Donald a Trump blames everyone democrats for everything that is wrong but he has yet to say how he's going make America great again. Unless building a wall to keep out the illegals is how few intends to make America great again. I was team Bernie but since he didn't make the cut I have to go with the lesser of two evils. I can't vote for someone who fuels hate and bigotry.","commenter_a":"It's not up to this man to judge anyone soul. He is filled with hate against Mr Trump, he need look inside to his own darkness!!","post_message":"Khizr Khan, the father of a US soldier slain in Iraq in 2004, says Donald J. Trump has a 'black soul.' @webpagelink"}]
