[{"comment_id":"10157050332450354","commenter_b":"This bitch is a PSYCHO!!!!!!!!! I am 100% convinced now ( before I couldn't be totally sure ) that those bruises on her forearm were made prior to Cory grabbing her. Corey grabbed her biceps the video shows more likely than her lower arm. She has 0 credibility and will never get a job as a respected journalist again","commenter_a":"You stupid bitch you need to let it go. There was no case and you should be the one arrested. You will be lucky if you can get a job delivering papers. Your a liar just trying to get more than your 15 which by the way is up. You didn't do what you were told to do just like every other common thug that feels they can what ever they want. Now shut up and go home before you make a even bigger ass of yourself","post_message":"“The entire situations just seem to me a little sketchy....\""},{"comment_id":"10153955448341350","commenter_b":"She's a cold, calculating bitch.","commenter_a":"From her big warm embracing feminine heart ... are you kidding me? Voting for Hillary because she is a woman, makes no sense at all.","post_message":"\"I want my president of the United States to make decisions on my behalf based on her experience, her command, her intelligence, and from her big, warm, embracing, feminine heart.\""},{"comment_id":"1729707230595759","commenter_b":"See, you came here legally. That was your big mistake.","commenter_a":"I immigrated from Europe legally paying my dues. Before they even gave me the visa to enter in USA I had to travel across the country and spend a day at a hospital designated by the USA consulate being checked out for diseases. Had to have a certificate from the tuberculosis center that I don't have tb. And after the consulate got my results I was issued the visa and given the green light to come to USA......why did the laws change?","post_message":"Are Americans aware of this?"},{"comment_id":"1746066945644780","commenter_b":"Sickening","commenter_a":"If Hillary wins we are fucked. All will end for this once dear nation. Adios America this nation is now a dump China & Russia are the leading nations now. Deceiving Hillary is going to backstab everyone. She will do anything to get your vote but at the end you will see her lies.","post_message":"Does Trump's violent rhetoric and bigotry remind you of something? Let's take a look back at history and find out... Big thanks to Marianne DeMarco for making this video."},{"comment_id":"840187412685267","commenter_b":"How about no sex till your married. No need for pills or protection. Problem solved","commenter_a":"you can't fool Mother Nature","post_message":"New commentary from Matt Walsh on birth control. \"Where is the feminist outrage when you need it?\""},{"comment_id":"10152610870925950","commenter_b":"And go on a global eradication war to execute 2 billion Muslims.","commenter_a":"AND; the 100,000 troops need to come from the Middle Eastern nations (not the U.S.)!","post_message":"According to a CIA insider, it would take 100,000 ground troops to effectively respond to ISIS."},{"comment_id":"500763203381607","commenter_b":"This crap started with Clinton. Oliver North warned us what was coming.","commenter_a":"He warned Bush,but wasn't taken seriously.","post_message":"Do you agree or disagree with Donald Trump on this?"}]
