[{"comment_id":"10153118377188812","commenter_b":"She is mitochondrial eve. Not some delusional religious eve. All women contain the mitochondrial DNA of the first woman. It is passed down through all women. It is also evidence female came before male. Looks at my nipples* what do these do?","commenter_a":"She's 5 million years old; She's a Humanoid-Skeleton! She's not Neanderthal, Cro-Mgnon, or Java, they named her Lucy, they were listening to Elton John's; Lucy in the sky w Diamonds when she was dug-up. She's not a Cave-Woman, just a 4'5\" Woman! She was dug-up in South Africa, I don't know what you thought but, Could This be EVE?","post_message":"Study finds 3-million-year-old ancestors were a lot more handy than some thought: abcn.ws/1CuHe7M"},{"comment_id":"10155694737870294","commenter_b":"Why not?! Criminals can do it like gun-free zones didn't exist!","commenter_a":"Doesn't matter they'll do it anyway.","post_message":"Even if it passes, each university would still be able to decide if they wanted to allow guns on their campus."},{"comment_id":"1008881259209071","commenter_b":"America is in bad shape and people can't see it. I don't understand why they are for Hillary. She can't do a thing but lie. She will do nothing for poor and middle class. How do people not see this? ?? I am amazed at how stupid people are thinking life will be better with her doing what Obama has for 8 years. Bankrupting America and millions of Americans. WHAT has she done FOR America? ?? More. ..what has she done TO America? The red states will get it right I hope. If only the people in the swing states would come to their senses.","commenter_a":"Yep, you said it right, power and money, but wait , they want your votes too, hahahahahaha hahahahahaha hahahahahaha, I am not stupid, Hillary is not getting my vote","post_message":"\"The Clintons are greedy. They love money. They love money so much they've been accused of ignoring ethics and, very likely, laws to rake in more and more money.\" – Eric Bolling @webpagelink"},{"comment_id":"10153696504537300","commenter_b":"Fidel Castro is a white elitist who took from everyone regardless of race.","commenter_a":"So this is written by someone who \"escaped\" from Cuba 46 years ago and found \"safe haven\"...please! More from the wealthy elite, whiter Cubans who wanted to keep the poor suffering so they could benefit. Tools of the racist and capitalist US government in their mistreatment of Latin American nations and Indigenous and Black people throughout the Americas!","post_message":"The latest from columnist Fabiola Santiago on the need for reform of the Cuban Adjustment Act. What do you think?"},{"comment_id":"1331908300162530","commenter_b":"This is disgusting, disgrace to America this never happen before, DJ.T is disgrace for our America, so dangerous wild animal.","commenter_a":"He is right! We unfortunately live amongst animals!!","post_message":"Trump said organized 'thugs' shut down his First Amendment rights in Chicago"},{"comment_id":"1758399887778329","commenter_b":"Hillary Clinton is as corrupt as they come, she needs to be held accountable and put in a prison cell. Corruption in Washington is running rampant and WE THE PEOPLE are sick of it.","commenter_a":"Lol... At least she appears to be truthful with her daughter","post_message":"Hillary Clinton told her daughter in an email that there was a terror attack in Benghazi, according to an email provided to the Benghazi Select Committee. @webpagelink The GOP-led committee will discuss the report in a news conference at 10a ET."},{"comment_id":"10152998005499753","commenter_b":"Woman you have no clue.","commenter_a":"I think this mom did the right thing with her son. She is a hero to me and I for one would have done the very same thing. This columnist is way off base here and I think she needs to shut it.","post_message":"Toya Graham smacked her son and dragged him away from the Baltimore riots. Now a columnist is ridiculing her and those who support her for the \"abuse.\" @webpagelink"}]
