[{"comment_id":"10154262733576615","commenter_b":"The men don't have to be gay .. the killer doesn't have to be gay.. if there even is a killer, it could be male or female.. (although the odds are low of that ) .. I'm just saying it's funny how I feel it would be different if this many bodies were found and they were female. I don't like how ppl instantly assume this many men just walked into the river accidently drunk.. especially when their have been bodies found in garbage cans and other areas as well. It may be a big city but a serial killer theory is plausible and cannot be excluded when this many individuals seemingly \"walked into the river\" accidentally. The men are young mostly college aged looking ... if someone is targeting them it could be for a variety of reasons. The only thing they seem to have in common is they ...","commenter_a":"I can't be the only person that's starting to get the impression there may be a serial killer in Pittsburgh","post_message":"JUST IN: Skeletal remains found earlier this week in a trash can have been identified as Dominick Brown, a Penn Hills man who went missing in 2012, his family tells Channel 11 News."},{"comment_id":"517364508436536","commenter_b":"The other candidates are disappointed because they need Trump's ideas","commenter_a":"I wander if I can have my cable provider remove FOX channel from airing in our home period...ha..oh, I can do that. #TRUMP !!","post_message":"The Trump campaign is saying that Donald J. Trump will skip Thursday’s Fox News-Google #GOPDebate. @webpagelink"},{"comment_id":"735262859947913","commenter_b":"If Melania was one of my students, she would be sitting in my office now for a little chat about plagiarism and the consequences according to school policy. Similar to students in the past, she is defensive and blaming others for her plagiarism.","commenter_a":"And the Deval Patrick 10/15/06 vs President Obama 2/8/16","post_message":"Compare Melania Trump’s speech with Michelle Obama’s 2008 speech. Donald J. Trump campaign denies the speech plagiarizes parts of Michelle Obama's: @webpagelink"},{"comment_id":"10153585291913132","commenter_b":"The only reason 14-16 is a plus size model is because of fashion magazines. She is a NORMAL size model. That is average size.","commenter_a":"The woman depicted in this picture is a \"plus sized\" model and she's drop dead gorgeous! I wish they would STOP trying to glamorize Tess Holiday... she's pretty and if she truly feels good about herself being morbidly obese and unhealthy then good for her, but she's sending the wrong message!","post_message":"\"All women need to do to get a bikini body is to put a bikini on.\" - Tess Holliday"},{"comment_id":"979742035426993","commenter_b":"Send this JEW to ISREAL , they don't Belong in the USA !!","commenter_a":"What an idiot and people are ACT voting for him","post_message":"COMMUNIST LUNATIC Bernie Sanders Just Called For Total Gun Confiscation! @webpagelink"},{"comment_id":"10150664369884999","commenter_b":"Rule of thumb: Economists don't generally have armies at their disposal to help overthrow democratic governments who oppose their \"theories.\"","commenter_a":"You'd think true conservatives would be happy about the expansion of rights (gay marriage) and making sure everyone chips in on the healthcare system everyone uses (Obamacare). I guess they're not conservatives, just simple Republicans.","post_message":"The way some Republicans tell it, America is a pretty awful place these days."},{"comment_id":"10156528764475594","commenter_b":"shut up, entitled lady","commenter_a":"Wow! A plethora of opinions...negativity abounds! What happened to \"if you can't say anything nice, don't say it at all\". I usually don't post but...","post_message":"#BREAKING: According to a report, Scalia arrived at the ranch Friday and attended a private party. When he did not appear for breakfast, a person associated with the ranch went to his room and found a body."}]
