[{"comment_id":"10153075277316770","commenter_b":"This hag is despicable,","commenter_a":"anything that comes out of this woman's mouth is bullshit just saying","post_message":"Debbie Wasserman Schultz says Republicans \"alienate women, alienate the LGBT community... [and talk] about it at their debates. Kicking immigrants out of this country, talking about taking away healthcare from Americans, talking about which candidate is worse for women and take their healthcare away, deny their rights, oppose equal pay for equal work.\""},{"comment_id":"1369855736388104","commenter_b":"Those women are vicious hacks for hillary.they don't care what she did against America or the corruption & lies they are all part of the corruption .","commenter_a":"What a waste of her time. They just want their ratings to increase with all the drama","post_message":"The claws really came out..."},{"comment_id":"913510862078500","commenter_b":"This women is a idiot and if she thinks that these charges are going to stick she is crazier than hell.. She is a real nut job.. Glad she is in Baltimore hope the hell that is where she stayed..","commenter_a":"She's doing a great job and that's a signal for critics and whiners to just move along!","post_message":"Competing interests?"},{"comment_id":"10154190789236336","commenter_b":"This is so exaggerated. I bet this was seen as an opportunity and she had someone else bruise her. She did not almost go down and showed no pain or upset on the video. She also shouldn't have approached Trump like that in the crowd. His life has been threatened so someone would have pushed her back. Maybe she should stay home. Also it sounds like this is her M.O","commenter_a":"Too bad...she wasn't in ANY way hurt...she's shooting for her 15 minutes of fame...","post_message":"\"We saw libel, defamation, slander, smearing of her reputation, simply for trying to do her job,\" Katie Pavlich said. \"This isn't just about simply one reporter. It's a bigger issue of the role of the press in America.\""},{"comment_id":"1243167749095092","commenter_b":"When i said this far. I'm talking about she's the presidential candidate. Her ass should be in jail by now.","commenter_a":"WAIT!! Who is to say she has gotten \"This Far!\" The News Media!?? Her rallies attract less than 400 people on the average. I believe. I know democrats who are voting for trump that have told me They don't even like him but Hillary will destroy this country! Everything we see and hear is from the \"NEWS MEDIA!\" Listen America, I saw and heard an interview with George Soros overseas last week. He said Donald Trump will win the popular votes of the American people by a \"Landslide!\" BUT!..We have found the Achilles heel of Western Civilization. The electoral votes. Hillary will win by the way the electoral votes have been put in place....America this is scary. The election is rigged way more than the news media is letting us know. I'm sure Donald Trump knows this too. Personally I am praying and asking God to intervene in this election ...","post_message":"Arkansas's attorney general just issued a jarring statement about Hillary Clinton, the state's least favorite daughter.  What the AG says needs to be seen by every American."},{"comment_id":"10153562677106680","commenter_b":"She wouldn't work for him with a gun to her head.","commenter_a":"Please please trump get CONDOLEEZA RICE as ur running mate. I understand that u do not want to pander, but like it or not, this elections , the woman card has been dealt unfairly by crooked Hilary. But i think looking at it positively , trump has an opportunity with CONDOLEEZA RICE. She was a magnificent SOS. Hardworking as hell , logged more air miles then any other SOS. By choosing CONDOLEEZA , trump will also show to the American voters a good example of a SOS. Besides she has great Christian values, very very qualified and better then most of her male counter part","post_message":"Paul Manafort said he'd also be 'surprised' if the front-runner put out his tax returns."},{"comment_id":"10153811889982994","commenter_b":"Isn't that what the looney bin was made for? Lock her up!","commenter_a":"Hansel and Gretel's villain just got made","post_message":"'May I have a taste?' Minnesota woman allegedly threatens to eat neighbors' children"}]
