[{"comment_id":"10153538416518445","commenter_b":"Fuck the police,bitches...always smoking,","commenter_a":"wtf","post_message":"Always A Good Reminder: Police in Legal States Are Using Social Media to Bust People for Marijuana."},{"comment_id":"10154662722072619","commenter_b":"Stupid woman.","commenter_a":"Total anti-semitic bitch; She would march the Jews to the ovens if she could.","post_message":"Swedish FM drew outrage in Israel when she linked the terror attacks in Paris and the feelings of Palestinians."},{"comment_id":"1387475997939242","commenter_b":"It's probably a welsh lamb that's fucking had enough of being raped 😂","commenter_a":"Fucking ouch!!!!","post_message":"And you thought you were having a bad day... via JukinVideo"},{"comment_id":"10154648148626509","commenter_b":"Women for Trrump!!!: \"They'll be on their knees soon enough.\"","commenter_a":"Woman and Americans for our next president Donald J Trump.. Welcome aboard it's a wonderful ride to the White House","post_message":"This mogul once said he's a member of \"the lucky sperm club.\" How Donald J. Trump sees himself, in his own words: @webpagelink"},{"comment_id":"10154399468414411","commenter_b":"Herna Suryani Fuck you you dumb cunt ..israel was given the land at the end of the 2nd world war in 1947..and all you have done since ,,is kill.. steal ...bitch..and moan.. so FUCK YOU CUNT !!!","commenter_a":"The ongoing 'Palestinian' terror attacks towards innocent Israeli citizens, leave Israel with no other choice. Israel must take tough decisions in order to protect its citizens and prevent the next terror attacks. 'palestinians' always choose terrorism over peace. Sadly","post_message":"This step will 'only increase the sense of injustice and frustration felt by Palestinians' - UN official"},{"comment_id":"657748434349749","commenter_b":"CANCEL the game, go to half time show, then go home. Terminate the remainder of football season. Have each player turn in his jersey...","commenter_a":"I WOULD LOVE TO SEE AN ENTIRE STADIUM WALK AWAY FROM THIS CRAP...","post_message":"The entire team decided to pay tribute to Kaepernick and take a knee during the National Anthem. Guess how that worked out for them."},{"comment_id":"10153814092279740","commenter_b":"Gear up and hit the streets or shut up these KEYBOARD WARRIORS Crack me up !","commenter_a":"Great Job by the Police....Suspect had ample opportunity to surrender peacefully and the KILL ZONE for an edged weapon is 21 FT..he was well within that zone and a threat to police, who are not required to retreat nor should they...","post_message":"Fla. police shot and killed a razor-wielding man suspected in a bank robbery early Saturday. Video captured the shooting:"}]
