[{"comment_id":"1792810264314039","commenter_b":"Encoded in every religion is the belief of the family unit,man and women create children and society moves on. The radical notion that homosexuals can reproduce and create this dynamic is laughable and should not be lauded as some great thing for society. Man and women really do have different roles in society and its quite apparent no matter how society wants to change it. Secondly, racism is flat out wrong but we are doing a damn good job for a country so young with diverse groups of people.Religious freedom made this country and most of its core tenets come from the Christian bible and not the quran or any other text. Churches should be taxed if they become political and held to task on their beliefs in the marketplace. The past 8yrs tried to change America but Americans bit back and won.I am not talking political just basic morality ...","commenter_a":"Let's get rid of tax free status for churches.","post_message":"What a great idea. Let's end the separation of church and state. Let's convert religious organizations into political organizations. Let's funnel dark money funds raised by religious organizations into political campaigns. Let's sanction racism, sexism, homophobia and other forms of discrimination under the guise of \"religious freedom.\" This absurd and unconstitutional idea must not be passed by Congress."},{"comment_id":"1084321754934235","commenter_b":"Get the hell out and sell the house.","commenter_a":"I'm literally crying right now hahaha","post_message":"Police in Sydney told the man neighbors heard death threats, screams and the crash of furniture being flung around."},{"comment_id":"10153576810758984","commenter_b":"Lot of good women out there but she's not one of them!!!","commenter_a":"Hillary is another Obama in a pantsuit. Maybe even worse! PPL didn't listen when Obama was exposed..... Will they listen now about Hillary?????","post_message":"I watched this over and over again to try and figure out what Hillary possibly could have been thinking. I'm still stumped. Like the news anchors reporting on this did, all I could do was laugh... Do you want to see Hillary suffer a resounding loss in 2016?"},{"comment_id":"10153808852885950","commenter_b":"She Looks Like A Damn Meth Whore!","commenter_a":"The doctor should have never inseminated an old hag like this, i am 40 and have suffered two losses and it's so hard to adopt and this psycho bitch was allowed to keep these kids...will her doctor keep doing this and letting her have more innocent babies... Poor baby May She RIP","post_message":"The 13-day-old died inside the van where her mother had left the children for 38 minutes while she visited a cellphone store, police say."},{"comment_id":"10156409954230354","commenter_b":"DUMBASS BITCH STRIKES AGAIN!!!!!#","commenter_a":"Get her out of the power supply. Feel for your own residents. One bankrupt San Bernardino. Please give our city hope .","post_message":"Nancy Pelosi’s message to Americans this Thanksgiving is that the nation’s “broken immigration system” is “cruel” to illegal immigrants. No mention of the THOUSANDS of victims of criminal illegal aliens. Pass the turkey..."},{"comment_id":"1796700900563912","commenter_b":"Stupid lady!!","commenter_a":"People need to stop ... It was a choice ... No chances could be taken .... It's sad... But the choice had to be this 4yr old little boy","post_message":"Family of toddler who fell into the gorilla enclosure at the Cincinnati Zoo & Botanical Garden said their child is “doing well” and thanked zookeepers who fatally shot the gorilla."},{"comment_id":"10153295619909384","commenter_b":"I beg to clarify this situation. As we all know, Pelosi has been psychotic for several years. I think the question that should be answered is this: How many blind and ignorant lemming liberals have kept this shameful person in the powerful position she is in, for as many years she has been elected? That is where the real shame lies.","commenter_a":"Since when do you care about Homeland security, Nancy. You who totally have supported all that obama has done to destroy the security of our nation's borders and let millions in including criminals whose own country does not want them. You are a joke and a puppet whose love of our nation was destroyed by your love of power and party. Just shut up.","post_message":"We shouldn't wait another day to remove all doubt to our enemies, to American families and to the affected workers that we will fully fund the Department of Homeland Security. My full statement: @webpagelink"}]
