[{"comment_id":"10153071085836051","commenter_b":"Kill that bitch!!!!","commenter_a":"Hell hath no fury, right? Sick, sick, sick.","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"10152854045581749","commenter_b":"Yeah. ..not so much","commenter_a":"Dear President Mr. Obama May God Bless you And your family.","post_message":"'I believe Americans are tired of the political back and forth. People want to see an agenda that moves us all forward.' —President Obama  Read the President's latest message to OFA supporters: @webpagelink"},{"comment_id":"10153030735456378","commenter_b":"Weather this is true or not I don't know,but one thing I do know is none of us would be in the water if we saw what was swimming around or beneath us!!!","commenter_a":"Hoax","post_message":"REAL OR HOAX? A video showing a great white shark circling a surfer has gone viral... but now, people are questioning its authenticity. What do YOU think? Is it real or is it a hoax?"},{"comment_id":"1311217235558559","commenter_b":"I watched and every single one of the questions by Greta and the so-called voters sounded handwritten by Trump henchmen... they each read off their question all just like they were part of Trump 's typical campaign stump speeches... That was nothing more than free air time for a Trump speech... Greta where was Ted or John?''' I am done with Greta and Hannity you just cannot trust anything they would report on again... I used to think better of Greta giving everyone a fair shake but this is just too blatantly biased... hope her ratings tank and Fox gets rid of her!!!","commenter_a":"Gutfield is a moron. Flip the channel whenever he is on.","post_message":"Gutfeld now openly mocking fellow Fox News hosts."},{"comment_id":"1275887962432212","commenter_b":"So people can get to sleep !!","commenter_a":"Seth","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"541360652655195","commenter_b":"Muslims are buggering parasites that get alone with no one","commenter_a":"NO ONE FORCED THE MUSLIMS TO LOOK. THAT WAS THEIR MISTAKE. KEEP YOUR NOSE OUT OF OTHER POEPOLES BUSINESS.","post_message":"A pastor posted this controversial sign outside his church and it caused a huge stir in the community. His response to his critics was very simple."},{"comment_id":"1376440642415680","commenter_b":"Women today have lost their values and morals.","commenter_a":"Ugly","post_message":"Dare to bare!"}]
