[{"comment_id":"901304566673644","commenter_b":"A woman's right to KILL her alive yet unborn child!!!","commenter_a":"Save the fetus- starve the child. They're not pro-life, they're pro-birth.","post_message":"Accurate."},{"comment_id":"760324150750635","commenter_b":"You sons a bitches!! Lmao","commenter_a":"Thanks a lot sister that was my favorite soda!! Gross! Jessica LeAnn Miko","post_message":"Disturbing Thing A Man Says He Found Inside A Freshly Opened Pepsi Can"},{"comment_id":"701531266646721","commenter_b":"CORRECTION : THEY'RE NOT FROM AFRICA, SO THEY'RE JUST PLAIN OLD AMERICANS ... DAMN IT!","commenter_a":"Oversensitive black couple. Correction oversensitive African-American black couple.","post_message":"Oh the humanity!!!"},{"comment_id":"801914353278362","commenter_b":"Trump will crush this fat ugly lying lady","commenter_a":"Love how the little girl scout is pointing out the cookies to you. Rock on Hillary -supporting you in Colorado. Ignore the haters inWV","post_message":"Cookie stop in Kentucky. Picked up some tagalongs and samoas before heading across the border to West Virginia."},{"comment_id":"10153227857229330","commenter_b":"I'd do the same thing - little punk needs a good whipping from his mom","commenter_a":"There is one parent in Baltimore that has her priorities straight.","post_message":"Mom of the Year? Check out what a mom did when she caught her son out rioting in Baltimore. ---> @webpagelink What would you do?"},{"comment_id":"673333352791257","commenter_b":"It is VACCINATED children getting the measles from the illegals.","commenter_a":"There will be more diseases brought in that we have eradicated ! They can't let in all these refugees and not face the problem!!!","post_message":"Illegal immigrants have been bringing a special 'gift' with them when they cross the borders. This is terrifying!"},{"comment_id":"945417468827008","commenter_b":"Whomever is behind this un-American idea, should be investigated for insanity and on legal terms. The people (or group) seem not to have any interest in America. Has Obama contaminated this too?","commenter_a":"This maybe a big mistake, he is the only one who is not under control of big labor groups and unions, plus I feel the American people are tried of the same old crap, time for a big change.","post_message":"NOOOOOOOO!!!!"}]
