[{"comment_id":"790733494450561","commenter_b":"You go girl.","commenter_a":"good goin!! nice shot!","post_message":"65-Year-Old Woman Shoots Robber Michael Bontaites Square In The Chest. Thank god for the 2nd amendment. Do you support her right to bear arms?"},{"comment_id":"1135192056570151","commenter_b":"Margaret, did you even watch the debate? I think you were the one snorting. Poor Hillary was having a meltdown. Her rigged plan with crooked moderators backfired.","commenter_a":"They are calling the debate the \"sleazy stalker\" debate! Trump not only was of absolutely no substance but he was creepy! Hillary WON! Go Hillary!","post_message":"A good night for Democrats."},{"comment_id":"1410720895627548","commenter_b":"DISMANTLE THE USELESS ORGANIZATION CUT THEIR FUNDING !MONEY TALKS,","commenter_a":"I hope so!","post_message":"Is Trump getting closer to supporting H.R. 1205, the 'American Sovereignty Restoration Act,' to cut ties with the UN?"},{"comment_id":"10156146620705354","commenter_b":"Europe","commenter_a":"It's probably too late for Europe. It's not too late for the USA, but economically and socially we are following Europe's example.","post_message":"\"Islam Will Be the Death of Europe\""},{"comment_id":"10153876230626130","commenter_b":"Of reported rapes (is estimated that nearly 60% of rapes are unreported), the percentage of false claims is the same as any other crime, which varies from about 2-8%. Rape culture is automatically assuming the victim is lying when it's statistically unlikely, so congrats, you are part of the problem.","commenter_a":"There are no evidence supporting an existence of \"rape culture\". There are rapes. Go to the police. But there are also plenty of lies and no facts aqusation of rape by some women","post_message":"Keep speaking up, Nadia."},{"comment_id":"1503738089934482","commenter_b":"Get the employers to stop hiring illegals, problem solved.","commenter_a":"no, and unless u r an open borders leftist, you probably don't either. sick and tired of illegals. period. build the wall, e-verify, zero benefits for illegals = mass migration back where they came from. problem solved :)","post_message":"Joe Biden went to Mexico on Friday and delivered a clear message: The views of Trump absolutely do not represent the views of most Americans. Do you agree with the VP?"},{"comment_id":"886338878165958","commenter_b":"Muslim GET OUT!! Allah can't help you in America!","commenter_a":"Or, they could just move to a muslim country.","post_message":"YESSSSSSSS! This totally just made my day...."}]
