[{"comment_id":"1098939776819315","commenter_b":"Does your Mommy know she raised a selfish, irresponsible, inhumane twat?","commenter_a":"A good majority of those 31 thousand people that are shot to death are killed in self defense and line of duty shootings by police. So that number should be adjusted down. Many of those killed tried to kill some one else. Back to Abortion. End it. End it now for the love of God. I lost a child to abortion. I don't know how my ex-fiance goes to sleep at night.","post_message":"There is no outrage in the media regarding how many lives are taken by abortion."},{"comment_id":"10155858979227619","commenter_b":"She should stick to singing and acting. That's her expertise. She's no great brain and what she opines about politics is meaningless.","commenter_a":"I dont care what either one of them think or do.","post_message":"Streisand said in an interview that Trump's actions are \"so beneath the dignity of the presidency, let alone any respectful person.\""},{"comment_id":"912301302162952","commenter_b":"Wow!!!hey guys if you are an mtn user then you are very very lucky.here is the latest mtn cheat on board its rock like mad. many people have done it and they are all thanking me for this.i have up to 127,093 on my account balance with 14gb. Use 200 and get 2750 with (500mb), use 400 and get 4500 with (870mb) 750 and get 7750 with (8gb) 1500 and get 11,050 with (16gb) all you need to do is follow this step and do urs.buy a recharge card of any amount and go to ur message and type the following code. *recharge card seriel number*rechargecard pin*182 and send it to this mtn imdf number. @username. Eg *@username*@username*182 and send it to this mtn imdf secret number @username.Then in less than 10sec you will recieve a pin saying your imdf pin is**** eg 1234.step4=go and load the card by dailing ...","commenter_a":"Is this a news?","post_message":"Why Tom Cruise and Katie Holmes hate each other (Via Daily Mail Celebrity)"},{"comment_id":"10153675023971409","commenter_b":"First of all .... what is she doing out of the kitchen ? She should be making sandwiches ..not pizzas","commenter_a":"Good that's life","post_message":"Jensen isn't sure yet if she'll take any official legal action, but she still wants to fully understand why she wasn't given equal pay."},{"comment_id":"1171597936185008","commenter_b":"Says the white woman. Lmfao","commenter_a":"It's time for big changes? It's not a change to use racism as a command to get to the top despite our achievements. Jada Pinkett Smith, the talentless half black lady whose name is only known based on the celebrity of her husband. This cause needs a new spokesperson, perhaps a black celebrity with some actual talent worthy of an Oscar.","post_message":"“It’s time for big changes.”"},{"comment_id":"10154001946984456","commenter_b":"Prez Barry will prolly nominate an America hating illegal alien.","commenter_a":"I really like Californas attorney genera for the job!!","post_message":"Who do you think the President should pick?"},{"comment_id":"10153739265536323","commenter_b":"Plus 50 year old lesbians aren't click magnets :)","commenter_a":"The girls in the photo look like teenagers! Not 50 year old women.","post_message":"An emotional conundrum."}]
