[{"comment_id":"518916724963287","commenter_b":"Is she holding a sex toy???!!!!!","commenter_a":"I cannot believe facebook has stuped so low to put this kind of crap on their page, I'm thinking it might be time to leave.","post_message":"THIS IS DISGUSTING..."},{"comment_id":"10152973600191336","commenter_b":"Na she's not crazy . Mothers turn super human when someone hurts or almost hurts their kids","commenter_a":"Ok...pretty sure this woman is cray-cray...not a protective mama bear, but whatever","post_message":"A wild police chase in Dallas came to an end thanks to a protective mother."},{"comment_id":"630903010433611","commenter_b":"Get her out of the White House!!","commenter_a":"out of her mind !!!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason. She is a racist. This is complete madness. Do you think Michelle Obama is out of her mind?"},{"comment_id":"10153322835227994","commenter_b":"Sounds like something fishy. The devils monster wouldn't kill my kids before me.","commenter_a":"Don't strollers have brakes on the back I don't know this story is impossible to believe","post_message":"So sad. Her 18-month-old twins were killed."},{"comment_id":"10154274574160329","commenter_b":"Grace Lee Justin Bloch","commenter_a":"Gabriel Cortez","post_message":"OMG!!!"},{"comment_id":"690501341083047","commenter_b":"We don't have to deport them all. 1. Enact extremely harsh prison sentences and fines for their employers. 2. Cut off all government entitlements to them, including drivers licenses. 3. Open service centers South of the border specializing in United States work permits for any company needing cheap foreign labor. Said employer would be responsible for all housing , food , transportation costs and hospitalization. The only way to get a job here would be to sign up in Mexico! Then wait just like the rest of the world has to. Enact those measures and most will self-deport! Those who don't are criminals and harshly dealt with! All anchor babies should be stripped of citizenship and also deported. Enough of these criminal aliens!","commenter_a":"What George Lopez said ain't much better than what Trump said! They are both wrong! This country was built by immigrants and most of them came here illegally including the white man! The only Americans are the native Americans everyone else is an immigrant! Native Americans didn't invite immigrants here! So don't fool yourselves! White man came here illegally! Massacred native Americans brought black slaves illegally and now have a problem with Mexicans! What a joke! Mexicans don't come here to take your jobs! They do the jobs that your too lazy to do and won't do them! White people go to these countries to get there labor and no one says nothing about that!","post_message":"Ummm ok?"},{"comment_id":"10152931717926336","commenter_b":"They have no \"rights\" here in the US -- if they are here illegally they should be deported and if caught coming back into our country they should be put in a hard labor camp for 5 or more years --","commenter_a":"Thats all we need , one more moron!!","post_message":"U.S. Attorney General nominee Loretta Lynch said she believed in an illegal immigrant's \"right\" and \"obligation to work\" during Wednesday’s confirmation hearing."}]
