[{"comment_id":"10153357248947061","commenter_b":"silly girl","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."},{"comment_id":"955856331137563","commenter_b":"Based on what I've seen it's because they are ugly and no man will take care of them.","commenter_a":"Why are liberal women unable to take care of themselves? Why must the liberal women depend on government for everything?","post_message":"To Jeb Bush and Republicans who don't think women's health should be a priority: You couldn't be more wrong."},{"comment_id":"936217929734331","commenter_b":"Miley is the best white feminist ever! Also, Bangerz was a half-decent album","commenter_a":"She is really a sweetie has a good heart.","post_message":"There's a side of Miley Cyrus that just about everyone misses."},{"comment_id":"511283065698315","commenter_b":"But she looks like she has taken lots of dicks in her ass/mouth then made out with you","commenter_a":"But he will walk away with no punishment because USA is Saudi arabias little bitch","post_message":"That's a lot of drugs."},{"comment_id":"10154357996114203","commenter_b":"innocent guns. why do we ban drugs such as cocaine? if the entire responsibility is on the abuser","commenter_a":"line up Americans arguing what the definition of assault rifle is.","post_message":"Conan O'Brien: \"I am a father of two, I like to believe I have a shred of common sense, and I simply do not understand why anybody in this country is allowed to purchase and own a semiautomatic assault rifle. It makes no sense to me. These are weapons of war, and they have no place in civilian life.\""},{"comment_id":"10153373990610329","commenter_b":"So NO harm ?!? Dude how did this dumb bitch make it through medical school... 😂😂","commenter_a":"I know what I'd do!! Shotgun job!","post_message":"A photo of the veterinarian with the dead cat have gone viral and sparked outrage."},{"comment_id":"10154662722072619","commenter_b":"Stupid woman.","commenter_a":"Total anti-semitic bitch; She would march the Jews to the ovens if she could.","post_message":"Swedish FM drew outrage in Israel when she linked the terror attacks in Paris and the feelings of Palestinians."}]
