[{"comment_id":"1588312174810373","commenter_b":"Killery destroyed evidence after she received a subpoena from the FBI and she Lied under oath! Alot of people have went to jail for less! Our Government and the Media are so corrupt! The same people that have major shares in every media outlet are same people that fund Killery! Saudi and Arab countries!!! I hope you know how they treat Women? Children! Gays?","commenter_a":"This woman has no shame... She will say and do anything for power.. Wake up Dems you're trying to elect a criminal for president.","post_message":"Latest batch of WikiLeaks emails contain details on Hillary Clinton's narrative on Benghazi. @webpagelink \"We see an email exchange among John Podesta [and] other top aides, where Hillary Clinton was being coached on, in their words, 'how to stir up some moral outrage against Republicans' at this Benghazi hearing several months ago,\" Ed Henry reports."},{"comment_id":"10153640013936636","commenter_b":"O questo o un procione non voglio altro siamo io e te li vedi li vedi Dio pinolo?!","commenter_a":"Luca sparati in bocca con me","post_message":"Red pandas have an adorable wrestling competition Via Detroit Zoo"},{"comment_id":"10153683071398984","commenter_b":"Get the hell out bitch!","commenter_a":"Pork sandwiches for everyone.","post_message":"This Muslim tried to shame a grocery clerk into taking off her American flag pin... but instead, something amazing happened. This story is going viral across the nation..."},{"comment_id":"10153551887101130","commenter_b":"it was funny....people lighten up","commenter_a":"Be serious. Not offensive","post_message":"You be the judge."},{"comment_id":"1051849191502758","commenter_b":"Dirty lady lol","commenter_a":"I WANT PICTURES !!","post_message":"How do you measure up?"},{"comment_id":"10153836803272623","commenter_b":"Good players But it's another\"L\"","commenter_a":"Ga...NO ....Riverboat must have sank and Cam Ain't ..... stupid Panther Fans","post_message":"The New Orleans Saints beat the Carolina Panthers in a 41-38 victory Sunday in New Orleans."},{"comment_id":"499136410296158","commenter_b":"Go back to Mexico you trash","commenter_a":"Very disrespectful! I can say I'm embarrassed, what type of protest is this? I don't agree with Trump but I certainly don't agree with this. That guy in the white shirt with the Mexican flag under his hat is ridiculous. Obviously he does not know how to respond correctly and only starts welling stupid stuff. The only history they are making is to upset people to react upon their actions.","post_message":"Watch This Insane Reckless Trump Protester Nearly Kill People"}]
