[{"comment_id":"10153477026528352","commenter_b":"She should be buried under the jail,","commenter_a":"She's a LOSER.... There's no copping out of the fact that SHE murdered her kids.. Whether dad was around or not is irrelevant.. Plenty of women like myself are single moms and we aren't doing crazy shit like this","post_message":"Mother in court for ‘killing two of her kids and putting them in freezer’ has to be removed after flying into a rage over their absent father"},{"comment_id":"10153792298068271","commenter_b":"The ignorance of those bottom feeding illegals is who are to go, or die. We are not talking of the folks here legally. Your ignorance is proven. No more handouts! !!!!! Work, or die. I approved this message. If you are illegal then get out now! !!!!! Or you might have to go the hard way. LOL. Lock N Load, Simper-FY! !!!! Burn the Mexican flag, you are either a American or your not. If you carry that fag, Ops, I meant Mexican flag, you should be returned to that filth country right away.","commenter_a":"According to the United States Census Bureau \" By the year 2050 (which is not that far off) one in every three Americans will be Hispanic \"legal and illegal, The Trump family will not be happy. Incidentally. Census bureau is a reliable and credible source. Celebrating Cinco de Mayo weekend :)","post_message":"\"His business was built on the backs of Latinos that helped him become successful and what he boils that down to is eating a taco salad.\""},{"comment_id":"10153924016401130","commenter_b":"Oh grow up all of you. Why should she need to put a cover over her breasts. You put a cover over your mind and give thanks that mothers can feed portably whilst not being excluded. I'm sure you can train your mind to manage to view a pair of breasts as a feeding devise and look at how your own mind processes this function. Women relinquish enough do to our biology - can't we at least feed and belong at the same time?","commenter_a":"She should have stayed home. Not her day.","post_message":"Now THIS is a cool mom. 😎"},{"comment_id":"10154029279516341","commenter_b":"By the Gods. Now they do have a chance to tell that envoy to give back Roman territory and she fucks it all up ! To the Circus with her !","commenter_a":"Bum nutter","post_message":""},{"comment_id":"1419268561466221","commenter_b":"Stop reasoning like an idiot","commenter_a":"Nothing lasts forever...whatever goes up must come down.","post_message":"Serena and Venus Williams are KNOCKED OUT of Rio"},{"comment_id":"10153253749121800","commenter_b":"Heard this on 98 rock on way to work....halliarous!","commenter_a":"Masoud Jalali","post_message":"\"To be clear, a guy on CNN just said, 'Hey, if people are looking for news, I'm sure they can find it somewhere.'\" -- Jon Stewart"},{"comment_id":"10154436464143931","commenter_b":"The wall will stop a lot of illegal aliens because they don't usually go thru tunnels. The tunnels are for drugs. They don't want a lot of people knowing where the tunnels are because if the people get caught they will snitch on the tunnels location. That's why they use the tunnels for drugs not people","commenter_a":"The drugs are smuggled thru tunnels underground.","post_message":"A wall would do little, if anything, to stop the flow of illegal drugs - the majority of which are actually smuggled though checkpoints."}]
