[{"comment_id":"10156605912540389","commenter_b":"They offered it to me!!! What a crock!! We can't have another Clinton in the WH......","commenter_a":"For someone so smart what a waste of a brain. Just greed Is what motivates her.","post_message":"Even the left is calling this one of her worst moments."},{"comment_id":"960803304010619","commenter_b":"That is where it starts. Where does it end?","commenter_a":"For Gods sake, no one is trying to unlock your average Americans phone. They want to unlock the California couple, Christmas party killer terrorists, phone. And for good reason. To find other connections.","post_message":"JUST IN: Donald J. Trump is calling for a boycott of Apple until the company agrees to the government’s demands and unlocks the phone used by one of the San Bernardino terrorists. What do you think?"},{"comment_id":"10155154956823487","commenter_b":"These people are like the Clinton's they don't give a damn about the illegal immigrants! All they care about is making money 💰 off the backs of illegal immigrants!! Why didn't they help those poor people before get legal documents in order!! 😡😡😡","commenter_a":"A refreshing glimpse of optimism.","post_message":"Bill Gates: predict a comeback for the truth."},{"comment_id":"10155894445780093","commenter_b":"Certainly grown women can make decisions. . And as soon as you grow up, become mature, recognize there is a world beyond our own noses and that maybe a person could be right, or, disturbing for some, a person could be wrong... then they can make decisions. But the arrogant ought to be circumspect.","commenter_a":"One simple question: for the Christians who believe that life begins at conception; if God wants every potential human \"life\" to be born so much so that you have to create laws that every American woman whether they believe the bronze age fairy story or not, why when god destroyed all life during the Noah flood did he kill pregnant women? Or innocent new borns? Weren't their lives so precious too? Square that circle.","post_message":"The deliberate killing of an innocent human being, with the killing performed in such a way as to preserve a of the most valuable parts. That sounds totally ethical, right?"},{"comment_id":"10154220565880575","commenter_b":"This is why immigrants need to be vetted and illegals should be shipped out of USA. TRUMP/PENCE","commenter_a":"Sunshine patriots, you'll do as you're told.","post_message":"Mothers of slain children killed by illegals hold protest in front of Paul Ryan's home."},{"comment_id":"10153348375511756","commenter_b":"Women are just as capable of destroying the infrastructure of poorer countries leading to the suffering and death of millions of innocent people as men are.","commenter_a":"No women on front line.","post_message":"Cpl. Jasmine Abrego is just 5 feet 1 inches tall. She left her job as a Marine clerical worker to train for the infantry and, as she puts it, \"kick bad guys' butts.\" \"Mentally it's just being strong, you just get stronger,\" she says. \"You just push yourself through it, that's what I've been doing.\""},{"comment_id":"623726524464132","commenter_b":"LOCK HER UP ---THROW AWAY THE KEY","commenter_a":"That kind of memory or lack thereof makes her a danger to herself and others.","post_message":"Tom Fitton is LIVE discussing Hillary Clinton's response to Judicial Watch questioning under oath and more in our Weekly Update. [for higher volume touch sound icon on screen or turn your speakers up ]"}]
