[{"comment_id":"977484695718405","commenter_b":"You know all this for a fact?? Otherwise move along snowflake","commenter_a":"That was awkward to watch she was looking like she can't wait to get away from him seriously but her face never moves Botox much","post_message":"President Trump and First Lady Melania Trump just shared their first dance at the inaugural ball. @webpagelink"},{"comment_id":"487411828113777","commenter_b":"No kill these mofos","commenter_a":"These people are evil beast.","post_message":"This is INSANE...Deport Them ALL!"},{"comment_id":"10153441853036336","commenter_b":"A real lady doesn't hit a man. Haha.","commenter_a":"So how many times did he need to get hit by her before protecting himself?? She swung first...","post_message":"A Florida State Seminoles Football quarterback has been dismissed from the team after police released shocking video footage that shows the freshman punching a woman."},{"comment_id":"1800130780216983","commenter_b":"Any misguided female.","commenter_a":"You should not talk about lying crooked murdering KILLERY that Way!,, her day is coming in jump suit in prison!!!!!! GOOOOOOOOO TRUMP TRUMP!!!!!","post_message":"\"Vote your conscience.\" Ted Cruz declines to endorse Donald J. Trump during his speech at the GOP Convention: @webpagelink"},{"comment_id":"1158459407522812","commenter_b":"Liberal ay, so telling you that Trump broke the pledge first, makes him a liberal.","commenter_a":"Why don't you Trump people shut the hell up about Cruz, and focus on Killary for a change?","post_message":"I agree with Phil Robertson \"The Duck Commander\"!"},{"comment_id":"10156329985125354","commenter_b":"Stupid Hoe","commenter_a":"One Day ,,,Every Knee Will Bow and Proclaim Him Lord, including you Ms,Johansson...that is the day you will give an answer for this horrible mocking of Gods word you have done","post_message":"Surely Scarlett Johansson is working on a Koran version as well. Surely that's happening, right?"},{"comment_id":"1210524342343014","commenter_b":"Maybe she's drunk or high. Don't even look good","commenter_a":"Notice how fb took off the video? CNN reporter admitted Obama paying off the media to only cover bits and pieces of Trump speeches, to keep the media from exposing Hillary's corruption","post_message":"What is wrong with Hillary? She just completely froze AGAIN...her handler had to rush the stage, comfort her, and tell her what to say! WATCH..."}]
