[{"comment_id":"10154686785341323","commenter_b":"Clarkson and Mary Berry should do a show together. Cut from the same cloth - she's just quieter about it.","commenter_a":"Wells said sir David. We all love clarkson.","post_message":"Unnatural history."},{"comment_id":"10153261650152507","commenter_b":"Not enough! We need more dogs killer their dumbass, redneck, gun-loving owners. Arm Fido!","commenter_a":"It's not guns that are the problem, it's the dogs!! So don't regulate guns, regulate dogs.....er, wait.....don't regulate dogs right to guns, because guns don't kill people, dogs do.....wait, that's not what I meant.......oh what the hell do I mean?","post_message":"This is just awful."},{"comment_id":"10154214106757411","commenter_b":"Girls like this get bigger diamonds","commenter_a":"Kathleen O'Connor ~ too bad they didn't have the first look when we all got married.","post_message":"A bride from Chicago wanted to make sure to give her groom a 'first look' he would never forget... 😂"},{"comment_id":"10155567292775294","commenter_b":"She was making over $20 an hour..... This has nothing to do with wages","commenter_a":"If Walmart would pay decent wages this would not have happened","post_message":"The woman is accused of stealing from the Decatur, Texas store for more than a year, sometimes stealing thousands of dollars a day:"},{"comment_id":"10152931648796491","commenter_b":"They are business women now and could buy everyone on the show. Maybe they will make a cameo appearance, if the show stays on the air? They should just leave the show alone and move on with their lives.","commenter_a":"I believe they've both stated they are through with acting. Its their choice how they live their lives. They don't owe anyone anything. They're both very well suited for their current endeavors in fashion, out of the limelight.","post_message":"“I understand they’re in a different place and I wish them the best,” John Stamos said."},{"comment_id":"1317246778287960","commenter_b":"She'd have been funnier if she'd have swallowed her Mic..","commenter_a":"What the he'll is wrong with these mean girls, this country? You don't do that to ANYONE! Not ANYONE EVER! This show allowed this? We teach our children it's wrong, if it was done in school it's called bullying....my God! She should lose her modeling contract!!! Stop this Madness!","post_message":"Gig Hadid threw some serious shade at Melania Trump tonight..."},{"comment_id":"10155107253330557","commenter_b":"White people riot","commenter_a":"Must of been a black on black murder .... No riots","post_message":"#BREAKING: 2 people in custody, another still at large in the murder of a man in Reading. Developing details in the story below and in a live report on 69 News at 5:30."}]
