[{"comment_id":"656793474487890","commenter_b":"Hillary the Felon says Trump is prejudice and she is just telling the same manipulative lies over and over. Mexicans do need to be properly vetted and screened because they are coming from a country knee deep in political corruption and organized crime. This lying fraud is trying to get her voters to think Trump is racist and prejudice but fails to acknowledge the gallons of red blood leaking into mexican streets because GOVERNMENT DISARMED ALL LAW ABIDING CITIZENS. It is NO QUESTION, Hillary wants Australian styled gun abolition, want proof? Ask and you will receive! She fails to acknowledge mexico is sending rapists and drug dealers en masse to deal much like Fidel sent his POW to Miami. There IS NO DOUBT this Felon is going to drag us into a civil war with her ideologies on government. Syrian and muslim refugees who have turned Germany into the brink ...","commenter_a":"#Trump2016 #HillaryForPrison #DNCLeak #DNCWalkout #CrookedHillary #ClintonCorruption #RiggedSystem Debbie Wasserman Schultz was the co-chair of Hillary's 2008 presidential run, where she lost the nomination to Obama. So, in order to lock down the nomination for 2016, Hillary would've had to put Schultz in charge of the DNC and manipulate it from within. In order for this corruption scheme to work, the Clintons would have needed first to, not only get the current DNC chair at the time to step down, but also get them to recommend Schultz for the position. A big request. And the Clintons would have likely needed to promise a powerful favor to that DNC chair, something more prestigious than being head of the Democratic party. So who was that person and what did they get in return? The previous chair of the DNC prior to Debbie Wasserman Schultz was... Tim Kaine. Let that sink in for a ...","post_message":""},{"comment_id":"10152818238035927","commenter_b":"LOL! Funny..I've never seen a Good Looking Gay Couple...Lol!","commenter_a":"How can this be a gay Marriage? The one on the right looks like a man!","post_message":"This Ohio judge may take some heat for his recent decision on gay marriage ..."},{"comment_id":"10153703339506509","commenter_b":"Hillary will be in jail before she ever becomes president!","commenter_a":"the entire republican party is a joke","post_message":"Rick Santorum officially announces that he's running for president. @webpagelink"},{"comment_id":"10154094490463984","commenter_b":"Thanks to our neighbors to the north..it would appear they are much wiser than we are. If this racist carp is going to end, it must end on both sides. I truly believe there are far FAR more black racist than white in the USA today. I also do NOT believe the blacks want racism to stop, that as a whole have too much to lose.....","commenter_a":"Can we just get this racist woman off social network already! Tired of seeing and hearing about her!","post_message":"Fresh off her race-baiting Super Bowl 50 performance, Beyoncé was about to head up to a huge concert in Toronto. However, a Canadian official just hit the singer with BRUTAL bad news... She never saw this coming... she should have, though."},{"comment_id":"859144567515130","commenter_b":"I did walk in the shoes of a LEGAL immigrant. We get that money gets you here either way legal or illegal. But when you lack respect for laws you come here illegally when you respect them you come here legally. Trust me I get the escaping from violence and your family is in danger side of it. There are avenues if that is the case in these days for emergency immigration if you fit the criteria.","commenter_a":"Si se puede! We are all immigrants and thats what makes up the USA !","post_message":"\"We love this country. We want to belong. We want to come right with the law...we don't like living in fear. We want to be out of the shadows.\" -Gaby Pacheco, DREAMer"},{"comment_id":"10153152736641955","commenter_b":"Who was her IASO? Who was responsible for patching and maintenance? Who setup the firewalls and data encryption? Put this bitch in jail!!","commenter_a":"U can still, get it back.","post_message":"HILLARY 'WIPED HER SERVER CLEAN'"},{"comment_id":"419941198130475","commenter_b":"Yes, Yes, she is a ruthless women!","commenter_a":"Youll keep up the good work","post_message":"Republican Presidential candidates are all ganging up on Hillary Clinton. Is this fair?"}]
