[{"comment_id":"1729274910624261","commenter_b":"@username well then","commenter_a":"Donate this to where the world needs 😩","post_message":"Science at work - The LifeStraw.  The LifeStraw removes at least of 99.99999% of waterborne bacteria and 99.9% of waterborne protozoan parasites. It can filter up to 1000L of water.   Throughout the world, an estimated 884 million people still do not have access to clean sources of water. This device contains no chemicals or batteries and makes it possible to drink safely from any river, lake or puddle.  Buy them here: bit.ly/1YbTja9  For every unit sold, two children in the developing world will be supplied with clean drinking water for a year."},{"comment_id":"10153033979746378","commenter_b":"She was a dummy","commenter_a":"Just wondering... Why does everyone care now all the sudden","post_message":"A woman has been arrested after removing Confederate flag from outside South Carolina Statehouse."},{"comment_id":"10153695789091336","commenter_b":"No women in combat puts the men at risk to protect them they are targets of the enemy..don't care how strong or tough you think you are you get in the enemy's hands you will see the truth","commenter_a":"There is no way a woman is as physically strong as a man. That is just the way it is. It is just common sense. A woman could be jeopardize the safety of other marines when in battle","post_message":"The U.S. Marine Corps would request a waiver to keep women excluded from infantry and artillery positions, but not armor positions like serving in tank units, according to an official."},{"comment_id":"1001645919925097","commenter_b":"why don't she shut the f up and leave","commenter_a":"Open her mouth.","post_message":"Rosie O'Donnell isn't qualified to ___________."},{"comment_id":"10153383091468984","commenter_b":"If her mouth is moving she is lieing.","commenter_a":"She will say and do anything to get back in the White House but she really belongs in jail","post_message":"I can't believe she tried to pass this off as fact. Even Bill has to be shaking his head about this one...  Do you think Hillary has a problem being honest?"},{"comment_id":"10153399838202411","commenter_b":"\"Do the right thing\", go away for good.","commenter_a":"Don't care for him..Chi raq was a horrible movie and I didn't even see and will never ever see it (just from previews). True Chicagoans will agree with me...Ugh, go away and take Kanye west and his family with u too..","post_message":"Happy Birthday, Spike Lee! The director of \"Chi-Raq\" and \"Do the Right Thing\" turns 59 today."},{"comment_id":"10154888478529714","commenter_b":"#FuckTrump #FuckPence #MelaniaFirstWhoreOfTheUnitedStates","commenter_a":"Boycott the show!! This is truly getting out of control. Did this occur when OBAMA became President? \"Of Course NOT\"!! The left are outspoken to the point of embarrassing themselves on a platform of defeat. Protesting, Chanting, Revolting won't change anything!! The American people have made a choice, that choice is for change. \"Get over it, get with it\" The Liberals power(s) were overturned, \"what a beautiful thing\" & they don't know how to deal with it!!","post_message":"\"Vice president-elect, I see you walking out but I hope you will hear us.\""}]
