[{"comment_id":"10153284807073984","commenter_b":"That thing is female !","commenter_a":"Shame on the university for hiring her and for not firing her......something is mentally wrong with her.","post_message":"Surprise, surprise, she is an extreme liberal.  Does this type of behavior from a teacher make you sick?"},{"comment_id":"10153236659491051","commenter_b":"Wait a minute. These girls made threats against someone's life and are suspended from the cheerleading squad for three games? What's wrong with this picture? Are you kidding me?","commenter_a":"OMG criminal charges and other parents need to be involved in their daughters' cruelty towards another student.","post_message":"This mom was horrified when police contacted her and told her what was happening with her daughter."},{"comment_id":"933938620044552","commenter_b":"Big money and those they have bought don't want us to know what is happening!!!!","commenter_a":"My understanding of this pipeline is that it is not considered a national pipeline, bypassing congress and the Whitehouse and following state guidelines in each state it passes through. Could this be right?","post_message":"Why theres a media blackout on the native american oil pipeline blockade"},{"comment_id":"882724591787290","commenter_b":"Battered but still a warrior, great courage.","commenter_a":"This kid needed a gun and a CCL. So as to defend himself!....oh wait he lives in Newtongrange, Midlothian. Is that in....the UK? They not allowed to defend themselves with lethal force, from Thugs! Thanks to people that think like Piers Morgan.","post_message":"Left for dead with a battered face and multiple fractures by man he stopped to help"},{"comment_id":"706978382784196","commenter_b":"MAKE AMERICA AMERICA AGAIN!!!!!!","commenter_a":"Come on Bill, let us hear the speakers, please.....","post_message":"Duck Dynasty on A&E's Willie Robertson, former Texas Governor Rick Perry, retired U.S. Navy SEAL Marcus Luttrell, actor Scott Baio and Patricia Smith, mother of Benghazi victim Sean Smith, speak at the Republican National Convention."},{"comment_id":"10154428914569411","commenter_b":"What refugee crisis? These invaders are not refugees.","commenter_a":"I have never seen such inhumanity as I have seen in the west where personal freedoms are more important than justice and what is right. The REFUGEE crisis is just the latest example of this.","post_message":"'Our chancellor has given up the sovereignty of the country, she has given up our borders, she has given up our rules and regulations'"},{"comment_id":"1025596987461312","commenter_b":"Sure, blame the illegals. What do you Morons know?","commenter_a":"Kristen Kirschner","post_message":"Let's take a moment to remember that measles was ERADICATED from the USA in 2000. Nice job, anti-vaxxers."}]
