[{"comment_id":"257235498048585","commenter_b":"BYE BITCH!","commenter_a":"When we get to the \"Stupid\" ones...your name will be among the first !!","post_message":"NY-Born Governor: 'If There is a Move to Deport Immigrants, I Say Then Start With Me' [VIDEO]"},{"comment_id":"1661303277474551","commenter_b":"Municipalities the masses? Did you maybe mean manipulates? Lol","commenter_a":"The more bias tords trump just show how mutch media manipulates the masses and is shooting themselves in the foot","post_message":"\"On Feb. 9, we trust New Hampshire Republicans will send 'Biff Trump' back to somewhere — anywhere but on the road to the most important elective office in the United States at a most crucial time for this nation.\""},{"comment_id":"1706668932888007","commenter_b":"Hillary is just another branch of the incompitent Obama tree. Only difference is she's a criminal and she'll be far worse for this country because she'll have to prove a point soley because she's a woman. Sorry, but I don't vote based on race or sex and I certainly won't vote for someone who has spent most of their political career filled with lies and cover ups.","commenter_a":"I CALL B.S....HILLARY HOMERS,...VOTE Donald Trump 2016..\"THE MAN FOR AMERICA\".","post_message":"Donald J. Trump's odds of winning the Republican nomination dropped 3 points on the Political Prediction Market after the #GOPDebate. Meanwhile Ted Cruz's odds ticked upward..."},{"comment_id":"10153445196113984","commenter_b":"She has no right to control any thing!","commenter_a":"Not only does she not have any class, she is ugly and gross! I do not care if she is republican or democrat she is just nasty!","post_message":"This has to be very embarrassing for the First Lady. Hopefully this doesn't make her try even harder to control Americans...  Do you think Michelle Obama as First Lady is bad for America?"},{"comment_id":"1286858341353620","commenter_b":"who cares !!! no one !!! let that bitch fall !!!!","commenter_a":"She is sick. She was having a seizure. She is lying about her health. She was the only one wearing sun glasses and I thought it strange. She is a basket case.","post_message":"BREAKING:  HILLARY HAS MEDICAL EPISODE AT 9/11 CEREMONY in NYC.  Swept away by security detail.  VIDEO  @webpagelink"},{"comment_id":"1128755127223092","commenter_b":"They are stopping them by firing these loose mouth bigots.","commenter_a":"Now employers can terminate employees for not having the same politics and ideological dogma as their bosses. The Radical Left is destroying America. They must be stopped.","post_message":"“She has expressed values that are at odds with ours and she has compromised her ability to meet the teaching and patient care mission of the School of Medicine.”"},{"comment_id":"482111261979454","commenter_b":"She is in another country Germany . We have No rights there to forbid it. But in our country that's a different story all together. If swimming in a public facilities she should abide by laws of that community or township. If theme parks can refuse for you to wear cut offs then the should forbid that attire, and get out. They have more than enough money to put in their own pools. Our own laws presented by our President is destroying our country from within.","commenter_a":"This is going to far!!!","post_message":"A judge just ruled that public pools must allow Muslims to swim in 'Burkinis'.  We're tired of Muslims infiltrating our country. This stops now.  Do you agree that 'Burkinis' are WRONG?"}]
