[{"comment_id":"1810345725921055","commenter_b":"Hmmm...either the cop is sissy soft or a female cause they lady whom he/she hit took that B...hit like a Champ","commenter_a":"Someone needs to get at that coward... another good cop right?","post_message":"This police officer was caught punching a woman in the face  the woman was arrested and charged with assaulting an officer and resisting arrest."},{"comment_id":"10157793591820354","commenter_b":"Yes He should have been the nominee to begin with. She is crooked and shouldn't have been allowed to run.","commenter_a":"Screw Bernie, he showed me he is an ass, gave my money and vote to Hillary, I have move on, I have become a deplorable American","post_message":"Feel the Bern!"},{"comment_id":"769546029761706","commenter_b":"karmas a bitch","commenter_a":"Tolerance! Take their Allah and Mohammed, tear up and urinate on it. Then we will talk tolerance.","post_message":"Italy: Muslims Destroy and Urinate on Virgin Mary Statue   @webpagelink"},{"comment_id":"1766432363594674","commenter_b":"hillary a rothchilds criminal, she has already been selected months ago to be president all the sheep fall for it, see how the rothchilds find it easy to fool the easily lead with their controlled media","commenter_a":"Typical politician, first it's \"I didn't lie,\" then when the evidence piles up her statement quickly changes to \"I misspoke.\" Well, when you put it that way, I suppose you get a free pass...","post_message":"\"So I may have short-circuited it and for that, I, you know, will try to clarify because I think, you know, Chris Wallace and I were probably talking past each other because of course, he could only talk to what I had told the FBI and I appreciated that.\" - Hillary Clinton"},{"comment_id":"10154189668593352","commenter_b":"Husbands fault!!","commenter_a":"She's young and does not realize the damage that she's doing and the fact that she cannot deny it!","post_message":"Sidechick Embarrasses Wife on Social Media – Posts Videos of Her And The Husband Doing 'You-Know-What'! (PHOTOS)"},{"comment_id":"10153186263669411","commenter_b":"And what happens when two monsters get together? another monster!!","commenter_a":"ha ha ha America is a father England is a mother isis is a child isreal is a nanny","post_message":""},{"comment_id":"895449430498298","commenter_b":"Both are DICKS!","commenter_a":"A shame that both our prez and attorney general drew the guilty card before any investigations. Instigators to anti-police sentiment? Comments like Paul's are simply deniers to the findings of two separate independent investigations that produced identical findings. That is, Brown never had his hands up, was never surrendering and he was the aggressor.","post_message":"The Justice Department has finally confirmed what many of us were certain was the case: Ferguson police officer Darren Wilson told the truth about what happened when he said he shot Michael Brown in self-defense. After a six-month investigation, the DOJ concluded that Brown, allegedly a thug and a thief, was not trying to peacefully surrender when the incident occurred. He did not hold his hands up and say, “Don’t shoot.” And he was not shot in the back, as some alleged. @webpagelink"}]
