[{"comment_id":"1009718899145010","commenter_b":"Well the Wicked Witch odf Washington has looked better noow hasn't she.....TRUMP will save America...For us Mericans. Yall can move to Canada.....","commenter_a":"The dumbing down of America, this is the people we take care of with government assistance, most are not capable of taking care of themselves let alone voting","post_message":"Woah. Donald Trump voters will be the end of America as we know it. Thanks to Mitchell Wiggs for the video. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"970236133016859","commenter_b":"Dumber than dumb. She thinks she is a republican because...?","commenter_a":"I'll bet dollars to donuts that she'll still vote republican in the next election. Dimwits gotta be dim......","post_message":"To save Obamacare, we need many, many more people like Erin to come forth."},{"comment_id":"10153570996910329","commenter_b":"*high five* you guys are awesome! :D","commenter_a":"I'm a proud Christian and I'm ecstatic about this. I'm not even gay. Or American.","post_message":""},{"comment_id":"10155157527128132","commenter_b":"Two scary women1","commenter_a":"That is one scary woman.","post_message":"Like always, Janice Dickinson is not holding back."},{"comment_id":"764424377012570","commenter_b":"Muslims are the problems in this world without muslims the would be a better place","commenter_a":"Why is it that every Arab must have a temper tantrum and act like a five-year-old about everything? I would love to see, one time, a mature, calculated, reasonable response from a Muslim. Just once.","post_message":""},{"comment_id":"10153384667464726","commenter_b":"I can't tell you how little I care about what this silly woman says.","commenter_a":"it,s more convenient being black these days!!!!!!!!!","post_message":"WATCH: Controversy is swirling in Spokane over the local NAACP president. She says she is black but her parents say otherwise..."},{"comment_id":"10154680684123797","commenter_b":"Lisa Austin","commenter_a":"Okay, now this stupid game of Chicken is getting out of control! 😡😡 Someone needs to blink or all of the children in Illinois are going to suffer!!😡😡","post_message":"#BREAKING: Chicago Public Schools will not open in the fall if Illinois fails to approve an education budget, CPS CEO Forrest Claypool told the Chicago Tribune Wednesday."}]
