[{"comment_id":"10154047358589641","commenter_b":"But same time they let undocumented emigrants to enter their countries. This is why Europe never will be united.","commenter_a":"Crazy! Why do we want to go to Europe anyway when we have so much to explore and see in the great USA !","post_message":"The European Union is considering requiring Americans and Canadians to apply for visas, even if they only want to come for a short vacation."},{"comment_id":"10154586302758822","commenter_b":"Nobody hire ur nasty bitch ass","commenter_a":"Kdka u must b gettn pressure from ur execs to push all this liberal garbage ur only local news i watch but its gettn harder and harder to watch","post_message":"Have you noticed a drastic spike in Insulin costs? What gives? Is there anything you can do about it? #KDKA-TV News at 5:45"},{"comment_id":"10153750337633812","commenter_b":"Trayvon martin attacked Zimmer . Tired of the lies , zimmer lived in that neighborhood and had the same rights to walk as trayvon . Zimner's head veing slamned into the ground doesnt matter plus your ignorant white comment shows you don't know the facts . Zimmer is latino , black and white so stick your white privilege lie up your backside where your head is already stuck .","commenter_a":"A man who killed a lion is in hiding but the man who killed trayvon Martin is walking free?? Ohhh to be white in America","post_message":"Walter Palmer, the hunter tied to Cecil the lion killing, headed back to work: abcn.ws/1K0cdrW"},{"comment_id":"988452247844232","commenter_b":"If you have a daughter tell her to free her nipple in public and the pervs will come flocking to take pictures. Which will be legal if in a public space. Maybe you should look up Voyeur on pornhub or something and girls of all ages are being creep'd on.","commenter_a":"These sexist comments are appalling. Especially from the women. Keep letting society tell you what's proper and where your naked parts belong. As long as I'm concerned breast were designed to feed a new born. A man can do whatever the hell he wants but a woman has to be restricted to pretty much anything that might make her comfortable because revealing clothing means she's \"asking for it\" and showing her nipples, which are both called the areola on both men and females by the way, would just make men go into a frenzy. Instead of instilling this belief that breast and skin of women are meant to appeal to the eyes of men, teach men and instill in them self control, consent, and respect for women.","post_message":"Here are the nipples so scandalizing that Facebook won let us show them to you. (To see the uncensored version, click here: @webpagelink) #FreeTheNipple"},{"comment_id":"1561884050498286","commenter_b":"Build the wall !","commenter_a":"Regardless who wins this election... I would NOT live anywhere else but the U.S.A. We may have our differences, but at the end we all work together. It what's makes this country powerful.","post_message":"BREAKING: Hillary Clinton casts her ballot on #ElectionDay in Chappaqua, New York. Full coverage: @webpagelink"},{"comment_id":"10153040394173984","commenter_b":"She needs to resign","commenter_a":"Starting with Obama","post_message":"This is downright despicable. Wait until you see how she's associated with Obama... Do you support removing this racist politician from office?"},{"comment_id":"1231187963602033","commenter_b":"Hell yed","commenter_a":"I was told that these people that get these free cell phones, they get not 1 cell phone but 4 phones each. I asked how can that be? He told me that they have all these different programs and they apply for them all. It's insane. I say stop the cell phones!!!!!! Cannot wait. Such waste of our, the taxpayers money.","post_message":"Boom! PLEASE LIKE and SHARE The President Donald J. Trump page for all the latest Trump related news! 100percentfedup.com"}]
