[{"comment_id":"697292770461301","commenter_b":"I hope you're right Jim!! God help us all if she gets in!!","commenter_a":"She is a major disgrace to the Democratic party. If she is all they got, Forget next year's election. They don't a chance in hell.","post_message":"FBI wants to take down Hillary Clinton after she is caught in huge act of espionage. She needs to be thrown in prison. We can't let her get away again. Do you think Hillary Clinton should be arrested?"},{"comment_id":"1210989268913328","commenter_b":"Impeach this !!!!!!! Donkey Dicks ! Vote Trump","commenter_a":"How can you Impeach Trump??? He's not even President!!! Impeach the one in there now!! What the heck is the matter with people now a days??!! No common sense, want everything free, think they are entitled, scream racism at everything, destroy property with no remorse, get mad and just shoot people, not responsible for anything they do wrong, always due to their past or otherwise, no morals................ect..........And now talk of impeaching someone who isn't even President!!! America stand up and be counted for what is real, true, moral and right!! All Whiners can leave!!! Of course just my opinion! I know all will not agree, but 'Freedom of Speech!! My country, my Right!!","post_message":"Donald Trump doesn't have the GOP nomination and he hasn't been elected yet. But that is not stopping the effort to have him impeached the moment he might be sworn in as president"},{"comment_id":"10152955044437293","commenter_b":"The evangelical pastors insist that only God can change the climate and that is an affront to God to claim that Man can do so. The ideologues constantly scream that the scientists, left-wing and Al Gore are in a conspiracy to 'steal our liberty.' using climate change to bring about global government. --- BTW. I am GOP and have been for decades. I also listen to Rush Limbaugh and Mark Levin, but unlike --- what is the word? sheeple? --- I don't check my brain at the door and believe everything I am told, like someon who listens to that 'lamestream media.' --- As for today's GOP, it is nothing like the one that Reagan led. He would not have tried to squash any talk about climate change, prevent any reference to it in schools, or cut funding for research into what is happening in our climate. But that is ...","commenter_a":"The deniers have wax in their ears and a blindfold over their eyes--because they prefer to think that their ideology or religion is under attack by all of this (and are encouraged by the oil and coal companies to believe just that).","post_message":"And scientists are concerned."},{"comment_id":"10155030336677501","commenter_b":"Trash at its finest. Good job getting her off the street officers!","commenter_a":"Throw the key away","post_message":"WATCH: Activist Kathy Wray Coleman arrested on outstanding warrant during RNC demonstration in Public Square"},{"comment_id":"822624721167115","commenter_b":"The U S citizens land it crosses and Native Americans land it crosses should have the last word on this. Not some politician, or Lobbyist or any one who will make money off it. It looks to me that the land owners don't want it. VETO< VETO< VETO.","commenter_a":"Woot!","post_message":"A defiant GOP votes to fast-track Keystone."},{"comment_id":"10153264907976336","commenter_b":"The illegals are bleeding the system dry, plain and simple and then there's the government that doesn't give a crap about the poor because they largely do not see a reason to vote and therefore don't","commenter_a":"Yea and that will never happen. Illegal immigration will never completely stop as long as we have open borders and waterways","post_message":"In a Fox News Sunday exclusive, presidential candidate Marco Rubio says he still believes the U.S. needs immigration reform but it can’t be done “in one big piece of legislation.”  WATCH: @webpagelink"},{"comment_id":"537545743072047","commenter_b":"Fuck you you damn racist nut!","commenter_a":"Sounds like she just smoked a fat rock. Good job Vice... Keep throwing the crackheads on the top of my news feed. Not sure what I want more this or cat videos...","post_message":"On the Sea Islands along the coasts of South Carolina and Georgia, a painful chapter of American history is playing out again.  Watch our investigation into why Gullah culture is being replaced by waterfront mansions: @webpagelink"}]
