[{"comment_id":"10158044327420354","commenter_b":"Yes then a finger dipped in purple dye.....lol","commenter_a":"Funny how these so-called \"errors and glitches\" always favor the democrats. Personally, I used a paper ballot.","post_message":"***BREAKING***"},{"comment_id":"1813322542237935","commenter_b":"Then what makes her capable of running our country","commenter_a":"Mrs Magoo👹","post_message":"Hillary Clinton tells the public: Don't bring up my health! Then she tells the FBI: My health kept me from remembering the answers to your questions!"},{"comment_id":"1028722620528934","commenter_b":"Much better than the lying Hillary or senile Bernie!","commenter_a":"And the other morons will vote for Trump.","post_message":"Americas Freedom Fighters"},{"comment_id":"10159083149270206","commenter_b":"I'll lick your eyeballs #nohomo","commenter_a":"@username do u think this works for pink eye?","post_message":"This woman gets paid to lick people's eyeballs."},{"comment_id":"10152712220635736","commenter_b":"I'm half native you ignorant land thief!","commenter_a":"Kill it? Really? Greedy ass humans are the reason it has no food. HUMANS catch its food source and deplete rapidly. Maybe the shopkeeper will open up a tab for the poor thing. Maybe the natives should start shooting up all the white people? Doesn't sound fair? Don't go shooting starving animals.","post_message":"Watch: This seal jumps out of the water to search for food inside an Astoria market: @webpagelink"},{"comment_id":"10150572291974999","commenter_b":"Ok head in a pressure cooker, she chop the guy? that is cold, women have alternatives like \"the police\", runing away, any place she runs to will be better than prison for life or death. So she did the crime, now do the punishment she had her choice.","commenter_a":"....she killed the guy, put his head in a pressure cooker and then chop the rest of him before telling anybody. Do you know how long that must have been? china did exactly what was right and her sentence isnt harsh at all. Anyone asking for a lighter sentence is out of their mind. She needs to sit in jail for a while and maybe see a head doctor.","post_message":"Women in China who killed abusive spouses were once routinely executed, but as the scale of domestic violence began to emerge in the early 2000s — officials say one in four marriages is affected, activists say one in three — lengthy prison sentences became the norm instead."},{"comment_id":"524989287704578","commenter_b":"Build the wall","commenter_a":"Hillary has been in the lime light for 30 years first lady, senator of New York, Secretary of state, and i can not think of one good thing she has done, nothing prolific, nothing of any worth, and i see a successful business man. Oh the choices","post_message":"WATCH: Donald J. Trump hosts campaign rally at the Fox Theatre in Atlanta. @webpagelink"}]
