[{"comment_id":"10153738419359062","commenter_b":"How about we stop the meth, heroine and cocaine on the streets?","commenter_a":"There's go's the neighborhood","post_message":"Not just limes in the back of this truck!"},{"comment_id":"1563876947236715","commenter_b":"She a crook herself","commenter_a":"Sarah, go walk to the end of that bridge in your yard and ask Vlad of he is afraid of Trump...","post_message":"Sarah Palin called out Mitt Romney on Facebook for attacking Donald J. Trump."},{"comment_id":"10152957045101316","commenter_b":"that is why... Joran","commenter_a":"\"Messing with our veines/immune system, why?\"","post_message":"#Vaccine industry attempted bribery of #Disney, #ESPN, Oprah and CNN: @webpagelink"},{"comment_id":"1480804778605937","commenter_b":"FEAR-MONGERING ULTRA-RIGHT FASCISTS!","commenter_a":"Well, there's this...@webpagelink","post_message":"Washington State Republican Party chair Susan Hutchison​ is holding a news conference after the Washington state attorney general announced a lawsuit against President Donald Trump over the immigration executive order. >> kiro.tv/WASuesTrump"},{"comment_id":"10153823979101107","commenter_b":"And then Hillary would be the next POTUS.","commenter_a":"Rand can still be nominated by the libertarian party and would be a viable third party to trump and Hillary...he could take at least 20 percent from the GOP and DEM... The sore loser laws in many states shouldn't apply to him because he dropped out after Iowa","post_message":"\"Sen. Rand Paul (R-Ky.) has put a hold on the plan, with the intention to protect the Constitution, American taxpayers, businesses, and the nation’s economic health by blocking these dubious treaties.\""},{"comment_id":"10153006205351051","commenter_b":"I would have shot him.","commenter_a":"I am glad he did what he did. This is what you do instead of standing around recording.","post_message":"This dad was driving his daughter to school when he saw a police officer on the ground with a guy on top of her. The guy was reaching for her gun. The dad didn't hesitate."},{"comment_id":"926308994070863","commenter_b":"Nope, I kill the bastard and accept id be going to prison my whole life, but at least my child would live.","commenter_a":"It's possibly the worst idea in history to allow the shooting of a cop. Even the absolute worst cop could be clubbing a baby and still, if he were shot and killed in the act he'd die a hero and we'd never hear the end of it. We need to shoot cops, but with our cameras, never ever with a gun.","post_message":"Some states are dealing major setbacks to the Police State."}]
