[{"comment_id":"10153503495739087","commenter_b":"Shut the fuck up bitch","commenter_a":"Bernie lost, give him money, make bernie feel better with money, Bernie wants peoples money. Trump came in second and didn't ask for a dime. Trump 2016!","post_message":"Bernie Sanders presidential campaign had its \"best day ever,\" raising $3 million since the Iowa caucuses on Monday -- most in the form of small online contributions, averaging about $27 each."},{"comment_id":"10154710996716800","commenter_b":"HHHHHHHHHHHHHH MRDOH hhhhhhhhhhhhhhhhhhh","commenter_a":"Ilyass darori tchouf had lvid XD","post_message":"Ronny Chieng makes a desperate plea to a batch of undecided voters ahead of Election Day. #election2016"},{"comment_id":"10153603488066680","commenter_b":"The only law that need making is that ONE that makes it illegal for people to break the law!!","commenter_a":"The Boston bomber used a pressure cooker, Oklahoma was fertilizer. Killers will find a way. Let's blame the perpetrators, the ideology,not inanimate objects. Law abiding citizens should not have there rights tampered w. Let's enforce the laws we have.","post_message":"\"We need to have the hard discussion and talk about gun laws that allow an individual to legally purchase weapons that facilitate mass killing. We have to have those hard discussions,\" Lynch said Tuesday."},{"comment_id":"841833905948136","commenter_b":"What utter rubbish, it's the same beautiful country i have loved all my life & watched change under EU dictatorship & when my 88yr old father says \" this isn't what we fought for \" i know we've done the right thing , please don't panic people after a bumpy ride calm & Great Britain will be restored","commenter_a":"Spengler predicted this.","post_message":"\"This is not the country it was yesterday. That place has gone forever.\""},{"comment_id":"1301129679938665","commenter_b":"Would it be ok if you calmed your titties and stopped being such a butthurt faggot?","commenter_a":"(Cough) tarnak farm friendly fire incident (cough)","post_message":"Sometimes it's not the enemy you need to worry about. ~Will"},{"comment_id":"10154326726666729","commenter_b":"None... Technically. I do think they may have accidentally drifted into their waters..","commenter_a":"Why did our sailors surrender and why didn't we have any support for our sailors such as a helicopter? Something isn't right here, this stinks like Benghazi.","post_message":"We REALLY wish we didn't have to show you this, but this is what the results of feckless foreign policy leadership look like..."},{"comment_id":"1112699392133505","commenter_b":"Where do the vaginal secretions necessary for intercourse come from then???","commenter_a":"from a biological/anthropology standpoint, there's nowhere for it to come from besides the bladder. you're pissing on people. discussion over.","post_message":"Can women squirt, or is it just pee?"}]
