[{"comment_id":"963715427023908","commenter_b":"Thugs is a nice word for these fools...","commenter_a":"Disgusting!!","post_message":"SAVAGE THUGS DIG UP CONFEDERATE SOLDIER: Group Fed Up With Waiting Begin Digging Up Confederate General Grave (VIDEO)  NO RESPECT!   @webpagelink"},{"comment_id":"10153082765311955","commenter_b":"Are you bitches inbred or just drank the kool-aid? ?","commenter_a":"Fucking baphomet bullshit EVERYWHERE 😡","post_message":"MADONNA FALLS HARD"},{"comment_id":"539331949590718","commenter_b":"Amen @username! That's right, get out of our Country!","commenter_a":"No","post_message":"Burger King just bowed to Muslims in this sickening way.  This is such a joke. They just lost our business forever.  Will you support Burger King after finding this out?"},{"comment_id":"10153974645223132","commenter_b":"ITS NOT A WOMEN!!!!! Check the DNA!!!! It has not had ANY of the real struggles of a REAL women. Tell it to give birth, have a period, nurse a newborn baby!!!!! Completly undeserving!!","commenter_a":"maybe if the men who hink that they are women should have the gender description of woman and all women change to the smartersex as our descriptive verb!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","post_message":"Congratulations, Caitlyn Jenner, who was an honoree!"},{"comment_id":"10154428914569411","commenter_b":"What refugee crisis? These invaders are not refugees.","commenter_a":"I have never seen such inhumanity as I have seen in the west where personal freedoms are more important than justice and what is right. The REFUGEE crisis is just the latest example of this.","post_message":"'Our chancellor has given up the sovereignty of the country, she has given up our borders, she has given up our rules and regulations'"},{"comment_id":"10153093955378487","commenter_b":"One lady in particular..","commenter_a":"He only knows war and how to use military might .... nothing more. He is the same type of person as McCain.","post_message":"Netanyahu wants a role in shaping the Iranian nuclear agreement, should one materialize. His recent actions suggest that he doesn't quite know what he's doing."},{"comment_id":"10153301053671770","commenter_b":"What do they call a female dog ?","commenter_a":"He wants back in the white house so he can shame us again.","post_message":"Clinton let out her inner dog during a speech Monday."}]
