[{"comment_id":"10154266056696051","commenter_b":"She looks dreadful!!!","commenter_a":"the VALUES are no 'right' unless they are YOUR values?? I don't think so...........the American people have spoke. Donald Trump Is Our President","post_message":"Hillary Clinton made her first major appearance since losing the presidential election last Tuesday. Do you agree with what she's saying?"},{"comment_id":"10157769548850725","commenter_b":"Go kick her butt.","commenter_a":"you go donald !","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153442535983132","commenter_b":"there is tons of transgender models lol","commenter_a":"Beautiful!","post_message":"If 2015 wasn her year already, it sure is now."},{"comment_id":"934295046610968","commenter_b":"Run Sarah RUN!! President Palin has a certain 'RING' to it !!!","commenter_a":"SHE IS OK WITH TORTURE. REMEMBER?","post_message":"When Sarah Palin posted a picture on Facebook bragging about how her son used their family dog as a 'stepping stone,' she proved once again that animal abuse doesn't bother her at all, and animal rights groups are now slamming her for it."},{"comment_id":"1436141653072527","commenter_b":"Europeans, that's a joke all in its self.","commenter_a":"For all those that think protests didn't block traffic in MLK days. Stop using him as your go to pawn thinking you know something about civil disobedience and fighting for rights.","post_message":"It's the image that is defining a protest movement."},{"comment_id":"10153793026628010","commenter_b":"'@username Try entering Mexico illegally and see what happens","commenter_a":"Most illegals can't come on work permits or marry for papers. Most hope to just work and return home. Lebanese, Greeks, Armenians and Syrians, Salvadorians are fleeing their countries do to violence. Are they criminals for entering the USA, and other countries in order to want to survive? Wanting a better life isn't a crime.","post_message":"It is the fourth immigrant detention facility in the U.S. where protesting detainees have refused food in recent weeks."},{"comment_id":"1281953805157000","commenter_b":"Fuck Obama and his white trash skank bitch Hillary","commenter_a":"Our wonderful President, sorry to see you and your family go.","post_message":"President Obama has been known to break into song from time to time..."}]
