[{"comment_id":"10153623967716323","commenter_b":"This is the best thing ever said. Ever.","commenter_a":"Uniting all parts of Yorkshire could be a bad idea. If it took our fancy we could go game of thrones on your arse!","post_message":"\"Pit a bunch of Yorkshire folk against outsiders and they’ll all chunter on about how chuffing brilliant God’s Own County is. Put a Bradfordian, a Sheffielder, a Yorkie and a Leeds lad in the same room, however, and they’ll argue about their football teams, the relative quality of their beer, the beauty of their landscape and women, and everything in between. Often all that will unite them is a shared disdain for Hull.\" Full disclosure: Helen Pidd is from Lancashire."},{"comment_id":"10153659427149087","commenter_b":"@username Yeah, I've been to a few strip clubs in my life. Good looks though don't mean a girl can perform.","commenter_a":"It's the old emperor with no clothes on eyesight ... The schmuck can't see. He can't even see that his wife is a little hoish, not just the adulterous sex while he was married to his prior wife, but the many pictures like the one I've got in my downloads of a Melania Drumpf doing full frontal nudity, with a wet soapy body, wet hair, seductive pout, and a hand over her crotch doing the two finger simulated insertion. Ha, he can see everybody else and their blemishes .... and talk about them ad nauseum in the most insulting and revolting fashion, but he can't see his naked self .. nor, ha, his naked wife.","post_message":"\"Wow, Corey Lewandowski, my campaign manager and a very decent man, was just charged with assaulting a reporter,\" Donald J. Trump tweeted. \"Look at tapes-nothing there!\" WATCH THE VIDEO HERE:"},{"comment_id":"10153064906873984","commenter_b":"Providing we can sue you - You don't even secure the borders .","commenter_a":"Another Hitler.With his name being Barrack Hussein Obama,what do you expect. He's proud of his name,and being a Muslim.","post_message":"A government in control of all cyber space is slowly taking shape. Consider yourself warned."},{"comment_id":"10153944733281178","commenter_b":"She should be in jail.....sick, liar.....","commenter_a":"She's mentally ill or clinically insane.","post_message":"If this came from a Republican, their campaign would be immediately over. #TTT16"},{"comment_id":"10153050855917452","commenter_b":"Sound like she listening to Future lol","commenter_a":"Lmao wtf","post_message":"A suspected car thief got out of the vehicle and started dancing in the middle of the street after leading police in a wild chase through downtown Los Angeles. @webpagelink"},{"comment_id":"1072744952785252","commenter_b":"Stacey Wilson this is the women I was on about on tv the other day","commenter_a":"Ben Haymes","post_message":"She wants YOU to pay to improve her sex life"},{"comment_id":"608045926060248","commenter_b":"Try saying dick her dick her. Another girl commented saying it coulda sounded like that. Lol","commenter_a":"I have alexa... She doesnt curse. She bleeps(literally) out inappropriate words in her speech automatically. Idk about this. I'm gonna try it.","post_message":"An innocent request turned awkward real fast! #WSHH"}]
