[{"comment_id":"10153068260504804","commenter_b":"It didn't read like that in my head...haha!","commenter_a":"Best president in my lifetime, second only to George Washington in my opinion.","post_message":"Today would have been the 104th birthday of our nation’s 40th President Ronald Reagan. As we remember President Reagan and his exemplary leadership, please take a few moments to watch this video compilation of some of the most memorable moments of his 8 years as President.    @webpagelink"},{"comment_id":"942693669149238","commenter_b":"None of the name calling is necessary... My views and opinions stand. ... And I can get my own personal point across WITHOUT name calling :)","commenter_a":"Wooooow people are so ignorant!! Since when is it 'crazy' to fight for freedom from a tyrannical government? They aren't trying to hurt anyone. They are wanting the ability to live free!! People are fined and jailed for living 'off the grid.' THIS IS WHAT WE CALL TYRANY PEOPLE!!! The constitution was created to help protect us from corrupt government... hence the ability to bear arms. This is why. GUNS DONT KILL PEOPLE, PEOPLE KILL PEOPLE!!!!","post_message":"BREAKING: Ammon Bundy says he, 150 militiamen taking over national forest reserve in Oregon to  up lands for ranchers, miners, loggers & to oppose  of the federal government. The group is also calling on  patriots to join them with arms."},{"comment_id":"10158335910850389","commenter_b":"California LARGEST INSANE ASYLUM IN THE WORLD Written by Chuck Garner on January 23, 2017 6:00 am - Interesting that the LA Times did this. Lou Dobbs reported this on CNN and it cost him his job. The only network we would see this on would be FOX. All the others are staying away from it. Whether you are a Democrat or Republican, this should be of great interest to you! Just One State be sure and read the last part try for 3 times. This is only one State If this doesn open your eyes, nothing will! From the L.A. Times. 1. 40% of all workers in LA County (10.2 million people) are working for cash; and not paying taxes. This is because they are predominantly illegal immigrants, working without a green card. (Donald Trump was right) 2. 95% of warrants for murder in Los Angeles are for illegal ...","commenter_a":"'Alternative President Donald J. Trump' you've been in the The White House only a week and already you're a total failure and made a complete fool of yourself so no wonder you LOST the popular vote and had such a SMALL crowd at your inauguration....by the way Mr. Alternative President you are delusional and need mental health treatment so please get some professional help before your words or actions are responsible for killing people....","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10152997685931336","commenter_b":"Now we have the iic ( idiots in charge ) fighting the isis. Stop talking about it and just do it.","commenter_a":"I hope isis dont watch tv...","post_message":"A U.S. military official has outlined plans to retake the key Iraq city of Mosul from ISIS terrorists as early as April, but the move has swiftly drawn criticism that the Pentagon is revealing too much information. @webpagelink"},{"comment_id":"10156496631915354","commenter_b":"Send her back, bitch!!!","commenter_a":"She is simply unqualified...","post_message":"This radical Leftist principal is out of control.  The principal's name is Eujin Jaela Kim. And what she's up to will infuriate most Americans."},{"comment_id":"10153183466936336","commenter_b":"It's an escort. Nothing will be done to prevent arms to Syria. Another red line crossed. He is an embarrassment and puts us all in danger from terror.","commenter_a":"Iran knows we have a coward President. Even these ships are like a lion without teeth because Obama is Commander in Coward!!","post_message":"U.S. Navy warships are shadowing an Iranian convoy approaching Yemen as the U.S. beefs up its presence in the region. Tune in to 'Special Report with Bret Baier,' tonight at 6p ET for the latest."},{"comment_id":"1784602218530696","commenter_b":"This lady is a clown with money. She is a joke","commenter_a":"gotta laugh at all these haters who are left over from Obamas reign! Its time to shake up the education system!","post_message":"Join us as Vice President Pence holds a swearing-in ceremony for the Secretary of Education, Betsy DeVos."}]
