[{"comment_id":"10155940729650354","commenter_b":"Sick disgusting bitch","commenter_a":"hahahaha yes she was tim...","post_message":"Unbelievable...."},{"comment_id":"10152763067471051","commenter_b":"Let that bitch rot.","commenter_a":"So @username all she has to do is profess her love for Jesus and all is forgiven. Huh......smh","post_message":"When her fiance broke up with her, this woman decided to make his 3-year-old daughter pay."},{"comment_id":"10153850699096955","commenter_b":"She got too big for her britches!!","commenter_a":"All of you hating on Kelly now, probably liked her before she decided she doesn't like trump.","post_message":"SCALIA'S SON BREAKS SILENCE"},{"comment_id":"10153434419026051","commenter_b":"How does such an ugly and lazy guy find that many women to breed with him.","commenter_a":"Can you say \"vasectomy\"..and a \"JOB\"","post_message":"This guy has 26 kids with 15 women and has been getting $50,000 per year in benefits. Now he’s getting a brand new special gift."},{"comment_id":"10154069186973967","commenter_b":"Yeah how dare she have an opinion, why didn't your whore mother have that coat hanger abortion she wanted?","commenter_a":"Check your shit together before basing bias yo..she was more concerned about her own BS and not about Nintendo. Also you have to be THIS goddamn retarded to lose an awesome job at Nintendo","post_message":"Nintendo watched her become the center of a witch hunt and did nothing publicly to defend her."},{"comment_id":"10153994015308132","commenter_b":"Chile sit her was down Jim Carey prob has Ebola and she sucked that Dick down","commenter_a":"Ignorant woman.","post_message":"Jenny McCarthy has more to say about Charlie Sheen."},{"comment_id":"1359423070754409","commenter_b":"WOW gives a whole new meaning to hard boiled and 3 minute egg","commenter_a":"So we're any charges filed on the creeps who took advantage of her bad luck?","post_message":"The woman admitted she exchanged sex for money and that she performed sexual acts in a chicken coop."}]
