[{"comment_id":"10153747063291336","commenter_b":"I agree with him we don't need any more illegal Mexicans in the US","commenter_a":"Even dead Trump is making money! Trump 2016!","post_message":"A former NYPD commissioner is warning Donald J. Trump to not take the purported threat lightly."},{"comment_id":"1474175135944775","commenter_b":"Two idiots,","commenter_a":"Hard to do when she said she wrote the speech herself, how did we get to this guy being nominee, wow","post_message":"Did they do it on purpose?"},{"comment_id":"10152522515306717","commenter_b":"Trust bitch, more Gays will flock to Nikon, you're obviously a total moron","commenter_a":"Won't be buying anything from that company or my family or friends Adam and eve people not Adam and steve","post_message":"Click here to follow LGBTQ Nation on Twitter: lgbtqn.at/tw"},{"comment_id":"492601187597128","commenter_b":"Again radicalism get rid of these people and do not give in to thier demands","commenter_a":"Wasn't bacon on the menu when he started working there???? And KFC just suspends him????? I think we've found a new weapon......pork bombs!!","post_message":"Muslim worker threatens this customer, but he stands his ground. Good. He didn't do anything wrong, we support this American customer. Do you agree this Muslim worker should be deported?"},{"comment_id":"1123021131087914","commenter_b":"the bulshit they talk is baloney. the true Americans are the native people the rest are immigrants.","commenter_a":"eah did you ount the dead, I mean the millions massacred by your ancestors the funding fathers the true Americans the only ones with the right to talk about how bad is immigration. Your talk is baloney.","post_message":"A Pew study found immigration will account for 88% of U.S. population growth over the next 50 years."},{"comment_id":"10153205127216336","commenter_b":"They should be arrested, if any are on welfare they should lose their benifits..!!","commenter_a":"So they riot and loot because they don't have jobs and are poor?","post_message":"\"Because of my faith in God and people in the church that never gave up on me, I was able to pursue my own calling and purpose and destiny.\" Pastor Donte Hickman of Southern Baptist Church (Baltimore) told Gretchen Carlson that the youth in his community are not a lost cause."},{"comment_id":"10157268817905551","commenter_b":"not NO more BITCH!!! your goin DOWN!!!","commenter_a":"Take him out and watch what happens especially when his refugees and rioters, illegals dont get paid","post_message":"Emails Prove that the Real Leader of the Democrat Party is George Soros"}]
