[{"comment_id":"10153095720526051","commenter_b":"You poor sick woman, you must have never gone to school ever.","commenter_a":"Not saying what he did by any means was right.... But blacks are openly threatening to kill us everyday... The Black panthers said they were going to bomb white nurseries and how they need to rape and kill all white women and children. All this can be looked up. There are numerous hate crimes committed by blacks against whites everyday yet finally a white boy snaps and it's everywhere on fb and everyone wants him publicly hung. Obama is now pushing his gun control bs again over this but why doesn't he do that over the thousands of shootings everyday pointed towards the black on black crimes? Open your eyes people... I think you're all missing the much larger picture here.....","post_message":"Dylann Roof just confessed to the #CharlestonShooting. He says he had just one goal in mind when he opened fire."},{"comment_id":"10153930448466323","commenter_b":"And you are a very unattractive white woman","commenter_a":"She is a fat, untalented negro who should have made the best political statement by boycotting the super bowl... It's disgusting that stupid entertainment pays people so much while so many are suffering... My husband saves lives for a living and paid way more for his education than any of those people and makes a fraction of what they do... All of them disgusting","post_message":"'This is not some sudden awakening for Beyoncé – she has given millions to the homeless in Houston, her home city, she and her husband Jay Z have bailed out Black Lives Matter protesters in Ferguson and Baltimore. But now she is moving this highly visible assertion of identity centre stage. Her blackness, her femaleness, her pride, her politics, are not some kind of mysterious subtext.'"},{"comment_id":"10154019133956045","commenter_b":"Ronald Collier","commenter_a":"They could have let this woman get a ride home,,, or even took her home.. she wasn't on the road at the time.. where is the love in this world? I bet she was writing an unbiased story about the council meeting discussions..","post_message":"A Franklin County teacher has been arrested while working at a second job."},{"comment_id":"10153680967462577","commenter_b":"These migrants have been through much and they should be afforded more rights than everyone else. Don't wanna get attacked by a Muslim migrant? Stay inside. A Muslim migrant broke into your house and attacked you? Should have gone outside.","commenter_a":"The world is a sick place where everyone's rights are being removed under the guise of equality. Everyone has the equal right to shut up and lick big government's boots while footing the bill. Fuck this bullshit.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153101086445736","commenter_b":"a burnt pussy lips","commenter_a":"Shannon Linda Harman","post_message":"Thanks to some 'Sound Prosthetics' Honey and Badger are on a roll."},{"comment_id":"1157451387627650","commenter_b":"Another sidetracking trick.","commenter_a":"Ah yeah. That should do the trick.","post_message":"OBAMA'S NEXT MOVE TO SCREW AMERICANS and protect illegal aliens...  @webpagelink"},{"comment_id":"10153459873801756","commenter_b":"She's a Jew deliberately provoking hatred between Christians and Muslims.. Ask yourself why...","commenter_a":"I have to say I thought more people would be for protecting speech from violence, since we're in the liberal west and all, but apparently not. Paris gets shot up and the claim is to be 'je suis charlie,' Texas gets shot up and 'they were asking for it.' Makes no damn sense. You're either for the rights of us all to speak without fear of being shot, or you're not. I went to a public school and I learned that Voltaire quote. Small minded terrorists of an idiot ideology that requires giving your life to kill anyone who mocks your 'sacred' beliefs. What a load of bullshit.","post_message":"The group's executive director runs a website called Atlas Shrugs, which The New York Times says 'attacks Islam with a rhetoric venomous enough that PayPal at one point branded it a hate site.'"}]
