[{"comment_id":"10154273295026051","commenter_b":"Illegals cant vote genius, doesnt Trumps morin base know 95% of his workers are illegals working on HB2 visas ? He games the laws to get illegals to work for less money because he says he cant find experienced US workers, he thinks Americans are fucking idiots and lazy and Boy did he get that right !!","commenter_a":"Once you take all the illegals out, she will have lost the popular vote too. The electoral college was created for a reason. Should not be changed!","post_message":"Hillary Clinton continues to increase her lead in votes over Trump despite losing the election. Do you think the electoral college should stay?"},{"comment_id":"10153823695146336","commenter_b":"FORGIVE HER AS GOD FORGIVES YOU....PUNISH HER IN OTHER WAYS..NO CELL PHONE..NO XBOX. ..NO TV IN HER ROOM..NO COMPUTER IN HER ROOM (ONLY FOR HOMEWORK OVERSEEN BY YOU)","commenter_a":"It's called tough love. That's what children need","post_message":"Would you cancel Christmas to punish your child for stealing?"},{"comment_id":"686618911486884","commenter_b":"Does this arbitrary terrorism not offend a large number of your customers, therby, justifying, really justifying firing such a dumb asshole?","commenter_a":"How much do he makes,","post_message":"This might be the worst CEO in the country and no, it’s not Papa John this time."},{"comment_id":"10153682330001037","commenter_b":"She's nuts.","commenter_a":"Just sad","post_message":"“I honestly regret what I have done and take responsibility for it,' wrote Petra Laszlo in a letter to a Hungarian newspaper."},{"comment_id":"922540534474731","commenter_b":"DO IT! I am afraid that he will fire them all and replace them with illegals and give them citizenship.","commenter_a":"I'll support police officers","post_message":"Cops Threatening To Turn Their Backs On Obama At Annual Police Memorial Friday  @webpagelink"},{"comment_id":"908173805909035","commenter_b":"Absolutely. Although I do remember getting erections as a child when I saw the vaginas of changing women","commenter_a":"If a woman has a problem with a little boy sharing the facilities, she needs to rethink her attitude. No harm done. Children's safety should always be the #1 priority.","post_message":"When SHOULD a child start going into public toilets on their own?"},{"comment_id":"1336023863131032","commenter_b":"Ppl crazy af time for u ta go","commenter_a":"Renata","post_message":"The female had to get some  in too. #WSHH"}]
