[{"comment_id":"10154883066819411","commenter_b":"They don't care about children being blown to bits as long as they can let trans use women's toilets and have gay marriage","commenter_a":"They are so fukn stupid. Clinton will plunge this world into war and then run for the nearest bunker.","post_message":""},{"comment_id":"10150839207834999","commenter_b":"@Gabrielle Nicole Alvarez By that logic, any psychologist whose job it is to draw such distinctions about attraction is a paedophile and any feminist knowledgeable about different types of abuse is a rapist. @@username hebephilia concerns the early stages of puberty, so ephebophilia, attraction to mid-late teens, might be more fitting.","commenter_a":"And now we wait for the complaining pedophiles...","post_message":"Miss Teen USA is ditching bikinis for athletic wear."},{"comment_id":"10153635584924575","commenter_b":"What about rap videos or BET...come on people","commenter_a":"All them white girls in one video.....thats RACIST","post_message":"A University of Alabama sorority has taken down a recruitment video after receiving a lot of criticism. One website described it as, \"Stepford Wives: College Edition. It’s all so…unempowering.\""},{"comment_id":"10153908275696545","commenter_b":"@username the problem with the wall is it can be breached and take years to build, and will still have to be guarded. How about we just beef up border patrol and guard our country the way it was intended? If you research you will find that there are miles of tunnels already that bypass above ground entry. Although we have National guard at the borders they have no jurisdiction to stop anyone from entry and can only alert border patrol. If border patrol is busy elsewhere then the illegal immigrants are not stopped. These are the issues that need to be addressed building a wall is useless as we will still have the same problem not enough manpower to protect it.","commenter_a":" the \"wall\" is the most ridiculous idea to come out of a politician yet. Good luck getting Mexico to pay. How about you use common sense and get congress to give up funds for proper border patrol?","post_message":"If Donald Trump is softening his stance on undocumented immigrants, he didn't mention it to several thousand supporters at the Travis County Expo on Tuesday night. “We are going to build the wall,” Trump said to cheers. “And who’s going to pay for the wall? Mexico!”"},{"comment_id":"10153535338020779","commenter_b":"@username Britney is better","commenter_a":"For anybody who has been to shows like Springsteen , Pearl Jam, Metallica, Pink Floyd, it's mind numbing watching Popular music in 2016.","post_message":"Britney Spears opened the #BBMAs with a career-spanning medley of her hits. Watch below."},{"comment_id":"10154222975181336","commenter_b":"Throw Megyn Kelly up and over #TrumpWall and into Mexico!","commenter_a":"This is supposed to be a cutting edge news story? I am really disappointed with Megan Kelly. Every episode is guests who trash Trump. Megan always has guests on that attack Donald about women. It is her agenda. it is disingenuous.","post_message":"TONIGHT on The Kelly File: In an exclusive interview, Ted Cruz's wife, Heidi Cruz, speaks out about Donald J. Trump's retweet of an unflattering photo of her: \"I think we have a pattern of behavior here ... when Donald Trump is falling behind.\" Don't miss the entire interview with much more at 9p ET. @webpagelink"},{"comment_id":"10154108457106782","commenter_b":"She probably screwing him","commenter_a":"Of course she supports him. She's nearly as stupid as he is.","post_message":"Kellyanne Conway, the high-profile White House counselor, has come under fire from Democratic and Republican lawmakers, fact checkers and the media. But she's so far maintained the support of her boss, President Donald Trump. @webpagelink"}]
