[{"comment_id":"1629456670679882","commenter_b":"Little Winnie bitch","commenter_a":"Toddler, bigot, lier","post_message":"Think quick! Then, click 'like' on your favorite answers in the comments.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"926308994070863","commenter_b":"Nope, I kill the bastard and accept id be going to prison my whole life, but at least my child would live.","commenter_a":"It's possibly the worst idea in history to allow the shooting of a cop. Even the absolute worst cop could be clubbing a baby and still, if he were shot and killed in the act he'd die a hero and we'd never hear the end of it. We need to shoot cops, but with our cameras, never ever with a gun.","post_message":"Some states are dealing major setbacks to the Police State."},{"comment_id":"679238678931090","commenter_b":"I have been drinking Pepsi since 1966! I will NEVER BUY IT AGAIN, not because of what she said , but because TRUMP HAS SAID FROM THE BEGINNING , This country has sold out to foreign countries that hate us AND PEPSI HAS THIS WOMAN IN CHARGE OF AN AMERICAN COMPANY!!","commenter_a":"When will they ever learn.. Boycotts work..","post_message":"INSTANT JUSTICE... Let's get 5,000 SHARES for TRUMP!"},{"comment_id":"10153923556708690","commenter_b":"they will unfortunately forever be in western countries, untill all western countries are taken-over by muslims, because western countries have welfare system, none of the arab countries have a social welfare system like western people... so only when social welfare is completely destroyed like in sweden, they will have to get back to survive.. (^_^) sweden has taken in so many muslims it completely destroyed the economy.. destroyed women lives, destroyed everything. welfare is completely drained","commenter_a":"Maybe Muslims should stop migrating to Australia than and instead migrate to the arab countries.. Why don't they? Why do muslims prefer to migrate to democratic Australia and the western countries rather than the sharia-ruled arab states?","post_message":"A November survey by two universities and a research centre suggests that Muslims in Australia experience racism three times the national average. @webpagelink"},{"comment_id":"685166964976590","commenter_b":"Donald Trump is what the definition of corrupt is. She won popular votes. He wont build a wall! He wont deport all illegals and he wont make america great by killing obamacare for millions of people. Your beyond stupid if you think you'll get anything from selfish republicans.","commenter_a":"Should have seen this coming since the day she barley beat Bernie even with all her corruption and everything in her favor😭😂","post_message":"Hillary Clinton's advice to young people: 'Never stop believing that fighting for what is right is worth it.'"},{"comment_id":"10153776592904087","commenter_b":"Socialists always promote Violence. In Europe They promote Muslim Violence by being WEAK!","commenter_a":"Bernie is an enabler for the lazy self entitled youth of this country.","post_message":"'Party leaders in Nevada...claim that the Sanders campaign has a ‘penchant for violence.' That is nonsense,' Bernie Sanders said in a statement. 'Our campaign has held giant rallies all across this country, including in high-crime areas, and there have been zero reports of violence.'"},{"comment_id":"618837121600063","commenter_b":"bitch","commenter_a":"Donald Trump is beginning to understand why they did want him involve, right? @webpagelink","post_message":"Paul Ryan is a ___________."}]
