[{"comment_id":"1356822761024859","commenter_b":"I agree. What a Bitch.","commenter_a":"shame all those parents whose children have been murdered by Obama can't sing to their dead children... wake up this man is a bastard","post_message":"This is the most beautiful thing you will see all week."},{"comment_id":"10153286169819705","commenter_b":"No, they aren't talking about Snow.","commenter_a":"Thanks for the spoiler","post_message":"For once, Game of Thrones didn't kill off a character when it looked like it was going to."},{"comment_id":"10153659405156955","commenter_b":"Stupid bitch","commenter_a":"She look ignorant.... Brainless!","post_message":"VIDEO: Student Leading College Protest / Walkouts and Demanding FREE College Gets Destroyed on TV..."},{"comment_id":"714279835348897","commenter_b":"More trigger happy pigs.","commenter_a":"Better to be tried by twelve than carried by six. Today's cops are not the cool headed officers of old. They are post 911 trigger happy thugs who think Johny Jihad is around ever corner. DO NOT CALL KEYSTONE COPS until the threat is gone or dead and your guns are put away.","post_message":"A Huntsville woman seemed to have been perfectly justified in firing upon a violent ex who walked through a restraining order. Whether she was a threat when she turned towards responding officers with the shotgun still in her hands is under investigation."},{"comment_id":"10154622434238433","commenter_b":"He's probably counting retirees. Of course, when the fascists STEAL our Social Security all those retirees will be forced back into the workforce.","commenter_a":"When Pence and other GOPers rattle off this crap -- it's aim is to cause anxiety and to inflate anger at such inequities - THUS, it is a100% LIETZOW, as it's meant to deceive!!!","post_message":"NEW: Is Mike Pence right that 1 in 5 U.S. households don't have anyone working? Well, sort of. Half True."},{"comment_id":"10155196605381178","commenter_b":"I suggest duct tape over her mouth...such a sad woman !","commenter_a":"Alveda King, Martin Luther King Jr.’s niece, accused Massachusetts Sen. Elizabeth Warren of playing the “race card” when she attempted, on the Senate floor, to read a letter written by Coretta Scott King in order to make her case against Sen. Jeff Sessions for attorney general. “It’s almost like a bait and switch, stir up the emotions, in the name of King—and my name is Alveda King—stir up people’s emotions, play the race card, which she was attempting to do,” King, who supported Donald Trump for president, said Wednesday on Fox Business Network. Sessions was confirmed Wednesday to be the next attorney general despite efforts by Democrats to derail the nomination. The full body voted along party lines to silence Warren for violating Senate rules after she attempted to read Coretta Scott King’s letter.","post_message":"Bitter, much?"},{"comment_id":"782624725204041","commenter_b":"SJ Shang dumbshit, the topic is how the allegedly peace-loving Muslims treat their kids. We have enough problems with idiots shooting each other in the US, we don't need more sand monkeys doing the same, whats so hard to understand about that? But you want to digress, fine. Americans desperately want to have dope legalized, to make themselves feel good. 80% of Americans are overweight, because they are lazy, they love to pop and abuse prescription pills and illegal drugs. They don't drink and drive responsibly, insist on texting while driving and play Candy Crush on the job. They refuse to live within their means, balance a checkbook. The last thing they need is one more useless addiction, and yet they whine and yammer about their right to be high .\"Dope fixes everything. If we smoked dope nobody would die from cancer anymore\"","commenter_a":"But we don't want Obama to address white Christian American murderers of children here because he might take our guns. Seems legit.","post_message":"I want a REAL president to step in and take these bastards out once and for all..."}]
