[{"comment_id":"10153831797228132","commenter_b":"She is not doing her job!","commenter_a":"I love all these comments","post_message":"\"Kim Davis should have never been locked-up for being a Christian,\" said Mike Huckabee."},{"comment_id":"10153112992879753","commenter_b":"How extremely sad... :( and the parents were to take CARE of her. The boy should be taken away...","commenter_a":"they need to be charge my grandson only has to say his ear hurt and it time to do something they are painful so put them away","post_message":"One-year-old Hope Delozier died from an ear infection because she couldn't count on the two people she should have mattered to the most. BS excuses. @webpagelink"},{"comment_id":"10154285827248701","commenter_b":"Trump build that wall!","commenter_a":"Trump will take care of these ghetto rats . They will be leaving the ghettos to find work so they can eat. Instead of waiting for his kids mothers welfare check .","post_message":"He is the second officer to go on trial for the killing of 25-year-old Gray, who died one week after suffering spinal injuries in a police van last year."},{"comment_id":"10155345287068132","commenter_b":"She needs to save her nekkidness for JZ.","commenter_a":"Wierdo & shes so over rated meh","post_message":"We're still not over Beyonce's performance! Join us in the comments to let us know what you thought."},{"comment_id":"1055064891200649","commenter_b":"Time to take them away before she kills them and why you are at it tie her tubes! Not smart enough to have children!","commenter_a":"Well try her in there for five minutes w/0 her iPhone, mirror and other items you know she thinks are indispensable....don't forget, no designer water, either!!!","post_message":"A Virginia mother left her two children unattended in a hot car, with windows rolled up as she turned herself in for leaving one of the children unattended in a hot car while she went shopping last month."},{"comment_id":"1317571668339082","commenter_b":"Same base of people that have supported him all along - not enough!","commenter_a":"Uhm, Trump is not losing support. Did you not see the amount of people that showed up to his rally today?? You've got to be joking!! He spoke to at least 25K people. And there were still people outside whom the fire Marshall would not allow in!!","post_message":"The National Rifle Association has spent more than $21 million on the presidential race, praising Donald J. Trump and knocking Hillary Clinton."},{"comment_id":"540716409449985","commenter_b":"they screwed up their country, and all they want is to screw up the rest of the countries","commenter_a":"Hell No !","post_message":"COMING SOON in your city and town..."}]
