[{"comment_id":"10153672150997217","commenter_b":"Watch your tongue","commenter_a":"Most muslims hate gays yet have no problem seeing a murderous paedophile prophet as a role model for all mankind? That's f***ed up I'm sorry but it is.","post_message":"BREAKING: The suspect for the mass shooting at Pulse Orlando gay nightclub is 29-year-old Omar Mateen, the BBC understands. It is believed the US citizen was not on a \"terrorism watch list\"."},{"comment_id":"10153255366409205","commenter_b":"You still had a chance to recognize the genders and learned from them, yes you are lucky that child is not!","commenter_a":"Justice! How about the child? Without father and stock at the house with 2 mothers? What kind of justice is this. Most of us grow up with family mother and father on site and easy for u to say is justified!","post_message":"JUSTICE! Lesbian Couple Gets Their Child Back"},{"comment_id":"1022812631106658","commenter_b":"You fucking cooks make this world more dense and dumb","commenter_a":"The cures are out there stop suppressing them","post_message":"Real talk for a second: someone I love very much has recently been diagnosed with terminal cancer, and I find myself growing even angrier with the charlatans who promise miracle cures and insult the incredible doctors and scientists who are working so hard to help the people afflicted with this terrible disease. They prey on desperate and sick people to line their own pockets. \"There is no alternative medicine. There is only medicine that works and medicine that doesn't work.\" Richard Dawkins Image via the Food Hunk."},{"comment_id":"506619736194965","commenter_b":"Thats some nasty, ass mf shit","commenter_a":"Que terrible,","post_message":"Workers reportedly wear diapers to avoid becoming so desperate that they urinate or defecate on the floor."},{"comment_id":"1156100184429437","commenter_b":"This woman is for Trump","commenter_a":"It was really disgusting watching how Fox News joined the rest of the \"Left-stream\" media last night in savoring Ted Cruz's Wisconsin win. Megyn Kelly & co. continually dissected the voters by pointing out that \"Trump was losing the appeal of woman voters.\" \"That Wisconsin voters were educated and paid very close attention to details!\" How sad. Never in my life have I witnessed how the GOP could deliberately try & take down one of their own while leading the attacks against Mr. Trump in their on-going crusade \"to stop Trump!\" This is very disturbing. Cruz and that nasally annoying voice of his was carrying on as though he transformed this presidential race when in fact it was Mr. Trump who initiated the anti-establishment hostility from the moment he threw his hat in the presidential ring. Cruz is a GOP plant as is Kasich.","post_message":"THE EXPANSION OF TERROR is so much worse than what we'd like to admit, a new report out of the EU confirms: @webpagelink"},{"comment_id":"943135932412822","commenter_b":"Shake those lady lumps","commenter_a":"Hump on a Hump!!!","post_message":"He denounces the idea of marital rape as 'made up by European people'"},{"comment_id":"1600332060187317","commenter_b":"she's a skank...","commenter_a":"Megyn seems to know that whether positive or negative, any publicity is good. Think about this Megyn, apologize to Trump and you'll be a headliner in all the major news outlets. .","post_message":"Megyn Kelly EXPOSED!!"}]
