[{"comment_id":"10153703182846438","commenter_b":"lolz u wot m8","commenter_a":"just look at them..smh ....what idiots and morons","post_message":"Why his supporters stick with him despite all his gaffes and lies."},{"comment_id":"10152889300511051","commenter_b":"Prosecute these fools ASAP!","commenter_a":"Once again this is the reason for the death penalty, see if they would be laughing then!","post_message":"This group ran out of a restaurant without taking care of their bill. When a waitress followed them, they decided to make her pay."},{"comment_id":"10154311715577293","commenter_b":"DUMP IS A BULLY BUT ONCE HE IS CHALLENGED, HE CAVES. REMEMBER HOW MEXICO WAS GOING TO PAY FOR THE WALL?","commenter_a":"I worry about it probably in a southern state. sTrump supporters have suspended all logic and common sense. I am sure that professionals in the mental health field can talk about group hysteria. sTrump is already stirring the pot in an effort to incite his supporters. They've already suspended logic so I expect that some will act. Look at sTrump rallies...","post_message":"Half of likely voters fear violence either on Election Day or after."},{"comment_id":"638058836332906","commenter_b":"Keep praying! @username is a Warrior for Christ!","commenter_a":"I was born and raised in Pennsylvania, and I'm hoping and praying that come election day the good people of PA will vote for a Presidential candidate who is a life long Conservative, versus an Entertainer!","post_message":"For seven years we've seen an administration that abandons our friends and allies.  That ends when I am president!"},{"comment_id":"10153808795866336","commenter_b":"@username Typical Illegal Alien.","commenter_a":"Frankly it feels lousy to be called a murderer when all I'm trying to do is keep you safe. Im not a murder. That is slanderous. That is not how I act","post_message":"Quentin Tarantino has finally responded to the firestorm that’s been brewing since he criticized police officers at a rally last weekend, and he says he won't be \"intimidated.”"},{"comment_id":"10153846948701162","commenter_b":"The wording is hilarious though. \"Twerking on a stranger\"....lol!","commenter_a":"@username how ridiculous are these two idiots!","post_message":"CRIME OF TWERKING: Two women are being sought for sexual assault after twerking on an innocent man.  FULL VIDEO: @webpagelink"},{"comment_id":"1211132575573437","commenter_b":"In the end, no ones opinion will matter; only God's word... Read it... One God, One way to heaven and One way of marriage- Man and woman... not two men, or two women or two women and a man or one man and 10 women.... Marriage is between a man and a woman...The bible says be fruitful and multiply so if you want to convince bible believers, let two men physically produce an offspring from their body or two women or one woman without the help of a male sperm .... that alone should convince you it's not natural or right...","commenter_a":"Gov needs to step in and force her out!! Call for that emergency meeting and have her step down!! Why are we entertaining this woman...","post_message":"\"Davis is simply wrong,\" lawyers for Kentucky Gov. Steven Beshear said."}]
