[{"comment_id":"1175029912517037","commenter_b":"Hal the point is we do need to tighten our borders, there are too many illegals here that get a free ride from the tax payers, and as much as people are going to hate this, if you came here illegally the children you have here are illegal. So, I do agree with you just never heard of known a Canadian to come here just to have a baby.","commenter_a":"look people. If you come to this country legally, doing all the appropriate paerwork and forms, any kids you have that are born here will be American Citizens. That won't change. What we want to change is the Anchor Baby tourism that flourishes on the West Coast, with the Asian women travelling here on 'vacation' to have their babaies in specially marketed motels just for them, so that their children, and them by association many times, would be American Citizens. And those illegal immigrants who cross our northern and southern border, from a multitude of countries, who break the law by sneaking in like a thief in the night, who have their babies here hoping for the chance to stay with them. People should not be rewarded fro breaking a law.","post_message":"With a renewed conversation challenging birthright citizenship, a look back at the 1898 case that first established the legal precedent in the U.S."},{"comment_id":"10153294684803132","commenter_b":"This witch is EVIL!","commenter_a":"She should be charged with murder.","post_message":"'When he actually started to carry out the act, he got scared again and exited his truck, but instead of telling him to stay out of the truck ... Carter told him to 'get back in.''"},{"comment_id":"10153577696206337","commenter_b":"yeah.. IM gross wonder how many old fat bitches are just jealous that some 16 year old whore was getting his footlong? 'young teen: my azz, she was advertising on craigslist looking for the D 16 is legal in his state moron for good reason. id pound the shit out of some 16-17 (contingent on state) year old pussy fuck yall","commenter_a":"God damn it, Jared. We don't have to worry about Ronald FUCKING McDonald FUCKING AN UNDERAGE GIRL!","post_message":"BREAKING: Former Subway spokesman Jared Fogle allegedly bragged about paying for underage sex in a series of lewd, sexually explicit texts..."},{"comment_id":"10155083272367994","commenter_b":"I don't care if this woman is a mental reject, I'd like to throw her off a bridge to see if she can fly.","commenter_a":"She forgot to take her psychotic pills...","post_message":"Officials: Woman throws dog from bridge, claiming it can fly."},{"comment_id":"10153842833302756","commenter_b":"Racist? Ok then. Keep letting the Muslims in this country to terrorize. Let the BLM people go unchecked and keep killing our Police. Let illegal Mexicans in to drain our already overtaxed healthcare system and bring more drug violence. No, no more. It ends now.","commenter_a":"I can't wrap my head around how anyone comprehends what he's saying. He literally says the same thing OVER AND OVER, but I guess that's the only way his racist, small-minded supporters can understand him.","post_message":"Republican presidential nominee Donald Trump spoke with Newswatch 16 after his rally in Scranton on Wednesday. See more here: @webpagelink"},{"comment_id":"1602376966724515","commenter_b":"'@username I am fully aware of who I have voted for since 1992. Hillary Clinton put herself in this position by NOT doing what's right and serving HER own interests. Public Service is a privilege and shouldn't be abused. I look forward to more ethical women running for President in the future, hopefully in my lifetime.","commenter_a":"She puts herself in a coma just hearing herself!! Her own husband is so unimpressed, HE doesn't know her campaign slogan!!","post_message":"LIVE NOW: Hillary Clinton early vote rally, Cedar Rapids, Iowa"},{"comment_id":"1789900814667772","commenter_b":"She needs to leave this country ....POS !!!","commenter_a":"Idiot!","post_message":"Actress and activist Ashley Judd delivered harsh words aimed at President Trump from a poem written by a 19-year-old girl from Tennessee."}]
