[{"comment_id":"10154478839956636","commenter_b":"@username without god, noone can hear you get shot. Your worldview is wuite hopeless. Without god, who will punish evil ppl then evil has won. Rofl","commenter_a":"They found the remains of velociraptor Jesus used to ride on.","post_message":"Incredible"},{"comment_id":"712897555475520","commenter_b":"Yes.. Of course the illegals have been vaccinated.... If their illegal we wouldn't know NOW would we?..... And it doesn't just mean Mexican... It means any child that enters our country illegally.... Plain and simple.....","commenter_a":"So that would be all ilegal children at the very least! Who should not be in our schools anyway!","post_message":"Anyone who hasn't been vaccinated is being told to avoid visiting Disneyland."},{"comment_id":"909973475802498","commenter_b":"When someone becomes president, their immediate family (wife and kids) need to be a good influence on the rest of the country.","commenter_a":"I'm for legalization personally. But until it is I follow the law.","post_message":"Oops?"},{"comment_id":"10153940739241178","commenter_b":"What a bum bitck","commenter_a":"IDIOT!","post_message":"MSNBC host goes on CRAZY rant about Star Wars being racist."},{"comment_id":"10152734752671051","commenter_b":"Unbelievable! some women should not children and she is one. Discipline begins at home.","commenter_a":"Needs a good ole fashion spankin.","post_message":"This 11-year-old boy is responsible for a fifth of the crime in his town – and his mother knows exactly who to blame for that."},{"comment_id":"10154013744111378","commenter_b":"Facepalm! So because we have rapists in this country, we should import more?","commenter_a":"No more refugees! Too many of them seem to be mentally ill.","post_message":"Olango arrived in the U.S. in 1991 as a refugee from Uganda."},{"comment_id":"589287567920858","commenter_b":"Wanted to see the dogs lock jaw these pos","commenter_a":"Click bait everywhere goddamn","post_message":"A man was slashed after coming to the defense of a dog. Surveillance video shows the two men punching, kicking and beating dogs on Staten Island."}]
