[{"comment_id":"10153535023142522","commenter_b":"fine, let's see what you got","commenter_a":"@username reckon you can make one of these with those design skills of yours?","post_message":"Grill while you chill:"},{"comment_id":"10154498360755958","commenter_b":"You mean the Virginia Mary who gave birth to JESUS. I highly doubt that is the reason for the hijab..when many women rose up in the middle east against wearing it.","commenter_a":"I am amazed and sickened by the racist comments posted here. She is a doctor working in America saving American lives. She can wear whatever she chooses because this is America. Wow...","post_message":"\"I'm so happy to be back here in Cleveland.\" The Cleveland Clinic resident who was forced out of the U.S. under President Trump's executive order is back home and speaking out for the first time."},{"comment_id":"998702053501364","commenter_b":"Prison. He can still rape again without a tongue.","commenter_a":"Jail the bastard","post_message":"He lost his tongue. Is that punishment enough or should he go to jail as well? [Read below]"},{"comment_id":"1556960097657348","commenter_b":"This is a state with Making a Murderer. I'd be wary.","commenter_a":"Eternal rest grant unto HUSSAIN, O Lord, and let perpetual light shine upon HIM. May the souls of the faithful departed, through the mercy of God, rest in peace. AMEN!!","post_message":"Police say it's likely several people saw Alnahdi being beaten, but only one has come forward."},{"comment_id":"10153575430048525","commenter_b":"It is absolutely ludicrous that a law had to be made for that. What she did was animal cruelty.","commenter_a":"It used to be legal but in 2011 they pass the bill in Florida banning sex between humans and animals.","post_message":"Deputies say they arrested her after seeing video. STORY: www.fox13news.com/news/florida-news/@username-story"},{"comment_id":"1139840619402033","commenter_b":"Hey, if he wants them in California, I thonk we should let him have them. While were at it, lets build a wall around California too.","commenter_a":"What a POS he is","post_message":"Even the FBI says they can't propertly vet these migrants..."},{"comment_id":"994387677320953","commenter_b":"That witch is who is teaching our children","commenter_a":"This man is on point👍🏾","post_message":"Woah, THAT escalated quickly! What's YOUR opinion?"}]
