[{"comment_id":"10153644186381336","commenter_b":"If our courts allow Muslims who demand to be tried under Islam law, to actually be tried under Sharia law - why can't Christians demand be tried under Christian Biblical law? Courts allow it for Muslims. This raises a constitutional question - Under the 'Equal protection Clause' of the 5th and 14th Amendments, should Christians be afforded equal protection under the law - to be tried under Biblical law equal to Muslims demanding to be tried, and their case(s) adjudicated for crimes under Sharia law?","commenter_a":"Why can't another clerk do it ??? Problem solved !","post_message":"“Some people have said I should resign, but I have done my job well,” Rowan County Clerk Kim Davis said in a statement."},{"comment_id":"10152853716122894","commenter_b":"I get tired of hearing about this lil hoe everyday","commenter_a":"Biancaa Ft Blue","post_message":"Watch: Kylie Jenner Gets 'High as F*ck', Tries Popeye's Chicken for the First Time [Video]"},{"comment_id":"10154189751584062","commenter_b":"Whiney tail! That's what my mother would have called him. Shame!","commenter_a":"He sounds like he needs a pacifier and a security blanket. ..","post_message":"Garnet Coleman is defending his claims that he felt mistreated during this traffic stop last month, despite what the video shows. Some law enforcement groups are demanding an apology - hear what he has to say about that tonight at 10. You can see video of the entire stop here: @webpagelink"},{"comment_id":"537696536420926","commenter_b":"I don't like her anyway no matter what. Don't trust her","commenter_a":"Its a joke this woman no never come out as president she's wasting her time in her money we all know nobody wants to Clinton back in the White House","post_message":"Hillary Clinton's sex slave just exposed her for doing THIS.  What a disgrace. She will never be president.  Can we get 20,000 'LIKES' to make sure Hillary never becomes president?"},{"comment_id":"836801636436616","commenter_b":"Any one doing this should be around up put in jail and when it is time to get out they should be deported","commenter_a":"And those BASTARDS in DC want to bring in over @username in the next two years. HELL NO","post_message":"Broad daylight in Germany. Watch Muslim 'refugees' beat the crap out of this mom and daughter. Can you say, 'extended magazines?' @webpagelink"},{"comment_id":"10154141762806162","commenter_b":"Wild animals!!!!! trump is the wild animal causing all this bs PIED PIPER !!!","commenter_a":"People need to stop blaming Trump for the actions of low life people. They get out of hand, then don't want to own up to their actions. It's the generation of placing the blame elsewhere. Trump didn't tell them to act like wild animals. That's just how they act.","post_message":"\"We're going to take our country back from 'these people,'\" Trump told supporters after his canceled Chicago rally. \"These are bad, bad people.\""},{"comment_id":"10153663594614160","commenter_b":"You've Been Blamed because you brought us down to our Knees but we'll fix it all under Trump and wipe away ALL traces of your rotten deeds against our Beloved America--now go kiss some more Muslim butt and bring in more Illegals you only have 7months left ---","commenter_a":"Of course he is trying to deflect blame.","post_message":"\"I have been blamed by Republicans for a lot of things\""}]
