[{"comment_id":"614194488771130","commenter_b":"Good for them and if was some other county's,or orig,before 1860 or maybe south it before civil main thing is who cares when was adopted by south or when ain't THERE flag now belong's to the SOUTH and USA.now.AND GO SOUTH go TELL THE IDIOT'S TO Get LOST UR FLYING IT FOR EVER OR ANYONE ELSE WANT'S TO FLY IT in THIS CNTRY'S 50 not 57 or 58 states u idiot abomination it's 50","commenter_a":"fantastic!!","post_message":"NASCAR fans at Daytona refused to hide their support of the Confederate flag.  This is true patriotism. They are proud to be Americans.  Do you support their refusal to back down?"},{"comment_id":"10153363421176438","commenter_b":"Whore = prostitute. Whole other issue.","commenter_a":"yea its true...normal guys care and dont really want to settle down with a past whore","post_message":"Trainwreck says straight men care about their girlfriends’ “number.” Is that true?"},{"comment_id":"965413580245506","commenter_b":"Keep trying @username. Killery the lying hag will fall short.","commenter_a":"PT Barnum is running for president!!","post_message":"Donald J. Trump tried to remember #DDay with a photo that wasn't from D-Day."},{"comment_id":"963844390305083","commenter_b":"Atlanta housewives just ratchet!","commenter_a":"We got housewives of Orange County, Beverly Hills, And New York. Those women act like straight up fools. I'm wit you Lisa Ray but Uhmm hey morals are out the door when it comes towards cashing in","post_message":"She says she's trying to bridge the gap between 'us sistas,' not take part in some of the controversial reality shows out there."},{"comment_id":"10157736489990603","commenter_b":"Omg I think it's funny that 12 year olds got onto their parent's Facebook and are saying things like lick my butthole. Classy.","commenter_a":"Wow I knew the average Missourian was dumb but I didn't realize they had a fetish for shooting themselves in both feet.","post_message":"JUST IN: CBS News projects Donald J. Trump will win #Missouri."},{"comment_id":"1018817644877956","commenter_b":"#STOPHATEANDFEARMONGERING #dumpTrump #VOTEDEMOCRATS","commenter_a":"I have a bet going that Trump declares bankruptcy again after he loses the nomination. I hope he loses everything and all his foreign factories close down. DUMP THE TRUMP DUMP THE TRUMP DUMP THE TRUMP","post_message":"You reap what you sow."},{"comment_id":"10155235641066037","commenter_b":"Very true, so it's OK for them to think they can sneak in because they can't afford to become a citizen? We have plenty of people out of work and those are jobs the unemployed could be working now isn't it. No wonder Trump wants to cut funds to these city's. That opens up more jobs to Americans, because there is a minimum wage in states and you are not suppose to hire illegals.","commenter_a":"Sanctuary city's think the above the law and don't have to enforce the law.","post_message":"'I don't have a clue,' said U.S. Homeland Security Secretary John Kelly."}]
