[{"comment_id":"10153006205351051","commenter_b":"I would have shot him.","commenter_a":"I am glad he did what he did. This is what you do instead of standing around recording.","post_message":"This dad was driving his daughter to school when he saw a police officer on the ground with a guy on top of her. The guy was reaching for her gun. The dad didn't hesitate."},{"comment_id":"10154726386446729","commenter_b":"Evil witch!","commenter_a":"Sonny Blaze, happy Sunday","post_message":"But yeah, she's supposed to be a role model."},{"comment_id":"1062386963799539","commenter_b":"'@username Much like one refinances one's house at a lower rate. Sure sounds Republican to me.","commenter_a":"And this political cartoon shows why he should. Personally I'd prefer that he wait and allow a Democrat president appoint him to the Supreme Court.","post_message":"Does this about sum it up?"},{"comment_id":"10154243512856770","commenter_b":"We will send you more Muslims , you can send us the anti Muslims.","commenter_a":"I openly protest morons who throw homosexuals off buildings and burn people alive who don't bow before their god (may he eat pork)","post_message":"Police in Toronto, Ontario might charge a group of anti-Muslim protesters for violating hate crime laws."},{"comment_id":"1489236791096346","commenter_b":"Only 7% of the illegal aliens work in the fields, most work in the construction jobs, fast foods etc etc. 95 million unemployed americans need jobs, deport all illegal aliens and open up jobs for citizens not criminals.","commenter_a":"Hey Trumppets if you need a job...go apply in the fields....there's always jobs available! You got a teen that needs work, send them to pick out in the fields....give them those American jobs you ppl keep claiming immigrants are taking away!","post_message":"Donald J. Trump doubled down on his stance on immigration this week. Here's a breakdown of U.S. immigration by the numbers.  Read more about Trump's immigration speech: @webpagelink"},{"comment_id":"454038491472779","commenter_b":"What the Hell is wrong with this chick...one week she poses nude and another week she posts pic of her child, are we suppose to say which one we like better....you are a sad piece of work, girl","commenter_a":"Who cares????? Guess she wants him to be seen naked also. So popular for being nothings.","post_message":"Kim Kardashian West's newest snapshot of little Saint is a burst of son-shine!  (via Celebrity Baby Blog)"},{"comment_id":"903633816370041","commenter_b":"I saw this when I heard about it on the radio this morning. Lol","commenter_a":"Rudis Fernando Amir Casey Jeremy Jose Antonio damn","post_message":"No Brotherly Love: Eagles Play Drake's Back 2 Back Diss During Practice!"}]
