[{"comment_id":"10153389055716770","commenter_b":"Wow is she stupid or what. Racist pig.","commenter_a":"Sure we can play with a bad bad boy and you will get bad results","post_message":"A CNN guest argued that her ex-CIA panel-mate was unqualified to talk about ISIS because he's white."},{"comment_id":"1144542405568548","commenter_b":"@username bull","commenter_a":"Hilary should start a new centrist party for disenfranchised republicans, and the DNC should back Bernie. He stands for unions, while she slept thru Walmart union negotiations and stayed mute. He marched and protested for civil liberties while she was a Goldwater Girl. And the Clintons made shady insider trading deals with Tyson way back in the day to kick start their career. The only thing that makes her a democrat is her stance on women's issues. When it comes to war, trade agreements, corporate welfare, and dark money, she's a republican.","post_message":"\"That's what the American people are saying.\""},{"comment_id":"10157268817905551","commenter_b":"not NO more BITCH!!! your goin DOWN!!!","commenter_a":"Take him out and watch what happens especially when his refugees and rioters, illegals dont get paid","post_message":"Emails Prove that the Real Leader of the Democrat Party is George Soros"},{"comment_id":"10153837390443812","commenter_b":"No, just their sperm. Lol","commenter_a":"You mean survivors are contagious for nine months.?","post_message":"Doctors have found that Ebola can linger in some male survivors for up to 9 months."},{"comment_id":"10153051114747550","commenter_b":"I did when I was a teenager! Moms are hot!","commenter_a":"True it's sick but boys that age will bang a mom especially to show off.","post_message":"Mother accused of having sex with minors at her teenage daughter's party--> @webpagelink"},{"comment_id":"611879509002628","commenter_b":"She was already insane!","commenter_a":"Whay too much PIE HOLE. Cuss at me, and your Freedom of speech, goes right out the window!!! Maybe she should resort to plan \"B\". Get a M/F'in JOB!!","post_message":"This welfare leech absolutely lost it when she couldn't get change with her EBT card. How pathetic. You cannot live off the hard work of other people. Are you tired of welfare leeches stealing your money?"},{"comment_id":"10154691100574369","commenter_b":"Stfu","commenter_a":"Stop showing the younger smiling picture of this kid. Get a current picture...and then imagine it behind a gun. I guarantee this kid didn't look so innocent that night.","post_message":""}]
