[{"comment_id":"10152987066401336","commenter_b":"She is a f*&king idiot","commenter_a":"Once again the State Department speaks nonsense. Save your money - don't send your kids to Universities if she is any example of what they are turning out.","post_message":"“This is an insult to all the people in the world who are actually poor and are not blowing people up and not targeting Christians.\"  Laura Ingraham slammed U.S. State Department spokesperson Marie Harf’s suggestion that job opportunities are a way to fight ISIS. @webpagelink"},{"comment_id":"1256741554345872","commenter_b":"Says the guy who looks like Peter griffin....","commenter_a":"So, liberals are proud of the filthy mouthed losers who interrupted good people coming to hear a speaker? Makes sense - birds of a feather flock together and liberals are losers. That is why people who seek to succeed hang around republicans and others who are successful.","post_message":"Watch Donald Trump get interrupted by protesters during his North Carolina rally on Friday. By the end of the night, Trump was heckled 10 different times.  Read full story: @webpagelink"},{"comment_id":"10153255561596350","commenter_b":"She did do it her way.....special lady","commenter_a":"Tomi McCutchen Parrish should write her own obit, one day.","post_message":" pains me to admit it, but apparently, I have passed away. Everyone told me it would happen one day but that's simply not something I wanted to hear, much less experience. Once again I didn't get things my way!"},{"comment_id":"1212963008739156","commenter_b":"Will you force women to wear less since less is \"liberating\"? What gives you the right to choose for anyone? What's next? Fat people can't wear bathing suits? Pretty girls have to wear short skirts? No one... NO ONE has the right to decide what someone wears. Change laws to promote freedom. Let them choose. Don't choose for them. Clothing doesn't oppress any more than guns shoot people. People oppress. Change that.","commenter_a":"It oppresses women. Before everyone says it's s their religion, it was taught to them by a man. And yes all religions use other ways to oppress women that should stop as well. I always find it odd that people champion the right form them to \"choose \" what oppression the want to follow.","post_message":"A new country is debating banning burqas."},{"comment_id":"872932106099872","commenter_b":"Immigrants built this country","commenter_a":"Why can't the homeless get benefits? Or a hostel? but when immigrants come over they get everything at there feet!! How about giving the homeless everything they get and let the immigrants sleep in a fking box!!","post_message":"It has a solar panel to power radio, light and phone"},{"comment_id":"1141182859235076","commenter_b":"I only like woman","commenter_a":"Anyone on this thread that defends the confederate flag or the klan, please kill yourself and do not procreate.","post_message":"\"The Klan today is weak, poorly led, divided internally and without any political support\""},{"comment_id":"1324741860927476","commenter_b":"You need to stop getting your news from the crazy woman on the View!","commenter_a":"No terrorists came out of the 7 countries he banned why doesn't he ban Saudi Arabia where most 911 terrorists were from. Also Egypt and two other countries. Neither was the ban about illegals people with valid visas and green cards were also detained, even the ex prime minister of Norway traveling on a diplomatic passport was detained for questioning..I support Washington states action. The president is not above the LAW .","post_message":"\"We're not going to allow anyone in Washington, D.C. to trample on our rights as Washingtonians, President or otherwise.\" Gov. Jay Inlsee reacts to the judge's ruling to temporarily block President Trump's travel ban. READ MORE >> @webpagelink"}]
