[{"comment_id":"10153507200311336","commenter_b":"Cool end abortion I'll send all the mothers that can't afford to take care of their kids to you.","commenter_a":"Amen! I can't believe people are so desensitized to what is happening all around us. It is our duty as human beings to stand against this, which is actual murder. Abortion is wrong at any point and specifically aborting a baby at 24 weeks, the same time they can live out of the womb is just completely inhumane and murderous.","post_message":"ICYMI: \"Destroying innocent life and harvesting human organs is beyond barbaric -- it is unimaginably immoral, grotesque, and evil,\" writes 2016 presidential contender Gov. Mike Huckabee."},{"comment_id":"940671535979474","commenter_b":"Traci, if you feel that way then please block me.","commenter_a":"The trolls are up and ready. I see no great news for women. No woman should have the right to kill, like no man should have the right to force himself on her. Two wrongs don't make a right.","post_message":"Life begins at conception and it's time the law reflected this obvious truth! Have you signed YOUR petition yet? Click HERE to urge Congress to pass the Life at Conception Act! @webpagelink"},{"comment_id":"812894658799894","commenter_b":"GI, Hillary, go.","commenter_a":"Hillary is a strong woman and won't tolerate any Republican CRAP.","post_message":"This is Hillary in full badass mode. You may not love her, but you should love her passion!"},{"comment_id":"10153290298049087","commenter_b":"You think the people who think that immigrants constitue criminals when in reality they commit less crimes than native born Americans are the smart people? Crossing the border doesn't make you a criminal since in 49 States, crossing the border is a civil issue.","commenter_a":"Donald trump's campaign is all about making America racist again. It isn't coincidental that all of his supporters are idiots.","post_message":"“I’m going to unify. This country is totally divided,” Donald J. Trump said in an interview with CNN's Jake Tapper. “Barack Obama has divided this country unbelievably, and it’s all hatred, what can I tell you, I’ve never seen anything like it. I’m going to unify the country.”"},{"comment_id":"10153212964226336","commenter_b":"Daniel Eskildsen just because this women gave her kid a cookie doesn't mean she fills her kid with junk food.. cookies in my house are a treat to the healthy diets I have my children on..","commenter_a":"Teachers need to worry about teaching and not parenting","post_message":"Cookie crackdown! A preschool teacher sent a note home reprimanding a Colorado mom for packing Oreos in her 5-year-old daughter’s lunch."},{"comment_id":"1060173974080560","commenter_b":"You always do a fantastic job so thank you!","commenter_a":"Thank you for covering","post_message":"Christopher Heath WFTV has a look at the crowds waiting in Orlando for the Donald Trump rally, which is set to start at 4pm. More details here: @webpagelink"},{"comment_id":"10153422515817235","commenter_b":"There are a good number of female cops killing for nothing.. Just look it up.","commenter_a":"Another petulant, controlling, entitled man killing a woman who told him 'no'. I'm really sick of men behaving this way simply because he can't get his own way. Women do not DO this. Why do men?","post_message":"Protecting and serving the hell out of you."}]
