[{"comment_id":"1851253931763489","commenter_b":"You WILL get the thin mints bitch!","commenter_a":"Nathan Williamson","post_message":"Knonk Knock, you want these Semoas?-mo Shop.tacticalshit.com"},{"comment_id":"10153882150921545","commenter_b":"Hahaha. Your an idiot lady!","commenter_a":"appalled by the comments on this article. this was a TEENAGE GIRL who was groomed and manipulated by ISIS agents via social media to leave her family to join them, not some mastermind terrorist who deserves to die. she is as much a victim as anyone else who has been killed by ISIS.","post_message":"ITV News reported Thursday that Sultana is thought to have been killed in May when a Russian warplane dropped a bomb on her accommodation in Raqqa, the de facto capital of the Islamic State"},{"comment_id":"10150542434714999","commenter_b":"She will not be the next president. Do you see unicorns at all?","commenter_a":"Who cares!!! She'll still be President.","post_message":"Special Report: Hillary Rodham Clinton exclusively used a personal email account to conduct government business as secretary of state, State Department officials said, and may have violated federal requirements that officials’ correspondence be retained as part of the agency’s record."},{"comment_id":"10158574220485206","commenter_b":"Ur a racist #sitthefuckdow","commenter_a":"We cannot wait for a Trump presidency. #WeThePeople must rise now & take back America which has been stolen from us!!! Trump touched me a year ago. He reached inside me and touched my heart and built a patriotic fire that flows deep through my veins and has given me hope that we can save America from the elitist New World Order Puppet Masters who would end our freedoms forever God bless Donald Trump!","post_message":"It would be a rare revolt."},{"comment_id":"1184256164945951","commenter_b":"Feminists are the worst lays!!!","commenter_a":"You are lame and you shouting that you're a lesbian is boring. Try something beneficial? Go suck a big one.","post_message":"You can't make this stuff up, folks!"},{"comment_id":"10153735845537144","commenter_b":"The dog having a home is the goal isn't it? This woman didn't know the dog, she might not have liked it. The dog could have hated her. Yeah, the governor had an advantage and the guy's not my favorite. However, this whiny woman sems too needy and I'm not at all sure I would trust her to care for a pet.","commenter_a":"Another entitled old white guy. God how I despise his ilk.","post_message":"What. The. Hell."},{"comment_id":"10154927875454174","commenter_b":"Build that wall","commenter_a":"Protesters now these days are who are dividing the races","post_message":"Protests are happening in cities across the U.S. once again while President Trump is reacting to the judicial order stopping his policy @webpagelink"}]
