[{"comment_id":"10153580091211601","commenter_b":"This Bit*h has a special place reserved for her in hell.","commenter_a":"HELL IS WAITING FOR HER","post_message":"In a Washington Post feature on Planned Parenthood, Cecile Richards, President of the nation’s largest abortion chain, says every abortion restriction in this nation must be challenged and removed."},{"comment_id":"10155678849387004","commenter_b":"GET SOROS- GET SOROS!~ FREE AMERICA!","commenter_a":"This shows you how STUPID people at Berkeley are...","post_message":"In the 1960s, leftists at UC Berkeley fought for their free speech. Now they use violence and mayhem to trample on the rights of others..."},{"comment_id":"10152861814749753","commenter_b":"Same little bitch.","commenter_a":"How utterly sad and horrifying for the bird and it's owners. It is a proven fact that people who will torture and kill animals have no qualms in \"upgrading\" to humans. These kids need deep and immense counseling while sitting behind bars for about 6 to 10 years","post_message":"Police say this 18-year-old high school football player stole the pet emu from a neighbor's pen, tortured the animal, gouged out its eyes and then beat it to death. How should he be punished?"},{"comment_id":"10154015099517885","commenter_b":"So sad i am sure they will love that thight brown hole in prison be a man not a fallower make something of your life","commenter_a":"Then we will finnally get rid of all gang bangers","post_message":"We couldn't make this up even if we tried!"},{"comment_id":"1859080321003763","commenter_b":"@username IDIOT!! No brains!!","commenter_a":"Don't give them the attention they want......they are not America they are not speaking for me!","post_message":"Protesters shut down dc"},{"comment_id":"950475968345485","commenter_b":"she is fuking fat end off...","commenter_a":"I'm sorry, but fat people are NOT hot, sexy, or beautiful. Just ask a obese persons heart how healthy it is.","post_message":"'I want to challenge society's perception of beauty' - Tess Holliday"},{"comment_id":"10155009435559910","commenter_b":"Andre Lopez illegal immigrants can't vote. That's a lie","commenter_a":"lollllll \"won by a large electoral college vote\" he CANNOT let it go that he is the BIGGEST LOSER OF THE POPULAR VOTE EVER.","post_message":"WATCH LIVE: President Trump and Canadian PM Justin Trudeau hold a joint press conference."}]
