[{"comment_id":"10153459278655667","commenter_b":"Instead of talking about it, how about you guys do something about it? No amount of talk will stop someone from raping another.","commenter_a":"This is an incredibly important topic at the University of Pittsburgh. My fellow Pitt classmates are trying to continue the conversation and created this video about the objectification of women on our campus. If you feel strongly about the right to consent and say no, and want to support college students trying to make a difference check this video out: @webpagelink","post_message":"Vice President Joe Biden delivers an incredibly powerful and passionate speech on survivors of domestic abuse and rape at the University of Pittsburgh."},{"comment_id":"10150620952809999","commenter_b":"You people don't get it. Keep sticking your heads in the sand. You focus on what he says and not what Hillary has done","commenter_a":"Dump Trump.","post_message":"The P.G.A. became the first major golf organization to pull an event from one of Donald J. Trump's properties in response to his comments about Mexican immigrants."},{"comment_id":"10153373038333855","commenter_b":"Kill this witch","commenter_a":"She wants every legal consequence possible so she can be a Christian Martyr!","post_message":"BREAKING: Kentucky clerk defies Supreme Court."},{"comment_id":"1171597936185008","commenter_b":"Says the white woman. Lmfao","commenter_a":"It's time for big changes? It's not a change to use racism as a command to get to the top despite our achievements. Jada Pinkett Smith, the talentless half black lady whose name is only known based on the celebrity of her husband. This cause needs a new spokesperson, perhaps a black celebrity with some actual talent worthy of an Oscar.","post_message":"“It’s time for big changes.”"},{"comment_id":"978476018838818","commenter_b":"How can a woman like this evil face.","commenter_a":"Oh for God's sake.","post_message":"PLEASE SHARE: Seattle police have released a photo and have identified the man suspected of setting his girlfriend on fire in South Seattle last night. Police are looking for 62-year-old John Turner >> @webpagelink"},{"comment_id":"10153166532823188","commenter_b":"Women voting for conservatives are the ultimate foolish morons...","commenter_a":"I am a conservative FIRST and there is NO other party to which I can relate...I pray for common sense and decency to prevail but I REFUSE to ALLOW a few bad apples to make me think there is no hope within this party!!","post_message":"It's too late to save it."},{"comment_id":"667821613408417","commenter_b":"She needs to shut her big mouth!","commenter_a":"Moooooooo !!!!!! Eat more chicken !!!!","post_message":"Michelle Obama wants to destroy Halloween for kids across America. There is no chance that we will let her take Halloween away from our kids. Do you think Michelle Obama is a joke?"}]
