[{"comment_id":"986861908039953","commenter_b":"President Obama is the best. Elizabeth Warren should have run for president because she would have been great just like Obama..STOP HATING PEOPLE. Recognize greatness...","commenter_a":"That's just great Thank you Mr President and Elizabeth Warren , your the best !!","post_message":"They are kicking Wall Street's ass!"},{"comment_id":"10153344764512235","commenter_b":"When racists attack children and/or make them cry, it makes me positively homicidal. I have HAD it with these people. What have they done for American society? Hell, what have they done for our SPECIES? Name ONE thing, America.","commenter_a":"The nurse needs to be fired!","post_message":"Wow. Just wow."},{"comment_id":"1373359909354017","commenter_b":"give it time you will see, the failure of these type of woman always is letting their emotions get in between business, you will see","commenter_a":"I think Kellyanne is hot for Trump and he isn't paying attention, or maybe just keeping her hanging see how for he can get her low, how low will she go","post_message":"The people in charge of defining the English language want to remind Kellyanne Conway what the word means."},{"comment_id":"10153943433408645","commenter_b":"She should go to hell for posting this picture on her profile..","commenter_a":"Maybe because she has a horrible profile picture of someone beheading a cop?!....the same photo the shooter in Dallas had on his Facebook....or maybe not....not condoning either act, just responding to the ridiculous lead in of the article...","post_message":"Lanaydra Williams told FOX 4's Megan Dillard she didn't know where Overland Park was before Thursday night, nor did she know the man who made a threatening Facebook post on a picture of her daughter. The stranger was identified as an Overland Park Police Department officer, and the department apologized to her after firing him on Friday."},{"comment_id":"904212379645518","commenter_b":"These thugs and hoodlums should be arrested .","commenter_a":"Thugs","post_message":"He Wasn't Ready!"},{"comment_id":"10153933655437098","commenter_b":"Lol imagine you get off work,headed to your car,next thing you see,a perver having sex with your car lol","commenter_a":"The article doesn't make it clear if he owned the van or not?","post_message":""},{"comment_id":"1330832217009829","commenter_b":"Madoff needs a roomie.","commenter_a":"Lying sack of ----.","post_message":""}]
