[{"comment_id":"10152778117529117","commenter_b":"Don't bother putting on those slippers, Princess. Instead, let's get men to carpet the whole fucking world for you.","commenter_a":"Let's stop men's definition of consent, because all rape laws were designed to help men get away with the crime. Electronic devices on the male penis, if he gets out of control ZAP--- might be effective. Hey if women controlled technology what kind of world would we have?","post_message":"The reality of campus rape cases is more boring than Rolling Stone's story of ritualistic gang rape at UVA: Alcohol abuse is almost always the real culprit, and the problem for which there is an obvious solution."},{"comment_id":"452202411637006","commenter_b":"There here in the us feed them pork to hell with them if they don't want to eat pork go back where they come from keep the. Lunch day she should not of been fired that bull shit vesta","commenter_a":"pork them all!!!!!","post_message":"Lunch Lady Fired For Serving Pork To Muslim Student.  'LIKE' if this is WRONG!!!!!!"},{"comment_id":"728966150600250","commenter_b":"FEMALE ON THE NEST","commenter_a":"Where is the first baby ?","post_message":"WATCH LIVE: We're ringing in the new year with Harriet, M15 and their new eaglet!  We're still waiting for the second egg to hatch!  Where are you joining us from tonight?  WATCH the video of the hatching- @webpagelink Pix provided by Southwest Florida Eagle Cam"},{"comment_id":"10153640202729740","commenter_b":"check the last couple of videos I put up here.","commenter_a":"If cops weren't being abusive, murderous filth, then people wouldn't be this worked up...","post_message":"Protesters were captured on camera yelling \"pigs in a blanket, fry 'em like bacon\"."},{"comment_id":"10155209769476337","commenter_b":"And he destroyed the liberal press...made them look like the fools they are.","commenter_a":"All you hillary sorry pussys get real the Donald is the president deal with it","post_message":"Trump spoke for over an hour, and what an hour it was..."},{"comment_id":"470357549819863","commenter_b":"Another Blind Bitch!!!!!","commenter_a":"Wow. How sad he has really done a lot to get us back on track after what GW bush left him with and am sorry that all these post are being done by redneck asshole","post_message":"How would you define President Obama in one word?"},{"comment_id":"10153396902714270","commenter_b":"There are jobs women cannot do in our military, because they are unable to meet our standards.. (Combat arms) Pretending to be a man would get them in. Unable to meet standards, they would damage our combat effectiveness, ability to adapt, and endanger the mission. That, and people will get killed dragging them along instead of fighting the enemy. IF it is tolerated too long, they will wind up deployed in a combat situation. It will cost lives. Caught unable to meet standards in the rear will cost them a possible career, and they will be processed out. Nothing wrong with that to you?","commenter_a":"Being transgender is not a mental disorder. Both the APA and the AMA agree. Also nearly every single western military in the world allows transgender people to serve openly in the military. Even Israel, a country that has significant treats to their nation allows transgender people to serve openly. Plus there are already 15,000 transgender people serving in the US military right now. Their service should be honored and not conditioned upon whether or not they can keep their gender identity a secret.","post_message":"\"He began to suspect that the military, despite its ban on allowing transgender people to serve, was somehow attracting them at a disproportionately high rate.\""}]
