[{"comment_id":"10153861731493352","commenter_b":"Beat you make ass. Seems like that's what the people in the world needs.. #anasswhipping","commenter_a":"Haha. Wow.","post_message":"Woman frantically calls police after she finds a naked intruder inside her house taking a shower and doing his laundry"},{"comment_id":"10153526527726770","commenter_b":"What a buch of sissys can't block it","commenter_a":"It is this lack of backbone to do the right thing that is causing people to be so angry at the establishment! Stand up and be counted! You might be surprised at the response!","post_message":"A former Delta Force commander,says President Obama is letting terrorists flow across the U.S.-Mexico border --- and that Republicans are too \"paranoid\" to stop it."},{"comment_id":"1711755495764368","commenter_b":"Where all her pussy friends at doeeeee 🤔😂😂","commenter_a":"@username 😂","post_message":""},{"comment_id":"655073504617242","commenter_b":"She will try anything, needs to get a life","commenter_a":"LOONY TUNES HILLARY...........GO HOME BEFORE TREY GETS TO YOU............","post_message":"The Clinton campaign thinks members of the electoral college should receive a national security briefing about Russia's involvement in the election before casting their votes for president.   Is this a good idea, yes or no?"},{"comment_id":"419035241611690","commenter_b":"Ladies, use what ever you want, it is no one elses business","commenter_a":"Idiot !","post_message":"This GOP legislator has invented new female anatomy."},{"comment_id":"10153001581342377","commenter_b":"right CMc and send their illegal babies with them If they weren't made in America they are not American stop giving them birth certificates you just encourage illegals to come here Is this hard to understand??","commenter_a":"It's the law. They are here illegally and, according to the law, they must be deported. Trump didn't make the law. All he's saying is that he would enforce it. The government has no problem enforcing other laws that people disagree with; why should this be any different?","post_message":"Trump's Proposed Deportation Effort..."},{"comment_id":"1015593815224063","commenter_b":"impeach","commenter_a":"WORSE","post_message":"This is BRUTAL. Obama and his Zombies will NOT like this POLL. Which answer did you choose? This deserves 50,000K 'LIKES & SHARES!' @webpagelink"}]
