[{"comment_id":"10153480430267483","commenter_b":"I bet the sissy SOB would have never talked to a man that way.","commenter_a":"More businesses need to be like this. Its 2016 for heaven's sake. No one should be treated less than anyone else.","post_message":"\"Due to privacy laws, we are limited in what we can share, but in a situation in which a customer verbally abuses another customer or a Regions associate, we close that customer's account,\" a Regions Bank spokesperson said."},{"comment_id":"10153475368683984","commenter_b":"What in the hell is wrong with people like her. She should be deported fro America after serving appropriate jail time.","commenter_a":"Big shock.","post_message":"I can't believe THIS is what parents had their children doing while protesting the Texas pool-party incident... Shocking... Do you think what these parents did was outrageous?"},{"comment_id":"1067594940000226","commenter_b":"#DumpTrump","commenter_a":"The ultra right wing justices that have been appointed to the court over the past 5 decades have done more harm then all the republican obstructionism. Obama needs to fill the seat ASAP with someone who will defend Roe v Wade, and keep the EPA on track to clean up our air and water for once and for all.","post_message":"Republican hypocrisy in a nutshell... Thanks to Democratic Underground."},{"comment_id":"434228700035058","commenter_b":"Why so illegal immigrants can collect our money??? I think u should have to prove that you' have worked for 20 yrs or more to collect","commenter_a":"Also give thanks to Bill Clinton who signed the bill making it legal to outsource jobs here.","post_message":"Jeb Bush wants people to work until this age. I'm sure this will raise some eyebrows."},{"comment_id":"472078136250114","commenter_b":"Haha What a bitch","commenter_a":"Good for them. If they don't like prayer they need to leave the activity. To Hell with them.","post_message":"An atheist group complained about prayers at sporting events. This is how the community responded."},{"comment_id":"10156121986485354","commenter_b":"I hope Hillary win cause we need dem stamps","commenter_a":"Since Pelosi has NO integrity then she would not know it and therefore in her little finite mind think Hillary has it, when she doesn't. As a side note, does anyone beside me get physically nauseous and ill when seeing photos of pelosi and hillary???","post_message":"Well this should make everyone feel much better."},{"comment_id":"998702053501364","commenter_b":"Prison. He can still rape again without a tongue.","commenter_a":"Jail the bastard","post_message":"He lost his tongue. Is that punishment enough or should he go to jail as well? [Read below]"}]
