[{"comment_id":"1000663273302101","commenter_b":"Fuck you pig boot licker.","commenter_a":"HAHAHAHAHA. Just because they be black,,,,,,,,you think yo sorry black asses BE safe with Islamists \"protecting\" yo ASSES? HAHAHAHAHA","post_message":"The police thought they were the only alternative for security. They just found out that there are many groups willing to do their jobs for them, for cheaper and with more accountability if they mess up! Do you support this move? Or will their be utter chaos without the police there? Follow >> (Y) Counter Current News for the latest!"},{"comment_id":"10154096088722373","commenter_b":"a monstrous buffoon!!","commenter_a":"I agree Senator! So where have you been while former Presidents, candidates and officials broke the law? President Obama ruled by EO so Trump is picking up where his predessor left off. Just going at it from different direction. We need to get back to changing law via legislative process rather than by fiat.","post_message":"Donald Trump is going to have to learn, in one way or another, the very important truth recently stated by the Attorney General of Washington, Bob Ferguson: \"We are a nation of laws. Not even the president can violate the constitution. No one is above the law, not even the president.\""},{"comment_id":"1387016887980986","commenter_b":"Oh yeah. AMERICANS have to folllow all the rules, but illegals can do just as they damn please. Right? Poppycock.","commenter_a":"Fuck u Cicala !!!","post_message":"Sportscaster on Female Attacked by Democrat Mob: She Was Asking for It by Wearing Trump Jersey!"},{"comment_id":"10153287604604753","commenter_b":"but she took the oath of offce before the Federal government made the ruling.","commenter_a":"She is an Apostolic Christian. According to #17 in the Apostolic Christian Church's Statement of Faith \"Governmental authority is respected and obeyed. Members serve in a non-combatant status in the military. Oaths are not taken, but truth is affirmed.\" With that being said, she violated her religious beliefs when she took the oath of office, and is violating her beliefs again by disobeying the law and court orders. Source: @webpagelink","post_message":"Kim Davis is reportedly unwilling to resign her position at the court until she is permitted to deny marriage licenses to gay couples on the grounds of her sincerely held religious beliefs. This means the clerk is planning to stay behind bars until someone grants her requests. Her lawyer, Mat Staver, spoke to reporters outside Carter County Detention Center on Friday."},{"comment_id":"10153341682339575","commenter_b":"Thank God for careless criminals.This case was able to be solved quickly because of it.","commenter_a":"I hope satan meet this scumbag at the gates of hell RIP beautiful young lady","post_message":"UPDATE: Bloomington Police confirm they have reopened the investigation into the disappearance of Lauren Spierer. This comes after the arrest of Messel in the murder of Hannah Wilson. Police will investigate any links between the two cases."},{"comment_id":"1954618021430775","commenter_b":"It aint over till the fat lady sings,lol","commenter_a":"Mark my words, in future presidential elections, candidates will try to do what Donald Trump is doing.","post_message":""},{"comment_id":"10153801598562042","commenter_b":"God this makes me sooo angry I just want to cry and beat the crap out of her. She is a monster and deserves the death penalty!! Rip Little Angel!! 😢","commenter_a":"And That POS is pregnant again","post_message":"DISTURBING DEATH: A mom allegedly punched her 2-year-old repeatedly in the stomach and the child was found dead the next day. What the mother later admitted to police is horrific ..."}]
