[{"comment_id":"1528246223862069","commenter_b":"@username Pink pussy bow","commenter_a":"I am so glad that someone finally said all of those things directly to her smug, lying, corrupt, evil face!!!! That was awesome! All of us \"deplorables\" wish we could have the opportunity to do exactly the same thing!","post_message":"A notable percentage of voters changed their mind on Trump's attitudes toward women after the latest scandal."},{"comment_id":"10153542250533812","commenter_b":"Chriss if you lease a car. Can anybody come in that vehicle and disrespect you. Chriss you happened to get a job that you get assigned a vehicle can anybody come tell you what and how. You're a smart man. You might get a job that requires you to move out of the state or even the country. That job comes with all expenses paid for four years including the house and the car. You tell me who can come in there and disrespect you. Not even the ceo or cfo of that company can do that without proper protocol. You had to move your family. And your doing your best job. Think about that chriss. YOUR A SMART INTELLIGENT MAN","commenter_a":"Pres. Obama. It is America's house we only let you borrow it for a little bit! Respect all people as you desire to be respected. You are in my house and every legal Americans house. Not that they were right but you are wrong!","post_message":"WATCH: Pres. Obama normally lets hecklers speak, but this time, he put his foot down: \"OK, you know what? No, no, no...\""},{"comment_id":"10154316871838203","commenter_b":"@username Jesus only chose men to be Apostles - but He had many female followers. The reason that women cannot be priests is that the priest acts in the person of Christ in the Mass. If it's a woman offering the Mass the sacrifice becomes one of bride to bride - and the significance is lost. Humans are sensual creatures. God knew that; that's why He created sensual experiments (the Sacraments) as visible signs of His grace. You cannot baptize someone with motor oil because it's not a sign of cleansing. Similarly, you cannot ordain a woman. It is not possible.","commenter_a":"st paul says there is no difference between men and women now that we are in Christ Jesus. there is nothing to suggest that women cannot be ordained priests or deacons from the mouth of Jesus himself. the fact that only men were chosen by him could be due to the fact that the social fabric of his day could not tolerate or make it possible otherwise. the holy spirit will continue to guide the church according to christ's own promise. let's not bar the way forward when we see he is driving along that path. we need to go to the spirit of our faith and not be kept back by men made rules and practices. WE HAVE TO LET THE LORD SPEAK.....AND LET US BE SILENT.","post_message":"The Catholic Church can never ordain women priests, so why all the confusing signals?"},{"comment_id":"10153690719066130","commenter_b":"Andrew Ritchie","commenter_a":"Woof, there are some dumbass people on this feed. The benefits outweigh the risks.","post_message":"This vaccine is drastically reducing HPV cases in teenage girls, but some parents can't get over the stigma."},{"comment_id":"10154969127953128","commenter_b":"@username just another feminist.","commenter_a":"when I go to a show I pay to be entertained , I don't pay to listen to the actors personal views or his GD views on politics.","post_message":"A central part of Donald Trump’s presidential campaign was his use of social media to weigh in on issues surrounding him – large and small – and he did it again on Saturday morning."},{"comment_id":"1419494658112647","commenter_b":"Show your junk to one of my babies and I promise you will sit to pee the rest of your sick life touch one and you will meet your maker and it won't be GOD","commenter_a":"You're one sick son of a b****","post_message":"CNN Believes That Little Girls Should Be Exposed To Male Genitals, Here The DISGUSTING Reason They Are Pushing This!"},{"comment_id":"1548781162079004","commenter_b":"Found the stupid feminist.","commenter_a":"if U want to End ALL Abortions, eliminate the NEED for abortions!! STOP RAPE First!!!","post_message":"Flip the Script is back!  We asked pro-lifers why they think abortion is murder  and then they sorta threatened to kill us."}]
