[{"comment_id":"10156378664500725","commenter_b":"I have an idea. JDLTI. Just don't let them in. When you become President close all immigration for up to five years. We can take care of the terrorists in the Middle East while weeding them out here in the U.S.","commenter_a":"E","post_message":"I keep saying it. When the President of the United States of America, Barack Obama -  will not issue the words RADICAL ISLAMIC TERRORISM - the problem will NOT BE SOLVED!"},{"comment_id":"1164340116952083","commenter_b":"That is the stupidest thing I ever heard. Why don't she give up here ARMED BODYGUARDS.","commenter_a":"Never ever going to happen!!!","post_message":"She must have PTSD from all that sniper fire in Bosnia...."},{"comment_id":"10152723762841545","commenter_b":"WE OCCUPY THEIR COUNTRIES FOR MONEY!!!!!!!! how would you feel if that happened here. we had foreign soliders occupy us for 10 years for the elite to make more money based on lies!","commenter_a":"The more you know liberals","post_message":"Three students from campuses including University of North Texas, University of Texas at Arlington, and at University of Texas at Dallas each reported being the targets of anti-Muslim threats this week."},{"comment_id":"931627590204327","commenter_b":"From Shyann Malone - This is the coldness I experienced when getting into the car this morning! 40 In St. Pete at 3am. Heat on Full Blast!","commenter_a":"Mulberry","post_message":"Brrrrrrrrrrr! This was St. Pete at around 3a.m. this morning.  Who's the coldest in the Bay area? Show us how frigid it is at your location. Snap a pic and post it in the comments below."},{"comment_id":"968788776513933","commenter_b":"Put these bastards in prison","commenter_a":"Jackasses.","post_message":"These people are psychotic."},{"comment_id":"841598805896172","commenter_b":"Ok. And then we Will kill you and take OUR White House back !!!!!!!!","commenter_a":"Nah....he'll invite you in.","post_message":"Who has Obama betrayed the most, us or them? Uh oh...  ~Bandit"},{"comment_id":"10154139052147869","commenter_b":"Yes, she should move to Berkeley!","commenter_a":"Backward looking. When was the last time she looked in a mirror ...","post_message":"Another thing noticed in the Wikileaks release of the full transcripts Hillary Clinton’s paid appearances for Goldman Sachs: she described Republicans as “backward-looking” and fundamentally un-American.”  So in addition to being rednecks (according to Bill), people who don’t support her politically are racists, sexists, homophobes, xenophobes and Islamophobes; a “basket of deplorables” who are backward, irredeemable and fundamentally un-American.    So I have to wonder: why does she want to be the leader of all us horrible people?  If she hates everyone who disagrees with her that much, instead of running for President, why doesn’t she just run for mayor of Berkeley?"}]
