[{"comment_id":"10153456933913132","commenter_b":"Oh my word!!!!! What in the hell?! If you don't want your baby there are plenty of ways to give it up safely! I will never understand women!!","commenter_a":"@username wtf is wrong with people","post_message":"Kimberly Pappas reportedly stored her baby in a drawer after giving birth in a bathroom at work."},{"comment_id":"10153059344826336","commenter_b":"So the point is immigrants \"Mexican\" people aren't here to do harm they just want to make a living","commenter_a":"Immigrants that come to this country isnt because there criminals, there coming to work to help there familys back home or have a better living then what they had in there country, do you see immagrants stealling banks or doing criminal acts?!.... so maybe yall need to stop being so judge mental yall dont know what yall saying its not there falut that the goverment in mexico is so stupid and not helping there ppl so next time STOP criticizing OBAMA he's helping people that only want to work","post_message":"President Obama's executive action on immigration may be helping violent criminals stay within America's borders."},{"comment_id":"571634943014885","commenter_b":"Ya 10 ft wall and make mexico pay for it that wall will never be build","commenter_a":"@username to fucking childish.","post_message":"After vowing to take the high road during his presidential campaign, Marco Rubio changes his stance on making personal attacks against Donald J. Trump. ►Watch last night's full episode: @webpagelink"},{"comment_id":"1128228853905897","commenter_b":"EXECUTE the QUEER ----NOW !!before this poor girl is DEAD from being RAPED by this SUBHUMAN PR*CK !!!","commenter_a":"Discusting pervert","post_message":"DISGUSTING! Muslim Migrant Men Pose with Pre-Teen Non-Muslim Girlfriends on Social Media! Obama wants these perverts in your neighborhood!"},{"comment_id":"938149182885501","commenter_b":"I lived in a place in LA and I'm a clean freak but the apartment on the other side of the wall was dirty people causing me to get roaches. Now I moved outta Florida for one of those reasons. Thankfully I don't see them in Washington state","commenter_a":"Thanks for the report as high as rental apartment are they should have pest control ridiculous!!","post_message":"Imagine opening up every cabinet and drawer, and seeing nothing but roaches... Mark Rivera took the residents' concerns straight to management STORY: @webpagelink"},{"comment_id":"995165647267071","commenter_b":"Ignorant fucking racist bitch","commenter_a":"Today is the first time I listened to his so-called speech, I usually either hit the mute button or change the channel. I sat through his speech and was dumbfounded...The lies were spewing all over the place, he is such a narcissist and egomaniac I could not believe what I was hearing. I hope and pray that Crooked Hillary, the Benghazi Butcher does not get elected because if she does, we are in for four more years of the same!","post_message":"Simple question: Are you happy or unhappy with the way President Obama has responded to the Orlando attack?"},{"comment_id":"10155165703940603","commenter_b":"Whites can't be thugs Danny","commenter_a":"Thug, Keep posting it even if your White or Black. For some reason White people think all Blacks feel as if every Black is innocent. I'm pretty sure Blacks feel as if all Whites think all Whites are innocent. That's not true and if having to state that we think this guy is thug helps then I'll summit to that. I don't think anyone really believes that condoning violence is OK if the person is the same color. People may be right or wrong but it's not necessary a race thing, I think they truly believe the person is innocent but are poorly informed.","post_message":"Robert Clark is wanted for murder and may be hiding in out Missouri. Clark’s accused of brutally killing a couple in Ohio and is also reportedly connected to a string of violent robberies. Please share and call 911 if you see or know anything."}]
