[{"comment_id":"10157640587160615","commenter_b":"#NeverHillary #BustTheDuopoly! She cares nothing for the populance as a whole and her smug haughty stance of needing a public and a private stance politically make me sick. Tack on her criminal past, and right wing agenda, and you bet your ass no progressive should consider voting for that pandering shill. Im done voting for a lesser evil, and will stay vigilant in ensuring a third party gets political funding, and grassroots activism because our system and the Dempublicans are controlled by a criminal elite and they are the enemy of Liberty, Justice and Freedom! #JillStein2016 #GreenNewDeal","commenter_a":"Down","post_message":"This Just In –"},{"comment_id":"10153781983829062","commenter_b":"Yeah!","commenter_a":"Oscar","post_message":"Heads up Ariana, fans... she's coming back to Texas this summer! Did you see her at the rodeo?"},{"comment_id":"10153128310892452","commenter_b":"Go get it. Keep pushing 👍🙏🙏","commenter_a":"People that don't know,.... one word,......Research!!!!! Google it up!","post_message":"Selena Gomez has revealed that she's receiving chemotherapy after being diagnosed with lupus. abc7.la/1P0VU5F"},{"comment_id":"857891860915718","commenter_b":"They need more time to assimilate into our culture,not us to theirs...This is America...illegals should not have a louder voice than our country's citizen,or if they are here legally they need to learn the laws of our land and quit trying to change the American way or American dream to suit their expectations.","commenter_a":"I recommend going back to a country where freedom of speech is not something you have to concern yourself with. Otherwise, deal with it. Freedom of speech means you don't get to dictate consequences just because you don't like it...","post_message":"What do you think about this?"},{"comment_id":"10153533392786337","commenter_b":"You wish you were a woman","commenter_a":"Bruce Jenner has 0 murders. Caitlin has 1","post_message":"MUST SEE MOMENT: Caitlyn Jenner gave a graceful speech while accepting ther Arthur Ashe Courage Award at the ESPY awards..."},{"comment_id":"10153275307228132","commenter_b":"You're a total dick!!!","commenter_a":"Junkie","post_message":"\"So funny, honest and loving. We lost a great one today.\""},{"comment_id":"1107309912667398","commenter_b":"Testing , testing , are you awake America , if not you'd better be soon , ISIS is here an they're not gonna wait for us to realize it , to late is to stupid , time to shake the Muslins up to the fact that we've wasted enough time an lives on there nonsense arrest an deport where needed , tolerate nothing , they want changes send them home an let them change there own countries , leave us alone an we'll leave you alone too .","commenter_a":"@username and trump piss off.","post_message":"Donald J. Trump says there may be more terror attacks across the country because \"we've been weak\" and \"our leaders are...stupid!\" @webpagelink"}]
