[{"comment_id":"10154025018063812","commenter_b":"Haha ahhaha he started a few months early than G! We'll see u there chap!","commenter_a":"@username look at georgie's bf!","post_message":"Prince George attends his first day of nursery school: @webpagelink"},{"comment_id":"10153469031994705","commenter_b":"Everything is wrong with McDonald's.","commenter_a":"Well I love mc donalds There's nothing wrong with mc donalds","post_message":"McDonald's big secret isn't so secret anymore."},{"comment_id":"1169884533107797","commenter_b":"Google William Jennings Bryan or Dixiecrats. Tories and Confederates were conservatives too. Wrong side of history since day one.","commenter_a":"The first black senator and congressman were Republicans :)","post_message":"Only one black woman has ever served in the Senate. Will that change this year?"},{"comment_id":"1197872970239356","commenter_b":"Whites will not destroy their own houses and businesses. Waste of time and money.","commenter_a":"Where is the outrage from Obama on this regarding this racial hate crime? Where are the white rioters?","post_message":"Let's hope that Obama expresses sympathy for the white victims of the #VirginiaShooting and not for the gay black shooter."},{"comment_id":"10153541693114714","commenter_b":"Why is it YOUR business what she does?","commenter_a":"I don't understand why ppl think that it's okay to die \"their own way\". Any way you slice it, that is suicide.","post_message":"\"When I pass, I do not want her to watch me in pain.\""},{"comment_id":"1253889731373943","commenter_b":"Think I saw her speak recently. Speaks volumes about this creep. Shout this from the rooftops","commenter_a":"Julie Stoddard Laxton","post_message":"\"It was shortly that initial workshop that I realized that this was not what they were presenting it to be. This was a scam.\" - Cheryl Lankford, a military widow who attended Trump University"},{"comment_id":"1122225431128139","commenter_b":"@username, but I'm sure you was just fine with the Buch admin. Why is it Republicans always try to impeach every Dem president, I gurantee if Hillary wins they will spend her whole time as president trying to impeach her. Why don't they try doing something for the citizens of this country.","commenter_a":"As I read people's comments, I am again dismayed at the length to which the left will go to deny the FACTS.. the info came form a FOIA request. these arent conspiracy documents....they are FACTS... I know..the left loves to discount facts...they can be pesky......","post_message":""}]
