[{"comment_id":"1058553324165678","commenter_b":"That's it women take everything, soon they'll be complaining about not competing against men in the olympics, #equalityformen","commenter_a":"Yea thats cute... but look at developers these days... 99% are men. you wouldnt be on facebook talking crap right now without men.","post_message":"Margaret Hamilton was the lead flight software designer for Project Apollo. Just 31 when it landed on the moon, and her code has been credited for preventing an abort of the mission.  #womenyoushouldhaveheardof"},{"comment_id":"866625743399544","commenter_b":"Shut up you dumb f*** spread your poison somewhere else","commenter_a":"Ever wonder why it is that for two millenia Christians and then Moslems have pillaged, raped and murdered millions of people in the name of God? Ever wondered why Christians and Moslems, both claiming to own the truth, have no qualms about trying to force others to believe as they do? Holiness is not spread by force, and people that attempt to do so are not holy. Jesus was not a prophet. He was a religious Jew and political activist who was against Roman rule and the political establishment that existed in Judea. Years later his followers rewrote history and invented a religion. Christianity is not divine and it is therefore falsehood. Mohammed was not a prophet. He attempted to gain a following among the Jews, but when he failed he became violent. Mohammed, like his followers, was a murderer, a thief and apparently psycholigically impaired. Islam is not divine ...","post_message":"ISLAMO-REALISM: ISIS Defends Burning Jordanian Pilot: Mohammed Burned People Alive, We  The Footsteps Of Allah Messenger  @webpagelink"},{"comment_id":"10153970648079091","commenter_b":"Just string her up!","commenter_a":"Sick people!","post_message":"UPDATE: New Mexico mom out of hospital, taken to jail after the brutal murder of her 10-year-old daughter in which police say she was injected with meth, raped, killed and dismembered."},{"comment_id":"10154490094079342","commenter_b":"@username so it's okay for a woman to put her hands on a man and act like a man but the second she get treated like a man she wanna cry and say, \"I'm a girl!\" FOH! Keep your hands to yourself. Period!","commenter_a":"Kindergarten lesson, first rule. Keep your hands to yourself.","post_message":"The video shows the woman shove Mixon, then he punches her in the face."},{"comment_id":"1592257357455136","commenter_b":"Ew. That girl is a cow","commenter_a":"Soar losers. Get over it.","post_message":"Anti-Trump protesters are outside Trump Hotel in D.C. They've been marching for two hours now.  More about road closures or traffic in D.C.: @webpagelink"},{"comment_id":"838126822975658","commenter_b":"I think it is very interesting when you look closely at all the photos of the refugees....you men, military age. ISIS? Muslim Extremists? Frightening to say the least.","commenter_a":"It is with glee and satisfaction i'm watching Europe's descent ito Islamic morass.They want to replace 6 million killed Jews with 40 million Arabs. Europe's punishment is Islam.","post_message":"\"Generous welcome by Germany created a strong magnet to bring millions of migrants from Asia and Africa to Europe.  This is sheer madness and it is dangerous,\" says Daniel Grynglas."},{"comment_id":"1161811247205145","commenter_b":"Lock her up","commenter_a":"\"LOCK HER UP\"FOR SURE!!!","post_message":""}]
