[{"comment_id":"10153479887206037","commenter_b":"There are no grounds to deny 3 women, 4 men or any number imaginable from acquiring a marriage license. Where does the number 2 come from?","commenter_a":"Good job supreme court! Whether you agree or disagree with same sex couples it is not our right to judge them. It is nobody on this earths right to judge anyone. May all same sex couples find happiness","post_message":"Follow our live blog for all the latest updates on the U.S. Supreme Court's #MarriageEquality decision."},{"comment_id":"10153779431271178","commenter_b":"Go away far away Whoopie aka Karen !","commenter_a":"Just keep diggin your hole, eventually you will all fall in!","post_message":"Actually, there is...and it's a big one."},{"comment_id":"1875772702705471","commenter_b":"These hoes aint loyal","commenter_a":"@username 😴","post_message":"So messed up  #WSHH"},{"comment_id":"1382199778464035","commenter_b":"Your a bitch","commenter_a":"I'm sure the First Sasquatch offered so much advice, what did she do...come to the defense of her brother Harambe?","post_message":"First Lady Obama took apart Trump, and just gave Republicans even more to worry about."},{"comment_id":"10153299722707434","commenter_b":"I thought women hated dick pics. ;-)","commenter_a":"Huh. Where are the usual people who attack women for not being cautious enough? If you don't want to have problems, just don't take naked pictures. How dare this guy not take proper precautions around a woman? How dare he get unconscious? Girls will be girls, you know.","post_message":"Compounding an already criminally terrible idea, she sent the photo and video to her coworkers."},{"comment_id":"922771304482591","commenter_b":"We all wish we could return your white asses back.","commenter_a":"Damn the ignorant white man - HisStory - his Eurocentric propaganda BS taught in public education and he can't even remember his own fucking history. Beyond head up the ass!","post_message":"Not only are they hypocritical, they are also ignorant of history."},{"comment_id":"10153669606379060","commenter_b":"@username - my point is that Germany is too influenced by its past, too ready to apologize for its past. In the 90s, the extreme right-wing Republikaner and the DVU gained in support because of this blind open-door policy. What is more, Germany expects other EU countries to do the same, irrespective of the cost. I say that this has to stop.","commenter_a":"The Germans typically let in loads of war refugees. More than they can handle. It's their way of apologising for World Wars 1 and 2. In the 90s, they let in 320,000 war refugees from Yugoslavia. What happened in German towns ? Property rents skyrocketed and the crime rates went right up. What's worse, the Germans expect every other country to do the same. Whacky open-door immigration. The UK needs to leave the EU, get sovereignty over its borders and immigration / refugee legisation back and tackle the problem as a single nation. This time, the Germans are letting in 800,000 war refugees from Syria. Absolutely crazy.","post_message":"Ever since Angela Merkel took the lead on the migrant crisis, critics began speaking as though she created it. This is nonsense"}]
