[{"comment_id":"10153239564994369","commenter_b":"when you can't beat them, copy them!","commenter_a":"Made in china","post_message":"This is Samsung's newest phone"},{"comment_id":"10153188794046680","commenter_b":"And @username get that male organ out of your mouth.","commenter_a":"@username just how would have more gun control laws have prevented this last shooting? California has already the most stringent gun control laws on the books.","post_message":"A day after the shooting massacre in California, Republican presidential contenders were utterly unapologetic about their opposition to new gun-control laws."},{"comment_id":"10153240848239087","commenter_b":"So he's trying to hold her accountable.... I think more people need to keep asking the ignored questions...","commenter_a":"I have never seen a grown man act that ridiculous in a public setting. Fucking pussy.","post_message":"Rep. Jim Jordan, chairman of the House Freedom Caucus, got into a heated shouting match with Planned Parenthood president Cecile Richards during today's House Oversight Committee hearing into the nonprofit's use of federal funds. WATCH:"},{"comment_id":"116808422164651","commenter_b":"Illegal immigration must first be brought under control. Only then can we regulate all immigration and I doing do Skylake washes to naturally as the flood of cheap labor is ended.","commenter_a":"END THE DRUGS COMING IN US ! WE'RE IN BIG TROUBLE WITH DRUG ADDICTION","post_message":"BORDER WALL: President Donald J. Trump is expected to sign an executive action today to jump start construction of the border wall that he promised would be built during his campaign. MORE: @webpagelink"},{"comment_id":"10154099164360329","commenter_b":"DREAM HUBS","commenter_a":"@username your future hubby","post_message":"He never even read the books, but he researched them and made all the magical decorations himself. Read more: @webpagelink"},{"comment_id":"595246650649268","commenter_b":"You're not a woman... so we don't expect you to get it...","commenter_a":"what brand of dope is she smoking? Seems to be effective in blocking reality","post_message":"\"I think [Trump] would be very good for women’s issues.\" - Caitlyn Jenner"},{"comment_id":"10153910838991336","commenter_b":"And slap her face!","commenter_a":"Bless her heart...","post_message":"Carly Fiorina says tech companies need to be asked “to bring the best and brightest, the most recent technology to the table.” #GOPDebate"}]
