[{"comment_id":"10153078064342994","commenter_b":"we're on that list so maybe. I NEED TO FLUSH SOME ICE","commenter_a":"Alexis Nichole Fortune hoping we close. 😩","post_message":"Our site has the complete list of school closings. Stay warm out there!"},{"comment_id":"707413306095459","commenter_b":"She have a bird on her head?","commenter_a":"Illegal people","post_message":"LIVE NOW: The Phoenix City Council is talking about a proposal that will designate the city as a Sanctuary City. STORY: @webpagelink"},{"comment_id":"10154552857806955","commenter_b":"How is Hillary performing vs. Obama?","commenter_a":"This is it America. This is our last chance, the alternatives are most unsettling.","post_message":"FLORIDA SHOCK: TRUMP OUTPERFORMS ROMNEY BY 130,000 IN EARLY VOTING!"},{"comment_id":"618479561657305","commenter_b":"You should really pay a visit to area 51 theres aliens there","commenter_a":"Why didn't you bring up in your speech how the people at the Bataclan were tortured and videotaped before being murdered - oh and that it was hidden by the media...","post_message":"Hillary Clinton will increase Syrian refugees by 550% without a realistic screening process."},{"comment_id":"10154408917183797","commenter_b":"How big is that wall going to be? Lol","commenter_a":"This is why I can't wait for Trump being elected and building a giant wall!!!","post_message":"FLIGHTS TO CUBA: U.S. officials say the United States and Cuba will sign an agreement next week to restart commercial air traffic for the first time in five decades."},{"comment_id":"1156989694324963","commenter_b":"Fuk that NIG GERR BITCH","commenter_a":"SHE IS A HORRIBLE HUMAN PERIOD","post_message":"Michelle Obama Banned Valentines Day In Schools She can't take love away from America's children. Do you think she is a horrible first lady?"},{"comment_id":"10156555816055354","commenter_b":"A radical muslim wants to kill you. A moderate muslim wants a radical muslim to kill you.","commenter_a":"Wake up and smell the coffee.","post_message":"This is what we're up against, gang..."}]
