[{"comment_id":"10153548977449607","commenter_b":"she wants to get out before all hell brakes loose LMAO","commenter_a":"let her travel who cares","post_message":"Some local activists are shaking their heads over the Mayor's plans to travel out of the country next week, on the one year anniversary of Freddie Gray's arrest."},{"comment_id":"10153486843809091","commenter_b":"I hope his whole family is murdered in front of him","commenter_a":"Good!!!!","post_message":"JUST IN: A teen  from Paterson who was involved in a 'knockout game' attack posted to social media has turned himself into police. --> @webpagelink"},{"comment_id":"754838434706734","commenter_b":"Oh God, the taxes, the illegals working for him, the handicap man with evil intentions, and now a rape! Next anything against Mr. Trump, please, lol Your evil would not be able to destroy Mr. Trump! Don't waste your time!","commenter_a":"Wtf ever stop grasping","post_message":"BREAKING: Trump Engulfed In MASSIVE Rape Scandal   This could end his campaign right now. Let's show our support.  Can we get 30,000 'LIKES' for Donald Trump?"},{"comment_id":"500328103497004","commenter_b":"'@username your mom is another uninformed voter. Now I'm voting for Trump just so you and your mom get hassled by immigration.","commenter_a":"Let me get this straight. Trump can beat Hillary, but he can't beat Bernie? So by voting for Hillary...you're basically voting for Trump?","post_message":"Is Bernie Sanders harming Hillary Clinton's chances against Donald J. Trump? Here's what he has to say about it. via Today Show"},{"comment_id":"10154091101902042","commenter_b":"Sarcasm at its finest, they should've pulled their pants up!","commenter_a":"All white guys I see","post_message":"THIS CRAZY BURGLARY! These burglars rammed a car through the gated front door of an Indianapolis clothing shop, and then about a dozen spilled in and grabbed whatever they could. It was all caught on tape. More details: @webpagelink"},{"comment_id":"10156327027695389","commenter_b":"Cuff the lying witch already.","commenter_a":"Sounds like a recommendation for an Indictment may be in the new future. If the DOJ rejects it.....Will their be alot of resignations from the FBI??","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10152677348991523","commenter_b":"I wasnt there but innocent until proven guilty and its always a bunch of white women","commenter_a":"They are liars. Every time these women have a press conference, I've noticed while they're speaking they have to keep looking down at their notes. Their statements should freely flow out of their mouths if it was true.","post_message":"Phylicia Rashad says she was misquoted on Bill Cosby, and sets the record straight."}]
