[{"comment_id":"2071257249766331","commenter_b":"Only American enemies would want to remove it!","commenter_a":"Like","post_message":"There is no reason whatsoever that justifies removing this picture. Can we get 5,000 'LIKES' to keep it in the Museum?"},{"comment_id":"1003361709753187","commenter_b":"Coming from someone who puts stupid cartoons of her self on Facebook! Lol. Maybe Leslie could get a brain in the next one and give up on Hillary!","commenter_a":"When trump gets elected maybe this bug eyed freak will leave and take his high girlish voice with him","post_message":"*Shivers*"},{"comment_id":"946644428709749","commenter_b":"Wow seriously? Talking about reading too much into something. It is a cartoon meant for entertainment. Good grieft! You know where I got my sense of womanism from? My MOTHER! Yep, that is who shaped who I am.","commenter_a":"Missed the most important point fat, ambitious women are evil, unnaturally thin submissive and child-like women are good.","post_message":"Not only is this hilarious, but it is *so* on point. Kudos, ScreenJunkies.com."},{"comment_id":"10154264763012452","commenter_b":"You aren't immigrants, you're illegal aliens. What idiot feed you the line you belong here? Oh yeah, ofailma and Jerry Brown. Remember, when you break into my house, it doesn't make you part of the family it will make you leave on a stretcher.","commenter_a":"And no one missed any of them 😂","post_message":"Immigrants skipped out of shopping and stayed home from work and school as part of \"A Day Without Immigrants\" protests that happened across the nation.  Businesses in Los Angeles closed in support of the protests, which were a response to President Donald Trump's immigration agenda."},{"comment_id":"709650085834839","commenter_b":"Exactly why I pointed it. Most like her, only dodge and deflect.","commenter_a":"This is not even true and amounts to propaganda plain and simple. And of course this is coming from Florida where an election was rigged. Why don't you educate your fellow man instead of scaring them and filling their tiny little minds with this ignorance; there are so many untruths in this article, number one being the use of the term \"body parts\". Since the majority of abortions are performed at the 12 week mark, these are embryos with no body parts to speak of. There are no videos that show any of this yet that is the main point of your argument. Second, fetal tissue is donated to medical research which is legal and most republicans voted it in (look up fetal tissue for medical research law) and had been, most recently, used very successfully in the treatment of Parkinson's disease. Since most conservatives don't believe in welfare, Planned ...","post_message":"I Freaking KNEW it."},{"comment_id":"1738783449718030","commenter_b":"Lmfaoooo she's just so fed up","commenter_a":"The teacher at 52 seconds hung her head low like \"these mfs here \" Ty1253184741396567","post_message":"Move over, #MannequinChallenge. The #TrumpsComingChallenge is sending students fleeing @webpagelink"},{"comment_id":"10153367212549726","commenter_b":"She sooooo bland and stale ,why do we need her we got republicans doing a job her way and she be wearing depends .she needs to goto prison .","commenter_a":"Why do so many morons approve of this idiot?","post_message":"WATCH: Majority of Americans Don't Find Hillary Clinton Honest and Trustworthy"}]
