[{"comment_id":"404253609734988","commenter_b":"FEDERAL LAW says they shouldn't be here","commenter_a":"Sheriff Joe should deport himself.","post_message":"Judge blocks sheriff Arpaio's workplace raids of undocumented workers"},{"comment_id":"576179842587911","commenter_b":"Sad. But, Karma is a real bitch...","commenter_a":"No matter how you cut it it's tragic, but in regards to Mr. Harmon's vote against firearms training it calls to mind the expression that there none so blind that do not see.","post_message":"In 2013, he attacked proposed legislation in Maine that would have required gun owners to take a firearms safety course ..."},{"comment_id":"903185543037635","commenter_b":"Noooo... lol. You gals need to stop. Many African men have monster sized d****. That mess ain't fun.","commenter_a":"She's ungrateful","post_message":"Apparently, she didn't see it until after the wedding..."},{"comment_id":"1089895574436829","commenter_b":"Instead of running for president she should be running from prison","commenter_a":"If you're under 50 you really need to read this. If you’re over 50, you lived through it, so share it with those under 50. Amazing to me how much I had forgotten! When Bill Clinton was president, he allowed Hillary to assume authority over a health care reform. Even after threats and intimidation, she couldn’t even get a vote in a democratic controlled congress. This fiasco cost the American taxpayers about $13 million in cost for studies, promotion, and other efforts. Then President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were Zoe Baird and Kimba Wood – both were forced to withdraw their names from consideration. Next she chose Janet Reno – husband Bill described her selection as “my worst mistake.” Some may not remember that Reno made the decision to gas David Koresh and the Branch Davidian religious sect in Waco, ...","post_message":"The numbers don't lie... but Republicans definitely do.  Thanks to Armed Democrats."},{"comment_id":"1022105807844423","commenter_b":"'@username Mexico can barely afford to do anything for it self what makes you think it's going to pay for a damn wall? Because let's think about this..America is scared you are living in fear. Last time I checked Toddlers kill more people with guns per year in the USA than Terrorists do.","commenter_a":"As soon as #DonaldTrump builds the wall, Hillary needs to be tossed up and over the wall into Mexico!! #Trump","post_message":"Making public colleges and universities tuition-free is not unrealistic. It's necessary. — Sara Goldrick-Rab"},{"comment_id":"10154450153734411","commenter_b":"'@username Is there a government on this planet that is not - up to no good - ?","commenter_a":"Why are they bombing their own airport... ISIS Turks are weird","post_message":"BREAKING - #ATATURK #BLASTS:  - at least 50 dead - about 60 wounded - 2 explosions"},{"comment_id":"10152922830971491","commenter_b":"'@username, you killed my sides.","commenter_a":"So many hateful comments. Why?!","post_message":"“God chose us to take care of these babies.”"}]
