[{"comment_id":"10153625105923128","commenter_b":"Stop bring toilet in every issue","commenter_a":"India should stop releasing Indian Movies in Pakistan long ago ..i don't knw why still they didn't do that","post_message":"Here's why an alleged Pakistani terror group wants a ban on an Indian movie."},{"comment_id":"10157147438325354","commenter_b":"Mariah, pull your panties out of your crack.","commenter_a":"LOL Calvin Klein clothing. Made for dainty feminine pajama boys with no shoulders and 24\" waists.","post_message":"Kendall Jenner, the lurid Calvin Klein PHOTOS, and the major PR backlash..."},{"comment_id":"736942216449300","commenter_b":"The most logical way to deal with the Real ID Act is to stop rewarding illegal activities. The people that make it possible for illegals to get driver's license are the same people who refuse to correct the laws that allow career criminals to run the streets killing cops and our children.","commenter_a":"How about we stop issuing drivers licenses to people that have broken the law and are here illegally? Blaming the current governor for this is absolute stupidity. Blame Richardson and the democrats in Santa Fe, this is all on them!","post_message":"The most logical way to comply with the REAL ID law is for the Governor to agree to a bipartisan plan for a two-tier driver’s license in New Mexico. Republicans and Democrats in the state Senate crafted a compromise last session that would have resolved this issue. The Governor should agree to that compromise. This will address concerns about public safety, meet the requirements of the REAL ID law, and assure that New Mexicans can continue to access federal facilities and airports. @webpagelink"},{"comment_id":"1421316697902078","commenter_b":"Then go away Monica!","commenter_a":"I think both ladies look great. Love the pink dress and wish I had the shape to wear the red one.","post_message":"LIVE VIDEO: Watch as various entertainers perform at the Inaugural Ball before the arrival of President Donald Trump. @webpagelink"},{"comment_id":"10153070699666028","commenter_b":"Cuz ur DUMB","commenter_a":"No vote here !!!!","post_message":"\"I have a great relationship with the Mexican people\": Donald Trump tells NBC in an interview that \"there's nothing to apologize for\" regarding his comments made about Mexican immigrants last month. He says he believes he will win the Latino vote. \"I will create jobs and the Latinos will have jobs that they don't have right now. And I will win that vote.\" @webpagelink"},{"comment_id":"1144542405568548","commenter_b":"@username bull","commenter_a":"Hilary should start a new centrist party for disenfranchised republicans, and the DNC should back Bernie. He stands for unions, while she slept thru Walmart union negotiations and stayed mute. He marched and protested for civil liberties while she was a Goldwater Girl. And the Clintons made shady insider trading deals with Tyson way back in the day to kick start their career. The only thing that makes her a democrat is her stance on women's issues. When it comes to war, trade agreements, corporate welfare, and dark money, she's a republican.","post_message":"\"That's what the American people are saying.\""},{"comment_id":"10152942027790399","commenter_b":"There is a word for women like her, but that would be an insult to hard working girls.","commenter_a":"That certainly says everything about her credibility, or lack thereof. :( AKA (I'll say anything for a buck)","post_message":"Megyn Kelly on msnbc: \"I’d have done O.K. there, too.”"}]
