[{"comment_id":"1011579805549158","commenter_b":"Just wait til that fat bitch is refused her insulin because her fat, meat eating ass offends a pharmacists sincerely held religious beliefs.","commenter_a":"Think that woman having a dead fetus inside of her would have been a bigger problem. that can lead to a serious infection. the drugs she was prescribed was not to induce an abortion but to remove a fetus which had already died","post_message":"Straight, white Christian men run the world and they don't care who they have to hurt so that doesn't change."},{"comment_id":"10153292946061509","commenter_b":"obama is a standerd POS ! muslim bstrd","commenter_a":"This is asinine. Why would he do this, yet absolutely refuse to meet with Benjamin Netanyahu??","post_message":"There were some hard-hitting questions about drones, college education and racial profiling. But he gets those all the time. Let's focus on the weird: @webpagelink"},{"comment_id":"10153188976024087","commenter_b":"Ethyl Rosenberg did less and thy fried her in the electric chair!","commenter_a":"Go Hillary , ignore the naysayers , they don't even have a real scandal , crime or violation , ignore the fake media , stay focused on the real issues that Americans truly care about","post_message":"Senior aides to Hillary Clinton will meet with Democratic lawmakers at the Democratic National Committee offices on Thursday to discuss messaging and strategy as the presumptive front-runner's numbers continue to fall."},{"comment_id":"10153635316283812","commenter_b":"\"It's Just Lunch\" was already taken...","commenter_a":"The name is stupid....Couldn't come up with something a little more interesting!??","post_message":"Earlier this year, the Kang sisters, co-founders of the dating app \"Coffee Meets Bagel,\" turned down a $30 million \"Shark Tank\" investment offer. Here's what they have been up to since the show, and where their app is changing online dating: @webpagelink"},{"comment_id":"10153301288059411","commenter_b":"Yeh the Danish who's having sex with dogs are Muslims too. Many US states still legalize animal sex until today. Bow down to your ziojew masters and shag some horses","commenter_a":"Jews been making porno videos using American girls and animals ( dogs, horses) for centuries now. Disgusting vermin","post_message":"No more animal brothels"},{"comment_id":"1567244033571398","commenter_b":"Good and take all those bitches from the View.","commenter_a":"Move. That will even make America Greater.","post_message":"ClashDaily.com"},{"comment_id":"10154902832777235","commenter_b":"Fuck that old bitch. She has probably done the same shit a million times.","commenter_a":"She came from pigselvania, lol","post_message":"This jolly little elf of a person is just brimming over with holiday cheer!"}]
