[{"comment_id":"10154472139428271","commenter_b":"@username always cleared denotes nothing about guilt .","commenter_a":"I don't care how it happens the cops will always be cleared until we say no more.","post_message":"His mom called police because she knew he was in trouble. But minutes later her son was dead. The DA has cleared the officer involved in the shooting because the suspect had reached another officer's gun and fired a shot."},{"comment_id":"10153866620387869","commenter_b":"Leave, sissy boy.","commenter_a":"I like @username but I get the impression this is just a propaganda page. Guess I'm out of here.","post_message":""},{"comment_id":"1784144245187941","commenter_b":"Oh shut up!","commenter_a":"If African Americans don't understand that they're being exploited and used for their votes by this woman, well then they'll get what they deserve after they elect her, a lot of nothing! So sad to see them falling for this. She's using a black rapper to pull in votes, amongst other things. Using a group of people for a vote is so wrong, nothing more. She's disgusting to do this.","post_message":"Hillary Clinton quotes Jay-Z during Cleveland rally: “Rosa Parks sat so Martin Luther could walk, and Martin Luther walked so Barack Obama could run, and Barack Obama ran so all the children could fly.” Read more here: @webpagelink"},{"comment_id":"10152874216906336","commenter_b":"Were the idiots of man that let these people in the country there should be bought to trail as well","commenter_a":"When will we as a human race stand up to the immoral acts of the few. Doesn't matter where your from. We need to stand together to eradicate scum..","post_message":"PHOTO OF THE DAY: Hundreds of thousands of people marched in solidarity across France Saturday to denounce this week’s terror attacks in Paris and to honor the victims."},{"comment_id":"10153303118249203","commenter_b":"Beauty.","commenter_a":"That was an awesome episode!","post_message":"John Oliver made NSA whistleblower Edward Snowden crack on Last Week Tonight with John Oliver during a surprisingly contentious interview."},{"comment_id":"565976566923900","commenter_b":"She is a serial killer.","commenter_a":"They could prove that she was a serial killer and they wouldn't care","post_message":"Here we go..."},{"comment_id":"10154233668643132","commenter_b":"Michelle Lena Butler idiots on both sides.","commenter_a":"Why is a 50 year old and a 47 year old trying to even reproduce? Can their be laws against that please?","post_message":"\"I can't afford Melissa's doctor visits . . . I don't think I can afford the babies, so I just want to abort all three babies.\""}]
