[{"comment_id":"10153686038898984","commenter_b":"DO NOT PASS GO....DO NOT COLLECT ANY MORE OF OUR MONEY......GO DIRECTLY TO JAIL....GITMO.......HOPEFULLY....barack HUSSEIN ......WILL FOLLOW !!!!","commenter_a":"YES!","post_message":"Wow. It looks like winning the presidency is about to become the last thing on Hillary's mind... Do you think Hillary should be indicted?"},{"comment_id":"10153053080376336","commenter_b":"She should have been thrown put on her fat a**.","commenter_a":"How about firing the witch for inappropriate behavior toward our Veterans! She's disgusting!","post_message":"\"Had she been a veteran herself or served in the military, she would probably have a different thought on how she treats our veterans.\" The Veterans Affairs manager in Indiana who mocked her patients’ mental health has been placed on paid administrative leave."},{"comment_id":"851989354991641","commenter_b":"This is America period,,,all states should ban immediately!","commenter_a":"KEep IT UP","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"1444717595538546","commenter_b":"It not over until it get to the highest court! Just hope we don't allow this time to allow the bad guys get something in the USA! It will not be the rights fault! But as always the left will blame the right, anyway! :(","commenter_a":"This is why America is in this shape, getting a president that would actually work toward putting Americans first is/will be thwarted at every turn.....","post_message":"Appeals court denies DOJ's request to reinstate travel ban"},{"comment_id":"10154461137273162","commenter_b":"@username is clearly an anthropological & archaeological authority on the issue of Jewish history. Oh, and he was apparently elected to be the Arbiter of Jewish Identity, seeing as he now has the right to decide which Jews belong where","commenter_a":"I'm sorry Bibi - you know bunch of us real Americans LOVE you !!","post_message":"Now he’s “Boo Boo!” Netanyahu! The Israeli Prime Minister Benjamin aka “Bibi” Netanyahu received a chorus of boos from the most American of audiences: New Yorkers who paid exorbitant sums to see the ever sold out smash hit “Hamilton.”"},{"comment_id":"10152783958260667","commenter_b":"You need to wake up lady !","commenter_a":"They are not public property. They are her private emails. You are all so crazy about your rights but not anyone else's. They were on a private server that had more security than her work emails. You need to take a cold shower.","post_message":"Looks like those who want a look at Hillary Clinton's emails have a long wait ahead of them."},{"comment_id":"10152670705340671","commenter_b":"Glad she was able to fight him off but lets be smart about it ladies.","commenter_a":"What was she doing jogging in the dark at 5 am in the morning. I am not condoining she got attack. But account for ones own safety is what I am saying.","post_message":"The woman was able to fight the attacker off, police say."}]
