[{"comment_id":"337708566573297","commenter_b":"Trimp for president......HOW SCARY IS THST IDEA !!","commenter_a":"Vi a una persona que se preparo para el debate asi como se ha preparado para ser presidenta del pais. Por otro lado vi a un empresario que oculta sus deudas, que ha hecho su fortuna estafando a mucha gente.","post_message":"Donald J. Trump says he did President Obama a favor by being racist."},{"comment_id":"10153697360054091","commenter_b":"Relax...pretty sure she won't get a welcoming party in jail...LOL","commenter_a":"Really? So now taxpayers get to pay to house her, feed her, clothe her, get her medical attention when needed. Who wins? This woman should just be drawn and quartered after a long term of suffering torture. A mind like hers should never be able to influence others in prison. Maybe they will put her in a dark place alone and forget about her.","post_message":"A Colorado judge sentenced the woman who cut a baby from a stranger womb to a century behind bars."},{"comment_id":"1704157759871336","commenter_b":"Hate the show.Bitchy women!!","commenter_a":"Let's hope so","post_message":"The View makes me SICK.   Take Joy Behar off the air NOW!"},{"comment_id":"10154363651421323","commenter_b":"Irony? He hasn't been right wing, he's been a German-Iranian guy.","commenter_a":"Irony A German born rightwing neo-nazi shots up the place wanting foreigners to get out! Online echo chamber immediately call him an Islamic terrorist immigrant","post_message":"The situation in Munich is still developing. This is what we know so far about the shooting."},{"comment_id":"10153548365891350","commenter_b":"You girls are so funny I love how jealous women can be towards each other. GET OVER IT! there are lots of work out clothes like this. Just cause YOUR ASs can't fit in it doesn't mean everyone else that looks good in this type of workout clothes has to stop wearing them! Jealouse? Shut up bitch go run in the treadmill then!!!!","commenter_a":"What's the issue...? Some moms look like this, some are chunky. I had a very nice body after my first son, trying to get back to that now after having my second. There's nothing offensive about this at all, some women are just bitter and resentful.","post_message":"This was probably not the reaction Bugaboo was expecting..."},{"comment_id":"1594945114129629","commenter_b":"This woman is a freaken joke. Go Trump","commenter_a":"Demonrats-deliver Detroit, Flint, Toledo, Baltimore, Newark and ghetto's !!! aLL THE TIME 100% OF THE TIME, every time suckers !!!!","post_message":"Democratic presidential candidate Hillary Clinton took aim at Republican rivals saying she is looking forward to debating with them about the economy if she becomes the Democratic nominee."},{"comment_id":"10153461070784614","commenter_b":"Yup they should FRY !!! Not next week not next year but NOW !! Those are extremely sick people who can do that and don't deserve to breathe air .","commenter_a":"Sick. There are really some evil people in this world. God rest his soul","post_message":"A good Samaritan who offered his help as an AA sponsor was lured to a downtown L.A. hotel by a couple for the purpose of fulfilling \"long-held fantasy\" of dismembering a body, prosecutors say.  Edward Garcia was convicted of murder Tuesday in the torture and dismemberment death of Herbert Tracy White.  Prosecutors say Garcia carved up White's body with a 3 1/2-inch blade and dissected and sliced a piece of leg muscle from the bone.  Hotel employees found White's severed arms and a backpack full of flesh in the room. Under the blood-soaked bed was White's torso riddled with scratches and small punctures.  \"It was a bloodbath,\" prosecutor John McKinney said. \"They took this man apart.\"  Read KTLA's story here: @webpagelink"}]
