[{"comment_id":"10154303006941636","commenter_b":"Ted I'm pretty sure that the home grown rapist far out weighs the immigrant/refugee rapist...all you people blaming all crime on immigrants and refugees must have been living in lala land cos I can't speak for Sweden but all of those crimes were in the U.K. Way before this flood of people hit britains shores","commenter_a":"Nothing to do with wanting their sovereignty back and not being dictated to by unelected EU bureaucrats? Good grief, this page is a shocker!","post_message":"According to a new study"},{"comment_id":"10153712165499138","commenter_b":"I'm not a hunter, however, anyone who eats meat has no right to be against hunting your own meat. At least the animals being hunted have a chance and have a good life in the wild. Anyone who eats grocery store meat should try going to the farm that the meat came from, those animals have it far worse than a dear dying from a quick shot.","commenter_a":"Stop this hunting that's what he gets","post_message":"A reminder worth sharing. Have a safe hunting season."},{"comment_id":"10153963007189160","commenter_b":"@username: Michelle Obama is not an entitled wife she is just an ordinary male in women's clothing. GO TRUMP GO!!!!! America is the land that I love.","commenter_a":"Finally now the truth starts to come out. Hopefully Obama cannot put the spin on this now. Hillary for jail with the rest of her crooked family and Obama and his family also. Especially his entitled wife.","post_message":"Wikileaks is out with more than 1,200 emails from Hillary Clinton's private inbox."},{"comment_id":"10154732145028690","commenter_b":"@username he will never be found guilty of those accusations. He's too powerful. That family is too powerful. And when it's the word of the victim against the word of the powerful accused, especially in cases of rape and sexual assault, we all know the public will side with the powerful beloved, charming, charismatic Bill. Especially when his wife is about to win a historic election. This speaks volumes about the rape culture in this country. This is the same story played across this country everyday. This is why so many women remain silent. As someone who values national security and the reputation and values of this country, I can't in good conscience vote for either of these abhorrent people. Trump is the orange muppet love child of Ford Fairlaine and Biff from Back to the Future, and the Clintons are the example of a powerful enterprise who represents ultimate ...","commenter_a":"Bill Clinton isn't up for election, that argument is lame and dead as some are trying to compare these events. What Trump said amounts to sexual assault...\"you grab them by the pu***.\" Trump has been accused many times of sexual assault and rape, with the latest accusation raping a 13 year old girl. If guilty, Trump should be spend the rest of his menial life in prison. Trump is unfit.","post_message":"\"Horrific\", \"sickening\", \"poisonous\" - Donald Trump blasted over lewd and sexually charged comments he made about women @webpagelink"},{"comment_id":"10152659193766680","commenter_b":"Not for the people in charge.","commenter_a":"They're right, our presidential debate system is broken.","post_message":"The group aims to make it easier for independent candidates to get a coveted spot on the national stage in the fall of 2016."},{"comment_id":"927319353970153","commenter_b":"Who cares about whatever Sarah has to say....she's a nobody. Good grief !!","commenter_a":"BO doesn't care he's in office as a fraud perpetuating and feeding the muslime brotherhood on our dime","post_message":"HA HA!"},{"comment_id":"10154936291493088","commenter_b":"> I don't know why it's impossible to believe it will happen again. Shane Those that are better informed than you are agreeing on this, big time, using measurements, not belief. You can't use your logic&belief on things that have happened over millions of years with this, that has happened over a range of 50 years. Keep reading up on this because you're getting very close.","commenter_a":"While I won't support any of Donald's nominations, I think climate change has always been around, long long before humans. And much longer still before the industrial era. The earth has been a waste land before, and it's also been a water world. I don't know why it's impossible to believe it will happen again.","post_message":"I will vote NO on the nominations of Scott Pruitt to be EPA Administrator and Rick Perry to be Secretary of Energy. The scientific community is virtually unanimous. Climate change is real, it is caused by human activity and it is already causing devastating problems in this country and around the world. We need an EPA Administrator and a Secretary of Energy who are prepared to stand up to the fossil fuel industry and their short term profits, and lead the fight to transform our energy system away from fossil fuels to energy efficiency and sustainable energies. In discussing these issues with Mr. Pruitt and Mr. Perry I found no evidence to believe that they are prepared to do that."}]
