[{"comment_id":"954186131315786","commenter_b":"Her being revealing? Do you think she picked out the dress herself and made a conscious choice to show her nipples?","commenter_a":"To be so revealing when so young is certainly extremely questionable moral territory.","post_message":"Too young?"},{"comment_id":"10150611422369999","commenter_b":"The south wants to keep it.....FLY IT HIGH SOUTHERNERS WHO ARE PROUD OF THEIR HERITAGE KEEPING STATE RIGHTS.","commenter_a":"It's a VA battle flag....why was SC flying it? oh yeah, State's rights were taken away...sad so many people think that war was over nothing but slavery...I'm a history major....would never fly it but I know what it's true purpose is...Those who had confederate soldiers die in their family still use it....KKK ruined it and so did this fool....","post_message":"Breaking News: Gov. Nikki Haley of South Carolina called for removal of a Confederate battle flag from the State Capitol grounds after the white man accused of killing 9 black people was seen brandishing that flag in widely circulated pictures. “It’s time to move the flag from the Capitol grounds,” the governor said."},{"comment_id":"861353807244021","commenter_b":"she's a nut fix her she don't need any more kids keep her in prison to the max time","commenter_a":"Kill the witch or let me at her. Wtf! 😡","post_message":"WARNING: The details in this story are extremely graphic. A 26-year-old Missouri mother was sentenced to 25 years in prison for the horrific death of her 4-month-old daughter. @webpagelink"},{"comment_id":"1015232928526293","commenter_b":"will someone call the home and tell them a resident is out running loose?","commenter_a":"makes no sense, idiot","post_message":"Nancy Pelosi identified what she called the \"three G's\" – reasons why white males favor Donald J. Trump over Hillary Clinton. @webpagelink"},{"comment_id":"10153571319289342","commenter_b":"¡¡¡¡Omg esta cara voy a poner si ganó !!!!","commenter_a":"Will Htx Larisa Valcy Brian Valcy Jovannii N Juliet Mendoza Luisao Roberto Galvez @username Beldy Salvador","post_message":"$400 MILLION POWERBALL JACKPOT: Are you planning on buying a Powerball ticket this week? With the potential jackpot now standing at $400 million, this Wednesday drawing could be one of the largest in U.S. history. While you're dreaming of how you'll spend your winnings, here's a look at the 10 largest U.S. lottery jackpots: #abc13"},{"comment_id":"10153562599204087","commenter_b":"#DumpTrump","commenter_a":"cruz your a fool the media has been trying to destroy trump and help you. cruz you are stupid","post_message":"“Every accusation you raised is incorrect,” Ted Cruz told Fox News host Chris Wallace when asked about his campaign’s role in spreading falsehoods about rival Ben Carson in Iowa. “I appreciate you reading the Donald Trump attack file on that.”"},{"comment_id":"10152784029667093","commenter_b":"Apparently, Valerie loves being inbred too!","commenter_a":"If you're white you're right.","post_message":"Parker Co. teen accepts a plea deal, avoids life in prison... @webpagelink"}]
