[{"comment_id":"10154376306546636","commenter_b":"She did? She'll never get out of prison.","commenter_a":"She got off easy for mowing down people terrorist style. Or maybe they got the idea from her idk","post_message":"A woman accused of a deadly crash that claimed four lives during a homecoming parade in Stillwater has accepted a plea deal."},{"comment_id":"691233461036607","commenter_b":"Every \"illegal immigrant should be deported\" good let's start with Malenia Trump","commenter_a":"Every last illegal immigrant in this country should be deported and all charged with a felony for being illegally here. If they come back again, charge the immigrant with two felonies and put them in prison, then deport them again when their sentence is up. If there is a third time for the immigrant to come back, give the natural life sentence. People that come here, should do so legally.","post_message":"Obama deported a record 1.5 million people in his first term."},{"comment_id":"498325633682650","commenter_b":"Latino political organizations need to get their voters in large numbers to make sure that ASSHOLE doesn't get in office!","commenter_a":"I am not a Republican. I am not a fan of any of these idiots running. But Trump has got to go . People are gonna get hurt, innocent people. Look at the monsters he has as his security detail that will swing at anyone for no reason and now this with his supporters. The media has to stop covering him. Take away all the attention he is getting. Maybe cover him when something intelligent comes out of his mouth, which so far has been nothing. This man can say whatever he want but we are a democracy, we have a government and he rant about all he wants to do but he can't do it alone. There are 3 branches of government. I know that he has veto power but then we would be calling him Dictator Trump not President Trump. He is a egotistical classless piece of shit.","post_message":"It's getting worse."},{"comment_id":"10153916638559753","commenter_b":"Feed the gator Hillary and her pimp Obama kill that gator quick","commenter_a":"According to CNN the gator was a known Trump supporter and a life member of the NRA.","post_message":"News of yet another alligator attack has shaken things up in the state of Florida. A service dog named Precious has passed away after protecting her owner from being attacked by an alligator. Fox News reports the protective pit bill died after jumping in between her owner to save the man from an alligator attack in the southwestern portion of Florida. The alligator attack and death of this heroic service dog from Florida has prompted an inspect to determine whether or not the marina where... @webpagelink"},{"comment_id":"719778928160572","commenter_b":"SHE'S a lying BITCH!!!!!","commenter_a":"Maybe for your distorted economy, sissy. It's perfect for Free Enterprise Capitalism. Just picture perfect.","post_message":"Clinton says that despite his years of business experience, Trump is dangerous and \"shouldn't have his hands on our economy.\" What do you think about her comments?"},{"comment_id":"1046875855332998","commenter_b":"Scary!!!","commenter_a":"correct your self b4 you talk about Mr President Obama tramp....","post_message":"Since I am self-funding my campaign, I don’t have to worry about being politically correct! President Obama has fought ISIS in a politically correct manner and look where it has gotten us! If we don’t talk about and address our country’s issues - we will never solve them!"},{"comment_id":"10154532453451051","commenter_b":"@username, do you kiss your boyfriend with that mouth?","commenter_a":"You're goddamn right I do. Hope he cracks down on the obstructionist Dems swiftly, and mercilessly, and for those who will inevitably say \"Oh, but the GOP were nothing but obstructionist with Obama! Buhuhuhu.\" To that I say: Elections are a game of King of the Hill, we now have the Hill and soon all 3 branches of Government. I'm not gonna entertain that \"moral high ground\" game, no, this is strategic warfare plain and simple, and we have the strategical advantages.","post_message":"Do you support Jeff Sessions as attorney general?"}]
