[{"comment_id":"879266582115130","commenter_b":"The Zionists regime knows only the language of the gun.","commenter_a":"What can they have to talk about ? I am a pacifist , but in this case i would urge Iran to start building nuclear weapons, or get someone to supply them immediately , then maybe the Zionists will finally show them some respect.","post_message":"The foreign ministers of Iran and the United states kick off a fresh round of talks in the Swiss city of Montreux."},{"comment_id":"10154490644508132","commenter_b":"But she was slimer before","commenter_a":"Her body is not well balanced is too much up in the chest ... too much on her Back .... Kourtney and Kendall bodies are better","post_message":"Kim Kardashian West traded her neutrals and furs for a bold vibrant look! (via PeopleStyle)"},{"comment_id":"1642069832709355","commenter_b":"I'm voting for Trump.Is it just me or is Sara palins voice extremely annoying?Like worse the that Kathy griffins creature.","commenter_a":"I approve this message. I am anxious to know Mr. Trump's running mate. Go, Donald!","post_message":"I am greatly honored to receive Sarah Palin's endorsement. She is a friend, and a high quality person whom I have great respect for. I am proud to have her support. #Trump2016 #MakeAmericaGreatAgain"},{"comment_id":"910297725696643","commenter_b":"Girls can be just as bad","commenter_a":"Could have been worse","post_message":"'I cleaned my son's room and found... a Pringles  tube full of URINE'"},{"comment_id":"1150363668364697","commenter_b":"In other words you won't be out of pocket otherwise you could still go ahead and spend a tiny bit of the fortune you have made from the British people, you'r an utter disgrace to this country. put some back in instead of out you fuckwit arsehole virgin c**t.","commenter_a":"Tell us what the deal was, then we can make a judgement. Could be bs. for all we know.","post_message":"And Richard Branson has cancelled a deal costing some 3,000 jobs..."},{"comment_id":"10154592681344445","commenter_b":"Yup, they are trying to invade the US as we type. Better build that wall.","commenter_a":"Now that half the Republicans in the house have been officially brain-washed, his confirmation will take place. This country will be taken over by Islam, when it happens. Bad news for women and gays.","post_message":"'I am confident he will serve the American people with integrity and a steadfast commitment to justice,' the president said. @webpagelink"},{"comment_id":"1460895663923103","commenter_b":"😂😂😂😂😂😂😂😂😂 anit about that choking life not catching a M charge for no girl 😂 lool","commenter_a":"'@username 😂😂😂","post_message":"It really be like that  #WSHH"}]
