[{"comment_id":"496116510576642","commenter_b":"There are no virgins they rape them all","commenter_a":"Kill them all and let them find Allah and the virgins","post_message":"SICKOS!"},{"comment_id":"999021020109368","commenter_b":"This is legislature that should ONLY be debated and decided BY WOMEN!!","commenter_a":"mayam merouane ok @username","post_message":"What a brave woman"},{"comment_id":"10153641804123487","commenter_b":"\"Staying Power\"....\"Explodes\"....Politics is so sexual.","commenter_a":"Who cares about the xenophobe clown? Why don't you cover the candidate with more real ideas: @webpagelink","post_message":"The GOP is doing some soul searching.."},{"comment_id":"1823440651212555","commenter_b":"Shut up bitch","commenter_a":"All Lives Matter, or NO LIVES MATTER. Sick and tired of people useing the Race card for their answer to all their problems. How about INDIVIDUAL RESPONSIBILITY!","post_message":"Ben Shapiro is a liberal's worst nightmare...."},{"comment_id":"10153080181251519","commenter_b":"Like StepFord Wives.. Im ashamed that A Women could trash and allow other sisters to have their rights taken away!!","commenter_a":"How can these people especially GOP WOMEN accept that party????","post_message":"Megyn Kelly slams Trump for calling women ‘fat pigs,’ ‘dogs,’ ‘slobs,’ and ‘disgusting animals'... and he laughs -- and so does the GOP crowd."},{"comment_id":"10154725381070579","commenter_b":"You may want to look into Stein or Johnson... Hillary is a corrupt habitual liar and anyone that does not see it, is not the sharpest knife in the drawer...","commenter_a":"I'm a United States Army Veteran and I'm With Her. Trump's complete failure to understand basic foreign policy concepts, his relationship with Putin, and his out-of-control ego are a one-way trip into a third world war. His kind of \"leadership\" is the last thing America needs. Clinton isn't perfect but she's better than any of the other candidates today.","post_message":"Active & Retired Military: Your choice in 2016?"},{"comment_id":"1807011322902281","commenter_b":"In what part did she say super predators? Actually finish watching the video instead of make false accusations!!","commenter_a":"Do you guys have one recorded incident of Trump saying anything negative towards the black community like this? We have a recording of Hillary calling African-American super predators and saying to a group of black people that if they did not like what she had to say then she would just go talk to white people. @webpagelink","post_message":"BREAKING: Trump's own rental agent just told MSNBC that the Trumps told him: \"WE DON'T RENT TO N-WORDS\" Video by Occupy Democrats, LIKE our page for more!"}]
