[{"comment_id":"10153715209333984","commenter_b":"Build a wall and send them home.","commenter_a":"You know illegal Mexicans come in this country illegally the women wait till about a month before delivering their child snake in this country have their child hoping to get birth rights I think if you come in this country out of another country if you have a child here your child is from your country not mine god bless the United States and we're going to try to keep it that way","post_message":"These Texas counties are doing something that has earned them a warning from Mexico, but it doesn't look like they're letting that stop them!  Do you support what these counties are doing?"},{"comment_id":"10153301628035496","commenter_b":"Really, Brenda, perhaps you should have looked at the message she was sending. Why should we have to be subjected to her cop bashing, Black Panther, Malcolm X etc. opinions. That's not talent. Perhaps we should go back to marching bands and perhaps you should think about reporting the news or even better retiring.","commenter_a":"Wow these comments are funny to me. Beyonce did not give a hateful message. You all are upset because of what you saw visually and what the media has told you what she is singing about. Have any of you even listened to the song or listened to her response to the media turning her song into hate? And she and her husband have done a lot for the black community. They just don't have the media around to show it because that is not what it's all about.","post_message":"Brenda's Last Word on Beyonce's so-called 'way too political' Super Bowl performance.  PHOTOS from the performance: @webpagelink"},{"comment_id":"10154426729152446","commenter_b":"Wtf. Who do they think they are. Little unqualified woman","commenter_a":"wth???","post_message":"'@webpagelink"},{"comment_id":"1002700983109302","commenter_b":"Someone should ducktape her mouth","commenter_a":"Somehow, that doesn't look 'allegedly'.","post_message":"Woman facing animal cruelty charges after allegedly duct taping her dog’s mouth shut, then posting photos on Facebook: @webpagelink"},{"comment_id":"922771304482591","commenter_b":"We all wish we could return your white asses back.","commenter_a":"Damn the ignorant white man - HisStory - his Eurocentric propaganda BS taught in public education and he can't even remember his own fucking history. Beyond head up the ass!","post_message":"Not only are they hypocritical, they are also ignorant of history."},{"comment_id":"1141907219179950","commenter_b":"So, she won 3rd and 5th place. So much for any supposed advantage she's supposed to have by having been born biologically male. She was beat by naturally born females.","commenter_a":"We're all equal so we must all be equal physically right? Yeah no.","post_message":"“What happened to protecting naturally born females?”"},{"comment_id":"10152747594996051","commenter_b":"'@username smart lady","commenter_a":"All this complaining about someone suggesting that one be responsible when getting our tax money. This is crap something needs to be done but then again the bleeding heart unimformed idiots will start crying. Look around and show me the starving people just look at the size u don't get that size while starving.","post_message":"People getting food stamps in this state need to get ready for some big changes."}]
