[{"comment_id":"1069087446447636","commenter_b":"Put her on the street .","commenter_a":"She looks flashy","post_message":"The liberal media loved Michelle Obama's tang SOTU dress.  Take a guess at how much it cost."},{"comment_id":"10154283340572061","commenter_b":"You need an education woman. The president has already spoken. People like you really scare me. Your like a lose cannon with no direction, hurting the innocent! I don't agree with you but would never think of slamming you or causing you hurt. Everyone needs to figure out how to get along or there's not going to be a world to live in for any of us.","commenter_a":"Where are words from the president? Words, that's right, he has a short vocabulary. He can't say it's going to be great, really, really, great. When I tell you, it's going to be yuge. Sad America, when disaster strikes, your president is somewhere eating caviar sulking about his weak inauguration numbers. smh","post_message":"At least 16 people have died over the last 48 hours due to tornadoes, as a violent system of storms works its way across the Florida Panhandle and parts Georgia and Alabama: @webpagelink"},{"comment_id":"10154276223602014","commenter_b":"how many illegals??","commenter_a":"i used to be for getting the wall built then I remembered the movie V for Vendetta.... I do not want to live in a society like that... I will not close myself in only to be controlled under the guise of security and safety... the world is dangerous.. protecting oneself from those dangers is paramount before any wall should be built.. and watch out for your neighbors protect them as well... one day you may need the help....","post_message":"They do not want a wall to be built on their land."},{"comment_id":"660877367410427","commenter_b":"RACISTpig fucker","commenter_a":"Fuck you nigger u suck anyway","post_message":"Can i get a collective \"______this Guy\"?  Shop.tacticalshit.com"},{"comment_id":"687214161469162","commenter_b":"Working class Americans can't & choose not to have more children then they can afford. Immigrants, illegals have as many as they want & working class pay for everyone of them, sick. Disgusting. Send anyone one assistance to the employment center. Get a job or get out. No more free ride.","commenter_a":"Yes, for sure","post_message":"This Muslim father of 11 has been receiving insane amounts of welfare for the past 10 years. He say’s the government is basically raising his children for him. Should this lazy father be cut off from all welfare?"},{"comment_id":"10156088559505294","commenter_b":"In my opinion, the collarbone issue and sleeveless tops or dresses are a bit over the top. The women in most offices I've worked at wore sleeveless dresses and tops that were tasteful and appropriate. Even the women news anchors wear tasteful sleeveless outfits. I don't see a problem with that. I do however agree a dress code should be in place for kids in school. When they get out in the real world, there are rules, and they have to be followed. 48-50 years ago, we had to wear skirts or dresses that touched the floor if kneeled down. If it didn't touch the floor, we had to change. The guys had to wear belts. If they didn't have a belt, they had to pay 50 cents for a piece of masking tape with the word belt on it and tape it to their pants, and they better have ...","commenter_a":"I say all schools should have a dress code and make sure all students adhere to it. It teaches them to accept things in life their not happy about, but rules must be followed.","post_message":"It's back to school time, and we're hearing more stories about dress code violations. Students at one school in Chicago are protesting a rule that they wear only shirts and dresses with sleeves.   Click below for more, and tell us: Are dress codes these days fair? Unfair? Do they go too far?"},{"comment_id":"1405783259444718","commenter_b":"Nothing will be done. The past muslim made sure plenty of others were in charge before he left to keep it that way.","commenter_a":"I remember last year someone was sentenced pretty harsh for putting bacon on the door handles of a mosque. They called it a hate crime. Let's see what they do about this if they even do anything at all! Sickening","post_message":"Can you imagine the outcry if something like this had been done to a mosque?"}]
