[{"comment_id":"10152999790806167","commenter_b":"I would pay money to watch Nikki Haley and the vampire fight each other.","commenter_a":"conservative firebrand???lol whatever! she is a delusional racist self hating woman!","post_message":"Fact: Governor Nikki Haley was born in South Carolina."},{"comment_id":"1001149379923298","commenter_b":"Watch out folks, she will give you the evil eye!","commenter_a":"HillbillyHillary at the Arkansas Pig festival,stumping for votes","post_message":"The video Hillary doesn't want you to see. This could sink her campaign! [Watch below]"},{"comment_id":"10154334657668797","commenter_b":"I'LL SKIN THAT DOG AN THROW IT ON THE GRILL FOR DINNER. .. MMMMM MMMMM MMMMM DOG.....","commenter_a":"The newest FB trend....disabled animals as \"news.\"","post_message":"LIFE ROLLS ON: A puppy born without front legs was found abandoned and shivering in a cardboard box on a busy street. But now, she has her very own set of wheels to get around! See here:"},{"comment_id":"10154324384701600","commenter_b":"This has been going on, way before the flood of people started moving here. this is what happens when a predator looses it's fear of humans","commenter_a":"Its because so many people are moving to Colorado. There are more homes and apartments being built and the more we build the more we invade their homes. It becomes harder for then to hunt for food. So then they move into our towns and cities because people leave trash around everywhere.","post_message":"Update: 5-year-old boy survived the attack. His mom fought the animal off. The boy is being transferred to a Denver hospital in fair condition."},{"comment_id":"10154672636522994","commenter_b":"Not me Jonathon. I hate anything pumpkin","commenter_a":"Generalizing entire groups of people works both ways. Don't assume all black men are criminals, don't assume all cops are bad, don't assume all white girls like pumpkin spice, all black women are angry, all white men are drunks or that all Asians can't drive. Just be nice to other people.","post_message":"What started as a daughter's effort to plan a retirement party for her police officer father turned into so much more."},{"comment_id":"966472163391020","commenter_b":"They won't last very long if they show up here!","commenter_a":"Already here","post_message":"Nothing but a change in leadership can stop this."},{"comment_id":"1114475591908563","commenter_b":"Scum","commenter_a":"Two interviews; one discussing the present, when he declares no share ownership etc, etc, and a second interview, which was today, discussing the past when he did own some. Two very different things. Perhaps it's wise to point that out, instead of skewing the facts to confuse your poor readers....","post_message":"BREAKING #MicBrights"}]
