[{"comment_id":"1041804329212648","commenter_b":"The same family will bring in refugees, no doubt, and will regret that as well.","commenter_a":"At the shelter in my city they put all pits and even half pits to sleep, they don't even adopt them out.","post_message":"Pit bull rescued from 'death row' attacks daughter just minutes after arriving at family home"},{"comment_id":"10153391344478352","commenter_b":"Crazy mother sucker","commenter_a":"Oh boy! Here we go! Before it starts, dont blame nothing on Islam.They went blowing up people out of their own desires.Islam had nothing to do with it.","post_message":"Car-jacking victim of Boston bombers tells court how they admitted to terror attack, demanded GPS to get them to New York and played CDs of ‘religious music’"},{"comment_id":"947408295386760","commenter_b":"Jill has sexy legs","commenter_a":"Commies","post_message":"\"For my brothers and sisters that supported Dear Brother Bernie Sanders - this is the next step. This is the Green step. It is the progressive step. It is to stay on the love train. Justice is what love looks like.\" -Dr. Cornel West"},{"comment_id":"1785556881731423","commenter_b":"The white house will probably be full of naked stripper","commenter_a":"Trump will bring that back","post_message":"Yes!"},{"comment_id":"10154536419509087","commenter_b":"Jolie should worry about fixing her house first..","commenter_a":"Some day in history Freedom of Religion will meet the crossroads. How will America defend itself from enacting Shari Law?","post_message":"“Shutting our door to refugees or discriminating among them is not our way, and does not make us safer,\" Angelina Jolie said. “Acting out of fear is not our way. Targeting the weakest does not show strength.\""},{"comment_id":"1043006319050712","commenter_b":"Limit the size of corporations ! Make them pay better wages and of course pay there taxes !","commenter_a":"It is important for one of the worlds' largest companies making huge profits, paying substandard wages, few benifits, manufacturing goods in the worst labor markets, akin to slavery to also hide it's money to avoid paying taxes to the government that provides medical care and food stamps to it's employees. After all what fun would it be to make obscene profits if you actually paid your fair share of taxes.....","post_message":"You won't find a Wal-Mart store in Luxembourg, but it does help the retailer avoid major US taxes."},{"comment_id":"512162555660096","commenter_b":"@username, Kanye will never be President.","commenter_a":"Trump","post_message":"WATCH: Video of full Donald Trump campaign rally in Phoenix, Arizona."}]
