[{"comment_id":"10154247544237894","commenter_b":"Damn yo mama mean BUSINESS!","commenter_a":"one year my brother and i unwrapped all our Christmas presents before Christmas and my mom found out and took everything back, i would've much rather gotten the ASS whooping instead.","post_message":"Say What Now? Indiana Woman Arrested After Beating Kids for Opening Christmas Gifts Early"},{"comment_id":"1220607601313429","commenter_b":"Lena Al","commenter_a":"Sinéad check this out","post_message":"Sounds about right."},{"comment_id":"1382876735088925","commenter_b":"This bitch is evil","commenter_a":"I bet bin laden isn't dead. !","post_message":"THIS IS ABSOLUTELY HORRIFYING!"},{"comment_id":"10153830223561756","commenter_b":"why were they refugees and not called migrants... humm good for the goose good for the gander..","commenter_a":"Thank you for calling them migrants. The \"refugees\" stayed in Turkey, Greece, Lebanon etc. The ones migrating all the way to Germany - some 10 countries' borders away! - are economic migrants who risk their and their poor kids lives to get to the country with the highest GDP and best social services about 2,000 miles away. Hungary has had enough of them coming through, demanding food and services all the while disrespecting Hungarians laws and badmouthing the country. Enough! Go around or go back, Hungary has no interest in catering to this group, the country has enough problems already with unemployment etc. Watch this video, Hungarian cops trying to disperse food and drinks to migrants and refugees: @webpagelink","post_message":"The scene at at least one processing area in southern Hungary is starkly different from recent days. Aid agencies are dismantling huge tents. Cleanup crews rake trash into piles.  Migrants who slept in a cornfield here for days have been bused to the Austrian border. The Hungarian border is now closed."},{"comment_id":"10153193564170326","commenter_b":"Hell, they should move to texas!","commenter_a":"The GOP and their love for guns should move to Somalia where even children carry guns","post_message":"\"More guns\" is always the answer."},{"comment_id":"482642515272130","commenter_b":"Absolutely it is. We're nearing the point of no return for this planet (relative statement. Could be in 100, 300, 500 years) and without a plan to continue our species (even if generations have to spend their lives in a travelling spaceship) we will go extinct. Planning for the future is always a worthwhile investment no matter how far ahead the worst case scenario seems.","commenter_a":"In other news more useless discoveries that are so far away they might as well not exist","post_message":"AMAZING news."},{"comment_id":"686756008181644","commenter_b":"Yes she is a Scumbag!!","commenter_a":"Yes she is","post_message":"The father of a victim from Benghazi calls Hillary A 'Scumbag' We send our condolences for his loss.  Do you think Hillary Clinton is a scumbag?"}]
