[{"comment_id":"1282558331837218","commenter_b":"\"Accidently\" lol fucking worthless Muslim and dumb bitch.","commenter_a":"Lies way less maybe but on a much higher scale lady. Really how does she sleep at night knowing she wants to butt fuck half the country and rape our military. I look at that bitch and I cringe bc she just says hello kindly and you know she is lying.","post_message":"Another day, another Trump lie debunked."},{"comment_id":"10153461345971130","commenter_b":"Arrogant bitch. Who does she think she is? Shut up and go back to whatever latin dump you crawled out of.","commenter_a":"Coreena Christensen could agree any more!!! perfectly said","post_message":""},{"comment_id":"1023513341058227","commenter_b":"Go figure. A business in business to make money. She should know, she's the biggest criminal of them all.","commenter_a":"imagine that, a company in business to make money. You can't fix stupid, but you can vote it out of office, or in this case make sure it doesn't get into office.","post_message":"This is most likely the dumbest comment she has made to date..... so far."},{"comment_id":"10153481756262507","commenter_b":"@username \"you're\" means \"you are\"--so \"To you're point\" means \"to you are point\"...just an FYI","commenter_a":"If he doesn't win the dem ticket he can still run as independent and take all his votes that really do matter with him! along with over half the so called dems and prob a 1/4 of so called repubs!","post_message":"It's not over until it's over."},{"comment_id":"10154389558756336","commenter_b":"@username LOL! it's the world who runs to, scrambles to get to, imitates and leaves all behind to get to The US not the UK! We don't need to catch up with anywhere, no one's out in front of us!.....hence a hella immigration problem!","commenter_a":"Hey aren't guns illegal there? This must be a misunderstanding I'm sure, take your gun control and stick it up your a$$ Thought Europe(Germany) had very strict gun laws? Just goes to show you that the bad guys will ALWAYS find a way to get guns!!!!","post_message":"Breaking News: There are reports of a “threat situation,” involving \"some sort of weapon\" at a German movie theater in Viernheim, according to police. @webpagelink"},{"comment_id":"1199347126788647","commenter_b":"We have to get these people out of here why pay for illegals school when we can't afford school for American kids","commenter_a":"When people have had enough then this will be brought to a stop not until, they think they are entitled to everything free and then they will take your job, then you'll be on welfare without a means to support yourself!","post_message":"What?!?!"},{"comment_id":"482616358589904","commenter_b":"You mean white again. Lol. Hillary 2016!","commenter_a":"I am voting for Donald J. Trump to make America great again #trump2016","post_message":"\"That's it, that's the end of America.\""}]
