[{"comment_id":"10153562430331350","commenter_b":"Shut up you stupid woman","commenter_a":"Why do white think they can break rules ? Anyone hunts is a savage, and they are going to suffer, that's the way they think you can treat black people also, you and your seeds will suffer, and it's long overdue, there is no way God gave me this same book to worship as the white man. Break the curse and burn the bible.","post_message":"Legal analyst Lisa Bloom explains what could be next for the dentist."},{"comment_id":"936584933056721","commenter_b":"Well bye bye you illegal immigrant because your ancestors aren't from here .","commenter_a":"Black life's matter movement is a threat to law enforcement! The Obama administration is a threat to law enforcement! Islam is a threat to law enforcement! Illegal immigration is a threat to law enforcement!...... This man is not!","post_message":"In a video he apparently posted last week on Facebook, Jon Ritzheimer calls out New York-based The Islamic Post for calling him the 'American Taliban.' Now the FBI has issued an alert, citing he is a  threat to law enforcement."},{"comment_id":"915008615188661","commenter_b":"The other race of women say the same things, they just not on here.","commenter_a":"Good for him, this happens to men all the time. The women on here that are outraged are the type of women that men should stay away from. Nothing worse than a hypocrite. I can't help but notice that the women that are upset are mostly black. Very telling","post_message":"Tasha Smith forced to pay ex-husband $7K a month, in addition to the $50K she gave him last year @webpagelink"},{"comment_id":"914002385301524","commenter_b":"Fkn eh one less pig on the streets","commenter_a":"How many cops DON'T get caught doing the same thing?..","post_message":"He tried to frame an innocent man for a burglary that HE committed! When that didn't work out he killed himself.  From (Y) Counter Current News - MBD"},{"comment_id":"1742724086013339","commenter_b":"Go Girl!","commenter_a":"So good","post_message":"Live from San Diego: Watch as Hillary speaks on smart foreign policy, keeping our country safe, and why we can't afford Trump as Commander-in-Chief."},{"comment_id":"687880108038609","commenter_b":"of course they arn't all murders and gang members that's why the wall will have a door or did you miss that part in the cnn chopped up version of that speech? the ones who want to be Americans can stay the rest can f off.","commenter_a":"These comments are disturbing. These are parents, children, families...not murders, drug dealers or rapists. Instead of 'building a wall' or treating them like shit we should be coming together with Mexico so that they don't need to come here. They need help, we have a problem, so why are the two countries not putting their heads together to figure out a way to HELP","post_message":"Thousands of Central American children and families are arriving in Texas."},{"comment_id":"826344630889447","commenter_b":"We are sick and ;tierd of feeding these lazy women who just keep laying on their backs , letting free loaders get them Pregnant. We need to sterilize these women. We should pay to get them sterilized.","commenter_a":"Get a JOB, leeches.","post_message":"They are losing it. That's what happens when you mooch for your entire life.  Do you think this was a long time coming?"}]
