[{"comment_id":"10153567404684087","commenter_b":"His wife doesn't look happy in photo","commenter_a":"Is it, \"Gotcha! Now buy my new book. I'm dropping out of the race. It's been fun\"? Because his run is obviously a bad joke that some people are apparently taking seriously.","post_message":"Donald J. Trump is holding a special news conference on #SuperTuesday night to deliver a major announcement. WATCH LIVE:"},{"comment_id":"1334233936596633","commenter_b":"The wall goes up. No more cowardly Muslims in the White House. We've had enough","commenter_a":"Go ahead and lock up the nomination. It's irrelevant. There isn't going to be a Republican in the White House next year.","post_message":"Today's vote could decide whether Donald J. Trump will lock up the nomination outright."},{"comment_id":"663841097139802","commenter_b":"F the immigrants, it is Thanksgiving, you Effing Retard. Welcome to America, we are Americans.","commenter_a":"fuck him","post_message":"The Obama administration is trying to ruin your thanksgiving.  This is absurd. We can't let him get away with this.  Will you still call it Thanksgiving no matter what?"},{"comment_id":"10153428206108984","commenter_b":"She needs prison time!","commenter_a":"As far away as possible","post_message":"Looks like this is coming back to haunt her...  Do you think Hillary Clinton needs to stay far away from the White House?"},{"comment_id":"1012314152218696","commenter_b":"Ungly Chelsea looks just like her father , Webster Hubble. What s slut that crooked Hillary!!!!!!!!","commenter_a":"Yes. Beauty & the beast think you can figure this out for yourself.","post_message":"Is turnabout FAIR play? This deserves about 25,000 'LIKES & SHARES'. Enjoy... @webpagelink"},{"comment_id":"1783677398519787","commenter_b":"@username TRUMP IS OUR NEXT PRESIDENT.GET OVER IT.","commenter_a":"I am really not a trump fan.. But if his election gets rid of half the asshats that say they will leave he's got my vote","post_message":"She's out."},{"comment_id":"880035775457816","commenter_b":"Some of the women who have become men have beards ,tattoos and 6 packs. Do people really want them to still use ladies toilets?","commenter_a":"This is not a presidential issue","post_message":"WATCH: Donald J. Trump addressed the recent fight over transgender use of public bathrooms, and whether he'd add separate facilities at his Trump properties."}]
