[{"comment_id":"10154178335409877","commenter_b":"Well said Jillian. I too believe that BLACKLIVESMATTER! It's not right, it is unacceptable !! We are al the same inside, under the skin of all people. There is only 1 race. The HUMAN RACE, period!! The more that speak out the louder we are!! And I believe this to can CHANGE!","commenter_a":"Enough is enough","post_message":"So, so tired. #TerenceCrutcher"},{"comment_id":"10153396293173525","commenter_b":"@username, yes I do know that. It has never happened despite 45 of 50 states allowing open carry, and some that have NEVER PROHIBITED it since they became states. No open carrier has ever been \"taken out' by a criminal.","commenter_a":"Kinda think it's dumb. Makes you a target basically. Someone will see ur gun and be like let me take them out first... Ya kno... Element of surprise is better.","post_message":"OPEN CARRY: The same law that's being proposed here in Florida just went into effect in Texas, and to celebrate, several groups rallied at the State Capitol carrying their guns. STORY: @webpagelink"},{"comment_id":"10154305889759312","commenter_b":"Walmart doesn't pay a \"living wage\" either. They can't go get a job at Kmart.","commenter_a":"There are a lot of businesses that do this, why only go after jimmy johns? It's not \"unfair\". What are e in 2nd grade? If you work at Pepsi, you can't work at Coke.","post_message":"The state of Illinois says a practice at Jimmy John's is \"unfair to Illinois workers and bad for Illinois businesses. Do you agree?"},{"comment_id":"1676754379239687","commenter_b":"Bramden whos god bitch","commenter_a":"What a dumbass. It just shows how little thought he's put into what he's saying. The environmental impact alone would be devastating. My problem with Trump is, if he were somehow to get elected, when he didn't get his way he would just say \"I'm going back to my life as a billionaire where I get my way and everything has a price so I can have what I want\". He's made that statement in one of his speeches. He said \"you might not like my statements and I may not get elected for them. So what, I'll just go back to my life of wealth\".","post_message":"How would Donald Trump crack down on ISIS as president? Let's just say he has a bold plan. Here, in his own words, is what he'd do:"},{"comment_id":"10153889638518598","commenter_b":"You have it all wrong. The time to take-down Planned Parenthood and stop the murder of babies is now.","commenter_a":"Excellent! State's rights in action!!","post_message":"BREAKING: Kansas Governor Sam Brownback Signs Bill to Permanently De-Fund Planned Parenthood"},{"comment_id":"10153262054135779","commenter_b":"It's funny cuz it's true.","commenter_a":"\"...MTV then responded by phasing music out altogether over the course of the next few decades, essentially defeating the entire point of why they're there in the first place.\"","post_message":"In 1983, while promoting 'Let's Dance,' David Bowie takes the then two-year-old network MTV to task for playing virtually no videos by black artists. Watch the amazing interview below."},{"comment_id":"10154578809696336","commenter_b":"They are all corrupt !!! Time to clean house !!!","commenter_a":"Lol , I just remembered that Obama said hillary is more qualified than he is .","post_message":"\"The FBI's not supposed to be involved in spinning the news. Whenever you release sensitive materials on the Friday of a holiday weekend you are trying to affect the news cycle.\" Tucker Carlson said the timing of the FBI's release of documents relating to the Clinton server scandal \"discredits a venerable agency.\" @webpagelink"}]
