[{"comment_id":"1072091946219346","commenter_b":"Loooool she's just a hoe","commenter_a":"@username its that deep","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."},{"comment_id":"10153537073428352","commenter_b":"Lol she is a freak","commenter_a":"Still dont see why he should loose his life over trafficking drugs, after all he didnt commit murder. I hate indonesia and its stupid laws","post_message":"‘My life is a perfect example of an absolute waste': Andrew Chan’s haunting letter to schoolchildren around the world, warning them about the dangers of drugs"},{"comment_id":"10153589260353822","commenter_b":"Rebecca .... get out of the basement ....","commenter_a":"Requiring people to carry a concealed weapons permit is just another way the government can get your money. Do people actually think that criminals pay to carry a concealed weapon?? No, they don't. I think this is a great law, go WV!!","post_message":"Effective late May, people in West Virginia will be able to legally carry concealed guns in public without permits or training."},{"comment_id":"1069162493180002","commenter_b":"Black LIES Matter!","commenter_a":"Life is what you make it....if you obey the laws and live a clean life none of this would happen....put the blame where it belongs.","post_message":"\"The idea that there are tensions between police and particularly black youth is something that kind of went without saying.\""},{"comment_id":"10153384667464726","commenter_b":"I can't tell you how little I care about what this silly woman says.","commenter_a":"it,s more convenient being black these days!!!!!!!!!","post_message":"WATCH: Controversy is swirling in Spokane over the local NAACP president. She says she is black but her parents say otherwise..."},{"comment_id":"10152619988623525","commenter_b":"With lots of glitter...","commenter_a":"So, what will the bathroom towels have on them??????","post_message":"UPDATE: Hillsborough County Clerk Pat Frank says the office is ready to issue same-sex marriage licenses Tuesday morning, and she has reserved the park across from the office for potential crowds. \"I was hoping Judge Hinkle would revisit it and he's made it extremely clear now that it applies to every clerk in the state, that the ban against gay marriage is void...it never existed.\" MORE: @webpagelink"},{"comment_id":"10154542878929714","commenter_b":"Their professionals,and should set an example.","commenter_a":"Morals clauses","post_message":"This school district wants teachers to stop wearing graphic T-shirts and flip-flops to work."}]
