[{"comment_id":"10153917677820695","commenter_b":"Is that the guy walking/running or it's the photo of a car he supposedly driving?","commenter_a":"Police just released this surveillance photo of the man, who was driving a silver car. They say the victim was a 65-year-old woman.","post_message":"#BREAKING: Officers are searching for the man who sped away from the Walmart parking lot.  We have a reporter on the way to the scene and will have a live report on the Channel 2 Action News Nightbeat at 11."},{"comment_id":"968788776513933","commenter_b":"Put these bastards in prison","commenter_a":"Jackasses.","post_message":"These people are psychotic."},{"comment_id":"10154308989386028","commenter_b":"Haha no way","commenter_a":"Screw San Diego all the tight pants wearing hipsters they can keep their f****** team","post_message":"A plan to move the San Diego Chargers to Los Angeles is almost a done deal, multiple sources tell NBC4's FredNBCLA. @webpagelink"},{"comment_id":"10153663398345695","commenter_b":"Are you for real, time and money wasted on a couple of idiots that felt the need to drop confederate flags on a church lawn!!!","commenter_a":"Can someone please explain to me how this is a crime .","post_message":"'What can you do? Nothing but pray for them,' said Stacy McCrary.   Why the suspects can't be charged with a hate crime starting on Channel 2 Action News at 4 p.m."},{"comment_id":"455232604658620","commenter_b":"Hillary Clinton!!!","commenter_a":"Bernie Sanders!!!","post_message":"Listening is always better."},{"comment_id":"1202153396486746","commenter_b":"It takes 2 to tango","commenter_a":"That's not news! Thats standard procedure.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154135870346336","commenter_b":"'@username OMG---More Trump Fabricated LIES!!!Trump Played Everyone Like A FIDDLE With Those TRUMP Planted PAID Protesters, Trump Now Has 20 Secret Service Guys Guarding Him At His Rally, EGO IS THE WORD...He Really Knows How To Play the Media & Followers *NEVER TRUMP* TRUMP Wants to TURN Our Military INTO ZOMBIE TeRRORIST Animals To Beat ISIS...BUT OUR MILITARY IS AN ELITE GROUP & Has Rules & Morals.... ISIS is A BAND Of MURDERS & CRIMINALS.... TRUMP Wants A WAR $$.....People Are Blinded by Trump's Rhetoric and can't SEE Trump Sending Our Young Adults To Fight An All OUT WAR AGAIN! Government Welfare KING DUMP Trump doesn't need anyone's HELP exposing His LIES Trumps own EGO Is His Own Nemesis.. ??Has Trump Gone From Selling Realestate Properties To Selling Our Whole Country!TRUMP wants to Do Away with Social Security & Medicaid For Our ELDERLY!!! HOW is Trump Helping American JOBS when ...","commenter_a":"Typical Trump...talking about anything other than specifically HOW he is going to make AMERICA great again!! Just saying it won't make it so!! Maybe that's why he gets no more than 35% of the vote. The other 65% are on to his BS...He only cares about Trump not one of his supporters! Wake up people!!!","post_message":"'[Marco Rubio] made a statement that I had small hands. He made it up. He's a politician. Politicians lie.'  Today on 'MediaBuzz,' Donald J. Trump talked about the 'hands' story."}]
