[{"comment_id":"10153409867621051","commenter_b":"Where is your neighborhood bitch I'll be there with bells on think it's a game","commenter_a":"You darkies try and pull a stunt like that in my neighborhood , you'd be leaving in a body bag . KKK TIME !!","post_message":"Beating this teen girl senseless wasn't enough for these women. They also decided to leave a special message on her forehead."},{"comment_id":"968023636596392","commenter_b":"IT'S DERN RACIST IN OF IT-SEFT , IT'S NOTHING MORE THAN A GROUP OF THUGGGS","commenter_a":"This is disgusting....","post_message":"The Marine Veteran fought for their freedoms in Iraq. And then Black Lives Matter advocates allegedly beat and robbed the Marine in a SAVAGE and vicious sneak attack--and have now been ARRESTED. **Viewer Discretion is Advised**"},{"comment_id":"10152932184944753","commenter_b":"BTW wasn't she on her way to see her Bf why not just let him pay for a cab instead of letting her ride on the subway while she's drunk and tired from all of the dancing in the party. I bet most of the people on that car where on the way to work and did not want any problems that early in the AM","commenter_a":"The foo recording is a straight both would've at least socked that lame ass predator","post_message":"What would you do if you witnessed this happening?"},{"comment_id":"1570144263286969","commenter_b":"AMEN. Michele sure didn't/doesn't get it!","commenter_a":"I agree","post_message":"\"There is one crucial sentiment Donald Trump’s Slovenian born wife certainly didn’t copy from Obama’s — the inherent pride of being an American citizen.\""},{"comment_id":"1159811677403083","commenter_b":"The white chic yells her ancestors owned their ass, and then yells black people don't belong in America. Huh. So when. Her ancestors bought the black people and SHIPPED them to America, the black people should go back to Africa? REALLY??! WOW. Unreal...smh... KKK at its finest!","commenter_a":"more a condemnation of them and their ancestors than the person they directed this filth at","post_message":"This is just wrong."},{"comment_id":"1714915928784727","commenter_b":"Looks like she fought with a lawnmower and lost! Seriously, she wants to look like that..... It looks horrendous","commenter_a":"UGH!","post_message":"What do you think of this extreme cut? Marketers are branding it “quirky, stylish and smooth.”"},{"comment_id":"1555472744739839","commenter_b":"Screw them! Go get a job and pay for your own damn food.","commenter_a":"Get off your butt and look for work. In meantime, thank which ever god you pray to for living in a country that gives Food Stamps!!","post_message":"This is outrageous. If you're that picky get a Job and buy whatever you want."}]
