[{"comment_id":"535989533241343","commenter_b":"Stop hating Racist women !","commenter_a":"3 Muslims just went into a Canadian city and opened fire in a bar on innocent people. Canada's Muslim appeaser ignoring it. This is on his shoulders. Trudeau's headline today? Liberal mp going to detox. Watched Obama. Muslim crimes are shush shush. White criminals get detroyed by Obama, cries 'racism' and moves his gun agenda forward. The double-standards by these leaders is taking democracy down a precarious path. Sad.","post_message":"President Barack Obama at State of the Union: \"When politicians insult Muslims, whether abroad or our fellow citizens, when a mosque is vandalized, or a kid is called names, that doesn’t make us safer... It diminishes us in the eyes of the world.\"   #SOTU updates: @webpagelink"},{"comment_id":"10153919889436955","commenter_b":"Trump is the only one who will throw out all of the illegals and anchor babies too stop the influx of Muslims","commenter_a":"Rubio has supporters?????","post_message":"POLL: Who will Marco Rubio supporters vote for?"},{"comment_id":"10153180740642894","commenter_b":"GTFOH. what she suppose to tell the Man not to come around cuz of the media. She ain't playing house she wit a man that has morals and wants to marry her.","commenter_a":"He telling truth i don't know why have something negative to say in all ciara interview she like drama and she was put her son in the middle that's crazy😬😬😬","post_message":"Future Covers ‘XXL’, Says Ciara Tried to Overshadow the Success of His ‘DS2’ Album [Photo]"},{"comment_id":"10154874338494641","commenter_b":"Make the wall will be turist attraction !! Turist will puy a lot for walking on the wall-))) US ern on it, every hotel and restaurant and gifts shops","commenter_a":"Una traduzione bizzarra","post_message":"The move would break a key campaign promise when Donald J. Trump repeatedly said he would force Mexico to pay for the construction of the wall along the border"},{"comment_id":"1264285906955844","commenter_b":"Agree public should not enable bad behavior from 15 year old kid.","commenter_a":"She ain't no child, she wanted act grown, so she got treated likes she grown. Please don't sympathize with her, you are only enforcing the behavior that she is a \"child\" and she can get away with anything.","post_message":"\"The juvenile had to be detained.\""},{"comment_id":"10153137248455329","commenter_b":"Marc Benedict Meine Lieblingsgeburtstags-Torte :)","commenter_a":"Niall Cooke your birthday cake sorted.... :-)","post_message":"The only kind of birthday cake worth having  via @webpagelink"},{"comment_id":"10154103585977015","commenter_b":"They have ruined these children's life....they should be deported and banned from returning!!! If they return, they should be executed.","commenter_a":"LEAD POISONING BETWEEN THEIR EYES IS THE ONLY SOLUTION ! !","post_message":"Members of a Muslim rape gang shouted  akbar in court yesterday as they were jailed for raping girls aged 11 and 13..."}]
