[{"comment_id":"10153220883066491","commenter_b":"Unnecessary! Girls that are having their period don't play with barbies","commenter_a":"LOL - that is just rich.","post_message":"“It’s just what happens in real life.”"},{"comment_id":"575394812634636","commenter_b":"Thanks for the giggles","commenter_a":"i know i'm not the only one who thinks dwayne johnson looks like the rock","post_message":"The brawl occurred after Cage reportedly pulled Vince Neil off of a woman at the ARIA Resort & Casino."},{"comment_id":"1170579889643596","commenter_b":"Haha I thought the same thing. She should cover up!!! Lol","commenter_a":"She shouldn't be breastfeeding in public.....she should cover up.......oh wait animals breastfeed their babies out in the open too and no one bats an eye. Sorry just had to","post_message":"Prague Zoo's 24-year-old gorilla, Shinda, gave birth unexpectedly to a baby girl. Zookeepers didn't know Shinda was pregnant; they thought she was just overweight. @webpagelink  Correction: Prague Zoo has not yet released the official name of the baby gorilla. Shinda, its mother, has been living at the zoo since 2001, not 2003."},{"comment_id":"10152859650389877","commenter_b":"Girl, bye.","commenter_a":"It looks like there's another sign that says \"Down\" so, I'm hoping the other sign, which we can't see, says with... Would spell out \"Down With White Power\". I'm curious to know what the colors of the other team are?","post_message":"High school students flash 'white power' signs at basketball game. Read what happened next below.   Grio fam, what should the punishment be 4 this ignorance? #soundoff"},{"comment_id":"1006130662760739","commenter_b":"And that White women take full advantage of affirmative action every day, it's not just for black people","commenter_a":"Does he ever need a history lesson. Start with \"When Affirmative Action Was White,\" and \"The Half Has Never Been Told,\" to start.","post_message":"The famous actress' brother brags about manipulating affirmative action policies to get into medical school."},{"comment_id":"10153187072706107","commenter_b":"How about a constitution change that says if both of your parents are illegal then you're illegal even if you're born here. No more anchor babies. No dream act, no in state tuition, nothing. The illegals are a slap in the face to the people who are legally trying to immigrate.","commenter_a":"Good Paul!","post_message":"Just minutes ago, on Fox News' On the Record, I announced I will introduce legislation this week to cut off ALL federal taxpayer funding for so-called \"sanctuary cities\" -- until they start abiding by federal law.  For taking this stand, I know I'm going to be attacked like never before.  But I think it's high time someone did something!  The truth is, for years politicians in BOTH parties have promised you and me secure borders.  But all we have to show for those promises is sheer lawlessness.  This President has time and again sought to go around Congress with illegal and unconstitutional executive actions regarding immigration.  And now many American cities are following in lockstep in open defiance of federal law!  These so-called \"sanctuary cities\" prohibit the use of funds to enforce federal immigration law, usually banning officers from even asking about a person's immigration status.  These cities become magnets for illegal immigrant criminals and gang members who have been deported multiple times, but know they're safe if they can just stay within a city's borders.  This can't be allowed to stand.  Not when we know terrorist organizations are looking at our porous southern border as a way to gain entry into the United States.  Not if we are to save the concept of rule by law.  My bill would end all federal taxpayer funding for these cities until they start ENFORCING federal immigration law.  I know these cities will shriek and moan that there shouldn't be any strings attached to all of your tax dollars.   They'll say they're entitled to pick and choose what laws they recognize.  And you can bet our national media will be on their side, and come after me with everything they have.  But it's time politicians cared more about keeping their promises to the American people than what our national media says.  If you agree, I need to hear from you right away.  Please sign your \"Enforce Immigration Law\" petition and agree to your most generous contribution of $20.16 IMMEDIATELY: @webpagelink"},{"comment_id":"10153474426766350","commenter_b":"u don't have 2 worry then bitch. your pathetic.","commenter_a":"sad and pathetic. marriage between homosexuals is wrong on any level and again the moral majority is forced to put up with this BS. i for one will give no male or female homosexual the time of day much less respect they don't deserve. it is wrong on any count for male and female homosexuals to marry.","post_message":"\"Today is beautiful,\" said Anna Kendrick."}]
