[{"comment_id":"1302393583116762","commenter_b":"@username The woman brings up the fact that \"She voted For Trump \" herself","commenter_a":"Why does all the evidence in this video seem half baked @username? I wanna know exactly what was said before the video snippets as to why this woman feels shes being discriminated against in the first place!","post_message":"This Trump supporter went on a racist rant in a store while another customer recorded her meltdown over \"reverse racism.\""},{"comment_id":"10156032956110500","commenter_b":"I got pulled over last night for four miles an hour over the speed limit and my license plate light out. I was courteous to the officer and he to me. In the end I simply got a warning from and a thank you for my courtesy towards him. I told him thanks for only a warning and for letting me know the light was out cuz I really didn't know it was. Common decency goes a long way. That woman is lucky she didn't get taken to jail for the speeding infraction. Hope she tries to challenge the ticket in court and that video gets played","commenter_a":"think she was black is what I think","post_message":"SAY WHAT? You might find it hard to believe what a driver said to a Palm Beach County Sheriff's Office deputy.  WATCH VIDEO-> 8.wfla.com/1FylO8y  What do you think of the woman's comment to the deputy?"},{"comment_id":"10153655061641336","commenter_b":"There not illegal immigrants, they are Illegal Aliens. Death penalty for them!!","commenter_a":"Deportation or jail time is not good enough, eye for an eye. Capital punishment","post_message":"“This was not a random incident,” Sheriff Mike Chapman said at a news conference Saturday. “The suspects and the victim were known to each other.”"},{"comment_id":"10154038430603812","commenter_b":"Arrogance is all she has left to run on.","commenter_a":"Differences are fine but you should not say that you are all so much better than the Republicans. I will not be voting for a person who thinks they are better than others!!! Shame on you","post_message":"“I think it’s time for us to have the kind of spirited debate that you deserve us to have. We’re so much better than the Republicans, but we do have differences and you deserve to know what those differences are.\""},{"comment_id":"1167989119901455","commenter_b":"How do we know that it is a woman makig the comment?","commenter_a":"Looking his wife in the eye and saying thank you when she hand him a coffee might be a good step towards rebuilding intimacy.","post_message":"\"Honestly, I want to feel that we’re not just roommates—that we’re not just waiting for the kids to grow up so that we can move on.\""},{"comment_id":"10152628178977016","commenter_b":"Brainwashed female.","commenter_a":"I sympathize with her feelings, but do believe that never including those with whom we disagree in any discussion only solidifies the differences. Perhaps something of event speakers' words sank into W's cranium. Perhaps his presence will help some haters think twice about their positions.","post_message":"Civil rights movement leader Diane Nash calls former President George W. Bush's attendance at Selma anniversary \"an insult to people who believe in nonviolence.\""},{"comment_id":"905881252841461","commenter_b":"Frigging Brainless Teabaggers!","commenter_a":"Wait, he's flying to Florida with all that has to travel with the president to give a speech about Earth Day? Wouldn't it be better to do it from Washington via satellite and NOT burn all that fuel getting there?","post_message":"With special guest Bill Nye the Science Guy! #EarthDay"}]
