[{"comment_id":"10153110276422550","commenter_b":"No she has make up in the first picture","commenter_a":"Two different people...","post_message":"'If anyone needs a little motivation to not lay in the tanning bed and sun here ya go!' A 27-year-old mother hopes her graphic selfies of painful skin cancer will serve as a warning for others. Her story --> @webpagelink"},{"comment_id":"528408970683016","commenter_b":"ghetto skank bitch","commenter_a":"They have,gotten away with it for six years and will keep doing it tell they leave the white house","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"10153953951823690","commenter_b":"How can funding settlement building be tax exempt these people are supporting a war.","commenter_a":"As an American, I'm happy to see this. It is long overdue for this to come to light. Being against apartheid SA, then without question supporting Israel is disgusting hypocrisy. That support fuels additional tension between the US and the middle east. It must end and Israel needs to be held accountable.","post_message":"A lawsuit has been filed in a US court seeking to stop non-profit groups from sending billions of dollars worth of tax-exempt donations to support illegal Israeli settlements and the Israeli army @webpagelink"},{"comment_id":"10154166607743352","commenter_b":"Jail needed for sex scum","commenter_a":"Troubled ladies-counseling needed.","post_message":"What sort of school IS this?! Geography teacher is now accused of lesbian affair with teenager after two colleagues 'had threesome with boy'"},{"comment_id":"10153544235856880","commenter_b":"My money is on Donald getting it done.","commenter_a":"Trump 20 16. Yes they will I am business man and I know I would make them pay it. Cost 30 billion","post_message":"Sorry, Donald."},{"comment_id":"10153238831311051","commenter_b":"Typical Americans always thinking they are better than everyone. Have you simpletons ever stopped think why these immigrants come to America? A lot of these Hispanics come to this country for better lives and find work, work that half these lazy ass welfare sucking Americans won't do.","commenter_a":"We need to deport Trump","post_message":"Do you agree or disagree with Donald Trump?"},{"comment_id":"1954618021430775","commenter_b":"It aint over till the fat lady sings,lol","commenter_a":"Mark my words, in future presidential elections, candidates will try to do what Donald Trump is doing.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
