[{"comment_id":"10153244727383352","commenter_b":"such a bitch whore ,","commenter_a":"And In 'Other Breaking News...' Kim Kardashian is laughing all the way to the bank! !","post_message":"Kim Kardashian gets slammed on Twitter for her new Super Bowl T-Mobile ad where she shows off her body while taking selfies"},{"comment_id":"718993818288909","commenter_b":"They're here illegally they don't get rights moron!","commenter_a":"No one is saying we cant police our borders...but we must do so with Constitutionally appropriate actions. After all isnt it our CONSTITUTION that we are protecting, that we are asking out service member to protect with their lives. It makes no sense to me that we are willing to throw out the very basis of our great country because we are so fearful. We must be strong and remember our core values.","post_message":"Trump is keeping his promise! I don’t care how much liberals scream and protest… A NATION HAS A RIGHT TO POLICE ITS BORDERS, ESPECIALLY FROM VIOLENT CRIMINALS!   LET'S get 10,000 SHARES for our President! No Judge Can STOP His plans To Make America GREAT AGAIN!"},{"comment_id":"10155234005228984","commenter_b":"Shut off the money! Mandate Everify with suspension of business & huuuuge fines if caught hiring illegals. No Welfare or any other benefits to non citizens. Proof of citizenship to attend schools! They will self deport! As for DACA? Ok. Let those poor kids who were dragged here as children BUT deport the parents that dragged them here!","commenter_a":"They are pissed off because of our policies but let ne of us cross their broader and see what happenes.","post_message":"WATCH LIVE: Secretary of State Rex Tillerson, DHS Secretary John Kelly and Foreign Secretary Luis Videgaray make statements from Mexico City on President Donald J. Trump's new immigration proposals."},{"comment_id":"1696261590644336","commenter_b":"Why don't you take down your wall and move the migrants in... Such hypocracy!!!!!","commenter_a":"Despicable imposter of the Catholic faith.","post_message":"POPE PUSHING OPEN BORDERS, AGAIN  details @webpagelink"},{"comment_id":"10153006139081602","commenter_b":"I think it would help lessen the burden on other welfare programs, if some benefit recipients were getting educated and coming off programs.","commenter_a":"Better to pay for this than all the bums on welfare and any state run handout that people take advantage of.","post_message":"Two years of community college could now be free for all, according to a plan President Obama is scheduled to propose Friday."},{"comment_id":"10153128765639586","commenter_b":"<3","commenter_a":"Jessica Thompson this is why we cut those things!!!","post_message":"ALWAYS CUT YOUR PLASTIC SIX-PACK RINGS.   PETA fieldworkers found this poor feral cat reminding us all how dangerous discarded plastic & other trash can be: @webpagelink   SHARE to remind everyone!"},{"comment_id":"10153891408869062","commenter_b":"Yeah","commenter_a":"Waiting on PA","post_message":"JUST IN: The Texas House Committee approved a bill to make marijuana legal for adults. It still has a long way to go before becoming law, but what do you think?"}]
