[{"comment_id":"10153294543663701","commenter_b":"Lets here the song about an old woman molesting you when you were a kid.. LMAO!","commenter_a":"@username :)","post_message":"Garth Brooks rocked the Rose City on Sunday! If you missed out, the Moda Center just announced that limited tickets are available for his three remaining Portland performances."},{"comment_id":"10153165727051770","commenter_b":"No to Muslim Migrants..call congress..made four calls today..totally agree..Europe is in chaos..rapes and violence..and the media does not talk about it","commenter_a":"Yes sir, exactly what we need. Thank you for caring for the true Americans.","post_message":"BREAKING: Donald J. Trump calls for a moratorium on allowing Muslims to enter the United States.  \"Until we are able to determine and understand this problem and the dangerous threat it poses, our country cannot be the victims of horrendous attacks by people that believe only in Jihad, and have no sense of reason or respect for human life.\""},{"comment_id":"639736896151349","commenter_b":"That's great and all but how do these women make money now?","commenter_a":"yeah and there'll be some bleeding heart liberal who'll be out fighting for robots rights and defending human trafficking because \"pedophelia is a disease!\" and we \"shouldn't judge\".","post_message":"Experts believe that cyborg prostitution will help ‘clean up the industry’ by reducing sexually transmitted diseases and ending sex slavery."},{"comment_id":"970914179695452","commenter_b":"Shut up!","commenter_a":"Proof that even when your dad is the ex-President and your mom is the future president, family pictures are still a disaster P.S. It is a joke. You all need to chillax!","post_message":"Happy Father's Day, Bill!"},{"comment_id":"953133518031452","commenter_b":"Wow, county officials must be really threatened by gays getting married. We should tie them to chairs, and make them watch gay marriage ceremonies for weeks on end, to desensitize them.","commenter_a":"Go to the gulf and marry on a ship!","post_message":"They just cannot deal"},{"comment_id":"1198334626915656","commenter_b":"Bitch","commenter_a":"@username u need this","post_message":"'Bout time."},{"comment_id":"1240263705993657","commenter_b":"@username Oh Dave, ad hominem?","commenter_a":"NBC's biased information. All gun injuries are required by law to be reported by Dr's and Hospitals. What is under reported is the number of fools believing NBC","post_message":"A researcher believes the number of unintentional deaths of children involving firearms may be under-reported. \"We make make it incredibly easy for anybody who wants a gun to get a gun. And, we don't store them safely,\" he said."}]
