[{"comment_id":"10153580849383812","commenter_b":"I'll be there. Don't know if I'll fit in that box.","commenter_a":"This is just becoming the perfect excuse for some parents to abuse the internet and the kindness of others... What a joke, shame on the parents BY THE WAY, MY birthday is coming up, Im opening an invite to everyone and anyone!!! PO BOX for gifts to follow! LOL","post_message":"Hundreds attend 10-year-old boy's birthday after mom extends open invitation to the Internet when she finds she has no one to invite: \"He was grinning ear-to-ear.\" @webpagelink"},{"comment_id":"10155013190899726","commenter_b":"Yup she's a nobody!","commenter_a":"Yes precious snowflake because you won't be happy until abortion is a Live pay per view celebration #sick","post_message":"'This isn't working, this two-party system'"},{"comment_id":"10154728738598352","commenter_b":"No excuse for those stupid people if that was my mom let me tell u poop would hit the fan they would have the biggest law suit and have everyone fired. No excuse for their stupidity bunch of idiots","commenter_a":"Thank God for Islam. We don't put our elders in these places and forget about them, alhamd lellah.","post_message":"Bedridden grandmother, 86, screams for help for three hours after staff at a dialysis clinic forget about her and lock up for the day"},{"comment_id":"10152960138411051","commenter_b":"Good woman","commenter_a":"I would do that too. He deserved to be punished for that horrible incident. Great mom.","post_message":"As soon as this teen's mother saw the pictures that were being circulated, she immediately grabbed him and dragged him to the police station."},{"comment_id":"587659781407559","commenter_b":"I bet those predestinarians didn't know anything about her past !","commenter_a":"Please just drop out Hillary! Give Bernie a shot!","post_message":"A special moment with a (new!) supporter and his mother in Henniker, New Hampshire."},{"comment_id":"961657090560706","commenter_b":"Ugly woman!","commenter_a":"I am sorry but on this point I do agree with her,but I do not agree with the fact she is on 20k a year,","post_message":"Benefits mum does not understand why we send money to Africa"},{"comment_id":"10153020222586051","commenter_b":"No apology for this little lady. She is too ignorant to understand who made sacrifices for her to have the privilege of saying the Pledge! Maybe she should return from whence her ancestors came from a place where I'm sure the reason they left was because they didn't have the freedoms they came to the U.S.A. to enjoy!!","commenter_a":"After all we all should be praying.","post_message":"The teacher told this girl that she had to stand up for the Pledge of Allegiance. The girl's response: No."}]
