[{"comment_id":"10153911405746509","commenter_b":"Lesbians rock","commenter_a":"its possible that he may have some mental issues :P but seems like a practicing Jewish...!!","post_message":"A 16-year-old girl, who was one of the people stabbed during a gay pride parade last week in Jerusalem, has died, police said. @webpagelink"},{"comment_id":"10152829318850667","commenter_b":"I concur, Josh! Emimen is a great rapper and I don't recall him ever saying the word. I could be wrong, but I don't recall it. I don't like the word used by any person but it definitely should not be said by him.","commenter_a":"You have the right to say whatever you want. The question is, do you have enough respect for others to know you shouldn't?","post_message":"Rapper Chet Haze, the son of Oscar-winning actor Tom Hanks and actress Rita Wilson, says that the slur is part of hip-hop culture and that he has a right to say it."},{"comment_id":"10154566967589369","commenter_b":"She should have got the 11 yrs!","commenter_a":"5 years? That's it? Someone please give her real sentence when she gets to prison.","post_message":"Lethal doses of heroin and fentanyl were found in the body of 14-month-old Annabella Sagstetter last May."},{"comment_id":"10156411867420354","commenter_b":"@username , NO MORE REFUGEES !! I DO SAY NEVER FORGET WHAT THE islamoCRAPS AND obuma HAVE DONE TO AMERICA ! PROSECUTE obuma & killery FOR TREASON !! DONALD TRUMP/CRUZ 2016 ! AMERICA NEEDS PHOTO I.D. TO VOTE , IDENTIFICATION , FOOD STAMPS , ETC ! TERM LIMITS WITH NO BENEFITS ! DRUG TEST ALL FED. EMPLOYEES AND THOSE COLLECTING WELFARE ! ABOLISH ALL GUN FREE ZONES ! IF YOU AGREE PASS IT ON !","commenter_a":"Political correctness=Nazism","post_message":"When you see the so-called \"politically incorrect\" sign, you'll instantly understand why liberals' heads are exploding...and will want to buy a cupcake from these folks."},{"comment_id":"1397527680309345","commenter_b":"Give Facebook some competition techies.","commenter_a":"YOU BETTER LOOK AT THE FACTS ,TRUMP ALLOWS IMMAGRANTS IN ,BUT IT HAS TO BE LEGALLY ,WHATS WRONG WITH THAT ,AMERICAS SAFETY FIRST","post_message":"PISSED Off Facebook CEO Sends Giant YOU To Trump Didn Expect THIS To Happen Moments Later!"},{"comment_id":"10152710610321051","commenter_b":"Many Americans dont' have enough to while this couple seems to be eating too much - thanks to benefits they are not entitled to!","commenter_a":"Wrong!!!!","post_message":"A couple that lives off benefits because they’re too obese to work got another gift from taxpayers."},{"comment_id":"10153278742792144","commenter_b":"Foolish woman do you really think you can reason with a wild animal? Enough already.","commenter_a":"Very irritating.....good for the bear. There was no reason to pepper spray when she could have gone inside.","post_message":"HAHA."}]
