[{"comment_id":"10153310258470090","commenter_b":"www.thefightforjustice.com Former bank employee goes head to head in the courtroom against bank and lawfirm-10 years and counting- Many exposed and the list is growing!","commenter_a":"Hideously profane y","post_message":"All of the above. We want to know WHY you don't want another Clinton in the White House. Tell us here: @webpagelink"},{"comment_id":"1308410459173725","commenter_b":"@username, you are spinning it. I said he can't run it, but he certainly doesn't have to give up ownership. Then tell me how the Clintons were able to run the Clinton Foundation when Billy was in office ? Yeah they found something in Benghazi. They found four dead Americans that pleaded for help. They found gross negligence and mishandling of top secret information on Lying Hillary's emails. Are you saying that's not true ? Name one significant contribution that Lying Hillary has done on her own besides being first lady and riding her husband's coattails a husband who she couldn't even keep happy so he found his entertainment elsewhere. Not to mention a husband that was impeached. She is filthy rich, she take huge donations from corporations, her Clinton Foundation is under investigation for taking money from known terrorists countries, she voted for the war we are in now. ...","commenter_a":"It is an abuse of tax payers dollars and highly unethical for obama to give Hillary a ride on Air Force One. She should campaign on her own dime just like Trump has to. Do you think obama would give Trump a ride ? Hell no he wouldn't. So why should Hillary get a ride ?","post_message":"President Obama plans to give Hillary Clinton a lift on Air Force One to their joint appearance, and Donald J. Trump is asking a question that has a complicated answer."},{"comment_id":"952967998077006","commenter_b":"Ahhhh...NOOOOOOO! AMERICA WILL NEVER!","commenter_a":"I'm paying less thanks obamacare!","post_message":"Republicans won't ever admit the success of Obamacare. As with all of the Presidents winning policies, they prefer to ignore facts and spread lies."},{"comment_id":"750259701739305","commenter_b":"Until the GOOD cops police OUT theBAD COPS, these arrogant ignorant asshats will continue to terrorize our citizens. NO EXCUSE!!","commenter_a":"I wish he'd get fired!!!!!","post_message":"His tirade was caught on tape."},{"comment_id":"1069894739689449","commenter_b":"That is a bunch of hog wash. It is not about keeping your knees together til you are married. If a girl and a boy want to have a sexual relations then they can buy their own rubbers or birth control pills. Since we have Obama Care I am sure birth control pills will be covered. So even the children who have gone to college can have sex responsibly now that parents can keep their kids on their insurance long after they graduate from high school. If these youngsters can afford smart (cell) phones they sure as heck can afford birth control pills. .","commenter_a":"Amen to that","post_message":"\"Ladies, unless you want the stain of guilt upon your soul, keep your knees together until you're married and put Planned Parenthood out of business.\""},{"comment_id":"10157096795925551","commenter_b":"Go back to sleep old woman","commenter_a":"She has shown her bias...can't be trusted anymore","post_message":"Well, imagine that."},{"comment_id":"10153235408755090","commenter_b":"Can anyone tell me why Hillary wants to be President?","commenter_a":"Another \"heir apparent \" to the presidency.","post_message":"One question: Why don't you want Hillary Clinton to be president? Tell us here: @webpagelink"}]
