[{"comment_id":"10152784811780927","commenter_b":"Why give a s**t? You act like he is relevant!","commenter_a":"Why do we care what he thinks?","post_message":"Another rock star goes on the attack against conservatives."},{"comment_id":"1292616690749798","commenter_b":"I need to learn how to do that. You never know when you need to live stream.","commenter_a":"This was one smart woman! Her cool during this was amazing. Streaming it to FB was really smart. If the cops took her phone the record was still there. I hope others follow her example.","post_message":"The aftermath was streamed live on Facebook for the world to see."},{"comment_id":"719541998236378","commenter_b":"Happy birthday keesh!!!? Love you and am so proud of all of you Guy's","commenter_a":"40,000 likes, is that going to help?","post_message":"Putin is firing on all fronts after news of a Russian plane being shot down. Russia is doing good work. Can we get 40,000 ‘LIKES’ for Putin bombing Syria?"},{"comment_id":"10153400314832183","commenter_b":"...and he thinks that threat is going to deter anyone from voting for Bernie. It makes me MORE determined to vote for Bernie. Don't let the door hit you in the ass Bill.","commenter_a":"PLEASE, vote for U.S. Senator Bernie Sanders for president so O'Reilly will go!!","post_message":""},{"comment_id":"10157375742785389","commenter_b":"The elections are rigged, may not be ACORN this time, but the MEDIA. Republican elite want to protect NAFTA, TPP and Global trade to keep filling their pockets with billions, Wall Street billionaire CEOs all from both parties are campaigning with criminal Hillary because she will protect Global trade agreements.. TRUMP is the only one who will bring back manufacturing, take back our technology which is now stolen by China as it was by Japan 50 yrs ago,stop letting immigrants invade this country, and stop giving money and our military lives away to build up foreign countries, Honestly, I don't care what he says or how he does it , because the USA has no more chances.WHERE IS CRIMINAL HILLARY GETTING JOB # 1 FOR 1 UNEMPLOYED AMERICAN ???? ,.....AND IT BETTER NOT BE A GOVERNMENT SERVICE JOB,PAID BY TAX MONEY TO CREATE BIGGER GOVERNMENT AND NO REAL UPWARD PROSPERITY ...","commenter_a":"Get used to it. Obama is supporting these terrorist organizations and Hillary will follow!","post_message":"\"We have an existential threat against the American homeland and the American people because of what this administration has done.\" Oliver North said the $400 million given to Iran will not only support terrorism, but will help Iran and North Korea move closer to creating nuclear weapons."},{"comment_id":"10155187026858984","commenter_b":"I caught the statements that's she was making. I'm glad she wasn't as blatantly shoving her opinion down people's throats as Beyonce did. I applaud her professionalism but I still find her and her music repulsive. On a separate issue, how does get eaten alive for her unoriginality? It's like she can't decide who she wants to rip off more, madonna or David Bowie.","commenter_a":"Anyone who knows the meaning behind This Land is Your Land knew she made a political statement. I don't think that was very many trump voters, though. Her subtlety is what was appreciated by them because they likely missed it and it allowed them to enjoy the show.","post_message":"Of all of the things Lady Gaga could have done during her Super Bowl halftime show, this was perhaps the most shocking... and the most unexpected."},{"comment_id":"10152992527222507","commenter_b":"You talk to your momma like that with those cocksuckers?","commenter_a":"That bitch been a racist with that shit on top of head suppose to be some hair looks like a hat","post_message":"Explains so much"}]
