[{"comment_id":"617240545084050","commenter_b":"Gabe Monfried","commenter_a":"She was checking up on Bill","post_message":"It was really strange when Hillary was missing from the podium last night. Not very presidential!"},{"comment_id":"10153194187981600","commenter_b":"It;s not an assault rifle as assault rifles are illegal,","commenter_a":"So, not really sure why there is this distinction of it being an \"assault rifle\" and not...\"He pointed a gun at the officers\"???","post_message":"Officers heard the distinctive sound of a rifle being charged or a round being chambered, they reported."},{"comment_id":"10156397443350725","commenter_b":"Proud of my home state for going for Trump!!","commenter_a":"Trump is a chump. As soon as he gets out of the way we can get about having a serious candidate.","post_message":"Thank you SC! We will NOT let political correctness get in the way of keeping America SAFE! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"10153395852497629","commenter_b":"aSSHOLE NIGGA LOVER!","commenter_a":"I think it's safe to say they are not accusations but are indeed facts","post_message":"The interview is expected to include Dolezal’s first major comments regarding accusations that the she lied about her race."},{"comment_id":"692519350938643","commenter_b":"not even a woman!","commenter_a":"I don't think he should have gotten the award he's not a hero. Give it to someone who has really done something who is a hero. He looks like talks like and walks like a man playing dress up in his mothers clothes","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"10153351260137439","commenter_b":"Go home to your rodent pit ugly woman","commenter_a":"Why did they come to the USA? To bring death? Shame yourself Mother of Satan.","post_message":"@webpagelink"},{"comment_id":"10154035810956130","commenter_b":"I just see this on my feed that's sort of dress I wear to a nightclub in Not gonna put her down as i hate bitchness but maybe she could of gone with something little more elegant and saved this dress for a night out","commenter_a":"Before I read it I'm going to take a guess and say it was other women who were \"shaming\" her Oh I was right, although I wasn't surprised. Said it a thousand times. Women's biggest critics and women themselves.","post_message":"It's unfortunate that women can face sexist backlash from other women."}]
