[{"comment_id":"10153912123821409","commenter_b":"Wow she should be kicked out for that!!","commenter_a":"You signed on the dotted line !! Hate to break it to you . Your job is to protect the freedom of this great nation. To bad you will be in the brig CHILE !!","post_message":""},{"comment_id":"883464781688982","commenter_b":"Research empathy Roger.. Apply it sometime.","commenter_a":"Just want to say that in your standup you talk a lot of trash about white people and shootings if I do recall correctly. So is racism just a white problem but black stand up comics are not. Check yourself before you tell me to check mine.","post_message":"It's not that easy to forget.  Do you think racism still exists? Let us know: @webpagelink"},{"comment_id":"1658190531136070","commenter_b":"Racist unethical cheater!","commenter_a":"This garbage troll shouldn't be allowed to breathe at all!","post_message":"Geraldo Calls The Constitution Bullsh*t And Then Goes On Epic Rant Slamming Americans  Kick him off Fox. He doesn't deserve to be on the air. Do you think he should fired?"},{"comment_id":"10153770178735736","commenter_b":"Hillary is Hillary, not Bill. Duh!","commenter_a":"She should resign.","post_message":" Trump comments in 2005  11 years ago were made when he was a Democrat. The hypocrisy of Hillary Clinton to say Trump does not belong in the White House when her husband defined this behavior."},{"comment_id":"10153898443761770","commenter_b":"In GOD we TRUST....Vote for Trump/Pence 2016..Hillary hate guns because dangerous to the toddlers!!! But In the GOD's name why she's ok to rip out the unborn 9 months in the womb...and Hillary sharing our national classify to others and exchange to pay her ...GOD bless American people to support Trump... because only Trump/Pence can stop government corrupt, bring job, boom the economy, protect our family and help veterans, military and make America safe and great again... that Hillary been extremely careless to protect our national security....and Trump will stop Hillary accepting money from foreign country that treat LGBTQ and women like animal... and Hillary call all my Africa-American friends \"SUPER PREDATOR \" and insulting all my Latinos & Latinas \"NEEDY & BOWL of TACO\"","commenter_a":"Who gives a damn","post_message":"Nate Schmidt of the Washington Capitals sits down with David Hookstead to talk about life as an NHL player."},{"comment_id":"10153930448466323","commenter_b":"And you are a very unattractive white woman","commenter_a":"She is a fat, untalented negro who should have made the best political statement by boycotting the super bowl... It's disgusting that stupid entertainment pays people so much while so many are suffering... My husband saves lives for a living and paid way more for his education than any of those people and makes a fraction of what they do... All of them disgusting","post_message":"\"This is not some sudden awakening for Beyoncé – she has given millions to the homeless in Houston, her home city, she and her husband Jay Z have bailed out Black Lives Matter protesters in Ferguson and Baltimore. But now she is moving this highly visible assertion of identity centre stage. Her blackness, her femaleness, her pride, her politics, are not some kind of mysterious subtext.\""},{"comment_id":"496956050512713","commenter_b":"THEY SHOULD KEEP WALKING BACK TO THEIR COUNTRY .... IN OTHER WORDS ...... GTFO OF AMERICA !!!","commenter_a":"Feel free to walk back to where you came from!","post_message":"If you don't respect our country, feel free to leave.  'LIKE' if you think they should leave!"}]
