[{"comment_id":"10154777446051336","commenter_b":"she's a prick","commenter_a":"It's disgusting Megan Kelly should shut up and be suspended with her biased comments shut her up! And stop playing Miley Cyrus music in the background! She said she is leaving if Trump wins. Bye Miley!","post_message":"\"The American people have spoken and the American people have elected their new champion.\"  Tonight, Vice President-Elect Mike Pence thanked the American people for his and Donald J. Trump's election victory, before introducing the President-Elect."},{"comment_id":"1606743262959812","commenter_b":"Run cock roaches run!","commenter_a":"If only","post_message":"WATCH LIVE: Protesters are filling the streets in Charlotte after police say an officer shot and killed an armed man. @webpagelink"},{"comment_id":"984298984944293","commenter_b":"👏👏👏👏","commenter_a":"For those of you patiently waiting on a squirrel update: According to Jeremy \"*UPDATE * the two suspect squirrels have moved into an older squirrel nest in the garden district of the property and decorated the heck out of it. They are eating higher quality squirrel food and are in much better health than the heterosexual squirrels.\"","post_message":"When marriage equality became legal in his state, this man bravely reported from the frontlines of his backyard to see *exactly* what had changed. And it's hilarious."},{"comment_id":"1833633870187083","commenter_b":"Whatever her position, she chose it. I have researched her & she was looking for a meal ticket. Hopefully she knows now the real meaning of money. She has a mouth & 2 feet & she could walk. No matter if there is a prenup & what it says, this bastard is going down & in the end she would probably prevail.","commenter_a":"we have more important things to do with our words and our time--feel sorry for Melania and the Barron--or get our Country back--it's a choice-Can't do both---you people better choose------Bleeding Heart will only go to degree---We have a choice...to allow a Dictator or feel sorry for his family? Cut me a break!!","post_message":"WOW. Melania's face says it ALL! #freemelania"},{"comment_id":"10157276340925354","commenter_b":"Round up every muslim ship them home unless they are legal immigrants that speak english and have a job and no ties to isis otherwise build a wall shoot everyone of them that comes into the u s","commenter_a":"Vote Billary or Bernie for more lies, deceit, corruption,treason, gun control, Homophobia under Islam and 4 more years of obama. Almost forgot no more Country Girls having fun in the water. Cowboys, Liquor Stores, Smoking Marijuana are next. NOTE: Comments protected under the 1st Amendment.","post_message":"VIDEO:"},{"comment_id":"1224337737632979","commenter_b":"I thought it was absolutely hilarious. Maybe the hood rats should have a bit more respect rather than planning their next drug deal.","commenter_a":"If she can't handle her job and behave professionally, then she shouldn't be an educator. Period. Her being a teacher and all you would think she would be able to find another way to get her point across. The way she spoke and behaved was unacceptable. She grabbed that boy and then went on to say racially inappropriate things. She's a disgrace to teachers.","post_message":"Aren't teachers suppose to be the example?  #WSHH"},{"comment_id":"10154514668258701","commenter_b":"So, she thinks it's ok for POC to be racist. I see what she did there","commenter_a":"I don't understand why anyone would be upset by this, I mean hell, give this article a few hours and there will be plenty of examples of white hate towards POC in the comments, I see some already. I don't blame her for wanting to keep her room a safe place for herself and her roommate.","post_message":"\"I do not hate white people. That's not what I screamed in that post. What I screamed in that post was I am eagerly desperate to create a safe space on this campus in order for me to return and be successful here.\""}]
