[{"comment_id":"10152727652141051","commenter_b":"LOL dumb ass bitches","commenter_a":"Wow how sick.could they wait until they got home","post_message":"These two women were chased out of a movie theater bathroom because the security guard thought they looked too much like men."},{"comment_id":"1084559504898393","commenter_b":"It altars your natural hormomes! Explains why there are so many beta bitches running around. Wonder if the artificial hormones affect future children somehow too","commenter_a":"@username 😬","post_message":"Could the pill be altering your brain?"},{"comment_id":"10153142130722235","commenter_b":"Girl/women also have far more uti's then intact men do.. In case you weren't aware.","commenter_a":"It's way cleaner. As a mom of an ADHD child that took several years to potty train and several more to learn to wipe correctly, I don't regret following my Drs & husband's advice.","post_message":"The main reason we have circumcision in the US today is not for the health benefits.   It’s because we’re used to it."},{"comment_id":"10152534767705047","commenter_b":"Revoke their passports and citizenship! Traitors should not be allowed to live here !","commenter_a":"Amen","post_message":"American citizens must not be allowed to fight alongside jihadists, only to then return to the U.S. to spread jihad here.   Sign & Share our petition to protect our homeland:  @webpagelink"},{"comment_id":"1081387115239718","commenter_b":"Ill stick with what my doctor reccommends","commenter_a":"so I should not take medicine and just live with acid reflex? I have been taking Nexium for many years.","post_message":"People who take certain popular medicines for heartburn, indigestion and acid reflux may want to proceed more cautiously."},{"comment_id":"10155026863931509","commenter_b":"she doesnt look that bad for a transgender","commenter_a":"What a beautiful woman our first lady is.","post_message":"First families join hands for a rendition of \"The Battle Hymn of the Republic\" during memorial for slain Dallas officers. @webpagelink"},{"comment_id":"1152177854802243","commenter_b":"She's a POS lire!!! Qualified! Gimme a break!","commenter_a":"I don't believe a word she says. Right now the most important thing to her is more excuses...","post_message":"A young boy asked Hillary Clinton \"What is the most important part of life?\" Here's her response."}]
