[{"comment_id":"1141577959271788","commenter_b":"Then do you forgive slavery?","commenter_a":"I see nothing wrong with it. It is inappropriate to judge a previous generation by the information and ethics of another generation.","post_message":"\"The first thing I thought when I stepped off the train was, 'I don’t belong here.' \"  - Jim Tanimoto, recounting his life spent behind the camp's barbed wire."},{"comment_id":"1238709539473364","commenter_b":"You are one disturbed individual...","commenter_a":"That is a symbol of bigotry and hatred towards gay people, and Chris Pratt should know better than to insult an entire sexuality with this stunt.","post_message":"Actor Chris Pratt spent Easter building a giant cross."},{"comment_id":"911046885608046","commenter_b":"LIKE I SAID, SHE KILLED THOSE KIDS. A BEE?! Get out of here with that mess. Throw the book at her. @username,","commenter_a":"Whatever!! She killed those kids.","post_message":"Two 18-month-old twins drowned in an Arizona canal Friday after their mom briefly let go of their stroller to fend off a bee: @webpagelink"},{"comment_id":"10154753086323967","commenter_b":"He is building a wall","commenter_a":"Come on, guys. Our new president told us this was all a hoax perpetrated by the Chinese. We're clearly in good hands.","post_message":"Unstoppable."},{"comment_id":"955398181243627","commenter_b":"And we will ship them out idiots","commenter_a":"BIGGEST WANKER MUSLIM OF ALL TIME","post_message":"This is only the beginning..."},{"comment_id":"1386022938105786","commenter_b":"Build a wall all around California lol","commenter_a":"Seriously they had to conduct a study?! I think most of us true natives already knew that without conducting the study and it's been like that for years. We have way too many people coming here from other states and something must be done to control the population here; it's really just a joke now.","post_message":"It's official: California is the worst state for drivers. 🚗"},{"comment_id":"1777728085804631","commenter_b":"What she did isn't even funny. He needs to leave if she thinks that little of him. Bitch.","commenter_a":"WTF? I can't imagine getting that upset about shampoo. There has to be other problems.","post_message":"Don’t mess with a girl and her beauty products."}]
