[{"comment_id":"1195188837159645","commenter_b":"Hahaha that bitch pussy on all types of fire😂😂😂","commenter_a":"Shanira","post_message":"Oh my"},{"comment_id":"867849870028244","commenter_b":"I love this video! I can't stand the woman!","commenter_a":"Donald J. Trump should play, over and over, when she said, 'What difference does it make now?' - regarding Benghazi. !!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"373546919515489","commenter_b":"She's retarded.","commenter_a":"I'm so sick of her BS, she needs to just plain go away and leave America alone.","post_message":"Pro-Gay, Pro-Abortion Nancy Pelosi Calls Marco Rubio a Bad Catholic"},{"comment_id":"10153500455846336","commenter_b":"Mr Rubio: While it might be nice to possess 'class', we don't need 'class' as much as we need a 'leader' who has the nerve to say what's on everyone's mind and then do something. It remains to be seen if he can get past the nefarious 'electoral college' that elects the president no matter what the 'popular' 'people's' vote is.","commenter_a":"how about instead of commenting on another persons comments you actually tell us how you are going to fix all the crap wrong with our government, waste and abuse of tax payer dollars, so how are you any better??? so tried of you all","post_message":"Sen. Marco Rubio addressed immigration and Donald J. Trump's controversial comments. @webpagelink (via Fox & Friends)"},{"comment_id":"10155947178415354","commenter_b":"Nail her to the wall!","commenter_a":"Fry her","post_message":"Maybe they can add this as a post-credits scene in Michael Bay's Benghazi movie..."},{"comment_id":"10152814296572377","commenter_b":"Creepy lady","commenter_a":"and Obama has invited them...","post_message":"Geller stands tall saying 'Give Me Liberty or Give Me Death,' even though she is being targeted by ISIS. But they aren't just coming for her she says..."},{"comment_id":"872957136089257","commenter_b":"lol bitch...u aint smart","commenter_a":"Harashi Dang u get this pic? Lol","post_message":"Classic. ~Will  More photos at Afghanistan Combat Footage - Funker530"}]
