[{"comment_id":"10154249719951615","commenter_b":"Oh for real? That's good to hear bro.","commenter_a":"Poor kid. If Mt Oliver Cops are the lead investigators she may never be found. 😢😢😢😢😢😢😢","post_message":"PLEASE SHARE: Brandi Kolas was last seen Feb. 2 in Mount Oliver. She has blond hair and blue eyes, is 5 feet, 7 inches tall and weighs 110 pounds. Anyone with information about her whereabouts is asked to call 911, the National Center for Missing & Exploited Children or the Mount Oliver Police Department."},{"comment_id":"1362078013830431","commenter_b":"Cruz....Kiss that ass.","commenter_a":"Mr. President, Please do not squander this opportunity to put a conservative in the Supreme Court. This is extremely important, we do not need someone who's going to be a straddle of the fence. We have too much anti-American government, anti-Constitution battering happening inside our nations capital and a crossed our nation, we cannot afford to make evening a half step in the wrong direction. Please Mr. President I implore you to please hear my request, my plea.","post_message":"Ted Cruz NAILS it, everyone needs to see this!"},{"comment_id":"10153822220001162","commenter_b":"She needs to die a horrible death","commenter_a":"Her parents must be very proud of how their daughter turned out.","post_message":"BUSTED: The \"Baby Doll\" drug lord, Ana Marie Hernandez, is arrested in Mexico for allegedly running a cocaine pipeline to Chicago --> @webpagelink"},{"comment_id":"10154743139306508","commenter_b":"She's a liar ....","commenter_a":"The funny thing is the same scenario happened in Egypt four years ago with the Muslim brotherhood president Morsi, when someone beside him was telling him what to say and was caught the very same way Pelosi is caught now. I think same same school, no difference","post_message":"She didn't know people could hear her"},{"comment_id":"10153270058159497","commenter_b":"We are all snacks, can't we get along?","commenter_a":"Oh SO SNACKS DON'T HAVE THE RIGHT TO DEFEND THEMSELVES?","post_message":"From our sister publication, ClickHole:"},{"comment_id":"10152889552848717","commenter_b":"Bringing a gun to a bomb explosion? Okay....","commenter_a":"Save natural causes, racism has directly or indirectly been the cause of death to every single black in this country. Ponder that statement for a minute, because it is the truth. If you are black, eventually racism will most likely lead to the cause of your death, whether it is diet, subsequently health, or murder. The degree of oppression will take its toll. Dying of a natural cause is a luxury that few blacks will enjoy, and by natural cause, I refer to old age only. The degree in which we are hated is only mildly expressed in this video. The odd man out is usually hated with a vengeance, and we been tasked with that role since day one. No matter whom we go to war and help this country fight, once the war is over, our citizenship status becomes less than that of the enemy whom we help ...","post_message":"President Obama's nomination of Loretta Lynch to become the country's first African-American woman attorney general is a historic pick."},{"comment_id":"10153315530254203","commenter_b":"Yes,Everywoman has a right to choose.","commenter_a":"Here's one for ya: \"WHAT DIFFERENCE AT THIS POINT DOES IT MAKE!??!?!?!\" (With appropriate accompanying \"toddler having a tantrum\" body language). That's one of MY faves.","post_message":" rights are women rights and women rights are human rights once and for all."}]
