[{"comment_id":"10153313662524342","commenter_b":"No...not white people get away with murder No white lady who spoke nasty to an officer then killed herself ever got a street named for her... Thats just a black thing Just check statistics n wow Stereotypes proven true;)","commenter_a":"White people issues:/","post_message":"Police say an investigation into a mail theft led them to a drug lab   in a Pearland apartment.  DETAILS/MUG SHOTS --> @webpagelink"},{"comment_id":"1333566343323648","commenter_b":"this sow could stand to lose a few pounds.","commenter_a":"That pig in the black shirt ought to be able to hang on for quite a while...","post_message":"When it's all over and they have their ethnic studies degrees in hand, these student activists will never be hungry again."},{"comment_id":"10153717178056002","commenter_b":"why not just peep in their windows?? people are falsely put on these so called \"lists\"","commenter_a":"There already is one of these lists. When a Employer does a deep background check it shows everything. You and I can go on OTIS with the right info on a person like birthday date , ssn and full name you can get all of their info.","post_message":"Two boys from different families are abused by the same woman. See what this mom is doing to protect other children."},{"comment_id":"902522343195539","commenter_b":"Smart pooch 😂😂😂","commenter_a":"Krissy Maree","post_message":"This Great Dane's having a Great Time on a trampoline.  Video: Jukin Media"},{"comment_id":"10153778405133854","commenter_b":"Who cares what she told her daughter","commenter_a":"She is above the Law, Richard Nixon looks like a choir boy \" truth has no meany, Anymore\"","post_message":"Hillary Told Daughter Chelsea That Terrorists Were Behind Benghazi Attack The Night It Happened [VIDEO]"},{"comment_id":"930066070388844","commenter_b":"ANd Every one seems to have forgotten the 11 airliners still unaccounted for close to a year now","commenter_a":"That means trouble","post_message":"UPDATE: Hundreds of TSA badges missing at airports (VIDEO)  @webpagelink"},{"comment_id":"1279380305469095","commenter_b":"Obama said there are 53 states. Everyone makes mistakes. Calm down","commenter_a":"Deployables go vote on the 28","post_message":"LOL! Donald J. Trump just told supporters to go vote 20 days after the election is over.  Video shared by Occupy Democrats, LIKE our page for more!"}]
