[{"comment_id":"1093117534044369","commenter_b":"He should be slut shamed with a fire ant bath!!","commenter_a":"The term 'slut shame' is fucking ridiculous in and of itself, but saying that the judge was 'slut shaming' a rape victim is fucking horrendously disgusting. This judge should be suspended, and whoever made the title for this article should be fired.","post_message":"Holy sh*t."},{"comment_id":"10153305375703984","commenter_b":"She's a liar and possibly more","commenter_a":"She's gonna be flash in the pan, here and gone.","post_message":"Wow. One of Hillary's first moves as a candidate may be the one that kills her campaign...  Do you hope Hillary loses?"},{"comment_id":"1283819971638030","commenter_b":"She's a disgusting wombat","commenter_a":"Looks like big bird. We paid over 2 grand for that dress?","post_message":"The Narciso Rodriguez dress sold out online before the president had even finished speaking."},{"comment_id":"1424826404224494","commenter_b":"Evil creeps just like their daddy.","commenter_a":"Assholes someone needs to hunt them down !!","post_message":"Madonna just called out Donald Trump’s privileged sons and it’s EPIC."},{"comment_id":"644007369123175","commenter_b":"She doesn't deserve the publicity!","commenter_a":"If this is true, I'm done with McD's....","post_message":"Michelle's face is being plastered all over this fast food chain.  Disgusting. We'll never eat here again.  'LIKE' if you think this is WRONG!!!"},{"comment_id":"892479024147549","commenter_b":"The majority of people who act out racism, cry about racism, are the most racist...are black people....you want a safe space where whites won't be around...Liberia...Nigeria...Botswana...many places...but here's the thing...no welfare, no food stamps, no healthcare, no free housing(except in the jungle and you build it), no opportunity for education, ....not one of you would survive in any of these African countries.....because you've been spoon fed for to many generations! I've been to Africa many times, I've spoken to hundreds of Africans.....they will rot and die in poverty because of the black government that runs the countries....take a very close look at who's in charge of America now!!! Except in America the white tax payer affords you the life you don't even deserve.....and now he's giving your life...yes your life to illegals...he's done with you....make the best of it...because that stupid monkey president couldn't care less about you!!!!","commenter_a":"Hell No. There are no more minorities","post_message":"Huffington Post:  Deserve Safe Spaces Without White People  A couple of weeks ago, two students from Ryerson University Journalism program were barred from attending an event organized by the ' BECAUSE THEY WERE WHITE!  @webpagelink"},{"comment_id":"435823689939258","commenter_b":"American demand Muslim relocate back in their country!","commenter_a":"Owner's a coward. I would've enlarged the sign.","post_message":"Unacceptable..."}]
