[{"comment_id":"628439843967466","commenter_b":"Yep criminals think like that That is why she pointed a gun at the polw. @webpagelink","commenter_a":"Because they don't have anyone to be accountable to!!!","post_message":"This is for all of the victims of #PoliceMurder and #PoliceBrutality who never make national headlines in the mainstream media! @webpagelink"},{"comment_id":"913170958829660","commenter_b":"@username Now suck on that and go vote for that murderer her name is clinton.","commenter_a":"No i don't support ending it ,it is a aganist the law they should be lock up.","post_message":""},{"comment_id":"891775107623863","commenter_b":"Michelle isn't a woman for women. Let someone rape one of her babies and watch out!! And of course Bill Clinton may try! I've worked with sex offender's like Bill all my life and they DONT change. They like white, black, Asian, and ALL the girlees. Even baby girls. Bill is a threat to our children. Hillary doesn't stand for the security of our babies... she hands them over to Bill to be F...!!","commenter_a":"two faced .... you heard what what she said when Obama ran for office","post_message":"Michelle Obama did not get emotional for Juanita Broaddrick. Michelle Obama did not get emotional for Kathleen Willey. Michelle Obama did not get emotional for Paula Jones. Michelle Obama did not get emotional for Connie Hamzy. Michelle Obama did not get emotional for Eileen Wellstone. Michelle Obama did not get emotional for Sandra Allen James. Michelle Obama did not get emotional for Christy Zercher. When will Michelle Obama get emotional about all of Clinton's alleged sexual assault and rape victims?"},{"comment_id":"1125870684199336","commenter_b":"If just like to see her run away!","commenter_a":"Please, NO !","post_message":"Would you like to see Michelle Obama run for office one day?"},{"comment_id":"10153397415338984","commenter_b":"Guess you are be careful about who you ask to suck your dick!","commenter_a":"Very old","post_message":"Watch what happens when this bully starts a fight with the wrong guy... he didn't see this coming. The cameras caught this entire fight... Are you happy he got a giant slice of justice?"},{"comment_id":"928696510523431","commenter_b":"She should think about buying a woman's breasts.","commenter_a":"This girl can actually sing. Not sure why she does these things. Pointless, & invalidates her as an artist.","post_message":"Miley Cyrus shares naked tub pic"},{"comment_id":"755708104563829","commenter_b":"And what happened when bush was president. This woman is going to do what's best for our country","commenter_a":"Didn't isis grow under her watch, and lybia burn. Nothing was accomplished while she was secretary of state.","post_message":"There's one candidate who's ready to be Commander-in-Chief on Day One."}]
