[{"comment_id":"10153189013365736","commenter_b":"Please don't insult scum. Scum must be very embarrassed to be compared to HER!","commenter_a":"Of course she did it. Using that poor boys abduction to get her face on T.V. What an evil woman n","post_message":"Kyron Horman's stepmother Terri Horman gives People magazine an exclusive interview about the disappearance in June, 2010 of the 7-year-old."},{"comment_id":"778598825583664","commenter_b":"Don't let Chump Trump know you Clown Car passengers responded to a Megan Kelly article...She is the enemy...Have you Repubics forgotten...Clown Car Rolls On","commenter_a":"Hey Tim, I like the pocket pool!!!","post_message":"Pulls no punches."},{"comment_id":"838151202944602","commenter_b":"Perhaps she is trying to prove that while she is a Loser at every turn...she is no quitter. She enjoys Losing!","commenter_a":"Why do these people waste money to this degree ??? She's got no shot not even remotely possible . I'm just sayin ....what is the purpose of this ???","post_message":"Her presidential campaign just went down in flames."},{"comment_id":"10154316513732235","commenter_b":"douche bag....that's it...you're the guy in school that doesn't make ANY team....because you're a class 1, grade a douche bag.","commenter_a":"These people are so insincere...they make me sick.","post_message":"Paul Ryan just smirked and laughed when asked how many more times he could rebuke Trump's racist ideas without rescinding his endorsement."},{"comment_id":"588870771303502","commenter_b":"He should be deported. Hillary should be charged for her recent money scam","commenter_a":"lmmfao","post_message":"Obama is formally being charged with treason. He is getting it from all angles. Now is our time to push. Should Obama serve time for his crimes?"},{"comment_id":"10153266523095927","commenter_b":"Should have BABY MURDERER on the FRONT of that DRESS!!","commenter_a":"DISGUSTING!!","post_message":"Dress is part of a social media campaign that encourages women to share \"POSITIVE STORIES about their abortion experience ...\""},{"comment_id":"10153257961321162","commenter_b":"They should crucify her.","commenter_a":"Wtf people come on!!","post_message":"DEVELOPING: The bodies of two children, ages 11 and 14, were found dead in a freezer, and the mother is being held as a person of interest @webpagelink"}]
