[{"comment_id":"692519350938643","commenter_b":"not even a woman!","commenter_a":"I don't think he should have gotten the award he's not a hero. Give it to someone who has really done something who is a hero. He looks like talks like and walks like a man playing dress up in his mothers clothes","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"10156240783770389","commenter_b":"It was painful to watch! How annoying is Bernie??! Good Lord!!","commenter_a":"#PresidentTrump","post_message":"Dumb, dumber, and dumbest?"},{"comment_id":"863341973762056","commenter_b":"It's not s scheduled White House speech. It's an impromptu get together organized by Boehner.","commenter_a":"I can't wait until the Republicans find out the Benjamin Netanyahu is not a Christian.","post_message":"Dozens of Democrats are skipping Netanyahu's speech -- including Senator Elizabeth Warren."},{"comment_id":"1792151467673200","commenter_b":"Right a true nasty woman!","commenter_a":"The only \"educational\" facet in Rosie is her nastiness! Period.","post_message":"Rosie O'Donnell says she posted a tweet questioning whether Donald Trump's 10-year-old son is autistic because she found it \"educational.\""},{"comment_id":"10152861965631130","commenter_b":"Is that the END OF YOUR BULLSHIT?? Nothing to do with illegal immigrants. Whooping Cough outbreaks happening ALL over the world. The bacteria is mutating in two ways: one strain of bacteria lacks the primary protein used in the vaccines; the other strain has new proteins. These are found in Europe, Japan and elsewhere @webpagelink","commenter_a":"Vaccines can force the bacteria to mutate, did you know that? 100,000 Americans have gotten whooping cough in the last three years. 32 babies have died. C.D.C. scientists speculate that the current vaccine may be helping to drive the bugs’ evolution. “The fact that this happened so quickly, to the proportions we’re seeing now, clearly suggests some selective pressures …. Vaccine pressure is probably one of them. @webpagelink","post_message":"\"I believe in trusting doctors, not know-it-alls.\""},{"comment_id":"964070213702162","commenter_b":"She is dumb as a fox! Crooked doesnt require brains! Just dishonesty!","commenter_a":"Ha! Ha! Poor Hilary Rotten Clinton!","post_message":"Does anyone know that Crooked Hillary, who tried so hard, was unable to pass the Bar Exams in Washington D.C. She was forced to go elsewhere!"},{"comment_id":"1790088647891885","commenter_b":"Lois did you listen to Hillary's speech . It sounded like she didn't know democrats policies or didn't take thousands from PP and believes in term abortion . Oh she forgot thAt, 🇺🇸Trump🇺🇸","commenter_a":"Hillary calling someone corrupt? Wtf kind of drugs is she on? Her and her so called husband are the biggest, most corrupt crooks ever involved in American politics!","post_message":"Donald J. Trump: \"Hillary Clinton may be the most corrupt person ever to seek the presidency of the United States.\""}]
