[{"comment_id":"408553512676250","commenter_b":"Eat dicks @username, you dumb fat bitch.","commenter_a":"I, a citizen of The UNITED STATES of AMERICA, am calling for the immediate arrest and trial of Barack Hussein Obama for treason, under Article 3 section 3 of the United States Constitution, for aiding and giving comfort to our enemies. If you agree, please copy and re-post.","post_message":"Montana is fighting the Syrian Refugee policy to the end. This is amazing. Can we get 95,000 ‘LIKES’ for Montana?"},{"comment_id":"10153126312326028","commenter_b":"I don't understand Americans... This is the land of the free, right? No one's free! One is not free to speak Spanish and the other one is not free to be stupid. All my respect for the Latina lady, because at least she tries to speak English, thing that doesn't happen often.","commenter_a":"White 'Murican hates a woman that speaks TWO languages and she can't even form proper sentences, or thoughts, in one language..","post_message":"\"I FELT AWFUL\": All Norma Vazquez wanted was to treat her son to some birthday IHOP on her time off from her job cleaning office buildings. Instead she was berated by another patron who told her to \"stop speaking Spanish\" and invoked the Nazis, Castro and Russia.  Watch the entire exchange, which Vazquez's son recorded on his cell phone: @webpagelink"},{"comment_id":"1485464441513680","commenter_b":"ASICK woman needs to be jailed","commenter_a":"Hang them both!","post_message":"What kind of woman could do this to her own child?"},{"comment_id":"10153525959526336","commenter_b":"The mom is a idiot No common sense dumb woman that is it Let lock her up in a hot car and see if she likes it That little girl was soak with sweat even with the windows rolled down a little bit duh","commenter_a":"She took one kid with her and left the other one in the car????","post_message":"Video below shows the moment that officers freed the little girl from the van."},{"comment_id":"1048601445225209","commenter_b":"I know... she has effectively modeled pant suits for old bags of dirt","commenter_a":"So tell me and please be honest what has Hillary done for America like a policy or a law or something that has benefited us you know she's been in politics for over 25 years been the first lady and a senator and Secretary of State what actually has she done for us and don't use her as an example.","post_message":"What our president says matters. We can't let Donald J. Trump's hateful words speak for us."},{"comment_id":"895006600536681","commenter_b":"You gotta wonder where all these 'virgins' are supposed to come from... What a bunch of head-banging fools.","commenter_a":"They might be running out of virgins soon... The LEO that sent them packing, Thank you","post_message":"Officer who was shot by two gunmen outside free speech event in Texas has reportedly been released from the hospital.   The two gunmen are dead."},{"comment_id":"921271484601636","commenter_b":"she spends our tax dollars on all kinds of expensive garbage. the woman needs a clue. race is not the issue. her habits are.","commenter_a":"And didn't they take her law degree away from her? And he apparently didn't even pass the bar exam.","post_message":"Everyone is racist at me!!  Michelle Obama whiny, self-centered commencement speech  @webpagelink"}]
