[{"comment_id":"1267539270005791","commenter_b":"@username , is it all intelligent, competent and strong women that intimidate you, or just Hillary? Hillary 2016","commenter_a":"He can only intimidate weak people... She's the exact opposite of that! #VoteBlue","post_message":"BOOM."},{"comment_id":"10155947178415354","commenter_b":"Nail her to the wall!","commenter_a":"Fry her","post_message":"Maybe they can add this as a post-credits scene in Michael Bay's Benghazi movie..."},{"comment_id":"10153155479946051","commenter_b":"I take it, SHE is a woman who likes to dress as a man.","commenter_a":"Disgusting","post_message":"This soldier has been told point blank: You must wear a female uniform if you want to participate."},{"comment_id":"10154392449762235","commenter_b":"Having a \"break down \"?","commenter_a":"Suicide by cop! The young man didn't comply from the beginning. The young man also shouted \"I hate my life\". It's a shame but you have to comply with the law. It is sad though. \"JUST DO WHAT THE COPS SAY\"!","post_message":"Dylan Noble’s mother has filed a wrongful-death claim against the police department."},{"comment_id":"10155209769476337","commenter_b":"And he destroyed the liberal press...made them look like the fools they are.","commenter_a":"All you hillary sorry pussys get real the Donald is the president deal with it","post_message":"Trump spoke for over an hour, and what an hour it was..."},{"comment_id":"10150870773554999","commenter_b":"@username. And you vote for a killer and a rapist!","commenter_a":"It's become pure entertainment. At this point he's a side show. His numbers are falling. His lies are outright ridiculous. Enjoy that long, long vacation.","post_message":"Donald J. Trump is sticking to his style, even if it meant taking \"a very, very nice long vacation\" after Nov. 8."},{"comment_id":"1541783172796541","commenter_b":"#__ #__ #StopYazidiGenocide #StandforYazidiWomen","commenter_a":"Hire them!! If they can do the job, HIRE THEM !!","post_message":"If your business or organization is hiring and needs someone to get the job done, hire a veteran."}]
