[{"comment_id":"10154686033581336","commenter_b":"Yeah...nothing says 'witch hunt' like having your underlings whack up 13 mobile devices with a hammer...then giving those underlings immunity...then they all plead the 5th except for one who doesn't show up under subpoena.","commenter_a":"Trumps lewd comments must be getting old or too obvious, I woke up today hearing how No presidential candidate has ever threaten to put their opponent in jail, That is because the previous 44 elections there wasn't a candidate with a 30 year crime sheet. God I hate our media.","post_message":"WATCH: \"Mini-Trump\" joins Donald J. Trump on stage at a rally. @webpagelink"},{"comment_id":"10153444075108132","commenter_b":"Pretty sure she's had surgery and botox.. or some serious airbrushing was done. Cripes everyone at 50 has a wrinkle.","commenter_a":"Thank you for picking someone normal and down to Earth without a bunch of surgery","post_message":"Sandra Bullock is PEOPLE's #MostBeautiful Woman! @webpagelink"},{"comment_id":"10155008881554411","commenter_b":"Zeyad Hopkins : @webpagelink","commenter_a":"She didn't spark anger, in fact Saudis didn't care. But @username has a case against Saudi and the USA, and yes I don't like Saudi but let's not start spreading bullshit and hate","post_message":"Just days after Merkel said burka should be banned in her own country."},{"comment_id":"596504240534222","commenter_b":"She is such a liar!","commenter_a":"If Donald would answer the question instead of just attacking Hillary perhaps she could stop having to check and correct his accusations first before actually answering the question in her own 2 minutes. Geez it's insulting that this man shows up to a debate unprepared. #whatajoke","post_message":"RT LIVE STREAM: Hillary Clinton / Donald Trump 2nd Presidential Debate (Courtesy: Ruptly)"},{"comment_id":"1861987967361615","commenter_b":"This woman is sick!","commenter_a":"PLEASE FRY THIS RAPPER!","post_message":"*** Sarah Palin is About to Teach Rapper Azaleia Banks the Lesson of a Lifetime ***"},{"comment_id":"535720006552593","commenter_b":"There's a hot, firery place in hell waiting for this bitch!!!!","commenter_a":"Thank God they found them.","post_message":"A woman in Texas is charged with child abuse after police find two toddlers tied in the backyard of a home, and six other children, ages 10 months to 13-years-old, alone inside. Disgusting."},{"comment_id":"10152857531566491","commenter_b":"Dustin I spelled behaviour perfectly fine. Only AMERICANS spell it your way. And that's not saying much","commenter_a":"WHAT?! maybe influencing spoiled, childlike behaviour!","post_message":"Kanye West is on TIME's list of the world's most influential people #TIME100 @webpagelink"}]
