[{"comment_id":"1139554482745590","commenter_b":"@username our military is nothing aftef these last 8 years and you are truly misinformed and your misunderstanding what is goin on..he wants open boarders to legal immigrants..he doesn't want to stop legal immigration he wants to stop the illegals so we know who is coming into our country...you are the problem..the Lord gave you a brain..please go exercise it..","commenter_a":"It's my first time voting and I'll be voting for Trump today in Arizona!","post_message":"I have proven to be far more correct about terrorism than anybody--- and it’s not even close. Hopefully Arizona and Utah will be voting for me today!"},{"comment_id":"1113947365314026","commenter_b":"@username you piss with the men, but u have no balls,bitch","commenter_a":"PRETTY SOON IT WILL BE A JOY TO VISIT NORTH CAROLINA","post_message":"North Carolina: Land of Fewer and Fewer Progressive Wingnuts by the Day!"},{"comment_id":"1301249303268148","commenter_b":"It wasnt done right then and thats on the doctor, not the procedure, I have spinal epidurals three ot four times a year with no problems.","commenter_a":"Scare mongering!","post_message":"I said 'Yes' to an epidural to ease agony of childbirth ... it left me PARALYSED"},{"comment_id":"10157350648655354","commenter_b":"Even if this woman is a prostitute...does that make it OK for the \"boy's club\"?????","commenter_a":"Wasn't that long ago if a girl did this it wasn't bragged about. It was an embarrassment to herself and family. I'm not that old and I think it's disgusting, and she should be cited for it.","post_message":"+++SHOCK+++ OAKLAND POLICE SEX SCANDAL WIDENS... WATCH:"},{"comment_id":"1697473917208999","commenter_b":"Joel, We have to pull together!! Please help us get Donald Trump to the White House! We started a small group and we are looking to build it up and educate people Pleaseee pop in from time to time?!? @webpagelink/ Please help us unite!!","commenter_a":"Go Trump! Make America Safe and Great Again!","post_message":"WOW! Great poll. Fox News just released their new GOP national poll - THANK YOU AMERICA! Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153204606574342","commenter_b":"If she hate America she need to move","commenter_a":"but, she likes their $$$$$$$$$$$!","post_message":"Ariana Grande says she's sorry for saying \"I hate America\" in a recent video that leaked of her in a doughnut shop."},{"comment_id":"1585670881742175","commenter_b":"DRAIN THE SWAMP","commenter_a":"END THE CORRUPTION!","post_message":"WATCH LIVE: Donald Trump campaigns in Golden, Colorado before he comes to Phoenix."}]
