[{"comment_id":"10154889313644411","commenter_b":"Well hes planning to shut alot of military bases around the world, and hes said hes not paying into nato waist of money he said, at the end of the day we all have to wait and see what hes going to do, you never know he might do a better job than all the other so called politicians in the past.....see how","commenter_a":"He has a point, and America needs a business man to balance the books and help the American people.","post_message":""},{"comment_id":"497783407099419","commenter_b":"Kill the pigs.","commenter_a":"Killing of police officers is WAY UNACCEPTABLE!!!! I am sure that he didn't know if these police officers were empathizing with the protesters but was doing their sworn duty to protect and serve!","post_message":"\"Oh my god. There's people laying on the ground.\" Video from #Dallas via Twitter user @allisongriz includes audio of what sounds like multiple gunshots. @webpagelink"},{"comment_id":"519371271599548","commenter_b":"He did not mention deporting a large number of illegals, he did not mention anything about building walls, that's why he failed to stop the influx of illegal immigrants that we have now. Nothing is impossible, if we want to do it. If we can dig tunnels below, we can build walls above.","commenter_a":"It doesn't sound like trump at all. That's most probably what trump should have said. Everything bill Clinton said has been implemented. He doesn't mention deporting 12 million people (impossible to execute), he doesn't mention building a wall (idiotic and impossible to execute)... So no, doesn't sound like trump at all. This sounds like someone that actually has a executable plan, unlike trump. Not to mention calling a whole nation rapists, murders and drug dealers.","post_message":"Do you think this sounds a lot like Donald J. Trump?   MORE: @webpagelink"},{"comment_id":"572505492946269","commenter_b":"If we could just get a forty hour work week and more than minimum wage so we dont have to work 2 or 3 jobs, life would be a little easier. But the government keeps bringing in illegals and sending our jobs to other countries and we cannot get away from living paycheck to paycheck. It is disguting that the most advanced country makes it citizens live like this. We know it is to control the population.","commenter_a":"Well Hillary is done if she does not win. Without her the path to a 2020 boderless world is stopped dead in it's place. Why oh Why do you think both the Republican and Democratic Party and all the World Cartel Leaders have done everything they can to get rid of Trump for a year? Jeb Bush, the heir apparent is a globalist and so is Hillary. So were the past 5 presidents. With both Jeb and Hillary running, it did not matter who won, the road to globalization was on tract. Enter Trump! Boy did he screw up their plans! No matter what they tried he did not go away! No globalization of America for him! Now as their last hoorah, most all of the newspapers have come out for Hillary and are printing every lie they can about Trump. It is only going to get worse the closer ...","post_message":"This is crucial progress in the push for better workplace policies."},{"comment_id":"10153523758249456","commenter_b":"😂😂😂","commenter_a":"If only they had went to college....","post_message":"Today, 13 people were sworn in as Montgomery Police officers. We'll hear from MPD Chief Ernest Finely, coming up at 6. Let's congratulate the new graduates!"},{"comment_id":"10157246765295294","commenter_b":"Deport this piece of crap!","commenter_a":"He can be charge with a misdemeanor for starting a fire with out a permit","post_message":"An expression of free speech? Or a crime? That's the debate sparked by this man's arrest."},{"comment_id":"10153130429581162","commenter_b":"If prostitution ever becomes legal, you can sign your kids up freak.","commenter_a":"Making prostitution illegal is as stupid as pot being illegal. Regulate, tax and monitor.","post_message":"NEW: NFL Hall of Fame lineman Warren Sapp arrested for allegedly hiring a prostitute after covering the Super Bowl for the NFL Network: @webpagelink"}]
