[{"comment_id":"1280286192042365","commenter_b":"^^^ That is porn for some women...","commenter_a":"Do some actually people make that face when looking at porn?","post_message":"Browsing porn on your smartphone requires more than just anti-virus protection.   Let us help."},{"comment_id":"888422501286356","commenter_b":"I feel bad for whoever votes for Hillary!!! You are asking for our country to be taken over and also death for America!!!! I guess Muslims get there wish of destroying America if Hillary is elected into the White House!!!! She is a traitor just like Obama is!!!!","commenter_a":"Hillary will probably just let me and my brothers die without any help. I trust trump fully.","post_message":"Who do you trust more to protect the American people: Hillary or Trump?"},{"comment_id":"1125703734163047","commenter_b":"'@@username, The same amount as your kind that got arrested for having sex with goats and dogs. Bitch ass.","commenter_a":"George Zimmerman and Dylan Roof both caught beat downs in the same day. Today was a good day.....","post_message":"George Zimmerman was punched in the face for bragging about Trayvon Martin's death! After the well deserved sock to the face he called 911 in a panic #WSHH #GeorgeZimmerman #TrayvonMartin #RIP"},{"comment_id":"1775783539370851","commenter_b":"Idiots arrest them all","commenter_a":"White lives matter more!","post_message":"WATCH LIVE:  Protesters have gathered in downtown Atlanta. We have several Channel 2 Action News reporters with a group that is marching near the King Center and we'll have live coverage starting at 11."},{"comment_id":"10153916227396756","commenter_b":"I'd still prefer to toss Mississippi out of the US. For this exact kind of thing, actually.","commenter_a":"Whenever someone complains about the Confederate Flag i just look over at the ol' Stars and Stripes and think 'guess your times coming too'.","post_message":"After the student senate vote, Mississippi Gov. Phil Bryant said, 'I think college students react a lot emotionally,'"},{"comment_id":"1131244553635264","commenter_b":"#BernieOrBust #BernieAllTheWay #DropOutHillary","commenter_a":"Either way it will be a Democrat all the way to the White House again for another eight years along with a Democratic majority in Congress! Many thanks to the GOP for putting up unelectable candidates election after election,those dumb idiots will never learn","post_message":"Trump must be stopped.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153578637147235","commenter_b":"How much you wanna bet that this nut case is a conservative?","commenter_a":"1st class white privilege on display. We'll get you and your little dog, too!","post_message":"This is insane!"}]
