[{"comment_id":"10154583346243855","commenter_b":"Governor Brown will be on the right side of history!","commenter_a":"Big talk now. Let's see how mouthy he is when President Trump and the Congress cut off funds to states who harbor illegal aliens and otherwise defy federal laws. Can't wait to see CA in an even worse budget squeeze. Talk is cheap when others are paying your bills.","post_message":"Thank you, Jerry Brown! Read the full text of the California governor's anti-Trump State of the State address: @webpagelink"},{"comment_id":"755708104563829","commenter_b":"And what happened when bush was president. This woman is going to do what's best for our country","commenter_a":"Didn't isis grow under her watch, and lybia burn. Nothing was accomplished while she was secretary of state.","post_message":"There's one candidate who's ready to be Commander-in-Chief on Day One."},{"comment_id":"616770258526486","commenter_b":"Feminists and think is a oxymoron","commenter_a":"I swear liberal women are just craving the fashion culture and using \"civil rights\" as a defense for it. They just want to wear a pretty head scarf because they crave culture.","post_message":"www.EagleRising.com"},{"comment_id":"10152858304201336","commenter_b":"Enough is enough time to start locking these mothers up. They think they can just take over everything","commenter_a":"Man why doesn't this stuff happen in areas I'm in? I would never try to shout these people down. I'm going to physically knock them down. I simply cannot stand, nor will tolerate, this level of open disrespect. You have a right to protest, my right to protest in return is my choice, by the means I choose necessary.","post_message":"The protesters did not stop shouting until 100-year-old U.S. Navy vet Dario Raschio spoke up and said, \"Give me a chance. At least let us show a little respect for this occasion.\""},{"comment_id":"1030490090346441","commenter_b":"Time to build a wall around Chicago.","commenter_a":"It's white people's fault...or financial disparity, or whatever else they want to blame all their actions on","post_message":"Chicago Black Gang Member Lured Child From Playground And Executed Him Point Blank You mean #blackLivesMatter protestors are not rallying for this 9 year old boy who was executed by a thug! I guess his Black Life Didn't matter @webpagelink"},{"comment_id":"1231187963602033","commenter_b":"Hell yed","commenter_a":"I was told that these people that get these free cell phones, they get not 1 cell phone but 4 phones each. I asked how can that be? He told me that they have all these different programs and they apply for them all. It's insane. I say stop the cell phones!!!!!! Cannot wait. Such waste of our, the taxpayers money.","post_message":"Boom! PLEASE LIKE and SHARE The President Donald J. Trump page for all the latest Trump related news! 100percentfedup.com"},{"comment_id":"10155704643444199","commenter_b":"No we dont want that woman in office.","commenter_a":"People don't want a woman in office. It's that simple! You can tell yourself and the rest of us that that's not the case. But it is.","post_message":"It the first time in four decades the state electors have broken from the popular vote for president. At least one vote was cast for Faith Spotted Eagle."}]
