[{"comment_id":"10150542434714999","commenter_b":"She will not be the next president. Do you see unicorns at all?","commenter_a":"Who cares!!! She'll still be President.","post_message":"Special Report: Hillary Rodham Clinton exclusively used a personal email account to conduct government business as secretary of state, State Department officials said, and may have violated federal requirements that officials’ correspondence be retained as part of the agency’s record."},{"comment_id":"1015377538499586","commenter_b":"Once they gain a hold in our political system does anyone think they won't usher in Sharia Law? Incompatible with our Democratic Republic!","commenter_a":"When Islam got started it destroyed what was decent in the Middle East. It's incompatible with anything.","post_message":"\"Do you think, fundamentally, Muslims from the Middle East are incompatible with American democracy?”"},{"comment_id":"10154138002220671","commenter_b":"If they dont catch her already","commenter_a":"#NewAge","post_message":"Police pursuing possible homicide suspect in Southern California"},{"comment_id":"10153121291663984","commenter_b":"Not only false , but evil. Send them out of here !","commenter_a":"She has the right to distrust Muslims. Islam is a false religion it's really a terrorist organization.","post_message":"Her critics are attacking her mercilessly for what she said last week, but this Republican is standing by her comments. Do you agree with her?"},{"comment_id":"1039093332808969","commenter_b":"Probably its the smell coming from your stinky vagina bitch...","commenter_a":"Turkish people smell like fart. In the elevator, I aways have to cover my nose 👃 just to bear with their revolting smell. Russia should retaliate.","post_message":"Should be an interesting next few days..."},{"comment_id":"10153648435169705","commenter_b":"Whatever!!!! She's 140 lbs. That's not fat at all. Smfh","commenter_a":"She is definitely not fat","post_message":"Don't ever tell Ronda Rousey what to do with her body."},{"comment_id":"10154064486021509","commenter_b":"Sure they alienate all woman","commenter_a":"A lot of you folks are so quick to follow the narrative. There has not been a debate in years. Just mud slinging and popularity contests. One thing is true though, the only thing the Clintons should be doing is life in prison. What a dirty dirty dirty duo.","post_message":"Could the GOP's opposition to Planned Parenthood at the #CNNDebate be a general-election vulnerability? Hillary Clinton's top aides seem to think so: @webpagelink"}]
