[{"comment_id":"10155424731863812","commenter_b":"Build a wall, a big wall....","commenter_a":"Take our crazy liberals please. Go Trump !","post_message":"Canada's border has seen a surge in people crossing illegally from the U.S., with a 230% increase in people crossing into Quebec in January compared to a year ago. @webpagelink"},{"comment_id":"1099416270154624","commenter_b":"Raged old skank","commenter_a":"Does she really? Or is she lying again...?? Hmm. Lol","post_message":"\"I think that’s fabulous!\" - Hillary Clinton"},{"comment_id":"10153048383476336","commenter_b":"women are beaten in the us lot more than in the arab countries","commenter_a":"She won't get hurt... this guy is not isis ... he is just a scholar. .. she tried to make a point but he was right they promised him more time to get his point clear... they had no patience both because the show time was short just a huge misunderstanding. .. people like him show Islam bad because he wasn't showing Islamic real manners ... he was disrespectful and impatient. ..","post_message":"We may have found the Middle Eastern Megyn Kelly."},{"comment_id":"1253889731373943","commenter_b":"Think I saw her speak recently. Speaks volumes about this creep. Shout this from the rooftops","commenter_a":"Julie Stoddard Laxton","post_message":"\"It was shortly that initial workshop that I realized that this was not what they were presenting it to be. This was a scam.\" - Cheryl Lankford, a military widow who attended Trump University"},{"comment_id":"10153227343366770","commenter_b":"Oh them dumb white people they so racist! Sarc","commenter_a":"She looked so stupid. She clearly made a dumb open statement that wasn't true. Obama told her...it didn't stop her from getting a gun. Brain washed White people. You White Republicans vowed a sworn oath to not give anything to Obama before he took office. A sworn oath. Racist haters. A sworn oath. So don't blame the Black guy You hated and conspired before he took office to hate him. Now you act like you don't understand why he used Executive Orders. Dumb racist White supremist. Shes a NRA crash dummy. Wow....Whites really got no common Sense. Natural born Black haters. Trying to make her a hero...SHE SAID NOTHING NUT GOT SHUT DOWN BY OBAMA FOR QUOTING WHITE MEN AROUND HER. LOL. OBAMA GOT THE LAST WORD.","post_message":"Taya Kyle, the widowed wife of Navy SEAL Chris Kyle confronted Barack Obama Thursday at a CNN town hall event on guns Thursday night."},{"comment_id":"579603902228604","commenter_b":"She must have morals","commenter_a":"Oh the horror of it all! Freedom of speech, freedom of choice, oh now we have her! Pathetic!","post_message":"People are freaking out over what's being said about Taylor Swift today..."},{"comment_id":"1220141934692263","commenter_b":"Most hard working Latino's are no different than any other American that love their country. They want good jobs and a dependable future that illegals won't take their jobs. If they vote for Hillary they know their jobs will be gone. Either by illegal immigration, Middle East immigration or bad trade agreements that will move their jobs overseas. @webpagelink","commenter_a":"Love it.. No only I don't want him for my daughter I don't want him for my sons Trump is bully bully should never be rewarded.. I'm voting blue don't matter who, because Red is to dangerous to give my vote too","post_message":"According to Hillary Clinton's team, the intention of the ad is to show the effect Donald J. Trump's \"hateful rhetoric towards women is having on our daughters.\""}]
