[{"comment_id":"452480794942501","commenter_b":"She's still a bitch! Stfu bitch!","commenter_a":"Fu:-)k her!","post_message":"Should We Ban This Word To Please Michelle?  Comment 'yes' or 'no'."},{"comment_id":"10154408157211926","commenter_b":"You too, think of humanity stupid or hang yourself with him!","commenter_a":"This liar again! So he's preparing another false flag?","post_message":"Israeli Prime Minister Benjamin #Netanyahu yesterday accused #France of supporting groups that reject #Israel’s right to exist and call to #boycott it."},{"comment_id":"10153780658736350","commenter_b":"@username I have no clue what you are talking about but let me clue you and those like you in on something .... we wonder why kids are shooting up schools and bully each other to death when all they have to do is look at ignorance like you for an example. Sit behind a computer screen and throw insults around like you are all important. You get on a thread and bash a new born baby and his parents that take care of them selves and don't do anything what so ever to you and the likes of you. Instead of passing over a story you don't want to be a part of you get on threads and be an ugly soul and bully people that are happy for this couple or any couple that lovingly gives birth to a much loved and wanted baby. Since you brought up ...","commenter_a":"People have babies everyday! Women birth children under horrible circumstances... Alone .. In poverty ... How about focusing on that instead of these irrelevant people!!","post_message":"Congratulations, Jessa Seewald and Ben Seewald!"},{"comment_id":"10153546137853352","commenter_b":"Black cop should shoot to kill her ass","commenter_a":"And today in white folks news","post_message":"Tulsa Woman Caught At Funeral Home Cutting Up Face, Hair, and Messing Up Makeup of Corpse Who Once Dated Her Boyfriend"},{"comment_id":"1055104137833836","commenter_b":"Let 'em try! They'll fail miserably!","commenter_a":"Because they welcomed the terrorists with open arms. And because the French people allowed their government to disarm them. They were sitting ducks. Thank God for the Second Amendment. If they could, the gun grabbers would disarm us.","post_message":"Why Paris? Why now?"},{"comment_id":"875104725882610","commenter_b":"muslims are worthless anyway..","commenter_a":"go ahead we will be happy for that!!","post_message":"And Turkey says the whole site will be banned if it does not obey"},{"comment_id":"10154777446051336","commenter_b":"she's a prick","commenter_a":"It's disgusting Megan Kelly should shut up and be suspended with her biased comments shut her up! And stop playing Miley Cyrus music in the background! She said she is leaving if Trump wins. Bye Miley!","post_message":"\"The American people have spoken and the American people have elected their new champion.\"  Tonight, Vice President-Elect Mike Pence thanked the American people for his and Donald J. Trump's election victory, before introducing the President-Elect."}]
