[{"comment_id":"948666735231933","commenter_b":"Wow, no misogyny going on here (heavy sarcasm).","commenter_a":"More from man hating feminist jackasses. Keep your legs shut, or demand the guy who stick his dick in you wears a condom. Not that complicated.","post_message":"Patients would also be required to get counseling on celibacy as a valid life choice."},{"comment_id":"893629520678836","commenter_b":"Hi, what do you mean their own kind?","commenter_a":"Why are they attacking their own kind?!","post_message":"At least 37 people have been killed during a #Saudi airstrike on a dairy plant in western #Yemen."},{"comment_id":"488461684677745","commenter_b":"There idiots ,this woman can handle a weapon and herself ,and shes beautiful to boot","commenter_a":"beside ,in front,behind shes good from any view, wish she was President ,one smart lady !","post_message":"Controversy erupts after this video of Palin surfaces. Sarah is in trouble. She needs our help. Do you stand behind Sarah Palin?"},{"comment_id":"10155066009203493","commenter_b":"Yes that's correct and he's taking out costs that we don't own and can start getting our capital to be spent on a structure that works for AMERICA. As opposed to all of these illegal aliens. No matter what the color of the skin is. I am a dual resident to California and Texas. California is beautiful to look at. The government and legislation there is literally nauseating. Whomever hasn't the ability to actually see the the chaos and the self destruction that the literalistic mentality creates is beyond a stupidity that I can even fathom. I got pulled over for tint on my windows. It cost me over $800 after it was said and done. And the levies are less than desirable. The roads are along the same avenue. However you can get on welfare there with ease and pay for nothing. Citizen or not. And the politicians and ...","commenter_a":"Jerry Springer, I mean Jerry Brown is wasting 3.5 BILLION of our money on a bullet train to nowhere , wake up people ! We are sinking ! Our next fight : MAKE CALIFORNIA GREAT AGAIN!!!!!!","post_message":"BREAKING NEWS: It's a storm so fierce, rescuers need rescuing as a firetruck falls into a massive crater. @webpagelink The frightening scene captured by our cameras on I-15 at the Cajon Pass as the freeway crumbles beneath the engine."},{"comment_id":"10154430644149411","commenter_b":"Wow and the racism starts. Why am illegal cause I have a latino last name? That's exactly the type of ignorance Trump types bring to the table. Also white pride has far deeper roots tied to hatred in this country. If anything you just proved my point. When KKK have rallies it's freedom and of speech. But if latino or black communities have groups such as black panters it an extremist hate group. You people are really stupid because your racism.is exactly what is creating the modern resistance. So keep on hating and bring more peope to my side..what you think after centuries of white dominance we wouldn't eventually get tired of that shit and start fighting back?","commenter_a":"Look here's what it is. The same people that like Trump ate the same people that make Obama watermelon jokes. It's all about white privilege for you guys. What's really behind Trump's popularity is the fear that white people's dominance is being threatened. \"But Ray,\" you'll say, \" there are plenty of minorities that support Trump. \" to which I say, that the US has done an excellent job of scrubbing away people's culture and heritage and whos propaganda has thoroughly brainwashed people into extremely nationalism. Cause guess what there are plenty of white people that are against Trump as well. Face it. Trump's entire campaign is based on xenophobia and white pride may ad well be his slogan.","post_message":"'It's also to show solidarity with all the people he has tried to harass and point out we are still here and not going anywhere'"},{"comment_id":"472553692939711","commenter_b":"No.. She's Stupid.","commenter_a":"There is no way she is that stupid... I don't believe anyone can be that stupid! Her motive is to make ISIS sound misunderstood, to make you hesitate, and allow ISIS to grow. She is like Obama, is helping their brothers is arms, ISIS.","post_message":"I honestly don't even know where to start with this. It is absurd beyond belief."},{"comment_id":"1567244033571398","commenter_b":"Good and take all those bitches from the View.","commenter_a":"Move. That will even make America Greater.","post_message":"ClashDaily.com"}]
