[{"comment_id":"10150636075789999","commenter_b":"Lmao is this satire","commenter_a":"@username remember when we were talking about this at work the other day","post_message":"The tyranny of \"resting bitch face\" is real."},{"comment_id":"10155425307145615","commenter_b":"\"But no use trying to educate them...\" I feel the same way, because after all: 1) This law is not discriminatory. Anti-discrimination law always trumps Religious freedom law, especially when discrimination is not explicitly addressed, as if the case for RFRA laws. If this was an attempted to legalize discrimination, the analogy would be like a man throwing a feather at a door to force it open. It is a sad attempt. 2) This is not religion being forced down your throat. It is religious liberty. Perhaps, it bothers you that a man would be allowed to wear long hair in an office that requires a clean cut, or that the Amish would not be forced to \"drive\" a minimum speed limit, but it hardly qualifies as religion being forced down one's throat, in my opinion. 3) This is merely a copy of the federal law with some of the ...","commenter_a":"I'm tired of Pence and all his follower's trying to \"defend\" him. They're all discriminating bigots!! Plain and simple!","post_message":"Wow!"},{"comment_id":"923712007745578","commenter_b":"They and we need to not bring these people into our countries they can not and will not adapt to our cultures. Has there not been enough proof of that yet.","commenter_a":"Then, 10 infidels need to hunt down the five assholes that did this and, repay them ten fold.","post_message":"A Florida College Student Is Brutally Attacked By Five Muslims On Patrol Enforcing Sharia Law."},{"comment_id":"10153758333227217","commenter_b":"A loose federation or republic please girls. also please get rid of our constitutional monarchy.","commenter_a":"Oh No nae anither ane","post_message":"Will there be a second referendum on Scottish independence? \"As far as I'm concerned, the Scottish people had their vote - they voted in 2014 - and a very clear message came through,\" says new PM Theresa May. #Indyref2"},{"comment_id":"1036949889659355","commenter_b":"Mother fucker that shot him should be shot","commenter_a":":(","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"1417299944952004","commenter_b":"They are illegal immigrants. Reagan granted amnesty in the 80's and it was to be a one time thing for those already here. Settled once and for all. But they keep coming. And this problem is not just from Hispanics although they make up the majority of inflow. If they couldn't come legally then they shouldn't be here. People have been coming legally for 100 years (like my father and his parents). No excuses. They are breaking the law and need to be deported.","commenter_a":"All he has is big ego","post_message":"Dude! Really??!"},{"comment_id":"10153583167657623","commenter_b":"Tyler Hart","commenter_a":"Christine Striano","post_message":"A derailed train is blocking a number of intersections in Randleman after a number of train cars went off the tracks."}]
