[{"comment_id":"537541949759320","commenter_b":"She needs to go","commenter_a":"Love you Judge!","post_message":"“As the world comes crashing down around her - Hillary Clinton in panic mode - displays what kind of president she would be. One who simply can't cope, can't take the pressure and would be a danger to this country.”  Judge Jeanine Pirro slammed Clinton for lashing out at an activist while on the campaign trail earlier this week. @webpagelink"},{"comment_id":"10154194496471336","commenter_b":"I don't know about you, but I can read and retain two stories at a time!","commenter_a":"Amazing how this makes news in Canada while 4 people including 2 Canadians are being held hostage by ISIS in the Philippines!","post_message":"VIDEO: Things heated up quickly at the New York International Auto Show when a Porsche 911 Turbo caught on fire. @webpagelink"},{"comment_id":"10156516063715206","commenter_b":"Trump is a pig and she stuck it to him with class.","commenter_a":"Watch yourself here on the video without sound even...you come off snobbish arrogant and grumpy and that is exactly what Trump meant by your face. You are well spoken, but you are not a happy person obviously. Not one smile! Mostly grimace. As to your subject matter-good for the blows to Hilliary and putting Christie in his place. But your arrogant head bobbing when talking about meeting foreign leaders etc. is just overboard. You better get on board with Trump, only the media and establishment hate him and are tryin their best to convince audience that he is hated. VOTERS want him!!! Voters love him!!!","post_message":"Putin won't listen to more talk. We need to show him there's strength, leadership, and courage on the other side. Pitch in $3 to rebuild America's role in the world.   @webpagelink"},{"comment_id":"10153744058143132","commenter_b":"She's Still A Douche!!","commenter_a":"Doughnuts? I thought she smelled like Dalmatians.","post_message":"You can finally relax, Ariana Grande's fragrance ad is here."},{"comment_id":"10152573206214071","commenter_b":"You are correct @username people like Sarah Palin and her lambs cannot be fixed.","commenter_a":"Go a way!!! Don't want a dumb president like that!!","post_message":"'Murica is hyped!"},{"comment_id":"775477502501275","commenter_b":"I agree with Mark Colwell.one muslim won't go against the other.they are all for crap..","commenter_a":"Gee, really, and what would they do if he made them angry? Another Dem moron speaks in defense of her Beloved Leader and what she says is as stupid as they both are. How do these people get through even elementary school being this dumb?","post_message":"And this is what Democrats think about terrorists... #facepalm"},{"comment_id":"683548041835774","commenter_b":"Let them go home!","commenter_a":"Don't like Halloween, keep your children & yourselves in the house with the lights off....","post_message":"Halloween has been banned in this state as not to 'offend Muslims'. This must be some kind of joke. They can't stop us from celebrating. Will you celebrate Halloween regardless?"}]
