[{"comment_id":"458641870995513","commenter_b":"Can't stand this idiot...she has always been a crude, rude, big mouthed jerk. I don't find her humor funny, never have and never will. She does things like this just to try to be relevant and she will never be relevant. Hopefully she will also leave America with the rest of these so called celebrities if Trump gets elected.","commenter_a":"Idiot!!!!!","post_message":"Sarah Silverman is a _____________."},{"comment_id":"1190272557692172","commenter_b":"I noticed, I don't believe I have ever before seen this. You can tell, they are sooo far distanced from our so called leader, lol. How is he allowed to carry on???","commenter_a":"In Obamas mind 9/11 didn't happen either. This man is a nut. Kick him out before he destroys this country. If you didn't know he was crazy before now, here's proof that he is. Pure old mean and crazy. America Please wake up. You can't be this brain dead.","post_message":"Somehow, Pentagon leaders don't seem too convinced..."},{"comment_id":"10152875626591051","commenter_b":"Yep.. she should have her vehicle towed for parking in the handicap spot. That will give her an attitude adjustment real quick!","commenter_a":"The American Disability Act will allow the police to fine this nasty man. I'd call the police. Let them handle him.","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"10153537073428352","commenter_b":"Lol she is a freak","commenter_a":"Still dont see why he should loose his life over trafficking drugs, after all he didnt commit murder. I hate indonesia and its stupid laws","post_message":"‘My life is a perfect example of an absolute waste': Andrew Chan’s haunting letter to schoolchildren around the world, warning them about the dangers of drugs"},{"comment_id":"10155063304006350","commenter_b":"She's 100% right. She's a true narcissist, there would be no room for a child.","commenter_a":"not everyone is and that's totally fine. I hate when people keep asking childless women and insisting. LEAVE THEM ALONE!","post_message":"One role Oprah Winfrey insists she wasn't suited for: motherhood."},{"comment_id":"10152818238035927","commenter_b":"LOL! Funny..I've never seen a Good Looking Gay Couple...Lol!","commenter_a":"How can this be a gay Marriage? The one on the right looks like a man!","post_message":"This Ohio judge may take some heat for his recent decision on gay marriage ..."},{"comment_id":"1207587629262246","commenter_b":"Yeah they're adorable haha, the way they move :D","commenter_a":"@username they are so cute lol","post_message":"<3 penguins Watch the full video here: bit.ly/1Fxpjfk Video by John Downer Productions. Music composed by Will Gregory. Video edited by Matthew Gordon."}]
