[{"comment_id":"1125221904203952","commenter_b":"Wow...you can't judge an entire religion by the actions of a few?!!! wow...where have we heard that before? yet...it goes ignored, until that line of thinking works for the christian cult members....then its supposed to be real........nice one cindy! this is just more proof that there is no such thing as 'GOD'....or if one is up there, he is a mean spirited, vindictive SOB and i want nothing to do with him","commenter_a":"I hope all these co called Christians that praise what has happen have something awful happen to them Human beings were killed it does not matter who or what they were. You poeple should be ashamed","post_message":"This is not how decent people react to tragedy."},{"comment_id":"1357029221003198","commenter_b":"Some more cry babies who need their blankie and bottle and their safety pin get over it!!!! God BLESS AMERICA AND GOD BLESS PRESIDENT TRUMP!!!!","commenter_a":"Like the cops dont have better things to do! Should arrest the little bitch 'barista'!","post_message":"The anti-Trump movement enters Starbucks.  @webpagelink"},{"comment_id":"10152731683061234","commenter_b":"Hey Mary... Go suck some cock","commenter_a":"yes, we the teachers, fire fighters, and police tried to tell you all! He is a liar and a crook and a bully","post_message":"Gov. Christie is probably hoping his 2016 presidential aspirations don't hinge on New Jersey voters. That's because a new Rutgers-Eagleton poll shows most Garden State voters believe he's a poor fit for the Oval Office."},{"comment_id":"10153460035986545","commenter_b":"Dana Cobb was this you/ hahaha","commenter_a":"Terry Jetton @username","post_message":"A 911 call came in from a neighbor who heard “screaming from a house about someone having a gun,” according to Great Falls Police Department notes from the call, but it turns out the family inside was just seeing the latest horrors to befall Rick, Carl, and the gang."},{"comment_id":"1260234220691789","commenter_b":"We don't care anymore you protested us to death.","commenter_a":"UI hope these idiots Freeze out there in MN","post_message":"LIVE NOW: Protest against Trump's immigration order happening in Minneapolis, Minnesota. STORY: @webpagelink"},{"comment_id":"10153996640170326","commenter_b":"Illegal aliens have Constitutional rights?","commenter_a":"Why is it every time Donald gives a semi sane speech, the media says he's pivoting? How many times is this now? His speeches are the same old thing. I'm going to build the wall. I'm going to ban Muslims. I don't care about constitutional rights. I will trample over all those that oppose me. I will be ruler of America!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10152608656372894","commenter_b":"Women also cheat with their hearts minds and bodies too soooooooo","commenter_a":"The pic of him with the female outside the car looks like he was taking a pic with someone ... Ppl have cousins sisters groupies fans and friends that they don't sex !!!all these bitter broken hearted ppl jumping the gun obviously wasn't nothing serious he joking about it on Twitter .... Buuuuuut carry on","post_message":"Was Nick Young Caught Creepin' on Iggy Azalea in the Car SHE Bought Him for Christmas? [Photos]"}]
