[{"comment_id":"1201604966547026","commenter_b":"Mortified to be in the vicinity of a penis? Why? You wouldn't be mortified surrounded by vaginas. Why is one suddenly more shocking than another? There's probably at least one lesbian I a crowded changing room and there's a good chance that the transgender woman prefers men. I understand being on guard I do. But not why a bit of dangling body parts suddenly makes that person mortifying to be seen by.","commenter_a":"Ok, I'm sure I will be shot down for this. Firstly, I don't think anyone likes communal changing areas, certainly not anyone I've ever met. I don't think the general issue with this is because you are transgender, although that puts a different slant on it. I don't think many people are happy getting their wobbly bits (of whatever kind!) out in front of strangers in a changing room. I'm sure you've experienced a lot of challenges in terms of getting where you are today and feeling comfortable in your body. I'm sure you have faced threats of and maybe actual physical violence. What I think you may need to bear in mind is that you don't know the 'journeys' of the other changing room users. Maybe they have experienced sexual violence. Maybe they have massive hang-ups about their body for whatever reason. Or whatever. Maybe they are religious. Maybe ...","post_message":"Four things I do to survive the gym locker room because I'm trans. - Parker Molloy"},{"comment_id":"712988442225067","commenter_b":"aint she pretty..i would rather kiss the south end of a north bound mule...","commenter_a":"My God that's one ugly broad she has more rinkles than a road map","post_message":"Like if you agree."},{"comment_id":"1362078013830431","commenter_b":"Cruz....Kiss that ass.","commenter_a":"Mr. President, Please do not squander this opportunity to put a conservative in the Supreme Court. This is extremely important, we do not need someone who's going to be a straddle of the fence. We have too much anti-American government, anti-Constitution battering happening inside our nations capital and a crossed our nation, we cannot afford to make evening a half step in the wrong direction. Please Mr. President I implore you to please hear my request, my plea.","post_message":"Ted Cruz NAILS it, everyone needs to see this!"},{"comment_id":"1811602825768086","commenter_b":"@username they voted for TRUMP because Hillary is lying criminal that should be locked up","commenter_a":"not surprising.... the KKK IS a dem organization so it makes perfect sense that they would be able to get the uniforms.","post_message":""},{"comment_id":"807827122679666","commenter_b":"@username I think that the Muslims that really care must get out the message open the Mosque no more secreats or hit the F g road and go home two sharia law","commenter_a":"I'm so sorry for any Muslim reading these comments. Truly. People are so horrible. I can't belive I identify as a Republican along with this people. You are welcome in my world.","post_message":"Ban all Muslims? Seriously, Donald J. Trump? #GOPDebate"},{"comment_id":"10153206037935399","commenter_b":"Even if the fight is with a women","commenter_a":"Just like all of the allegations about his false claims about the Falklands and being at the suicide of the JFK witness etc..........","post_message":"O'Reilly isn't one to go down without a fight."},{"comment_id":"1194058434020542","commenter_b":"Coulda, woulda, probably shoulda.","commenter_a":"Thank you, Bernie Sanders for finally bringing unity to the Democratic Party!","post_message":"This moved us to tears... what a moment!"}]
