[{"comment_id":"10153759226208188","commenter_b":"At least the governors are smart!!! Get a clue Obama!","commenter_a":"Amen!!","post_message":"UPDATE - 17 states now: The Republican governors of Maine, Nebraska, Texas, Arkansas, Arizona, Indiana, Louisiana, Mississippi, Massachusetts, Ohio, North Carolina, Wisconsin, Georgia and Illinois joined their counterparts in Alabama and Michigan in saying they would no longer help settle Syrian refugees. One Democratic governor, Maggie Hassan of New Hampshire, joined them in rejecting Syrian refugees."},{"comment_id":"1002116393141873","commenter_b":"I wonder if Muslim women can cover their faces at protests with the new anti-mask protest law?","commenter_a":"Does this mean people can wear the banned Anonymous mask to the citizenship oath ceremony?","post_message":"Developing"},{"comment_id":"1229126323813780","commenter_b":"Reaz Tiths tell us what @username has quoted about that book of peace.","commenter_a":"Islam does not teach us to kill others. But in real it is a religion of peace, although some are killing innocent Non Muslims in the name of Islam. What a shame! Islam teaches us to respect others beliefs & not to insult them for their religion. This is the Islam I've been taught","post_message":"'One child said a Muslim prayer and was spared, the other was killed'"},{"comment_id":"10154246472810695","commenter_b":"I thought poppies grew from the earth","commenter_a":"Plz worry about the heroine statistics that are rising and rising. And stop giving people life in prison for a plant that grows in gods green earth.","post_message":"This family-friendly Easter event took a pretty surprising turn."},{"comment_id":"10155928923344199","commenter_b":"This is the best.","commenter_a":"Breanna Barrick","post_message":"'Church, singing and sex:' That's what this couple says has kept them together for 75 years! More: via.q13fox.com/Xirhe"},{"comment_id":"545673352289911","commenter_b":"Bitch","commenter_a":"Well the bitch is rich and scared of her own shadow... I will never watch a show hers again","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way. What a disgrace. She needs to deported to the Middle East. Do you think Nicole Kidman is a sell out?"},{"comment_id":"540816769423579","commenter_b":"Don't run 3rd party now. We would get blamed for a Hillary victory. There may not be much a republican party left in 2020, so that would be the time to start a new party.","commenter_a":"I think we should run a third party candidate now!","post_message":"Should conservatives start a third party? Should they begin one now and put it in place for 2020 or Should they run a candidate now? How would they not be blamed for a Hillary Win? Do you have the stomach for bloody politics to drive the final stake in the heart of Mitch McConnell's corrupt GOP? I have an opinion. I may surprise you. I want to hear Yours. Let's keep the name calling to a minimum let's have an actual debate based on Reason?"}]
