[{"comment_id":"869922156376214","commenter_b":"And this chick got her hair pulled and sat on","commenter_a":"This cop is a asshole point gun on kids wtf!! Is wrong with this pig!! His a punk bitch with a badge!!","post_message":"This cop should be prosecuted to the fullest extent of the law, not let off with a loophole. WTF?!"},{"comment_id":"10154251165218984","commenter_b":"He shots he hits he scores, 250bucks for each, thrn charge mexico for the money, sry but see if you can just walk over the border there no you can not, you get arested and jailed asap, but some how the Mexicans and all the others get by Mexicos military hummmmm","commenter_a":"Oh yea Eean, Milo, Jackie, Heather, Cory, Liz, Justin.. Mmmmhhhhm I'm not gonna share on your walls but for those who have children, think of what type of democracy will enable if Sanders or Clinton both Democrat are elected president. To have too share the taxes you earn back for the benefit of others. Don't be naive because a lot abuse the system, which means if you want universal health care and benefits.. The Republican Party has to amend the laws of drug test issued for anyone wanting freebies and living off the cheese the government provides.. Which is I THE TAX PAYER. This revolution crap will end after New York. On another note, Ted Cruz may have a 10 day rant after this upcoming Super Tuesday winning Wisconsin with all delegates.. But Trump will win New York & all the eastern part of nation, and then we're too California! ...","post_message":"This is insane, and it happened right in front of a journalist... Do you think America needs a president with a firm stance on immigration?"},{"comment_id":"865723720214442","commenter_b":"Abortion is murder, and most unwanted pregnancy are related to sin sex with a man they don't love a date of selfish reasons like I am not ready now I am in school or the man runs off or even the man wants her to get one and even beats her.","commenter_a":"There is a planned parenthood in Knoxville that advertises abortions on their website. So why this woman decided to self abort is a puzzle.","post_message":"While attempting to self-abort with a coat hanger, the woman became worried about her own safety. Her boyfriend took her to the hospital where doctors delivered a 24-week-old baby weighing just 1.5 pounds."},{"comment_id":"10153188022605329","commenter_b":"Great, now middle aged people are going to sag in huge pants. Now ass crack will be everywhere","commenter_a":"love them pants","post_message":"FINALLY!! // BuzzFeed Style"},{"comment_id":"10157948531130206","commenter_b":"Lol now only Muslim men beat their girlfriends???? Come on all races n religions of coward men beat n sometimes even murder their wives/girlfriends. Sorry this happened to you. But plz don't try to make it sound like he beat u only cuz he was Muslim......","commenter_a":"This is just sad. I use to have a muslim boyfriend who would always hit me and I left him faster than a rocket ship.","post_message":"Qandeel Baloch was known for her raunchy social media posts that challenged social norms in Pakistan."},{"comment_id":"628028950680040","commenter_b":"Finally intelligent smart women say what the leader of this country needs to say. It's simple as that. They could prevent this attack they chose to be Muslim lovers.","commenter_a":"Yes sir I have many.","post_message":"\"Get a gun. Because this government ain't in a position to help.\" – Judge Jeanine Pirro bit.ly/1UgPEW4"},{"comment_id":"1149506871736008","commenter_b":"You're welcome.","commenter_a":"What an embarrassment this guy is. Shameful. smh....","post_message":"President Obama took a jab at the so-called \"birther\" movement on Saturday night while in Kenya, his father's homeland."}]
