[{"comment_id":"10153706538451680","commenter_b":"Shut the F' Up","commenter_a":"I think it's great that Ghoul-iani and Drumpf both have direct lines of communication open to Russian intelligence, even more so than the CIA or FBI! That will make it easier for them to set up quick and easy direct deposit accounts to collect their paychecks from Putin.","post_message":"By casting the hack as a \"national security issue,\" Giuliani said, Clinton's campaign and Democrats have \"proved ... she's a liar.\""},{"comment_id":"10154091613326491","commenter_b":"@username, being dumb is a choice. Well done. Did you decide to be straight ?","commenter_a":"Stop... you are American or you arent. Quit separating people by what body parts a person likes to sleep with and what color of skin they have... Just stop","post_message":"“When you don’t have data about a community, at times it can seem like the community doesn’t exist.”"},{"comment_id":"10155341100780725","commenter_b":"So put that bitch down","commenter_a":"Obviously she has mental and emotional illness. Maybe people shouldn't be so quick to throw her to the firing squad.","post_message":"The woman accused of viciously cutting open a mother-to-be's womb to steal her fetus was apparently faking her own pregnancy, which gives a clue as to why she committed the horrendous crime, according to a police affidavit ----> @webpagelink"},{"comment_id":"1383799158379801","commenter_b":"I hate that little bitch","commenter_a":"Omg I can't stand her, I saw her the first time (and the only time) on one American news network, I guess she's not on there anymore. Good, she's awful, she's uneducated, and that voice omg....id rather jam an ice pick in my temple than listen to her.....who decided she had a brain or talent was sorely mistaken......oy.......","post_message":"Your move, Tomi Lahren!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1012656692115433","commenter_b":"Is it a female? Lord have mercy she's dog ugly","commenter_a":"Racist woman","post_message":"Apparently Whoopi doesn't care if the DNC rigged the system.  Why? Because it's against a white guy. #DNC2016"},{"comment_id":"10154064486021509","commenter_b":"Sure they alienate all woman","commenter_a":"A lot of you folks are so quick to follow the narrative. There has not been a debate in years. Just mud slinging and popularity contests. One thing is true though, the only thing the Clintons should be doing is life in prison. What a dirty dirty dirty duo.","post_message":"Could the GOP's opposition to Planned Parenthood at the #CNNDebate be a general-election vulnerability? Hillary Clinton's top aides seem to think so: @webpagelink"},{"comment_id":"10153247983639411","commenter_b":"Why so you can kill some hardworking people going to work or school children. Blow yourself bitch and take some jihadists pigs back with you you prostitute. Hope you fry in hell you piece of shit.","commenter_a":"She shouldn't be allowed back into the UK","post_message":""}]
