[{"comment_id":"1173282172788559","commenter_b":"Sick sick woman","commenter_a":"How evil can these people be","post_message":"Oh. My. Gosh. Things just got weird really quick. @webpagelink"},{"comment_id":"10154427590982577","commenter_b":"Shes just a lil woman thang. Ughk. Hillary should be in prison.","commenter_a":"Isn't it funny how she plays dumb to this stuff too? On her 60 minute interview she said she had no knowledge of these emails even though it's all over the news. She plays dumb to every scandal and people still blindly follow this idiot","post_message":"Wikileaks Crashes The DNC   The Clinton campaign is pointing its crooked finger at the Russians as the culprits responsible for hacking the emails of the Democratic National Committee going all the way back to last summer. John Podesta, the chairman of the 2016 Hillary Presidential campaign claims Russian President Vladimir Putin is aiding Donald Trump’s campaign because there is as AP reports  “a kind of bromance going on”.  As if one more fabrication of reality could sway the narrative back to the Democrat's camp. And whether the Russians hacked the DNC emails or if it was the Romanian hacker claiming responsibility known as Guccifer 2.0 really doesn’t matter.  What matters is that now the American people know how riddled with deception the DNC truly is. The political machinery propping up Hillary's campaign is quickly coming apart at the moment she should be dominating. The released 19,252 wiki leaks internal emails that were hacked from seven officials at the DNC have served as a battering ram, exposing a organization laden with deceptive practices on a monumental scale.  Aside from the DNC's obvious favorability of Clinton over Sanders because of her gender and the jabs taken at Sanders religion. The emails detail a manipulation of the media of grotesque proportions. Relegating mainstream media to nothing less than a propaganda machine.  In this email the DNC’s National Press Secretary Mark Paustenbach says of a Politico reporter Ken Vogel “ Vogel gave me his story ahead of time/before it goes to his editors as long as I didn't share it. Let me know if you see anything that's missing and I'll push back.\""},{"comment_id":"1032100616836565","commenter_b":"This Woman is pure Evil.","commenter_a":"hillary maggie mae clinton..........cause the morning sun, when its in her age really shows her age","post_message":"Pro-abortion politicians have ramped up their war on the unborn for 2016. It's up to us to do everything we can to protect them by continuing to build support behind the Life at Conception Act!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb171"},{"comment_id":"685699241620654","commenter_b":"How can \"she\" be a woman with male genitalia!","commenter_a":"I believe that by giving Jenner this award merely shows base ignorance. Women should not be offended, but rather look at the monster joke. A man that has not completed his surgery is woman of the year. What a joke. Gentleman the majority of us would never want to be a man. We are happy with ourselves. I feel sorry for this mockery of a woman and an insult to men in general.","post_message":"Female Marine goes off on Bruce Jenner for winning 'Woman Of The Year' Award. She's right. This is getting so ridiculous its not even funny. Can we get 75,000 'LIKES' for this female Marine?"},{"comment_id":"10153615401338010","commenter_b":"I live in a beautiful city in LA County. Our city sales tax is 10.25 per cent. I voted for this sales increase to pay for the improvements that put my city on the list of one of the best cities to live. Low crime, lush, great shopping, great roads, many services, about 15 parks, good schools and I live in a well kept condo complex where my HOA dues are over 300.00. The only blight I ever see are the smelly, stained mattresses and unwanted cheap furniture that slobs leave next to the more than amble sized trash areas. They dump in the middle of the night bec they're too cheap to pay to have them hauled away properly. My neighbors and I have concluded it is the renters here. They have no stake in keeping up the complex. The HOA pays for the removal weekly. The trash man ...","commenter_a":"Disgraceful.","post_message":"Do you have a discarded mattress on your block? How long has it been there? How many times have you reported it?"},{"comment_id":"10157436737495389","commenter_b":"If you are Gay, why are you voting for Hillary when she wants to bring in millions of refugees that believe gays should be executed If you are Black, why are you voting for Hillary when she defends Planned Parenthood and admires Margaret Sanger, who wanted to abort as many black babies as possible and exterminate the black race because they are like \"weeds.\" Most of those clinics are in Black neighborhoods. If you are a Woman, how can you vote for Hillary when she has buried all of Bill's rape victims under the rug. As an attorney, Hillary also defended the rapist of a 12-year old girl and laughed about it later. She plays the woman-card and acts entitled; implying that she deserves your vote merely because of her sex. How is that gender neutral? If you have are a Miner, Steelworker or have a Factory job, why are ...","commenter_a":"You don't understand. Obama and cronies want Islam here, and Islam is intrinsically radical. It advances their agenda of Societal destruction, \"social engineering\".","post_message":"\"I think if we don't speak honestly and clearly about what's happening, [then] we can't solve the issue.\"  Karen McWatters, who lost her leg in the Boston Marathon bombing, said the President and other leaders can't solve the problem of radical Islam until they're willing to call it what it is."},{"comment_id":"1746275522311169","commenter_b":"Larry, I didn't say \"fire a weapon,\" I said \"purchase and carry a firearm\" Should a gun shop sell a firearm to an 11 year old?","commenter_a":"Back then it was muskets against muskets. Now we have semi autos and the government has fully autos. Seems like we are already behind with the second amendment.","post_message":"#LiberalLogic"}]
