[{"comment_id":"907985779261171","commenter_b":"Wish she would cover up more. Less boobs and rear. Just sayin","commenter_a":"she is incredible and I am so happe for them","post_message":"One-armed shark attack survivor Bethany Hamilton surfs the waves at six months pregnant"},{"comment_id":"1007260792718180","commenter_b":"You can cuck off to bitch","commenter_a":"So----don't sing","post_message":"Hello, it's me. I've been wondering if you think I give a crap what you think..."},{"comment_id":"10152729165306051","commenter_b":"Why , is a pig smarter?","commenter_a":"I am offended that they are catered to. I love pork and will continue to eat it unless my doctor says not to... then I may eat it any way. No religious cult will tell me what to or what not to eat, wear, pray, etc.","post_message":"This publishing house just banned all references to sausages or pigs because they offend certain religious groups."},{"comment_id":"1188852334521434","commenter_b":"These drugs are coming across the southern border.... #buildthewall","commenter_a":"I DON'T BLAME THEM I BLAME DRUG RULES TOO BAD","post_message":"The photos show a couple passed out in an SUV with a 4-year-old child sitting in the back seat."},{"comment_id":"1686987451566043","commenter_b":"@username -- A woman who gets raped didn't choose to have that sex.","commenter_a":"Isn't it great that we have the Government to make decisions about what women can and cannot do with their bodies? I'm so glad we have old, white men who can control our woman parts for us.","post_message":"Indiana Governor Mike Pence signed a bill that bars women from seeking an abortion because the child will be born with a disability, a controversial restriction that is one of the tightest abortion laws in the country."},{"comment_id":"1348467338501928","commenter_b":"Totalbitch","commenter_a":"Fake","post_message":"If you had one word to describe Hillary Clinton, what word would you use? (Be nice.)"},{"comment_id":"1147558291982624","commenter_b":"@username like to talk shit behind a keyboard like a little bitch!","commenter_a":"White on white crime 👀","post_message":"Sick: 26 year old man gets caught trying to meet a 15 year old boy! #WSHH"}]
