[{"comment_id":"385075118347449","commenter_b":"She's not worth two cents the skank","commenter_a":"How about we take oboma's pay to pay for this.","post_message":"This is CRAZY..."},{"comment_id":"4646614632067289","commenter_b":"Need to enforce the laws illegal out of this country!","commenter_a":"Anybody coming into the United States should abide by all laws of the United States for the customs or any other law if not coming through customs legally stay out if you did not come through customs legally get out you have no right to be here illegally that's the law like it or not that's the law abide by it or stay out","post_message":"Do you agree?"},{"comment_id":"10153815226441636","commenter_b":"'@username, I think you and @username are on the same side..","commenter_a":"Western propaganda won't stop! Imagine of a situation if the coup would succeeded?! It would be worst than Egypt, killing of thousands in one night!","post_message":"Warning: graphic mages"},{"comment_id":"10157696214715603","commenter_b":"Lol @username not gonna happen","commenter_a":"Don't believe the media...Hillary's poll numbers are falling faster than Bill Clinton's pants in an Arkansas trailer park...","post_message":"Hillary Clinton forcefully challenged the FBI's new email inquiry Monday, declaring during a campaign rally in battleground Ohio, 'There's no case here.'"},{"comment_id":"1749063398683963","commenter_b":"Shut up- you're just another puppet of clinton. There is no way in hell that trump is more dangerous than that witch Clinton. How much were you paid?! Were you threatened. Clinton must be stopped. Clinton is the threat! She is in with muslim radicals and is going to move toward removing guns from the citizens and let terrorism continue! Give trump 4 years- he will do better than Clinton!","commenter_a":"I wouldn't trust the CIA or the FBI if my life depended on it.","post_message":"'Donald J. Trump is not only unqualified for the job, but he may well pose a threat to our national security,' he said."},{"comment_id":"10153548972367093","commenter_b":"LOL. Go back to California.","commenter_a":"This Texan will be voting ALL BLUE in November! Bigotry and hatred has to end! #voteTxBlue - you #GOP small minded idiots don't remember that Texas WAS a blue state for a long time! LBJ was a Democrat from Texas, and TX was a Blue state until 1994!","post_message":"With Trump as the Republican nominee, Clinton thinks a large turnout of minority voters could put Texas in play... @webpagelink"},{"comment_id":"10155895547455354","commenter_b":"Prayer's for his family and the woman that survived this crime. Where is the FBI, the commander in chief & brother Sharpton?","commenter_a":"There are no words for this outrageous act of hate. Hope they find the black sons of britches that caused this. Praying for the family......GOD BLESS YOU","post_message":"The other person in the car, who survived the wreck, says it wasn't an accident..."}]
