[{"comment_id":"903185543037635","commenter_b":"Noooo... lol. You gals need to stop. Many African men have monster sized d****. That mess ain't fun.","commenter_a":"She's ungrateful","post_message":"Apparently, she didn't see it until after the wedding..."},{"comment_id":"10153850699096955","commenter_b":"She got too big for her britches!!","commenter_a":"All of you hating on Kelly now, probably liked her before she decided she doesn't like trump.","post_message":"SCALIA'S SON BREAKS SILENCE"},{"comment_id":"10154534701938271","commenter_b":"Those seven countries on which the president issued the TEMPORARY ban weren’t picked out by him. They were picked in 2015 and 2016… by the Obama administration. Trump doesn’t even list those nations specifically in his executive order, he simply lists that he’s banning those nations named in the Terrorist Travel Prevention Act of 2015. ---> @webpagelink Trump’s TEMPORARY order specifically states that only refugees from 7 countries with ISIS controlled regions. (Syria, Iraq, Iran, Libya, Somalia, Sudan, and Yemen) ONLY AFFECT 12% OF THE WORLD’S MUSLIM POPULATION","commenter_a":"President Obama issued an order similar to President Trump’s in 2011 in response to a discovery that a known terrorist had entered the United States via the nation’s refugee program. It seems that much of the country’s forgotten about that, though even President Obama, himself, apparently.","post_message":"Obama's statement said he is \"heartened\" by citizens' civic engagement, but reiterated that policies should not discriminate against people based on religion."},{"comment_id":"576179842587911","commenter_b":"Sad. But, Karma is a real bitch...","commenter_a":"No matter how you cut it it's tragic, but in regards to Mr. Harmon's vote against firearms training it calls to mind the expression that there none so blind that do not see.","post_message":"In 2013, he attacked proposed legislation in Maine that would have required gun owners to take a firearms safety course ..."},{"comment_id":"10154976880629614","commenter_b":"Ok","commenter_a":"The car man was driving was a stolen car ?","post_message":"El Monte police are heard firing multiple shots at a suspect tonight in a video provided by a witness.   One man was shot and injured after a slow speed pursuit. His current condition is unknown.   Read KTLA's story here: @webpagelink"},{"comment_id":"1030656443730298","commenter_b":"\"Socialism never took root in America because the poor see themselves not as an exploited proletariat but as temporarily embarrassed millionaires.\" John Steinbeck","commenter_a":"Fight Bernie Fight for us all!!!!!! We need u!!!! The Dark Side of the Force will be strong with this administration.....","post_message":"Trump is assembling the wealthiest cabinet in history — so wealthy that its members have more money than the bottom 1/3 of American households combined. That does not sound like an \"anti-establishment\" administration to me."},{"comment_id":"1439256216084684","commenter_b":"I ONLY HOPE FOR THE PEOPLE OF MASSACHUSETTS SEE WHAT A PHONY LIBERAL DOLT SHE IS.","commenter_a":"Caught Red-Handed! Elizabeth Warren's Big Secret Just Got Exposed for All to See... @webpagelink","post_message":"Is Elizabeth Warren in political trouble in Massachusetts?"}]
