[{"comment_id":"10153598643443812","commenter_b":"Hmmm....will it help us grow perfect women with nice titts?","commenter_a":"Cristian Reyes","post_message":"World's largest atom smasher detects new kind of subatomic particle called the 'pentaquark' -- a new form of matter: @webpagelink"},{"comment_id":"10153067188779312","commenter_b":"your a funny hoe if u wanna live like that so be it","commenter_a":"No junk food or soda Should be like the old days . Meat, cheese, bread, can goods , fresh fruits and vegetables . THATS ALL","post_message":"A Florissant lawmaker wants to prevent the ability to purchase energy drinks with food stamps. Thoughts?"},{"comment_id":"10152821450821519","commenter_b":"I don't read/post/view links. So if you're responding to me on fb, a simple original thought will suffice. Thanks!","commenter_a":"Yes! Agreed. We should punish and penalize those who are responsible for providing employment opportunities for tens of thousands. Everyone in America should work for government. #sarcasm","post_message":"\"It’s hard to see how anyone can possibly believe that the Republican Party, which fetishizes low taxes for the rich above all other priorities, truly cares about wealth inequality...\""},{"comment_id":"1335611113123776","commenter_b":"Give her a Public Horsewhipping too......Fraud","commenter_a":"One down, thousands to go.","post_message":"Former Pennsylvania state Attorney General Kathleen Kane, who came to office on support from gun control groups, has been sentenced on felony perjury charges."},{"comment_id":"1073234599424148","commenter_b":"BESIDES ALL OF LIES, CORRUPTION, ALL FAILED FOREIGN POLICYS, LYING TO AMERICAN PEOPLE, ILLEGAL SERVER IN HER BASEMENT, PUTTING OUR SECURITY AT RISK. RIGGING THE DEMOCRATIC NOMINATION, DID ABSOLUTELY NOTHING AS SECRETARY OF STATE. TOOK MILLIONS OF DOLLARS FROM WALLSTREET. AND BIG BANKERS, TOOK MILLIONS FROM TERRORIST COUNTRIES. CORRUPT CLINTON FOUNDATION. BENGASI, I CAN GO ON AND ON.... WHY I WANT TRUMP... HE DOESNT HAVE TO DO THIS. HE WAS ON OPRA SHOW 25 YEARS AGO, GO GOOGLE IT. SHE ASJED HIM IF HE WOULD RUN, SAME RESPONSE NOW AS THAN. ... 1-I WANT ILLEGALS TO NOT COME INTO OUR COUNTRY, SO A WALL. 2-I DON'T WANT SYRIAN REFUGEES COMING INTO OUR COUNTRY, THEY NEED TO BE EXTREMELY VETTED. WE CAN HELP THEM IN THERE OWN COUNTRY. ( FOOD, BEDDING, DIAPERS, GUARDED. 3-NO ABORTION. HILLARY WILL ALLOW UP TO 6 MONTHS PREGNANT 4-TO CALL TERRORISM WHAT IT IS... AND ACTUALLY ...","commenter_a":"Not even bill","post_message":"Breaking News: Obama using terrorist and Black lives matter to incite riots so he can declare Martial Law and suspend elections. Will you survive? Watch Video: @webpagelink"},{"comment_id":"814443405353112","commenter_b":"if that be the case then throw the Muslims out!","commenter_a":"And what if their choice of attire offends Americans? Will they change their dress code? I doubt it. Squeaky wheel getting attention yet again","post_message":"Catholic University Investigated for Having Too Many Crosses Because It’s Offensive to Muslims @webpagelink"},{"comment_id":"10153630301063132","commenter_b":"Did they ever catch those fucktards??","commenter_a":"God Bless her and her family!","post_message":"\"I can't understand why they would want the thrill of hurting me like this, hurting my entire family.\""}]
