[{"comment_id":"10153830223561756","commenter_b":"why were they refugees and not called migrants... humm good for the goose good for the gander..","commenter_a":"Thank you for calling them migrants. The \"refugees\" stayed in Turkey, Greece, Lebanon etc. The ones migrating all the way to Germany - some 10 countries' borders away! - are economic migrants who risk their and their poor kids lives to get to the country with the highest GDP and best social services about 2,000 miles away. Hungary has had enough of them coming through, demanding food and services all the while disrespecting Hungarians laws and badmouthing the country. Enough! Go around or go back, Hungary has no interest in catering to this group, the country has enough problems already with unemployment etc. Watch this video, Hungarian cops trying to disperse food and drinks to migrants and refugees: @webpagelink","post_message":"The scene at at least one processing area in southern Hungary is starkly different from recent days. Aid agencies are dismantling huge tents. Cleanup crews rake trash into piles.  Migrants who slept in a cornfield here for days have been bused to the Austrian border. The Hungarian border is now closed."},{"comment_id":"10153268633329197","commenter_b":"They are all dangerous!","commenter_a":"She was a nurse and still went tanning? I'm confused. Surely she knew it was bad","post_message":"This Alabama nurse was an avid user of tanning beds, sometimes going 5 times a week! Now, she has developed skin cancer and she wants to help stop others from getting the disease. See the graphic way she shared her story --->  @webpagelink (WARNING: this story contains graphic content)"},{"comment_id":"173468886485698","commenter_b":"Well...Bye!","commenter_a":"California says screw you USA, until they want something from the rest of us in the USA.","post_message":"Spread this everywhere!"},{"comment_id":"1257645944292548","commenter_b":"Why doesn't FR just end this problem by STOPPING all Muslims from entering EU, no pain no trouble--just say NO! Muslims just cant integrate into civilized society.","commenter_a":"Our law is for everyone: no showing of religious appurtenance in schools or public places. That includes Catholics as well. I was not allow to show my catholic cross at school. And I am French. Our country, our laws. France did not became a country of human rights at no cost. If they are not happy there, they can go back in their country. They might remember why they left in the first place. Plus, no one in France is allowed to cover their face expect during winter: it was for security reason, long before Muslims came in France. Women in France fought for their right of Freedom, coming here and wear the veil is an insult to all woman who died for our freedom. The veil or any coverage is not religious, but cultural.","post_message":"It is argued that the ban on head-coverings is unfair because it encroaches the individual freedom to remain covered for religious purposes."},{"comment_id":"10153294684803132","commenter_b":"This witch is EVIL!","commenter_a":"She should be charged with murder.","post_message":"\"When he actually started to carry out the act, he got scared again and exited his truck, but instead of telling him to stay out of the truck ... Carter told him to 'get back in.'\""},{"comment_id":"1280477518640408","commenter_b":"Who cares,he is nobody.","commenter_a":"Who can respect this so called intelligent person (jerk), wearing a batman tshirt making important statements? My 5 year old grandson loves to wear his batman tshirt to the play ground. Makes me think Cuban is doing this for publicity. Yep...his money success has gone to his head!","post_message":"He's rooting for..."},{"comment_id":"10154476827456636","commenter_b":"@username the most powerful twat in the world more like.","commenter_a":"Whether Trump comes, makes a speech in parliament, or visits the queen, is irrelevant, it was the speed with which he was invited by May, that smacks of embarrassing desperation to me.","post_message":"More as we get it"}]
