[{"comment_id":"10154000901360575","commenter_b":"Trump may not be as conservative as you or I, but neither is he a liberal, and anyone who tries to convince you that Trump is a liberal is a liar. A liberal would not want to build a wall. A liberal would not want to enforce our immigration laws. A liberal would not want to repeal Obamacare. A liberal would not want to bomb ISIS back to the stone age. A liberal would not want to bring back waterboarding “and worse” for terrorists. A liberal would not want to protect your right to own and carry a gun to protect yourself. A liberal would not want to defund tax-funded abortions. A liberal would not want to build up the military. A liberal would not want to take care of our vets. A liberal would not support our police. A liberal would not want to negotiate trade deals that give ...","commenter_a":"@username, you are so correct!! Trump has not said one intelligent thing during any of his speeches. Furthermore, his false accusations of calling Senator Cruz a lier is not working for him. Anyone who believes anything Donald says is delusional. Why has Trump not agreed to debate Senator Cruz!? Donald knows he is no match to Senator Cruz. Additionally, Donald lacks knowledge, experience and intelligence to speak about the most critical issues facing our country. You cannot be a Commander-in-Chief just because you are rich!! CEO's of large corporations are not hired to run a company because they are rich. Your resume matters!","post_message":"Cruz trashes New York in hopes of picking up votes in Pennsylvania."},{"comment_id":"10153365745456749","commenter_b":"playing to the media.. he has done more to MAKE it happen again than anyone in history","commenter_a":"ALLAHU AKBAR!!!! #MMBR #M23BR","post_message":"\"In memory of those we lost, we resolved to shape a world where events like those of September 11, 2001, could never happen again, and we see this unbreakable spirit live on every day across America.\" —President Obama"},{"comment_id":"10153835285409024","commenter_b":"I think legal American cititzens should be allowed to shoot illegals when they enter the US!","commenter_a":"AGREE!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10153003088197377","commenter_b":"It will be a huge shake up.","commenter_a":"Now they talking I guess they are coming out of there dream closets, they better rally around him and make this country great again.#Trump/Cruz.","post_message":"Newt Gingrich says Donald Trump is capable of winning not only the Republican presidential nomination."},{"comment_id":"1766583846919055","commenter_b":"I think she is an egotistical show-off.","commenter_a":"I think nothing about it.","post_message":"What do you think of the dress?"},{"comment_id":"10153354540679087","commenter_b":"U PEOPLE NEED TO WAKE THE FUCK UP","commenter_a":"Let's see how far his numbers drop when people realize that there will not be 100 Black Leaders endorsing him on Monday!!! They are pisses about that whopper of a lie!!","post_message":"Donald J. Trump claimed future generations are “going to know about Barack Hussein Obama” when they look back at today’s financial problems. “They're going to be thinking about, 'Obama really blew it.'\""},{"comment_id":"10154001964165329","commenter_b":"yep these girls need to be fitted properly and get the right size!","commenter_a":"Dude half of them are in the wrong size & the VS bra featured isn't a push up, it has all over padding. This makes me want to give them all personalized lingerie sessions / lessons","post_message":"Do push-up bras actually work? And if they do, do they make us feel any better?"}]
