[{"comment_id":"884400811644417","commenter_b":"Once again, that blonde bimbo has diarrhea of the mouth!","commenter_a":"this guy has an ego like no other. he is disgusting to look at and if he weren't rich he would probably be a homeless pervert or a wall street runner.","post_message":"The Oracle of the Republican Party speaks out."},{"comment_id":"390976721026923","commenter_b":"She needs a new Do!!! Lol","commenter_a":"Yep holder in a skirt","post_message":"What do you think of the White House nominee for Attorney General?"},{"comment_id":"1741880082723097","commenter_b":"If you have any red blood running through your veins,If you LOVE THE USA BOYCOTT ALL,I MEAN ALL DISNEY PRODUCTS,PROPERTIES,MOVIES,ALL!! LET THEM SEE WHAT 'WE THE PEOPLE' ARE CAPABLE OF DOING!!!","commenter_a":"Are you kidding me? Trump Hires illegals. He was fined for doing so. Check your facts people.","post_message":"A Disney IT worker who was laid off and replaced by foreign H-1b workers along with hundreds of his colleagues broke down in tears before a Senate panel Thursday while telling his story."},{"comment_id":"10153573221561336","commenter_b":"Give a clipboard to a woman...And this is what you get. I live on land and not in a neighborhood for this reason. If I wanted to have one painted hot pink it would not matter :)","commenter_a":"That's why I would never buy a home in an subdivision with a HOA they try to control living !!!","post_message":"The homeowners association says the purple playground must be “subdued and within harmony with other colors of the community.”"},{"comment_id":"992964070763341","commenter_b":"well you know... some women have it...some don't... (but i agree with your message)","commenter_a":"She's got a boyfriend and I haven't","post_message":"She attacked her boyfriend in a drunken rage because he refused to have sex with her"},{"comment_id":"1086229651436699","commenter_b":"I bet the real problem some have is that Black females got into West point, never mind graduate from there.","commenter_a":"When you lower the entrance standards to one of the world's greatest Military Academy, this is what you get...","post_message":"The image has spurred questions about whether the gesture violates military restrictions on political activity."},{"comment_id":"10152574199456636","commenter_b":"Why are the females removed!","commenter_a":"After a half century of thinking / rethinking - my conclusion is that 'The Matured Feminine Approach' (regardless the physical gender) is the today's hope for more cooperation, understanding,compassion and responsibility in the World! We need to educate and appreciate much women - especially for top leader purposes. Male thinking leaders are afraid of rivals and to lose domination","post_message":"After an ultra-orthodox Jewish newspaper removed all the female world leaders from the Paris march images..."}]
