[{"comment_id":"10153472169705667","commenter_b":"Such a wonderful thing to do.","commenter_a":"Thank you, may the Lord Bless you and your family","post_message":"Napster founder Sean Parker's cash infusion is the largest ever for cancer immunotherapy"},{"comment_id":"10154251884613701","commenter_b":"Oh my wow...this bitch right here is why we need to stop immigration...","commenter_a":"It kills me that LGBT wants special rights when they are going against God's Commandments. It's a fact that the LGBT have mental illness, look it up. America was not built on Gay rights. Also what about people of color we are still fighting for our rights in 2016.God commanded that Marriage should be between a man and, a woman. We are living in the last days. Sodom and Gomorrah. You can't say you believe in God when God condemns homosexuality.","post_message":"The 1969 riots at the Stonewall Inn launched the modern gay rights movement and the annual New York City pride parade."},{"comment_id":"814799585299285","commenter_b":"Yes me to!! We better not be dumb enough to let another one get in like Hillary Clinton! We can't afford to have her ruin our country and drive it farther into the ground than Obama already has!!","commenter_a":"Can't wait for Obama to leave office","post_message":"President Obama will address the nation tonight. He needs to acknowledge RADICAL ISLAMIC TERRORISM! On Friday night in North Carolina, I was asked what I would say to Obama - at this point:"},{"comment_id":"812922865409803","commenter_b":"Imagine being the daughter of the two biggest a$$es in recent history - how would YOU react?","commenter_a":"she is a teenager, let her alone .... I am as anti-obama as the hext person, but geeeeeeeeeeez ... don't attack a kid","post_message":"Why is she supporting this?"},{"comment_id":"1347295655336172","commenter_b":"Go touch your vagina","commenter_a":"I hear bruce","post_message":"Caitlyn Jenner is speaking out after Trump withdrew protection for trans students."},{"comment_id":"10152732788836028","commenter_b":"That sick","commenter_a":"Aww, that's awesome! :)","post_message":"Thomas Sawicki and his boyfriend Shawn Brier were the lucky couple chosen to share the first kiss off the ship as fast-attack submarine USS San Francisco reunited with its home port at Naval Base Point Loma Monday afternoon. Families lined the dock awaiting the arrival of husbands, sons, dads and brothers returning from a seven-month stint in the Western Pacific: @webpagelink"},{"comment_id":"10155855233440354","commenter_b":"Go away you airhead bitch","commenter_a":"To late dumb ass! No explication for intentionally exposing people to your obvious low grade DNA, should be a criminal offence!","post_message":"Even the liberal media is questioning this apology.... Check out the video...."}]
