[{"comment_id":"10153218890796336","commenter_b":"^ baseball, hockey, and wrestling","commenter_a":"Should white people riot the NFL Draft?? 95% black were drafted last night","post_message":"JUST IN: Five of the six Baltimore police officers charged in the death of Freddie Gray are in custody, according to Mayor Stephanie Rawlings-Blake. @webpagelink"},{"comment_id":"731070983658177","commenter_b":"Can all 43 women be lying? Even a broken clock is right twice a day!","commenter_a":"Those kind of girls set women back a million years by falsifying there allegations. They are the main reason why real rape victims get shunned and re-victimized.","post_message":"The comedian's glittery career has taken a huge hit."},{"comment_id":"10153371491386336","commenter_b":"Not American and horrible woman","commenter_a":"Mother Teresa.","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"545673352289911","commenter_b":"Bitch","commenter_a":"Well the bitch is rich and scared of her own shadow... I will never watch a show hers again","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way. What a disgrace. She needs to deported to the Middle East. Do you think Nicole Kidman is a sell out?"},{"comment_id":"1128341107201309","commenter_b":"Hillary is a very evil woman.She will do anything for power.","commenter_a":"I would love to see a truly in depth report regarding The Clinton Foundation. I do believe if the truth was revealed about the Clinton's and their corruption that surely more people would not vote for Hillary Clinton.","post_message":"FINALLY!!!"},{"comment_id":"10154296566836491","commenter_b":"Cristina Cojocaru","commenter_a":"I can do this.","post_message":"Prepare to be amazed."},{"comment_id":"10153803233601028","commenter_b":"No, seriously, she need to be deported to California.","commenter_a":"Deport her!","post_message":"Bound for Yale in the fall, a North Texas valedictorian revealed in her commencement speech that she is an undocumented immigrant. @webpagelink"}]
