[{"comment_id":"1350622528302641","commenter_b":"Lady you're an idiot","commenter_a":"Nobody cares","post_message":"Islamic leaders respond to OSU attack today."},{"comment_id":"10153314695286051","commenter_b":"get over it, all anyone ever sees is when a black gets shot, stupid bitch","commenter_a":"Hell I don't see anything about our Military any more because all I ever see is about cops","post_message":"Two police officers fatally shot a man in Texas this week, but there’s a catch: The suspect fired multiple shots at them first. Did the officers defend themselves appropriately?"},{"comment_id":"10153363421176438","commenter_b":"Whore = prostitute. Whole other issue.","commenter_a":"yea its true...normal guys care and dont really want to settle down with a past whore","post_message":"Trainwreck says straight men care about their girlfriends’ “number.” Is that true?"},{"comment_id":"556591217846893","commenter_b":"America needs alot less hate as well as banning corrupt career politicians, NWO,Open borders to fill there own greedy pockets Clinton the lieing witch with soldiers blood on her hands","commenter_a":"To all the hateful mean trolls, seriously and you call yourself an American. Maybe you skipped the part in school that teaches you to be human and love humanity. You can disagree with political views but when you just get mean spirited about a person...thats just wrong!! I think Americans need more love and a lot less hate!!!! Next time you call someone something, look into the mirror and see if you ever sinned yourself. \"Those without sin...cast the first stone\"!!","post_message":"A smiling Hillary Clinton just arrived on Capitol Hill for meetings with Democratic lawmakers. @webpagelink"},{"comment_id":"10153400883926813","commenter_b":"@username SHE is a girl.","commenter_a":"I love this brave kid.","post_message":"Great victory today! Court rules in favor of our client, transgender student Gavin Grimm, in his challenge to Gloucester High School’s discriminatory restroom policies!  Watch Gavin's video where he stands up for students everywhere."},{"comment_id":"10153370313159071","commenter_b":"Elaine Daly 😂😂","commenter_a":"Excel is childish approach towards industry of information and finance. Furthermore the database tools it offers is fluid and prone to human mistakes.","post_message":"Mastering Excel puts you way ahead of the competition."},{"comment_id":"10153019932341323","commenter_b":"No, but look what women can do with them, much healthier than smoking.","commenter_a":"How much for the tampons?","post_message":"Only in New Orleans..."}]
