[{"comment_id":"10153463881442235","commenter_b":"Wow @username aren't you just a little dick. I bet you work at fux news you pathetic bitch","commenter_a":"This report was completely one sided. Where were the interviews of white people who are homeless. Bill you just showed your true colors. If this report is not racist i don't know what is. O'REILLY can kiss the center of my ass.","post_message":"This could be the most despicable, manipulative report Fox News has ever produced ..."},{"comment_id":"10152810811021130","commenter_b":"It absolutely shocks me that this many woman are grossed out by their own bodies. What a shame!","commenter_a":"I'm glad to see this getting publicity. I love my cup and would love to see more acceptance and less \"ewwwwww\" about it. It's great!","post_message":"Menstrual cups could be a great alternative if you don't like tampons or pads."},{"comment_id":"1438259686194057","commenter_b":"Say No to drigs","commenter_a":"I tired this in high school a few times when it was sold in gas stations. Knew a girk that made it too. So dangerous! Just smoke pot. I'm glad Co legalized weed and got rid if this stuff.","post_message":"Everything you need to know about K2, the drug linked to a mass overdose of 33 people in New York: @webpagelink"},{"comment_id":"971595456226551","commenter_b":"there is a problem with a Black man being president and not standing for a black man, or a white man!! but only standing for illegals and Terrorist!!! thats what should be bombed!!! leave white babies or any babies out of it!! SPILLING INNOCENT BLOOD MAKES YOU JUST AS LOW AND WRONG AS WHAT IS HAPPENING NOW!!!","commenter_a":"I will gladly Kill you for the White Nation!!!","post_message":"(Audio) A war cry... @webpagelink"},{"comment_id":"10153761760496179","commenter_b":"Olivia Gregg 😅😭😂","commenter_a":"Anna Margaret","post_message":""},{"comment_id":"10153542197218984","commenter_b":"This wouldn't be my daughter. First, they are in your country not theirs. They need to assimilate. This is why Muslims are taking over Europe. Read the book, \"While Europe Slept!\" Once we get a Christian president in the USA, the Muslims here will go back to their cubby holes. The Muslim president we have are giving them a very false sense of security.","commenter_a":"Unbelievable. They don't want to follow American customs, go back to wherever you came from.","post_message":"This school just ordered parents to make sure their daughters made Muslims happy in a sick way... this is full-on surrender. Spread this story... your children's school could be next!"},{"comment_id":"10153718216276680","commenter_b":"That woman is a lunatic just like donald duck","commenter_a":"She must have drank the Trump kool aid!!!!","post_message":"Donald Trump’s spokeswoman blamed the policies of President Barack Obama and Hillary Clinton for the death of Army Capt. Humayun Khan, despite the fact that Captain Khan died in 2004."}]
