[{"comment_id":"10153157126101051","commenter_b":"I doubt she was a gangbanger","commenter_a":"It isn't unusual at all for a \"routine\" traffic stop to result in an arrest There are often some underlying cause to make an arrest. Outstanding warrants for priors. (Maybe that's why she was trying to make a new start in an other state) Drugs in the car, intoxication? Then resisting. There's more here. But it all hardly seems like reason enough to commit suicide. But one never knows all the reason(s) some people take their own lives. Maybe she was facing far more serious charges or problems if returned to her home state? Maybe she was trying to flee gang affiliations. Or gang threats. None of that is even given. Just the same old blame the cops and here we go again B/S story from the press.","post_message":"This woman was arrested during a routine traffic stop. Three days later they found her dead in her jail cell. Officials say it was a suicide - but there's one problem with that theory."},{"comment_id":"996595140397015","commenter_b":"These gun nutters are too chicken to go fight a REAL threat, so they try to intimate normal people. You freaks are just trying to intimidate people. Red beck, Inbreeds!","commenter_a":"You don'y have to give up your guns, and no one is proposing that (I'm a gun owner and a vet), to have sensible regulation.","post_message":"“I grew up in Tucson, Arizona, and I live there now. And I'm a gun owner and a supporter of the Second Amendment. But I couldn't give you more credit that we need to deal with the wrong people getting guns, especially with mental illness. As you know, in Tucson we had a person who had all kinds of trouble and was able to buy a gun. In Virginia Tech. In Louisiana… So from a gun owner, from a reddest of red states, and a person who owns guns, more power to you.” —an attendee at Hillary’s town hall on gun violence prevention in Manchester, NH"},{"comment_id":"10152889300511051","commenter_b":"Prosecute these fools ASAP!","commenter_a":"Once again this is the reason for the death penalty, see if they would be laughing then!","post_message":"This group ran out of a restaurant without taking care of their bill. When a waitress followed them, they decided to make her pay."},{"comment_id":"1332532336775650","commenter_b":"Trump \"Hillary is a Bigot\" there you go! This is exactly where this phrase came from~ the Pot Calling the Kettle Black. Okay you Mexicans can stay in the US , But must pay, I will Not build the Wall, Mexico will not have to pay for it , I Love the Mexicans, my African Americans, Muslims and attractive women... I was only Joking, being sarcastic, just a suggestion. I love Rachel Maddow! ha","commenter_a":"I think it is hilarious the Trump supporters come to a Hillary site and post their idiotic remarks. Like their posts have any meaning or validity. It's not like they are going to have any affect on changing Hillary supporters minds.,","post_message":"8 things you can do *today* to help elect Hillary: hrc.io/2bQizDc"},{"comment_id":"10158044749370294","commenter_b":"@username nothing about him says he would do any of that....he got into a car crash lol stop making these puppets look like heros","commenter_a":"Why was he even shot when he had no weapon e could have been taken in to custody without killing him. That officer needs to be investigated and put on leave of absence","post_message":"There's still a lot of question about what happened leading up to the fatal shooting of a college student."},{"comment_id":"10153984611959614","commenter_b":"Walk in front of my car. Karma will get u","commenter_a":"You see how faithful this poor dog is his master was going to kill him.My brother told me one time as he was coming home from work.He saw a little dog on the road this truck purposely hit that little dog and killed him.What kind of animals do we have on the roads.I guess it speaks for it self","post_message":"A heartless driver shoved a dog out of an SUV, then sped away as the abandoned pet desperately scrambled to get back in.   The dog was struck by another vehicle as it chased after the driver on a Long Island road. Incredibly, the canine survived.   Suffolk County SPCA is offering a reward to find the person who abandoned the dog. The driver's vehicle is described only as a dark green, early 2000s Jeep Cherokee."},{"comment_id":"10154430974181756","commenter_b":"The world hasn't forgotten.","commenter_a":"It's sad that it happened 2 years ago yet the world forgot them and nothing has been done to end the ordeal. Smh","post_message":"The young woman reportedly said some of abductees have died but many remain alive in Boko Haram captivity.   The mass abduction in April 2014 sparked worldwide outrage."}]
