[{"comment_id":"10153889343021770","commenter_b":"i bet she tried to touch trump with her boobs..","commenter_a":"Lmao liberals","post_message":"BREAKING: Karena Virginia, a yoga instructor and life coach, appeared at a press conference Thursday morning accusing Donald Trump of touching the inside of her right breast in 1998."},{"comment_id":"10154024287346680","commenter_b":"Thank God we elected a Nazi instead, right?","commenter_a":"Can Obama just pardon her if she promises to stay out of the public for the next 3 decades? It's time to move on.","post_message":"State officials said earlier this year they searched for visitor logs for Hillary Clinton's office and could not find any."},{"comment_id":"10156005617690725","commenter_b":"Loved Trump's speech!","commenter_a":"What's your thoughts on the confederate flag or the MS state flag, Mr Trump?","post_message":"#MakeAmericaGreatAgain #TrumpRallyAL"},{"comment_id":"10153470437544726","commenter_b":"Send her ass packing!!!!!!","commenter_a":"She's from florida and hates america. Go away!","post_message":"WATCH: Ariana Grande: 'I Hate America, I Hate Americans'"},{"comment_id":"1229955423699206","commenter_b":"Kick there asses and give them thirty days in jail and a ten thousand dollar fine.","commenter_a":"Dump the Trump - Really? - Obummer has divided this Country for the past 7 years.","post_message":"How would you deal with these protesters?"},{"comment_id":"10154350184251336","commenter_b":"She won the nomination because of Super delegates like Nancy Pelosi. Should have done in on pledged delegates only. The AP announcing her win the day before the final primaries didn't help, but that was her plan all along. How many Sanders supporters stayed home and didn't vote because of that well planned news flash. This woman will do ANYTHING to get her way. God help us all if this Country elects her as President.","commenter_a":"Killary is done and she knows it!!!","post_message":"“The stakes in this election are high, and the choice is clear. Donald J. Trump is temperamentally unfit to be president and commander-in-chief.”  Hillary Clinton took shots at Trump during her victory speech after clinching the Democratic nomination."},{"comment_id":"996483170392155","commenter_b":"She needs to go sit in the snow for a few decades..","commenter_a":"She is a regular stand up comic! Keep it coming Sarah...we all need a good laugh.","post_message":"If her goal was to make sure people still know she's an idiot, she succeeded."}]
