[{"comment_id":"10153397569465950","commenter_b":"Girl power!! I'm sure he deserved it.","commenter_a":"So. The boy must have said it done something very intimidating to push get to this point don't have think?","post_message":"The viral video of a high school lunch fight shows a girl throwing a boy to the ground. At one point someone tries holding her back, but then she breaks free and knees the boy in the face before running away."},{"comment_id":"10154125094006409","commenter_b":"Hillary is the CLOWN","commenter_a":"They already took our voices away anyway, so what difference does it make? Donald Trump didn't win the popular vote. Yet, he's the next \"President\" anyway. The guy's a CLOWN!","post_message":""},{"comment_id":"10158110429230206","commenter_b":"We should get rid of both of them . Say no to Armageddon .","commenter_a":"Donald Trump went from selling luxury condominiums to selling empty dreams .","post_message":"“If somebody wants to go out and say that they voted for this person or that person, they can do it. But that ballot is sacred.”"},{"comment_id":"10155127148590652","commenter_b":"What we need to do is educate them so that they leave that vile disease that is ISLAM. That's the only way we will rid society of ALL the barbaric Bronze Age religions that have no place in the 21st century...","commenter_a":"At last someone actually making a speech about the idea that wearing a headscarf doesn't necessarily mean that women are (always) submissive, that it's part of a culture as well, and that not ALL women are forced to wear them. Ten years ago and even before i used to be seen as an alien if i said that, not being a Muslim myself. pppffff Yes!! let them get on with their lives, and us ours!","post_message":"\"We need to create the space to hear Muslim women for who they are individually and not to judge them merely as a monolithic community.\""},{"comment_id":"10153274785312623","commenter_b":"I think they need counseling by Dr Phill.Hey people!Wake up!Want to be with the one you love?Renew your vows yearly.Want to have it both ways and live with guilt every day?Do not get married.","commenter_a":"It's like this.If you love each other.Fine.If you have the need to stray away from your soon to be spouse to hang out with the girls.Fine.But to be with somebody while you are married?Hey you are not fooling anybody but yourself.Either be married and be happy or go two different directions. I have been with my wife fronearly 20 years and have been through the best of times and the worst of times","post_message":"The wife of a Winston-Salem man arrested for bigamy is speaking out:"},{"comment_id":"10153852384658822","commenter_b":"Women wanted equal treatment in the military.. This makes them a little more equal. Be careful what you wish for you just might get it","commenter_a":"I had 3 sons and they all registered when they turned of age. I would have not wanted them to go but if I had a daughter which I don't I would not want her to be drafted and put in the position of getting captured. It is bad enough what they do to men when captured you can imagine what they would do to women before doing to them what they do to men. I do now have a grand daughter and a grandson. I hope neither of them ever have to go thru a war. I also hope everyone else's kids don't either.","post_message":"The Senate voted this week to require women to register for the draft.   What do you think of the change?"},{"comment_id":"1707816392795801","commenter_b":"Kim Kardashian is a fucking douche, she and her asshat husband need to go the fuck away.","commenter_a":"Pity the no talent wannabe Kim Kardashian. Her only claim to fame is exhibition. So sad.","post_message":"Bette Midler isn't going to like this."}]
