[{"comment_id":"10153377992812426","commenter_b":"Typical female...never satisfied.","commenter_a":"Wish he'd do something else other than banning microbeads","post_message":"Thanks, Obama! ;) More than 8 trillion microbeads were entering the country’s aquatic habitats daily; the volume was enough to coat the surface of 300 tennis courts every day -- according to a Sept. study."},{"comment_id":"1294378153962270","commenter_b":"Look in the mirror bitch","commenter_a":"I aint spending no money on this hoes lmao","post_message":"Blac Youngsta claims none of the strippers looked good! #WSHH #BlacYoungsta"},{"comment_id":"10153330006631051","commenter_b":"11 died in the C130 crash in Afganistan today, thats 11 more murders for Obama.I had more respect for the Black Panthers than Obama.The Black Panthers at least admitted to being Racist and they did not murder our troops, as Obama has.","commenter_a":"More guns = less violence","post_message":"Does President Obama have a point here?"},{"comment_id":"1591225437848101","commenter_b":"You can leave too lady.","commenter_a":"This is totally wrong you don't disrespect the flag our the National Anthem . Good they would never play another down","post_message":"High-school football players in New Jersey, Alabama and Massachusetts, replicating Colin Kaepernick's protest, are facing suspension from school."},{"comment_id":"10153539858966943","commenter_b":"Remove them all and start over!!!' No one connected in anyway to ANY family ties whatsoever should be allowed to remain in office ... Mass re-election for both democrats and republicans!!! These people are not American to continue sabotaging the hard working people of America! I don't go to work to pay tax to support ILLEGAL aliens!!!!","commenter_a":"take care of our unemployed that you as president have created then you might leave a legacy dumbass","post_message":"Next week the U.S. Equal Employment Opportunity Commission will sign a deal with Ecuador to Ecuadorian nationals with information, guidance and access to education and training resources to help them exercise their workplace rights. SHARE if you think the federal government should help American workers - not foreign workers!"},{"comment_id":"1086763938002529","commenter_b":"\"The dangers of muslims...\" Yes, because American muslims have just been attacking other Americans day after day for years. Oh im sure theyre just waiting right? And in 10 years theyll still be waiting? And in 20, still waiting...","commenter_a":"Trying to desensitize the American people of the dangers of muslims.","post_message":"\"Mohamed Ahmed is not at a disadvantage because he's Muslim: On the contrary, as the reaction from Obama and the fawning media shows, he's privileged.\""},{"comment_id":"10153386864707235","commenter_b":"Eww","commenter_a":"They probably wanted to sniff it.","post_message":"This should not be legal."}]
