[{"comment_id":"773517859455693","commenter_b":"They should both go to jail","commenter_a":"Bill can't keep his pecker in his dried up wife's vagina and her server was unprotected. She is a liar, corrupt corrupt blood money.","post_message":"His reaction was..."},{"comment_id":"10154712376336756","commenter_b":"He was a pastor in the Southern Baptist Conference whose strict, written doctrine is anti-LGBT. Whether rabidly or tacitly he was promoting anti-LGBT beliefs by choosing to hold that job.","commenter_a":"The story doesn't address how the pastor felt about gays before his son 'came out' ? Did he always think that gays should be loved, treated fairly, equally like every one else, or is he just coming to that realization because of his son.","post_message":"After the pastor told his congregation about his son's coming out, 'I felt like this weight had just been lifted out of me, and people knew where we stood.'"},{"comment_id":"10153134477163984","commenter_b":"Already too late!! Enforce the law that is already on the books, secure the border and there would be no need for immigration reform and less deportations!!! No jobs for the American Citizens now, so let's grant amnesty to 5 million illegals!! That will get the economy and the job market rollin!!!","commenter_a":"No person has every done more to harm the best nation in the world than this man ! I am surprised a patriot has not shot him by now ?","post_message":"This is one of the scariest things I have read in a long time. If Americans don't wake up, it could soon be too late.  Spread the word about this danger."},{"comment_id":"694737757326072","commenter_b":"Unemployment is down because you can't get it silly woman.","commenter_a":"That's all of ya dumbass president who ya voted for should've just kept the house republican","post_message":"WHAT?!??!!?"},{"comment_id":"10152835488861051","commenter_b":"What a bitch","commenter_a":"What kind of a person hurts an old lady. Hope she is sued . She needs jail time","post_message":"This 71-year-old woman tried to park in a handicap spot in the Walmart parking lot. That's when all hell broke loose."},{"comment_id":"870530659649023","commenter_b":"This seems to imply, the next President has to be a woman...","commenter_a":"I completely agree with her that Hillary is not the woman for the WH. And I'm looking hard to find the one who will do all they can to put us back on track as a Nation, restore our economy, and undo the damages done to our International Affairs across the world. We need to sure up our relationships with our friends and work harder with the ones who threaten the peace and safety of this world to ensure they do not get nuclear capabilities and the ability to use them. We also need to clean up our Nation from illegals and close our Borders so that they are not so easy for illegals to cross them. We need some common sense leadership for this Nation instead of all the socialism and liberalism, lies and corruption that is tearing this Nation apart. Hillary Clinton has already proven she can not ...","post_message":"Want a female president?   Skip Hillary. Look at Carly Fiorina!"},{"comment_id":"10153171348750736","commenter_b":"Yeah, I want my 30 cents! in a check.. pronto!","commenter_a":"Instead of someone winning, split thee winnings with everyone who bought a ticket!!","post_message":"#BREAKING  No winner in tonight's Powerball Jackpot.  Wednesday's draw will be worth at least $1.3 BILLION.  Is there a billionaire's equivalent to the Dollar store??"}]
