[{"comment_id":"10153785925861130","commenter_b":"So disgusting! Foot kiss'n Catholics just turn my stomach.","commenter_a":"Some people on this post are so stupid. Read the bible that is if you can read. Jesus washed feet. And the pope is just trying to be as Christ like as he can be. Some of you really need to follow his example. That is if you are not to ignorant","post_message":"Pope Francis says regardless of religion, we're all \"children of the same God.\""},{"comment_id":"10153709575791378","commenter_b":"@username Good call momma!","commenter_a":"They need to ban children from beaches and parks, too many dirty diapers and clothes left behind by irresponsible parents.","post_message":"JUST IN: New Jersey lawmakers have approved a ban on smoking on public beaches and parks, sending the measure to Governor Chris Christie's desk. 6abc.com/@username"},{"comment_id":"10156001387100354","commenter_b":"I would prefer you be hung, Stabbed, set on fire, tar and feathered, AND THEN DECAPITATED. SAD THING, Americans NEVER GETTING WHAT THEY WANT OR NEED!","commenter_a":"How do so many of these guys have zero brains when it comes to breaking the law. They are truly brain dead about this!","post_message":"How, again, did this guy break into the top 10?"},{"comment_id":"10153103366966770","commenter_b":"@username yes Mario was an idiot but he's dead and buried. Andrew is his idiot son and Governor. Chris is his other idiot son. Both are liberal loonies.","commenter_a":"These idiots who push for these huge wage increases are what drives prices up!","post_message":"A proposal to enact a $15 minimum wage in New York could cost state school districts $276 Million, according to a report released Friday."},{"comment_id":"10154884386731509","commenter_b":"Irrelevant, and you obviously miss the point.","commenter_a":"I do not support Trump. Let me get that out of the way first. That said, this is a terribly undemocratic, anti-American thing for Buzzfeed to do. Anyone who disagrees is sadly unable to separate partisan politics from basic principles.","post_message":"\"We don't run cigarette ads because they are hazardous to our health, and we won't accept (Donald J. Trump) ads for the exact same reason.\""},{"comment_id":"10152957563376770","commenter_b":"she should have already been locked up!...","commenter_a":"She has helped fuel the fire instead of being unbiased like she is supposed to be.","post_message":"A veteran Baltimore prosecutor is blaming state's attorney Marilyn Mosby for contributing to dramatic spike in violent crime that has gripped the city in the aftermath of the Freddie Gray case."},{"comment_id":"1745816418974356","commenter_b":"This woman's head is bad.","commenter_a":"That's the problem, she just let 4 Americans die, you idiot.","post_message":"Whoopi Goldberg: Gee, so sorry that you find the deaths of innocent Americans \"boring.\" But for the rest of America, we find the Benghazi massacre reprehensible and unforgivable. And on behalf of the families who can never see or hug their loved ones ever again, We the People demand transparency, honesty, and justice. So get over yourself and your need for constant amusement, Whoopi. Hillary lied, Americans died. Signed, We the People"}]
