[{"comment_id":"10153876245464411","commenter_b":"She's actually not Austrian. Quit with the PC BS.","commenter_a":"She got what she deserved. Make up your fucking mind and stick to it.","post_message":"Unconfirmed reports of the 'poster girls' fate also circulated last year, with UN counter-terrorism expert stating that one had been killed in fighting and the other had disappeared"},{"comment_id":"1052170041539020","commenter_b":"she sucks","commenter_a":"Great","post_message":"Clinton is clobbering Trump in poll after poll."},{"comment_id":"636870959836816","commenter_b":"Good for her they should all be arrested where the heck is the National Guard?","commenter_a":"Need to arrest everyone on street. Thugs have taken over again ??? Let the police do their job . If they have to shoot a few of them so be it.","post_message":"Ferguson Protesters got in the way, so this patriotic driver does this.  Race rioters are out of control. They are the true menace to our society.  Are you sick and tired of race rioters?"},{"comment_id":"754838434706734","commenter_b":"Oh God, the taxes, the illegals working for him, the handicap man with evil intentions, and now a rape! Next anything against Mr. Trump, please, lol Your evil would not be able to destroy Mr. Trump! Don't waste your time!","commenter_a":"Wtf ever stop grasping","post_message":"BREAKING: Trump Engulfed In MASSIVE Rape Scandal   This could end his campaign right now. Let's show our support.  Can we get 30,000 'LIKES' for Donald Trump?"},{"comment_id":"870850106350450","commenter_b":"She's desparate and we already know that she'll say anything to get a vote. I wouldn't be mad if she stroked out.","commenter_a":"Yeah ok","post_message":""},{"comment_id":"10153935292307434","commenter_b":"Shay shut the fuck up","commenter_a":"\"Transgendered\" sooooo 2013. BOOOORRRING No one cares. We get it, you're edgy. Zzzzzzzzz","post_message":"\"Trans women are not only sex objects or prostitutes,\" said Amiyah Scott, explaining her departure from the show."},{"comment_id":"10153222211323487","commenter_b":"It means there is one more polarizing point between the two major political parties in the US.","commenter_a":"Means America will continue to be bullied and bossed around by Israel. The country that does absolutely nothing for us in the middle east but instigate more war for our men and women to die in. Not theirs.","post_message":"Readers respond to the impacts of Netanyahu's victory."}]
