[{"comment_id":"10154065834906323","commenter_b":"Britain has more than enough/too many home grown criminals, that's very true. So what kind of imbecile would want to import more? eg: 1,000 immigrants. 999 workers/1 criminal. That's one too many. How to stop the criminal entering? Let none in. How simple is that?","commenter_a":"I didn't know all UK citizens were perfect law abiding citizens. Those who live in glass houses ... The important stat is crimes per person, EU citizen vs UK citizen, but that'll probably be inconvenient for the leave campaign as most EU immigrants are educated, employed, and tax paying.","post_message":"A dossier of murders and rapes committed by 50 EU citizens in Britain has been published by leading out campaign group Vote Leave, in a move described by critics as “scaremongering of the worst kind”."},{"comment_id":"1713686355585143","commenter_b":"Stick it bitch.","commenter_a":"They came into office with 1 are 3 million they now have 12 to 20 more million...Don't tell me she's not getting paid...","post_message":"Are you... KIDDING ME!? So sick of Barack Obama & Michelle Obama..."},{"comment_id":"10154779118243701","commenter_b":"Because she didn't want anyone to know she was pregnant in the first place","commenter_a":"Wait so if the baby is dead then you throw it out the window? That is just sick!!! You need help and definitely no more kids that baby dead or alive dose not deserve to be thrown out a window","post_message":"The Nebraska teen said she gave birth to an infant she thought was dead, panicked and threw the baby out the second-story window."},{"comment_id":"10153722269186680","commenter_b":"Helene....her supporters have jobs....what planet do you live on ???","commenter_a":"Trump draws crowds of 15k, while Hillary can't draw 100 people to come to her rallies, yet the polls say that Hillary is ahead....something smells foul.","post_message":"The independent says he'll continue to find ways to support Hillary Clinton and defeat Donald J. Trump."},{"comment_id":"10153523815251636","commenter_b":"This Guy is a Catholic Hater. Think women are 2nd class humans. Would kill all LGBT if he gets the chance. Yet he's pretending to be the victim. Oh and always blame Israel.","commenter_a":"How many people will have the iraqi flag on their profile? More selective outrage from ..........","post_message":"More as we get it"},{"comment_id":"10152900283295950","commenter_b":"You're the little bitch","commenter_a":"First of all, why the hell are 5th graders getting diplomas???","post_message":"One by one, Trinecia Blacklock's fifth grade classmates were called to walk across the stage to get their diplomas. The wheel-chair bound student waited for her turn, but her name was never read aloud — and she was left alone, sitting by herself."},{"comment_id":"1299685360072319","commenter_b":"And what if the fingerprint belongs to a psychopath or a killer ? This solution gives the wrong message, that guns are okay, you just need to make them safer. But guns are not okay. But Americans will never understand this unfortunately. America was build on guns and blood. What do you expect. Don't come now with the reason it's the same with a knife. You can use a knife for different things, but it can also kill someone. A gun though has only one aim and it was made only for one reason and one purpose. To kill. And it's a very unfair way of killing too. I hate guns, I wish they all would disappear.","commenter_a":"This is a great idea if it can be refined to the point of consistent performance!","post_message":"Can a fingerprint save a life? This teenager is working on \"smart gun\" technology. (via INSIDER)"}]
