[{"comment_id":"1146539692060530","commenter_b":"I have 3 son's and from the time they were little my husband and I taught them to never hit a girl told them to walk away from them,they never ran into a situation where happened, but I got to say if a girl( and I'm using this term lightly) ever hit one of my son's like she is going after this guy ,I probably would tell them if they act like man treat them like man this girl talks and act's like a guy!!","commenter_a":"Never hit a woman. Period. Walk or run to get away, but don't hit her. File a suit, get her charged, don't strike a female. Unless she's trying to kill you. Then do what you have to.","post_message":"WATCH THIS BEFORE DINNER AND ... discuss with your son. 16M video views. Wild stuff."},{"comment_id":"10157872915845354","commenter_b":"Sadly, anyone can be an American these days, just run across the border or call yourself a refugee. Too many problems...","commenter_a":"I'd prefer 'firearmS'","post_message":"Amen!"},{"comment_id":"902522343195539","commenter_b":"Smart pooch 😂😂😂","commenter_a":"Krissy Maree","post_message":"This Great Dane's having a Great Time on a trampoline.  Video: Jukin Media"},{"comment_id":"928001893961910","commenter_b":"Thank you Rubio for all your hard work. God bless you and your family.","commenter_a":"NO RUBIO ND NO CRUZ.","post_message":"Marco Rubio is a friend and a colleague who ran an optimistic campaign focused on the future of our party, conservative principles, and uplifting the American people. The Republican primary was stronger because of the ideas he brought forth.   Marco’s story embodies the promise of our great nation. I know he will continue to be a champion for limitless opportunity in America, and I wish Marco, Jeanette, and their four kids the very best."},{"comment_id":"654971807960745","commenter_b":"Fake fugly whore.","commenter_a":"can she get her face redone?","post_message":"This woman wears a corset for 23 hours a day. She has also had 4 breast enhancements, a gastric bypass, and two nose jobs. She says she finally has the most perfect body in the world.   Do you think she has a perfect body?"},{"comment_id":"10154716215431800","commenter_b":"Better? Human Rights just went out the door the moment Trump was elected, something that America has practiced for decades and what the world envied us the most....Hypocrisy much?","commenter_a":"oh yeah, I heard President Duterte say Trump was just like him. Changing the world...but is it for the better?","post_message":"Donald Trump, fresh off Hair Force One, meets President Obama at the White House."},{"comment_id":"909362045826715","commenter_b":"NO!","commenter_a":"You idiot libs! Most of us conservatives carry a gun everywhere we go. You just dont know it. And if a criminal tries to go on a killing spree, we will save your dumb a$$es too.","post_message":"Should guns be allowed in parks and playgrounds?   What do you think? Sound off below!"}]
