[{"comment_id":"10152834181476135","commenter_b":"Another feminist circle jerk. You silly basic b*tches need to go take a hike and get off Facebook and tumblr.","commenter_a":"The amount of ignorance in these comments.....","post_message":"Cortney Bogorad says, despite the embarrassment she felt after the incident, she is taking legal action so no one else goes through a similar experience."},{"comment_id":"1169765843057166","commenter_b":"Leave them alone, they have to live somewhere!","commenter_a":"DON'T CARE.... Kids are hungry.. Will be more hungry when school out !!!!! Focus on important things in the Community!!!!!","post_message":"Rumors are flying! Are Beyoncé and Jay Z living in Tampa? Our news partner the Tampa Bay Times went to check out the rumors and here's what happened..."},{"comment_id":"1401830939879019","commenter_b":"If you are in the U.S illegal,then you should be deported period,there is some circumstances involved in illegals","commenter_a":"Amen brother!","post_message":"Black Trump Supporter Just Exposed SICK Thing He Saw Muslims Doing In His TownHas BRUTAL Message For Liberals Share if you agree they will NEVER Assimilate"},{"comment_id":"10154799380074486","commenter_b":"Suck it up, cupcake.","commenter_a":"The Feminist Movement emasculated men and created this generation of Pajama Boys.","post_message":"Spot on."},{"comment_id":"1067364476710422","commenter_b":"She's a corrupt evil lying witch.","commenter_a":"I am for @username all the way!!! She is experienced. She knows how to negotiate with foreign countries. She is a fighter for women and children. She will negotiate without bombs. She will keep us safe. She is the calm not the storm that Donald Trump is.","post_message":"Our choice is between the most experienced, qualified candidate in decades—and a man who once started a Twitter war with Cher. hillaryclinton.com/makeaplan"},{"comment_id":"10153614155549117","commenter_b":"@username you seem perfectly willing to dismiss the notion that the unborn have rights. I have no idea when to legally call a fetus a human. If a pregnant woman is beaten and loses her child is it simple battery. I don't know. When I was young I learned hunting and gun safety and rule one, you don't shoot at noise, a rustle in the bushes. Why not? Because there is a chance it may be a person. A real libertarian solution would be upon finding out she is pregnant she must claim she doesn't want to take care of a child and surrender right to it. If someone else is willing to take that child and be legally responsible for it then it gets rights and she needs to take personal responsibility (libertarian) and not be aggressive towards the fetus and turn it over on delivery.","commenter_a":"The best thing libertarians could do is reexamine their approach to abortion as their current stand favors personal privacy over personal responsibility and non aggression. Another possibility is to slightly widen the area we need to defend, to treaties,in order to be safe at home. Remember, economic liberty is the most important issue.","post_message":"John McAfee: \"The truth is this year at least there's maybe a 0.005 percent chance that any candidate on this [L.P.] stage wins the election. If we don't, if we get 20 percent, I promise you, if we don't do something to win in a real sense, this world is going to collapse.\""},{"comment_id":"10154242925578837","commenter_b":"The wall will cost billions and stop hundreds. Wao.","commenter_a":"A wall to stop terrorists, criminals and drugs from pouring into America, what a noble idea","post_message":"CONGRESS TO PAY FOR WALL - GOP leader Paul Ryan says congress will end up paying $12 billion to $15 billion for President Trump's border wall."}]
