[{"comment_id":"1063108630412332","commenter_b":"Hillary is such a flipflopper!","commenter_a":"If the War in Iraq made your family safer, Hillary is your candidate. If the USA PATRIOT Act secured your family, then Hillary is your candidate. If your family reaps the benefits of institutionalized racism in our justice system, then Hillary is your candidate. If you want more expensive healthcare, vote Hillary. Mine is currently $475/month (compared to my $25/month car insurance from Insurance Panda, or my $10/month dental insurance, but I digress). Hillary is in bed with big pharma, she is your candidate. If you want to vote democrat, but still want to bomb Iran, then Hillary is your candidate. If you really benefitted from the Housing crisis or from Monsanto bankrupting small farmers or Big Pharma price gouging the sick, then @username is your candidate","post_message":"“It’s not just that she’s done her homework—Mrs. Clinton has done her homework on pretty much any subject you’d care to name.”"},{"comment_id":"10152732363406051","commenter_b":"...women who don't have vaginas? WHAT?!?!?!","commenter_a":"If he has a pussy and she has a pecker you call them 'heshe's! If he has neither a pussy or a pecker and she has neither a pecker or a pussy you call them awfully damn horney! In Another vernacular you might just call them freaks of nature! Them the question is what do you feed them? One thing is for sure! They won't reproduce!' Put them in a side show at the fair. Pay your money, go in, hoot and holler, laugh until you pee your pants. Now got to work Monday morning telling everyone what you did and saw! Then you will find out who the real freak is!","post_message":"This all-women's school will no longer perform the 'Vagina Monologues' because it doesn't want to offend women who don't have a vagina."},{"comment_id":"10154229905709170","commenter_b":"Stop it. This kind of game playing makes you look more the fool. Most people today couldn't pick a transgender out of a line-up of people. They've been using our public bathrooms according to the sex they identify with, live and dress as, all these past decades to no uproar. Now all of the numskulls have come out of the woodwork claiming their women and children will be raped in the toilet stall because men are going to swarm into the ladies room because the law says they can. Get this: sexual predators don't follow laws in the first place and no law will stop them from getting their next victim be it in a bathroom or anywhere else.","commenter_a":"I will be packing better know what you are doing or you will be peeing like a girl for real !!!","post_message":"You want to try using the ladies' room, bro . . . the politicians and the media might be OK with you, but as for the ladies themselves, I wouldn't be so sure."},{"comment_id":"10153218039995090","commenter_b":"Stop Hillary!","commenter_a":"REMEMBER THE.LINTL Whttps://www.facebook.com/judy.winders/posts/@username LINTON. MURDER LIST","post_message":"Taking a road trip this summer? Show that you are committed to Stopping Hillary.  Take the pledge & get your free Stop Hillary bumper sticker: @webpagelink"},{"comment_id":"10153564661133837","commenter_b":"If they are illegal then yes deport them and yes build a wall preferably with large guns","commenter_a":"He just wants to deport them all, and thinks they're all criminals, and wants to build a wall!!","post_message":"TRUMP LOVES HISPANICS!  Presidential candidate Donald Trump tweeted out this afternoon, 'I love Hispanics!' to help celebrate Cinco de Mayo.  THOUGHTS - THAT'S SO NICE or THAT'S SO WEIRD?"},{"comment_id":"966056150146121","commenter_b":"Slow learners. Blacks keep voting Democratic even though Dems have done nothing but baby them and keep them down.","commenter_a":"They STILL haven't learned about the democrats !!!!!!!!!!!!!!!!!","post_message":"LANDSLIDE"},{"comment_id":"968795919903853","commenter_b":"The woman is so stupid, only reason she is in because of her color.","commenter_a":"Punta","post_message":"VIDEO: Congresswoman Stands Up For Sharia Law And Actually Gets This Disgusting Response.  'LIKE' if you think Rep. Maxine Waters should be kicked out of office for showing such strong support of ShariaLaw."}]
