[{"comment_id":"565051436999865","commenter_b":"Why don't these idiots get deported already? They come here illegally so they are criminals!","commenter_a":"Just bag em and ship back to Mexico","post_message":"Police in riot gear faced off against a violent crowd of protesters outside a Donald J. Trump campaign event in Albuquerque. @webpagelink"},{"comment_id":"10153010848717434","commenter_b":"Women have fewer children when they have excellent access to birth control. Education, free birth control and free condoms.","commenter_a":"We need to implement that policy here. If you're on any kind of public assistance, you can't be having more kids you can't afford to feed.","post_message":"The thing about demographics is you can’t just flip a switch."},{"comment_id":"10153471115269087","commenter_b":"If i was Trump i would stay away from that dumb broad.","commenter_a":"GO PRESIDENT TRUMP 2016!!!!!!","post_message":"You’ve also said, “She can pick winners!'\" Bristol Palin said of her mother Sarah Palin. \"I hope you’re right, and that she endorses Donald J. Trump today for President.\""},{"comment_id":"196351097508558","commenter_b":"Ginger ass snowflake whiny bitch","commenter_a":"You have the right to be a dumbass ya crybaby snowflakes","post_message":"While Republicans stick to zero solutions and plenty of petty insults, the rest of us are hard at work rescuing our democracy from dictator Trump. Video by Occupy Democrats. LIKE our page for more."},{"comment_id":"1201903546502686","commenter_b":"No way, he works at Wal Mart today. He made something of himself.","commenter_a":"Is she related to the banjo player in \"Deliverance\"???? Same eyes!","post_message":"It’s a shame, but I guess we shouldn’t be surprised by Hillary Clinton’s attempt to politicize another tragedy to advance an anti-gun agenda. As this analysis rightly points out, Oregon has some of the strictest gun laws on the books, and none of these proposed new laws would have stopped these awful shootings in the first place. We all want to stop these senseless tragedies, but using them to push unconstitutional, unrealistic, and ineffective new laws in order to win favor on the left isn’t going to help. I’m a gun owner myself, and I strongly value the rights guaranteed in the Second Amendment. The overwhelming majority of gun owners are law-abiding citizens who strictly follow all applicable state and local regulations. I will oppose any effort to take away the rights of law-abiding American citizens to own firearms."},{"comment_id":"402701206566786","commenter_b":"Wake up Bitch!","commenter_a":"I don't watch her channel anymore. I don't like Oprah!","post_message":"Oprah: ‘Anyone Who Doesn’t Like Obama Is Racist’. Unbelievable. What a bigot. Do you think Oprah is the racist?"},{"comment_id":"1639973446062778","commenter_b":"Fucking bitch...outsmarted herself and all her dumb ass supporters!","commenter_a":"I thought it was us racist white people truth is you did not deserve to be our president because we don't trust you your record suck your forein policy was terrible and caused so much death your husband disgust me and you lied about your server when you bleached bit your emails to hide your crimes blew it for you but what you did to our heros in Benghazi was the worst then to cheat in debates with Donna showed us your still the sneak we all know you are. Go away already your done","post_message":""}]
