[{"comment_id":"1268015386628044","commenter_b":"An ex Democrat here that doesn't believe her lies. And neither does 90% of our Democratic Charter making up close to 3000 people. We are NOT voting for Hillary Clinton. The DNC should have let the election alone. You won't hear about it in the media or see it in the polls but MANY Democrats are pissed off at their party for rigging the election for Mrs. Clinton. I hear what's going on from the ground floor in the Democratic Party and from my calculations close to 30% of Democrats are not voting for her nationwide.... They are desperately trying to get us on board but it is not going to happen. The Democratic Party is falling apart and you won't hear about it from a single news source. She will have the \"always vote blue\" votes and that is it. The Clinton campaign and the DNC have even sent ...","commenter_a":"The democrats feelings get hurt from a said word or two. Lying Hillary can insult their intelligence by lying to their faces for 40 years and they are completely ok with it. Makes you question their intelligences.","post_message":"Hillary Clinton and Donald J. Trump are tied in South Carolina according to new polling. Rachel Maddow breaks down the surprising development. More analysis on the latest polling from The Rachel Maddow Show: @webpagelink"},{"comment_id":"10156717481975354","commenter_b":"she is a pig","commenter_a":"SO VERY WRONG!!!","post_message":"Black Panther Tribute by Beyonce..."},{"comment_id":"10153097402831748","commenter_b":"Michael Savage you are an ignorant swine prejudice d Jewish imigrant not worthy of comment. You are inciting racial war!","commenter_a":"And you may as well be...oh hell-I can't think of anyone that I want to insult that badly. You are in your very own camp of What-the-hell??","post_message":"Michael Savage asserts \"[Obama] may as well be Charles Manson” for inciting racial tension in America."},{"comment_id":"1765571717063636","commenter_b":"@username STFU","commenter_a":"It's so nice to hear a candidate say he loves America and its people. Unlike Obama and Hillary who constantly tell us how horrible and deplorable we are and not fit to wipe their shoes. Vote Trump who would wipe our shoes if asked.","post_message":"An incredible evening in MIAMI, FLORIDA! This is a MASSIVE MOVEMENT. I LOVE YOU! -DJT"},{"comment_id":"553460564841833","commenter_b":"Isn't Covergirl a brand? Wouldn't saying \"He can't do that\" because of the brand name be like saying girls can't play Gameboy because it has 'boy' in the name? Also, people are making a fuss about a guy appearing as the face of a woman's product, but I didn't see anyone making a fuss about almost naked women appearing on publicity for men's magazines, car's oil, burgers, beer, etc.","commenter_a":"He looks like a girl what are they thinking!!!!!!","post_message":"Oh....my."},{"comment_id":"1600976746609844","commenter_b":"wow.Its a cartoon.It was cute.Do you take every comic strip so seriously? It wasnt make a bold political statement it was just a cute funny comic.Let people enjoy things..Not everything is sexist.This is what gives feminism a bad name.Some of you take things so literally and so seriously.Lighten up.","commenter_a":"Oh no... people, this was meant to be cute and funny, and even a little disturbing. Don't make it a sexist thing, please? Let it be what it is.","post_message":"5. Don't sweat it. The world is our runway every day."},{"comment_id":"10153572716786337","commenter_b":"Well he went to my homeland n cause a problem...we don't bother NOBODY but Americans always causing trouble for us....If he dont go to jail..Maybe a African curse will do the tricks...n if the table was turn y'all would want justice","commenter_a":"Uh, no shit he won't go to jail. He didn't break any laws in America what so ever. While I disagree with what he did, it was done in another country outside of our laws.","post_message":"#CecilTheLion is dead. Walter Palmer probably won't go to jail. Here's what we can do to prevent situations like this..."}]
