[{"comment_id":"1108272855874801","commenter_b":"she has a penis","commenter_a":"She looks like a man..","post_message":"Terrible!"},{"comment_id":"10152946649009641","commenter_b":"While I despise Islam I don't hate Muslims.. At all! It's not their fault if they're born in it. But I agree with letting no more immigrants into west! None!!","commenter_a":"allTerrorists should be killed to make the world better","post_message":"Gunfire echoes from two police raids ending terror sieges around Paris. One witness says: 'It's like a war.' Another describes how a suspect told him: 'Go, we don't kill civilians.' @webpagelink"},{"comment_id":"10153689413136336","commenter_b":"Because 1471717696187557gallathat is not how God works in a church. If the pastor is wrong God will deal with him, it's not her place to do that. @username we don't know if he spoke to her privately & just because he rebuked her behavior doesn't mean it wasn't in love or that he doesn't love her. She may truly have been disrupting the services. God rebuked the behavior of many in the bible. The bible also says that God disciplines those he loves. No pastor is going to be able to preach in a way that makes everyone happy & making people happy isn't part of his job. He's supposed to preach the truth of God's word without compromise. His delivery can change, but the truth cannot.","commenter_a":"What kind of pastor throws out a 103 year old woman? Not even non-Christians would do this to an elderly woman. Madness. They hate her for believing the same doctrine that she learned at that church every Sunday for a century. The bible charges Christians to take care of the elderly and the widowed.","post_message":"Genora Biggs said that she and the current pastor, Rev. Tim Mattox, have long sparred over his form of preaching, which she characterizes as a 'Holiness style' that doesn't belong in the Baptist church."},{"comment_id":"10153338017932411","commenter_b":"So the nets they snag your tuna in make those fisher people littler dicks?","commenter_a":"All the idiots who says no different then fishing. Big men that kill nature as sport. Little dicks!","post_message":"The Facebook video of the incident quickly went viral, attracting comments like, “Someone should drag that guy around in the water just for pictures.”"},{"comment_id":"10153854891839032","commenter_b":"Get guns out of the hands of THUG CRIMINALS and TERRORIST and problem solved","commenter_a":"Being around guns isnt safe... who would have though","post_message":"The study also found that in many self-defense cases, use of a gun didn't lead to a better outcome for the victim."},{"comment_id":"10154398939341523","commenter_b":"There are TONS of awesome, respectful, wonderful men; just as there are TONS of nasty, evil, sexual predator females.","commenter_a":"I would still like to know which of my rights are being violated.","post_message":"Milwaukee County Sheriff David Clarke reacts to the Women's March in Washington to protest Donald J. Trump's presidency -- calling it 'an absolutely freak show.' @webpagelink"},{"comment_id":"1142380192485341","commenter_b":"Wow are you serious they are trying to take out the Americans 1 job at a time and all the free handouts our government will give them. While our own government let's the Americans suffer by allowing them to free load off our system. Really they get social security for what . Americans get denied SSI while the immigrants step right up and no problem. really ?? Go Trump","commenter_a":"Welcome to the future!!!","post_message":"Nearly 40% of less-educated, working-age Millennials ages 18-29 don’t have a job.  That’s more than 15 million young-adult high school grads and high school dropouts who aren’t working."}]
