[{"comment_id":"948553515267521","commenter_b":"Hillary is a big fat liar and she will never be president.","commenter_a":"Lol","post_message":"This team is the only thing left that can stop Donald Trump.  We’ve got to leave it all on the field here, and we need contributions from Facebook to reach our goal of 100,000 by midnight. Will you chip in? hrc.io/2d4999O"},{"comment_id":"10153772364848132","commenter_b":"Such a strong woman...","commenter_a":"What a wonderful tribute to your husband this morning Kathie Lee... May God be with you and your family at this difficult time...","post_message":"This emotional tribute from Kathie Lee Gifford is so touching."},{"comment_id":"1723610494573092","commenter_b":"Thanks a fucking lot to the woman who decided to skip her period and have this douche","commenter_a":" Marihuana is not physically addictive, but isn't pshycologically just as dangerous!?! Just because one bad and dangerous thing(alcohol) is legal - does not mean that legalizing another is a good idea!!!","post_message":"Alcohol is 114 times more deadly than marijuana.  Like ATTN: on Facebook."},{"comment_id":"875427632505785","commenter_b":"I prefer to be even more accurate than that. The legal term is \"Illegal Aliens\".","commenter_a":"Hey Fox 10! I love you, but this has to stop! It's ILLEGAL IMMIGRANTS NOT JUST IMMIGRANTS! Immigrants are preserved for those who came here LEGALLY. GET WITH IT!","post_message":"More than 1,800 immigrants that the federal government wanted to deport were nevertheless released from local jails and later re-arrested for various crimes, according to a report released Monday. What do you think about these findings?"},{"comment_id":"1792493044351097","commenter_b":"For the safety of the country, her and everyone linked to her SHOULD BE PERSUED, THEY NEED TO DO IT. Unless all this was just political carpet-bagging, I'd hate to have to believe that, but their out to break this country, and if they aren't taken to task They Will Break This Country!!! Trump, keep your promise, were counting on you...","commenter_a":"He's just another elite ..with promises to get elected and being schooled by the negro ..he never meant to do anything he said ..he panderd to us all..","post_message":"President-elect Donald Trump and his transition team signaled Tuesday that his administration will not pursue further investigations of Hillary Clinton, backing off a vow on the campaign trail to appoint a special counsel to probe his Democratic rival secret email setup as secretary of state and suspected pay-to-play deals involving her family foundation."},{"comment_id":"10153469800395671","commenter_b":"The fact she had felony DUI charges in the waiting... leads one to think she has done this more than once. \"...facing felony drunken driving charges and cruelty to a child stemming from a previous incident.\" I doubt that she was so unlucky that the one time she went drinking then driving, she got into an accident and was arrested for DUI. This is usually a pattern behavior.","commenter_a":"Your not innocent when you drive drunk, multiple times. Your a murderous person that cares less about others even your own children! Wake up !","post_message":"The woman who was driving a car that crashed and killed five people this past weekend was facing felony DUI charges and cruelty to a child stemming from a previous incident."},{"comment_id":"10153510075534087","commenter_b":"So, there is no room for reasonable art of the deal on either side, now? Remember what happened in 2012, fellow Republicans. You didn't turn out because Romney wasn't \"conservative enough\" for you. Then you did nothing but whine and bitch and blame it on voter fraud and your grandmother's Impetigo. The problem is not PEOPLE a from another country, it is SUBSIDIES that politicians buy votes with and ABUSE of unskilled labor and QUOTAS set by those who use prejudice to their advantage. We cannot round up 12 million entrenched undocumenteds, nor should we- it would be political and fiscal suicide. So let's get an electable candidate, get him in the WH, and start doing what we can to enforce immigration laws that protect us from terrorists and criminals, the ones Obama and this DOJ flip the bird to the SCOTUS a about, create an environment where inclusion with ...","commenter_a":"Trump all the way to the White House.","post_message":"“Marco Rubio is the front man for the open borders syndicate,” Donald J. Trump's senior policy adviser Stephen Miller said in a radio interview. “And understand this, Marco Rubio is determined to finish what he started with the Gang of Eight bill and to be President Obama’s third term on immigration.”"}]
