[{"comment_id":"10152731683061234","commenter_b":"Hey Mary... Go suck some cock","commenter_a":"yes, we the teachers, fire fighters, and police tried to tell you all! He is a liar and a crook and a bully","post_message":"Gov. Christie is probably hoping his 2016 presidential aspirations don't hinge on New Jersey voters. That's because a new Rutgers-Eagleton poll shows most Garden State voters believe he's a poor fit for the Oval Office."},{"comment_id":"10155824563490725","commenter_b":"White girl","commenter_a":"I am praying 'IN JESUS NAME' that Donald Trump becomes our President, WE should all pray 'IN JESUS NAME' that Donald Trump becomes our President so we can get our America back to the way God wants it to be. I know with Donald Trump as our President he will 'Make America Great Again', Amen!","post_message":"The U.S. will invite El Chapo, the Mexican drug lord who just escaped prison, to become a U.S. citizen because our 'leaders' can't say no!"},{"comment_id":"10153422739691167","commenter_b":"Oh goodie, now pass the popcorn.","commenter_a":"Who gives a damn? Why was he looking at her? I bet he kept watching nasty irrelevant ass","post_message":"Rudy Giuliani and Fox News are livid at Beyoncé this morning."},{"comment_id":"10155818852335354","commenter_b":"Fucking assholes!! The Dukes weren't racists!! God this country is full of weak kneed liberal scum!","commenter_a":"This is really getting crazy,who,s running this country anyway.We didnt used to have such nonesence.","post_message":"Absurdity..."},{"comment_id":"10153842036026336","commenter_b":"Is that all....disgusting? We can rid the nation of this vermin if we decide to get together and do it.","commenter_a":"Oh he didn't misread anything. He knows exactly what's going on and it's all part of his agenda to destroy America. Disgusting.","post_message":"Charles Krauthammer said that Obama's strategy to fight ISIS is not working because 'he thinks radical Islam is a passing phase.'"},{"comment_id":"1080503548665334","commenter_b":"Fry that evil cow!","commenter_a":"Liar liar North Korean Pants suit is on FIRE!!!!","post_message":"“Stunning”"},{"comment_id":"10153349534435667","commenter_b":"Nice rack, Mary","commenter_a":"Bengazi butcher leading the uneducated I assume because a smart common sense person would never vote for her.","post_message":"'We're not taking anyone, and we're not taking anything, for granted.'"}]
