[{"comment_id":"803156879823481","commenter_b":"And people shouldn't look, it's wrong, people have self control, they should use it rather than having breasts being sexualised","commenter_a":"Hey ladies, breast feed away....just remember...there are creepy, shady guys out there who get off on that...why draw attention to yourself...she could have easily done that somewhere else...she wanted the attention...just fkn stupid","post_message":"This stranger started harassing a woman because she was breastfeeding at Target  but customers and staff defended in the most beautiful way."},{"comment_id":"785245424951309","commenter_b":"Girl go sit down somewhere","commenter_a":"those that vote for the \"first female\" president will get the same crap that the \"first black\" man president gave us.","post_message":"President Obama is speaking at a \"Get Out The Vote\" rally in Ann Arbor.  Read more about his visit: bit.ly/ObamainAnnArbor"},{"comment_id":"488489361275658","commenter_b":"Don't think she will get off easy this time.","commenter_a":"She will get off easy because she's a cops wife","post_message":"A cop's wife did this to another cop's wife. I wonder what on earth she was thinking!"},{"comment_id":"10153465913933145","commenter_b":"Your mom took the time to raise you right....take the time to raise your children right !","commenter_a":"This kid didn't have to go thru this were was the mama, I hope the kid has been taken out of the home? Why did the grandmother didn't do anything for the girls. We live in a crazy world?","post_message":"A father is facing child abuse and drug charges after police say he beat his daughter because she didn't get enough candy while trick-or-treating."},{"comment_id":"1028820693878107","commenter_b":"Same maturity level as kindergarteners.","commenter_a":"Republicans should allow weapons at their convention. ..loaded weapons. ..that would make a great pay for view","post_message":"Worst idea ever."},{"comment_id":"10152657458940047","commenter_b":"First get your children out of that muslim so called college. Stop paying tuition. Shut it down. It is now a muslim training camp. Congress must shut off funding. Senate and House must stop acting like they dont work for us and get all Muslims out of this country. Enough is enough!","commenter_a":"Operation Paperclip: 69 Years Later: @webpagelink","post_message":"ISIS militants and Hamas jihadists conducting training camps on American college campuses is no different than a training session for student athletes?    According to the Assistant Dean of Students at Cornell University they are.  Astounding."},{"comment_id":"10153727792982217","commenter_b":"Written by a 14 year old, no doubt!","commenter_a":"300 times more massive??? Someone needs sacking and a lesson in English 😂😂","post_message":"After a five-year journey, NASA's Juno Mission to Jupiter is ready to apply the brakes.  #BBCGoFigure"}]
