[{"comment_id":"10154292764041162","commenter_b":"No Theresa but implying that passing through narrow corridors and jumping fences is the only way immigrants \"cross the border\" is just idiotic. Again, not all undocumented immigrants \"jumped fences & crossed the desert\". Many overstay visas, meaning they went through a border check-point.","commenter_a":"\"I felt like I was crossing the border!\" Best line ever!!!","post_message":"WATCH: Trump comments on entering convention surrounded by protesters. \"It felt like I was crossing the border.\" @webpagelink"},{"comment_id":"10153168898035950","commenter_b":"Says the jaded soul. We still love you.","commenter_a":"He really thinks his opinion really matters. I hope and pray to God he loses really bad so he can get off his arrogance. He is a very insecure man. You can see how he talks and communicates his body language very insecure man. His life is a big lie and is willing to say what it takes to take the country down. Amazing some coat see right through him. Must not be very bright people.","post_message":"The secret to real estate mogul Donald Trump's popularity in this election season has eluded pundits, pollsters, the Republican establishment, and really, everyone else. \"Honestly it's my looks,\" Trump said before a rally in Atlanta on Saturday. \"I'm very handsome. That's the only thing I can think of right now\""},{"comment_id":"10153794663986491","commenter_b":"More reasons for not having a women as President....","commenter_a":"\"Good guy with a gun\" turned murderer in 20 seconds.","post_message":"\"It was a family argument that turned into a shooting.\""},{"comment_id":"10153749072149411","commenter_b":"This is why aliens don't want to talk to us","commenter_a":"There are no aliens from other planets riding around in spaceships people. If you really want truth read the Bible.","post_message":"An alien invasion unlikely at all?"},{"comment_id":"10153161322294726","commenter_b":"If she moves her lips She is lying","commenter_a":"Think she bad now if she WIN. White house .no stopping HER","post_message":"WATCH: Bombshell Report Clinton Did Use Private Email For State Department Business"},{"comment_id":"10153939512524087","commenter_b":"@username .... Why would anyone vote for Hilary the war monger ? She stands for nothing that benefits American citizens... all she talks about is illegals and bringing in Muslims... blacks are totally used by her.... She dumps illegals in poor black communities... but will never have Muslims or illegals where she and her friends live.... people like you are a joke.. total fools.. and Trump is not a racist stick that card up your asss... its old used outdated game...","commenter_a":"After Trump loses in the election I wonder what's next for Republicans. Atleast he brung out the closest racist and exposed the Republican party for what it is","post_message":"Prominent Donald J. Trump critic GOP Sen. Jeff Flake had kind words to say about Trump following last night's nomination speech at the Republican convention."},{"comment_id":"925749584134949","commenter_b":"May they name a FEMA camp after you. What a totally ignorant woman you are! Unbelievable!","commenter_a":"You need some solid intelligence. We had these under Bush , he is the one who stated war and depleted the reserve funds. Obama replenished them. I am happy to have such a high IQ, highly educated president with multiple graduate degrees including a Doctorate in Constitutional Law. He even taught it at Harvard. I have worked on secure govt projects . The govt can show power to those in the Middle East . Fox News? keeps the fear mongering going. It has a 20% accuracy rate. The elites are the Koch brothers & Corporate powers. Get a reality check!","post_message":"In case you missed it, here's the top story from Tuesday: The recent exposure of the nationwide Jade Helm 15 exercise has made many people suspicious, and with good reason. Federal crisis exercises have a strange historical tendency to suddenly coincide with very real crisis events. The elites are clearly preparing for something big. When the elites wage war on America, this is how they will do it: They will control public opinion, control the public, isolate population centers, decapitate leadership, and initiate fourth-generation warfare. Crisis is the best weapon the elites have at their disposal, and exercises like Jade Helm show that they may use it in the near term. The defense that defeats crisis is preparation — preparation not just for yourself, but for others around you. War is coming, and while we can’t know the exact timing, we can assume the worst and do our best to ..."}]
