[{"comment_id":"10154492827869497","commenter_b":"Who can believe this story?? After all the woman ?????","commenter_a":"hahaha","post_message":"Highlights Of President Bill Clinton's 2016 DNC Speech"},{"comment_id":"1224318647634888","commenter_b":"@username BUILD THE WALL PUSSY. BYE BYE.","commenter_a":"LOL AYEEEEE","post_message":"Aren't teachers suppose to be the example? #WSHH"},{"comment_id":"907187719304084","commenter_b":"Nope. She shouldn't.","commenter_a":"She shouldn't have to apologize. *kanye shrug* Jay","post_message":"Lindsay Lohan Apologizes For Using The N-Word On Social Media While Referencing New Kanye Song"},{"comment_id":"1617460714934208","commenter_b":"Hopefully she'll waste away and go away","commenter_a":"Apparently not","post_message":"Since she's not moving to Canada, Dunham could always try eating all that crow."},{"comment_id":"10154234015931337","commenter_b":"You poor ignorant cunts...","commenter_a":"Howard Stern's Face is a roast all in it's own. Those giant dentures, cheap wig, and dick nose.","post_message":"FROM GIRALDO TO JESELNIK... These are the most vicious roast takedowns of all-time.'Comedy Knockout' premieres tomorrow on truTV at 10:30/9:30c. @webpagelink #ad"},{"comment_id":"10153527313703525","commenter_b":"You can kiss my dick","commenter_a":"Florida has alot of crazy old out-dated laws that are on the books!! Check it out and you will see!!","post_message":"'SHACKING UP' LAW: As soon as the governor signs the bill, it will no longer be illegal to live with someone you're not married to. STORY: @webpagelink"},{"comment_id":"822921484411860","commenter_b":"Run him out of America or sent him to Islam for good !","commenter_a":"Absolutely YES! Police are bound by laws and orders that do not allow any other real form of expressive protest. This sends the message loud and clear. It is also a great honor of solid support to the murdered officer whose Mayor helped provide the hostile environment in which this officer was murdered.","post_message":"Was this the right move?"}]
