[{"comment_id":"1274781525895650","commenter_b":"A+ student in everything but Math... Since I finished school 20 yrs ago I've never had to use Algebra...not even once.. It depends on your career, I guess..","commenter_a":"If you're too dumb to pass algebra, then you shouldn't be allowed to graduate High School. Then, you should be forced to live the rest of your life working at Wal-Mart with all the other people that couldn't pass algebra...or even worse, be a Fox News contributor.","post_message":"The willingness with which these people embrace ignorance is baffling."},{"comment_id":"1589075444729621","commenter_b":"To keep the Marxist Corrupt Hillary out!","commenter_a":"Why should anyone care what a theologian thinks about a political choice?","post_message":"ICYMI: Theologian Wayne Grudem lays out the moral case for voting Trump."},{"comment_id":"974467552593717","commenter_b":"Fuck this cunt","commenter_a":"Love you Barbara...","post_message":"Senator Barbara Boxer, in 20 minutes, gave the BEST smackdown to the GOP I have ever seen -- calls them a \"national disgrace,\" and tells them to end their \"hostage\" taking of the DHS because of their \"hatred for the president.\""},{"comment_id":"10153035327685399","commenter_b":"stop insulting snakes","commenter_a":"It's the eyes with this one... It's the kind of eyes you've seen on a snake.. Just makes your skin crawl","post_message":"Whoops"},{"comment_id":"10153220983921770","commenter_b":"@username Then why did her husband push Trump to run?","commenter_a":"Trump is nothing but a Clinton crony who is trying to split the Republican vote to ensure a Clinton win. He is NOT a Conservative! @webpagelink","post_message":"After PolitiFact found that Donald J. Trump's first television advertisement uses footage of immigrants pouring over the Morocco-Spain border instead of the U.S.-Mexico border, the Trump campaign gave a blunt response to NBC News."},{"comment_id":"10153907295491680","commenter_b":"@username your a bitter woman","commenter_a":"Another classless moron that thinks sexual abuse is ok 👌 way to go Rush, you are pathetic","post_message":"\"Men brag,\" Rush Limbaugh said on his long-running radio show."},{"comment_id":"10153420675841162","commenter_b":"They should be out in the wild with their mom","commenter_a":"Michelle Papandrea","post_message":"ADORABLE! Take a look at the latest arrival at Metro Richmond Zoo in Virginia: 3 cheetah cubs..@webpagelink PHOTOS: @webpagelink"}]
