[{"comment_id":"10153956256701336","commenter_b":"Exactly!","commenter_a":"government is always looking for a new tax. The gas prices should be lower for what crude is going for right now.","post_message":"The price of Brent crude in the United States has fallen below $40 a barrel – more than $30 lower than in May of 2015."},{"comment_id":"813299352038859","commenter_b":"You're ignorant whores on government programs. Stfu.","commenter_a":"This is her response. She would kill a newborn. Her OWN newborn even. Enough said.","post_message":"Thousands of protesters gathered at the US Capitol this week..."},{"comment_id":"1236747943048399","commenter_b":"#NeverEverHillary #CrookedHillary #LockHerUp","commenter_a":"I can't believe the uneven coverage you get. Trump lies daily and people don't care. You don't even have to do anything wrong and the republicans and media blow it out of proportion.","post_message":""},{"comment_id":"447163662137908","commenter_b":"Sinc you obviously are just a walk around, I'll ask you directly. HOW DOES LIMITING THE LAW ABIDING HELP ANYONE?","commenter_a":"You forget one little thing about this video. No matter what type of gun is used, gun laws only make the law abiding victims and give criminals an advantage.","post_message":"When the 2nd Amendment was written, the world did not have machine guns or assault rifles."},{"comment_id":"10155161723871037","commenter_b":"You are so gross ...","commenter_a":"States where mestizos who refuse to learn English because we made it possible to not have to learn English and tell them assimilation is bad, have horrendous scores.","post_message":"Number 1? Massachusetts."},{"comment_id":"10153731050907464","commenter_b":"@username THEY'RE A LOT OF SICK TEABILLIES!!","commenter_a":"You referred to the Colorado Springs shooter who killed 3 people as a \"transgendered leftist activist\". Since when does a \"leftist\" spread anti-Obama propaganda and refer to fetal tissue as \"baby body parts\" as you and your ilk do? You are a disgrace for spreading even MORE rhetoric and you are unfit to be president.","post_message":"An impression from my favorite movie? As you wish..."},{"comment_id":"939447022776130","commenter_b":"1 Muslim + 4 wives = 32 children!!","commenter_a":"Our country has so many homeless families and so of these people would be so grateful to be able to benefit from a number of these programs, and not not offered to them. If we have the housing and benefits for foreign refugees than we have the resources to help our own citizens first. And the positive side to this, we won't have to worry about any of these people killing other Americans","post_message":"Michigan Gov Snyder, Senator Peters And CAIR Pushing For Huge Influx Of Muslim Migrants...Don't The People Have A Choice?"}]
