[{"comment_id":"1092696630813956","commenter_b":"Ur aunt eats them out of a can","commenter_a":"Quan Lawson","post_message":"This massive octopus escaped through a tiny hole in a fishing boat."},{"comment_id":"1027700850605035","commenter_b":"Russia does not need turkey; Turkey are the back stabbers lying pigs!","commenter_a":"But Russia will miss alot if they cut relations wz Turkia","post_message":"Russia's Foreign Minister Sergei Lavrov has rejected the possibility of normalizing relations with Ankara after Turkey downed a Russian warplane inside Syria."},{"comment_id":"1058949000851488","commenter_b":"Of course it would. My God you people with your guns. Enough already.","commenter_a":"None of the proposed legislation would have saved a single life... this is all political theater and a cover for the Democrat's failed foreign policy.","post_message":"Senator Chris Murphy: \"I'm mortified by today's vote, but I'm not surprised by it. We learned in the months after Sandy Hook that the NRA has a vice-like grip on this place. Even when 90% of the American public wants change.\" Full video here: @webpagelink"},{"comment_id":"10153529907489087","commenter_b":"Anybody is more trustworthy than Hillary","commenter_a":"Bernie is the only one to stand up to corruption, and is honest. Hillary changes her opinion like the wind to appeal to voters, she is bought and sold. Nothing she says is genuine.","post_message":"Bernie Sanders is still seen as the more trustworthy candidate, according to a new poll, with an overwhelming 75 percent of respondents agreeing he is “honest and trustworthy.”"},{"comment_id":"10152994930245671","commenter_b":"Because she knows she can get a pay day from the police.","commenter_a":"Her brain is definitely injured. She says she wanted the cops to back off, but if they hadn't been there she would be crying a different tune - saying they should have been there. She really thinks with all those guns and ammunition, that they would have just found there way home? They would have executed her.","post_message":"“My hopes for the whole thing were the cops would just back off, let these guys get where they needed to go, so me and Misty could find our way home somehow.\""},{"comment_id":"10154598591011756","commenter_b":"Ooh never heard that one...sweet","commenter_a":"Yes, I'm sure the Trump children know all about working. What's that saying? Born on third and think they hit a triple.","post_message":"The theme of day two of the Republican National Convention is \"Make America Work Again,\" with speakers ranging from House Speaker Paul Ryan to Tiffany Trump and Donald Trump Jr."},{"comment_id":"10153852304249160","commenter_b":"Trump deport this foreigner","commenter_a":"Obama and Hillary need to get out of Washington & Politics period!..both are criminals and traitors to the American people!.they can take that communist Sanders with them. Trump 2016","post_message":"Hillary Clinton's numbers are collapsing."}]
