[{"comment_id":"1272561409477278","commenter_b":"Bitch stop lien ^","commenter_a":"Why not tell the full story instead of half?","post_message":"Over her son littering though? #WSHH #Texas #Cop"},{"comment_id":"1808975196000308","commenter_b":"This news is pretty old. ..... hanging on by a thread NBC","commenter_a":"Chris El Paisitahh","post_message":"The painter who turned Donald Trump's penis into a viral sensation says she's received death threats and alleges one Trump supporter punched her."},{"comment_id":"1044675162261267","commenter_b":"Now go build my wall","commenter_a":"*You're *Putting","post_message":"Right!? I sure hope so!"},{"comment_id":"10154137959598701","commenter_b":"Dumb tweaker bitch","commenter_a":"Debbie someone actually fell for it.","post_message":"In Case You Missed It on Good Day Oregon: A contender for world's dumbest criminal. A Texas woman fell for a police department joke: a Facebook post with a warning about meth and heroin \"contaminated with Ebola\"."},{"comment_id":"10153697709133984","commenter_b":"He'd never make it to prison if that was my daughter or granddaughter. But since he will hopefully go to prison, its a shame someone never showed him an illustration on a blackboard about the size of your asshole before prison and the size it is when/if you get out. Maybe he would then have had sense enough not to rape a child. When he goes to prison he's going to find out what real rape is like...good.","commenter_a":"Castration sounds good to me. He wouldn't do it again","post_message":"This sick punk raped a young girl and admitted to it... but the disgusting thing is his absurd excuse. Our country is in deep trouble and this proves it... this little girl did nothing to deserve this."},{"comment_id":"10152799476958598","commenter_b":"she is so un educated on what abortion is!!","commenter_a":"I beg to differ...","post_message":"What???"},{"comment_id":"1776736589270843","commenter_b":"People don't care it shows what our country has become. Hillary will get plenty of votes","commenter_a":"Charged with 24 counts of fraud and still got 39% of vote. Unbelievable","post_message":"So long, farewell..."}]
