[{"comment_id":"826031280920782","commenter_b":"She's just disgusting to look at..","commenter_a":"About time now she can pack so she can leave !!#!!","post_message":"Liberal trash has no place on tv.  This is the best news all year.  Do you think Whoopi deserves to be kicked off the air?"},{"comment_id":"503579846468637","commenter_b":"Why argue with this man child?","commenter_a":"Remember the outrage over the clock kid? Let us see if libtards and media worry so much about Christians being singled out to die.","post_message":"\" He seemed skittish, always looking over his shoulder to see if anyone was watching.\""},{"comment_id":"672161809583667","commenter_b":"This gal is a piece of .......","commenter_a":"Nothing quick about judging this one. It's been years in the coming","post_message":"I'm sorry....I'm not a fan."},{"comment_id":"10153006205351051","commenter_b":"I would have shot him.","commenter_a":"I am glad he did what he did. This is what you do instead of standing around recording.","post_message":"This dad was driving his daughter to school when he saw a police officer on the ground with a guy on top of her. The guy was reaching for her gun. The dad didn't hesitate."},{"comment_id":"10153835379166336","commenter_b":"Cause white people suck","commenter_a":"That door was racist against white people! Ban all cruise ships and doors.","post_message":"A jury has awarded a man $21.5 million in damages after he was hit by a sliding door on a cruise ship.   MORE: @webpagelink"},{"comment_id":"1015593815224063","commenter_b":"impeach","commenter_a":"WORSE","post_message":"This is BRUTAL. Obama and his Zombies will NOT like this POLL. Which answer did you choose? This deserves 50,000K 'LIKES & SHARES!' @webpagelink"},{"comment_id":"10155118024265231","commenter_b":"No","commenter_a":"It depends on the relationship the bride has with the mother of her fiance's child. If they get along great! If she is simple and has secret feelings for him then no. There are so many different scenarios. What works for one group may not work for others. And it may not have to do with maturity.","post_message":"Your fiance's 'baby mama' wants to attend your wedding. Do you let her? #AskDemetria"}]
