[{"comment_id":"822379027897898","commenter_b":"How will she do that? She is one of the causes for the problem !!!!","commenter_a":"No they just rather let America be filled and run by people who hate America.","post_message":"“We are not going to be Donald J. Trump’s hate-filled America. Not now, not ever.”  Sen. Elizabeth Warren told a fired up crowd that Hillary Clinton will fight to end discrimination in America."},{"comment_id":"10153666561423984","commenter_b":"She doesn't know her ass from a hole in the ground.Correction,she know what her ass is huge.","commenter_a":"Kardashian doesn't have the brain capacity to make those decisions and you better believe Kanye has security we don't have. Go live in the hood, kimmie, and then you can tell us how to protect ourselves.","post_message":"BOOM! Kim K thought she'd talk about gun control laws, and it immediately blew up in her face.   Do you support gun rights in America?"},{"comment_id":"1720347271558389","commenter_b":"What a pathetic slut !!!!!!!","commenter_a":"Just another Wacko;showing her ignorance.","post_message":""},{"comment_id":"1230732883614387","commenter_b":"Well, since they found a genetic marker for homosexuality that automatically means that the same genetic marker influenes heterosexuality.","commenter_a":"No specific gene links heterosexual people and the preferred gender of their partners, and I'm fairly certain the same goes for gay people.","post_message":"The science of homosexuality."},{"comment_id":"903279336444237","commenter_b":"Sigh","commenter_a":"Joshua William Grant told you 😂","post_message":"Misogyny is misogyny."},{"comment_id":"1237347102949965","commenter_b":"You and me, (and millions of others, I'm sure), both!","commenter_a":"It isn't because she's a woman. I would stand in line for 5 hours to vote for Elizabeth Warren. Hillary? *shrug* It better be a short line.","post_message":"Here’s a strong but fair piece from the heart on the media establishment in DC by CNN’s Jeff Greenfield, whose long experience in politics and journalism began with Robert F. Kennedy back in the 60s."},{"comment_id":"10152886547876051","commenter_b":"Yep, every woman carries black tape in their purse. What they need is to carry.","commenter_a":"A piece of black tape and the whole situation could have been avoided.","post_message":"This woman was putting her shirt back on in the Target dressing room when she suddenly noticed something glowing."}]
