[{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"1083649161732572","commenter_b":"She belongs on the view , just her type 🐀🐀","commenter_a":"This woman is vicious & full of arrogance! Can't believe she can keep a man as her husband! Poor husband! How can he stomach this woman's character. She seems to be high all the time. Wonder if she's in session with Hillary before coming to her show. She deserves to take a hike & disappear from the Fox news screen so we can watch it again! Shooooooo Kitty!","post_message":"HOLY COW...!!!!!!  The TV fight of the century.  Newt tells Megyn she is obsessed with sex and calls her out for her pitiful coverage of Trump.  Megyn laces into Newt by telling him to get help with his anger issues.  It gets vicious.  VIDEO.  This will be the talk of the news tomorrow.  You get to see it now.  VIDEO  @webpagelink"},{"comment_id":"10152640565354135","commenter_b":"BOOO ! Fix our roads , decriminalize drug use ( since our prisons are flooded with NON violent offenders wasting everyones tax dollars on free room and board), allow Tesla Motors to do business in our state, handle the heroin epidemic going on in our cities and sub-urbs , preserve more forrest and farm land ............. He's not doing his job , he's pressed for his future candidacy for the white house , neglecting the nuances in his community.","commenter_a":"Go @username 2016","post_message":"America has been a nation that has always controlled events and yet today events control us. Why? Because leadership matters. It matters if we want to restore America's role in the world, find the political will to take on the entrenched special interests that continually stand in the way of fundamental change, reform entitlement spending at every level of government, and ensure that every child, no matter their zip code, has access to a quality education. So, today I am announcing the launch of the Leadership Matters for America PAC. The PAC's goal to get real leadership back in our country starts today. So, let's get to work! Join us at: @webpagelink"},{"comment_id":"10153183200188812","commenter_b":"They want marijuana sellers to be kept on jail for the lesson to make sure that they won't save lives of people who needs it, so more people can rely on prescription pills... There are cruel rich doctors out there who would pay the cops for good amount of money to keep their business running. Money ruins everything.. 55 years is too much. Child rapist should spend 55 years, not marijuana sellers. People sell drugs to provide for their families. Not everyone do it to get rich for themselves. Low income families has it harder when providing family because of health issues.. Some marijuana sellers could be good people too, it is just unfair to put them in jail for 55 years. How ironic that McDonald and other fast food chain restaurants sells junk food that can harm a lot of people while marijuana harms less people... But they can ...","commenter_a":"Those that advocate for and enforce these cruelties are the real criminals.","post_message":"“We have escalated punishments to the point that it’s crazy…' -- The cost of a 55-year sentence for marijuana: @webpagelink - Tonight on Nightline"},{"comment_id":"10153635830302061","commenter_b":"'@username Wow.....you are a wicked mean nasty woman!!!","commenter_a":"It was a great dance to encompass her whole journey on the show, but in no way does it compare to Nyle's or Paige's.","post_message":"WATCH: Ginger Zee & Valentin Chmerkovskiy's take the dance floor by storm in last night's Contemporary Dance to a cover of Coldplay's 'Adventure of a Lifetime.' Dancing with the Stars Season Finale continues TONIGHT!"},{"comment_id":"10153949050391037","commenter_b":"One word: uneducated","commenter_a":"Trump has had my vote from the start to finish ... Nothing anyone says can ' change ' my mind .... We need a business person in the seat to lead not be a tyrant.","post_message":"“During anxious times, it can be tempting to follow the siren call of the angriest voices. We must resist that temptation,' Nikki Haley said."},{"comment_id":"10152457331185736","commenter_b":"'@username try FUCKING OFF!","commenter_a":"143 year old coins and documents where buried in 1795? Something doesn't smell right.","post_message":"The time capsule buried by Paul Revere in 1795 has finally been opened and the contents date back to 1652.  Mobile: @webpagelink"}]
