[{"comment_id":"10152769166208271","commenter_b":"Tauna Corbin so a dead woman can drive a car?","commenter_a":"She broke the law. She could have KILLED the officer if she ran over him. Its called consequences for YOUR PERSONAL CHOICR.","post_message":"#BREAKING Denver Police Chief Robert White spoke to the public about the shooting Monday that killed a teenage girl in a stolen car. We are updating this report: @webpagelink"},{"comment_id":"10153734508783132","commenter_b":"I have often said this...there comes a time when women need to realize this","commenter_a":"Just because you can wear one doesn't mean you should.","post_message":"NENE LEAKES can definitely rock a bikini."},{"comment_id":"10154732145028690","commenter_b":"@username he will never be found guilty of those accusations. He's too powerful. That family is too powerful. And when it's the word of the victim against the word of the powerful accused, especially in cases of rape and sexual assault, we all know the public will side with the powerful beloved, charming, charismatic Bill. Especially when his wife is about to win a historic election. This speaks volumes about the rape culture in this country. This is the same story played across this country everyday. This is why so many women remain silent. As someone who values national security and the reputation and values of this country, I can't in good conscience vote for either of these abhorrent people. Trump is the orange muppet love child of Ford Fairlaine and Biff from Back to the Future, and the Clintons are the example of a powerful enterprise who represents ultimate ...","commenter_a":"Bill Clinton isn't up for election, that argument is lame and dead as some are trying to compare these events. What Trump said amounts to sexual assault...\"you grab them by the pu***.\" Trump has been accused many times of sexual assault and rape, with the latest accusation raping a 13 year old girl. If guilty, Trump should be spend the rest of his menial life in prison. Trump is unfit.","post_message":"\"Horrific\", \"sickening\", \"poisonous\" - Donald Trump blasted over lewd and sexually charged comments he made about women @webpagelink"},{"comment_id":"1071771339501789","commenter_b":"@username Blacks are Americans, so are whites on assistance, and American Latinos. I would rather support 20 million of them than 1 illegal Anchor baby and it's Family. Maybe all those Americans on assistance wouldn't need assistance if the illegals weren't taking the jobs Americans need.","commenter_a":"My mother was a volunteer Pink Lady at the hospital in Weslaco Texas and she verified several times to me that Latinos routinely arrived in labor so they had no time to get back to Mexico. They wanted their babies born in America.","post_message":"Astonishing video proving Donald J. Trump is right... Ten percent of the people born in America today are to children of illegal aliens..."},{"comment_id":"1030490090346441","commenter_b":"Time to build a wall around Chicago.","commenter_a":"It's white people's fault...or financial disparity, or whatever else they want to blame all their actions on","post_message":"Chicago Black Gang Member Lured Child From Playground And Executed Him Point Blank You mean #blackLivesMatter protestors are not rallying for this 9 year old boy who was executed by a thug! I guess his Black Life Didn't matter @webpagelink"},{"comment_id":"10156208772020354","commenter_b":"Now","commenter_a":"I agree....!","post_message":"\"We’re like… Charlie Brown trying to kick the football every time and they keep taking it away…I encourage the Republican Party to get off their ass and fight like we pay them to.”"},{"comment_id":"10154959476789411","commenter_b":"@username president Melania Trump after Pence. Lollll","commenter_a":"\"Psychologists tell us that 3 and 4 year olds often lie to get their way because they don’t have a moral understanding of the importance of telling the truth. 4 and 5 year olds often bully other children because bullying is a way of asserting their dominance and making themselves feel more secure in a world that is beginning to seem very scary. 5 and 6 year olds are often thin-skinned and vindictive toward peers who criticize or make fun of them because they are at a stage when they have exaggerated concerns about the opinions of others toward them. 6 and 7 year olds are often excessively narcissistic because they don’t understand their place in the world and haven’t yet developed the moral capacity for empathy. It follows that Donald Trump’s emotional age is somewhere between 3 and 7. Assuming that the Electoral College makes him President on December ...","post_message":"Unlike most presidents, Carter has refused to let his successors do the job they were elected to do. On Jan. 20, he will be pushed aside by Obama."}]
