[{"comment_id":"10153232887939071","commenter_b":"@username she's a bad asss","commenter_a":"Zelal Tas","post_message":"The Canadian model who is fighting ISIS in Syria says the terrorists are all cowards."},{"comment_id":"1120823271280022","commenter_b":"What you actually mean is that all women are idiots","commenter_a":"Proof that republican women are idiots.","post_message":"If we're going to be honest here, the thing that might be most shocking is that ANY women could look at ANY of these candidates in a favorable light."},{"comment_id":"1121161091293379","commenter_b":"I thought she was 100","commenter_a":"Nick Foley @username @username bruh.. lol this is about to be mom","post_message":"A man named Sidomejo from Indonesia has documents that claim he was born in 1870 – which may mean he is 146 years old."},{"comment_id":"10154607888371729","commenter_b":"What does carrying has to do with this?","commenter_a":"People wanna stop going to target bc of this but still eat chikfila after its owner gave a 100,000$ donation to thelbgt community months ago but still eat there what's the difference hypocrites","post_message":"Target just received a serious dose of reality..."},{"comment_id":"10156175309065231","commenter_b":"She lookin to get paid! I'm sorry ....she a hoe","commenter_a":"Voting democrat","post_message":"Pierson feels her new alliance with the Donald is \"perfect.\""},{"comment_id":"10156131278050725","commenter_b":"only one that needs to apologize is hillary the corupt crook who lined her pockets and sold out the entire USA to make millions. where are those emails hillary?","commenter_a":"HELL NO!!! He doesn't defend America. When he starts defending America and her citizens, then we can start defending him.... if he does something right, that is.","post_message":"Am I morally obligated to defend the President every time somebody says something bad or controversial about him? I don't think so!"},{"comment_id":"766086360248608","commenter_b":"Because he hits women! He is no man!","commenter_a":"This punk need to be behind bars in jail lock him up.","post_message":"Rapper Chris Brown Blasts Trump And Police: \"F*** Trump And F*** The Pigs\" This punk needs to learn some respect. Can we get 30,000 'LIKES' to have him deported?"}]
