[{"comment_id":"642882945885651","commenter_b":"Not really. Go read history..that's a facade...","commenter_a":"LOVE the Bush family! So presidential, respectful, and patriotic. Something I've missed for the last 8 years and the coming 4 years.","post_message":"President Obama, President George W. Bush, First Lady Michelle Obama, former First Lady Laura W. Bush, and others speak at the opening ceremony of the Smithsonian National Museum of African American History and Culture."},{"comment_id":"10153905231158984","commenter_b":"Idiot. She'll find out how wrong this is some day. It might be hot.","commenter_a":"So sorry to hear this....","post_message":"She's the biggest female star in Hollywood right now, and she just made a sickening claim about Christians and the cross of Christ. This is just disgusting. She has a new movie out. Let's make sure she doesn't make a dime off of us!"},{"comment_id":"10155061225139726","commenter_b":"The woman wearing this would probably be beaten to death. Better off carrying a gun!","commenter_a":"Women in America carry guns. What are we back to the middle ages? women at the time wore chastity belts to protect themselves from the muslim ancestors of the same ones today who were terrorizing Europe back then.","post_message":"It's a modern day chastity belt."},{"comment_id":"677448822404448","commenter_b":"These women are idiots!!!!!!!!!!","commenter_a":"OMG!!!","post_message":"\"We finally have this god that's going to come down and help us all.\" Here's what two \"Trumpettes\" think about Donald J. Trump's Twitter rant against former Miss Universe Alicia Machado. Watch more: @webpagelink"},{"comment_id":"10158110141675500","commenter_b":"Why do u say that? I totally disagree!","commenter_a":"Disney sucks","post_message":"DISNEY DISCOUNT! Sunshine State residents can save big on Disney park tickets. Details >> @webpagelink Disney Walt Disney World Epcot - Walt Disney World"},{"comment_id":"905390669594112","commenter_b":"@username you must have a patheticly small one if it turns into an innie","commenter_a":"If you have an innie, use the women's. If you have an outie, use the men's. That's not difficult.","post_message":"BREAKING: The Supreme Court just ruled on their first transgender case..."},{"comment_id":"10153233109924170","commenter_b":"DEPORT ALL ILLEGALS !!!!!! Put Americans back to work !","commenter_a":"hes an idiot","post_message":"Chuck Schumer is doing his absolute best to play the blame game in regards to his terrible immigration bill. ...And it's all about paving the way for 2016 race-baiting."}]
