[{"comment_id":"10150832219144999","commenter_b":"Are women able to have more than one husband?","commenter_a":"Polygamy is legal in my country.","post_message":"Could the U.S. Supreme Court decision that recognized a right to same-sex marriage presage a constitutional right to plural marriage? Read on in The New York Times Opinion."},{"comment_id":"680360518742918","commenter_b":"Yeah ted😄,, me and my uncle Malcolm Fisher love ya!!!","commenter_a":"I refused to watch his garage band act but I'll take your word on it!","post_message":"Tonight America saw a powerful demonstration that it is time to move on beyond President Barack Obama. #SOTU2015"},{"comment_id":"10153030669318961","commenter_b":"Yeah, sure pal.","commenter_a":"Mother Jones - HAHAHAHA. That's about as credible as Mother Goose, in other words - a fairy tale.","post_message":"If you have time to read an article today, make it this one on the true costs of gun violence"},{"comment_id":"10154754635023352","commenter_b":"Bridgette,u r s/o but ur lettin dem bitches knw wat it is.","commenter_a":"Her vagina is probably getting dry and can't keep up with him anymore..jk","post_message":"It’s over! Jennifer Lopez, 47, splits from toyboy Casper Smart, 29, after five years together"},{"comment_id":"1056647814370639","commenter_b":"Let's be honest. HE is not confused. HE is still a MALE. And absolutely a disgrace.","commenter_a":"NO, are you kidding me?","post_message":"Do you agree with MAC's decision? Yes or no?"},{"comment_id":"10153622833731519","commenter_b":"She says what her market wants to hear. She, and all the ilk like her, are just media whores who spout filthy hate and get PAID big bucks for it.","commenter_a":"At least she didn't say that we need to keep the tradition of having only presidents on our currency.","post_message":"Greta Van Susteren nearly gave herself a rage stroke last night..."},{"comment_id":"10154889301650180","commenter_b":"Mine must have Bluetooth capability or something... every time I use it for lane changing, the car behind me speeds up to block me... weird!","commenter_a":"Oh so there not decorations for the holidays? Because it seems that's the only time I see people really using them","post_message":"Indiana State Trooper films hilarious PSA about this major vehicle safety feature called a \"turn signal.\" @webpagelink"}]
