[{"comment_id":"608627489270433","commenter_b":"More like the other way around...in Indian culture it's arranged for money issues, not love...and then the wife's are treated like maids...atheist she can be a maid to a person who loves her, for her and not for the money","commenter_a":"At least he didn't end up stuck with her.","post_message":"This has to be the worst Bride OF ALL TIME!"},{"comment_id":"10152850363352217","commenter_b":"Women should be allowed to wear what they want to. It should be a free world for men and WOMEN","commenter_a":"This is the silliest thing ever!","post_message":"Why two opposing campaigns about what women wear are spreading across the Arab world bbc.in/1LU4ka8"},{"comment_id":"455232604658620","commenter_b":"Hillary Clinton!!!","commenter_a":"Bernie Sanders!!!","post_message":"Listening is always better."},{"comment_id":"1724833864402419","commenter_b":"We're going to drive one right up that midgets rectum","commenter_a":"Hey its cool. He's just demonstrating our first amendment rights. Lol","post_message":"NKorea claims could wipe out Manhattan with hydrogen bomb..."},{"comment_id":"10153362630049641","commenter_b":"Whatever tickles your fancy. Hope you get a free lifetime of ky jelly .","commenter_a":"This country is going to hell in a hand basket.","post_message":"The White House takes on rainbow hues to celebrate the Supreme Court's marriage equality decision: @webpagelink"},{"comment_id":"1189675974461986","commenter_b":"'@username she will not loose","commenter_a":"The real problem is Bernie Sanders is NOT a democrat! No wonder he and democrats are having a problem. He should have run on his own party-- as the socialist he is.","post_message":"It's not just the Republican Party that seems to be having a problem uniting..."},{"comment_id":"536936909817584","commenter_b":"both plans are BS","commenter_a":"Interesting. Makes sense though. Someone has to pay for all the freeloaders and the Crap that the Dems promise them.","post_message":"Here's how much your taxes could decrease under Donald J. Trump and rise under Bernie Sanders. @webpagelink"}]
