[{"comment_id":"10154131291436756","commenter_b":"Dinosaurs eat man. Woman inherits the Earth.","commenter_a":"God creates Dinosaurs. God destroys Dinosaurs. God creates Man. Man destroys God. Man creates Dinosaurs.","post_message":"\"God made man, man rejected God, and God won't stop chasing man until he wins him back. And that's the simple story of God\" — the very story Franklin aims to tell with his music, without all the rules of religion."},{"comment_id":"793702420758020","commenter_b":"Safer boarders and no more refugees!!!!!!!!!!! WAKE UP AMERICA!!!","commenter_a":"Fox news! Enough said!","post_message":"Two Middle East refugees have been arrested on terror charges in California and Texas. fxn.ws/1Rnioji"},{"comment_id":"1077005215689340","commenter_b":"Hillary is an establishment hoe","commenter_a":"She is the most qualified candidate in this race. I strongly believe, Life will be better with @username. <3 #imwithher #weareforher #Hillary2016 #feelthehill #yeshill","post_message":"Anyone asking for your vote has to grapple with the reality of inequality in America—and offer real plans to fix it."},{"comment_id":"10153812349369170","commenter_b":"\"Hope\" is the refuge of somebody who has nothing substantive upon which to base what he wants to believe.","commenter_a":"Why do Christians continue to believe that they and their beliefs are entitled to special treatment?","post_message":"A group of angry atheists waged war on this town because of a touching veterans memorial. When the townspeople got wind of what was going on, they hit the atheists back HARD. This is awesome!"},{"comment_id":"10155201075949657","commenter_b":"why would a woman vote for this asshole he calls them FAT PIGS","commenter_a":"I'm surprised women don't value honesty more in light of Hillary's proven lies","post_message":"Trouble."},{"comment_id":"10153637483924714","commenter_b":"White people rock!!!","commenter_a":"^^^when the police start killing your people and getting away with it then you tell how how to protest/feel #nojusticenopeace","post_message":"Philosopher and activist Dr. Cornel West was arrested during a demonstration outside the Saint Louis federal courthouse."},{"comment_id":"10153134132200933","commenter_b":"Adan the total pussy.","commenter_a":"Kasich is the best up there by far","post_message":"Check out Gov. Kasich's opening statement from tonight's #GOPDebate."}]
