[{"comment_id":"10155465475828797","commenter_b":"The president of Mexico is worried that if the drugs stop coming into the US , he will lose lots of money! Plus if all the Mexican criminals are send back , Mexico will be in more havoc !","commenter_a":"We The united states of America want President Trump to build a Border Wall just like Mexico! Also I would like to see the same Mexican LAWS on immigrants coming into their country, the same Mexican Law's in United States","post_message":"WATCH LIVE: Sec. of State Rex Tillerson and DHS Sec. John Kelly hold a joint press conference Thursday in Mexico City after meeting with Mexican officials, including President Enrique Peña Nieto."},{"comment_id":"10153554902129087","commenter_b":"Ha haaaa!!! I think it's funny you fools immediately claim racism when somebody wants to do something that doesn't suit you. Well get over it!!! ILLEGAL immigrants have no business being here! Come to this country LEGALLY or fuck off!!!!","commenter_a":"We paid Mexico for those borders and they let illegals in and tramp through their country to come here Yeah you will pay for it..","post_message":"\"I’m not going to pay for that f---ing wall,” former Mexican President Vicente Fox to Jorge Ramos during a fiery interview on Thursday. \"[Donald Trump] should pay for it. He’s got the money.\""},{"comment_id":"10152763408026717","commenter_b":"Let's threaten to slit the throat of little bitches, see how this Bitch feels","commenter_a":"Hes gay as well !","post_message":""},{"comment_id":"10153671007817452","commenter_b":"@username if ur really going to have a discussion please don't start with \"then how is it that...\" When you focus on the trees rather than the forest, ur def lost. If you haven't done research on average income, crimes by income, distribution of resources to low income, then this is above your level of comprehension. Start with census and BJS","commenter_a":"“If Black Lives Matter was truly concerned about black lives, they’d be concerned about black crime.”","post_message":"From Atlanta to Phoenix, to right here in L.A., protests are growing across the nation after this week's deadly officer-involved shootings. But not everyone is happy that protesters have hit the streets less than 24 hours after the Dallas bloodbath that left 5 police officers dead and 7 others wounded. Tonight the tense scenes from coast to coast - at 11 from ABC7 Eyewitness News. @webpagelink"},{"comment_id":"1125811740844678","commenter_b":"That is one crazy bitch!","commenter_a":"Am I dreaming?! Bernie supporters BOOED Nancy Pelosi?! Well, YAY! Be still my trembling heart! It couldn't happen to a \"nicer\" Democrat...except for ol' Hillary!!","post_message":"Hard not to enjoy this"},{"comment_id":"10153898297209726","commenter_b":"I know someone that used to be a neighbor to one of Bill's party friends and Bill partied there all the time. They would bring in scores of prostitutes.","commenter_a":"Look this stuff is 20 years old. Bill chased women. A lot. Hes not the first and wont be the last man to do that lets move on","post_message":"WATCH: The central figure in the Lewinsky affair is speaking out about scores of Clinton affairs unknown to the public!"},{"comment_id":"608238889333781","commenter_b":"They can leave this country","commenter_a":"Tell them to leave","post_message":"Texas Man Told Remove His American Flag Because It Was A ‘Threat To Muslims’. Let's show this patriot our support. Can we get 75,000 'LIKES' for his love of his country?"}]
