[{"comment_id":"10152849864834342","commenter_b":"Woman can be evil also.","commenter_a":"Sad.","post_message":"Rebekah Holly Speer, 36, is charged with cruelty to animals after authorities say they found several dead dogs -- at least one shot and stabbed -- at a home in the 3500 block of Deep Anchor Way"},{"comment_id":"10153308382443145","commenter_b":"How sad ! Ban the Frat !!","commenter_a":"Two bills allowing guns on college campuses are about to be introduced. Alcohol, hubris, testosterone, guns. What could go wrong?","post_message":"The UCF chapter of the Sigma Nu fraternity was suspended after a video surfaced of a member chanting the word 'rape' and encouraging sexual violence toward women, the university said. The organization will have a formal hearing Thursday. #wftv"},{"comment_id":"10153961188184705","commenter_b":"Show us your Boob's lady.","commenter_a":"Hi from rio brasil","post_message":"Get an exclusive tour of the Mashable House at SXSW with Pete Cashmore."},{"comment_id":"1011840532205809","commenter_b":"She's always been a corrupt liar","commenter_a":"One thing I know, Hillary has always been involved in community service. Go Hillary! ; .)","post_message":"A young man met Hillary at the NewsOne town hall and asked: What did you learn from the Girl Scouts that you would use to be a successful president?"},{"comment_id":"10153065871694138","commenter_b":"It was just an upgrade to walking 5 miles each day for water...","commenter_a":"He could have bought a car, he chose not to.","post_message":"He kept a perfect attendance record walking 21 miles to work every day for 10 years."},{"comment_id":"10154252352423984","commenter_b":"Megyn is a bitch-not interested in anything she says.","commenter_a":"WHAT?????? Megan Kelly reported something bad about Trump - I am in shock -","post_message":"Trump's not going to want to hear it..."},{"comment_id":"10154930680644218","commenter_b":"Why doesn't all the TV news stop digging dirt and let it go. News and social media is half the problem. Start spreading positive news maybe people will do acts of kindness to make the news instead of following the negative.","commenter_a":"Imagine if a white guy said. He would be canned fast.","post_message":"A Baltimore County fire lieutenant is being criticized for remarks posted to social media after the election of Donald Trump. See what was posted >> @webpagelink"}]
