[{"comment_id":"1056213647735452","commenter_b":"I didn't watch it, but I don't think it was appropriate to turn a sports event into a platform for a political statement. Perhaps the NFL should start requiring artists to submit song choices & performance videos ahead of time for approval or better yet just have a military or top-ranked college marching band perform.","commenter_a":"She's disgusting and an embarrassment to the entire country. The Superbowl was not the place for a political statement and someone at the NFL should be held responsible for her selection. She degraded the event and insulted the vast majority of Americans who chose to watch. I for one did not.","post_message":"Buckle up, 'cuz Rudy's got something to say...."},{"comment_id":"10154991575839170","commenter_b":"Donald Trump our President will repeal it !!! And all politicians will live on the same policies","commenter_a":"He's a turncoat I do not trust him","post_message":"We didn't like it at the time, but let's compare what would have happened then to what's about to happen now."},{"comment_id":"488243741366206","commenter_b":"Hell no don't mess with our children!!!","commenter_a":"I thinks it's wrong for Muslims to even to be on our soil!!!!!!","post_message":"American students are being forced to dress like Muslims.  This is absolutely unacceptable, we need to spread this and show Muslims we are not going to stand for this.  Do you think it's wrong for Muslims to force their beliefs on our children?"},{"comment_id":"10153259880651162","commenter_b":"I wonder what he thought was going to happen to her after he beat her w/ the hammer?","commenter_a":"Hit her in the head with a hammer and get an I bond He's the real MC. HAMMER","post_message":"HAMMER BEATING: An 87-year-old man beats wife with hammer at a hospital to avoid her surgery ..@webpagelink"},{"comment_id":"10154384594879705","commenter_b":"'@username which of these girls is overweight? What weight should girls be according to you Bill?","commenter_a":"Ten bucks says that all the people saying they're disgusted are the same people who get pissed when someone calls a thin girl 'too thin' because apparently body positivity is only for bodies YOU feel positive about. Right.","post_message":"No photoshop, no frills."},{"comment_id":"1271814732856760","commenter_b":"she will be felon. unable to run for office.","commenter_a":"No! Just NO!","post_message":"Just when you thought it was over, look at this..."},{"comment_id":"10153860953039614","commenter_b":"Total fool.......actually wore than Hitler. Hitler is dead. Trump is still with us. For now.","commenter_a":"Clown","post_message":"A heckler interrupted Donald J. Trump at a rally in South Carolina, as the billionaire presidential candidate called for a 'total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what the hell is going on.'  'They have no respect for human life,' Trump said, referring to 'people that believe only in Jihad.'  He has previously called for surveillance against mosques and said he was open to establishing a database for all Muslims living in the U.S.  Read KTLA's story here: @webpagelink"}]
