[{"comment_id":"10153316215802377","commenter_b":"'We're' what has he got to be mad about - he's part of the problem.","commenter_a":"I'm glad he didn't get it for president.","post_message":"'Certainly part of what is behind the energy and the passion for Donald Trump on the Republican side and [Vermont Sen.] Bernie Sanders on the Democratic side is the frustration and anger people feel in this country,' Mitt Romney said."},{"comment_id":"1058824504164459","commenter_b":"'@username are they in mexico legally? if they aren't, they'd be in a mexican jail. if they are. then go after your gvt for not preventing the assaults. the fact is this.. ILLEGAL entry to any country, including mexico, is against the LAW. Mexico has enforced their law and the US MUST TOO. That means a wall since mexican cartels have made another business out of smuggling people into the us and those who can't pay the cartels, find a different way. Mexico didn't like it when Guatemala did it to them and we don't like it here either.","commenter_a":"Mexico has the largest border wall on earth bordering Guatemala to the south in order to protect it from the violence and to protect its mexican culture. It shows the historically true nature of mexican politics since Maximilian was executed. Nothing in mexico is good for America at this time. We dont need there people drugs or crime.","post_message":"'Suicide bombings in Israel went from 1,000 a year to zero a year once they put that fence up.'  Yesterday, Mike Huckabee spoke to Uma Pemmaraju about walls, using Israel as an example of why they work."},{"comment_id":"414886538699640","commenter_b":"She needs to keep her legs closed and get a f*^king job....lazy ass","commenter_a":"That's sick","post_message":"She wants one more HUGE favor from us..."},{"comment_id":"923406901068872","commenter_b":"would love to see ben carson and donald trump ban together","commenter_a":"Ben, that is exactly what obama has been doing for the last six years!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"417410465107501","commenter_b":"Should be shut down!! YEA---YOU'RE CHRISTIAN! !! ---- NOT!!!","commenter_a":"This is America and our two party system decides us all. No wonder that there are those who would help this business owner. Now let's see if this upright Republican claims all of it in taxes. My guess is that like most Republicans she will lie about it and cheat the government.","post_message":"Sadly, bigotry pays."},{"comment_id":"10153451405011336","commenter_b":"The sooner the better. We're going to need them to bail us out.","commenter_a":"When are we joining the European Union?","post_message":"JUST IN: The Confederate flag will be taken down Friday. @webpagelink"},{"comment_id":"1333179716775079","commenter_b":"Um isn't that the parents job? How is this not just instantly obvious?...","commenter_a":"Pssst......they only care about the fetus until the second it is born. When it is a child they lose all interest. They don't feed, clothe, vaccinate, educate, protect, nurture, house, inspire, enrich or love it.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
