[{"comment_id":"10153884646907183","commenter_b":"Why you picking on us white folk here in Georgia? Keep that bitch far away from us!","commenter_a":"Katrina Pierson should be in Milwaukee or Georgia. The media is paid to review everything Trump said and to soil it. They don't care about the real news, another cop assassinated through race- baiting rhetoric from Obama and HRC. Milwaukee is rioting. The streets of Chicago are still killing fields. Clinton is racketeering money through the foundation in pay for play schemes. Yet Ms Pierson has only one thing to do on this Sunday. Find dirt on what Trump said and exploit it. Is this the kind of values we should accept from these UnAmerican sewer-valued people?","post_message":"Did you ever hear of a \"novelty tradition\" in politics?"},{"comment_id":"687880108038609","commenter_b":"of course they arn't all murders and gang members that's why the wall will have a door or did you miss that part in the cnn chopped up version of that speech? the ones who want to be Americans can stay the rest can f off.","commenter_a":"These comments are disturbing. These are parents, children, families...not murders, drug dealers or rapists. Instead of \"building a wall\" or treating them like shit we should be coming together with Mexico so that they don't need to come here. They need help, we have a problem, so why are the two countries not putting their heads together to figure out a way to HELP","post_message":"Thousands of Central American children and families are arriving in Texas."},{"comment_id":"1548076978821767","commenter_b":"@username Illegals are already criminals by definition.","commenter_a":"These liberal are making more and more people want to vote for Trump.","post_message":"Top progressives are terrified the Democrat mob attacks on Americans will send millions of voters running to Trump."},{"comment_id":"10153717178056002","commenter_b":"why not just peep in their windows?? people are falsely put on these so called \"lists\"","commenter_a":"There already is one of these lists. When a Employer does a deep background check it shows everything. You and I can go on OTIS with the right info on a person like birthday date , ssn and full name you can get all of their info.","post_message":"Two boys from different families are abused by the same woman. See what this mom is doing to protect other children."},{"comment_id":"1742724086013339","commenter_b":"Go Girl!","commenter_a":"So good","post_message":"Live from San Diego: Watch as Hillary speaks on smart foreign policy, keeping our country safe, and why we can't afford Trump as Commander-in-Chief."},{"comment_id":"10153219885266636","commenter_b":"Vicki Horn Bet she'll complain if her wages go down. But thats not her problem until its her problem.","commenter_a":"Don't really think the 'how quickly would we get free tampons if everyone stopped wearing them?' Is a very appropriate question. If you want to walk round with blood all over your trousers knock yourself out - think it's you that would look abit mental but it won't affect the government","post_message":"'How quickly would we get free tampons if everyone stopped wearing them?'"},{"comment_id":"10152995336151037","commenter_b":"This chick is nuts lmao. Anyone who pretends to know what happened is dillusional.","commenter_a":"This was NEVER about a RACIST Cop shooting someone. The Lame Stream Media made Darrin Wil\\bson into a Racist, despite NO Evidence ever being presented that showed Mr. Wilson as being racist. It is sickening.","post_message":"A member of the grand jury that declined to indict the white Missouri police officer who fatally shot an unarmed black 18-year-old sued the prosecutor in the case, criticizing the way evidence was presented to grand jurors and seeking court permission to speak publicly about the way the case was handled."}]
