[{"comment_id":"10154558604929411","commenter_b":"dont worry Ann, no one would wana rape your fat ass","commenter_a":"What I find terrible is that if anybody wears a bikini they \"have chances of being raped\". Sorry, but France has to keep their country free of this BS. Next time a french woman steps into a pool in a bikini, will she be molested by this woman hating monsters?","post_message":"The pool park has allowed bathers to wear burqinis and jilbab de bains as way of exception"},{"comment_id":"10153590500421409","commenter_b":"she is full of herself","commenter_a":"Wow what kind of so called \"FRIEND\" is she. Can't even be happy for Michael. So much drama. Nobody needs a friend like that.","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."},{"comment_id":"1054883167923762","commenter_b":"What a dumb bitch.","commenter_a":"And this hack wants to be President?....Are Americans that blind and stupid ????","post_message":"“I’m going to be talking to white people, we’re the ones who have to start listening to the legitimate cries coming from our African-American fellow citizens,” said Hillary Clinton."},{"comment_id":"1090368724307930","commenter_b":"Women fought for many, many decades for the right to vote.","commenter_a":"Yay, and now we will get to vote in an awesome woman as president!","post_message":"The United States is 239 years old. Women have been able to vote for only 95 of those years."},{"comment_id":"1649676571963807","commenter_b":"Oh no she didn't, hand of God should of slap her head...","commenter_a":"I'm very proud of you and the stand you are taking for your Savior. Stay strong, and God bless.","post_message":"Teacher Demands Christian Boy Surrender His Bible, He Says No, See What Happens Next Good for him. Let's show this young Christian our support. Can we get 30,000 'LIKES' for his refusal to surrender his bible?"},{"comment_id":"10154395372381656","commenter_b":"@username let me guess you stand on a corner and watch to see if there anyone putting up a sign after you park legal must work for city and help a 5 man team screw in a light bulb....","commenter_a":"Don't park in a tow zone and you'll be fine. lol.","post_message":"\"None of us has been arrested for stealing,\" he said."},{"comment_id":"1160091574027415","commenter_b":"You are more than disgusting","commenter_a":"Yes!","post_message":"Do you think The View should be CANCELLED from TV?"}]
