[{"comment_id":"10153560917566615","commenter_b":"Get off of here Martha","commenter_a":"Who cares he got away with rape.","post_message":"WELCOME TO STEELERS NATION, BABY BODIE!  The newest addition to the family of The Pittsburgh Steelers QB Ben Roethlisberger is right along side the rest of the City of Champions tonight, cheering on the Pittsburgh Penguins to a Game 7 win! LET'S GO PENS!  (Photos courtesy of Ben Roethlisberger - BigBen7.com)"},{"comment_id":"10153169789203855","commenter_b":"She's a self-hating traitor.","commenter_a":"I thought Caitlyn was a Republican -- not at all a liberal. I'm sure I read that. Maybe Rush thinks party change is part of gender reassignment.","post_message":"A hateful man."},{"comment_id":"10153192015881162","commenter_b":"Hell is too good of a place for her, bring her to me.","commenter_a":"They should have allowed me to drive her to hail. She wouldn't make it there.","post_message":"HORRIFIC: A mother is accused of stabbing her 4-year-old son and partially mutilating his genitals. Authorities say the 23-year-old woman then dragged him out and continued the assault in the driveway, beating the boy with a garden tool and slamming him to the ground.   FULL STORY: @webpagelink"},{"comment_id":"1861600594119875","commenter_b":"Nasty Women","commenter_a":"Disgusted.","post_message":"LIVE: Women's Marches across the nation."},{"comment_id":"552329344892078","commenter_b":"Impeach her! She's suppose to be UNBIASED. What a joke","commenter_a":"Term limits asap","post_message":"Supreme Court Justice Ruth Bader Ginsburg bashes Donald J. Trump, calling him 'a faker' and criticizing him for not releasing his tax returns."},{"comment_id":"10155994061055354","commenter_b":"I'd really like to know what these morons see in this group that would make them leave the US ,.and join a group who sodomizes little boys and rapes little girls, kills anyone who disagrees with them and thinks they are right. ?","commenter_a":"She had a hard time deciding join isis or black lives matter! It's pretty sad to see the kind of warped minds our society is producing another lost soul gone to waste!","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS.   Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"530286710492597","commenter_b":"When are we going to smarten up and deport Muslims and ban Islam once and for all.","commenter_a":"The Quran says it's ok to lie to the infidels . Can't believe anything they say","post_message":"'How would you stand before God and answer to your crimes against… thousands of innocent people – Muslims, Christians and other minorities? You do not speak for us. You do not represent us. You are an aberration. You are an outlaw.'  The CAIR  national director condemned ISIS and their supporters in the wake of the #OrlandoShooting."}]
