[{"comment_id":"10153583881674087","commenter_b":"What Hillary Clinton is going to do about the unpaid maternity leave that women have to take there is no coverage for that in the United States","commenter_a":"Nancy was backing trump","post_message":"Hillary Clinton will leave the campaign trail on Friday to attend the funeral of Nancy Reagan and pay her respects to her fellow former First Lady who passed away this week at the age of 94."},{"comment_id":"991088854247496","commenter_b":"It's about time we had somebody who will stand up and speak the truth!","commenter_a":"Who determines what is Polically Correct? The liberals trying to manage free speech.","post_message":"WATCH: The Donald gets into a heated exchanged with a member of the PC police at press conference."},{"comment_id":"10154165798037212","commenter_b":"It was an accident. Please use your words kindly. The driver needs our prayers . This was a total accident.","commenter_a":"I'd kill someone hands down. Hit my kid or my dog with your car and you better pray the police get there quick enough. I'm at a loss of words for this little family. Praying for them with everything in me.","post_message":"UPDATE: A 2-year-old boy has died after being hit by a car Tuesday night in Yukon. #News9"},{"comment_id":"10153041474101051","commenter_b":"Take away the baby and tie her up so she can see how that feels .","commenter_a":"I'm assuming she gave the baby dog food.","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."},{"comment_id":"10154213118095575","commenter_b":"Bingo","commenter_a":"Maher looks like a child molester","post_message":"Unbelievable!"},{"comment_id":"10153760568196162","commenter_b":"I wish except i don't think my mom would know how to play the lotto lol!!!","commenter_a":"@username your mom won","post_message":"POWERBALL WINNER: Someone in Michigan just won the second largest Powerball jackpot this year. @webpagelink   The winning ticket is worth $310.5 million.  Here are the winning numbers:"},{"comment_id":"10155686821610354","commenter_b":"Please were in Big Trouble if the ASSHOLE gets in. It's bad enough the ASS already in office is dismantling our Country little by little she'll just finish it off. Her and her asshole of a husband.","commenter_a":"She could have changed to state ID if she is no longer driving and that information should have come via letter","post_message":"Clinton said that she was fighting “for the grandmother who’s turned away from the polls because her driver’s license expired.”  If she didn't want it to expire, she could have driven once or twice since 1996..."}]
