[{"comment_id":"496338953890018","commenter_b":"Dumb as hillbilly racist. This ain't your country. You must of been beaten to many times by your hillbilly husband. Stay the fug out of their area then. You KKKrackers have many don't go zones, outsiders not welcomed. Most trailer parks in Auburn CA. and any white town in Mississippi. Live and let live mafaacaas!","commenter_a":"yes spray the area with pig fat","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"1001470336557869","commenter_b":"HaHaHa ROFL at her.","commenter_a":"And she is the Dean at a University? Sad state of mind and then you combine that with putting her in the role of teaching! Are we the people paying for that woman's salary?","post_message":"WOW this lady...shamelessly LIED about her entire encounter with the Police Officers..and here's the proof! What a fool."},{"comment_id":"10153814761109705","commenter_b":"So are fat chicks!","commenter_a":"It's always amusing when it's celebrated to mock some, but when it's other's it's called 'shaming' and it's frowned upon. Looking forward to your next article on fat chicks saying fat is cool and healthy!!","post_message":"Twitter is calling it #YallQaeda."},{"comment_id":"10153903226928797","commenter_b":"She Must Be Mentally insane","commenter_a":"Connie Reyes","post_message":"MOM HAS SHOCKING OUTBURST: The mother accused of killing her two young children and stuffing their bodies in a freezer has lashed out in court after losing her temper. What do you think? WARNING, details in this story are graphic and may be hard for some readers. Here's what mom said:"},{"comment_id":"1638898229733425","commenter_b":"Everything good in your speech, but I believe illegals should not be getting welfare or food stamps, or free health care or education it's just a magnet and most of them are not paying into payroll taxes. You are still avoiding what you are going to do with the illegals that aren't criminals. Actually they did break the law if they came here illegally and if they stay here even if they don't get citizenship it's still ammnesty. You need to be up front with what you are going to do.","commenter_a":"Great speech!!!!","post_message":"Thank you for your wonderful support last night- with regard to my Immigration Speech that I delivered at the Phoenix Convention Center. I love this country - and you, the people. Lets MAKE AMERICA SAFE AND GREAT AGAIN! I love you! Donald J. Trump"},{"comment_id":"10153252207146509","commenter_b":"Look at yourself and get off your high horse, lady.","commenter_a":"It's only free for freeloaders and illegal immigrants! The rest of us r still going to be up to our eyeballs in debt!","post_message":"President Barack Obama says he'll propose making two years of community college free 'for those willing to work for it.' Do you agree? More details will be announced Friday: @webpagelink via CNNMoney"},{"comment_id":"10153224075406336","commenter_b":"I'm upset about it too, but let's take a look at our current President. He's stomped on the US Flag toward other nations apologizing for Americas stance for years on policy. He just keeps stomping and we just keep believing lies and hypocrisy.","commenter_a":"What a disgrace to our country!","post_message":"A new social media 'challenge' is encouraging people across the country to disrespect and stomp on the American flag."}]
