[{"comment_id":"10152950800096770","commenter_b":"Why doesn't she talk about the women her husband has been with considering her looks I don't blame him.","commenter_a":"I'm offended by the fact she isn't behind bars yet.","post_message":"At a campaign stop in New Hampshire on Monday Hillary Clinton slammed Donald Trump's recent remarks about Fox News host Megyn Kelly as \"outrageous\" but said that other Republican men running for president have made equally \"offensive\" remarks."},{"comment_id":"10154886644703487","commenter_b":"Yeahhh...I'm not buying it, Atlantic.","commenter_a":"So, arrest him and tell America that Trump isn't going to be President. I dare you. LMAO......","post_message":"\"Putin has embraced an opportunistic but sophisticated campaign to sabotage democracy.\""},{"comment_id":"1225877584098936","commenter_b":"Build a wall!! That'll stop em!! Bahahaha","commenter_a":"El Chapo was there.","post_message":"The \"super tunnel\" – eight football fields in length – was discovered along the U.S-Mexico border south of San Diego.  via NBC 7 San Diego"},{"comment_id":"10153155614114411","commenter_b":"Circumcision removes most of the nerve endings from the penis - so no, it is not good for intercourse.","commenter_a":"curcumstich is good for the sexual intercorse between man woman. But the preast outbreath and homosex agenda and child melest could make Even God leave the churche..and the girls virganity and boys firs blow job...fuck them. Herpes is an evel sicknes related both to rosesicknes that makes your body ..","post_message":"Via RT America: City health officials said 17 cases of infant herpes since 2000 have been connected to the traditional Orthodox practice of sucking blood from the circumcision wounds of infants penises."},{"comment_id":"10154724621788984","commenter_b":"Hey Walmart has glasses 2 for the Price of one One for your dumb Head and one for Your your brown spot","commenter_a":"Lady you need to get your head out!Quit your job cause you are not of sound mind like Hillary Clinton","post_message":"Attorney General Loretta Lynch just issued a message to Charlotte rioters - and something about it immediately raised eyebrows."},{"comment_id":"1712281645723927","commenter_b":"Ash Jesus another self righteous know it all illegal immigrant go back to your country bitch this is my country not yours","commenter_a":"Makes me laugh that those who are here \"legally\" think they are any better than those who cross the border. Yes deport those with criminal record, but why throw out hard working folks like my parents who come here for a better life and contribute to this country. They also pay their taxes. People screaming out CRIMINALS to immigrants as if US citizens weren't criminals. Instead of complaining about immigration, perhaps you should demand the government to stop exploiting other countries' resources and their people. Bring down your ignorance and arrogance down a notch. Seriously, who do you all think you are? When you die and rot in your tomb, you won't be needing your \"citizenship\".","post_message":"Do you agree or disagree with the majority of Americans on this?"},{"comment_id":"10154732148698961","commenter_b":"You recently proclaimed that you would rather see a move toward screening and the passage of more gun control. Are you serious? American citizens are being raped and murdered by illegal aliens streaming into our borders and you want them all to come on in, collect benefits paid for by American taxpayers, yet take away guns that can protect us from these illegals. You are a very disturbed person and even worse are those endorsing you and voting for you. It's a state turned upside down by liberal sycophants.","commenter_a":"Senator Murphy, how about a little get together down here in the New Haven area?","post_message":"A huge THANK YOU to everyone who came to the town hall tonight. For those who couldn't join, check out the full video here."}]
