[{"comment_id":"990398314328597","commenter_b":"Fucking what the hell why u have to hit a poor guys damn this US is freedom fucking basdard try to find me I kick their ass to hell","commenter_a":"That fuck up stupid cop","post_message":"Listen to an MMA fighter break down the poor training of law enforcement. Source → @webpagelink Filming Cops (Y) Police The Police (Y) H/T Gracie Breakdown"},{"comment_id":"10154343689874094","commenter_b":"People know who she is. She will get whats coming to her","commenter_a":"Hopefully she'll get caught out on a camping trip and be torn apart slowly by wolves.","post_message":"Roadrunner the dog's injuries were so severe that a veterinarian had to remove his eyes."},{"comment_id":"1357769630924322","commenter_b":"This story is a distraction tactic to pull attention away from the real story. Americans seem to fall for it every time. Next week it will be something else..keeps us divvied and look we are.","commenter_a":"Oh, and another thing Far Left Liberals. The Head Muslim wants to destroy USA with his crazy Muslim immigration scheme so the U.S. \"can be lowered to the standard of the rest of the world\" is lunacy! Obama is a Muslim, this is not a Muslim state although he is trying to make it so..that is his Legacy. That is why Trump was elected. We are not the Muslim States of America!","post_message":"Hell has officially frozen over. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153473054219087","commenter_b":"Also you're basically saying someone who has the same democratic socialism plan as MLK Jr is a Marxist. Please don't insult the intelligence of Bernie Sanders supporters. We know the difference and you sir are just trying to fear monger ppl into thinking that.","commenter_a":"Perhaps Bernie will be made to answer tough questions on his absurd views on governance. Bernie Sanders: A demagogue is on the rise The populist fever is now running rampant. A demagogue is on the rise. His appeal is founded in the notion that the professional political class has both failed and ignored the plight of a disaffected but vocal minority. In terms of substance, he leaves much to be desired. In style, however, he captivates and inspires. On the debate stage, he touts his surging poll numbers, spouts unrealistic but tantalizing anti-elitist policy preferences, and berates the moderators for asking him tough questions all to the cheers of his committed band of malcontents. Noah Rothman @webpagelink","post_message":"CNN abruptly announced today that it will hold a town hall with the Democratic presidential candidates in Iowa on Monday -- one week before voters in the state head to the polls for the first-in-the-nation caucuses."},{"comment_id":"1073234599424148","commenter_b":"BESIDES ALL OF LIES, CORRUPTION, ALL FAILED FOREIGN POLICYS, LYING TO AMERICAN PEOPLE, ILLEGAL SERVER IN HER BASEMENT, PUTTING OUR SECURITY AT RISK. RIGGING THE DEMOCRATIC NOMINATION, DID ABSOLUTELY NOTHING AS SECRETARY OF STATE. TOOK MILLIONS OF DOLLARS FROM WALLSTREET. AND BIG BANKERS, TOOK MILLIONS FROM TERRORIST COUNTRIES. CORRUPT CLINTON FOUNDATION. BENGASI, I CAN GO ON AND ON.... WHY I WANT TRUMP... HE DOESNT HAVE TO DO THIS. HE WAS ON OPRA SHOW 25 YEARS AGO, GO GOOGLE IT. SHE ASJED HIM IF HE WOULD RUN, SAME RESPONSE NOW AS THAN. ... 1-I WANT ILLEGALS TO NOT COME INTO OUR COUNTRY, SO A WALL. 2-I DON'T WANT SYRIAN REFUGEES COMING INTO OUR COUNTRY, THEY NEED TO BE EXTREMELY VETTED. WE CAN HELP THEM IN THERE OWN COUNTRY. ( FOOD, BEDDING, DIAPERS, GUARDED. 3-NO ABORTION. HILLARY WILL ALLOW UP TO 6 MONTHS PREGNANT 4-TO CALL TERRORISM WHAT IT IS... AND ACTUALLY ...","commenter_a":"Not even bill","post_message":"Breaking News: Obama using terrorist and Black lives matter to incite riots so he can declare Martial Law and suspend elections. Will you survive? Watch Video: @webpagelink"},{"comment_id":"962481017216016","commenter_b":"@username I do not believe God condoned offering children to the fire as is abortion. the dogs ate jezebel. hillery was lucky, so far.","commenter_a":"YOU can't be a christian and vote for Hillary but it is all over, Hillary lost.","post_message":"Apostate “Pastor” Tony Campolo says Christians Should Vote for Hillary @webpagelink"},{"comment_id":"785040181594590","commenter_b":"Lol...let's put all small business out of business because no skill workers want to get paid what skilled labor is paid..country is going to hell and fast","commenter_a":"I don't think a fast food employee should get $15. Maybe $8 start out and earn your raise, but not $15. If you want to make money in the food industry, become a server. Yeah, we make $2.13 and hr (yes our minimum wage hasn't changed in DECADES) but I work part time for full time pay as I call it. I work 3-5 hr a day which give s plenty of family time and can make $15+ an hr from tips off the table. That is how we pay our bills for those of you who feel tipping is dumb. My $2.13 pays the taxes and the smallest check I've gotten was 10 cents, some don't even get checks.","post_message":"\"We need you out there leading the fight ...\""}]
