[{"comment_id":"10153662758062894","commenter_b":"Naw mama had let that warning out that she addresses her child my bad young lady again she gon catch that fade","commenter_a":"But skai read her so no need for mama to even say anything","post_message":"Not My Child! Skai Jackson’s Mother Has Words for Azealia Banks: ‘I Don’t Play Those Games’ [Photo]"},{"comment_id":"10154838480761729","commenter_b":"Nothing will stop this because they want to become martyrs and are ready to die for Allah. Killing them before they kill you is the only solution.","commenter_a":"Here we go again, it's the guns! Oh wait, I thought ALL guns were illegal in Germany? They need to tell these criminals that they are not supposed to have guns! How dare them break the law and get illegal guns! They need to make more gun laws because that will make it harder to get guns.","post_message":"UDPATE: Authorities warning MASS TERROR ATTACK UNDERWAY  Manhunt underway, public transit shut down..."},{"comment_id":"10158795471470206","commenter_b":"My smartphone is a machine-gun!","commenter_a":"Journalism....there's the headline, then there's the complete opposite being stated in the article. Maybe the journalist just didn't understand that big word 'refuted'.","post_message":"The Superior Court of Justice decided to punish the players for failing to play their match."},{"comment_id":"1422614517766820","commenter_b":"Turn off your speakers when Hillary starts speaking or she will break your ear drum","commenter_a":"Maybe every issue liberals care about like letting men in girls showers and rest rooms","post_message":"A Donald J. Trump presidency would pull us backward on nearly every issue we care about. We can't let that happen."},{"comment_id":"10154460904419411","commenter_b":"Nonsense. Religious claptrap has been indulged enough. They will never be satisfied.","commenter_a":"It's not OK. A country which excel in development like Swiss, must receive new minorities than traditional aliens. Therefore if you never had Buddhists, you will receive them make sure you also received their way of ideology. This is an article of Human Rights 'Freedom of Religion'.","post_message":"girls, whose names were not disclosed, said their religion prevents them from participating in compulsory swimming lessons with males in the pool at the same time.'"},{"comment_id":"1054816387945602","commenter_b":"Watching these comments I can't help but notice that Obama is almost as popular as burlap toilet paper....","commenter_a":"Will he be pausing to pray to the east immediately following this speech?","post_message":"President Barack Obama comments on #Brexit at the 2016 Global Entrepreneurship Summit."},{"comment_id":"10153159766848701","commenter_b":"Pigs... Sterilize them both!!!","commenter_a":"Slam thier ASS in jail till they both get the hell beat out of them or killed by inmates.. Thier parents are proud of them now ...","post_message":"A man and woman charged with murder are accused of starving their 7-week-old baby to death in Douglas County."}]
