[{"comment_id":"723350804480361","commenter_b":"Wow... look at the Drumpf whore pounding out her propaganda. Nice work little slut. You get the executive card from the orange tinted prolapse","commenter_a":"This is not true. I know who got the letters and you were not one of them. Poser","post_message":"We were forced to comply with a Cease and Desist sent by Melania Trump's paid doberman. This is the future of journalism under a Trump presidency."},{"comment_id":"10153315514576336","commenter_b":"That turbofan jet engine intake is sturdy enough to handle the weight of that woman. Also, her derrière is not going to effect the shape of the intake. It is designed to handle air pressure from 250 knot IAS relative wind that at altitude could be as high as 550 knots TAS. So, what's the big deal? I think the picture looks COOL!!!","commenter_a":"I do not think so. The preconditions are whether the company has the clear policy for it, whether she got enough training of behavior in the company?","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"837279236391341","commenter_b":"She's a stupid twat","commenter_a":"How dumb can any one person be?","post_message":"Come again??"},{"comment_id":"758262410976191","commenter_b":"What a f--king liar!","commenter_a":"Chris is wrong Trump is right. Trump is the right man for the presidency. Get it and stop fighting a good thing for our country.","post_message":"Wow...Donald J. Trump and Chris Matthews agree that many Republican leaders and corporations don't want to stop illegal-alien hiring because they want the cheap labor."},{"comment_id":"1354102041270105","commenter_b":"BUILD THAT WALL!!!!!!!","commenter_a":"The racist bigots Trump supporters would love as many Mexican families as possible to die. Pretty sad! That's why I'm with her!!","post_message":"A son migrated to the U.S. from Mexico, to help his parents survive by sending back money. But part of Donald J. Trump's immigration policy could threaten that support, and the lifeline of an entire town. (In a statement to CNN, the Trump campaign maintains building a wall is the right solution, but did not address money transfers directly.)"},{"comment_id":"10153353453448132","commenter_b":"She is a brat !","commenter_a":"I love her ! Hopefully she doesn't become a total brat","post_message":"AMAZING!"},{"comment_id":"775573792575801","commenter_b":"@username bitch","commenter_a":"Nope. It was an error. The correct winner was announced. I disagree with Donald on this one. Life isn't always perfect and mistakes happen... The girl that was first announced should be proud that she came in second and briefly got to feel what it was like to be first. #stuffhappens","post_message":"Well........."}]
