[{"comment_id":"1062292093806211","commenter_b":"DON'T NEED ANOTHER BILL CLINTON","commenter_a":"Lol! Trumps hands are not looking so small now. Hehehe","post_message":"Breaking News!"},{"comment_id":"10153960643118984","commenter_b":"Just take ur stinking ass and ir ugly ass women with u","commenter_a":"You all need to vote ... get rid of this crap ....","post_message":"I can't imagine what this woman must have felt when this Muslim cab driver did this... Do you support this judge's decision?"},{"comment_id":"1054929361214588","commenter_b":"She* is a woman.","commenter_a":"Sorry Siri, but according to his DNA, he's still Bruce! A rose by any other name.....","post_message":"Siri knows Caitlyn's name and she's going to correct anyone who forgets."},{"comment_id":"10153323281663854","commenter_b":"Only if she wants to end up 6 ft under, so he can be president again","commenter_a":"They can run together in the yard at Gitmo.","post_message":"NO JOKE: Democrats Are Now Calling for Hillary Clinton to Name Barack Obama as Her Running Mate…"},{"comment_id":"455432694647311","commenter_b":"Will not eat there. She would turn my stomach and I couldn't eat---ugh","commenter_a":"Well that does it McDonald's out","post_message":"Would You Refuse To Eat An 'Obama' Burger? Comment 'yes' or 'no'."},{"comment_id":"10153769957503984","commenter_b":"get rid of her .","commenter_a":"Couldn't have been too quiet, you know about it. She quietly sign with them because old agency smart enough to drop her?","post_message":"Megyn Kelly very quietly just made a huge move that could change everything for her and Fox News. What do you think? Should Megyn stay or go?"},{"comment_id":"1143510442327091","commenter_b":"I will personally go to the Springs to make sure this woman is defeated in her next election period!","commenter_a":"Time for her resignation!","post_message":"“The true instigator of this violence and all violence at any Planned Parenthood facility is Planned Parenthood themselves.\""}]
