[{"comment_id":"10153819870891037","commenter_b":"Build a big hole and build a fence around it. Yeah that outta do it","commenter_a":"A Swatch.","post_message":"“You look at this migration, I said to my wife the other day: ‘You know, they seem like so many men,’” said Donald J. Trump."},{"comment_id":"1248206901866985","commenter_b":"Ali Berdai haha","commenter_a":"Alex Bond","post_message":"By Liz Climo."},{"comment_id":"929207217205367","commenter_b":"It's up to the voters! United we will not let her get away with this! she's another OJ Simpson in my book....","commenter_a":"I sure hope so. This makes me sick. She is above the law. This is so shameful and just so wrong. Unbelievable.","post_message":"Today, the FBI admitted that Hillary Clinton endangered the American people—and confirmed that the worst things any of us imagined about Hillary’s email server were true. FBI Director James Comey concluded that Clinton was “extremely careless” in handling our nation’s secrets. He admitted that no reasonable person could have believed putting these emails on a private server was at all appropriate or acceptable. He admitted that 110 emails on the server were classified at the time they were sent—showing that Hillary not only lied, but knowingly endangered national security as Secretary of State. He admitted that Hillary deleted work-related emails before turning them over to the State Department, despite her claims otherwise. And most shocking, Mr. Comey even admitted that it’s likely foreign governments hacked her emails--and that our adversaries could know critical secrets about the U.S. government because of Hillary’s actions. But when you’re a Clinton, none of this ..."},{"comment_id":"1678604362359824","commenter_b":"@username how about i fuck your wife?","commenter_a":"Ah yes, Israel defending themselves against the crazed islamists wanting to destroy the country and kill all the jews. This page is turning into a progressive shitehole full of regressive thinking. NASTY.","post_message":"Literally the biggest assholes on the planet."},{"comment_id":"628365077296674","commenter_b":"\"Woman\"","commenter_a":"woman?","post_message":"I want her sick face everywhere......people need to know how twisted this woman is!"},{"comment_id":"1137409276317081","commenter_b":"Hillary threatened by a female!? The Republican Party just makes me laugh!","commenter_a":"Hillary Clinton threatened by Melania??? lol give me a break.","post_message":"\"It's just another example of... when Hillary Clinton is threatened by a female, the first thing she does is try to destroy the person\": Donald J. Trump's campaign manager Paul Manafort addresses allegations that Melania Trump's #GOPConvention speech was plagiarized @webpagelink"},{"comment_id":"10154530088657908","commenter_b":"Ginny Gruhler Vanderhoof You are a very dishonest person \"Sanders battled over veterans issues as chairman of the Senate Veterans Affairs Committee from 2013 until early this year, giving him an easy pitch to a crucial voting bloc of veterans, particularly in South Carolina where veterans make up more than 11 percent of the voting-aged population. There stiff competition for these voters, with front-runner Hillary Rodham Clinton wooing them this month during a round table in Nevada. Even the leaders of veterans groups who praise Sanders acknowledge that the 73-year-old Democratic socialist isn an obvious champion for the flag-waving set of former military officers and enlistees. When asked if the Veterans of Foreign Wars, which recognized Sanders with its Congressional Award in March, had ever bestowed the honor on a socialist before, the group Washington executive director, Bob Wallace chuckled a bit. . No. No, said Wallace, a man who ...","commenter_a":"Why does Hillary think she can get anything done? We've seen how the congress works now. Even if the Democrats re-take the Senate, we still won't have the radically gerrymandered House until 2020. It will be nothing but stonewalling until then. That and attempts to repeal the ACA are all the GOP reps remember how to do. Plus, they hate her with the fury of a thousand suns. They'll waste all their time and hundreds of millions of taxpayer dollars investigating her for anything they can think of until they can figure out some way to impeach her as well. She's not getting anything done. But if Bernie is the candidate, and he is able to continue to energize his massive voter base, then suddenly we have a shot at taking the entire congress back and getting something done. Bernie will bring far more folks to the polls than Hillary ...","post_message":""}]
