[{"comment_id":"1398558810203863","commenter_b":"Stay off facebook lady.","commenter_a":"I'm not a hater, and love fashion, but, this dress is absolutely unprofessional! Why would she do something like this...makes a person wonder!!!","post_message":"'She looks like she's working for an escort agency!'"},{"comment_id":"784480358346621","commenter_b":"The whores knew what they went to Mr. Cosby room for money and sex. I say they didn't get pay they got laid .","commenter_a":"My lord there is a lot of racists here!","post_message":"We can only dream! Cheney masterminded a war based on lies to funnel $37 billion in no-bid contracts to his \"former\" defense contractor company, Halliburton. When will his time be up? Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154064553747464","commenter_b":"Gaining delegates is part of how you win, especially in an open convention. He'd be crazy *not* to. It's something Trump is learning the hard way.","commenter_a":"Why use every edge known to man Cruz, just have a straight up best man with the most votes win's. You cheapened yourself pandering for delegates, it appeared slimey and desperate. Also why did you go to the border with Beck to hand out welcome boxes to ILLEGALS that were entering our country ILLEGALLY if you really believe in the wall and making already existing ILLEGALS leave this country????","post_message":"Join us on Monday for #CruzOnGMA!"},{"comment_id":"10153746372034607","commenter_b":"Lock them all up!","commenter_a":"But there is people out there committing crimes, just showing the blue and white power","post_message":"Police have corrected the total number of people arrested during the protests on Friday night to four people. Those individuals were arrested after they refused to move from the roads during demonstrations."},{"comment_id":"10153495840691051","commenter_b":"Then don't post it online and she should mind her own business.","commenter_a":"People should also mind their own business","post_message":"This woman says her child *isn't* too old to be breastfed. Decide for yourselves if that's true."},{"comment_id":"370852156623268","commenter_b":"It appears that She doesn\"t know how to do anything. Maybe she can pole dance or do hoing!!!!","commenter_a":"Guevona!","post_message":"She hasn't done anything..."},{"comment_id":"593396500847956","commenter_b":"Hillary Clinton may or may not be Chuck Norris in drag #bitchesgetshitdone","commenter_a":"Hilary may or may not have killed a man with her bare hands in a NOLA speakeasy. In 1983 or 1991. #ComeySpeak","post_message":"Both the left and the right have criticized FBI director James Comey for how remarkably vague his letter was."}]
