[{"comment_id":"10156359711135354","commenter_b":"Take the fuckin niggers too.","commenter_a":"Yeah screw Obama and the Obama does not care health insurance bull crap. He can get the hell out of America and take his illegals, criminals and Muslims with him.","post_message":"“We’re going to be aggressive…”"},{"comment_id":"1142341912527542","commenter_b":"well so are you","commenter_a":"You haven't made a good movie since Good Fellows, sit down and shut up before you piss yourself.","post_message":"Robert De Niro has launched an excoriating attack on Donald Trump. The actor doesn't pull any punches in his criticism calling him a 'fool', a 'bozo' and 'an embarrassment to the nation'. And that's probably the nicest stuff..."},{"comment_id":"10153749043211159","commenter_b":"Our Country? Go back to Iran you POS!","commenter_a":"no","post_message":"The White House is back on it..."},{"comment_id":"722580014574620","commenter_b":"Illegals voted here for Obama...","commenter_a":"Proof of Citizenship or Naturalization of Citizenship is the only way you can vote in National elections. Try going to any other country and vote in their elections, YOU CAN NOT. Period end of report","post_message":"Will someone steal your vote when you cast your ballot on Election Day? Voter fraud can drastically influence the outcome of elections."},{"comment_id":"1089399481081062","commenter_b":"Hahahaha","commenter_a":"Matthieu Sinclair","post_message":""},{"comment_id":"1316028568419930","commenter_b":"What happens if you don't believe in \"God\"? I personally will not end up in hell if I have an abortion, as I don't follow the teachings of any religion. For me, it is my body and if I don't want something growing in my body I will remove it. I have had a miscarriage, and I have my one child. I do not want another child, ever. I can't use birth control, I can't use affordable condoms. If I have sex and I end up with a pregnancy I will have an abortion. Becuase I do not want another child. It is that simple. If we do not watch out we will soon be sent to jail for having a miscarriage, that is the road we are going down. So every female that has ever had a miscarriage needs to stand up and fight for the rights of others, ...","commenter_a":"Sometimes pregnancy happens regardless of how many precautions are taken. Sometime a woman's right to consent is taken from her. Sometimes the pregnancy is a deadly risk for the mother. Sometimes the baby may live a short, painful life or a long painful life. Sometimes a woman does not realize she is pregnant right away. Every time it is her body, her rules.","post_message":"This bill would prohibit abortions after the first detectable fetal heartbeat but many women don' even know they're pregnant that early."},{"comment_id":"10156475967855231","commenter_b":"@username That's nothing to brag about or feel proud of. Just makes you a parental fail.","commenter_a":"Art is seems to be tge type of jerk who would disown his gay child. Especially, a male child.","post_message":"He apologized, but let's be for real: does he really mean it?"}]
