[{"comment_id":"10153918946326162","commenter_b":"Calling a 15 year old young lady a hoe Definitely shows your maturity level.","commenter_a":"Dear 15yr old girl, you put yourself in that position. Those are the risks of taking nude pics. SUCK IT UP, HOE.","post_message":"EXCLUSIVE: A Bolingbrook High School student says nude pics of her were posted online as retaliation for fight. @webpagelink"},{"comment_id":"10152886547876051","commenter_b":"Yep, every woman carries black tape in their purse. What they need is to carry.","commenter_a":"A piece of black tape and the whole situation could have been avoided.","post_message":"This woman was putting her shirt back on in the Target dressing room when she suddenly noticed something glowing."},{"comment_id":"10157668685335389","commenter_b":"This woman is not!!","commenter_a":"I know women are going to hate me but if Hillary becomes president I can see why they didn't allow women to vote until the 1920s?.... women are overwhelmingly voting for Hillary over Trump this is how stupid most women are...MOST...not all... their kids and grandkids will be screwed for life","post_message":"Perspective."},{"comment_id":"10152941725546051","commenter_b":"I feel for him. The cops and courts don't help. He stopped him once and for all.","commenter_a":"I would have done the same ~ if our laws were CORRECT pedophiles wouldn't be as big a problem! He should NOT be the one in jail !","post_message":"“I just want you to know, I ridded one less (expletive) child molester from the (expletive) earth that (expletive) with my little brother,” he said. “Alright? That's all I got to say. I don’t give a (expletive) how much time they give me. Doing time is the easy (expletive) part.\""},{"comment_id":"1134738373236015","commenter_b":"Actually female secretions do have some nutritional value. And ok, and maybe you should suck some more dick.","commenter_a":"Ha! Says a study funded by the patriarchy and trying to get women to scientifically be cool with swallowing men's Semen. If you're gonna be anti media, don't be pro patriarchy. It's all a part of the same machine. It's all part of the same manipulation. Fuck the patriarchy.","post_message":"And now you know..."},{"comment_id":"10155548661776509","commenter_b":"You are right, it isn't Trump supporters, this latest hidden Veritas video will give you a hint: @webpagelink","commenter_a":"I don't think it was Trump supporters who did this, everything is spelled correctly.","post_message":"Vandals set this black church ablaze and scrawled the words \"Vote Trump\" in crude, white spray paint. @webpagelink"},{"comment_id":"10153238053014586","commenter_b":"plants are living things too... so eat sand... all human should eat sand.","commenter_a":"literally feel sick watching this how can people still let this happen? disgusting","post_message":"Can you imagine having that huge metal tube shoved down your throat?!   This is just 60 seconds of how #FoieGras ducks spend THEIR ENTIRE LIVES.   They sound so terrified. :("}]
