[{"comment_id":"10152804677074342","commenter_b":"Lots of prostitutes in England!!!!","commenter_a":"PROSTITUTES in LAS VEGAS. Stupidity","post_message":"DIARY OF EVIL: A teen has been found guilty of attempting to kill three woman out of 'revenge' and from frustration of not being able to lose his virginity. \"I was planning to murder, mainly women, as an act of revenge because the life they gave me. I'm still a virgin at 17.\" FULL STORY --> @webpagelink"},{"comment_id":"1546688018681408","commenter_b":"If we are about to start following the Bible, can we get this woman to shut her mouth first ??","commenter_a":"I'd pay money to see the look on her face at the innoguration.","post_message":"\"Okay, Hillary, now that Donald J. Trump is looking to help you heal and help the nation heal, would it be fair to say – to use your own words – 'It's time to give Donald Trump his chance to lead'?\" – Judge Jeanine Pirro @webpagelink"},{"comment_id":"10154295725641162","commenter_b":"@username Says the ignorant person. I'm not trashy, so I won't stoop to your level.","commenter_a":"Time to take the trash out. Waited 8 years for this.","post_message":"Pres. Obama *literally* drops the mic at the end of his last White House Correspondent's Dinner: @webpagelink"},{"comment_id":"10154343689874094","commenter_b":"People know who she is. She will get whats coming to her","commenter_a":"Hopefully she'll get caught out on a camping trip and be torn apart slowly by wolves.","post_message":"Roadrunner the dog's injuries were so severe that a veterinarian had to remove his eyes."},{"comment_id":"832342470197694","commenter_b":"Boring!","commenter_a":"We do the very same things here today.","post_message":"What do you see in this inkblot?"},{"comment_id":"896920230364507","commenter_b":"Never mix hillerie with religion, she's a sinner !","commenter_a":"Love has no bias, gender, race or labels. First Corinthians chapter 13.","post_message":"\"I was thrilled when you recently urged the Supreme Court to rule in favor of marriage equality. I was like 'That’s our gal.'\"—Mike Yowell, having coffee with Hillary in Council Bluffs, Iowa"},{"comment_id":"1775780972691266","commenter_b":"Andrea Lynnette no way in hell.","commenter_a":"To all the people harping about how \"historic\" the DNC nomination is: There is nothing empowering about this, and by saying otherwise, you are setting the next generation of American women up for failure. You're telling them that it's okay to lie, cheat, and steal, so long as it breaks the glass ceiling. You're telling them that it's okay to stand behind an unrepentant philanderer so long as it is politically expeditious. You're telling them that one does not need to take a principled stance on any issue in order to be successful; one only needs to adhere to populist notions. The only way in which last night was historic is in the sense that this marks the first time in American history that a candidate won the nomination under FBI scrutiny. This is also the first time in which an entire political party was caught actively sabotaging a candidate. ...","post_message":"Democratic Party nominates Hillary Clinton. Your reaction?"}]
