[{"comment_id":"10154109773821491","commenter_b":"I watched the video. And I know horrible treatment of animals in factory type production of food. I know a guy right after high school that had a job for one day catching two chickens at a time and melting their beaks with a hot iron. That was done so they wouldn't peck at each other. But that's not what the post is about.","commenter_a":"One egg yolk has 62% of your daily allowance of cholesterol. One strip of bacon has 3% of your daily allowance of cholesterol.","post_message":"Eat those yolks, folks."},{"comment_id":"1005311662842639","commenter_b":"I would have kicked her in her taco real good!","commenter_a":"Damn what a sicko.","post_message":"This nun decided that students needed a hardcore lesson in Jesus' suffering -- so she stabbed a kid in the forearm."},{"comment_id":"10153962547876519","commenter_b":"'@username Wrong. No Muslim structures where they killed real Americans. You have a lot of anger. Try whimpering in a corner.","commenter_a":"Oh shut the fuck up you unhinged idiots. By this standard, I had two health episodes yesterday. It's really scorching in this city right now.","post_message":"Clinton was observed 'fainting' in a departure area..."},{"comment_id":"1157925847657525","commenter_b":"she should be charged with fraud.","commenter_a":"God please let this happen....she is evil as Hellary","post_message":"ClashDaily.com"},{"comment_id":"979819422085921","commenter_b":"'@username don't curse Canada with the likes of people like her. Send them to mexico!","commenter_a":"Just because a person is an actor/actress does not mean they know their head from their a$$ ... proof right there in that statement","post_message":"Americas Freedom Fighters"},{"comment_id":"10152603535532894","commenter_b":"she slept with Jamie Fox, She slept with a fe NBA players. If you go on the internet its all there and on TMZ. She is a whore too","commenter_a":"Greg has his own real estate investments and can stand on his own. Please. Claudia is a whore. She has slept with everyone just like Kenya hoping for a big break. if you start your career on your back you always stay on your back That is a bad practice of sleeping with people to move up. People will never respect you as a woman or a professional like that","post_message":"#RHOA Fans Outraged: NeNe Leakes Hurls 'Half-Breed' Racial Slur at Claudia Jordan [Video]"},{"comment_id":"10152906901509270","commenter_b":"Unreal !!! This makes me sick !!!","commenter_a":"It's just Wrong. Wanna bet the Commander in Chief authorized this crap..","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
