[{"comment_id":"1643657415907529","commenter_b":"Literate people too lazy to read...","commenter_a":"And...this thread has made me loose hope for humanity.","post_message":"What is it and why is this happening?"},{"comment_id":"1286110978131794","commenter_b":"Oh you mean like all the people who first came to America and created the United States? Then took half of Mexico? Oh ok. As long as this is clear and there are no glaring hypocrisies!","commenter_a":"Sorry, incorrect...if you overstay a visa, you are an illegal alien, If you ENTER the country illegally, you are an INVADER!!","post_message":"Allen West Republic"},{"comment_id":"10153436827584153","commenter_b":"very often though.","commenter_a":"it's burning 24/7 don't even try to go there.","post_message":"Would you go vacation in Greece now, despite the economic crisis?"},{"comment_id":"498036517054013","commenter_b":"if they have all that money they should go back wehre they came from","commenter_a":"Do not cave in. Do not sell any land to them. Be careful who you sell to that that buyer does not plan to re- sell to them. It is not unreasonable to consider that it is a possibility.","post_message":"STAND YOUR GROUND! Muslim are IRATE that Small Town Colorado Christians Won Sell Them Property to Build a Mosque! Show your support for these Americans who said HELL NO! NOT IN MY BACKYARD!"},{"comment_id":"10152814946648822","commenter_b":"Should have been three to six YEARS ! This woman is NUTS !","commenter_a":"I love the people on here, who claim to be about humane treatment of animals; but, they want this woman to get beat to death, while in jail. Hypocrites.","post_message":"The woman accused of stealing and euthanizing her neighbor's dog is headed to jail. Today she was sentenced to 3-6 months for killing the husky named \"Thor.\""},{"comment_id":"659128370944408","commenter_b":"Ban them all through the U.S.!","commenter_a":"Yes!","post_message":"A town in Michigan just voted to ban mosques, this was the result. Things are about to get very controversial. Would you like to ban Mosques in your town?"},{"comment_id":"10153386310193869","commenter_b":"Not from NYC... but upstate. Older and forgot spelling.","commenter_a":"Concerto for Horne and Hardart (spelling?)","post_message":"Alex Ross listens to both satirical and serious compositions by Peter Schickele, the man behind the comic persona of P.D.Q. Bach."}]
