[{"comment_id":"10153748749906336","commenter_b":"I want to applaud those that entered our country illegally and their main priority was to become legal and accomplished it. Talked to some that did just that as a priority. Yet, we have the illegals that come and breed like rabbits for an anchor babies. Free benefits. Or men that leave family in other countries, shack up with a women here and start rutting to produce too. Instead of becoming legal. Some have been here over 20 years. If only all would follow the steps to be here legally we would not be as we are today.","commenter_a":"I'm Hispanic and I support Donald J Trump for president Donald J Trump for president","post_message":"WATCH: Donald J. Trump invites a woman onto the stage at a Nevada rally. “I’m Hispanic and I vote for Mr. Trump!”"},{"comment_id":"870676293063413","commenter_b":"She can leave anyway. Useless","commenter_a":"Well,bye","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10155911765540389","commenter_b":"hillary can win if they let enough illegals in","commenter_a":"Stay on her, Mr. Trump!!!","post_message":"'Hillary was the worst secretary of state in the history of our country.” – Donald J. Trump"},{"comment_id":"10153232403476323","commenter_b":"Because, you can fuck over your country. As long as your fucking bitches, smokin cigars, and drinking whiskey, like a man God damnnit","commenter_a":"Why is everything about being gay","post_message":"Gay-rights activist and award-winning author Larry Kramer is 79 and in failing health, but that won’t defuse the impact of his latest bombshell project: the first 800-page instalment of a two-part history of America that tells of the hidden sexualities of figures from Alexander Hamilton, George Washington and Abraham Lincoln to Mark Twain, Herman Melville and Richard Nixon."},{"comment_id":"10153385027713984","commenter_b":"Just GO away!!!!!!","commenter_a":"Freedom of speech","post_message":"Obama is trying to shut Fox News down for good... sadly, this is Obama's America.  He knows he is failing and is desperate to silence his critics... share this with everyone."},{"comment_id":"1057942617592596","commenter_b":"'@username go choke on some bacon goat humper","commenter_a":"Just so I'm clear, Hillary supports illegal aliens coming over here and doesn't support Donald J. Trump wall, but builds a wall to keep Americans out of the DNC? OK, that makes sense....","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153721427574753","commenter_b":"Devious nasty man woman. Ugh","commenter_a":"1 she is a man...2 who cares","post_message":"Caitlyn Jenner just competed in her first golf tournament where she played as a woman. Jenner has always loved golf and this didn’t change when she transitioned. For some reason, it just took this long for her to do a tournament. ET Online shared the details of Caitlyn’s recent golf tournament. Jenner was in the ANA Inspiration Pro-Am in Rancho Mirage, California, on Friday morning and she played alongside former U.S. soccer star Abby Wambach. Caitlyn did a great job on the golf course today... @webpagelink"}]
