[{"comment_id":"10152865678521336","commenter_b":"Christ is the answer for the muslims !!","commenter_a":"All muslims are either radical or they support it ! they follow the qoran and that is what the qoran teaches !! their leader was a pedifile and mass murderer !","post_message":"\"I think we should cut out the political correctness. This is Islamic extremist terrorism. It is not the entire Muslim religion.\"  Former NYC Mayor Rudy Giuliani said President Obama appeared weak for describing Wednesday’s deadly terror attack in France as \"senseless violence of the few.\" @webpagelink"},{"comment_id":"10152906505382169","commenter_b":"Fascist pigs always think they'll be spared by the police state for being boot licking authoritarians. Never really works out that way though.","commenter_a":"America is a complete mess right now because of the Flower Power Generation, Obama, and liberal lunatics. Way to go, @username, just fanning the flames even more with this story. I'll be glad when the Flower Powers die off and we can have America normal again.","post_message":"TONIGHT: Return to the most divisive moment in American history since the Civil War, and witness the mayhem that followed the Kent State shootings.   THE DAY THE ‘60S DIED airs at 8/7c on PBS as part of a special programming block commemorating the Vietnam War. #VietnamPBS Learn more: @webpagelink"},{"comment_id":"603295489861030","commenter_b":"Willie is anti-gun. Doesn't really matter what else he says, Willie can go to hell.","commenter_a":"Go getem Willie.....","post_message":"Willie Nelson just made this huge stand against Obama.  We stand behind him 100%. Let's show him our support.  Can we get 10,000 'LIKES' for Willie Nelson?"},{"comment_id":"10152594766464071","commenter_b":"Why do men think big boobs mean fat?","commenter_a":"Don't be fat. Problem solved.","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."},{"comment_id":"10155915782125354","commenter_b":"I'll bet the gals concerned about this shirt just flat out don't qualify to wear one.","commenter_a":"dont want one dont buy one...must everything be a crisis?","post_message":"Feminists are up in arms about this T-shirt. Should Target cave to their demands?"},{"comment_id":"10150909460504999","commenter_b":"Why won't they announce the legal charge? What a messed up legal system","commenter_a":"What r they charging her with?!","post_message":"Richard Ratcliffe's wife and daughter are being held by the government of Iran. He's in New York during the United Nations General Assembly in an attempt to confront the president of Iran. He shares his story here and answers your questions."},{"comment_id":"10156346724510725","commenter_b":"YOU ARE THE ANTI-CHRIST!!! SHAAAAAA lucifer!!!","commenter_a":"Thank you.","post_message":"THANK YOU for your support this evening Myrtle Beach, South Carolina! My family and I had a fabulous time with you this evening. Together we will #MakeAmericaGreatAgain!"}]
