[{"comment_id":"1669026716715370","commenter_b":"You can not close borders. People can fly here, come on boats and come via Canada or Mexico. The president has deported more illegals than any other president. Frankly the wealthy prefer to hire illegals to watch their children, clean and build their homes and other jobs because they do not want to pay minimum wages and want them to work as slaves in the farms, restaurants and factories. Put the blame where it belongs, on the 5%ers that are reaping the benefits of immigrants. They get you passed at the victims rather than themselves. If you want change you have to vote for someone brave enough to address the issues and actually formulate and execute a plan. Perhaps Bernie who actually addresses the issue. Voting for billionaires backed by the 5% will not resolve any issues.","commenter_a":"Obama better back off, he is allready in it for Treason","post_message":"Franklin Graham just delivered a MASSIVE message to Obama and the left about jihad and what it means for America... liberals are furious, but over 100,000 people have \"liked\" what he said on Facebook. Do you agree with Rev. Graham?"},{"comment_id":"487880261407401","commenter_b":"He got her ass good","commenter_a":"@username bruhhh lol","post_message":"Barack Obama just hilariously roasted Bernie Sanders and Hillary Clinton. #WHCD"},{"comment_id":"10152920092525736","commenter_b":"Because I dive in pussy. No fecal flakes on my","commenter_a":"Because they know what they're doing is wrong & disgusting.","post_message":"41% of transgender people try to kill themselves, compared with 4.6% of the general public, according to a study."},{"comment_id":"10152972519324753","commenter_b":"This bitch","commenter_a":"Nathan Perez @username omg","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"837279236391341","commenter_b":"She's a stupid twat","commenter_a":"How dumb can any one person be?","post_message":"Come again??"},{"comment_id":"1538272953143656","commenter_b":"Benjamin Edward I do!!! I like this takes place in Brooklyn too!","commenter_a":"Benjamin Edward","post_message":"Mark Ruffalo and Bernie took a walk through the Brooklyn, New York school yards where Bernie grew up, and talked about his childhood, why he got involved in the Civil Rights Movement and how those experiences translated into his life in politics and this movement. (Directed by Matthew Cooke)"},{"comment_id":"1062925700414568","commenter_b":"ruthless assholes w/$$ that want more $$ and have far right wing values!","commenter_a":"What idiot thought privatizing prisons was a good idea? Whoever it was... That's where they belong!","post_message":"Next time someone says we're a free country, have them read this."}]
