[{"comment_id":"10153219716141336","commenter_b":"Geraldo is out there looking for trouble. He does not belong there.","commenter_a":"Sick of All of this!","post_message":"Geraldo Rivera reacts to the current atmosphere in Baltimore as police make arrests: \"The cops are swarming over the demonstrators that have defied the curfew.\"  Tune in to 'Hannity' for continuing LIVE coverage."},{"comment_id":"928522093922469","commenter_b":"The plans he has put in place, is FILL AMERICA WITH MUSLIMS AND ILLEGALS....\"GROWTH OF THE ECONOMY IS HIS MUSLIMS AND ILLEGALS IN PLACE FOR A WAR\" SO HE DOESN'T HAVE TO LEAVE THE WHITEHOUSE......WHY DO YOU THINK HE SAID HE WAS GOING TO STAY IN WASHINGTON FOR 2 MORE YEARS, SO \"SASHA\" COULD GRADUATE THERE? HE SURE IS NOT GOING TO PAY THE COST OF HER SCHOOLING OUT OF HIS POCKET....... WAKE UP, AMERICA....THE REASON HE IS NOT IMPEACHED, IS BECAUSE MOST OF THE ONES WHO WOULD HAVE DONE IT, ARE NOT AMERICANS, BUT ARE MUSLIMS.....","commenter_a":"To have a strong economy you need more Americans working and Obama's policies stand in the way of Americans going back to work again. Obama did place an incentive for employers to hire new workers BUT he also put a heavier tax burden on employers to keep their new hires.","post_message":"WATCH Obama:  is pretty darn great right now, and making strides right now...And I don expect that these facts and this evidence will convince some of the politicians out there to change their doomsday rhetoric"},{"comment_id":"10152989925996234","commenter_b":"Guess women will always be in danger after all. Even from those who sworn to serve and protect. Never marry to a cop with a badge, a gun, and a bad attitude","commenter_a":"Wow They did not hesitate to shoot an unarmed blacks. But hesitated when one of their own goes rough and shoot his wife killing her.","post_message":"A witness had a front-row seat to the tragedy that unfolded as Sgt. Phillip Seidle, police said, ambushed Tamara Seidle with a hail of bullets before surrendering."},{"comment_id":"672161809583667","commenter_b":"This gal is a piece of .......","commenter_a":"Nothing quick about judging this one. It's been years in the coming","post_message":"I'm sorry....I'm not a fan."},{"comment_id":"1247431258610235","commenter_b":"Shut Up!","commenter_a":"Black guy shoots a white guy who was trying to help a female. Sad. When do the riots start?","post_message":"SHOOTING CAUGHT ON CAMERA: New Orleans police are searching for the man shown in this video shooting a med student who was trying to stop the suspect from allegedly attacking a woman. The suspect can be seen shooting the student in the stomach after a verbal confrontation, and then attempting to shoot him again when his gun appears to jam. Read full story: @webpagelink"},{"comment_id":"1172778402818410","commenter_b":"the media just didnt air BERNIE enough! didnt get his ideas and platform out there,for all to hear. too busy showing stupid trump./","commenter_a":"Hillary 2016","post_message":"384 pledged delegates are at stake today, nearly twice as many as in New York last Tuesday."},{"comment_id":"10153662620879877","commenter_b":"So that make it cool huh ? Betta keep close eye on ya little one bro ^^^^","commenter_a":"So you found people unconscious, didnt call an ambulance or anything you shot them . That's murder.","post_message":"Black Couple Killed by Police Were ‘Unconscious’ Inside Their Car When Officers Arrived. Watch what happened next below.   Grio fam, what's going on here? Seven children are now without parents..."}]
