[{"comment_id":"1253889731373943","commenter_b":"Think I saw her speak recently. Speaks volumes about this creep. Shout this from the rooftops","commenter_a":"Julie Stoddard Laxton","post_message":"\"It was shortly that initial workshop that I realized that this was not what they were presenting it to be. This was a scam.\" - Cheryl Lankford, a military widow who attended Trump University"},{"comment_id":"1565531100423273","commenter_b":"WoW... I have never been to the USA, but i fear already for the Afro-americans living there now, after reading this comment (n)","commenter_a":"The ones the cops shoot, is because hey are criminals. Felons with weapons. Threatening others and getting the police called on them. All the others, is just fightin and being dumbasses. White people do that do. White felons and criminals get shot too. But since they are white, no one cares to make a news story.","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"10153302631606636","commenter_b":"@username first claimed that all Muslims were terrorists and then claimed that any who thought so we're bigots. She must be so ignorant that to think that there are others that cannot read fast and with great stamina farer than her thoughts drivel out.","commenter_a":"Let me tell you there is no moderate or conservative Islam. Islam is Islam. There are not two Islams. Let me also mention that anybody harming any innocent person has nothing to do with Islam.","post_message":"It strictly follows Sharia rules"},{"comment_id":"491024294436506","commenter_b":"@username you are a horrible racist pile of feces. You're worthless.","commenter_a":"I take offense at The Great White Trash's reference to any member of Native America. He should keep his trash talking to himself. Pocahontas' only crime was a lapse in judgment by saving the life of some white guy.","post_message":"When Donald Trump was asked if “he had been chided by any Republicans” for his Twitter war with Elizabeth Warren, the presumptive nominee said, “You mean Pocahontas?”"},{"comment_id":"10154858734646002","commenter_b":"@username I was shocked at the same thought, why would Disney have a man made Lake that wasn't somehow protected from alligators with a border fence ?!?! We've been there, never thought about alligators because it's Disney, they have safety rules and barriers everywhere.","commenter_a":"So let me get this straight ... Another parent is not watching their child in an area where it clearly says NO SWIMMING so now we are killing alligators for feeding in their habitat where once again it SAYS NO SWIMMING!! What is wrong with people ?!","post_message":"\"We have been to Yellowstone and encountered grizzly bears, but this is just freaky.\""},{"comment_id":"10152716358611680","commenter_b":"Red herring fallacy and straw man fallacy.","commenter_a":"This is sexist and Politico and the lib media are trying to hide this story. Nice try. @webpagelink","post_message":"Kelley Paul says \"to have that label put on him, that really upset me.\" @webpagelink"},{"comment_id":"859268404119788","commenter_b":"Woman - an adult human female.","commenter_a":"This makes me not proud to be an American.. We stand by for the worst stuff.","post_message":"How's this for perspective?"}]
