[{"comment_id":"921294477938692","commenter_b":"Damn that bitch is fugly.","commenter_a":"Rothschild , Soros, Bush, Hillary, Bill, Hubbard, Gore, Planned Parenthood all are illuminati members. Sold their Soul to Satan","post_message":"“We don’t know all of the details about this particular incident, but we do know that our national epidemic of gun violence must be addressed,” Debbie Wasserman Schultz said Saturday after 3 people were killed at a Planned Parenthood in Colorado."},{"comment_id":"925323364324906","commenter_b":"@username yes it was look at the lady who ran it she has ties to hamas open your eyes","commenter_a":"There was no pro Sharia Law March. There was a \"we don't want a president calling women who disagree with him fat pigs\" march. A \"no man has the right to give another man permission to call his daughter a piece of ass\" march. A \"why would you take away funding from violence against women programs as one of your very first acts as president\" march. A \"don't remove health insurance before you have another plan in place march\".","post_message":"Ayaan Hirsi just took the gloves off. She couldn't let this go unnoticed, and neither could we. Do you agree with her?"},{"comment_id":"10153589260353822","commenter_b":"Rebecca .... get out of the basement ....","commenter_a":"Requiring people to carry a concealed weapons permit is just another way the government can get your money. Do people actually think that criminals pay to carry a concealed weapon?? No, they don't. I think this is a great law, go WV!!","post_message":"Effective late May, people in West Virginia will be able to legally carry concealed guns in public without permits or training."},{"comment_id":"10154154613245124","commenter_b":"Shut the phuck up you nasty pig!!","commenter_a":"We are going to be living in the USSA if we don't get these people out of office","post_message":"\"[The media is] adamantly opposed to an economic nationalist agenda like President Donald J. Trump has,\" Steven Bannon says at conservative conference on Thursday."},{"comment_id":"10153903960665329","commenter_b":"Wtf!!! She don't play","commenter_a":"This is hilarious. @username Maria Maldonado","post_message":"#goals"},{"comment_id":"1132646906806453","commenter_b":"That hoe lowkey clean 😂","commenter_a":"Alexis Herrera Heberth Perez Johan Ramirez Luis Olmos Epi Benitez @username bet I won't 😂","post_message":"Too much sauce"},{"comment_id":"10154424174381162","commenter_b":"It's the Ocean. Dangerous animals live there. Leavem alone","commenter_a":"Or he could have just left it alone and the family move to a safer place? Sounds so unnecessary...","post_message":"A dad celebrating Father's Day wrestling an alligator on a beach before it's able to attack his family and others. FULL STORY: @webpagelink"}]
