[{"comment_id":"10153474188676350","commenter_b":"But they can't make babies it takes a man and a woman to have s baby","commenter_a":"So wrong","post_message":"#BREAKING: Supreme Court makes same-sex marriage legal nationwide in landmark decision."},{"comment_id":"833282530101334","commenter_b":"Oh Terry your pro pic explains it all lmfao","commenter_a":"Tell me what isn't wrong with this picture.","post_message":"Bush. Romney. Utah. One day only."},{"comment_id":"1457804240939001","commenter_b":"Don't forget the nra was starred by giving rifles to free slaves in the south to protect themselves from mobs and the kkk","commenter_a":"Just like President Obama, Al Sharpton is losing his grip on reality . Dr. Martin Luther King would roll over in his grave if he knew how far backwards race relations have slipped because of the ideals of Mr. Obama and Al Sharpton. I'm 51 years old, and I'm seeing more race related problems than I can EVER remember.","post_message":"Watch David Webb destory the Reverend..."},{"comment_id":"10153861060719411","commenter_b":"what i see is a dead pussy just blown up.","commenter_a":"terrorist*, not jihadist... jihad is a good thing","post_message":"Video shows Jihadi hit by mortar shell mid-interview"},{"comment_id":"1264276990298713","commenter_b":"Several poor individuals could have food, shelter and job training for the amount of money spent on a wedding that won't probably last, this wedding was just to impress other rich people.","commenter_a":"ugly and ridiculous! Wasted money!","post_message":"How a billionaire gets married"},{"comment_id":"10153649421859138","commenter_b":"Why would you post such a thing Dan??? Wtf?","commenter_a":"Meanwhile in Chicago this weekend, more people were gunned down by those whose lives matter. But let's not protest that.","post_message":"The Twin Cities Marathon went on today without major disruptions, and police did not make any arrests."},{"comment_id":"10154562664816037","commenter_b":"Build Bridges Not Walls","commenter_a":"YES!! as part of an overall plan on illegal immigration . Please Remember that Sen. Hillary Clinton voted twice and lobbied for a border wall!!!!","post_message":"Would Donald J. Trump's proposed wall help?"}]
