[{"comment_id":"640100692862928","commenter_b":"Trolls- in 4 years we have elections again- what if next time the candidate you don't like cheats to win? Will you be OK with a corrupt election system then?","commenter_a":"THEY HAVE A RIGHT TO TRY TO STOP IT JUST LIKE YOU THINK YOU HAVE A RIGHT TO DO IT.","post_message":"The fight for #Recount2016 continues! We deserve a voting system we can trust, that is accurate, secure and just. Despite the sabotage, political cronyism, bureaucratic hurdles, economic extortion, and legal maneuvering that has been thrown in our way, this historic first-ever multi-state presidential recount carries on. I'm here to give you the latest updates, answer your questions, and talk about next steps."},{"comment_id":"1739251936290298","commenter_b":"exactly. Women belong in the kitchen, this is stupid.","commenter_a":"Great. Ahmed, the suicide bomber, will be next. Anything to appease the muslims, right?","post_message":"The six-year-old girl is the first-ever Afghan Muppet, and she is aimed at promoting female empowerment in Afghanistan."},{"comment_id":"10154001788011770","commenter_b":"They not that sexy to me at all need some meat on the bones Sarah Palin is sexy","commenter_a":"Mama's baby papas maybe They look nothing alike","post_message":"Gigi and Bella Hadid proved they are the sexiest sisters in the world at the Victoria's Secret Fashion Show."},{"comment_id":"10152722810447014","commenter_b":"Go back to your country, boy! \"We don't like yo kind around here!\" WHITE POWER!!! Lol","commenter_a":"Her come the racist white people...","post_message":"Do you agree with President Obama's executive action on immigration, which shields millions of undocumented immigrants from deportation?"},{"comment_id":"10153793064907452","commenter_b":"We have to go bail him out!!! 2,000 pesos!!!","commenter_a":"Sal zorro is at it again 😂😂","post_message":"As officers rushed to the Los Angeles International Airport amid false reports of shots fired, they encountered a man dressed as Zorro outside Terminal 7. @webpagelink"},{"comment_id":"658477470966222","commenter_b":"I'm sorry this woman is no good for this country I'm sure there is the woman that be a Great president for this country but she is not the one she is evil and corruptive I see a whole lot of old women who think I got 1 foot in the grave I should vote for a womanwrong","commenter_a":"It still look's like a trash bag on her.","post_message":"Hillary Perón"},{"comment_id":"10153935292307434","commenter_b":"Shay shut the fuck up","commenter_a":"\"Transgendered\" sooooo 2013. BOOOORRRING No one cares. We get it, you're edgy. Zzzzzzzzz","post_message":"\"Trans women are not only sex objects or prostitutes,\" said Amiyah Scott, explaining her departure from the show."}]
