[{"comment_id":"10154445854511973","commenter_b":"this is what i think about blm's","commenter_a":"CRIMINAL PIGS OF AMERICA!!","post_message":"We are broadcasting live from downtown Portland, where members of Don't Shoot Portland are holding a press conference regarding the recent shooting of Quanice Hayes, 17, by a Portland police officer."},{"comment_id":"10153292022111051","commenter_b":"Keep the statue,ignore the STUPIDS !!","commenter_a":"Again, if they don't believe why do they spend so much time removing evidence of God.... I really do believe that Atheist DO BELIEVE in God but don't want reminding that God is Holy and we are not. If God does not exist then sin does not exist, and thus they can live the way they want without worry of sinning...Sad! Our children and our country have paid the price of Atheists and their faithless and evil ideals.","post_message":"Should they have to remove the statue?"},{"comment_id":"453758594748735","commenter_b":"Hey Keith when leeches use my hard earned money to live it's my right to how it's used so STFU!","commenter_a":"Look at it this way, if they can afford to go on cruises, go to psychics and buy liquor, then they don't need to be on welfare.","post_message":"This state just banned welfare recipients from spending their benefits on cruises and tattoos - and officials didn't stop there."},{"comment_id":"713882998713829","commenter_b":"...then get to it...show the American citizens that you politicians have some cajones...IMPEACH the MF'er!!!","commenter_a":"THIS IS THE FIRST TIME IN HISTORY THAT A LEADER OF THE FREE WORLD ISN'T HELD ACCOUNTABLE FOR HIS ACTIONS . AND I WOULD LIKE TO KNOW WHY.","post_message":"The American President... Or Jihadist In A Suit? ⋆ Dc Gazette... @webpagelink"},{"comment_id":"10152902566136336","commenter_b":"Don't worry she will burn ....hell has a special place for people like her !","commenter_a":"Burn her too","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."},{"comment_id":"1252586078101378","commenter_b":"close the borders is THAT step you @$$hole","commenter_a":"Yeah he may need to stop staging them, its transparent that since hes been in office we have had the highest amoumt of mass shootings ever, and seems it happens around the time he wants to push for more gun control. Is it me or am i going nuts.","post_message":"Knowing nothing about the causes of the #SanBernardinoShooting, Obama issues his mindless chant for more gun control. cnn.it/1Xzyg5u"},{"comment_id":"692747934208970","commenter_b":"If illegal aliens must be allowed into our colleges, they should be charged twice the tuition as out-of-state students, with no eligibility for any financial aid, and any courses that legal aliens are taking in order to obtain citizenship be mandatory.","commenter_a":"He'll no!","post_message":"Do you think illegal aliens have a right to attend taxpayer funded public universities?"}]
