[{"comment_id":"1210892618945831","commenter_b":"Ain't no clan rallies, ain't no alllivesmatter, ain't no trump rallies...none of that bullshit up here ya'll mother fuckers get fucked up up here talking that bullshit. If you ever in the big Apple look me up.","commenter_a":"Edited for narrow minded people who want to pick apart a comment as opposed to seeing the big picture: Why do things like this only get attention when the victim is attractive? When this same thing happens to anyone other than black people, it only gets attention when they are affluent or attractive. This SAME THING happens to white people MORE OFTEN than it does to black people and doesn't get the OVERALL attention it deserves. It's not even a black or white thing at this point. It's about what the main stream media will and will not cover. BLM is BULLSHIT and only service to segregating the people and preventing ALL OF US to come together to address these issues. If we cannot band together and fight the power they are the ones winning while we are killing each other. #knowyourenemy","post_message":"I am literally in tears. Full story: @webpagelink"},{"comment_id":"1060450227347787","commenter_b":"Media whore...can't help herself.","commenter_a":"Yup....Good old Alaska values.","post_message":"She chose to spend her time - not with her critically injured husband in Alaska - but thousands of miles away with Donald Trump."},{"comment_id":"10156209671355354","commenter_b":"Please stay there! Not welcome in Texas!","commenter_a":"I hope the next administration is one that will take this down!!","post_message":"And look what it's expected to be by 2018!"},{"comment_id":"698556140299300","commenter_b":"shes a winner","commenter_a":"Recount now!","post_message":"We're at Trump Tower in NYC standing up for voting justice."},{"comment_id":"474793122711268","commenter_b":"NIGGA you need to go back to Kenya, and fucken stay there.","commenter_a":"I was not born in England why don't Odumber go back to Kenya where he was born. He is such a idiot they probably don't want him back.","post_message":"The President just said 'all white people should go back to England'. This is outrageous, and just plain racist. 'LIKE' if you agree!"},{"comment_id":"935633429829739","commenter_b":"No woman EVER asked for it.","commenter_a":"Of course her clothing doesn't mean she wants it. But, if she wears something low cut and is hanging those ta-tas out.... then she should not care, not get mad if guys look at them.","post_message":"Women prove that no matter what they are wearing, they are NEVER 'asking for it'"},{"comment_id":"10154099227939877","commenter_b":"She's stupid... Dont waste your time.","commenter_a":"If you can't cut your vacation short to do your job as president of the united states you aren't fit for the job.","post_message":"Today President Obama visited the flood-ravaged state of Louisiana, despite critics like Donald Trump who say he came too late. Grio Fam, check out what the President promised he would do to help Louisiana going forward. What do you think his trip accomplished? Sound off!"}]
