[{"comment_id":"10154144133589060","commenter_b":"@username I agree. She's one big mess. But they will elect her. Everyone loves a winner","commenter_a":"Lets make no mistake - Hillary has LOTS and LOTS of experience with many, many, many male (and some woman) leaders.","post_message":"Sanders espouses bold positions; Clinton talks about the world leaders she has met"},{"comment_id":"10153635664936717","commenter_b":"Lock her up! Oh wait she's careless just like Hillary!","commenter_a":"At this point, this is just funny.","post_message":"Here she goes again..."},{"comment_id":"10153376239848984","commenter_b":"Kill the fucking idiot","commenter_a":"He is now someone's girlfriend...","post_message":"He stabbed a police officer 14 times and what he said here was even WORSE. Do you think this criminal deserves life behind bars after this?"},{"comment_id":"10153908275696545","commenter_b":"@username the problem with the wall is it can be breached and take years to build, and will still have to be guarded. How about we just beef up border patrol and guard our country the way it was intended? If you research you will find that there are miles of tunnels already that bypass above ground entry. Although we have National guard at the borders they have no jurisdiction to stop anyone from entry and can only alert border patrol. If border patrol is busy elsewhere then the illegal immigrants are not stopped. These are the issues that need to be addressed building a wall is useless as we will still have the same problem not enough manpower to protect it.","commenter_a":" the \"wall\" is the most ridiculous idea to come out of a politician yet. Good luck getting Mexico to pay. How about you use common sense and get congress to give up funds for proper border patrol?","post_message":"If Donald Trump is softening his stance on undocumented immigrants, he didn't mention it to several thousand supporters at the Travis County Expo on Tuesday night. “We are going to build the wall,” Trump said to cheers. “And who’s going to pay for the wall? Mexico!”"},{"comment_id":"887899764578453","commenter_b":"Any woman dumb enough to marry a cop shouldn't be surprised when he starts beating on you. How do you think cops unwind after work? The single ones get a dog to kick around","commenter_a":"Smh! When will it end?","post_message":"With all these red flags, police still didn't step in and protect her. Is it because the abusive husband was a fellow cop, so they just let him do what he wanted to her? Wow!"},{"comment_id":"10152871641536051","commenter_b":"My husband served 20 years for this country and then a bitch like u get the freedom. U need to get the hell out of here and there may be someone out there that will really get mad and look for u bitch.","commenter_a":"Then WHY IS SHE HERE??? OHHHHH!!!! Cause she makes her $$$$$ here. Proud Americans STOP SUPPORTING THIS LOSER!!!!","post_message":"This musician says she hates absolutely everything about America."},{"comment_id":"1219604621413341","commenter_b":"A very large dick","commenter_a":"I was born and raised on Ohio and this man embarrasses me","post_message":"Here's a clue: She's not a 62-year-old man, but that's not all. It gets worse. Much, much worse."}]
