[{"comment_id":"1426892224004095","commenter_b":"It is an eye opener!! The horror will be if Hillary is actually elecyrd. Then the real horrors will begin.","commenter_a":"Excellent movie! A must see!","post_message":"Hillary's America might just be the scariest movie you see all year...  hillarysamericathemovie.com/#tickets"},{"comment_id":"1493294134044387","commenter_b":"She is pure evil & should be put to death.","commenter_a":"Hillary is done the writings on the wall god look at the rallies know it's there for her no signs no bumper stickers no T-shirts and say Hillary for prison. She's a criminal and should prosecuted","post_message":"Wow!"},{"comment_id":"10152605770366680","commenter_b":"She certainly has enough raging male testosterone !!!!","commenter_a":"She is totally useless and has done absolutely nothing of benefit to the Democratic Party.","post_message":"Running for Senate might be an elegant solution for a woman with no other way to advance her career."},{"comment_id":"10153585954722994","commenter_b":"White people are the terrorist.....not Muslims","commenter_a":".","post_message":"After last week's attack in Tennessee, this man showed up at a military recruitment center with his AR-15 - but preventing another attack isn't why he did it."},{"comment_id":"10154431413636323","commenter_b":"Both you ladies have proven the theory correct. Your periods are synched","commenter_a":"They're forever in shitty moods. This makes the theory correct","post_message":"Ever since Martha McClintock, a psychologist from Harvard University, published her 1971 study of 135 female undergraduates living in a college dormitory together, it has been accepted that menstrual cycles synchronise when women live together. Her study, based on an analysis of about eight cycles per woman, found that roommates and close friends saw the average number of days between the starts of their periods fall from eight or nine to five days. But is it really true?"},{"comment_id":"10153352296609497","commenter_b":"Whether or not you find the humor funny is entirely subjective, of course.","commenter_a":"This isn't satire and it never will be. This is a pathetic example it castigating old people.","post_message":"From our sister publication, ClickHole:"},{"comment_id":"1085812054871914","commenter_b":"Ignorant pig","commenter_a":"Be careful what you wish for buddy","post_message":"\"I think we should take a drug test prior to the debate.\""}]
