[{"comment_id":"939636916071768","commenter_b":"She's a whore? @username you are a crude, ignorant troll.","commenter_a":"The first real scientific post-debate poll results are out and they are great news for Hillary Clinton. According to the just released Huffington Post/YouGov poll, 55% say Clinton won the debate as compared to just 22% who said Sanders did. Furthermore, 52% in the national poll now say they want Clinton to be the nominee, up from 44% prior to the debate. All in all, a great result that matches the media's assessment of who won the debate, our next President, Hillary Clinton!","post_message":"Larry David is Bernie Sanders."},{"comment_id":"1123813841007500","commenter_b":"Illegals, you don't like our choice for president please do us a favor and go back to yours!","commenter_a":"Trump brought half his votes!!!","post_message":"WATCH LIVE: President Obama awaits Donald Trump's arrival at the White House for transition meeting. Story: @webpagelink"},{"comment_id":"10153501793088837","commenter_b":"I don't care that they kissed but I think all PDA should be refrained. I won't do it in public and I don't like it when straight people do it. Save for privacy of your home. I don't mind seeing a quick kiss, but the groping is nasty.","commenter_a":"keep your private life private... and when you go to a different place be modest n respectful..carry yourselves accordingly","post_message":"UPDATE: Jordan Schaeffer still hasn't recovered from his Miami vacation when he and his boyfriend were beaten at a BK Whopper Bar in Miami Beach after they kissed."},{"comment_id":"10153934719761813","commenter_b":"@username Go run to your safe space. The ACLU would rather cast legal immigrants in with the illegal Alien filth than make a distinction between legal immigrants and these animals. It's not \"harsh\", it's calling this scum exactly what they are.","commenter_a":"Hey ACLU, these animals aren't \"undocumented immigrants\", don't lump this filth in with those that have legally immigrated here. They are Illegal Aliens, not legal permanent residences, naturalized citizens or here on visas. They broke the law and should be treated like the criminals they are; detained, processed and then deported back to their home countries along with their families. This garbage SHOULD live in fear, be harassed and made to feel uncomfortable. They should be detained, when local LEO interact with them, and then turned over to ICE/CBP for deportation.","post_message":"Since Election Day, the ACLU has seen a renewed sense of urgency from hundreds of thousands of Americans to protect civil liberties. One of our top priorities is ensuring that our communities don’t fall under siege in service of Trump’s quest to deport undocumented immigrants. To carry out his mass deportation scheme, Trump would have to cast his dragnet far deeper into American communities. Even if massive taxpayer dollars could be diverted to do so as a practical matter, the effort will erode the civil liberties of all. Millions of people who live and work along our nation's borders—from New York to Arizona, Washington State to Texas—are already living in increasingly militarized areas where they are stopped, harassed and treated in ways the U.S. Constitution does not permit. Read more about the work already in progress to ensure people’s rights are protected in border communities @webpagelink"},{"comment_id":"10155369881175389","commenter_b":"Hillary should run on a ticket with McCain. Both are so full of themselfs.....hint","commenter_a":"#ThaiJohnson the reason she doesn't look into the camera is the same reason a person lying to you can't look you in the eyes, she has that Obama syndrome can't stop lying and can't keep tract of the lies.","post_message":"Question of the Day: What do you think of Hillary Clinton's performance at today’s press conference? Tell us in the comments, and tune in to Fox News tonight at 10p ET for more on this story."},{"comment_id":"10154001620082377","commenter_b":"I don't think that would work here, just look around now, pants below waist so nasty drawers complete with nasty skid marks being worn, woman with breasts hanging out of clothes and jeans with the butts completely exposed, (men and women), FU t-shirts, and on and on. Burkas would improve these types, so no, let them wear burkas.","commenter_a":"The thing is that it is part of their religion and I think we should respect their right to wear it, it is not indecent. I can think of a lot of people who benefit from it , you know to cover up too tight pants on someone who is obese and so on.","post_message":"Angela Merkel calls for Germany to join France, Belgium and others in banning the burqa. Should America be next?"},{"comment_id":"1357245971012470","commenter_b":"I prefer her to LEAVE!!!","commenter_a":"The way you get around those problems young lady is to loudly speak out against radical Islam, disavow any sympathy for them or their cause, encourage other like minded Muslims to do the same. That's how you stop the American people from associating you with them. Or you could just leave the country.","post_message":"She joins CNN's Costello to trash Trump after his victory..."}]
