[{"comment_id":"1279380305469095","commenter_b":"Obama said there are 53 states. Everyone makes mistakes. Calm down","commenter_a":"Deployables go vote on the 28","post_message":"LOL! Donald J. Trump just told supporters to go vote 20 days after the election is over.  Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153120906398205","commenter_b":"95percent of the illegal immigrants are hard workers.... So much so that many citizens feel threatened will take their jobs.....i would never be scared if an illegal taking my job......","commenter_a":"Thus is what you spend your time on. Your dedication should be the American people I think your priorities are screwed up. As a congressman you work for the citizens of this country.","post_message":"Central Florida - I'm coming to talk about how to get ready for DACA and DAPA!"},{"comment_id":"548856361983005","commenter_b":"Yes","commenter_a":"Yes","post_message":"The NFL, coaches, and fans are sick of him and his garbage. The league has had enough. Do you think Kaepernick should be ejected from the league?"},{"comment_id":"10153865270269749","commenter_b":"Gillian..you too are vermin! We must make sure that you do not breed indiscriminately!","commenter_a":"Foxes are vermin and very distructive for farmers, not the cuddly toys as always portrayed by the media. However what is the most humane way to cull them.. A bullet is best but only if you are a very good shot as a wounded fox can take days to die. Poisoning is also a slow death. Trapping is just as bad as they can take days to die or try and chew off their own paws. So it looks like there is no easy answer, and no we cannot just let them breed indiscriminately without some control as you would understand if you saw the havoc they can cause especially in the lambing season.","post_message":"\"Fox hunting is a pursuit from the past and like the overwhelming majority of the population I believe that is where it should stay, consigned to history.\""},{"comment_id":"10153145419396323","commenter_b":"Fucktards","commenter_a":"Romantic assholes","post_message":"Colossally stupid."},{"comment_id":"502105753294821","commenter_b":"Leave bitch!!!","commenter_a":"Trump for president!","post_message":"We'll pay for your ticket..."},{"comment_id":"10154373142406509","commenter_b":"It's bc she's white and rich.","commenter_a":"When you have money the law work for you and when you're poor it don't","post_message":"Tonya Couch, the mother of so-called \"affluenza\" teen Ethan Couch, had her bond lowered from $1 million to $75,000 at a hearing on Monday."}]
