[{"comment_id":"1007328145956900","commenter_b":"Then take your ass back to england and leave all the money you made from American box office sales.","commenter_a":"Then go home.","post_message":"Well, that seems a bit over the top."},{"comment_id":"1196105023763301","commenter_b":"I got something for your ass you want it","commenter_a":"How about remove the sick person behind addicting info !!!!","post_message":"Somebody just did something genius to help in the battle to remove Donald Trump from public life."},{"comment_id":"1008364749198946","commenter_b":"But the only way to stop a bad baby with a gun is with a good baby with a gun!","commenter_a":"My Hero","post_message":"BOOM!"},{"comment_id":"852398211532955","commenter_b":"The DEMOCRAT PARTY IS A DEATH CULT! American deaths do not matter except to attack the Constitution! Democrats and their media mouthpieces HATE Christians, Jews, and conservatives, but support Islam because... ISLAM = DEATH CULT DEMOCRAT PARTY = DEATH CULT (facts): - The Democrat Party has a KNOWN NAZI (Soros) as its key financier and leader. - Fast & Furiously providing weapons to murdering gangs while trying to disarm Americans. - Freeing violent felons to MAIM AND MURDER AMERICANS! - Pushing an open border illegal alien invasion to RAPE AND MURDER AMERICANS, INCLUDING CHILDREN--, then BLOCKING KATE'S LAW which would have reduced all of this! - Treasonous support to fund Iranian terrorism (and nukes). - Ignoring the Islamic RAPE AND MURDEROUS SLAUGHTER OF CHILDREN, WOMEN, AND CHRISTIANS. - Freeing terrorists for a deserting traitor. - Promoting a race war that Satanist Charles Manson would be proud of. - Supporting Planned ...","commenter_a":"It's only been \"home grown\" since you started importing your Muslim brothers into the country.","post_message":"Here it comes..."},{"comment_id":"831083283688817","commenter_b":"Just a bunch of fat people eating fat food. No incumbents in 2016 november.","commenter_a":"America runs on Dunkin!!","post_message":"Elizabeth Warren repped Massachusetts by bringing Dunkin' Donuts to the House sit-in."},{"comment_id":"10155177965959050","commenter_b":"MAN HATER. EVIL WOMAN","commenter_a":"Disgusting.","post_message":"The anti-Trump Women's March featured a woman who kidnapped a man and then tortured him"},{"comment_id":"1008748529146158","commenter_b":"And you are a pussy","commenter_a":"Your not a hunter if your using a gun, your a murderer.","post_message":":("}]
