[{"comment_id":"10154739260431509","commenter_b":"2","commenter_a":"Let's make a small poll: 1- Donald Trump 2- Hilary Clinton","post_message":"What was meant to be a fun day of riding roller coasters at the amusement park turned into a very scary ordeal for this family."},{"comment_id":"698823633563273","commenter_b":"Well then stop her. Isn't that your job?","commenter_a":"Yes a female Eric Holder,","post_message":"GOP leadership should stop the Loretta Lynch nomination by not reporting it to the floor for a vote. We must reject lawlessness, outright."},{"comment_id":"10154014226755329","commenter_b":"Wants it now","commenter_a":"Luis Lkns","post_message":"This is fact."},{"comment_id":"10157476731040725","commenter_b":"Now get you're head out of his illegal Orange trumpster butt2.. It's over flowing with his B.S for a LIFETiME!!!!!","commenter_a":"This is what I don't understand, Every Trump rally, there are 1000's of people in attendance. Not as many people show up at Clinton rallies. Yet she is ahead in the polls!! Is the media and the poll takers rigging the outcome of the polls?","post_message":"A beautiful evening in Ft. Lauderdale, Florida last night. We need to WIN Florida- so make sure you get out and VOTE this November! I am here all day - attending events -- looking forward to a great day! -DJT"},{"comment_id":"1192837800775695","commenter_b":"'@username talk about my mother bitch see what happens.","commenter_a":"No Obama, kiss our ass traitor!","post_message":"Not sure what he thought was going to happen when he started with the name calling, but Obama just gave him a political middle finger."},{"comment_id":"10154003941470950","commenter_b":"Elizabeth Lilly what a ignorant women you are","commenter_a":"His first 100 days will be tremendous. So tremendous and full of catering to Russia. Bigly. He will keep us in suspense as he plans to steal back the money he spent for the campaign. So many plans. Big plans. And we're gonna pay for it. Bigly.","post_message":"Trump is about to speak to a crowd about what his first 100 days in office will look like: @webpagelink"},{"comment_id":"10153990107026955","commenter_b":"See you at Blade Show bitch!","commenter_a":"The rights to a free press, free speech, assembly, and religion are extremely important but none of them matters very much if you can’t defend your own life against aggression. Leave your hands off my guns!","post_message":"BREAKING: Active shooter at Lackland Air Force Base in Texas, at least 2 dead"}]
