[{"comment_id":"1788072574740832","commenter_b":"jesus Christ those girls look petrified","commenter_a":"@username @username 😱😱","post_message":"Parents in remote parts of Malawi are sending their daughters to be sexually initiated by local men - called \"hyenas\" - when they reach puberty. Meet Eric, he’s proud of his role as a \"hyena\". Learn more from BBC News Magazine: @webpagelink Listen to the documentary: @webpagelink"},{"comment_id":"1811838059034995","commenter_b":"And her answer is I don't have an answer for you. Really because you know the answer already bitch","commenter_a":"Love this guy. So to the point it's pathetic. And I can't answer anything.","post_message":"Trey Gowdy utterly DESTROYS this liberal...."},{"comment_id":"10153066062681770","commenter_b":"She will say anything to get people to vote for her!","commenter_a":"I wouldn't back her as dog catcher, the dogs never did anything to me, I like dogs. Can't stand Hitley.","post_message":"Hillary Clinton claims the National Rifle Association takes an “absolutist” stance on gun rights, comparing it to “the Iranians and Communists.”"},{"comment_id":"10155299383400354","commenter_b":"Those of us who are legal US citizens in need can't get help yet we give those who are illegal help. When I fractured my neck in 3 places and shattered my leg all I got was 200 in food stamps. I was 55 and I lost everything. Stop giving this country away to those who disrespect with their very first action. Coming here illegally.","commenter_a":"They are giving them ids and other things so they can once again steal the presidency through illegals voteing. Get out and vote stop the craziness. Our president is in office illegally as he is not a US born citizen. So of course he is for illegals.","post_message":"NYC's New Illegal Alien ID Program Includes Free Membership to 33 Top NY Venues, Including the Metropolitan Museum of Art."},{"comment_id":"1661235427481336","commenter_b":"We need the wall Canada has a wall but i forgot all the famers might lose there free lador","commenter_a":"hahaha... a very accurate comparison! Lol.","post_message":"\"On Feb. 9, we trust New Hampshire Republicans will send 'Biff Trump' back to somewhere — anywhere but on the road to the most important elective office in the United States at a most crucial time for this nation.\""},{"comment_id":"567332390082204","commenter_b":"The dumbest woman in America alive .","commenter_a":"What a goofy broad.","post_message":"What are they going to call it, Mount Dumb-Dumb? -Conover"},{"comment_id":"1230508030293998","commenter_b":"They can do this and the Toronto Blue Jays can't tell Gibbons to apologize to women?","commenter_a":"Charles once said he wasn't a role model. That's over. Well done to the Round Mound. Also, FWIW, while he has talked in the past about being a Republican, he has supported Democratic candidates consistently and all but begged Joe Biden to run for president before he came on the Final Four show.","post_message":"\"It’s my job, with the position of power that I’m in and being able to be on television, I’m supposed to stand up for the people who can’t stand up for themselves.\""}]
