[{"comment_id":"489292257897396","commenter_b":"As long as yours dangerous people out there with weapons there's no reason to take away mine. If you take away all the guns from law-abiding citizens all you will have left are criminals with guns and there's no way to get all of those guns away from them","commenter_a":"What's the point in saying this every time and never doing anything about it? Of course, more gun control. Giving guns to the general public is fucking stupid.","post_message":"Once again, America needs to answer this question..."},{"comment_id":"940190486114130","commenter_b":"What a fucking shitbag","commenter_a":"Bill Clinton was President and the Commander in Chief during part of my time in the National Guard. I had no respect for him as a man but had I ever encountered him I would have rendered proper military courtesy out of respect for the office of the President. When you put on the uniform you mo longer get to pick and choose.","post_message":"HA! She should've thought twice..."},{"comment_id":"978190742237455","commenter_b":"Hillary will win in 2016!","commenter_a":"Hillary 2016!","post_message":"“I should have used two accounts—one for personal, one for work related emails. That was a mistake, I’m sorry about that, I take responsibility, and I’m trying to be as transparent as I possibly can.” -Hillary on ABC World News Tonight with David Muir"},{"comment_id":"10156258730695725","commenter_b":"Come to grand junction","commenter_a":"medias are crooks ...liars liars and liars gooooo trump you still got my vote and my whole family","post_message":"After a great evening and packed auditorium in Iowa, I am now in Colorado looking forward to what I am sure will be a very unfair #GOPdebate!"},{"comment_id":"10153486509166320","commenter_b":"Stupid woman. Don't vote for her just because she is a woman. You voted for a color. Remember...","commenter_a":"And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course ‘lest we forget’ what has happened to many “friends” of the Clintons. 1- James McDougal – Clinton’s convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr’s investigation. 2 – Mary Mahoney – A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown.. The murder happened just after she was to go public w:th her story of sexual harassment in the White House. 3 – Vince Foster – Former White House councilor, and colleague of Hillary Clinton at Little Rock’s Rose Law firm. Died of a gunshot wound to the head, ruled a suicide. 4 – Ron Brown – Secretary of Commerce and former DNC Chairman. Reported to have died by impact ...","post_message":"Hillary Clinton held her first major rally of her 2016 presidential campaign on Roosevelt Island today. She called for a new era of shared prosperity in America and told supporters that workers can trust her to fight for them."},{"comment_id":"10153754034371336","commenter_b":"JJ Smith ,any investigations on Hillary Clinton she has coming,nothing more than a lier and crook. Planned parenhood should get no more money until they no longer do abortions,I do believe in some abortions but not late term or in order to butcher infants to sell body parts! Not a fan of Obamacare and the IRS is corrupt as is the Justice Dept.It seems to me that most of the politicians these days on both sides of the isle are corrupt and should be replaced!","commenter_a":"FANTASTC and appropriate response.","post_message":"\"I kind of feel sorry for people who are so consumed with hatred and intolerance that they behave in that manner. I say we should pray for them.\" Today on \"FOX & Friends Weekend,\" 2016 presidential contender Dr. Ben Carson responded to an attack he received from GQ. @webpagelink"},{"comment_id":"10153031617927217","commenter_b":"Nope, women can't","commenter_a":"Can they pee standing up?","post_message":"While the two women will graduate this week, they will not serve in the US Army's 75th Ranger Regiment. The US military has yet to lift a ban on women serving in the fighting force."}]
