[{"comment_id":"10153543758049753","commenter_b":"i hate this bitch","commenter_a":"You should start packing, so your ready when time comes","post_message":"According to Whoopi Goldberg, America will no longer be such a great nation if Donald Trump is elected. She shared this opinion Wednesday on The View where she stars as a cohost. This is what she said: “I’ve always been an American, and this has always been my country, and we’ve always been able to have discussions. And suddenly now it’s turning into, you know, ‘not them, not them.’ And you know, we have a lot of friends whose parents saw this already. They don’t want to relive this. They... @webpagelink"},{"comment_id":"408303332684881","commenter_b":"Maxine, you don't know much do you. The minorities already have the right to vote. Sorry if they won't let you count the votes that some people made with the names of dead people. Illegal aliens don't have the right to vote, because they are not citizens of the USA.","commenter_a":"As long as the current conservative, sorry ass Republicans are controlling both the House and Senate, there will never be a vote on a new Voting Rights bill!!!:( They are against anything good for minorities, women, seniors, and the working class.","post_message":"On this day in 1965 President Johnson gave his Voting Rights Act Address to Congress. Today, we should DEMAND Congress pass a new Voting Rights Act. Sign this petition if you agree."},{"comment_id":"10153577547513352","commenter_b":"Amber shut your ass up looking like momma June. Fat ass","commenter_a":"This sight sucks","post_message":"In sickness and in health: Soldier marries fiancée despite brain injury that left her unable to recognise him just days before their wedding… and then spent five years teaching her to walk, eat and speak again"},{"comment_id":"10158045305755206","commenter_b":"Never get a mortgage if you lose ur job your F ed.My gran always said get a council house,If anything goes wrong they have to fix it,If you lose your job they have to pay your rent.","commenter_a":"@username read the comments.We Defo got to do the outer boroughs next time! X","post_message":"“I wouldn’t give this up for anything.”"},{"comment_id":"10154318254146509","commenter_b":"Why don't you look back in G W Bush and Klinton to what they did? The difference between Russia and the USA is that the USA never asked for permission to invade any country. They just did what they wanted, and they destroyed the whole country with it's sovereignty. Another difference is - when you sea how these leaders greet \"dictators\" as they call them, with extremely wide hypocritical smile, and after a while the destroy them. Russian leader doesn't smile that much, but you get the feeling that he doesn't substitute his values and he is a person that can be trusted.","commenter_a":"Closed CAPTIONS, please!","post_message":"Five of CNN's correspondents look back at the role of Russia and President Vladimir Putin this year, and what impact there may be in the future. @webpagelink"},{"comment_id":"10154684364106130","commenter_b":"Jerry's beautiful wife. Who looks like that","commenter_a":"Gayle Gergich, you rock Pawnee!","post_message":"Slay, Christie Brinkley!"},{"comment_id":"10153369363747061","commenter_b":"Should make the short fat squatty ones! Nor everyone has a 12 inch waistline.","commenter_a":"Hello, Are you interested in the world of FAME?? Getting rich. powerful and famous? JOINING THE ILLUMINATI BRINGS YOU INTO THE LIMELIGHT OF THE WORLD IN WHICH YOU LIVE IN TODAY. YOUR FINANCIAL DIFFICULTIES ARE BROUGHT TO AN END. WE SUPPORT YOU BOTH FINANCIALLY AND MATERIALLY TO ENSURE YOU LIVE A COMFORTABLE LIFE. IT DOES NOT MATTER WHICH PART OF THE WORLD YOU LIVE IN. FROM THE UNITED STATES DOWN TO THE MOST REMOTE PART OF THE EARTH, WE BRING YOU ALL YOU WANT. BEING AN ILLITERATE OR A LITERATE IS NOT A BARRIER TO BE A MILLIONAIRE BETWEEN TODAY AND THE NEXT TWO WEEKS. YOU BEING IN THIS OUR OFFICIAL PAGE TODAY SIGNIFIES THAT IT WAS ORDERED AND ARRANGED BY THE GREAT LUCIFER THAT FROM NOW ON, YOU ARE ABOUT TO BE THAT REAL AND INDEPENDENT HUMAN YOU HAVE ALWAYS WISHED YOU WERE .SO IF YOU ARE INTERESTED IN ...","post_message":"There are some new Barbie dolls on the block: curvy, tall and petite! @webpagelink"}]
