[{"comment_id":"913019148787853","commenter_b":"She's literally the dumbest woman on earth.","commenter_a":"@username @username is there anything in this world that doesn't offend people? Lol good lord","post_message":"\"Star Wars\" fact-checkers quickly took to social media to point out several holes in Harris-Perry's theory."},{"comment_id":"854169234726517","commenter_b":"How about rapist?","commenter_a":"If trump is despicable, what does that make Hillary ?","post_message":"\"He’s just despicable,\" Letterman said, adding that Donald J. Trump may very well prove the saying that \"anyone can grow up to be president.\""},{"comment_id":"10153720250674877","commenter_b":"And then his white gf walks in the video shot. Lmao","commenter_a":"He's a confused brother. I'm sad for him","post_message":"Black cop’s pro-Trump, anti-protester video goes viral: I felt safe with Trump fans!  Grio fam, what do you think of what he has to say? Would you feel safe at one of these rallies?  Share your thoughts below."},{"comment_id":"10152601048042061","commenter_b":"till she open`s her stupid mouth.......again !!!!","commenter_a":"I love this photo. Most models would be posing and trying to be the focal point. I just adore the fact that stunningly gorgeous Giselle has her hat pulled down and is pointing at Tom, and not stealing a bit of his thunder. What a great couple they make!","post_message":"Coming in at number 3 in the  News midday buzz  see how Gisele Bundchen and Tom Brady and their kids celebrated the Patriots AFC Championship win: @webpagelink"},{"comment_id":"10153325376679091","commenter_b":"Send these terrorists back to where they came from","commenter_a":"Coming from the idiot that wants to let all these refugees into our country... pfffft","post_message":"\"Once again we have seen an outrageous attempt to terrorize innocent civilians... We send our deepest condolences, offered our full support to the French people\" - President Obama."},{"comment_id":"10153482227782377","commenter_b":"The corruption mongers who have like leeches suck the blood and financial life out of this country find being with Trump is of no benefit to them therefore its a matter of running scared when we find out who they are their done!","commenter_a":"were never conservitves in the first place @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@2","post_message":"In the wake of his Indiana primary victory, some Republicans are breaking with party tradition and refusing to support Donald Trump under any circumstances."},{"comment_id":"10157293666220725","commenter_b":"Did you hear what Hillary said? She intends to talk to \"the white people\". She makes me sick!","commenter_a":"we need trump for president in 2016 go trump","post_message":"I am the Law and Order candidate!"}]
