[{"comment_id":"10153754034371336","commenter_b":"JJ Smith ,any investigations on Hillary Clinton she has coming,nothing more than a lier and crook. Planned parenhood should get no more money until they no longer do abortions,I do believe in some abortions but not late term or in order to butcher infants to sell body parts! Not a fan of Obamacare and the IRS is corrupt as is the Justice Dept.It seems to me that most of the politicians these days on both sides of the isle are corrupt and should be replaced!","commenter_a":"FANTASTC and appropriate response.","post_message":"\"I kind of feel sorry for people who are so consumed with hatred and intolerance that they behave in that manner. I say we should pray for them.\" Today on \"FOX & Friends Weekend,\" 2016 presidential contender Dr. Ben Carson responded to an attack he received from GQ. @webpagelink"},{"comment_id":"931007510269923","commenter_b":"You Don't Hit a Woman,You Turn and Walk Away !!","commenter_a":"Will someone please beat this woman beater up and take away his nfl career.","post_message":"Florida State University quarterback De’Andre Johnson is charged with misdemeanor battery."},{"comment_id":"657748434349749","commenter_b":"CANCEL the game, go to half time show, then go home. Terminate the remainder of football season. Have each player turn in his jersey...","commenter_a":"I WOULD LOVE TO SEE AN ENTIRE STADIUM WALK AWAY FROM THIS CRAP...","post_message":"The entire team decided to pay tribute to Kaepernick and take a knee during the National Anthem. Guess how that worked out for them."},{"comment_id":"1267309513345274","commenter_b":"Great comeback! :)","commenter_a":"Ya gotta love the way the Dems embarrass themselves in front of the entire world .... just say'n .. JBeale","post_message":"Allen West Republic"},{"comment_id":"1192730294142303","commenter_b":"Sherry Ashrof","commenter_a":"Mike Simm","post_message":"Nice ice baby!"},{"comment_id":"1371652822850169","commenter_b":"Shut the fuck up dum bytch","commenter_a":"a policemans job is hard and they have to put up with alot of verbal abuse and it takes alot of self restraint, thats y it is important for the good brave cops who really care about what they do to take pride and turn in the bad cops who do not care or are just burnt out","post_message":"This DJ just said it's time for good cops to start calling out bad cops."},{"comment_id":"10153829550465575","commenter_b":"Go home Cruz we want trump !","commenter_a":"Trump is a strong supporter of the Second Amendment! This post is another poor attempt to win votes for Cruz. If Killery or Bernie win the Second Amendment is in trouble as will be the first. I am sure the Feds are wanting to shut the internet down so we can't inform each other on what they are up too. Lets face it! The internet has shown America how corrupt our Government has become. Without it we would never have known.","post_message":"These are the lies that TRUMP is referring to. . . ."}]
