[{"comment_id":"10153697709133984","commenter_b":"He'd never make it to prison if that was my daughter or granddaughter. But since he will hopefully go to prison, its a shame someone never showed him an illustration on a blackboard about the size of your asshole before prison and the size it is when/if you get out. Maybe he would then have had sense enough not to rape a child. When he goes to prison he's going to find out what real rape is like...good.","commenter_a":"Castration sounds good to me. He wouldn't do it again","post_message":"This sick punk raped a young girl and admitted to it... but the disgusting thing is his absurd excuse.  Our country is in deep trouble and this proves it... this little girl did nothing to deserve this."},{"comment_id":"10153975283176336","commenter_b":"Nothing will happen with her, its just a power game","commenter_a":"She disgusted me and betrayed all women who've suffered mistreatment at the hands of their men when she went back to that crumb of a husband of hers...they deserve each other!","post_message":"Earlier on 'America's Newsroom,' Fox News contributor Katie Pavlich said Hillary Clinton must answer for her role in former President Bill Clinton's scandals. What do you think? @webpagelink"},{"comment_id":"1241057529263037","commenter_b":"All those upset by the depiction of a multi-racial family should investigate their own DNA. One can only wonder at their stupidity and self-loathing!","commenter_a":"Well done State Farm.....","post_message":"Can you believe this?"},{"comment_id":"10154102515036409","commenter_b":"She knows how to promote something unreal as real!","commenter_a":"Yes! Prepare to have big business be hit with a steel chair! Bring Main St back to America!","post_message":""},{"comment_id":"10153260495114087","commenter_b":"She should run to prison!","commenter_a":"100 percent right","post_message":"\"I can tell you this, if that were a Republican that did what she did with the emails, they would have been in jail 12 months ago,\" Donald J. Trump said."},{"comment_id":"1231733206844027","commenter_b":"I see nothing beautiful about her, she's hateful, that's ugly!","commenter_a":"Michelle Bachmann is a beautiful woman. Too bad....","post_message":""},{"comment_id":"10153478899444342","commenter_b":"Liberals are actually MURDERING people with their stance. The liberals are the real murderers. Did I say that ENOUGH? @webpagelink","commenter_a":"I am not a veteran. These are Christopher's words Christopher Allard 23 hrs · Edited · I don't typically go on rants or express my political beliefs here, but I just have to get this off my mind. As some of you know, I'm active duty Army. Aside from that, I am a medic. I've spent 3 years of my life overseas in both Afghanistan and Iraq. I've seen some pretty atrocious sites caused by war, from both sides. I've picked up blown up body parts of friends and I've saved the lives of guys who were trying to kill me and my guys right before I was keeping them from their 72 virgins or whatever they believe awaits them on the other side. Here is an unbiased truthful view to the Syrian refugee situation. My first deployment to Iraq, in 2006, my unit voluntarily ran a childrens burn clinic ...","post_message":"President Obama is vowing to veto a bill from House Republicans that would increase screening for Syrian and Iraqi refugees before they enter the United States. #abc13"}]
