[{"comment_id":"1874042932818866","commenter_b":"She is the mentally unstable one.","commenter_a":"And you should have left by now. We already elected him!","post_message":"Rosie O'Donnell says Trump is mentally unstable, and we have \"less than 3 weeks to stop him America. Do you think her comments are treasonous?"},{"comment_id":"10154028228372060","commenter_b":"B*LL S**T.","commenter_a":"Assuming this is true, this is unacceptable. What a horrible thing to say to someone.","post_message":"A Muslim teacher in a Georgia high school said someone left her an anonymous note in her classroom, telling her that her \"headscarf isn't allowed anymore.\" The note also told her to \"tie\" her headscarf around her neck and \"hang yourself with it.\""},{"comment_id":"10153933427867235","commenter_b":"Shouldn't she be looking for baby daddy #3 instead of being an idiot?","commenter_a":"Barstool--shut up and go try to figure out who your latest baby daddy is.","post_message":"She said, ‘Not everyone gets a trophy.’"},{"comment_id":"1281317941894705","commenter_b":"she is crazy in the head","commenter_a":"No","post_message":"So apparently everyone that doesn't support Hillary Clinton is just being juvenile, according to Streisand."},{"comment_id":"1050080195049016","commenter_b":"another dumb btch","commenter_a":"So Donald Trump you are not the savior we need for this country, I do not think you will bring jobs or prosperity when you do not even pay great wages for people that work for you. I think you are a disaster waiting to happen, you really belong in a reality series not president, I hope the people wake up before you end up our dictator","post_message":"ICYMI: Ivanka Trump took the stage in South Carolina and said, “My father is an incredibly hard worker and he’ll be working for each and every one of you.” (CC: Donald J. Trump, Sean Hannity)"},{"comment_id":"898473566912365","commenter_b":"@Patty Royer, please do not breed. America already has enough mouth breathing inbred idiots and you, madame, and I use that in it's professional sense, Are their Queen.","commenter_a":"And the Republicans encourage this kind of person.","post_message":"No surprise at all. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1005002076233312","commenter_b":"We do but not you please.","commenter_a":"She doesn't have a heart","post_message":"Do you agree with Hillary Clinton? #SCPrimary"}]
