[{"comment_id":"10152895452606051","commenter_b":"BANG! But since that didn't happen, \"drop the soap bitch.\"","commenter_a":"Coward!!! Thank God for good neighbors.","post_message":"This man grabbed a woman and began raping her. That's when a group of Good Samaritans heard her screams."},{"comment_id":"10153110276422550","commenter_b":"No she has make up in the first picture","commenter_a":"Two different people...","post_message":"\"If anyone needs a little motivation to not lay in the tanning bed and sun here ya go!\" A 27-year-old mother hopes her graphic selfies of painful skin cancer will serve as a warning for others. Her story --> @webpagelink"},{"comment_id":"10152587064680667","commenter_b":"Yes because white girls don't fight!","commenter_a":"maybe they should stop fighting #worldstar","post_message":"\"Like white girls, they face gender stereotypes. Like black boys, they face racial stereotypes.\""},{"comment_id":"1033963386626709","commenter_b":"Please Kathy. Just run the Pap strip over your big mouth. Infected!!!","commenter_a":"Trust me Kathy........Nobody want to see your Ugly......Except maybe KILLARY!!!!","post_message":"Another classy remark from Kathy Griffin."},{"comment_id":"10153664753098797","commenter_b":"Happy Birthday Glenn :)","commenter_a":"Happy birthday","post_message":"HEARTBREAKING AND HEARTWARMING: When Glenn turned 6, his mom threw him a big party. She invited 16 kids - but not one of them showed up.   Glenn was crushed. So his mom went on Facebook to vent. What happened next is absolutely incredible. See here - and wish Glenn a happy birthday in the comments section below:"},{"comment_id":"10154516919809575","commenter_b":"Actually yes it was.","commenter_a":"Full moon?","post_message":"Police are on scene investigating after they say 2 people were shot on the west side.   Six people have been shot since 8:30 p.m. Thursday."},{"comment_id":"456122197909407","commenter_b":"Evil beast","commenter_a":"And that black power flag of the black panthers.","post_message":"OKAY THEN..."}]
