[{"comment_id":"10155061325079575","commenter_b":"Why would he care about dapl? Obviously he has no intention of cleaning up the water issues in Flint, Michigan either. Because who cares about the people of this country and their wellbeing when you're Trump","commenter_a":"They dont want money it is about the water supply and the destruction of it!","post_message":"President Donald J. Trump signed executive actions to advance construction of the Keystone XL and Dakota Access oil pipelines. The projects had previously been blocked by the Obama administration due in part to environmental concerns."},{"comment_id":"10153503495739087","commenter_b":"Shut the fuck up bitch","commenter_a":"Bernie lost, give him money, make bernie feel better with money, Bernie wants peoples money. Trump came in second and didn't ask for a dime. Trump 2016!","post_message":"Bernie Sanders presidential campaign had its \"best day ever,\" raising $3 million since the Iowa caucuses on Monday -- most in the form of small online contributions, averaging about $27 each."},{"comment_id":"1013838895312830","commenter_b":"That's what girls get, cause they want to grow up fast n experience sex.... Don't blame the man... They r just man... Like a dog give him a bone n he would eat it no matter what...","commenter_a":"Sadly this happens a lot. My neighbors daughter was 14 with a 22 year old. Her parents knew. Let her go to the beach with him, let him stay the night ect.. then they broke up and he broke her heart. The parents put him jail. He now has to register as a sex offender for life. : (","post_message":"FUGITIVE WANTED: The Dickinson Police Department is looking for a 24-year-old man accused of sexually assaulting a 14-year-old. Authorities say they have been unable to locate Joshua Dwight Blair at his residence or last known place of employment. If you know any information about his whereabouts, you are asked to call police or Crime Stoppers. MORE ---> @webpagelink"},{"comment_id":"10154341575671729","commenter_b":"Not a charge will be brought against this bitch","commenter_a":"How much worse does it have to get? Will a corrupt government be able to bury all the evidence? If Hillary survives the latest, democracy is finished.","post_message":"The hits just keep on coming..."},{"comment_id":"600652730065515","commenter_b":"Christians are doing it now to homosexuals, in Uganda","commenter_a":"They are savages. Anyone who can cut off a person's head is cold blooded.","post_message":"Attention Liberals: The Koran is a Satanic Manifesto & Christianity is not as bad as Islam!"},{"comment_id":"10153714205856336","commenter_b":"First Ladies don't drive.","commenter_a":"Who in their right mind would ever think a Muslim would make a good President of the United States. No One would. This is such a bunch of crap. Liberals get over yourselves and your Gotcha BS. Can you even imagine the first lady in a Burka and not allowed to sit at the table with the men or drive a car or vote? Come on get real.","post_message":"“I’m not a politician, so I'm not going to be looking for the politically correct answer – I’m going to be looking for the truth.\" Dr. Ben Carson told Bill O'Reilly that he stands by his controversial comments that he would not advocate for a Muslim president. Watch the full interview: @webpagelink"},{"comment_id":"10154865700468256","commenter_b":"Aaaaaaannnnndddd just fortifying my position even more!! Lmfao!","commenter_a":"I sit back, a giggle my butt off at all these liberals grasping at straws to stop Donald Trump. Such hypocrites, because just 8 years ago when Obama was elected, they were so critical of the \"birther\" cries from conservatives...... I guess when your horse loses the race, you go chasing unicorns!!","post_message":"Pressure on members of the electoral college to select someone other than Donald Trump has grown dramatically - and noisily - in recent weeks, causing some to waver ahead of the Monday vote."}]
