[{"comment_id":"10153216973363855","commenter_b":"Good let the idiots divorce","commenter_a":"overinflated sense of their own importance much? idiots","post_message":"Here's to a speedy divorce!"},{"comment_id":"1382362188508980","commenter_b":"You ass dont belong on a road unless it has wheels on it who raised these nuts?","commenter_a":"Yes","post_message":"Liberal protesters are furious after a new bill introduced by a state lawmaker... here's why this could cause a lot more \"accidents\" when these lefties block highways.  Do you support this bill?"},{"comment_id":"1728076730757228","commenter_b":"The pathetic woman never smiled....good riddance!","commenter_a":"I am truly sorry that Carly dropped out. I do think you would make a great Vice President. Your knowledge and experience will go s long way. Thank you for throwing your hat in the game.","post_message":"BREAKING: Carly Fiorina is ending her bid for the Republican presidential nomination."},{"comment_id":"1701375029922619","commenter_b":"tough woman hiding behind a mask and hooded sweatshirt, hopes she wears that same outfit in prison","commenter_a":"Why are most democrats fat, stupid, and ugly","post_message":"Obama has allowed STUPID to take over this country...and it's putting American lives in danger!"},{"comment_id":"10153867165952144","commenter_b":"Obviously not Mike. If she belonged in jail, they'd have put her there.","commenter_a":"So instead of corrupt it's lazy, stupid, or incompetent...hardly QUALIFICATIONS.","post_message":"This is a really smart piece from David Corn."},{"comment_id":"1202477846449826","commenter_b":"Everyone must have nice hair & a nice outfit. Women have to put in more work Rich Nguyen","commenter_a":"You can pretty much say the same thing about men. If you come to an interview without a snazzy haircut or a fine tailored suit, I can bet that it becomes a disadvantage.","post_message":"Women shouldn't have to wear makeup to succeed at work."},{"comment_id":"697292770461301","commenter_b":"I hope you're right Jim!! God help us all if she gets in!!","commenter_a":"She is a major disgrace to the Democratic party. If she is all they got, Forget next year's election. They don't a chance in hell.","post_message":"FBI wants to take down Hillary Clinton after she is caught in huge act of espionage. She needs to be thrown in prison. We can't let her get away again. Do you think Hillary Clinton should be arrested?"}]
