[{"comment_id":"501298436725116","commenter_b":"Need more Americans like him . Hope he can beat all the charges . Muslims need to go back home !","commenter_a":"Not a hate crime","post_message":"A lesson he'll NEVER forget..."},{"comment_id":"10153215250940329","commenter_b":"You clearly don't live in the country.","commenter_a":"\" Why are your large pizzas the size of our personal pizzas?\" because we aren't a country full of fat fucks.","post_message":"Dear BuzzFeed Oz."},{"comment_id":"10153797502305779","commenter_b":"I wonder how people react to a naked hillary statue where you get to see that bitch in all her glory. Lol. Bet people would respond differently","commenter_a":"Gross!!!! The looks are uncanny!!!!!","post_message":"New naked Donald J. Trump statues appeared today, and now they're legal, backed by a mega-developer of their own."},{"comment_id":"505614509629101","commenter_b":"Kendra Alison and Edward Michael Davila. The story continues.....","commenter_a":"Alison Anderson! Ann DuBay!","post_message":"Announcing the news today, his attorney tweeted in all-caps: \"WE WON A NEW TRIAL FOR ADNAN SYED!!!\""},{"comment_id":"10156924916305405","commenter_b":"Kathy ugly woman inside and out. I don't talk to commie vermin!!","commenter_a":"Hillary will become president amidst your persistent digging. Republicans cannot even nominate a republican, the party is a total eclipse. Trump vs Hillary is a mono party.","post_message":"\"I have turned over all my emails…I have been incredibly open about doing that.\" Yet Clinton deleted more than 31,000 emails."},{"comment_id":"10153622148174497","commenter_b":"women can have some rights, just so long as they arent black mexican atheist homosexuals or anything.","commenter_a":"are men hogging up all of the rights again? come on guys... let the women have some of the rights.","post_message":"What is the path forward for women given the barriers to equality they face worldwide? The Onion explains women rights."},{"comment_id":"1807825672796282","commenter_b":"If he gets in please let him build that wall to protect our Canadian women and girls from him and His followers.","commenter_a":"This is what I commented on his \"apology\": You literally said: you grab women by the p----. You kiss them and don't even wait. That sir is sexual assault. You should be apologizing for your behavior not your words. And what about the 13 year old who accused you of rape? Your own wife accused you of rape as well and you shut her up in your divorce settlement. You sir are a disgusting misogynist and will say what you need to to deflect the attention from your personal flaws. You are projecting onto Clinton what you've done yourself. And this isn't about Bill Clinton. This is about who should be the next president, you or Hillary. Your past behavior is proof that you don't care about the women of this country, and Hillary has shown she does. Additionally, President Obama yesterday just signed a bipartisan bill that passed the ...","post_message":"For hours on Friday night, the political world waited for the rarest of expressions from Donald J. Trump — a heartfelt apology. What viewers got was anything but."}]
