[{"comment_id":"363905233797771","commenter_b":"Stupid wench. I hope her show and all of her movies bomb.","commenter_a":"And the answer to your question, YES. Oprah is a racist....","post_message":"Is Oprah a race-baiter?"},{"comment_id":"10157098525125354","commenter_b":"OR...build a wall to protect OUR country. Go back to Kenya - YOUR HOMELAND!","commenter_a":"Fuck him!","post_message":""},{"comment_id":"960942283946630","commenter_b":"and the worse thing is, women are doing the cutting. sick sick sick","commenter_a":"horrible","post_message":"Female genital mutilation is a human rights violation. And it happens way too often. - Laura Willard"},{"comment_id":"867378403371198","commenter_b":"Yes, women WILL vote for Trump!","commenter_a":"Mr. Trump, I was at the State Assembly wearing my red Trump \"Make America Great Again\" ball cap. People actually stopped me to tell me I am the first woman they have met who supports Trump. When people tell me that women won't vote Trump, I tell them \"intelligent women will\". Incredible.","post_message":"The people of Colorado had their vote taken away from them by the phony politicians. Biggest story in politics. This will not be allowed!"},{"comment_id":"10155047256148139","commenter_b":"Throw out the injunction & restore the ban","commenter_a":"this idiot can't even talk","post_message":"Listen: Oral arguments taking place regarding President Donald J. Trump's immigration executive order."},{"comment_id":"10154284439844749","commenter_b":"Women should lift each other up? Good luck lifting her up!","commenter_a":"Beauty comes in all shapes and sizes. Women should lift each other up, not let little girls tear each other down.","post_message":"\"When I tell people I'm a model, they look at me like I've said I've murdered someone.\""},{"comment_id":"1038422129567160","commenter_b":"What a POS !","commenter_a":"Go home to Canada and take hiller with you.","post_message":"CRUZ F*CKS CONSERVATIVES, VOTERS and TRUMP  @webpagelink"}]
