[{"comment_id":"10153270035730779","commenter_b":"Oh! And what about all those potential babies killed when wankers like you spill your seed onto barren ground?! #EverySpermIsSacred","commenter_a":"Forty million dead babies can't be wrong. An entire generatation of Americans has been murdered in the womb.","post_message":"Yes, Martin O'Malley, Bernie Sanders and Hillary Clinton are all pro-choice, but that isn't good enough. Simply promising to veto abortion restrictions passed by a Republican Congress isn't how we protect access to abortion, not when state legislatures are making it increasingly difficult for the most vulnerable women to get one. It's time debate moderators talked about it."},{"comment_id":"10152746962915950","commenter_b":"We get your point. She is NOT a man. Therefore she must be a Woman. Congratulations to her.","commenter_a":"She's not a female pilot, she's a Marine Corp Aviator! Semper Fi!","post_message":"Meet the first female pilot in the Navy's Blue Angels' 69-year history, Marine Corps Capt. Katie Higgins: @webpagelink"},{"comment_id":"483171531871140","commenter_b":"Amen","commenter_a":"Ya, Right. would never believe this bullshit!","post_message":"Shocking!"},{"comment_id":"1298762416842950","commenter_b":"Actually W paints pretty darn decent pictures.","commenter_a":"nobody expected Bush to paint like a 5th grader. Okay, yeah we did.","post_message":"Don't expect him to stay home and take up painting."},{"comment_id":"10153243710196523","commenter_b":"Give her ass the death penalty!!!!!","commenter_a":"Poor angel baby...rip. Your POS mother should now get the death penalty. Horrible!!!!!!!!","post_message":"A 33-year-old woman has been charged with murder in the death of her newborn baby girl after the child was allegedly thrown from the 7th floor window of an apartment building."},{"comment_id":"1669966499994538","commenter_b":"Dumb. Completely fucking dumb if you vote for her. Please, take her and leave the country.","commenter_a":"WHAT A WEB WE ARE WEAVING , A WOMAN CAN BE PRES. JUST NOT THIS LYING WOMAN,WHO COULD BE PROUD OF HILLARY FOR PRESIDENT.","post_message":"Michelle Obama got emotional when speaking at the Democratic National Convention, as she remarked that \"Because of Hillary Clinton, my daughters...take for granted that a woman can be president.\" @webpagelink"},{"comment_id":"10153421775308352","commenter_b":"oh you beat me to it....damn,are those tits real","commenter_a":"I'd raid her too, looking like that!","post_message":"Police raid pot club of Alaskan reporter who quit her job live on air to fight for legalized weed, after reports surfaced of illegal marijuana sales"}]
