[{"comment_id":"10152959292394753","commenter_b":"I don't think you can read lady. Either that or human compassion is lost on another bitter old woman.","commenter_a":"that is jus nasty to have sex with your stepdad","post_message":"North Las Vegas police are still investigating the rape and child abuse case. The law enforcement are continuing to review what they have a “three-generation case of child abuse” involving the teen rape victim’s mother, Kellie Cherie Phillips, 38, and the man she described as her stepdad, Jondrew Magil Lachaux, 39."},{"comment_id":"10154307174989411","commenter_b":"the reasons for building a wall are based on racism. Migrants dont steal jobs, dont increase crime, and create more wealth for everyone given the correct conditions. only reason to appose migration is fear of differences.","commenter_a":"Think the candidates suck? vote libertarian. check out Gary Johnson. Some socialists might not get it at first but its really the political party that represents the most freedom. Are you for gay marriage? so are libertarians. Are you for smoking weed? so are libertarians. Are you against foreign wars of aggression? so are libertarians. are you against corporate collusion with the government? so are libertarians. Are you against too big to fail banks? so are libertarians. hold on republicans, theres stuff for you too. Are you for lower taxes? so are libertarians. Are you for property rights? so are libertarians. Are you for a business owners right to deny service to whomever he pleases? so are libertarians. are you for gun rights? so are libertaria","post_message":"#DropOutHillary: 300,000+ tweets"},{"comment_id":"1563946600332130","commenter_b":"she says she all for kids but she can not hide the truth","commenter_a":"If a woman walks around spewing F!#K the way she does you damn sure don't want her to be president, hell I don't even want her as a friend","post_message":"This is the REAL Hillary Clinton, folks!"},{"comment_id":"880895332040553","commenter_b":"@username Didn't you get the memo? Pussy Liberals are NOT allowed to live in Texas... GET OUT","commenter_a":"Thank you @username for picking Mike Pence as you're running mate. Thank you thank you thank you God bless you both","post_message":"Mike Pence won big. We should all be proud of Mike!"},{"comment_id":"752518631516293","commenter_b":"AND YOU WANT AFRICAN-AMERICANS TO VOTE FOR TRUMP???? I PROBABLY TAUGHT YOU TO READ AND WRITE....LOL","commenter_a":"Who are you to say who is an american citizen? Were your parents born in AMERICA!....You defrauded all your workers to get rich!","post_message":"What I would do on my first day in office. #MakeAmericaGreatAgain  Text TRUMP to 88022 to join the #TrumpTrain"},{"comment_id":"1949462081947777","commenter_b":"Stupid bitch !!!!","commenter_a":"Just think, if Hillary wins, this stupidity will not only increase, but will be further validated by the government.","post_message":"This is what it has come to..."},{"comment_id":"10154378235307061","commenter_b":"ironic since even king himself thought malcolm x was a hack","commenter_a":"I am a white man, but it seems to me that Islam provided to Afro-Americans a system of faith and structure that Christianity failed to do. These people took names of Islamic heroes, rather than the surnames of their owners. Muhammad Ali took stature when he changed his name from Cassius (Roman name) Clay (ancestor white owner?). In America we stand up for who are and what we believe to be right.","post_message":"Malcolm X was killed on this day 52 years ago. @webpagelink"}]
