[{"comment_id":"1600782096895914","commenter_b":"Well yeah that's because she'd probably have a bomb, so...","commenter_a":"if she was wearing hejab, the story will definitely be different. meanwhile continue laughing.","post_message":"\"I've flown all over the world and I've been on lots of really long flights and I've never experienced anything like this,\" a passenger said"},{"comment_id":"964590076909747","commenter_b":"I wouldn't vote for that FAT SOB for dog catcher!!!!!!!!!!!!!!!!!","commenter_a":"Lol he can't control his staff with the George Washington bridge debacle and he wins the cnn award ? Lol notice they dident ask him about that...it was like always a trump bashing...I'm voting trump the media makes it easy for me to come to this conclusion","post_message":"It's official!"},{"comment_id":"10153976851960950","commenter_b":"Hillary husband, Bill Clinton, makes Bill Cosby look like a Saint.....","commenter_a":"Bring it baby. I used to feel sorry for Melania, but she is as bad as her bully pervert of a husband. All Trump cares about is his money. All Melania cares about is Trump's money.","post_message":"She is demanding a retraction and apology."},{"comment_id":"1371649186228159","commenter_b":"There's a Q now, what does that stand for?","commenter_a":"They absolutely deserved it. As a proud member of the LGBTQ+ community I am shocked at half of these comments. You show that crown off with pride honey because you really deserved it.","post_message":"Hateful backlash from jealous female classmates angry at being beaten by a 'boy'"},{"comment_id":"10154496192470329","commenter_b":"Jools pls","commenter_a":"@username u at ginger boy","post_message":"Are hand jobs back and better than butt stuff? Is this 9th grade? LET THESE TWEETS DECIDE."},{"comment_id":"820733274641888","commenter_b":"I'd piss on the ladies car. Put vaseline on her door handles lol","commenter_a":"Oh wow! That's...harsh. It's bad enough that poor girl is struggling like this but for the person who wrote that note to shove that into her face then rub it in? oh heck no! @username, please follow up on this report and let us know the results. This story has just gotten me so hot I could boil the water for my tea just by holding the kettle in my hands!","post_message":"NASTY NOTE: Ashley Brady is still struggling to get used to her life as an amputee. She finally got a handicapped parking spot at her apartment complex, but two days later she saw a car parked there. After leaving what she believed was a polite note, Ashley got this in return:"},{"comment_id":"10154257550106491","commenter_b":"Beyonce is racist scum","commenter_a":"Fuching nightmare.","post_message":"It's the ultimate playdate."}]
