[{"comment_id":"676191809238064","commenter_b":"I`ll say it agin, if the damn guns would stop shoten off there damn barrols!","commenter_a":"This father did not know his son was mentally ill and did not know his son was planning to commit mass murder with the dozen or so guns that unknown to this same father. This father is such a failure and out of touch with his son that his opinion doesn't count. He failed his son and now wants to put the blame some where else.","post_message":"The father of the shooter in Oregon just blamed guns for what happened. He must be out of his mind. This is a sick joke. Do you think his son is to blame?"},{"comment_id":"10155357191987439","commenter_b":"No thanks in representing the USA. Just another Linda Sarsour.","commenter_a":"Pretty sure this was found to be another muslim playing the victim","post_message":"Muhammad, a lifelong American citizen, claimed in an interview last week that she was detained \"just a few weeks ago\" by U.S. Customs and Border Protection agents. She said she was held for two hours without explanation."},{"comment_id":"1359888287387770","commenter_b":"Stupid silly bitches","commenter_a":"And this is who women follow?","post_message":"SADLY, LIBERALS ARE TOO STUPID TO REALIZE WHAT THIS SIGNAL MEANS!"},{"comment_id":"10153055349059170","commenter_b":"Nah he's not Indian. Fake birth certificate. He wants his muslim army to overtake America.","commenter_a":"Bobby has it right. He's a great Patriot. Would make a great president.","post_message":"To those who want to silence talk of God - because they're afraid of how it will affect election outcomes - reconsider your priorities. Looks like Bobby Jindal has this right. (And in no way did he mean what is critic here thinks he meant.)"},{"comment_id":"1680942268839646","commenter_b":"@username..you're a fucking racist bitch!","commenter_a":"I would like to see in the White House, a president with love for this country. Hasn't been one there for over 7 years now.","post_message":"Would you like to see these two move in to the White House next January?"},{"comment_id":"10152604672427894","commenter_b":"I bet the beautiful lupita will be married before her silly ass will ever be...hell Walter didn't want her .","commenter_a":"Kenya need to stfu with her stupid ass","post_message":"Kenya Moore Shades Lupita Nyong'o Over Golden Globes Photo Snub: 'Girl Bye'"},{"comment_id":"1703634343208850","commenter_b":"Demo's must be high on something, another unquaified and under accomplished democrat running for the highest office in the land. Jail is where she belongs.","commenter_a":"Clinton should be in jail!!!!","post_message":"Sen. Jeanne Shaheen says there's no question Hillary Clinton is the most qualified candidate in the presidential race. Would you like to see Clinton become America's next president?"}]
