[{"comment_id":"606850699417060","commenter_b":"What a pussy","commenter_a":"Remember these Libatards,I never forget !","post_message":"List Of 31 Democrats Who Will Be Giving Netanyahu The Middle Finger, SKIPPING His Speech ⋆ UFP NEWS... @webpagelink"},{"comment_id":"10154235366227060","commenter_b":"Yea and Mardi Gras day they'll be showing their breasts for beads!!!","commenter_a":"Yall be safe.....show them","post_message":"The Women's March New Orleans begins now from Washington Square Park."},{"comment_id":"1006130662760739","commenter_b":"And that White women take full advantage of affirmative action every day, it's not just for black people","commenter_a":"Does he ever need a history lesson. Start with 'When Affirmative Action Was White,' and 'The Half Has Never Been Told,' to start.","post_message":"The famous actress' brother brags about manipulating affirmative action policies to get into medical school."},{"comment_id":"1728684567380415","commenter_b":"#NotMeUs hillary just want your vote so she can work hard for the rich people!","commenter_a":"Please exit out of video , share the post by clicking SHARE button on bottom right. Come back and join us❤️","post_message":"Bernie Sanders rally in Pittsburgh: Part I"},{"comment_id":"1334018773303346","commenter_b":"Lol you need to work a lot harder to be crowded like India or China😂😂😂 but real talk tho, the US is currently taking up way too much resources for it's population. And if this population spikes, there are gonna be some shortages and wars...","commenter_a":"I am against both an my reason is. That our country isn't growing by size but we keep letting in millions every year one day this country will be over crowded like India or China","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153835379166336","commenter_b":"Cause white people suck","commenter_a":"That door was racist against white people! Ban all cruise ships and doors.","post_message":"A jury has awarded a man $21.5 million in damages after he was hit by a sliding door on a cruise ship.   MORE: @webpagelink"},{"comment_id":"10154397725896509","commenter_b":"She should teach her son how to respect women","commenter_a":"Cold Autumnbreeze","post_message":"Sarah Palin speaking at a Donald J. Trump event: 'We need to elect a commander in chief who will respect our troops... you realize that our vets deserve a commander in chief who will let them do their job and go kick ISIS ass.' @webpagelink"}]
