[{"comment_id":"374960556025572","commenter_b":"You want to live in America and enjoy all our Country has to offer! Take off your scarf.","commenter_a":"Yes","post_message":"Should head scarfs be banned in America?"},{"comment_id":"1594655060832823","commenter_b":"Put her out there in the line of duty unarmed and we'll see how fast her mind changes!!!!!!!","commenter_a":"Impressive stupidity","post_message":"SHE'S INSANE!!! There's no GREATER Threat to America than these liberals who believe our Military, Guns and Police Officers are Dangerous! Lets get 5000 SHARES if you think these people dont DESERVE the freedom our military provides them!"},{"comment_id":"908796952508643","commenter_b":"@username, I think the big difference is that a brain dead person has NO CHANCE of neurological recovery. The same cannot be said for the vast majority of fetuses. A young fetus does have brain waves, does have a heart beat, and if left alone, an excellent chance of normal neurological function. We certainly would not be discontinuing life support in this situation on an older person.","commenter_a":"Women already have more access to healthcare than men. Show me a government funded chain of facilities specifically there for prostate cancer treatment. At any rate, cutting a living human out of a woman's body isn't healthcare and the living child certainly doesn't have a choice to be murdered or not during an abortion.","post_message":"When you tell a woman that she cannot control her own body, that’s extremism. Let's say it loud and clear: women control their bodies, not the government."},{"comment_id":"1557909130909006","commenter_b":"Go watch FOX bitch...","commenter_a":"Because guns cure racism and misogyny. Vice you are officially the retarded wing of journalism.","post_message":"What radical black womanist politics organized around self-defense actually looks like, and why it matters."},{"comment_id":"1145897778760904","commenter_b":"I have the same solution no matter the skin color......shot them, protect the population from killers.","commenter_a":"Throw him in a cell with a bunch of big angry sex offenders.","post_message":""},{"comment_id":"380847572097124","commenter_b":"This piss-ant compared himself to MLK!!! That's their mentality; he's blinded by hate. Typical rightwing idiocy!","commenter_a":"Idiot.","post_message":"Today is not the day for this nonsense."},{"comment_id":"1143828785650872","commenter_b":"Funny how they show all this stuff because its TRUMP...I am sure that there was stuff like this when Obama was running oh ya it has been bad for 7 years since he has been President...GROW UP PEOPLE...you are making bad examples for our future kids...","commenter_a":"Common sense: Using seat belts, texting and driving, drinking, smoking, walking in traffic....should I go on? You are responsible for your actions, not some politician!!!!!!!!! WAKE UP AMERICA......","post_message":"This protester was sucker-punched and kicked by a Trump supporter as he was escorted out of yesterday's rally in Arizona. You have to see the video of the violent confrontation."}]
