[{"comment_id":"880910168618891","commenter_b":"Martial Law.... never heard of her. Lol. 2nd revolution needs to take off","commenter_a":"Rising up with guns will only give them what they want or need to bring down the hammer of martial law","post_message":"In case you missed it, here's our top story from Monday: It’s clear that if the U.S. is to restore human liberty and return to the Federalist system created by the Founders and since destroyed by Abraham Lincoln, the Federal Reserve Act, the 16th and 17th Amendments and an activist Supreme Court that abused the 14th Amendment, one step — and probably the first step — must be to repeal the 17th Amendment. Repealing the 17th Amendment would take the money out of Senate elections on the federal level. Senators would be beholden to their state legislatures again rather than the corporatist class that lines their pockets, finances their re-election campaigns and ensures them seven-figure lobbying gigs once their time in “public service” ends. Senators would not act against their states, as 12 senators from 10 states are currently doing in regard to President Barack Obama’s executive action on amnesty for illegals. @webpagelink"},{"comment_id":"10153242127461680","commenter_b":"Divided Nation? You people talk about a divided Nation? Kids are being harrassed at school for \"appearing\" to be Muslim, some are Indians. Muslim's are of every nationality and not just middle eastern. Donald Trump has created HATE amongst people of a brown tone. That's more than 3/4 of the Nation. You people are scum that support Trump. American Mexican's are being mis-treated too. I guarantee you that Donald Trump will turn this country 3rd world with his talk of our \"wages are too high\" and \"we must COMPETE with wages of Mexico, Japan and China\". YES, he is a 'business man\" and that's why HE sent his own manufacturing jobs out of the U.S. Think, people, think.","commenter_a":"I find it hilarious when Obama is blamed by Republicans for everything under the sun, but now he's being blamed for helping create Donald Trump. That's a stretch, even by Jeb Bush standards. This country has had a bitter partisan divide ever since Republicans decided they weren't going to allow a Democrat to be successful way back in 1992.","post_message":"Not only is Donald Trump a “jerk” in the eyes of Republican presidential candidate Jeb Bush, but he’s also “a creature of Barack Obama.”"},{"comment_id":"10153197145938721","commenter_b":"My Eulogy: @webpagelink","commenter_a":"Welcome HTML5 banners.","post_message":"With Google putting the brakes on Flash in Chromethe world most popular web browseradvertisers will need to seek other ways to get their messages out."},{"comment_id":"10153775043868984","commenter_b":"They are monster","commenter_a":"Go Trump/Cruz","post_message":"Barack Obama may be trying to act like a humanitarian by letting in 10,000 Muslim refugees from Syria. However, what the media isn't reporting on is who Obama is kicking OUT of the country... When America finds out just who he's deporting, they're going to be FURIOUS."},{"comment_id":"539209459602967","commenter_b":"why is everybody bendind over backwards for the muslims what about us true blue white americans everythingis for the forenners","commenter_a":"I dont understand why muslims are even here to begin with. Do they really think they are going to come to america and take our country? Good luck with that is all i have to say. They need to go back to their own country and worry about their own people and keep their crazy Godless religion to themselves. WE'RE NOT INTERESTED AND WE DONT CARE!","post_message":"Burger King just bowed to Muslims in this sickening way.  This is such a joke. They just lost our business forever.  Will you support Burger King after finding this out?"},{"comment_id":"1146551715438403","commenter_b":"@username Why did you just not turn over your emails Hillary? Why are they finding them now on Huma's deranged husband's shared lap top? Extremely Negligent come to mind? You forgot to Bleachbit and smash this one!","commenter_a":"What's Huma and Anthony's plan? Soon as the election's over get back together?","post_message":"“The Director owes it to the American people to immediately provide the full details of what he is now examining.\""},{"comment_id":"10153307059689714","commenter_b":"Women are bad","commenter_a":"Girls at my school were not allowed to wear just leggings either.. I'm not scratching my head..don't really understand why this is a viral story..?","post_message":"Scratching our heads"}]
