[{"comment_id":"10157024443115354","commenter_b":"But you'll let your politicians scrub the term \"illegal alien\" from your laws!!! Just another step towards amnesty!!!","commenter_a":"We began a WRITE IN campaign for Donald Trump in Colorado. We will show America we can not only Recall Libtard Legislator's who go after our Gun Rights, we will also go after Fascists hidden in the GOP.","post_message":"Colorado Republicans OUTRAGED..."},{"comment_id":"10155026863931509","commenter_b":"she doesnt look that bad for a transgender","commenter_a":"What a beautiful woman our first lady is.","post_message":"First families join hands for a rendition of \"The Battle Hymn of the Republic\" during memorial for slain Dallas officers. @webpagelink"},{"comment_id":"10155239406179199","commenter_b":"Wow, you're an a**h**e","commenter_a":"I bet you they're trump supporters.. them","post_message":" still a person, you should still treat me with respect."},{"comment_id":"853718148092962","commenter_b":"Hope she goes to prison.","commenter_a":"She should pay it back and go to jail","post_message":"So long, farewell..."},{"comment_id":"10153007861084753","commenter_b":"Get a job!!!!!!!!!!!!!!!!!!!!!!!lazy bitch","commenter_a":"that is so wrong on so many levels","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"10153570566941509","commenter_b":"Yes....and take alcohol off the market...","commenter_a":"medical pot SHOULD be legal for those who need it!","post_message":"Do you agree or disagree? Dr. Sanjay Gupta explains why it's time for a medical marijuna revolution on CNN Opinion: @webpagelink"},{"comment_id":"10153277843683352","commenter_b":"LMFAOOOOOOO black women stay losing","commenter_a":"Nothing is wrong with being ghetto and loud, you just gotta know when to show it!","post_message":"LADIES IF YOU'RE ALONE OR WITH A SORRY MAN! HERE'S WHY‼️‼️ #VALENTINES"}]
