[{"comment_id":"10153737001138812","commenter_b":"This lady is still working there??????????????","commenter_a":"why not go ask a Muslim cleric to marry them get married in a mosque","post_message":"Another gay Kentucky couple denied marriage license by controversial clerk: @webpagelink"},{"comment_id":"475959349195637","commenter_b":"@username BITTER GAY HATER!!!","commenter_a":"@username 2016!","post_message":"Tony Perkins Rallying Iowans for Ted Cruz: @webpagelink"},{"comment_id":"10152699530401051","commenter_b":"This brittany chick needs her head examined.","commenter_a":"He was born male, he died male. No matter what he felt,","post_message":"These parents faced nonstop criticism after their teen committed suicide by walking in front of a tractor trailer. Now they’re speaking out."},{"comment_id":"10152954398027452","commenter_b":"Feminists sure do preach equality until it comes to self-defense.","commenter_a":"The biker needs to be commended on how well he held his composure after being punched more than once by an older man. That Football player that punched a girl needs to take lessons from this guy.","post_message":"Motorcycle meltdown! A driver goes berserk after he says he was cut off by a biker. But what happens next escalates the situation to a dangerous new level that ends in a medical emergency. @webpagelink Is \"driver vs. biker\" road rage getting worse? The confrontation caught on camera. Tonight at 11 from ABC7 Eyewitness News."},{"comment_id":"1023824300991761","commenter_b":"Women's loos can be more festy","commenter_a":"My bathroom in my house is open to anyone who can flush. Unisex bathrooms would end this issue","post_message":"In case you missed it: Trans people need to use the restroom just like anyone else. Why do some people have to make such a big deal about it?"},{"comment_id":"10152734752671051","commenter_b":"Unbelievable! some women should not children and she is one. Discipline begins at home.","commenter_a":"Needs a good ole fashion spankin.","post_message":"This 11-year-old boy is responsible for a fifth of the crime in his town – and his mother knows exactly who to blame for that."},{"comment_id":"1341308765907356","commenter_b":"Al Franken was a terrible comedian and an even worse senator. What a worthless piece of crap!","commenter_a":"Ouch!","post_message":"Stuart Smalley never had a chance."}]
