[{"comment_id":"10153941098352439","commenter_b":"pigs.","commenter_a":"Simple solution. Send them back home where they can pound sand. Better still, why doesnt even one affluent opulent oil rich middle eastern lingdpm take thrm in? Why not? Hypocracy. In Abu Dabi that even have free good stugfs gor those that don't have....","post_message":"In the wake of jihad slaughter, Western leaders and media elites hand-wring and rail over \"fear of reprisals\" against Muslims and islamofauxbia - myths to distract and defend the Islamic faith. When, in fact, it is antisemitic incidents that are at record levels. Anti-Jewish attacks are daily now. No one says anything about that because it is largely Islamic Jew-hatred. Respect it."},{"comment_id":"10153683499520530","commenter_b":"Whore","commenter_a":"DA FAQ??!!! Dump this girl she has no self respect .....she's probably screwing him behind his back","post_message":"He decked the guy after he touched his girlfriend's rear end several times. Now she's upset and wants him to apologize."},{"comment_id":"10156653866510725","commenter_b":"Has anyone seen the documentary \"Cartel Land\" available on Netflix? Serious people we need an individual to build that wall. The Mexican/So.American border needs to be secure. We need Trump!!!","commenter_a":"#makeamericagreatagain","post_message":"GOOD MORNING! Put me to work for America- and I assure you that WE will MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"953925358000546","commenter_b":"^^see Lisa....THAT'S good parenting.","commenter_a":"Thats messed up. what if the kid is actually struggling in school ? The dad should help him with homework and take his xbox away TEMPORARILY and see whats the kids real issue.","post_message":"This is a warning to all Xbox-playing students — do your homework!!!"},{"comment_id":"10155073600242235","commenter_b":"Quit covering the bitch. Your continued coverage is not news, it is for personal gain. How long can one beat a dog?","commenter_a":"NO THANKS!","post_message":"There's only one reason why she wouldn't be reprimanded..."},{"comment_id":"378965758958385","commenter_b":"We need to start deporting all Muslims in this country. Or bedick them so they don't reproduce.","commenter_a":"DEPORT THEM ALL!!","post_message":"Norway started deporting radical Muslims by the thousands, then they saw something dramatic happen..."},{"comment_id":"10153196584554091","commenter_b":"Go marry donkey who cares","commenter_a":"As a Christian..I feel she's out of order...do your job!...and let God deal with anything else.","post_message":"She told the couples and activists that her office is continuing to deny the licenses \"under God's authority.\""}]
