[{"comment_id":"997888900251582","commenter_b":"this lady is crazzy.","commenter_a":"The Amerikan Taliban.","post_message":"Hey you! You should go to church every Sunday! And the government should require it. Because America and morals and stuff."},{"comment_id":"1722289054713180","commenter_b":"notice how she talks about white man?","commenter_a":"'@username Former foreign minister , has failed in its mission and has caused much of the confusion the US administration @username was not calling things by their names correct .. for example, terrorist organizations ( liberation movements ) , states that support extremism ( our friends ) , dictatorships ( our partners ) @username win means that a disaster occur American nation","post_message":"Women across the country lose out on every paycheck—and women of color feel it the most. Our families can’t wait: It’s time to ensure equal pay for women. hrc.io/EqualPayDay #EqualPayDay"},{"comment_id":"1165586973515562","commenter_b":"ABSOLUTLY","commenter_a":"Why not keep an open mind ( and a closed mouth) until the evidence is in?","post_message":"Attorneys for the family of Keith Lamont Scott hold a news conference."},{"comment_id":"10155013986101162","commenter_b":"Lmfao!!","commenter_a":"'@username just because I saw your shopaholic post lol","post_message":"LATE PACKAGES: Amazon may experience some holiday turbulence in its shipping due to a contract dispute with pilots..: @webpagelink"},{"comment_id":"10158335910850389","commenter_b":"California LARGEST INSANE ASYLUM IN THE WORLD Written by Chuck Garner on January 23, 2017 6:00 am - Interesting that the LA Times did this. Lou Dobbs reported this on CNN and it cost him his job. The only network we would see this on would be FOX. All the others are staying away from it. Whether you are a Democrat or Republican, this should be of great interest to you! Just One State be sure and read the last part try for 3 times. This is only one State If this doesn open your eyes, nothing will! From the L.A. Times. 1. 40% of all workers in LA County (10.2 million people) are working for cash; and not paying taxes. This is because they are predominantly illegal immigrants, working without a green card. (Donald Trump was right) 2. 95% of warrants for murder in Los Angeles are for illegal ...","commenter_a":"'Alternative President Donald J. Trump' you've been in the The White House only a week and already you're a total failure and made a complete fool of yourself so no wonder you LOST the popular vote and had such a SMALL crowd at your inauguration....by the way Mr. Alternative President you are delusional and need mental health treatment so please get some professional help before your words or actions are responsible for killing people....","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153569786727522","commenter_b":"What do American soldiers have to do with restriction of future immigrants?","commenter_a":"Barbara Bell","post_message":"'When you question a mother's pain...you are attacking us.'"},{"comment_id":"10153181393497377","commenter_b":"Putin gives you a hard on? What's that say about you?","commenter_a":"Yah , They cant hide from the Russians is what he ment .","post_message":"Obama to ISIS Leaders: 'You Cannot Hide'"}]
