[{"comment_id":"1018537924833053","commenter_b":"Teenage girls are creating life inside them all the time. Seems pretty easy to me. The quote is about the creation, not the maintenence of said life, so I'll leave it at that.","commenter_a":"Creating a life is actually one of the easiest, most instinctual acts all mammals share... It's not difficult at all. Properly caring for one is something else entirely.","post_message":"Wise words from Robyn Lawley: 'You created a life inside of you, that's no easy feat.'  (via HuffPost Canada Parents)"},{"comment_id":"10154845355999705","commenter_b":"Omg this is perfect","commenter_a":"'@username lolol we need one","post_message":"Someone reverse engineered the umbrella - and it totally works."},{"comment_id":"10153619254387439","commenter_b":"You stupid son of a bitch. She will never do a day in jail. Dream on asshole.","commenter_a":"FBI didn't seize a fucking thing, they were voluntarily turned over to the FBI and justice department. Geller is a rotten crotched liar.","post_message":"// google_ad_client = 'ca-pub-@username'; google_ad_slot = '@username'; google_ad_width = 336; google_ad_height = 280; // ]]> // // ]]> Hillary is such a tool for jihad and a knave to her lover pal Huma Abedin, I don t care how this destroyer gets her comeuppance, as long as she does. Like Capone and tax evasion charges. It was hardly the worst of what he did, but it got him put away. She should be sitting in prison for Benghazi, but if this is the best we can do, so be it. Although I hardly trust the DoJ. WASHINGTON As pressure builds on Hillary Clinton to explain her official use of personal email while serving as secretary of state, she faced new complications Tuesday. It was disclosed her top aides are being drawn into a burgeoning federal inquiry and that two emails on her private account have been classified as “Top Secret.” The inspector general for the Intelligence Community notified senior members of Congress that two of four classified emails discovered on the se"},{"comment_id":"10153765437796336","commenter_b":"Then stop bringing in hundreds of thousands of illegals, then bring the jobs back to America.","commenter_a":"I agree, put people back to work and stop giving them freebees from the Government. Make them responsible for their own lives.","post_message":"Billionaire Charles Koch joined 'The Kelly File' tonight for a rare interview, and said progress will depend on the American people understanding what is fair and what makes their lives better."},{"comment_id":"10152896825378635","commenter_b":"What cowards!!! Five against i woman!! Day of judgement belongs to the Father' Animals!!! There will be no rest , or prizes , at end of life for you .. How C an you be so dumb!!!! .so so evil ... Under the control of satan, and do not even know it!!!","commenter_a":"There are bad people in every religion.","post_message":"'The five Muslims took hold of me, and they raped me there,' the church source quoted the daughter as saying. 'I tried to scream, but they threatened to kill me. One of them said, 'Your father should stop this prayer meeting of trying to change Muslims to become Christians and close the church building — we have warned him several times.''"},{"comment_id":"1650724908525555","commenter_b":"Let's see, she and Obama, on one hand, want to take our guns, and on the other hand, want open borders of illegal aliens and possible terrorists to enter the Country. They are aiming to make all of America a soft target. Whose side are they on, anyway? Never mind, I think we know. Vote out all liberal, progressive, Democrats. Obviously, they are mentally ill.","commenter_a":"Gun control my a$$ - We ALL need to be armed!","post_message":"Wasting no time..."},{"comment_id":"1729830760638535","commenter_b":"Stfu dumb niggabitch.. let's see you come up with some rhymes.","commenter_a":"That was shit, idk what you people are thinking sometimes 😂","post_message":"That lie really hurt tho"}]
