[{"comment_id":"10153329525229203","commenter_b":"It's called Sharia Law and it's practiced in Muslim Country's where Women are considered worthless property.","commenter_a":"Alexis A Massey","post_message":"In Nigeria, violence a husband for the purpose of correcting his wife is considered lawful."},{"comment_id":"10153223668067994","commenter_b":"Good. Now I bet she gets the hell out of here and never comes back! So embarrassing!","commenter_a":"Yay!!!!!!!!!","post_message":"Good news!"},{"comment_id":"939636916071768","commenter_b":"She's a whore? @username you are a crude, ignorant troll.","commenter_a":"The first real scientific post-debate poll results are out and they are great news for Hillary Clinton. According to the just released Huffington Post/YouGov poll, 55% say Clinton won the debate as compared to just 22% who said Sanders did. Furthermore, 52% in the national poll now say they want Clinton to be the nominee, up from 44% prior to the debate. All in all, a great result that matches the media's assessment of who won the debate, our next President, Hillary Clinton!","post_message":"Larry David is Bernie Sanders."},{"comment_id":"788324967967350","commenter_b":"When all is over and you. Round up the clowns for arrest make sure you get this bimbo she cared nothing about any of us","commenter_a":"I agree idiocy speaks for itself.","post_message":"I can't believe this.....I knew they were stupid but stupid and dangerous?!? COME ON."},{"comment_id":"1005484162805096","commenter_b":"That only applies to people who follow invisible friends.","commenter_a":"With all due respect I won't be taking advise from any Catholic leader when it comes to kids and sex. Religion does not, ever dictate what I do or my children do with their bodies.","post_message":"\"While the vaccination program is not inherently wrong, parents need to make an informed decision and communicate it in a way that can serve to strengthen their child in the virtue of chastity and reinforce her appreciation of abstinence as the only truly healthy choice.''"},{"comment_id":"10153572562143645","commenter_b":"the woman must have a strong heart...I would have had a heart attack and expired right then and there!!","commenter_a":"I would have been spooked","post_message":"This furry creature gave an elderly woman a rude awakening when she found it curled up on her chest."},{"comment_id":"10152998620161770","commenter_b":"She is a liar and cheat .","commenter_a":"That's because thousands of us protested on how the media thinks they can determine who they want on stage and trying to push there own agenda.. This was the absolute right decision on CNN behalf.. Remember CNN, ABC, fox, and the rest of the media scum that keeps trying make decisions on who can and can't be in any presidential debate.. All candidates should be allowed on stage..","post_message":"Carly Fiorina will join the other GOP candidates on CNN's debate stage."}]
