[{"comment_id":"657334997759787","commenter_b":"The key is this. Why was he walking away from the officer with his hands up? Then going for the door of his vehicle. Also they dispatched a helicopter to the scene well prior to the shooting. There is way more than the media is showing.","commenter_a":"Cop should get the chair for this shit","post_message":"In a video, an unarmed man is seen walking with his hands up. Moments later, a police officer shoots him."},{"comment_id":"543511749143213","commenter_b":"@username hell don't exist kid you will rot just like eveyone else when you die and are burried","commenter_a":"we aren't animals anymore we used our intelligence to go beyond that, why would we want to back track? I wouldn't want my kids seeing them sexual or not. Or my husband sexual or not. No matter how much we try to \"not sexualize\" them, they always will be and there will be women and men who will sexualize them. It's not hard to leave a fucking shirt on","post_message":"Women everywhere are freeing the nipple  but Facebook doesn't want us to show it. #MicCheckDaily"},{"comment_id":"10155049282976729","commenter_b":"She is totally delusional","commenter_a":"Anyone else notice that everything killary is guilty of, she and her supporters blame on Trump? She smashes cell phones with a hammer, but Trump has a bad temper? She will raise taxes on the middle class, but people say Trump will? He never said that, yet people say he will. You give people a video link to hear someone say what you heard him/her say, people come back saying snopes says it has been altered ... Liberalism is a disease, a mental one.","post_message":"You definitely won't see this on the mainstream media..."},{"comment_id":"10152889447368837","commenter_b":"How about sending your black people to Africa forever ever, so they don't rob, kill , root and continue destroying this country!","commenter_a":"Since the US is working with Cuba, the government needs to eliminate the wet foot dry foot policy. Make sure any Cuban who comes here get citizenship so they can pay taxes versus living here off the grid and sending monies home to screw up the Social Security, retirement and Medicare funded programs built for Americans in this country. Black White Hispanic Asian Haitian alike.","post_message":"Dangerous Voyage."},{"comment_id":"885881534804929","commenter_b":"That what she said.","commenter_a":"Her neck looks like huge lips.","post_message":"She shared explicit messages and pictures with pupil after the schoolgirl came out to her"},{"comment_id":"853572084739045","commenter_b":"Lol! Wow!","commenter_a":"I agrees with the Judge! Come here by the proper channels! WTH","post_message":"Here's a breakdown of what the immigration ruling means."},{"comment_id":"10153744436512894","commenter_b":"Her weaves be the worst. .lol","commenter_a":"Wish them all blessing in life , hope God,s in the equation","post_message":"Pregnant Blac Chyna Goes Glam to Film Upcoming Reality TV Show -- See Her Latest Look!"}]
