[{"comment_id":"1190989584254403","commenter_b":"Abortion is legal in this country. If you have to murder physicians who perform a legal medical procedure, heavily edit videos to try to discredit an organization that is doing nothing illegal and burn down their clinics, then who is really the violent killers and terrorists here? All in the name of Christianity? Not my Christianity certainly. Reminds me of the middle east, however. Islamic terrorists/Christian terrorists. There is no difference when you cross the line into violence.","commenter_a":"Damm","post_message":"'It's deeply disappointing that we still see the kind of hateful rhetoric in our state that fuels this kind of violence.'"},{"comment_id":"1680894471939506","commenter_b":"Other people need jobs. Quit and you don't draw unemployment. Saves tax payers some money","commenter_a":"Which means 28% of our 'public sector servants' are actually partisan political hacks. Liberals embedded like ticks. About right.","post_message":"I hope they're mostly from the IRS."},{"comment_id":"462218217236106","commenter_b":"Transgender? It's a Guy who wears girl shit. That's no Transo, that's a stupid crossdresser who can't tell the difference between a P and a V. Sheesh! This country is Fucked up on this stupidass politically-correct bullshit. Wipe the makeup off and take the wig off or you'll get that shit Scraped off and that wig Split by angry parents and/or boyfriends.","commenter_a":"LET ME FIND OUT MY DAUGHTER, GRANDDAUGHTER HAD THIS FREAK WALK INTO THE SAME RESTROOM WITH THEM AND FOUND OUT THE SCHOOL OKed IT I`M GOING TO OWN A BIG PART OF THAT SCHOOL SYSTEM! THIS FREAK IS A MALE AND ALWAYS WILL BE ONE, HE HAS MALE DNA, MALE GENES MALE FINGER PRINTS A MALES RIB CAGE AND MALE PLUMBING NO SUCH THING AS A TRANS GENDER! THIS FREAK NEEDS TO STOP PLAYING DRESS UP AND PRETEND! HE MAY GET MORE THAN HE`S LOOKING FOR BY SOME DAUGHTERS DAD!","post_message":"girls have rights, and they shouldn have to share a bathroom with a boy, said a parent. See how this transgender student is causing a firestorm in a Missouri high school."},{"comment_id":"10153235359857093","commenter_b":"Same procedure as a mandatory hurricane evac. Some people just have to cause issues tho","commenter_a":"Are they going to arrest people who do? It's interesting that the homeowners aren't allowed to determine if their own home is safe.","post_message":"The Garland Police Department is asking those people who are able to remain safely sheltered in their homes to do so.  Residents who leave the damaged area will not be allowed to return until it is deemed safe.  Officials are working to identify and secure any possible utility hazards such as gas leaks and downed power lines."},{"comment_id":"10153902979083812","commenter_b":"Then please answer the dreams of the other 49 states and build that wall around Texas and secede.","commenter_a":"Texas? Secede already will you?","post_message":"JUST IN: Texas Governor Greg Abbott joins the governors of Alabama and Michigan in saying his state will not accept any Syrian refugees in the wake of #ParisAttacks. @webpagelink"},{"comment_id":"10154428914569411","commenter_b":"What refugee crisis? These invaders are not refugees.","commenter_a":"I have never seen such inhumanity as I have seen in the west where personal freedoms are more important than justice and what is right. The REFUGEE crisis is just the latest example of this.","post_message":"'Our chancellor has given up the sovereignty of the country, she has given up our borders, she has given up our rules and regulations'"},{"comment_id":"10155404050665492","commenter_b":"Your entitled to carry your personal property anywhere you want . Just put it away when you spot the vermin .","commenter_a":"Having your phone in hand is tantamount to having wad of cash in hand.","post_message":"The subway rider was also punched in the face."}]
