[{"comment_id":"1063108630412332","commenter_b":"Hillary is such a flipflopper!","commenter_a":"If the War in Iraq made your family safer, Hillary is your candidate. If the USA PATRIOT Act secured your family, then Hillary is your candidate. If your family reaps the benefits of institutionalized racism in our justice system, then Hillary is your candidate. If you want more expensive healthcare, vote Hillary. Mine is currently $475/month (compared to my $25/month car insurance from Insurance Panda, or my $10/month dental insurance, but I digress). Hillary is in bed with big pharma, she is your candidate. If you want to vote democrat, but still want to bomb Iran, then Hillary is your candidate. If you really benefitted from the Housing crisis or from Monsanto bankrupting small farmers or Big Pharma price gouging the sick, then @username is your candidate","post_message":"“It’s not just that she’s done her homework—Mrs. Clinton has done her homework on pretty much any subject you’d care to name.”"},{"comment_id":"1644362728922565","commenter_b":"But haven't you heard....those votes are all from dead illegals","commenter_a":"Electoral College must do the right thing and prevent Trump becoming president. Now 2.5 million more people voted for Clinton than Trump!","post_message":"Were you wondering why Trump talked to Taiwanese President?"},{"comment_id":"10153155003323812","commenter_b":"Dip out? Only women bleed.","commenter_a":"\"Hardest moment of her life\" it was pretty easy for her to dip out before this story got national attention though wasnt it?","post_message":"UPDATE: Mom calls decision to give up newborn with Down syndrome \"hardest moment\" of her life: @webpagelink"},{"comment_id":"10153876150456680","commenter_b":"Libs can't ubderstand acting in legal ways. No wonder they so adore ILLEGAL aliens.","commenter_a":"About the taxes. Trump did nothing outside the law. So he really is a genius. He employed tens of thousands of people and according the the law, he paid the required taxes. Now the democrats are mad that Trump complied with business laws set by Democratic governments and utilized these laws properly? A bunch of hypocrites. #TrumpPence2016","post_message":"“Almost everybody else is getting poorer.  And yet billionaires like Donald Trump are able to manipulate the tax system so that they avoid paying federal income tax,” Bernie Sanders said."},{"comment_id":"10153816577949160","commenter_b":"You believed that nonsense? Sue glad Donald never cheated at anything.","commenter_a":"When can we not have to listen to lying cheating Teds shrill voice cry over everything. Ted cheated on his wife then lied about it.","post_message":"Donald J. Trump just won Indiana. Here's what that means.  READ MORE: @webpagelink"},{"comment_id":"10154826896060530","commenter_b":"One more time","commenter_a":"Trump won! Get over it! Hillary lost 2 elections and she accepted the loss once she called trump and congratulated him on his win before all the votes were in!","post_message":"#BREAKING: Michigan's Board of Canvassers deadlocked 2-2 on President-elect Donald Trump's objection to a recount of all presidential ballots cast in Michigan."},{"comment_id":"1067809293363821","commenter_b":"Trump is sending all illegal aliens to Mexico even if they are NOT from Mexico?","commenter_a":"Lets see now which border are they coming over? Oh that would be the Mexican border you say. So if they are detained at that border, no matter where they come from, why shouldn't they be sent right back over that border? It should be Mexico's responsibility to police those that are breaking their immigration laws and not letting them flow freely over our border. What is so funny and absurd about this?","post_message":"\"See? Justice isn't blind, she just can't tell Hispanics apart.\""}]
