[{"comment_id":"1202995606404444","commenter_b":"Made all her money from being sexy. Buuuuuwahaaaaaahaaa","commenter_a":"Funny how a party girl talks about porn","post_message":"COMMENTARY from Matt Walsh:  “I don’t have my Bible in front of me, but I’m pretty sure Pamela Anderson being accused of puritanism is a harbinger of the End Times.”"},{"comment_id":"10152564458982623","commenter_b":"Pure trash . Should have ran over her .","commenter_a":"Idiot.","post_message":"It's the video everyone is talking about.  The woman recorded in a terrifying road rage incident in Randleman has been charged."},{"comment_id":"10153333178554087","commenter_b":"Guess what Kerry illegals have no constitutional right to stay here either.","commenter_a":"Except for a little thing called the Constitution. And laws. I didn't notice the call to shut down churches after the white Christian kid walked into a black church and executed parishioners","post_message":"“Nobody wants to say this and nobody wants to shut down religious institutions or anything, but you know, you understand it, a lot of people understand it,\" Donald J. Trump told Sean Hannity. \"We’re going to have no choice. There's absolutely no choice.\""},{"comment_id":"1637686876527430","commenter_b":"I don't rbecall we doing this Obama some needs to stop this it is un-American to do this not happy leave the country that has let you make millions of dollar from the same people you bash we are sick of all this go cry to Hillary or better sit on her husband lap","commenter_a":"How stupid can they get? Pathetic!!","post_message":"Some celebrities will show up to Trump's inauguration....to protest."},{"comment_id":"936091029833983","commenter_b":"Shut up LIBTARDS","commenter_a":"Trump 2016.","post_message":"We have a message for Donald J. Trump: We're going to do everything we can to make sure you never become president. Sign this letter if you agree: hrc.io/2aaJYl5"},{"comment_id":"10154082437051051","commenter_b":"As usual she is lying.","commenter_a":"Wrongagain.","post_message":"Hillary Clinton says there's no question Obama will go down in history as a successful president. Is she right?"},{"comment_id":"10153642816391130","commenter_b":"Fk this bitch","commenter_a":"What a horrible article.","post_message":"One reason? Bernie Sanders is \"too old.\""}]
