[{"comment_id":"10153918680501116","commenter_b":"Mexico take Texas, we will throw in the theocrats for free!","commenter_a":"So much for Hamilton and Madison's half baked notions about \"representative\" government. How I wish California would secede from this corrupt Union...","post_message":"But Republicans are sticking with him."},{"comment_id":"10154408157211926","commenter_b":"You too, think of humanity stupid or hang yourself with him!","commenter_a":"This liar again! So he's preparing another false flag?","post_message":"Israeli Prime Minister Benjamin #Netanyahu yesterday accused #France of supporting groups that reject #Israel’s right to exist and call to #boycott it."},{"comment_id":"10152868852711336","commenter_b":"I approve. What else should we call them? They are illegals.","commenter_a":"Americans should be able to freely shoot border jumpers no questions asked in protection of our country!","post_message":"A California newspaper will continue to use the term \"illegals\" to describe people who enter the U.S. without permission, despite an attack on its building by vandals believed to object to the term."},{"comment_id":"1730793227218701","commenter_b":"My dad years worked in the fields of Arizona I whent with him knights we would spent checking the water pipes it's hard work but he was a proud man I learned a lot from him the truth is they won't last a night it day in the fields they beg that's all they do lazy","commenter_a":"Yeah right !","post_message":"They wouldn't last a day!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153647495544877","commenter_b":"@username is fine. Off subject. .but i had to get that out there. Hey boo...","commenter_a":"Let's try something new black America. Let's not break the law and put yourself in a position to get shot and I bet pretty good money u will live. Lol","post_message":"Thousands of Asian-American Protesters Rally in Support of Officer who Killed Unarmed Man in Housing Stairwell. Watch how it all unfolded below.   Grio fam, protesters said this is '1 Tragedy, 2 Victims.' What's your reaction?"},{"comment_id":"554818391394376","commenter_b":"@username you said it. Now it's trumps turn. AND HES GOING TO HEAR it... Loud and clear.","commenter_a":"@username TRUMP IS OUR PRESIDENT, Have some respect, stop showing our kids it's ok to disrespect our President, our country. Can't wait for the day, your boat sinks, and you hate mongering reporters drown.","post_message":"He wrote a book alleging corruption between the Clintons and their philanthropy. Now he says he sees similar conflicts of interest between Donald Trump and his business."},{"comment_id":"1297459886999211","commenter_b":"People, people, people, ain't nothing going to happen to this horrible, discussing bitch 🇨🇱","commenter_a":"Nasty woman.","post_message":"It's called \"Orgy Island,\" and there was already evidence linking Bill Clinton to it. Now, though, the FBI just dropped a bombshell involving Hillary Clinton and the sick island... and what agents are saying could turn the entire election in a VERY ugly way."}]
