[{"comment_id":"10153897303435329","commenter_b":"Some girls are bigger than others","commenter_a":"You can open a bottle with any edge. Lighter, desk, door jam, bike pedal","post_message":"How To Open A Bottle With A Cigarette Lighter"},{"comment_id":"1011579805549158","commenter_b":"Just wait til that fat bitch is refused her insulin because her fat, meat eating ass offends a pharmacists sincerely held religious beliefs.","commenter_a":"Think that woman having a dead fetus inside of her would have been a bigger problem. that can lead to a serious infection. the drugs she was prescribed was not to induce an abortion but to remove a fetus which had already died","post_message":"Straight, white Christian men run the world and they don't care who they have to hurt so that doesn't change."},{"comment_id":"489292257897396","commenter_b":"As long as yours dangerous people out there with weapons there's no reason to take away mine. If you take away all the guns from law-abiding citizens all you will have left are criminals with guns and there's no way to get all of those guns away from them","commenter_a":"What's the point in saying this every time and never doing anything about it? Of course, more gun control. Giving guns to the general public is fucking stupid.","post_message":"Once again, America needs to answer this question..."},{"comment_id":"1414587195226950","commenter_b":"2 all the women in pink why not just pack up ur pink panties and move 2 Cuba now that we have relations again I hear it's a paradise.","commenter_a":"GROW UP","post_message":"Female supporters of President Donald Trump aren’t sure why the Women’s March was necessary."},{"comment_id":"10153542667459087","commenter_b":"Liberal democrats won't be happy until every city in this country looks like this..","commenter_a":"Trump could tell a Muslims being shot with bullets dipped in pigs blood story and his support will continue to grow.","post_message":"“He took 50 bullets and he dipped them in pig’s blood,” Donald J. Trump said. “And he had his men load his rifles and he lined up the fifty people, and they shot 49 of those people. And the 50th person, he said, ‘You go back to your people and you tell them what happened.’ And for 25 years there wasn’t a problem.” WATCH:"},{"comment_id":"1518802311757226","commenter_b":"For people illegally here","commenter_a":"Especially if you are anyone other than the WORKING CLASS !!","post_message":"President Obama just addressed Donald Trump in a not-so-subtle way. Do you agree with the president?"},{"comment_id":"10153328651014342","commenter_b":"wonder if her phone was busy? congress write the laws why is no one talking about them?","commenter_a":"Well he calls after someone writes the words to say....the deputy was killed on Friday night and this is Monday....","post_message":"Today, President Obama called the widow of fallen Harris County Sheriff's Office Deputy #DarrenGoforth. After that, he released the following statement: \"This afternoon, on my way to Alaska, I called Kathleen Goforth, the widow of Harris County Deputy Sheriff Darren Goforth - a veteran law enforcement officer who was contemptibly shot and killed over the weekend. On behalf of the American people, I offered Mrs. Goforth my condolences, and told her that Michelle and I would keep her and her family in our prayers. I also promised that I would continue to highlight the uncommon bravery that police officers show in our communities every single day. They put their lives on the line for our safety. Targeting police officers is completely unacceptable - an affront to civilized society. As I said in my State of the Union Address, we've got to be able to put ourselves in the shoes of ..."}]
