[{"comment_id":"10154724331976341","commenter_b":"If you people are to arrogant or ignorant to comprehend the FACT that the land belongs to Israel than you will never get it because YOU DON\"T WANT TO.","commenter_a":"What's the big surprise? Prior to last Friday, Bibi and his gang gave lip service to the two-state solution, willingness to talk with the Pals, preservation of human rights. And did the opposite, much of the time. They don't have to bluff anymore. And by the by, it's strange to hear the man who's tried to bypass the administration for almost all of its eight years, you supported Obama's opponent in 08, talk about underhand tactics.","post_message":"You might think that something actually happened last Friday at the UN, writes David Rosenberg"},{"comment_id":"10152573528821717","commenter_b":"Greg Abbott in Texas! POS!","commenter_a":"He really is quite the Gov, is there a secret contest between him and Walker to who can screw a state more?","post_message":"Click here to follow LGBTQ Nation on Twitter: lgbtqn.at/tw"},{"comment_id":"10154779118243701","commenter_b":"Because she didn't want anyone to know she was pregnant in the first place","commenter_a":"Wait so if the baby is dead then you throw it out the window? That is just sick!!! You need help and definitely no more kids that baby dead or alive dose not deserve to be thrown out a window","post_message":"The Nebraska teen said she gave birth to an infant she thought was dead, panicked and threw the baby out the second-story window."},{"comment_id":"10153717285696509","commenter_b":"Looking better then the women in his home","commenter_a":"Should be on the cover of freaks magazine","post_message":"Caitlyn Jenner is on the cover of Vanity Fair, in an image shot by famed photographer Annie Leibovitz: @webpagelink #CallMeCaitlyn"},{"comment_id":"10156122375765354","commenter_b":"Wow!!! She had to be real high.","commenter_a":"I am not going to make a pun about a bang.","post_message":"Her mugshot says it all."},{"comment_id":"658224230997183","commenter_b":"She's buying her way out, watch. Criminal Just like Bush/Cheney. Ever see them traveling abroad? Ever wonder why?","commenter_a":"She is Ugly and a Liar just like Bill !!","post_message":"Judicial Watch announced it has filed a proposed order for discovery with a federal court that seeks the testimony of Hillary Clinton about her use of personal email account(s) for official State Department business. Judicial Watch discovery plan also seeks the testimony of Cheryl Mills, Clinton former chief of staff; and Jake Sullivan, former senior advisor and deputy chief of staff, as well as other current and former State Department officials. Please SHARE!"},{"comment_id":"1800550493547458","commenter_b":"Good idea but im barefoot anyway","commenter_a":"@username would you use it?","post_message":"The iron horseshoe is now a thing of the past."}]
