[{"comment_id":"10154140064560579","commenter_b":"Seriously Facebook . .you need to put a 'DUH' button on here","commenter_a":"She's right, the game is rigged and I'm sick and tired of the power elite in this country, be it the politicians or the media, trying to tell us what to think. Regardless of whether it's her or someone else, we DO have to take our country back.","post_message":"\"This game is rigged.\" Carly Fiorina on not being able to participate in Saturday night's debate in New Hampshire. Watch complete video here: @webpagelink"},{"comment_id":"822359307886042","commenter_b":"It was meant for this baby to live","commenter_a":"God directed that Officer to the area. He is Hero","post_message":"A newborn girl thought to be only 36 to 48 hours old was found alive in Compton on Friday. The baby muffled cries led sheriff deputies to find her buried under pieces of asphalt and rubble inside a crevice near a riverbed. Detectives are now asking anyone with information to come forward. this post to alert others. Read KTLA story here: @webpagelink"},{"comment_id":"1247857341977182","commenter_b":"The radical Christians in this country would throw gays off of rooftops too if they wouldn't go to jail for it. If you think that's wrong read the comments on any article about them.","commenter_a":"Now all the Christians will throw the pope under the bus for stating the obvious","post_message":"\"It's like a mixed fruit salad. There is a bit of everything. There are violent people in all religions,\" Pope Francis said."},{"comment_id":"1735755160025201","commenter_b":"Hopefully I can get there before someone builds a wall around our entire country!","commenter_a":"I feel so sorry for you Americans!! Come in up to Canada we can have a beer and chat about your presidential candidates lol","post_message":"Donald J. Trump accuses President Obama of being 'the founder of ISIS'... then calls Hillary Clinton the 'co-founder.' @webpagelink"},{"comment_id":"1046767232087074","commenter_b":"@username I know that - he promoted that they would all go back intially and has since changed his agenda. He announced it more or less on Hannity last night - please read the comment again. There are AT LEAST 11.5 of illegals in the nation who would not be classified as criminals. And even tho \"they would not be given citizenship\" who does not know the Left's MO - of course the left will push for voting rights. The Left needs an underclass to stay in power. They are building the numbers year after year of voting blocs to keep themselves in power!","commenter_a":"So you are going to let the 11.5 illegals stay in the nation. You say they will not be given citizenship. You must know that most of us on the right are not stupid by now, right? The Marxists will push for their voting rights anyway - and get them w/a song and dance. And there goes the nation. We will never get her back - ever. The Left is delighted. They did it. They stacked the nation in their favor. WHY do you think the wall was never built? RIP USA.","post_message":"Will be on #Hannity @ 10pE on Fox News - discussing various subjects including immigration - if elected, we will #BuildTheWall & enforce our laws! Tune in - as Donald Trump Jr. Joins me with other special guests!"},{"comment_id":"10155525709475603","commenter_b":"She is a scam artist and charlatan anyway.","commenter_a":"Ok now what about the big Joyce Meyer's Women's Conference that comes to St. Louis in Sept.? That's why I can't travel by myself down there. It's sad.","post_message":"Three people shot overnight including at 16-year-old boy. If you think you’re hearing more about crime this year in St. Louis, we have new statistics to prove it. Right now on News 4 This Morning, Laura Hettiger is breaking down all the violent crime we’ve seen so far in the first 4 months of the year."},{"comment_id":"10153551784963984","commenter_b":"She wants some air time don't give it to her","commenter_a":"Yep","post_message":"These days, Donald Trump seems to be at the center of every controversy. He might just be in the midst of another one after this actress just thanked him for his stance on immigration... Do you agree with Donald Trump's views on immigration?"}]
