[{"comment_id":"487985148058732","commenter_b":"Why hell no, is that why he wants all the illegals in the USA.","commenter_a":"I've wondered if he might arrange some kind of false flag in order to declare martial law and thereby remain in office. I think he knows he couldn't get elected again in a fair election. But then again his lips were moving so he's probably lying anyway.","post_message":"What Obama just said about running for a third term is shocking.  Spread this, Obama doesn't want the public to know what he's planning.  Should Obama be allowed to run for a third term?"},{"comment_id":"10154669913269843","commenter_b":"Well some of those people must be women with phones.","commenter_a":"Yay! Maybe traffic will be better!","post_message":"\"A Day Without Immigrants\" actions are planned across the U.S. in cities like Dallas, Austin, Philadelphia, Washington and Boston... bit.ly/2kz5UXf"},{"comment_id":"10153287976081770","commenter_b":"@username you may be right. But on the other hand maybe thats what this country needs now. A good dose of reality. Quit voting these life long politicians in office.","commenter_a":"Trump as President??? So everyone is all right with him insulting women, rude comments about Jeb Bush, Ted Cruz, Carly Fiorina, Megyn Kelly,insulted the miltary, the disabled, John Mccain just to name a few. One of the meaniest and rude things he has done where he ripped it with me is a couple of days before Thanksgiving, at a rally in South Carolina he made fun of a New York Times reporter that had a physcial problem. Speaking as a person that has a physcial problem, that was very offensive! If I would have been at that rally, I would have knocked the living crap out of Trump! Trump thinks that he is going to be able to insult himself into The White House but oh boy, he is VERY wrong!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","post_message":"Donald J. Trump spoke highly of his wife, Melania, at his last rally before voters head to the polls in New Hampshire."},{"comment_id":"10154009209659087","commenter_b":"@username if they were legal the kids would be citizens","commenter_a":"I don't know how much credence we can give any of the polls after they caught Reuters \"cooking\" that poll a few weeks ago. It goes without saying the media bias has never been this strong ever.","post_message":"CNN anchor Brianna Keilar is challenged by Donald Trump's lawyer Michael Cohen to identify which polls show his campaign losing. Her response stuns him."},{"comment_id":"638502853006960","commenter_b":"I love this picture, can you see michael adams apple. Women do not have one.","commenter_a":"I wonder if she refers to her own mother that way. Btw, the mother who also lives in the White House at our expense.","post_message":"Michelle Obama just insulted mothers everywhere... You'll be furious.  We're sick and tired of hearing about her. Let's make her go away forever.  'LIKE' if we should kick Michelle out of the White House!"},{"comment_id":"1190297117696296","commenter_b":"What did she do ? Omg we're in trouble with these idiots able to vote.","commenter_a":"Shut up Bob Marlee's sister!!! BLM lol","post_message":"Let's Talk... tonight's debate. We're live at Union Square asking people to sound off.  Be sure to watch The Countdown: Hofstra Debate at 8pm here on Facebook and @webpagelink/  We'll have live coverage of the debate at 9pm here: @webpagelink"},{"comment_id":"10158052080890594","commenter_b":"@username Stop being dramatic. Trump's own wife is an immigrant. The only issue is with those here illegally. They should be deported under existing law.","commenter_a":"As long as you are here legally, there's nothing to fear.","post_message":""}]
