[{"comment_id":"10153295619909384","commenter_b":"I beg to clarify this situation. As we all know, Pelosi has been psychotic for several years. I think the question that should be answered is this: How many blind and ignorant lemming liberals have kept this shameful person in the powerful position she is in, for as many years she has been elected? That is where the real shame lies.","commenter_a":"Since when do you care about Homeland security, Nancy. You who totally have supported all that obama has done to destroy the security of our nation's borders and let millions in including criminals whose own country does not want them. You are a joke and a puppet whose love of our nation was destroyed by your love of power and party. Just shut up.","post_message":"We shouldn't wait another day to remove all doubt to our enemies, to American families and to the affected workers that we will fully fund the Department of Homeland Security. My full statement: @webpagelink"},{"comment_id":"501283103409637","commenter_b":"I'll bet this ungrateful Liberal enjoys the freedom that our military & constitution provide her !!!","commenter_a":"The original blonde joke. No offense meant for conservative blondes or any blonde with good sense.","post_message":""},{"comment_id":"10154434933517690","commenter_b":"@username, she's a girl. Not a he. SHE!!!","commenter_a":"Myb6 year old saw this news story, not understanding the word transgender at all. He said \"That's mean them, I don't think God would like that\" The fact is kids don't fully understand the transgender thing. This little boy included. But if he wants to be included as a boy, then let him. The other boys don't have to know. This is like excluding a girl from football or something.","post_message":"The family of an 8-year-old New Jersey boy says he was kicked out of Cub Scouts because he is transgender, a move that could open a new front in the debate over discrimination in Scouting."},{"comment_id":"1842076306034200","commenter_b":"But the opinion of a lying, misogynist, braggart like Trump is worth listening to ? Some people . :-(","commenter_a":"Worst acceptance speech ever Be appreciative of the award. Nobody watches the Golden Globes to hear your multi million dollar opinion","post_message":"WOW! Meryl Streep just brought down the house at the Golden Globes..."},{"comment_id":"10153225477750736","commenter_b":"The show pits women against each other and promotes dangerous stereotypes and archaic gender roles. It isn't entertainment and this isn't news.","commenter_a":"Leann Allisgood","post_message":"ICYMI: Lauren Bushnell, the flight attendant from West Linn, got another rose during 'The Bachelor' in The Bahamas, but not until she swam with unruly pigs first:"},{"comment_id":"638594622989083","commenter_b":"@username:: He is. Watched this afternoon & it was good!","commenter_a":"the credibility of cnn as a real news source has is no more....half of the hosts on msnbc are going after Hillary and not focusing on anything that trump does.... and we don't have to say anything about the fair and balanced fox.....it is just sad that trump is getting away with everything....he is the real criminal......but the press doesn't want anyone to know it...it would be bad for ratings.....","post_message":"We've warned them for months: keep pushing the double standard against Hillary and you'll lose all credibility."},{"comment_id":"10154312646744726","commenter_b":"For those confused about how an attack like the one in Orlando, Florida, could happen, I'll try to catch you up: Barack Obama's #1 goal has been to turn this nation into an Islamic wasteland. To that end, he appointed Hillary Clinton to be his dirty-dealing Secretary of State, in order to funnel military grade weapons to a then very inchoate ISIS. Hillary Clinton decided that it was appropriate for her to set up a fake Canadian charity, the Clinton Global Initiative, so that she could accept donations from dangerous nations, in return for personal political favors from the Secretary of State. This is the very definition of treason. However, Hillary didn't want anyone to have a paper trail of all her crooked dealings, so she set up a private email server in an attempt to thwart Freedom of Information Act requests. Barack Obama is now protecting Hillary, because he's ...","commenter_a":"It's truly disgusting and disturbing to use a massacre to push a political agenda. It was an Islamic terrorist attack now it's been used by democrats for an anti gun campaign, sickening.","post_message":"Liberals immediately urge gun control measures as terror link emerges in Orlando shooting"}]
