[{"comment_id":"1242359992482301","commenter_b":"@username I know, I'm just saying. Course, they could always do what those nutters in that Ukrainian training video do.","commenter_a":"That's great and everything, but it's a whole different thing when there's bullets and shit coming back AT you. Paper doesn't fire back...","post_message":"See more training and combat at > Afghanistan Combat Footage - Funker530 CONTACT FRONT! ~Josh"},{"comment_id":"1172100076163796","commenter_b":"Tape the bitches mouth shut and repeatedly butt fuck her","commenter_a":"Cruelty to animals is not OK.","post_message":"The internet is calling for blood after a woman posted a photo of her dog with its mouth duct-taped shut."},{"comment_id":"10154578809696336","commenter_b":"They are all corrupt !!! Time to clean house !!!","commenter_a":"Lol , I just remembered that Obama said hillary is more qualified than he is .","post_message":"\"The FBI's not supposed to be involved in spinning the news. Whenever you release sensitive materials on the Friday of a holiday weekend you are trying to affect the news cycle.\" Tucker Carlson said the timing of the FBI's release of documents relating to the Clinton server scandal \"discredits a venerable agency.\" @webpagelink"},{"comment_id":"10153554685766880","commenter_b":"I want TRUMP to build the wall so can make it hold","commenter_a":"At one time owning slaves was constitutional","post_message":"#2. Ending birthright citizenship would be \"clearly unconstitutional.\""},{"comment_id":"10153163452101770","commenter_b":"sick thugs","commenter_a":"Good! Time to show respect..","post_message":"Two students who attend a public high school in small-town Tennessee are reportedly spending the first weekend in December in jail because they wore saggy pants to school one too many times."},{"comment_id":"10154836011454641","commenter_b":"Muslims should be exterminated..ambassadors of evil!","commenter_a":"And now he funds terrorism, giving weapons to the same people that have just been found to of made a mass grave in Aleppo of civilians. Scumbag.","post_message":"He was broke after running a losing campaign, his credit card was declined and he was quickly losing hope on pursuing a career in politics."},{"comment_id":"10153885650817061","commenter_b":"@username , please take the tin foils off. For Benghazi, blame the Republicans. All of what you are saying about HC is all conspiracy based. EVERY investigation ha cleared her of wrongdoings. She is not perfect, but far better than that lying rapist BIGOT woman hater thief (ask the thousands of people he stiffed out of their money) IDIOT DT.","commenter_a":"Oh...don't mention Indiana! We are not proud that we have idiots voting for him!","post_message":"Sign of the times: Donald J. Trump supporter from Indiana says he's gone to great lengths to protect his yard sign with the candidate's name on it. So far, he says, \"I'm 2 and 0.\""}]
