[{"comment_id":"10155061225139726","commenter_b":"The woman wearing this would probably be beaten to death. Better off carrying a gun!","commenter_a":"Women in America carry guns. What are we back to the middle ages? women at the time wore chastity belts to protect themselves from the muslim ancestors of the same ones today who were terrorizing Europe back then.","post_message":"It's a modern day chastity belt."},{"comment_id":"578535808963586","commenter_b":"Little beaver !","commenter_a":"10208389159192541lol smh","post_message":"Happy Groundhog Day—here's to six more weeks of winter. Thanks to Believing in imaginary friends and fairy tales is outside of my age bracket for sharing."},{"comment_id":"579603902228604","commenter_b":"She must have morals","commenter_a":"Oh the horror of it all! Freedom of speech, freedom of choice, oh now we have her! Pathetic!","post_message":"People are freaking out over what's being said about Taylor Swift today..."},{"comment_id":"429495940593558","commenter_b":"The racists are AGAINST Trumo!","commenter_a":"The days of Nazi Germany are coming back if we don't stop this racist Trump. Blacks and Latinos must unite power to end this nonsense.","post_message":"The Secret Service rushed to shield Donald J. Trump after someone tried to jump a barrier during an Ohio rally on Saturday."},{"comment_id":"1146502822036413","commenter_b":"We can make the illegals pay taxes.","commenter_a":"He can just file bankruptcy when it's done being built.","post_message":"Constructing an impassable wall along the U.S.-Mexico border would be a tall order — even for master real estate developer and 2016 GOP presidential candidate Donald J. Trump."},{"comment_id":"1584390601848053","commenter_b":"12 years old. She looks 30 !","commenter_a":"Of course she sings well.....her mother is FAITH HILL!","post_message":"Wow. She is incredible. Just like her mother!"},{"comment_id":"10154044845821320","commenter_b":"Will it turn into ice by the morning","commenter_a":"Stay warm all from sunny California.","post_message":"Mike Woods updates the storm. Be sure to download the free FOX5NY WEATHER app to get Fox 5 weather on the go."}]
