[{"comment_id":"10155442182635615","commenter_b":"Fix that damn grill! She looks like a damn key maker!","commenter_a":"get a new haircut, for starters...","post_message":"What do you think they should do with it?"},{"comment_id":"10153253183992690","commenter_b":"Hispanic Race Mexican Race Human Race Everyone is a Race!","commenter_a":"I do not hate Mexicans! So get that straight! Illegal alien does not necessarily mean \"Mexican\"! Seriously????","post_message":"A former Texas DPS employee at the Irving office is sentenced Thursday for selling driver's licenses to dozens of unauthorized immigrants. @webpagelink"},{"comment_id":"10153951391170579","commenter_b":"We have millions of people on welfare because Illegals are doing the jobs they are qualified for...we can use guest workers legally if we need more workers...I don't see us the US needing them though","commenter_a":"The republicans are certainly changing their tune on immigration. But they have no choice. Nobody in their right mind believes that we can deport all illegal immigrants without devastating our economy and millions of families. Even Trump admitted that they could come right back, a weak attempt to lessen the blow of his ridiculous plan. Yet another win for Bernie Sanders, who has no need to flip on issues to garner support.","post_message":"Your takeaway from the 4th Republican Presidential Debate?"},{"comment_id":"10153368981378812","commenter_b":"As past wars have told us, you can ONLY stop violence with violence, these people need to be shot down","commenter_a":"You can't stop violence with violence.","post_message":"BREAKING UPDATE: Baltimore Police: At least 7 officers injured in clashes -- 1 is \"unresponsive,\" some have broken bones; mob has surrounded and destroyed a police cruiser -- LATEST: @webpagelink LIVE: @webpagelink"},{"comment_id":"10153465334273132","commenter_b":"This case may seem cut n dry but so much time has gone by plus they never found his body.. I would not want to be a juror on this case","commenter_a":"They had a convict in prison who was even more than likely this little boy's killer. I think this is why this guy's 'confession' is so questionable. The investigators refused to admit they made a huge mistake, not surprisingly. I don't think they have the right guy, as for the real killer, I believe he died in prison. The whole thing is tragic.","post_message":"The jury has already been deliberating for 11 days."},{"comment_id":"10154343689874094","commenter_b":"People know who she is. She will get whats coming to her","commenter_a":"Hopefully she'll get caught out on a camping trip and be torn apart slowly by wolves.","post_message":"Roadrunner the dog's injuries were so severe that a veterinarian had to remove his eyes."},{"comment_id":"1766493690288077","commenter_b":"get outta here!","commenter_a":"Democrats are so worried about Russia influencing our election by uncovering the truth. I'm troubled by the fact that Democrats are fine with mainstream media influencing our elections by deceptive and selective reporting to fit an agenda backed by money.","post_message":"A half dozen taco trucks formed a \"wall\" outside of the Trump International Las Vegas hotel hours before the last debate between Donald J. Trump and Hillary Clinton"}]
