[{"comment_id":"1235543663197041","commenter_b":"Are you crazy fat black lady?","commenter_a":"Can't fix stupid","post_message":"Apparently, torturing white people and yelling \"F**k Donald Trump! F**k white people!\" isn't a hate crime..."},{"comment_id":"477998972394364","commenter_b":"Me too, but sometimes I go overboard and can't keep track of all my comments on the Internet.. So I have to take a break.. Also I get discouraged when people call me names :(","commenter_a":"They didn't say \"get over it.\" They promised to look into it, did so, and concluded that their pop culture reference was fine and that people misconstruing it would be in the minority and no changes needed to be made. Kinda funny how you can spin a story with a contentious headline. Ben & Jerry's seemed concientuous and compassionate here, not combative and dismissive as the headline suggests.","post_message":"These folks became very upset over the name of Ben & Jerry's new ice cream flavor and demanded it be changed. Ben & Jerry's response: Get over it."},{"comment_id":"10153931139325695","commenter_b":"Omg poor @username lmao. What a nut job . So should we deport whites for crimes? Since this wasn't really our land to begin with?","commenter_a":"Really disappointed with you, WSB.","post_message":"Our investigation found the number of refugees deported for violent crimes is skyrocketing, and it includes numerous refugees here in Georgia. Today at 5, the numbers that leaders call a \"game changer\" in the Syrian refugee debate."},{"comment_id":"10154487721214062","commenter_b":"Only problem he has to rape to be a thug. Blacks just have to be born and they are considered thugs","commenter_a":"Lol KHOU just called someone a thug! 😂😂😂but seriously he needs to be caught.","post_message":"Please share to get this thug off the streets! He's a violent rapist who sexually assaulted two 16-year-old girls."},{"comment_id":"10153195782398984","commenter_b":"she is a witch","commenter_a":"She's a BIG box of rancid nuts , and there are plenty more in there with her !!!!!","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"565139210325963","commenter_b":"Just a thought, but doesn't having a system of getting illegal aliens jobs that no on else wants to do sound a little like the Slave-plantations system? After all, employers get poor, uneducated people to do jobs that others won't do. And they can abuse these workers with meager pay and living conditions. They can violate rights without facing consequences. Could be seen as a human rights violation fueled by greed.","commenter_a":"For everyone who thinks Mexican are illegal n don't know their history the white man is an illegal.. We Mexicans always been here","post_message":"Diego Reyna, a Mexican-Canadian, said he placed the Mexican flag atop the nearly completed Trump Tower because he was tired of disparaging remarks made by Donald Trump. \"MR Trump, we did our best work, your tower here in Vancouver is premium quality, and we were a crucial part of it, not just Mexicans but immigrants as a whole,\" he wrote on Facebook. \"The insults you have said about us, have not changed our work ethics.\" Reyna says he hopes his message of \"love and unity\" will reach the Republican presidential candidate."},{"comment_id":"992191140821358","commenter_b":"Why? I think she is best in the senate. I also think an all female ticket is unrealistic.","commenter_a":"Clinton/O'Malley would be a good ticket.","post_message":"Hillary Clinton absolutely crushed every single Republican candidate in a recent CNN/ORC poll."}]
