[{"comment_id":"10153211498337894","commenter_b":"Lmao","commenter_a":"If that baby head is as wide as hers… Chrissy… You in danger gurl! LOL","post_message":"John Legend and Chrissy Teigen Are Having a Baby! [Photo]"},{"comment_id":"10153560622578984","commenter_b":"Gotta get around it some how. And drugs is my number 2 family problem, I HATE DRUGS!","commenter_a":"I do support this family, the only thing is I think all bakers and places that sell Wedding cakes need to go out of business or stop baking cakes, stick with pastries.","post_message":"The government is after this family for refusing to bake a cake for a lesbian couple's wedding. The way they just responded is absolutely perfect... Do you support this family?"},{"comment_id":"1020212581369220","commenter_b":"Ahahahah shut up bitch! :-*","commenter_a":"S ja ta td percebido ;)","post_message":""},{"comment_id":"10152763572857434","commenter_b":"#whitegirlsbeefin","commenter_a":"Alcoholism is funny if it's at a wedding #sarcasm","post_message":"To say the bride was displeased is a major understatement"},{"comment_id":"10155254792200354","commenter_b":"Which college did she attend? Was a waste of money.","commenter_a":"We don't need Work Place Violence. They need OUT of U.S.","post_message":"She actually stands by her statement that ISIS terrorists just need...job opportunities. Watch the insane VIDEO below."},{"comment_id":"10153737959512623","commenter_b":"Girl one lady is so about to make me go in lmbo","commenter_a":"It's not about air... They weren't even allowed to open the windows, there was no airflow, the kids came off drenched in sweat and crying.","post_message":"Some parents are upset with a local school system after they say their kids got off the bus \"drenched in sweat\" and crying. A school system spokesperson said some of the parents' claims were \"less than accurate.\""},{"comment_id":"10154256686314641","commenter_b":"What a horrible woman.","commenter_a":"i'hve ,ever seen something like that until she was suffer from mental illness","post_message":"\"Mr. Sheats will have to live the rest of his life with this horrible memory.\""}]
