[{"comment_id":"10153510075534087","commenter_b":"So, there is no room for reasonable art of the deal on either side, now? Remember what happened in 2012, fellow Republicans. You didn't turn out because Romney wasn't \"conservative enough\" for you. Then you did nothing but whine and bitch and blame it on voter fraud and your grandmother's Impetigo. The problem is not PEOPLE a from another country, it is SUBSIDIES that politicians buy votes with and ABUSE of unskilled labor and QUOTAS set by those who use prejudice to their advantage. We cannot round up 12 million entrenched undocumenteds, nor should we- it would be political and fiscal suicide. So let's get an electable candidate, get him in the WH, and start doing what we can to enforce immigration laws that protect us from terrorists and criminals, the ones Obama and this DOJ flip the bird to the SCOTUS a about, create an environment where inclusion with ...","commenter_a":"Trump all the way to the White House.","post_message":"“Marco Rubio is the front man for the open borders syndicate,” Donald J. Trump's senior policy adviser Stephen Miller said in a radio interview. “And understand this, Marco Rubio is determined to finish what he started with the Gang of Eight bill and to be President Obama’s third term on immigration.”"},{"comment_id":"10153266614821336","commenter_b":"California has been sicking for some time! One of the things liberals in CA like to do is drive companies out of the state! Also turn off the water to the small farmers, that put 40,000 farm works out of work! Keep building houses when they don't have the water to supply to them. Build a high speed rail road that no one wants or needs!","commenter_a":"Hard to find anything dumber than a California Democrat.","post_message":"Nobody's laughing, Rep. Loretta Sanchez."},{"comment_id":"944282629025715","commenter_b":"Yes","commenter_a":"Yes absolutely","post_message":"Yes!"},{"comment_id":"538334903023756","commenter_b":"Yes....throw her ass in jail.","commenter_a":"That's what happens when you engage you mouth before your brain","post_message":"The Baltimore prosecutor is about to go down in flames after this.  She is a criminal, just like the rest of them.  Do you agree she should serve time?"},{"comment_id":"1027310527363527","commenter_b":"go girl go!","commenter_a":"Now do it with 40 pounds of gear and a drill instructor screaming at you. lol","post_message":"Meet Milla, a 9-year-old girl that just dominated a Navy Seals obstacle course. (via NowThis)"},{"comment_id":"10153180553634071","commenter_b":"ohh this one","commenter_a":"@username Teresa Oanh Hoang","post_message":"She had something much better in mind."},{"comment_id":"841359735901368","commenter_b":"He just \"forgets\" that we are in the 21st century, not in the Middle Age. We've learned from the past and they don't.","commenter_a":"We are all aware that this President is ill informed and has had trouble when it comes to Historical accounts... Whether or not you believe the Crusades were meant to stop Islamic atrocities or to spread Christianity, that should not be the focus here. Suggestion: Truly read the differences between Christianity and the Islamic faiths and decide which spreads peace within its holy scriptures.... An interesting example below siting scripture from both religions (read in its entirety). ...Especially, the Ellen Mems comparison. This is a public FB debate between a Muslim and a Christian: Quoting \" Christianity & Islam A debate... Gamal Abouomar Who is Prophet Muhammad, may peace and blessings be upon him? He is the one who defended the rights of all humanity 1400 years ago. He defended men's, women's and children rights He commanded and fostered the love between relatives and neighbors He established a coexistence relationship ...","post_message":"Barack Obama's prayer breakfast comments about Christianity are causing some to perk up.   “Unless we get on our high horse and think this is unique to some other place, remember that during the Crusades and the Inquisition, people committed terrible deeds in the name of Christ.\""}]
