[{"comment_id":"445100202281687","commenter_b":"Hey here is an idea to the asshole who runs this page, stop defending these fucking criminals. Weed is ILLEGAL. Don't fucking run asshole. The fucking cop should have curb stomped him","commenter_a":"this police guy is a liar ,you deserved your termination,your insane....","post_message":"This is just disturbing. What a lame excuse this cop who has been reported multiple times in the past used for his violent behavior. Now he is defending his actions.   Do you think his violence is justified?  *Warning* GRAPHIC Video: @webpagelink"},{"comment_id":"10153781983829062","commenter_b":"Yeah!","commenter_a":"Oscar","post_message":"Heads up Ariana, fans... she's coming back to Texas this summer! Did you see her at the rodeo?"},{"comment_id":"926693817463797","commenter_b":"Fuck u bitch","commenter_a":"Good :) anything to make more conservatives whine and bitch like the petulant children they are.","post_message":"This is just plain sad..."},{"comment_id":"1728663384083911","commenter_b":"They can stick it!!","commenter_a":"No, no, hell no! If if offends them, just stay away!!","post_message":"Liberals Want To Ban The Most Iconic 9/11 Picture From Museum.  There is no reason on earth why it should be banned.  Can we get 30,000 'LIKES' to keep this picture in the Museum?"},{"comment_id":"10153644679730927","commenter_b":"Of course, if you are a dissenter, you will be eating in prison. If it's so great in Cuba, why do we still have Cuban refugees fleeing to the US? Could it possibly be due to the oppressive Marxist-Leninist Castro regime? Leftist fools admire their heroes, communist revolutionaries Fidel Castro and Che Guevara. Patterson should stick to writing novels.","commenter_a":"So go live there James......it's called socialism, or communism. New cars are 1958 chevies, and you forget the rationing lines weekly for food? Plane flights now available for you James, and don't let the door hit you in the a$$.","post_message":"WATCH--'I think in this country we should at least take care of the basics. So we doing a bad job in that area. Really bad ...'"},{"comment_id":"10154111775125779","commenter_b":"Haha She landed Russell Wilson, she isn't going anywhere.","commenter_a":"We all know how this is going to end - she's going to go back to the Future.","post_message":"Ciara dropped her $15 million defamation suit against her ex-fiancé Future Friday, a year after the singer first accused the rapper of slander."},{"comment_id":"10153205553056782","commenter_b":"'@username...the difference is that I am a legal United States Citizen and the illegal criminal is not. They broke the law so that makes them a criminal..and as for pushing...the illegals are the ones that are not going to like the results.. You come to the U.S. legally and you are welcome with open arms. Illegals come here by breaking the law and then refuse to learn English and then demand they be given the same rights as American citizens and for things to be changed to fit them...BS!!!!","commenter_a":"This is complete BS!!! They are illegals!! NOT undocumented.... In Oklahoma you have to prove you are here LEGALLY, not an illegal criminal to get an Oklahoma ID or DL. Sign up for a DL as an illegal and get deported.","post_message":"An Oklahoma City grassroots effort to get undocumented immigrants drivers licenses is gaining momentum."}]
