[{"comment_id":"639736896151349","commenter_b":"That's great and all but how do these women make money now?","commenter_a":"yeah and there'll be some bleeding heart liberal who'll be out fighting for robots rights and defending human trafficking because 'pedophelia is a disease!' and we 'shouldn't judge'.","post_message":"Experts believe that cyborg prostitution will help ‘clean up the industry’ by reducing sexually transmitted diseases and ending sex slavery."},{"comment_id":"922274701162393","commenter_b":"Wait, she is the old hag looting America, and the rest of the world.","commenter_a":"'@username - Such an inspiring woman. You are okay with a old hag looting America but not a woman with great accomplishment trying to occupy White Office. #Hillary4WH #MadamPresident","post_message":"Hillary's new favorite singer."},{"comment_id":"10153199106634071","commenter_b":"Get her a group of body guards while you're at it","commenter_a":"M","post_message":"A $48.5 million diamond for a 7-year-old girl."},{"comment_id":"10155794432670354","commenter_b":"she'll never get that stink off her!","commenter_a":"What was that idiot doing there anyway.","post_message":"What was she thinking?"},{"comment_id":"10156328983890389","commenter_b":"just a dried up old liberal lying witch .","commenter_a":"The appearance of former secretary of State Hillary Clinton before the House Select Committee on Benghazi raised very important questions on diplomatic security, the relationship between the secretary of State and her ambassadors and leadership. My experience during 38 years in the Foreign Service, including six assignments as an ambassador, has given me a perspective on these issues that differs from some of the arguments developed by the Committee. First, about security. Every secretary of State and every ambassador has security as a top priority. It is a dangerous world, and we are everywhere in it. An ambassador is responsible for the security of her personnel and her embassy. Internal defense plans, risk assessment, movement controls, adequate defensive systems these are all on the shoulders of the chief of mission. The department is responsible for getting her what she says she needs. There is no perfect security. Risk has to ...","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10156189535540354","commenter_b":"'@username you do know that Sharia Law requires gays to be destroyed?","commenter_a":"I can't imagine any conservative/Republican not standing with Dr. Carson on this.","post_message":"'Sharia law is so inconsistent with the US Constitution Ben Carson could not be more right.'"},{"comment_id":"10154641460388734","commenter_b":"Where there is smoke. There is fire. Only the individuals involved will ever know the truth.","commenter_a":"Hi Tony","post_message":"A woman accusing Republican Presidential nominee Donald Trump of ‘of victimizing her with inappropriate sexual conduct’ is speaking with the press for the first time."}]
