[{"comment_id":"10154302113081509","commenter_b":"She had them surgically removed. She also doesn't have a brain or even a modicum of decency. And THAT is why she's running for office! Hellary 2016!","commenter_a":"Hillary would you like to have your husband also in prison ? Or else a dildo is enough ?","post_message":"Hillary Clinton had a message for a supporter's father who is backing Donald J. Trump"},{"comment_id":"10153273876007377","commenter_b":"Lady!!1 It's Jail time !!!","commenter_a":"She is a LIAR and TRAITOR.","post_message":"This is a clear violation of federal law that has put these agents in harm's way."},{"comment_id":"10153123153839094","commenter_b":"Behind what.....the Jettsons?","commenter_a":"We are only behind because the city deferred maintenance and closed one of the terminals to make flyers more crowded and make the airport look awful.","post_message":"Kansas City should focus on planning for a single new terminal at Kansas City International Airport, airlines and the city’s aviation department said today."},{"comment_id":"824943850887973","commenter_b":"What dumb a holes. They can't destroy anyone. The U.S. Would squash them like a bug.","commenter_a":"Someone shoot this idiot......he is the problem.","post_message":"Warns that 'Tehran will set fire to every military base from which a hostile U.S. plane takes off for bombing Iran.'"},{"comment_id":"10153216177713984","commenter_b":"I have 3 sons--never once did I pack their lunch---for a reason---I wanted them to experience other foods and if they got hungry they would eat what was in front of them---My guys are not picky eaters and like most everything--mission accomplished.","commenter_a":"So people don't want their kids to eat healthy OK LOL!!","post_message":"This unhappy 2nd grader just served up a giant helping of truth about Michelle's school lunch agenda. I bet she had a tough time swallowing this one.  Do you support this kid for confronting Michelle Obama?"},{"comment_id":"863625973741296","commenter_b":"Absolutely. ...praying for him and his family","commenter_a":"Allready did","post_message":"Kentucky Police Officer Shot Down In Cold Blood, Killer Still On The Loose The media is silent, no Al Sharpton, no Obama, nothing. Will you pray for him and his family?"},{"comment_id":"450286948495219","commenter_b":"Jo Jo What ever bitch, I have never called the cops and never will when I wish to commit suicide I'll call the pigs. You are a statist bitch.","commenter_a":"Whats the difference? Police are thugs.","post_message":"Do You Support Our Police Over Thugs?  Comment 'yes' or 'no'."}]
