[{"comment_id":"1132943900117478","commenter_b":"Knock that bitch down when he gets in your face. Trump 16","commenter_a":"What a bunch of disgusting, vile, ignorant, hypocritical, liberal scumbags!! Totally revolting behavior typical of the left with absolutely NONE of the 'tolerance' they preach for anyone who disagrees with them!! Sickening!!","post_message":"Liberals try to portray themselves as the voice of 'tolerance.' You'll realize just how 'tolerant' they really are when you see this video, where they made a SICK move at a meeting that supported Donald J. Trump.  This is the REAL face of the left, folks... America needs to see this."},{"comment_id":"1048204431922451","commenter_b":"in the beginning of his campaigned media said he was a Muslim,friends of the activist terrorist eyre and his pastor mentor for 20 yrs condemned America,his wife hate America, the only PRESIDENT APOLOGIZED FOR AMERICA and the people still vote for him, and look America now, bankrupt morally,financially,economically and bankrupt spiritually. AND THE BAD NEWS HILARY GOAL IS TO FOLLOW HIS STEPS. IF ANY ONE OF DEMOCRATIC WIN, THE END OF AMERICA . WE WILL BECOME A SOCIALIST ,COMMUNIST COUNTRY LIKE CUBA AND SOCIALIST COUNTRY OUR LIFE WILL RUN BY THE GOVERNMENT. YOUNG PEOPLE ARE BRAINWASH OF THE SOCIALIST TEACHERS IN SCHOOL AND UNIVERSITIES. PRAY FOR OUR COUNTRY AND YOUNG PEOPLE,","commenter_a":"I have been saying that for years!!! He isn't going to do anything to hurt his peeps.","post_message":"Former CIA Agent Says Obama is Working With The Muslim Brotherhood Against America. ⋆ Please Share ⋆"},{"comment_id":"1087900891233676","commenter_b":"The country would be safer if deported the republican/Tea Party.","commenter_a":"Thats why this year to come. I invite all registered voters to hit the polls. So this son of biatch don't win.","post_message":"After seeing Trump on TV, 8-year-old Sofia was terrified that the army was coming to take her away."},{"comment_id":"1610722349214878","commenter_b":"wow beautiful.......","commenter_a":"Beautiful","post_message":"Wow. I've got chills.  God is so good."},{"comment_id":"10154789649578256","commenter_b":"'@username. Does a strong woman and her opinions scare you?","commenter_a":"This just makes me laugh at how low the democrat communists have slunk.","post_message":"Donald Trump knots his ties so that they hang well below his belt buckle — often several inches, a fashion-don't so egregious that GQ recently used it as the subject of a photo spread titled, 'The one style lesson you can actually learn from Donald Trump,' columnist Eric Zorn writes."},{"comment_id":"1602419506718167","commenter_b":"Ah yes blame everything on women. Typical","commenter_a":"Maybe because women control everything and dont put out these days unless you're a fucking broke ass bum loser with no future","post_message":"So higher house prices, higher tax, higher tuition AND less sex??"},{"comment_id":"1766066213681675","commenter_b":"'@username trophy wife No. 3 was a soft porn model who also lies like through her teeth. No wonder she squints so much, trying to find her sugar daddy's pee pee!","commenter_a":"'Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s.' --Melania Trump","post_message":"'Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s,'  Charles Harder, a lawyer representing Trump, said in a statement."}]
