[{"comment_id":"920220598016177","commenter_b":"This is bull crap. The people who were slaves and all of their children are dead and gone. The country should have done more back in the 1860's and 1870's. That is when reparations should have been.","commenter_a":"Someone send this pandering jack wagon home please. He has done nothing but side with hate and strife, and stir the pot of social discord continually. Not a leader by any standard. Socialist poster child at best.","post_message":"What do you think of this?"},{"comment_id":"10153499650978132","commenter_b":"She's skanky. ...that's a door the should have stayed closed.","commenter_a":"Why can't she just retire and go away.","post_message":"Pink ambition!"},{"comment_id":"10156744379040093","commenter_b":"@username Have you SEEN Trump on the debate stage? He doesn't know policy, he doesn't think ahead, and he stumbles when it comes to content. Add to that the media penchant for tailoring questions to compliment the dem candidate, and <bam> Hillary looks like a freaking scholar on the stage. The thought makes me physically ill. On top of that, Trump has considerable damning words and actions the media and dems (but I repeat myself) will toss like confetti upon constituents. In multiple polls, Trump sits in the mid-30s, without waver. This is going to suck.","commenter_a":"Do the right thing and vote for Cruz. I write such because the thought of Trump facing Hillary in debate makes me cringe. Kasich, the newest favorite of the GOP, cannot win. I love my home state, but Ohio doesn't save Kasich from toppling.","post_message":"Not budging."},{"comment_id":"10153735094753701","commenter_b":"As long as he doesn't use it as a photo op","commenter_a":"Molly in case you wondered, he flew in on a plane THEN a helicopter. Lol","post_message":"President Obama is expected to land in Eugene a little before noon and then take a helicopter to Roseburg to meet privately with families of the #UCCShooting victims. He is not planning any public events."},{"comment_id":"1012314152218696","commenter_b":"Ungly Chelsea looks just like her father , Webster Hubble. What s slut that crooked Hillary!!!!!!!!","commenter_a":"Yes. Beauty & the beast think you can figure this out for yourself.","post_message":"Is turnabout FAIR play? This deserves about 25,000 'LIKES & SHARES'. Enjoy... @webpagelink"},{"comment_id":"10153714763793132","commenter_b":"I seriously dislike this arrogant woman who will not be kind to Shannon, she's stupid not to learn from the others. She's annoying...","commenter_a":"The color is BLUE!!!!","post_message":"The Real Housewives of Orange County star made a beautiful gesture."},{"comment_id":"1002821876430463","commenter_b":"There it is. He's going to protect her lying corrupt butt.","commenter_a":"They will only indict her if she losses Iowa and New Hampshire to Bernie then Bloomberg will join. Politics are so filled with crime it's sickening 🇺🇸","post_message":"FUBAR."}]
