[{"comment_id":"10152833954741051","commenter_b":"Here we go with those damn pit bulls again. They should be banned from the United States","commenter_a":"Show any dog love & they'll be loving..!! Shame on the owner for not providing that..!! Now a dog that could've been a great pet gets euthanized & the poor lady gets hurt. Lose/lose situation...","post_message":"This woman was taking part in the Ice Bucket Challenge in her backyard when, all of a sudden, all hell broke loose."},{"comment_id":"10154011043376615","commenter_b":"@username fighting for these POS muslims till the end. Listen hag, why dont you leave for Somalia and see how that works out 4 you. Liberal hag!!!!","commenter_a":"The hate and racism on here is disgusting! Most of you don't even know what's happened, you're just ready to jump in with your white supremacist rhetoric. Makes me sick.","post_message":"WATCH LIVE: Officials are providing an update on the victims in the attack at The Ohio State University. WPXI Aaron Martin is in Columbus and will have the latest developments on Channel 11 News at 5:00. MORE DETAILS: on.wpxi.com/OSUAttack"},{"comment_id":"867088560054064","commenter_b":"A SMART WOMAN....not that stupid one!","commenter_a":"Ann Coulter","post_message":"There’s a growing movement to have a female hero replace Andrew Jackson on the $20 bill."},{"comment_id":"1146546865428217","commenter_b":"Melania doesn't even know where she is right now...","commenter_a":"Yep preparation H.","post_message":"Donald Trump and Hillary Clinton attend the Al Smith Dinner in New York"},{"comment_id":"10153234862426336","commenter_b":"The prizes are pre set. Geesh people get a life and move along. Lady can sell it for something for fitting to her needs","commenter_a":"She's human. Just happened to be next prize. No discrimination there! Love that. She can sell it,use it for family members,etc.","post_message":"File this The Price Is Right moment under \"cringe-worthy.\""},{"comment_id":"10154533631771756","commenter_b":"Well, it's not final yet, but research has shown that kids in 3rd world countries have fewer food allergies because they have had hookworm infections. The hookworm releases enzymes that actully turn off parts of your dna that determine food allergies and other autoimmune diseases. It's in the worm's best interest to keep the host able to eat many things so that the worm can enjoy them, too.","commenter_a":"Tina Pak","post_message":"A research powerhouse attempts to solve the huge mystery of why food allergies have been skyrocketing in recent years."},{"comment_id":"10154994136091800","commenter_b":"He probably knee jerked so hard he got a bloody nose and blames it on picking it too much!","commenter_a":"Trevor Noah is a puppet... Go back to south Africa where division is welcome stop trying to divide my country with your shitty humor... #Bringbackstewart","post_message":"The Daily Show recaps President Trump’s flurry of executive orders."}]
