[{"comment_id":"10152885307051336","commenter_b":"Totally totalitarian and just plain wrong","commenter_a":"Start pushing back people!!! They care nothing about your kids.","post_message":"UPDATE: The Goochland County School Board has now voted down the controversial policy on religious homeschooling. @webpagelink   Virginia parents are outraged over a new policy that demands home-schooled children justify their religious beliefs to a school board within 30 days of their 14th birthday."},{"comment_id":"10153334889369369","commenter_b":"Crazy btch","commenter_a":"'@username Olivia Salvatore","post_message":"At 3 stories high and 3,000 square feet, this might be America's largest closet.  ['Secret Lives of the Super Rich' airs tonight at 10p ET/PT.]"},{"comment_id":"1168807776489304","commenter_b":"Mexico has a closed southern border. I'm sick of all those Mexican bigots! I love their food though.","commenter_a":"They learned it from their Parents. They're in middle school, they learned this hatred and bigotry long before Trump. The floodgates are just opening more now. 😑","post_message":"Middle school students in suburban Detroit chanted 'build the wall' during lunch on Wednesday, hours after Donald J. Trump became president-elect, according to school officials."},{"comment_id":"706978382784196","commenter_b":"MAKE AMERICA AMERICA AGAIN!!!!!!","commenter_a":"Come on Bill, let us hear the speakers, please.....","post_message":"Duck Dynasty on A&E's Willie Robertson, former Texas Governor Rick Perry, retired U.S. Navy SEAL Marcus Luttrell, actor Scott Baio and Patricia Smith, mother of Benghazi victim Sean Smith, speak at the Republican National Convention."},{"comment_id":"10155762960395354","commenter_b":"commands...???...commands what....","commenter_a":"Obama's greatest tool in his propaganda arsenal.","post_message":"Hollywood?   Check out what he told supporters...."},{"comment_id":"610480015827201","commenter_b":"I'm a New Yorker and I don't like this weather lol","commenter_a":"If you're a New Yorker you should be used to this weather","post_message":"A winter weather advisory is in effect tonight from 6pm to 6am. Meteorologist Jeff Smith talks forecasting and answers your questions."},{"comment_id":"873396172789454","commenter_b":"Taking our RIGHTS to to fulfill your agenda is not going to happen. Do you have armed security? I bet if a person walked in and brandished a weapon he/she would be taken out by a person you hired or are in connection with you and your party that is wielding a gun. You would say its protection...... We say the same thing.... It is for Protection.... While you want to make guns illegal for law abiding citizens to obtain, you will only make it Illegal to own them. Causing a bigger issue for some. People will always have guns. Ask a Drug dealer if they have issues getting illegal drugs.... NOPE. they will straight laugh at you. All you are doing is wasting taxpayer money and time. If you want to make change, ban together to reform Immigration to be fair and swift, Vote laws to tax churches to ...","commenter_a":"Real action","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
