[{"comment_id":"10154164931281162","commenter_b":"with your last name you should go back where you came from...why are you here in the US","commenter_a":"Cuba please keep Obama and his family. Also don't forget the mother-in-law","post_message":"Pres. Obama touches down in Cuba, making him the first sitting president to set foot in the country in almost 90 years: @webpagelink"},{"comment_id":"960983097307632","commenter_b":"At the last supper, JESUS told the disiples that if they had own sword, to sell the cloak to by one. Peter was carrying in the garden. This old mam does not know the BIBLE.","commenter_a":"If you own a gun you can't be a believer??? God has not revealed that to me. Where in scripture did He reveal that to you your holiness???","post_message":"Can you believe what the Pope said about gun owners? I'm stunned: @webpagelink"},{"comment_id":"907290132700573","commenter_b":"Grossly misinformed woman, too.","commenter_a":"You reap what you sow, so when your harvest comes in, don't be crying cause it ain't what you wanted. You sow perversion & corruption, you will reap your harvest.","post_message":"Will marriage equality really kill people, cause 900,000 abortions and undermine heterosexual men?"},{"comment_id":"425439057626422","commenter_b":"Can you imagine an entire supreme court of Ginsburgs? Elect Hillary and we'll have it. She is a wretched witch that is a discrace to the court and she's not alone.","commenter_a":"She woke up cranky from her nap.","post_message":"It was completely inappropriate for Justice Ruth Bader Ginsburg to attack Donald Trump’s candidacy. This is not the role of the Supreme Court, and it serves as another reminder of what we’re up against in 2016. Help me fight for the Constitution and protect the integrity of the Supreme Court by joining my Fight for the Court campaign. www.fightforthecourt.org"},{"comment_id":"10154903859534586","commenter_b":"Kill the cats!","commenter_a":"Im vegan and when i go out i try to tell at least 20 people im vegan and i dont eat gluten","post_message":"This is so accurate SHARE if you can relate! #GoVegan2017"},{"comment_id":"731413603663114","commenter_b":"Build the wall, those here illegally on good status, offer citizenship, if no, they go. Those in our prisons, bye bye, gone. Immigration problem solved.","commenter_a":"The Republican politicians not following through on campaign promises and general fecklessness is what brought about Trump's popularity, not just the immigration problem. Trump was willing to bring up the illegals when the others were not.","post_message":"Meghan McCain warned Donald J. Trump of softening his stance on illegal immigration. Do you agree or disagree with her comments? @webpagelink"},{"comment_id":"10153243710196523","commenter_b":"Give her ass the death penalty!!!!!","commenter_a":"Poor angel baby...rip. Your POS mother should now get the death penalty. Horrible!!!!!!!!","post_message":"A 33-year-old woman has been charged with murder in the death of her newborn baby girl after the child was allegedly thrown from the 7th floor window of an apartment building."}]
