[{"comment_id":"10153994015308132","commenter_b":"Chile sit her was down Jim Carey prob has Ebola and she sucked that Dick down","commenter_a":"Ignorant woman.","post_message":"Jenny McCarthy has more to say about Charlie Sheen."},{"comment_id":"10150689045559999","commenter_b":"Ha, the wife and dog get all the ink.","commenter_a":"@username who's in the photo?","post_message":"Amazon.com is doing 2 predictably unpredictable things this week."},{"comment_id":"10156217121965725","commenter_b":"@username, ur just a stupid liberal who wont open ur eyes... If u think Veterans get better treatment than these illegals ! You must be screwing one. Idiot","commenter_a":"America needs Trump for President !!!","post_message":"Notice that illegal immigrants will be given ObamaCare and free college tuition but nothing has been mentioned about our VETERANS #DemDebate"},{"comment_id":"1016766741752911","commenter_b":"@webpagelink Ninja Warrior Winner Isaac Caldiero $1 million grand prize @webpagelink","commenter_a":"That is because gayness is a disease and not a protected group. I'm so sick of gays - nee homos - queers thinking that they are the same as everyone else. They chose that way.","post_message":"\"Imagine if instead of denying a license to a gay couple, Ms. Davis had sought on religious grounds to deny a license to an interracial couple. She likely would have been fired on the spot, and no politicians would have rushed to stand by her side, no matter what her sincerely held religious convictions were.\"  - George Takei on Kim Davis"},{"comment_id":"553000848198682","commenter_b":"More illegals are prosecuted in the state of Florida than any other state for voter fraud. It goes on everywhere though. I agree, there should be further evidence required to prove you are a citizen. Maybe a place on your driver's license should be reserved for this information. Not only are these illegals breaking the law to come here, they are electing people like Marco \"The Chihuahua\" Rubio to be their senator. Oh, and Google: \"Rubio Gay Arrest\" to see what Rubio likes to do in his spare time.","commenter_a":"Voter fraud has been proven in tx. People voting for trump are seeing their computer vote switched to Rubio, and cruz. And let's not forget, that the kkk is backed by the democratic party.","post_message":"We are #WINNING - #TrumpTrain! Thank you for your support. Lets keep this going! WE WILL MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153665284600163","commenter_b":"and what's wrong with PUSSY? I never had any complaints about it","commenter_a":"What a Bunch of Wussies .. What happened to free speech and \"Sticks and Stones may break my Bones .. But Words will never Hurt Me \" ?????? Damn we are becoming such a Pussy Country.","post_message":"Sad to say, this comes as no surprise... @webpagelink"},{"comment_id":"10153191850561051","commenter_b":"Bitch","commenter_a":"Here's a perfect example of \"children aren't born racist, they are taught racism\" That woman should be ashamed of herself.","post_message":"When a mom heard what this lady was saying to her kids, she took out her phone and began recording."}]
