[{"comment_id":"10154772615548701","commenter_b":"Od the bitch","commenter_a":"U fux'n C U N T.... Let me c u any where... U will wish ur momma swallowed the load u were conceived...","post_message":"A Washington mother is accused of giving her three young children heroin to sleep. One of the children told investigators his parents gave him and his sisters the \"feel-good medicine.\""},{"comment_id":"10156070915820354","commenter_b":"We all know what Jorge Ramos is full of !!","commenter_a":"No, sir you are a loud mouth rude, obnoxious piece of shit!","post_message":"Reporter?   Or Activist?"},{"comment_id":"10154249392839445","commenter_b":"date on picture is July 2008 took almost 8 years to figure out he was a fraud no wonder this country is going to SH-T","commenter_a":"Shame on him","post_message":"In his application for disability benefits, John Caltabiano claimed he couldn’t drive, cook for himself, exercise at the gym, move around his house or even shave without help."},{"comment_id":"10152536717736680","commenter_b":"Stop marriages of terrorists n force","commenter_a":"Speaking out against, or killing? Those are two very different things.","post_message":"From POLITICO Magazine: Police risk their lives in service. Does that mean we shouldn’t speak out against them?"},{"comment_id":"10153755826404062","commenter_b":"Shut up racist b*tch","commenter_a":"He is not the president and she is not the first lady he is Mr George Bush and his mama, I mean his wife, since you Obama haters want to go there!","post_message":"Give a big howdy to President George H.W. Bush and wife Barbara, who are out enjoying RodeoHouston today! :)  Photo: RodeoHouston  RodeoHouston news: @webpagelink"},{"comment_id":"10150728672209999","commenter_b":"Well rebecca I'd recommend finding a director with more credibility before trying to gain traction on this movement. I'm not saying they're unjustified in their claim but Spike Lee is a pos","commenter_a":"Spike Lee hasn't made a good movie in over a decade so who really cares.","post_message":"The outcry over the nomination of 20 white actors, and no black ones, for the coming Academy Awards gained momentum on Monday — MLK Day — as Spike Lee and the Jada Pinkett Smith announced that they wouldn’t be attending the ceremony."},{"comment_id":"10154456636350695","commenter_b":"@username - you sir have won the internet today! That is hilarious!!","commenter_a":"What didn't this guy do during the rampage? I'm sure we're gonna hear he saved 15% on his car insurance next.","post_message":"NEW: Authorities say the shooter texted his wife while he was hiding in a bathroom, asking if she'd watched the news..."}]
