[{"comment_id":"2017999998425158","commenter_b":"No. That was Colin Powell.","commenter_a":"Actually, I'd rather see him choose someone like Condoleeza Rice!! She's a highly Intelligent, Accomplished diplomat and a true conservative.. It's my opinion that because of Her past Experience she's emmininty Qualified for the VP. Position.!!.. And could bring much needed strength and unity to Trumps campaign and the Republican party.. It would also help to put to rest the Unfounded accusations against Trump regarding women.. She's also not part of the existing establishment.","post_message":"Would you like to see him as VP?"},{"comment_id":"10153657606683984","commenter_b":"Bitch--boycott her--hurt her where it counts","commenter_a":"\"Big Mike\" is 200 lbs (after autopsy) of year old worm food. Nothing more no matter how many highways you block.","post_message":"This was probably NOT the outcome Beyonce was expecting when she shared this..."},{"comment_id":"10155089942751037","commenter_b":"Probably a 1% chance I'm wrong, 99% that go clubbing with mom are losers looking for a free ride!","commenter_a":"They'll all end up as Uneducated Ho's, sitting in the corner of a club by themselves when the looks are gone!","post_message":""},{"comment_id":"10152898754710950","commenter_b":"For real, dude. She rolled up talking shit. Lmao!!!","commenter_a":"Why is she riding a motorized wheelchair if she can brawl? What a loser and gets the kid involved too. This will be used as an example of spandex white trash by the comedians.","post_message":"In a video of the incident, two women are heard yelling at one another before the argument escalates and gets physical. Then a 6-year-old gets involved; at one point, the boy is seen hitting a woman with a shampoo bottle as the women wrestle on the ground."},{"comment_id":"1628196954146655","commenter_b":"It is in the constitution !!!!","commenter_a":"Yes","post_message":"POLL: Do you support the 2nd Amendment? Comment YES or NO."},{"comment_id":"10153275884859877","commenter_b":"Pigs don't eat pizza.","commenter_a":"It sounds pretty delicious but obviously racist.","post_message":"NY pizzeria apologizes for promoting racist ‘Pic-a-Nika’ pizza - but some of those ingredients are suspect. Grio fam, what do you think of the owner's response to the backlash? Do we believe his explanation for the \"mistake\"?"},{"comment_id":"820316618158915","commenter_b":"Kick his ass out of this country,","commenter_a":"Black price of shit","post_message":"Trump Hating Thugs Split On Flag… Look What Happens Next [VIDEO]. If he was a real man and doesn't like this country or our flag he should leave. Do you think he should deported?"}]
