[{"comment_id":"10154535880412235","commenter_b":"Get your story straight. Us woman shouldn't raised our hands on a man and expect not to get hit back. That's what's wrong with our society.","commenter_a":"She's doing to him the same thing that easy-to-use girl did to Kobe Bryant. She was \"admiring\" his jewelry a little too damn much.","post_message":"THIS JUST IN..."},{"comment_id":"858797117508627","commenter_b":"& the rich bastards don't give a shite.","commenter_a":"rockthevote.com","post_message":"Unless we take bold action to address climate change, our children, grandchildren and great-grandchildren are going to look back on this period in history and ask a very simple question: Where were they?"},{"comment_id":"10153612780139614","commenter_b":"Breaking the law is a crime, and that includes illegally immigration. I get it. However, in this country technically only the natives whom they/we (Americans) have taken all their lands away. Any comments ??","commenter_a":"what hell wrong with Gov Mexico, I have been there and not doing dam thing to help county shame Gov.to much Durg going and lost lost people the USA should be Buy it. There lost of them doing wrong in USA. only God fix it not Mexico .","post_message":"Donald J. Trump has again upset immigration activists after he released details Sunday on his plans to deport all \"criminal aliens\" and force Mexico to pay for a wall on its border with the U.S. The GOP frontrunner's immigration plan includes overturning a law that grants citizenship to people born in the U.S. and put stricter limits on legal immigration. His plan is based on three core principles: that the U.S. must build a wall across the U.S.-Mexico border, that immigration laws must be fully enforced and that immigration plan must improve jobs, wages and security for all Americans. Read KTLA's story here: @webpagelink"},{"comment_id":"850932761669644","commenter_b":"Send her over better yet send her kids not mine","commenter_a":"I hate to break this to some people but the only Americans that are there any legitimate threat from Isis are the Americans were going to be sending over there..... Somehow Obama has managed to kill over 10,000 Isis fighters by dropping bombs without one single American military casualty..... Why change the game plan now?","post_message":"Do you agree with Rep. Barbara Lee?"},{"comment_id":"1045431208809965","commenter_b":"This is not news worthy.","commenter_a":"Who cares?","post_message":"BREAKING> Beijing wins bid to host 2022 Winter Olympics. China's capital will be first city to host summer & winter games."},{"comment_id":"10154047067166756","commenter_b":"I hope you didn't watch the trailer. Lol","commenter_a":"WARNING:This article gives out way to much information.","post_message":"Leonardo DiCaprio was part of a cast that didn't have to fake being freezing or exhausted during the eight winter months spent in the Canadian and Argentine wilderness. Still, all anyone wants to talk about is the bear attack, says NPR film critic Bob Mondello."},{"comment_id":"1357303384289688","commenter_b":"Well how black do you have to be to be considered black... Since you have a PHD in biology","commenter_a":"\"If celebrating my roots and culture during Black History Month made anyone uncomfortable, those feelings were there long before a video and long before me,\" - Beyonce I totally agree!","post_message":"\"I'm an artist and I think the most powerful art is usually misunderstood.\""}]
