[{"comment_id":"1626892184281597","commenter_b":"@username I didn't know whiney little bitches played hockey...","commenter_a":"The whole irony in this, is that Trump knew he was never going to be able to get Mexico to pay for the walll...and now im just waiting for some trump supporter to justify this and or blame Obama.....","post_message":""},{"comment_id":"10154109773821491","commenter_b":"I watched the video. And I know horrible treatment of animals in factory type production of food. I know a guy right after high school that had a job for one day catching two chickens at a time and melting their beaks with a hot iron. That was done so they wouldn't peck at each other. But that's not what the post is about.","commenter_a":"One egg yolk has 62% of your daily allowance of cholesterol. One strip of bacon has 3% of your daily allowance of cholesterol.","post_message":"Eat those yolks, folks."},{"comment_id":"10153932824095575","commenter_b":"If you have bones in your closet be sure they will come out.","commenter_a":"BS alert!","post_message":"National Enquirer parent company refutes Ted Cruz--- DONALD TRUMP had nothing to do with our story...."},{"comment_id":"10152850363352217","commenter_b":"Women should be allowed to wear what they want to. It should be a free world for men and WOMEN","commenter_a":"This is the silliest thing ever!","post_message":"Why two opposing campaigns about what women wear are spreading across the Arab world bbc.in/1LU4ka8"},{"comment_id":"10153842818632483","commenter_b":"The girl ran right up and smacked him.........you go girl !!!","commenter_a":"He needs his nuts cut off and ducked taped in his mouth till he bleeds out.","post_message":"Surveillance footage shows an oak tree at Toomer's Corner being set on fire after Auburn's win over LSU Saturday night. Read more here: @webpagelink"},{"comment_id":"1038359476176309","commenter_b":"Hope they catch her she is a predator","commenter_a":"Where Racist Al Sharpton? If he is against HATE crimes then why wouldn't he and his Racist organization make a big outcry about this hate crime. Oh! I must be dreaming......... For a racist pig like Al and his followers to make a peep to the news media about such a HATE crime, it would have to be a white on black crime with white police men cheering on the beating.","post_message":"Life in Obama's America  Disturbing video of a white woman (holding her baby) being attacked by blacks, as blacks film and laugh at the attack."},{"comment_id":"1655285394531583","commenter_b":"Salty tears are most delicious. Is it January yet??","commenter_a":"A BIG thank you to the 53% of American registered voters who chose NOT to vote; because of YOU and only YOU, Donald J. Trump will be our next POTUS.","post_message":"This is the real reason Barack Obama is going against Vladimir Putin, two weeks before he leaves. This is what the mainstream media won't tell you. Make sure every American knows the truth."}]
