[{"comment_id":"1023562641110247","commenter_b":"Conservatives can also be whiny. Like, OMG THE IMMIGRANTS ARE STEALING OUR JOBS OH NO I HAVE TO GO RE-TRAIN. I'M ENTITLED TO JOBS HERE.","commenter_a":"I don't know about my liberal comrades, but I went to work, paid bills, look after my kids, helped my neighbor fix his car, and drank. In fact I don't know a single liberal friend that did any of those","post_message":"It's a scary thought..."},{"comment_id":"10153717178056002","commenter_b":"why not just peep in their windows?? people are falsely put on these so called \"lists\"","commenter_a":"There already is one of these lists. When a Employer does a deep background check it shows everything. You and I can go on OTIS with the right info on a person like birthday date , ssn and full name you can get all of their info.","post_message":"Two boys from different families are abused by the same woman. See what this mom is doing to protect other children."},{"comment_id":"1013753742085664","commenter_b":"@username Babies suck!","commenter_a":"I used to dislike Clinton... I was uninformed and knew little about her other than what the right wanted me to believe. After some research and learning about all of her work on behalf of minorities, working families, women, and children over the course of her life and seeing her deal with adversity and downright deplorable behavior with strength, class, and grace, I am PROUD to give her my vote and my full support. I'll be voting Democrat down the ballot to ensure not only that she is elected, but that she has a Congress she can work with - not one hell-bent on obstruction. There is a reason she polls so much higher with EDUCATED people. #imwithher","post_message":"For 45 seconds, a drenched Hillary Clinton abandoned her script and let down her guard in Florida: @webpagelink"},{"comment_id":"10153368528042217","commenter_b":"i might put some tinfoil hats on eBay...","commenter_a":"if this crap conspiracy rubbish was true, the yanks would of asked us to extradite him, which we would have done. its that simple.","post_message":"A UN panel will conclude the Wikileaks founder is being \"arbitrarily detained\" in the UK, the Swedish foreign ministry has said."},{"comment_id":"10153209922201491","commenter_b":"Yes, let's leave the talk up to celebrities. Why should parents teach their kids anything? Brilliant, world.","commenter_a":"Admins, please contact me through inbox messages","post_message":"Jessica Biel: \"We want girls to know what their [body is going through] so they don’t feel scared or ashamed or gross.\""},{"comment_id":"10153811362959087","commenter_b":"She's too busy partying","commenter_a":"Dean Forest: your party is losing what it needs more of. Susana Martinez will seitch to the Dems if trump isn't careful.","post_message":"A Hispanic official with the Republican National Committee is resigning after telling coworkers she is uncomfortable in a job where she has to work to elect Donald Trump."},{"comment_id":"10152917419231051","commenter_b":"Seriously the Husbands deserve same treatment. I am not saying the mistress didn't have it coming . Chinese ladies are crazy !!!","commenter_a":"I don't get it! What about her douchebag husband!!? He's the one married but still decided to sleep with her sooo....","post_message":"This wife decided to track down her husband’s mistress and make an example out of her."}]
