[{"comment_id":"10153469105041746","commenter_b":"Lol this chick gets her history from Hamilton","commenter_a":"Think about these 2 statements: \"Make America Great Again,\" and \"America Is Not Great.\" If you support the first one, but are angered by the second, you need to take Logic 101. As for the statement on this woman's hat, \"America Was Never Great,\" I strongly disagree. I saw Hamilton: An American Musical and there was a time when greatness abounded. Since then, we've alternated between great and not so great, sometimes concurrently. It's a big country!","post_message":"Meet the 22-year-old between the controversial hat."},{"comment_id":"10154720750937235","commenter_b":"Michael M you r an ass hole !!! No one cares what you think !! You r ugly and evil with no soul just like Hillary !!! You and Meghan r made for each other !!! You r a disturbed individual !! Making fun of hard working people struggling because of Obamas policies !!!. We all should boycott. All your crap . I will . Those hard working people paid to see your movies ! Thats how u got rich !! Thanks to the deplorable's. You 😤😤ASSHOLE !!","commenter_a":"Michael Moore will do anything for media attention and money.","post_message":"You've no doubt seen folks in your Facebook feed who believe Michael Moore is making the case for Trump.   That is a LIE."},{"comment_id":"853290011375903","commenter_b":"Actually, the influx of all of the communicable disease carrying illegals getting through our open borders IS his fault! Crooked teeth, acne, and cancer are not communicable diseases. Wake up.","commenter_a":"Oh yeah, blame it on Obama, he's also responsible for crooked teeth, acne and cancer... such an awesomely powerful human..all hail superpresident!!!","post_message":"What do you think about this?"},{"comment_id":"914001441995307","commenter_b":"Awsome woman!","commenter_a":"Barry Sheldon this was what I was talking about earlier","post_message":"BREAKING VIDEO: Mother Beats Her Son When She See Him Rioting in Baltimore  Mother of the Year Award? She goes straight hood on her son.   @webpagelink"},{"comment_id":"10154203374126077","commenter_b":"Anita Mondragon I called 7 news, they immediately started investigating. Then once they had the tip everyone else ran with it.","commenter_a":"Oh so now 9 news wants to cover this. Tried to get ahold you guys and nothing. Guess now you'll pay attention when people try to get a hold of this station on news.","post_message":"Westminster Police believe 31-year-old Jarred Strenge killed a woman in her 30s last night. Anyone with information about his whereabouts is asked to call Crime Stoppers at 720-913-STOP."},{"comment_id":"10155266404471756","commenter_b":"I bet the indigenous Indians would love all of us to go home and leave their water alone !!!","commenter_a":"Bull! Obama and Clinton too!","post_message":"Protesters 'March to the Arch' to oppose Trump immigration order"},{"comment_id":"421520308036263","commenter_b":"What is this group that has an American flag on the ground to be trampled ?","commenter_a":"stupid ASS COPS.","post_message":"\"I went to pick it up because it doesn’t deserve to be on the ground.”"}]
