[{"comment_id":"1840578192829386","commenter_b":"WORDS DON'T CHANGE THE FACT! TRUMP IS YOUR PRESIDENT! LEAVE THE USA!","commenter_a":"Keep trying thumb suckers","post_message":"ALERT...."},{"comment_id":"843332055796851","commenter_b":"CRIMINAL","commenter_a":"LIAR","post_message":"Hillary Clinton doubled down on her assertion that the FBI declared her public remarks on the email scandal “consistent and truthful,” despite independent fact-checkers concluding otherwise. @webpagelink"},{"comment_id":"10153437491481130","commenter_b":"Arrogant bitch","commenter_a":"Hilary is a dumb lying bitch!!","post_message":"Sick burn, Hillary Clinton!  Video: NowThis"},{"comment_id":"10153095297087908","commenter_b":"What's your problem with little girls?","commenter_a":"A bunch of bitchy little girls.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"642968752533659","commenter_b":"Amazing that this man who is causing all this problem is in cahoots with the Clinton foundation. Also the Muslim brotherhood. Look it up. He's also a lawyer who helps to bring in people illegally. Real 'good'guy...and why was he attacking Trump? Trump did not want the war nor was he president or a senator who voted for the war. Nor is he the president now who has let ISIS run amok.","commenter_a":"He doesn't need to apologize. Hillary Clinton needs to apologize. If we did not go to Iraq their son would still be Alive. Hillary is to blame for running arms to muslim brotherhood. Khan attack Trump on national television. Trump responded. And cnn is Hillary Clinton fan club. Lol","post_message":"'Is it difficult for your father to apologize?' a co-host asked Eric Trump"},{"comment_id":"10153248545727217","commenter_b":"The smog isn't real. It's just a liberal conspiracy. Keep on polluting.","commenter_a":"And yet wherever they go they reply their failure productive system: massive production and consumption with no protection of the environment....","post_message":"Smog 'red alert' in Beijing"},{"comment_id":"10152938707421130","commenter_b":"So did God fall of his throne and let Obama take over until he's better . I think not Obamas words are and have the hissss of a ankle butting supreme.","commenter_a":"I agree with the president. BB is a dick","post_message":"President Barack Obama tells HuffPost that he dismisses Israeli Prime Minister Benjamin Netanyahu's backtrack on Palestinian statehood."}]
