[{"comment_id":"10156410644080725","commenter_b":".... And thats why im voting for Bernie Sanders and not a wealthy racist biggot like yourself.Mr. Trump our country doesnt need you.. you talk about about immagrants but all your wives were immagrants? What are you but an immagrant to this country yourself! Unless your native but that would be news to us! What tribe you belong to?? I.D cards to all the muslims in this country? Is this Nazi Germany???","commenter_a":"Trump is like a pre-PC candidate! So refreshing!! I remember feeling just a leetle bit awkward at first. That made me realize just how far we've fallen! #TeamTrump2016 #MakeAmericaGreatAgain #DitchAndSwitchNow","post_message":"People have got to stop working to be so politically correct and focus all of their energy on finding solutions to very complex problems!"},{"comment_id":"10156516063715206","commenter_b":"Trump is a pig and she stuck it to him with class.","commenter_a":"Watch yourself here on the video without sound even...you come off snobbish arrogant and grumpy and that is exactly what Trump meant by your face. You are well spoken, but you are not a happy person obviously. Not one smile! Mostly grimace. As to your subject matter-good for the blows to Hilliary and putting Christie in his place. But your arrogant head bobbing when talking about meeting foreign leaders etc. is just overboard. You better get on board with Trump, only the media and establishment hate him and are tryin their best to convince audience that he is hated. VOTERS want him!!! Voters love him!!!","post_message":"Putin won't listen to more talk. We need to show him there's strength, leadership, and courage on the other side. Pitch in $3 to rebuild America's role in the world.   @webpagelink"},{"comment_id":"1145540435508072","commenter_b":"No job , 6 kids , no husband . Stop !","commenter_a":"Waited in line for six hours if you would've been working kids would've ate","post_message":"Entitlement Mentality: Welfare Recipients React to Food Stamps Being Cancelled.  This shows everything wrong with the entitlement mentality."},{"comment_id":"1178312252188803","commenter_b":"The site did not breech their privacy......they all willingly made the choice to put their name and information on there to cheat on their spouse......the site did not do anything negligently....the hackers got in.....they have been able to get into top secret government systems.....how is a website for cheaters supposed to be expected to have better security than the government? The hackers are the ones at fault.....and the idiots who allowed themselves to be exposed by trusting something as insecure as the internet to cheat on their spouse!","commenter_a":"I disapprove of what they did but the site breeched their privacy.... Hope every penny goes to those that were cheated on","post_message":"All allege breach of contract, negligence and violation of various state and privacy laws by Ashley Madison and Avid Life Media LLC"},{"comment_id":"10153555838691336","commenter_b":"Bring back W. I want the border sealed. Military USA should patrol its own borders. No longer want any language spoken in my country. No longer want to know that the 'immigrants' get to bring everyone. No Welfare, no SSA because you have a work history while an illegal immigrant. I want the next President to Stand for American Values. Jeb Bush only stands for Obama's values. Open Borders and Anyone can use our welfare system.","commenter_a":"he needs the help.....","post_message":"Yesterday, Jeb Bush told Neil Cavuto that he thought his debate performance \"went fine.\"  Do you think so?"},{"comment_id":"10153067391792217","commenter_b":"One day all Europeans will see how big mistake s to accept those who come as victims and in the future their children will try to impose sharia law","commenter_a":"It's a big mistake Europe is doing. They will regret in 10 yrs time. Why can't the arabs countries take them. Sorry for the Europeans. They will lose their freedom for sure.","post_message":"The plight of people trying to reach Europe is moving many to declare \"Refugees Welcome\"."},{"comment_id":"10153100399077377","commenter_b":"We The People, continuously have said, \"Impeach Obummer Now!\" He has by far surpassed any former president with impeachable offenses, but not one congressman has started the process! Do we sit here yelling in vain? What are we waiting for? We all know he is not looking out for our best interest. And yet our congress wonders why Donald Trump is FIRST in All POLLS! Let's MAKE AMERICA GREAT AGAIN! VOTE FOR DONALD TRUMP","commenter_a":"They are always talking about working and being hard working. When someone tries, the republicans shut them down. Make up your freaking minds , republicans. Or is it you people to work at what you say, for the pay you say, when you say, without any remarks or compensation . That's called slavery. Republicans ended that years ago.","post_message":"Former House Majority Leader Tom DeLay told Newsmax TV  that if President Barack Obama implemented a plan to require background checks on some gun sales by executive order and without congressional approval, the House should consider impeachment proceedings. Like, Share and Vote in Newsmax’s online poll: Do you support Obama’s gun control? Respond here: @webpagelink"}]
