[{"comment_id":"10153315951826336","commenter_b":"Start the engines and suck her up like a seagull.","commenter_a":"What's wrong this photo? Nothing I can see....","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"731413603663114","commenter_b":"Build the wall, those here illegally on good status, offer citizenship, if no, they go. Those in our prisons, bye bye, gone. Immigration problem solved.","commenter_a":"The Republican politicians not following through on campaign promises and general fecklessness is what brought about Trump's popularity, not just the immigration problem. Trump was willing to bring up the illegals when the others were not.","post_message":"Meghan McCain warned Donald J. Trump of softening his stance on illegal immigration. Do you agree or disagree with her comments? @webpagelink"},{"comment_id":"10150977696104999","commenter_b":"No, the representation in the Senate is not of the people, but of the states. Each state has two Senators. That's equal representation. If you want representation of the people, you're looking in the wrong chamber.","commenter_a":"It is a very good thing that urban power centres cannot set the taxes of their rural neighbours. If they could the rural producers would become slaves and would have no quality of life in the pursuit of urban consumers actively destroying rural methods of negotiation. This is NOT a failing of the system, it is exactly why the system is in place. It is a good thing that farmers are not economic slaves of nearby cities.","post_message":"In the U.S. Senate, the least populous states are now more overrepresented than ever before."},{"comment_id":"10155959716910725","commenter_b":"One last word....Yes AMERICA is gonna start showing her TRUE COLORS AGAIN!! Prepare!!","commenter_a":"For the first time in many MANY YEARS, my wife and I think we may very well take our country back!! GO TRUMP!!!","post_message":"We must stop the crime and killing machine that is illegal immigration. Rampant problems will only get worse. Take back our country!"},{"comment_id":"10155804568635725","commenter_b":"Tell Andre ignorant ass to just go kill himself!! You never hit a girl you shine!","commenter_a":"Lmao attacking him?? it's a Football f**** player against a girl. Did u not see how she threw that punch lmao how is a grown ass man/athlete gonna look w that argument on court?? Lol and why didn't he leave her alone after she seemed to push him away?? Cuz she said the N word!!! Ha so it all makes sense now!!! Oh my god someone bring the guillotine!!! Not the N word!! Bring all the rappers too!!! This is an injustice!!! Lol","post_message":"Florida State University quarterback De'Andre Johnson is telling his side of the story of the now-viral video where he is seen punching a woman in the face at a campus bar, including what he says the woman said to him right before the attack ----> @webpagelink"},{"comment_id":"1050442818384698","commenter_b":"At the least, his judgement is impaired............his bond to the Clintons got in the way of his judgement.............","commenter_a":"Fire him he is a crook","post_message":"Should James B. Comey, Jr. continue as Director of the Federal Bureau of Investigation? Is he professionally compromised? Does Mr. Comey continue to enjoy the trust and confidence of the American people, the rank-and-file of the FBI, and the thousands of government employees holding security clearances and access to classified information? Read this op-ed by Judicial Watch Director of Investigations Chris Farrell below."},{"comment_id":"10155397159458797","commenter_b":"And no telling how many more he has! Since he likes to pull on ladies p___y. Freak!","commenter_a":"Since you all won't acknowledge our formal president as the \"First Black President\" i will only acknowledge trump as the FIRST PRESIDENT WITH THREE BABY MOMMAS' BAHAAAAA! HAPPY BLACK HISTORY MONTH!!!","post_message":"On this first day of Black History Month, we recognize former President of the United States, Barack Obama. He was the 44th U.S. President and the first African American to serve as president."}]
