[{"comment_id":"1601468970152449","commenter_b":"Victoria SD you stupid bitch","commenter_a":"If only Khan talked about Islamic terrorist attacks as much as he talks about DJT - using his son's death to score points for a flawed ideology! Damage control!","post_message":"Khizr Khan, the father of a slain Muslim soldier, says Donald Trump is \"incapable of empathy.\""},{"comment_id":"10152939984116680","commenter_b":"Right Dave, when he was running in 2008, did you support him then?? Do you remember what horrible things Dems said about McCain ?","commenter_a":"Im a Democrat embarrassed by Trumps remarks!!!!","post_message":"In a stream-of-consciousness address, the real-estate mogul riding high in Republican polls sticks to his favorite targets."},{"comment_id":"10152683418148067","commenter_b":"Don't worry. You're 10 times better looking than this homely chick.","commenter_a":"I'm 20 and my biggest accomplishment is not setting the house on fire.","post_message":"While her peers are chatting about boys and clothes, this teen is texting the CEO she hired to run her growing business. @webpagelink"},{"comment_id":"10155026863931509","commenter_b":"she doesnt look that bad for a transgender","commenter_a":"What a beautiful woman our first lady is.","post_message":"First families join hands for a rendition of \"The Battle Hymn of the Republic\" during memorial for slain Dallas officers. @webpagelink"},{"comment_id":"10154004343429440","commenter_b":"@username and if you call me sweetheart again, I will find you and feed you your balls. \"Figuratively\"","commenter_a":"Trump has the worst politfact record of any candidate for president ever. Hillary is among the best. Making all of your reports 50-50 so you don't have to listen to Republican whining distorts the truth","post_message":"Denver Post Politics takes a look at how Hillary's statements stack up to the facts."},{"comment_id":"10153589793400329","commenter_b":"10154197025200954Mary Lu10154879708717248","commenter_a":"Ryan Bere still wanna do this?","post_message":"Jaws IRL."},{"comment_id":"10153022390127217","commenter_b":"Stupid, sexy, popular flanders !","commenter_a":"@username 👍🏽","post_message":"Let's hear some noise for Okilly Dokilly"}]
