[{"comment_id":"10154814539690470","commenter_b":"She's still a thief genius.","commenter_a":"Sucks to be a thief.","post_message":"A woman in Pennsylvania died after she got her arm stuck in a clothing donation bin, and was left dangling above the ground for hours. Judith Permar, 56, used a stool to reach into the bin on Sunday before it collapsed, breaking her left arm and wrist, according to Mount Carmel police."},{"comment_id":"1504784736221446","commenter_b":"U sound like a bitch","commenter_a":"And the award for the most useless attempt at contribution to society goes to.... The author of this article. Wonder if that student debt you got from studying journalism at university was worth it. Merry Christmas","post_message":"As you can imagine, it did not go well."},{"comment_id":"1487251671334957","commenter_b":"That bitch could stick her face in dough and make gorilla cookies !!","commenter_a":"No matter what she wears it looks like it came off the rack at Walmart and she looks like aunt Esther. The only problem is us taxpayers are paying the big bucks for her to look like a curtain hanging over a big black window","post_message":"I'm SICK of my hard-earned tax dollars funding their lavish lifestyles!"},{"comment_id":"10158515262905725","commenter_b":"Gomez u bitch u","commenter_a":"fukin who're","post_message":"All eyes were on Melania as she stepped into the ballroom."},{"comment_id":"1645437002375216","commenter_b":"i like thin women but umm. no, just no","commenter_a":"That is just grotesque","post_message":"Hot or not?"},{"comment_id":"10152987522331336","commenter_b":"Hahaha stupid white girls","commenter_a":"Wish we could deport him..","post_message":"Moments ago, President Barack Obama vowed to appeal a federal judge’s ruling to block executive action on immigration. @webpagelink Don't miss Texas Governor Greg Abbott's response tonight at 10p ET on 'Hannity.'"},{"comment_id":"841833905948136","commenter_b":"What utter rubbish, it's the same beautiful country i have loved all my life & watched change under EU dictatorship & when my 88yr old father says \" this isn't what we fought for \" i know we've done the right thing , please don't panic people after a bumpy ride calm & Great Britain will be restored","commenter_a":"Spengler predicted this.","post_message":"\"This is not the country it was yesterday. That place has gone forever.\""}]
