[{"comment_id":"10152928005661615","commenter_b":"Btw, @username, go blue!","commenter_a":"Hahaha haha hahaha haha hahaha haha hahaha haha hahaha! !!","post_message":"“It hit my wife and knocked her over, and punched my daughter”   The 'it' was a DOLPHIN that jumped out of the ocean -- and into the family's boat, breaking the woman's ankles."},{"comment_id":"614194488771130","commenter_b":"Good for them and if was some other county's,or orig,before 1860 or maybe south it before civil main thing is who cares when was adopted by south or when ain't THERE flag now belong's to the SOUTH and USA.now.AND GO SOUTH go TELL THE IDIOT'S TO Get LOST UR FLYING IT FOR EVER OR ANYONE ELSE WANT'S TO FLY IT in THIS CNTRY'S 50 not 57 or 58 states u idiot abomination it's 50","commenter_a":"fantastic!!","post_message":"NASCAR fans at Daytona refused to hide their support of the Confederate flag.  This is true patriotism. They are proud to be Americans.  Do you support their refusal to back down?"},{"comment_id":"405246192933309","commenter_b":"To many people have nothing to do but bitch","commenter_a":"What is wrong with it, it could mean God bless or whatever God you pray to","post_message":"Should this religious phrase have been banned?"},{"comment_id":"10156563653020652","commenter_b":"Man, my dog is always happy. I learn from my dog, so now I am always happy. “We understand how dangerous a mask can be. We all become what we pretend to be.” ― Patrick Rothfuss,","commenter_a":"@username - gedink jy sal ook hierdie interessant vind :)","post_message":"What can we learn from how animals cope?"},{"comment_id":"10156236766360354","commenter_b":"WHAT??? It doesn't designate the Black Lives Matter and the Black Panthers as terrorist organization for constantly calling on blacks to kill cops and white people and CAIR, but they want the NRA designated as one even though they threaten no one? This is absolute bullshit & I'm so tired of the attack on our 2nd Amendment rights!!! We MUST stand against this!","commenter_a":"NOT","post_message":"Here's how far the Left is going with this..."},{"comment_id":"1038152239553568","commenter_b":"She is dumb","commenter_a":"Guess she will have to work for a living now","post_message":"This model lost everything."},{"comment_id":"10152883747411051","commenter_b":"Feel attractive and beautiful? Get out. So a 16 or 18 year old kid gave her that? Sick. Lock her ass up.","commenter_a":"Just wait","post_message":"A teacher who was busted with not one, not two, not three, but four students is now looking at a lot more jail time than she initially realized."}]
