[{"comment_id":"1339079532789860","commenter_b":"Yo she cheated she should be feed the next chick","commenter_a":"MAKE HER EAT A BAG OF THEM","post_message":"Chip Roulette: Who Will Eat The Carolina Reaper Chip, The World's Spiciest Tortilla Chip, First?"},{"comment_id":"10153633737712464","commenter_b":"Go Cruz go. Tell the facts and let the media put a liberal spin on it. Planned Parenthood was meant to be racist by stopping more poor from the welfare rolls. \"HA!!!!\" They will say,\"It was an attempt to keep the Black Community from expanding the Voters Rights', or something like that. That's why Planned Parenthood buildings are in poor economic ares and not down the street from the $600,000-2 million dollar homes. Don't have to waste the fuel bills on buses that far out. Economics for the city. See it's not about lives. IF \"BLACK LIVES MATTER\", why is there even a dialogue about the killing of souls.","commenter_a":"Smarti - I aam not really interested in PP and I am sure you are looking up everything you can find to repudiate what Cruz says. Good for you if you think PP is on the up and up. I just don't understand paying all that money when it is not a gov operation. If it is a private business - great - let them fund themselves, don't use our money to help pay$ 600,000 salaries along without mentioning all the other expenses. I read $1.2 mil spent on things other than women's health. I really don't care about that stuff. I am more interested in what is going on in Syria etc.","post_message":"It says something about just how corrupt this administration is that there is not a soul on earth that believes the Obama Justice Department would even begin to investigate Planned Parenthood."},{"comment_id":"10154004343429440","commenter_b":"@username and if you call me sweetheart again, I will find you and feed you your balls. \"Figuratively\"","commenter_a":"Trump has the worst politfact record of any candidate for president ever. Hillary is among the best. Making all of your reports 50-50 so you don't have to listen to Republican whining distorts the truth","post_message":"Denver Post Politics takes a look at how Hillary's statements stack up to the facts."},{"comment_id":"10154356306731545","commenter_b":"Nude models are not the same as porn. If so no young person would be allowed in the best art galleries in the world. However I agree, I would not show my child porn.","commenter_a":"If our First Lady can be a print \"porn\" star, you can be a teacher! Don't let anyone tell you different!!!! :)","post_message":"A teacher at an all-girls academy in Dallas ISD says she lost her job after word got out that she appeared in pornographic films over a decade ago."},{"comment_id":"988198774550796","commenter_b":"shes to stupid to even understand her own thought process...","commenter_a":"Learn self control, honey. Everybody was quick to pull out phones and record it! I have great respect for the lady who was talking to her but I have more for the woman who got up and got her kid out if there. This was just stupid, shouldn't of happened. Looking for a pay day.","post_message":"“She wouldn’t leave when asked and became more agitated throwing a paper she grabbed from over the counter and pulling away from PennDOT officials.”"},{"comment_id":"10156613595445354","commenter_b":"I'm amazed at how ignorant she is!!!","commenter_a":"Wasserman Schultz is what you cal and air head. The elivator does not reach the top floor.","post_message":"\"...it’s incumbent upon us to stand with our Muslim brothers and sisters and make sure that we can push back hard...\""},{"comment_id":"10156192968210354","commenter_b":"This witch has lied, cheated and crooked everything she come in contact with in Washington.....she deserves to be in prison but not as long as the democrats up hold her, she will continue to get away with everything.","commenter_a":"Obombass will back Biden but only if obombass can vice president..... dictator","post_message":"***BREAKING*** \"...raises the possibility that the Democratic presidential candidate’s correspondence eventually could become public.\""}]
