[{"comment_id":"10153189307188352","commenter_b":"I Understand hw U feel. U will ask d Grace frm God 2 give U a woman,I mean a \"Virtous Woman\". God wil give U a Good woman as a Wife. Remember d Bible says, He who finds a Wife,finds a good thing n Obtain Favour frm God. U jst av to b HAppy wit Urslf.","commenter_a":"How is that when everything you are she just crap on me rip my heart out and then go to our church act like I don't even exist understand how you can say you love me 1 minute and then say you don't want to be with me the next and all I hear from people is get over it and just move on wow so easy to say I am not a man that has the gift of words to woo a woman love one forsake all others that is how I was raised","post_message":"Breakups hurt, but losing someone who doesn't respect and appreciate you is actually a gain, not a loss."},{"comment_id":"10152672442592169","commenter_b":"she works my nerves! MAKE HER STOP!!!","commenter_a":"mismatch, think that Mary and He should get together","post_message":"New Downton Abbey video -- do you think Branson and Bunting should be together? The cast give their thoughts. (A new episode airs Sunday at 9/8c on MASTERPIECE | PBS (Masterpiece Theatre))"},{"comment_id":"10153221473348812","commenter_b":"What British chick?","commenter_a":"Better a bigger body than a nasty attitude. Maybe someone can help that British chick with THAT.","post_message":"Kelly Clarkson fires back at fat shaming comments: @webpagelink"},{"comment_id":"597418893776211","commenter_b":"@username Jill stein is a communist and belongs in jail for vandalizing construction vehicles at standing rock and she's crazy","commenter_a":"Bernie needs to take a young politician under his wing and mentor them so one or two elections down the road the only politician in america with a moral bone in their body isn't pushing 90.","post_message":"Mr. Trump, you told working people you were on their side. You know what? Millions of us are going to demand you keep your promise."},{"comment_id":"10152597227421615","commenter_b":"Thank you....so are y'all! Oh I forgot...so is Y'all @username!","commenter_a":"Please use proper English...y'all is not a world in the English language! I guess I am racist, also!!","post_message":"#BREAKING NEWS UPDATE: A 17-year-old boy has been arrested and is facing adult charges in connection with a shooting at the Monroeville Mall last night. @webpagelink"},{"comment_id":"683830911775006","commenter_b":"WHO CARES!!!!!!!!!!!!","commenter_a":"So she is smart good for her.","post_message":"People are freaking out over what's being said about Taylor Swift today..."},{"comment_id":"10153792660631545","commenter_b":"Just like recent a white women in alexandria,la a manager at canes got stabbed by a black an but do they see us protesting and stuff.come on now","commenter_a":"Why do black people complain about their shootings??? Ever hear about Asians or white people being shot?? Do they protest like you do? Do they get anything specific??? No","post_message":"\"They had him pinned down,\" Abdullah Muflahi told CNN. \"He was out powered. There were two of them and there was one of him, and they were right on top of his chest.\""}]
