[{"comment_id":"10153754425932431","commenter_b":"Americans are so evil they kill 99% of us and steal our land and then when we stand up to them, they say hey you better kiss our ass or we won't help you","commenter_a":"If americans want their pipeline then just put it on their land over their water not ours, They should have to pay the price for their greed not us, I am tired of americans living good lives off our suffering.","post_message":"Video: 7 Arrested After Pipeline Protesters 'Invade'  Enbridge's Duluth Offices  bit.ly/1Ms7Sjy"},{"comment_id":"491174087737551","commenter_b":"Muslims offend me. Ban them from the U.S.","commenter_a":"BS!","post_message":"Muslims Want to Change Our Nation and Obama is letting them..."},{"comment_id":"10153635350921636","commenter_b":"He's definitely got issues!","commenter_a":"So kill urslf wtf","post_message":"'I could just kill myself and I wouldn’t have to face today'"},{"comment_id":"10152959292394753","commenter_b":"I don't think you can read lady. Either that or human compassion is lost on another bitter old woman.","commenter_a":"that is jus nasty to have sex with your stepdad","post_message":"North Las Vegas police are still investigating the rape and child abuse case. The law enforcement are continuing to review what they have a “three-generation case of child abuse” involving the teen rape victim’s mother, Kellie Cherie Phillips, 38, and the man she described as her stepdad, Jondrew Magil Lachaux, 39."},{"comment_id":"173468886485698","commenter_b":"Well...Bye!","commenter_a":"California says screw you USA, until they want something from the rest of us in the USA.","post_message":"Spread this everywhere!"},{"comment_id":"484282168429030","commenter_b":"deport her and all the rest of the muslims in america","commenter_a":"Yes","post_message":"She walked on the plane wearing her Hijab, boy was that a mistake.  Shariah Law is dangerous, we support the patriots that stand against it.  Should Shariah be banned in all 50 states?"},{"comment_id":"10152835488861051","commenter_b":"What a bitch","commenter_a":"What kind of a person hurts an old lady. Hope she is sued . She needs jail time","post_message":"This 71-year-old woman tried to park in a handicap spot in the Walmart parking lot. That's when all hell broke loose."}]
