[{"comment_id":"1088448164564744","commenter_b":"MOB VIOLENCE - MUSHY FRAUDULENT L A C K OF LEADERSHIP. VOTE THEM OUT OUT OUT !!!!!!","commenter_a":"Is this what we call, \"Today's Leaders?\"","post_message":"This guy is nuts!"},{"comment_id":"10152521923501135","commenter_b":"The automakers would like to sell you a new vehicle sooner rather than later.","commenter_a":"Jennifer A. Thompson","post_message":"Do you really need to idle your car on days like today? We separate the facts from the myth. WHAT WE FOUND: @webpagelink"},{"comment_id":"10153642344498132","commenter_b":"You can put lipstick on a pig but, it's still a pig!!","commenter_a":"He looks kind of mean as a woman :(","post_message":"Caitlyn Jenner, can we borrow that mini?"},{"comment_id":"10153148221999087","commenter_b":"Close the Border why are they allowed to get all this free stuff, when we have people in this country who need help??","commenter_a":"get it back TRUMP!!","post_message":"\"People are walking across the border right now, right in front of these great people we have,” Donald J. Trump said. “We have wonderful Border Patrol people. They can do their job, but they’re not allowed to do the job.”"},{"comment_id":"10154819113006336","commenter_b":"She'll pay one way or another! I would like to see her drug through a trial, but if it's going to take away from necessary changes to bring America back to its roots, then let Hillary continue to slowly sink her own ship! It being brought to light solely to cost her the election was good enough for me.","commenter_a":"Truth be told she has been tried and found guilty November 8 she was sentenced RIP girlfriend","post_message":"In a meeting with The New York Times, President-elect Donald J. Trump said he would not take the investigations of the Clintons off the table."},{"comment_id":"10153120507763984","commenter_b":"Quit giving our tax dollars to all the lazy and illegal people, bring industry back from China .","commenter_a":"This is exactly what I've been talking about. They want to raise the gas tax, they want to introduce a milage tax. Who will this hurt the most? The pood and middle class. The Democrats don't care about the poor and middle class, they view them as cannon fodder. And uninformed people keep voting for them.","post_message":"The Obama administration and this Dem like the idea of using taxpayer dollars to study... new ways to tax people. Do you think the idea of this new tax is absurd?"},{"comment_id":"966472163391020","commenter_b":"They won't last very long if they show up here!","commenter_a":"Already here","post_message":"Nothing but a change in leadership can stop this."}]
