[{"comment_id":"10153145419396323","commenter_b":"Fucktards","commenter_a":"Romantic assholes","post_message":"Colossally stupid."},{"comment_id":"1715965605357218","commenter_b":"Y E S. I D O. ! ! !","commenter_a":"Of course they should","post_message":"Yes, I agree!"},{"comment_id":"10154161430028635","commenter_b":"Which is exactly why feminists aren't equalists, because they haven't dropped the privileged first-class citizenship baggage yet.","commenter_a":"My husband's previous wife took his son five states from him and the courts made him pay support without any effort to give the boy visits with his dad. That state is Indiana. The CP courts there are filthy with corrupt administrators.","post_message":"Teen applying for college finds out social security info don't match up and he was abducted as child"},{"comment_id":"1602106276760398","commenter_b":"Yeah well Thats all she does. Thats why she'll never be president.","commenter_a":"Donald J. Trump, Gary Johnson & Hillary Clinton's position on #StandingRock is clear: they ALL support Wall Street's attempts to rape & plunder the natural world (and us) to death. The ONLY candidate who TRULY supports clean energy & kids health is @username. #InvestYourVote #NoDAPL #SilenceIsConsent!","post_message":"My running mate, Ajamu Baraka, and I stood in September with #NoDAPL water protectors at Sacred Stone Camp in North Dakota, where the Dakota Access pipeline is being built in violation of a 19th-century U.S. treaty with the Standing Rock Sioux.  The desecration of sacred land and the 500-year violence against indigenous people must end if we are ever to see a just society that works for all of us, not just the 1 percent.  jill2016.com/standingwithstandingrock"},{"comment_id":"10154313146426045","commenter_b":"Lady Liberty not going to get you in HEAVEN","commenter_a":"For all the Christians out here, I thought you might need a reminder of what your God says about foreigners. Leviticus 19:33-34 ESV “When a stranger sojourns with you in your land, you shall not do him wrong. You shall treat the stranger who sojourns with you as the native among you, and you shall love him as yourself, for you were strangers in the land of Egypt: I am the Lord your God. Before anyone starts screaming Old Testiment. Mark 12:30-31 (NIV) 30 Love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.’[a] 31 The second is this: ‘Love your neighbor as yourself.’[b] There is no commandment greater than these.”","post_message":"Mexican President Enrique Pena Nieto said his country  not pay for any wall, defying the claims U.S. President Donald Trump has made."},{"comment_id":"1066828243360262","commenter_b":"I agree Diane..... but she is NO Lady!","commenter_a":"are you kidding me lady,Do you not get that Obama started this whole thing between races.there shouldn't be black or white there should be strictly American.","post_message":"VIDEO: Cokie Roberts has apparently gone completely insane."},{"comment_id":"10153171348750736","commenter_b":"Yeah, I want my 30 cents! in a check.. pronto!","commenter_a":"Instead of someone winning, split thee winnings with everyone who bought a ticket!!","post_message":"#BREAKING  No winner in tonight's Powerball Jackpot.  Wednesday's draw will be worth at least $1.3 BILLION.  Is there a billionaire's equivalent to the Dollar store??"}]
