[{"comment_id":"1849193665299183","commenter_b":"White people are the biggest thieves known to man","commenter_a":"'@username. as u know donny is completely unfit ...u dont care about your grandchildren smh sad","post_message":"WATCH LIVE: Electors are casting their ballots — will Donald J. Trump get the 270 he needs?"},{"comment_id":"1781541005401492","commenter_b":"Praying","commenter_a":":(","post_message":"Live coverage from Eyewitness News: NJ Transit train crashed into the station at Hoboken Terminal.  More details: @webpagelink Photos: @webpagelink"},{"comment_id":"10153666561423984","commenter_b":"She doesn't know her ass from a hole in the ground.Correction,she know what her ass is huge.","commenter_a":"Kardashian doesn't have the brain capacity to make those decisions and you better believe Kanye has security we don't have. Go live in the hood, kimmie, and then you can tell us how to protect ourselves.","post_message":"BOOM! Kim K thought she'd talk about gun control laws, and it immediately blew up in her face.   Do you support gun rights in America?"},{"comment_id":"1776934572577306","commenter_b":"I will be voting for Hillary, because trump is grabbing pussy","commenter_a":"If you still plan to vote for HilLIARy after this, you must hate Trump more than you love your country. Think about it. Long and hard. Is your pride worth placing an untrustworthy, corrupt criminal, who flippantly handles our national security, in the highest office in the land?","post_message":"Hillary Clinton's campaign is waging a full-out war on FBI Director James Comey in the final 10 days of the election."},{"comment_id":"579271598927799","commenter_b":"As a sentence. Send her dumb ass over there and pull her passport, then pull her citizenship and tell don't come back. PS. Take the view with you","commenter_a":"Do Barry proud, he'll probably pardon her.","post_message":"Mississippi woman who attempted to join ISIS pleads GET INSTANT JUSTICE from No-PC Judge"},{"comment_id":"1690937014458022","commenter_b":"Stupid Swede!","commenter_a":"Another nut","post_message":"This is INSANE..."},{"comment_id":"1065496103473179","commenter_b":"J.K. needs to mind her business.","commenter_a":"WOW! She shut it down! OMG! Trump is backing down because a writer...no wait! This article isn't about the writer...it's not about Trump. It's about Pierson. No wait, it's about a writer comparing to one of her make believe characters. Jesus, if your going to attack; pick an opening paragraph and stay on topic. If you can't do that...atleast get the headline to reflect the topic...","post_message":"Just 5 words  and they say it all."}]
