[{"comment_id":"1339484486080508","commenter_b":"@username YOU ARE NOT SANE! HILLARY CAN'T FIGHT HER WAY OUT OF A PAPER BAG---SHE\"S A TRAITOR TO AMERICA.","commenter_a":"I'm a Trump fan, and these despicable lies about Cruz and the military are an idiot journalist's attempt to be relevant. Credible journalist? NOT! Immaturity at its finest!","post_message":"Mainstream media at it again."},{"comment_id":"10152628059135667","commenter_b":"Dear Bill, are you having relations with that women?","commenter_a":"How can they release something they dont have.","post_message":"\"I want the public to see my email,\" Clinton tweeted."},{"comment_id":"10153178962341833","commenter_b":"Oh and not to mention we wouldn't have lasted a day against the British without guns.","commenter_a":"People just don't get the fact that we are still a democracy after 240 years in part because we as a population have the constitutional right to be armed. Let's see how long we would have lasted otherwise.","post_message":"Thank you for helping us reach 4.2 Million LIKES on Facebook! Like and Share the news with your friends!"},{"comment_id":"519829538184192","commenter_b":"Santagini - you are either batshit crazy or very funny.","commenter_a":"The traitor flag belongs in a military museum next to Nazi war memorabilia we took from dead Germans. You want heritage? Wave the white flag, that's your heritage.","post_message":"\"The time surely comes when [justice] must and will be heard,\" New Orleans Mayor Mitch Landrieu told the city council, calling for the statues of Jefferson Davis and Robert E. Lee.to be put in a museum. \"Members of the council, that day is today. The Confederacy, you see, was on the wrong side of history and humanity.\""},{"comment_id":"657748434349749","commenter_b":"CANCEL the game, go to half time show, then go home. Terminate the remainder of football season. Have each player turn in his jersey...","commenter_a":"I WOULD LOVE TO SEE AN ENTIRE STADIUM WALK AWAY FROM THIS CRAP...","post_message":"The entire team decided to pay tribute to Kaepernick and take a knee during the National Anthem. Guess how that worked out for them."},{"comment_id":"1270965036267418","commenter_b":"This poor dear is fighting an incurable disease and still want's to see American go back to being a great Nation again. Hillary keep you porn star and all the other jokers you can muster up. Melissa never give up dear, God can do miracles. Thanks for being a strong and down to earth women, unlike Hillary's choice of women.","commenter_a":"Rick Webb","post_message":"Former Miss Wisconsin USA Melissa Young, who is battling an incurable and fatal condition, said a note from Donald J. Trump in her darkest days reminded her that \"my purpose is to fight and I need to get up and fight.\""},{"comment_id":"1049313658417628","commenter_b":"Too true!","commenter_a":"I see an IRS audit in staples future. ...","post_message":"Staples announces that because of Obamacare they're having to make some changes in the structure of their employees, and Obama does not like it and he takes out after them. \"Obama Slams Staples for Reducing Hours to Avoid Obamacare,\" and Staples responded."}]
