[{"comment_id":"10154392573271491","commenter_b":"It's only a temporary ban, you guys make it seem like it's a ban forever and second why is it that USA always has to help the world, we have our own problems to take care of... Maybe once things are clear here and we are able to eradicate a huge chunk of terrorism, because it's honestly never gonna go away completely, then the ban can be lifted... What does it matter where the terrorist attacks that were here came from, people just want to open the borders like its nothing, let's spend some of that money here for once and help American citizens instead of foreigners for once or for now at least...","commenter_a":"She fails to understand we are trying to make sure those same radical Islamists, like the same ones who tried to kill her, stay out of our country. I'm saddened to see a survivor of radical Islamic terrorism can't sympathize with the U.S. trying to prevent terrorists from sneaking in as refugees!","post_message":"Malala Yousafzai: \"I am heartbroken that today President Trump is closing the door on children, mothers and fathers fleeing violence and war.\""},{"comment_id":"10153526250577431","commenter_b":"The swastika is an inverted cross of the Buddha. He was also inspired by Indian (India as in East Asian) mysticism.","commenter_a":"As a historian, I was amazed at what was copied by the Nazi regime as a way of dealing with racial, etnic, and religious cleansing. The more that I learned about Hitler's insanity the more I realized that he copied the concept of the concentration camp from the US answer to the Indigenous people of this land. The Nazi's swastika is even taken from Native American symbols. This is why the UN still holds the US as guilty of crimes against humanity.","post_message":"Ugly Precursor to Auschwitz: Hitler Said to Have Been Inspired by U.S. Indian Reservation System @webpagelink"},{"comment_id":"10153648380297293","commenter_b":"so that justifies a breach in privacy, Richard?","commenter_a":"Why keep nude images of yourself either on your device or your email inbox especially when you're a person of public interest. Stupidity warrants punishment.","post_message":"Jennifer Lawrence, Kate Upton, and Lea Michele were among the celebrities whose photos were said to be in the Celebgate dump."},{"comment_id":"699261006928857","commenter_b":"Hey Amber suck dick","commenter_a":"That was here plan NOT to help kids eat healthy but to sto kids from eating and she did a good job of it, come on Read between the lines. smh","post_message":"BYE BYE! Congress Releases SOME MASSIVE Bad News To Michelle On Her Way Out of The White House!"},{"comment_id":"999294776794334","commenter_b":"An epic read to do at 5.45am but i feel it went nowhere","commenter_a":"Sean Weir @username","post_message":"What if you found out there was a key that would enable you to open and close your doors of perception at will, void of psychedelics? What if you found out you not only held the key, but you were the key? Would you unlock the doors, or keep them shut? This is a good read."},{"comment_id":"10153587807310861","commenter_b":"If she wear a pasta strainer then.i will wear my niqub where only my eyes show.","commenter_a":"Expresses her beliefs....and remains single","post_message":"#LateNightLink Lindsay Miller says wearing the spaghetti strainer allows her to express her beliefs, like other religions are allowed to do."},{"comment_id":"10154323932234091","commenter_b":"I am so so so tired of the general public making excuses for these clowns and demanding we idolize them and refer to them as heroes. A LOT of them are just low IQ goons who made it through a few weeks of police academy and are let loose on the streets to act juvenile and bully citizens. And the more people worship them and expect the rest of us to, the more emboldened they feel to keep up this embarrassing and sometimes even deadly behavior.","commenter_a":"Yet another incompetent coward revenue collector.","post_message":"\"We thought (the officer) was texting on his phone. Because the whole three hours we were sitting here, he was the one standing there. We saw him on his phone, but we didn't think an officer would do that.\""}]
