[{"comment_id":"1284879431547513","commenter_b":"ve que no es vara :)","commenter_a":"@username Sergio Boudet lo que hablabamos el otro dia","post_message":"Colorado kept $1 billion away from drug cartels last year."},{"comment_id":"10153565687858984","commenter_b":"JAIL HER","commenter_a":"LIAR like her husband.","post_message":"Hillary’s been caught in another blatant LIE regarding her private email server. In a recent interview, Hillary said she had not been subpoenaed by the Select Committee on Benghazi, but records indicate she was subpoenaed in March 2015. Even the press covered it! Rep. Trey Gowdy won’t tolerate her deceit, and neither will we. Send a message to Rep. Trey Gowdy telling him what you think!"},{"comment_id":"1159977814023228","commenter_b":"\"It's not what you think, really\"","commenter_a":"Nåt är fel??","post_message":"Uh-oh."},{"comment_id":"10153223668067994","commenter_b":"Good. Now I bet she gets the hell out of here and never comes back! So embarrassing!","commenter_a":"Yay!!!!!!!!!","post_message":"Good news!"},{"comment_id":"1771313199818566","commenter_b":"Women just need excuses to be shirtless in public","commenter_a":"No.. He's not the ex-Stanford swimmer. He's a convicted rapist! Stop pampering the white boy FFS!!!","post_message":"We’re outside the Santa Clara County Jail where people are protesting the release of Brock Turner. He's the ex-Stanford swimmer who served three months after being convicted of sexually assaulting an unconscious woman."},{"comment_id":"10153509891501051","commenter_b":"Oh ya.....that'll stop the criminals from getting illegal guns!","commenter_a":"AGREE all the way","post_message":"Do you agree or disagree with the majority of Americans on this?"},{"comment_id":"616770258526486","commenter_b":"Feminists and think is a oxymoron","commenter_a":"I swear liberal women are just craving the fashion culture and using \"civil rights\" as a defense for it. They just want to wear a pretty head scarf because they crave culture.","post_message":"www.EagleRising.com"}]
