[{"comment_id":"976269069167192","commenter_b":"Bite yo tongue, girl!!! Lol","commenter_a":"Yolanda- see? You can breathe now. Lol","post_message":"THIS JUST IN: California emergency officials say a period of elevated risk of a large earthquake on the San Andreas Fault is over."},{"comment_id":"10153344147357439","commenter_b":"Lol is that where Muslims come from? Wow didn't know that!","commenter_a":"Send them back to Egypt.","post_message":"DC Area Professor To Catholic University: Too Many Crosses On Campus For Muslim Students To Pray @webpagelink Anywhere American law and Islamic law conflict, it's American law the inevitably has to give way. These demands for special accommodation are everywhere. Hertz, Heinz, Costco, IKEA, Target, Wal-mart, Disneyland, McDonalds and hundreds of others have all been in the cross-hairs. Islamic demands and the ensuing lawsuits in order to impose sharia...."},{"comment_id":"1034820419922610","commenter_b":"Fuck her","commenter_a":"Oh please she has an easy life it's the soldiers and other people have it hard and uncomfortable not her","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"10153070915541051","commenter_b":"Put her in the outhouse and lock the door.","commenter_a":"😕","post_message":"This woman's husband was buried under a particularly big pile of manure when police finally discovered him."},{"comment_id":"1543012149092242","commenter_b":"Awww you pathetic little slut... Let me guess, yo baby daddy is black....","commenter_a":"Its funny because in the 5th grade i refused to stand for the flag, 5th grade and i already knew this country was crap and lacked concern for its citizens. My friends grandfather was a vet from vietnam and she refused to stand for the flag out of how this country treated its troops. And she had every right and justification. You guys are missing the meaning behind the flag, you cannot just take the good of a country and claim thats all the country is. There is injustice that is constantly being negated by people like you, and those in these comments, simply because you haven't experienced it. Get over yourself and your terrible nationalistic views about a country that couldnt care less about you. Reality is reality, that flag represents a government that openly allows racism to grow and continue in our judicial and enforcement systems.","post_message":"This store owner planned a signing event with Brandon Marshall but when Marshall protested the national anthem, the owner cancelled the event immediately... but what the owner did next is going viral. Good for this owner... he's a true patriot."},{"comment_id":"10153067301701101","commenter_b":"duh","commenter_a":"I would argue that the rates of children who smoked marijuana, in the states that legalized marijuana, probably were the same. I bet little to nothing has changed.","post_message":"\"9.4 percent of children have used marijuana in states that have legalized medical marijuana, whereas the average in non-medical marijuana states is at 6.7 percent.”"},{"comment_id":"10153714763793132","commenter_b":"I seriously dislike this arrogant woman who will not be kind to Shannon, she's stupid not to learn from the others. She's annoying...","commenter_a":"The color is BLUE!!!!","post_message":"The Real Housewives of Orange County star made a beautiful gesture."}]
