[{"comment_id":"1678604362359824","commenter_b":"@username how about i fuck your wife?","commenter_a":"Ah yes, Israel defending themselves against the crazed islamists wanting to destroy the country and kill all the jews. This page is turning into a progressive shitehole full of regressive thinking. NASTY.","post_message":"Literally the biggest assholes on the planet."},{"comment_id":"10153750337633812","commenter_b":"Trayvon martin attacked Zimmer . Tired of the lies , zimmer lived in that neighborhood and had the same rights to walk as trayvon . Zimner's head veing slamned into the ground doesnt matter plus your ignorant white comment shows you don't know the facts . Zimmer is latino , black and white so stick your white privilege lie up your backside where your head is already stuck .","commenter_a":"A man who killed a lion is in hiding but the man who killed trayvon Martin is walking free?? Ohhh to be white in America","post_message":"Walter Palmer, the hunter tied to Cecil the lion killing, headed back to work: abcn.ws/1K0cdrW"},{"comment_id":"10153993699771756","commenter_b":"@username And you do realize the husband who was carried out the attacks was an American citizen, not refugees. In fact no refugees have ever carried out attacks. But by all means you go ahead and keep screaming about refugees, the terrorist just love you doing exactly as they wish.","commenter_a":"So Texas went from an idiot governor, to a mostly corrupt governor, to an insane one?","post_message":"Texas and the federal government have taken their power struggle over Syrian refugees to federal court."},{"comment_id":"10152925868341336","commenter_b":"I agree Joanie, impeachable offense to release enemies from Gitmo to try to kill Americans again!","commenter_a":"Obama has committed treason with this big time!!! Why hasn't congress started impeachment.","post_message":"The U.S. Army has decided to charge Sgt. Bowe Bergdahl with desertion, according to Retired Lt. Col. Tony Shaffer. He told Bill O'Reilly that the Army \"wants to do the right thing\" but The White House \"wants this to go away.\" @webpagelink"},{"comment_id":"1222871987767261","commenter_b":"@username no yo are for supporting that muslim scum","commenter_a":"HES DONE MORE FOR THE USA THEN OBAMA DID IN 8 YRS YOU PPL NEED TO GET A LIFE AND MOVE ON","post_message":"BREAKING NEWS: President Trump holds surprise press conference at the White House"},{"comment_id":"833182496827699","commenter_b":"@username is Donald Trump black daughter.. Calling a whole family criminals doesn't make you any better boo","commenter_a":"This niguh said jalapeño! Lol Dude should of gotten down and teach him how to gorilla jump that border!😂","post_message":"Border Patrol Was On Him With The Quickness!"},{"comment_id":"10152702993831636","commenter_b":"would rather pay for a second hand BMW than be involved in a spit roast with her","commenter_a":"sex united fc Siddhant Behera Sanket Mohanty","post_message":"Manchester United have found themselves at the centre of another sex story..."}]
