[{"comment_id":"10153553106522411","commenter_b":"Can i pee on you","commenter_a":"It's sad that in this age for a 15 yr old to be out she is automatically labeled! Times change hell its summer break maybe her parents actually trust her. It's sad that people are blind to the fact that the issue is the guns and not enough enforcement this Lil girl will never come back ever! We live in the number one city in homicide many people know this but few are willing to do something","post_message":"UPDATE: Chicago police are still looking for suspects in the shooting death of 15-year-old Veronica Lopez, who was a passenger in a car on Lake Shore Drive early this morning. Police say she's just one of the victims in what's turning out to be a violent Memorial Day weekend. LATEST DETAILS: @webpagelink"},{"comment_id":"1279039008785553","commenter_b":"Video by a feminist probably...","commenter_a":"Wait a second. You're mad because 20 people, out of 320 people, dropped out of the study.... so 6%.... and because 6% couldn't handle it..... you reach the conclusion that obiously men can't handle birth control.... isn't that a sexist statement against men? Not to mention I'm sure more than 6% of women don't take birth control because of side effects. Let's just think before we generalize a group.","post_message":"Male birth control is here, but men won't take it because they can't handle the same side-effect of female birth control that women have been dealing with since the 1960s."},{"comment_id":"10156715004010354","commenter_b":"Lord forbid she have a mind of her own.","commenter_a":"How totally racist is that !","post_message":"The NAACP Image Awards is ________________."},{"comment_id":"10153027652339753","commenter_b":"If a woman forces her self on a man it's rape","commenter_a":"How the hell does a woman rape a man? I have never understood this concept. Especially when he's \"asleep.\"","post_message":"She was pregnant with her third baby when she committed the alleged rape. But would her sentence have been tougher if she were a man? @webpagelink"},{"comment_id":"10153619794460575","commenter_b":"You can see how they are when they don't get their way they are illegal illegal illegal shoot shoot shoot","commenter_a":"Cant wait for Trump to win and stop these third world demonstrations by illegals that dont belong here","post_message":"Trump refuses to be silenced. . ."},{"comment_id":"677264589079564","commenter_b":"If Muslims are offend by us they can leave and go else where....maybe Syria.","commenter_a":"He'll no","post_message":"Muslims Are OFFENDED By This Teams Fans Uniforms, Should They Be Forced To Change it? Take our poll!"},{"comment_id":"1784975415104883","commenter_b":"Quit talking the talk and walk the walk and prosecute this Bitch already for crying out loud!!!!!! No more POS criminal Clintons in the White House!!!!!!!","commenter_a":"We need to start a new Party, the Constitutional Conservative Party.","post_message":"DML explains about indicting Hillary Clinton for her emails -- what would it do? Plus, little inside info from pollsters who say Trump leading in polls nationally by Tuesday. Watch, share, and if you are new to DML please give this page a LIKE."}]
