[{"comment_id":"498847790306569","commenter_b":"Scott, the guy was born and raised in New York City, the \"Wall\" you speak of would ideally be built to keep Mexican citizens from illegally entering the U.S. The \"Wall\"you speak of will not keep U.S born citizens off of the terrorist list, nor will it keep them from being bigoted disgusting pieces of shit who intentionally hunt down large groups of unarmed people and kill them because of their sexual orientation.","commenter_a":"I blame that peice of shit obama.stop letting in these fucking idiots. Build a fucking wall now! !!!","post_message":"Officials have started removing bodies from inside an Orlando nightclub where 50 people were shot and killed.  Sunday night, workers brought four bodies on stretchers out of club Pulse and loaded them into white vans. The action was repeated over and over."},{"comment_id":"578813518988176","commenter_b":"He needs to be voted OUT","commenter_a":"Give them his job ! Asshole","post_message":"What do you think?"},{"comment_id":"737701373087107","commenter_b":"That's what Americans should be saying. These people killed by this illegal immigrants should have been deported years Ago or been in prison. Many had records and let out of jail anyway. It seems the norm the people we elect turn out to not do what they were elected to do. Get them out from the president on down. Democrats are not the party of the working class anymore.","commenter_a":"This is a great idea","post_message":"Share if you agree."},{"comment_id":"10155013986101162","commenter_b":"Lmfao!!","commenter_a":"@username just because I saw your shopaholic post lol","post_message":"LATE PACKAGES: Amazon may experience some holiday turbulence in its shipping due to a contract dispute with pilots..: @webpagelink"},{"comment_id":"10153047000946336","commenter_b":"Send her to Iraq for a month.","commenter_a":"Yeah, that'll piss ya off !","post_message":"A social worker at an Indianapolis VA clinic was disciplined earlier this year after sending emails to colleagues that contained photos of an elf figurine posed to mock the mental health problems of combat veterans."},{"comment_id":"10154728095336336","commenter_b":"If it was a girl ,she may have gone home with a hook up","commenter_a":"This is awesome! I would eat at Original Joes if they had one in my town! Kudos to the woman who chose to get a ride home instead of driving!","post_message":"After deciding to take an Uber home, she returned to her car the next morning and found quite the surprise."},{"comment_id":"10153030983541051","commenter_b":"I would sue tjat fucking bitch and that guy","commenter_a":"Soooooo?! Why was that day different from any other?","post_message":"This woman turned to the Border Patrol officers and said: What are you going to do, arrest me? Turns out, they had something else in mind."}]
