[{"comment_id":"10152713641640496","commenter_b":"Amen, Laura ! AMEN.","commenter_a":"Sorry. I disagree. He sounds like a spoiled brat who realized that marriage takes work. Both people have to be willing to work at it. A real marriage is good. Hard sometimes. But good.","post_message":"How many of these do you agree with? @webpagelink"},{"comment_id":"10153133818461491","commenter_b":"Feminazis are the worst. Impossible to be around.","commenter_a":"Lame. I support women and women rights. But, the so-called feminism movement is not attempting equal rights, rather, they think women are superior to men. Everything about the femisnism movement is ironic and does more harm than good.","post_message":"Stephen Colbert is a feminist."},{"comment_id":"10157357339200354","commenter_b":"Nope don't thonk so. We the people have spoken.","commenter_a":"I think billy needs to brexit.","post_message":"If at first you don't succeed..."},{"comment_id":"10154660100050575","commenter_b":"Is she one of those nasty girls with nasty feet","commenter_a":"Funny how Americans don't like crooks","post_message":"Oh, my!!"},{"comment_id":"1848158328804181","commenter_b":"Why would he not mention her. The media is so biased you know they won't mention her in any other way then to make excuses for her.","commenter_a":"Can he EVER answer a question WITHOUT mentioning Hillary Clinton??","post_message":"Donald J. Trump to George Stephanopoulos on being criticized for taking time off campaign trail to open new hotel: “Nobody complains when Hillary Clinton goes to an Adele concert.\" @webpagelink More tonight on ABC World News Tonight with David Muir and tomorrow morning on Good Morning America."},{"comment_id":"886338878165958","commenter_b":"Muslim GET OUT!! Allah can't help you in America!","commenter_a":"Or, they could just move to a muslim country.","post_message":"YESSSSSSSS! This totally just made my day...."},{"comment_id":"1082224775141850","commenter_b":"Beyonce sucks black stinky dicks","commenter_a":"She's entitled to her opinion but was inappropriate at Super Bowl. People need to boycott her appearances. If enough people cry their outrage maybe it will make a difference. I know I'm fed up with this BS!!!!","post_message":"***FIRESTORM*** An online #BoycottBeyonce campaign to boycott Beyoncé and her music has picked up steam since the pop star performed a controversial tribute to the Black Panthers during the Super Bowl halftime show on Sunday....Developing..."}]
