[{"comment_id":"502346796622132","commenter_b":"Of course she had to remove that ugly mask - if you don't like it go home!","commenter_a":"Most states have laws that read, paraphrasing now, that it unlawful to conceal your identity when entering a place of business. Maybe someone out there with more interest in law or has more time than I do can clarify? But yeah, the owner can refuse service to anyone they choose!","post_message":"She wouldn't unmask herself, so the store owner demanded this.  Do you think the store owner did the right thing?"},{"comment_id":"1263136400442382","commenter_b":"You mean Country before party right","commenter_a":"Bunch of bullshit. They need to do there job. Party before country.","post_message":"WOW."},{"comment_id":"10153067204246636","commenter_b":"Is she ? So sex with her is ok?","commenter_a":"Slaughter of the baby is hardly justice for the rape. Two wrongs don't make a right.","post_message":"He claimed there are always 'two victims' in an abortion"},{"comment_id":"953749507999241","commenter_b":"I don't care if someone is breast feeding, but I cannot stand when attention seeking bitches claim they want equal \"rights\" but actually want to go around showing off their shitty bodies, crying for attention. Don't even try to tell me men and women's chests are the same, our chests have evolved for thousands of years to feed a child, men's have not. Just like men generally have a lot more muscle mass, they have evolved to meet the needs of his family while the mom nurtures and takes care of the babies. You are NOT feminists, you are an embarrassment to the female society. I want to fight for the rights of women who can't leave the house without a male, and are brutally forced into genital mutilation. The ones who are so \"oppressed\" because it's not socially acceptable to be naked in public make my blood boil. Like ...","commenter_a":"sorry, I don't want to see it either and I have 3 children myself. it's wonderful, its necessary and its private.","post_message":"Talk about a great response from the mom. (via TakePart.com)"},{"comment_id":"977904432246897","commenter_b":"She is an EVIL woman an not sure why she isn't in JAIL @username!","commenter_a":"Who is that masked woman?","post_message":"It's a very simple question:   “Have you seen those very, very controversial videos?”"},{"comment_id":"10153043301434411","commenter_b":"probably a women could define.","commenter_a":"So does this apply to women?","post_message":"Warning! Selfie men!"},{"comment_id":"1659099987677347","commenter_b":"Silence is a virtue girl, use it.","commenter_a":"why does everything have to be about color. if you dont care about a race then go live somewhere they are not. problem solved. but it sounds to me like you need to get ssaved.","post_message":"She said that “people of color” are always asked to give out awards or entertain, but are “rarely recognized for our artistic accomplishments.”"}]
