[{"comment_id":"10153932654413854","commenter_b":"He has cornered the market on STUPID...","commenter_a":"This guy is absolutely INSANE.","post_message":"Obama cites American Revolution as example of Americans being falsely paranoid about gov’t tyranny"},{"comment_id":"1119954238024715","commenter_b":"I'm for Trump! Politicians are afraid they will not get to keep lining their pockets if we vote OUT the good for nothing's. All they seem to do while in office is keep running for office. Raising taxes. They have good insurance. Do most of the people??They don't care about the American people! Let's get rid of them. Let's break up the good ol boys club!","commenter_a":"Trump Trump Trump! All the way!!!!!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153076244166336","commenter_b":"I could care less what that old cow at the head of the EPA says. Her job ends in a couple years. Clear out a stall.","commenter_a":"Pretty soon they'll be coin operated. $2.00 per 5 minute shower.","post_message":"The EPA wants hotels to start monitoring how long guests spend in the shower."},{"comment_id":"829690333773863","commenter_b":"The black community needs to clean up their act, plain and simple.","commenter_a":"This type of person should not be free.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154138263431323","commenter_b":"It's about what you want to do. Maybe a younger person follows what is 'the done thing' but with age and life experience, I think women just do what they want!","commenter_a":"It's just like the shaved pubes issue - all the same arguments. 'I do it for myself' etc etc. Look, virtually no young women shaved their pubes before porn videos made men expect it. And virtually no older women dyed their hair before looking our age became unacceptable. I've had enough of all this 'I do it for me' nonsense - look a bit deeper for god's sake and let's be a bit more honest about our motives and the forces that drive us.","post_message":"“We’ve been groomed – by the media, by advertisers, and now by ourselves – to understand that our gender has to try harder, to consume more, when it comes to our appearance. We’ve been taught to fear growing old.”"},{"comment_id":"10153232858118812","commenter_b":"Lmao. Good one. People need to chill out.","commenter_a":"If you don't like gay marriage, then don't get married to a gay person.... Problem solved! Cora Newton","post_message":"Filing joint taxes isn't just for traditional married couples anymore: @webpagelink"},{"comment_id":"10153579944776438","commenter_b":"If he hates it that much, he can step down and we can keep his paycheck.","commenter_a":"lol @ headline","post_message":"'He hates it.'"}]
