[{"comment_id":"10153559970697093","commenter_b":"@username you shut up.","commenter_a":"See how good it feels to see good black hard working men...and the children have no hate for them big black men see hatred is taught we are not born with it. Love this interaction this should be a wake up call to any one steriotyping.","post_message":"Apparently they get this excited every pickup day... they're now good friend with the garbage men... @webpagelink"},{"comment_id":"954295721303850","commenter_b":"Dumb hoe lol","commenter_a":"KiAsia SimplyyMee Wilson smh #fixitjesus","post_message":"SMH"},{"comment_id":"10154162654734087","commenter_b":"Yep, we saw how Liberal women threw their crotches at Bill Clinton with votes right? My guess is most would have gladly changed places with Monica Lewinsky. Sucks to be a hypocrital non-critical thinking Lib woman. That's Lib Feminism I guess.","commenter_a":"Yes, when a bigoted, neo-fascist, sexual predator runs for president on the GOP ticket, Democrats are loyal to their party and independents and moderate Republicans stream to join us to stop him as well...funny how that works.","post_message":"\"With the exception of cheating Bernie out of the nom the Dems have always proven to be far more loyal to each other than the Republicans!\" Trump tweeted."},{"comment_id":"10152653245300671","commenter_b":"Then get off of their butts and go through and jump the hoops just like all of our legal immigrants.","commenter_a":"this is so wrong. Take care of Americans first. Illegal immigration is wrong. I don't care what country or why you came here illegally, if you were a kid you have had plenty of time to do it legally, yet too lazy......","post_message":"The Migration Policy Institute says about 1.2 million people are eligible for the plan under the DACA rules. But now many more would become eligible if the president expands the program to eliminate the age cap. That cap includes a Modesto woman who’s been in the U.S. since she was a teenager. Ron Jones has her story."},{"comment_id":"923763564345713","commenter_b":"Blacks don't have a race card too play too our advantage only white ppl. Have a race its called white privilege. We have no damn race card nor ace card too use too our advantage since our culture controls nothing.whites have the race card too play since they control the system.","commenter_a":"Where are those white commenters now. Aren't these people \"race baiting\" or pulling the race card I dont hear their clown asses now! When its things like this they have nothing to say Because they are sitting back applauding this. They are the racist!","post_message":"This is happening. Residents of a predominantly black suburb in Detroit are up in arms after discovering racist political flyers sprinkled on their lawns that depict a cop in Ku Klux Klan gear pointing a gun at a black child. The flyers urge residents to “get the blacks out” and vote for white candidates, including mayoral contender Kenson Siver. MORE ---> @webpagelink"},{"comment_id":"10153914495466491","commenter_b":"How is a white woman being racist unbelievable?","commenter_a":"Unbelievable that people would accuse Ellen being a racist","post_message":"Ellen DeGeneres took to social media to respond to the backlash."},{"comment_id":"1309366539106612","commenter_b":"You should be removed from this country","commenter_a":"Shariah law is NOT a law in this Christian country !!!!","post_message":"WELCOME TO THE NEW AMERICA!"}]
