[{"comment_id":"10154141762806162","commenter_b":"Wild animals!!!!! trump is the wild animal causing all this bs PIED PIPER !!!","commenter_a":"People need to stop blaming Trump for the actions of low life people. They get out of hand, then don't want to own up to their actions. It's the generation of placing the blame elsewhere. Trump didn't tell them to act like wild animals. That's just how they act.","post_message":"\"We're going to take our country back from 'these people,'\" Trump told supporters after his canceled Chicago rally. \"These are bad, bad people.\""},{"comment_id":"10155341100780725","commenter_b":"So put that bitch down","commenter_a":"Obviously she has mental and emotional illness. Maybe people shouldn't be so quick to throw her to the firing squad.","post_message":"The woman accused of viciously cutting open a mother-to-be's womb to steal her fetus was apparently faking her own pregnancy, which gives a clue as to why she committed the horrendous crime, according to a police affidavit ----> @webpagelink"},{"comment_id":"10157033906465725","commenter_b":"STOP Crooked Hillary from winning the general election! Together we can turn this country back around in the right direction by getting out and voting! TRUMP 2016!","commenter_a":"NO way!!!","post_message":"It is so important to get out and VOTE in 2016. Crooked Hillary Clinton cannot be our next POTUS! Senator Jeff Sessions just warned, \"This will be the end of law in America.\" Get out & VOTE TRUMP! We will MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1154038954631400","commenter_b":"@username show this to your boo.","commenter_a":"This made me think of you, Raima. And also laugh really hard.","post_message":"Will Ferrell: comedian, actor, just your average millennial."},{"comment_id":"10154024532730950","commenter_b":"Yes, those woman do.","commenter_a":"He is right. A rapist and an evader of taxes like him, is running for president and might win. Indeed, a third world country.","post_message":"“Folks, we’re living in a third world country,” said Trump while talking about Clinton’s emails. @webpagelink"},{"comment_id":"911159142284175","commenter_b":"Wtf! Lmao dumb bitch","commenter_a":"@username @username 😂","post_message":"SMH"},{"comment_id":"638227583024858","commenter_b":"They were all womanizers.","commenter_a":"President Lincoln: \"...that government of the people, by the people, for the people, shall not perish from the earth.\" President Kennedy: \"...Ask not what your country can do for you.\" Dr.Martin Luther King Jr. \"....one day we will be judged not by the color of our skin but by the content of our character.\" Donald Trump: \"...Grab 'em by the p***y\"","post_message":"Watch a Republican CNN commentator call on Trump to step down after tape was released of him explaining how to sexually assault women: \"He is a pig, he is vile. This is consistent behavior by him...He is not fit to be the Republican nominee. He is not fit to be called a man.\""}]
