[{"comment_id":"1588983808072440","commenter_b":"Why are gender confused women so ugly??","commenter_a":"Very dangerous! Students looking for a leader. Maybe a Pol Pot?","post_message":"“I’m never going to argue with people’s feelings,” she says... before explaining why she rejects the feelings of conservatives who have been silenced."},{"comment_id":"1727638077485478","commenter_b":"Theyre cool. But they claw into you. Very clingy animals","commenter_a":"@username this is why i wana go Australia - want one asa pet lets get one","post_message":"Koala joey plays in baby basket. Via Symbio Wildlife Park"},{"comment_id":"10150832975979963","commenter_b":"Something tells me that the Bulletin of Atomic Scientists probably knows more about \"international nuclear weapons relations\" than you do.","commenter_a":"Anyone who thinks that this is \"Trumps fault\" doesn't know much about international nuclear weapons relations and the money exchange that goes with it, be it legal or not. Trump wasn't president then....","post_message":"According to the Doomsday Clock there's an increasing probability that the world will observe nuclear conflict."},{"comment_id":"483503378504622","commenter_b":"Wow!","commenter_a":"This proves someone built something and is no more proof of God than stepping in a cowpie.","post_message":"This Will Shut Their Mouths!!!!"},{"comment_id":"10154732730043132","commenter_b":"BUT is he jewish?!","commenter_a":"Daniel Foisset","post_message":"It looks like Aly Raisman has plans for after Rio!"},{"comment_id":"1701853746697814","commenter_b":"Dan Chow I maybe a old , but I am not fool !! I been follow Hillary since She was First Lady !! I know how amazing She is !! If you care to know the true about this Lady !! Check: ADDICTINGINFO.ORG list of @username accomplishments !! This are the Facts !!!","commenter_a":"2008 was a President Obama Time !!! <3 Hillary is that Leader for this TIME !!! <3","post_message":"In 2016, everything we’ve accomplished together is on the line."},{"comment_id":"10154154937686409","commenter_b":"Very smart wife! You'd do well to follow her example!","commenter_a":"Beg to differ tree hugger. My wife warms up her 4Runner for five to ten minutes. I never warm up. Her car is a 2006 and runs like new. I've gone through two cars. And '06 and an' 08","post_message":""}]
