[{"comment_id":"10153624513811336","commenter_b":"Now the world knows what Cheryl is all about when it comes to black people..","commenter_a":"We also have a president who has made it open season on our police officers.","post_message":"This week on Fox News Sunday: Gov. Chris Christie discusses his 2016 strategy, the government and more. Check your local listings or tune in to Fox News Channel at 2p/6p ET."},{"comment_id":"10153644066921337","commenter_b":"Oooooh damn. That sucks man. That bitch took the easy way out. Piece of shit lunatic","commenter_a":"A piece of shit ....is a piece of shit. No need to bring up RACE.","post_message":"GUNMAN IDENTIFIED: Former WDBJ7 reporter Vester Flanagan is behind the horrific on-air shooting of two news team members."},{"comment_id":"10158298295275206","commenter_b":"@username Memisevic you want to be a victim so bad. Girl go lay down.","commenter_a":"This is exactly why NFL players are doing what they are doing, and you are pissed at them!?","post_message":"“We saw that Terence did not have any weapon. Terence did not make any sudden movements. We saw that Terence was not being belligerent.”"},{"comment_id":"10153465235771316","commenter_b":"I guess the woman in this pic is borderline retarded...","commenter_a":"They can store more farts too so that's good","post_message":"Women with larger behinds are healthier and more intelligent, study finds: @webpagelink"},{"comment_id":"1528607397159285","commenter_b":"Nobody has proved that Russia is behind it .","commenter_a":"I just can't take how Trump supporters defend this disgusting and vile piece of trash! Let's vote based solely on platform! Everyone keeps saying that they both have a lot of baggage, so let's level the playing field.","post_message":"\"To profess not to know at this point is willful misrepresentation,\" an official said."},{"comment_id":"892169154214897","commenter_b":"Tucson, AZ.","commenter_a":"12s, where are you watching from???","post_message":"Watch: Seahawks leaving for Carolina!"},{"comment_id":"10155175533915389","commenter_b":"Looks evil. Tired of the liberal PC bull :poop: that is going to end up killing good people. Maybe if the Terrorist went after liberals only..they wouldn't be in a hurry to let these murders free. Starting with Washington please","commenter_a":"What is this world becoming","post_message":"The United States Department of Justice said a former Al Qaeda operative was released last week from a federal prison prior to completing his 15-year sentence because of “time served.”"}]
