[{"comment_id":"10155980506710725","commenter_b":"@username. I see why you love her lol","commenter_a":"Whoopee","post_message":"What do Amy Schumer and Judd Apatow do when they find themselves stumbling into an Irish wedding? They make the most of it, of course! Watch the wedding crashing incident, all caught on video ----> @webpagelink"},{"comment_id":"1245235738872618","commenter_b":"Shes definitely got bigger balls than you lady.","commenter_a":"God how can anybody not believe Michelle is a man? Look at his face in this pic, my god.","post_message":"\"Everyone was in tears...\""},{"comment_id":"10155910750959062","commenter_b":"She should have thought about her baby before she decided to become a thief! Do the crime do the time!!! She got caught and now she's worried about her baby! Should have been worried before doing the crime! Baby is being raised by a habitual, especially if she can't act straight while pregnant","commenter_a":"She was sentenced 14 days and is getting them 3 for 1 that's 5 days people. If she were male and not pregnant she would have been ordered six months. Being pregnant isn't a get out of jail free card.","post_message":"Right or wrong?"},{"comment_id":"10154953238254497","commenter_b":"Cthulhu. Keeping it super old school.","commenter_a":"@username Cthulhu or FSM?","post_message":" haste, before His Holiness is torn asunder by the dark horror."},{"comment_id":"118155238703506","commenter_b":"Yes, to bad they are ruining a great state. It's going to take more than Hollywood to support the illegals. Have fun, I'm gone","commenter_a":"Hell yesss goodbye","post_message":"There could be 49 states of America very soon. It's only a matter of time. Good riddance. Do you think we would be better without those libs?"},{"comment_id":"940305309340143","commenter_b":"Muslims should be ban from Guns & Knives !","commenter_a":"Nice sentiment, but It'll never stand. If People can be forced to bake a cake against their beliefs, the muslum-loving bunch in D.C. won't allow this!","post_message":"\"I will not arm and train those who wish to do harm to my fellow patriots.”"},{"comment_id":"10153910482357464","commenter_b":"We don't need another illegal immigrant running our country!! Vote for Trump","commenter_a":"We don't need another Obama in office be smart!! Vote for Trump","post_message":"Spoke with Hugh Hewitt yesterday on the eve of the Nevada caucuses. You can hear the discussion here: @webpagelink"}]
