[{"comment_id":"10153147185484342","commenter_b":"Bruce Jenner is a woman, this lady is black, and I'm a billionaire.","commenter_a":"Since she was 5? Then this just didn't happen since she entered into adulthood. She had a identity problem since she was a kid and I blame her parents on that because they should've noticed it way back then. To all you parents out there who have little kids, pay more attention to your kids.","post_message":"\"I was drawing self-portraits with the brown crayon instead of the peach crayon.\"  #RachelDolezal has broken her silence, saying she started identifying herself as black around the age of 5."},{"comment_id":"1192440530796417","commenter_b":"She abstained from marriage and birth control","commenter_a":"I don't think abstinence means what she thinks it means.....","post_message":"Teen abstinence superstar Bristol Palin just gave birth to her second little bundle of hypocrisy."},{"comment_id":"10153959517171337","commenter_b":"\"Drink the kool-aid.. Sheep.. Libtard... Scandals...\" Meanwhile, there's Trump. All of those things wrapped into on ball of hair. HA HA HA!!","commenter_a":"Haha that bitch will do anything for votes. She's trying to win the young/urban vote lol tomorrow she'll be in overalls with a straw in here teeth talking to some farmers. Line up kids, get your blow job from Hillary !!!","post_message":"R.I.P Dabbing  @webpagelink   (2015-2016)"},{"comment_id":"10155107351709062","commenter_b":"Grow a uterus then be concerned with this issue.","commenter_a":"The baby killers' excuses are absurd. They claim women's health concerns, yet having access to a sanitary hospital is unfair. And, it it's about health, how does killing a baby make them healthier???? Wouldn't keeping their legs closed keep the baby healthier??!","post_message":"Davis led an 11-hour filibuster of the restrictive legislation."},{"comment_id":"10154974354758984","commenter_b":"lock her up","commenter_a":"Both are ignorant bitches!","post_message":"In Wisconsin, the recount had gotten Hillary Clinton one extra vote. Now, though, the recount in Pennsylvania is in, and here's how many votes it netted Jill and Hillary...  This is NOT what they expected."},{"comment_id":"10153559794027464","commenter_b":"Specifically,she wouldn't let others issue them -- it must be HER Signature on the license.","commenter_a":"She should be granted conscientious objector status. Others were willing to issue the licenses.","post_message":"Today, judicial lawlessness crossed into judicial tyranny. Today, for the first time ever, the government arrested a Christian woman for living according to her faith. This is wrong. This is not America.  I stand with Kim Davis. Unequivocally. I stand with every American that the Obama Administration is trying to force to choose between honoring his or her faith or complying with a lawless court decision.  In dissent, Chief Justice Roberts rightly observed that the Court’s marriage decision has nothing to do with the Constitution. Justice Scalia observed that the Court’s decision was so contrary to law that state and local officials would choose to defy it.  For every politician — Democrat and Republican — who is tut-tutting that Davis must resign, they are defending a hypocritical standard. Where is the call for the mayor of San Francisco to resign for creating a sanctuary city — resulting in the murder of American citizens by criminal illegal aliens welcomed by his lawlessness?  Where is the call for President Obama to resign for ignoring and defying our immigration laws, our welfare reform laws, and even his own Obamacare?  When the mayor of San Francisco and President Obama resign, then we can talk about Kim Davis.  Those who are persecuting Kim Davis believe that Christians should not serve in public office. That is the consequence of their position. Or, if Christians do serve in public office, they must disregard their religious faith–or be sent to jail.  Kim Davis should not be in jail. We are a country founded on Judeo-Christian values, founded by those fleeing religious oppression and seeking a land where we could worship God and live according to our faith, without being imprisoned for doing so.  I call upon every Believer, every Constitutionalist, every lover of liberty to stand with Kim Davis. Stop the persecution now."},{"comment_id":"1156511254368903","commenter_b":"The land belong to native american until white screw it up.","commenter_a":"NO TO CHINA!!!! Our land is for the American People!! and Washington State's water belongs to THEM!","post_message":"Farmers from drought-parched California are finding greener pastures in the Pacific Northwest. And so are buyers from China."}]
