[{"comment_id":"980020968705428","commenter_b":"It's been a long time coming. Let's make this happen so our daughters and granddaughters are free from the harassment that we were told to 'just deal with it'.","commenter_a":"We need something like this! Jasmyne","post_message":"The video is intense, but its message is so needed. - Parker Marie Molloy"},{"comment_id":"510973722424254","commenter_b":"Let's elect him and the boos will disappear, right along with all those illegals that are making the noise.","commenter_a":"Don't join conservative Tribune news bad to read","post_message":"Donald Trump handles this opposition like a CHAMP!!!"},{"comment_id":"10156349547100354","commenter_b":"Conservatives learned the lessons of MLK. I think the left needs to review what he preached. It is not the color of the skin but the content of character.","commenter_a":"These people just say what they think and then if it bites them in the rearend they come back with some ridiculous other story which nobody believes but they seem to think that we will.","post_message":"FIRESTORM: MSNBC Liberal Claims She Wasn’t Calling Dr. Ben Carson Racial Epithet...'Safe Negro'...Backpedals Quickly...Dr. Carson Campaign Blasts...MORE..."},{"comment_id":"10153721547731378","commenter_b":"Says a skinny woman","commenter_a":"Life is short. Eat the cake.","post_message":"Are 'Cheat Days' helpful or harmful to your diet? Some say giving into cravings can decrease your appetite. What do you think?"},{"comment_id":"10152589675067623","commenter_b":"Im on reserve Obama","commenter_a":"And I asked the cable co. to lower its rates!!","post_message":"#BREAKING President Barack Obama sends letter to Congress requesting authorization for the use of military force."},{"comment_id":"10152526323082377","commenter_b":"Go away","commenter_a":"a gubbament BIG ENOUGH to GIVE you everything you WANT, is also BIG enough to TAKE EVERYTHING you have!! see what happens when you DONT VOTE!","post_message":"Oh Really..."},{"comment_id":"902035299831892","commenter_b":"Then don't eat the Damn thing, leave now.","commenter_a":"im so sick of people trying to make racism out of nothing u people r pathetic","post_message":"What do you think? Is this food racist?"}]
