[{"comment_id":"10154179126579411","commenter_b":"Gotta love the 'former' officers or agents say the truth once they've retired.","commenter_a":"Shut-up CIA!!!! You funded and gave birth to ISIS !!!!!!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153507690103812","commenter_b":"They attack to eat. It's a risk of going into an ocean. Yet millions do multiple times yearly. Safely.","commenter_a":"I wish they could stop telling the lie... 'Sharks don attack humans'.... Yes they do!!","post_message":"UPDATE: Officials: Girl and boy may have lost parts of limbs in separate shark attacks on same stretch of NC beach: @webpagelink"},{"comment_id":"10154001679275927","commenter_b":"Every time she opens her mouth out comes more drivel!","commenter_a":"She owns a vineyard in California, I think she personally does all the wine tasting herself!","post_message":"WATCH-- President Clinton, as well as President Obama, we operating on a pay-as-you-go basis ...'"},{"comment_id":"1583527538618276","commenter_b":"Muslims please go back to your hell hole, you only make demands, cause problems , and bring terror","commenter_a":"You have freedom of religion in this country not freedom to shove your beliefs on others.","post_message":"They're not afraid of offending anyone, they stand behind their beliefs.  Do you agree with Lowes?"},{"comment_id":"1824785004425894","commenter_b":"Women who support Trump have severe Stockholm syndrome and suffer insecurity","commenter_a":"Three times divorced, womanizer dares to talk about morality.","post_message":"Let's talk about the debate...what just happened?"},{"comment_id":"1676343909290795","commenter_b":"I wish these other stories would come out! I read another one about a guy she accused of hacking her account and he said he would pass on all his emails etc to Trumps campaign guys lawyer. I think this chick is unbalanced and has issues","commenter_a":"You idjits are just gonna love the hell out of it when we burn this BS Republican party to the ground if a hijacking takes place at the convention in Cleveland. Tired of this party bending over and letting Obama drive deep, then talk about conservative values during the election. If Hillary wins this, look in the mirror. #TRUMP2016.","post_message":"'We saw libel, defamation, slander, smearing of her reputation, simply for trying to do her job,' Katie Pavlich said. 'This isn't just about simply one reporter. It's a bigger issue of the role of the press in America.'"},{"comment_id":"932180273594983","commenter_b":"So these women thought it would be cute to be 'bad mom's'. It's a sad world we live in.","commenter_a":"Selfish mothers. Women who should not have children.","post_message":"'No one had communicated that children under six were not allowed in R-rated movies,' one of the moms said. 'We had breastfeeding moms with infants, one 4 weeks and one 7 months, and they refused them entry.'"}]
