[{"comment_id":"1146865702064592","commenter_b":"OMG, Catherine. Did you really say that? go wash your brain out with soap.","commenter_a":"Hillarys people Bribed the FBI to changed subpoena documents and change it from classified to a lower classification . If they can do something so illegal and get away with it. Think how the government can come after ANYONE! the Media owned by global elitist, Hillary is their puppet.","post_message":"Image from Meme GOP"},{"comment_id":"10153374833224497","commenter_b":"I miss that trashy bitch.","commenter_a":"whatever happened to amber richardson?","post_message":"\"I had some great drugs in my day, but seeing my baby for the first time? I wouldn trade that for all the ecstasy in the world.\""},{"comment_id":"10156188886135354","commenter_b":"Suzanne, you're a dumb bitch. Shut the fuck up","commenter_a":"Scott walker Mexican Americans legals are against illegals we are with DonaldTrump not because we are Mexicans but this is our country n our children need a better America not free loader hard working for a better America since 1800 hundreds my family been hereover 200 hundreds years we love America we have to be great again my decision n my family DonaldTrump is the great America we need","post_message":"Scott Walker calls for a “limited number of candidates who can offer a positive conservative alternative to the current front-runner.”"},{"comment_id":"470654633125117","commenter_b":"She wants he balls back","commenter_a":"Yes. One way ticket to kenya","post_message":"Michelle is turning 51, and you'll never believe what gift she wants. We have a good idea, how about a trip back to Kenya for her whole family? Anyone agree?"},{"comment_id":"10154405827009170","commenter_b":"Two evil sisters!","commenter_a":"Goofy the fake indian with Chief \"Lie to your face\" Clinton!","post_message":"Lord help us if we have to listen to these two for the next 4-8 years..."},{"comment_id":"10154490507826051","commenter_b":"Absolutely NOT! Lying Ghetto trash Marxists.","commenter_a":"Absolutely did not he's a Muslim has no class.","post_message":"Yes or no: Did the Obamas represent America with class and dignity?"},{"comment_id":"1785965414966824","commenter_b":"Ancient celts had hair like dreads as well. This is her putting a modern spin as an absolute.","commenter_a":"My life my world my rules. You dont tell me what to do","post_message":"It's everyone else's fault!"}]
