[{"comment_id":"10153547017035950","commenter_b":"There is no excuse for paddling in school. Sounds like mom has serious issues too.","commenter_a":"He has missed 18 days of school, he's got in two fights this week, he spit on a kid and his mother is on the verge of going to jail not only because he has missed school but because of things she does in her personal life. If she doesn't want to be a parent to that child somebody has to be.","post_message":"\"It was not a spanking. It was abuse,\" said the boy's mother."},{"comment_id":"736296849894226","commenter_b":"POOR GAS ON THEM AND LET THEM BURN","commenter_a":"He should have the same thing done to him.","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news. No riots, no protests, no media coverage. Do you think he should be charged with a hate crime?"},{"comment_id":"10155553244070354","commenter_b":"Sit your dumb racist ass down and shutup AL shapton and pay the taxes you owe","commenter_a":"Wake up people! States better start secession proceedings. The 10th Amendment: \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\"","post_message":"First he fought the right, then he fought the cops, now Al Sharpton announces his plan to fight his toughest opponent yet: ....The U.S. Constitution."},{"comment_id":"10152699530401051","commenter_b":"This brittany chick needs her head examined.","commenter_a":"He was born male, he died male. No matter what he felt,","post_message":"These parents faced nonstop criticism after their teen committed suicide by walking in front of a tractor trailer. Now they’re speaking out."},{"comment_id":"10154136530601509","commenter_b":"Ignorant woman!","commenter_a":"Botate a la verga pinche paisana que te deporten por pendeja y regresate a tu pais pinche ignorante andas apoyando a trump y ni hablar ingles sabes se te nota lo paisana desde lejos","post_message":"The Donald J. Trump superfan, \"I saw Mr. Trump only in my dreams\" @webpagelink"},{"comment_id":"556763161150305","commenter_b":"Steven...do you suck your dad off with that mouth?","commenter_a":"Oh, that's soooo terrible... You think the several thousand people he had killed didn't fear for lives? The ones who were shot, beheaded by chainsaws, scalped & skinned alive, and who had limbs broken and cut off? Extradite Chapo, throw him in ADX Florence for the rest of his life, and admit this bimbo to a psych ward.","post_message":"Emma Coronel: \"I'll follow him wherever because I am in love with him.\""},{"comment_id":"10152998520246037","commenter_b":"Rules are rules. But the airline's inconsistency in enforcing those rules is the real issue. It was ok to hold the child on the way down, it should have been the same on the way back. BUT I find the attention mongering of this mom downright pathetic. Totally disgusted. Not everyone is a world traveler, and I also get confused by the ever changing rules of the sky. Seems to me the mom holding her daughter was pretty clear that now she knows the airline's policy she will have a safety seat with her in the future. No further big deal made of it, issue was put to rest. Until this attention whore feels compelled to one-up her and try to publicly shame her. Disgracefull, classless and pathetic. If the woman went on and on and on about how she should be allowed to hold her child anyway, Yada yasa ...","commenter_a":"I agree with most of you, if she has a child with special needs then they shouldn't have been seperated in the first place. Secondly if the flight attendant had let that happen and something happened, then who would've been at fault then??","post_message":"\"The attention mongering schemes of Elit Kirschenbaum, who took to Twitter last week lambasting a United Airways flight attendant for refusing to allow her to hold her disabled three year old daughter on her lap during take off, make me want to puke.\""}]
