[{"comment_id":"10156586840470147","commenter_b":"Tildon Peacock, so using your guidelines, abortions should only occur when there was rape?","commenter_a":"The law already acknowledges the unborn child as a human being. If a pregnant women is murdered, it's classified as a double homicide. Regardless, it should have a right to live as we all had the opportunity. If society calls a germinating seed a plant, we can call an unborn child a human being with rights.","post_message":"Wow..."},{"comment_id":"1179263908762059","commenter_b":"моод дэлгэрүүлж дээ... хэхэ...","commenter_a":"Jargalsaihan Mandakh, @username...","post_message":"Watch over 100,000 people swarm this public beach in China."},{"comment_id":"1190551201025975","commenter_b":"You can now add Tucson to the list of sanctuary city's. We should recall the city supervisors. Our southern border is now wide open. There want to increase the city sales tax to take care of the influx of illegals.","commenter_a":"Has anyone else noticed that whether the terrorist attack is in Europe or America, the police and other authorities already know about the terrorist? Just asking.","post_message":"The Berlin attacker was a refugee and known terrorism suspect, and Germany still didn't deport him! How will this affect Donald Trump's America? Your hosts: Christopher Bedford, Katie Frates and Saagar Enjeti."},{"comment_id":"10153637464097377","commenter_b":"@username That's lame .The females in my family would not let it go for 10 seconds much less 10 years .","commenter_a":"10 years ago? It's not that I don't believe it, but you wait 10 years to report . Does not sound kosher .","post_message":"BOMBSHELL: Megyn Kelly has accused Fox News Chairman Roger Ailes of sexual harassment! New York magazine reports that Ailes has until August 1 to resign or be fired. Read the story: @webpagelink"},{"comment_id":"943252975710162","commenter_b":"I feel like singing. We say grace we say ma'am if ya ain't in to that we don't give a dam. Were from north california and south alabam and little towns all. Around this land. But on a serious note. Being politically correct has made our country weak. Made our children bad and taught them mom and dad will save me no matter what. And yes I do support trump. I'm against illegal immigration and gun control.","commenter_a":"If she would have been taught respect for authority at home this wouldn't have happened true thug trash.","post_message":"Some reasons why Officer Ben Fields should be fired immediately."},{"comment_id":"1105433506199543","commenter_b":"This Woman is not Presidential Material ! Please don't listen to her lies!","commenter_a":"So true","post_message":"#NeverHillary Allen West Republic @webpagelink"},{"comment_id":"1588312174810373","commenter_b":"Killery destroyed evidence after she received a subpoena from the FBI and she Lied under oath! Alot of people have went to jail for less! Our Government and the Media are so corrupt! The same people that have major shares in every media outlet are same people that fund Killery! Saudi and Arab countries!!! I hope you know how they treat Women? Children! Gays?","commenter_a":"This woman has no shame... She will say and do anything for power.. Wake up Dems you're trying to elect a criminal for president.","post_message":"Latest batch of WikiLeaks emails contain details on Hillary Clinton's narrative on Benghazi. @webpagelink \"We see an email exchange among John Podesta [and] other top aides, where Hillary Clinton was being coached on, in their words, 'how to stir up some moral outrage against Republicans' at this Benghazi hearing several months ago,\" Ed Henry reports."}]
