[{"comment_id":"569782366553109","commenter_b":"Christ. Any more soft lobs? Take off the freakin kid gloves already","commenter_a":"falling asleep?","post_message":"Tom Price, Donald Trump's pick for secretary of Health and Human Services, is expected to face tough questions on Obamacare, his financial disclosures, drug prices and more in his appearance before the Senate Committee on Health, Education, Labor and Pensions."},{"comment_id":"10155047061111336","commenter_b":"what a bunch of bullcrap everyonr can get s social security number legal or not","commenter_a":"Wow that hurt my brain to watch. He says illegal immigrants contributed billions of dollars in taxes and social security 😂😂😂😂 you cant do that if you dont have a social security number and if your here illegally you dont have one. So how exactly is illegal immigrants doing anything for our nation except burding all of our systems and taking jobs from american citizens.....","post_message":" do you have a Social Security card to be in this country? How do you have a Social Security number? ICYMI: \"Angel Mom\" Laura Wilkerson and undocumented immigrant Jose Antonio Vargas clashed over President Donald J. Trump's executive orders on illegal immigration. @webpagelink"},{"comment_id":"10153318242754087","commenter_b":"I'm not a gynecologist, but I know a cunt when I see one.","commenter_a":"Bernie doesn't accept SuperPAC money, yes, which is very honorable. But he still takes money from unions. Trump is the only candidate who is self-funding his campaign.","post_message":"“I’m voting for Bernie Sanders, because he doesn’t take any corporate money,” said undefeated UFC champion Ronda Rousey. “I don’t think politicians should be allowed to take money for their campaigns from outside interests.”"},{"comment_id":"10152685368712507","commenter_b":"So, we can therefore classify modern business as \"irresponsible\" capitalists, right?","commenter_a":"\"How to fix inequality\"??? REALLY?!! C'mon guys! That's almost as absurd as \"fixing climate change\"!! With all due respect, is there anything that's just TOO DAMNED STUPID to write? Anything at all?","post_message":"There's no easy solution."},{"comment_id":"873492039433845","commenter_b":"make all the illegals-legal so thats 10 million persons paying taxes. we could sell the republicans to the dog eating festival. thats say 100 dollars.","commenter_a":"cool give them texas. that would be hilarious!!!!!!","post_message":""},{"comment_id":"10153072153096157","commenter_b":"If you're here Illegally you Wil pay the consequences. Deportation!","commenter_a":"stupid question any of u talkers served","post_message":"The ICE operation would begin as soon as next month and would likely affect hundreds of immigrants who fled violence in Central America."},{"comment_id":"10156662998260725","commenter_b":"Build that wall!!!","commenter_a":"Trump is going to do a great job 8 years later some other idiot is going to come and ruin it another 8 years Eric Trump is going to run !!! That's the plan!!! Go Trump!!!","post_message":"I have built so many great and complicated projects – creating tens of thousands of jobs in the process. Building a wall is A LOT easier than building a 64 story building! LET'S #MAKEAMERICAGREATAGAIN www.DonaldJTrump.com/Nevada"}]
