[{"comment_id":"1452176608135698","commenter_b":"What branch of the service was Hillary and her daughter in?","commenter_a":"Thank you for your family's sacrifice, sir, your son is a true American hero. Donald Trump doesn't know the meaning of the word.","post_message":"His son was killed while fighting for the U.S. in Iraq. Now, he's got something to say to Donald J. Trump."},{"comment_id":"10155023527124614","commenter_b":"Oh it was...Sears. It's been awhile since this happened.","commenter_a":"It's sad to see Sears going this way. They lost their way and are seemingly heading towards permanent closure. What's sad is I think Kmart is to blame, whoever at Sears approved that merger with Kmart as they were going through bankruptcy was crazy.","post_message":"Sears Holdings announced today the closure of dozens of Kmart and Sears locations, including multiple locations in California. Stores in Riverside, Bakersfield, Coalinga and Kingsburg will be closed by the end of March, according to officials. decision to close stores is a difficult but necessary step as we take actions to strengthen the Company operations and fund its transformation. Many of these stores have struggled with their financial performance for years and we have kept them open to maintain local jobs and in the hopes that they would turn around,\" officials said in a statement."},{"comment_id":"10154095809901094","commenter_b":"Only aliens would do what they are doing, along with stopping any alternative or sustainable agendas, fuel sources.","commenter_a":"Of course. Alien agenda. They are terraforming the planet for the tall greys. Chemtrails have the make up chemically for their perfect atmosphere. Pumping it into the earth with fracking etc. Polluting the oceans. Terraforming the planet. Goal is set for 2029. Decrease the human population to 500,000. Believe it or not this is the plan. The NWO/'Globalist' agenda IS the alien agenda. Total take over. Out of the shadows","post_message":"US Navy documents reveal plans to inject 20,000 tons of heavy metals, plastics and other highly toxic compounds over the next two decades into the oceans where it conducts its war games."},{"comment_id":"10153066527856336","commenter_b":"Please woman go troll somewhere else","commenter_a":"Poor guy","post_message":"Bristol Palin is engaged to Medal of Honor recipient Dakota Meyer – the Kentucky native is credited with saving the lives of 36 Marines, Army soldiers and Afghan soldiers."},{"comment_id":"430918413735174","commenter_b":"No inadiment object kills, ie, knife, gun, car, tire iron. It takes people to pick them up use/drive to kill someone. If y'all did your research, guns are not the leader in killing people. Your wife's Rolling pin is up there. Smh at some of you.","commenter_a":"Just waiting for the \"guns don't kill people\" squad","post_message":"\"More than half the women murdered each year are killed with firearms — and in nearly 75 percent of those deaths, the weapon is a handgun.\" Fault Lines: Death in Plain Sight, tonight at 10pET"},{"comment_id":"10154008998213797","commenter_b":"Whites wouldn't understand discrimination lol you sound stupid how about the jews they were white how about the Irish when they came to America they were white what about any German that came over after ww2 they were white now tell me again how ur comments are relevant","commenter_a":"It's not like she labeled their ticket with racial slurs. I guess I don't see what the big deal is. If the waitress had put \"white couple\" on a ticket, no one would care.","post_message":"WAITRESS LABELS CUSTOMERS: Kimberli Wilson went out to eat, and when the bill came, she couldn't believe what was written at the top. The waitress labeled her table by race. Here's what happened when she confronted the manager:"},{"comment_id":"10153456483261051","commenter_b":"I suggest you keep your bitch ass on the internet @username. You don't want to handle it in person.","commenter_a":"Most of the commenters here are transphobic scum. I hope none of you end up with a transgender child.","post_message":"This man handled his child’s funeral arrangements. When her friends showed up and looked inside the casket, they couldn’t believe their eyes."}]
