[{"comment_id":"1005179532861447","commenter_b":"Jail her for life","commenter_a":"What a screwball! Have a heart attack but don't beat your child! Moron!","post_message":"A Florida woman is accused of beating her child after the juvenile flushed more than $700 down the toilet: @webpagelink"},{"comment_id":"1053111538057600","commenter_b":"Both of these mooches need to get out.Better make sure they don't steal anything, like clinton did when she left the whitehouse.","commenter_a":"She looks bored big time.","post_message":"I agree!"},{"comment_id":"891950114161178","commenter_b":"That's her claim to fame, now and forever! Smh!","commenter_a":"Uh...that's a lie because I had never heard of her prior to the tape shenanigans! !!","post_message":"Kim Kardashian Says Her Biggest Regret Is Sex Tape With Ray J, But Shuts Down Claims That It Made Her Famous @webpagelink"},{"comment_id":"1669850779963439","commenter_b":"Fat bastard","commenter_a":"Another big jerk, oh bye the way michael were not muslim","post_message":"CLOWN SHOW."},{"comment_id":"10152955885854641","commenter_b":"we never tolerate any humiliation to our beloved prophet","commenter_a":"For some idiots act why do you drag the entire religion and keep mocking them... By speaking m I terrorist to you that I'm a Muslim ??? What do you have in mind?","post_message":"Muslims respond to Charlie Hebdo’s new Mohammed cover with mixed emotions: cnn.it/14xIMA6"},{"comment_id":"10152774422166051","commenter_b":"Why are some people allowed to have kids??","commenter_a":"Please, can we eliminate these sh*tbags from the gene pool?","post_message":"Police found this 3-year-old boy sitting in the backseat of a car in freezing cold temperatures. His dad and babysitter had something more important to worry about."},{"comment_id":"10152987066401336","commenter_b":"She is a f*&king idiot","commenter_a":"Once again the State Department speaks nonsense. Save your money - don't send your kids to Universities if she is any example of what they are turning out.","post_message":"“This is an insult to all the people in the world who are actually poor and are not blowing people up and not targeting Christians.\"  Laura Ingraham slammed U.S. State Department spokesperson Marie Harf’s suggestion that job opportunities are a way to fight ISIS. @webpagelink"}]
