[{"comment_id":"10153512540611491","commenter_b":"Blow this mf off the face of the earth","commenter_a":"@username Camangyan","post_message":"\"The only way for defending the sovereignty of our nation and its right to existence under the present extreme situation is to bolster up nuclear force.\""},{"comment_id":"10154593663574342","commenter_b":"Okay, she looks stupid with that dress, you ain't royalty Girl... that's something Kate would wear smh...or the Kennedy","commenter_a":"just hate the way he acts , cant even wait for his wife","post_message":"First Lady Melania Trump is wearing a sky blue, mock turtleneck Ralph Lauren dress as she walks into St. John's Church with President-elect Donald J. Trump.  Watch #Inauguration Day live-->@webpagelink"},{"comment_id":"10155589843380231","commenter_b":"That Saltine needs to o put on her white sheet and HOOD and shut the hell up.","commenter_a":"Which is why she's scared to show her face...stand by your convictions woman!","post_message":"At least one McKinney resident is standing by the police, insisting that the actions taken were appropriate."},{"comment_id":"10152800082481051","commenter_b":"Should have killed the scumbag the first time !!!","commenter_a":"It was a domestic violence crime, that should have kept him behind bars. You figure out why.","post_message":"This guy was released after admitting to stabbing a woman to death in front of her children. Guess what he did one month later."},{"comment_id":"768694459925723","commenter_b":"With alll the evil this Bitch has done. She should be disqualified from living!","commenter_a":"Since Hillary is under investigation she should be disqualified to run for President .","post_message":"Can America survive more of the same?"},{"comment_id":"10154612435337042","commenter_b":"For this comment I sincerely hope you choke on the next dick you suck. LMAO","commenter_a":"There's 83,000 Syrians and BLM thugs available.","post_message":"It's almost the holiday season -- and Macy's is hiring 83,000 seasonal employees.  Here's how you can apply:"},{"comment_id":"10154921930118690","commenter_b":"Karim Alyaa Dina","commenter_a":"Bal","post_message":"Integrating into a new country can be hard. That's why Horst Wenzel is teaching refugees the ins and outs of German dating culture."}]
