[{"comment_id":"10153814640313701","commenter_b":"He needs to be locked up and the key thrown away!","commenter_a":"Not to judge people on appearances, but I would seriously reconsider allowing my kid to be alone with the likes of that creep!","post_message":"A court document states that Toman admitted to sexually abusing a girl when she was between the ages of 11 and 17."},{"comment_id":"860902143955854","commenter_b":"That woman is a melodramatic idiot.","commenter_a":"Hey Nancy! Pot IS illegal and it STILL didn't stop him from giving it to his daughter! Legalize it already. Lets save Mexico from gang violence, free up the prisons, and start bringing in tax dollars from paper rolls and business sales. Enough is enough!","post_message":"What's YOUR take on the legalization of marijuana? @webpagelink #Pot2Blame?"},{"comment_id":"742531822604062","commenter_b":"PLEASE PUT HIS ASS IN IT","commenter_a":"All this shit is posted and nothing is ever going to happen to this goat fucker or his bestie Hillary Clinton","post_message":"Obama Caught In Major Lie - This Could Be The Nail In The Coffin [VIDEO] He cannot be trusted. End his term early. Do you want a president who will tell the truth?"},{"comment_id":"10153422363668984","commenter_b":"It was a fake statement, you irrelevant moron of an actress.","commenter_a":"So you find an actress that is stupid. Duh","post_message":"One word -- wow. ADVISORY: This article contains unedited profanity and obscenity that may be offensive to some readers. Do you think Senator Ted Cruz deserves an apology from this actress?"},{"comment_id":"10154784324202577","commenter_b":"First Amendment, Bitch!","commenter_a":"nothings going to change you yanks have been played for fools","post_message":"If Donald Trump truly wants to drain the swamp in Washington he must make an example out of this evil corrupt family and send a clear message that he is here to bring about real change."},{"comment_id":"515846775249931","commenter_b":"Does she know how ugly she is?","commenter_a":"Why would I care what a celebrity thinks or says.","post_message":"\"Oh, Donald Trump is whining about attention now?\""},{"comment_id":"10153601667565329","commenter_b":"Wtf buzzfeed? That chick with her fingers under her eyelids?!","commenter_a":"My leg spasms like that too. It's nasty!","post_message":"No. No you can not."}]
