[{"comment_id":"10153590637376336","commenter_b":"Nuclear is clean efficient and it's a country's pride! Do you know ordinary Iranians are really nice folks?","commenter_a":"Boy this Iran sure wants nuke power really bad, but what I don't understand is why they need nuke power to light up clay homes in the desert. Does anyone else see a different picture? America used wind, coal, steam as a first time power source.","post_message":"Iran will reportedly be allowed to use its own experts to inspect a site it allegedly used to develop nuclear arms under a secret agreement with the International Atomic Energy Agency."},{"comment_id":"10155651168671509","commenter_b":"And the only illegal immigrants that are going to be deported are criminal illegals.","commenter_a":"I wish the best for Trump. Anyone hoping that he fails is like wishing that the pilot crashes the plane that we're all on.","post_message":"This CNN Opinion writer believes a Donald J. Trump presidency might actually help US-China relations."},{"comment_id":"10154654748316320","commenter_b":"What barbarians","commenter_a":"Savages","post_message":"SHOCKING:  Video posted on social media during demonstrations Wednesday night in Charlotte appears to show a group of protesters beating up a man and stripping him of his clothes as he begs for mercy.  @webpagelink"},{"comment_id":"10154165693441748","commenter_b":"wanker","commenter_a":"Was it this way? @webpagelink","post_message":"lol"},{"comment_id":"1234200423314954","commenter_b":"Yes they are I seen it. \"All white people to the back of the line\"","commenter_a":"It is! People need to get over it. Standing on freeways and burning buildings is not the answer!","post_message":"Do you support or oppose anti-Trump protests?"},{"comment_id":"450484615139832","commenter_b":"Who give dam who she is jealous hater","commenter_a":"He sucks period!","post_message":"White House panicked..."},{"comment_id":"10152838610772144","commenter_b":"We get it, dude. Strong, intelligent women scare you.","commenter_a":"Filing charges for social media is ridiculous, it wont stick","post_message":"\"The amount of gender violence that I experience is absolutely extraordinary. And a significant part of my day today will be spent filing police reports at home about gender violence that's directed at me in social media.\"- Ashley Judd"}]
