[{"comment_id":"1820420311530016","commenter_b":"Feminazis!!","commenter_a":"Again Liberals at their stupidest.","post_message":"Women's protest"},{"comment_id":"1823440651212555","commenter_b":"Shut up bitch","commenter_a":"All Lives Matter, or NO LIVES MATTER. Sick and tired of people useing the Race card for their answer to all their problems. How about INDIVIDUAL RESPONSIBILITY!","post_message":"Ben Shapiro is a liberal's worst nightmare...."},{"comment_id":"818824291595686","commenter_b":"@username. I don't live it Kentucky Faggott. Ummmm, Self -Employed Trucker. You big and Bad, bring your punk Ass on. Scatter my Brains. You ALL talk, punk Bitch. Tell your mama, to get back on the Corner, her break is up!","commenter_a":"By Law, if the man is found not guilty, they cannot Execute him. This is a Bogus Site!!!","post_message":"SPREAD THIS LIKE WILD FIRE! This man is INNOCENT! Do not stop until this is HEADLINE NEWS in the #MainstreamMedia! NONE OF US ARE FREE UNTIL ALL OF US ARE FREE!"},{"comment_id":"1124947717560231","commenter_b":"Hurry up woman!!","commenter_a":"Alright, that's it...we're moving to Colorado. @username","post_message":"It is absurd that here in America, we remain the only major country on earth not to guarantee health care to all people. If this proposal for universal health care can win in Colorado, I believe it will spread around the country."},{"comment_id":"908033912663121","commenter_b":"Lowlife muslims","commenter_a":"Chaos? Why? They simply forfeit any match they refuse to participate in.","post_message":"You must be freaking KIDDING ME?!"},{"comment_id":"10153081516228822","commenter_b":"Eliza sounds like she's the one going to hell.","commenter_a":"Why is this topic constantly being forced down our throats","post_message":"It was a historic day for marriage equality in the US -- and Pittsburghers had a lot to say."},{"comment_id":"1262934473727561","commenter_b":"There is no 'weaker' version of the species. Both genders are the same species, just with physical differences.","commenter_a":"12,000 yrs. ago and they're still Lions 😭😭","post_message":"These images are just extraordinary. The cubs were just a few weeks old when they died."}]
