[{"comment_id":"1266650310018983","commenter_b":"@username so a WOMAN RAPED HAS MENTAL DEPRESSION FROM THE INCIDENT CANNOT NOW BUY A GUN TO FEEL SAFE AND ALL THIS WITHOUT A JUDGE OR DUE PROCESS???","commenter_a":"Meh, I'm glad he's trying something, anything to try and save one child. Better than 7 years of NRA owned congress not even acknowledging the Sandy Hook children. I'm a responsible gun owner that likes the idea of strong background checks and licensed gun dealers.","post_message":""},{"comment_id":"10153599019231323","commenter_b":"Sack the bitch","commenter_a":"Either the bigot does the job she's paid to do by the taxpayer or quit. Its quite simple.","post_message":"“To issue a marriage license which conflicts with God’s definition of marriage, with my name affixed to the certificate, would violate my conscience.”"},{"comment_id":"1267539270005791","commenter_b":"@username , is it all intelligent, competent and strong women that intimidate you, or just Hillary? Hillary 2016","commenter_a":"He can only intimidate weak people... She's the exact opposite of that! #VoteBlue","post_message":"BOOM."},{"comment_id":"1740985292881312","commenter_b":"And the KKK was started by and always was....the militant arm of the Democrat Party.","commenter_a":"The KKK purports to be a Christian group and they have committed more acts of terrorism against American citizens than any Islamic group. The biggest terrorist threat is from white, Christian men.","post_message":"Food for thought!  Thanks to Help STOP Truth Decay."},{"comment_id":"10153662620879877","commenter_b":"So that make it cool huh ? Betta keep close eye on ya little one bro ^^^^","commenter_a":"So you found people unconscious, didnt call an ambulance or anything you shot them . That's murder.","post_message":"Black Couple Killed by Police Were ‘Unconscious’ Inside Their Car When Officers Arrived. Watch what happened next below.   Grio fam, what's going on here? Seven children are now without parents..."},{"comment_id":"1082137365131066","commenter_b":"So yeah, drug addicts can just stop for a few days to pass a test...yeah no, sorry that isn't how it works.","commenter_a":"Anyone bother reading the article? \"..recipients (of welfare) choose the day and time of the testing..\" This is how it's done in all these examples and *THAT* is why there was only one person that failed. Most drugs are out of your system (and won't show on a dipstick test) in less than 48 hours. Do *RANDOM* drug screening like I have to do for my job. No advance notice, just get here now and pee in a cup. See how many fail then.","post_message":"There are stereotypes and there is reality. Welcome to reality."},{"comment_id":"1737148153188324","commenter_b":"That illegal ones should be deported or shot","commenter_a":"Total bullshit! This is a huge part of the democratic voter base by no mistake","post_message":"A Center for Immigration Studies report shows just how much immigration has skyrocketed since 1970. Shocking!"}]
