[{"comment_id":"10154462885161636","commenter_b":"The frequency of rape is not higher amongst Muslim migrants Red.","commenter_a":"3 white men gang rape a 15 year old boy while the country is worried about banning Muslims. Unbelievable","post_message":"At a fetish party"},{"comment_id":"1357303384289688","commenter_b":"Well how black do you have to be to be considered black... Since you have a PHD in biology","commenter_a":"\"If celebrating my roots and culture during Black History Month made anyone uncomfortable, those feelings were there long before a video and long before me,\" - Beyonce I totally agree!","post_message":"\"I'm an artist and I think the most powerful art is usually misunderstood.\""},{"comment_id":"1339410646123872","commenter_b":"Now I'm calling her a turkey! At least she could've let us see the eggs before she got comfortable again","commenter_a":"Somebody say bugs","post_message":"EAGLET WATCH! Getting closer, it could be any time now! We are watching and waiting as mom (Harriet) and dad (M15) take turns incubating the two eggs. Live video: Southwest Florida Eagle Cam MORE: @webpagelink"},{"comment_id":"1270740256295648","commenter_b":"* \"You shut your whore mouth!\"","commenter_a":"Shut your damn mouth.","post_message":"We're going to talk about this one for a while."},{"comment_id":"10154963089002619","commenter_b":"basically right","commenter_a":"Israel will have no true peace except for a short while when the Antichrist sets up his kingdom there during the tribulation period Israel will have a false peace for 3 1/2 years.Jerusalem will again be trampled down by the gentiles for a short spell and then Armageddon.and then Christs return to stop the madness.","post_message":"“The chain of attacks from Paris to San Bernardino, from Istanbul to the Ivory Coast and now to Brussels, and the daily attacks on Israel, this is one continuous assault on all of us.”"},{"comment_id":"10153646192306880","commenter_b":"They like getting in touch with their feminine side. :)","commenter_a":"I have the man color, slate grey.","post_message":"Let's face it, the \"rose gold\" iPhone 6s is pink."},{"comment_id":"10154366303774749","commenter_b":"British Airways are a really bad airline, I would not trust a child of mine to them!","commenter_a":"If you can afford a top boarding school then you can afford a return ticket. Maximise revenue from those with plenty of disposable income to subsidise economy travel sounds like an excellent way to do things - well done BA.","post_message":"Parents will now have to travel thousands of miles to see off their children."}]
