[{"comment_id":"10153656357399726","commenter_b":"Gray is a puss !","commenter_a":"Not just NO but Hell No! Graham cracker thinks alot like Obummer!","post_message":"Should Ben Carson apologize?"},{"comment_id":"10157769548850725","commenter_b":"Go kick her butt.","commenter_a":"you go donald !","post_message":""},{"comment_id":"936780129786105","commenter_b":"This lawlessness will stand until the National Guard is called out to do a sweep for illegals. If these sanctuaries are allowed to continue more lawlessness will occur in its most violent forms.","commenter_a":"Not proud of the mayor of Chicago for sure.","post_message":"Rahm Emanuel to Illegal Aliens after Trump Win: Chicago is Your Home – You are Always Welcome Here. @webpagelink"},{"comment_id":"10156057396095551","commenter_b":"Everybody knew that! No way does a great 5 yr old know anything about imigration. This was a liberal setup!","commenter_a":"The Mexicans played a dirty trick on On the Pope. Perhaps they will be rewarded in hell.","post_message":"I KNEW there was something fishy about this..."},{"comment_id":"10153532246695779","commenter_b":"She looks ugly with that hairdo","commenter_a":"This was a beautiful version! She added her touch yet kept the timelessness of this classic in tact. Bravo","post_message":"Sia has covered the Nat King Cole standard \"Unforgettable\" for the upcoming Finding Dory the long-awaited sequel to the Pixar hit Finding Nemo. Watch her debut the track below, during an appearance on 'The Ellen DeGeneres Show.'"},{"comment_id":"10153664203915950","commenter_b":"And you should be judged because you're a moron, Mary.","commenter_a":"How are you going to ban an American Muslim???!!!!! Wake up Mr. Trumpo!","post_message":"Donald J. Trump is pointing to the deadly Orlando attack to reiterate his support for the Muslim immigration ban he proposed last winter."},{"comment_id":"10153004075042061","commenter_b":"These magnificent creatures were never meant to be made to stand on their heads or do any of the other ridiculous tricks they're forced to do.","commenter_a":"Stop hitting elephants.","post_message":"An elephant attacking your car - never a good thing: abcn.ws/1LxMzPP"}]
