[{"comment_id":"10153174046691336","commenter_b":"Then stand up and stop him!","commenter_a":"Annddd. What do you intend to do about it? We're waiting.","post_message":"'Presidents have the ability to take executive action, but they don’t have the ability to change the law.'  House Speaker John Boehner said that President Obama clearly overreached with his executive action on immigration and changes to ObamaCare on Sunday Morning Futures with Maria Bartiromo."},{"comment_id":"10153721851426178","commenter_b":"People are waking up. They don't need TV or papers anymore,until the net is more strangulation than it is now, serious voters make up their own minds and look at all sides of issues important to them. They are no candidates that one can agree 100% with but at least there are many out there there one can reconcile most of their views with and throw support that way.","commenter_a":"I have no use for the networks...","post_message":"Despite being the biggest story in the pro-life movement since Roe v. Wade, the networks couldn't care less."},{"comment_id":"10155002829744411","commenter_b":"Leaks: the new news.","commenter_a":"u re a loooooser baby ...so why dont you kill yourself....","post_message":"appears, however, that after eight years the administration has suddenly awoken to the threat."},{"comment_id":"10156482909420354","commenter_b":"Take your hijab and stick it where the sun does not shine.","commenter_a":"How about a 'dress American day' for the Muslims? I thought not.","post_message":"Wear-a-Hijab-for-a-Day Events at Universities!"},{"comment_id":"10153072204470329","commenter_b":"Girl I'm trying to kick it with u","commenter_a":"Leida Maria1020806391970270610210023845541574Alicia Jo","post_message":"We all have that one co-worker who is obsessed with Beyoncé...  via BuzzFeed BFF: @webpagelink"},{"comment_id":"10158110429230206","commenter_b":"We should get rid of both of them . Say no to Armageddon .","commenter_a":"Donald Trump went from selling luxury condominiums to selling empty dreams .","post_message":"“If somebody wants to go out and say that they voted for this person or that person, they can do it. But that ballot is sacred.”"},{"comment_id":"952115494844980","commenter_b":"Because Mark she would be a WOMAN President!!! That's it!!!","commenter_a":"I'm from Brazil, and i support @username to President of USA. <3 #GoHillary","post_message":"Rising fifth grader Emily had a big question for Hillary in New Hampshire:"}]
