[{"comment_id":"1738376596301641","commenter_b":"She wants you to lick it for her ! Lol","commenter_a":"Someone should tell her to lick her butt hole like a dog and mind her own dam business !","post_message":"Hillary Clinton told a group of supporters on Wednesday that America has \"too many guns.\" Yes, that's right. The presidential candidate who claims to respect the Second Amendment is upset that Americans own more guns than she is ok with."},{"comment_id":"10154596744362439","commenter_b":"Shoot that prick.","commenter_a":"so WE GIVE UP ON YOU BASTARD.","post_message":"That's why Europeans have to give up on the EU, if they hope to survive."},{"comment_id":"1203394389723827","commenter_b":"We need to run over them with a truck. They will move.","commenter_a":"I don't think protestors should block any roads or destroy any property. Its says a peaceful assembly, not blocking roads, jumping and climbing on trucks and trashing others property or businesses. If they can't assembly peacefully then they need to be arrested.","post_message":""},{"comment_id":"10156259154010354","commenter_b":"Well, she won't have to worry so much about those tax breaks she was looking for in America. Now she has not reason to stay here.","commenter_a":"You hate America and Republicans, well, that's fine, we won't bother to see your movies.","post_message":"The America hater's new movie is hemorrhaging cash..."},{"comment_id":"10154382279344497","commenter_b":"Aye. Fuck bitches, make money.","commenter_a":"Single man enjoying free milk, basking in savings after not buying cows.","post_message":"Via ClickHole:"},{"comment_id":"10154208649726770","commenter_b":"She needs to go so she can do no more damage","commenter_a":"She will be dumped her country is tired of Muslims ruining their country raping their women","post_message":"Merkel's party is second in polls for the first time since 2010"},{"comment_id":"986861908039953","commenter_b":"President Obama is the best. Elizabeth Warren should have run for president because she would have been great just like Obama..STOP HATING PEOPLE. Recognize greatness...","commenter_a":"That's just great Thank you Mr President and Elizabeth Warren , your the best !!","post_message":"They are kicking Wall Street's ass!"}]
