[{"comment_id":"10153004550474411","commenter_b":"U shts invaded our lands. Ur the problem.","commenter_a":"ban the Muslim black garbage bags","post_message":""},{"comment_id":"1296652160354811","commenter_b":"Your wrong again people ! stop with the Race card ! Wanting our borders closed and secure to stop illegal aliens and drugs from getting in our country is Not Raciest ! and we are at War with Rdical islam so yes all immigration should be Haulted Untill ISIS is Destroyed ! it's about protecting AMERICA and AMERICANS ! The Democrates do not care about securing AMERICA and protecting AMERICANS","commenter_a":"As a German living in Ireland I have to say that the choice can only be Clinton or Sanders! Trump and the likes are disqualified for being racists, bigots, etc.!","post_message":"'It's like a comedy.'"},{"comment_id":"10153876230626130","commenter_b":"Of reported rapes (is estimated that nearly 60% of rapes are unreported), the percentage of false claims is the same as any other crime, which varies from about 2-8%. Rape culture is automatically assuming the victim is lying when it's statistically unlikely, so congrats, you are part of the problem.","commenter_a":"There are no evidence supporting an existence of \"rape culture\". There are rapes. Go to the police. But there are also plenty of lies and no facts aqusation of rape by some women","post_message":"Keep speaking up, Nadia."},{"comment_id":"10153776630979714","commenter_b":"Woman here. Would never get an abortion myself, but don't want to impose my beliefs on others so if others want to abort, go ahead. I do not feel the American tax payers should have to fund others abortions, though.","commenter_a":"You have no place to discuss abortion or planned parenthood unless you are a female.... If you're a man, shut the hell up because most of you cant even tell me how many days are in between menstral cycles.","post_message":"Do you, Lena Dunham."},{"comment_id":"1536355363064383","commenter_b":"I can go tomorrow bitch","commenter_a":"Uriel Campos explains it all","post_message":"\"I don't think I've ever been without sex for as long as I have now.\""},{"comment_id":"1055483257833554","commenter_b":"Hell no lol","commenter_a":"@username Marcela Guzman-Medina","post_message":"NIGHTMARE: What began as a normal day at the beach ended with amputation after a man contracted a flesh-eating virus."},{"comment_id":"489292257897396","commenter_b":"As long as yours dangerous people out there with weapons there's no reason to take away mine. If you take away all the guns from law-abiding citizens all you will have left are criminals with guns and there's no way to get all of those guns away from them","commenter_a":"What's the point in saying this every time and never doing anything about it? Of course, more gun control. Giving guns to the general public is fucking stupid.","post_message":"Once again, America needs to answer this question..."}]
