[{"comment_id":"10155029818006543","commenter_b":"Senator Wazzy got slapped on by Senator McMackinz. Tell a ho where she's at! @webpagelink","commenter_a":"Mitch McConnell email inbox is full. Let jam his faxes with the Coretta Scott King letter now. DC Office : (202) 224-2499","post_message":"In an extremely rare rebuke, U.S. Senator Elizabeth Warren was cut off while reading a 1986 letter by Coretta Scott King on the Senate floor @webpagelink"},{"comment_id":"1003834523018162","commenter_b":"Fuck her she hates white's. She only hires blacks.","commenter_a":"she had made millions off the white people and i do mean millions.let her take some money and give it to street people or vets which i doubt she will she would only let them starve!!!!opra disappoints me as i thought she wouild be the last person to say something like that!!!!!!","post_message":"Oprah Claims White People Are The Cause Of Racism In America.  What a hypocrite, she is the racist.  Do you think Oprah is bigot?"},{"comment_id":"1716476818593163","commenter_b":"Well she is a WITCH.","commenter_a":"what a joke. anyone with any brains would look at her trend to not do the right thing. we have had enough bad behavior in the white house the past 2 elections we do not need more.","post_message":"According to Hillary's campaign manager, voters trust Hillary because she's completely upstanding, honest, and scandal-free. Claims to the contrary are nothing more than a GOP witch hunt."},{"comment_id":"10156328983890389","commenter_b":"just a dried up old liberal lying witch .","commenter_a":"The appearance of former secretary of State Hillary Clinton before the House Select Committee on Benghazi raised very important questions on diplomatic security, the relationship between the secretary of State and her ambassadors and leadership. My experience during 38 years in the Foreign Service, including six assignments as an ambassador, has given me a perspective on these issues that differs from some of the arguments developed by the Committee. First, about security. Every secretary of State and every ambassador has security as a top priority. It is a dangerous world, and we are everywhere in it. An ambassador is responsible for the security of her personnel and her embassy. Internal defense plans, risk assessment, movement controls, adequate defensive systems these are all on the shoulders of the chief of mission. The department is responsible for getting her what she says she needs. There is no perfect security. Risk has to ...","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1040915009338084","commenter_b":"'@username your argument fails in a few ways. 1. A child is not a child until it is born. 2. Her body, her right. 3. What if she was suffering complications from said pregnancy? What if she was raped? What if it was incest? Would you still argue that she hasn't the right? Because if so, you're giving a living woman less bodily autonomy than a corpse.","commenter_a":"good","post_message":"There has been no time since Roe v. Wade when abortion hasn’t been under attack... But this moment is different."},{"comment_id":"10153226865953132","commenter_b":"He's happy. That's all that should matter","commenter_a":"Sarah Nemes","post_message":"Bruce Jenner's children are rallying around his decision to transition to female."},{"comment_id":"10155025843208734","commenter_b":"Oh I remember lol","commenter_a":"Thats Ari Moran! I know him! Great officer!!!","post_message":"We're live in studios with Fairfax County Police Department's new bloodhound, Juneau! 😍❤️🐶"}]
