[{"comment_id":"1342374952487749","commenter_b":"We dont need these winers let them stay home,they wont be missed","commenter_a":"Let them skip more peaceful that way no whining","post_message":"LAME EXCUSES! CRYBABY DEMOCRATS To Skip Inauguration For FAKE Reasons Petty AND Partisan!"},{"comment_id":"999929080073847","commenter_b":"Lol 1800 slap both of y'all bitches","commenter_a":"@username @username this is whats gonna happen whenever yall talk shi, ima walk my hoes lmao","post_message":"Really Out Here Walking Them On A Leash!"},{"comment_id":"10154333697561509","commenter_b":"@username You jsut described yourself and your mother. You crazy old lady","commenter_a":"Have you noticed who the Trump haters are? I have.......Go Trump.","post_message":"\"Six months out from Donald J. Trump's foray into American politics, the national media is finally coming to terms with a hard truth: It's Trump's world, and they're just covering it.\""},{"comment_id":"779121095562429","commenter_b":"You are so clueless.","commenter_a":"Sadly, his supporters will never watch this video. They are in utter denial. All they care about is his promise to stop immigration of Muslims and Mexicans and to keep white privilege in place. There are a lot of bigots/racists out there.","post_message":"Donald J. Trump has said a lot of things. Mike Pence said he didn’t say those things. He did. Here’s proof."},{"comment_id":"10153340165340927","commenter_b":"@username Please elaborate...","commenter_a":"How can anyone expect GOD to bless America, if we the people keep electing leaders that are legalizing sinful behavior.","post_message":"\"Well, to be honest, we need to go back! Back to God. Back to respecting and honoring His commands. Back to COMMON SENSE ...\""},{"comment_id":"10154064327489575","commenter_b":"Rape him then burn his sick a$$","commenter_a":"Justice.","post_message":"A jury found William Gholston guilty of murdering 15-year-old Ben Davis High School student Dominique Allen. Allen’s burned body was found in the backyard of a near west side home in 2014. She had been strangled and her feet and hands were bound with a wire."},{"comment_id":"10157239899915725","commenter_b":"Democrat lives don't matter.","commenter_a":"Say it Mr President .","post_message":"ISIS exploded on Hillary Clinton's watch- she's done nothing about it and never will. Not capable!"}]
