[{"comment_id":"1342964245730921","commenter_b":"Yes, Hillary ALL THE WAY!! Andrea, go away!!","commenter_a":"She asked the tough questions and Hillary was very professional and gave very informative answers. All together I think it's helped her giving this interview. Trump could never have been so poised with his answers. I think she has been doing great with her campaign. Hillary 2016","post_message":"This is not journalism by any measure."},{"comment_id":"879507305458832","commenter_b":"she wants everyones money , she is so poor !","commenter_a":"Or Vince Foster. Can't forget her law partner who magically killed himself with an antique firearm that didn't function....Interesting.","post_message":""},{"comment_id":"1014820688580048","commenter_b":"Time for muslims to take their a$$e$ back where they came from","commenter_a":"That's the national anthem. If you aren't willing to be An American than go home! And take the stinking socialist with you. You can take the atheists and the Mexicans.","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays @webpagelink"},{"comment_id":"1339079532789860","commenter_b":"Yo she cheated she should be feed the next chick","commenter_a":"MAKE HER EAT A BAG OF THEM","post_message":"Chip Roulette: Who Will Eat The Carolina Reaper Chip, The World's Spiciest Tortilla Chip, First?"},{"comment_id":"1372709936105605","commenter_b":"someone should fire up her ass","commenter_a":"DISGUSTING NEWS BARBARIC..","post_message":"WTF IS WRONG WITH THIS CULTURE..."},{"comment_id":"10158500628960389","commenter_b":"As a Hispanic born in the US, no Jorge Ramos! This country does not belong to illegals! You're are crazy and delusional, if you love Mexico so much go back there and see how it goes for you! We are not against legal immigrants, it's the criminal illegals that should go back! So screw off and shut up!","commenter_a":"Deport Ramos. I'm an immigrant and can't stand him.","post_message":"Univision anchor goes on an ethno-nationalist tirade."},{"comment_id":"10153875721181770","commenter_b":"She is sipping Hillary juice.","commenter_a":"Nancy Pelosi IS a train wreck - so I would expect nothing less!","post_message":"Nancy Pelosi's Sunday morning interview on CNN was an absolute train wreck..."}]
