[{"comment_id":"10152892200414753","commenter_b":"Bitch","commenter_a":"how incredibly low and self absorbed are you that you could steal money and attention this way.hope you get all the attention you want now.","post_message":"A Florida woman is facing felony charges after cops determined that she faked having breast cancer in order to swindle thousands of dollars out of friends, family, and her supporters in the community."},{"comment_id":"10153469659427042","commenter_b":"She's getting a life now getting away from that abrasive idiot.....stop with the marriage BS married or not no woman should be abused","commenter_a":"It means there not married right!! Now they have a child with no Dad , that's why Hashem laws say first we get married than have children . Are actions will let us all see our Rebbe King Moshich . She should get a life. Yechi Hamelech","post_message":"'I have the courage to actually do something about it this time.'"},{"comment_id":"929408747192304","commenter_b":"As stupid and ugly as her mom!!","commenter_a":"She can't help it...look who her parents are!","post_message":"Chelsea Clinton....you are an IDIOT."},{"comment_id":"10153210594174270","commenter_b":"Every female to attempt the Marine Corps Infantry Officer Course...failed. And that's a fact","commenter_a":"Come on you all should know that males have to make second attempts at ranger school sometimes. This is not a female only type thing. Please for your sake do at least a google search of something before acting like only females get the second attempt","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153536003698967","commenter_b":"God... I would love to work here JUST so that I can belittle upper management when they fire my ass for pulling an 'Office Space'... Also... I can see a documentary in their near future.. Similar to the one about Walmart... ... Can't wait!!!","commenter_a":"I hate to hear that they run Amazon like a Randian dystopia. I use them for so much stuff now. What a shame.","post_message":"Amazon's corporate culture is terrifying."},{"comment_id":"1668356646775381","commenter_b":"The truth will set you free and she spoke the truth.","commenter_a":"Fox should listen to its viewers. Go Stacey","post_message":"Stacey Dash has been suspended by Fox News for saying this to Obama. She needs our support. Should Stacey Dash be reinstated?"},{"comment_id":"10153240911786491","commenter_b":"Women spend 25 percent of their lives menstruating. That is the biggest reason we spend more time in the bathroom.","commenter_a":"The only way to have bathroom equality is for women's toilets to have the same turnover rate of women coming out of the bathroom as men. Just because it's the same physical size restroom doesn't mean it's an equal situation.","post_message":"'Many public restrooms continue to be facilities that are equal in physical space, while favoring men’s bodies, experiences, and needs.'"}]
