[{"comment_id":"1390703587614315","commenter_b":"We have no way of knowing how Bernie Sanders would have weathered the inevitably nasty storm against him if he had been the nominee.","commenter_a":"I'm really angry at Democrats sending the candidate least capable of defeating Trump into the general. What morons. They saw polling showing that Sanders would trounce Trump by double digits and yet decided that Clinton was the \"safe\" bet??? Effing morons.","post_message":"Donald J. Trump's campaign tells us a lot about what kind of Commander-in-Chief he would be."},{"comment_id":"10154026224212869","commenter_b":"I agree! There are plenty of legitimate issues that should convince anyone paying attention that Clinton does not belong in the White House. I feel like spinning 100 different (and in many cases overwhelmingly mean spirited) conspiracy theories makes the relevant confirmed issues on either side carry a lot less weight. I'm not saying that I don't think her health may be an issue, or even that it shouldn't even be written about, but there are 100 different reasons for a vehicle like that to include a wheelchair lift.","commenter_a":"Is anyone else tired of these feeding frenzies, I for one am.","post_message":""},{"comment_id":"547425292114717","commenter_b":"She needs to be exposed for every crime she has committed and she needs to leave her campaign so she can face charges for every one of those crimes!","commenter_a":"Oh! Bet me!","post_message":"Hillary is officially paying the price for all the crimes she has committed.  Awesome. She is a criminal.  Can we get 10,000 'LIKES' for Hillary getting arrested?"},{"comment_id":"10153242310616336","commenter_b":"Well what does Baltimore have to say now? I just can't believe those two cops were harassing those two nice men.","commenter_a":"They thoght they could get away with it!","post_message":"UPDATE: A third suspect has now been arrested after the shooting prompted a statewide manhunt.   The suspects accused of killing two Mississippi police officers in the line of duty were reportedly arrested early this morning."},{"comment_id":"10154060101734087","commenter_b":"Hillary for Prison, if you vote for her you are worse then trash","commenter_a":"Suck on it Donald!!!","post_message":"Trump had choice words for a GOP senator who will not be voting for him."},{"comment_id":"667325733458005","commenter_b":"Gloria I agree. Get their muslim butt back where they came from","commenter_a":"Muslims if you don't like the way America's are then leave. Clint Eastwood has every right to be artistic and make true movies about who you really are then leave AMERICA. We have freedoms you do not have so leave because we will not stop being Americans. The movie was very well done and true to the ooint.","post_message":"This angry Muslim group wants Clint's head, but he's not backing down.  He is a true American, and a real patriot.  Can we get 125,000 'LIKES' for Clint Eastwood?"},{"comment_id":"1003873189632434","commenter_b":"When you take into account what these 2 young men did taking beer from a grocery store well there's going to be consequences plus swinging a skate board well the Police have to do something...I wish I were standing holding a sign I Support the Police Department !!","commenter_a":"I hate to say this but the store video does not lie. Now hopefully they'll release the bodycam video too. Now would be a great time to prove just how successful those are.","post_message":"The Olympia police officer who shot two men last week has given his account of what happened to investigators, and the department isn't releasing information.   More than 100 people packed city hall tonight demanding immediate changes in police accountability >> @webpagelink"}]
