[{"comment_id":"10153346238078690","commenter_b":"Still as barbaric as before, that was why it was difficult for Mandela to organized them and fight for free. That is why he has to do it on his own. Animals never changes.","commenter_a":"Free from the ravages of inteligence and absolutely racist !","post_message":"Thousands expected to march in South Africa against attacks on foreigners @webpagelink"},{"comment_id":"555840684604224","commenter_b":"Look how christianity views woman it's almost as bad","commenter_a":"What confuses me is why women would want to stay in this horrific religion that view women and children less than animal's. Mohammed is dead he isn't coming back !!!","post_message":"Spread this..."},{"comment_id":"767530393325420","commenter_b":"If employers are fined and punished who hire illegals and no welfare benefits were given to illegals, they'd have no incentive to be in the US and they go home..","commenter_a":"Senate Democrats need to stop being obstructionists!!! Keep up the good work Congressman.","post_message":"If Senate Democrats aren't happy with the House-passed #DHS funding bill, then they should allow debate & amendments-- that is how our government is supposed to work. I fear that Senate Democrats are playing politics with America's national security in an effort to protect the President's unconstitutional #executiveaction and to protect themselves from having to go on the record with their pro-#amnesty positions. #DontShutDownOurSecurity"},{"comment_id":"10155546384855192","commenter_b":"Don't worry God would not choose an unworthy Woman to Have His Child. People no matter how much they serve Christ can still go through very hard times. He didn't say because you love Him, and serve Him that life would be easy.","commenter_a":"First of all to those that say praying won't help them.....You better understand that they don't worship God, or believe Jesus Christ died for their sins. Maybe that is why their world was shaken. God isn't playing. These are the end times. They need to stop the things they do, and accept Jesus Christ in their hearts.","post_message":"The death toll from Nepal's earthquake soared past 3,700 Monday and rescue workers are still struggling to reach two days after the disaster."},{"comment_id":"970145053025967","commenter_b":"Remember: it's all politics ...and about votes. The GOP is garnering for the 'jewish' vote in 2016.","commenter_a":"Talk about shooting yourself in the foot...! Between this \"journalist\", Boehner, and Bibi, the court of public opinion may not be so kind. Obama will most likely rise above the pettiness, but like he said, there WILL be consequences. He is after all the actual elected President of the United States.","post_message":"Conservatives and Pro-Israel groups are now actively undermining the US President. This is about as un-American as it gets."},{"comment_id":"1105433506199543","commenter_b":"This Woman is not Presidential Material ! Please don't listen to her lies!","commenter_a":"So true","post_message":"#NeverHillary Allen West Republic @webpagelink"},{"comment_id":"917667135033132","commenter_b":"The ignorance of this bitches statement is mind boggling","commenter_a":"No McDonald's worker anywhere on this planet deserves anything But minimum wage... How are you gonna demand a higher wage but you cant even make sure there are fries in the bag with my order.... Always giving people the wrong shit, no sauce, no straw... Please pull up and wait at our drive thro becuase we cant make fast food fast enough.... Get the fuck outta here... Give that extra money to doctors or something... They cant fuck up or your dead..... Absolutely ridiculous... Fast food isn't a damn Career.","post_message":""}]
