[{"comment_id":"10153742340973812","commenter_b":"Just drop your Facebook account. We'll all be happier and you can be crazy all by yourself with no interruptions.","commenter_a":"Please post worthy news and not perversion... Next will be pedophiles wanting to marry little kids.","post_message":"Meet James Yates and William Smith, Jr., the first same-sex couple to get marriage license in Rowan County, KY. This was their sixth attempt to get a marriage license."},{"comment_id":"1043010225790700","commenter_b":"She'll want you to lie and cheat just like she does. Better stay clear of that lot.","commenter_a":"This is why I'm proud to be a Democrat Hillary is on her way Sign me up Hilary Whatever you need me to do Love is better than hate Love you Republicans","post_message":"Tonight: Hillary Clinton at the #DemConvention. Watch the speeches LIVE on Twitter now."},{"comment_id":"1305722922778581","commenter_b":"Sean Connolly","commenter_a":"Logan Laybolt","post_message":"Tian Tian the panda enjoyed the snow this morning!  Video via the Smithsonian’s National Zoo and Conservation Biology Institute"},{"comment_id":"878409832218766","commenter_b":"Too lazy to be princess! Punish her to work at Royal Household!","commenter_a":"Like mother like daughter","post_message":"‘Scrounger’ Beatrice’s three holidays in a MONTH"},{"comment_id":"493850430805537","commenter_b":"Shut Her Down !","commenter_a":"They spend money that is not theirs and should be made to pay it back.","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"10154130637278352","commenter_b":"I'm positive with all the comments you got some backlash lol, but keep in mind they're fucking disgusting bitches ha ha ha ha","commenter_a":"There's nothing wrong with breast feeding, but this is disgusting to put your almost 4 year old on the boob.... Want your child to drink your breast milk? invest in a pump....","post_message":"Mother defends breastfeeding her three-year-old son claiming cows' milk is bad for children as she encourages more women to feed toddlers this way"},{"comment_id":"10156235463225354","commenter_b":"Center right of what? The equator? He's a hair away from being a communist, if he's not already.","commenter_a":"If you aren't a conservative why are you s republican?what would be the difference between a democrat and republican.and ANYONE that votes for Obama is an extreme leftist period.","post_message":"What a guy!"}]
