[{"comment_id":"1105849479462885","commenter_b":"She kills people and babies why would she care about a beautiful animal she has more money in her family clinton foundation to buy the farmer a new farm. Shes a disgrace .how can people turn a blind eye to what she has been doing to our country.Theres PROOF.SHE HATES AMERICA. SHE LIKES OUR MONEY ..THATS IT","commenter_a":"Love it!","post_message":"I can't believe THIS!"},{"comment_id":"528240787342392","commenter_b":"she looks like a fat ape","commenter_a":"What a wonderful First Lady!!! Prayers for Candy & Ben Carson!!!","post_message":"Candy got to meet some great people this weekend in New Hampshire! #BC2DC16"},{"comment_id":"10157187236600354","commenter_b":"Feminists need to stage another protest akin to their bra burnings in the 60s. Perhaps a massive Hijab burning in multiple western countries.","commenter_a":"So funny how the media always pushes these anti-Iran stories even though iran is 1000x more secular than our \"allies\" Saudi Arabia... let's hear about how many women Saudi Arabia executed breitbart. Stop the Iran propaganda pieces, you're turning into another Fox News.","post_message":"When will feminists take on the REAL \"War on Women\"?    “...promote immoral and un-Islamic culture and promiscuity...”"},{"comment_id":"10154655361619170","commenter_b":"She looks like calling us Deplorables. She should look in the mirror..","commenter_a":"And she belongs in a mental hospital.","post_message":"Here's what Hillary thinks about you. Now click to join us in a little experiment concerning this."},{"comment_id":"936295619744244","commenter_b":"having a man in charge hitting his daughter then inviting others to watch will prepare her for the abuse she will subject herself to in her broken down future, all men win","commenter_a":"You can't even spank your child's butt without the school, neighbors, and everyone else screaming abuse. This subject is absurd.","post_message":"The debate between discipline and child abuse continues with this odd case."},{"comment_id":"10156207727725354","commenter_b":"another fucking scumbag please americans this has 2 stop we need term limits or our country is going down the tubes","commenter_a":"We want Trey Gowdy","post_message":"He's the odds-on favorite, but will likely face a strong and credible challenge..."},{"comment_id":"10153361395611107","commenter_b":"Class on the left, and no class on the right. She is just another, inept, liberal, lying skank. I put her in the samne group with that traitor, Hanoi Jane.","commenter_a":"Better yet , hit her at her cankles. Paul/Trump ... Trump/Paul for America, not the establishment","post_message":"Guess who I ran into? Tune in to @CBS now to find out why I think she should forever be precluded from being potus"}]
