[{"comment_id":"548856361983005","commenter_b":"Yes","commenter_a":"Yes","post_message":"The NFL, coaches, and fans are sick of him and his garbage. The league has had enough. Do you think Kaepernick should be ejected from the league?"},{"comment_id":"10154798309806002","commenter_b":"Women do it too!","commenter_a":"Why would u allow a man to babysit your kids hell no only man I'd allow is my father and my husband","post_message":"A 30-year-old man allegedly molested toddler-age children he was babysitting while living in Michigan."},{"comment_id":"10154135870346336","commenter_b":"@username OMG---More Trump Fabricated LIES!!!Trump Played Everyone Like A FIDDLE With Those TRUMP Planted PAID Protesters, Trump Now Has 20 Secret Service Guys Guarding Him At His Rally, EGO IS THE WORD...He Really Knows How To Play the Media & Followers *NEVER TRUMP* TRUMP Wants to TURN Our Military INTO ZOMBIE TeRRORIST Animals To Beat ISIS...BUT OUR MILITARY IS AN ELITE GROUP & Has Rules & Morals.... ISIS is A BAND Of MURDERS & CRIMINALS.... TRUMP Wants A WAR $$.....People Are Blinded by Trump's Rhetoric and can't SEE Trump Sending Our Young Adults To Fight An All OUT WAR AGAIN! Government Welfare KING DUMP Trump doesn't need anyone's HELP exposing His LIES Trumps own EGO Is His Own Nemesis.. ??Has Trump Gone From Selling Realestate Properties To Selling Our Whole Country!TRUMP wants to Do Away with Social Security & Medicaid For Our ELDERLY!!! HOW is Trump Helping American JOBS when ...","commenter_a":"Typical Trump...talking about anything other than specifically HOW he is going to make AMERICA great again!! Just saying it won't make it so!! Maybe that's why he gets no more than 35% of the vote. The other 65% are on to his BS...He only cares about Trump not one of his supporters! Wake up people!!!","post_message":"\"[Marco Rubio] made a statement that I had small hands. He made it up. He's a politician. Politicians lie.\"  Today on \"MediaBuzz,\" Donald J. Trump talked about the \"hands\" story."},{"comment_id":"10153434419026051","commenter_b":"How does such an ugly and lazy guy find that many women to breed with him.","commenter_a":"Can you say \"vasectomy\"..and a \"JOB\"","post_message":"This guy has 26 kids with 15 women and has been getting $50,000 per year in benefits. Now he’s getting a brand new special gift."},{"comment_id":"10153372817373812","commenter_b":"Sign me the ef up!","commenter_a":"@username thank gawwwwd","post_message":"FDA approves new drug that claims to eliminate double chins: @webpagelink"},{"comment_id":"760686517397260","commenter_b":"Stephanie Hathcox","commenter_a":"John Rivera","post_message":"In case training your dog to shake hands weren't impressive enough."},{"comment_id":"10153816653768854","commenter_b":"Did you see the gaggle of stupid white girls in the \"shield?\" I wonder why they hate their daddies so much.","commenter_a":"All that money spent, all the debt incurred, to produce kids like that.","post_message":"Liberalism is a Mental Disorder: Professor of Media Threatens Media with Mob Violence for Trying to Film Protest  [VIDEO]"}]
