[{"comment_id":"10152993326411336","commenter_b":"bahahaha hahaha........I love your comment....exactly","commenter_a":"So we agree....no gun is responsible for a crime.","post_message":"“No religion is responsible for terrorism. People are responsible for violence and terrorism.”  Moments ago, President Barack Obama delivered remarks at The White House Summit on Countering Violent Extremism. @webpagelink"},{"comment_id":"10154048881589753","commenter_b":"They both need to be charged she was sorry as hell to let him do that your kids come first","commenter_a":"I sure hope they don't place that child back with her. Lock her up until she is too old to bear any more kids. Where are the Fathers nd Grandparents of these abused kids?","post_message":"An Arkansas mother and her boyfriend were taken into custody and charged with first-degree domestic battery after the woman’s four-year-old daughter was found zip-tied to her bed, reports KTLA. Jennifer Diane Denen, 30, and her 47-year-old live-in boyfriend, Clarence Eugene Reed, both residents of Hot Springs, were taken into custody last week after a staff member at the Cooper-Anthony Mercy Child Advocacy Center found Denen’s daughter to be severely malnourished and abused, according to The... @webpagelink"},{"comment_id":"1361247917304790","commenter_b":"She is a criminal","commenter_a":"His decision to not pursue this is a good thing in my opinion. He won the presidency, why continue to invest energy in Hillary Clinton? She should be irrelevant to him now.","post_message":"Donald J. Trump promised to prosecute Hillary Clinton for her use of a private server if he won the presidency. Now that he has been elected, it seems he has changed his mind."},{"comment_id":"10153653816037377","commenter_b":"NO AMERICAN FLAGS!","commenter_a":"The color of Hillary stage is UN blue. No America to be found.","post_message":"As the Democratic National Convention entered its second day, presumptive presidential nominee Hillary Clinton's campaign is getting ready for Wikileaks to release more purloined emails and downplaying their potential impact."},{"comment_id":"10154024832271756","commenter_b":"Garbage men make a shitload of money. pun intended.","commenter_a":"I found a great way to pay off my student loans....after college I got a job","post_message":"The government estimates that some 41 million students together owe more than $1.2 trillion."},{"comment_id":"949147745161454","commenter_b":"Nancy Pelosi said on the House floor that 30 million people were uninsured in the United States. After Bummercare, we were told that 40 million Americans were still uninsured. One year later, we were told that 55 million Americans were either uninsured for under insured. Islamic religion prohibits insurance because they claim it's gambling and are exempt from getting insurance. With the current influx of refugees and people sneaking into our country and getting free medical, welfare and food stamps, how many millions are now in this country unisured or under insured? Why would anyone bother to get insurance? Hospitals still take patients, doctors still see patients, and medicine is still sold at the pharmacies. If no one has insurance, costs will immediately be adjusted and negotiated at a lower cost. People will stop running to a doctor for every sniffle.","commenter_a":"amazed it lasted as long as it did, now the states are left holding the bag right along with those folks who tried to abide by that totally damaging obummercareless law.","post_message":"Oh Not Again! 400,000 Americans Enrolled In Obamacare Need To Find A New Plan"},{"comment_id":"629437257246853","commenter_b":"All I can say she is a stupid bossy bitch. Wtf they need to be kicked out of the whitehouse on their ass and put in prison all the laws they have broken. Don't know why they haven't impeached him yet. It's not racist.","commenter_a":"ugly worthless nigger","post_message":"You'll never guess which word Michelle is trying to ban.  This is ridiculous. Michelle needs to be booted OUT of the White House immediately.  Would you be happy if Michelle was kicked out?"}]
