[{"comment_id":"956349277815184","commenter_b":"To keep the bad guys out.....Tear down that wall and invite them in.","commenter_a":"This is why liberals suck, do as I say not as I do.","post_message":"ClashDaily.com"},{"comment_id":"1000268296676215","commenter_b":"Bitch she's a nothing","commenter_a":"Must you keep posting that mug? We are offended just looking at her and her husband ( POOR EXCUSE FOR A PRESIDENT! )","post_message":"Michelle Running Campaign To Ban ‘Offensive’ Word From English Language. She has completely lost it. Do you find Michelle Obama offensive?"},{"comment_id":"10154963089002619","commenter_b":"basically right","commenter_a":"Israel will have no true peace except for a short while when the Antichrist sets up his kingdom there during the tribulation period Israel will have a false peace for 3 1/2 years.Jerusalem will again be trampled down by the gentiles for a short spell and then Armageddon.and then Christs return to stop the madness.","post_message":"“The chain of attacks from Paris to San Bernardino, from Istanbul to the Ivory Coast and now to Brussels, and the daily attacks on Israel, this is one continuous assault on all of us.”"},{"comment_id":"10153255280801336","commenter_b":"You can't fix stupid. She was stupid before she went to college or she wouldn't have come out that way!","commenter_a":"Lol GW created ISIS... yeah, and Obama is the best President we've ever had. I think you should get a refund for your college tuition, because it's not working...","post_message":"College student to Jeb Bush: \"Your brother created ISIS.\""},{"comment_id":"1754494444782298","commenter_b":"If you have to ask what's wrong with him then you need to get a checkup from the neck up and have your ears cleaned out","commenter_a":"I sure hope he's getting 2 a.m. calls in the morning from people who hate his guts","post_message":"THEY DID IT: #Anonymous just released all of Donald J. Trump's personal information to the public..."},{"comment_id":"10153090141861680","commenter_b":"So what? Nothing should be said about mass shootings? Thugs and criminals are not mass shooters. There is crime everywhere. In every state and city. Our second amendment has been a shield for evil doers. Most criminals and thugs or gangs are trying to survive a life of under privilege and zero opportunities...jmo","commenter_a":"I live in the Atlanta area and every day, I say again, every day there are 3, 5 and some days more murders, carjackings, home invasions, bank robberies all committed by thugs, gangs and criminals. Yet, you don't hear one word, not one word of anger or control to get the guns out of the hands of these criminals. There are more murders in one week in the Atlanta area than the 10 souls that were lost in Oregon. If politicians really cared about every life, there would be more done to dismantle the gangs and thugs in our country. But instead all they care about is how they can take advantage and politicize a senseless crime to advance their agenda to take guns away from US citizens. They know that CRIMINALS DON\"T CARE ABOUT THEIR F'n LAWS!!!! So their true intentions must be to disarm the people.","post_message":"POLITICO takes a look back at some of his stronger words on the issue."},{"comment_id":"10153722269186680","commenter_b":"Helene....her supporters have jobs....what planet do you live on ???","commenter_a":"Trump draws crowds of 15k, while Hillary can't draw 100 people to come to her rallies, yet the polls say that Hillary is ahead....something smells foul.","post_message":"The independent says he'll continue to find ways to support Hillary Clinton and defeat Donald J. Trump."}]
