[{"comment_id":"1145710305499191","commenter_b":"Women are insane! All of them!","commenter_a":"Omg Daniel Melchior","post_message":"This woman has said her ex-fiance hit her, causing a black eye and other injuries. But now his attorney says this home surveillance video tells a different story.  STORY: fox32chicago.com/news/@username-story"},{"comment_id":"10152656496006680","commenter_b":"No Hillary, 'JUST YOU!'","commenter_a":"Loretta Lynch is another clueless, racist, who will follow Eric Holder with more bad decisions, race baiting, and support for illegal aliens, as indicated by her actions on the bench and answers to questions during confirmation proceedings. She should absolutely be voted down.","post_message":"Clinton’s social media outburst comes after Loretta Lynch has been waiting for Senate confirmation for 128 days."},{"comment_id":"10152658308576680","commenter_b":"I don't know why your playing around with her. You need a special prosecutor ,this way she needs to comply or go to jail.","commenter_a":"WHY!!!??? SO she can try to hide more stuff??","post_message":"The House Committee on Benghazi has given Hillary Clinton an additional two weeks to respond to a subpoena asking for her private emails on Libya and the 2012 terrorist attacks."},{"comment_id":"10154888478529714","commenter_b":"#FuckTrump #FuckPence #MelaniaFirstWhoreOfTheUnitedStates","commenter_a":"Boycott the show!! This is truly getting out of control. Did this occur when OBAMA became President? 'Of Course NOT'!! The left are outspoken to the point of embarrassing themselves on a platform of defeat. Protesting, Chanting, Revolting won't change anything!! The American people have made a choice, that choice is for change. 'Get over it, get with it' The Liberals power(s) were overturned, 'what a beautiful thing' & they don't know how to deal with it!!","post_message":"'Vice president-elect, I see you walking out but I hope you will hear us.'"},{"comment_id":"1303084943055048","commenter_b":"And I would make the vandal pay for it too!","commenter_a":"Looks better like this.","post_message":"Donald J. Trump just got hacked."},{"comment_id":"1412904655446554","commenter_b":"You know joy what goes around comes around.I think she is only on tv because she is so nasty","commenter_a":"Enough is enough! Grow up and accept your new president you whining bunch of children! It's time to take either the hosts or the hosts off the air because they are to infantile to face reality!","post_message":"The heck!"},{"comment_id":"10153322540253271","commenter_b":"It is probably easier to do that surgery when the 'boy is younger He looks better afterwards","commenter_a":"Stupid! I grew up being bullied and NO ONE did anything to protect me. There are better ways to help him with the problem","post_message":"PARENTS: How young is too young for plastic surgery? A 6-year-old boy got his ears pinned back to stop bullies from calling him 'elf ears.'  What do you think? Is this a good way to handle bullying? We're sharing your opinions on 7NEWS at 11:00. @webpagelink"}]
