[{"comment_id":"1610662465894059","commenter_b":"And she should be out of a job.","commenter_a":"Yes","post_message":"\"These hands clean the rooms every single day for Mr. Trump so he can be rich.\" Meet the Trump workers who are not voting for Donald J. Trump @webpagelink"},{"comment_id":"10150722411999999","commenter_b":"That trains never late Go home Carrie you're drunk! Take your pseudo intellectual rhetoric with you. Of course she'd be singing a different tune if she was raped by a refugee. You're a pig!","commenter_a":"And you don't think they'll do that here?! Able bodied men who cowardly seek refuge instead of fighting for their country tells me everything I need to know about those people. Muslims are known for treating their women as property. They have no rights other than being breed sows. But we should be tolerant of a race of people who worship a sexual deviant that doesn't tolerate any other religion. Where are all these \"peaceful\" Muslims fighting back at these radical Muslims? First person to call me a racist for calling it like it is can open their doors and put their family in danger.","post_message":"The mayor of Cologne suggested that women protect themselves from men by keeping more than an arm’s length away."},{"comment_id":"987580134720040","commenter_b":"Send illegals home","commenter_a":"Send the illegal scum back home.","post_message":"\"The massive influx of immigrants, both legal and illegal, has been demonstrably bad for the employment prospects of low-skilled Americans...\""},{"comment_id":"880649995314349","commenter_b":"What's the hold up? The President cannot be trusted to follow the law. President Obama has repeatedly shown that he will use \"prosecutorial discretion\" to simply refuse to enforce provisions of the existing deportation laws. Marco Rubio originally helped sponsor the Senate bill, but now says that he opposes any immigration reform until the border is secure FIRST. Any immigration reform should first start with verifiable border security -- not 100% since that's not realistic, but verification that almost all illegals are turned away at the border. At the same time, the Visa system needs to be reformed -- people from all over the world enter the U.S. with a tourist visa and then never leave -- the current system fails to track these people and force them to leave. This is not an issue of race; it is an issue of national sovereignty. Only after the Border is secure ...","commenter_a":"I am very impressed, Rep. @username, you nailed it. First, this is a vital issue under the Constitution -- the President cannot simply wish a new law into existence, especially one opposed by Congress, and the Congress MUST assert its Power of the Purse to preserve the balance of power. Otherwise, the Presidency becomes too powerful. Second, this Administration and the Democratic party have been able to accomplish much of their agenda by simply refusing to negotiate, forcing the Republicans to give in. However, the structure of the legislative branch in the Constitution was INTENDED to require compromise to get things done. It is obvious that the Democrats are more concerned with political victories than what is best for the country. This is one time when the Republicans should not, and CANNOT simply acquiesce to the other side who refuses to compromise. We all know that separating DHS funding bill ...","post_message":"I spoke on the House floor to discuss the Department of Homeland Security's funding and challenged our Congress to find solutions. You can watch my remarks here:"},{"comment_id":"10154343629676636","commenter_b":"Muslims treat you way better then any Jew would.","commenter_a":"Israelites are the best . shut up you muslim dicks","post_message":"BREAKING"},{"comment_id":"10156019875440354","commenter_b":"Then lets deport them when they cause trouble!","commenter_a":"Why not? So should Italian Americans.","post_message":"Say what?"},{"comment_id":"10154138321738837","commenter_b":"I read she was with the lady already in line she just had more items for her. She did'nt skip the line. That racist pos was out of line enough said! Pendeja!!!!!","commenter_a":"Realistically speaking if you're with someone and they're at the counter cashing out who's going to go to the back of the line if they were \"Together\" and you're only adding an item or two?? saying she should have went to the back of the line is both irrational and impractical... part of the problem is making excuses for the inexcusable...","post_message":"#RACIST RANT RECORDED: A woman's Tuesday night racist rant while Christmas shopping goes viral on social media."}]
