[{"comment_id":"848558051846284","commenter_b":"Ghetto booty......for ghetto trash!!!","commenter_a":"I think Michelle needs to follow her own advice on eating nutritious. She's a bit hefty from behind","post_message":"You won't believe how much you're paying for the #Obama family vacations.    This will leave you outraged!"},{"comment_id":"10153089034256051","commenter_b":"She should have either buckled herself then got sick or she could have knead down holding door and do it that way ( some vans have a handles)..or have a push window..or found something to vomit in","commenter_a":"There is a reason why yiu are suppose to wear a seat belt. Glad she is ok though.","post_message":"This woman began feeling sick while driving and ended up opening a car door to throw up. The problem is, the car was still moving at the time."},{"comment_id":"10152694335031094","commenter_b":"^Calls other women whores^","commenter_a":"Anti-science lunatics...UGH!!!!!!","post_message":"The federal government has confirmed more than 100 people across 14 states have now developed measles. Will state governments respond by rescinding personal belief exemptions for parents who choose not to vaccinate their children?"},{"comment_id":"10152774422166051","commenter_b":"Why are some people allowed to have kids??","commenter_a":"Please, can we eliminate these sh*tbags from the gene pool?","post_message":"Police found this 3-year-old boy sitting in the backseat of a car in freezing cold temperatures. His dad and babysitter had something more important to worry about."},{"comment_id":"10155314611590652","commenter_b":"hahaha! this is amazing","commenter_a":"'@username apparently the jar of mayonnaise episode anticipated this.","post_message":"'Life is best when it's a bit strange.'  This weird new reality show has millions of people pretty much watching paint dry:"},{"comment_id":"10154292047384877","commenter_b":"She out here looking like Nick now","commenter_a":"Wait so you can demand money for a breakup now?? I must have missed that memo, lol","post_message":"Mariah Carey also took to Instagram to confirm the split and her break-up hashtag game is brutal."},{"comment_id":"1137481012959422","commenter_b":"Get the hell out, asswipes!","commenter_a":"I wish Scottland would welcome me in. I've had it with the states.","post_message":"In case you missed it: Syrian refugees arrived in Scotland this week. This is how they were greeted."}]
