[{"comment_id":"10153667125634087","commenter_b":"@username its like talking to children that can't do math.","commenter_a":"Nate Silver has moved Sanders to winning this primary with a close to 60% chance . Mind you, just DAYS ago he had Hillary with an 80% chance of winning. The wider the margin the merrier. The small Wyoming caucus is next. And Hillary's lead in the April 19th NY primary is down from 30 to 40 point lead down to 12 in the latest poll","post_message":"#BREAKING: Another poll shows Bernie Sanders slightly ahead of Hillary Clinton in the all-important Wisconsin primary"},{"comment_id":"10153194187981600","commenter_b":"It;s not an assault rifle as assault rifles are illegal,","commenter_a":"So, not really sure why there is this distinction of it being an \"assault rifle\" and not...\"He pointed a gun at the officers\"???","post_message":"Officers heard the distinctive sound of a rifle being charged or a round being chambered, they reported."},{"comment_id":"1828017460760580","commenter_b":"Care less what Martha Stewart has to say period!","commenter_a":"I like Martha Stewart a lot.","post_message":"We're here live with Martha Stewart, who's ready to answer all your veggie-related questions! Ask away in the comments."},{"comment_id":"10156091000625354","commenter_b":"White Trash ...Bastard .... Hoe Bag.... She has Evil Eyes.....Ugly Bitch.....!!!!!!..","commenter_a":"That's this fat slobs 2 seconds of fame, congrats your grandkids will tell stories","post_message":"Here's what we're dealing with, folks…"},{"comment_id":"10153324267994411","commenter_b":"just for the record most women have long skirts in their wardrobes,","commenter_a":"Good decision, if she wants to live in France then she should follow French rules/laws etc and in this case the dress code, the \"its my culture\" card doesn't work in France. Which is a good thing","post_message":"A 15-year-old French Muslim girl was banned from her class for wearing a long skirt reflecting her religious affiliation."},{"comment_id":"10154779118243701","commenter_b":"Because she didn't want anyone to know she was pregnant in the first place","commenter_a":"Wait so if the baby is dead then you throw it out the window? That is just sick!!! You need help and definitely no more kids that baby dead or alive dose not deserve to be thrown out a window","post_message":"The Nebraska teen said she gave birth to an infant she thought was dead, panicked and threw the baby out the second-story window."},{"comment_id":"976609702473803","commenter_b":"Most black people i know WANT self segregation. They want a unified black country within the country and that is completely ok. White people make up 70 percent of this country so by proxy their is going to be areas without minorites. That's completely ok too. What we need to admit is that as a main rule forced integration doesn't work. In areas which are more racially undiverse there are fewer racially based crimes. It doesnt mean we all can't be friends it means we aren't all the same culture. And that is fine!","commenter_a":"what's the points of hate we all go to die one day, so enjoy the trip we call LIFE","post_message":"Top 10 Most Segregated Cities in the US"}]
