[{"comment_id":"1561884050498286","commenter_b":"Build the wall !","commenter_a":"Regardless who wins this election... I would NOT live anywhere else but the U.S.A. We may have our differences, but at the end we all work together. It what's makes this country powerful.","post_message":"BREAKING: Hillary Clinton casts her ballot on #ElectionDay in Chappaqua, New York. Full coverage: @webpagelink"},{"comment_id":"576110785930150","commenter_b":"@username did she grab them by the pussy?","commenter_a":"Read stories that when Slick Willie was president, the spent more of their time protecting him from Killary than anything or anyone else when she went on her ballistic tantrums.","post_message":"Not only is she corrupt, she's also beyond rude and disrespectful to those who protect her very life. So many who've worked for her attest to her nasty nature. natl.io/ghciVB"},{"comment_id":"688269957994142","commenter_b":"Honestly, what a creeper. Who thinks thats acceptable??","commenter_a":"@username what an idiot!","post_message":"This man WON'T stop preying on Kim Kardashian West and Gigi Hadid!"},{"comment_id":"10153206942041509","commenter_b":"F that Benghazi btch !","commenter_a":"Hillary Clinton 2016!..:)","post_message":"Will we see another President Bush? Jeb Bush's father and brother have both served as president. @webpagelink"},{"comment_id":"10152780954836094","commenter_b":"A whore doesn't care who pays them, but whomever pays them calls the shots of the services to be rendered.","commenter_a":"The \"corporate system whores\" can't make treaties with foriegn governments. Only political whores can do that.","post_message":"Within the economics discipline, Joseph Stiglitz has been one of the Trans-Pacific Partnership's most outspoken critics. The Nobel Prize winner in economics recently shared his concerns about the TPP at a community meeting in Queens, New York City."},{"comment_id":"396121180569763","commenter_b":"Yes she definitely deserves to lose her license bigoted bitch","commenter_a":"Not only doctor in the world......find a new one...wouldn't want that dr touching my kid.","post_message":"Does the Hippocratic Oath allow for doctors to make this kind of choice?"},{"comment_id":"10153620760216028","commenter_b":"From the Bible: (who cares about what verse, you know it's in there!) If your own full brother, or your son or daughter, or your beloved wife, or you intimate friend, entices you secretly to serve other gods, whom you and your fathers have not known, gods of any other nations, near at hand or far away, from one end of the earth to the other: do not yield to him or listen to him, nor look with pity upon him, to spare or shield him, but kill him. Your hand shall be the first raised to slay him; the rest of the people shall join in with you","commenter_a":"Quran (2:191-193) - \"And kill them wherever you find them, and turn them out from where they have turned you out. And Al-Fitnah [disbelief or unrest] is worse than killing... but if they desist, then lo! Allah is forgiving and merciful. And fight them until there is no more Fitnah [disbelief and worshipping of others along with Allah] and worship is for Allah alone. But if they cease, let there be no transgression except against Az-Zalimun(the polytheists, and wrong-doers, etc.)\"","post_message":"UPDATE: The death toll has risen to 63 people, with more than 300 others injured. The Pakistani Taliban has claimed responsibility for the suicide attack. BREAKING: At least 52, mostly women and children, were killed and around 150 others were injured when an explosion ripped through a crowded park in the Pakistani city Lahore, a few feet away from children's swings, officials said. @webpagelink"}]
