[{"comment_id":"10154469596571523","commenter_b":"How many illegal voters are on that too???!!!","commenter_a":"Who do they poll?? They never call me ever! I think they only poll those that are known demo's.....And personally he doesn't care what they think....he is just doing his job! GO TRUMP!!!","post_message":"President Donald J. Trump's approval rating reached a new low Saturday."},{"comment_id":"1145946565440763","commenter_b":"@username Maybe a visit to the Maury show???? That's where all whores go","commenter_a":"It looks like with eight children, some of the fathers should be paying child support, not the government!!","post_message":"GOOD!"},{"comment_id":"10153816646376336","commenter_b":"They think that are comedians!:) seriously??? They are not funny at all! These women on the view are ugly and boring! I am still at a loss who watches this show?","commenter_a":"Let's don't get started about people's looks .","post_message":"“If you meant [the] comment about my face being demented as a Halloween mask as humor, so be it… I have a real thick skin,\" Carly Fiorina fired back."},{"comment_id":"10153076452609705","commenter_b":"They look overfed. People need to cut back on the amount they feed manatees.","commenter_a":"This is only 40 miles north of my house. Heading up Saturday to see them","post_message":"A storm is coming. A storm of manatees. Prepare."},{"comment_id":"10155355195265354","commenter_b":"At least she kept it in country","commenter_a":"Hillary has went to panic mode dragging old hack Carville out, he's been out of it for a long time. Selling snakeskin boots an alligator hats now days. Back on Hillary payroll with a bunch of brand new excuses and lies.","post_message":"WATCH: James Carville Accidentally Admit Hillary Clinton Tried to Evade Congress With Secret Email #Oops!"},{"comment_id":"1982433335149738","commenter_b":"Beyonce is good in showing off her booty and that's about it .","commenter_a":"Agreed with Santana. Her performance was too visual artistic and address to a very narrow audience....it was not too much a vocal challenge or a singing performance in the true sense. This characterize her style over all.","post_message":"Carlos Santana: Beyoncé is not a singer, with all respect to her"},{"comment_id":"10156323559275294","commenter_b":"I will respond honestly. I am on the fence with medicinal use. Not sure it needs to be legalized for this purpose but not totally against it. I am totally against recreational usage because the bad outweighs any benefits in my opinion. I do not see it helping the economy or benefitting society at all. Plus the 10 only benefitted from the bill did not help and it should be a law only not a change to the constitution.","commenter_a":"To everyone that voted no I want a legit response on to what was so wrong with amendment???","post_message":"Issue 3, which would have legalized marijuana in Ohio, was voted down by a nearly two to one margin yesterday -- but officials with Responsible Ohio say the fight isn't over. Click below for more, including a complete list of election results:"}]
