[{"comment_id":"395107284010899","commenter_b":"asshole mother fuckers wow","commenter_a":"Democrats are acting like children.","post_message":"Democrats LASH OUT at Netanyahu, Tell Him to Go Home, Call Him “a Child”"},{"comment_id":"10153542396586336","commenter_b":"A third term would be so awesome. Obama could really clean everything up. Do away with guns and churches- and make EVERYBODY git GAY MARRIED! yupyupyup....","commenter_a":"I don't even listen to the guy bc all he does is lie and spew gutter trash. He's an embarrassment. I'm waiting for that executive order where he can \"order\" himself to have a 3rd term! Wonder if those neutered GOP \"leaders\" will actually do anything then or just \"say\" they will! They are all sickening!","post_message":"Do you agree with Charles Krauthammer?"},{"comment_id":"1267539270005791","commenter_b":"@username , is it all intelligent, competent and strong women that intimidate you, or just Hillary? Hillary 2016","commenter_a":"He can only intimidate weak people... She's the exact opposite of that! #VoteBlue","post_message":"BOOM."},{"comment_id":"1118006468215013","commenter_b":"and illegals.","commenter_a":"Lol same old democrap bs. Yes the GOP is trying to keep Millon's from voting. Millions of dead people.","post_message":"Mrs. Clinton is out accusing the Republicans once again of plotting voter fraud, and she is making this allegation in front of African-American audiences."},{"comment_id":"1832531477017547","commenter_b":"Calm down, people didn't realise the date wasn't in American standard form. And we didn't feel it, or at least no one I know felt it. Innocent enough mistake, I don't think anyone deserves to be called an idiot for it","commenter_a":"For all of you idiots saying nothing happened today.","post_message":""},{"comment_id":"10153571319289342","commenter_b":"¡¡¡¡Omg esta cara voy a poner si ganó !!!!","commenter_a":"Will Htx Larisa Valcy Brian Valcy Jovannii N Juliet Mendoza Luisao Roberto Galvez @username Beldy Salvador","post_message":"$400 MILLION POWERBALL JACKPOT: Are you planning on buying a Powerball ticket this week? With the potential jackpot now standing at $400 million, this Wednesday drawing could be one of the largest in U.S. history. While you're dreaming of how you'll spend your winnings, here's a look at the 10 largest U.S. lottery jackpots: #abc13"},{"comment_id":"1094565510598452","commenter_b":"This is what should happen to Debbie Wasserman Schultz - #PutThatWassholeInPrison","commenter_a":"More like its time for you to take what's yours. Go out on stage and be prepared to accept the nomination please. I hope you pull an FDR. I can't bear to see Clinton win after what wikileaks showed.","post_message":"In the State of New York 3 million Independent voters could not participate in the Democratic nominee. It's time for open primaries."}]
