[{"comment_id":"1076328745721469","commenter_b":"I got bafar as well","commenter_a":"Woooow @username","post_message":"This is really, really weird. Check out the explanation here: bit.ly/1bRZ7nn Via by AsapSCIENCE."},{"comment_id":"1142990589094021","commenter_b":"ugly women","commenter_a":"what are you animals?.....in britian?......wth!","post_message":"'Still not asking for it'"},{"comment_id":"491024294436506","commenter_b":"@username you are a horrible racist pile of feces. You're worthless.","commenter_a":"I take offense at The Great White Trash's reference to any member of Native America. He should keep his trash talking to himself. Pocahontas' only crime was a lapse in judgment by saving the life of some white guy.","post_message":"When Donald Trump was asked if “he had been chided by any Republicans” for his Twitter war with Elizabeth Warren, the presumptive nominee said, “You mean Pocahontas?”"},{"comment_id":"999021020109368","commenter_b":"This is legislature that should ONLY be debated and decided BY WOMEN!!","commenter_a":"mayam merouane ok @username","post_message":"What a brave woman"},{"comment_id":"10153457449933128","commenter_b":"All is Nestle fault. They should be ban from around the world.","commenter_a":"India is member of BRICS (Brazil, Russia, India, China, South africa) and pro RUSSIA. does it make sense?","post_message":"The FDA issued more warnings about snacks imported from India than any other country this year. One import was blocked because it “appears to consist in whole or in part of a filthy, putrid, or decomposed substance or be otherwise unfit for food.”"},{"comment_id":"441930219322192","commenter_b":"Jail this pervert!","commenter_a":"Creep","post_message":"Conservatives are bending over backwards trying to defend the Duggars. Gross!"},{"comment_id":"10154482749054423","commenter_b":"@username doesn't watch this!!!! LEAVE HER OUT OF IT!","commenter_a":"Caitlin Leonard @username","post_message":"PSA: The cast of This Is Us is very sorry for making you cry every episode."}]
