[{"comment_id":"918479428207062","commenter_b":"\"If you don't have the guts to run for office on your ideas, then you shouldn't run for office at all.\" Thank you, @username. #realtalk","commenter_a":"The last two elections I couldn't get to the polls because of 14 hour workdays","post_message":"If you don't have the guts to run for office on your ideas, then you shouldn't run for office at all."},{"comment_id":"10154979630864218","commenter_b":"@username That damn Clinton how dare she think she is above the same laws we have to abide by....","commenter_a":"Face it the Democrats failed policies and over regulation aka job killers have finally awoken the American Voters in rural America their the ones truly hurting","post_message":"Maryland remains a deep blue state politically, but President-elect Donald Trump was able to flip white working-class votes in parts of Maryland, including eastern Baltimore County."},{"comment_id":"10153589793400329","commenter_b":"10154197025200954Mary Lu10154879708717248","commenter_a":"Ryan Bere still wanna do this?","post_message":"Jaws IRL."},{"comment_id":"1005026196219449","commenter_b":"Demon dog born of a jackle, shut your butt hole","commenter_a":"He didnt do nuffin...he was just minded his own biz..like they all do..blame the whites in America. .tell me one state thats mostly black..that dont have a high crime rate?..then tell me how its whites fault...anddd go!","post_message":"Authorities in Austin, Texas have identified the Black, unarmed teenager who was fatally shot by police Monday morning. Initial reports didn’t name 17-year-old David Joseph or his age, but what has been revealed is that he was naked at the time of the shooting. Geoffrey Freeman, a sergeant with Austin police, and other officers were responding to a call at an apartment complex. Although details are scant, Freeman arrived on the scene and apparently opened fire. MORE ---> @webpagelink"},{"comment_id":"1144808412242519","commenter_b":"Keep them from working, take away their freebies and they will go back home on their own. Arrest the Gangster Types and deport them, then Build That Wall.","commenter_a":"He should be in jail with killary!","post_message":"A 4-4 tie decision by the Supreme Court upholds the lower courts decision and blocks President Obama's executive action on immigration (#DAPA). This means NO WORK PERMITS for the 4-5 million illegal aliens affected."},{"comment_id":"1670051896580847","commenter_b":"Hell yes","commenter_a":"Definitly YES !","post_message":"OMG! Obama shortchanged the VA by 2 billion and gave away 4 billion to Muslim migrants! He hates our vets! FOLLOW US----> Freedom Daily"},{"comment_id":"10153928566951943","commenter_b":"she's a LYING PIG!!!!","commenter_a":"Bull!!!! They should all have to answer all questions. STOP the cover-up's, the crap, just get the truth out. Put this Liar, Thief, Murderer, traitor in prison where she belongs, and ALL that knew about her doings and didn't do anything to prevent it, or knew of it afterwards, and buried their heads in the sand. ENOUGH IS ENOUGH !!!","post_message":"Senior Hillary Clinton aide Cheryl Mills and her lawyer walked out of a recent interview with the FBI about Clinton's private email system after an investigator asked a question Mills believed to be off limits, according to a published report. - via Fox News"}]
