[{"comment_id":"10153029788371545","commenter_b":"Calm down, crazy.","commenter_a":"This country IS BASED ON THE BIBLE. I have no problem with them marrying, but by a court or Justice of the Peace. NOT THE CHURCH. THAT IS SACRED, which tells me one thing about these evil people: THEY WANT TO DESTROY RIGHTEOUSNESS and anyone who stands for it. 36 states have already told them they could marry, but NO, now they will force righteous Pastors, Priests, etc. to marry them and there will be conscientious objectors standing up against it. Then, this country will be divided worst than it is. YOU ARE A FOOL FOR SATAN. YOU CANNOT LEGISLATE MORALITY FROM THE BENCH. It just doesn work because MARRIAGE IS A HOLY MORAL ISSUE, not a carnal issue. You watch. These homosexuals will go after the churches who refuse to marry them, OUT OF SPITE AND EVIL. And, this is the beginning of the end for America. SHE WILL ...","post_message":"For three years, Dallas County Judge Tonya Parker has quietly declined to perform wedding ceremonies. It didn't feel right to exclude some couples from the institution of marriage, she said. Today, all 12 of her fellow district court judges sat inside Parker's courtroom for her first marriage ceremony in years."},{"comment_id":"1328638283841395","commenter_b":"Generational behavior.","commenter_a":"I've been saying that for over 20 years and people look at me like I've got two heads. Everyone feels entitled including the adults and they pass it on to their children and the problem get exponentially worse. Where and how does one put an end to this......","post_message":""},{"comment_id":"10154712376336756","commenter_b":"He was a pastor in the Southern Baptist Conference whose strict, written doctrine is anti-LGBT. Whether rabidly or tacitly he was promoting anti-LGBT beliefs by choosing to hold that job.","commenter_a":"The story doesn't address how the pastor felt about gays before his son 'came out' ? Did he always think that gays should be loved, treated fairly, equally like every one else, or is he just coming to that realization because of his son.","post_message":"After the pastor told his congregation about his son's coming out, \"I felt like this weight had just been lifted out of me, and people knew where we stood.\""},{"comment_id":"1419494658112647","commenter_b":"Show your junk to one of my babies and I promise you will sit to pee the rest of your sick life touch one and you will meet your maker and it won't be GOD","commenter_a":"You're one sick son of a b****","post_message":"CNN Believes That Little Girls Should Be Exposed To Male Genitals, Here The DISGUSTING Reason They Are Pushing This!"},{"comment_id":"10153253849621955","commenter_b":"Poor rich spoiled brat she thinks she's and her stupid husband ruthless she no First Lady you wouldn't see Jackie Kennedy acting like her.","commenter_a":"WTF.","post_message":"MICHELLE OBAMA: Emotional toll of being a black first lady..."},{"comment_id":"10153376789317550","commenter_b":"They are corrupt!!","commenter_a":"The judge also needs to be dismissed. Mosby is clearly biased and has acted with contempt throughout the whole process.","post_message":"The charges against the six police officers linked to Freddie Gray's death will not be dismissed and State's Attorney Marilyn Mosby will not be recused from the case, a judge ruled today.  Details here ---> @webpagelink"},{"comment_id":"10154327870086509","commenter_b":"If they did who cares cnn enjoy the holidays merry Christmas to the Muslim world . Leave cnn racism behind .","commenter_a":"and lovebirds don't own February. So wtf is your point?","post_message":"\"Christians don't own December,\" one atheist writer says."}]
