[{"comment_id":"437802309734983","commenter_b":"Wes spoken like a true submissive little bitch. Now go stand in the corner like a good little boy","commenter_a":"Hooray! Now, remove them immediately starting with Ferguson.","post_message":"President Obama is taking a necessary, bold step."},{"comment_id":"922274701162393","commenter_b":"Wait, she is the old hag looting America, and the rest of the world.","commenter_a":"@username - Such an inspiring woman. You are okay with a old hag looting America but not a woman with great accomplishment trying to occupy White Office. #Hillary4WH #MadamPresident","post_message":"Hillary's new favorite singer."},{"comment_id":"10155873946605354","commenter_b":"Ass wipe.","commenter_a":"Because he's a Libtard","post_message":"Why would a Cuban rapper take offense at remarks against crime by Mexican illegal immigrants?"},{"comment_id":"1240263705993657","commenter_b":"@username Oh Dave, ad hominem?","commenter_a":"NBC's biased information. All gun injuries are required by law to be reported by Dr's and Hospitals. What is under reported is the number of fools believing NBC","post_message":"A researcher believes the number of unintentional deaths of children involving firearms may be under-reported. \"We make make it incredibly easy for anybody who wants a gun to get a gun. And, we don't store them safely,\" he said."},{"comment_id":"10153519151958984","commenter_b":"Leave the park alone, it should be a safe haven for enjoyment; TAKE THE BLACK BITCH DOWN, she has no business being there with that attitude.","commenter_a":"There is so much STUPIDITY in the world anymore. I don't think we should discriminate by race or religion but could we just get rid of the stupid people!","post_message":"A white woman was holding her toddler and minding her own business... but then this black teenager saw her and did something awful.  The entire scene was caught on video... can you guess why Al Sharpton isn't saying anything about this?"},{"comment_id":"10153110515583984","commenter_b":"I've seen out of work lesbian truck drivers. Moore looks MUCH worse.","commenter_a":"Is that Michael Moore in a Debbie Wasserman Schultz wig???","post_message":"I can't believe this radical feminist liberal would so gleefully mock and lie about a distinguished female veteran like this.  Do you support the Republican senator this woman belittled?"},{"comment_id":"10153058052287452","commenter_b":"Scum bags","commenter_a":"Trump be like \" bet they were Mexicans \"","post_message":"Gone in 90 seconds!   A burglary crew crashes an SUV right into a clothing store and dashes off with thousands of dollars in merchandise.  Not even steel security gates could stop this crew. Tonight, the hunt to catch the cunning crooks who knew exactly which designer threads to grab. Tonight at 11 from ABC7 Eyewitness News. abc7.la/1FenO5y"}]
