[{"comment_id":"10154403521603132","commenter_b":"I haven't read the article but I believe he is saying that he feels the death of Prince is a tragic loss as was 9/11. I know I haven't stopped crying since Thursday and I never met the man or knew him other than his movies and music. He was a beautiful soul and will be truly missed. @username take things so out of context it's unreal and always have to make things a issue where they should be no issue. Prince was a sexy, talented, giving man and I know I am devistated and I am a fan that will truly miss him.","commenter_a":"Prince was an amazing human being for so many reasons, but really??? 1) Comparing his, or any singular death, to 9/11 is crazy! 2) Why is this a race issue? It's like saying that only us Minnesotans are truly grieving.","post_message":"Dave Chappelle once impersonated Prince for a now-infamous Chappelle's Show skit."},{"comment_id":"602931503228475","commenter_b":"I have never heard of or seen a cow attack a person!!! No Good Worthless Muslims!!!","commenter_a":"Those men will burn in hell one day","post_message":"Two Men Were Stabbing a Girl in “Honor Killing” When This Cow DID THIS to Stop Them…"},{"comment_id":"534617120056639","commenter_b":"Mike Bassenti This is what they get for coming here !! We have to pay for this ! @webpagelink","commenter_a":"Big news is Trump is earning MAJOR support from segments of the population which almost exclusively vote for Democrats. SurveyUSA announced that Donald Trump would receive 25% among black registered voters. That is news that has Hillary Clinton terrified, and is shaking the political establishment to the core!","post_message":"I had an incredible time in Detroit yesterday. A great experience - learned a lot by listening to everyone. I am grateful for their support - and time. You can catch what I had to say to everyone, right here. Thank you! -DJT"},{"comment_id":"10153889238948984","commenter_b":"Send them BACK to Syria!","commenter_a":"Go back....","post_message":"You would think that Syrian \"refugees\" wouldn't be able to make many demands of their host nations. However, they have -- and some of them are completely RIDICULOUS. This should put the lie to the myth that these migrants are only coming to the West to escape persecution... and this is what Obama wants to import HERE?"},{"comment_id":"10154549448869342","commenter_b":"That's not her!","commenter_a":"She ain't gangster now lmao","post_message":"Police became aware of a \"disturbing video\" on Facebook Live showing an adult man being bound and beaten."},{"comment_id":"1736088283296773","commenter_b":"And women!","commenter_a":"Shout out to CFD and their brave men and women that r serving","post_message":"BREAKING: A massive fire is burning in Chicago's Lake View Neighborhood. At least 3 buildings are engulfed in flames. A BIG shout out to the CFD for their incredible work."},{"comment_id":"10153555593349087","commenter_b":"Please seek professional help. Oh, and by the way...no man knoweth the hour. (Remember that part?)","commenter_a":"America is speaking loud and clear...CAN YOU HEAR US NOW??? As a Christian woman, I believe Donald J. Trump is an answer to prayer for this once great nation and he just might be a temporary reprieve from the judgment that we so rightly deserve and which looms so ominously on the horizon. He is clearly fighting back against the forces that be that are doing everything in their power to bring about global governance, he will fight for us, I believe that...he knows most of these devils personally and knows more than we do about them, I am sure, and he wants a great nation to leave to his own grandchildren...and he is bold and determined enough to want a great legacy to leave to them as well...what better legacy than saving a nation from itself...I have had many people ask me how I, as a Christian woman, could ...","post_message":"“Our borders are like Swiss cheese,” Donald Trump said at tonight's #GOPdebate. \"This is wall that’s going to work. The wall is $10-12 billion if I do it. Mexico will pay for it because they’re not doing us any favors.\""}]
