[{"comment_id":"1230028840342704","commenter_b":"Not fit to be president. A witch","commenter_a":"From all accounts....Killary Rotten has one of the filthiest mouths in DC. She calls people nasty names and acts like she is insane...which she is. This is what she thinks of everyone in America....she is trying her best to fool as many as she can though.","post_message":"Is Hillary Clinton really a cold-hearted [expletive]? You won't believe her explosive fits of rage, even making her husband Bill bleed, as her astonishing vitriol has just gone public"},{"comment_id":"950439771634160","commenter_b":"Yeah you are a coward you b*tch","commenter_a":"Didn't any of you read this Bill or just the miss leading article Think Progress put up. Probably not the Bill will make it a CRIMINAL offence to conceal you're Identity by using a hoodie. Read the Bill you look Stupid making comments you know nothing about","post_message":"Ugly stereotypes shouldn't be enshrined into law"},{"comment_id":"10153308445179342","commenter_b":"You right, had he been a negro, that M.F would be pushing up daisy right about now.","commenter_a":"If he was black I doubt he'd be alive to take pics","post_message":"SUSPECT PHOTO RELEASED: Kevin Daigle, 54, of Lake Charles was arrested for allegedly shooting a trooper in the head during a traffic stop. Charges against Daigle will include attempted murder of a police officer. DETAILS --> @webpagelink"},{"comment_id":"859144567515130","commenter_b":"I did walk in the shoes of a LEGAL immigrant. We get that money gets you here either way legal or illegal. But when you lack respect for laws you come here illegally when you respect them you come here legally. Trust me I get the escaping from violence and your family is in danger side of it. There are avenues if that is the case in these days for emergency immigration if you fit the criteria.","commenter_a":"Si se puede! We are all immigrants and thats what makes up the USA !","post_message":"\"We love this country. We want to belong. We want to come right with the law...we don't like living in fear. We want to be out of the shadows.\" -Gaby Pacheco, DREAMer"},{"comment_id":"1570131419945845","commenter_b":"How does someone like this get elected in this day and age? Shame on those that vote for such a disgusting human being. I hope Texas sees the day when most of their women have left the state. This is the opinion of a multiple degreed female with a B.A in Mathematics and a Juris Doctorate","commenter_a":"He's an embarrassment to men as well as women. How in this day and age does someone like this still exist?","post_message":"\"It is the job of a woman to stay at home\" - A real Republican in 2016."},{"comment_id":"10153040559681130","commenter_b":"Religion, Kartrashians, J.Lopez, M.Cyrus, and their ilk. Male dicktators ruling./ruining countries...","commenter_a":"I want to see a world without religion or Kardashians.","post_message":"Do you want to see a world without elephants, rhinos or gorillas?"},{"comment_id":"992434430797029","commenter_b":"That woman needs to be locked up in the nearest lunatic asylum.","commenter_a":"Pathetic & scary scenario is these lunatics own guns! She probably packs a gun in her Walmart plastic purse! When these nut jobs escalate as she did, back up & run!","post_message":"Something tells me this nut is a Tea Partier."}]
