[{"comment_id":"10153667597986770","commenter_b":"She belongs in prison!","commenter_a":"Prison","post_message":"Hillary Clinton thinks she should be president. But does she really belong in prison? @webpagelink"},{"comment_id":"10154117149131491","commenter_b":"'@username let me see your nudes.","commenter_a":"18 months is not enough, in my eyes what he did was a form of sexual assault","post_message":"It all comes after private photographs from celebrities like Jennifer Lawrence and Kate Upton were leaked online."},{"comment_id":"10154592640014411","commenter_b":"actually, feminists hate people forcing women to wear/do anything, which is kinda what a ban amounts to.","commenter_a":"Burkini is everyrhing that a feminist hates,so how can feminists agree for that?","post_message":"'...attempt to raise profits and exploit a gap in the over-saturated clothing market is selling and promoting allegiance to ISIS?'"},{"comment_id":"10154100383542452","commenter_b":"Possibly the saddest thing I've ever heard... so sorry for your loss","commenter_a":"That is so heartbreaking @username","post_message":"BREAKING NEWS: A woman who was killed when a tree fell on a wedding party at a Whittier park has been identified as the mother of the bride."},{"comment_id":"1073790629380657","commenter_b":"'@username. Just fn Stop it with the Fox 'news' total BS talking points. Insurance is about LIABILITY, not necessarily self protection..and it's Democratic Socialism at it's core such as our tax code: Put $$$ into the pot to benefit/secure your society's quality of living. The phrase 'free market capitalism' is nothing but corporate fascist propaganda for dumb asses.","commenter_a":"I like to ask people that hate socialism why they buy insurance? You can almost see them stroke out as they start to think really hard about the question.","post_message":"Brilliantly done."},{"comment_id":"1109196055770108","commenter_b":"'@username You have no morality. Also gays shouldnt be allowed anywhere near kids.. its pure child abuse. If they were meant to be parents, then gays would be able to reproduce.","commenter_a":"I thought MLB was about playing baseball, not trying to promote an immoral, sacrilegious way of life!","post_message":"MLB is DYING to get a gay baseball player."},{"comment_id":"10155459480226729","commenter_b":"Illegal peoples was unexpected to immigration live our homeland your said them all to their ear daft.","commenter_a":"Mexico’s Enduring Legacy of Failure If Mexican President Enrique Nieto truly believes Donald Trump is a bigot for not welcoming millions of medically and criminally unvetted illegal aliens with open arms and a check made out to 'cash', then why does Mexico have stricter immigration and foreign work laws than 'racist' America? Every civilized nation recognizes the absolute necessity of securing their borders and maintaining the integrity of their immigration programs. It's the type of common sense that requires no apology or gratuitous reminders. Perhaps if the Mexican government wasn't so adept at destroying its own country with an endless cycle of incompetence and corruption, their own flesh and blood would not be fleeing their native homeland with nothing but the clothes on their back. And yet these are the same hypocrites who have the nerve to denounce America as greedy capitalists; that transcendent beacon of liberty, opportunity and prosperity ...","post_message":"If there's one thing I truly despise about the progressive socialist left it is their blatant hypocrisy.   One of the fall back positions for the left is always the 14th Amendment's 'equal protection' clause. In the case of Obergfell vs Hodges (same-sex marriage) the SCOTUS ruled that marriage was an individual right and States must conduct same-sex marriages, making it the 'law of the land' as many say.   Now, with the executive orders of President Donald Trump on illegal immigration, the liberal progressive left is again decrying the 14th Amendment's equal protection applies to anyone within the borders of the United States.   Well, based upon this, I will henceforth be carrying my concealed weapon anywhere within the borders of the United States.   Look, if all of a sudden, two men and two women have the right to be married anywhere in America, and if folks here illegally have constitutional protections, then my constitutional second amendment right to keep and bear arms shall not be infringed. You know...equal protection.   So, there it is, I just saved Congress a lot of work. Law abiding legal American gun owners can travel anywhere they want with their concealed carry permit. If we can't, then no same-sex marriage -- and no rights and protections for illegal aliens.   End of class."}]
