[{"comment_id":"1769645119990268","commenter_b":"@username Says a blind woman","commenter_a":"Trump supporters say Trump should not be judged on his past actions, yet when it comes to Hillary Clinton, all they can talk about is the past. Hypocrisy? Also FYI, Hillary Clinton is running for Oval Office not Bill Clinton looks like that needs to be clarified for some people * You want to talk about Bill Clinton, why don't we talk about Melania Trump","post_message":"Donald J. Trump got a heck of an October Surprise."},{"comment_id":"10154608447428690","commenter_b":"@username - Did I hurt your feelings? While you're defending her she's planning on how she'll enjoy all her wealth somewhere in the world while you'll be paying taxes up the wonker. It's called Sod's law.","commenter_a":"She is every color on the a--hole rainbow.","post_message":"\"I am innocent, I am an honest person and I have never committed a crime.\" @webpagelink"},{"comment_id":"10153700162853010","commenter_b":"By bring them here ,you are taking food out of the mouth of those poor people.","commenter_a":"Don't we have enough ,dogs here..","post_message":"The Humane Society International has apparently taken possession of more than 100 dogs from a South Korean farmer in recent months, paying the farmer to transition to other crops."},{"comment_id":"1096402407066897","commenter_b":"Girl, bye. If you indeed weren't trying to get over on our great state, you have nothing to worry about, right?? Hey, you may very well be a crook...","commenter_a":"He said.....she said. Truth is most likely somewhere in the middle. Pffffffft...","post_message":"It does kind of smell like revenge. What do you think?"},{"comment_id":"10153773404108984","commenter_b":"You Gotta Love America !!! :) I Do !!!","commenter_a":"Go Obama.","post_message":"The head of the National Sheriff's Association just threw down and issued a blunt threat to Barack Obama. This cop isn't going to take Obama's anti-cop attitude any longer, and now he's going to do something about it. This is awesome."},{"comment_id":"1456373527716006","commenter_b":"secede already and take your cousin wife with you and all the other uneducated ignorant trash with you. Republican policies fail every time and only uneducated idiots do not see the truth that is why your state doesn't believe in education","commenter_a":"Once again......Trump was right!!! And that kills the over sensitive lefties.....","post_message":"Trump once remarked to a \"Celebrity Apprentice\" contestant that it \"must be a pretty picture, you dropping to your knees.\""},{"comment_id":"10154342764073701","commenter_b":"Listen to yourselves! Stop just stop! Do you realize that YOU are part of the problem?","commenter_a":"People, they are donating money to people in need. That's it! Why is everyone in such a hurry to provoke anger. Myself I feel all that needs to be said is, Thank you Disney!","post_message":"Disney announced it's donating $1 million to a fund set up to help those affected by the attack at Pulse nightclub in #Orlando."}]
