[{"comment_id":"10153934719761813","commenter_b":"@username Go run to your safe space. The ACLU would rather cast legal immigrants in with the illegal Alien filth than make a distinction between legal immigrants and these animals. It's not \"harsh\", it's calling this scum exactly what they are.","commenter_a":"Hey ACLU, these animals aren't \"undocumented immigrants\", don't lump this filth in with those that have legally immigrated here. They are Illegal Aliens, not legal permanent residences, naturalized citizens or here on visas. They broke the law and should be treated like the criminals they are; detained, processed and then deported back to their home countries along with their families. This garbage SHOULD live in fear, be harassed and made to feel uncomfortable. They should be detained, when local LEO interact with them, and then turned over to ICE/CBP for deportation.","post_message":"Since Election Day, the ACLU has seen a renewed sense of urgency from hundreds of thousands of Americans to protect civil liberties. One of our top priorities is ensuring that our communities don’t fall under siege in service of Trump’s quest to deport undocumented immigrants. To carry out his mass deportation scheme, Trump would have to cast his dragnet far deeper into American communities. Even if massive taxpayer dollars could be diverted to do so as a practical matter, the effort will erode the civil liberties of all. Millions of people who live and work along our nation's borders—from New York to Arizona, Washington State to Texas—are already living in increasingly militarized areas where they are stopped, harassed and treated in ways the U.S. Constitution does not permit. Read more about the work already in progress to ensure people’s rights are protected in border communities @webpagelink"},{"comment_id":"1048024048598660","commenter_b":"Disgusting.","commenter_a":"The blessings of new life. I think it's wonderful","post_message":"\"It looks like an alien\""},{"comment_id":"10153659512120667","commenter_b":"add plz","commenter_a":"Put one of these posers up against a Gracie see what happens...dumbed down fighting","post_message":"He did it again."},{"comment_id":"10153148221999087","commenter_b":"Close the Border why are they allowed to get all this free stuff, when we have people in this country who need help??","commenter_a":"get it back TRUMP!!","post_message":"\"People are walking across the border right now, right in front of these great people we have,” Donald J. Trump said. “We have wonderful Border Patrol people. They can do their job, but they’re not allowed to do the job.”"},{"comment_id":"10153862948491523","commenter_b":"You think women put these objects in themselves? This was a product recommended and approved by from their doctors. STFU","commenter_a":"Stop putting foreign objects in your body!","post_message":"Some of the women experiencing adverse affects from Essure are relieved to get hysterectomies to get the coils out."},{"comment_id":"10153552343052452","commenter_b":"What a shitbag","commenter_a":"These people have no shame... very sad..","post_message":"An Alhambra homeowner caught a package thief in the act and recorded the woman as she tried to swipe two boxes from his porch. Police are now searching for the culprit. abc7.la/1Wt5Auf"},{"comment_id":"1033502426742811","commenter_b":"True!","commenter_a":"That cop had been dismissed from another police dept for being 'too immature to handle a gun' and lack of ability to follow orders. Fact.","post_message":"BREAKING: a grand jury has chosen not to indict the cop who murdered Tamir Rice in cold blood. Something is seriously wrong with our criminal justice system when a cop can kill a fully innocent kid with impunity. Read more here: @webpagelink Image by Occupy Democrats, like our page or more."}]
