[{"comment_id":"980597458645157","commenter_b":"Let's start following it, shall we?","commenter_a":"God bless the Constitution of the USA","post_message":"Happy Constitution Day!"},{"comment_id":"778104105644597","commenter_b":"CNN reported on this at its finest. Condemned those who stand as patriots while providing excuses for those who slaughter innocent people . Nothing but hypocrisy!","commenter_a":"Love this lady!","post_message":"Report: Man slain by police in Boston sought to behead Pamela Geller"},{"comment_id":"10153609535136680","commenter_b":"Rick seems to forget about that \"Well-regulated Militia\" clause that are the first words of the 2A. It doesn't mean a armed rabble.","commenter_a":"Evil and assault weapons which need to be only in the hands of trained military, not sold to any Tom, Dick or Harry.","post_message":"Rick Scott: \"Let’s remember, the Second Amendment has been around for over 200 years. It didn’t, you know, that’s not what killed innocent people. Evil killed innocent people.\""},{"comment_id":"635245713332674","commenter_b":"Jail her!","commenter_a":"She is corrupt about time she need to come clean.","post_message":"The evidence in the Benghazi controversy just blew up in Hillary's face, it's over.  It's about time. Send her to jail already.  Do you agree Hillary should be arrested?"},{"comment_id":"1374717489237646","commenter_b":"Deport all Mexicans","commenter_a":"Alot of snowflakes on here. Trump!!!!!","post_message":"LIVE NOW: Donald Trump speaks at a \"Thank You Tour\" rally in Mobile, Alabama."},{"comment_id":"10153590364786409","commenter_b":"What a bunch of caddie women","commenter_a":"Oh I could never stand her....once Regis was gone,so was the show.....","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."},{"comment_id":"10153484924965861","commenter_b":"Impeach her","commenter_a":"Mary Failin was trumped","post_message":"BREAKING: The Oklahoma Court of Criminal Appeals has granted a two-week stay in the execution of Richard Glossip."}]
