[{"comment_id":"10153018811005927","commenter_b":"@webpagelink #dontbesilent this woman can NOT be the President of our country","commenter_a":"Wrong wrong wrong, what has happened to the USA and right and wrong?","post_message":"How did the media miss this?"},{"comment_id":"10155111807156162","commenter_b":"It's her white male privilege.","commenter_a":"Wtf probation !","post_message":"The 46-year-old mother avoided jail after pleading guilty to raping her daughter's 13-year-old boyfriend."},{"comment_id":"10153938458440695","commenter_b":"Go home Barbara. You're drunk.","commenter_a":"We're checking on the condition of the other child injured in the crash for the Channel 2 Action News Nightbeat at 11.","post_message":"HEARTBREAKING: Police say a 12-year-old critically injured in a crash on I-285 today has died. Please keep her family in your thoughts and hug your loved ones tight tonight. @webpagelink"},{"comment_id":"10153357415706782","commenter_b":"They should all be illegal They cause cancer.","commenter_a":"Waste of time and money","post_message":"Lawmakers passed a tanning bed bill through a committee Monday. The bill would make it against the law for anyone under 18 to use a tanning bed.  What do you think of the bill?"},{"comment_id":"10155309638386509","commenter_b":"Stay home old hag","commenter_a":"There was nothing ,\" near\" about it . The Clinton News Network rolls on. In the bag for the Hag.","post_message":"Four days after her near fainting spell, Hillary Clinton is returning to the campaign trail"},{"comment_id":"1178158985635102","commenter_b":"OH PLEAZZZZZZZZZZZZ.....LMFAO..THIS IS BECOMING COMICAL...IDIOTS EVERYWHERE!","commenter_a":"It's not an anti trump its a protest against the president from mexico","post_message":"LIVE NOW: An anti-Trump protest in Mexico City."},{"comment_id":"10154014383211636","commenter_b":"hmmmmmmmmmmmmmmmmmmm, she needs to be hanged.","commenter_a":"good! even the uk police can be corrupted.","post_message":"She was shot in the stomach, but not by the man she claimed"}]
