[{"comment_id":"10153009704367690","commenter_b":"Attention, single ladies. Line starts to the left - lol","commenter_a":"And where did they pick up the Black man? #1 2nd row!","post_message":"JUST IN: Mugshots of some of those arrested in connection with the deadly biker brawl in Waco. Open link to see information on each mugshot. @webpagelink"},{"comment_id":"10153505584229705","commenter_b":"Martin Besson","commenter_a":"Fatima Tanner Daniel Robson these hotels!!","post_message":"So bizarre!"},{"comment_id":"739879102780921","commenter_b":"She's biding her time!!!","commenter_a":"Let me offer you, @username, some unsolicited and unqualified advice since I'm not a politician. There is no way you should be neck and neck with Bernie Sanders. But you're playing weak. Go on the attack. Use your willingness to stay in a marriage regardless of your husband's infidelity as a selling point. We all know people make mistakes. Marriages often dissolve over a hint of unfaithfulness and unforgiveness. Only the extremely strong can take a mistake made by a spouse to demonstrate their character. If I'm not mistaken this is Sanders' second wife and 'The Donald' has had three wives and several affairs. How many times have you been married? They can't use President Bill Clinton's infidelity to their advantage, but you can. Who are the people advising you?","post_message":"Jimmy Fallon: Can we do a Snapchat? Hillary: Sure! 👻"},{"comment_id":"1006229472770134","commenter_b":"You seem a lovely Christian...","commenter_a":"Scum bag,evil,man!! He's a Muslim running America,funding ISIS","post_message":"'Welcome home, Mr President'"},{"comment_id":"1323629084344227","commenter_b":"and pretty much any woman could be a better president than Hillary.","commenter_a":"Not only can a woman be president but Hillary can be a better president than most men in fact the only MAN that can be a better president than her IS Bernie","post_message":"Stay classy, Bernie fans!"},{"comment_id":"501298436725116","commenter_b":"Need more Americans like him . Hope he can beat all the charges . Muslims need to go back home !","commenter_a":"Not a hate crime","post_message":"A lesson he'll NEVER forget..."},{"comment_id":"10153266437101336","commenter_b":"Real biker gangs are way more dangerous than the pretty actors on that show made them seem.","commenter_a":"They all must have watched a marathon of Sons of Anarchy this past weekend","post_message":"UPDATE: Police adjust the number of people arrested from 192 to 170. \"This is probably one of the most gruesome crime scenes I've ever seen in my 34 years of law enforcement.” – Waco police Sgt. W. Patrick Swanton @webpagelink"}]
