[{"comment_id":"10154523609503984","commenter_b":"oh, Spanish ought to set you off too, especially those who want to make it our official language, after all it was Spain that did the most detriment","commenter_a":"Cynthia, America is not racist. There are racist people that live in AMERICA. Obama is a race baiting man stop being BLIND. It was VERY INAPPROPRIATE for the speech he gave in Dallas. If anyone has the TRUE right to be angry about racism it is MY PEOPLE, NATIVE AMERICANS. I don't see any blacks living on reservations in America.","post_message":"This guy hits the nail on the head. I'm sure race baiting liberals will be fuming after watching this. A lot of people took aim at Michelle Obama in 2015, but no one hit the bullseye harder than he did..."},{"comment_id":"501076896740857","commenter_b":"Please jailer give that crazy lady a good short hair cut. Get rid of that horses tail.......","commenter_a":"She wants more of the spotlight I do hope that they send her back and let her stay there enough of her do your job or resign enough of you","post_message":"Send her back!"},{"comment_id":"10153803233601028","commenter_b":"No, seriously, she need to be deported to California.","commenter_a":"Deport her!","post_message":"Bound for Yale in the fall, a North Texas valedictorian revealed in her commencement speech that she is an undocumented immigrant. @webpagelink"},{"comment_id":"10154043389689411","commenter_b":"well.... you can still get it from my throat and eat it eh? #NoWaste Stop world hunger lel","commenter_a":"Robert Pavle Dulić how my life will die prob. lel","post_message":"His last words were 'Watch this'"},{"comment_id":"788216704618375","commenter_b":"Sure he is Jewish but how could a man of his intellect believe the cartoon that created this shithole country?","commenter_a":"Put on your yarmulka even though it's not Chanukah....welcome to Israel.","post_message":"Welcome to Israel, Jerry Seinfeld 😍😍😍"},{"comment_id":"262360004194462","commenter_b":"It's a bad photoshop job","commenter_a":"Ewww !! Haha","post_message":"TELL US IN THE COMMENTS!"},{"comment_id":"985798528183066","commenter_b":"What if the Mexico government said any pregnant women being deported back to Mexico must have an abortion. Would ya let them stay or kill the baby because remember #alllivesmatter.","commenter_a":"I don't know. I still see a lot more dead baby posts than lion.","post_message":"\"This is offensive stuff, and there’s more outrage about a dead lion than there is about dead babies.\" -- Marco Rubio, on Planned Parenthood's videos"}]
