[{"comment_id":"10154142695231378","commenter_b":"Jesus for president!!!!","commenter_a":"This loser is not my President !!!","post_message":"#LIVE: President Obama holds first news conference since election."},{"comment_id":"10153278392893352","commenter_b":"Bitch,just ruined my happy day.","commenter_a":"She neither loved her children or deserve to be called their mother. Her hatred for her husband superseded the lives of her children.","post_message":"Mother ‘burned her three children to death and rang their father so she could tell him “Listen to their screams – they won’t survive” after he demanded custody in Belgium’"},{"comment_id":"175417336287166","commenter_b":"#ShesWithStupid","commenter_a":"Are so called democratic people stating that they only want decisions via a democratic process to agree with their views? Is the USA on the verge of Facism and is this coming from so called Democrats.","post_message":"Protesters gather in New York's Washington Square Park to rally against President Trump's policies. Watch on #FacebookLive."},{"comment_id":"1724833864402419","commenter_b":"We're going to drive one right up that midgets rectum","commenter_a":"Hey its cool. He's just demonstrating our first amendment rights. Lol","post_message":"NKorea claims could wipe out Manhattan with hydrogen bomb..."},{"comment_id":"10154507187503690","commenter_b":"By expressing these words u r only humiliating blacks,u r suitable pig to work as the puppet of western world to defeat the black pride.how unfortunate u r","commenter_a":"imagine arabs without islam, great scientist, musicians, world class pretty models, sport heroes, legendary actors both male n female but islam brought d vice. without oil plus islam saudi and d rest would have been worst than somalia. I cause the day that rapist dirty war mongering piglet (mohhamed) was born","post_message":"\"Some people skydive, some people race cars, and some people like to fight.\""},{"comment_id":"10153623259427623","commenter_b":"@username coming here isn't a right. And yes, it is the same thing. Building a wall to keep people who don't belong here out is no different than you locking your door. You lock your door to keep people out.","commenter_a":"If you lock your doors at night then you agree with Donald J. Trump. I expect my government to be at least as security conscious about my country as I am about my family. This is not racism or rudeness, but common sense safety measures in a time such as this.","post_message":"All of Donald Trump's talk of constructing a wall between the U.S. and Mexico has inspired an artist to build a little border wall around Trump's star on the Hollywood Walk of Fame."},{"comment_id":"1626970717590041","commenter_b":"Just another dumb ass girl.","commenter_a":"Great job to a fellow veteran to set her straight. As a veteran we all lay our lives on the line and people like this little girl has no concept of what that means. It seems to me her family hasn't taught her or the school's she has gone to they need to wake up","post_message":"What an epic response by this Veteran!"}]
