[{"comment_id":"944552658926615","commenter_b":"People always wanna go after the other person. .. well guess what? .... THE DAUGHTER WAS THE ONE WHO HAD HER 16 YEAR OLD LEGS OPEN. AND WHAT 16 YEAR OLD BOY GONNA SAY NO TO PUSSY? smh","commenter_a":"I've got 4 daughters and a handfull of granddaughters--put me on her jury!","post_message":"MAD MOTHER: Police say say she beat up a boy after finding him in bed with her daughter. After he ran away, they say she took a baseball bat to his car."},{"comment_id":"1610489359249521","commenter_b":"Maybe she'll have a stroke.","commenter_a":"She has RECENTLY HAD 2 BLOOD CLOTS ON HER BRAIN, FROM WHEN SHE FELL AND HIT HER HEAD. SHE IS EASILY CONFUSED, STAMMERS, SHORT-CIRCUITS , AND IS DILLUSIONAL. She is not well. \"THOU SHALL BEHOLD AND SEE THE REWA.RD OF THE WICKED\" !!!!!! Psalm 91.","post_message":"Hillary Clinton apparently needed assistance standing up at a rally."},{"comment_id":"975168282518593","commenter_b":"Better be sure. Our us h hospital are not allowing this.....What. If. Patient wants non Islamic nurse. Because is this practice?","commenter_a":"STOP with the offending of muslims.....this is the United States of America...land of the free.... Who gives a crap if your offended....","post_message":"Whoa!"},{"comment_id":"10156861000555725","commenter_b":"No more stuffed-shirt limp-wristed men who talk to us in carefully chosen PC correct words .... We need a real man to take control of our country and return us to our glory days! AMERICA FIRST - EVERYONE ELSE IS A DISTANT SECOND ...... #TRUMP2016!!","commenter_a":"Why would anyone believe Breitbart after they made a business deal to screw one of their own?","post_message":"WOW! An honor to be the first-ever presidential candidate in a primary- to be endorsed by the National Border Patrol Council. WE WILL BUILD THE WALL-- WE WILL MAKE AMERICA SAFE AGAIN! Thank you."},{"comment_id":"10152610870925950","commenter_b":"And go on a global eradication war to execute 2 billion Muslims.","commenter_a":"AND; the 100,000 troops need to come from the Middle Eastern nations (not the U.S.)!","post_message":"According to a CIA insider, it would take 100,000 ground troops to effectively respond to ISIS."},{"comment_id":"10153866253733984","commenter_b":"Neurotic sad women","commenter_a":"Go TRUMP","post_message":"This is exactly what makes Donald J. Trump such a polarizing figure. Some people love him for this sort of thing, and some people hate him for it. Are you one of the ones that likes him?"},{"comment_id":"630177530448762","commenter_b":"It is not surprising, if it was a terrorist attack the pilot would have tried to crash the plane into a very densely populated area i.e not the French Alps.","commenter_a":"I'm relieved (and surprised) that the pilot's last words weren't Allah Akbar.","post_message":"Aha! That's a BIG part of it I'm sure."}]
