[{"comment_id":"10153400550747042","commenter_b":"Good thing those girls were white, if they were black they probably would've been arrested","commenter_a":"The cops are doing their job! These girls are breaking the law. Now let's give the cops a big round applause (being sarcastic)","post_message":"KIDS' STAND SHUT DOWN: They were trying to earn money to buy their dad a special gift for Father's Day."},{"comment_id":"1056445444376466","commenter_b":"Happy International Women's day.","commenter_a":"A woman got recognition in the late 1800s? Wasn't the womans rights movement kind of non existent at that point? Wouldn't she have just been laughed out by any male doctor of the era without a chance to prove herself","post_message":"#womenyoushouldhaveheardof"},{"comment_id":"10154757524712300","commenter_b":"booooooooooooohooooooooooooo","commenter_a":"Got eeeem","post_message":"Anti-Donald J. Trump protesters gather at Bayfront Park (may contain graphic language)"},{"comment_id":"1196791103694693","commenter_b":"David, better vote for anyone on the GOP side than voting for the criminal Hillary \"Cankles\" Clinton. The woman should be in prison.","commenter_a":"DO NOT be complacent. Progressives need to come out in the MILLIONS and vote. Otherwise, the Republicans/teaparty, who sold out to crazies who actually want to take a dump on the Constitution and make America a \"Christian\" Theocracy, will win.","post_message":"Republicans are losing ground in key demographics."},{"comment_id":"10153311119075329","commenter_b":"I want to know how many of the women that are saying \"I use soap to clean my vag !\" Are really only using soap on their vulva and are NOT actually sticking soap in their vagina.","commenter_a":"Jonathan Perez hahahzha jk","post_message":"FYI"},{"comment_id":"10154133286695399","commenter_b":"Oh look it's a troll","commenter_a":"The republican party is an organized seditious criminal conspiracy. There is no reasonable basis for Ryan's actions.","post_message":"\"Briefings for the candidates will be provided on an even-handed non-partisan basis,\" James Clapper told Ryan."},{"comment_id":"764904010309446","commenter_b":"RBG.. ALL DAY NOW","commenter_a":"When it's American soil , it'll be be armed patriots push back Muslim insurgents ,,, the main steam news will not say so ,, but we the people will !","post_message":"Coming to America soon compliments of Barack Obama."}]
