[{"comment_id":"10153432042256051","commenter_b":"Those poor people deserve a better life I heard they throw their children in the garbage because they're girls","commenter_a":"Taking misogynists whose lives revolve around subjugation of women is a bad idea. Honor killings and selling daughters are both illegal in America. Thank God.","post_message":"Here's why President Obama says accepting Syrian refugees is the ultimate American thing to do. Do you agree with his message?"},{"comment_id":"10153782383018984","commenter_b":"Yes I agree with the teacher. With the country like it is, how did she know it was not a bomb. Thank, to her for keeping our students safe. I wish they would all go back to there own Country .","commenter_a":"Just wanting to get more free money. They need to kick the whole damn family out of the country.","post_message":"There's already plenty of controversy and speculation surrounding the case of the 14-year-old boy Ahmed Mohamed, who brought his clock to school - and now what his family just did is taking it all one step further, Do you still stand by this school's decision to call the authorities?"},{"comment_id":"997192570318083","commenter_b":"She should run","commenter_a":"The horrifying thing about Ann Coulter is that.....someone has sex with her. The more horrifying thing is....there's a chance it's consensual.","post_message":"Many of Ann Coulter's fans were not happy with her dream ticket."},{"comment_id":"833545303358765","commenter_b":"She's a idiot!","commenter_a":"Abortion is not the answer - Pro-Life is!","post_message":"How many of you would have been aborted under this perverted logic?"},{"comment_id":"807798315963065","commenter_b":"ENOUGH IS ENOUGH, DO YOUR JOB CONGRESS!!!!","commenter_a":"HOW is this legal?","post_message":""},{"comment_id":"10156238965050354","commenter_b":"Hillary isn't change She is Washington She is the establishment Everything that is wrong with America Is what Hillary represents!!!!!!","commenter_a":"Are lawmakers going to allow themselves to be sued when a citizen is killed because they can't protect themselves?","post_message":"DEVELOPING..."},{"comment_id":"10154016611014087","commenter_b":"I agree but Jill can't win. It'd be impossible. So Hillary because of the Supreme Court","commenter_a":"\"The dems candidate is a disgusting violent criminal who should be locked up\" - every republican. \"The Republicans candidate is a disgusting violent criminal who should be locked up\" - every Democrat. \"You both are right\" - every sane person in the country #jillnothill","post_message":"Minnesotans have not voted in a Republican at the presidential level since Richard Nixon's landslide victory in 1972."}]
