[{"comment_id":"775477502501275","commenter_b":"I agree with Mark Colwell.one muslim won't go against the other.they are all for crap..","commenter_a":"Gee, really, and what would they do if he made them angry? Another Dem moron speaks in defense of her Beloved Leader and what she says is as stupid as they both are. How do these people get through even elementary school being this dumb?","post_message":"And this is what Democrats think about terrorists... #facepalm"},{"comment_id":"10153607526077452","commenter_b":"What a good citizen! Love this.. Especially with the morons out there who have killed sea life by trying to get a good selfie!","commenter_a":"Hope he finds his mommy 😟","post_message":"A tour guide rescued a young dolphin stranded on a beach. @webpagelink His heroic effort ensured that the dolphin was able to swim another day."},{"comment_id":"10153167789731336","commenter_b":"Wow only they can attack ppl...what happens to them a slap on the hand!!! When does all this stop? The violence is out of control.. I no if they would of attack my husband an I was in my car..probably would of ran them over or use the gun to scare them off.... Sad that no one helped!!!!","commenter_a":"This is why you carry. Been a few dead teens if it had been me.","post_message":"Caught on camera: A man was viciously attacked in broad daylight by a mob of teenagers while helping an elderly woman at a gas station."},{"comment_id":"10153986738115667","commenter_b":"She is a joke","commenter_a":"Haters go away","post_message":"\"The American people deserve to get the full and complete facts immediately,\" Clinton said in her first comments about the newly discovered emails. She added that she is \"confident\" the FBI won't change its mind about bringing charges against her."},{"comment_id":"842641039186009","commenter_b":"Do that to me, and I would turn you into a girl!","commenter_a":"What a bunch of cowards that's what we need not","post_message":"Here's the 'poor refugees' just looking for a 'better life' as they piss on women. Check this out... @webpagelink"},{"comment_id":"1101197406562586","commenter_b":"wheredid they dig these women up she does not know what she is doing..she mite as well givr the city to the thugs, disarm the police and go home and take a nap","commenter_a":"Burn it","post_message":"There are people openly worrying if Mosby's case fails, if Baltimore will burn to the ground."},{"comment_id":"1874042932818866","commenter_b":"She is the mentally unstable one.","commenter_a":"And you should have left by now. We already elected him!","post_message":"Rosie O'Donnell says Trump is mentally unstable, and we have \"less than 3 weeks to stop him America. Do you think her comments are treasonous?"}]
