[{"comment_id":"10156346841015725","commenter_b":"Build the wall","commenter_a":"America should close the borders. You do not lock the front door of your house because you hate the people outside. You lock it because you love the people inside. A country's border is its front door.","post_message":"From South Carolina last night- this is what I call a real supporter! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"10152857531566491","commenter_b":"Dustin I spelled behaviour perfectly fine. Only AMERICANS spell it your way. And that's not saying much","commenter_a":"WHAT?! maybe influencing spoiled, childlike behaviour!","post_message":"Kanye West is on TIME's list of the world's most influential people #TIME100 @webpagelink"},{"comment_id":"10155406778245231","commenter_b":"Couple? Ha! You are uninformed white women have been weaving in droves for years. Weave is weave texture is not a determining factor.","commenter_a":"Does that include white women too?","post_message":"But will he take their money when they purchase tickets?"},{"comment_id":"1066337003492628","commenter_b":"The woman is delusional.","commenter_a":"That is exactly what they are afraid of, that he will do something that never could do or would do. They just want to keep the people dependent on the government and not be able to stand on there own two feet?","post_message":"Hypocrisy, thy name is \"Democrat.\""},{"comment_id":"10153188303164087","commenter_b":"Put this bitch in jail.","commenter_a":"Looks like she gets the \"CHAIR\" same as Ethyl Rosenberg!","post_message":"Hillary Clinton’s personal email server hosted two “top secret” emails, a new report reveals."},{"comment_id":"10155932451330206","commenter_b":"Don't you think it's time for a woman President!","commenter_a":"Did you catch her phony southern accent from that speech she gave? Just more proof that nothing about her is real.","post_message":"Are you ready to beat Hillary? Join the team that can win in 2016."},{"comment_id":"10155111807156162","commenter_b":"It's her white male privilege.","commenter_a":"Wtf probation !","post_message":"The 46-year-old mother avoided jail after pleading guilty to raping her daughter's 13-year-old boyfriend."}]
