[{"comment_id":"10155186975350809","commenter_b":"Great idea, I might even watch the show if they did that. However it will never happen. That would mean doing what you're preaching and Hollywood is the least likely group to do that . It's fine to give to charities at a safe distance, make photo ops with your body guards right outside the shot, but this would be invasive to their gilded lifestyle. So expect more of the same lectures from the podium and not much else.","commenter_a":"really @username???! @username?? Please!!!! Give me a break","post_message":"Conservative Hollywood actor Robert Davi throws down the gauntlet and calls Leftist Hollywood out on its hypocrisy with an incredible challenge: invite illegals and refugees to the Oscars and your private parties or admit you're a racist! Enjoy this delicious read..."},{"comment_id":"1088253067851669","commenter_b":"Sure.. The Democratic party will take votes any and all ways possible. Even if it means a threat to National Security. Anybody supporting this refugee program should have mandatory sign for being a host household and paying for ALL clothing and food out of their own pocket. When I bring this up on Gov Tom Wolfes page you can here the crickets chirping. There were a load of dems in support until I said this. Then \"SILENCE\". Why should the MAJORITY of the state who don't want them here have to pay? Incidentally, not all dems want them here niether.","commenter_a":"Obama & Hillary Clinton created this whole refugee problem.","post_message":"Professor: Refugee crisis is result of Obama's Syria policy"},{"comment_id":"631671896999280","commenter_b":"Too many real stories of sexual predators taking advantage of this garbage! BOYCOTT target!","commenter_a":"After the Trump rally last night here in Pa all the restaurants and stores were packed in the vicinity. We drove past Target to get out of the traffic jam and we noticed they were dead. It was really weird to see.It was bad enough when we came home from Kmart one day my 13 year old daughter telling me a female came in the bathroom with a bag and needle. Wish I knew before we left but I do not want her coming out and telling me a MAN was in there watching her No way.","post_message":"Target customers show the company just how they feel about its new transgender bathroom policy. @webpagelink"},{"comment_id":"10153118428724641","commenter_b":"Those blood sucker should come to Malaysia to joining in our corrupt club here without fear... They really stupid because Malaysia only protect the corrupt rich...","commenter_a":"Must be getting ready for something if they want more people back to their country.","post_message":"150 corrupt Chinese officials may be hiding in the U.S. And China wants them back cnnmon.ie/1M6Of5q"},{"comment_id":"1265414436832359","commenter_b":"SHAME ON THOSE ASSHOLES","commenter_a":"Alabama - the best argument in favor of mandatory abortion.","post_message":"From Restricting the right to vote to using $1.8 million to renovate his beach house, Republican Governor of Alabama now sinks to a new low with awarding his staff with $73, 405 raises after blocking a minimum wage increase in Birmingham."},{"comment_id":"10156340474870354","commenter_b":"The Failed LIE of Multiculturalism is KILLING America. Low IQ Aborigines cannot uphold the Personal Responsibility DEMANDED. See Baltimore, DC, St Louis and Ghetto after Ghetto!","commenter_a":"Yes, yes!","post_message":"“I believe our country’s biggest threats come from within, from failing to address our incredible fiscal irresponsibility, by allowing our populous to become enemies with each other, stirring up hatred and strife within our country, by allowing education to take a second seat, by giving a lot of lip service but not actually taking care of it.\""},{"comment_id":"10153155041977439","commenter_b":"Her. Defence allah made me do it ☺","commenter_a":"I hope they arrested this trash!","post_message":"MIAMI AIRPORT JIHAD TERROR: Muslim rams her car into a checkpoint and screaming in Arabic, threatens to BLOW UP airport. Go to pamelageller.com"}]
