[{"comment_id":"1715281765380661","commenter_b":"These adulta should be ashamed of themselves! Hoping whatever league they are in bans them from attending any more games!!!","commenter_a":"What a bunch of degenerate so called parents and adults. Useless to kids and society","post_message":"WATCH: Brawl breaks out between coaches at an under-10 baseball game. The stunned little kids don even know what to do. The video was provided to ABC News by a spectator. @webpagelink"},{"comment_id":"10158633377120725","commenter_b":"Funny, president Obomba deported more people than any president in us history. Liberals worship him. Trump deports people and out come the crybabies and the protests.","commenter_a":"Why deport the good people? I don't get this ine","post_message":"Advocates believe the roundups and arrests mark a shift in enforcement under the Trump administration."},{"comment_id":"952760784783670","commenter_b":"She is a sad excuse. Why do we care what she says. Why do we care she breathes. Waste of space.","commenter_a":"I've seen prettier horses","post_message":"How much lower can Katie Hopkins go?"},{"comment_id":"10153660734489726","commenter_b":"what a mess she is!","commenter_a":"You mean murder!!!","post_message":"WATCH: Goldberg: Planned Parenthood Founded for Abortions"},{"comment_id":"10153626389226336","commenter_b":"Guns don't kill people husbands that come home from work early do.","commenter_a":"You need tougher idiot-control!","post_message":"\"I've got to do something going forward that makes her life meaningful and will always be with me. And this is the way to do it.\" – Andy Parker"},{"comment_id":"1391521917576588","commenter_b":"She is one ugly ape!","commenter_a":"Where is the FBI? Where is homeland security? These idiots are threatening the president of the United States.","post_message":"Nasty Liberal Journalist Asks Why Trump Assassination Is Taking So Long INSTANTLY Blows Up In Her FACE!"},{"comment_id":"10154686052869586","commenter_b":"Get this bear out of there now","commenter_a":"Holding animals in captivity is inhumane. Do not support zoos.","post_message":"Thousands of people visit daily to take selfies & knock on the glass :("}]
