[{"comment_id":"1662896673932550","commenter_b":"Her mom's argument is invalid, he's black, cops would have shot him anyway and by the time they got their clerk would be dead too, good job armed guy! (Y)","commenter_a":"Boo hoo my thug piece of shit waste of air got shot. She wanted him in jail so she didn't have to feed his useless ass.","post_message":"Normally, I would be on the side of the shooter in most cases, but this...?...  @webpagelink"},{"comment_id":"1159718984066336","commenter_b":"Hang that ugly devil.","commenter_a":"go figure","post_message":"Disgusting."},{"comment_id":"389873387803923","commenter_b":"Really professional. I do (NOT) want her in the White House.","commenter_a":"I think she committed political suicide.","post_message":"Did you find this picture offensive or irresponsible for someone in her position?"},{"comment_id":"10157824241580354","commenter_b":"Convert them or kill them.","commenter_a":"People who want to believe in Muslim as a religion should first understand how it was started and read a book called THE STORY OF MOHAMMED BY Harry Richardson .This book is where Islam started and who started it . It's a paper back book takes about 3 hours read it it tells you how thus Prophet Muhammad where it came from and how it all started. It tells you how this guy was nothing more than an outright murder a thief and kill everybody who didn't agree with him now people show up and tell you that Islam is a peaceful religion that guy would be nuts to believe that this book was done a great research and there's nothing peaceful about this guy named Mohammed take it upon yourself to read","post_message":"“We must not be afraid to approach and contend with the complexity of Islamic law and history, the good, the bad, the ugly and the viciously anti-democratic.”"},{"comment_id":"1082304031883694","commenter_b":"'@username 'butt hurt'.... It is a comment about grammar.","commenter_a":"What is a 'one and three chance'? Does that mean we will get hit with four storms? The spelling and grammar people are nonexistent in the media these days.","post_message":"There is a one in three chance of a “historical windstorm for nearly all of Western Washington that would be long remembered.”  Take today to prepare for possible power outages and have some extra supplies on hand."},{"comment_id":"1456373527716006","commenter_b":"secede already and take your cousin wife with you and all the other uneducated ignorant trash with you. Republican policies fail every time and only uneducated idiots do not see the truth that is why your state doesn't believe in education","commenter_a":"Once again......Trump was right!!! And that kills the over sensitive lefties.....","post_message":"Trump once remarked to a 'Celebrity Apprentice' contestant that it 'must be a pretty picture, you dropping to your knees.'"},{"comment_id":"915027651932695","commenter_b":"Yes","commenter_a":"YES!","post_message":"Follow us for more at BuzzKix"}]
