[{"comment_id":"576566162546923","commenter_b":"I'm going to keep flossing every day. Brush three times, floss once. Usually more but oh well. When you get ten cavities per year, you do whatever could give you hope","commenter_a":"The AP can't get facts right about news events, so we should trust them about flossing?","post_message":""},{"comment_id":"10153427070736749","commenter_b":"BAN ALL THE POLITICIANS AND YOU WON'T HAVE ALL THESE STUPID IDIOTIC LAW'S WE HAVE TODAY WHERE THEY ARE TRYING TI TAKE ALL OUR GUN RIGHTS AWAY! OUR FOUNDING FATHERS OF THIS GREAT NATION ARE PROBABLY TURNING OVER IN THEIR GRAVES RIGHT NOW THINKING WHAT, WHERE AND WHEN THE NEXT CIVIL WAR WILL BE HERE IN THE U.S.A. WE NEED TO CLEAN HOUSE OF ALL THESE ELECTED OFFICIALS AND ELECT NEW BLOOD INTO THE OFFICE! CASE AND POINT MADE.","commenter_a":"Time to get EVERYONE trained properly on gun safety! Time to re-address the mental illness issues...","post_message":"Gun violence shouldn't be so commonplace. It's time for Congress to do something about it. @webpagelink"},{"comment_id":"10153701487053984","commenter_b":"She need to stay out of all business","commenter_a":"tell that ugly monkey to miind her own business","post_message":"Students have been complaining about Michelle O's lunch rules since they were implemented, but now it just got taken to a whole new level... Do you think schools should quit enforcing Michelle Obama's lunch rules?"},{"comment_id":"946602502043757","commenter_b":"She is not presidential material!!!","commenter_a":"This is one shady lady.","post_message":"\"But we also are extremely troubled by the events...\""},{"comment_id":"888007527972526","commenter_b":"Send em to their mother land","commenter_a":"Why then are they even here? Get the hell out of this country","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays Lets get 3000 SHARES if we should deport them!"},{"comment_id":"10153697633816636","commenter_b":"@username females mature quicker than boys, starting periods as young as 9, some see that as start of womanhood, females have sexual hormones and crushes in early teens so YES it isn't any different... She does need locking up","commenter_a":"I think you mean that she raped the 13 year old boy on an almost daily basis. She is sex offender who groomed then raped her victim, if genders were swapped people would see this monster for what she is and see that the 13 year old is a victim.","post_message":"'I have chills because of this'"},{"comment_id":"10153945644022061","commenter_b":"@username because the wife wouldn't lie right?","commenter_a":"Speak children...\"Out of the mouths of babes!!! All of the racist and fearful cops should be out of the streets and sitting behind a desk (not having to deal with the public). A lack of respect is found in all groups of people and that still is not an excuse to slaughter a certain group. Americans kill, so should terrorists groups kill us??? Should animals attack people because they kill them for sport or make them zoo exhibits?","post_message":"TAKING A STAND: Kids of Charlotte spoke out at a city council meeting about their fear of the recent violence in their hometown: @webpagelink"}]
