[{"comment_id":"999816333406704","commenter_b":"It's rough being a single parent. But \"usually \"women have less resources to work with.","commenter_a":"We single fathers do just as much.","post_message":"When you talk about heroes and heroines, at the top of that list is the single moms of America."},{"comment_id":"10155741021510354","commenter_b":"Dear Allison, you are one poor sucker. There never was a thing called white privilege. You thought emancipated blacks were slaves but in truth , the only thing equality means is that no one gets a free ride . Not blacks or whites...you have the freedom to work your little butt off to get what you earn. If that is white privilege, you have been duped into wanted to toil and toil to get what you want in life...same as the next guy.","commenter_a":"you are a fucktard","post_message":"Why MSNBC called in an erotic novelist to discuss this topic is beyond us... but somehow the crazy here might even surpass Rachel's."},{"comment_id":"10153464911441438","commenter_b":"And What was the point of that weak made up story? if a girl offers a blow job for a ride and decides not to give it, you're still not allowed to rape her. You can tell her to get the fuck out of your car, but no absolutely nothing in her behavior made her deserving of rape. Even if she got in the car ass naked.","commenter_a":"Sexual consent: latent sexism, in the flesh. Hey, bitches, I heard there is a drunk girl on the corner who doesn't want to walk home. Because she is an entitled whore, you taught her that it was ok because whatever she feels is more important than fact, she decides to solicit a random passerby in a car. \"I'll give you a blowjob for a ride,\" are her words. Yet, that interaction, with all of its attendant suggestions & latent sexism & the very fact that it would not have happened without HER initiative, is somehow NOT her responsibility. That's the latently sexist, bullshit truth of femifucktardism & all of you self raping bleeding gashes. 90% of the time, anyway. Protect me because I'm a whore with a bleeding gash and I have to have protection because of the biologically driven imperative, but don't hold me responsible for ANY of my ...","post_message":"Owen Labrie is guilty of sexual assault, but not rape. What?"},{"comment_id":"10153704026896350","commenter_b":"And what kind of Kenyan or African name was it. Something no-one can pronounce or spell I'm sure.","commenter_a":"s","post_message":"Aww, we think the name is perfect!"},{"comment_id":"10153072205104614","commenter_b":"Let us hope this woman wasn't aware of the situation. Because otherwise they're both sick horrible people.","commenter_a":"I hope this pig gets sodomized repeatedly. ......human garbage.","post_message":"BREAKING: A 30-year-old man Newhall man has been charged with sexual assault and murder in the death of his 19-day-old infant daughter. Matthew Brendan Warner led investigators to the baby body less than 12 hours after the infant had been reported missing over the weekend. He was arrested on suspicion of murder. On Tuesday, prosecutors announced he had been charged with aggravated sexual assault, torture and other alleged crimes. Read KTLA's story here: @webpagelink"},{"comment_id":"1222871987767261","commenter_b":"@username no yo are for supporting that muslim scum","commenter_a":"HES DONE MORE FOR THE USA THEN OBAMA DID IN 8 YRS YOU PPL NEED TO GET A LIFE AND MOVE ON","post_message":"BREAKING NEWS: President Trump holds surprise press conference at the White House"},{"comment_id":"10153081516228822","commenter_b":"Eliza sounds like she's the one going to hell.","commenter_a":"Why is this topic constantly being forced down our throats","post_message":"It was a historic day for marriage equality in the US -- and Pittsburghers had a lot to say."}]
