[{"comment_id":"10154264831942411","commenter_b":"'@username Did you even look at the picture?","commenter_a":"Enjoy climate change people humans are to blame for early spring weather.","post_message":"We've never seen anything quite like it."},{"comment_id":"10156889052280206","commenter_b":"if we really want to protect our country all we have to do is put up pictures of carly at the borders. that would scare anything.","commenter_a":"First is to end all illegal wars in the Middle East and stop supporting rebel groups with weapons which eventually end up in the hands of people who wish to harm the USA. We no longer need to rely on Middle East oil so there is no need for the US to be there.","post_message":"Q: What do we need to do to protect our homeland?   Get more answers at @webpagelink"},{"comment_id":"10157253812445725","commenter_b":"#VoteTrump2016 #StopTheEstablishment #ProtectTrump #ImWithYou #MAGA","commenter_a":"We believe!!!! #trump2016","post_message":"IF YOU DO NOT BELIEVE IN YOURSELF- NOBODY WILL! •DJT"},{"comment_id":"10153572834548132","commenter_b":"He fucked his sisters......BIG difference","commenter_a":"She's right. There was virtually no mention from the media of Lena Dunham's admission of touching her sister when her book came out. Complete double standard.","post_message":"Sarah Palin isn't too happy with what she calls 'obvious double standards' between the Duggar family and actress Lena Dunham."},{"comment_id":"1012675578755490","commenter_b":"Stupid women","commenter_a":"shut up skanks, cancel the p.o.s....","post_message":"Umm ACTUALLY it is in the Bible!"},{"comment_id":"1669850779963439","commenter_b":"Fat bastard","commenter_a":"Another big jerk, oh bye the way michael were not muslim","post_message":"CLOWN SHOW."},{"comment_id":"10153111531487483","commenter_b":"While yes , abortions do bother me, I can see where they are necessary in some instances HOWEVER, I don't believe the federal and state govts ought to pay for an abortion that is not medically necessary!","commenter_a":"Here we go again..Same poop, different day. Same old narrow-mindedness and folks being too lazy to do ACTUAL research. Some people are so close-minded that even if you had the proof right in front of their face, they wouldn't believe it. 'Oh my God! Planned Parenthood (PP) does abortions!!! We MUST stop them NOW!!!!' *SMDH* Heaven forbid that they actually admit that PP provides other things to both women AND men as far as health screenings, treatment and counseling. So go ahead you Fools, and defund a program that low-income families have depended on for years. I just don't understand how some folks call themselves 'Christians'.","post_message":"Planned Parenthood says Medicaid patients have a right to choose their health care provider. A 21-year-old woman, who has received contraceptive shots from Planned Parenthood, joined the lawsuit against the state."}]
