[{"comment_id":"10152512178746316","commenter_b":"Most doctors are not looking out for you, just the bottom dollar. Research apricot kernels","commenter_a":"Cannabis oil all the way! Id never ever do chemo","post_message":"Radiation and surgery provide more burden than benefit, destroying prostate cancer patients' quality of life in their final years. What would you do if you were diagnosed with cancer? @webpagelink"},{"comment_id":"820733274641888","commenter_b":"I'd piss on the ladies car. Put vaseline on her door handles lol","commenter_a":"Oh wow! That's...harsh. It's bad enough that poor girl is struggling like this but for the person who wrote that note to shove that into her face then rub it in? oh heck no! @username, please follow up on this report and let us know the results. This story has just gotten me so hot I could boil the water for my tea just by holding the kettle in my hands!","post_message":"NASTY NOTE: Ashley Brady is still struggling to get used to her life as an amputee. She finally got a handicapped parking spot at her apartment complex, but two days later she saw a car parked there. After leaving what she believed was a polite note, Ashley got this in return:"},{"comment_id":"10154033103686065","commenter_b":"he is just telling it like it is....and i am him now","commenter_a":"On point and going after the media . Media is so bias and they are being called out for what they are.","post_message":"What do you think?"},{"comment_id":"1201817856581131","commenter_b":"I had idiots spit on me and throw eggs, rocks etc when I protested illegal immigration peacefully in California. I do not care if you are a man, woman or someone confused about their gender, if you spit on me or attack me I am going to do my best to make you eat teeth. I am fed up with these anti american liberals illegal aliens etc etc acting like animals. I would be by myself protesting and be outnumbered by a pack of thugs like this and I stood my ground and waved MY FLAG. You scumbag liberals and illegal aliens want some come and get some.","commenter_a":"Fellow liberals, this violence against Drumpf minions needs to stop. We cannot stoop to their level. The GOP will use this violence to court people to their side and we cannot allow that to happen. I get your passion but we need to use more voices but no violence.","post_message":"One woman wearing a Trump jersey was cornered, spat on, and pelted with eggs and water bottles."},{"comment_id":"1210812922267700","commenter_b":"Fools! All of them!","commenter_a":"Liberalism hit squads at their finnest huh Rush.","post_message":""},{"comment_id":"10153768350172452","commenter_b":"It's not when you split lanes... it's when traffic is going about 30mph, motorcycles are going 60, and we in larger vehicles try to switch lanes. A small bike going twice our speed appears almost out of no where.","commenter_a":"We split lanes for one main reason: Safety! In a world with endless distractions, the rear ending of motorcyclist almost always ends up with a fatality.","post_message":"Gov. Jerry Brown has signed legislation that moves California toward condoning the practice of lane splitting, in which motorcyclists drive between two lanes of cars."},{"comment_id":"1619982001628404","commenter_b":"HILLARY WILL BRING MORE OF THESE TERRORISTS INTO THE UNITED STATES !!!!! SHE MUST BE STOPPED !!","commenter_a":"Who would predict that...lol...: @webpagelink","post_message":"Hillary Clinton's weakness while she was Secretary of State, has emboldened terrorists all over the world to attack the U.S., even on our own soil. They are hoping and praying that Hillary Clinton becomes President - so that they can continue their savagery and murder."}]
