[{"comment_id":"10152535175096813","commenter_b":"Start helping the ppl who are already here. How many Americans are out of work but Obama thinks it's better to hire illegals and give them driver license so they can vote. Yea sounds like he's buying votes for the Democratic party. When a soldier retires from the military where does he go. Shouldn't he have the first pick in a job then someone who crossed the border illegal.","commenter_a":"This was an ideology, not law...come here legally & you'll have no problems!!!!!","post_message":"All of our clients who were locked up in #immigration detention at Artesia are now getting a right to be heard. But there are others who deserve that chance, and aren’t getting it. @webpagelink"},{"comment_id":"1159085570778138","commenter_b":"No the Great Wall did not work. Mongols had no problem getting over it.","commenter_a":"Nothing But Crap. Christie came out strong when he was elected Governor but it's been all down hill since. Why talk about Brady, not even his State. As for the wall, it worked for thousands of years for China. Plus it's a hell of a lot cheaper than what it is costing us in welfare, medical, food stamps, crime, law enforcement, prisons..... Put the people collecting welfare to work, take the young men like the CCC and WPA days. Bring our military home and build the wall.","post_message":"“Please, please, please do not fall for the idea that we are going to build a wall along the entire 2,000-mile border of the United States and Mexico ... It’s not feasible. It’s not practical. It’s too expensive. And by the way, I’ve never seen a fence or a wall that if a human being wanted to get over or around it that they couldn’t.”"},{"comment_id":"10155111433599614","commenter_b":"@username in Oregon not her she stinks hahah","commenter_a":"Jessica @username Davenport what an idiot lol","post_message":"The woman said she tried to get her pet ball python -- \"Bart\" -- out using cooking oil, but that didn't work. She went to the hospital, where her ear was numbed and stretched even more, freeing Bart. \"He acted like nothing even happened and was totally chill,\" she said."},{"comment_id":"10152976962214205","commenter_b":"Yea, you're right. My comment is stupid, cause it was meant to be. And all you idiots commenting on my stupid comment as if I'm serious lol What's even more ridiculous is \"the police have to do their jobs\". So that's why some ppl get Burger King and walked out of a building (when they've killed 9ppl) and other ppl get choked to death for selling loose cigs, or get shot to death on site for having a toy gun (a 12 year old btw). Or others mysteriously die by being shot in the back while cuffed and in the back of a cop car. Yea cops totally just doing their job by the books. So yea, thanks for \"proving\" me wrong on a comment that was clearly not serious to begin with. You butthurt idiots can shut your dick holsters and relax.","commenter_a":"Prolly told him \"good job son, you played your role perfectly. You did a good job as patsy for your government. Now here's your complimentary Burger King as promised.\"","post_message":"Did you know the cops bought Dylann Roof Burger King AFTER they arrested him? WTF?!"},{"comment_id":"617513011783820","commenter_b":"Bitch stumbles all the time","commenter_a":"She's a friggen Drunk ....!","post_message":"Hillary stumbles boarding plane..."},{"comment_id":"10152785786292434","commenter_b":"All women can give you something. A headache, an empty wallet, herpes etc.","commenter_a":"Everyone has chlamydia. But Norway's a nice place to catch it.","post_message":"Well it certainly got my attention."},{"comment_id":"10153840278814497","commenter_b":"That would put a LOT of male caucasians over 30 out of country.","commenter_a":"50% Talent competition and 50% swimwear competition.","post_message":"Step 1: Filled-out refugee application materials are thrown onto a large, unorganized pile of folders on a desk at the United States immigration headquarters"}]
