[{"comment_id":"1174959735872779","commenter_b":"They reported that in Oklahoma only Blue Cross/Shield was still in it and that they will be dropping out as well.","commenter_a":"I hope so...","post_message":"It's official!"},{"comment_id":"546785352178711","commenter_b":"Hey Cliff f u bitch.","commenter_a":"Hey @username go f yourself.","post_message":"Hillary Clinton wants the Fox News host's head, but she's not backing down.  She is in trouble. Let's show her our support.  Can we get 10,000 'LIKES' for this Fox News Host's stand against Hillary?"},{"comment_id":"10154184530456167","commenter_b":"And before anyone gets on me for it, personhood is moot and an unsupportable argument because of bodily sovereignty. Nobody, adult or child or fetus, is entitled to use someone else's body parts without their permission, EVER. If you have kidney disease you don't get to take someone else's kidney by force - not even if your life depends on it and you'll die painfully if you don't get it. If you have leukemia and need bone marrow, you cannot take it from someone else without their consent - even though marrow is fully replaceable by a healthy adult and it'd only be a temporary inconvenience to them. Men can't use a woman's genitals for their own pleasure unless she consents - that's why rape is (supposedly) a crime (even though punishment for it has been tragically lax these days). A woman's uterus is HER body part, she has it ...","commenter_a":"It's just a political witch hunt, like usual. It's not about women's safety or anything like that - it's about earning points with their base on the backs of Texas' poor women.","post_message":"**Fourteen** investigations have cleared Planned Parenthood of all wrongdoing, for starters."},{"comment_id":"10153093946344205","commenter_b":"Illegals idiot","commenter_a":"He realizes that Mexicans aren't the only immigrants in America, right? Over half of Americas population would be kicked out if he tried to do that, and that's only recent immigrants. If you wanna get technical, the only people that aren't immigrants are Mexicans and Native 741915279236631s. They were here first.","post_message":"Donald J. Trump's detailed and foolish immigration plan explained."},{"comment_id":"775380562560552","commenter_b":"Your a stupid bitch","commenter_a":"This is the best show on TV. I won't be watching TLC if this is true. We can forgive things stars, football players, and men in charge of our country, but we can't forgive something a 12-year-old boy did. Standing behind the Duggars and praying for them.","post_message":"\"19 Kids and Counting\" has been canceled after Josh Duggar's shocking confession."},{"comment_id":"10153095297087908","commenter_b":"What's your problem with little girls?","commenter_a":"A bunch of bitchy little girls.","post_message":""},{"comment_id":"10155035981661159","commenter_b":"So I take it she does not plan to work in the near future, for she may not fit any parts with cropped hair.","commenter_a":"Who is she???","post_message":"This didn't work out very well..."}]
