[{"comment_id":"1224398304283560","commenter_b":"I'm not here to judge anybody but whoever has the experiences will ultimately become the President. It's a done deal and nobody can deprive a woman of what she is duely qualified for . Our next president of United iiiStates of America is president @username.","commenter_a":"Kitty cat ? Lolololol So Republicans want a pig who assaults women as the next president of the mighty US of A","post_message":"This is horrific. We cannot allow this man to become president."},{"comment_id":"1447392598607688","commenter_b":"Style and Clinton DO NOT go together; she dresses worse than a bag lady.","commenter_a":"Oh Lordy, how gross!","post_message":"Hillary Clinton? You mean THAT Hillary Clinton?"},{"comment_id":"10152587508455163","commenter_b":"She read them their rights! Envyherlashes Tawana","commenter_a":"@username girl yes I was so happy Amber told them hoes wat it really IZ it's was going on ALLDAY yesterday!!!!!","post_message":"Amber Rose responds to Khloe Kardashian after calling her out for Kylie and Tyga comments"},{"comment_id":"10154375998138145","commenter_b":"Some women get pregnant and have babies only to blackmail the father of the baby . 5 min sex with a crazy chick get you scrued for lifetime","commenter_a":"REVOKE her parent card!!! right now before anything happens to that baby. I will gladly adopt","post_message":"She got 2 months in jail, but could have faced 5 years in prison. The baby now lives with his grandmother."},{"comment_id":"1264161686965709","commenter_b":"Sounds like the brides need to chill the hell out lol i would rather go on a awesome honeymoon then spend that kinda money just to walk to a isle... But that's just me and I'm a very different kinda women.","commenter_a":"Retarded....","post_message":"And about $16,000 of that is for the venue alone... STORY: @webpagelink"},{"comment_id":"10153111433392483","commenter_b":"Awwww lets cater to the criminals AGAIN shoot the bastard and be done i cant stand a fucking pedophile sick sick sick","commenter_a":"Their gonna let this perve go","post_message":"A gag order was issued today in the case of an Alabama pastor accused of sexually torturing, abusing and raping multiple children and teens."},{"comment_id":"1357769630924322","commenter_b":"This story is a distraction tactic to pull attention away from the real story. Americans seem to fall for it every time. Next week it will be something else..keeps us divvied and look we are.","commenter_a":"Oh, and another thing Far Left Liberals. The Head Muslim wants to destroy USA with his crazy Muslim immigration scheme so the U.S. \"can be lowered to the standard of the rest of the world\" is lunacy! Obama is a Muslim, this is not a Muslim state although he is trying to make it so..that is his Legacy. That is why Trump was elected. We are not the Muslim States of America!","post_message":"Hell has officially frozen over. Shared by Occupy Democrats, LIKE our page for more!"}]
