[{"comment_id":"842641039186009","commenter_b":"Do that to me, and I would turn you into a girl!","commenter_a":"What a bunch of cowards that's what we need not","post_message":"Here's the 'poor refugees' just looking for a 'better life' as they piss on women. Check this out... @webpagelink"},{"comment_id":"953112161448505","commenter_b":"Women.Stop having sex without condoms....","commenter_a":"Women. Stop having sex with Republicans.","post_message":"Sen. Elizabeth Warren has a powerful message for the Republicans that just voted to defund Planned Parenthood. Pass it on! Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153079471709411","commenter_b":"Pakistan is terrorized from within, same as we are from the west.","commenter_a":"I wonder if this drone terrorised the inhabitants of the White House as much as US drones do to civilians in Pakistan?","post_message":""},{"comment_id":"889040704452119","commenter_b":"I'm outdone. The babies can't even sell Girl Scout Cookies in peace!","commenter_a":"Smh. .","post_message":"“What Did I Do Wrong?” 9-Year-Old Girl Shot While Selling Girl Scout Cookies With Sisters"},{"comment_id":"1158047454312031","commenter_b":"STOP THIS IN AMERICA!! Send illegals back! Police those that are here legally. These people want us dead....when did that change, folks????","commenter_a":"If they want to kill off their women and children nothing we can do about that. I have no problems shooting anyone who is coming after me. It's us or them. I say us","post_message":"It's only a matter of time before children will be doing all the dirty work. These monsters MUST be stopped. @webpagelink"},{"comment_id":"10154413356958701","commenter_b":"Well that sounded racist against whites to me ALLLLLL LIVES MATTER IF U R BREATHING THAN U MATTER EVEN THE DECEASED MATTERS WE DONT FORGET ABOUT THEM SO EVERY BODY AND SOUL WHETHER ALIVE OR DEAD MATTERS SO STOP THE HATRED","commenter_a":"Scary! Those dens of racist hate are all over the country.","post_message":" do not say police lives do not matter, we do not say all lives do not matter, said Right Reverend W. Darin Moore. we do not apologize that we boldly say, and unapologetically and uncompromisingly declare, black lives matter."},{"comment_id":"10152565333134071","commenter_b":"Both of them are idiots !","commenter_a":"Legalize it, is the best way to keep it out of minors and kids.","post_message":"#Pot2Blame?"}]
