[{"comment_id":"10154839732705695","commenter_b":"Amen to that!","commenter_a":"If Trump can be manipulated by someone half his age with no power over him then he doesn't belong in any leadership position, let alone the Presidency.","post_message":"She suggested that Trump may not have known his microphone was on, calling it \"kind of a boy talk\" that \"Access Hollywood\" host Billy Bush was encouraging."},{"comment_id":"1225422174190243","commenter_b":"Now you can tell her that our President likes to grab pussy's! You must be so proud.","commenter_a":"Well I personally am glad I dont have to wake up to another 8 years of Democrats!!!! Its a 2 way street. I felt the same way...Glad I didnt have to tell my daughter Hillary is our president. Time to get this country back and finally build a future for my daughter and family","post_message":"The CNN commentator appeared to choke back tears as he voiced concerns felt by many in a divided election."},{"comment_id":"984015725050561","commenter_b":"Carla. Go back to school honey. You are so stupid.","commenter_a":"Compare this: Melania Trump became a US citizen and said it was \"The greatest privilege on the face of this earth.\" Michele Obama said in a speech, \"For the first time in my adult life I am really proud of my country.\"","post_message":"Donald J. Trump’s campaign chairman denies allegations Melania Trump lifted her convention speech from Michelle Obama’s in 2008, claiming such an act would be \"absurd.\""},{"comment_id":"1071384586215885","commenter_b":"No, she's just a crazy bitch.","commenter_a":"This is silly. A healthy lifestyle stops Cancer 90% of the time . The other 10% is the govt and environment","post_message":""},{"comment_id":"1776292422637356","commenter_b":"I think that Donald Trump needs to demand a conservative moderator for the next debate or refuse to debate. He needs to demand to get the questions ahead of time like Hillary(doesn't need them). Oh yes, and be able to wear an ear piece and get fed all the answers(not that he needs them). He also needs to learn the hand signals(doesn't need them either). Play that wicked game better that that witch!!!! Do not let her rig another debate, or pay off the moderator. Do not get on the defense or let her get off by not answering for her sins. Be hard on her in this next debate and bring out all her skeletons. The media will continue to make you out to be the bad guy but America is not stupid and this deplorable is behind you!!!!","commenter_a":"TRUMP","post_message":"'Donald Trump is ready to lead.' Gov. Mike Pence"},{"comment_id":"10153419431089024","commenter_b":"Strange? No. Normal. These two are NOT our Allies.","commenter_a":"they're called \"handlers\", making sure their government's contributions are used wisely.","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"975974852420526","commenter_b":"You would lie like that? You and Warren deserve each other!","commenter_a":"We really DO need to declare the GOP a terrorist organization!","post_message":"From today's #MorningReads: GOP Front-Group Targets Warren's Legacy; \"Jihad John\" IDed; and Inside the GOP's Campaign to Defang Federal Gun Laws."}]
