[{"comment_id":"10153291171784203","commenter_b":"Jews and fat women.","commenter_a":"Yeah, bring back the jokes about Gays and Blacks.","post_message":"Why can we all grow up and just let comedians be comedians again?"},{"comment_id":"10153060149946051","commenter_b":"Bitch boy Yu still white nd YUr trash to pussy","commenter_a":"Nothing like white/black trash argueing!","post_message":"When this woman heard what a couple parked near her said, she lost it."},{"comment_id":"10153196939420047","commenter_b":"Remove yourself from The United States of America. You Don'T America's Ways. LEAVE!!!","commenter_a":"It probably should be removed. Does a nation that promotes the murder of the unborn and celebrates a counterfeit\"marriage\" trust in the one, true God who has revealed Himself in Scripture? Nope. Meaningless words that don't impress the God of all creation at all. Repent and believe the Gospel.","post_message":"Avowed atheist Michael Newdow is at it again. He's just filed a federal lawsuit demanding that \"In God We Trust\" be removed from U.S. currency. We must remain vigilant in defending the Constitution from yet another assault on our religious heritage."},{"comment_id":"963452387028567","commenter_b":"Judy.. that is a huge part of the problem with the US today.. Dumb parents raising dumber kids. She has NO id ... can not drive nor get married nor get any medical care. How Stupid is that? She gets sick .. just stick her in the dirt right? Great parenting.","commenter_a":"That's amazing. Her parents should be charged with abuse.","post_message":"Her parents never got her a birth certificate or social security number, never took her to a doctor or let her go to school, and now she has no way of proving to the government that she even exists."},{"comment_id":"10153424886503598","commenter_b":"How do you plan a family without having a man involved. What they have encouraged is the prostituition of women both in devaluing young girls and women and when they become pregnant pretending to help. But their motive all along was to take a product that costs them nothing and process it( dissect and distribute) to the highest bidder.) to be used for unimaginable purposes. This philosophy is one of the most vile known to humankind. I know a woman who was told by her father when she was a teenager if you get pregnant you nor the child will be helped by me; she would be disowned. This man was a leader in his church but he had absolutely no Love from Christ in his heart. That is not Father God 'a kind of love. That is the kind of hard hearted ness that allowed these baby slaughterhouses to ...","commenter_a":"Amen","post_message":"After 27 Years of Killing Babies in Abortions, Abortion Clinic in Virginia Shuts Down for Good"},{"comment_id":"10154357996114203","commenter_b":"innocent guns. why do we ban drugs such as cocaine? if the entire responsibility is on the abuser","commenter_a":"line up Americans arguing what the definition of assault rifle is.","post_message":"Conan O'Brien: \"I am a father of two, I like to believe I have a shred of common sense, and I simply do not understand why anybody in this country is allowed to purchase and own a semiautomatic assault rifle. It makes no sense to me. These are weapons of war, and they have no place in civilian life.\""},{"comment_id":"10153130276219071","commenter_b":"Want to know who fought against any and all mental health checks for firearm purchases? The ACLU and liberal groups...that's right...the ones screaming the most about \"guns\" are the ones with \"Blood on their hands\".","commenter_a":"All these gun nuts won't even consider the possibility of mandating thorough background checks before purchasing a gun. That's all that is necessary in my view. Instead they keep covering their ears and screaming \"taking away our guns won't change anything\". People wanting better gun control legislation don't necessarily want to take away normal/healthy/stable/non-criminals ability to purchase guns, we just don't want any psycho to be able to walk into any store and purchase a gun in 5 minutes.","post_message":"He says he's shocked that his son owned 14 firearms."}]
