[{"comment_id":"800970150035571","commenter_b":"Stupid...sheeple its a bathroom!","commenter_a":"Target Please close doors move out of there where they respect all the people,,,,","post_message":" continue to believe that this is the right thing for Target,'' the company told TODAY in response to the boycott."},{"comment_id":"10154555938529411","commenter_b":"Deeick Foley Kiss my Muslim American ass you scum.","commenter_a":"A failed colonial Zionists nuclear power have learned a lot and definitely exceeded the Hitlers Nazi's regime. Free Palestine. #BDS","post_message":"For those who are 'murdered with a knife in the heart it does not matter if the child is 12 or 15'"},{"comment_id":"10154392573271491","commenter_b":"It's only a temporary ban, you guys make it seem like it's a ban forever and second why is it that USA always has to help the world, we have our own problems to take care of... Maybe once things are clear here and we are able to eradicate a huge chunk of terrorism, because it's honestly never gonna go away completely, then the ban can be lifted... What does it matter where the terrorist attacks that were here came from, people just want to open the borders like its nothing, let's spend some of that money here for once and help American citizens instead of foreigners for once or for now at least...","commenter_a":"She fails to understand we are trying to make sure those same radical Islamists, like the same ones who tried to kill her, stay out of our country. I'm saddened to see a survivor of radical Islamic terrorism can't sympathize with the U.S. trying to prevent terrorists from sneaking in as refugees!","post_message":"Malala Yousafzai: \"I am heartbroken that today President Trump is closing the door on children, mothers and fathers fleeing violence and war.\""},{"comment_id":"1321956137825394","commenter_b":"Great, I'm off to Havana tomorrow!","commenter_a":"Cahl Denni Sharknado?","post_message":"Every single one of those black dots is a 2-meter-long shark."},{"comment_id":"10154164931281162","commenter_b":"with your last name you should go back where you came from...why are you here in the US","commenter_a":"Cuba please keep Obama and his family. Also don't forget the mother-in-law","post_message":"Pres. Obama touches down in Cuba, making him the first sitting president to set foot in the country in almost 90 years: @webpagelink"},{"comment_id":"1118742268187889","commenter_b":"ISLAM AND SHARIA LAW SHOULD BE BANNED FROM AMERICA PERIOD! THE MEMBERS OF THE OBAMA ADMINISTRATION NEED TO ALL BE REMOVED BY CONGRESS FOR TRYING TO TAKE OVER AMERICA THROUGH ISLAMIC RELIGION! PEOPLE LIKE OBAMA, HILLARY, LYNCH, HOLDER, GARLAND ARE ALL WORKING TO FORCE ISLAMIC BS UPON THIS COUNTRY! WE HAVE SECRETLY BEEN INVADED BY THESE POS TRAITORS AIMING TO BRING DOWN THE U.S. THROUGH ISLAM!","commenter_a":"finally a State with some b---s","post_message":"CELEBRATE!! VICTORY! South Carolina House Passes Bill Excluding Sharia Law From State Courts! THEY TOLD MUSLIMS HELL NO!"},{"comment_id":"916372545089161","commenter_b":"She is beautiful. But ugly women and men with little dicks see the opposite! :-)","commenter_a":"She is still pretty","post_message":"Where HAS Michelle Obama's hair gone?"}]
