[{"comment_id":"10154462492528487","commenter_b":"Depends on your view. How much of the worlds' healthcare systems have you been a part of, witnessed or experienced. We are not perfect but we are so far from \"sucks\"","commenter_a":"The crap we have now sucks","post_message":"What would TrumpCare mean for Americans? Essentially, a public health disaster."},{"comment_id":"10153009704367690","commenter_b":"Attention, single ladies. Line starts to the left - lol","commenter_a":"And where did they pick up the Black man? #1 2nd row!","post_message":"JUST IN: Mugshots of some of those arrested in connection with the deadly biker brawl in Waco. Open link to see information on each mugshot. @webpagelink"},{"comment_id":"10150574072889999","commenter_b":"Exactly, politicians and police could learn a lot from thisman","commenter_a":"this is how a real man behaves - God Bless you Mr. Taylor","post_message":"Malcolm Taylor, a Baltimore city bus driver, was watching the riots unfold on television, and saw some of the players he coaches in youth football among the rioters. He gathered 15 friends, including some church pastors, and went to the riots near Mondawmin Mall to try to calm things down."},{"comment_id":"10155910391265725","commenter_b":"Take America back. STOP buying crap from other countries.","commenter_a":"DONALD TRUMP: Speaking what everyone is thinking. TAKE AMERICA BACK.","post_message":"Wow, some new and even greater polls-- thank you!"},{"comment_id":"10153311362744135","commenter_b":"Thank you \"Pieter\" for finally posting something informative. This may be the first time. As far as your buddy \"Kathleen\" goes, it matters because many of her negative comments apply to politicians in general, so it would be quite naive and hypocritical of her to constantly criticize Christie, let's say for lying, while supporting a candidate who also lies.","commenter_a":"Please discuss why you don't threaten to enforce federal guns laws in states, but only marijuana. This would show you as a complete hypocrite and fraud. Please explain why you have expanded the failed war on drugs, your words, in Jersey.","post_message":""},{"comment_id":"1763785047184730","commenter_b":"Nice mouth for a lady?","commenter_a":"and this is supposed to negate every racist, woman hating, derisive thing he's said in the past 9 months???? Fuck off!","post_message":"Do you support Trump?"},{"comment_id":"869870296383645","commenter_b":"I got bad news my greatgranddad was a yankee from OH I;m from KY. I know the war was over states rights","commenter_a":"My family were Union all the way but I have no qualms about the Confederate flag.","post_message":"\"In a free society, offensive speech should not just be tolerated, its regular presence should be celebrated as a symbol of democratic health.\""}]
