[{"comment_id":"10150607537004999","commenter_b":"Each act of terrorism has its own agenda. Define the act.","commenter_a":"A hate crime is an act against someone or a group of people based on their gender, race, sexual orientation or religion. Terrorism is an attack in which the victims are not relevant to the agenda. Terrorism is a statement normally made towards a government, a hate crime is a statement towards the victim, it's personal. For me I think a hate crime is more horrific, to hunt and kill someone for being who they are. Terrorism is more of an act of a coward, a hail marry pass.","post_message":"\"Why can’t we own up to the fact that hate crimes are just another form of terrorism, perhaps the worst, since they target the weak among us?\" Read on in The New York Times Opinion."},{"comment_id":"10153226407581770","commenter_b":"Evil scum bags. Send them back!","commenter_a":"Strategically this suicide!","post_message":"When the politicians said \"Refugees Welcome,\" did they know they'd be welcoming a rape culture as well?"},{"comment_id":"1231536326885822","commenter_b":"She's not getting in the White House !","commenter_a":"The real sad thing is that Hillary won this election a long time ago with lies , blackmail, payoffs etc. The list goes n and on. She and her party are so dangerous and I fear our world will never recover from her.","post_message":"SHADY KAINE @webpagelink"},{"comment_id":"1502468899813234","commenter_b":"You mean his other bitch. First bitch is Michelle. Lol","commenter_a":"If you listen you can here Louisiana's governor kissing Obama's ass cause he is afraid Obama will sic his bitch Killery on him and he will suddenly \"commit suicide\" or die in s plane crash,\\\\","post_message":"Oh, it's okay if OBAMA doesn't visit Louisiana when they're dealing with massive floods..."},{"comment_id":"10153067823099411","commenter_b":"My respected fellow u explain very nicely like a poet and blame to muslim now one question who attack on Afghanistan who is killing innocent people in Pakistan by drawn attacks who is killing Muslims in burma. who is killing Muslims in Africa,and one thing listen Islam is the religion of peace not terror first study islam than make justice infront of me 10 cristians got Islam its not the issue main point is that dont try to impose religion war make the world peaceful place not hell thank you","commenter_a":"Copy and paste this on ALL muslim stories! Flood them with the truth! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The underwear Bomber was a Muslim The U-S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bafi Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Muslims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The Besian Russian School Attackers were ...","post_message":"Hundreds of thousands have flooded the streets of Chechen capital of Grozny in a rally against the publication of the Prophet Muhammad by Charlie Hebdo magazine. The demo, dubbed to Prophet Mohammed, was organized by region clerics and united muslims from various regions of Russia."},{"comment_id":"1758834931015826","commenter_b":"A dude with a dick is what he is!!! Let's call a Ace an Ace & a spade a spade now!!","commenter_a":"Oh fuck this bullshit! Enough already! You're a chick with a dick we get it, not the first, nor the last. Ever been to fucking Thailand? Loaded with these fuckin things. Better looking too.","post_message":""},{"comment_id":"1513700471996539","commenter_b":"I agree with a person that wants sources: he is right to ask for them. I did not give some simply because it would take too much time on my part to gather them (about the same it would take to do the research on CRS and FATCA's actual consequences). These are the keywords you want: FATCA CRS money laundering Nevada","commenter_a":"Jumping on the demonize Putin wagon eh, big surprise coming from vice. This has nothing to do with Putin, but I see his name a hundred times. Clearly this leak came from the u.s. How about the American banks laundering drug money, or the us govt selling weapons to drug cartels, or CIA plane crashing full of cocaine, or u.s Senator macconell s boat full of cocaine. Won't touch that, because that's actual truth, stay away from that. Just another propaganda outlet for the u.s government.","post_message":"The Panama Papers were a big deal."}]
