[{"comment_id":"10153290694163279","commenter_b":"Shut up.","commenter_a":"@webpagelink David W. Blight described the day: This was the first Memorial Day. African Americans invented Memorial Day in Charleston, South Carolina. What you have there is black Americans recently freed from slavery announcing to the world with their flowers, their feet, and their songs what the war had been about. What they basically were creating was the Independence Day of a Second American Revolution.","post_message":"As part of our Memorial Day special, watch this speech by former Rep. Pat Schroeder recorded at the conference, \"Vietnam: The Power of Protest.\""},{"comment_id":"10154680763616729","commenter_b":"So what makes you think her scores were low? What makes your comment racist is that you assume she was brought in to make quota and you assume she had low scores.","commenter_a":"Shocker! She is a person of color! Don't scream my comment is racist. It is a glaring problem in the military academies that they bring in people of color to meet a quota, thus depriving others that scored better of the opportunity to attend. These cadets have little to no respect for the US, the military or the academy. The all black cadet photo of them with raised fists of black power that went unpunished is a good example. Fuck Obama's America!","post_message":"No wonder this has gone viral."},{"comment_id":"10153513415174342","commenter_b":"They should serve the same time they kep him as their slave...","commenter_a":"Where are theBLM in this?","post_message":"A doctor and his wife moved from Nigeria to Britain in 1989 and with them came a 13-year-old -- whom they told officials was their son."},{"comment_id":"10153632735051636","commenter_b":"@username typical this comes out after assignment submission","commenter_a":"Just wondering how many u turns this is now ?","post_message":"A good day to bury bad news"},{"comment_id":"688684917923527","commenter_b":"Bye Lil bitch","commenter_a":"Damm bye @username","post_message":""},{"comment_id":"1266839853337023","commenter_b":"Hey Mario, stfu !","commenter_a":"You're an idiot if you think you can light a fire in the airless vacuum of space","post_message":"That classic \"teardrop\" shape only forms because of gravity. So what happens when there's no gravity?"},{"comment_id":"697292770461301","commenter_b":"I hope you're right Jim!! God help us all if she gets in!!","commenter_a":"She is a major disgrace to the Democratic party. If she is all they got, Forget next year's election. They don't a chance in hell.","post_message":"FBI wants to take down Hillary Clinton after she is caught in huge act of espionage. She needs to be thrown in prison. We can't let her get away again. Do you think Hillary Clinton should be arrested?"}]
