[{"comment_id":"1226004427434976","commenter_b":"Get rid of her please","commenter_a":"Anyone else would have been fired.","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"10156046538185389","commenter_b":"Sorry , but I don't think women belong in combat ! I am old fashion , I still believe in Chivalry ! :D","commenter_a":"Time to retire this so called..' Top Admiral '..too many PC types in the military now, arm chair leaders..!! Desk jockies..!!","post_message":"The U.S. Navy's top admiral said he believes female sailors should be welcome to join the service's elite SEAL teams, provided they can pass the training regimen."},{"comment_id":"986949048053489","commenter_b":"Yes take her to Court","commenter_a":"Do it! Do it!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1072635379446872","commenter_b":"That is one sick bitch to say such a thing","commenter_a":"SHOVE A RAT UP THE NIGGAS CUNT AND COCKROACHERS UP HER ARSE, NOW RAP A SONG ABOUT THAT YAH FUKIN GOLLIWOG.","post_message":"Azealia Banks tweeted Monday that former Alaska governor and 2012 Republican vice presidential nominee Sarah Palin should be “gang-raped by black men.”"},{"comment_id":"10154993367323245","commenter_b":"legal immigrants OK ILLEGAL immigrants NOT OK any Qs","commenter_a":"Not an easy job.....People need to stop attacking every thing he says and does.","post_message":"LIVE: Trump press conference"},{"comment_id":"1360247024053830","commenter_b":"Get these bastards out of our country they are worse than maggots","commenter_a":"Ship her sorry ass back to the Middle East. She will be the one spit on.","post_message":"This Muslim did something absolutely SICK to white Americans at Walmart... She's now facing hate crimes charges over this... wow."},{"comment_id":"10155207800518132","commenter_b":"She looks like a drag queen!","commenter_a":"Sad she hates herself so much to keep mutilating her body.","post_message":"Kim Zolciak Biermann is feeling nostalgic!"}]
