[{"comment_id":"10153203581878984","commenter_b":"Didn't a bunch of people get in trouble for using their own private email accounts for using government email accounts during an election. Why is it different with this woman she should have to open up every single email ever written or received just because it was her so called private account she did government business on it so that exams her from any protection","commenter_a":"God Bless you, Trey Gowdy !!!","post_message":"Hillary’s private emails could contain the smoking gun regarding the scope of her involvement in the Benghazi attacks… Send an email to Rep. Gowdy demanding answers from Hillary and the State Department!"},{"comment_id":"977904432246897","commenter_b":"She is an EVIL woman an not sure why she isn't in JAIL @username!","commenter_a":"Who is that masked woman?","post_message":"It's a very simple question: “Have you seen those very, very controversial videos?”"},{"comment_id":"10154491672598843","commenter_b":"Nice but ignorant..just because it looks nice doesn't mean it is. Well if we're going to have a March about saving babies, we must teach to save wome and men. Teach women knowlage of self worth not through sex to have standars. Teach men to stick around and train this child up. Their are far to many women who trust in the wrong Ideas about relationships and sex. A comunity of ignorance instead of in the scools teaching to waite and young girls to choose a good partner who is consistent. Also have father's taking responsibility instead of running off and leaving women to fend for themselves. Child support isn't always enforced, if she has no family, if she is in poverty look at where plan pearenthood is located in the getto where the poor is and if you think the CPS system isn't filled up over populated, better look ...","commenter_a":"However, they left behind lots of litter for someone else to clean up. How thoughtful.","post_message":""},{"comment_id":"712854462154600","commenter_b":"Abe Foxman is a puppet and does NOT speak for most intelligent Jews!!","commenter_a":"We should HOUND their offices and call and support OREN","post_message":"“In the days leading up to the forthcoming release of a memoir of his experiences as Israel’s Ambassador to the US, Michael Oren appears to be using the very legitimate and sharp policy disagreements between Israel and the US as an insensitive and unjustified attack on the president,” Foxman said in a statement. “We hope that Ambassador Oren will walk back these unjustified attacks.\" -- ADADL - Anti-Defamation League Abe Foxman"},{"comment_id":"10155056211255329","commenter_b":"Shut up, bitch","commenter_a":"Laura :p","post_message":"You know they're a real friend when you can be a dick to them."},{"comment_id":"10153128866595329","commenter_b":"Feminists brats don't want to objectified by men, but flock to articles like these. Hello, double standard. You ladies should be ashamed.","commenter_a":"Thank you!!!!","post_message":""},{"comment_id":"1391127634238463","commenter_b":"You poor Republicans. You are so lost in your stupor that all you can do is harp again and again over Hillary's e-mails. Sure, it was a mistake. But in the final analysis you can not find any harm caused by that. In the mean time just consider the damage caused to our nation by the rigidity caused by the Republican Congress over the past eight years. Your solution is to nominate a man devoid of any moral compass. Thanks Republicans. I can only hope that what rises from the ashes of the Grand Old Party will come closer to Abe's vision and that Rush L. stays buried in the ashes.","commenter_a":"I just do not understand how any true red blooded America could even think about voting for Hillary after her cover up of Benghazi and Emails !! The only thing she has proven is she is a BIG lair and above the law ! She is truly a woman of zero integrity and belongs in prison NOT running for our president !","post_message":"\"It took the socialist to remind us that you supported the trade agreements that cost millions of American jobs and millions of dollars.\" Last night on \"Justice,\" Judge Jeanine Pirro slammed Hillary Clinton over her Wall Street ties, failure to help the Middle Class, and backtracking over her husband's crime bill. @webpagelink"}]
