[{"comment_id":"473377599519487","commenter_b":"Leave the man alone. That goes for all you Muslims.","commenter_a":"He will never back down and kiss their butts he's not Obama....","post_message":"Muslims want Clint Eastwood's head, but he's not backing down.  This is outrageous, let's show him we have his back.  Can we get 10,000 'LIKES' for Clint Eastwood?"},{"comment_id":"1505789769441048","commenter_b":"Boycott NBC","commenter_a":"When has NBC ever put a spot light on Trump in a positive way? Lol.","post_message":"The 2016 election has been quite the seesaw ride."},{"comment_id":"10152728441711051","commenter_b":"Ship her to Iraq... just sayin!","commenter_a":"Shoot the witch..","post_message":"This woman killed her baby last year. Three weeks ago, she gave birth to another one. You can probably guess why she's in jail now."},{"comment_id":"1807238972845517","commenter_b":"NEVER GONA HAPPEN !!!!! BTW do any of these people know history???? Do they know that the first slaves were sold by Their own people???? Yes African people sold their own!!!! Now how the fuck.is that anyone's fault but their own peoples????","commenter_a":"We will not pay. No one in my family or ancestors had anything to do with slavery. Enough is enough move on.","post_message":"You May Have To Pay African Americans For Slave Reparations   Come try and get our money.  Will you pay for slave reparations?"},{"comment_id":"1723525614585873","commenter_b":"Brady Wix Baillee Schott","commenter_a":"Elias Deltoro Ryan Michael","post_message":""},{"comment_id":"704776766379568","commenter_b":"Yes deport them","commenter_a":"Only if it's to hell. I would never let her lose on another","post_message":"Controversial photo of Michelle Obama has many calling for deportation.  She doesn't deserve to be our First lady.  Would you vote to have Michelle Obama deported?"},{"comment_id":"502375926577851","commenter_b":"WELL damn go fund ME!","commenter_a":"It worked for this hating pig, wait for the next one. Gopers are slow learners.","post_message":"I'd say I've been doing it all wrong the past few years... except I'm a decent human being with a conscience... via The GOOP  | Liz"}]
