[{"comment_id":"10153430518633445","commenter_b":"She is no friend of common Americans! This bitch is out for herself and her MIC handlers, fucking traitor!","commenter_a":"Hillary Clinton will say anything to get elected but she is no friend of Marijuana.","post_message":"#Trending - Hillary Clinton Suggests Rescheduling Marijuana, But Does Not Currently Support Like-Minded Legislation."},{"comment_id":"10153428454984087","commenter_b":"She is the biggest liar in history ,ashamed she was the first female to prove it.. Disgraceful bitch.","commenter_a":"Go go go >3","post_message":"\"Do you believe that The State Department, on NEW YEAR'S EVE, just released more of Hillary's e-mails,\" Donald J. Trump tweeted. \"They just want it all to end. BAD!\""},{"comment_id":"10153337035811756","commenter_b":"I was watching a girls lacrosse match the other day and was puzzled as to why they weren't wearing more gear. Then I came to the realization by what was happening. Damn it, I just wanna see women knock the shit out of each other and get fucking pumped up.","commenter_a":"It's about time! Why do girls have to play softball instead of baseball in the first place? And while we're at it, why are girls expected to play that sissy version of lacrosse?","post_message":"“There would be nothing that would bring me back to softball because that’s not my love. Baseball’s my love.”"},{"comment_id":"642967212548589","commenter_b":"YOU ARE ALL IMMIGRANTS UNLESS YOURE NATIVE AMERICAN. DEPORT YOURSELF.","commenter_a":"Trump they going to kill you man you are trouble man","post_message":"WATCH LIVE: A large group of people protesting President-Elect Donald Trump are marching in downtown St. Paul, Minnesota. Similar protests are also taking place in Chicago, New York, Washington, D.C., Philadelphia, Portland and Atlanta.  @webpagelink"},{"comment_id":"10155076639181337","commenter_b":"@username Delete yours Racist POS","commenter_a":"How many time during his presidency was Obummer on Fox? So I don't blame trump for not wanting to deal with CNN and their fake reporting.","post_message":"Fox News defending CNN?? Donald J. Trump has inspired the impossible."},{"comment_id":"1246779605377041","commenter_b":"this is the first smart commnet I read on here","commenter_a":"People just need to work harder and not be lazy is all.","post_message":"To bring back the so-called  dream, we desperately need to address the massive inequality that exists in America today."},{"comment_id":"10154216491251943","commenter_b":"WAKE UP AMERICANS .. This May be the Last Chance American and the American people (voters) have to retain and Guarantee, our American Heritages, Customs and Constitutional Rights .. We need to rid American of the Radical Muslims and Illegals who are here and trying to take over America .. Do You want a Clinton Corrupted Government Controlled Life or a Trump Love America Lifestyle for your Children's Children .. SERIOUSLY - that is the Choice Were making and There going to be Living with .. This is more for our Children and there Children than for US but only WE can Guarantee them a life and Future that we had .. Clinton will be a Disaster for America and all Americans .. Surely you can realize that - listen to the news , ,LISTEN .. WE THE PEOPLE - need to Bring back GOD, COUNTRY AND CONSTITUTIONAL FREEDOMS to ...","commenter_a":"Burn the witch!!!","post_message":"Hillary Clinton must be held responsible for using \"private\" email accounts and a hidden email server as Secretary of State to conduct government business in violation of the law!  Judicial Watch is the one organization with a proven 20-year track record of investigating, exposing, and prosecuting Hillary Rodham Clinton and company. Please SHARE!"}]
