[{"comment_id":"1097693670320210","commenter_b":"Triple gross, have their hair all over my sheets, NO WAY!!!!","commenter_a":"Gross","post_message":"One New York couple has successfully acquired a bed large enough so that they and all 8 of their rescue pups can sleep comfortably. 'They love to just be near us. So however we can make that happen, they're happy.'"},{"comment_id":"607938739358501","commenter_b":"Then dont go watch guadian of the galaxy 2 ..groot hates you!","commenter_a":"Look! Its raw meat! Its eel on the grill.. so it is food! We human are mammal and also carnivore. So eat things raw is a way of eating. Only when you kill for fun and waste the meats of throw away too much leftover then that would consider a sin for others may not have enough to eat! If you think eating thing raw is immoral or gross then throw away your fruits, veggies because they are still living things and have souls and you may not know it! Damn you people with no understanding and misjudgement","post_message":"What. The. Hell."},{"comment_id":"10153088404166770","commenter_b":"Yeah really. She's more worried about herself than anyone. More lies from Billary!!!!","commenter_a":"They only lose sleep about how to deal with Clinton when she is elected President!!!","post_message":"'I would imagine that I’ve thought about what happened more than all of you put together. I’ve lost more sleep than all of you put together. I have been wracking my brain about what more could have been done or what should have been done.'"},{"comment_id":"10153622542063188","commenter_b":"No","commenter_a":"Get serious","post_message":"Would you sign it?"},{"comment_id":"550590221774115","commenter_b":"Republican presidential candidate @username has admitted to lying about his application and acceptance to the U.S. Military Academy at West Point, Politico reported on Friday. The retired neurosurgeon and current GOP frontrunner has been using the story as a central point of his personal life during his campaign.","commenter_a":"But its just been confirmed that you lied about West Point. You're done in my book. Before that, I supported you.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153363808198010","commenter_b":"How do we know the restaurant would go out of business anyway? It happens all of the time. I live in Seattle and the rate increase is just slowly beginning to take effect. No conclusions of this sort can be made.","commenter_a":"In Seattle where they just raised minimun wage to $15 a hour some restaurants are now going out of businss as restaurants are having to pass on to their customers a lot higher prices for the food they serve.","post_message":"An L.A. City Council committee has endorsed a hotly contested plan to raise the citywide minimum wage to $15 by 2020, up from the current $9 an hour. The proposal now heads to the full city council."},{"comment_id":"1074912275882577","commenter_b":"Look at their faces....they're smiling. ...and we're not allowed to be angry about this. All of you bigots need to shut up! Wear your flag ....fly your flag......shove your flag.....who cares ....but you will not see it flying over that government building ever again!!!! Deal with that!","commenter_a":"Are these the same, 'It's Heritage, not Hate' clowns?","post_message":"South Carolina voted to remove the Confederate flag, and bigots are in a frenzy: 'F*ck black people'"}]
