[{"comment_id":"1528594670781352","commenter_b":"Death penalty. Nothing less. Deporting them isn't going to change anything. They'll be back and will do this again.","commenter_a":"I love Obama","post_message":"If we don't have a border, we don't have a country. I want people to come in LEGALLY and follow the laws of our great country!"},{"comment_id":"10153134052206770","commenter_b":"They haven't earned my country or my freedoms. Let them go back and earn them in their own country. We did.","commenter_a":"Scold the 57-58 Arab nations who REFUSE to take ANY. There must be some reason they're so adamant we'd be fools not to follow their led. And stupid to be swyed by a hoard of malcontents. Have yo shown ANY appreciation to those countries who have given you free access A RESOUNDING NO. That Homeland Security is aware of the risks, and still continues is disgraceful.","post_message":"The largest Arab American civil rights organization in the United States is alarmed because 31 state governors have said they will refuse entry to Syrian refugees in their states."},{"comment_id":"10154254037283352","commenter_b":"Fuck that queen","commenter_a":"He must be on his period","post_message":"'I'd rather see a drag queen!' Elton John accuses Janet Jackson of lip-syncing"},{"comment_id":"939636916071768","commenter_b":"She's a whore? @username you are a crude, ignorant troll.","commenter_a":"The first real scientific post-debate poll results are out and they are great news for Hillary Clinton. According to the just released Huffington Post/YouGov poll, 55% say Clinton won the debate as compared to just 22% who said Sanders did. Furthermore, 52% in the national poll now say they want Clinton to be the nominee, up from 44% prior to the debate. All in all, a great result that matches the media's assessment of who won the debate, our next President, Hillary Clinton!","post_message":"Larry David is Bernie Sanders."},{"comment_id":"474902102708278","commenter_b":"Suck a dick cnn","commenter_a":"The Dallas Police Officers were not killed by BLM members, but by an ex military man who was involved with ISIS! Pay attention!!! So much hate in this state. Disgusting. Thankful for the police protection here and their professional attitude. Stay safe all !","post_message":"We're in Phoenix, Arizona, where residents have gathered at City Hall to protest police violence and the recent shootings in Minnesota and Louisiana. (Source: CBS 5 AZ - KPHO/KTVK)"},{"comment_id":"10153249048488352","commenter_b":"Pure evil heartless bitch","commenter_a":"The same thing should happen to her no doubt about it","post_message":"Texas woman, 26, found guilty of suffocating fiancé's two-year-old daughter to death using duct tape after he broke up with her"},{"comment_id":"1797835747132215","commenter_b":"A nasty woman","commenter_a":"This women should never be allowed to moderate another debate ever again, she clearly has an agenda.","post_message":"At Monday’s White House press briefing, ABC’s Martha Raddatz lobbed President Obama a question designed to get him to criticize President-Elect Donald Trump. He refused to humor her request."}]
