[{"comment_id":"1783677398519787","commenter_b":"@username TRUMP IS OUR NEXT PRESIDENT.GET OVER IT.","commenter_a":"I am really not a trump fan.. But if his election gets rid of half the asshats that say they will leave he's got my vote","post_message":"She's out."},{"comment_id":"1004595529587074","commenter_b":"Show me where I said that Jeep!! Assume much?? Many woman have had very easy deliveries and others more difficult. You cannot predict which way it will go. HOWEVER, every successful abortion kills a new human.","commenter_a":"Choose Love, Choose Life! All human beings deserve a chance at life. If you agree with saving trees or animals but, not human beings you are an idiot.","post_message":"Every life is a blessing!"},{"comment_id":"1079981378728005","commenter_b":"Sick Bitch","commenter_a":"She's an immigrant through and through!","post_message":"WOW. Just...Wow."},{"comment_id":"1320520624652837","commenter_b":"Minus the illegals AND the refugees AND the dead people!","commenter_a":"California in particular allows illegals to vote. When someone applies for a driver license in that state, they are automatically registered to vote, contrary to Federal Law.","post_message":"TEASE: TEASE: Yeah... about that."},{"comment_id":"1240022466017781","commenter_b":"@username Yes, but less human.","commenter_a":"The correct term is undocumented immigrants. It is not right to say illegals. We are all part of the human race. As an American born citizen I say that Trump is wrong. Undocumented immigrants are very important to our work force. They work very hard. Some work harder than those born here. If we send all undocumented immigrants back it would put this nation under. Yes we have a immigration problem. But fix it the right way. Undocumented immigrants deserve a chance as we all do to live in a country like ours.","post_message":"Under the Eisenhower program, immigrants inside the U.S. were rounded up and deported to remote places, resulting in deaths and criticism of human rights abuses."},{"comment_id":"10153940111165579","commenter_b":"Any women who can put an unborn baby through a shredder while it's alive....is nasty","commenter_a":"So good to see a man who stays and takes care of his kids. At least he wasn't chasing an intern around the Oval Office right..... Why is it Libs can be so mean to men who stay with their families and give honor to men who not only engage in adulterous affairs but continue to do so. Liberal women are nasty...that is all.","post_message":"Speaker Paul Ryan: \"This was not a job I was looking for or seeking, it kind of sought me. I realized that it was a duty and an obligation. Now realize it's an honor.\" Watch complete press conference here: @webpagelink"},{"comment_id":"10153357248947061","commenter_b":"silly girl","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."}]
