[{"comment_id":"401994746592233","commenter_b":"I haven't done any unlawful thing at all not that big too get my ass in trouble but I get tired of how they treating everyone","commenter_a":"I don't believe they should have their guns taken away. Their are some good cops haven't seen it with my own eyes but, their are some. I want to know why they so scared now. I know their was a dog in this case but, what about the other case where people don't have are unarmed and the officer fears for his life. Cops are pussies now a days this shot didn't happen this often just a few years ago","post_message":"This story is as appalling as it is tragic. The Cop Logic and pure stupidity of this officer is staggering. I still can't wrap my head around it. Yet another case why some people suggest police should be unarmed.  Read more: @webpagelink Via - The Free Thought Project.com <-- (y)"},{"comment_id":"10155922805640725","commenter_b":"He will. Ana Smith . you are sick. Nasty mouth.","commenter_a":"Trump 2016 !! Make this country GREAT again!","post_message":"My #GOPDebate Facebook question for the other candidates-"},{"comment_id":"10152998251641045","commenter_b":"She should not be allowed the 10 as pets! Remove all the animals! What if those 10 are someones pets!","commenter_a":"Did she also house cats? I haven't read of any being there, but I wondered what happened to them if there were. Being that she was acting as a shelter for the county there should have been.","post_message":"The ASPCA's disaster response vehicle is now on site in Lawrence County to help remove more than 250 animals from the shelter. Police continue to guard the entrance, admitting only those who are helping with the investigation or caring for the animals."},{"comment_id":"1391527697542910","commenter_b":"She's a self-serving, self-promoting blowhard who couldn't care less about anyone but herself.","commenter_a":"Hillary Clinton may have been investigated by the FBI, but Jill Stein has a fucking arrest warrant out on her, yet she still thinks she's a plausible option.","post_message":"Memo to Dr. Jill Stein: There's nothing 'progressive' about saying that Hillary Clinton is more dangerous than Donald J. Trump, or that Bernie Sanders is a political insider, just because they don’t pass your purity test."},{"comment_id":"10156920810200354","commenter_b":"Hey Cat, I have a dog that likes cats. She break their necks and use them as a dumnbwitted limp cat as skinny playboy. Maybe I could introduce y'all. Then you and Hillary will have a lot in common except for her long awaited prison cell....Gordon, most elections was closed primaries, which means Donald couldn't continue to empty the democratic party list of intelligent members which was leaving them with the African-Americans voters and dumb and moronic white voter in that party. Anyone who could vote for Hillary must not be capable of reading or hearing...or just hate America","commenter_a":"I'm very proud of my state of Arizona. On to the White House!","post_message":"#Election2016"},{"comment_id":"10153100496946051","commenter_b":"i hope the fry his fat white ass","commenter_a":"He deserves life. He has destroyed that child's .Sending prayers for that little Man","post_message":"An 8-year-old boy was playing outside his apartment complex when this man showed up and shot him in the face. Decide for yourselves if the man's punishment was severe enough."},{"comment_id":"10153664203915950","commenter_b":"And you should be judged because you're a moron, Mary.","commenter_a":"How are you going to ban an American Muslim???!!!!! Wake up Mr. Trumpo!","post_message":"Donald J. Trump is pointing to the deadly Orlando attack to reiterate his support for the Muslim immigration ban he proposed last winter."}]
