[{"comment_id":"10154264665781336","commenter_b":"No @username My dad is a legal immigrant my dad learned today that his vote is worth crap and the party will NOT listen to his vote and they will do whatever unless you bribe politicians You can take your negativism and stuff it up your butt","commenter_a":"Why even be a Republican or Democrat when they throw away your vote and DO NOT LISTEN No LONGER a party member of anything","post_message":"'We don't feel that this was a fair process. The Trump button got checked more than any other, so why do we have so few delegates?' said State Treasurer Jeff DeWitt."},{"comment_id":"1518865864832838","commenter_b":"No but he does plan to get rid of illegals. Anyone coming I to our country will respect our laws AND FOLLOW THEM!!","commenter_a":"Hollywood has never been right about anything in politics!","post_message":"Another Communist making a fortune on capitalism..."},{"comment_id":"10153110429289312","commenter_b":"Yes two ladies had a fight over some guy and one stabbed the other one. SMH","commenter_a":"Wasn't there another violent incident at a different CC couple weeks back?","post_message":"What we know about a shooting inside a Chuck E. Cheese's in St. Charles. We will continue to update this link with confirmed information. on.ksdk.com/1JwUWcj"},{"comment_id":"1308394922562170","commenter_b":"Go build the wall then","commenter_a":"Put them in jail and large fine, deport the illegal immigrants now, cut federal funding, build the border wall, close all sanctuary cities/schools, take care of Americans/veterans first, if they legal learn our laws, constitution, and English , this is our country and if they don't like, they leave.","post_message":"A protester burns an American flag during marches through Olympia today. Video from The Olympian.  Latest updates: bit.ly/2j3yanl"},{"comment_id":"10156327692315725","commenter_b":"What are we going to do about that?","commenter_a":"You are right, Mr. Trump. I wish we could impeach Obama","post_message":"We need new leadership- fast!"},{"comment_id":"1269427259813296","commenter_b":"SOME OF YOU IMBECILES SICKEN ME WITH YOUR OPEN MINDEDNESS TO ALLOW MORE REFUGEES AND WHICH ARE TERRORISTS COME INTO THIS COUNTRY!! WAKE UP UNLESS YOU WANT TO BECOME ENSLAVED TO THE RELIGION OF ISLAM AND LOSE ALL YOUR FREEDOM ,BE BEATEN,BE RAPED ,BE BEHEADED..ETC...ETC...THERE'S NO PLACE IN THIS GREAT COUNTRY FOR YOU UNTIL CHRIST'S RETURN,THEN SHALL YOUR FATE BE DELIVERED AND ETERNAL HELL AND DAMNATION WILL BE UPON YOURSELVES,NOT 72,000 VIRGINS AS YOU THINK !! THE ONLY VIRGINS YOU RECEIVE ARE THE INNOCENT LITTLE GIRLS 6,7,8,9,10 YEARS OLD THAT YOU ARE RAPING AND DESERVE DEATH TO YOURSELVES FOR!!","commenter_a":"STFU he said he does not reveal plan! STFU","post_message":"Broken campaign promise!"},{"comment_id":"10153358491932217","commenter_b":"where were these anti-facists when Women were attacked in Cologne","commenter_a":"Natalie","post_message":"Bricks were thrown as far-right & anti-racism protesters clashed in Dover."}]
