[{"comment_id":"10153467458013984","commenter_b":"Sick of hearing about Bruce and the damn Diggers","commenter_a":"enough of this crap...give it a rest","post_message":"If what Rush Limbaugh says is true, this whole Jenner thing could be just the tip of the iceberg. Scary... Do you think the liberal media has an agenda in pushing the Jenner story?"},{"comment_id":"10153679413971051","commenter_b":"I'd inject that bitch with enough meth to make her OD & die. Eye for an eye","commenter_a":"stupid cunt deserves to spend the rest of her life in jail","post_message":"This woman allowed her little boy to overdose on meth. A jury just decided her fate. Decide for yourselves if justice has been served."},{"comment_id":"10156312558675354","commenter_b":"What a self serving heartless bitch.","commenter_a":"She is a good for NOTHING LIER ,GET RID OF HER FOREVER !!!!","post_message":"PARTY TIME!!!"},{"comment_id":"10152823954416130","commenter_b":"Sorry for caring about Charlotte by the way","commenter_a":"If this jerk telling you to get them isn't reason enough NOT to, then I don't know what is...","post_message":"\"The science is, you know, pretty indisputable. We’ve looked at this again and again. There is every reason to get vaccinated, but there aren’t reasons to not.\""},{"comment_id":"668462060011039","commenter_b":"kick the racist out of here!!!","commenter_a":"Send him to Guantannamo","post_message":"A scandalous tape of Al Sharpton has been released... He's not gonna like this. Let's make it go viral. Sharpton is a complete hypocrite. Who's the racist now? Let's kick Sharpton out of America... NOW!"},{"comment_id":"10153105200194497","commenter_b":"I couldn't stand this chick.","commenter_a":"Tom Lombard","post_message":"From our sister publication: \"Next Week On ClickHole\""},{"comment_id":"10153670788291320","commenter_b":"This post just made my morning. You hit the nail on the head !!!!","commenter_a":"That family just needs to rent a van, pile into it, pick up the Kardashians and drive away!","post_message":"Disgraced reality TV star Josh Duggar was reportedly among the 32 million users of the adultery website, AshleyMadison.com. According to Gawker, Duggar, a married father of four, paid nearly $1,000 during his two-year subscription. His name, address and sexual preferences, and that of millions others, were posted online Tuesday night by a group of hackers. More: @webpagelink (AP photo)"}]
