[{"comment_id":"692454430859640","commenter_b":"WE have NOT gotten the message!!!","commenter_a":"we got the message a long time ago...when will corporations take care of their responsabilities","post_message":"Gray Whale Dies Bringing Us A Message The Entire World Should See"},{"comment_id":"10157322113810354","commenter_b":"She is the spitting image of miss piggy. Shut up bitch","commenter_a":"@username keep this irrelevant fat slam pig off my feed, k?","post_message":"Amy Schumer: you know what Americans are \"sickened\" by? We dumb, poor, working class folk are \"sickened\" by rich, elitist, Leftist \"celebrities\" who can afford to live in million dollar homes with high-end security and bodyguards lecturing us for protecting our families and children. Sorry, Amy Schumer, that we can't afford to live in a gated mansion with state of the art alarm systems. But your pal Obama destroyed the American economy. So spare us the lectures!"},{"comment_id":"1552138465081005","commenter_b":"How does she not get dissy","commenter_a":"Matthew Boyd","post_message":"This record-breaking teenage gymnast is showing the world her incredible tumbling talent."},{"comment_id":"10154260147516051","commenter_b":"@username you ignorant bitch !!! If the illegals voted and they can't vote then how did they vote if they are illegals ????dumb ass !!! You racist ass bitch !!!","commenter_a":"The majority of Americans elected Mr Trump. Millions of Clinton votes were cast by illegals who had no right to vote. You people need to respect the process and get over it","post_message":"The majority of Americans dispute Trump's right to rule since he lost the popular vote by almost two million votes. Do you think the candidate who gets the most votes should win?"},{"comment_id":"10153968888907894","commenter_b":"I am with you Tee. These woman don't have any sense, you better get with a man with money. Get your own money as well.","commenter_a":"All these females calling her a gold digger but running around single as fuck with some random broke niggas kids they ain't even with....lmao...ladies it's wise to get with a man that can provide and keep yall asses out the welfare office and from working dead end jobs so you can actually raise your kids. ...but yall been taught it's proper and prideful to struggle with a dude that can't even purchase you a house let alone afford school uniforms for public school 😂😂😂😂","post_message":"60-Year-Old Mel Gibson and His 26-Year-Old Girlfriend Are Expecting"},{"comment_id":"10153920476909614","commenter_b":"Silly girl!","commenter_a":"@username - this is the women I was referring too.","post_message":"It was just two years ago today that iconic singer Natalie Cole performed \"This Will Be (An Everlasting Love)\" during the 125th Rose Parade. Following news of her death, this clip from the KTLA archive seemed like an appropriate tribute to the nine-time Grammy winner. Cole died Thursday evening at L.A.'s Cedars-Sinai Medical Center due to complications from ongoing health issues, according to a family statement provided to the AP. Read KTLA's story here: @webpagelink"},{"comment_id":"485867691579702","commenter_b":"Sad to say but our state has that stupid caucus! Thanks to our friend Reid!","commenter_a":"Amen @username!","post_message":"Greetings from Ben Carson High School."}]
