[{"comment_id":"1313639405344510","commenter_b":"Saudi is the most corrupt and evil country in the world. Where else are women banned from doing anything? Even worse than North Korea. And yet, Hillary took money from them and her supporters love to cry \"sexism!\" One Nation under God \"there is no one like our God\" Jesus, Amen. We don't need any Islamic states in American","commenter_a":"Saudi is the most corrupt and evil country in the world. Where else are women banned from doing anything? Even worse than North Korea. And yet, Hillary took money from them and her supporters love to cry \"sexism!\" One Nation under God \"there is no one like our God\" Jesus, Amen. We don't need any Islamic states in American","post_message":"U.S. president-elect Donald Trump’s recent cabinet appointments had drawn harsh criticism from civil rights campaigners. The cabinet picks have, however, earned praise from white supremacists and neo-Nazis. What do you think about his cabinet? Join us on #presstvdebate at 18:33 GMT"},{"comment_id":"983254505089966","commenter_b":"I can't imagine any other first lady doing that. Both of them are not comporting themselves as befitting their roles","commenter_a":"Michelle is no rocket she looks like Ichabod crane","post_message":"What an embarrassment"},{"comment_id":"711971608993417","commenter_b":"The Liberals and Democrats are complete idiots. They've spent their entire lives destroying society and blaming everyone but themselves for the evilness they've generated.","commenter_a":"He is not a man - is a she","post_message":"Like if you agree."},{"comment_id":"1183538221666206","commenter_b":"Now his mother is going down. Lol","commenter_a":"They have the wrong MAN!! Texas has executed many people because they are known to railroad!! We need to donate to the mans defense.","post_message":"The mother of the suspect in the execution-style killing of Texas sheriff's Deputy Darren H. Goforth said her son can't be the gunman because he was out shopping with her at the time."},{"comment_id":"10154542878929714","commenter_b":"Their professionals,and should set an example.","commenter_a":"Morals clauses","post_message":"This school district wants teachers to stop wearing graphic T-shirts and flip-flops to work."},{"comment_id":"10153956818033967","commenter_b":"I rolled mine back to Windows 8.1, 10 is worse than Vista.","commenter_a":"Step one....reinstall Windows 7","post_message":"Unleash the power of Windows."},{"comment_id":"855360527843909","commenter_b":"Really clueless woman","commenter_a":"Shes not relevant!","post_message":"How's this for abortion logic?"}]
