[{"comment_id":"10153315951826336","commenter_b":"Start the engines and suck her up like a seagull.","commenter_a":"What's wrong this photo? Nothing I can see....","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"1065259396852375","commenter_b":"Oh @username, you're so fucking stupid it's not even funny. I hope you can't reproduce.","commenter_a":"Have you recuperated from all the fun last week ? Glad everyone made it home with no problems. If you're planning to go to the DNC convention; here's the schedule. DNC convention Schedule Saturday, 27 August 2016 11:15 AM Free lunch, medical marijuana, and bus ride to the Convention. Forms distributed for Food Stamp enrollment. 2:30 PM Group Voter Registration for Undocumented Immigrants. 4:00 PM Opening Flag Burning Ceremony Sponsored by CNN 4:15 PM Address on \"Being the Real You\" Rachel Dolezal, former Head of the Seattle NAACP and Caitlyn Jenner 4:30 PM \"How to Bank $200 Million as a Public Servant and Claim to be Broke\" Hillary Clinton 4:45 PM \"How to have a successful career without ever having a job, and still avoid paying taxes!\" A Seminar Moderated by Al Sharpton and Jesse Jackson 5:00 PM Medals of Freedom presentation to Army deserter Bo Berghdal and the Baltimore ...","post_message":"Stand with Democratic leaders: tell the RNC to DISBAND Trey Gowdy's fraudulent Benghazi committee and have Republicans pay back taxpayers! PETITION: @webpagelink (hat tip to Occupy Democrats)"},{"comment_id":"937107439663448","commenter_b":"These ladies look forward to the attention of their dress, slot b of time and money is put into finding the perfect dress ,I don't watch the awards I could care less but I know people who watch it just to see what is being worn them turn s it off","commenter_a":"non-story","post_message":"When it comes to the Academy Awards and other red carpet shows, this is what smart, successful women get asked about instead of, you know, their accomplishments. Sigh."},{"comment_id":"10154367782019071","commenter_b":"@username...you go girl!","commenter_a":"there u go again with ur propaganda...trying to launch a smere campaign on donald trump..main stream media is pathetic..lol","post_message":"Before becoming Donald J. Trump's chief strategist, Bannon wanted to make a movie with Mel Gibson."},{"comment_id":"997479846960469","commenter_b":"Statements of a failed leader","commenter_a":"Not president U S president","post_message":"President Barack Obama said on Friday that the strategy adopted by Russia in Syria is a \"recipe for disaster.\""},{"comment_id":"10153803392470950","commenter_b":"And yet again the liberal media twist his words, he never suggested in any form that anybody attempt to cause bodily harm to the hag. Just that we need to exercise our rights as Americans and keep the hag out of office.","commenter_a":"Why did CBS reporters ADD words to what Donald Trump said at his campaign rally the other day? What he said was \"supporters of the second amendment\" might have a way ....... meaning like the NRA's lobby could have a way to PROTECT AND KEEP THE SECOND AMENDMENT FOR ALL AMERICANS. AT NO TIME DID HE EVER SAY OR IMPLY THAT anyone be assassinated. AT NO TIME!!! When you report things that NEVER HAPPENED BY CHANGING WORDS AND ADDING WORDS, You really make yourselves look pathetic! WE ALL KNOW WHAT DONALD TRUMP SAID and it isn't what your are saying. VERY unprofessional of your news staff to do that kind of stuff! You are as bad as Hillary Clinton saying she didn't say WHAT SHE SAID ON THE VIDEO WHICH PROVES WHAT SHE SAID, when the 4 men's coffins from Benghazi were being taken off the plane. HER OWN WORDS ...","post_message":"These latest numbers come out a day after Donald J. Trump came under fire for suggesting \"Second Amendment people\" could do something about Hillary Clinton."},{"comment_id":"1754772134792927","commenter_b":"@username is voting for hillary just because she is a female","commenter_a":"I can't wait for you to be the next POTUS @username. You've got my vote Madam Secretary. #Imwithher.","post_message":"You saw the Democratic National Convention. Now, watch the never-before-seen footage from backstage:"}]
