[{"comment_id":"10155425708285354","commenter_b":"this.mother.fucker.die.when.does.it.end.helloooooo","commenter_a":"Clearly seeking a larger selection pool for White House jobs.","post_message":"Take a look at the rap sheets of the 22 convicted criminals Obama just pardoned..."},{"comment_id":"543124655889625","commenter_b":"How much more money does she need ??!!!!!!!!??","commenter_a":"Is this really Hillary Clinton? @webpagelink","post_message":"This is truly shocking..."},{"comment_id":"1602419506718167","commenter_b":"Ah yes blame everything on women. Typical","commenter_a":"Maybe because women control everything and dont put out these days unless you're a fucking broke ass bum loser with no future","post_message":"So higher house prices, higher tax, higher tuition AND less sex??"},{"comment_id":"10153661295271955","commenter_b":"You have the hots for Hillary... admit it already :)","commenter_a":"Weak weak weak.","post_message":"BEING BORING: CBS ENDS DEM DEBATE 7 MINS EARLY"},{"comment_id":"10154719986051130","commenter_b":"I'm a middle income American born and raised in America I paid Social Security and income taxes all my life I'm tired of supporting illegal immigrants and people freeloading from the US government on my nickel pretty soon the freeloading is going to stop","commenter_a":"Now I see a lot of ignorant uneducated and sick people talking about things that don't make any sense against the president when Donald Trump gets going you people that are on welfare illegally you people that get free handouts from the government illegally for you people the freeloading stops you're going to have to get a job and actually work for a living.","post_message":"WATCH LIVE: President Trump to speak in Melbourne. @webpagelink"},{"comment_id":"1724919811095083","commenter_b":"^^ for a woman that's a very clever reply","commenter_a":"I think a more interesting question would be, will women cycle differently on other planets? I'm no scientitian, but it seems to me it's a helluva coincidence (that we take for granted) that the female menstrual cycle is in line with the lunar cycle. Our bodies are 2/3rds water and the moon controls the tides. Am I talking out my ass if I suggest maybe the moon can can influence the fluids in our bodies? So on a dfferent planet, with different moons (and presumably after having been there for several generations), would women cycle differently?","post_message":""},{"comment_id":"1035291306577703","commenter_b":"Science does trump random personal stories. (pun intended)","commenter_a":"I live in Savannah Georgia the South Carolina border is 10 mins away from me, 9 out of every 10 people I meet regardless of sex color sexuality or background supports trump, most support him silently they are not going to run around screaming that they support trump they are not participating in polls their voices will be heard at the ballots","post_message":"Hillary Clinton and Donald J. Trump are tied in South Carolina according to new polling. Rachel Maddow breaks down the surprising development.  More analysis on the latest polling from The Rachel Maddow Show: @webpagelink"}]
