[{"comment_id":"10153132244251037","commenter_b":"she lived until she was 86.","commenter_a":"Never smoked a day in my life and never will. I saw my great grandmother suffer for other a year from emphysema that killed her very slowly. She started smoking at age 11 and didn't stop when she was 86 and still had O2 strapped to her face. Her lungs were almost solid black due to all the years of smoking. Its heartbreaking to have to watch your loved one suffocate in their own fluids all because of cigarettes... Seeing that I promised mysf I would never smoke, and I never have. Maybe I will get sick anyway, but at least I know I have the choice whether or not to expose myself to such a horrible toxin ridden thing. I still font understand why people ever pick one up knowing the effects on the body","post_message":"America's biggest #tobacco companies say they are ready and willing to pass along factual public health information about cigarettes."},{"comment_id":"10155472847782178","commenter_b":"This about sums up his platform. To bad his plans don't include everyone. Especially when it comes to healthcare. Did you know that if Obama care is rebuild and replaced if you have a pre-existing condition then you cannot get medical coverage just like before during the Bush administration","commenter_a":"Truth! Dirty Donnie is playing us like a fiddle! All about him so he can make $$$$! He is not FOR anything but himself! Do you really think he is for you blue collar workers or the struggling middle class? Once he gets what he wants, he'll throw you to the gutter like a piece of trash. He is all about the $$ going into his pocket. His \"plan\" would put the workers back into the industrial age. Company town and company store, no unions, no rights, keep your mouth shut and just maybe you won't get fired, thrown out of your home, and dumped on the street! Tax cuts for the rich and everyone else can pay for it. Build a personal defense for to consolidate his power, throw opponents in jail, purge the government of the opposition,and align himself with his buddy Putin! Run away from NATO allies ...","post_message":"Donald Trump's priority today is clear: His personal brand and business."},{"comment_id":"10153805659416167","commenter_b":"For some reason I don't find the position of first lady (as you put it) as important as President. He cheated on his wife, maybe you've never done that, but there's many people ou t there who have cheated on their significant others. Not saying it's right of course, but the other presidential candidate cheated on his wife(s) also and I know the Republican's like to compare other political people when they're accused of something. Look at Trumps wife and her past. Do you really think she should be living in the White House? She's not even from America. Not that I think that's a good enough reason, but I know how you Republicans feel about immigrants. If you look at the naked pictures of her you may also feel she doesn't belong in the White House for that reason. Not that I think that's a good enough reason, but ...","commenter_a":"IMAGINE if you can...a useless, disgusting, nasty, corrupt, rapist, POS perverted woman abuser as our 1st Lady...Billy the perverted Clinton!!!","post_message":"Good grief. Uhh Joe why are you just mentioning this now?"},{"comment_id":"10153362119139087","commenter_b":"IF I WERE A JEW ,,,, i would not want this broad on my side shes a idiot !!!!!","commenter_a":"Oh, please nitwit.","post_message":"“Our country turned [900 Jewish refugees fleeing Germany] away, and many who were sent back to mainland Europe were killed in the Holocaust,” said Democratic National Committee Chairwoman Rep. Debbie Wasserman Schultz. “Instead of learning from that mistake, Republican candidates and politicians were eager to repeat it.”"},{"comment_id":"1537396076280417","commenter_b":"I would just ignore them all. Not worth stressing over. Continue on with remaining diplomatic and professional.","commenter_a":"If you support Yazidi Sex slaves, Vote Hillary. If you support crucifying Christians, Vote Hillary. If you support stealing relief funds from Haitians, Vote Hillary. If you support calling black people super predators, Vote Hillary. If you support foreign nations calling the shots in America, Vote Hillary. If you support free passes to the Rich and powerful and \"justice\" for the rest of us, Vote Hillary. If you love Wall Street, Vote Hillary. If you think arming Islamic Terrorists is a jolly idea, Vote Hillary. If you think going to war in Iraq was grand, Vote Hillary. If you'd love to have Islamic Terrorists \"Refugees\" in your backyard, Vote Hillary. If you support Drug Cartels, Vote Hillary. If you think women should have no rights accept in the US of course, Vote Hillary. If you like High Taxes, Vote Hillary. If you'd rather have the cops outline your dead body ...","post_message":"The document focuses attention on talks about which parts of Clinton's emails should have been be marked classified before release to the public."},{"comment_id":"453510694837224","commenter_b":"I love it! muslims do not belong within our borders!","commenter_a":"Arkansas get on the ball, and do the same.","post_message":"If you don't like our laws and constitution...we can help you pack and leave!!!"},{"comment_id":"10154014383211636","commenter_b":"hmmmmmmmmmmmmmmmmmmm, she needs to be hanged.","commenter_a":"good! even the uk police can be corrupted.","post_message":"She was shot in the stomach, but not by the man she claimed"}]
