[{"comment_id":"10153541693114714","commenter_b":"Why is it YOUR business what she does?","commenter_a":"I don't understand why ppl think that it's okay to die \"their own way\". Any way you slice it, that is suicide.","post_message":"\"When I pass, I do not want her to watch me in pain.\""},{"comment_id":"10153273987738984","commenter_b":"Does this F*CKTARD actually think I'll stop saying Thanksgiving? What a moron! Keep poking the bull bitch!!!","commenter_a":"Obama is a Fucking traitor and Muslim Asshole.","post_message":"Seriously Obama? What are you going to take away next? The NFL? Apple Pie?"},{"comment_id":"967606389917498","commenter_b":"YOU're gross.","commenter_a":"gross. why did you have to post a photo?","post_message":"The most sexist obituary you've ever seen"},{"comment_id":"10156577406325231","commenter_b":"Girl tell it.","commenter_a":"Did anyone question how much the late Nancy Reagan spent during her time in the White House, especially on all that expensive china she had to eat off of and let's not even discuss her designer clothing, shoes, and handbags and the country was in a recession then too. Leave these children alone!","post_message":"How about people stop worrying about the price of the first family's clothing?"},{"comment_id":"10152925844701336","commenter_b":"Yay!!! Nice yes one girl!!","commenter_a":"I've read the back of the book... And I hate to break it to ya, but the Christians win!!","post_message":"ISIS has released a new beheading video which includes a direct threat against President Obama."},{"comment_id":"10153216213261717","commenter_b":"Skars the reason people are so upset is because the bitch is a fucking lesbian for god sakes","commenter_a":"caitlyn jenner may be transgender but she doesnt believe in same sex marriage. she isnt an insparation at all. shes a selfish bitch","post_message":"Caitlyn Jenner prays with fervently antigay preacher"},{"comment_id":"1461062437286833","commenter_b":"Glad he found out before she gave him a STD nasty hoe","commenter_a":"who cares","post_message":"Brutal. (From Elite Daily)"}]
