[{"comment_id":"921197848005881","commenter_b":"Good Luck ! KILLARY sold out America to the highest bidders..several Muslim countries, big businesses, private persons gave millions to the made-up Clinton \"Foundation\". The Clintons PRIVATE SLUSH FUND. Only 10% is donated. KILLARY then sold 20% of America's uranium to Russia. OBUMMER Paid 400 Million to Iran in foreign currency , cash. That's not mentioning all the lies that has been told to the AMERICAN PEOPLE. The Democratic Party is now just socialists, communists. All of you need to see Clinton Cash. Many of top government positions or Muslims. If Hillary is the next POTUS, she'll be sending all of us a prayer rug, burqa's & hijab's for you female family members...now I expect you to call me a racist (against muslims) & bigot as that what you call anyone that disagrees..Pity for us all! 🇺🇸❤️🇺🇸❤️🇺🇸❤️","commenter_a":"With all the facts about this man being super unfit, I don't see how people still stand behind him. I guess they have no concerns for our future and the future of our children. If he gets elected I hope someone assassinate him.","post_message":"LOL! Spot on!  Made by Walt Handelsman, go give him a LIKE! Shared by Occupy Democrats."},{"comment_id":"642161199307792","commenter_b":"If she get to say what she wants ,WHY can't the other people say what they want ,She talks down to ALL the people You could say that bitch pist me off and kelly would so you think all women are bitches no just the ONE THAT PIST ME OFF She just think she is everything do no wrong.","commenter_a":"No","post_message":"Megyn Kelly may be getting kicked off the air...  FOX needs our support, let's give it to them.  Do you support FOX News?"},{"comment_id":"10153906415276545","commenter_b":"@username You are correct, we have plenty of citizens/legal residents committing crimes we don't need those who aren't supposed to be here in the first place compounding the problem. It is time for sanctuary cities to end. Either you are part of the U.S. and adhere to U.S. law which should be enforced or you secede.","commenter_a":"Is this guy a legal citizen?","post_message":"Laura Ostteen took a hit so hard that it hurts to see. All because of a 5 a.m. run for milk to a convenience store as the city of Dallas sees increase in violent attacks."},{"comment_id":"10153486419716680","commenter_b":"Yeah, see you at the polls.","commenter_a":"Only because he has not been Vetted by the Media he's a very flawed man mean and nasty. He's not well like in the Senate he was not an effective Senator! once he is fully Vetted those numbers will go down! for those who are members of his Cult why don't you do more research on him? You all have that Jim Jones Mentality and are drinking his Kool Aid! You may not know who Jim Jones is? because again you know nothing about Politics or Math or Civics! You seem not to have Jobs and Mommy And Daddy never said No to you! The old goat s a lying Fraud and you believe his BS! Those are also his Initials!","post_message":"Bernie Sanders now has 48 percent support nationwide, putting him in a virtual tie with Hillary Clinton, who is at 50 percent."},{"comment_id":"215680145570500","commenter_b":"Who cares what she thinks?","commenter_a":"Stick to pretending to be someone else and saying someone else's words!","post_message":"Not a fan of Meryl Streep's politics? According to her, you may as well be a Nazi."},{"comment_id":"591608484297524","commenter_b":"smh....","commenter_a":"John","post_message":""},{"comment_id":"681728708652647","commenter_b":"why would anyone want a sick old lady in office @webpagelink","commenter_a":"We are stronger together unless you're a minority! Then people like @username and Obama will use your vote every single election while destroying your family and destroying your wealth! If you do get out of the horrible system that they have helped create, they will take credit for it when you have success! She is an embarrassment!","post_message":"We're stronger together—and the diversity of our athletes in Rio proved it."}]
