[{"comment_id":"1073790629380657","commenter_b":"@username. Just fn Stop it with the Fox \"news\" total BS talking points. Insurance is about LIABILITY, not necessarily self protection..and it's Democratic Socialism at it's core such as our tax code: Put $$$ into the pot to benefit/secure your society's quality of living. The phrase \"free market capitalism\" is nothing but corporate fascist propaganda for dumb asses.","commenter_a":"I like to ask people that hate socialism why they buy insurance? You can almost see them stroke out as they start to think really hard about the question.","post_message":"Brilliantly done."},{"comment_id":"10154930680644218","commenter_b":"Why doesn't all the TV news stop digging dirt and let it go. News and social media is half the problem. Start spreading positive news maybe people will do acts of kindness to make the news instead of following the negative.","commenter_a":"Imagine if a white guy said. He would be canned fast.","post_message":"A Baltimore County fire lieutenant is being criticized for remarks posted to social media after the election of Donald Trump. See what was posted >> @webpagelink"},{"comment_id":"452057048331142","commenter_b":"I'm in love I think! She hit the nail on the head.","commenter_a":"You tell'em Grans....","post_message":"Race-Baiting CNN Host Is Shocked At Grandma Answers To His Questions:  is no such thing as  privilege' [VIDEO]"},{"comment_id":"1505305382822543","commenter_b":"Well i guess that's better than a illegal immigrant..","commenter_a":"Don't judge maybe that's his girl","post_message":"At least both the driver and the \"passenger\" were wearing seat belts."},{"comment_id":"102418186941623","commenter_b":"@username 99% of the Republicans that seem to comment in these venues seem to share the same ugly views. Those that aren't like that need to speak up more.","commenter_a":"That's because Republicans are selfish, self-righteous, hypocritical pieces of shit who are blowing loads over their new ability to grab power.","post_message":""},{"comment_id":"902219749819813","commenter_b":"Mad gangs are those who want to draw another map. If a woman doesn't want you will you force matters. Ukrainians and other countries don't want Russian. For then to survive they want a friend indeed to protect them to the aggressor. PUTIN","commenter_a":"NATO is the biggest ever gangster-organ./ bunch of WARCRIMINALs.. existed on earth.. and as such.. the biggest threat to world-peace of our time..","post_message":"A top Russian military commander says Moscow considers NATO missile installations in Eastern Europe “priority targets.”"},{"comment_id":"821114344592574","commenter_b":"She doesn't owe anyone an explanation!","commenter_a":"Mustn't piss off the militant feminists","post_message":"\"Anyone that truly knows me, knows my heart and knows what I meant.”"}]
