[{"comment_id":"10153700532617894","commenter_b":"Make me. Hip hop is my lane. Silly woman.","commenter_a":"What is she doing at a T.I. concert if she don't want too be questioned.","post_message":"Model Shot at T.I. Concert to Sue ‘Heartless’ NYPD for Treating Her Like a ‘Criminal’ During Their Investigation"},{"comment_id":"10153242802786336","commenter_b":"She needs to step down. Bad form lady!","commenter_a":"recue her self all the way back to college, and stay awake the second time around , , and learn the law. don't judge out of hate to please your president and holder ,and al.","post_message":"Defense attorneys representing six Baltimore police officers charged in the death of Freddie Gray filed a motion to have the case dismissed, or for the city’s top prosecutor to be replaced."},{"comment_id":"1003724273013669","commenter_b":"This woman is dumber than a box of rocks!","commenter_a":"freaking nut case!","post_message":"Dems know where to get their votes..."},{"comment_id":"10154314323247174","commenter_b":"Lets don't and say we did.","commenter_a":"I wonder how their wives think about all this press about women in armor , arty, and infantry?","post_message":"Meet the Marine Corps' first-ever female field artillery officers."},{"comment_id":"1007362382702564","commenter_b":"That's uncle Ernie sitting on the eggs","commenter_a":"@username get off of here!","post_message":"ONE EGG IS HATCHING! Eaglet Watch 2016 continues as Harriet and her mate M15 wait for their two eaglets to hatch. One egg began to crack yesterday! Fingers crossed we get an eaglet today!   Once an eagle egg begins to crack, it can take 12 to 48 hours for the eaglet to fully hatch.   Live video: Southwest Florida Eagle Cam MORE: @webpagelink"},{"comment_id":"1407285352638546","commenter_b":"Mama and papas feathers are probably nice and toasty.","commenter_a":"There it is","post_message":"CHIILLLLYYYY! Let's see what our favorite eagles are up to today, hopefully they're staying nice and warm! The little eaglet is getting big(ger)! For more: @webpagelink #HatchWatch2017 (Video courtesy of Dick Pritchett Real Estate)"},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."}]
