[{"comment_id":"1816060081994479","commenter_b":"Worst lady","commenter_a":"Healthy lunch...kids that depend on this for their only meal for the day are going home hungry.","post_message":"Vice President Joe Biden calls Michelle Obama the \"finest first lady in history\"."},{"comment_id":"1024646927570802","commenter_b":"What RUBBISH!","commenter_a":"Reality is that even if you consider it a minor incident, which it appears to be, the trumpster and his campaign manager lied about it, and are still doing so. He doesn't apologize. He doesn't ask for forgiveness. See a pattern?","post_message":"WATCH: Florida police have released surveillance video showing the incident between Donald J. Trump's campaign manager Corey Lewandowski and reporter Michelle Fields. Trump's campaign issued a statement calling Lewandowski “absolutely innocent” after he was charged with misdemeanor battery. @webpagelink"},{"comment_id":"10156467558905725","commenter_b":"I knew it too good to be true!","commenter_a":"Hard to believe this thing he say????","post_message":"If you’ve been on Facebook in the last few days, you might have noticed a number of friends posting a status thanking Zuckerberg for giving away a portion of his $45 billion to lucky Facebook users ----> @webpagelink"},{"comment_id":"906680809367341","commenter_b":"She is trailer park trash.","commenter_a":"Michelle has no class, she doesn't even look like a First Lady. In fact, she's not even First Lady material.","post_message":"This is EPIC"},{"comment_id":"10153945249138690","commenter_b":"The Muslims massacring Christians citizens","commenter_a":"She is a Christian with big heart offering kindness and help to the Muslims so would Muslims do the same things to Christians ?","post_message":"When refugees arrive at the Greece-Macedonia border, the smiling face that greets them is that of Gabriela Andreevska. Watch more Al Jazeera Shorts - @webpagelink"},{"comment_id":"10153100567617464","commenter_b":"get rid of her","commenter_a":"She's bad news , she's dangerous to the good people of America!!","post_message":"Read and SHARE my new op-ed: Republicans must oppose Loretta Lynch — or lose all credibility on lawlessness: @webpagelink #StopLorettaLynch"},{"comment_id":"1785689904981470","commenter_b":"I'm considered a minority, but I will NEVER support a lying pandering corrupt person no matter the gender. Many of us are onto her regardless of her pandering. I hope that bottle of hot sauce that she carries in her bag at all times, helps her because she's going to need it. I'm happy she dodged sniper fire in Bosnia, but at this point, \"What difference does it make?\"","commenter_a":"Women and minorities will elect Hillary. We do not need an inexperienced, ignorant, unpatriotic misogynist as President. He isn't even familiar with the Constitution or how our system of government works and he is a horrible human being who brags about not paying taxes, crushing small business, defaulting on loans and being sexually attracted to his daughter. It is hard to imagine someone less qualified being nominated but then he ran against a group of people without a clue.","post_message":"After their hard-fought primary battle in 2008, President Obama asked Hillary to serve as his secretary of state. Here's what foreign policy experts and world leaders think about her four years as America's chief diplomat:"}]
