[{"comment_id":"1521164361521907","commenter_b":"11, MILLION illegal immigrants, @username. I won't write it out, you might have trouble counting the zeros. That would cost the US 4+ BILLION dollars, but hey- you might not realize how much money that is. Once the current illegals are removed from the work force, it would cost 1.4 TRILLION dollars and the likes of a recession no one in our lifetime has ever seen, but in the meantime, you rock on with your idiot self.","commenter_a":"Good fella for calling his royal Ass out on such ridiculousness.","post_message":"Kudos to the NBC reporter for calling Trump out to his face. Earlier today, Trump said he wouldn't rule out creating a national registry of Muslims, or giving them special IDs. That's NOT the American way. Spread his shame.  Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153823695146336","commenter_b":"FORGIVE HER AS GOD FORGIVES YOU....PUNISH HER IN OTHER WAYS..NO CELL PHONE..NO XBOX. ..NO TV IN HER ROOM..NO COMPUTER IN HER ROOM (ONLY FOR HOMEWORK OVERSEEN BY YOU)","commenter_a":"It's called tough love. That's what children need","post_message":"Would you cancel Christmas to punish your child for stealing?"},{"comment_id":"10153020526397464","commenter_b":"STAND FOR PRINCIPLE or lose America!","commenter_a":"Either the Republican party morphs into liberatrian values or even conservative values, I see no reason to continue to throw away my votes on them. As it stands now, the difference between Republicans and Democrats is hard to see. They are BOTH for bloated Federal Government way beyond it's constiutional limits.","post_message":"We are facing a fundamental decision for our country.   Do we go back to the same old, same old or do we stand for principle? #SCTeaParty15"},{"comment_id":"633195336830149","commenter_b":"Illegal invaders","commenter_a":"Feed them, clothe them. Try to teach them in our schools. Send them back where their parents came from.","post_message":"Where are their parents?"},{"comment_id":"10154228017338797","commenter_b":"Girl I'm glad u werent","commenter_a":"'@username @username this actually happened at my job","post_message":"FLAP OVER FLAPJACKS: A Chicago woman has been arrested after police say an argument over all-you-can-eat pancakes got out of hand at Denny's."},{"comment_id":"908658009268823","commenter_b":"'@username still smarter than that orangutan! That orange menace!","commenter_a":"Hillary Clinton is a walking oxymoron... Innocent yet Guilty!","post_message":"Hillary Clinton rips into Donald J. Trump for his critique of retired four-star Gen. John Allen, saying it's unpresidential to 'insult and deride our generals.' @webpagelink"},{"comment_id":"10154140324537690","commenter_b":"Economically saying no to this is an economic disaster.","commenter_a":"I do live in Arlington. I like the ballpark we got! And really, do you believe in no new taxes?","post_message":"The debut this week of Arlington's plans for a massive entertainment complex to be built around a proposed new baseball stadium is not sitting sitting well with everyone."}]
