[{"comment_id":"1373359909354017","commenter_b":"give it time you will see, the failure of these type of woman always is letting their emotions get in between business, you will see","commenter_a":"I think Kellyanne is hot for Trump and he isn't paying attention, or maybe just keeping her hanging see how for he can get her low, how low will she go","post_message":"The people in charge of defining the English language want to remind Kellyanne Conway what the word means."},{"comment_id":"1745816418974356","commenter_b":"This woman's head is bad.","commenter_a":"That's the problem, she just let 4 Americans die, you idiot.","post_message":"Whoopi Goldberg: Gee, so sorry that you find the deaths of innocent Americans \"boring.\" But for the rest of America, we find the Benghazi massacre reprehensible and unforgivable. And on behalf of the families who can never see or hug their loved ones ever again, We the People demand transparency, honesty, and justice. So get over yourself and your need for constant amusement, Whoopi. Hillary lied, Americans died. Signed, We the People"},{"comment_id":"1553570801369710","commenter_b":"The head of black panthers got robbed at gun point called police. They got his stuff back and arrested the criminal. Ben and jerry time to get your heads out of your ass. I won't buy any thing from you hope all true Americans stop buying your products let the boycott begin hope you lose millions in sales","commenter_a":"All lives matter.","post_message":"Why? Just...why"},{"comment_id":"368323690022592","commenter_b":"Who is this woman","commenter_a":"She is political posturing... Wants to be first Female President. (Well first elected. Hillery was first. Michelle ib second Unelected)","post_message":"Good God, Mr. President, we were once known as the leader of the free world, standing for what is right! You must not let America’s sacrifices be in vain. When will you learn that actions speak louder than your words?”"},{"comment_id":"10155736096870231","commenter_b":"Its not about the braids.....its about the #whitegirlsdoItBetter","commenter_a":"What is it called, then, when black women get relaxers to wear their hair straight?","post_message":"The young actress is making sure her comments about appropriation are taken seriously."},{"comment_id":"10153111641514138","commenter_b":"Bitchassniggas","commenter_a":"I'm glad they stopped him because he would go there get training and come back!! We already have had too many of them do that there's a lot that get caught that we don't know about.","post_message":"Arrested at Minneapolis-St. Paul International Airport with a one-way ticket to Somalia + a fake passport"},{"comment_id":"954260038007303","commenter_b":"Shut up pain your wife's ugly","commenter_a":"@username 1254149964595086mond DeBusschere @username @username reminds me of the good ol days at the barracks","post_message":"Friends like this #WSHH"}]
