[{"comment_id":"10158188671665231","commenter_b":"Not to change the subject but is the android in the picture holding a giant marshmallow or giant roll of toilet paper?!?!?! Just asking","commenter_a":"Rich Jones","post_message":"Google wants you to know that #BlackLivesMatter."},{"comment_id":"10153045402661336","commenter_b":"Shut up idiot!!!!","commenter_a":"Early Bird gets the cage","post_message":"A Georgia sanitation worker has been sentenced to 30 days in jail for picking up trash too early in the morning."},{"comment_id":"10152989254431438","commenter_b":"Where are women who are frightened of a man in the women's room supposed to pee?","commenter_a":"How exactly do you prove you're a trans person?","post_message":"It's one of the most viciously sadistic, hypocritical bills the Florida legislature has ever considered."},{"comment_id":"10153042151741680","commenter_b":"Aww, she don't like jail, maybe , I love being able to use this line right now, maybe if she wouldn't break the law, she wouldn't be in jail. Isn't that the line republicans always use.","commenter_a":"Davis is being duped by her attorney. As long as she refuses neither to resign her office nor to do her job, her attorney is the only person who's winning. She is a pawn.","post_message":"The controversy swirling around Kentucky county clerk Kim Davis is not letting up."},{"comment_id":"919415154748007","commenter_b":"Really u sound SPECIAL!!! thanks for making the black race look retarded all by urself!!! Ur what the white man lives to have on his side.. Wake up my sister. Don't matter what shade we are we are all black","commenter_a":"stop f****** with them mixies and get a. SISTER","post_message":"\"Dark Skin Activist\" Slams Kendrick Lamar Over Light-Skinned Fianceé: “I Will Never Support Him”"},{"comment_id":"10153664512035530","commenter_b":"Ya Chaldean girls are cute ;) lol","commenter_a":"Honestly it's about half right. But if you want to talk about the Metro Detroit area as a whole there are some really beautiful women in the area. I was at Exodos rooftop (in Greektown) in the Summer a couple years back talking to a girl that was there from Philly and she said how good looking everyone was. The Albanian and Chaldean women in Metro Detroit are GORGEOUS. The city itself might not be the prettiest but there are some beautiful foreign women in the area. But I know the article wasn't just focused on the people.","post_message":"Detroit takes it on the chin in this survey based on nightlife, setting, hot locals and \"an undercurrent of desire.\""},{"comment_id":"987087694644317","commenter_b":"Babies gotta eat . If you don't like it don't look . If you want to fight something, fight the laws that deal with drunk drivers . Come on America WAKE UP !","commenter_a":"Well said @username","post_message":"Dozens of mothers staged a \"nurse in\" in front of the state Capitol building today in nationwide movement. What do you think? A. I'm glad these moms are standing up for their rights B. Attention to \"discrimination against breastfeeding\" is needed C. This wasn't needed D. That's fine, we just don't need to see it E. Your own answer"}]
