[{"comment_id":"517177675137728","commenter_b":"here we go lone rider, is he picking up speed","commenter_a":"Looks like he is near Morongo Casino soon.","post_message":"Police pursued a stolen big rig near Riverside, California this afternoon."},{"comment_id":"1038357019610877","commenter_b":"If BERNIE goes Independent, or goes Green, then Good, Hillary is a bitch, a liar, a thief. BERNIE should do anything and everything he can to defeat the nasty bitch. #NeverHillary #BernieSanders2016","commenter_a":"We may still be able to achieve some things of value at the convention. Bernie's current top priority at the convention (as stated in a conference call with his delegates) is to change the Democratic party rules to \"un-rig\" future Democratic primaries so they will be fair to future Democratic party presidential candidates. For him (and our delegates) to have any chance of making future Democratic primaries more fair via votes in the rules committee at the convention, we need to get all our pledged Bernie delegates funded. We are still at risk of losing over 100 pledged Bernie delegate votes, purely due to lack of funds. That's down from over 200 a couple of weeks ago because we have never stopped trying to get them funded. For everyone who is #StillSanders, can you please consider donating $2.70, $5 or $10 (if you can spare a few dollars) to help ...","post_message":"We are building a movement because this country belongs to all of us - not just a handful of billionaires and wealthy campaign contributors. And I'm asking people across the nation to come together and organize an unprecedented grassroots movement."},{"comment_id":"827024174060503","commenter_b":"@username you move and take that communist Kenyan creep with you","commenter_a":"You libs are pure , unaldulterated \"mush\"! Your president is taking us down the road to nowhere and you are worried about the police killing a wonderful young \"punk\" who stole and bullied and tried to kill an officer? Get off welfare and get a job!","post_message":"\"The power to kill is the most awesome power that any government worker could possibly have. We have given that power to police, and then we have refused to monitor it.\" - Lawrence O'Donnell"},{"comment_id":"10154363624237501","commenter_b":"This is getting Old. What will she want next a Movie? This lady is a $$$$ hungry Biotch","commenter_a":"Why oh why do you continue to post this?","post_message":"As testimony comes in and new evidence is provided, has your opinion about the shooting changed over time?"},{"comment_id":"987364064653456","commenter_b":"What about the case of the stay at home mom, divorces, etc. where does she fall in your explanation Michael?","commenter_a":"Keep it in your pants or out of your pants until AFTER you finish school. I don't have to pay for your daycare.","post_message":"Juggling the demands of an education with parenting is a reality for over 25% of American college students—and it’s time that we create affordable childcare options for those seeking a degree."},{"comment_id":"759027444232402","commenter_b":"Sounds like a hate crime to me. Where is Loretta Lynch","commenter_a":"Judson no one cares what you would do, you sound like a child","post_message":"Judson Phillips, founder of Tea Party Nation and a Ted Cruz supporter, said that he would have punched Donald J. Trump instead of endorsing him if he was in Dr. Ben Carson’s shoes."},{"comment_id":"10157164250770206","commenter_b":"yeah allowing syrian refugees into your country , with no skills or money , will really bring about progress and sustained growth.","commenter_a":"nope not gripped by it.","post_message":"The Turkish Coast Guard has released a gripping video of a Syrian refugee being rescued after his boat sank – killing 27 people, including at least 11 children. @webpagelink"}]
