[{"comment_id":"10154024287346680","commenter_b":"Thank God we elected a Nazi instead, right?","commenter_a":"Can Obama just pardon her if she promises to stay out of the public for the next 3 decades? It's time to move on.","post_message":"State officials said earlier this year they searched for visitor logs for Hillary Clinton's office and could not find any."},{"comment_id":"10154091446565736","commenter_b":"Get her butt out of there .... YOUR FIRED","commenter_a":"I'm SHOCKED that an Obama-appointed Democrat is trying to undermine the new president. Did you really expect anything less? The Democrats aren't about to let President Trump do his job without throwing up every possible roadblock. They're just sore losers.","post_message":"\"I am responsible for ensuring that the positions we take in court remain consistent with this institution solemn obligation to always seek justice and stand for what is right,\" she said."},{"comment_id":"10152984633716770","commenter_b":"ENJOY ALL YOUR WELFARE BENEFITS BECAUSE THEY WON'T BE THERE FOREVER! WAKE-UP AMERICA! WE BETTER GET OUR VOTES RIGHT THIS TIME OR WE COULD SEE ISIS TERRORISTS UNLOADING IN OUR DRIVEWAYS! LET'S ALL HELP TRUMP MAKE AMERICA GREAT AGAIN! TRUMP ALL THE WAY!","commenter_a":"Can Trump ever stop with all the \"self praise\" while belittling and insulting everyone else......well except for those Democrats who are running? Since he was a liberal long before his sudden transformation to the GOP, I gotta wonder what side he's really on. Don't trust him one bit.","post_message":"Donald J. Trump believes the moment an Iraqi reporter thew a shoe at George W. Bush and Bush didn't blink \"may have been his best moment if you want to know the truth, that is very sad to say.\""},{"comment_id":"657334997759787","commenter_b":"The key is this. Why was he walking away from the officer with his hands up? Then going for the door of his vehicle. Also they dispatched a helicopter to the scene well prior to the shooting. There is way more than the media is showing.","commenter_a":"Cop should get the chair for this shit","post_message":"In a video, an unarmed man is seen walking with his hands up. Moments later, a police officer shoots him."},{"comment_id":"10154097450244641","commenter_b":"She legally can't give consent if she was drunk so it would still be considered rape......","commenter_a":"\"The alleged perpetrator initially told police that the sex act was consensual, but the girl told them that she had no memory of it\". She is suing although she doesn't know if she consented. I wouldn't be surprised if she had consented when she was drunk. This isn't your average \"She was raped. Case closed\" case. She shouldn't drink like an animal and have sex like one and then sue someone...If you can't handle yourself when you drink, you shouldn't drink! At 16 it is illegal to drink alcohol, so she should be charged as well for her own offense.","post_message":"The court dismissed the charge because unconsciousness and intoxication are not mentioned in the state's forcible sodomy law."},{"comment_id":"10154601814298812","commenter_b":"Beaver girl you are the lowest BS, send you to middle east good luck, Israel girls know how to fight, and the Frenchie girls know how to fight, you know like the French under ground","commenter_a":"Maybe they could present plans to \"Make America Great/Safe/White/America again\" Instead of hosting the \"We hate Hillary\" show. They really do just pander do the lowest common denominator.","post_message":"So far, speakers have mentioned Hillary Clinton an average of just over six times in evening speeches at the GOP Convention."},{"comment_id":"10153468910666037","commenter_b":"Kids from low income communities and families qualify for free college education through goverment grants and programs... some choose to use those programs to better themselves and their famalies... others would rather point fingers and blame others... the only person to point the finger at in a capitalist society is the dude in the mirror because you can truly be anything you wanna be if you want it bad enough...","commenter_a":"This is awesome... more boots on the ground hopefully with the full support of the community and politicians to clean the crime up on the streets of this country... Every single city should follow in their footsteps!!","post_message":"The country's largest police force says it will also hire 400 administrative aides to take over desk jobs, which will free up more officers to walk the streets for community policing."}]
