[{"comment_id":"10154139350608132","commenter_b":"She needs her original face back. She looks just like thousands of other women who have paid to look like Jack Nicholson's version of The Joker.","commenter_a":"For the love of God, someone give her a sandwich...stat!","post_message":"Patrick Dempsey's plans for divorce are now off the table."},{"comment_id":"10158575805875354","commenter_b":"We also need to find and prosecute people with fake social security numbers. Illegals have admitted to buying them.","commenter_a":"Then pass voter ID laws in every state. I understand not wanting to spend money but I am tired of this arguement every election. I want to have peace of mind knowing that it is only We the people voting.","post_message":"Senate Majority Leader Mitch McConnell (R-KY) said he would not spend federal funds investigating voter fraud in the 2016 election..."},{"comment_id":"10153124983097061","commenter_b":"fire her","commenter_a":"If she can't full fill her position she should step down.","post_message":"Kim Davis name removed from marriage license for same-sex couple: abcn.ws/1NrN92G"},{"comment_id":"1017722631617599","commenter_b":"@username, you and your daughters are throwing your votes in the TRASH then.......smh @username 2016","commenter_a":"I hope Bill & herself have plenty of room for the Syrian refugees, since She is so kind to the terrorist islamics. #Stupid to BRING THE ENEMY HOME!!! Utterly wrong. SHE HAS #LOST my Vote... and my two daughters Votes. #MARCORUBIO will be my choice now.","post_message":"We cannot allow terrorists to intimidate us into abandoning our values. Turning away orphans, applying a religious test, discriminating against Muslims, slamming the door on every Syrian refugee—that is just not who we are. We are better than that."},{"comment_id":"1200378003330990","commenter_b":"@username then why girl dont get a comfortable bra? DICKHEAD?","commenter_a":"well what if show my boner because wearing underwear is a bit uncomfortable","post_message":"These high school students brilliantly stood up against sexist dress codes."},{"comment_id":"10154034476612144","commenter_b":"@username you are a freaking trumpette woman which is disgusting. Go away","commenter_a":"Journalist should ask Trump for all his business and private emails when he demands Hillary's. Then point out she has released decades of tax returns and when is he going to pony up like a real candidate. The public has no more right to Hillary's private emails than they do to Trump's.","post_message":"No one is talking about this, but Donald Trump just screwed up and admitted the truth about his taxes."},{"comment_id":"465274473632508","commenter_b":"Goddamn witches..","commenter_a":"Animals.","post_message":"This is the first time they have beheaded civilian females."}]
