[{"comment_id":"10155983890750354","commenter_b":"Yea I enslaved your lazy asses. That's the only way to get you to earn your keep.","commenter_a":"Agreed. Kill us all and then who will pay for your entitlements.","post_message":"“You mother-f**ckers...came and stole us from Africa and put us in chains and murdered us for over 400 years, so yeah, you do need to die.\""},{"comment_id":"10153604514287293","commenter_b":"@username Deport the illegal immigrants in Palestine, back to Minsk, Krakov, Vilnius and Brooklyn, where they were BORN.","commenter_a":"Stop all to the Israeli Colony.","post_message":"“Even the United States doesn’t have anything as complex, as sophisticated.”"},{"comment_id":"10153138055390329","commenter_b":"You're an idiot, Michelle.","commenter_a":"Fuck you buzzfeed. Articles like this are the reason half the country has measles. So irresponsible for you to publish something like this","post_message":"Why would you ever want to get vaccinated? (WARNING: Contains images that some may find disturbing.)"},{"comment_id":"10153876150456680","commenter_b":"Libs can't ubderstand acting in legal ways. No wonder they so adore ILLEGAL aliens.","commenter_a":"About the taxes. Trump did nothing outside the law. So he really is a genius. He employed tens of thousands of people and according the the law, he paid the required taxes. Now the democrats are mad that Trump complied with business laws set by Democratic governments and utilized these laws properly? A bunch of hypocrites. #TrumpPence2016","post_message":"“Almost everybody else is getting poorer.  And yet billionaires like Donald Trump are able to manipulate the tax system so that they avoid paying federal income tax,” Bernie Sanders said."},{"comment_id":"10152892388271749","commenter_b":"oh, that makes sense, you live in bankrupt California.","commenter_a":"more uninformed people are stating that whites killed blacks (KKK) and somehow this means whites should have no say in the current crisis. However it is necessary to point out the gross inaccuracy of the white vs black default position that is happening. The KKK was started by none other than the Democratic Party. They even held meetings in THE WHITE HOUSE. It was not a white vs black terror group It was A Republican vs Democratic terror group. All blacks were Republican at that time for reasons that are obvious and for some that are not obvious Democratic party wanted to enslave and/or lynch blacks and go figure, Republicans had a problems with that. However of the estimated 5000 people killed by the KKK, 2000 were WHITE Republicans who, just like the Black Republicans, were fighting for equality and liberty that the dems were opposed to. So get off ...","post_message":""},{"comment_id":"10155154391786729","commenter_b":"She claims not to know how they got there. That means they are there... end of story, now prosecute.... having them on an unsecured piece of equipment is a crime. Period.","commenter_a":"DON'T TRUST HER.","post_message":"Un-frigging-believable"},{"comment_id":"10153440624016680","commenter_b":"@username KILLERY LOVER<< YOUR SICK GO LIVE IN CANADA YOU LIBERAL IDIOT>>","commenter_a":"Donald Trump all the Way to the White House,,Heck with all the Haters and the Crooked Sander Backers,, and the ones that Love Hilary yea way to Support her a Criminal That Killed 4 American Servicemen,, she should be in prison,!!!!!!!!!!!!!!","post_message":"Donald J. Trump: Michelle Fields grabbed me."}]
