[{"comment_id":"1266627376716224","commenter_b":"No one has said no to immigration, just no to ILLEGAL immigration. And NO to ILLEGAL CRIMINAL immigrants! Wish you people would finally get it.","commenter_a":"white old man...","post_message":"As the son of an immigrant father who came to this country with no money and little education, I understand that our greatest strength is our diversity. We are a nation of people who have come here from every corner of the earth. We practice many religions. We are gay and straight. We are black, white, Latino, Asian American and Native American. Mr. Trump. Your job as president is to bring people together, not divide them up. Support comprehensive immigration reform, not mass deportation."},{"comment_id":"1001125933342993","commenter_b":"Poor little Ivanka, I wonder what her price tag was? High class whore!","commenter_a":"Michelle had bare arms and got criticized by Republitards. Meanwhile, Melania posed nude and Republitards were silent. It's that self-serving double standard once again!","post_message":"Would Melania Trump be a good First Lady?"},{"comment_id":"10152930129086051","commenter_b":"kill the bitch","commenter_a":"Set her on fire...","post_message":"First she poured gasoline over her daughter. Then she lit a match. And then she tossed it."},{"comment_id":"10153227651945329","commenter_b":"Ikr how dare she maintain a healthy lifestyle, the bitch.","commenter_a":"She can fuck off","post_message":"More like baby washboard, amiright?"},{"comment_id":"10155445943810725","commenter_b":"Sadly though it still happened :(","commenter_a":"Everyone who leaves their child with anyone should have a nanny cam.","post_message":"Nanny cam video reveals horrific new details on how a babysitter tortured a 3-year-old girl (Warning: Disturbing content)-----> @webpagelink"},{"comment_id":"1080670505276592","commenter_b":"Unbelievable! This is going to backfire on them. ut makes them look pretty disgusting. Did they use children because the parents can't speak English?","commenter_a":"Bet our tax dollars are paying for those braces leeches","post_message":"Foul-mouthed kids yell at Donald Trump in new campaign"},{"comment_id":"1263441190347909","commenter_b":"Exiguimos la Cabeza de Juan Manuel Santos Calderon Presidente Eunuco de Colombia, Denodado Comandante santiago de las Farc, lo mismo que de los Altos mandos de las Fuerzas armadas por traidores y por aceptar el soborno del Gobinero Naco terrorista Criminals de Santos y su Asquerosa Estirpe. Esto es lo que dir un honesto y verdadero Jefe de estado. Los Colombianos pueden tener la tranquilidad que sea cual sea su elecci en el plebiscito, estar seguros porque las fuerzas del Estado no se doblegar y se han fortalecido\" No lo que dijo Santos? Emisario de FARC y Presidente de los narco terroristas genocidas de las Farc. est preparadas para guerra urbana si se cae proceso: La mas asquerosa extorsion y amenaza a los Ciudadanos. Justicia Verdad Patria o Vida.","commenter_a":"Senator, please oppose any and all gun control propsed by the Democrats. They simply want to disarm the American people to suit their own separate agenda.","post_message":"Today, Senator Nelson and I urged the U.S. Small Business Administration (SBA) to provide assistance to the small businesses in the Orlando area that have been closed off to the public in the aftermath of the Orlando attacks. In a letter to SBA Administrator Maria Contreras-Sweet, we requested assistance to the affected businesses, such as disaster relief loans. Read the letter here: @webpagelink"}]
