[{"comment_id":"939719642754180","commenter_b":"Or he could just drop dead and save his family the embarrassment and the courts the cost.","commenter_a":"IF any of this is even true, if you waited this many years, you own it. Grow up.","post_message":"The once beloved comedian will hopefully not get away with his alleged horrific crimes against women."},{"comment_id":"630413113793105","commenter_b":"okay so heres why i still disagree, especially in regards to syrian refugees. the poison example is still not a good one, because no damage that isis can do to the country is comparable to the damage that poison will do to a persons body. it would be tragic to lose people in attacks, but it wouldnt be strictly 'devestating' to the country. the united states stregnth and resolve would be largely unchanged. refuting refugees is stupid, and here is why i think so. for one, the refugee vetting process is the most extensive and thorough process that is in place, if any sort of check is going to detect a potential terrorist, this is the one. refugees take about two years to finish vetting and finally get relocated, and they dont even get to choose where they go! they get sent to a country that is assigned to them. ...","commenter_a":"'@username thoughts","post_message":"Donald J. Trump tweeted about the case, saying Bonifacio Oseguera-Gonzalez 'should have never been here.'"},{"comment_id":"872957136089257","commenter_b":"lol bitch...u aint smart","commenter_a":"Harashi Dang u get this pic? Lol","post_message":"Classic. ~Will  More photos at Afghanistan Combat Footage - Funker530"},{"comment_id":"10152885727286336","commenter_b":"All women are trained assassins HAH","commenter_a":"If it's true, hopefully he isn't that stupid to actually claim that","post_message":"NASCAR driver Kurt Busch claims his ex-girlfriend, who accused him of assault, is a trained assassin."},{"comment_id":"10154234196571509","commenter_b":"Maybe if you realized the obvious. Terrorists would not attempt entry as refugees. They'd arrive as illegals and criminals along with the rest of the parade crossing into the US via our unprotected southern border.","commenter_a":"Try telling this to republicans and they won't listen, only people with commonsense know that it would be difficult for terrorists to enter the U.S. as a refugee. Maybe if fox news told them they would believe it.","post_message":"Here's how the refugee process stacks up to other ways of getting into the U.S."},{"comment_id":"10153127374764753","commenter_b":"Pig drug whore doesnt deserve kids","commenter_a":"And I feel like a bad parent because of my mountain of dirty laundry... some people don't deserve children!","post_message":"Kodi Faircloth, though she may look quit a bit older, is only 38 and already the mom of 12 kids with another on the way. But it’s a safe bet that this Tulsa, Oklahoma, woman won’t be winning any Mom Of The Year awards anytime soon — not after what police report that they found in her home last Thursday."},{"comment_id":"968965946477597","commenter_b":"Because boys can't Nadia.","commenter_a":"BOYS get to MAKE lightning??? All I got to make was BABIES!!","post_message":"Wellllllll, that's disappointing to see. (via The Huffington Post)"}]
