[{"comment_id":"10153641231211337","commenter_b":"More like a Cabbage Patch doll had sex with that weird chick who snorts Ajax in Up in Smoke.","commenter_a":"Amy Schumer looks like Reece Witherspoon had a baby with the Pillsbury Dough Boy","post_message":"PERFECT: Amy Schumer was ready when someone compared her to the American Gothic lady..."},{"comment_id":"614898638719277","commenter_b":"She's to stupid to no anything","commenter_a":"Reason for term limits are these two examples of our Representatives being out of touch with reality.","post_message":"So thoroughly unhinged it is impressive."},{"comment_id":"10153188976024087","commenter_b":"Ethyl Rosenberg did less and thy fried her in the electric chair!","commenter_a":"Go Hillary , ignore the naysayers , they don't even have a real scandal , crime or violation , ignore the fake media , stay focused on the real issues that Americans truly care about","post_message":"Senior aides to Hillary Clinton will meet with Democratic lawmakers at the Democratic National Committee offices on Thursday to discuss messaging and strategy as the presumptive front-runner's numbers continue to fall."},{"comment_id":"10154289456551336","commenter_b":"No it wouldn't be. It's encouraging to see females that still want equality, rather than superiority.","commenter_a":"It's a dress code, then she should be sent home. Would this still be a story if a man was sent home for not wearing a tie?","post_message":"Dress code violation or sexism?"},{"comment_id":"10153605576555796","commenter_b":"Then why is she a waitress.Dumb ass.","commenter_a":"Maybe if he didn't by guns , his idiot wife wouldn't have to waitress. He's such a friggen looser.","post_message":"Gov. Paul LePage said his reaction whenever the debate begins anew is to head to a sporting goods store. “Every time there’s a big gun battle about one of these incidents, I go buy a gun,” LePage said to applause from the audience. “I have a big safe of them. I have five that I bought and I haven’t shot them.”"},{"comment_id":"1340506826002077","commenter_b":"Not me kick the muslims baxk to there own countries","commenter_a":"Why don't you go eat a goat turd sandwich and drop dead","post_message":"This is the congressman that stated the Islamization of America can't be stopped..."},{"comment_id":"766826556749286","commenter_b":"pigs","commenter_a":"Thug scum! Their families should suffer for the suffering they've caused others!","post_message":"So disturbing."}]
