[{"comment_id":"10153036151346545","commenter_b":"That's nothing to brag about. we may be the majority but we also hold the majority of the most least paying jobs because most of our \"people\" are uneducated. Illegals are the worst part of our society. My family came here legally, so should everyone else's.","commenter_a":"we are the majority not the minority #vivalaraza #razaunite","post_message":"If only there was some sort of reality show catchphrase we could use at a moment like this to sum up NBC's break with the \"Apprentice\" star..."},{"comment_id":"10152708719122217","commenter_b":"If she was prettier she wouldn't have been charged.","commenter_a":"Who is the complainant? If it was witnessed in person fine. However if the person offended viewed the image on google, surely they are to blame for publishing the image?!","post_message":"She was charged after flashing a Google Street View car"},{"comment_id":"875716175906497","commenter_b":"No Muslim majority country throws gays off of buildings (unless you want to recognize the legitimacy of the \"Islamic State\"). Genital mutilation has no semblance of a relation to Islam. It's a cultural problem endemic of Northern Africa, not Islam (Christians and Jews from this region have the same problems with this practice).","commenter_a":"Yeah, except this ancient religion doesn't through gays off buildings, mutilate female sexual organs, and and want to kill anyone who doesn't become a Jedi! DUMBASS!!!!","post_message":""},{"comment_id":"1134617029988407","commenter_b":"GET HER OUT","commenter_a":"Firer her now","post_message":"The death stare comes easy for her because she can blink with all those Botox injections she has had. How many of you wish this chick was on her way out? I know I do. @webpagelink"},{"comment_id":"10158081616760603","commenter_b":"@username Lame.","commenter_a":"Well I had sushi last night lol","post_message":"Any fish eaters out there? The most popular fish on your plate could be carrying a tape worm"},{"comment_id":"1136953183031095","commenter_b":"I can guarentee she will have a fitness dvd out soon, watch this space. All these reality stars have horrible pics taken of them on the beach then get fit n do dvdds xx","commenter_a":"A well cut swimsuit would be far more flattering, although not much one can do with cellulite - ugh.","post_message":"The Only Way is Essex star soaking up those wintry rays ☀"},{"comment_id":"981038348622309","commenter_b":"All the prostitutes brainless Repugnicans were born from a cow. Have no brains no soul no dignity full of hate and hipocersy and a aberration against women . Why ? Their mothers are cows.","commenter_a":"Why do Ryan's wife and daughters stay with a man who has nothing but loathing for their gender? Can they not exert any influence over him? If THEY cannot, will he listen to anyone that opposes his point of view? I seriously hope his daughters are never raped, never need the assistance of Panned the Parenthood. He can evoke \"Family Leave\" and I am sure he will still receive full pay - pay that is provided by taxpayers who he wants to deny \"paid family leave\". He will also work against Social Security and Medicare, but when he retires I believe he will gladly accept it. Can his man be any further from someone we want to represent our interests in Congress? He has no interest in representing us. He has NO integrity.","post_message":"Examine his voting record and you’ll find Ryan to be anything but a representative of the American people. Especially when it comes to female Americans."}]
