[{"comment_id":"10153261514799586","commenter_b":"There is no hope for trash like her, none. Evil cannot be cured by any medical means, can not be rehabbed by any therapy or therapists; its bone deep imbedded and what creates their DNA. The ONLY means of eradicating this evil is to permanently remove their existence from inhabiting the earth. Once removed, incinerate the physical carcass so there is absolutely no way of the evil occupying an ounce of space ever again, starting with animal and child predators of all existences such as this female beast.","commenter_a":"Word","post_message":"SHARE if you wonder the same thing. CC: Ricky Gervais #BanHunting"},{"comment_id":"857261721036748","commenter_b":"He is a terrible president regardless of anything else.","commenter_a":"I'm sick of this crap!...He's a great President..Who cares what religion he is?","post_message":"Scott Walker says he doesn't know if President Obama is a Christian."},{"comment_id":"1081267351952171","commenter_b":"@username WHO IS TRUMP RACIST TO....I WANT AN ANSWER....IF YOU ARE GOING TO SAY IT AND BELIEVE IT THEN YOU CAN TELL THE REST OF US","commenter_a":"Why would anyone vote for her after everything she's done has been exposed? She is not for the American people. Benghazi was enough for me to say #nohillary her plans to continue Obamacare, my vote is a NO, setting up a private server in her home where classified information on an unsecured server putting OUR safety at risk (then lying about it) that's a No. Claims she will fight for the children out of one side of her mouth and supporting late term abortion out of the other. #notwithher. The Clinton foundation taking donations from countries that abuse their woman and children, yet she believes in equality for women?? No way , never ever Hillary. Donald J. Trump for POTUS!!!","post_message":"\"She’s going to open the borders, pack the Supreme Court and you are not going to have the same country. Maybe you like that, maybe you don’t. But we’re not going back to the status quo, period. And so Republicans need to understand if Trump loses, it is a new America, OK? A lot is on the line, whether you like him or not. That is real.”"},{"comment_id":"10154742008716130","commenter_b":"And I would brain-smash you if it were legal. So what now, Bitch?","commenter_a":"Looks like someone forgot to tell this douchebag that Democrats don't run s*** anymore.","post_message":"Time's running out..."},{"comment_id":"555507287934896","commenter_b":"I'll flip it back and not shop there until the board fires her","commenter_a":"Time to switch to Costco.","post_message":"What do you think of this?"},{"comment_id":"10152982403506051","commenter_b":"Good grief....is she for real? She willingly showed up at his house to engage in sex with whom she was gullible enough to think was a male model... Really?????????? She DOESN'T have a leg to stand on in court... STUPID does as STUPID is...smh","commenter_a":"She had to be incredibly stupid and he is a douchebag","post_message":"A woman thought she had been chatting online with this man. They met in a dark hotel room and she wore a blindfold while they got intimate. When she took it off, she saw someone she wasn't expecting."},{"comment_id":"964264026942026","commenter_b":"I luv u tooo bitch","commenter_a":"That is fucked Up... But so entertaining...","post_message":"Details → @webpagelink Police The Police (Y)"}]
