[{"comment_id":"10152889447368837","commenter_b":"How about sending your black people to Africa forever ever, so they don't rob, kill , root and continue destroying this country!","commenter_a":"Since the US is working with Cuba, the government needs to eliminate the wet foot dry foot policy. Make sure any Cuban who comes here get citizenship so they can pay taxes versus living here off the grid and sending monies home to screw up the Social Security, retirement and Medicare funded programs built for Americans in this country. Black White Hispanic Asian Haitian alike.","post_message":"Dangerous Voyage."},{"comment_id":"968795919903853","commenter_b":"The woman is so stupid, only reason she is in because of her color.","commenter_a":"Punta","post_message":"VIDEO: Congresswoman Stands Up For Sharia Law And Actually Gets This Disgusting Response.  'LIKE' if you think Rep. Maxine Waters should be kicked out of office for showing such strong support of ShariaLaw."},{"comment_id":"10153936558477144","commenter_b":"Oh for f* sake leave your vagina at the door please and REALLY look at her record.","commenter_a":"Clinton is a rich aristocrat white woman, check your privilege please, the only thing that she has in common with other women is a vagina. She was first lady, rising to power off her husband's victories she was lifted up to senator and paid well to do nothing, she then ran for President and lost to another man who then lifted her up to SoS, when she ran that office to the ground she left only to win by the efforts of the media and DNC who have a vested interest in seeing her high office. In doing so ruined the chances of America to regain control of our democracy.","post_message":"“That is how good you have to be if you’re a woman running for president. And she still might lose! To this, the least qualified candidate ever to lurch into the public spotlight and shit on Gold Star moms, while cradling Putin’s sweaty sack.'- Samantha Bee"},{"comment_id":"1588802614746840","commenter_b":"You said all the things Hillary and Democrats did, what is Trump's contribution to the development of America? And all you said are lies. Get your facts right! Compare the economy of the country before Obama era and Obama's era. You talk about the Islamic terrorist but you failed to make mention of the domestic terrorism in the country.","commenter_a":"In defense of Donald Trump : Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not starting a race war. Trump did not leave any US soldiers in Benghazi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion dollars. ...","post_message":"Father of Muslim U.S. soldier killed in Iraq: 'Donald J. Trump, have you even read the United States Constitution? I will lend you my copy...You have sacrificed nothing, and no one!' @webpagelink"},{"comment_id":"557960721079763","commenter_b":"Put it in her butt and see if she still complains about size","commenter_a":"😂😂😂😂","post_message":"Size clearly matters to this girl! #WSHH"},{"comment_id":"1749063398683963","commenter_b":"Shut up- you're just another puppet of clinton. There is no way in hell that trump is more dangerous than that witch Clinton. How much were you paid?! Were you threatened. Clinton must be stopped. Clinton is the threat! She is in with muslim radicals and is going to move toward removing guns from the citizens and let terrorism continue! Give trump 4 years- he will do better than Clinton!","commenter_a":"I wouldn't trust the CIA or the FBI if my life depended on it.","post_message":"'Donald J. Trump is not only unqualified for the job, but he may well pose a threat to our national security,' he said."},{"comment_id":"10153424422192377","commenter_b":"cruz wants megyn on his side, strong women has nothing to do with it.","commenter_a":"Give me a break!!","post_message":"'Listen, I know that Donald — it makes him feel really tough; it makes him feel like a very, very big man to threaten people. And in particular, he seems to have a problem with strong women,' Cruz said. 'I don't know why that is, but it seems to really bother him.'"}]
