[{"comment_id":"10154532714726162","commenter_b":"England, and yes it is my city is run by the labour party","commenter_a":"Where's white live matter, oh wait their not black","post_message":"A father and his two sons have been charged with molesting three young girls in their home... @webpagelink"},{"comment_id":"10153186932521167","commenter_b":"Women who watch faux news confuse me","commenter_a":"Brittany Shelton OMG!","post_message":"We were going to do a \"Top 10 Awful Displays of Sexism on Fox News\" video, but the clips just kept rolling in. Here are 70:"},{"comment_id":"618627604994485","commenter_b":"Right on Nicholesa and Aaron. From the word go, you could see that she was a south side of Chicago ghetto girl and she hasn't learned a thing being with the \"swells\". She is an embarrassment.","commenter_a":"Poor little rich bitch wants out sympathy. She should give us hers for all of our money that she's waster. What an ugly greedy ungrateful woman she is. We have never ever had a first lady worse in OUR white house. She is a despicable human being.","post_message":"Michelle Obama wants America's sympathy for all that she has to put up with. Nobody cares. What a joke. Do you agree Michelle Obama should keep her mouth shut?"},{"comment_id":"1451058244908937","commenter_b":"Deport illegals!!","commenter_a":"Florida for Trump!","post_message":"LIVE Trump! DRAIN THE SWAMP FOLLOW US for Conservative news!---> Freedom Daily Donald J. Trump Donald Trump For President #maga"},{"comment_id":"10153325338244342","commenter_b":"Stfu Lilia Jimrnez....you dumb woman","commenter_a":"So are we going to start killing police, getting revenge and causing a war in our country? Or are we actually going to try and solve these problems between police and the people they are supposed to be trusted to protect.","post_message":"Hundreds of people are expected to attend a prayer walk slated for Sunday night in northwest Harris County to remember Harris County Deputy Darren Goforth. #abc13"},{"comment_id":"10154056899827541","commenter_b":"Did you know that one the kkk used to lynch Italians as well?","commenter_a":"All you morons. This is an italian thing. And they are white. Get over it already. Its 2017 almost","post_message":"A high-ranking mob enforcer from Queens told a gambler who owed his boss money he was saved by the color of his skin."},{"comment_id":"10153121038682212","commenter_b":"Ugh. You're a woman. Why are you being so dense?","commenter_a":"Isn't there a disclaimer that states not all birth control is always 100% effective??","post_message":"More than 100 women are suing a drug company for a birth control packaging error they say resulted in unplanned pregnancies; three of whom are from Oklahoma. #News9 #CBSNews"}]
