[{"comment_id":"10155094195189766","commenter_b":"F Germany! Let the Jihadis have that country! They deserve what they get!","commenter_a":"How pathetic.","post_message":"Here's a German parade with a float of President Trump raping a national icon then getting his head cut off by the same. Thanks, guys.  Credit: Instagram/aladine_saidi via Storyful"},{"comment_id":"579741315536254","commenter_b":"How is she a bigot? Because you disagree with her. She is speaking the truth. I don't like her method. She be out in front of the building doing this, not in the store.","commenter_a":"Biggest bigot I've seen so far. Who died and made her thee Almighty?","post_message":"The woman, a mother of 12, screams throughout the video and says that she wouldn't spend a penny at Target because of what she calls their \"wicked practice.\""},{"comment_id":"544054039123949","commenter_b":"Drain the SWAMP","commenter_a":"President TRUMP 🇺🇸","post_message":"REPLAY: Republican presidential nominee Donald Trump at a rally in Tampa, Florida."},{"comment_id":"10153430639944255","commenter_b":"This woman wants us to return to the 1950s? I guess that means she's going to shut up and make me a sandwich.","commenter_a":"Around 70% of White America does not live in a diverse city as is, and this is the reason for so much suspicion about people of other races, and culture. I am not for this kind of self segregation, but at the same time I do not believe we should be about forcing people to live where they do not now live. Until we learn that people are people this will never change.","post_message":"Yes, this is a real post from a real elementary school teacher in Texas."},{"comment_id":"694571907348646","commenter_b":"Lmao!!! @username","commenter_a":"Josh Wilson Connor Bobthebuilder Bithell","post_message":"Chocolate lovers can't seem to get enough of this nose candy. #MicBrights"},{"comment_id":"1227346897337998","commenter_b":"Idiot sick woman","commenter_a":"Good thing we have wikileaks and Project Veritas for the truth. Trump/Pence 2016 #draintheswamp #hillaryforprison #spiritcooking","post_message":"JAY Z said he doesn't have any \"ill will\" toward Donald J. Trump, but he \"cannot be our president.\" Before introducing Hillary Clinton onstage with Beyoncé at the Cleveland, Ohio, rally, Jay Z repeated this twice: \"Once you divide us, you weaken us. We're stronger together\" @webpagelink"},{"comment_id":"10152703657281051","commenter_b":"This woman is clearly abusing the system!","commenter_a":"Christine I enjoyed reading your comment I too came from a family of 11 I'm number 10 my daddy was the sole provider he injured himself and was off of work for a couple of months my mom said they had to get assistance which was very hard for my father when he returned to work he paid every cent back its funny how people can respond so quickly maybe we should just pray","post_message":"This mother of 11 lives almost entirely off government benefits. Last week, she announced some big news."}]
