[{"comment_id":"10156140498930206","commenter_b":"She will definitely turn heads if she gets into the debates.","commenter_a":"@username has the knowledge, skills, and class of Reagan. She's disarming when she speaks, and able to get persuasive messages about individual liberty across to people who instinctively resist it. If she's nominated by the GOP, I think she has the best chance to win. If she's elected, she could invigorate the conservative/ libertarian movement and put our nation back on course.","post_message":"Today in Barrington, New Hampshire I toured Turbocam International and heard from voters ready for citizen leadership in Washington at a packed townhall. Join our team today. @webpagelink"},{"comment_id":"10155553244070354","commenter_b":"Sit your dumb racist ass down and shutup AL shapton and pay the taxes you owe","commenter_a":"Wake up people! States better start secession proceedings. The 10th Amendment: \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\"","post_message":"First he fought the right, then he fought the cops, now Al Sharpton announces his plan to fight his toughest opponent yet: ....The U.S. Constitution."},{"comment_id":"10152867504581336","commenter_b":"What a ugly woman she is","commenter_a":"This is what Islam is all about........ @webpagelink","post_message":"Ayaan Hirsi Ali has something in common with the #CharlieHebdo editor murdered by terrorists in Paris: She is also on al Qaeda’s death list. She spoke to Megyn Kelly tonight on 'The Kelly File.'"},{"comment_id":"10154167582371770","commenter_b":"LMAO they are their own worst enemy","commenter_a":"Sweet, we probably bought it as taxpayers.","post_message":"Liberals protest Trump by ... setting a Muslim immigrant's limo on fire."},{"comment_id":"10152882564604024","commenter_b":"This chick def. has mental issues like Julie stated. You need to know when to just not add fuel to her fire. Who knows what she would've done if this argument escalated.","commenter_a":"I've been taking NYC subway all my life and this is rare and far between. The vast majority of people are actually pretty nice. I hate watching these things because it makes us look really bad to outsiders. There are over 8 million people in this city, of course you're going to get a few bad ones, it's just the odds. Please don't judge us all based on a few..","post_message":"If you witness this fight, would you try to settle it? How?"},{"comment_id":"10153049947289170","commenter_b":"From the info I have seen, they have entire areas that could just be surrounded and taken out......all those \"unsafe for non-muslims to enter\" areas......","commenter_a":"At least someone in power will acknowledge these Muslim terrorists need to be taken out! The problem is they have almost completely taken over France at this point. Apparently France has over 750 No-Go zones in which only Muslims are allowed to live and travel in these territories. Sadly the govern has let them take over like this.","post_message":"I guess this was some reality check."},{"comment_id":"1415440468755532","commenter_b":"Embarrassing shows some English women are ,more than stupid!!! What a PRATshe is , excuse the pun!!!","commenter_a":"These stories are not the norm. As a Brit I have been shocked & saddened at the attitude of the Brits post Brexit. If you are foolish enough to believe that the newspapers print stories that represent the situation of most refugees then you really are foolish. Yes stories like this happen, they always have. But for many this is not their situation.","post_message":"‘He is doing this to take citizenship'"}]
