[{"comment_id":"1038718286244949","commenter_b":"If you vote democrat you do not think much of your country? Do not ever forget BENGHAZI","commenter_a":"They are a bunch of lowlife communist wanting to destroy the country from the Left wing.","post_message":"ClashDaily.com"},{"comment_id":"1056310464431070","commenter_b":"AND THERE WILL BE MORE THANKS TO OBAMA AND CONGRESS","commenter_a":"Just kill him","post_message":"BREAKING: ACTUAL ISIS FIGHTER ARRESTED IN SACRAMENTO: Aws Mohamed Younis Al-Jayab Lied To Immigration Authorities ISIS is in the USA! We need TRUMP 2016 to eradicate them! @webpagelink"},{"comment_id":"1923069711254227","commenter_b":"so far 1.5 million people have liked my last comment PERIOD!!!","commenter_a":"My gawd it's an immigrant disrespecting the flag! Shouldn't O'Reilly and Hannity be all over this? Lqtm","post_message":"Oh, how they would SCREAM! Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152940577256336","commenter_b":"Enough of our young men have died. Keep them home and stop certain trash from coming into the USA. Then we won't have to worry about them.","commenter_a":"I heard today that he doesn't have a college degree. Low hanging fruit for the press to grab onto. Better fix that before he enters the national arena.","post_message":"Wisconsin Gov. Scott Walker, a potential 2016 Republican presidential candidate, said Sunday he is open to sending U.S. troops to the Middle East to defeat ISIS."},{"comment_id":"10154789025934641","commenter_b":"If wonder woman can do it ..so can I","commenter_a":"This is so disappointing. Anyone petitioning for the removal of Wonder Woman as ambassador, clearly doesn't know the history of the character. Peace Justice Equality ...and more. Bottom line: basing her removal mainly on appearance - is sexist. Look at male superhero costumes. They leave little to the imagination also. No one is hollering about that. As a feminist, I understand that the sexual objectification of women is a huge problem in our culture. The answer is not to force women to cover up. The answer is to allow women to express themselves without fear. The answer is to teach our boys how to behave. Read the comics. Read the history of the character. Read scholarly articles on WW as a feminist icon. She has pro-women zingers that make me cheer! Many parts of her \"sexy\" costume are actually powerful symbols. Do some research. I know there are more important ...","post_message":"Wonder Woman has been stripped of her role as UN honorary ambassador less than two months after the appointment was made."},{"comment_id":"10154105407999166","commenter_b":"We are getting sick of black crap. Whites will start an uprising. Just wait","commenter_a":"If it was any other student you would be in an uproar...relax! He was wrong and you know it. We don't need this in schools. If they don't protect the safety of students, can you imagine what they would be up against. You don't wait til something happens then act. Let's think like adults here. This is 2016 not the 50s.","post_message":"JUST IN: Police say they have charged this Clemson student after he admitted to posting comments on a popular social media app, comments like \"let's do the Clemson protesters what Ohio did to the Kent State student protesters 40 years ago.\" He said he did it to \"make people mad\"."},{"comment_id":"10155159081916159","commenter_b":"And those immigrants came into are country legally . These SOB coming in now are not. Your so dumb","commenter_a":"So much hate coming from a country that was built by immigrants. You wouldn't be anything without the contributions of so many people from other nations. SAD!","post_message":"Protestors rally in NYC for Muslim and immigrant rights"}]
