[{"comment_id":"10153636348708132","commenter_b":"Eww she ugly","commenter_a":"I love her comedy routines and I think she is beautiful. I like to hold hips not bones.","post_message":"The endlessly quotable Amy Schumer!"},{"comment_id":"10153453475573128","commenter_b":"To let the criminals' partnered officials pirate settlements to fill RICO crime established deficits AS the CRIMINALS declare exemptions on the fines, PRESERVES THEIR RIGHT TO THE CRIMINALLY GAINED CAPITAL, as the RICO mechanisms are left destroying the citizens WHO ARE NOT MADE RIGHT. They STILL lose the paid into asset/taxes.","commenter_a":"What is more egregious than a racket on our assets and THEN OUR WEALTH/earnings used to STEAL the racketeered assets WHILE the bank uses OUR wealth to outsource, exploit economic refugees, and MARKET RIG for decades? Citizen-taxpayers FORCED TO ASSUME market control(free market) destruction as RISK, as criminals assume racketeered assets, margins, and government. That is TEXTBOOK Weimar-Gangster Statism for which the criminal interests MUST be prosecuted and the assets/capital RETURNED to us as citizens and to our economy.","post_message":"A decade after homeowners used a soaring real-estate market to go on a borrowing binge against their own properties, many are now falling behind on payments."},{"comment_id":"10153419431089024","commenter_b":"Strange? No. Normal. These two are NOT our Allies.","commenter_a":"they're called \"handlers\", making sure their government's contributions are used wisely.","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1685289261757038","commenter_b":"So true. She needs disarm them!!","commenter_a":"not just disarm, but \"quickly\"","post_message":"Hillary said that guns don't keep you safe. If she really believes that she should demand that her heavily armed bodyguards quickly disarm!"},{"comment_id":"10154129472871509","commenter_b":"Shut up Muslim trash","commenter_a":"Middle East bloodshed happened due U.S invasion of Iraq. Sadam was a great leader. U.S is responsible for Shia occupation of Iraq, syria and Yamen.","post_message":"At least 30 killed after airstrikes hit wedding @webpagelink"},{"comment_id":"565035256989762","commenter_b":"What would the us do if mexicans where stealing land putting colonies into their land? Only rockets?!","commenter_a":"Military action would be used against a country which sends rockets, terrorists and death into any western democratic country. Why is it unacceptable when the only democracy in the Middle East does it to protect their own democratic citizens? If the vice news offices where destroyed by a Mexican rocket would their be a US reaction.","post_message":"The armed wing of Hamas has vowed to retaliate for the deaths of the two children."},{"comment_id":"747059155450198","commenter_b":"How would a little girl see a transgender's penis? In the female washroom, everyone uses a stall with a door that locks. The only way a little girl would see one is if a pervert walked in the washroom. A true transgender would not exposed himself unnecessarily.","commenter_a":"I don't think its a good idea. I'm not concerned with transgendered using the women's restrooms,. I'm concerned with a pedophile using the restroom to grab a child. Or a rapist using the opportunity to grab a woman. I don't know that either scenario will ever happen...but it could. When it comes to safety, I think we should make every effort to keep women and kids safe.","post_message":"ClashDaily.com"}]
