[{"comment_id":"908007962567959","commenter_b":"Look at that nasty excuse of a woman.","commenter_a":"That family is severely screwed up. Corrupt financially, politically, and morally! Any wonder why this society is so bad? No. Just pathetic. And they smile in the face of this country with absolutely zero remorse or accountability.","post_message":"GROSS!"},{"comment_id":"1505789769441048","commenter_b":"Boycott NBC","commenter_a":"When has NBC ever put a spot light on Trump in a positive way? Lol.","post_message":"The 2016 election has been quite the seesaw ride."},{"comment_id":"10152958455739071","commenter_b":"If all the Europe will have lider like her then for sure we would have less problems!","commenter_a":"Made in Germany","post_message":"Angela Merkel is a rarity — she's excelled her entire life."},{"comment_id":"10153074240773067","commenter_b":"Lol no, A stockholder though, and everything that i put on here were statements from Ford in response to Donald Trump.. Just summarized","commenter_a":"Trump had nothing to do with this. This was because Ford, and the UAW were able to work an agreement, Ford is committed to keeping and creating jobs in the U.S. They have created 25,000 new jobs in the U.S. In the past four years. Over 80% of their manufacturing is done in the U.S. And 97% of their engineering is in the U.S. As they stated. No i dont like seeing jobs being outsourced, but Trumps statement had no effect on the outcome of this. Im happy for all the people who kept their jobs. Ford is a great company! And will do what they can to keep bringing new jobs to the U.S.","post_message":"This comes after Ford Motor Company came under fire for creating thousands of jobs in Mexico. @webpagelink"},{"comment_id":"10154713474904586","commenter_b":"GO VEGAN LEAVE ANIMALS ONE YOU EVIL PEOPLE","commenter_a":"I hope there is a hell, and the people who inflict this unspeakable cruelty on these poor helpless beings, burn in it for an eternity...lowest form of scumbag life on the planet..","post_message":"This is what \"shackle & hoist\" looks like."},{"comment_id":"10152732363406051","commenter_b":"...women who don't have vaginas? WHAT?!?!?!","commenter_a":"If he has a pussy and she has a pecker you call them 'heshe's! If he has neither a pussy or a pecker and she has neither a pecker or a pussy you call them awfully damn horney! In Another vernacular you might just call them freaks of nature! Them the question is what do you feed them? One thing is for sure! They won't reproduce!' Put them in a side show at the fair. Pay your money, go in, hoot and holler, laugh until you pee your pants. Now got to work Monday morning telling everyone what you did and saw! Then you will find out who the real freak is!","post_message":"This all-women's school will no longer perform the 'Vagina Monologues' because it doesn't want to offend women who don't have a vagina."},{"comment_id":"10153896841896636","commenter_b":"Let's talk about what about ... 1. What about Christian imperials from England who colonized, enslaved, stole and murdered people during their colonialism , don't they have Christian knowledge, 2. What about Christian Europeans colonizing America and stealing their land, murdering millions of natives, 3. What about white Christians enslaving blacks people in America treating them like animals and killing blacks for sport. Can you blame these crimes against humanity on Christian faith , NO you cannot , and you cannot blame Islam for the actions of ignorant people. Don't lower your intelligence to the level of ignorant people of past and today who are enemies of humanity .","commenter_a":"Are you trying to defend Islam by claiming that, ISIS recruits have very poor knowledge of islam ? ok, what about the radical Muslim clerics all over Europe, Asia and USA, don't they too have any knowledge on Islam ?","post_message":"Incredible"}]
