[{"comment_id":"1044742995559452","commenter_b":"Na lock her up n throw away the key, dont need her back in society","commenter_a":"Thanks for posting 3 separate mug shots of a clearly mentally ill person to parade her in front of your audience. Maybe you can sensationalize more Halloween hoarder homes while you're at it. I am glad Nickcole Dykema didn't actually hurt any Deputies (and she most likely could have, ambushing them in her own home like that), and glad the Deputies didn't kill her. This is a lesson for Police dealing w/ the mentally ill everywhere. I do hope this woman gets access to proper mental healthcare, and that through treatment she can find her way back into the world with peace and dignity.","post_message":"Multiple deputies received injuries at the 'house of horrors'   From removing weapons from the 'booby trapped' home"},{"comment_id":"1802927083306226","commenter_b":"Well you got what you wanted...he called Illegal Aliens, 'Guests' Now wallow in it.","commenter_a":"Only people glad he's gone are the criminals and illegals","post_message":"LIVE VIDEO: There's a new sheriff in town as Paul Penzone is sworn-in as Maricopa County's 37th sheriff after defeating Joe Arpaio in November's election. Arpaio served as sheriff for the last 24 years."},{"comment_id":"939799776150807","commenter_b":"Screw her!!!","commenter_a":"They have been alright with it as long as it worked inn their favorr.","post_message":"Democrat Senator Introduces Bill to Abolish Electoral College @webpagelink"},{"comment_id":"494820657375181","commenter_b":"She needs to shut that big mouth","commenter_a":"She need s to keep her friggin mouth shut","post_message":"Michelle Obama's tries to enforce this on her hometown, but they aren't backing down.  If they can stand up to her, so should the rest of the country.  Do agree Michelle needs to be silenced?"},{"comment_id":"10153328775418128","commenter_b":"I thing that puts our 18 trillion in debt in perspective...","commenter_a":"No doubt that population and geographical size - density as a dependent variable of income per-capita help construct the value perspective.","post_message":"The most valuable U.S. states by land value: 1. California 2. Texas 3. New York"},{"comment_id":"10154184245291943","commenter_b":"This evil woman needs to fall, through what ever means necessary.","commenter_a":"Oh quit messing with us. Either do it or s t f u!!!","post_message":"With 75 days before voters pick their new president, email revelations are threatening to overtake Hillary Clinton campaign  with WikiLeaks founder Julian Assange hurling another log on an already raging fire with a vow to release  Clinton documents.  In an exclusive interview Wednesday night with Fox News Megyn Kelly, Assange was asked whether new information culled from Clinton emails would be released before the general election: 'Yes, absolutely.  - via Fox News"},{"comment_id":"748895108560603","commenter_b":"Wonder where she got those mouth sores?","commenter_a":"from people that scream to be treated fairly the gay community and its supporters sure spew a drastic amount of hate.","post_message":"It's good for thee but not for me. -1000pts. @webpagelink"}]
