[{"comment_id":"793004177467954","commenter_b":"cuck","commenter_a":"Go take some selfies Obama you fucking disgrace","post_message":"Obama is a _______________."},{"comment_id":"10153731050907464","commenter_b":"'@username THEY'RE A LOT OF SICK TEABILLIES!!","commenter_a":"You referred to the Colorado Springs shooter who killed 3 people as a 'transgendered leftist activist'. Since when does a 'leftist' spread anti-Obama propaganda and refer to fetal tissue as 'baby body parts' as you and your ilk do? You are a disgrace for spreading even MORE rhetoric and you are unfit to be president.","post_message":"An impression from my favorite movie? As you wish..."},{"comment_id":"10153815303155695","commenter_b":"He is not in position to bless anyone! Really?","commenter_a":"Ughhhhhhhh. This man isn't Jesus. He is just a man. And not a good man. Wake up people and stop worshipping the pope before he drags you all to hell. That's what he is trying to do. Only one way. JESUS CHRIST. NOT THE POPE. NOT MARY. PRAY TO THE ONE WHO DIED FOR YOU!!!!","post_message":"'The Pope’s gesture was beautiful and meant something special to our family,' she said."},{"comment_id":"10153302293701051","commenter_b":"EVERY country is populated at some point in its history by people who migrated to it ... THAT is how all countries began.... good grief. No one is against LEGAL immigration.","commenter_a":"Nearly 100% Americans ARE immigrants. Through their ancestors. :-))","post_message":"Do you agree with the vast majority of Americans on this?"},{"comment_id":"10154118857949087","commenter_b":"Stop it with the memes already! I wish @username would disable them.","commenter_a":"He will be just fine. It's Hillary The Post needs to be concerned about.","post_message":"“It’s beyond debate that Donald Trump is unfit to be president.'"},{"comment_id":"10152824862457212","commenter_b":"Yes of course. The middle aged woman who comes from a upper middle class family. Is going to tell people how to make it. Please go on.....................","commenter_a":"Cue the Conservatives of this state to tell how they worked so hard for their money, and it is everyone elses fault the don't have the means they do. In 1...2...3...","post_message":"Seeking to assess if the Horatio Alger, 'rags to riches' narrative...remains viable, researchers measured the odds of a child born to parents in the bottom 20% of income earners reaching the top 20%. They then contrasted the chances of climbing the ladder in the U.S. to that in other developed countries. #News9 #CBSNews"},{"comment_id":"10153520854786519","commenter_b":"Religious fanatics are scarier than loudmouths like Trump . We don't need evangelical bigoted haters running our country.","commenter_a":"His campaign is using some of the same consultants for foreign policy as Hillary Clinton's campaign- now that is scary","post_message":"Ted Cruz never misses an opportunity to remind us it can always be worse..."}]
