[{"comment_id":"1006601726066242","commenter_b":"It is her own fault due to not following the rules- do not get closer then 25 yards!!!","commenter_a":"Stupid people, I do enjoy them.","post_message":"Pictured: Moment bison selfie went all wrong"},{"comment_id":"486778464846067","commenter_b":"@username Your a FREAKING DUMB EXCUSE FOR A SO CALLED HUMAN BEING!","commenter_a":"What do expect out of a Muslim bitch that won't even place her hand over her heart when National Anthem is sang.","post_message":"Michelle Obama just said something treasonous about the flag. This is ridiculous, that flag is the symbol of the greatest nation on Earth. Do you support the American Flag?"},{"comment_id":"10155165703940603","commenter_b":"Whites can't be thugs Danny","commenter_a":"Thug, Keep posting it even if your White or Black. For some reason White people think all Blacks feel as if every Black is innocent. I'm pretty sure Blacks feel as if all Whites think all Whites are innocent. That's not true and if having to state that we think this guy is thug helps then I'll summit to that. I don't think anyone really believes that condoning violence is OK if the person is the same color. People may be right or wrong but it's not necessary a race thing, I think they truly believe the person is innocent but are poorly informed.","post_message":"Robert Clark is wanted for murder and may be hiding in out Missouri. Clark’s accused of brutally killing a couple in Ohio and is also reportedly connected to a string of violent robberies. Please share and call 911 if you see or know anything."},{"comment_id":"10153162341961051","commenter_b":"That is crap. She should not have been arrested. She could see her children.","commenter_a":"She was making the best out of a tough situation. Geez. A little common sense, please.","post_message":"Simple question: should this mom have been arrested?"},{"comment_id":"10153290189835329","commenter_b":"Ja, desv :'(","commenter_a":"Kathrine Malmqvist passer det?","post_message":"BREAKING: Zayn Malik is officially leaving One Direction."},{"comment_id":"10153189307188352","commenter_b":"I Understand hw U feel. U will ask d Grace frm God 2 give U a woman,I mean a \"Virtous Woman\". God wil give U a Good woman as a Wife. Remember d Bible says, He who finds a Wife,finds a good thing n Obtain Favour frm God. U jst av to b HAppy wit Urslf.","commenter_a":"How is that when everything you are she just crap on me rip my heart out and then go to our church act like I don't even exist understand how you can say you love me 1 minute and then say you don't want to be with me the next and all I hear from people is get over it and just move on wow so easy to say I am not a man that has the gift of words to woo a woman love one forsake all others that is how I was raised","post_message":"Breakups hurt, but losing someone who doesn't respect and appreciate you is actually a gain, not a loss."},{"comment_id":"10153565993448271","commenter_b":"Those people are a bunch of Pathetic Savages and Thugs. Just look at their wild behavior. You would think... that the Police should have arrested scores of them. It must had been too much Rock & Roll or Punk Acid Rock.","commenter_a":"I can understand being excited but destroying public property and acting like a bunch of idiots is ridiculous.","post_message":"This is disappointing. While many people celebrated the Broncos' Super Bowl victory peacefully, some were destructive. Denver Police made 12 arrests and thankfully, no one was seriously hurt. @webpagelink"}]
