[{"comment_id":"10153950458738690","commenter_b":"Actually another problem is that we have a long border with Afghanistan which is called Durand Line and Afghanistan does not accept it as an International Border and those terrorists move in between both countries and attack and then we blame to each others.","commenter_a":"This the same Pakistan my country Nigeria, training army to fight terrorism, have Pakistan already solved there Taliban terrorist? Terrorist are political party, negotiations is the solution to terrorism.","post_message":"At least 12 dead as suicide bomber on a motorbike crashes into government office."},{"comment_id":"1048025435218467","commenter_b":"Lol I really do it's weird, this morning I saw white gold but then it changed and has been black n blue since haha!!!","commenter_a":"I see black and blue","post_message":"And no, it's not magic."},{"comment_id":"10154381959259062","commenter_b":"The woman is rubbing oil on her breasts and her baby and going viral with it. Who is the pervert? It's obvious she is!","commenter_a":"I think woman should also think about how easy it is for these pervs to get these pics for free off of your social media while exercising your right to expose your self feeding your child in public. Or even a perv sneaking a pic of you breastfeeding in public. While your child and your breast may end up on one of the sickening child molester sites.","post_message":"Officers found out about Felten when a Wisconsin man downloaded several videos and paid for them using a PayPal account."},{"comment_id":"1015238835192369","commenter_b":"Not that she's seeming to give a flying bigoted spit spatter regarding the education of people in that group however. Still a power bred over privileged crusty plantation damsel. Like seven generations later. She still wants her back washed by the maid.","commenter_a":"Batshit crazy.","post_message":"Nancy Pelosi identified what she called the 'three G's' – reasons why white males favor Donald J. Trump over Hillary Clinton. @webpagelink"},{"comment_id":"928001893961910","commenter_b":"Thank you Rubio for all your hard work. God bless you and your family.","commenter_a":"NO RUBIO ND NO CRUZ.","post_message":"Marco Rubio is a friend and a colleague who ran an optimistic campaign focused on the future of our party, conservative principles, and uplifting the American people. The Republican primary was stronger because of the ideas he brought forth.   Marco’s story embodies the promise of our great nation. I know he will continue to be a champion for limitless opportunity in America, and I wish Marco, Jeanette, and their four kids the very best."},{"comment_id":"1266389850103907","commenter_b":"'@username, do you kiss you're mail man with that mouth? Ms classy","commenter_a":"Every responsible voter should remember these days of how badly the democrats have acted after the Trump win and NEVER AGAIN vote for or put a democrat into a position of power, as they become once elected monsters absent completely of morals and integrity.","post_message":"Georgia Secretary of State now asking Trump to look into why the Department of Homeland Security has been trying to hack the Georgia voter database"},{"comment_id":"1291576474195436","commenter_b":"Gonna be great for tranny sex!","commenter_a":"Private stall restrooms make it no longer an issue for either side of the issue","post_message":"Target will invest in private stalls in response to protests from customers over its policy allowing transgender customers and employees to use the restroom that aligns with their gender identity.  Do you like Target's move toward inclusivity? Or were you opposed to its policy?"}]
