[{"comment_id":"10154230629253854","commenter_b":"trump will take her down,no one will take orders from a lier.","commenter_a":"Go make cookies Hillary.","post_message":"Hillary Clinton Orders Liberal Media to Get Tough on Trump (VIDEO)"},{"comment_id":"10155152380736337","commenter_b":"\"I'm an idiot who has never read a book or even been in a bookstore but I fo sho is gonna post on Facebook all day and show those educated peoples the what for!\" And she says to get a life?","commenter_a":"I literally just had to google who J.K. Rowling is. This person has ZERO impact on me. I find it hilarious that these \"celebrities\" think that they impact our lives in any way, shape and/or form.","post_message":"BURN: J.K. Rowling's latest tweet-spree took no prisoners..."},{"comment_id":"10158061833465354","commenter_b":"White bitch bahaha!","commenter_a":"Samantha Bee can blow her fuckin brains out for all I care. Lamestream shill. Stop feeding her.","post_message":"Dear Democrats, Please, PLEASE keep up your trashing of the 60,000,000 Deplorables who elected President-Elect Donald Trump. With every smug, arrogant, elitist, hyperbolic swipe you take, you further confirm why We the People rejected you in the first place. So please, keep it up! Sincerely, The Deplorables"},{"comment_id":"10153465142866037","commenter_b":"Regina just stfu. Idc","commenter_a":"who cares. its their country their rules. i dont see why people like to police other countries because they find their practices to be disgusting. no different than people consuming pigs, goats, cows and chicken. don like it? donate other possible food sources then. if not stfu","post_message":"\"There are all sorts of cultural norms about what you can eat; you eat turkey, so why are you trying to force us to not eat dog meat?\""},{"comment_id":"760923940676233","commenter_b":"This lady is an idiot","commenter_a":"Oh well","post_message":"\"White folks gotta give up something\" - Marissa Jenae Johnson, cofounder of Black Lives Matter"},{"comment_id":"980094148726809","commenter_b":"@username Keep your dick in your pants!","commenter_a":"Well done! Any who object to a 'medieval theocracy' should take a good look at Northern Ireland if they want to see one in action. Bloody misogynist dinosaurs.","post_message":"Three women have handed themselves into a police station in Derry, stating they have procured and taken illegal abortion pills and requesting that they be prosecuted, in protest at Northern Ireland’s restrictive abortion laws."},{"comment_id":"10152935286327426","commenter_b":"Medical \"miracle.\" Plus, you're not dead yet, so you're dreaming of what you expect to see. If you were convinced you were going to an eternal punishment, you'd have a very different dream outcome. Also, funny how this doesn't work trans-culturally, don't you think?","commenter_a":"Amen","post_message":"His family is convinced it was a miracle."}]
