[{"comment_id":"1734008936814080","commenter_b":"Kill them all with the wall","commenter_a":"Now time to sue the ones that let this happen","post_message":"Unacceptable..."},{"comment_id":"1170595402996226","commenter_b":"And the world would be a lot better place without your racist, misogynistic ass in it. Twit begone!","commenter_a":"Most admired my ass this stinking bitch allowed 4 people to die she a corrupt lying useless bitch should been in jail or zoo cage right next to the ape in heels","post_message":"Hillary Clinton just won Gallup's \"Most Admired Woman\" poll for the 21st time. Do you admire her?"},{"comment_id":"669424226515949","commenter_b":"lol anybody can change it to anybody wiki is less secure than pussy around trump","commenter_a":"Ben Ellison thought you might like this","post_message":"So, this happened yesterday."},{"comment_id":"835612693201651","commenter_b":"HE IS LOOKING FOR MORE FREE REPUBLICAN MONEY !","commenter_a":"These people have to keep up the lie..because if you do your research. .then you will come to one and only one conclusion. .These people have no claim to the land..they were put there in 1948...but their blood line does not trace back to Abraham a hebrew..don't take my word for it do the research. .information is out there!!!!","post_message":"\"I will go anywhere I am invited to make the State of Israel’s case and defend its future and existence.” -Israeli Prime Minister Benjamin Netanyahu"},{"comment_id":"10153835285409024","commenter_b":"I think legal American cititzens should be allowed to shoot illegals when they enter the US!","commenter_a":"AGREE!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"964070213702162","commenter_b":"She is dumb as a fox! Crooked doesnt require brains! Just dishonesty!","commenter_a":"Ha! Ha! Poor Hilary Rotten Clinton!","post_message":"Does anyone know that Crooked Hillary, who tried so hard, was unable to pass the Bar Exams in Washington D.C. She was forced to go elsewhere!"},{"comment_id":"10152565333134071","commenter_b":"Both of them are idiots !","commenter_a":"Legalize it, is the best way to keep it out of minors and kids.","post_message":"#Pot2Blame?"}]
