[{"comment_id":"10153582261225950","commenter_b":"Making it easier to make the Darwin awards a picture book.","commenter_a":"Surprise surprise...another one bites the dust.","post_message":"There have been at least 49 selfie-linked deaths on record since 2014."},{"comment_id":"1163050380483299","commenter_b":"'@username, I'm quite happy with my wife of 33 years, but thanks for the suggestion.","commenter_a":"Honestly, I don't know anyone who wears Ivanka trump's clothing. This is the risk you run when you become part of the political process.","post_message":"A recent survey found that 57% of women refuse to buy Ivanka Trump branded merchandise following her father's controversial campaign."},{"comment_id":"10153000852919197","commenter_b":"Put the plow down !","commenter_a":"Another fun icy Monday! Wha's up with that?","post_message":"It was definitely a slippery morning on most of the roads in the state. Check out this video from an eyewitness on I-84 in Newtown. Stay updated with the latest weather conditions here-->>@webpagelink"},{"comment_id":"1372232146121032","commenter_b":"Chris Schiraldi really? Please tell me your source besides your opinion because that sure as hell isn't fact!!!!","commenter_a":"Yeah thanks for the lowest workforce participation rate in decades. Thanks for creating so many low wage/ low benefit jobs. Thanks for so many on food stamps because the economy sucks. And thanks yahoo for being yahoo... and that isn't much","post_message":"75 straight months of job gains. 15.8 million private sector jobs added since 2010.   Thanks, Barack Obama."},{"comment_id":"10153212913058145","commenter_b":"The problem is that She's an evil mean peace of crap, that should had never been born","commenter_a":"Everyone loves kittens so what is the problem?","post_message":"A north Florida woman is facing charges after deputies said she was seen throwing kittens out of her car window. @webpagelink #wftv"},{"comment_id":"1800692713478186","commenter_b":"Your first woman president wants to bring ISIS TO AMERICA. IF SHE WINS YOU BETTER START PACKING HEAT AND GET ON YOUR KNEES AND PRAY. YOU WILL NEED IT.","commenter_a":"An America that believes it's ok that Americans have lost jobs? An America that believes healthcare costs for many Americans should increase? I get that the Affordable Healthcare Act has helped millions Americans, but at the expense of millions of other Americans. Also, an America that believes it's ok to accept donations from countries that house terrorists and are suspected of funding them? An America that let's people get away with breaking certain laws? This is the reality of @username America. FYI, not supporting Trump Chris Keniston, Veteran's Party of America supporter.","post_message":"Tomorrow, we have the chance to stand up for the America we believe in. Share this if you're voting. hillaryclinton.com/makeaplan"},{"comment_id":"10153384887696491","commenter_b":"Forget you guys, she doesn't go out with peasants from the first lion order..","commenter_a":"'@username yo daisy might be there when it opens","post_message":"Prepare for a smaller world at Disneyland"}]
