[{"comment_id":"10153353653386051","commenter_b":"Get in his ass!","commenter_a":"No more tacos or carne Asada for this loser.","post_message":"This man killed a police officer – and then laughed about it. Here's what happened to him in Texas yesterday. Do you consider this justice served?"},{"comment_id":"10153510348059411","commenter_b":"serious lips on that lady, shes got Grace Jones beat even.","commenter_a":"She has no ideas worth repeating-FIRE her.","post_message":""},{"comment_id":"908033912663121","commenter_b":"Lowlife muslims","commenter_a":"Chaos? Why? They simply forfeit any match they refuse to participate in.","post_message":"You must be freaking KIDDING ME?!"},{"comment_id":"10156715004010354","commenter_b":"Lord forbid she have a mind of her own.","commenter_a":"How totally racist is that !","post_message":"The NAACP Image Awards is ________________."},{"comment_id":"10152768330837452","commenter_b":"Good, then keep them home.","commenter_a":"I will home school my child before I let the state lawmakers tell me what I should and shouldn't inject them with !!!","post_message":"BREAKING NEWS: Lawmakers have approved a bill that would require California schoolchildren to be vaccinated. @webpagelink The proposal would eliminate the state's personal-belief and religious exemptions, so unvaccinated children would not be able to attend public or private schools."},{"comment_id":"1110154855687296","commenter_b":"Knock that bitch out!","commenter_a":"@username @username let's fuck his shit up","post_message":"Would you do it? #WSHH"},{"comment_id":"10152880805672377","commenter_b":"Worried ???? then I suggest she better get her BUTT in gear and start letting us know what HER AGENDA is !!!!!","commenter_a":"Go Betnie, GO. We need candidates that are not corrupt and money grabbers without all of the baggage the Queen carries. Someone who has the interest if the country in mind not self- aggrandisement.","post_message":"Hillary Clinton's campaign is \"worried about\" the challenge being posed by Sen. Bernie Sanders, whose popularity and poll numbers are continuing to grow."}]
