[{"comment_id":"988561661229838","commenter_b":"F*^king disgusting!!!","commenter_a":"Disgrace as president.","post_message":"President Barack Obama and First Lady Michelle Obama paid less than two minutes of respect to the late Antonin Scalia while the Justice lies in repose at the Supreme Court."},{"comment_id":"10154093507104087","commenter_b":"Kiss my ass illegals","commenter_a":"He'll 80% of all Americans desrespect Obama today,but we know the bias mainstream won't tell the truth,Obama lied to all Americans","post_message":"\"Many birthers believe that Obama is not an American because deep down, they believe that anyone who is not white and a Christian is either not an American, or an American with an asterisk.\""},{"comment_id":"541297862703293","commenter_b":"All wall must be built before the country is lost!","commenter_a":"We lived in Mercedes . Know exactly what you are going thru !!!","post_message":"We need a wall fast to stop ILLEGAL IMMIGRATION and ILLEGAL DRUGS from entering our country. Its just common sense!"},{"comment_id":"1861021464115839","commenter_b":"Fits his class level.","commenter_a":"Ignorant","post_message":"WARNING: Graphic content"},{"comment_id":"1261955857213973","commenter_b":"Sounds good....illegal alien it is.","commenter_a":"It's illegal alien. As in not from this country. An immigrant is one who has applied for entry into this country legally before they left their home port/border.","post_message":"USC Professor Warns Students, Don’t Use Term “Illegal Immigrant” On Final"},{"comment_id":"1242270725821978","commenter_b":"#MyBodyMyChoice . Oh get over it men.. you have no right over women... You would never stop abortions.. we will find our own ways.. neener neener.. grow up and realize you don't matter..","commenter_a":"Oh yes, women just can't make these important decisions without a man's assistance and approval. Jeez, what's next, taking away women's right to vote?","post_message":"“I believe one of the breakdowns in our society is that we have excluded the man out of all of these types of decisions,” said the Oklahoma representative who wrote the bill."},{"comment_id":"10153571319289342","commenter_b":"¡¡¡¡Omg esta cara voy a poner si ganó !!!!","commenter_a":"Will Htx Larisa Valcy Brian Valcy Jovannii N Juliet Mendoza Luisao Roberto Galvez @username Beldy Salvador","post_message":"$400 MILLION POWERBALL JACKPOT: Are you planning on buying a Powerball ticket this week? With the potential jackpot now standing at $400 million, this Wednesday drawing could be one of the largest in U.S. history. While you're dreaming of how you'll spend your winnings, here's a look at the 10 largest U.S. lottery jackpots: #abc13"}]
