[{"comment_id":"10156026923975354","commenter_b":"She makes me sick .","commenter_a":"Sadly, the low information voters, which seems like 70% of the populace today, buys her act hook, line and sinker...Then again, if she is so naive about servers and cell phones, who on earth wants this dimwit in the White House (again)...","post_message":"A reporter asked if she had attempted to “wipe” her server. She replied, “What, like, with a cloth or something?” And she didn't stop there..."},{"comment_id":"423132557811339","commenter_b":"Al Sharpton is a racist !","commenter_a":"Afraid this will spread as it has in the past.","post_message":"Could this violence against police spread around the country?"},{"comment_id":"962147223853010","commenter_b":"Femmie=carpet munchingg","commenter_a":"And this is why I don't identify as a feminist. Yes, periods should not be stigmatized, yes womens sanitary products should not be taxed, yes we should try and supply women without access to sanitary products but publicity stunts like this are what give feminism a bad name. Let's all grow out our armpit hair and show it off on Instagram, not wear deodorant and bleed all over the place and while we're at it let's just devolve a little as well.","post_message":"'I ran with blood dripping down my legs for sisters who don’t have access to tampons...'"},{"comment_id":"10153331151986336","commenter_b":"Take her out Carly . We need a trustworthy Woman in the whitehouse.","commenter_a":"Thanks for sharing this I will be praying God will greatly use Carly .","post_message":"\"Hillary Clinton has demonstrated over and over again that she is not transparent. She will clearly be the [Democratic] nominee, and somebody must take the fight to her.” – Carly Fiorina"},{"comment_id":"10153559673746130","commenter_b":"Exactly, I forgot all about this bitch! Lol","commenter_a":"Why did you make her a thing again?","post_message":"Finally, something Kim Davis and her critics can agree on."},{"comment_id":"737426566424213","commenter_b":"Good Lord, this woman doesn't have a clue.","commenter_a":"Michelle Marjan","post_message":"Betsy DeVos, Trump nominee for Secretary of Education, is remarkably unqualified for the job. Full video: @webpagelink"},{"comment_id":"1739956166245053","commenter_b":"Tommy @username lol","commenter_a":"@username 😉","post_message":"Sharing just in case, can't hurt :)"}]
