[{"comment_id":"1131957863541988","commenter_b":"Anti-Gun people are ALWAYS the least EDUCATED when it comes to firearms. The AR is light, easy to aim, and in a situation when multiple armed people are invading your home, it's the ideal tool of choice for protection. About 3 Million home invasions happen each year. How do you Anti-Gun sheep suggest people defend themselves from MULTIPLE ARMED criminals? A handgun with 5 or 6 round won't help much with 3 guys breaking into your house","commenter_a":"A killing machine? Some people really do think that if a person has a gun they are going to use it for killing people. That they are and the weapons are evil. Stupid and clueless","post_message":"It only took us 38 minutes to walk out of an Orlando gun shop with a killing machine. See for yourself."},{"comment_id":"10154969127953128","commenter_b":"'@username just another feminist.","commenter_a":"when I go to a show I pay to be entertained , I don't pay to listen to the actors personal views or his GD views on politics.","post_message":"A central part of Donald Trump’s presidential campaign was his use of social media to weigh in on issues surrounding him – large and small – and he did it again on Saturday morning."},{"comment_id":"10154862137916756","commenter_b":"Yes, It's sad to see our Democracy gone to Totalitarianism. We're ruled by the subversive evil Corperations who War on terror was a scam. More honestly put it was WAR to produce terrorist so Corperations could exploit, kill and take down America itself by stripping freedoms as the Patriot act does and by spending the majority of monies on WAR. Now the Red Scare if being probigated by the Democreeps","commenter_a":"I'm stressed about the ugliness that this election has revealed in my fellow Americans. It is disgusting and frightening.","post_message":"Are you?"},{"comment_id":"502375926577851","commenter_b":"WELL damn go fund ME!","commenter_a":"It worked for this hating pig, wait for the next one. Gopers are slow learners.","post_message":"I'd say I've been doing it all wrong the past few years... except I'm a decent human being with a conscience... via The GOOP  | Liz"},{"comment_id":"10155226705950579","commenter_b":"She is sharp","commenter_a":"Where is the voice for the white race and culture?","post_message":"British Prime Minister Theresa May: 'I am pleased that I am able to meet President Trump so early in his administration.That is a sign of the strength of the special relationship between the United Kingdom and the United States of America.'  Full video of Primer Minister's Questions here: @webpagelink"},{"comment_id":"1482883781727172","commenter_b":"Once the snowflakes find out the expense of their new revolution will cost them their Pot money....they will reconsider. But hey...the gun community is an inclusive bunch. This should be interesting to watch. They will be easy to spot wearing their skinny jeans with a big bulge printing for me to keep an eye on.","commenter_a":"These people give a new meaning to the word stupid!","post_message":"Unreal."},{"comment_id":"1062536000443119","commenter_b":"White girls can't even right now.","commenter_a":"I went in to the Starbucks on Bay Area blvd across from baybrook mall,ready to buy coffee and a sandwich. They insisted on giving me everything ' on the house' ! They were so kind and respectful to their customers. There was an outpouring of kindness from all who were in the store. The tip jar was full of large tips! They locked the doors right after I made my 'purchase', but never once rushed me out of the door. This place is a class act!","post_message":"A computer outage is disrupting Starbucks sales in the U.S. and Canada, and its impacting a lot of people right here in Houston. KPRC2 Anoushah Rasta is following this story on #KPRC2 News at 10 p.m.  MORE ---> @webpagelink"}]
