[{"comment_id":"1137064162981260","commenter_b":"Mold on the apple","commenter_a":"Grrrrrreat. *head desk*","post_message":"A huge new study has confirmed that we are in the middle of an extinction event, the likes of which hasn't been seen since the dinosaurs went extinct."},{"comment_id":"619582968232282","commenter_b":"She has to go","commenter_a":"Yea","post_message":"Michelle was just caught red handed and is about to be charged with treason.  Good. It's about time she was exposed.  Do you agree Michelle Obama does not belong in the White House?"},{"comment_id":"1287096984651728","commenter_b":"A Muslim Communist Terrorist...","commenter_a":"You mean 70% of America? The same 70% that pays the most taxes and fills our military ranks? I'd rather he just said thank you, ate pork and died.","post_message":"Is he racist?"},{"comment_id":"550590221774115","commenter_b":"Republican presidential candidate @username has admitted to lying about his application and acceptance to the U.S. Military Academy at West Point, Politico reported on Friday. The retired neurosurgeon and current GOP frontrunner has been using the story as a central point of his personal life during his campaign.","commenter_a":"But its just been confirmed that you lied about West Point. You're done in my book. Before that, I supported you.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"969780003138778","commenter_b":"Bye, bye illegal aliens and their bastard American children.","commenter_a":"Love it, ... and Muslims too !","post_message":"Ay, caramba! #BuildTheWall @webpagelink"},{"comment_id":"10153510075534087","commenter_b":"So, there is no room for reasonable art of the deal on either side, now? Remember what happened in 2012, fellow Republicans. You didn't turn out because Romney wasn't 'conservative enough' for you. Then you did nothing but whine and bitch and blame it on voter fraud and your grandmother's Impetigo. The problem is not PEOPLE a from another country, it is SUBSIDIES that politicians buy votes with and ABUSE of unskilled labor and QUOTAS set by those who use prejudice to their advantage. We cannot round up 12 million entrenched undocumenteds, nor should we- it would be political and fiscal suicide. So let's get an electable candidate, get him in the WH, and start doing what we can to enforce immigration laws that protect us from terrorists and criminals, the ones Obama and this DOJ flip the bird to the SCOTUS a about, create an environment where inclusion with ...","commenter_a":"Trump all the way to the White House.","post_message":"“Marco Rubio is the front man for the open borders syndicate,” Donald J. Trump's senior policy adviser Stephen Miller said in a radio interview. “And understand this, Marco Rubio is determined to finish what he started with the Gang of Eight bill and to be President Obama’s third term on immigration.”"},{"comment_id":"10153302071591051","commenter_b":"Sick bitch","commenter_a":"Make him a her!!!!","post_message":"First he raped a 10-year-old. Then he left her something to remember him by."}]
