[{"comment_id":"1280473441987748","commenter_b":"Why is it that when someone makes a valid point. He or she is told to leave. His country was solely built on the backs of slaves. Leave a country you built. How bout leave a country you stole","commenter_a":"Don't like or agree then leave the country if shit offends you... like mama said I'm pretty sure the grass isn't greener on the other side but your more than welcome to check if ya don't like it here just don't let the door hit ya in the ass on the way out ....","post_message":"Massive respect to Colin Kaepernick for having the courage to speak out!!"},{"comment_id":"812245008908679","commenter_b":"You are one sick bitch.","commenter_a":"More whit and wisdom from Donald Dump the worst! Just like the KGB. People might begin to vanish if he doesn't like them.","post_message":"I would like you know what Trump supporters think about this. I find it very unsettling."},{"comment_id":"10153690611426756","commenter_b":"The woman is the patient.","commenter_a":"It's interesting the idea that the woman is the \"patient\" so her health is all that matters. I've always pictured prenatal care as for both the mom and baby together.","post_message":"Over the years, residents have come to Janet Singer, a nurse midwife, with tricky questions about performing abortions: Where does life actually begin? How do doctors’ personal beliefs play out in their clinical care? And what’s really best for mothers? She thought the public would benefit from hearing their experiences, so she asked four residents to write about them."},{"comment_id":"1196543867052750","commenter_b":"This bitch is hilarious, please keep validating all of the stereotypes of a trump supporters! Please wipe your mouth there is shit everywhere!","commenter_a":"Wow we got some really stupid people on here first let me say I'm pre-med graduated with honors I have served as an EMT and probably took care of you idiots in the o.r apparently your lobotomy didn't work we are smart people and educated people the dumb ones are the ones that think he's wasting his time trying to save assholes like you","post_message":"Someone shared a meme featuring an Adolf Hitler quote attributed to Donald Trump -- and his supporters ate it up!"},{"comment_id":"10154318363317232","commenter_b":"Why aren't they being plowed through? Run these scumbuckets down!","commenter_a":"Sent in the robot","post_message":""},{"comment_id":"10154879829717178","commenter_b":"They are not moving anywhere. Btw transgender is not a protected class.","commenter_a":"BOA is in talks to move it's headquarters out of Charlotte because of the discrimination law. Way to go State Politicians.","post_message":"House Bill 2 has just about everything an editorial cartoonist could want: a well-known story, controversy, key players to lampoon, and toilets. Story >> wral.com/@username"},{"comment_id":"1160354710653984","commenter_b":"@username Strong action on car deaths, prescription deaths self infliction, immigrants have lower crime rates on average.","commenter_a":"But there are far fewer murders Committed with ARs than with handguns.","post_message":"Its use has taken the worst direction."}]
