[{"comment_id":"1015168871918572","commenter_b":"Build the wall","commenter_a":"Bring it on, freight train.","post_message":"RT U.S. Imam “Muslims Have The RIGHT To Take The Property Of FILTHY Christians And Jews” @webpagelink"},{"comment_id":"10153794621104726","commenter_b":"Thats the REAL ISSUE here..PRAYER and FAITH ..these guys are so far remoived from G-d its pathetic..This all has to do with the men in POWER.....has been since the beginning....even satan wanted to be above our creator..these followers of satan are no different","commenter_a":"Still another reason I'm a pub!","post_message":"Democrats come out against God"},{"comment_id":"1294109124000954","commenter_b":"Not crazy just tired mostly gonna watch YouTube and eventually fall asleep","commenter_a":"Americas doomed if trump becomes president same can be said about hilary just sayin","post_message":"Glenn Beck caught his listeners off guard today with THIS massive announcement. He's been one of Donald Trump's harshest critics, and no one thought that this would happen."},{"comment_id":"1046533445373310","commenter_b":"that's not fair to pres o","commenter_a":"MLK would be ASHAMED of those useless race-baiters. He would spit in their eyes himself, if he were still alive.","post_message":"How I wish we had a Martin Luther King today instead of thugs and scam-artists like Sharpton, Jackson, Holder—and Obama."},{"comment_id":"10154424065382885","commenter_b":"If I'm not mistaken your authorized to wear awards from other services you earned. I know in my unit former Marines would wear their aviation badges.","commenter_a":"The officer in this picture is wearing a Navy Fleet Marine Force Breast insignia, Navy Conduct Medal, Navy and Marine Corps Achievement Medal ... weird","post_message":""},{"comment_id":"1709358782672403","commenter_b":"Poor Hillary. Somebody here has mercy for her? What will do happy to Clinton? She needs an oily dildo to be happy again!","commenter_a":"Mr. Trump please get back to talking about jobs and the border problems and ignore the pundits like Matthews. You need to talk more about Cruz being an insider too. That is not stressed enough in your campaign. You can win but have to talk about what the average American is worried about. God Bless you. I will be voting for you in Pennsylvania.","post_message":"Wait until I do not have to take on 16 candidates at once. I will be Hillary's worst nightmare! We are going to WIN!!"},{"comment_id":"474050886118825","commenter_b":"Good Idea !!!","commenter_a":"If a Muslim man sees a naked woman other than his wife, He must commit suicide. There for, call for a father daughter dance instead of having Easter, have all the Playboy Bunnies show up naked! Problem Solved!","post_message":"Muslims force this school to ban Christian holidays. America is under attack, this is treasonous. 'LIKE' if banning Easter is WRONG!"}]
