[{"comment_id":"10153479315413984","commenter_b":"2 wonderful women !!! just shoot me now....","commenter_a":"Thank you Bristol ! Well said. We all need to start standing up to these people.","post_message":"BOOM! Bristol just dropped a major truth bomb on Miley, and there's NO way she can argue the young Palin's point...  Do you agree with what Bristol Palin said here?"},{"comment_id":"10154154214551509","commenter_b":"Hahahahaha","commenter_a":"All I know is, if I ever overdosed in a whorehouse and my wife and my mama found out, skip the cpr. I am better off dead.","post_message":"After ex-NBA star Lamar Odom was found unresponsive in a brothel owned by Dennis Hof, the reality TV star swung into damage control mode.  \"My business is built on privacy and discretion,\" he said. \"But when the ambulance pulls out and five minutes later TMZ calls me, you have to deal with it.\""},{"comment_id":"566305263572986","commenter_b":"When are they going to be persecuted?","commenter_a":"Vote! Vote Donald J Trump!","post_message":"WIKILEAKS BOMBSHELL.... The election should be OVER. The Clinton campaign admits to Obama having emails from Hillary off her personal server and that the president knew before he heard about it from the press.  SEE EMAIL"},{"comment_id":"10155002829744411","commenter_b":"Leaks: the new news.","commenter_a":"u re a loooooser baby ...so why dont you kill yourself....","post_message":" appears, however, that after eight years the administration has suddenly awoken to the threat."},{"comment_id":"1055977171151281","commenter_b":"What do you expect from this Muzzie piece of shit.","commenter_a":"...and what did Obummer fight...Oh I know...golf par...didn't happen !","post_message":"***PATRIOT ALERT*** \"It is the inescapable duty of the Congress of the United States today to censure President Barack Obama for casting doubt on the sacrifices and motivations of the Americans who fought the Second World War—on the eve of Memorial Day, no less.\""},{"comment_id":"10153847623528812","commenter_b":"Na u should go back to Europe and take inbred fascist friends with u","commenter_a":"Beat it and take Obama too","post_message":"14-year-old arrested after a homemade clock he brought to school was mistaken for a possible bomb will be attending school in the Middle East."},{"comment_id":"1578043845546293","commenter_b":"Uhhh...Hillary won the election by 2.7 MILLION (and counting) votes.","commenter_a":"Another fake poll.... Just like the poll that claimed Hillary was going to win the election ..... Lie... lie.... Lie!","post_message":""}]
