[{"comment_id":"1003938939663251","commenter_b":"we didnt send anyone, go kill yor bankers they fuck up your country, wait they already fucked up i guess","commenter_a":"Next wedding come over to Greece you son of bitches to feed all the illegal migrants that you send us!!!!!!!","post_message":"This is such a great story!"},{"comment_id":"10154683791611002","commenter_b":"Gross. She needs to be locked up and throw away the key","commenter_a":"Lock her up and throw away the key.","post_message":"A 38-year-old Dearborn Heights woman is accused of attempting to arrange a meeting for sex with whom she thought was a man and his underage daughter."},{"comment_id":"699044636944748","commenter_b":"But will he be deported!","commenter_a":"Kill them all!","post_message":"HORROR IN MINNEAPOLIS! Somali Refugee in U.S. for Only 3 Months RAPES American Woman! This is what OBAMA has done to our cities! He imported this Muslim rapist!! TRUMP WAS RIGHT!"},{"comment_id":"10152823422866636","commenter_b":"There are desperate people with no job because of (mental) illness. There are enough jobs, but a lot of people don't want them. So immigrants take them and the 'jobseekers\" can blame them.","commenter_a":"We don't ask them to come here and risk life and limb doing so. Why exactly should we have them or even want them.","post_message":"Britain does not stack up well in comparison with other EU member states..."},{"comment_id":"10154481877908411","commenter_b":"That's why she gets oaid the BIG BUCKS.","commenter_a":"Same to you and your family. Thank you for your sincerity and hard work.","post_message":"Wishing you all a safe & fun celebration as you ring in the new year tonight. Happy New Year!"},{"comment_id":"10153269356147452","commenter_b":"@username the Marine Corps taught me nothing. You must be a weapons expert","commenter_a":"So you can hear two people yelling but not a gunshot?","post_message":"BREAKING NEWS: A homicide investigation is underway after one person was found dead following a report of two men yelling in an Alhambra neighborhood, police said. One person is being questioned, and there is no active search for other suspects."},{"comment_id":"1176200455772763","commenter_b":"She know foreign policy like my pet cockroach!","commenter_a":"Trump likes to do things on the cheap ,with Carson, Palin and Bachman stupid doesn't cost much.","post_message":"This is the same woman who thinks the United Nations is going to institute a One World Government and that Barack Obama is the Antichrist."}]
