[{"comment_id":"1759531520987240","commenter_b":"'@username Trump's wife was an immigrant and all she did to cum to U.S., is spread her legs!","commenter_a":"My native American vote for Trump although the Chief of the Cherokee tribe supports Hillary Clinton. Trump President of the United States 2016 all the way to Trump Towers aka the White House. Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not stirring a race war. Trump did not leave any US soldiers in Benghazzi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of ...","post_message":"It is time for rule by the PEOPLE, not rule by SPECIAL INTERESTS!"},{"comment_id":"10153333676096680","commenter_b":"Yep, karma is a bit*h !!","commenter_a":"This is the best election ever! The irony of Republicans being upset about the Pope questioning the religion of a politician is absolutely overwhelming...considering the constant questioning and outright ignorance about the faith of President Obama. And do not get me started on them running a Canadian after 8 years of racist birthers.","post_message":"He's mad."},{"comment_id":"10152881196379753","commenter_b":"So would you rather have the Transgender in the men's bathroom? Chances are SHE Is attracted to men. So would you like HER to go in there and check you guys out? Should lesbians have to use the men's bathroom then? Fucking. Ignorant","commenter_a":"Everyone should boycott planet fitness ' Political bullshit run foul again! Hope the woman sues there ass off.","post_message":"This woman thought she saw a man using the ladies locker room at her Planet Fitness. When she complained to the front desk, they responded by cancelling her membership.  Should transgender men who identify as women be allowed to use women's bathrooms/locker rooms?"},{"comment_id":"1783413695224482","commenter_b":"All of you illegals have no say! Trump 2016","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, Have Germany, Japan, South Korea, Saudi Arabia and others pay a fair share for our military support. preserve the sanctity of the unborn life ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness ......","post_message":"AMAZING! THANK YOU - WASHINGTON! I am so grateful for all of your support - and I will never forget it! We are going to defeat Crooked Hillary Clinton in November! There is no question about it. The last person Crooked Hillary wants to run against -- is Trump!"},{"comment_id":"10153376436094087","commenter_b":"Ok some of you all don't get it. I like Trumps idea on closing our borders for a time being and this is why and a simple example. Please come to my house I have a bowl of 10,000 M&M's and in that bowl I may have 100 but at least 2 M&M's that are poisoned and will kill you the moment you put them in your mouth and slowly corrupting the bowl. So I want you to stick your hand in the bowl and eat a handful! Oh you won't? Why not oh cause the odds are your gonna die? Oh I see but it's ok to let 10,000 immigrants in knowing some are most likely deadly. But won't eat 20 M&M's because at least 2 out the 10 grand will kill you what's the difference??","commenter_a":"The immigration and Nationality Act passed June 27, 1952, revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in chapter 2 Section 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by , violence or other unconstitutional means. This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House. Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the Hadith all require complete submission to Islam, which is antithetical to the ...","post_message":"“Anytime somebody is making inflammatory statements about Muslims or whatever, they can take that and use it to their advantage for recruiting purposes,” House Homeland Security Committee chairman Rep. Michael McCaul. “They take things like this and they spin it, to inflame the Muslim world, to get more recruits to join the cause to fight in Syria.”"},{"comment_id":"10153660324311491","commenter_b":"'@username Girl, your HR prowess is EVERYTHING. Reading these comments with a cup of tea. *sips slowly*","commenter_a":"Earned the right to what? To throw a tantrum and not show up for work? They did tell her but she did not like the news? When, how it was delivered? Kelly is not responsible for Michael's career! If she is acting unprofessionally and retaliating or is having behavior that is inappropriate in a workplace, the network will need to enforce the EEOC policies and review her contract for creating a hostile environment. The decision to move his day to depart is in everyone's best interest. Maybe after 26 years she should look for a new job, maybe advance herself too. She does not decide when any employee leaves. I now refuse to even watch this show anymore since the Kelly drama and I hope family and friends turn her off and let the network see who has the power to decrease ratings here! He's advancing his career period. If ...","post_message":"“I needed a couple of days to gather my thoughts. After 26 years with this company, I earned the right.”"},{"comment_id":"914159775273545","commenter_b":"She is labeled as dumb!","commenter_a":"Lort.","post_message":"“I’m From Every Continent In Africa” Raven-Symone Continues To Put Her Foot In Her Mouth"}]
