[{"comment_id":"976708829015963","commenter_b":"If we could only get rid of Wynne and get 3 new federal candidates","commenter_a":"The whole country needs to come to grips and be honest with ourselves...Canada can and must do much better than we did over the past ten years!","post_message":"She's not holding back."},{"comment_id":"10156726524125725","commenter_b":"Hide yo kids, hide yo wives.","commenter_a":"Will he be blocking polling places and stopping people from voting like he did in MA? After all, if you can't win an election honestly CHEAT, just like you did TO your wife!","post_message":"Illinois is shaping up to be an important state in the Democratic presidential race, so much so that former President Bill Clinton will be stumping in the Chicago area this week ----> @webpagelink"},{"comment_id":"1744837412449340","commenter_b":"that depends upon whether they can pass a rigorous background check.","commenter_a":"'Absolutely!'😎👍🏽","post_message":"Do you think lawful, gun-owning citizens make America a safer place?"},{"comment_id":"1756356877909889","commenter_b":"Go Trump!!","commenter_a":"Trump winns","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1102809566397179","commenter_b":"RACIST .","commenter_a":"Ben is a nice man but he reminds me of my old Catholic priest in high school, out of touch with how other people live and he came up with the most ridiculous things. Voting to me for Carson is like voting for the old priest.","post_message":"Number. Three."},{"comment_id":"10153693958978010","commenter_b":"It only takes an extra 2 hours in pouring rain. Finally home. BTW, Albert Hammond lied lied to us here. But i love that song. IT NEVER RAINS............","commenter_a":"Thanks.","post_message":"Turn on your headlights!  It's pouring outside. Here's a how-to for Southern Californians confused about driving in the rain.   @webpagelink"},{"comment_id":"10153057043503984","commenter_b":"Kick her dumb ass out of office!","commenter_a":"NO!!!!!! We the people need to come together and figure out what to do about these people. No one in Washington is.","post_message":"I guess she's revealing her true intentions behind becoming someone in power... I wouldn't want to live under her rule.  Do you think this new mayor should be allowed to put restrictions on the Constitution?"}]
