[{"comment_id":"1442770955748411","commenter_b":"Well he's better than that BITCH","commenter_a":"That's an insult to pigs!","post_message":""},{"comment_id":"1191296707568558","commenter_b":"Shawnee has some pretty crazy, unnecessary rules. Girls can't dye their hair to any color that is \"unnatural.\" They wouldn't of been able to walk either.","commenter_a":"So I wonder how many people could walk that have green or purple or blue hair but facial hair is not OK??","post_message":"Do you agree with the school's no-beard policy?"},{"comment_id":"911888578926545","commenter_b":"@username SO WHAT ITS LEADING TO THAT WE NEED TO TAKE OUR COUNTRY BACK AND PUT THEM IN PLACE THEY CAN T GET OUT OF OR PUT THEM IN MEXICO","commenter_a":"Civil Disobedience is totally fine and I salute those who stand by their beliefs. Perpetrating violence, burning, looting, damaging property etc. is not and those folks should be arrested and prosecuted.","post_message":"***The Radical Hard Left is plotting a Soros-funded plot to spark upheaval across America***"},{"comment_id":"1832453327028289","commenter_b":"Always thought she is trash and this proves it.","commenter_a":"Arrest her","post_message":"Ever the provocateur, Madonna dropped a trio of f-bombs and admitted that she's \"thought an awful lot about blowing up the White House\" during a speech at the Women's March on Washington on Saturday."},{"comment_id":"999929080073847","commenter_b":"Lol 1800 slap both of y'all bitches","commenter_a":"@username @username this is whats gonna happen whenever yall talk shi, ima walk my hoes lmao","post_message":"Really Out Here Walking Them On A Leash!"},{"comment_id":"1041909399153863","commenter_b":"Craig your brain isn't fully developed until you're in your 20's. Please just shut up.","commenter_a":"GOOD!...i hope she get life in prison...she killed a human being , not just a blob of cells....after 20 weeks the baby has feelings when touched...full lungs , full body parts , a full brain...it was murder plain and simple....why would ANY WOMAN wait sooo long to decide to kill her baby???","post_message":"The criminalization of pregnancy continues"},{"comment_id":"10154044362479024","commenter_b":"Let's cleanse American by not letting his sorry ass back into the USA","commenter_a":"tell Will Smith that we were here frist , and to fuck off","post_message":"With video. Bad things usually happen when leftists start talking about \"cleansing...\""}]
