[{"comment_id":"10154450737471909","commenter_b":"Please do elaborate and share your knowledge with the rest of us","commenter_a":"Anton Deni Pamela Note the what it's about and the symbolism. I found the pine cone staffs to be interesting knowing what they really mean.","post_message":""},{"comment_id":"702518316605413","commenter_b":"What is wrong with these kids???!!! They're turning into barbarians! Totally unacceptable!!!!","commenter_a":"Now the parents most likely were at the welfare office getting stamps like all the other unemployed shit they can't flip a burger over that's too hard","post_message":"Three students were arrested yesterday at William Allen High School In Pennsylvania.  Other students stood by and watched as they did this to her. Will you pray that this officer will be ok?"},{"comment_id":"1304804312923886","commenter_b":"Your kids would be better off in a Orphanage than with you..","commenter_a":"Lock them up","post_message":"They blazing new trails."},{"comment_id":"10153694133994330","commenter_b":"Feminists live in fantasy land","commenter_a":"She should be in a cheer outfit not a football jersey if she was to play that's fine make a all female team","post_message":"She's in 8th grade and she's no joke on the football field.  That's right, we said she!!  Watch NBC Connecticut news at 6:20 tonight as NBC Connecticut's Kevin Nathan brings you her amazing story. --> @webpagelink"},{"comment_id":"929408747192304","commenter_b":"As stupid and ugly as her mom!!","commenter_a":"She can't help it...look who her parents are!","post_message":"Chelsea Clinton....you are an IDIOT."},{"comment_id":"1136752646369001","commenter_b":"No the world is laughing at America","commenter_a":"The most pathetic, delusional president in history by far. Terror, hatred, murder and division all over the world like none in recent history and he says something so outrageous? Embarrassing and the world is laughing at this fool.","post_message":"Obama thinks we're living in the most peaceful time in history."},{"comment_id":"599509270200252","commenter_b":"THE ALPHA MALE !","commenter_a":"South Carolina here comes TRUMP. Let's work together and get this man elected as President of USA. United we Stand!!","post_message":"Departing New Hampshire with my amazing family! THANK YOU- NEW HAMPSHIRE! Tonight the VOTERS decided. Next stop is South Carolina! I LOVE you ALL & THANK YOU! Together we are GOING TO MAKE AMERICA GREAT AGAIN!"}]
