[{"comment_id":"10154803767550579","commenter_b":"Gary Johnson is scary and just as much a risk as any of them.","commenter_a":"Protect your Rights and Freedom, vote Libertarian Party, Gary Johnson and Bill Weld. 🔔 Give Freedom, Liberty and Justice a chance for a change! 🔔 Visit the FEELING THE JOHNSON Facebook page and give them a LIKE. Break the corrupt two-party system we're trapped in.","post_message":"CLIP: Donald J. Trump and Hillary Clinton debate the economy during the first presidential debate. Watch full video here: @webpagelink"},{"comment_id":"1681685855452013","commenter_b":"Joke...","commenter_a":"Jail and no bail.","post_message":"President Obama is taking guns out of all forms of entertainment.  This is ridiculous. He can't get away with this.  Do you think he is abusing his power to push his propaganda?"},{"comment_id":"10154364606704445","commenter_b":"Guns didn't kill these poor girls their mother murdered them!!! That was her intent!","commenter_a":"Glad she was able to protect....oops, kill her family with her guns. Just another \"legal good gurl\" gun owner turned murderer after her latest hissy fit.","post_message":"Two sisters shot and killed by their mother in Texas are being remembered by friends and neighbors."},{"comment_id":"1082607271804819","commenter_b":"Lynne Longoria Torres","commenter_a":"the BBC is for the birds.","post_message":"Donald J. Trump has yet to comment!"},{"comment_id":"1252390358183610","commenter_b":"He needs to be removed from office before he does something to endanger us all He is mentally unstable","commenter_a":"Why can't trump voters see this? The guy is mentally ill big time. All I ever hear is, he said he would create jobs! So let's put us all in harms way for the \"possibility of a few jobs.\" Just plain nuts! He's not going to create any jobs and if he does it's by being unlawful. 😡","post_message":"This explains a lot..."},{"comment_id":"1495672320492892","commenter_b":"Leave her there","commenter_a":"Why?? Why would you tarnish your gold!! The first black woman and you trash your chance to be a roll model and a proud American! Wtf is wrong with you! You just ruined your chance at becoming everything I wished for you! You Dumb bitch!!!","post_message":"I can't even anymore with this garbage..."},{"comment_id":"10154039827188984","commenter_b":"I hope it was a woman that pulled the trigger","commenter_a":"I am so grateful to my Lord that I do not have to live in a war torn place like this... never feeling safe and never knowing when you went to market if a suicide boomer was going to show up and kill you and others!! Never knowing when you rhusband was going to demand sex or molest your little daughter!! What a horrible life that would be!","post_message":"This terrorist fighter was excited to show off his machine gun skills to his buddies.  He stepped out beside a building, started to open fire, and then there was a CRACK followed by a dull thud."}]
