[{"comment_id":"1111151122296756","commenter_b":"This makes Chicago sound a lot like Baltimore for the \"quality\" (corrupt, criminal) of incumbent leadership (I grew up in the south side of Chicago all the way back to the 60's - and am not much impressed with what the present day enthusiasts think of my opinion. I also lived for a while in Viet Nam, and there we were allowed to call the other guys \"enemy\", and to shoot back at targets of opportunity, ... just sayin\") @webpagelink","commenter_a":"I knew there was a dirty Democrat involved in that ruckus!","post_message":"Inside scoop, here . . ."},{"comment_id":"609422632593811","commenter_b":"If it is true Hillary said that, she deserves to lose big time and go to jail.","commenter_a":"this is noy the first time she threathenn to kill him. she did little over a week ago","post_message":"Whoa. You do NOT mess with the Clintons"},{"comment_id":"10154559910664087","commenter_b":"@username: Are Christian refugees beheading non-Christians?","commenter_a":"They can rewrite it. However, they still have the footage of Trump calling for a Muslim ban on the campaign trail.","post_message":"BREAKING: White House attorneys are working on rewriting the language of President Trump's immigration ban following yesterday's dramatic defeat in the appeals court."},{"comment_id":"1641280749470830","commenter_b":"At the end when she started really going after him is when I would have had her on the ground and I would break her fucking arm and left her there to rot","commenter_a":"Knives are becoming a serious problem. Yet another unintended consequence of terrorism.","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"},{"comment_id":"10153288020701545","commenter_b":"I hope you never lose your corporate job. And I also hope the minimum wage workers you go to every day for house cleaning, coffee, lawn care and a burger don't abandon you.","commenter_a":"If people work 40 hours a week, minimum wage should cover minimum living expenses. This isn't even a question.","post_message":"The National Restaurant Association says a $15 base wage would force employers to replace workers with technology, such as ordering tablets. \"Fifteen dollars is too far, too fast,\" said spokeswoman Christin Fernandez.  What do you think is a fair minimum wage?"},{"comment_id":"1184087691636663","commenter_b":"Donald Trump doesn't smoke, drink or do drugs. One of biggest problems in USA. Golden Crescent (@webpagelink) Build that Wall....Fence Act of 2006...Ask yourself the ???? Make America Great Again! Corruption!!!! Stop Trump!!!!","commenter_a":"Well Done Donald.","post_message":"Thank you Republican National Committee."},{"comment_id":"10153830335904087","commenter_b":"Course they won't. They just coronated their queen.","commenter_a":"The most transparent \"administration\" in history.... LOL","post_message":"#BREAKING: The State Department is refusing to hand the House Oversight Committee any email messages as part of the panel’s investigation into eight deleted minutes from a 2013 press briefing video."}]
