[{"comment_id":"10153351807966130","commenter_b":"*you're behind a foolish *woman","commenter_a":"GO GIRL. WE'RE BEHIND YOU!!'","post_message":"Ashley Burnham was the first Canadian and aboriginal contestant to win the Mrs. Universe contest."},{"comment_id":"1753488154905363","commenter_b":"Bush signed NAFTA. Trump is supposed have a moron.","commenter_a":"Deplorable from Ohio","post_message":"Donald J. Trump speaks to the press after touring the Flint Water Plant and Facilities."},{"comment_id":"10153005291732235","commenter_b":"Why do we want to screw up a perfectly untapped planet. Look at what we have done to earth.","commenter_a":"Please don't start another unnecessary war ! Leave that planet alone!","post_message":"Attention earthlings: This is pretty cool."},{"comment_id":"10158501274630389","commenter_b":"Put her back in prison or deport her.","commenter_a":"She has all the qualifications to head up the DNC or Planned Parenthood.","post_message":"Despicable."},{"comment_id":"10153528018151717","commenter_b":"She really most likely break the toilet seat when she sat and clog the toilet anyway....best she go to Wall mart to do her business anyway cause she will fit in so much better being in her own element.","commenter_a":"This doesn't have anything to do with being fat, and she isn't mentally ill. She is suffering from an illusion, and that is anyone gives a rat's ass about her opinion. I don't even think she can afford to shop at Target, and if she did she'd pay for it with food stamps. Her kids get free lunch at school, and are probably on state Medicaid. Point being, she is depending on the government to sustain her lifestyle of having as many no-neck young'uns as she can have. Probably only has sex in order to procreate and we are screwed up. I wonder what her white trash, holy roller agenda is all about?","post_message":"A serious kook attack has been captured on video."},{"comment_id":"10152744164338645","commenter_b":"@username....Sounds like you are the racist here calling @username \"Mr. White Man\" with the pea brain...maybe you are the one with the pea brain!","commenter_a":"Please don't shoot the young black ARMED CRIMINAL, it might start another riot!","post_message":"Police investigate an early morning armed robbery at an area Wal-Mart store."},{"comment_id":"1038357019610877","commenter_b":"If BERNIE goes Independent, or goes Green, then Good, Hillary is a bitch, a liar, a thief. BERNIE should do anything and everything he can to defeat the nasty bitch. #NeverHillary #BernieSanders2016","commenter_a":"We may still be able to achieve some things of value at the convention. Bernie's current top priority at the convention (as stated in a conference call with his delegates) is to change the Democratic party rules to \"un-rig\" future Democratic primaries so they will be fair to future Democratic party presidential candidates. For him (and our delegates) to have any chance of making future Democratic primaries more fair via votes in the rules committee at the convention, we need to get all our pledged Bernie delegates funded. We are still at risk of losing over 100 pledged Bernie delegate votes, purely due to lack of funds. That's down from over 200 a couple of weeks ago because we have never stopped trying to get them funded. For everyone who is #StillSanders, can you please consider donating $2.70, $5 or $10 (if you can spare a few dollars) to help ...","post_message":"We are building a movement because this country belongs to all of us - not just a handful of billionaires and wealthy campaign contributors. And I'm asking people across the nation to come together and organize an unprecedented grassroots movement."}]
