[{"comment_id":"1671482303102466","commenter_b":"I bet he dreams about it!","commenter_a":"Trump is a vulgar idiot yet Rubio is a hero? Seriously people, Trump didn't walk out on stage and say hey I got a big package. Rubio has insulted him for a week about this and Trump ended the insults. Rubio is the one that's vulgar and obsessed with Trumps Package.","post_message":"\"Did he just say that?!\""},{"comment_id":"10154473746766234","commenter_b":"Illegal is illegal and if you can support that in anyway, you are part of the problem. Bottom line","commenter_a":"Nobody has a problem with immigrants!!! It's undocumented illegals with arrest records (felony) what don't you understand!!!!","post_message":"Some New Jersey restaurants are preparing for a strike on Thursday."},{"comment_id":"517177675137728","commenter_b":"here we go lone rider, is he picking up speed","commenter_a":"Looks like he is near Morongo Casino soon.","post_message":"Police pursued a stolen big rig near Riverside, California this afternoon."},{"comment_id":"10152767669722217","commenter_b":"100' wall? It will keep out all the green eyed monsters!","commenter_a":"After the last couple of days, I feel it's time to throw my hat into the political ring. I'm forming a new party. The Free England From London Party. We have one proposal. To turn the M25 into a hundred foot wall and fill it with concrete. I'm not sure how we're gonna pay for it, so we're the same as all the other parties, however, I reckon a few Poles and Kurds will do it quite cheap and we could recycle bits of London to make the wall. Who's with me?","post_message":"Spotted any quirky campaign #GE2015 pics? Share yours in the comment section below or via haveyoursay@bbc.co.uk"},{"comment_id":"10153470330831130","commenter_b":"Divorce first, then be a whore.","commenter_a":"To y'all bashing her.. this line right here says it all, \"In my marriage, I felt alone.\" - Divorce was inevitable. Period. THEN it says she met him when she was 17, they dated while she was in college, and got married once she graduated. Can you imagine if you married the person you dated at 17? It wouldn't work for a LOT of people.","post_message":"\"And just like that, my plans to spend the rest of my life with the man I loved and my best friend were crushed.\""},{"comment_id":"975345569191587","commenter_b":"Mr, Dugger wanted a woman with no personality.","commenter_a":"Depends on what viewpoint your looking at. A successful marriage is not solely dependent on sex which is something your husband didn't know or taught to his son","post_message":"Michelle Duggar also says she's saving she and husband, Jim Bob’s, 'intimacy notes' to share with her daughter, Jill. Can you say, “EW!”?"},{"comment_id":"1015232928526293","commenter_b":"will someone call the home and tell them a resident is out running loose?","commenter_a":"makes no sense, idiot","post_message":"Nancy Pelosi identified what she called the \"three G's\" – reasons why white males favor Donald J. Trump over Hillary Clinton. @webpagelink"}]
