[{"comment_id":"10155010773818812","commenter_b":"Cynthia lol ur such an idiot","commenter_a":"Crazy! The country is not in mourning it's thrilled!!!😃😃😃","post_message":"The first post-election \"Saturday Night Live\" didn't open with a sketch spoofing the presidential candidates, nor did it include Alec Baldwin's Donald Trump. Instead, it opened on a somber note."},{"comment_id":"10153709060366037","commenter_b":"She is a disgusting hypocrite!","commenter_a":"That's OK, Kim. You're getting what you really wanted all along. Attention. May your 15 minutes be over soon.","post_message":"\"What probably hurt me the worst is when someone tells me that my God does not love me.\""},{"comment_id":"10155404890705354","commenter_b":"HHHAAAAAA just when you think these morons can't get any more stupid then they already are..HHHHAAAAAA......how about a lying bitch? is this phrase \"Off Limits\" personally I think it's really very descriptive of this...well...lying bitch....","commenter_a":"Bullshit!","post_message":"Hillary Clinton's digital thugs warn the media: using the word \"secretive\" is \"coded sexism.\" Take a gander at the rest of Hillary's laughable list of \"sexist\" words..."},{"comment_id":"1109139419126529","commenter_b":"They are discontinuing these items because they are not being purchased. Pure business decision. They are not trying to bs socially responsible.","commenter_a":"Posturing","post_message":"Walmart made a major decision regarding guns that is going to surprise more than a few people."},{"comment_id":"10154648148626509","commenter_b":"Women for Trrump!!!: \"They'll be on their knees soon enough.\"","commenter_a":"Woman and Americans for our next president Donald J Trump.. Welcome aboard it's a wonderful ride to the White House","post_message":"This mogul once said he's a member of \"the lucky sperm club.\" How Donald J. Trump sees himself, in his own words: @webpagelink"},{"comment_id":"10154941014182577","commenter_b":"Lies and fear. Lies about money and fear of foreigners. That's it.","commenter_a":"How was Nigel Farage's march?","post_message":""},{"comment_id":"10154473746766234","commenter_b":"Illegal is illegal and if you can support that in anyway, you are part of the problem. Bottom line","commenter_a":"Nobody has a problem with immigrants!!! It's undocumented illegals with arrest records (felony) what don't you understand!!!!","post_message":"Some New Jersey restaurants are preparing for a strike on Thursday."}]
