[{"comment_id":"1754158708182258","commenter_b":"Rip officer...fly high... You will be missed","commenter_a":"Whoever is doing the laughing get off this page very disrespectful","post_message":"The funeral service begins for Detroit Police Sgt. Ken Steil. Watch along live as loved ones and fellow officers remember his life: Read more: @webpagelink"},{"comment_id":"10153854087684087","commenter_b":"Bern bitch!","commenter_a":"@username savage lmaoo","post_message":"“Say what you want about Bernie. He doesn't quit. He's in there bitching,\" Donald J. Trump said."},{"comment_id":"10153395340948984","commenter_b":"She's the one who put the hatred for America in his heart, she should be deported immediately!","commenter_a":"Give her the same!!!","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing... Do you think this Boston bomber got what he deserved?"},{"comment_id":"1640983469535980","commenter_b":"Speak for yourself. You've been in your spot for years, tell us something you have done. LADY, clean out from under your doorstep before you start criticizing someone else.","commenter_a":"Your a sick women","post_message":"Pelosi on Republicans: \"They pray in church on Sunday, and prey on everyone the rest of the week.\""},{"comment_id":"1095662820489119","commenter_b":"She's God Damn Trash! Nasty white cunt!","commenter_a":"This is a prime example older white people are the most racist people in America the older white the younger generation is not like the old white generation they raise the kids to be racist this just don't make no sense but she got a dose of her own medicine because the world is not hateful like she is and she's in her last days she's going to die a old racist woman she have to answer to God she's trash in my book","post_message":"A black girl was harassed by an older white woman while selling candy outside a California Target for $1. But, there’s a twist. Jay Lopez, a customer at Target, saw the woman berating the girl & intervened. Restoring your faith in humanity, Lopez bought the remainder of the sweets. VIDEO---> @webpagelink"},{"comment_id":"1724103797869883","commenter_b":"This black pig needs to be publicly executed by being hung till dead,then tossed in the garbage tho I doubt the land fill will allow the garbage truck to dump their garbage with him in it .","commenter_a":"BLM, baby ! BLM !","post_message":"Media Silent After Black Teen Shoots Newlywed Veteran And Executes His Pregnant Wife. Tragedy strikes again, please pray. What do you think his punishment should be?"},{"comment_id":"10154327927746336","commenter_b":"Only thing that needs a brain is u Hernandez as u can't even spell my name which is right infront of u.. Thank God Trump is getting rid of all u illegals.","commenter_a":"Please refer to him as President Trump.. Thank u.","post_message":"This morning, Donald J. Trump tweeted out a message for Memorial Day."}]
