[{"comment_id":"10153124983097061","commenter_b":"fire her","commenter_a":"If she can't full fill her position she should step down.","post_message":"Kim Davis name removed from marriage license for same-sex couple: abcn.ws/1NrN92G"},{"comment_id":"1864825540399867","commenter_b":"A few years prior: \"did you see the her sleeveless dress?! THE FIRST LADY HAS NO CLASS!\"","commenter_a":"I'll never get over our \"president\" saying he grabs women by the pussies and his supporters just shrugging their shoulders over it","post_message":"Here are five reasons why Trump is the opposite of a Christian. Special thanks to Cindi Brady. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152793900772452","commenter_b":"Bad women drivers! ;)","commenter_a":"Who the hell runs over a motorcyclist and does not have a clue that they hit someone????! Thank god the other drivers made her stop FINALLY!!!","post_message":"The dramatic rescue of a motorcyclist who had been dragged underneath a truck on the eastbound 91 Freeway was caught on video. abc7.la/1EK2HcY The video was submitted to Eyewitness News by viewer Byron Holeman who used the #ABC7Eyewitness."},{"comment_id":"10153344730251130","commenter_b":"The County Clerk who refuses to issue marriage licenses to gay couples makes the same argument. This job responsibility should be no surprise to her. If she can't do it, then she needs to be in a different job.","commenter_a":"Surely she knew when she took the job that serving alcohol was part of it. Go find a job that fits your lifestyle.","post_message":"\"No one should have to choose between their career and religion.\""},{"comment_id":"659700944220484","commenter_b":"yes beat her ass for being arrogant","commenter_a":"REALLY,??","post_message":"This entitled woman just demanded a free drink... Because of slavery? This is absolutely ridiculous. We owe her nothing. Should she be compensated for slavery?"},{"comment_id":"1061821787247406","commenter_b":"fact, king obama ignored our federal immigration laws and gave amnesty to millions of illegal aliens including the illegal that killed Kate steinle. had he enforced our laws and put a stop to san Franciscos sanctuary city policies that woman would be ALIVE today. fact, obama blamed cops before the facts came in about doin their jobs. cops were killed after his comments. had king obama stood up for cops and denounced black violence those cops would be ALIVE! wake up Cynthia. who's to blame for this mess? every MORON that voted twice for king obama. 😡","commenter_a":"so when king obama blames police for doin their jobs and cops get killed it's not king Obama's fault? when king obama allowed illegal aliens to invade our communities and then kill innocent Americans like kate steinle it's not king Obama's fault? you leftest are MORONS and HYPOCRITES. 😄","post_message":"\"People have to understand that hateful rhetoric and words and harassment of doctors and harassment of women going to health centers have real implications.\" -Planned Parenthood President Cecile Richards"},{"comment_id":"1172120832836462","commenter_b":"@username she's a racist. \"Government people\" is code word for white devils. She just want to see them.","commenter_a":"Well how is he planning to build this wall!! Without the native America permission he's trying to build on our land (Tohono O'odham nation) nd again there's gna be another treaty broken","post_message":"President-elect Donald J. Trump says he will move to deport criminal illegal immigrants and still plans to build a wall."}]
