[{"comment_id":"1757125454570252","commenter_b":"Kasich belongs to the Liberal side, lies like they do. Thank God, all has been peaceful. Stay safe Law Enforcement 🇺🇸","commenter_a":"Loved your speach, Laura. I'm so disappointed in John Kasich, Jeb Bush and other Republican leaders who are helping Hillary to win.","post_message":"The Ohio governor is still refusing to attend the convention in his home state and support GOP unity."},{"comment_id":"966056150146121","commenter_b":"Slow learners. Blacks keep voting Democratic even though Dems have done nothing but baby them and keep them down.","commenter_a":"They STILL haven't learned about the democrats !!!!!!!!!!!!!!!!!","post_message":"LANDSLIDE"},{"comment_id":"10153333676096680","commenter_b":"Yep, karma is a bit*h !!","commenter_a":"This is the best election ever! The irony of Republicans being upset about the Pope questioning the religion of a politician is absolutely overwhelming...considering the constant questioning and outright ignorance about the faith of President Obama. And do not get me started on them running a Canadian after 8 years of racist birthers.","post_message":"He's mad."},{"comment_id":"10152687938146813","commenter_b":"So what? Some women don't want to have kids at a particular time. Some never want to have kids. Second, most women who have abortions do so because of financial reasons. Third, contraception isn't 100% effective. Some types are only 75% or so effective. The diaphragm in a multi-para woman has a low effectiveness rate. I've been pregnant twice on oral contraception. Each woman has her own story. If she wants to tell it, she will. Otherwise, it's none of your damned business. Oh, and if my body is affected, it is my choice. I have self-autonomy over my body.","commenter_a":"Abortion is not a method to avoid pregnancy; a woman can avoid pregnancy by using birth control provided to her for free and not getting herself pregnant. Abortion is, in reality, simply a way to avoid MOTHERHOOD; it's not 'my body, my choice,' it's 'my LIFESTYLE, my choice.'","post_message":"The question matters: More people support abortion rights when the poll language focuses on women. #LetsTalk @webpagelink"},{"comment_id":"1676343909290795","commenter_b":"I wish these other stories would come out! I read another one about a guy she accused of hacking her account and he said he would pass on all his emails etc to Trumps campaign guys lawyer. I think this chick is unbalanced and has issues","commenter_a":"You idjits are just gonna love the hell out of it when we burn this BS Republican party to the ground if a hijacking takes place at the convention in Cleveland. Tired of this party bending over and letting Obama drive deep, then talk about conservative values during the election. If Hillary wins this, look in the mirror. #TRUMP2016.","post_message":"\"We saw libel, defamation, slander, smearing of her reputation, simply for trying to do her job,\" Katie Pavlich said. \"This isn't just about simply one reporter. It's a bigger issue of the role of the press in America.\""},{"comment_id":"979496535445797","commenter_b":"Good KICK ASS !","commenter_a":"Good for you","post_message":"BOOM! American's save the French yet again!"},{"comment_id":"1761764947438429","commenter_b":"@username you do realize Hilary wants to deport illegal immigrants too right? She announced it this last week.","commenter_a":"Women should feel insulted that the first female ever to be nominated also happens to be a corrupt, cold, calculating, ruthless, lying crook. If we're going to give the distinction of 'first woman nominee' or, God forbid, 'first woman president' to anyone, she is, quite literally, the last woman in the country who deserves the honor.","post_message":""}]
