[{"comment_id":"10154079954761833","commenter_b":"hopefully some illegal alien or muslum will off her with a hammer .","commenter_a":"More people are killed with hammers in the US than guns each year. Why isn't she calling for tool manufacturers to be held liable?","post_message":"When Hillary Clinton says that the firearms industry is only business in America that is wholly protected from any kind of liability,\" she is not telling the truth. Gun manufacturers and companies are responsible for bad products. What they are not responsible for are bad people who misuse their products."},{"comment_id":"10154462492528487","commenter_b":"Depends on your view. How much of the worlds' healthcare systems have you been a part of, witnessed or experienced. We are not perfect but we are so far from \"sucks\"","commenter_a":"The crap we have now sucks","post_message":"What would TrumpCare mean for Americans? Essentially, a public health disaster."},{"comment_id":"1152705121429163","commenter_b":"Illegals are voting in our elections.","commenter_a":"Don't you think you should stop asking this question and read the Constitution of the United States dumbass!","post_message":"I Agree!"},{"comment_id":"1539276206088035","commenter_b":"Yes,They Love to spend Our Money !","commenter_a":"That's what dems do,,,,spend money they don't have ,,,,,","post_message":"I'm perhaps the best fundraiser for the Democrats. If you want to separate Democrats from their money, tell them that I'm on the march. Tell them that I'm responsible something, and they will start writing checks for money that they don't even have."},{"comment_id":"10153641804123487","commenter_b":"\"Staying Power\"....\"Explodes\"....Politics is so sexual.","commenter_a":"Who cares about the xenophobe clown? Why don't you cover the candidate with more real ideas: @webpagelink","post_message":"The GOP is doing some soul searching.."},{"comment_id":"10154307546211509","commenter_b":"Joking? Missing a punch line...","commenter_a":"Fox News: Thug tries to jump on three girls, and bullets stopped him. Bill O'reily: What was he trying to do to those three girls before the bullets? We're just asking questions.","post_message":"15-year-old Zaveon Dobson was shot and killed after he jumped in to shield three girls from gunfire. @webpagelink"},{"comment_id":"10153465651246545","commenter_b":"She Have to have police officers to work security. That's a city ordinance. If police don't work the event, her show will get cancelled. I think It will blow over tho and she'll be ok...","commenter_a":"I will say one thing...Police or No Police. The show will go on and will be sold out. So she is winning either way. So for those that are calling her racist. Why would all nationalities join in on the hate monger party and pay for a ticket. IJS","post_message":"The president of the Dallas Police Association said Saturday his group is not calling for a boycott of working security for Beyoncé's May concert at AT&T Stadium. However, he also said he wouldn't be surprised if many Arlington officers chose not to work the event."}]
