[{"comment_id":"10154394163921509","commenter_b":"It's the food were eating gmo and all the chemicals they put on our food","commenter_a":"Rest In Peace Great Grang Pa. How Comes Our Generation Dies Too Young?","post_message":"Yasutaro Koide was born a few months before the Wright brothers made the world's first powered flight."},{"comment_id":"10153383817802061","commenter_b":"Super cute","commenter_a":"Dad's are important too","post_message":"WATCH: Heartwarming and powerful new message with NFL's DeAngelo Williams, Jason Witten and Ben Watson on spending time with daughters, as they do their hair and bond with them."},{"comment_id":"10153471115269087","commenter_b":"If i was Trump i would stay away from that dumb broad.","commenter_a":"GO PRESIDENT TRUMP 2016!!!!!!","post_message":"You’ve also said, “She can pick winners!'\" Bristol Palin said of her mother Sarah Palin. \"I hope you’re right, and that she endorses Donald J. Trump today for President.\""},{"comment_id":"1249874218366089","commenter_b":"Same here, can't stand that witch!","commenter_a":"I'll watch O'Reilly and Hannity but I haven't watched Kelly since the fox debate and never will again","post_message":"TONIGHT: Fox News Channel is live until 2a ET with post-debate reaction. Don’t miss special coverage from Bill O'Reilly, Megyn Kelly and Sean Hannity. #GOPDebate Details: @webpagelink Live blog: @webpagelink"},{"comment_id":"10154493907103352","commenter_b":"Amen and thank you Lord","commenter_a":"Amen","post_message":""},{"comment_id":"10153153444601051","commenter_b":"Go ahead baby girl google dat, ill wait.... Lol","commenter_a":"This Latina is a trump supporter.","post_message":"We went to the Donald Trump protest this week to speak to his supporters and critics. Here's what they had to say. Do you agree or disagree with Trump when it comes to immigration?"},{"comment_id":"10152865807076051","commenter_b":"This was set up by this girl and her friends - she made sure her friend was there with the video going b4 she hit the other girl-she needs to be put away for a long time and have her sorry ass beat in prison and see what a REAL asskicking is. I hope the victim doesn't get scared and not proceed with the charges.","commenter_a":"we can thank our president and people like al sharpton for all of this they have done as much as possible to entice race wars!!!","post_message":"A girl was at the park with her little brother when all of a sudden they were attacked. The little boy tried to stop the beating – but that just drew him into the line of fire."}]
