[{"comment_id":"1751693101711200","commenter_b":"Who is this women?...wait nevermind. I don't care!","commenter_a":"Everything we say anymore is considered to be racist","post_message":"Blake Lively is being accused of racism after using a famous line from Sir Mix-a-Lot’s 1992 song “Baby Got Back (I Like Big Butts)” to describe her assets."},{"comment_id":"10154822738529369","commenter_b":"You know she had to be shitting her pants up there","commenter_a":"Shell be alright it another Trump curve ball","post_message":"A Clinton campaign representative told NBC News that the campaign had 'no idea' what Comey was referencing in the letter he sent Congress on Friday."},{"comment_id":"1601073560185519","commenter_b":"'@username I know I'm not saying he's illegal, he just wants every illegal to come into our country without becoming legal. He's ruining our country!","commenter_a":"She's not even a native born American trying to become the FLOTUS. Yet Donald Trump gave the current American President hell about his birth certificate! GTFOH","post_message":"Melania Trump: 'The race will be hard fought all the way to November, there will be good times and hard times...it would not be a Trump contest without excitement and drama.' @webpagelink"},{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx ' you big dummy '","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."},{"comment_id":"1129299917126536","commenter_b":"Hillary is the real war on women.","commenter_a":"Together we Move Forwards Vote to President @username 2016.","post_message":"In ten years, we can generate enough renewable energy to power every home in America. #EarthDay"},{"comment_id":"10154221702747629","commenter_b":"I'm sorry about your kitty.","commenter_a":"Donald will make America great again! Even if he has to do it all by himself! This is what REAL LEADERSHIP looks like libturds!","post_message":"Donald J. Trump promised to “do it by myself” if squeamish party elders refused to get a grip on the hard job ahead."},{"comment_id":"10153652003074203","commenter_b":"he's going to destroy both political parties!","commenter_a":"Hes for real gonna destroy the republican party... and all of us love him for it","post_message":"One thing is pretty clear: Donald J. Trump isn going away for awhile."}]
