[{"comment_id":"10154379818081509","commenter_b":"Go away Judy womble","commenter_a":"Shut up Donald...go away","post_message":"\"I think she's right -- I am angry.\" In an interview on Erin Burnett OutFront, Donald J. Trump responded to Nikki Haley's remarks about him after #SOTU. @webpagelink #TrumpOnCNN #SOTUresponse"},{"comment_id":"1172600979417284","commenter_b":"She is nothing. Melanie has class!","commenter_a":"Cruz is a desperate man and a liar and will do anything !!! Go Trump!!","post_message":""},{"comment_id":"925323364324906","commenter_b":"@username yes it was look at the lady who ran it she has ties to hamas open your eyes","commenter_a":"There was no pro Sharia Law March. There was a \"we don't want a president calling women who disagree with him fat pigs\" march. A \"no man has the right to give another man permission to call his daughter a piece of ass\" march. A \"why would you take away funding from violence against women programs as one of your very first acts as president\" march. A \"don't remove health insurance before you have another plan in place march\".","post_message":"Ayaan Hirsi just took the gloves off. She couldn't let this go unnoticed, and neither could we. Do you agree with her?"},{"comment_id":"1795036153889458","commenter_b":"because women dont cheat. lol","commenter_a":"A male will cheat if they want. Tattoos or no tattoos. Plain and simple. I hate how they always try to blame other things instead of a man owning up to being scum","post_message":"Do tattoos do it for you?"},{"comment_id":"10155445943810725","commenter_b":"Sadly though it still happened :(","commenter_a":"Everyone who leaves their child with anyone should have a nanny cam.","post_message":"Nanny cam video reveals horrific new details on how a babysitter tortured a 3-year-old girl (Warning: Disturbing content)-----> @webpagelink"},{"comment_id":"10154937035987235","commenter_b":"go fuck yourself","commenter_a":"Obama Regime is displaying a rare determination to start WW3 before they are ejected from office. Welcome to the new cold war sponsored by peace loving progressive (communist/fascist) liberal globalist Democrats! It's strange to be watching such open minded and tolerant and peace-loving progressives suddenly try and act all hawkish and aggressive and neocon-like by trying to start 3rd world war with Russia. Nice work! Barack Obama and the Democrats are bad losers!","post_message":"\"I could never look myself in the mirror again with self respect.”"},{"comment_id":"1123357077760543","commenter_b":"She's gonna drop-kick Trump in the general election!!!!","commenter_a":"America actually did stop being great, but not for you because you a corporate puppet","post_message":"\"We don't need to make America great again. America has never stopped being great,\" Hillary Clinton delivers victory speech after #SCPrimary win: @webpagelink"}]
