[{"comment_id":"996230513733330","commenter_b":"Hillary would then round up JEWS if she could ... Thats been done by HITLER","commenter_a":"How big of a f-----n idiot can some one that is running for office be she is going way to for","post_message":"BREAKING: Hillary Clinton accuses GOP of wanting to implement Nazi tactics."},{"comment_id":"984015725050561","commenter_b":"Carla. Go back to school honey. You are so stupid.","commenter_a":"Compare this: Melania Trump became a US citizen and said it was \"The greatest privilege on the face of this earth.\" Michele Obama said in a speech, \"For the first time in my adult life I am really proud of my country.\"","post_message":"Donald J. Trump’s campaign chairman denies allegations Melania Trump lifted her convention speech from Michelle Obama’s in 2008, claiming such an act would be \"absurd.\""},{"comment_id":"10154465845766162","commenter_b":"This is different, this girl has some evil in her!!","commenter_a":"Huh? Well that's just stupid. I tell you to jump off a cliff, and you do it... You're the idiot.","post_message":"A teenager who sent her boyfriend dozens of text messages encouraging him to take his own life and told him to \"get back in\" a truck filled with carbon monoxide fumes must stand trial for involuntary manslaughter: @webpagelink"},{"comment_id":"10154535880412235","commenter_b":"Get your story straight. Us woman shouldn't raised our hands on a man and expect not to get hit back. That's what's wrong with our society.","commenter_a":"She's doing to him the same thing that easy-to-use girl did to Kobe Bryant. She was \"admiring\" his jewelry a little too damn much.","post_message":"THIS JUST IN..."},{"comment_id":"1368750766478283","commenter_b":"She was with a child!","commenter_a":"This women is a stupid and ignorant person I hope there were no kids around that can very easily copy this stupid act","post_message":"Toronto Zoo officials said the apparent retrieval of a hat was \"a very bad idea\" @webpagelink"},{"comment_id":"10154487721214062","commenter_b":"Only problem he has to rape to be a thug. Blacks just have to be born and they are considered thugs","commenter_a":"Lol KHOU just called someone a thug! 😂😂😂but seriously he needs to be caught.","post_message":"Please share to get this thug off the streets! He's a violent rapist who sexually assaulted two 16-year-old girls."},{"comment_id":"10153316443579170","commenter_b":"God, she is a worthless person!","commenter_a":"Sicker than sick.","post_message":"All you Bible believers better change the way you think! The queen-in-waiting has spoken!"}]
