[{"comment_id":"10153570672510667","commenter_b":"Are you kidding!? Heartbreak isn't legal punishment - she needs to be jailed!&","commenter_a":"This is horrific! My heart aches for the mother...I know they all should have had their seat belts on, but they were old enough to know this. I don't think the mother should be charged because she will relive this over and over and over and over again...it will haunt her for the rest of her life. God be with her.","post_message":"Three girls were killed and six others injured when an SUV carrying 11 people had a tire malfunction and crashed on I-95 in Titusville, Fla. @webpagelink"},{"comment_id":"10156191527000354","commenter_b":"Huma, you criminal bitch, up yours.","commenter_a":"Dr Ben Carson: \"Islam is not consistent, not compatible with the Judeo-Christian Values and Principles of America, the U.S. Constitution, Sovereign Individual Freedom and Liberty Dr. Ben Carson nailed it on the head, and like Trump, is not 1 ounce of 1 iota fearful of any biased politically correct media backlash because he states the truth as it is, not as they want it to be. Those who are ignorant of the Islamist threat and unwilling to confront it, will be conquered, subjugated, enslaved, raped, tortured, and exterminated over time. David Wood on Islam's 3 stages of Jihad @webpagelink","post_message":"\"Huma’s history includes her past work at an Islamist periodical, the Journal of Muslim Minority Affairs (JMMA). The journal was founded by a man named Abdullah Omar Naseef, who would later go on to aid Al Qaeda’s operations worldwide.\"  MORE..."},{"comment_id":"1334018773303346","commenter_b":"Lol you need to work a lot harder to be crowded like India or China😂😂😂 but real talk tho, the US is currently taking up way too much resources for it's population. And if this population spikes, there are gonna be some shortages and wars...","commenter_a":"I am against both an my reason is. That our country isn't growing by size but we keep letting in millions every year one day this country will be over crowded like India or China","post_message":""},{"comment_id":"1717265371820481","commenter_b":"Calling for a border restored and a return to LEGAL immigration IS NOT RACIST. We will not give our country to you - but you may join our country if you ask! VOTE TRUMP!","commenter_a":"Go trump","post_message":"BREAKING: Anti-Trump protesters rally at Columbus Circle and are heading to Trump Tower. Are you there? @webpagelink"},{"comment_id":"596781463820482","commenter_b":"IF YOU HAVE A PENIS YOU DO NOT BELONG IN THE WOMAN BATHROOM! GIRLS NEED TO LEARN FOR THEIR OWN PROTECTION TO KICK A GUY IN HIS BALLS IF HE MAKES ANY MOVES TOWARD HER!","commenter_a":"Just asking for big trouble to start","post_message":""},{"comment_id":"1009830989039949","commenter_b":"Don't even watch the view anymore.. THose women have so much anger in them.. They never say anything nice about anyone.. Joy was off the show for awhile,, needs to stay off the show.. Just my opinion..","commenter_a":"Who in the Hell is Joy Behar, and why is anybody listening to her or her or anyone on the View?","post_message":"Joy Behar calls out Carly Fiorina.  Is she right?"},{"comment_id":"1720867398159945","commenter_b":"She's a basket case.","commenter_a":"@username he absolutely rekt her","post_message":"Sparks just flew at the Democratic debate. Bernie to Hillary Clinton: \"Excuse me, I'm talking.\"  Video by Occupy Democrats, LIKE our page for more!"}]
