[{"comment_id":"10153643721675399","commenter_b":"Couldna said it better! <3","commenter_a":"Well, Clinton IS the least batshit crazy Republican running...","post_message":"He also called Trump a 'narcissistic BULLYionaire'"},{"comment_id":"1178538995510357","commenter_b":"I would have moved too.","commenter_a":"Ungrateful people if they really look at the whole picture officers are out there protecting us,don't judge the rest because of the other bad apples.Now they got to deal with criminals and the society plus news reporters.Too bad the officers can't close their eyes and walk away and say I don't want to help you guys!!!!!! But they swore under oath they will serve and protect you!!!!!!!","post_message":"The officers even covered the couple's tip."},{"comment_id":"641559742659462","commenter_b":"This woman is either a complete idiot or a pure propagandist.","commenter_a":"Oh how people forget that gore won the votes of the people","post_message":"'Not since the American Revolution has the ruling class tried so hard and so blatantly to take away our vote.' – Judge Jeanine Pirro @webpagelink"},{"comment_id":"10153523768927293","commenter_b":"Thank you!","commenter_a":"What do you mean by white? there are white latinos i.e. latinos of European origin, so it isnt about race? pigment and having a tan or lack of deosnt define a race....cleopatra, moses, werent caucasion? what were they then? most experts say caucasion includes indians and that middle eastern are essentially white - although some can be mixed race .. so what exaclty do you mean and why do you care so much? We could find examples of many blacks playing white characters - very common in shakespeare...so keep your racial obsession and race baiting to yourselves please WP!!!","post_message":"From “West Side Story” to “The Birth of a Nation,” watch 13 times that a white actor portrayed a non-white character on the big screen."},{"comment_id":"1337533142938860","commenter_b":"an untalented hooker","commenter_a":"That creepy dame who's his spokes person ought to be banned from every network and media outlet.","post_message":"Whoa, CNN grew a backbone! After what was said, he should be banned from America."},{"comment_id":"10152906075606336","commenter_b":"'@webpagelink In case you wanted to read the rest of what Seth Rogen had to say, not just the original tweet that was blown WAY bigger than it needed to be.","commenter_a":"Well said craig","post_message":"Country music singer and military veteran Craig Morgan fired back at Seth Rogen for his American Sniper comments. @webpagelink"},{"comment_id":"532937326855044","commenter_b":"She takes no responsibility. She whores and takes no responsibility because it is his fault. Logic?","commenter_a":"A Hole..step up to the plate and accept your responsibility!!","post_message":"What a piece of sh*t   | Liz"}]
