[{"comment_id":"10156595781460192","commenter_b":"Not Christian not even NICE!","commenter_a":"Lets just all work to eliminate race ...that so hard","post_message":"What are your thoughts on this sign?"},{"comment_id":"1190973280940010","commenter_b":"All these lackluster punks would do anything for the limelight even give Killary 8 years in White House. Just punks selling junk.","commenter_a":"I used to always watch and listen to GB. No more, lost a lot respect for him.","post_message":"GB getting shoot notes from his team."},{"comment_id":"10157044490065093","commenter_b":"The only con-artist is Hillary!","commenter_a":"Wow. You work so hard to justify your position. What a word smith. What's your answer. Third party's ? Just how would that work? How would you fix it. You complain but you don't have any idea of merit to beat Clinton except trumps is wrong. A lot of us know he is a jerk and all the other adjectives. But unfortunately in life we have to make unsatisfactory choices when there are no other options. We have no other options except staying home and electing Clinton.","post_message":"\"I'm talking about his core supporters, the people who didn just enthusiastically buy his con, they helped sell it to the rest of us.\" -- David French"},{"comment_id":"1204607766260053","commenter_b":"Crazy woman","commenter_a":"Why is she even in the news? What is wrong with people that will send her money for this fruitless action...how stupid can you be?","post_message":"WOW! JILL STEIN'S 'FIRESIDE CHAT' Exposes Her Delusion On Recount [Video]   Jill Stein trying her best to remain relevant!"},{"comment_id":"611157035758918","commenter_b":"Deport them","commenter_a":"I would hope the FBI is investigating this organization for violating a US law!","post_message":"The \"religion of peace\" strikes again..."},{"comment_id":"10154192129196176","commenter_b":"The average lifespan of a giraffe is 25 years","commenter_a":"I feel several brain cells dying from reading these comments.","post_message":"Baby watch! Do you think April the giraffe will give birth soon? All eyes have been on this sweetheart for a couple of days now. (Video courtesy: Animal Adventure Park in New York.)"},{"comment_id":"10152898604455927","commenter_b":"She will get away with her lawlessness","commenter_a":"As soon as you hold the Bush administration responsible for the millions of emails that disappeared in thin air.","post_message":"Hypocrisy abounds!"}]
