[{"comment_id":"10158323534995594","commenter_b":"Stupid idiot. He is not sending out legal immigrants.","commenter_a":"Closing stores and businesses won't make America Great Again","post_message":"“I feel like I want to put the message out that I am ashamed that I gave him my vote, and I wish I could repeal and replace my vote for him.”"},{"comment_id":"10154479545156320","commenter_b":"Because of a speech. Sheeeesh","commenter_a":"What an amazing speech by everyone last night at the convention.I really think Hilary Clinton will be the President of the United States of America.","post_message":"12 years after rising to national prominence at the 2004 DNC, President Barack Obama took to the convention stage to try to bolster Hillary Clinton's candidacy to succeed him. #DemsinPhilly"},{"comment_id":"10156586840470147","commenter_b":"Tildon Peacock, so using your guidelines, abortions should only occur when there was rape?","commenter_a":"The law already acknowledges the unborn child as a human being. If a pregnant women is murdered, it's classified as a double homicide. Regardless, it should have a right to live as we all had the opportunity. If society calls a germinating seed a plant, we can call an unborn child a human being with rights.","post_message":"Wow..."},{"comment_id":"910291425675761","commenter_b":"Throw her out of the white house.","commenter_a":"let the book burnings begin..then kristellnacht...then relocation camps","post_message":"Are you at all surprised by this?"},{"comment_id":"999294776794334","commenter_b":"An epic read to do at 5.45am but i feel it went nowhere","commenter_a":"Sean Weir @username","post_message":"What if you found out there was a key that would enable you to open and close your doors of perception at will, void of psychedelics? What if you found out you not only held the key, but you were the key? Would you unlock the doors, or keep them shut? This is a good read."},{"comment_id":"590301711160408","commenter_b":"She looks to be about 100 years old in this photo, Ban her ugly mug from FB","commenter_a":"When she becomes a licensed nutritionist then maybe somebody might listen to her. Her plan not only sucks but it is no where near the enough food. A child needs more than 200 calories for lunch.","post_message":"What Michelle Obama is banning now is just plain unacceptable. The American people are tired and finally fighting back. Do you agree Michelle Obama should mind her own business?"},{"comment_id":"1672968102966647","commenter_b":"@username If she's 201 lbs I'm a dolphin.","commenter_a":"Plus sized? She's not even rubenesque. A way to help Sports Illustrated tell if their model is plus size or not to ask ask \"if we don't tell people she is plus size, will anyone know?\"","post_message":"A trailblazing move by Sports Illustrated Swimsuit."}]
