[{"comment_id":"1145080512196207","commenter_b":"@username, no. The crime is to be caught crossing the border into this country. Once you're in the country, it is a CIVIL offense and people are due a hearing and disposition before a judge.","commenter_a":"It'll literally distract them from focusing on real crimes","post_message":"\"If the federal government takes a more aggressive role on deportation, then they’ll have to do that on their own.\""},{"comment_id":"10155187026858984","commenter_b":"I caught the statements that's she was making. I'm glad she wasn't as blatantly shoving her opinion down people's throats as Beyonce did. I applaud her professionalism but I still find her and her music repulsive. On a separate issue, how does get eaten alive for her unoriginality? It's like she can't decide who she wants to rip off more, madonna or David Bowie.","commenter_a":"Anyone who knows the meaning behind This Land is Your Land knew she made a political statement. I don't think that was very many trump voters, though. Her subtlety is what was appreciated by them because they likely missed it and it allowed them to enjoy the show.","post_message":"Of all of the things Lady Gaga could have done during her Super Bowl halftime show, this was perhaps the most shocking... and the most unexpected."},{"comment_id":"10152685368712507","commenter_b":"So, we can therefore classify modern business as \"irresponsible\" capitalists, right?","commenter_a":"\"How to fix inequality\"??? REALLY?!! C'mon guys! That's almost as absurd as \"fixing climate change\"!! With all due respect, is there anything that's just TOO DAMNED STUPID to write? Anything at all?","post_message":"There's no easy solution."},{"comment_id":"1742093019366838","commenter_b":"SUCKS","commenter_a":"Lisa Nicklas Villota!!!!!","post_message":"Thank you to the LGBT community! I will fight for you while Hillary brings in more people that will threaten your freedoms and beliefs."},{"comment_id":"519430408242325","commenter_b":"What do expect from narcicistic bullies? They steal cheat etc...go figure....most poor folk who steal get arrested..why not trimp chimp rabid rat","commenter_a":"Well it's nice to see how Trumplestiltskin would use Meredith McIver as a scapegoat for that plagiarized speech that dipstick Melanoma Trumplestiltskin gave!! C'mon, surely you can see through the Trumplestiltskins I mean honestly am I the only one!? LOL!!","post_message":"Meredith McIver is listed as a co-author with Donald J. Trump on several of the books he's had his name on spanning more than a decade."},{"comment_id":"1734008936814080","commenter_b":"Kill them all with the wall","commenter_a":"Now time to sue the ones that let this happen","post_message":"Unacceptable..."},{"comment_id":"10153353653386051","commenter_b":"Get in his ass!","commenter_a":"No more tacos or carne Asada for this loser.","post_message":"This man killed a police officer – and then laughed about it. Here's what happened to him in Texas yesterday. Do you consider this justice served?"}]
