[{"comment_id":"1765614553704778","commenter_b":"Congress has the power to IMPEACH HILLARY now for all the massive lies & corruption at its highest level. Ask your Congress person WHY THEY ARE NOT?? Where is the integrity of Congress?","commenter_a":"So the White House knew full well about Hillary's email after all .. one false narrative after another. This nation cannot survive another 4 years of corruption like this!","post_message":"\"The IT professionals who whitelist devices at places like the White House only add the email addresses authorized by management.\""},{"comment_id":"10153306961394087","commenter_b":"Build that big beautiful wall!","commenter_a":"The Trump Haters are the biggest whiners and cry babies in America ! Say all you want ,Hate all you want !.. But you cannot stop the train from heading to the White House !.Donald J. Trump for President 2016 !","post_message":"\"I don't know if that's because she is incompetent, or she doesn't like me or maybe she's given instructions from up above,\" Donald J. Trump said about CNN reporter Sara Murray after accusing her of purposely not recording the large crowds outside Trump's book signing event in New York."},{"comment_id":"1118891848162172","commenter_b":"YES! And I hope they do throw her in jail!","commenter_a":"WTF!! Put her ass in jail! She is just as guilty, that's premeditated...she knew about the plan and let it happen","post_message":"She reportedly \"tried to talk him out of it,\" but that's it."},{"comment_id":"10153798584711350","commenter_b":"You need attention like that idiot cutting herself.","commenter_a":"She's trying to commit suicide by cutting her upper arm. She's an idiot. A bridge or high building is what she needs to do. Cutting her arm is just a cry for attention.","post_message":" a teenager is hard, school sucks, parents are lame but life has so much to give you.\""},{"comment_id":"1099042766785437","commenter_b":"Glad she got her life back by killing another person. Ain't life grand!!","commenter_a":"You make me ashamed to be a woman, disgusting","post_message":"She got her life back at the expense of another."},{"comment_id":"10153392928479170","commenter_b":"Don't you feel safe now that the country is being run by grunge mosh pit princesses like this character?","commenter_a":"She is a leftist loon with zero common sense. A perfect fit for the Obama team.","post_message":"The woman who gave you \"jobs for Jihadis\" is now working on the Iran nuclear deal. Time to \"Duck and Cover.\""},{"comment_id":"1283735711683013","commenter_b":"horrible woman","commenter_a":"How bitchy she is...very bad attitude though","post_message":"The Hungarian camerawoman who tripped and kicked migrants has been sentenced."}]
