[{"comment_id":"1713218088954908","commenter_b":"@username when have I blamed Muslims for everything? I am so sorry you think that but you have a right to your opinion. I do not hate Muslims I hate that there are Muslim extremist that are going against Israel and want to take what is theirs and deny them their rights. God gave them Israel and Jerusalem is their capital city. Muslims do not worship our God and they want to kill those that do not worship their God. So?","commenter_a":"Amen!! What a terrible screwed up country this is. Need more God in it and less evil. Who cares if the unwanted Muslims are offended ?? Go back to where you came from!","post_message":""},{"comment_id":"10153376841020329","commenter_b":"Lel bc cats was one of them","commenter_a":"Madeleine Chetcuti @username @username 33...","post_message":"Break a leg!"},{"comment_id":"10154280732936336","commenter_b":"Agree100%","commenter_a":"How is this discriminatory? Use the bathroom according to your plumbing not your frame of mind. What about the civil rights of those who don't want to share the restroom with those of another gender? If a transgender earns money they pay taxes according to their earning not what they think they should pay. I'm really tired of a few people re-writing the moral and cultural standards for the nation.","post_message":"\"I’ll make a decision in 24 hours.\""},{"comment_id":"1025383310891326","commenter_b":"Domestic terrorists!","commenter_a":"We need to bring the military to go against the Black Panthers they are a militant extremist group they are all converted over to Muslim and don't we have a problem with radicalized Muslims same as Isis this is a military action but of course we have a Muslim president that will do absolutely nothing but shift to new gun control","post_message":"Not a good sign."},{"comment_id":"934017173381331","commenter_b":"You keep having your exercise interrupted by having to go pee. There I said it","commenter_a":"Duh, coffee is a powerful drug, of course things feel better when yer buzzed","post_message":""},{"comment_id":"1203286669686614","commenter_b":"I am not sure where you, Harry Reid are coming from. This bill is not for or against immigration, it is against illegal immigration. Why are you against protecting the USA against illegal acts? The best thing we can do for the USA is have the exact same law for illegal immigrants as our neighbors to the south. Let us have the same illegal immigrant laws as Mexico, then there will be no thought or comments about being wrong or too tough. Yes?","commenter_a":"The vilest thing in the Congress are you sir!","post_message":"The vile legislation that is now before the Senate might as well be called the \"Donald Trump Act.\" Like the disgusting and outrageous language championed by Donald Trump, this legislation paints all immigrants as “criminals and rapists.” Local law enforcement officials, domestic violence groups, immigrants’ rights groups, mayors, faith leaders and labor groups all oppose the \"Donald Trump Act.\" This bill does nothing to keep Americans safe, and it certainly does nothing to address our broken immigration system."},{"comment_id":"10156467558905725","commenter_b":"I knew it too good to be true!","commenter_a":"Hard to believe this thing he say????","post_message":"If you’ve been on Facebook in the last few days, you might have noticed a number of friends posting a status thanking Zuckerberg for giving away a portion of his $45 billion to lucky Facebook users ----> @webpagelink"}]
