[{"comment_id":"10154742011562908","commenter_b":"Stfu","commenter_a":"Raise taxes on corporations they either go overseas or pass the expense on to the consumer. Bernie can't tax enough to pay for free everything.","post_message":""},{"comment_id":"10154822738529369","commenter_b":"You know she had to be shitting her pants up there","commenter_a":"Shell be alright it another Trump curve ball","post_message":"A Clinton campaign representative told NBC News that the campaign had \"no idea\" what Comey was referencing in the letter he sent Congress on Friday."},{"comment_id":"10153049677426051","commenter_b":"She's in her 20's?? Seriously at first glance she looks like an old woman, she needs to lay off the drugs","commenter_a":"Damn.!!!","post_message":"A customer was walking through the Walmart parking lot when she noticed something odd about a nearby green Hyundai. After taking a quick peak inside, she immediately called 911."},{"comment_id":"610661985768228","commenter_b":"white kids of lower middle class know what it is like to be in those areas of transformation and watch their towns become unsafe ghetto's. These immigrants always come forcefully in the streets to establish turf and whites have dealt with it from every race that comes in. don't know ghetto's eh, some of us know and were forged in them. what an ill guided statement to make","commenter_a":"Love the positive comments here, and even if theres negative comments bernie will always have a great comeback as he did in the debate last night. This man deserves the title of president. So much can come from this stop thinking about it & vote for him","post_message":"I am very proud of being Jewish, and that is an essential part of who I am as a human being. My father’s family was wiped out by Hitler in the Holocaust. I know about what crazy and radical, and extremist politics mean. I learned that lesson as a tiny, tiny child when my mother would take me shopping, and we would see people working in stores who had numbers on their arms because they were in Hitler’s concentration camp."},{"comment_id":"10153107776462377","commenter_b":"Trump 2016","commenter_a":"The American people.","post_message":"Newsmax is conducting an urgent online poll asking Americans who won the 3rd GOP Debate hosted by CNBC. Was it Trump, Carson, Rubio or another candidate? Vote here now: @webpagelink"},{"comment_id":"840419212729882","commenter_b":"Noone else to vote for... #Cruz #Ca #DudesDontPeeInTheGirlsRoom #NeverTrump #NeverHillary","commenter_a":"More republicans don't want Trump than support him. I will be voting Ted Cruz and will say for those who have not yet voted, especially in California, please vote Cruz (assuming he’ll still be on the ballot.) In the meantime, it’s time for the Republican Party comes to its senses and throws Trump out of its ranks and exclude him from eligibility for its presidential nomination.","post_message":"So many people are using what happens now as a springboard for the future."},{"comment_id":"10153590637376336","commenter_b":"Nuclear is clean efficient and it's a country's pride! Do you know ordinary Iranians are really nice folks?","commenter_a":"Boy this Iran sure wants nuke power really bad, but what I don't understand is why they need nuke power to light up clay homes in the desert. Does anyone else see a different picture? America used wind, coal, steam as a first time power source.","post_message":"Iran will reportedly be allowed to use its own experts to inspect a site it allegedly used to develop nuclear arms under a secret agreement with the International Atomic Energy Agency."}]
