[{"comment_id":"10152628178977016","commenter_b":"Brainwashed female.","commenter_a":"I sympathize with her feelings, but do believe that never including those with whom we disagree in any discussion only solidifies the differences. Perhaps something of event speakers' words sank into W's cranium. Perhaps his presence will help some haters think twice about their positions.","post_message":"Civil rights movement leader Diane Nash calls former President George W. Bush's attendance at Selma anniversary \"an insult to people who believe in nonviolence.\""},{"comment_id":"10155235641066037","commenter_b":"Very true, so it's OK for them to think they can sneak in because they can't afford to become a citizen? We have plenty of people out of work and those are jobs the unemployed could be working now isn't it. No wonder Trump wants to cut funds to these city's. That opens up more jobs to Americans, because there is a minimum wage in states and you are not suppose to hire illegals.","commenter_a":"Sanctuary city's think the above the law and don't have to enforce the law.","post_message":"\"I don't have a clue,\" said U.S. Homeland Security Secretary John Kelly."},{"comment_id":"754838434706734","commenter_b":"Oh God, the taxes, the illegals working for him, the handicap man with evil intentions, and now a rape! Next anything against Mr. Trump, please, lol Your evil would not be able to destroy Mr. Trump! Don't waste your time!","commenter_a":"Wtf ever stop grasping","post_message":"BREAKING: Trump Engulfed In MASSIVE Rape Scandal   This could end his campaign right now. Let's show our support.  Can we get 30,000 'LIKES' for Donald Trump?"},{"comment_id":"10152715468475736","commenter_b":"Well, it would also be illegal to shoot undocumented immigrants.","commenter_a":"SHOOT ON SIGHT.","post_message":"The sea lions are making their way into town now! (Well one of them is.)"},{"comment_id":"880663015326781","commenter_b":"Alex Peterson hahahaha","commenter_a":"Tyler Simmonds @username Ashley Mckendrick","post_message":"Dolphin seduced me, claims man who had sex with marine mammal."},{"comment_id":"1765015350452806","commenter_b":"This tells the whole story.","commenter_a":"Why can't people understand that the Clinton's are career politicians who amassed millions for themselves while being public servants and working in government? While working \"supposedly\" for we the people, they became millionaires. The same group of 1%s Hillary rallies against she is card carrying a member of.","post_message":"Don't let U.S. Senator Tim Kaine fool you -- the Clinton Foundation is a bastion of corruption."},{"comment_id":"10156951027285725","commenter_b":"Redicous...sounds French.","commenter_a":"THIS IS REDICOUS","post_message":"Hold on to your $20s, they'll soon be a piece of history. @webpagelink"}]
