[{"comment_id":"1461062437286833","commenter_b":"Glad he found out before she gave him a STD nasty hoe","commenter_a":"who cares","post_message":"Brutal. (From Elite Daily)"},{"comment_id":"10155990261480354","commenter_b":"Stupid Bitch","commenter_a":"She couldn't try to offer the woman comfort in her last moments on earth? This young woman is cold hearted.","post_message":"Caption under the controversial photo translates: “I went to do the rounds and this lady was dying so selfieeee.”"},{"comment_id":"1162051423814886","commenter_b":"What is a liberal?","commenter_a":"Keep it up NBC your imaginary war on Trump is backfiring on you and fox! The more you bash the better he appears! He represents the millions you ignored for the last eight years! The people are turning against the press and are taking what he says to heart! Many Republicans and Democrats like him!","post_message":"Trump said the female journalist who moderated the GOP debate had \"blood coming out of her eyes, blood coming out of her wherever.\""},{"comment_id":"1670513393170878","commenter_b":"Hey he's jerking with his shit as lube on his pussy","commenter_a":"Wow it takes like 15 or more cops to take down 1 fucking guys.....pussy as pigs","post_message":"The most glorious thing we have ever seen. #thinblueline Footage from moments ago when protestors shut down HWY 70 near our shop. When the SHTF make sure you have the right SH*T @webpagelink"},{"comment_id":"928965170496565","commenter_b":"They where good and did what they meant to do make us laugh, well done ladys","commenter_a":"As a woman seeing women strip down does not make me proud to be a woman. Keeping their clothes on and becoming doctors, lawyers, or a different type of role model would.","post_message":"'You make us proud to be women'"},{"comment_id":"976274442437807","commenter_b":"I never liked her fake ass!!!","commenter_a":"Yes.","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"10152934156123067","commenter_b":"Molested. Josh should not have Molested his sisters or any other person.","commenter_a":"Josh should not have touched his sisters.","post_message":"\"If I could build a time machine, this wouldn't have come out in the first place,\" Washington County Attorney Steve Zega told CNNMoney. @webpagelink"}]
