[{"comment_id":"10154087182591409","commenter_b":"'@username Michelle had to keep her legs closed or her dick would fall out!","commenter_a":"Lisa erikson just because Hillary hasn't been charged and found guilty doesn't mean she's not. She's a liar and as crooked as Obama and Michelle on many levels. Keep lying to yourself.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10158427286480206","commenter_b":"Where were these feminist when Bill was galavanting around town assaulting women and Hillary was defending him?","commenter_a":"Wonder if they 'smoked' cigars afterwards, with Bill.... 2016, the year that people protested over a word... terrific.","post_message":"A mostly-female crowd chanted 'GOP, hands off me and 'Trump thinks he runs this town, p---y came to shut it down' outside of Trump Tower."},{"comment_id":"10156005617690725","commenter_b":"Loved Trump's speech!","commenter_a":"What's your thoughts on the confederate flag or the MS state flag, Mr Trump?","post_message":"#MakeAmericaGreatAgain #TrumpRallyAL"},{"comment_id":"10153003184965671","commenter_b":"Remove the millions of illegals. It may be a smaller piece....but it is still huge.","commenter_a":"Somewhat comical given the subject. If you're really worried about climate change and water, STOP GRANTING BUILDING PERMITS that CONTINUE to INCREASE California's population and water requirements.","post_message":"'Longer fire seasons, extreme weather, and severe droughts aren’t on the horizon, they’re all here – and here to stay. This is the new normal. The climate is changing,' Brown wrote in a letter addressed to Donald J. Trump.   Thoughts?"},{"comment_id":"10153760564233812","commenter_b":"Douche","commenter_a":"Well, they did turn off the steelers radio headsets, but hey it is the cheating Pats!","post_message":"With 'Deflategate' behind him, Tom Brady was back to his unstoppable self: @webpagelink"},{"comment_id":"10153660041871770","commenter_b":"Shes a idiot to.like we care what a gold digger has to say oh she fits in with crooked Hilary","commenter_a":"Who cares care","post_message":"What?!"},{"comment_id":"370042553184039","commenter_b":"marriage was not meant to be a shitty relationship depends have a market I would like to invest","commenter_a":"evolution and same sex cannot coexist","post_message":"POLL: God's design for marriage? (man and woman)"}]
