[{"comment_id":"10153237461976367","commenter_b":"You ladies make a youngen proud :))","commenter_a":"As an older feminist, I have looked forward to the chance to vote for a woman for president for many years. I will be voting for Senator Sanders instead because his willingness to look at everything and proposed changes would improve the lives of millions of Americans. Women and men. A rising tide floats all boats.","post_message":"Would Sanders or Clinton do more to improve the lives of women in the United States?"},{"comment_id":"10154648260827550","commenter_b":"That's fine! Welcome to all who want to come to America LEGALLY.","commenter_a":"Grew up in a farming family. I admired and respected the migrant workers' desire to find a better life here in the United States.","post_message":"Do you support a border wall with Mexico?"},{"comment_id":"10153444104128690","commenter_b":"Americans breed Christians at alarming rates... They have taken over.","commenter_a":"stop buddist terrorist!","post_message":"The group has stoked anti-Muslim sentiment by saying Muslim communities have high birth rates and will eventually overrun the predominately Buddhist country even though they currently represent less than 10 percent of the population. @webpagelink"},{"comment_id":"10154343689874094","commenter_b":"People know who she is. She will get whats coming to her","commenter_a":"Hopefully she'll get caught out on a camping trip and be torn apart slowly by wolves.","post_message":"Roadrunner the dog's injuries were so severe that a veterinarian had to remove his eyes."},{"comment_id":"10154424065382885","commenter_b":"If I'm not mistaken your authorized to wear awards from other services you earned. I know in my unit former Marines would wear their aviation badges.","commenter_a":"The officer in this picture is wearing a Navy Fleet Marine Force Breast insignia, Navy Conduct Medal, Navy and Marine Corps Achievement Medal ... weird","post_message":""},{"comment_id":"2081524555405540","commenter_b":"SHUT THE F UP! People like you are the Cause!","commenter_a":"You are a complete fool. America needs to bring God back into our nation. Then senseless killings and hatred would cease. All life matters.","post_message":"Here are Lena Dunham's TWEETS about \"White Americans\" in the wake of Alton Sterling's death..."},{"comment_id":"10156240306950551","commenter_b":"God, this women is a beast.","commenter_a":"Then bitch move to Africa.","post_message":"This woman is RACIST!"}]
