[{"comment_id":"10153866102494160","commenter_b":"Guess he ought to have plenty of money to go on vacation about ten times a year.","commenter_a":"'@webpagelink payments By Morgan Chalfant Published March 18, 2016 Washington Free Beacon President Obama sought to increase the amount of money available for the federal government to spend on former presidents in advance of his White House exit. In his budget requests for fiscal years 2016 and 2017, Obama proposed hikes in the appropriations for expenditures of former presidents, according to a report from the Congressional Research Service published Wednesday. The report, which discusses the pensions and other federal benefits offered to former commanders-in-chief by way of the Former Presidents Act, specifies that Obama’s 2017 budget proposes a nearly 18 percent hike in appropriations for expenditures of former presidents. He successfully requested an increase in such appropriations for fiscal year 2016. “The President’s FY2017 budget request seeks $3,865,000 in appropriations for expenditures for former Presidents, an increase of $588,000 (17.9%) from the FY2016 appropriation level. The increase in requested appropriations ...","post_message":"Barack Obama's new digs come with a huge price tag."},{"comment_id":"10154921930118690","commenter_b":"Karim Alyaa Dina","commenter_a":"Bal","post_message":"Integrating into a new country can be hard. That's why Horst Wenzel is teaching refugees the ins and outs of German dating culture."},{"comment_id":"10154046898184199","commenter_b":"I think the verbal abuse has to be severe (to the point of verbal battery) before they will enforce it but this is how the state has defined it but I'm not a lawyer and if theres a lawyer reading this could you please explain it better the rcw codes tend to be confusing.","commenter_a":"Ok so for the internet lawyers out there, or real lawyers, riddle me this: If I start cursing out someone on the street, can a cop arrest me? Have I broken the law?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153398381514364","commenter_b":"Social security is the world's biggest pyramid scheme. It will eventually crumble, and I have no doubt it will do so in my lifetime.","commenter_a":"I'd love to have my social security tax, 6.2% of my income, go into my 401k or Roth. I don't need the government to help me save for retirement.","post_message":"They aren’t being straight with the American people, and they know that."},{"comment_id":"1810739472541280","commenter_b":"Recount!! Recount!! Go girl! Hillary for president!!","commenter_a":"Will she be filing in the states won by Her?","post_message":"BREAKING---- Green Party Candidate Jill Stein Files for Recount in Wisconsin.... Where Trump won by almost 30,000 votes! Wow!"},{"comment_id":"585287011661878","commenter_b":"We don't need Muslims here for s*** this is America... They need to stay the f*** home...","commenter_a":"Get out of my country.","post_message":"Furious Muslim students rush stage during American Sniper showing.  They have no respect. If they don't like American Sniper they can leave.  Do you agree these Muslims are out of line?"},{"comment_id":"512162555660096","commenter_b":"'@username, Kanye will never be President.","commenter_a":"Trump","post_message":"WATCH: Video of full Donald Trump campaign rally in Phoenix, Arizona."}]
