[{"comment_id":"10153806862081167","commenter_b":"Maybe the whole NRA could be recalled.","commenter_a":"The Cash Box Rules! \" Let's Make America Great Again\" yeah right!","post_message":"After we called them out yesterday, Bud Light seems to realize that Ted Nugent's hate is bad for business."},{"comment_id":"10152893024866051","commenter_b":"Yeah ? How bout someone take a cane to your goofy ass an lets see if it looks like paint..Oh no...lets not.... forgot your ass looks like a map from rand mcnally with all those ugly stretch marks....yuck","commenter_a":"That looks like paint, not blood.","post_message":"This man’s wife has been found guilty of domestic abuse against him. Even she wasn't expecting so much jail time."},{"comment_id":"10153876245464411","commenter_b":"She's actually not Austrian. Quit with the PC BS.","commenter_a":"She got what she deserved. Make up your fucking mind and stick to it.","post_message":"Unconfirmed reports of the 'poster girls' fate also circulated last year, with UN counter-terrorism expert stating that one had been killed in fighting and the other had disappeared"},{"comment_id":"1738525546372400","commenter_b":"Amen","commenter_a":"Amen","post_message":""},{"comment_id":"10153009843726378","commenter_b":"A female can't be a predator","commenter_a":"So if a forty year old woman had sex with your sons you'd cheer him on and joke? What about a forty year old man that had sex with your 15 year old daughter? Because according to these comments no one cares about female predators.","post_message":"GUILTY PLEA: A former Baltimore Ravens cheerleader pleads guilty to raping a 15-year-old boy."},{"comment_id":"10155515421201509","commenter_b":"That woman is the devil incarnated in a human body.","commenter_a":"Change profile pic to RED to show your support of TRUMP/PENCE","post_message":"\"I will not defend or endorse @realDonaldTrump, but I am voting for him. HRC is that bad. HRC is bad for the USA\" the House Oversight Committee chairman tweeted."},{"comment_id":"10153317149514087","commenter_b":"@username Ok I demand that and also anyone who rents to an illegal be punitively fined. Good enough? Oh yeah and build that wall and shovel the illegal bastards out of the country. Ok Tommy-boy?","commenter_a":"No the majority of Americans do not want to keep the illegal bastards, but they do want immigration reform- it's called a wall! To hell with Sanders vote Trump!","post_message":"“We cannot and must not sweep up millions of men, women and children, many of whom have been here for years, and throw them out of this country,” Bernie Sanders said Monday. “As president, passing a legislative solution to our broken immigration system will be a top priority. But, let me be clear—I will not wait around for Congress to act.”"}]
