[{"comment_id":"799197103604200","commenter_b":"Um Death, that's a No fucking brainer","commenter_a":"He needs to be in front of a firing squad. He appears to be full of racial hatred.","post_message":"BREAKING: Black Lives Matters Shooter Kills 7, Wounds 30 [VIDEO]. Things are getting out of control. They need to be stopped. What do you think his punishment should be?"},{"comment_id":"10153088167230329","commenter_b":"jajajajaja pa que andas viendo esas cosas , si da asco su lombrizota!","commenter_a":"@username. Vivian Lord Pussyfer. No mameeeees me quería morir, grite y casi lloro y seguramente no dormiré jamas","post_message":"¡Qué asco! Via: [[ BuzzFeed Español ]]"},{"comment_id":"10154800367722293","commenter_b":"@username Human rights should always supersede law otherwise we are no better than the Muslim extremists we criticize so much (for good reason). Yes, we need to have strict immigration laws but due to our decades of non-existence of it due to the fact that we can profit from it, people shouldn't be punished and exceptions to the rule would exist. There are undocumented people who have been here all their lives, kids who know no other home than here and good tax paying people. Criminals - yes get them out. Instead of a wall use technology and more man power at the border. Create temporary work visa give. By employer, families who are working and are not a burden to the system can stay. There are better ways.","commenter_a":"\"let us all unite. Let us fight for a new world - a decent world that will give men a chance to work - that will give youth a future and old age a security. By the promise of these things, brutes have risen to power. But they lie! They do not fulfill that promise. They never will! Dictators free themselves but they enslave the people! Now let us fight to fulfill that promise! Let us fight to free the world - to do away with national barriers - to do away with greed, with hate and intolerance. Let us fight for a world of reason, a world where science and progress will lead to all men happiness. Soldiers! in the name of democracy, let us all unite!\" - Charlie Chaplin, \"The Great Dictator\" (1940).","post_message":"Trump vow of mass deportations could soon become a reality."},{"comment_id":"1180596495393685","commenter_b":"We ain't going to miss you don't let the door hit you on the way out","commenter_a":"He accomplish nothing but racial tension","post_message":"Here is how Americans feel about Obama as he leaves office. Are you proud of what he accomplished for our country?"},{"comment_id":"944507348950462","commenter_b":"this women is a moron!!!","commenter_a":"are you sure her last name isn't Clinton?","post_message":"Furious Germans Send This 20 Ton “GIFT” To German Chancellor Who Demands Muslims Be Let In These people mean business. Spread this absolutely everywhere."},{"comment_id":"971095776261096","commenter_b":"#CottonCancer","commenter_a":"NO! I don`t even like Corn when it is too sweet,so i know i would not like fruit that is...and it cannot be good for us.","post_message":"Yes, \"cotton candy\" grapes are a thing."},{"comment_id":"1354573844595375","commenter_b":"wELL LET THEM TERRORIZE THEM AND THIER FAMILIES AND LET'S SEE HOW QUICK SHE REPEATS THIS ASSINIGNE REMARK","commenter_a":"Send these twits over there to give them love and hugs.","post_message":"Oh brother!"}]
