[{"comment_id":"10155094877376037","commenter_b":"She deserves the same treatment.... sick sick sick nasty woman. She doesn't deserve life","commenter_a":"Where's the picture of the mother?","post_message":"14-year-old Grace Packer was beaten, raped, poisoned and strangled."},{"comment_id":"10152617242161680","commenter_b":"@username When did DHS keep illegal aliens out ? They watch our borders watch them walk right in. DHS is a waste of taxpayers money. We have Military FBI & CIA.","commenter_a":"Republican Logic: \"We care so much about stopping illegal immigration that we're going to cut off funding to the Agency responsible for stopping illegal immigration.\" Just brilliant. Truly.","post_message":"Senate Democrats are considering a shift in strategy that could offer a resolution to a long Senate impasse over funding the Department of Homeland Security — and put more pressure on House Speaker John Boehner."},{"comment_id":"10153442091264877","commenter_b":"That's right, Westley :) * waits for the obligatory hoteper insult about evil black feminists*","commenter_a":"This song is not about Black women. At best, the song attempts to denounce negative stereotypes of Black men. I appreciate the effort, but he has a lot more work to do.","post_message":"David Banner Shows Support for Black Women in New Song 'Marry Me.' It's the rapper like you've never heard him before. Listen to the audio below.   Grio fam, what do you think of Banner's tribute? Sound off!"},{"comment_id":"1126715847370658","commenter_b":"A very excellent metaphor. Kinda bugged that I didn't come up with it myself!","commenter_a":"Ok, lets operate in the realm of hypothetical for a moment. Assume, if you will, the following: 1) There is a civilization capable of inter-solar system travel. 2) They would be bothered enough to interact with a species that cannot manage such travel. 3) We could hope to withstand attack if a species fulfilling [1] and [2] decides that we aren't worth keeping around. It seems to me that such a civilization, if it exists and meets those conditions, would be able to discern the effect of the gravitational field produced by our humble planet. To make it invisible in a visually perceptive sense is naive and utterly useless in the face of such circumstance.","post_message":"Should we be hiding?"},{"comment_id":"592518337598551","commenter_b":"Let's ban camel rapists","commenter_a":"No.","post_message":"NO!"},{"comment_id":"10156147874195725","commenter_b":"YES AND TAKE GLENN BECK WITH HER.......","commenter_a":"Agreed.","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."},{"comment_id":"927307860637643","commenter_b":"Don't exist anymore? Are you serious?","commenter_a":"Kkk really doesn't even exhist anymore. And this has nothing whatsoever with the kkk. This dude was probably killed by other gang bangers and the gators got him. I would like to know where In the hell you come up with the kkk our of this story?","post_message":"It's looking like the police, the courts, the whole town are covering up for the KKK. What do you think?  From (Y) Counter Current News - MBD"}]
