[{"comment_id":"10153823780186051","commenter_b":"No. In fact, I wouldn't piss in her mouth if her teeth were on fire.","commenter_a":"Vote Blue no matter who!","post_message":"Simple question: Will you be voting for Hillary Clinton this November?"},{"comment_id":"522407631280177","commenter_b":"Translation: her vagina scares me.","commenter_a":"Maybe it is because Hillary Clinton is just plain unlikable. I am not a Trump fan but will hold my nose and vote for him over her. Her voice scares people, she just can't connect with anyone. She is the female John Kerry.","post_message":"Hillary Clinton and Democrats think  or hope  that once the primary wraps up, tensions will subside."},{"comment_id":"10153904097708984","commenter_b":"She's an American. Deportation isn't an option","commenter_a":"DEPORT THIS TRASH","post_message":"She's the biggest female star in Hollywood right now, and she just made a sickening claim about Christians and the cross of Christ.  This is just disgusting.   She has a new movie out. Let's make sure she doesn't make a dime off of us!"},{"comment_id":"10154271812178717","commenter_b":"Seems like all women think of is sex lol","commenter_a":"I would love to see the media dig deeper into this story--if possible. So many details baffle me. Why was she with Rood and Ross in the hotel room, sharing a bed? If sexual abuse/assault was part of this web that led to her death, I hope it's exposed and the appropriate people are charged.","post_message":"Jazzmyn Rood was sentenced Friday for her role in the 2015 death of Eve Tarmey. Details here: @webpagelink"},{"comment_id":"10152892004126051","commenter_b":"This sick woman took advantage of boys. This was not age-appropriate activity. Why can't you creeps see the truth in that? The kid who told did the right thing.","commenter_a":"Kids these days,when I was a teenager we dreamed of something like that happening to use but now these little sissy go crying to their mommies. don't figure","post_message":"Police took one look at what this woman did to kids at a bar mitzvah and arrested her as quickly as they could."},{"comment_id":"1709198036011185","commenter_b":"@username!!!! Stop!!!!","commenter_a":"Jenna Pitt @username","post_message":"The baby is the first in the continental U.S. to be born with the Zika virus-related brain condition."},{"comment_id":"408553512676250","commenter_b":"Eat dicks @username, you dumb fat bitch.","commenter_a":"I, a citizen of The UNITED STATES of AMERICA, am calling for the immediate arrest and trial of Barack Hussein Obama for treason, under Article 3 section 3 of the United States Constitution, for aiding and giving comfort to our enemies. If you agree, please copy and re-post.","post_message":"Montana is fighting the Syrian Refugee policy to the end. This is amazing. Can we get 95,000 ‘LIKES’ for Montana?"}]
