[{"comment_id":"10154240769776438","commenter_b":"@username No. You're being dishonest. The \"second amendment solution\" is to use the guns to kill people, and he was talking about his followers killing Secretary Clinton, and he was talking about his followers killing the judges she will appoint as President. You can try to say that he didn't actually think they would follow his advice, but you can't say that isn't what the words mean.","commenter_a":"Hmm I wonder if he's talking about the NRA? Taking things out of context, as usual","post_message":"\"Nothing you can do folk—although, the Second Amendment people, maybe there is, I don't know.”"},{"comment_id":"10152928923462293","commenter_b":"His twin appears normal. She also got a lead paint settlement?","commenter_a":"\"Didn't Die In Vain\" . . . but he lived in vain . . .","post_message":"Reports of Gray’s history with lead come at a time when the city and nation are still trying to understand the full ramifications of lead poisoning."},{"comment_id":"848788448587668","commenter_b":"@username is trying to use bully tactics to shut up anyone that doesn't agree with him. It won't work. We're fed up!! We will not call evil good and good evil, so crawl back to your safe space and stay out of the women's bathrooms!!","commenter_a":"I am NOT a bigot and i hate being told i am because i do not like what Target did.. that is crazy !! i really do not care what they do.. but not in the little girls room","post_message":"I hope this video makes the rounds....Target has completely LOST IT at this point....shame on them."},{"comment_id":"1236409066433862","commenter_b":"Clifford Maclean Losee","commenter_a":"Save your money you bunch of fruit cakes!!!! You might be able to afford things if you would quit donating to lost causes!","post_message":"Michigan certifies President-elect Donald J. Trump's win in the state, awarding him 16 electoral votes. @webpagelink"},{"comment_id":"1418440301796751","commenter_b":"Looks like even white deer are emboldened by a Trump presidency. They must be racist!","commenter_a":"They are beautiful. I would love to see one up close.","post_message":"This is a rare sight: Not one but THREE albino deer spotted in a yard in Wisconsin. One out of every 20,000 deer is albino, making them so rare they're illegal to hunt. MORE: @webpagelink"},{"comment_id":"1589013221321122","commenter_b":"Bring back War Crimes Donald! #MakeDonaldDrumpfAgain","commenter_a":"Mitt Romney was and still is a total lightweight! Time for a candidate who's the real deal! Time for Americans to play the TRUMP card!! Adios illegals!! #MakeAmericaGreatAgain #TrumpTrain","post_message":"WE WILL MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153615775017235","commenter_b":"In actuality, the video is being shown in reverse to make the officer look bad. He was actually using his gun to pull bullets out of the man in an attempt to save his life.","commenter_a":"I can show you a video where it looks like a deputy shoved a mans face into the wall. Then when you see it from the other angles you will see that the man tripped and the deputy tried to reach for him.","post_message":"Watch this. This is awful"}]
