[{"comment_id":"753406171459230","commenter_b":"She should be drawn and quartered. That will hush he up.","commenter_a":"Blacks are useless lot of people. over 90% vote democrat and are indoctrinated in marixist doctrine. useless.","post_message":"MSNBC's Melissa Harris-Perry slammed a Latino Republican guest for using the word “hard worker,” because to her, the term “hard worker” only applies to former black slaves.  Here's Mike Rowe's BRILLIANT response. Spread this everywhere!"},{"comment_id":"1703427863256710","commenter_b":"Like Hillary thinking people should vote for her just because she's a woman.","commenter_a":"Race is not what matters. It is what is in your cranium! Dr. Ben Carson said this and he is correct. How stupid is this woman and those who think race and gender are the most important things in this life!","post_message":"Too much skin in the game?"},{"comment_id":"10152962989707014","commenter_b":"Get rid of illegal non English speaking students whose parents pay no taxes and there will be loads of $ and all the scores will magically rise. I wonder what it would be like if American students were able to get attention in class?","commenter_a":"My daughter started at a Charter school when she was 4 years old K-6, proceeded to a public school in Jr High which she had to test into she was then placed in ALL honor classes and has maintained a 4.0 gpa now on her way to High School on Wednesday at the age of 13....So thanks Charter schools!!!!","post_message":"There's a huge waiting list to get into in a Valley Charter school. Find out why some 1,000 parents hope to get their kids enrolled."},{"comment_id":"10154491854776002","commenter_b":"Yeah, she's a great mother!?!? Ha. Get those poor kids away from her immediately; lock her away with the scum husband.","commenter_a":"Seriously-not only her but her husband has committed the same crime-hurting thousands of others-stealing money from the government and she wants a break?!!!!!!","post_message":"Washington is asking the judge for a massive break. The judge ordered her to serve four years in prison, but she is asking not to go to turn herself in for five years so she can stay home with the kids while their father serves his time for the same crime."},{"comment_id":"10155026545836337","commenter_b":"Not the worse but close.","commenter_a":"Chuck is on point","post_message":"WOW. Charles Barkley torched the entire NBA..."},{"comment_id":"10153526527726770","commenter_b":"What a buch of sissys can't block it","commenter_a":"It is this lack of backbone to do the right thing that is causing people to be so angry at the establishment! Stand up and be counted! You might be surprised at the response!","post_message":"A former Delta Force commander,says President Obama is letting terrorists flow across the U.S.-Mexico border --- and that Republicans are too 'paranoid' to stop it."},{"comment_id":"1225927100760651","commenter_b":"'@username And this from the person from Farmville?","commenter_a":"When do we decide that our gun culture is not worth another child dying? What a sad story. Prayers for her family.","post_message":"'She's not going to first grade, because he made a choice to pull out his gun,' Lilly's mother said. Read more: @webpagelink"}]
