[{"comment_id":"10153147282168701","commenter_b":"Shut up Leah Jesus Christ.","commenter_a":"GUILT BY ASSOCIATION! I GUESS IN AMERICA YOU CAN BE HELD RESPONSIBLE FOR WHAT OTHERS DO, I THOUGHT YOU WHERE INOCENT UNTIL PROVEN GUILTY, BUT THE WHORES OF SOCIETY-AKA THE NEW STATIONS, REPORTERS, OREGONIAN, HAVE TRIED, COVICTED, AND SENTENCED A MAN FOR CRIMES HIS GIRLFRIEND COMMITTED, SOME PRIOR TO THEM EVEN MEETING BUT SOME HOW IT IS HIS CRIME, SHAME ON YOU WHORES!!!!","post_message":"Here's the full resignation letter from Gov. John Kitzhaber, who says: 'I understand that I have become a liability to the very institutions and policies to which I have dedicated my career and, indeed, my entire adult life.'"},{"comment_id":"10153011056587169","commenter_b":"The go to feminist lie: blame it on 'Patriarchy'","commenter_a":"I want all my kids to be powerful, my sons and my daughters","post_message":"How do you raise a powerful girl and what does that mean? PBS Parents experts share their thoughts:"},{"comment_id":"10154374417982894","commenter_b":"Bitch u real life bitter","commenter_a":"Lol I hope someone run on stage and snatch that prosthetic belly off and expose her lying ass!!!!","post_message":"The Show Must Go On: Pregnant Beyoncé WILL Perform at Coachella...As of Now"},{"comment_id":"10154266644379087","commenter_b":"'@username news flash f*ck face, when he is in office in january, he will cut off 12 billion in aid to Mexico and hence they pay for the wall, stfu and deal with you LOST, LOST,LOST","commenter_a":"Not very Presidential attacking the Press that is protected by the 1st amendment. Can you imagine the Right Wing outcry if Obama had tweeted about the negative coverage he was receiving from Foxnews?","post_message":"Trump's tweet comes just days after telling '60 Minutes' he would be restrained on Twitter as president."},{"comment_id":"1353674218062160","commenter_b":"Dawn you're clearly a sexist. Lol.","commenter_a":"Yeah and the Republicans made such a big deal about Hillary's reset with Russia. The Donald just might sell out to Russia. Just how many millions did the Donald get from Putin?","post_message":"Donald J. Trump can scrap U.S. sanctions on Russia and other national security policies with just a signature."},{"comment_id":"10157196875835603","commenter_b":"She's still a liar!","commenter_a":"She belongs in jail!","post_message":"#BREAKING: Hillary Clinton has chosen Virginia Sen. Tim Kaine as her vice presidential running mate."},{"comment_id":"10153001751980950","commenter_b":"Sarah, please elaborate. Because you've lost me completely.","commenter_a":"Hahahhaha so crazy.... Muslims are peaceful people ..its TERRORIST who are the killers.... And if ya haven't noticed there are white people in ISIS","post_message":"The gun shop owner says he's making changes immediately to 'make America a safer place to live.'"}]
