[{"comment_id":"788608041305150","commenter_b":"Seems like a good time to turn off the tap to these law breaking cities. Go Trump!","commenter_a":"STOP THE INSANITY! Defund them and arrest those in charge that are breaking the law!","post_message":"A new study shows that more than 100 sanctuary cities across America received a total of $27 billion in federal grants and direct payments in one year."},{"comment_id":"10154001788011770","commenter_b":"They not that sexy to me at all need some meat on the bones Sarah Palin is sexy","commenter_a":"Mama's baby papas maybe They look nothing alike","post_message":"Gigi and Bella Hadid proved they are the sexiest sisters in the world at the Victoria's Secret Fashion Show."},{"comment_id":"942693669149238","commenter_b":"None of the name calling is necessary... My views and opinions stand. ... And I can get my own personal point across WITHOUT name calling :)","commenter_a":"Wooooow people are so ignorant!! Since when is it 'crazy' to fight for freedom from a tyrannical government? They aren't trying to hurt anyone. They are wanting the ability to live free!! People are fined and jailed for living 'off the grid.' THIS IS WHAT WE CALL TYRANY PEOPLE!!! The constitution was created to help protect us from corrupt government... hence the ability to bear arms. This is why. GUNS DONT KILL PEOPLE, PEOPLE KILL PEOPLE!!!!","post_message":"BREAKING: Ammon Bundy says he, 150 militiamen taking over national forest reserve in Oregon to  up lands for ranchers, miners, loggers & to oppose  of the federal government. The group is also calling on  patriots to join them with arms."},{"comment_id":"606800519482594","commenter_b":"HILLARY you have no CREDIBILITY ! YOU LIE SO MUCH WE CAN'T TRUST YOU EVEN WHEN YOU DO TELL THE TRUTH YOU'VE LIED SO MUCH WE CAN'T TELL! SO GO POINT YOUR FINGER FULL OF BULL SHIT IN SOME ISLAMIC WORLD THAT BOUGHT AND SOLD YOURSELF TO ! DUMB ASS LIEING BITCH!","commenter_a":"This woman is a total disgrace to America and to all human beings!","post_message":"Hillary Clinton just said Donald Trump is too dangerous to be President of the United States. This is why."},{"comment_id":"718075635009295","commenter_b":"Mrs Trump has nice Tits too lol","commenter_a":"Mrs. Trump, what an elegant peaceful person, a very classy confident individual...reminds me of Nancy Reagan!!!","post_message":"Michelle Obama will be remembered as the most vile and arrogant First Lady in US history!!! Let's get 4,000 SHARES to support our NEW First Lady Melania TRUMP!"},{"comment_id":"10153336327911770","commenter_b":"She looks like a c#m dumpster.","commenter_a":"Hillary is a liar murder a criminal and mocks them what a shame","post_message":"Hillary Clinton's campaign mocked the Thursday Republican debate, calling it a 'dumpster fire.'"},{"comment_id":"10154086770281756","commenter_b":"I guess science works when ranchers feed their cows corn instead of grass and then have to shoot up the same cows with tons of antibiotics because they are eating GMO corn instead of organic grass. Guess what? Those antibiotics are transferred to humans who eat meat and cause cancers in humans. Be safe, don't eat meat or during dairy milk.","commenter_a":"Why? Wouldn't this be a conflict of interest? It behooves hospitals to feed their patients meat with as many antibiotics as possible so people would visit again in the future and hopefully for a much longer stay.","post_message":"Hospitals are on the front lines of the battle against antibiotic resistance."}]
