[{"comment_id":"10153516807860575","commenter_b":"Schmuck must go!","commenter_a":"He looks mentally ill.","post_message":"The Gateway Pundit - DISGRACEFUL: Mitch McConnell WILL NOT Allow Vote to Defund Planned Parenthood (VIDEO)"},{"comment_id":"1069739979818471","commenter_b":"I thought she'd be gone by now! How the F can they relect that bitch!","commenter_a":"This lady can hide her own Easter Eggs...","post_message":"Folks, Pelosi is at it again..."},{"comment_id":"908173805909035","commenter_b":"Absolutely. Although I do remember getting erections as a child when I saw the vaginas of changing women","commenter_a":"If a woman has a problem with a little boy sharing the facilities, she needs to rethink her attitude. No harm done. Children's safety should always be the #1 priority.","post_message":"When SHOULD a child start going into public toilets on their own?"},{"comment_id":"10155922190175725","commenter_b":"#FuckTrump","commenter_a":"Trump 2016!!!","post_message":"Watch my interview with Eric Bolling that aired today- @webpagelink"},{"comment_id":"949160488506463","commenter_b":"THIS IS 9AMERICA0 NOT SYRIA","commenter_a":"May I remind everyone, This is America and the judge was correct. Swear to the truth by swearing to it on the Bible!","post_message":"Did a judge violate this woman's religious freedom or were his actions justified?"},{"comment_id":"10153869731497042","commenter_b":"These animals with guns","commenter_a":"This this is an open and closed case? And the guy is just lucky that he wrestled the gun from his father, and killed him, before his father could kill him first? Or maybe, just maybe, he was the shooter, and he is just telling police a story. Just sounds a little fishy, don't you think?","post_message":"QUADRUPLE FATAL SHOOTING: Police are investigating after they received a call from a man saying he killed his father — but only after the father allegedly shot and killed his bedridden mother, girlfriend and friend at a home in Rowland Heights, California."},{"comment_id":"10155069293808010","commenter_b":"'@username well since trump is saying illegals voted for Hilary!!! I'm being sarcastic you Troll!!","commenter_a":"Oh let me guess they were illegal immigrants 2","post_message":"He operated the scheme for two years from behind bars. He and an accomplice made more than $600,000."}]
