[{"comment_id":"10153283660836770","commenter_b":"This woman is an utter moron! There's more people watching the GOP debate tonight than all the democratic debates!","commenter_a":"Freud would be laughing at DWS totally projecting on the GOP.....exactly what she has been doing .....burying dem debates on Saturday nights!","post_message":"Democratic National Committee (DNC) Chairwoman Debbie Wasserman Schultz tweeted Saturday night suggesting the Republican Party was “trying to hide” a debate by scheduling it on the same weekend as the Super Bowl."},{"comment_id":"10154428619792144","commenter_b":"Kimberly, other than Melania Trump, you wouldn't know an illegal immigrant from a U.S citizen if your life depended on it. Get ahold of yourself woman!","commenter_a":"Seriously????? Let it go.....He's done, THANK GOD!!!!!! The end of an ERROR....","post_message":"Thank God."},{"comment_id":"10156406876695354","commenter_b":"lies as much as Obama, anyone votes for this lady is a total idiot, we already have confirmed Muslims coming in with the wave of them as terrorist, needs to shut her mouth with all these lies, you think our economy is bad now vote her in and she will double the debt, no place for this lady in politics.","commenter_a":"Jack ass","post_message":"\"Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" Hillary Clinton is a _________________."},{"comment_id":"483277565194949","commenter_b":"Jesus wouldnt like that she kills babies for a living.","commenter_a":"So sorry you folks are tearing this young woman apart, would Jesus do this?","post_message":"What'd you think, folks?"},{"comment_id":"10153047867707452","commenter_b":"Kimberly wirth you're an idiot and very ignorant","commenter_a":"I saw video footage of the man and he was clearly white with a reddish beard. The camera was laying on the ground and caught the bottom of his face. I'll look for the video and will post it.","post_message":"EXCLUSIVE: A Burbank woman says she's sick to her stomach after learning the man she went to junior prom with, Vester Flanagan, is responsible for the fatal shooting of a WDBJ-TV news crew in Virginia. abc7.la/1VbHsIC \"It almost feels a bit numbing because you don't think this would ever happen,\" she said. \"I knew him as a different person.\""},{"comment_id":"10154084901793837","commenter_b":"How horrible to be treated like that. I hope she gets fired.","commenter_a":"Wtf is wrong with these people ..","post_message":"QUESTIONABLE TSA TREATMENT? A woman diagnosed with breast cancer says she was humiliated by TSA during a recent security check. Hear what she has to say about the ordeal."},{"comment_id":"1033268563393975","commenter_b":"Build the wall already and gas up the coaches to take the illegals home!","commenter_a":"Scumbag democrats and other illegal scumbags.","post_message":"PROTEST TURNS VIOLENT OUTSIDE TRUMP RALLY: \"There won't be no United States without Mexicans.\" [Video]"}]
