[{"comment_id":"933409340029740","commenter_b":"Go back to Mexico we don't want you here","commenter_a":"She's just sorry she got caught and is afraid that her American-bashing, honest statement that was caught on-tape will ruin her career...as it should! She's nothing!","post_message":"Pop star Ariana Grande has issued a second apology, this time on video, after being caught on camera saying she had \"hate\" for America. \"I feel like the apology I posted, I kind of missed my opportunity to actually sincerely apologize...\""},{"comment_id":"1390819424294656","commenter_b":"Esta es la barbaridad de el aborto La Nina nacio viva, y la dejaron morir.Dios va a traer juicio , sobre todos los que derraman sangre inocente.","commenter_a":"That's not an abortion,that's disgraceful","post_message":""},{"comment_id":"1393293527430364","commenter_b":"Run us over girl. I'd love to have universal healthcare and lose this moron in command.","commenter_a":"All of this it's so true I've said this exact thing to you @username being Canadian fucking rocks 🇨🇦🇨🇦🇨🇦 y'all could learn a bunch from us if you could see past the orange dildo standing in front of you guys.","post_message":""},{"comment_id":"942501505798873","commenter_b":"just burn the lying btch","commenter_a":"She needs to be in prison for the next 30 years or longer.","post_message":"Good grief, Hillary Clinton..."},{"comment_id":"10153067188779312","commenter_b":"your a funny hoe if u wanna live like that so be it","commenter_a":"No junk food or soda Should be like the old days . Meat, cheese, bread, can goods , fresh fruits and vegetables . THATS ALL","post_message":"A Florissant lawmaker wants to prevent the ability to purchase energy drinks with food stamps. Thoughts?"},{"comment_id":"1526333487662909","commenter_b":"Trump, you just jealous it was not you to be the first to go there. Get a life you weirdo.","commenter_a":"Big talk for someone who is a national embarrassment.","post_message":"Wow, President Obama just landed in Cuba, a big deal, and Raul Castro wasn't even there to greet him. He greeted Pope and others. No respect!"},{"comment_id":"1004765479656630","commenter_b":"That's no lady. Bigger dick than Barry.","commenter_a":"Disgraceful First Lady","post_message":"Hot diggity dog..."}]
