[{"comment_id":"10154069512515329","commenter_b":"Georgie McCarthy","commenter_a":"That moment in \"Dilemma\" when Kelly Rowland uses excel to text Nelly.","post_message":"\"Life is one big party when you're still young, but who's gonna have your back when it's all done?\""},{"comment_id":"981651015256776","commenter_b":"Lol because people and companies don't donate cars and trucks for tax write offs","commenter_a":"God forbid American tax payer money goes towards improving lower and middle class families or stuff that actually benefits us, but check out the sweet new cars dps get to drive!","post_message":"Next time you pass a red Dodge Challenge or Yellow Ford Mustang GT, you might want to check your speed. DPS troopers now have two new unmarked vehicles for traffic enforcement."},{"comment_id":"916358841790504","commenter_b":"Gee Sara. you really ARE a blonde.","commenter_a":"Even religious organizations support planned parenthood. Your turn, republicans. Now you can't even use your Christian arguments...","post_message":"Fifty-six religious organizations are standing up in support of women's health and rights."},{"comment_id":"1773738762840165","commenter_b":"Yea but she doesn't wear that dress well as Melania .Petty old lady","commenter_a":"This is just tacky and remarkably low class.","post_message":"10/10 burn. 🔥"},{"comment_id":"732788963494483","commenter_b":"The Demon worshipping Islamic Terrorists murdering Jews even Jewish children needs to be put to death and send them to hell to meet their beloved false -prophet Mohammed .","commenter_a":"Where is the proof that Jews were responsible for this ? We all know only to well how Muslims murder their own children and use them is human shields and train them as shahids .And why is this self -hating Jews calling Jews terrorists and not calling Muslims Terrorists ? Jews are not Terrorists !!!!!!!!!!!!","post_message":"Jewish Home’s Ayelet Shaked calls the fatal firebombing ‘terrorism in every respect,’ and says that Jewish terror does more damage to Israel than Palestinian terror."},{"comment_id":"1155392447817135","commenter_b":"Since she can't take the heat she gets out of the debate. (Kitchen).","commenter_a":"She knows she has already taken both sides of every topic. There's simply nothing left to lie about.","post_message":"Would Clinton benefit from another debate with Sanders?   She doesn't think so."},{"comment_id":"10156761765540354","commenter_b":"Beyonce should eat a bullet.","commenter_a":"just go away already","post_message":""}]
