[{"comment_id":"1770528716571181","commenter_b":"@username you like being grabbed by the pussy,, I can see that from 100s of miles away. Lmao!!!!!!","commenter_a":"Come on. It's more like a Dr. who accidentally discloses he didn't go to med school, let alone college and is practicing without a listener and has a large number of outstanding malpractice lawsuits against him. But you still trust him.","post_message":""},{"comment_id":"10156788909185354","commenter_b":"She's a dick!","commenter_a":"A good start. Now take back the universities, colleges and America from these thugs!","post_message":"BOOM."},{"comment_id":"1525627194121061","commenter_b":"no one wants californians","commenter_a":"Why, Canadian provinces are constantly talking about seceding from Canada.","post_message":"Canadians are inviting Washington, Oregon, and California to secede and join Canada."},{"comment_id":"10154001737221509","commenter_b":"Because marriage is between a man and a woman, look up sodam and gamora","commenter_a":"Why has she not been fired? Seriously, find another job if performing your duties as a PUBLIC SERVANT conflicts with your religious beliefs. BTW, homosexual marriage is NEVER mentioned in the bible.","post_message":"This Kentucky woman is still refusing to issue marriage licenses to same-sex couples on \"God's authority\" -- and in defiance of the Supreme Court. @webpagelink"},{"comment_id":"1459625230716396","commenter_b":"Send them home!","commenter_a":"Who's with me ?? BUILD the W. A. L. L.","post_message":"Deport them all, President Trump"},{"comment_id":"10154853515096336","commenter_b":"Go away troll! You don't even live in our country","commenter_a":"I bet a million dollars kellyanne conway gave her soul away for for a few bucks and a pussy grab","post_message":" it up, Kellyanne Conway said to Jill Stein. your friends at the Clinton campaign said it won change the results. Conway suggests that the outrage over the call shows many Americans' unwillingness to accept Donald J. Trump as their president and to give him a chance, which includes Green Party presidential nominee Jill Stein three-state, vote-recount effort. Do you agree? @webpagelink"},{"comment_id":"589266911222085","commenter_b":"I'll say it to your face, tough guy...but we all know that a pussy like yourself will never deliver!","commenter_a":"A lady I worked with told me the closest thing to a lesbian experience she ever had was kissing, a liberal beta male on a dare!","post_message":"This is just the best!"}]
