[{"comment_id":"927281534054105","commenter_b":"He doesn't belong in America!!!! Get out Obama!!!","commenter_a":"He is a traitor and should be impeached.","post_message":"This is seriously outrageous."},{"comment_id":"10154254404659411","commenter_b":"ya protest naked on the streets like the old lady in Australia it is 100% success rate","commenter_a":"Excellent News! These EU Nazi fascists need to be confined to the dust bin of history, and this thieving scum Schulz, Junkyard and is cronies sent to the gulag for the remainder of their lives for ruining so many lives in pursuit of their s**t sack Utopian dream which extends no further then their own arse pocket of course. Now, on another note, anyone have any ideas on we can help this festering turd of an EUSSR to collapse any faster????","post_message":"'Implosion of the EU'"},{"comment_id":"10153050855917452","commenter_b":"Sound like she listening to Future lol","commenter_a":"Lmao wtf","post_message":"A suspected car thief got out of the vehicle and started dancing in the middle of the street after leading police in a wild chase through downtown Los Angeles. @webpagelink"},{"comment_id":"10154864481904170","commenter_b":"I know enough about Trump and Clinton. Only one has committed crimes worthy of prison time. Can't dispute facts.","commenter_a":"Ivanka is an amazing woman which demonstrates that President Trump is not only successful in business, but with his family too. A real winner in every sense of the word. #MAGA","post_message":"This should get people's attention."},{"comment_id":"10153703496814087","commenter_b":"#Notwithher #FrackyouHillary","commenter_a":"Hillary is all about terminating babies","post_message":"“I want to say something about this, since we’re talking about the Supreme Court and what’s at stake,” Hillary Clinton said at last night's Democratic debate. \"We've had eight debates before, this is our ninth,” Clinton said. “We've not had one question about a woman's right to make her own decisions about reproductive health care. Not one question.”"},{"comment_id":"590616211130377","commenter_b":"Let her go live in one then.","commenter_a":"Deluded to the point of madness","post_message":"Nancy Pelosi Has To Be The Stupidest Person To Ever Walk The Planet!"},{"comment_id":"10154454034611350","commenter_b":"At least they can wear pants other than jeans","commenter_a":"I like the new rule. Ass and tits are not school appropriate.","post_message":"We shouldn't be teaching girls to alter their dress as to not 'distract' the boys.\""}]
