[{"comment_id":"10152860083811051","commenter_b":"Rene this country still has racism because some blacks won't let it go and grow up And Larry NOBODY wants this president to stay with him tearing down America and acting like a dictator. Remember what happened to hitler???","commenter_a":"Wtf is OBAMA IF NOT A DISGRACE AND EMBARRASSMENT?????","post_message":"President Obama just said that some Senators have become an embarrassment to the United States. And he didn't stop there."},{"comment_id":"10154655814574411","commenter_b":"just give them what they wont , then the migrants can all go back home and rebuild","commenter_a":"Bill Jos","post_message":""},{"comment_id":"671356856304361","commenter_b":"Absolutely! Well said @ Nick..","commenter_a":"I think anyone that can actually read and does read about the UN`s actions will know that something is very wrong here, there is corruption at work, right at the top. Their anti Israel bias is painfully obvious in deed and action, compare what they levy against Israel in comparison to every other country under the UN, read some of the insane quotes from Palestinian sympathizing UN members and you will have the naked truth envelop your logical thinking in determining that ulterior motives are at work, insidious schemes are hatching and Israel is in the UN`s sights for dubious reasons. They are utterly obsessed with attacking Israel on the world stage and make not one effort to direct their attention anywhere else. We see the bias, we understand corruption is undermining the very fabric that weaves the tapestry that makes the UN have any credibility in the eyes of ...","post_message":"Israeli sources detail president’s ‘difficult’ 30-minute post-election call to Netanyahu, posit grave scenarios for diplomatic rupture"},{"comment_id":"10156695454475206","commenter_b":"Yes lol, but I'm also a full time college student and have been waitressing for three years.","commenter_a":"Carly, I wasn't sure who had my vote until tonight's debate, that being said #fiorina2016","post_message":"Hillary wants to be the first woman president—but every single one of her policies have been bad for women and bad for America. If you want a leader who will fight for all Americans, chip in $3 to get Carly in the White House. @webpagelink"},{"comment_id":"1009017532480603","commenter_b":"Has this vile woman ever told the truth?","commenter_a":"Hillary For Prison 2016","post_message":"\"What difference does it make?\""},{"comment_id":"10153645226755399","commenter_b":"Totally feeding ISIS everything they want. Playing right into their hands. What a naive jerk. ISIS loves Trump.","commenter_a":"Hum. ISIS launches attacks in order to provoke a backlash against Muslims in the West in order radicalize them. Trump follows the ISIS playbook perfectly calling for an entire raft of outlandish actions against Muslims in America: ISIS Mission Accomplished. Donald Trump: ISIS Agent #1","post_message":"The GOP presidential frontrunner just went there."},{"comment_id":"1581294075496417","commenter_b":"Kiss my white ass","commenter_a":"If we give them reparations will they go to school and get a job and stop whining?","post_message":"BREAKING: Obama Just Announced That He Will Be Forcing You To Compensate Blacks For Slavery. Never in a million years. That is old history. Will you compensate blacks for slavery?"}]
