[{"comment_id":"1143200309023611","commenter_b":"Neither is \"snakeshit ted\"","commenter_a":"Rubio is not going to make it!","post_message":"Pressure on Rubio to pull off win in Nevada"},{"comment_id":"10154770911376323","commenter_b":"\"according to the people involved\"...yeah ok.... i prefer data that is unbiased. as for now, unbiased data overwhelmingly shows brexit a reality.","commenter_a":"\"We want our own parliamentary sovereignty back!!\" Parliaments exercise sovereignty \"Rarw!! Rabble rabble rabble!\"","post_message":"A series of informal but concerted efforts by pro-remain politicians to reshape or even derail the Brexit process is under way and gaining momentum, according to people involved."},{"comment_id":"487132828135264","commenter_b":"What? the lying lame are going to teach other people to be perverts? Really","commenter_a":"OMG!","post_message":"Goooooood Moooooorrning!!"},{"comment_id":"993063080750221","commenter_b":"Biden's coming in! you lose, Hillary.","commenter_a":"backwards is thinking that butchering a live baby in the womb is ok to do.","post_message":"In this week's Facebook Q&A, Hillary took on Jeb’s claim that Democrats use \"free stuff\" to appeal to minorities."},{"comment_id":"10156077468780354","commenter_b":"She'll be worse then Obama","commenter_a":"We can all hope that she is 80% of the way to the Big House!","post_message":"Before a single vote is cast?"},{"comment_id":"1513798078640217","commenter_b":"@username Prove that lady!!!!!!","commenter_a":"Obama has publicly said he was born in Kenya so has his tranny wife.... What more do you need ?","post_message":"Donald J. Trump \"has really started his political activity based on this racist lie,\" Hillary Clinton said."},{"comment_id":"10154356227669641","commenter_b":"Females have orgasms? ;)","commenter_a":"Is everyone who is reading this so dumb or is it just me? The comments seem to be coming from people in deep sleep. OK for starters let's all read the post in detail again then re-align comments.","post_message":"What is the actual purpose of the female orgasm?"}]
