[{"comment_id":"10153997171416486","commenter_b":"Fools don't you see that your woman are raped by Muslim refugees.Germany is now blocked Christian immigrants in their country.","commenter_a":"Some of the biggest idiots .You people are.","post_message":"\"...we think that this is our time as Catholics to be the Good Samaritan, regardless of what is expected of us from countries overseas.\""},{"comment_id":"850932761669644","commenter_b":"Send her over better yet send her kids not mine","commenter_a":"I hate to break this to some people but the only Americans that are there any legitimate threat from Isis are the Americans were going to be sending over there..... Somehow Obama has managed to kill over 10,000 Isis fighters by dropping bombs without one single American military casualty..... Why change the game plan now?","post_message":"Do you agree with Rep. Barbara Lee?"},{"comment_id":"10153604606804024","commenter_b":"AFUCKINMEN ON THAT SHIT!","commenter_a":"OBAMA DOES NOT CARE---HE TREATS THE ENEMY BETTER THEN AMERICANS !!!!!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10153913161040329","commenter_b":"\"Suck you dry and take you out for lunch\" she's a country lass, it is obvious: barley, then gooseberries.","commenter_a":"I couldn't actually finish reading it because it made me feel physically sick. Subhuman intellect isn't something to broadcast proudly, you misogynistic douchebags.","post_message":"\"It's people like you who make it clear women should never have been given rights.\""},{"comment_id":"1270991109602974","commenter_b":"You are full of BS. Damm Obama imported these terrorists and should be charged and prosecuted!","commenter_a":"It doesn't matter what kind of statement Trump makes if it's not from the heart and just words he thinks people want to hear it meant nothing at all. When our PresidentObama sends his condolences and express his deepest regrets it is from the heart. Trump on the other hand is only putting on a show to try to make President Obama look bad because that is what all the Repugs do!! Won't work!!!","post_message":"This is what a real leader does!"},{"comment_id":"1676227239104065","commenter_b":"What a pig","commenter_a":"Suck it buttercup had your crap 8 years give us 4","post_message":"How classless can you get?"},{"comment_id":"10154930045761037","commenter_b":"Don, you can get you point across without being condescending and juvenile. Just ask Bernie Sanders.","commenter_a":"Watch the trumpettes ignore the financial FACTS and whine that everybody isn't bowing down to their orange cheeto god. LOL at them. Hey trumpettes: you were conned. Again. Told you so.","post_message":"WATCH: Donald J. Trump tours Carrier plant, gives speech after company agrees to keep 1,100 jobs in Indiana."}]
