[{"comment_id":"10154241596456491","commenter_b":"Trump has made America great again for sure ! Free coke floating on our shores !!!","commenter_a":"Mom Neelo","post_message":"\"I’ve found marijuana, but never cocaine like this.\""},{"comment_id":"914457525280663","commenter_b":"she put it there herself those i sue you i sue you money on those lazy people.","commenter_a":"So granny doesn't love metal sausage.Why?","post_message":"Definitely not lovin' it"},{"comment_id":"1746275522311169","commenter_b":"Larry, I didn't say \"fire a weapon,\" I said \"purchase and carry a firearm\" Should a gun shop sell a firearm to an 11 year old?","commenter_a":"Back then it was muskets against muskets. Now we have semi autos and the government has fully autos. Seems like we are already behind with the second amendment.","post_message":"#LiberalLogic"},{"comment_id":"10154247544237894","commenter_b":"Damn yo mama mean BUSINESS!","commenter_a":"one year my brother and i unwrapped all our Christmas presents before Christmas and my mom found out and took everything back, i would've much rather gotten the ASS whooping instead.","post_message":"Say What Now? Indiana Woman Arrested After Beating Kids for Opening Christmas Gifts Early"},{"comment_id":"10152908801970927","commenter_b":"No body forced you to spread your legs; and, no body forced you to have unprotected sex!!!!","commenter_a":"Cross your legs","post_message":"It's no surprise that Satanists support Planned Parenthood, but what is SURPRISING is how they showed that support ..."},{"comment_id":"10155034112494445","commenter_b":"She's nervous he may grab her by the pussy!!!","commenter_a":"She looks nervous as would I this has been a big day for them, STOP THE HATE, she is a beautiful woman... let's be real how would you be if the entire world was watching you!?","post_message":"President Donald Trump and First Lady Melania Trump share their first dance as the First Couple.  @webpagelink"},{"comment_id":"996990363669718","commenter_b":"@username, if those that come from Mexico are such a hard working people like liberals claim, then they should use all the energy to fix their own place. Mexico required voter ID which in turn gives them capabilities of voting people into office. Fast forward to illegals here from Mexico claiming that is racist to require voter ID, while their own place mandate that they have one. Is all about getting free stuff without any output. For that reason I say screw everyone of them that break the law and move here.","commenter_a":"I live in a Muslim country here is like a hell because of being Muslims. Killing, kidnaping and beheading is an usuall action. If you want to be safe, don't let any Muslim live in America.","post_message":"NOT IN OUR COUNTRY."}]
