[{"comment_id":"579776192190480","commenter_b":"Leave now bitch","commenter_a":"Good Bye.","post_message":"Whoopi Goldberg Says She Might Leave The Country If Trump Is Elected. Well I guess she's going to say goodbye. Will you happy to see her go?"},{"comment_id":"10150728672209999","commenter_b":"Well rebecca I'd recommend finding a director with more credibility before trying to gain traction on this movement. I'm not saying they're unjustified in their claim but Spike Lee is a pos","commenter_a":"Spike Lee hasn't made a good movie in over a decade so who really cares.","post_message":"The outcry over the nomination of 20 white actors, and no black ones, for the coming Academy Awards gained momentum on Monday — MLK Day — as Spike Lee and the Jada Pinkett Smith announced that they wouldn’t be attending the ceremony."},{"comment_id":"932260496814809","commenter_b":"You believe and listen to the \"man hating\" feminists which aren't a legitimate example of the feminist movement.","commenter_a":"Thank you. It's time the \"real\" (for lack of a better term) feminists become the majority over the \"man-hating\" feminists.","post_message":"It's so misunderstood, but they clear it up — by using the word 32 times. - Rebecca Eisenberg"},{"comment_id":"1028079707241669","commenter_b":"Yes oooo. They know what their children are up to. Let the people deport them.","commenter_a":"Damn right.","post_message":"French Mayor Says ‘No More Muslims’, Orders The Destruction Of The Infamous Calais Camps And Expulsion Of Over Seven Thousand Muslims  @webpagelink"},{"comment_id":"10154426292152431","commenter_b":"Sending smoke for Jim's family and friends","commenter_a":"Loved his stories!","post_message":"Jim Northrup (1943–2016): Beloved Ojibwe Author, Poet, Marine Veteran Walks On  @webpagelink"},{"comment_id":"10154048392259087","commenter_b":"Mexicans might cross a border but not a fucking ocean.","commenter_a":"\"The Wall\" is just what he said to get racist white votes. You're a fucking moron if you think a wall would be built. Let alone be efficient. There's OTHER ways in!","post_message":"\"We didn't discuss who will pay for the wall,\" Trump admitted."},{"comment_id":"10153064860976378","commenter_b":"People need to understand that EVERYONE is entitled to their opinions whether YOU agree with them or NOT! intolerance goes BOTH ways!!!!","commenter_a":"Ummm it is a catholic school?! Maybe she can go get a job in a Muslim school....oh wait","post_message":"TEACHER FIRED - A popular teacher at Merion's Waldron Mercy Academy was apparently fired because she is married to another woman, a marriage that is 8 years old. The school says her lifestyle is not consistent with its teachings. Check out the details here: 6abc.com/@username/ and tell us what you think in the comments section."}]
