[{"comment_id":"10153577696206337","commenter_b":"yeah.. IM gross wonder how many old fat bitches are just jealous that some 16 year old whore was getting his footlong? \"young teen: my azz, she was advertising on craigslist looking for the D 16 is legal in his state moron for good reason. id pound the shit out of some 16-17 (contingent on state) year old pussy fuck yall","commenter_a":"God damn it, Jared. We don't have to worry about Ronald FUCKING McDonald FUCKING AN UNDERAGE GIRL!","post_message":"BREAKING: Former Subway spokesman Jared Fogle allegedly bragged about paying for underage sex in a series of lewd, sexually explicit texts..."},{"comment_id":"10154248174893734","commenter_b":"build the wall with trump under it","commenter_a":"TRUMP 2016..","post_message":"Do you agree or disagree with Donald Trump's speech at the Rolling Thunder motorcycle rally today?"},{"comment_id":"1492050597481632","commenter_b":"Then your whole family is \"skewed\".","commenter_a":"That's funny, because all of the vets in my family are voting for Hillary. Is this another skewed poll? I'd love to see where survey monkey dug up the survey subjects. Here's the problem with the poll... Only people who are passionate enough or crazy enough are going to hang on the line to take a survey at this point... I.E. Trump supporters. Most smart people usually just vote and don't waste their time with surveys.","post_message":"But Hillary Clinton is perceived more favorably on the use of nuclear weapons. Here's where things stand."},{"comment_id":"934918126557241","commenter_b":"Why dont you vote for Hillary then? She cant say two words without lying her ass off. But I bet everyone who commented will be there to vote for her. Thats why Donald is SELF FUNDED. Doesnt take money from soros or rockefeller. Thats why the media hates him and all of you do as well. Obama has already said that muslim refugees will go in a database. But when Trump says it hes a racist bigot. Obama used different \"words\" and its totally different . When really its not. Its the same and Im not argueing . I hope you will all be happy when your next LIAR is elected. Thats why grandkids wont enjoy America as you did. Thanks dickheads.","commenter_a":"The dude tells the truth. Regardless noone else has rhe balls to speak the truth anymore","post_message":"The call took place right around the time Donald Trump announced his intention to bar Muslims immigrants from entering the U.S."},{"comment_id":"10155458393115389","commenter_b":"No, she sucks!","commenter_a":"This is a Tempest in a tea pot. Hillary Clinton will be the next president.","post_message":"Another bad week is shaping up for Hillary Clinton."},{"comment_id":"981969021843756","commenter_b":"Republicans want to end abortions so that they will have more population to draw on for their future wars. Think about it: End abortions, brings on many children that the parents can't care for (likely because of finances). The child likely grows up in poverty, being told (by the same people that ended abortions) he/she is a leech on society (parents likely getting assistance), so that child will grow up and most likely do one of two things (a few will take a different path, of course). 1) begin a criminal career 2) join the military to be fodder Republicans want to abort YOUR children when they are adults....THAT is why they want to end the termination of unwanted pregnancies.","commenter_a":"Attack on women!!!!! All you saying baby killers start adopting them then...start helping poor young women survive during pregnancy and after child is born, start fighting for wic, head start, etc...how many severely disabled children have you adopted? Big mouths refuse to help real babies only care for fetus","post_message":"Every child is a gift from God.  That's why the House just passed some of the most pro-life legislation to ever come before Congress – banning abortions after 20 weeks."},{"comment_id":"10153722774708984","commenter_b":"God's Son, Jesus, was sent to Earth as a baby. Grew to be a man, ministered to people healing the sick, performing miracles, teaching about God's Kingdom. Was rejected by His own Jewish people, suffered and died on a cross. Arose from the grave the 3rd day, talked and ate with His disciples, talked to 500 people before ascending into Heaven to sit at the right hand of God, and to prepare a place for us. If we accept Jesus as the Son of God, repent of our sins, God is gracious to forgive us and save us from eternal death. We will live in peace and love and joy in our eternal life. Jesus said \" I am the Way, the Truth, and the Life, and no one comes to the Father God but by Me.\" As for me, David, I KNOW He lives in my soul. Also, I ...","commenter_a":"There is a little truth in all religion so who is to say what is right or wrong but no one's have any biasness at work or in or government god is only a word that represents all religion. Leave it in your heart's and at home or where ever it is that you warship. We are all equal no matter what I don't want any of them I have my own. No one or nothing can take that from me. Try believing in that.","post_message":"Boom! Mike Huckabee just dropped one EPIC line about Hillary Clinton and Kim Davis that will have liberals absolutely livid. He is putting himself on the line big time for this county clerk, and many are joining him in it.  Do you support what Mike Huckabee is doing?"}]
