[{"comment_id":"10153914495466491","commenter_b":"How is a white woman being racist unbelievable?","commenter_a":"Unbelievable that people would accuse Ellen being a racist","post_message":"Ellen DeGeneres took to social media to respond to the backlash."},{"comment_id":"10154445854511973","commenter_b":"this is what i think about blm's","commenter_a":"CRIMINAL PIGS OF AMERICA!!","post_message":"We are broadcasting live from downtown Portland, where members of Don't Shoot Portland are holding a press conference regarding the recent shooting of Quanice Hayes, 17, by a Portland police officer."},{"comment_id":"1839638869615346","commenter_b":"What progress? Isis? Health care costs through the roof? Men hanging out in women's bathrooms? Haiti? Russia ready to attack us? Drawimg a line in the sand? Most terror attacks on US ground ever? The disasterous Common Core? Highest poverty rate with people on welfare..ever!? Even democrats admit it!","commenter_a":"God forbid the president campaigns to protect everything he has accomplished. He doesn't need an idiot like you who would be a bull in a China shop destroying all of the progress that has been made.","post_message":"\"They're losers. They're babies. We have a president-- all he wants to do is campaign,\" Donald J. Trump said of President Obama @webpagelink"},{"comment_id":"1157169374320401","commenter_b":"I swear not EVERYTHING is racist just because you are offended by it. He isn't anti-immigrant..he is against ILLEGAL immigration and un-vetted refugees. Get the facts straight already","commenter_a":"Go to your safe space and shut up","post_message":"The phrase “is associated with the political campaign of a candidate widely known to voice anti-immigrant and bigoted views.”"},{"comment_id":"10152536307751135","commenter_b":"People are driving 85,90 miles an hour in the fast lane trying to push me out !!! Get em police","commenter_a":"people and trucks drive way to fast on freeway!","post_message":"Police say the driver of the other car was going too fast for conditions at the time of the accident."},{"comment_id":"10153648963644203","commenter_b":"I assure you, Hillary has more political experience than ALL the male candidates. Her being female just makes it better. You men who hate powerful females are gonna be maaaaad! lol","commenter_a":"I think so. It's equally difficult to imagine what Hillary Clinton's appeal to anyone, women included, is.","post_message":"\"Being a woman does not give you the right to be the next president. Whether you Carly Fiorina or Hillary Clinton. It going to be your campaign that matters.\""},{"comment_id":"10153482266875329","commenter_b":"We have no hope for me aka the oblivious bitch.","commenter_a":"Brianna Musselman @username Guarantee this would probably be me, lol","post_message":"cringing"}]
