[{"comment_id":"1731050200496998","commenter_b":"Some mothers eat their young!","commenter_a":"Typical!","post_message":""},{"comment_id":"10153715209333984","commenter_b":"Build a wall and send them home.","commenter_a":"You know illegal Mexicans come in this country illegally the women wait till about a month before delivering their child snake in this country have their child hoping to get birth rights I think if you come in this country out of another country if you have a child here your child is from your country not mine god bless the United States and we're going to try to keep it that way","post_message":"These Texas counties are doing something that has earned them a warning from Mexico, but it doesn't look like they're letting that stop them!  Do you support what these counties are doing?"},{"comment_id":"10153666245398984","commenter_b":"All this just so the Dems can have more illegals to for for them....Could Trump be more dead on?","commenter_a":"Thank Obama for all these murders, he is the one responsible for letting thdm in the country!!!","post_message":"This is a horribly tragic story, especially since it involves an illegal who should never have been in this country. Please join us in sending thoughts and prayers to the families of the victims.  Are you against amnesty for illegals?"},{"comment_id":"10153676490604071","commenter_b":"GEE HIS WIFE DIDN'T TELL ANYONE DID SHE What Crap","commenter_a":"This is coming from the Obama administration not the FBI. This guy works for the president, he will say and do anything Obama wants him to","post_message":"\"Some of our most productive relationships are with people who see things and tell us things who happen to be Muslim.\""},{"comment_id":"10152670187577483","commenter_b":"Or two women","commenter_a":"All of you people that back same sex marriage wouldn't even exist on this Earth right now if it wasn't for a man and woman making you like GOD intended for it to be. Just think if all of yalls parents would've been gay yall would have never existed.","post_message":"If you're trying to get married, check out this map before you go to the courthouse. The majority of counties have either suspended the issuance of all marriage licenses or are only accepting applications."},{"comment_id":"1585095868182585","commenter_b":"Just go away!","commenter_a":"Isn't mental illness a sad thing?","post_message":"Oh dear god."},{"comment_id":"10154996547968010","commenter_b":"Let the muther fucker SUFFER!","commenter_a":"Think he'll be well enough in time for Trump to appoint him to the SCOTUS?","post_message":"A source said Manson was seriously ill and it was unclear how long his treatment would take."}]
