[{"comment_id":"10153735414097293","commenter_b":"is this part of the gay agenda against heterosexual women? Now they want to send men, dressed as women into women's bathrooms? @webpagelink is it not bad enough that radical lesbians have divided the sexes and have by some accounts taken over womens centers with the help of radical like hillary clinton","commenter_a":"Meanwhile he had no problem playing in middle eastern countries like Qatar where the law punishes homosexuality with prison or death. Stop pretending he did this because of principle.","post_message":"Another day, another prominent rock star canceling a show to protest a controversial new law in a Southern state."},{"comment_id":"10153593873146130","commenter_b":"Bobby McDonald. you are 100% wrong. the only way felons and nut jobs can get guns illegally is through criminal connections which already increase their chances of arrest. why you would rather want to get rid of BGCs so criminals can get guns in a Walmart is something so irrational and naive i simply cant understand that kind of thinking.","commenter_a":"It's incredible that there are people out there that call themselves responsible gun owners but have a problem with background checks","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1084090904983990","commenter_b":"TheresaStephens I don't know how you can say that. The police might have something on him and if they have he should be charged and locked up for life. And all the tax payers money your going on about let Cliff Richard pay for it if he's guilty, let the police seize all he's wealth and money and all go in police funds. If he is guilty he's nothing else but a dirty old C@@@ I don't care about he's Christian lifestyle if he is guilty he should go away. After all Theresa God hates sexual immortality","commenter_a":"Oh for goodness sake leave the man alone. I'm not a fan but, your innocent till proven guilty. So far they haven't proven a thing. I am sure there are plenty of unturned stones in the police force that need investigating?!","post_message":"Just in...."},{"comment_id":"1789863337898793","commenter_b":"NO !","commenter_a":"Like a dog misses fleas!","post_message":"Will you miss having President Obama in office when his term ends?"},{"comment_id":"10152950589906051","commenter_b":"Let's throw her away with out anything too hope she go to hell","commenter_a":"This is true evil!","post_message":"Even the police were a little surprised that someone could be so cruel for no reason."},{"comment_id":"10154736947540575","commenter_b":"Ignorant bitch. You voted hate. You liberal clowns","commenter_a":"Were was Meryl Stereo about the man that was attached and tortured. Oh yes, he was White.","post_message":"BOOM! Kellyanne Conway Schools Elitist Meryl Streep... ---VIDEO"},{"comment_id":"10154469965885579","commenter_b":"Why would that surprise you Mr. Brown, Mr. Trump becoming the next President of The United States is a blessing compared to it almost not being America at all thanks to all the corruption of this Government and the Politicians letting it be taken over my illegals that pretty much rule OUR COUNTRY, PRAY TO THEIR GOD ON THE SOIL FOUGHT MY THE MEN AND WOMEN OF OUR VETERANS AND ACTIVE SERVICEMEN , THAT WE OURSELVES AS AMERICAN CITIZENS ARE DENIED, BURN OUR COUNTRY'S FLAG AND I COULD GO ON AND ON, BUT LETS JUST SAY 'CHANGE IS COMING, THOSE GETTING A FREE RIDE WILL BE OVER, THE RICH GOVERNMENT WILL NO LONGER BE LIVING HIGH ON THE HUG, THE POLITICIANS WILL NO LONGER BE MAKING DIRTY DEALS AND ROBBING THE AMERICAN CITIZENS OF THE HARD EARN MONEY !! Yep he made it this far because he's one of US ...","commenter_a":"I'm seriously embarrassed that this man can make it so far in our country. He takes what class the GOP had and throws it to the wind.","post_message":"Donald J. Trump: 'Tonight we close one chapter in history and we begin another.' Watch complete speech here: @webpagelink"}]
