[{"comment_id":"10153526082496323","commenter_b":"NASA erased 'accidently' the high resolution tapes from the 1st moon landing in the 80's .lol .","commenter_a":"They never went to the moon though","post_message":"Even astronaut Buzz Aldrin had to file travel expenses – for a less than astronomical $33.31."},{"comment_id":"10155104152711323","commenter_b":"Wow how fucking sexist can you get.","commenter_a":"I don't know who any of them are but they are pretty.... boring and vacant looking.","post_message":"'These are the kind of women who take pride in saying things like not into fashion I like style, and by they mean that men like me to wear. They think anyone who criticises Disney fetishisation of princesses is just jealous.'"},{"comment_id":"10158494825160725","commenter_b":"Why do you care what others do????? It's a saturday. Most people get that day off . dRump loves the bossy bitches. Go grab a pussy","commenter_a":"Get a job/life.You have way to much time on ur hands.","post_message":"Thousands of demonstrators are expected to take to city streets this weekend for the Women's March on Chicago, one day after Donald Trump's inauguration."},{"comment_id":"10152931717926336","commenter_b":"They have no \"rights\" here in the US -- if they are here illegally they should be deported and if caught coming back into our country they should be put in a hard labor camp for 5 or more years --","commenter_a":"Thats all we need , one more moron!!","post_message":"U.S. Attorney General nominee Loretta Lynch said she believed in an illegal immigrant's \"right\" and \"obligation to work\" during Wednesday’s confirmation hearing."},{"comment_id":"10154370005056162","commenter_b":"She should be CHARGED with TERRIBLE TASTE in clothing!","commenter_a":"The legs are a lot longer than a lot of the short shorts that teenage girls get away with wearing all the time everywhere.","post_message":"TOO SHORT? A burlesque dancer says an airline stripped away her dignity when they told her to change her clothes if she wanted to board her flight... @webpagelink"},{"comment_id":"10154252810014749","commenter_b":"Women should do what they please and men can lump it.","commenter_a":"Burqa is not an Islamic thing it should go away, a women should dress modestly and cover her hair.","post_message":"15 countries have pledged to support the ban for security reasons, and there has hardly been any opposition among the Muslim community."},{"comment_id":"1685004025117138","commenter_b":"What you sayin little girl?","commenter_a":"Love you all... Well except Muslims... And Mexicans and ....","post_message":"Merry Christmas & Happy Holidays!"}]
