[{"comment_id":"10154358631096943","commenter_b":"Put her in jail with her boss","commenter_a":"So..yeah.. Legit question here @webpagelink/ So yeah can we?? If this were a case involving weed or oil on national historic sites or someone's private lands etc the Feds would be KNEE DEEP in it!! Or at the very least CA's electoral points be split 50/50!","post_message":"This is serious. We are investigating now."},{"comment_id":"10154128932095579","commenter_b":"Domestic terrorists! Red neck spoiled Yahoo's, not patriots by any means.","commenter_a":"When I think of \"Terrorists\" I think of malicious intent to do harm\". When I think of \"Domestic Terrorists\" I think of the same, but the suspect/aggressor is from within. A \"rotten apple in the barrel\", if you will. When I think of patriots fighting for principles as defined by the Constitution, I think of statements like the ones that these people are making in Burns. I'm not saying that what is going on here is right, warranted, and just, but I am saying that (if their story is true) then we absolutely need be paying attention and asking 'why would the Fed Gov need to use strong arm, mafioso tactics to squeeze/coerce people of of their own lands'', and why are we allowing them to get away with it'? Take a close look at the mission statements of the Sierra club, Agenda 21, etc. Then go look your grand ...","post_message":"Rep. Greg Walden (R-OR) spoke on the House floor for over 24 minutes on the armed standoff in Oregon. Here is the closing 5 minutes of his remarks. Watch the complete video of his remarks here: @webpagelink"},{"comment_id":"10153411890826167","commenter_b":"Don't Muslims go the mosque all the time? What's the big deal?","commenter_a":"Well, we knew THAT was coming!!","post_message":"The White House said Obama's upcoming mosque visit is meant to \"reaffirm the importance of religious freedom to our way of life,\" but suddenly conservatives don't seem to care about that:"},{"comment_id":"10153326562398812","commenter_b":"Oh really? If that had been me, or any other black woman in this country, our black asses would have been thrown under the Jail the first time it happened and my children would have been taken from me with no chance of hardly seeing them let alone getting them back! They would charge me with felony endanderment also! But these two ol'birds get a second chance to do it and even have entitled it 'Free Range Parenting'! Ain't that somethin'! Exploring their independence would happen when they are of the age of independence. If you still write them off on your taxes, you are responsible for them! And just what are these wonderful parents doing while these babies are at the park and walking alone through town for any demented minded criminal to snatch?? SMH! I tell you, it must be nice to live by your own laws and ...","commenter_a":"So it's now a crime for parents to let their kids go to the park? What are they suppose to do put them on a leash and take them out for walkies.","post_message":"UPDATE: 2 Maryland \"free range\" children taken into custody again: @webpagelink"},{"comment_id":"409403839241497","commenter_b":"The tea baggers mistresses have abortions too.","commenter_a":"It's funny how the party of limited govt wants the govt in every OBGYN office in America. Sounds like big govt to me. Teabaggers, why not just attach cameras to every uterus to make sure women are doing what you say at all times? The tea party lunacy and hypocrisy is too much. I don't like abortion but it is legal and what others do is no one else's business. You ass backwards tea baggers seem to forget that your southern women have abortions too.","post_message":"He went too far."},{"comment_id":"934884219913515","commenter_b":"@username they were not prostitutes. Those were his pimps.","commenter_a":"TRUMPS ASS LOOKS BETTER THAN RUBIO'S FACE. RUBIO IS A DAMN SWEATHOG!!!!!","post_message":"Marco Rubio mocks Donald Trump's face..."},{"comment_id":"500867293395381","commenter_b":"The Hilary Clinton article is free of facts and only says superficial things. I don't agree with her assessment.","commenter_a":"Israel has had nuclear weapons for more than forty years and has not used them. Instead of focusing on the mullahs who are intent on wiping Israel and the Jews off the map, let's focus on Israel. That makes perfect sense. Of course.","post_message":"While the conservatives try to get us to focus on Iran as a nuclear threat, guess where the real threat is hiding..."}]
