[{"comment_id":"1704424399796624","commenter_b":"Just shows how retarded womens issues are. realsexism.com","commenter_a":"We're all getting a little over-sensitive about these non-issues, no? Politicians need to smile for likability. Likability is crucial in a candidate. It's why a sweating Nixon went down to JFK. It's why the trope of \"kissing babies\" became a thing for politicians of any level. When I think of male pols who didn't smile, they didn't do so hot. Your Bob Doles, your Ralph Naders, your Jim Webbs. All pols need to be likable, and I can remember accounts of the \"dourness\" of the above males mentioned in the news, but when it's mentioned about a woman, it's not okay? She's running for President, this is fair commentary.","post_message":"Were other (male) candidates called out the same way?"},{"comment_id":"10156072417220603","commenter_b":"Well take up not enough jobs with the people that keep letting foreigners in the country.","commenter_a":"Yall saying people should be able to support themselves are not understanding that jobs at McDonald's etc are NOT meant to support a family. If you have a job there and have a family they (McDonald's) and us (people that will take the hit of a min wage increase because the cost of products will go up) should not have to pay for your poor choices for not being mature and either going to college or tech school or working your way up in a company. Min. Wage jobs are for high school/college students so if youre past those ages and still making min. wage you should've made better choices and should stop expecting the same pay as people that did!","post_message":"Do you think the minimum wage should be raised?"},{"comment_id":"10153105510381336","commenter_b":"I elected Obama twice. You wingnuts act like Hillary did some sinister dastardly deed that caused 4 people to die at Benghazi.Not true..The US lies and spies and tortures and misleads as a matter of policy.J ust like Bush Rumsfeld and Cheney did. I will never vote for a conservative. Politic is a tough business. acvtually governing is something the GOP has forgotten about.","commenter_a":"What truly amazes me is that State Communications Security let her first use a personal e-mail for government business and second they let her keep an unsecured server at her home. This is a complete violation of all government communications security regulations and practices. There is no way possible that she did not send classified e-mails during her entire tenure as Secretary of State and there is no way possible that they can say that unsecured server was not hacked by outside sources. What kind of a moron would think that? The idiots that are defending this woman are absolutely CLUELESS as to the magnitude that this Security Breach is. People go to jail and/or get fired for much less than this. It is absolutely mind boggling and staggering to me that this server was not turned over and now has supposedly been wiped. This server should be confiscated and ...","post_message":"Rep. Trey Gowdy said the former secretary of state has failed to produce a single new document in recent weeks and has refused to relinquish her server to a third party for an independent review."},{"comment_id":"1765071860379740","commenter_b":"damn elizabeth coming out swinging","commenter_a":"That was EXACTLY what happened to another person that was supposed to be deposed and speak out against the Clintons years ago, and was found three days later by the FBI after the guy missed his deposition:-(","post_message":"Do you think the Clinton's were involved in his death?"},{"comment_id":"1510101482356438","commenter_b":"Lol that's not even close to what Asexual means.","commenter_a":"Asexual isn't real. Asexual means you reproduce without a partner. Use a different word cause that's not how this word is used in species. Asexual is like a bacteria. You are just without-sexual-wants.","post_message":"\"I fantasize about my future with my partner, achieving a certain level of success in our careers, getting out of debt. Oh, and cake. Don't forget about cake.\""},{"comment_id":"10153638763994342","commenter_b":"@username he's not interested in your girlfriend","commenter_a":"Breaking: Lavoy Finicum, Marine, Rancher, father, and grandfather will be laid to rest today. He loved God, the constitution, The United States of America, and his family.","post_message":"Police say the local rapper was shot four times. He is expected to survive. #abc13"},{"comment_id":"10153832005601162","commenter_b":"Not a girl if you have boy parts, sorry.","commenter_a":"What about the rights of every girl at this school. This is insanity.","post_message":"30-DAY DEADLINE: The U.S. Department of Education says Palatine Township School District 211 is violating the rights of a transgender student by refusing to allow her the unrestricted use of a girls' locker room: @webpagelink"}]
