[{"comment_id":"10154416469089342","commenter_b":"@username deal with it, pussy.","commenter_a":"Rip","post_message":"BREAKING: Former Cuban leader Fidel Castro has died at age 90"},{"comment_id":"1598639267107557","commenter_b":"#2ChroniclesChapter7V14 #DrainTheSwamp #OneNationUnderGod #InGodWeTrust #TrumpPence2016 #UCMJ4President #UCMJ4Congress #UMCJ4Senate #USConstitution #BillOfRightsNonNegotiable #Paperballotsonly w/ID #NoAmnesty #AmericaFirst #PledgeOfAllegiance #NationalAnthem #ProNRA #ProLife #Pro2A #NoUN #MAGA #Election2016","commenter_a":"Why are tax dollars being spent on our so called president campaigning for her. ..should be illegal","post_message":"Donald J. Trump finally did it. After taking a lot of punches from the first lady, he unloaded on Michelle Obama, dropping an epic truth bomb on the president's wife.  What do you think about what Trump said?"},{"comment_id":"10157022006200725","commenter_b":"Crooked she is in everything!","commenter_a":"anything related to Hillary would Just get worse if she is in office","post_message":"Crooked Hillary just can't close the deal with Bernie. It will be the same way with ISIS, and China on trade, and Mexico at the border. Bad!"},{"comment_id":"10153206578922483","commenter_b":"Lol Caitlyn, you poor misguided... Whatever you are. I can't tell if you're a child or just an uneducated woman.","commenter_a":"But, muh freedoms...","post_message":"Angered after an argument over his smoking, the customer went to his vehicle and retrieved a 9-mm pistol, which he used to shoot the employee once in the head, according to reports."},{"comment_id":"10154420186151194","commenter_b":"Allah is shopping like à sodomized bitch right now","commenter_a":"who just saw that giant fuckin orb?","post_message":"LIVE: Anti-ISIS military op near Mosul, Iraq"},{"comment_id":"395322620592333","commenter_b":"People with food stamps eat better than average people. Not that junk food is better for you, but they get it all.","commenter_a":"thats the best to ever happen . but, it should include junk foods and sodas at the grocery store","post_message":"Could this Senator's proposal help bring an end to food stamp abuse?"},{"comment_id":"1544982162188475","commenter_b":"That's why I have your wife come over","commenter_a":"Yeah it changes kids it doesn't make them limp wristed liberals who don't know which gender they are . It makes them tuff , learn how to solve problems with others and gives them confidence!","post_message":"The more head blows a child sustained, the more changes were seen in their brain tissue, according to the study released Monday."}]
