[{"comment_id":"10153535690187235","commenter_b":"Smh then leave America . most people who care about a lion will definitely care about a person .... They are both worthy .","commenter_a":"Because the lion will see actual justice and the same can't be said about Sandra or any other person who has died while in police custody......how sad is America smh","post_message":"Someone had to say it ..."},{"comment_id":"809196999209345","commenter_b":"you are so full of it jeb - and you don't stand a chance. even insane republicans are done with the bushes. what's the policy on a presidential candidate's brother being a wanted war criminal????","commenter_a":"I am saying \"boo,\" not \"boo Jeb,\" though I AM booing Jeb. Boo!","post_message":"Most passionate moments of #DemDebate are always about who will ban more guns and who will give the gov't more control over your health care."},{"comment_id":"10153114864642144","commenter_b":"Bitch is a hater","commenter_a":"I don't even care about McCain but to be dismissive about his service to our country is disrespectful. Trump is an asshole.","post_message":"Low, even for Trump"},{"comment_id":"1155777891187482","commenter_b":"Clear to me this woman is smarter than you will ever be.","commenter_a":"This woman is a mercenary. She has no morals, ethics or integrity. Just a few months ago when she was on Ted Cruz' team she was bashing Trump for all the things that she is now defending him. She would say just about anything for a buck.","post_message":"Reports about Kellyanne Conway are greatly exaggerated."},{"comment_id":"10155026272596320","commenter_b":"Loose lips sink ships!","commenter_a":"There saying nothing","post_message":"REPLAY: Senate hearing on Russian hacking. Office of the Director of National Intelligence NSA - National Security Agency"},{"comment_id":"10153438703061130","commenter_b":"A FEMINIST is for EVERYONE.","commenter_a":"this woman is a complete poser. she does not stand with all women. just ask conservative women orgs","post_message":"\"Saying something is almost always better than swallowing it and then thinking about it for two days.\""},{"comment_id":"1152705121429163","commenter_b":"Illegals are voting in our elections.","commenter_a":"Don't you think you should stop asking this question and read the Constitution of the United States dumbass!","post_message":"I Agree!"}]
