[{"comment_id":"1587873301226283","commenter_b":"They won't do that. They are professionals and have ethics.","commenter_a":"This is how it is going to work now for the Libs. If you voted for Trump there will be a price to pay. Lost a lot of money because of Obama in Office and I let it be. Be careful Libs, Don't get Jammed up. Most of the Police, Firemen, and Military are Conservative. What would happen if they decide not to respond because your a known Lib.","post_message":"\"WON'T BE BULLIED.\""},{"comment_id":"10152570511717212","commenter_b":"Tiu wull be my wife","commenter_a":"He has a wife? And a kid? There is hope for us all! WTF? Freak!","post_message":"A man is in Oklahoma City police custody after a standoff early Friday morning. According to police, the man could be heard yelling about a number of issues including what happened in Ferguson, Missouri, and about his wife and kids."},{"comment_id":"10158183422455594","commenter_b":"What message are you sending? That nutty women can run around dressed as vaginas and cry out for the \"right\" for women to kill their innocent babies? Some message from you silly chicks.","commenter_a":"Funny how the negative comments are posted predominantly by males. Do we make you nervous and uneasy? Good. You should be nervous.","post_message":"Crowds went berserk for the big-screen actress as she waxed poetic in R-rated language on women's rights and the perceived threat the new administration poses to those liberties."},{"comment_id":"10153717655651323","commenter_b":"I'm sure mosques will be very useful for Syrian refugees in Germany. Are you for real?","commenter_a":"Focussing on mobile phones while poor syrians are getting genocided by poseidon in the mediterranean? Fucking white neonazi shitlords.","post_message":"You will soon be able to ignore your friends and family in Europe as well as at home for no extra cost."},{"comment_id":"1722190664688272","commenter_b":"Go back to your Country!","commenter_a":"Then get the hell out of our country.. go back to your country so you can smell camel s***","post_message":"Muslims Throw Fit Over Odor From Bacon, Then THIS Happened Do you love the smell of bacon? @webpagelink"},{"comment_id":"10154221705040530","commenter_b":"What a dumb bitch!","commenter_a":"Black on Black crime really needs to stop. So sad this young lady endured such hatered and pain from peers of her own. Rest in peace. I'm praying the killers are soon arrested and face the fate of their punishment real soon, behind bars for the rest of there life and no parole it will serve them right","post_message":"Amy Inita Joyner-Francis, 16, died Thursday morning during a violent attack in the girls bathroom."},{"comment_id":"832342470197694","commenter_b":"Boring!","commenter_a":"We do the very same things here today.","post_message":"What do you see in this inkblot?"}]
