[{"comment_id":"538992992891961","commenter_b":"Girls are just mean....need to face murder charges....they need the death penalty....need to be tried as adults","commenter_a":"They should all get life","post_message":"Three high school girls in Delaware are facing criminal charges over the fatal beating of a classmate inside a school bathroom last month. What could have caused them to do this?"},{"comment_id":"1527434820649594","commenter_b":"@username she's a cow","commenter_a":"They are like at least 5 articles about Kim Kardashian every day.. Kinda tired of this. She was robbed and shes still rich and has millions in the bank. Its not the end of the world. They are things & news that are MORE important than Kim's life!","post_message":"Kim Kardashian West's friends are rallying around her"},{"comment_id":"1048569925162760","commenter_b":"Prenup is what he needs he doesnt need ladies he see's to try and take His money.. IMO she isnt all that but hey if he likes/loves her... I dont care how much money she has.. Prenup is always the best way to go if your famous.","commenter_a":"Focus on getting the super bowl ring 1st please! If you get her a ring you better get a prenup.. just saying..","post_message":"Seahawks quarterback Russell Wilson hinted on The Dan Patrick Show that he and Ciara could soon be engaged. When asked which would come first, Super Bowl ring or engagement ring, Wilson responded, “hopefully both.” Check out training camp photos here >>kiro.tv/SeahawksCamp"},{"comment_id":"1083798354993969","commenter_b":"You're an ignorant cunt Rosie","commenter_a":"Sell yall anything and then yall prounce on it. He ain't sided with humility that's his only thing he can do to them white bois. As a black police officer he can't beatem, rough them up, shootem, killem like they do \"somebody's\" people. That's for sure a death sentence then.","post_message":"When a KKK member suffered a heat stroke at the hate rally in Columbia, a black police officer put aside his personal feelings and sided with humanity."},{"comment_id":"10153697709133984","commenter_b":"He'd never make it to prison if that was my daughter or granddaughter. But since he will hopefully go to prison, its a shame someone never showed him an illustration on a blackboard about the size of your asshole before prison and the size it is when/if you get out. Maybe he would then have had sense enough not to rape a child. When he goes to prison he's going to find out what real rape is like...good.","commenter_a":"Castration sounds good to me. He wouldn't do it again","post_message":"This sick punk raped a young girl and admitted to it... but the disgusting thing is his absurd excuse. Our country is in deep trouble and this proves it... this little girl did nothing to deserve this."},{"comment_id":"540716409449985","commenter_b":"they screwed up their country, and all they want is to screw up the rest of the countries","commenter_a":"Hell No !","post_message":"COMING SOON in your city and town..."},{"comment_id":"1221564884584907","commenter_b":"No one would stalk you, Hillary!","commenter_a":"Well Hillary, I believe you are safe with Donald. He isn't desperate enough to grab yours ! Besides he is a gentleman, not all men are like Bill Clinton.","post_message":"Seriously? So lame..."}]
