[{"comment_id":"1816447821944782","commenter_b":"put a sock in it bitch","commenter_a":"What if Trump said he was here for the white folks. These people just don't get it.","post_message":"Former Bernie Sanders campaign spokeswoman Symone Sanders just appeared on CNN to weigh in on the future of the DNC and the Democratic party."},{"comment_id":"10154331117659411","commenter_b":"News Flash: You've probably used the bathroom with a Trans person and not even known it. You know what Gender Neutral bathrooms are good for? A dad being able to use a changing table because those things are all to rare in the men's bathroom. Gender Neutral bathrooms make sense and honestly if you're so worried about your kids then go to the bathroom with them. Oh wait! Women can't go in men's bathrooms with their sons so their sons have to go alone or go into a women's bathroom just to piss.","commenter_a":"He wasn't even transgender. Criminals will break laws no matter what and being trans is not a mental illness!","post_message":"The girl mother, who was in the adjacent stall, heard her daughter screams and rescued her, while restaurant patrons held the suspect until police arrived."},{"comment_id":"10154532453451051","commenter_b":"@username, do you kiss your boyfriend with that mouth?","commenter_a":"You're goddamn right I do. Hope he cracks down on the obstructionist Dems swiftly, and mercilessly, and for those who will inevitably say \"Oh, but the GOP were nothing but obstructionist with Obama! Buhuhuhu.\" To that I say: Elections are a game of King of the Hill, we now have the Hill and soon all 3 branches of Government. I'm not gonna entertain that \"moral high ground\" game, no, this is strategic warfare plain and simple, and we have the strategical advantages.","post_message":"Do you support Jeff Sessions as attorney general?"},{"comment_id":"10154360236166523","commenter_b":"He is not a queen","commenter_a":"He is a QUEEN. Only the packers can get dominated the whole 1st half and go into the locker room with the lead.","post_message":"Mr. Aaron Rodgers -- the Hail Mary King! via.fox6now.com/ZsBiQ"},{"comment_id":"10152930129086051","commenter_b":"kill the bitch","commenter_a":"Set her on fire...","post_message":"First she poured gasoline over her daughter. Then she lit a match. And then she tossed it."},{"comment_id":"10153172623814153","commenter_b":"I don't have compassion because of their careers I have compassion because I'm human","commenter_a":"How many of you would be screaming compassion if he wasn't a cop? And a history of DUI? Please. I have no compassion for anyone who drives drunk or gets into a car with a drunk driver.","post_message":"MVC Records: Officer Pedro Abad Jr., driver in deadly Staten Island crash, had 2013 DUI in Rahway. Read more: @webpagelink"},{"comment_id":"683830911775006","commenter_b":"WHO CARES!!!!!!!!!!!!","commenter_a":"So she is smart good for her.","post_message":"People are freaking out over what's being said about Taylor Swift today..."}]
