[{"comment_id":"1579218252372572","commenter_b":"You k ow it is . She can't win. Otherwise","commenter_a":"Narcissists must have someone or something to blame for their inadequacies and failures.","post_message":"\"I'm afraid the election is going to be rigged, I'm going to be honest,\" Donald J. Trump told a crowd on Monday, just days after he criticized the \"unacceptable\" general election debate schedule."},{"comment_id":"1022130381169318","commenter_b":"CUMMING are stupid brats !","commenter_a":"OMG what a crock","post_message":"Come on..."},{"comment_id":"10153847730226336","commenter_b":"Those widows aren't afraid to strap on a vest and blow innocent people to pieces ...#mrpresident","commenter_a":"He could never win a debate with Cruz.","post_message":""},{"comment_id":"10153666146819099","commenter_b":"Shut up you dumb broad","commenter_a":"Get guns off the street. It's time for stricter gun laws.","post_message":"A 30-year-old wanted criminal with 12 prior incarcerations allegedly shot a 33-year-old NYPD officer in the head in East Harlem, authorities say ----> @webpagelink"},{"comment_id":"10153855927834330","commenter_b":"Wow","commenter_a":"You kids are borderline retarded","post_message":"\"Dewshine\" is a mix of racing fuel and Mountain Dew. Two teens are now dead after consuming the highly toxic mixture ---> @webpagelink"},{"comment_id":"992434430797029","commenter_b":"That woman needs to be locked up in the nearest lunatic asylum.","commenter_a":"Pathetic & scary scenario is these lunatics own guns! She probably packs a gun in her Walmart plastic purse! When these nut jobs escalate as she did, back up & run!","post_message":"Something tells me this nut is a Tea Partier."},{"comment_id":"10153732430689117","commenter_b":"It is a completely legitimate discussion. In the 21st century private corporations have power equal to or even greater than a government's over people's platforms for speech and expression. In 10 years it is entirely possible that a single multi-national company will control all of the major social media platforms. Which means they could quite easily silence any viewpoint that they don't like. This in fact is already happening in many places around the world. Mark Zuckerberg will eagerly jump into bed with any ruthless dictator and agree to censorship on that country's population.","commenter_a":"There is no free speech war to be had. Twitter is a private entity and can ban who ever they like, for what ever reason. They do not have to abide but the first amendment, the government does.","post_message":"#FreeMilo just became a thing. Thanks, Twitter."}]
