[{"comment_id":"977688075599947","commenter_b":"Dirty whore","commenter_a":"HOA president needs to remember where she lives!","post_message":"How idiotic!"},{"comment_id":"10154900824501037","commenter_b":"Obama is playing on Americans. He wants to play a nice guy. He knew all powers for executive orders has been striped off him. He wants to turned american workers against trump's adminstration. And gain cheap popularity from clueless workers. Obama's intentions for america is bad. this is just a cover up. Watch out. He will try something like this again even wen he knew that he doesn't have power to do so. Just to make names for himself n pave ways for his wife 2020. Am one person obama can't fool. All his doing is to put trump in a tight corner n make him look like a bad guy. His a hypocrite and no one shud take him serious. Hilary and obams wants to make sure that trump did not succeed.","commenter_a":"I hope this judge dies of pancreatic cancer.","post_message":"A devastating blow to one of Barack Obama's signature achievements for boosting wages."},{"comment_id":"1417299944952004","commenter_b":"They are illegal immigrants. Reagan granted amnesty in the 80's and it was to be a one time thing for those already here. Settled once and for all. But they keep coming. And this problem is not just from Hispanics although they make up the majority of inflow. If they couldn't come legally then they shouldn't be here. People have been coming legally for 100 years (like my father and his parents). No excuses. They are breaking the law and need to be deported.","commenter_a":"All he has is big ego","post_message":"Dude! Really??!"},{"comment_id":"1264285906955844","commenter_b":"Agree public should not enable bad behavior from 15 year old kid.","commenter_a":"She ain't no child, she wanted act grown, so she got treated likes she grown. Please don't sympathize with her, you are only enforcing the behavior that she is a \"child\" and she can get away with anything.","post_message":"\"The juvenile had to be detained.\""},{"comment_id":"10153789938206680","commenter_b":"yes there is, put her in jail.","commenter_a":"Former \"Bush\" defense official??? Go figure!","post_message":"The United States' adversaries, James Clad says, \"must never hear flippancy or ignorance in America’s voice.\""},{"comment_id":"10152535254222623","commenter_b":"It'd be great if people actually read, studied and paid attention in school and did something with their lives except screwing, rolling blunts, and figuring out ways to commit crimes.","commenter_a":"Look at the parents. Poor child","post_message":"A mother and father have been charged after police found video of a baby playing with a real handgun."},{"comment_id":"899714753418554","commenter_b":"If we sent the illegals home wages would go up. It is called supply and demand. What are our collages and universities teaching these days?","commenter_a":"That's about half a million jobs for our citizens if we sent them home.","post_message":"Wow."}]
