[{"comment_id":"10153155404671323","commenter_b":"'@username cool your jets mate !! Why should this woman or any woman in her situation sit around and wait for her breasts to kill her when she can do something proactive !! Do you know what it feels like to have the threat of your breast tissue turning against you and threatening your life !! Arrogant shite !","commenter_a":"What the fuck are you taking about? Are you a complete imbecile? She has a genetic mutation. This has nothing to do with chemicals. Besides, there are thousands of scientist like me around the world doing research to cure and prevent cancer. Read more before spreading nonsense.","post_message":"'I love my boobs but they have to go'. YouTube star Claira Hermet says goodbye to her beloved breasts before undergoing surgery for a double mastectomy"},{"comment_id":"1644623019109095","commenter_b":"Dear: Mr. trump; you have a nice fire burning for yourself, why open the damper and burn it out?","commenter_a":"Mr. Trump :If you truly believe in America, stop the hate talk: read, or have read to you, both the Constitution of these United States and the Declaration of Independence. My Uncles served in World War 2 to protect us from the Fascists (Dad had medical issues and couldn't serve in the military: worked for the government instead!) : by posting this, I'm hoping someone will connect the dots and know that's what you are!","post_message":"Statement on Preventing Muslim Immigration:"},{"comment_id":"10152958959170927","commenter_b":"she can give up citizenship which is just fine with me, at least in this country she can say this stupid remark, want to try to do so say in Hungry","commenter_a":"Leave","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10155049967862619","commenter_b":"Is that how they saying thank you to Israel for taking care of there refuges and is nobody can have Golan except Israel because were given to Chosen People God so Syria,Palestinian and all Muslim keep your hands away from Israel territories.Amen.","commenter_a":"BE STRONG GOD ALWAYS WITH YOU''","post_message":"Benjamin Netanyahu - בנימין נתניהו responds to Syria!  -VirtualJerusalem.com"},{"comment_id":"1342320752468340","commenter_b":"Happy to see a change in the Mayor's house! See ya!","commenter_a":"if first lady gets this, what can common man expect,...","post_message":"The mayor said she was merely expressing happiness for 'change in the White House.'"},{"comment_id":"1394774427201577","commenter_b":"She shouldn't even have a job because she is an illegal alien.","commenter_a":"Frank tokar maybe if you were in her parents situation would do the same , you do anything to make sure sure your children are safe and have the best you can give them , USA is a líder no a low un respectful selfish heartless country thanks god no every American think that way USA is a country of opportunities no one takes your jobs away all depends on you how hard you work .","post_message":"Rick Santorum and Anna Navarro engage in a passionate exchange with a DREAMer who says she may lose her career if the new administration ends DACA. @webpagelink"},{"comment_id":"10156981662980603","commenter_b":"She's a stripper, no joke.","commenter_a":"Obviously this woman is so used to wear no or very little clothes that she sees nothing wrong with that 'outfit' she wore.","post_message":"Do you think her shorts were inappropriate?   A. Yes B. No C. I don't know"}]
