[{"comment_id":"10153327022163984","commenter_b":"I hope that he succeeds She is Satan","commenter_a":"Go all the way with this!!!!","post_message":"It’s been just over a week since Hillary’s announcement set off a firestorm of negative press about her past.   But one scandal stands out… Benghazi! Send an email to Rep. Trey Gowdy and tell him to pry the truth out of Hillary Clinton!"},{"comment_id":"10152865341779342","commenter_b":"Mexicans do deserve some credit so here it is. Murder up 67%- committed by illegal aliens Child molestation up 97%- committed by illegal aliens Rape up 53%- committed by illegal aliens Gang violence up 78%- illegal aliens Robbery up 62%-committed by illegal aliens aliens Car thieft up72% - committed by illegal aliens Economy down - contributed by illegal aliens Jobs down - contribution illegal aliens aliens Welfare abuse up 98% - fraudulent claims filed by illegal aliens aliens I could keep going but I think you get the picture.","commenter_a":"Want Mexican music go to Mexico. Pretty simple don't you think?????","post_message":""},{"comment_id":"1759120751072019","commenter_b":"I don't want refugees coming in and I want Muslims out","commenter_a":"Wear a Make America Great Again hat! Fuckem!","post_message":"This was powerful!"},{"comment_id":"913240742032115","commenter_b":"this is not true...try 99999999x","commenter_a":"When you stand 10 x","post_message":"You Know You’re In A Black Church When…"},{"comment_id":"10157252246585354","commenter_b":"Lorena Bobbitt needs to take care of this demonic trash creature!","commenter_a":"Deplorable.","post_message":"**UPDATE**  That's it?!"},{"comment_id":"10154293014660329","commenter_b":"That ugly ass bitch is a hater.","commenter_a":"Reyna Zavala Giovanna Siqueiros Princess Vespa No pues wow","post_message":"\"Swish!\" - Amber Rose, probably // Kanye West"},{"comment_id":"10153424598644726","commenter_b":"Hillary's policies will be like Obama's policies on steroids!","commenter_a":"Hillary is just an echo of Obummer.","post_message":"WATCH: Hillary Clinton says Businesses don't Create Jobs"}]
