[{"comment_id":"1093108914084558","commenter_b":"exterminate the cockroaches!!!!!!!!!!!!!!!!","commenter_a":"Muslims are a cancer.","post_message":"Top U.S. Commander In Europe: ISIS is Like Cancer Among Refugees @webpagelink"},{"comment_id":"1263570023663025","commenter_b":"Be a lying pussy...ok","commenter_a":"Some People would not understand diplomacy, poise and intelligence go way further than acting out of anger and fear (like most of republicans are reacting) Obama is doing exactly what he is supposed to do!","post_message":"\"YOU ARE NEXT.\" President Barack Obama tells ISIS leaders they cannot hide. Read more: @webpagelink"},{"comment_id":"10152765303355950","commenter_b":"@username, \"Ridiculous comment. The complete opposite of what we should take away from this as feminists. Imagine what would happen if all of the barricades were removed & women could advance the way men do. Even more women would be standing where she is.\" Okay, so support your putative position with evidence, versus just asserting it like your job is done.","commenter_a":"Great! Now feminists can see that it is by working hard, getting really lucky, and not giving up that we are best equipped to fulfill our dreams, rather than trying to reengineer society... like the whole thing is just broken. Even the grass can get through concrete... with enough time and the right conditions.","post_message":"At 19 years old, Elizabeth Holmes dropped out of college. She had a little money and a big idea. More than a decade later, she became the youngest female billionaire in the world."},{"comment_id":"10153354138131680","commenter_b":"Any evidence statistically of that. Or is that what you think as a HRC supporter. Also I voted for Obama and I support Sanders this election.","commenter_a":"Her decision is very unpopular in Hawaii. Hawai'i Democrats are Obama Democrats. I would expect that she will face a primary challenge as a result.","post_message":"\"I’ve decided I cannot remain neutral and sit on the sidelines any longer.\""},{"comment_id":"10153944195789456","commenter_b":"Wht a woman will do against their children over a man. Smfh","commenter_a":"They should be stoned to death!! Wasting bullets on them is too humane....","post_message":"HORRIBLE: A 3-year-old was found duct taped in a trash bag in a closet in Arizona, and was surrounded by feces. Here’s the disgusting reason the suspect allegedly hid the child:"},{"comment_id":"1180816798605996","commenter_b":"Our babies are so talented and intelligent","commenter_a":"Aram Kc Julia McLeod Ayling","post_message":"Happy International Cat Day!"},{"comment_id":"10154024812315470","commenter_b":"Lol, whatever you have to tell yourself... moron.","commenter_a":"Seeing how anti-science Bernie is and how his followers uncritically swallow his anti-science stand I wouldn't be shocked by the numbers that try this.","post_message":"BE ON THE LOOKOUT! A picture going around on social media looks like an ad supporting Bernie Sanders, offering instructions on how to make so-called Bernie Sanders glow sticks. The recipe is actually for a deadly chlorine bomb."}]
