[{"comment_id":"1587581361533554","commenter_b":"Can we let her off with this one? I think it's in the public interest if we don't see that. The photographs of her having sex in a field were enough.","commenter_a":"I protest to this, I wouldn't wish that sort of cruelty on any sausage. Plus lets face it there would be no room for the sausage when her head is so far up there..","post_message":"On 4th May Hopkins tweeted \"If Sadiq Khan wins London, I will run naked down Regent Street with a sausage up my bum in protest #LondonMayor2016.\"  She later tweeted: \"I'm a woman of my word.\""},{"comment_id":"1197017153648966","commenter_b":"Get her on board and watch him sink........","commenter_a":"Her only claim to fame is loosing and quitting.","post_message":""},{"comment_id":"591336634387962","commenter_b":"Build the wall!!","commenter_a":"That's California for ya. I find nothing wrong with what he said in 1971. Things were different then. I said things in 1971. Does that mean I'm a racist today? I am military where everyone's color is either desert camo or woodland camo. I find affirmative action quite racist. Employers should be able to hire people because of their skills not because of the color of their skin. Absolutely ridiculous.","post_message":"California lawmakers refuse to honor John Wayne! and here's why..."},{"comment_id":"10153724000373132","commenter_b":"Then she will have another kid.","commenter_a":"If she's stupid they will. So yes they'll end up back together","post_message":"In this week's PEOPLE, we learn why Scott Disick blew a second chance with Kourtney Kardashian.  Do you think they'll ever get back together?"},{"comment_id":"1354018291282776","commenter_b":"Lol a bitch","commenter_a":"Colin, the multi millionaire football player only started feeling oppressed after he began dating a devout Muslim. He now hates everything American, but still takes advantage of everything American!","post_message":"If they thought their fans would blindly go along with any insult to their country, they were sorely mistaken..."},{"comment_id":"10153257370521130","commenter_b":"She probably wouldn't be as beautiful as you are","commenter_a":"Mehul","post_message":"He said she looked very beautiful and attractive before marriage, but when he woke up in the morning and found that she had washed the [makeup] off her face, he was frightened as he thought she was a thief."},{"comment_id":"636085169915395","commenter_b":"Fuck her .Nan I can't wait for her and her worthless ass husband to get out of office.","commenter_a":"I think her and her fucktard of a husband both have lost their fucking minds we are in America people if u don't like it get the fuck out!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"}]
