[{"comment_id":"517132878459126","commenter_b":"Right under this post is an article that says blue nation review gives Hillary Clinton her own media wing.","commenter_a":"But the Word of God is in our heart, never to be taken away, Glory to God","post_message":"The numbers are undeniable."},{"comment_id":"899262110108885","commenter_b":"So Damian... You too... Just bAck up bitch .... READ THE 4TH AMENDMENT !!!!","commenter_a":"I saw this video when it first came out. During the struggle the kid mounts the cop and beats his face in.. Consistently , cop struggled and shot him. Tall goofy for this one. Watch the full vid , kid is a douche asking for trouble","post_message":"\"I don't have a weapon..\" -- Some of Deven's last words. He was shot 7 times by a cop. Get RISE OF THE WARRIOR COP for free: @webpagelink WARNING: This video contains graphic content. The full story has finally been exposed, thanks to Matthew Cooke."},{"comment_id":"1038357019610877","commenter_b":"If BERNIE goes Independent, or goes Green, then Good, Hillary is a bitch, a liar, a thief. BERNIE should do anything and everything he can to defeat the nasty bitch. #NeverHillary #BernieSanders2016","commenter_a":"We may still be able to achieve some things of value at the convention. Bernie's current top priority at the convention (as stated in a conference call with his delegates) is to change the Democratic party rules to \"un-rig\" future Democratic primaries so they will be fair to future Democratic party presidential candidates. For him (and our delegates) to have any chance of making future Democratic primaries more fair via votes in the rules committee at the convention, we need to get all our pledged Bernie delegates funded. We are still at risk of losing over 100 pledged Bernie delegate votes, purely due to lack of funds. That's down from over 200 a couple of weeks ago because we have never stopped trying to get them funded. For everyone who is #StillSanders, can you please consider donating $2.70, $5 or $10 (if you can spare a few dollars) to help ...","post_message":"We are building a movement because this country belongs to all of us - not just a handful of billionaires and wealthy campaign contributors. And I'm asking people across the nation to come together and organize an unprecedented grassroots movement."},{"comment_id":"10152855879679753","commenter_b":"Bitch! F*cking bitch.","commenter_a":"My heart breaks for what that poor boy must have gone through.... how anyone can harm a child I'll never understand. I agree with others here. The parents knew he was being beaten. Something should have been done sooner.","post_message":"This woman did something horrifying to her 3-year-old nephew, all because he was having difficulty with a spelling lesson."},{"comment_id":"1347077192027276","commenter_b":"LuAnn...I guess you are ready to pick some fruits and veggies for 2 bucks an hour in any kind of weather mind you! Oh and then remember anything coming in from Mexico like tequila and avocados will cost you 20 cents more for every dollar the item costs! Hmmmmm! So, we are paying for the wall!","commenter_a":"Round 'em up ... head 'em out... back across the border... if they are here illegally they have already broken the law they do not need to be here number one . it's the rule of law .. number two .. it's common sense for the survival of the Republic ... BUILD THE WALL ... and whatever else it takes to keep them out .. they want to come in they can get in line and do the process ...","post_message":"Speaking at the CPAC today, President Trump says he intends to keep his campaign promises:"},{"comment_id":"1295671170453891","commenter_b":"@username they danced!!!","commenter_a":"Winner eats the loser....","post_message":"Yes. Dinosaurs danced."},{"comment_id":"10154405981987300","commenter_b":"But they're still ten times better than ungrateful immigrants from African hell holes!","commenter_a":"They have everything covered. Police union, the system, their own partners that lie to protect themselves, the idiot that post all over the internet \"back the blue\", they get a free meal because if they don't, they'll make a tantrum and call the police and the news, etc, etc, etc. A simple war veteran (which, to me, has more respect that this parasites of society), don't get much back up when they get in trouble. Of course I'm talking about the bad cops. Because their is bad cops, right?","post_message":"“It’s too emotional to see your baby caught up in something like this.”"}]
