[{"comment_id":"10154028327039411","commenter_b":"Might have a heart... But she has no brains.... Sadly without that.. She is and 326683984410ard like you :)","commenter_a":"Punished for having a heart and a conscience.....","post_message":"'Military jail frightens me less than our society losing its humanity'"},{"comment_id":"1118891848162172","commenter_b":"YES! And I hope they do throw her in jail!","commenter_a":"WTF!! Put her ass in jail! She is just as guilty, that's premeditated...she knew about the plan and let it happen","post_message":"She reportedly 'tried to talk him out of it,' but that's it."},{"comment_id":"554226841431375","commenter_b":"Hillary is the dispicable one calling Millions of Americans all kinds of names that do not want her for President . So save all your outrage for Hillary , oh that's right . You hypocrites don't have a problem with Hillary doing it and yourselves as well . Shame on you Debbie and all like you .","commenter_a":"The nasty, inconsiderate, unemphatic comments are disgusting & shame, shame on everyone making them. Hillary has run herself ragged & not surprised she's got pneumonia. Coughing a lot lately. She's exhausted. No wonder. Be careful what you say because it'll come back to you tenfold. #KARMA","post_message":"JUST IN: Hillary Clinton was diagnosed with pneumonia on Friday, her doctor says. The doctor revealed the condition hours after Clinton stumbled while leaving a 9/11 event. @webpagelink"},{"comment_id":"1174388402587813","commenter_b":"Liars!!!!","commenter_a":"Democrats are for war on women, which is not really a war, except in their feeble minds...","post_message":"When the two Bills—Cosby and Clinton—were accused of sexual abuse, the two wives—Camille and Hillary—led the effort to blame the victims."},{"comment_id":"10156446544055594","commenter_b":"That woman needs alot of things","commenter_a":"We all only have so many minutes that make up our lifetime. This is a premeditated act of terrorism for which they should all be jailed for a minimum of a year.","post_message":"LIVE video and coverage as protesters are being removed and traffic is backed up on the Bay Bridge."},{"comment_id":"569916976504180","commenter_b":"'@username, different country different faith but people still using the text to justify murdering gays. Was it the predominantly Muslim US States that passed the 'Gay panic defense?' @webpagelink","commenter_a":"Good on you, Bruce. Christians warned us about Sharia law, and now they've imposed their version of it on us. Irony?","post_message":"'Some things are more important than a rock show.'"},{"comment_id":"10154347053069411","commenter_b":"45 million people on food stamps. 30 million illegal aliens allowed to run free while a record 2.3 million Americans are locked in jail. The largest national debt in the last 240 years. A record 95 million Americans are not in the labor force. The longest streak of war time in American history with 22 veterans committing suicide a day. A healthcare system than now kills a record 500,000 Americans each and every year while maiming millions more. The muslim Democrat Obama has proven he is an epic failure. Obama is killing Christians globally.","commenter_a":"People need to stop acting like that to cops if you keep resisting that's what happens! These cops are doing the best they can.","post_message":"'We f**ked'"}]
