[{"comment_id":"880395268723393","commenter_b":"She was armed with a deadly weapon. I hope she suffered.","commenter_a":"She was probley scared when all those security came at her with guns drawn thats why she tryed to move the car. Hands on steering wheel not reaching for wepon. They didnt have to shoot her.have you noticed all the killings for petty crimes like selling cigerettes, stealing a pk of cigerettes. Being homeless, even jaywalking or talking back to police. This is not a good situation. Real criminals who rape and torture getting away with it because the police would rather arrest or kill someome who is not a threat. I am ashamed of the police who do these things and the other cops who watch and do nothing and of the law that always finds brutal cops innocent. I am afraid of the police many people are. Since when should we pay for a legalized brutal mob. May god help us","post_message":"New details emerge about the 2013 shooting of an unarmed woman on Capitol Hill."},{"comment_id":"835505926554037","commenter_b":"I bet she get tax breaks on her taxes.take a few seats missy","commenter_a":"C U NEXT TUESDAY !!!","post_message":"Does this woman realize she's shopping at Walmart, where wages are so low that many workers qualify for public assistance?"},{"comment_id":"1279396932093344","commenter_b":"This is why I hate narcan","commenter_a":"Horrible heroin.","post_message":"\"This child can't speak for himself but we are hopeful his story can convince another user to think twice about injecting this poison while having a child in their custody.\""},{"comment_id":"10154175784276509","commenter_b":"So how bad do you want a woman elected?","commenter_a":"Bernie Sanders cannot win a national, general election. Social media supporters should probably accept this.","post_message":"Bernie Sanders is signaling that he's increasingly willing to take personal shots at his chief rival Hillary Clinton in the Democratic primary."},{"comment_id":"10153557927483984","commenter_b":"More liberal stupidity","commenter_a":"This is just getting Americans used to having freedom taken away from them. One step at a time until Americans have no freedoms to do anything. This will stop when Liberal politicians are voted from office.","post_message":"Wow. Taking the Confederate flag down from state capitols was controversial enough, but this is on a whole new level. A lot of people are going to be furious...  Do you think Congress has gone too far?"},{"comment_id":"10154499778649091","commenter_b":"Edwin, you only sound ignorant.","commenter_a":"I proposed a law in which all pit bull owners and their dogs take obedience training. The dogs and owners should take some test to see if dog can handle being around people. Too many times do I read stories about pit bull attacks. I know they all aren't bad, but some tend to snap and kill or severely injured people. Let's all write to trump so he can executive order this law","post_message":"After a young boy was seriously injured after being mauled by one of two pit bulls inside his Brooklyn home, his uncle says the 5-year-old took the brunt of the horrific attack to protect his younger siblings."},{"comment_id":"935883909841195","commenter_b":"Hey Bill,,, @webpagelink","commenter_a":"Batchit crazy Bachmann the 2nd....","post_message":"This is how much the Fiorinas are worth."}]
