[{"comment_id":"1324741860927476","commenter_b":"You need to stop getting your news from the crazy woman on the View!","commenter_a":"No terrorists came out of the 7 countries he banned why doesn't he ban Saudi Arabia where most 911 terrorists were from. Also Egypt and two other countries. Neither was the ban about illegals people with valid visas and green cards were also detained, even the ex prime minister of Norway traveling on a diplomatic passport was detained for questioning..I support Washington states action. The president is not above the LAW .","post_message":"'We're not going to allow anyone in Washington, D.C. to trample on our rights as Washingtonians, President or otherwise.' Gov. Jay Inlsee reacts to the judge's ruling to temporarily block President Trump's travel ban. READ MORE >> @webpagelink"},{"comment_id":"10153159279537452","commenter_b":"^^ wrong house","commenter_a":"How about the government stay out of our homes.","post_message":"THIS JUST IN: The Los Angeles City Council unanimously voted to require guns that are stored at home to be kept in locked containers, disabled with a trigger lock. abc7.la/1GGHSUi"},{"comment_id":"10155086902812235","commenter_b":"UK agrees Americans you created this problem now fix it Europe do not want a war","commenter_a":"How much longer are the American people, the ones who didn't vote this idiot in, going to let this go on, this ego maniac is ruining your beloved country, it is the laughing stock of the world thanks to him, how can any government anywhere take this moron seriously and trust him with anything, he lies through his teeth, blames everyone else for whatever is going on, it has only been 4 weeks and look at the state of things ! My thoughts are with the American people who didn't vote for this buffoon, i hope your country can get rid quick and recover from his dreadful influence !","post_message":"'I was hoping you could tell me what the f*ck is going on over there?' - European security services ask."},{"comment_id":"983326201715214","commenter_b":"his momma owes him a butt whooping is all... since he probably got no daddy","commenter_a":"Send him back to Africa and let him live the life he would have had if his ancestors would have stayed there","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING."},{"comment_id":"937869812915107","commenter_b":"I hope they suspend her license and hope the liar loses her job!","commenter_a":"She should loose her job & be required to stand on corner with sign showing what she is","post_message":"Our favorite ‘just deserts’ of the week!"},{"comment_id":"695324637324781","commenter_b":"Get ISIS and obammy out of AMERICA first. We need to protect ourselves and children. Then we can help ours.","commenter_a":"Wipe them off the face of the earth!!!!!!","post_message":"An innocent American girl was found in the middle of this ISIS debacle. America now truly stands with France against ISIS. Do you think that America should wipe ISIS from the face of this planet?"},{"comment_id":"937487649627809","commenter_b":"NO, NO, NO. Why is there even a question about this. Too many illegals in this country already. Do you want more?????","commenter_a":"Everytime I think I hear the dumbest thing ever, something else trumps it. I cant believe how unpatriotic some folks are now days. America is for Americans. Become an American and then you can vote. No intelegent group would ever let an outsider make a decision for them. It doesent make sense.","post_message":"More than 1 in 3 Americans believes illegal aliens should have the right to vote in U.S. elections, a figure buoyed by the majority of Democratic voters who favor the idea. @webpagelink"}]
