[{"comment_id":"10153290749172426","commenter_b":"Had he handled it the nasty note wouldn't have been left. Women can be shallow. Personally I pay quite frequently but you can't tell me this dude doesn't know how his wife can be...so just handle it.","commenter_a":"Classic husband who didn't even pay for the meal and the wife had to....lmao","post_message":"'So Jenny, here's a life tip for you from me...'"},{"comment_id":"804496683016845","commenter_b":"Fuck pigs","commenter_a":"Beyonce fine do your protest but don't be a hypocrite and be escorted to the stadium by law enforcement. Let the Black Panthers escort you. Don't half ass protest, walk the talk all the way and if you can't then STFU","post_message":"This RACIST liberal meme claims complaints about Beyonce's Superbowl are proof of white privilege and an aggression against blacks. But as usual the left gets it totally wrong and proves they know NOTHING about history.  We take this vile meme and destroy it with historical facts!"},{"comment_id":"10154641793644614","commenter_b":"She's a freaking pig!","commenter_a":"Hope she rots in hell!","post_message":"The mother of Victoria Martens, the 10-year-old girl who police say was drugged, raped and killed, had allegedly used an online dating website to arrange for men to sexually assault her daughter in the past, according to a search warrant.   After her daughter was brutally killed, Martens told police that she watched her boyfriend, Fabian Gonzales, assault the little girl 'for sexual gratification,' according to the criminal complaint.  (Warning: The below story contains graphic and disturbing content)"},{"comment_id":"10153385478086756","commenter_b":"Real women do what they want to do. Feminism is about equality not which activity you prefer to do.","commenter_a":"real women go outside and play.","post_message":"Maddie found that in many video games, she could unlock the female characters by playing the game and amassing credit, but that could take hours. Or she could buy the character. On average, the female character cost $7.53."},{"comment_id":"839189072876028","commenter_b":"Women 4 Trump","commenter_a":"'@username is the smartest, strongest, most beautiful woman in America, and she will be our next president. #ImWithHer #SheGotOurBack #WeGotHerBack #HillaryAllTheWay","post_message":"Trump’s attacks on women’s health are inexcusable—and the rest of the Republican candidates are just as bad. hrc.io/1St92h4"},{"comment_id":"1073442816041814","commenter_b":"We all get there no matter who you are 4 days coming it will be so funny she doesn't know what she's talking about but you have to look at it he's an ignorant liberal socialist!!!!!!!! When she gets old just let her die!!!!!!!!! She is stuck on stupid!!!!!!!","commenter_a":"You will be old idiot","post_message":"Totally nuts!"},{"comment_id":"10153435939769087","commenter_b":"'@username Sorry you feel that way. She'll cheat and lie to you also.","commenter_a":"Who cares anymore what Bill Clinton has to say? He has no influence anymore. Why doesn't Bill & Hillary Clinton follow the law? why are they exempt from following the law?","post_message":"'It's important that we not be chumps when we decide what security provisions should be employed to check people's background,' former President Bill Clinton said. 'America is a place that welcomes all people who are willing to treat people the way they want to be treated, willing to follow the law, willing to create a common community.'"}]
