[{"comment_id":"10153180553634071","commenter_b":"ohh this one","commenter_a":"'@username Teresa Oanh Hoang","post_message":"She had something much better in mind."},{"comment_id":"10153348953162217","commenter_b":"I saw a mother the other day getting into her car with her pjs, slippers and a cup of tea/coffee. I would be so embarrassed to take my kids to school like that.","commenter_a":"It's really difficult to put a top and jeans on. Come on it's 2016 😉","post_message":"'There has been an increasing tendency for parents to escort children while still wearing their pyjamas and, on occasion, even slippers.'"},{"comment_id":"10155762960395354","commenter_b":"commands...???...commands what....","commenter_a":"Obama's greatest tool in his propaganda arsenal.","post_message":"Hollywood?   Check out what he told supporters...."},{"comment_id":"10154060101734087","commenter_b":"Hillary for Prison, if you vote for her you are worse then trash","commenter_a":"Suck on it Donald!!!","post_message":"Trump had choice words for a GOP senator who will not be voting for him."},{"comment_id":"1102356133153121","commenter_b":"dumb bitch","commenter_a":"Yooooooo I Knew She Was A Tranny!!","post_message":"‘I Stand Corrected:’ Wendy Williams admitted fault and apologized for her remarks about HBCUs.  Williams spoke with Roland Martin on Thursday's edition of The Wendy Wiliams Show where the NewsOne Now host eloquently summed up America's troubled past of slavery, segregation, and the oppression of African-Americans. WATCH the discussion and the NewsOne Now recap -> @webpagelink"},{"comment_id":"10153785606781636","commenter_b":"'@username it is illegal for a felon to be around a gun. Which means a felon shouldn't ever enter a gun range or be able to rent a gun!!!","commenter_a":"So wait?? You can just walk into a gun range and with no background check just 'rent' a gun? How does the gun range owner know that a person is legally able to possess a gun? How do they know the person isn't a felon or barred from possessing a gun??? Wth?","post_message":"Authorities say the gun range owner had no indication the man was suicidal."},{"comment_id":"10153068133586135","commenter_b":"Nope kids do not belong at wedding receptions! Especially with the cost of plates being so expensive!","commenter_a":"Can't stand the non-kid weddings. Just bring them. HA!!","post_message":"After their babysitter cancelled, Jessica Baker and her husband didn't attend the wedding because kids weren't invited. A couple weeks later, they received a bill for $75.90 in the mail to cover the meals they would've eaten at the reception."}]
