[{"comment_id":"601888693294679","commenter_b":"Pussy is pussy","commenter_a":"Almost every girl I've ever met before my current relationship has just been looking for someone to either buy all their shit so they don't have to work, or someone to be step daddy. Smh. I don't want to hear shit about unfair expectations.","post_message":"Well Damn!"},{"comment_id":"10153752557287093","commenter_b":"Derrick Perez","commenter_a":"You think she passed?","post_message":"OOPS ~ Police believe she was driving too fast and then hit the gas instead of the brake.... @webpagelink"},{"comment_id":"1082992428420186","commenter_b":"She will never be in jail","commenter_a":"How can she send people to jail from her prison cell?","post_message":"Dangerous person!"},{"comment_id":"591548094329175","commenter_b":"No, let her coach womens sports.","commenter_a":"Ridiculous. Why even keep score and give everyone a super bowl ring.","post_message":"Should females be installed as coaches on every NFL team?"},{"comment_id":"1054779971229141","commenter_b":"Shes just crabby because no one will rape her","commenter_a":"And thank here for elevating race hatred to a new high!","post_message":"Ann Coulter actually said Hispanic immigrants were responsible for the \"browning of America.\""},{"comment_id":"10153774465069170","commenter_b":"She is Pure Evil.........","commenter_a":"Gosh, I am so sorry that this is a waste of her time by the way she looks in this picture. This woman really believes she's above the law and she really needs to be indicted on this and her email server!!","post_message":"Forget all the analysis of this like it's a boxing match. All that matters is the facts that have been revealed, and these 10 minutes are the most important you can possibly see."},{"comment_id":"1020710211322060","commenter_b":"Alexcea Erini Apostolakis bod","commenter_a":"I think the poor girl should be left alone","post_message":"The birthday festivities never end for Kylie Jenner (via Daily Mail Celebrity)"}]
