[{"comment_id":"10153230871447708","commenter_b":"It's a good talk but you shouldn't make promises u can't keep. But you still have my vote","commenter_a":"Until AFTER election.....Read my lips...All the same","post_message":"I will oppose and veto ANY and ALL efforts to increase taxes. Join me in standing up for American taxpayers.  Click here now!"},{"comment_id":"1604088796561359","commenter_b":"someone get through their thick headed skins, that this is America and we do not have to do it. You respect my religion and I will respect yours, but this is not freedom of religion or freedom of anything but trouble. Your here follow our ways like all other immigrants have done.","commenter_a":"First of all why would you apply for the job at the place if you're Christian?","post_message":"THIS Muslim Company in The U.S. Is Forcing Their Christian Employees To Wear Headscarfs!"},{"comment_id":"1579733685658472","commenter_b":"But let's bring them here, and take our guns.","commenter_a":"If the FBI AND Homeland Security interviewed the shooter 3 times and still let him go, then with those standards how are we supposed to believe that Syrian Migrants are going to be properly vetted and America still be safe?","post_message":"American must now get very tough, very smart and very vigilant. We cannot admit people into our country without extraordinary screening."},{"comment_id":"1665486166837473","commenter_b":"Globalization needs to be ended for this country. Fight against UN agenda 2021/30 with every breathe you have!!!!","commenter_a":"It's a new day the second revolution has come we are taking back America and there will be some changes around here.Joinn us or leave us it's your choice.","post_message":"Everyday patriots..."},{"comment_id":"1322268537812600","commenter_b":"Hillary is NOT going to like her karma.","commenter_a":"Plane will be landing in Ecuador with pallets off fresh untraceable cash very soon....","post_message":"Smells like OBAMA....!  Details:  @webpagelink"},{"comment_id":"1586246148346927","commenter_b":"It looks like the hind end of A stripe ass baboon !","commenter_a":"Not just no but hell no I will burn any I find","post_message":"Michelle Obama does not deserve to have her face on anything. Will you buy these stamps?"},{"comment_id":"10153735112473984","commenter_b":"No joke you heathen bitch.","commenter_a":"Let's make an example of liberals and nonChristians by getting rid of them permanently. Bullets are cheap.","post_message":"For Kim Davis, this is Day 5 of her incarceration - but her lawyers just made an announcement that could turn things around.  Do you support Kim Davis?"}]
