[{"comment_id":"1641151569508654","commenter_b":"@username: no fault but Puerto Ricos...pretty sure they had a chance to vote for independence, and y'all didn't take it. You can have all the cultural pride you want...but it's the Olympics man, it is only for countries to compete in. Why not have Coca Cola and Pepsi join in?","commenter_a":"The underdog defeating the #2 in the world for gold.. Monica eres grande!!! PUERTO RICO!!! and to the bunch of salty Americans go read a book and learn about the damage the USA has done to PR!!","post_message":"After some of her more dramatic points, fans were shouting \"Si se puede\" and waving the flag of Puerto Rico."},{"comment_id":"10154499778649091","commenter_b":"Edwin, you only sound ignorant.","commenter_a":"I proposed a law in which all pit bull owners and their dogs take obedience training. The dogs and owners should take some test to see if dog can handle being around people. Too many times do I read stories about pit bull attacks. I know they all aren't bad, but some tend to snap and kill or severely injured people. Let's all write to trump so he can executive order this law","post_message":"After a young boy was seriously injured after being mauled by one of two pit bulls inside his Brooklyn home, his uncle says the 5-year-old took the brunt of the horrific attack to protect his younger siblings."},{"comment_id":"10156316346195725","commenter_b":"@username , but Muslims will not vote for him","commenter_a":"We need you now Donald Trump!!!","post_message":"Remember, I was the one who said attack the oil (ISIS source of wealth) a long time ago. Everyone scoffed, now they're attacking the oil."},{"comment_id":"842473555789986","commenter_b":"Why doesn't she leave planet earth!","commenter_a":"And the bad news is what?","post_message":"She's gone."},{"comment_id":"10158446067150354","commenter_b":"You little queer. I think my grandkids could fuck you up, fag!","commenter_a":"You won't stand a chance asshole come on bring it I'll save a hospital Bed it's waiting on you fucking RACIST RAT","post_message":"The shutdown of MILO event at UC Davis may be a preview of what to expect at next week inauguration of Donald Trump.   Just who are these hooligans?  Lee Stranahan investigates..."},{"comment_id":"932212166798963","commenter_b":"MEN are selfish!","commenter_a":"people can look at ass and other provocative videos all day. Things that children have easy access to and could potentially mess their mind, but yet everyone continues to make a big deal of pregnant/breastfeeding women. We need to get our priorities straight. #FirstWorldProblems.","post_message":"Pregnant meteorologist Kristi Gordon has been getting emails like this: \"... it is not pleasing to look at hump every day PLEASE have her take her mat leave now.\"  (Via The Huffington Post British Columbia)"},{"comment_id":"10155023483731037","commenter_b":"Fetuses are not considered sentient until around 6 months. Nothing wrong with an abortion within that time period","commenter_a":"Well, it would help if people quit having sex like rabbits and then run out and get an abortion because having the baby would be an \"inconvenience\". It's disgusting that 55 million innocent babies have been brutally murdered in a mere 43 years.","post_message":"An uptick in deaths, a slowdown in births and a slight drop in immigration all damped American population growth."}]
