[{"comment_id":"10153494218169705","commenter_b":"If only we had as much passion directed towards stopping child slave hunters around the world","commenter_a":"Betty is a National Treasure and girlfriend can let loose whenever she wants","post_message":"Betty White has some harsh words for the Minnesota dentist."},{"comment_id":"952513631455776","commenter_b":"No big deal. Mrs Bush did the same thing.","commenter_a":"Why is it so outrageous that an American woman does not do unculturally American things? Why is it that anything the President and his wife do so politically charged and subject to the idle chatter of people who have no interests outside of demeaning and denigrating people who are doing their level best for this country and its citizens? When you demean the President and his wife, you make us all small, meaner people, and this country seen as acollection of barbarians and yokels.","post_message":"How do you feel about Michelle Obama not wearing a headscarf while visiting Saudi Arabia?"},{"comment_id":"10153719642089091","commenter_b":"'@username so you've gotten an infection from using a public restroom ?","commenter_a":"Why would you let your 8 year old daughter go to a public bathroom by herself??!! Smdh.","post_message":"Thank goodness for the customers and staff members who helped rescue the 8-year-old after her mother heard her scream. Police say the man was caught carrying the unconscious girl into a bathroom stall."},{"comment_id":"979803835419705","commenter_b":"Dumb shit hoes do for niggas","commenter_a":"Looonngggg liiiive the kinggggg🦁","post_message":"The Struggle: His Mom Came Home Early So She Had To Jump Out The Window!"},{"comment_id":"10154897891195530","commenter_b":"'@username you kiss your mama with that nasty mouth?","commenter_a":"Trump is frightening for everyone. Period.","post_message":"There are up to 127,000 undocumented immigrants in Michigan, many of them anxious about Donald J. Trump."},{"comment_id":"10153810976206680","commenter_b":"Lock that vandal up!","commenter_a":"Way better than perjury charges, obstruction of justice, mishandling of classified documents, racketeering (Hillary) or fraud charges (Trump.) Jill spray painted a bulldozer and I would have too had I been there. They were bulldozing ancient barrial grounds and putting in pipelines without concent or respect for international law. #imwithjill","post_message":"Green Party presidential nominee Jill Stein is facing vandalism charges in North Dakota."},{"comment_id":"10152886547876051","commenter_b":"Yep, every woman carries black tape in their purse. What they need is to carry.","commenter_a":"A piece of black tape and the whole situation could have been avoided.","post_message":"This woman was putting her shirt back on in the Target dressing room when she suddenly noticed something glowing."}]
