[{"comment_id":"536499096509675","commenter_b":"he is absolutely right, this would not be permanent just temporary until we can get a system in place to do more accurate check on these people coming into our country. fdr did it. and for a good reason .....to protect the American people from harm... that was his job.","commenter_a":"Hell Yes!","post_message":"Do you agree with Trump?"},{"comment_id":"1199514790068549","commenter_b":"'Tear Down This Wall!!'","commenter_a":"Reagan might but Eisenhower would not as he was too far left for todays GOP.","post_message":"When you compare self-identified Republicans today to those of 1990, you have to wonder how well Reagan would do in the 2016 race."},{"comment_id":"10154398090436523","commenter_b":"She loves abortions. Of course her mother chose life for her. Lol","commenter_a":"Just look who they are and what their purpose is. This is just Evil and Horrendous!","post_message":"WATCH: Women's March on Washington, D.C."},{"comment_id":"631130463744199","commenter_b":"Obama don't care what 'Our' Constitution says!!!!!","commenter_a":"unconstitutional","post_message":"Obama said that America wants him to run for a third term, here's how they responded.  What a joke. This is absolutely ridiculous.  Do you think Obama should run a third term?"},{"comment_id":"800077153428906","commenter_b":"Women....or bitch....","commenter_a":"Welcome to a Hillary Presidency: Day to day scandals and law breaking. But, the Dems are OK with that as long as their guy is in office.","post_message":"This is definitely raising eyebrows..."},{"comment_id":"10153208513188812","commenter_b":"WWF on wheels....","commenter_a":"He should b able to race it wasn't his fault his car got stolen they should make an acceptation","post_message":"UPDATE: Police find stolen NASCAR Sprint Cup race car: @webpagelink"},{"comment_id":"10153734321486350","commenter_b":"You guys have kickass daughters :)","commenter_a":"Last year my daughter heard a football coach at my sons practice tell the boys they were playing like a bunch of girls. This year she is showing them how girls really play. Team captain and can take down every boy, she is playing on the line for both offense and defense. #girlscanplayfootballtoo","post_message":"'The boys on the team were apprehensive at first, but then she laid a hit on someone and they realized she's just another player with a ponytail."}]
