[{"comment_id":"10154652833671336","commenter_b":"BUILD THE WALL!!!","commenter_a":"let's end this by voting for trump","post_message":"A man who allegedly killed two people and kidnapped a third one over the weekend in the Dallas area had been deported three times to Mexico in the last two decades, immigration officials said on Wednesday."},{"comment_id":"10153179690136523","commenter_b":"So that one example involving you makes you come to the idea that lots of females lie..? And the proper way to handle that situation would be to go to the authorities and let them deal with it.","commenter_a":"Lots of girls lie about that stuff it happened to one of me old friends the bitch said he raped her be he really didn't there's lots of girls out there that's are like that","post_message":"19-year-old Owen Labrie, a former student at the elite St. Paul's School, appeared shaken as the verdict was read, at one point nodding his head and reaching for a tissue to wipe tears. At the time of the assault, the accuser was 15 and Labrie was an 18-year-old senior."},{"comment_id":"1038718286244949","commenter_b":"If you vote democrat you do not think much of your country? Do not ever forget BENGHAZI","commenter_a":"They are a bunch of lowlife communist wanting to destroy the country from the Left wing.","post_message":"ClashDaily.com"},{"comment_id":"10154587626459411","commenter_b":"holding a sign for 20 minutes ,","commenter_a":"Mishelle obama cares for them, #bring back our girls :D","post_message":"'No one cares for us'"},{"comment_id":"10154307369739099","commenter_b":"Well a attack on citizens is a attack on all of us as well punk","commenter_a":"So DeBlasio you're still going to give criminals a free pass you hypocrite ?","post_message":"\"An attack on our police is an attack on all of us,\" Mayor de Blasio said @webpagelink"},{"comment_id":"950451268383973","commenter_b":"I look forward to never looking at this Obummer again!","commenter_a":"Why is it everybody is out to get Trump? It seems to me they are so scared he may get President they have stooped to the lowest ways to destroy him....it just wants me to vote for him more because they are scared he will and the fact is it will ruin the political garbage at the white house who are trying to bring our country down.....I want our Country back and the Constitution back to what it was meant to be!!!!!","post_message":"“Good luck with that…We’ve got serious problems here.” President Barack Obama addressed Donald J. Trump's plans to build a wall and get Mexico to pay for it."},{"comment_id":"10152975467087232","commenter_b":"Would you like them to put a gas grill up there! Get a life California your state has more problems to deal with other than a treehouse","commenter_a":"Their property it should be their choice","post_message":"This California family's treehouse is pretty sweet! But a judge ruled it has got to change. DETAILS---> @webpagelink"}]
