[{"comment_id":"1114818335281084","commenter_b":"Go, Hillary! #I'mWithHer","commenter_a":"Democrats who support Hillary have the same mental disconnect as Republicans who deny climate change","post_message":"Sanders was shelling out more than Clinton on Nevada airwaves just a week ago."},{"comment_id":"649755178530332","commenter_b":"Please start packing now! Believe me no one will even miss you and your dirty mouth.","commenter_a":"V","post_message":"I guess it's time to say goodbye, and good riddance. 'LIKE' if you support Whoopi leaving the country!"},{"comment_id":"708523179338260","commenter_b":"Bust his ass .","commenter_a":"kick its ass out of the school","post_message":"Cross dressing boy entered girl's locker room and did this.  This is wrong. The boundaries need to be drawn.  Would you want this boy in your little girl's locker room?"},{"comment_id":"10153888153653352","commenter_b":"You said it all...Thank you!","commenter_a":"I feel she should have been fired.... possibly fined. Holding her in jail until she changes her mind is a waste of tax dollars and time.... yes this woman stood up for what she believed but she still had a job to do .... not only did she refuse to issue same sex marriage license but she didn't allow the people under her who were willing to issue them either.... that is wrong..... this woman used her title and athority and held an entire government staff to her religious beliefs ... she didn't have to issue them she could have let someone else do that and still be faithful to God's law.... this country was built on freedom of religion. That means no law can be withheld or upheld based on religious beliefs.... she made an oath to follow the laws of the US , as soon as the laws ...","post_message":"Defiant Court Clerk, Kim Davis, Will Be Held In Jail Until She Agrees To Issue Same-Sex Marriage Licenses!   CHRISTIANS WHAT IS YOUR REACTION?"},{"comment_id":"10155222561152316","commenter_b":"Can you prove she rigged the election?","commenter_a":"Killary is our threat not TRUMP. Why wasn't she arrested for rigging the election? Yall are not covering her criminal acts, are you ?","post_message":"Republican presidential nominee Donald Trump is asserting that countries like France that he says are compromised by terrorism may be subjected to the \"extreme vetting\" he proposes as a deterrent to attacks in the U.S."},{"comment_id":"572844126217923","commenter_b":"Before you build the wall could we please shut down all the tunnels underneath the fence?","commenter_a":"Jason Messenger","post_message":"WOW! An honor to be the first-ever presidential candidate in a primary- to be endorsed by the National Border Patrol Council. WE WILL BUILD THE WALL-- WE WILL MAKE AMERICA SAFE AGAIN! Thank you."},{"comment_id":"1067105896689813","commenter_b":"She's a bitch !!!!","commenter_a":"I've always believed we get what we've paid for .","post_message":"Do you support or oppose the stand these officers are taking?  LIKE Opposing Views for more breaking news and anaylsis"}]
