[{"comment_id":"10152892067227144","commenter_b":"Far more competent and capable than anyone out there on either side!","commenter_a":"If she is the best we dems can do, we are in bad shape.","post_message":"The time has come."},{"comment_id":"620617391457056","commenter_b":"Cleavage queen","commenter_a":"Just once I would love to see Mariah dressed in a turtleneck !","post_message":"It really is the most wonderful time of the year!"},{"comment_id":"1711755495764368","commenter_b":"Where all her pussy friends at doeeeee 🤔😂😂","commenter_a":"@username 😂","post_message":""},{"comment_id":"10153560278573188","commenter_b":"Legitimate question, Glenn. I am a blood-bought, evangelical Protestant, holy-rolling Right-Winger. I am a Trump supporter. Trump is not a conservative as I am. And yet, he has said enough things that I agree with. And then his approach seals the deal. He is pro-life now and believes Planned Parenthood's recent atrocities warrant a government shutdown. Yes, he did say in the future he would consider looking into the \"good\" things that Planned Parenthood does for women's health. This tells me two things: he doesn't have a clue who or what Planned Parenthood really is now but would make sure he did before supporting their refunding and he's a business-minded man, who when put between a rock and a place he knows nothing about (PP), he's not going to burn his bridges- at least until he's sure about what he's talking about. Trump is spot on when it comes to ...","commenter_a":"No candidate is perfect. Trump comes as close that can be done. Support your new President. May God in 2016 replace Obama with a man that knows how to get things done and not one that takes years to figure it out. Trump 2016 may the Lord guide and strengthen you and give you wisdom to do your job. Peace be with you.","post_message":"I really want to understand."},{"comment_id":"10153563054238984","commenter_b":"Stop!","commenter_a":"Subject Prophecy Fulfillment At the time of Messiah's coming, Israel would have unfit leaders. Zechariah 11:4-6 Matthew 23:1-4 The Messiah's brothers would disbelieve him. Psalm 69:8 John 7:3-5 The Messiah would be the \"stone\" rejected by the Jews. Psalm 118:22 Matthew 21:42-43 The Jews would have a hardened heart against the Messiah. Isaiah 6:9-10a John 12:37-40 The Messiah would be a \"stumbling stone\" for the Jews. Isaiah 8:14 Matthew 21:43-44 The unbelief of Israel's leaders would force the Messiah to reject them. Zechariah 11:8 Matthew 23:33 The Messiah would stop ministering to the those who rejected Him. Zechariah 11:9 Matthew 13:10-11 The Messiah would be distressed over the Jews unbelief. Isaiah 49:4 Luke 19:41-42 The Messiah's own people would not believe he was the Christ. Isaiah 53:1 John 12:37-38 The Messiah would be rejected. Zechariah 11:12-13b Matthew 26:14-15 The Messiah would be rejected. Isaiah 53:3 Matthew 27:21-23 The Messiah would ...","post_message":"This former governor can speak from firsthand experience, and that experience has her taking a BIG stand for 'The Donald.'  Do you agree with Jan Brewer?"},{"comment_id":"1610489359249521","commenter_b":"Maybe she'll have a stroke.","commenter_a":"She has RECENTLY HAD 2 BLOOD CLOTS ON HER BRAIN, FROM WHEN SHE FELL AND HIT HER HEAD. SHE IS EASILY CONFUSED, STAMMERS, SHORT-CIRCUITS , AND IS DILLUSIONAL. She is not well. \"THOU SHALL BEHOLD AND SEE THE REWA.RD OF THE WICKED\" !!!!!! Psalm 91.","post_message":"Hillary Clinton apparently needed assistance standing up at a rally."},{"comment_id":"949147745161454","commenter_b":"Nancy Pelosi said on the House floor that 30 million people were uninsured in the United States. After Bummercare, we were told that 40 million Americans were still uninsured. One year later, we were told that 55 million Americans were either uninsured for under insured. Islamic religion prohibits insurance because they claim it's gambling and are exempt from getting insurance. With the current influx of refugees and people sneaking into our country and getting free medical, welfare and food stamps, how many millions are now in this country unisured or under insured? Why would anyone bother to get insurance? Hospitals still take patients, doctors still see patients, and medicine is still sold at the pharmacies. If no one has insurance, costs will immediately be adjusted and negotiated at a lower cost. People will stop running to a doctor for every sniffle.","commenter_a":"amazed it lasted as long as it did, now the states are left holding the bag right along with those folks who tried to abide by that totally damaging obummercareless law.","post_message":"Oh Not Again! 400,000 Americans Enrolled In Obamacare Need To Find A New Plan"}]
