[{"comment_id":"10153830335904087","commenter_b":"Course they won't. They just coronated their queen.","commenter_a":"The most transparent 'administration' in history.... LOL","post_message":"#BREAKING: The State Department is refusing to hand the House Oversight Committee any email messages as part of the panel’s investigation into eight deleted minutes from a 2013 press briefing video."},{"comment_id":"10153167814539203","commenter_b":"typical, bend over asshole, and I'll shove a hammer up your ass. 😊","commenter_a":"leave it to a man, to be an ass.","post_message":"Will Smith on After Earth PTSD: 'After the failure of 'After Earth,' a thing got broken in my mind...'"},{"comment_id":"10153717683207894","commenter_b":"'@username Nobody's voting for Hillary? Why does she have 3 million more votes than Bernie??? I'll wait","commenter_a":"I don't know why people spew unnecessary hate for this woman, She has millions more votes than Bernie and is the better between her and Trump. What did she do so bad to you all? Bernie Sanders got yall head messed up. And that whole Bernie or bust thing is IGNORANT as hell. Writing in Bernie Sanders name is basically a vote for trump, smh","post_message":"Hillary Clinton Reaches Delegate Count, IS the Presumptive Democractic Nominee for President"},{"comment_id":"1320166798020657","commenter_b":"You are Sooo Pretty, Young Lady!","commenter_a":"Why is right. Totally agree, Brandon!!","post_message":"TheBlaze news update with Sara Gonzales and Brandon Morse."},{"comment_id":"10154526601676756","commenter_b":"Deport illegals!","commenter_a":"The President who deported more people than any other administration in US history is now the 'shield'. Christ.","post_message":"The Supreme Court finished deadlocked when it considered whether President Obama had the authority to shield millions of immigrants from deportation."},{"comment_id":"1560174614269652","commenter_b":"They are both disgusting women!!!! Never watched the show!!","commenter_a":"Rosie has to be one of the Most grating obnoxious people on the planet.","post_message":"I love ABC for doing what's RIGHT!   Rosie O'Donnell & Whoopi Goldberg have no place on TV."},{"comment_id":"1311217235558559","commenter_b":"I watched and every single one of the questions by Greta and the so-called voters sounded handwritten by Trump henchmen... they each read off their question all just like they were part of Trump 's typical campaign stump speeches... That was nothing more than free air time for a Trump speech... Greta where was Ted or John?''' I am done with Greta and Hannity you just cannot trust anything they would report on again... I used to think better of Greta giving everyone a fair shake but this is just too blatantly biased... hope her ratings tank and Fox gets rid of her!!!","commenter_a":"Gutfield is a moron. Flip the channel whenever he is on.","post_message":"Gutfeld now openly mocking fellow Fox News hosts."}]
