[{"comment_id":"1248241848569316","commenter_b":"They are coming in on cargo planes in the dead of night and then being bused throughout our country. Once they reach \"refugee\" status they can roam throughout America without any restrictions. Refugee is just a word to make it look right........it is not. Illegals are just criminals and not the best for our country. The new immigrants are not the same that came over after WWII who felt blessed and were willing to be woven into the fabric of America. The new ones are coming for only the money and the Demos are only aiding and abetting them for the votes. Plain and simple.","commenter_a":"Trump is the biggest liar out there. \"We did not discuss paying for the wall\" - Trump \"I made it clear that Mexico will not pay for the wall.\" - Nieto \"Chicago Police told me crime will stop in one week\" - Trump \"We did not discuss stopping crime in one week\" - Chicago PD \"The NFL sent me a letter about the presidential debates\" - Trump \"We did not send any letter to Trump\" - NFL Promises on deportation of illegal immigrants, self-funding of his campaign, no teleprompter, muslim ban, and release of his tax returns, now confirmed LIES. Who still believes conman Trump? #LyingTrump Feel free to share.","post_message":"Donald J. Trump's claim that the federal government has no idea how many undocumented immigrants are in the United States is false."},{"comment_id":"1831610420459597","commenter_b":"This woman is a lunatic.","commenter_a":"Just when I thought no-one could possibly be worse than Trump..","post_message":"Forget that Donald J. Trump is accused of sexual assault...and that President Bill Clinton is not on the ballot."},{"comment_id":"1334924336529627","commenter_b":"@username that's great except sometimes the child is tricked by a family friend, a coach, a counselor, etc... people that don't appear to be creeps. I'd like to help children see the signs, know what type of lies these predators tell them, and know how to get help if it's a family member or someone else. Killing the perpetrators after the fact will do nothing for the victims. Especially this little girl... she's already dead","commenter_a":"When I was young and in school we had the D.A.R.E program, trying to educate youth about drugs and help us make good decisions not to do them. We need a program now to educate our children on sexual predators, how to watch out for them, to be aware of how they manipulate, etc and where they can call for help and a safe harbor. I would happily volunteer to speak at any school. We need to protect these children and let them know they are not alone and that where someone may have failed them, we will not.","post_message":"Awful"},{"comment_id":"726722780803193","commenter_b":"Bloody Tim with all his Facebook profiles!","commenter_a":"Tim Duurland @username Adam Burns Tim Duurland","post_message":"This \"smart table\" could be the future of ping pong."},{"comment_id":"10155037576899268","commenter_b":"So, all wives are prostitutes?","commenter_a":"When you obviously marry a man for his money, what else would you call it. If you sell your soul to the devil, you're a prostitute. After all, no one would want this orange Cheeto if it wasn't for his money.","post_message":"Melania Trump doesn't deserve to be slut-shamed."},{"comment_id":"10155297533295294","commenter_b":"What about mature women ??","commenter_a":"Tina, No not customers. How the company treats its employees. It might just be the local HD.","post_message":"Veterans, retirees and college students are strongly encouraged to apply."},{"comment_id":"10154598591011756","commenter_b":"Ooh never heard that one...sweet","commenter_a":"Yes, I'm sure the Trump children know all about working. What's that saying? Born on third and think they hit a triple.","post_message":"The theme of day two of the Republican National Convention is \"Make America Work Again,\" with speakers ranging from House Speaker Paul Ryan to Tiffany Trump and Donald Trump Jr."}]
