[{"comment_id":"1209775645709130","commenter_b":"I vote they electrify the fences and start allowing the military to shoot them. Let those ragheads stay in their sandboxes.","commenter_a":"It is an invasion!","post_message":"\"This is not a refugee crisis or a migrant crisis, it's a mass popular movement with an unlimited supply of people.\""},{"comment_id":"1114818335281084","commenter_b":"Go, Hillary! #I'mWithHer","commenter_a":"Democrats who support Hillary have the same mental disconnect as Republicans who deny climate change","post_message":"Sanders was shelling out more than Clinton on Nevada airwaves just a week ago."},{"comment_id":"539258706198723","commenter_b":"Fuck her","commenter_a":"She wrote the book on \"reckless\" and \"dangerous foreign policy\". Just ask Sean Smith's mother.","post_message":"Hillary Clinton took aim at Republican candidate Donald Trump's foreign policy calling it \"reckless\" and possibly \"dangerous.\" Do you agree or disagree?"},{"comment_id":"10153190295751336","commenter_b":"Nothing better than a HOT conservative woman.","commenter_a":"Looks like the Catatonic Parkway. No cowboys in that area, maybe a few cowgirls, but they ride English.","post_message":"Fifteen buffalo who escaped an upstate New York farm have been shot and killed."},{"comment_id":"1280546775319125","commenter_b":"Is it not a shame that such is good looking woman can make herself look so bad when she open her mouth.","commenter_a":"sick of seeing this woman in the news.. why doesn't she go back to Alaska?","post_message":""},{"comment_id":"1713379888949123","commenter_b":"Then resign and get her out of the White House!","commenter_a":"I would like to know why people push like on these kind of post? I don't get it! Are you stupid??","post_message":"Are you... KIDDING ME!?   So sick of Barack Obama & Michelle Obama..."},{"comment_id":"907517025969130","commenter_b":"May she be he first to suffer any repercussions from this decision.","commenter_a":"I'd like to know what her retirement package is!","post_message":"UNREAL! RETIRING SENATOR IS 34TH VOTE TO CLINCH OBAMA WIN ON IRAN DEAL   Obama puppet..."}]
