[{"comment_id":"10154510630741178","commenter_b":"Then can we at least send HER to jail?","commenter_a":"I am still not clear,why I care what this woman says?","post_message":""},{"comment_id":"634863706677709","commenter_b":"Yes absolutely. ...you are on our soil...you NOW live by our laws...if you don't like that LEAVE....","commenter_a":"Yes she has to obey the law's of this land, or be deported","post_message":"Muslim Refuse To Remove Head Covering For Officers – Gets Brutal Wakeup Call. Should of listen to authority. Do you think everyone should have to obey they law, regardless of religion?"},{"comment_id":"10153402936366636","commenter_b":"It's funny lads, the women is clearly having a bit of fun. You all must be really fun at parties.","commenter_a":"Dad could be doing house duties as well. We can not say he does nothing at this house by watching a Video. I think the purpose of this is to show how this super-mom is capable of dealing with the 4 kids, multi-tasking, having patience, having the gentle touch, etc..","post_message":"We can't stop watching this video of a mum getting her four kids ready in record time"},{"comment_id":"1702951239953812","commenter_b":"Go to hell","commenter_a":"a liar and corrupt & a socialist what a pick for dems.","post_message":"Now it’s Hillary Clinton who has taken up the “white privilege” banner. During a recent Q&A she asserted that white people need to “recognize our privilege” and “practice humility.” Do you think Hillary is totally out of touch with reality?"},{"comment_id":"10153857469189197","commenter_b":"Sorry, she does need spanks to look even better ! And you know it !","commenter_a":"Lol....I love my Spanx!!!","post_message":"She was trying on dresses for an upcoming formal, but her mother took to Facebook following the experience they had inside the dressing room-->> @webpagelink After you read the mother's message to the employees, tell us what you think in the comments below!"},{"comment_id":"10153112992879753","commenter_b":"How extremely sad... :( and the parents were to take CARE of her. The boy should be taken away...","commenter_a":"they need to be charge my grandson only has to say his ear hurt and it time to do something they are painful so put them away","post_message":"One-year-old Hope Delozier died from an ear infection because she couldn't count on the two people she should have mattered to the most. BS excuses. @webpagelink"},{"comment_id":"10153563435706162","commenter_b":"This is some shady bull. Why was she even in jail in the first place? That I'm not understanding she was pulled over for not signaling a lane change? How did she even manage to be asked to get out of the car or get out of the car to assault an officer? I wouldn't have gotten out for that violation right me my ticket or let me go period point blank. I would be respectful but i wouldn't let them take advantage. She should have not been in jail in the first.","commenter_a":"Abc won't let this go. Must be a good day to hate on the police. Even though there is only evidence she killed her self.","post_message":"Her primary cause of death was \"hanging.\" Family and friends want to know what happened to a Naperville woman found dead in a jail cell, after she was pulled over for a traffic stop while on a road trip with her mom: @webpagelink"}]
