[{"comment_id":"644569865731305","commenter_b":"Robert, no one on earth has even 1 trillion dollars. Bill Gates according to Wikipedia is the richest man on earth with a net worth of 75 billion dollars.","commenter_a":"I know that Trump is not for just one race. Trump is for all races. If you will just vote for him you will find out he will be for every one in American.And he believes in GOD. GOD bless Trump.","post_message":"MEDIA BLACKS OUT..."},{"comment_id":"10154595284389888","commenter_b":"Oh for crying out loud. He's pissed because he can't get his bad people in. OMG. People are so childish. Illegal vs legal.","commenter_a":"Why don't U take your Iranian A$$ back to your country and direct movies over their . U don't like it here LEAVE.Sorry POS. And stick that OSCAR where the sun don't shine","post_message":"\"My absence is out of respect for the people of my country and those of other six nations whom have been disrespected by the inhumane law that bans entry of immigrants to the U.S. Iranian director Asghar Farhadi won an Oscar tonight, but chose not to attend the ceremony in response to President Donald J. Trump's recent travel ban."},{"comment_id":"517132878459126","commenter_b":"Right under this post is an article that says blue nation review gives Hillary Clinton her own media wing.","commenter_a":"But the Word of God is in our heart, never to be taken away, Glory to God","post_message":"The numbers are undeniable."},{"comment_id":"594130970711496","commenter_b":"She a commie in bad clothing","commenter_a":"I'm just wonderin......Does she feel \"tyred\" these days??","post_message":"Hillary Clinton says people are \"concerned\" by Trump's \"divisive rhetoric\" and he needs to be stopped \"conclusively.\" Is she right?"},{"comment_id":"10157271699240354","commenter_b":"sure take foreign money and rule with foreign masters LOL NO way you fool.","commenter_a":"No you don't, it's payola, play for pay!","post_message":"WATCH Hillary Clinton's hatchet man, David Brock, concede 'Clinton Cash' is no conspiracy book and discuss how the Clinton Machine is hunkering down for Donald Trump's big Monday 'Clinton Cash' speech on Hillary's self-enrichment through the Clinton Foundation..."},{"comment_id":"861020107291072","commenter_b":"So many F$&k wits out there. How can they be so cruel?","commenter_a":"What a atrocious father!","post_message":"Girl thrown off bridge by man believed to be her father."},{"comment_id":"10154800990580575","commenter_b":"Lock her up.","commenter_a":"Terroristic Threat","post_message":"This Has Got To Stop..."}]
