[{"comment_id":"10156321873895725","commenter_b":"Global warming is responsible for baby dick","commenter_a":"iIN United States there plenty terrorist as illegal immigrants driving yellow taxi in the cities of United States taking the jobs from American people and ready to do bad things to us here that's why we need DONALD TRUMP to deport all of them","post_message":"As President of the United States, my top priority would be to keep America safe & strong! Thank you for your support."},{"comment_id":"1191494990889956","commenter_b":"I could care less what that judge has or says, I AM TRUMPED ALL THE WAY TO THE WHITE HOUSE !!!!!! THAT FREAKIN JUDGE JUST DON'T WANT THE WALL !!!!!!!! TRUMP 2016","commenter_a":"Boy, if Obama worked as hard pleasing the people as he does trying to destroy the republican front runner we'd all say he was great instead of destructive.","post_message":"HISPANIC JUDGE THE NEWEST ATTEMPT TO DERAIL TRUMP  @webpagelink"},{"comment_id":"10154132687525579","commenter_b":"I SWEAR, THE MEN IN THIS COUNTRY ARE SUCH PANSIES NOWADAYS.","commenter_a":"No matter the numbers, you won, Bernie! America will not be the same because of your tenacity, integrity, and values! Thank you!!! We'll keep fighting. #NotMeUs If you like this comment, please contribute to Sanders's campaign at the below-posted link. @webpagelink","post_message":"Bernie Sanders: \"Tonight, while the results are still not known, it looks like we are in a virtual tie.\" Full video here: @webpagelink #IAcaucus #IowaToday"},{"comment_id":"789545591173673","commenter_b":"Some states are allowing people to vote through the DMV instead of going to the polls....most of these states are where the illegal immigrants are.....that is where it is not fair, because illegals can have a drivers license now in some of these states and will vote democrat illegally . That is why it is more important than ever to get out and vote if you want a republican to win.","commenter_a":"I hope the election isn't rigged. The government we have now doesn't want Trump to win. He,will find out too much truth and tell us like it is. No more secrets no more lies. Trump 2016!!!!","post_message":"Time Magazine has me on the cover this week. David Von Drehle has written one of the best stories I have ever had. He brilliantly tells it like it is -- the real deal! Read it!  @webpagelink"},{"comment_id":"960457477322681","commenter_b":"Hunt these cops! Good Germans would say this!","commenter_a":"police state","post_message":"Officer Thomas Webster was just found not guilty of assault... even though he was caught KICKING and UNARMED MAN IN THE FACE as he obeyed police commands.  This is America, 2015. Not the Jim Crow Era.  From (Y) Counter Current News - MBD"},{"comment_id":"1054028271282063","commenter_b":"You know thats an opinion. My grandfather fought some battles i could never even imagine in my worst nightmares. He earned his title and passed it down and if to a woman so be it. I stick with this country has the best military not because of our abilities but the devotion of our troops make it so. If a woman earns a ranger tab she did it because she truly wanted it. She pushed herself beyond her limits and succeeded. So no matter what others think because its only their opinion i am proud of these women and i ambproud of our troops. Sure they may be women but look how many millions of americans wouldnt dream of going to war yet these women are willing to risk it","commenter_a":"You know Russia in world war 2 fought with women on the front and never had an issue. Israel has women in their military and has never had an issue. Heck they have yet to be defeated. My question is why not allow women the opportunity to serve as well? Set a standard and if a man or a woman either one have the skill and determination to achieve it then that is what we need in our military. It reminds me of a story in Vietnam I heard once (Of course before my time) there was an older black man and an older white man I spoke with once. They were best friends and would do anything for each other. They told me that each was in the 1960s very prejudice. The black was raised to hate whites and the white raised to hate blacks. They went to Vietnam ...","post_message":""},{"comment_id":"585280771667035","commenter_b":"This photo is liiiiiiiife!!!! :D :D :D","commenter_a":"Brian Rungeling don't you like Trump's new \"Make Russia Great Again\"?","post_message":"Alec Baldwin just trolled Trump again by walking around New York City wearing a “Make America Great Again” hat — with the embroidered logo in Russian.  The timing for Baldwin’s hat couldn’t be better, coming as the president-elect sat down with security officials on Friday who told him the Russians helped him win the election — an assertion Trump flatly denies because it would contribute to the belief that his win is suspect having lost by over 3 million in the popular vote."}]
