[{"comment_id":"10152940506506051","commenter_b":"Put her in jail","commenter_a":"If You all had ids in that school and there was some evidence of wrong doing you would all change your tune you have no right to judge the system until you know the true circumstances","post_message":"A dad went to school to pick up his daughter’s confiscated phone. The school principal refused to return the phone, but offered a different sort of exchange."},{"comment_id":"10153866679791002","commenter_b":"This is what happens when the majority of nursing moms thinks it's ok to expose their breasts while nursing. No, use a cover please. Yes, it's natural and better for your baby, but that's still a nipple being shown to the public...","commenter_a":"I don't think John was saying that children should be denied a family fun day. But, he is right, when the children are hot and fussy, they are no longer enjoying the event. They are miserable and they are making the person next to them miserable and you too. That's not fair to your child or the patron sitting next to you. I know parents want to see the rest of the game but, that's one of the sacrifices we make for our young children. Changing a soiled diaper in such close proximity is rude and plain nasty!","post_message":"The Cincinnati Reds are opening a nursing suite at their stadium for nursing moms who want to feed their little ones during the game.  Do you think the Detroit Tigers should have something like this?"},{"comment_id":"815801661894546","commenter_b":"Kick them out of this country","commenter_a":"If you don't like the American flag, pick one you do like..... and move to that country you bunch of losers.","post_message":"Absolutely appalling."},{"comment_id":"10153091519691680","commenter_b":"Yeah, but Vance. Don't forget the illegals & their anchor babies ? Factor them in, & you have a wipe out. Yes, foreign, along with illegals, WILL DECIDE THE NEXT PRESIDENT & GOVT","commenter_a":"Democrats only need 38% of the white vote-- we get that with no problem. Romney only got 24% of Hispanic vote and 5% of African American voter. Because of Trump, Hillary will EASILY get 85% of Hispanic vote. Hillary will also score 80% of Asian vote for a landslide win in electoral college","post_message":"Noncitizens are factored into the electoral college. @webpagelink POLITICO Magazine"},{"comment_id":"1361756670528336","commenter_b":"Vengeance is mine saith the Lord.","commenter_a":"Disgusting and low class","post_message":"More tolerance from our friends on the left."},{"comment_id":"10154911255250530","commenter_b":"@username you. The Asian carp are not bottom feeders, their meat is high in protein. Watch some YouTube videos on them....you'll learn a thing or two.","commenter_a":"I've read that they are good to eat and high in protein. But, man has wiped out many species of plants & animals, don't know why this should be so difficult.","post_message":"Here come the carp."},{"comment_id":"10153677457716509","commenter_b":"White collar criminals need to get hammered too","commenter_a":"@@username.....you are so right. we must be smart in giving.","post_message":"They conned donors out of $187 million and spent almost nothing to help actual cancer patients, the FTC says. Here's how about 97% of the donations were used: @webpagelink"}]
