[{"comment_id":"836200936476160","commenter_b":"Don't think ANY woman could run this country as well as a man could.","commenter_a":"Bring on mashed potatoe legs","post_message":"“I’m ready for Hillary, are you? Are you coming?”  - Sarah Palin"},{"comment_id":"10153227457334170","commenter_b":"Rush says Ted Cruz is one of the most intelligent people he's ever talked with.thats good enough for me.so tell old has been Pete go jump and take all the other old pretenders with him.if we r only left with the tea party just think what we could do!!!","commenter_a":"Please do.","post_message":"Pete King says he may \"jump off a bridge\" if Ted Cruz is nominated...."},{"comment_id":"10153624598653132","commenter_b":"Shoot, I'd feel sorry for the plants. She should have to work with people who are just like her. They can take jabs at each other all day. What a bunch of douche bags. And the doc himself needs to get a backbone..you can tell he's only going along with her ridiculous antics.","commenter_a":"How did he still have his cellphone during surgery","post_message":"The patient used his phone to record the instructions the doctor gave him for post-surgery care, but ended up taping the entire procedure - and what he heard shocked him."},{"comment_id":"10153000852919197","commenter_b":"Put the plow down !","commenter_a":"Another fun icy Monday! Wha's up with that?","post_message":"It was definitely a slippery morning on most of the roads in the state. Check out this video from an eyewitness on I-84 in Newtown. Stay updated with the latest weather conditions here-->>@webpagelink"},{"comment_id":"10154538565137178","commenter_b":"@username illegal guns in Chicago are the guns killing people there, not the ones owned by legal owners, all the guns in Chicago have not slowed the death tole, cities that allow guns have less violence less killing, it's history and its fact! Taking guns from legal citizens makes them defenseless and easier for the government to control! Outlaws will always have guns!","commenter_a":"The problem is he considers the dangerous few the Legal Gun Owners in America, Not the Illegal gun owners in south Chicago!","post_message":"Executive action? President Barack Obama is exploring ways to keep guns out of the hands of \"a dangerous few\" without depending on Congress to pass a law. Steps to strengthen background checks could come this week. >>> wral.com/@username"},{"comment_id":"1062158903821449","commenter_b":"And your a scrub. And Beyonce don't want no scrubs.","commenter_a":"Don't be scared of a bunch of freaking thugs, Beyonce is a thug herself .","post_message":"Tomi Lahren doubles down."},{"comment_id":"915165211871817","commenter_b":"@username guns don't kill. Stupid demonRATs with guns kill.","commenter_a":"You're doing great, Bernie!","post_message":"“This may not be great politics, but I think the Secretary is right. And that is that the American people are sick of hearing about your damn emails.\" -Bernie #DebateWithBernie"}]
