[{"comment_id":"10154085328776782","commenter_b":"But if you are here illegal then you are already breaking the law just my thought","commenter_a":"Yes, mainly so it allows/requires them to get auto insurance. Having a license won't make people more likely to be in Oklahoma or use more resources. But if an undocumented person hits my car, I have a better shot of not having to pay for it myself.","post_message":"A newly elected Oklahoma lawmaker is pushing through one of his first bills this legislative session, but it likely to get some pushback from the majority Republican House. Patty Santos has the story: @webpagelink"},{"comment_id":"10153603051371509","commenter_b":"I hope they went home!!! Let them have at it!!","commenter_a":"Baltimore police are a disgrace. They need to defend their city from these thugs! And they've disappeared.","post_message":"Video shows people looting a CVS store. Here's the latest on the #BaltimoreRiots: @webpagelink"},{"comment_id":"378947809141289","commenter_b":"Alex check your fact on the cost","commenter_a":"Yes","post_message":"It is now being estimated that a border wall will cost $21.6 billion, which is much higher than Trump's initial estimate of $12 billion. Would you support the wall being built at this cost?"},{"comment_id":"494457030748305","commenter_b":"Bitch u should forgive me","commenter_a":"@username hope u forgive me","post_message":""},{"comment_id":"10154241596456491","commenter_b":"Trump has made America great again for sure ! Free coke floating on our shores !!!","commenter_a":"Mom Neelo","post_message":"\"I’ve found marijuana, but never cocaine like this.\""},{"comment_id":"10153026927846051","commenter_b":"Cut down on fraud and kick out the illegals","commenter_a":"I live in Arizona. Thank you Gov. Ducey. So much welfare fraud. So many illegals getting enough benefits, to make you see red! 4 million people waiting in line to come here legally. They have been put on hold to accomodate the illegals. This is sooooo wrong.","post_message":"This state just reduced the amount of time people can spend on welfare to the shortest in the whole country."},{"comment_id":"1202153396486746","commenter_b":"It takes 2 to tango","commenter_a":"That's not news! Thats standard procedure.","post_message":""}]
