[{"comment_id":"10152884212556636","commenter_b":"I'm just waiting for the first comment to blame the feminazi conspiracy to neuter us poor downtrodden beta males...","commenter_a":"That would be defined as sexist. People are supposed to be interviewed based on experience, education,","post_message":"'Can you wear more make up next time?'..."},{"comment_id":"1211673908894956","commenter_b":"ROTTEN NO GOOD PIECES OF CRAP, FIRE LESTER HOLT, DAMM LIBERAL , AND RUN HILLARY TOO PRISON WHERE SHE BELONGS.","commenter_a":"If she gives out free college who do these dumb asses thanks whos going to pay for it _ we are","post_message":"A rigged election!!"},{"comment_id":"1796700900563912","commenter_b":"Stupid lady!!","commenter_a":"People need to stop ... It was a choice ... No chances could be taken .... It's sad... But the choice had to be this 4yr old little boy","post_message":"Family of toddler who fell into the gorilla enclosure at the Cincinnati Zoo & Botanical Garden said their child is “doing well” and thanked zookeepers who fatally shot the gorilla."},{"comment_id":"10153321594333812","commenter_b":"Hahahahahaha","commenter_a":"what strong messages? I thought she deleted all her messages. lol","post_message":"President Obama says Hillary Clinton will have \"some strong messages to deliver\" if she runs for president. @webpagelink"},{"comment_id":"10153122527121051","commenter_b":"Freedom bitch do something about call for help911 ..","commenter_a":"Hey Gonzalez: take your ass back to Mexico since you think you should fly the American flag upside down and the Mexican flag next and in equal position to the American flag. I was born in Cuba but will never fly a Cuban flag. I am an American and there is only one flag for me. You want to disrespect my flag and fly that rag of yours, go the hell back. BTW, you think there is racism against Mexicans, look at the way you act and then see if you can come up with any reasons American citizens might have a problem with Mexicans.","post_message":"An outraged military veteran took one look at this man's flag display and intervened. Soon after, he got a visit from the police"},{"comment_id":"10153717655651323","commenter_b":"I'm sure mosques will be very useful for Syrian refugees in Germany. Are you for real?","commenter_a":"Focussing on mobile phones while poor syrians are getting genocided by poseidon in the mediterranean? Fucking white neonazi shitlords.","post_message":"You will soon be able to ignore your friends and family in Europe as well as at home for no extra cost."},{"comment_id":"1159620574116477","commenter_b":"Why doesn't she leave, to many people here anyway.","commenter_a":"American is great, but we all have to remember who we got this great country from the great American Indians they should be the only ones who can say who can stay and can't.","post_message":"This whiny Home Depot employee is going viral in all the wrong ways after a man's photo caught what was on her hat... this is disgusting. The employees of this Home Depot store clearly don't want our money, so let's make sure they don't get it."}]
