[{"comment_id":"10154196354922541","commenter_b":"She looks ridiculous","commenter_a":"love it!","post_message":"In case you missed it, Beyoncé’s pregnant."},{"comment_id":"1107746175912227","commenter_b":"@username -- The women lied under oath and colluded. I'd call that misandry, not misogyny.","commenter_a":"And the feminist backlash begins in 3...2...1","post_message":"Former CBC host Jian Ghomeshi has been found not guilty of sexual assault and choking.   Full story: @webpagelink  (Photo: Chris Young/Canadian Press)"},{"comment_id":"10153326702079877","commenter_b":"It doesn't make no sense for a woman to get sloppy drunk","commenter_a":"I just don't understand","post_message":"Man finds wife naked in bed with her father...then gets stabbed after an altercation. Read more of the details below.   Grio fam, we can't imagine. What would you do?"},{"comment_id":"10153380578865950","commenter_b":"Maybe you're jealous, because you're a fat bitch.","commenter_a":"Well, considering Beyonce was involved, it was bull. I refused to watch it because of her and the song she was performing. Screw her and her terrible lyrics and slutty wardrobe/dancing. You're lucky Lady Gaga was there (never thought I'd say that...) to save the performance aspect. #nomorebeyonce #shesaterriblerolemodel #picksomeoneelsenexttime","post_message":"Compared to past Super Bowl halftime shows, this year's was relatively tame: no \"left sharks\" or wardrobe malfunctions here. Who was your favorite performer?"},{"comment_id":"1285345191558532","commenter_b":"She is the Bitch.!","commenter_a":"love Hillary...Kill Babies.... $$$$$%","post_message":"The star actress makes an excellent point.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1825547344399892","commenter_b":"Guess what? They don't want her in their sh*thole!","commenter_a":"Please stop telling them any different! We don't want them coming here!!","post_message":"More liberal condescension and arrogance."},{"comment_id":"1750956915163116","commenter_b":"Leave voters have woken up, it's time for these people to accept this country belong to people who have been here for centuries. The racist abuse that comes from people who have no rights to be here, is killing our country. EU is based on lies and corruption, people need to be protected from people who have no respect for the British people. Immigration need to be stamped out people who are not suppose to be here should be returned home. Enough of the rubbish people keep trying to push the boundaries of the country to an extent of hatered breeding in a peaceful country. Stay campaign maybe help all those who have no rights to be here, leave campaign had been made to rebuild their country for those who live for the moment.","commenter_a":"A \"so-called\" majority can be wrong. The referendum was a bad idea. The parliament are the elected representatives meant to lead and decide. It's a bad outcome for everyone, and is a very bad example to all in the world on how to get along in the global economy, and especially from a social perspective. We live on the same planet. We're not going anywhere else soon. We should share it. Borders are historically recent and arbitrary. Nationality is random (not a choice where you are born, just luck). It is not the most important thing. We all belong to the same human race.","post_message":"Join our live debate and tell us where you stand on a second referendum on leaving the EU."}]
