[{"comment_id":"10153489348776756","commenter_b":"Only a woman could find something completely fucking trivial to bitch about a great thing.","commenter_a":"#FirstWorldNonProblems","post_message":"\"Can I just passively refuse to pass the beach balls back up until they collect around my feet in one incriminating pool? How coldly can I glare at the people who try to resurrect the beach balls I've silently condemned to the ground?"},{"comment_id":"10153549615210667","commenter_b":"But not in the women's room with a dress on..","commenter_a":"Wow! Another church minister bites the dust.This is so sickening.","post_message":"Authorities say the two suspects answered online ads specifically offering sex with an underage girl."},{"comment_id":"10153720423624312","commenter_b":"Thank you. I let my daughter go camping!","commenter_a":"Poor parenting skill for letting her daughter go camping, wow he is delusional.","post_message":"Shirley Fortner, 70, has re-lived the night of her daughter death five times during five prior parole hearings. Bret Arbuckle killed Angela Lyn Fortner in rural Ash Grove, Mo., in 1989."},{"comment_id":"10153042580654411","commenter_b":"What a bitch ^^","commenter_a":"I condemn whatever happened in Paris and whoever did it wasn't a human for sure. But this is a shame. They kinda provoking people to do stupid stuff and it's like fuel on the fire. Shame on Charlie Hebdo","post_message":"'We will not give up, otherwise all of this will not have any sense.'"},{"comment_id":"849566101841798","commenter_b":"Ignore Spenser Jeffery, he's bankrupt, c);-)","commenter_a":"God Bless this wonderful man! God bless his family and many friends. You truly lost a good man. Prayers and all the respect in the world to him and his family!! Please holy father, take this wonderful soul into your loving arms, amen and amen.","post_message":"\"I swear to God I love this city but I wonder if this city loves me,\" slain officer Montrell Jackson wrote on Facebook earlier this month."},{"comment_id":"1346164815479767","commenter_b":"She will not ever be our president","commenter_a":"The Department of Justice is now the Department of Clinton. The FBI are just employees of Clinton also. Do not trust the FBI. Join your local militia! Support your 2nd and 1st amendment. Remember Hillary Clinton is everyone's enemy and all Liberals are animals and terrorists. The North should have there own country. The South and Midwest our own also. Liberals can't be trusted. Liberals are not patriots.","post_message":"BREAKING: Here are the NBC News presidential race updates for 8PM ET poll closings @webpagelink #Decision2016"},{"comment_id":"1075906369172131","commenter_b":"These people ARE violent CRIMINALS!","commenter_a":"You're crazy sue","post_message":"WATCH: Protests in Charlotte, North Carolina after a man was shot, killed by an officer in the University City section. [WARNING: This live video is RAW and UNEDITED. Viewer discretion is advised.] Read more: @webpagelink"}]
