[{"comment_id":"1071811879506489","commenter_b":"^ and I can see you sucking my cock @username.","commenter_a":"I can see Cruz flying a plane into a building or mountain.....","post_message":"Ted Cruz recently compared himself to Galileo, and compared those who accept climate change to flat-Earthers.  No. Just no.  Image via Forecast the Facts."},{"comment_id":"529778360546077","commenter_b":"Live in America follow American rules! Don't like it leave","commenter_a":"This should be an example and a warning to others that they and their laws will NOT be tolerated in the United States ! ! ! !!","post_message":"The Muslim Brotherhood tried to take over this school, locals refused to back down.  This is patriotism at it's finest. These Muslims should serve life.  Can we get 10,000 'LIKES' for these patriot's stand against the Muslim Brotherhood?"},{"comment_id":"1211081885612641","commenter_b":"It's been 20 years since we've had a caring honest president. The last 8 years have been Muslim run, no doubt. When a commander in chief refuses to acknowledge we have terrorist attacks within our USA...isis islamic terrorists","commenter_a":"Screw Obumer!","post_message":"95 YR OLD WWII VETERAN Writes Scathing Letter To Obama: “I can’t figure out what country you’re the president of”"},{"comment_id":"1097247357003041","commenter_b":"Bitch please","commenter_a":"These cops did nothing wrong. They asked him why he was filming and they were trying to protect there fellow officer. Everyone needs to stop hating on the police.","post_message":"We just received this, these cops are ABSOLUTE CHILDISH BULLIES! Full details: @webpagelink They got right up in his face like they were looking for a fight, they have ZERO respect for anyone outside of their little gang."},{"comment_id":"10154460256056509","commenter_b":"Let's not forget she's a sleazy hooker who is doing the work of an immigrant that no American would do.","commenter_a":"Oh so what! trump made fun of Bush having his 90 yr okd Mom campaigning. At least you can understand her, unlike Trumps trophy wife who needs speech lessons. Do we really need a flotus who barely speaks u derstandable englush!","post_message":"See if you can tell why Ted Cruz's campaign pulled this ad."},{"comment_id":"10154744279541323","commenter_b":"ooh, you bitch you. i wouldn't invite you to your own funeral","commenter_a":"Hillary looked like she could use a shower and some crayons when she slithered out from under her rock last night.","post_message":"\"None are without controversy.\""},{"comment_id":"10152841288932061","commenter_b":"I LOVE Johnny Depp and most of his movies. This is disappointing. He should just send them home. Save their lives. They should not have to pay for his stupidity!","commenter_a":"Everyone else has to do this and so do you,Depp!","post_message":"Depp is in Australia to shoot the fifth edition of  of the Caribbean, called  Men Tell No Tales.\""}]
