[{"comment_id":"10153630257512235","commenter_b":"She's a dumb bitch.","commenter_a":"Aaaaaaaaaaaaaaaaaaaand let the Martyring begin! Yea totally did not see that one coming..nope, wow I am so surprised! *rolls eyes*","post_message":"Oh, c'mon ..."},{"comment_id":"644282239071875","commenter_b":"I wish you ugly frumpy women would shut the hell up. Your blind support of Hillary is going to put Trump in the White House.","commenter_a":"He needs to bow out, pledge his delegates to Hillary and move on.. Hopefully she will have a place for him in mind and he can be of some help in the future. He's led a sterling campaign, but has been on the loosing side for the last few primaries and is bound to loose tomorrow.... YAY Bernie for doing what you did, now solidify the party, tell your supporters to support Hillary and then we can all go forward to enihilating trump and winning the presidency. Your Elizabeth Warren can still BE the VP candidate and together the women can set the world on fire and win... America is ready for this.. Trump must be downed and your support of Hillary will clinch that! PLEASE..","post_message":"Does Bernie Sanders keep fighting through July's Democratic convention? Or does he bow out?"},{"comment_id":"10152958959170927","commenter_b":"she can give up citizenship which is just fine with me, at least in this country she can say this stupid remark, want to try to do so say in Hungry","commenter_a":"Leave","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"686756008181644","commenter_b":"Yes she is a Scumbag!!","commenter_a":"Yes she is","post_message":"The father of a victim from Benghazi calls Hillary A 'Scumbag' We send our condolences for his loss.  Do you think Hillary Clinton is a scumbag?"},{"comment_id":"10153545478606162","commenter_b":"She is a fake little creep","commenter_a":"hmmmmm, if she hates the way Americans eat why was she in a donut shop?","post_message":"ARIANA DRAMA: 'What the **** is that? I hate Americans. I hate America! That's disgusting,' Grande said when a tray of doughnuts appeared in front of her."},{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"'@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. 'We hope and pray the U.S. Coast Guard is able to bring Samantha home.' @webpagelink"},{"comment_id":"947408295386760","commenter_b":"Jill has sexy legs","commenter_a":"Commies","post_message":"'For my brothers and sisters that supported Dear Brother Bernie Sanders - this is the next step. This is the Green step. It is the progressive step. It is to stay on the love train. Justice is what love looks like.' -Dr. Cornel West"}]
