[{"comment_id":"10153354132661320","commenter_b":"Religion is fake!","commenter_a":"He's a fraud sorry","post_message":"\"I can dream as long as I want to. I can believe God as long as I want to. If I wanna believe God for a $65 million plane, you cannot stop me.\" Pastor Creflo Dollar is blasting critics who took him to task for wanting a fancy private jet. Read more: @webpagelink"},{"comment_id":"10153997696177300","commenter_b":"@username I feel so sorry for you ... I wish he wins and become president so you learn what immigration is ... I want to see you get kick out of another country. Remember the wall is for you not to scape. You Americans dumb supporters are morrons and losers","commenter_a":"The establishment wants a puppet, and clearly they found one in Rubio! The establishment hasn't learned that the more they ram their same old politics (taking care of donors and lobbying corporations) down our throats by telling us to vote AGAINST Trump, that we stand taller, rise stronger with you Mr. Trump. You are for us and we are for you.","post_message":"Yes, Donald Trump could win the White House in November."},{"comment_id":"10152623006528067","commenter_b":"Explain free? Teachers work for free? Colleges get free utilities and maintenance? Books?","commenter_a":"Nothing is free","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."},{"comment_id":"10153278780012217","commenter_b":"Cats.... Some cats have the devil inside them.","commenter_a":"Not only dogs... All animals r best friends... Its only human who hates","post_message":"Man's best friend."},{"comment_id":"10153460908891680","commenter_b":"Len Williams Carver Hillary is a SHILL for Wall Street and the Big banks. Do you need a road map to follow the money?? 3 speeches for $675,000 from Goldman Sachs and you don;t find that troubling??? She said she would release those transcripts then reneged on her promise. So she LIED again! A Clinton trait! #BernieSanders","commenter_a":"Apparently to her a democrat is someone who switches their mind on same sex marriage, fracking, corporate executives, and Middle Eastern Wars all over the course of 10 years #Bernie2016","post_message":"LISTEN: New Off Message with Glenn Thrush - Hillary Clinton sits down with Glenn Thrush following a campaign event in Syracuse, New York. The former secretary of state compares Donald Trump to foreign demagogues and says she's not even sure her primary opponent is a Democrat. SUBSCRIBE: @webpagelink"},{"comment_id":"520161724799271","commenter_b":"Illinois State law Requires When a firearm is sold or transferred, the buyer is required to present their FOID card. This applies to private sales between individuals as well as to sales by Federal Firearms License (FFL) holders.[7] For firearm sales by an FFL holder, or at a gun show, the seller must perform an automated dial-up check with the State Police, to verify that the FOID card is valid, and to redo the background check of the buyer.[4] This additional checking is known as the Firearm Transfer Inquiry Program (FTIP).[8] For private sales not at a gun show, the seller must also verify the buyer's FOID card with the state police, and receive a transfer approval number, either via a web site or with a phone.. Once again the Anti_ Gun posters cannot get the story straight even if they tried.","commenter_a":"So glad we have Universal Background Checks! Next time the criminal will do a Universal Background Check before he beats the victim and steals all the other guns. You know so he is somehow legal?","post_message":"Before leaving, his attackers also took his gun safe and ammo. -Linda"},{"comment_id":"1023824300991761","commenter_b":"Women's loos can be more festy","commenter_a":"My bathroom in my house is open to anyone who can flush. Unisex bathrooms would end this issue","post_message":"In case you missed it: Trans people need to use the restroom just like anyone else. Why do some people have to make such a big deal about it?"}]
