[{"comment_id":"1551402911832466","commenter_b":"You should check asians' homework","commenter_a":"I absolutely agree!! My husband and I found this to be a problem we felt,for our daughter. We were sending her to a private school until fifth grade,and we enrolled her in the public schools instead. I believe she had somewhat less homework in the public schools but it still seemed a lot. Children definitely need time to be children and to be able to play, make friends,and have free time.","post_message":"American school kids are drowning in homework compared to other countries. Like ATTN: on Facebook."},{"comment_id":"10153440859824411","commenter_b":"Fascists? LMAO!","commenter_a":"Both obama & hillary are fascist pigs !","post_message":""},{"comment_id":"10156247602125354","commenter_b":"Waaah, send them home","commenter_a":"Ha ha ha ha ha","post_message":"Newsflash: you wouldn't BE in jail had you not illegally entered the country."},{"comment_id":"10153331151986336","commenter_b":"Take her out Carly . We need a trustworthy Woman in the whitehouse.","commenter_a":"Thanks for sharing this I will be praying God will greatly use Carly .","post_message":"\"Hillary Clinton has demonstrated over and over again that she is not transparent. She will clearly be the [Democratic] nominee, and somebody must take the fight to her.” – Carly Fiorina"},{"comment_id":"1094512657300125","commenter_b":"@username you know what they say, a slap in the face puts a bitch in her place","commenter_a":"No shit. I don't understand why people have been going nuts that someone was taking their guns away in the first place. That's not the goal. No one's changing 2nd amendment.","post_message":"EVERY American needs to understand this!"},{"comment_id":"10150889986764999","commenter_b":"I don't. Our economy benefits tremendously from the labor, the buying power, and the taxes paid by undocumented labor. I for one don't want to have to pay $5 for an apple. We don't need no stinking wall. What a colossal waste of time and money.","commenter_a":"Who here does not want secure borders and our immigration laws enforced and why?","post_message":"The photo-op allowed Donald J. Trump to please his nativist base and humiliate Mexico at the same time, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"866874116779101","commenter_b":"who voted that fugly bitch in ?","commenter_a":"Because she's batshit crazy","post_message":"Watch this! I guarantee it's the STUPIDEST thing you hear all weekend..."}]
