[{"comment_id":"10154480756700399","commenter_b":"I really thought republicans were smart enough to see that Trump was a racist with a corrupt moron compass, and a rapist.... I was wrong the Republican Party just embarrassed the world","commenter_a":"No, there won't be a gap; there'll be a canyon.","post_message":"\"It’ll be just fine. That’s what I do. I do a good job,\" Trump said while discussing his plan to replace Obamacare. \"I know how to do this stuff.\""},{"comment_id":"10153460551006051","commenter_b":"It's nobody's damn business what she does with her home","commenter_a":"He should get out of this woman's property . However by all accounts it is not her home. She could rent it out, she could house a family . It doesn't seem right just to let the house sit there when so many are in need.","post_message":"This guy stole a 70-year-old woman’s home. On Wednesday, a judge decided whether he could keep it."},{"comment_id":"2041329586093459","commenter_b":"@username , good God man, he is not even President yet....give him some time, will you??? SUDDENLY you all expect him To do miracles??? Rome was not built in a day. Was it?? Worry about these HIPPY KIDS making trouble....poor kids didn't get their way and now they have to riot!! Instead of. Being happy that CROOKED HILLARY is finally away from shaking down and stealing from donated money meant for the poor, and sooo much more , they RIOT!!! Go figure....stupid YOUTH. !!!! That is what kids get as a COLLEGE EDUCATION THESE DAYS!!!","commenter_a":"And it took Donald Trump to do it with practically no help from the Republicans at all. John McCain with Sarah Palin couldn't do it 8 years ago, Romney choked 4 years ago when he didn't even mention the Benghazi attack and coverup when it happened less then 2 months before the election 4 years ago. So, Trump took matters into his own hands and won the Presidency - practically all by himself when he was against all odds, while also helping to secure The House and The Senate...!!! The Republicans have no excuse now...!!! But one thing is for sure, the Republicans and the Democrats sure better know who the BOSS is now..! It's time to get down to business for America..!","post_message":"So now we have the House, and now we have the Senate, and now we have the White House -- and now we have no excuses. There aren't any excuses anymore. The Republican Party has been given the full reins of this government in this country, and there is a mandate behind it."},{"comment_id":"1383240758404704","commenter_b":"Yes they are and the ones that are stirring the pot should should lick the spoon amen","commenter_a":"So let me get this straight.... talking about pussy a decade ago makes you a sexist and bad person; however, talking about and encouraging the killing of cops is justified??? Did I miss something? All these people are a bunch of hypocrites! Saying they want peace and justice when they are the ones continuously stirring the pot and causing an even bigger racial divide!","post_message":"It's people like Sharpton that continue Obama's racial divide in this country. This is absolutely disgusting! Let's expose Sharpton for the race baiting fraud he truly is by sharing this post 2,000 times."},{"comment_id":"10154162666938812","commenter_b":"Omg Hillary is a lier and got Americans killed! She only admits lieing when completely and totally caught","commenter_a":"Hillary should win Not that dumb Trump","post_message":"JUST IN: American Samoa Democratic Party says Hillary Clinton has won Democratic caucus. abcn.ws/1L42Yyx"},{"comment_id":"10155881549390354","commenter_b":"Melissa ! That is fantastic but many women don't have a clue that she is like that ! Great Job Melissa ! You really showed her as she is !","commenter_a":"LET ME APOLOGIZE IN ADVANCE FOR THE STRONG LANGUAGE CONTENT OF THE FOLLOWING....HOWEVER, IT NEEDS TO GET OUT FOR THE NATION TO KNOW THE CHARACTER OF HILLARY BEYOND HER POLITICAL WORDS. PLEASE COPY AND PASTE SO OUR COUNTRY WILL NOT BE SUBJECTED TO HER CONTINUAL LACK OF RESPECT FOR HERSELF AS WELL AS EVERYONE ELSE........Subject: Broomstick one There it is ........book, chapter and page.......the real Hillary LOOK THESE UP IN THE BOOKS AND PAGE NUMBERS CITED IF YOU WISH... EIGHT QUOTES FROM DIFFERENT BOOKS her actual words (1) \"Where is the Godamn flag? I want the Godamn fucking flag up every morning at fucking sunrise. From the book \"Inside the White House\" by Ronald Kessler, p. 244 Hillary to staff at the Arkansas Governor's mansion on Labor Day 1991. (2) off! It's enough I have to see you shit-kickers every day! I'm not going to talk to you, too!! Just ...","post_message":"In an increasingly uncertain world, Americans want to be able to believe that their leaders are speaking honestly. That may be the one skill that Hillary can never learn."},{"comment_id":"921974804515254","commenter_b":"my favorite teacher was/is Mrs Cathy Zavacky-Barrek. She was my kindergarten teacher and I was a cry baby.she always made me feel comfortable and loved away from my mommy....The sweetest teacher ever, nice, loving, but also had control of her class...","commenter_a":"My favorite teacher was in 6th grade. He believed in me when I felt like no one else did- may he rest in peace. My favorite college professor (also my academic advisor) helped guide me along the path I needed to be the first in my immediate family to get a Bachelor's degree (thank you for that Bob)","post_message":"What stories do you have about YOUR favorite teacher?! #NationalTeacherAppreciationDay"}]
