[{"comment_id":"10152938461282293","commenter_b":"GOOD. We need less politics. Clinton's and Bush's destroy this country. Carson is an actual person, not a career politician. Wise people WANT someone who is not a politician, unless you would prefer to stick with the status quo.","commenter_a":"Gifted hands, doesn't mean meant for politics...","post_message":"In Opinion, Dana Milbank writes: \"Carson has little in common with the political class but for one thing: his absolute confidence in his own greatness.\""},{"comment_id":"610661985768228","commenter_b":"white kids of lower middle class know what it is like to be in those areas of transformation and watch their towns become unsafe ghetto's. These immigrants always come forcefully in the streets to establish turf and whites have dealt with it from every race that comes in. don't know ghetto's eh, some of us know and were forged in them. what an ill guided statement to make","commenter_a":"Love the positive comments here, and even if theres negative comments bernie will always have a great comeback as he did in the debate last night. This man deserves the title of president. So much can come from this stop thinking about it & vote for him","post_message":"I am very proud of being Jewish, and that is an essential part of who I am as a human being. My father’s family was wiped out by Hitler in the Holocaust. I know about what crazy and radical, and extremist politics mean. I learned that lesson as a tiny, tiny child when my mother would take me shopping, and we would see people working in stores who had numbers on their arms because they were in Hitler’s concentration camp."},{"comment_id":"10158146961425354","commenter_b":"Patton Oswald? Never heard of her. When will the Secret Service pay a visit to this loon?","commenter_a":"King of Queens actor. Weirdo.","post_message":"PROGRESSIVES' HATE TURNS EVEN DARKER   “Holy F*ck. Come ‘n’ get it, terrorists.\""},{"comment_id":"10153525058378984","commenter_b":"I I do not believe in Political Correctness, I believe in following and standing for my Christian Convictions, and e e expecting others to respect me and what / how I live, as much as I respect others .... and I do not need the Government to tell me how to do it or try to force me to abandon any part of my faith.","commenter_a":"Frankly I dont give a damn what they say.","post_message":"Wow, I thought I'd heard it all from the politically correct left, until I saw this...  Do you think liberals are getting out of control with their constant censorship of America?"},{"comment_id":"10153053153366717","commenter_b":"I can't believe how selfish this woman really is! How can she make a whole office and try to make the whole county think the way she does?! She gives no condition the others in her office that have to work under these stressful conditions. Amazingly selfish. God must be so proud.","commenter_a":"The Devil is your boss and no she is not going to let this die","post_message":""},{"comment_id":"1062563810499126","commenter_b":"Proud to be a new yorker","commenter_a":"What a bunch of BS!!!","post_message":"Former New York City Mayor Rudy Giuliani speaks at the RNC.  Donald J. Trump introduces his wife Melania Trump and she speaks at the Republican National Convention."},{"comment_id":"10154024532730950","commenter_b":"Yes, those woman do.","commenter_a":"He is right. A rapist and an evader of taxes like him, is running for president and might win. Indeed, a third world country.","post_message":"“Folks, we’re living in a third world country,” said Trump while talking about Clinton’s emails. @webpagelink"}]
