[{"comment_id":"944837115644330","commenter_b":"No way trump will win this election! Most white, asian, african american and latinos will unite on november and bit the heck out of trump! Never will vote for a someone that makes fun of disable, a rapist, a liar and a PSYCHO!","commenter_a":"The audacity of your campaign sickness me to my core :/ . You and your minions are the \"deplorables\" . All you that support these monsters should be ashamed of yourselves! #Trump2016","post_message":"If Donald J. Trump becomes president, how can we guarantee that he'll choose America's security over his own financial interests?"},{"comment_id":"10152695549716615","commenter_b":"My wife has never done drugs.","commenter_a":"That lady obv is a meth head..","post_message":"A second grader who has autism - slapped by a teacher's aide. That boy's parents tell WPXI Joe Holden their son was tapping on the aide's shoulder, trying to get her attention, when they say she hit him. Both mom and dad are now upset with how the school handled the incident. We're learning more about the aide's punishment and why it's just not enough for these parents. Joe is also making calls to the school for a response. He'll have an update tonight at 5:06 p.m. on Channel 11 News."},{"comment_id":"10156358767360354","commenter_b":"Fuck that bitch and his man wife","commenter_a":"So sick of this repulsive little sob, 14 more months of the bastard, damn.","post_message":"“We’re going to be aggressive…”"},{"comment_id":"992230870799703","commenter_b":"Naw...she's right and yet...people keep fuckin around with white people. Get smart. Leave the crazy bastards alone. Duh.","commenter_a":"Jason, maybe whites should stop shooting up their own movie theaters and schools. And show me evidence of blacks attacking police officers. I suggest you worry and take out your own trash before you start with racist bullshit. Serial killers, rapist and mass murders Mostly white.","post_message":"Rebel Wilson's usually so funny so this awful joke about police and black lives came as a huge shock. #VMAs #BlackLivesMatter"},{"comment_id":"10153278657786336","commenter_b":"Nice to meet you as well Sherrell.","commenter_a":"White lives matter too","post_message":"Police believe Daron Dylon Wint – the suspect in the D.C. quadruple murder – may be in Brooklyn, New York. DETAILS: @webpagelink"},{"comment_id":"938149182885501","commenter_b":"I lived in a place in LA and I'm a clean freak but the apartment on the other side of the wall was dirty people causing me to get roaches. Now I moved outta Florida for one of those reasons. Thankfully I don't see them in Washington state","commenter_a":"Thanks for the report as high as rental apartment are they should have pest control ridiculous!!","post_message":"Imagine opening up every cabinet and drawer, and seeing nothing but roaches... Mark Rivera took the residents' concerns straight to management STORY: @webpagelink"},{"comment_id":"614667495400588","commenter_b":"although she used the same structure as the \"hero myth\" that Joseph Campbell taught us to be a structure present in all traditional cultures","commenter_a":"Yeah, gonna have to disagree with this article. Just because whiny liberal twenty-somethings are hijacking the HP narrative for their agenda does not mean that the series is poorly written or guilty of propagating a false view of the world. Sure, Rowling is loudly liberal herself. But as a conservative I can, and do, greatly enjoy her books.","post_message":"Let's be honest, J.K. Rowling isn't a very good writer."}]
