[{"comment_id":"847757325414844","commenter_b":"fly your flag and tell these invaders to get out","commenter_a":"Let him fly his flag, this is America","post_message":"There is nothing threatening about an American flag.  He wants to show his pride for his country, let the man!  Do you think he should be able to fly his flag?"},{"comment_id":"10154292047384877","commenter_b":"She out here looking like Nick now","commenter_a":"Wait so you can demand money for a breakup now?? I must have missed that memo, lol","post_message":"Mariah Carey also took to Instagram to confirm the split and her break-up hashtag game is brutal."},{"comment_id":"10153415321678812","commenter_b":"Stacey shutup stupid","commenter_a":"So how does something hitting the windshield really effect a train on tracks? It's not like the train swerved to avoid it and hit something...travelling at 106 mph might be the villain in this tragedy.","post_message":"FBI investigating possible links between Amtrak crash and other trains hit by objects: @webpagelink"},{"comment_id":"1420716084688108","commenter_b":"Lol who said I support the wall..guck the wall just spend more deporting illegals... end of story","commenter_a":"Warren is a liberal piece of fucking shit!!!","post_message":"Republicans did NOT want you to hear this letter. Pass it on!"},{"comment_id":"1644783155547189","commenter_b":"Not busted, she's been padding HER wallet for a L-O-N-G time! You guys are way late to the game..try doing some reading, I knew this, long ago!","commenter_a":"Meanwhile @ Standing Rock! Energy Transfer Partners, WHISPERS TO THE PROTECTORS YOU CANNOT WITHSTAND THE STORM.TULSI GABBARD, US VETERANS AND THE PROTECTORS WHISPER BACK \"WE ARE THE STORM!!!","post_message":"Busted!"},{"comment_id":"1150086235078889","commenter_b":"Hillary Clinton for President!","commenter_a":"This guy.....God help us all if he's elected!!!! Gary Johnson!!!! Love how he talks about jobs when he's notorious for trying to break up unions and has his own clothing line made in China!!! l","post_message":"WATCH LIVE: Donald J. Trump holds rally in Florida"},{"comment_id":"1244894375530590","commenter_b":"all the illegals are not accounted for, so this is false!!!","commenter_a":"Hope it's true","post_message":"There was one big reason for leaving."}]
