[{"comment_id":"916372545089161","commenter_b":"She is beautiful. But ugly women and men with little dicks see the opposite! :-)","commenter_a":"She is still pretty","post_message":"Where HAS Michelle Obama's hair gone?"},{"comment_id":"10153924277776130","commenter_b":"These girls are still relevant? Lol","commenter_a":"Can't get crack online","post_message":"Um ... what!?"},{"comment_id":"10153499292339714","commenter_b":"Since when are \"weak\" and \"helpless\" feminine traits?","commenter_a":"Worst thing to say to a boy according to my son is \"clean your room\". He wants to be called a \"man\" and he's 7 and proud of it. People need to get over this emotional craps. Boys will eventually be men. I think the worst thing you could say is \"woman up\".","post_message":"How do we socialize boys differently?"},{"comment_id":"10152880338496636","commenter_b":"Says the white woman...","commenter_a":"Personally I think if the tribes want it built, the tribes should pay for it. It doesn't bother me one bit sitting unfinished and there are so many other things the state could spend the money on. How about paying our teachers a decent wage.","post_message":"You probably driven by this empty building. It had thousands of dollars poured into it, but it still sits as an empty shell. Thanks to a bill Gov. Mary Fallin signed, that may be changing soon."},{"comment_id":"805771119613465","commenter_b":"The woman has no class.","commenter_a":"Laura Bush...a REAL FIRST LADY WITH CLASS...not the thing we have now , a disgrace!","post_message":"Laura Bush SLAMS Michelle Obama Right To Her Face In Front Of Everyone. This is awesome. We love her. Can we get 5,000 'LIKES' for Laura Bush?"},{"comment_id":"10153846825321336","commenter_b":"We need him gone he don't give a damm about anything go home you muslim","commenter_a":"Obama is aiding and abetting the enemy. He is a traitor and should get what he deserves as such.","post_message":"“If you were waiting to hear a U.S. president say, 'I feel your pain' or…'it’s them or us,' that is not what you just heard.” – Bill Hemmer on President Barack Obama's speech on the Paris attacks @webpagelink"},{"comment_id":"1339247516091906","commenter_b":"America is turning vile and to bad for those who can't see it. If we keep it up we all lose .","commenter_a":"That is because it's a love fest! Everyone eventually comes around and loves Trump! He will be our greatest president in modern history! #trump2016","post_message":"Fox News host Megyn Kelly and Republican presidential candidate Donald J. Trump met in New York City on Wednesday morning."}]
