[{"comment_id":"10156425606485725","commenter_b":"Lol Caitlyn Jenner beat you as Most Fascinating Person. Lol Loser","commenter_a":"This is a cool post Donald ! I haul livestock so unfortunate'ly wasn't able to watch the show ! Really cool you post the neatest stuff!!!","post_message":"You do not want to miss Barbara Walters 10 Most Fascinating People of 2015 tonight at 9:30pmE on ABC! ENJOY!"},{"comment_id":"683830911775006","commenter_b":"WHO CARES!!!!!!!!!!!!","commenter_a":"So she is smart good for her.","post_message":"People are freaking out over what's being said about Taylor Swift today..."},{"comment_id":"919415154748007","commenter_b":"Really u sound SPECIAL!!! thanks for making the black race look retarded all by urself!!! Ur what the white man lives to have on his side.. Wake up my sister. Don't matter what shade we are we are all black","commenter_a":"stop f****** with them mixies and get a. SISTER","post_message":"\"Dark Skin Activist\" Slams Kendrick Lamar Over Light-Skinned Fianceé: “I Will Never Support Him”"},{"comment_id":"10153921857951323","commenter_b":"seductive dancing is an ancient art form...and a rare 5% of woman have any natural talent at it at all.","commenter_a":"'Sex industry' is not an industry. Sadly you were not given enough opportunities and maybe this is why you think this is a job.","post_message":"\"The sex industry is one of the very few industries in which middle-class to upper-class men regularly give large sums of money to working-class women. I wonder if that’s one of the reasons why people hate us.”"},{"comment_id":"10152763555906051","commenter_b":"This is just getting so ridiculous why don't people just mind your own business and live her own life grow up","commenter_a":"i think she is one hell of a shot. i wouldent piss her off. leave her alone. your just jelous because you can't bow hunt as good as her. she is feeding someone. you have nothing to be scared of with an eye like yours. u go girl.","post_message":"This woman has been getting death threats over her photos. Decide for yourselves if the criticism is warranted."},{"comment_id":"10153092888622507","commenter_b":"I like planned parenthood because it will finally rid all the blacks from the US","commenter_a":"Woman, can you say Obama care? You dems rammed it down my throat saying it would take care of all medical needs. Aren't women part of this? Why should I help pay for obamacare and planned parent hood too!","post_message":"Watch Senator Elizabeth Warren crush it on the Senate floor during the debate to defund Planned Parenthood: “Did you fall down, hit your head and think you woke up in the 1950s or the 1890s? Should we call for a doctor?”"},{"comment_id":"1006601726066242","commenter_b":"It is her own fault due to not following the rules- do not get closer then 25 yards!!!","commenter_a":"Stupid people, I do enjoy them.","post_message":"Pictured: Moment bison selfie went all wrong"}]
