[{"comment_id":"10155091471801579","commenter_b":"Anything to shut down that lying screeching woman!","commenter_a":"She knew it was coming. It was part of her plan. It's all about playing the victim. Raising money.","post_message":"Uh-oh"},{"comment_id":"10153294543663701","commenter_b":"Lets here the song about an old woman molesting you when you were a kid.. LMAO!","commenter_a":"'@username :)","post_message":"Garth Brooks rocked the Rose City on Sunday! If you missed out, the Moda Center just announced that limited tickets are available for his three remaining Portland performances."},{"comment_id":"10153662758062894","commenter_b":"Naw mama had let that warning out that she addresses her child my bad young lady again she gon catch that fade","commenter_a":"But skai read her so no need for mama to even say anything","post_message":"Not My Child! Skai Jackson’s Mother Has Words for Azealia Banks: ‘I Don’t Play Those Games’ [Photo]"},{"comment_id":"10156197809660725","commenter_b":"I think you mean deports the illegals","commenter_a":"thank you Donald Trump...for being the voice of and for 'the people'. liberal media and politicians are not used to truth...refreshing to hear you vs the politicians not in touch with Americas condition and needs!","post_message":"An updated POLL tracker (with all polls thru the weekend) reveals I maintained a double digit lead at 34.8%. Not only that, my poll #'s are double that of 2nd place candidate. #Trump2016 #MakeAmericaGreatAgain"},{"comment_id":"1363332557011521","commenter_b":"Robert Flemming you still haven't answered my question.","commenter_a":"I tell ya, if any of that shit were real, I'd much rather be on the side of Satan, than some dude that allows childhood bone cancer to be a thing. I'll keep my free thought thanks, you can keep your sadistic, imaginary friend to yourself.","post_message":"Food for thought."},{"comment_id":"10153081622630329","commenter_b":"Yeah because all Muslims are terrorists....you absolute dickhead","commenter_a":"I've been saying this for many many years now and this just proves me right. Especially after 911 we should have turned that entire part of the world into a sheet of glass. The women breed them, the kids are trained like them and are used as mercenaries. KILL THEM ALL. There are to many to sort out and sift through to decide who's good and who's not. Point blank end them all.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"979362338768669","commenter_b":"Guys don't have tits !","commenter_a":"It's called hooters. No man with big boobs should be allowed to serve food in a skimpy outfit. Gross","post_message":"This may surprise a lot of people!"}]
