[{"comment_id":"1644362728922565","commenter_b":"But haven't you heard....those votes are all from dead illegals","commenter_a":"Electoral College must do the right thing and prevent Trump becoming president. Now 2.5 million more people voted for Clinton than Trump!","post_message":"Were you wondering why Trump talked to Taiwanese President?"},{"comment_id":"613162948816887","commenter_b":"Try to imagine how little I care about anything this pre-teen brain has to say.","commenter_a":"She's a f*cking but job anyway....","post_message":"She is PSYCHO crazy folks."},{"comment_id":"10156543098270354","commenter_b":"So he opens the gates to let them in and then starts deporting them. I smell a RAT.","commenter_a":"Great but post it on obama and hillarys pg","post_message":"Obama Photo-Op Head Fake.  Don't Believe the Hype..."},{"comment_id":"1570583689633777","commenter_b":"There is no sense in even trying to reason with these people. They are a whole level of crazy I don't want to be around. Scary! I didn't see riots like this when Obama was elected-because we have class and integrity. Trump will lead this country like no other! I can't wait for the future of America!🇺🇸🚂❤️","commenter_a":"Our country is full of spoiled people who are so used to having things their way, they act like a class of 5 y/o kids who didn't get the green marker! Come on, this country has the same electoral system that has worked without problem for hundreds if years. No one rioted when any other person has been elected, altjpugh i am sure many people felt disappointment. And the democrats and supporters whole campaign slogan was 'stronger together, peace, love, equality'......... Which all I'm seeing is a true fit being thrown by people who didn't get their way. Funny how true colors come shining out when the world they are used to getting their way in doesn't quite work out. Peace, love, equality, anti hate??? I think not supporters. Your example is clear.","post_message":"Protesters burned American flags and chanted 'not my president' despite Democrats' calls for a peaceful transition of power."},{"comment_id":"10153737877981409","commenter_b":"What a jerk!!! He thought what he did was a start for his 2020 presidential run. After tonight, he'll never be elected. He shot himself in the foot and his chances for 2020.","commenter_a":"Unfortunate choice. He committed political suicide and will take the name 'Lyin' Ted' to his grave.","post_message":"Former Trump rival Cruz met with boos during GOP convention speech."},{"comment_id":"10154584633716955","commenter_b":"I think she should move to Mexico!!!","commenter_a":"I'm thinking she would have done that whether she won or lost.","post_message":"TIRED HILLARY"},{"comment_id":"10152705409276051","commenter_b":"This scummy bitch deserves to die for what she did to that baby","commenter_a":"sorry sick people deserve the worse","post_message":"Officials couldn't believe that a mom would do this to her own child."}]
