[{"comment_id":"10154441744191509","commenter_b":"WE STAND WITH TED CRUZ----WE WONT VOTE FOR JIMMY NUTS CARTER ENDORSE TRUMP OR ILLEGAL ALIEN AMNESTY PROMOTER RUBIO.","commenter_a":"Jessi Spires Ben Kraja Alex Gochis Tyler Teejay Chase","post_message":"Three white nationalist leaders have formed a super PAC for Donald J. Trump, even though Trump doesn't want their support.  #NewHampshire voters are getting a robocall with a simple, disturbing message."},{"comment_id":"10153147185484342","commenter_b":"Bruce Jenner is a woman, this lady is black, and I'm a billionaire.","commenter_a":"Since she was 5? Then this just didn't happen since she entered into adulthood. She had a identity problem since she was a kid and I blame her parents on that because they should've noticed it way back then. To all you parents out there who have little kids, pay more attention to your kids.","post_message":"'I was drawing self-portraits with the brown crayon instead of the peach crayon.'  #RachelDolezal has broken her silence, saying she started identifying herself as black around the age of 5."},{"comment_id":"10154177899058812","commenter_b":"shut up and go away","commenter_a":"and now back to the real news","post_message":"JUST IN: President Obama orders flags flown at half-staff in honor of Nancy Reagan. abcn.ws/1M2M51P"},{"comment_id":"1195188837159645","commenter_b":"Hahaha that bitch pussy on all types of fire😂😂😂","commenter_a":"Shanira","post_message":"Oh my"},{"comment_id":"10153167814539203","commenter_b":"typical, bend over asshole, and I'll shove a hammer up your ass. 😊","commenter_a":"leave it to a man, to be an ass.","post_message":"Will Smith on After Earth PTSD: 'After the failure of 'After Earth,' a thing got broken in my mind...'"},{"comment_id":"10155794432670354","commenter_b":"she'll never get that stink off her!","commenter_a":"What was that idiot doing there anyway.","post_message":"What was she thinking?"},{"comment_id":"10153657681658984","commenter_b":"We have lost respect for megan and will not watch her show. I didn't think fox news would stoop to that level of questioning.","commenter_a":"What you call journalism, is piss poor.","post_message":"What Megyn Kelly just said may end the rowdy Trump/Fox feud...then again...  Do you think the Fox News personality did the right thing here?"}]
