[{"comment_id":"10153991017722235","commenter_b":"If you give a lady $10 and rape her, it doesn't make her a prostitute. It makes you a rapist.","commenter_a":"Georgia, Georgia, what are you doing. You were devastated in the civil war for your enslavement of people now you demonstrate you might need another lesson. Someone dig up General Sherman.","post_message":"YES!"},{"comment_id":"10154079570861130","commenter_b":"What do you have against us fat lesbians ?","commenter_a":"He looks like a fat lesbian Neil young.","post_message":"\"...I think Donald J. Trump is gonna win.” --Michael Moore"},{"comment_id":"1142026852548536","commenter_b":"Hillary is done!! all thanks to Gucifer 2.0!!! Ding dong the witch is dead, the wicked witch @webpagelink","commenter_a":"hahaha..my grandsons are proud of hillary clinton for her campaign for president..they think donald trump is a bully and bigot..says a lot for a 16 year old and 12 year old!","post_message":"A lot has changed in the past two and a half decades. But the things we’re fighting for remain the same."},{"comment_id":"10153292448497235","commenter_b":"Dear, ditzy Megan does her best to serve her corporate owners and their agendas. Sorry, that leaves no room for accurate reporting.","commenter_a":"Never liked Kelley she lies all of the time. Looks so smug.","post_message":"\"Fair and Balanced,\" huh?"},{"comment_id":"998513920215363","commenter_b":"girl needs to sit down","commenter_a":"LOL @username","post_message":"Yeah, Um....No."},{"comment_id":"10153794023656051","commenter_b":"If she had broken into my house, I would have gotten in bed with her and just laid there waiting for her to wake up.","commenter_a":"I'd shag her then call po po","post_message":"This wife came home early and found this woman in her bed. She immediately assumed her husband was having an affair. It was only after she ordered him to come home and confronted him about it that she finally discovered the truth."},{"comment_id":"10152910071581130","commenter_b":"@username, cry me a River. You don't see that those women keep on having babies that they can't take care of and are sold into prostitution. Oh, but im wrong for believing in controlling the problem. And no bitch, I got my tubes cut and burned, because I dont believe in having more then what I can take care of.","commenter_a":"Since they don't have protection & clearly can't afford children why not find alternatives to intercourse? Or maybe idk use some self control & abstain from sex altogether? They are consenting adult women fully aware of the possible outcome/consequences of their choices. Only people I feel sorry for are those babies born into a piss poor life because they have SELFISH parents.","post_message":"“Sharing a bed is fine, it’s okay to share and be all together. But it’s tough because what if the person next to you is sick? What if they pass that illness on to you and your baby?”"}]
