[{"comment_id":"10154584590253812","commenter_b":"HILLARY TO WELCOME 1 MILLION MUSLIMS IN 1ST TERM Clinton's plan to expand refugee resettlement could cost U.S. taxpayers over $400 billion","commenter_a":"So we are being lead into war against each other and to blind to see the obvious of what is happening. When we need to be standing together fighting against these foreign countries and what we have been fighting for way before our time. Instead of allowing the color of your skin be an issue and using it towards one another. If you have so much hate use the energy towards standing up together fighting together working together and being there for one another to stand strong and conquer these hard times. We are giving in to everything we have fought to protect and save. Stop fighting against one another and fight for one another. Stop allowing this society to break us and the government to control us. Stop giving the enemy what they want and give them what they deserve. Stop being that slave to the government and allowing ...","post_message":"President Obama in comments on Nice attack: “These terrorists are targeting and killing innocent people, including Muslims.\" @webpagelink"},{"comment_id":"10153824664946336","commenter_b":"Just like Starbucks, learn to cook woman","commenter_a":"So many people falling for this. Of course the government wants everyone against Chipotle, because it's the first popular public chain against GMO's, which makes the government food companies look bad. I'll still be eating at Chipotle; everything they serve is still way better for you than the majority of fast food restaurants.","post_message":"The Chipotle Mexican Grill stores can open after they replace all produce, do a deep cleaning of their stores, pass a local health inspection and start a new protocol for cleaning produce."},{"comment_id":"10152910744010779","commenter_b":"I believe that you're a dumb whore.","commenter_a":"Can you guys just NOT send me this one in the mail? Thanks.","post_message":"Reality-TV juggernaut, selfie queen, actress, model, mother, Internet-breaker, entrepreneur and video game subject Kim Kardashian has something to say: \"I believe that I am so much smarter than I'm portrayed.\" The 34-year-old megastar talks about her scandals, family, and feminism in our wide-ranging new cover story. Here are 11 highlights you won’t want to miss: @webpagelink"},{"comment_id":"1141907219179950","commenter_b":"So, she won 3rd and 5th place. So much for any supposed advantage she's supposed to have by having been born biologically male. She was beat by naturally born females.","commenter_a":"We're all equal so we must all be equal physically right? Yeah no.","post_message":"“What happened to protecting naturally born females?”"},{"comment_id":"949480448492859","commenter_b":"I know and all white people are racist, and all blacks are bad and all people named Ana are jerks. Yeah I get it.","commenter_a":"Whatever people think about Trump, he's not as stupid or delirious as the Democrats who put Israel and the USA in jeopardy of a nuclear strike, and gave the biggest supporter of terrorists over $150 billion dollars to wipe us out... Our government is carrying political correctness to the point of suicide, just like all the European nations did by taking in millions of so-called refugees... People think it might be dangerous if Trump has his hands on the nuclear arsenal... how is that any worse than giving nukes to our biggest enemy who daily threaten our extinction and Israel's extinction??? AND CRUZ was behind all these deals. We don't need him in the WHITE HOUSE. Lawyers are liars and he is not different than the rest of the lawyers around this country.","post_message":"Carly Fiorina: It's time to unite behind Ted Cruz: @webpagelink"},{"comment_id":"1757125454570252","commenter_b":"Kasich belongs to the Liberal side, lies like they do. Thank God, all has been peaceful. Stay safe Law Enforcement 🇺🇸","commenter_a":"Loved your speach, Laura. I'm so disappointed in John Kasich, Jeb Bush and other Republican leaders who are helping Hillary to win.","post_message":"The Ohio governor is still refusing to attend the convention in his home state and support GOP unity."},{"comment_id":"614347815409395","commenter_b":"Easy win! He will roll across her !","commenter_a":"Will she be stoned throughout the debate?","post_message":"Who do you think will win the first presidential debate?"}]
