[{"comment_id":"1241041889268599","commenter_b":"Kelly is an ass wipe. Acts like a two bit sleazy pig with her bottle cap tits, ya know the ones she like talking about","commenter_a":"Get rid of her","post_message":"Megyn Kelly reacts to Trump's Florida speech.  @webpagelink"},{"comment_id":"1003201996389936","commenter_b":"Melissa Missael","commenter_a":"Merly Vivanco Albert Perez what a joke Ben Carson is. Lol.","post_message":"This one is for those who ever doubted Trevor Noah's ability to fill Jon Stewart's shoes."},{"comment_id":"10154996547968010","commenter_b":"Let the muther fucker SUFFER!","commenter_a":"Think he'll be well enough in time for Trump to appoint him to the SCOTUS?","post_message":"A source said Manson was seriously ill and it was unclear how long his treatment would take."},{"comment_id":"10153489141693984","commenter_b":"No that bitch crazy","commenter_a":"Hope she isn't elected.....","post_message":"With what we know about Hillary's perfectly planned events, it is not too far-fetched to believe what these people are accusing her of...  Are you hoping all the Clinton controversy will force Hillary out of the race?"},{"comment_id":"10152653302261167","commenter_b":"Females can't pass Marine tests. In other words, they can't get out of a foxhole with loaded backpack on. What harm could that cause?","commenter_a":"Those women go through the same training as the men, do they not? Are you going to insult all of our enlisted women by telling them they aren't combat capable?","post_message":"The man who the U.S. military kicked out of Iraq for divulging  sensitive information about troop locations has some thoughts on women in combat."},{"comment_id":"10153248022411336","commenter_b":"John V Salazar","commenter_a":"We had a similar issue at a university I worked at years ago. The guy was just a creepy freak but he cried \"academic freedom\" and got away with showing porn in a music class and \"relating it to music\". Oddly enough, once he FINALLY retired, the class was discontinued as it had no value. There are times academic freedom goes too far and yet that is the basic premise of any university and with tenured faculty your hands are tied if they \"justify\" it.","post_message":"Parents, what do you think of this? A professor at UC San Diego is reportedly asking students to be naked to pass the final exam."},{"comment_id":"659659264197547","commenter_b":"We all know why he said this... Statistically speaking illegal immigrants will vote Democrat.. This is another reason why they do not want voter ID... It is not racist to want voter ID... everyone carries an ID.. Again a narrative from the left, In 10-15 years will we will be a one party country... We will also have a single-payer system, so get in line and prepared to wait for your doctor because you are now dealing with the government which is like dealing with the department of motor vehicles.. We will also have 500,000 more Syrian refugees in this country, A pay for play with Soros, she is a puppet for him... All of our tax dollars will have to pay for these refugees and all of the entitlement programs, along with all of the illegal immigrants in the country currently... We are on our way to socialism, open ...","commenter_a":"Well, in the next three days you will see our crooked media , led by CNN and NBC , run all the dirt they can dream up on Trump and absolutely nothing negative on Hillary despite all the information. It's our last chance to get rid of corrupt Washington insiders like the Clintons. VOTE TRUMP !!!","post_message":"***SHOCK*** Days before presidential election, Obama is openly and blatantly thumbing his nose at the rule of law that governs American elections..."}]
