[{"comment_id":"1244555875564440","commenter_b":"Cruz is an idiot lady.","commenter_a":"Ted Cruz is right and is a good man! Good for you Ted! Tell that loser of of President who wants to allow criminals out of prison, and terrorists over our borders!","post_message":"Sen. Ted Cruz has some sharp words for President Obama, who he says attacked him two days in a row.  Read full story: @webpagelink"},{"comment_id":"10155791972890725","commenter_b":"STFU","commenter_a":"and a lot of people blame the police in one out of five hundred killings. what happen to hope and change under obama?","post_message":"Police say the victim, identified as Vonzell Banks, was likely not the intended target ----> @webpagelink"},{"comment_id":"453039741550986","commenter_b":"Pretty and can shoot too !","commenter_a":"This maybe my new favorite person,what a gal!!!! She has more balls than the entire dem party,and half the repubs too!!! Thankyou girl!!!","post_message":""},{"comment_id":"10154210994334024","commenter_b":"@username and never apologized! Hillary blamed them and called them vile names. Such double standards.","commenter_a":"This book was praised by women readers and them running to the theaters to see the movie, but offended by what trump said 11 years ago. The vulgarity of those novels enormously outweigh what he said. Such hypocrisy!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10154879190478812","commenter_b":"Shoot back you spineless worms","commenter_a":"That's a lie. Yemenies love USA soooooooooooo much","post_message":"Two missiles fired at U.S. Navy guided missile destroyer USS Mason in international waters off the coast of Yemen on Sunday, according to the Pentagon."},{"comment_id":"10156672074140725","commenter_b":"Americans have done that stuff for years. Illegals do it cheaper because they work under the table and cause greater unemployment and then somehow get welfare!","commenter_a":"hey stupid Donald trump if you stop immigration who will work on the farms or will clean the bathrooms , American people won't do that stuff , think on what you are saying trump","post_message":"WOW! THANK YOU Atlanta, Georgia! LETS MAKE AMERICA SAFE & GREAT AGAIN! Heading to Nevada- now!"},{"comment_id":"1521903891446834","commenter_b":"Oei. Big mothafucka😕","commenter_a":"Oh ooh @username","post_message":"We could be about to witness something enormous."}]
