[{"comment_id":"10152895696909342","commenter_b":"shoot her in the face..","commenter_a":"Smh","post_message":"Police: Woman tosses baby out of car window during traffic stop. abc13.com/@username/"},{"comment_id":"10152939626746636","commenter_b":"Would you please get that hamster out of there by you're in?","commenter_a":"Gonzalo Jara is disgusting and may be homosexual. He should be banned for life!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153105977467098","commenter_b":"YUP!! We always Been Here!! Who the Real Illegals!!","commenter_a":"Every race that is not latino or native american is an illegal inmigrant or descendant OF an illegal immigrant latinos ARE from this continent OF AMERICA... North central and south AMERICA ANYONE else their ancestors came on a boat across The Ocean and The atlantic ALL WE Did WAS cross an imaginary Line Lmao.... americans huh..... WATCH WHO u call a wet back we didnt have to cross The atlantic TO GET here wet backs","post_message":"Donald Trump would not say how he would locate, round up and deport the 11 million undocumented immigrants he says must go."},{"comment_id":"10153524858391130","commenter_b":"I think the border should be closed to everyone until there is no violence in the USA! Or at least get it under control! There's gangs, rapist and terrorist roaming the streets! People under the fly alert were able to purchase guns yet half of American's aren't aloud to! Smh This government needs an overhaul, the system needs an overhaul!! People are homeless, going hungry and much more yet we still allow people in and they get free food, clothing and housing? Come on now!! This is suppose to be a place for dream's & opportunity!! USA has lost everything it built!!","commenter_a":"how is being again Islam racist ? it's a religion not a bloody race,,ban all organised religion,, there all fucking nutters","post_message":"Trump wants a 'total and complete shutdown of Muslims entering the United States.'"},{"comment_id":"10153672228046130","commenter_b":"She's not plus size... She's average!!!!!","commenter_a":"How hilarious.","post_message":"A trailblazing move by Sports Illustrated Swimsuit."},{"comment_id":"10154734635153797","commenter_b":"I can't believe this! That's why having your ccw's is so important. I will not leave without my .22, might not kill you, but it could save my life. Idk how the laws are there but here in Ohio, especially in Cleveland where I'm from. You need to be carrying. I would've helped her in a heartbeat. No questions asked. Then criminals would think twice, if we all start defending ourselves.","commenter_a":"I'm so mad right now not only at the whole situation but nobody had the compassion to help her I'm thinking of that was my Mother, sister auntie etc... praying..","post_message":"CTA VICTIM ID'D: The woman who was stabbed repeatedly on a crowded Red Line train Thursday afternoon has been identified as 25-year-old Jessica Hampton."},{"comment_id":"389899691198325","commenter_b":"No comment !!! But she better Pray that Her President doesn't get away with his Immigration Laws ??","commenter_a":"Get a JOB!!!!","post_message":"Another welfare queen...:/"}]
