[{"comment_id":"10154060235711336","commenter_b":"Refuse to have hearings on any potential candidate until after the election.","commenter_a":"Quit following this piece of trash. Go back to Cuba where you came from.","post_message":"“We risk losing our basic constitutional rights with one more liberal justice on the court.” Sen. Ted Cruz reacted to the passing of Supreme Court Justice Antonin Scalia, saying this loss “underscores the stakes of this election.” Do you agree? @webpagelink"},{"comment_id":"634863706677709","commenter_b":"Yes absolutely. ...you are on our soil...you NOW live by our laws...if you don't like that LEAVE....","commenter_a":"Yes she has to obey the law's of this land, or be deported","post_message":"Muslim Refuse To Remove Head Covering For Officers – Gets Brutal Wakeup Call. Should of listen to authority. Do you think everyone should have to obey they law, regardless of religion?"},{"comment_id":"1832396510332680","commenter_b":"Should we really call it entertainment..I call it junk","commenter_a":"Why do you suppose Liberals love the entertainment biz and wanted control over it..it's one of their mainstream vehicles to get their agenda across...so much for entertainment anymore..","post_message":"“The music industry suffered a melt down on national television during the American Music Awards – launching into unhinged, profane tirades directed at President-elect Donald Trump and his wife, Melania,” Todd Starnes writes."},{"comment_id":"10156672176230615","commenter_b":"@username you're amazing. Marry me haha","commenter_a":"Let me be honest here. When the California primary happens I'm voting for Bernie. But if Hilary does win the democratic side I'll vote for her. No way am I letting a republican be president. Republicans will just do what they can to get rid of Obamacare, canceling out the rights for the LGBT community, sending our troops to meaningless wars. Hilary might go to war but however she might not. In the end I'm voting democrat for the presidency. A republican will just destroy this country and send us to hell. Not voting for democrat cause Hilary is it is voting for a republican.","post_message":"BREAKING –"},{"comment_id":"10154479449143271","commenter_b":"Happens to every girl.","commenter_a":"LoL OMG! When I was 14 I lived off of 14th and Pierce by Casa Bonita....and had to catch the bus on Colfax for school. If I would have reported every dude who cat called, they would have needed a daily report for me alone on the news. I'm really not trying to down play the fact that this guy could have been a weirdo but this seems a little extreme.","post_message":"Keep an eye out, Colorado. This man reportedly tried to follow the girls home after they ran away from him."},{"comment_id":"1669026716715370","commenter_b":"You can not close borders. People can fly here, come on boats and come via Canada or Mexico. The president has deported more illegals than any other president. Frankly the wealthy prefer to hire illegals to watch their children, clean and build their homes and other jobs because they do not want to pay minimum wages and want them to work as slaves in the farms, restaurants and factories. Put the blame where it belongs, on the 5%ers that are reaping the benefits of immigrants. They get you passed at the victims rather than themselves. If you want change you have to vote for someone brave enough to address the issues and actually formulate and execute a plan. Perhaps Bernie who actually addresses the issue. Voting for billionaires backed by the 5% will not resolve any issues.","commenter_a":"Obama better back off, he is allready in it for Treason","post_message":"Franklin Graham just delivered a MASSIVE message to Obama and the left about jihad and what it means for America... liberals are furious, but over 100,000 people have \"liked\" what he said on Facebook. Do you agree with Rev. Graham?"},{"comment_id":"1649233105382359","commenter_b":"@username well it doesn't seem to be on the minds of the ones that are. If it was they might not have sex at that moment","commenter_a":"That is nothing to brag about. You should find some other talking points to criticize Trump on. Abortion should be the last thing on a 14 yr old girls mind.","post_message":"Actress Ali Wentworth: When Trump Won My 14-Year-Old Daughter Complained There’d be “No Abortions!”"}]
