[{"comment_id":"10153342473651336","commenter_b":"The girl was mouthing off and ignoring him when he said get the hell away, if that was my daughter I'd slap the taste out her mouth, she wouldn't even have to worry about the cop.","commenter_a":"These cops are constantly thrown into situations where there are multiple combative people and ONE officer. Was he in the right or wrong? I don't know, but cops are constantly put in these dangerous positions as a part of their job.","post_message":"The video appears to show the officer using his knees to pin the girl face down, pointing his gun at other teens and cursing."},{"comment_id":"1032281423464900","commenter_b":"Oh please. You gotta be kidding. I will say Madcow needs the ratings for sure.","commenter_a":"When you get the guts to go on Rachel Maddow's show, please let me know.","post_message":"I talked with Fox News’ Gretchen Carlson this afternoon about the House passage of the Homeland Security Appropriations bill. As I told her, we made a commitment in December to seek to block President Obama’s lawless, unconstitutional amnesty using the \"power of the purse.\" Today we upheld that promise by doing our part to pass the strongest, most conservative bill that we could. I hope you’ll take a moment to watch."},{"comment_id":"1313639405344510","commenter_b":"Saudi is the most corrupt and evil country in the world. Where else are women banned from doing anything? Even worse than North Korea. And yet, Hillary took money from them and her supporters love to cry \"sexism!\" One Nation under God \"there is no one like our God\" Jesus, Amen. We don't need any Islamic states in American","commenter_a":"Saudi is the most corrupt and evil country in the world. Where else are women banned from doing anything? Even worse than North Korea. And yet, Hillary took money from them and her supporters love to cry \"sexism!\" One Nation under God \"there is no one like our God\" Jesus, Amen. We don't need any Islamic states in American","post_message":"U.S. president-elect Donald Trump’s recent cabinet appointments had drawn harsh criticism from civil rights campaigners. The cabinet picks have, however, earned praise from white supremacists and neo-Nazis. What do you think about his cabinet? Join us on #presstvdebate at 18:33 GMT"},{"comment_id":"10153275718534726","commenter_b":"Sometimes really rebellious kids need a bad scare, and yes, they should be afraid of cops. It's societies way of dealing with bad people. It's the people that don't fear cops that I worry about.","commenter_a":"good","post_message":"@webpagelink"},{"comment_id":"10153802989025927","commenter_b":"If you are here legally you have nothing to fear, stop listening to liberals who pander fear...If you are here illegally than yes, you might wanna vacate before being made to leave...This is not a hard concept, it's quite simple, if you are here illegally leave and immigrate back legally, if you are here legally ...What are you worrying about?","commenter_a":"If these people want to engage in disrespecting this country by burning the American Flag and demonstrating allegiance to another the authorities should round them up and deposit them in that country they love so much. This is getting to be far far too common and needs to be stopped. They can go to these countries they love so much and demonstrate and destroy things there","post_message":"PROFESSOR: am getting many heartfelt notes from students who are in shock over the election returns and , rightly or wrongly for their families ..."},{"comment_id":"10154030392435329","commenter_b":"Hahahaha this is so us","commenter_a":"This is like 95% us! @username","post_message":"♫ People, let me tell you about my best friend. ♫"},{"comment_id":"1311796595543533","commenter_b":"#DontBoo #VoteHillary #NastyWomenVote","commenter_a":"we are not going backward, we are going forward , Best of luck The world President @username \"I am sick and tired of the negative, dark, divisive, dangerous vision and behaviour of people who support Donald J. Trump","post_message":"Don’t miss out! Join them: hillaryclinton.com/makeaplan"}]
