[{"comment_id":"611652445656331","commenter_b":"USE'N The Words \"Protect & Serve\" Is An Excape For Majority Of Ths Police Officers Who Shoot & Kill Inoscent' Civilians ... SMH* It Is A Shame ...Need To Weed -Out The B.A.D. - POLICE OFFICERS Sister Asiyah Hensley Ka'Bah Brother Abdul Azim Ka'Bah","commenter_a":"Thank you for standing up and stating the truth","post_message":"\"These shooters aren't my brothers in blue, they're murderers.\" - Rep. Andre Carson, a former law enforcement officer, joined other members of the Congressional Black Caucus to condemn the recent police shootings of Alton Sterling and Philando Castile Read more: @webpagelink"},{"comment_id":"10153207313881770","commenter_b":"She has always been a liberal idiot so send them all to her house","commenter_a":"An actress whose biggest claim to fame is getting nailed by Frankenfurter","post_message":"Susan Sarandon is now likening Syrian refugees to Jesus."},{"comment_id":"10154223634466770","commenter_b":"She's got great legs","commenter_a":"All these red carpet shows are about is who can have the most revealing, revolting and trashy outfit on! It's rare that there's a decent one, but I guess they're the ones not shown because they aren't revealing enough! Too bad these \"artists\" don't rely on talent!!!","post_message":"We didn't even know they made dresses this short."},{"comment_id":"10155031331646320","commenter_b":"You are on my prayer list.","commenter_a":"Stay strong","post_message":"Detective Steven McDonald was hospitalized earlier today after suffering a heart attack. Our thoughts and prayers are with the McDonald family. A former U.S. Navy hospital corpsman and third generation police officer, Steven McDonald was shot three times in the line of duty on July 12, 1986. The shooting left him quadriplegic. Several months after his injuries, he said that he had forgiven the 15 year-old who had shot him."},{"comment_id":"654547928069119","commenter_b":"Her momma needed to be called..to see what a disrespectful kid she has..","commenter_a":"She deserved what she got..","post_message":"Obama supporter gives lip to police, learns very quick lesson. This is what you get when you disrespect authority. Do you think she got what she deserved?"},{"comment_id":"1861753934052329","commenter_b":"I'm pretty sure @username was being sarcastic","commenter_a":"Lol wow. That tool didn't \"destroy\" anything. He just confirmed how idiotic the Obama administration is and how clueless they are when it comes to guns. He says the guns were legally purchased in California, but then says if there were \"common sense gun laws\", terrorists would change their mind about committing acts of terrorism, completely ignoring the fact that the legally purchased guns in California were purchased under the \"common sense gun laws\" you faggots have been calling for!!! Here is a question, have common sense pot laws prevented any of you jackasses from buying and smoking your weed?? Have common sense alcohol laws, like making it completely illegal to drink and drive, ended deaths caused by DUIs!? The fact that most of you idiots following this page actually believe the bullshit posted and the nonsense this president and his fuckbuddies spew out of their assholes means we are ...","post_message":"This sums it up. His reaction is great. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153088777412994","commenter_b":"Dan Bedford Hmm lol","commenter_a":"It was destiny.","post_message":"They've walked down the aisle together twice, but have only been married once."}]
