[{"comment_id":"536114256579154","commenter_b":"the only thing she needs to do is run straight out of this country.....begone.","commenter_a":"I thought Its name was Michael","post_message":"Michelle Obama could be running for president.  This is a joke. She needs to keep her mouth shut.  Do you agree Michelle Obama is a joke?"},{"comment_id":"537545743072047","commenter_b":"Fuck you you damn racist nut!","commenter_a":"Sounds like she just smoked a fat rock. Good job Vice... Keep throwing the crackheads on the top of my news feed. Not sure what I want more this or cat videos...","post_message":"On the Sea Islands along the coasts of South Carolina and Georgia, a painful chapter of American history is playing out again.  Watch our investigation into why Gullah culture is being replaced by waterfront mansions: @webpagelink"},{"comment_id":"10153483892683690","commenter_b":"Hello all indians! U stop nestle then stop modi too for supporting israel. Huh!","commenter_a":"Pay the bribe...","post_message":"The company insists \"Maggi noodles are completely safe and have been trusted in India for over 30 years\"  @webpagelink"},{"comment_id":"545790502236393","commenter_b":"Liberals are NOT PRO ABORTION! WE ARE ANTI RELIGIOUS FANATICS THINKING THEY CAN RULE OUR BODIES! We are also pro families once children are born. We are anti poverty and anti starving and neglected children. We are as los anti ignorance!","commenter_a":"You will Never be president of my country. Nor will you ever dictate what I can or cannot do with my body. You creep.","post_message":"Really? He thinks that alienating 51% of the registered voters in this country is the way to get elected?"},{"comment_id":"1310250435687007","commenter_b":"@username listen bitch you better do your research the final votes were counted today he won popular vote by 699k","commenter_a":"Wow ! Get over it ! Trump won the electoral and popular vote as of today ! If Hillary hadn't been so crooked lies and selling America out to the highest bidder she might have won, but she was caught in way to many back room deals and bad things she should be in prison for treason ! Shame on SNL. To even praise her when the people have spoken !","post_message":"Wow, SNL dropped the comedy and got real."},{"comment_id":"1699094263675768","commenter_b":"Let's review the facts: The shooter was a Muslim. He pledged allegiance to the Islamic State. He targeted people that patronized a gay nightclub in the U.S. Daesh executes homosexuals. Jihadis don't believe in coexistence and they don't spare pacifists. Oh, and you cannot reason with these savages. Questions?","commenter_a":"And Obama and Hillary want to disarm us and bring a hundred thousand of these kind of people over here","post_message":"Breaking News: Police say 50 people were killed and 53 were injured in the Orlando nightclub shooting and are asking the governor to issue a state of emergency.  Fox News can confirm that the gunman is Omar Mateen, 29, of Port St. Lucie County, FL, a US citizen of Afghan origin. @webpagelink"},{"comment_id":"10153301839268854","commenter_b":"Why isn't sharpton in jail for not paying his taxes instead of running around free doing nothing but causing trouble. That is the question.","commenter_a":"Douche bag!","post_message":"Sharpton Calls for Federal Police Laws... 'There must be national policy'..."}]
