[{"comment_id":"1045431208809965","commenter_b":"This is not news worthy.","commenter_a":"Who cares?","post_message":"BREAKING> Beijing wins bid to host 2022 Winter Olympics. China's capital will be first city to host summer & winter games."},{"comment_id":"611841178976490","commenter_b":"Ha.....snake in the grass. Call her out.","commenter_a":"send Hillary to live with the Arabs.","post_message":"FUNDING TERRORISM --- AND THE CLINTONS."},{"comment_id":"1238572816162746","commenter_b":"...aaaaaand to jail this woman will go.","commenter_a":"A real action star. Give him an oscar award!","post_message":"Watch the moment a suspect hit an officer's car with her SUV during a high speed chase. The officer escaped with only minor injuries.  Full story: @webpagelink"},{"comment_id":"10152892004126051","commenter_b":"This sick woman took advantage of boys. This was not age-appropriate activity. Why can't you creeps see the truth in that? The kid who told did the right thing.","commenter_a":"Kids these days,when I was a teenager we dreamed of something like that happening to use but now these little sissy go crying to their mommies. don't figure","post_message":"Police took one look at what this woman did to kids at a bar mitzvah and arrested her as quickly as they could."},{"comment_id":"1267309513345274","commenter_b":"Great comeback! :)","commenter_a":"Ya gotta love the way the Dems embarrass themselves in front of the entire world .... just say'n .. JBeale","post_message":"Allen West Republic"},{"comment_id":"10154284968796336","commenter_b":"Because an orange narcissistic with a fake wig is better","commenter_a":"Because he promises free stuff, and doesn't say he's gonna take your jobs, but you'll lose your wealth if you try and make something of yourself! Both democrats running are a joke!","post_message":"BREAKING NEWS: Fox News projects Bernie Sanders as the winner of the West Virginia Democratic primary."},{"comment_id":"706537696174664","commenter_b":"White trash! Take a bath!","commenter_a":"Omg. Thought we only had one clown in the white house then she showed up. Glad its only for a few days left thank god","post_message":"Happy 53rd birthday to First Lady Michelle Obama! Join us in wishing her well!"}]
