[{"comment_id":"10153396408061130","commenter_b":"Why are these men so obsessed with a uterus? I mean I've never obsessed over a prostate...what is going on?","commenter_a":"The same thing happened to Joe McCarthy. Everyone was all for outing Communists, then they watched him bully people at hearings on the TV and realized what a witch hunt it was.","post_message":"\"This hearing is why everyone hates Washington, D.C.\""},{"comment_id":"1744837412449340","commenter_b":"that depends upon whether they can pass a rigorous background check.","commenter_a":"\"Absolutely!\"😎👍🏽","post_message":"Do you think lawful, gun-owning citizens make America a safer place?"},{"comment_id":"10154338923531955","commenter_b":"We need to send in our military to arrest these traitors in positions of authority who are completely ignoring the rule of law and committing treason in the process! This cannot be allowed To continue. Time for the people to raise our voices!","commenter_a":"Jury Nullification","post_message":"DOJ PROBE SHERIFF JOE..."},{"comment_id":"575919325907618","commenter_b":"She still does this stuff","commenter_a":"I am with hillary Clinton. All the way.","post_message":"Share if you’re ready to make history."},{"comment_id":"10153165284351770","commenter_b":"This woman is so wrong for our country.","commenter_a":"This lady is delusional, don't they do mental checks before putting people in these high ranking positions??","post_message":"Attorney General Loretta Lynch suggested that President Barack Obama could call for Congressional action for increased gun control in the wake of the San Bernardino terrorist attack.  Read more: @webpagelink"},{"comment_id":"10153776592904087","commenter_b":"Socialists always promote Violence. In Europe They promote Muslim Violence by being WEAK!","commenter_a":"Bernie is an enabler for the lazy self entitled youth of this country.","post_message":"\"Party leaders in Nevada...claim that the Sanders campaign has a ‘penchant for violence.' That is nonsense,\" Bernie Sanders said in a statement. \"Our campaign has held giant rallies all across this country, including in high-crime areas, and there have been zero reports of violence.\""},{"comment_id":"1442907392435671","commenter_b":"You guys do know you can get disease from women too, right?","commenter_a":"Women who say bisexual men are better have a 130% greater chance of contracting multiple venereal diseases","post_message":"They're better lovers AND fathers"}]
