[{"comment_id":"10154145894181973","commenter_b":"I sure wish FB had an option to simply unlike a post.","commenter_a":"I have never been prouder to be an Oregonian. THANK YOU, protesters! WE ARE BETTER THAN DONALD TRUMP!!","post_message":"At least 200 protesters marched through downtown Portland and blocked lanes of Interstate 5 early Wednesday to voice their displeasure with Donald Trump's election as the 45th president of the United States."},{"comment_id":"10154417440556729","commenter_b":"Muslim Jihadem Horde!","commenter_a":"And guess which country is going to have to fix things like in WWII?","post_message":"Hello??? Is anybody listening?"},{"comment_id":"1697203373859671","commenter_b":"All dems want is their vote!","commenter_a":"YES. Now Nutsy Pelosi wants to have more programs to \"prop up\" immigrants. How doing something for Americans for a change?","post_message":"Are you ready? It only makes sense!"},{"comment_id":"1257498034286119","commenter_b":"I this this guy is secretly obsessed with pussy lol","commenter_a":"QUESTION: How can you call yourself a patriot and support 33 Benghazi hearings but NOT ONE on whether Russia infiltrated the White House...?","post_message":"Drip. Drip. Drip. Republicans in Congress need to drop the political charade and help us get to the bottom of this."},{"comment_id":"681700478660950","commenter_b":"My life","commenter_a":"@username you","post_message":""},{"comment_id":"1187297661307572","commenter_b":"@username well, fair enough. Lol.","commenter_a":"The comments here have be idiotic, as I expected. Most likely, this was an attack due to their religious identification. I love how when the victim is not Muslim, these (commenters here) jump to radical Islam. However, when a Muslim is the victim, they want to wait for the facts and not jump the gun. Can't have it both ways.","post_message":"Shot in the back."},{"comment_id":"1401167556601539","commenter_b":"Well if you get appendicitis which is a sepsis or a serious infection in your appendix and it can burst you can die so if that's the case and you get appendicitis I would recommend your removing it","commenter_a":"God made humans with an appendix not about to remove it just because scientists have not quite figured out a use for it. Think about it","post_message":"Be grateful if you still have yours."}]
