[{"comment_id":"614711638682250","commenter_b":"So she was stealing from her mother?WTF","commenter_a":"What an idiot...did she say her mom lives there even after he said it was his house?! Also what in the world would her \"niece and nephew\" need from Grainger?? Stop the stupidity people...","post_message":"An attempted package thief who was confronted by a homeowner tried to tell him that her mother lived at the home. The homeowner said he was going to call police, and she dropped the packages and fled. Now the Alhambra Police Department is looking for help identifying her. Read KTLA story here: @webpagelink"},{"comment_id":"10152912093186749","commenter_b":"PUKE.","commenter_a":"PUKE","post_message":"This Valentine's Day, Nicholas and Dylan are finally able to celebrate their legal marriage. This is progress. @webpagelink"},{"comment_id":"857390540965850","commenter_b":"I resent paying for any illegal immigrant through our tax money...It is fundamentally wrong and immoral to take away from the next generation of real Americans.... Obama is evil......how about taking care of our elderly, our Veterans and our AMERICAN children?","commenter_a":"thanks obama","post_message":"This is insane, no rational government would do this, or am I off base on this one?"},{"comment_id":"10153111223750779","commenter_b":"@username You're such an, asshole.","commenter_a":"Donald Trump for President","post_message":"Billionaire celebrity G.O.P. presidential candidate Donald J. Trump will host an upcoming episode of Saturday Night Live."},{"comment_id":"10154567902453812","commenter_b":"Another Illegal Alien Speaks","commenter_a":"He's gonna sue again and ask for emergency federal money again!","post_message":"Texas Gov. Greg Abbott sustained \"extensive second- and third-degree burns\" on both legs and could miss next week's Republican National Convention."},{"comment_id":"1206621306053557","commenter_b":"Truly this HYPOCRITICAL woman with NO MORAL CONSCIENCE and u hope one day she will be in a Federal Lockup w/ The Clinton CRIME FAMILY along w/ OSAMA OBAMA and they'll have time to know GOD...","commenter_a":"Piss off and die, libtard.","post_message":"WOW..."},{"comment_id":"10154985893890629","commenter_b":"@username Now he blamed \"fake news\" again. Only this time it was real \"fake news\".","commenter_a":"Our president is making speeches based on something he says he heard on Fox News? OMG, he has access to 1st hand intelligent briefings and he's getting his information from the news? What in the world is even happening?","post_message":"President Trump said he cited a nonexistent terrorism incident in Sweden as a reason for his travel ban after he saw a segment about immigration in the country on Fox News."}]
