[{"comment_id":"1192472137454872","commenter_b":"they will have to change the toillets in the White House after this thing used them!! Please change the toilets at least for Melania!!","commenter_a":"It shows her manhood lol","post_message":"SHAMEFUL!!"},{"comment_id":"10153811495701316","commenter_b":"God's will & Grace","commenter_a":"Corrine Amin","post_message":"There's a time for everything."},{"comment_id":"563542197162994","commenter_b":"Dear black lady: it's stupid to do either example you gave. Way to drink the cool aid.","commenter_a":"Yesterday in Charlotte (As per Charlotte Police Chief--He's Black)Black man exits car with a gun in his hand, told to drop weapon and refuses....shot by a black police officer. Gun recovered....not a book. Stop the false narrative! Stop the Madness!!","post_message":"At least 12 officers and 5 demonstrators were injured in protests in Charlotte after a black man was shot and killed by police. Video shows protesters destroying a marked police vehicle."},{"comment_id":"10152610219894071","commenter_b":"Gabriel Emilio","commenter_a":"Bates PAPA Creighton","post_message":"They're killing it right now."},{"comment_id":"10153981739504091","commenter_b":"Go stick your head in a latrine!","commenter_a":"What did he know about the Clintons?","post_message":"RIP: The star of reality series Ice Road Truckers on HISTORY was killed in a plane crash while he was planning to film a show about recovering plane wrecks."},{"comment_id":"10154798019399062","commenter_b":"Russia has been the most proactive but we condemn their actions.... lol","commenter_a":"I wonder how long the leaders of the free world are going to tolerate this without taking the fight to ISIS directly and wiping them out! The scumbags need annihilating!","post_message":"BREAKING: Islamic State group claims responsibility for Brussels attacks, Associated Press reports. READ MORE -> @webpagelink"},{"comment_id":"10153467458013984","commenter_b":"Sick of hearing about Bruce and the damn Diggers","commenter_a":"enough of this crap...give it a rest","post_message":"If what Rush Limbaugh says is true, this whole Jenner thing could be just the tip of the iceberg. Scary... Do you think the liberal media has an agenda in pushing the Jenner story?"}]
