[{"comment_id":"10156715004010354","commenter_b":"Lord forbid she have a mind of her own.","commenter_a":"How totally racist is that !","post_message":"The NAACP Image Awards is ________________."},{"comment_id":"10153080407966323","commenter_b":"No but seriously why the hell would a girl shave their face...?","commenter_a":"Um I've shaved my face for like 6 years and had no issues.. hair getting thicker from shaving is a myth.. the reason people think that is because hair tapers to a tip and when you shave that tip off the hair seems thicker.. but its not.. it's just the end of the hair and it has always been that size","post_message":"Is it a terrible idea for women to shave their faces? Yes, yes it is."},{"comment_id":"10156681132085354","commenter_b":"They could have a no-gravity policy, that wouldn't be real either. There are no gun-free zones in Oregon. The end.","commenter_a":"@username lies to low-information conservatives: Umpqua Community College was not a gun-free zone. No college policy overrode state law. There were students present that day with concealed weapons. The right perpetuates this lie because the truth undermines their \"it's always a gun-free zone!!\" narrative. @webpagelink","post_message":"Do YOU live in one of these 8 states? **Is #6 a little surprising?"},{"comment_id":"10153679413971051","commenter_b":"I'd inject that bitch with enough meth to make her OD & die. Eye for an eye","commenter_a":"stupid cunt deserves to spend the rest of her life in jail","post_message":"This woman allowed her little boy to overdose on meth. A jury just decided her fate. Decide for yourselves if justice has been served."},{"comment_id":"10153065626180950","commenter_b":"He's a dayum disgrace. Im sure Subway can't believe this saga.Jared is a sicko that needed mental help yrs ago. He failed to get it & now he pays for his sordid fetish. The inmates will love that ass.. Footlong comin for your ass Jared. Ijs !!!! Karma is a bish :(+","commenter_a":"Hope you bring Vaseline for your new job interview jared.","post_message":"JUST IN: Court hearing for ex-Subway spokesman Jared Fogle ends; he \"expects to go to prison,\" his attorney says: @webpagelink"},{"comment_id":"1226253117412922","commenter_b":"White peoples God George Soros funds these riots !","commenter_a":"If there is any one in the car, it is also attempted murder, and MUST be prosecuted.","post_message":"Nails it!"},{"comment_id":"10156091487575389","commenter_b":"They're socialists, not Americans. They should be deported with the illegals.","commenter_a":"I think they would vote for Hitler if he ran as a democrat. SO many in this country have no concept of reality any more.","post_message":"Question of the Day: Do you think Bernie Sanders can beat Hillary Clinton in Iowa and New Hampshire?"}]
