[{"comment_id":"10154394948753494","commenter_b":"When one door close another will open, smh","commenter_a":"I hate to break it to anyone, but unless you own the company very few people can not show up for work and still have a job. There are plenty of others who need a job, that will step right up and be thankful to have a job.","post_message":"Juvenito Quintana and 20 others missed work February 16th. The following day, they all received a termination letter."},{"comment_id":"10156093588515354","commenter_b":"Not only is she an awful human being but she is hell of ugly too!!!!","commenter_a":"Twitter users: Give a Tweet she will remember. Monica Foy @ monicafoycan","post_message":"***UPDATE***"},{"comment_id":"1326473630726439","commenter_b":"To be successful in today's Republican Party you have to push a potent mix of craziness and meanness.","commenter_a":"The rise of the evangelical politician. The moderate and liberal republicans moved to the Democratic party and the conservative Christian moved to the Republican party. This was all in the 50's-70's there was a great migration because the majority of the Republicans didnt like the move in the direction to conservative ideals so they moved to the Democratic side. So your Democrat is actually your Republicans pre evangelical","post_message":""},{"comment_id":"517994265057820","commenter_b":"she is a pig","commenter_a":"She is an idiot, why does anyone give her the chance to prove it and get her 15seconds of publicity?????","post_message":"Mike Brown's mom just said something infuriating about the two cops who were just shot. This is absolutely disgraceful. No wonder her kid was a thug. Do you agree Mike Brown's mom is totally out of line?"},{"comment_id":"10154683791611002","commenter_b":"Gross. She needs to be locked up and throw away the key","commenter_a":"Lock her up and throw away the key.","post_message":"A 38-year-old Dearborn Heights woman is accused of attempting to arrange a meeting for sex with whom she thought was a man and his underage daughter."},{"comment_id":"10157217624240354","commenter_b":"Send them to the Vatican you have walls keep them there","commenter_a":"Christians are in more danger than Muslims, that is the truth.","post_message":"Still no word on when the Pope plans to tear down that evil Vatican Wall surrounding his fortress and let all the \"migrants\" come flooding in."},{"comment_id":"10156227118445354","commenter_b":"And gays, get ready to be tossed off the highest building available. Who let the muslims here. Get ready fools.","commenter_a":"Prepare , you liberal women better bend over and shut your fucking mouth. This is what you asked for.","post_message":"Green light GO!"}]
