[{"comment_id":"10154716032249714","commenter_b":"Triggered a feminist. Didn't take long. What benefits will hillary do for you? Decrease tax rates hah funny. Zoe you sound little butt hurt you might need to see proctologist.","commenter_a":"Woah Woah Woah More Democratic Propaganda. Time to settle down @username.","post_message":"\"The first time I doubted my looks and worth was in kindergarten.\""},{"comment_id":"527065960815030","commenter_b":"Her loss Tim!","commenter_a":"May God bless Tim Tebow you don't need her keep the faith God has a special woman for you","post_message":"God Bless Tim Tebow"},{"comment_id":"236462700148781","commenter_b":"I heard he won by a lot and everyone is happy. Next please","commenter_a":"Dagmar! Free Press just means that they can't be censored or jailed! He doesn't have to speak to the press! No ....NO VIOLATION OF THE 1ST!!","post_message":"Join us as President Donald J. Trump delivers the Weekly Address."},{"comment_id":"10152876671446336","commenter_b":"Lol really woman. I think its sweet","commenter_a":"Davetra Fleary","post_message":"Twenty years ago, Brittney Husbyn and Briggs Fussy walked down the aisle as flower girl and ring bearer at a wedding. Saturday, they did it again… only this time as bride and groom."},{"comment_id":"10153739431762235","commenter_b":"Maybe if more men were any good in bed the women might enjoy it. 90% of men are terrible in bed. Stop putting it on women.","commenter_a":"Horrifying","post_message":"There's so much wrong with this, I don't know where to start ..."},{"comment_id":"894618207261542","commenter_b":"yes i reject it and this ass too","commenter_a":"YES.","post_message":"Where do you stand? Vote here and make your voice heard."},{"comment_id":"1203394389723827","commenter_b":"We need to run over them with a truck. They will move.","commenter_a":"I don't think protestors should block any roads or destroy any property. Its says a peaceful assembly, not blocking roads, jumping and climbing on trucks and trashing others property or businesses. If they can't assembly peacefully then they need to be arrested.","post_message":""}]
