[{"comment_id":"10156383221255354","commenter_b":"I can face God and not fear my fate if all muslims are eradicated from the earth. This is only the first of many attacks and I feel not a single muslim can be trusted. Call it racism, call it profiling or plain ol fashion hatred but they all are the enemy to the rest of us and their death is our only option.","commenter_a":"War involves two sides! Until we realize the Muslims are at war with us, we will continue to lose!","post_message":"\"This is war.\""},{"comment_id":"10153110239287093","commenter_b":"It should be removed","commenter_a":"Wow anyone that wears this is a sorry person. I fully support our men and women in Blue. I think the teacher made a great call . Better safe than sorry . I expert even looked at the \"clock\" and said it is a count down read about it. Also who makes a clock these days that looks like it would be a bomb.","post_message":"It was only a matter of time!! If you wear this costume to school, be careful who you show it to. @webpagelink"},{"comment_id":"1194058434020542","commenter_b":"Coulda, woulda, probably shoulda.","commenter_a":"Thank you, Bernie Sanders for finally bringing unity to the Democratic Party!","post_message":"This moved us to tears... what a moment!"},{"comment_id":"10154561841344203","commenter_b":"What a dumb bitch.","commenter_a":"😷","post_message":" worship for him is like the people of North Korea worship their Dear Leaderblind loyalty.\" Ann Coulter"},{"comment_id":"10154927875454174","commenter_b":"Build that wall","commenter_a":"Protesters now these days are who are dividing the races","post_message":"Protests are happening in cities across the U.S. once again while President Trump is reacting to the judicial order stopping his policy @webpagelink"},{"comment_id":"10154473671751234","commenter_b":"Take the names of all the restaurants employing illegal aliens, seize the records, heavily fine the businesses, and deport the illegals. Give the jobs to Americans- rumor has it, employment for AMERICANS is still suffering. And if you're an American who needs a job, but won't take one, no entitlements for you. There. I said it. Call it common sense.","commenter_a":"What are the party affiliations of the owners and bosses of @username?","post_message":"Some New Jersey restaurants are preparing for a strike on Thursday."},{"comment_id":"1337743466286160","commenter_b":"How about we deplorables boycott all of you talentless walking DUMB LIBTURDS!!!","commenter_a":"These slobs have sold their souls years ago on the casting couch of Hollywood! What do they know about the struggle of the everyday @username! Go back to your fantasy world of make believe, most people live in the REAL world!","post_message":"Hollywood Hail Mary: See who's begging the Electoral College to vote against Donald J. Trump."}]
