[{"comment_id":"1261955857213973","commenter_b":"Sounds good....illegal alien it is.","commenter_a":"It's illegal alien. As in not from this country. An immigrant is one who has applied for entry into this country legally before they left their home port/border.","post_message":"USC Professor Warns Students, Don’t Use Term “Illegal Immigrant” On Final"},{"comment_id":"10155021638815859","commenter_b":"And dress like a woman","commenter_a":"Of course Trump fails to mention that there really is NO WAY to call the white house and expect to actually get through to anyone.","post_message":"Pres. Donald J. Trump: 'I haven't had one call' complaining about Dakota Access Pipeline. \"I don't even think it was controversial.\" @webpagelink"},{"comment_id":"1757186537848800","commenter_b":"BECAUSE SHE IS CROOKED","commenter_a":"Trump for president!","post_message":"\"When you look at the record, and when you look at what [Hillary Clinton's] actually done, when you look at Benghazi, when you look at all the instances over the last multiple decades… I think it fits.\" Donald Trump Jr. reacted to his father’s new nickname for the Democratic presidential candidate — \"Crooked Hillary.\""},{"comment_id":"10153092364080779","commenter_b":"how about enforcing the laws.....dumb bitch.....","commenter_a":"If I hear gun control one more time... I couldn't feel worse for the families that lost loved ones today, but laws are NOT going to keep law abiding citizens safe from criminals, the mentally ill or those that intend on dying in a blaze of glory.","post_message":"Calling America's epidemic of gun violence \"a political choice we make\" and declaring of the nation's political class, \"we, collectively, are answerable to those families who lose their loved ones because of our inaction,\" President Barack Obama delivered one of the rawest speeches of his presidency today in response to the Umpqua Community College shooting rampage. Read it below."},{"comment_id":"1397496900343360","commenter_b":"\"I support the racist abortion of millions of black and latino children\", that all I see when I see anyone saying the support Planned Parenthood. Sounds like something close to what Hitler did... eugenics, anyone? Margret Sanger? Big fan of Hitler? Come on, it can't be a coincidence that blacks are encouraged by white PP employees to abort their babies, right? #StopRacistPP #ShutItDown #UGetMoreBensWitKids","commenter_a":"Or took their VIAGRA away. Bet we'd get some action then.","post_message":""},{"comment_id":"1907053972848209","commenter_b":"THROW THIS BITCH OUT OF THE COUNTRY. PLEASE","commenter_a":"not my president","post_message":"She isn't backing down."},{"comment_id":"10155300892045354","commenter_b":"Pompous ass!!!","commenter_a":"the blank is \"Delta Sierra\"","post_message":"Watch this incredible video and then fill in the blank: \"John Kerry is a _________.\""}]
