[{"comment_id":"10153844148480579","commenter_b":"Only when they try to use it as the basis of their platform or legislation. Then it is a big negative.","commenter_a":"Media Silent As Muslims Ethnically Cleanse 60,000 Christians In Philippines By: Daniel Greenfield When thousands of Muslims become refugees, then you can’t get the media to shut up about it for weeks. Thousands of Muslim migrants... jewsnews.co.il","post_message":"Do you consider religion when evaluating a candidate?"},{"comment_id":"1298794080158825","commenter_b":"OK. Sacrifice your two daughters first....and we will all follow suit (he is a big asshole)","commenter_a":"Obama's a damn clown","post_message":"More evidence that this president believes in sacrificing military readiness on the altar of social engineering."},{"comment_id":"588380568016902","commenter_b":"NO, they just want to shove another \"change\" down our throats!!! I am so sick of this. We don't have the money to make such a change. If anything put her on something else but DO NOT MAKE CHANGES!!!!! Do you Dems think money grows on trees?? I am not paying for nor will I ever use a $20.00 again if this is done!!!","commenter_a":"So who made this decision?","post_message":"OH HAPPY DAY!"},{"comment_id":"10153389055716770","commenter_b":"Wow is she stupid or what. Racist pig.","commenter_a":"Sure we can play with a bad bad boy and you will get bad results","post_message":"A CNN guest argued that her ex-CIA panel-mate was unqualified to talk about ISIS because he's white."},{"comment_id":"10154979163784712","commenter_b":"@username she has given no reason for anyone to respect her. She is disrespectful, offensive and rude.","commenter_a":"Ugh .... for fucks sake ... \" the tax payers are funding this \" you fucking idiots!! He is gutting federal funding from science to build this stupid fucking wall ... p.s most illegal aliens are here from over stayed visas ! From countries they took planes from ! Besides don't you watch international news ? Cartels use tunnels now to bring in drugs you fucking dummies !","post_message":"Trump will sign executive orders enabling construction of a border wall and targeting sanctuary cities."},{"comment_id":"1870076373211219","commenter_b":"My first thought was to wonder where the women are.","commenter_a":"One small detail though. Local women are not even allowed to even try to approach the beach without their burkas and totally covered. OUTRAGEOUSLY INHUMANE TREATMENT OF WOMAN.","post_message":"Put us on the next plane to Dubai."},{"comment_id":"10154831608750211","commenter_b":"Selfish whiner","commenter_a":"What a crock of crap. Just trying to get some attention and get noticed as someone \"special\". Whatever......his loss.","post_message":" don feel accepted in the White House. With the president having so many strong opinions and prejudices I believe certain people might feel accepted there while others won."}]
