[{"comment_id":"10158409138265725","commenter_b":"Now we know why she's bitter and single","commenter_a":"I can't believe she told that woman that her husband was cheating on her!!!! For her to go home","post_message":"Re-watch the video that started it all: @webpagelink"},{"comment_id":"10152813699938145","commenter_b":"R u ok, smiling with a chainsaw in your hand.","commenter_a":"I know this guy. He's out of his mind","post_message":"Daytona Beach police are hoping you share this picture. They're looking for Allen Phillip Fike. They say he may be armed with an AK-47 and has threatened to kill officers if they approach. Fike is wanted on several outstanding warrants. He could be driving a white Toyota Camry."},{"comment_id":"1048961388493889","commenter_b":"@username and what do you mean by Americans pay for illegals not you I am an American last I checked","commenter_a":"I don't know what your being told but Obama has more people deported than any other president. ...I see it constantly in the Hispanic news channels","post_message":"CIS found that criminal prosecutions for immigration offenses have dropped 36% over the last five years and due to sanctuary cities policies, the detention of illegal aliens in jails is down by two-thirds."},{"comment_id":"10153120507763984","commenter_b":"Quit giving our tax dollars to all the lazy and illegal people, bring industry back from China .","commenter_a":"This is exactly what I've been talking about. They want to raise the gas tax, they want to introduce a milage tax. Who will this hurt the most? The pood and middle class. The Democrats don't care about the poor and middle class, they view them as cannon fodder. And uninformed people keep voting for them.","post_message":"The Obama administration and this Dem like the idea of using taxpayer dollars to study... new ways to tax people. Do you think the idea of this new tax is absurd?"},{"comment_id":"10155182239718984","commenter_b":"Go to hell BITCH","commenter_a":"Let the criminals out. Let illegals in. Let boys in the girls bathrooms. Condemn police officers. Persecute Christians. Don't care about the veterans. Pervert the children. Kill the unborn. Stomp on and burn the American flag. Accept barbarity in the name of Islam. Protect the Sanctuary cities. Cuddle the lazy. Encourage hate crimes. Destroy properties. That's the liberal way!","post_message":"Nancy Pelosi just dropped a lot of jaws with what she had to say about impeachment. Donald Trump will definitely want to hear about this..."},{"comment_id":"10154999301374411","commenter_b":"@username Fck off white trash","commenter_a":"Good. Cheats shouldn't prosper.","post_message":""},{"comment_id":"10154278163336509","commenter_b":"The Bush war, $7 trillion and counting!!! (Before) Good Schools and Good Incomes! (Now) Poverty, Guns, Incarcerations! $$ facebook doesn't want you to see this $$ As long as America's richest 1%, who now possess 70% of the wealth and don't bother to vote, have the Senators in their pockets the United States Government isn't representing the will of the people, it's the 1% that's running the show. I stand with Bernie Sanders, \"We're governed by an Oligarchy.\" The number of Americans living in poverty will continue to grow while the middle class will continue to shrink and working women will continue to enrich the wealthiest 1% for the next 20 years easily! (Able to afford the best and brightest, Hillary is a great political actor with a well rehearsed script.) She WILL make another Fortune!","commenter_a":"His plan is take more money from the successful and give it to people like freddie gray's neighbors......makes perfect sense.....","post_message":"Bernie Sanders seemed appalled by the conditions as he toured sites of unrest following the death of #FreddieGray. \"Anyone who took the walk that we took around this neighborhood would not think you are in a wealthy nation.\""}]
