[{"comment_id":"1136350429757739","commenter_b":"She needs to excuse herself from this case.. this is a total conflict of interest!!","commenter_a":"Crooked ass administration...don't force us \"We The People \" have had enough","post_message":"What the WHAT?! This cannot stand."},{"comment_id":"484366015087312","commenter_b":"They are all racist. They all hate white people. Yet they couldn't live without white people. Infact if it wasnt for white americans they would still be enslaved around the world. This country didnt start slavery, it was white americans that put an end to slavery around the world. its all they have is the slave thing without it they would have to evolve or take responsibly for thier inability to evolve .","commenter_a":"Why can't President Obama be impeached?","post_message":"National controversy after Juan Williams says something shocking. Juan is racist, plain and simple. Do you think FOX should fire Juan Williams?"},{"comment_id":"1061923367225138","commenter_b":"Shes a rino like glenn.. no one cares..","commenter_a":"Good riddance, campaign for the liar Hillary.","post_message":"“This is not a decision I make lightly, for I am a lifelong Republican.”"},{"comment_id":"10153077388711051","commenter_b":"What she can't read? So they don't like what your wearing take your business elsewhere duh but what she is wearing I see nothing wrong with she has more close on then most. The owner is an ass","commenter_a":"Seafood Nazi.","post_message":"When this woman was told that she was being kicked out of a store for her 'inappropriate' outfit, she thought it was a joke. Nope."},{"comment_id":"1392423634112580","commenter_b":"MESSAGE TO DONALD TRUMP AND TO THOSE WHO VOTED FOR: THE DEVIL IS AT HOME. EVERYONE MUST PROTECT HIS RIGHT BY LAW. MAKES YOU QUESTION WHY MADE THIS MILLONARY HUMAN BEING MADE OF FINITO DUST? THANK YOU TO THESE COUNTRIES. IN INDIA HAS 16 BUSINESSES, ARAB EMIRATES 13, CANADA 12, CHINA 9, INDONESIA 8, PANAMA 8, SAUDI ARABIA 8, SCOTLAND 7, AZERBAIYAN 5, BRASIL 4, IRELAND 4, ISRAEL 4, CATAR 4, FRENCH ANTILLES 2, SOUTH AFRICA 2, TURKEY 2 URUGUAY 2, BERMUDA ISLANDS 2. AND CASINO IS ONLY YOUR MASK. HOW EASY IS TOMB TO THE GOLIAT. AND IF IT CONDEMNS CUBA? EVERYONE CONDEMNS THEM; UNTIL WHERE THIS DONALD HITLER ADOLF TRUMP DICTATOR HAS ARRIVED. THE CURRENT MOMENT IS OF ABRUMING INTEREST FOR ALL REPUBLICANISMS THAT OCCUPY POSITIONS OF CONFIDENCE, THE REPUBLICANISMS HAVE CHOSEN THE MOST VIOLENT MAN WHO HAD ALREADY HAD SINCE THE FOUNDATION OF THE UNITED STATES OF ...","commenter_a":"So what happens now?? Castro brother takes over???same crap or the people change this?","post_message":"\"Everybody's been partying, basically, all night long.\" Earlier this morning on \"FOX & Friends Weekend,\" Phil Keating gave us a look at the pre-dawn celebrations occurring in Miami, Florida, in response to Fidel Castro's death. @webpagelink"},{"comment_id":"1495136007456674","commenter_b":"Just every woman with a family huh? Men with a family don't do more too?","commenter_a":"You all don't know what hard work is. Every woman that has a family does more than fast food workers, and fireman definitely do much more than fast food workers!!!","post_message":"\"Some people say paramedics don't even get $15 an hour and they save lives. So why should fast food workers get that?\" That question comes up a lot when we cover #FightFor15 rallies, like this one in Detroit. But Fox2's Roop Raj is having to defend himself just for asking it. Watch his whole report here and see what you think: @webpagelink"},{"comment_id":"10153969486484255","commenter_b":"Warren was among female Democratic senators who asked Hillary to run for 2016.","commenter_a":"When I think of Elizabeth Warren, I think honesty and integrity-that is why I can Only see her with Bernie Sanders-this is the Lady I envision as our first female POTUS!! Thank You Senator","post_message":"A beautiful smackdown. From Daily Kos user Lady Libertine"}]
