[{"comment_id":"1129043100469880","commenter_b":"There is a woman out there thirsting for this man","commenter_a":"@username LOL","post_message":"He wants to be \"the complete father,\" and he's doing it one braid at a time. A video by Jess Blank."},{"comment_id":"10153181309551350","commenter_b":"Sebrina Butler cute comments here. Marcella McFadden","commenter_a":"Breast feed, breast feed! Just do it! It's best for the baby's immune system.","post_message":"What do you wish you'd known before you had your baby? Read the top responses so far and join our new TODAY Parenting Team, sponsored by Johnson's Baby, to share your advice. @webpagelink"},{"comment_id":"935434433239352","commenter_b":"She sure don't know how to talk right lol. She should be mad she left the house looking half ass dressed. Look like she rolled outta bed and didn't bother to fix her face or hair.","commenter_a":"I tell you this ...you come to this neck of the woods and that bitch would be laid out lol ...and to all them punk ass people who didn't speak up are as much of a pussy bitch made ass punk who probably have kids the same as them ...people need to stfu and let people be ! .... The bitch talking aint perfect either so who is she to talk ! ...bitch ....sit down no one is god and cant judge ...so stop judging !","post_message":"This is the harsh reality so many trans people face every single day. #MicBrights"},{"comment_id":"10153177294431336","commenter_b":"How can a female win the MENS race? Read much?","commenter_a":"That's a female???","post_message":"JUST IN: Lelisa Desisa has won the men's race at The Boston Marathon in an unofficial time of 2 hours, 9 minutes, 17 seconds. It's the second victory for the Ethiopian, who won the marathon in 2013 just hours before the attacks. @webpagelink"},{"comment_id":"10153899191016770","commenter_b":"another nasty women I guess..","commenter_a":"Real smart people those LDS folks, sarc. Seriously,when the Supreme Court turns liberal full progressive, your little LDS church will be doing homosexual marriages, allowing non Christians to come to your places of worship, oh, I can't imagine the world of hurt the LDS is in for. Oh well, principles and all. Good for you, bless your heart, y'all just so pure as the wind driven snow.","post_message":"Latest Poll: This Conservative State Now Has Trump In Second Place. Wait. What? @webpagelink"},{"comment_id":"10154512685084411","commenter_b":"No copy paste","commenter_a":"copy paste. This is what you do ? Be creative guys.","post_message":"The Big Mac is dead, long live the DonMac!"},{"comment_id":"1109934812394016","commenter_b":"ah so cute. huma and hillary both have repeatedly philandering husbands.","commenter_a":"when your wife's in bed with the democratic presidential candidate and your home watching the children you have to do something ?????","post_message":"ANTHONY WEINER CAUGHT AGAIN: Sends Kinky Shot To Brunette With 4-Year Old Son Next To Him Get out the eye bleach..."}]
