[{"comment_id":"1678080125806065","commenter_b":"THE ONLY GOOD FILTHY MUSLIM IS A DEAD ONE.........KILL ALL THE BARBARIC BASTARDS........KEEP THEM OUT OF THE UNITED STATES....THERE IS NO PLACE IN THE WESTERN WORLD FOR SUCH 3RD. WORLD SCUMBAG BASTARDS LIKE THEY ARE.......GOD BLESS HIM AND HER FAMILIES......ODUMMER IS TO BLAME FOR THE RAPES AND KILLINGS HIS BARBARIC BROTHERS ARE DOING.....HE HAS COMMENTED MURDER FROM LETTING THOSE BASTARDS INTO \"OUR\" COUNTRY.....ODUMMER IS TO BLAME FOR ALL THE RAPES AND KILLINGS THOSE MUSLIMS ARE DOING............HE SHOULD BE BROUGHT UP FOR TREASON AND MURDER JUST LIKE KILLARY.........","commenter_a":"Oh yeah, we need to b ring them all here with their religion of love!!!!When is our government going to wake up and smell the coffee????","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack  This is tragic. His died with honor, let's send our prayers for his family.  Can we get 100,000 'LIKES' for him and his family?"},{"comment_id":"847817905266758","commenter_b":"You people are a bunch of whack jobs!","commenter_a":"Any kind of animal","post_message":"AWFUL: A family who routinely fed a mother duck and her 11 ducklings said they watched in horror as a landscaper intentionally mowed them down:"},{"comment_id":"987118551371296","commenter_b":"These women did it LEGALLY.","commenter_a":"There's a difference between illegal immigrants and legal immigrants.","post_message":"Trump's ex-wife agrees with his immigration policies... even though she's an immigrant."},{"comment_id":"10153039611668984","commenter_b":"Shoot this prick and his offspring","commenter_a":"I support the 25 congressmen that voted against you! And ALL YOU DID WAS PROVE THEM RIGHT MR! JOHN HUSSEIN BOEHNER! YOUR A VINDICTIVE DISGRACEFUL representative!","post_message":"John Boehner may have just sunk to a new low with this move. This is the type of thing I would expect from a 3rd grader, not a supposed leader like Boehner.  Do you support the Republicans who stood against John Boehner?"},{"comment_id":"1172312176140350","commenter_b":"BUILD THAT WALL!!!! BUILD THAT WALL!!!!","commenter_a":"Lol","post_message":"EXACTLY!"},{"comment_id":"10154298865889099","commenter_b":"Smh","commenter_a":"Jessica Milla","post_message":"\"Her ribs are broken. He beat her ribs and breast saying her milk was useless and she was worthless,\" the woman's mother said. \"He tried to blind her so she couldn't see her baby, he tried to make her deaf so she couldn't hear him crying for her.\" WARNING: Some may find the images in this story disturbing. @webpagelink"},{"comment_id":"10153110515583984","commenter_b":"I've seen out of work lesbian truck drivers. Moore looks MUCH worse.","commenter_a":"Is that Michael Moore in a Debbie Wasserman Schultz wig???","post_message":"I can't believe this radical feminist liberal would so gleefully mock and lie about a distinguished female veteran like this.  Do you support the Republican senator this woman belittled?"}]
