[{"comment_id":"10152743678847434","commenter_b":"Danielle D'Andrea This bitch is my hero","commenter_a":"@username lolololol save above the knee","post_message":"\"I didn’t lose my two front teeth until I was in 5th grade, which is late. And that very same week, I got my period. Which is early. So I was just this jack-o-lantern with tits walking around, and I had one of those moms that was like, ‘You don’t need to shave above your knees.’\" - Amy Schumer"},{"comment_id":"10150815152779999","commenter_b":"Hahah Welcome to the team","commenter_a":"@username :P","post_message":"Hold the Door. Hold the Door. Hold the Door. Hold the Door. (Hold off on reading this recap until you've watched the most recent episode of \"Game of Thrones.\")"},{"comment_id":"1195133713860336","commenter_b":"AND WE ARE OFFENDED BY ANYTHING MUSLIM. FEEL OFFENDED, GO HOME!","commenter_a":"Muslims are transgender too. They need a ladies room too.","post_message":"Patriots are pissed over this post. 'LIKE' and 'SHARE' this if you think they should shut the hell up. @webpagelink"},{"comment_id":"10153316136926438","commenter_b":"... and so what if polygamy is \"legalized\" (lots of states already look the other way anyway) who would it hurt ?","commenter_a":"Yay polygamy.","post_message":"This was his best argument???"},{"comment_id":"699044636944748","commenter_b":"But will he be deported!","commenter_a":"Kill them all!","post_message":"HORROR IN MINNEAPOLIS! Somali Refugee in U.S. for Only 3 Months RAPES American Woman! This is what OBAMA has done to our cities! He imported this Muslim rapist!! TRUMP WAS RIGHT!"},{"comment_id":"875538442502852","commenter_b":"Absolutely, illegal is illegal and alien is alien!!!!!","commenter_a":"There is no reason they can't do that legally","post_message":"Don't you agree this is ridiculous?"},{"comment_id":"1080347691985409","commenter_b":"Exactly","commenter_a":"Frankly, no matter whether the women went back to him--maybe they were screwed up emotionally at that time too--he assaulted them. It's the 21st century. Stop trying to drag women through the mud for reporting it. Choking is assault, n'est pas?!","post_message":"\"Nobody close to Jian even pretends he is innocent, and somehow this isn't an issue the women are.\""}]
