[{"comment_id":"1195188837159645","commenter_b":"Hahaha that bitch pussy on all types of fire😂😂😂","commenter_a":"Shanira","post_message":"Oh my "},{"comment_id":"683007381889840","commenter_b":"Shut, your, cunt .","commenter_a":"She has no right to be called a first lady any more than her husband has a right to be called a president!!","post_message":"The White House is trying to cover this up as quick as possible. This comes as no surprise. She is the worst first lady ever. Are you disgusted by Michelle Obama?"},{"comment_id":"10153716806409749","commenter_b":"What's wrong with a black lady ?","commenter_a":"Wasn't the judge a black lady???!!!","post_message":"\"There will probably be a book. It will talk of his love for Reeva. And the awful feelings of loss and guilt, that will stay with him forever.\""},{"comment_id":"1227002650653096","commenter_b":"The LATIN EMPIRE AWAKENS! They realize that Republicans will get them into American class warfare!","commenter_a":"Latino Republicans? Does such an animal exist?","post_message":"Latino Republicans are mounting a pushback against the more conservative wing of their party."},{"comment_id":"765284786938035","commenter_b":"real women respect themselves enough to not get knocked up and then run from responsibility.","commenter_a":"The Colorado shooter's neighbors have been interviewed and his shack has been visited. Turns out he was...drumroll please...AN OBAMA-LOATHING PRO LIFE CHRISTIAN! Now who could've possibly seen that coming? The propaganda videos led the terrorist to carry out his deed. Sound familiar something going down a tad east of here?","post_message":"What a sleaze ball."},{"comment_id":"10155005314954062","commenter_b":"@username Gale Adams @username @username Christina Marie 👀😒😔","commenter_a":"Justin Irwin","post_message":"Please be careful to all of our friends in the Conroe area. This was shared by Heather Dungan from Conroe 105 and I45 near Home Depot.  If you encounter high water, turn around. @webpagelink"},{"comment_id":"10152629894111519","commenter_b":"It is my business when you try to regulate contraception based on a book of myths, try to keep kids from learning factual science based off a book of myths, and try to keep people from marrying there loved ones based on a book of myths. Keep religion but don't ask for tax's breaks, don't try to teach kids pseudo science and don't knock on my door asking me to believe. A free country is where people can get elected even if they don't believe, a free country is where any two consenting adults can marry, and women can choose what they do with their bodies. This is not a perfect union, yet but well keep pushing forward while you try to stop rational thinking.","commenter_a":"Turning people against their own beliefs in an attempt to get them to believe yours. This is what you accuse religions of doing. Hypocrite much?","post_message":"Bill Maher makes a compelling case for secularism..."}]
