[{"comment_id":"479435838921955","commenter_b":"@username not very lady like !","commenter_a":"President trump all the way people power God bless Donald trump","post_message":"For many, the look on Chris Christie's face said it all during Donald J. Trump's #SuperTuesday event."},{"comment_id":"1019874124772308","commenter_b":"Not just Islam but all religions. Ban religions not humans","commenter_a":"Yes it is, and we need to remember what the Spanish Catholics did to the Native Americans, and what the \"Christian\" Protestands did to the \"Christian\" Quakers. Religion is not the issue here. It's hostility.","post_message":"Trump supporters should remember our OWN history before they foolishly suggest we should ban all Muslims from entering the country. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153918892062629","commenter_b":"Nah. We love Israel more than any state as far as funding goes. A Jewish president is more likely than an atheist.","commenter_a":"What the actual fuck?? \"Whites quit being racist long ago\"?? Surely this is satire and I've missed the humor. And it's not just about blacks. If we get a Jewish president, wait until the real pitchforks come out","post_message":"Whites, who are not racist, are ready to commit genocide if that is what it takes to stop black people from being racist."},{"comment_id":"10154067213591770","commenter_b":"@username take out Ca and she lost that too illegals told ok to vote by Oblamo","commenter_a":"I'm so fed up with hearing about the \"popular vote\". Our constitution was NOT set up that way, so please stop talking about it. IT DOESN\"T MATTER. Let me break it down for the simpletons. Suppose you live in a homeowners association. If there is an issue, each home has 1 vote, decision is made fairly. However, if it was a \"popular vote\", then each resident would have a say. If you lived by yourself, you'd possibly be outvoted by your neighbors who had a houseful of 5 people, everytime there was a vote. Which would you prefer? That's how our republic is set up: each state has a FAIR vote in electing the president. Forget the popular vote, unless we change the constitution.","post_message":"Liberals did not like what Ann Coulter tweeted."},{"comment_id":"1531453513826452","commenter_b":"Yep, Asian Men are Sexy!!","commenter_a":"Don't feel bad Asians .. Black people either play a criminal or a slave majority of the time .. And/or there's only one black character in the entire film or show lol ..","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"10153425885744255","commenter_b":"Look, bozo, I suggested 68. It's 66 now. That's two years, not nine. That's my answer. Thanks for the cute little story, though.","commenter_a":"Social security was developed when people rarely lived to be 65. It's stupid to keep it at 65 in this day and age. Bernie is a fool.","post_message":"Damn straight. By Daily Kos user Tool"},{"comment_id":"965004330186413","commenter_b":"@username you are indeed a stupid bitch.","commenter_a":"Yes letting out a shit ton of animals out into an environment where they will overpopulate and have to be hunted anyway. Great job fanatics. I'm not at all pro fur, but true activists don't do those things.","post_message":"Seen 'em?"}]
