[{"comment_id":"10152965778679641","commenter_b":"Nigeria should not only recall her ambassador but,should ask all indonesians to leave within 7days. Including \"INDOMIE NOODLES\" A Nigerians should stop patrpnizing INDOMIE NOODLES and anything associated with Indonesia","commenter_a":"I guess you better think twice before messing with illegal drugs in Indonesia.","post_message":"Indonesia executes six people, including five foreign nationals, by firing squad; Brazil and the Netherlands recall their ambassadors in response. @webpagelink"},{"comment_id":"10153963833427212","commenter_b":"She hit him too.. He should have walked away, but she is not innocent....","commenter_a":"I will never condone a woman's bad behavior however I will not condone a man laying hands on a woman. I believe in self protection but, I don't blame her for wanting to block this and I do blame him for his assault on her. He apologized and they delayed it long enough that the statue of limitations applied so why people will always defend a man and an athlete just because they are is quite pathetic. Women are always scapegoated to be the reason they got hit or assaulted and worse of all by women!","post_message":"ICYMI: Amelia Molitor, the woman OU running back Joe Mixon punched two years ago, filed a new motion to block the release of the assault video on Thursday. #News9"},{"comment_id":"1574139022896040","commenter_b":"Put this animal to death!","commenter_a":"Yeah, good luck with that.","post_message":"The Attorney General is required by ethics regulations to avoid even the \"appearance\" of a conflict of interest. She has clearly violated this regulation. SIGN THE PETITION to join us in demanding her resignation."},{"comment_id":"427873120742228","commenter_b":"hiliary could disapear forever and I reilly do not think she would be missed.Bill would be happy .The country would be a lot safer .Not to mention all those people who overheard something her loud mouth said would not have to die.A lot of people have died in her wake.EVIL EVIL EVIL WOMAN if thats what you want to call her.","commenter_a":"F#!#hillary","post_message":"Donald J. Trump has demanded Hillary Clinton apologize for making claims about him and ISIS propaganda that turned out to be false. Hillary's campaign just responded without holding anything back... Do you support Trump over Hillary?"},{"comment_id":"10153356571252093","commenter_b":"Pretty sure I could peel an orange by age 6. (Or if they just CAN'T, that's what mothers are for!","commenter_a":"That people are so lazy they'd pay for a peeled orange is discouraging.","post_message":"If only nature had a way to cover and protect these oranges.... @webpagelink"},{"comment_id":"667865053404073","commenter_b":"No! She's a witch and that's her night out!","commenter_a":"She's a joke!!","post_message":"Michelle Obama wants to destroy Halloween for kids across America. There is no chance that we will let her take Halloween away from our kids. Do you think Michelle Obama is a joke?"},{"comment_id":"1008549135942537","commenter_b":"Stupid..and when it doesn't work do they turn in their brooms?","commenter_a":"Pray for our president every day!","post_message":"Witches Plan To Cast A ‘Binding Spell’ On Trump And His Supporters Every Month During The Crescent Moon @webpagelink"}]
