[{"comment_id":"931634046893125","commenter_b":"Because she is vermin....","commenter_a":"Why are there so many Hillary hating Trolls on here?","post_message":"\"We can’t hide from hard truths about race and justice. We have to name them and own them and change them.\"—Hillary"},{"comment_id":"956149327758873","commenter_b":"Hit it girl","commenter_a":"Indeed I do agree and it's another reason why I dislike them.","post_message":"Veterans have had it with Republicans using them as political props, while screwing them every chance they get. Do you agree with this veteran's take?"},{"comment_id":"10150722681504999","commenter_b":"@username It seems to me that you are the uneducated one, very stupid also!","commenter_a":"Bringing a knife to a gunfight, no sane individual would attack a police station full of armed police with a knife. Religion really plays no part in this. Surely the man needed mental health treatment?","post_message":"Officers fatally shot a man who was wielding a knife and yelling “Allahu akbar” as he tried to attack a police station in Paris on Thursday."},{"comment_id":"1174568802605235","commenter_b":"They are not Isis,just Philly scumbags ,perpetrating a fraud. shoot them violent criminals have no place on our planet","commenter_a":"We are at war people. It's gonna be us or them, I'm stocking up, bigtime.","post_message":"In Philly,  this group of MUSLIM thugs ATTACK patrons and yell \"We Belong To ISIS\"  Obama has imported over 1 million muslims since he became president... 'FUNDAMENTALLY TRANSFORMING AMERICA!'  Let's GET 5000 SHARES if we should BAN Muslim Immigration!"},{"comment_id":"1158142194215832","commenter_b":"aw poor huntsman","commenter_a":"Sergio Andrade Sergio Andrade Vergara Gisella Casillas","post_message":"A good reason to always flush the toilet.  Barry Morrissey captured video of a Huntsman spider hiding in a toilet bowl in Australia.  The video has been viewed more than 30-million times around the world."},{"comment_id":"10153032098202483","commenter_b":"The same move is taught in the military to subdue someone not to injure them.","commenter_a":"The officer gave him an order it was not obeyed. Act first and ask questions later. If you wait to see if he has a weapon you end up shot.","post_message":"Have you seen the entire video?  Do you think it should be shown in court?"},{"comment_id":"1076789345700753","commenter_b":"Put a bullet in his face. Is she was my daughter or sister, that's exactly what would happen","commenter_a":"ugly pig!!!!!!","post_message":"HATE CRIME! Swept under the rug because she's white and they were black lives matter thugs.  ARE YOU SICK OF THE DOUBLE STANDARD?"}]
