[{"comment_id":"1353532451354276","commenter_b":"Said the blond headed, blue-eyed white woman.","commenter_a":"I am so sorry if this happens, your fear, only because your skin is darker than mine. But I kinda think all of this has happened to white skinned people as well. If we could all walk argh nd inside out we would see assholes right up and recognise good when we see it. Its not about race for everyone. Some of us see us all as people!!!","post_message":"This man shares his haunting testimony: He too is afraid of being killed by the police. (via KevOnStage)"},{"comment_id":"1603960996557680","commenter_b":"Deport her","commenter_a":"Racist pig!","post_message":"Ridiculous...  Take Oprah Winfrey off TV right now."},{"comment_id":"1736119296633923","commenter_b":"SURE --- IF THEY PAY BACK ALL THE WELFARE AND ABORTIONS WE'VE PAID FOR FIRST --- ------ GET A FREAKING JOB.","commenter_a":"I have never believed in Slavery and have not supported anyone who did. In fact I believe we fought a war and won to free anyone who was inslaved. And Blacks are not the only people that others use as slaves, there is still human trafficing going on and woman that are used as sex slaves... Get over the past as none of us alive can be responsible for what people before us did except not let it happen again.","post_message":"Bernie Sanders Apologizes For Slavery, Demands We Compensate African Americans He can use his own money for that. Will you compensate African Americans for slavery?"},{"comment_id":"10154593290916037","commenter_b":"Kick all them illegals out!","commenter_a":"it is what he has always said, just all the words are different now","post_message":"Christie highlighted that Trump has said undocumented immigrants will not be eligible for citizenship unless they leave and re-enter through legal channels."},{"comment_id":"10155215673171337","commenter_b":"He better quit smoking crack with lamar odem","commenter_a":"Someone summon Bill Nye to drop knowledge on him.","post_message":"Um... what?"},{"comment_id":"10150745246359999","commenter_b":"More difficult than jamming his shirt into his pants","commenter_a":"*Insert Fat Jokes Here*","post_message":"Governor Chris Christie must now cram his vast political ambitions back into a space the size of New Jersey."},{"comment_id":"10154065307955329","commenter_b":"I leave my sweat for the next guy/gal so they can draw strength from my juices. Welcome.","commenter_a":"And how long are you supposed to wait before you wipe it down after you use it? Dear people that leave sweat stains on the machines and don't wipe it down after they're done, screw you.","post_message":"Pump some iron or nap? Nap."}]
