[{"comment_id":"1146806995375828","commenter_b":"Only lesbians are voting Hillary","commenter_a":"#Hilary said she going to let her husband run the economy.... Way to go #feminists set back 50 years in one sentence...epic fail #TRUMP2016 pls share","post_message":"We just won Kentucky! Thank you to everyone who turned out. We’re always stronger when we’re united. hrc.io/1WDpty0"},{"comment_id":"937882449580510","commenter_b":"Can't stand her","commenter_a":"No no! Remember the first amendment? She was and is free to ask anything of anybody. Man up everyone. Hopefully this will stay a free country.","post_message":"Uh oh..."},{"comment_id":"585280771667035","commenter_b":"This photo is liiiiiiiife!!!! :D :D :D","commenter_a":"Brian Rungeling don't you like Trump's new \"Make Russia Great Again\"?","post_message":"Alec Baldwin just trolled Trump again by walking around New York City wearing a “Make America Great Again” hat — with the embroidered logo in Russian.  The timing for Baldwin’s hat couldn’t be better, coming as the president-elect sat down with security officials on Friday who told him the Russians helped him win the election — an assertion Trump flatly denies because it would contribute to the belief that his win is suspect having lost by over 3 million in the popular vote."},{"comment_id":"1362411960521719","commenter_b":"@username Oh snap, you go mean girl. Can I sit next to you in the cafeteria? I didn't vote for the Orange white trash. but carry on with your brilliant repartee. I'm so put in my place. Yawn, on to the next idiot.","commenter_a":"Well, it's what I always say, \"if everybody says it, it must be wrong.\" The only thing wrong with @username is they are PH.D. reporting to a Honey Boo Boo and Duck Dynasty population. We are a white trash nation, of course nobody watches.","post_message":"Would launching a trade war with China help \"make America great again\"?"},{"comment_id":"987027218019347","commenter_b":"No you dumb ass fuck, you named 3 individuals over a period of time, now open your local paper and tell me how many blacks are killed by other blacks \"everyday\" and tell me did they deserve it? Black people need to sweep our own porch first, once we show unity, they'll have to respect \"us\"! Hell how can we war with them, if we show up to the war and half of our troops are dead from other blacks","commenter_a":"I'm so tired of y'all reporting about police killings. I wake up everyday and see \"us\" killings!!","post_message":"Stay woke.   Report shows that 1,134 people were killed by police in 2015. About 47.2 percent of those who died were people of color. Another 53.6 percent of people of color who were killed by cops were unarmed.   The study shows that young African-American men are nine times more likely to be murdered by cops than other people in our country. DETAILS ---> @webpagelink"},{"comment_id":"846040542099954","commenter_b":"Women may not want to watch porn but they will read it all day long.","commenter_a":"Much truth to what is said in this article, having said that, it's all about the dollar, always the dollar.","post_message":"“Fifty Shades” isn’t harmless. It is actively poisonous. Toxic. A putrid lump of nothingness.\" - Matt Walsh"},{"comment_id":"10153850699096955","commenter_b":"She got too big for her britches!!","commenter_a":"All of you hating on Kelly now, probably liked her before she decided she doesn't like trump.","post_message":"SCALIA'S SON BREAKS SILENCE"}]
