[{"comment_id":"10153258132214342","commenter_b":"Black man created their selves!!","commenter_a":"Why when cops kill a black man he is justified but when a black man kill a cop he is a coward .. I said this before black man was going to start doing the cops the same way they are doing them ... And it happen .. Sad for this man family. but this what these cops created in the black man","post_message":"An intense manhunt is underway for a 29-year-old man police say murdered a Memphis cop. Officer Sean Bolton, who's a former US Marine, was gunned down when he interrupted a drug deal that would have resulted in just a misdemeanor citation."},{"comment_id":"1787494751536145","commenter_b":"Such a whiner just give me a bottle of wine so I can shut the hell up","commenter_a":"Compared to what we have had the last eight years if Nixon was running I'd vote for him","post_message":"Clinton's running mate says Trump is even worse than President Nixon because he won't release his tax returns. Is he right?"},{"comment_id":"1381562928548606","commenter_b":"Ya and they'll have to start paying for water or make their own from sea water. Of course northern Ca, will succeed, so all we will lose is the three out of control cities. Not bad","commenter_a":"3 trillion in debt CUT EM LOOSE","post_message":"Spread this everywhere!"},{"comment_id":"1051849191502758","commenter_b":"Dirty lady lol","commenter_a":"I WANT PICTURES !!","post_message":"How do you measure up?"},{"comment_id":"10153205140467426","commenter_b":"Lady shut the hell up negative nancy","commenter_a":"Please get some bike helmets for these young riders and teach them to wear it.","post_message":"Inspired by #Richmond2015? Happy riding kids!"},{"comment_id":"10153007409220950","commenter_b":"What difference does it make if the victimizer was an illegal immigrant? They're no more likely to be criminals than anyone else.","commenter_a":"How about if your family was a victim of an illegal immigrant?","post_message":"Would you forgive the suspected Charleston shooter if your family were among the victims? @webpagelink"},{"comment_id":"1833287473397659","commenter_b":"Its being kept running by immigrants as it has, its a shortage of money and a deliberate government policy to ruin the NHS so all the Tory dirctors of private health care can ride in and cherry pick the best parts and leave a dead carcass for the rest of us to fund.","commenter_a":"It's simply because the government has closed too many hospitals. That's the only reason.","post_message":"Worst NHS week in 15 years"}]
