[{"comment_id":"10154113063315950","commenter_b":"@username wrong. Polls showed Hillary winning the ELECTORAL vote. Wanna try again delusional one? #ShesNotYourPresidentAndNeverWillBe #GetOverIt #SoreLoser","commenter_a":"Polls Smolls! Haven't we learn anything when it comes to \"polls\"?! Bwhahahaha!","post_message":"Barack Obama has a 50 percent approval rating heading into his final months in office, a new poll found Monday."},{"comment_id":"1058387144217814","commenter_b":"Best part, Karen, they probably don't even make minimum wage, if they're paid at all! Little Hitler Youth!","commenter_a":"Wowzer... I see the RNC interns are working through the weekend, copying and pasting their GOP talking points. Working hard to keep women, minorities, the poor, our LGBT brothers & sisters and immigrants under their jackboots 24/7. Shameful.","post_message":"It’s 2016. The days of dismissing the pay gap as a \"women's issue\" are over."},{"comment_id":"10155298164813132","commenter_b":"This dumb broad just made her ignorance known.","commenter_a":"@username Kenya Hall I'm waiting for Riri to read her to filth.","post_message":"Azealia Banks shared several Instagram posts and a video attacking Rihanna for her post about Trump's immigration ban."},{"comment_id":"1792520417642435","commenter_b":"Darlene is a freaking moon bat low life from Mars. Leave the scum alone.","commenter_a":"desroy Clinton, do not hold back, destroy this criminal.","post_message":"Crooked Hillary Clinton wants to essentially abolish the 2nd Amendment. No gun owner can ever vote for Clinton!"},{"comment_id":"10152973600191336","commenter_b":"Na she's not crazy . Mothers turn super human when someone hurts or almost hurts their kids","commenter_a":"Ok...pretty sure this woman is cray-cray...not a protective mama bear, but whatever","post_message":"A wild police chase in Dallas came to an end thanks to a protective mother."},{"comment_id":"10150722411999999","commenter_b":"That trains never late Go home Carrie you're drunk! Take your pseudo intellectual rhetoric with you. Of course she'd be singing a different tune if she was raped by a refugee. You're a pig!","commenter_a":"And you don't think they'll do that here?! Able bodied men who cowardly seek refuge instead of fighting for their country tells me everything I need to know about those people. Muslims are known for treating their women as property. They have no rights other than being breed sows. But we should be tolerant of a race of people who worship a sexual deviant that doesn't tolerate any other religion. Where are all these \"peaceful\" Muslims fighting back at these radical Muslims? First person to call me a racist for calling it like it is can open their doors and put their family in danger.","post_message":"The mayor of Cologne suggested that women protect themselves from men by keeping more than an arm’s length away."},{"comment_id":"699261006928857","commenter_b":"Hey Amber suck dick","commenter_a":"That was here plan NOT to help kids eat healthy but to sto kids from eating and she did a good job of it, come on Read between the lines. smh","post_message":"BYE BYE! Congress Releases SOME MASSIVE Bad News To Michelle On Her Way Out of The White House!"}]
