[{"comment_id":"10153826114722994","commenter_b":"What about them lying women. Who spred there legs to get bill money. I still respect bill. I still watch he's show.. get on the man who allowed them underage girls to come into that mansion..","commenter_a":"If the press and police will get over their prejudice and look at white males the way to they do black males as suspects, it would be a lot of white children alive today! \" They deserve a voice too! It's no coincidence, that these types of crimes don't get the scrutiny, they deserve. This is why child kidnappings, molesters, underground child porn rings, Internet pedophiles, thrive in suburbia, because they're white. R.I.P! Little one, the press will catch on sooner or later. The way I feel about inner city children dying by bullets in Detroit, is the same way I feel about suburban children dying at the hands of a kidnapper. They all deserve to live.....","post_message":"11-year-old Jacob Wetterling vanished in October 1989 while riding his bike. Almost 26 years to the day, police in Minnesota say they have a person of interest - and it was someone they looked at just days after he disappeared."},{"comment_id":"1280033575423027","commenter_b":"She didn't say anything that hasn't been said before.","commenter_a":"The trouble with Trump is he doesn't his rallies long enough to study for the job he is trying to get elected to which is so important. Hillary has the experience plus she takes off for a few days to study what is going on in this country and around the world. Hillary gets an A+ and is definitely ready to take over the Oval Office on day one. Go Hillary!","post_message":"Another right-wing conspiracy bites the dust."},{"comment_id":"1166911916662170","commenter_b":"Quit being a girl!!!!!!!!!","commenter_a":"People should remember that clearly there are innocent people in both jails and prisons. How would you like to be an innocent person in jail or prison, getting beaten up....with people cheering on further for you to be additionally brutalized?","post_message":"Inmates at New York's Clinton Correctional Facility say they were beaten, choked and slammed against walls by guards seeking information after 2 convicted killers escaped."},{"comment_id":"10153177506924087","commenter_b":"Lmao! My uterus says otherwise but that's fine - enjoy your misogyny!","commenter_a":"Rand Paul is a fool. Trump 2016!","post_message":"\"I don't think you want a nominee that offends whole areas of the public, whole ethnic groups,” Rand Paul said. \"If you paint with a broad brush and you want to say, ‘well, most Hispanics are drug dealers and they’re rapists and murderers,’ well, that’s crazy talk, and that offends a whole segment of our population. I think most people who immigrated to this country are assets to our community and came here seeking the American dream, the same way my ancestors did.\""},{"comment_id":"10153131128315950","commenter_b":"I hope their daughters get pregnant out of Wedlock","commenter_a":"I'm sorry, but your country deserves one more crazy, running it. Welcome Donald!","post_message":"The House voted to block Planned Parenthood's federal funds for a year."},{"comment_id":"10153491570891336","commenter_b":"I don't want that scum anywhere near my home.","commenter_a":"Considering I don't have an auto dishwasher, Obama can be my dish washer anytime.","post_message":"Counterproductive? New Obama administration regulations are meant to boost dishwasher efficiency, but industry experts say it'll result in greater water usage."},{"comment_id":"1887850284608044","commenter_b":"She was obviously impaired with alcohol, Thats how these freaks work!!!","commenter_a":"But the teen is also partly to be blamed. Knowing very well he is a disturbed 40 something dude who worships satan, how can u be ignorant on the values of his life. Why dint u just stay away from this monster as he wld embody all things evil that which is the hallmark of satan n the devil.","post_message":"Jailed for nine years"}]
