[{"comment_id":"1426892224004095","commenter_b":"It is an eye opener!! The horror will be if Hillary is actually elecyrd. Then the real horrors will begin.","commenter_a":"Excellent movie! A must see!","post_message":"Hillary's America might just be the scariest movie you see all year...  hillarysamericathemovie.com/#tickets"},{"comment_id":"10154077757710575","commenter_b":"WOW WORLD LEADERS RATTLED BY TRUMP JUST LIKE THEY WERE WITH REAGAN I THINK IT'S A GOOD THING THEY ARE SHAKING IN THERE BOOTS NOW THE FOLKS THAT ARE ABLE TO WORK LET'S GET THEM OFF OUR DIME MAKE THEM WORK EVEN IF THEY STAY ON WELFARE LET'S MAKE THEN CLEAN THE STREETS WORK FOR THE MONEY","commenter_a":"world leaders have no respect for Obama.","post_message":"Obama wants to make headlines...  So he attacks Donald Trump while in Japan."},{"comment_id":"10152992734357894","commenter_b":"I hope Nick Gordon get the Death penalty lazy Ass Bastard","commenter_a":"Praying for her...","post_message":"Nick Gordon Could be Charged with Murder for the Impending Death of Bobbi Kristina"},{"comment_id":"758642314270568","commenter_b":"@username @username DAMMM SHUT DOWN","commenter_a":"Hilary is no Obama, she is WEAK. She is a sell out in moments notice. She has no platform. The democratic platform was handed to her by Bill.","post_message":"Bernie Sanders to Hillary Clinton: \"Excuse me, I'm talking.\""},{"comment_id":"10153986549963132","commenter_b":"stupid bs, she feels fat and ugly.grow up kim.","commenter_a":"Oh please. She acts like she is the only woman that has ever had problems while Pregnant.","post_message":"Kim Kardashian West is opening up about what could potentially be a very scary delivery."},{"comment_id":"10153518586283812","commenter_b":"I say if men can do it, so can women. Get over it. If she doesn't want to shave then she doesn't have to. But if you want to then do it.","commenter_a":"No thanks. I think I'll skip this fad too","post_message":"On social media and red carpets, from New York to China, women's hairy underarms are having a mainstream moment: @webpagelink"},{"comment_id":"10156932201230389","commenter_b":"Good answer. She is a sellout.","commenter_a":"NOT EVEN HONEST TO THE PEOPLE THAT PAY HER?","post_message":"David Webb: “Do you think Hillary Clinton’s honest?”  Answer: “I think she’s honest to the people who pay her.”  MORE: @webpagelink"}]
