[{"comment_id":"697111387146106","commenter_b":"Go get them","commenter_a":"Unleash the Donald","post_message":"Donald Trump says he would bomb the sh*t out of ISIS during speech.  You have to watch this. He is absolutely right.  Do you support Donald Trump?"},{"comment_id":"10154167208567235","commenter_b":"@username pull the covers over your head !","commenter_a":"An apology? Are you kidding? How about publicly embarrassing the asshole who singled this man out? \"Land of the free\" my ass. More like \"police state of fear\". This is disgusting. What stereotyping trash people have become.","post_message":"“She kept staring at me and I didn’t know what was wrong,” he explained. “Then I realized what was happening and I just was thinking ‘I hope she’s not reporting me.’”"},{"comment_id":"10154325825161051","commenter_b":"Um I think this woman is a incredibly ignorant idiot, you can see anything in everything if you are looking for it. It is just a design of lines, what a dumbass","commenter_a":"If it offended you dont buy it.What's wrong with these cry babys","post_message":"Here's the Walgreens wrapping paper that had this lady outraged."},{"comment_id":"10153782060807235","commenter_b":"i am embarrassed that this nasty little whore is from my home town. that is NOT the values we were taught in Newton, Massachusetts","commenter_a":"Imbecile!","post_message":"This makes me want to vomit..."},{"comment_id":"10157253812445725","commenter_b":"#VoteTrump2016 #StopTheEstablishment #ProtectTrump #ImWithYou #MAGA","commenter_a":"We believe!!!! #trump2016","post_message":"IF YOU DO NOT BELIEVE IN YOURSELF- NOBODY WILL! •DJT"},{"comment_id":"10153654951896519","commenter_b":"@username tell that to Europe where is a hell hole for sex workers in the \"legal\" market and human trafficking of child prostitutes is at an all time high. Prostitution functions on the idea that women and their sex organs are a commodity to be bought and sold for the pleasure and consumption of men, it's dehumanization 101, how on earth could it be empowering when the average age that people start sex work is at 14?","commenter_a":"It is aginst the law yet you break it, You understand that liberals do not want you exploiting these women and yet you are hypocrite for doing so.","post_message":"\"Instead of seeking love, I sought success...\""},{"comment_id":"10153903226928797","commenter_b":"She Must Be Mentally insane","commenter_a":"Connie Reyes","post_message":"MOM HAS SHOCKING OUTBURST: The mother accused of killing her two young children and stuffing their bodies in a freezer has lashed out in court after losing her temper. What do you think? WARNING, details in this story are graphic and may be hard for some readers. Here's what mom said:"}]
