[{"comment_id":"10153234639738701","commenter_b":"Portland should be really embarrassed","commenter_a":"Really??? With all the real people who have contributed their time and energy to the Parade over the years all they can come up with is a old smelly piece of rug???????????????????","post_message":"Just in case you were starting to think Portland's obsession with the #pdxcarpet was over..."},{"comment_id":"10153589793400329","commenter_b":"10154197025200954Mary Lu10154879708717248","commenter_a":"Ryan Bere still wanna do this?","post_message":"Jaws IRL."},{"comment_id":"10153458308386336","commenter_b":"He'll build housing for the illegals on it.","commenter_a":"this man should be named adolph hitler.","post_message":"Despite Republican resistance, Pres. Obama announced the creation of three national monuments, encompassing more than a million acres of protected sites in Nevada, Texas and California."},{"comment_id":"10153051967106130","commenter_b":"Aqua man? Bitch please.","commenter_a":"\"Do you have a minute to hear about our lord and savior Jesus Christ?\"","post_message":"YIKES."},{"comment_id":"10153061886448188","commenter_b":"Show this to Omuslim in the White House, and remind him how EVIL his Muslim Terrorist pals are!","commenter_a":"The Quran says for them to kill all non believers of Allah......the ones that do not are called hypocrites .....why would anyone say this is not Islam? Quran (9:73) - \"O Prophet! strive hard against the unbelievers and the hypocrites and be unyielding to them; and their abode is hell, and evil is the destination.\" Dehumanizing those who reject Islam, by reminding Muslims that unbelievers are merely firewood for Hell, makes it easier to justify slaughter. It also explains why today's devout Muslims have little regard for those outside the faith.","post_message":"We as a company have aired or released many horrible images in our short tenure as a media outlet, none of which have risen to the level of depravity of the images of Lt. Muath Al-Kaseasbeh’s death. We had chosen not to release these images out of respect for the victim, his family and his countrymen, but also because we do not wish to spread fear and the message of psychopathic killers. This morning, I, as the owner and operator of TheBlaze, have changed my mind. After looking at the images again, I believe it is important for the world to see them. We have been lured into a poppy field where we have fallen fast asleep as grave danger quickly approaches. It is time to wake up. This is the enemy of all mankind. Make no mistake, this is a global jihad and it has everything to do with ..."},{"comment_id":"1784975415104883","commenter_b":"Quit talking the talk and walk the walk and prosecute this Bitch already for crying out loud!!!!!! No more POS criminal Clintons in the White House!!!!!!!","commenter_a":"We need to start a new Party, the Constitutional Conservative Party.","post_message":"DML explains about indicting Hillary Clinton for her emails -- what would it do? Plus, little inside info from pollsters who say Trump leading in polls nationally by Tuesday. Watch, share, and if you are new to DML please give this page a LIKE."},{"comment_id":"1633238976976440","commenter_b":"Debate is good!!! It means they're taking an interest in politics! I don't agree with the shirt but how can you be a 'free country' and yet ban a tshirt ? The teen has a right to free speech","commenter_a":"No keep it on, this is a good learning experience for them to do research and compile facts to rebut the shirt. In fact if she wants to wear that shirt she should have to make a presentation showing fax and citations from non-biased source is why she thinks it's true!","post_message":"The teen said she was asked to take the shirt off after it sparked a debate in class."}]
