[{"comment_id":"983233615058995","commenter_b":"Well, she is guilty and they are doing their jobs.","commenter_a":"Get obama to let the fbi to arest her","post_message":"“I think the bigger problem is not just the media, it’s the FBI.”"},{"comment_id":"10150514383944999","commenter_b":"All terrorists are Muslim?","commenter_a":"'Boko Haram ('Western education is forbidden'), officially called Jama'atu Ahlis Sunna Lidda'Awati Wal-Jihad (People Committed to the Prophet's Teachings for Propagation and Jihad), is a militant Islamist movement based in northeast Nigeria.' There's that common denominator again: Islam.","post_message":"Soon after Boko Haram kidnapped nearly 300 teenage girls in Nigeria, the U.S. sent surveillance drones and about 30 intelligence and security experts to help the Nigerian military try to rescue them. Seven months later, not one of the kidnapped girls has been found."},{"comment_id":"1717651245149172","commenter_b":"You're 100 % missing the point","commenter_a":"I love Bernie but these supporters are idiots. Throwing real money? How about using that money to feed the homeless and poor? Im sure Bernie would be just fine with that. I hate radicals. They do what they do for the spotlight and not for what's right.","post_message":"Well, this is certainly one way to get your point across…"},{"comment_id":"10155534707951509","commenter_b":"Hillary is going to prison, The wicked witch is dead.","commenter_a":"Black people don't vote for Hillary Clinton. In 1994, she signed the mass incarceration bill with her husband, which put many black people in prison for small related crimes. Trump wants to fix the black communities, get a better educational system, and invest more in the schools. Vote for Hillary and black people will be suffering for another 4-8 years, just like the last 8 years when we had all these promises that never came.","post_message":"Michael Dale Vance Jr., the Oklahoma fugitive who authorities said shot two officers and killed two of his relatives last week, was killed in a shootout Sunday night, according to the FBI's Terry Weber."},{"comment_id":"10156794675835389","commenter_b":"That's what happens when you allow undocumented immigrants flood into your country, Duh....","commenter_a":"So where is the UN? What is the purpose of th UN? How much money does the UN get to do nothing to help","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153184060913690","commenter_b":"If God wanted women to get around he would have given them legs....","commenter_a":"The intension is not to drive a car but to goo free life against the social and religious norms.","post_message":"Maysaa al-Amoudi Loujain al-Hathloul were freed after spending more then two months behind bars. Hathloul had tried to drive into Saudi Arabia from neighbouring United Arab Emirates in defiance of the Saudi female driving ban. @webpagelink"},{"comment_id":"1256931770993517","commenter_b":"Shut-up... and please die!....","commenter_a":"No laws we have on the books would have prevented what happened.","post_message":"'People on the No-Fly list can walk into a store and buy a gun. That is insane,' the president said."}]
