[{"comment_id":"585422771627079","commenter_b":"I disagree. Trump will defeat the Liar Hillary.","commenter_a":"WELL IF 65-70% DON'T WANT TRUMP AND HIS POLL NUMBERS ARE MUCH HIGHER THEN TED'S... THEN I WOULD THINK 90-95% DON'T WANT TED AND EVEN LESS WANT RUBIO...","post_message":"\"If Donald is our nominee, in all likelihood, Hillary wins, we lose the Supreme Court for a generation, the Bill of Rights is lost, we're buried in debt, and jihadists rise across the globe,\" Ted Cruz said. Do you agree?"},{"comment_id":"1909759522584421","commenter_b":"Isn't that Gail, Oprah's secret girlfriend ? She's a racist along with Oprah.","commenter_a":"Go back to Oprah!","post_message":"CBS acted like #BlackLivesMatter's personal PR group."},{"comment_id":"1836845559870004","commenter_b":"She doesn't deserve to be nominated.. What a laugh..","commenter_a":"Her expressions are the worst.... From her constant head nodding to her wide eyed expressions. And what's worse is when she opens that mouth of hers to spew out a constant stream of lies...","post_message":"Balloons are released to celebrate the official nomination of Hillary Clinton & Tim Kaine."},{"comment_id":"1034492959948582","commenter_b":"Strike one for Bernie. This has been well refuted many times over. Besides the feminists will vote for Hillary only for the fact she is a woman.","commenter_a":"All you brogressives claiming the wage gap doesn't exist don't deserve to have Bernie as your president.","post_message":"Women are making 79 cents on the dollar compared to men. For women of color it's even worse. African American women earn just 63 cents for every dollar a white male earns, while the figure for Hispanic women is just 54 cents. That's nothing but sexism and discrimination."},{"comment_id":"1695797427350247","commenter_b":"She is so stupid. That will not fix it it has to be destroyed.","commenter_a":"Does Compassion, Unity, & Love make roundes in 5.56/223.","post_message":"Have you hugged a suicide bomber today?"},{"comment_id":"10154051337399411","commenter_b":"Are you sane, woman?","commenter_a":"A scientific theory is a well-substantiated explanation of some aspect of the natural world that is acquired through the scientific method and repeatedly tested and confirmed through observation and experimentation.","post_message":"If you have proof: bring it. If you do not: acknowledge openly that you have theory perhaps a well-honed, much loved theory, but a theory nonetheless. (Op-Edge by Sam Gerrans)"},{"comment_id":"1015046351849709","commenter_b":"Science BITCH","commenter_a":"Carlos","post_message":"Sorry folks."}]
