[{"comment_id":"1122159437825214","commenter_b":"Hillary is only qualified for prison , Americans that vote for her are idiots, wake up !!!!","commenter_a":"That is how politicians make their fortunes. Crooked Hillary should not get near the White House. Who knows what she will continue to do; she believes she is untouchable.","post_message":"TREAT PEOPLE WITH DIGNITY? HILLARY TAKES MILLIONS FROM REGIMES THAT BRUTALIZE WOMEN & LGBT RESIDENTS: What Clinton said today, \"If you believe as I do, America values hard work and treats people with dignity and offering everyone the chance to live our dreams and cares for those in need, well, the formula for America's success have always been that we are stronger together.\" Versus Behind closed doors, Hillary Clinton uses State Department access and favors to rake in massive sums of money from some of the most oppressive regimes on planet Earth. “Rarely, If Ever, Has A Potential Commander In Chief Been So Closely Associated With An Organization That Has Solicited Financial Support From Foreign Governments.” “Rarely, if ever, has a potential commander in chief been so closely associated with an organization that has solicited financial support from foreign governments. Clinton formally joined the foundation in 2013 after leaving the ..."},{"comment_id":"1266833826777136","commenter_b":"I think this is the only remaining British cultural heritage??it should be nurtured and taken good care of.","commenter_a":"It's ceremonial !","post_message":"The campaign's gaining thousands of supporters"},{"comment_id":"916443248422431","commenter_b":"Wow what a bitch!","commenter_a":"@username sad","post_message":"SMH: Mother Tries To Abandon Her Son In The Street!"},{"comment_id":"10153242088138132","commenter_b":"Pretty sure you have to have virgin hair","commenter_a":"Well I just got my hair colored and cut. I'm sure it will be on the front page by Monday. Hehe","post_message":"Love it or leave it?"},{"comment_id":"10155768590015557","commenter_b":"Lmao they must be the fugliest bunch of prostitutes in the planet. A darn shame for whoever plugged in that","commenter_a":"I'd rather do the 5 knuckle shuffle. Gross. Just legalize it, better quality.","post_message":"'It's been a problem around here for awhile,' Reading resident says following an undercover sting that resulted in the arrests of eight women on prostitution charges. More on the story in a live report from WFMZ's Ryan Hughes on #69News at 5:30."},{"comment_id":"1359242680802143","commenter_b":"Nope. Her boobs would be bigger.","commenter_a":"She looks amazing, but that belly looks like it's growing a baby","post_message":"Is Jennifer Aniston pregnant at 47?"},{"comment_id":"1762485630649940","commenter_b":"In the world of medicine, an incorrect diagnosis could possibly be as good as death. So in this case, yeah. Alternative medicine does kill.","commenter_a":"\"Alternative medicine kills\" what the heck?! It didn't kill her, sure it didn't save her, but it certainly wasn't the cause of her death.","post_message":"Being vaccinated could have saved this child. Being taken to a qualified medical doctor rather than a quack could have saved this child. Alternative medicine kills."}]
