[{"comment_id":"497560420446120","commenter_b":"By voting for @username, you are wasting your vote. There is no way he can win the presidency. Besides, why would you vote for a person who supports amnesty. Amnesty is bad for America. It is bad for the state of Ohio. It lowers wages. And takes jobs away from Americans.","commenter_a":"We're just 3 days from Ohio. Chip in $10 or more right now to support our TV ad & critical grassroots programs! JohnKasich.com/TV","post_message":"Kasich Works Town Hall live from Heath, Ohio"},{"comment_id":"525718480886525","commenter_b":"Go home angelia you're drunk","commenter_a":"Yesterday 100 innocent dead in Lebanon Attack, 500 innocent dead in Palestine, 200 Dead In Yemen, last year 400,000 dead in Syria, 5 years ago 1.5 million dead in iraq, Yet No one Says Word , The world Stands silent. And In Paris Attack Today 150 Dead And World Goes Crazy . Obama's statement after attacks in Paris: \"This is an attack not just on Paris...this is an attack on all of humanity\" Mr . Obama Wake up Humanity Has Been Getting Attacked and it dead long time ago. R.I.P To All those innocents Who Died In Paris Attack Today, and R.I.P To All Those innocent lives Who were never Mentioned In The Attacks , and Still Being Killed and not Being Mentioned .","post_message":"Our worst fears have been confirmed. #ParisAttacks The Free Thought Project.com (y)"},{"comment_id":"10154229231904411","commenter_b":"If a woman have every right to show off her body or hair; then why can't she have the right to cover it? I haven't met any veil wearing ladies that have offended me in the least.","commenter_a":"The Golden Rule of Civil Rights is, One Mans Rights End Where Another Mans Rights Begin","post_message":"Awkward: Laurence Rossignol, who is ironically founder of the anti-discrimination organization SOS Racisme, compared Muslim women who wear veils to 'American negroes' who supported slavery"},{"comment_id":"10154523489186336","commenter_b":"This must be an attempt to try and dig yourselves out of the hole you're in.","commenter_a":"If you want to know what is really happening in the world bypass FOX and CNN, and go to alternative news sources. You will be amazed to see how much the American news media ignores. We are all living in the dark.","post_message":"Now more than ever, viewers are turning to Fox News Channel – Most Watched, Most Trusted!"},{"comment_id":"998201713572910","commenter_b":"Don't stop there. Get the rest of the scum","commenter_a":"How sad....","post_message":"Islamic State's chief singer-songwriter has been killed in an airstrike in Syria"},{"comment_id":"10156475967855231","commenter_b":"@username That's nothing to brag about or feel proud of. Just makes you a parental fail.","commenter_a":"Art is seems to be tge type of jerk who would disown his gay child. Especially, a male child.","post_message":"He apologized, but let's be for real: does he really mean it?"},{"comment_id":"717073721816539","commenter_b":"She is nothing but a bitch and a liar.","commenter_a":"Hillary for Prison 2016","post_message":"Hillary tried to damage Trump’s reputation by spreading this rumor. She is disgusting. Comment ‘yes’ if you think Hillary should be punished. Can we get 30,000 ‘LIKES’ for Donald Trump? [VIDEO]"}]
