[{"comment_id":"509597579189019","commenter_b":"Her Christ has lice...","commenter_a":"good, hope they all empty their bank accounts and go belly up","post_message":"Hate can make people do stupid things... - Andrew"},{"comment_id":"591336634387962","commenter_b":"Build the wall!!","commenter_a":"That's California for ya. I find nothing wrong with what he said in 1971. Things were different then. I said things in 1971. Does that mean I'm a racist today? I am military where everyone's color is either desert camo or woodland camo. I find affirmative action quite racist. Employers should be able to hire people because of their skills not because of the color of their skin. Absolutely ridiculous.","post_message":"California lawmakers refuse to honor John Wayne! and here's why..."},{"comment_id":"10153445751101782","commenter_b":"for the people that want abortions i ask you one question why did you allow yourself to get knocked up in the first place?","commenter_a":"Thank God!","post_message":"Gov. Mary Fallin has vetoed Oklahoma's anti-abortion bill."},{"comment_id":"10153191726563132","commenter_b":"Oh ladies...smh","commenter_a":"Angie --we need to get Kathy on this situation.","post_message":"Won't you lend a paw?"},{"comment_id":"1401167556601539","commenter_b":"Well if you get appendicitis which is a sepsis or a serious infection in your appendix and it can burst you can die so if that's the case and you get appendicitis I would recommend your removing it","commenter_a":"God made humans with an appendix not about to remove it just because scientists have not quite figured out a use for it. Think about it","post_message":"Be grateful if you still have yours."},{"comment_id":"10156320084670354","commenter_b":"The most disgusting women on this planet !!!!","commenter_a":"why are these women so adamant on murdering of innocents?","post_message":"WATCH Whoopi Goldberg and Joy Behar unload on Dr. Ben Carson..."},{"comment_id":"235119820270004","commenter_b":"Haaaaaaaa!!!!! Stupid, stupid lady.","commenter_a":"Too bad crybabies, he is your president. And I hated Obama but I am a grown-up and lived with him and his ugly family for 8 years. So grow up and shut up","post_message":"Trump has now set a record for the most hated president."}]
