[{"comment_id":"10153889787166337","commenter_b":"This sucks this is such a good show","commenter_a":"Not happy! Love the show! Can they not find a replacement for Molly? Your messing with my Monday and I don't like Supergirl.","post_message":"CANCELED? Sad news for Melissa McCarthy and Mike & Molly fans..."},{"comment_id":"1102356133153121","commenter_b":"dumb bitch","commenter_a":"Yooooooo I Knew She Was A Tranny!!","post_message":"‘I Stand Corrected:’ Wendy Williams admitted fault and apologized for her remarks about HBCUs.  Williams spoke with Roland Martin on Thursday's edition of The Wendy Wiliams Show where the NewsOne Now host eloquently summed up America's troubled past of slavery, segregation, and the oppression of African-Americans. WATCH the discussion and the NewsOne Now recap -> @webpagelink"},{"comment_id":"10152733923177217","commenter_b":"Probably think females don't know anything about cars.","commenter_a":"Another keyboard warrior.","post_message":"TV presenter in Twitter break after Top Gear \"threats\""},{"comment_id":"10152588899470779","commenter_b":"Right girl","commenter_a":"Jarelie Anne McClusky can't fucking waiiiit","post_message":"Brett Morgen's documentary is more than just a must-see for Nirvana fans. It's an eight-years-in-the-making collective labor of love that offers a private peek into the artist's mind, from the first creative stirrings to the spiral downward. You don't just feel as if you've gotten to know the man better. You're left completely emotionally spent."},{"comment_id":"10153755960426101","commenter_b":"Your mother gives rimjobs","commenter_a":"9/11 was an inside job","post_message":"EXCLUSIVE VIDEO: A massive residential Dubai skyscraper was engulfed in flames as authorities rushed to evacuate hundreds during New Year's Eve celebrations. At least a dozen people are injured, primarily due to a stampede rushing to escape the growing fire. Updates from Newsweek Middle East: @webpagelink"},{"comment_id":"10153352835244384","commenter_b":"I love Nancy Pelosi. Her farts smell like broccoli.","commenter_a":"I love Nancy Pelosi, she is a superb role model, and tireless worker for all Americans!","post_message":"Today, under the leadership of Congresswoman Rosa DeLauro, House Democrats are again taking the lead in addressing one of the most pressing economic challenges confronting our country by re-introducing the Paycheck Fairness Act. Securing a fair shot for women in the workplace is critical to ensuring prosperity for our nation. Rather than continue their cycle of obstruction and dysfunction, House Republicans should join with us to close the gender wage gap so we can provide bigger paychecks and better infrastructure for all Americans. @webpagelink"},{"comment_id":"10156681236645354","commenter_b":"Go Donald Trump make America great again Let's take our Country back Ban muslims God be with you and Stay Safe.","commenter_a":"Trump did NOT say Muslims should wear special ID badges. Clever editing by a hostile press invented that.","post_message":"Fox News Invites Anti-Trump, Hitler-Citing, Muslim Advocate to Join GOP TV-Debate"}]
