[{"comment_id":"10153148435072098","commenter_b":"Wrong person died","commenter_a":"Guess his high heels got stuck on the gas pedal haha 😂","post_message":"BREAKING..."},{"comment_id":"1457804240939001","commenter_b":"Don't forget the nra was starred by giving rifles to free slaves in the south to protect themselves from mobs and the kkk","commenter_a":"Just like President Obama, Al Sharpton is losing his grip on reality . Dr. Martin Luther King would roll over in his grave if he knew how far backwards race relations have slipped because of the ideals of Mr. Obama and Al Sharpton. I'm 51 years old, and I'm seeing more race related problems than I can EVER remember.","post_message":"Watch David Webb destory the Reverend..."},{"comment_id":"10153550726385575","commenter_b":"Idiots! !!!! GO TRUMP!","commenter_a":"Illegals have Togo . They drain our resources , disobey our laws , take our jobs. Trump is right. If you want to be in the USA do it right","post_message":"The Gateway Pundit - Jeb Bush Bashes Donald Trump After Debate – Defends Illegals (VIDEO)"},{"comment_id":"10152994622700796","commenter_b":"Women are more likely to have chronic pain, be prescribed prescription painkillers, be given higher doses, and use them for longer time periods than men. Women may become dependent on prescription painkillers more quickly than men. Women may be more likely than men to engage in “doctor shopping” (obtaining prescriptions from multiple prescribers). Abuse of prescription painkillers by pregnant women can put an infant at risk. Cases of neonatal abstinence syndrome (NAS)—which is a group of problems that can occur in newborns exposed to prescription painkillers or other drugs while in the womb—grew by almost 300% in the US between 2000 and 2009. ---@webpagelink","commenter_a":"These addictions for many were not choices but had a slow way of happening. Many were prescribed pain relieving drugs after surgery or have a bad back or another painful injury and the doctors wrote prescriptions for opioid medicine like the were going out of style. The family that owes the company that make Oxy, are literally billionaires now just by selling Oxycontin. When you write millions of prescriptions for Oxy in less than 20 years, what the hell do you think that will happen? Many of those people become addicts if you take these drugs for a long enough time. When the doctors stop writing scrips, the people turn to any source available. IMO, Doctors are responsible for the current heroin epidemic in this state and country.","post_message":"“It focuses on a social service intervention as opposed to criminal justice intervention, and it’s been very successful in Seattle,” Portland Mayor Michael Brennan, who is a licensed clinical social worker, said."},{"comment_id":"836801636436616","commenter_b":"Any one doing this should be around up put in jail and when it is time to get out they should be deported","commenter_a":"And those BASTARDS in DC want to bring in over @username in the next two years. HELL NO","post_message":"Broad daylight in Germany. Watch Muslim 'refugees' beat the crap out of this mom and daughter. Can you say, 'extended magazines?' @webpagelink"},{"comment_id":"1256135284407480","commenter_b":"Er, spider silk has almost nothing to do with a spider's reproductive system, other than if some species use it for mating rituals. So I don't think you can rape a spider. If they were to take off the harmless pins, it would find a corner and immediately start building a web, because it's a spider and it has no conscience. The closest I can relate to this spider is giving blood.","commenter_a":"Wow. That's horrific and pretty fucked up","post_message":"Poor spider!"},{"comment_id":"10156396288885354","commenter_b":"If you want refugees you can have them but please build a containment wall around your state!","commenter_a":"Yes, if it is truly about safety, then they can stay in the Middle East, and we can help provide for them, which would be the right and just thing to do. They are human and most are probably good people fleeing a civil war. No need to be sent to the United States.","post_message":"\"There is no reason America cannot create a safe zone for these refugees in the Middle East. That is the most compassionate thing to do for them. It is the safest thing to do for America. The only reason Obama is risking the safety of Americans to bring them here is to feel sanctimonious and to divide us.\""}]
