[{"comment_id":"10154165765599091","commenter_b":"#DrainTheSwamp #PayToPlay #RiggedElections #VoteFraud #NastyHillary #MAGA #CrookedHillary #NeverHillary #HillaryForPrison2016 #LockHerUp #BuildTheWall #BringBackJobs #LatinosForTrump #NoMoreClintons #BenghaziButcher #DefeatSocialism #BanIslam #EmailGate #CorruptMedia #ObamacareFail @webpagelink","commenter_a":"Congratulations and God bless!!!","post_message":"CONGRATS! Five female firefighters have graduated from the New York City Fire Department (FDNY) academy -- the most women to join New York's Bravest since 1982!"},{"comment_id":"984777404931920","commenter_b":"Our weak border has made Mexico Drug Cartel stronger and made Mexico's government weak with corruption. Mexico has some of the most beautiful beaches in the world that are controlled by some of the most deadliest drug cartels. Mexico is losing billions in tourism because of the Cartel. Mexico is a culturally rich country that is being destroyed by these drug cartels. By building this wall it will help both the Mexican and the American economies by stopping drug trade. The Cartels will lose many because supply will be cut of and Mexico will gain strength. 95% of illegal drugs that come across the border will be stopped by a wall. It will in turn save our communities and our youth. Our youth will be able to flourish instead of turning to drugs. Americans will no longer have to depend on Liberal Politicians asking for help, they will be able ...","commenter_a":"Take away handouts and people committing welfare fraud and put them to work. Seems like there's quit a bit of places hiring where I live. I do believe trump is our our hope and is the best choice for president. Bernie is a joke and Hillary is a liar.","post_message":"I will bring our jobs back to the U.S., and keep our companies from leaving. Nobody else can do it. Our economy will \"sing\" again."},{"comment_id":"10153798319264087","commenter_b":"fuck you. she didn't do shit when people called for help in libya. she sucks-and she hassled girls bill raped","commenter_a":"he cares about Americans. I always vote democrat, but not any more. i will vote for Bernie in june-but he don't have a chance-ill vote for Trump against that lying bitch","post_message":"“What I’m going to do is I want to focus on 15 or so states because we have to win, and I want my energy to be put in the states where it could go either way,\" Donald J. Trump said. \"And we’re going to play heavy, as an example, in California. No other Republican would, they wouldn’t even go to dinner in California. They wouldn’t do it.”"},{"comment_id":"644856102371635","commenter_b":"Well if they don't like America doing it they can take back across the border with them ( GO BACK TO MEXICO)","commenter_a":"Quit posting stupid shit like this!!! It's not news.","post_message":"A Hispanic student is banning whites from using this term... because it's racist? 'LIKE' if this is WRONG!!!"},{"comment_id":"10152789526371130","commenter_b":"I think her father is a proud lesbian.","commenter_a":"well this little girl is just over the top.. do you think her father is proud? I think not..","post_message":"\"I've been pegged with the word insensitivity. It's just how I've been sensitized and the tone I chose.\""},{"comment_id":"10153622833731519","commenter_b":"She says what her market wants to hear. She, and all the ilk like her, are just media whores who spout filthy hate and get PAID big bucks for it.","commenter_a":"At least she didn't say that we need to keep the tradition of having only presidents on our currency.","post_message":"Greta Van Susteren nearly gave herself a rage stroke last night..."},{"comment_id":"10156528840915389","commenter_b":"She's a troll. Ignore her and maybe she'll go away","commenter_a":"The best parts of LIFE are free and easy to do.","post_message":"ICYMI: 89-year-old World War II veteran Bryan Sperry scores a touchdown during The University of Kansas alumni flag football game! Sperry played on the Kansas Football team from 1946-1948. @webpagelink"}]
