[{"comment_id":"940190486114130","commenter_b":"What a fucking shitbag","commenter_a":"Bill Clinton was President and the Commander in Chief during part of my time in the National Guard. I had no respect for him as a man but had I ever encountered him I would have rendered proper military courtesy out of respect for the office of the President. When you put on the uniform you mo longer get to pick and choose.","post_message":"HA! She should've thought twice..."},{"comment_id":"1895551420676942","commenter_b":"Its not a muslim ban you morons.....learn facts. The top 5 countries in regaurds to muslim population are still traveling with zero restrictions. Its a 3 month travel ban from the 7 countries with strong terror ties....and 3 months until the fix the problem of Isis slipping through the cracks. And if he is so mean and horrible, what is Obama and the rest of the democrates? Because this \"Ban\" is the exact same one Obama used in 2011 only Obama did it for 6 months...not 3. Please open your eyes before you spew blind hate.","commenter_a":"You are and idiot. Wake your ass up shame Trump has to protect you.","post_message":"Share if YOU stand with Sally Yates, too. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"856527364484863","commenter_b":"@username shut ur dumb-ass up!","commenter_a":"First point of order the car is in the middle of road. Second point yes his hands were raised but he moved to the car and did not stop not typical behavior of a stranded motorist when given an order to stop or asked hey why is your car in the road. Third point the suspension is typical following any ois during an investigation. So is the officer right or wrong if you can make that judment based on clips of an entire interaction with the police you're an idiot, and are part of what's wrong with America as well.","post_message":"GRAPHIC VIDEO: Video released today shows Tulsa police shooting and killing Terence Crutcher, an UNARMED father of 4 and college student for the crime of having his car stall down on the road. His hands are raised shortly before shots are fired. From the helicopter, a cop can be heard on the radio saying, \"That looks like a bad dude, too.\" A federal Justice Department investigation has been launched and the officer who shot him has been suspended. Video by Occupy Democrats, LIKE our page for more. Read more here: @webpagelink"},{"comment_id":"10155095813944203","commenter_b":"KEEP IT UP DEMS!!!👍🗽🇺🇸","commenter_a":"There should also be a petition to all cable carriers to remove FOX from their channel line up as this network is a danger to America. Tell advertiser to boycott FOX.","post_message":" misled the Congress and he misled the American people."},{"comment_id":"425066681021905","commenter_b":"That woman should of been kicked out.","commenter_a":"Look what we just missed- Wendy Rowe Ristine-#noblackfriday #somepeoplejustsuck","post_message":"Look at what a woman just did to a child at a Black Friday Sale."},{"comment_id":"962171047226860","commenter_b":"She's a loser. She should stay with a loser.","commenter_a":"Well it's about time! Now she and Hillary can be together.","post_message":"Breaking: Huma Abedin announces she's separating from Anthony Weiner one day after husband's new sexts emerge."},{"comment_id":"10153554685766880","commenter_b":"I want TRUMP to build the wall so can make it hold","commenter_a":"At one time owning slaves was constitutional","post_message":"#2. Ending birthright citizenship would be \"clearly unconstitutional.\""}]
