[{"comment_id":"10153784446624203","commenter_b":"@username-She answers questions, she just doesn't give you, narrative you want hear-why should she. It amazes me, the vagina remark! Must be nice to have 240 years of men. Too bad it's not you electing, the first male President. Try reversing that and how would that feel? Oh and a lot our Male Presidents, haven't been real Winners. CONgress mostly MALE-mostly FAIL!","commenter_a":"Clinton is dead in the water. Mass media is bought and paid for. Sanders for President!","post_message":"\"Hillary Clinton may have trounced the men at Tuesday debate, but 2016 isn likely to be the year we get our first woman commander in chief.\""},{"comment_id":"109818942877901","commenter_b":"Pussy ass crackas","commenter_a":"Whatever you need","post_message":"Name it! #WSHH"},{"comment_id":"1371535832866166","commenter_b":"What's wrong with strippers? Lol","commenter_a":"I cant believe you fools who support absolute political corruption.... you will lose your homes and jobs, mark my words, she is Obama part 2, choose wisely sheeple","post_message":"ELECTION DAY: People are casting their ballots across the country today. Have you cast your vote yet? Who do you think will win? Our coverage starts at 4 p.m."},{"comment_id":"774112892726570","commenter_b":"Shit up traitor go suck on Hillary's nipple","commenter_a":"Know why? Because your last name means he who sands as in sandpaper.","post_message":"Boom. #DemocraticDebate #DemDebate"},{"comment_id":"10153630301063132","commenter_b":"Did they ever catch those fucktards??","commenter_a":"God Bless her and her family!","post_message":"\"I can't understand why they would want the thrill of hurting me like this, hurting my entire family.\""},{"comment_id":"10154473389496336","commenter_b":"Hahaha we thought same thing.","commenter_a":"Lmao! So the DNC asked the lady who caused all the chaos in Baltimore to restore order ?? Wow ! The DNC is in trouble","post_message":"Baltimore Mayor Stephanie Rawlings-Blake gaveled in to bring the Democratic National Convention to order, after Debbie Wasserman Schultz excused herself from the role amid controversy regarding leaked DNC emails."},{"comment_id":"10153814122893984","commenter_b":"I think if gay couples have to go to another office in another county, then their taxes should follow where they get services. I'm sure if Kim's paycheck was affected by how many licenses she issued then her religious beliefs would't be as important.","commenter_a":"Hey, wait a minute.....where's the outrage towards the Muslim bakeries (several) who refused service to gay couples planning weddings because of their religious beliefs? And why did the Muslim Target store cashier get an allowance to her job description to specify items she refused to ring up for a customer when they wanted to purchase a bottle of wine? And why did the Muslim flight attendant (<----surreal, isn't it?) get a religious liberty allowance to her job description by refusing to serve alcohol to a passenger? Yeah, okay. Had Kim been a Muslim, this narrative would have flipped to sympathize on the side of religious liberty. But she's not Muslim. She's just a Christian adhering to her religious rights, and in a respectful way, might I add. Respectful. Take a page, all you vulgar-mouthed, whiny, double standard hypocrites. It is what it is: religious liberty. Further, as stated in the ...","post_message":"The letters from Kim Davis that were just uncovered could drastically change how people think about this case. Do you stand with Kim Davis?"}]
