[{"comment_id":"1240054509382884","commenter_b":"my state of AZ just paid a 3 million dollar fine to a private prison because it did not keep it filled to 97%.....they lock up undocumented immigrants for 6 months on the taxpayer dime before deporting them.","commenter_a":"When taxpayer money is given to private corporations to house prisoners we end up with the highest prison population in the world. That is not a coincidence at all. We taxpayers, the People, are paying for the subjugation and torment of a large portion of our population. Mostly a minority inmate population, I might add. It's just wrong no matter how you look at it.","post_message":"The U.S. has more people in jail than any other country on earth. To my mind, it makes a lot more sense to invest in jobs and education than in jails and incarceration. Our job: end the war on drugs, end private prisons and pass real criminal justice reform."},{"comment_id":"1098939776819315","commenter_b":"Does your Mommy know she raised a selfish, irresponsible, inhumane twat?","commenter_a":"A good majority of those 31 thousand people that are shot to death are killed in self defense and line of duty shootings by police. So that number should be adjusted down. Many of those killed tried to kill some one else. Back to Abortion. End it. End it now for the love of God. I lost a child to abortion. I don't know how my ex-fiance goes to sleep at night.","post_message":"There is no outrage in the media regarding how many lives are taken by abortion."},{"comment_id":"10156215776400354","commenter_b":"The grisly death of a human life, which is abortion, has a dedicated, zealous following who treats the death rite in a religious manner. Clearly, there's more at work here then just the convenience of sloppy people. Imagine an America with 19 million more black people, virtually all of which would vote Democrat. Things would be much different. The 55 million human lives lost since '73 would make for a vastly different nation. Democrats commit crimes against humanity in many different ways, and clearly abortion is the most depraved and reprobate of them all.","commenter_a":"They need to harvest her vagina","post_message":"“Planned Parenthood is proud of its limited role in supporting fetal tissue research.”"},{"comment_id":"1035305006509971","commenter_b":"No woman should be a republican if they are smart..","commenter_a":"Young Republicans whyyyyyyyyy!!!!!!!!!!! Is any woman a republican?????????","post_message":"\"this young woman’s death serves a purpose. She 'Took one for the team.'”"},{"comment_id":"10154274374674445","commenter_b":"Meant north Falmouth not Nana! These txt terms get ahead of me lol!","commenter_a":"Granddaughters & sister-in-law-,law live in E,& Nana Falmouth have to check it out!, saw on local TV Chronicle last night!","post_message":"Chronicle on WCVB Channel 5 is exploring the beauty of Cape Cod. What's your favorite spot to visit each year? Watch live: @webpagelink"},{"comment_id":"10156478047465231","commenter_b":"Her lips are gorgeous","commenter_a":"Somebody is jealous of this beautiful lips!!! :* :* :*","post_message":"Some people just don't know how to cope when they see beautiful melanin and full lips."},{"comment_id":"10154199579226770","commenter_b":"I would make her the racist","commenter_a":"Then should be on our team and not with Islamic terroists","post_message":"A journalist for The Guardian, a left-wing news website, said she wouldn't condemn violence against so-called 'racist' people."}]
