[{"comment_id":"10153396293173525","commenter_b":"@username, yes I do know that. It has never happened despite 45 of 50 states allowing open carry, and some that have NEVER PROHIBITED it since they became states. No open carrier has ever been \"taken out' by a criminal.","commenter_a":"Kinda think it's dumb. Makes you a target basically. Someone will see ur gun and be like let me take them out first... Ya kno... Element of surprise is better.","post_message":"OPEN CARRY: The same law that's being proposed here in Florida just went into effect in Texas, and to celebrate, several groups rallied at the State Capitol carrying their guns. STORY: @webpagelink"},{"comment_id":"10154975862774062","commenter_b":"That woman just wouldn't stop she makes the situation worse and keeps it going she brings it on herself if I were that man I would hit her too","commenter_a":"Men shouldn't punch animals like that. Poor cow..","post_message":"The confrontation quickly turned into a brawl."},{"comment_id":"1870076373211219","commenter_b":"My first thought was to wonder where the women are.","commenter_a":"One small detail though. Local women are not even allowed to even try to approach the beach without their burkas and totally covered. OUTRAGEOUSLY INHUMANE TREATMENT OF WOMAN.","post_message":"Put us on the next plane to Dubai."},{"comment_id":"10153562067157377","commenter_b":"@username She seems just as evil as Cecile Richards.","commenter_a":"The judge should have had Daleiden executed ,so the people in the clinic could sleep at night.","post_message":"\"This is a huge win for the pro-life movement,\" said Jared Woodfill, an attorney for Daleiden. \"The court recognized that the charges brought by the Harris County District Attorney's Office were flawed from their inception.\""},{"comment_id":"10153411171720950","commenter_b":"Ron, please stop being materialistic with cheap cars. Are you trying to intimidate or impress your FB friends? Bad taste, Sir.","commenter_a":"Trump Supporters are not motivated by fears, we're motivated by FED UP! We're tired of our voices being stifled and the liberals/media doing all they can to take our freedom of speech! This time we WILL have the last word! <3 Common Sense Approach! TRUMP! 2016","post_message":"Donald J. Trump: \"We love Nevada!\" Watch his full victory speech after projected GOP caucus win."},{"comment_id":"922572661194216","commenter_b":"Yep, she's illegal.","commenter_a":"Karma people, Karma! What you put out towards an innocent child will come back to you and it's well deserved.","post_message":"Ivanka Trump announced the arrival of Theodore James Kushner on Twitter."},{"comment_id":"678517065647894","commenter_b":"#TRUMPPOTUS Save America from wussies!","commenter_a":"When is NBC going to start posting about the latest Wikileaks stories?","post_message":"\"I regret coming to the Trump support event, and in particular allowing my son to be a part of it,\" one donor said."}]
