[{"comment_id":"10154518732261880","commenter_b":"Make America great again !! Thanks Mexico for the wall","commenter_a":"@username your boy is a fraud","post_message":"Buddy buddy."},{"comment_id":"10153470330831130","commenter_b":"Divorce first, then be a whore.","commenter_a":"To y'all bashing her.. this line right here says it all, \"In my marriage, I felt alone.\" - Divorce was inevitable. Period. THEN it says she met him when she was 17, they dated while she was in college, and got married once she graduated. Can you imagine if you married the person you dated at 17? It wouldn't work for a LOT of people.","post_message":"\"And just like that, my plans to spend the rest of my life with the man I loved and my best friend were crushed.\""},{"comment_id":"824287517608590","commenter_b":"Let's go get em Ron. Steve is on his way to pick you up with mike bike","commenter_a":"I knew it!","post_message":"Well..."},{"comment_id":"1238344686206387","commenter_b":"This is so nice to see. Females in this world matter very much.","commenter_a":"Jean Daniel Boixo","post_message":"These young Pakistani girls are aiming to knock out gender stereotypes. (via NowThis)"},{"comment_id":"694905427350625","commenter_b":"@username do you have special \"illegal spotting\" glasses? How do you know who's here legally & who isn't? Can you just look at people and tell or what? It's ok for them to fight in the army but because they're \"illegal\", they shouldn't be able to live here. Illegal immigrants aren't the problem, racists are","commenter_a":"I'm a Mexican who lives in Mexico, I had to say that before someone comments that I should be deported. Let me tell you that WE, you and us, are not enemies, yet your federal government, and Trump have treated us like such. The point is that some of us even share family living in both sides. I do have lots of American friends who I care for and respect greatly. I do also know that the majority of Americans are decent, honest, hardworking, generous, and God loving people. I am not against you neither most of my fellow country men are. I ask you from the bottom of my heart and trying to appeal to your reason and kindness not to let all this crazy stuff mess with our relationship as fellow humans and as good neighbors. We are friends and family. Let's keep it like that. Thanks for ...","post_message":"We certainly have. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1369581076434970","commenter_b":"Stay on your meds lady","commenter_a":"If you go and read her fb page you will see this is FALSE reporting.","post_message":"Sinead O'Connor has 'threatened to jump off a bridge'"},{"comment_id":"10153351201607439","commenter_b":"We the People have our lives going and We the People aren't the ones waging war on other countries. It's the government. They want to go to other countries and spend trillions of our tax dollars on them and try to get those mid east countries to be more civilized. Well, you can't teach a baboon how to talk and you surely can't teach these primitive thinking tribes to be civil. So the only thing they know is to try to rule the world and get the whole world to be on their level. As for that Boston Bomber mother.....your fu*kface son will burn in hell way before your 'people' get a chance to try to burn America down! And you'll be under ground too and will never see America burn. America's too strong of a Nation for that. Even with this Muslim president.","commenter_a":"Hey, your religion aint working.","post_message":"@webpagelink"}]
