[{"comment_id":"10153511898009087","commenter_b":"Look at the lies thay have in office today everyone of them for nothing but money .and there's nothing wrong with what trump personally done. .there trash on everyone .","commenter_a":"You will not turn a single vote away from trump support ers .you will only make more people for trump .","post_message":"\"I stand by every question I asked [Donald Trump] and he was not the only one who had tough questions,” Megyn Kelly said. “He was the only one, however, who complained.” WATCH:"},{"comment_id":"10154172121273010","commenter_b":"They are moving the focus to have room to build a new ranger...","commenter_a":"This is disgusting. All respect for Ford, gone. After 2 Rangers, no more.","post_message":"It's cheaper and more profitable to make the cars in Mexico."},{"comment_id":"10153174163477452","commenter_b":"he better not get fired. @username","commenter_a":"GET SOME!!!!","post_message":"Big Mac attack!   A McDonald's worker wasn't \"Lovin' it\" when an irate and apparently drunken customer launched into a vicious attack at the drive-thru window. But the worker wasn't going down without a fight. abc7.la/1KYEgIq  It's just the latest case of a service worker attacked on the job."},{"comment_id":"1781541005401492","commenter_b":"Praying","commenter_a":":(","post_message":"Live coverage from Eyewitness News: NJ Transit train crashed into the station at Hoboken Terminal.  More details: @webpagelink Photos: @webpagelink"},{"comment_id":"10154387812405329","commenter_b":"Pretty ladies :)","commenter_a":"My mom and I get asked if we're sister's whenever we're out","post_message":"Um....................................."},{"comment_id":"1021077537953055","commenter_b":"Stupid assbag thug asshole !! Stupid is as stupid does !","commenter_a":"yes","post_message":"Chevez Antwann Fiason wasn’t expecting this homeowner to be armed. This is why Americans have the right to bear arms. Can we get 70,000 ‘LIKES’ for the Second Amendment?"},{"comment_id":"978112395570641","commenter_b":"Did all Muslims commit those crimes ?","commenter_a":"It's disrespectful not all Muslims are terrorist or bad people it's in terrible taste it's like me driving around with a plate that says fgirlscouts just cus one gave me the wrong cookies","post_message":"A personalized license plate in Minnesota which read \"FMUSLMS\" has received condemnation from many, including the governor. Read more about how and why it was issued: @webpagelink"}]
