[{"comment_id":"1062077417179756","commenter_b":"She is a fraud !","commenter_a":"bad squaw","post_message":"WATCH: CHEROKEE PEOPLE Express Disgust Over \"Lying\" Elizabeth Warren Faking \"Native American Heritage\" To Get Prestigious Law Professor Job [VIDEO] @webpagelink"},{"comment_id":"10155272434600652","commenter_b":"Testing. Testing. Forgive the interruption, but -- big surprise! -- something is all screwed up with my Facebook News Feed/Pages Feed and I read a suggestion that I should comment to get things to show up again.","commenter_a":"I can sum up the cause of China's rise in four words: \"American wants cheap crap.\"","post_message":"How to think about China's phenomenal rise:"},{"comment_id":"10154645739237178","commenter_b":"Rather have snow than ice in Wake Forest !","commenter_a":"Sketchy in so pines","post_message":"Winter weather update with WRAL Elizabeth Gardner. (Stick around for the end to watch a little gloating from Brian Shrader's Anti-Snow League)"},{"comment_id":"1326722587387039","commenter_b":"Lock her up!","commenter_a":"These people man!","post_message":"Guess what her alias is..."},{"comment_id":"1304157179622515","commenter_b":"Is there any difference at all in Trump utilizing Twitter and Chinese Commie rulers using a a newspaper as their mouthpieces? What does China have that we don't have besides lots of bodies? The best thing they know how to produce is garbage.","commenter_a":"China, wallstreet, and our own government have been pissing down our collective backs for years, and telling us it's good for us because it's just rain.","post_message":"That's quite a bark, but do they have the bite to back it up?"},{"comment_id":"10154377654466729","commenter_b":"parents need to stay in contact with reality when it comes to their kids. pay attention to what schools is teaching our kids. it is all coming together. womans lib, moms are not home any more to pay attention to what kids bring home. homes have been destroyed.","commenter_a":"Those who can, do.","post_message":"Bingo."},{"comment_id":"10154327927746336","commenter_b":"Only thing that needs a brain is u Hernandez as u can't even spell my name which is right infront of u.. Thank God Trump is getting rid of all u illegals.","commenter_a":"Please refer to him as President Trump.. Thank u.","post_message":"This morning, Donald J. Trump tweeted out a message for Memorial Day."}]
