[{"comment_id":"685160361665842","commenter_b":"She must have needed something to have married this turtle.","commenter_a":"His wife will head transportation dept. or something. She is anti-union and for big corporations. Family does Business abroad. Her family gave turtle face around 25 million.","post_message":"Astoundingly dishonest."},{"comment_id":"10153795049694199","commenter_b":"I thought he was dead....ooopps","commenter_a":"April fools","post_message":""},{"comment_id":"10153221680277217","commenter_b":"@username: Why do Muslim women feel desperate?","commenter_a":"So, are Muslim women ALLOWED to choose to be child free?? Not being sarcastic, it's a real question. This meme seems misleading. By the way, I think ALL women should be allowed to choose, and I think people who don't want kids shouldn't have them. However, everything I've ever read suggests this isn't an option for Muslim women (as well as in some other religions). Would like input on the realities.","post_message":"\"Don't get me wrong, I love children - just as long as they aren't mine\" #100Women"},{"comment_id":"527521687455792","commenter_b":"Don't give her anything free ,I bet she would loose some weight then maybe she will like what she sees,maybe if she was real hungry she would find a job,how about stopping everyone's welfare look what a cost saving that would be and it would help our United States we wouldn't have to feed a bunch of free loaders .","commenter_a":"Oink, Oink !!","post_message":"I couldn be more disgusted by what she saying"},{"comment_id":"10154889301650180","commenter_b":"Mine must have Bluetooth capability or something... every time I use it for lane changing, the car behind me speeds up to block me... weird!","commenter_a":"Oh so there not decorations for the holidays? Because it seems that's the only time I see people really using them","post_message":"Indiana State Trooper films hilarious PSA about this major vehicle safety feature called a \"turn signal.\" @webpagelink"},{"comment_id":"10154408917183797","commenter_b":"How big is that wall going to be? Lol","commenter_a":"This is why I can't wait for Trump being elected and building a giant wall!!!","post_message":"FLIGHTS TO CUBA: U.S. officials say the United States and Cuba will sign an agreement next week to restart commercial air traffic for the first time in five decades."},{"comment_id":"1455415254518218","commenter_b":"Define \"innocent\", please. Then I will explain to you the meaning of \"idiot\"","commenter_a":"The problem is that the conservative corporate controlled media has turned the conversation away from the police killing unarmed innocent citizens to this nonsense about kaepernick not standing. Where is the outrage against the police killing hundreds of innocent people?","post_message":"Megan Rapinoe said it was an intentional move to support 49ers' Colin Kaepernick"}]
