[{"comment_id":"2040319902861153","commenter_b":"Trump dont controll the border walls he will make trouble here in border town n Mexico... we have crime here due to there here already the Cartels n Zetas in da USA in the border cities... USA build walls the always around or underneath or make ladder in the walls","commenter_a":"Wow. You hate waterboarding of terrorist and protest on the streets of America on their behalf. But the beheadings of American soldiers, christians and innocent civilians in the Middle East and nothing said on the streets of America. And you call yourself an American. Seems like the left is more interested in open bathrooms and open borders, hmmm?","post_message":"Wake up, America!"},{"comment_id":"1066819213408210","commenter_b":"Welcome home honey, Americans take care of each other. We want more proud immigrants like you!","commenter_a":"I am not a us citizen yet,but I hate seeing american burning a us flag..she not the one to fight for her freedom..she didn't even think to the forefathers that fight for her freedom right now..that has no respect at all..","post_message":"WATCH: A police officer takes an American flag away from a protester who was trying to burn it outside the GOP Convention in Cleveland."},{"comment_id":"1335775503144117","commenter_b":"Very well said, @username! Plus, people just didn't vote in the primaries enough. It was a simple matter of numbers. But he's still out there and I'm hopeful for 2020!","commenter_a":"i was a die hard Bernie supporter, but I would like to know the truth. Was Bernie placed in the primaries to gain the young vote knowing he would drop out only to hopefully hand the votes over to Hillary. Was he truly conspired against by the DNC or as this post says why didn't he stand up to his constituents? What went wrong Bernie, can you please tell the ones who like me, wrote you in on the ballot even though you weren't registered aS a write in. Your true believers.","post_message":"If you don't have the guts to face your constituents, you shouldn't be in the United States Congress. If you need police at the town hall meetings, that's fine, have police at the meetings, have security at the meetings. But don't use that as an excuse to run away from your constituents after you support repealing the Affordable Care Act, doing away with protections for pre-existing conditions. If you're going to do all those things, answer the questions your constituents have."},{"comment_id":"10154198707121636","commenter_b":"You British slaves deserve this Royal domination and humiliation!! The King plus Queen rules slaves are always slaves!!","commenter_a":"The point is that the royal family could easily afford to pay for the renovations themselves. We have no money for the NHS, but plenty for this? How is that in any way fair?","post_message":"Money well spent?"},{"comment_id":"10155605832169657","commenter_b":"Lock her up","commenter_a":"When you see it written out like this, it is nothing short of stunning. Clinton emails. Trump admitting sexual assault. Clinton emails. Trump charity fraud. Clinton emails. Trump calls for nuclear proliferation. Clinton emails. Trump calls for national stop and frisk. Clinton emails. Trump violates trade embargo with Cuba. Clinton emails. Trump sued over Trump U fraud. Clinton emails. Trump bribes DA. Clinton emails. Trump doesn't pay taxes for 20 years. Clinton emails. Trump employs campaign manager involved in illegal corruption with Russia. Clinton emails. Trump calls for ban of an entire religion from entering US. Clinton emails. Trump lied about support for Iraq War over and over in debate. Clinton emails. Trump in court for rape of a minor. Clinton emails. Trump unaware of Russia's Crimea occupation. Clinton emails. Trump unaware of situation in Syria. Clinton emails. Trump penalized for racist housing discrimination. Clinton emails. Trump files for bankruptcy ...","post_message":"Hillary wants you to believe that there's nothing to see."},{"comment_id":"10154490897799657","commenter_b":"That bitch wants your guns so she wont get shot.","commenter_a":"she is brain damaged","post_message":"How far is Hillary willing to go to get your guns?"},{"comment_id":"915117481938364","commenter_b":"One day her money,scheming,and life of cards will come crumbling down in front of the world. How can billy bob clinton show his adulteress face. They are shamefull. And not the only ones. They better get their life righ fir the next.","commenter_a":"yes...why should Hillary get away with what she has done,if it was any of us we would go to prison,so yes send her to prison along with Obama","post_message":"No wonder The Hildebeest hates... The Donald. @webpagelink"}]
