[{"comment_id":"10153126312326028","commenter_b":"I don't understand Americans... This is the land of the free, right? No one's free! One is not free to speak Spanish and the other one is not free to be stupid. All my respect for the Latina lady, because at least she tries to speak English, thing that doesn't happen often.","commenter_a":"White 'Murican hates a woman that speaks TWO languages and she can't even form proper sentences, or thoughts, in one language..","post_message":"\"I FELT AWFUL\": All Norma Vazquez wanted was to treat her son to some birthday IHOP on her time off from her job cleaning office buildings. Instead she was berated by another patron who told her to \"stop speaking Spanish\" and invoked the Nazis, Castro and Russia.  Watch the entire exchange, which Vazquez's son recorded on his cell phone: @webpagelink"},{"comment_id":"10155463122287908","commenter_b":"They have BEEN doing this for years. My Mom (bless her soul) was very inept with her money and defaulted on her student loans. Her SS WAS garnished. 15% came out every month. Luckily she lived with me so she was OK. We calculated what she owed and what was taken from her...... tax refunds and garnishes..... she paid that loan over and above YEARS before. But, they are like the IRS they charge interest for every day, week, month and SECOND you owe them money. I told my daughter, it's better to work and pay as you go and maybe take a few years longer to get an education than EVER take a loan for it.","commenter_a":"So what has Obama and the DNC been doing about this?","post_message":"How absurd! The very rich get richer and receive giant tax breaks, while low-income seniors see their social security benefits cut to pay off decades old student debt. We should be expanding social security benefits, not punishing seniors for the \"crime\" of getting a higher education. Garnishing social security benefits to pay off student debt is a crystal clear example as to why we need fundamental changes in our national priorities. In the richest country on earth, we should make life easier for seniors, not hard"},{"comment_id":"10153680219934641","commenter_b":"Problem solved!","commenter_a":"I'd still like to know why they need to come HERE? It would be cheaper and safer to house and secure them over THERE. The need to vet them would be nearly eliminated, language issues would be non-existent, violence and criminal acts would be lessened, etc. We can't adequately provide for our nations homeless population as it is. We're going to bring in 10's of thousands of them from another country and shelter THEM, but leave our own (many of whom are veterans) out in the cold? (literally)","post_message":"\"If there's a rabid dog running around in your neighborhood, you're probably not going to assume something good about that dog,\" Dr. Ben Carson said Thursday, speaking about refugees. @webpagelink"},{"comment_id":"1001780713207758","commenter_b":"Like we weren't already?","commenter_a":"So how many of his baby-mamas and illegitimate kids do we now have to support? Any more than usual?","post_message":"Protesters Said this Cop Shot an Unarmed Teen for No Reason. Here's the Video."},{"comment_id":"1717651245149172","commenter_b":"You're 100 % missing the point","commenter_a":"I love Bernie but these supporters are idiots. Throwing real money? How about using that money to feed the homeless and poor? Im sure Bernie would be just fine with that. I hate radicals. They do what they do for the spotlight and not for what's right.","post_message":"Well, this is certainly one way to get your point across…"},{"comment_id":"1279992562041213","commenter_b":"Notice how he always gets phone calls telling him he's doing great...","commenter_a":"Your headlines are as misleading as the mainstream media...","post_message":"After how much Trump has frustrated America these last few months, it’s great to see the tables turned."},{"comment_id":"10154729419757699","commenter_b":"Aww Gee must really be scared of Trump . Just use all the money we send them and rest of south America and build the wall that will do it","commenter_a":"TRUMP 2016 !","post_message":"FOX's Gurnal Scott reports."}]
