[{"comment_id":"1184326411634277","commenter_b":"Yup they deserve to go home and shouldn't think twice before shooting and it should be shoot to kill do the crime expect to pay the price I don't care what color your skin is point a gun at a cop expect to eat lead","commenter_a":"If you point a gun at anyone, expect to get shot.","post_message":"Do you agree?"},{"comment_id":"10154020746508908","commenter_b":"Malo e :)","commenter_a":"@username Kristjan Korez","post_message":"500 kilometers On 1 Litre of water: Brazilian man challenges the idea of gas stations."},{"comment_id":"10153326850769411","commenter_b":"muslims bitch and cry more than the gay. lets just put all of them gays and muslims on 1 island. and blow it the fuck up","commenter_a":"All muslims ever do is make demands.","post_message":"'They behave like the neighborhood bully, persecuting Palestine footballers, athletes and the movement of sporting equipment. Enough is enough.'"},{"comment_id":"10153867280412377","commenter_b":"When illegals, dead people and multiple pollers etc, wait c and see how it goes, did the blm intimidate or black panthers block door or maybe machines were screwed up again Save your voting receipt just incase","commenter_a":"Donald Trump has 0% chance of winning the election. Gary Johnson 2016","post_message":"Pete Hoekstra to Newsmax TV: Trump reserved the right to reject. Watch coverage on @webpagelink"},{"comment_id":"683007381889840","commenter_b":"Shut, your, cunt .","commenter_a":"She has no right to be called a first lady any more than her husband has a right to be called a president!!","post_message":"The White House is trying to cover this up as quick as possible. This comes as no surprise. She is the worst first lady ever. Are you disgusted by Michelle Obama?"},{"comment_id":"10153111531487483","commenter_b":"While yes , abortions do bother me, I can see where they are necessary in some instances HOWEVER, I don't believe the federal and state govts ought to pay for an abortion that is not medically necessary!","commenter_a":"Here we go again..Same poop, different day. Same old narrow-mindedness and folks being too lazy to do ACTUAL research. Some people are so close-minded that even if you had the proof right in front of their face, they wouldn't believe it. \"Oh my God! Planned Parenthood (PP) does abortions!!! We MUST stop them NOW!!!!\" *SMDH* Heaven forbid that they actually admit that PP provides other things to both women AND men as far as health screenings, treatment and counseling. So go ahead you Fools, and defund a program that low-income families have depended on for years. I just don't understand how some folks call themselves \"Christians\".","post_message":"Planned Parenthood says Medicaid patients have a right to choose their health care provider. A 21-year-old woman, who has received contraceptive shots from Planned Parenthood, joined the lawsuit against the state."},{"comment_id":"544801219019682","commenter_b":"No questions from me Dr Carson.I just thank God for you, and know your here because God has plan for you. Dr Ben to win.","commenter_a":"Why do you think intensifying the war on drugs is a good thing?","post_message":"Each night I try to take some time to answer a few questions. You can send your questions to me by texting them to ASKBEN (@username) or you can email them to me at AskBen@BenCarson.com.  Before I get started tonight, I want to remind everyone that I will be on both Meet the Press (NBC) and Fox News Sunday this Sunday morning.  Also, Discovery Life will re-air a special about my medical career on Sunday evening.  Check local listings to find the times in your area.  The first question is about the Benghazi Hearings.  I didn’t get to watch to whole hearing but I have read the press accounts of them.  It is extremely clear that Secretary Clinton knew the attack was a terror attack and not a riot based on a film.  Yet, she and the Administration continued to purposely misrepresent the nature of the attack publicly for days.  Missing emails from that crucial time would no doubt provide better clues for who knew what, when.  Of course, that email has been deleted.  I have thought about this some and I think I know now what Hillary was destroying by erasing that server – her credibility.  It is another sad story in a long line of politicians who failed us.    The next question is about Medicare.  Annette from Ohio wants to know if I really want to abolish Medicare as was reported in a Washington politician tabloid.  The answer is of course NO.  I am interested in how we can both save money and deliver better service to our nation’s seniors.  You will no doubt hear of this kind of reporting which is meant to scare people from making any changes to the Washington power base.  I practiced medicine for 39 years.  Throughout those years, I often was disgusted with insurance companies.  Our current system is spinning out of control.  More and more state exchanges are going out of business.  Premiums continue to spiral out of control for those that can’t afford coverage.  Now reports begin to surface that millions of seniors will face massive premium increases.  We need a system where consumers are empowered and protected.  We need a system where you and your doctor decide what is best for you.  We need a system where each of us can monitor costs and levels of service.  I will soon offer such plan.  Until then, please take these press attacks for what they are…the last gasps of the Washington power class.  Finally tonight, I want to end on what many people sent me regarding the two new polls in Iowa today.  Three polls in two days all with the same results.  Each has me significantly ahead by 8 or nine points in Iowa. While of course I am delighted with the results and all of our hard work, now is the time to work even harder.  I am in Iowa tonight and all day tomorrow.  We will continue to fight to deliver our We the People message not just in Iowa but in every state across the country.  Thank you for standing with me.    Goodnight!   Ben"}]
