[{"comment_id":"1146865702064592","commenter_b":"OMG, Catherine. Did you really say that? go wash your brain out with soap.","commenter_a":"Hillarys people Bribed the FBI to changed subpoena documents and change it from classified to a lower classification . If they can do something so illegal and get away with it. Think how the government can come after ANYONE! the Media owned by global elitist, Hillary is their puppet.","post_message":"Image from Meme GOP"},{"comment_id":"10155137005061037","commenter_b":"Most illegals come here by not wading a river.","commenter_a":"Trump supporters are more worry about illegals than of terrorists what a sad world dnt forget that criminals come of all races and not just cause your brown skin means your from mexico Natives,Mexicans,Italians share the same skin color","post_message":"He once referred to it as “The Great Wall of Trump.”"},{"comment_id":"10153765647881336","commenter_b":"The thing we are worried about is the fact this woman can become president when she has a possibility of doing all that.","commenter_a":"George W. Bush lies America into a pointless war that kills over 4,000 Americans, and deletes 5 million e-mails=eh okay with Republicans. 4 people die somewhere in the world and Hillary has her own server so that RWNJ's and terrorists can't hack her=throw Hillary in jail. The hypocrisy is thick with Republicans.","post_message":"Question: \"If Hillary Clinton wins, how many years will she serve in the first term?\" Answer: \"In prison?\""},{"comment_id":"965089543550794","commenter_b":"Sounds like pure jealousy. Cal looks better than some women","commenter_a":"but why do they all have the need to look like hookers?","post_message":"She only realised she was transgender when she dressed up in hot pants and a wig for a joke"},{"comment_id":"1243590202327674","commenter_b":"Hmmmm maybe we should stop any more Christians from coming to the US","commenter_a":"WTH is wrong with people!!!","post_message":"\"Nothing can describe the pain and sorrow of the remaining family members.\""},{"comment_id":"10152983460914342","commenter_b":"Good to hear","commenter_a":"When my grandmother got very sick we put her in a nursing home it was bad they make people thing it was the best place ever but it was not after my grandmother passed away that was the only day i saw my grandmother nice and clean ,(.... but now after my dads stroke we have him in a nursing skill facility and is the best of all i being into is call Grace Care here in katy is super clean nurses are super nice the whole staff is very friendly my dads loves this place the way they treat their patients is absolutely amazing i will recommend this place to anyone!!!!!!","post_message":"\"Most people don't realize how expensive this care can be until a parent or family member needs it...and then it's a real shock.\""},{"comment_id":"10154651718054203","commenter_b":"@username So afraid of smart, strong women that it's pathetic. #madampresident Get used to it, prick.","commenter_a":"They're desparate at this point. Killary's ship is sinking fast, and when Trump smokes her on Monday it will seal the deal.","post_message":"Take a deep breath."}]
