[{"comment_id":"1058949000851488","commenter_b":"Of course it would. My God you people with your guns. Enough already.","commenter_a":"None of the proposed legislation would have saved a single life... this is all political theater and a cover for the Democrat's failed foreign policy.","post_message":"Senator Chris Murphy: \"I'm mortified by today's vote, but I'm not surprised by it. We learned in the months after Sandy Hook that the NRA has a vice-like grip on this place. Even when 90% of the American public wants change.\" Full video here: @webpagelink"},{"comment_id":"10153700282571955","commenter_b":"Ann Coulter's long lost French sister !!! Yea !!!! <3 \\b\\b\\b\\b\\b","commenter_a":"European and US far right are far different there is no limited governemtn and free marekt in Europe, it is just taking chashing cultures seriously.","post_message":"NEW WONDER-GIRL OF FRANCE FAR RIGHT..."},{"comment_id":"1178194115526177","commenter_b":"That's her idea of building America?","commenter_a":"Hillary supports blm and black panthers in that they say kill all whites and cops. And riots, looters, arsonists, and cop haters are all ok with Hillary.","post_message":"It's being called \"a monumentally stupid comment,\" and that's among the remarks we can print. You simply won't believe how Bernie Sanders is \"feeling the Bern\" from his own fans after saying white people don't know this one thing"},{"comment_id":"1029601670427380","commenter_b":"Waiting for Drumpf to deport his first and third wife. Apparently jobs aren't the only thing he likes to outsource.","commenter_a":"Kurt Schultz think you may enjoy. Just saying. Miss you, partner","post_message":"Trevor unpacks Donald Trump's response to the mass shooting in Orlando. @webpagelink"},{"comment_id":"10153259767028132","commenter_b":"Go back to stinky Bay City!","commenter_a":"Who cares about Madonna. She looked horrible at the Grammys and she has no room to talj","post_message":"Madonna is not a Fifty Shades of Grey fan."},{"comment_id":"852525808271329","commenter_b":"Fire the bitch","commenter_a":"not good","post_message":"She refused to hang his coat, but true patriots stepped in. This is how all of our vets, and active duty should be treated. Can we get 3,000 'LIKES' for our vets?"},{"comment_id":"10153590629541336","commenter_b":"Lady?","commenter_a":"How the hell is this \"lady\" not behind bars","post_message":"Ed Henry: “You were the official in charge. Did you wipe the server?” Hillary Clinton: “Like with a cloth or something?” WATCH: Today at a news conference, Ed Henry pressed Hillary Clinton as to whether or not she wiped emails from her personal server."}]
