[{"comment_id":"10153064956677217","commenter_b":"When we shoot the last of them in the wild you'll be thankful for the necessary evil that is zoos","commenter_a":"\"Five-month-old baby Hippopotamus imprisoned for human entertainment.\" You must be SO proud SDZ. How about we lock you up instead? I'd pay double to stand & point.","post_message":"Five-month-old baby hippopotamus entertains visitors at San Diego Zoo"},{"comment_id":"949410461745800","commenter_b":"well said Bonnie","commenter_a":"I am from Middle East and full face cover has nothing to do with Islam, it is clearly oppression of woman. Disgusting. Those who say this is freedom of choice or religion should also be sympathetic to Nazi insignia or brutality","post_message":"What do you think?"},{"comment_id":"1024025567641378","commenter_b":"I voted Obama twice Glad I did too.","commenter_a":"Someone pass me the bong he's been taking hits from.","post_message":"Pres. Barack Obama takes swipe at Donald J. Trump's campaign slogan “Make America Great Again” by saying \"America’s pretty darn great right now.\""},{"comment_id":"10154308446053984","commenter_b":"Unfortunately there is no share here or I would share it. Hate that lying crazy woman. Thanks for that info.","commenter_a":"This piece was copied from another post. It can be found on you tube in something called The Clinton Chronicles. If you're under 50 you really need to read this. If you over 50, you lived through it, so share it with those under 50. Amazing to me how much I had forgotten! When Bill Clinton was president, he allowed Hillary to assume authority over a health care reform. Even after threats and intimidation, she couldn even get a vote in a democratic controlled congress. This fiasco cost the American taxpayers about $13 million in cost for studies, promotion, and other efforts. Y Then President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were Zoe Baird and Kimba Wood both were forced to withdraw their names from consideration. Next she chose Janet Reno husband Bill described her selection as worst mistake. Some may not ...","post_message":"Democratic presidential front-runner Hillary Clinton just revealed that she believes Americans have too many guns in their homes, and I don't think one would have to take too wild of a guess as to what she would do about it if elected president... Do you think a Hillary presidency would be bad for America?"},{"comment_id":"10154600060589641","commenter_b":"Because you never listen properly. Listen closely and you will learn. Building a wall. ..you got it right. That's one policy. it has to do with immigration. That's very big. Walls keep people and things out or in. Keep illegals out. Citizens, can now get the jobs the illegals had and spend that money in their country , instead of it being spent in another country. That's one in a nutshell. That is an economic principal. And it's a big one. It has a trickle down effect. There are many more policies that he has articulated. Learn them a2live.","commenter_a":"I am not an American, but I have one question to the Trump Supporters who thinks that CNN is bias... What Plans does Trump has to make America Great Again? Because since I started following the primaries to the last debate the one thing that I have ever heard from this Man is Building the Wall at the borders. The rest of the things from economy to foreign policies he says we are going to figure that out. By the way he says it is not good to give your agenda to your competitors. Is that the bases under which Donald is going to make America great again? Leaders are voted for their ideas and policies, how much healthcare they can provide, how much education they can give, what can they do with the GDP, etc. but this man knows just nothing. Shame to the Trump supporters!!! I would disowned ...","post_message":"Hillary Clinton: \"What we want to do is replenish the Social Security trust fund...\" Donald J. Trump: \"Such a nasty woman.\""},{"comment_id":"10152908270740927","commenter_b":"Forced motherhood?! Are they frigging kidding me?! Nobody forced them to have sex unless they were raped. So stop with the ridiculous posters!","commenter_a":"Just who is forcing these women to get pregnant? No one is forcing \"Motherhood\". Try and show some responsibility if you are going to have sex.","post_message":"It's no surprise that Satanists support Planned Parenthood, but what is SURPRISING is how they showed that support ..."},{"comment_id":"1722190664688272","commenter_b":"Go back to your Country!","commenter_a":"Then get the hell out of our country.. go back to your country so you can smell camel s***","post_message":"Muslims Throw Fit Over Odor From Bacon, Then THIS Happened Do you love the smell of bacon? @webpagelink"}]
