[{"comment_id":"569607529880232","commenter_b":"Karma is a bitch!","commenter_a":"Reap the whirlwind...","post_message":"The students he ripped off are about to get their revenge."},{"comment_id":"10153996640170326","commenter_b":"Illegal aliens have Constitutional rights?","commenter_a":"Why is it every time Donald gives a semi sane speech, the media says he's pivoting? How many times is this now? His speeches are the same old thing. I'm going to build the wall. I'm going to ban Muslims. I don't care about constitutional rights. I will trample over all those that oppose me. I will be ruler of America!","post_message":""},{"comment_id":"10153154951847994","commenter_b":"Finally a judge with a brain! you go girl! They should get life but sadly they will have some tear jerking defense and will probably get ten years.","commenter_a":"Wow, this was compelling!!!","post_message":"A judge is furious over the death of a little child -- and she let the suspects hear it. She says watching their police interview footage was more like watching a cable TV show.   Read more about the case here: @webpagelink"},{"comment_id":"880219112013511","commenter_b":"Try her for what. This is America. Take your laws and get the hell out of America.","commenter_a":"And the Democrats agree... I am sure..","post_message":"Not in America!"},{"comment_id":"1077236902352732","commenter_b":"Ya \" maybe in Florida . You know were the Zika mosquitos were found!!!","commenter_a":"Yeah...but nevermind when democrats block Zika funding. @webpagelink","post_message":"How do they sleep at night?  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154364862976336","commenter_b":"Shes an accomplice then! Lock her up too!","commenter_a":"Put her in jail or kill him. Sounds like she knew!!!","post_message":"The gunman's wife said that he scouted both Pulse, the nightclub where the mass shooting took place, and Downtown Disney, recently renamed Disney Springs."},{"comment_id":"10154512852146350","commenter_b":"@username I'm well aware that her mother is white. Someone should let HER know that","commenter_a":"Alicia Keys is so talented and beautiful. It's really a shame that she's a racist.","post_message":"\"It's about just being who you are and not letting anybody tell you who you should be, Alicia Keys said."}]
