[{"comment_id":"1042991895769865","commenter_b":"Assholes","commenter_a":"The WORST representation of what New Yorker are really LIKE! He's a Schmuck","post_message":"Let's try this again.  (And hey, while you're here, make sure to RSVP for our \"Vote against Trump\" page, and let the world know you are going to vote against him:  @webpagelink/ )"},{"comment_id":"10153540589586323","commenter_b":"Oh my god did you even read the article!! The number ending up at Calais is miniscule, the article also states most don't even know about our benefit system so maybe we left behind a massive impression after colonising half the world they figure we are the country they admire or can relate to, to be honest i don't care, if its they live or die then they should live here","commenter_a":"Those people in calais are not true refugees or asylum seekers, if they where, they would claim fir asylum in france. EU law says that they should claim asylum in the first safe country they arrive in. Last time I checked, france is a safe country, so is spain, italy, germany, and many other eu countries. What I don't understand is why there are over 5,000 of these so called asylum seekers camping in calais trying to get into the uk. If you are a genuine asylum seeker, you don't get to pick and choose where you want to live.","post_message":"When you’re facing the world’s biggest refugee crisis since the second world war, it helps to have a sober debate about how to respond. But to do that, you need facts and data – two things that the British migration debate has lacked this summer.  These, in the clearest terms, are the 10 key facts."},{"comment_id":"1625836147707451","commenter_b":"That would be very hard for her to do.","commenter_a":"Why wait, just blow your brains out. Wait, that's why you said that, you don't have a brain","post_message":"Typical Hollywood liberal with an overreaction to everything."},{"comment_id":"10152633154612452","commenter_b":"You do know I meant loving","commenter_a":"@username living all the comments. Brian Williams lol","post_message":"DRAMATIC PHOTOS: Two police officers were able to save a woman trapped in a sinking BMW after smashing the vehicle's rear windshield. @webpagelink"},{"comment_id":"10155131143925389","commenter_b":"Can't deport an American born stupid","commenter_a":"In a Court of law your reporting would be \" hear say \" Sean","post_message":"One of the two brothers suspected of gunning down 12 people in Wednesday’s attack in Paris traveled to Yemen in 2011, where he was in touch with Al Qaeda training camp leaders, U.S. officials told Fox News."},{"comment_id":"10152826899201051","commenter_b":"How would she like if someone caught her on fire in a cage! This woman is sick!","commenter_a":"Put her in cage, set on fire","post_message":"First she made sure the puppies were securely locked up in the pet shop. Then she set it on fire."},{"comment_id":"10153076081181051","commenter_b":"Bitch go kill yourself","commenter_a":"It's like being at the zoo when a monkey wants a banana","post_message":"When this woman found out the store was out of Skittles, she snapped."}]
