[{"comment_id":"10155485619961509","commenter_b":"Hillary is. Not a woman! She is a devil!","commenter_a":"Trump: Nobody has more respect for women than me, believe me.... 20 mins to Hilary \"What a Nasty woman\", this clown is the biggest joke ever.","post_message":"Hillary Clinton, citing Bernie Sanders, calls Donald J. Trump \"the most dangerous person in modern history to have run for president.\" @webpagelink"},{"comment_id":"10153643564026051","commenter_b":"She shouldn't be out!! WTH","commenter_a":"I don't think so","post_message":"A mom who killed her 3 kids is now demanding custody of her new children."},{"comment_id":"10153700282571955","commenter_b":"Ann Coulter's long lost French sister !!! Yea !!!! <3 \\b\\b\\b\\b\\b","commenter_a":"European and US far right are far different there is no limited governemtn and free marekt in Europe, it is just taking chashing cultures seriously.","post_message":"NEW WONDER-GIRL OF FRANCE FAR RIGHT..."},{"comment_id":"10156036512370294","commenter_b":"Why doesn't she just create her own page?","commenter_a":"U r beautiful don't forget that","post_message":"'We recommend that you avoid focusing on certain body parts...' A mother and blogger who suffers from a chronic skin disorder that affects her face wanted to post a photo of herself without make-up to teach others about her disease. Facebook said no:"},{"comment_id":"10152847470758869","commenter_b":"that's pure BS... ok, Stewart is above the silly vampire stories here, but Binoche is one class above her throughout the film ... and in general","commenter_a":"I haven't seen the film, but I highly doubt that Binoche is nondescript: her screen 'presence' is astounding.","post_message":"“It is [Stewart], rather than Binoche, who lingers in your mind when the film is over.”"},{"comment_id":"10154277505591509","commenter_b":"At the end of the day, Banning Muslims from this country isn't going to fix the problem. They will find another way to hurt us. It's an ongoing threat that's not going to stop unless you eliminate the threat.","commenter_a":"I've never seen so much racism in my life, say it ain't so, but the comments and the reactions are very disturbing.","post_message":"\"The fact is what Donald J. Trump said yesterday disqualifies him from serving as president,\" The White House Press Secretary Josh Earnest said Tuesday. @webpagelink"},{"comment_id":"10153218753159270","commenter_b":"God will deal with this! He did it once.","commenter_a":"But your only going to enforce Christians to marry gays, but muslims can do whatever they want?","post_message":""}]
