[{"comment_id":"10154658986437034","commenter_b":"Stop illegal immigration!!!!!!!","commenter_a":"Is it too early to begin impeachment proceedings???","post_message":"THE WHITE HOUSE. We are now exactly 3 weeks into the Trump presidency. Thoughts?"},{"comment_id":"10153311050083037","commenter_b":"Just remember these are people fleeing terrorism NOT terrorist! Living breathing people who are desprete. THEY HAVE NO LESS RIGHT TO DO THAT THEN YOU DO... just because an accident of birth MADE YOU AN AMERICAN","commenter_a":"That is assault, and the spitter better be charged.","post_message":"'It sickens me to know that no matter how hard I try, there still exists a blur between myself and the decency a human life entails,' said the student."},{"comment_id":"1788538208028189","commenter_b":"those look hellllllla good 😍😍😍","commenter_a":"'@username LOL DUDE","post_message":"Insanely delicious."},{"comment_id":"10158795471470206","commenter_b":"My smartphone is a machine-gun!","commenter_a":"Journalism....there's the headline, then there's the complete opposite being stated in the article. Maybe the journalist just didn't understand that big word 'refuted'.","post_message":"The Superior Court of Justice decided to punish the players for failing to play their match."},{"comment_id":"10154160437056943","commenter_b":"Of course she did !","commenter_a":"Yes","post_message":"Share if you agree!"},{"comment_id":"10152561774511813","commenter_b":"Gigantic assholes.They should both be ass-raped, and have the first miracle ass-babies. See how they feel about the issue then.","commenter_a":"ACLU Are you helping folks like this from gov't overreach? @webpagelink","post_message":"Are these people who we want to make decisions about a woman’s reproductive care? Tell politicians: don’t turn back the clock on women’s healthcare. @webpagelink"},{"comment_id":"1100002276704629","commenter_b":"Whats more important to the RNC? Having Hilary as President or winnning the Presidency with. Trump, a Republican. They need to listen to the people .","commenter_a":"This would most certainly put Hillary Clinton in as first female pres.","post_message":"Should Romney run as an Independent against Trump and Clinton?"}]
