[{"comment_id":"1116402168438318","commenter_b":"Darren VM They don't want the imbecile either, probably why he ran here! LOL","commenter_a":"I don't understand how this humiliates Obama. I don't understand why Michelle is included in this. I don't understand why any sane American will be for humiliation of an American President regardless of agreement on issues.","post_message":"Obama may think he's Europe's favorite politician, but Queen Elizabeth just made a stunning announcement that put Obama right in his place.  You know Michelle was furious when she heard about this."},{"comment_id":"10154151440809087","commenter_b":"Hillary is for women. I don't blame her one bit, those whores knew Bill was married!","commenter_a":"In 1978, Bill Clinton violently raped Juanita Broaddrick in a Little Rock, Arkansas, hotel room, then, as he was leaving, looked at her bloody lip and said: 'Better put some ice on that. Corroborated by five contemporaneous witnesses Knowing full well about Bill Clinton proclivity to sexually assault women, about three weeks after that rape, Hillary Clinton cornered Broaddrick at a party and said, pointedly, just want you to know how much Bill and I appreciate the things you do for him. Do you understand? Everything you do. In the early 1990s, Bill Clinton invited a young female staffer to his hotel room at the Excelsior Hotel in Little Rock, dropped his pants and said, it. As CEO of an organization, Bill Clinton had a young female intern just months out of her teens, perform oral sex on him while he made business calls. That girl name was Monica Lewinsky. ...","post_message":"#BREAKING: Former Utah governor Jon Huntsman's shocking call for Trump to quit comes one week after saying he planned to vote for him."},{"comment_id":"10152950745681717","commenter_b":"Just like allowing women turned it into a coffee klatsch, eh, Huck? With each passing day, Republicans make the USA more of a laughing stock and pariah state. If we didn't have this economy, we'd be treated like North Korea.","commenter_a":"What does he know about the US Military? He never served in it.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1037623106257736","commenter_b":"Many foreigners are required to take English in school unlike Americans.","commenter_a":"if you want to go to murica you have to speak engrish","post_message":"A study found that 77% of immigrants have high school diplomas and over 40% graduated from college."},{"comment_id":"1695743490702170","commenter_b":"'@username Hillary should be in Prison!!!!","commenter_a":"I'm 18 years old. This will be my first election to vote in. I'm proud to say that I am supporting Donald Trump! Save my generation, Donald! #MakeAmericaGreatAgain","post_message":"I want to win for the people of this great country. The only people I will owe are the voters. The media, special interests, and lobbyists are all trying to stop me. We won't let that happen! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"10153856538795575","commenter_b":"Great post😀","commenter_a":"People say that Mr Trump doesn't have a platform, that he just wants to make America great again. I have something to say about that, Donald Trump is not telling you his plan he's giving you an outline. Why? Every time he brought something to the table, the other candidates take it and run. Such as immigration, the wall and other issues. I can guarantee you that he won't give you his full plans in detail until he standing at the podium next to one of the Democrats. That is when he will reveal everything. He doesn't need to do that now. Donald Trump is a visionary. He doesn't go into business without a strategy, and a form of negotiation already set. This man is prepared in business and it will be prepared when the time is right in a debate. He is a brilliant man, and he will not ...","post_message":"CHAOS in Alabama --  20,000 EXPECTED AT TRUMP RALLY!"},{"comment_id":"10153379305754205","commenter_b":"I was more surprised that Kenny Rogers was still alive, but at what cost? What has happened to his face?","commenter_a":"Typical intolerant liberals. Always pointing fingers and putting words in people's mouth. I think your ignorance is actually funny and the final laugh will happen next January. You will have a reason for 8 years of your hate and intolerance.","post_message":"Kenny Rogers Loves Donald Trump"}]
