[{"comment_id":"895356030506185","commenter_b":"Saudees R disgusting devils.","commenter_a":"Saudi regime should be removed out of power and kicked out of the country.","post_message":"What do you expect of the #Saudi aggression against #Yemen? Raise your voice by taking part in our poll: www.presstv.ir"},{"comment_id":"10154079954761833","commenter_b":"hopefully some illegal alien or muslum will off her with a hammer .","commenter_a":"More people are killed with hammers in the US than guns each year. Why isn't she calling for tool manufacturers to be held liable?","post_message":"When Hillary Clinton says that the firearms industry is only business in America that is wholly protected from any kind of liability,\" she is not telling the truth. Gun manufacturers and companies are responsible for bad products. What they are not responsible for are bad people who misuse their products."},{"comment_id":"944373212266686","commenter_b":"Planned Parenthoods primary function is abortion. Enough said. Defund it.","commenter_a":"Only 3% of Planned Parenthood's funding goes to providing abortion. None of that money comes from taxpayers. Defunding Planned Parenthood means defunding millions of dollars in preventive care, cancer screening, contraception (which reduces abortion), STI screening, and other such essential services. I'm pro-choice, but if you guys have such a problem with abortion, why don't you just campaign to force Planned Parenthood to stop providing abortion services and leave everything else intact?","post_message":"Wow."},{"comment_id":"10152572021501680","commenter_b":"Jew haters","commenter_a":"This is not the United States of Israel.","post_message":"Israeli officials rushed to meetings on Capitol Hill, trying to calm a furor created by Benjamin Netanyahu’s planned speech. It didn’t work. @webpagelink"},{"comment_id":"10153045091301336","commenter_b":"YOU CAN BET YOUR LAST PENNY THAT MR OBOMO HAS HIS GUNS, PLURAL..SHOULD THEIR CHILDREN BE REMOVED, ALL THOSE THAT ARE MAKING THESE LAWS ..HOW ABOUT REMOVING THEIR CHILDREN, THEY ARE IN DANGER IF THERE IS A KNIFE IN THE KITCHEN..OH THEY WANT OUR GUNS..WE MUST STOP THIS NOW..THE CRIMINAL WILL NEVER GIVE UP THEIRS. THEY ARE STOLEN SO NOONE KNOWS UNTIL THEY ARE SHOT SO,THEY CAN ROB THEM.WE HAVE THE MOST STUPID THINGS TO OBJECT THOSE CHILDREN BEING LOVED AND CARED FOR..GET THAT LAWYER AND SHOW THEM YOU HAVE RIGHTS..GO GET THOSE LITTLE ONES WHO ARE NEEDING YOUR LOVE..PLEASE AMERICANS STAND UP FOR THESE PEOPLES DILEMMAS . DEMAND THEY GET THOSE BABIES..GOD BLESS THEM TOTALLY !","commenter_a":"well we better not let foster parents that have a car,knife, prescription drugs,dogs,plastic bags,power tools,bow and arrows,swimmimg pools etc., cause all of theses items can kill!! Get real!!!! The government is trying so hard to take our guns away from us !!! They don't care about these children!! They just want control of our guns and they don't care if children have to stay in orphanages with no hope of having a family to love them!!","post_message":"“I want to help some of these children that don’t have the luxury of a family to love them. Everyone deserves to be loved and cared for.” Valerie and Brian Wilson were denied their request to serve as foster parents because they have legal concealed-carry permits. WATCH more from their interview on 'FOX & Friends Weekend': @webpagelink"},{"comment_id":"10153827416061438","commenter_b":"Lol...really?She may be a whackjob but looks wise, she is a stunning women.","commenter_a":"It was pitiful and tragic to watch and it was clear that she is a desperate, washed up, narcissistic, actress whose looks are fading and relies upon her melodramatic sexuality rather than any improvisational or theatrical skills. Her girl, delivery was worse that the sound of a dentist drill and it was more emetic than aphrodisiac. The audience was truly stunned , as if they were witnessing the senile ego of a down and out prostitute consumed, devoured, by her own inflated ego turning tricks in the parking lot. Her exaggerated performance wreaked. It almost seemed cruel to not instantly cut to a commercial. It was truly wretched. Mr. Ed pissing on stage would have been a great improvement! And I sure that horse is dead!","post_message":"If you were left scratching your head, here’s a quick explanation."},{"comment_id":"10153507200311336","commenter_b":"Cool end abortion I'll send all the mothers that can't afford to take care of their kids to you.","commenter_a":"Amen! I can't believe people are so desensitized to what is happening all around us. It is our duty as human beings to stand against this, which is actual murder. Abortion is wrong at any point and specifically aborting a baby at 24 weeks, the same time they can live out of the womb is just completely inhumane and murderous.","post_message":"ICYMI: \"Destroying innocent life and harvesting human organs is beyond barbaric -- it is unimaginably immoral, grotesque, and evil,\" writes 2016 presidential contender Gov. Mike Huckabee."}]
