[{"comment_id":"1195052803848081","commenter_b":"No more illegals. Go trump","commenter_a":"Trump rocks . Save Americans from drug cartels. Sanctuary citys and organizations promoting murder","post_message":"New polls show Trump is appealing most heavily to a certain kind of Republican voter."},{"comment_id":"10154463724150329","commenter_b":"@username because I don't keep people around who are ignorant and misogynistic pigs, such as yourself. Get a grip and show some fucking respect. Sitting in your parents house being a troll isn't gonna get you anywhere. Also, alot more women are feminists than you would think, @username.","commenter_a":"Wear whatever the fuck you want. Just dont expect everyone to compliment you.","post_message":"\"Bikinis just don't look nice on plus-size women.\""},{"comment_id":"935444853215236","commenter_b":"And keeping illegals from working the harvests here will have a devastating effect on our economy.","commenter_a":"Ummm,sorry but fuck the farmers then. If you have to use illegal immigrants for less than minimum wage in order to make your business work, you do not deserve to be in business. Americans are gonna have to learn to put down the bag of cheeto's and do some actual work or these immigrants need to be legalized,be paid a fair wage and pay taxes like the rest of us. When they try to do what they do with TV's and cellphones and have it made with slave wages in other countries,we need to not allow them to sell their products here or fine them to the point of it not being overly profitable by doing this. With that being said ,same needs to be done with TV, cellphone,shoes,clothes etc. People being used as slaves in order for these companies to make major profits and so everyone can afford these ...","post_message":"Turns out America's food production relies heavily on immigrant labor, and our farmers are NOT pleased."},{"comment_id":"948931958516352","commenter_b":"Somebody exterminate these animals !!!","commenter_a":"Just run their fat black asses over because black lives do not matter - at least not to black people so why should I give a flyin' fuk about 'em.","post_message":"Merry Christmas from Hillary, Barack, and Black Lives Matter!"},{"comment_id":"10153151930717426","commenter_b":"@username there is no double standard. One group enslaved, tortured, raped and brutalized a race, and fought a war to keep their slaves (states rights). And the other called a race that did all the above to them devils. No comparison.","commenter_a":"Who cares about the names of the schools? Does it further rasicsm? No. Are kids being taught rasicsm? No. Anything can be offensive as \"being offended\" is subjective. Will we then denounce anything named after Malcolm X because he was a Muslim who believed that all black people are Gods and the white man is of Satan? Now that's offensive.","post_message":"She argues the name represents a “history of racism.” There are also two local schools named after J.E.B. Stuart as well as other schools named for Confederate leaders. Do you think this will/should change?"},{"comment_id":"1034412946618453","commenter_b":"Shut up","commenter_a":"The end of life and nature. I miss to see the destination of these individuals and their satanic groups. #SuicideInTheNameOfFreedom","post_message":"Hopefully more players will be encouraged to come out"},{"comment_id":"1179936415364556","commenter_b":"No but it might save a few Americans! Instead of worrying about illegals they need to be worried about their own selves!","commenter_a":"Hows those gated estates working for you and Georgie .","post_message":"Says the British-Lebanese human rights attorney..."}]
