[{"comment_id":"10152967828847061","commenter_b":"Yes legal immigrants ma'am","commenter_a":"I am ashamed at the negative narrow minded comments. Check your heritage. We are all immigrants","post_message":"America Ferrera to Donald Trump: Thanks, your comments will send more Latino voters to polls: abcn.ws/1Iw7NNn"},{"comment_id":"916358841790504","commenter_b":"Gee Sara. you really ARE a blonde.","commenter_a":"Even religious organizations support planned parenthood. Your turn, republicans. Now you can't even use your Christian arguments...","post_message":"Fifty-six religious organizations are standing up in support of women's health and rights."},{"comment_id":"10152777603232093","commenter_b":"Idiots","commenter_a":"I say bring a fire truck and water there down. Keep then at a distance.","post_message":"15 officers have been injured in Baltimore riot, 2 still in hospital; 2 dozen arrested..... @webpagelink"},{"comment_id":"569672173222127","commenter_b":"Why does this women even receive a paycheck? I'd rather they give that money to a homeless woman in front of a 7-Eleven. You'd probably even get smarter conversation.","commenter_a":"Wasting your breath talking to these Trump members on his staff. They're like the movie The Stepford Wives! I think they all got their brains reprogrammed to say exactly what Trump wants & needs them to say to keep him looking sane!! It's scary!!","post_message":"''Alternative facts' are not facts. They're falsehoods.' Sean Spicer, Conway, and Trump tried to lie about the size of the inauguration crowd, but Chuck Todd didn't let them get away with it.   Shared by Occupy Democrats, LIKE our page for more! Video from Meet the Press."},{"comment_id":"1193282647400517","commenter_b":"If she was White n this said about Hillary she then would be in jail!!!' Evil","commenter_a":"Then arrest her!","post_message":"OOPS, Another BLM moron gets what they deserve for making violent threats, this time against The Donald. [READ BELOW]  Can we get 5,000 'LIKES' to support classifying BLM as a hate group?"},{"comment_id":"805710002902059","commenter_b":"But no one will ever do anything. She is above the law","commenter_a":"My biggest problem with Hillary Clinton is the fact that she condones an abortion minutes prior to birth, leaking national security time limits during a nationally televised presidential debate. She has been held non-accountable for any of her mischievous, murdering, actions. If she gets in she will be following Obama's legacy, and our country is doomed","post_message":"ARREST!"},{"comment_id":"1067105896689813","commenter_b":"She's a bitch !!!!","commenter_a":"I've always believed we get what we've paid for .","post_message":"Do you support or oppose the stand these officers are taking?  LIKE Opposing Views for more breaking news and anaylsis"}]
