[{"comment_id":"953884527999046","commenter_b":"SCUM","commenter_a":"Ryan's as bad as the great imposter Obummer....","post_message":"BARACK OBAMA Finds Friend In “Fundamental Transformation Of America”: Shocking Way Ryan Betrayed Americans With $1.1 Trillion Bill Funding for Sanctuary Cities, benefits for illegal aliens, fully funded refugee programs, quadruples number of work visas for foreigners, release of criminal aliens, tax credits for illegal aliens and more..."},{"comment_id":"10156412412225354","commenter_b":"Fire the hoe","commenter_a":"I guess they suspended her because her job, if she is actually a reporter, is just that, report the news and don't add to it or shade it with your opinion. If you want to share your opinion get a job as an editorial writer but don't pretend to be a reporter if that is what you would rather do.","post_message":"What liberal media bias? That's just a figment of your fevered rightwing imaginations."},{"comment_id":"10154680168205575","commenter_b":"@username that's a woman I would vote for","commenter_a":"You know, enough with this BS, I hope Trump wins again in 2020, and then Pence follows. These deranged off the rails nut cases think they lost now, just wait.","post_message":"Uh oh . . ."},{"comment_id":"10152784784428145","commenter_b":"Huh!! Woman abuser and she's a dummy for staying with him! Jerk!","commenter_a":"I guess his girlfriend is a little thug to uhh. Wow!! It should be clear now who really was the trouble maker.","post_message":"UPDATE: Zimmerman has posted bond and is out of jail. @webpagelink #wftv A judge set George Zimmerman's bond at $5,000 and ordered him to surrender any firearms. His attorney, Don West, said Zimmerman is accused of throwing a wine bottle at his girlfriend earlier this week. #wftv Reporter Blaine Tolison is live with the latest on #WFTVatNOON"},{"comment_id":"712201488878460","commenter_b":"Just can't stand that a black woman dresses better than you eh? Jealousy is a sin ya know.","commenter_a":"funny how ms obamas wardrobe has gotten mote expensive over the years. guess jcrew too cheap for her now. oh well, shes outta here soon anyways ;)","post_message":"Michelle Obama wore a familiar outfit last night ..."},{"comment_id":"10153007024072894","commenter_b":"He dumb why have that baby get close to him if he didn't know for sure if she is his baby he should've got that done first","commenter_a":"Maury would have done it for free","post_message":"Chris Brown Files Petition to Establish Paternity of Daughter Royalty"},{"comment_id":"10153068492709411","commenter_b":"Thank heavens...............one revolting misogynist pig gone, but alas another is replacing it.","commenter_a":"RIP","post_message":"BREAKING:"}]
