[{"comment_id":"822624721167115","commenter_b":"The U S citizens land it crosses and Native Americans land it crosses should have the last word on this. Not some politician, or Lobbyist or any one who will make money off it. It looks to me that the land owners don't want it. VETO< VETO< VETO.","commenter_a":"Woot!","post_message":"A defiant GOP votes to fast-track Keystone."},{"comment_id":"10154398090436523","commenter_b":"She loves abortions. Of course her mother chose life for her. Lol","commenter_a":"Just look who they are and what their purpose is. This is just Evil and Horrendous!","post_message":"WATCH: Women's March on Washington, D.C."},{"comment_id":"10153583578957144","commenter_b":"they were chanting,Bernie,Bernie...:)","commenter_a":"Ah @username... no mention of the STANDING OVATION for Bernie at the end of the debate? You guys are so blatantly transparent in your shilling for HRC","post_message":"\"I'm not even answering that question.\""},{"comment_id":"10153693549314087","commenter_b":"Well Donald was a life long Republican","commenter_a":"Why are the rules in a way that you have to register so long before the actual vote? Isn't this a form of voter suppression? Ps. I'm not a trump supporter.","post_message":"\"They were unaware of the rules, and they didn't register in time,” Donald Trump said of his kids, Ivanka and Eric. \"So they feel very, very guilty.”"},{"comment_id":"10153848285134497","commenter_b":"In others words BITCH, BYE!! Am I speaking your language now?","commenter_a":"But on a real level...this is what all parents should do with their offspring when traveling.","post_message":"\"Look at that, she not even stirringwhat a perfect sleepy angel!\""},{"comment_id":"912438275556018","commenter_b":"I'll bet you make your Momma proud, dumb ass","commenter_a":"Thank you Obama.","post_message":"You got to check out this interview... Could he possibly be any DUMBER??"},{"comment_id":"1078464325543429","commenter_b":"@username , no not dictating whatsoever. She can spend as much as she wants; I won't vote for her.","commenter_a":"You're spending so much personal time with this little girl. Are her parents campaign contributors?","post_message":"I’ll do everything I can to make sure that DREAMers like Karla never have to worry about being separated from their parents."}]
