[{"comment_id":"1557321691221611","commenter_b":"karma is a bitch at times","commenter_a":"When is it anybody else's business! Tell them to butt out!","post_message":"Way to go mom!!!"},{"comment_id":"10155360412381509","commenter_b":"She's a nasty looking monkwy","commenter_a":"Michelle Obama is the most elegant, intelligent and intellectual First Lady's ever to grace the White House. This family will be missed!! God bless them!","post_message":"Over the past eight years, former President George W. Bush and First Lady Michelle Obama have been seen becoming increasingly chummy."},{"comment_id":"472128496314627","commenter_b":"Yeah lol she cray","commenter_a":"She was talking all kinds of mess about Prince. Maybe someone scooped her up for interrogation.","post_message":"Irish singer Sinead O'Connor was reported missing Monday a day after she went on a bike ride in the posh Chicago suburb of Wilmette and did not return."},{"comment_id":"10152776078426051","commenter_b":"Bet she's sorry after all those dollars were raised for his support. Selfish woman.","commenter_a":"Too bad that she thinks more of her secondary family then she does your husband in her own child","post_message":"Remember the woman who forced her husband to choose between her and a baby with Down syndrome? Well, here she is."},{"comment_id":"10153316472741336","commenter_b":"Hell no she shouldn't lose her job, she should of took another pic with her legs wide open !!!","commenter_a":"@username I agree!!","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"1309663882411384","commenter_b":"Thank you! Someone with a little logic about the abortion! It should not be tax payer funded and it should NoT be past 12 weeks and it should not be used just because some idiot woman didn't use birth control and doesn't wanna deal with the consequences of her actions !","commenter_a":"I can not believe that abortion is a right to be discussed in 2016. It is a womans right to decide! It is our bodies!! As long as it happens before the 12th week...but women need to use their head and not use this as birthcontrol! Protect yourself if you don't want a kid! As I said, it is 2016 and we do have many types of birthcontrol!","post_message":"Obama's last stand"},{"comment_id":"10153124983097061","commenter_b":"fire her","commenter_a":"If she can't full fill her position she should step down.","post_message":"Kim Davis name removed from marriage license for same-sex couple: abcn.ws/1NrN92G"}]
