[{"comment_id":"10153480430267483","commenter_b":"I bet the sissy SOB would have never talked to a man that way.","commenter_a":"More businesses need to be like this. Its 2016 for heaven's sake. No one should be treated less than anyone else.","post_message":"\"Due to privacy laws, we are limited in what we can share, but in a situation in which a customer verbally abuses another customer or a Regions associate, we close that customer's account,\" a Regions Bank spokesperson said."},{"comment_id":"10153714584104087","commenter_b":"She's a pure Red in disguise.","commenter_a":"The PEOPLE are speaking. She's winning by a lot of votes.. doesn't matter what the internet thinks. Real people are voting, and real people are voting for her.","post_message":"Fresh off a commanding win in New York, Hillary Clinton has a 13-point edge in the biggest state up for grabs in next week's primaries."},{"comment_id":"10153554741380950","commenter_b":"Wait until those other prisoners get a hold of her. She will wish she was dead! Many of the women in there worry about their children, and don't take kindly to those who hurt children! She'll get hers! Karma right around the corner!","commenter_a":"Do it to her!","post_message":"The 4-year-old boy's stepmother put his legs in 130-degree water for at least 20 minutes; it would have taken just 4 seconds to scald the child, prosecutors say."},{"comment_id":"10153461331093635","commenter_b":"Do you know common law as well as you think you know the Bible? Courts of common law MAKE law. While Congress enacts statutes, the courts write case law. So, let's put to rest the ERROR that courts don't make law. If you don't believe me, find me the statute in your state that defines the elements of slander. The decision in Obergefell doesn't require that you do anything, unless you are a marriage officiant, so I don't see how you can refuse to obey the decision.","commenter_a":"The Supreme Court \"ruling\" is NOT the Law! It's only the insane opinion of 5 corrupt arrogant judges that think they can wield more authority than God Almighty!","post_message":"No Gay Marriage in Alabama, Chief Justice Roy Moore Says"},{"comment_id":"1048574538534260","commenter_b":"Please vote for Trump , Wisconsin !","commenter_a":"The career politicians in the runnng - all of them except Mr. Trump, have had many opportunities to do their job of protecting us, providing good paying jobs, help get a handle on the ever-increasing debt - - and they have done Nothing, but bask in the political paradise they have created - - getting paid with our valuable tax dollars to do nothing but make matters worse. I hope Wisconsin voters will not allow themselves to be bamboozled into voting for more of the same for the next 4 years. I don't think this country could take it. Trump 2016 !c","post_message":"My new radio ad, airing today in Wisconsin! See you soon! #MakeAmericaGreatAgain"},{"comment_id":"10154251884613701","commenter_b":"Oh my wow...this bitch right here is why we need to stop immigration...","commenter_a":"It kills me that LGBT wants special rights when they are going against God's Commandments. It's a fact that the LGBT have mental illness, look it up. America was not built on Gay rights. Also what about people of color we are still fighting for our rights in 2016.God commanded that Marriage should be between a man and, a woman. We are living in the last days. Sodom and Gomorrah. You can't say you believe in God when God condemns homosexuality.","post_message":"The 1969 riots at the Stonewall Inn launched the modern gay rights movement and the annual New York City pride parade."},{"comment_id":"1061054770617718","commenter_b":"I'm voting for you Hillary!!!","commenter_a":"That will be hard to do from Leavenworth. But if she thinks she can go for it. Bill will be too busy I am afraid to help though.","post_message":"“It’s clear she knows how to get things accomplished in these crazy political times. She’s still standing after decades of Republican attacks, and she’ll force them to the table once in office.” -Iowa Starting Line"}]
