[{"comment_id":"10153181342983812","commenter_b":"I do agree not to go looking for trouble. Often times, ya get more than ya bargained for ;)","commenter_a":"You can not go looking for trouble, find it, then decide you don't want said trouble. Its already too late!","post_message":"Relatives held a candlelight vigil to honor the life of Tammy Meyers. @webpagelink"},{"comment_id":"975168282518593","commenter_b":"Better be sure. Our us h hospital are not allowing this.....What. If. Patient wants non Islamic nurse. Because is this practice?","commenter_a":"STOP with the offending of muslims.....this is the United States of America...land of the free.... Who gives a crap if your offended....","post_message":"Whoa!"},{"comment_id":"10153475900679705","commenter_b":"Excuse me, but what kind of a MOTHER leaves her DAUGHTER behind because there's no seat for her?!","commenter_a":"There's very easy way to avoid these things. Don't piss about at the last minute and end up being the last person to check in. Guaranteed a seat on the plane.","post_message":"Unbelievable."},{"comment_id":"1123460471025521","commenter_b":"The mother is as full of crap as the child.","commenter_a":"Instead of asking the whole world to conform to ones abnormality or difference how about assisting that person to deal with their abnormality/difference in such a way as to not draw negative attention. If one is a diabetic the whole world does not need to eat a diabetic diet. If one has a limb removed does the whole world remove a limb? Honestly I see no difference. We all have differences and we learn to deal with them, not expect others to suffer or deal with it.","post_message":"Watch this amazing video as the mother of a \"trans\" teen makes the most outrageous claim possible about North Carolina's new HB2 law.   What do you think about this mother's claim?"},{"comment_id":"10153753361057464","commenter_b":"That's right! Those are AR-15s. These gun control people just don't have a clue.","commenter_a":"Ted you need to do something about this gun control crap. Like stop it","post_message":""},{"comment_id":"10153509889673132","commenter_b":"Is there a required dress code? Why are both women wearing the exact 2 shades of blue?","commenter_a":"I thought the Queen always wears a hat in public. I'm surprised to see her here without a hat. I love the Queen.","post_message":"Prince Harry and Queen Elizabeth II make quite the team!"},{"comment_id":"1351641891520492","commenter_b":"YOUR SENILE. SHE SMEARS HERSELF.","commenter_a":"You have my total support Hillary! Every time I come to your Facebook page and see all the horrible Trump trolls posting lies and rumors about you, it makes me even more committed to support your campaign! They are proof that what you said about the deplorables basket was not a gaffe but an unfortunate reflection of reality. I am so happy to see you looking so healthy and recovered today. Next stop the White House!","post_message":"This team is the only thing left that can stop Donald Trump.  We’ve got to leave it all on the field here, and we need contributions from Facebook to reach our goal of 100,000 by midnight. Will you chip in? hrc.io/2d4999O"}]
