[{"comment_id":"1773738762840165","commenter_b":"Yea but she doesn't wear that dress well as Melania .Petty old lady","commenter_a":"This is just tacky and remarkably low class.","post_message":"10/10 burn. 🔥"},{"comment_id":"10153069048676770","commenter_b":"Both are bitchs","commenter_a":"I see that Meryl has picked her poison.","post_message":"'How can people like Meryl Streep and Hillary Clinton envision themselves as rebels when they are the establishment?'"},{"comment_id":"1030591920403417","commenter_b":"Sorry, obama was a bad idea, and hillary was worse.","commenter_a":"Of course it's not. We knew what he was going to be, but his voters were too stupid to listen. They refused to heed either his own goddamn words, or the words of anyone else saying 'THIS IS A BAD IDEA.'","post_message":"Trump is assembling the wealthiest cabinet in history — so wealthy that its members have more money than the bottom 1/3 of American households combined. That does not sound like an 'anti-establishment' administration to me."},{"comment_id":"880895332040553","commenter_b":"'@username Didn't you get the memo? Pussy Liberals are NOT allowed to live in Texas... GET OUT","commenter_a":"Thank you @username for picking Mike Pence as you're running mate. Thank you thank you thank you God bless you both","post_message":"Mike Pence won big. We should all be proud of Mike!"},{"comment_id":"1003105503069410","commenter_b":"Taryn ignore her, she will forever think she is right about everything even though she's not","commenter_a":"Or we could just let every woman decide for herself.. If you don't agree with abortion, just don't get one. But that doesn't mean other people should be forced into the way you think..","post_message":"Not a bad thought - Let us know if you agree!"},{"comment_id":"10154267977076756","commenter_b":"Really?....Belgium. Some of the nicest people in Europe. There is no reason in these people. They just hate everybody. Sympathy to the Belgian people. I have visited your country and was impressed with your quality.","commenter_a":"So terrible...","post_message":"NPR is following the deadly attacks in Brussels. -- At least 30 people died in explosions at the airport and a metro station.  -- Some 200 were injured, including at least one U.S. service member and his family. -- ISIS has claimed responsibility for the attacks, and police released a photo of a suspect."},{"comment_id":"634164716716710","commenter_b":"They can go suck a weenie!","commenter_a":"When the cold wind blows, I will stand with the Christians. We will stand together.","post_message":"This is the only logical end for the hate for Christians that the militant left have whipped themselves up into."}]
