[{"comment_id":"10153181017133690","commenter_b":"Okay white terrorist","commenter_a":"Christian Terrorist","post_message":"\"This was not a dispute over a parking space, this was a hate crime,\" Mohammad Abu-Salha, the father of the two slain women, said. \"This man had picked on my daughter and her husband a couple of times before, and he talked with them with his gun in his belt. And they were uncomfortable with him, but they did not know he would go this far.\" @webpagelink"},{"comment_id":"960457477322681","commenter_b":"Hunt these cops! Good Germans would say this!","commenter_a":"police state","post_message":"Officer Thomas Webster was just found not guilty of assault... even though he was caught KICKING and UNARMED MAN IN THE FACE as he obeyed police commands.  This is America, 2015. Not the Jim Crow Era.  From (Y) Counter Current News - MBD"},{"comment_id":"587883731397342","commenter_b":"Takes one to know one Babs!","commenter_a":"Who cares","post_message":"Barbra Streisand blasted “narcissist” Donald Trump in a 1,228-word Huffington Post op-ed."},{"comment_id":"10153081593500090","commenter_b":"She is also a terrible so called human being !","commenter_a":"esta esta mas choteada que cantante desafinado","post_message":"She may be hiding emails, but there's no hiding this fact: Hillary Clinton would make a terrible president.  Tell us WHY you don't want another Clinton in the White House: @webpagelink"},{"comment_id":"1238637239481907","commenter_b":"ugly ungrateful woman -","commenter_a":"He better say that. Else Lady Chewbacca would beat his ass.","post_message":"Michelle Obama just brought down the house with a passionate speech at the Democratic convention. It's safe to say President Obama was a fan of it:"},{"comment_id":"10153068039414586","commenter_b":"Bitch if they could ride a Real tiger they would","commenter_a":"Uhh hello, theres elephants that are raised domestically in zoos and sanctuaries and in places where they're trained. And how would you know they're beaten? And btw horses started out as wild animals so your argument is mute. Pick a side, not just a specific animal","post_message":"PROOF that you don't need to use real animals to amaze a crowd.   CC: Ringling Bros. and Barnum & Bailey Circus #NotOurs2Use   SHARE if you're glad Katy Perry chose NOT to use live animals! #SuperBowl"},{"comment_id":"944224732371213","commenter_b":"Yeah, she didn't want to have sex with an Orange baboon.","commenter_a":"I guess Trump would know a lot about attitude. He has a very bad attitude and has the emotional age of three!","post_message":"\"She gained a massive amount of weight, and it was a real problem. We had a real problem. Not only that, her attitude,\" Trump said Tuesday morning."}]
