[{"comment_id":"582823241912998","commenter_b":"Strong, smart, accomplished, patriotic, conservative, compassionate & gracious PLUS stunningly beautiful & elegant, too -- truly she is in a class all her own!","commenter_a":"Since when does a porno star bring class to any situation?","post_message":"As first lady, she will be 'our new Nancy.'"},{"comment_id":"613597282122381","commenter_b":"You don't see conservatives trying to preserve the right to vote? Of course they are. Why is it perfectly ok in your eyes that we have to prove ourselves to exercise our right to bear arms, but having to have an id to vote is racist? Mass shootings are still a rare occurrence in our country.","commenter_a":"When Obama's secret servicemen are the first to lay down their guns, and he doesn't get shot, I will believe \"gun control\" works.","post_message":"I support it. Do you? Occupy Democrats"},{"comment_id":"10154173812304205","commenter_b":"As long as she keeps getting elected, she wont feel the need for change!","commenter_a":"If she was a basketball coach, she'd be fired. Continue to work for your district in CA, but someone else from another part of the country like for example a representative from Wisconsin or Michigan should lead. The Democrats are pussies.","post_message":"Nancy Pelosi wants to assure you that everything is fine in the Democratic party. She is wrong."},{"comment_id":"10152909977971051","commenter_b":"I agree kaelyn! Things like this should be an eye for an eye with this sick twisted woman!!","commenter_a":"I think 9 yrs is not enough but she should get the same treatment she gave her son. Pour boiling water on her starve her. And trekking police she was a troubled child cuz of her crack head mother is a tactic to get out of more jail time!!! Pour baby I feel for the kids","post_message":"This woman was embarrassed by her 9-year-old son’s disability – so she decided to torture him."},{"comment_id":"1067333573359551","commenter_b":"Latinos with Hillary!!","commenter_a":"Thank you Hillary for running and you've got our votes!","post_message":"This is a moment when we all need to stand together. Watch live as Hillary speaks on the terrorist attack in Orlando."},{"comment_id":"10153722562581800","commenter_b":"Gosh, I hope you are not able to reproduce. Idiot!!!","commenter_a":"I think no one bars militant Christians from the country, or seeks to deport them, just because Christians are responsible for most acts of violence and terror in this nation.","post_message":"Mike Huckabee went on an alliteration spree on cable news recently, saying the following about the response to the Paris attacks: \"[Democrats are] more interested in protecting the image of Islam than they are in protecting Americans...If these were Militant Methodists, Extreme Episcopalians, Bad Boy Baptists, do you think we would be afraid to say that?\" \"No we would not be afraid to say that. Because Bad Boy Baptists is an awful name for a terrorist group, but a GREAT name for your Christian Soul Rock, one man, bass-only album.\" - Trevor Noah ►Watch now: @webpagelink"},{"comment_id":"1509437802422806","commenter_b":"All you ladies with your agendas should probably put it to ACTUAL LEGITIMATE use and aim it where it belongs: at your incoming government. I for one, have never just gone around grabbing random pussy or publicly proclaimed that I wanna fuck my own offspring. Actions speak so much louder than your weak ass words. Pick the RIGHT battle, for once!","commenter_a":"Call me crazy, but this dudes most impressive moments happened in a wheelchair on a kids show. So...he's banging an old whore. Whoopity-Do! I don't get and never have gotten the hype. Lol","post_message":"Drake won 2016."}]
