[{"comment_id":"887259011404129","commenter_b":"She smacked him down with that","commenter_a":"That was my favorite point in last night's debate. It really showed who has done more for our country in the last 30 years.","post_message":"\"I'm happy to compare my 30 years of experience with your 30 years.\" —Hillary to Trump #Debate"},{"comment_id":"10154692887376336","commenter_b":"Deplorable Californian here","commenter_a":"Ga.here","post_message":"Live Now: Donald J. Trump speaks in Columbus, Ohio."},{"comment_id":"1182482298496971","commenter_b":"Praying🙏","commenter_a":"Get well soon.","post_message":"Prayers are with the Fox News family today..."},{"comment_id":"1652238444998373","commenter_b":"White girl runs around in black face and its fine, yet if I were to do it the liberals would lynch my saltine american hindquarters.","commenter_a":"She went full retard","post_message":"Wait,... what?  @webpagelink"},{"comment_id":"1444134625606563","commenter_b":"Lay off the booze lady","commenter_a":"Michelle Obama plagiarized Saul Alinsky for her 2008 DNC speech never once attributing her words to his writings. Would seem Michelle gets a pass when it comes to plagiarism, everyone else gets bashed.","post_message":"\"I'm a speechwriter. This is what speech writers do. You're looking for something improper, I don't see it.\""},{"comment_id":"837605946394236","commenter_b":"Another dumb southern woman","commenter_a":"If y'all vote Killary in, You are the dumbest people that walk the face of this earth. Obama has done enough damage. Military people do not want Killary as their commander and chief. If you think of no one else, think of our military. She has NO CLUE how to run this country.","post_message":"Donald Trump has landed at Dallas Love Field.  WATCH LIVE coverage of visit: @webpagelink READ latest updates & see photos: @webpagelink"},{"comment_id":"10154459002469714","commenter_b":"Heaven forbid, but you are right. She has bought and paid for this election, horrible, corrupt hag that she is.","commenter_a":"Hillary Clinton is going to be our first woman President.","post_message":"ICYMI: FBI director James Comey said Hillary Clinton was \"extremely careless\" in handling classified information, but recommends to the Department of Justice that Clinton not face criminal charges."}]
