[{"comment_id":"1578057615587695","commenter_b":"10 Days and she will be our president","commenter_a":"@username am I right Cody Martinez","post_message":""},{"comment_id":"10157614671450293","commenter_b":"Time to take car keys. Hope this turns out well.","commenter_a":"He may of said screw it and is partying in the infield at dega . Lol . But serious note hope yall find him safe","post_message":"Have you seen this man? He was last seen driving to Coldwater, Ala. to see his son. CLICK to see if you recognize him, and please contact police if you have any information:"},{"comment_id":"1552138465081005","commenter_b":"How does she not get dissy","commenter_a":"Matthew Boyd","post_message":"This record-breaking teenage gymnast is showing the world her incredible tumbling talent."},{"comment_id":"1191420990909535","commenter_b":"Really??? I use my pants to hide this dick!!!!","commenter_a":"I'm sorry","post_message":"Military intelligence... isn't. ~Will"},{"comment_id":"10153818246882293","commenter_b":"Leave it to mysoginists to make the case for feminists better than any feminist could.","commenter_a":"Women, get over it! You are way too thin-skinned, take yourselves too seriously, and get offended at the drop of a hat. Loosen up and quit being so tight-assed.","post_message":"If 75 percent of women told researchers they view Trump unfavorably, who is it that backs Trump?"},{"comment_id":"10153692267024087","commenter_b":"Li'l ol' ladies with landlines","commenter_a":"In New York,Hillary has a 4-point lead over Sanderss...There is no doubt that she will win N.Y thanks to black votes but by a small margin......She is so popular among African Americans despite that her husband sent 2.4 million black males in jails..It is difficult to explain or justify thier desire to vote in favor of their oppressor..She has 16 points ahead of Sanders in the city of Philadelphia (Pennsylvania) once again thanks to black voters.Hlllary clinton is unpopular among independents and blue collars .It will be impossible for her to win the general election in November without these voters.. ..Only Sanders can persuade independents,and blue collars to vote for democrats in the next election...Sanders is also the only leading candidate with positive favorability at the national level. .","post_message":"\"This is the best territory for him on the calendar,\" Hillary Clinton's campaign chairman John Podesta said of Bernie Sanders's recent wins. \"Most of those were Western caucuses. But when you look at what happened overall in this election, she's gotten 2.4 million more votes than Bernie Sanders.\""},{"comment_id":"1219604621413341","commenter_b":"A very large dick","commenter_a":"I was born and raised on Ohio and this man embarrasses me","post_message":"Here's a clue: She's not a 62-year-old man, but that's not all. It gets worse. Much, much worse."}]
