[{"comment_id":"1173415112684267","commenter_b":"Society is being destroyed by this abomination! Gay lifestyle brought the AIDS virus, now innocent woman and children are dying because of promiscuity, bisexual acts, and gay relationships! Sin has deadly consequences that all in society pay the price for! That's why Rian!","commenter_a":"I agreed ban same sex marriages.","post_message":""},{"comment_id":"988569754496111","commenter_b":"Wow, get jobs? because we kill all the whales every year","commenter_a":"I have no respect for the tribe. Why don't they get jobs and stop killing all the whales.","post_message":"The public weighed in tonight on whether the Makah Tribe should be allowed to hunt gray whales again >> @webpagelink"},{"comment_id":"10153451466636336","commenter_b":"That's why I tagged you in this lol","commenter_a":"Sarah Garvey","post_message":"NEWLY RELEASED: The official images from the christening of Princess Charlotte have been made public by Kensington Palace."},{"comment_id":"877406769042769","commenter_b":"Idiot ASS CLOWN","commenter_a":"President trump will take care of that","post_message":"ClashDaily.com"},{"comment_id":"10153539515518984","commenter_b":"The Feds own substantial acres of land in several of these states and when they pass these more restrictive rulings guess what? They exempt themselves from said compliance AND if they choose to return some of said land to the state, guess what? The state is forced to bring land into compliance. Tks AZ for joining with the 26 sister states in this fight.","commenter_a":"It gets worse and worse and yet our congress , senate, supreme court , fbi ,cia all seem afraid, They do not represent the people.","post_message":"These 27 states just made an epic move against Obama's federal power grab... they are not going to let Obama take over their states without a fight.  This is exactly the right move... share their strategy everywhere."},{"comment_id":"10152528871250667","commenter_b":"What union???","commenter_a":"They get enough through their union","post_message":"President Obama will call on Congress to require companies to give workers up to seven days of paid sick leave a year, a senior adviser said Wednesday. Obama will also take executive action to give at least six weeks of paid leave to federal employees after the birth or adoption of a child."},{"comment_id":"909436415764813","commenter_b":"@username is right. Our India is safe for females.","commenter_a":"India more safe than so-called muslim nations..its just that media show these news here and the other countries like pak n iran highlight such news of India.. they never show good things about India.","post_message":"The victim's mother said the men had harassed her daughter after they boarded the bus."}]
