[{"comment_id":"10153588505935329","commenter_b":"Arielle white people shit. Add this to the list.","commenter_a":"Ewrick Velasquez shark week!!!!","post_message":"Jaws IRL."},{"comment_id":"10154187252849657","commenter_b":"You are a very, very, very silly little women with no wisdom at all, and I doubt you ever had any. You are to old to think the way you do with lousy liberal logic.","commenter_a":"What I do understand is this, man is supposed to be smarter now than then, but yet the present man cannot product a document like the constitution. Isn't it sad that they are trying to destroy it because man cannot write a constitution now. The reason they can't is because they are not GOD fearing, like the founding fathers were.","post_message":""},{"comment_id":"10153224449077293","commenter_b":"If it happens without her name on it, fine, but she still had no right to do what she did up to now and she has to get re-elected which I doubt she will. What she did was wrong and I hope she stays in jail. The nasty hag is going to be rich anyway because there's enough idiots out there to give her $$$.","commenter_a":"Simply put...it doesn't...","post_message":"The question has arisen before."},{"comment_id":"10154327927746336","commenter_b":"Only thing that needs a brain is u Hernandez as u can't even spell my name which is right infront of u.. Thank God Trump is getting rid of all u illegals.","commenter_a":"Please refer to him as President Trump.. Thank u.","post_message":"This morning, Donald J. Trump tweeted out a message for Memorial Day."},{"comment_id":"1786349714946678","commenter_b":"Lol! She is a lunatic!","commenter_a":"She is a racist huh?","post_message":"Former Arkansas Gov. Mike Huckabee asked Monday if House Minority Leader Nancy Pelosi is racist after she said Housing and Urban Development Secretary nominee Ben Carson is \"disturbingly unqualified.\""},{"comment_id":"1847896892115179","commenter_b":"And what about the interface of other devices?","commenter_a":"There is no break through. It has always been there. Anyone heard of Tesla? Um hello...","post_message":""},{"comment_id":"10153476026331509","commenter_b":"ladies ... let me increase ur chances looool","commenter_a":"Looks like I'll be dead earlier than I thought lol","post_message":"Being alone and feeling lonely increases your chances of early death by roughly 30%, researchers say. Simply being in the presence of others may not be enough: @webpagelink via CNN Health"}]
