[{"comment_id":"1253236361399557","commenter_b":"This is how much hillary hates women. Hillary wants to bring in illegals who hate women. @webpagelink","commenter_a":"Trump is afraid of Hillary for one good reason and that is why he constantly threatens her with assassination. Hillary can win over Trump by force of argument rather than by force of fear. You Trump supporters aspire to fear and violence. We Hillary supporters to free speech and Civil Rights.","post_message":"On this day in 1973, tennis champion Billie Jean King defeated Bobby Riggs in the “Battle of the Sexes.” King went on to found the Women’s Tennis Association, the Women’s Sports Foundation, and Women’s Sports Magazine to support women athletes on and off the court."},{"comment_id":"10153382120572293","commenter_b":"They are not the same at all","commenter_a":"Deidri","post_message":"Why the analogy is important."},{"comment_id":"10152787006691545","commenter_b":"What time?","commenter_a":"I can't believe they just showed up out of the blue. There should have some fore-warning. *drum snare*","post_message":"About 30 members and supporters of Bloodstained Men, a nonprofit group based in California, held signs that read, \"Foreskin is not a birth defect.\""},{"comment_id":"1202477846449826","commenter_b":"Everyone must have nice hair & a nice outfit. Women have to put in more work Rich Nguyen","commenter_a":"You can pretty much say the same thing about men. If you come to an interview without a snazzy haircut or a fine tailored suit, I can bet that it becomes a disadvantage.","post_message":"Women shouldn't have to wear makeup to succeed at work."},{"comment_id":"10153489644226680","commenter_b":"@username Hillary 2016!","commenter_a":"I support Bernie but, in a democracy you don't always win. Clinton's big victory in NY is not the result of some sort of conspiracy. It is a result of counting the votes. I am not one of the \"Bernie or Bust\" people. Trump/Cruz are too dangerous to advocate some sort of 3d party campaign where Bernie is the candidate. When Ralph Nader took votes away from Al Gore, it resulted in George W. I do not want a rerun of that movie. I am not happy about how the race seems to have ended, but, Hillary got more votes than Bernie and that ends it.","post_message":"Hillary Clinton gets emotional telling the story of Sandy Hook Elementary principal Dawn Hochsprung, whose daughter is at the victory rally."},{"comment_id":"1554742308153991","commenter_b":"IM A WOMAN...A STRONG WOMAN...AND I SAY TRUMP 2016!!!!!!!!!!!!!!!!!","commenter_a":"Classless joker","post_message":"What do you think about President Barack Obama's statements regarding Republican women and Donald J. Trump?"},{"comment_id":"450455948478319","commenter_b":"Get off her fat butt and walk. That does not cost. Stop whining and exercise at home. Absolutely disgusting.","commenter_a":"Yet she has enough to do that fugly bozo the clown hair color","post_message":"Should All Welfare Abusers Be Arrested?  Comment 'yes' or 'no'."}]
