[{"comment_id":"1781827275423105","commenter_b":"Go Hillary! You're a rock star!","commenter_a":"Boom!! Mic drop!!","post_message":"EXACTLY! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154709341603984","commenter_b":"Jealous bitch","commenter_a":"Could it be Mark Cuban is trying to get Trump to look like he would sell his party out for similar money Hillary has taken? :Edited, nah he needs to find a way to ruin Trump. He is looking for a weakness to exploit. I'm sure of it.","post_message":"Billionaire Mark Cuban just stunned everyone with a jaw-dropping offer for Donald J. Trump that NO ONE expected. There's something he wants the Republican candidate to do, and he's willing to give something massive in return..."},{"comment_id":"421137708047770","commenter_b":"Lady, you're an idiot!","commenter_a":"Your amazing trying to explain to limited, CNN stupid reporter how dangerous Iran is. Thank god for you! I'd vote 4u any day!","post_message":"ICYMI: I joined The Lead with Jake Tapper to discuss my open letter to the Iranian Government. WATCH:"},{"comment_id":"10152828660804071","commenter_b":"Yes.Yes. The hookers have also existed forever. Its seeing where and who they recruit. thats what would shock you. These women aint street walkers or trailer park meth queens..","commenter_a":"So true.. Except the hookers, not sure about that.","post_message":"Some of these are shocking."},{"comment_id":"10154038089667293","commenter_b":"Unlikely? Really?","commenter_a":"I live abroad, and there is no escaping questions about Donald Trump on an almost daily basis. I'm often asked directly, \"He's not actually going to be President, though, is he? Can he be? Why are people supporting him?\" They think Americans have lost their minds, and there's tangible concern about what his presidency could mean for the world. Fortunately, I keep FiveThirtyEight handy and can show them how unlikely (currently) his election is, but American democracy has taken a huge (yuge?) credibility hit regardless.","post_message":"When your vacation turns into a lesson in \"Trump-splaining.\""},{"comment_id":"10155106719593132","commenter_b":"She probably was in on it. What woman in her right mind would move in with a man whose wife mysteriously \"disappeared\" just 2 months prior? Both had to know she wasn't coming back.","commenter_a":"Girlfriend needs to be scared now. Similar to the Lacy Peterson case. Very sad!!","post_message":"Elizabeth Sullivan appeared to have vanished two years ago without a trace."},{"comment_id":"1376753242362908","commenter_b":"o.k you're can't be racist . how about a whiney , hateful bitch ? yeah ,that suits you better .","commenter_a":"Outrageous!","post_message":"These people are insane."}]
