[{"comment_id":"658534947621213","commenter_b":"@username stay home then","commenter_a":"The Trump camp says Cruz is stealing the delegates? A delegate cannot be stolen! They are professional adult people that make up their own mind! In other words, they are not controlled by anyone!","post_message":""},{"comment_id":"10153268969721336","commenter_b":"How stupid r parents...it is not that hard to put this on a tall shelf...what a bunch of dumbasses...","commenter_a":"Survival of the fittest.","post_message":"This year, U.S. poison centers have already logged an average of 31 exposures to laundry pods per day."},{"comment_id":"1323629084344227","commenter_b":"and pretty much any woman could be a better president than Hillary.","commenter_a":"Not only can a woman be president but Hillary can be a better president than most men in fact the only MAN that can be a better president than her IS Bernie","post_message":"Stay classy, Bernie fans!"},{"comment_id":"10153157400746130","commenter_b":"I gained a lot of weight on women food.","commenter_a":"Savanna Bailey","post_message":"\"I quickly learned that food 'for women' just isn’t enough food. It's designed to starve you.\""},{"comment_id":"668462060011039","commenter_b":"kick the racist out of here!!!","commenter_a":"Send him to Guantannamo","post_message":"A scandalous tape of Al Sharpton has been released... He's not gonna like this. Let's make it go viral. Sharpton is a complete hypocrite. Who's the racist now? Let's kick Sharpton out of America... NOW!"},{"comment_id":"1774993129450173","commenter_b":"Ask him about carpet bagging the truth by billionaire media monopoly","commenter_a":"Thanks for discussion very informative","post_message":"Special debate coverage: Amy Goodman and Nermeen Shaikh host a pre-debate roundtable from 8-9PM ET with Kimberlé Williams Crenshaw, Melina Abdullah of Black Lives Matter - Los Angeles, Gyasi Ross, Soraya Chemaly, The Intercept's Lee Fang and Rashid Khalidi, followed by an expanded debate giving third party candidates a chance to respond to town hall questions. Jill Stein of the Green Party joins us from St. Louis starting 10:30PM ET. Tune in at democracynow.org/debate & post questions for our guests using #expandingthedebate."},{"comment_id":"1000962836629860","commenter_b":"Then they need to take ownership of the word terrorists.That is what republicans in congress are. They need accept responsibility for the violence in this country.","commenter_a":"Morons","post_message":"While they sell fear to the American people to get reelected, they sell themselves to the gun lobby."}]
