[{"comment_id":"10153468910666037","commenter_b":"Kids from low income communities and families qualify for free college education through goverment grants and programs... some choose to use those programs to better themselves and their famalies... others would rather point fingers and blame others... the only person to point the finger at in a capitalist society is the dude in the mirror because you can truly be anything you wanna be if you want it bad enough...","commenter_a":"This is awesome... more boots on the ground hopefully with the full support of the community and politicians to clean the crime up on the streets of this country... Every single city should follow in their footsteps!!","post_message":"The country's largest police force says it will also hire 400 administrative aides to take over desk jobs, which will free up more officers to walk the streets for community policing."},{"comment_id":"10154116780129749","commenter_b":"Stick with the real story... Isis killers murdered people in Brussels and Paris... They are Muslim., not all muslims are like that. FACT. Focus on hunting down these Arab Dog sh*t murderers... The politically correct are part of the problem. So shut the f*ck up about this clown.","commenter_a":"OMG. Are you stupid, ignorant or both? surely this is a joke!","post_message":"\"Croydon\" started trending as Twitter was flooded with scores of tweets condemning his comments."},{"comment_id":"976708829015963","commenter_b":"If we could only get rid of Wynne and get 3 new federal candidates","commenter_a":"The whole country needs to come to grips and be honest with ourselves...Canada can and must do much better than we did over the past ten years!","post_message":"She's not holding back."},{"comment_id":"10153522197479255","commenter_b":"Fuck you, lady.","commenter_a":"This people have been drinking the Kool-Aid!!!","post_message":"Obama is officially the best president the U.S. has had in a long, looong time.  By Daily Kos user PCalith"},{"comment_id":"1801266436786153","commenter_b":"Ungrateful bitch what an embarrassment for her team disrespectful I throw her off the team","commenter_a":"Yes","post_message":"Do you think she should be KICKED OUT of the Olympics??"},{"comment_id":"10154960801467232","commenter_b":"@username what benefits do you offer","commenter_a":"They call it pennsyltucky for a reason. Outside of philadelphia its all trailerparks and farms.","post_message":"The Southern Poverty Law Center defines a hate group as an organization that has  or practices that attack or malign an entire class of people, typically for their immutable characteristics. @webpagelink"},{"comment_id":"704711463000234","commenter_b":"Time to take her out of her tower.","commenter_a":"Nice job with Bill","post_message":"“I have a lot of experience dealing with men who sometimes get off the reservation in the way they behave and how they speak,” Hillary Clinton said."}]
