[{"comment_id":"498847790306569","commenter_b":"Scott, the guy was born and raised in New York City, the \"Wall\" you speak of would ideally be built to keep Mexican citizens from illegally entering the U.S. The \"Wall\"you speak of will not keep U.S born citizens off of the terrorist list, nor will it keep them from being bigoted disgusting pieces of shit who intentionally hunt down large groups of unarmed people and kill them because of their sexual orientation.","commenter_a":"I blame that peice of shit obama.stop letting in these fucking idiots. Build a fucking wall now! !!!","post_message":"Officials have started removing bodies from inside an Orlando nightclub where 50 people were shot and killed.  Sunday night, workers brought four bodies on stretchers out of club Pulse and loaded them into white vans. The action was repeated over and over."},{"comment_id":"1115311211854904","commenter_b":"We don't need more people coming here from anywhere. Immigration is to benefit the country not the immigrant. We gain nothing by allowing more here when we can take care of our own","commenter_a":"North Carolina here voting TRUMP 2016","post_message":"\"I'm the only one that speaks my mind and tells the truth and everybody knows I'm right.\"  Today on \"MediaBuzz,\" Donald J. Trump discussed his proposed temporary Muslim ban. @webpagelink"},{"comment_id":"10155348213273132","commenter_b":"Oh boo hoo! Get over yourself! The world doesnt revolve around Queen B! Plus she is not the same artist she used to be... of course her sister would be the one to start the unnecessary drama lol","commenter_a":"Beyonc is not all that any more ADEL IS ABSOLUTELY THE BEST SINGER EVER Beyonc did not get snubbed She lost GET OVER IT","post_message":" have only been two black winners in the last 20 years for album of the year.\""},{"comment_id":"10153796040151336","commenter_b":"Kyle Get off the illegals nuts already","commenter_a":"We need a zero child rule for liberals.","post_message":"Couples in China will now be allowed to have two children."},{"comment_id":"10154969127953128","commenter_b":"@username just another feminist.","commenter_a":"when I go to a show I pay to be entertained , I don't pay to listen to the actors personal views or his GD views on politics.","post_message":"A central part of Donald Trump’s presidential campaign was his use of social media to weigh in on issues surrounding him – large and small – and he did it again on Saturday morning."},{"comment_id":"889958597769015","commenter_b":"Don't like her!","commenter_a":"What is there left to say. Sarah Palin \"will send them to kick Isis out\"sounds like he will put troops on the ground. Just what Isis wants. She sounds as bad as Trump. She doesn't even know what is coming out of her mouth. Mental problem. Think before you vote!!!!","post_message":"“No more pussyfooting around!”  That’s what she said... Here are the best one-liners from Sarah Palin's endorsement of Donald J. Trump: @webpagelink"},{"comment_id":"10154995182613812","commenter_b":"All the liberal whiners calling racist. Typical","commenter_a":"its a trump or Hilary is American citizens decision no other nation have right to comment any thing about it...stop spreading hate","post_message":"On Wednesday morning the world will wake up to a new American president. Here's what news outlets across the globe are saying."}]
