[{"comment_id":"1587336334908184","commenter_b":"Fire HER butt.","commenter_a":"Can't stand her anymore. She is a petty, spiteful, conspirator.","post_message":"Should Fox News FIRE Megyn Kelly? YES OR NO:"},{"comment_id":"10153570566941509","commenter_b":"Yes....and take alcohol off the market...","commenter_a":"medical pot SHOULD be legal for those who need it!","post_message":"Do you agree or disagree? Dr. Sanjay Gupta explains why it's time for a medical marijuna revolution on CNN Opinion: @webpagelink"},{"comment_id":"10152872619506336","commenter_b":"Real simple solution to all of this. Remove these people from all Western Countries. And NEVER allow them in ever again. End of all problems.","commenter_a":"Had her and let her walk right past them, idiots!","post_message":"French authorities are conducting a countrywide manhunt for 26-year-old Hayat Boumeddiene, a suspect in Thursday's murder of a French policewoman. Police said Boumeddiene should be considered dangerous and potentially armed."},{"comment_id":"10152986560831336","commenter_b":"She belongs on SNL.....She is like a comic...! She is so stupid...!","commenter_a":"And just when you think you've send the bottom of stupid, you find there's even a lower level","post_message":"The key to defeating ISIS is... job opportunities?!"},{"comment_id":"1415259475160745","commenter_b":"Nobody hates better than feminists.","commenter_a":"The hate is real from the Internet warriors lol. So many people driven by hate... I wonder if poked if they would ooze black.","post_message":"Is this what a feminist looks like?"},{"comment_id":"10152874216906336","commenter_b":"Were the idiots of man that let these people in the country there should be bought to trail as well","commenter_a":"When will we as a human race stand up to the immoral acts of the few. Doesn't matter where your from. We need to stand together to eradicate scum..","post_message":"PHOTO OF THE DAY: Hundreds of thousands of people marched in solidarity across France Saturday to denounce this week’s terror attacks in Paris and to honor the victims."},{"comment_id":"10153842971535950","commenter_b":"Mary, please remove yourself from the gene pool. Don't reproduce.","commenter_a":"Many western people feel targeted and afraid of muslims. You never know what they have underneath all that crap they have on. Why don't they go back to Muslims countries?! If they can't adapt them should not migrate.","post_message":"In Nice, a city with the ban, police can fine any woman wearing a burkini -- or force her to disrobe."}]
