[{"comment_id":"10153868198207994","commenter_b":"There is a need to protest because even though this vile cop has been charged, he hasn't been convicted. We know how sympathetic jurors are to police. Hell most of the people commenting here would probably find him not guilty. This is more than just one bad cop. This is institutional.","commenter_a":"I sure hope it don't escalade into a riot and looting, that's all Chicago needs","post_message":"Protesters are beginning to march in Chicago right now just after disturbing video of a white police officer shooting a black teen was released. CAUTION: Viewer discretion is advised."},{"comment_id":"920944947962651","commenter_b":"soo then Michael is right , those other species of plants are no good , , chop em down & replace them with hemp.","commenter_a":"they need to fix this, and they can, if every person in China planted even just one tree, imagine :) Jude","post_message":"This documentary film went wildly viral with over 200 million views in it's first week online. Now Chinese officials are afraid that you'll see it too."},{"comment_id":"914975468564571","commenter_b":"Yup the woman is a <unt","commenter_a":"The mayor told the police to stand down and let them destroy the city so blame her and your president","post_message":"BALTIMORE: Shop Owners called police 50 TIMES  and no one came!  @webpagelink"},{"comment_id":"1202725173156591","commenter_b":"@username Seriously? Class, the next one? Give me a break. Michelle has more class in her pinky than Trump's wife has in her entire body.","commenter_a":"You would make me proud if you would return all the millions and millions of taxpayer money you spent on vacations! p.s. Your fired!","post_message":"Michelle Obama chokes up in final speech: 'Being your First Lady has been the greatest honor of my life.' @webpagelink"},{"comment_id":"10154105809967908","commenter_b":"Feel the Bern! Gonna be the first time I vote thanks to this man Bernie2016","commenter_a":"Yes, it is appalling.","post_message":""},{"comment_id":"10155429913146509","commenter_b":"But his enabler wife is","commenter_a":"Supporting a blatant sexual predator. Nice. And btw bill is not running for office","post_message":"House Speaker Paul Ryan said he will no longer defend Donald J. Trump, but he did not say whether he'd reverse his endorsement of the GOP candidate."},{"comment_id":"1429758383703081","commenter_b":"Drain the swamp!","commenter_a":"If this is true the whole bunch including the Obamas need to be in prison. All the laws from the last 8 years need to be scaled back, especially the executive orders. So ridiculous that a birth certificate isn't presented before even running for president. So sick!","post_message":"You already know that Barack Obama's \"birth certificate image\" has been demonstrated to be fake. But now, the trail into the deception goes deeper, as the investigator handling the case has concluded that government officials were involved in the fraud that transformed America ..."}]
