[{"comment_id":"1124028447686512","commenter_b":"YES She will Win No he will Not be elected. We The People need Bernie Sanders and Elizabeth Warren in The Senate to Protect the Environment The Economy and raise a little hell with Corporate Greed and Global Poverty; End Hunger for Kids, Homelessness and Gun Violence.Heathcare Education and Social Justice For All; VOTE !","commenter_a":"Hillary won nothing I'm voting for Trump","post_message":"TELL US YOUR THOUGHTS! FOLLOW US at Reverb Press and Stories That Resonate <<<"},{"comment_id":"1120933471338794","commenter_b":"Lol","commenter_a":"These uneducated hillbillies dont care because they cant afford to buy a trailer anyway...","post_message":"Millions upon millions of his poorest voters just got terrible news."},{"comment_id":"10152963839226051","commenter_b":"What is going on with these ungrateful wretches. They act worse than animals.Shut down the frat houses, they are all acting disrespectful","commenter_a":"cut their dicks off the young punks.","post_message":"Things just went from bad to worse for the frat boys who spit on wounded veterans and their service dogs before urinating on the American flag."},{"comment_id":"10157031950785206","commenter_b":"Lady like OMG!!! The way she lied and attacked Hillary!!! Yeah, she was real ladylike LOL!!!!!","commenter_a":"WOW! What a disaster you were just now on Chris Matthews Hardball. No wonder you have sunk in the polls and have been sent to the kids' table when it's time to debate. Your behavior was terrible.","post_message":"Cheer on Carly in the debate right now—LIVE on Fox Business! Even if you don't get Fox Business, you can watch the debate for free online at foxbusiness.com."},{"comment_id":"10153990315029062","commenter_b":"So sad.......where are the parents???","commenter_a":"Seriously? the kids are really that dumb/stupid......those grades are apalling......what did the students/teachers do from the start of the school year until now?","post_message":"Monroe demanded the HISD Superintendent Terry Grier immediately step down."},{"comment_id":"10154939052379218","commenter_b":"@username grammar Nazi feeling smug over a typo.","commenter_a":"But hey remember Love Trumps Hate lmfao libtards and there hypocritical ways","post_message":"Police say a teen wearing a cap with a Donald Trump campaign slogan was beaten and kicked as hundreds of students staged a walk-out to protest Trump's election."},{"comment_id":"10152783958260667","commenter_b":"You need to wake up lady !","commenter_a":"They are not public property. They are her private emails. You are all so crazy about your rights but not anyone else's. They were on a private server that had more security than her work emails. You need to take a cold shower.","post_message":"Looks like those who want a look at Hillary Clinton's emails have a long wait ahead of them."}]
