[{"comment_id":"1815590955374804","commenter_b":"@username good luck when the immigrants trying take over your country good luck","commenter_a":"People who don't like DT should move to Canada like all the other celebrities. I forgot nobody is moving. LOL.","post_message":"It's Inauguration week and The Donald is hard at work at Trump Tower making final preparations. Who is meeting the president-elect today?"},{"comment_id":"980094148726809","commenter_b":"@username Keep your dick in your pants!","commenter_a":"Well done! Any who object to a 'medieval theocracy' should take a good look at Northern Ireland if they want to see one in action. Bloody misogynist dinosaurs.","post_message":"Three women have handed themselves into a police station in Derry, stating they have procured and taken illegal abortion pills and requesting that they be prosecuted, in protest at Northern Ireland’s restrictive abortion laws."},{"comment_id":"10154807734390115","commenter_b":"Marcia, Dont insult the neanderthals by comparing them to prolifers. 😂","commenter_a":"Wow, some one just said men cause pregnancy! Considering it take two haploid cells to make a child.","post_message":"LIVE: Planned Parenthood supporters hold a rally outside the St. Paul, Minnesota, headquarters alongside Planned Parenthood protesters."},{"comment_id":"10154094490463984","commenter_b":"Thanks to our neighbors to the north..it would appear they are much wiser than we are. If this racist carp is going to end, it must end on both sides. I truly believe there are far FAR more black racist than white in the USA today. I also do NOT believe the blacks want racism to stop, that as a whole have too much to lose.....","commenter_a":"Can we just get this racist woman off social network already! Tired of seeing and hearing about her!","post_message":"Fresh off her race-baiting Super Bowl 50 performance, Beyoncé was about to head up to a huge concert in Toronto. However, a Canadian official just hit the singer with BRUTAL bad news... She never saw this coming... she should have, though."},{"comment_id":"941873945853078","commenter_b":"Stop asking this lady to run. She has an agenda allow her to work it with your support.","commenter_a":"Right on","post_message":"THIS Is why we want Elizabeth Warren to run In 2016!"},{"comment_id":"964070213702162","commenter_b":"She is dumb as a fox! Crooked doesnt require brains! Just dishonesty!","commenter_a":"Ha! Ha! Poor Hilary Rotten Clinton!","post_message":"Does anyone know that Crooked Hillary, who tried so hard, was unable to pass the Bar Exams in Washington D.C. She was forced to go elsewhere!"},{"comment_id":"1043167352401972","commenter_b":"She needs to be fired.","commenter_a":"Again I say\"get rid of her\". There are many patriotic qualified principals out there.","post_message":"A New York school principal has banned the Pledge of Allegiance, Thanksgiving and Santa. The school's PTA president Mimi Ferrer told 'Fox & Friends,' \"We are in America. We're supposed to be proud of where we are.” @webpagelink"}]
