[{"comment_id":"434228700035058","commenter_b":"Why so illegal immigrants can collect our money??? I think u should have to prove that you' have worked for 20 yrs or more to collect","commenter_a":"Also give thanks to Bill Clinton who signed the bill making it legal to outsource jobs here.","post_message":"Jeb Bush wants people to work until this age. I'm sure this will raise some eyebrows."},{"comment_id":"10154024832271756","commenter_b":"Garbage men make a shitload of money. pun intended.","commenter_a":"I found a great way to pay off my student loans....after college I got a job","post_message":"The government estimates that some 41 million students together owe more than $1.2 trillion."},{"comment_id":"10153506659437964","commenter_b":"There are those who useabortion as a contraceptive. I know a young lady who had so many that when she got married & wanted a baby, she couldn't have one. Turned into an alcoholic.","commenter_a":"I thought Obamacare was going to take care of the poor...the ones who couldn't afford health insurance...so why do they need planned parenthood?","post_message":"On Monday, we'll be voting to eliminate federal tax dollars going to Planned Parenthood. I can assure you I'll be voting 'yea.' #preauxlife"},{"comment_id":"10153283544784170","commenter_b":"Stick the crust between her buns. She'll never know.","commenter_a":"Straining so hard to see what isn't and not see what is. Sad.","post_message":"A word of advice to the legacy media:  If this is the best the Clintons can do with their \"re-branding exercise,\" you should jump ship immediately.   ...Because this is absolutely pathetic. VIDEO."},{"comment_id":"10153847623528812","commenter_b":"Na u should go back to Europe and take inbred fascist friends with u","commenter_a":"Beat it and take Obama too","post_message":"14-year-old arrested after a homemade clock he brought to school was mistaken for a possible bomb will be attending school in the Middle East."},{"comment_id":"1398317006928016","commenter_b":"I don't particularly like or support this woman for the position. But this is petty.","commenter_a":"Christian Heredia 😂","post_message":"Trump's Secretary of Education. Speechless."},{"comment_id":"497892010370754","commenter_b":"I should be arrested for the nuclear bomb I just dropped in the women's bathroom at my work. You'll never take me alive!","commenter_a":"I hope his family sues the shit outta that school so his entire future is paid for, Racists fucks","post_message":"\"Cool clock, Ahmed. Want to bring it to the White House? We should inspire more kids like you to like science. It's what makes America great.\"  - President Barack Obama"}]
