[{"comment_id":"1038590639515127","commenter_b":"Jennifer BTW how is that being a bitch. Bitch?","commenter_a":"And ALL of their body guards carry guns","post_message":"This video is packed with more celebrities than we could count — and they have one powerful message for the world."},{"comment_id":"10154476200391037","commenter_b":"Experts still deny Free trade causing poverty joblessness....they still maintain America cant make its own goods that we must import or fall into some economic abyss! At the same time they back Hillarys claim that she can create some kind of new jobs that doesnt involve manufacturing?? Lets speculatefor a moment that 25 years ago our govt agreed to stabilize China by implementing Free trade...it created a middle class helped create a market for us to trade with down the road... they have enough money to buy from us but 25 years ago the large population was mainly poor. and it made Chinese govt more stable...Govts make these kinds of trade offs everyday...greater good it will pay dividends we have to think of the future all of that kind of nonsense while sentencing 3 generations of American workers to a deadend future.","commenter_a":"obama has done a great job dividing people...Time to fix that!!..TRUMP 2016!!","post_message":"\"We need more love and kindness in this country,” Hillary Clinton said. \"The last thing we need are leaders who try to divide us even more than we are.\""},{"comment_id":"10153400550747042","commenter_b":"Good thing those girls were white, if they were black they probably would've been arrested","commenter_a":"The cops are doing their job! These girls are breaking the law. Now let's give the cops a big round applause (being sarcastic)","post_message":"KIDS' STAND SHUT DOWN: They were trying to earn money to buy their dad a special gift for Father's Day."},{"comment_id":"10154138194905329","commenter_b":"Look it says right here you're a little bitch.","commenter_a":"@username we got a badass over here","post_message":"When even art is tryna make gainz."},{"comment_id":"10154840376458812","commenter_b":"Yes sir he is.... Charmayne E bradley it saddens me so much to see baby's getting killed for nothing...i will continue to pray for them u and I . I often wonder what this world would be if everybody get together and love one another and stop with all the violence n hate","commenter_a":"Lord Jesus Christ our world is in dire need of ur help Jesus Christ plz help us all this world is beginning to all apart we don't know who to trust people are turning on each other and lord we don't know why r where all this hatred is coming from plz lord take care of all of us show us to love n trust n help one another the world is big enough for us all.respect love n in god we trust.....","post_message":"Video shows Syrian girl rescued from rubble after airstrike on east Aleppo neighborhood that killed at least 23 people, including 16 members of the girl’s family, activists say. @webpagelink"},{"comment_id":"1740824406204671","commenter_b":"Leave our country! We all will be keeping our guns!","commenter_a":"The question is why hasnt congress done their job and impeached him?","post_message":"Caught him..."},{"comment_id":"10154156847317623","commenter_b":"This has got to be the dumbest comment I've heard in a while. You and the Cash Me Ousside chick should go hang out and play in traffic.","commenter_a":"Who puts a three month old into daycare??? Mom is so concerned etc. But that three month old needs his/her parents not daycare workers anyway. Plus no charges should be filed if daycare was not made aware of the lactose intolerance. Sounds like a lil neglect on both sides of this. Plus whoever took the video should have stopped this from even happening. This worker although breaking the rules was trying to help out a baby who is clearly already in duress when the parents should be the one taking care of them at such young age. I can almost bet that mother is more mad she had to take her kid to the hospital and missed out of her drinking time and watching tv time. Thats just my opinion!","post_message":"A North Carolina mom says a day care worker breastfed her 3-month-old son and made him sick."}]
