[{"comment_id":"427873120742228","commenter_b":"hiliary could disapear forever and I reilly do not think she would be missed.Bill would be happy .The country would be a lot safer .Not to mention all those people who overheard something her loud mouth said would not have to die.A lot of people have died in her wake.EVIL EVIL EVIL WOMAN if thats what you want to call her.","commenter_a":"F#!#hillary","post_message":"Donald J. Trump has demanded Hillary Clinton apologize for making claims about him and ISIS propaganda that turned out to be false. Hillary's campaign just responded without holding anything back... Do you support Trump over Hillary?"},{"comment_id":"10152883601267452","commenter_b":"cat gets hired and I can't as a college graduate.","commenter_a":"Miriam Salinas Lupita Mary Reyes","post_message":"A startup company in Romania has hired a cat as their new communications manager. @webpagelink"},{"comment_id":"1029438293779366","commenter_b":"Keep Bill away from those girls Hillary!! You know he acts around other girls!!","commenter_a":"The next Americans president and expected cabinet members came 2015","post_message":"On the set of Broad City season 3 with Abbi, Ilana and Amy! #yas"},{"comment_id":"502126469966479","commenter_b":"Who knows who's here already? #WomenForTrump. Vote. #TRUMPFORPRESIDENT","commenter_a":"Is it just a few Americans that realize obummer n his administration are all Muslims, tied to CAIR, we could go on on on..72 in terrorist watch working for homeland security n DHs","post_message":""},{"comment_id":"10152841288932061","commenter_b":"I LOVE Johnny Depp and most of his movies. This is disappointing. He should just send them home. Save their lives. They should not have to pay for his stupidity!","commenter_a":"Everyone else has to do this and so do you,Depp!","post_message":"Depp is in Australia to shoot the fifth edition of of the Caribbean, called Men Tell No Tales.\""},{"comment_id":"10153745742861051","commenter_b":"GO HILLARY 1ST WOMEN PRESIDENT!","commenter_a":"Yes as long as it isn't clinton I don't really care as long as they are a good president and loves this country and the people who are citizens. She is only out for herself and wouldmake a horrible president she is to crooked .","post_message":"Trump has no problem with the idea of having a female president in America -- as long as it isn't Hillary Clinton. Do you feel the same way?"},{"comment_id":"10153775896719087","commenter_b":"Nope they're Staying with her!","commenter_a":"Actually, the superdelegate system was designed to stop a primary candidate such as HRC from getting the nomination. They were put in place to prevent someone like her who wins the popular vote but is un-electable in the general election from costing the Dems the WH. The question is are they too corrupt and blind to fulfill their intended purpose which is to give the nomination to Bernie.","post_message":"“I think clearly that the superdelegate model was designed to stop outsider candidates like [Bernie Sanders], and in that sense, they’re doing what they’re designed to do,” said Former House Speaker Newt Gingrich."}]
