[{"comment_id":"10153410983047787","commenter_b":"@username, she is an idiot!","commenter_a":"You are an idiot. Climate change causes prostitution I have never heard such a stupid coment.","post_message":"Diversity is our nation’s greatest strength – our currency should reflect that. I’m so glad that the Treasury Department agrees! Which shero would you like to see on #TheNew10?"},{"comment_id":"1793145997633986","commenter_b":"I believe Joy was referring to the women who willingly screwed a married man. That would absolutely make you a nasty tramp.","commenter_a":"That kind of shaming is the reason why many rape victims don't report there rape to the authorities. Joy needs to zip it and have respect for these girls!","post_message":"Paula Jones responded to Joy Behar’s claim that she was a \"tramp,\" and she took Bill Clinton down at the same time..."},{"comment_id":"1095905513769436","commenter_b":"But he couldn't get our marine out of Mexico, anybody had enough","commenter_a":"i do not believe that he was ever a prisoner of the taliban. he was working with them","post_message":"#Bergdahl wasn't just a DESERTER who left our side; he was a DEFECTOR who joined the other side!"},{"comment_id":"10155891268485354","commenter_b":"Don't give a Shi# what race you are do something like this and it should be automatic death penalty!!!!!","commenter_a":"I'm surprised you can say \"black\" gangs. any one that can do that to another human should be swiftly executed for their absolute worthlessness to society.","post_message":"The gang of 6 forced \"the male victim to watch as his female companion was gang raped.\""},{"comment_id":"10154647842874197","commenter_b":"KHILLARY HAS ROBBED ALL OF US. BILLIONS OF DOLLARS IN HER COFFERS!!! TAKE THEIR MONEY AND GET OUT OF THE US!!!","commenter_a":"He won't save it he will get what he wants at your expense lol","post_message":"WATCH LIVE: Donald Trump speaks in North Carolina."},{"comment_id":"10155187211337871","commenter_b":"Two out of 54 are not very good odds but we can't give up hope.","commenter_a":"Thoughts to the EDITOR of a Free Press by President Jefferson... \"Perhaps an editor might begin a reformation in some such way as this. Divide his paper into four chapters, heading the 1st, Truths. 2nd, Probabilities. 3rd, Possibilities. 4th, Lies. The first chapter would be very short, as it would contain little more than authentic papers and information from such sources as the editor would be willing to risk his own reputation for their truth. The second would contain what, from a mature consideration of all circumstances, his judgment should conclude to be probably true. This, however, should rather contain too little than too much. The third and fourth should be professedly for those readers who would rather have lies for their money than the blank paper they would occupy.\" --Thomas Jefferson to John Norvell, 1807. ME 11:225","post_message":"\"I hate the press. I hate you especially. But the fact is we need you.\" - Senator John McCain jokes, but stresses the importance of a free press to a democracy, adding that \"the first thing that dictators do is shut down the press.\" Read more: @webpagelink"},{"comment_id":"954295721303850","commenter_b":"Dumb hoe lol","commenter_a":"KiAsia SimplyyMee Wilson smh #fixitjesus","post_message":"SMH"}]
