[{"comment_id":"1214141488640014","commenter_b":"See what happens when the Muslim population increases? Get It?","commenter_a":"FYI","post_message":"WOMEN IN FRANCE Fight Back After Muslim Men BAN Them From Sharing Public Spaces [VIDEO]"},{"comment_id":"10154645130189062","commenter_b":"Woman should be lucky for not being arrested ,for interfering with \"police business \".","commenter_a":"So he was a really nice guy she said. But, let's post this to social media to ensure really nice guy loses his job instead of giving him the opportunity to learn from his mistakes.","post_message":"\"The reason I pulled you over today...I just want to know, what's the emergency?\" said the woman."},{"comment_id":"10153707738441680","commenter_b":"Pathological liar","commenter_a":"When I read these hate filled comments I want to cry. All this hate for a person you do not know and neither do I. I just know that I read bills and reports . I try to see what you all say about Hillary but I just do not see it. I am educated And I am a women I also know if all that is said about her is true men she has defeated would have locked her up a long time ago She is not perfect has she made mistakes sure Haven't we all. I will cont to listen and research and vote for who is best for my children and grandchildren That vote will go to Hillary","post_message":"Hillary Clinton: \"Whatever party you belong to, or if you belong to no party at all, if you share these beliefs, this is your campaign.\""},{"comment_id":"831073873594702","commenter_b":"She needs to eat goat meat. Raw.!","commenter_a":"Hey monkey looking good","post_message":"What's wrong with her!? You have to read this:"},{"comment_id":"1037877766321802","commenter_b":"THE ONLY VOTE FOR HILLARY WERE BUTTERCUPS AND ILLEGALS.","commenter_a":"Shabaz, you have a problem with Israel I see!!","post_message":"Who's meeting with the president-elect today? We're at Trump Tower watching the most famous elevators in the world"},{"comment_id":"10153962547876519","commenter_b":"@username Wrong. No Muslim structures where they killed real Americans. You have a lot of anger. Try whimpering in a corner.","commenter_a":"Oh shut the fuck up you unhinged idiots. By this standard, I had two health episodes yesterday. It's really scorching in this city right now.","post_message":"Clinton was observed \"fainting\" in a departure area..."},{"comment_id":"1823991571155225","commenter_b":"Wrong.","commenter_a":"Obama and the Democrats rescued the country from the worst economic disaster in our lifetime, while being obstructed at every turn by the very same Republicans who created the financial disaster.","post_message":"President Obama's Legacy?"}]
