[{"comment_id":"10153679672384586","commenter_b":"Cunts","commenter_a":"Aaron Andrew Bantoft this made me physically cry","post_message":"Imagine being alive for just ONE day... And then THIS happens, just because you were born male :("},{"comment_id":"10155205853325354","commenter_b":"She is on the chunky side. Normal for someone that does little exercise, like most @username women.","commenter_a":"ummmm Thats what we call a plus size!!???? NOT a plus size but a normal..average..healthy beauty...","post_message":"Plus sized? Weigh in with your thoughts."},{"comment_id":"10152669093692434","commenter_b":"This girl is always bipping off about something, anything to get attention to her has been ass. All she ever was a girl in the movie and shitty tv show Clueless. She wasn't even the main character. She needs to sit her ass down and take 100 seats.","commenter_a":"She has ruined Clueless for me.","post_message":"“I’m not saying I’m a victim. I’m pissed off. I don’t wanna be a victim.” Stacey Dash is entirely owned by Meredith Viera in an incredibly awkward debate about the wage gap on The Meredith Vieira Show"},{"comment_id":"10154311772481694","commenter_b":"Just when I stop thinking of him as Vern Schillinger.","commenter_a":"Geez. He must pull the plow at Farmers Insurance","post_message":"Commissioner Gordon is apparently way more into fitness than J. Jonah Jameson."},{"comment_id":"944552658926615","commenter_b":"People always wanna go after the other person. .. well guess what? .... THE DAUGHTER WAS THE ONE WHO HAD HER 16 YEAR OLD LEGS OPEN. AND WHAT 16 YEAR OLD BOY GONNA SAY NO TO PUSSY? smh","commenter_a":"I've got 4 daughters and a handfull of granddaughters--put me on her jury!","post_message":"MAD MOTHER: Police say say she beat up a boy after finding him in bed with her daughter. After he ran away, they say she took a baseball bat to his car."},{"comment_id":"989628607749873","commenter_b":"Lord have mercy, poor little baby, may he rest in peace.","commenter_a":"HOW?!?! HOW DOES THIS HAPPEN?!?! I just can't wrap my head around it. I have tried to understand but I am also a busy/working mother and I just can't understand how you can forget about a child in a car.","post_message":"Parents, grandparents and caregivers of any kind - PLEASE remember to always check your vehicle: @webpagelink"},{"comment_id":"10152886010046051","commenter_b":"Kill them sick people,now we'll have to pay for them to live in prison","commenter_a":"Both of them will burn in hell. Drugs are the most powerful tool of the devil.","post_message":"This mom decided to trade her 11-year-old for something that was a lot more important to her."}]
