[{"comment_id":"10153197747769094","commenter_b":"He doesn't shoot them for 30+ seconds.... You have to go out of your way to watch it.","commenter_a":"I made the mistake of watching the video from the shooter as he committed these awful murders. I wish I could take back watching that.","post_message":"Video of the fatal Virginia shootings shocked users of Twitter and Facebook when the “autoplay” function showed them what they didn’t want to see. @webpagelink"},{"comment_id":"631181740405738","commenter_b":"Deport all illegal immigrants. .","commenter_a":"Yes","post_message":"Sheriff Joe and Donald Trump are joining forces to take on illegal immigrants.  It's about time someone put their foot down and stopped this madness.  Do you think all illegal immigrants should be deported?"},{"comment_id":"10152578653426636","commenter_b":"Crazy moms be crazin","commenter_a":"Jeremy Blackwater Lopez","post_message":"A mother is now facing charges after she allegedly forced her children to drink poisoned apple juice.  According to authorities, she came up with the plan because she was mad at their father."},{"comment_id":"1756628007939155","commenter_b":"Stop and think!....before you vote for Hillary just to have a female as President...You are hanging yourself for women making it again in the future. Stop and think!","commenter_a":"DUNP THE TRUMP & GUILIANI!","post_message":"MAYOR RUDY GIULIANI STATEMENT ON LATEST CLINTON FOUNDATION DONOR SCANDAL:                           (New York, NY) – Former New York City Mayor and U.S. Attorney Rudy Giuliani today released the following statement on the Associated Press’ analysis revealing that 55 percent of Hillary Clinton’s non-government meetings while at the State Department were Clinton Foundation donors whose contributions totaled at least $156 million:   “From the facts revealed to-date, it is impossible to figure out where the Clinton Foundation ends and the State Department begins. It is now abundantly clear that the Clintons set up a business to profit from public office. They sold access and specific actions by and to them for money. This makes a mockery of her promise to Congress and the President to keep the Clinton Foundation and the Clinton State Department entirely separate. In other words, they merged the two into the Clinton Family racketeering enterprise. The need for a Special Prosecutor to investigate these apparent crimes mounts with every passing day and the revelation of new sets of e-mails and phone logs. I’m sure all we’ve seen is the tip of the iceberg and there will be more to follow.” -Rudy Giuliani"},{"comment_id":"10153498336211955","commenter_b":"Why would anyone go? Build the freaking wall.","commenter_a":"Are they trying to raise money for the wall?","post_message":"MEXICO ORDERS TOLL TO CROSS IN"},{"comment_id":"10150935097914999","commenter_b":"no clue what you're talking about?? You're not a woman so sfu!","commenter_a":"No, she's a hypocrite! Have you ever watched an abortion? I have...in 20 weeks it is a baby. In late term abortion labor is induced. The baby's head is delivered. a small incision is inserted into the back of the head the knife is twisted to kill the baby. The brains and skull is crushed.","post_message":"\"Hillary Clinton owned her feminism. She sounded like the first woman running for president, defending other women — our autonomy and our control of our own bodies,\" Emily Bazelon writes in The New York Times Opinion Section."},{"comment_id":"1033160160077065","commenter_b":"And why don't you keep your fat mouth shut?","commenter_a":"Divorce the fat pig and get Urself a nice slim lady!","post_message":"Wife won’t ler husband see her naked after pilling on 140lb"}]
