[{"comment_id":"10154273647523812","commenter_b":"Hell no!!!!","commenter_a":"@username so no beach this weekend","post_message":"Aerial video shows large school of sharks seen in Fort Lauderdale, Florida."},{"comment_id":"10157311512285294","commenter_b":"So... she's not a plagiariser, she's a liar. Guess her and Hillary have something in common after all.","commenter_a":"But didn't Melania say she had no help? Now this? I'm confused I call bull on this one","post_message":"\"I asked to put out this statement because I did not like seeing the way this was distracting from Mr. Trump's historic campaign for president and Melania's beautiful message and presentation.\""},{"comment_id":"10154445854511973","commenter_b":"this is what i think about blm's","commenter_a":"CRIMINAL PIGS OF AMERICA!!","post_message":"We are broadcasting live from downtown Portland, where members of Don't Shoot Portland are holding a press conference regarding the recent shooting of Quanice Hayes, 17, by a Portland police officer."},{"comment_id":"1787645241556279","commenter_b":"They look beautiful, professional and feminine. Certainly classy women.","commenter_a":"These are first class ladies No attitude","post_message":"There's great symbolism in Melania Trump and Ivanka Trump's inauguration style."},{"comment_id":"974401272656125","commenter_b":"If he is not im sure he has been watching and waiting for his next money making endeavor.","commenter_a":"And here come the riots.","post_message":"JUST IN."},{"comment_id":"1060450227347787","commenter_b":"Media whore...can't help herself.","commenter_a":"Yup....Good old Alaska values.","post_message":"She chose to spend her time - not with her critically injured husband in Alaska - but thousands of miles away with Donald Trump."},{"comment_id":"10153241233694087","commenter_b":"Which wife??","commenter_a":"He makes good decisions ... look at his wife and his kids ...","post_message":"\"He is who he is,\" Melania Trump said of her husband Donald J. Trump. \"Even if you give him advice, he will maybe take it in, but then he will do it the way he wants to do it. You cannot change a person. Let them be. Let them be the way they are.\""}]
