[{"comment_id":"1093577714092941","commenter_b":"Same way any comments from Pak regarding Indians and Kashmir are irrelevant.","commenter_a":"We are talking about a region where induviduals will go as far as to hijack airliners and slam them into skyscrapers. They think anybody that doesn't conform to their sick twisted ideology is the Devil.","post_message":"\"In Afghanistan, being lesbian is seen as un-Islamic. If people found out, the result would be death.\""},{"comment_id":"644827892343831","commenter_b":"If you agree with Mike's comment you're a sexist ignorant shithead. Thanks Mike for demonstrating what sexist assholes think!","commenter_a":"Does anyone know what is considered rape? Rape is one of the most hanus crimes that can be commited. But can anyone really know if rape was commited. Many cases each year happen when 2 people have sex and then the girl just changes her mind and calls it rape. Now i dont know all the details in this case, but maybe this judge knew more than we did.","post_message":"Judge Aaron Persky infamously handed down a sentence of six months jail time to Brock Turner in June."},{"comment_id":"1128341107201309","commenter_b":"Hillary is a very evil woman.She will do anything for power.","commenter_a":"I would love to see a truly in depth report regarding The Clinton Foundation. I do believe if the truth was revealed about the Clinton's and their corruption that surely more people would not vote for Hillary Clinton.","post_message":"FINALLY!!!"},{"comment_id":"10153520610884705","commenter_b":"this is a joke , seriously , he would probably kill her. That would be sad.","commenter_a":"I like her she's a hell of a fighter but Mayweather would make mincemeat of her quite quickly","post_message":"Ronda Rousey says she'd beat Floyd Mayweather (and anyone else) in a no rules fight."},{"comment_id":"1551736915123020","commenter_b":"Pssssh please.....ive worked in an immigration office and let me tell you. The GOVERNMENT is taking advantage of illegals and will NEVER get rid of them lmfao. People such as yourself must educate yourselves on the topic. In which, may i add, you know nothing about. Furthermore, illegals PAY taxes which INCLUDE medicare and social security. The government KNOWS that they are working under Americans social security numbers and even submit them ALONG with their real name and address to apply for an ITIN number. This allows them to PAY taxes even though they are in fact illegal. And guess what??? They will NEVER alert the American that their social is being used, these \"illegals\" will NEVER see a dime of social security benefits Nor will YOU!! And oh ya....they CANT apply for medicare / welfare either. And WHY would the government not tell you your social is being used?? ...","commenter_a":"The question is why are illegals getting benefits instead of being deported. No longer should illegals receive benefits from our tax dollars. I read earlier our social security funds have been used for illegals benefits. I for one sure didn't pay into social security so a non citizen could receive these benefits.","post_message":"\"The American taxpayers have reached a boiling point. We are tired of illegals taking American jobs. We are tired of illegals living off our tax dollars. We are tired of illegals causing mayhem in our streets,\" says Todd Starnes. Do you agree?"},{"comment_id":"10153194214264411","commenter_b":"That goes to zionist jews pigs from europe","commenter_a":"it's very important to distinguish between real Muslims and crazy fanatics who preach radical Islam. They just hide behind pseudo faith in God to do terrible things...","post_message":""},{"comment_id":"1369450476431551","commenter_b":"take your Muslim BS and shove it !","commenter_a":"The current jews inhabiting Israel now are not the descendants of Prophets Jacob/Israel. . The true descendants of Prophet Israel moved to Egypt and they inhabit Egypt currently.. do not forge the history","post_message":"WHO SAYS THERE IS NO GOOD NEWS IN THE WORLD?"}]
