[{"comment_id":"1901231699975547","commenter_b":"That don't count, She is a pig and certainly is Fat. Its not her fault it was the spoons fault.","commenter_a":"Wasserman hates men","post_message":""},{"comment_id":"1055356871225809","commenter_b":"Trump is clearly a tyrant.","commenter_a":"Go, @username! This man will bring down the Republic! He's a barbarian baying at the gates of our Rome. He wants to change the legal system our forefathers died for, deny us freedom of the press and access to unbiased information, encourages racism and discourages free exercise of religion. This will not end well.","post_message":"\"The Post will continue to cover Donald Trump as it has all along-- honorably, honestly, accurately, energetically and unflinchingly,\" Executive Editor Marty Baron said in response."},{"comment_id":"964624156930666","commenter_b":"Fat wives also can wear jeans ^_^","commenter_a":"He must have a really fat wife.","post_message":"Sounds reasonable :/"},{"comment_id":"1093462474008096","commenter_b":"Yeah, please do?^","commenter_a":"They are more worried about bringing extinct animals but not help animals that are close to extinction. (rhino, tigers, wolf's, ect)","post_message":"Woolly mammoth genome has been decoded."},{"comment_id":"10150604575769999","commenter_b":"Why do you suppose all those things are necessary for women? Come on, think!","commenter_a":"Overcoming the confidence gap? Thanks for your concern NYT but I'm doing just fine. I'm so sick of people telling me how disadvantaged I am as a woman. Women get alimony, the children, special scholarship opportunities, special mentorship opportunities, special conferences, support groups for violence against women, priority disembarking off the titanic, the seats on the crowed bus, and the list continues... Let's face it, men are disadvantaged now.","post_message":"While men often overvalue their strengths, women too frequently undervalue theirs. Call it a continuing confidence gap."},{"comment_id":"10153835231273984","commenter_b":"If it were any of us, we would be held accountable! This IS her mess!!!","commenter_a":"Fry the bitch! Tired of listening to her lies, and hearing her giggle when she's asked about her emails as if she knows she already got away with murder!","post_message":"WOW. There's no doubt Hillary did NOT want this to get out there. This makes things looks so much worse for her... Do you think Hillary Clinton should be held accountable for her actions?"},{"comment_id":"10154655814574411","commenter_b":"just give them what they wont , then the migrants can all go back home and rebuild","commenter_a":"Bill Jos","post_message":""}]
