[{"comment_id":"1186097424786988","commenter_b":"Hillary you're a smart women have faith and be strong you is next President Trump dangerous","commenter_a":"Hillary, you will be a great President.","post_message":"Here’s the sad truth: There is no other Donald Trump. This is it."},{"comment_id":"10152787741471130","commenter_b":"And please don't reproduce a$$hole!","commenter_a":"This makes my stomach churn. These poor dogs would have been better off on the streets!!!","post_message":"\"They were living in their feces, urine and there was nothing there.\""},{"comment_id":"10155960556545500","commenter_b":"They need protection from poachers! You are really dumb for supporting this.","commenter_a":"Shut down. Place animals in a REAL SANCTUARY.","post_message":"ABUSE ACCUSATIONS against the 'Wild things' - @webpagelink"},{"comment_id":"10150532816329999","commenter_b":"It's also ingrained that we're each other's competition. Women don't hate each other naturally any more than men do. That's nurtured behavior. If we support each other more, things will change. This goes on all fronts. I can't tell you how many housewives hate me just b/c I'm not a submissive woman who pushes out kids and reads mommy porn (those ideas are also ingrained on far too many women-in the year 2015...)","commenter_a":"I've definitely seen it and it's so ingrained that a lot of people don't notice.","post_message":"When a man talks in a meeting, he gets heard, but when a woman does, she gets interrupted, Sheryl Sandberg and Adam Grant write. Have you experienced gender bias at your workplace? If so, how have you dealt with it? Share your stories in the comments, or within the article."},{"comment_id":"10152964045994753","commenter_b":"I must be living wrong, that bitch","commenter_a":"This is in England so who cares","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"10153736667641350","commenter_b":"She lost","commenter_a":"Crap weazel !!!!","post_message":"The woman felt her nephew was negligent for giving her an enthusiastic hug."},{"comment_id":"10154784324202577","commenter_b":"First Amendment, Bitch!","commenter_a":"nothings going to change you yanks have been played for fools","post_message":"If Donald Trump truly wants to drain the swamp in Washington he must make an example out of this evil corrupt family and send a clear message that he is here to bring about real change."}]
