[{"comment_id":"10150977696104999","commenter_b":"No, the representation in the Senate is not of the people, but of the states. Each state has two Senators. That's equal representation. If you want representation of the people, you're looking in the wrong chamber.","commenter_a":"It is a very good thing that urban power centres cannot set the taxes of their rural neighbours. If they could the rural producers would become slaves and would have no quality of life in the pursuit of urban consumers actively destroying rural methods of negotiation. This is NOT a failing of the system, it is exactly why the system is in place. It is a good thing that farmers are not economic slaves of nearby cities.","post_message":"In the U.S. Senate, the least populous states are now more overrepresented than ever before."},{"comment_id":"10157871036080354","commenter_b":"@username that just shows how dumb you are! You actually think that hackers need trumps permission to hack!","commenter_a":"Hillary to Trump: \"We had a deal Don, you were supposed to help me!!!!\" Lol.... Does no one understand the Trump's constitutional rights were violated when he was recorded without his knowledge? This is exactly why we need him. The rule of law is run amuck.","post_message":"WATCH:"},{"comment_id":"10153721033369575","commenter_b":"Karen Crowder what the hell does immigrants have to do with it?!","commenter_a":"What's low gas prices have to do with bed bug's? Are they in the gas?","post_message":""},{"comment_id":"773502486092553","commenter_b":"The profit mohammad is a pedophile goat raping POS.","commenter_a":"Even Hitler would hate Obama.","post_message":"OBAMA THROAT: FOLLOW ISLAMIC MONEY? If you look into Obama’s foreign student status the subject is quite involved. It is not just if he was a foreign student, but was he an American posing as a foreign student? Is Obama an American that received funding from foreigners? Did he just get student loans and work hard? Is Obama keeping his records confidential to cover something even bigger than Obama himself? Ask yourself this question, would opening up Obama’s Harvard records cause people to closely examine the influence of oil rich Arabs that may want to impose Islam on the United States? In 1979 Vernon Jarrett, father in law of Valerie Jarrett, wrote about expecting Arabs to help disadvantaged black students. Khalid Abdullah Tariq Al-Mansour, formerly known as Donald Warden, had apparently been working with “rich Arab kingdoms” for this very purpose. Jarrett insisted that this is coming. @webpagelink So a ..."},{"comment_id":"10154460376356955","commenter_b":"Let's get real honest for a minute. WHAT demographic purachased most of the 80 million copies of \"FIfty Shades of Grey\"? White suburan WOMEN. They were ok with the talk about p888y in that book and movie, but are all the sudden appalled at trump's language 11 yrs ago.. As espn football guys would say, \"COME ON MAN\"!","commenter_a":"Funny how all the establishment types who have fought to stop Trump all along, republicans and democrats alike, are the ones most offended by coarse language and not so bothered by corruption and criminal activity.","post_message":"Voters Heckle Paul Ryan, Chant: 'SHAME ON YOU!'..."},{"comment_id":"544254699096156","commenter_b":"Eat pig shit Muslim","commenter_a":"If we are so disgusting take your slappy ass back to the Middle East. Live in squalor and let your \"men\" rape, beat, torture and starve your dumbasses!!","post_message":"Obama wants us to believe that Muslim Refugees can easily integrate in our Christian Western society, well watch this VIDEO..."},{"comment_id":"418030251654903","commenter_b":"Why not, she gets away with murder!!","commenter_a":"Bad, evil, lying laugh quack! 👎","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"}]
