[{"comment_id":"908022272624161","commenter_b":"How dare they,women please make your votes count!","commenter_a":"I don't understand how any woman can be a republican!","post_message":"Another day, another Republican attack on women. Shame on them.  Read more here: @webpagelink  Image by Occupy Democrats, LIKE out page for more!"},{"comment_id":"1150998668273937","commenter_b":"There are 5 videos.","commenter_a":"This girl was told to leave the classroom. She refused. An officer was called since a teacher cannot physically remove a student from a classroom. The officer asked her to come with him, she refused and pushed him. She had then assaulted a police officer. Which is an arrest-able offense. She then resists arrest while further assaulting the officer (hitting him). Why does anyone think this is ok? These children have no respect for authority. I see most people defending her. Seriously?","post_message":"This guy can bench press 605 pounds, and he threw that tiny girl across the room. And the one they arrest is the girl who was brave enough to stand up to him."},{"comment_id":"1172990589388617","commenter_b":"Bitch","commenter_a":"Marjolaine Morin","post_message":"Shouldn't their legs relax? Why do they curl up?"},{"comment_id":"1357029221003198","commenter_b":"Some more cry babies who need their blankie and bottle and their safety pin get over it!!!! God BLESS AMERICA AND GOD BLESS PRESIDENT TRUMP!!!!","commenter_a":"Like the cops dont have better things to do! Should arrest the little bitch 'barista'!","post_message":"The anti-Trump movement enters Starbucks.  @webpagelink"},{"comment_id":"10154244362139411","commenter_b":"'@username - Shut up bitch","commenter_a":"I can just see a flood of poor women getting pregnant so they can sell babies. What a terrible idea. Plus the fact that many which grew up in a state foster home become criminals if not adopted early","post_message":"'Chance to live'"},{"comment_id":"1731162717167272","commenter_b":"Rob Reiner is a slut! Liberal twit, rich and ignorant as a bowl of dung!","commenter_a":"The rich and stupid strike again...","post_message":"You mean racist like the race-baiters who back Hillary Clinton?   Kinda like that, Rob?"},{"comment_id":"10153145409004342","commenter_b":"Woman why the hell are you on a Houston news site? Get the hell back to Arkansas.","commenter_a":"You have to kill someone because they pissed you off....seriously? Houston a breeding ground for mental cases","post_message":"Police say a man who was shot and killed while changing a flat tire may have been targeted due to an altercation at another location."}]
