[{"comment_id":"343579349178913","commenter_b":"Nobodynis beyond the law!! ARREST OBAMA AND CHARGE WITH TREASON!!!","commenter_a":"That's because they are all STupid, and follow their leader and Nancy P.","post_message":"ICYMI - Nearly Half of Democrats think Obama Should Have the 'Right' to IGNORE the Courts!"},{"comment_id":"1170836056328262","commenter_b":"The last time I posted something about the politics of these bitches, I got dozens of whining bitches, men? and women, extolling on the vitues of these sacks o shit. Piss on 'em. Bring it on bitches!!!!!!!!!!","commenter_a":"GO DIXIE CHICKS--FREEDOM OF SPEACH-TURN TEXAS BLUE--","post_message":"Some Donald J. Trump fans attended this concert wanting to get away from politics and just have a good time listening to music. But then they noticed what the Dixie Chicks has in the background during one number. After that, Trump fans in the audience were absolutely furious... and for good reason. This is sick."},{"comment_id":"10152884212556636","commenter_b":"I'm just waiting for the first comment to blame the feminazi conspiracy to neuter us poor downtrodden beta males...","commenter_a":"That would be defined as sexist. People are supposed to be interviewed based on experience, education,","post_message":"'Can you wear more make up next time?'..."},{"comment_id":"10153396676558837","commenter_b":"What cracker dnt steal money there all crooks","commenter_a":"At Least in sweet water PD This is standard procedure","post_message":"OFFICER ARRESTED: Detective Armando Socarras, a 10-year veteran, was accused of taking $1,300 in drug money."},{"comment_id":"467726553428449","commenter_b":"racist ignorant rebooblican whore","commenter_a":"Both parties need to stop!!! Make America Great!!! Both parties are annoying.","post_message":"Obama wants her head, but Ann Coulter is standing her ground. This is bold. She needs our support. Can we get 50,000 'LIKES' for Ann Coulter?"},{"comment_id":"10152670445845927","commenter_b":"Give that money to the Border Patrol, and arm them to convince aids-ridden latinos to stay on their side of the fence !","commenter_a":"Sick! No matter how sinful humans try to avoid the consequences of this horrible sin, God's word (Romans 1:26,27) assures that they will receive in their bodies the automatic payment for their wrong. God doesn't lie and He never fails.","post_message":"The study is to find the best ways to convince gay Latino men to wear condoms and get tested for HIV."},{"comment_id":"10153530016051051","commenter_b":"@username So the child who was raped matters less than a nonsentient parasite?","commenter_a":"I am pro-life but in a case like this, there is no reason on the earth that this 10 YEARS old girl should have to endure any of this, and if anyone says other wise they need to have their heads examined, Rape is never, ever, the victims fault and if that results in pregnancy she should most deff be able to end the life of the baby. In other things abortion is still the womans choice and she and she alone decides weather or not to carry the baby, no one else has the right to say yes no or maybe on the situation at hand including the father, it is not his body that has to go through any of the complications. while i am Pro-Life and think that they should choose to let the baby live and give it up for adoption, i would never, ever tell ...","post_message":"A 10-year-old girl was raped and impregnated by her own father. Now she has learned whether or not she can terminate the pregnancy."}]
