[{"comment_id":"1178158985635102","commenter_b":"OH PLEAZZZZZZZZZZZZ.....LMFAO..THIS IS BECOMING COMICAL...IDIOTS EVERYWHERE!","commenter_a":"It's not an anti trump its a protest against the president from mexico","post_message":"LIVE NOW: An anti-Trump protest in Mexico City."},{"comment_id":"10154263187613984","commenter_b":"If Hillary were to win, she and Bill would never let Megan Kelly out of the White House!","commenter_a":"I think the Hildabeast has an eye for Megyn Kelly. Watch out Megyn, being too close to this one may lead to stupid. Be careful.","post_message":"During a recent interview, Hillary Clinton revealed her true thoughts about Megyn Kelly. No one expected what she was about to say..."},{"comment_id":"10156496631915354","commenter_b":"Send her back, bitch!!!","commenter_a":"She is simply unqualified...","post_message":"This radical Leftist principal is out of control.  The principal's name is Eujin Jaela Kim. And what she's up to will infuriate most Americans."},{"comment_id":"10152578505267217","commenter_b":"Can't stand the woman!","commenter_a":"Congrats Serena","post_message":"Serena Williams  jumped for joy on winning the Australian Open and her 19th Grand Slam."},{"comment_id":"10153696182197300","commenter_b":"He is absolutely correct....because the large majority of crimes are done by blacks....thus more police treatment...","commenter_a":"The numbers don't lie. He is absolutely correct.","post_message":"Democrats will reach out to black voters in the debate tonight. Bernie Sanders made a claim about African American arrest rates. See what PolitiFact found: @webpagelink"},{"comment_id":"10158072025935354","commenter_b":"I'm for @username!!! How does the left even get through the day?!!! So brainless!!!","commenter_a":"This campaign has shown us how truly mentally ill a large part of our population is.","post_message":"America is seeing the Left for the hate machine it truly is.   #Exposed"},{"comment_id":"10152846459704205","commenter_b":"African wisdom here seems to be too verbose.","commenter_a":"Larry is a voice which needs amplifying as he speaks to our being qualified to run America's business of governing. His professorial countenance with assurance of our intelligence to grasp the duties and tasks for citizens of our land to undertake he does with the smoothness that is purely African wisdom.","post_message":""}]
