[{"comment_id":"533139670207659","commenter_b":"She can take her sorry ass over there and live bet they wouldn't let her stay long","commenter_a":"she is a complete WASTE AND NEEDS TO BE PUT IN JAIL ALONG WITH HER COHORTS..","post_message":"She is DELUSIONAL..."},{"comment_id":"10156321873895725","commenter_b":"Global warming is responsible for baby dick","commenter_a":"iIN United States there plenty terrorist as illegal immigrants driving yellow taxi in the cities of United States taking the jobs from American people and ready to do bad things to us here that's why we need DONALD TRUMP to deport all of them","post_message":"As President of the United States, my top priority would be to keep America safe & strong! Thank you for your support."},{"comment_id":"1219528801419908","commenter_b":"^^^dumb bitch","commenter_a":"The one and only way it could have been prevented was if he complied with the officers instead of resisting after being tasered twice and thrown to the ground.","post_message":"CASE CLOSED....  @webpagelink"},{"comment_id":"10154064678631336","commenter_b":"'@username I won't vote for trump ! I will support the other republicans !","commenter_a":"Donald Trump understands better than anyone why the country is so much in decline. He understands how our politicians have sold us down the river with trade deals that benefits other countries and lines the pockets of foreign lobbyists who give away our wealth and jobs for their own gain. This is why the Establishment hates and fears Trump so much. Our country is 20 trillion dollars in debt because of all the corruption by both sides that are owned by the same people. Trump understands that if we do not get a wall on the border we will lose the country. Because all of the over 12 million illegals in this country are going to vote DEMOCRAT once some RINO or liberal gets into office and gives them Amnesty- THAT will mean the extinction of the Republican party and we will become a third world socialist nation. The Establishment ...","post_message":"“The lessons of 9/11 are being forgotten by a lot of people. And that is: A human condition elsewhere matters to our national security.”  Do you agree with former President George W. Bush? @webpagelink"},{"comment_id":"10153433309476051","commenter_b":"Tie her up in the yard with a plate of chicken wings just out of reach","commenter_a":"No compassion, no conscience ,scruples,morals..nothing but a worthless excuse for a person.I hope she has no children.","post_message":"Officials took one look at what this woman did to her dog and arrested her immediately."},{"comment_id":"10154425089776509","commenter_b":"Shut up you feminine POS","commenter_a":"Classic example of a Bernie supporter","post_message":"'Bernie's like a kush, like the best kind of weed you can get,' Tommy Chong said of Bernie Sanders."},{"comment_id":"10154080413671162","commenter_b":"You must be a star chaser or useless female cop.","commenter_a":"What a bunch of ignorant aholes....do me a favor and NEVER CALL THE COPS to help your pathetic selves...none of you are worth it....all loser thug scum bags","post_message":"Police say they were trying to pull a car over when it smashed into their patrol SUV in the Loop."}]
