[{"comment_id":"10152588899470779","commenter_b":"Right girl","commenter_a":"Jarelie Anne McClusky can't fucking waiiiit","post_message":"Brett Morgen's documentary is more than just a must-see for Nirvana fans. It's an eight-years-in-the-making collective labor of love that offers a private peek into the artist's mind, from the first creative stirrings to the spiral downward. You don't just feel as if you've gotten to know the man better. You're left completely emotionally spent."},{"comment_id":"1230498736993040","commenter_b":"why was she doing in the motel with him for. bah bah bah any way what has all this got to do with running the country .alot of men have had women but Trump is rich and they are after his money so stop so he may have kissed someone well i sure they wanted him to women were after him when he was younger and maybe now to .come get a life..","commenter_a":"Interesting!!","post_message":"'When I saw her on TV crying, I felt like she did a 360-degree turn here.'  Full Interview: John Barry refutes the sexual misconduct accusations against Donald J. Trump made by his cousin and former 'Apprentice' contestant Summer Zervos."},{"comment_id":"863998766982005","commenter_b":"Women. Are. Psycho.","commenter_a":"not worth it.","post_message":"A woman has died in a car crash after chasing down her husband who was with another woman. What do you think? Crazy details here:"},{"comment_id":"976944929007595","commenter_b":"Does their welfare check cover that fine? Are you that stupid to think they will pay the fine?","commenter_a":"Yes people can go to far with this indecent exposure not a healthy thing for kids to see and as a country makes us look like morons to the rest of the world","post_message":"Boom!"},{"comment_id":"10153860997211756","commenter_b":"He is a hero","commenter_a":"Traitor!","post_message":"Snowden tweeted 'Can you hear me now?' then had an exchange with astrophysicist Neil deGrasse Tyson covering Mars, cat pics and labels."},{"comment_id":"458392787682348","commenter_b":"I dont think they have been treated bad enough...kick em out of the White House and Ill be happy!","commenter_a":"POS","post_message":"Seriously..."},{"comment_id":"10154088875521717","commenter_b":"Omg what a pig","commenter_a":"'@username read this, what an arsehole","post_message":"The student said she has never been more terrified of being outed than when Milo Yiannopoulos berated her on stage at a college event."}]
