[{"comment_id":"10153137881829342","commenter_b":"And is Charlize Theron the president of the NAACP claiming to be white? I think we got there can be white africans","commenter_a":"she is white as white can be. she is born and raised African. @webpagelink","post_message":"When asked if she was African-American, she responded that she didn understand the question. When asked,  your parents white? Dolezal removed her microphone and walked away from the interview."},{"comment_id":"10153171021535950","commenter_b":"she gave him head while the lieing bitch watched and then joined in!","commenter_a":"From many people that know them personally, he has a few girlfriends. One in Canada. It's a marriage for show only.","post_message":"The United States' ultimate political power couple, Bill and Hillary Clinton, celebrate 40 years of marriage today. Their marriage certainly hasn't been all smooth sailing..."},{"comment_id":"10152779162447144","commenter_b":"shameless woman","commenter_a":"Send them back!","post_message":"These remarkable photos show the conditions that are driving the exodus to the United States."},{"comment_id":"2180394368851633","commenter_b":"I saw this same exact comment today😂","commenter_a":"I am confused why people telling me they voted for trump somehow grants them some sort of mythical powers now that they think they didn't have before. It was a vote, not a sword delivered by the lady in the lake.","post_message":"This lady clearly has deeper issues!  #WSHH"},{"comment_id":"10153641052531509","commenter_b":"@username, I'm willing to bet that Elizabeth up there hasn't murdered any teenagers. It's possible that she's never even been arrested. I won't mourn a guy who can't seem to keep trouble away from him.","commenter_a":"Too bad the gunshot didn't kill the punk.","post_message":"George Zimmerman, acquitted in Trayvon Martin's death, has suffered a minor gunshot wound in Lake Mary, Florida, police tell a CNN affiliate. @webpagelink"},{"comment_id":"1198337853547380","commenter_b":"Simple solution, ARREST Them and prosecute to the full extent of the law! They keep doing this crap because they are not being prosecuted!","commenter_a":"Yes","post_message":"These loons need to be locked up!"},{"comment_id":"10153609535136680","commenter_b":"Rick seems to forget about that \"Well-regulated Militia\" clause that are the first words of the 2A. It doesn't mean a armed rabble.","commenter_a":"Evil and assault weapons which need to be only in the hands of trained military, not sold to any Tom, Dick or Harry.","post_message":"Rick Scott: \"Let’s remember, the Second Amendment has been around for over 200 years. It didn’t, you know, that’s not what killed innocent people. Evil killed innocent people.\""}]
