[{"comment_id":"1285543264804515","commenter_b":"No, and unless her ancestors were Native Americans, they were illegals and traitors to the Crown.","commenter_a":"She's as ignorant as she is ugly, does she not know anything about American history for Christ sake.","post_message":"Someone should tell Ann Coulter cocaine makes you age poorly."},{"comment_id":"1823696047877973","commenter_b":"She is just jealous.","commenter_a":"Rosie is a washed up loser who thinks we care what she says. We know exactly what and who this disgraceful person is.","post_message":"OUTRAGE...! Rosie O'Donnell TWEETS naked photo of Melania Trump when comparing her to other First Lady photos. WARNING: Nudity. @webpagelink"},{"comment_id":"10153231020785933","commenter_b":"@username you are so wrong girl !","commenter_a":"#Kasich 4Us#...Kasich is a good man and a honest man who is humble enough to recognize God in his life and the need for him in the country once again,hes a man with all of the experience who learned from one of our best presidents Ronald Reagan...and he KNOWS how to lead this country in the direction that it needs to go to become great and LEAD the world as we once did...lets do something right in this country for once and VOTE KASICH!!","post_message":"It's our time to unite the country. New Hampshire, it's your time to vote for a leader who can do it. #Kasich4Us #fitn"},{"comment_id":"1050293421764665","commenter_b":"Good thing? To leave 20 million with no health care? Who are you? Scrooge? Let the excess population die? WWJD. I will not battle here.","commenter_a":"I am a constituent of yours. Let me tell you how hard I am going to work to make sure you are never re-elected! How dare you dismantle the ACA in the late night sessions. How dare you de fund the UN!","post_message":"This was John Kerry and President Obama taking a slap at Israel. I think most Americans believe that the United Nations has become more anti-Semitic, more anti-Israeli. We're going to stop the US money to the UN until we get this fixed."},{"comment_id":"1011455315580612","commenter_b":"Is this guy a republican?","commenter_a":"Ignorance perpetuation personified!!!!!","post_message":"This guy is a complete moron."},{"comment_id":"843323745763879","commenter_b":"I do Tim!! I don't care that gays get married & I wouldn't dare force a female to give birth to a baby she doesn't want!!","commenter_a":"i thought you guys hate christians","post_message":"Oh, the irony!"},{"comment_id":"10152785056866051","commenter_b":"how dumb are these women","commenter_a":"WTH!","post_message":"This prisoner impregnated not one, not two, not three, but four prison guards."}]
