[{"comment_id":"10153603193848132","commenter_b":"That's cause her hair isn't real. It's fake as that tan she has. Your daughters are beautiful btw!","commenter_a":"My daughters are only half African American. Just thought I would lighten this post up some! Was tired of seeing negative comments.","post_message":"The race scandal continues."},{"comment_id":"10154003941470950","commenter_b":"Elizabeth Lilly what a ignorant women you are","commenter_a":"His first 100 days will be tremendous. So tremendous and full of catering to Russia. Bigly. He will keep us in suspense as he plans to steal back the money he spent for the campaign. So many plans. Big plans. And we're gonna pay for it. Bigly.","post_message":"Trump is about to speak to a crowd about what his first 100 days in office will look like: @webpagelink"},{"comment_id":"10153860038833812","commenter_b":"We can't erase history, if we could, blacks wouldn't be here ! We'd have gotten rid of them and shipped them back to Africa.","commenter_a":"Idiots!","post_message":"University of Mississippi quietly removes the state flag with its Confederate battle emblem from its place of honor on campus after students and faculty called it a divisive symbol that undermines efforts to promote diversity, tolerance and respect."},{"comment_id":"1010496572318771","commenter_b":"@username You should be ashamed of yourself, liberal whore.","commenter_a":"\"Trump rallies are becoming increasingly dangerous to protest\" Then stay the fuck away. You didn't see white folks showing up at Obama rallies, shouting racist bs. Goes to show the intellect of these animals. Fair is fair, equality for all! My ass! History has proven that equality never stops when things become equal. It's supremacy these animals want at this point.","post_message":"Happening NOW:"},{"comment_id":"1286179581424362","commenter_b":"And she is a liar and murder!","commenter_a":"He can talk about Hillary all day, but he has no real plan for this country, he's an imbecile.","post_message":"REPLAY: Donald Trump at a rally in Wilmington, Ohio."},{"comment_id":"10154666787286756","commenter_b":"But it's entirely not up to me how Islamic women choose to dress.","commenter_a":"It's crazy to me that the same people who are so feminist and or very liberal seem to not care at all about how Islam treats women. This is a great example of how they are extreme...even at the beach they have to be mostly covered.","post_message":"The Cannes mayor calls the burkini \"the symbol of Islamist extremism.\""},{"comment_id":"10154020579286051","commenter_b":"Old dumb bitch","commenter_a":"This is a GOP lying bash Hillary bunch of bitches","post_message":"Describe Hillary Clinton in one word."}]
