[{"comment_id":"10153323281663854","commenter_b":"Only if she wants to end up 6 ft under, so he can be president again","commenter_a":"They can run together in the yard at Gitmo.","post_message":"NO JOKE: Democrats Are Now Calling for Hillary Clinton to Name Barack Obama as Her Running Mate…"},{"comment_id":"660919517348095","commenter_b":"People who live in glass houses shouldn't throw rocks !","commenter_a":"Shame on this evil woman, in my opinion....Netanyahu is a friend, and what he has to say matters...If they, meaning the President, White House and Senators are worried about his visit, then WHAT ARE THEY COVERING UP? That is the question.....Bibi is an honorable man, and Americans trust him, more than someone like Feinstein.....Sit down, and let Bibi speak, Americans want to hear him.","post_message":"Senator Dianne Feinstein says Bibi is ‘arrogant’ when he claims to speak for all Jews. But, she still plans to attend the controversial speech."},{"comment_id":"10153129658039255","commenter_b":"Bring him down and send the drunk home!","commenter_a":"The dems and the President shoul not give in to his blackmail. Let them shut down DHS, send the National Guard and Reserve to the airports and train stations. Cancel planes and trains as necessary, especially those leaving out of or returning to DC. Let the seditionists suffer for as long as it takes...","post_message":"This is as good a time as any to bring him down."},{"comment_id":"10152949847416615","commenter_b":"A job well done champ!!","commenter_a":"I need some of that cashola","post_message":"The New Castle Police Department says K9 Champ was instrumental in locating the $15K that was hidden throughout the residence..."},{"comment_id":"10152987522331336","commenter_b":"Hahaha stupid white girls","commenter_a":"Wish we could deport him..","post_message":"Moments ago, President Barack Obama vowed to appeal a federal judge’s ruling to block executive action on immigration. @webpagelink Don't miss Texas Governor Greg Abbott's response tonight at 10p ET on 'Hannity.'"},{"comment_id":"10153143993045329","commenter_b":"That poor girl would eat both of you.","commenter_a":"@username @username Gerard Bravo 'Plus size' is where it's at.","post_message":""},{"comment_id":"10153598373182232","commenter_b":"Tom and Debbie: the officer was not a customer of the establishment ... Both of you should read the story.","commenter_a":"Was he a customer?","post_message":"A post going viral on Facebook alleges that a Center City Starbucks refused to allow a uniformed Philadelphia Police officer to use the restroom at the coffee shop. Starbucks says they're aware of the incident and \"taking all necessary steps to ensure this doesn't happen in the future.\" DETAILS --> @webpagelink"}]
