[{"comment_id":"10153598373182232","commenter_b":"Tom and Debbie: the officer was not a customer of the establishment ... Both of you should read the story.","commenter_a":"Was he a customer?","post_message":"A post going viral on Facebook alleges that a Center City Starbucks refused to allow a uniformed Philadelphia Police officer to use the restroom at the coffee shop. Starbucks says they're aware of the incident and \"taking all necessary steps to ensure this doesn't happen in the future.\" DETAILS --> @webpagelink"},{"comment_id":"497623757113047","commenter_b":"He doesn't lie almost as much as his father. Considering his age, he and his father are even in the lying department.","commenter_a":"I'd like to have that much nothing.","post_message":"Eric Trump lies almost as much as his father. --Andrew"},{"comment_id":"1661010187498580","commenter_b":"Don't forget Texas borders!","commenter_a":"Focus now on what is at hand Mr. Trump. Put an end to ISIS, erect that wall, and focus on Florida and Canadian borders, lastly boost our economy. You have mentioned these 3 things before which garnered my attention, then my vote. Just give more ways of getting this done. Oh, hate to throw this in but there may be a few executive orders that need immediate attention! TRUMP 2016!","post_message":"Remember, I am self-funding my campaign, the only one in either party. I'm not controlled by lobbyists or special interests-only the U.S.A.!"},{"comment_id":"10154442416273701","commenter_b":"You wouldn't likely notice a player. This woman was doing something else, I'm sure.","commenter_a":"Am I the only one that thinks it's disrespectful to be playing in a cemetery??","post_message":"Authorities in New Jersey say a woman trying to catch Pokemon in a cemetery ended up stuck in a tree and had to call 911 to rescue her."},{"comment_id":"10155022062873984","commenter_b":"Support the Gaines-not the pastor!","commenter_a":"Yes I stand for u chip and joanne","post_message":"'Fixer Upper' stars Chip and Joanna Gaines are being targeted by the media for their church's support of traditional marriage. Liberals are trying to destroy the Gaines family, and now they need your support more than ever. Stand behind Chip and Joanna Gaines and fight the liberal media by signing this petition!"},{"comment_id":"10155026342853147","commenter_b":"She is a slob","commenter_a":"Clueless no talent idiot.","post_message":"Pop star Pink attacked President Donald Trump for “stripping our humanity away”"},{"comment_id":"10153573907066509","commenter_b":"She couldn't bring women down, only herself!","commenter_a":"I don't want to swear.... but.....way to go bringing the equality movement down a peg! !!! You really didn't think that one all the way thru!!!! :(","post_message":"A female CEO is under fire after a Facebook post in which she said a woman should not be president of the United States. “That should be left to a man, a good, strong, honorable man,” she said. @webpagelink"}]
