[{"comment_id":"10154140637508984","commenter_b":"She's a she bitch..she's sappose to be neutral.","commenter_a":"Megan started this mess! Now the Balls in her Court, she can act like a person doing her job are act like the Establishment with the Mean Spirited Questions. FOX this could be the End for what you call Fair and Balanced. News Max looks pretty good.","post_message":"The long-awaited rematch between Donald Trump and Megyn Kelly will occur at tonight's Fox News debate. Kelly has a plan if Trump starts to attack her, and it's going to surprise you."},{"comment_id":"10153638108452894","commenter_b":"Exactly STFU Girl","commenter_a":"........\"my neck,my back,lick my 9ussy and my crack\" is her claim to fame, from like the 90s or something, why is she even doing a interview ?","post_message":"Khia BLASTS Beyoncé & Serena Williams for Making ‘Black People Look Bad’ & The Game Claps BACK: ‘Don’t Yo Neck and Yo Back Hurt?’ [Video]"},{"comment_id":"1001578793209206","commenter_b":"I should hope so. I thought charges had been brought before the court. Let's hope these 2 black women thugs go away for a long while and go to finishing school. Sarcasm intended","commenter_a":"Way to be behind in the news. Also i believeit was in indianapolis and the girl has been arrested on an unrelated charge. Yup mainstream news media at its best","post_message":"Shocking video out of Texas where a woman holding a child was assaulted by two other women."},{"comment_id":"10153481756262507","commenter_b":"@username \"you're\" means \"you are\"--so \"To you're point\" means \"to you are point\"...just an FYI","commenter_a":"If he doesn't win the dem ticket he can still run as independent and take all his votes that really do matter with him! along with over half the so called dems and prob a 1/4 of so called repubs!","post_message":"It's not over until it's over."},{"comment_id":"10153522112557690","commenter_b":"Amen","commenter_a":"Rest well kiddo !!! Hope your fam find some comfort in the lord !!!! From him we came and to him we shall return!!!","post_message":"Police say a Denton teenager died after being struck by an SUV while trying to cross the street. @webpagelink"},{"comment_id":"764424377012570","commenter_b":"Muslims are the problems in this world without muslims the would be a better place","commenter_a":"Why is it that every Arab must have a temper tantrum and act like a five-year-old about everything? I would love to see, one time, a mature, calculated, reasonable response from a Muslim. Just once.","post_message":""},{"comment_id":"10153607710971336","commenter_b":"Stfu pussy","commenter_a":"How stupid do you have to be to do something like this?? Idiots!","post_message":"One student “thought seriously about going back home” after seeing the signs."}]
