[{"comment_id":"1718149915138787","commenter_b":"Why don't they remove these 3 evil women?","commenter_a":"I wouldn't waste 1 minute watching this group! They all look like they are wearing Halloween masks!","post_message":"Come... ON... Joy Behar needs to be banned from TV!"},{"comment_id":"10154369972274749","commenter_b":"He is just like the guy that went on s rampage at the abortion clinic but this time he us a Muslim which changes the entire situation.","commenter_a":"Come on give the man a break,he was only a good muslim following the teachings in holy quran giving the wife the odd back of the hand and killing gay's is all well and good with islam ! It's us that have to adjust to the way they want us to live","post_message":"Mateen's ex-wife said she had been beaten by him during outbursts of temper in which he would \"express hatred towards everything.\""},{"comment_id":"10153025802828205","commenter_b":"Cindy @username please those immigrants pay taxes and guess what they can't file them every year. So the United states keep them. And I bet you would do anything if your kids didn't have an education. Or food on their table. Yes those that killed . Do bad things should be deported. Those parents that work . Some people like me have small business. So shut up if you never been on a situation where you don't a choice.","commenter_a":"If the above bill goes trough then where does ending DACA and deportation come in? They are giving them an opportunity for citizenship which if they do that then they should deport their illegal parents especially if the kids have completed school and working. No compromise here or you Republicans will never win the White House and I will only vote to get all Rhinos out of their cushioned thrones.","post_message":"On #TBT, remembering when my Republican colleagues believed in protecting immigrant children, just one year ago. Yesterday, they voted to end #DACA and deport #DREAMers. What a difference a year makes."},{"comment_id":"10153647598586077","commenter_b":"Put her back in prison!","commenter_a":"Welcome home Mom!","post_message":"Demaryius Thomas' mom, Katina Smith, will be wearing this custom made jersey today. (photo courtesy Michelle Martinez)"},{"comment_id":"1776736589270843","commenter_b":"People don't care it shows what our country has become. Hillary will get plenty of votes","commenter_a":"Charged with 24 counts of fraud and still got 39% of vote. Unbelievable","post_message":"So long, farewell..."},{"comment_id":"10153112350927908","commenter_b":"That is no good, that is not acceptable.","commenter_a":"I'm afraid Netanyahu's alternative, as well as that of many Republicans, is to bomb Iran's possible weapons sites--not the solution I'm hoping for!!","post_message":""},{"comment_id":"969458729761266","commenter_b":"Eat a dick,you stupid bitch.I do have personal pictures on my page that's how much you know.","commenter_a":"And you, @username, are an asshole, and so fugly you don't have the balls to post a real pic.","post_message":"Michelle Obama is simply the best First Lady ever."}]
