[{"comment_id":"10154624417173010","commenter_b":"Water board this bitch daily then drown her","commenter_a":"Sorry. 21 years is not long enough. That baby is missing out on 80 or so years of Life. Dad is Missing out on 60 years with His son. That is NOT justice for that baby. I don't believe in an afterlife, but hers would Be incredibly cruel And dark.","post_message":"When the boy regained consciousness, she called the child's father to ask him to give up his custody rights. When he said no, she once again held the toddler's head underwater until he died, prosecutors said."},{"comment_id":"1776292422637356","commenter_b":"I think that Donald Trump needs to demand a conservative moderator for the next debate or refuse to debate. He needs to demand to get the questions ahead of time like Hillary(doesn't need them). Oh yes, and be able to wear an ear piece and get fed all the answers(not that he needs them). He also needs to learn the hand signals(doesn't need them either). Play that wicked game better that that witch!!!! Do not let her rig another debate, or pay off the moderator. Do not get on the defense or let her get off by not answering for her sins. Be hard on her in this next debate and bring out all her skeletons. The media will continue to make you out to be the bad guy but America is not stupid and this deplorable is behind you!!!!","commenter_a":"TRUMP","post_message":"'Donald Trump is ready to lead.' Gov. Mike Pence"},{"comment_id":"916527265110193","commenter_b":"Rhyno - NO, dems did not control congress for the majority of Bush's presidency, you guys are so clueless..... it's the fault of those that pushed and developed it and demonized those not supporting it...... republicans did it, that pinch your cheeks thing again.....","commenter_a":"It is republicans that have forced Obama to keep the worst parts of the surveillance program going and to make it even more evasive. It is republican that created and pushed the surveillance state down our throats..... and they dare to point the finger at others for THEIR fascists policy.......","post_message":"“Such expansive development of government repositories of formerly private records would be an unprecedented contraction of the privacy expectations of all Americans,” the ruling said."},{"comment_id":"1213211328691180","commenter_b":"Yes","commenter_a":"YES","post_message":"It's AMERICA! Learn it or leave! Comment yes or no! LIKE OUR PAGE!----> Freedom Daily"},{"comment_id":"1141292965963756","commenter_b":"There is evil everywhere in all religions! This is a slap in all Christian faces whether they are right, left, or middle! It's just another example of a sick individual taking advantage of others!","commenter_a":"I was in the BIG HOUSE for 2 months long ago and I have to tell ya, some of the queens in there started to look pretty good. Damn Did I just say that?","post_message":"And another \"family-values\" hypocrite bites the dust."},{"comment_id":"1190272557692172","commenter_b":"I noticed, I don't believe I have ever before seen this. You can tell, they are sooo far distanced from our so called leader, lol. How is he allowed to carry on???","commenter_a":"In Obamas mind 9/11 didn't happen either. This man is a nut. Kick him out before he destroys this country. If you didn't know he was crazy before now, here's proof that he is. Pure old mean and crazy. America Please wake up. You can't be this brain dead.","post_message":"Somehow, Pentagon leaders don't seem too convinced..."},{"comment_id":"1082470525182532","commenter_b":"You tell them Horace. Spend that EBT somewhere else.","commenter_a":"Well Texas is off my vacation choice permanently.","post_message":"In Texas, adults with the proper permits no longer need to hide the handguns they carry in their shoulder or belt holsters."}]
