[{"comment_id":"1861987967361615","commenter_b":"This woman is sick!","commenter_a":"PLEASE FRY THIS RAPPER!","post_message":"*** Sarah Palin is About to Teach Rapper Azaleia Banks the Lesson of a Lifetime ***"},{"comment_id":"10154129058346509","commenter_b":"Please stay the f**k in Africa!","commenter_a":"With 18 proven ways on overcoming Homosexuality, George's Diary presents to you words of life relevant to this present generation. Homosexuality is not the worst and unbeatable lifestyle, God doesn't hate gays and lesbians. That understanding alone brings hope of overcoming it! You may not be a lesbian or gay but so many people around you are homosexuals, some are secretive about it while some are not! Some wants to change their lifestyle while some doesn't. Your next of kin or even close friend may be a victim of Homosexual without you realising it. Read this article and learn to overcome or help others overcome homosexuality. You can as well do your neighbour good by passing on this article to him or her...... OVERCOMING HOMOSEXUALITY.... Read now!!!!! @webpagelink Or download George's Diary on your Android device @webpagelink","post_message":"Like it wasn't scary enough already. This glass walkway hangs more than a half-mile up a mountain and the glass panel cracked, sending visitors fleeing and screaming. @webpagelink"},{"comment_id":"10153127700606491","commenter_b":"That females are equal to males. Google the definition of feminism. That's all it is. Males and females equal. No enforced culturally engrained gender roles. It goes very deep.","commenter_a":"Amazing that no one commenting but me is for gender equality! I thought it was 2015 :( oh well you can't teach ignorant adults I suppose.","post_message":"\"Every child is an individual.\""},{"comment_id":"898217656867757","commenter_b":"That dress >>>>>","commenter_a":"She looks absolutely stunning~","post_message":"And finally Miss Viola Davis! #HTGAWM #Oscars"},{"comment_id":"1230794190274923","commenter_b":"Umm for a free orgasm I bet you would.","commenter_a":"@username how do we get our hands on some of those mushrooms!","post_message":"This fungus can give a woman an instant orgasm."},{"comment_id":"577042442420795","commenter_b":"Lmao and crystal you're vote dosent count dumb ass. Have fun. In the end the government is choosing hillary over the rest of the puppets. This country was never and will never be good. And like I said cunt. He ships jobs out of fucking state. But hey research dosent count when a babbling moron says shit you like does it fucking broad? And you're voting for another greedy old men who has already said we're going back to war. And starting another war with Mexico if they don't pay for his little wall. You're stupid as fuck. Fucking little sheep. No a pig. Eating the shit they tell you. Fuck the media. It's all bull shit. Just like your vote. The world would be better without trump and his little feeble supporters. All so violent. All short of a few brain cells. Lmao you all get dumber and dumber ...","commenter_a":"This really exposes the mass ignorance in this country. The media brainwashed assses will stoop to any level. I remember when nobody hated Trump. Then the government owned media started a smear campaign. Wonder why the media would tell so many lies on one person. He's obviously a threat to the punks running things in this country.","post_message":"Because Donald Trump’s star continues to be vandalized, the Hollywood Historic Trust is considering removing it from the Hollywood Walk of Fame."},{"comment_id":"10154530724213645","commenter_b":"Yes Ryleigh this is really awesome. Great job !","commenter_a":"Nam Breanne Ewing NAM @username did you see this? Ryleigh @username and I are sooo proud of you. This is fantastic! Congratulations!!! I hope we are going to see you again this year in June!!! @username","post_message":"Meet Ryleigh!   Despite her physical challenges, she's beating the odds and inspiring everyone she meets with her story."}]
