[{"comment_id":"1195052803848081","commenter_b":"No more illegals. Go trump","commenter_a":"Trump rocks . Save Americans from drug cartels. Sanctuary citys and organizations promoting murder","post_message":"New polls show Trump is appealing most heavily to a certain kind of Republican voter."},{"comment_id":"10154303703286178","commenter_b":"You sound like a feminist bro.","commenter_a":"So does this mean only woman can understand how to run a home ? What a CROOKED crock of chit HILLARY !","post_message":""},{"comment_id":"10153243373545950","commenter_b":"Go Hillary...to JAIL","commenter_a":"BREAKING NEWS: Donald Trump, Republican presidential candidate drowned today, apparently he was trying to learn to waterboard.","post_message":"President Obama banned the practice of waterboarding and other so-called \"enhanced interrogation techniques\" after he took office. But Donald J. Trump said he would \"bring it back\" to fight ISIS."},{"comment_id":"10154173554642061","commenter_b":"We are all called on to help our fellow man","commenter_a":"Nice guy!!!","post_message":"School bus driver, who is a U.S. Army veteran, noticed one of his students was crying when he boarded the bus, so he bought 10 sets of gloves and hats for that boy and other kids in need. \"No one wants a kid to suffer like that.\" @webpagelink"},{"comment_id":"10153097012535329","commenter_b":"Lauren Youssef","commenter_a":"Lily, Marielle we need this!","post_message":"BuzzFeed Life can confirm that these delightful Oreos are VERY REAL AND VERY GOOD."},{"comment_id":"10153358285837439","commenter_b":"Well done Mr. Abbott! He should go one step further and ban/kick out ALL Muslims from the great continent of Australia!","commenter_a":"I am Australian and applaud this action by Tony Abbot. He is a staunch Catholic Christian, and a former Rhodes scholar who from what I,ve heard him say is aware of the fascist doctrines of Islam. Why other Western leaders insist on appeasement of Islam and jihadists is incomprehensible. And more importantly, suicidal.","post_message":"@webpagelink"},{"comment_id":"10154221931919199","commenter_b":"Idiot woman.","commenter_a":"At 44, she needs parenting classes! Did you read she's been stopped before for this! Someone call CPS for endangering a child!","post_message":""}]
