[{"comment_id":"10153476921072217","commenter_b":"^^ dumb feminist","commenter_a":"Merge the competitions. Let's throw them all together and give them all a shot at the big bucks!! You'd be lucky to see any women get past the first round. Different competitions = different money! Dry your eyes ladies 😬👍🏼","post_message":"\"Sport is not like most of the industries the rest of us work in.\" 🎾"},{"comment_id":"1324643474244952","commenter_b":"Do you need money?","commenter_a":"We're going to get back at a companies CEO for endorsing a different candidate by buying their product! Genius! I'm a registered Democrat. Why don't you throw some money at me while you're at it. Morons.","post_message":"Supporters of Donald J. Trump are getting back at Starbucks but putting the President-elect's name on the company's cups and filming any barista who refuses."},{"comment_id":"10153539588391037","commenter_b":"these pigs should have never been given the attention.","commenter_a":"If anyone believes the Duggars are all better now, please let your kids do a sleepover there and let us know. We'll wait for your report","post_message":"After weeks in limbo stemming from revelations of Josh Duggar’s sexual misconduct, the reality show \"will no longer appear on the air.”"},{"comment_id":"1739336132953313","commenter_b":"Stupid bitch lmfao","commenter_a":"Obummer has been rode so hard by his tranny boyfriend that he has lost his mind and should be hung for treason.","post_message":"Q: What 4 words would you say to Barack Obama?  The Free Thought Project.com (y)"},{"comment_id":"10153159608716833","commenter_b":"Took out the trash.","commenter_a":"The guy with the gun did the right thing!","post_message":"Armed Citizen: Video has been released showing a man armed with a machete kicking in a Pocatello, Idaho, apartment door last year, then getting shot by the apartment resident."},{"comment_id":"1083781141676265","commenter_b":"It has proven once more that U.S are serving the Wahhabism in the region in return it get many from the Saudi Royal family. no matter to U.S how dangerous the wahabi are what extreme threat poses to civilization.","commenter_a":"Muricaaaa","post_message":"The Russian foreign ministry said the attack had jeopardised the US-Russia agreement on Syria."},{"comment_id":"10154592681344445","commenter_b":"Yup, they are trying to invade the US as we type. Better build that wall.","commenter_a":"Now that half the Republicans in the house have been officially brain-washed, his confirmation will take place. This country will be taken over by Islam, when it happens. Bad news for women and gays.","post_message":"\"I am confident he will serve the American people with integrity and a steadfast commitment to justice,\" the president said. @webpagelink"}]
