[{"comment_id":"1825166017710828","commenter_b":"BUILD THE WALL!!! Go Trump","commenter_a":"Trump now has my vote. This lawlessness has to stop. There is nothing racist about wanting to enforce laws that apply to everyone. I do hope he can be talked out of the wall though. We need improved cooperation and relations with Mexico. Not a big wall dividing us. Both countries need to crack down on crime and make sure people moving between the two countries do it legally. Only way to have a civilized society is to enforce the laws. If laws are unfair, let's change them. But let's do it legally and civilly. Trump is not the racist monster that the liberal propaganda machine makes him out to be.","post_message":"\"Hundreds of cars were forced to make a U-turn less than three miles from a Donald Trump rally today after protesters parked in the highway to block Trump supporters from reaching the event.\""},{"comment_id":"10156025741310354","commenter_b":"Go educate yourself, ALEX! The Constitution does not need revision to deny citizenship to illegal aliens, or their children. It is left vague in our founding document and is clarified by statute. The 14th Amendment defines citizenship this way: \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.\" But even this does not get specific enough. As usual, the Constitution provides the framework for the law, but it is the law that fills in the gaps. The Constitution authorizes the Congress to do create clarifying legislation in Section 5 of the 14th Amendment; the Constitution, in Article 1, Section 8, Clause 4, also allows the Congress to create law regarding naturalization, which includes citizenship. Currently, Title 8 of the U.S. Code fills in the gaps left by the Constitution. Section 1401 ...","commenter_a":"In my opinion all the RINOs currently in office as well as the few Republicans who haven't yet achieved RINO are crapping their pants because Trump is saying what the public is thinking. Plus, Trump could give a rat's ass about what the Democrat media formerly known as the \"mainstream media\" says about him.","post_message":"Top Republican Strategist Promises a 'Cleansing' of Donald Trump Voters from the GOP!"},{"comment_id":"1367266676644002","commenter_b":"Why do you think we have any right to tell another country anything?","commenter_a":"Why afford them any opportunity to keep growing their attempts for long range missiles?","post_message":"North Korea continues their aggression."},{"comment_id":"1374679629226158","commenter_b":"No they are NOT normal. Maybe they are from his neck of the world but the Western world not so much. England needs to wise up and get rid of him and the rest of the muslims that are taking the country over before its too late.","commenter_a":"Can't stand this guy what is he doing in US???","post_message":"The new normal."},{"comment_id":"1731162717167272","commenter_b":"Rob Reiner is a slut! Liberal twit, rich and ignorant as a bowl of dung!","commenter_a":"The rich and stupid strike again...","post_message":"You mean racist like the race-baiters who back Hillary Clinton?   Kinda like that, Rob?"},{"comment_id":"1170750279653754","commenter_b":"Leave, Obama, just leave already. Go live in the ghetto desert with your Saudi prince best friend, before whom you knelt and kissed his hand. And take lying, leftist, socialist Hillary with you, and Bill, too. Don't forget to tell Bill to keep his pecker in his pants. We'll even provide a private jet on Egypt Air for you. In your picture at the Orlando vigil for our citizens you coundln't kneel like you did b4 the jihadist price, you just sqatted like they all do since they all don't have toilets. You are a disgrace and you are one of them!!!","commenter_a":"he is absolutely right","post_message":"When Obama ignored radical Islam, this YouTube star went online and slammed him for the coward that he is. He proved that Donald Trump was 100% RIGHT in calling this ISLAMIC TERRORISM, and we should not be afraid of those words!  Let's get 1,000 SHARES for a man who's not afraid of telling it like it is!"},{"comment_id":"909598592517510","commenter_b":"what a load of crap get off facebook,snapchat,instagram, pintrest,tumbler and go to sleep before 1am then see what happens and u are up at 630 because it u move so slowwwwwww be organized :) and btw u start at 9am","commenter_a":"@username Dannii Leask","post_message":"We might as well be sending teens to school in the middle of the night."}]
