[{"comment_id":"10153779129081336","commenter_b":"If she took responsibility where is the jail time?","commenter_a":"The fact that she is actually running in 2016 with all this going on shows me that there major sociopath here... MAJOR!! At least wait till the Bengazi investigation is over and maybe not in the front of our minds.. Can't believe she is running.. I don't get how people could vote for someone who lied straight face to the country ,,,","post_message":"\"I took responsibility, and as part of that, before I left office, I launched reforms to better protect our people in the field and help reduce the chance of another tragedy happening in the future,”  Hillary Clinton said a short time ago at today's Benghazi hearing."},{"comment_id":"1642358432731311","commenter_b":"She was queen to Obammy's King. Both suck!","commenter_a":"This dumb bitch needs to shut the fuck up!","post_message":"Do you think Oprah is a bigot?"},{"comment_id":"10153603055668984","commenter_b":"Illegals and Muslims are part of the planned destruction of the US!","commenter_a":"What's it going 2 take we the people need to take a stand on all the corruption, when 5 of our military men who risk everything 4 us get killed on American soil this racist president doesn't have the decency 2 have flags at half staff my grandchildren would do a better job! !!!!!!IMPEACHMENT NOW PLEASE ENOUGH ALREADY","post_message":"I can't believe these actions by Barack Obama...This is downright shocking.  Do you think it's time for Obama to go?"},{"comment_id":"1179430858762542","commenter_b":"@username what an a**","commenter_a":"Not even the president yet, and already proving himself to be the leader we so desperately need!","post_message":"As soon as Donald J. Trump heard the news that 1.5 million people are being asked to leave their homes, he knew exactly what to do..."},{"comment_id":"10155327246350354","commenter_b":"Why in the hell would we care if illegals' feelings are hurt by AMERICANS FLYING OUR AMERICAN FLAG. IF THIS HURTS YOU, GET THE HELL OUT OF MY COUNTRY. YOU ARE ILLEGAL !!! That means you don't belong here !!!!!","commenter_a":"If these Students get public support it needs to be rescinded.","post_message":"Just when you thought this story couldn't get any more infuriating..."},{"comment_id":"912811708762070","commenter_b":"Carole finally you sound like a smart girl see you're not an Idiot after all. I like that kid Rubio. send all illegals home including Obama. By the way carole you look like the nurse who use to work for me she was an idiot but she was nice to my patients.","commenter_a":"Since voters usually vote for charisma instead of experience and intelligence, I would expect Rubio to be the greatest challenge.","post_message":"We’re now a little more than a year away from the 2016 presidential election and Hillary Rodham Clinton, long-time Democratic front-runner, has set her sights on the Oval Office. Who in the potential Republican field can beat her? Take our poll. @webpagelink"},{"comment_id":"10153539342225329","commenter_b":"Women should have the right to ban ear piercing among them also.","commenter_a":"This is such BS.. I had my daughter's ears pierced when she was an infant and she felt the pain for 30 seconds. She was completely calm and pain free afterwards. Her ears healed in less than a week bc of how fast her body grew at that time. She had less risk of infection then (she was too young to play w her ears) and less healing time. I, on the other hand, had mine pierced at 6 and ended up with problems bc I took them out when I shouldn't have..","post_message":"“Severe pain and fear is inflicted upon infants unnecessarily,” the petition states. (via BuzzFeed Trending)"}]
