[{"comment_id":"10153233810444087","commenter_b":"She is lying","commenter_a":"They didn't bring their girlfriends","post_message":"“I think there are lots of people who wanted there to be a race for different reasons and they thought the only way to make it a race is a full-scale, frontal assault on her. This email thing became the biggest story in the world.\" said President Bill Clinton about the controversy over Hillary Clinton's email."},{"comment_id":"10153096190609614","commenter_b":"What kind of women gives up their child?","commenter_a":"Great daddy! This baby is so LUCKY to have such loving and loyal to baby kind of daddy!","post_message":"After this baby mom abandoned him because he was born with Down syndrome, his father stepped in to raise the son he calls and as a single dad. Leo Forrest was born in Armenia last month. Upon learning of the genetic condition, his mother and her family gave up on the child. They also told Samuel Forest he would no longer be welcome in their home if they decided to keep him, according to a GoFundMe page set up to help Forrest and the baby. Faced with a difficult choice -- his wife or his infant son the new father chose Leo. She has since filed for divorce, he says. Forrest is returning to Auckland, New Zealand, where he is originally from, to raise the baby. Read KTLA story here: @webpagelink"},{"comment_id":"10153533383913145","commenter_b":"Ur an idiot. I blame your parents for that!","commenter_a":"I blame Obama for this guy.","post_message":"A Kissimmee doctor accused of sexually battering a patient could reopen his practice today. If he does so, it will be with some restrictions. A live report coming up at 7 a.m. on Eyewitness News This Morning on TV27 WRDQ."},{"comment_id":"10156552982575354","commenter_b":"Colorado? Thats stupid of a migration....I am disapointed california was a great republican state being ruined by demoxratic liptards","commenter_a":"Enough said - California: soooo fucking broke no thanks to Democratic ignorance. A liberal virus that occupied the west. All these liberal fucktards are moving to Colorado with their shitty habits, a virus that will continue to spread.","post_message":"A worthless piece of paper anymore?"},{"comment_id":"10156256559580354","commenter_b":"Sure she will, and we will all be getting shot by the crazy people who get guns illegally","commenter_a":"And how many guards does she have!! And I bet we paying for them!!!!","post_message":"Hillary pledges her assault on 2nd Amendment freedoms."},{"comment_id":"10154230829439877","commenter_b":"@username that's horrible Florida teachers do get raises the website says the pay is negotiable but I only co-teach so my salary is non negotiable. I suppose it depends on what one perceives as good pay the teacher I work with gets grants and other stipends but she also buys many things. My aunt who's taught for about 11 years in Arkansas buys many items but keeps her recipient for discounts and tax write offs I imagine you don't get nearly back what is put in. I subbed for a little over a year and I found myself buying many items I didn't care to file on my taxes even though the district gives you that option. I understand","commenter_a":"I've worked at many schools many of them teach our babies and cannot stand them this is a fact. I will add I chose my profession after having my well behaved straight A children repeatedly coming home telling me their teacher was mean or did not appreciate their good behavior and Good citizenship. So I began to substitute and get an inside view. 68 job assignments later I saw many teachers that were jaded not just by the lack of parental involvement but by the lack of pay. I think more parents should better discipline and I also believe teachers lacked empathy and understanding. I will add prejudices and biases had a part as well. I really noticed it at mostly white schools that had few Hispanic students and it is truly heart breaking. Therefore, I am pursuing my teaching certification with everything in me to become the/an advocate for ...","post_message":"Who are we allowing to teach our babies?"},{"comment_id":"523996764459649","commenter_b":"She is so full of crap!!!","commenter_a":"Not my husband ... Wrong again Laura !","post_message":"Laura Ingraham makes predictions:"}]
