[{"comment_id":"623412734499592","commenter_b":"Stupid ass mofo","commenter_a":"The next President","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"642587655914116","commenter_b":"These people are uneducated and ignorant!!!!","commenter_a":"The blind leading the blind. Good lord they actually believe this nonsense. I'd honestly be embarrassed for them if it wasn't so flipping sad. Dummy down people we're in for a long four years.😥","post_message":"Dear Lord."},{"comment_id":"1189693781087315","commenter_b":"so wrong. We need to let Russia have their way with Soros and rid the world of this vermin.","commenter_a":"Soros is behind the refugee flood into Europe. His organizations sent Syrian approx. 19,000 tweets promising them housing and jobs in Europe and telling them how to get around border guards. He also was behind the whole effort led by Hillary to overthrow Middle East governments and replace them with governments of his choice. His influence has cost the deaths of thousands and thousands of people in the Middle East. This is the face of evil.","post_message":"Hacked documents from George Soros’s Open Society Institute state that the billionaire and his foundation helped to successfully convinced the Obama administration into increasing the total number of refugees taken in by the U.S. from 70k to 100k per year."},{"comment_id":"1061695460512781","commenter_b":"Forget about the suicidal Muslims getting atomic bombs, let's get those guns WTF","commenter_a":"\"Sniper ammo\" is next...wait for it....","post_message":"We didn't say anything about gun control, but it is gun control. Everybody knows they want gun control, and if they can't get your gun, what better secondary way than to get you bullets? Anybody with a brain knows what's going on here."},{"comment_id":"10154490537796509","commenter_b":"Hillary will not even go on FoxNews because she is afraid of the questions. Trump is on every liberal channel.","commenter_a":"Very good luck for Hillary clinton...MY she beat all her contestants...especially Donald Trump...","post_message":"Donald J. Trump's campaign attributed the decision to pre-existing campaign engagements, but it's likely to reignite discussion about the longstanding feud with Fox News and with Megyn Kelly."},{"comment_id":"1417299944952004","commenter_b":"They are illegal immigrants. Reagan granted amnesty in the 80's and it was to be a one time thing for those already here. Settled once and for all. But they keep coming. And this problem is not just from Hispanics although they make up the majority of inflow. If they couldn't come legally then they shouldn't be here. People have been coming legally for 100 years (like my father and his parents). No excuses. They are breaking the law and need to be deported.","commenter_a":"All he has is big ego","post_message":"Dude! Really??!"},{"comment_id":"10152596201106717","commenter_b":"He is the biggest coward that we have had as governor I hope all the gay republicans that voted for him are happy","commenter_a":"Let him sign it and flush his Walmart welfare state further down the toilet.","post_message":"\"If Governor Hutchinson allows this bill to take effect, it will amount to a giant, flashing 'Gays Stay Away' sign.\""}]
