[{"comment_id":"1022737904430216","commenter_b":"Yuge piss on Shillery Clinton. Name ONE more disgusting pig who ever lived?","commenter_a":"Nobody kicks a dead dog. Hillary's attack shows that her campaign sees Cruz as a real threat. Ron Nehring, keep up the good fight.","post_message":"Ted Cruz: “John Kerry was not a little wrong, he was wildly, extraordinarily wrong. Facts matter. Science matters. Data matters.\""},{"comment_id":"960983097307632","commenter_b":"At the last supper, JESUS told the disiples that if they had own sword, to sell the cloak to by one. Peter was carrying in the garden. This old mam does not know the BIBLE.","commenter_a":"If you own a gun you can't be a believer??? God has not revealed that to me. Where in scripture did He reveal that to you your holiness???","post_message":"Can you believe what the Pope said about gun owners? I'm stunned: @webpagelink"},{"comment_id":"910291425675761","commenter_b":"Throw her out of the white house.","commenter_a":"let the book burnings begin..then kristellnacht...then relocation camps","post_message":"Are you at all surprised by this?"},{"comment_id":"10153103366966770","commenter_b":"@username yes Mario was an idiot but he's dead and buried. Andrew is his idiot son and Governor. Chris is his other idiot son. Both are liberal loonies.","commenter_a":"These idiots who push for these huge wage increases are what drives prices up!","post_message":"A proposal to enact a $15 minimum wage in New York could cost state school districts $276 Million, according to a report released Friday."},{"comment_id":"10154415286659445","commenter_b":"I don't know I live in a 3 family Black family on the first floor Hispanics on the second & Im Italian but white on the third","commenter_a":"woah?!?!?","post_message":"WCVB presents a town hall meeting on #RaceInBoston in partnership with The Boston Foundation. Watch on WCVB and share your comments below. @webpagelink"},{"comment_id":"10153476026331509","commenter_b":"ladies ... let me increase ur chances looool","commenter_a":"Looks like I'll be dead earlier than I thought lol","post_message":"Being alone and feeling lonely increases your chances of early death by roughly 30%, researchers say. Simply being in the presence of others may not be enough: @webpagelink via CNN Health"},{"comment_id":"10153512557096130","commenter_b":"LOL!!! NO SEX. WOMAN LISTEN TO MAN. YOU MADE OF RIB. SHUT UP. NO WORDS. BE SLAVE. yay the bible...-.-","commenter_a":"Well, I suppose human nature, being what it is, things won't change much for the better. However, if people would follow some of the teachings of the Holy Bible, regardless of their personal religious beliefs, the need for Planned Parenthood would pretty much go away.","post_message":"Enough is enough."}]
