[{"comment_id":"1070107396359933","commenter_b":"She would have to drug me like Bill Cosby does his women","commenter_a":"This gal needs to get laid.","post_message":"“Her conduct and behavior are appalling, and I am not only disappointed, I am angry, that a member of our faculty acted this way.\""},{"comment_id":"10153016776944117","commenter_b":"Cause she was terrible. @webpagelink","commenter_a":"Because they are willing to sell out.","post_message":"From RUSH drummer Neal Peart to Rep. Paul Ryan to Uber CEO Travis Kalanick. Why do famous people deny that they admire Ayn Rand?"},{"comment_id":"10154460256056509","commenter_b":"Let's not forget she's a sleazy hooker who is doing the work of an immigrant that no American would do.","commenter_a":"Oh so what! trump made fun of Bush having his 90 yr okd Mom campaigning. At least you can understand her, unlike Trumps trophy wife who needs speech lessons. Do we really need a flotus who barely speaks u derstandable englush!","post_message":"See if you can tell why Ted Cruz's campaign pulled this ad."},{"comment_id":"1023375851016759","commenter_b":"You're wasting every body else's.","commenter_a":"67 out of the HOW MANY THOUSANDS of people that visit daily? Get your shit straight IFLS. scaring people for no reason. Pathetic.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"858343807629738","commenter_b":"Yes! Lock her up!!!","commenter_a":"She looks much better BEHIND BARS !!!!!!","post_message":"Trump Nominated - Christie Calls for Prosecution of Hillary: “Lock Her Up” @webpagelink"},{"comment_id":"875157552546363","commenter_b":"This is going to happen in every state these Illegas are in!!! Will there ever be a way to get them out of this country.. We need a great Wall of the United States just like the great wall of China!!","commenter_a":"who could have seen that coming? Not Obummer. He's got blinders on.","post_message":"Texas Man Murdered Execution-Style By An Illegal Immigrant Who Had Already Been Deported  @webpagelink"},{"comment_id":"420321631489464","commenter_b":"how about someone do a drive by on these losers, it would do the world a great deed.","commenter_a":"Non existent","post_message":"Can you Imagine the Media Coverage if These Guys Were White?"}]
