[{"comment_id":"10153666093873132","commenter_b":"Please!!!! She is a rapist!","commenter_a":"Nik Gudel","post_message":"Altice's lawyer described her as a woman who was trapped in a bad marriage, saying she is 'troubled' and 'has problems with viewing her own worth.'"},{"comment_id":"556548184511652","commenter_b":"You people seriously think our border with Mexico will keep terrorists out? You think that if we can't tell the difference between refugees and terrorists, that we would actually be able to sort them out at the airport? If we didn't want to take refugees we should not have involved ourselves in the war.","commenter_a":"To the people who support bringing in Syrian refugees: Have you ever thought that some of these 'refugees' could be disguised and actually be ISIS terrorists taking advantage of this situation with a free pass to get here? I think we need to use common sense and take the obvious security precautions and NOT accept these people!","post_message":"My interview last night with Sean Hannity."},{"comment_id":"1600782096895914","commenter_b":"Well yeah that's because she'd probably have a bomb, so...","commenter_a":"if she was wearing hejab, the story will definitely be different. meanwhile continue laughing.","post_message":"'I've flown all over the world and I've been on lots of really long flights and I've never experienced anything like this,' a passenger said"},{"comment_id":"10153152969586955","commenter_b":"She'll never be president.","commenter_a":"She's going way down in polls.","post_message":"HILLARY 'WIPED HER SERVER CLEAN'"},{"comment_id":"1104014366324977","commenter_b":"How is that racist lol Muslims are a ravery of people haha and no makes them follow a old book written by a peodphie that married a 9 year old girl","commenter_a":"Hey! Don't forget that ISIS are not 'real' muslims. And it is just a coincidence that 100% of those who join or support are muslims. This has NOTHING to do with islam. And it is only 8% of the entire population of Turkey who supports ISIS. (according to a recent Pew Research poll) But don't worry about it, they are not 'real' muslims either. Anyone who says that the world has a problem with islam is just a racist. We all know that islam is a religion of peace. Case closed.","post_message":"EXCLUSIVE"},{"comment_id":"1116798981710579","commenter_b":"She's feeding her baby. Shut the fuck up and move on","commenter_a":"Well it isn't racey,it's natural. This is ridiculous people need to approve of the way babies were intended to eat and get over it. When they do mom's will stop plastering feeding photos all over the internet.","post_message":"An interesting discourse here about nursing in public. What are your thoughts?"},{"comment_id":"1038011639567708","commenter_b":"Hell no, look at her go though Kalen would move","commenter_a":"Wtf imagine if this was kalen lol @username","post_message":"At 6 months and 27 days old, little girl breaks the record for the youngest person to ever water ski. @webpagelink"}]
