[{"comment_id":"10153870911641680","commenter_b":"Crooked Hillary only a few more weeks until she goes away for good","commenter_a":"Forced conscription ”has always been a bipartisan goal“? News to me.","post_message":"Hillary Clinton: \"I don't think you'll hear any of this from my opponent, and I think that's a shame: National service has always been a bipartisan goal.\""},{"comment_id":"1022176817805108","commenter_b":"It really doesn't look like the kind of skirt that could be worn any higher either.","commenter_a":"That skirt is hardly short... Cheerleaders' skirts are much shorter.","post_message":"When this student body president was shamed for a \"too short\" skirt, she wasn't having any of it and her response is epic."},{"comment_id":"10153332639166350","commenter_b":"I think either Dianna Elizabeth or Elizabeth Diane","commenter_a":"Congratulations William and Kate!!","post_message":"It's a princess! Congratulations, Duchess Kate and Prince William! on.today.com/1DRmS6f"},{"comment_id":"10154376636126509","commenter_b":"I once heard, all Asian look alike!","commenter_a":"u killed innocent boy shame to those who disagree with Obama abt guns new law","post_message":"\"I just shot my son by accident.\" An Ohio father shot and killed his teenage son early Tuesday morning, apparently mistaking him for an intruder, Cincinnati Police said."},{"comment_id":"1150655941656075","commenter_b":"@username SUCKER !!!","commenter_a":"We wish no illness upon Secretary Clinton, but the reality is if she steps aside and you become the nominee, the democrats will win the White House with a double digit lead. If she decides to be selfish and stays in, Trump will win. #bringbernieback","post_message":"The United States has the duty to guarantee equal opportunity and justice for all citizens, including our Native American brothers and sisters. And let us be honest and acknowledge that we are not doing that today."},{"comment_id":"10153009343111130","commenter_b":"My mother was too. But her mother was an even bigger bitch, so I got it.","commenter_a":"My mother is a bitch!! There I said it!","post_message":"\"I realized how much the fragility and vulnerability of females is exposed fully in the mother-daughter relationship.\""},{"comment_id":"1019297701444035","commenter_b":"Fix it or pay the consequences rich people.","commenter_a":"What I want to know, is why in the hell is the contractor, not a American company but one from the UK ?","post_message":"This worker does everything right. He works hard, and all the time, and he still can't feed his kids without food stamps. Why does the Senate allow this?"}]
