[{"comment_id":"10153708814028010","commenter_b":"shut your filthy mouth","commenter_a":"Nutella is gross. Nothing is worth assaulting the elderly, especially poo-tasting Nutella.","post_message":"The 24-year-old had snagged several samples when the elderly shopper told him to take just one, police said."},{"comment_id":"1833528413366580","commenter_b":"I say build the wall right up to California and let them funnel in but the thousands and with this Joker figure out what to do with him he'll change his mind pretty quick","commenter_a":"They better stopp look and listen","post_message":"\"There’s something called CEQA in California...\""},{"comment_id":"10153377279001756","commenter_b":"It's not just women. I had to go to the ER with a legit panic attack and they accused me of being on cocaine.","commenter_a":"A medical professional assuming that a woman is having a panic attack instead of a real problem? Shocking!","post_message":"Often, doctors reinforced women's fears of pulling a false alarm, automatically assuming that those with heart attack symptoms were suffering from indigestion, or maybe a panic attack."},{"comment_id":"10155543749229778","commenter_b":"Perhaps she is the right choice since we'll be obstructing the GOP for the next four years...","commenter_a":"Things are going great. More of the same!!!","post_message":"Rep. Nancy Pelosi won another term Wednesday morning as the leader of House Democrats, turning back calls from some in recent weeks who said it was time for a change."},{"comment_id":"10153923340133635","commenter_b":"Vicki C: So true re immigrants across the border. They caused more than half our hospitals and emergency rooms to close in Los Angeles years ago!!! Now, it's difficult for REAL Americans to get care when they require it. Just disgusting! Add to that, the planeloads of moozies Ovomit has been bringing in for years and I'm surprised any healthcare is available at all! Even our Vets can't get care and they should be first!","commenter_a":"Border Patrol Agent Defies “Gag Order” to Expose Obama The massive exodus of illegals crossing over into Texas and other border states is becoming more than local communities can handle. This influx of illegal immigration is causing emergency shelters, areas typically designated for use during catastrophes, to overflow, leaving local government scratching their heads as to what to do with immigrants who have no place to go and can’t be deported back to their home country.... Border Patrol agent Hector Garcia accused the Obama administration of “aiding, abetting and facilitating the smuggling of illegal aliens across the border.” In an interview with CNN, Garza said the current influx of illegal immigrants is “organized” and “orchestrated” by the drug cartels. Additionally, he said the federal government is giving illegal immigrants a “free pass.” He said the feds are using the equivalent of the honor system in asking illegal immigrants to later ...","post_message":"#1 Republican President Teddy Roosevelt was also a proponent of eugenics theories by Planned Parenthood founder Margaret Sanger"},{"comment_id":"10156665343745725","commenter_b":"Build the Wall!","commenter_a":"Thank you Donald Trump, I know all of this campaigning is a lot of work and tiresome. I sure hope you can find all of the strength and energy you need to keep up with negative stuff, because I know you are fighting for us the people. And we sure want you to go all the way to the Presidency. There has been no one will to fight for common sense and for the normal and real people of the great country. We all just need a chance to do and be great! Thank you again","post_message":"GOOD MORNING SOUTH CAROLINA! Do not forget to get out and vote today! The poll numbers are outstanding. They mean nothing, if we don't ALL get out to the polls & VOTE! Together, we will MAKE AMERICA SAFE & GREAT AGAIN! Thank you!"},{"comment_id":"10154793818836337","commenter_b":"Holy shit you're dumb","commenter_a":"Fake deal. She has run her course and they don't want her anymore. She has been all downhill since she cut her hair. She belongs back playing support for O'Reilly on his show. Demanding a raise? No. On the verge of being fired, but trying to save face.","post_message":"Should she stay or should she go??"}]
