[{"comment_id":"10155018887269329","commenter_b":"Rehash rehash... blah blah you lefties, blah blah. We won blah blah. No new content. Regurgitation continued. Yawn.","commenter_a":"You'll fit in with the self-important Hollyweird glitterati JKR. The British have never been enamoured of their paid entertainers except for simply that, as entertainers, who are well paid for their craft. The disenchanted and disenfranchised led the way with Brexit. Believe me, those who formed this majority are not racist not are they Ill educated. Nor are they of the lower socio-economic strata of society. They are the majority who stopped being intimidated by the PC brigade. The U.S. followed and Europe is next. The pendulum has swung back in reaction to the rot spreading from the highest echelons of government down, aided and abetted by a dishonest press and a compliant and unrepresentative public service.","post_message":"J.K. Rowling has outdone herself."},{"comment_id":"10154228299244218","commenter_b":"FYI this was NOT over drugs!","commenter_a":"clean up cecil county get drugs out the killed will stop . can,not count all the kids pasway in 20 year I live in cecil county iam way ingfor a call my son rusty is died I love rusty but he love his drugs","post_message":"Two people were killed in a shooting Monday night in Elkton, police said. @webpagelink"},{"comment_id":"10153964560712885","commenter_b":"are you fucking dump lock that bitch UP!!!!!!!!","commenter_a":":( :( not cool","post_message":""},{"comment_id":"1098620013533448","commenter_b":"This is AMERICA AND AMERICANS should be able to fly OUR FLAG any time and any place in America we want to and if some foreigners don't like it then they can get the hell out of America now.","commenter_a":"The school should be ashamed. This is America and the flag is the symbol of freedom. Whoever is the leader of this school should be fired and never allowed to work in the school system again","post_message":"EPIC! The School Said The Flags Off Your Truck, His Response Set Em Straight (VIDEO) This is America! Don't like it then leave!"},{"comment_id":"943023235797122","commenter_b":"And California lets the illegals vote so it is no good!","commenter_a":"California and NY for Hillary of course.... Trump the rest of the Country so","post_message":"Hillary Clinton won the popular vote for President by almost 3 million votes. Donald Trump will be inaugurated as the next President. That doesn't make sense for a democracy. The electoral college system needs to be changed."},{"comment_id":"10153084604971162","commenter_b":"Oh dear Lord I put this woman in your hands,we don't know her situation,we should not judge her..please Lord find her a place to lay her head protect her let her see the truth which is you..break her chains Lord,I saw in this article that she has a alcohol problem..break these chains Lord...I pray for all involved..in Jesus name amen","commenter_a":"That's sad!! Someone should get her some help like a shelter.","post_message":"WOMAN \"EVICTED\" FROM WALMART: A 45-year-old woman had been living inside Walmart for days before employees noticed her on the store's security cameras. VIDEO: @webpagelink"},{"comment_id":"10152930129086051","commenter_b":"kill the bitch","commenter_a":"Set her on fire...","post_message":"First she poured gasoline over her daughter. Then she lit a match. And then she tossed it."}]
