[{"comment_id":"10153619794460575","commenter_b":"You can see how they are when they don't get their way they are illegal illegal illegal shoot shoot shoot","commenter_a":"Cant wait for Trump to win and stop these third world demonstrations by illegals that dont belong here","post_message":"Trump refuses to be silenced. . ."},{"comment_id":"10154051337399411","commenter_b":"Are you sane, woman?","commenter_a":"A scientific theory is a well-substantiated explanation of some aspect of the natural world that is acquired through the scientific method and repeatedly tested and confirmed through observation and experimentation.","post_message":"If you have proof: bring it. If you do not: acknowledge openly that you have theory perhaps a well-honed, much loved theory, but a theory nonetheless. (Op-Edge by Sam Gerrans)"},{"comment_id":"1147292828682585","commenter_b":"Go to Hell Bitch!","commenter_a":"Her earrings are real classy. Hah!","post_message":"The Black Lives Matter crowd gets crazier every single day. Now the woman who co-founded the group says that \"white folks\" need to make a special sacrifice to everyone else. You won't believe what whites are supposed to give up..."},{"comment_id":"1201416786646537","commenter_b":"Hope the heck they do. Better without their sorry butts","commenter_a":"Samuel L Jackson can stay! Lol","post_message":"These celebrities said they would leave the United States if Donald Trump became president, well he's now president."},{"comment_id":"10154251674646636","commenter_b":"O don't back benefit sanctions , however if your gonna make a living out of claiming benefits do the job right , simple as","commenter_a":"He has a sighted carer (his brother) who opens all his mail and should have done it. Obviously they had never requested braille correspondence. So on that aspect I (for once) can't fault the DSS however to not reinstate the money after they appealed the decision is just ridiculous.","post_message":"Awful"},{"comment_id":"10153722896533690","commenter_b":"How Iran can Accept refugees while Iran is very poor country and its people are migrating to Europe","commenter_a":"Europe is christian place so send rufugees there,, iran is a shia muslim country, so send refugees there. Why don't you send these refugees to sunni dominating countries like pakistan, turkey??????","post_message":"Opinion: \"Of the more than four million Syrian refugees, almost half of them, the largest concentration, have gone to Turkey. In addition to Turkey, Camp Zaatari in Jordan has received tens of thousands of Syrian refugees. There are also Syrian and other refugees scattered throughout the Arab and Muslim world, particularly in Lebanon. There is one glaring case of a Muslim country that is heavily involved in Syria but has yet to accept a single Syrian refugee, and that is the Islamic Republic of Iran.\" Hamid Dabashi, Hagop Kevorkian Professor of Iranian Studies and Comparative Literature at Columbia University, writes for Al Jazeera."},{"comment_id":"1015835041846081","commenter_b":"She needs to take her conscience to another job.","commenter_a":"I'm getting real tired of her behind. My God's name is not Kim Davis. It's time for her to find a new job.","post_message":"BREAKING"}]
