[{"comment_id":"1164591366914667","commenter_b":"Texas, enough said.","commenter_a":"Try to keep your vagina in your pants \"Ladies\"","post_message":"The closing of safe, clean clinics across the state has brought the back alley abortion back to Texas."},{"comment_id":"10153638763994342","commenter_b":"@username he's not interested in your girlfriend","commenter_a":"Breaking: Lavoy Finicum, Marine, Rancher, father, and grandfather will be laid to rest today. He loved God, the constitution, The United States of America, and his family.","post_message":"Police say the local rapper was shot four times. He is expected to survive. #abc13"},{"comment_id":"10154780872790695","commenter_b":"One tactically trained security Guard at the massacre in Orlando changed nothing.","commenter_a":"RIP young angel If the school faculty were allowed to be tactical trained and had permission to use a gun in this kind of cases our kids would be safer idiots would fear and no one will have to shed a tear","post_message":"JUST IN: The coroner has confirmed 6-year-old Jacob Hall died this afternoon.  Hall was one of three people shot during an elementary school shooting in South Carolina earlier this week."},{"comment_id":"10155086794306729","commenter_b":"What did she care....that bitch was in it for the money.","commenter_a":"Pantsuit Nazi...","post_message":"Wow... Help spread the word folks!"},{"comment_id":"497111050479475","commenter_b":"She's a sellout to her own race, taking everything that white people gave her, and then spews her racist anti white nonsense to make blacks think she actually cares about them.","commenter_a":"She described racism other countries not ours.","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy.  She's the biggest racist we know, and we won't stand for it.  Do you agree Oprah is racist?"},{"comment_id":"638227583024858","commenter_b":"They were all womanizers.","commenter_a":"President Lincoln: \"...that government of the people, by the people, for the people, shall not perish from the earth.\" President Kennedy: \"...Ask not what your country can do for you.\" Dr.Martin Luther King Jr. \"....one day we will be judged not by the color of our skin but by the content of our character.\" Donald Trump: \"...Grab 'em by the p***y\"","post_message":"Watch a Republican CNN commentator call on Trump to step down after tape was released of him explaining how to sexually assault women: \"He is a pig, he is vile. This is consistent behavior by him...He is not fit to be the Republican nominee. He is not fit to be called a man.\""},{"comment_id":"927307860637643","commenter_b":"Don't exist anymore? Are you serious?","commenter_a":"Kkk really doesn't even exhist anymore. And this has nothing whatsoever with the kkk. This dude was probably killed by other gang bangers and the gators got him. I would like to know where In the hell you come up with the kkk our of this story?","post_message":"It's looking like the police, the courts, the whole town are covering up for the KKK. What do you think?  From (Y) Counter Current News - MBD"}]
