[{"comment_id":"894598347242254","commenter_b":"She needs to keep the hell out of our city schools.","commenter_a":"From what I see in this pictire, Moochelle is describing how to succeed in politics the Lewinsky way! ROFLMAO!","post_message":"The Food Police!"},{"comment_id":"1788072574740832","commenter_b":"jesus Christ those girls look petrified","commenter_a":"@username @username 😱😱","post_message":"Parents in remote parts of Malawi are sending their daughters to be sexually initiated by local men - called \"hyenas\" - when they reach puberty. Meet Eric, he’s proud of his role as a \"hyena\". Learn more from BBC News Magazine: @webpagelink Listen to the documentary: @webpagelink"},{"comment_id":"952760784783670","commenter_b":"She is a sad excuse. Why do we care what she says. Why do we care she breathes. Waste of space.","commenter_a":"I've seen prettier horses","post_message":"How much lower can Katie Hopkins go?"},{"comment_id":"10152976962214205","commenter_b":"Yea, you're right. My comment is stupid, cause it was meant to be. And all you idiots commenting on my stupid comment as if I'm serious lol What's even more ridiculous is \"the police have to do their jobs\". So that's why some ppl get Burger King and walked out of a building (when they've killed 9ppl) and other ppl get choked to death for selling loose cigs, or get shot to death on site for having a toy gun (a 12 year old btw). Or others mysteriously die by being shot in the back while cuffed and in the back of a cop car. Yea cops totally just doing their job by the books. So yea, thanks for \"proving\" me wrong on a comment that was clearly not serious to begin with. You butthurt idiots can shut your dick holsters and relax.","commenter_a":"Prolly told him \"good job son, you played your role perfectly. You did a good job as patsy for your government. Now here's your complimentary Burger King as promised.\"","post_message":"Did you know the cops bought Dylann Roof Burger King AFTER they arrested him? WTF?!"},{"comment_id":"10153287384469714","commenter_b":"We never like skinny models.we love skinned and boned and toned models that should take the run ways","commenter_a":"I think people don't get it. It's attractive to be thin but you don't have to starve yourself. You don't have to be super skinny. People like a nice figure but above all a nice personality. You don't have to kill yourself to have a nice figure. Eating right and working out makes you look nice and feel better .","post_message":""},{"comment_id":"484907421700536","commenter_b":"What an idiot, move to another country with the other celebrity dumbasses.","commenter_a":"His opinion matters?","post_message":"And that's not all Patton Oswald said either..."},{"comment_id":"1145080512196207","commenter_b":"@username, no. The crime is to be caught crossing the border into this country. Once you're in the country, it is a CIVIL offense and people are due a hearing and disposition before a judge.","commenter_a":"It'll literally distract them from focusing on real crimes","post_message":"\"If the federal government takes a more aggressive role on deportation, then they’ll have to do that on their own.\""}]
