[{"comment_id":"10154222975181336","commenter_b":"Throw Megyn Kelly up and over #TrumpWall and into Mexico!","commenter_a":"This is supposed to be a cutting edge news story? I am really disappointed with Megan Kelly. Every episode is guests who trash Trump. Megan always has guests on that attack Donald about women. It is her agenda. it is disingenuous.","post_message":"TONIGHT on The Kelly File: In an exclusive interview, Ted Cruz's wife, Heidi Cruz, speaks out about Donald J. Trump's retweet of an unflattering photo of her: \"I think we have a pattern of behavior here ... when Donald Trump is falling behind.\" Don't miss the entire interview with much more at 9p ET. @webpagelink"},{"comment_id":"594411744025341","commenter_b":"You probably have one between your legs Shannon!","commenter_a":"Who cares! It's an inanimate object! Ever heard of idolatry? This is it!!!! True followers of Christ don't kneel before a statue, they kneel before the one true God.","post_message":"What does sheer animalistic Muslim hatred against Christians look like? Story below."},{"comment_id":"472553692939711","commenter_b":"No.. She's Stupid.","commenter_a":"There is no way she is that stupid... I don't believe anyone can be that stupid! Her motive is to make ISIS sound misunderstood, to make you hesitate, and allow ISIS to grow. She is like Obama, is helping their brothers is arms, ISIS.","post_message":"I honestly don't even know where to start with this. It is absurd beyond belief."},{"comment_id":"531497917040788","commenter_b":"What a Dixie chick.....","commenter_a":"Dope head","post_message":"Tim Mcgraw fans shocked after he bowed down to Obama in this sickening way. Sorry Tim, you lost our business forever. Will continue to support Tim Mcgraw after he did this?"},{"comment_id":"1720013778051378","commenter_b":"No they don't.they are illegally living here ,they all need to be deported back to the desert.","commenter_a":"Nope! Not wanted.","post_message":"Incredible..."},{"comment_id":"1558222467532092","commenter_b":"Oh, oh. Is this were the Kiju come from?","commenter_a":"And what will happen if we try and remove it? It will cause all kinds of movement in the earth's crust - aka DEVASTATING EARTHQUAKES!","post_message":"It's as much as 1,000km down, a third of the way to Earth's core."},{"comment_id":"10155154956823487","commenter_b":"These people are like the Clinton's they don't give a damn about the illegal immigrants! All they care about is making money 💰 off the backs of illegal immigrants!! Why didn't they help those poor people before get legal documents in order!! 😡😡😡","commenter_a":"A refreshing glimpse of optimism.","post_message":"Bill Gates: predict a comeback for the truth."}]
