[{"comment_id":"1115743115130630","commenter_b":"No Jay Reed, it doesn't offend me because, undocumented immigrants pay taxes, create business, and help the country's economy. Undocumented immigrants don't obtain unexpected or desabilty benefit even when they pay to the programs.","commenter_a":"California has no place for this disgusting xenophobic individual. Dump Donald Trump where he belongs. .the trash Dump.","post_message":"Protesters smashed a police cruiser and at least one fight broke out after Donald J. Trump's rally in Southern California Thursday night."},{"comment_id":"10153535731001157","commenter_b":"I don't 100% agree , but same happens when they send my child home from school with nothing but Spanish letters in a supposed \"Bilingual\" setting .","commenter_a":"Look's like a fag","post_message":"An Arizona mayor has refused an invitation to a meeting of U.S. and Mexican border city mayors because it was written in both English and \"Spanish/Mexican.\""},{"comment_id":"736146246538727","commenter_b":"Big girl had to run!","commenter_a":"It appears the fat lady gave the skinny lady a good beating. She shouldn't have touched her. She appeared to be shielding her head and face as she was pounced on. Then, she gets in her car, probably not thinking rasionaly and overwhelmed by the incident, she blacked out and just lost it. She definitely was not acting in her right mind. She felt shielded in her car and since she couldn't beat them all up, took it to a whole new level. Neither of their actions are justifiable but that big girl needs to be taught a lesson to never ever touch anyone or beat on anyone like that ever again. Clearly, fatso is from the ghetto and couldn't control herself.","post_message":"A parking lot brawl between two women over a parking spot quickly turned into a demolition derby. How could you explain this to your insurance company? // Courtesy: GrindFace TV FULL STORY: @webpagelink"},{"comment_id":"10152847470758869","commenter_b":"that's pure BS... ok, Stewart is above the silly vampire stories here, but Binoche is one class above her throughout the film ... and in general","commenter_a":"I haven't seen the film, but I highly doubt that Binoche is nondescript: her screen 'presence' is astounding.","post_message":"“It is [Stewart], rather than Binoche, who lingers in your mind when the film is over.”"},{"comment_id":"890208664347927","commenter_b":"That's a woman^ Meant Selena.!","commenter_a":"Everything is so over sexualized in America. That's what the real problem is. If everyone didn't think of pornography whenever they saw a nipple it wouldn't be such a big deal!","post_message":"#FreeTheNipple is fighting against censorship."},{"comment_id":"1145946565440763","commenter_b":"@username Maybe a visit to the Maury show???? That's where all whores go","commenter_a":"It looks like with eight children, some of the fathers should be paying child support, not the government!!","post_message":"GOOD!"},{"comment_id":"933293176705778","commenter_b":"@username have a shitty day bitch","commenter_a":"COPS ARE MURDERERS AND MANIPULATORS","post_message":"It's been called the most gruesome case of police brutality in US history. We will never forget you, Kelly. The civil trial for the cops is about to begin. Latest update here: @webpagelink/ Video by Truth Be Known."}]
