[{"comment_id":"1093998960667966","commenter_b":"party endorsed toadies dont age well","commenter_a":"PUT these clowns out too pasture","post_message":"BEYOND TIME  America's Freedom Fighters"},{"comment_id":"10156410898495725","commenter_b":"'@username he does not have to insult Hillary's looks. She does a good job of insulting herself.","commenter_a":"I would love to watch Donald Trump debate Hillary Clinton! He will tear her a new one!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"},{"comment_id":"10154584590253812","commenter_b":"HILLARY TO WELCOME 1 MILLION MUSLIMS IN 1ST TERM Clinton's plan to expand refugee resettlement could cost U.S. taxpayers over $400 billion","commenter_a":"So we are being lead into war against each other and to blind to see the obvious of what is happening. When we need to be standing together fighting against these foreign countries and what we have been fighting for way before our time. Instead of allowing the color of your skin be an issue and using it towards one another. If you have so much hate use the energy towards standing up together fighting together working together and being there for one another to stand strong and conquer these hard times. We are giving in to everything we have fought to protect and save. Stop fighting against one another and fight for one another. Stop allowing this society to break us and the government to control us. Stop giving the enemy what they want and give them what they deserve. Stop being that slave to the government and allowing ...","post_message":"President Obama in comments on Nice attack: “These terrorists are targeting and killing innocent people, including Muslims.' @webpagelink"},{"comment_id":"959701630828566","commenter_b":"Joel Mata 😂","commenter_a":"Jasmine Lopez","post_message":"Smh! #WSHH"},{"comment_id":"10157007310710354","commenter_b":"Arrest her. There is no such Allah.","commenter_a":"Could she be a worse POS?","post_message":"Here's the deleted TWEET..."},{"comment_id":"1012675578755490","commenter_b":"Stupid women","commenter_a":"shut up skanks, cancel the p.o.s....","post_message":"Umm ACTUALLY it is in the Bible!"},{"comment_id":"1010697719021125","commenter_b":"It must be true, it's on Facebook, Melanie. Facebook!","commenter_a":"Chris this was an op ed piece in a psych journal and not scientifically tested - don't tell me not to hug my dogs!😉","post_message":"Noooooo"}]
