[{"comment_id":"10155226705950579","commenter_b":"She is sharp","commenter_a":"Where is the voice for the white race and culture?","post_message":"British Prime Minister Theresa May: \"I am pleased that I am able to meet President Trump so early in his administration.That is a sign of the strength of the special relationship between the United Kingdom and the United States of America.\"  Full video of Primer Minister's Questions here: @webpagelink"},{"comment_id":"10153204205229087","commenter_b":"Dude....please, I had a lovely friend who died recently because she was too afraid of how much it would cost to go to the doctor. So, with all due respect, I don't think you know what you're talking about.","commenter_a":"No Bernie, we shouldn't. Healthcare is not a right, it is something acquired by honest toil, and it is NOT something everyone needs, shown by the IRS' discovery that people are paying the stupid tax penalty rather than buy something the government is telling them to buy but which they DON'T need. \"People should not be dying in the US because they're sick.\" They're not, Bernie. It's a myth from the ideology of myths you refuse to see have no basis in truth. @webpagelink","post_message":"“We are the only major country on earth that does not guarantee healthcare to all people as a right, and I think we should change that,\" Bernie Sanders said."},{"comment_id":"486035008253746","commenter_b":"Cover her ugly ass back up. Been eating too many Chitterlings","commenter_a":"Cover her face??","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"1655285394531583","commenter_b":"Salty tears are most delicious. Is it January yet??","commenter_a":"A BIG thank you to the 53% of American registered voters who chose NOT to vote; because of YOU and only YOU, Donald J. Trump will be our next POTUS.","post_message":"This is the real reason Barack Obama is going against Vladimir Putin, two weeks before he leaves. This is what the mainstream media won't tell you. Make sure every American knows the truth."},{"comment_id":"1386824984689067","commenter_b":"She's a fucking drunk, wake up, she needs to be removed and institutionalized..","commenter_a":"Someone tie her arms by her side, maybe with a straight jacket!","post_message":"Something seems really off here..."},{"comment_id":"1218923861503062","commenter_b":"I wonder if this woman realizes what a joke she is. Department of Justice my butt. She has ruined any respect she may have had from the American people. What she may not realize is the Clinton's would leave her holding the bag if it covered their tracks!","commenter_a":"We don't need Attorney Generals that don't represent WeThePeople and the truth.","post_message":"Loretta Lynch, Attorney General can't seem to get her story straight about Hillary Clinton. This is what it looks like when your career crumbles right in front of you.   Let's get 2,000 SHARES to show that we don't need CROOKS in office!"},{"comment_id":"1074912275882577","commenter_b":"Look at their faces....they're smiling. ...and we're not allowed to be angry about this. All of you bigots need to shut up! Wear your flag ....fly your flag......shove your flag.....who cares ....but you will not see it flying over that government building ever again!!!! Deal with that!","commenter_a":"Are these the same, \"It's Heritage, not Hate\" clowns?","post_message":"South Carolina voted to remove the Confederate flag, and bigots are in a frenzy: 'F*ck black people'"}]
