[{"comment_id":"1277469425634935","commenter_b":"Oh yeah she must of smoked weed. Pshhh... don't be a dummy. Ppl don't smoke weed and drive in the wrong lane. If that were to be true millions off Ppl would be headed the wrong way. This lady was off her rocker I highly doubt it's do to weed or alcohol.","commenter_a":"Yeah legalize marijuana... will get more cases of wrong way drivers. But that's okay as long we have our freedom. That was a sarcastic remark. No to drunk driving no to marijuana no to drugs","post_message":"WRONG-WAY DRIVER: It's happened again -- DPS troopers used stop sticks to stop a woman who led them on a wrong-way freeway chase that began in Phoenix and ended in Mesa. Thankfully, no one was injured. STORY: @webpagelink"},{"comment_id":"10156264408410725","commenter_b":"The smart Americans will vote for Trump and Cruz. And that includes the \"legal\" Hispanics here. Trump wants to deport the millions of \"illegal\" immigrants..the ones who sneak in undocumented, or overstay their visas, or get deported and sneak back in...THE ONES THAT KEEP KILLING INNOCENT AMERICANS and drain our system! Get them the hell out.","commenter_a":"Go Trump!!! Hispanics for Trump 2016","post_message":"Join me Tuesday, November 3rd at 12PM in Trump Tower New York. I'll be signing copies of my new book CRIPPLED AMERICA. Don't miss it!"},{"comment_id":"1225168154206852","commenter_b":"No woman in her right mind would have voted for this man. God help us all.","commenter_a":"Genial","post_message":"'Donald Trump will make our economy great again'"},{"comment_id":"10154686052869586","commenter_b":"Get this bear out of there now","commenter_a":"Holding animals in captivity is inhumane. Do not support zoos.","post_message":"Thousands of people visit daily to take selfies & knock on the glass :("},{"comment_id":"1849468845289358","commenter_b":"@username rn she sitting on a strap thats why u so butt hurt😂😂😂😂","commenter_a":"She kicks some dude out of her show cause he didn't want to record her and now she does this shit... she's straight up trash.","post_message":"Doesn't look like this promoter is playing games! #WSHH #YoungMa"},{"comment_id":"10156528298190206","commenter_b":"She is treacherous!","commenter_a":"IS THIS TRUE???@username, a Republican candidate president and the former CEO of Hewlett-Packard, presents herself on the campaign trail as a hawk on Iran. She promising to take a hardline on the regime in Tehran. However, during her time as the chief executive of HP, she hundreds of millions of dollars worth of products to Iran through a foreign subsidiary, despite strict U.S. export sanctions, Bloomberg reports.","post_message":"I’ve answered hundreds of questions on the campaign trail. Find videos of my answers here:"},{"comment_id":"10153618625791130","commenter_b":"How many more will emerge before she is 30? She is off to an excellent start!","commenter_a":"Sarah Palin has banned all Liberals from entering Bristol Palin","post_message":"Sarah Palin used some very creative English in her Donald J. Trump endorsement."}]
