[{"comment_id":"723136044452880","commenter_b":"We've had enough of these bull Shite DEBATE CRAP!! Stop this insanity, who agreed to this shite?","commenter_a":"wont be watching","post_message":"The debate you can't miss.  Watch Thursday, March 3rd at 9p ET on Fox News Channel and stream live on foxnews.com."},{"comment_id":"558942897646607","commenter_b":"If killery wins we WILL NOT HAVE A COUNTRY! !! ...NWO...WILL SUCK!!!!","commenter_a":"'@username, Hermain Cain is a staunch supporter of the Second Amendment!","post_message":"Live Now: Donald J. Trump's running mate Mike Pence addresses supporters at a rally in Atlanta, Georgia."},{"comment_id":"10153443009598984","commenter_b":"She is a total THUG herself. She is helping to take Baltimore down the sewer. She needs to go it there is any hope for that city.","commenter_a":"I think Sharpton should pay it!!! He caused the riots or Jackson.","post_message":"The fact that she expects Americans to do THIS for her after the things she's said and the way she handled the riots is truly mind boggling.  Are you outraged by the Baltimore mayor's request?"},{"comment_id":"10154793363900575","commenter_b":"Fucking right a wall","commenter_a":"You have a wall? Why you so upset ?","post_message":"THE WALL JUST GOT 10 FEET TALLER..."},{"comment_id":"10153958872340695","commenter_b":"'@username gotta love these white SLOW voter. I bet you probably one of the slos that was going to vote that dunmy Sarah Palin in who thought Africa was a country....thank God for uninformed black voters","commenter_a":"Go Obama!","post_message":"In a rare Oval Office address President Barack Obama sought to reassure Americans shaken by recent terror attacks."},{"comment_id":"992066754146411","commenter_b":"No, we don't want their kind here.","commenter_a":"How great it this to see! The same people who have always looked down upon us Tacoma people are now wanting to live here. Sweet justice is here. :)","post_message":"#Seattle workers are moving from the city to #Tacoma -- in the search for more affordable living! [kiro.tv/SEAtoTAC] Do you think:   A. Seattlites shouldn't have to move, rent control please! B. This is making Seattle traffic worse.  C. Moving to Tacoma or a suburb is a good solution.  D. (Your own answer)"},{"comment_id":"1510863505601322","commenter_b":"Probably the shittest article to ever feature on ifl, absolute horse shit","commenter_a":"Read the article! It should say vitamin pills are not necessary, a balanced diet provides all you need","post_message":"Some vitamins can actually be dangerous - but these are the ones worth taking, according to the available evidence."}]
