[{"comment_id":"1004502652963001","commenter_b":"Better hope Hillary don't get to be President. This country will be a goner in 4 yrs. if she does.","commenter_a":"Oh, so Democrats are crossing over to vote for Trump. I see your game plan Dems. After Nov. gets here and if Trump is the nominee you all will turn around and vote Democrat.","post_message":"#FloridaPrimary"},{"comment_id":"10153187072706107","commenter_b":"How about a constitution change that says if both of your parents are illegal then you're illegal even if you're born here. No more anchor babies. No dream act, no in state tuition, nothing. The illegals are a slap in the face to the people who are legally trying to immigrate.","commenter_a":"Good Paul!","post_message":"Just minutes ago, on Fox News' On the Record, I announced I will introduce legislation this week to cut off ALL federal taxpayer funding for so-called \"sanctuary cities\" -- until they start abiding by federal law.  For taking this stand, I know I'm going to be attacked like never before.  But I think it's high time someone did something!  The truth is, for years politicians in BOTH parties have promised you and me secure borders.  But all we have to show for those promises is sheer lawlessness.  This President has time and again sought to go around Congress with illegal and unconstitutional executive actions regarding immigration.  And now many American cities are following in lockstep in open defiance of federal law!  These so-called \"sanctuary cities\" prohibit the use of funds to enforce federal immigration law, usually banning officers from even asking about a person's immigration status.  These cities become magnets for illegal immigrant criminals and gang members who have been deported multiple times, but know they're safe if they can just stay within a city's borders.  This can't be allowed to stand.  Not when we know terrorist organizations are looking at our porous southern border as a way to gain entry into the United States.  Not if we are to save the concept of rule by law.  My bill would end all federal taxpayer funding for these cities until they start ENFORCING federal immigration law.  I know these cities will shriek and moan that there shouldn't be any strings attached to all of your tax dollars.   They'll say they're entitled to pick and choose what laws they recognize.  And you can bet our national media will be on their side, and come after me with everything they have.  But it's time politicians cared more about keeping their promises to the American people than what our national media says.  If you agree, I need to hear from you right away.  Please sign your \"Enforce Immigration Law\" petition and agree to your most generous contribution of $20.16 IMMEDIATELY: @webpagelink"},{"comment_id":"815781625279081","commenter_b":"this is America bitch dont like it take ur camel and ur fanatical hateful selves back to hubbabubba where the f*** u came from. i fought u over in ur backyard dont think i wont put 1 in u in mine mf","commenter_a":"Yes","post_message":"McDonalds, KFC, And Pizza Hut Say No To Halal Meat And Muslims Are OUTRAGED There is no reason why they should have to change their business for them. Do you support these food chains?"},{"comment_id":"1296209600419509","commenter_b":"She's a evil bitch, liar, corrupt and criminal, she's in the pockets of the big business and lobbying, a warmonger. Vote anyone else but her.","commenter_a":"No shit...the rein malicious and bone headed Republican governance is hurting Business!","post_message":""},{"comment_id":"10153891528986162","commenter_b":"@username John Koester isn't this by you ?","commenter_a":"Abner Calzada","post_message":"WATCH LIVE: Reports of fatalities in active shooter situation in San Bernardino, sources say --> @webpagelink"},{"comment_id":"10153481312808352","commenter_b":"There are other things to focus on ladies. Move on now.","commenter_a":"She looks like like a 10 year old boy with boobs. Way to skinny. You need some curves. She just looks hungry.","post_message":"Woman who got super-toned in SIX WEEKS taking body selfies (and found it so motivational, she launched an app so others can do the same)"},{"comment_id":"10155402759240354","commenter_b":"A bunch of trouble making bitches trying to talk over one another","commenter_a":"Irrelevant opinions from an irrelevant long in the tooth washup","post_message":"**sigh**  WATCH the insanity for yourself."}]
