[{"comment_id":"716457901822319","commenter_b":"You the ugly one!","commenter_a":"She know she UgMo...lol..","post_message":"Isn't this a great response when they questioned Serena about her beauty?"},{"comment_id":"10153266948641336","commenter_b":"Imagine that, another black defending them. WTG Angela, you thug.","commenter_a":"Stupid. So, they support arson, robbing and looting and destroying a city?","post_message":"Beyoncé and JAY Z reportedly paid Baltimore and Ferguson protesters' bail money, an activist claims."},{"comment_id":"10156602448280725","commenter_b":"Yes I just got a form in the mail to change so I could vote for Donald Trump Thank you","commenter_a":"To all Trump voters! If you not registered as a Republican, your vote WON count in your State primary election. Your vote will Not be counted if you are not registered as a Republican. You must register as a Republican ASAP. Find out your state rules and register now. Better yet, don wait, Register Now! Make your vote count for Donald Trump 2016!!! Please share this with Donald Trump voters.","post_message":"Many people voted for Cruz over Carson because of this Cruz fraud. Also, Cruz sent out a VOTER VIOLATION certificate to thousands of voters."},{"comment_id":"10153304563395927","commenter_b":"Democrats own guns,.. You Brainwashed idiots...Gullible fools","commenter_a":"Because their agenda is to control the people without being contested against. Don't you read your Bible? How can a government control its people without being toppled - remove the guns.","post_message":"Criminals don't follow the law.  Why is that so hard for the Left to understand?"},{"comment_id":"10153513195292439","commenter_b":"Too bad for the Muslims that look at a natural act of breast feeding as obscene. They can cut off heads and introduce their babies to horrific killings and slaughter and raise their kids as killers. That is what is obscene.","commenter_a":"Muslim women do NOT have tits.","post_message":"@webpagelink"},{"comment_id":"10154428184215695","commenter_b":"Marely Hernandez leaving a baby alone in an apartment is neglect. I may tell my next door neighbor to watch my dogs while I am gone but if I leave a child I will have someone in the residence with that child. You will see what the definition is when she goes before the judge and faces charges. No one should ever drive without a license regardless of why they are doing it. Breaking the law is breaking the law. A criminal is a criminal! You leave a child alone and all children should be removed from the home until you can prove you are capable of providing a safe environment. It seems that many people need to take parenting classes!","commenter_a":"Just wondering , why did the officers randomly walk into her place ? .. Or should I read the article ? Lol","post_message":"Officers say they found the door unlocked and the child sleeping alone on a bed surrounded by pillows."},{"comment_id":"468867053307454","commenter_b":"Transgender are idiots knockem in the head throw em in a ditch.","commenter_a":"This world is filled with way too many idiots. Please EDUCATE yourself. All of a sudden this is a problem? Where do you think trans people have been going to the bathroom? But ACTUAL pedophiles who like boys is okay? Stop being hypocrites and spreading hate","post_message":"A pledge calling to boycott Target has now reached over 1 million signatures. @webpagelink"}]
