[{"comment_id":"10155216029445500","commenter_b":"Coyotes are indigenous to our state all states. They were driven put west because of our industrialization. Now they have learned how to co- exist with man and have migrated to the east again. Warning - maybe coyotes will make owners stop using this awful leashes the retract and maybe we as a society will begin to respect all animals better . Coyotes are as afraid of is as we are of them bit put a tractable leash on a small dig ad watch an eagle , hawk or coyote take it. Adjust your human responses and behav avoid","commenter_a":"The.coyotes have a human problem. Keep your pets inside. We were the ones who came and stole the land they called home. You have to attempt to keep in mind they are there and adjust a little","post_message":"HEADS UP: Pasco residents say coyotes wandering the streets have been killing their pets. It's almost \"pup\" season, so they travel and hunt more. Here's what you should do if you see a coyote: @webpagelink"},{"comment_id":"1071384586215885","commenter_b":"No, she's just a crazy bitch.","commenter_a":"This is silly. A healthy lifestyle stops Cancer 90% of the time . The other 10% is the govt and environment","post_message":""},{"comment_id":"10153581516273984","commenter_b":"The feds will just print more money huh. That's what's wrong with America is people like you don't know how things operate. The only money that gets printed is money that gets destroyed that banks send back. We are not in debt because we keep printing our own money. We can only print as much money as we have in our gold reserves. The reason we are in debt is because we keep borrowing money from places like China. But see that's the problem with the people in this country, they run to the polls to vote but have no clue how anything even operates","commenter_a":"Trump won't be any better. We will have more wars and more debt. Your pensions and other government ensured money will be gambled away again. The dollar will continue to devalue as the Fed prints money debt money. More American jobs will go overseas to China and Mexico. The middle class will slowly but surely wither away while people wonder what happened AGAIN and do absolutely nothing but complain on the couch or internet. The list goes on and on and on but you reap what you sew I guess. It is always the younger generation who has to clean up the mess of the old as always.","post_message":"Donald J. Trump just ripped apart Obama's Iran deal with 6 blunt words that hit home to millions of Americans. You know Obama hated hearing him say this, because Obama knows it's the truth."},{"comment_id":"10156862030995389","commenter_b":"Governor Mike Huckabee said it best....If Ted Cruz isn't guilty of affairs with the five women, then he should bring charges against the National Enquiry. Otherwise, there may be something to it!","commenter_a":"Barf!!","post_message":"Get free tickets for Sean’s EXCLUSIVE event with Donald J. Trump in Milwaukee, Wisconsin MONDAY, April 4th at 5p ET. @webpagelink"},{"comment_id":"1850200075215990","commenter_b":"@username and ur moms va jj. And i was being sarcastic you simpleton","commenter_a":"No roof? Im telling you this is deeper than you all realize. Doesnt add up. Id evacuate","post_message":"Chopper 6 was over the foam spill and hazmat situation in Center City around Juniper and Lombard. The foam spilled from a fire supression system at PECO substation. More information: @webpagelink"},{"comment_id":"953630401426610","commenter_b":"You are not Deplorable Hunny!! She is just Evil!!","commenter_a":"I am an immigrant who came here LEGALLY...just because I want LEGAL immigration and I want nthe Border Wall...Acc. to Hilary I am in the basket of \"DEPLORABLES\"","post_message":"Donald J. Trump speaks at the The Remembrance Project National Conference in Houston."},{"comment_id":"10154535880412235","commenter_b":"Get your story straight. Us woman shouldn't raised our hands on a man and expect not to get hit back. That's what's wrong with our society.","commenter_a":"She's doing to him the same thing that easy-to-use girl did to Kobe Bryant. She was \"admiring\" his jewelry a little too damn much.","post_message":"THIS JUST IN..."}]
