[{"comment_id":"10154612435337042","commenter_b":"For this comment I sincerely hope you choke on the next dick you suck. LMAO","commenter_a":"There's 83,000 Syrians and BLM thugs available.","post_message":"It's almost the holiday season -- and Macy's is hiring 83,000 seasonal employees.  Here's how you can apply:"},{"comment_id":"10153506757381509","commenter_b":"Maybe the people voting on abortion laws should reconsider......","commenter_a":"She needs to be charged with murder.","post_message":"Dynel Lane, 34, has been charged with criminal attempt to commit murder in the first degree, unlawful termination of pregnancy, and seven other counts for allegedly cutting a fetus from a pregnant woman's womb. @webpagelink"},{"comment_id":"786579818199262","commenter_b":"He SUCKS DICK..........","commenter_a":"Dangerous would be the truth.","post_message":"BREAKING: Obama Makes Sickening Announcement, This Will Cost Lives  He will ruin this country before his term is up.  Do you think Obama is reckless?"},{"comment_id":"1816579521955760","commenter_b":"'@username please explain since you are, 'so sure'. Provide facts. Also, a bit of advice folks, just because you believe it doesn't mean it's true.","commenter_a":"No matter the outcome, people who voted for him and constantly protect him with ignorant comments, will just keep saying 'we won, we won'. They aren't exactly sure what they won since their candidate keeps back peddling on his entire platform. They'll just know that they won. We all lost. Ignorance, racism, labels, anger, and an immature person won.","post_message":"Computer scientists spot voting irregularities in swing states two weeks on from Trump's election."},{"comment_id":"718460845008873","commenter_b":"never happen... if they couldn't massage their egos with those little golden idols... their would dry up and blow away.... or perhaps blow each other (y)","commenter_a":"Oscar - a trophy given by actors to actors for being actors. Like it makes the world a better place - NOT.","post_message":"Hollywood SCUMBAGS Might CANCEL the Oscars to Protest Trump"},{"comment_id":"1029984087043663","commenter_b":"Lying Bitch!!","commenter_a":"Now that Hillary has come up with the idea of barking like a dog if a Republican or Bernie lies,I think its a super idea and should be applied to her. The problem is if you barked at her everytime she lied it would sound like a pound and never stop!","post_message":"Hillary claims she's always tried to tell the truth to the American people - but I think many of them would beg to differ...  Do you think Hillary Clinton has been dishonest?"},{"comment_id":"706998779490700","commenter_b":"I'll help her pack!!! Don't let the door hit your big fat ass on the way out!!!!","commenter_a":"She is as big a piece of shit as her husband","post_message":"Michelle Obama was caught bad mouthing America in this newly surfaced video. If she doesn't like America, she can leave. Would you be happy if Michelle was gone?"}]
