[{"comment_id":"10153504938416336","commenter_b":"This woman, is what evil looks like. They all must be shut down!!!!!!!!!!!!!!!!!!!!","commenter_a":"Wonder what she would do with video of Charlie boy's gang inside the Tate house? Give them medals? #FreeCharlie!","post_message":"Calif. AG Kamala Harris will use her office’s authority to regulate charity organizations to see if the organization that made the videos violated registration or reporting requirements, or broke any other rules."},{"comment_id":"10157403698925354","commenter_b":"This was a public city pool not a water park","commenter_a":"It happened at a water park here,as well, but never made the news?? What I want to know is how the refugees were able to afford the park. I have passes for my family but it is not cheap.","post_message":"IT'S STARTING. ***Report: Massachusetts Syrian 'Refugee' Swimming Pool Sex Attack of 13-Year-Old Girl***"},{"comment_id":"10152700019752212","commenter_b":"While I understand what they are trying to do, forcing a certain body shape (or denying a certain body shape) under penalty of law is rather draconian. They might better serve the public through education.","commenter_a":"In this day of unrealistic, unattainable goals for what is beautiful, unless you go under the knife or starve yourself. I say Amen. Keep it real.","post_message":"HOT TOPICS: France has passed legislation banning models deemed excessively thin. The law also imposes steep fines and possible jail time for any agent and modeling agency who hire them. The law focuses on the model Body Mass Index (BMI) and bans anyone whose BMI is, according to the law, than levels proposed by health authorities and decreed by the ministers of health and labor. Opponents of the law think that the criteria for banning a model is too rigid; that BMI alone is not a good judge of who is and isn healthy. Others, though, say they happy the law is put in place. They think the law will stop glorifying an unhealthy body image. #9HotTopics What do you think? Robin Marsh and Lacie Lowry may share your comments today on News 9 at Four!"},{"comment_id":"1135734373128367","commenter_b":"Luke Brandon he's going his own way","commenter_a":"She has been nothing but a big disappointment and embarrassment to herself since she divorced her first husband. He built her and her career has gone nowhere but down the tubes since that divorce, as she insist on living the life of shame and sleaze.","post_message":"Claims Mariah Carey's keeping the HUGE engagement ring"},{"comment_id":"10155112416861729","commenter_b":"Just ignore the cockroach she will leave.","commenter_a":"Whoever voted already needs to go and vote again in November 8th! We have learned (thanks to Hillary ) that we can vote multiple times! That way the democrats won't be able to control all the votes!!","post_message":"Your feel-good story of the day, folks!"},{"comment_id":"10154392654096509","commenter_b":"Hotel California!!!!","commenter_a":"my prayers ...rest in peace","post_message":"Glenn Frey played guitar and keyboard and took lead vocal duties for the Eagles on tunes like \"Take it Easy\" and \"Tequila Sunrise.\" What's your favorite song from the band?"},{"comment_id":"10153340165340927","commenter_b":"@username Please elaborate...","commenter_a":"How can anyone expect GOD to bless America, if we the people keep electing leaders that are legalizing sinful behavior.","post_message":"\"Well, to be honest, we need to go back! Back to God. Back to respecting and honoring His commands. Back to COMMON SENSE ...\""}]
