[{"comment_id":"10153641975856234","commenter_b":"I don't know if it is objective or not. Some day we may find a genetic marker for transgendered people. In the mean time, you can travel to a state where you can find a chick with a dick to stand next to you as you pee.","commenter_a":"Interesting that the states with the lowest tax rates are places where I would NEVER want to live. I guess you really do get what you pay for.","post_message":"State and local taxes in the Garden State were 12.2 percent of income. See how that compares to other states."},{"comment_id":"10154264665781336","commenter_b":"No @username My dad is a legal immigrant my dad learned today that his vote is worth crap and the party will NOT listen to his vote and they will do whatever unless you bribe politicians You can take your negativism and stuff it up your butt","commenter_a":"Why even be a Republican or Democrat when they throw away your vote and DO NOT LISTEN No LONGER a party member of anything","post_message":"\"We don't feel that this was a fair process. The Trump button got checked more than any other, so why do we have so few delegates?\" said State Treasurer Jeff DeWitt."},{"comment_id":"1198337853547380","commenter_b":"Simple solution, ARREST Them and prosecute to the full extent of the law! They keep doing this crap because they are not being prosecuted!","commenter_a":"Yes","post_message":"These loons need to be locked up!"},{"comment_id":"1493294134044387","commenter_b":"She is pure evil & should be put to death.","commenter_a":"Hillary is done the writings on the wall god look at the rallies know it's there for her no signs no bumper stickers no T-shirts and say Hillary for prison. She's a criminal and should prosecuted","post_message":"Wow!"},{"comment_id":"10152771532479342","commenter_b":"His other girlfriend","commenter_a":"Who do you think he's talking to on the phone.... his wife....","post_message":"The game is tied in the fourth quarter and you're not even paying enough attention to realize you and your girlfriend are on the kiss cam?   There are many things wrong with this sports \"fan,\" and he gets what's coming to him.    SEE VIDEO --> @webpagelink/  What do you think -- real or staged?"},{"comment_id":"608627489270433","commenter_b":"More like the other way around...in Indian culture it's arranged for money issues, not love...and then the wife's are treated like maids...atheist she can be a maid to a person who loves her, for her and not for the money","commenter_a":"At least he didn't end up stuck with her.","post_message":"This has to be the worst Bride OF ALL TIME!"},{"comment_id":"997885863556217","commenter_b":"LOL -like a woman has time for that","commenter_a":"That was a woman who was all masked up","post_message":"The clinic staff say they aren't going anywhere"}]
