[{"comment_id":"10155927830195354","commenter_b":"Donald Trump is going to be the next President...you can take that to the bank...","commenter_a":"Why don't they read these polls, it's too obvious to conservatives like me. Do I trust Trump, not totally, but I do more than most of the GOP minus Ted and Rand. Let's get this country back conservatives, go Trump","post_message":"When over half your voters don't feel like you're looking out for them..."},{"comment_id":"10154285238753984","commenter_b":"Dumb fucks.","commenter_a":"Yeah your baby sixteen not thirty???? but with a gun???? l bet he said before l'm a man a man he probably never said l'm a baby!!!! He pointed a gun at some cops you don't do that.If you point a weapon at someone it's to use it.And a good baby doesn't run from cops!!!! A gang member thug??? a baby???pleaseeeeee!!!! Over all it's sad when a young teen dies in this awful way. But you!!!! the parents of this teen is to be blame even charge with child cruelty for not teaching your baby respect since the beginning!!!! again it angry's me the ending of this young man!!!!","post_message":"A police officer chased the 16-year-old after he says the teen fled on foot from a car and then pointed a gun at him, which resulted in the shooting. Protests immediate erupt after eyewitnesses make this huge claim about the incident..."},{"comment_id":"828526300671280","commenter_b":"Hillary can't control own husband......let alone our country.","commenter_a":"incompetent bitch would not have far to go thanks to obummer .","post_message":"This is the worst thing that could of possibly gotten out.  America has to do whatever it takes to keep them away from the White House.  Do you think Hillary will run our country into the ground if she gets elected?"},{"comment_id":"682384888576953","commenter_b":"Dumb woman.","commenter_a":"Well she said she meant it in jest and didn't much care if people are offended. So she did admit she was the person that posted it. Now that the voters know who she is the question is will the party still support her. My guess is yes.","post_message":"And you know it wasn't her fault, right?"},{"comment_id":"386115264910101","commenter_b":"She needs to die. She would never have gotten any place in this country without white people. I hate that racist trash.","commenter_a":"She sounds like she is mad at the world .","post_message":"Oprah plays the race card again..."},{"comment_id":"10153705245475667","commenter_b":"Build that wall tall!!","commenter_a":"Libertarian is just another word for Republicanism!","post_message":"Libertarian presidential candidate Gary Johnson talks with Paul Singer."},{"comment_id":"10153229649411770","commenter_b":"Spank her, then send her to jail where she belongs!!","commenter_a":"If we are going to keep Hillary out of office we need Trump and Cruz to team up. That's a ticket that would put the republican's in office and would reverse all of this crap. But it's going to be left up to us to flush this Muslim crap down the toilet and out of our country. It does not belong here, it will never get along with western culture.","post_message":"Ted Cruz warns Hillary Clinton that \"in America the voters have a way of administering a spanking.\""}]
