[{"comment_id":"906985682657621","commenter_b":"She didn't come up with it! If she tries to patent it Nicki Minaj will sue her. Nicki said SHE came up with the word. SMH, that word has been around for 20 years.","commenter_a":"She needs to get a copyright or a patent for the word because people these days will try their best to steal your joy! IJS","post_message":"How Kayla Newman Created “On Fleek” While Her Mom Shopped At Burlington @webpagelink"},{"comment_id":"10154913988378701","commenter_b":"I would ban that woman from the store.","commenter_a":"What a fucken cunt!!!","post_message":"\"One of their female employees Jessie? Jennifer? J something is disgustingly obese, and each time we come in, although she does her job and is very polite, instantly makes my appetite disappear,\" the customer's Yelp review read in part."},{"comment_id":"10153078951184255","commenter_b":"Soon...","commenter_a":"This is a problem for men too. Imagine the state taking your testes and telling you what you can do with them.","post_message":"American women, in states both red and blue, have been detained, imprisoned, and even forced to undergo unwanted surgery because they have been guilty of being pregnant."},{"comment_id":"1774855949444875","commenter_b":"Really are we surprised??? He has been committing political suicide for over a week now and handing it to Hillary with the comments about over weight women, his tax evasion, and then of all things to attack the vets???? Pitiful win if you ask me and sad that she is not winning with a landslide.","commenter_a":"Pence is going rogue! :):) He's pulling a Sarah Palin....he's running in 2020! :):):)","post_message":"A new poll in one key battleground state shows Donald J. Trump's campaign facing some trouble ..."},{"comment_id":"1108096825935519","commenter_b":"Lol...dumbass","commenter_a":"Funny.","post_message":"Anybody who holds up a cop car at gunpoint isn't the brightest person in the world. This thug, however, was especially dumb... he didn't see what was behind him. This ended REALLY badly... and it was all caught on video."},{"comment_id":"10155023527124614","commenter_b":"Oh it was...Sears. It's been awhile since this happened.","commenter_a":"It's sad to see Sears going this way. They lost their way and are seemingly heading towards permanent closure. What's sad is I think Kmart is to blame, whoever at Sears approved that merger with Kmart as they were going through bankruptcy was crazy.","post_message":"Sears Holdings announced today the closure of dozens of Kmart and Sears locations, including multiple locations in California. Stores in Riverside, Bakersfield, Coalinga and Kingsburg will be closed by the end of March, according to officials. decision to close stores is a difficult but necessary step as we take actions to strengthen the Company operations and fund its transformation. Many of these stores have struggled with their financial performance for years and we have kept them open to maintain local jobs and in the hopes that they would turn around,\" officials said in a statement."},{"comment_id":"10154746027261350","commenter_b":"He's the Man!","commenter_a":"@username thought you'd appreciate this story.","post_message":"WATCH: 8 years. Over 2 million photos. White House photographer Pete Souza has captured some amazing moments during President Obama time in office. @webpagelink"}]
