[{"comment_id":"10154166667183205","commenter_b":"Very well done mr. Congressman, proud to have shaken ur hand once when u visited vegas.","commenter_a":"Thank you! I'm proud of you! great speech! Facts and more facts!","post_message":"I gave a speech this morning on the House Floor welcoming the new leader of the Republican Party to Capitol Hill and showing him what is on the menu in the cafeterias today -- taco salads (the food Republicans eat to show their love for The Hispanics) and strawberries (which almost certainly were picked and packed by undocumented farmworkers), which is a little ironic given that the GOP now wants to deport 11 million people, mostly Latinos, from the U.S."},{"comment_id":"10156161317710354","commenter_b":"the American police would be arrested for this.","commenter_a":"\"....it became clear to German authorities that a significant number of migrants they were trying to process were NOT Syrian refugees...\" They finally came to that conclusion?","post_message":"Chanting \"ALLAH HU AKBAR”...Pelting Police with Giant Rocks...MORE... Follow Breitbart London for up-to-the-minute breaking coverage of the migrant crisis..."},{"comment_id":"10154273647523812","commenter_b":"Hell no!!!!","commenter_a":"@username so no beach this weekend","post_message":"Aerial video shows large school of sharks seen in Fort Lauderdale, Florida."},{"comment_id":"958393367537826","commenter_b":"All blacks destroy their housing and no whites do right Shawn?","commenter_a":"Yeah how dare those desperately poor people in Africa decide what they can do with their own resources to get some income from wealthy people who want to spend it.","post_message":"52 percent of all lion trophy exports end up in the U.S., and its share of the trophy trade has been growing. #CecilTheLion"},{"comment_id":"10153188976024087","commenter_b":"Ethyl Rosenberg did less and thy fried her in the electric chair!","commenter_a":"Go Hillary , ignore the naysayers , they don't even have a real scandal , crime or violation , ignore the fake media , stay focused on the real issues that Americans truly care about","post_message":"Senior aides to Hillary Clinton will meet with Democratic lawmakers at the Democratic National Committee offices on Thursday to discuss messaging and strategy as the presumptive front-runner's numbers continue to fall."},{"comment_id":"10153543031078812","commenter_b":"If you are crossing borders illegally... You broke the law, entered our country without proper credentials and then I'm suppose to foot the bill? Hell no, if I have to follow the rules, then so should the ILLEGAL immigrants!!!","commenter_a":"In my opinion he offended not only #mexicans but all imigrantes that have to cross any border w/ USA. MY RESPECT to anyone that comes to the USA trying to have a better life.","post_message":"NEW: Univision dropping Miss USA pageant and cutting all business ties with Donald Trump over comments about Mexican immigrants: @webpagelink"},{"comment_id":"10153774153353145","commenter_b":"hello your in AMERICA","commenter_a":"If this sign dictated what language I spoke at home or with my friends, I would take offense. But if this sign was at work, I think it is appropriate to expect English. You shouldn't be off carrying on non-work related conversations anyway, English or not.","post_message":"English only? Many Hispanics who use the Deltona Community Center took offense to this sign. How would you feel if your job tried to enforce this rule? The organization said the sign was necessary for safety reasons. @webpagelink"}]
