[{"comment_id":"10153482045808984","commenter_b":"She is a nut","commenter_a":"I would hate to have lived under her roof , she is not fit to be president. Or anything else.","post_message":"Hillary Clinton is known for her liberal view on just about every topic she chooses to sink her teeth into. And looking at this, her next move might be to include children in her agenda...  Do you think Hillary needs to be stopped?"},{"comment_id":"932284180186448","commenter_b":"illegals has no rights go back home and come back legally.","commenter_a":"This is DO or DIE, America!!! We need Trump in the Oval immediately! He will fix this mess Obama has put us all in and we so desperately need him! I'm voting Trump 2016!!! Who's with me?!?!","post_message":"\"We have to stop with political correctness! We have to create a country that won’t have people flying planes into the World Trade Center and stop the shooting in California. If you can’t use the terms “Islamic terrorism” you can’t solve the problem.\"  #TrumpTrain #GOPDebate"},{"comment_id":"10156328983890389","commenter_b":"just a dried up old liberal lying witch .","commenter_a":"The appearance of former secretary of State Hillary Clinton before the House Select Committee on Benghazi raised very important questions on diplomatic security, the relationship between the secretary of State and her ambassadors and leadership. My experience during 38 years in the Foreign Service, including six assignments as an ambassador, has given me a perspective on these issues that differs from some of the arguments developed by the Committee. First, about security. Every secretary of State and every ambassador has security as a top priority. It is a dangerous world, and we are everywhere in it. An ambassador is responsible for the security of her personnel and her embassy. Internal defense plans, risk assessment, movement controls, adequate defensive systems these are all on the shoulders of the chief of mission. The department is responsible for getting her what she says she needs. There is no perfect security. Risk has to ...","post_message":""},{"comment_id":"455025114688069","commenter_b":"yes","commenter_a":"CNN sucks","post_message":"Should Networks Like CNN Be Shut Down?  Comment 'yes' or 'no'"},{"comment_id":"10152980541131336","commenter_b":"These creeps need to be exterminated.","commenter_a":"Islam is winning...","post_message":"German police canceled a popular carnival street parade less than 90 minutes before it was set to begin, because of fears of an imminent Islamist terror attack."},{"comment_id":"934978476568908","commenter_b":"Hahahahaha","commenter_a":"@username Jeff Smolen @username lmao","post_message":""},{"comment_id":"10153885803644411","commenter_b":"Those UkraNazi cockroaches belong in the trash bin.","commenter_a":"Ha! The \"Trash Truck.\" lmao... Never was there a more worthy chariot for such an unworthy set of a-holes.","post_message":"It is also not certain how much protection the new tank will be able to give those operating it, as its armor is a mere 40mm thick."}]
