[{"comment_id":"1738737039712860","commenter_b":"Republicans are not racist like the democrats would like you to think we just want a safe and secure country. They blocked him bc he wants to give our country away!!!! Illegals do not belong here!! There should be no sanctuary cities to protect them. Anyone coming here needs to take the steps to be a citizen first!!","commenter_a":"Y all the hate? What have Obama done that is so terrible? To my opinion he is one of the best. They races republicans stop him since day one, cuz they want him to fail. Block him all the way...","post_message":"President Obama's approval rating stands at 55% in a new CNN/ORC poll, the highest of his second term"},{"comment_id":"939719642754180","commenter_b":"Or he could just drop dead and save his family the embarrassment and the courts the cost.","commenter_a":"IF any of this is even true, if you waited this many years, you own it. Grow up.","post_message":"The once beloved comedian will hopefully not get away with his alleged horrific crimes against women."},{"comment_id":"10153365058753984","commenter_b":"Absolutely! They are bully cowards! It's going to be like exterminating roaches! We've let them go way too long!!!","commenter_a":"Yes","post_message":"This is scary. I pray America doesn't see further acts of terror from this group, but it sounds like these jihadists have something else in mind...  Would you support wiping out ISIS?"},{"comment_id":"10153921301277217","commenter_b":"@username has lost their integrity!","commenter_a":"Hahaha.sorry for the laugh. But @username Please investigate first before you conclude on this report. These are all accusations to our beloved president . even his rival denied those witnesses that testified in the senate. sad to say our president's rival now is doing the best they can to destroy our only hope to have a drastic change in this country . BTW You need to go to our country first to know more abt the facts and whats really happening here. :3 -_- #PostResponsibly -_-","post_message":"Gruesome gangland-style hits, including feeding one victim to a crocodile, were described to a Senate hearing by a former death squad member."},{"comment_id":"10152774860755927","commenter_b":"Is this wife beater and Obama DNA guzzler still relevant?","commenter_a":"The question is does Reid understand the U.S. Constitution? He should not try and put pressure on the Supreme Court. Reid is a pathetic old ugly man. He is mean and unhappy in life. Can't wait till he is standing before his Maker. Won't be a pretty sight for sure","post_message":"WATCH as Senator Harry Reid maligns the U.S. Supreme Court on forthcoming Obamacare decision "},{"comment_id":"1267665493274190","commenter_b":"Well Dana maybe if us \"poor white Trump supporters\" didn't have to pay so much in taxes to support all the welfare democratic trash (of all races) and all benefits for the illegals we would be able to live more the style of the freeloaders or better!","commenter_a":"lindo","post_message":"We are going to build a wall - and make America SAFE again!"},{"comment_id":"10154491854776002","commenter_b":"Yeah, she's a great mother!?!? Ha. Get those poor kids away from her immediately; lock her away with the scum husband.","commenter_a":"Seriously-not only her but her husband has committed the same crime-hurting thousands of others-stealing money from the government and she wants a break?!!!!!!","post_message":"Washington is asking the judge for a massive break. The judge ordered her to serve four years in prison, but she is asking not to go to turn herself in for five years so she can stay home with the kids while their father serves his time for the same crime."}]
