[{"comment_id":"1009028342550450","commenter_b":"She is having them killed","commenter_a":"Hell yes she is responsible for that","post_message":"BREAKING: Another Clinton Associate Set To Testify Against Hillary Found Dead There's no way this is a coincidence. America deserves to know the truth. Do you think Hillary is responsible for this?"},{"comment_id":"759924327531478","commenter_b":"Just showing up is prolblem for me. Trash that is all she is","commenter_a":"Yes","post_message":"You Won't Believe What Hillary Clinton Was Caught Doing During Nancy Reagan's Funeral This is really does speak volumes to what kind of person she really is. Do you think Hillary Clinton would make a terrible president?"},{"comment_id":"10154262387346509","commenter_b":"What is justice? Isn't it making something \"just\"? If so, how is justice possible in cases where the crime can't be reversed? If someone steals a $100 bill, justice can be had by paying it back to the victim. You can't undo rape, murder, abuse... etc. So then it comes down to punishment, coping, and vengeance. Punishment is negative reinforcement to change someone's behavior. Coping with a problem is minimizing or eliminating the threat. If someone is an immediate threat and won't be considered fit to be in society, that means prison or death. Vengeance is just getting revenge and causing suffering to deal with suffering/pain.","commenter_a":"I hope the suspects are found alive, justice must be served","post_message":"“I heard rapid shooting — just boom, boom, boom …” Eyewitnesses describe the scene of a mass shooting in San Bernardino, California. @webpagelink"},{"comment_id":"10154736430788984","commenter_b":"I think she's loosing her butt and I'm glad!","commenter_a":"So go be a Grandma and get out of the race.","post_message":"It took Hillary Clinton less than 15 words to show her debate strategy in a very clear way. Do you think Donald J. Trump is winning the debate?"},{"comment_id":"1009117072471350","commenter_b":"How typical for illegals to play the race card while obviously not understanding the term racist.","commenter_a":"No one in their right mind should support Trump","post_message":"Add Lindsey Graham to the list of Republicans who say they will not support Donald J. Trump."},{"comment_id":"1354769341225150","commenter_b":"How'd you like this one -60% of the USA. illegal population resides in the Golden State. That is one of many reasons why our politicians support this crap! Frankly, that is one reason why our state taxes are incredibly high and the other is bad management without accountability. We also have a disproportionate amount of refugees getting relocated here and illegals residing in our prisons.","commenter_a":"Californians are beyond reasoning!!! They refuse to obey a national law on harboring illegal aliens, and yet have the gall to ask for funding to support those illegals they are harboring!!! NO FEDERAL FUNDS SHOULD GO TO CALIFORNIA UNTIL THEY DEPORT THE ILLEGALS THEY ARE HARBORING!!!!!","post_message":"I can't believe they asked for THIS!"},{"comment_id":"467726553428449","commenter_b":"racist ignorant rebooblican whore","commenter_a":"Both parties need to stop!!! Make America Great!!! Both parties are annoying.","post_message":"Obama wants her head, but Ann Coulter is standing her ground. This is bold. She needs our support. Can we get 50,000 'LIKES' for Ann Coulter?"}]
