[{"comment_id":"1241639679186713","commenter_b":"What A Dumb Bastard !","commenter_a":"Without Freedom of and from Religion America is not a Free Country! Separation of Church and State! #VOTE The Republican #PARTYOFHATE out of local state and Federal Government #ENOUGH #VOTE #GUNSENSE #VOTE #Hillary2016","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10152982438537217","commenter_b":"Hooray! Now show me the first 4 corpses of native Indians killed by the illegal immigrants from Eng And.","commenter_a":"Bet the Native Americans are over the moon about this! #genocide","post_message":"They were four of the first English men to colonise America"},{"comment_id":"10157204409490206","commenter_b":"This chick is so full of crap.","commenter_a":"He makes John Lennon seem like a man and Ryan Leaf viable.\\b","post_message":"The disgraced quarterback allegedly hit his ex-girlfriend on the side of her face, rupturing her eardrum, and she's reportedly still unable to hear out of that ear."},{"comment_id":"10153195780106130","commenter_b":"I'd give her an orgasm!","commenter_a":"Who's the asshole out there denying women orgasms??? Selfish prick!","post_message":"'Don’t not have an orgasm. Make sure he knows that you’re entitled to an orgasm.'"},{"comment_id":"10153061707381051","commenter_b":"Stupid bitch needs her face slapped until she falls out..","commenter_a":"She is no mother, glad to see someone finally called the police on one of these child abusers rather then just posting it.","post_message":"Onlookers were genuinely shocked when they saw how this teen mom was treating her child."},{"comment_id":"1089539017791300","commenter_b":"Hillary belongs in jail! Do your job Congress.","commenter_a":"I would think about why she dosen't answer the question","post_message":"This state rep took a huge stand against Hillary and even called her out at one of her rallies.  But the rep had no idea what she had gotten herself into.  Now she says she carries a gun because of what Hillary's goons have done to her."},{"comment_id":"859150960886345","commenter_b":"You weren't forced to come either bitch!","commenter_a":"It kills me that someone who is not even from America can say such racist crap @username. Just remember or learn about the history of slavery and the continued discrimination today from immigrants like you who wasn't forced on a boat to come here. It's because of African Americans you have the freedoms you have today. Please don't comment on something you know nothing about and actually learn about the injustices African American people are facing today. You sound just like these ignorant people who always got something to say behind closed doors. I guess you wouldn't know about white supremacy because you've bought in to this bs white people have taught you in America. I guess all the killings by white police is something new. You have no idea what it's like to be black and to get even immigrants being racist towards you the same immigrants Martin Luther ...","post_message":"The Debt Collection Industry Is the Epitome of Systematic Racism"}]
