[{"comment_id":"1299289040084712","commenter_b":"It was an independent anti-Trump, Political Action Committee. The chair said she doesn't support Ted Cruz. She is only anti-Trump.","commenter_a":"they attacked Melania first and Trump has as much right as Cruz does to protect his wife. If they don't want to get attacked don't attack him !!","post_message":"Nailed it, Senator."},{"comment_id":"10153715953211336","commenter_b":"America can't wait for these 'Rug Rats' to grow up. We need action NOW.","commenter_a":"Very true!!","post_message":"ICYMI: Dr. Ben Carson said that fiscal irresponsibility is ruining the future for younger generations. What do you think? More from the GOP candidates at the Values Voter Summit: @webpagelink"},{"comment_id":"743297559178019","commenter_b":"Dumbest fucking answer. Trump met with the black panther party and several top gang members from Chicago to reduce body counts and help fix the black community. Dumb asses mistake for deportation of illegals vs legal immigration. Left supporters are the dumbest people on the planet.","commenter_a":"Good !!! Just makes More room for the REAL PATRIOTS","post_message":"\"I'm not going to the White House. I don't feel accepted in the White House.\""},{"comment_id":"551801648301945","commenter_b":"I don't get it?Hillary will finish off this country!why not trump?He loves this country,He loves our military,he will get jobs bk from china&other countries that are ripping us in every way,He is rich enough that he doesn't need donations or special interests groups.That sounds a lot better than flooding America with illegal immigrants,Raising Taxes,&bankrupting the Country.","commenter_a":"I like Sanders but I believe he is too far left to win. Hillary has baggage but I believe she can win. Either way we have to keep the GOP out of the White House","post_message":"No matter which candidate you support - attacking each other isn't helping the cause. ~Marty"},{"comment_id":"10154258956738352","commenter_b":"Congratulations. Amazing lady.","commenter_a":"Twins!","post_message":""},{"comment_id":"10153895768928132","commenter_b":"Showing your butt in public doesn't empower women. It's the opposite. It shows women as sex objects. It shows little girls that is ok to post pictures of them naked. It shows those real woman with curves that if they don't look like that, they are not\"normal\".","commenter_a":"Beautiful!","post_message":"You rock, Demi Lovato!"},{"comment_id":"10153875721181770","commenter_b":"She is sipping Hillary juice.","commenter_a":"Nancy Pelosi IS a train wreck - so I would expect nothing less!","post_message":"Nancy Pelosi's Sunday morning interview on CNN was an absolute train wreck..."}]
