[{"comment_id":"437108856413709","commenter_b":"He will CERTAINLY BE BETTER THAN THE MORON IN THE WHITE HOUSE NOW!","commenter_a":"Agree","post_message":"'I will be the greatest jobs president that God ever created'. Agree or disagree?"},{"comment_id":"10154510747482446","commenter_b":"exactly wouldn't lower myself following that nasty woman.","commenter_a":"Hate mongering liberal degenerates that do what they normally do... Act like revolting pieces of trash that they ALL are","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154375635804342","commenter_b":"'@username oye pendeja....white girl....give it a rest!","commenter_a":"As long as Trump doesn't show up, I don't see the problem. He can't help who supports him, just like Hillary can't help that all her supporters are cry babies.","post_message":"One of the largest Ku Klux Klan groups in America plans to celebrate Donald Trump's election with a parade."},{"comment_id":"10152807087037434","commenter_b":"Sad & in no way did I consider her or her character on sex in the city a role model ! This is sad because she made a ton of $ pretending to be a woman that writes for a living- most (not all) writers know the definition of a word before the use it or wish for a movement in its name! Geesh SJP can't you pretend to be smart????","commenter_a":"I think people need to stop asking celebrities for their opinions on feminism. They are just as likely to be total ignoramuses as anyone else. Exhibit A right here.","post_message":"'We would be so enormously powerful if it were a humanist movement.”"},{"comment_id":"10154140456978256","commenter_b":"Sara Califf.....Illinois doesn't have a taxing problem... They have a spending problem.... Bloated government is Illinois problem.... Too bad the pensioners are the ones who will suffer","commenter_a":"Democrats need to raise taxes to keep Illinois, and Chicago government revenue stream to maintain the bloated government.... Probably need to build a wall around Illinois first, to keep resident's from leaving for other states","post_message":"Election-seeking Illinois Comptroller Leslie Geissler Munger plans to delay monthly paychecks for lawmakers and statewide officials, saying there isn't enough money to pay the state's bills and other services should go to the front of the line."},{"comment_id":"10152862835371336","commenter_b":"The ft hood shooter was an American serviceman","commenter_a":"What about Benghazi and Ft. Hood?","post_message":"'This is an act of violence, an act of terrorism that we condemn in the strongest possible terms, and we are going to stand shoulder to shoulder with our allies in France.' – White House Press Secretary Josh Earnest on America's Newsroom moments ago"},{"comment_id":"644296295760949","commenter_b":"I'll wipe my butt with everyone that comes my way","commenter_a":"Not even on a penny","post_message":"Obama is trying change our countries money.  He has absolutely no right to even consider this change.  Do you think Obama deserves to have his face on a dollar bill?"}]
