[{"comment_id":"1122771727815880","commenter_b":"I wouldn't want that pussy fighting next to me.","commenter_a":"Draft Dodging Coward","post_message":"Donald Trump is just another Republican chicken-hawk. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1757028301196802","commenter_b":"@username more than likely you are a illegal alien .","commenter_a":"Just the thought of having a mother/grandmother in the highest office..refreshing! Go Hillary! Have a great day with your wonderful family!","post_message":"Happy Mother's Day to Charlotte's mom, and my wonderful daughter, Chelsea Clinton."},{"comment_id":"10154042885608352","commenter_b":"N BITCH U HELLA UGLY..LOL.LOL.N GET UR HAIR FLAT IRON POOFY HEAD HOE!!YEA U A DIRTY HOUSE HOE,YEA U CAN STAY MAD,WAY N ALABAMA. TALKING SHIT..YEA U WOULD...","commenter_a":"SHE TALK ALL THAT. SHIT,N SHE A PUNK ASS HOE!!!MAKE US WOMEN. LOOK. BAD N US WIFE'S....DUMB ASS!!","post_message":"Mo'Nique Defends Letting Her Husband Have A Side Chick! Says 'That's When The Relationship Is Real'"},{"comment_id":"10153534802752217","commenter_b":"It's knowledge obviously. Go look up the definition of Asylum if you are that uneducated @username","commenter_a":"They are all migrants, NOT refugees if they didn't claim asylum in Greece or Turkey for that matter. Your reporter needs educating.","post_message":"More than 11,000 refugees and migrants are camped on the Greek side."},{"comment_id":"10153370538292144","commenter_b":"@username She's a Republican.","commenter_a":"Not all republicans are pathological liar but all pathological liars are republican.","post_message":"\"This is not normal political hucksterism. It's a pathological disregard for the truth.\" —Kevin Drum"},{"comment_id":"1852101905022122","commenter_b":"trump is nasty","commenter_a":"I still can't vote for either of them...","post_message":"WATCH: Hillary Clinton and Donald J. Trump go head to head in the final presidential debate, live from Las Vegas."},{"comment_id":"10155114674037558","commenter_b":"One sick BITCH!","commenter_a":"Let me make this clear! We paid taxes to support our children completely in our schools. We did not pay taxes to make you richer, honey... Getting a fat paycheck to make inappropriate jokes about hungry children is not funny to the best of humanity - Just to you! Ms. Rich Monster - (Your Word)","post_message":"You put these Republicans all in one room and they say some evil things."}]
