[{"comment_id":"1024492464317039","commenter_b":"@username, we can send all illegals home and we'll start with you! Mexican Americans/Native Americans are the only people who this land belongs to. So dip","commenter_a":"Where's the mom so she can start putting graduation pictures up and say that her kid never did anything wrong that he was a good kid and never did drugs Ill be waiting","post_message":"NEW VIDEO: #Chicago police have just released dashcam video that shows a female cop being beaten by a man who was high on PCP. (WARNING: Video is very graphic and has inappropriate language) @webpagelink"},{"comment_id":"10152817661912623","commenter_b":"like I say the only good snake is a DEAD ONE, since they ate my baby turkeys-I HATE THEM MORE","commenter_a":"Time to move. Fr.","post_message":"WATCH: What one North Carolina couple found in their spice cabinet will shock you.   Warning: There is some language in the video."},{"comment_id":"10154276196928128","commenter_b":"more like a buzzard ,she will eat america alive","commenter_a":"People seem to forget!! This is what happens when you mess with the Clinton's!! You can share this from my page if you want. And I did not write this I copied it from someone else that posted it. And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clintons convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown .. The murder happened just after she was togo public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock ...","post_message":"Aaron David Miller asks: Is Hillary Clinton's hawkish past an accurate indication of how she would behave as president?"},{"comment_id":"608915299267779","commenter_b":"Nigga i would murder u nigga in HIp HOp","commenter_a":"Hahaha... @username ma boy who you got? Lol... Norman Harrell @username who you got? I call Em via 1st Round KO","post_message":"Drake reportedly claims he's ready to take on Eminem. Who do you got in a Drake vs Eminem beef? #Drake #Eminem #Beef #JoeBudden #WSHH #Hot97"},{"comment_id":"1044864242277400","commenter_b":"@username Of course you haven't ever heard a group of 59 year old women bragging about \"popping a Tic-Tac\" so they could forcibly kiss a handsome man. And never have I heard this same age group say, \"grab'em by the d*ck\", nope, it doesn't happen...","commenter_a":"I am still trying to figure out how this man became a surgeon. Are you sure that his license and everything or legit cuz he is a total nut","post_message":"Ridiculous!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"718949644953580","commenter_b":"HAHA. Chickenshit. Stay home and tweet like a little bitch.","commenter_a":"chickenshit can't take the heat","post_message":"Pathetic."},{"comment_id":"10154161430028635","commenter_b":"Which is exactly why feminists aren't equalists, because they haven't dropped the privileged first-class citizenship baggage yet.","commenter_a":"My husband's previous wife took his son five states from him and the courts made him pay support without any effort to give the boy visits with his dad. That state is Indiana. The CP courts there are filthy with corrupt administrators.","post_message":"Teen applying for college finds out social security info don't match up and he was abducted as child"}]
