[{"comment_id":"2109805452578927","commenter_b":"Leave her alone!!","commenter_a":"Rosa","post_message":"World-renowned statistician Stevie Nicks declares a Hillary \"landslide.\" The mathematician also adds: \"Just like the white winged dove...Sings a song...Sounds like she's singing...Ooh ooh ooh.\""},{"comment_id":"972410229461065","commenter_b":"It doesn't seem to matter, does it?...she's slicker than Willy!","commenter_a":"Oh stop it","post_message":"Arrest her, TODAY!"},{"comment_id":"483464435177470","commenter_b":"Fuck you cunt lips","commenter_a":"The reason you are seeing her all of a sudden is to take the heat off of Obama . When thing get sticky with Obama his handlers bring out Michelle, or Biden. It is to take our minds off of Obama. Don't be fooled, Michele has no power, she is a fixture . I would venture to say she and her husband have very little to do with each other. It's for the television camera only. She was bought and paid for just like he was but her thing is just until he leaves office..","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153506145308690","commenter_b":"and one manyetanyahu or whatever is his name of israel","commenter_a":"Arrest Bush , Cheney , Blair , Rumsfeld and all the WarCriminals !","post_message":"\"I wanted SA to arrest #Bashir. Not because of ICC, but more to see the shock and fear in the eyes of all the other African leaders.\""},{"comment_id":"10155791972890725","commenter_b":"STFU","commenter_a":"and a lot of people blame the police in one out of five hundred killings. what happen to hope and change under obama?","post_message":"Police say the victim, identified as Vonzell Banks, was likely not the intended target ----> @webpagelink"},{"comment_id":"942185122493609","commenter_b":"Please, get some more facts before you continue spreading such nonsense. Of course GUN voilence is down - but violence, homicides, etc are NOT. Home invasions are up though... bc criminals know responsible home owners aren't carrying any more. Please, get a clue. Guns are not the big problem, and more gun laws do NOT stop CRIMINALS. You know who gun laws hurt, responsible gun owners.","commenter_a":"Did any of you even read all the way through? Statistics clearly show that stricter gun laws prevent shootings. Look at Australia. They used to have guns. Had a massacre. Made them illegal. No more massacres. Their gun violence is almost non existent since they made guns illegal.","post_message":"So sad."},{"comment_id":"10154861039595575","commenter_b":"What is this woman doing Hallucigenics?","commenter_a":"i thought she was paying them to leve, and she made a big mistake,,, what the hell, is this old or what,","post_message":"They call her the Hillary Clinton of Europe..."}]
