[{"comment_id":"1292924254103022","commenter_b":"RACISTS EVERYWHERE! SMDH! HILLARY DOESN'T have to PAY for the BLACK VOTE! RACISTS SHOULD KNOW that by NOW! Lol! She was under PRESIDENT OBAMA! The BLACK VOTE IS HERS from the beginning.","commenter_a":"lets see, hillary was SHOCKED at trumps language 30 years ago and then invites and praises someone who uses language that would even make a sailor blush......shame, shame, shame........disgusting is disgusting is disgusting and TRASH is TRASH no matter who is saying or singing the words.......and hillary not only apparently supports this type of language and music, but invites them to share her state.......so disgusting","post_message":"CROOKED Hillary Praises Cop Haters Beyonce And Jay-Z Who Drop N-Word Bombs All NIGHT! BOYCOTT!!!"},{"comment_id":"1777728085804631","commenter_b":"What she did isn't even funny. He needs to leave if she thinks that little of him. Bitch.","commenter_a":"WTF? I can't imagine getting that upset about shampoo. There has to be other problems.","post_message":"Don’t mess with a girl and her beauty products."},{"comment_id":"434228700035058","commenter_b":"Why so illegal immigrants can collect our money??? I think u should have to prove that you' have worked for 20 yrs or more to collect","commenter_a":"Also give thanks to Bill Clinton who signed the bill making it legal to outsource jobs here.","post_message":"Jeb Bush wants people to work until this age. I'm sure this will raise some eyebrows."},{"comment_id":"536456796544900","commenter_b":"Go home.. This is not ur country.. To bring ur confusion here....","commenter_a":"Amen !","post_message":"Muslims try to pass Shariah Law in Alabama but these patriots refused to back down.  We are not in the Middle East. No Shariah Law here.  Do you support these patriots’ stand against Shariah Law?"},{"comment_id":"10154807029567293","commenter_b":"Make Racists Afraid Again.","commenter_a":"Have another drink, hillbilly hick","post_message":" not a bomb in your bag, is it? the man said, according to a passenger."},{"comment_id":"1188105787918203","commenter_b":"ANIMALS!@#$%^&!!!!","commenter_a":"These people are ALL nut jobs.","post_message":"See what happens when Islam and Christianity Mix"},{"comment_id":"10153141332863984","commenter_b":"She's a complete idiot. Take care of your own bratty girls and leave Americans alone","commenter_a":"Hell yeah it is!!!our kids cant eat that crap","post_message":"Really, Michelle?  Do you think that Michelle's lunch program has been a colossal failure?"}]
