[{"comment_id":"822966724405417","commenter_b":"Does anyone that says she was young and dumb and made a MISTAKE? THIS WOMAN WAS IN HER T H I R T I E S. The ones that are saying must not know this. So, therfore, there is no forgiveness and she will always be a TRAITOR PERIOD!!!!!!!","commenter_a":"The photos were not the biggest mistake. Her biggest mistake was even going over there.","post_message":"Jane Fonda has changed her tune. She apologized for her Vietnam photos. What do you think? Better late than never, or too little too late? Should she be forgiven?"},{"comment_id":"467018143488766","commenter_b":"Liz...please shut up and go help your sexual victims","commenter_a":"Why don't we just ban Muslims from the military","post_message":"Should Christianity Be Banned To Please Muslims? Comment 'yes' or 'no'."},{"comment_id":"1640983469535980","commenter_b":"Speak for yourself. You've been in your spot for years, tell us something you have done. LADY, clean out from under your doorstep before you start criticizing someone else.","commenter_a":"Your a sick women","post_message":"Pelosi on Republicans: \"They pray in church on Sunday, and prey on everyone the rest of the week.\""},{"comment_id":"1182540631781356","commenter_b":"ISLAM'S WHORE","commenter_a":"One Can Only Hope!","post_message":"FINALLY!"},{"comment_id":"1562788604027088","commenter_b":"Time to block all idiots. Bye @username.","commenter_a":"Ohh come on!! You cannot compare between them!!seriously!!! REAGAN!!!! And you want to know why? Because he was for \"We the people\"!! Hand down!!! Climton signed NAFTA.... Huge disaster for our country!!! And please do not get me started on Hillary!!!","post_message":"Who was the better president: Ronald Reagan or Bill Clinton?"},{"comment_id":"10154200201311636","commenter_b":"I don't understand how she can even show her face in public after what she's done to Germany. Which in turn has had a negative impact on the rest of Europe. They should ship her out of the country along with all her precious illegal migrants.","commenter_a":"Thats good news for the AFD party..... No German wants to see this puppet!","post_message":"More follows"},{"comment_id":"1209844019025849","commenter_b":"But she will claim , its someone elses fault and she knows nothing !","commenter_a":"Better watch himself or he will have an accident like all the others!!","post_message":"WATCH: Romanian hacker \"Guccifer\" tells Fox News he easily breached then-Secretary of State Hillary Clinton's email server. @webpagelink"}]
