[{"comment_id":"10155170960495093","commenter_b":"You know, the more I see about Manspreading and Manslamming and Mansplaining and etc...the more I think \"Womanwhining\"","commenter_a":"How bizarre that a feminist would lie while trying to make a (man-shaming) point. First time for everything, I guess","post_message":"The term \"manslamming\" comes from one woman's claim that she walked around NYC without moving out of anyone's way and almost every man slammed into her but almost no women did.   So National Review's Katherine Timpf decided to try it out herself  and 66 women ran into her vs. just 23 men. You can see video of all the slams here:"},{"comment_id":"10153615882695329","commenter_b":"Seriously. That woman should have said no or let's go home first. She's just as guilty! Time served smh. Bs","commenter_a":"And why is no one hating on the woman for this? MENISTS","post_message":"A Florida man was sentenced Monday to two and a half years in prison for having sex on a beach in front of other beachgoers, including children."},{"comment_id":"10153247991679342","commenter_b":"Abortion is good. They should abort all babies born before the mother is 25","commenter_a":"here we go, \"all these people worried about worms in the water and nobody cares that planned parenthood is selling dead babies!\"","post_message":"One woman said she first noticed the worms yesterday in her bathtub and after collecting a few, she heard neighbors found the same thing.   @webpagelink"},{"comment_id":"1717745955143572","commenter_b":"This espn reportor gets paid to ramble about bullshit. Who would even take the moron serious?","commenter_a":"Typical ESPN liberal reporter has absolutely no respect or love of country,","post_message":"Should the Team USA hockey coach be fired for threatening to bench players who sit during the national anthem?"},{"comment_id":"10154204294889778","commenter_b":"Then let her pay for it","commenter_a":"They need to get over it! Rename something of their own! Confederates were a part of history too! If this is the case, let's change every building's name that offends every confederate soldier's family too!!! I Have Had Enough of this - so crazy & ridiculous!!!","post_message":"Actress Julianne Moore and Hollywood producer Bruce Cohen want a new name for their old high school in Virginia, named for a Confederate general."},{"comment_id":"1285542031522022","commenter_b":"A lot of women with four children worked.","commenter_a":"BOOYAH!!!","post_message":"MUST WATCH: Kellyanne Conway PUNCHES BACK After Juan Williams Questioned How She Could Work And Raise 4 Kids: \"I don't play golf and I don't have a mistress\" [VIDEO]  I can't stop cheering for Trump's #1 woman! Just like her boss, the Left is going to quickly discover that she is not one to sit back quietly and be attacked…"},{"comment_id":"10153458933961509","commenter_b":"Only if you let your wife ruin you financially","commenter_a":"Ambur Hearn","post_message":"How much a wedding costs in... → Chicago, IL: $50,934  → Columbus, OH: $26,245 → New York, NY: $76,328 Mapped: The Cost of Weddings, city-by-city @webpagelink w/ The Knot via CNNMoney"}]
