[{"comment_id":"1318881848134860","commenter_b":"Suck it up Buttercup","commenter_a":"Good , If the press would stay neutral, as they should, and report only factual information, instead of just what creates more drama, then they'd get the respect they want.","post_message":"For a year and a half, the press smeared, attacked, and belittled Middle Americans supporting Trump. Now they want respect? Sorry, that's a two way street."},{"comment_id":"10155150563786320","commenter_b":"English is patriarchal oppression Orla, please check your privilege!","commenter_a":"@username @username Bout time😂","post_message":"Hmm... Lena Dunham is crediting her recent weight loss to President Trump. (Image: AP/Fox News)"},{"comment_id":"999021020109368","commenter_b":"This is legislature that should ONLY be debated and decided BY WOMEN!!","commenter_a":"mayam merouane ok @username","post_message":"What a brave woman"},{"comment_id":"10153287887659614","commenter_b":"Hahahaha @username you made me laugh lol but maybe that's what really happened to these girls too much d*ck sucking lol","commenter_a":"Sucked too many c...ocks ? lol","post_message":"A concerning new trend on social media shows young women trying to imitate the big-lipped pout of 17-year-old reality TV star Kylie Jenner of the Kardashian family. The so-called #KylieJennerChallenge requires suctioning one lips into a shot glass or bottle. Some young women are ending up with painful bruises, photos on Instagram and Twitter show. The challenge could result in injuries to nerves, muscles and trauma to the blood vessels, a plastic surgeon says. Read KTLA's story here: @webpagelink"},{"comment_id":"484838455040068","commenter_b":"Yes, ban Sharia Law in the USA","commenter_a":"I hope tsa patted her down throughly to make sure she wasn't carry bombs, I think the whole thing is a set up!","post_message":"She walked on the plane wearing her Hijab, boy was that a mistake. Shariah Law is dangerous, we support the patriots that stand against it. Should Shariah be banned in all 50 states?"},{"comment_id":"10154713029439411","commenter_b":"Good on her. If only she had a shot gun or military rifle she may have got the others too.","commenter_a":"Looks good on him and them. These three losers garner no sympathy from me. Karma has been served.","post_message":"They picked the wrong house"},{"comment_id":"1061817873839223","commenter_b":"Insofar as the Hadron Collider is european, how would that help the US government?","commenter_a":"I hope 1.3 trillion dollars, since the U.S government can't seem to find it.","post_message":"What could we find?"}]
