[{"comment_id":"1736119296633923","commenter_b":"SURE --- IF THEY PAY BACK ALL THE WELFARE AND ABORTIONS WE'VE PAID FOR FIRST --- ------ GET A FREAKING JOB.","commenter_a":"I have never believed in Slavery and have not supported anyone who did. In fact I believe we fought a war and won to free anyone who was inslaved. And Blacks are not the only people that others use as slaves, there is still human trafficing going on and woman that are used as sex slaves... Get over the past as none of us alive can be responsible for what people before us did except not let it happen again.","post_message":"Bernie Sanders Apologizes For Slavery, Demands We Compensate African Americans He can use his own money for that. Will you compensate African Americans for slavery?"},{"comment_id":"1760652447526552","commenter_b":"@username you can eat in a public restroom and listen to people pissing and shitting and sit there and smell it for 10 minutes!! I don't even use public restrooms for myself if I can avoid let alone for my baby to eat in! If everyone wants to be politically correct then make a bottle fed baby eat in a restroom with a blanket over their heads too! That bottle nipple is replica of a mother's real nipple, for a REASON!","commenter_a":"It's okay to breastfeed in public. Its the way your doing it that offends people. If you're gonna breastfeed in public at least have some decency to have at least something to cover that part of your body and the baby while nursing. Simple but effective.","post_message":"A Connecticut woman is speaking out after posting a viral video in which she was yelled at by a man for breastfeeding her baby in Target."},{"comment_id":"758826910928758","commenter_b":"Those fucking bastards.....we gotta gut em, then kill them, then gut em again, then smoke a blunt or two and plant a tree and then maybe spread their entrails on our enemies lawn so they get the message.","commenter_a":"There's obviously some sort of mysterious group of people who have been trying to hide the advantages of the hemp plant to prouduce many of our products for everyday use.","post_message":"The solution seems obvious, doesn't it?"},{"comment_id":"10155226705950579","commenter_b":"She is sharp","commenter_a":"Where is the voice for the white race and culture?","post_message":"British Prime Minister Theresa May: \"I am pleased that I am able to meet President Trump so early in his administration.That is a sign of the strength of the special relationship between the United Kingdom and the United States of America.\"  Full video of Primer Minister's Questions here: @webpagelink"},{"comment_id":"976160855782499","commenter_b":"Oprah is racist trash.","commenter_a":"I hate Obama & I hate you to stinking race baiting pig","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"1210812922267700","commenter_b":"Fools! All of them!","commenter_a":"Liberalism hit squads at their finnest huh Rush.","post_message":""},{"comment_id":"1350622528302641","commenter_b":"Lady you're an idiot","commenter_a":"Nobody cares","post_message":"Islamic leaders respond to OSU attack today."}]
