[{"comment_id":"10153716806409749","commenter_b":"What's wrong with a black lady ?","commenter_a":"Wasn't the judge a black lady???!!!","post_message":"\"There will probably be a book. It will talk of his love for Reeva. And the awful feelings of loss and guilt, that will stay with him forever.\""},{"comment_id":"1659939417632867","commenter_b":"This would be true if Hillary got in! Stupid racist black woman!","commenter_a":"Real Hope and Change is coming to Americans !!","post_message":"SHE'S BACK TO HATING AMERICA: It's the end of \"hope and change\" and Michelle, for one, isn't happy about it."},{"comment_id":"926308994070863","commenter_b":"Nope, I kill the bastard and accept id be going to prison my whole life, but at least my child would live.","commenter_a":"It's possibly the worst idea in history to allow the shooting of a cop. Even the absolute worst cop could be clubbing a baby and still, if he were shot and killed in the act he'd die a hero and we'd never hear the end of it. We need to shoot cops, but with our cameras, never ever with a gun.","post_message":"Some states are dealing major setbacks to the Police State."},{"comment_id":"10153380056966770","commenter_b":"Get rid of Obamacare and the illegal aliens!","commenter_a":"I so despise Hillary Clinton. Why don't they indict her already.","post_message":"Hillary Clinton wants to use Obamacare to provide health coverage for illegal immigrants."},{"comment_id":"10153703347009714","commenter_b":"No. And neither is the attraction to the opposite sex.","commenter_a":"Its high time for America and the entire west at large to know that its not a Right to be Gay ! It cant be one's right to do wrong or evil ! Else we shall soon have murderers, thieves and all sorts of hooligans claiming its their right to do so.","post_message":"Kentucky clerk Kim Davis, who has been denying marriage licenses to gay couples, has a turbulent marital history."},{"comment_id":"10154941549643057","commenter_b":"@username You can't get back in the US because of a wall.","commenter_a":"Wow! He really showed him! The walls still gonna happen! No more cancerous illegals!","post_message":"#BREAKING: Mexican President Enrique Peña Nieto says he will not attend a planned Jan. 31 meeting with President Donald J. Trump, hours after Trump tweeted the meeting should be canceled if Mexico won't pay for a border wall."},{"comment_id":"10153662620879877","commenter_b":"So that make it cool huh ? Betta keep close eye on ya little one bro ^^^^","commenter_a":"So you found people unconscious, didnt call an ambulance or anything you shot them . That's murder.","post_message":"Black Couple Killed by Police Were ‘Unconscious’ Inside Their Car When Officers Arrived. Watch what happened next below.   Grio fam, what's going on here? Seven children are now without parents..."}]
