[{"comment_id":"488632654671676","commenter_b":"55555","commenter_a":"Nonthawat Ford Focus @username","post_message":"Watch this T-Rex own ‘American Ninja Warrior.’"},{"comment_id":"10154125153407169","commenter_b":"STOP Election Fraud: Do NOT use Soros voting machines. Please vote to put Billery/Killery on trial for TREASON. She broke the law and belongs in jail. She risked our country and put our people in harm's way, and had Democratic whistleblowers murdered. Not only Billery is very dangerous, she will bring this country to a security collapse with cutting our military and a financial collapse by choosing a fight with Russia and ruining small businesses while sending all jobs overseas. Please don't vote for the DEVIL. This country needs to be free and strong, where people have a real chance at the American Dream. Billery should have never been the Democratic candidate to start with and stole the nomination from Bernie Sanders. She is the most corrupt candidate ever and works for the elite new world order who wants to make people obsolete with new robotic technology. She brings with ...","commenter_a":"It will make money for the drug companies!!!","post_message":"Primary care doctors and nurses are well-positioned to treat addiction and champion care for those struggling with the use of opioid pills or heroin (From PBS NewsHour)"},{"comment_id":"10153562033956336","commenter_b":"Its not just the issue of illegals crossing the border and the US supporting them. The borders are open to terrorists coming across too and for both issues the bordetd need to be sealed ig we are to save our Country. Trump is right, without borders we don't have a Country.","commenter_a":"Ann Coulter is becoming the Johnny One-Note of 2016. SHUT UP ABOUT IMMIGRATION, ALREADY!!! There are dozens of issues out there that could (should) get your attention but every time I see you on @username you're yapping about immigration.","post_message":"\"The voters keep saying, 'We don't want any more immigration.' That's why Trump is so popular. So pick it up, Republicans.\" Do you agree with Ann Coulter about Donald J. Trump?"},{"comment_id":"10153644066921337","commenter_b":"Oooooh damn. That sucks man. That bitch took the easy way out. Piece of shit lunatic","commenter_a":"A piece of shit ....is a piece of shit. No need to bring up RACE.","post_message":"GUNMAN IDENTIFIED: Former WDBJ7 reporter Vester Flanagan is behind the horrific on-air shooting of two news team members."},{"comment_id":"936069706469980","commenter_b":"Colleen Boulden Jj Kane","commenter_a":"Ryan Lindgren take me here !","post_message":"Clark Griswold would be envious of this home on Prior Road in Wilmington, Delaware. The huge Christmas light display caught the attention of the SkyForce10 team while they were flying to another story. The set-up even has a walk-through section. Share your favorite lights displays with us here on Facebook or through the NBC10 app!"},{"comment_id":"1564121906980885","commenter_b":"Such a nasty woman","commenter_a":"Ew","post_message":"😍😍😍 (Via Daily Mail Celebrity)"},{"comment_id":"1203579539653054","commenter_b":"I'll be sure to let them know you said that Ralf, I'm sure they'll be devastated,.?!","commenter_a":"More bs from HRC,.. H and her half-truths... Number of oil, gas and coal industry lobbyists that have made direct contributions to Hillary Clinton 2016 presidential campaign: 57 57 registered oil, coal and gas lobbyists have personally given $126,200 to the Hillary campaign Of those 57, 11 are bundlers. 11 lobbyists have bundled $1,140,930 in contributions to the Hillary campaign 43 lobbyists have contributed the maximum allowed ($2700). Source : @webpagelink","post_message":"Hillary Clinton showed a flash of anger when confronted by a climate activist: \"I'm so sick of the (Bernie Sanders) campaign lying about me.\" @webpagelink"}]
