[{"comment_id":"10153304280001051","commenter_b":"She is a fence jumper!!!","commenter_a":"I approve he's the best President we ever had I love America !!!","post_message":"Simple question: Do you approve or disapprove of the job President Obama is doing in office?"},{"comment_id":"10153854379994486","commenter_b":"Criminal Hillary, silly Bernie out, Biden in without costing him a cent","commenter_a":"Good!","post_message":"If they're not panicking yet..."},{"comment_id":"10150599168414999","commenter_b":"You only have the right to vote under certain criterion. If you want to use language like 'never was' then I assume you forgot that only property owners were allowed to vote under the original constitution and blacks were also excluded. Changing times demand we evolve to the need. At this time we have tens of millions of Illegal aliens who have the ability to fraudulently vote. That is a potential problem.","commenter_a":"For me this is not about party politics as I am unaffiliated. 70% of Americans want voter ID. This is not about blocking the vote, this is about blocking the illegal vote. 52% of Dems, 82% of Repubs and 72% of independents agree want this, why should we ignore what is an obviously good idea?","post_message":"Democrats are most likely going to attack a host of measures, including voter identification requirements that Democrats consider onerous, time restrictions imposed on early voting, and rules that could nullify ballots cast in the wrong precinct."},{"comment_id":"10153818527657623","commenter_b":"Nope, because how would we get our food? Most illegals work in Agriculture, and farmers said they don't want them removed. I don't think illegals are our problem. They pay billions each year in taxes. For example, food, sales, telecommunications, cable, transtportation, gas, etc. If we got rid of them, we would lose in the end no matter how many jobs we would get in industries that don't require I-9s.","commenter_a":"It's sad, heartbreaking, and demoralizing to people on that side of town that have tried to do anything to help curb the problems. The answer is not to make the situation worse by closing the store. The store is the lone grocery story on that side of town @username. That is not going to help. The solution is to deal with the poverty on that side of town. People steal and rob and sell drugs for economic reasons. They are broke basically. That's why on the Westside the BP got robbed by the White lady. She was broke, and she committed an armed robbery because she got desperate and didn't know what else to do. It's the same thing that has been happening on the Eastside, it's just spreading across the city. We have to build up both sides. There are things the city could do to help, such as, ...","post_message":"'Everybody was like 'yes' when we saw him come in. Because we knew it was going to be a good night. Because he would make us laugh.'"},{"comment_id":"748895108560603","commenter_b":"Wonder where she got those mouth sores?","commenter_a":"from people that scream to be treated fairly the gay community and its supporters sure spew a drastic amount of hate.","post_message":"It's good for thee but not for me. -1000pts. @webpagelink"},{"comment_id":"1238637239481907","commenter_b":"ugly ungrateful woman -","commenter_a":"He better say that. Else Lady Chewbacca would beat his ass.","post_message":"Michelle Obama just brought down the house with a passionate speech at the Democratic convention. It's safe to say President Obama was a fan of it:"},{"comment_id":"10152857531566491","commenter_b":"Dustin I spelled behaviour perfectly fine. Only AMERICANS spell it your way. And that's not saying much","commenter_a":"WHAT?! maybe influencing spoiled, childlike behaviour!","post_message":"Kanye West is on TIME's list of the world's most influential people #TIME100 @webpagelink"}]
