[{"comment_id":"1238351549542994","commenter_b":"Take this woman's FB from her. That's stupid!","commenter_a":"No! Edwards did not ask Obama and liar Hillary to stay away! He's lying! He wanted them there but Obama did not want to give up his golf! Hillary is having serious health issues with seizures and needs her sleep!!!!! Trump Landslide!!!!!","post_message":"Donald J. Trump slams President Obama for not interrupting his vacation to visit Louisiana after deadly flooding in Baton Rouge and parts of Lafayette."},{"comment_id":"607938739358501","commenter_b":"Then dont go watch guadian of the galaxy 2 ..groot hates you!","commenter_a":"Look! Its raw meat! Its eel on the grill.. so it is food! We human are mammal and also carnivore. So eat things raw is a way of eating. Only when you kill for fun and waste the meats of throw away too much leftover then that would consider a sin for others may not have enough to eat! If you think eating thing raw is immoral or gross then throw away your fruits, veggies because they are still living things and have souls and you may not know it! Damn you people with no understanding and misjudgement","post_message":"What. The. Hell."},{"comment_id":"10154148373635736","commenter_b":"His daughter/wife would hate that.","commenter_a":"When they said \"small hard object\" I just assumed the president had gotten excited.","post_message":"Police received a report Friday that President Trump's motorcade \"had been struck by what was believed to be a small hard object.\" He was passing through Palm Beach on his way to his Mar-a-Lago resort nearby, where he spent part of the weekend."},{"comment_id":"10153938458440695","commenter_b":"Go home Barbara. You're drunk.","commenter_a":"We're checking on the condition of the other child injured in the crash for the Channel 2 Action News Nightbeat at 11.","post_message":"HEARTBREAKING: Police say a 12-year-old critically injured in a crash on I-285 today has died. Please keep her family in your thoughts and hug your loved ones tight tonight. @webpagelink"},{"comment_id":"10153878588886545","commenter_b":"Exactly I thought woman that age... can't have kids, no more.","commenter_a":"Why is a 62 year old getting pregnant and having young kids ? Second the 6 year old is only doing what he sees and what he thinks it's right . Do I think he's a bad seed no . Do I think he needs help after this yes.. This is obviously the only behavior that he knows ... I hope the mom suffers in jail .","post_message":"Kathleen Marie Steele of North Redington Beach, near Tampa, Fla., has been charged with aggravated manslaughter and neglect for the infant's death."},{"comment_id":"10153869125358812","commenter_b":"Why are Christians punished for praying. No one says others have to follow.","commenter_a":"Wow","post_message":"High school football coach suspended for praying at games attends as a spectator while  Satanists gathered outside of the stadium: @webpagelink"},{"comment_id":"1339079532789860","commenter_b":"Yo she cheated she should be feed the next chick","commenter_a":"MAKE HER EAT A BAG OF THEM","post_message":"Chip Roulette: Who Will Eat The Carolina Reaper Chip, The World's Spiciest Tortilla Chip, First?"}]
