[{"comment_id":"10154124888373812","commenter_b":"The jobs that illegal immigrents work in this country are jobs that, #1 citizens of this country are unwilling to work and #2 jobs that employers are not willing to pay a fair wage for. That's where this country needs to start. We can build a wall that anyone who wants to cross will and does.","commenter_a":"13 million might get you just under a mile of fence.....and I'm not talking chain link. Trump would be first in line to throw in his overpriced bid.","post_message":"President Bill Clinton tells Donald J. Trump supporter “If you want to build a wall along the Rio Grande and spend $13 million, then you should follow him like Moses into the Promised Land.”"},{"comment_id":"1148538801848206","commenter_b":"Get well soon.","commenter_a":"That was an amazing thing he did. He is too be commended. Oorah","post_message":"BREAKING NEWS"},{"comment_id":"10153716736973984","commenter_b":"That's one ugly girl","commenter_a":"This is more disruptive than any dress-code the kids could break. If a kid can't wear a t-shirt with our STARS & STRIPES, for example, then this person should not be allowed in the girls restroom and locker room. Period. There is no reason an alternative restroom shouldn't suffice.","post_message":"These students just sent a BOLD message to this school after a transgender classmate said he should be allowed to use the girls bathrooms and locker room. And it's not a message that the school can overlook... Do you support what these students did?"},{"comment_id":"542034032653843","commenter_b":"Dumb ass","commenter_a":"Right....looks who is racist Obama... You! Who is BSing Whom?","post_message":"Obama just told the entire world that we have racist cops. He has absolutely no respect for the hardworking people that make this country work. Do you agree is a complete embarrassment to our country?"},{"comment_id":"923764651058995","commenter_b":"I've officially had it, I want Muslims in Muslim countries period not here...","commenter_a":"It was going to happen sooner or later. Might as well start it now.","post_message":"RT Khalilah Sabra: Muslims to Start a Revolution in America"},{"comment_id":"10153140992043645","commenter_b":"If this a show of 'real women' will they also let the hair on their legs grow??","commenter_a":"Sick.","post_message":"On a less serious note,... Armpit hair is a growing trend for women. Will you participate? Or heck no !?"},{"comment_id":"1704753069786736","commenter_b":"THEY SHOULD BE TAKEN TO GITMO NEVER TO GET OUT!","commenter_a":"Need to be hung by the balls","post_message":"If you were in charge, would you have these deported back to where they came from? @webpagelink"}]
