[{"comment_id":"10155999999550389","commenter_b":"The Donald's only plan, make the Mexicans build the wall","commenter_a":"smart and beautiful","post_message":"Tonight on “Hannity,” Ann Coulter said she understands why Donald J. Trump wouldn’t vow to support the GOP nominee because none of the other candidates have a clear plan to deal with illegal immigration."},{"comment_id":"10154274502374087","commenter_b":"Oh you ALL make me tired. What a bunch of bullshit comments.","commenter_a":"The smartest thing this man has ever said: \"Dr. Carson feels he has no government experience, he's never run a federal agency. The last thing he would want to do was take a position that could cripple the presidency.\"","post_message":"#BREAKING: Dr. Ben Carson has told President-elect Donald Trump that he isn't interested in serving as secretary of Health and Human Services in his administration."},{"comment_id":"10155146081185725","commenter_b":"I would never allow a nun within a telephone poles reach of me! Hahahah","commenter_a":"At least the club is consenting adults! Not a priest on scared little boy! Protest that instead you concrete vagina bitches!","post_message":"A group of suburban nuns is suing a neighboring strip club for the second time. What their complaint is this time --> @webpagelink"},{"comment_id":"1886511228246156","commenter_b":"Illegal aliens.","commenter_a":"What your liberal brains are to small to realize is there is no defending illegal immigrants. They have no right to a trial. They have no right to a defense. They are automatically guilty and only entitled to deportation. If you want to be American there is a legal way. It is not easy nor will it be quick. But if you are willing to do it the legal way then you get to become an American and stay without fear of deportation.","post_message":"Janet Napolitano says the University of California will vigorously protect illegal immigrants."},{"comment_id":"10152837238297483","commenter_b":"If you don't like it stay away, you certainly won't be missed .","commenter_a":"That's the problem in Alabama this history of Republican leadership we need more liberals to vote","post_message":"Columnist John Archibald weighs in on how modern-day Alabama fits into the Bible Belt:  \"Alabama ignores that 'thou shalt not kill' commandment, posting the second highest murder rate in America in 2013, the last full year available. And blessed aren't its poor. According to the National Center for Children in Poverty, half Alabama's children are low income. Yet we still tax groceries.\""},{"comment_id":"10153817887769203","commenter_b":"Michelle will body slam Barry!","commenter_a":"Coming from the first female POTUS this is funny. Obummer, you can't handle your own angry wife let alone Putin....get out of the White House you effeminate jackass","post_message":" can handle a bunch of CNBC moderators at the debate. Let me tell you, if you can handle those guys, then I don think the Chinese and the Russians are going to be too worried about you."},{"comment_id":"10156284558895725","commenter_b":"I am a US Navy veteran having had taken my Philippine born wife through the immigration process. The immigration process can always be improved but, to give out amnesty to the illegals is like saying don't worry about the long waits in line; hundreds of dollars spent on forms; and the months it takes to swear in as a US citizen. If illegal immigrants want amnesty then pick a number; pay a penalty, and follow the process including all the fees. People who are following the rules are deeply wronged by illegals jumping the line by receiving amnesty.","commenter_a":"God Bless Donald Trump as he is our next real President.","post_message":"Press Conference LIVE"}]
