[{"comment_id":"486035008253746","commenter_b":"Cover her ugly ass back up. Been eating too many Chitterlings","commenter_a":"Cover her face??","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"10154466806054087","commenter_b":"Never heard of the cunt, what's his legacy (kissin obamas arse for the last 8 yrs","commenter_a":"That stupid ass gave one to Helen Degenerious ,she does help poor,but I think Hillary paid her millions to be on her show.","post_message":"President Obama awards VP Joe Biden the Presidential Medial of Freedom. (Photo: NICHOLAS KAMM/AFP/Getty Images). READ MORE: @webpagelink"},{"comment_id":"1088726504494434","commenter_b":"Ni en los concursos de pueblo se ve algo tan bochornoso!","commenter_a":"omg I am huge HARVEY FAN this was a horrible mistake i cant imagine how awful he must feel but thats live TV ...","post_message":"Something very unusual happened at the #MissUniverse pageant tonight...  #MissColombia was incorrectly crowned and she had to relinquish her crown to #MissPhilippines.  Social media has exploded from the result of this: @webpagelink"},{"comment_id":"1200289290023832","commenter_b":"It just needs to be remembered do this with no violence unless it is used on them and if the illegal aliens respond with violence deal with them direct and swiftly. No questions just stomp them and dump them back across the border.","commenter_a":"She just deserve a raspberry. It is the to be said to her. Our immigration system needs work but she is really talking about letting illegal aliens in. The term illegal means we have acknowledged that they have committed a non-legal act, thus becoming a criminal. That means do not pass Go do not collect 200 dollars. They are already being coddled at our expense. If, they are caught they should be taken direct to be fingerprinted and photographed, then directly to a border. If, they are identified as having done it before. We should setup a location far away to ship them to. This non-American needs to mind her own business, instead of trying to shovel her troubles on to us.","post_message":"Oh really?"},{"comment_id":"1729274910624261","commenter_b":"'@username well then","commenter_a":"Donate this to where the world needs 😩","post_message":"Science at work - The LifeStraw.  The LifeStraw removes at least of 99.99999% of waterborne bacteria and 99.9% of waterborne protozoan parasites. It can filter up to 1000L of water.   Throughout the world, an estimated 884 million people still do not have access to clean sources of water. This device contains no chemicals or batteries and makes it possible to drink safely from any river, lake or puddle.  Buy them here: bit.ly/1YbTja9  For every unit sold, two children in the developing world will be supplied with clean drinking water for a year."},{"comment_id":"1331072000266602","commenter_b":"I guess it's just disappointing to think of anyone being THAT stupid . Smdh .","commenter_a":"Why make a video of this ? It has to be trolling .","post_message":"The teens said they will make Black people slaves, burn them, brand them and make them swim the Atlantic Ocean."},{"comment_id":"1701436866776634","commenter_b":"Tell hr to quit being one then","commenter_a":"PAC Lapdog","post_message":"You heard about the whole 'whore' comment, right?  Well, after Dr. Paul Song said it, the hashtag #DemocraticWhores began trending..."}]
