[{"comment_id":"839838619485613","commenter_b":"this is as serious as it gets , shes going to bring muslims to America whose religion dictates they rape women and behead the men ,NOT A JOKE","commenter_a":"your listening to the woman that will destroy America , its NO JOKE , ITS NOT BULL CRAP wake up this crook doesn't care about you , MONEY AND POWER that's all shes after","post_message":"WATCH LIVE: Hillary Clinton speaks at an organizing event in Florida — will she bring up Donald J. Trump's tweets?"},{"comment_id":"819567068195360","commenter_b":"Build the wall. Get rid of illegals now.","commenter_a":"Those of you who are trolls (you know who you are) , really need to attempt to get some education, I.e., government or civics classes. 🇺🇸🇺🇸🇺🇸 TRUMP","post_message":"WATCH LIVE: Members of the Electoral College in Texas gather at the statehouse in Austin to vote for the president and vice president of the United States. One Republican elector, Chris Suprun, has revealed his intention to vote for John Kasich instead of Donald J. Trump."},{"comment_id":"1282426895139188","commenter_b":"Build That Wall","commenter_a":"So sad! Blue lives matter","post_message":"LIVE NOW: Procession now underway in the LA area, for an officer who died in a shooting there this morning. FULL STORY: @webpagelink"},{"comment_id":"10152996938497293","commenter_b":"Sorry you can't understand science. Maybe you should go back to high school.","commenter_a":"So the WaPo says evolution is fact, even though it's theory that can't be demonstrated? Bias is a wonderful thing.","post_message":"This can go down as one of the best examples ever of why it's downright impossible to convince someone who's 'opposed' to evolution that it's a basic fact."},{"comment_id":"10153449417193984","commenter_b":"She is a loser!!!!","commenter_a":"Her Poor daughter .. I bet she was totally humiliated .. and then to have mom remove her from her class mates .. Brutal :(","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"10152805642283145","commenter_b":"Nope.","commenter_a":"'@username te montas?","post_message":"The Orlando Eye attraction will be the tallest observation wheel on the east coast of the United States, and today the first passenger capsule was installed.   Will you ride the Orlando Eye? Check out photos of the progress >> @webpagelink #WFTVat5"},{"comment_id":"10153305455645329","commenter_b":"Omg","commenter_a":"Emily Bickle","post_message":"French phrase + hashtag + 'cool' city = T-shirt."}]
