[{"comment_id":"10154416532115575","commenter_b":"And what about Hillary's fat rearend!","commenter_a":"Ha wouldn't you like to see her have to do a daily weigh in!","post_message":"Democrat Claire McCaskill calls for daily weigh-ins for Donald Trump over media hoax from 20 years ago."},{"comment_id":"1554877448153804","commenter_b":"#HellForHer. #FeelTheBern","commenter_a":"I wouldn't vote for Hilary under any circumstances, because she is dishonest and has done nothing to help the cause of human rights in her entire career! In fact, everything she's ever done has been solely for her own promotion and gain! Power is what she's after and we definitely DON'T want someone like her in charge of our country! Bernie is one of us, a man who's worked hard for positive change, who is diplomatic, anti-war and pro-planet, in short, just what we need at this particular moment in time! With Bernie, we would all have a say, whereas, with Hillary, as a people, we would become more suppressed than ever, given her plans for further militarisation, both military and police wise and polluting of our planet in favour of the almighty buck! Bernie puts the needs of THE PEOPLE first, which is why he must be our first ...","post_message":"When we talk about a political revolution, sisters and brothers, we don't just mean the presidency. What this moment  requires is people in the streets fighting for change and legislatures across the country willing to stand with them."},{"comment_id":"10156586680480354","commenter_b":"Well @username be a man and stop hiding your face pussy","commenter_a":"Harry Truman was reigned back when it came to steel factories and labor unions. Obama needs to be reigned back with infringing on the 2nd Amendment!!!","post_message":"Today Obama destroys the 2nd Amendment.   And it's FAR worse than Americans feared..."},{"comment_id":"661665720654565","commenter_b":"NOT NO BUT HELL NO!!! SEND THEM BACK WHERE THEY CAME FROM!!! ANOTHER PLANET!!!!","commenter_a":"No.","post_message":"The Obamas are celebrating 24 years of marriage today. Are you proud to have them in the White House?"},{"comment_id":"10154989881801037","commenter_b":"She's a douchebag!","commenter_a":"Lol good","post_message":"Do you agree with this university's anti-Kim Kardashian West request?"},{"comment_id":"10158074030495206","commenter_b":"Take the appearance fee and go home","commenter_a":"Has she claimed racism yet?","post_message":"JUST IN:"},{"comment_id":"615120388649797","commenter_b":"I don't think it should be considered treason, I think it IS treason. How do you Snopes check this? And where is the link to the Washington Post article?","commenter_a":"Guys we have no choice. They are so advanced we have no choice","post_message":"This should be considered treason."}]
