[{"comment_id":"1145540435508072","commenter_b":"No job , 6 kids , no husband . Stop !","commenter_a":"Waited in line for six hours if you would've been working kids would've ate","post_message":"Entitlement Mentality: Welfare Recipients React to Food Stamps Being Cancelled. This shows everything wrong with the entitlement mentality."},{"comment_id":"481924841998096","commenter_b":"No Islam. This is The USA, not the Middle-East.","commenter_a":"Yes i support him completely get that islam shit out of our schools and our country","post_message":"A veteran was banned from his daughter's school... for speaking out against Islam? This is absurd. We support this veteran 100%. Do you support his stand against Islam?"},{"comment_id":"10155319348083132","commenter_b":"Jesus this is absolutely heart wrenching","commenter_a":"Rest in peace","post_message":"The 21-year-old mom is being hailed a hero for her quick-thinking in saving her newborn."},{"comment_id":"10154325210061336","commenter_b":"Let's just deport him. I'm sure that he has learned his lesson and he will never come back. (Sarcasm) Seriously, just shoot him. He's a criminal non citizen, here illegally. He shouldn't be entitled to any of the protections that our constitution affords us and neither should any other illegal immigrants that further engage in criminal activity.","commenter_a":"It may happen more then you can imagine!!","post_message":"Rene Ortiz Quintana, 69, took the identity of Ruben J. Gallardo – who has been dead since 1994 – to get Social Security, VA and other Federal, state and local benefits since 2012."},{"comment_id":"922572661194216","commenter_b":"Yep, she's illegal.","commenter_a":"Karma people, Karma! What you put out towards an innocent child will come back to you and it's well deserved.","post_message":"Ivanka Trump announced the arrival of Theodore James Kushner on Twitter."},{"comment_id":"10153198007713203","commenter_b":"Poor babies. Why do moms do this....May God for give us all. This needs to stop","commenter_a":"May God have mercy on the world.","post_message":"I left Planned Parenthood after seeing ‘perfectly formed’ quadruplets aborted: former abortion worker"},{"comment_id":"10152958936935927","commenter_b":"You can bet if she was muslim, her actions would be perfectly justified ....they wouldn't jail her or tell her to get another job !!!!!!!","commenter_a":"The governor has the power to quietly transfer her people..he choose instead to jail her, its ridiculous..Muslims in the MTA in NYC refused to do their job based on religion reasons, it never even made the news and they were quietly transferred...not jailed. It was worked out quietly and amicably, yet this woman they choose to jail. The governor should be asked why he choose to make an example of her...","post_message":"WATCH: Governor Huckabee - \"You're telling me that you cannot make an accommodation for an elected Democrat county clerk from Rowan County, Kentucky?\""}]
