[{"comment_id":"10153151930717426","commenter_b":"@username there is no double standard. One group enslaved, tortured, raped and brutalized a race, and fought a war to keep their slaves (states rights). And the other called a race that did all the above to them devils. No comparison.","commenter_a":"Who cares about the names of the schools? Does it further rasicsm? No. Are kids being taught rasicsm? No. Anything can be offensive as \"being offended\" is subjective. Will we then denounce anything named after Malcolm X because he was a Muslim who believed that all black people are Gods and the white man is of Satan? Now that's offensive.","post_message":"She argues the name represents a “history of racism.” There are also two local schools named after J.E.B. Stuart as well as other schools named for Confederate leaders. Do you think this will/should change?"},{"comment_id":"2130174917081223","commenter_b":"He is better off with out the old hag!","commenter_a":"Hell of a man","post_message":""},{"comment_id":"10152653934397169","commenter_b":"A woman should never lose her chic!","commenter_a":"Go girl!","post_message":"Part of a growing trend of older fashion icons:"},{"comment_id":"10153575076007411","commenter_b":"He was probably lured in by a crazy lady offering him pizza","commenter_a":"Susie Gollehon","post_message":"UPDATE: The boy has been found safe Police in Glen Ellyn are searching for a missing 12-year-old boy who was last seen riding his bike Monday. Story: @webpagelink"},{"comment_id":"1875959669293549","commenter_b":"I believe that she should be charged. I wonder if that would have happened if it was a white MALE officer. Just wondering.","commenter_a":"I believe she checked it for a person.","post_message":"BREAKING: Tulsa police officer Betty Shelby has been charged with manslaughter in the first degree. Shelby fatally shot 40-year-old Terence Crutcher"},{"comment_id":"1013860195337176","commenter_b":"Vanessa: Do give Hillary's accomplishments that make you so proud. Are you proud of being lied to?","commenter_a":"The republicans are bunch of jokers ,am so proud to be a hillary supporter.","post_message":"If you're proud to be a Democrat after watching tonight's Republican debate, add your name here: hrc.io/1L9yvI6"},{"comment_id":"10153908275696545","commenter_b":"@username the problem with the wall is it can be breached and take years to build, and will still have to be guarded. How about we just beef up border patrol and guard our country the way it was intended? If you research you will find that there are miles of tunnels already that bypass above ground entry. Although we have National guard at the borders they have no jurisdiction to stop anyone from entry and can only alert border patrol. If border patrol is busy elsewhere then the illegal immigrants are not stopped. These are the issues that need to be addressed building a wall is useless as we will still have the same problem not enough manpower to protect it.","commenter_a":" the \"wall\" is the most ridiculous idea to come out of a politician yet. Good luck getting Mexico to pay. How about you use common sense and get congress to give up funds for proper border patrol?","post_message":"If Donald Trump is softening his stance on undocumented immigrants, he didn't mention it to several thousand supporters at the Travis County Expo on Tuesday night. “We are going to build the wall,” Trump said to cheers. “And who’s going to pay for the wall? Mexico!”"}]
