[{"comment_id":"10154211018961337","commenter_b":"Hot chick","commenter_a":"Dont agree rob schneider is funny in some movies","post_message":"WHOA, sorry Rob Schneider and Jennifer Love Hewitt (and all the other actors on this list)..."},{"comment_id":"10154500485544062","commenter_b":"So the one girl should go back to Chicago? That's where she was born so that's her home.","commenter_a":"Assimilate, dump your hateful evil religion; or maybe you should go back wherever 'home' is.","post_message":"What would you have done in this situation?"},{"comment_id":"1754762228138614","commenter_b":"If you think things are bad now if Hillary get in a wall, illegal immigrants and whatever you want talk about are going to be the very least of your (our) problems. She will destroy anything and anyone plus she will cheat, lie and steal and never think twice about it! She not even be in the running! If she gets in everybody better run like hell!","commenter_a":"Actually, Clinton was talking ABOUT trump since trump HIRED illegal immigrants! Clinton didn't put anyone down when stating this. Every president/candidate has said this. It's how and what you say that make a difference. Trump wouldn't be called a racist etc. If he didn't put a whole country/religion down with name calling. There's a HUGE difference between what bill said and what trump says. Whoever can't see that needs help...","post_message":"Do you think this sounds a lot like Donald J. Trump? MORE: @webpagelink"},{"comment_id":"773671329465065","commenter_b":"The hole is on the wrong side of her head for her to shoot herself and fall that way too.","commenter_a":"Murder. She has the gun on the wrong hand and she's left handed.","post_message":"What y'all think? #WSHH"},{"comment_id":"1097859700233782","commenter_b":"Thanks! It's true!","commenter_a":"The woman had every right to post on yelp.","post_message":"Last night we told you the story about how a woman who was upset about her treatment by a doctor and gave a bad review on Yelp. That review then led to the doctor filing a lawsuit against her >> @webpagelink"},{"comment_id":"1160665140611621","commenter_b":"Men, have no business making any rules or laws that apply to women....PERIOD !","commenter_a":"Who elects these illiterate morons? New Hampshire, step up your game.","post_message":"These male legislators may not be grown-up enough to talk about women's bodies."},{"comment_id":"1048024048598660","commenter_b":"Disgusting.","commenter_a":"The blessings of new life. I think it's wonderful","post_message":"\"It looks like an alien\""}]
