[{"comment_id":"1325194690833614","commenter_b":"People need to slow down","commenter_a":"I hope this guy gets a huge fine and jail time. He could have killed someone.","post_message":"A driver was not injured after this violent crash that landed on Seattle's Burke-Gilman Trail. Gary Horcher shares the story >> @webpagelink"},{"comment_id":"966472163391020","commenter_b":"They won't last very long if they show up here!","commenter_a":"Already here","post_message":"Nothing but a change in leadership can stop this."},{"comment_id":"10152888732626680","commenter_b":"This recent ruling by the Supreme Court on gay marriage is only about civil unions. Those who are making this about church unions could not be more wrong as the Majority Opinion of Justice Kennedy points out: \"Finally, it must be emphasized that religions, and those who adhere to religious doctrines, may continue to advocate with utmost, sincere conviction that, by divine precepts, same-sex marriage should not be condoned. The First Amendment ensures that religious organizations and persons are given proper protection as they seek to teach the principles that are so fulfilling and so central to their lives and faiths, and to their own deep aspirations to continue the family structure they have long revered.","commenter_a":"Here come the lawsuits from the States!","post_message":"The Supreme Court has legalized gay marriage nationwide by ruling that the U.S. Constitution bars states from denying marriage licenses to same-sex couples. Full story: @webpagelink The landmark, 5-4 decision split the court along the usual ideological lines, with Republican appointee Justice Anthony Kennedy joining the court’s liberal wing to back same-sex marriage rights and the court’s remaining GOP appointees dissenting. Before the court acted Friday, 37 states authorized marriages by same-sex couples, but most of those states did so due to court rulings that could have been overturned if the Supreme Court reached the opposite result."},{"comment_id":"1571850159771728","commenter_b":"Wish you would replace Pelosi!!!! Sick of her!","commenter_a":"Hopefully she'll endorse the only true Constitutionalist Conservative, Ted Cruz.","post_message":"This campaign was always about citizenship—taking back our country from a political class that only serves the big, the powerful, the wealthy, and the well connected. Election after election, the same empty promises are made and the same poll-tested stump speeches are given, but nothing changes. I've said throughout this campaign that I will not sit down and be quiet. I'm not going to start now. While I suspend my candidacy today, I will continue to travel this country and fight for those Americans who refuse to settle for the way things are and a status quo that no longer works for them. Our Republican Party must fight alongside these Americans as well. We must end crony capitalism by fighting the policies that allow it to flourish. We must fix our festering problems by holding our bloated, inept government bureaucracy accountable. Republicans must stand for conservative principles that lift people ..."},{"comment_id":"604077913107506","commenter_b":"Heather: have you been living under a rock, or have you just somehow managed to not notice Hillary trashing her husband's mistresses (or victims, depending on how you want to look at it)? You're right, sexism IS still at large in this country, yet you want to vote for a woman who openly bashes other women and stands by her cheating, lying, scandalous husband? I'm not saying I like Trump, but dear God woman, have some respect for yourself. If you really think Hillary is going to stand for your rights any more than Trump will, then you obviously need to do a little more research.","commenter_a":"And it is unfathomable that a man with such decency, courage and leadership, as exhibited by her husband, has so often been disparaged and attacked by the right while they embrace a fraudulent sexual predator.","post_message":"\"I can’t stop thinking about this — it has shaken me to my core,\" Michelle Obama said of lewd remarks by Donald J. Trump."},{"comment_id":"1788499241368226","commenter_b":"Right. She has breasts. Ducks don't have breasts.","commenter_a":"Talks like a duck... looks like a duck... acts like a duck... must be a fucking duck","post_message":"Police Forcibly Remove Woman From Ladies Restroom Because She \"Looked Like a Man\" - is this what #MakeAmericaGreatAgain looks like?"},{"comment_id":"10153472169705667","commenter_b":"Such a wonderful thing to do.","commenter_a":"Thank you, may the Lord Bless you and your family","post_message":"Napster founder Sean Parker's cash infusion is the largest ever for cancer immunotherapy"}]
