[{"comment_id":"675106442643073","commenter_b":"Well, you are just a stupid BITCH! What say you now?","commenter_a":"that would be you Warren and you're a loon.","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"1304157179622515","commenter_b":"Is there any difference at all in Trump utilizing Twitter and Chinese Commie rulers using a a newspaper as their mouthpieces? What does China have that we don't have besides lots of bodies? The best thing they know how to produce is garbage.","commenter_a":"China, wallstreet, and our own government have been pissing down our collective backs for years, and telling us it's good for us because it's just rain.","post_message":"That's quite a bark, but do they have the bite to back it up?"},{"comment_id":"10154348216771337","commenter_b":"Michael Joseph wow this guy has balls, he's about to lose 100,000 to the Rap God","commenter_a":"That's cute","post_message":"WTF? Nick Cannon has quite the challenge for Eminem."},{"comment_id":"10153043089801519","commenter_b":"Right? Because...ick.","commenter_a":"#dontbethatguy","post_message":"\"He then sent me five nude photos of him lying in bed, his penis prominently displayed...\""},{"comment_id":"1579440092351045","commenter_b":"@webpagelink What Fox News doesn't tell you about #muslimlivesmattertoo","commenter_a":"I will never ever vote for someone as abominable as Trump! After four decades of voting GOP- I am done.Never Trump!","post_message":"'In spite of all the criticisms and vitriol being heaped upon Mr. Trump by Washington’s political elites, he has neither wavered nor sold his soul to the devil of Washington politics. Instead he has remained faithful, true and honest'"},{"comment_id":"10154898475594657","commenter_b":"Trump Beat Trump.","commenter_a":"Bunch of lying scumbags! They've always known that Trump was going to crush them. They scurry around like the rats they are, searching in vain, for a way to beat Trump! TRUMP 2016!!!","post_message":"\"All of us shouldn't even have answered that question.\""},{"comment_id":"860890883954153","commenter_b":"Goons On Parade!","commenter_a":"You weren't put there to be \"kinder, gentler\" When are you folks going to get the message!","post_message":"New Senate Majority Leader Mitch McConnell (R-Ky.) is indicating he’ll attempt to steer his party in a benign direction as his leadership style helps shape public perceptions of the GOP — and its presidential nominee’s chances — heading into the 2016 election cycle. @webpagelink"}]
