[{"comment_id":"1116898208348184","commenter_b":"She's the prime example of a \"nasty\" woman","commenter_a":"As if anything this trash had to say matters!! She's disgusting herself!! I mean she's into animals and champagne bottles!! Hello!! Need I say more. Madonna , you're far from a woman if virtue!!! Lmao","post_message":"Madonna slammed Donald Trump, claiming that he 'hates people of Color and Women and is Anti-Semitic.'"},{"comment_id":"481672038690043","commenter_b":"Muslims can all go to hell were they came from,they don't belong in this country","commenter_a":"Time for a million dog March, please don't clean up after your dog's at this March.","post_message":"Muslims are telling Americans what they can and cannot do. They have gone too far with this. We need to stop this madness now. Do you agree Muslim immigrants should abide by our laws?"},{"comment_id":"10154746403950399","commenter_b":"Hope CNN is the first nail in her coffin.her propaganda is responsible for bringing a narcissistic sociopath to power.she knew what he was and put herself and financial gain before our country.she is a traitor.","commenter_a":"Excellent move CNN. The people deserve better going forward. She did an excellent job selling campaign flimflam, but her job is done now, she does not have the skills for the White House world stage.","post_message":"\"We passed. Those are the facts.\""},{"comment_id":"1825065494398013","commenter_b":"the people actually running for president and the SUPPORTERS of those candidates are two different things, dillan.","commenter_a":"The party of old white people is starting to show it's age","post_message":"BREAKING: 'I'm going to run in 2020. For president'"},{"comment_id":"1044706655577881","commenter_b":"She know she be giving up the boot-Tay lmao","commenter_a":"This isn't even news! Yes fox 10 just post BS stories that are none of our business....","post_message":"SOUND OFF: This is Chelsea. She's 20, lives in Florida, and travels the world with men she meets online... on their dime. She says there's no pressure to do anything other than hang out with these men. What do you think? Let us know, and we'll share your comments on FOX 10 Arizona Morning!"},{"comment_id":"1595363807421142","commenter_b":"Hilary is a huge bitch","commenter_a":"Yes.///","post_message":"Hillary Clinton said today that Donald Trump's erratic temperament and lack of experience make him unfit to be president. Is she right?"},{"comment_id":"1237059042980790","commenter_b":"He's got my vote. illegals get out","commenter_a":"Trump is a racist POS!!!","post_message":"There may be a lot of other games out there that look similar, but Call of Duty is still in a class of its own."}]
