[{"comment_id":"777311705792740","commenter_b":"FUCK YOU BITCH!!!!","commenter_a":"What a tool.","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"10154366000234166","commenter_b":"Idiots. Careless. I will be glad to raise the baby.","commenter_a":"Betsy Carver ..unreal","post_message":"Police said neighbors found the toddler outside in 96-degree weather with no water. He was screaming, crying, and trying to get inside."},{"comment_id":"977904432246897","commenter_b":"She is an EVIL woman an not sure why she isn't in JAIL @username!","commenter_a":"Who is that masked woman?","post_message":"It's a very simple question:   “Have you seen those very, very controversial videos?”"},{"comment_id":"10155247808221729","commenter_b":"Jill stein was just in it for the money! She pulled one over on her own people.","commenter_a":"When will these #NOTMYPRESIDENT jerks learn. Get over it. If Hillary would've won we would be over it and preparing for all the bad she'd unleash on the USA!","post_message":"EPIC FAIL."},{"comment_id":"1360485817324205","commenter_b":"She is so stuck on herself. She thinks she's some sex goddess that's all she talks about. Blaaaaa get her gone I say!!!","commenter_a":"Dennis, please read the below with your comments","post_message":"SEAN STRIKES BACK AT MEGYN.  Good.  Now she's at odds with Hannity & O'Reilly.  See what Hannity wrote to her:  @webpagelink"},{"comment_id":"10152650786516491","commenter_b":"^^hoes got problems","commenter_a":"Dont like him, Dont Respect him can care less where , Rapist, Thief and total idiot goes except to jail","post_message":"Winston lost only one game as a starting quarterback."},{"comment_id":"908007962567959","commenter_b":"Look at that nasty excuse of a woman.","commenter_a":"That family is severely screwed up. Corrupt financially, politically, and morally! Any wonder why this society is so bad? No. Just pathetic. And they smile in the face of this country with absolutely zero remorse or accountability.","post_message":"GROSS!"}]
