[{"comment_id":"10154141594486509","commenter_b":"I can't stand Sanders grating voice and Hillary puts me to sleep O'Malley's obnoxious Thank God NCIS is on at 8.","commenter_a":"I wonder if @username will ambush Clinton, like FOX ambushed Trump.","post_message":"Classroom lecture vs. rock concert: Just how different are Bernie Sanders and Hillary Clinton campaign styles? #DemDebate @webpagelink"},{"comment_id":"10154741052673812","commenter_b":"Angela, your an idiot","commenter_a":"I love the comments so far. These folks probably have no idea that we have the largest prison population in the world filled with non violent offenders.","post_message":"NEW: Pres. Barack Obama grants commutation of sentences to 111 individuals. He's now commuted sentences for 673 people - more than the past 10 presidents combined. abcn.ws/2bPG0zc"},{"comment_id":"523357894521457","commenter_b":"She would be the worst ever.","commenter_a":"The people that will vote for Hillary, see nothing wrong with all his sex scandles.......... it dosen't faze them !","post_message":"Bill Clinton's promiscuous behavior could ruin Hillary's chances. Excellent. Help us spread this and make sure she never get's into office. Do you agree that Hillary would be a terrible president?"},{"comment_id":"456327834562277","commenter_b":"They are a matched set, failed business woman and failed politician.","commenter_a":"As for CARLY supporting Cruz SHE wants the VP spot and this is her ONLY chance! Tying herself to Cruz who will allow lying, half truths, whatever it takes to get into OUR White House! Carly Fiorina said BEFORE this establishment endorsement, that she found it that fellow candidate Sen. Ted Cruz, didn renounce his dual citizenship until 2014, and that Cruz one thing in the drawing rooms of Manhattan, and another thing in the living rooms of Iowa ! NOW it seems, Cruz brokered a deal with Carly AND SHE WAS BOUGHT! Talk about a SHILL Fiorina is a TOTAL GOP ESTABLISHMENT SHILL!","post_message":""},{"comment_id":"897818090261432","commenter_b":"Put her in jail!","commenter_a":"Go straight to jail. Don't pass go.","post_message":"Which Hillary Clinton scandal is bigger? Is it the one involving her likely illegal secreting and destruction of email records from her time as secretary of state, or is it the one involving the massive conflict of interest she wholeheartedly embraced by using her family’s nonprofit foundation to collect millions of dollars from foreign government donors — again, during her time as secretary of state? @webpagelink"},{"comment_id":"572993952849381","commenter_b":"She needs a stiff dicken","commenter_a":"Such class....................................................NOT!","post_message":"This woman just needs to STFU."},{"comment_id":"1121854401168903","commenter_b":"Stfu fat bitch","commenter_a":"Is it because they're assholes?","post_message":"They spend their lives eating rotten meat - so why don't they get sick?"}]
