[{"comment_id":"843350562368952","commenter_b":"With the UK refusing to stop child molesting rings, why is it surprising that thier corruption extends to the zoo.","commenter_a":"Not a fan of any of the stories that start...\" You won't believe what happened after this....\" It's The Star magazine hook line and sinker. It's like the Kardashians are the publishers.","post_message":"\"Zoo of Horrors\""},{"comment_id":"10152934177006051","commenter_b":"Stupid Bitch you need your ass whipped","commenter_a":"Karma","post_message":"Even the police were stunned that a teen girl could be so cruel to an elderly woman."},{"comment_id":"2109805452578927","commenter_b":"Leave her alone!!","commenter_a":"Rosa","post_message":"World-renowned statistician Stevie Nicks declares a Hillary \"landslide.\" The mathematician also adds: \"Just like the white winged dove...Sings a song...Sounds like she's singing...Ooh ooh ooh.\""},{"comment_id":"10153603991313132","commenter_b":"The tiger has been locked behind a cage for who knows how many years and when finally released he stood his ground and protected himself and they kill him for it? Animals no matter how small or what purpose do not belong in cages! Let's put a human in its place and see if they don't come out biting.","commenter_a":"Those animals need to be free not in a cage. Poor tiger, it was instinct. I feel for the man and his family too but it's not the tiger's fault. No zoos, circuses for me.","post_message":"\"It seized him by the throat,\" an eyewitness said."},{"comment_id":"10153009343111130","commenter_b":"My mother was too. But her mother was an even bigger bitch, so I got it.","commenter_a":"My mother is a bitch!! There I said it!","post_message":"\"I realized how much the fragility and vulnerability of females is exposed fully in the mother-daughter relationship.\""},{"comment_id":"10152829564776770","commenter_b":"Go home Clintons","commenter_a":"Bullshit cover up","post_message":"Hillary is secretly a great person, says Clinton campaign"},{"comment_id":"1119713804747813","commenter_b":"No-chin bitch.","commenter_a":"I'm changing my first name.","post_message":"Image from Go After the Bad Guys"}]
