[{"comment_id":"1193282647400517","commenter_b":"If she was White n this said about Hillary she then would be in jail!!!' Evil","commenter_a":"Then arrest her!","post_message":"OOPS, Another BLM moron gets what they deserve for making violent threats, this time against The Donald. [READ BELOW]  Can we get 5,000 'LIKES' to support classifying BLM as a hate group?"},{"comment_id":"1409042789109576","commenter_b":"'@username no they didn't. Both were smart enough to use classified systems to access classified information...","commenter_a":"The problem is that his supporters are not intelligent enough to care about any of this. The one true thing he has said is that he could commit a murder in Times Square and his supporters will still support him. That's why he panders to the low intellect crowd.","post_message":"ALERT! Yet another corruption scandal threatens the whole Trump family."},{"comment_id":"642161199307792","commenter_b":"If she get to say what she wants ,WHY can't the other people say what they want ,She talks down to ALL the people You could say that bitch pist me off and kelly would so you think all women are bitches no just the ONE THAT PIST ME OFF She just think she is everything do no wrong.","commenter_a":"No","post_message":"Megyn Kelly may be getting kicked off the air...  FOX needs our support, let's give it to them.  Do you support FOX News?"},{"comment_id":"10153740264340667","commenter_b":"This woman is unethical and unprofessional and immoral @webpagelink","commenter_a":"It's not just him who sees it. Many people see how biased and one-sided the media is. Very unprofessional. No shame left. I'm not against anyone here. I simply criticize the corrupt system.","post_message":"Not the first time it's happened this election cycle."},{"comment_id":"1062563810499126","commenter_b":"Proud to be a new yorker","commenter_a":"What a bunch of BS!!!","post_message":"Former New York City Mayor Rudy Giuliani speaks at the RNC.  Donald J. Trump introduces his wife Melania Trump and she speaks at the Republican National Convention."},{"comment_id":"651012365080931","commenter_b":"The most Corrupt Woman in the world","commenter_a":"SEE YOU IN PRISON SOON HILLARY = JAIL TIME FOR #YOU !!","post_message":"La decisión que tomemos en cuatro días tendrá un efecto en nuestro país por décadas. hillaryclinton.com/planparavotar  Comparte esto si estás de acuerdo:"},{"comment_id":"1762909607309407","commenter_b":"Hey Trump you going to build a wall for these people.","commenter_a":"Idiot","post_message":"During a Colorado rally on Sunday, Trump unfurled an upside-down rainbow flag with the words 'LGBTs for Trump' written on it."}]
