[{"comment_id":"1388314524545146","commenter_b":"Someone should kick this Muslim Animal out of our country years ago.","commenter_a":"Delusional moron!","post_message":"Just another scumbag black leader who hates Jews...boy, sure glad we helped them with their civil rights in the 60's - WE WERE THE ONLY ONES!"},{"comment_id":"10154009579409255","commenter_b":"It's an intense embarrassment for us here in Nevada. It's what happens when rational people don't vote in the midterm elections.","commenter_a":"Nevada? How about every other state in this country?! 😕","post_message":"How in the world are these people getting elected to office in Nevada?"},{"comment_id":"10153402936366636","commenter_b":"It's funny lads, the women is clearly having a bit of fun. You all must be really fun at parties.","commenter_a":"Dad could be doing house duties as well. We can not say he does nothing at this house by watching a Video. I think the purpose of this is to show how this super-mom is capable of dealing with the 4 kids, multi-tasking, having patience, having the gentle touch, etc..","post_message":"We can't stop watching this video of a mum getting her four kids ready in record time"},{"comment_id":"10153437960854877","commenter_b":"Every woman commenting negatively about Vivica, bet you man or husband would drop you to be with here, you women or old. Her age means nothing when her shape is killing every young girl on this post","commenter_a":"Why is he the bad guy when he's only responding to her messy self knowing he isn't gone let it rest or go!!#SheStupid","post_message":"50 Cent Responds to Vivica A. Fox 'Gay' Comments...and Doesn't Hold Anything Back. Read what 50 had to say below. Grio fam, what's your reaction to 50's comments? Sound off!"},{"comment_id":"10154512976631943","commenter_b":"YES!!!!..... LOCK HER UP!!!...LOCK HER UP!!!!...HILLARY FOR PRISON NOW!!!!...IT MUST BE PROVEN TO ALL THAT NO ONE IS ABOVE THE LAW IN OUR AMERICA!!!....HILLARY'S CORRUPTION WILL NEVER STOP TILL SHE IS BEHIND BARS!!!!!.........TRUMP IS THE PRESIDENT AMERICA DESERVES!!!....GOD BLESS OUR NEW PRESIDENT!!!!.","commenter_a":"Mr. Trump we can't let her go Free!! She's trying to destroy you every chance she gets.. Let Gowdy loose on her","post_message":"Share if you agree!"},{"comment_id":"10153857469189197","commenter_b":"Sorry, she does need spanks to look even better ! And you know it !","commenter_a":"Lol....I love my Spanx!!!","post_message":"She was trying on dresses for an upcoming formal, but her mother took to Facebook following the experience they had inside the dressing room-->> @webpagelink After you read the mother's message to the employees, tell us what you think in the comments below!"},{"comment_id":"10153389361142061","commenter_b":"Lady Gaga, great job.","commenter_a":"Oh Yes She Did!!","post_message":"Lady Gaga absolutely crushed her performance of the national anthem at Super Bowl 50. @webpagelink"}]
