[{"comment_id":"707039379420654","commenter_b":"Shut DOWN Sanctuary Cities FUNDING","commenter_a":"NO STRIP TRUMP FROM AMERICA","post_message":"Trump should strip federal funding from sanctuary cities - Agree or Disagree?  For more videos like this, check out Opposing Views Video"},{"comment_id":"10153905516506178","commenter_b":"I always say Merry Christmas at that is just the way it is.","commenter_a":"Fitting that a NUTCRACKER be in the back ground. :-)","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153180369332042","commenter_b":"Idiots.there goes their life down the drains.","commenter_a":"White trash ! Throw Away the key","post_message":"SINISTER GROUP 'PROJECT:' These 5 students met before and after school for week -- but they weren't working on a group project for class or a fundraiser for a pep rally.   Cops say what they were planning on doing was deadly."},{"comment_id":"10154944041488700","commenter_b":"They are ALL criminals!! It's why they are called ILLEGAL aliens!! All must go!","commenter_a":"If your illegal you will be going ...remove all the illegals criminals and violent sex offenders welcome to the deplorable nation of deportation to keep America safe","post_message":"'Let me repeat this: Our country, not theirs. It is our country. And we are not going to leave,' said Jorge Ramos to the Spanish-speaking audience."},{"comment_id":"448351221956139","commenter_b":"I'm from Texas and Perry has done a good job for jobs and everything else, except shutting the border down. He gets an F for that...........","commenter_a":"Trump,Rick Perry is a very bright man.He lead Texas very good for many years.","post_message":"It seems that Donald Trump has now turned his attention to this rival GOP candidate."},{"comment_id":"10152947380749099","commenter_b":"Yes, because women never get pregnant on birth control....","commenter_a":"If women would practice birth control then these horrible things wouldn't happen. Bless their little souls. May God have them in his embrace.","post_message":"A man found two dead fetuses wrapped in a blanket on the street @webpagelink"},{"comment_id":"539890196201560","commenter_b":"She's a douche bag!!!","commenter_a":"They both should do jail time.","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"}]
