[{"comment_id":"1691864404387315","commenter_b":"Omg ....how adorable!! You want one Mark? Do you still have your hot tub?? You're all set! I'll baby sit for you!","commenter_a":"Signe Nielsen tror jeg har fundet dr - at passe denne lille pige","post_message":"Welcome to Chicago, sea otter pup! At 10 weeks old, this little lady was found on a California beach all alone. Now, she's got a new home at the Shedd Aquarium. See the full video and photos here: @webpagelink"},{"comment_id":"644885305702048","commenter_b":"A treasonous bitch","commenter_a":"How long is it going to take to get them both out. Seems to be all talk. They should have been long gone.","post_message":"Michelle was just caught red handed and is about to be charged with treason. Good. It's about time she was exposed. Do you agree Michelle Obama does not belong in the White House?"},{"comment_id":"10153479746226438","commenter_b":"Nazi feminists, fuck off!","commenter_a":"Why are you showing a picture of this psychotic liar mattress girl who ruined a boys life with a false rape charge? There is no rape culture on college campuses. Rape has declined dramatically over the past decade. There are a lot of false charges of rape by scumbag feminist women though.","post_message":"Unfortunately, the oft-criticized statistic is true."},{"comment_id":"861742507286409","commenter_b":"This is a beastly crime Do what should be done to an inhuman beast! KILL IT.","commenter_a":"Beat him to death like he did the veteran","post_message":"Refugee Charged With Murder After Beating 97 Yr Old WWII Veteran To Death. No media outrage, no riots, nothing. What do you think his punishment should be?"},{"comment_id":"1529265630712432","commenter_b":"This lady is a nut job and probably has some deep issues that she needs to work on.","commenter_a":"#DavePirnerProblems","post_message":"\"You're saying that I can't have a hairstyle because of your culture? Why?\" the man, who is white, says in the video. \"Because it's my culture,\" says the woman, who is black."},{"comment_id":"1276041149107332","commenter_b":"Just another moronic Hollywood actress.","commenter_a":"Idiot no but of Obama and kilary have their way then you need to worry cause people like me want save you from the Muslims you help let in our country","post_message":"SARAH JESSICA PARKER FEARS She'll Be Attacked And Killed If Trump Is Elected…LOL! Has She Not Seen MULTIPLE TRUMP Supporters Who've Been Bloodied By Hillary's Lib Mobs? [VIDEO]"},{"comment_id":"10157219301315354","commenter_b":"Round up all illegals as soon as possible.","commenter_a":"Now we tolerate Mexicans and all kind of low life's stomping and burning our flag while stand silent and do nothing . Wake up America.!!!","post_message":"***IN HONOR OF EVERY SOLDIER, SAILOR, AIRMAN, MARINE, & GUARDSMAN WHO DIED DEFENDING FREEDOM***"}]
