[{"comment_id":"10152858304201336","commenter_b":"Enough is enough time to start locking these mothers up. They think they can just take over everything","commenter_a":"Man why doesn't this stuff happen in areas I'm in? I would never try to shout these people down. I'm going to physically knock them down. I simply cannot stand, nor will tolerate, this level of open disrespect. You have a right to protest, my right to protest in return is my choice, by the means I choose necessary.","post_message":"The protesters did not stop shouting until 100-year-old U.S. Navy vet Dario Raschio spoke up and said, \"Give me a chance. At least let us show a little respect for this occasion.\""},{"comment_id":"10153715295681336","commenter_b":"Nancy Pelosi ? What are you smoking?","commenter_a":"As a GOP Tea Party, it's the best news I have heard this whole year! This RINO had to go, he's dishonest, he campaign as a Tea Party Patriot and then became a Liberal hack as many of them usually do! When I saw Nancy Pelosi defending this clown, I knew we were betrayed.","post_message":"“It’s become clear to me that this prolonged leadership turmoil would do irreparable harm to the institution… This morning, I woke up and I said my prayers...and I decided, you know, today is the day I’m going to do this.”  Moments ago,  Speaker John Boehner announced why he has decided to resign this year."},{"comment_id":"10153294058536336","commenter_b":"There was a lot of blood shed and that's why this is disrespectful to the country of the Red, white , and Blue","commenter_a":"An upside down flags indicates distress and with your country's (lack of) leadership.. You are in distress...","post_message":"Do you find PacSun's shirt that pictures an upside-down American flag disrespectful?"},{"comment_id":"827359944060385","commenter_b":"Hillary is truly a liar.","commenter_a":"Hillary, always evolving while taking corporate money for corporate favors. Show me the speeches from Goldman Sachs so I can see exactly how much of my back you really have... #FeelTheBern","post_message":"Too many trans Americans still face violence and discrimination, just for being who they are. Together we'll fight for safety, respect, and full equality for the trans community."},{"comment_id":"10153579142479170","commenter_b":"she's never right !","commenter_a":"Sorry the American voters frustrated you. You can just stay home and learn to deal.","post_message":"According to Hillary, we're all just too stupid to understand how brilliant she is. She gets frustrated by that, and admits that her frustration is her \"greatest weakness.\""},{"comment_id":"1247969895269376","commenter_b":"So we can take hus away also. He is more privileged than her.","commenter_a":"Are you kidding me? He is simply making a point that she is a privileged elite who lives by one standard of protection and expects the little people--the unworthy stupid masses--to try and survive under a different one. It's called irony. To deliberately misinterpret and inflame his message (as a call to 'assassination'???!!!) is just proving Hillary right--her sheeple are the stupid masses. I say, let's prove her wrong and show some common sense.","post_message":"DISQUALIFYING! This is the SECOND time he suggests that Hillary should be shot. What is WRONG with him?  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153523768927293","commenter_b":"Thank you!","commenter_a":"What do you mean by white? there are white latinos i.e. latinos of European origin, so it isnt about race? pigment and having a tan or lack of deosnt define a race....cleopatra, moses, werent caucasion? what were they then? most experts say caucasion includes indians and that middle eastern are essentially white - although some can be mixed race .. so what exaclty do you mean and why do you care so much? We could find examples of many blacks playing white characters - very common in shakespeare...so keep your racial obsession and race baiting to yourselves please WP!!!","post_message":"From “West Side Story” to “The Birth of a Nation,” watch 13 times that a white actor portrayed a non-white character on the big screen."}]
