[{"comment_id":"10153031859929024","commenter_b":"Maybe you should jump in front of one of the bullets too lmao","commenter_a":"let them kill each other off","post_message":"Lionel Pickens, 31, was shot multiple times in the chest around 4 a.m. Sunday at Queens Boulevard and 84th Drive in Briarwood, police said."},{"comment_id":"10153305455645329","commenter_b":"Omg","commenter_a":"Emily Bickle","post_message":"French phrase + hashtag + \"cool\" city = T-shirt."},{"comment_id":"10154241082384170","commenter_b":"@username, I like you a lot, but how is this woman good, when we had sanctions against Iran, she was selling to them like crazy....of course she was trying to save herself and get her numbers up, but just so wrong of her....that's just another one of the many things she did, she couldn't even win the Senate seat in CA...how could she help him win the Presidency? We just all need to stick with the best....TRUMP!","commenter_a":"Uh--oh! I hope he has a portable stage and plenty of microphones. That's her specialty.","post_message":"Smart move, if it pans out."},{"comment_id":"731399806958628","commenter_b":"SUSIE ROTTEN CROTCH...and NASTY ASS LITTLE BILLY...Mommy needs a ass beating by daddy. Because you know it is the nutty woman who thought up the bullshit.","commenter_a":"IF LITTLE SUSIE ROTTEN CROTCH AND NASTY ASS LITTLE BILLY DOES NOT HAVE THEIR SHOTS...DO NOT TREAT THEM OR LET THEM IN PUBLIC SCHOOLS....PERIOD.","post_message":"More docs are refusing to see families that don't vaccinate."},{"comment_id":"10153953305054170","commenter_b":"It's really too bad the 'Pinoccio' factor isn't for real, Hillary would have four foot nose by now to go with her bulging eyes! Having made statements in front of people and then denying it, shows that she that she thinks we're all stupid! Well the jokes on you Hillary 'Rotten' Clinton, you're the 'Poster Child' for stupid! Careful what you say 'Hill' people around you do have a memory!","commenter_a":"Nothing has \"doomed\" her yet, doubt this will...","post_message":"Hillary definitively busted in another lie, by the father of one of the Benghazi victims. The media will try their best to ignore this so we're going to have to do their jobs for them."},{"comment_id":"10153007103196336","commenter_b":"Yes, teachers do hve input as to curriculum. No teacher nor educator has the right to instill their political views on to their students.","commenter_a":"These teachers need to be replaced if they are inserting their political views in the classroom and have only One answer which the see as correct whether it is correct or not! This is MY opinion! This does Not need to be taught in school anymore than religion! Go argue on someone elses opinion if you don't like mine. I will Not be called ignorant by anyone!","post_message":"“The Democrat is building. The Republican is destroying.”  According to an 8th-grade teacher in Wisconsin, this was the correct answer for a social studies assignment on immigration policy."},{"comment_id":"10157626698695603","commenter_b":"Stupid woman needs to be arrested .","commenter_a":"Thank God someone called the police and didn't just stand around videotaping it.","post_message":"Thankfully, the cats were not injured during the rampage."}]
