[{"comment_id":"10153478052978984","commenter_b":"This girl is one ignorant PIG !!","commenter_a":"This spoiled brat is headed down the same road as Brittny and Lindsey. She needs prayers not publicity.","post_message":"Pop star Miley Cyrus just said something highly disturbing about Christians. It's especially sad when you consider where she came from..."},{"comment_id":"1025668424151460","commenter_b":"Again son, go fuck yourself, you're nothing but a useless troll :) you understand that, right?","commenter_a":"Hum... hopefully the US and Russia will agree in sharing intels, would be a shame if US troops got bombed by Russia because the US didn't want to tell them where they troops were...","post_message":"Just remember, folks… this is all about ISIS, the big bad boogeyman in the black pajamas, and has nothing to do with Assad's rebound or the influx of Russian special forces troops into Syria. ~Will"},{"comment_id":"777437579026197","commenter_b":"No I think the lying words wouldn't come out,she was choking on them.","commenter_a":"BS","post_message":"I don't think she had ANYONE fooled..."},{"comment_id":"10153685449009060","commenter_b":"They do. This, in itself, isn't a problem anymore than relying on other countries to buy your goods is a problem.","commenter_a":"Most of the British public are blissfully unaware of this worrying problem. They still think they live in a \"rich\" country.","post_message":"As warning signs flash across the global economy, Britain is a favoured bolthole for skittish investors. But there’s a flipside to this: the country’s huge current-account deficit. Time to worry?"},{"comment_id":"10154261314153525","commenter_b":"He had it made on Howard channels. Then double crossed hogan with the tapes etc. Dirt bag. How many times can he use the connection with tony Stewart. He is a Howard copy cat with less talent.","commenter_a":"Jimmy","post_message":"JUST IN: Bubba the Love Sponge is off the air in the Tampa market. MORE: @webpagelink"},{"comment_id":"10153945644022061","commenter_b":"@username because the wife wouldn't lie right?","commenter_a":"Speak children...\"Out of the mouths of babes!!! All of the racist and fearful cops should be out of the streets and sitting behind a desk (not having to deal with the public). A lack of respect is found in all groups of people and that still is not an excuse to slaughter a certain group. Americans kill, so should terrorists groups kill us??? Should animals attack people because they kill them for sport or make them zoo exhibits?","post_message":"TAKING A STAND: Kids of Charlotte spoke out at a city council meeting about their fear of the recent violence in their hometown: @webpagelink"},{"comment_id":"10152758029596545","commenter_b":"She was a nut, thankfully I moved not long after","commenter_a":"This reminds me of the time once I lived in Claremont, NH I was taking pictures of a pretty sunset in my front yard and my crazy neighbor threatened to come after me with a knife because she \"thought I was taking pictures of her\"","post_message":"Police are investigating after a man was shot and killed while taking pictures of the snow in Northeast Dallas just after midnight. STORY: @webpagelink"}]
