[{"comment_id":"581504818688172","commenter_b":"we are \"nasty women\" and we vote!","commenter_a":"Your mother always said that you were a disappointment and a nasty little creep.","post_message":"The conviction of an Iraqi refugee plotting to blow up the Houston Galleria is exactly why I've been pushing so hard to immediately suspend the refugee program from terrorist hotspots. The current program is a Trojan Horse allowing ISIS and other terrorist groups an open invitation into the U.S."},{"comment_id":"10152862008521336","commenter_b":"I'm so glad they caught those scumbags without more bloodshed. It still is b@llshit that some people think shooting at cops is an appropriate action to try and prove a point. If you want a lawless society I'm sure there is some third world country that will accept your dumb@ss.","commenter_a":"He Could Be Obama's Son!","post_message":"UPDATE: Two suspects are in police custody Tuesday for allegedly shooting two plainclothes NYPD officers responding to a robbery."},{"comment_id":"1176200455772763","commenter_b":"She know foreign policy like my pet cockroach!","commenter_a":"Trump likes to do things on the cheap ,with Carson, Palin and Bachman stupid doesn't cost much.","post_message":"This is the same woman who thinks the United Nations is going to institute a One World Government and that Barack Obama is the Antichrist."},{"comment_id":"10153137359278717","commenter_b":"Yeah. It's so good because her employees are rubbing their private parts in your food.","commenter_a":"Lol! Good for her. The restaurant is so small, that I'm sure the other patrons were thankful for that. Btw she has GREAT food at her diner.","post_message":"The owner of Marcy's Diner in Portland, Maine says she doesn't regret yelling at a crying child despite the bad reviews she's been getting on Facebook: @webpagelink"},{"comment_id":"1162468617182722","commenter_b":"The magic number is 2026, half of 4051 . Bernie gets to that number the superdelegates have to support him.","commenter_a":"Bernie could win every state from here on out and Hilary would still be leading in the polls and delegate count. ..","post_message":"Hillary Clinton's margin narrows to just 6 points over rival Bernie Sanders."},{"comment_id":"1324023564281057","commenter_b":"FUCK YOU FUCK sharia law GO HOME ALLUH FUCKTARDS","commenter_a":"It is so wrong","post_message":"Florida Democrats Approve Bill That Imposes Shariah Law On Women. You can't force your religion on other people. Do you think this wrong?"},{"comment_id":"1093108914084558","commenter_b":"exterminate the cockroaches!!!!!!!!!!!!!!!!","commenter_a":"Muslims are a cancer.","post_message":"Top U.S. Commander In Europe: ISIS is Like Cancer Among Refugees @webpagelink"}]
