[{"comment_id":"10154552857806955","commenter_b":"How is Hillary performing vs. Obama?","commenter_a":"This is it America. This is our last chance, the alternatives are most unsettling.","post_message":"FLORIDA SHOCK: TRUMP OUTPERFORMS ROMNEY BY 130,000 IN EARLY VOTING!"},{"comment_id":"10154647559481323","commenter_b":"The woman will never listen","commenter_a":"The public are not - a certain part of it are while the majority supports it.","post_message":"\"People aren’t stupid. They may want less immigration – but not at any cost. The stupidity was a referendum campaign that boiled everything down to that one issue. But people don’t think just one thing, they have many views and priorities: when the facts change, they tend to change their minds.\""},{"comment_id":"1824233217832680","commenter_b":"Yep! I saw what DT paid for in this campaign, thousands and thousands of his campaign signs , thru WV, Ohio, Mi. Drove it many times from NC due to a deaths in my family. I couldn't believe how many I saw and where they were. Really in the oddest of places too. Someone was paid to put them up.","commenter_a":"I love my Affordable health Care, it has saved my life. It's very important to have coverage for everyone in our country. You never know when you my need it. The health care conglomerate has made it expensive, big Pharm etc..etc.. not OUR President! What he did was great for this nation, and yes I would tweak a few things but all-in-all we need this for a healthy people!","post_message":"Your experience with the Affordable Care Act? #ACA"},{"comment_id":"10154487721214062","commenter_b":"Only problem he has to rape to be a thug. Blacks just have to be born and they are considered thugs","commenter_a":"Lol KHOU just called someone a thug! 😂😂😂but seriously he needs to be caught.","post_message":"Please share to get this thug off the streets! He's a violent rapist who sexually assaulted two 16-year-old girls."},{"comment_id":"10153182690520667","commenter_b":"Good grief","commenter_a":"Eric Stewart lol","post_message":"\"This game should not have been played at the airport.\""},{"comment_id":"10153643564026051","commenter_b":"She shouldn't be out!! WTH","commenter_a":"I don't think so","post_message":"A mom who killed her 3 kids is now demanding custody of her new children."},{"comment_id":"10153152736641955","commenter_b":"Who was her IASO? Who was responsible for patching and maintenance? Who setup the firewalls and data encryption? Put this bitch in jail!!","commenter_a":"U can still, get it back.","post_message":"HILLARY 'WIPED HER SERVER CLEAN'"}]
