[{"comment_id":"1018456324917286","commenter_b":"It's not Trumps place to judge. Isn't that what the gays and muslims are always complaining about?","commenter_a":"I can hardly believe that I even watched that whole segment on The Last Word With Lawrence O'Donnell.","post_message":"Donald Trump lets a supporter calling President Obama a Muslim slide."},{"comment_id":"10154373252360329","commenter_b":"Women can wear whatever they want.","commenter_a":"She's very talented & beautiful but please stop trying to normalize the antiquated religious practice of women covering themselves. Women have come too far to regress back to this BS! (That goes for Orthodox Jews, Islam, & Christian nuns.) Little girls all over the world: your body is not shameful! You do not need to be modest to lessen the desires of men or a masculine God! You are beautiful in all of your natural glory!","post_message":"She also does comic book characters and Kardashians."},{"comment_id":"1949462081947777","commenter_b":"Stupid bitch !!!!","commenter_a":"Just think, if Hillary wins, this stupidity will not only increase, but will be further validated by the government.","post_message":"This is what it has come to..."},{"comment_id":"10154358010096037","commenter_b":"why would u put this animals pic on here??u people r the problem,neither his name nor his pic should be glorified","commenter_a":"Coward, plain and simple. Bury him in a casket of gay smut and pork.","post_message":"Omar Mateen, identified as the Orlando gunman, pledged his support for ISIS in 911 calls made amid his attack, according to the FBI. @webpagelink"},{"comment_id":"563855710491041","commenter_b":"Such a PIG","commenter_a":"POS!","post_message":"His response is simply \"deplorable.\""},{"comment_id":"450286948495219","commenter_b":"Jo Jo What ever bitch, I have never called the cops and never will when I wish to commit suicide I'll call the pigs. You are a statist bitch.","commenter_a":"Whats the difference? Police are thugs.","post_message":"Do You Support Our Police Over Thugs?  Comment 'yes' or 'no'."},{"comment_id":"887259011404129","commenter_b":"She smacked him down with that","commenter_a":"That was my favorite point in last night's debate. It really showed who has done more for our country in the last 30 years.","post_message":"\"I'm happy to compare my 30 years of experience with your 30 years.\" —Hillary to Trump #Debate"}]
