[{"comment_id":"1452176608135698","commenter_b":"What branch of the service was Hillary and her daughter in?","commenter_a":"Thank you for your family's sacrifice, sir, your son is a true American hero. Donald Trump doesn't know the meaning of the word.","post_message":"His son was killed while fighting for the U.S. in Iraq. Now, he's got something to say to Donald J. Trump."},{"comment_id":"10156946907525389","commenter_b":"@username you are just a hater. Stop disrespecting people specially Muslims.","commenter_a":"Love this man!","post_message":"\"Why didn't she say, 'Hey, make better lifestyle choices?' If you want to join something, why don't you join a church, why don't you join the Boy Scouts or the Girl Scouts?\" Milwaukee County Sheriff David A. Clarke Jr criticized Hillary Clinton's comment on joining \"positive gangs.\" @webpagelink"},{"comment_id":"1354573844595375","commenter_b":"wELL LET THEM TERRORIZE THEM AND THIER FAMILIES AND LET'S SEE HOW QUICK SHE REPEATS THIS ASSINIGNE REMARK","commenter_a":"Send these twits over there to give them love and hugs.","post_message":"Oh brother!"},{"comment_id":"10152799476958598","commenter_b":"she is so un educated on what abortion is!!","commenter_a":"I beg to differ...","post_message":"What???"},{"comment_id":"10154120188266770","commenter_b":"She is not funny anytime","commenter_a":"It painful just to watch het","post_message":"Amy Schumer was hard to watch."},{"comment_id":"10153456933913132","commenter_b":"Oh my word!!!!! What in the hell?! If you don't want your baby there are plenty of ways to give it up safely! I will never understand women!!","commenter_a":"@username wtf is wrong with people","post_message":"Kimberly Pappas reportedly stored her baby in a drawer after giving birth in a bathroom at work."},{"comment_id":"10153509244088854","commenter_b":"Go home!!","commenter_a":"Don't let the hit you in the behind when you leave","post_message":"Obama Claims He’d Be Treated Better In Europe, Whines About “Names I’m Called” In America..."}]
