[{"comment_id":"1370796892943097","commenter_b":"That was the sunniest, rainy Portland day with which I've ever been blessed","commenter_a":"How's Trump in his press secretary going to lie about this one? LOL","post_message":"Incredible images of the women's march protest happening all around the world."},{"comment_id":"10153379437614411","commenter_b":"To Turchinov's bitches.","commenter_a":"Ukraine have just had a 175 Billion dollar loan about 3 weeks ago, Plus a 1.8 billion dollars this week from the EU and now they are getting ready to default on these debts. Could someone please tell me where all the money has gone in such a short space of time????","post_message":""},{"comment_id":"10152784678501130","commenter_b":"I read a quote from a woman somewhere who said \"When I had kids, I saved up my sick and vacation days.\" She thought this was a major accomplishment. So she took time away from her family and herself (vacation days) and exposed her colleagues when sick. How smart is that. Bootstrap childbearing.","commenter_a":"About time, but still not enough. Germany vives a year.","post_message":"\"[W]e can't say we stand for family values when so many women in this country have to jeopardize their financial security just to take a few weeks off of work after giving birth.\""},{"comment_id":"10152735928791680","commenter_b":"Of course. I know there is no way Hillary's home had anywhere near the \"Defense in depth\" that the government has. She decided to run her job from her less secure home. She brought it upon herself. ISPs and private servers are hackers easiest and most favorite targets, especially the traffic to and from. Take an IT course sometime. This info is taught at the basic level.","commenter_a":"Democrats can be mean brainwashed SOBs: @webpagelink","post_message":"Louisiana Gov. Bobby Jindal took his socially conservative message Thursday straight into the belly of the liberal beast: the New York Times’ opinion pages."},{"comment_id":"10153128335637377","commenter_b":"This has moved into the realm of pathetic and into hilariousness. Enjoy your bondage sir. Maybe try to forgive \"white\" America for its oppression and causing your \"struggle\" from 1960. Today, In this Great Country, Freedom is a choice, along with all its wonderful benefits. I beg you sir to chose it, its so much better than your aged and historical mind of past racisms and injustices. I look at your page and I see hate and division and lies, man and it saddens me. We're Americans and the media has us divided. I hate that. Its a new day bro, leave these young kids alone with your junk, let them grow up in a world without your racist wounds from the past. I shame you and the media for this junk. I have spoken my heart, this chain is closed for me","commenter_a":"You must know, this is not about equality, at its root its about domination from a revengeful spirit. There will be no end to this until they \"feel\" whites are subservient. This state has cowered to the media and social media pressures in lieu of implementing meaningful and lasting University policy changes of \"equality\". We should prepare for ....What and who is next?","post_message":"\"He just resigned for committing the crime of being a white male,\" Limbaugh said, calling it as \"a social justice warrior's story.\""},{"comment_id":"10153571133258132","commenter_b":"Shut up Tina","commenter_a":"Regardless of what this family would've, could've, should've said...90% of you made your judgement the second you heard \"the news\". Until it happens in our own family, none of us have the right to judge. Just as I don't have the right to judge all of you with your incredibly hateful comments. So I won't.","post_message":" watched him like all the time. I took him to work with me. We just poured our life into him.\""},{"comment_id":"10153088777412994","commenter_b":"Dan Bedford Hmm lol","commenter_a":"It was destiny.","post_message":"They've walked down the aisle together twice, but have only been married once."}]
