[{"comment_id":"939907909435597","commenter_b":"Aren't most Americans \"Economic Migrants\"?","commenter_a":"Then we have to accept everyone that comes to America theyre refugees well so are people who are running from drug cartels","post_message":"It's the American thing to do. What better way to show Trump and the rest of his racist rivals that they do not represent us?"},{"comment_id":"1072525059447912","commenter_b":"Well actually Tara bring em all to your house ok AMERICA FOR AMERICANS !","commenter_a":"Correct me if I'm wrong but majority is suppose to rule in AMERICA and you only have 4 States that want these people and 20 that don't keep them the F out of America !!! AMERICA FOR AMERICANS !!!","post_message":"\"There is absolutely no constitutional power for a state to exclude anyone from its territories,\" said one legal scholar."},{"comment_id":"10153240957300950","commenter_b":"We need a new president - but not Hillary!","commenter_a":"Putin keep up the good work","post_message":"\"He needs to go after the people who killed Russian citizens,\" Obama said of Putin."},{"comment_id":"1109196055770108","commenter_b":"@username You have no morality. Also gays shouldnt be allowed anywhere near kids.. its pure child abuse. If they were meant to be parents, then gays would be able to reproduce.","commenter_a":"I thought MLB was about playing baseball, not trying to promote an immoral, sacrilegious way of life!","post_message":"MLB is DYING to get a gay baseball player."},{"comment_id":"10153994126946337","commenter_b":"Loved it!! These \"Million Moms\" need to stop clutching their pearls & promptly remove the sticks wedged up their tight asses.","commenter_a":"What do you think about the show Lucifer?","post_message":"NOT HAPPY! One Million Moms is beyond ticked at Lucifer and Olive Garden..."},{"comment_id":"392468917544370","commenter_b":"He said \"unvaccinated foreigners\" caused this. Read that again... Slowly.","commenter_a":"Fran Cella I agree with Rush.","post_message":"What do you think of Rush Limbaugh's theory on the vaccinations debate?"},{"comment_id":"458537397670174","commenter_b":"NO She can Stick it !!!","commenter_a":"No way and the kids are not going to either.","post_message":"Will You Cave To Michelle And Only Eat Where She Wants?  Comment 'yes' or 'no'."}]
