[{"comment_id":"10156869276120725","commenter_b":"Thank you Wisconsin! #TRUMPTRAIN #makeamericagreatagain","commenter_a":"The era of appeasement is coming to an end! They are only making the majority stronger and more galvanized than ever! All are welcome on the Trump Train - GO TRUMP!!! #Trump2016 #TrumpTrain","post_message":"THANK YOU, AMERICA! I love you!"},{"comment_id":"10155973648509199","commenter_b":"This Woman is money smart. Say it with me. This Woman is money smart. She will wind up moving up at her job to the highest position, paying more taxes, and bettering her life. People around her will be better from her life. She will put out better quality in everything she does or touches. It can all start with positivity here and with acknowledging that this Woman is money smart.","commenter_a":"Those berating the mom...it is her employer who is getting the 'subsidy' by being able to make more profits by paying wages families cannot live on - of course they also can sell things for less, so consumers pay less, so they benefit. Wondering where she lives that that's a years rent, where I live that's a couple of months. Messed up system, but glad for her fam.","post_message":"'Instead of buying my kids the latest Jordans or fancy electronics, I paid my rent for the YEAR. I a single mom and I do it all by myself on a minimum wage job.'"},{"comment_id":"432105150316631","commenter_b":"Haul her a•s to jail ???","commenter_a":"I would love to jerk the whole outfit off. Would stop a lot of shoplifting for a start😡👳🏾","post_message":"NO SHARIA LAW IN AMERICA!"},{"comment_id":"10153246796329607","commenter_b":"Stop them now!!!","commenter_a":"Yes","post_message":"QUESTION OF THE DAY:   Should the U.S. stop accepting Syrian refugees? #FOX45QOD"},{"comment_id":"10154505390413037","commenter_b":"Well most of those benefits we pay go to lazy white people. Look up the facts lol","commenter_a":"So people who have been here 20 plus years....working, shopping, law abiding and not on welfare.....being healthy, productive members of society should be forced to leave.....i don't agree with that nor do I think that is fair! So called Christian people! Our country is not right......","post_message":"now because a lot of people came in illegally there no way we can even apply for papers.   Lara graduated in 2016, was her high school valedictorian and received a full scholarship to UT."},{"comment_id":"10157399464465093","commenter_b":"A hun will never kill anyone! Its the people that use them! People kill people! Criminals get them illegally and you can't stop that! It is not possible! Give me a reason why you think criminals should only have guns?","commenter_a":"Yes but 100% of gun crimes involve guns, so start with the legal gun owners because it's way easier, and it looks like we're doing something.","post_message":"Pass it on."},{"comment_id":"1411832842165706","commenter_b":"No sympathy here...he's a paid hack for Hillary...and so he just lost all credibility..He supports sharia law,with connections to her foundation and Saudi's...he has worked on policies for moohslim immigration into this country..He's dangerous and a radical.....Of course we find this out after the fact...which were lie perpetrated by the left..progressive librals..with an agenda....always a strategy and agenda..!!!!!!!!!!!!","commenter_a":"You are correct Rush, he needs to move away from attacking the attacker (old Scientology technique) and focus on his message.","post_message":"If Trump does not start seeing things through an ideological prism, he will never understand the method, the motive, and the how and why these attacks against him happen."}]
