[{"comment_id":"1531352266898026","commenter_b":"\"She\" don't have dicks, its a he","commenter_a":"Can we please stop misgendering her?","post_message":"\"I had tits and a dick and was tattooed and alternative, and I could come over and over again on camera.\""},{"comment_id":"1059297857458355","commenter_b":"bag your bags u/piece of pig shit bitch & go back or get killed soon","commenter_a":"bring this bigot home and throw her off the team.","post_message":"Seriously?"},{"comment_id":"1244871155548303","commenter_b":"You ain't going anywhere you f. Ing. Liars.......where u gonna make your money.....u should feel lucky that this is the only bonehead country that would pay your assets to do anything on film!!! BIG FAT LIARS......THEY R WHAT THEY IS !!!!!","commenter_a":"Yea.........see ya","post_message":"The last slide Don Jr. has a nice surprise for all of them!"},{"comment_id":"1016384461715898","commenter_b":"So stop your judgemental whining bitch","commenter_a":"Sorry mice, but as someone with crohns I fully support this research.","post_message":"Researchers have engineered small intestinal tissue from human cells, and when placed in mice, the transplants were able to digest and absorb like the real thing."},{"comment_id":"1700820033514238","commenter_b":"Yeah , more Women would have Guns!!","commenter_a":"who voted for these people?","post_message":"Pretty sure the millions of female gun owners would disagree."},{"comment_id":"10153161008224087","commenter_b":"Yvette Eva Hirsch. Where does everyone come up with this comparison? Hitler wanted to kill any non white people. If you weren't blonde haired with blue eyes you were killed. And even then if you meet that criteria and a Jew you where still killed. Trump wants to build a wall and establish a true border which should have been done long ago. He wants to have illegals leave. They are illegal after all and by the current laws shouldn't be able to work due to its illegal to employ a illegal. Notice there is no killing, no rounding up of people based on race. Mexico's constitution doesn't even allow citizens from Mexico to be given citizenship to a child born in another country citizenship in that country. This all started when everyone stopped trying to offend illegals by calling them UN documented to make it sound better. The fact ...","commenter_a":"Maybe the establishment should sign a pledge to treat him fairly, and honor the will of their base!","post_message":"Donald J. Trump said that if he signed the pledge not to run as a third-party candidate, he expects to \"go up 10 or 15 percent\" in polls."},{"comment_id":"10153385776126323","commenter_b":"\"Studied film and literature\"... Bahahaha bitch please...you are obviously no intellectual titan","commenter_a":"Though at least as far as the so-called \"New Atheists\" go Dawkins - along with Daniel Dennett - actually has substance to what he says and knows how to contextualise his arguments (some of the time). Christopher Hitchens sounded like an intellectual but acted like a thug. And Sam Harris is frankly one of the most pathetic and risible writers to garner an otherwise intelligent audience in this century so far. Ego the size of a planet - with a humourless sense of his own importance despite the impotence and unoriginality of his work - without even the charisma of Hitchens or the intellect of Dawkins/Dennett to back it up.","post_message":"“How dare you force your dopey unsubstantiated superstitions on innocent children too young to resist? How DARE you?”  Is Richard Dawkins a hero, a heathen, or a liability?"}]
