[{"comment_id":"10153392413471748","commenter_b":"Abortion is safe cause ha aint getting in","commenter_a":"Historically, once extremism takes hold, it is very, VERY difficult to put the genie back into the bottle. As long as the extremists face no serious consequences, they will just get more and more radical in their pronouncements and actions. Only when there is a very strong backlash is there any chance of them backing down, as we saw when the anti-communist witch hunts were finally contained. But religious extremism like Huckabee's is much harder to deal with (as Goldwater presciently saw), because they regard all resistance as persecution and attacks by spiritual enemies. Sadly there is a chance, even if it is small at the moment, that America will ride the tiger of extremism to disaster. And unlike Germany after WW2, there would be unlikely to be any second chances, any opportunity for redemption, because a radical, apocalyptic, theocratic USA would almost certainly initiate WW3.","post_message":"Mike Huckabee thinks that as president, he could prevent literally all abortion."},{"comment_id":"10153065871694138","commenter_b":"It was just an upgrade to walking 5 miles each day for water...","commenter_a":"He could have bought a car, he chose not to.","post_message":"He kept a perfect attendance record walking 21 miles to work every day for 10 years."},{"comment_id":"10154482424522144","commenter_b":"White, 'christian' males should be put in concentration camps as they have killed more Americans than muslims","commenter_a":"They don't fit his fantasy of a dystopian world???","post_message":"Actually, it's Trumpnot the mediawho's ignoring certain terror attacks. Guess why."},{"comment_id":"10155686821610354","commenter_b":"Please were in Big Trouble if the ASSHOLE gets in. It's bad enough the ASS already in office is dismantling our Country little by little she'll just finish it off. Her and her asshole of a husband.","commenter_a":"She could have changed to state ID if she is no longer driving and that information should have come via letter","post_message":"Clinton said that she was fighting “for the grandmother who’s turned away from the polls because her driver’s license expired.”  If she didn't want it to expire, she could have driven once or twice since 1996..."},{"comment_id":"946413835412782","commenter_b":"100% on welfare and too lazy to work. Their freebie food gives them energy to cause protests and riots all the time.","commenter_a":"I wonder if George Soros is funding any of these BLM people. He funded the protesters at Ferguson and Baltimore. Same faces running around protesting....","post_message":"Grassroots Activists Push Black Lives Matter Thugs Off Of Michigan Ave [Video]  This is what the main stream media DIDN'T show you..."},{"comment_id":"1141996625817686","commenter_b":"Just jealious she can kick your butt","commenter_a":"The. ' Token Brunette ' on Fair and Balanced ' comedy show !","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154775729248812","commenter_b":"Not to mention she has dyed her eyebrows to try to look younger. Won't work. She still looks like she needs a nap.","commenter_a":"They both disgust me","post_message":"Hillary Clinton: “Last night I was ‘grossly generalistic,’ and that's never a good idea.'"}]
