[{"comment_id":"10158044749370294","commenter_b":"'@username nothing about him says he would do any of that....he got into a car crash lol stop making these puppets look like heros","commenter_a":"Why was he even shot when he had no weapon e could have been taken in to custody without killing him. That officer needs to be investigated and put on leave of absence","post_message":"There's still a lot of question about what happened leading up to the fatal shooting of a college student."},{"comment_id":"1059210544118408","commenter_b":"Ramos is a Mexican so he won't listen to reason. When we lived in Temecula, Ca., our Mexican neighbors next door would go down to the Mexico/San Diego border & pick up illegals & bring them up to live in their garage!!! So I know firsthand what goes on at the border!!!","commenter_a":"Immigrants aren't the root of this country's problem. #scapegoat.","post_message":"Do you agree with Bill O'Reilly here?"},{"comment_id":"10153424908946094","commenter_b":"I wonder if the folks at Apple are thinking 'PLEASE Mr. Snowden, don't support us!'.","commenter_a":"Citing an 18th century law concerning iPhones?!","post_message":"A major debate over privacy and online encryption has erupted after the computer giant Apple announced it will resist a court order to help the FBI break into an iPhone recovered from one of the San Bernardino shooters."},{"comment_id":"1195382713852612","commenter_b":"Okurumoniwonba Orimekunluyi, you are an idiot. None of what you say is even remotely true. Please pay attention.","commenter_a":"If Elizabeth Warren called me she would certainly get an earful of how despicable she is. She would hang up on me but I wouldn't hang up on her.","post_message":"When Elizabeth Warren isn't busy holding special interests accountable, she finds the time to make some calls for Hillary. Join her: hillaryclinton.com/calls"},{"comment_id":"10155184641741509","commenter_b":"They wanted that sweet Brazilian booty","commenter_a":"I really think these dudes were out looking for mad hookers and they got robbed because of it LMFAO!!!!","post_message":"JUST IN: US swimmers Jack Conger and Gunnar Bentz were removed from their flight from Rio de Janeiro to the United States by Brazilian authorities, US Olympic Committee spokesman Patrick Sandusky told CNN Sports contributor Christine Brennan. Earlier this week, the two swimmers were with teammates Ryan Lochte and James Feigen, who are wanted for questioning by Brazilian police after questions were raised over their accounts of being robbed."},{"comment_id":"10154655790571101","commenter_b":"We will see the illegals go!","commenter_a":"But he promised the morons a yuge wall and told them the Mexicans would pay for it.","post_message":"'These are dreamers who are seeking the American Dream, and we should embrace them rather than do a bait-and-switch.'"},{"comment_id":"1083743574979986","commenter_b":"nah, bitch. not now.. just getting going :)","commenter_a":"forced depopulation by way of financial and imprisonment threats.. sad..","post_message":"The Australian government will tighten the rules requiring children to be vaccinated in order for parents to receive welfare payments and childcare subsidies."}]
