[{"comment_id":"10153807891284062","commenter_b":"He served our country well and is our Founding Father.","commenter_a":"Only one problem with having to be a dead president. Ben Franklin was never president.","post_message":"Which of these women would you like to see on the $20, if any?"},{"comment_id":"1146187242090421","commenter_b":"Lordy...I'd wear that brownish ass out...then marry her!","commenter_a":"My opinion is that, it is not nasty, is just a big booty, so whatever.","post_message":"Big booty problems."},{"comment_id":"1229145840456983","commenter_b":"Clinton can't tell the truth! Can't remember her lies ! Gives her daughter 1,000,000$ a year of stolen money gained from corruption even year making Chelsea an accomplice ! As well as an accomplice to her email crimes! Arrest them all 2017!!!! Obama and Clintons open boarder policy and the invasion led by both to destroy America while millions come their way ! A record number of illegal aliens penetrate our wide open borders and manipulate a dysfunctional visa system, the boys now urinate in the girls bathroom if they identify as a female, the growth of Islam in America is unstoppable, the debt is so high the number appears fake, the shrinking of the military is sickening, veterans are killing themselves at alarming rates, the war on cops is an epidemic, we back to segregating college campuses, Obamacare is worse than what we had before it was a law, ...","commenter_a":"Hello she bed IP with people ehp kills hays","post_message":"She is the LAST person in the world who should be lecturing anybody about respecting anybody's rights, with her own HORRIFYING connections..."},{"comment_id":"10154846980595575","commenter_b":"Only thing to say is, the political don't really give a rats as about our country or its people unless the are profiting from it.only Americans that care will change this type of bulls hit .America infrastructure is need of desired repairs. Let's take care of America before refugees","commenter_a":"There should be no money sent to this governor who chose to use the money for criminal reasons. You just can't do that!","post_message":"Instead of fixing the dam, Gov. Brown spent $25 billion per year on illegals!"},{"comment_id":"559978767492171","commenter_b":"This @username guy can be on my tv screen anytime he likes. Hello, there 😍","commenter_a":"Hillary for President!","post_message":"Take a sneak peek at the MSNBC #DemDebate! Hillary Clinton and Bernie Sanders face off tonight at 9pm ET. Here's how to watch: @webpagelink"},{"comment_id":"1152899144750942","commenter_b":"She should be more scared of her elder rapists.","commenter_a":"I have this theory that if he wins, at his coronation hes gonna start his speech by saying he doesnt want to be president he just wanted to prove how racist and bigoted people in this country are by going out saying ignorant shit on all levels and poor rednecks eat it up. I mean seriously if people really think trump would be good for America those are the people that are wrong for America. You can spend all day polishing a turd but at the end of day hes still a piece of shit. All the anti muslim shit he spews with all his rich muslim buddies. He has hotels and other businesses in multiple muslim countries are we supposed to ignore that or what.","post_message":"They let her know, in no uncertain terms, that they have her back. - Eric March"},{"comment_id":"10154530088657908","commenter_b":"Ginny Gruhler Vanderhoof You are a very dishonest person \"Sanders battled over veterans issues as chairman of the Senate Veterans Affairs Committee from 2013 until early this year, giving him an easy pitch to a crucial voting bloc of veterans, particularly in South Carolina where veterans make up more than 11 percent of the voting-aged population. There stiff competition for these voters, with front-runner Hillary Rodham Clinton wooing them this month during a round table in Nevada. Even the leaders of veterans groups who praise Sanders acknowledge that the 73-year-old Democratic socialist isn an obvious champion for the flag-waving set of former military officers and enlistees. When asked if the Veterans of Foreign Wars, which recognized Sanders with its Congressional Award in March, had ever bestowed the honor on a socialist before, the group Washington executive director, Bob Wallace chuckled a bit. . No. No, said Wallace, a man who ...","commenter_a":"Why does Hillary think she can get anything done? We've seen how the congress works now. Even if the Democrats re-take the Senate, we still won't have the radically gerrymandered House until 2020. It will be nothing but stonewalling until then. That and attempts to repeal the ACA are all the GOP reps remember how to do. Plus, they hate her with the fury of a thousand suns. They'll waste all their time and hundreds of millions of taxpayer dollars investigating her for anything they can think of until they can figure out some way to impeach her as well. She's not getting anything done. But if Bernie is the candidate, and he is able to continue to energize his massive voter base, then suddenly we have a shot at taking the entire congress back and getting something done. Bernie will bring far more folks to the polls than Hillary ...","post_message":""}]
