[{"comment_id":"1834672043468268","commenter_b":"Well if she wants to waste her money.... Whatever","commenter_a":"wasted money","post_message":"Actress Meryl Streep loves throwing her money into politics. Particularly when it involves Barack Obama and Hillary Clinton."},{"comment_id":"1756908037896244","commenter_b":"No! just let them leave our Country.","commenter_a":"Mega bucks to play ??? Go out and really work !!! Ha ha!","post_message":"If they want to disrespect our nation, then they can leave. Anyone who doesn't want to stand for our national anthem on game day should be kicked from the league. Do you think these ungrateful players need to be taught some respect?"},{"comment_id":"1150660831667337","commenter_b":"@username shut up fatass hoe","commenter_a":"America was built on hate! Just ask the Indians.... oh wait it's hard to find any because the white man almost killed off the whole entire race for land?? Land that was never theirs?? Land that is foreign to them? Oh and we are the savages?","post_message":"Good question #Philippines #WSHH"},{"comment_id":"10153671007817452","commenter_b":"@username if ur really going to have a discussion please don't start with \"then how is it that...\" When you focus on the trees rather than the forest, ur def lost. If you haven't done research on average income, crimes by income, distribution of resources to low income, then this is above your level of comprehension. Start with census and BJS","commenter_a":"“If Black Lives Matter was truly concerned about black lives, they’d be concerned about black crime.”","post_message":"From Atlanta to Phoenix, to right here in L.A., protests are growing across the nation after this week's deadly officer-involved shootings. But not everyone is happy that protesters have hit the streets less than 24 hours after the Dallas bloodbath that left 5 police officers dead and 7 others wounded. Tonight the tense scenes from coast to coast - at 11 from ABC7 Eyewitness News. @webpagelink"},{"comment_id":"743297559178019","commenter_b":"Dumbest fucking answer. Trump met with the black panther party and several top gang members from Chicago to reduce body counts and help fix the black community. Dumb asses mistake for deportation of illegals vs legal immigration. Left supporters are the dumbest people on the planet.","commenter_a":"Good !!! Just makes More room for the REAL PATRIOTS","post_message":"\"I'm not going to the White House. I don't feel accepted in the White House.\""},{"comment_id":"644944732314902","commenter_b":"Yes, she showed America just how much she loves her country, while the SLUT demonstrated her true nature as a racist!","commenter_a":"Never a real fan of Lady Gaga up until now. What a brilliant, beautiful voice. Beyonce should leave the country if she feels she must promote racism.","post_message":"Do you think Lady Gaga did a better job than Beyonce at the Super Bowl?"},{"comment_id":"1890349187852006","commenter_b":"One does not have to TRY to cast america in a bad light..... The racists & Nazis here do a good enough job by themselves. America is NOT great, & will never be great again until the cancer which arrived here In 1492 is removed. Swim back to Europe racist beast","commenter_a":"Stupid, stupid, stupid. I only still like this site cuz i wanna read what propoganda u spew next. Has anybody else thought that this site is communist run, or pro russian. They always try to find ways to cast the US in a very bad light","post_message":"OMG, did you hear? $$ Dump: @webpagelink DAPL Raid: @webpagelink Drone Bomb: @webpagelink Join Us: The Free Thought Project"}]
