[{"comment_id":"10157462499315093","commenter_b":"Hillary Rotten Clinton is the most corrupt person to ever run for president...she is like Crabby Appleton,Rotten to the core....","commenter_a":"Hillary Rotten Clinton is the most evil and most corrupt politician in our country's history hands down.","post_message":"They gave money. She gave them meetings. It's a conflict of interest. It's corrupt. She's still lying about it."},{"comment_id":"10153376841020329","commenter_b":"Lel bc cats was one of them","commenter_a":"Madeleine Chetcuti @username @username 33...","post_message":"Break a leg!"},{"comment_id":"979742035426993","commenter_b":"Send this JEW to ISREAL , they don't Belong in the USA !!","commenter_a":"What an idiot and people are ACT voting for him","post_message":"COMMUNIST LUNATIC Bernie Sanders Just Called For Total Gun Confiscation! @webpagelink"},{"comment_id":"10154189776881130","commenter_b":"I'm ready, bitch.","commenter_a":"Not reading the article--no time for it. But to pass along, a commentator on CNN today said that the Clintons operate from a stance of self - righteousness, thus they cant see what they're doing is oh so wrong. Hit it on the head! Two major party candidates, to major flawed choices!","post_message":"If Hillary Clinton wins in November, brace yourselves."},{"comment_id":"10154104825566336","commenter_b":"@username so you think the bible is nonsense. You better wake up before you meet your maker. - Bob","commenter_a":"Luke 8:17 What is done in the dark surely will be brought to light.","post_message":"Fox News confirms that a buried knife has been found on what used to be O.J. Simpson's property and is being tested by the LAPD. @webpagelink"},{"comment_id":"726800087419505","commenter_b":"@username get 'em, girl!","commenter_a":"BERNIE SANDERS AMERICAS ONLY HONEST CHOICE 2016","post_message":"Hillary Clinton campaign's \"abuela\" post sparks #NotMyAbuela hashtag."},{"comment_id":"919328804793264","commenter_b":"These girls have behaved impeccably!!","commenter_a":"As soon as someone denies being racist, the following lines reveal their bigotry.","post_message":"Once again, we are treated to a massive display of Tea Party \"not-racism.\""}]
