[{"comment_id":"508257596043081","commenter_b":"His wife destroyed that college but gave herself $200k severance pay. They are crooks","commenter_a":"If Sanders were to be nominated and elected in Nov, big problem is that he has not raised money, or campaigned for, congressional Democratic candidates. In other words, Sanders will be no better off than Obama has been if he can't get enough members of Congress to pass his initiatives.","post_message":"The attacks are going to get more unhinged."},{"comment_id":"718949644953580","commenter_b":"HAHA. Chickenshit. Stay home and tweet like a little bitch.","commenter_a":"chickenshit can't take the heat","post_message":"Pathetic."},{"comment_id":"1086650491355306","commenter_b":"Furthermore: @webpagelink","commenter_a":"the outcome is so sad, I feel sorry for the woman relatives... I believe her suicide was due to the bad treatment she received from police, and that she was extremely emotional about it... nothing will avoid this happening again, but re-training the whole police dptm about the way they treat any ordinary citizens nowadays","post_message":"A Texas trooper who arrested Sandra Bland has been fired after being charged with misdemeanor perjury on suspicion of lying in the arrest report he filed, officials said. Read more: @webpagelink"},{"comment_id":"1368989116512954","commenter_b":"This is a poorly done troll job","commenter_a":"How about cutting the businesses taxes and then giving that money to illegal immigrants and other countries and people on welfare who can work?","post_message":"After liberals raised the minimum wage again, this restaurant owner had had enough. Here's how he took matters into his own hands and made sure his customers knew it...  This is what the left does NOT want to talk about when it comes to the 'fight for $15.'"},{"comment_id":"915863931882175","commenter_b":"I think he should be raped until bleeds to death","commenter_a":"Let him go to prison and play with REAL BIG MEN","post_message":"Amanda awoke to find her baby was missing. She found her in the basement bleeding and unconscious. This man had raped the 9-month-old infant until she was brain dead. He was arrested and is in jail, but many people think he deserves a harsher punishment for his crimes. A new petition is calling for him to be hanged in public for his disgusting crime.   Should he be hanged?"},{"comment_id":"1862154907348470","commenter_b":"I'ma tear that fried rat clean down!! I got moves to make and a child to feed. I'm a proud fried rat eating father! Haaaaah","commenter_a":"spider","post_message":"Which would you choose? #WSHH"},{"comment_id":"10150755194664999","commenter_b":"Are you suggesting women become prostitutes?","commenter_a":"Domestic housekeeping is correctly dismissed as being of economically minimal value, because in the free labor market performing these tasks for others (child care / babysitting, housecleaning, short-order food preparation) are low- (or no-) skill jobs that are either minimum-wage, or 'under the table' cash-based work.","post_message":"'We need to call work what it is — work — whether you do it at home or whether you do it out in the labor force, and then give men and women options to choose what they want to do.'"}]
