[{"comment_id":"495965727273607","commenter_b":"we don't want that pussy here anyway","commenter_a":"Whatever","post_message":"Bruce Springsteen and Bryan Adams are HUGE Hypocrites!!!  They play their 'music' in countries that throw gay people off buildings, but ban perverts from going into a little girls room and all of a sudden they got a problem???P"},{"comment_id":"1143371025741432","commenter_b":"Can't stand this big ass getto fat bitch","commenter_a":"Illuminati whore","post_message":"Obama declared her a great role model for children, now Beyonce has released a sickening video.  But the violence and feminism in it isn't the worst part. Look who actually shows up in the video with her..."},{"comment_id":"10153792604111746","commenter_b":"Two fools!","commenter_a":"Not at all. I love them both and i hope they are the host on 10/19 which is my Birthday.","post_message":"People on both sides of the aisle thought the two were biased."},{"comment_id":"1705936436359891","commenter_b":"Oh shut up! The murdering, lynching KKK will be around to continue their hate. It would be great for you all to go back where you came from. The Indians would love it!","commenter_a":"so Black lives matter can protest anywhere and everywhere, but no other group can.hum? not that i agree with the kkk but they do have the same rights as Black lives matter.","post_message":"By the time this KKK rally was over, blood was on the sidewalks and ambulances were on the way:"},{"comment_id":"1700042326929352","commenter_b":"Right here with my eyes open....much wider than your evidently.","commenter_a":"I just saw a posting with Trump and the same headline....too easy to to photoshop pictures these days. If you remember, bush didn't salute a Marine coming off AF1, as did President Obama....they've all done it at one time. However, I think Obama has been a great job....kept us out of a bigger depression than the big depression the last president create, but Americans have very short memories.","post_message":"Obama Refuses To Salute During The Pledge Of Allegiance [VIDEO].  Hands down the worst president of all time.  Do you think Obama is a disgrace?"},{"comment_id":"10154082437051051","commenter_b":"As usual she is lying.","commenter_a":"Wrongagain.","post_message":"Hillary Clinton says there's no question Obama will go down in history as a successful president. Is she right?"},{"comment_id":"1256741554345872","commenter_b":"Says the guy who looks like Peter griffin....","commenter_a":"So, liberals are proud of the filthy mouthed losers who interrupted good people coming to hear a speaker? Makes sense - birds of a feather flock together and liberals are losers. That is why people who seek to succeed hang around republicans and others who are successful.","post_message":"Watch Donald Trump get interrupted by protesters during his North Carolina rally on Friday. By the end of the night, Trump was heckled 10 different times.  Read full story: @webpagelink"}]
