[{"comment_id":"1178310438875078","commenter_b":"Now we have to feed, clothe and house this murdering POS! Like the other 60 million illegal aliens aren't enough! Mexico's corrupt government couldn't keep track of him! Take him out to the desert and open fire!","commenter_a":"Get a rope!","post_message":"DRUG KINGPIN heading our way (until he escapes, of course) details: @webpagelink"},{"comment_id":"10154259751471509","commenter_b":"What because he supports the laws of the land? Yeah. Illegal immigrants are illegal. Period. Muslims harbor terrorists.. Period. We are 19 trillion in debt. Will take a business person to get out of it, not a crooked politician who put us here..period.. I can keep going","commenter_a":"That's the main reason Trump will be elected, we the people are pissed, Hillary lies, Obama lies, Congress lies and the media lies for them","post_message":"Ever felt that politicians were fibbing? Several CNN Opinion contributors weigh in on truth and lies in the political realm."},{"comment_id":"10153566886509614","commenter_b":"Stupid girls!","commenter_a":"Looks like the liberated those caged pups. :)","post_message":"Two teen girls were caught on surveillance footage stealing two puppies who were still nursing and not yet ready to leave their mother, workers at a pet store in Compton allege. In the video, one girl can be seen leaning over a gate and grabbing a puppy while the other stands by. The alleged theft happened Thursday at Jazmin Pet Supply. this post to alert others. Watch KTLA video here: @webpagelink"},{"comment_id":"10153493676581770","commenter_b":"Them bitches will kill you quick as their men.its their belief.","commenter_a":"It's about time!","post_message":"A collection of brave individuals acting on behalf of a little-known non-profit is running daring operations to free Islamic State sex slaves, including literally cutting the chains binding a woman to a bed."},{"comment_id":"1039629819427046","commenter_b":"Americans could get jobs if they'd get off their fat asses and go to school. All these uneducated Trailer Trash need to go back and graduate 3rd grade.","commenter_a":"We have Americans that are finding it hard to find work because of the flooding of all the refugees just think that will be 50000 more Americans that won't be getting a job because they will","post_message":"BREAKING: Two Iraqi refugees in the U.S. were arrested on Thursday for supporting terrorist groups in the Middle East. The FBI Director has repeatedly said that the U.S. does not have the ability to thoroughly screen refugees for terrorist ties."},{"comment_id":"1281672095204357","commenter_b":"Yep, in with the younger roaring lion, out with the old senile evil slimy snake.","commenter_a":"I hope he can get Congress to kick them out of NYC. That building would make a remarkable place to house and care for our vets and homeless. That would save us so much money. The UN is not needed for us. No one I know wants to belong to a One World Order and governance. Let them move somewhere in Europe and take Soros with them.","post_message":"This is going to be good..."},{"comment_id":"10155027451044411","commenter_b":"Boooo :) make them strong :) We kick your ass in Afghanistan... @username should respect other cultures and their traditions.. These Indian Muslims doing this due to their believes.. This is racism what is @username doing..","commenter_a":"What about you Russian whores bathing their babies in Ice cold water... shit heads @webpagelink","post_message":""}]
