[{"comment_id":"10153152461759170","commenter_b":"Because many people don't understand the effects of war on our men and woman of the war they fight overseas and home. It's the sadest thing I've come to know and yet sooooo many people can't understand. Watch and learn what they suffer along with there Loved ones. Then remember there sacrifice!!","commenter_a":"No they don't hate war movies, they hate war movies when an American is the Hero.","post_message":"No one should be surprised that American Sniper didn't win much at last night's Oscars..."},{"comment_id":"1735996146651286","commenter_b":"@username You are just a Con Man Two Faced Liar who is spreading false hope promises with zero substance to back up what your saying. You are playing America the same way you played the Americans that went to your scam Trump University","commenter_a":"Clinton is a close friend of the big banks, big pharma, and everything else that corresponds to corporate capitalism, millions of Americans already struggling will sink even further under the waves. Rental and housing prices, already astronomical, will rise to more heights of unaffordability. Drug prices and health care costs, which soared under Obama. Then, police shootings. @webpagelink","post_message":"America led by Hillary will be an AMERICA where things get even WORSE than it is now.  Higher taxes, rampant TERRORISM and MORE CORRUPTION from Washington, DC!  TOGETHER, we WILL Make America Great Again!"},{"comment_id":"1026275800718010","commenter_b":"Oooooh. Oh Oh someone is actually deciding that the Manchurian fraud president could actually be an Islamic terrorist. Well the grasshoppers may actually be waking up to that fact. What the hell do you think I have been saying for the last six years. In the movie the Manchurian candidate American prisoners were being brain washed by the Chinese to undermine America and it's politicians and kill them. In Obummer's case he was indoctrinated into the Muslim cult and communism by his father mother and his in-law's. There are no Muslim or Islamic American's because they will give their lives for Islam. They are instructed by the Koran to deceive the infidel's and make them think that you are their friend. When the time is with us we will torcher them and then kill them in the name of Islam There are no good Muslim's . That is for outward ...","commenter_a":"Yes","post_message":"Millions of Americans have suspected for quite some time about Barack Obama's ties to the Muslim Brotherhood. Now, there's a document that's being called \"the smoking gun.\""},{"comment_id":"10153060785906519","commenter_b":"Hillary covered up for him all those years in AR because she knew he was going to be president. The wives of predators who cover up for them are almost as guilty as the offender. She only cares about one thing...power.","commenter_a":"Y'all still talking about Clinton and consensual sex. Oh I get it Hillary's running, so y'all need to bring that up again. Never mind that it isn't relevant! Or are we blaming Hillary for a spouse that strays?","post_message":"\"The actual facts of the matter are that Bill Clinton was a serial abuser of working-class women–he had exploited that power differential even in Arkansas...\""},{"comment_id":"10153838476451509","commenter_b":"We \"poor people\" are richer than she'll ever be. Shallow, vapid tart.","commenter_a":"Grande opening, Grande closing. Hopefully her career.","post_message":"Security footage showed singer Grande appearing to \"maliciously lick\" a donut in a shop: @webpagelink"},{"comment_id":"948144815307058","commenter_b":"@username I appreciate that... However even though the question was asked by one person and he answered her directly .. He did that in front of an audience... As a parent I get what he's trying to say... But as a woman it makes me angry .. The boys that are being raised need to be taught that when a girl is too drunk to give consent it can be considered rape - I say can because not every girl that has drunk sex is going to consider it rape - but some may - plus it's incredibly unrealistic to tell a college girl to stay away from a party with alcohol... U may as well send her to a convent ..","commenter_a":"This advice isn't blaming the victim. Advising someone to lock their doors at night is not preemptively blaming the home owner for a robbery. Should we live in a world where girls can go to drunken college parties and not worry about being sexually assaulted or raped? Absolutely. Is that the world we live in? No.","post_message":"John Kasich to student concerned about sexual violence: \"Don’t go to parties where there’s a lot of alcohol.\""},{"comment_id":"1240366709375196","commenter_b":"Oh how I pray that would happen because that is where she belongs. Get out and vote TRUMP!","commenter_a":"She must NOT be elected, then impeached or her VP would take office. Then she would just be the puppet master. Telling him what to do. Come on America, do what is right!!","post_message":"We all hope that Donald J. Trump takes down Hillary, but a backup plan has just been launched in case he doesn't.  This is a massive development in the campaign, and you know it's got Hillary's people worried."}]
