[{"comment_id":"1229861343720720","commenter_b":"She would govern effectively by not selling out, like HRC did decades ago and like Sanders never did during his campaign. #JillNotShill","commenter_a":"I have liked her page.I'm trying to research her. I have ave some reservations. If she were to win how could she govern effectively? With zero green party reps and senators to assist her. For the green party to be effective we would need down ticket victories also. I don't like Hillary Clinton! I absolutely fear Donald Trump. Voting green in 2000 gave us GWB. That is NOT debatable those that don't accept that are just in denial. Jill's platform is in accordance with my beliefs. I do think that her promise to put Snowden on her cabinet is pure pandering. That troubles me. Voting my conscience would be horrible if it means a Trump presidency.NOTHING COULD BE WORSE! !!","post_message":"Dr. Cornel West on the morally bankrupt DNC Platform: \"There's no way for me, as a human being, a teacher & a citizen - if we can't say a word about TPP, if we can't talk about Medicare for All explicitly, if the greatest prophetic voice dealing with impending ecological catastrophe can hardly win a vote, & if we can't even acknowledge occupation as something that's real for a slice of humanity... there's no way in good conscience I could say 'take it to the next stage!' I wasn't raised like that. That's not my calling. I'm just being truthful. It'd be a violation of my own limited sense of moral integrity and spiritual conscience. That's how I roll.\""},{"comment_id":"10154304123721051","commenter_b":"When Leftists Attack - Man Harassed For Wearing #BuildTheWall T-Shirt","commenter_a":"Teddy Roosevelt was our President during a different time period. Our country has grown in diversity, and as we continue to progress, expanding our minds and opening our hearts is the order of the day.","post_message":"Do you agree or disagree with this Theodore Roosevelt quote?"},{"comment_id":"10154441251316756","commenter_b":"Dousing has been around for a long time.","commenter_a":"Funny how those diving rods never find the plumbing or septic tanks..","post_message":"Our reporter says the rods she was holding \"forcefully cross[ed],\" without her moving them. She doesn't know how it happened."},{"comment_id":"1220297847993003","commenter_b":"174742062548592helle Simons, she had the ability to dispense medicine to stop their suffering and didn't. That makes her a monster.","commenter_a":"I think this article is written very poorly and from a single minded view . Being Saint does not mean that you are perfect as no one is . It means you have strived all their lives to fulfill Christ mission and to serve God . If you don't believe in the church values and mission then why do you care who we canonize? Also when it comes to caring for people with a large organization things are much more complicated . There are many people who max out on pain killers and still feel pain in the hospitals. So when it comes to pain meds that are very valuable and they may not work why administer them ? In places like Calcutta it is not just a question of money but also transportation . They in fact hold more money then they need to but I very well doubt ...","post_message":"Is Mother Teresa a saint or an expertly-managed brand?"},{"comment_id":"1172807002807988","commenter_b":"But you know it's hard to dress a tranny and make anyone think they're a woman !!!","commenter_a":"Well this certainly has nothing to do with the article, but thank goodness Michelle's designer will not be dressing Melania. Think how hard it was to come up w flower gardens, etc to cover all the hair on Michelle's chest every time she dressed her. Melania's designer will have it much easier dressing a woman w a figure.","post_message":"Looks like Michelle saved her most patronizing comments for last. When you see what she just said, try not to lose it! Are you ready for Melania Trump to be the First Lady?"},{"comment_id":"10154276196928128","commenter_b":"more like a buzzard ,she will eat america alive","commenter_a":"People seem to forget!! This is what happens when you mess with the Clinton's!! You can share this from my page if you want. And I did not write this I copied it from someone else that posted it. And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clintons convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown .. The murder happened just after she was togo public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock ...","post_message":"Aaron David Miller asks: Is Hillary Clinton's hawkish past an accurate indication of how she would behave as president?"},{"comment_id":"977430998961803","commenter_b":"Europe just \"undid\" what the last Christian Crusades accomplished. All who refuse to convert to islam will soon be put to the sword.","commenter_a":"Europe is not the Europe we knew yesterday, history has been made today. Europe will not longer be Europe it is now a Muslim world. We just lost the wonderful world of Germany, France, Spain, England, Poland, Austria, etc. It's sad, the only one fighting for their country is Hungary and I give them a lot of credit, they don't want to lose their Christian faith. And America is next, we will be taking in thousands but the problem is we don't know if we are getting terrorist or good people. All I can say is God Bless us all,","post_message":"Why are the \"refugees\" mainly fighting age men? Where are the women, children and elderly?"}]
