[{"comment_id":"10152959541546519","commenter_b":"But it's totally cool that the white women told the black kids to go back to their Section 8 housing, right? Ugh.","commenter_a":"I truly wish people would read the whole story before commenting. This was one of 2 cops (until backup arrived) who had just been charged by dozens of young adults and teens. He has every right to fear for his safety...AND he has every right to restrain a \"kid\" who is illegally trespassing in a gated community and trying to run every chance she gets.","post_message":"This cop picked the wrong kid to harass and abuse..."},{"comment_id":"10153831710401509","commenter_b":"OMG !!!! GET OFF HER BACK, people get suntaned without a hassle !","commenter_a":"ENOUGH!!","post_message":"Paula Deen has some \"explaining\" to do: @webpagelink"},{"comment_id":"1362983927059832","commenter_b":"Found the \"run the USA into the ground\" voter.","commenter_a":"In a close election, to falsely broadcast that a candidate \"faces indictment\" is an act of sedition, especially when they know their viewers are hungry to believe such a ridiculous lie and would eat it up. Absolute treachery!","post_message":"In fact, Baier said, after checking with his sources, there is no evidence at this time for either statement."},{"comment_id":"10153713540778984","commenter_b":"Chicago and Detroit have been run by democrats for years , as is california. This welfare state is all about staying in power, so is illegal immigration. The end result is bankruptcy, the next result Greece .","commenter_a":"If you're not disabled you need to work! HAVING CHILDREN IS NOT A DISABILITY! BEING A DRUG ADDICT IS NOT A DISABILITY!","post_message":"Wow. The welfare abusers about about to get some VERY bad news... they didn't see this coming. It's about time the cheating and the fraud got shut down... this needs to happen EVERYWHERE."},{"comment_id":"1528607397159285","commenter_b":"Nobody has proved that Russia is behind it .","commenter_a":"I just can't take how Trump supporters defend this disgusting and vile piece of trash! Let's vote based solely on platform! Everyone keeps saying that they both have a lot of baggage, so let's level the playing field.","post_message":"\"To profess not to know at this point is willful misrepresentation,\" an official said."},{"comment_id":"894432780616200","commenter_b":"Baltimore is am example of liberal policies failure people want jobs not government social handouts","commenter_a":"This is a Democrat liberal myth if any of the Democrats they would read a history books they would learn that the Democratic Party was the original racist party remember Lincoln was a Republican","post_message":"Can't say we weren't warned ahead of time this might be a problem."},{"comment_id":"895899747125716","commenter_b":"These child rapists are our allies?? No F-----G way!!!","commenter_a":"Please help this soldier who was trying to stop the rape of a boy!","post_message":"All of Congress should support this...."}]
