[{"comment_id":"10153257961321162","commenter_b":"They should crucify her.","commenter_a":"Wtf people come on!!","post_message":"DEVELOPING: The bodies of two children, ages 11 and 14, were found dead in a freezer, and the mother is being held as a person of interest @webpagelink"},{"comment_id":"10152863643681990","commenter_b":"Illegal immigrants should not be here to commit any crime. U. S. Citizens do not need the extra concern.","commenter_a":"Yes look at Dyllan Roof he looks Latino... He shoot 9 black people last month in church.","post_message":"IMMIGRANTS AND CRIME: Despite rhetoric in the Pier 14 shooting Francisco Sanchez case, immigrants do not commit more crimes that U.S. citizens. That's according to 100 years of research according to the American Immigration Council. @webpagelink"},{"comment_id":"10154066613342908","commenter_b":"It already IS that way. I'm all for him too, but he's big moneys' worst enemy.","commenter_a":"Tell 'em like it is, Bernie!!!","post_message":""},{"comment_id":"1063797583686996","commenter_b":"Giant vagina","commenter_a":"@username you","post_message":"It be like that"},{"comment_id":"10152862008521336","commenter_b":"I'm so glad they caught those scumbags without more bloodshed. It still is b@llshit that some people think shooting at cops is an appropriate action to try and prove a point. If you want a lawless society I'm sure there is some third world country that will accept your dumb@ss.","commenter_a":"He Could Be Obama's Son!","post_message":"UPDATE: Two suspects are in police custody Tuesday for allegedly shooting two plainclothes NYPD officers responding to a robbery."},{"comment_id":"10153078698497994","commenter_b":"Ucs ? Every district around them closed! who are they competing with? This lady shouldn't be a superintendent of a kennel let alone of our children!!!","commenter_a":"378 schools closed today and a handful of are schools still open that has to be frustrating to parents, teachers and students. This is one situation it's not okay to stand out","post_message":"Nearly 300 schools are already closed this morning (including Detroit Public). You can check out the list here."},{"comment_id":"10153176047249255","commenter_b":"His wife should also go to jail .","commenter_a":"Such a self proclaimed victim.","post_message":"This story gets crazier every hour."}]
