[{"comment_id":"1044585922265355","commenter_b":"Poor little Marco.","commenter_a":"Senator Rubio, please stop getting in the gutter. Your recent comments make you sound like like you are 5 years old. You are better than that and I am so very disappointed.","post_message":"\"And you know what they say about guys with small hands...\" Marco Rubio said of Donald J. Trump."},{"comment_id":"10152522846320163","commenter_b":"She look real old","commenter_a":"I understand you wanna be different usher but pleases you should've stayed with Chili at least she's older but don't look it.","post_message":"It’s Official: Usher is engaged to longtime girlfriend Grace Miguel... check out her gorgeous ring here @webpagelink"},{"comment_id":"10154586302758822","commenter_b":"Nobody hire ur nasty bitch ass","commenter_a":"Kdka u must b gettn pressure from ur execs to push all this liberal garbage ur only local news i watch but its gettn harder and harder to watch","post_message":"Have you noticed a drastic spike in Insulin costs? What gives? Is there anything you can do about it? #KDKA-TV News at 5:45"},{"comment_id":"10153397675031323","commenter_b":"sure!our women too commit crimes like women in any part of the world and when caught,they go to prison","commenter_a":"Disgusting! I live in Iraq and our prisons are never like that! huh! and they teach us democracy!","post_message":"\"Even though keeping inmates clean would seem to be in the prison’s self-interest, prisons control their wards by keeping sanitation just out of reach. Stains on clothes seep into self-esteem and serve as an indelible reminder of one’s powerlessness in prison\""},{"comment_id":"1049253181797877","commenter_b":"So HRC YOU WILL NEVER WIN CALIFORNIA @webpagelink","commenter_a":"Hillary,we want you back at the White House!!","post_message":""},{"comment_id":"10154460389668445","commenter_b":"If this were on a normal sized girl, those panties would be muffin top city.","commenter_a":"What happened to the girl in the black suit her waist is half missing. Photoshop fail. Hahaha","post_message":"#Getstoned, caption this photo and tag two friends. These tees and more on sale shop.hightimes.com/collections/sale-items"},{"comment_id":"1008748529146158","commenter_b":"And you are a pussy","commenter_a":"Your not a hunter if your using a gun, your a murderer.","post_message":":("}]
