[{"comment_id":"529094357257035","commenter_b":"No, no I'm not.","commenter_a":"You are just another phoney.","post_message":""},{"comment_id":"551724101692742","commenter_b":"He is the Only Hope we have,,,,,,,,can't keep Letting Career politicians Destroy Our Country!","commenter_a":"Yes I do!!!","post_message":"More than half of Trump supporters say he won't be able to fix America.   Do you think Trump will be able to 'Make America Great Again'?"},{"comment_id":"653257648132607","commenter_b":"I agree. Fuck Kim Kardashian! She is trash.","commenter_a":"So a woman who's apparently famous for releasing a sex tape of her getting pissed on gets robbed of 10 million dollars worth of jewellery. Who the Fuck cares.?","post_message":""},{"comment_id":"10153321569596615","commenter_b":"The mask is part of hiding from an insecure woman so she can never find me again.","commenter_a":"Insecure women ruin more lives than drugs.","post_message":"\"Some people are commenting that she must be insecure or something, but it’s quite the opposite. People tell us we have the best marriage they’ve ever seen.\""},{"comment_id":"1033963386626709","commenter_b":"Please Kathy. Just run the Pap strip over your big mouth. Infected!!!","commenter_a":"Trust me Kathy........Nobody want to see your Ugly......Except maybe KILLARY!!!!","post_message":"Another classy remark from Kathy Griffin."},{"comment_id":"10153888455618128","commenter_b":"That's what happens when power vacuums get filled.","commenter_a":"And how did they get so strong in Iraq while you are president?.....exactly","post_message":"President Barack Obama said Islamic State had lost about 40% of the populated areas it once controlled in Iraq. “And it will lose more,” he said."},{"comment_id":"642456822585523","commenter_b":"ong! snd the PC powers that be will make a laughing-stock yet again of America & our Right to defend Our Laws!!!","commenter_a":"You get detained or arrested for saying the word \"bomb\" in an airport and this turd gets away with this? If it were a white boy, we'd never hear the end of it.","post_message":"JUST IN..."}]
