[{"comment_id":"10153949050391037","commenter_b":"One word: uneducated","commenter_a":"Trump has had my vote from the start to finish ... Nothing anyone says can \" change \" my mind .... We need a business person in the seat to lead not be a tyrant.","post_message":"“During anxious times, it can be tempting to follow the siren call of the angriest voices. We must resist that temptation,\" Nikki Haley said."},{"comment_id":"10154413353871519","commenter_b":"Nope. Good luck, though!","commenter_a":"They better NOT. You will get the same help you gave President Obama, 0. Now, GTFOH","post_message":"This is an offer they are not likely to take him up on."},{"comment_id":"10153534266495399","commenter_b":"We don't need him and take little Mexico with you","commenter_a":"And he's supposed to be the \"smart\" one?","post_message":"Asked to clarify, Jeb said, \"Things happen all the time. Things. Is that better?\""},{"comment_id":"10153009294016680","commenter_b":"Why doesn't he run for Lt. Governor and Dog Catcher, while he's at it! 😡","commenter_a":"Who says money can't buy you elections - er, I mean, caucuses. Now he can continue to get paid for doing a job he won't be doing while he is attempting to further his political ambitions.","post_message":"Rand Paul is closer to getting his way. | AP Photo @webpagelink"},{"comment_id":"10153687651936509","commenter_b":"Dont worry everyone...Jane cant be taken serious. She is a white liberal woman. We all know they are idiots.","commenter_a":"A black man said this...\"Over The Memorial Day weekend. Over 56 people shot in Chicago, 28 shot 9 dead in Baltimore, & the bizarre thing is; They want you to know the 'Police' are the problem in their communities. And I guarantee you they ALLLLLLL called \"911\" asking the \"Police\" for help & assistance when these shootings took place (go figure). A Fool will never recognize his own foolishness.\"- Johnathan Gentry.","post_message":"An outbreak of Memorial Day weekend violence left nine people dead in 29 shootings, according to police and CNN affiliates. What's behind these deaths? @webpagelink"},{"comment_id":"418033801654548","commenter_b":"The woman deserves to burn in hell for eternity.","commenter_a":"Zeeeeerooooooooooooooooooo!","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"},{"comment_id":"1315430658535467","commenter_b":"Hell yes! Build your wall and Get Over It!","commenter_a":"Could you guys please move on from this and actually report news.","post_message":"He's the \"Hamilton\" actor who gave a holier-than-thou speech to Vice President-elect Mike Pence at a performance of the play in New York City last week. Now, sick tweets have emerged that show the kind of person that Brandon V. Dixon REALLY is, and it's definitely not the kind of thing he wanted out there..."}]
