[{"comment_id":"10153573918196746","commenter_b":"Danny..she can speak for herself..thank u","commenter_a":"He speaks the truth...","post_message":"\"We've been looking at it (race) the same way for 20 years and here's where we are. We both have to try and understand each other,\" said former New York City Mayor Rudy Giuliani on Face the Nation."},{"comment_id":"10154608447428690","commenter_b":"@username - Did I hurt your feelings? While you're defending her she's planning on how she'll enjoy all her wealth somewhere in the world while you'll be paying taxes up the wonker. It's called Sod's law.","commenter_a":"She is every color on the a--hole rainbow.","post_message":"\"I am innocent, I am an honest person and I have never committed a crime.\" @webpagelink"},{"comment_id":"10154182389496337","commenter_b":"I would totally argue your point...but I have a rule about never arguing with beautiful girls!","commenter_a":"How is that a surprise? He's the most amazing character of all time! The little man casts a very big shadow.","post_message":"THE REAL \"MAIN CHARACTER\" ON Game of Thrones might surprise you..."},{"comment_id":"10153253849621955","commenter_b":"Poor rich spoiled brat she thinks she's and her stupid husband ruthless she no First Lady you wouldn't see Jackie Kennedy acting like her.","commenter_a":"WTF.","post_message":"MICHELLE OBAMA: Emotional toll of being a black first lady..."},{"comment_id":"1840578192829386","commenter_b":"WORDS DON'T CHANGE THE FACT! TRUMP IS YOUR PRESIDENT! LEAVE THE USA!","commenter_a":"Keep trying thumb suckers","post_message":"ALERT...."},{"comment_id":"10157319779090093","commenter_b":"That's because she likes women better!","commenter_a":"Loving wife, he'd boink anyone in a skirt except Hillary!!!","post_message":"\"The biggest problem is that the more he talked the weirder it was that he didn address the elephant(s) in the room.\""},{"comment_id":"10153746378278984","commenter_b":"A bitch with a hitch............","commenter_a":"Obviously above the law! I guess if you are part of the liberal click you are above the law! Hillary Clinton, Bill Clinton, Obama and all the rest apparently don't have to obey the law like everyone else","post_message":"James O'Keefe's undercover videos strike again. This time exposing Hillary's campaign ignoring and knowingly violating this state's laws - and laughing about it. You will be blown away by what some of Clinton's staffer say is the campaign’s motto. Everyone needs to see this.  Do you think Hillary Clinton would be the worst thing to happen to the U.S. if elected?"}]
