[{"comment_id":"551295498386832","commenter_b":"Hillary is crooked af it's the perfect excuse.. Get a life.","commenter_a":"Love you Bernie but I can't support your endorsement. I know you'll continue to do what you can from your position and if given the opportunity to support you I will do so. But it looks like I will have to change my vote to Trump this year. I will not support Hillary under any circumstances.","post_message":"Thank you, Bernie Sanders. Proud to fight alongside you."},{"comment_id":"10156005617690725","commenter_b":"Loved Trump's speech!","commenter_a":"What's your thoughts on the confederate flag or the MS state flag, Mr Trump?","post_message":"#MakeAmericaGreatAgain #TrumpRallyAL"},{"comment_id":"10153919484005950","commenter_b":"I'm not copying, I'm telling the truth. You also look like a witch. It's catching.","commenter_a":"Angelina ruined him once, now she's trying again. She should have kept her man eater claws out if his first \"real\" marriage. I swear, I think she's a dark witch, casting dark spells.","post_message":"The LAPD released a statement to Entertainment Tonight to clear up reports that they were investigating Brad Pitt for allegedly being physically and verbally abusive with one of his children."},{"comment_id":"10154131351242232","commenter_b":"She doesn't stand a chance against Trump","commenter_a":"Well we are screwed","post_message":"#Breaking. Hillary Clinton has won the Pennsylvania Primary and is about to take the stage. @webpagelink"},{"comment_id":"876682692378359","commenter_b":"These two women obviously don't know the plan and purpose of marriage.","commenter_a":"STOP have n sex if u dont want children. Once the child is made its alive. Not when it takes the first breath. Ppl are so selfish these days","post_message":"Do you?"},{"comment_id":"1525170294448172","commenter_b":"DECLASSIFIED PROPHECIES AND VISIONS : A GREAT EARTH QUAKE IS ABOUT TO HAPPEN . A MILLION AMERICANS WILL DIE , AND OVER A HUNDRED AND TWENTY MILLION PEOPLE WORLD WIDE . THE UNHOLY AND GAY PUSHING OBAMAS MUST LEAVE THE WHITE HOUSE NOW . GOD CANNOT BE MOCKED . USA WILL BE GREATLY DESTROYED BY ASTEROIDS , EARTH QUAKES AND NUCLEAR STRIKES BY 2047 . PREVIOUS PROPHECIES THAT CAME TO PASS INCLUDE 911 , RUSSIA ASTEROIDS, JAPAN TSUNAMI , HURRICANE SANDY ( INFORMED WISH TV TWO WEEKS BEFORE IT HAPPENED ), PHILLIPINES TYPHOON , TERROR ATTACKS ETC . THESE ARE THE END OF DAYS - THE ANOINTED PROPHET z( I WAS SENT BY GOD)","commenter_a":"That would be the best dinner ever. How can I get invited!!??","post_message":"President Obama will deliver a lavish welcome to Canada's new Prime Minister Justin Trudeau at the first state dinner of 2016"},{"comment_id":"1186000464791726","commenter_b":"Rest in peace sir. #endofwatch","commenter_a":"R.I.P.","post_message":"RIP OFFICER PATRICK ZAMARRIPA: Hundreds have lined the highways along the route where DPD Police Officer Patrick Zamarripa's body is being driven to its final resting place."}]
