[{"comment_id":"1056498011103708","commenter_b":"Build a wall and if they want to come into England charge them 1000 pound per day to enter","commenter_a":"If Westminster ? allows a second Scottish referendum then fine but along with there departure goes the and our submarine base etc you can't have your cake and eat it. ?","post_message":"The UK is crumbling"},{"comment_id":"501575200039916","commenter_b":"WANTS TO KEEP AMERICANS STAGNANT, MOVING BACKWARDS AND PAY HIGHER TAXES TO SUPPORT IMMIGRANTS COMING OVER OUR BORDERS FROM ISIS COUNTRIES TO PUT AMERICANS IN GREAT DANGER, WANTS TO KEEP MINORITIES IN DEMOCRATIC OPPRESSION, POVERTY, JAIL, AND HIGH CRIME, NO FUTURE, WELL WHY NOT VOTE FOR HILARY CLINTON.","commenter_a":"Yes","post_message":"Question of the Day: Should the media be giving Tim Kaine's past comments about President Bill Clinton more attention? Share your thoughts below."},{"comment_id":"10153490575133854","commenter_b":"Can some one just shut her up for a year or two ? Talk about a bullshiter.","commenter_a":"Take the guns from her handlers!","post_message":"Hillary Clinton Denounces White Privilege, Calls for Taking Guns From ‘Those Whose Hearts Are Filled With Hate’"},{"comment_id":"10154555374851337","commenter_b":"She's a big mouthy bitch lol","commenter_a":"Angie Hoekema","post_message":"WATCH Nancy Grace argue that Brendan Dassey's conviction shouldn't have been overturned..."},{"comment_id":"10153130429581162","commenter_b":"If prostitution ever becomes legal, you can sign your kids up freak.","commenter_a":"Making prostitution illegal is as stupid as pot being illegal. Regulate, tax and monitor.","post_message":"NEW: NFL Hall of Fame lineman Warren Sapp arrested for allegedly hiring a prostitute after covering the Super Bowl for the NFL Network: @webpagelink"},{"comment_id":"364315750438606","commenter_b":"Orrrrrrrrrrrrrrrr, build a big wall around it and let in any idiot who wants to live like an animal.","commenter_a":"Solution for Baltimore. Dismantle the police department and incorporate law enforcement into the Department of Social Services. Terminate all police officers. Fund the law inforcement portion of social services with Federal dollars. Social Services pay gang members $100,000 plus benefits and pension to each gang member, no identification or proof of residence required. Pay each adult $500,000 for new housing or relocation. No identification or proof of residence required. No follow up for use of housing fund. Encourage business owners to allow no cost to their merchandise (free) .","post_message":"Democrat Candidate for Senate in Maryland Blames Republican Governor for Baltimore Education Problems"},{"comment_id":"10154970022528690","commenter_b":"The world and so call United Nation have no interest in alepo people just because they are muslim, if its christian region this is happening the UN will have take action, but we the muslims are just folding our arm doing nothing, the only thing is to back to Allah, by saying; HASBUNALLAHU WANI'IMAL WAKIL, WANI'IMAL MAULA WANI'IMAL WAKIL,","commenter_a":"there is tubelight, internet, electricity bla bla. it seemed she is speaking from hotel pan pacific Singapore. we didn't heard even a sound of bullet fired. weird.","post_message":"Residents of East Aleppo are giving their final messages to the world."}]
