[{"comment_id":"10155779626265725","commenter_b":"@username here @webpagelink","commenter_a":"It's Sad How there's many Mexican's in these comments saying they will vote for Donald Trump. Maybe because some of you don't know the struggle of coming to the United States & been judge just because we want a better life. Donald Trump NOT FOR PRESIDENT. smh","post_message":"Jorge Ramos- Please send me your new number, your old one’s not working. Sincerely, Donald J. Trump"},{"comment_id":"583491245168645","commenter_b":"Yup @username, same old Hillary, will say Anything. Flippity Flopping as usual.","commenter_a":"Well Hillary Wallstreet Clinton, your group phot does Not contain any Important popular opinions!! Now on to a question for you. If Nothing to hide regarding your emails, why would you destroy evidence after a Subpoena? Why did You lie to Congress and the FBI? Why did your aides plead the 5th? Why did some of your aides receive Immunity? Why did you recently Under Oath answer 21 questions with,(I Don't Recall ), and other questions with,( I Object) ? These Issues are VERY CONCERNING, and you're Ignoring these!!","post_message":"Nobody knows better than these five people what it means to be president—and not a single one of them believes Donald Trump has what it takes to do the job."},{"comment_id":"857891860915718","commenter_b":"They need more time to assimilate into our culture,not us to theirs...This is America...illegals should not have a louder voice than our country's citizen,or if they are here legally they need to learn the laws of our land and quit trying to change the American way or American dream to suit their expectations.","commenter_a":"I recommend going back to a country where freedom of speech is not something you have to concern yourself with. Otherwise, deal with it. Freedom of speech means you don't get to dictate consequences just because you don't like it...","post_message":"What do you think about this?"},{"comment_id":"681700478660950","commenter_b":"My life","commenter_a":"@username you","post_message":""},{"comment_id":"947408295386760","commenter_b":"Jill has sexy legs","commenter_a":"Commies","post_message":"\"For my brothers and sisters that supported Dear Brother Bernie Sanders - this is the next step. This is the Green step. It is the progressive step. It is to stay on the love train. Justice is what love looks like.\" -Dr. Cornel West"},{"comment_id":"10154132687525579","commenter_b":"I SWEAR, THE MEN IN THIS COUNTRY ARE SUCH PANSIES NOWADAYS.","commenter_a":"No matter the numbers, you won, Bernie! America will not be the same because of your tenacity, integrity, and values! Thank you!!! We'll keep fighting. #NotMeUs If you like this comment, please contribute to Sanders's campaign at the below-posted link. @webpagelink","post_message":"Bernie Sanders: \"Tonight, while the results are still not known, it looks like we are in a virtual tie.\" Full video here: @webpagelink #IAcaucus #IowaToday"},{"comment_id":"614399705409669","commenter_b":"@username NO ONE IS AS CORRUPT AS SLICK WILLY & SLICK HILLY!","commenter_a":"If Trump has done anything he has brought attention to the corruption in government!! Old man Bush cannot stand that Baby Jeb was soiling his diaper on the debate stage....it's all about $$$$ & the fact that the Clintons charged $250,000 for their fundraiser the other night should make hard working taxpayers sick!","post_message":"Kathleen Kennedy Townsend says former Republican President George H.W. Bush told her he's voting for Hillary Clinton."}]
