[{"comment_id":"1569991603060963","commenter_b":"Oprah is a piece of shit.","commenter_a":"Ignorant celebrity","post_message":"It's all about the win for 'your side'."},{"comment_id":"10154577788564726","commenter_b":"New York should have voted smarter.","commenter_a":"They are so crazy. Now I start feeling sorry for them.","post_message":"He's taking a queue from Obama's playbook..."},{"comment_id":"10153328235374087","commenter_b":"Common ground to Ryan means all his way.","commenter_a":"Ass hole. One of the boys","post_message":"“You know, we have two ears and one mouth,” Paul Ryan said. “We got to use those in that proportion.”"},{"comment_id":"10155578716975354","commenter_b":"Wouldn't it be nice if if \"christians\" practiced what they preach?","commenter_a":"Good on him, but you know he's gonna die soon.","post_message":"“I think this is the first time in history a leading Middle Eastern religious leader has embraced the forms of popular culture to advance the Christian message of love and hope,” WATCH THE VIDEO"},{"comment_id":"861355680627352","commenter_b":"ronan need to go, and joy should replace REV AL at 5pm cst is very very hard to watch his show!!!!!","commenter_a":"did someone from fox come over and take over in charge of show selection as I am with the others why keep Scarborough who belongs over on fox and let these two go....way to lose viewership","post_message":"Ronan Farrow reveals the answer to a big question ... almost."},{"comment_id":"1067594940000226","commenter_b":"#DumpTrump","commenter_a":"The ultra right wing justices that have been appointed to the court over the past 5 decades have done more harm then all the republican obstructionism. Obama needs to fill the seat ASAP with someone who will defend Roe v Wade, and keep the EPA on track to clean up our air and water for once and for all.","post_message":"Republican hypocrisy in a nutshell... Thanks to Democratic Underground."},{"comment_id":"1811838059034995","commenter_b":"And her answer is I don't have an answer for you. Really because you know the answer already bitch","commenter_a":"Love this guy. So to the point it's pathetic. And I can't answer anything.","post_message":"Trey Gowdy utterly DESTROYS this liberal...."}]
