[{"comment_id":"10153230146462439","commenter_b":"Why do you say that?","commenter_a":"The use of the Neutron Bomb comes closer.....","post_message":"Iran is the world’s leading state sponsor of terrorism. Hizb’Allah is its client in Lebanon. Hussein Obama has apparently joined the axis of evil…and that will be his legacy. “Iran is placing guided warheads on Hezbollah rockets,'” by Yaakov Lappin, …"},{"comment_id":"10153612165593984","commenter_b":"My, my, my....Welcome Home....but, don't ever come back!!!!","commenter_a":"Way to go kenya","post_message":"Wow. These 10 million Kenyans just sent Obama a VERY bold statement about his visit... they aren't pulling any punches.  Obama needs to pay attention to this...  Good for Kenya..."},{"comment_id":"1252390358183610","commenter_b":"He needs to be removed from office before he does something to endanger us all He is mentally unstable","commenter_a":"Why can't trump voters see this? The guy is mentally ill big time. All I ever hear is, he said he would create jobs! So let's put us all in harms way for the 'possibility of a few jobs.' Just plain nuts! He's not going to create any jobs and if he does it's by being unlawful. 😡","post_message":"This explains a lot..."},{"comment_id":"1544982162188475","commenter_b":"That's why I have your wife come over","commenter_a":"Yeah it changes kids it doesn't make them limp wristed liberals who don't know which gender they are . It makes them tuff , learn how to solve problems with others and gives them confidence!","post_message":"The more head blows a child sustained, the more changes were seen in their brain tissue, according to the study released Monday."},{"comment_id":"10153617541751770","commenter_b":"As Hillary would reply, 'What difference does it make now? I've WON! Sadly, has she?","commenter_a":"You have no anything to go on except you love to hear your lips flap self righteousness find some proof not just the dolts you hang with","post_message":"Dana Perino destroyed Hillary Clinton in an epic rant over her use of a private email server..."},{"comment_id":"10154017323271350","commenter_b":"sweet potato! :)","commenter_a":"Teri","post_message":"Once you start spiralizing life will never be the same!"},{"comment_id":"10152755752215950","commenter_b":"White kids who grow in the same exact environment would most likely participate in these activities, just like black kids who grow up in the same environment as snotty white kids will most likely also be snotty kids. We're all a reflection of our environments, we do as we see we do as we are taught!","commenter_a":"This is a social problem not a race issue..","post_message":"Police say a large group of high school students swarmed a gas station and beat a man who was reportedly helping an older woman to her car."}]
