[{"comment_id":"10153397291788984","commenter_b":"Couldn't agree more.","commenter_a":"Great message...lousy article.","post_message":"Famous actor Matthew McConaughey just spoke at a graduation, and he had a very blunt message for whiny college kids...  What he said is going viral... and it couldn't be any more perfect."},{"comment_id":"10153611499316955","commenter_b":"Dumb broad should have to eat it herself before feeding the garbage to our kids.","commenter_a":"Good! If you eat what she eats you might end up looking like her!!!!!","post_message":"Students celebrate as school drops Michelle O lunch rules..."},{"comment_id":"902035299831892","commenter_b":"Then don't eat the Damn thing, leave now.","commenter_a":"im so sick of people trying to make racism out of nothing u people r pathetic","post_message":"What do you think? Is this food racist?"},{"comment_id":"10157928279665500","commenter_b":"Why did they have babies to begin with? People like them have no business having babies - period. Don't believe in birth control - don't have sex.","commenter_a":"This makes me sick! The parents don't look like they missed any meals! Lock them up and throw away the key!","post_message":"The nurse also told police there were feces in one of the child ears and that the child looked  a skeleton. @webpagelink"},{"comment_id":"10156981662980603","commenter_b":"She's a stripper, no joke.","commenter_a":"Obviously this woman is so used to wear no or very little clothes that she sees nothing wrong with that \"outfit\" she wore.","post_message":"Do you think her shorts were inappropriate?   A. Yes B. No C. I don't know"},{"comment_id":"10153938743204087","commenter_b":"Karma is a Bitch!!! #NEVERHILLARY #STILLSANDERS #JILLNOTSHILL. #DEMEXIT","commenter_a":"And Bernie wants us to support her boss Hillary.","post_message":"DNC chairwoman Debbie Wasserman Schultz referred to Bernie Sanders' campaign manager as \"scummy\" and a \"damn liar\" in a leaked email published on Friday by Wikileaks."},{"comment_id":"10154146599832541","commenter_b":"Can we deport you? Bigots not needed in America.","commenter_a":"Aren't Obama's illegal immigrant aunt and uncle still here? They should be top priority for deportation.","post_message":"Joel LaPierre will have to keep his racist thoughts to himself from now on."}]
