[{"comment_id":"937487649627809","commenter_b":"NO, NO, NO. Why is there even a question about this. Too many illegals in this country already. Do you want more?????","commenter_a":"Everytime I think I hear the dumbest thing ever, something else trumps it. I cant believe how unpatriotic some folks are now days. America is for Americans. Become an American and then you can vote. No intelegent group would ever let an outsider make a decision for them. It doesent make sense.","post_message":"More than 1 in 3 Americans believes illegal aliens should have the right to vote in U.S. elections, a figure buoyed by the majority of Democratic voters who favor the idea. @webpagelink"},{"comment_id":"10155176603990389","commenter_b":"Don't know of anyone who did. Won by fraud.","commenter_a":"I didn't vote for this useless President!!!","post_message":"ICYMI: Republicans cheered as President Barack Obama said “I have no more campaigns to run.” Obama, cracked a smile and responded: “I know because I won both of them.”"},{"comment_id":"545764515614128","commenter_b":"Is she that dense ??","commenter_a":"If she was subjected to shariah law, she sold wished it never happen. Major mistreatment of women","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way.  What a disgrace. She needs to deported to the Middle East.  Do you think Nicole Kidman is a sell out?"},{"comment_id":"1303084943055048","commenter_b":"And I would make the vandal pay for it too!","commenter_a":"Looks better like this.","post_message":"Donald J. Trump just got hacked."},{"comment_id":"10156047259680231","commenter_b":"Kayne and Wiz are dirty whores!","commenter_a":"How you gonna forgive someone for you being a hoe? js","post_message":"Rose broke down in tears while talking about her exes during the SlutWalk she organized."},{"comment_id":"718075635009295","commenter_b":"Mrs Trump has nice Tits too lol","commenter_a":"Mrs. Trump, what an elegant peaceful person, a very classy confident individual...reminds me of Nancy Reagan!!!","post_message":"Michelle Obama will be remembered as the most vile and arrogant First Lady in US history!!! Let's get 4,000 SHARES to support our NEW First Lady Melania TRUMP!"},{"comment_id":"10153533239272464","commenter_b":"Dream Team? Cruz/Fiorina Gowdy - AG Carson - Sec HHS West - SecDef Rubio - Sen Maj Leader Issa - House Maj Leader","commenter_a":"Protestant Christian liberty to be exact!","post_message":"We’re a nation that was founded on religious liberty.  Stand with us to defend it: @webpagelink"}]
