[{"comment_id":"10154357788051509","commenter_b":"Escape to Germany or Sweden for safety?! Really?! Do not keep up with the news? Germany and Sweden have been taken over by the same Isis loving Muslims that killed this woman! There is no safe place for Arabic women to go to as long as Arabic men are around.","commenter_a":"There goes a girl who did not leave her country to reach Germany or Sweden for safety and fought as best as she could...she got executed for her tweets about life in Raqqa... Now you know what refugees who are labelled as \"cowards\" \"parasites\" \"are escaping from.","post_message":"She wrote about life under ISIS rule with humor, sadness and a glint of hope."},{"comment_id":"10154375945924749","commenter_b":"The man is a afgan veteran , a marine and a Muslim. I am a Hindu and I know , Imran name does not exist in us.","commenter_a":"Two Muslim brought up in America one killed 50 and the other saved over seventy, both are Muslim , it is not Islam, it is the illness inside each of us.","post_message":"Imran Yousuf decided to “take a chance” and it paid off."},{"comment_id":"10156690146685231","commenter_b":"You beating her implies you didn't educated her about her role in society or her worth. Beating her is so drastic & dramatic. Talking & educating her would be much more powerful.","commenter_a":"If that girl were mine I'd slap her into next week but then again no child of mine would refer to herself as meat or be that cheap","post_message":"A high school boy asked a girl to prom with a sign that said, 'I prefer dark meat. Prom?'.... There's some things wrong here."},{"comment_id":"1003873189632434","commenter_b":"When you take into account what these 2 young men did taking beer from a grocery store well there's going to be consequences plus swinging a skate board well the Police have to do something...I wish I were standing holding a sign I Support the Police Department !!","commenter_a":"I hate to say this but the store video does not lie. Now hopefully they'll release the bodycam video too. Now would be a great time to prove just how successful those are.","post_message":"The Olympia police officer who shot two men last week has given his account of what happened to investigators, and the department isn't releasing information.   More than 100 people packed city hall tonight demanding immediate changes in police accountability >> @webpagelink"},{"comment_id":"1084762064867436","commenter_b":"Get your head out of your but she , started this joke !! May be you should pay for her education","commenter_a":"Looks like Fox found the dumbest person possible to ask questions to lol. Love how you're all thumping your chests cause Cavuto outwitted some dumb college girl.","post_message":""},{"comment_id":"1857903094453796","commenter_b":"@username AND U DON'T YOURSELF.","commenter_a":"Please leave MLK's son alone. Focus black people, stop criticizing on something or someone you know nothing about or the reason behind it. You do you. Keep out of everyone else's business! We're black/African Americans but we're individuals.","post_message":"He went off on the Civil Rights icon's son."},{"comment_id":"1008727995814878","commenter_b":"Wolves are twice the size of a coyote.","commenter_a":"I bet the majority of you couldn't spot the difference between between a coyote and a wolf either.","post_message":":("}]
