[{"comment_id":"916567641696749","commenter_b":"Book should have been titled; Chicken Shit in the Mango Tree. Married 31 years raised by a mother 2X divorced and once widowed. The families do not get over these Selfish POOR ME decisions. Families are for life.","commenter_a":"Why don't you profile some of the people who have not just dumped their inconvenient families? Let's see a profile of couples who have been bored, or \"grown apart\" and worked at their marriages instead of taking the easy and selfish way out. This guy \"gained so much more\" because he cared only about himself.","post_message":"\"I thought 'I have to do this ... it will be horrible for all the people I love most in life. But I have to do it.\""},{"comment_id":"10153484658844060","commenter_b":"Let me clue you in on something: just saying \"I won, you lost\" doesn't make it so. In the adult world, you must present logic, facts and empirical evidence, which I did. Which enables me to say \"I win, you lose.\" It's ludicrous to even debate about how badly CA has done over the past 20 years due to liberal socialist policies. They're more in debt than most third world countries. Jobs and people are fleeing the state and illegal immigrants are destroying CA. I'd no more debate this than 2 +2 = 5. In summary, you're not only a loser but a leftist idiot. Ciao stronzo.","commenter_a":"America is the same. Some strong states like CA and some very weak states like SD.","post_message":"This week's KAL's cartoon @webpagelink"},{"comment_id":"1783407658566153","commenter_b":"Bitch!!! the only ones not giving up their power are You, Hillary, and Obama!! You need to give it up!! You lost!","commenter_a":"\"The biggest way we give up our power is by not knowing we have it to start with.\" --Alice Walker (paraphrased)","post_message":"This week's fireside chat is a call to action. Trump and his allies are trying to block the democratic process and our right to a vote we can trust.  If you are near New York City, join us at Trump Tower on Monday morning at 10 AM to stand up for democracy."},{"comment_id":"370042553184039","commenter_b":"marriage was not meant to be a shitty relationship depends have a market I would like to invest","commenter_a":"evolution and same sex cannot coexist","post_message":"POLL: God's design for marriage? (man and woman)"},{"comment_id":"1369597926402497","commenter_b":"Vote for Ohillary then...you deserve her","commenter_a":"Republicans have been telling trump supporters for months they wouldn't vote for trump. Now trumpsters are acting like it's a surprise. Well...surprise. #NeverTrump","post_message":"Sorry, Rick Scott."},{"comment_id":"10153800001886336","commenter_b":"OK all immigrants should loose there language and culture. Derp","commenter_a":"Gop crybabys don't ask me questions the Fox news debate asked basically the same questions does Reince Priebus realize that was the only gop debate to be simulcast on a Spanish network effectively telling Spanish Americans we don't care about you","post_message":"Reince Priebus  told Fox News that aside from making sure “CNBC isn’t hosting and moderating another debate with our candidates,” the Republican Party is going to review “everything” about the debates. @webpagelink"},{"comment_id":"10153622480508690","commenter_b":"Nna, infact you get am","commenter_a":"And this is not a problem at all to the world peace, unless when Israel bombs Hamas terrorists, then it will be a problem for the world peace. Hehehehehehehehe One good thing people should learn is that Muslims from the unset, have always wanted to dominate. Whether Muslims like it or not, Israel of today will never succumb to them again. If Israel is the problem of the world, then Palestinians should try and leave the land of Israel and let's see whom Israel will kill again. Thousands are dying in Syria, Yemen and Iraq, yet it's not a problem to the world peace. Tell that to the birds. Never ever succumb to the demands of any Muslim community, if u give them one today, tomorrow they will demand for 3. Always push them back or they will over run u. This is why i pity Europe,maybe they are not ...","post_message":"Syrian government has conducted nearly 7,000 air strikes during the month of July, according to the Syrian Observatory for Human Rights, making it the most intense bombing reported in one month since the beginning of the conflict in 2011. @webpagelink"}]
