[{"comment_id":"1293464810706279","commenter_b":"Foolish talk from a foolish woman","commenter_a":"Try retraining the dumb crooks and thugs!","post_message":"@webpagelink"},{"comment_id":"10154958123446037","commenter_b":"Go away troll 🤣🤣🤣🤣🤣","commenter_a":"Why should the taxes I pay be used to pay for security for a billionaire that pays no taxes?","post_message":"“New York City taxpayers should not be on the hook for 80 percent of the national bill to protect [Donald J. Trump] and his family’s residence.\""},{"comment_id":"1595363807421142","commenter_b":"Hilary is a huge bitch","commenter_a":"Yes.///","post_message":"Hillary Clinton said today that Donald Trump's erratic temperament and lack of experience make him unfit to be president. Is she right?"},{"comment_id":"10153030925550927","commenter_b":"She'll starve.","commenter_a":"Go back to sex worker ... Your jokes are not funny ....","post_message":"Comedian Margaret Cho admits she was once a \"sex worker,\" says \"There's no shame in it. ...\" But she didn't stop there!"},{"comment_id":"442764485911159","commenter_b":"In other words: Problems caused by Democrat policies expected to be solved by Democrat solutions. Great speech, but totally misses that it was HER party that did most of this. KKK, democrat. Vehemently-anti-civil-rights legislation, democrat. Creation of Freddie/Fannie and housing bubble, democrat. Champion of illegal immigrants driving down many black inner city wages, democrat. Cities with most black-on-black crime and deaths, mayors are...you guessed it....years of democrats. Great points, but I really wish people would figure out who REALLY is the Iago to Othello. (hint: he's a democrat)","commenter_a":"Warren! Warren! Warren!","post_message":"Elizabeth Warren explains why \"it is important to cause necessary trouble.\""},{"comment_id":"10153498381391523","commenter_b":"Someone needs to throw this evil bitch out of a car. The same way she did to these innocent pups.","commenter_a":"Awe poor baby","post_message":"A woman let three dogs out of her vehicle and sped off on Farmlane Drive in Slinger -- with the dogs chasing after her. Now, police are searching for answers. Please spread the word."},{"comment_id":"10155033056251350","commenter_b":"you alice are the lame one.... bet u r fun at parties....not!","commenter_a":"how can americans put the flynn event in context. flinn's entry into the trump power structure was vigorously opposed from the beginning: one might even consider his a marked man. part 2: media has propogated trump's comments on intelligence agencies extensively. so one could ask the question how does the leak on flynn occur in the first place: NSA surveillance or other. it would appear a US intelligence agency leaked to the anti trump news media:))) could one consider that a direct attack on this nation to influence American government: yes. trump must drain the swamp in the intelligence community now. the entire establishment apparatus that supported the status quo is now actively working against change middle class voted for: start the purge. there is an outlier that must be considered: Israel. trump is surrounded by Israel firsters. was flynn one of those or was he an American firster. did ...","post_message":"On this Valentine Day, watch George H.W. and Barbara Bush share their touching love letters on TODAY in 2011 (and try not to cry!) @webpagelink"}]
