[{"comment_id":"10152778407223445","commenter_b":"No argument, no facts, just a loud mouth bitch thinking she's right bc of some stupid ass parents. She keeps saying free access, bitch it's already accessible, just gotta know who to call. 2chainz wins this conversation piece every time.","commenter_a":"Idiot-ass","post_message":"UPDATED: Nancy Grace admits defeat in #pot debate with 2 Chainz?: @webpagelink"},{"comment_id":"1120997057921304","commenter_b":"In my way to get wine lol!!!!!!","commenter_a":"Bad science!","post_message":""},{"comment_id":"745372418902804","commenter_b":"Throw the Illegals out. Send them all to Germany and have Merkel deal with them!","commenter_a":"Why the smirks???? Like saying I know something you don't know.","post_message":"Austrian police says 6,500 people crossed into the country on Saturday, with the number predicted to rise to 10,000; most en route to Germany"},{"comment_id":"10153552343052452","commenter_b":"What a shitbag","commenter_a":"These people have no shame... very sad..","post_message":"An Alhambra homeowner caught a package thief in the act and recorded the woman as she tried to swipe two boxes from his porch. Police are now searching for the culprit. abc7.la/1Wt5Auf"},{"comment_id":"456764181180829","commenter_b":"Looking at that ugly bitch may stop people from going to McDonald's","commenter_a":"Ooh i just lost my appetite. Why would McDonalds allow this. She is so BSD about anything dealing with food and nutrition","post_message":"Would You Refuse To Eat An 'Obama' Burger? Comment 'yes' or 'no'."},{"comment_id":"1105833282843058","commenter_b":"@username, or not the MAJORITY ., not even close.. also if your so worried about illegals taking jobs, tell like Trump to stop breaking the law, by hiring them.","commenter_a":"NO, Obama has NOT divided America, You Mr. Trump are responsible for dividing our Country & bringing out the UGLY in everybody!!!","post_message":"If anyone is dividing America, it's Trump. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"835612693201651","commenter_b":"HE IS LOOKING FOR MORE FREE REPUBLICAN MONEY !","commenter_a":"These people have to keep up the lie..because if you do your research. .then you will come to one and only one conclusion. .These people have no claim to the land..they were put there in 1948...but their blood line does not trace back to Abraham a hebrew..don't take my word for it do the research. .information is out there!!!!","post_message":"\"I will go anywhere I am invited to make the State of Israel’s case and defend its future and existence.” -Israeli Prime Minister Benjamin Netanyahu"}]
