[{"comment_id":"10155997067345354","commenter_b":"Hopefully, Palin and her Carnival Midway Freaks family will return to obscurity soon. Surely she's spent all the money she collected for running for political office by now.","commenter_a":"China is killing us just like Donald Trump said, and our country's leaders do act like that are stupid who are only interested in staying in their cushy jobs in Washington DC, and who keep lying to the American people about race, gender. And all the other social things that will distract the American people from really noticing that your country's Government is crashing our country's economy. And that the media is playing hand and glove along with the Washington DC establishment of both political Parties. Because the media likes their cushy jobs also, and really don't want to change how our country is run, for no reason. So we the American people Ladies and Gentlemen were always on our own and we just never realized how bad these guys were, and simply trusted in the wrong people. Who would believe that all three branches of our country Government Institutions ...","post_message":"“It is such a sham business. This BS of them touting all the medical services they provide women and the free healthcare–They don’t provide all these services.\""},{"comment_id":"10153082765311955","commenter_b":"Are you bitches inbred or just drank the kool-aid? ?","commenter_a":"Fucking baphomet bullshit EVERYWHERE 😡","post_message":"MADONNA FALLS HARD"},{"comment_id":"574527652737499","commenter_b":"Give them LIBTARD TREATS!!!","commenter_a":"Losses😠😠😠😠😠😠😠","post_message":"Live: Protesters are marching in Washington D.C."},{"comment_id":"510537979128082","commenter_b":"Hahahaha when she bends you over will see your complex","commenter_a":"Liar liar pants on fire burn in hell","post_message":"Join us in wishing Hillary Clinton a very Happy Birthday!"},{"comment_id":"10154534424443984","commenter_b":"If these Punks hates us and hates the American Flag , why ????? Do you live here I'm sure if we came over your home place we would be killed","commenter_a":"I agree. If America is so bad for these buttheads, get the heck out of our Country!!! Second, if any of these a-holes are getting assistance from our Federal Government (alias all of us), STOP THAT SUPPORT NOW AND FOREVER!!! The people who fought and died for that Flag to fly is the reason these a-holes can be protesting in the first place. I would put them on a plane like the other person said, but instead of flying to ISIS country, I would just drop them out over the middle of the Atlantic and see how well they swim. Hopefully they will swim in the other direction from our Country!","post_message":"The protesters in Cleveland thought they could get away with burning an American flag in the streets... but they never expected who was coming right for them.  This is America, punks... don't mess with Old Glory."},{"comment_id":"10154800367722293","commenter_b":"@username Human rights should always supersede law otherwise we are no better than the Muslim extremists we criticize so much (for good reason). Yes, we need to have strict immigration laws but due to our decades of non-existence of it due to the fact that we can profit from it, people shouldn't be punished and exceptions to the rule would exist. There are undocumented people who have been here all their lives, kids who know no other home than here and good tax paying people. Criminals - yes get them out. Instead of a wall use technology and more man power at the border. Create temporary work visa give. By employer, families who are working and are not a burden to the system can stay. There are better ways.","commenter_a":"\"let us all unite. Let us fight for a new world - a decent world that will give men a chance to work - that will give youth a future and old age a security. By the promise of these things, brutes have risen to power. But they lie! They do not fulfill that promise. They never will! Dictators free themselves but they enslave the people! Now let us fight to fulfill that promise! Let us fight to free the world - to do away with national barriers - to do away with greed, with hate and intolerance. Let us fight for a world of reason, a world where science and progress will lead to all men happiness. Soldiers! in the name of democracy, let us all unite!\" - Charlie Chaplin, \"The Great Dictator\" (1940).","post_message":"Trump vow of mass deportations could soon become a reality."},{"comment_id":"1659698577423598","commenter_b":"she is just cheap fat trash...who cares?","commenter_a":"Get off whatever you are on Mariah!","post_message":"... Oh my god...  I had no idea this happened."}]
