[{"comment_id":"1003873189632434","commenter_b":"When you take into account what these 2 young men did taking beer from a grocery store well there's going to be consequences plus swinging a skate board well the Police have to do something...I wish I were standing holding a sign I Support the Police Department !!","commenter_a":"I hate to say this but the store video does not lie. Now hopefully they'll release the bodycam video too. Now would be a great time to prove just how successful those are.","post_message":"The Olympia police officer who shot two men last week has given his account of what happened to investigators, and the department isn't releasing information.   More than 100 people packed city hall tonight demanding immediate changes in police accountability >> @webpagelink"},{"comment_id":"10153464723413734","commenter_b":"Take that child away from these monsters! Do NOT allow him back in that \"home\"!","commenter_a":"That's the kind of monster that deserves the death penalty.","post_message":"#BREAKING news out of Maryland.  The mom's boyfriend has reportedly been charged.  More details as they become available."},{"comment_id":"10152653934397169","commenter_b":"A woman should never lose her chic!","commenter_a":"Go girl!","post_message":"Part of a growing trend of older fashion icons:"},{"comment_id":"10153771560244060","commenter_b":"in America, a black male is sixty times more likely to be imprisoned (In the US) than a Chinese citizen in China. So China, in my estimation, has a long way to go with their threats before they infringe on the liberties of their population to the degree to which \"we\" have ours.","commenter_a":"How does a person spread a rumour? It's nonsense. Rumours are spread by masses, not individuals. I suppose the whole country is a prison anyway.","post_message":"Chinese whispers: \"spreading rumours\" online is now punishable by seven years in prison"},{"comment_id":"10153311054577293","commenter_b":"Guns multiply violence and death everywhere they are available without careful screening and detailed background checks. Even the sane lose their tempers and can lose control and kill their loved ones in the heat of the moment if a gun is at hand.. Guns place the innocent at risk everywhere from homes and schools to movie theaters and offices. No one NEEDS a gun. Only fools want them.","commenter_a":"This is why we need to ban guns. If a psycho attacks children with a knife they have a fighting chance. If he had been shooting the outcome would have been very different.","post_message":"He had only one thought: “This is not going to happen.”"},{"comment_id":"1107032922700941","commenter_b":"Kyle Broussard","commenter_a":"That should be an Olympic sport!","post_message":"This guy has some skills.  (Via JukinVideo)"},{"comment_id":"10154809751863812","commenter_b":"Yup I'm buying it! Vanessa Duarte I found our house lol","commenter_a":"@username buy it","post_message":"The 3-bedroom property, located in Bracknell, Berkshire, served as the home where Harry Potter grew up with the Dursleys in the movies."}]
