[{"comment_id":"10153194834046717","commenter_b":"Fuck you bitch","commenter_a":"Many Jamaicans are F'd up; bleaching, trickery, conning, God awful people!!","post_message":""},{"comment_id":"1863352450575527","commenter_b":"She's a nasty which!!! I really felt sorry for Joy she was totally rude to her and had the look of revenge in her eyes toward Joy she should be ashame!!!!=","commenter_a":"Omarosa achieved \"fame\" by being nasty. She is perfect for Trump. She was a disgrace with her last comment to Joy. She literally gave me the chills. I was concerned about Joy's health (and mine) - Omarosa was so vile and consistently lied. She (along with Trump and his Trumpettes) could give good, caring people a stroke!","post_message":"It wasn't pretty."},{"comment_id":"10153953951823690","commenter_b":"How can funding settlement building be tax exempt these people are supporting a war.","commenter_a":"As an American, I'm happy to see this. It is long overdue for this to come to light. Being against apartheid SA, then without question supporting Israel is disgusting hypocrisy. That support fuels additional tension between the US and the middle east. It must end and Israel needs to be held accountable.","post_message":"A lawsuit has been filed in a US court seeking to stop non-profit groups from sending billions of dollars worth of tax-exempt donations to support illegal Israeli settlements and the Israeli army @webpagelink"},{"comment_id":"2071257249766331","commenter_b":"Only American enemies would want to remove it!","commenter_a":"Like","post_message":"There is no reason whatsoever that justifies removing this picture. Can we get 5,000 'LIKES' to keep it in the Museum?"},{"comment_id":"594411744025341","commenter_b":"You probably have one between your legs Shannon!","commenter_a":"Who cares! It's an inanimate object! Ever heard of idolatry? This is it!!!! True followers of Christ don't kneel before a statue, they kneel before the one true God.","post_message":"What does sheer animalistic Muslim hatred against Christians look like? Story below."},{"comment_id":"10152634683050779","commenter_b":"Could be great, i hope so.","commenter_a":"Woohoo!!","post_message":"In a stunning announcement today, Blur have revealed plans to release their first new album in over a dozen years, titled 'The Magic Whip.' UPDATE: Click through to listen to the new song \"Go Out\" and see the track list for the album."},{"comment_id":"837639489700820","commenter_b":"I will destroy humans","commenter_a":"Eloise Nicholls Regan Howard Louise Hemmings Sydnie-Jo Goodison Megan Wilkins @username","post_message":"This robot wants a family...and to destroy humans."}]
