[{"comment_id":"966617630016374","commenter_b":"When a Women is \"with child\" she is eating for Two.Respect starts with self-respect.","commenter_a":"53 million abortion deaths since 1973.","post_message":"Truly frightening"},{"comment_id":"10154547365036756","commenter_b":"@username . Some were royal flushed and forced to eat their perpetrators feces .","commenter_a":"you guys just don't understand the pressure of defending your homeland against New Zealand AND Tasmania.","post_message":"The physical abuse, one victim said, was \"systemic, traditional and commonplace.\""},{"comment_id":"10156567119170725","commenter_b":"U R A NUTJOB AND A #FRUITCAKEFORILLEGALCRUZ ! #MAKEAMERICAGREATAGAIN #DONALDJTRUMP 2016 #ONLYAMORETRUMPNATIONCANSURVIVE!","commenter_a":"The sycophant behavior of many Trump supporters is identical to Obama Libtards, complete with vile hatred of anyone who disagrees and scummy ethics based on Utopian promises. I am starting to think maybe Americans do need to surrender their liberty and let the government take care of them like little retarded babies. Iowa better prove me wrong","post_message":"Ted Cruz isn’t tough on immigration. He stood up for amnesty, not for Americans. President Trump will be the tough leader that America needs. #MakeAmericaGreatAgain"},{"comment_id":"1011931832233204","commenter_b":"They don't really care about fetuses either. If they did, they'd be storming fertility clinics, demanding that leftover embryos be implanted in someone's uterus. No, this whole thing is about controlling women.","commenter_a":"The Republicans & Right Wing Christians are trying to take woman back to the 50's. Women should know their place, sit down & shut up.","post_message":"After seeing all the pro-lifers cheer the attack on Planned Parenthood yesterday, it's time to remind ourselves of how they really feel about human life.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152737954746051","commenter_b":"She should never have bred!","commenter_a":"It's too bad the parents cannot( will not) just pay the fee and get over it.","post_message":"The woman who invoiced a 5-year-old for missing her child’s birthday party has a message for all the haters."},{"comment_id":"480718348785412","commenter_b":"She needs to take her husband and leave go back to were ever their home is","commenter_a":"She has no right to tell anyone what they can or cannot eat. She needs to worry about herself.","post_message":"What Michelle Obama is banning now is just plain unacceptable.  The American people are tired and finally fighting back.  Do you agree Michelle Obama should mind her own business?"},{"comment_id":"10154989881801037","commenter_b":"She's a douchebag!","commenter_a":"Lol good","post_message":"Do you agree with this university's anti-Kim Kardashian West request?"}]
