[{"comment_id":"1642069832709355","commenter_b":"I'm voting for Trump.Is it just me or is Sara palins voice extremely annoying?Like worse the that Kathy griffins creature.","commenter_a":"I approve this message. I am anxious to know Mr. Trump's running mate. Go, Donald!","post_message":"I am greatly honored to receive Sarah Palin's endorsement. She is a friend, and a high quality person whom I have great respect for. I am proud to have her support. #Trump2016 #MakeAmericaGreatAgain"},{"comment_id":"10155199620894411","commenter_b":"Unlike in shithole Islamic countries pedophiles actually go to jail here, instead of marry them. Get dunked on bitch.","commenter_a":"Ah yes, Islam propaganda to tell women to embrace their own slavery & destruction.","post_message":"Protesters claim that the full-face veil is an instrument of women 'self-empowerment'"},{"comment_id":"1026504997444125","commenter_b":"God Bless this good hearted little boy. May he heal fast. 🙏❤️","commenter_a":"in my prayers...","post_message":"So sad.  A 7-year-old boy who spent 2 years growing his hair out to make wigs for cancer victims has found out he has cancer too.  Prayers for little Vinny. Details:  @webpagelink"},{"comment_id":"1766066213681675","commenter_b":"@username trophy wife No. 3 was a soft porn model who also lies like through her teeth. No wonder she squints so much, trying to find her sugar daddy's pee pee!","commenter_a":"\"Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s.\" --Melania Trump","post_message":"\"Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s,\"  Charles Harder, a lawyer representing Trump, said in a statement."},{"comment_id":"1095436653882721","commenter_b":"Shut the Hell Up!","commenter_a":"this asshole can;t handle protesters and people actually think he can handle trained killers. Yeah DISASTER BELIEVE ME DISASTER IS TRUMP","post_message":"Exactly.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1703427863256710","commenter_b":"Like Hillary thinking people should vote for her just because she's a woman.","commenter_a":"Race is not what matters. It is what is in your cranium! Dr. Ben Carson said this and he is correct. How stupid is this woman and those who think race and gender are the most important things in this life!","post_message":"Too much skin in the game?"},{"comment_id":"460222577435670","commenter_b":"Build the Wall, send all illegals home with the babies, end sanctuary cities, take care of our Vets and end abortion. Yippee!! Go Trump.","commenter_a":"Everyone like how he \"tells it like it is\"---after he becomes president and tells YOU the truth about yourselves, don't call for impeachment!","post_message":"When asked for the reason behind his recent political success, Donald Trump gave this simple answer."}]
