[{"comment_id":"1576359559329284","commenter_b":"She's enabled men her entire life! Her big weakness ... Last thing we need is a woman enabler running America.","commenter_a":"Did she really just compare Donald trump to native Americans going off the reservation?","post_message":"Hillary Clinton brushes off Donald J. Trump's sometimes personal attacks against her as him being \"off the reservation\" — something she said she has experience with. @webpagelink"},{"comment_id":"813714802066935","commenter_b":"I'd like to see her asshole","commenter_a":"Joyce Watson @username superimpose someones cheeser. xv","post_message":"Subscribe to our mailing list and receive our awesome content for FREE - @webpagelink"},{"comment_id":"10152870129557093","commenter_b":"Omg this woman is so racist!!! Just watch! Lol @webpagelink","commenter_a":"He doesn't need to apologize! People need to learn how to act! And how to respect higher Authority. Life would be more peaceful if people just learned to act like decent people","post_message":"Attorney for McKinney Cpl. Casebolt said two suicide calls before pool party put him in \"emotional place\" .... said Casebolt apologizes to those offended by his actions.... @webpagelink"},{"comment_id":"1061695460512781","commenter_b":"Forget about the suicidal Muslims getting atomic bombs, let's get those guns WTF","commenter_a":"\"Sniper ammo\" is next...wait for it....","post_message":"We didn't say anything about gun control, but it is gun control. Everybody knows they want gun control, and if they can't get your gun, what better secondary way than to get you bullets? Anybody with a brain knows what's going on here."},{"comment_id":"1050442818384698","commenter_b":"At the least, his judgement is impaired............his bond to the Clintons got in the way of his judgement.............","commenter_a":"Fire him he is a crook","post_message":"Should James B. Comey, Jr. continue as Director of the Federal Bureau of Investigation? Is he professionally compromised? Does Mr. Comey continue to enjoy the trust and confidence of the American people, the rank-and-file of the FBI, and the thousands of government employees holding security clearances and access to classified information? Read this op-ed by Judicial Watch Director of Investigations Chris Farrell below."},{"comment_id":"10157214530105615","commenter_b":"Now if Rupert Murdoch could just croak and leave us all alone, particularly National Geographic...","commenter_a":"40 million to leave?","post_message":"BREAKING – Maybe now Americans can have their country back... Best thing to happen to America in years!"},{"comment_id":"479766112213969","commenter_b":"Oh that is too funny she claims her life is harder than soldier that bitch don't have a clue","commenter_a":"and they have no vaction poor baby michelle","post_message":"Michelle Obama just made an outrageous claim... Our soldiers fight and die for our country, Michelle takes lavish vacations. Do you respect our veterans over Michelle?"}]
