[{"comment_id":"949176475215531","commenter_b":"The some bitch had a beautiful bitch at home dammit quit taking up for this clown","commenter_a":"But he only talked about fuckin another chick. Shit people left and right young and old talk about wanting to bang women. I do it all the time? Bill followed through, no confirmation of trump cheating and/or raping/fucking another women. Hop off the high cloud, and take a step into reality.","post_message":"This is just horrible..."},{"comment_id":"1096146180493131","commenter_b":"Mexicans showing their little dicks. Their penis's are as big as a Mexican pepper. Will see who kisses of illegals your asses are grass.","commenter_a":"Trump","post_message":"CITIES TELL TRUMP to KISS OFF @webpagelink"},{"comment_id":"832762386834955","commenter_b":"Little bitch alert","commenter_a":"Use thc dumbasses","post_message":""},{"comment_id":"1325783830806579","commenter_b":"Yeah, you're a whore","commenter_a":"Look at all of the money hungry gold digging hussies in the comment section. ☝️️ @username","post_message":"If you've got some extra money to burn..."},{"comment_id":"10153301412809641","commenter_b":"tuch","commenter_a":"Warning: china is about to end... u.s. is the most powerful country in the world!","post_message":"BREAKING: Nearly every U.S. federal government agency has been hit by a massive hack thought to originate from the Chinese military, and millions more workers could be affected: @webpagelink"},{"comment_id":"1011733118888805","commenter_b":"Amen to that our children come FIRST","commenter_a":"So sad.","post_message":"We have NO ROOM! We need to take care of Americans first and make our country GREAT Again!~ FOLLOW US---> Freedom Daily"},{"comment_id":"10156049439790725","commenter_b":"because we know how to build stuff that's why..... Why u think Latinos rule the construction industry?? Lol... Really building a wall huh? Who u guys going to get to build the wall?","commenter_a":"What about the fence the Mexicans put up to keep People from Guadamalia out> If it works for them why not for us??","post_message":"For those that don’t think a wall (fence) works, why don’t they suggest taking down the fence around the White House? Foolish people!"}]
