[{"comment_id":"10153316215802377","commenter_b":"\"We're\" what has he got to be mad about - he's part of the problem.","commenter_a":"I'm glad he didn't get it for president.","post_message":"\"Certainly part of what is behind the energy and the passion for Donald Trump on the Republican side and [Vermont Sen.] Bernie Sanders on the Democratic side is the frustration and anger people feel in this country,\" Mitt Romney said."},{"comment_id":"1665137810414324","commenter_b":"Beyonce is a racist and a cop hater.","commenter_a":"God Bless You.","post_message":"Whoa, this outspoken Obama critic didn't hold back at all when discussing Beyonce's Super Bowl halftime performance... and he pointed out EXACTLY what made it so hypocritical.  If you thought Beyonce's halftime performance was unacceptable, spread this video far and wide,,,"},{"comment_id":"10153681874356130","commenter_b":"Did he build the wall?","commenter_a":"The Pope is a hypocrite. Take down the Vatican walls and let people enter freely and demand to be taken care of.","post_message":"Satan For President? @webpagelink"},{"comment_id":"10152999953419205","commenter_b":"....They are racist too is hardly an argument. Plus copy and paste from KKK websites ain't the best source. Still laughing","commenter_a":"You mean whitewashed like how the democrat party did about their racist history? The party you blindly support like Pavlov dogs?","post_message":"Texas textbook publishers caught whitewashing American history"},{"comment_id":"1204381342954945","commenter_b":"something wrong","commenter_a":"What the hell???????????????????","post_message":"The UK government buildings put in hock to Muslims"},{"comment_id":"875288902530859","commenter_b":"I think she looks much better than that freak of nature.","commenter_a":"No no no no no! Wrong in so many ways... You need MUCH MORE Booty gf.","post_message":"My weekend as Kopycat Kim Kardashian."},{"comment_id":"1073692496071264","commenter_b":"She's a POS !!!!!","commenter_a":"hahaha love this dude","post_message":"\"[Hillary Clinton] keeps saying that we need to move slowly on this. Someone give her a Red Bull, because the wolf is at the door – the wolf is chewing through the door.\" – Sheriff David Clarke on fighting Islamic terror threat"}]
