[{"comment_id":"10154831309643984","commenter_b":"She is SCUM","commenter_a":"She is pure unadulterated bullsh**.","post_message":"Of Hillary's hundreds of scandals, this is by far the worst. And most people have no idea she was even involved, let alone behind it.  This makes her scandals (and the ones she's made up about Donald J. Trump, look like nothing."},{"comment_id":"1192416514111710","commenter_b":"Then he cuffs the man after shooting him in the back smh","commenter_a":"How in the hell do you feel threatened by a man who is running in the other direction? This guy is full of crap.","post_message":"Former officer Michael Slager: 'What makes me upset is that nobody knows what actually happened.'"},{"comment_id":"10154624272397042","commenter_b":"Yea she has no right to refuse medical attention she is a minor, she could be hurt and this could look bad on us, lets slam her into a wall and toss her around to make sure she goes.","commenter_a":"If I'm not mistaken, she doesn't have the right to refuse medical treatment because she's a minor right? Her parents have to make that decision as well as them signing a Miranda for cops to question her. I hope her family sues and the officers gets properly reprimanded","post_message":"Body-camera videos of police using pepper spray on a 15-year-old girl have caused widespread uproar."},{"comment_id":"10154225245793483","commenter_b":"Wtf is wrong with this woman. She needs to be arrested for abuse. I take care of elderly people and this is despicable!!","commenter_a":"That's disgusting. Has she been arrested?","post_message":"A 94-year-old woman was supposed to be taken care of by a home health care provider. But she was screamed at and even hit by the woman.  'I told you stop feeding that dog human food,' the worker screamed at the 94-year-old woman. FOUL LANGUAGE WARNING FULL STORY --> @webpagelink"},{"comment_id":"1016566111717194","commenter_b":"What a fucking hypocritic Bitch.","commenter_a":"Please don't accuse her for stealing a flag. She needed one to wear for a photo shoot to feel nostalgic about a time when she was a playmate.","post_message":"An enraged conservative attempted to steal an American flag from African-American protesters and fought with police, but was not arrested...at a demonstration regarding white privilege."},{"comment_id":"1030788763705100","commenter_b":"Yup, start by getting rid of his useless ass.","commenter_a":"Asshole","post_message":"President Obama talks about the urgency of Climate change, saying 'We've proven that the choice between our environment, our economy, and our health is a false one. We've got to strengthen all of them together.' What do you think?"},{"comment_id":"10153123153839094","commenter_b":"Behind what.....the Jettsons?","commenter_a":"We are only behind because the city deferred maintenance and closed one of the terminals to make flyers more crowded and make the airport look awful.","post_message":"Kansas City should focus on planning for a single new terminal at Kansas City International Airport, airlines and the city’s aviation department said today."}]
