[{"comment_id":"1695518967374741","commenter_b":"NOW do you understand why Ross Perot ran as an Independent in 1992? The parties are both corrupt and they control who gets elected, no matter how many citizen vote.","commenter_a":"All I'm hearing is boohoo I lost so now I have to blame it on something else. If your as smart as you claim you would have known the rules, moron! And look at all your inbred supporters, they have no idea how the laws or rules work either! Go Cruz!!!","post_message":"At least in Colorado they didn’t even pretend to care about what the voters think!"},{"comment_id":"855184514566047","commenter_b":"Oh, he wont' do that - she's white.","commenter_a":"I Jeb Bush should set up a public shaming.","post_message":"What are your thoughts about this tweet about Bristol Palin, Sarah's daughter?!"},{"comment_id":"10153709063006350","commenter_b":"I can't stand Matt Lauer -- he's too much of a liberal for me.","commenter_a":"Hope not trump !!!","post_message":"'If I think for some reason it's not going to work, then I go back to my business,' Donald J. Trump told Matt Lauer about whether he would drop out of the presidential race. 'There's no question about that.'"},{"comment_id":"10153880843542293","commenter_b":"Really? Because people can remember actual facts that happened 15 years ago. Right.","commenter_a":"'@username you were right!","post_message":"New details emerge about Omar Mateen, including his strange reaction to 9/11."},{"comment_id":"1134738373236015","commenter_b":"Actually female secretions do have some nutritional value. And ok, and maybe you should suck some more dick.","commenter_a":"Ha! Says a study funded by the patriarchy and trying to get women to scientifically be cool with swallowing men's Semen. If you're gonna be anti media, don't be pro patriarchy. It's all a part of the same machine. It's all part of the same manipulation. Fuck the patriarchy.","post_message":"And now you know..."},{"comment_id":"1287419524611131","commenter_b":"Lefty lady","commenter_a":"My peeps","post_message":"It's National Left Handers' Day! Did you know only 10% of the U.S population is left-handed? Comment below if you're a lefty like these celebrities. >> kiro.tv/Famous-Lefties"},{"comment_id":"983326201715214","commenter_b":"his momma owes him a butt whooping is all... since he probably got no daddy","commenter_a":"Send him back to Africa and let him live the life he would have had if his ancestors would have stayed there","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING."}]
