[{"comment_id":"10153873551727550","commenter_b":"Scores girls accept nothing less!","commenter_a":"As long as liquor stores, bartenders, strippers and cigar shops accept them who cares who is on the twenty dollar bill?","post_message":"ABC News has confirmed through a Treasury spokesman that Harriet Tubman will replace Andrew Jackson as the face of the $20 bill.  Full Story --> @webpagelink"},{"comment_id":"608933979286362","commenter_b":"Gennifer Flowers: Bill Clinton Told Me 'Hillary Had Eaten More Pu**y Than He Had'","commenter_a":"i like hillary clinton","post_message":"If we unite together, we will rise together."},{"comment_id":"506998642821762","commenter_b":"I'd say a feminist who pees themselves might be drunk.","commenter_a":"Well, that has to be uncomfortable. Only a mental moron would pee themselves. I'm telling you, libs are retarded.","post_message":"How stupid can some people be..."},{"comment_id":"10154501984339087","commenter_b":"@username So they get deported five or six times then come back and kill innocent people. Did you know that most of them send money back across the border to help their families come here.","commenter_a":"Trump cost himself the popular vote. He already said he is keeping Obama's amnesty in place. So if he's blaming the illegals why would he keep them here? He is such a lying fool and his supporters suck it up.","post_message":"\"He said 3-5 million 'illegals' voted so that's why he lost popular vote,\" one Democratic aide said about President Trump's comments at the meeting."},{"comment_id":"896147533775276","commenter_b":"We Americans are beat. Face it effort to assist citizens verses supposed immigrants (illegal) is futile. We are sold out! The few elite own the few corporations and all are subjects of the foreign owned NON \"federal\" reserve! GOVT benefits were advertised south of the border. The border is not secure. Enforcing US deportation laws are ordered on STANDING DOWN. An increasing invasion of illegal foreigners flock into our nation. So now, the govt is offering huge tax rebates to illegals never having paid taxes! I give up! America can never survive.","commenter_a":"NO I DO NOT AGREE!!!!!!!!!!!!!!!","post_message":"PETITION HERE: @webpagelink"},{"comment_id":"1189264781194585","commenter_b":"Bet you swat flies, stomp spiders and spray bug spray around. Insects are living creatures and so is mold.","commenter_a":"Sick !!! Well no excuse weither crocodiles kill humans or not humans are the sickest living creatures on earth they do things to get kicks and enjoyment","post_message":"Vile."},{"comment_id":"1012584022097710","commenter_b":"Yes, it is so obvious, but people in general are very ignorant, they think it will never affect them. Well, it is already affected them in America, in Europe and elsewhere. The Muslim radicalism is taking over the World and nobody cares! Israel is the country that knows what is all about and suffers from constant terror and constant criticising from the stupid World leaders who sold their countries, the culture and civilisation of thousand years to savages.","commenter_a":"Key Positions in our government ! @webpagelink/ CANNOT TAKE THE CREDIT FOR THE BELOW. REPOSTING To President Obama: It was you who told an Islamic dinner - \"I am one of you.\" It was you who on ABC News referenced - \"My Muslim faith.\" It was you who gave $100 million in U.S. taxpayer funds to re-build foreign mosques. It was you who wrote that in the event of a conflict -\"I will stand with the Muslims.\" It was you who assured the Egyptian Foreign Minister that - \"I am a Muslim.\" It was you who bowed in submission before the Saudi King. It was you who sat for 20 years in a Liberation Theology Church condemning Christianity and professing Marxism. It was you who exempted Muslims from penalties under Obamacare that the rest of us have to pay. It was you who purposefully omitted - \"endowed by our Creator\" ...","post_message":"Ignorance isn't bliss if it's harming people..."}]
