[{"comment_id":"1676407832621088","commenter_b":"#TrumpTrain #StopHillary #BernieSucksCock","commenter_a":"Based Ben AMIRIGHT @username","post_message":"Thank you Dr. Ben Carson! An honor to receive your endorsement this morning."},{"comment_id":"10153046924231519","commenter_b":"@username, when has Ann Coulter ever told the truth?","commenter_a":"I cannot stand the mind of Ann Coulter or the things that she says. But the personal attacks don't add anything to the argument. There's plenty of solid evidence to dispute among the things she says and has written. \"Old and sad,\" \"horse face\" and other things don't contribute to the discussion. They make the left look as bitter and unreasonable as the extreme right.","post_message":"This debate is a perfect example of how right-wing \"facts\" make their way though the delusional echo chamber..."},{"comment_id":"10154653727828812","commenter_b":"Don't Feed the Trolls","commenter_a":"Oblunder doesn't have a problem spending other people's money. A true Saul Alinsky Elitist.","post_message":"Ellen DeGeneres, Magic Johnson, NBA star Grant Hill, and Hollywood heavyweight George Lucas were among the party-goers at President Obama's blowout birthday bash at the White House Friday."},{"comment_id":"10156221471665725","commenter_b":"Trump is only enforcing a fedral law, by deporting illegals !!! This is already the law !!!","commenter_a":"I am inviting all of TRUMP FAN to PRAY , from the HEART everyday and all the time, he need it and we need him, please let get together , for our country and for our new president TRUMP, TRUMP 2016, AMEN !!!!","post_message":"I will be hosting Saturday Night Live on November 7th. Looking forward to it!"},{"comment_id":"10153694133994330","commenter_b":"Feminists live in fantasy land","commenter_a":"She should be in a cheer outfit not a football jersey if she was to play that's fine make a all female team","post_message":"She's in 8th grade and she's no joke on the football field.  That's right, we said she!!  Watch NBC Connecticut news at 6:20 tonight as NBC Connecticut's Kevin Nathan brings you her amazing story. --> @webpagelink"},{"comment_id":"10153877660438812","commenter_b":"Wow, you're just full of fear. They're just people that want to use the bathroom. Get over yourself. No one wants to look at you or your ugly daughter anyway","commenter_a":"This just in! All teenage boys are claiming to be trans to gain access to girls' locker rooms.","post_message":"The DOE says an Illinois school district is violating the rights of a trans student by denying her access to the girls' locker room."},{"comment_id":"10153260495114087","commenter_b":"She should run to prison!","commenter_a":"100 percent right","post_message":"\"I can tell you this, if that were a Republican that did what she did with the emails, they would have been in jail 12 months ago,\" Donald J. Trump said."}]
