[{"comment_id":"10157183746875725","commenter_b":"#TrumpTrain #Women4Trump #MakeAmericaGreatAgain #BuildTheWall #Vets4Trump","commenter_a":"I live in Australia. I would not want them here. But worse would be Trump. I feel sorry for you all. This will be an election of abstention I think. God Help America.","post_message":"It's clear: scandals and controversies follow the Clintons, who will say and do anything to win."},{"comment_id":"477998972394364","commenter_b":"Me too, but sometimes I go overboard and can't keep track of all my comments on the Internet.. So I have to take a break.. Also I get discouraged when people call me names :(","commenter_a":"They didn't say \"get over it.\" They promised to look into it, did so, and concluded that their pop culture reference was fine and that people misconstruing it would be in the minority and no changes needed to be made. Kinda funny how you can spin a story with a contentious headline. Ben & Jerry's seemed concientuous and compassionate here, not combative and dismissive as the headline suggests.","post_message":"These folks became very upset over the name of Ben & Jerry's new ice cream flavor and demanded it be changed. Ben & Jerry's response: Get over it."},{"comment_id":"10152639354152093","commenter_b":"Beautiful, what breed?","commenter_a":"Zeus is a big fan of the ice! #PuppysFirstIceStorm","post_message":"Ice storms are better with your best bud… #PuppysFirstIceStorm (photo: Dawn Lankford Morton) Latest updates: @webpagelink Tuesday closings/delays: @webpagelink"},{"comment_id":"1538272953143656","commenter_b":"Benjamin Edward I do!!! I like this takes place in Brooklyn too!","commenter_a":"Benjamin Edward","post_message":"Mark Ruffalo and Bernie took a walk through the Brooklyn, New York school yards where Bernie grew up, and talked about his childhood, why he got involved in the Civil Rights Movement and how those experiences translated into his life in politics and this movement. (Directed by Matthew Cooke)"},{"comment_id":"853718148092962","commenter_b":"Hope she goes to prison.","commenter_a":"She should pay it back and go to jail","post_message":"So long, farewell..."},{"comment_id":"10152862008521336","commenter_b":"I'm so glad they caught those scumbags without more bloodshed. It still is b@llshit that some people think shooting at cops is an appropriate action to try and prove a point. If you want a lawless society I'm sure there is some third world country that will accept your dumb@ss.","commenter_a":"He Could Be Obama's Son!","post_message":"UPDATE: Two suspects are in police custody Tuesday for allegedly shooting two plainclothes NYPD officers responding to a robbery."},{"comment_id":"10153128143973812","commenter_b":"Cows can't even read","commenter_a":"Japanese people have since killed 78% of all Dolphins seen in this video.","post_message":"WATCH: It seems more like a dream as you watch it, but for Alex Rivest, it was reality as he joined a large pod of dolphins off the coast of Hawaii's Big Island. This video was recorded in late December."}]
