[{"comment_id":"1196992380374839","commenter_b":"Too bad all his accusers wernt nasty enough!!! .lmao...","commenter_a":"Not going to happen!","post_message":"We're in Raleigh, North Carolina where Elizabeth Warren is campaigning for Hillary Clinton. @webpagelink"},{"comment_id":"10150514383944999","commenter_b":"All terrorists are Muslim?","commenter_a":"'Boko Haram ('Western education is forbidden'), officially called Jama'atu Ahlis Sunna Lidda'Awati Wal-Jihad (People Committed to the Prophet's Teachings for Propagation and Jihad), is a militant Islamist movement based in northeast Nigeria.' There's that common denominator again: Islam.","post_message":"Soon after Boko Haram kidnapped nearly 300 teenage girls in Nigeria, the U.S. sent surveillance drones and about 30 intelligence and security experts to help the Nigerian military try to rescue them. Seven months later, not one of the kidnapped girls has been found."},{"comment_id":"10152816075404753","commenter_b":"Wtf?? They should def prosecute dem bitches fym.. they gone go and do that same shit over over again smh","commenter_a":"When we know better we do better.so much apparently went wrong way before the baby was born. Let's solve all the issues leading up to the drop off.lack of birth control lack of medical attention for both mother and child.lack of protection from sexuality transmitted diseases.we all failed here.so let's beat up the mother who had the cottage to face up to the fact that she lacked the ability to raise this child.we can do better than this","post_message":"Colorado has a Safe Haven for Newborns Law, which means a parent can drop off a baby at a hospital or fire station within 72 hours after birth without being prosecuted."},{"comment_id":"10153471873556770","commenter_b":"'@username - afraid your husband will be deported huh?","commenter_a":"These Clowns are hilarious Dracula aka Cruz and Cruella Devile aka Fiorina ....She was dying for some spotlight....Well she will get if for about another month...Then Bye Bye weirdos","post_message":"During Carly Fiorina’s acceptance speech for running mate with Sen. Ted Cruz, Fiorina sang a made up nursery rhyme to Cruz’s daughters."},{"comment_id":"10153111204826680","commenter_b":"The paper of choice for Fox News viewers","commenter_a":"What was curious about the Democrat primary Debate selection pool is all Old White people — No Blacks No Hispanics -diversity?","post_message":"The National Enquirer is fixated on Hillary Clinton's mortality."},{"comment_id":"10152549413699071","commenter_b":"So true, reason why women throw themselves on celebrities","commenter_a":"Healthy man not attracted womens .attrating gods grace","post_message":"The most valued trait in a potential mate isn't beauty or wealth."},{"comment_id":"10154303194092042","commenter_b":"Id take anyone over Hillary. Shes a liar, a deceiver and manipulator and its all on record.","commenter_a":"That is what Donald Trump gets for once again trying to go after Hillary Clinton. If he keeps it up, well then, it's absolutely over for him. No one, I mean, NO ONE, would ever trust Donald Trump as president of the United States. It just isn't going to work.","post_message":"#DeleteYourAccount: Hillary Clinton has had enough of Donald J. Trump's comments on Twitter."}]
