[{"comment_id":"10154601974052690","commenter_b":"Could it be that she is still here illegally","commenter_a":"The other problem people need to understand is everyone that is Spanish is not from Mexico. This woman is from San Salvadora. Everyone automatically thinks Mexico. I wonder why? Could it be ignorance taught to them by ignorant people. There are so many \"illegal immigrants\" here that people assume are from Mexico when in fact they are not. Stop stereo typing and get educated.","post_message":"An undocumented woman in need of surgery to remove a brain tumor is being held at a North Texas Immigration and Customs Enforcement detention center, her attorney says."},{"comment_id":"1247572008614366","commenter_b":"Her pants should have caught fire. She needs a choke collar.","commenter_a":"Yes","post_message":"Surprised? Neither are we."},{"comment_id":"10153500455846336","commenter_b":"Mr Rubio: While it might be nice to possess 'class\", we don't need \"class\" as much as we need a \"leader\" who has the nerve to say what's on everyone's mind and then do something. It remains to be seen if he can get past the nefarious \"electoral college\" that elects the president no matter what the \"popular\" \"people's\" vote is.","commenter_a":"how about instead of commenting on another persons comments you actually tell us how you are going to fix all the crap wrong with our government, waste and abuse of tax payer dollars, so how are you any better??? so tried of you all","post_message":"Sen. Marco Rubio addressed immigration and Donald J. Trump's controversial comments. @webpagelink (via Fox & Friends)"},{"comment_id":"10155404050665492","commenter_b":"Your entitled to carry your personal property anywhere you want . Just put it away when you spot the vermin .","commenter_a":"Having your phone in hand is tantamount to having wad of cash in hand.","post_message":"The subway rider was also punched in the face."},{"comment_id":"1260941960612940","commenter_b":"To unite for all the right concerns all of them with us in mind because is 100% for and by the people...please for your families...you have to check learn help in anyway you can act and share and share again...because species are disappearing everyday...everyday...for you your loved ones for the nation for the world the planet..hiring humans for humanity and peace for all not the few...www.jill2016.com","commenter_a":"What a lot of people don't know about Trump that support him is, that those same people would not survive him ...Trump would even eat his own kind....it's just his nature.","post_message":"This teen just figured out the perfect question to start asking Trump and his supporters."},{"comment_id":"1176020919129046","commenter_b":"People are saying trump is unfit to lead the country","commenter_a":"Guys I'm scared... Polls are showing crooked Hillary leading by double digits now.... Someone please give me a virtual hug and tell me everything is going to be okay","post_message":"Many people are saying that the Iranians killed the scientist who helped the U.S. because of Hillary Clinton's hacked emails."},{"comment_id":"1695225903839696","commenter_b":"Oh that won't be left leaning or anything....","commenter_a":"Didn't know 60 minutes was still on","post_message":"You get a story. And you get a story."}]
