[{"comment_id":"10153153444601051","commenter_b":"Go ahead baby girl google dat, ill wait.... Lol","commenter_a":"This Latina is a trump supporter.","post_message":"We went to the Donald Trump protest this week to speak to his supporters and critics. Here's what they had to say. Do you agree or disagree with Trump when it comes to immigration?"},{"comment_id":"10154622276758797","commenter_b":"😂😂😂😂😂","commenter_a":"Iveeno Wallace this time only ur teeth match.","post_message":"ABDUCTION ALERT: Look like anyone you know? #Chicago Police have released a sketch of a man suspected of trying to abduct a 14-year-old girl in the Roseland neighborhood. Important details, here: @webpagelink"},{"comment_id":"1017271401662888","commenter_b":"Yes","commenter_a":"Yes","post_message":"A University of Texas/Texas Tribune Poll found Texan voters say illegal immigration is the greatest threat to the U.S. -- DO YOU AGREE? Comment with YES or NO"},{"comment_id":"10153676106271636","commenter_b":"Jaysus.. its 2016 and still people believe this is real... all the people in these prank videos are in on it... are we just going to ignore that? And for the record I have seen tons of videos of girls clipping guys' crotches with paperclips and pouring hot sauce over them in the name of prank .. these videos are cutely dubbed \"bf/gf pranks\" what the hell?","commenter_a":"What a F**CKING idiot...","post_message":"It's been branded misogynistic"},{"comment_id":"10153162341961051","commenter_b":"That is crap. She should not have been arrested. She could see her children.","commenter_a":"She was making the best out of a tough situation. Geez. A little common sense, please.","post_message":"Simple question: should this mom have been arrested?"},{"comment_id":"10153715993757293","commenter_b":"Make it a felony to hire anyone illegal","commenter_a":"I've watched illegal immigrants take construction jobs from my fellow Americans for years. Build the wall.","post_message":"In a two-page memo to The Washington Post, Donald J. Trump detailed his plan to force Mexico to pay for a border wall"},{"comment_id":"1034964553205670","commenter_b":"@username I do not know of anyone who has demanded to, \"get even\" with whites. Not sure who you are referring to.","commenter_a":"Idk, I was bullied and made fun of for being white by black girls. It's just racism, saying \"reverse\" racism implies that only white people can be racist. That's pretty racist, in of itself. :/","post_message":"News flash: Reverse racism doesn't exist."}]
