[{"comment_id":"984777404931920","commenter_b":"Our weak border has made Mexico Drug Cartel stronger and made Mexico's government weak with corruption. Mexico has some of the most beautiful beaches in the world that are controlled by some of the most deadliest drug cartels. Mexico is losing billions in tourism because of the Cartel. Mexico is a culturally rich country that is being destroyed by these drug cartels. By building this wall it will help both the Mexican and the American economies by stopping drug trade. The Cartels will lose many because supply will be cut of and Mexico will gain strength. 95% of illegal drugs that come across the border will be stopped by a wall. It will in turn save our communities and our youth. Our youth will be able to flourish instead of turning to drugs. Americans will no longer have to depend on Liberal Politicians asking for help, they will be able ...","commenter_a":"Take away handouts and people committing welfare fraud and put them to work. Seems like there's quit a bit of places hiring where I live. I do believe trump is our our hope and is the best choice for president. Bernie is a joke and Hillary is a liar.","post_message":"I will bring our jobs back to the U.S., and keep our companies from leaving. Nobody else can do it. Our economy will \"sing\" again."},{"comment_id":"10153329720368701","commenter_b":"They should drop the drinking age to 18 instead. Only Islamic countries are as strict as the US when it comes to drinking age. Raising the tobacco age will simply result in sneak smoking just like raising the drinking age resulted in binge drinking. Adults need to be adults.","commenter_a":"how about the state legislature concentrate on what it was elected to do: keep a balanced budget and not waste taxpayer money.","post_message":"What do you think, should Oregon and Washington follow suit?"},{"comment_id":"10153724515436770","commenter_b":"She has no womb or ovaries.","commenter_a":"Transgenders are just psychologically \"challenged\" individuals with a normal complement of either male or female sex chromosomes. A genetically male transgender would (quite correctly) not be allowed to compete in a woman's race whereas a genetically female transgender would only get beaten were she to compete in a male race. Caster is (it seems) totally different. If an intersex she has two X chromosomes that would normally make a female but, unlike true females she also possesses male Y chromosomes that will give some male characteristics. If she has Y chromosomes then she isn't qualified to compete in female races but, as with female transgenders, there is little point in her trying (and she should not with two X chromosomes) to compete in male races.","post_message":"South African runner Caster Semenya dominated the women's 800-meter final Saturday in Rio, finishing well ahead of the competition to take home the gold medal. Turns out Semenya is widely believed to be “intersex.\""},{"comment_id":"1788072574740832","commenter_b":"jesus Christ those girls look petrified","commenter_a":"@username @username 😱😱","post_message":"Parents in remote parts of Malawi are sending their daughters to be sexually initiated by local men - called \"hyenas\" - when they reach puberty. Meet Eric, he’s proud of his role as a \"hyena\". Learn more from BBC News Magazine: @webpagelink Listen to the documentary: @webpagelink"},{"comment_id":"10153559673746130","commenter_b":"Exactly, I forgot all about this bitch! Lol","commenter_a":"Why did you make her a thing again?","post_message":"Finally, something Kim Davis and her critics can agree on."},{"comment_id":"1213211328691180","commenter_b":"Yes","commenter_a":"YES","post_message":"It's AMERICA! Learn it or leave! Comment yes or no! LIKE OUR PAGE!----> Freedom Daily"},{"comment_id":"554679601385273","commenter_b":"Just look at that fugly face! Barf","commenter_a":"What an ugly dude!","post_message":"Of course Sally Kohn brought up white privilege..."}]
