[{"comment_id":"10152727652141051","commenter_b":"LOL dumb ass bitches","commenter_a":"Wow how sick.could they wait until they got home","post_message":"These two women were chased out of a movie theater bathroom because the security guard thought they looked too much like men."},{"comment_id":"10154478839956636","commenter_b":"@username without god, noone can hear you get shot. Your worldview is wuite hopeless. Without god, who will punish evil ppl then evil has won. Rofl","commenter_a":"They found the remains of velociraptor Jesus used to ride on.","post_message":"Incredible"},{"comment_id":"10154524570660579","commenter_b":"IS THAT A BED SPREAD KILLARY IS WEARING. MY GOSH THAT WOMEN IS SOOOOOOOOOOOOOO UGLY","commenter_a":"I am with her","post_message":"Senator Elizabeth Warren campaigns with Hillary Clinton in Ohio.  Watch the complete video here: @webpagelink"},{"comment_id":"1145897778760904","commenter_b":"I have the same solution no matter the skin color......shot them, protect the population from killers.","commenter_a":"Throw him in a cell with a bunch of big angry sex offenders.","post_message":""},{"comment_id":"10153189927841336","commenter_b":"Mike.... yes all ILLEGALS should be deported.... We have immigration laws which are not being followed... We have a system for people who want to become citizens so I do not support those who break the laws of this country and expect to reep the rewards of citizenship off the backs of the American taxpayer...","commenter_a":"ACLU is out of their minds... abortion is murder!!! illegals need to be deported PERIOD...","post_message":"“The Catholic Bishops are taking millions of dollars in federal grants and then imposing their beliefs on this vulnerable population… that raises serious concerns under the separation of church and state provision in our Constitution,” said an ACLU Nationwide attorney."},{"comment_id":"617790755078170","commenter_b":"She a geto gutter hoe send her back","commenter_a":"I agree with Brooks.And Steven Joseph Sr.God bless that soldier .And thank you for your service","post_message":"Michelle Obama wanted this army staff sergeant to do this, but he refused.  This is amazing. We stand behind this soldier 100%.  Do you support this war hero stand against Michelle?"},{"comment_id":"10153061426624411","commenter_b":"In prison in U.S. A child killer is gang raped and beat to death they hate child killers !","commenter_a":"Well it sparred prisoners a job of having to kill her. Deserves to die child killer!","post_message":""}]
