[{"comment_id":"870530659649023","commenter_b":"This seems to imply, the next President has to be a woman...","commenter_a":"I completely agree with her that Hillary is not the woman for the WH. And I'm looking hard to find the one who will do all they can to put us back on track as a Nation, restore our economy, and undo the damages done to our International Affairs across the world. We need to sure up our relationships with our friends and work harder with the ones who threaten the peace and safety of this world to ensure they do not get nuclear capabilities and the ability to use them. We also need to clean up our Nation from illegals and close our Borders so that they are not so easy for illegals to cross them. We need some common sense leadership for this Nation instead of all the socialism and liberalism, lies and corruption that is tearing this Nation apart. Hillary Clinton has already proven she can not ...","post_message":"Want a female president?   Skip Hillary. Look at Carly Fiorina!"},{"comment_id":"1007291799323583","commenter_b":"Social Media: What a bunch of freakin half wits. I wish we could send them all out on a barge in the middle of the ocean sink the barge and see how many swim back. Social media morons the world would be a better place if we took your cell phones away until you learn what they are supposed to be used for. One irresponsible person does not make everyone irresponsible. Wake up! This is exactly what Obama wants, take our guns so he can declare the U.S. a dictatorship and he would be the dictator!","commenter_a":"no","post_message":"Here we go..."},{"comment_id":"1117614688258709","commenter_b":"@username I bet you believe the liar Lucy.","commenter_a":"Apparently the alleged (by police) victim in this case, is saying \"there was no assault\"..... Of course if the Gian Gomeshi/Lucy DeLiar case has taught us nothing if not \"We must believe in the guilt of every man accused, even if he is not guilty... even if the accuser admits to lying about it... and even if the alleged victim says \"he didn't do anything\".... if you have a penis, you are, by default, guilty, even if you're not guilty :( Sad world when having a dick is more of a crime than being a dick :(","post_message":"\"If I find out that somebody is abusive, I cut them out of my life. It's very easy,\" wrote Lucy DeCoutere after the actor who plays Bubbles in the Trailer Park Boys was charged in a domestic dispute."},{"comment_id":"10153573077978352","commenter_b":"Christina you're dumb","commenter_a":"Te'ron Walker because most black people blame whites for everything. When no white people alive today had a damn thing to do with the past. Not all white people are racist. There are plenty of black racist people though because all whites \"owe\" blacks every damn thing when we're not the ones that had anything to do with anything that happened before. Y'all need to take that shit up with all the dead white people. Oh, and the blacks too since whites weren't even the ones to START damn racism. Ignorance is bliss people.","post_message":"High school principal fired after racist outburst at ‘all the black people’ leaving Georgia graduation ceremony early"},{"comment_id":"1135264553151680","commenter_b":"Only you idiot liberal want these invaders here... Morons","commenter_a":"But who would want to live there? Especially a refugee, who will be treated worse than they treat their own minorities and poor (which is pretty terrible).","post_message":"Fact check."},{"comment_id":"10152908663462434","commenter_b":"And he testified she was having a good time. Three sides to every story- his, hers and the truth","commenter_a":"Everyone acts like this is an isolated case. Boys pressure girls into having sex every day.","post_message":"In interviews with police, Labrie denied raping the 15-year-old, saying he’d put on a condom for what was supposed to be a consensual encounter before experiencing a “divine inspiration,” as he put it, and leaving the room. In testimony, he said the hook-up was consensual, and that having penetrative sex with the girl “wouldn’t have been a good move for me.”"},{"comment_id":"10153676490604071","commenter_b":"GEE HIS WIFE DIDN'T TELL ANYONE DID SHE What Crap","commenter_a":"This is coming from the Obama administration not the FBI. This guy works for the president, he will say and do anything Obama wants him to","post_message":"\"Some of our most productive relationships are with people who see things and tell us things who happen to be Muslim.\""}]
