[{"comment_id":"894713893918640","commenter_b":"They are teaching the future illegal aliens how to unionize for maximum benefits. What a COUNTRY!!!!","commenter_a":"VERY WRONG!!!","post_message":"The IRS commissioner says that even illegal aliens who don't pay taxes could receive tax refunds with Obama’s executive amnesty!"},{"comment_id":"834047250056984","commenter_b":"NO MORE ILLEGALS IN THIS COUNTRY ON WELFARE!","commenter_a":"Ladies and gentlemen, the next president of the United States, Donald Trump. Trump train all the way to the white house!!!! #trump2016","post_message":"Thank you Illinois! #SuperTuesday #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"10153513194301157","commenter_b":"Sorry kill traders Isis is out to kill innocent people that trader should lie down 6 feet under","commenter_a":"13 year veteran, can't trust anyone anymore!","post_message":"A Washington D.C. Metro Transit Police officer has been charged for trying to provide material support to ISIS."},{"comment_id":"10153342473651336","commenter_b":"The girl was mouthing off and ignoring him when he said get the hell away, if that was my daughter I'd slap the taste out her mouth, she wouldn't even have to worry about the cop.","commenter_a":"These cops are constantly thrown into situations where there are multiple combative people and ONE officer. Was he in the right or wrong? I don't know, but cops are constantly put in these dangerous positions as a part of their job.","post_message":"The video appears to show the officer using his knees to pin the girl face down, pointing his gun at other teens and cursing."},{"comment_id":"10154672636522994","commenter_b":"Not me Jonathon. I hate anything pumpkin","commenter_a":"Generalizing entire groups of people works both ways. Don't assume all black men are criminals, don't assume all cops are bad, don't assume all white girls like pumpkin spice, all black women are angry, all white men are drunks or that all Asians can't drive. Just be nice to other people.","post_message":"What started as a daughter's effort to plan a retirement party for her police officer father turned into so much more."},{"comment_id":"10153614097404199","commenter_b":"Victim or not, that was still unacceptable behavior. She tried to attack her! That lady could have just kept going.... BUT she chose road rage.","commenter_a":"That mom wasn't scared. She was pissed at the person driving recklessly. If she was scared, she could of pulled herself out of the situation at many different side roads and pull offs. She choose to keep following someone she new was driving aggressively putting herself and child in more danger.","post_message":"UPDATE:"},{"comment_id":"1595363807421142","commenter_b":"Hilary is a huge bitch","commenter_a":"Yes.///","post_message":"Hillary Clinton said today that Donald Trump's erratic temperament and lack of experience make him unfit to be president. Is she right?"}]
