[{"comment_id":"10155369881175389","commenter_b":"Hillary should run on a ticket with McCain. Both are so full of themselfs.....hint","commenter_a":"#ThaiJohnson the reason she doesn't look into the camera is the same reason a person lying to you can't look you in the eyes, she has that Obama syndrome can't stop lying and can't keep tract of the lies.","post_message":"Question of the Day: What do you think of Hillary Clinton's performance at today’s press conference? Tell us in the comments, and tune in to Fox News tonight at 10p ET for more on this story."},{"comment_id":"1809746189282784","commenter_b":"Why you wait until today to do this stupid you are old and stupid my God how a woman do these stupid thing","commenter_a":"Stupid stupid","post_message":"#LIVE VIDEO: Attorney Gloria Allred is holding a press conference with a woman who accuses Donald J. Trump of sexual misconduct."},{"comment_id":"1354157517952129","commenter_b":"Has Ann never looked in a mirror? She may be a skinny bitch, but look at that horse face of hers. Does anybody see the resemblance? She's got great hair, but hair can't cover up that horse face.","commenter_a":"Man Coulter is a vile excuse for a human being.","post_message":"Yes, really."},{"comment_id":"10153066110302144","commenter_b":"No, No, No, No, No... You're in OUR HOUSE!","commenter_a":"americans welcome kenya....that kind of hecklessness cant be accepted","post_message":"\"Listen, you're in my house. You're not gonna get a good response from me by interrupting me like this. I'm sorry. No, no, no, no, no. Shame on you. You shouldn't be doing this.\""},{"comment_id":"10153320376007042","commenter_b":"All five females was arrested","commenter_a":"That poor girl. I hope the person who attacked her gets arrested.","post_message":"A 17-year-old girl viciously attacked inside a Brooklyn McDonald's is speaking out about the brutal assault for the first time. @webpagelink"},{"comment_id":"480993755358552","commenter_b":"She must be from NYC she can go to hell","commenter_a":"Screw her","post_message":"This Democratic congresswoman from New York just announced her plan to reduce gun violence. I wonder how it will be received."},{"comment_id":"10153303118249203","commenter_b":"Beauty.","commenter_a":"That was an awesome episode!","post_message":"John Oliver made NSA whistleblower Edward Snowden crack on Last Week Tonight with John Oliver during a surprisingly contentious interview."}]
