[{"comment_id":"10158091047615293","commenter_b":"Even Medicaid charges copays now. Where before ACA it didn't.","commenter_a":"It can't be any worse, drug prices have more than tripled over the last 4 years, Not to mention blue cross going up and more than doubled their premiums over the past few years. Blue Cross gets 300 bucks of our paycheck ever other week, and that's our part the company matches that, you add that up. 1200 a month for family coverage.","post_message":"What will healthcare look like under President Trump?  Tell us what you think in the comments below."},{"comment_id":"10154267977076756","commenter_b":"Really?....Belgium. Some of the nicest people in Europe. There is no reason in these people. They just hate everybody. Sympathy to the Belgian people. I have visited your country and was impressed with your quality.","commenter_a":"So terrible...","post_message":"NPR is following the deadly attacks in Brussels. -- At least 30 people died in explosions at the airport and a metro station.  -- Some 200 were injured, including at least one U.S. service member and his family. -- ISIS has claimed responsibility for the attacks, and police released a photo of a suspect."},{"comment_id":"10154315697078984","commenter_b":"That whore needs to go to hell","commenter_a":"She DOES NOT HAVE THE AUTHORITY TO DO THIS. ALL WE NEED TO DO IS IGNORE HER. KEEP BUYING IT SHE WILL BE GONE IN 8 MONTHS","post_message":"Michelle Obama has been messing with our children's food for years, but now she's gone to far.  She just banned one of America's favorite cereals, and there's not a darn thing anyone can do about it.  It's time to throw her and her America-hating husband out of the White House for good."},{"comment_id":"10153904664428010","commenter_b":"Illegals deserve to be deported not unseat Americans for health care.","commenter_a":"Anyone who has ever worked in a hospital could have told you. So many before the ACA never would have qualified or been able to afford. Everybody in this nation deserves access to our health care system.","post_message":"California's version of Medicaid will test the power of the Affordable Care Act."},{"comment_id":"10153211085979087","commenter_b":"I am not afraid and I know no one who is. Though I support you Dr. Carson, you are wrong. Close the border to Muslims until we can sort all this out. Israel has it right, they profile and so should we.","commenter_a":"So I on board.","post_message":"\"We are losing this war while America looks and feels afraid at home,\" Dr. Ben Carson writes in an op-ed for The Hill. \"By the jihadists’ measure, they are winning. They have changed our country, created a republic of fear and, as Osama bin Laden predicted, his enemies are destroying themselves.\""},{"comment_id":"10155507784285405","commenter_b":"DO NOT LET the criminal illegal invaders take over our military .","commenter_a":"Karl Keyzer-Andre","post_message":"As we celebrate Armed Forces Day, I want to take a minute to honor and thank all our servicemebers and veterans for your sacrifice. America owes each and every one of you a great debt of gratitude."},{"comment_id":"10153853920168145","commenter_b":"Athena Marigold absolutely","commenter_a":"Athena Marigold it's in the paper","post_message":"#BREAKING A shot fired during a domestic dispute hit new father Brian Mortensen as he worked on a nearby fence. On Wednesday, he died."}]
