[{"comment_id":"10153058951371045","commenter_b":"send her to Hollywood she can act!! send to JAIL!!!!!!","commenter_a":"It seemed like a pretty fake cry to me, you know that baby was there just sorry she got caught!","post_message":" God. Oh God. I can believe I did that. Oh my God. My husband going to kill me. Oh my God! That's the reaction police body cameras caught when a frantic mother was confronted for leaving her 1-year-old daughter in a sweltering van parked in an Oklahoma Wal-Mart parking lot."},{"comment_id":"10154769907171509","commenter_b":"But but, the Internet thinks for us so we don't have to!","commenter_a":"People need to start doing a little research. If @username (the actor) was dead, it would be on every single news outlet. And @username's wife (Jada) is darker than Raquel (who is lighter) Sad I have to edit my comment because people are getting bent out of shape.","post_message":"Before he died, Will Smith was part of an 18-month Executive MBA program at the University of Miami. His wife, who was shot in the legs during the attack that killed her husband, received it in his honor."},{"comment_id":"1573408882718854","commenter_b":"These women are crazy to boycot her clothes. She is so classy.","commenter_a":"Please leave Ivanka out of this. She is a hard-working, talented woman, and her clothes are beautiful and affordable!","post_message":"Feeling the chill, Ivanka Trump?"},{"comment_id":"10154369386511545","commenter_b":"Imagine if someone came and ruined America and a civil war started. People killing and fighting everyone. Not everyone has the money to buy guns or the nads to pull a trigger. Hopefully that never happens but I am guessing people would try and leave, some in a hurry to wherever is better and closest....and hopefully don't get turned away at borders.","commenter_a":"Why, oh why, can't the pot stirrers understand the difference between LEGAL and ILLEGAL when it comes to immigration?!? The US was indeed made up of immigrants, and we love immigrants still, WHO COME HERE LEGALLY. And while I'm at it, why should we take in refugees WHEN WE HAVE NEEDY AND HOMELESS AMERICANS IN EVERY MAJOR CITY IN THE US? Let's give the CITIZENS all the benefits first. Why is that such a hard concept for some people? Seriously! Do you really think any other country in the world would put refugees AHEAD of its own citizens?!? No! Americans first, then help others. Just like in an airplane, put YOUR oxygen mask on first, then help the ones around you. Oy!","post_message":"The full commercial didn't appear on television during the big game after it was rejected by Fox. The full ad, which is nearly six minutes long, is available on the company's Twitter account."},{"comment_id":"1125811740844678","commenter_b":"That is one crazy bitch!","commenter_a":"Am I dreaming?! Bernie supporters BOOED Nancy Pelosi?! Well, YAY! Be still my trembling heart! It couldn't happen to a \"nicer\" Democrat...except for ol' Hillary!!","post_message":"Hard not to enjoy this"},{"comment_id":"10152831288276636","commenter_b":"Terrible woman screaming like that I'm glad she was sacked","commenter_a":"If it doesn't affect your pay don't let it affect your day let star bucks hire security you getting pay regardless you sell coffee and straw LESSON \"I WILL NEVER BE JOBS WORTH AGAIN\"","post_message":"\"Give me the straw, give me the straw, give me the straw, give me the straw... call the cops.\""},{"comment_id":"10154121489376350","commenter_b":"She's wearing lipstick","commenter_a":"Can we ignore the makeup issue for a second and talk about the fact a 42-year-old just wrote a book telling us how to age? 42? Girl, you've only just begun to age, check back in your 60s and we'll talk.","post_message":"Gorgeous, Cameron Diaz!"}]
