[{"comment_id":"1741083142832713","commenter_b":"She plagiarized!","commenter_a":"Keeping it classy!","post_message":"\"On July 28, 2006, I was very proud to become a citizen of the United States – the greatest privilege on planet Earth.\"  Melania Trump, wife of presumptive GOP nominee Donald J. Trump, spoke about her pathway to U.S. citizenship and thanked veterans who protect the freedoms we enjoy as Americans. @webpagelink"},{"comment_id":"10153605944168984","commenter_b":"No more abortions no more planparnthood","commenter_a":"My niece had a baby at four months completely formed , she is still so sad about it death , they held and took pictures. I don't know how this is not murder in the womb ? Cause a abortion is! !!","post_message":"Even with all evidence going against them, Planned Parenthood keeps on coming out with one unbelievable excuse after another.  Do you think it's time to defund and get rid of Planned Parenthood?"},{"comment_id":"982872948473970","commenter_b":"These people are what is wrong with America! I can't wait for them to occupy Canada","commenter_a":"these are the hate american soros funded kids who still live at home and hacve ebt cards and dont pay for health insurance..","post_message":"DEVELOPING: Leftist Radicals in New York City and Arizona launching anti-Trump uprisings...TRUMP PROTESTERS BLOCK ROADS TO PHOENIX RALLY....MORE..."},{"comment_id":"1724833864402419","commenter_b":"We're going to drive one right up that midgets rectum","commenter_a":"Hey its cool. He's just demonstrating our first amendment rights. Lol","post_message":"NKorea claims could wipe out Manhattan with hydrogen bomb..."},{"comment_id":"883919521667797","commenter_b":"newsflash, genius. there's a bunch of dumb females already in ISIS.","commenter_a":"no female should be deployed where isis are, you are just asking for trouble.","post_message":"Kayla Jean Mueller, 26, traveled the globe fighting genocide, AIDS and domestic abuse."},{"comment_id":"1215709481782562","commenter_b":"Women's bathrooms are disgusting. Humans are disgusting.","commenter_a":"Seriously, why do women or trans, want to share the bathroom with the male species. The mens washroom is disgusting and I hate going into them myself. Please end this, men for men, women for women.","post_message":"Spotted at the Canadian National Exhibition in Toronto...   (Photo: Joshua Ostroff/HuffPost Canada)"},{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. \"We hope and pray the U.S. Coast Guard is able to bring Samantha home.\" @webpagelink"}]
