[{"comment_id":"678910242299554","commenter_b":"She needs to ban herself and all the other idiots","commenter_a":"She has no authority to actually ban anything.","post_message":"You'll never believe what Michelle is trying to ban now... Ridiculous. She has no right and no authority to do this. Should we kick Michelle out of the White House?"},{"comment_id":"10153875712703128","commenter_b":"Natalie Grace","commenter_a":"my iphone 6s lpus battey has not died on me. it has lasted me all day every day. they increased the battery life so if people are having problems then thats off","post_message":"With its entry into the battery case market, Apple finally admits that heavy iPhone users could use more juice. Its solution also fixes many of the issues present with third-party cases."},{"comment_id":"1587336334908184","commenter_b":"Fire HER butt.","commenter_a":"Can't stand her anymore. She is a petty, spiteful, conspirator.","post_message":"Should Fox News FIRE Megyn Kelly? YES OR NO:"},{"comment_id":"928579767188091","commenter_b":"and by the time the police come the dog is probably dead by then.","commenter_a":"Whenever you take justice into your own hands you're committing a crime, call the police that's what they're there for and that's what we pay our taxes for, if we didn't pay the taxes to have those brave police officers do their jobs and we all win that round doing vigilante justice what we paying taxes for","post_message":"Charges against the veteran who was arrested for breaking a window to save the life of a dog left in a hot car have been dropped: on.hln.tv/2QzbEY"},{"comment_id":"10154396026094714","commenter_b":"Hey woman need your number","commenter_a":"Angie Slater.... awesome words for you","post_message":"\"A strong spirit transcends rules.\" — Prince #RIP"},{"comment_id":"1813669392186653","commenter_b":"I believe the only way to stop 5.O Is to kill em all Or stop bitch in, the popo gotta Gun n they Evil law,,Bt every nigga in the hood can shoot back,so kill em before they kill one u","commenter_a":"America you're gone so far.","post_message":""},{"comment_id":"10154660299872501","commenter_b":"She can work anywhere in these United States.","commenter_a":"So she can be a lawyer not a judge cool.","post_message":"We reached out to Angela Stokes today to ask about her future legal plans. If she responds, we'll add her comments to the story."}]
