[{"comment_id":"10154486445542994","commenter_b":"There is no male. It is a transgendered woman.","commenter_a":"they beat his anus","post_message":"Courtney Purvis says she was attacked outside of a bar in Dearborn because she identifies herself as transgender."},{"comment_id":"10152884468574877","commenter_b":"Happy birthday you beautiful queen","commenter_a":"Happy Birthday!!!!!","post_message":"We are wishing Lupita Nyong'o HAPPY BIRTHDAY today!! The Academy Award winning actress received her masters degree in acting in 2012 from the Yale School of Drama and in 2014, she was named \"The Most Beautiful Woman\" by People and \"Woman of the Year\" by Glamour. LIKE and SHARE to celebrate!! >>>@webpagelink"},{"comment_id":"962643217106352","commenter_b":"all i can say is zombies! now we have to worry about zombies crossing the border, thanks south America.","commenter_a":"Freaky.","post_message":"A family in Honduras that claimed teen was screaming from inside her coffin have made international headlines with their actions."},{"comment_id":"10158427550135093","commenter_b":"I watched a movie recently where this woman wanted to sing and thought she could sing. Because her husband was somewhat affluent she sang in get togethers and everyone fawned upon her and let her believe she could sing. Eventually her delusion became so bad that she wanted to pursue more public and aggressive venues for her singing. A doctor stepped at her husbands request, and decided to record her and play it back to her so she could be faced with the reality of her own voice. Alas, upon hearing it. . .she dropped dead.","commenter_a":"Ye are away with the fairies so ye are","post_message":"Over the line. Katherine Timpf sums it up as only she can."},{"comment_id":"10154352514741523","commenter_b":"Are you ready for that wall","commenter_a":"And there's Putin Ridin Trump or the other way around","post_message":"\"He's not a bad man. But his ignorance is so profound, so profound.\""},{"comment_id":"10153079471709411","commenter_b":"Pakistan is terrorized from within, same as we are from the west.","commenter_a":"I wonder if this drone terrorised the inhabitants of the White House as much as US drones do to civilians in Pakistan?","post_message":""},{"comment_id":"1676227239104065","commenter_b":"What a pig","commenter_a":"Suck it buttercup had your crap 8 years give us 4","post_message":"How classless can you get?"}]
