[{"comment_id":"10154432155426509","commenter_b":"she is a liar","commenter_a":"In the end, She got voted because of her gender. Not saying she is bad, she is decent candidate but this woman thingy got to stop if she truly want to become a great president.","post_message":"\"In my second century, I look forward to seeing a woman president.\" She's 102 years old, and she turned out to her Iowa caucus to support Hillary Clinton: @webpagelink"},{"comment_id":"987975737904514","commenter_b":"obitch isn't happy unless she's ruining things for chidren","commenter_a":"She has no Constitutional authority at all...why do we allow her interference in our schools, homes and communities?","post_message":"Michelle Obama wants to BAN HALLOWEEN!"},{"comment_id":"10154071724086320","commenter_b":"she is an amazing woman with a wonderful gift of talent","commenter_a":"I loved it","post_message":"Watch and see why everyone was crying after Kelly Clarkson's emotional performance on last night's \"American Idol.\" @webpagelink"},{"comment_id":"10154047857863855","commenter_b":"Fake, phony and fraudster. Being a lesbian gave her no special privilege to ripoff people","commenter_a":"Bet she didn't see that coming!?","post_message":"RIP Youree Harris."},{"comment_id":"10154166342376717","commenter_b":"FUCK HER","commenter_a":"I think Caitlyn is a fake I mean if she was a true Transgender she would've turned her back on trump a long time ago","post_message":"The transgender reality star and former Olympian is believed to have accepted the invitation and is looking for a plus-one to accompany her."},{"comment_id":"10153424220937106","commenter_b":"If it happened in my county, I'd make the complaint myself and have no problem with people putting one in their yards, on their business , our at their church. It just doesn't belong on government property.","commenter_a":"Would be interesting to know if the person who contacted the anti God group has neighbors with these signs in their yard! Can only hope!!","post_message":"It is outrageous that some would aim to divide a community over a banner that has been proudly displayed since Sept. 11, 2001. I commend the Pittsburg community for rejecting this decision and I stand with them. The Constitution guarantees a right to freedom of religion, not freedom from religion. This banner is not only an expression of faith, but of love for country. Expressions of patriotism, faith, and community should be welcome in our society and I have contacted USPS officials to express my concerns about their decision and to request their reconsideration. If the local post office branch is unwilling to display the banner, then I would be proud to hang it at my own office in Pittsburg."},{"comment_id":"10153903187059218","commenter_b":"Criminals don't need a registration.","commenter_a":"California has registrations, tests, waiting periods, magazine limits and \"Assault Weapons\" ban how is this possible?","post_message":"Police confirm fatalities in the shootings at a San Bernardino, California, social services center. Follow updates on 11 News at 5:00 and online here >> @webpagelink"}]
