[{"comment_id":"10153644040068967","commenter_b":"Yeah but women can not, not without getting sexually harassed","commenter_a":"Common place in Denmark as well. Alone and in school groups. Take your pick.","post_message":"Japan is awesome"},{"comment_id":"10153457248972464","commenter_b":"0NE VOTO OVER 2/3 DO OK DEAL (WE THE POEPLE DO) WILL KICK YOU OUT IF YOU VOTO FOR IT NO RETIREMENT PUT YOU IN obamacare !!!!! TRUMP 12016","commenter_a":"Ted, this is one thing that you are exactly correct on !","post_message":"The #IranDeal is a catastrophic mistake. Help stop it: @webpagelink"},{"comment_id":"10156555816055354","commenter_b":"A radical muslim wants to kill you. A moderate muslim wants a radical muslim to kill you.","commenter_a":"Wake up and smell the coffee.","post_message":"This is what we're up against, gang..."},{"comment_id":"10155757237589062","commenter_b":"I guess your mother didn't raise you right then. I bet she's proud of the rude, ignorant, pathetic little girl you are.","commenter_a":"Congratulations PRESIDENT TRUMP! Glad our electors upheld THE VOICE OF THE PEOPLE.","post_message":"BREAKING: Donald Trump surpasses 270 votes in Electoral College to formally win presidency. @webpagelink"},{"comment_id":"10154274574160329","commenter_b":"Grace Lee Justin Bloch","commenter_a":"Gabriel Cortez","post_message":"OMG!!!"},{"comment_id":"869870296383645","commenter_b":"I got bad news my greatgranddad was a yankee from OH I;m from KY. I know the war was over states rights","commenter_a":"My family were Union all the way but I have no qualms about the Confederate flag.","post_message":"\"In a free society, offensive speech should not just be tolerated, its regular presence should be celebrated as a symbol of democratic health.\""},{"comment_id":"549834655207114","commenter_b":"These women are child abusers. Where is child protection?","commenter_a":"Yes !","post_message":"These two lesbians are trying to play god with their son. This is the world we are living in today. Do you think this is wrong?"}]
