[{"comment_id":"573866436115635","commenter_b":"She'll stand before God. Wouldn't want to walk in her young shoes","commenter_a":"Jennifer who?","post_message":"She's the biggest actress in the world right now, and Jennifer Lawrence has made an absolutely sickening statement about Christians. This is enough for me to want to boycott her movies from now on."},{"comment_id":"579001232257569","commenter_b":"THIS HAS ALWAYS BEEN A PROBLEM FOR A LONG TIME ITS CALLED THUGS AND OUTLAWS IN CHICAGO.THIS STARTS AT HOME WHEN THESE THUGS DO NOT HAVE A FATHER TO SHOW THEM THE WAY.THINGS WILL NEVER CHANGE IN CHICAGO WHEN YOU HAVE WOMEN THROWING THERE LEGS UP TO ANY MAN WALKS BY FOR MONEY.IT WILL NEVER CHANGE. THEN THE MEN WALKS OFF AND FINDS ANOTHER ONE TO KNOCK UP.THE WORLD KNOWS ABOUT THESE PEOPLE.ITS LIFE IN CHICAGO.","commenter_a":"What a joke","post_message":"BLACK LIVES HYPOCRITES! Gun-Controlled Chicago: 21 Shot, 1 Stabbed, 1 Dead In 24 Hours Amazing they can unite and riot for TRUMP but can't for the constant murders and shootings plaguing THEIR community! IF you are pissed off LIKE AND SHARE THIS!"},{"comment_id":"10154913521679714","commenter_b":"In the end you can have Nina Dobrev","commenter_a":"Happy the way God made me.","post_message":"This is what \"the most desirable face in the world\" looks like."},{"comment_id":"10153081703864024","commenter_b":"AMEN!!! Don't let these racist win, because all the cops are going to do is profile and stop people that are poor or of color","commenter_a":"Mayor wrong direction","post_message":"The mayor made clear he's not planning a return to stop & frisk policing, saying “Going back to an unconstitutional, alienating approach is not only inappropriate and unfair to the populace, it doesn’t work.\""},{"comment_id":"10153231905295047","commenter_b":"Obama must be stopped, or the Supreme Court is complicit in his wrongful actions.","commenter_a":"Qut saying it, DO IT.","post_message":"When President Obama circumvents Congress to rewrite the law, he's acting more like a king than a President. His illegal Executive overreach must be stopped. Sign and Share our Supreme Court brief to take action: @webpagelink"},{"comment_id":"10153416798099060","commenter_b":"I think they should be sent back to Africa. If they are fleeing Africa for political reasons, or because they fear for their lives, then and only then might they have a valid claim to stay in Europe. But if they're just fleeing because they're poor, they should move to Europe legally, or simply make the best of what they've got in Africa. Tough titties. That's just how the world works.","commenter_a":"never mind the consequences huh i bet those negotiating got paid well with plenty of overtime","post_message":"153,000 migrants have crossed into Europe this year alone, an increase of 149% on 2014. Yesterday, after seven expletive-laden hours of debate, European leaders forged a disappointingly modest resettlement agreement. @webpagelink"},{"comment_id":"1488225507869622","commenter_b":"LOSER !!!","commenter_a":"Good should have done that long time ago","post_message":"HAHA! He's FIRED!"}]
