[{"comment_id":"10153031093836037","commenter_b":"Whore....","commenter_a":"Heck, sue playboy, or your parents. smh She should have been in school...","post_message":"Lawyer says he has evidence @BillCosby wasn't at the Playboy Mansion at time of model's alleged abuse: @webpagelink"},{"comment_id":"1189205214435858","commenter_b":"Go suck or the black dicks racist bitch","commenter_a":"Look black on black crime is the number death rate among blacks! They need to talk to each other. They also need to fix their family unit, that's how young kids make it in life!","post_message":"#BlackLivesMatter were not happy with this speech"},{"comment_id":"10154221702747629","commenter_b":"I'm sorry about your kitty.","commenter_a":"Donald will make America great again! Even if he has to do it all by himself! This is what REAL LEADERSHIP looks like libturds!","post_message":"Donald J. Trump promised to “do it by myself” if squeamish party elders refused to get a grip on the hard job ahead."},{"comment_id":"1692899604103495","commenter_b":"She is a skank","commenter_a":"Chelsea Clinton is the poster child for white privilege.","post_message":"She CANNOT be serious."},{"comment_id":"506998642821762","commenter_b":"I'd say a feminist who pees themselves might be drunk.","commenter_a":"Well, that has to be uncomfortable. Only a mental moron would pee themselves. I'm telling you, libs are retarded.","post_message":"How stupid can some people be..."},{"comment_id":"1090370634418986","commenter_b":"@username lol nah it's the bitchy women that make good men run from all women.","commenter_a":"The man is my younger brother and this girl is a psycho. She broke into his house, they WERE engaged but not living together, and she stole $2.1 MILLION worth of jewelry. And this stuff happened AFTER he paid off her house and bought her a business, (just a nail salon). My brother was married for over 20 years and his x will tell you just as I will that he is the most laid back and passive guy you'll ever meet. She sent the jewelry to her parents via UPS and now they're in just as much trouble. The stolen merchandise was never recovered","post_message":"This woman has said her ex-fiance hit her, causing a black eye and other injuries. But now his attorney says this home surveillance video tells a different story.  It's the latest round in a legal battle involving allegations of millions of dollars in stolen jewelry that's unfolding in a Bay Area courtroom: @webpagelink"},{"comment_id":"10152713958671051","commenter_b":"Note, Date women closer to your age.","commenter_a":"Be careful in what you want!","post_message":"A 69-year-old man thought he and his 17-year-old girlfriend had something truly special. You can probably guess how this story ends."}]
