[{"comment_id":"10152763408026717","commenter_b":"Let's threaten to slit the throat of little bitches, see how this Bitch feels","commenter_a":"Hes gay as well !","post_message":""},{"comment_id":"1305307819486565","commenter_b":"#DUMPTRUMP NOW!","commenter_a":"TRUMP will have them shot, Obama let them make it with their lives. He's already making plans for Paul Ryan, he has ties to the Mafia and will use them. They will have to get rid of Trump.","post_message":""},{"comment_id":"977500405643041","commenter_b":"this picture says it all.their only destination is here.sorry no we have enough.","commenter_a":"oh deer what did they exspect no room left in britain","post_message":"Refugees are sleeping on rocks because France won’t let them in"},{"comment_id":"10153055222394877","commenter_b":"Wrong! I've awakened with someone riding on my dick..The dick can get hard without you even knowing it... while you're asleep. Duh. Ever heard of a wet dream!","commenter_a":"Rape is rape, no matter the gender of the rapist and they all should get equal servere punishment. She deserves more than 9 months tho.","post_message":"Mother of 3 arrested for breaking into a man's apartment and raping him while he slept. Grio fam, if she was a man do you think her sentencing would have been more severe? Sound off below!"},{"comment_id":"1722122661395846","commenter_b":"White people'n 😂😂😂😂😂😂😂😂","commenter_a":"Just White people..White people'n","post_message":"What...is...this?"},{"comment_id":"10154154613245124","commenter_b":"Shut the phuck up you nasty pig!!","commenter_a":"We are going to be living in the USSA if we don't get these people out of office","post_message":"\"[The media is] adamantly opposed to an economic nationalist agenda like President Donald J. Trump has,\" Steven Bannon says at conservative conference on Thursday."},{"comment_id":"10153117067891350","commenter_b":"Lil cunt","commenter_a":"Abbey Maclean","post_message":"This is just too cool! Watch our own Natalie Morales transform into a zombie for The Walking Dead."}]
