[{"comment_id":"10152643081825496","commenter_b":"Sadly, it's the day and age were in. My mother died of ALS in June 1973 but was in the hospital and out many times and was never denied care. In fact she spent the last 3 months of her life in the hospital and had her nightly beer with my dad. Hopefully at some point in time they will get it figured out but sadly will probably not happen in my lifetime.","commenter_a":"That's exactly how they work. They deny, deny, deny until the person /family gives up hope. It is terrible how these people can get away with stealing/withholding money that these precious people put in and need.","post_message":"A few weeks ago, 11Alive shared the moving story of 42-year-old Melissa Kern. She had been battling ALS for almost a decade, and had reached a point where she could only move her eyelid to communicate. While she fought the disease, her husband Chris struggled to pay the bills, getting nothing from Social Security for disability benefits. Bill Liss 11Alive took on the case. They succeeded. Tragically, it was too late. See more: @webpagelink"},{"comment_id":"10153761021059749","commenter_b":"yep! so that they can have all to themselves the beautiful beaches built in Arabian countries by Europeans and practice their 72 virgins rapping galore practices eh?","commenter_a":"There is a simple way to stop ISIL. Kill them, kill their supporters, and don't stop killing until they are neutralized. Chivalrous rules of war are for opponents who will reciprocate. Virtue without reward is foolish. This is NOT a US problem. If the Muslim world objects to ISIL they have one, only one, way to show it. Kill them. That's what war is for. ISIL are winning because they have the guts and the passion (to borrow an Oriana Fallacci phrase) to stay in the fight. Their opponents lose because they are weaklings.","post_message":"\"The glories of Syria are now off-limits to Western visitors, reduced to rubble by Assad and Isil. Now Egypt may suffer a similar fate.\""},{"comment_id":"1232367160117626","commenter_b":"You aren't a fan of any carnivorous animal? LOL ok.","commenter_a":"Killing for fun. \"End of the moral analysis\" The \"arguments\" of the article are pathetic. \"let’s not forget that wildlife reserves can also kill lions.\" Oh, right, I had forgotten that in this world, \"I'm not the only one to do bad\" is considered an argument. I'm not a fan of any carnivorous animal, but if you decide that they're a problem, you'd better come up with solutions that are more ethical than their own actions.","post_message":""},{"comment_id":"860854230637940","commenter_b":"Of course she will say that. She wants slobamas endorsement.","commenter_a":"kick her ass out of the US too","post_message":""},{"comment_id":"473987716059156","commenter_b":"If MUSLIMS want kids to learn about Islam they should move back to the HELL HOLE they came from. In America we believe in separation of religion and state.","commenter_a":"all our schools should ask God back in to their teachings","post_message":"Muslims are up in arms about this new bill affecting religion in schools in Tennessee. I wonder how far they'll challenge it."},{"comment_id":"532815796909000","commenter_b":"Shut up lady","commenter_a":"STOP THIS.........these are two little girls that are living under the worst conditions possible at this time............leave them alone. Can you imagine how hurtful your stupid post are to them? They are teenagers.........they don't need their friends or the public to read your lies and innuendos. The site the the Patriot should be burned at the stake........stop your disgusting posts and leave innocent people alone............","post_message":"The White House is in uproar after Obama daughters caught doing THIS. This is outlandish. These are the daughters of our president. Would you vote to kick the Obamas out of the White House?"},{"comment_id":"10153321709602217","commenter_b":"shes dissolving the trends in the fashion world","commenter_a":"Nigeria is looking for their 2016 budget","post_message":"She's fronting a campaign called the \"Face of Courage\"."}]
