[{"comment_id":"640100692862928","commenter_b":"Trolls- in 4 years we have elections again- what if next time the candidate you don't like cheats to win? Will you be OK with a corrupt election system then?","commenter_a":"THEY HAVE A RIGHT TO TRY TO STOP IT JUST LIKE YOU THINK YOU HAVE A RIGHT TO DO IT.","post_message":"The fight for #Recount2016 continues! We deserve a voting system we can trust, that is accurate, secure and just. Despite the sabotage, political cronyism, bureaucratic hurdles, economic extortion, and legal maneuvering that has been thrown in our way, this historic first-ever multi-state presidential recount carries on. I'm here to give you the latest updates, answer your questions, and talk about next steps."},{"comment_id":"10152920340851051","commenter_b":"What we can't stand u either ghetto bitch","commenter_a":"Sad part is my son is mixed with white......I wish I could do magic and make that part of him disappear.........cant stand white racist mtfhs","post_message":"This woman decided to break up a fight by taking out her gun and shooting into the crowd. The problem is, her son was in the crowd."},{"comment_id":"653257648132607","commenter_b":"I agree. Fuck Kim Kardashian! She is trash.","commenter_a":"So a woman who's apparently famous for releasing a sex tape of her getting pissed on gets robbed of 10 million dollars worth of jewellery. Who the Fuck cares.?","post_message":""},{"comment_id":"590770071125294","commenter_b":"Now if these douche bags will leave they know where their bread is buttered.","commenter_a":"They have money! They can easily move wherever they want, away from old bigot Trump and his supporters.","post_message":"Remember the celebrities who said they would leave the country if Donald J. Trump was elected president... @webpagelink"},{"comment_id":"988508257851300","commenter_b":"what a women feel when do this?","commenter_a":"Back before social media, women's magazines used to use this as a rule of thumb for whether you could get away with going braless (if the pen falls, you can ditch the brassiere. if it stays, strap 'em in.) Which would be shaming in the other direction, by today's standards, I guess?","post_message":"Why #Underboobchallenge is going viral."},{"comment_id":"932284180186448","commenter_b":"illegals has no rights go back home and come back legally.","commenter_a":"This is DO or DIE, America!!! We need Trump in the Oval immediately! He will fix this mess Obama has put us all in and we so desperately need him! I'm voting Trump 2016!!! Who's with me?!?!","post_message":"\"We have to stop with political correctness! We have to create a country that won’t have people flying planes into the World Trade Center and stop the shooting in California. If you can’t use the terms “Islamic terrorism” you can’t solve the problem.\"  #TrumpTrain #GOPDebate"},{"comment_id":"10153984542943690","commenter_b":"Stop stealing their land and tell the settlers to gtfo","commenter_a":"he knew the house would be demolished. he was selfish and brought it upon his family. The others thinking of attacking us should see this before they do anything they will regret","post_message":"\"Muhannad was killed but why do you have to destroy a house belonging to six others...what about the children and his elderly relatives?\"   @webpagelink"}]
