[{"comment_id":"10152774559661051","commenter_b":"He Should criticizing Christians when so many muslims are creating problems all around the world.","commenter_a":"Rot in hell.","post_message":"President Obama says Christians should stop criticizing Islam because \"people committed terrible deeds in the name of Christ.\" And he didn't stop there."},{"comment_id":"10153004550474411","commenter_b":"U shts invaded our lands. Ur the problem.","commenter_a":"ban the Muslim black garbage bags","post_message":""},{"comment_id":"10153258132214342","commenter_b":"Black man created their selves!!","commenter_a":"Why when cops kill a black man he is justified but when a black man kill a cop he is a coward .. I said this before black man was going to start doing the cops the same way they are doing them ... And it happen .. Sad for this man family. but this what these cops created in the black man","post_message":"An intense manhunt is underway for a 29-year-old man police say murdered a Memphis cop. Officer Sean Bolton, who's a former US Marine, was gunned down when he interrupted a drug deal that would have resulted in just a misdemeanor citation."},{"comment_id":"10152954324555399","commenter_b":"Well, they're not mutually exclusive qualities. A weasel can both **** others and have harmful effects, especially the more gradual and subtle kind.","commenter_a":"McConnell is a pernicious weasel. Reid will get even.","post_message":"An extraordinary act of trolling:"},{"comment_id":"1002013776554647","commenter_b":"I dont think Buying Sex is a Game Changer Anymore. Lets get Real Here. You got a Lunatic Acting Like Hitlers Twin Brother Running and Thats Ok? Buying a Hooker is somehow More Repulsive?","commenter_a":"Intriguing.","post_message":"It sounds like this information could definitely ruin a campaign -- and it WILL be released."},{"comment_id":"865465356933659","commenter_b":"But you DIDN'T worry when YOU went after Trump. NOW you're worried? I guess the old Texas saying is true: Your alligator mouth over loaded your mocking bird butt. TUFF SHIT. DEAL WITH IT.","commenter_a":"Oh, please. She'd do just about anything to Mr Trump to denounce him. You need another job, or stop putting your own opinions on your show. Get a life. I used to like you, but I'm not a fan of yours anymore","post_message":"Megyn Kelly tells Mediaite she worries that “someone’s gonna hurt me in the presence of my children.”"},{"comment_id":"10153822220001162","commenter_b":"She needs to die a horrible death","commenter_a":"Her parents must be very proud of how their daughter turned out.","post_message":"BUSTED: The \"Baby Doll\" drug lord, Ana Marie Hernandez, is arrested in Mexico for allegedly running a cocaine pipeline to Chicago --> @webpagelink"}]
