[{"comment_id":"10152817094974877","commenter_b":"I agree zimmerman was guilty as -ell. But this woman is even more guilty if you research her case. I feel sorry for the next man she meets. She'll kill the next one for sure.","commenter_a":"This is crap! This woman should be allowed to live her life....she didn't take a life...meanwhile George Zimmerman roams free! This is why it is important, people, to vote - local elections affect you more than national elections....VOTE, VOTE, VOTE!","post_message":"Marissa Alexander is officially a free woman, delivers powerful statement to reporters. Read the details of her release below.  Grio fam, will Alexander's case inspire more changes to Florida law?"},{"comment_id":"10155108703501320","commenter_b":"Take a good look at the non Christians. What ever you do this the least of theas you do to me","commenter_a":"No one, has the right to decide about the live of a anborn child. Every one has the right to live and be loved","post_message":"WATCH LIVE: We're at the The March for Life where thousands of anti-abortion activists are marching on Washington."},{"comment_id":"1354339577942641","commenter_b":"Education, do u have?","commenter_a":"I f*****g hate Islam.","post_message":"Behold the peaceful religion..."},{"comment_id":"10153700840423812","commenter_b":"She just mad cause she can't have a slice lol","commenter_a":"Some one pls buy these ppl a cake.","post_message":"Couple married for 60 years eats a piece of their original wedding cake every anniversary. They store cake in a coffee can, and moisten it every year with brandy before eating another piece. @webpagelink"},{"comment_id":"10155927830195354","commenter_b":"Donald Trump is going to be the next President...you can take that to the bank...","commenter_a":"Why don't they read these polls, it's too obvious to conservatives like me. Do I trust Trump, not totally, but I do more than most of the GOP minus Ted and Rand. Let's get this country back conservatives, go Trump","post_message":"When over half your voters don't feel like you're looking out for them..."},{"comment_id":"10153061426624411","commenter_b":"In prison in U.S. A child killer is gang raped and beat to death they hate child killers !","commenter_a":"Well it sparred prisoners a job of having to kill her. Deserves to die child killer!","post_message":""},{"comment_id":"10153805945213908","commenter_b":"@username While I agree you should be happy with your body, I suggest that this woman is also happy. Some tall women are naturally thin thighed.","commenter_a":"again...give this skinny woman some food...why do all naked women have to be super skinny ???","post_message":"A very powerful message here."}]
