[{"comment_id":"10153871207061336","commenter_b":"No dear, Hillary Clinton was First Lady, a US Senator and Secretary of State. This little nobody was never anything close. Glad to help you. Leave the comedy to the professionals.","commenter_a":"This little nobody from Arkansas with no job is still making noise? LOL!","post_message":"\"That's one of the frustrating things about this president – he always tries to make it that he has the moral authority and everybody else is wrong.\" This morning on \"FOX & Friends Weekend,\" presidential candidate Mike Huckabee slammed President Barack Obama's approach to policy disagreements. @webpagelink"},{"comment_id":"1085364771487531","commenter_b":"If we accept refugees we are accepting criminal cause that what they are disguised Isis Islam radicals","commenter_a":"Thanks governor for taking s stand To no refugees","post_message":"I appreciate our Gov. Nathan Deal taking a bold stand on this issue. We must secure our borders and know who is entering our communities. #gapol"},{"comment_id":"1084079061644582","commenter_b":"Isn't she too powerful to jail?","commenter_a":"Says the rich woman","post_message":"\"Wall Street can never be allowed to threaten Main Street again, no bank can be too big to fail, no executive too powerful to jail,\" says Hillary Clinton during Nevada victory speech. @webpagelink"},{"comment_id":"1122225431128139","commenter_b":"@username, but I'm sure you was just fine with the Buch admin. Why is it Republicans always try to impeach every Dem president, I gurantee if Hillary wins they will spend her whole time as president trying to impeach her. Why don't they try doing something for the citizens of this country.","commenter_a":"As I read people's comments, I am again dismayed at the length to which the left will go to deny the FACTS.. the info came form a FOIA request. these arent conspiracy documents....they are FACTS... I know..the left loves to discount facts...they can be pesky......","post_message":""},{"comment_id":"10154415286659445","commenter_b":"I don't know I live in a 3 family Black family on the first floor Hispanics on the second & Im Italian but white on the third","commenter_a":"woah?!?!?","post_message":"WCVB presents a town hall meeting on #RaceInBoston in partnership with The Boston Foundation. Watch on WCVB and share your comments below. @webpagelink"},{"comment_id":"10153855884068606","commenter_b":"Kate shut the f*ck up! You weren't there!","commenter_a":"... Y'all can reply as you will.... This man had \"cocaine toxicity.\" He could have easily had a heart condition from drug use or other undiagnosed heart problem and he did cocaine. He was assaulting other people, he was violent and breaking the law. He was high. He required restraint. How about don't do drugs and hurt people and then you probably won't die in police custody?","post_message":"JUST IN: Death of man in custody of security guards at D.C. apartment complex ruled a homicide: @webpagelink"},{"comment_id":"1352088188153471","commenter_b":"So Trump is going to run the country so great but can't keep tabs on his own tower? ( a case he was guilty in) it's not even about that though, it's more his hypocrisy and saying he'll bring jobs back when he's hiring illegals.","commenter_a":"This showed me how Cruz an rubio are like.senators who are liars.Trump is the only one to make America great again.","post_message":"One word: FINALLY."}]
