[{"comment_id":"10153492592416336","commenter_b":"Lol, I guess I won't state the obvious...","commenter_a":"No that's not okay, nor professional. What is okay is to speak to the parents and ask them to remove the child until he or she is calmer.","post_message":"Darla Neugebauer, owner of Marcy's Diner, said she’s not sorry for yelling at a 21-month-old for crying in her restaurant because it got the girl to be quiet.  Is it okay for a restaurant employee to yell at a child?"},{"comment_id":"10155816958010354","commenter_b":"GOD gave some ladies a bushel of beauty and a teaspoon of common sense.","commenter_a":"What a cruel thing to say","post_message":"Desperate..."},{"comment_id":"946732062040088","commenter_b":"Right. Because all those women raped enjoyed it. *eyeroll*","commenter_a":"If you don't want to get pregnant that is a choice. If you don't want to get pregnant, don't have sexual intercourse. There's other ways to find physical satisfaction than sexual intercourse & they won't create a baby. Abortion IS NOT a means of birth control. It's murder. For those who are for abortion as a woman's choice, what about the choice of all of those female babies that have been aborted?","post_message":"So true."},{"comment_id":"10153830910205695","commenter_b":"Unfortunately he's correct. Totes second ship found some things in the ocean that they believe belong to el faro","commenter_a":"It's obviously on the bottom of the ocean.","post_message":"Loved ones aren't giving up hope, despite a life ring being found."},{"comment_id":"497111050479475","commenter_b":"She's a sellout to her own race, taking everything that white people gave her, and then spews her racist anti white nonsense to make blacks think she actually cares about them.","commenter_a":"She described racism other countries not ours.","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy.  She's the biggest racist we know, and we won't stand for it.  Do you agree Oprah is racist?"},{"comment_id":"10157007310710354","commenter_b":"Arrest her. There is no such Allah.","commenter_a":"Could she be a worse POS?","post_message":"Here's the deleted TWEET..."},{"comment_id":"1011931832233204","commenter_b":"They don't really care about fetuses either. If they did, they'd be storming fertility clinics, demanding that leftover embryos be implanted in someone's uterus. No, this whole thing is about controlling women.","commenter_a":"The Republicans & Right Wing Christians are trying to take woman back to the 50's. Women should know their place, sit down & shut up.","post_message":"After seeing all the pro-lifers cheer the attack on Planned Parenthood yesterday, it's time to remind ourselves of how they really feel about human life.  Image by Occupy Democrats, LIKE our page for more!"}]
