[{"comment_id":"10152826329111130","commenter_b":"Women are a different race?","commenter_a":"Arrogant and controlling and not smart enough yet to hide it. Did anyone else who watched this wonder whether he would have shushed a male reporter?","post_message":"Unbelievable."},{"comment_id":"10153189678699342","commenter_b":"Its just a restrainin b device the kid will learn to be still nithing wrong here ppl get upset about anything ive had to ohysically jold my 18 month old down to get his shots this would have been better","commenter_a":"There is the option of oral sedation.","post_message":" couldn see my kid in the body bag just strapped down to the bed, I couldn handle it.\"  A man heard his daughter screaming during a dental checkup and then found her like this: Restrained in place with a device known as a \"papoose board. It's legal for dentists to use them."},{"comment_id":"10153311857346323","commenter_b":"It's an attempt at humour, not political analysis. Lighten up.","commenter_a":"Guardian is now as bad as the Daily Mail , completely biased with dumb pointless analysis , just left versus right , I used to appreciate the Guardian but sadly it has lost its way","post_message":"Bill Brewster: \"The Milibands have arrived just in time for Ibiza's season opening parties, but there are plenty of issues on which they could campaign in Ibiza. There are the young workers on zero-hour contracts who flyer the beaches, often working on a basic of €50 per week. Then there’s the scandalous prices of the leading clubs, or the police, often accused of corruption and being heavy-handed. Mind you, after the campaign he’s just had, if I were him, I’d kick back the slingbacks and hit the horse drugs.\""},{"comment_id":"10153880992094714","commenter_b":"Illuminati right?","commenter_a":"I really can't stand Obama right now nor his latest decisions. He's honestly pissing me tf off no lie Like the earlier comment said, you have plenty room at the white house to throw a traditional Thanksgiving dinner all for them... We'll see how fast you call that a good idea...I'll wait","post_message":"\"[A] woman from Florida told me her family's history dates back to the Mayflower - and she said that welcoming others is part of 'what it means to be an American.'\""},{"comment_id":"10153352296609497","commenter_b":"Whether or not you find the humor funny is entirely subjective, of course.","commenter_a":"This isn't satire and it never will be. This is a pathetic example it castigating old people.","post_message":"From our sister publication, ClickHole:"},{"comment_id":"10153580791529170","commenter_b":"She is so stupid she thinks she Smarter than anyone else but Slick Willie has been out fooling her all of her life","commenter_a":"i guess im stupid","post_message":"According to Hillary, we're all just too stupid to understand how brilliant she is. She gets frustrated by that, and admits that her frustration is her \"greatest weakness.\""},{"comment_id":"932284180186448","commenter_b":"illegals has no rights go back home and come back legally.","commenter_a":"This is DO or DIE, America!!! We need Trump in the Oval immediately! He will fix this mess Obama has put us all in and we so desperately need him! I'm voting Trump 2016!!! Who's with me?!?!","post_message":"\"We have to stop with political correctness! We have to create a country that won’t have people flying planes into the World Trade Center and stop the shooting in California. If you can’t use the terms “Islamic terrorism” you can’t solve the problem.\"  #TrumpTrain #GOPDebate"}]
