[{"comment_id":"10153249874686051","commenter_b":"Girl... You are so sooo wrong! I guess you think Hillary would have answered the question.. Lol","commenter_a":"Trump had NO intention of ever calling on this great reporter - his questions would have been too complicated for Trump to answer. Even later when the reporter comes back in after his \"time out\", Trump badgers him.","post_message":"Here's how Donald Trump responded when a reporter interrupted his press conference."},{"comment_id":"10154085235841717","commenter_b":"I believe two females can already, though not commercially available and always produces girls","commenter_a":"Perhaps a little off topic, but I wonder how long it will be- or indeed if it's possible now- for a same-sex couple to have a natural child using a similar method. I imagine it would be complicated, but not impossible for, say, two men to have a biological child using a \"blank\" egg cell.","post_message":"To help women with mitochondria problems from passing them down to their children, scientists remove the nucleus DNA from the egg of a prospective mother and insert it into a donor egg from which the donor DNA has been removed."},{"comment_id":"10153128957476523","commenter_b":"And yet you probably voted for a whore for governor.","commenter_a":"You know what prevents STDs? Not being a whore.","post_message":"Health officials in Racine pass out free condoms to reduce STDs, but not everyone’s happy. FOX6's A.J. Bayatpour has the story:"},{"comment_id":"10152593835691135","commenter_b":"Something my psycho ex would do","commenter_a":"YUCK","post_message":"Some men will try almost anything when it comes to building their body...  The latest craze: drinking breast milk.  STORY: @webpagelink"},{"comment_id":"1911468415618542","commenter_b":"Buy yo mama some food","commenter_a":"All doped up","post_message":""},{"comment_id":"973103659397159","commenter_b":"Those girls have shallow, ugly, pugnacious souls. All that effort they put into making their hair into rat's nests would have been better spent reading something other than grocery store gossip rags.","commenter_a":"It's really frightening to see, how intolerant and religiously fanatic people can be. I can't see any difference between Christian or Islamic fundamentalism. Both are as dangerous and frightening. It's really sad, that people will believe more in something people has written ages ago, instead of in the scientific facts we have nowadays, and that they will judge people according to some moral standards from the Middle East (by the way the same moral standards as in Islam), instead of thinking for themselves. And before anyone says the Bible is God's word, show me ONE sentence that is written by God, or Jesus, or even anyone living at the same time as Jesus. There is no such sentence.","post_message":"George Takei says it right. Let's \"kick the ick\" out of our public discourse!"},{"comment_id":"446887825521787","commenter_b":"Brake down that Wall Pope. Take some muslim refugees in. Oh that's right, Vatican wall built in the 800 century to keep muslims from killing you. Now it's ok if muslims kill Americans.","commenter_a":"a huge wall around the Vatican, not to mention armed guards. Donald Trump is the only one who wants to protect Americans. The Democrats would let this country run wild. Turn it into a third world country. Pope Francis is not sounding very Christian to me.","post_message":"Thank you Franklin Graham."}]
