[{"comment_id":"10152902566136336","commenter_b":"Don't worry she will burn ....hell has a special place for people like her !","commenter_a":"Burn her too","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."},{"comment_id":"10154404189538984","commenter_b":"What awful things to say to a women! No brain.","commenter_a":"Hillary has no soul or conscience, shes just a pathetic excuse for a woman.","post_message":"This hero who survived the Benghazi massacre just laid into Hillary Clinton and told her exactly why she is such a horrible person. We all know Hillary's wretched, but what this hero just said to her takes it to a new level. And he's exactly right."},{"comment_id":"10153380386696130","commenter_b":"No, illegal immigrants do not commit 35% of murders in this county. Give me factual numbers.","commenter_a":"Everyone hating, yet he leads all polls.","post_message":"The rest of the media finally remembered that Donald J. Trump is entertainment, not politics! (We told ya so!)"},{"comment_id":"1740459202903983","commenter_b":"SHE IS A FELT POINT SPOILED BITCH THAT HAS NEVER WORKED A DAY IN HER LIFE","commenter_a":"Having second and third generation entitled political hacks like Pelosi is what breeds assholes like Trump. In the end, Karma is a bitch. This country can do better.","post_message":"Nancy Pelosi blasted her Republican colleagues for not taking action on gun control, saying after every shooting there is a moment of silence, which means nothing without action. Pelosi states \"a moment of silence just left there is a moment of denial.\" Do you agree?"},{"comment_id":"10153535750495667","commenter_b":"@username she is a horse","commenter_a":"She's still ugly and that will never change!","post_message":"Michelle Obama turned Friday the 13th into a fashionable affair."},{"comment_id":"10153547862267894","commenter_b":"This bitch cant act bye","commenter_a":"I think Nene should focus on her acting career. I enjoyed just having her pop up on a few episodes as a guest and not a wife.","post_message":"NeNe Leakes Reportedly Offered $2.5 MILLION to Return to ‘The Real Housewives of Atlanta’"},{"comment_id":"10150742367724999","commenter_b":"Yes Debra! Preach","commenter_a":"What?!! Do you really think young women voters can ignore that Hillary chose a MONSANTO lobbyist as her campaign manager? We'll wait for Elizabeth Warren, thank you very much. In the meantime- Senator Sanders is our Mr. Clean.","post_message":"Hillary Clinton's older feminist supporters had a message for young women who are not backing her candidacy: Shame on you. Update: Gloria Steinem later said she \"misspoke.\""}]
