[{"comment_id":"10152918122661336","commenter_b":"we cant have a female for president ever, do u know wtf is gonna happen when they hit there monthly period, there gonna be droppping bombs everywhere for no reason","commenter_a":"Omg pls no","post_message":"Former Alaska Gov. Sarah Palin says she is \"seriously interested\" in running for president in 2016."},{"comment_id":"10153744436512894","commenter_b":"Her weaves be the worst. .lol","commenter_a":"Wish them all blessing in life , hope God,s in the equation","post_message":"Pregnant Blac Chyna Goes Glam to Film Upcoming Reality TV Show -- See Her Latest Look!"},{"comment_id":"573365229526142","commenter_b":"Because they are spoiled sissies","commenter_a":"If the people who voted for Trump are racist and if he is racist, where were the protests and riots when the first mixed/black president was elected? (Crickets) Why do the democrat-progressives always take the low road and pitch fits when they don't get their way?","post_message":"Hmm, if people of color are endangered by having white people in office, are white people endangered by having people of color in office?  hillarysamericathemovie.com/#dvd"},{"comment_id":"10154234196571509","commenter_b":"Maybe if you realized the obvious. Terrorists would not attempt entry as refugees. They'd arrive as illegals and criminals along with the rest of the parade crossing into the US via our unprotected southern border.","commenter_a":"Try telling this to republicans and they won't listen, only people with commonsense know that it would be difficult for terrorists to enter the U.S. as a refugee. Maybe if fox news told them they would believe it.","post_message":"Here's how the refugee process stacks up to other ways of getting into the U.S."},{"comment_id":"1750985641784496","commenter_b":"What that is the craziest thing I have ever heard he's not racist just because he wants to build a wall and stop Muslims from coming into the country until we have a better way of verifying documents he said nothing about that","commenter_a":"are you kidding me. assama has set this country back 50 years","post_message":"Democratic leader says Donald Trump will bring back segregation.  Is he being this obtuse on purpose, or does he really believe this? #TTT16"},{"comment_id":"521579714699275","commenter_b":"She is like a pile of dung. Worthless!","commenter_a":"Yes","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way.  What a disgrace. She needs to deported to the Middle East.  Do you think Nicole Kidman is a sell out?"},{"comment_id":"380130102360204","commenter_b":"And how much are we spending on the illegals and the refugees?? Probably a lot more than the wall and the homeless combined. Let's take care of Americans and America's needs FIRST!! After we take care of our Veterans, our homeless, our children and build the wall we can consider helping those that want to come here legally!! Resources should not be going to illegals until all Americans are taken care of.","commenter_a":"I can buy a candy bar for a dollar or give the dollar to a homeless person. Wait! I can do both!!!","post_message":"We could Build a Wall, or End Homelessness... I know which one I'd Choose, Do You?  Join Us: The Free Thought Project"}]
