[{"comment_id":"10153234862426336","commenter_b":"The prizes are pre set. Geesh people get a life and move along. Lady can sell it for something for fitting to her needs","commenter_a":"She's human. Just happened to be next prize. No discrimination there! Love that. She can sell it,use it for family members,etc.","post_message":"File this The Price Is Right moment under \"cringe-worthy.\""},{"comment_id":"908359942543967","commenter_b":"I'd love to meet and spit in her face. What a sick bitch","commenter_a":"Beast","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period. Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"10152900283295950","commenter_b":"You're the little bitch","commenter_a":"First of all, why the hell are 5th graders getting diplomas???","post_message":"One by one, Trinecia Blacklock's fifth grade classmates were called to walk across the stage to get their diplomas. The wheel-chair bound student waited for her turn, but her name was never read aloud — and she was left alone, sitting by herself."},{"comment_id":"435485493243158","commenter_b":"Criminals don't get one...why require them for law abiding citizens","commenter_a":"i cannot believe how brainwashed and idiotic everyone is, you actually believe concealing more weapons, allowing no permits and actually believing it is the right thing to do because its in your constitution is fucking ridiculous, lets see how many more kids are massacred in schools now that shooters can conceal their weapons","post_message":"Good idea?"},{"comment_id":"10153069537647293","commenter_b":"lol holly you do realize \"lust\" existed before the legalization, right? plenty of both gay and straight couples letting lust \"win\" on a regular basis. the legalization of same-sex marriage allows same-sex couples in LOVE to get married. so yes, love wins.","commenter_a":"Give it up haters. Love won. You lost.","post_message":"\"This is no time for fear or outrage or politicizing. We see that we are strangers and exiles in American culture.\""},{"comment_id":"10153387831771336","commenter_b":"It's like when people are drowning we add more water.","commenter_a":"No stricter gun laws won't work. I know!!! Let's keep throwing more guns into the mix! More guns and LESS strict gun laws will definitely solve this!","post_message":"\"If it can happen in church, it can happen anywhere, so there’s no answer to it. You can't predict when evil's gonna show up.\" – Toby Keith"},{"comment_id":"10153113757150329","commenter_b":"I am 5 ft 9 and wear a 22. She is 4\" shorter than me., She is sitting sideways and we all know when we sit down the bulges show more. if she was standing up you would be able to tell better. She is gorgeous and fyi anything over a 12 is considered obese in the weight scale","commenter_a":"If she's a size 22 then I'm also a white woman.","post_message":"Meet Tess Holliday, a size 22 model who is the first of her size and height to be signed to a major agency."}]
