[{"comment_id":"10153728879938701","commenter_b":"Ugh, that's her opinion.....she is free to say it.","commenter_a":"President Obama please stay in DC.. We do not want to hear about your stupid gun control. You are NOT welcome in Oregon. You only care about One thing and that's you.","post_message":"JUST IN: President Obama will meet privately with the families of Umpqua Community College shooting victims on Friday."},{"comment_id":"483171531871140","commenter_b":"Amen","commenter_a":"Ya, Right. would never believe this bullshit!","post_message":"Shocking!"},{"comment_id":"10157375742785389","commenter_b":"The elections are rigged, may not be ACORN this time, but the MEDIA. Republican elite want to protect NAFTA, TPP and Global trade to keep filling their pockets with billions, Wall Street billionaire CEOs all from both parties are campaigning with criminal Hillary because she will protect Global trade agreements.. TRUMP is the only one who will bring back manufacturing, take back our technology which is now stolen by China as it was by Japan 50 yrs ago,stop letting immigrants invade this country, and stop giving money and our military lives away to build up foreign countries, Honestly, I don't care what he says or how he does it , because the USA has no more chances.WHERE IS CRIMINAL HILLARY GETTING JOB # 1 FOR 1 UNEMPLOYED AMERICAN ???? ,.....AND IT BETTER NOT BE A GOVERNMENT SERVICE JOB,PAID BY TAX MONEY TO CREATE BIGGER GOVERNMENT AND NO REAL UPWARD PROSPERITY ...","commenter_a":"Get used to it. Obama is supporting these terrorist organizations and Hillary will follow!","post_message":"\"We have an existential threat against the American homeland and the American people because of what this administration has done.\" Oliver North said the $400 million given to Iran will not only support terrorism, but will help Iran and North Korea move closer to creating nuclear weapons."},{"comment_id":"1703022976604096","commenter_b":"For everyone trying to give intellectual insight to a Trump supporter, you're wasting your time. I don't expect any moron to get it, neither should you. With Newt, he's guaranteed to lose, and be irrelevant, and then the rest of ua educated americans can get back to a #TrumpFreeReality . #TrumpSupportersareMORONS #DumpTrump #AMERICAISALREADYGREAT","commenter_a":"Absolutely I would vote for these two gentlemen. Newt could and would immediately provide the information and experience to \"hit the ground running\" I believe this would be an awesome team.","post_message":"Rumors are swirling that Donald Trump could pick former House Speaker Newt Gingrich as his running mate. Would you vote for this ticket?"},{"comment_id":"10152963839226051","commenter_b":"What is going on with these ungrateful wretches. They act worse than animals.Shut down the frat houses, they are all acting disrespectful","commenter_a":"cut their dicks off the young punks.","post_message":"Things just went from bad to worse for the frat boys who spit on wounded veterans and their service dogs before urinating on the American flag."},{"comment_id":"10153422363668984","commenter_b":"It was a fake statement, you irrelevant moron of an actress.","commenter_a":"So you find an actress that is stupid. Duh","post_message":"One word -- wow. ADVISORY: This article contains unedited profanity and obscenity that may be offensive to some readers. Do you think Senator Ted Cruz deserves an apology from this actress?"},{"comment_id":"559309340924025","commenter_b":"Get her fellow","commenter_a":"Lying is her number one forte","post_message":"SHARE to STAND with this NAVY SEAL!"}]
