[{"comment_id":"1452176608135698","commenter_b":"What branch of the service was Hillary and her daughter in?","commenter_a":"Thank you for your family's sacrifice, sir, your son is a true American hero. Donald Trump doesn't know the meaning of the word.","post_message":"His son was killed while fighting for the U.S. in Iraq. Now, he's got something to say to Donald J. Trump."},{"comment_id":"10154700098471323","commenter_b":"All talk of this being an exercise in protecting democracy is simply a smokescreen. This lady is a member of the privileged elite aiming to derail the Brexit we voted for by seeing it completely emasculated to the point where the status quo will be preserved. The bankers and fund managers will never allow ordinary people their freedom. Only the rich are allowed to be free.","commenter_a":"All MPs are Selfserving PARASITES .The People have VOTED DEAL WITH IT .And Start bye getting our Borders sortted and RIP UP ALL EU LAWS Because we never needed them .FACT .And Stop Foreign Aid.We carnt afford it.And Spend the money on the people that need it in the UK..","post_message":"\"Neither the British people nor parliament have, however, voted on what form that leaving should take, or on which fundamental rights will be removed as a result of leaving. Those are questions that can be decided only by our sovereign parliament.\""},{"comment_id":"10154099893448132","commenter_b":"all she has to do is prove it, Will she?","commenter_a":"This is so pathetic!","post_message":"Donald J. Trump and Megyn Kelly have quite a history."},{"comment_id":"10153437934696943","commenter_b":"Hillary did. She locked herself up in closet to take him down. That was when she lost her bar license for being both unethical and lying.","commenter_a":"Frankly, the Obama presidency, with all its scandals/crimes, has set incredible legal precedence for defendants to get away with almost anything, from lying, to destroying evidence, to treason, to tax evasion, you name it. Now, anyone accused of anything can simply demand equal protection and have their attorneys cite any one or all of the Obama Defenses.","post_message":"*** UPDATE *** This was a very big week for us, with tremendous results! As has been widely reported, we found almost a five-month gap in the emails Madam Hillary reluctantly returned to the State Department last year. But there more to the story..."},{"comment_id":"1729905883960126","commenter_b":"That's ridiculous! Stupid woman","commenter_a":"As abreast feeding mother of two.................... She's crazy!! Get organised for Gods sake!!!","post_message":"She was breastfeeding her son in the pool while the wave machine was on"},{"comment_id":"1017537058301696","commenter_b":"Black men are so screwed up, they are concerned about equal pay for women, pro-choice, illegal immigrants, grass, ducks and horses! Anything that has nothing to do with black men, a black man is concerned about. You idiots are going to be sorry, when all the immigrants are employed and NONE of you English-only speaking Negroes gets nothing. #BlackMen4Trump2016","commenter_a":"Maybe it was sarcasm. Idk... I need more rum...","post_message":"Wondering why Nation of Islam leader Louis Farrakhan said this about Donald Trump? ---> @webpagelink"},{"comment_id":"10153460551006051","commenter_b":"It's nobody's damn business what she does with her home","commenter_a":"He should get out of this woman's property . However by all accounts it is not her home. She could rent it out, she could house a family . It doesn't seem right just to let the house sit there when so many are in need.","post_message":"This guy stole a 70-year-old woman’s home. On Wednesday, a judge decided whether he could keep it."}]
