[{"comment_id":"636085169915395","commenter_b":"Fuck her .Nan I can't wait for her and her worthless ass husband to get out of office.","commenter_a":"I think her and her fucktard of a husband both have lost their fucking minds we are in America people if u don't like it get the fuck out!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"},{"comment_id":"1281011171918910","commenter_b":"I would buy a hitman to kill grammar Nazis","commenter_a":"Your not going to win. Buy a beer instead","post_message":"What would you do with hundreds of millions of dollars?"},{"comment_id":"805029612967642","commenter_b":"She knew and never said anything?? She's should be locked up smh","commenter_a":"So if she knew he scouted both places why didn't she report him?","post_message":"The gunman's wife said that he scouted both Pulse, the nightclub where the mass shooting took place, and Downtown Disney, recently renamed Disney Springs."},{"comment_id":"10153147008285950","commenter_b":"I love a drink but when I got pregnant I stopped and even though I am dying for a cold one in the warm spring sun it has to wait until bub is out and I am not breast feeding. I am due in oct. woman need to realise it isn't about them anymore.","commenter_a":"I remember my Dr saying a drink would be fine","post_message":"Slightly more than 3 percent of pregnant women admitted that they binge drink, consuming four or more alcoholic drinks at a time, according to the report from the U.S. Centers for Disease Control and Prevention."},{"comment_id":"1038558619518329","commenter_b":"How many more *illegal* guns are gonna kill people before you relize that if these people want guns, they'll get 'em... Illegal or not... #howmany","commenter_a":"There goes a wasted minute that I'll never get back.","post_message":"This video is packed with more celebrities than we could count — and they have one powerful message for the world."},{"comment_id":"1019686794754611","commenter_b":"Words that are meaningless. Go Hillary, really, go (away)","commenter_a":"whole as in Benghazi?????","post_message":"\"Despite what you hear, we don't need to make America great again. America has never stopped being great. But we do need to make America whole again.\"  Moments ago at her #SCPrimary victory speech, Hillary Clinton invoked Donald J. Trump's campaign."},{"comment_id":"10154362433106509","commenter_b":"What a pussy","commenter_a":"Obama = anti christ he wants to disarm us so he can let his refugees attack and we be left defenceless","post_message":"Barack Obama addresses the notion of a \"conspiracy\" that \"we are creating a plot to take everybody's guns away so that we can impose martial law...\" #GunsInAmerica @webpagelink"}]
