[{"comment_id":"10153850035618445","commenter_b":"Your post smells like it was done by a pussy with a badge.baaaacooonn!!","commenter_a":"Text/call us at @username We got good Quality medical marijuana strains for you with optimal potency and of absolute highest quality, I believe that marijuana is a good medicine and should be freely available to everyone regardless of unjust laws. We provide prescriptions for your health issues including: Many more just hit us @username","post_message":"Opponents of Florida's Medical Marijuana Initiative Slam Legalization.   @webpagelink"},{"comment_id":"10152656496006680","commenter_b":"No Hillary, 'JUST YOU!'","commenter_a":"Loretta Lynch is another clueless, racist, who will follow Eric Holder with more bad decisions, race baiting, and support for illegal aliens, as indicated by her actions on the bench and answers to questions during confirmation proceedings. She should absolutely be voted down.","post_message":"Clinton’s social media outburst comes after Loretta Lynch has been waiting for Senate confirmation for 128 days."},{"comment_id":"10153209058106509","commenter_b":"Oooh looks like you are a dumb chick trapped inside human body. Go get an operation...free yourself ha!","commenter_a":"All the people who think he was a girl trapped in a boy's body are sick and have missed basic biology lessons. For that punk - rot in hell.","post_message":"Crossing out \"Josh,\" the 17-year-old signed \"Leelah\" in a suicide note.  @webpagelink"},{"comment_id":"1233979523321475","commenter_b":"@username This is what I do know. He has had more than 1 stance on this. So Will the real Ted Cruz please stand up? Maybe you should learn a few things? Research... Trump does not have to do Cruz in. Give him enough rope and he will hang himself.","commenter_a":"Cruz will say anything to get elected so he can do nothing for the American people and everything for himself. Don't believe anything he said.","post_message":"Believe him?"},{"comment_id":"1361247917304790","commenter_b":"She is a criminal","commenter_a":"His decision to not pursue this is a good thing in my opinion. He won the presidency, why continue to invest energy in Hillary Clinton? She should be irrelevant to him now.","post_message":"Donald J. Trump promised to prosecute Hillary Clinton for her use of a private server if he won the presidency. Now that he has been elected, it seems he has changed his mind."},{"comment_id":"616279121877054","commenter_b":"@username not all people who are unemployed are \"deadbeats\".","commenter_a":"Get ready, republicans. You will find yourself with no health coverage. Keep praying to your god that you don't get sick.😂😂😂 I will personally take pleasure in watching you suffer.","post_message":"#BREAKING: Majority Leader Mitch McConnell signaled the Senate would move swiftly to repeal Obamacare now that the GOP Congress will have a Republican president."},{"comment_id":"1886562518248287","commenter_b":"She's turning them","commenter_a":"This is beautiful","post_message":"EAGLET WATCH!  Did you see one of the eaglets peeping through a hole in its egg?  When do you think it will officially hatch?  Let us know where you tuning in from and what name ideas you have for the babies!  Full story:  @webpagelink  Pix courtesy Southwest Florida Eagle Cam"}]
