[{"comment_id":"888228281273425","commenter_b":"Go baby go! There is no one more capable to speak for the down trotted, our Vets and what wars do to people than you! And you are a hero and thanks a million for your dedication and Service!","commenter_a":"Go Tammy!","post_message":"She’ll challenge GOP Sen. Mark Kirk in the 2016 election."},{"comment_id":"1518802311757226","commenter_b":"For people illegally here","commenter_a":"Especially if you are anyone other than the WORKING CLASS !!","post_message":"President Obama just addressed Donald Trump in a not-so-subtle way. Do you agree with the president?"},{"comment_id":"10152952940506336","commenter_b":"Atheist uses god to make money, praise the atheist!","commenter_a":"God uses atheists to spread his Word! Praise the Lord!","post_message":"Atheist Trevor McKendrick is capitalizing on a religion that he doesn't believe in."},{"comment_id":"1256330341086427","commenter_b":"I recently read an article where he said he doesn't change diapers and taking care of the kids was his wives' responsibility, so I think it's fair to say he probably has zero understanding of fetal development and pregnancy. This is a man, after all, who called a breastfeeding woman disgusting for needing to pump breast milk. Fun fact-Donald Trump is not the only man who has no idea what he's talking about in this arena. I had a friend who had to explain to a coworker, who was a father of THREE children, that breastfeeding women need to pump at work because they cannot start and stop lactation at will. Guy thought a breastfeeding coworker could just wait until her 8 hour shift was done to start lactating, and was disgusted that she stored her breast milk in the fridge.","commenter_a":"As a C-Section baby myself, I was scratching my head for a good long while after he said that. I don't understand how a seventy-year-old man with five children (and a few grandkids!) could be *that* ignorant of childbirth!","post_message":"“It is, of course, such an absurd thing to say,” one doctor said. “I’m unaware of anyone that’s terminating a pregnancy a few days prior to delivery of a normal pregnancy.”"},{"comment_id":"10153758333227217","commenter_b":"A loose federation or republic please girls. also please get rid of our constitutional monarchy.","commenter_a":"Oh No nae anither ane","post_message":"Will there be a second referendum on Scottish independence? \"As far as I'm concerned, the Scottish people had their vote - they voted in 2014 - and a very clear message came through,\" says new PM Theresa May. #Indyref2"},{"comment_id":"1295671170453891","commenter_b":"@username they danced!!!","commenter_a":"Winner eats the loser....","post_message":"Yes. Dinosaurs danced."},{"comment_id":"10153500362571770","commenter_b":"The world does not have a right to illegally enter the United States. The American people have appealed to Congress for years to secure the southern border so that we could then begin to address the issue of the illegals already in the country. That could have at one time meant some sort of arrangement for them to stay legally. But Congress did nothing because the WSJ, the Chamber of Congress and the business world wanted a supply of illegal, off the books, low wage slaves while others long for a utopian open borders world. It's time to bend our politicians to our will. We need to send the message, secure the borders or pay the price come election day.","commenter_a":"make sure they're all legal!!!","post_message":"A new coalition of Latino groups and labor unions aimed at stopping Donald Trump from becoming president will begin holding voter registration drives at high schools in battleground states."}]
