[{"comment_id":"1354028091302090","commenter_b":"Thank you for telling it like it was and appeared. I completely agree with your assessment. I am sure some women were just following what everyone else was doing: clueless, just part of the cattle drive to slaughter. Made me sick to my stomach seeing pictures of the filthy, vile costumes they paraded around wearing. Unbelievable, no shame whatsoever!! Hillary's minions!","commenter_a":"Straight talk: haven inspired me to join your cause, Hubbard went on. anything, you inspired me to run the other way.","post_message":"You've got to see this!"},{"comment_id":"510825025771036","commenter_b":"Exactly!","commenter_a":"The Greatest Good Common Sense is being questioned. Hope these will be at the FUNERALS of those killed by their bad rhetoric.","post_message":"Dr. Ben Carson weighed in on President Barack Obama's open door policy to refugees. What do you think about his comments?"},{"comment_id":"10153194384047217","commenter_b":"Helicopter looking for someone ?","commenter_a":"He's not the messiah - he's a very naughty boy.","post_message":"This mysterious bright light in the sky sent Californians into a panic 🌠"},{"comment_id":"10155894107865389","commenter_b":"I suggested the other day that we send them ours. We send two criminals for every illegal that comes to the U.S.","commenter_a":"We need leaders with strong convictions for the right thing","post_message":"ICYMI: Last night on 'Hannity,' Donald J. Trump doubled down on his stance on illegal immigration, telling Sean that the country of Mexico is “sending us their criminals.”"},{"comment_id":"631130463744199","commenter_b":"Obama don't care what \"Our\" Constitution says!!!!!","commenter_a":"unconstitutional","post_message":"Obama said that America wants him to run for a third term, here's how they responded.  What a joke. This is absolutely ridiculous.  Do you think Obama should run a third term?"},{"comment_id":"10156057396095551","commenter_b":"Everybody knew that! No way does a great 5 yr old know anything about imigration. This was a liberal setup!","commenter_a":"The Mexicans played a dirty trick on On the Pope. Perhaps they will be rewarded in hell.","post_message":"I KNEW there was something fishy about this..."},{"comment_id":"920944947962651","commenter_b":"soo then Michael is right , those other species of plants are no good , , chop em down & replace them with hemp.","commenter_a":"they need to fix this, and they can, if every person in China planted even just one tree, imagine :) Jude","post_message":"This documentary film went wildly viral with over 200 million views in it's first week online. Now Chinese officials are afraid that you'll see it too."}]
