[{"comment_id":"10153091462652507","commenter_b":"There she goes again, speaking truth to power. And for the poweless. You go, girl!","commenter_a":"Thank you Sen. Watrem","post_message":"Watch Senator Elizabeth Warren crush it on the Senate floor during the debate to defund Planned Parenthood: “Did you fall down, hit your head and think you woke up in the 1950s or the 1890s? Should we call for a doctor?”"},{"comment_id":"10154620951999714","commenter_b":"Phelps and Beyonce can go both choke on razor blades.","commenter_a":"And more","post_message":"Beyoncé, Britney Spears, Rihanna, Michael Phelps and more! #VMAs2016"},{"comment_id":"1794738107245611","commenter_b":"Mexico has no standing in America. The reason Mexico is upset is because the majority of Mexico!s economy depends on money sent from Illegals in America and illegal drug traffic. The rich in Mexico will lose their illegal source of income and Mexican economy may crash.","commenter_a":"Screw you.","post_message":"Yea, good luck with number 11..."},{"comment_id":"1005120462832757","commenter_b":"and for that she deserves what amounts to life in prison?","commenter_a":"Ummm she took abortion pills and left her baby in a dumpster, then took herself to the hospital.","post_message":"\"What this prosecution makes clear is... abortion being recriminalized in America\""},{"comment_id":"10153283660836770","commenter_b":"This woman is an utter moron! There's more people watching the GOP debate tonight than all the democratic debates!","commenter_a":"Freud would be laughing at DWS totally projecting on the GOP.....exactly what she has been doing .....burying dem debates on Saturday nights!","post_message":"Democratic National Committee (DNC) Chairwoman Debbie Wasserman Schultz tweeted Saturday night suggesting the Republican Party was “trying to hide” a debate by scheduling it on the same weekend as the Super Bowl."},{"comment_id":"10152522846320163","commenter_b":"She look real old","commenter_a":"I understand you wanna be different usher but pleases you should've stayed with Chili at least she's older but don't look it.","post_message":"It’s Official: Usher is engaged to longtime girlfriend Grace Miguel... check out her gorgeous ring here @webpagelink"},{"comment_id":"891775107623863","commenter_b":"Michelle isn't a woman for women. Let someone rape one of her babies and watch out!! And of course Bill Clinton may try! I've worked with sex offender's like Bill all my life and they DONT change. They like white, black, Asian, and ALL the girlees. Even baby girls. Bill is a threat to our children. Hillary doesn't stand for the security of our babies... she hands them over to Bill to be F...!!","commenter_a":"two faced .... you heard what what she said when Obama ran for office","post_message":"Michelle Obama did not get emotional for Juanita Broaddrick. Michelle Obama did not get emotional for Kathleen Willey. Michelle Obama did not get emotional for Paula Jones. Michelle Obama did not get emotional for Connie Hamzy. Michelle Obama did not get emotional for Eileen Wellstone. Michelle Obama did not get emotional for Sandra Allen James. Michelle Obama did not get emotional for Christy Zercher. When will Michelle Obama get emotional about all of Clinton's alleged sexual assault and rape victims?"}]
