[{"comment_id":"10153334360476051","commenter_b":"Put that mother fucker in jail","commenter_a":"Now now you did it now.","post_message":"Officials took one look at what this government employee was trading food stamps for and arrested him immediately."},{"comment_id":"10153141059471336","commenter_b":"BRAVO, Joe Prothera and AMEN!","commenter_a":"There is a way for a change u nid jesus the holy spiritto save u brother::::: beleaved in him","post_message":"BREAKING UPDATE: Jury finds Boston Marathon bomber Dzhokhar Tsarnaev guilty on all 30 counts.  He is eligible for the death penalty. @webpagelink"},{"comment_id":"510825025771036","commenter_b":"Exactly!","commenter_a":"The Greatest Good Common Sense is being questioned. Hope these will be at the FUNERALS of those killed by their bad rhetoric.","post_message":"Dr. Ben Carson weighed in on President Barack Obama's open door policy to refugees. What do you think about his comments?"},{"comment_id":"1115619658459044","commenter_b":"Yep. We're all whiney bitches to the gov and they'll find any means of manipulation and control. Welcome to the machine as we're all it's little bitch.","commenter_a":"You all are just a bunch of whining bitches!!","post_message":"Go California!"},{"comment_id":"1027338487301572","commenter_b":"I agree with you , Carol. But, Illinois law forbids us from asking for ID at this point in time.","commenter_a":"Going back many years to JFK's election to the presidency. He won by a very slim margin. Cook county Illinois (Chicago's county) had many votes cast by people who were dead. It is still happening but in many more states. Everybody should have to show a legal picture ID before voting.","post_message":"Voter Fraud is REAL!"},{"comment_id":"1707461899536305","commenter_b":"This lady is lady has her own set of rules","commenter_a":"From you? Yeah right!. . . The Ambassador and thsoe Marines are - ROLLING IN THEIR GRAVES. . . right now. . .","post_message":"Do you agree with Hillary Clinton? #SCPrimary"},{"comment_id":"10153533392786337","commenter_b":"You wish you were a woman","commenter_a":"Bruce Jenner has 0 murders. Caitlin has 1","post_message":"MUST SEE MOMENT: Caitlyn Jenner gave a graceful speech while accepting ther Arthur Ashe Courage Award at the ESPY awards..."}]
