[{"comment_id":"596850543832294","commenter_b":"They can. And you have, traitor. I've gone from 80k a yr. income to less than 30k because of your bullshit. F you Brock insane obozo","commenter_a":"They're doing it you idiot. Must live under a rock.","post_message":"On the recent attacks, President Obama says no terrorists \"can ultimately undermine our way of life.\" Do you agree?"},{"comment_id":"642467755916056","commenter_b":"@username # F*ck Hillary","commenter_a":"Clinton the queen of Benghazi and hidden e-mails. Just look at the media. They are piling on Trump while giving Hillary a pass. The debates are still too come. There is a long way to go. Hillary is a sociopathic liar and should never be president. @username and the polls mean nothing right now.","post_message":"Hillary Clinton opened up a 15-point margin over Donald J. Trump in one of the polls."},{"comment_id":"1720797558169853","commenter_b":"LOL.... The immigrants steal our jobs.... even our speeches!","commenter_a":"She did a great job last night!","post_message":"Join me behind the scenes at the 2016 GOP Convention -- as I introduce our next First Lady of the United States of America, Melania Trump! #MakeAmericaSafeAgain"},{"comment_id":"959675597399526","commenter_b":"Hillary 2016 Hillary 2020","commenter_a":"Hillary!","post_message":"It sounds like voters have already decided who they are going to vote for in the presidential election. Have you?"},{"comment_id":"10153782060807235","commenter_b":"i am embarrassed that this nasty little whore is from my home town. that is NOT the values we were taught in Newton, Massachusetts","commenter_a":"Imbecile!","post_message":"This makes me want to vomit..."},{"comment_id":"935619299833521","commenter_b":"TRAITORS!!","commenter_a":"I'm done with them !","post_message":"SENATOR: Disney Fired 250 American Workers So They Could Hire Foreigners  A US senator demanded an investigation of a US visa program that Walt Disney World used to replace 250 American workers with...  @webpagelink"},{"comment_id":"10158141146535603","commenter_b":"Sorry his YUUUUUUUGE cock","commenter_a":"If it changed anything that would be one thing but since it don't matter anyway its just something to keep the butthurt crybabies in an uproar and crying. Who cares. They can find something else to cry about.. I got faith in our butthurt wussies of the nation","post_message":"President Trump will not be releasing his tax returns. Do you care?"}]
