[{"comment_id":"1553198684973790","commenter_b":"LOSERS! ONLY TRUMP FOR PRESIDENT!","commenter_a":"Trumps my guy!!! GO","post_message":"Washington insiders and politicians have failed America. If I am elected President I will create jobs, end illegal immigration and #MakeAmericaGreatAgain. #Trump2016 Support Trump: @webpagelink"},{"comment_id":"1158047454312031","commenter_b":"STOP THIS IN AMERICA!! Send illegals back! Police those that are here legally. These people want us dead....when did that change, folks????","commenter_a":"If they want to kill off their women and children nothing we can do about that. I have no problems shooting anyone who is coming after me. It's us or them. I say us","post_message":"It's only a matter of time before children will be doing all the dirty work. These monsters MUST be stopped. @webpagelink"},{"comment_id":"914387928629071","commenter_b":"Send all illegals home now","commenter_a":"YES YES YES","post_message":"Americas Freedom Fighters"},{"comment_id":"1115305561859305","commenter_b":"And this so called wall would cost Americans billions of dollars. We can't afford that. No one can force Mexico to pay for it. And what about the water ways and the mountians? How will you put the wall on those?","commenter_a":"The WALL will seriously squelch the drug cartels, crime will decrease and the land value will increase, - It's called tough love, if we continue with open borders California will collapse, we flat-out can't afford it anymore, we're broke. Mexico has the best land in the world.","post_message":"\"Es una amiga nuestra de mucho antes y de siempre\". —Congresista Luis Gutiérrez sobre Hillary Clinton"},{"comment_id":"1047357948654067","commenter_b":"Hopefully your girls won't grow up to be ignorant fools like you.","commenter_a":"While watching this video my four year old daughter asked, \"Who is that?\" I answered, \"@username, hopefully the first woman president.\" To that she replied, \"I love her. She's beautiful. I like her necklace.\" Can't wait for you to shatter that glass ceiling for my girls!","post_message":"An expectant mother in Iowa asked: What are your plans for parental and maternity leave?"},{"comment_id":"10153292993241350","commenter_b":"I don't think I should be President, but another woman could do a great job.","commenter_a":"WOW - she has self esteem issues if she thinks she (or ANY Women) can't be President!!!!","post_message":"\"I think women can do anything and be anything, but the president, I feel, is for a man...That does not mean we cannot be successful run businesses, be doctors, be lawyers I was only speaking of one specific position...and again, it's just my opinion.\""},{"comment_id":"1154295914627380","commenter_b":"This woman is crazy for thinking of that.","commenter_a":"You remind me of the politicians who turned away boats full of Jewish refugees, and sent them back to Germany to suffer in the Holocaust.","post_message":"Hillary Clinton will increase Syrian refugees by 550% without a realistic screening process."}]
