[{"comment_id":"10152736436045496","commenter_b":"negative much?","commenter_a":"Where was the GoFundMe started for her? She lost her job after having a gun shoved in her face, did anyone start a fundraiser? If they did was the link shared? Hundreds of thousands of dollars raised in the name of hate and not one single penny raised for a working MARRIED mother who valued her life over a companies money. Yep, this is indeed a \"Christian Nation\".","post_message":"The pregnant Popeyes manager, who was fired less than 36 hours after a robbery, has been offered her job back. See more: @webpagelink Would you go back to work for the restaurant?"},{"comment_id":"10154608695637994","commenter_b":"These girls are exactly why we have insecure girls in high starving themselves! There are consequences to your actions! I bet she ain't laughing now!","commenter_a":"I was just wondering what happened with this.","post_message":"Playboy model Dani Mathers could face prosecution for posting a photo of a naked woman, without her knowledge, in the locker room of an LA Fitness. Mather posted a photo of the naked woman in July to her Snapchat with the caption, I can unseen this, then you can either. Do you think she should spend some time in jail?"},{"comment_id":"1061695460512781","commenter_b":"Forget about the suicidal Muslims getting atomic bombs, let's get those guns WTF","commenter_a":"\"Sniper ammo\" is next...wait for it....","post_message":"We didn't say anything about gun control, but it is gun control. Everybody knows they want gun control, and if they can't get your gun, what better secondary way than to get you bullets? Anybody with a brain knows what's going on here."},{"comment_id":"1021715281216809","commenter_b":"Definitely Dan!","commenter_a":"We are witnessing the greatest attack on our American Democracy since Citizens United! The DNC has chosen Hillary Clinton to be their next presidential nominee, and is doing whatever it takes to silence the voice of the people. We cease to be a Democracy when the Party receives millions in funding from the same media corporations that report biased coverage in an attempt to deceive voters. We cease to be a Democracy when the Party takes deliberate actions to suppress voter turnout, turns away registered voters, and commits election fraud in Arizona and across the country. We cease to be a Democracy when the Party selects super delegates (many of which are Lobbyists) who refuse to the listen to voice of the people the are intended to represent. We cease to be a Democracy when the Party simply removes a candidate from the ballot in Washington DC! A vote for ...","post_message":"Every success by Bernie is met with a story or column or talking head whose message is “but he can’t possibly win.” That's the media refrain because the Democratic establishment can't conceive of the possibility Bernie will win. That's because they aren't listening to Bernie's message and its resonance among Democratic and independent voters (as well as many Republicans). They don't know how determined Americans are to reverse the increasing concentration of wealth and political power that are eroding our economy and democracy. - Robert Reich"},{"comment_id":"1663552577266891","commenter_b":"Yes--indeed. This woman's behavior is appalling.","commenter_a":"Trump supporter! Makes me sick!","post_message":"Attacked as they prayed? A group of Muslim men say a worshiper was hit in the face and doused with coffee in a confrontation with an irate woman in a NorCal park. abc7.la/1Qgwbam “You are very deceived by Satan,” the woman yells as the wild scene is caught on camera. Should she face criminal charges? Why she’s not backing down, in her own words."},{"comment_id":"10153284046734228","commenter_b":"Th!at girl blacked her eye","commenter_a":"That dude is either Prior service (MP) or a local cop. His entire demeanor and physical behavior scream it. I don't think brandishing was the best idea either way..","post_message":"Teens who frequent the skate park say they aren surprised by the fight, but they can believe how it was stopped. A man pulled a gun. - @webpagelink"},{"comment_id":"10154111304162541","commenter_b":"Shut up","commenter_a":"Like Trump, Steve Harvey is also a racist and mysognist. Between his extremely offensive dating advice for women and his extremely offensive comments about Asians, Steve and Don the Con have a lot in common.","post_message":"\"I walked away feeling like I had just talked with a man who genuinely wants to make a difference in this area,\" Steve Harvey said."}]
