[{"comment_id":"10153526308641509","commenter_b":"Christians are freaked out because there will be more muslims in the world than Christians soon enough...ha, ha...paranoid! Be very afraid republicans and pee farty hatriots oh and BUY GOLD will ya? lol.....","commenter_a":"Relax people, we got those Iranians right where we want them...","post_message":"President Barack Obama says if a nuclear deal is fully implemented, it will prevent Iran from obtaining a nuclear bomb: @webpagelink"},{"comment_id":"10152562554341636","commenter_b":"Time to persecute muslims everywhere.","commenter_a":"I will never support terrorism but I also think we have to respect other people's religions...","post_message":"Ahmed Merabet had raised his hands up in surrender before being shot dead..."},{"comment_id":"1686879181550201","commenter_b":"It had to be a woman. Why couldn't have just come up with a $3 bill. Leave well enough alone.","commenter_a":"Of all the really great black statesman the US has ever produced, wonder why they didn't pick Frederick Douglas, MLK? Oh yeah, they were republicans and Douglas said any black that would vote democratic was an idiot. Of course people are so ignorant now I have read where people have stated the democrats drew up the legislation for the civil rights act, in reality passed by a republican congress with a reluctant Democrat, Johnson signing it. Ignorance abounds","post_message":"BREAKING: OBAMA SUCCESSFULLY WHITEWASHES AMERICAN HISTORY…”Racist” President Andrew Jackson To Be Replaced With Harriet Tubman On $20 Bill"},{"comment_id":"10154545590463010","commenter_b":"#NeverHillary #NeverTrump #JillStein2016","commenter_a":"Hmm, funny that you could say all the exact same things about Clinton. Time to stop pretending she's better than he is. Sorry y'all - we let the US drift so far to the Right a Trump popped out, but that isn't his fault. Particularly when he isn't the war criminal candidate between the two major party offerings...","post_message":"Psychiatrists aren't supposed to psychoanalyze presidential candidates. A Yale psychiatry professor writes in Los Angeles Times Opinion:"},{"comment_id":"10153796772929411","commenter_b":"They kill civilians anywhere they go. Worse butchers then IS nearly..","commenter_a":"Terrible.","post_message":"US special operations analysts investigated #Kunduz hospital for days prior to the deadly October 3 attack, describing it as a base of operations for a Pakistani agent coordinating Taliban activities, despite despite repeated pleas by the MSF."},{"comment_id":"10152758680722144","commenter_b":"Racist pigs","commenter_a":"What the hell are these people thinken DO THERE DUM ASSES KNOW THAT CHILD ABUSE","post_message":"WTF."},{"comment_id":"2471637393058961","commenter_b":"@username still better than that lying bitch you voted for","commenter_a":"Why do you guys keep asking the same stupid question...I guarantee you no one on the right has changed their minds...now maybe some on the left came to their senses","post_message":"Would you like to see this duo in the White House again?"}]
