[{"comment_id":"1619560758331037","commenter_b":"This bitch needs to be taken down so sick of her throwing other people under the bus she's just as guilty as them. Take her out!","commenter_a":"SHE MAY RUN...BUT YOU DO NOT HAVE TO VOTE FOR HER! THE RED CARPET WAS YANKED OUT FROM UNDER HER BEFORE...IT CAN HAPPEN AGAIN! BENGHAZI MURDERESS IS NOT PRESIDENTIAL MATERIAL!! THE CLINTONS N' OBAMAS ARE FINISHED!!","post_message":"Hillary Clinton MUST be stopped!"},{"comment_id":"10153046800841717","commenter_b":"Thats one stupid bitch.","commenter_a":"Ok, now it should be the electric chair! This woman is a menace to society and to the rule of democratic law. What a pity she is incapable of learning new skills like other related species! Lol...next she wll have her own TV show!","post_message":""},{"comment_id":"10154403370309170","commenter_b":"She needs to go bye","commenter_a":"We're doomed!","post_message":"You have got to be kidding me. We actually elected people who believe stuff like this?"},{"comment_id":"10154624761426336","commenter_b":"What a dumb woman...","commenter_a":"Its her policy that allows these people in our country to kill us.","post_message":"Hillary Clinton addressed the latest bombings in New York City and New Jersey and emphasized that Donald J. Trump's comments are being used to recruit terrorists. @webpagelink"},{"comment_id":"10156293544295354","commenter_b":"@username why don't you move to the UK where you will be safer after all criminals don't have guns because they are illegal there and everyone know criminals obey gun laws .","commenter_a":"I'm a huge 2nd amendment advocate and there are 1000 reasons why the gun control crowd is wrong, but I really don't care for this particular argument. Public people are at more risk than private people to become victims of crime. Any of us can become victims of random crime, stalkers, etc., but overall, the public officials and celebrities draw more risk in that regard. Hillary is so loathesome and widely despised, she probably would have been gone long ago if not for that armed security. I, OTOH, just recently bought my first gun and didn't piss off anyone enough to want to kill me. I like to use that famous Japanese quote in WWII as to why they didn't even consider invading the U.S. - \"Invade the U.S.? Impossible, there's a gun behind every blade of grass\". Our guns keep our nation safer and serve as, I hope, some ...","post_message":"Hillary Clinton: If you truly believe guns don't save lives, why do YOU have armed security protecting YOUR life with guns? We regular folk can't afford to live in million dollar mansions like you and Bill do. Why don't you want us to protect OUR families and children with guns when you use them to protect yours? Signed, AMERICA"},{"comment_id":"1466279580067766","commenter_b":"Yes!","commenter_a":"Yes !!! What choice do we have...?","post_message":""},{"comment_id":"10156312558675354","commenter_b":"What a self serving heartless bitch.","commenter_a":"She is a good for NOTHING LIER ,GET RID OF HER FOREVER !!!!","post_message":"PARTY TIME!!!"}]
