[{"comment_id":"10153118547732377","commenter_b":"Wake up folks, don't be divided , be united....Carson for president, at least he's a God fearing man...A child of the most high God","commenter_a":"And Your Point Is???","post_message":"Ben Carson's faith as a Seventh Day Adventist came under fire at a Donald Trump rally on Saturday."},{"comment_id":"2033407076758008","commenter_b":"Ghetto Trash !!!!","commenter_a":"Why would the 'demoncrats' dump Brazil's ... nah ... to start with she's black like ODUMBER and after all she fits right in with CROOKED KILLERY ...","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1218923861503062","commenter_b":"I wonder if this woman realizes what a joke she is. Department of Justice my butt. She has ruined any respect she may have had from the American people. What she may not realize is the Clinton's would leave her holding the bag if it covered their tracks!","commenter_a":"We don't need Attorney Generals that don't represent WeThePeople and the truth.","post_message":"Loretta Lynch, Attorney General can't seem to get her story straight about Hillary Clinton. This is what it looks like when your career crumbles right in front of you.   Let's get 2,000 SHARES to show that we don't need CROOKS in office!"},{"comment_id":"10152756027891051","commenter_b":"Let your women drive already !","commenter_a":"Its a respect and courtesy issue in a foreign culture. It doesnt hurt to put a scarf on her head. They arent asking her to put on a Burqa","post_message":"People in Saudi Arabia are livid with Michelle Obama for one very specific reason."},{"comment_id":"1205822416127529","commenter_b":"And you're a Pussy!","commenter_a":"Not only that you're violent Mr. Trump but you're a racist, narcissist, bigot, mygonist, rapist, thug and the worst presidential candidate that the USA has ever had! You're everything bad that has ever happened on planet earth. You're the Ebola, Zinka, Meningitis, HIV/AIDS, Swine Flu, Hepatisis, Malaria, jiggers, Lice and Hemorrhoids and not to forget, you're the spread of cancer in the entire world! Go away already mtsweeeeew. #NeverTrump","post_message":"EXCLUSIVE PREVIEW: Tonight at 11/10c, Trump’s plan for his first 100 days: suing his female accusers."},{"comment_id":"754556321401612","commenter_b":"Tie them by their ankles to a fast moving train!!","commenter_a":"This is the mine set of Muslims. That it's ok . Send their asses back","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News They deserve much worse than this. What do you their punishment should be?"},{"comment_id":"10153629118828132","commenter_b":"She is a moron...","commenter_a":"No she did not do the right thing,she was very disrespectful,rude,nasty.","post_message":"Is Jennicet Gutierrez a heckler - or a hero?"}]
