[{"comment_id":"732442150279696","commenter_b":"close our borders and weed out this cancer trash","commenter_a":"Get registered to vote the right way. Offer your Sr. Neighbors etc a ride to vote. Get things changed in this country!","post_message":"BREAKING: Muslim Civil War Erupts In Ohio After Patriot Rips Apart A Quran [VIDEO] Watch what happens in the crowd right after he started doing this. Do you think we should close our borders?"},{"comment_id":"10153139725131037","commenter_b":"Hillary won't be in office. Smfh never that","commenter_a":"This guy actually thinks he is a good president. LOL","post_message":"Confident Obama predicts success in immigration appeal, has message for millions facing possible deportation @webpagelink"},{"comment_id":"10154324969511729","commenter_b":"How are they terrorists again ? Becus your tv said so ? They were where they shouldn't have been ...if Iran had war ships on the American shores America would nuke that country please stop with that bull shit all of a sudden people care for their army but when they come back broke homeless and jobless no one bats an eye no one takes time out of their lives to do shit about it no one protests to get them help ...so please shut the fuck Up with this false emotion","commenter_a":"A real president would have removed any hope of sanctions relief upon hearing reports that a terrorist regime had abducted any of our service personnel and had a carrier group steaming its way to the gulf with an ultimatum that those sailors be released immediately or else. But instead we get incompetent pandering from Lurch and Oblivious.","post_message":"Quite possibly the most ludicrous thing yet we've heard from this White House..."},{"comment_id":"445100202281687","commenter_b":"Hey here is an idea to the asshole who runs this page, stop defending these fucking criminals. Weed is ILLEGAL. Don't fucking run asshole. The fucking cop should have curb stomped him","commenter_a":"this police guy is a liar ,you deserved your termination,your insane....","post_message":"This is just disturbing. What a lame excuse this cop who has been reported multiple times in the past used for his violent behavior. Now he is defending his actions.   Do you think his violence is justified?  *Warning* GRAPHIC Video: @webpagelink"},{"comment_id":"1094342837275269","commenter_b":"She ain't coming back","commenter_a":"I love Jessica Lange","post_message":"Jessica Lange announced that four seasons of 'American Horror Story' was enough and she will not return.   The star of the first four seasons of 'American Horror Story', Jessica Lange, announced that she has no desire to return to the show. Lange will however return to FX in the show 'Feud'   One actress entering her fourth season of the show that announced she will be returning is Angela Bassett. Watch Angela Bassett talk season 6 of 'American Horror Story'."},{"comment_id":"10152606580602434","commenter_b":"The \"greedy bitch\" is a man.","commenter_a":"Getting married doesn't automatically entitle you to gifts or money, your guests will give what they can, if they can but surely their attendance is more important than receiving things from them? This is the most jacked up article I've read in a long time, far too much misdirected vitriol. Hope this greedy bitch gets nothing! Equating the whole situation of gift/money giving to 'living in sin' is so ridiculous and the amount of times people are directly cursed out is excessive. If you wanted to express your opinion so badly, you should have learned how to write first. Bridezilla!","post_message":"These people often fall in the same group as elitist jerks who think getting a dress from David's Bridal is \"tacky.\""},{"comment_id":"10154048285749087","commenter_b":"She's a flippin' wreck yust waiting to happen....","commenter_a":"Lol they are dragging on the L for her fans","post_message":"BREAKING NEWS: Another very bad poll for Clinton."}]
