[{"comment_id":"750335681823676","commenter_b":"Trump and his mindless supporters are a NATIONAL EMBARRASSMENT !!","commenter_a":"Trump gonna have alot obama f-ups to fix right","post_message":"BREAKING: Trump Drops Bombshell About Obama... He Just Exposed The Unthinkable He is trying to cover this up as quickly as possible. Let's spread it. Do you think Trump would make a better president than Obama?"},{"comment_id":"1799616930271434","commenter_b":"Liar!","commenter_a":"The more she says it the less I believe it.","post_message":"\"Certainly my meeting with President Bill Clinton raises questions and concerns.\" Attorney General Loretta Lynch says says she will accept the recommendations of the FBI on whether to pursue charges against Hillary Clinton."},{"comment_id":"10153998219462169","commenter_b":"Please email this to every teacher, parent, and administrator in the nation.","commenter_a":"This is garbage! We have nothing left to encourage positive behaviors or discipline!","post_message":"Column: Hey teachers, please stop using behavior charts. Here’s why (From PBS NewsHour)"},{"comment_id":"10155741021510354","commenter_b":"Dear Allison, you are one poor sucker. There never was a thing called white privilege. You thought emancipated blacks were slaves but in truth , the only thing equality means is that no one gets a free ride . Not blacks or whites...you have the freedom to work your little butt off to get what you earn. If that is white privilege, you have been duped into wanted to toil and toil to get what you want in life...same as the next guy.","commenter_a":"you are a fucktard","post_message":"Why MSNBC called in an erotic novelist to discuss this topic is beyond us... but somehow the crazy here might even surpass Rachel's."},{"comment_id":"10153045402661336","commenter_b":"Shut up idiot!!!!","commenter_a":"Early Bird gets the cage","post_message":"A Georgia sanitation worker has been sentenced to 30 days in jail for picking up trash too early in the morning."},{"comment_id":"899546906747398","commenter_b":"F muslims, and GTFO!!!","commenter_a":"Heck no he is in the grave why would you move him ..when the Muslim can be buried somenplace else .this is against his family to be removed.","post_message":"Pathetic! (MUST READ)"},{"comment_id":"785803421556302","commenter_b":"GREAT!!! MAKE HER LIVE BY OUR LAWS!!!","commenter_a":"Yes sir jail or take that crap off , its disrespectful !!!","post_message":"Judge Throws Muslim Woman In Jail For Refusing To Remove Headscarf In Court. If you can't obey our laws, you go to jail. Do you think she had this coming?"}]
