[{"comment_id":"1196105023763301","commenter_b":"I got something for your ass you want it","commenter_a":"How about remove the sick person behind addicting info !!!!","post_message":"Somebody just did something genius to help in the battle to remove Donald Trump from public life."},{"comment_id":"960647347306835","commenter_b":"I can't find what I'm looking for now.","commenter_a":"I try not to think of them at all...","post_message":"What do you think of these massive new changes coming to your local Target store?"},{"comment_id":"701531266646721","commenter_b":"CORRECTION : THEY'RE NOT FROM AFRICA, SO THEY'RE JUST PLAIN OLD AMERICANS ... DAMN IT!","commenter_a":"Oversensitive black couple. Correction oversensitive African-American black couple.","post_message":"Oh the humanity!!!"},{"comment_id":"10153051540886028","commenter_b":"The employee probably had no idea what the Isis flag looked like. Uneducated people who have no idea about current events would have no idea. With the whole Confederate \"battle\" flag all employees probably got a notice with its picture on it saying why Walmart wants nothing to do with it. Common sense people. Also total set up to prove a point that we choose at the moment what we're going to have a hissy fit about and how worse things could totally go under the radar because of the uneducated and ignorant people out there. I guarantee you most people couldn't recognize 3 out of any of the 50 state flags and I'm being generous with that! Sad truly sad!","commenter_a":"Freedom of speech and the 1st Amendment take precedence here....any and all cakes should be baked without political correctness.....","post_message":"\"Hi, Walmart, you've got some explaining to do.\" One man is calling out Walmart for refusing to make him a cake decorated with the Confederate flag along with the caption, \"Heritage not hate,\" only to say yes to making an ISIS flag cake. \"I’ve got proof. Went back yesterday and managed to get an ISIS battle flag printed. ISIS happens to be somebody we’re fighting against right now who are killing our men and boys overseas and are beheading Christians.\" Now, the chain is apologizing and says the ISIS cake \"should not have been made.\" @webpagelink"},{"comment_id":"10153550628070575","commenter_b":"purina go sit down! TRUMP 2016!!","commenter_a":"Msnbc ? Thats because she has such nice things to say about Islam . Trump 2016. 🇺🇸🇺🇸🇺🇸","post_message":"The Gateway Pundit - MSNBC Host Mika Brzezinski Goes Wild for Carly: “My God, I Have Never Seen Anything Like Her, Ever!” (VIDEO)"},{"comment_id":"10153565125016162","commenter_b":"Evil. What is so sick about our world is that moms and dads kill their babies every day by the thousands. It's called abortion. We should be as offended and grieved at the kids killed in the womb and out of the womb.","commenter_a":"Typical crackhead POS!!!! He should commit suicide.","post_message":"CHARGED: Young parents arrested after newborn found to have 20 fractures, police say: @webpagelink"},{"comment_id":"738710359595478","commenter_b":"Where the statement from Obama to put an end to the violence, condemning of those who perform these horrific acts. Do you hear the crickets? Our prayers are with the family","commenter_a":"Fry that fucker no trial save taxpayers money.","post_message":"It keeps happening.....rest in peace."}]
