[{"comment_id":"10154663245784657","commenter_b":"Who wants to watch a liar. He is so delusional, he should have been removed from office years ago. Except Congress has no spine !","commenter_a":"Heard one from this 'fella, you've heard them all !!! Only said \"I\" 84 times in this one, --- he's gettin' better ???","post_message":"Obama, the celebrity president, may not be as popular as he thinks he is."},{"comment_id":"10153134851981316","commenter_b":"Go away kardashian of the transgender world","commenter_a":"Lol. Worthless","post_message":"Feminists now attacking political correctness after Caitlyn Jenner honored by Glamour as Woman of the Year: @webpagelink"},{"comment_id":"10154876629414411","commenter_b":"Ĺol Canada doesn't care. Second biggest land mass on Earth, only 40 million people live here. We will put all the Americant's a few hundred km north west of Alaska. Enjoy the polar bears bitches.","commenter_a":"Please send him to Mars! We Canadians don't need this dickhead in our beautiful country...","post_message":""},{"comment_id":"10157692463425389","commenter_b":"Hillary will win due to the corruption within the establishment, and the votes of illegals and dead people!!","commenter_a":"Never permit the Federal government to pass into the traitorous hands of Hillary Clinton","post_message":"Keep in mind-he actually did these things."},{"comment_id":"10153578934943984","commenter_b":"Really. Yall have to ask??? Stupid crap and a shame people think of HIM as courage. SAD. However HIS timing was planned just at the right time for the supreme courts decision.","commenter_a":"What a joke.","post_message":"Wow. Immediately after the ESPYs it became clear to those paying attention that ESPN made a big mistake. I'm pretty sure ESPN never saw this coming when they decided to give Jenner the Arthur Ashe Courage Award. Do you think ESPN was wrong to give this award to Jenner?"},{"comment_id":"10157704194035725","commenter_b":"MAKE SURE SHE HAS NO EAR PIECE IN HER EAR.","commenter_a":"Great show this morning!","post_message":"I am truly honored and grateful for receiving SO much support from these military leaders -- American heroes -- who have defended our freedoms. THANK YOU for your service and sacrifice, as well as your confidence in me to serve as Commander-in-Chief. #AmericaFirst!"},{"comment_id":"1413133632042756","commenter_b":"I believe that the adult in this circumstances escalated the situation. Wrong to trample someone's lawn, wrong approach to correct the problem. Two wrongs do not make a right.","commenter_a":"That's not true Media saying wrong stuff The off duty officer was right When kids jump on him Then he fire to scare the kids He was waiting for on duty officers to arrived","post_message":"Horrifying new footage shows an off-duty cop shooting a gun at a group of teens in Anaheim, CA. It's going viral and sparking protests."}]
