[{"comment_id":"1445788068782419","commenter_b":"If that bitch wins it will not be USA any more cause she will screw it over and over. Immigrants will take over.","commenter_a":"Never Hillary","post_message":"ELECTION POLL! Who should win the 2016 Presidential election?  LIKE Qpolitical for the results."},{"comment_id":"1033066763409083","commenter_b":"Maybe we could stop the flow of heroin coming into the U.S.","commenter_a":"To associate with Hillary Clinton, you are an EMBARRASSMENT to the residents of VA and to the military who live and serve here!! DISGUSTING!!","post_message":"I’ve seen firsthand how significant an impact the opioid and heroin abuse epidemic is having on communities and families in Virginia. More Virginians now die from these overdoses than car accidents, and law enforcement currently lacks the tools to save more lives. I’m pleased the just passed Comprehensive Addiction and Recovery Act (CARA) will encourage co-prescribing of naloxone – a life-saving drug – alongside opioid prescriptions and also implements a measure to protect the elderly from medication abuse. I worked with a bipartisan group of colleagues to draft and introduce these provisions. Lastly, while I am pleased Congress was able to work in a bipartisan way to address this crisis, we should keep working to provide emergency funding that is critically needed for state substance abuse programs, law enforcement, treatment and other priorities authorized in this bill."},{"comment_id":"1012675578755490","commenter_b":"Stupid women","commenter_a":"shut up skanks, cancel the p.o.s....","post_message":"Umm ACTUALLY it is in the Bible!"},{"comment_id":"966205513390919","commenter_b":"Ms Quintana what a selfish, entitled attitude you have. Who is going to pay to train the temp, who is going to have to take on the extra duty of getting them up to speed, and who is going to pick up the slack while they get adjusted? Someone has to make up for that lost productivity. So the woman makes a decision to have a baby, and everyone around her pays for that decision. How is that fair? And not only that, but she expects to waltz back in a year later like nothing happened! She will most likely have to be retrained, creating yet another burden on top of kicking out the person who has done her job for the past year. Why should that temp have to step aside because queen mommy came back? Shouldn't that be HER job now? Why should she have to step aside ...","commenter_a":"How very \"pro-life\" of them ;). It's no wonder some women need abortions, if you can lose your job or be forced to go on unpaid leave while pregnant, and there's no maternity leave after you have your child... having a child can seriously cause you financial distress to the point of ruin! States need to pick one or the other! You can't be pro-life if you're not going to support a woman who has a child at all.","post_message":"\"I loved my job. I was really hurt.”"},{"comment_id":"1264368863598532","commenter_b":"GO straight to HELL...","commenter_a":"God has His own way to handle Him. This man is no match for God.","post_message":"This is why Trump won!"},{"comment_id":"10153778472068984","commenter_b":"She doesn't owe anyone anything, much less a fucking apology lol","commenter_a":"Carly, how can someone so well versed on most subjects, be so uninformed on Muslims? Even Muslims know Islam is not a religion but an ideology of submission only. Therefore you owe Ben Carson an apology for being correct when he said they are not covered under OUR constitution. READ the Quran for yourself Carly and you will find out that you are an Infidel and are to be killed if you do not SUBMIT to Allah. Does that sound like someone our constitution would support? I think NOT!","post_message":"Carly Fiorina just revealed what she thinks about Ben Carson's comments about a Muslim serving as President of the United States - and you might be surprised with where she stands...  Do you think Fiorina is showing her true colors?"},{"comment_id":"1579733685658472","commenter_b":"But let's bring them here, and take our guns.","commenter_a":"If the FBI AND Homeland Security interviewed the shooter 3 times and still let him go, then with those standards how are we supposed to believe that Syrian Migrants are going to be properly vetted and America still be safe?","post_message":"American must now get very tough, very smart and very vigilant. We cannot admit people into our country without extraordinary screening."}]
