[{"comment_id":"10152854969571051","commenter_b":"Let behead these scumbags..What the F**k is wrong with people..Your parents should get their asses kicked","commenter_a":"Tell me where they live. I'll do the rest...","post_message":"These teens beheaded a puppy with a machete and posted the video to Snapchat. Then they picked up another puppy and did it again. And they didn’t stop there."},{"comment_id":"10153382274960047","commenter_b":"Absolutely. We need that evil out of our country, or there won't be. That evil Clinton is still getting votes. Are there that many brain dead people that can still vote? She a freaking criminal, and low life form that should be in prison. For those that do like her, if it were you that had did all she has, you'd be a lifer in prison. Wake the heck up.","commenter_a":"I would rather see silver or gold certificate or better yet actual gold or silver. Back then no in god we trust on any money","post_message":"We must defend \"In God We Trust\" from atheist attacks. We must defend our Christian heritage. Sign and Share our petition to take action: @webpagelink"},{"comment_id":"10153741817406178","commenter_b":"Hillary is an unclassified POS !","commenter_a":"I think he is smoking crack.........","post_message":"Well I suppose all is forgiven now, isn't it?"},{"comment_id":"10154516833146162","commenter_b":"Ain't no 6ft sumn woman hanging their self in no jail cell miss me with that","commenter_a":"Wow, this tells everyone....NOTHING! I would like to hear... Exactly how Sandra Bland died. Period!!!!!!!","post_message":"An ex-guard admits to falsifying Sandra Bland's jail log... @webpagelink"},{"comment_id":"1004203859620086","commenter_b":"Awful woman !!!","commenter_a":"I don't want to see this face in my newsfeed.","post_message":"Leave it to Michele Bachmann to exploit a tragedy to take a swing at President Obama"},{"comment_id":"10153685759487439","commenter_b":"Lets ban all Muslims and Idiots like u that have no more brains cause u do to much drugs and u are just as evil as them.","commenter_a":"Ban all Mosques and Muslims from all western civilization.","post_message":"A member of the Iraqi Christian community in Michigan wrote to alert me of a proposed mega-mosque going up in a Chaldean Christian community in Michigan. How frightening it must be to them when their Chaldean brethren in Iraq and Syria are being systematically cleansed from their centuries-old homelands under Muslim rule. The genocide of the Chaldean Christians accompanied by this:"},{"comment_id":"1312058212172984","commenter_b":"Pandering witch.","commenter_a":"We're going to miss Michelle!","post_message":"“Como saben, estamos en medio del Mes de la Herencia Hispana. En las aulas por todo el país los niños aprenderán sobre Dolores Huerta y César Chávez… Julián y Joaquín Castro y la jueza Sotomayor… Roberto Clemente y Laurie Hernández… Gloria Estefan y Lin-Manuel Miranda e innumerables latinos más. Nombres que conocemos y nombres que tal vez no conozcamos, pero que han enriquecido a este país por generaciones. Si eres mexicano, puertorriqueño, cubano, latinoamericano o afrolatino… si tu familia acaba de llegar o ha estado aquí antes de que los Estados Unidos existiera… no eres un extraño. No eres un intruso. Ustedes son nuestros vecinos, nuestros colegas, nuestros amigos y nuestras familias. Ustedes hacen a nuestro país más fuerte, más inteligente, más creativo. Quiero que sepan que yo los entiendo y estoy con ustedes. Y una y otra vez hemos visto que cuando invertimos en la comunidad ─ cuando hacemos ..."}]
