[{"comment_id":"10153627054797217","commenter_b":"They were one of the best armys when Saddam was in power. Everything in Iraq lost its glory after him.","commenter_a":"It's a shame the Iraqi army is so awful otherwise they may actually succeed.","post_message":"To retake Falluja from the so-called Islamic State."},{"comment_id":"10153171511013690","commenter_b":"Strong woman always obsesses BOYS...","commenter_a":"Im guessing most if not all of those women are in prison for no other reason other than being born female. Women and children are always the worst abused in mens wars","post_message":"Hundreds of young children in Afghanistan are being forced to share a jail cell with their mothers; women who in many cases are protesting their innocence or have been convicted of so-called moral crimes. Many of those children are facing years behind bars, cut off from the outside world yet themselves completely innocent of any offence. People & Power finds out why: @webpagelink"},{"comment_id":"828695877229020","commenter_b":"I would of kicked someone ass if that was my kids","commenter_a":"Jessica Bates daaammm","post_message":"The children were 4-6 years old."},{"comment_id":"10153889847128132","commenter_b":"Da devil is a lie she outta pocket no excuse non of that","commenter_a":"Well this explains a lot. If you have people like her working in child services, no wonder the children are left in abusive situations and no wonder society is grieving for them as they plant their innocent bodies in the earth--a sad day it is","post_message":"So horrifying."},{"comment_id":"10154888986680579","commenter_b":"Build that wall..","commenter_a":"Where will he get the money if he cuts taxes with our huge debt? Borrow it?","post_message":"Military Only: Your choice for 2016?"},{"comment_id":"388912451508467","commenter_b":"This woman won't win the next election.","commenter_a":"Tankes sister","post_message":"Angela Merkel: 'Islam is not the source of terrorism'. Merkel spoke at the Munich Security Conference about why cooperating with predominantly Muslim states is vital."},{"comment_id":"10158110141675500","commenter_b":"Why do u say that? I totally disagree!","commenter_a":"Disney sucks","post_message":"DISNEY DISCOUNT! Sunshine State residents can save big on Disney park tickets. Details >> @webpagelink Disney Walt Disney World Epcot - Walt Disney World"}]
