[{"comment_id":"763624153793368","commenter_b":"@username..Bye Felicia, go suck an egg","commenter_a":"I would waited until he falls asleep, and pull me a loreana bobbitt ...get a Surgical scapple do a nice clean quick slice, get me some tweezers and carry it and throw it on the freeway, and let someone run over it. it ain't big anyway. second scenario, get some super glue and glue his little hands to his little tilwinkle!","post_message":"Did you catch this moment from Melania Trump at the inauguration?  Via In The Know"},{"comment_id":"1096402407066897","commenter_b":"Girl, bye. If you indeed weren't trying to get over on our great state, you have nothing to worry about, right?? Hey, you may very well be a crook...","commenter_a":"He said.....she said. Truth is most likely somewhere in the middle. Pffffffft...","post_message":"It does kind of smell like revenge. What do you think?"},{"comment_id":"10153622542063188","commenter_b":"No","commenter_a":"Get serious","post_message":"Would you sign it?"},{"comment_id":"10153130429581162","commenter_b":"If prostitution ever becomes legal, you can sign your kids up freak.","commenter_a":"Making prostitution illegal is as stupid as pot being illegal. Regulate, tax and monitor.","post_message":"NEW: NFL Hall of Fame lineman Warren Sapp arrested for allegedly hiring a prostitute after covering the Super Bowl for the NFL Network: @webpagelink"},{"comment_id":"10154488301629228","commenter_b":"Good God she's a monster","commenter_a":"This woman is a liar, she lied to the police about Betsy Faria's death and her role in it and tried her best to imply Russ had killed his wife. Why she's not in jail is beyond me. I think this new story stinks to high heaven and hopefully the O'Fallon PD does a very through investigation. This woman is dangerous, avoid her for your own safety","post_message":"\"For him to be alone at all is shocking for me.  He doesn drive.  He doesn leave the house by himself."},{"comment_id":"10154884349326509","commenter_b":"Donald Trump would not try to lock the WW2 vets from their own memorial or lock American school kids out of the WH like the pho9ny Obama & dem's did. Pelosi would not even talk to the vets because she was speaking to a group of illegals. However, the scourge is claiming a very fraudulent amount for her retirement, way up in the 6 digits.","commenter_a":"It's still related to DDay and that was sent around by far more than him. Get over it, at least he was honoring the event.","post_message":"Donald J. Trump tried to remember #DDay with a photo that wasn't from D-Day."},{"comment_id":"10153157305281636","commenter_b":"very wicked woman ! she deserve it.","commenter_a":"The states where the capital punishment extists are muderers on the level of the nation.","post_message":"Even Pope Francis made a last-minute appeal for clemency"}]
