[{"comment_id":"10153706337066694","commenter_b":"Point out the sarcasm in your original statement. You SUCK at humor AND sarcasm.","commenter_a":"Yes, because we should assume \"diets\" were a thing because bitches could bake bread....","post_message":"Deal with it, paleo dieters."},{"comment_id":"632124420311470","commenter_b":"Of all the garbage o n tv every night and they r bitching about this, cmon really! This right here is the reason we need to get rid of the shit in govt","commenter_a":"That's funny, Liberals complaining about a woman uncrossing her legs When has this been an issue for them? This is why liberalism equals hypocrite.","post_message":"Liberals want FOX News taken down after yet another wardrobe malfunction. This is ridiculous. FOX News hosts are classy, we support them! Do you support ALL FOX News hosts?"},{"comment_id":"10153785044865950","commenter_b":"GO TRUMP","commenter_a":"The Clinton both were disbarred. All class. Lock her up","post_message":"Ivanka Trump, who's been dragged into the conversation, clearly established her position."},{"comment_id":"1649233105382359","commenter_b":"@username well it doesn't seem to be on the minds of the ones that are. If it was they might not have sex at that moment","commenter_a":"That is nothing to brag about. You should find some other talking points to criticize Trump on. Abortion should be the last thing on a 14 yr old girls mind.","post_message":"Actress Ali Wentworth: When Trump Won My 14-Year-Old Daughter Complained There’d be “No Abortions!”"},{"comment_id":"10153450529443352","commenter_b":"Livid??????? I would shut that MF down. ...Bastards","commenter_a":"Omg some one is responsible for this ok.who","post_message":"Mom Livid When Her 3-Month-Old Baby Girl Has Bruises on Her Face After Daycare"},{"comment_id":"10153172623814153","commenter_b":"I don't have compassion because of their careers I have compassion because I'm human","commenter_a":"How many of you would be screaming compassion if he wasn't a cop? And a history of DUI? Please. I have no compassion for anyone who drives drunk or gets into a car with a drunk driver.","post_message":"MVC Records: Officer Pedro Abad Jr., driver in deadly Staten Island crash, had 2013 DUI in Rahway. Read more: @webpagelink"},{"comment_id":"10152587508455163","commenter_b":"She read them their rights! Envyherlashes Tawana","commenter_a":"@username girl yes I was so happy Amber told them hoes wat it really IZ it's was going on ALLDAY yesterday!!!!!","post_message":"Amber Rose responds to Khloe Kardashian after calling her out for Kylie and Tyga comments"}]
