[{"comment_id":"720102644820493","commenter_b":"Niggaz","commenter_a":"Stupid ass liberal niggas..","post_message":"\"All White People Are Racist.\""},{"comment_id":"1284879431547513","commenter_b":"ve que no es vara :)","commenter_a":"@username Sergio Boudet lo que hablabamos el otro dia","post_message":"Colorado kept $1 billion away from drug cartels last year."},{"comment_id":"1538272953143656","commenter_b":"Benjamin Edward I do!!! I like this takes place in Brooklyn too!","commenter_a":"Benjamin Edward","post_message":"Mark Ruffalo and Bernie took a walk through the Brooklyn, New York school yards where Bernie grew up, and talked about his childhood, why he got involved in the Civil Rights Movement and how those experiences translated into his life in politics and this movement. (Directed by Matthew Cooke)"},{"comment_id":"10153575814345950","commenter_b":"Fuck trump POS!","commenter_a":"Thry are all illegal wall jumpers. Come back to the US after u grow up","post_message":"\"No hate in our state,\" demonstrators chanted early in the day, with a few carrying Mexican flags in protest of Trump's anti-immigrant policies."},{"comment_id":"10154111974819726","commenter_b":"check out her multiple lies prior to this...this chick is no journalist","commenter_a":"I can believe a liberal reporter pulling this nonsense stunt, but not someone from Breitbart! Conservative commentators have lost all respect from me if theyre going to pull these moves against anyone.","post_message":"WATCH: The now infamous video of Trump's campaign manager Corey Lewandowski allegedly grabbing Michelle Fields. What do you think happened?"},{"comment_id":"10152705081476519","commenter_b":"And have lots of sex in ur ass ur gonna get raped first","commenter_a":"You might be interested in Googleing why it was banned. Few today would believe the pseudo-science mumbo jumbo presented as fact to Congress. 1) Smoking marijuana will make black men want to rape white girls. That's girls not women. There is ZERO evidence here. 2) Smoking marijuana will make young men more likely to experiment with homosexuality. THAT may be true, but the rest of the presentation turned that simple statement into more of an assertion that it would turn young men gay.","post_message":"\"It is time for us to replace the failed prohibition with a regulatory system that works and let states and municipalities decide for themselves if they want, or don't want, to have legal marijuana within their borders.\""},{"comment_id":"10153618824494778","commenter_b":"Lol jk","commenter_a":"At least we don't recruit murders us losing having killed anyone can the patriots say that....stfu period.","post_message":"Last summer, #Redskins Daniel Snyder said during an interview that the team was exploring the possibility of a new stadium. Now they're asking season ticket holders for input."}]
