[{"comment_id":"180851402403803","commenter_b":"Your a dumb bitch 😂😂","commenter_a":"@username dude this reminds of all of us 😂😂😂","post_message":"Friends like this  #WSHH"},{"comment_id":"10154291489851130","commenter_b":"*woman","commenter_a":"I am a women and I agree with pence!","post_message":""},{"comment_id":"1089539017791300","commenter_b":"Hillary belongs in jail! Do your job Congress.","commenter_a":"I would think about why she dosen't answer the question","post_message":"This state rep took a huge stand against Hillary and even called her out at one of her rallies.  But the rep had no idea what she had gotten herself into.  Now she says she carries a gun because of what Hillary's goons have done to her."},{"comment_id":"10154801850791509","commenter_b":"Probably all the women appearing on TV to tout his brilliance.","commenter_a":"If relationships toward women was a deciding factor than Bill Clinton never would have been president. Bill had several women accused Bill Clinton of sexual attacks. How many women have accused Trump?","post_message":"Republican National Committee Chairman Reince Priebus says Donald J. Trump \"is going to have to answer for\" his behavior around women — but also says Trump's presidential campaign isn't being judged based on his personal life."},{"comment_id":"10154385047759714","commenter_b":"Mmm seems she has friends in high place above the law she is!","commenter_a":"RIP America....","post_message":"1916: The first woman is elected to Congress.  2016: The first woman wins the Democratic race for president. #Election2016 @webpagelink"},{"comment_id":"1595582267404994","commenter_b":"Where in the work would you ever get an idea like that???? You stupid woman!!!!","commenter_a":"This person is so ate up","post_message":"not too bright..."},{"comment_id":"10152816075404753","commenter_b":"Wtf?? They should def prosecute dem bitches fym.. they gone go and do that same shit over over again smh","commenter_a":"When we know better we do better.so much apparently went wrong way before the baby was born. Let's solve all the issues leading up to the drop off.lack of birth control lack of medical attention for both mother and child.lack of protection from sexuality transmitted diseases.we all failed here.so let's beat up the mother who had the cottage to face up to the fact that she lacked the ability to raise this child.we can do better than this","post_message":"Colorado has a Safe Haven for Newborns Law, which means a parent can drop off a baby at a hospital or fire station within 72 hours after birth without being prosecuted."}]
