[{"comment_id":"852381858149314","commenter_b":"she is a total ASSHOLE and the biggest racist along with her husband. could just imagine how they are raising the girls.","commenter_a":"The only thing I see that she's done is screw the guy that planned to lie, cheat, steal his way into the white house. She did, he did, and they keep going.","post_message":"INSANE VIDEO: IT’S GRADUATION TIME...AND THAT MEANS IT’S TIME FOR OUR RACIST FIRST LADY To Spew Hateful Lies And Rhetoric About Racist White America And The Mistreatment Of Blacks ***WARNING****It's hard to watch this video filled with lies and anger toward white Americans without feeling like your head is about to explode!"},{"comment_id":"10153081516228822","commenter_b":"Eliza sounds like she's the one going to hell.","commenter_a":"Why is this topic constantly being forced down our throats","post_message":"It was a historic day for marriage equality in the US -- and Pittsburghers had a lot to say."},{"comment_id":"10153031341999705","commenter_b":"Sunset Avenue Dove Dove","commenter_a":"I need this in Florida!!!","post_message":"Ok, Starbucks."},{"comment_id":"1410720895627548","commenter_b":"DISMANTLE THE USELESS ORGANIZATION CUT THEIR FUNDING !MONEY TALKS,","commenter_a":"I hope so!","post_message":"Is Trump getting closer to supporting H.R. 1205, the 'American Sovereignty Restoration Act,' to cut ties with the UN?"},{"comment_id":"1266627376716224","commenter_b":"No one has said no to immigration, just no to ILLEGAL immigration. And NO to ILLEGAL CRIMINAL immigrants! Wish you people would finally get it.","commenter_a":"white old man...","post_message":"As the son of an immigrant father who came to this country with no money and little education, I understand that our greatest strength is our diversity. We are a nation of people who have come here from every corner of the earth. We practice many religions. We are gay and straight. We are black, white, Latino, Asian American and Native American. Mr. Trump. Your job as president is to bring people together, not divide them up. Support comprehensive immigration reform, not mass deportation."},{"comment_id":"10154886210018984","commenter_b":"If you assholes would only enforce our freaking laws there would be no need for the wall!","commenter_a":"The US can do anything when it puts it's people to work. Understandably, a physical wall can not be built in certain areas but our very brilliant problem solvers will find solutions for that. OBAMA never wanted to secure the border. Trump will turn loose the ingenuity of AMERICANS & the job will be done.","post_message":"The Republican Party is not wasting ANY time. Right after Donald Trump defeated Hillary, the GOP let everyone know where it stands on the wall..."},{"comment_id":"439236556264638","commenter_b":"Put her in prison where she belongs.","commenter_a":"We need Hillary this country can't survive another repuck in the white house","post_message":"This is INSANE..."}]
