[{"comment_id":"1042027782504360","commenter_b":"Bitch would've been sucking soup out of a straw...","commenter_a":"This warms my soul.","post_message":"This is some serious racism. Would you have slapped her after she spit on you?"},{"comment_id":"10153644045081037","commenter_b":"Democrats do not want her. She can go away now.","commenter_a":"It's mean she's a Democrat, Yahoo.","post_message":"Should the candidates be concerned that a large portion of the “people” reading their tweets are fakes?"},{"comment_id":"10154767711621729","commenter_b":"There is a possibility that he wont be Trumps VP ,....because he is considering the VP job with Hilary....just saying","commenter_a":"don't wanthe little bitch","post_message":"Never say never?"},{"comment_id":"1111506912205431","commenter_b":"The video basically implied that Donald Trump was a racist simply because he doesn't want illegal immigration in this country. There is an enormous amount of drug trafficking, Sex trafficking and a lot of bad people are coming through our borders. Yes their are a lot of great Latinos in this country and my husband is one of them but what basically everybody is saying is that Donald Trump is a horrible person and a racist simply because he wants to stop illegal immigration in this country. let's not get started on what people are saying about Donald Trump supporters. That we're ignorant that we are racist. And please don't lecture me on how I should respond to things! Like I'm some child in a classroom and you're the teacher. You're being extremely condescending.","commenter_a":"This is total bullshit!!Mexicans that think we are racist because we want to have a wall how about the wall you have between Guatemala and the Mexico border. None of you ever answer that question. (and if you want to get technical it's not a wall it's a huge fence with Barbwire on top of it)And I'm not a racist my husband is Latino and my children are considered biracial so stick it where the sun don't shine,I don't want to hear any of that crap.The people in this country are totally fine with legal immigration it is illegal immigration that Americans have a problem with. I don't see Mexico having open borders and even if they did they certainly wouldn't be giving illegal immigrants welfare food stamps Medicaid I could go on and on and it's all being paid for by the hard-working American taxpayers.it sucks when you live ...","post_message":"The Latino community has a powerful message for Donald Trump.  #MicBrights"},{"comment_id":"597418893776211","commenter_b":"'@username Jill stein is a communist and belongs in jail for vandalizing construction vehicles at standing rock and she's crazy","commenter_a":"Bernie needs to take a young politician under his wing and mentor them so one or two elections down the road the only politician in america with a moral bone in their body isn't pushing 90.","post_message":"Mr. Trump, you told working people you were on their side. You know what? Millions of us are going to demand you keep your promise."},{"comment_id":"942676889125393","commenter_b":"Is she ROYALTY ?","commenter_a":"How much did the vet charge?","post_message":"60-stone woman lifted out of her home by a crane in a SEVEN-HOUR emergency operation"},{"comment_id":"10153939365405329","commenter_b":"Las lamparas y el cosito para escurrir los cubiertos <3","commenter_a":"Invente o si te gustan los elefantes @username","post_message":"Because elephants are beautiful and lovely and perfect. (via BuzzFeed Animals)"}]
