[{"comment_id":"10154488301629228","commenter_b":"Good God she's a monster","commenter_a":"This woman is a liar, she lied to the police about Betsy Faria's death and her role in it and tried her best to imply Russ had killed his wife. Why she's not in jail is beyond me. I think this new story stinks to high heaven and hopefully the O'Fallon PD does a very through investigation. This woman is dangerous, avoid her for your own safety","post_message":"\"For him to be alone at all is shocking for me.  He doesn drive.  He doesn leave the house by himself."},{"comment_id":"10155763487209951","commenter_b":"About time our officers and first responders have someone who supports them, instead of condemning them before the whole story is revealed. Thank you, President Trump!","commenter_a":"Umm gun control. Might help with that","post_message":"WATCH LIVE: President Trump speaks to top police chiefs and sheriffs at the Major Cities Chiefs Association conference."},{"comment_id":"472875716234055","commenter_b":"fk you brenda","commenter_a":"Idiots!!!!!!!!! disgraceful cannot wait till they are gone from the white house.","post_message":"I cannot believe they DID THIS on the same day! I am sick and tired of a president that doesn't care for our Marines and Veterans!"},{"comment_id":"10154167208567235","commenter_b":"@username pull the covers over your head !","commenter_a":"An apology? Are you kidding? How about publicly embarrassing the asshole who singled this man out? \"Land of the free\" my ass. More like \"police state of fear\". This is disgusting. What stereotyping trash people have become.","post_message":"“She kept staring at me and I didn’t know what was wrong,” he explained. “Then I realized what was happening and I just was thinking ‘I hope she’s not reporting me.’”"},{"comment_id":"10153529159371770","commenter_b":"That's another reason he is known as lying Ted!","commenter_a":"what do you have to say now cruz? ha ha","post_message":"'Donald J. Trump is not getting to 1,237. No one is getting to 1,237.' #ThrowbackThursday"},{"comment_id":"1439879839405093","commenter_b":"@username this the lady I was talking about","commenter_a":"So beautiful I'd do the same without a doubt","post_message":"After her daughter's battle with leukaemia left her unable to carry to full term, Theresa offered to become a surrogate and gave birth to a healthy boy ❤️"},{"comment_id":"10152602108687061","commenter_b":"And a fat hoe","commenter_a":"Michelle looks more like a hoe everyday","post_message":"Pres. Obama: \"I have no more campaigns to run.\"  (audible clapping in chamber; pause)  Pres. Obama: \"I know, 'cause I won both of 'em.\" #SOTU2015 -- (click for audio) abcn.ws/1JbdOLY"}]
