[{"comment_id":"10153195782398984","commenter_b":"she is a witch","commenter_a":"She's a BIG box of rancid nuts , and there are plenty more in there with her !!!!!","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"1393467647339928","commenter_b":"Yep, that is exactly what I believe!","commenter_a":"I was a democrat and anti gun, after I saw San Barnadino I changed my opinion .rump is right if we had few people in that work place gun straped around their hip bullets would have go the other way too. We could have kill those radical fanatics right there and the death toll of Americans would have been much less. I can guarantee that.","post_message":"BREAKING: NRA endorses Donald Trump at national convention"},{"comment_id":"10153471802056336","commenter_b":"It's a woman's choice regardless Patricia","commenter_a":"And is a distortion of the truth. No body parts were offered for sale. This is a complete propaganda that Ted Cruz is too stupid to know to avoid. Dumb canuck.","post_message":"\"These tapings of Planned Parenthood selling body parts are grotesque. It highlights the evil of what they're doing.\" – Sen. Ted Cruz"},{"comment_id":"10153835285409024","commenter_b":"I think legal American cititzens should be allowed to shoot illegals when they enter the US!","commenter_a":"AGREE!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1181554231878327","commenter_b":"The Federal government now going to decide about bathroom attendance? Gimme a break and Kill some ISIS and seal the dam borders! North Carolina laws are for North Carolinians! Don't like it than stay out!","commenter_a":"The most ridiculous law ever! Where the F_ _ K to you folks think these HUMAN BEINGS were going to the bathroom before?? Surprise....right next to you and you never knew it! Poor NC....losing all that money and those jobs because of an arrogant Governor who is hardly worth the job that the PEOPLE voted him into!! #LOVEALWAYSWINS","post_message":"It's the federal government being a bully. This unrealistic deadline by the federal government to the ninth largest state is quite amazing.\""},{"comment_id":"10154173460986051","commenter_b":"What a bitch and that's why I hate all cops in Los Angeles county","commenter_a":"I hope the lawyer does right and gives the kids family money instead and locks up women and her husband and who ever else was involved because the cops at the scene should of did breathalyzer it's the law when they're a wreck to make sure alcohol or drugs is a factor poor family's who have to Deal with this and prayers the kids family's win big","post_message":"This woman was driving home from a bar when she smashed into three kids. Now she's suing them. Guess what her husband does for a living."},{"comment_id":"1414146828610887","commenter_b":"If he can't deal with everyday life maybe he should be committed to a facility that can help him. In other words he is nuts.","commenter_a":"Oh boo hoo, here is a tissue, grew up your in college time to man up","post_message":"College Kid Demands Counseling After Being 'Traumatized' By Seeing The Confederate Flag Sticker Our society is getting out of control. Do you think this is ridiculous?"}]
