[{"comment_id":"2169846419907186","commenter_b":"Don't listen to Nikki's Parra she needs to go back to school and take a history class or two cause slavery wasn't about a protest and it didn't end cause of one as well","commenter_a":"These people doesn't really know anything. They only wanna learn and hear what they want to hear and learn that is not against to them. Shame on you all! Get back to class and get a better future rather than this. Best revenge is to get educated!","post_message":"Students at East Los Angeles College and more than 100 colleges across the country walked out of classes and held rallies in protest of Donald Trump’s election as president. @webpagelink"},{"comment_id":"10158501442080389","commenter_b":"Why is she in our country?","commenter_a":"March away and try not to get run over by a car or truck. Most of us have jobs and families to tend to.","post_message":"Despicable."},{"comment_id":"10154357911453812","commenter_b":"Except that some women don't make milk","commenter_a":"Breastfeeding should be promoted! I don't know how much further folks can ride the PC train. Hope it crashes soon.","post_message":"The U.S. Preventive Services Task Force is keeping its 2016 recommendations in support of breast-feeding nearly identical to those issued in 2008, with the exception of deleting one word: “promote.”"},{"comment_id":"218545795283614","commenter_b":"Children in poor areas should not be doomed to poor schools.","commenter_a":"Yes, The GOP has lost every bit of self-respect they ever had. To vote Betsy DeVos in as education secretary with no educational experience is just irrational. If Betsy were smart she would decline the office and get the hell out of town now. She will not survive as educational secretary.","post_message":"Republicans just sold our public schools to the highest bidder.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154140456978256","commenter_b":"Sara Califf.....Illinois doesn't have a taxing problem... They have a spending problem.... Bloated government is Illinois problem.... Too bad the pensioners are the ones who will suffer","commenter_a":"Democrats need to raise taxes to keep Illinois, and Chicago government revenue stream to maintain the bloated government.... Probably need to build a wall around Illinois first, to keep resident's from leaving for other states","post_message":"Election-seeking Illinois Comptroller Leslie Geissler Munger plans to delay monthly paychecks for lawmakers and statewide officials, saying there isn't enough money to pay the state's bills and other services should go to the front of the line."},{"comment_id":"10153162026679091","commenter_b":"Stephanie, he wants ILLEGAL immigrants gone. And Americans have been doing just fine before the influx of Mecican Illegals before and will after!","commenter_a":"He'll be crying when there is nothing for him to eat because its the immigrants that work the field for our food, and run our plants that provide our meat. He wants immigrants gone, he should be the first to leave. Give this land back to native American people, the earth was pure and clean. Be a leader Trump, lead yourself out","post_message":"Donald Trump has released his specific plan for immigration reform: @webpagelink"},{"comment_id":"1084755811580947","commenter_b":"She well be Charming President .","commenter_a":"Unless Democrats want to see President Obama hand over the keys to the White House to Donald Trump, we Bernie and Hillary supporters had better start aiming attacks at Trump and the Republicans, and not at each other.","post_message":"'She cares. She tries. She perseveres. And now she has a chance to tell the story she’s always wanted about America: the story about a country that found the courage to turn away from our darkest impulses; that chose to embrace our growing diversity as a strength, not a weakness; that pushed the boundaries of opportunity outward and upward, until there are no more barriers, and no more ceilings.' —Jon Favreau, President Obama's former speechwriter"}]
