[{"comment_id":"10153466375525575","commenter_b":"She got her 15 minutes of fame. Should go dance on a pole now! What a ho!","commenter_a":"Magan sure isn't winning any thing after Howard strearn show about her sex life and now these pictures are coming out of Her.","post_message":"The Gateway Pundit - Donald Trump Builds on Lead After First Debate – Ted Cruz Surges to Second"},{"comment_id":"10154120188266770","commenter_b":"She is not funny anytime","commenter_a":"It painful just to watch het","post_message":"Amy Schumer was hard to watch."},{"comment_id":"922572661194216","commenter_b":"Yep, she's illegal.","commenter_a":"Karma people, Karma! What you put out towards an innocent child will come back to you and it's well deserved.","post_message":"Ivanka Trump announced the arrival of Theodore James Kushner on Twitter."},{"comment_id":"10153513325884614","commenter_b":"Brianna Paino","commenter_a":"I was told so it maybe BS. There is no law stating what direction the car is to be pointed. Say backing up in a lane at a stop.","post_message":"Dramatic cellphone video captured a dangerous scene in the Hollywood Hills: an Audi driving backwards for miles on a narrow and windy stretch of Laurel Canyon. Kevin Zanazanian, who shot the video, told KTLA the stunt jeopardized the safety of pedestrians and motorists. He said he recorded it for safety reason. After the video was uploaded to YouTube, the Los Angeles Police Department said it was investigating the incident and working to identify the driver, whose identity remains a mystery. Read KTLA story here: @webpagelink"},{"comment_id":"10153003636601167","commenter_b":"Conspiracy--Huh,,,, Just MORE REPUBLICAN,,,LIES !!!!!------Why don\"t republicans want \" Regular Americans \" to have Obamacare ( ACA) ?????--HATE for the BLACK MAN, in the White House !!!!! Republicans,, STILL INSIST,,,,Racism Doesn\"t Exist ---YEA,,RIGHT !!!","commenter_a":"Not again \".,(;#!!:#$,:that Damn Obama. Lol","post_message":"LOL."},{"comment_id":"850932761669644","commenter_b":"Send her over better yet send her kids not mine","commenter_a":"I hate to break this to some people but the only Americans that are there any legitimate threat from Isis are the Americans were going to be sending over there..... Somehow Obama has managed to kill over 10,000 Isis fighters by dropping bombs without one single American military casualty..... Why change the game plan now?","post_message":"Do you agree with Rep. Barbara Lee?"},{"comment_id":"10154472400523645","commenter_b":"Pisses me off as much as a person on death row getting a heart transplant. Only in California","commenter_a":"I thought convicts were entitled to three squares, dental, and health care, not wants. How could the state be legally required to pay for it? this operation had nothing to do with his health. Just because he believed he was a woman? Well how many of the inmates believe they are innocent? Shall we bow to their wants and beliefs?","post_message":"Shiloh Heavenly Quine - convicted of first-degree murder, kidnapping and robbery for ransom - had the surgery in San Francisco on Thursday. She will reportedly be moved to a women prison after leaving the hospital. The state was legally required to pay for the operation."}]
