[{"comment_id":"901769206549495","commenter_b":"Perhaps in fantasyland he's becoming a woman, but not down here where I spend my time - ON EARTH.","commenter_a":"Sorry Bruce, you're NOT becoming a woman - that's impossible. Your just taking hormones, and chopping your John-Thomas off.","post_message":"'Hey, guys, I'm becoming a woman' (Via Daily Mail Celebrity)"},{"comment_id":"10152694140572452","commenter_b":"Joanna Funes wtf lol","commenter_a":"Ewww I mean it this for real? Nikki Deleon Lexi Richman Ashleigh Gray","post_message":"WHAT'S THAT SMELL? Burger King announced Wednesday that it will soon be selling a Whopper-scented perfume @webpagelink"},{"comment_id":"10153600166447217","commenter_b":"^That is a true life goal","commenter_a":"@username And we're sat here watching tv and being casual XD","post_message":"Life goals."},{"comment_id":"1083559065045639","commenter_b":"She would have to pay me to go listen to her garbage.","commenter_a":"Are you listening Mom and Dad?","post_message":"What an incredible waste of both time and money. Blow it on beer, or burn it for warmth. Both better ways to spend your cash. Y'know, since college kids always have an extra three grand lying around."},{"comment_id":"935434433239352","commenter_b":"She sure don't know how to talk right lol. She should be mad she left the house looking half ass dressed. Look like she rolled outta bed and didn't bother to fix her face or hair.","commenter_a":"I tell you this ...you come to this neck of the woods and that bitch would be laid out lol ...and to all them punk ass people who didn't speak up are as much of a pussy bitch made ass punk who probably have kids the same as them ...people need to stfu and let people be ! .... The bitch talking aint perfect either so who is she to talk ! ...bitch ....sit down no one is god and cant judge ...so stop judging !","post_message":"This is the harsh reality so many trans people face every single day. #MicBrights"},{"comment_id":"10152910753726336","commenter_b":"Reality check!!!!","commenter_a":"REALLY! If you believe this I have beachfront propoerty to sell you in Arizona, can you say \"stupid Americans\"!","post_message":"Do you agree? #SOTU LIVE coverage: @webpagelink"},{"comment_id":"1250923198278313","commenter_b":"Another add payed for by the Clintons","commenter_a":"What happened to the American people deciding who will represent us. I'm so tired of this political old timers dictating our path","post_message":"“[Donald J. Trump] is a dangerous demagogue completely unsuited to the responsibilities of a United States president.” - Bruce Kovner, who has donated nearly $3 million to the Republican party"}]
