[{"comment_id":"1218171641599870","commenter_b":"She's a COOK","commenter_a":"Wow! Mr. Anderson Cooper. Thank You!! It gives me hope for CNN.","post_message":"Anderson Cooper must have hit a nerve! He just suggested to Elizabeth Warren that the Democrats might be \"out of touch\", and she was NOT happy."},{"comment_id":"10153240957300950","commenter_b":"We need a new president - but not Hillary!","commenter_a":"Putin keep up the good work","post_message":"\"He needs to go after the people who killed Russian citizens,\" Obama said of Putin."},{"comment_id":"1167345089975985","commenter_b":"The real unemployment rate is 14% and the only people seeing their wages go up are professionals. So the middle class is not seeing any sort of economic relief.","commenter_a":"the new way the jobs report is calculated was a bi-partisan effort to lower the number of unemployed statistically (94 million americans are not participating in the job market) The GDP number is now a much better statistic about the economy. That number is LOW. way to low.","post_message":"Trump says the economy is in a deep hole. The latest jobs data suggests otherwise."},{"comment_id":"10152804039052293","commenter_b":"Wonderful news she was untouched, hope her family has a quick recovery.","commenter_a":"Amazing. I also wonder what brand car seat, because I wish to buy that for every expectant parent I know","post_message":"“Then they said her eyes opened and she started smiling,\" a relative said."},{"comment_id":"10153842113264877","commenter_b":"She need to go away!","commenter_a":"Is Sinead even relevant anymore?","post_message":"Arsenio Hall Sues Sinead O'Connor For Millions For Claiming He Fueled Prince's Addiction And Drugged Her. Read more on the lawsuit here.   Grio fam, what do you make of this lawsuit and Sinead's claims?"},{"comment_id":"10154014053348984","commenter_b":"SHES A RACIST BIGOT ANYWAY","commenter_a":"I don't know anyone that likes that show, or doesn't think that Whoopie is whoopie.","post_message":"Donald J. Trump has had enough with the liberal ladies of \"The View.\" In just one word, he absolutely destroyed host Whoopi Goldberg... this is brutal.  This goes to prove one thing... never pick a fight with The Donald."},{"comment_id":"10155108703501320","commenter_b":"Take a good look at the non Christians. What ever you do this the least of theas you do to me","commenter_a":"No one, has the right to decide about the live of a anborn child. Every one has the right to live and be loved","post_message":"WATCH LIVE: We're at the The March for Life where thousands of anti-abortion activists are marching on Washington."}]
