[{"comment_id":"857720034363387","commenter_b":"This crap has to stop!!!!We do NOT need hillary and another 4 years of obozo and their evil ways-they have destroyed this country--we can not afford all these immigrants---we have to take care of our own first!!!!!","commenter_a":"They'll vote for Gary before Hillary.","post_message":"Exclusive: Federal immigration officials may be working overtime to swear in as many new \"citizen voters\" as possible before the presidential election, according to an internal Obama administration email disclosed to FoxNews.com by Republican Sen. Ron Johnson of Wisconsin."},{"comment_id":"1134794909920596","commenter_b":"He bitch ya breathe smells like shit I can prove it.","commenter_a":"Well thats what the little shit gets for fucking with a monkey","post_message":"Angry baboon throws poop in little girl's face! #WSHH"},{"comment_id":"900994056627010","commenter_b":"@username if it's their religion then they shouldn't have been lesbians in the first place but your comment speaks volumes about you","commenter_a":"Nothing to do with religion.","post_message":"Muslim lesbian and her vampire-loving girlfriend, then it gets weird"},{"comment_id":"474651159350328","commenter_b":"I had to take a class on how to handle union situations at wal mart.","commenter_a":"Ya outta see Targets 20 minute \"what to do if a union approaches you\" training video that every target employee must view before they are hired... It's Reduculus...","post_message":"In recent years Walmart has been labeled the bad apple in Corporate America, but recent news may give Target that title. ~Tanner"},{"comment_id":"10153308958722411","commenter_b":"Beyonce ruins everything!","commenter_a":"Blah","post_message":"What did you think of the Super Bowl 50 Halftime Show? Highlights: @webpagelink"},{"comment_id":"493650944158819","commenter_b":"Get rid of her","commenter_a":"Well her whole life she's been breaking the law, she corrupt .","post_message":"Hillary's career could be over after she was exposed doing this. Good. Let's end it right here, right now, once and for all. Do you agree Hillary Clinton should be relieved of her duties?"},{"comment_id":"10156658380360354","commenter_b":"Has anyone noticed how the name has changed from refugees to migrants. They are not migrants they are foreign invaders Some people will never learn. You need to know who you are letting in your country. Know the history of Islam. We need to wake up in this country stop paying people to come here and destroy us. This was copied from a post by William Parrott When politically correct, tolerant, and culturally diverse societies agree to Muslim demands for their religious privileges, some of the other components tend to creep in as well. Here how it works. As long as the Muslim population remains around or under 2% in any given country, they will be for the most part be regarded as a peace-loving minority, and not as a threat to other citizens. This is the case in: United States Muslim 0.6% Australia Muslim 1.5% Canada Muslim 1.9% China ...","commenter_a":"How can anyone say that their religion does not allow this violence against non - Muslims?","post_message":"“How dare you run away from us?” one Muslim man allegedly yelled. “Christian girls are only meant for one thing. The pleasure of Muslim men.”"}]
