[{"comment_id":"880910168618891","commenter_b":"Martial Law.... never heard of her. Lol. 2nd revolution needs to take off","commenter_a":"Rising up with guns will only give them what they want or need to bring down the hammer of martial law","post_message":"In case you missed it, here's our top story from Monday: It’s clear that if the U.S. is to restore human liberty and return to the Federalist system created by the Founders and since destroyed by Abraham Lincoln, the Federal Reserve Act, the 16th and 17th Amendments and an activist Supreme Court that abused the 14th Amendment, one step — and probably the first step — must be to repeal the 17th Amendment. Repealing the 17th Amendment would take the money out of Senate elections on the federal level. Senators would be beholden to their state legislatures again rather than the corporatist class that lines their pockets, finances their re-election campaigns and ensures them seven-figure lobbying gigs once their time in “public service” ends. Senators would not act against their states, as 12 senators from 10 states are currently doing in regard to President Barack Obama’s executive action on amnesty for illegals. @webpagelink"},{"comment_id":"10153910519885695","commenter_b":"What a pig.","commenter_a":"He should be castrated .","post_message":"Jared Fogle's attorneys asked a judge for leniency, saying he is 'profoundly sorry.'"},{"comment_id":"10153375560764087","commenter_b":"'We should let all the Muslims in or they'll kill us.' -What Liberals actually believe","commenter_a":"Is rep McCaul suggesting that a large percentage of otherwise peaceful and law-abiding Muslims are ready to put that to one side and become violently active simply because someone like Trump says something outrageous? Why does McCaul place such low faith in the Muslim community? And if he is right then isn't he proving Trumps point?","post_message":"“Anytime somebody is making inflammatory statements about Muslims or whatever, they can take that and use it to their advantage for recruiting purposes,” House Homeland Security Committee chairman Rep. Michael McCaul. “They take things like this and they spin it, to inflame the Muslim world, to get more recruits to join the cause to fight in Syria.”"},{"comment_id":"10153219350514486","commenter_b":"She should EAT SHIT AND DIE !","commenter_a":"Should have been the day after she was elected","post_message":"Now that Harry Reid has announced his retirement, some Democrats think it time for Pelosi to do the same..."},{"comment_id":"1700232733582570","commenter_b":"Lose with Cruz.... I like it","commenter_a":"Having recently switched parties for 'one day' Republican status I will vote cruise to stop Trump in April 26 Pennsylvania primary then probably vote for Hillary in November. Question: what is the brand of the dress Nicole Wallace wore today?","post_message":"Joe and Mika are here to discuss the state of the 2016 race following the Wisconsin primaries – and much more! #24Live"},{"comment_id":"817688164952017","commenter_b":"Chesimard is a scum pig who needs to be extradited back to NJ to finish her punishment.","commenter_a":"And they wonder why there is racism in American. They are the worst and the rest of us are reacting to this sort of crap and the disproportionate numbers of black's in prison. Clean up your own house first and quit committing crimes and we might actually start to listen. Until then FY.","post_message":"[Video] INSANE LIST OF DEMANDS BY BLACK COLLEGE STUDENTS Includes Naming College Hall After Notorious Cop Killer"},{"comment_id":"1380609545301335","commenter_b":"GOOO NORTH DAKOTA, WISCONSIN, CA. , NEW YORK BRING IT ON IN!!!!! ALL ABOARD NEXT STOP THE WHITE HOUSE!!! ADDING COAL TO THE TRAIN!!! MEDIA,MEDIA, MEDIA!!! NO MATTER HOW YOU TRY YOU CAN'T TRUMP THE DONALD!!!! CRUZ KASICH =ESTABLISHMENT'S COCKROACHES!!! A VOTE FOR THEM IS A VOTE FOR HILLARY OR BERNIE!!!!!! ALL ABOARD !!!! NEXT STOP THE WHITE HOUSE!! T TRAIN R ROLLING U UNITED M MOVED BY THE PEOPLE P PRESIDENT TRUMP","commenter_a":"Any word on royal booze taster Glenn Beeks and his daily abuse of Christianity. I mean what a embarrassment that guy is using God and Christianity to prop up that disgusting philanderer Cruz","post_message":"It's a super religious day or something, he maybe thinks."}]
