[{"comment_id":"10153481286598984","commenter_b":"Let's get this evil son of ? Out of office","commenter_a":"Wake up America Obama has an agenda and he is working it!","post_message":"This DHS agent just admitted the truth about Obama's disturbing agenda... so Obama sent his officials to do something terrible to her DAUGHTER. What do you think?"},{"comment_id":"10153457449933128","commenter_b":"All is Nestle fault. They should be ban from around the world.","commenter_a":"India is member of BRICS (Brazil, Russia, India, China, South africa) and pro RUSSIA. does it make sense?","post_message":"The FDA issued more warnings about snacks imported from India than any other country this year. One import was blocked because it “appears to consist in whole or in part of a filthy, putrid, or decomposed substance or be otherwise unfit for food.”"},{"comment_id":"10153402450349456","commenter_b":"And he's out on bond in Montgomery and Elmore counties? What a joke","commenter_a":"Thug life is no good.","post_message":"One official said this is the worst case of home repair fraud he's ever seen. The suspect is also facing a murder charge in Elmore County."},{"comment_id":"10155095813944203","commenter_b":"KEEP IT UP DEMS!!!👍🗽🇺🇸","commenter_a":"There should also be a petition to all cable carriers to remove FOX from their channel line up as this network is a danger to America. Tell advertiser to boycott FOX.","post_message":" misled the Congress and he misled the American people."},{"comment_id":"10152980624100667","commenter_b":"Not.","commenter_a":"The Ross Perot of the 21st century :/","post_message":"Donald Trump declined to rule out a third-party presidential bid Thursday if he loses the Republican nomination. \"I will not make the pledge at this time,\" Trump said at the start of the GOP prime-time debate."},{"comment_id":"10155069293808010","commenter_b":"@username well since trump is saying illegals voted for Hilary!!! I'm being sarcastic you Troll!!","commenter_a":"Oh let me guess they were illegal immigrants 2","post_message":"He operated the scheme for two years from behind bars. He and an accomplice made more than $600,000."},{"comment_id":"10153090995473984","commenter_b":"They both need to be jailed or shot as the traitors they are!","commenter_a":"Dems must be psycho after all she has had to do with the deaths of Stevens etc she thinks SHE should run for POTUS! The audacity of entitiled politicians is RUDE!!","post_message":"She probably thought she had gotten away with it. Not so fast, Hillary... Should she face criminal charges for this?"}]
