[{"comment_id":"722009277961832","commenter_b":"Brunch?","commenter_a":"@username come visit","post_message":"Mark your calendars for Jan. 29. On that day only this year, more than 30 museums in Southern California will offer free general admission as part of the 12th annual Museums Free-For-All-Day."},{"comment_id":"10152768405859032","commenter_b":"Good!! She should appreciate the fact that she got hired & HAD a job!! What a dumb ass!!","commenter_a":"@username talk about #keepingitghetto hahaha!","post_message":"The boss didn't appreciate all those thumbs-down emojis."},{"comment_id":"10153600653569062","commenter_b":"Usa, invaded my country,so they have to clear the mess that's,they did over there then we'll back","commenter_a":"All you Muslim loving people need to move to a Muslim country and enjoy your Muslims.","post_message":"Your thoughts on this? Roughly two dozen sign-wielding protesters repeatedly tried to vocally overpower speakers at Texas Muslim Capitol Day."},{"comment_id":"10154427870651491","commenter_b":"She was deported because she is a felon!!","commenter_a":"Now if only the Native Americans could some how deport the illegal descendants who settled in America and forcibly stole their tribal lands in violation of Native American law, because that would be poetic justice.","post_message":"She inspired protests in Phoenix, Arizona when she was detained on Wednesday."},{"comment_id":"519047684966878","commenter_b":"I wanna know what is fallacious about my statement. If we can't afford social programs to help the people of this country, how the fuck are we gonna pay for a war? Not a Bernie fan, but you can't trash one candidate because \"We can't afford him\" when Trump wants to cut shitloads of taxes, and THEN try to finance a mass deportation, a war, and then a wall. Don't even get me started on how prices will shoot up on produce, as well as anything illegal immigrants touch.","commenter_a":"Honestly Bernie Sanders not winning would make me lose complete hope for the US. They are being presented with one of the most honest, genuine, good hearted humans possible, yet they prefer to give the likes of Donald Drumpf and Hillary Cliton their attention. Jesus help these poor people.","post_message":"Sanders doesn't think the delegate count matters right now."},{"comment_id":"10154578752917501","commenter_b":"How many actually paid attention and noticed that I was questioning the doctors- NOT THE WOMEN!!!","commenter_a":"I am ever in awe at the things they do at the Clinic. However, I have to wonder at the ethics. Performing a surgery that has major repercussions for the woman involved (anti-rejection meds, etc...) just so she can undergo pregnancy- which has its own set of dangers - seems ethically sketchy. There are so many unwanted children who need homes. Adopt.","post_message":"This is truly amazingThe Cleveland Clinic said the nine-hour surgery was performed on a 26-year-old woman, using a uterus from a deceased donor."},{"comment_id":"10152909457852869","commenter_b":"*morons* there is not an \"a\" in the word and you do not use an apostrophe in a plural. Have a nice day!","commenter_a":"Please do not compare the rattlesnake to Islamic Jihad. The rattlesnake believes in live and let live. Leave them alone and the rattlesnake will leave you alone!","post_message":"What do Islamic Jihad and rattlesnakes have in common? You don't negotiate with them, you don't feed them...you take their heads off before they bite you. WATCH and SHARE..."}]
