[{"comment_id":"10154174646349641","commenter_b":"That is so primitive to cage a living being and then let the others watch the poor thing. This is absolute human lowlesness as I call it, the worst specie in the entire universe for sure ! I hope humans will not go to outer space and colonize other planets and do the same thing what they did on Earth !","commenter_a":"Poor gorilla! Yes I agree the irresponsible parents are at fault for this incident.","post_message":"Ian Redmond, Chairman of The Gorilla Organization, said keepers had other options besides a fatal shot."},{"comment_id":"10153649665288352","commenter_b":"Also he still has a dick so HE is still a man. No woman has a dick and balls","commenter_a":"Kylie is the insensitive one for calling Catilyn her DAD ...","post_message":"KYLIE JENNER CHECKS CHRIS BROWN OVER HIS POST ABOUT HER DAD"},{"comment_id":"10153274022815326","commenter_b":"The DNC are the ones calling in the second string. I do like VP Biden, and respect him, but it is obvious that the DNC establishment see Hillary as a loser now. Senator Sanders is the ONLY candidate who is fighting for ALL of WE are the 99%. The media and their Oligarch Masters are afraid of Bernie Sanders, which is why they have been ignoring him. Bernie is fighting for WE the 99% regardless of race, age, gender, sexual orientation or beliefs. He should be getting 99% of ALL votes including republicans, democrats and independents. Let's all vote for our own self interests for a CHANGE. FEEL THE BERN? Everyone had better or we are doomed.","commenter_a":"The Dem establishment can't be too pleased if Biden does decide to run. Could hurt Hillary by splitting the establishment vote.","post_message":"Vice President Joe Biden is still figuring out if it is in his heart to run for President again in 2016. Biden is a fighter for the middle class, Ed Schultz and Katrina vanden Heuvel discuss. Watch the entire show at: @webpagelink"},{"comment_id":"10154009579409255","commenter_b":"It's an intense embarrassment for us here in Nevada. It's what happens when rational people don't vote in the midterm elections.","commenter_a":"Nevada? How about every other state in this country?! 😕","post_message":"How in the world are these people getting elected to office in Nevada?"},{"comment_id":"514346735420286","commenter_b":"Muslims cause cancer and sure death. Let's ban them...","commenter_a":"Amazing. After all these years they find this out. I think it's a bunch of bullshit. Remember certain people hate bacon and want it out of restaurants","post_message":"WOW! NOT EXPECTING THIS!!!"},{"comment_id":"10154102450848984","commenter_b":"OMG, Hillary is so very, very, very White !","commenter_a":"She just wants to be president, talks a lot of BS.","post_message":"Wow. Hillary Clinton was caught doing something next to Al Sharpton that is fueling the criticism that she is a complete fraud... and it was all caught on camera. Do you think Hillary will be the Democratic nominee?"},{"comment_id":"10153068896931323","commenter_b":"Real Women Have Pulses.","commenter_a":"All this \"Men like curves\" stuff is crap. Most men will fuck anything with a pulse.","post_message":"\"There is no better way to celebrate and show off than by donning a bikini. When the #CurvesinBikinis ad in Sports Illustrated is released, the world will be watching and they’ll like what they see.\""}]
