[{"comment_id":"10152969053772293","commenter_b":"Well scumbags cat got your tongue","commenter_a":"It is not racism.It is about illegal bangladeshis entering every bordering country. Half of Bangladesh is in India. Burma or Malaysia are not like India.These Bangladeshis create all sorts problems from drug peddling, to prostitution, thievery, robberies, kidnapping & rapes. Recently bangladeshis raped a 70 year old nun at a church.","post_message":"A tragedy no one wants to own."},{"comment_id":"1090710841025167","commenter_b":"Sanders' wife was not known for \"fiscal responsibility while president of Burlington\" as she allegedly overstated pledge donations while filing a loan with the Burlington Diocese of the Catholic Church and forced them to reportedly eat a loss of up to $2 million. Sanders and Wife Accused of Mishandling Campaign Money @webpagelink","commenter_a":"🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸Donald Trump For President 2016/2020","post_message":"Iowa may not be on \"Cruz\" control..."},{"comment_id":"960199417353864","commenter_b":"You think allowing illegals to become citizens will not increase your \"real problems?\"","commenter_a":"What in the world are those loony Republicans thinking? Oh yeah, it's the \"me, me, me, f**k you!\" mentality that keeps them going. They ignore the real problems of gang wars, poverty, human strife, and persecution in the places where immigrants come from while at the same time, those idiot neocons perpetuate the \"War on Drugs\", \"War on Syria\". and all other unnecessary wars. Those people show no mercy on fellow human beings... Why is it that people remember to hate and separate while struggling to love and unite?","post_message":"Republicans are so eager to see brown-skinned children deported that they're willing to put the entire country at risk in hopes of making it happen."},{"comment_id":"10154331117659411","commenter_b":"News Flash: You've probably used the bathroom with a Trans person and not even known it. You know what Gender Neutral bathrooms are good for? A dad being able to use a changing table because those things are all to rare in the men's bathroom. Gender Neutral bathrooms make sense and honestly if you're so worried about your kids then go to the bathroom with them. Oh wait! Women can't go in men's bathrooms with their sons so their sons have to go alone or go into a women's bathroom just to piss.","commenter_a":"He wasn't even transgender. Criminals will break laws no matter what and being trans is not a mental illness!","post_message":"The girl mother, who was in the adjacent stall, heard her daughter screams and rescued her, while restaurant patrons held the suspect until police arrived."},{"comment_id":"827024174060503","commenter_b":"@username you move and take that communist Kenyan creep with you","commenter_a":"You libs are pure , unaldulterated \"mush\"! Your president is taking us down the road to nowhere and you are worried about the police killing a wonderful young \"punk\" who stole and bullied and tried to kill an officer? Get off welfare and get a job!","post_message":"\"The power to kill is the most awesome power that any government worker could possibly have. We have given that power to police, and then we have refused to monitor it.\" - Lawrence O'Donnell"},{"comment_id":"794052647345901","commenter_b":"LOL! Laughing mostly because I have a few friends like this guy...","commenter_a":"I believe it's called the \"pass the buck\" syndrome? Pity","post_message":"Image from Of the People, By the People, For the People"},{"comment_id":"905819366142682","commenter_b":"@username if u want to have sex, pay for your birth control. If u don't want to take the chance on getting pregnant, keep your legs together. We should not have to pay for your wants or needs.","commenter_a":"Blunt doesn't think women should have access to birth control and then blocks them from getting an abortion for an unwanted and unplanned for pregnancy.","post_message":"Every day, families in Missouri and nationwide provide loving and safe homes to children in need through adoption. I’m proud to serve as the co-chair of the bipartisan Congressional Coalition on Adoption, and I’ll continue my efforts to help children in need."}]
