[{"comment_id":"1006229472770134","commenter_b":"You seem a lovely Christian...","commenter_a":"Scum bag,evil,man!! He's a Muslim running America,funding ISIS","post_message":"'Welcome home, Mr President'"},{"comment_id":"10156411867420354","commenter_b":"@username , NO MORE REFUGEES !! I DO SAY NEVER FORGET WHAT THE islamoCRAPS AND obuma HAVE DONE TO AMERICA ! PROSECUTE obuma & killery FOR TREASON !! DONALD TRUMP/CRUZ 2016 ! AMERICA NEEDS PHOTO I.D. TO VOTE , IDENTIFICATION , FOOD STAMPS , ETC ! TERM LIMITS WITH NO BENEFITS ! DRUG TEST ALL FED. EMPLOYEES AND THOSE COLLECTING WELFARE ! ABOLISH ALL GUN FREE ZONES ! IF YOU AGREE PASS IT ON !","commenter_a":"Political correctness=Nazism","post_message":"When you see the so-called \"politically incorrect\" sign, you'll instantly understand why liberals' heads are exploding...and will want to buy a cupcake from these folks."},{"comment_id":"441930219322192","commenter_b":"Jail this pervert!","commenter_a":"Creep","post_message":"Conservatives are bending over backwards trying to defend the Duggars. Gross!"},{"comment_id":"1077965912287650","commenter_b":"What policy? The only policy she had was to make money for herself!!!","commenter_a":"HILLARY IS DISTURBING","post_message":"...says the Benghazi butcher and the woman who transferred 20% of all U.S. uranium (the stuff used to build nuclear bombs) to Putin's Russia as 9 investors in the deal funneled $145 million to the Clinton Foundation."},{"comment_id":"10152958371844342","commenter_b":"sbot negroes are just going to keep raping robbing murdering , shooting looting and then '' pointiong out no one likes them''' ahhhhh dahhhhhh mr prez-a-dent","commenter_a":"so, this was 3 years ago, and you're just now getting upset?","post_message":"\"They got a slap in the face.\" A couple is now suing the owner of a photo booth who was taking pics at their wedding in 2012. Apparently, some of the guests had racial slurs printed on their wedding day photo. FULL STORY --> @webpagelink"},{"comment_id":"10153201313814255","commenter_b":"How is this even legal?! How do these cretins get to refuse to act on ONE thing because they don't LIKE another?!!!!!","commenter_a":"Geriatric Mutant Ninny Turtle. Competing with Agent Orange to see who is the worst leader in Congress.","post_message":"Thugs."},{"comment_id":"736296849894226","commenter_b":"POOR GAS ON THEM AND LET THEM BURN","commenter_a":"He should have the same thing done to him.","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news. No riots, no protests, no media coverage. Do you think he should be charged with a hate crime?"}]
