[{"comment_id":"10155104954104411","commenter_b":"Smoking is very bad but rapefugees are not. Damn wtf happened to Sweden..","commenter_a":"what about the vehicle emissions?","post_message":""},{"comment_id":"1797648893800416","commenter_b":"Women's bathrooms have in closed stalls get over it.","commenter_a":"I don't do business with Target anyway","post_message":"In the wake of Target's decision to allow men in women's restrooms and changing rooms, the hashtag #BoycottTarget has exploded across social media and trended as high as #1 on U.S. Facebook..."},{"comment_id":"10152867173405667","commenter_b":"Can't stand her","commenter_a":"Start with the thugs then will talk","post_message":"\"How is it possible that we as a nation allow guns to fall into the hands of people whose hearts are filled with hate?\" Hillary Clintonsaid."},{"comment_id":"515071932006619","commenter_b":"you make a good argument eugene. historically the philistines controlled the coast of israel. the jews the interior. but after the romans any historian would agree the jews were not a player in the region. after 2000 years i think the claim of europeans to the region is moot. its like me saying i should have land in ireland taken from my ancestors by the english,or land in france taken by the catholics. its not valid and if the united states funded a military machine to take back those places i think it might be wrong.. prior to world war 2 the jewish population in palestine was a distinct minority. the subjugation of the place by european jews was rubber stamped by the west but never ok with the people of that place or any country near it. israel currently recieves billions from the american taxpayer to operate their apartheid ...","commenter_a":"that mosque was in palestine. europeans invaded the country,committed genocide to steal it and now you sit on a high horse and judge the indigenous people it was stolen from because you are ignorant of history or a hypocritical shill.","post_message":"Such extremism isn’t limited to out-of-the-way mosques where radical clerics operate in the shadows. It is occurring in mainstream and leading mosques world-wide, including at one of the most important religious institutions in Islam, the Al Aqsa mosque in Jerusalem."},{"comment_id":"1362606120446523","commenter_b":"I heard about that. Those kid's were way out of bounds for doing that. But I assure you, no citizens of the United States of America are being threatened of being deported. Only illegal immigrants of any color, race or religion. Its already the law. It has been for a long time. Its just not been enforced properly. The media tries to spend it in to hate. Its not hate, although there is anger for what were allowing to happen to our country. I personally only hate terrorist. No matter where they come from. Thats why we need to band together all American citizens. We have band together against a corrupt government, illegal immigration and these terrorists. Foreign and demestic. If we can't come to terms with that as a people. See it for what it is. Than im afaid all is lost.","commenter_a":"No they don't. You continue to try and make it about Trump. It does however have a lot to do with you. The media and the government. This is your( collectively) propaganda. To continue to divide. Its not working. Not for the majority. People listen please. They are lying to you. To push their naritive. If you actually listen to Trump. Not just the out of context sound bites they feed you. He and people who support him want unity more than anything else. For America. Then we can focus on everyone else. But we have a serious problem at home to deal with first. We have to let white, black, left, right and what ever else America go!! And realize we the people. All the people. We the people of this great nation are on the same team. Thats what we are missing. Everyone is more concerned with their ...","post_message":"This is just sad."},{"comment_id":"10153880559652411","commenter_b":"I hate to see what she did when she got home!! Poor Billy run bill run!!","commenter_a":"Trump won hands down. Put her on the defense from the beginning and she stayed there. She just gave America that fake smile like she always does and then pretends everything is just perfect. Give me a break! I know she was extremely angry with some of the truthful comments Trump was saying and I could see that in her facial expressions. If it wasn't for the liberal media Trump would be miles ahead!","post_message":"#KenBone's overnight fame was fueled by his snazzy red sweater, white shirt-tie combination, his thick mustache, his disposable camera and of course, his catchy name, according to social media."},{"comment_id":"894618207261542","commenter_b":"yes i reject it and this ass too","commenter_a":"YES.","post_message":"Where do you stand? Vote here and make your voice heard."}]
