[{"comment_id":"1212505538766794","commenter_b":"Karma's a bitch.","commenter_a":"Well there goes this investigation out the window. An admitted ammosexual is heading This investigation. .","post_message":""},{"comment_id":"760883910715426","commenter_b":"We will give her up to you Iran! Go let her ruin your country!","commenter_a":"Don't you need a brain to be a spy?","post_message":"Is Kim Kardashian West a secret agent?"},{"comment_id":"10154860670292435","commenter_b":"Take flamethrower out there and really clean the swamp!","commenter_a":"You get a fire truck and water board them with a hydrant.","post_message":"Happening Now: Protesters outside the White House opposing President Donald J. Trump's travel ban."},{"comment_id":"1112768188788371","commenter_b":"This is his third baby mama. The guy is an absolute psycho and she is a dumb doormat.","commenter_a":"It's not about breastfeeding. It's domestic violence. He has strict rules for his partner, including this new one related to breastfeeding. He's a controlling arsehole.","post_message":"He wants his wife to stop breastfeeding when their son turns 8 months old."},{"comment_id":"1096976973728618","commenter_b":"No! You think this is a country of racism then take your black brethren with you and YOU all move out. You own colour sold and brought you here, stop acting like everyone else owes you something.","commenter_a":"Why?? Why would you tarnish your gold!! The first black woman and you trash your chance to be a roll model and a proud American! Wtf is wrong with you! You just ruined your chance at becoming everything I wished for you! You Dumb bitch!!!","post_message":"I can't even anymore with this garbage..."},{"comment_id":"10154075647091770","commenter_b":"You are totally right, Tucker.","commenter_a":"We turned to Hollywood to be entertained...NOT FOR POLITICAL COMMENTARY OR OP-ED! It really is that simple.","post_message":"Tucker Carlson has a message for Hollywood liberals"},{"comment_id":"1505849332764056","commenter_b":"She needs to be held accountable..!!!","commenter_a":"You honestly can say that about both candidates...","post_message":"If Hillary Clinton hadn't thought that laws don't apply to her, if she had not believed that she was above the law and traditions that everyday people have to follow, she wouldn't be in this mess.  She's in this mess because of what she did.  She is in this mess because of who she and her husband are."}]
