[{"comment_id":"844439005656552","commenter_b":"breaks my heart to see what my son and brother actually see. These people don't just mad out on red and green. When they see anything that has a red or green in it. They don't see it with the colors they can interpret. So nothing is as it should be. You need red to Make purple, purple doesn't appear the way the rest of us see it for them.","commenter_a":"Sylvain St-Arneault","post_message":"Watch people see color for the first time thanks to these high-tech glasses."},{"comment_id":"1036826173024907","commenter_b":"you mean the way a woman allowed herself to be treated for good money?? wahhhh wah wahhhhhh.","commenter_a":"The way Hollywood portrays women is outrageous.","post_message":"Right on. Go Dame Helen, go! - Eric March"},{"comment_id":"890208664347927","commenter_b":"That's a woman^ Meant Selena.!","commenter_a":"Everything is so over sexualized in America. That's what the real problem is. If everyone didn't think of pornography whenever they saw a nipple it wouldn't be such a big deal!","post_message":"#FreeTheNipple is fighting against censorship."},{"comment_id":"10153373990610329","commenter_b":"So NO harm ?!? Dude how did this dumb bitch make it through medical school... 😂😂","commenter_a":"I know what I'd do!! Shotgun job!","post_message":"A photo of the veterinarian with the dead cat have gone viral and sparked outrage."},{"comment_id":"10153709236220927","commenter_b":"I think she was in WAY over her head. I guess she hasn't been a flaming Liberal long enough.","commenter_a":"What's new","post_message":"Moderator Elaine Quijano continually challenged Gov. Pence. #VPDebate"},{"comment_id":"917658245037632","commenter_b":"@username...You Black Ass Nigga","commenter_a":"We're celebrating Indian slaughter","post_message":"What y'all got? #Thanksgiving"},{"comment_id":"1849468845289358","commenter_b":"@username rn she sitting on a strap thats why u so butt hurt😂😂😂😂","commenter_a":"She kicks some dude out of her show cause he didn't want to record her and now she does this shit... she's straight up trash.","post_message":"Doesn't look like this promoter is playing games! #WSHH #YoungMa"}]
