[{"comment_id":"10153867352421756","commenter_b":"No, it actually wasn't. Students were allowed to carry. The fact that students were allowed to carry may explain how the shooter got to the classroom carrying a long gun without being stopped. He wasn't doing anything illegal until the second he opened fire. Surprise, everybody!","commenter_a":"survived the army to be shot in college, go america","post_message":"It's emerged that the 30-year-old father ran at the attacker, trying to block the door to a classroom to protect his classmates — and suffering several bullet wounds and two broken legs in the attempt, according to his family."},{"comment_id":"567131713411422","commenter_b":"It is Bloomberg who is the dangerous demagogue and Obama, and Biden","commenter_a":"No body can help us if Hillary.is elected.","post_message":"Michael Bloomberg said 'Trump is a risky, reckless and radical choice,' during his DNC speech last night. He also asked his fellow Independents to support Clinton because she 'understands that this is not reality television  this is reality.  Do you think his speech will hurt Trump's chances with Independents?"},{"comment_id":"982852498479883","commenter_b":"racist hater sit down and shut up","commenter_a":"Oh, sure, especially the way he goes to other countries and slams the US, apologizes for America and bows to other world leaders and racist michelle complains that she wakes up in a house built by slaves, was not proud of her country til barry started destroying it and spends millions of taxpayer dollars taking her huge crew on vacation around the world. They are an embarrassment.","post_message":"Are you proud to have the Obamas representing America around the world?"},{"comment_id":"1023792714394917","commenter_b":"We already lost it! We've gone backwards for the last 7 years and all that's happened is the Tory Party and it's mates busy enriching themselves from National and Taxpayer assets.","commenter_a":"I worked since I was 14 - paid my share and I say out ! All us pensioners have paid in - but David Cameron wants to open the borders to any one and give them all free hand outs and homes !!! It's not on !!!! We need to stand up for our selfs","post_message":"Britain faces a 'lost decade' if we vote Leave, says David Cameron. He warned pensioners in particular 'don't risk it'. Is he right? Would leaving the EU really be bad for our pensions? Judge for yourself: @webpagelink"},{"comment_id":"10153057732666051","commenter_b":"She would of been bothering me..can I pull my junk out in public? No","commenter_a":"People and their phones need to get a life. This young Lady was not bothering him unless he had never seen a nursing child before. Sad world we now live in......","post_message":"A mother from Indiana was genuinely stunned when she found out that this photo of her had gone viral."},{"comment_id":"583797651802114","commenter_b":"Women Willing To Bern In Hell For Bernie Women Willing To Bern In Hell For Bernie sounds like a cult, kinda like Scientology.....","commenter_a":"The corporate owned media won't change their narrative about Clinton because for the most part, they are still run by straight, white males who must keep the myth alive that an ambitious woman is dangerous and there must be a negative reason behind her ambition.","post_message":"Let this sink in."},{"comment_id":"10153238029913822","commenter_b":"You guys sound like some broke ass jealous bitches!","commenter_a":"How tacky of a wedding pic","post_message":"Personal chefs, fancy cars, an expensive pool & more… at 35,000 square feet, it’s described as the biggest house in Pa.  And now it's the focal point of allegations made in a massive federal tax fraud investigation: @webpagelink"}]
