[{"comment_id":"662069217316990","commenter_b":"Sorry Bitches !!! Go to jail !!","commenter_a":"Yes!!yes!!!!!yes!!! that;s a shame!! just think?? if that was your mom! or dad????","post_message":"These thugs tortured nursing home patients for an insane reason.  These two are monsters. Let's lock them up and throw away the key.  Do you agree these thugs should do life?"},{"comment_id":"10154416469089342","commenter_b":"@username deal with it, pussy.","commenter_a":"Rip","post_message":"BREAKING: Former Cuban leader Fidel Castro has died at age 90"},{"comment_id":"198765370606154","commenter_b":"Bye Bye!","commenter_a":"Also you suck at acting","post_message":"George Lopez is still angry about the outcome of the presidential election. Let's make 200,000 #SHARES if you Never want to see Lopez Again !!!!"},{"comment_id":"10154345069201491","commenter_b":"The wall will be so \"huge and bigly\" the missiles won't even be able to fly over it!","commenter_a":"Trump doesn't like war!! He likes building a huge wall.. Don't worry guys, he is going to isolate North Korea with his wall, perhaps the nuke can't go through it..","post_message":"North Korea's weapons-grade stockpile has soared dramatically, says South Korea."},{"comment_id":"10153539685509641","commenter_b":"How many ISIL recruiters are. among all these \"refugees\" ..wait untill they settle.No more Europe for me..is unsafe now..","commenter_a":"Couple of years from now the refugees will try to change europe like the country they just left... they will get offended by the host country's culture and practices and might demand for sharia law in europe.. the European politicians will never learn their lessons... just take a look at UK, France and sweden .... RIP EUROPE.. well played saudi Arabia, Kuwait and other middle eastern countries who smartly looked away.. My only hope is that the refugees respect the host country's culture and laws and abide by it and never dream of changing it... but I doubt it strongly","post_message":"Today, German Chancellor Angela Merkel said her country is pledging an additional 3 billion Euros to the migrant crisis. French President Francois Hollande said France will accept 24,000 new refugees, and British Prime Minister David Cameron said the UK will take up to 20,000."},{"comment_id":"10153235865056680","commenter_b":"Ha ha ha!!! HEY, EVE, IF YOU WANNA WALK LIKE STEVE, YOU GOTTA TALK LIKE STEVE!!! WOMEN, STOP WHINING LIKE GIRLIEMEN. Stupid biatch.,😂😃😆😅😲😱😨","commenter_a":"TRUMP WINS ALL","post_message":"“She’s playing that woman’s card left and right.\""},{"comment_id":"1105899882819941","commenter_b":"@username typo, bitch!","commenter_a":"Donald Trump 2016! Because as an American hispanic, I'm tired of how all of these coward racist liberals that hate America like Obama, Clinton, Sanders, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, I'm supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of my skin... disgusting. That's why I and others support Donald Trump. Please support the movement by getting the \"Trump Strong\" t-shirt at:www.teespring.com/trumpstrong . And let's Make America Strong Again! Thank you.","post_message":"They do NOT want people to see this one!"}]
