[{"comment_id":"10153130276219071","commenter_b":"Want to know who fought against any and all mental health checks for firearm purchases? The ACLU and liberal groups...that's right...the ones screaming the most about \"guns\" are the ones with \"Blood on their hands\".","commenter_a":"All these gun nuts won't even consider the possibility of mandating thorough background checks before purchasing a gun. That's all that is necessary in my view. Instead they keep covering their ears and screaming \"taking away our guns won't change anything\". People wanting better gun control legislation don't necessarily want to take away normal/healthy/stable/non-criminals ability to purchase guns, we just don't want any psycho to be able to walk into any store and purchase a gun in 5 minutes.","post_message":"He says he's shocked that his son owned 14 firearms."},{"comment_id":"10153660392802217","commenter_b":"Some of London does not speak for all of London.","commenter_a":"London didn't care when the rest of the U.K. Suffer so why should we care about london","post_message":"A mad half hour as \"Biblical\" rain hits London."},{"comment_id":"546390502218196","commenter_b":"WHAT A ASSHOLE. !!!","commenter_a":"He is a Muslim!","post_message":"Obama threatens inprisoning military personnel for defying him. This is outrageous. He is drunk with power. Do you think Obama is a tyrant?"},{"comment_id":"10153786664991336","commenter_b":"You only needed 5 minutes, for her to spend 11 hours lying is a waste of time.","commenter_a":"We need closure and justice for them","post_message":"\"I'd like to believe that no matter what party you are, you want to put American life and safety first and foremost.\" – Gov. Mike Huckabee"},{"comment_id":"10152991347419712","commenter_b":"Good point cutty, still can't stand the guy. Good luck this weekend","commenter_a":"How is this scumbag celebrated?","post_message":"Here are five of Terrell Suggs' greatest chirps about the Patriots and quarterback Tom Brady, a team he doesn't exactly like."},{"comment_id":"10154497774003812","commenter_b":"On that show, women would throw their shoes at him.","commenter_a":"Wake up Ellen...","post_message":""},{"comment_id":"1162051423814886","commenter_b":"What is a liberal?","commenter_a":"Keep it up NBC your imaginary war on Trump is backfiring on you and fox! The more you bash the better he appears! He represents the millions you ignored for the last eight years! The people are turning against the press and are taking what he says to heart! Many Republicans and Democrats like him!","post_message":"Trump said the female journalist who moderated the GOP debate had \"blood coming out of her eyes, blood coming out of her wherever.\""}]
