[{"comment_id":"10153141686007093","commenter_b":"No she isnt..cause when you see a 400 lb woman wear them and you can see through them then you will be on her side! !!!!!!!!!!!!!!!!!!#!!!!!!!!!","commenter_a":"She's just all butt hurt because she doesn't have a nice body to pull off wearing leggings like they're pants ;)","post_message":"It's leggings season. But according to one woman's viral rant, a lot of people don't wear them correctly... @webpagelink"},{"comment_id":"1383456038414113","commenter_b":"We got the house the Senate and the White House. LOL your liberal agenda happen no more.","commenter_a":"TWO YEARS...VOTE EVERY ONE OF THESE BASTARDS OUT!!! They have proven by pass this legislation that they are unfit and untrustworthy to serve the people that they purportedly 'represent!'","post_message":"They're so brazen..."},{"comment_id":"1784144245187941","commenter_b":"Oh shut up!","commenter_a":"If African Americans don't understand that they're being exploited and used for their votes by this woman, well then they'll get what they deserve after they elect her, a lot of nothing! So sad to see them falling for this. She's using a black rapper to pull in votes, amongst other things. Using a group of people for a vote is so wrong, nothing more. She's disgusting to do this.","post_message":"Hillary Clinton quotes Jay-Z during Cleveland rally: “Rosa Parks sat so Martin Luther could walk, and Martin Luther walked so Barack Obama could run, and Barack Obama ran so all the children could fly.”  Read more here: @webpagelink"},{"comment_id":"649755178530332","commenter_b":"Please start packing now! Believe me no one will even miss you and your dirty mouth.","commenter_a":"V","post_message":"I guess it's time to say goodbye, and good riddance. 'LIKE' if you support Whoopi leaving the country!"},{"comment_id":"10152756329021615","commenter_b":"I hope she was telling him to go home!!!","commenter_a":"For sure","post_message":"This video showing a mother slapping her son during the Baltimore riots is going viral...we're hearing what the police commissioner has to say about it now on Channel 11 Morning News.  SEE FULL VIDEO: @webpagelink LATEST: @webpagelink"},{"comment_id":"903161916494805","commenter_b":"'@username because of disparate impact and disparate action. White people can get up out of bed, run a comb/brush through their hair and be out the door in five minutes. Blacks cannot do that so much, unless their hair is cut to their head--shaved. The rules negatively impact Blacks because without those styles, there isn't much left without using relaxers or paying for extensions. When rules or laws are placed for everyone as is here, but negatively impact one racial, religious, gender group, then it's discrimination and needs to be stopped.","commenter_a":"Can I ask an honest question? In that school, is there a ban on long slick hair, mullets or any other 'white hairstyles'. If so then I can actually understand the ban. But if there is no ban on 'white hairstyles' like long slick hair, but there is a ban on 'black hairstyles,' then yeah, i agree, it is discriminatory.","post_message":"This school just banned traditionally black hairstyles  and people are outraged.  #MicBrights"},{"comment_id":"10154291680908701","commenter_b":"You're right. You're a white pig. ^^","commenter_a":"Your choices are, Trump, Hitlary, and everyone gets everything for free Sanders. We're screwed. No Trump isn't a racist.","post_message":"Donald J. Trump wins the Republican presidential primary in Washington, the Associated Press reports. MORE: @webpagelink"}]
