[{"comment_id":"10153808886723984","commenter_b":"Idiot bitches","commenter_a":"You just GO Ben!","post_message":"Wow! You don't see Dr. Ben Carson get this fired up too often, but  he sure wasn't taking any of Whoopi Goldberg and Joy Behar's nonsense.  Do you stand with Ben Carson despite the constant attacks from the mainstream media?"},{"comment_id":"10152820559047144","commenter_b":"To hell in a hand basket. The women will have to bale them out.","commenter_a":"Most of those pharma pain killers are just synthetic heroin.","post_message":"A recent study found heroin abuse was 19 times higher among people who had previously abused pain relievers."},{"comment_id":"835505926554037","commenter_b":"I bet she get tax breaks on her taxes.take a few seats missy","commenter_a":"C U NEXT TUESDAY !!!","post_message":"Does this woman realize she's shopping at Walmart, where wages are so low that many workers qualify for public assistance?"},{"comment_id":"10153579142479170","commenter_b":"she's never right !","commenter_a":"Sorry the American voters frustrated you. You can just stay home and learn to deal.","post_message":"According to Hillary, we're all just too stupid to understand how brilliant she is. She gets frustrated by that, and admits that her frustration is her 'greatest weakness.'"},{"comment_id":"10152865753567014","commenter_b":"another embarrassing moment for Arizona media :/","commenter_a":"Yunuhen Tinoco Alfred Hernandez Monique Martinez Holst @username I'm ready to catch a big boy like this!","post_message":"We're going to need a bigger boat."},{"comment_id":"10153084060819330","commenter_b":"I. Jesus. Side. Way. I am not. Crazy. Even. With. Alzheimer. If. He. Every. Receive. Jesus. He. Still can. Today","commenter_a":"Elvis with his wings bowing his head.","post_message":"Do you see the angel in this ice formation on a porch in Bristol? Audrey Totire sent us this See It, Share It photo after her friends noticed the image of what they say looks like an angel.  What do you think?  See more top photos from the week here ---> @webpagelink"},{"comment_id":"1345340232144440","commenter_b":"'@username, strong women do not build economies on murder of other countries and arming terrorists. That is a woman in bed with Big Money.","commenter_a":"I thought I was following an intelligent, thoughtful and insightful site, obviously not. Frightened of a powerful women I see, like most insecure men. We're use to it, but good luck with that ideology going into the future.","post_message":"EDWARD S. HERMAN: Hillary Clinton is a neo-liberal and pre-eminent war-monger. I think she is the most dangerous person living in the world today, given her highly likely election victory and her likely performance as president.   Trump is a self-promoting windbag, racist and dangerous, unpredictable phony. We have a ghastly choice in these two. Jill Stein offers a protest opportunity, more so than not voting. On the line that either voting for Stein or not voting would constitute a vote for Trump, one might argue that a vote for Hillary Clinton is a vote for war with Syria and Russia"}]
