[{"comment_id":"10153950105412757","commenter_b":"Round them up and jail them. Find the illegals and deport them.","commenter_a":"Exterminate that vermin!","post_message":"Anti Trump showdown"},{"comment_id":"10155084473033984","commenter_b":"@username yes you are.... it's never enough for you people never enough","commenter_a":"Okay, this is absolutely disgusting and I am appalled by the behavior of these CRIMINALS, but I did not see this much coverage or outrage when those WHITE teen males abused then raped the black handicapped teen with a metal hanger, causing permanent damage to him internally... they were let off the hook by the way. Charges dropped... media barely covered it and there were even people who made jokes about it or defended the white teens... so next time one of you white people wants to cry how white privilege is not real or how the media ignores black on white crimes, think again. These black teens are getting the punishment they deserve while the white teens (that did worse as they caused physically permanent damage) are out and about, as if nothing happened. DISGUSTING","post_message":"This is just sickening and heartbreaking at the same time. We just found out 1 key fact about the relationship between the disabled teen and one of his torturers... and it's absolutely shocking.  Who could be this EVIL?"},{"comment_id":"1553360474683977","commenter_b":"This sellout Hispanic wants to sell you some crappy shirt","commenter_a":"As American hispanics, we are tired of how all of these coward racist liberals that hate America like Obama, Clinton, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, we're supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of our skin... disgusting. That's why we support Donald Trump. Show everyone your support for Trump by buying the fantastic Trump Strong t-shirt at: www.teespring.com/trumpstrong . And let's Make America Great Again! Thank you.","post_message":"During a Colorado rally on Sunday, Trump unfurled an upside-down rainbow flag with the words \"LGBTs for Trump\" written on it."},{"comment_id":"10153967665463984","commenter_b":"This is one ugly woman","commenter_a":"Consider the source folks. Look what she married. Speaks volumes doesn't it.","post_message":"Michelle Obama took to Twitter over the weekend, and posted a disgusting image that features a U.S. Marine.  This is so typical of the Obama White House, and Twitter users everywhere called her out on it.  It's disgraceful that Marines are treated like this by the family they're there to protect."},{"comment_id":"974481335922540","commenter_b":"She's a brat","commenter_a":"She was never hired for the movie... Therefore cannot be fired...","post_message":"Do you agree?"},{"comment_id":"1257498034286119","commenter_b":"I this this guy is secretly obsessed with pussy lol","commenter_a":"QUESTION: How can you call yourself a patriot and support 33 Benghazi hearings but NOT ONE on whether Russia infiltrated the White House...?","post_message":"Drip. Drip. Drip. Republicans in Congress need to drop the political charade and help us get to the bottom of this."},{"comment_id":"10154165798037212","commenter_b":"It was an accident. Please use your words kindly. The driver needs our prayers . This was a total accident.","commenter_a":"I'd kill someone hands down. Hit my kid or my dog with your car and you better pray the police get there quick enough. I'm at a loss of words for this little family. Praying for them with everything in me.","post_message":"UPDATE: A 2-year-old boy has died after being hit by a car Tuesday night in Yukon. #News9"}]
