[{"comment_id":"10155741021510354","commenter_b":"Dear Allison, you are one poor sucker. There never was a thing called white privilege. You thought emancipated blacks were slaves but in truth , the only thing equality means is that no one gets a free ride . Not blacks or whites...you have the freedom to work your little butt off to get what you earn. If that is white privilege, you have been duped into wanted to toil and toil to get what you want in life...same as the next guy.","commenter_a":"you are a fucktard","post_message":"Why MSNBC called in an erotic novelist to discuss this topic is beyond us... but somehow the crazy here might even surpass Rachel's."},{"comment_id":"10152833954741051","commenter_b":"Here we go with those damn pit bulls again. They should be banned from the United States","commenter_a":"Show any dog love & they'll be loving..!! Shame on the owner for not providing that..!! Now a dog that could've been a great pet gets euthanized & the poor lady gets hurt. Lose/lose situation...","post_message":"This woman was taking part in the Ice Bucket Challenge in her backyard when, all of a sudden, all hell broke loose."},{"comment_id":"10153538663841130","commenter_b":"Cristian Cabrera","commenter_a":"Marisa have you seen these guys??","post_message":"No mailman is safe..."},{"comment_id":"1033502426742811","commenter_b":"True!","commenter_a":"That cop had been dismissed from another police dept for being 'too immature to handle a gun' and lack of ability to follow orders. Fact.","post_message":"BREAKING: a grand jury has chosen not to indict the cop who murdered Tamir Rice in cold blood. Something is seriously wrong with our criminal justice system when a cop can kill a fully innocent kid with impunity. Read more here: @webpagelink Image by Occupy Democrats, like our page or more."},{"comment_id":"952760784783670","commenter_b":"She is a sad excuse. Why do we care what she says. Why do we care she breathes. Waste of space.","commenter_a":"I've seen prettier horses","post_message":"How much lower can Katie Hopkins go?"},{"comment_id":"900773723315710","commenter_b":"And how is this news? Last time I checked, Mail was supposed to be a page for news.","commenter_a":"just kill them all anyway","post_message":"In these exclusive pictures, she goofs around like a typical London schoolgirl. Here we reveal what poisoned the mind of the 15-year-old who's run off to join ISIS."},{"comment_id":"433149650143409","commenter_b":":)","commenter_a":"done & done","post_message":"\"Work hard, play hard,\" is the lie they want you to buy. #fuckwork"}]
