[{"comment_id":"10154282562893797","commenter_b":"Get rid of her dumb A S S","commenter_a":"Have her arrested and charged her for treason!","post_message":"BAN OVERTURNED: A school principal banned Santa, Thanksgiving and the Pledge of Allegiance at her school. However, the Department of Education wasn't having any of that. And now, some have started an online petition to remove Eujin Jaela Kim as principal."},{"comment_id":"10152968959637452","commenter_b":"Why couldn't she just get out?","commenter_a":"Who really believes that was a suicide? Smh..","post_message":"\"Get out of the car! I will light you up!\" Authorities have released dashcam video of Sandra Bland's arrest about a week after she was found dead in her jail cell. FULL VIDEO: @webpagelink The medical examiner ruled the Chicago-area woman's death a suicide, but her family believes otherwise."},{"comment_id":"588870771303502","commenter_b":"He should be deported. Hillary should be charged for her recent money scam","commenter_a":"lmmfao","post_message":"Obama is formally being charged with treason. He is getting it from all angles. Now is our time to push. Should Obama serve time for his crimes?"},{"comment_id":"10153574901357217","commenter_b":"Pete Bayliss Yes i no , the Muslims from the Middle east are taking over the World. we have more trouble with the Muslims from the Middle east then any other race of people here in Australia they are born hatters and want to kill us the free World , they give all the good Muslim people a bad name","commenter_a":"This is very sad but its WAR , and all kind of people get killed in WARS. we the World needs to get rid of ISIS no matter what it takes and innocent people are going to die while doing this . i hate Putin but he is the only one doing the best Jb in getting rid of ISIS.","post_message":"\"There will be no more doctors in Syria.\""},{"comment_id":"10153373946241833","commenter_b":"HE is a mental defective!","commenter_a":"he can leave anyday and take his moron buddies with him.","post_message":"The chairman of the Senate Judiciary Committee wants Attorney General Eric H. Holder Jr. to explain why a Department of Justice gun ban list has a defective category consisting almost entirely of names belonging to military veterans and their dependents. disturbing to think that the men and women who dedicated themselves to defending our freedom and values face undue threats to their fundamental Second Amendment rights from the very agency established to serve them, Sen. Chuck Grassley, Iowa Republican, said in a statement Wednesday."},{"comment_id":"1062046730518522","commenter_b":"Hillary To Prison!","commenter_a":"You have my vote, @username. As a United States senator and a cabinet secretary, you learned how to compromise and work with your rivals. With you, we know what we are getting authentic experience.","post_message":"I got into this race because I want to improve the lives of all Americans—and I’m going to continue to work my heart out. I hope you’ll join me. Onward to Iowa. -H"},{"comment_id":"10153864923562490","commenter_b":"Women do not belong on boats or in combat this is just common sense and has everything to do with sex...","commenter_a":"Being a navy veteran, I don't agree with this. They already had a court martial case where enlisted male sailors were tried for taking pictures of female officer submariners showering....","post_message":"First enlisted women report for duty to sub force in early 2016."}]
