[{"comment_id":"10153839277481717","commenter_b":"Welcome to Trumps America","commenter_a":"That's horrible! My partner and I attended the fair...we felt safer and less vulnerable in SF than we do in many parts of Albuquerque.","post_message":"Five men attacked the friends with pepper spray for no apparent reason other than they are gay."},{"comment_id":"10156182407910354","commenter_b":"Will they be put in jail for raping, beheading, burning live people? I think I need some pigs running around my yard.","commenter_a":"Since this treason is all being done by the commie DemocRats lets dump them all into the DemocRat run city's . Chicago, Detroit , Boston, Philly, New York , San Fran, etc. How about a 90% tax on all liberals.","post_message":"You just KNEW this was coming, didn't you?"},{"comment_id":"1075067075943468","commenter_b":"@username when did Trump date any black women?","commenter_a":"This is just the beginning, folks. Racism has been given the green light as of last Tuesday night. smgdh","post_message":"\"It will be refreshing to have a classy, beautiful, dignified First Lady in The White House. I'm tired of seeing a Ape in heels.\""},{"comment_id":"10153260713478690","commenter_b":"Scrw U, Scrw Saddam, and Scrw Isis... Saddam killed 300,000 innocent kurdish moslems most of them by mass graving and gassing them, u pathetic peace of scm.","commenter_a":"Sadam was much better than ISIS...","post_message":"The statement said that a lorry loaded with around 20 gas canisters exploded on a highway between the Iraqi city of Mosul and Syria, as Kurdish fighters were being deployed following an offensive against ISIL fighters. @webpagelink"},{"comment_id":"1802884339926690","commenter_b":"evil woman","commenter_a":"You're right, Donald. She doesn't give up. She's been fighting to keep people like you from preying on others - all her life! You aren't even qualified to clean toilets.","post_message":"\"You interrupt me all the time. Why don't you interrupt her?\" All the times tonight's #debate moderators and Donald J. Trump talked over each other. @webpagelink"},{"comment_id":"10155694737870294","commenter_b":"Why not?! Criminals can do it like gun-free zones didn't exist!","commenter_a":"Doesn't matter they'll do it anyway.","post_message":"Even if it passes, each university would still be able to decide if they wanted to allow guns on their campus."},{"comment_id":"790733494450561","commenter_b":"You go girl.","commenter_a":"good goin!! nice shot!","post_message":"65-Year-Old Woman Shoots Robber Michael Bontaites Square In The Chest. Thank god for the 2nd amendment. Do you support her right to bear arms?"}]
