[{"comment_id":"10155027451044411","commenter_b":"Boooo :) make them strong :) We kick your ass in Afghanistan... @username should respect other cultures and their traditions.. These Indian Muslims doing this due to their believes.. This is racism what is @username doing..","commenter_a":"What about you Russian whores bathing their babies in Ice cold water... shit heads @webpagelink","post_message":""},{"comment_id":"608238889333781","commenter_b":"They can leave this country","commenter_a":"Tell them to leave","post_message":"Texas Man Told Remove His American Flag Because It Was A ‘Threat To Muslims’. Let's show this patriot our support. Can we get 75,000 'LIKES' for his love of his country?"},{"comment_id":"10153488869101636","commenter_b":"I am nothing close to a conspiracy theorist, but doing what I did in the military, I seen how cut throat people could be. Especially if they are scared that information will get out there that will harm them. I'm not saying that anybody did tamper with his breaks, all I am saying is that it is possible. Nobody cut his break line obviously because he would of known, but had some drilled a pin hole in a brake line or reservoir, then sealed it to make sure it didn't leak out while sitting stationary. Then as he leaves the drive way he is still able to brake because there is fluid there to press the caliper in, but it breaks the seal and starts to leak out and he could use the brakes so long that the hydraulic fluid is still able to pressure the system. By the time ...","commenter_a":"I am just throwing it out there but Im pretty sure if his brakes had been tampered with he would have known it after the first stop sign or stop light after he started his car.... They dont pick and choose when to work and when not to work when tampered with","post_message":"Police say the data box from Aubrey McClendon's vehicle registered what was happening just seconds before the crash."},{"comment_id":"10155709379820389","commenter_b":"Let ISIS continue to take these worthless countries and killing all the cowards. Once they have taken all the muslim countries, we'll know what is left is our enemy and then we kill them. There is NO good reason to kill more Americans defending a people that runs and are unwilling to fight. We shouldn't give aid or weapons....our money would be better spent here at home.","commenter_a":"Screw this pathetic administration. Iraq needs us and this pathetic socialist President turns his back. My friends and I shed blood, sweat and tears to give the Iraqi's freedom only to have our coward of a leader destroy all we did.","post_message":"\"The United States is not going to be responsible for securing the security situation inside of Iraq,\" Press Secretary Josh Earnest told Fox News."},{"comment_id":"10154162654734087","commenter_b":"Yep, we saw how Liberal women threw their crotches at Bill Clinton with votes right? My guess is most would have gladly changed places with Monica Lewinsky. Sucks to be a hypocrital non-critical thinking Lib woman. That's Lib Feminism I guess.","commenter_a":"Yes, when a bigoted, neo-fascist, sexual predator runs for president on the GOP ticket, Democrats are loyal to their party and independents and moderate Republicans stream to join us to stop him as well...funny how that works.","post_message":"\"With the exception of cheating Bernie out of the nom the Dems have always proven to be far more loyal to each other than the Republicans!\" Trump tweeted."},{"comment_id":"1674023152845757","commenter_b":"Funny","commenter_a":"Idiots!","post_message":"Just take a guess which Democrat Senator said this..."},{"comment_id":"10152665844280667","commenter_b":"If only she would run Elisabeth Warren would get my vote.","commenter_a":"Can't sstnd this women! She DOES NOT and WILL NEVER, EVER vote for her!!! Liar, liar, pants on fire!","post_message":"56% of women have a favorable opinion of Hillary Clinton, a Gallup Poll finds."}]
