[{"comment_id":"10153238960151438","commenter_b":"Ok clark. You win. All lesbians are fat hairy and ugly. That is completely accurate. No bullshit. You are a really smart person. So glad we had this talk.","commenter_a":"why are most queer women obese now thats a question","post_message":"Why don’t queer women flirt with other queer women?"},{"comment_id":"917658245037632","commenter_b":"@username...You Black Ass Nigga","commenter_a":"We're celebrating Indian slaughter","post_message":"What y'all got? #Thanksgiving"},{"comment_id":"127551884528757","commenter_b":"@username she was female","commenter_a":"She got what she asked for. Had she left room between her and the vehicle in front of her, she would have had adequate time to take evasive action to avoid the mattress and been able to maintain control of her vehicle. Both trucks were traveling at a reasonable and prudent speed. The ford was passim the semi safely. She grew impatient. Ford took evasive action, maintained control of his vehicle. She was tailgating and did not have time to take evasive action SAFELY. Over corrected and lost control of her vehicle. She is 100% at fault. There is no negligence on either driver. Her car is obviously totaled hopefully she carries collision coverage. She will also be paying for the damage to the semi. Hope she has enough liability. I am a claims adjuster. I explain this to people allllllllll day. She was impatient, and now she will have ...","post_message":"TAILGATING GONE WRONG: Watch as a car that was tailgating another vehicle on the I-10 ends up ramming into a semi-truck and flipping in the air. Luckily, the driver and her cat were not severely injured."},{"comment_id":"10153601261735861","commenter_b":"LOSER!!!!","commenter_a":"boomer","post_message":"Oklahoma State slips in the AP Top 25- OU moves up"},{"comment_id":"10153295593767452","commenter_b":"Put her in jail!! She had no right to throw her father down the stairs! She's an abuser!!","commenter_a":"I bet her Dad took her to, and paid for, many, many, many, ski lessons and trips to many competitions, and was always in the crowd and supported her all the way, and all that comes with giving your child everything for your child to become a champion. She didn't get that far without a ton of support. If she did this to MY Dad, I'd be in the slammer too, surely with a much higher bail. Wasn't Picabo a downhill champ? Now, she is definitely a downhill champ - Picabo, you beat everyone to the bottom this time! This makes me happy I have no children - I'd rather be abused by a stranger than someone that I gave much love and support to. Picabo, thanks for making it to the bottom before all of the competition once again! Hope you have a kid that can maybe return the ...","post_message":"Olympic gold-medalist skier Picabo Street has been charged with assault and domestic violence after authorities say she pushed her 76-year-old father down the stairs and then locked him in a basement."},{"comment_id":"817070211680479","commenter_b":"Who cares about this slut","commenter_a":"POS","post_message":"“I hate everything about this country.” Rapper Azealia Banks Tells Playboy Why White America Owes Her Reparations… How does someone who makes millions in America get away with saying she hates everything about our country?"},{"comment_id":"2113127628913184","commenter_b":"He just gained 3 points sweet","commenter_a":"HILLARY !!","post_message":"We’re in a drone flying above a voting center in Parma, Ohio #CNNElection #ElectionDay #MyVote (no sound)"}]
