[{"comment_id":"886743024681887","commenter_b":"She dumb as hell she a pretry house but no one is home","commenter_a":"COMING UP NEXT..... - \"STACEY DASH\", \"APOLOGIZES!!!!\" (You SEE IT HAPPEN, All the time :\\\\ )","post_message":"Stacey Dash Believes Rape Victims Are Bad Girls Who Like To Be Naughty... @webpagelink"},{"comment_id":"10152659082871717","commenter_b":"And don't forget daughters who talk back to their fathers. They get stoned to death too.","commenter_a":"Here's an idea: since many want gays executed according to biblical law, how about following biblical law to execute adulterers, pedophiles, fornicators, tattoos, and et al?","post_message":""},{"comment_id":"10155238822815579","commenter_b":"In 2016 he US allowed 38,901 Muslim refugees also 37521 Christian refugees.","commenter_a":"In a practical sense, Obama had a ban against middle eastern christians. He seemed pleased they were being made victims of genocide, instead.","post_message":"President Trump: \"World Is A Mess & Angry\" - AGREE or DISAGREE?"},{"comment_id":"1137364809637709","commenter_b":"Love you Scotland just stay safe","commenter_a":"Go Scotland ❤️","post_message":"In case you missed it: Syrian refugees arrived in Scotland this week. This is how they were greeted."},{"comment_id":"521473731374253","commenter_b":"Piece of shit impeach this Muslim before it's to latr","commenter_a":"Good every state should ban the refugees from any where. This is our country not theirs.","post_message":"List growing rapidly....America is waking up!!!!"},{"comment_id":"10152966731859342","commenter_b":"She needs a hanging.","commenter_a":"Sierra Gotti","post_message":"\"Not just one kid, but multiple kids. That's a plan. You're making a plan and continue to do it. I think you are sorry for the last two years, but frankly you're just sorry that you got caught,\" a judge said of a former special education teacher.  WATCH THE TEARFUL COURT PROCEEDINGS:"},{"comment_id":"1397241813633169","commenter_b":"Shirley, this is the best comment I have read all morning. Thanks!","commenter_a":"That's why Christians should read Gods Word and trust the Lord and stop running around for a word . The Bible is Gods Word And you can get a Word from the Lord every day if you read it and Stay under your Paster if he is preaching the Gospel Of Jesus Christ","post_message":""}]
