[{"comment_id":"1129680070463931","commenter_b":"I don't know where you get this clump of cells thing... maybe in the beginning... before a mother even knows she's pregnant, but by the time they would know that fetus reacts to pain and sounds (especially it's mother's voice)... fairly quickly it dreams... science has shown this... putting religion aside... before the end of the 1st trimester it is a living being and respirates like any other human (just gets its oxygen and nutrition differently). Much more than a lump of cells. At 18-22 week the child can be born and live a normal life 9 time s out of 10 even if the mother's life is in danger at this point there is no more dangers to birth over abortion. On top of that... healthy infants get adopted by people that want them...","commenter_a":"This has nothing whatsoever to do with humane treatment. It's another attempt at shaming the woman for making her own personal choice and finding a way to punish her. This is also another ill-fated attempt at giving a fetus, a few cells, personhood. A fetus nor a clump of cells can be made to be treated as a once living, breathing human being, nor should it be treated as such. As soon as these \"lawmakers\" can dictate that, it's a short road to personhood, to claiming murder and denying a woman a choice and having autonomy over her own body.","post_message":"About 35,000 public comments poured into the Texas Health and Human Services Commission about the rule change."},{"comment_id":"990875947619544","commenter_b":"Such an evil, self-serving, grandstanding waste of oxygen!","commenter_a":"Wasn't he born in Canada?","post_message":"At least he's fighting imaginary foes, this time."},{"comment_id":"10153519416973812","commenter_b":"God rest their souls! That sicko should rot in hell!","commenter_a":"R.I.P god bless this good people.","post_message":"These are the 9 people who lost their lives after a gunman opened fire during a bible study at a Charleston church: @webpagelink"},{"comment_id":"10153472925796336","commenter_b":"Oh, what a surprise, Jackie is an ignorant b*tch offering her uninformed, sexist opinion.","commenter_a":"Everyone is so concerned with making sure winny people feelings don't get hurt by legalizing gay marriage and taking down flags but the real important stuff like the murder of baby's everyday is last on their agenda.. ban abortion and all these little hoes will be forced to used condoms. . If you get raped, , i understand it's a sad thing but don't kill the baby. .the baby didn't ask for it. Have the baby then give it up for adoption. . But it's an innocent baby. . Stop committing murder. .","post_message":"“I’m saying there ought to be some humanity and respect for the dignity of a potential life.” – Megyn Kelly on last night's 'The Kelly File'"},{"comment_id":"10155858979227619","commenter_b":"She should stick to singing and acting. That's her expertise. She's no great brain and what she opines about politics is meaningless.","commenter_a":"I dont care what either one of them think or do.","post_message":"Streisand said in an interview that Trump's actions are \"so beneath the dignity of the presidency, let alone any respectful person.\""},{"comment_id":"10154771311354312","commenter_b":"Suck it up buttercups, she lost, move on!","commenter_a":"Trump won so how is it that anyone can change that! that would be like all the Indian fans protesting the Cubs winning the world series and changing it to the Indians winning! he won just like any other president has won! I did not want Obama in for the second 4 years as a lot of people didn't but you did not see all of us out there doing what Clintons people are doing. If you ask me all of Clintons people are the problem here. If Trump does not do his job then impeach him! but give the guy a chance to MAKE AMERICA GREAT AGAIN!!","post_message":"People upset about Donald Trump's election floated an option that could deny him the White House."},{"comment_id":"10158501274630389","commenter_b":"Put her back in prison or deport her.","commenter_a":"She has all the qualifications to head up the DNC or Planned Parenthood.","post_message":"Despicable."}]
