[{"comment_id":"10153278015134575","commenter_b":":) Exactly","commenter_a":"If you're going to do BUSINESS in a free society that is supposed to separate religious beliefs from law of the land then we must require you to be tolerant & serve anyone & everyone who walks through your doors. (Remember? Separation of church & state? One of our country's founding principles?) Besides-supporting intolerance & bigotry is an abuse of the word Christian. Jesus would not turn anyone away.","post_message":"\"If a gay couple was to come and they wanted us to bring pizzas to their wedding, we'd have to say no.\" An Indiana pizzeria finds itself at the center of the debate over the state's religious freedom law."},{"comment_id":"10152620550458067","commenter_b":"Get a FREE Education, Graduate, and then move into your Parents Basement because all of the Illegal Immigrants have your JOBS.","commenter_a":"Tax money used for a good long term investment finally.","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."},{"comment_id":"458641870995513","commenter_b":"Can't stand this idiot...she has always been a crude, rude, big mouthed jerk. I don't find her humor funny, never have and never will. She does things like this just to try to be relevant and she will never be relevant. Hopefully she will also leave America with the rest of these so called celebrities if Trump gets elected.","commenter_a":"Idiot!!!!!","post_message":"Sarah Silverman is a _____________."},{"comment_id":"10155404286440389","commenter_b":"she needs go home shut up and bake pie","commenter_a":"Benghazi won't go away...no matter how many deletes","post_message":"\"A left-leaning agenda won’t get [Hillary Clinton] the presidency – it’s only part of the battle.\" – Doug Schoen, pollster for former President Bill Clinton Question of the Day: Will Bill’s shenanigans hurt Hillary if she runs for president?"},{"comment_id":"10154549448869342","commenter_b":"That's not her!","commenter_a":"She ain't gangster now lmao","post_message":"Police became aware of a \"disturbing video\" on Facebook Live showing an adult man being bound and beaten."},{"comment_id":"10154170781271491","commenter_b":"Oh I bet \"she\" can run alright .. run out of the white house next year take her kids and Obama with \"her\"","commenter_a":"What a beautiful,sane & facts ridden reply !","post_message":"Just because one Obama is preparing to vacate the Oval Office that doesn’t mean everyone in his family has to follow suit."},{"comment_id":"10154500349722994","commenter_b":"Yes! If someone is wrong they should pay!! Thank you hun. Wish I wouldn't have settled because I probably wouldve gotten more going to court! Never settle sweetheart 👍💯","commenter_a":"This happened to me before but by the time I found out it was pillaged, dash kit, sounds, Windows missing. I went to court and sued DPD they settled out of court.","post_message":"Andrew Carter has been walking, riding his bike and taking the bus for nearly two years now - unaware his stolen car had been recovered the entire time."}]
