[{"comment_id":"922010884502919","commenter_b":"If the perpetrator uses a handgun we get ban handguns, if he uses a magazine fed we get ban those, shotgun we get ban those, folding stalk we get ban those, black finish looks scary and military looking, we got to ban those! Where does it stop? We have millions of knives (problem in Japan) baseball bats, and cars in the U.S.! All can be used to do mass killing! Let us all be honest and cut the BS out of this subject! Gun free zones=shooting fish in a barrel! When POTUS and celebrities give up armed protection then they can give their opinion!","commenter_a":"As soon as all the criminals and government in the us get rid of all their weapons then we can talk about law abiding people curbing their guns. Until then you have completely missed the point of owning a gun for self defense. And BTW Roof got the gun illegally!!!!!! Writer doesn't understand what the word criminal means.","post_message":"COMMENTARY: Why you need to rethink some of your gun arguments. Agree?"},{"comment_id":"1104255989636871","commenter_b":"#westoppedtrump #fucktrump","commenter_a":"You saved countless lives last night on the streets of Chicago, they stopped the gang banging for a few hours to come together in your honor...you've already made America great again.","post_message":"Good morning! Departing for Dayton, Ohio now! WE ARE GOING TO MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10156718983275206","commenter_b":"@username's campaign is not particularly offensive to women neither is her platform desirable for America. Gender is a prominent component of her campaign. There is nothing even suggesting leadership ability; but everything suggesting bias and intractable partisanship.","commenter_a":"love your definition of feminism Carly, so true","post_message":"I know I’m not the liberal Left’s fantasy candidate. But a feminist is a woman who lives the life she chooses for herself—not the life that The View, or Hillary Clinton, or Planned Parenthood orders her to live. I told that to the women of The View last time I was there. It remains true today."},{"comment_id":"10153068492709411","commenter_b":"Thank heavens...............one revolting misogynist pig gone, but alas another is replacing it.","commenter_a":"RIP","post_message":"BREAKING:"},{"comment_id":"538992992891961","commenter_b":"Girls are just mean....need to face murder charges....they need the death penalty....need to be tried as adults","commenter_a":"They should all get life","post_message":"Three high school girls in Delaware are facing criminal charges over the fatal beating of a classmate inside a school bathroom last month. What could have caused them to do this?"},{"comment_id":"555525737965249","commenter_b":"@username for starters, voting for someone as corrupt as Hillary Clinton has proven to be is worse in the long run for this country than electing a fool like Donald Trump. He says stupid things, she does criminal things.","commenter_a":"The whole Republicans party think like Trump!!","post_message":"This should be required viewing for all Trump supporters. Shared by Occupy Democrats, SHARE to spread the message!"},{"comment_id":"853194554776798","commenter_b":"all illegals should be hunted down like animals captured and deported","commenter_a":"Send. Them. All. Back. Legal immigration only.","post_message":"\"I know it’s going to pass, and I know we’re going to be protected.” - Camila Trujillo, DREAMer"}]
