[{"comment_id":"10153442848704474","commenter_b":"She gives women a bad name.","commenter_a":"Bah bye! Don't let the door hit ya where the good Lord split ya! JUST LEAVE!","post_message":"REPORT: House Democrats ready for Pelosi to retire. Where do you stand?"},{"comment_id":"10153739079978812","commenter_b":"Waste of my energy girl..","commenter_a":"Hillary","post_message":"A new poll produced for ABC News/ Washington Post suggests negative views of Hillary Clinton have jumped since midsummer, while Donald Trump's popularity has grown more polarized along racial and ethnic lines: @webpagelink"},{"comment_id":"10154624417173010","commenter_b":"Water board this bitch daily then drown her","commenter_a":"Sorry. 21 years is not long enough. That baby is missing out on 80 or so years of Life. Dad is Missing out on 60 years with His son. That is NOT justice for that baby. I don't believe in an afterlife, but hers would Be incredibly cruel And dark.","post_message":"When the boy regained consciousness, she called the child's father to ask him to give up his custody rights. When he said no, she once again held the toddler's head underwater until he died, prosecutors said."},{"comment_id":"1836032849948227","commenter_b":"I'd say you'll go in for one yourself @username!! Dressed as a lady","commenter_a":"@username I don't feel well","post_message":"ðŸ˜ðŸ˜ðŸ˜"},{"comment_id":"1495322403831141","commenter_b":"please God help them find this little man let him be safe please let him go home with his family and friends","commenter_a":"Does anyone know where we meet tomorrow to volunteer to search?","post_message":"KPRC2 Robert Arnold is headed out with a couple of people who are helping with search efforts for Marcus McGhee in Pearland. MORE-->@webpagelink"},{"comment_id":"1765463453479427","commenter_b":"Tell that to these women. @webpagelink","commenter_a":"Hey! if their good their good why not if that's what they want to do! and pass all the ground's for being able to handle it!","post_message":""},{"comment_id":"10154490507826051","commenter_b":"Absolutely NOT! Lying Ghetto trash Marxists.","commenter_a":"Absolutely did not he's a Muslim has no class.","post_message":"Yes or no: Did the Obamas represent America with class and dignity?"}]
