[{"comment_id":"10154590275170586","commenter_b":"Which wife is she again?","commenter_a":"It takes a real woman to critize Melanie Trump. She is elligant. She will make a better First Lady than Bill Clinton will make. She hasn't hurt anyone. How can you even mention her name.","post_message":"Lady Gaga has joined the chorus of those criticizing Melania Trump days after the would-be first lady gave a speech decrying bullying online."},{"comment_id":"734861966642849","commenter_b":"Abortion should be legal everywhere and easily accessed for any women or young girl. It is their body and their right. A fetus that cannot process a though does not trump the right over an already born human being, especially when it lacks a social security card, birth certificate, valid first and last name, etc. A fetus does not reserve the right to life over the person it feeds off of and needs for survival. It is her property and as her property, she has a right to decide what does does with it where her physical and mental healthy is concerned.","commenter_a":"So disappointed you tossed in a nod to the Terry Shivo debacle...bad move. Most were probably not savvy enough to catch it. I did, you lost my vote. John Kasich won. Compassion and tolerance always beats government intrusion","post_message":"\"My record is clear. My record as a pro-life governor is not in dispute. I am completely pro-life and I believe that we should have a culture of life.\" – Jeb More on Jeb's conservative record: @webpagelink"},{"comment_id":"1292791090782624","commenter_b":"She's a paralegal? She should make much more than a fast food worker. This is why Sanders lost. He only helps the poor. He doesn't help the hard working middle class. Where is our mandated raise?","commenter_a":"Um I went to college to make $15 an hour and I have student loans. So now people working at Burger King are going to make the same or more than me? WTF I need a raise too!!","post_message":"When working people stand together, we win. And we are winning the fight for a living wage. In 2016, a total of 25 states and localities approved minimum wage increases."},{"comment_id":"1800130780216983","commenter_b":"Any misguided female.","commenter_a":"You should not talk about lying crooked murdering KILLERY that Way!,, her day is coming in jump suit in prison!!!!!! GOOOOOOOOO TRUMP TRUMP!!!!!","post_message":"\"Vote your conscience.\" Ted Cruz declines to endorse Donald J. Trump during his speech at the GOP Convention: @webpagelink"},{"comment_id":"10153233297426336","commenter_b":"They come over here illegally an you birch about it so you shouldn't celebrate there customs from there country here go back there an live don't do it here","commenter_a":"You can celebrate any way you want....","post_message":"\"I do not think it is the props that are wrong, it is forgetting that this is actually a part of the Mexican heritage.\" Olga Gonzalez, a Northwestern University undergrad from Mexico, takes a nuanced look at Americans' celebration of Cinco de Mayo."},{"comment_id":"10152841074616051","commenter_b":"I am woman...hear me roar!!!","commenter_a":"Love my Hillary!!!","post_message":"A judge said that Hillary Clinton’s e-mail violations are punishable by jail time."},{"comment_id":"10156329985125354","commenter_b":"Stupid Hoe","commenter_a":"One Day ,,,Every Knee Will Bow and Proclaim Him Lord, including you Ms,Johansson...that is the day you will give an answer for this horrible mocking of Gods word you have done","post_message":"Surely Scarlett Johansson is working on a Koran version as well. Surely that's happening, right?"}]
