[{"comment_id":"1048025435218467","commenter_b":"Lol I really do it's weird, this morning I saw white gold but then it changed and has been black n blue since haha!!!","commenter_a":"I see black and blue","post_message":"And no, it's not magic."},{"comment_id":"10156505662180354","commenter_b":"Give the stupid bitch the boot for good. Free her up so she can go over the Syria and suck up to those murdering rag heads.","commenter_a":"GOOD! This 'professor' NEEDED to be fired!","post_message":"Read the Christian college's powerful statement..."},{"comment_id":"10153647495544877","commenter_b":"'@username is fine. Off subject. .but i had to get that out there. Hey boo...","commenter_a":"Let's try something new black America. Let's not break the law and put yourself in a position to get shot and I bet pretty good money u will live. Lol","post_message":"Thousands of Asian-American Protesters Rally in Support of Officer who Killed Unarmed Man in Housing Stairwell. Watch how it all unfolded below.   Grio fam, protesters said this is '1 Tragedy, 2 Victims.' What's your reaction?"},{"comment_id":"1705131916440587","commenter_b":"Hillary has a mouth just like her, ask Hillary sec service or help!! She is no lady","commenter_a":"Dr. Ben Carson is a class act, the women of the view are an embarrassment to women everywhere & the show should be taken off the air!!!","post_message":"Whoopi Goldberg is just plain GROSS...   I hope this means the end of The View!"},{"comment_id":"1074056242615386","commenter_b":"Because people destroy their habitat and poach them for money.","commenter_a":"Wild animals shouldn't be kept captive! They should be in the wild if people want to see them why don't they go to there homelands instead of leaving them kept in cages!","post_message":"This gorgeous little jaguar cub made his public debut this week at the San Diego Zoo."},{"comment_id":"1158452534233281","commenter_b":"All that fighting over an ugly fat chick?!","commenter_a":"White trailer park trash punks","post_message":"We doubt if just one person was to blame in this insane road rage incident caught on tape. But it's clear that this woman refuses to let it go.  And after pushing and pushing the other driver, she gets a wet blast she never expected.  And it didn't end there..."},{"comment_id":"1514259995548132","commenter_b":"... People do realize the article isn't about humans right? None among us can store the seminal fluid of various males and asses it for quality before choosing our baby daddy's, just FYI. ;)","commenter_a":"Rachel Pratt :)","post_message":"There's more to semen than just sperm."}]
