[{"comment_id":"10153195743346051","commenter_b":"Bitch need a ass whooping!!!!","commenter_a":"need to stick her head in a toilet a few times til she thinks she's drowning","post_message":"Decide for yourselves if this woman got off too easy."},{"comment_id":"10152528871250667","commenter_b":"What union???","commenter_a":"They get enough through their union","post_message":"President Obama will call on Congress to require companies to give workers up to seven days of paid sick leave a year, a senior adviser said Wednesday. Obama will also take executive action to give at least six weeks of paid leave to federal employees after the birth or adoption of a child."},{"comment_id":"10154310515973822","commenter_b":"she clearly states on her wbsite that money not used will go o her pay for future campaign #JillSteinScam","commenter_a":"What's Jill gonna do with all that cash? No refunds, no exchanges, all donations final.","post_message":"JUST IN: The Green Party is dropping its court case seeking a recount of Pennsylvania's Nov. 8 presidential election."},{"comment_id":"990898310953409","commenter_b":"\"Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you\"","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas.  @webpagelink"},{"comment_id":"1020783114655014","commenter_b":"Hillary is a racist!!!","commenter_a":"always my president hillary clinton the best of live 100% help fanta t jolie kant","post_message":"Hillary Clinton holds a net favorability rating of 58 percent among Democrats -- an increase of nearly 10 points since October."},{"comment_id":"10153210976889726","commenter_b":"The love affair begins","commenter_a":"How much are the promises he made going to cost us this time?","post_message":"WATCH: Obama and Castro sit side by side!"},{"comment_id":"1515340161809773","commenter_b":"Well... he lost the popular vote, so that's clearly not true. But you're right, Bernie supporters should feel cheated.","commenter_a":"Obviously people approve of Trump more then Hillary 🤗🙃 Let's be honest he won because of crocked Hillary's disapproval. Bernie supports should feel cheated... he'd be the next president if she hadn't been the democratic candidate.","post_message":"Do you approve of Donald J. Trump?"}]
