[{"comment_id":"10156440483580492","commenter_b":"Elouise faux? Why even post this garbage?","commenter_a":"Nah, it was just ratatouille ...","post_message":"Rats may love eating our finest delicacies, but they don't belong INSIDE of them."},{"comment_id":"10150603929279999","commenter_b":"Aren't they real women? What's a real woman, and who doesn't qualify ?","commenter_a":"Perhaps a more diverse group by race, ethnicity and cultural but alarmingly the same re: the skinny, young and sullen look of mannequins rather than real women...","post_message":"Meet the woman behind the unconventional beauty of today's most successful models."},{"comment_id":"10154962501399609","commenter_b":"And I love Mexican women too.","commenter_a":"This will bring in more money for our economy and more jobs to the US and lessen our trade deficit with Mexico. The demand for US products will go up and continue to stimulate our economy. Finally, we have a president making decisions that loves Americans and his country.","post_message":"JUST IN: President Trump wants to pay for the border wall by imposing a 20 percent tax on imports from Mexico. @webpagelink"},{"comment_id":"10154403319313812","commenter_b":"On their engines a 100,000 is a lot, only had to do my head gaskets or have a burned out valve. Meanwhile my duratec engine in the Mazda hit 300,000 with little power loss. We do love or did I should say our new 2016 Outback for the whole 600 miles we had it till yesterday it was the 85th car at the single dealership to be towed away to some lot in the middle of slc airport till god knows when Subaru can pull their head out and get entire steering colums to replace.","commenter_a":"I have 4 Subaru's in the family 2005, 2008, 2010, 2012. Three foresters one Tribeca. They all have been great. never had an issue with any of them. Two of them are over 100,000 miles. Love my Subie!","post_message":"RECALL ALERT: Subaru of America, Inc. recalls 52,000 cars and SUVs over potential steering failure and warns owners not to drive them."},{"comment_id":"915633041826559","commenter_b":"Nah she just pays for herself. Greedy money grabbing witch.","commenter_a":"And so............she pays her female staff less thrn her male staff. GOOD job hillary","post_message":"Equal pay isn't a women’s issue. It's a family issue. It's an American economic issue."},{"comment_id":"10153780658736350","commenter_b":"@username I have no clue what you are talking about but let me clue you and those like you in on something .... we wonder why kids are shooting up schools and bully each other to death when all they have to do is look at ignorance like you for an example. Sit behind a computer screen and throw insults around like you are all important. You get on a thread and bash a new born baby and his parents that take care of them selves and don't do anything what so ever to you and the likes of you. Instead of passing over a story you don't want to be a part of you get on threads and be an ugly soul and bully people that are happy for this couple or any couple that lovingly gives birth to a much loved and wanted baby. Since you brought up ...","commenter_a":"People have babies everyday! Women birth children under horrible circumstances... Alone .. In poverty ... How about focusing on that instead of these irrelevant people!!","post_message":"Congratulations, Jessa Seewald and Ben Seewald!"},{"comment_id":"10153513797158701","commenter_b":"Snaggleteeth women put up with more bs. Lol gross though!","commenter_a":"I have great teeth, and I cannot even get a date! I always wonder how snaggletooth women like that get a date.......LOL","post_message":"A Georgia woman is accused of going on a violent, drunken rampage after her boyfriend refused her advances."}]
