[{"comment_id":"10153444104128690","commenter_b":"Americans breed Christians at alarming rates... They have taken over.","commenter_a":"stop buddist terrorist!","post_message":"The group has stoked anti-Muslim sentiment by saying Muslim communities have high birth rates and will eventually overrun the predominately Buddhist country even though they currently represent less than 10 percent of the population. @webpagelink"},{"comment_id":"918671201578514","commenter_b":"Death should be her punishment.if not Deport her rotten ass . We don't want her here.evil.","commenter_a":"Behead the Bitch...","post_message":"Muslim Nanny Who Beheaded 4 Year Old Girl Will Not Face Murder Trial Because... This is the world we are living in today people. What do you think her punishment should be?"},{"comment_id":"1270356769653367","commenter_b":"She is so gross, just sickening!","commenter_a":"Whatever That idiot should move to Mexico","post_message":""},{"comment_id":"10155226667000579","commenter_b":"Then you better understand that and take help from the one aligned closest to you which includes conservatives of all races.","commenter_a":"White males are the least served segment in British education.","post_message":"British Prime Minister Theresa May: \"I am pleased that I am able to meet President Trump so early in his administration.That is a sign of the strength of the special relationship between the United Kingdom and the United States of America.\" Full video of Primer Minister's Questions here: @webpagelink"},{"comment_id":"10152906344266717","commenter_b":"#BullShitAssHole","commenter_a":"hater!","post_message":""},{"comment_id":"10153075316564440","commenter_b":"Sarah, maybe if your homegirl wouldnt act so tough against the cops and complied, she would be alive. she rammed a car towards and now she's dead!","commenter_a":"Wow these damn cops can do what they want that's a damn shame","post_message":"BREAKING: No charges against Denver cops who fatally shot 17-year-old Jessica Hernandez dpo.st/1dSxAU8"},{"comment_id":"1333672556666443","commenter_b":"but know to make tanks and bombs 😅","commenter_a":"Those migrants were never going to fulfill those jobs anyway. The Syrian migrants are larely unable to learn German to a competent level, and lacked basic education before they came. They are just going to be on the taxpayers' dole. Huge mistake bringing that many in.","post_message":"Unemployment in the engine room of Europe is at a 25-year low."}]
