[{"comment_id":"10153744058143132","commenter_b":"She's Still A Douche!!","commenter_a":"Doughnuts? I thought she smelled like Dalmatians.","post_message":"You can finally relax, Ariana Grande's fragrance ad is here."},{"comment_id":"440337219424652","commenter_b":"If your not Born in Africa, how are u African, He's right, I dont say I'm scottish, I say i'm an American, People need to stop playing this devide and conquer game the rich is playin thru the Media, which they own, thru the military with constant wars which profit the rich, and of CORSE MONEY, the one and only thing the rich care about. EAT THE RICH! They are the enemy!","commenter_a":"This is a very poorly written article","post_message":"A Florida Sheriff is in hot water after a 2013 racist rant he recorded on video has surfaced just before he begins to gear up for re-election. Watch the video then read our commentary by Lou Colagiovanni"},{"comment_id":"10156690146685231","commenter_b":"You beating her implies you didn't educated her about her role in society or her worth. Beating her is so drastic & dramatic. Talking & educating her would be much more powerful.","commenter_a":"If that girl were mine I'd slap her into next week but then again no child of mine would refer to herself as meat or be that cheap","post_message":"A high school boy asked a girl to prom with a sign that said, 'I prefer dark meat. Prom?'.... There's some things wrong here."},{"comment_id":"10154511519316337","commenter_b":"So you're mad cause you're a poor bitch?","commenter_a":"They didn't add he is sitting on a seat worth about $10,000 every on of his jet/ helicopter has gold leaf in on it and don't won't to get it dirty","post_message":"Donald J. Trump tried to be an everyman... on his private jet."},{"comment_id":"10153260664437885","commenter_b":"Phuck that man cunt.","commenter_a":"I thought traitorous dogs got shot!","post_message":"Not a DuffelBlog....this is real"},{"comment_id":"1205061579572376","commenter_b":"Christina @username you stupid c-unt you clearly can't read into my post. Go suck on Killerys nip..... Trump 2016","commenter_a":"For all of you who want to tell us it's a leased Eastern Airlines plane. Save it we got it and read it.....","post_message":"Barely 24 hours after Donald J. Trump accepted the GOP nomination for president, something incredible happened with his plane.  What Trump ordered for the plane has conservatives cheering and liberals pitching a hissy fit."},{"comment_id":"1032855700144015","commenter_b":"No one is looking to take away your guns, just like no one is looking to take away your car.","commenter_a":"Taking guns away from citizens violates our rights. Criminals will be the ones with guns. I have a hard time understanding why the hell people dont get this!!!!","post_message":"Nearly 50 years ago, Robert F. Kennedy made an appeal for gun control in Oregon -- just miles from where the recent mass shooting at Umpqua Community College occurred."}]
