[{"comment_id":"860452347398311","commenter_b":"What an idiot, can she really be this stupid? If this passes for high intelligence, I must be a genius","commenter_a":"You really cannot fix stupid","post_message":""},{"comment_id":"10155940729650354","commenter_b":"Sick disgusting bitch","commenter_a":"hahahaha yes she was tim...","post_message":"Unbelievable...."},{"comment_id":"10153647495544877","commenter_b":"@username is fine. Off subject. .but i had to get that out there. Hey boo...","commenter_a":"Let's try something new black America. Let's not break the law and put yourself in a position to get shot and I bet pretty good money u will live. Lol","post_message":"Thousands of Asian-American Protesters Rally in Support of Officer who Killed Unarmed Man in Housing Stairwell. Watch how it all unfolded below.   Grio fam, protesters said this is '1 Tragedy, 2 Victims.' What's your reaction?"},{"comment_id":"10153434994756636","commenter_b":"I do hope she gets all the care she needs. These countries are very poor and need all the help they can get. Imagine if you lived over there and your own children where sick. This is just heartbreaking no matter what.","commenter_a":"Her immune system must be shot to pieces - I do hope they can sort out the problem and eventually cure her. She deserved the best possible care.","post_message":"Pauline Cafferkey's in hospital for a third time"},{"comment_id":"10154995182613812","commenter_b":"All the liberal whiners calling racist. Typical","commenter_a":"its a trump or Hilary is American citizens decision no other nation have right to comment any thing about it...stop spreading hate","post_message":"On Wednesday morning the world will wake up to a new American president. Here's what news outlets across the globe are saying."},{"comment_id":"10154617717319255","commenter_b":"\"...ignorant and moronic assumption...\" \"...liberal mindset of free everything...\" I'll just leave that there where it belongs.","commenter_a":"I am a conservative who volunteers for children's charities, doesn't care if same sex couples marry, is pro-choice, owns a hand gun but doesn't believe any private citizen needs an Uzi, am a military spouse so obviously vehemently support our military (active and retired) and work in the public school system and believe those who work hard and succeed in high school deserve a break in college tuition. I'm sorry I don't fit in to your ignorant and moronic assumption that all conservatives are alike.","post_message":"Pretty much.   Thanks to Northern Michigan Progressives for sharing."},{"comment_id":"1641280749470830","commenter_b":"At the end when she started really going after him is when I would have had her on the ground and I would break her fucking arm and left her there to rot","commenter_a":"Knives are becoming a serious problem. Yet another unintended consequence of terrorism.","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"}]
