[{"comment_id":"10152889300511051","commenter_b":"Prosecute these fools ASAP!","commenter_a":"Once again this is the reason for the death penalty, see if they would be laughing then!","post_message":"This group ran out of a restaurant without taking care of their bill. When a waitress followed them, they decided to make her pay."},{"comment_id":"510533845803862","commenter_b":"Leave you camel humpers","commenter_a":"get OUT","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"},{"comment_id":"10153448669913984","commenter_b":"All she had to do was say she was to fat to walk any farther and lazy. Should of called the cops and let them tow her.","commenter_a":"I want to have cards printed that say \"Congradulations! You have just won Jerk Of The Year Award for parking in a handicap parking space. Because of you my Mother could not get into her wheelchair. May you never have to be in the same situation.\"","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"10153369808282377","commenter_b":"GOD BLESS PRESIDENT TRUMP...Donald Trump For President","commenter_a":"I guess I am again confused. A few days ago there was a story about Donald Trump giving both Dr. Carson and Sarah Palin a potential job in his administration should he get the Presidency and there was a great cry from many who said \"That is illegal\" Now Cruz names an entire National Security Team and it is OK? I have no problem with either of them talking about their potential teams, I just wonder why Trump's potential plans are \"illegal\" and Cruz's potential appointments are OK?","post_message":"Ted Cruz's national security team includes former Assistant Secretary of State Elliott Abrams, former Missouri Sen. Jim Talent, and former U.S. Attorney Andrew McCarthy."},{"comment_id":"734144593405526","commenter_b":"Yes","commenter_a":"Yes.","post_message":""},{"comment_id":"10153318936789087","commenter_b":"He sure is blowing minds. LOL @webpagelink","commenter_a":"Cruz has no idea what he is talking about.","post_message":"“Why would you then bail out rich Wall Street banks and not Mom and Pop?” Ted Cruz  asked John Kasich as they sparred over bank bailouts at the #GOPdebate."},{"comment_id":"1038590639515127","commenter_b":"Jennifer BTW how is that being a bitch. Bitch?","commenter_a":"And ALL of their body guards carry guns","post_message":"This video is packed with more celebrities than we could count — and they have one powerful message for the world."}]
