[{"comment_id":"1882169925350064","commenter_b":"she needs 2 take a step back! She also needs 2 learn 2 RESPECT OTHER PEOPLE,S OPINIONS! If she doesn't like it here...LEAVE!","commenter_a":"Get rid of her. She's a real Bitch. Jeanie","post_message":"Whoopi Goldberg just crossed the line when she said this about Trump's children. She just got taught a lesson she'll never forget. Should Whoopi be kicked off the air?"},{"comment_id":"397229163813931","commenter_b":"Get these people deported","commenter_a":"if these goat humpers do not like the laws of the US they are free to leave any time they want","post_message":"Shock Poll! More than HALF of Muslim-Americans Think They Should be Allowed to be Governed by Sharia Law!"},{"comment_id":"487132828135264","commenter_b":"What? the lying lame are going to teach other people to be perverts? Really","commenter_a":"OMG!","post_message":"Goooooood Moooooorrning!!"},{"comment_id":"10153117785839440","commenter_b":"close your trap you negative nancy!","commenter_a":"Who cares- nuggets are less than irrelevant.","post_message":"Denver Nuggets selected Emmanuel Mudiay with seventh pick of the NBA Draft @webpagelink"},{"comment_id":"666187176847797","commenter_b":"Too much butt kissing being done. The pilot and his white privilege remark, the seat mate's skin color even being mentioned, the flight attendant feeling compelled to apologize...oh, brother! This chick needs to put her big girl panties on and if she's a peace loving/seeking person, she'd drop the whole issue.","commenter_a":"So let all muslims boycott United, I will feel much safer with them not being there. Muslims are lower than whale shit.","post_message":"Look what happens when a flight attendant refuses to give a Muslim woman a Diet Coke..."},{"comment_id":"10153457336028525","commenter_b":"Brian","commenter_a":"Jose J Torres","post_message":"A cure for diabetes? It could happen, and they've already begun testing it in a small number of diabetic patients. STORY: @webpagelink"},{"comment_id":"733367520187159","commenter_b":"we need to get these low lifes out of our country","commenter_a":"I am offended by them. I don't want to take them down but can we send them home. I m gladly contribute with the air fair","post_message":"Muslims Make Massive Move To Change The Flag Because It's Offensive If you don't like the flag you can leave. Do you think this is absurd?"}]
