[{"comment_id":"10154122931756756","commenter_b":"Ugly, spoiled killer.","commenter_a":"The apple didn't fall far from that tree.","post_message":"In a video released by Mexico's immigration institute, an expressionless Ethan Couch is shown being led into a truck and placed on a plane at a Mexico City airport."},{"comment_id":"10156397389135354","commenter_b":"@username .. Martin.. better yet go fuck your Obama loving Momma..","commenter_a":"Obama is anti american ... he wants the rest of the anti americans to come and invade us.. he has decleared war on americans..","post_message":"WATCH Trump explain his plan, and why he opposes Obama's Syrian \"refuge\" scheme..."},{"comment_id":"1100490033318081","commenter_b":"Suck it up b**ch","commenter_a":"I thought this family was rich. What gives?","post_message":"Hardly 5 star quality... \"She explained a slight bit of displeasure about her accommodations and I explained to her this a jail, not a resort.\" -Sheriff Anderson @webpagelink"},{"comment_id":"10155758451790354","commenter_b":"Go away welfare momma!","commenter_a":"Bitch","post_message":"Not helpful..."},{"comment_id":"10154110742322439","commenter_b":"Cowards !! Stay to fight for your country !! You are Iran's puppets !!","commenter_a":"No problem. Enlist them in the French Foreign Legion - minimum 12 year enlistment; send them to Corsica for Basic and Combat training, and then deploy them to Libya to fight ISIS.","post_message":""},{"comment_id":"10153988463481077","commenter_b":"If this is true, shame on her! She should be charged too!","commenter_a":"So she knew about it before it happened?","post_message":"Mateen's current wife told the FBI that she was with him when he bought ammunition and a holster, and that she once drove him to Pulse because he wanted to scope it out."},{"comment_id":"836649156384109","commenter_b":"he s a crook","commenter_a":"Shake hands then shoot the f'er in the head.","post_message":"Rahm Emanuel just wants to be friends with Chicago unions"}]
