[{"comment_id":"10153559590411051","commenter_b":"Lol, she can't read","commenter_a":"If a citizen from another state isn't eligible for in-state tuition, why should someone here illegally from another country have that benefit? I agree with the ruling.","post_message":"The Georgia Supreme Court's decision was clear: Illegal immigrants are not eligible for in-state tuition. Do you agree or disagree with the ruling?"},{"comment_id":"10153780029707232","commenter_b":"And until the punishment is worse people will keep doing it! Idiots","commenter_a":"Wow! he only got tickets.. texting and talking while driving is just like ( being under the influence) he could of killed someone.","post_message":"A driver who was texting on his cellphone crashed into a Delaware home, causing major damage, according to police. STORY HERE: @webpagelink"},{"comment_id":"10154011043376615","commenter_b":"@username fighting for these POS muslims till the end. Listen hag, why dont you leave for Somalia and see how that works out 4 you. Liberal hag!!!!","commenter_a":"The hate and racism on here is disgusting! Most of you don't even know what's happened, you're just ready to jump in with your white supremacist rhetoric. Makes me sick.","post_message":"WATCH LIVE: Officials are providing an update on the victims in the attack at The Ohio State University. WPXI Aaron Martin is in Columbus and will have the latest developments on Channel 11 News at 5:00. MORE DETAILS: on.wpxi.com/OSUAttack"},{"comment_id":"10152758029596545","commenter_b":"She was a nut, thankfully I moved not long after","commenter_a":"This reminds me of the time once I lived in Claremont, NH I was taking pictures of a pretty sunset in my front yard and my crazy neighbor threatened to come after me with a knife because she \"thought I was taking pictures of her\"","post_message":"Police are investigating after a man was shot and killed while taking pictures of the snow in Northeast Dallas just after midnight. STORY: @webpagelink"},{"comment_id":"10153952900813984","commenter_b":"She should Benin jail!","commenter_a":"How many of those radical Islamic terrorist countries donated to the Hillary fund. She knows they did.","post_message":"Hillary thought she'd jump on the opportunity to steal some attention from the Republicans during the debate, but it did NOT go as planned. Critics immediately fired back and pointed out something hilarious... Is Hillary Clinton one of the last people you would ever want to become president?"},{"comment_id":"679029648954280","commenter_b":"Lock her ass up","commenter_a":"Waiting?","post_message":"FBI moves to arrest Hillary and put her in prison for 10 years. Good, it's about time. She deserves longer. Would you be happy if Hillary was in Jail?"},{"comment_id":"10153195782398984","commenter_b":"she is a witch","commenter_a":"She's a BIG box of rancid nuts , and there are plenty more in there with her !!!!!","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"}]
