[{"comment_id":"817179565047318","commenter_b":",the problem is that these companies take too much Shit from their UNRULY customers.Customerst first..What about employees?","commenter_a":"The manager did NOT make the right call which is why they are out of a job!!!! You don't reward bad behavior. Companies don't have certain people to service certain customers!!! You have problem resolution departments or resolution specialist but in this case the customer was the problem!!! Options being \"mam we can certainly deliver your item(s) or we can refund your money but we do not have special delivery people\".","post_message":"The driver says he was told \"you are black, and they don't want you at the house.\""},{"comment_id":"10150935910204999","commenter_b":"Women for Donald J. Trump","commenter_a":"Is this the Hillary lecture show or a debate where we're going to hear from two people. Chris Wallace if you wanted to have a person conversation with Hillary you should have called it as such and not drag us through this BS","post_message":"Chris Wallace’s star turn is a welcome source of pride at Fox News. And, maybe, some relief."},{"comment_id":"1190103767694524","commenter_b":"SOROS supposedly promised her the election so that is why she thinks she has it. THEY WERENT COUNTING ON TRUMP TO TAKE OVER!!! LOL GO TO HELL BITCH> WE NEED TRUMP NOT SOME GANGSTER BITCH AND HER CULT!!!","commenter_a":"Nobody bothers to mention that the last time the Clintons were in the white house they stole furniture and silverware and were forced to pay or return it.","post_message":"Hillary thinks she's already won. This kind of sick behavior is UNACCEPTABLE in a constitutional republic!"},{"comment_id":"10154500485544062","commenter_b":"So the one girl should go back to Chicago? That's where she was born so that's her home.","commenter_a":"Assimilate, dump your hateful evil religion; or maybe you should go back wherever 'home' is.","post_message":"What would you have done in this situation?"},{"comment_id":"10152474320835927","commenter_b":"The ones I know aren't allowed to voice an opinion.","commenter_a":"The rest can't say anything 'cause they're still in boot camp.","post_message":"Does President Obama deserve this low approval rating for military personnel? Leave a comment... Read More: @webpagelink"},{"comment_id":"10154318254146509","commenter_b":"Why don't you look back in G W Bush and Klinton to what they did? The difference between Russia and the USA is that the USA never asked for permission to invade any country. They just did what they wanted, and they destroyed the whole country with it's sovereignty. Another difference is - when you sea how these leaders greet \"dictators\" as they call them, with extremely wide hypocritical smile, and after a while the destroy them. Russian leader doesn't smile that much, but you get the feeling that he doesn't substitute his values and he is a person that can be trusted.","commenter_a":"Closed CAPTIONS, please!","post_message":"Five of CNN's correspondents look back at the role of Russia and President Vladimir Putin this year, and what impact there may be in the future. @webpagelink"},{"comment_id":"10153448155621045","commenter_b":"Sure","commenter_a":"Elizabeth Kidd can we please please please go see this in 3D when it comes out ? Without the kids the first time lol","post_message":"Cannot wait! \"Keep on swimming.\""}]
