[{"comment_id":"1749284951998475","commenter_b":"I love this","commenter_a":"'@username @username me in second year","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"},{"comment_id":"930249893698207","commenter_b":"'@username tell that to these women and many more @webpagelink","commenter_a":"Hillary takes millions from country's that rape girls at 9... Legally. And where woman can be beat stoned or imprisoned just for reporting rape.. What happened to the war on woman? Oh, big $$$$$$$$ Oops, my bad","post_message":"Hillary can't do it without you. Sign up to volunteer: @webpagelink"},{"comment_id":"1146022832118940","commenter_b":"How much did this investigation cost you???? Lying bitch.","commenter_a":"Hey liar, the FBI doesn't release information on investigations.","post_message":"Clinton is calling for the FBI to release more details on the investigation, saying 'the American people deserve to get the full and complete facts immediately.' Agree or disagree?"},{"comment_id":"1133136583393865","commenter_b":"what an ass!!!","commenter_a":"Pussy","post_message":"Dwayne The Rock Johnson just got candid about his struggles with depression. - Robbie Couch"},{"comment_id":"10153121950974641","commenter_b":"Oh really? Documented mental illness or zealous?","commenter_a":"Ohhhh good to know that! So, the ones to blame are those 150 victims for taking that plane!!","post_message":"Alps crash co-pilot suffered from severe 'psychosomatic illness,' according to reports: @webpagelink"},{"comment_id":"10154164931281162","commenter_b":"with your last name you should go back where you came from...why are you here in the US","commenter_a":"Cuba please keep Obama and his family. Also don't forget the mother-in-law","post_message":"Pres. Obama touches down in Cuba, making him the first sitting president to set foot in the country in almost 90 years: @webpagelink"},{"comment_id":"10152723867461680","commenter_b":"No, LIb. First of all you ASSume that every business owner in the country is a Republican, which is just more made up shyte by a LIb. Secondly, its called supply and demand. By flooding the labor market via illegal immigration and REWARDING illegal immigration, Libs increase the supply of labor in relation to the demand for labor, which lowers the price of labor.","commenter_a":"IT is amazing how those who vote republican seem to forget that Reagan and both Bush's gave amnasty to illegals, Reagan even went on to say that he would like to see an open border where the Mexicans could come and go any time they wanted, For all of you simpleminded republicans who want proof you have a computer look it up,","post_message":"Texas and other states suing over the moves say that only Congress can authorize the kind of sweeping actions Obama took."}]
