[{"comment_id":"10153945644022061","commenter_b":"@username because the wife wouldn't lie right?","commenter_a":"Speak children...\"Out of the mouths of babes!!! All of the racist and fearful cops should be out of the streets and sitting behind a desk (not having to deal with the public). A lack of respect is found in all groups of people and that still is not an excuse to slaughter a certain group. Americans kill, so should terrorists groups kill us??? Should animals attack people because they kill them for sport or make them zoo exhibits?","post_message":"TAKING A STAND: Kids of Charlotte spoke out at a city council meeting about their fear of the recent violence in their hometown: @webpagelink"},{"comment_id":"544829205708653","commenter_b":"Free so the they can bomb and kill Israelis like their surrounding neighbours. No thanks","commenter_a":"I'm sure this will give the Zionists more reasons to steal land in Palestine I hope the poor people of Palestine will be free some day","post_message":"Wildfires are also threatening homes near Jerusalem and in the West Bank."},{"comment_id":"10155047061111336","commenter_b":"what a bunch of bullcrap everyonr can get s social security number legal or not","commenter_a":"Wow that hurt my brain to watch. He says illegal immigrants contributed billions of dollars in taxes and social security 😂😂😂😂 you cant do that if you dont have a social security number and if your here illegally you dont have one. So how exactly is illegal immigrants doing anything for our nation except burding all of our systems and taking jobs from american citizens.....","post_message":" do you have a Social Security card to be in this country? How do you have a Social Security number? ICYMI: \"Angel Mom\" Laura Wilkerson and undocumented immigrant Jose Antonio Vargas clashed over President Donald J. Trump's executive orders on illegal immigration. @webpagelink"},{"comment_id":"893596794095327","commenter_b":"Obama lead the ludicrous Iran Nuclear Deal. That was it for me. Iran has already violated the 5 year ban on developing and testing ballistic missiles which was part of the nuclear deal and guess what - do nothing Obama is just ignoring it. As far as national security goes - Obama is a disaster. And now he wants to bring in 10,000 refugees from ISIS territory who can not be vetted. Obama is not good for America or Israel.","commenter_a":"CORRECTION: It is under Obama that Israel has received more defense material than under any other previous administration! And these people have the gall to call him the worst President for Israel! And with His Highness' present standing in international diplomatic circles, his voice is hardly more than a \"whisper\" in the globalized wind! It's about time that people become aware of what he has wrought on Israel's reputation.","post_message":""},{"comment_id":"10153308267139641","commenter_b":"Give her a million and send her on her way.","commenter_a":"Probably be on ID How I almost got away with it","post_message":"Russia's richest man faces $7 billion divorce bill: @webpagelink"},{"comment_id":"10153390451923837","commenter_b":"She should have done what the officer said and THEN tried to negotiate. I'm sure he would have let her return or pay for the shoes, but she insisted on pulling away from the officer, flailing and kicking. Officer was in the right.","commenter_a":"Oh well she got her prize for stealing","post_message":"DO THEY GO TOO FAR? Check out the body cam video of a Fla. woman accused of shoplifting being taken down and bloodied by a sheriff's deputy. Was the officer too aggressive? THOUGHTS - HANDLED FINE or WENT TOO FAR?"},{"comment_id":"1733753426842494","commenter_b":"@username Subtract the illegals and convicted felons that cannot vote those minority numbers are laughable .","commenter_a":"I see Hillary's sheep say Trump will Lose the Latino, Woman, LGBT, Veterans and Blacks votes. I am sure Latinos enjoyed seeing they are called taco bowl voters to the democrats. Women Yeah because Women most likely respect the way Hillary treated women when her husband sexually assaulted them, LGBT yeah because her policies are directly responsible for 49 of there deaths in Orlando and she wants to increase that by 500%, Veterans yeah because every service man/woman wants a women who will abandon them. Blacks yeah because blacks love to be called super predators, The only votes Trump is losing is to brain dead people who care more about a business mans taxes then they do Clinton's proven corruption and lies. and the only polls Trump is losing is broadcast on the same media outlets that have been proven to be corrupt. Watch a Trump rally and then watch ...","post_message":"\"[Hillary Clinton] is bought, controlled and paid for by her donors and special interests.\" Donald J. Trump gave a speech on economic policy this afternoon, saying \"Hillary Clinton will never withdraw from TPP.\""}]
