[{"comment_id":"1082429571840463","commenter_b":"Sounds like @username sharing a very personal account.","commenter_a":"I agree, but those who refuse to see this analogy... the seriousness or the truth of what is happening to America ... and what to do about it... before it's too late and America is totally unrecognizable... is another story.... the story of the real American history is not being taught for one thing ... the story as in the recent documentary by \"Dinesh Desouza, \"Hillary's America\"... the story of the real America is not being told in the history books or on the campaign trail...and not mentioned once in any of the debates....WHY??? these are the people who need to hear the real American History .... I for one was in shock...to learn the truth... but was blessed and was one of the fortunate ones to \"see\" this documentary... but there are others who are ignorant of this truth ... who are or choose to remain a victim or ...","post_message":""},{"comment_id":"10152771119936051","commenter_b":"Lady, when in America, do as Americans do. Our country was founded on a theocracy. Deal with it.","commenter_a":"Happy to hear it! American laws and rules apply here. NO others. Don,t like it then leave!","post_message":"This woman demanded that she be allowed to swear on the Quran before testifying. Well, she got her answer."},{"comment_id":"10154377654466729","commenter_b":"parents need to stay in contact with reality when it comes to their kids. pay attention to what schools is teaching our kids. it is all coming together. womans lib, moms are not home any more to pay attention to what kids bring home. homes have been destroyed.","commenter_a":"Those who can, do.","post_message":"Bingo."},{"comment_id":"374960556025572","commenter_b":"You want to live in America and enjoy all our Country has to offer! Take off your scarf.","commenter_a":"Yes","post_message":"Should head scarfs be banned in America?"},{"comment_id":"1225168154206852","commenter_b":"No woman in her right mind would have voted for this man. God help us all.","commenter_a":"Genial","post_message":"'Donald Trump will make our economy great again'"},{"comment_id":"722235994591000","commenter_b":"For sure! Madam President for Prison 2016 once Trump beats her.","commenter_a":"i can't wait to be able to call you Madam President!!","post_message":"16 days. IWillVote.com"},{"comment_id":"992191140821358","commenter_b":"Why? I think she is best in the senate. I also think an all female ticket is unrealistic.","commenter_a":"Clinton/O'Malley would be a good ticket.","post_message":"Hillary Clinton absolutely crushed every single Republican candidate in a recent CNN/ORC poll."}]
