[{"comment_id":"1006176036165841","commenter_b":"Just why is this bitch here ??","commenter_a":"You're right. I didn't see anything about this on the news networks.","post_message":"You will DEFINITELY not see THIS on CNN. Nor, will you hear BHO condemn her violent, F-bomb laden, BS. @webpagelink"},{"comment_id":"1715308212052135","commenter_b":"That is the good thing about voting for Trump! It is bad for Mexico and good for the USA!","commenter_a":"Bite me you greaser","post_message":"Mexico's former president claimed voting for Trump is \"treason.\""},{"comment_id":"10153636980216135","commenter_b":"I can't believe an older women like your self could be so ignorant. I've always been taught if you don't have anything nice to say DON'T SAY NOTHING AT ALL! How can those words even come from your mouth. Where is your morals?","commenter_a":"I'm so sorry for his family and friends, but what can you say about someone that stupid...?","post_message":"Police say the man was driving his car in reverse with the door open when he fell out."},{"comment_id":"1362693153771141","commenter_b":"Voting is a great right to have in the United States. It is so sacred that military veterans have put their lives on the line to make sure that we still have this right in the country. People take voting very seriously. It’s one of the essential parts of a democracy. Therefore when it comes out that people are messing with the people’s right to vote, it should be considered a big deal. And that is exactly what is happening in this country. The Democrats have been trying to fix the elections that have been going on in this country. They are doing this to make sure that they remain in power in the White House. Voter fraud has become so rampant that Fox News had a guest come on and say that there are at least four million dead people on U.S. voter rolls. Democrats and Bad Ideas go ...","commenter_a":"The best part from Donald Trump \" if u are for women supporting women's rights why are u taking money from countries that support ISIS and not treat women well, u should give all the millions back to them \" well said Donald Trump🇺🇸🇺🇸👍🏼🇺🇸","post_message":"In less than three weeks, we will elect a president—and only one candidate tonight showed she has what it takes. Will you be able to say you did all you could when it counted? Chip in now: hrc.io/2eiZtIy"},{"comment_id":"1014917681925727","commenter_b":"Alex, it was a hot springs then we saw in the photograph.","commenter_a":"Christopher Sorrentino","post_message":"Hot springs have injured or killed more people in Yellowstone National Park than any other natural feature."},{"comment_id":"469085879883119","commenter_b":"Except for people who saw it flying over their state capital day after day, a flag that also flew with burning crosses and nooses around the necks of limp bodies. Sick of fucking people saying this is a diversion. First of all, it's pretty damn serious to A LOT of people. Secondly, you act as if these news stories would be discussed anyway. Anyone stupid enough to think real shit is covered by the MSM is the true \"idiot sheep.\" Grow the fuck up, we have a nearly unlimited access to all sorts of information. If this \"diverted\" you, you were never paying attention.","commenter_a":"I read some of the commits and have to wonder if red necks get the discovery channel. If all of mankind's dna began in Africa. What does that make all white people on earth? Some different people but it is the rays from the sun that could be a problem.","post_message":"While the media turned a tragedy into a debate over a flag, here are 10 major stories you might have missed"},{"comment_id":"10154345885036051","commenter_b":"No second chances for this crazy woman!! That poor girl going thru all those surgerys...","commenter_a":"The sister is right she is not a monster!! She is a crazy bitch! And to me the sister is as bad, would she want the mom released if it had been her that had been put in an oven!! I mean seriously what the hell is wrong with people?? And myself i have a hard time buying the insane bit anymore, to many times it is used to try to get away with doing wrong!","post_message":"When she was only 14 months old, Ashley's mother put her in the oven and turned it up. Her father was able to save her. She spent the next 10 years in and out of surgeries. Now she is 15 and ready to start high school - and she just got some unexpected news about her mother."}]
