[{"comment_id":"10153469800395671","commenter_b":"The fact she had felony DUI charges in the waiting... leads one to think she has done this more than once. '...facing felony drunken driving charges and cruelty to a child stemming from a previous incident.' I doubt that she was so unlucky that the one time she went drinking then driving, she got into an accident and was arrested for DUI. This is usually a pattern behavior.","commenter_a":"Your not innocent when you drive drunk, multiple times. Your a murderous person that cares less about others even your own children! Wake up !","post_message":"The woman who was driving a car that crashed and killed five people this past weekend was facing felony DUI charges and cruelty to a child stemming from a previous incident."},{"comment_id":"925848087500236","commenter_b":"SHE BE A COMMIE SOCIALIST. FIRE HER!!!","commenter_a":"he needs to take about three weeks of anger management and then come back child behavior period","post_message":"BOMBSHELL!!  This changes everything..."},{"comment_id":"10153662758062894","commenter_b":"Naw mama had let that warning out that she addresses her child my bad young lady again she gon catch that fade","commenter_a":"But skai read her so no need for mama to even say anything","post_message":"Not My Child! Skai Jackson’s Mother Has Words for Azealia Banks: ‘I Don’t Play Those Games’ [Photo]"},{"comment_id":"1292924254103022","commenter_b":"RACISTS EVERYWHERE! SMDH! HILLARY DOESN'T have to PAY for the BLACK VOTE! RACISTS SHOULD KNOW that by NOW! Lol! She was under PRESIDENT OBAMA! The BLACK VOTE IS HERS from the beginning.","commenter_a":"lets see, hillary was SHOCKED at trumps language 30 years ago and then invites and praises someone who uses language that would even make a sailor blush......shame, shame, shame........disgusting is disgusting is disgusting and TRASH is TRASH no matter who is saying or singing the words.......and hillary not only apparently supports this type of language and music, but invites them to share her state.......so disgusting","post_message":"CROOKED Hillary Praises Cop Haters Beyonce And Jay-Z Who Drop N-Word Bombs All NIGHT! BOYCOTT!!!"},{"comment_id":"887553468004375","commenter_b":"What a pig","commenter_a":"The entire 'occupy' movement is a collection of unemployed, pot smoking, attention strumpets who receive gov. assistance and don't want to lose their free ride.. Morons!","post_message":"Pass it on.  Image by Occupy Democrats."},{"comment_id":"898756240177140","commenter_b":". . . and it's just going to get worse until we deport them all ! ! ! !","commenter_a":"LOL. LOL. These retarded Liberals! Can't we all just get along... you stupid liberals have brought this into our country... and now it will be like the middle east... Socialist DEMOCRATS SUCK!","post_message":"(Video) Is 2015 the year we see outright war between radical Muslims and Americans on our streets?  As exemplified by the actions of these Texans, Americans will push back against Islamization with highly provocative moves.   Will Obama be able to keep his jihadists in check until he declares Caliphate?  Read More + Video:  @webpagelink"},{"comment_id":"10154563050778010","commenter_b":"Tell that to the people that hire them....I've seen good ole Americans urinate on the street...it's not an illegal thing","commenter_a":"The only ones complaining they can't find a job are Americans...meanwhile illegals are busting their butts to support their families ..","post_message":"Most Americans believe immigrants in the country illegally are just as hard working as U.S. citizens."}]
