[{"comment_id":"547039675478904","commenter_b":"trump is not going to build a wall or deport. sorry","commenter_a":"Make America great again build that wall","post_message":"'I want America First - so do voters!'  Hear from Donald J. Trump tonight on protesters, the Indiana primary and more at 10p ET. #Hannity @webpagelink"},{"comment_id":"10154584590253812","commenter_b":"HILLARY TO WELCOME 1 MILLION MUSLIMS IN 1ST TERM Clinton's plan to expand refugee resettlement could cost U.S. taxpayers over $400 billion","commenter_a":"So we are being lead into war against each other and to blind to see the obvious of what is happening. When we need to be standing together fighting against these foreign countries and what we have been fighting for way before our time. Instead of allowing the color of your skin be an issue and using it towards one another. If you have so much hate use the energy towards standing up together fighting together working together and being there for one another to stand strong and conquer these hard times. We are giving in to everything we have fought to protect and save. Stop fighting against one another and fight for one another. Stop allowing this society to break us and the government to control us. Stop giving the enemy what they want and give them what they deserve. Stop being that slave to the government and allowing ...","post_message":"President Obama in comments on Nice attack: “These terrorists are targeting and killing innocent people, including Muslims.' @webpagelink"},{"comment_id":"10153380246347217","commenter_b":"Gotta look for the soundtrack","commenter_a":"Ly try it","post_message":"Meowvellous! 🐈"},{"comment_id":"1044606575560353","commenter_b":"Bwabhhhaaahhhhaaaaa.:O On 24/02/2015 1:30 AM, 'Facebook' <","commenter_a":"Does category number 11 include parents?","post_message":"Who drinks the most coffee?  Image by I Love Coffee via AsapSCIENCE."},{"comment_id":"583593931828899","commenter_b":"We Can't Let This Happen ! Deport Them !","commenter_a":"Horrible","post_message":"Our Kids are in DANGER!"},{"comment_id":"575161529335569","commenter_b":"That sick women will never be fine ! Who you kidding !","commenter_a":"Why is this such a big deal? After some rest, and antibiotics she will be fine.","post_message":"Is Hillary Clinton just run down, or is it more serious?"},{"comment_id":"969780003138778","commenter_b":"Bye, bye illegal aliens and their bastard American children.","commenter_a":"Love it, ... and Muslims too !","post_message":"Ay, caramba! #BuildTheWall @webpagelink"}]
