[{"comment_id":"10154335910931130","commenter_b":"Just a joke? Really? So if you ever get assaulted verbally or sexually it's just a joke?","commenter_a":"Oh please. Hillary laughs at getting a guilty rapist off, what does it matter now, and trump was just making a joke. Get real.","post_message":"Talk about RIGGED!"},{"comment_id":"651982771617164","commenter_b":"SEND HER BACK TO WHERE EVER SHE CAME FROM ! LET HER WHINE ALL THE WAY HOME !","commenter_a":"Yap she's crazy..go home.","post_message":"Woman Goes On National TV And Blames Americans For Banning Sharia Law And Executing Kids In... This must be some kind of sick joke. Do you think she has completely lost her mind?"},{"comment_id":"901967236585038","commenter_b":"she has blood on her hands !!! Bengazi !!","commenter_a":"AWESOME","post_message":"In the just out Fox News Poll, I easily beat Hillary Clinton - and I havn't even focused on her yet. On our way: MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10154376323356509","commenter_b":"Screw this Stepford wife!","commenter_a":"I had expected @username to declare Hillary Clinton the winner of this State of the Union but to my surprise @username has decided to no longer boycot Bernie Sanders. Wolf Blitzer called him \"a new face\" and very underestimated by the general public. Yes Wolf, he is a new face on @username and he was underestimated by @username but not by the general public. We all saw this coming, you better explain why you didn't: ignorance or incompetence?","post_message":"5.) \"Many of our best corporate citizens are also our most creative.\" -- Barack Obama during his State of the Union or Nikki Haley during the GOP rebuttal? #SOTU"},{"comment_id":"10154143941493984","commenter_b":"OF COURSE IF THEY FIND BLOOD FROM THE VICTIMS ON THE KNIFE, IT WILL BE TO LATE TO USE AGAINST OJ! BUT CAN ANYONE IMAGINE, IF THE PRISONERS FIND OUT ABOUT THAT, HE'LL NEED ALOT OF MONEY TO KEEP HIM SAFE IN PRISON!","commenter_a":"This must be the month of truth telling in EVERYTHING!","post_message":"Wow. What was found buried on O.J. Simpson's former property could change everything. This is a HUGE twist..."},{"comment_id":"10152724701755927","commenter_b":"I don't know who he is, but I do not like him.","commenter_a":"And? Who cares what Chris Hayes thinks!","post_message":"Remember this from Chris Hayes?"},{"comment_id":"10153168898035950","commenter_b":"Says the jaded soul. We still love you.","commenter_a":"He really thinks his opinion really matters. I hope and pray to God he loses really bad so he can get off his arrogance. He is a very insecure man. You can see how he talks and communicates his body language very insecure man. His life is a big lie and is willing to say what it takes to take the country down. Amazing some coat see right through him. Must not be very bright people.","post_message":"The secret to real estate mogul Donald Trump's popularity in this election season has eluded pundits, pollsters, the Republican establishment, and really, everyone else. \"Honestly it's my looks,\" Trump said before a rally in Atlanta on Saturday. \"I'm very handsome. That's the only thing I can think of right now\""}]
