[{"comment_id":"10154400468321509","commenter_b":"How does this help improve the economy, education, and create jobs! The battle is more than Hilary, let her stop dreaming!!!!!!!!!","commenter_a":"Go directly to jail","post_message":"Hillary Clinton: \"I will defend voting rights, and make it a priority... to get rid of Citizens United and its pernicious effects on our electoral system.\" Read her opinion piece on CNN: @webpagelink"},{"comment_id":"10153206684663855","commenter_b":"F LA! No bears or real men only these fake ass roided out bitches","commenter_a":"Where did they get the inspiration for those haircuts ... :-)","post_message":"Love these pics!"},{"comment_id":"533141560209757","commenter_b":"Brainwashed stupid women!!!!!!!","commenter_a":"Let them go back to the country they came from if they want to wear their Burkas","post_message":"This Muslim woman refused to remove her veil, then something awesome happened. Good. There's no room for fanatical Islamic culture in the US. Do you support a Burka ban?"},{"comment_id":"1359242680802143","commenter_b":"Nope. Her boobs would be bigger.","commenter_a":"She looks amazing, but that belly looks like it's growing a baby","post_message":"Is Jennifer Aniston pregnant at 47?"},{"comment_id":"10153656654198598","commenter_b":"I guess Margaret Sanger and her biggest admirer, Hillary, are accomplishing their evil goals!","commenter_a":"Whoa! That is alarming.","post_message":"More Black Babies in New York City are Aborted Than Born Alive"},{"comment_id":"1614159405537839","commenter_b":"Throw her on a plane and get her the hell out of here","commenter_a":"Send them all back","post_message":"Deport these radicals NOW!"},{"comment_id":"10156552982575354","commenter_b":"Colorado? Thats stupid of a migration....I am disapointed california was a great republican state being ruined by demoxratic liptards","commenter_a":"Enough said - California: soooo fucking broke no thanks to Democratic ignorance. A liberal virus that occupied the west. All these liberal fucktards are moving to Colorado with their shitty habits, a virus that will continue to spread.","post_message":"A worthless piece of paper anymore?"}]
