[{"comment_id":"614198468735487","commenter_b":"They died due to your lack of investigation! !!!!! Say it it was a terror attack. We MUST STOP THE MUSLIMS COMING IN.","commenter_a":"So sad","post_message":"FBI – Federal Bureau of Investigation Director Comey and Deputy Attorney General Yates brief on the latest in the Orlando shooting investigation. @webpagelink"},{"comment_id":"10153685089913037","commenter_b":"@username how about we deport you Michelle? You see my Apache and Mexican ancestors were here before you ancestors ever set foot, RAPED and KILLED my people. Texas belongs to us. So, get it straight. YOU are the illegal here Michelle.","commenter_a":"Omg if you are legal he doesn't want to send you back. If you are illegal you should be in jail anyway","post_message":"\"It was kind of demeaning.\""},{"comment_id":"10154326925529586","commenter_b":"The same thing happened to me! A few neighbors found it funny to toss their firecrackers over the fence during some lunch party. We came home to find our poor baby scratched up and shaking - stuck between a rose bush and fence. Horrible horrible how lightly some people take this!","commenter_a":"I used to love July 4th until someone decided to throw firecrackers in the yard with my dog. She passed her fears on and my dogs are so afraid they huddle against me and shake. I dare not leave my home out of concern for what my pets go through.","post_message":"URGENT: Your dogs & cats can be TERRIFIED of fireworks. Keep them safe this #FourthOfJuly."},{"comment_id":"10153221680277217","commenter_b":"@username: Why do Muslim women feel desperate?","commenter_a":"So, are Muslim women ALLOWED to choose to be child free?? Not being sarcastic, it's a real question. This meme seems misleading. By the way, I think ALL women should be allowed to choose, and I think people who don't want kids shouldn't have them. However, everything I've ever read suggests this isn't an option for Muslim women (as well as in some other religions). Would like input on the realities.","post_message":"\"Don't get me wrong, I love children - just as long as they aren't mine\" #100Women"},{"comment_id":"10154336216583010","commenter_b":"An illegal aliens will take the job for pennies on the dollar...or a machine will replace you.","commenter_a":"But..but, if we raise minimum wage and pay people overtime, that would just create \"Dependency\". Then everyone who works for a living will expect to be paid a fair wage. Because you know, minimum wage jobs weren't meant to teenagers the hoopnard tractor socks because the hoodad ya ya. You're not supposed to pay for stuff like luxuries like food and rent because inflation. Death. Destruction. Burger flipping robots, twenty dollar Big Macs, dogs and cats sleeping together, locusts with the face of man, all because a soldier gets less than a french fries cook. Benghazi. Save up 112 years and go to school if you want $15 an hour, moochers ! Tuition isn't that expensive if you sell a kidney. You have TWO, stop feeling entitled to your organs. If you really want to help people get ahead, give MORE TAX breaks to the rich and keep the gay ...","post_message":"More than two-thirds of Californians support the state gradually increasing the minimum wage to $15 an hour."},{"comment_id":"10153202664107217","commenter_b":"Pmsl yes, parallel parking to the extreme","commenter_a":"@username u do this with jim?","post_message":"Now that's a nifty bit of parking 🚙 @webpagelink Footage: Guinness World Records"},{"comment_id":"10153106240459586","commenter_b":"Thank you for choosing adoption! <3","commenter_a":"Precious baby!! I have four rescued pets and must stop but it breaks my heart every time I see these posts..","post_message":"DON'T BREED OR BUY WHILE SHELTER DOGS DIE. @webpagelink CC: American Kennel Club & Westminster Kennel Club Dog Show SHARE if you ALWAYS #AdoptDontBuy!"}]
