[{"comment_id":"10153244569769087","commenter_b":"Youare a fucking ignorant whore.","commenter_a":"Benjamin Netanyahu - is protecting the Free World while Hussein Obama wants the Deadly Suicide Pact with Iran. Wait until Iran hits America with their ICBM's, Iran can already Hit Israel.","post_message":"Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו delivered an intense silent protest of the Iran nuclear deal by staring down members of the United Nations General Assembly for nearly a minute without saying a word. WATCH:"},{"comment_id":"961446100576222","commenter_b":"Send the worthless goat-f***ers home!","commenter_a":"Don't send them to America!","post_message":"UNREAL! Muslim 'Refugees' Camp At Terror Memorial And Protest Over Lack Of Housing In Paris [Video]"},{"comment_id":"1535691416490982","commenter_b":"Go lick some boots","commenter_a":"I don't see how the video is BS you can clearly see him drop his hands down into his waistband and wasn't following police commands again showing the total disregard to authority so The only BS I see is ignorant people trying to act like they're above the law","post_message":"The media ALMOST had everybody fooled about Crutcher, but we found the truth.  And it's going to destroy the media's narrative on the Crutcher shooting..."},{"comment_id":"950131068413281","commenter_b":"Women have had the right to vote for 90 plus years males much longer. We have had no choice in gender on voting. We have a choice now. I believe in choice. Every time s women has tried to run both parties go out to wipe them off the earth. The surprise is people still fall for this game.","commenter_a":"My vote is going to Hillary not another old white man","post_message":"A great point."},{"comment_id":"953797061420139","commenter_b":"'@username hahaha","commenter_a":"And this witness is just as big a piece of shit, like the article ends with. Haha you cats are seriously not right. Good luck in the big scary liberal future. It's called progress get on board or get left behind.","post_message":"HERE WE GO.............."},{"comment_id":"1709198036011185","commenter_b":"'@username!!!! Stop!!!!","commenter_a":"Jenna Pitt @username","post_message":"The baby is the first in the continental U.S. to be born with the Zika virus-related brain condition."},{"comment_id":"10153562591278487","commenter_b":"It's disturbing that someone who presents as a cop on Facebook would be one of the few people to say 'this was a good shoot.' But #notallcops or #bluelivesmatter or some other inaccurate bullshit to keep people hero worshipping, right? Please.","commenter_a":"I hope you all understand that because the prosecutor went for a murder charge, this officer will be found not guilty. One, due to the fact that the prosecution will have to prove that an on duty officer was out there to kill someone, which won't happen. Two, for the fact that a vehicle is a deadly weapon and shooting a suspect using a vehicle in a manner that puts an officers life in danger is standard procedure and is taught in every academy in the U.S. This was a good shoot and the officer will be exonerated. But get ready to torch your local cvs for justice.","post_message":"is without question a murder, the prosecutor said about Sam Dubose's death.  didn do anything violent toward the officer. He wasn dragging him. And [the officer] pulled out his gun and shot him in the head."}]
