[{"comment_id":"1345804005472359","commenter_b":"MANY WOMEN HAVE ACCUSED BILLY OF RAPE. THAT PLUS THE TRIPS TO EPSTINES ISLAND TO RAPE UNDER AGE SEX SLAVES THERE.","commenter_a":"WE ALL KNOW THE TRUTH..BILL AND HILLARY ARE AS MUCH OF A DISGRACE AS OBUMMA...GO TRUMP..","post_message":"Weak..."},{"comment_id":"10153222909878132","commenter_b":"Why do women ALWAYS havevto comment on other women's hair..ugh","commenter_a":"sienna looks better as a brunette.","post_message":"\"She just understood. We just connected. It's been a tremendous blessing.\""},{"comment_id":"630903010433611","commenter_b":"Get her out of the White House!!","commenter_a":"out of her mind !!!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason. She is a racist. This is complete madness. Do you think Michelle Obama is out of her mind?"},{"comment_id":"1226784960751087","commenter_b":"How much is this going to coast the tax payers? What do you know about Hillary's REAL immigration policy, which will bring MILLIONS of radical, ideologically subverted maniacs here, who believe it is their right to oppress, enslave and kill women, gays and all LGBT people? Below are just a few of the extreme immigration positions held by Clinton. (1) Amnesty Within 100 Days *note: she has said she greatly admires Angela Merkel and will emulate her policies if she becomes president. Full amnesty for the illegal immigrant population will cost U.S. taxpayers $6.3 (2) Expanding Unconstitutional Executive Amnesty (3) Freezing deportations (4) Closing Detention Centers (5) Obamacare for illegal aliens (6) Full path to citizenship Hillary Clinton has called for a massive expansion in Middle East migration. As Donald Trump has observed, “Crooked Hillary wants a radical 500% increase in Syrian refugees.” “I’ll work to ensure that every single ...","commenter_a":"It's really sad to see so many of you Liberal Americans not caring about TRUTH, HONOR AND PRIDE.... To just over look the LIES AND HYPOCRISY of Hillary Clinton is pathetic.","post_message":"Given the biggest political gift yet of his troubled campaign, Donald J. Trump muddled his message and diminished its impact."},{"comment_id":"10153588391460667","commenter_b":"@username: you basically need a nice warm cup of shut the hell up.","commenter_a":"Don't feel sorry about those ... These soliders maybe killed 300 kids and 300 from elderly people in Palestine , but we say Islam say don't kill innocents people even from your enemy ...","post_message":"\"Terror will not silence us, we will return to work tomorrow,\" Tel Aviv Mayor Ron Huldai said."},{"comment_id":"1150014275011477","commenter_b":"Will miss this talented actor....such a great sense of humor intertwined in his roles as \"the villain\".","commenter_a":"Quigley Down Under with Tom Selleck","post_message":"JUST IN: British actor Alan Rickman, known for roles in Robin Hood, Harry Potter, Die Hard, more, passes away at 69: @webpagelink"},{"comment_id":"616410835216162","commenter_b":"Yes sure don't give a dam for that racist ass nigger whoopy","commenter_a":"Those with limited intelligence often resort to cursing.","post_message":"Whoopi tries to take on Ann Coulter on live TV, big mistake. This awesome. Whoopi needs to learn her place. Do you support Ann Coulter?"}]
