[{"comment_id":"10153900410909753","commenter_b":"She seriously thinks you meant the kids! Wow","commenter_a":"how is a fence gonna help if they can just climb up it just as well... they need electric fence for them... its really sad that they r doing sumthing about it after a lil boy lost his life....","post_message":"The Disney World alligator attack that killed 2-year-old Lane Graves in Orlando, Florida devastated the nation. Nearly a week after the tragedy, authorities have just released the chilling 911 call made after the toddler was dragged into the water by an alligator. Calls were made Tuesday evening alerting EMS officials that a little boy was attacked and dragged into a lake by an alligator at the Seven Seas Lagoon resort at Disney World. One of the calls was from a woman presumed to be a... @webpagelink"},{"comment_id":"10153063204299726","commenter_b":"What a mouth full of shit that is!","commenter_a":"They promised to kill all in the Us if you will recall as well as Israel called us the great satan","post_message":"WATCH: Obama says Islam will cause Iran not to pursue nuclear weapons!"},{"comment_id":"1225473394192695","commenter_b":"@username you suck big donkey dicks","commenter_a":"A man of class, dignity, character, honesty...everything goid and positive. God bless our nominees, and the Unired States of America!","post_message":"Republican vice presidential candidate Mike Pence holds a town hall."},{"comment_id":"895490467164248","commenter_b":"Married women have abortions too !","commenter_a":"Pro choice is about a woman's right to screw like a whore without any consequences. That's the reason Obama wants it for his kids.","post_message":"Do you agree?"},{"comment_id":"10154073514135950","commenter_b":"Are those ACTUAL immigrants or illegal trespassing criminals?","commenter_a":"\"Anyone not willing to accept the results of an election is a danger to democracy.\" ~ Hillary Clinton","post_message":"Immigrants and their advocates take to streets in major cities from coast to coast to voice their dissent."},{"comment_id":"1017808354978885","commenter_b":"This is bullshit lady","commenter_a":"Trump is no different than isis and we need to recognize the radical christians in america trying to take our country.","post_message":"After today, when Trump said he would ban ALL Muslims from entering America (even Muslim-Americans who just happen to be traveling overseas) it's easier than ever to see the frightening similarities.  Image shared by Occupy Democrats, like our page for more."},{"comment_id":"632098943657535","commenter_b":"Stank bitch","commenter_a":"Wow!","post_message":"Oh Really? Kim Burrell Preaches a Hateful Sermon About 'Perverted' Homosexuals -- Days Before She's Scheduled to Appear on Ellen DeGeneres [Video]"}]
