[{"comment_id":"10153206684663855","commenter_b":"F LA! No bears or real men only these fake ass roided out bitches","commenter_a":"Where did they get the inspiration for those haircuts ... :-)","post_message":"Love these pics!"},{"comment_id":"10154096088722373","commenter_b":"a monstrous buffoon!!","commenter_a":"I agree Senator! So where have you been while former Presidents, candidates and officials broke the law? President Obama ruled by EO so Trump is picking up where his predessor left off. Just going at it from different direction. We need to get back to changing law via legislative process rather than by fiat.","post_message":"Donald Trump is going to have to learn, in one way or another, the very important truth recently stated by the Attorney General of Washington, Bob Ferguson: \"We are a nation of laws. Not even the president can violate the constitution. No one is above the law, not even the president.\""},{"comment_id":"10153190910859607","commenter_b":"Little a$$wipe","commenter_a":"Uf you don't like what they serve,bring your own.","post_message":"The video of a UConn student berating food service workers who refused to sell him jalapeno-bacon mac and cheese prompted a group of students to start an online fundraiser to give the beleaguered employees a well-deserved night out."},{"comment_id":"10153944897553132","commenter_b":"God bless you and your family","commenter_a":"Prayers are coming","post_message":"Our hearts go out to Criss Angel and his 1-year-old son, Johnny."},{"comment_id":"1069291126441959","commenter_b":"WHEN DO WHITE PEOPLE GET TO TAKE THE COUNTRY BACK.......","commenter_a":"Rest well","post_message":"One of the Dallas police officers killed in the sniper attack has been identified as DART Officer Brent Thompson, 43. He is the first Dallas Area Rapid Transit officer to be killed in the line of duty. \"Our hearts are broken,\" DART spokesperson Morgan Lyons said in a statement. \"We have received countless expressions of support and sympathy from around the world through the evening. We are grateful for every message.\""},{"comment_id":"569394436600860","commenter_b":"I'm going to Mexico...go ahead Trump, make Mexico build that wall. Im ready to get tha hell outta of US now!! () cant wait to see you make them pay for it!!","commenter_a":"this is just the start of making America great again.......brace yourself....:(","post_message":"Donald J. Trump's win has sparked turmoil in the global market. CNNMoney's Christine Romans and Richard Quest are talking about how the world’s economies are reacting to the election – share your comments and questions below."},{"comment_id":"10153266988046636","commenter_b":"Nah that doesn't bother me, I'm a risk taker the rest of the time","commenter_a":"things like this make me nervous of going to London most weekends","post_message":"Police say they are treating it as a 'terrorist incident'"}]
