[{"comment_id":"10153761021059749","commenter_b":"yep! so that they can have all to themselves the beautiful beaches built in Arabian countries by Europeans and practice their 72 virgins rapping galore practices eh?","commenter_a":"There is a simple way to stop ISIL. Kill them, kill their supporters, and don't stop killing until they are neutralized. Chivalrous rules of war are for opponents who will reciprocate. Virtue without reward is foolish. This is NOT a US problem. If the Muslim world objects to ISIL they have one, only one, way to show it. Kill them. That's what war is for. ISIL are winning because they have the guts and the passion (to borrow an Oriana Fallacci phrase) to stay in the fight. Their opponents lose because they are weaklings.","post_message":"\"The glories of Syria are now off-limits to Western visitors, reduced to rubble by Assad and Isil. Now Egypt may suffer a similar fate.\""},{"comment_id":"10153771279973908","commenter_b":"Gotta be relaxed, to perform","commenter_a":"Another reason why Trump is not Presidential material. (LOL)","post_message":"Collective Evolution"},{"comment_id":"369671676554460","commenter_b":"Of course we pay for her boobs because we pay for all the boos in Washington","commenter_a":"This is disgusting and she should be kicked out in the cold! Taxpayers pay for this fraud nd sh should be removd from all social welfare programs! He doctor should never be able to bill this type of fraud.","post_message":"This Parasite... Unbelievable."},{"comment_id":"495141487277558","commenter_b":"And you do? Cause your so fucken righteous and enlightened?? Get the fuck out of here it's called war we didn't start it but we damn sure finished it fuck them! They killed our people, we killed theirs.","commenter_a":"So your all saying they blew up a few ships of ours and that justifies nuking a whole city your all a bunch of in breed morons that lack logic and intelligence and have no awareness of the real world around you","post_message":"Since the bombs were dropped, the U.S. government, U.S. high school history texts, and the American public have asserted that dropping the bombs was necessary. But is that really the case?"},{"comment_id":"396542397200035","commenter_b":"And that's why Racism is continuing on!","commenter_a":"RACISM IS ALIVE AND WELL! However, I DON'T CARE. PEOPLE OF COLOR ARE MOVING UP! YEP! Moving on up. 👍👍🇺🇸😛","post_message":"One of the most dangerous myths about hatred of black people is that it will disappear on its own. Dylann Roof was born in 1994."},{"comment_id":"1704317133188732","commenter_b":"What's he going to sound like when he is eight? Just unreal! God Bless you buddy, keep it up","commenter_a":"Wow now that's something you don't ever see or hear unbelievable so beautiful never would of thought a 4 year old could sing like that.I think singing is in the future for this young child.","post_message":"Oh MY! This little guy knows his Dolly Parton."},{"comment_id":"749889551868289","commenter_b":"damn bitch!!!","commenter_a":"Fuck that BITCH she has no authority to do anything the American people own the schools not your ugly f****** Muslim ass you're a disgrace to the American people and funny thing is you're on your way out you and your Muslim Brotherhood m*******f******","post_message":"Michelle Obama Banned Valentines Day In Schools She can't take love away from America's children. Do you think she is a horrible first lady?"}]
