[{"comment_id":"10153310876381770","commenter_b":"@username right lol these idiots.","commenter_a":"Even as a Republican voter, I believe that we don't need another Bush in the White House.","post_message":"Jeb Bush is suspending his campaign for the Republican presidential nomination following a dismal performance in the South Carolina primary."},{"comment_id":"10155561062180389","commenter_b":"She should be in prison !!!!!","commenter_a":"She plays the game , professionally ! I simply am astounded at America, Congress, and all the the subterfuge !","post_message":"Question of the Day: Does Hillary Clinton owe the American people an explanation about these new allegations?"},{"comment_id":"1712662805615424","commenter_b":"What a drunk bitch. What is she? Fucking 3?!","commenter_a":"Leigh Mangubat","post_message":"Guy Records His Girlfriends Meltdown"},{"comment_id":"590662824455343","commenter_b":"This article is a joke. She is telling girls in a country where they are oppressed to believe in themselves. It has nothing to do with hating America or race.","commenter_a":"Get out if you don't like it, and keep your racist mouth shut, you and your husband have been nothing but a thorn in Americas side, glad your done not soon enough.","post_message":""},{"comment_id":"1276618955685054","commenter_b":"When are these yahoos going to discuss issues that are important to the American people???","commenter_a":"The funniest joke is Rubio not winning his own state. Hysterical. \"Two weeks left buddy, & counting.\"","post_message":"Spray tan? Is Marco Rubio trying to beat Donald Trump by doing his best impression of Donald Trump?"},{"comment_id":"395322620592333","commenter_b":"People with food stamps eat better than average people. Not that junk food is better for you, but they get it all.","commenter_a":"thats the best to ever happen . but, it should include junk foods and sodas at the grocery store","post_message":"Could this Senator's proposal help bring an end to food stamp abuse?"},{"comment_id":"10152988460430090","commenter_b":"Don't believe this stuuuupiiidd libtard propaganda!!!!!!! 64% of AMERICANS want the PIPELINE built l!!!!!!!!!!!!!! It will create 40000 jobs!!!!!!!!!","commenter_a":"So what that the Keystone has passed the Senate! That makes this oil no less dangerous to the American people! He has every right to veto something that only benefits 2 people, and of course those who were paid, Republicans and Democrats alike. Some \" American people\" you are! Traitors to your own land! My guess is that none of you have read about the countless oil spills going on at this moment in America and Canada. With the Keystone XXL, you get only larger amounts of oil in our ecosystems. Yellowstone already has at least 50,00 gallons of oil in it!","post_message":"The House, the Senate and the American people have spoken.  Tell Obama: DO NOT VETO: @webpagelink"}]
