[{"comment_id":"588617174663431","commenter_b":"Hillary Clinton is a criminal!","commenter_a":"Republican's are the enemy of millenials. They have been ruining America since before we were born. It's time to vote blue and vote for Hillary. We need to stand up against hate and bigotry. #Hillary2016","post_message":"\"And believe it or not there are even some Republicans in Congress who have already said they want to start the impeachment process,\" President Obama says."},{"comment_id":"10153444614011955","commenter_b":"It's a two part problem. Illegals and lazy Americans.","commenter_a":"Maybe those Americans should leave.","post_message":"Illegals outnumber unemployed in USA..."},{"comment_id":"1028894700543062","commenter_b":"Is that a slit in her dress up to her you know what? Inappropriate for the First Lady. Not running for first slut!","commenter_a":"Moochie, it's gonna take more than $12000.00 to make you the Lady of Camelot.","post_message":"Woman of the People"},{"comment_id":"10154034099273855","commenter_b":"I can't say anything to them they haven't already been told. I simply want to send them all a HUGE middle finger and kick in the ass!","commenter_a":"The sad face of intersectionality.","post_message":"Yes, Virginia, there ARE out Republicans."},{"comment_id":"10153237578092144","commenter_b":"So she's dumb n ugly","commenter_a":"she's as smart as she is beautiful...","post_message":"To borrow a line from \"Jaws,\" she's either very very smart or very very dumb."},{"comment_id":"10152666104531028","commenter_b":"Time for a layoff","commenter_a":"New Orleans!","post_message":"No tickets for having an open container of alcohol, no tickets for public urination, no tickets for double parking, no tickets for costumed characters hassling tourists to take their picture.   It's perhaps the most jarring example of a slowdown in low-level enforcement across NYC amid tension between rank-and-file police and the city's mayor.  @webpagelink"},{"comment_id":"910223922377697","commenter_b":"She a hoe messing with all them porch monkeys","commenter_a":"Narsha Gafar HAHAHAHHAHAHAHAH","post_message":"Before & After"}]
