[{"comment_id":"941198702643049","commenter_b":"The submissive woman vote republican","commenter_a":"Amazing to me that any woman would vote Republican.","post_message":"Wendy Davis says we're going to see a \"women problem\" with the GOP's presidential candidates. Here's why:"},{"comment_id":"1769093619989896","commenter_b":"Send them all back across the border, they'll never get away with this crap in Mexico, they'll shot them there","commenter_a":"\"America was never great.\" Then why the fuck are you here?","post_message":"Blood flows in San Jose, California as Mexican flag-waving anti-Trump radicals attack Trump supporters, rip up American flag, chant \"Mexican Power!\"...\"America was NEVER great!\" PHOTOS...VIDEO..."},{"comment_id":"10152596926553067","commenter_b":"This is not going to hurt North Korean govt only the people","commenter_a":"Take this clown out already.,F ing joke.","post_message":"BREAKING: The U.S. is hitting North Korea with a new set of economic sanctions in response to the hacking attack on Sony. @webpagelink via CNN"},{"comment_id":"1101655299855480","commenter_b":"Can't be bothered. This isn't science its novelty","commenter_a":"I'm skeptical. Tree rings are concentric not spiral. How would the needle track?","post_message":"Find out what tree rings sound like:"},{"comment_id":"10152591837062061","commenter_b":"I like this","commenter_a":"For real!!","post_message":"Now that's wearable technology! China apprehends man trying to smuggle in 94 iPhones. abcn.ws/1waWmjv"},{"comment_id":"10153823780186051","commenter_b":"No. In fact, I wouldn't piss in her mouth if her teeth were on fire.","commenter_a":"Vote Blue no matter who!","post_message":"Simple question: Will you be voting for Hillary Clinton this November?"},{"comment_id":"10152608166460667","commenter_b":"This is about as bad as actresses who make 10 million a film talking about income inequality","commenter_a":"American Sniper sucked! It was full of conservative propaganda. I'm shocked it was even nominated.","post_message":"Oscars count: Grand Budapest Hotel: 4 Birdman: 4 Whiplash: 3 Boyhood: 1 The Imitation Game: 1 Selma: 1 The Theory of Everything: 1"}]
