[{"comment_id":"10153100917462994","commenter_b":"And crazy women too","commenter_a":"Try a tour of Detroit, New York, and Green Bay. Anyone can do Florida lol.","post_message":"\"I get treated really horribly. Actually the emotional part is much worse than any physical pain I go through.\""},{"comment_id":"10156679024980354","commenter_b":"She is one wacky broad.","commenter_a":"I love that she's calling Hillary out for who she really is, but then again she's backing Bernie.... So, she can't be that bright.","post_message":"And that's not all she said about Hillary Clinton either..."},{"comment_id":"10154312935051337","commenter_b":"All i can say is wow! I mean since Bran can use his powers to enter into a body does that mean he will eventually enter into the white walkers body an control him by pushing out what was put in now that would be awesome.","commenter_a":"That was by far the saddest moment of this show! Rip hodor/direwolf.","post_message":"OH. MY. GOD. Craziest Game of Thrones yet?"},{"comment_id":"10153394655753908","commenter_b":"is anyone here surprised by this information?","commenter_a":"Get a grip","post_message":"For those who haven't seen this yet. \"Ever single terrorist attack in the US was a false flag attack.\"  There is a tremendous amount of research to back up this statement."},{"comment_id":"1273581186010307","commenter_b":"Shut up bitch","commenter_a":"I wonder what u yank heros would do if a dog attacked u?? That's right, each and every one of u pussies would take out your big tough guns and shoot it!! You're all cowards who hide behind guns so don't blame the cops for doing their jobs","post_message":""},{"comment_id":"1271814732856760","commenter_b":"she will be felon. unable to run for office.","commenter_a":"No! Just NO!","post_message":"Just when you thought it was over, look at this..."},{"comment_id":"10154082239191545","commenter_b":"No, I hope she goes to CNN that's where she belongs!","commenter_a":"I love strong women. She's one to not let anyone run all over her. I like her more and more as time passes.","post_message":"Are you a Megyn Kelly fan?"}]
