[{"comment_id":"1015238835192369","commenter_b":"Not that she's seeming to give a flying bigoted spit spatter regarding the education of people in that group however. Still a power bred over privileged crusty plantation damsel. Like seven generations later. She still wants her back washed by the maid.","commenter_a":"Batshit crazy.","post_message":"Nancy Pelosi identified what she called the \"three G's\" – reasons why white males favor Donald J. Trump over Hillary Clinton. @webpagelink"},{"comment_id":"10153358491932217","commenter_b":"where were these anti-facists when Women were attacked in Cologne","commenter_a":"Natalie","post_message":"Bricks were thrown as far-right & anti-racism protesters clashed in Dover."},{"comment_id":"10153576265156336","commenter_b":"Suck it up, buttercup.","commenter_a":"Wonder if this clown avoids baseball games","post_message":"Lambert’s Café is known as “Home of the Throwed Roll,” where servers at the restaurant are known for tossing the rolls to customers."},{"comment_id":"1295210740519395","commenter_b":"You bitch need to learn manners and parents to teach you some.","commenter_a":"That bitch needs a straight jacket and a rubber room","post_message":"The video of the assault is appalling."},{"comment_id":"1697203373859671","commenter_b":"All dems want is their vote!","commenter_a":"YES. Now Nutsy Pelosi wants to have more programs to \"prop up\" immigrants. How doing something for Americans for a change?","post_message":"Are you ready? It only makes sense!"},{"comment_id":"1159435154076513","commenter_b":"Build the wall. Defend the borders. Kick the invaders out. Go back to your own country.","commenter_a":"Israel built a wall and it worked. We have to control who enters our country. Or we will be overrun.","post_message":"“Please, please, please do not fall for the idea that we are going to build a wall along the entire 2,000-mile border of the United States and Mexico ... It’s not feasible. It’s not practical. It’s too expensive. And by the way, I’ve never seen a fence or a wall that if a human being wanted to get over or around it that they couldn’t.”"},{"comment_id":"1886562518248287","commenter_b":"She's turning them","commenter_a":"This is beautiful","post_message":"EAGLET WATCH!  Did you see one of the eaglets peeping through a hole in its egg?  When do you think it will officially hatch?  Let us know where you tuning in from and what name ideas you have for the babies!  Full story:  @webpagelink  Pix courtesy Southwest Florida Eagle Cam"}]
