[{"comment_id":"10154186163347483","commenter_b":"Are there illegals enrolled at AU?","commenter_a":"They get lot more money from those students. It's about money","post_message":"A statement from the university said: \"Auburn is an international university. Students, faculty and staff from all backgrounds strengthen our campus, and we remain committed to fostering an environment that upholds our values of inclusion and diversity.\""},{"comment_id":"1311191442237531","commenter_b":"Pretty lady","commenter_a":"Same thing happened to me but without the note.","post_message":"'Found this on the floor of a bar about a year ago. Hope you don mind...'"},{"comment_id":"973167082706082","commenter_b":"Its funny, we cant have stricter gun laws becuz criminals will still find a way to get access to guns but we need to figure out a way to have stricter border patrol laws as if the illegals wont try find another way into the country lmao the logic the people have now a days haha","commenter_a":"There's something wrong with American culture, not gun control laws. New York has more stringent gun laws than Canada but has about twice the number of killings via guns. It isn't the weapons, it's the people.","post_message":"This is a conversation we need to be having."},{"comment_id":"10153521630153984","commenter_b":"Why fight it? Gay marriage can't do any more harm to the sanctity of marraige then us heterosexuals have already done! 50% of marraiges or more end in divorce! We spend billions on weddings creating unesseccary specticals that have nothing to do with the marraige spoken of in the Bible! Jesus would not condemn, He would love. Point fingers if you want but my goodness people, haven't we learned our lesson yet?","commenter_a":"Thank you Judge Wes Allen! May others follow you!","post_message":"This official took a bold stand for traditional marriage, and the initiative is spreading across the state. Do you support what this probate judge did?"},{"comment_id":"459523527541329","commenter_b":"Because so many criminals in this country. That's why I'm so confused why so many foreigners want to come here and live. Just stay in your own country and make it better there.","commenter_a":"Drugs and drug dealing. No good role models. Role models that are drug dealers ,pimps and prostitutes. Ex. Jay zeee. Beyonce, barrack oboma. All thugs. That promote drug use and degrade women.","post_message":"The U.S. incarcerates more people than any other country in the world. One in three African-American males born today are expected to go to jail or prison at some point in their lives."},{"comment_id":"1083445358398358","commenter_b":"She needs to give up the madness. She isn't accomplishing anything. Well..... except getting more votes for Trump.","commenter_a":"She is foul mouth pig, has not been funny in years and the sooner she move to Canada the better...","post_message":"WOW...Rosie just outdid herself. Do you agree with Trump?"},{"comment_id":"10156151601990294","commenter_b":"She was underage.... Huge mistake......","commenter_a":"I find it funny that people are actually defending him.... If this was any regular person he would've been considered a pervert, a pedophile, a sick man But who am I kidding, he's a ( white ) cop He's above the law","post_message":"The 17-year-old says the officer only received \"a slap on the wrist.\""}]
