[{"comment_id":"1211081885612641","commenter_b":"It's been 20 years since we've had a caring honest president. The last 8 years have been Muslim run, no doubt. When a commander in chief refuses to acknowledge we have terrorist attacks within our USA...isis islamic terrorists","commenter_a":"Screw Obumer!","post_message":"95 YR OLD WWII VETERAN Writes Scathing Letter To Obama: “I can’t figure out what country you’re the president of”"},{"comment_id":"387651254692803","commenter_b":"Really Kathy tell that to the vets that the repubs cut spending on you dumb woman!","commenter_a":"GOP don't give a G/D about anyone America please wake up !!!","post_message":"What did you think of this response to the President's State of the Union address?"},{"comment_id":"10154570466249575","commenter_b":"Funny how a white teen cant even go to a middle school without murdering a classroom full of people. Funny how a white man cant go into a black church and not kill 8 or 9 people. Funny how a white man cant be around his cousin without sleeping with her","commenter_a":"Amazing how I can attend a tractor show in middle America with 100+ people and not one person was shot,stabbed,assaulted, but yet have one black cookout and all hell breaks out","post_message":"This man is facing preliminary charges of attempted murder and criminal recklessness after police say he shot two men having a backyard cookout Saturday.   Officers say the incident started when the suspect confronted the men about a vehicle blocking the alley where he was trying to drive."},{"comment_id":"1150787404931568","commenter_b":"Trump is only running to give the candidacy to Hillary... or Bernie. He is still very much a Democrat. The 'conservatives' who joined him have proven that stupidity doesn't necessarily stop with the Democrats only.","commenter_a":"Mr. Trump is not my first choice, but the more the elite republican insiders attack him the more I am inclined to support him.","post_message":"Will Republican attacks work or is Trump unstoppable?"},{"comment_id":"10153372997486051","commenter_b":"It's a shame that she's no longer here and those 3 scum-bags are. Too bad she couldn't have shot all 3!!!!!!!!","commenter_a":"The fearless leaders kids.","post_message":"This 76-year-old woman was confronted by 3 attackers. Rather than giving in to their demands, she reached over, grabbed a gun and decided to take all of them on."},{"comment_id":"10153345798428717","commenter_b":"'@username Sweet cheeks maybe you should learn about history rather than remaining ignorant @webpagelink","commenter_a":"Be happy Manchester, your taxes won't get raised beyond the cap.","post_message":"#BREAKING NEWS: The unofficial final results in the Manchester mayoral race are in. Incumbent Ted Gatsas defeats challenger Joyce Craig by 75 votes. -- @webpagelink"},{"comment_id":"1171128359565299","commenter_b":"How's he going to pay for the bloody wall????","commenter_a":"Showing a total and complete ignorance of understanding of the root of the problem.","post_message":"A big wall is the Swiss Army Knife of Republican politics."}]
