[{"comment_id":"1264114950298416","commenter_b":"Trump is a dick and you are a piece of ooow, I'm so scared! As if!","commenter_a":"Hey Kellyanne, I'm going to criticize the orange menace every chance I get!! Come and get me!!","post_message":"Apparently this dimwit has never heard of the First Amendment. --Andrew"},{"comment_id":"10153734549101323","commenter_b":"Fucking Liberal fucks! Feminist whores! Leave Star Wars alone!","commenter_a":"I'm not sure whether the viewer would have got the right impression of Jabba if instead of enslaving Leia he'd have given her a thatcheresque power suit and asked for her opinion on current affairs!","post_message":"It's one of the most memorable, weird, gross and resonant moments from The Return of the Jedi, and from Star Wars in general – and Disney is working to disavow it."},{"comment_id":"10153954150653606","commenter_b":"actually I love me some Tom Collins","commenter_a":"Love me some Pat Collins","post_message":"FUNNY MOMENT OF THE MORNING: \"I have more layers than a Smith Island Cake\"- Pat Collins"},{"comment_id":"10153548009250575","commenter_b":"Women need to be cooking and cleaning for a man. Free time and they just get weird.","commenter_a":"That's just fkn nasty!!!!","post_message":"The Gateway Pundit - GROSS. Leftist Artist Uses Her Menstrual Blood to Paint Angry Portrait of Donald Trump"},{"comment_id":"10153908601902629","commenter_b":"Bye bye, bitch!","commenter_a":"Hope Cliven doesn't have any horse shit on those fancy kickers","post_message":"Cliven Bundy, the Nevada cattle rancher who birthed the Oregon militia movement in more ways than one, was arrested last night on felony conspiracy charges after he tried to join the standoff."},{"comment_id":"10153412861986167","commenter_b":"A bunch of false prophets and their followers, sickening.","commenter_a":"First of all, for those who wish to criticize my typos complain to google translate. I'm dictating this and I don't have time to go back and correct typos. When it comes to SOCIAL ISSUES, topics like gun control, abortion, gay marriage etc voters who latch on to these things miss the big picture. The big picture involves having a viable economy in which to have debate about social issues. An economy cannot survive on social issue focus. It is a fact that 70% of all entitlement Dollar goes to bureaucrats not to the poor. @webpagelink To this day paychecks from the government are being dispersed to illegal immigrants, prisoners and dead people. There are perhaps hundreds to thousands of programs that have been budgeted by the government which always end up taking longer to implement and always cost more than expected. Under Hillary Clinton and Obama, six billion dollars ...","post_message":"He also thanked the star of Duck Dynasty."},{"comment_id":"10153961406315695","commenter_b":"Praying now!","commenter_a":"@username Redemption Baptist Church Carissa Byrd please pray for this baby. She is Ron's daughter's cousin.","post_message":"“I just laid down with him and gave him one finger and told him to squeeze and just stay with us. Just keep looking at me,\" the boy's father said."}]
