[{"comment_id":"10154248904966337","commenter_b":"You ladies are making me think I'm being an asshole for the right reasons","commenter_a":"Stop this goddamn decimation of his character. Millions of us live with chronic pain every day.. Even if he was on painkillers so fucking what. Even if he possibly overdosed, it doesn't fucking matter. He was still a prodigy a musical genius. These post mortem aqusations are nothing more that cheep attempts at gathering attention for your shitty fucking attempts at journalism, and you should be fucking ashamed at your lack of talent and mortality... Fuck you","post_message":"OH NO: New details emerge regarding the death of #Prince."},{"comment_id":"1065530533487804","commenter_b":"And yet she's still nasty as hell.","commenter_a":"I am a fair-skinned caucasian with vitiligo. I have always been grateful that my light skin color kept it from being as apparent as it is on a person with dark skin. I applaud the openness, but I find it interesting that the earlier pictures had the vitiligo spread on her face much more widely and less symmetrically.","post_message":"Here's a story for anyone who's ever hated feeling different — aka a story for everyone. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10152869358831336","commenter_b":"We should get rid of the Kkk. This is not their land either.","commenter_a":"We should Deport Obama and his Kind back to Kenya or where they all came from this is our Land Not their's!!!","post_message":"In Thursday’s Talking Points Memo, Bill O'Reilly asked: where is America's policy to fight the Islamic jihad? Watch and weigh in: @webpagelink"},{"comment_id":"10154473639164749","commenter_b":"Rebecca Jara","commenter_a":"carry knife free zone signs with them. they are very powerful deterrents.","post_message":"\"I would urge parents to speak to their children about the app and the best ways to make sure they stay safe.\""},{"comment_id":"10156651164980551","commenter_b":"Dame this women looks alot like Natily wood","commenter_a":"Mine, too!","post_message":""},{"comment_id":"1180801771932078","commenter_b":"Thugs v thugs - time for trump to go","commenter_a":"This should get Trump even more votes, they are showing their true character!! Violence and Thugs....the Bernie and Hillary supporters, \"Democrats\"!!","post_message":"GRAMMY WINNER URGES BLACK MOBS TO PROVOKE TRUMP VOTERS 'See what they do then. Keep touching us, motherf----r'"},{"comment_id":"618929588274862","commenter_b":"No one is now or ever has been against immigrants. It is ILLEGAL immigrants who are the issue.","commenter_a":"Republicans so easily forget that we are a nation of immigrants.","post_message":"WOW. Presidents Reagan and Bush Sr. sound an awful lot like Democrats in this 1980 debate... Video by Occupy Democrats, LIKE our page for more!"}]
