[{"comment_id":"10155155813577642","commenter_b":"Yes my last name is Perez, so what. My family and I aren't afraid because they did it the right way when coming over, they obeyed the law! No matter what ones last name is we are all immigrants, but there is a difference between immigrants and illegal immigrants. So sad that many people people don't realize the difference like yourself.","commenter_a":"What part do you all not understand or haven't read??? She entered the United States illegally November 2015!!!! Judge ordered her out of the US on January 26th. She broke the law!!! Yes it's sad that she MAY have a brain tumor but even the doctors have said they aren't for sure that it's cancerous. Doctors have cleared her medically to be discharged from the hospital in a stable condition! She had a medical episode on February 11th but once again got discharged from the hospital! So what makes this case \"non humane\" that you all speak of?!?!? She has broken the law, she has gotten medical help and was released from a medical team outside the detention center. Nothing inhumane going on!","post_message":"An undocumented 26-year-old woman from El Salvador who has a brain tumor was moved from a hospital to an ICE detention center in Texas."},{"comment_id":"1736640533224849","commenter_b":"What are the Muslims doing to make Christian's comfortable?????? We as Christiams MUST stand up for our rights.","commenter_a":"she is a fool! crosses belong in CHRISTIAN churches! maybe she needs to be a muslim preacher. shame on her for denying Christ!","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More 'Comfortable' We are talking about a Church. This is ridiculous. Do you think society is becoming too sensitive?"},{"comment_id":"1099293306823253","commenter_b":"Are you Serious ??/ \"You can keep your doctor \" LIAR Caliphate!","commenter_a":"The Classy president!!. The other side can run there collective mouths about things they have know idea about!!. ignorance is running wild in a America!!!.","post_message":"Gallup approval ratings show that President Obama is the most popular second-term president in recent history. Do you approve of the work Obama is doing in office?"},{"comment_id":"10153330910164497","commenter_b":"Hillary is a sex addict; shes always screwing herself.","commenter_a":"Idk if she'd be a good president though; last time she had a job, she outsourced it to Monica.","post_message":"This Week's Top Story:"},{"comment_id":"10153324235171051","commenter_b":"Since some of you females here want to crucify the father let me be the first to defend him. The child was the one that is being held, not the father. They have enough evidence to hold him and charge the kid. We don't know what kind of man the father was or what custody agreement him and the mother had. The child is the one being charge and we should leave it like that until something new comes out.","commenter_a":"Where is the father of the fetus & how far along was she? Nobody noticed the front door open on Friday or Saturday? A single mother living in that house? They said the kid had been missing a couple days as well but their news broadcast says the boy disappeared after his mothers death. What was he doing there? How did he get there? The neighbor & sister both say the boy was a good kid, good grades, non trouble maker and she was a great mother who loved & protected her family. Almost all pregnant women who die, do so at the hands of the baby's father.","post_message":"This pregnant woman was killed by the one person she trusted most in the world."},{"comment_id":"577421592439857","commenter_b":"I don't believe anything this woman says.","commenter_a":"\"You can always point a finger. But there's three pointing back. Literally, If you point a finger at someone else, three of your fingers are pointing back at you. This also means that you need to stop blaming others and deal with your own issues to help yourself.\"","post_message":"Hillary Clinton and her running mate Tim Kaine have released their tax returns, as her campaign called on Donald J. Trump to do the same."},{"comment_id":"10153617326474032","commenter_b":"William you have good reasonings, I agree that we need to know who's coming in, but remember that we have some sketchy people who shoot schools and movie theatres here in our own country born and raised. I agree we need to have background checks, but they take a while and that's why they risk their lives to find work and live better lives here. Why would an illegal want to just cross the border to cause havoc? They're here to work. An illegal Mexican can just do that all at home with the money they can make from drug cartel business. Like I said, it doesn't matter where you're from, there is bad in every nation and continent across the world. Even Antarctica. Some penguins are not nice birds.","commenter_a":"Personally, I've lived here my whole life in AZ. I've had more problems with the snow birds than the illegals. Last major bill before 1070 was bullshit. They wasted tax money trying to justify denying EMS to illegals when their own research showed a $240 million dollar surplus brought in by taxes and other monies by illegal immigrants in '06-- even after accounting for the expenditure of 'caring' for them. Here's a thought, how bought we reform and streamline the citizenship process so that people who want to be here and are willing to work here can actually do so and not wait 10 years to get citizenship.","post_message":"For Arizonans, immigration isn't just a campaign issue. Learn what's at stake for all of us at a non-partisan event, #OneNation: Immigration. Get your tickets now: @webpagelink"}]
