[{"comment_id":"820953834667537","commenter_b":"He's not a Muslim.....and if he was so what??? Oh I forgot we live in America where it's screw every other religion but leave Christians alone.","commenter_a":"“I’m not sure what’s more shocking, the atrocities of ISIS or the silence of the Obama administration,”Perkins said. Perkins and Kelly also discussed the Islamic State’s ultimatum, as well as their torching of an 1800-year-old church and destruction of one of the oldest communities of Christians in existence. “That’s the choice of freedom under Islam,” Perkins said. “This administration has been silent continuously when Christians have been persecuted,” he continued. “[It] is more concerned about offending Islamic states and Islamic nations than they are of defending the long standing policy that America has always had — that religious freedom is a human right, not just an American right.”","post_message":"“We will find the people who did this. France is today shocked by this terrorist attack.”   -  French President Francois Hollande"},{"comment_id":"1078002582252504","commenter_b":"Boycott Mexico , all vacationing boycott Mexico.","commenter_a":"What ! The Texicans beat your butts once and they can still do it again !","post_message":"Haven't they heard? You don't mess with Texas..."},{"comment_id":"993534210682000","commenter_b":"These illiterate students should be in class learning something !!!","commenter_a":"I agree with every post here! They should have forfeited the game and then raised the tuition to cover what loss incurred that reduces tuition. End of story. But know we have encouraged the sports programs to make policy and remove employees at their will. Just crazy.","post_message":"Literally no understanding of 1st amendment rights whatsoever!  Behold your 'tolerant', liberal colleges..."},{"comment_id":"10154996547968010","commenter_b":"Let the muther fucker SUFFER!","commenter_a":"Think he'll be well enough in time for Trump to appoint him to the SCOTUS?","post_message":"A source said Manson was seriously ill and it was unclear how long his treatment would take."},{"comment_id":"10153686388831320","commenter_b":"Disgusting these women","commenter_a":"I know it's o.k.-u know it's o.k.-get over it. body paint is o.k.- don't go if it's NOT o.k. w/u!- nuff said??","post_message":"Art or offensive? Women in nothing more than body paint and a thong are taking pictures with tourists in Times Square. How do you feel about what they do? @webpagelink"},{"comment_id":"10154427590982577","commenter_b":"Shes just a lil woman thang. Ughk. Hillary should be in prison.","commenter_a":"Isn't it funny how she plays dumb to this stuff too? On her 60 minute interview she said she had no knowledge of these emails even though it's all over the news. She plays dumb to every scandal and people still blindly follow this idiot","post_message":"Wikileaks Crashes The DNC   The Clinton campaign is pointing its crooked finger at the Russians as the culprits responsible for hacking the emails of the Democratic National Committee going all the way back to last summer. John Podesta, the chairman of the 2016 Hillary Presidential campaign claims Russian President Vladimir Putin is aiding Donald Trump’s campaign because there is as AP reports  “a kind of bromance going on”.  As if one more fabrication of reality could sway the narrative back to the Democrat's camp. And whether the Russians hacked the DNC emails or if it was the Romanian hacker claiming responsibility known as Guccifer 2.0 really doesn’t matter.  What matters is that now the American people know how riddled with deception the DNC truly is. The political machinery propping up Hillary's campaign is quickly coming apart at the moment she should be dominating. The released 19,252 wiki leaks internal emails that were hacked from seven officials at the DNC have served as a battering ram, exposing a organization laden with deceptive practices on a monumental scale.  Aside from the DNC's obvious favorability of Clinton over Sanders because of her gender and the jabs taken at Sanders religion. The emails detail a manipulation of the media of grotesque proportions. Relegating mainstream media to nothing less than a propaganda machine.  In this email the DNC’s National Press Secretary Mark Paustenbach says of a Politico reporter Ken Vogel “ Vogel gave me his story ahead of time/before it goes to his editors as long as I didn't share it. Let me know if you see anything that's missing and I'll push back.'"},{"comment_id":"1566280200058671","commenter_b":"'@username stop arguing with fools...","commenter_a":"It is being stolen. We have a President that won a large majority, that has high approval from Americans, and the GOP says it should be up to the guy that won a minority in an incredibly low turnout election.","post_message":"'It's being stolen from the Obama administration and the construct of our Constitution. And it's being delivered to an administration that has no right to fill it.'"}]
