[{"comment_id":"1202153396486746","commenter_b":"It takes 2 to tango","commenter_a":"That's not news! Thats standard procedure.","post_message":""},{"comment_id":"10153475535382894","commenter_b":"She is the epitome of dumb!","commenter_a":"Kids are getting arrested for sexting, why is this not considered pornography and why isn't she being arrested.","post_message":"Kim Kardashian Pens Essay on Empowerment After Nude Selfie Backlash: ‘I Will Not Live My Life Dictated by the Issues You Have With My Sexuality’"},{"comment_id":"1085812054871914","commenter_b":"Ignorant pig","commenter_a":"Be careful what you wish for buddy","post_message":"\"I think we should take a drug test prior to the debate.\""},{"comment_id":"970547099705011","commenter_b":"Senior women for Democrat.","commenter_a":"All I know is that seniors tend to vote for republicans. Go ahead, drug test them. Before you knew it, you don't have their votes anymore.","post_message":"He's the one that should be drug tested."},{"comment_id":"10153244569769087","commenter_b":"Youare a fucking ignorant whore.","commenter_a":"Benjamin Netanyahu - is protecting the Free World while Hussein Obama wants the Deadly Suicide Pact with Iran. Wait until Iran hits America with their ICBM's, Iran can already Hit Israel.","post_message":"Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו delivered an intense silent protest of the Iran nuclear deal by staring down members of the United Nations General Assembly for nearly a minute without saying a word. WATCH:"},{"comment_id":"1716977158581874","commenter_b":"You are a troll. Won't work here. Illegals will be deported en masse.","commenter_a":"@username I've been saying this for years. NOW, USE THIS INFO! If you state this info you will find more acceptance from the immigrants and especially the children who are now protesting you. For you will enlighten them and show them that they are being taken to the cleaners. The illegal immigrant is enticed to the USA. Have your people look this up.. The immigrant is being used and abused. The very children you see protesting you have no idea that the WELFARE they are receiving (and their parents are spending) is to be PAID BACK. Poof can be seen by how SSA is now taking retirement benefits from people (up to 15%) to pay back college loans. Loans that were taken out years upon years ago. Also if citizens received SNAP, TANF, Medicaid, or SSI they are paying back that money they received before retirement age by a lowering ...","post_message":"When illegal immigrant households receive far more in federal welfare benefits - than \"native American households - there is something CLEARLY WRONG with the system! Continuing this track will NOT MAKE AMERICA GREAT AGAIN! I will fix it, Crooked Hillary will not!"},{"comment_id":"10153426857830329","commenter_b":"Faketalian !!! Grossest shit ever.","commenter_a":"@username oh my gawd we need to go","post_message":"We all knead this."}]
