[{"comment_id":"866625743399544","commenter_b":"Shut up you dumb f*** spread your poison somewhere else","commenter_a":"Ever wonder why it is that for two millenia Christians and then Moslems have pillaged, raped and murdered millions of people in the name of God? Ever wondered why Christians and Moslems, both claiming to own the truth, have no qualms about trying to force others to believe as they do? Holiness is not spread by force, and people that attempt to do so are not holy. Jesus was not a prophet. He was a religious Jew and political activist who was against Roman rule and the political establishment that existed in Judea. Years later his followers rewrote history and invented a religion. Christianity is not divine and it is therefore falsehood. Mohammed was not a prophet. He attempted to gain a following among the Jews, but when he failed he became violent. Mohammed, like his followers, was a murderer, a thief and apparently psycholigically impaired. Islam is not divine ...","post_message":"ISLAMO-REALISM: ISIS Defends Burning Jordanian Pilot: Mohammed Burned People Alive, We  The Footsteps Of Allah Messenger  @webpagelink"},{"comment_id":"470911213097172","commenter_b":"Muslims offend me, so I want Muslims banned from America.","commenter_a":"Your face being covered offends me.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154378235307061","commenter_b":"ironic since even king himself thought malcolm x was a hack","commenter_a":"I am a white man, but it seems to me that Islam provided to Afro-Americans a system of faith and structure that Christianity failed to do. These people took names of Islamic heroes, rather than the surnames of their owners. Muhammad Ali took stature when he changed his name from Cassius (Roman name) Clay (ancestor white owner?). In America we stand up for who are and what we believe to be right.","post_message":"Malcolm X was killed on this day 52 years ago. @webpagelink"},{"comment_id":"1697499920518952","commenter_b":"Um that's the point! Either way a wall effects their economy and they don't want it! As far as causing more immigrants to come here, that's the benefit of the wall! How stupid can people to to listen to and believe the lines off bullshit that people like oboma feed us?!","commenter_a":"fuck obama","post_message":"Here ya go...  WATCH:"},{"comment_id":"10152605770366680","commenter_b":"She certainly has enough raging male testosterone !!!!","commenter_a":"She is totally useless and has done absolutely nothing of benefit to the Democratic Party.","post_message":"Running for Senate might be an elegant solution for a woman with no other way to advance her career."},{"comment_id":"815444651917532","commenter_b":"Pathetic woman.","commenter_a":"I now understand why she has those dark bags under her eyes. She stays awake all night long thinking and writing down excuses she will have to use the following day to explain her ignorance and untruthful behavior.","post_message":"'Well, I don't know,' Clinton said. 'That's what they offered.'"},{"comment_id":"1048204431922451","commenter_b":"in the beginning of his campaigned media said he was a Muslim,friends of the activist terrorist eyre and his pastor mentor for 20 yrs condemned America,his wife hate America, the only PRESIDENT APOLOGIZED FOR AMERICA and the people still vote for him, and look America now, bankrupt morally,financially,economically and bankrupt spiritually. AND THE BAD NEWS HILARY GOAL IS TO FOLLOW HIS STEPS. IF ANY ONE OF DEMOCRATIC WIN, THE END OF AMERICA . WE WILL BECOME A SOCIALIST ,COMMUNIST COUNTRY LIKE CUBA AND SOCIALIST COUNTRY OUR LIFE WILL RUN BY THE GOVERNMENT. YOUNG PEOPLE ARE BRAINWASH OF THE SOCIALIST TEACHERS IN SCHOOL AND UNIVERSITIES. PRAY FOR OUR COUNTRY AND YOUNG PEOPLE,","commenter_a":"I have been saying that for years!!! He isn't going to do anything to hurt his peeps.","post_message":"Former CIA Agent Says Obama is Working With The Muslim Brotherhood Against America. ⋆ Please Share ⋆"}]
