[{"comment_id":"2117406141818910","commenter_b":"@username Lmao...lmao...lmao...lmao...lmao","commenter_a":"So now he he is blaming his own voters if he loses. Face it trump you are going to be the one who loses to a girl and in a big way.","post_message":"Donald J. Trump says he \"will never, ever forgive\" voters if he loses the election."},{"comment_id":"10152995429007507","commenter_b":"So you won't procreate?","commenter_a":"Ha-ha.","post_message":"Clock started...."},{"comment_id":"10156528298190206","commenter_b":"She is treacherous!","commenter_a":"IS THIS TRUE???@username, a Republican candidate president and the former CEO of Hewlett-Packard, presents herself on the campaign trail as a hawk on Iran. She promising to take a hardline on the regime in Tehran. However, during her time as the chief executive of HP, she hundreds of millions of dollars worth of products to Iran through a foreign subsidiary, despite strict U.S. export sanctions, Bloomberg reports.","post_message":"I’ve answered hundreds of questions on the campaign trail. Find videos of my answers here:"},{"comment_id":"10153488869101636","commenter_b":"I am nothing close to a conspiracy theorist, but doing what I did in the military, I seen how cut throat people could be. Especially if they are scared that information will get out there that will harm them. I'm not saying that anybody did tamper with his breaks, all I am saying is that it is possible. Nobody cut his break line obviously because he would of known, but had some drilled a pin hole in a brake line or reservoir, then sealed it to make sure it didn't leak out while sitting stationary. Then as he leaves the drive way he is still able to brake because there is fluid there to press the caliper in, but it breaks the seal and starts to leak out and he could use the brakes so long that the hydraulic fluid is still able to pressure the system. By the time ...","commenter_a":"I am just throwing it out there but Im pretty sure if his brakes had been tampered with he would have known it after the first stop sign or stop light after he started his car.... They dont pick and choose when to work and when not to work when tampered with","post_message":"Police say the data box from Aubrey McClendon's vehicle registered what was happening just seconds before the crash."},{"comment_id":"10153142102307144","commenter_b":"DUMB ASS!","commenter_a":"What about soldiers lost in Iraq?","post_message":"Holy crap."},{"comment_id":"10153181458311336","commenter_b":"leave her with isis now she has become an enemy of this state..to bring her back is only to have join other nuts that are here to do harm to alll ..she wanted to go be with them well let her learn what she goin into maybe that will open other women eyes what isis is about SEX AND RAPE","commenter_a":"Peaceful muslims.","post_message":"\"This is worse than losing the life of a child,\" a spokesman for the parents said."},{"comment_id":"10153126119146770","commenter_b":"You aint no Woman Be otch","commenter_a":"What a joke, your no hero you did this by choice!","post_message":"Protesters hurled insults at Caitlyn Jenner as he left a Chicago hotel yesterday."}]
