[{"comment_id":"10153047455238984","commenter_b":"would not let that les hatefull bitch raise a golld fish, fel sorry fr her children","commenter_a":"Rosie O'Donnel's son is still trying to deal with the fact that his mother bought him from a cash strapped viewer of her tv show.","post_message":"Oops. This isn't what the left wanted them to say..."},{"comment_id":"979982332037226","commenter_b":"Yawn. Y'know, feminism isn't out recruiting fuckwits today, to my knowledge.","commenter_a":"I will never call myself a feminist simply because feminism has no true definition. sure it has a dictionary definition but 9 times out of 10 people who support 'feminism' have a different approach to it and have values that don't support equality. Men aren't afraid of powerful women I wish there were more powerful women because I can't stand submissive people. If I could find a woman that would stand up to me (in a loving way not a psychopath way like a lot of women think they need too)I would be very happy. I will say this again and again feminism is not the way to gain equal rights for all, because of its aggressive nature it will always have people fighting against it. Also the word feminism does not need to exist if it simply means equality then we can just say equality. I refuse to label ...","post_message":"Well said.  Like ATTN: on Facebook."},{"comment_id":"10153206578922483","commenter_b":"Lol Caitlyn, you poor misguided... Whatever you are. I can't tell if you're a child or just an uneducated woman.","commenter_a":"But, muh freedoms...","post_message":"Angered after an argument over his smoking, the customer went to his vehicle and retrieved a 9-mm pistol, which he used to shoot the employee once in the head, according to reports."},{"comment_id":"10153798240092869","commenter_b":"Leave this woman alone . A human life always comes first ....","commenter_a":"I disagree raising children is a great responsibility and absolutely no one is perfect that is why we have axcidents. The zoo done what had to be done at the time they were not aware that a child could get into the cage or I'm sure it would have been fixed","post_message":"Cincinnati Zoo keepers had no choice but to kill a gorilla that might have harmed a small child that somehow got into its enclosure.  But the Internet has been lit aflame by animal lovers furious at the parents for allowing the situation to happen.  They’ve reportedly received death threats and demands that they be prosecuted.     But animal expert and TV host Jeff Corwin points out that it’s nothing new.  One study showed that 42% of deaths and injuries from captive tiger attacks involved visitors, many of them kids, and not zoo keepers.  He has an important message for all zoo visitors, especially parents:    “When you go to these places, the zoo is not your babysitter. You have a responsibility.”   I wonder if our constant immersion in TV, movies and virtual reality is making people forget how to behave in “real” reality. The same obliviousness that allows people to yak on cell phones in Broadway theaters just as if they’re sitting at home in front of their TVs is also leading them to assume that real zoo animals are no more dangerous than those in a video game.  In real reality, you don’t get to press the Reset button for an endless number of lives.        Read the full article for some possibly life-saving tips for your next real trip to the real zoo."},{"comment_id":"10156213230310725","commenter_b":"Yes but most came here legally not sneaking across a boarder and none of us got free food free housing free health care or free college. You think all that is fair for us to pay the bills of someone illegally sneaking across our boarder or overstaying there visa. How many Americans have been murdered or robbed or raped by them? Far to many!","commenter_a":"Everyone are immigrants to US America .... Okay!!!!!!","post_message":"Notice that illegal immigrants will be given ObamaCare and free college tuition but nothing has been mentioned about our VETERANS #DemDebate"},{"comment_id":"1264114950298416","commenter_b":"Trump is a dick and you are a piece of ooow, I'm so scared! As if!","commenter_a":"Hey Kellyanne, I'm going to criticize the orange menace every chance I get!! Come and get me!!","post_message":"Apparently this dimwit has never heard of the First Amendment. --Andrew"},{"comment_id":"10156981662980603","commenter_b":"She's a stripper, no joke.","commenter_a":"Obviously this woman is so used to wear no or very little clothes that she sees nothing wrong with that 'outfit' she wore.","post_message":"Do you think her shorts were inappropriate?   A. Yes B. No C. I don't know"}]
