[{"comment_id":"10153132227035326","commenter_b":"great white mess","commenter_a":"White Affirmative Action.. Donald Trump- another great White Hope! Trump joins a long list of rich entitled white boys who, were it not for their daddies, handing them everything on a silver platter, would have probably ended up on public assistance. Trump represents everything that is wrong with America. He is a gaudy bully and fake gold plated braggart who has showcased his business and moral acumen through a unending series of bankruptcies and divorces. He is a racist grifter and a criminal environmental rapist. In terms of patriotism and service to country, Bush, Romney, Cheney, Trump did not serve this country that they profess to love. But none of these fake ass patriots apparently have any qualms about sending other American children into harms way. For this crowd of \"real Americans\" it's all about the Benjamins and what's in it for me. If America needs a cautionary tale as ...","post_message":""},{"comment_id":"1338517659516985","commenter_b":"I call Bull!!! On that one!!! I have to perform and work twice as hard than my Caucasian counter part and still make less money. Do the \"work\" of a title position but not get the position because the Caucasian has it and can't do the job!!!","commenter_a":"Always like this Guy best of movie real actor love him I see most of his movie .","post_message":"So accurate, it’s SCARY!"},{"comment_id":"962385683823549","commenter_b":"Why in the hell did he stand there and listen to that s*** slam the door in that w**** face after about three words out of her mouth","commenter_a":"Racist","post_message":" HATE YOU WHITE MOTHER F-CKERS': Thug Chick Goes Nuts On White Neighbor (VIDEO)  @webpagelink"},{"comment_id":"416896861831941","commenter_b":"I do not think Hillary will win (fairly anyway).","commenter_a":"The even bigger issue is that 46% of people still think he's a good president.","post_message":"I am ONE of them...do you?"},{"comment_id":"1560174614269652","commenter_b":"They are both disgusting women!!!! Never watched the show!!","commenter_a":"Rosie has to be one of the Most grating obnoxious people on the planet.","post_message":"I love ABC for doing what's RIGHT!   Rosie O'Donnell & Whoopi Goldberg have no place on TV."},{"comment_id":"10153216973363855","commenter_b":"Good let the idiots divorce","commenter_a":"overinflated sense of their own importance much? idiots","post_message":"Here's to a speedy divorce!"},{"comment_id":"594388797376563","commenter_b":"To all of you saying fair game and all that.... You are no better than the republicans that did it Michelle Obama, you should be ashamed of yourselves","commenter_a":"People of character do not talk negatively about someones' spouse nor kids. End of that discussion. With that said, I sincerely hope Carson never holds any public office at this stage of his life due to what appears to be his deteriorating mental faculties. He is running for president of my country so that is a legitimate comment of my concern of his abilities. This comment does not in any way extend to any members of his family.","post_message":"He's a candidate, so that means she is automatically in the spotlight - but do people really need to be so cruel?"}]
