[{"comment_id":"10153748749906336","commenter_b":"I want to applaud those that entered our country illegally and their main priority was to become legal and accomplished it. Talked to some that did just that as a priority. Yet, we have the illegals that come and breed like rabbits for an anchor babies. Free benefits. Or men that leave family in other countries, shack up with a women here and start rutting to produce too. Instead of becoming legal. Some have been here over 20 years. If only all would follow the steps to be here legally we would not be as we are today.","commenter_a":"I'm Hispanic and I support Donald J Trump for president Donald J Trump for president","post_message":"WATCH: Donald J. Trump invites a woman onto the stage at a Nevada rally. “I’m Hispanic and I vote for Mr. Trump!”"},{"comment_id":"10157208654565294","commenter_b":"Preach!","commenter_a":"God I wish we could stop talking about this guy. Who cares he's a waste and obviously doesn't want to try and help himself in anyway. Glad he's at least not on the Browns any more.","post_message":"\"I hate to say it but I hope he goes to jail. I mean, that would be the best place for him.\""},{"comment_id":"10153331066431162","commenter_b":"Who cares!? It's not like he did it himself and besides back in the day that's what people did. It wasn't right but that's what happened alot has changed since.","commenter_a":"It does not matter he did not do it if we look hard enough I'm sure we all have someone in our family history who's done something we are not proud of","post_message":"Ben Affleck is coming clean about why he wanted to keep a slave-owning ancestor a secret @webpagelink"},{"comment_id":"606469089512450","commenter_b":"Cus Beyoncé just another weak ass bitch in the guise of some sort of strong independent woman.","commenter_a":"Except she didn't do any of this and stayed with the man that's been cheating on her (and before the beehive goes crazy, I love Beyoncé...but what I said is also very true...) soooo you can't be a strong independent woman who brushes aside the fuck boy...when you're still married to him. Now if she comes out and says that they are still married cause it's business but they sleep in separate rooms and have an open relationship then awesome for them...but it's not empowering women...its perpetuating the stereotype","post_message":"14 Beyoncé \"Lemonade\" Lyrics For When Your Ex Texts You"},{"comment_id":"10153250211681336","commenter_b":"Seems like a lot of immigrants spouting out of their pie holes when no one knows what happened yet.","commenter_a":"AM I THE ONLY ONE WHO THINKS ALL THESE DERAILMENTS IN THE LAST FEW YEARS ARE BY TERRORISTS????","post_message":"“It is an absolute disastrous mess. Never seen anything like this in my life.”  Philadelphia Mayor Michael Nutter confirms at least five people are dead and 53 have been transported to hospitals with six in critical condition after Amtrak train 188 traveling from Washington, D.C. to New York derailed Tuesday night. @webpagelink"},{"comment_id":"10154362083273325","commenter_b":"Oh Baloney California is the Welfare , Illegal State !","commenter_a":"California is what's known as a donor State, in other words, we pay more in Federal taxes than the services/benefits we receive. This idiot needs to do some research before threaten us with his ridiculous tweets. #Resist #NoBanNoWall #RussianPoodle","post_message":"Describing California as \"out of control,\" President Trump said he would not be opposed to using defunding as a \"weapon\" against states that want to be sanctuaries for undocumented immigrants."},{"comment_id":"10153434092834586","commenter_b":"First let's remove these beautiful creatures from these ugly hateful humans, then hook them up to the carriages to earn money. Ugly people with ugly hearts. Disrespectful pos.","commenter_a":"Its not fun for the poor horses","post_message":"This is what happens when you voice concern for injured carriage horses in #NYC.   What kind of person could do this?! #BanHorseCarriages"}]
