[{"comment_id":"10154505390413037","commenter_b":"Well most of those benefits we pay go to lazy white people. Look up the facts lol","commenter_a":"So people who have been here 20 plus years....working, shopping, law abiding and not on welfare.....being healthy, productive members of society should be forced to leave.....i don't agree with that nor do I think that is fair! So called Christian people! Our country is not right......","post_message":" now because a lot of people came in illegally there no way we can even apply for papers.   Lara graduated in 2016, was her high school valedictorian and received a full scholarship to UT."},{"comment_id":"772199822829043","commenter_b":"Don't give in!!!! Let the threaten a lawsuit then tell the idiot atheist to go home & leave his town alone!","commenter_a":"Leave","post_message":"‘It’s very surprising that one guy can come from out of state and start all this’"},{"comment_id":"10154648123623812","commenter_b":"@username if Hillary would've have been held accountable 14 years ago, she'd be in prison.","commenter_a":"ABC news and the Washington Post- Lies. ABC headline is ridiculous. Newt Gingrich still backs Trump. The media is banking on people only reading the headline, and not the story.","post_message":"Newt Gingrich, one of Donald J. Trump's most ardent supporters and once rumored to be his vice-presidential pick, says Trump is \"proving he is more unacceptable\" than Hillary Clinton."},{"comment_id":"1022858884507686","commenter_b":"Just go away! Crawl into the hole of failed soorts stars, and never come out again, unless you grow up and apologize to America!","commenter_a":"Way to preach Professor Kap! Fool!","post_message":"Colin Kaepernick praised the dictator's commitment to education and criminal justice reform.  \"We do break up families here. That’s what mass incarceration is. That was the foundation of slavery. So our country has been based on that as well as the genocide of Native Americans,\" he added."},{"comment_id":"10155130620974060","commenter_b":"Yeah Yeah okey then you are one of those...","commenter_a":"UK will go out on a Friday and apply to go in on a Monday....that will suit the FTSE trading too....","post_message":"If the public is to turn against Brexit, it will do so on its own terms. The task of Remainers is to be ready"},{"comment_id":"10155384832638132","commenter_b":"I wouldn't think a pregnancy so close after a tummy tuck would be good.","commenter_a":"Didn't she get a tummy tuck?","post_message":"Congrats to the Teen Mom 2 star!"},{"comment_id":"10153459531098855","commenter_b":"Attention whore","commenter_a":"Even her wig looks sad to be there","post_message":"Not another one!"}]
