[{"comment_id":"10152817930862169","commenter_b":"Because vaccines are no longer mandatory and with all the immigrants coming into the country are bringing the diseases and worse into America. And our govt doesn't give a crap.","commenter_a":"bandwagon idiocy","post_message":"Tonight on FRONTLINE: How the Disneyland measles outbreak has redrawn the battle lines in the bitter vaccine war. @webpagelink See it at 10/9c"},{"comment_id":"970408816303922","commenter_b":"John, women don't care what you think is acceptable. Abortion is a legal medical procedure. Women don't need your approval, your acceptance, or your opinion. Do you expect women you've never met to weigh in on your private medical decisions? Of course not! Stop being so arrogant. What isn't acceptable is your flawed thinking that you can control a woman. You can only control yourself.","commenter_a":"\"Birth control\" is a misnomer. If one thinks about it, it signifies controlling an already conceived being. Therefore, i do not embrace birth control. Like stopping birth. I do embrace control prior to the embryo attaching itself to the wall of the uterus. We need to find a name for that.","post_message":"How you REALLY stop unintended pregnancies."},{"comment_id":"1183772531660175","commenter_b":"However, he will be a much better President for the nation then fumbling Obama. Rather have competent than classy.","commenter_a":"I agree","post_message":"AMEN."},{"comment_id":"378965758958385","commenter_b":"We need to start deporting all Muslims in this country. Or bedick them so they don't reproduce.","commenter_a":"DEPORT THEM ALL!!","post_message":"Norway started deporting radical Muslims by the thousands, then they saw something dramatic happen..."},{"comment_id":"923764651058995","commenter_b":"I've officially had it, I want Muslims in Muslim countries period not here...","commenter_a":"It was going to happen sooner or later. Might as well start it now.","post_message":"RT Khalilah Sabra: Muslims to Start a Revolution in America"},{"comment_id":"10154406577771051","commenter_b":"Ray >Melania isn't even from the US can't speak English an is a HOE!!!!!","commenter_a":"There is nothing wrong with her dress.","post_message":"This photo of Melania Trump sparked serious backlash after people noticed one thing about her dress."},{"comment_id":"470890583106641","commenter_b":"@username YOU'RE the looser ! And that's why you'll loose in November also !","commenter_a":"Hillary Clinton all the way to the White House !!!!","post_message":"WATCH LIVE: Hillary Clinton answers question LIVE in commercial break!"}]
