[{"comment_id":"430612380465476","commenter_b":"And what about the.over a million citizen muslims already here?","commenter_a":"Muslim immigration should be halted in this country and every other civilized country. Radical Islam is killing the world's people while government ignorance (Political Correctness) stands by and allows it to happen. Obama needs to stop apologizing for America and start protecting the American people.","post_message":"Question of the Day: Should we halt Muslim immigration until the federal government can get it under control?"},{"comment_id":"10154131960333797","commenter_b":"It's a free country. She is free to leave!","commenter_a":"Bye bye!","post_message":"\"WHAT HAVE I DONE?\" British-born actress Emily Blunt became a naturalized U.S. citizen in August, but now she says it was a \"terrible mistake.\" What do you think? Here's what made her come to that decision:"},{"comment_id":"10153718487658598","commenter_b":"Why can't liberals just coexist?","commenter_a":"Oh, but aren't liberals known for being open minded?","post_message":"Pro-Abortion Activists Freak Out New York Times Putting Picture of Pro-Lifers on Front Page"},{"comment_id":"583909811799598","commenter_b":"Go away ugly rumors nasty gossip ho away","commenter_a":"So do it already and quit saying you're going to.","post_message":"Obama was just caught red handed in a massive act of treason.  Throw him out of the white house already. He is a criminal?\\t  Would you be happy if Obama was impeached immediately?"},{"comment_id":"642248339288322","commenter_b":"Len dersima denen aşağılık sülük seni her zaman ki gibi kışkırtma aynı şeyleri tekrar etme çabası Amına kodumun iti seni","commenter_a":"They are commemorating kurdish terrorists. It s a scandal!","post_message":"LIVE: Rally to commemorate Kurdish activists killed in Paris (Courtesy Ruptly)"},{"comment_id":"10153779566119170","commenter_b":"Bush is a tush","commenter_a":"They need to stop this childish back and forth banter, and get back to the serious problems that need to be solved in this country! SMH...","post_message":"Jeb is pulling out all the stops on trashing Donald J. Trump, even comparing the billionaire to ultra-liberal filmmaker, Michael Moore. Of course, Trump had to respond!"},{"comment_id":"10156025741310354","commenter_b":"Go educate yourself, ALEX! The Constitution does not need revision to deny citizenship to illegal aliens, or their children. It is left vague in our founding document and is clarified by statute. The 14th Amendment defines citizenship this way: \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.\" But even this does not get specific enough. As usual, the Constitution provides the framework for the law, but it is the law that fills in the gaps. The Constitution authorizes the Congress to do create clarifying legislation in Section 5 of the 14th Amendment; the Constitution, in Article 1, Section 8, Clause 4, also allows the Congress to create law regarding naturalization, which includes citizenship. Currently, Title 8 of the U.S. Code fills in the gaps left by the Constitution. Section 1401 ...","commenter_a":"In my opinion all the RINOs currently in office as well as the few Republicans who haven't yet achieved RINO are crapping their pants because Trump is saying what the public is thinking. Plus, Trump could give a rat's ass about what the Democrat media formerly known as the \"mainstream media\" says about him.","post_message":"Top Republican Strategist Promises a 'Cleansing' of Donald Trump Voters from the GOP!"}]
