[{"comment_id":"1510900072276579","commenter_b":"They hate immigrants but call themselves Europeans?! Ok then go back to Europe ya fuckin assholes.","commenter_a":"\"We as Europeans\" Sorry if you live in America and have done for generations your not Europeans, there are many non-white people who are more European than you Anyone who holds any level of feeling that they are culturally attached to every other white person on the planet in some way is just weird","post_message":"\"Hitler did nothing wrong! I feel like there are two sides.\" - Tila Tequila"},{"comment_id":"731399806958628","commenter_b":"SUSIE ROTTEN CROTCH...and NASTY ASS LITTLE BILLY...Mommy needs a ass beating by daddy. Because you know it is the nutty woman who thought up the bullshit.","commenter_a":"IF LITTLE SUSIE ROTTEN CROTCH AND NASTY ASS LITTLE BILLY DOES NOT HAVE THEIR SHOTS...DO NOT TREAT THEM OR LET THEM IN PUBLIC SCHOOLS....PERIOD.","post_message":"More docs are refusing to see families that don't vaccinate."},{"comment_id":"653855578126234","commenter_b":"@username so you are ok with men grabbing women's genitalia.","commenter_a":"And this what mango Moussillini's said immediately after Michelle's speech. Trump on the People reporter who said he sexually assaulted her: \"Take a look. You take a look. Look at her. Look at her words. You tell me what you think. I don't think so.” He is grotesque. My husband never speaks like Trump - EVER. And Trumps cult is now tweeting repealrhe19th. Only weak sociopathic narcissist men like Trump, lie, talk and think like Trump. As for women that support it, are beyond words to me right now.","post_message":"Here's the incredible Michelle Obama speech Fox News refused to air: \"Strong men — men who are truly role models — don’t need to put down women to make themselves feel powerful.\""},{"comment_id":"10154974354758984","commenter_b":"lock her up","commenter_a":"Both are ignorant bitches!","post_message":"In Wisconsin, the recount had gotten Hillary Clinton one extra vote. Now, though, the recount in Pennsylvania is in, and here's how many votes it netted Jill and Hillary...  This is NOT what they expected."},{"comment_id":"10154654618245575","commenter_b":"@username are you by chance a Libetard? from cali ?","commenter_a":"The President to be mocks the loser that's really Presidential.","post_message":"TRUMP MOCKS HILLARY ON HER CANCELLED FIREWORKS SHOW! ---VIDEO"},{"comment_id":"10155051034632235","commenter_b":"OMG, that white woman nothing but a pathetic looser, of course everyone could attack elderly or children, what a moron, see what happened if she fought younger Korean woman, she definitely 'll get beat up by her taekwondo or judo and beg for mercy, are we going to live backwards like in 90 again!?!😠😠","commenter_a":"It just goes to show you what low life's the \"superior\" white folks are.","post_message":"Welcome to Trump's America."},{"comment_id":"10153314695286051","commenter_b":"get over it, all anyone ever sees is when a black gets shot, stupid bitch","commenter_a":"Hell I don't see anything about our Military any more because all I ever see is about cops","post_message":"Two police officers fatally shot a man in Texas this week, but there’s a catch: The suspect fired multiple shots at them first. Did the officers defend themselves appropriately?"}]
