[{"comment_id":"1354339577942641","commenter_b":"Education, do u have?","commenter_a":"I f*****g hate Islam.","post_message":"Behold the peaceful religion..."},{"comment_id":"10153366334404024","commenter_b":"I don't trust anything that Obama says or does.","commenter_a":"Get him for war crimes.","post_message":"Doctors Without Borders Rejects Obama’s Apology: Demand Investigation Into What It Said Was An Alleged “War Crime” @webpagelink"},{"comment_id":"1287351561304298","commenter_b":"Pneumonia?! Doubtful!!! Maybe her conscience raised its despicable, dishonest head and gave her a little peak at her destiny - a one way trip to spend eternity in Hell - now that ought to make her swoon!!! Still...Doubtful!!!","commenter_a":"Just another lie...","post_message":"New News Is Hillary has pneumonia.  FOR THOSE WHO WERE OFF THE GRID TODAY MOST, here is all you need to know about Hillary's 'medical episode'  (aka fainting) during the 9/11 ceremonies in NYC.  All the videos you need to see:  @webpagelink"},{"comment_id":"10154930329184411","commenter_b":"eeehh how much cost an ukranian whore that can make this? 20 euros?","commenter_a":"OH someone throw these naked chicks money and maybe they'll start dancing to finally enterain us","post_message":"'Ukraine to EU', 'Break the Wall': The one-woman demonstration."},{"comment_id":"10152922830971491","commenter_b":"'@username, you killed my sides.","commenter_a":"So many hateful comments. Why?!","post_message":"“God chose us to take care of these babies.”"},{"comment_id":"10153165284351770","commenter_b":"This woman is so wrong for our country.","commenter_a":"This lady is delusional, don't they do mental checks before putting people in these high ranking positions??","post_message":"Attorney General Loretta Lynch suggested that President Barack Obama could call for Congressional action for increased gun control in the wake of the San Bernardino terrorist attack.  Read more: @webpagelink"},{"comment_id":"10152864782686336","commenter_b":"Musa, you're butt ugly!!","commenter_a":"Please disclose his identity so that these western pigs would stop blaming islam for all their atrocities.","post_message":"Breaking News: 1 of 3 suspects in Paris terror attack surrenders to police, French judicial official tells the Associated Press. @webpagelink"}]
