[{"comment_id":"1709358782672403","commenter_b":"Poor Hillary. Somebody here has mercy for her? What will do happy to Clinton? She needs an oily dildo to be happy again!","commenter_a":"Mr. Trump please get back to talking about jobs and the border problems and ignore the pundits like Matthews. You need to talk more about Cruz being an insider too. That is not stressed enough in your campaign. You can win but have to talk about what the average American is worried about. God Bless you. I will be voting for you in Pennsylvania.","post_message":"Wait until I do not have to take on 16 candidates at once. I will be Hillary's worst nightmare! We are going to WIN!!"},{"comment_id":"1300941689949097","commenter_b":"She is to evil to regret anything !","commenter_a":"Angela merkel is romancing with muslims. She will regret later","post_message":"CAN THERE BE A DUMBER COUNTRY ON THIS PLANET?"},{"comment_id":"963771213658338","commenter_b":"He hasn't been sent yet! The judge will do that! 263, but if he, the judge, gives him concurrent sentences, he'll be out in 20....wait until JAN 16","commenter_a":"Lolol good!!!","post_message":"Daniel Holtzclaw was sentenced to 263 years in prison."},{"comment_id":"10154400468321509","commenter_b":"How does this help improve the economy, education, and create jobs! The battle is more than Hilary, let her stop dreaming!!!!!!!!!","commenter_a":"Go directly to jail","post_message":"Hillary Clinton: \"I will defend voting rights, and make it a priority... to get rid of Citizens United and its pernicious effects on our electoral system.\" Read her opinion piece on CNN: @webpagelink"},{"comment_id":"589287567920858","commenter_b":"Wanted to see the dogs lock jaw these pos","commenter_a":"Click bait everywhere goddamn","post_message":"A man was slashed after coming to the defense of a dog. Surveillance video shows the two men punching, kicking and beating dogs on Staten Island."},{"comment_id":"10153662465839714","commenter_b":"Am I the only one who gets the joke?","commenter_a":"Mr trump, explain to me why something in the constitution is unconstitutional?","post_message":"Donald J. Trump continues to defend his controversial immigration plan."},{"comment_id":"652489448217570","commenter_b":"Bella, ur out of your mind.","commenter_a":"I've never seen a bigger deal made out of nothing than Deflategate","post_message":"Uh-oh...This could be BAD NEWS for Tom Brady!"}]
