[{"comment_id":"10153228353231336","commenter_b":"Hawraa is unaware of the meaning of the word AND. Grow up little girl.","commenter_a":"This is dead on right...but the morons and libs will be outraged!!! If you can't handle the truth","post_message":"“It is the behavior of individual human beings, not big daddy government that leads to success.” — Bill O'Reilly  WATCH Monday's Talking Points Memo and weigh in: @webpagelink"},{"comment_id":"449511958572680","commenter_b":"This lady is nothing but a liar...","commenter_a":"Muhammad ordered beheadings and other extreme violence as does the Quran today and all of Islam idolizes them as does Obama and Hillary!!","post_message":"The divisive rhetoric and encouragement of violence we're hearing from Donald Trump isn't just wrong—it's dangerous."},{"comment_id":"10153154705006051","commenter_b":"Can't stand your ass either","commenter_a":"Can't stand Al Sharpton!! He is an evil racist!","post_message":"Al Sharpton was asked if the $5.9 million settlement for Eric Garner's death was enough. His response: No. He also has another demand. Do you agree or disagree with Sharpton?"},{"comment_id":"1482883781727172","commenter_b":"Once the snowflakes find out the expense of their new revolution will cost them their Pot money....they will reconsider. But hey...the gun community is an inclusive bunch. This should be interesting to watch. They will be easy to spot wearing their skinny jeans with a big bulge printing for me to keep an eye on.","commenter_a":"These people give a new meaning to the word stupid!","post_message":"Unreal."},{"comment_id":"10153492592416336","commenter_b":"Lol, I guess I won't state the obvious...","commenter_a":"No that's not okay, nor professional. What is okay is to speak to the parents and ask them to remove the child until he or she is calmer.","post_message":"Darla Neugebauer, owner of Marcy's Diner, said she’s not sorry for yelling at a 21-month-old for crying in her restaurant because it got the girl to be quiet.  Is it okay for a restaurant employee to yell at a child?"},{"comment_id":"10153080996873717","commenter_b":"Although I could actually care less about this flag, to call her a hero is a complete joke.","commenter_a":"I love how wmur calls the person who stole the flag an 'activist' but not an extremist","post_message":"An activist removes the Confederate battle flag from the grounds of the state Capitol in South Carolina early Saturday morning. @webpagelink"},{"comment_id":"1264285906955844","commenter_b":"Agree public should not enable bad behavior from 15 year old kid.","commenter_a":"She ain't no child, she wanted act grown, so she got treated likes she grown. Please don't sympathize with her, you are only enforcing the behavior that she is a 'child' and she can get away with anything.","post_message":"'The juvenile had to be detained.'"}]
