[{"comment_id":"10153600578582042","commenter_b":"😂😂😂😂","commenter_a":"Then you need a toupee cause your hair Is hideous","post_message":"'I don't wear a toupee. It's my hair, I swear,' Donald J. Trump said."},{"comment_id":"10157018686460389","commenter_b":"And who is this new party going to be run by.. Romney?","commenter_a":"Ronald Reagan had similar numbers at this point in the process...the anti-Trumpites will fall by the waste-side....they are caught up in narrow-mindedness babble that has locked the GOP out of the White House for 8 years...it does not work WITH their current platform...we will re-write the 'Contract with America' and the Republic's Platform (for our constitutional republic) and our new GOP party--the New American Conservative Party...AND TRULY MAKE AMERICA GREAT AGAIN. #TeamTrump #TeamUSA #BrightLightOnTheHill #AnythingisPossible #PositiveAttitude","post_message":"This is what an insurgency looks like."},{"comment_id":"1818799778404105","commenter_b":"It is time for a woman president peeps..........this is not the woman.","commenter_a":"She may have one the debate, but America lost in this Presidential election","post_message":"Join Hillary live in North Carolina for her first rally since winning last night's debate → IWillVote.com"},{"comment_id":"10153287154044714","commenter_b":"Nope. She's a woman!","commenter_a":"Your father is a man I don't care he changes","post_message":"An incredibly touching story"},{"comment_id":"1215546011816966","commenter_b":"This is still AMERICA. MOST OF US STILL. BELIEVE AND HAVE LET OUR CONSTITUTION , BILL OF RIGHTS AND AMENDMENTS. WORKING IN THIS COUNTRY. YOU DONT LIKE THOSE LAWS OF OUR LAND. YOU ARE NOT A TRUE AMERICAN. SO YOU HAVE NO SAY. BECAUSE YOU HAVE NOT PASSED THE LAWS OF IMMIGRATION TO BE A CITIZEN OF THIS UNITED STATES OF AMERICA. AND JUST BECAUSE YOU ARE BORN HERE DOES NOT. GIVE YOU THE RIGHT. TO UNDO OUR LAWS. IT IS BREAKING THOSE LAWS TO DO SO","commenter_a":"Bimbo has been drinking the koolaid","post_message":"This is ABSURD."},{"comment_id":"10153529159371770","commenter_b":"That's another reason he is known as lying Ted!","commenter_a":"what do you have to say now cruz? ha ha","post_message":"'Donald J. Trump is not getting to 1,237. No one is getting to 1,237.' #ThrowbackThursday"},{"comment_id":"514466908734354","commenter_b":"We have enough homeless, and veterans who need out support. We need to stop being 911 for the rest of the world. Deport the illegals, Some say illegals do the jobs Americans won't do, then American's better start doing them.","commenter_a":"HEY OBAMA FORGOT ABOUT THIS LAW......Islam, by law, is prohibited from US immigration The Immigration and Nationality Act passed June 27, 1952 revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in Chapter 2 Section 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by 'force, violence, or other unconstitutional means.' This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House.Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the ...","post_message":"ICYMI: 'A new Fox News poll shows 52 percent of the nation favors deporting the millions of illegals back to their home countries. Republicans and Democrats support Mr. Trump’s plan,' writes Todd Starnes."}]
