[{"comment_id":"10153660533997235","commenter_b":"She'll be fired for feminist ideology being expressed at FOX on air.","commenter_a":"Why is that \"news\"?","post_message":"In a rare lucid moment, Fox News' Andrea Tantaros NAILS IT."},{"comment_id":"1137064162981260","commenter_b":"Mold on the apple","commenter_a":"Grrrrrreat. *head desk*","post_message":"A huge new study has confirmed that we are in the middle of an extinction event, the likes of which hasn't been seen since the dinosaurs went extinct."},{"comment_id":"10154119835601770","commenter_b":"Give those real freaks, real deplorables if you will... a hand they know Clinton is one of them!!","commenter_a":"They feel sorry for the looser and I mean a dirty looser","post_message":"Remember when Vice President-elect Mike Pence was booed at 'Hamilton'?"},{"comment_id":"10158074585980294","commenter_b":"The only thing that woman is in line for is a jump suit with stripes","commenter_a":"Here's hoping Hillary gets 271 at the least!!!","post_message":"By law, the Electoral College meets on December 19. But how does it actually work? Here's a quick lesson on tomorrow's events."},{"comment_id":"10152785745546130","commenter_b":"Also this will happen @webpagelink","commenter_a":"This will end the first girl who gets into a HS foot ball team and the guys decide they're not going to pull their hits for her and hit her like a man twice her size. Look women can be tough. BUT the toughest women are weaker than the toughest men. it's called gender dimorphism. Most mammals have it. That isn't to say that somewhere a woman isn't going to show up that can play running back, but with thinner, softer bones she's also more likely to get killed or seriously hurt.","post_message":"She's not going out without a fight."},{"comment_id":"10153721547731378","commenter_b":"Says a skinny woman","commenter_a":"Life is short. Eat the cake.","post_message":"Are \"Cheat Days\" helpful or harmful to your diet? Some say giving into cravings can decrease your appetite. What do you think?"},{"comment_id":"10154568442846336","commenter_b":"Stupid","commenter_a":" him","post_message":"During a press conference, Secretary of State John Kerry suggested the media should stop covering terrorism \"quite as much.\" @webpagelink"}]
