[{"comment_id":"10154189776881130","commenter_b":"I'm ready, bitch.","commenter_a":"Not reading the article--no time for it. But to pass along, a commentator on CNN today said that the Clintons operate from a stance of self - righteousness, thus they cant see what they're doing is oh so wrong. Hit it on the head! Two major party candidates, to major flawed choices!","post_message":"If Hillary Clinton wins in November, brace yourselves."},{"comment_id":"10153232515139087","commenter_b":"Will she go away now?","commenter_a":"Rosa Parks, Martin Luther King, and Abe Lincoln all fought for equality. Kim Davis is trying to deny equality to people.","post_message":"Kim Davis was compared to Abraham Lincoln, Martin Luther King and Rosa Parks as she was given the \"Cost of Discipleship Award\" by the Family Research Council."},{"comment_id":"473987716059156","commenter_b":"If MUSLIMS want kids to learn about Islam they should move back to the HELL HOLE they came from. In America we believe in separation of religion and state.","commenter_a":"all our schools should ask God back in to their teachings","post_message":"Muslims are up in arms about this new bill affecting religion in schools in Tennessee. I wonder how far they'll challenge it."},{"comment_id":"963771213658338","commenter_b":"He hasn't been sent yet! The judge will do that! 263, but if he, the judge, gives him concurrent sentences, he'll be out in 20....wait until JAN 16","commenter_a":"Lolol good!!!","post_message":"Daniel Holtzclaw was sentenced to 263 years in prison."},{"comment_id":"10154356227669641","commenter_b":"Females have orgasms? ;)","commenter_a":"Is everyone who is reading this so dumb or is it just me? The comments seem to be coming from people in deep sleep. OK for starters let's all read the post in detail again then re-align comments.","post_message":"What is the actual purpose of the female orgasm?"},{"comment_id":"1110991635663754","commenter_b":"All he did was that march. And she's scared? She worked under Obama for years! Goodness sake you're a liar","commenter_a":"He should....he's been a supporter of equality his entire career....Hillary has not!! Hillary is the dost kind of candidate...she will switch up her position just to look good...Bernie Sanders marched with Dr. King...Hillary is terrified of black people....fake a%%","post_message":"Here's how Bernie Sanders may be starting to crack the crucial demographic of Democratic voters."},{"comment_id":"10153993699771756","commenter_b":"@username And you do realize the husband who was carried out the attacks was an American citizen, not refugees. In fact no refugees have ever carried out attacks. But by all means you go ahead and keep screaming about refugees, the terrorist just love you doing exactly as they wish.","commenter_a":"So Texas went from an idiot governor, to a mostly corrupt governor, to an insane one?","post_message":"Texas and the federal government have taken their power struggle over Syrian refugees to federal court."}]
