[{"comment_id":"10153738613786955","commenter_b":"And black people wonder why white people view them the way they do. When you act like a classless piece of crap, we are going to view you as a classless piece of crap. And this woman is a classless piece of crap","commenter_a":"Should have dragged this Nappy-headed skank out by her hair & shown her the gutter where she belongs......Good luck in Prison Ho'","post_message":"WHAT HAPPENED TO MANNERS IN THIS COUNTRY?"},{"comment_id":"10153289142823984","commenter_b":"I had high hopes .........what a big disappointment to all Americans so sad............","commenter_a":"Yes, start the impeachment procedures NOW!","post_message":"This might be Obama's biggest miscalculation yet, and it's going to cost him dearly.  Should this get Obama impeached?"},{"comment_id":"10153328841247377","commenter_b":"she should be in jail what she done to Stevens was murder .","commenter_a":"We The People That For Trump Will Vote For Trump The Hard Core Dem Will Vote Dem If I Told Them My Dog Was Running They Wood Vote For Her Most Of Dem And Rep Wont To See Our Country Great A Gain Will Vote Trump","post_message":"New email released Monday shows slain Ambassador Chris Stevens wanted to leave Benghazi for months before his death, ex-U.N. Ambassador John Bolton said Tuesday."},{"comment_id":"10155127148590652","commenter_b":"What we need to do is educate them so that they leave that vile disease that is ISLAM. That's the only way we will rid society of ALL the barbaric Bronze Age religions that have no place in the 21st century...","commenter_a":"At last someone actually making a speech about the idea that wearing a headscarf doesn't necessarily mean that women are (always) submissive, that it's part of a culture as well, and that not ALL women are forced to wear them. Ten years ago and even before i used to be seen as an alien if i said that, not being a Muslim myself. pppffff Yes!! let them get on with their lives, and us ours!","post_message":"\"We need to create the space to hear Muslim women for who they are individually and not to judge them merely as a monolithic community.\""},{"comment_id":"1044120348961770","commenter_b":"Whore...like she has any brains...","commenter_a":"Paula you've had your 15 minutes.","post_message":"The woman who sued Bill Clinton for sexual harassment two decades ago doesn’t want him back in the White House."},{"comment_id":"10156618428550354","commenter_b":"And why wouldn't he? His father and step father were Muslim...Is it beginning to make sense?","commenter_a":"They will have to air the whitehouse when they finally get because of the smell he will leave","post_message":"The worst terrorist attack in America since 9-11 and what does Obama do?"},{"comment_id":"10153421158184726","commenter_b":"The Confederates nearly destroyed the United States!! They were slave owners and rouges! You lost the war now get over it and burn the damn flag!!!!","commenter_a":"The subject of slavery needs to be relegated to history books and musems right along with the battle flag of the Confederacy. I sick of hearing in about slavery, let's talk about dinosaurs -they don't exist either.!!!","post_message":"WATCH: Rand Paul: It's Time to Put the Confederate Flag in a Museum... Do you agree with Paul?"}]
