[{"comment_id":"513241782197365","commenter_b":"Drop dead bitch","commenter_a":"Hillary just wants to be HBIC (Head Bitch in Charge)... and she will do anything to achieve her goal... including murder!","post_message":"I don't think we can take a risk on a ________ like Hillary Clinton."},{"comment_id":"10154529100646323","commenter_b":"@username..tanks, anti-missile system or cannons are completely useless in civil war in a country where anybody and everybody can have a gun. And when government doesn't know who has it. There's a reason America in a last century (and before) was the safest place to live in the world. Totaling all the murders in 20th century USA is 10-20 times safer than S. America, Africa, Europe or Asia. Thanks to 2nd Amendment in our Constitution.","commenter_a":"It is odd how right-wing custodians of patriotism have a problem with Kapernick regarding the anthem but hardly emit a peep when scores of people are killed by lunatics with guns who take advantage of that great piece of antediluvian legislation otherwise known as the Second Amendment.","post_message":"\"Declining to stand and laud that country until these outrageous, deadly imbalances are repaired – until our flag actually does represent everyone – is perfectly reasonable. America gets my unreserved, hand-on-heart patriotism when it earns it.\""},{"comment_id":"10153706992631955","commenter_b":"Let's bpmb those fagots.","commenter_a":"The machine that makes invincible passports! We must take it for the empire!","post_message":"ISIS May Have Passport Printing Machine..."},{"comment_id":"997862486926485","commenter_b":"She also set up a GoFundMe account. It's a publicity stunt to make money. She's a nasty person","commenter_a":"She showed she had class. Love this story.","post_message":"Two women called this mom a \"whale\" because of her size, what she did next is truly remarkable: @webpagelink"},{"comment_id":"10153516438828487","commenter_b":"Shut up douche bag .","commenter_a":"Everything and everyone is interconnected in this economy. To say the NYSE had a series of computer glitches is to mislead the greater public and further cover up the truths behind the shut down.","post_message":"On Wednesday, technological glitches shut down the New York Stock Exchange and grounded thousands of United Airlines flights."},{"comment_id":"374960556025572","commenter_b":"You want to live in America and enjoy all our Country has to offer! Take off your scarf.","commenter_a":"Yes","post_message":"Should head scarfs be banned in America?"},{"comment_id":"1084079061644582","commenter_b":"Isn't she too powerful to jail?","commenter_a":"Says the rich woman","post_message":"\"Wall Street can never be allowed to threaten Main Street again, no bank can be too big to fail, no executive too powerful to jail,\" says Hillary Clinton during Nevada victory speech. @webpagelink"}]
