[{"comment_id":"775509592583157","commenter_b":"@username they are home how about the real immigrants go home for a change ?","commenter_a":"Illegals come here from Mexico looking for a better life yet they want to turn the U.S. into Mexico...freakin' crazy, and stupid!","post_message":"\"The American taxpayers have reached a boiling point. We are tired of illegals taking American jobs. We are tired of illegals living off our tax dollars. We are tired of illegals causing mayhem in our streets,\" says Todd Starnes. Do you agree?"},{"comment_id":"10156136666730725","commenter_b":"@username..so the Democrats will bring in foreigners who despise us and our way of life. Yes that will certainly help.","commenter_a":"Why are we not taking care of our homeless veterans better first?","post_message":"BREAKING: Secretary of State John Kerry says the U.S. will significantly increase the number of worldwide refugees it takes in over the next two years to help ease the Syrian refugee crisis ----> @webpagelink"},{"comment_id":"1906434399416299","commenter_b":"Imagine something bit u on ur naked body lolzz","commenter_a":"The restaurant name should change to Animals restaurant","post_message":"Owners describe it as an 'orgasmic atmosphere.'"},{"comment_id":"10153862572524369","commenter_b":"I have pretty extensive vocabulary and definitely don't need to use slang so by all means generalize and assume that we all say it...it's sad people are really this stupid.","commenter_a":"If they want the racial slurs to go away, they need to stop saying them as well. It's a double standard.","post_message":"Student groups have complained for months of racial slurs and other slights on the overwhelmingly white campus. Now, more than two dozen players say they're staying on the bench until the university's president is removed due to his \"negligence toward marginalized students' experience.\""},{"comment_id":"1414146828610887","commenter_b":"If he can't deal with everyday life maybe he should be committed to a facility that can help him. In other words he is nuts.","commenter_a":"Oh boo hoo, here is a tissue, grew up your in college time to man up","post_message":"College Kid Demands Counseling After Being 'Traumatized' By Seeing The Confederate Flag Sticker Our society is getting out of control. Do you think this is ridiculous?"},{"comment_id":"638139039652611","commenter_b":"They paid her less cause she sucked ass!","commenter_a":"It's true cause Brian Williams was there","post_message":"YEAH!!!!!!!!!"},{"comment_id":"575161529335569","commenter_b":"That sick women will never be fine ! Who you kidding !","commenter_a":"Why is this such a big deal? After some rest, and antibiotics she will be fine.","post_message":"Is Hillary Clinton just run down, or is it more serious?"}]
