[{"comment_id":"335857396538054","commenter_b":"There is no climate change that is your agenda","commenter_a":"Does this arrogant, smug, condescending community organizer and failed President REALLY want to compare resumes with the Donald? More evidence of how delusional he is and how stupid he thinks we all are.","post_message":"“I think foreign observers are troubled by some of the rhetoric that’s been taking place in these Republican primaries and Republican debates. I don’t think it’s restricted, by the way, to Mr. Trump.”  During a press conference earlier today, President Barack Obama slammed Donald J. Trump and other GOP presidential candidates while continuing to tout climate change. @webpagelink"},{"comment_id":"895578827165435","commenter_b":"nothing ever happens to her for her lies!!!!","commenter_a":"Keep digging, @username.","post_message":"As the Speaker notes— Having finally heard from Secretary Clinton yesterday, we are left with more questions than answers. These public records at issue are broader than Libya and broader than Benghazi. The Secretary of State has enormous responsibility and jurisdiction and the public, the media and Congress have a legal right to access these public records without impediment."},{"comment_id":"1181580438601675","commenter_b":"That's not true but i'm glad she got away with it,I can't wait till she starts debating Trump.","commenter_a":"Not","post_message":"True story..."},{"comment_id":"1755849284702183","commenter_b":"Fuck Muslims","commenter_a":"That's not how it read last year fool think we forget","post_message":"They Told Him It Was A 'Threat To Muslims'... and his response went viral.  Do you support his right to fly our flag?"},{"comment_id":"10153132244251037","commenter_b":"she lived until she was 86.","commenter_a":"Never smoked a day in my life and never will. I saw my great grandmother suffer for other a year from emphysema that killed her very slowly. She started smoking at age 11 and didn't stop when she was 86 and still had O2 strapped to her face. Her lungs were almost solid black due to all the years of smoking. Its heartbreaking to have to watch your loved one suffocate in their own fluids all because of cigarettes... Seeing that I promised mysf I would never smoke, and I never have. Maybe I will get sick anyway, but at least I know I have the choice whether or not to expose myself to such a horrible toxin ridden thing. I still font understand why people ever pick one up knowing the effects on the body","post_message":"America's biggest #tobacco companies say they are ready and willing to pass along factual public health information about cigarettes."},{"comment_id":"10154666429943258","commenter_b":"Go back to France, sing a song and appease all the Muslims......","commenter_a":"Immature. You should do what your customers ask of you.","post_message":"James Taylor wanted Fox News changed at Boston Logan International Airport. Here's what Bill O'Reilly had to say about that."},{"comment_id":"1664084467202646","commenter_b":"Then I would campaign for congressional term limits Allow the country to decide if abortion is to be legal or not. The same with gay marriages. The supreme court should not be involved in these maters. If the is challenged and reversed. So be it. I would not allow mass illegal immigration. Illegal is wrong by definition. As to radical Muslims. Not welcomed. Peaceful Muslims who migrate legally are welcomed as long as they assimilate . And do not try to impose sharia law. This country has its laws made by its citizens. If you come here. You need to assimulate. I would ask for voter IDs. Driver license are not proof citizenship. Sorry.","commenter_a":"I would dump Obama care and replace it with something that makes sense. Eliminate the following depts. Education, environment and agriculture. TSA homeland security plus the irs. Treasury dept can handle collecting a flat tax. Eliminate the federal minimum wage. No need for the federal govt to be involved in these areas. Then I would walk away from the Iran nuke deal and global warming. Bad policies. Then I would invite the Mexican president to the white house and bitch slap him. Cut the budget across the board by 10% for each of the 1st 4 years Have a flat federal tax of 17.5 on everyone. Period. No deductions. Nothing. Flat. Period. I would then review all of BHS executive orders and reverse or modify what I decide what is needed.","post_message":"If you were president what is the first problem you would address?"}]
