[{"comment_id":"10153855884068606","commenter_b":"Kate shut the f*ck up! You weren't there!","commenter_a":"... Y'all can reply as you will.... This man had \"cocaine toxicity.\" He could have easily had a heart condition from drug use or other undiagnosed heart problem and he did cocaine. He was assaulting other people, he was violent and breaking the law. He was high. He required restraint. How about don't do drugs and hurt people and then you probably won't die in police custody?","post_message":"JUST IN: Death of man in custody of security guards at D.C. apartment complex ruled a homicide: @webpagelink"},{"comment_id":"456612701195977","commenter_b":"Try shutting your mouth and your legs , bitch !","commenter_a":"yep a free ticket to Africa","post_message":"Should Blacks Be Compensated For Slavery? Comment 'yes' or 'no'."},{"comment_id":"10154216740214160","commenter_b":"Says the woman who's husband cheated on her and she cheated on her husband","commenter_a":"People in Power need to lower their Kelly's.","post_message":"\"Today I ask Donald J. Trump to step aside,\" wrote Carly Fiorina."},{"comment_id":"10154682808296037","commenter_b":"@username. We don't need male genitalia to be smarter than you. Go run along and play, now.","commenter_a":"In his hand against his thigh. Plain as day. Please save and share for the ignorant.","post_message":"Charlotte police release body camera and dashboard videos of fatal shooting of Keith Lamont Scott."},{"comment_id":"10156049439790725","commenter_b":"because we know how to build stuff that's why..... Why u think Latinos rule the construction industry?? Lol... Really building a wall huh? Who u guys going to get to build the wall?","commenter_a":"What about the fence the Mexicans put up to keep People from Guadamalia out> If it works for them why not for us??","post_message":"For those that don’t think a wall (fence) works, why don’t they suggest taking down the fence around the White House? Foolish people!"},{"comment_id":"1458627227490636","commenter_b":"We refused to take Germanies Immigrants & the Nazi's killed 6 Million! Racist, Bigots still lurk in all corners of OUR Country!","commenter_a":"^5","post_message":"State Department figures show that 2,340 Syrian refugees arrived last month in the United States."},{"comment_id":"10154137219211323","commenter_b":"Except I don't know any bores.","commenter_a":"How the shallow half lives. My parties are made up of kinder people and we include bores, shy people and those who feel rubbish but know they will be treated with kindness and respect.","post_message":"“They don’t know they’re bores, so they’re happy.\""}]
