[{"comment_id":"989439721086384","commenter_b":"Thank you, Senator for being on the right side of this issue.","commenter_a":"How dim do the gun owners have to be, make guns so easy to use, and easy to get and they can't figure out why there are so many shooting? Clowns.","post_message":"Our hearts go out to the families of the victims and to the community of Lafayette. Once again the scourge of gun violence has claimed the lives of innocent Americans in a place where they have every right to feel safe. This chilling crime is yet another reminder that gun violence can strike anywhere, at any time.  When will Congress act to reduce gun violence?"},{"comment_id":"10153557927483984","commenter_b":"More liberal stupidity","commenter_a":"This is just getting Americans used to having freedom taken away from them. One step at a time until Americans have no freedoms to do anything. This will stop when Liberal politicians are voted from office.","post_message":"Wow. Taking the Confederate flag down from state capitols was controversial enough, but this is on a whole new level. A lot of people are going to be furious...  Do you think Congress has gone too far?"},{"comment_id":"366282870162354","commenter_b":"Shot in head","commenter_a":"Death","post_message":"89 Year Old WWII Veteran Beaten To Death By Thugs. This is tragic. Please send your prayers. What do you think their punishment should be?"},{"comment_id":"10156149888525389","commenter_b":"Now they are coming over by sea they are still illegalls","commenter_a":"Oh Great,more people coming in !!","post_message":"A Miami Beach Police spokesperson said it is unknown how long the group were at sea."},{"comment_id":"1247969895269376","commenter_b":"So we can take hus away also. He is more privileged than her.","commenter_a":"Are you kidding me? He is simply making a point that she is a privileged elite who lives by one standard of protection and expects the little people--the unworthy stupid masses--to try and survive under a different one. It's called irony. To deliberately misinterpret and inflame his message (as a call to 'assassination'???!!!) is just proving Hillary right--her sheeple are the stupid masses. I say, let's prove her wrong and show some common sense.","post_message":"DISQUALIFYING! This is the SECOND time he suggests that Hillary should be shot. What is WRONG with him?  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"615120388649797","commenter_b":"I don't think it should be considered treason, I think it IS treason. How do you Snopes check this? And where is the link to the Washington Post article?","commenter_a":"Guys we have no choice. They are so advanced we have no choice","post_message":"This should be considered treason."},{"comment_id":"10154898338007577","commenter_b":"Do you know how many Christian societies destroyed each other fighting over how they would practice Christian culture? Go back to school buddy and come back when you are ready to embrace the real fate you are living in.","commenter_a":"The liberals know their perversion of modern society with their political correctness and liberal rights for the underserving criminals, non Christian cultures is coming to an end. The American people are going to start clawing their rights back under Trump.","post_message":"MSNBC continues to whine and cry over Donald Trump being democratically elected as President..."}]
