[{"comment_id":"10156608436570354","commenter_b":"We need to STOP celebrating arrests.... and STOP the influx of these fuckers (LITERALLY) in the first place.... They breed like rats.... Once they infiltrate, there's NO GETTING RID OF THEM.... Think of the rat problems in NYC! How about cockroaches? How about emerald ash bore? Zebra snails? Asian carp? GET IT????????????","commenter_a":"There is no such thing as 'Moderate muslims.' They all read from the same Quran.","post_message":"German police have now made a staggering 379 charges for the attacks in which women were sexually assaulted by migrant gangs on New Year’s Eve.  All the latest DETAILS here..."},{"comment_id":"1686607741593351","commenter_b":"Morris @username For President Independent....Thompson say's 'I don't care about the F _ _ _ _ _ _ Wall'! Under my plan I am going to enforce existing law that requires all employers document its employees right to work. There is an $11,000 penalty per illegal that will be used to pay for the deportation. Former Mexico President Vincente Fox I intend on overwhelming Mexico with illegals","commenter_a":"As they say in Espanol....p..... tu madre.","post_message":"EX MEX PREX: 'NOT PAYING FOR FUC*ING WALL'"},{"comment_id":"496840043839909","commenter_b":"No she should not!!!!!!","commenter_a":"well at least something can move them","post_message":"America in uproar after this Sarah Palin Picture leaks.  We stand behind her 100%. We need to show her our support.  Should Sarah Palin Refuse To Take Down This Picture?"},{"comment_id":"10153722857026336","commenter_b":"How sad! God be with his family at this time.","commenter_a":"Who won the game ?","post_message":"17-year-old Evan Murray was a victim of internal bleeding caused by a ruptured spleen, an autopsy revealed Monday."},{"comment_id":"2004741493095269","commenter_b":"Because he does suck dick","commenter_a":"Why does he always look like he is about to suck a small dick?","post_message":"What an idiot."},{"comment_id":"1124493864242596","commenter_b":"I'm not sure why he was with her to begin with if that's the way she feels. She apparently doesn't have the same Christian values, which could only result in disaster for any potential marriage. Tim, you can do much, much better!","commenter_a":"Tebow is a good man......I couldn't care less about his football abilities...","post_message":"Tim Tebow loses girlfriend over Christian values."},{"comment_id":"727321410703321","commenter_b":"She is gross","commenter_a":"WILEY CYRUS","post_message":"Her parent's must be so proud! Smh..."}]
