[{"comment_id":"10154101108342217","commenter_b":"TRUMPERS: Instead of saying get rid of abortion, why not use POSITIVE REINFORCEMENT by encouraging safe sex, and making birth control available in stores - WITHOUT HAVING TO GET A PRESCRIPTION. SILLY goose. SSSOOOO, are you saying that if a mentally retarded person is raped, then they should have the baby? Even though they don't have the mental capacity to care for themselves?.......... thats really stupid to state that they would have to go to another state in order for them to have an abortion, or to exclude ALL abortions. WOW. I bet you didn't consider mentally handicapped people being raped, or even 10 year olds. The youngest parents ever recorded, from my knowledge are the age of 10. Do you see the issue here? Think about it. Seriously. THINK people.","commenter_a":"TRUMPERS: Instead of saying get rid of abortion, why not use POSITIVE REINFORCEMENT by encouraging safe sex, and making birth control available in stores - WITHOUT HAVING TO GET A PRESCRIPTION. SILLY goose. SSSOOOO, are you saying that if a mentally retarded person is raped, then they should have the baby? Even though they don't have the mental capacity to care for themselves?.......... thats really stupid to state that they would have to go to another state in order for them to have an abortion, or to exclude ALL abortions. WOW. I bet you didn't consider mentally handicapped people being raped, or even 10 year olds. The youngest parents ever recorded, from my knowledge are the age of 10. Do you see the issue here? Think about it. Seriously. THINK people.","post_message":"The BBC's newsroom does the #MannequinChallenge.  BBC Children in Need."},{"comment_id":"1422614517766820","commenter_b":"Turn off your speakers when Hillary starts speaking or she will break your ear drum","commenter_a":"Maybe every issue liberals care about like letting men in girls showers and rest rooms","post_message":"A Donald J. Trump presidency would pull us backward on nearly every issue we care about. We can't let that happen."},{"comment_id":"10153307243877217","commenter_b":"Holly Allcock sucks all cocks","commenter_a":"Trump is the most hated man in the world. What a disgrace!","post_message":"About 568,000 people have called for action against the presidential hopeful."},{"comment_id":"10154570112539497","commenter_b":"*grandma hands me a $10* 'Go get yourself a cup of coffee!' 'Grandma, this is a $10...' 'Then get yourself 3 cups of coffee!'","commenter_a":"Jennifer Ann Winchester","post_message":"don tell your parentsthis is just between you and me. Good boy."},{"comment_id":"585280771667035","commenter_b":"This photo is liiiiiiiife!!!! :D :D :D","commenter_a":"Brian Rungeling don't you like Trump's new 'Make Russia Great Again'?","post_message":"Alec Baldwin just trolled Trump again by walking around New York City wearing a “Make America Great Again” hat — with the embroidered logo in Russian.  The timing for Baldwin’s hat couldn’t be better, coming as the president-elect sat down with security officials on Friday who told him the Russians helped him win the election — an assertion Trump flatly denies because it would contribute to the belief that his win is suspect having lost by over 3 million in the popular vote."},{"comment_id":"10153122540893984","commenter_b":"This lady need to go and get a life !!!","commenter_a":"She hit the old nail right on the head! Hopefully, this congress will 'grow a pair' and knock him right off his 'High Horse'!","post_message":"This lady's fightin' words will get your blood flowing on a Monday.  Do you support this kind of boldness on Fox News?"},{"comment_id":"10153717178056002","commenter_b":"why not just peep in their windows?? people are falsely put on these so called 'lists'","commenter_a":"There already is one of these lists. When a Employer does a deep background check it shows everything. You and I can go on OTIS with the right info on a person like birthday date , ssn and full name you can get all of their info.","post_message":"Two boys from different families are abused by the same woman. See what this mom is doing to protect other children."}]
