[{"comment_id":"10153230871447708","commenter_b":"It's a good talk but you shouldn't make promises u can't keep. But you still have my vote","commenter_a":"Until AFTER election.....Read my lips...All the same","post_message":"I will oppose and veto ANY and ALL efforts to increase taxes. Join me in standing up for American taxpayers.  Click here now!"},{"comment_id":"1695743490702170","commenter_b":"'@username Hillary should be in Prison!!!!","commenter_a":"I'm 18 years old. This will be my first election to vote in. I'm proud to say that I am supporting Donald Trump! Save my generation, Donald! #MakeAmericaGreatAgain","post_message":"I want to win for the people of this great country. The only people I will owe are the voters. The media, special interests, and lobbyists are all trying to stop me. We won't let that happen! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"576179842587911","commenter_b":"Sad. But, Karma is a real bitch...","commenter_a":"No matter how you cut it it's tragic, but in regards to Mr. Harmon's vote against firearms training it calls to mind the expression that there none so blind that do not see.","post_message":"In 2013, he attacked proposed legislation in Maine that would have required gun owners to take a firearms safety course ..."},{"comment_id":"2029120557147682","commenter_b":"Thanks, Candice......I didn't know about Cooper.","commenter_a":"I feel badly for the cast of Moonlight! They missed out on having their movie called, and all the fan flair that accompanies an Oscar win! Shame in you PWH!","post_message":"Emma Stone: 'It was one of the most horrible moments of my life'"},{"comment_id":"10153490058828352","commenter_b":"Dumbest comment I've read. You're pretty much agreeing with this greedy ass woman.","commenter_a":"Even though this is crazy...thinking about it though if it werent for her he wouldnt be where he is today so...she really shouldnt have to ask...SINCERELY!","post_message":"Former NFL player reveals his mother demanded $1m after he was drafted ‘for raising him for 18 years’"},{"comment_id":"10154101943008984","commenter_b":"'@username , Why do you people who support only Trump find it necessary To call people names simply because they don't agree with you? Are you that insecure?","commenter_a":"Now do not get me wrong! I am for Trump 100%, think he'll be awesome BUT leave George W. Bush out of it! Take it out on Jeb because he deserves it but I don't think George does, at all!","post_message":"Donald J. Trump railed against George W. Bush for 9/11 at the last GOP debate. It got messy, and now 'W' has responded like only he could..."},{"comment_id":"10153396663904170","commenter_b":"She would HAMMER Hillary.. :)","commenter_a":"If Fiorina is blocked from the Republican debate in New Hampshire she should challenge Hillary to a debate there. Woman VS Woman. Hillary would never take the challenge, still the gauntlet will have been thrown.","post_message":"I love seeing GOP candidates use the media's 'gotcha' questions to their advantage. Fiorina is turning it into an art form."}]
