[{"comment_id":"1555989074419098","commenter_b":"We'd have have a democracy in the first place to lose. Seem that ideal is long gone","commenter_a":"This is a response to the hard tack to the left by progressives. This is the fruit of your insane policies and social engineering. You have created the potential for an authoritarian American government. It won't happen instantly, but in increments. I have to admit, I prefer this future to a nation that celebrates stomping upon our flag, allowing veterans to die waiting for medical treatment in favor of allotting medical benefits to illegal aliens, and referring to children as purple penguins.","post_message":"The frightening rise of authoritarian populism in the West is a very real, clear and present danger, writes Mike Lofgren, a former congressional staff member."},{"comment_id":"10153122066896037","commenter_b":"Porter up there is absolutely right","commenter_a":"no, we have no backbone in the US so we will let Russia take what it wants.","post_message":"The leaders of #Ukraine, #Germany, #France and #Russia pledged renewed support for a tattered ceasefire in eastern Ukraine despite violations -- including the storming of a key town by pro-Russian rebels.  Do you think peace will happen?"},{"comment_id":"10153268989822894","commenter_b":"A marriage should have 3 parties involved at all times!! Furthermore, I don't think women will ever understand how men think..ijs","commenter_a":"Y'all are so quick to judge. Giving him passes to cheat, doesn't necessarily mean he has cheated. And because she's allowing him to do it without being affected means that nothing is wrong with her self-esteem. If she just doesn't want to give her man something, then she leaves it up to him to decide where to get it. And who's to say he's making the decision to cheat? I highly doubt if she's allowing him to do it and not caring, then he isn't. That's so not how men work. And to say that they shouldn't have gotten married is stupid because they've been married for a while and I'm sure she has grown to bring about this decision with her husband. And you're not married for sex anyways. LOL!","post_message":"Mo’Nique Explains Why She Gives Her Husband ‘Free Passes’ to Cheat: ‘They May Give Something I’m Simply Not Willing to Do’"},{"comment_id":"10153152969586955","commenter_b":"She'll never be president.","commenter_a":"She's going way down in polls.","post_message":"HILLARY 'WIPED HER SERVER CLEAN'"},{"comment_id":"867378403371198","commenter_b":"Yes, women WILL vote for Trump!","commenter_a":"Mr. Trump, I was at the State Assembly wearing my red Trump \"Make America Great Again\" ball cap. People actually stopped me to tell me I am the first woman they have met who supports Trump. When people tell me that women won't vote Trump, I tell them \"intelligent women will\". Incredible.","post_message":"The people of Colorado had their vote taken away from them by the phony politicians. Biggest story in politics. This will not be allowed!"},{"comment_id":"10153882907494024","commenter_b":"The monkey bitch and her brood can't be gone soon enough for my taste.","commenter_a":"She complains about the \"house\" she lives in. Is she chained to the wall-?? Just move, bitch-!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"897132857052677","commenter_b":"i can deal with trump and cruz. NO RUBIO! or KASICH! let illegals stay here at no price. do not understand why people hate common core. soros giving them bucks. not them!","commenter_a":"Trump/ Carson","post_message":"Who are you voting for?! Let us know!"}]
