[{"comment_id":"725790477519561","commenter_b":"Ernest, I agree with 100%. If they were doing their job we shouldn't have so many illegals in this country.","commenter_a":"With all the illegals coming in. I thought they were already shut down!","post_message":"Would you be worried if Homeland Security shutdown?"},{"comment_id":"10153899191016770","commenter_b":"another nasty women I guess..","commenter_a":"Real smart people those LDS folks, sarc. Seriously,when the Supreme Court turns liberal full progressive, your little LDS church will be doing homosexual marriages, allowing non Christians to come to your places of worship, oh, I can't imagine the world of hurt the LDS is in for. Oh well, principles and all. Good for you, bless your heart, y'all just so pure as the wind driven snow.","post_message":"Latest Poll: This Conservative State Now Has Trump In Second Place. Wait. What? @webpagelink"},{"comment_id":"10153613317153132","commenter_b":"Lovely woman","commenter_a":"magnifique Augrey","post_message":"\"I didn't know she was a movie star. She always looked at my father like he was the center of attention.\""},{"comment_id":"1199808656730781","commenter_b":"I will say that being raised by two parents, not necessarily a man and a woman, can be a good support system for a child though. Single parents aren't worse by any means, but it is tougher out there for single parents, that's for sure.","commenter_a":"2 perverts","post_message":"Classic Jeb! (Hat tip to Bipartisan Report)"},{"comment_id":"10153521630153984","commenter_b":"Why fight it? Gay marriage can't do any more harm to the sanctity of marraige then us heterosexuals have already done! 50% of marraiges or more end in divorce! We spend billions on weddings creating unesseccary specticals that have nothing to do with the marraige spoken of in the Bible! Jesus would not condemn, He would love. Point fingers if you want but my goodness people, haven't we learned our lesson yet?","commenter_a":"Thank you Judge Wes Allen! May others follow you!","post_message":"This official took a bold stand for traditional marriage, and the initiative is spreading across the state. Do you support what this probate judge did?"},{"comment_id":"973671239335036","commenter_b":"She always has been a racist bitch. Where have you'all been?","commenter_a":"Get your head out of your ass and do something productive with your life.","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"10155757585249829","commenter_b":"Why not boycott Budweiser simply because it is not good beer?","commenter_a":"Melania???????","post_message":"Trump supporters on social media were furious: \"Never drinking Budweiser you should respect the AMERICAN president instead you mock with liberal propaganda.\""}]
