[{"comment_id":"10153236337040047","commenter_b":"This is an evil,should be exterminated.","commenter_a":"So sad","post_message":"This week, the European Parliament voted unanimously to recognize ISIS's atrocities against Christians as genocide.  When will the U.S. do the same?       Sign and Share our critical legal letter to Secretary of State John Kerry to demand immediate action: @webpagelink"},{"comment_id":"1141429345895300","commenter_b":"Why doesn't he close the border and escort all of the illegals & especially Muslims out of our country?","commenter_a":"TIME TO DOWNSIZE DHS. Secret police full of pussies. The whole thing is useless.","post_message":"BREAKING NEWS:"},{"comment_id":"1817582348453684","commenter_b":"Fuck me there is a lot of racist humans on this tread","commenter_a":"He should get custody","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"10153689557537434","commenter_b":"Always. I have a dirty job so it is necessary.","commenter_a":"Nope.","post_message":"Please take this poll so we can figure out how gross we all are."},{"comment_id":"10154319611824586","commenter_b":"Horrifying! All for money!! Humans are barbaric! Vegan for animals!","commenter_a":"People are killing crops:@webpagelink #PlansLivesMatter #DontGoVegan #JKGoVegan","post_message":"BREAKING: Those hermit crabs you see at beach shops & pet stores may come from this horrifying supplier.  Warning: The way workers crack crabs shells is really hard to watch :("},{"comment_id":"1091369127608289","commenter_b":"Tired of hearing about this stupid bitch too","commenter_a":"I don't care what she does.....she is the black Jane Fonda as far as I am concerned.","post_message":"Beyonce is backtracking from her racist Super Bowl 50 performance about as quickly as she can... now see who's being blamed for one of the most despicable aspects of her performance.  This seems WAY too coincidental... Beyonce needs to step up and take responsibility."},{"comment_id":"10152763354566051","commenter_b":"kill the bitch","commenter_a":"They need to wrap her head completely in duct tape !!","post_message":"When her fiance broke up with her, this woman decided to make his 3-year-old daughter pay."}]
