[{"comment_id":"10153068348838717","commenter_b":"That is true but we all know she will never be a President","commenter_a":"She's just a Lying P.O.S!!! She will NEVER be a President!!!","post_message":"Presidential candidate Hillary Clinton sits down with Josh McElveen on CloseUP."},{"comment_id":"867378403371198","commenter_b":"Yes, women WILL vote for Trump!","commenter_a":"Mr. Trump, I was at the State Assembly wearing my red Trump \"Make America Great Again\" ball cap. People actually stopped me to tell me I am the first woman they have met who supports Trump. When people tell me that women won't vote Trump, I tell them \"intelligent women will\". Incredible.","post_message":"The people of Colorado had their vote taken away from them by the phony politicians. Biggest story in politics. This will not be allowed!"},{"comment_id":"820733274641888","commenter_b":"I'd piss on the ladies car. Put vaseline on her door handles lol","commenter_a":"Oh wow! That's...harsh. It's bad enough that poor girl is struggling like this but for the person who wrote that note to shove that into her face then rub it in? oh heck no! @username, please follow up on this report and let us know the results. This story has just gotten me so hot I could boil the water for my tea just by holding the kettle in my hands!","post_message":"NASTY NOTE: Ashley Brady is still struggling to get used to her life as an amputee. She finally got a handicapped parking spot at her apartment complex, but two days later she saw a car parked there. After leaving what she believed was a polite note, Ashley got this in return:"},{"comment_id":"1723525614585873","commenter_b":"Brady Wix Baillee Schott","commenter_a":"Elias Deltoro Ryan Michael","post_message":""},{"comment_id":"10154556187833089","commenter_b":"Be remember all of you the one who said refugees should be banned because one tree make million of million matchbox and matchbox born millions trees","commenter_a":"How sweet of him but he just had musks blown up!!!","post_message":"Trudeau says refugees are welcome in Canada"},{"comment_id":"1648860662067713","commenter_b":"Why doesn't that useless cunt step in front a speeding train??","commenter_a":"Rosie O'Donnell is against guns, but it's ok for her body guard to carry one to protect her!!! Crazy!!","post_message":"YES!  This is why we love you Tom Selleck."},{"comment_id":"10153095297087908","commenter_b":"What's your problem with little girls?","commenter_a":"A bunch of bitchy little girls.","post_message":""}]
