[{"comment_id":"1791155854463672","commenter_b":"We ARE heading to this disaster because we still hold on to capitalism and free market","commenter_a":"Bobby Schar","post_message":"Thanks for that Brian ..."},{"comment_id":"10153523927041162","commenter_b":"Go marry him.","commenter_a":"I need the money to get out of debt Lord help me omg","post_message":"BIG WIN! A suburban man who likes to play the newest games bought a Golden Casino instant ticket and won $4 million. @webpagelink"},{"comment_id":"1817577751825895","commenter_b":"Another good \"Christian\" pedophile! Family values liar! Beat him ,castrate him and put his sorry ass in prison for Ever!","commenter_a":"Oh my God, I watched this show, everyone of them were so talented, they are all beautiful, the kids were adorable, always dancing and singing, even the very youngest, the Mom was warm and loving. I really believed they were a great family, this is so very sad.","post_message":"Another \"family values\" hypocrite goes down in flames..."},{"comment_id":"10154157874771130","commenter_b":"@username Your comment shows you failed to do any research before blabbering...a familiar Trump trait. The Ukraine government was propped up by the Russian government at the time Manafort was dealing with them. It was Russian/Soviet Union weaponry that took the life of a cousin in Vietnam. I'm a veteran from the Reagan era and broke out in a cold sweat every time general quarters was sounded thinking Russia/Soviet Union had finally attacked us. From the day I first opened my eyes Russia/Soviet Union was my country's enemy. Today's Russian government mirrors the government of my former enemy and the GOP candidate praises their leadership and hints that we should crawl in bed with them...I THINK NOT!!!!!","commenter_a":"Well, this is not news; Dumbocrats support rigged elections not the popular support. I don't get it, why leftists are so stupid and dumb?","post_message":"Size isn't everything 😜"},{"comment_id":"10154911255250530","commenter_b":"@username you. The Asian carp are not bottom feeders, their meat is high in protein. Watch some YouTube videos on them....you'll learn a thing or two.","commenter_a":"I've read that they are good to eat and high in protein. But, man has wiped out many species of plants & animals, don't know why this should be so difficult.","post_message":"Here come the carp."},{"comment_id":"1736968439901263","commenter_b":"@username - nobody in this world is a bigger liar than Hillary. Period.","commenter_a":"Why is it when her lips move my first thought is liar liar pants on fire...when will she tell how much she took from foreign governments - oh well, what difference does it make anyway","post_message":"Watch: Hillary Clinton suggests Donald J. Trump hasn't paid his taxes."},{"comment_id":"10153598853368984","commenter_b":"How many bullets are flying in your direction in the United States of America from Muslim extremists? How many IEDs are you avoiding on your way to the grocery store? I know we all know on any given day we could face gunfire from our neighbors from all different Christian faiths. If anything you're much more likely to be attacked in the U.S. by an angry Christian than by any other group of faith. The by the number argument that you're safer over seas from terrorist attacks than at home in the U.S. is based on comparing thousands of attacks on militarized institutions over seas and a small number of attacks directed at low security military institutions & personnel in the U.S. I feel for our solders at home being attacked. Just as I mourn for those children being attack in schools around our country. The people in the malls ...","commenter_a":"\"Radical Muslims are now the rule, not the exception\".... Let's talk about this. The Muslim faith has the largest number of believers in a world full of different faiths. To consider turning against all Muslims quite literally means to turn against over a billion people. She said this was the 21st attack. So roughly 21 people of the millions of Muslims living in the U.S. are radicals. I'm no math wiz but that sounds like an extremely small percentage. Secondly, Christians around the world have killed millions of people in the name of a God that most Americans demand our president to believe in. Who are the real radicals? Continuing, a soldier serving/living in the Middle East is absolutely not more safe there from terrorist attacks than one living in the U.S. That comment should be heard clearly as one of the dumbest things ever said. This Ignorance being spread ...","post_message":"This 22-year-old news anchor's brutal beatdown on Obama's \"half-way, half-baked, tip-toe, be-friendly-to-Jihadis mentality'' has been viewed more than 1.4 million times on YouTube, and overnight --  a viral sensation.  Now, she's just revealed what made her speak out.  Do you support Tomi Lahren and her message to Obama?"}]
