[{"comment_id":"10154461137273162","commenter_b":"@username is clearly an anthropological & archaeological authority on the issue of Jewish history. Oh, and he was apparently elected to be the Arbiter of Jewish Identity, seeing as he now has the right to decide which Jews belong where","commenter_a":"I'm sorry Bibi - you know bunch of us real Americans LOVE you !!","post_message":"Now he’s “Boo Boo!” Netanyahu! The Israeli Prime Minister Benjamin aka “Bibi” Netanyahu received a chorus of boos from the most American of audiences: New Yorkers who paid exorbitant sums to see the ever sold out smash hit “Hamilton.”"},{"comment_id":"10152831511530496","commenter_b":"She is ugly","commenter_a":"While we understand that there are various strong opinions on this topic, we ask that everyone express them with in a respectful manner. Memes and inappropriate comments will be blocked from view. Those posting slurs or otherwise offensive comments will have their posting access to our Facebook page blocked.","post_message":"Caitlyn Jenner, the Olympic athlete formerly known as Bruce, makes her debut as a transgender woman, posing in a swimsuit on the cover of Vanity Fair. Take a look: @webpagelink"},{"comment_id":"10154238918214411","commenter_b":"truth hurts huh","commenter_a":"Republicans are nothing but Bible toting A HOLES who care nothing for other people you know that the party is a minority why you ask because the only way these jerks get elected is because of voter apathy if everybody would vote the Republican jerks would dry up and blow away","post_message":"Cheer up Republicans. The presidential race may be a mess, but you controlling state legislatures..."},{"comment_id":"1009393132499179","commenter_b":"Is this guy even alive? He looks like a bad wax figure.","commenter_a":"Trump set the tone and this jerks lowered the bar to a new level. He should be removed from his position immediately!","post_message":"This is definitely disturbing."},{"comment_id":"1530656863908230","commenter_b":"Feminism is the CHOICE. You can choose to be a stay at home mom now, you are no longer forced.","commenter_a":"Feminism got women the right to vote, and the right to be equally taxed as men without suffering any of the consequences of their choices (like fighting in war) obviously women are indirectly affected by war too but....this devalued their job and oppourtunities as mothers, thus hurting the family structure by putting extra financial burdens on them to cover the extra tax load. This is why families cannot survive off of one income anymore (obviously there are other factors). Feminism made it seems petty and pathetic to be a stay at home mom and raise your children but it is the most important and difficult job in the world IMO.","post_message":"The work of stay-at-home moms is valued at more than $100K a year. Learn more about the stay-at-home mom stigma: @webpagelink Like ATTN: Video on Facebook."},{"comment_id":"1184765668249575","commenter_b":"Bye bitch","commenter_a":"Please stop giving her attention","post_message":"Poor Sarah, she has a boo-boo and it's all Hillary's fault."},{"comment_id":"884276841629012","commenter_b":"I'm not for it but I will say this: the government has known and has collected millions of dollars from illegals with fake social security numbers. Republicans and democrats both. To work here the illegals have had to come up with a fake s.s. number and pay on every check. This is a fact. I've seen it, known people who pay into it and will never see a dime from it. Our government is full of lies. They take that money and our legal money and blow it. Like I said I'm not for illegals but don't be blinded any side of the aisle in Washington D.C.","commenter_a":"This ia considered buying votes and that's illegal...but then everything Obama does is illegal. ..STOP HIM","post_message":"Thousands of illegal aliens could begin collecting from Social Security as a direct result of the president’s executive amnesty."}]
