[{"comment_id":"1159811677403083","commenter_b":"The white chic yells her ancestors owned their ass, and then yells black people don't belong in America. Huh. So when. Her ancestors bought the black people and SHIPPED them to America, the black people should go back to Africa? REALLY??! WOW. Unreal...smh... KKK at its finest!","commenter_a":"more a condemnation of them and their ancestors than the person they directed this filth at","post_message":"This is just wrong."},{"comment_id":"10153373033325667","commenter_b":"I love boobs, now thats something worth fighting for!!","commenter_a":"With so many violent movies and video games around, no wonder real killings are becoming an 'accepted' part of society. Children can easily watch something in which a person is shot (often without flinching), but God forbid a woman breastfeeds her baby in public...","post_message":"No motive for the shooting was given and police said they were still looking for two gunmen."},{"comment_id":"10154951386859655","commenter_b":"Lmfao! Did he refuse to grab her vagina? Awww!","commenter_a":"Arrest is in her future. You don't threaten the life of the President.","post_message":"***BREAKING***"},{"comment_id":"10153344764512235","commenter_b":"When racists attack children and/or make them cry, it makes me positively homicidal. I have HAD it with these people. What have they done for American society? Hell, what have they done for our SPECIES? Name ONE thing, America.","commenter_a":"The nurse needs to be fired!","post_message":"Wow. Just wow."},{"comment_id":"1527434820649594","commenter_b":"@username she's a cow","commenter_a":"They are like at least 5 articles about Kim Kardashian every day.. Kinda tired of this. She was robbed and shes still rich and has millions in the bank. Its not the end of the world. They are things & news that are MORE important than Kim's life!","post_message":"Kim Kardashian West's friends are rallying around her"},{"comment_id":"10153564847120530","commenter_b":"The father had been living in Israel when this divorce started years ago (I believe I read he currently lives in the states though) and left for a two week business trip the day after the kids were sentenced so he obviously has no time for his children that he \"cares so much to have a healthy relationship with\". He's a bad dad, the woman is a bad mom and this judge is a joke.","commenter_a":"She said all you need to know - that this was an EXCEPTIONAL case - and that there was a disgusting pattern of mental abuse/programming by the mother towards the father. Unless you are a family member who has lived through something like this, you have absolutely no idea what damage can be done to the children permanently. In our case, the The fathers children passed away from a unknown heart disease very young, and those children will never get the chance for any kind of reconciliation with him. The mother is a hateful woman, and her daughters now have no relationship with the father's side of the family because of her. The only the kids may EVER have a chance to not be screwed up permanently is by doing this. Blame the parents? What good has that done? There was cause for extreme action here - and the judge ...","post_message":"\"I wanted to do this because of your horrific behavior a long time ago and your dad begged me not to.\""},{"comment_id":"10153362420896028","commenter_b":"I and many Americans clearly disagree.","commenter_a":"Obama: You are a historic disgrace. No President in US history has ever approached the safety of Americans with the level of smug indifference that you do. You are soft on Muslim terrorists and degrading to Christians and Jews. You golf through American beheadings and yawn away the deaths of Americans at Islamic hands. You have ZERO Moral Authority.And we look forward to reminding you of that until the last second you leave office. Signed, True Americans... :D","post_message":"UPDATE 5:45 p.m. PST: Our livestream has ended. \"I know that after so much war, many Americans are asking whether we are confronted by a cancer that has no immediate cure,\" he said. Read more: @webpagelink WATCH LIVE: President Obama to address nation on San Bernardino mass shooting from the Oval Office @webpagelink"}]
