[{"comment_id":"1049317721755905","commenter_b":"full retard mode: engaged","commenter_a":"This is the evidence of existence of Allah !!!","post_message":"Our brains are truly amazing.  By Emily's Quotes, via AsapSCIENCE."},{"comment_id":"1037048666341760","commenter_b":"Cherokee Hinrichs quickly and painlessly?? Maybe for the one having the abortion, but the living baby that's being killed feels it!! Your another disqusing excuse for a woman!! Be ready for your judgement day, God will sent you straight to hell along with all the other disgusting women who kill babies!!","commenter_a":"Stop the madness. Repeal Roe v Wade. It is a choice. Choose life.","post_message":"Real doctors protect the Sanctity of Human Life!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb179"},{"comment_id":"10155285284005389","commenter_b":"This woman is deluded! I think our entire State Department is.","commenter_a":"What a dumb liberal idiot.","post_message":"“We cannot win this war by killing them [ISIS], we cannot kill our way out of this war.”  That is according to our very own State Department.  State Department Deputy Spokesperson Marie Harf told Chris Matthews that we cannot win this war against ISIS by killing them.   So what is her solution to stopping radical Islamic terrorists from murdering and taking over territory?   Job opportunities.  Seriously!?"},{"comment_id":"10154524280341955","commenter_b":"She's corrupt to the core.","commenter_a":"More of the trash that needs to go.","post_message":"Loretta Lynch 'Pleads Fifth' on Secret Iran 'Ransom' Payments..."},{"comment_id":"10153178385132061","commenter_b":"Cheesy come back. You dumb blond.","commenter_a":"She's beautiful. I hope she still likes boys. Maybe she's transgender. Not that I care lol","post_message":"'She's not a girl playing football; she's a football player that's a girl. She plays the game hard, she plays the game tough.' Meet the teen who was only girl, and a co-captain, on her football team: @webpagelink"},{"comment_id":"1015432805157138","commenter_b":"Oh give me a break!! Rape is on a whole other level!!","commenter_a":"This is ridiculous!! He is a legend in the wrestling world. They are letting him go over something that was said 3yrs ago?!!! Shame on WWE!!","post_message":"Reportedly for racist remarks made in 2012"},{"comment_id":"10155873946605354","commenter_b":"Ass wipe.","commenter_a":"Because he's a Libtard","post_message":"Why would a Cuban rapper take offense at remarks against crime by Mexican illegal immigrants?"}]
