[{"comment_id":"10155763487209951","commenter_b":"About time our officers and first responders have someone who supports them, instead of condemning them before the whole story is revealed. Thank you, President Trump!","commenter_a":"Umm gun control. Might help with that","post_message":"WATCH LIVE: President Trump speaks to top police chiefs and sheriffs at the Major Cities Chiefs Association conference."},{"comment_id":"10153308747171037","commenter_b":"Failing to report 1,100 donations and $145 million in donations isn't sinister. It's just a small bookkeeping error. This is how totally out of touch this moron and his wife are.","commenter_a":"And, I did not have sexual relations with that lady, Miss Lewinski.","post_message":"Former President Bill Clinton used his first interview since Hillary Clinton announced her 2016 campaign to address questions about the Clinton Foundation - by Dylan Stableford in Yahoo Politics."},{"comment_id":"10153721547731378","commenter_b":"Says a skinny woman","commenter_a":"Life is short. Eat the cake.","post_message":"Are 'Cheat Days' helpful or harmful to your diet? Some say giving into cravings can decrease your appetite. What do you think?"},{"comment_id":"10153373196639877","commenter_b":"Girl bye !","commenter_a":"SIT UR FACT AZZ DOWN ..AINT GONNA HAPPEN .","post_message":"Wendy Williams wants Terrence Howard fired from 'Empire' because of past abuse allegations. Check out the video clip below.  Grio fam, what do you think of Wendy's remarks? Sound off."},{"comment_id":"10155152237477042","commenter_b":"Everyone without documentation will get deported.","commenter_a":"Here in NY, we have a huge population of illegal immigrants from China, Russia, Israel, and the Middle East. Will they be rounded up too, or do the deportations apply only to Latinos?","post_message":"New guidelines under President Trump greatly expand the amount of people considered a priority for deportation.   Undocumented immigrant suspected, charged, or convicted of a crime (including minor traffic violations) will be at the top of the list."},{"comment_id":"498132093702004","commenter_b":"Simone de Beauvoir said women were their own worst enemies.","commenter_a":"Callous treatment of human life?? Funny coming from a woman who tried with all her power to block her own residents from receiving healthcare under ObamaCare!!","post_message":"Not cool Gov. Haley!"},{"comment_id":"10153876614269024","commenter_b":"Kick this fucker right in the mouth","commenter_a":"What a poor excuse for a Mayor.","post_message":"'@conservativebyt"}]
