[{"comment_id":"10154156813446926","commenter_b":"It is indeed a colony of the US, and it cannot survive without Billions of dollars of aid from their masters. Israelis should decide what future do they want for their children, one in which they are perpetually fighting a war, or one in which they can make peace and learn to live with mutual respect. --- As far as ethnic cleansing is concerned..this is again the same issue. It is only ethnic cleansing when the Jews are forced out of their homes, it is not ethnic cleansing when ZIonist militants throw out Palestinians from the homes they were living in for centuries.","commenter_a":"The way I see it Israelis will be in the Palestinian villages for a long time..... society whose leaders campaign for a convicted terrorist to be given the Nobel Peace Prize, a society that teaches its children hatred and violence as part of its standard curriculum, a society that unabashedly teaches anti-Semitism through all means available, a society that puts suicide belts on children during political celebrations, a society that honors, glorifies and funds terrorists, a society that uses a hateful version of religion to poison the minds of its children, a society that engages in widespread jubilation when Jews are victims of terrorist attacks, is not a healthy society that can develop peace of any kind.","post_message":"#Israel's occupation forces in the #WestBank have used at least three Palestinian family homes as military posts in recent months"},{"comment_id":"10156340374100354","commenter_b":"You my dear are a moron who is helping to destroy your people.","commenter_a":"Scumbag.","post_message":"'Safe negro'?!  Can you IMAGINE the FIRESTORM liberal media would have generated had a conservative said this?!"},{"comment_id":"10156283880180354","commenter_b":"You illegals violated are rights to deport you if you are here illegally","commenter_a":"Good for Texas.","post_message":"“Today’s ruling is an important first step in insuring the integrity of birth certificates and personal identity information.'"},{"comment_id":"1422840444402648","commenter_b":"0 for 3 definitely a malicious prosecution not based on facts evidence or law. they need to sue her and the city of Baltimore.","commenter_a":"I think that this prosecutor did this solely on political reasoning and her office needs investigated","post_message":"Caesar Goodson, one of the Baltimore police officers tried in the death of Freddie Gray, has been found not guilty on all charges."},{"comment_id":"1803726116573607","commenter_b":"Graham disbrow are you on a loop?","commenter_a":"looks like more reporters the protestors.....","post_message":"HAPPENING NOW: Protesters plan to block the Mill Avenue bridge in #Tempe as part of a police brutality demonstration.  WARNING: This is a live feed. Viewer discretion is advised."},{"comment_id":"1260826810599396","commenter_b":"Fuck her","commenter_a":"Carla A. Auguste Imani Rice Qiana Lewis Shequla Mason @username","post_message":"For everyone who hates Sallie Mae..."},{"comment_id":"988047007995144","commenter_b":"She's just womansplaining to him","commenter_a":"That stupid bitch next to him needs to respect other people's turn to speak. How are you going to disrespect another adult like that on national tv? Shushing him?? What a fucking cunt","post_message":"I've literally watched this about a dozen times now (and it gets better every single time)..."}]
