[{"comment_id":"470600046463909","commenter_b":"I will refuse! They have already done enough to erode away our great United States of America. They need to go far away from Washington!","commenter_a":"She is \"one ugly motherfucker\".......to coin a phrase.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153629049609255","commenter_b":"Hey JEB. Your mom called: @webpagelink","commenter_a":"Pay no attention--he's speaking with his head---UP HIS ASS---AS USUAL !!","post_message":"Jeb! Bush, noted women's health expert."},{"comment_id":"10153461487831636","commenter_b":"If this woman is happy to make her money from demonising victims whoever they may be then perhaps the rest of us should just think \"what a vile individual she is\" and distance ourselves. What she has successfully done, again, is to spark a debate about herself . Which is probably earning her a fortune . Stop reading the Daily Mail for a start . Johnson was found guilty in court by a jury. Quite rightly the judgement was made on evidence and fact. Not opinion and scaremongering . Let's just stop giving her air time.","commenter_a":"WTH bloody Katie Hopkins ffs again innit???","post_message":"Her comments have sparked a particularly vocal backlash"},{"comment_id":"734527313335610","commenter_b":"Corina doesn't have a head occupying her brain. She doesn't seem to be aware that Jews have been \"occupying\" that region for 4000 years.","commenter_a":"State who creates biggest terror in the world since 1948 doesn't know anything about human rights.","post_message":"Iranian President Hassan Rouhani famously said in 2013 that ethnicities, all religions, even religious minorities, must feel justice..."},{"comment_id":"1592202987743626","commenter_b":"She needs to go to jail and pay a Big big fine to get back some of those illegal millions she got","commenter_a":"anyone following trump is b😀😀 tshit car cra !!!!!!","post_message":"\"I think [Hillary Clinton's] greatest accomplishment will be getting out of her email scandal.\" — Donald J. Trump @webpagelink"},{"comment_id":"10155469522230354","commenter_b":"Where do these idiots come from on the left, try to bring in women to compete with fox and there is nothing between the ears.","commenter_a":"Those tampon dangles must have penetrated her brain.","post_message":"Believe it or not, it actually gets worse..."},{"comment_id":"1273398092695609","commenter_b":"Rosie is one of the most disgusting women","commenter_a":"protect your kid not your pigs","post_message":"Rosie is disgusting!"}]
