[{"comment_id":"10155795275933294","commenter_b":"Bunch of bull lock all of them up @username bond then they stop this crap","commenter_a":"He got what he deserve and they should get the same","post_message":"WATCH LIVE: Protesters have taken to the streets of downtown Portland, calling for justice for Quanice Hayes, who was shot and killed by police last week."},{"comment_id":"10153619806193984","commenter_b":"Neither!","commenter_a":"Guess Obama can only force Americans to follow his \"laws\" and beliefs ---- he was a tricky and mischievous politician, declared Ethiopian opposition party spokesman Yonathan Tesfaye. today he has become a passionate inspirational human rights activist. Which one should we believe? Which one should we go with?","post_message":"Well, it doesn't look to me like Obama made very many friends during his trip to Africa...  Do you agree that Obama is untrustworthy?"},{"comment_id":"10155089338768984","commenter_b":"AND WHY SHE NOT IN JAIL.","commenter_a":"Seat her in the last row.","post_message":"The Clintons' plan for President-elect Donald Trump's inauguration were just revealed, and it's leaving everyone speechless."},{"comment_id":"752331831534238","commenter_b":"This guy is DANGEROUS!!! USA will not be a safe place if this ass hole wins. countries like RUSSIA! Will declared WAR on USA. He is thinking to pressure MEXICO to pay for a wall base in WAR!!! Mexico has many ALLIES! WWIII Don't make a bad decision people!","commenter_a":"He is the devil","post_message":"Watch Trump directly contradict himself — watch more here: @webpagelink"},{"comment_id":"10154013859753812","commenter_b":"Well let's work and try to keep dump people from getting guns.","commenter_a":"you would be smart Mr President to work on peoples parenting NOT GUN CONTROL, guns dont kill dumb people do","post_message":"President Obama plans to sit down with Attorney General Loretta Lynch after returning from his Hawaiian vacation to discuss gun control options. @webpagelink"},{"comment_id":"10155817024445192","commenter_b":"If she has an abortion, there is no child support. If you have the kid, they have to eat whether you like it or not.","commenter_a":"Women say it's thier body until it comes to child support. Then is both. Hmm mm if abortion is legal because of pro choice then child support should be pro choice too.","post_message":"A Florida judge is blocking a new state law that requires women to wait 24 hours before getting an abortion."},{"comment_id":"845732068898255","commenter_b":"bring all our soldiers home to protect us from the illegals, n's, and queers. let those other countries fight their own battles. money paid by americans stays in america","commenter_a":"I told you from day 1. We Americans are so super sick and tired of you liberals and media trying to water down America. We're sick and tired of you trying to pussify America. We're sick and tired of you trying to force liberalism down our throat. So guess what ? Open wide because now you forced us to shove Trump down your throat !! Enjoy !! We just got our balls back !! Liberals and socialists suck ... They don't like guns, So they don't think you should have one. They like social programs, So they think you should pay for them They don't like religion, So they don't think you should be religious They like abortion, So they think you should like abortion They hate success, So they think you should pay more taxes. They elected the first Muslim president, So they think you are a racist.","post_message":"ClashDaily.com"}]
