[{"comment_id":"575480735957321","commenter_b":"I'd rather listen to a milk cow","commenter_a":"Go 3rd Party!","post_message":"Watch the final night Republican Convention live with NPR and PBS NewsHour. Donald Trump accepts the party’s nomination tonight and makes his case to be the nation’s next president. Scheduled speakers include: Brock Mealer, Marsha Blackburn, Mary Fallin, Lisa Shin, Reince Priebus, Peter Thiel, Tom Barrack, Ivanka Trump and Donald Trump."},{"comment_id":"699619480228630","commenter_b":"@username RE-MOVE HEAD FROM ASS","commenter_a":"....and, Obama let Putin become the Hero of this War on ISIS!","post_message":"Russia is relentless bombing ISIS until they are completely destroyed. We are fully behind them. This is what needs to happen. Can we get 75,000 'LIKES' for Russia?"},{"comment_id":"10156257885050389","commenter_b":"What the hell are they waiting for?? Indict her already !!!","commenter_a":"she sure is aging fast","post_message":""},{"comment_id":"409554185871204","commenter_b":"Like we could depopulate people that breed like rats.","commenter_a":"Depopulate Mexico is the name of the game. Guess who benefits?","post_message":"The case of the 43 missing students in Mexico has galvanized discussion and efforts to locate thousands of others who remain missing."},{"comment_id":"1734707080142446","commenter_b":"@username fuck outta here!!! Hahaha biggie pulled more bitches!!!!! REALIZE THAT NONE OF THOSE FEMALES U NAMED IS BAD ALL UGLY ASS HOES!! THE BEST LOOKIN FEMALE BIGGIE GOT TUPAC FUCKED (Faith)!!!!! Jada Smith shut biggies females down lol","commenter_a":"Biggie, cus todays people are too stupid to understand Tupacs lyrics lol","post_message":"VOTE NOW! 2pac vs. The Notorious B.I.G. -- Who'd be bigger today? #DEWcision2016 #sp See how your fellow hip-hop fans are voting here..."},{"comment_id":"10153130276219071","commenter_b":"Want to know who fought against any and all mental health checks for firearm purchases? The ACLU and liberal groups...that's right...the ones screaming the most about \"guns\" are the ones with \"Blood on their hands\".","commenter_a":"All these gun nuts won't even consider the possibility of mandating thorough background checks before purchasing a gun. That's all that is necessary in my view. Instead they keep covering their ears and screaming \"taking away our guns won't change anything\". People wanting better gun control legislation don't necessarily want to take away normal/healthy/stable/non-criminals ability to purchase guns, we just don't want any psycho to be able to walk into any store and purchase a gun in 5 minutes.","post_message":"He says he's shocked that his son owned 14 firearms."},{"comment_id":"10153266988046636","commenter_b":"Nah that doesn't bother me, I'm a risk taker the rest of the time","commenter_a":"things like this make me nervous of going to London most weekends","post_message":"Police say they are treating it as a 'terrorist incident'"}]
