[{"comment_id":"10153840102456523","commenter_b":"Your ignorant Jessica. Just Stfu","commenter_a":"Gang members shoot people to they do drive byes or just randomly shoot somebody it could be any if us blk kill blks latinos kill latinos white kil whites wow only in America","post_message":"The graphic video shows the three men listening to music, and a man in the front passenger seat holding the phone.   Suddenly, the phone drops to the floor of the car as what sounds like at least 30 gunshots can be heard in the background."},{"comment_id":"450316191825628","commenter_b":"Fuck that dumb bitch!!!!!!!!","commenter_a":"bye bye Michelle, go peddle crazy some place else. Go ask the thugs in Chicago for their guns first. Try going there without a cop. LOL","post_message":"Will You Refuse To Turn Over Your 2nd Amendment Rights To Michelle?  Comment 'yes' or 'no'."},{"comment_id":"1421875981165778","commenter_b":"I had heard that too but I'm not sure where to pick up meatloaf in D.C. . I wouldn't put it on the taxpayer to feed me at the White House, I just want to have the face to face.","commenter_a":"Invite me for dinner at the White House, I'll say it to your face. For real, I'll even spring for the Kentucky Fried Chicken.","post_message":"Trump sounds off on what he considers fake news: \"A source says that Donald Trump is a horrible, horrible human being. Let em' say it to my face.\""},{"comment_id":"1805566076381553","commenter_b":"Leave it alone!!!!","commenter_a":"I vote no!!","post_message":"They are going to change Ole' Glory to this! Leave our flag alone. Do you think the American flag should not be altered?"},{"comment_id":"414886538699640","commenter_b":"She needs to keep her legs closed and get a f*^king job....lazy ass","commenter_a":"That's sick","post_message":"She wants one more HUGE favor from us..."},{"comment_id":"943670819034115","commenter_b":"lol..that is a joke...that skank aint pretty at all..not cause her skin color..its because shes ugly..Id rather hit precious","commenter_a":"She is the most racist, evil, conniving bitch to ever be in the white house! With her 22 \"assistants\"! And you know most of them are probably white so she can treat them like slaves!","post_message":"Americas Freedom Fighters"},{"comment_id":"10157399464465093","commenter_b":"A hun will never kill anyone! Its the people that use them! People kill people! Criminals get them illegally and you can't stop that! It is not possible! Give me a reason why you think criminals should only have guns?","commenter_a":"Yes but 100% of gun crimes involve guns, so start with the legal gun owners because it's way easier, and it looks like we're doing something.","post_message":"Pass it on."}]
