[{"comment_id":"10152958959170927","commenter_b":"she can give up citizenship which is just fine with me, at least in this country she can say this stupid remark, want to try to do so say in Hungry","commenter_a":"Leave","post_message":""},{"comment_id":"10153150465564255","commenter_b":"Because man created god in his image and saw that it was good.","commenter_a":"well one thing it never said JESUS was ethiopian and he was born in bethleham so Jesus 90% chance was not black but i do not see why it makes a difference","post_message":"Why do churches use a historically inaccurate image?"},{"comment_id":"10153189105981336","commenter_b":"The pansies out there today would be a total embarrassment to this country. They would all turn tail and run. No backbone, no moral compass, no strength and no sense of reality. I blame the coddling society and the progressive liberal media.","commenter_a":"start the draft back up ...let these boys do a few years in the service","post_message":"Frat boys from the University of Florida and Emory University have been accused of urinating on an American flag, spitting on a vet and a service dog, and making derogatory comments toward veterans’ wives.  And that was just the beginning…"},{"comment_id":"10152987066401336","commenter_b":"She is a f*&king idiot","commenter_a":"Once again the State Department speaks nonsense. Save your money - don't send your kids to Universities if she is any example of what they are turning out.","post_message":"“This is an insult to all the people in the world who are actually poor and are not blowing people up and not targeting Christians.\"  Laura Ingraham slammed U.S. State Department spokesperson Marie Harf’s suggestion that job opportunities are a way to fight ISIS. @webpagelink"},{"comment_id":"10157824241580354","commenter_b":"Convert them or kill them.","commenter_a":"People who want to believe in Muslim as a religion should first understand how it was started and read a book called THE STORY OF MOHAMMED BY Harry Richardson .This book is where Islam started and who started it . It's a paper back book takes about 3 hours read it it tells you how thus Prophet Muhammad where it came from and how it all started. It tells you how this guy was nothing more than an outright murder a thief and kill everybody who didn't agree with him now people show up and tell you that Islam is a peaceful religion that guy would be nuts to believe that this book was done a great research and there's nothing peaceful about this guy named Mohammed take it upon yourself to read","post_message":"“We must not be afraid to approach and contend with the complexity of Islamic law and history, the good, the bad, the ugly and the viciously anti-democratic.”"},{"comment_id":"1055171694505347","commenter_b":"If that woman is not tortured in hell eternally, then God does not exist... and let me TELL YOU something. He does.","commenter_a":"Where is Russia's outrage? Where is this woman now?","post_message":"Horror in Moscow: Woman in burka walks streets carrying child's severed head..."},{"comment_id":"10153174916561130","commenter_b":"Poor, sad, hatful women. I feel bad for you.","commenter_a":"homsexuals force their wicked ways on everyone. Shame on them. Homosexuals lust not love..","post_message":"Humans aren't the only ones celebrating the SCOTUS decision."}]
