[{"comment_id":"10154291212970329","commenter_b":"hahahaha!! for real though!","commenter_a":"Hahaha @username Alyssa Purnell Mimi Zink @username @username","post_message":"oh heeyyyy (via So Relatable)"},{"comment_id":"10154448995838812","commenter_b":"@username what makes her uneducated?","commenter_a":"And people seriously want to elect him president?!? Get a clue!!!","post_message":"New York's attorney general says he won't be deterred in pursuing the state’s case against Donald J. Trump and Trump University, just because the defendant is campaigning to be President of the United States."},{"comment_id":"10158091047615293","commenter_b":"Even Medicaid charges copays now. Where before ACA it didn't.","commenter_a":"It can't be any worse, drug prices have more than tripled over the last 4 years, Not to mention blue cross going up and more than doubled their premiums over the past few years. Blue Cross gets 300 bucks of our paycheck ever other week, and that's our part the company matches that, you add that up. 1200 a month for family coverage.","post_message":"What will healthcare look like under President Trump?  Tell us what you think in the comments below."},{"comment_id":"581929555264971","commenter_b":"They need to be sent back to their own country, period! !","commenter_a":"I am getting to the point I really do dislike the new media, they are a bunch of useless asses","post_message":"The city of Twin Falls first made headlines when Muslim migrants sexually assaulted a five-year-old. Now another sex crime, this time against a disabled girl, has rocked the community. You won't see this story in the mainstream media."},{"comment_id":"943053922418420","commenter_b":"It's like 5 minutes and it's good. Watch it goddamn!","commenter_a":"@username watch the video xo","post_message":"Alan Watts delivered this profound message decades ago, and unfortunately not much has changed.  Vis Reset.Me"},{"comment_id":"1239847632704451","commenter_b":"Hillary is the Unindicted Felon!","commenter_a":"That is exactly what pisses me off the most, to see the wealthy paying zero taxes! I pay taxes so I make my contribution to our government just like millions of Americans do! It sucks, really sucks! And then to say it is smart not to pay taxes on National TV? That is an insult to the American people! Bragging about it makes me think that those who support this clown have something wrong in their heads, period! Is this the kind of Commander in Chief we want?","post_message":"There it is, folks!"},{"comment_id":"1157175910989546","commenter_b":"Why would ANYBODY admit they were a Republican after this years parade of idiots, never mind vote for them?","commenter_a":"Assholes are use of SHIT !!!!","post_message":"Three Republican presidential candidates befriend a pastor who just went on stage and gave the most bizarre anti-gay speech ever."}]
