[{"comment_id":"1042018525819158","commenter_b":"This ladies dumb AF","commenter_a":"It should have been there when it could have helped my husband before he died. It doesn't matter much now whether they develop it or not. It can't help him now.","post_message":"A breath test for lung cancer could be on the horizon."},{"comment_id":"10153364798139877","commenter_b":"Robin! Amen! Everybody wrong for agreeing with that old woman!","commenter_a":"She is so wrong , she is not the Pastor nor is she the head of the Church. So far out of place in the Church , just because you put in a offering or your family started the church its not your church nor are you the Pastor. Dang shame! Guess she wants to go to hell in a hand basket.","post_message":"103-year-old woman who was kicked out of her church clapped back...now the pastor is in hot water. Watch what happened next below.   Grio fam, we're glad she put up a fight. What's your reaction?"},{"comment_id":"10153220731196234","commenter_b":"She should be fired and thrown in jail","commenter_a":"Should have had her license taken away!","post_message":"The nurse who re-used syringes for the flu vaccine at a West Windsor company has agreed to a temporary suspension of her license."},{"comment_id":"10155455804716729","commenter_b":"Not to mention the innocent lives that will be saved.","commenter_a":"I don't care who pays for it, just build it. Ultimately it will pay for itself","post_message":"Ain't that something?"},{"comment_id":"786188861571691","commenter_b":"That is stupid why can't the welfare people get a job and beside who going to pay for their car insurance and car payment get real","commenter_a":"This is not true.if so think about the timing of it Killary is losing against Donald Trump and she is going to try and bye your votes but we are all to smart for that","post_message":"Congress Approves Bill Offering Free Cars To Welfare Recipients. Your tax dollars hard at work. Does this disgust you?"},{"comment_id":"482111261979454","commenter_b":"She is in another country Germany . We have No rights there to forbid it. But in our country that's a different story all together. If swimming in a public facilities she should abide by laws of that community or township. If theme parks can refuse for you to wear cut offs then the should forbid that attire, and get out. They have more than enough money to put in their own pools. Our own laws presented by our President is destroying our country from within.","commenter_a":"This is going to far!!!","post_message":"A judge just ruled that public pools must allow Muslims to swim in 'Burkinis'.  We're tired of Muslims infiltrating our country. This stops now.  Do you agree that 'Burkinis' are WRONG?"},{"comment_id":"10153236648136167","commenter_b":"Pretty sure that Mika just","commenter_a":"MSNBC is such an embarrassment to itself.","post_message":"Hours after MSNBC itself reported that this lie was debunked, Joe Scarborough was still pushing it."}]
