[{"comment_id":"10154406219790329","commenter_b":"She's taking the piss out of men who try to compensate for their little sausages, get it now?","commenter_a":"Jacqueline Boggs","post_message":"\"My vagina just sneezed, judging from my underwear.\""},{"comment_id":"853806161323392","commenter_b":"Ya I always thought she was odd shaped... not anymore. Taylor is way hot","commenter_a":"Smart girl: screw the paparazzi out of a big pay day and staying true to her values; all while looking gorgeous and being a positive role model for girls everywhere.","post_message":"She had a good reason – and it wasn't vanity."},{"comment_id":"10157243305955354","commenter_b":"Then get to work.","commenter_a":"She could move out of her government subsidized housing if she actually had any employable skills.","post_message":""},{"comment_id":"10152790927666051","commenter_b":"Sport illustrated is worse, these are woman with their babies, that's all. No big deal.","commenter_a":"Kai","post_message":"This woman was very surprised when her photos were removed. She didn’t think they were inappropriate at all. Decide for yourselves whether they should’ve been taken down."},{"comment_id":"821190501249706","commenter_b":"just his type, they can have fruit loops together","commenter_a":"Yeh but our leader will meet with a woman eating fruit loops in a bathtub! !! POS","post_message":"The White House is FURIOUS with Boehner for breaking protocol! Looks like somebody doesn't like the taste of their own medicine!"},{"comment_id":"777437579026197","commenter_b":"No I think the lying words wouldn't come out,she was choking on them.","commenter_a":"BS","post_message":"I don't think she had ANYONE fooled..."},{"comment_id":"458683577589570","commenter_b":"Negotiations are not PC, you get what you can out of your adversary ! GO AMERICA, to hell with \"global niceties !","commenter_a":"The author is racist against Asians. Trump is not","post_message":"Donald Trump shows that he's not afraid of anyone, especially people from other countries that he does business with every day."}]
