[{"comment_id":"483277565194949","commenter_b":"Jesus wouldnt like that she kills babies for a living.","commenter_a":"So sorry you folks are tearing this young woman apart, would Jesus do this?","post_message":"What'd you think, folks?"},{"comment_id":"1277527375611846","commenter_b":"@username, and you KNOW she absolutely will DO it, too!","commenter_a":"This election isn't about picking a president! It's about the Law..Yes the Law!!!!USA Law against Sharia law!! Wake up Americans, don't you Dare be fooled,don't you Dare wear the Americans are stupid label, show all those countries out there that your a brilliant Mind and your family will make a smart choice in votes for your Country and what it stands for! God bless our way of life.Amen","post_message":"Anti-Christian extremists are demanding that senior U.S. military chaplains be investigated and punished for praying in uniform. Sign our petition to fight back. We must defend our brave military chaplains."},{"comment_id":"10153123243420950","commenter_b":"Love that show!","commenter_a":" and still my favorite show","post_message":"Betty White is the lone survivor of the cast; RIP Bea Arthur, who played sensible Dorothy Zbornak, Estelle Getty, who portrayed Dorothy's mother Sophia Petrillo, and Rue McClanahan, who played the sultry Blanche Devereaux. The show lives on, though."},{"comment_id":"687880108038609","commenter_b":"of course they arn't all murders and gang members that's why the wall will have a door or did you miss that part in the cnn chopped up version of that speech? the ones who want to be Americans can stay the rest can f off.","commenter_a":"These comments are disturbing. These are parents, children, families...not murders, drug dealers or rapists. Instead of \"building a wall\" or treating them like shit we should be coming together with Mexico so that they don't need to come here. They need help, we have a problem, so why are the two countries not putting their heads together to figure out a way to HELP","post_message":"Thousands of Central American children and families are arriving in Texas."},{"comment_id":"974731595926313","commenter_b":"Kyle Francis","commenter_a":"Sarah you wonder why I despair......... Senor Berm Eileen","post_message":"We didn't think the 2016 election could get any more bizarre, but Sarah Palin and Donald J. Trump proved us wrong yesterday."},{"comment_id":"543745795816000","commenter_b":"We need to start carrying bacon with us and when they disrespect an American Bitch slap them with the bacon.","commenter_a":"Yes,yes! Or send their butts back! We don't want them here!","post_message":"This Fox News reporter was absolutely disrespected by these Muslims. They are out of control. If Muslims are going to live in our country they need to learn some manners. Do you agree Muslims have to assimilate or get out?"},{"comment_id":"10153375690709087","commenter_b":"Stop any and all immigrants from coming in until we can financially take care of our own first","commenter_a":"Even BB knows it's not just a \" religion\"....","post_message":"Benjamin Netanyahu - בנימין נתניהו \"rejects Donald Trump’s recent remarks about Muslims,\" the Israeli Prime Minister's office said in a statement. \"The State of Israel respects all religions and strictly guarantees the rights of all its citizens. At the same time, Israel is fighting radical Islam which is attacking Muslims, Christians and Jews alike and threatens the entire world.\""}]
