[{"comment_id":"1833117833414623","commenter_b":"Migrants coming in to work for the NHS?","commenter_a":"its only going to get worse with all the immigrants coming in","post_message":"Worst NHS week in 15 years"},{"comment_id":"835165216569680","commenter_b":"Don't accept it. Doesn't matter to me. I still have the right to marry...whether you like it or not.","commenter_a":"We Christians do not recognize this, not accept this, just ignore this. Just because MAN says it does NOT mean it is true. God is our Commander, Lord and Leader. Whatever He has stated is so; with His statutes we will stand, and believe Him forever. Look up everyone, for our redemption draweth nigh. . .","post_message":"So much for state rights. Where do we go from here? #SCOTUSmarriage"},{"comment_id":"10153177942114170","commenter_b":"Once a LIAR, always a LIAR! But what difference does it make at this point! Hillary is Obama in a skirt! Another Democrat that Bows to ISLAM and leaves Americans being attacked by Muslim Terrorists, TOO DIE!","commenter_a":"She should go to jail rather than the White House. Worst Secretary of State ever along with Obama the worst President ever.","post_message":"How stupid does she think we are?"},{"comment_id":"451531238383723","commenter_b":"she also thinks we can't deport 20 million illegal parasites. boy is she in for a big surprise. a needy, insecure, unaccomplished , doormat to a serial women abuser.","commenter_a":"Have fun I will not hand mine over","post_message":"Hillary Clinton is Coming for your Guns!"},{"comment_id":"10153672228046130","commenter_b":"She's not plus size... She's average!!!!!","commenter_a":"How hilarious.","post_message":"A trailblazing move by Sports Illustrated Swimsuit."},{"comment_id":"10153867352421756","commenter_b":"No, it actually wasn't. Students were allowed to carry. The fact that students were allowed to carry may explain how the shooter got to the classroom carrying a long gun without being stopped. He wasn't doing anything illegal until the second he opened fire. Surprise, everybody!","commenter_a":"survived the army to be shot in college, go america","post_message":"It's emerged that the 30-year-old father ran at the attacker, trying to block the door to a classroom to protect his classmates — and suffering several bullet wounds and two broken legs in the attempt, according to his family."},{"comment_id":"10153597569599411","commenter_b":"'@Zoran...again, you get a life...we are pretty happy and fine. Not like a poor illegal immigrants as Zoran trying to stay in the west....","commenter_a":"No one should feed barbarian Russian junta fascism invaders.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
