[{"comment_id":"419035241611690","commenter_b":"Ladies, use what ever you want, it is no one elses business","commenter_a":"Idiot !","post_message":"This GOP legislator has invented new female anatomy."},{"comment_id":"1172494429493450","commenter_b":"These dumbasses should be ashamed ... No one will ever vote for either of these liars again . No Honor ..No Vote","commenter_a":"These three men will never get my vote in the future. Anyone that is with her is corrupt... Republican or not you need to go.","post_message":"GOP 'Never Trump' Candidates get a Warning"},{"comment_id":"1236409066433862","commenter_b":"Clifford Maclean Losee","commenter_a":"Save your money you bunch of fruit cakes!!!! You might be able to afford things if you would quit donating to lost causes!","post_message":"Michigan certifies President-elect Donald J. Trump's win in the state, awarding him 16 electoral votes. @webpagelink"},{"comment_id":"10152698000912452","commenter_b":"I would still as long as she doesnt talk.","commenter_a":"Jessica acting like she ain't asking for attention lol girl you would be doing the same crap. Earn the beads Jessica","post_message":"UPDATE: The girl in the photo had been identified. She is 17 years old and does not attend college. Although she says her interaction with the group was consensual, she did not realize her photo was being taken. @webpagelink  Do you know her? Police in Florida are concerned this spring breaker, spotted in naked photos, may be in danger."},{"comment_id":"908720232539273","commenter_b":"Oh Mr Trump , I personally can not wait for you to be our New PRESIDENT! All these people saying they are going to leave, I sure hope they do , to bad you can not make it a law that they have to, American might just be s better place without these people. You raised 6 million for the vets what did these people do ??? Besides complain they need to put their energy towards something positive instead of trying to find negativity. Great Job Mr further PRESIDENT TRUMP","commenter_a":"idiot,trump cant do any worse than dumb obama n our stiupid ripoff goverment'get real","post_message":"A majority of people said they would go to Mexico."},{"comment_id":"1038011639567708","commenter_b":"Hell no, look at her go though Kalen would move","commenter_a":"Wtf imagine if this was kalen lol @username","post_message":"At 6 months and 27 days old, little girl breaks the record for the youngest person to ever water ski. @webpagelink"},{"comment_id":"1172821626098535","commenter_b":"She needed to be shut down 20 years ago!!!!","commenter_a":"What kind of a statement would you expect from somebody as stupid as she is. Her brain is lacking in intelligence","post_message":"Whoopi Goldberg got shut down."}]
