[{"comment_id":"10154664462516337","commenter_b":"Blaming a group of people before you even know the full story = ignorance","commenter_a":"Please bring more Syrian refugees to this country","post_message":"Explosions and IED discoveries continue to rock the northeast."},{"comment_id":"10153007024072894","commenter_b":"He dumb why have that baby get close to him if he didn't know for sure if she is his baby he should've got that done first","commenter_a":"Maury would have done it for free","post_message":"Chris Brown Files Petition to Establish Paternity of Daughter Royalty"},{"comment_id":"1911868089040262","commenter_b":"Who are they surveying because not all people thinks Asians aren't hot","commenter_a":"Kyan Khalil Khalili-Broojeni heyy","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"10154289283474149","commenter_b":"Why does she keep hitting he neck","commenter_a":"Push it out already lol.","post_message":"We're on #GiraffeWatch2017! When do you think the baby giraffe at Animal Adventure Park will make its debut? Read more: @webpagelink"},{"comment_id":"10153302631606636","commenter_b":"@username first claimed that all Muslims were terrorists and then claimed that any who thought so we're bigots. She must be so ignorant that to think that there are others that cannot read fast and with great stamina farer than her thoughts drivel out.","commenter_a":"Let me tell you there is no moderate or conservative Islam. Islam is Islam. There are not two Islams. Let me also mention that anybody harming any innocent person has nothing to do with Islam.","post_message":"It strictly follows Sharia rules"},{"comment_id":"10153458857456107","commenter_b":"Keep them out.","commenter_a":"As an avid, long-time, supporter of your campaign (I mean... I was hoping you'd run for president back in '04), I am very disappointed to see you taking this fearful and outdated stance. Isis doesn't need refugees to sneak into our country, they have the internet.","post_message":"Today I introduced a bill that calls for an immediate moratorium on visas for refugees. My bill will also stop all refugees as well as others from obtaining visas to immigrate, visit, or study in the U.S. from about 30 countries that have significant jihadist movements. This bill will be paid for with a special tax on arms sales to any of these countries. Read more here: @webpagelink"},{"comment_id":"1142065182546406","commenter_b":"Bye... That just means another wall.","commenter_a":"California can secede from us like texas did. Theyre their own entity but it comes with a price to pay. The time when earthquakes peel it off the rest of the world they can b their own saviour!","post_message":"They're calling it #Calexit"}]
