[{"comment_id":"662343567228023","commenter_b":"Great Woman!","commenter_a":"Wonderful tribute","post_message":"I wanted to highlight a few women in my life who inspire me every day. My wife, Columba, for her work to curb domestic violence and for so much more. My mother, Barbara, who has been a tireless advocate for literacy for a quarter century and Toni Jennings, who was a fantastic partner and Lt. Governor of Florida. These women are all examples of what can be achieved when we #LeanInTogether"},{"comment_id":"1287415054614429","commenter_b":"@username If SCOTUS is majority conservative, and I'm sure it will be, they won't overturn any of this because they don't care about the wellbeing of this country or its people.","commenter_a":"Wanna bet? First, women have been ending pregnancies for millenia and nothing the Kentucky Legislature can do about that. Second, with Roe V Wade the law of the land, any attempts to ban abortion will be overturned. Third, the so-called \"pro-lifers\" will not always be in total control of Kentucky and what this Legislature might pass can just as easily be thrown out.","post_message":"For the first time in 95 years, Republicans took total control over the Kentucky state government this week and immediately moved to strip rights from women and workers."},{"comment_id":"10153538979824117","commenter_b":"I feel like this world lacks sufficient moons for McAfee to howl at. I hope one day he can find his way home.","commenter_a":"Bye Felicia.","post_message":"Unverifiable accusations of skulduggery aimed at former Gov. Gary Johnson, and competitor John Mcafee says he cannot support the Libertarian Party if Johnson is the nominee."},{"comment_id":"573866436115635","commenter_b":"She'll stand before God. Wouldn't want to walk in her young shoes","commenter_a":"Jennifer who?","post_message":"She's the biggest actress in the world right now, and Jennifer Lawrence has made an absolutely sickening statement about Christians. This is enough for me to want to boycott her movies from now on."},{"comment_id":"10154589059624087","commenter_b":"If you look real hard you may find your own identity or Soros'","commenter_a":"Questions: How many states do we have? What was actually written on that red, plastic button your mommy brought to Russia to reset our relationship? Did the crippled man Biden ask to stand up ever...stand up? What exactly is a CORPSEman? Hmmmmm....perhaps you should stfu?","post_message":"\"What happened in Sweden Friday night? Did they catch the Bowling Green Massacre perpetrators?” Chelsea Clinton tweeted."},{"comment_id":"10154886210018984","commenter_b":"If you assholes would only enforce our freaking laws there would be no need for the wall!","commenter_a":"The US can do anything when it puts it's people to work. Understandably, a physical wall can not be built in certain areas but our very brilliant problem solvers will find solutions for that. OBAMA never wanted to secure the border. Trump will turn loose the ingenuity of AMERICANS & the job will be done.","post_message":"The Republican Party is not wasting ANY time. Right after Donald Trump defeated Hillary, the GOP let everyone know where it stands on the wall..."},{"comment_id":"10156329985125354","commenter_b":"Stupid Hoe","commenter_a":"One Day ,,,Every Knee Will Bow and Proclaim Him Lord, including you Ms,Johansson...that is the day you will give an answer for this horrible mocking of Gods word you have done","post_message":"Surely Scarlett Johansson is working on a Koran version as well. Surely that's happening, right?"}]
