[{"comment_id":"10153260031480095","commenter_b":"Please remove the ones that are already here and close our state's borders to all of them. This is a matter of defense, not of immigration.","commenter_a":"#LetThemInBobby Rescind your order! You are an embarrassment and I am ashamed of you.","post_message":"I just signed an Executive Order instructing state agencies to take all available steps to stop the relocation of Syrian refugees to Louisiana. The Obama administration continues to fail to provide critical information to state government or local authorities and has intentionally kept our state in the dark about their irresponsible refugee relocation plans. This is a matter of national security and a matter of Louisiana’s security. I will do everything in my power to stop this from happening."},{"comment_id":"1293464810706279","commenter_b":"Foolish talk from a foolish woman","commenter_a":"Try retraining the dumb crooks and thugs!","post_message":"@webpagelink"},{"comment_id":"10152687758547093","commenter_b":"That woman has NO business with a baby.","commenter_a":"Wat is happening to these people ADOPT a baby,dam.","post_message":"HORROR: This woman is accused of cutting the baby out a pregnant mom who answered her Craigslist ad for baby clothes... @webpagelink"},{"comment_id":"10155415846376509","commenter_b":"Money time you know it","commenter_a":"Vinny","post_message":"New video shows power lines exploding on Merritt Island, Florida, as Hurricane #Matthew lingers just offshore. More footage from Florida as Matthew hits: @webpagelink"},{"comment_id":"10153512388783812","commenter_b":"She is not dark skinned!!! I sorry she is screwed up!","commenter_a":"Love her tan. What's her secret? Lol","post_message":"A timeline of Rachel Dolezal's transition from a young white girl with blond hair to a darker-skinned leader in the country’s oldest civil rights organization: @webpagelink"},{"comment_id":"10153138059356336","commenter_b":"Why women think they have to expose most all of their boobs is beyond me. Not sexy at all, just crude and tasteless","commenter_a":"Need to prove it? Does not \"represent\" anybody.","post_message":"\"I decided that I wanted to do it not only to represent myself as a professional athlete and a golfer, but to represent just all women athletes in general.\" LPGA golfer Lexi Thompson appeared on 'Fox & Friends' to address criticism of her controversial \"GolfDigest\" cover photo."},{"comment_id":"10153113901480329","commenter_b":"Maybe she cover her face too in case it incites men to rape her. #goodgrief","commenter_a":"Bahaha! Don't flatter yourself lady. You're no Kate Upton!","post_message":"A Christian blogger has caused a stir online after publishing a blog post about her decision to stop wearing yoga pants because they cause men to think “lustful thoughts”."}]
