[{"comment_id":"1297641203604631","commenter_b":"She makes me want to throw up.. A big rich phoney.","commenter_a":"She don't make me feel anything. Politics does not dictate what I feel","post_message":""},{"comment_id":"1289811051085647","commenter_b":"Nothing prepares your for a move a bitch ass pussy makes smh","commenter_a":"Always gotta be ready. I definitely think it was a pussy move though","post_message":"What a cheap shot! #mma #cheapshot #wshh www.worldstarhiphop.com/videos/video.php?v=wshhfsWHNoydsw8M0AY7"},{"comment_id":"10153713889518869","commenter_b":"this particular immigrant is a whore.......you dont get a pass for being an immigrant......","commenter_a":"an Immigrant bar whore toy bought by Donald....the end.","post_message":"The couple's courtship story is as chaste as its backdrop is louche: Donald saw Melania at an event, he asked her for number, but Donald had arrived with another woman—so Melania refused. He persisted."},{"comment_id":"10153058205158984","commenter_b":"Good job, give the woman a raise.","commenter_a":"Would her employer be happier if she was the one who was shot??? I commend her for having the courage to stand up for herself","post_message":"I don't think this robber thought that holding a woman on the ground at gunpoint would land him a bullet to the face, but this gal delivers more than just pizzas! Do you think this woman should be afraid of getting fired for defending her life?"},{"comment_id":"10153641804123487","commenter_b":"\"Staying Power\"....\"Explodes\"....Politics is so sexual.","commenter_a":"Who cares about the xenophobe clown? Why don't you cover the candidate with more real ideas: @webpagelink","post_message":"The GOP is doing some soul searching.."},{"comment_id":"903353419700080","commenter_b":"She is so nasty looking all the time I bet she stinks","commenter_a":"What is Always wrong with her tongue? Personal hygiene is a must. Can someone tell her to brush it .","post_message":"Awesome!"},{"comment_id":"10152959541546519","commenter_b":"But it's totally cool that the white women told the black kids to go back to their Section 8 housing, right? Ugh.","commenter_a":"I truly wish people would read the whole story before commenting. This was one of 2 cops (until backup arrived) who had just been charged by dozens of young adults and teens. He has every right to fear for his safety...AND he has every right to restrain a \"kid\" who is illegally trespassing in a gated community and trying to run every chance she gets.","post_message":"This cop picked the wrong kid to harass and abuse..."}]
