[{"comment_id":"1007967755882148","commenter_b":"All parents need to step up and take charge like this mom. There would a lot less bs going on with teenagers these days.","commenter_a":"that it's mother style similar to CUBAN MOTHER BRAVO;MOTHER UNITED ja,ja,ja toma pelona qien lleve los pantalones a la hora de mandar.I ALWAY SAID TO MY SON THE DAY THAT YOU TRYING TO GOES OVER ME UNTIL THAT YOU GOES TO KNOW WHO IT'S YOUR MOTHER NEVER TRY","post_message":"Be sure to LIKE WND.com to stay connected!  @webpagelink"},{"comment_id":"10153667597986770","commenter_b":"She belongs in prison!","commenter_a":"Prison","post_message":"Hillary Clinton thinks she should be president. But does she really belong in prison? @webpagelink"},{"comment_id":"931354546899967","commenter_b":"beggars can't be choosers. Get off food stamps and work harder if you want all hala food. Ungratefully, entitled beggar","commenter_a":"If you don't like what here already go home. We dont owe you anything.","post_message":"Shameful and UN-AMERICAN!"},{"comment_id":"10152633154612452","commenter_b":"You do know I meant loving","commenter_a":"@username living all the comments. Brian Williams lol","post_message":"DRAMATIC PHOTOS: Two police officers were able to save a woman trapped in a sinking BMW after smashing the vehicle's rear windshield. @webpagelink"},{"comment_id":"10153682330001037","commenter_b":"She's nuts.","commenter_a":"Just sad","post_message":"“I honestly regret what I have done and take responsibility for it,\" wrote Petra Laszlo in a letter to a Hungarian newspaper."},{"comment_id":"1049317721755905","commenter_b":"full retard mode: engaged","commenter_a":"This is the evidence of existence of Allah !!!","post_message":"Our brains are truly amazing.  By Emily's Quotes, via AsapSCIENCE."},{"comment_id":"1001534043242046","commenter_b":"Nice thought but it's an AMERICAN FLAG on a WHITE MAN'S PROPERTY that's also a VETERAN. Need I say more Nick as sad as it is he is still defending his FREEDOM, his CONSTITUTIONAL RIGHTS, the AMERICAN FLAG and this ONE NATION UNDER GOD.","commenter_a":"I just hope he called the cops because it could be a hate crime, and its attempted arson,","post_message":"Marine Vet Who Flown an American Flag in His Front Yard for 15 Years Wakes Up to a Sad Sight:  Can They Do That? (VIDEO)  PROUD AMERICANS ARE UNDER ATTACK!   @webpagelink"}]
