[{"comment_id":"10156232723535354","commenter_b":"There is no viable comparison to prohibition. This is not a gun ban. It's apples and oranges. This is simply sensible purchase laws.","commenter_a":"The answer to something like this is not more laws imposed by a federal government. It never works, it never will. Did prohibition prevent alcohol consumption? After prohibition alcohol became more dangerous to consume; crime increased and became ; the court and prison systems were stretched to the breaking point; and corruption of public officials was rampant. Prohibition removed a significant source of tax revenue and greatly increased government spending. It led many drinkers to switch to opium, marijuana, patent medicines, cocaine, and other dangerous substances that they would have been unlikely to encounter in the absence of Prohibition. Now we have the \"War on Drugs\" has that worked? Has Lyndon B Johnson's war on Poverty reduced poverty? It's been 50 years and it appears to be getting worse every year, there are approximately 100 million americans receiving some type of government assistance, an all time high. Has the department ...","post_message":"\"This makes Mercer just one more public attacker who cooperated fully with all gun control, then went on to commit heinous crimes against innocent life.\""},{"comment_id":"10154898475594657","commenter_b":"Trump Beat Trump.","commenter_a":"Bunch of lying scumbags! They've always known that Trump was going to crush them. They scurry around like the rats they are, searching in vain, for a way to beat Trump! TRUMP 2016!!!","post_message":"\"All of us shouldn't even have answered that question.\""},{"comment_id":"1149314588454636","commenter_b":"Ban them from the U.S.","commenter_a":"No","post_message":"The saga continues..."},{"comment_id":"10153513064987629","commenter_b":"Put your damn sticker and tongue away woman.","commenter_a":"Wait! Wait! WAIT A GOD DAMN MINUTE HERE! So cops can be wrong or even worse racist liars? Our judicial system can fail at the expense of innocent citizens? I need to take a seat. Bear with me for a second...","post_message":"\"They’re so wrapped up in a different culture than—what I’m trying to say is, the right culture, the better one to pick from.\""},{"comment_id":"861353807244021","commenter_b":"she's a nut fix her she don't need any more kids keep her in prison to the max time","commenter_a":"Kill the witch or let me at her. Wtf! 😡","post_message":"WARNING: The details in this story are extremely graphic. A 26-year-old Missouri mother was sentenced to 25 years in prison for the horrific death of her 4-month-old daughter. @webpagelink"},{"comment_id":"10153395340948984","commenter_b":"She's the one who put the hatred for America in his heart, she should be deported immediately!","commenter_a":"Give her the same!!!","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing... Do you think this Boston bomber got what he deserved?"},{"comment_id":"10152595015514071","commenter_b":"Everyone's saying about larger women.. Have any if you thought that some girls are blessed with a small back but large boobs!","commenter_a":"Good!!","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."}]
