[{"comment_id":"10153597569599411","commenter_b":"@Zoran...again, you get a life...we are pretty happy and fine. Not like a poor illegal immigrants as Zoran trying to stay in the west....","commenter_a":"No one should feed barbarian Russian junta fascism invaders.","post_message":""},{"comment_id":"509520402579803","commenter_b":"I see the women back of her. The men look like they have been photo shopped. Or they are pansies and do what their wives tell them to do. Maybe they are cardboard cut outs.","commenter_a":"Ever notice how the Dems always have people behind them when they're making speeches? They must have to promise to cheer a lot and be supportive. One boo and they're carried out by security.","post_message":"\"Donald Trump says I’m playing the woman card. Well you know what I say if fighting for child care, paid leave, and equal pay is playing the woman card – then deal me in!” Moments ago, Hillary Clinton gave a speech responding to Donald J. Trump's criticism."},{"comment_id":"1752604474967964","commenter_b":"Feel bad that all she did went right over my head. We couldn't understand the words but we made many comments on her big butt and thighs! Someone that big should never wear what she was wearing on national TV!","commenter_a":"LL Cool JJ, what a douche. Looks like the Wayans brothers had this jackass pegged, way back when, with \" Momma's Gonna Kick Me Out ! \" Maybe on youtube? Funny stuff, but about right, apparently.","post_message":"LOOK who LL Cool J just compared Black Panther Party Supporter and radical BLM donor Beyonce to..."},{"comment_id":"1297641203604631","commenter_b":"She makes me want to throw up.. A big rich phoney.","commenter_a":"She don't make me feel anything. Politics does not dictate what I feel","post_message":""},{"comment_id":"10153982345631162","commenter_b":"Lol at the lady that thinks Chicago is Houston!","commenter_a":"Well the store has a history of getting robbed at gun point. Also note, armed robbers have been killed in the past trying to rob this store. Its best not to try to stick this place up anymore. Matter of fact, why not obey the law and not stick up any stores.","post_message":"EMPLOYEE SHOOTS SUSPECTS: Two men were killed after police say they attempted to rob a liquor store when an employee opened fire at them - Diane Pathieu ABC7 is live with more: @webpagelink"},{"comment_id":"10153396685831320","commenter_b":"Time to keep the animals out of Mc Donalds!!","commenter_a":"Also known as Black Brooklyn Beatdown!","post_message":"It happened again! A mob of teens take part in a nasty brawl inside a Brooklyn McDonald's. Watch the video here: @webpagelink"},{"comment_id":"10153229951151130","commenter_b":"Because women are catty.","commenter_a":"Someone needs to get their nails done.","post_message":"\"I never again want to get so caught up in this virtual reality that I forget the physical world right behind me.\""}]
