[{"comment_id":"1092318047486497","commenter_b":"The chick in the limo is smokin...","commenter_a":"Yet he still left the guns...","post_message":"Now THIS is how you get out of a bad date. Mat Best MBest11x always taking it to the extreme. ~Will"},{"comment_id":"1191489804269278","commenter_b":"angelina illegal aliens? they want nothing more than death? you are so ignorant!! i dont recall illegals shooting up schools bombing up marathons or commiting any acts of terrorism. People like you make me sick. People dont come to this country to just commit crimes they come the same reason you or your ancestors came. your opinions are ignorant af","commenter_a":"America is now the land of sore losers and cry babies!!!","post_message":"Workers remove the Trump signage from 3 Trump Place apartment buildings in New York City after successful petition calling for removal. @webpagelink"},{"comment_id":"695324637324781","commenter_b":"Get ISIS and obammy out of AMERICA first. We need to protect ourselves and children. Then we can help ours.","commenter_a":"Wipe them off the face of the earth!!!!!!","post_message":"An innocent American girl was found in the middle of this ISIS debacle. America now truly stands with France against ISIS. Do you think that America should wipe ISIS from the face of this planet?"},{"comment_id":"565742550241188","commenter_b":"She is no different then her mother. Dumb. Maybe she should look into how not to get pregnant..","commenter_a":"Who is she to tell Obama to get out of Alsska. This girl is the lowest form of humanity....typical Zpalin low life....","post_message":"Bristol says no one ever refers to the mountain as Denali.   Except, her own mother did in 2009. Ooops!  But she wants Obama out of Alaska, dammit.   -Conover"},{"comment_id":"452057048331142","commenter_b":"I'm in love I think! She hit the nail on the head.","commenter_a":"You tell'em Grans....","post_message":"Race-Baiting CNN Host Is Shocked At Grandma Answers To His Questions:  is no such thing as  privilege' [VIDEO]"},{"comment_id":"10153363571284087","commenter_b":"Gun control is always pushed by angry racist white people @webpagelink","commenter_a":"We lost the battle for gun control when Republicans refused to do anything after Sandy Hook. If over 20 dead children doesn't motivate them to do anything, nothing will.","post_message":"“When are we really going to stand up and do something? Just who has to die? Your mother, your wife, your son or just how many?” Rep. Robin Kelly asked her colleagues in Congress. “We need to stand up, speak up and take action, rather than another moment of silence. It’s deafening, and it’s killing us.\""},{"comment_id":"1130900020321866","commenter_b":"@username, it's a meme, I'm not a cop. Ignorant women these days, geez.","commenter_a":"I don't see a problem. Carson is honest and leaves room for error. The ONLY perfect man was crucified. Trump/Carson. Make America Great Again","post_message":"Dr. Ben Carson just made an absolutely stunning statement about Donald J. Trump.  What Carson said has some asking if he's really on Trump's side at all.  NOBODY saw this coming..."}]
