[{"comment_id":"10156378664500725","commenter_b":"I have an idea. JDLTI. Just don't let them in. When you become President close all immigration for up to five years. We can take care of the terrorists in the Middle East while weeding them out here in the U.S.","commenter_a":"E","post_message":"I keep saying it. When the President of the United States of America, Barack Obama -  will not issue the words RADICAL ISLAMIC TERRORISM - the problem will NOT BE SOLVED!"},{"comment_id":"10153247983639411","commenter_b":"Why so you can kill some hardworking people going to work or school children. Blow yourself bitch and take some jihadists pigs back with you you prostitute. Hope you fry in hell you piece of shit.","commenter_a":"She shouldn't be allowed back into the UK","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1040060042672919","commenter_b":"This is BS, she just knocks the baby down with her & don't care. Stupid lil witch!!!!!!!","commenter_a":"OMG!!! ANIMALS!","post_message":"Life in Obama's America  Disturbing video of a white woman (holding her baby) being attacked by blacks, as blacks film and laugh at the attack."},{"comment_id":"10155007854069170","commenter_b":"Suck it up and move on lady","commenter_a":"this occurs when they go off their medication","post_message":"Enjoy this video. Watch it repeatedly. Savor it like a fine wine..."},{"comment_id":"649755178530332","commenter_b":"Please start packing now! Believe me no one will even miss you and your dirty mouth.","commenter_a":"V","post_message":"I guess it's time to say goodbye, and good riddance. 'LIKE' if you support Whoopi leaving the country!"},{"comment_id":"1457804240939001","commenter_b":"Don't forget the nra was starred by giving rifles to free slaves in the south to protect themselves from mobs and the kkk","commenter_a":"Just like President Obama, Al Sharpton is losing his grip on reality . Dr. Martin Luther King would roll over in his grave if he knew how far backwards race relations have slipped because of the ideals of Mr. Obama and Al Sharpton. I'm 51 years old, and I'm seeing more race related problems than I can EVER remember.","post_message":"Watch David Webb destory the Reverend..."},{"comment_id":"10157044490065093","commenter_b":"The only con-artist is Hillary!","commenter_a":"Wow. You work so hard to justify your position. What a word smith. What's your answer. Third party's ? Just how would that work? How would you fix it. You complain but you don't have any idea of merit to beat Clinton except trumps is wrong. A lot of us know he is a jerk and all the other adjectives. But unfortunately in life we have to make unsatisfactory choices when there are no other options. We have no other options except staying home and electing Clinton.","post_message":"'I'm talking about his core supporters, the people who didn just enthusiastically buy his con, they helped sell it to the rest of us.' -- David French"}]
