[{"comment_id":"368323690022592","commenter_b":"Who is this woman","commenter_a":"She is political posturing... Wants to be first Female President. (Well first elected. Hillery was first. Michelle ib second Unelected)","post_message":"Good God, Mr. President, we were once known as the leader of the free world, standing for what is right! You must not let America’s sacrifices be in vain. When will you learn that actions speak louder than your words?”"},{"comment_id":"10153573613391037","commenter_b":"An interesting job for our President on how to get these kids off the street at night and up in the morning to go to school.","commenter_a":"If it's done the right way!!!!","post_message":"The president says helping America's minority youth and making sure young people have the opportunity to succeed is \"an economic imperative.\" Liz Goodwin details the push behind the My Brother's Keeper initiative."},{"comment_id":"1067364476710422","commenter_b":"She's a corrupt evil lying witch.","commenter_a":"I am for @username all the way!!! She is experienced. She knows how to negotiate with foreign countries. She is a fighter for women and children. She will negotiate without bombs. She will keep us safe. She is the calm not the storm that Donald Trump is.","post_message":"Our choice is between the most experienced, qualified candidate in decades—and a man who once started a Twitter war with Cher. hillaryclinton.com/makeaplan"},{"comment_id":"501241236691320","commenter_b":"Yeah but the bride wore a short white dress with cowboy boots","commenter_a":"Why you live a better life you dope","post_message":"I know I've never had pizza at a wedding... The GOOP | Liz"},{"comment_id":"10154200210407411","commenter_b":"She has to pay her daddy","commenter_a":"Why doesn't she sue to stop the pay of the Senators/Representatives who's job it is to pass a balanced budget but who haven't done so in almost two years? It seems highly suspect to punish people who do their job but allow those who are unable to complete their primary assigned task to continue to be paid. Again, politics over people. Sad.","post_message":"Illinois Attorney General Lisa Madigan is seeking to stop state worker pay until legislators and Gov. Bruce Rauner approve a spending plan."},{"comment_id":"10153468487630530","commenter_b":"To conservative for you liberal","commenter_a":"Big ol lame duck","post_message":"Is Governor Rick Snyder a lame duck in the making?"},{"comment_id":"10152776226595047","commenter_b":"stupid anti Christians !","commenter_a":"Can't let them get away with this.","post_message":"General Craig Olson thanked God for his military successes, and asked for prayer for those being deployed at a National Day of Prayer event. Because of his public declaration of his beliefs, an anti-Christian group is demanding he face a court martial. This is outrageous. SIGN & SHARE the petition to fight back: @webpagelink"}]
