[{"comment_id":"1187041288042639","commenter_b":"How is she even allowed to run for president with all of this disgrace","commenter_a":"They all need to be arrested clean the White House and all the corruption--- this needs to be done ASAP","post_message":"In response to the revelations about the pay-to-play scandal tied to former Secretary of State Hillary Clinton non-state.gov email system and the Clinton Foundation, Judicial Watch announced that it will host an educational panel discussion:   Scandal Update  Emails and the Clinton Foundation.  Panelists include author of the New York Times best-seller Clinton Cash and President of Government Accountability Institute Peter Schweizer; Joe diGenova, former U.S. Attorney, Independent Counsel and founding partner of the Washington, D.C., law firm diGenova & Toensing; and Chris Farrell, director of investigations and research at Judicial Watch. Moderator will be Judicial Watch President Tom Fitton.  [for higher volume touch sound icon on screen  ]"},{"comment_id":"787320821458495","commenter_b":"F $(; Muslims!!!!","commenter_a":"Fuck Muslims","post_message":"A&E Tells Duck Dynasty To Cut ‘Jesus’ From Prayers To Avoid Offending... We live in a nation with it's foundation built on Christianity. Can we get 30,000 'LIKES' for Duck Dynasty's faith?"},{"comment_id":"1412904655446554","commenter_b":"You know joy what goes around comes around.I think she is only on tv because she is so nasty","commenter_a":"Enough is enough! Grow up and accept your new president you whining bunch of children! It's time to take either the hosts or the hosts off the air because they are to infantile to face reality!","post_message":"The heck!"},{"comment_id":"1672047073075950","commenter_b":"I hope this doesn't help Hillary. She needs to be indited & serve time.","commenter_a":"they are setting the stage to let hillary off with murder","post_message":"Breaking News: Defense Secretary Ash Carter has decided not to demote General David Petraeus. @webpagelink"},{"comment_id":"10155209769476337","commenter_b":"And he destroyed the liberal press...made them look like the fools they are.","commenter_a":"All you hillary sorry pussys get real the Donald is the president deal with it","post_message":"Trump spoke for over an hour, and what an hour it was..."},{"comment_id":"10154377596014411","commenter_b":"Does anyone realize what is happening? History is repeating itself and no one is taking notice. The Middle East is on fire. Obama and Hillary started this with Libya, they had no business getting involved. Now we have a flood of Muslims who hate American and our culture. They do not want to be equal, they want to dominate and change America and the West to a Muslim country. This is a fact, Turkish President is building mosques all over the West and no one is paying attention. In Turkey they are burning down churches, killing and raping Christians. It's a genocide but Obama only brings in Muslims no Christians. Americans are being told, to take down crosses, take pork from American public schools, allow Muslims to have pray time in public schools, Our children are learning Islam is the faith to be. WAKE UP PEOPLE. They are moving in ...","commenter_a":"I dont think people are comprehending how much people are actually crossing over in europe. its not like in north america. Canada for example scrapes the cream of the crop at 10,000 vs half a million in germany alone. So its full of feel good stories. Whats left stays in europe and the people keep coming and summer has just started. We're talking about a city moving into the EU completely needing of support. At the rate of growth. They'll have a small country entering the EU (mostly unscreened). Europes economy is already weak. Germany has a strong economy, but they're carrying the bulk of the weight. Swedens already cracking under the weight of just one year. Not to mention the culture shock of a sudden mix of two completely different cultures. Hes not saying turn them away. Obviously care for them. But you cant have this number of them ...","post_message":"Dali Lama to Germany: You're doing it wrong"},{"comment_id":"10156505662180354","commenter_b":"Give the stupid bitch the boot for good. Free her up so she can go over the Syria and suck up to those murdering rag heads.","commenter_a":"GOOD! This \"professor\" NEEDED to be fired!","post_message":"Read the Christian college's powerful statement..."}]
