[{"comment_id":"1024646927570802","commenter_b":"What RUBBISH!","commenter_a":"Reality is that even if you consider it a minor incident, which it appears to be, the trumpster and his campaign manager lied about it, and are still doing so. He doesn't apologize. He doesn't ask for forgiveness. See a pattern?","post_message":"WATCH: Florida police have released surveillance video showing the incident between Donald J. Trump's campaign manager Corey Lewandowski and reporter Michelle Fields. Trump's campaign issued a statement calling Lewandowski “absolutely innocent” after he was charged with misdemeanor battery. @webpagelink"},{"comment_id":"10153702146296491","commenter_b":"Huh ...well suck his dick already","commenter_a":"John Drumpf Miller and his toxic orange implants.","post_message":"Megyn Kelly: \"I would say the hair is real. I have laid hands on it personally.\""},{"comment_id":"1266472966743179","commenter_b":"But why are their boobs exploding tho?","commenter_a":"Amen","post_message":""},{"comment_id":"1002435359842664","commenter_b":"One things for sure there's plenty to pray for. For those precious children, for their mothers who have been fed lies from hell's own lips, and for those who would advocate for such heinous things to go on. I guarantee you this girl has had a couple of abortions and they were oh so wonderfully sickeningly sweet to her- so that they can use her face and influence. Makes me sick. Yes, she is responsible for her sins, but she's just a rebellious, gullible kid that several of these snakes have sunk their fangs into. Just like Brittany Spears before her- and Raven Symone.","commenter_a":"My heart went out to her when she started turning crazy. She's in the throes of rebellion, but I think it came because some of the snakes of Hollywood influenced her. She's rebelling against her dad, and the way he's tried to raise her, like many of the child actors and performers before her. The kid used to want to be a missionary and help save lives. Now she wants to be a champion for killing. I will still pray for her. God's arm is not short.","post_message":"\"I'm a good person to put on the face of a T-shirt.\""},{"comment_id":"1346770152082702","commenter_b":"Robert Best then take ur bitch cockservative ass 2 bed.....damn!!!!","commenter_a":"Sadly the same dimwits that voted for Trump still aren't listening...","post_message":"Trump has shoved his foot in his mouth once again."},{"comment_id":"1863343793909726","commenter_b":"I hate that woman wit a passion if whoopi was there she will shut her off","commenter_a":"Omarosa is phony as hell. She does not represent Black Americans at all!!! I wish WHOOPI was on set today she would've put her in her place ! Poor joy didn't push hard enough. I don't like Omarosa","post_message":"It wasn't pretty."},{"comment_id":"862078977258615","commenter_b":"Most abortions are not because of these \"terrible diseases\", so quit using that as an excuse.","commenter_a":"Conservatives are pro-life until the child is born poor. Then they are just lazy and a drain on society. Pro-life my ass.","post_message":"One of the few actresses that isn't ashamed to be conservative and pro-life! One of the big reasons I support her :D"}]
