[{"comment_id":"10158446067150354","commenter_b":"You little queer. I think my grandkids could fuck you up, fag!","commenter_a":"You won't stand a chance asshole come on bring it I'll save a hospital Bed it's waiting on you fucking RACIST RAT","post_message":"The shutdown of MILO event at UC Davis may be a preview of what to expect at next week inauguration of Donald Trump. Just who are these hooligans? Lee Stranahan investigates..."},{"comment_id":"1427954837264260","commenter_b":"I consider reading this page to be a spectator sport. ;)","commenter_a":"Such a disgusting Olympics. The committee needs higher standards.","post_message":"And you thought Rio's green pool was worrying!"},{"comment_id":"970465326346278","commenter_b":"Bitch!","commenter_a":"LMAO,at STUPIDITY","post_message":"Elisabeth Hasselbeck doesn't like that Pelosi left the conclusions about the videos to the scientists."},{"comment_id":"572993952849381","commenter_b":"She needs a stiff dicken","commenter_a":"Such class....................................................NOT!","post_message":"This woman just needs to STFU."},{"comment_id":"10154712563594203","commenter_b":"We can't give up. Hillary all the way! @webpagelink","commenter_a":"What if I told you...that Trump supporters will continue to follow him blindly no matter what he says or does, and what if I told you Hillary supporters will blindly follow her no matter what she says or does. That is called a nation that has been divided, and conquered. :/","post_message":" in Utah are really conflicted because they believe that Trump is bad, but Hillary is worse.\""},{"comment_id":"10153676230638984","commenter_b":"Hillary u r one dumb fucking bitch.u have to treat every race equal. An the man in the interview I have a question for you. (WERE U BORN IN AFRICA AND IF U WERE NOT THEN U R A BLACK AMERICAN.","commenter_a":"Where is the surprise in this? She's always been a radical.","post_message":"While Black Lives Matter is disruptively crashing other candidates' events, they're getting treated to behind the scenes meetings at Hillary Clinton events. Thank goodness this was captured on camera... Spread this video so everyone can see the real Hillary in action..."},{"comment_id":"10153477964755575","commenter_b":"I'm in true awe at how people react to situations. I am physically sick at what these murderers are doing and GETTING AWAY WITH IT. What kind of people are we to sit back and let the government ruin our lives. You saw, as Americans, how much power we have when Megyn Kelly attacked Donald J. Trump. Why aren't we furious about ISIS and demanded our government eliminate them all. obama has done an excellent job on turning American people against one another an will continue to do so as long as WE allow it. Its time people. Stand up and voice your opinion and tell obama that this is WRONG. WE have the Power......Use it.","commenter_a":"This crap needs to be stopped, let the Marines do it...","post_message":"The Gateway Pundit - ISIS Kidnaps Priest, Kills Him, Cuts Him into Pieces, Packs Him in Box and Sends Him Back Home"}]
