[{"comment_id":"10156351998640354","commenter_b":"NO HE IS NEVER GOING TO BE A WOMAN. BORN MALE ALWAYS MALE JUST A TWISTED FRANKENSTEIN MONSTER THAT OUGHT TO BE SHOT. @username","commenter_a":"NO MEN IN DRESSES IN ANY LADIES ROOMS ANYWHERE IN AMERICA. EVEN IF HE HAD HIS GENITALS REMOVED.","post_message":"How upside down is the world when this even had to be voted on in the first place?  That said, LOOK at the percentage of Houston voters who voted for and against this..."},{"comment_id":"10153757809364877","commenter_b":"She wouldn't even have had the chance to do that to me, once I saw the knife in her hand it would be over for her with the quickness! I hope she gets arrested and that boy leaves her high and dry if he hasn't already!","commenter_a":"He should run and never look back","post_message":"Woman holds knife to boyfriend’s throat, forces public apology for flirting on Instagram.   Grio fam, how would you react if your son or daughter was in this relationship? Please be advised that this footage shows graphic imagery."},{"comment_id":"10153503112318812","commenter_b":"Stephanie is a dumbass.","commenter_a":"STAGED!","post_message":"UPDATE: Dallas police: Sniper shot driver who opened fire on officers from armored van; unable to say whether he was killed: abcn.ws/1KNBxWA"},{"comment_id":"556755621195285","commenter_b":"@username y'all race invented HIV and experimented on other races but that heroin epedimic spreading HIV all thru the white folks Hood. Keep sharing needles junky..","commenter_a":"Same white dudes screaming how they would beat her ass are the same ones who scream don't hit a woman when it's a white woman !!! Good news is that it is fact that by 2030 the white race will be a minority ! 😉. So that always makes me smile when I see the racist still holding on to a failed system ! But that's ok the rest of the world has moved on! Just look at the population ... your country is now little Mexico right under you nose while you tried so hard to oppress the blacks you let in millions of mexicans , Muslims , Somalis! Now you mad !","post_message":"She took his crowbar away and went crazy! "},{"comment_id":"10154153338147908","commenter_b":"@username norway. now stfu","commenter_a":"Commie Bernie vs. Socialist Hillary= end of Freedom.","post_message":""},{"comment_id":"1001470336557869","commenter_b":"HaHaHa ROFL at her.","commenter_a":"And she is the Dean at a University? Sad state of mind and then you combine that with putting her in the role of teaching! Are we the people paying for that woman's salary?","post_message":"WOW this lady...shamelessly LIED about her entire encounter with the Police Officers..and here's the proof! What a fool."},{"comment_id":"10152732275938645","commenter_b":"fat a** hoe.","commenter_a":"Report me all you want trick","post_message":"The victim said the attacker threatened her during the rape, saying he knew where she lived and would return to kill her if she called the police."}]
