[{"comment_id":"10154189776881130","commenter_b":"I'm ready, bitch.","commenter_a":"Not reading the article--no time for it. But to pass along, a commentator on CNN today said that the Clintons operate from a stance of self - righteousness, thus they cant see what they're doing is oh so wrong. Hit it on the head! Two major party candidates, to major flawed choices!","post_message":"If Hillary Clinton wins in November, brace yourselves."},{"comment_id":"1183171455046239","commenter_b":"Who is she to decide who the child should live with","commenter_a":"I just read another story that he had reversed his decision, probably due to pressure from above.","post_message":"SOUND OFF: Judge believes a child is better off with a heterosexual couple."},{"comment_id":"10152633763458525","commenter_b":"So because somebody disagrees with you they lack common sense. That's very adult of you.","commenter_a":"And people say that pot doesn't hurt anyone.... That's two deaths due to pot sales just during the holiday season. Pot hurts....even kills.","post_message":"They are just 15 and 16."},{"comment_id":"368033556718272","commenter_b":"Sarah Got A Back Bone She Don't Back Down To That Evil Snake","commenter_a":"does she even know where Paris is?","post_message":"Good God, Mr. President, we were once known as the leader of the free world, standing for what is right! You must not let America’s sacrifices be in vain. When will you learn that actions speak louder than your words?”"},{"comment_id":"526053707590689","commenter_b":"She needs to go back to the Chicago geto where she belongs!","commenter_a":"She is such a liar she acts socked but she has tapers in the White House","post_message":"\"I can't stop thinking about this. It has shaken to me to my core in a way that I couldn't have predicted,\" Michelle Obama said regarding Donald J. Trump bragging on a 2005 tape about his fame allowing him to \"do anything to women.”"},{"comment_id":"972807806163282","commenter_b":"shes a Savage","commenter_a":"@username her","post_message":"The former Stanford University student who sexually assaulted a woman behind a dumpster was released from prison on Sept. 2, 2016. That a full three months early from his original six month sentence."},{"comment_id":"474408059350901","commenter_b":"Stay off their land!","commenter_a":"Err... They only kill white people because their other fellow tribes who join the \"democratic\" world suffered a lot of losses and they warned them. There is a documentary on this. You should check it out.","post_message":"Anyone who has ever tried to come ashore the island was attacked or even killed."}]
