[{"comment_id":"865303986949796","commenter_b":"She has the 2nd highest rated show on cable news and all YOU have is this little space on Trumpbart to air your idiotic views. Not hard to see who is more important.","commenter_a":"Grow up Megyn....as I have stated before...YOU went after him and lost ALL credibility you had. As important...your \"love fest\" with the disgusting Michael Moore was the last straw. Get over it...you just are not that important.","post_message":"Megyn Kelly tells Mediaite she worries that “someone’s gonna hurt me in the presence of my children.”"},{"comment_id":"10154099616106162","commenter_b":"I thought it was hilarious","commenter_a":"Double standard. If the tables were flipped we wouldn't even be allowed to mention a lack of caucasians without protests and al sharpton crying on tv.","post_message":"What would this year's Best Picture nominees look like with black actors? Chris Rock, Tracy Morgan and Whoopi Goldberg gave us a (hilarious) idea."},{"comment_id":"942185122493609","commenter_b":"Please, get some more facts before you continue spreading such nonsense. Of course GUN voilence is down - but violence, homicides, etc are NOT. Home invasions are up though... bc criminals know responsible home owners aren't carrying any more. Please, get a clue. Guns are not the big problem, and more gun laws do NOT stop CRIMINALS. You know who gun laws hurt, responsible gun owners.","commenter_a":"Did any of you even read all the way through? Statistics clearly show that stricter gun laws prevent shootings. Look at Australia. They used to have guns. Had a massacre. Made them illegal. No more massacres. Their gun violence is almost non existent since they made guns illegal.","post_message":"So sad."},{"comment_id":"10157700515445294","commenter_b":"Educate yourself. So we rather have criminals holding people up at gun point running the street? Robbing innocent hard working people?. We feel bad for the criminals? However, I don't. Much peace and love.","commenter_a":"Well he won't do that again. Glad he won't be terrorizing hard workers anymore. I don't care if he had a drug problem look at all the people he held at gun point the past 3 weeks. Should feel sorry for those who had to be terrified of their life.","post_message":"Police say the robber was suspected of holding up other Cleveland-area CVS stores for opioids."},{"comment_id":"10154057964035448","commenter_b":"Everyone go to Shannon's blog and tell him to shut the hell up","commenter_a":"Shannon Sharp is one big disappointment. What an ignorant clown he turned out to be. Hasn't a clue...just a great big mouth!!","post_message":"The Left will never learn..."},{"comment_id":"1007314029311396","commenter_b":"You stay where ur at and fight ur own dirtiness.... we dont owe u nothing!","commenter_a":"\"We have to reject any politics that targets people because of race or religion\" For brighter future, Americans can't afford Trump to walk into the Oval Office!","post_message":""},{"comment_id":"990898310953409","commenter_b":"\"Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you\"","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas. @webpagelink"}]
