[{"comment_id":"10154271893261336","commenter_b":"He should deport the freeloaders and criminals. There are a lot of nice people out there who want to work and be a part of America","commenter_a":"Trump just told CNN he is for a raise to the minimum wage. I am waiting for Trump to say he will not deport the 11 Million undocumented immigrants he promised his rightwing base. Look for that next week.","post_message":"After emerging as the presumptive GOP nominee following a major victory in Indiana, Donald J. Trump is responding to questions about whether he'd choose John Kasich as his running mate. Don't miss Trump tonight on \"The O'Reilly Factor\" starting at 8p ET."},{"comment_id":"10155424731863812","commenter_b":"Build a wall, a big wall....","commenter_a":"Take our crazy liberals please. Go Trump !","post_message":"Canada's border has seen a surge in people crossing illegally from the U.S., with a 230% increase in people crossing into Quebec in January compared to a year ago. @webpagelink"},{"comment_id":"10153661151756167","commenter_b":"Ditzy Daisy, throw her out! Keep her coat! Knock the cr*p out of her! Go ahead back to your momma! Drag her outta here! Ditzy Daisy, she's really nuts folks, really nuts. Yep, that's how Drumpf would handle her...","commenter_a":"That goes for all you communists who call us racists and if you spell president trumps name wrong again. The democrats are the party of anti american hate mongering. Now we can sue yo ass.","post_message":"Trump’s plan to “open up our libel laws” is just the beginning."},{"comment_id":"10155229441268352","commenter_b":"She is a grown ass women","commenter_a":"For all j-lo haters y'all can go straight to hell she is in love","post_message":"Daaaayum! Drake and J-Lo are KILLING THE DANCE FLOOR… watch Drake GRIND ON J-Lo's FAMOUS BOOTY… then slow-dancing together like they about to go make babies!! (Video -- Super HOT!!) ----> @webpagelink"},{"comment_id":"10153715993757293","commenter_b":"Make it a felony to hire anyone illegal","commenter_a":"I've watched illegal immigrants take construction jobs from my fellow Americans for years. Build the wall.","post_message":"In a two-page memo to The Washington Post, Donald J. Trump detailed his plan to force Mexico to pay for a border wall"},{"comment_id":"1041807992526339","commenter_b":"Bitch please!","commenter_a":"he was 14. he admitted it freely (nobody knew or said anything or asked him, he just did the right thing) and he was treated and has no reoffended. If it was your 14 year old son, better yet, shall I name all the 12, 13 and 14 year olds I went to school with that groped me??? Maybe one IS you kid","post_message":"One of Josh Duggar's relatives stepped up to the plate to defend the Right's favorite child molester by claiming that ANYONE would molest kids if there were no consequences and the right opportunity."},{"comment_id":"10154297413016378","commenter_b":"And, as usual when in the playoffs, promptly lose","commenter_a":"Haha, pretty sure Garrett said he wanted to keep the momentum going into the postseason. The only QB to move the ball was Romo and he got most of his yards through PI. The Boys were flat out beaten today. No excuses. Dallas has looked pretty weak the past few weeks.","post_message":"The Philadelphia Eagles end the season on a high note with a win over The Dallas Cowboys! Final Score: 27-13. @webpagelink Way to go Birds! E-A-G-L-E-S EAGLES!"}]
