[{"comment_id":"1187171674668927","commenter_b":"She has a brain?","commenter_a":"Alote of Americans support her I think we may be the ones with brain damage","post_message":"Is something wrong with Hillary's brain?"},{"comment_id":"10154338661984087","commenter_b":"Keep sucking off your Arab whore","commenter_a":"Raper of Ex Wives and groper in chief","post_message":"“Look to his past to see what he will do for women in this country,” Omarosa said about Trump."},{"comment_id":"10154475125548812","commenter_b":"STOP GLORIFYING THIS RAPIST POS.","commenter_a":"I don't think it's real remorse probably embarrassment. Which is great. So it means that the power of social media is effecting thing Even the Vice President commented eloquently. So keep it up share this post pictures and sign the petitions","post_message":"Women who provided character witness statements for the Stanford University swimmer convicted of sexually assaulting an unconscious woman on campus are expressing regret for supporting him."},{"comment_id":"426764770781451","commenter_b":"let the idiot walk home ! she does not deserve to be around others !","commenter_a":"Her Bus, Her Rules.","post_message":"This bus driver decided to teach a foul-mouthed teen some manners."},{"comment_id":"10155902934120294","commenter_b":"I agree, if its fact its clearly ok to say it. That chick had no place in that store","commenter_a":"They said it loud enough for her to hear. She heard it and it hurts. Just be kind. If you can't say something nice don't say anything.","post_message":"This woman knew what she had to do after the hurtful conversation she said she overheard between a teenage girl and her mom at Old Navy."},{"comment_id":"10153539209048487","commenter_b":"Oh please tell us what you know about Locheed /Martin!","commenter_a":"Cuz Lockheed Martin sucks","post_message":"The F-35 was supposed to be inexpensive, adaptable, and reliable. How did it become the most expensive aircraft in history?"},{"comment_id":"10155118024265231","commenter_b":"No","commenter_a":"It depends on the relationship the bride has with the mother of her fiance's child. If they get along great! If she is simple and has secret feelings for him then no. There are so many different scenarios. What works for one group may not work for others. And it may not have to do with maturity.","post_message":"Your fiance's 'baby mama' wants to attend your wedding. Do you let her? #AskDemetria"}]
