[{"comment_id":"10153604901701167","commenter_b":"Either way she doesn't have a dick anymore.","commenter_a":"Right. Sexual predators never pretend to be transgender to gain access to women they wouldn't have as a man. Never! Umm....errr.... @webpagelink","post_message":"A man has never pretended to be transgender to sneak into a women's restroom. It's just not a problem that exists."},{"comment_id":"1141972632481659","commenter_b":"I think they should exact a form of sharia law on these ME males. Cut their peckers off. They are stealing from these women","commenter_a":"Europe wake up and time to get you at of my bed. We can't except no more of this crime it's disgusting and these middle eastern got to go bye bye and ready for there deportation sentence. We don't want to hear no more of liberal excuses oh it's racist.Racist my face those people deserve there jail sentence and then there deportation sentence.","post_message":"Drip, drip, drip: News of more Muslim sex attacks leaks out"},{"comment_id":"10155026863931509","commenter_b":"she doesnt look that bad for a transgender","commenter_a":"What a beautiful woman our first lady is.","post_message":"First families join hands for a rendition of \"The Battle Hymn of the Republic\" during memorial for slain Dallas officers. @webpagelink"},{"comment_id":"10154806560781509","commenter_b":"Hillary is a joke. Too bad we didn't have a good candidate. I will not vote for Clinton. The Democrats are losing voters in mass.","commenter_a":"NOT IN JAIL YET......it's not what you know (she knows stuff all) it's the case of WHO....","post_message":"Hillary Clinton just did a Donald J. Trump impersonation, mocking him in a hypothetical debate @webpagelink"},{"comment_id":"1850461285187986","commenter_b":"If hillary clinton introduced herself to me as Hillary Clinton I wouldn't beleive her.","commenter_a":"#alwaysHillary","post_message":"Hillary Clinton holds a rally in the battleground state of North Carolina."},{"comment_id":"585707061582274","commenter_b":"Zoe, your doctor told YOU not to lift that amount of weight. If the doctor told that woman not to, I'm pretty sure she'd stop. Everyone's body is different.","commenter_a":"This is just sad , smh more concerned about looking fit and all that , be healthy that's what that baby needs not for you to be fit. Wait till the baby is born and get to your regular routine. I really hope the baby comes out ok smh all that shaking and heavy lifting Pretty sure you just gave that child problems","post_message":"Fitness Model Chontel Duncan Isn't Stopping Her Intense Workout Sessions Even During Her Pregnancy!"},{"comment_id":"10153143313576350","commenter_b":"Idiot!","commenter_a":"I think they are all smiling because they didn't know how to react. Maybe a nervous laughter? And they have more class than to be rude...even though he does deserve it!","post_message":"Kanye West had an impromptu moment last night with the TODAY anchors!"}]
