[{"comment_id":"1438259686194057","commenter_b":"Say No to drigs","commenter_a":"I tired this in high school a few times when it was sold in gas stations. Knew a girk that made it too. So dangerous! Just smoke pot. I'm glad Co legalized weed and got rid if this stuff.","post_message":"Everything you need to know about K2, the drug linked to a mass overdose of 33 people in New York: @webpagelink"},{"comment_id":"10155026342853147","commenter_b":"She is a slob","commenter_a":"Clueless no talent idiot.","post_message":"Pop star Pink attacked President Donald Trump for “stripping our humanity away”"},{"comment_id":"10155653992935389","commenter_b":"Obama's clusterf*ck !","commenter_a":"@username, I do not think either one of them have any care at all about this.","post_message":"Question of the Day: Do President Obama and Hillary Clinton owe the families of fallen troops an apology for pulling out of Iraq?"},{"comment_id":"1032281423464900","commenter_b":"Oh please. You gotta be kidding. I will say Madcow needs the ratings for sure.","commenter_a":"When you get the guts to go on Rachel Maddow's show, please let me know.","post_message":"I talked with Fox News’ Gretchen Carlson this afternoon about the House passage of the Homeland Security Appropriations bill. As I told her, we made a commitment in December to seek to block President Obama’s lawless, unconstitutional amnesty using the \"power of the purse.\" Today we upheld that promise by doing our part to pass the strongest, most conservative bill that we could. I hope you’ll take a moment to watch."},{"comment_id":"10157481563535354","commenter_b":"Silly Rabbit illegals can't and most don't want to vote or do anything to bring attention to themselves....try again!","commenter_a":"Did anyone else notice that Bill Clinton basically told illegal aliens to vote for Hillary in his speech?","post_message":"Bill Clinton's Big Bomb of a #DNC Speech was SO bad, Even Progressive MSNBC Host Rachel Maddow is TRASHING it... WATCH:"},{"comment_id":"434228700035058","commenter_b":"Why so illegal immigrants can collect our money??? I think u should have to prove that you' have worked for 20 yrs or more to collect","commenter_a":"Also give thanks to Bill Clinton who signed the bill making it legal to outsource jobs here.","post_message":"Jeb Bush wants people to work until this age. I'm sure this will raise some eyebrows."},{"comment_id":"10153881139329456","commenter_b":"Not Thugs , WORTHLESS TRASH!!!!! \\b","commenter_a":"Look all you people who argue what a thug is. Those two are thugs.","post_message":"Missouri police say the 2-year-old was left alone in his crib for 38 hours and reportedly died from hyperthermia."}]
