[{"comment_id":"1106451702729020","commenter_b":"Go girls. Rape is never justified!","commenter_a":"It's sick that they were still trying to give excuses even though there is never an excuse for rape. Once that girl brought up raping 6 year olds they shut right up! They know it's not right but they're still trying to make up ways to say it's the women/girls' fault. This is so unacceptable and disheartening. 😔","post_message":"These teenage girls are confronting rape culture in India. This is what bravery looks like. (via AJ+)"},{"comment_id":"10153548896611323","commenter_b":"Ban all religion, ban all religious dress so all pupils wear the same uniform, then paint all children green ......... There you go, sorted.","commenter_a":"When a system (Teachers & Parents) is not focused on a child's future but instead going through the motions and meeting the targets with least amount of positive role models (especially in single parent families) you are not building future generations that think rationally where the brain itself arrives at a conclusion at a very young age that race is just a social construct, you are instead building a worker drone filled with prejudices and presumptions on top of entitlements that things are owed instead of earned.","post_message":"\"Education should provide an inclusive curriculum that teaches the students respect for other cultures. If schools provided such an education, the climate that allows racist language and behaviour would cease to exist. Promoting such an education should be a priority for government, however in Britain we have a school system that has little interest in education.\""},{"comment_id":"10153970648079091","commenter_b":"Just string her up!","commenter_a":"Sick people!","post_message":"UPDATE: New Mexico mom out of hospital, taken to jail after the brutal murder of her 10-year-old daughter in which police say she was injected with meth, raped, killed and dismembered."},{"comment_id":"10153146580383352","commenter_b":"@username she is one lost soul,","commenter_a":"I Pray that evil spirt of homosexuality never come upon my kids, those demons had their way with that young boy, this is sad, when a person is not happy with who The Lord made them, an idol mind is the devil workshop, the devil does not care who he comes after, teach Boys to be boys and girls to be girls., no need to reply to comment with negative remarks, if you don't agree, but this is a sad and ridiculous situation.","post_message":"Suicide note of 17-year-old transgender girl is DELETED from her Tumblr page after her Christian parents demand message blaming them for her death be removed"},{"comment_id":"550023351824286","commenter_b":"Funny Denis.","commenter_a":"Good for North Korea, we have missiles why can't they","post_message":"The rocket was launched on a southward trajectory, as planned, passing over Japan's southern Okinawa islands."},{"comment_id":"10154553649688812","commenter_b":"This is getting ridiculous... Killing them is not necessary..","commenter_a":"As for sending these animals to zoos sanctuaries, etc. That would be the best solution, but those places have limited space and resources. Sometimes there just isn't any option.","post_message":"Colorado officials euthanize baby deer that was picked up by people who likely mistakenly thought it had been abandoned."},{"comment_id":"10153230146462439","commenter_b":"Why do you say that?","commenter_a":"The use of the Neutron Bomb comes closer.....","post_message":"Iran is the world’s leading state sponsor of terrorism. Hizb’Allah is its client in Lebanon. Hussein Obama has apparently joined the axis of evil…and that will be his legacy. “Iran is placing guided warheads on Hezbollah rockets,'” by Yaakov Lappin, …"}]
