[{"comment_id":"10153311362744135","commenter_b":"Thank you \"Pieter\" for finally posting something informative. This may be the first time. As far as your buddy \"Kathleen\" goes, it matters because many of her negative comments apply to politicians in general, so it would be quite naive and hypocritical of her to constantly criticize Christie, let's say for lying, while supporting a candidate who also lies.","commenter_a":"Please discuss why you don't threaten to enforce federal guns laws in states, but only marijuana. This would show you as a complete hypocrite and fraud. Please explain why you have expanded the failed war on drugs, your words, in Jersey.","post_message":""},{"comment_id":"10153859214957169","commenter_b":"Should Donald Trump become President,what he has in mind to do,will go over Congress first","commenter_a":"All the blame on the \"current administration\" ignores that both the house and senate are republican...and they control (or obstruct) a major part of what happens in this country. Tho there is some opportunity for a president to make executive orders, it is a limited power. So our votes for our state reps and congress will carry a lot more weight. Just sayin'.","post_message":"Here's a look at some of the Republican presidential candidate's claims and how they compare with the facts (From PBS NewsHour)"},{"comment_id":"10154312259097654","commenter_b":"yes yes","commenter_a":"absolutely!","post_message":"Kellyanne Conway says the media is flat-out refusing to cover the Trump administration fairly. Is she right?"},{"comment_id":"1849468845289358","commenter_b":"@username rn she sitting on a strap thats why u so butt hurt😂😂😂😂","commenter_a":"She kicks some dude out of her show cause he didn't want to record her and now she does this shit... she's straight up trash.","post_message":"Doesn't look like this promoter is playing games! #WSHH #YoungMa"},{"comment_id":"10150863474824999","commenter_b":"As opposed to when exactly? When was this glorious period of time when everyone spoke the truth?","commenter_a":"the problem these days we do not know who or what to believe, everyone seems to have their own agenda and telling lies is at the top of their agendas.","post_message":"\"Few other countries go to such lengths to deliberately inflict suffering on people seeking safety and freedom.\""},{"comment_id":"10153205140467426","commenter_b":"Lady shut the hell up negative nancy","commenter_a":"Please get some bike helmets for these young riders and teach them to wear it.","post_message":"Inspired by #Richmond2015? Happy riding kids!"},{"comment_id":"10153860760766135","commenter_b":"You are so right.","commenter_a":"It was not a mistake, it is business as usual at Detroit Animal Control.","post_message":"\"As a result of a computer status error, a tragic and unacceptable euthanasia was authorized.\" -- Detroit Animal Control"}]
