[{"comment_id":"1135192056570151","commenter_b":"Margaret, did you even watch the debate? I think you were the one snorting. Poor Hillary was having a meltdown. Her rigged plan with crooked moderators backfired.","commenter_a":"They are calling the debate the \"sleazy stalker\" debate! Trump not only was of absolutely no substance but he was creepy! Hillary WON! Go Hillary!","post_message":"A good night for Democrats."},{"comment_id":"1546700958971228","commenter_b":"Heaven forbid that us stupid stupid people should be allowed to have some one tell us the truth! Good Grief!","commenter_a":"But why","post_message":"BREAKING: You’ll Never Believe The Reason Greta Van Susteren Is Losing Her Job. This is terrible. We love her. Can we get 5,000 'LIKES' to Greta on the air?"},{"comment_id":"629045897266731","commenter_b":"no - if they want to work, they must follow the rules of the company, not shariah law.","commenter_a":"omg,.... to quote Faye, No more 'political correctness' for me. I am getting tired of this \"FAVOR\" at the expense of the average AMERICAN citizen. ANY business ANY where in the USA that refuses to fly the AMERICAN Flag, that honors false Gods.....will not get my business, Period!!!","post_message":"Home Depot Embraces Shariah Law With ‘Muslim Sensitivity Training’. They are submitting to societal pressure. Do you think Shariah Law has no place in America?"},{"comment_id":"10153793853959714","commenter_b":"You know how you don't want to date every girl you see? Girls don't want to date every guy they meet :)","commenter_a":"I don't understand why women say being too nice is unattractive when all they can talk about is how they wish they had a nice guy and someone who would finally treat them right but when they find a good man who does they say \"i can't be with you cause you're too nice\" and end up with the same type of guys who treat them bad I know part of it is because some girls aren't use to being treated like that so they go back to what they are use to or they just think we want something out of them give people a chance there are still good people left","post_message":"We don't know about this one..."},{"comment_id":"10154455818619705","commenter_b":"She referred specifically to people who are \" ..racist, sexist, homophobic, xenophobic, Islamophobic.\" If you don't find those things deplorable then you're in the basket and you might as well wear the shirt so the rest of us can more easily identify you.","commenter_a":"Trump supporters take being referred to as \"deplorables\" like a badge of honor","post_message":"The shirts stem from a comment Democratic presidential nominee Hillary Clinton made at a fundraiser."},{"comment_id":"10153897505943812","commenter_b":"Closing borders will do nothing. Wake up. If they are going to get here, they will. Hell we already have our own killers","commenter_a":"This is going to continue. This will be the US one day. Mark my words. How do we know if some of these refugees coming in are not Isis and just waiting for the word to strike? What do you think now Mr President?? Borders need closed","post_message":"BREAKING: The terror group ISIS today released a statement claiming responsibility for the horrific, apparently coordinated attacks in Paris Friday that killed more than 100 people: @webpagelink"},{"comment_id":"1648962245130424","commenter_b":"find a new dick to suck lol","commenter_a":"What will DiCaprio do?","post_message":"This sounds too good to be true!"}]
