[{"comment_id":"555784677879905","commenter_b":"They're not looking for life, we are looking for resources, we kill each other for that in this planet. When we find the other resources the inhabitants of set planet will surely deliver our faiths.","commenter_a":"So anti media feel stopping space exploration will solve earths worries? ?Sorry but go the space programs and all the science behind it!","post_message":"Right? Follow us --> The Anti-Media <--"},{"comment_id":"10153133870041350","commenter_b":"Girl, u r so crazy. LOL!!","commenter_a":"I'm from the old school. My house, my rules. If a child misbehaves, I don't wait for the parents to take action; ESPECIALLY if the little brat hits me. I'll tear that ass up. I wish my daughter would have acted up at someone else's house to the point that they would even have to consider disciplining her. They wouldn't have time because I'd been on her ass. Don't like it, keep the little untrained savage home.","post_message":"Do you think it's OK to discipline someone else's child? Share your opinion in the comment section below. #OrangeRoom"},{"comment_id":"1043101302382000","commenter_b":"@username, the worst president in OUR lifetime was 2000-2008.","commenter_a":"Rep. Todd Young I understand your optimistic out look. How ever if you think that man will ever do anything, that would make America stronger then you greatly disappoint my opinion of you.","post_message":"While the President closed his State of the Union address by noting his desire to work across the aisle, much of his speech was spent digging in his heels on the same tax-and-spend policies rejected by the American people rather than identifying areas of common ground. But while I’m generally disappointed he took this tack, I still think there were some hints of bipartisanship that might present opportunities to grow a stronger economy. For starters, I agree with the President that Congress must pass a trade promotion authority bill. With two of the largest free trade agreements in the history of the world currently being negotiated, it is vital that the administration works with Congress to set negotiating priorities so that a deal might be completed quickly. In order to grow our economy, we must continue to open foreign markets to agricultural products and manufactured goods from places like Indiana, ..."},{"comment_id":"10153781188388984","commenter_b":"We need to get Americans off of Welfare...80 million Americans are not coming off their porch until we take EBT away from them, the Obama phone and ACA. Immigrants with green cards would not be here if Americans would get off their ass.","commenter_a":"Ben Carson supports amnesty for illegal aliens. The liberals can have him.","post_message":"Rush Limbaugh just issued a huge statement Dr. Ben Carson ... this caught a lot of people by surprise. Do you agree with what Rush just said?"},{"comment_id":"938570362850489","commenter_b":"I love this woman.....","commenter_a":"Thank you for sharing this work of art...beauty born through the transformative act of a life examined...","post_message":"Listen to a woman who isn't supposed to share her story do it flawlessly. Whoa."},{"comment_id":"754556321401612","commenter_b":"Tie them by their ankles to a fast moving train!!","commenter_a":"This is the mine set of Muslims. That it's ok . Send their asses back","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News They deserve much worse than this. What do you their punishment should be?"},{"comment_id":"10153101900003010","commenter_b":"WORTHLESS PIECE OF HUMAN FLESH...","commenter_a":"This world is coming to an end . I feel sick after reading this","post_message":"A 30-year-old Newhall man told sheriff's deputies his newborn daughter was missing. But investigators say he sexually abused, tortured and killed the 19-day-old child."}]
