[{"comment_id":"10153295593767452","commenter_b":"Put her in jail!! She had no right to throw her father down the stairs! She's an abuser!!","commenter_a":"I bet her Dad took her to, and paid for, many, many, many, ski lessons and trips to many competitions, and was always in the crowd and supported her all the way, and all that comes with giving your child everything for your child to become a champion. She didn't get that far without a ton of support. If she did this to MY Dad, I'd be in the slammer too, surely with a much higher bail. Wasn't Picabo a downhill champ? Now, she is definitely a downhill champ - Picabo, you beat everyone to the bottom this time! This makes me happy I have no children - I'd rather be abused by a stranger than someone that I gave much love and support to. Picabo, thanks for making it to the bottom before all of the competition once again! Hope you have a kid that can maybe return the ...","post_message":"Olympic gold-medalist skier Picabo Street has been charged with assault and domestic violence after authorities say she pushed her 76-year-old father down the stairs and then locked him in a basement."},{"comment_id":"10154589059624087","commenter_b":"If you look real hard you may find your own identity or Soros'","commenter_a":"Questions: How many states do we have? What was actually written on that red, plastic button your mommy brought to Russia to reset our relationship? Did the crippled man Biden ask to stand up ever...stand up? What exactly is a CORPSEman? Hmmmmm....perhaps you should stfu?","post_message":"\"What happened in Sweden Friday night? Did they catch the Bowling Green Massacre perpetrators?” Chelsea Clinton tweeted."},{"comment_id":"10155397159458797","commenter_b":"And no telling how many more he has! Since he likes to pull on ladies p___y. Freak!","commenter_a":"Since you all won't acknowledge our formal president as the \"First Black President\" i will only acknowledge trump as the FIRST PRESIDENT WITH THREE BABY MOMMAS' BAHAAAAA! HAPPY BLACK HISTORY MONTH!!!","post_message":"On this first day of Black History Month, we recognize former President of the United States, Barack Obama. He was the 44th U.S. President and the first African American to serve as president."},{"comment_id":"1005938356108252","commenter_b":"She looks like a evil witch","commenter_a":"She is \"special\" she doesn't not have to follow the law.","post_message":"GO TO PRISON!"},{"comment_id":"1068619743164680","commenter_b":"why 'send' them anyplace? Just teach our history & proper methods, uphold the laws of our nation, put teeth n the laws n place, cut off the welfare & they will leave....don't waste any more $ on them....well...maybe a 1-way ticket!","commenter_a":"Gutless flag burner won't show his face Cowards","post_message":"The nerve that Rudy Giuliani touched this week is not merely Obama's anti-Americanism; it is the anti-Americanism of the progressive left."},{"comment_id":"10153512388783812","commenter_b":"She is not dark skinned!!! I sorry she is screwed up!","commenter_a":"Love her tan. What's her secret? Lol","post_message":"A timeline of Rachel Dolezal's transition from a young white girl with blond hair to a darker-skinned leader in the country’s oldest civil rights organization: @webpagelink"},{"comment_id":"10153285448873984","commenter_b":"Send her to jail.","commenter_a":"Lock the beast up!!!!","post_message":"And people think she could be our next president? Do you think Hillary should be held accountable over this?"}]
