[{"comment_id":"1949462081947777","commenter_b":"Stupid bitch !!!!","commenter_a":"Just think, if Hillary wins, this stupidity will not only increase, but will be further validated by the government.","post_message":"This is what it has come to..."},{"comment_id":"1003302019710656","commenter_b":"Sure let them get married. Let them suffer like the rest of the world. Oh and wait till they start getting divorced! HAHAHHAHHAHAHA Your welcome ass holes!! HAHAHHAHHAHHAHAHHAHHAH","commenter_a":"It’s My Right To Discriminate Against Republicans Since I Do Not Agree With Their Lifestyle Many conservatives who oppose equal rights for homosexuals do so based on “religious principles.” It’s a defense for ignorance that I always find amusing considering how many “biblical laws” are completely ignored because it would be almost impossible to abide by them. So, I've decided to use this right-wing ignorance to my benefit; I've decided that it’s my right to claim “religious freedom” to discriminate against many Republicans since I do not believe in the lifestyle choice they've made to be bigots. Republican and/or a bigot is a choice After all, in a state such an Indiana (which just legalized the right for citizens to discriminate against people with whom they disagree based upon their religious beliefs), shouldn't people in that state (or any other state with similar laws) then be allowed to discriminate against ...","post_message":"With the arguments for marriage equality heating up soon at the Supreme Court, TakePart.com has a handy \"here's what's up\" article full of background, context, and facts. Yay, learning!"},{"comment_id":"10153428454984087","commenter_b":"She is the biggest liar in history ,ashamed she was the first female to prove it.. Disgraceful bitch.","commenter_a":"Go go go >3","post_message":"\"Do you believe that The State Department, on NEW YEAR'S EVE, just released more of Hillary's e-mails,\" Donald J. Trump tweeted. \"They just want it all to end. BAD!\""},{"comment_id":"941291755930573","commenter_b":"Women are just as bad..","commenter_a":"Men are pigs","post_message":"She reported them to police because she said it made her walk to work an 'awful experience'"},{"comment_id":"1746275522311169","commenter_b":"Larry, I didn't say \"fire a weapon,\" I said \"purchase and carry a firearm\" Should a gun shop sell a firearm to an 11 year old?","commenter_a":"Back then it was muskets against muskets. Now we have semi autos and the government has fully autos. Seems like we are already behind with the second amendment.","post_message":"#LiberalLogic"},{"comment_id":"10153936171871813","commenter_b":"Your wifes hot though LOL","commenter_a":"If your not in Law Enforcement nor never have been dont even bother to comment on this post","post_message":"Here’s a way to increase much-needed police accountability — especially when force is used."},{"comment_id":"10153515139311680","commenter_b":"Hillary already knows she's becoming the POTUS. There's nothing stopping her. We will have a female president! Can't wait. #ImWithHer","commenter_a":"It's just riding off of the success of Bill because nobody likes her","post_message":"Hillary Clinton: \"I’ve told my husband he’s got to come out of retirement and be in charge of this, because you know, he’s got more ideas a minute than anybody I know.\""}]
