[{"comment_id":"10155189729959199","commenter_b":"Kill the mother.or hang up.her...","commenter_a":"Sick twisted and very disturbing","post_message":"Police say this mother killed her baby by feeding her a teaspoon of salt in order to get back at the child's Dad >>> via.q13fox.com/zXtwH"},{"comment_id":"1566749223612191","commenter_b":"Make no mistake Maggie I no where near put A women that murders children on the same level as animals. ANIMALS ARE BETTER THAN THAT.","commenter_a":"If a woman has an abortion she should IMMEDIATELY BE FIXED SO SHE CAN NOT EVER KILL ANOTHER CHILD.","post_message":"Abortion is MURDER!"},{"comment_id":"1080674971953513","commenter_b":"And then she has an ungrateful kid... Lol","commenter_a":"How do they even survive that? Oh the pain! I hope they are able to get epidurals.. 😉","post_message":"The egg is so large that in the last few days before laying it there is no space left inside the mother for food. She is forced to fast."},{"comment_id":"10154043523939203","commenter_b":"Mr Pope! Tear down that wall!","commenter_a":"If somone keeps coming on my porch and coming in through my door and rapes and kills, at some point I am going to lock the door!","post_message":" person who thinks only about building walls, wherever they may be, and not of building bridges, is not Christian.\""},{"comment_id":"1090355681009413","commenter_b":"IT'S CALLED CORPORATE WELFARE , and it's been going on for way tooooooo long , and it needs to STOP !!!!!!!!!!","commenter_a":"the republican way","post_message":"Congress continues to let billionaires slide and pats the back of the wealthy while every day Americans suffer. Sign your name to help raise the minimum wage →   @webpagelink  (Hat tip to The Other 98%"},{"comment_id":"10154572108529087","commenter_b":"She should put on her fake Indian outfit on.","commenter_a":"WARREN IS A BRAIN DEAD DUMBACRAT !!!","post_message":"Elizabeth Warren: \"Congress must pull its head out of the sand and launch a real, bipartisan, transparent inquiry into Russia. Our national security is at stake.\""},{"comment_id":"10153290749172426","commenter_b":"Had he handled it the nasty note wouldn't have been left. Women can be shallow. Personally I pay quite frequently but you can't tell me this dude doesn't know how his wife can be...so just handle it.","commenter_a":"Classic husband who didn't even pay for the meal and the wife had to....lmao","post_message":"\"So Jenny, here's a life tip for you from me...\""}]
