[{"comment_id":"10154319112003812","commenter_b":"Cover that nipple, girl.","commenter_a":"Time and a place for everything that was not the place. Plain and simple.","post_message":"Woman says she was kicked out of a North Carolina courtroom for breastfeeding during a child custody hearing. \"Ma'am, you need to cover up.\""},{"comment_id":"531107707082073","commenter_b":"What a bunch of trash. Next time get up and yell back and pin them against the wall. Come on white people stop taking this shit from these thugs!","commenter_a":"We need to start taking care of business.","post_message":"\"...screaming racially motivated chants such as, “F*ck you, you filthy white f*cks!”, “F*ck you and your comfort!”, and “F*ck you, you racist sh*ts!” One girl was even reported to have been pinned by protesters against a wall, who allegedly shouted “filthy white b*tch” in her face.\""},{"comment_id":"10152889795339342","commenter_b":"Thanks to the OTHER hospital! Her hospital didn't even say what Duncan had! They kept it from her!","commenter_a":"Personally, I'd just be happy to be alive.","post_message":"SO CALLED \"EBOLA NURSE\" NINA PHAM PLANS TO SUE: The 26-year-old nurse said that the hospital where she had worked in Dallas and its parent company failed her when she contracted Ebola while caring for the first person in the U.S. diagnosed with the deadly disease."},{"comment_id":"674830109374234","commenter_b":"This America and every body should be able to fly our flag and if any muslim feels threaned then they can just leave your country and go back to where they belong and stay there","commenter_a":"I say- \"TOUGH\"","post_message":"You'll never believe why this man was forced to remove his flag.  This is absolutely wrong. If you're offended by the flag, LEAVE.  Can we get 20,000 'LIKES' in support of the American Flag?"},{"comment_id":"10154180124161770","commenter_b":"She is an evil witch who got away with murder.","commenter_a":"Poor baby dog","post_message":"The entire nation thought Casey Anthony murdered her daughter..."},{"comment_id":"10154244362139411","commenter_b":"@username - Shut up bitch","commenter_a":"I can just see a flood of poor women getting pregnant so they can sell babies. What a terrible idea. Plus the fact that many which grew up in a state foster home become criminals if not adopted early","post_message":"'Chance to live'"},{"comment_id":"10154509463236162","commenter_b":"Same Jen same","commenter_a":"@username... worried for @username","post_message":"HOT DOG RECALL: Put down the hot dogs!   372,000 pounds of hot dogs and corn dogs are being recalled over concerns of listeria contamination.  Bar-S Foods is recalling five chicken and pork products.   The recalled items include Bar-S bun-length and classic franks made with chicken and pork, Bar-S classic corn dogs and Signature Pick 5 corn dogs."}]
