[{"comment_id":"10153764153724117","commenter_b":"Hey you fucker","commenter_a":"It's simply beyond comprehension how anybody can even entertain the drivel that spews forth from his vapid-short-sentence-narcissistic mouth. (And disclaimer for the inevitable butthurt Repubs, Clinton isn't any more trustworthy. Happy now?)","post_message":"Donald J. Trump is selling skepticism about the democratic process because he does not believe in it himself."},{"comment_id":"10153709556991880","commenter_b":"Mario","commenter_a":"Maggie Urgupluoglu","post_message":"The city's five boroughs are filled with hidden spots."},{"comment_id":"10153876447145329","commenter_b":"Attention whore.","commenter_a":"Laura This might help you understand some stuff","post_message":"Is ~everyone~ on Twitter fighting? (via BuzzFeed UK)"},{"comment_id":"10153932713210950","commenter_b":"@username that's my point. If she wanted to look like a pig she should have stayed on the farm lol","commenter_a":"It wasn't a few pounds, she got fat!! It was her job to maintain an appearance and she failed. If she didn't want to be judged for her appearance then don't enter a beauty pageant. Smh","post_message":"This former Miss Universe says Donald J. Trump's comments about her brought up bad memories from 20 years ago when she gained a few pounds after winning his beauty pageant."},{"comment_id":"1199547530099410","commenter_b":"They should all be missing persons by now. These people are NOT seeking refuge. They are invaders brought here by our own president.","commenter_a":"Need to all be deported ASAP!","post_message":"MINNESOTA: MOB OF SOMALIS RAGE Through Upscale Neighborhood Threatening To “Kidnap” And “Rape” Homeowners [VIDEO]"},{"comment_id":"10153855606886336","commenter_b":"How come you mother fu*kers can't just go to school and stfu?","commenter_a":"Yes","post_message":"Are students demanding too much power?"},{"comment_id":"10152876671446336","commenter_b":"Lol really woman. I think its sweet","commenter_a":"Davetra Fleary","post_message":"Twenty years ago, Brittney Husbyn and Briggs Fussy walked down the aisle as flower girl and ring bearer at a wedding. Saturday, they did it again… only this time as bride and groom."}]
