[{"comment_id":"10154230428956509","commenter_b":"To protect us from bringing terrorists here. How can you tell if a Muslim is not an extremist?","commenter_a":"I don't think they should have to be Christians, just not Muslim.","post_message":"\"I don't know if you can prove that they're Christian... How are they proving it?\" Donald J. Trump said about Syrian refugees. @webpagelink"},{"comment_id":"1107974842571087","commenter_b":"She lies and lies and lies and lies and . . .","commenter_a":"I AM SO DISAPPOINTED BY YOUR NEW JOB DR BEN CARSON , YOU WERE BETTER AROUND WHITE COAT....[...]","post_message":"Is anyone surprised?"},{"comment_id":"10154021550142377","commenter_b":"I see three women who should no longer be Senators!","commenter_a":"We have our own problems to solve. stop sticking your noses were they do not belong !! No other nation has made this kind of statement !!! $6Tril we spent and we have nothing except dead soldiers !!!","post_message":"Republican Sens. John McCain and Lindsey Graham have issued a blistering condemnation of the failure of the United States to act to prevent the slaughter of hundreds of thousands of people in Syria."},{"comment_id":"10154061820451955","commenter_b":"It is just amazing that she can't take both of Bernie's knees out with a snap of her fingers. Something is brewing...","commenter_a":"Time to start planning a street party when Donald J. Trump wins the election. One thing for sure, Hillary Clinton won't be elected DOG CATCHER!","post_message":"SHE LOSES AGAIN"},{"comment_id":"10152863643681990","commenter_b":"Illegal immigrants should not be here to commit any crime. U. S. Citizens do not need the extra concern.","commenter_a":"Yes look at Dyllan Roof he looks Latino... He shoot 9 black people last month in church.","post_message":"IMMIGRANTS AND CRIME: Despite rhetoric in the Pier 14 shooting Francisco Sanchez case, immigrants do not commit more crimes that U.S. citizens. That's according to 100 years of research according to the American Immigration Council. @webpagelink"},{"comment_id":"10152763555906051","commenter_b":"This is just getting so ridiculous why don't people just mind your own business and live her own life grow up","commenter_a":"i think she is one hell of a shot. i wouldent piss her off. leave her alone. your just jelous because you can't bow hunt as good as her. she is feeding someone. you have nothing to be scared of with an eye like yours. u go girl.","post_message":"This woman has been getting death threats over her photos. Decide for yourselves if the criticism is warranted."},{"comment_id":"10154980459782235","commenter_b":"I would suspect it was an operation right out of the Kremlin. If so it's an act of war.","commenter_a":"C span has confirmed it happened and operating right now under the theory that it was an internal routing problem on their end. They advised they will update if they find out anything different happened.","post_message":"What the hell just happened?"}]
