[{"comment_id":"10153635074276336","commenter_b":"Christina you are made of stupid. Those two things aren't even comparable.","commenter_a":"Good for her! Besides if they can deny hunting licenses because of convictions then they can deny marriage licenses for same sex couples for the same reason!","post_message":"“Some people have said I should resign, but I have done my job well,” Rowan County Clerk Kim Davis said in a statement."},{"comment_id":"10152809314113645","commenter_b":"It SHOULDN'T MATTER SHE IS A MURDERER !!!!!'","commenter_a":"murder charge now!!!","post_message":"Sad update to pass along, family tells FOX 4 that a teenage girl who was critically injured last Friday after being hit by a car was taken off of life support today."},{"comment_id":"10156761367765354","commenter_b":"quit giving her the time of day!!!","commenter_a":"Who knew behind the mask was a racist cop hating jerk, I heard Kanye needs some $$$$ since you gave the black panthers so much why don't you give $$$$$ to another cop hating jerk so he can lavish Kim.","post_message":""},{"comment_id":"976047545785108","commenter_b":"Go go Hillary, you will be next USA-President.","commenter_a":"Go Hillary all the way","post_message":"“Beijing is normally very hot and very dry in September, but it just poured rain throughout the conference. The Chinese claimed that it was the fault of all these women in Beijing.” Watch the history of Hillary’s stirring speech at the 1995 UN Women’s Conference:"},{"comment_id":"10153296243781130","commenter_b":"So if this chick had aids and she was bleeding all over, that's cool right?","commenter_a":"And in the meantime virtually no attention was paid to the actual winner of the women's race, Tigist Tufa. Instead the media focuses on this woman and her disgusting stunt. Why am I not at all surprised that Huff Post jumped on the bandwagon.","post_message":"\"Periods are here to stay, and our generation has the power to put this conversation on the map today in order to blow through stigma.\""},{"comment_id":"10154500485544062","commenter_b":"So the one girl should go back to Chicago? That's where she was born so that's her home.","commenter_a":"Assimilate, dump your hateful evil religion; or maybe you should go back wherever 'home' is.","post_message":"What would you have done in this situation?"},{"comment_id":"1923069711254227","commenter_b":"so far 1.5 million people have liked my last comment PERIOD!!!","commenter_a":"My gawd it's an immigrant disrespecting the flag! Shouldn't O'Reilly and Hannity be all over this? Lqtm","post_message":"Oh, how they would SCREAM! Shared by Occupy Democrats, LIKE our page for more!"}]
