[{"comment_id":"10154233852123445","commenter_b":"Eww shut up bitch i do but ive seen u more than her 👊😛","commenter_a":"@username @username @username @username haha hell yea i do !😂😂😂😂","post_message":""},{"comment_id":"666187176847797","commenter_b":"Too much butt kissing being done. The pilot and his white privilege remark, the seat mate's skin color even being mentioned, the flight attendant feeling compelled to apologize...oh, brother! This chick needs to put her big girl panties on and if she's a peace loving/seeking person, she'd drop the whole issue.","commenter_a":"So let all muslims boycott United, I will feel much safer with them not being there. Muslims are lower than whale shit.","post_message":"Look what happens when a flight attendant refuses to give a Muslim woman a Diet Coke..."},{"comment_id":"10153587762999087","commenter_b":"She's above the law.","commenter_a":"Bloody Hell , Hillar-ious Hellary should have been an evil stand up comedian..","post_message":"Hillary Clinton on dropping out of the race if indicted: \"Oh for goodness, that is not going to happen. I'm not even answering that question.\" #DemDebate"},{"comment_id":"10153010022651770","commenter_b":"They boy that was trying to force the little girl in the bathroom was asked why did you do that ,an the boy said ,thats what daddy does to mommy !!!!","commenter_a":"Little kids are not mature enough to determine if they are transgender. They have been brainwashed.","post_message":"Miraloma Elementary principal Sam Bass said the bathroom change is because between six and eight students have decided they are transgender, or are tomboys."},{"comment_id":"10153535690187235","commenter_b":"Smh then leave America . most people who care about a lion will definitely care about a person .... They are both worthy .","commenter_a":"Because the lion will see actual justice and the same can't be said about Sandra or any other person who has died while in police custody......how sad is America smh","post_message":"Someone had to say it ..."},{"comment_id":"1411629742215405","commenter_b":"She is nothing but a stinken trouble maker, kick her behind out of our country","commenter_a":"This fk needs to go","post_message":"Socialist Seattle City Councilwoman Kshama Sawant said activists should demand the mayor use local police to block Immigration and Customs Enforcement agents. Read both sides [here: kiro.tv/SawantOnICE] and tell us what you think: A. Yes, we need to hold ICE accountable B. No, police are needed for all protests C. We need a solution, this isn’t it. D. Wait, what? E. (Enter your own answer)"},{"comment_id":"991842820828524","commenter_b":"No it doesn't. Vermont has Constitutional Carry, and Vermont is the safest state in the union. @webpagelink","commenter_a":"Thank you, Governor. The current law works just fine.","post_message":"Governor Maggie Hassan issued the following statement today on Senate Bill 116, repealing the license requirement for carrying a concealed pistol or revolver: “New Hampshire’s current concealed carry permitting law has worked well for nearly a century – ensuring the Second Amendment rights of our citizens while helping to keep the Granite State one of the safest states in the nation. Law enforcement, as well as citizens across New Hampshire, have strong public safety concerns about allowing people to carry concealed guns without a license and oppose removing the protections that the licensing process offers to help ensure that potentially dangerous individuals are not allowed to carry hidden weapons. “Our permitting system gives an important oversight role to local law enforcement, while allowing for appeals through appropriate channels. In his book Live Free or Die, Republican Governor Mel Thomson said that the current permitting process for concealed carry is ‘a ..."}]
