[{"comment_id":"10156496631915354","commenter_b":"Send her back, bitch!!!","commenter_a":"She is simply unqualified...","post_message":"This radical Leftist principal is out of control.  The principal's name is Eujin Jaela Kim. And what she's up to will infuriate most Americans."},{"comment_id":"1018817644877956","commenter_b":"#STOPHATEANDFEARMONGERING #dumpTrump #VOTEDEMOCRATS","commenter_a":"I have a bet going that Trump declares bankruptcy again after he loses the nomination. I hope he loses everything and all his foreign factories close down. DUMP THE TRUMP DUMP THE TRUMP DUMP THE TRUMP","post_message":"You reap what you sow."},{"comment_id":"10153069048676770","commenter_b":"Both are bitchs","commenter_a":"I see that Meryl has picked her poison.","post_message":"\"How can people like Meryl Streep and Hillary Clinton envision themselves as rebels when they are the establishment?\""},{"comment_id":"10153074180200090","commenter_b":"she is evil and lies so much her nose is growing!","commenter_a":"Question? Why do Hiliary, Rosie and Michelle always have their mouth open when they never say anything.","post_message":"Take the survey if you know Hillary Clinton is trapped in a web of lies: @webpagelink"},{"comment_id":"10154475090187098","commenter_b":"Let's nuke 'em now !","commenter_a":"Can we drop some nukes on them already? What's taking so long?","post_message":"MISSILE TEST: North Korea reportedly fired a ballistic missile in what would be its first such test of the year and an implicit challenge to President Donald Trump new administration."},{"comment_id":"838459919590086","commenter_b":"Women who love Trump here.","commenter_a":"Montana here.","post_message":"LIVE NOW: Donald Trump expected to arrive at a \"Thank You Rally\" in Cincinnati, Ohio soon. It's the first of several stops for the President-Elect's thank you tour."},{"comment_id":"10154833870921336","commenter_b":"The pussy you are referring to is a family who call themselves Lisa, nice safety pin by the way, do they make them in mens?","commenter_a":"If Trump states that 'Nothing will Change', then he should stop being such a pussy and stop belly-aching about the recount. He's a complete WIMP.","post_message":"Reince Priebus slammed Dr. Jill Stein's presidential election recount effort, which was recently joined by Hillary Clinton's campaign."}]
