[{"comment_id":"894010200634440","commenter_b":"I'll call him a she once he's a female according to the dictionary.","commenter_a":"Caitlyn Jenner's award acceptance speech. Uplifting, heartfelt, inspiring... Courage, intelligence, compassion, awareness, education... Caitlyn pointed out many of the crucial life and death issues facing trans folks nationally and globally. She made an impassioned plea for acceptance and respect for all of humanity and the trans community in particular. For such a new figure in the global trans community, she did an excellent job at getting the truth across. Her speech had me in tears early on and particularly when she addressed her family and her mom. Something additional: twenty percent of transgender people have served in the military, which is double the percentage of the U.S. general population that has served. Close to 16,000 trans folks are currently serving in the U.S. military. Close to 135,000 trans Veterans have served.","post_message":"'Oh you know, just in the kitchen by myself crying because of Caitlyn Jenner's ESPYs speech.'"},{"comment_id":"1093117534044369","commenter_b":"He should be slut shamed with a fire ant bath!!","commenter_a":"The term 'slut shame' is fucking ridiculous in and of itself, but saying that the judge was 'slut shaming' a rape victim is fucking horrendously disgusting. This judge should be suspended, and whoever made the title for this article should be fired.","post_message":"Holy sh*t."},{"comment_id":"451215538402360","commenter_b":"I will refuse, fuc her and the dirty dog she rode in this on!","commenter_a":"YES","post_message":"Will You Refuse To Turn Over Your 2nd Amendment Rights To Michelle?  Comment 'yes' or 'no'."},{"comment_id":"10152746929711167","commenter_b":"Name a lie, Grace? You've apparently chosen to forget the lie about 'sharia no-go zones in France!!!!' that Fox had to retract. Of course you forgot it--you wipe your brain before turning on Fox News, don't you?","commenter_a":"You've got to love the weasel attempt by the corporate media to create a special category of 'non-journalism journalism' for Fox News and Bill O'Reilly, whereby they get to brag about being 'Fair and Balanced No-Spin Zone' news reporters and join the White House press corps, but get a free pass to lie to their audience.","post_message":"Normally, you can't get this many Americans to agree what color the sky is."},{"comment_id":"10154692887376336","commenter_b":"Deplorable Californian here","commenter_a":"Ga.here","post_message":"Live Now: Donald J. Trump speaks in Columbus, Ohio."},{"comment_id":"10154379049296028","commenter_b":"The tourist started it. There are reasons they had to close up. Their computers weren't working and they were forced to close maybe for an hour. Stupid tourist wanted to fight. She assaulted the employee first (yes, throwing water at someone is considered assault) causing the employee to be in defensive mode. Maybe that employee should be suspended for 2 days and hopefully she's not fired.","commenter_a":"What? You are not going to stack the coupons and price match??","post_message":"A woman's desire for a post-Christmas bargain took a violent turn. The confrontation caught on camera shows a store manager and a customer get into a scuffle in front of awaiting shoppers at a Florida mall. @webpagelink"},{"comment_id":"1425549500793527","commenter_b":"I hope Ellen tells them all to eff-off. America needs to take a stand against these whiney brats.","commenter_a":"It's hilarious not racist!!!! Come on!!!!","post_message":"People are not happy with Ellen DeGeneres' Usain Bolt photo."}]
