[{"comment_id":"834137006720940","commenter_b":"It's called dual citizenship, I suggest you look it up.","commenter_a":"I guess the fact that Malik Obama is a Kenyan citizen, currently living in KENYA and cant vote in an American election doesn't mean anything...ughhh once again those pesky things called facts always getting in the way of a good story","post_message":"Wow, President Obama's brother, Malik, just announced that he is voting for me. Was probably treated badly by president-like everybody else!"},{"comment_id":"1318671731495117","commenter_b":"So basically women have no rights to privacy in a woman's bathroom or locker room. So women have no rights in Washington State.","commenter_a":"They make a law for about one hundred (max) people. The Washington government doesn't think much of all the rest of the states people do they. What a waste of time.","post_message":"Big Brother is watching"},{"comment_id":"593055850861224","commenter_b":"AmandaSmith I understand but people wake up in Florida and sometimes find Alligators walking in their yards or in the bottom of their swimming pools. Disney World was actually built around swamps. Yes they altered the swamps and created the lagoon but it has always had alligators in it. Sorry a toddler died because of the lack of understanding of that fact.","commenter_a":"Give me a break. My 7 year old heard about this and the first thing she said is \"why would they go near the water? It's Florida! Everyone knows there are alligators in Florida!\". We are from Wisconsin.","post_message":"A case against Walt Disney World would hinge on whether or not the resort knew about the alligators living in the resort's Seven Seas Lagoon."},{"comment_id":"10153687652479885","commenter_b":"That was stupid! Sounds like she needs to take that conceal carry class again!","commenter_a":"If you pull a gun out you need to pull the trigger. Shoot to kill not just threaten.","post_message":"A Florissant man was charged Tuesday with grabbing a pistol from a woman Saturday as she was trying to prevent him from attacking her friend in University City, then beating her and her friend with the gun and shooting one of the women."},{"comment_id":"10153157733159197","commenter_b":"She looka likea man.","commenter_a":"the scowl on the face of #3 is pretty funny","post_message":"Have you been to a spa in East Hartford lately? It could be one that was shut down after a prostitution bust-->> @webpagelink"},{"comment_id":"936069706469980","commenter_b":"Colleen Boulden Jj Kane","commenter_a":"Ryan Lindgren take me here !","post_message":"Clark Griswold would be envious of this home on Prior Road in Wilmington, Delaware. The huge Christmas light display caught the attention of the SkyForce10 team while they were flying to another story. The set-up even has a walk-through section. Share your favorite lights displays with us here on Facebook or through the NBC10 app!"},{"comment_id":"10154161190123837","commenter_b":"Some psycho wife probably found out and messed it all up for everyone, typical.","commenter_a":"Lock her up!","post_message":"DOLLS BEAUTY SUPPLY: This business wasn't attracting women to buy cosmetics. Detectives believe it was attracting men to pay for sex."}]
