[{"comment_id":"10154318363317232","commenter_b":"Why aren't they being plowed through? Run these scumbuckets down!","commenter_a":"Sent in the robot","post_message":""},{"comment_id":"10154777033398128","commenter_b":"Are you jealous?","commenter_a":"Elvira Jaha","post_message":"London Calling: The U.K. has become the cheapest market in the world for luxury goods."},{"comment_id":"1120443904657696","commenter_b":"Google Michael L. Robinson. Transvestite.","commenter_a":"Should say make the First Lady a LADY again. Take that Michael. Obama perpetrated the greatest fraud against America ever and will get away with it. You watch.","post_message":"Is this cartoon offensive?"},{"comment_id":"1151612978215863","commenter_b":"Nah, Katie. You want to talk about the real world?? Hillary Clinton is the candidate of the \"real world,\" where people DO suffer, most certainly. They are primarily people of color. They are Arabs and Persians living under constant threat of US drones. They are black youth who have been dubbed super-predators by Hillary, who have been beaten and bloodied by the police that she helped arm, and that she helped expand. They are Hondurans and Egyptians and Libyans who have been subjugated by the regimes in their countries, regimes that only exist because we can't seem to keep our fingers out of everyone else's pie. Neoliberal policy has caused more suffering in this world than even Trump promises to bring. Secondly, voting in line with ones genuine ideology is not reprehensible in the slightest. If everyone understood that, maybe we wouldn't be stuck in the two-party, lesser-of-two-evils rut that ...","commenter_a":"Lmao, fat chance on that one. His endorsement solidifies that he has been enveloped into the Democratic Party, where social movements go to die. His most ideologically loyal supporters will be voting for #JillStein, because #NeverHillary , and #NeverTrump","post_message":"Most of the #FeelTheBerners who now say they’ll go third party would otherwise be backing Clinton."},{"comment_id":"10153640013936636","commenter_b":"O questo o un procione non voglio altro siamo io e te li vedi li vedi Dio pinolo?!","commenter_a":"Luca sparati in bocca con me","post_message":"Red pandas have an adorable wrestling competition Via Detroit Zoo"},{"comment_id":"10153212063865950","commenter_b":"U go girl.....GIRL POWER....kick that pussy ass thieves ass","commenter_a":"Wow. Go serena","post_message":"When Serena Williams saw a thief snatch her phone at a restaurant, she took matters into her own hands. Without thinking, she jumped up, leaped over a chair or two and chased the suspect down. She was on him in a flash."},{"comment_id":"10153129588721051","commenter_b":"Bitch, the only person rotting is you.","commenter_a":"The US has went to hell. Gays allowed, and 10 Commandments comes down. Shameful.","post_message":"Should this Ten Commandments statue stay up?"}]
