[{"comment_id":"1799477110270557","commenter_b":"IF CROOKED CLINTON GETS IN, IT WILL BE THE END OF AMERICA AS WE KNOW HER. GOD HELP Donald J. Trump WIN.","commenter_a":"Of course Donald Trump is low in the polls if that's all your polling are Democrats hello","post_message":"\"I think, frankly, he's going to end up beating Hillary by a surprising margin.\"  On Fox & Friends, Newt Gingrich touted Donald J. Trump's \"two historic speeches\" this week."},{"comment_id":"1059210544118408","commenter_b":"Ramos is a Mexican so he won't listen to reason. When we lived in Temecula, Ca., our Mexican neighbors next door would go down to the Mexico/San Diego border & pick up illegals & bring them up to live in their garage!!! So I know firsthand what goes on at the border!!!","commenter_a":"Immigrants aren't the root of this country's problem. #scapegoat.","post_message":"Do you agree with Bill O'Reilly here?"},{"comment_id":"507799699345070","commenter_b":"yeah right.there only big when they got a gun...fucking pussy hole pigs","commenter_a":"Anyone who hates the cops is an idiot. It's time the police took some control back","post_message":"I keep hearing about this \"war on cops\". Here is more proof that it is actually a war on citizens, not the other way around."},{"comment_id":"1260826810599396","commenter_b":"Fuck her","commenter_a":"Carla A. Auguste Imani Rice Qiana Lewis Shequla Mason @username","post_message":"For everyone who hates Sallie Mae..."},{"comment_id":"349180888539647","commenter_b":"Yeah, women's lib.","commenter_a":"I'd rather have her NOT have a romance - I thought that was the whole point!","post_message":"The hashtag #GiveElsaAGirlfriend began trending as many Twitter users voiced their support for a gay character in the Disney movie. What do you think?"},{"comment_id":"10153996676511770","commenter_b":"Her hips are way way too big. She just looks out of proportion","commenter_a":"Fat and ugly wannabe!!! Hope she is going into psychiatry!","post_message":"Do her steamy Instagram photos cross the line?"},{"comment_id":"10154129008215329","commenter_b":"Sharon lol i couldnt find the woooorrddd","commenter_a":"I'm 15... i mean, i know how to use a CD player, and i know how to listen to a CD. i also know how to use a cassette and all but now a days, most computers don't even have a slot... we also got rid of our CD player ages ago... i haven't bought a movie on DVD in soooo long because everything is digital now","post_message":"So you've purchased Adele's \"compact disc\"..."}]
