[{"comment_id":"725221097581400","commenter_b":"This Latino American Women thinks its terrible that people here illegally are breaking laws & think its ok no its not..","commenter_a":"The petty haters whining about tax dollars need to just have a seat. And take a long, hard look at themselves. A) she's a CHILD B) she's going to go further in life than any of you small-minded simpletons because of her drive and determination, and her GPA and scholarships were a direct result of that. She didn't show up on free Yale day. She is smart, worked her butt off, and is on track for the kind of success she deserves.","post_message":"Larissa Martinez held a 4.95 GPA and took 17 AP classes over her McKinney Boyd High School career. She's also an undocumented immigrant who arrived in the U.S. in 2010 -- but only 10 of her classmates knew that before last week. After her speech, they gave her a standing ovation."},{"comment_id":"10153127033512383","commenter_b":"Draw the little snakes out","commenter_a":"Bring it!","post_message":"UNAFRAID: Troops remain defiant on social media in the wake of the recent threat against military personnel from the Islamic State group."},{"comment_id":"10152994930245671","commenter_b":"Because she knows she can get a pay day from the police.","commenter_a":"Her brain is definitely injured. She says she wanted the cops to back off, but if they hadn't been there she would be crying a different tune - saying they should have been there. She really thinks with all those guns and ammunition, that they would have just found there way home? They would have executed her.","post_message":"“My hopes for the whole thing were the cops would just back off, let these guys get where they needed to go, so me and Misty could find our way home somehow.\""},{"comment_id":"10154216740214160","commenter_b":"Says the woman who's husband cheated on her and she cheated on her husband","commenter_a":"People in Power need to lower their Kelly's.","post_message":"\"Today I ask Donald J. Trump to step aside,\" wrote Carly Fiorina."},{"comment_id":"10153331383855329","commenter_b":"Ummm they are...? If a diamond ring is a deal breaker for a woman she needs a reality check","commenter_a":"Thank fuck I have a husband who knew when he was proposing to me that I'm not a shallow twit who will only accept diamonds :) Also to those who say you don't get the sparkle with a fake, let me tell you, you do, you get sparkle in abundance, just because its \"fake\" doesn't mean its not good quality!! My rings catch many an eye and always oh that must of cost a lot bla bla bla, as far as I would be concerned my advice to men would be that if she DEMANDS a diamond she is not worth it :)","post_message":"Put a diagram on it."},{"comment_id":"10153301288059411","commenter_b":"Yeh the Danish who's having sex with dogs are Muslims too. Many US states still legalize animal sex until today. Bow down to your ziojew masters and shag some horses","commenter_a":"Jews been making porno videos using American girls and animals ( dogs, horses) for centuries now. Disgusting vermin","post_message":"No more animal brothels"},{"comment_id":"10155064205902178","commenter_b":"Don't they know it's a \"shark free zone\"! This method works for criminals who take heed to gun free notices.","commenter_a":"Joe Daniel","post_message":"An 11-year-old boy was bitten by a shark off the coast of North Carolina yesterday, the second incident in as many weeks. >>>wral.com/@username"}]
