[{"comment_id":"10152550592377014","commenter_b":"Someday we would love too visit, Beautiful!!","commenter_a":"Jeremiah Ludewig it's so pretty but idk if I could do with cactus lol","post_message":"Another night, another stunning Arizona sunset sent in by a great 3TV viewer. Thanks, Rosanne Zimmerman!"},{"comment_id":"10158461091345206","commenter_b":"I wouldn't put it past that liar!!","commenter_a":"Dan Elsa","post_message":"“Early in Clinton’s tenure as secretary of state, she and her staff were observed removing lamps and furniture from the State Department which were transported to her residence in Washington, DC.\""},{"comment_id":"1324289204299860","commenter_b":"LOCK HER UP!!!...LOCK HER UP!!!!...HILLARY FOR PRISON NOW!!!!...IT MUST BE PROVEN TO ALL THAT NO ONE IS ABOVE THE LAW IN OUR AMERICA!!!....HILLARY'S CORRUPTION WILL NEVER STOP TILL SHE IS BEHIND BARS!!!!!.........TRUMP IS THE PRESIDENT AMERICA DESERVES!!!....GOD BLESS OUR NEW PRESIDENT!!!!.","commenter_a":"Tried to listen to Jill's reason for the recount but she made no sense. She is the reason Hillary lost and she's nuts. Wouldn't vote for either of one, both are evil.","post_message":"Uh-Oh, Hillary! Trump Just SMASHED Down The Hammer On Crazy Vote Recount Scam! THROW THEM BOTH IN JAIL!"},{"comment_id":"884338575001603","commenter_b":"Good Riddance to Hillary Clinton!!!","commenter_a":"It's about damn time!","post_message":""},{"comment_id":"961148523904901","commenter_b":"Every female I pursued that said \"No, I am not interested in more than being friends\" at some point had sexual relations with me and enjoyed it after I kept pursuing her in ways she WAS responsive to! some women want gifts and loads of flattery before they say. When they dont want to be friends, I stop pursuing them, until then its their choice to hang or not. The only clause is when they ended up being lesbian women!","commenter_a":"No means No! Some people don't get it. If someone is not interested in you move on.","post_message":"After a 14-year-old girl told her mom that a boy was aggressively pursuing her at school, her mom, a clinical sexologist and video blogger, decided to post a video to the boy on YouTube. >>@webpagelink"},{"comment_id":"1542337212473798","commenter_b":"Anyway, porn is evil and consent can never be bought!","commenter_a":"Fact is, some women enjoy sex, some women enjoy porn, and by saying a woman cannot or should not participate, and that they are all manipulated, you are taking away their right to choose. Thats antifeminist. Further, you are aaying women, by nature, are easily manipulated and dont know whats good for them, and thats also antifeminist. I ssy, as long as a woman is freely chosing the career, and is informed of what it entails, then have at it.","post_message":"How do we make pornography better for actors and the people who consume it?"},{"comment_id":"10154174664018812","commenter_b":"She's repeatedly called black people, \"Super Predators\".","commenter_a":"It is sad what the Clinton machine has done to such a great man. While Blacks were fighting for equal rights in the '60s. Sen. Sanders was on the front lines risking his life while Sen. Clinton was supporting a white supremacist. Most of my fellow Black American brothers and sisters have unfortunately fell for the Clinton scam and it is going to cost us big time.","post_message":"JUST IN: ABC News projects Bernie Sanders will win Nebraska Democratic caucuses."}]
