[{"comment_id":"1624969957723265","commenter_b":"That poor little girl. Her mother could have killed her driving around while heavily intoxicated. She clearly had time to buy and drink alcohol but not make sure there was food in the house???","commenter_a":"Don't have any sympathy for a mother that drives drunk with a child in the car. She could have killed her or someone you love. She should lose custody of the child.","post_message":"If you have blood flowing through your veins this video should make you furious! Watch it HERE: @webpagelink"},{"comment_id":"950601424986485","commenter_b":"It is none of your concern if a person has an abortion, mind your own business!","commenter_a":"if a woman is too careless/stupid to not have 'protected' sex, then she gives up her right to murder an innocent child! BE A RESPONSIBLE PERSON not a murderer!!!!","post_message":"An excellent idea!"},{"comment_id":"10153221460464087","commenter_b":"I don't get why liberals are being such cry babies? Don't get so upset about losing votes. Illegal is illegal. Period. Come back to the country Legally!","commenter_a":"You have my vote MR Trump!!","post_message":"\"The first thing I'd do in my first day as president is close up our borders so that illegal immigrants cannot come into our country,\" Donald J. Trump vowed."},{"comment_id":"10156383221255354","commenter_b":"I can face God and not fear my fate if all muslims are eradicated from the earth. This is only the first of many attacks and I feel not a single muslim can be trusted. Call it racism, call it profiling or plain ol fashion hatred but they all are the enemy to the rest of us and their death is our only option.","commenter_a":"War involves two sides! Until we realize the Muslims are at war with us, we will continue to lose!","post_message":"\"This is war.\""},{"comment_id":"635476119976300","commenter_b":"And we are apparently buying her cigarettes for her, good for nothing jackass. Where are the FATHERS, let those suckers pay for their babies they fathered!","commenter_a":"Deport !","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"1723416237718117","commenter_b":"In my book, Angela Merkel will go down as one of the greatest people to have walked the earth. She opened the door for strangers when everyone else closed theirs. There were far worse atrocities happening in Germany and Europe before the arrival of immigrants. Xenophobes that previously had no excuse for their hate are happy to see their own people killed by minority terrorists just to justify their hatred for the rest of humanity.","commenter_a":"Merkel should be tried for treason. She is directly responsible for all of the sexual assaults and murders that have taken place!","post_message":"You can ban the burka, Frau Merkel. But what are you going to do about banning the migrant boats YOU encouraged to come and which are destroying your country?"},{"comment_id":"10154942733646873","commenter_b":"Sally Yates we need more of you. Well done.","commenter_a":"We have a dictator as presidentDon't agree with him ,you are fired","post_message":"Sally Yates had said the Justice Department would not defend in court Trump's immigration order."}]
