[{"comment_id":"10154144883178984","commenter_b":"I liked Cruz before he started his dirty campaign, now I have no respect for him","commenter_a":"Trump gets more coverage than anyone especially at Fox. People should take a look at Ted Cruzs resume and determine who is the presidential one. It is the most Impressive I hAve ever seen. He is a man of integrity with a brilliant mind. No skeletons in his closet. He is a true conservative who lives by the constitution. That is why he battles in Washington because he lives by what is correct. Look at all the cases he has won. He doesn't fit the mold of Harry Reid and company. He bucks them all the time. America needs him now and if we let him Slip by it will be our loss. There is absolutely no one running that can fill his shoes plus he is a born again Christian and he will restore our religious beliefs back to the country and constitutional rights","post_message":"Bill O'Reilly met with candidates right after last night's debate, and there was one thing Trump said to him that immediately caught people's attention...  Do you think Donald J. Trump has been treated unfairly by the media?"},{"comment_id":"10153765423589170","commenter_b":"@username you are spot on 100%. You don't allow a foreign entity into your country and let them have an area nor let them \"work it out\". Because that area gets a little bigger then a little bit more before soon they are running the country.","commenter_a":"Rahm assisted his Muslim brother Obama in degrading the police when they did do their job. Now the police are afraid to do their jobs.","post_message":"The irony here is that it's HIS ideology that has cops afraid to do their jobs.  His ilk spent the last eight years calling everyone racists.  Now he has the nerve to complain about the outcome?"},{"comment_id":"1823601691207734","commenter_b":"Share it with everyone, we must insure Hillary is not elected!","commenter_a":"\"BILL CLINTON'S LOVING WIFE --- by DICK MORRIS If you happen to see the Bill Clinton five minute TV ad for Hillary in which he introduces the commercial by saying he wants to share some things we may not know about Hillary's background, beware as I was there for most of their presidency and know them better than just about anyone. I offer a few corrections: Bill says: \"In law school Hillary worked on legal services for the poor.\" Facts are: Hillary's main extra-curricular activity in 'Law School' was helping the Black Panthers, on trial in Connecticut for torturing and killing a 'Federal Agent.' She went to Court every day as part of a Law student monitoring committee trying to spot civil rights violations and develop grounds for appeal. Bill says: \"Hillary spent a year after graduation working on a Children's rights project for poor kids.\" Facts are: Hillary interned ...","post_message":"He actually said it."},{"comment_id":"1040060042672919","commenter_b":"This is BS, she just knocks the baby down with her & don't care. Stupid lil witch!!!!!!!","commenter_a":"OMG!!! ANIMALS!","post_message":"Life in Obama's America  Disturbing video of a white woman (holding her baby) being attacked by blacks, as blacks film and laugh at the attack."},{"comment_id":"10153486399896037","commenter_b":"No slave. You put down the pipe and get sterilized.","commenter_a":"Attacking the rebel flag while lighting up the rainbow White House is causing division among Americans. Yahoo news and others are attempting to incite violence against Christians.","post_message":"Are toppling Confederate symbols a sign of change or the work of frightened politicians?"},{"comment_id":"1589013221321122","commenter_b":"Bring back War Crimes Donald! #MakeDonaldDrumpfAgain","commenter_a":"Mitt Romney was and still is a total lightweight! Time for a candidate who's the real deal! Time for Americans to play the TRUMP card!! Adios illegals!! #MakeAmericaGreatAgain #TrumpTrain","post_message":"WE WILL MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1277810208923879","commenter_b":"I wouldn't trust him to drain anything","commenter_a":"Ryan is a swamp rat.","post_message":"Let the draining begin!"}]
