[{"comment_id":"10153141650912093","commenter_b":"Look it up chick","commenter_a":"3200 people died in car accidents today in the US, everyday","post_message":"A man is in a coma after an electronic cigarette exploded in his face... @webpagelink"},{"comment_id":"10152688677486491","commenter_b":"'@username Was 9/11 an act of American terrorism? WTC and Pentagon are both on US soil, right?","commenter_a":"Not Polish camp but German!!","post_message":"Hundreds of survivors returned to the Holocaust’s most infamous concentration camp today."},{"comment_id":"10153058361321770","commenter_b":"She is a loser !","commenter_a":"I'm sorry Hillary just wasn't natural, it was forced. That being said the bill was funny.","post_message":"Hillary Clinton made a “spontaneous” campaign stop with an appearance on Saturday Night Live. She even mocks Donald J. Trump.  @webpagelink"},{"comment_id":"676035105920401","commenter_b":"they wouldn't be happy with anything they are a bunch of animals and don't want peace all they care about is destruction send them back where they came from give them nothing","commenter_a":"Don't like it go home!","post_message":"Muslim refugees are refusing to go into the shelter, demand they be given apartments. If they are seeking safety from a war zone, they should be happy with a shelter. Do you think this demand is ridiculous?"},{"comment_id":"10153919396826509","commenter_b":"White people have killed 300 million people","commenter_a":"Agree...Tony..history...no human life should died..in wars...but happens.","post_message":"The world still struggles to fully understand the events on August 6, 1945. Hiroshima survivors and artifacts link us to the past: @webpagelink"},{"comment_id":"875517669161528","commenter_b":"Well here's the problem because of women like you these little Angel can't even make to birth how disgusting!","commenter_a":"The American dictionary says it's a human embryo, human fetus, human unborn baby. Common sense says it deserves human rights.","post_message":"Tell Congress to protect the unborn! Sign your Life at Conception Act petition today!  CLICK HERE to sign! @webpagelink"},{"comment_id":"543491929108734","commenter_b":"Good, send her to prison then send her to Isis!","commenter_a":"She should be jailed for life.","post_message":"For weeks, this Muslim woman sat behind her computer spreading hate and threatening the 'infidels'. She thought she was going to get away with it, then she heard a knock at the door."}]
