[{"comment_id":"1108096825935519","commenter_b":"Lol...dumbass","commenter_a":"Funny.","post_message":"Anybody who holds up a cop car at gunpoint isn't the brightest person in the world. This thug, however, was especially dumb... he didn't see what was behind him. This ended REALLY badly... and it was all caught on video."},{"comment_id":"10153543031078812","commenter_b":"If you are crossing borders illegally... You broke the law, entered our country without proper credentials and then I'm suppose to foot the bill? Hell no, if I have to follow the rules, then so should the ILLEGAL immigrants!!!","commenter_a":"In my opinion he offended not only #mexicans but all imigrantes that have to cross any border w/ USA. MY RESPECT to anyone that comes to the USA trying to have a better life.","post_message":"NEW: Univision dropping Miss USA pageant and cutting all business ties with Donald Trump over comments about Mexican immigrants: @webpagelink"},{"comment_id":"10154145784326130","commenter_b":"Woman should act like woman? Barf, if a woman does not shave her legs she is still a woman and there is nothing wrong with that.","commenter_a":"This is kinda stupid I'm sorry. And why did she make her legs so goddamn hairy in the comics? I'm sure that's how they look in real life. Glad you found someone who wants to date someone with legs as hairy as his lol","post_message":"Nothing weirder than true love."},{"comment_id":"10153227343366770","commenter_b":"Oh them dumb white people they so racist! Sarc","commenter_a":"She looked so stupid. She clearly made a dumb open statement that wasn't true. Obama told her...it didn't stop her from getting a gun. Brain washed White people. You White Republicans vowed a sworn oath to not give anything to Obama before he took office. A sworn oath. Racist haters. A sworn oath. So don't blame the Black guy You hated and conspired before he took office to hate him. Now you act like you don't understand why he used Executive Orders. Dumb racist White supremist. Shes a NRA crash dummy. Wow....Whites really got no common Sense. Natural born Black haters. Trying to make her a hero...SHE SAID NOTHING NUT GOT SHUT DOWN BY OBAMA FOR QUOTING WHITE MEN AROUND HER. LOL. OBAMA GOT THE LAST WORD.","post_message":"Taya Kyle, the widowed wife of Navy SEAL Chris Kyle confronted Barack Obama Thursday at a CNN town hall event on guns Thursday night."},{"comment_id":"10153149176726636","commenter_b":"Shocking. She should be able to speak openly about her experiences with hardline muslims. Censorship at a students union is about as bad as it gets, but it does not surprise me given the 'right on' nature of some idealistic fools in the student world.","commenter_a":"And the pandering to the nasty ideology goes on, unfortunately!","post_message":"'They’re basically labelling me a racist'"},{"comment_id":"647292048744709","commenter_b":"Only think Muslim country doesnt provide is Security Reason for us to move USA !","commenter_a":"There is a renewed campaign that's getting a lot of attention to get the Equal Rights Amendment (ERA) into the U.S. Constitution. Many candidates talk about their support for fair treatment of women, and this amendment would provide a fundamental guarantee of equal rights. If elected, will you actively support the ERA? #GOPDebate","post_message":"Don Lemon is taking you through the latest in Facebook trends ahead of tonight's #GOPDebate. Have questions? Ask him anything!"},{"comment_id":"1132646906806453","commenter_b":"That hoe lowkey clean 😂","commenter_a":"Alexis Herrera Heberth Perez Johan Ramirez Luis Olmos Epi Benitez @username bet I won't 😂","post_message":"Too much sauce"}]
