[{"comment_id":"1770955373137836","commenter_b":"Wow what a party","commenter_a":"Eu Cruz i might just join this","post_message":"\"I’m staying at the Hilton in Palm Springs, which is hosting the famous Dinah pool parties, and the hotel feels like a homosexual harem.\""},{"comment_id":"1085736288142060","commenter_b":"Crazy woman!","commenter_a":"So sick of these lifer politicians & their lies.","post_message":"Nancy Pelosi's pointing fingers (again)...."},{"comment_id":"10153146604638690","commenter_b":"the terrorist girl.","commenter_a":"There is no age for crimes, a criminal is a criminal. You use children to score PR points in the media. These rocks can kill the passenger inside the car.","post_message":""},{"comment_id":"1076375005794438","commenter_b":"I bet you are one of those that says it was just \"locker room talk\" when Trump spoke of grabbing a woman's pussy, aren't you? \"Hey, boys will be boys\"","commenter_a":"The flight attendant was not harassed, intimidated or any other federally worded names that aren't allowed. She made a mountain out of a molehill. Very irritating.","post_message":"Alaska Airlines confirmed that a different passenger's Facebook post detailing the incident on Flight 520 was accurate."},{"comment_id":"10154570057689369","commenter_b":"Hillary was dead broke, now worth 100 million. How much taxes did she pay on that? 100% growth should be taxed at a high rate according to Hillary.","commenter_a":"Can Trump shut up for atleast one week. Every day, he is making a point, where more n more people are hating him","post_message":"\"No one should be surprised, though, if Donald J. Trump has paid far less - perhaps even zero federal income tax in some years.\""},{"comment_id":"10157095473970206","commenter_b":"Because she's a lying scumbag","commenter_a":"GOP IGNORES CARLY FIORINA - WHY?","post_message":"The professional political class says whatever they need to do to win and then does whatever they please. We need to return to citizen government. Stand with me. Fight with me. Vote for me."},{"comment_id":"1032855700144015","commenter_b":"No one is looking to take away your guns, just like no one is looking to take away your car.","commenter_a":"Taking guns away from citizens violates our rights. Criminals will be the ones with guns. I have a hard time understanding why the hell people dont get this!!!!","post_message":"Nearly 50 years ago, Robert F. Kennedy made an appeal for gun control in Oregon -- just miles from where the recent mass shooting at Umpqua Community College occurred."}]
