[{"comment_id":"10152740114462623","commenter_b":"He dumb sis","commenter_a":"Bos Larry look...","post_message":"A Greensboro teen has been charged with inciting a riot for allegedly using social media to encourage followers to meet at a mall to loot stores and attack police this weekend."},{"comment_id":"1546700958971228","commenter_b":"Heaven forbid that us stupid stupid people should be allowed to have some one tell us the truth! Good Grief!","commenter_a":"But why","post_message":"BREAKING: You’ll Never Believe The Reason Greta Van Susteren Is Losing Her Job. This is terrible. We love her. Can we get 5,000 'LIKES' to Greta on the air?"},{"comment_id":"10153699132454060","commenter_b":"Do you mean the hate speach espoused by the feminist campaigners? Such as the hashtag killallwhitemen and maletears","commenter_a":"hate speech is hate speech. We must identify and stop it.","post_message":"“Just because you lop off your dick and then wear a dress doesn't make you a fucking woman.\" Hate speech or just offensive? Cardiff University students think the former"},{"comment_id":"10154166667183205","commenter_b":"Very well done mr. Congressman, proud to have shaken ur hand once when u visited vegas.","commenter_a":"Thank you! I'm proud of you! great speech! Facts and more facts!","post_message":"I gave a speech this morning on the House Floor welcoming the new leader of the Republican Party to Capitol Hill and showing him what is on the menu in the cafeterias today -- taco salads (the food Republicans eat to show their love for The Hispanics) and strawberries (which almost certainly were picked and packed by undocumented farmworkers), which is a little ironic given that the GOP now wants to deport 11 million people, mostly Latinos, from the U.S."},{"comment_id":"10157699168860294","commenter_b":"If you think he can do that with all the times she's been investigated over the last several years you're sadly mistaken.","commenter_a":"Trump is not for social society so I can't be for him","post_message":"“If I win, I am going to instruct my attorney general to get a special prosecutor to look into your situation because there has never been so many lies, so much deception.”"},{"comment_id":"466812640175338","commenter_b":"Hang tee bitch.","commenter_a":"Close all borders indefinitely. NOW","post_message":"Muslim Refugee Beats And Rapes Woman In North Dakota While Yelling 'Allahu Akbar' [VIDEO] It's starting to happen in America. We cannot allow any more refugees into the U.S. Do you think we should close our borders to refugees?"},{"comment_id":"1630541213899658","commenter_b":"I TOTALLY AGREE..........ILLMINATE THEM AS SOON AS POSSIBLE..OR they will do it to YOU first!!!!!!!!!!!!! They DO NOT NEED to be here in the US of A but ONLY TO KILL MORE Americans.shoot first ask questions later.","commenter_a":"Dang, I need to get out of this hell hole state of celebrity librals and move to Texas where leaders are more concerned with the safety of our nation and not the designer dress to wear to the next award party.","post_message":"Get em' Sheriff... This is why you don't mess with Texas."}]
