[{"comment_id":"1601162620179200","commenter_b":"Idiot. Build a wall","commenter_a":"Go back to Europe white folks... This is are land","post_message":"We're at a \"wall\" of taco trucks -- a protest in front of Trump International Hotel in Las Vegas ahead of tonight's final presidential debate."},{"comment_id":"10153559673746130","commenter_b":"Exactly, I forgot all about this bitch! Lol","commenter_a":"Why did you make her a thing again?","post_message":"Finally, something Kim Davis and her critics can agree on."},{"comment_id":"10153153963941336","commenter_b":"***SCHEXNAYDER SPEAKS ON: HILLIARY*** ========================================= Is that the same Hil-liar-y who was fired from the Watergate Staff? The same weasel who could not find Rose Law Firm records for years? The same shrill potty mouth who said “I don’t recall” 23 times under oath to avoid answering? The same feminist who stayed with a known 30 year serial adulterer, bold liar and pure slime ball? Who lied and trashed women abused by her horndog perjurer hubby? Who wrote the book on arrogance with refusals and rants? Who, at the very minimum, enabled Benghazi? It is! And her 2015 slime update…HRC had an ILLEGAL private server for her State Dept. e mail! Hillary won't take questions -- at event honoring journalism... Drama over e-mail intensifies... Committee: 'Scheme To Conceal'... Violated 'clear-cut' State Dept. rules... Clinton Internal Cable Banned Use! Team Evaded Records With Instant Message... FLASHBACK: Hillary Bashes Bush Officials for ...","commenter_a":"It is obvious that @username and the other main stream media are supporting Hillary. After all, how many times do the public have to be told that she is running. It is apparent that you all are anxious to keep her name in the public eye.","post_message":"BREAKING NEWS: Hillary Clinton announces 2016 presidential campaign. @webpagelink"},{"comment_id":"10154948296594203","commenter_b":"all the illegals voted too..","commenter_a":"Hillary has 2,017,563 extra votes then Trump. The difference of extra Two Million+ vote which can give a decisive victory to a candidate \"anywhere else in the world\" has ZERO value in America?","post_message":"BREAKING."},{"comment_id":"1073897729311987","commenter_b":"@username LOCK HER UP!","commenter_a":"@username. First American woman likley to pardon her self for her many crimes if ever elected.","post_message":"The women of Team USA broke through glass ceilings, wrote history, and showed the world what it means to represent the red, white, and blue. Read some of their stories: hrc.io/2bQa5y3"},{"comment_id":"1390094244343935","commenter_b":"I hope she does. Even easier for Trump to win","commenter_a":"No I don't. There are other qualified people.","post_message":"Want to see Elizabeth Warren on Hillary Clinton's White House ticket? It might not be so easy."},{"comment_id":"1632303213733906","commenter_b":"This dumb chick is over reacting","commenter_a":"Yeah! No thanks your husband has already broken America","post_message":"One first lady has already lost to Donald Trump... could Michelle win in 2020?? @webpagelink"}]
