[{"comment_id":"977192562373798","commenter_b":"why not a woman","commenter_a":"Great news. Some disquieting news is that Hillie is considering Julian Castro for her VP. He is a good one and I guarantee he would jump. I really wish I knew who Bernie is considering. It should be a person of color imho.","post_message":"The American people are definitely feeling the Bern."},{"comment_id":"10154774473425575","commenter_b":"'@username - islamic women are smart enuf to use these clueless American women to further their islamic agenda. but the women marching think its a march to protest defunding planned parenthood. very sad to be very dumb.","commenter_a":"can the 200K marching women be shipped to syria or where ever hamas HQ is? - lmao","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153992150958854","commenter_b":"Who's next to meet Satan their Allah. Satan's impatient, don't keep the Virgin hags waiting.","commenter_a":"no more little asshole","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10152972310600950","commenter_b":"She didn't have to do or not do anything. Her life doesn't go by some imaginary rulebook that you made up for social and community etiquette in the trans community. She can do whatever she wants however she wants, regardless of who it offends.","commenter_a":"If you have to ask if you are supporting your community the right way, then maybe you should be questioning your actions in the first place and the reasons behind them. He/she should have started a discussion forum with the transgender community prior to his/her transformation","post_message":"Caitlyn Jenner is starting to write about 'serious issues and lessons that I am learning through this process.'"},{"comment_id":"1226103374093667","commenter_b":"Yeah go, go away!","commenter_a":"I assume nothing! We have a few days to get people registered! Then we have to get the early vote and day of vote out! Go Trump!","post_message":"'For those few people knocking me ...'"},{"comment_id":"10153880251122217","commenter_b":"No. They should be pure. Virgin skinned, hairless.","commenter_a":"See John for the invisible tattoos.","post_message":"Send us photos of your tattoos! We'll be talking ink in the workplace with tattoo expert Dr Matt Lodder at 13:30 (BST) on #FacebookLive. We'll be showing some of your tattoos as part of our broadcast, so please email your snaps to yourpics@bbc.co.uk"},{"comment_id":"1272820716123006","commenter_b":"Women like you make me so embarrassed for my gender! The same that screwed America with Obamacare. Truly disgusting","commenter_a":"There is a clear path of the Democratic Party to take the presidency, the house and the senate... This is the core issue why the FBI director was pressured to make the announcement... #Ihaveherback Grab them by the polls vote blue","post_message":"JUST IN: Federal investigators looking into Hillary Clinton email matter have obtained the warrant needed to start reviewing emails found on laptop used by Anthony Weiner and Huma Abedin."}]
