[{"comment_id":"10153202645506350","commenter_b":"This women should go talk to parents.","commenter_a":"Everyone saying \"she could have dealt with this privately, how embarrassing for the kid\". She never even mentioned his name... She is just addressing him along with all the other boys out there who do this. Something similar happened to me when I was in grade school and instead of having my back, all my friends labeled me as a bitch for not giving this guy a chance. He WAS harassing me but it was seen as \"cute\" because women are taught to appreciate male attention no matter the circumstances. We are taught it is the best thing that could ever happen to us. Just bear in mind that if a teenage daughter willingly comes to her mother for help, during a time when most teens seek distance from their parents, there is clearly a huge problem. This is video that can help a lot of other parents and teens ...","post_message":"This mom has a message for the boy repeatedly being rejected by her 14-year-old daughter: No means no."},{"comment_id":"1477546275595181","commenter_b":"Hillary Clinton is a phony champion of the working class! She takes millions from Wall Street the same people who have made Billions shipping are jobs out of the country!","commenter_a":"As it should be...when is the rest of the nation gonna wake up and at least acknowledge what's happening?","post_message":"Donald J. Trump leads Hillary Clinton by 5 points among likely voters in Ohio, according to a new poll."},{"comment_id":"10153045402661336","commenter_b":"Shut up idiot!!!!","commenter_a":"Early Bird gets the cage","post_message":"A Georgia sanitation worker has been sentenced to 30 days in jail for picking up trash too early in the morning."},{"comment_id":"10152786318205736","commenter_b":"She's a nut","commenter_a":"That's what I said about her","post_message":"What are your thoughts on race identification?"},{"comment_id":"10153478854858188","commenter_b":"I see he didn't answer the second question. First answer was also rediculous since he has given all our prisoners from guantanamo away","commenter_a":"Glad he was put in his place.","post_message":"Wow."},{"comment_id":"557086307813348","commenter_b":"AHHAH u need a matching one","commenter_a":"@username one for mal","post_message":"That pose though"},{"comment_id":"1011935972208484","commenter_b":"No amnesty. We need to figure out exactly how many workers our farmers need and make it easy to give immigrants return visas once they have been vetted then give them 5 year vias, before needing to reapply.","commenter_a":"Democrats, you have one job this November: Don't give our country to the GOP! Elect a Democratic President and give them a Democratic Congress to work with! And complete the job by dumping the GOP from state and local government!","post_message":"'Nuff said. Image by Occupy Democrats, LIKE our page for more!"}]
