[{"comment_id":"10153468718801130","commenter_b":"Classy women.","commenter_a":"Gorgeous young women!","post_message":"\"They're not trying to look older than they are.\""},{"comment_id":"10155071797057235","commenter_b":"@username Melania is smart. She's living in New York with her son and her parents. Trump isn't even home half the time. All she has to do is keep up appearances. Show up at the Inauguration and a few key events.","commenter_a":"Yeah. You don't even have to know him to know this was gonna happen. Just watch him for the last 20 years. Why didn't his family talk him out of it.","post_message":"The giant orange baby-man president hates his job. Nobody could have predicted this..."},{"comment_id":"1134554249934436","commenter_b":"Lol. She is a democrat. I hope you never wander into a voting booth","commenter_a":"We must stop the democrats and Hillarys war on women and the unborn!","post_message":"Every dollar goes toward making sure Donald J. Trump never becomes president."},{"comment_id":"10156227118445354","commenter_b":"And gays, get ready to be tossed off the highest building available. Who let the muslims here. Get ready fools.","commenter_a":"Prepare , you liberal women better bend over and shut your fucking mouth. This is what you asked for.","post_message":"Green light GO!"},{"comment_id":"10154502973076756","commenter_b":"@username do u recognize this woman in the pic? She's a Bay Area demonstration machine! I want to BE her!","commenter_a":"Wow.","post_message":"\"[W]e lack confidence that Judge Persky can fairly participate in this upcoming hearing in which a male nurse sexually assaulted an anesthetized female patient.\" -- Santa Clara District Attorney Jeff Rosen"},{"comment_id":"589804961210083","commenter_b":"If they don't like it then they can suck chuck","commenter_a":"Love my Marines.","post_message":"These Marines make huge stand and show Muslims they're not afraid. Love it. We need to spread this and show these Marines we have their back. Do you support our troops?"},{"comment_id":"630177530448762","commenter_b":"It is not surprising, if it was a terrorist attack the pilot would have tried to crash the plane into a very densely populated area i.e not the French Alps.","commenter_a":"I'm relieved (and surprised) that the pilot's last words weren't Allah Akbar.","post_message":"Aha! That's a BIG part of it I'm sure."}]
