[{"comment_id":"10153538416518445","commenter_b":"Fuck the police,bitches...always smoking,","commenter_a":"wtf","post_message":"Always A Good Reminder: Police in Legal States Are Using Social Media to Bust People for Marijuana."},{"comment_id":"10153897303435329","commenter_b":"Some girls are bigger than others","commenter_a":"You can open a bottle with any edge. Lighter, desk, door jam, bike pedal","post_message":"How To Open A Bottle With A Cigarette Lighter"},{"comment_id":"551022975088282","commenter_b":"the only thing i would sacrifice for this transvestite is a bullet.","commenter_a":"What the hell makes her think she can change our constitution? She's a nobody married to a mistake & not worth the oxygen she breaths! & he is a waste of oxygen also.","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"},{"comment_id":"10153527234442434","commenter_b":"Lies! Aryan Jesus is from Florida!","commenter_a":"Bruh, even your religion came from the Middle East, STFU","post_message":"“I’d ask you to go back through history and figure out, where are these contributions that have been made by these other categories of people that you’re talking about, where did any subgroup contribute more to civilization?” asked Congressman Steve King"},{"comment_id":"10152677348991523","commenter_b":"I wasnt there but innocent until proven guilty and its always a bunch of white women","commenter_a":"They are liars. Every time these women have a press conference, I've noticed while they're speaking they have to keep looking down at their notes. Their statements should freely flow out of their mouths if it was true.","post_message":"Phylicia Rashad says she was misquoted on Bill Cosby, and sets the record straight."},{"comment_id":"497111050479475","commenter_b":"She's a sellout to her own race, taking everything that white people gave her, and then spews her racist anti white nonsense to make blacks think she actually cares about them.","commenter_a":"She described racism other countries not ours.","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"10154144133589060","commenter_b":"@username I agree. She's one big mess. But they will elect her. Everyone loves a winner","commenter_a":"Lets make no mistake - Hillary has LOTS and LOTS of experience with many, many, many male (and some woman) leaders.","post_message":"Sanders espouses bold positions; Clinton talks about the world leaders she has met"}]
