[{"comment_id":"10154141594486509","commenter_b":"I can't stand Sanders grating voice and Hillary puts me to sleep O'Malley's obnoxious Thank God NCIS is on at 8.","commenter_a":"I wonder if @username will ambush Clinton, like FOX ambushed Trump.","post_message":"Classroom lecture vs. rock concert: Just how different are Bernie Sanders and Hillary Clinton campaign styles? #DemDebate @webpagelink"},{"comment_id":"922136247820460","commenter_b":"Keep drinking the kool-aid lady!","commenter_a":"I think you are clueless dude. The \"obstructionist party\" is obstructing because they have listened to their fellow supporters of we the people! I don't want more and higher taxes! I don't want more illegals here illegally! I don't want Obamacare! I don't want a gigantic government telling me when, where, why and how to blow my nose! I don't want them taking away my guns! I don't want them (Democrats - now the Socialists/Communists of America) allowing Bengazi, fast and furious, and Ferguson protests to happen. I don't want Obama \"using his pen and paper\" Anymore! ILLEGALLY! WITHOUT CONGRESS!","post_message":"Back home in Indiana after a late night. The Senate held its 25th amendment roll call vote of 2015 late yesterday, already more than all of 2014."},{"comment_id":"10153344418725326","commenter_b":"Me too..they are owned by Time Warner her 7th largest donor!?!?!","commenter_a":"THE QUESTION IS THIS. DID CNN FEED HILLARY THE QUESTIONS IN ADVANCE. IF YOU LOOK AT HER BODY LANGUAGE AND LACK OF PONDERING THE QUESTION HER RESPONSES WERE CANNED. I FIRMLY BELIEVE CNN FED HER THE SCRIPT.","post_message":"Hillary Clinton was put on the defense Tuesday for her ties to Wall Street. While Sen. Bernie Sanders has been saying for years that the Wall Streets are contributing to the overwhelming income inequality in America. Ed gives Commentary. Don't forget to Subscribe to Ed's YouTube Channel at: goo.gl/ScLQVu"},{"comment_id":"731070983658177","commenter_b":"Can all 43 women be lying? Even a broken clock is right twice a day!","commenter_a":"Those kind of girls set women back a million years by falsifying there allegations. They are the main reason why real rape victims get shunned and re-victimized.","post_message":"The comedian's glittery career has taken a huge hit."},{"comment_id":"10154250290881337","commenter_b":"YES, WE UNDERSTAND THAT YOU ARE NOW A WOMAN, DO US ALL A FAVOR & STOP THROWING IT IN OUR FACES YOU BINT !!","commenter_a":"Please go away now. Everybody's over it","post_message":"Caitlyn Jenner is taking Donald J. Trump at his word..."},{"comment_id":"10153177691300399","commenter_b":"Geller is a Bitch Witch.","commenter_a":"Not BS the 700 club news just aired and isis has 71 soldiers in 15 different US states! We do not negotiate with or back down from terrorists! Geller you GO GIRL!","post_message":"Wilmore thinks Geller is flat out crazy."},{"comment_id":"10154295592708132","commenter_b":"A woman's ribs shouldn't show like that. That is not a healthy body.","commenter_a":"I think she looks great - no doubt about that but remember she has access to so may resources such as chefs, nutritionist, top motivating trainers, laser tightening, etc. Not to mention there is definitely not a daily 9-5 job in her day and don't forget adding in a few nannies to help out as well. All of these resources help alleviate stress and carve out time for you to focus on yourself. All that alone is a great cocktail for motivation.","post_message":"Spring has sprung for Britney Spears!"}]
