[{"comment_id":"910100355702699","commenter_b":"She should have gotten the death penalty!!!","commenter_a":"Hey like they say, you get what you sew!","post_message":"Convicted killer Jodi Arias will now spend the rest of her life behind bars. Watch Travis Alexander's sisters beg the judge for a maximum sentence: @webpagelink"},{"comment_id":"10153411890906167","commenter_b":"Nah. Satan and the Mrs, would have had an abortion before bringing this creep into the world. ;)","commenter_a":"the son of satan.","post_message":"Troy Newman's views are so extreme that, as The New York Times reported in 2015, Australia cancelled Newman's visa over \"concerns that he might encourage violence against abortion providers or women seeking the procedures.\""},{"comment_id":"1018807534853645","commenter_b":"RIP what a good man","commenter_a":"Inspiration for more acts of random kindness towards strangers. What an amazing guy. So sad :(","post_message":"\"I still cannot believe it. I thought for sure I would get the chance to see him again, give him a hug and thank him at least once more in person.\""},{"comment_id":"1257627894274548","commenter_b":"NEVER Hillary!","commenter_a":"It's really quite a disgrace that The Ben Howe Show would've released this right before the election. This clearly shows who he's in the tank for. There's absolutely no reason for this nonsense. He does realize he could've made a three-part documentary on the \"sociopath\" Hillary Clinton, right? Worse yet, her scandals are writing themselves as we speak.","post_message":"“I believe that what happens after this election will define the future more than the election itself.”"},{"comment_id":"10156071527715354","commenter_b":"@username... we are talking about illegal aliens. Not the Mexican race. You should set yourself on fire -","commenter_a":"then you go ahead Ricky and pay for all the welfare benefits, health insur, food stamps, free college tuition (Dream Act) for ALLLLL the illegals pouring into the country. Cause we cannot keep paying for all this under the radical liberal orders--the pot has run out--this is why we SCREAM and beg for a man like Donald J. Trump to stop all this madness.","post_message":"BEHOLD, America!   One of liberalism's finest minds--a political Zeus!--hath spoken!   #Livin’LaVidaLoca"},{"comment_id":"1248799051839522","commenter_b":"Sue her!!!!!","commenter_a":"I didn't even read it","post_message":"You've got to be kidding!"},{"comment_id":"10153572345386955","commenter_b":"Both dopes.","commenter_a":"The Pope and the Dope!","post_message":"Influential Iowa Backers Get Invites to See Pope with VP..."}]
