[{"comment_id":"1369042613147367","commenter_b":"@username and us tax payers get to pay for double security bc the poor widdle brat can't move and change schools like every other American kid has to do when they move🙄🙄","commenter_a":"I mean Donald did say if she wasn't his daughter he would marry her so essentially it's what he wanted.... still Creepy AF!!! 😷😷😷","post_message":"Did you see this coming?"},{"comment_id":"1242850115735016","commenter_b":"Please don't put us in danger Mr. President. It doesn't matter where you put these refugees in the US. They can still be a threat. I still can't get over 9/11","commenter_a":"How about taking care of the homeless in the country before letting refugees in? I know it might sound crazy, but give it a shot.","post_message":"After the terror attacks in Paris that killed at least 129 people, the placement of refugees fleeing Syria has come under scrutiny as more than a dozen governors - mostly Republicans - have said the do not want the refugees in their state."},{"comment_id":"10153523399935329","commenter_b":"And a lets get a pug","commenter_a":"@username I want a bear","post_message":"THIS GUY!"},{"comment_id":"1799477110270557","commenter_b":"IF CROOKED CLINTON GETS IN, IT WILL BE THE END OF AMERICA AS WE KNOW HER. GOD HELP Donald J. Trump WIN.","commenter_a":"Of course Donald Trump is low in the polls if that's all your polling are Democrats hello","post_message":"\"I think, frankly, he's going to end up beating Hillary by a surprising margin.\"  On Fox & Friends, Newt Gingrich touted Donald J. Trump's \"two historic speeches\" this week."},{"comment_id":"10153285157239205","commenter_b":"Ignorant bitches 😂😂","commenter_a":"@username time to move for me 😂😂😂","post_message":"Trump Should Probably Start Fact-Checking His Retweets"},{"comment_id":"10153661295271955","commenter_b":"You have the hots for Hillary... admit it already :)","commenter_a":"Weak weak weak.","post_message":"BEING BORING: CBS ENDS DEM DEBATE 7 MINS EARLY"},{"comment_id":"10152943913476051","commenter_b":"Laura Mae Floering go break a hip old saggy tits","commenter_a":"We can't have white history month United white college fund White entertainment television White colleges That would be racist right?","post_message":"When a deli owner posted this sign on the front of his business, he didn’t think it would be that big of a deal. Well, it was. Now he's dealing with the consequences."}]
