[{"comment_id":"1231219033565772","commenter_b":"they can sew it to the mini brain they grew.....","commenter_a":"There is hope for me yet! Haha Juventas Buzevicius Moses Olivas Hanna Kozlowski Andrew Holtzmann","post_message":"Scientists have grown miniature kidneys in a laboratory."},{"comment_id":"10158183422455594","commenter_b":"What message are you sending? That nutty women can run around dressed as vaginas and cry out for the \"right\" for women to kill their innocent babies? Some message from you silly chicks.","commenter_a":"Funny how the negative comments are posted predominantly by males. Do we make you nervous and uneasy? Good. You should be nervous.","post_message":"Crowds went berserk for the big-screen actress as she waxed poetic in R-rated language on women's rights and the perceived threat the new administration poses to those liberties."},{"comment_id":"1066819213408210","commenter_b":"Welcome home honey, Americans take care of each other. We want more proud immigrants like you!","commenter_a":"I am not a us citizen yet,but I hate seeing american burning a us flag..she not the one to fight for her freedom..she didn't even think to the forefathers that fight for her freedom right now..that has no respect at all..","post_message":"WATCH: A police officer takes an American flag away from a protester who was trying to burn it outside the GOP Convention in Cleveland."},{"comment_id":"1461843750508898","commenter_b":"WHY DO THEY LET THIS GUY DO THIS ? JUST SHOOT HIM AND BE DONE WITH IT .","commenter_a":"Another scumbag trying to blame someone else for his criminal actions. This seems typical of his type. Rot in prison and enjoy your \"foot longs\" until you die, Jared Fogle","post_message":"He is claiming that the PARENTS are to be blamed for her spiral of drug abuse, self-harm suicidal thoughts, which she says was the result of his abuse."},{"comment_id":"564505557070656","commenter_b":"😩😩😩","commenter_a":"@username 😩😂😂😂😂","post_message":""},{"comment_id":"10155599554315354","commenter_b":"Why are we still seeing this crazy whore.","commenter_a":"Sure she's an idiot...but can't she practice the religion of her choice wihout scrutiny?","post_message":"Raised Catholic....dabbled in Kabbalah...and now this... ...Check it out."},{"comment_id":"445713658965481","commenter_b":"Time to start rounding up these radicals. They will destroy everything","commenter_a":"Is time to retaliate! !! A good MUSLIM IS A DEAD MUSLIM. ... kill them all ......","post_message":"A Florida College Student was Brutally Attacked by Five Muslims On Patrol Enforcing Sharia Law. @webpagelink"}]
