[{"comment_id":"10153269221051051","commenter_b":"When she gets her own country, she can make any law she wants and decide when she'll break it.","commenter_a":"Gays are getting too demanding. If she will not marry those faggats, then they should go some place else.","post_message":"This court clerk refuses to issue same-sex marriage licenses – even when her decision lands her in legal trouble. Do you respect her dedication to her beliefs?"},{"comment_id":"906024782797611","commenter_b":"Them girls need to be arrested. I hope the police is watching this video and found them girls... My heart and prayers go the girl getting jump. No class at all...","commenter_a":"Jesse Chambers","post_message":"UK Girl Couldn't Take It Anymore & Passes Out On Her Feet!    Click Here To See All The Fights in This Months Comp. @webpagelink"},{"comment_id":"475027816013769","commenter_b":"Guess she is a shameful person.","commenter_a":"Remember, she was also 'ashamed' that Bush was from Texas","post_message":"Dixie Chicks member Natalie Maines also took aim at Donald J. Trump, tweeting, 'As long as Donald Trump's decisions for America are as solid as his decision about his hair, we're in good shape.'"},{"comment_id":"1093795067333572","commenter_b":"Suck it.","commenter_a":"He means defying the will of the people is what the campaign is about. Hillary has the popular vote and delegate lead. #dropoutberniesanders","post_message":"TONIGHT: Bernie Sanders on continuing his fight for the Democratic nomination: 'Defying history is what this campaign has been about.'  @webpagelink"},{"comment_id":"10154566492298812","commenter_b":"'@username you keep drinking the kool-aid","commenter_a":"If you can't emotionally tolerate a black man reaching for his ID and you pee your pants like a 9 year old girl scout, and you shoot him without ever seeing a gun, it's time for you to take off the police uniform and get a job where you will not be harmful to human beings and to society.","post_message":"Pres. Barack Obama: Attacking police officers, even rhetorically, does 'disservice to the cause' of criminal justice reform. @webpagelink"},{"comment_id":"1201176699902507","commenter_b":"Beverly, there's already plenty of porn out there. I highly doubt anybody's going to get their jollies from our veiny mom-boobs. In all seriousness, though, in 99℅ of cases, you can't see any more breast than you would if wearing a bikini. And yet, we don't shun the beach for fear of perverts with cell phones, right?","commenter_a":"There is a big difference between how breastfeeding is depicted here and what the majority actually look while breastfeeding in society. , Here its done Discreetly and beautifully, If all women breast fed like this NO one would have issues with it,","post_message":"'Let's support mothers to breastfeed anytime, anywhere.'"},{"comment_id":"1240366709375196","commenter_b":"Oh how I pray that would happen because that is where she belongs. Get out and vote TRUMP!","commenter_a":"She must NOT be elected, then impeached or her VP would take office. Then she would just be the puppet master. Telling him what to do. Come on America, do what is right!!","post_message":"We all hope that Donald J. Trump takes down Hillary, but a backup plan has just been launched in case he doesn't.  This is a massive development in the campaign, and you know it's got Hillary's people worried."}]
