[{"comment_id":"10153054360324411","commenter_b":"your wicked..i no longer have remorse for your kind....it is a tare...to be pulled up by the roots to be shoveled in a lake of ever lasting fire........you can't raise yourselfs up above nothing but killing......it is of old......you want this earth to yourselves.......its not going to happen...like sands in the hour glass ...........your time is short...","commenter_a":"brain washed .........or is it ..in their seed ?","post_message":"URGENT: Pakistani police use tear gas against anti-#CharlieHebdo protesters near French consulate in Karachi"},{"comment_id":"10153166751996336","commenter_b":"CIA is the source of evil, they create such groups like ISIS, Al-Qaida to fight its dirty proxy war in other countries","commenter_a":"Haha go ahead smash the headstones. They are just mad the one thing they can't take is our eternal life with Jesus.","post_message":"ISIS continues with their calculated campaign of terror across the Middle East, destroying Christian graves in the Iraqi city of Mosul."},{"comment_id":"932169176839778","commenter_b":"And, they won't ever listen to us when they have all these illegals voting for them! I hope the Democratice citizens are taking note of all that is going on in our country!","commenter_a":"Americans had better listen to Anne Coulter. She is right and she is warning Americans what I have also been saying. We are losing America to illegal immigrants because of obama.","post_message":"A new Pew Poll found that only 24% of Americans want to increase immigration to the U.S."},{"comment_id":"381679348687026","commenter_b":"Yeah, and look what we have now. A man and woman who think they are king and queen and are destroying our country. Stop him.","commenter_a":"George Bush was a really great President and Laura Bush so graceful and elegant!","post_message":"We love George W. Bush...such a true class humour!"},{"comment_id":"10153842022041336","commenter_b":"@username. You are a blooming idiot fool!!","commenter_a":"Too egotistical! He will never resign but, he will go down in history as the most Anti-American and incompetent man ever to reside in Our White House without doubt!!","post_message":"“We are in World War III,” Michael Goodwin said on 'The Real Story.' “And if America is not going to lead, who is?”"},{"comment_id":"10152710214754205","commenter_b":"Bitch, you're from Missouri.","commenter_a":"Another reason to hate chicago","post_message":"Secret CIA Black Sites In American Heartland For 'Disappearing' Citizens"},{"comment_id":"10152609366937093","commenter_b":"Stfuh","commenter_a":"What a disrespectful jerk! You're lucky Saul that she didn't arrest you right there on live TV. You don't put your hands on an officer PERIOD!","post_message":"RAW & UNCUT: A sheriff's deputy didn't like where FOX 4 News reporter Saul Garza was standing during his live shot this AM.... then this happened.... @webpagelink"}]
