[{"comment_id":"962417470484668","commenter_b":"Do with all the locks broken does that mean all these people will soon divorce ?","commenter_a":"Melissa Sheree Lisa Danielle","post_message":"Love 0 Heath and safety 1"},{"comment_id":"10153067300837061","commenter_b":"Alex Barham you better do this for me. I sunflowers","commenter_a":"Beautiful story.","post_message":"Wisconsin man plants 4-mile stretch of sunflowers in tribute to wife who died of cancer: @webpagelink"},{"comment_id":"1002435359842664","commenter_b":"One things for sure there's plenty to pray for. For those precious children, for their mothers who have been fed lies from hell's own lips, and for those who would advocate for such heinous things to go on. I guarantee you this girl has had a couple of abortions and they were oh so wonderfully sickeningly sweet to her- so that they can use her face and influence. Makes me sick. Yes, she is responsible for her sins, but she's just a rebellious, gullible kid that several of these snakes have sunk their fangs into. Just like Brittany Spears before her- and Raven Symone.","commenter_a":"My heart went out to her when she started turning crazy. She's in the throes of rebellion, but I think it came because some of the snakes of Hollywood influenced her. She's rebelling against her dad, and the way he's tried to raise her, like many of the child actors and performers before her. The kid used to want to be a missionary and help save lives. Now she wants to be a champion for killing. I will still pray for her. God's arm is not short.","post_message":"\"I'm a good person to put on the face of a T-shirt.\""},{"comment_id":"10153227651945329","commenter_b":"Ikr how dare she maintain a healthy lifestyle, the bitch.","commenter_a":"She can fuck off","post_message":"More like baby washboard, amiright?"},{"comment_id":"10152535175096813","commenter_b":"Start helping the ppl who are already here. How many Americans are out of work but Obama thinks it's better to hire illegals and give them driver license so they can vote. Yea sounds like he's buying votes for the Democratic party. When a soldier retires from the military where does he go. Shouldn't he have the first pick in a job then someone who crossed the border illegal.","commenter_a":"This was an ideology, not law...come here legally & you'll have no problems!!!!!","post_message":"All of our clients who were locked up in #immigration detention at Artesia are now getting a right to be heard. But there are others who deserve that chance, and aren’t getting it. @webpagelink"},{"comment_id":"10154110456411337","commenter_b":"Why are they anonymous?? Staying unknown seems cowardly... Bunch of bullies. Be open about it if that's what they feel and think....","commenter_a":"Erica Rudolph","post_message":"TOTAL WAR: Things are getting really ugly between Anonymous and Donald Trump."},{"comment_id":"1068539523183857","commenter_b":"How can you support Hillary she lier and a crook! Trump trying to make a better America for all Americans. Hillary trying to make a better America for Hillary.","commenter_a":"Another libertard","post_message":"Actress Rosie Perez: “I really, honestly, want to understand how can you support someone who said such racist comments, who said such hateful comments,”"}]
