[{"comment_id":"10156932201230389","commenter_b":"Good answer. She is a sellout.","commenter_a":"NOT EVEN HONEST TO THE PEOPLE THAT PAY HER?","post_message":"David Webb: “Do you think Hillary Clinton’s honest?” Answer: “I think she’s honest to the people who pay her.” MORE: @webpagelink"},{"comment_id":"633021916884133","commenter_b":"Handler is not someone who the 1st lady would want to meet with. Talk about the trash...","commenter_a":"Chelsea Handler who is a hardcore supporter of Hillary Clinton and a Democrat. She is actually a racist.","post_message":"Wow..."},{"comment_id":"10153812038063984","commenter_b":"We need to demand that our governor 's refuse to accept them in our states !!","commenter_a":"Totally against it.","post_message":"Wow. This definitely makes Obama's plan to accept refugees from war-torn Syria \"nothing short of crazy\" - as Ted Cruz would put it. America could be the next country to face this... Are you against allowing Syrian refugees into the U.S.?"},{"comment_id":"10154156633758822","commenter_b":"Ship all libs and Democrats there now!!!!","commenter_a":"Can we send the Obamas and Clintons as test citizens? Perhaps their buddies in Isis?","post_message":"Humans on Mars by the 2030s! That's what President Obama's plan calls to do."},{"comment_id":"10153627829156336","commenter_b":"Who really cares about the name?!!!! Native Americans care about protecting Mother Earth!!!! Get rid of the Pipeline!!","commenter_a":"How about leaving the mountains name alone and concentrate on more important priorities.","post_message":"President Barack Obama is restoring the name of the tallest North American mountain peak – Mt. McKinley in Alaska – to the native Alaskan name of “Denali,” the White House said today. @webpagelink"},{"comment_id":"1204291722963907","commenter_b":"and as I assume the majority of their passengers are muslims - then they are providing them information that they require - AND - is harmless","commenter_a":"What kind of prayer? I've flown Royal Brunei Airways twice so far. Before the plane takes off, a Muslim prayer ist shown on the monitors and during the flight the direction towards Mekka is shown and not the plane's position!","post_message":"A passenger saw a WhatsApp message about 'prayer' and feared he was a terrorist"},{"comment_id":"10154814539690470","commenter_b":"She's still a thief genius.","commenter_a":"Sucks to be a thief.","post_message":"A woman in Pennsylvania died after she got her arm stuck in a clothing donation bin, and was left dangling above the ground for hours. Judith Permar, 56, used a stool to reach into the bin on Sunday before it collapsed, breaking her left arm and wrist, according to Mount Carmel police."}]
