[{"comment_id":"10153817887769203","commenter_b":"Michelle will body slam Barry!","commenter_a":"Coming from the first female POTUS this is funny. Obummer, you can't handle your own angry wife let alone Putin....get out of the White House you effeminate jackass","post_message":" can handle a bunch of CNBC moderators at the debate. Let me tell you, if you can handle those guys, then I don think the Chinese and the Russians are going to be too worried about you."},{"comment_id":"10154044912016756","commenter_b":"Heterosexual couples also have anal sex.","commenter_a":"Anal sex greatly increases your chances of catching aids.","post_message":"A Christmas Eve first date. A Christmas proposal, three years later. And now, a first Christmas with their son."},{"comment_id":"1138545752861116","commenter_b":"Yes I want her and her friends out of my Country!","commenter_a":"They are lying liberals what you expect","post_message":""},{"comment_id":"10153895371347452","commenter_b":"@username. Well you are not a very educated woman. I hope you don't reproduce! This world doesn't need more deplorables.","commenter_a":"Really ?! Just because he says vulgar things about women who cares ! And I am a woman! Least he isn't hiding emails or having innocent people killed!!!!","post_message":"Donald J. Trump was caught in a 2005 video making vulgar comments about women. He issued an apology and added, \"Bill Clinton has said far worse.\""},{"comment_id":"876682692378359","commenter_b":"These two women obviously don't know the plan and purpose of marriage.","commenter_a":"STOP have n sex if u dont want children. Once the child is made its alive. Not when it takes the first breath. Ppl are so selfish these days","post_message":"Do you?"},{"comment_id":"10154963330566509","commenter_b":"Not if we can help it....She is criminal","commenter_a":"Glad to see all the Democrat converts. Hillary will crush Trump in the general.","post_message":"The conservative columnist George Will is advocating that others do the same."},{"comment_id":"10156303577690354","commenter_b":"She should be in jail for her do nothing in Benghazi.She is a liar and I hope she gets what she deserves.She thinks She is above the laws the rest of us must follow.Oh and why is Sharpton not in jail for not paying his taxes.We've got to get rid of all of these politicians.","commenter_a":"Yes she did","post_message":"\"Clinton may have committed perjury, then, when she signed a sworn statement promising that she turned over all of her work-related emails pursuant to a Judicial Watch lawsuit for Clinton’s email records.\""}]
