[{"comment_id":"1286627034690657","commenter_b":"Nope she will lose","commenter_a":"Hillary Clinton the next President of the United States.","post_message":"'WE HAVE A VERY SERIOUS PROBLEM' Hillary Clinton points out a striking divide in the criminal justice system in America during Sunday's NBC News-YouTube #DemDebate. Catch all the highlights here: @webpagelink"},{"comment_id":"10153211590889255","commenter_b":"How on earth did that guy get elected in a logical state like Maine? Maybe he had some help.....","commenter_a":"JUst more proof that Le Page is a nutcase and a liar. So glad he isn't from NH . We have enough nutjobs of our own who scare the bejesus out of 4th gfaders!","post_message":"I think I just became an even bigger Stephen King fan."},{"comment_id":"10152665844280667","commenter_b":"If only she would run Elisabeth Warren would get my vote.","commenter_a":"Can't sstnd this women! She DOES NOT and WILL NEVER, EVER vote for her!!! Liar, liar, pants on fire!","post_message":"56% of women have a favorable opinion of Hillary Clinton, a Gallup Poll finds."},{"comment_id":"10153641231211337","commenter_b":"More like a Cabbage Patch doll had sex with that weird chick who snorts Ajax in Up in Smoke.","commenter_a":"Amy Schumer looks like Reece Witherspoon had a baby with the Pillsbury Dough Boy","post_message":"PERFECT: Amy Schumer was ready when someone compared her to the American Gothic lady..."},{"comment_id":"10155065453241323","commenter_b":"You still refuse to answer the question.","commenter_a":"An admirable academic for sure . But; one line in the video had me chuckling \"And then population growth will stop\". Naive to think population growth will ever stop. Deluded dreamy lefty thinking.","post_message":"\"Let me show you the world\", said Swedish academic Hans Rosling, who has died aged 68. Here he demonstrates the dynamics of population growth, child mortality and carbon dioxide emissions. The challenge for the world is to get everyone out of extreme poverty and get the richest people to use less fossil fuels, he said."},{"comment_id":"10154256753938701","commenter_b":"ONLY IN AMERICA RACIST GET REWARDED","commenter_a":"Regardless of if you think the shooting was justified or not this is just callous and tacky. He honestly makes me feel ill.","post_message":"UPDATE: The gun listing has been taken down from the auction site."},{"comment_id":"560003900832233","commenter_b":"Dont lose or give up your beliefs or faith..Those who seek to destroy your lives over a cake are the ones with deep rooted hate for anything good..And they want to call themselves victims of bullying..How perverted American have become when they hate their own and embarce filth as good..So busy hating Christians and not seeing that the Government have been taking yours rights away too..Hooray to the Muslims","commenter_a":"What's messed up is these people refused to back a cake for a gay wedding. The couple wasn't discriminated against. The kliens simply didn't want to participate in something they deem as sinful. How is that forcing their beliefs on them. So now they are out of business and the militant intolerant left made it happen. While our backward minded liberal pals are doing their best to persecute Christians at the same time and probably at this very moment Muslim bakers regularly turn away gays. These incidents do get reported but the liberal media refuses to report on them and the militant LGBT stay silent.","post_message":"A Daily Signal Exclusive: Bakers Facing $135K Fine Over Wedding Cake for Same-Sex Couple Speak Out"}]
