[{"comment_id":"871781506248238","commenter_b":"one of the dumbest bitchs on TV","commenter_a":"VERY SIMPLE : The Nazi Swastika, was not invented by Hitler or the Germans. It was a Pre Egyptian and Egyptian emblem...It can also be found in Native American symbols. But Hitler and Nazi horror's exploited The Symbol ! The Confederate Flag, has much History and status. But, The KKK in the early 20 th century, hijacked this Flag, (Symbol) and carried out Murder, Lynching and Devastation to many in the South, and all over America ! Unfortunately, but accurately, these two SYMBOLS represent, Horror & Evil beyond most comprehension. Many perceive the Swastika as Evil, (When related to The Nazi Party, they're correct) & Many perceive the Confederate Flag as Evil, (When related to Racism, they're correct). What you perceive is how you believe.... Perception is Reality. Removal is just...Now what will Mississippi do ?","post_message":"They really destroy the argument for keeping the racist flag around."},{"comment_id":"10152793243512144","commenter_b":"They all want to save these illegals l, as long as someone esle does it. I say for every liberal who wants a say in this, place one illegal in thier home. That's immigration reform!","commenter_a":"'Overflowing sewage'.......yes liberals are","post_message":"'Overflowing sewage' will do that."},{"comment_id":"907462056016714","commenter_b":"Terry, but the illegals are taking away jobs from the blacks. WAKE UP. Joes trying to help you.","commenter_a":"GO JOE!! ..........someone needs to investigate these corrupt Liberal Judges","post_message":"And it gets worse ..."},{"comment_id":"10153450761424024","commenter_b":"blacks kill more blacks than any other race in this nation...but their little jungle minds don't see that !","commenter_a":"we don't want you because your dragging your diapers all over town. Get rid of the load, then we'll talk Leroy","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153940111165579","commenter_b":"Any women who can put an unborn baby through a shredder while it's alive....is nasty","commenter_a":"So good to see a man who stays and takes care of his kids. At least he wasn't chasing an intern around the Oval Office right..... Why is it Libs can be so mean to men who stay with their families and give honor to men who not only engage in adulterous affairs but continue to do so. Liberal women are nasty...that is all.","post_message":"Speaker Paul Ryan: 'This was not a job I was looking for or seeking, it kind of sought me. I realized that it was a duty and an obligation. Now realize it's an honor.' Watch complete press conference here: @webpagelink"},{"comment_id":"10153781629863132","commenter_b":"stupid girl","commenter_a":"I feel so sad for Anna and their four little M's","post_message":"Anna Duggar will likely not be leaving her husband Josh despite his admitted infidelity."},{"comment_id":"10153881396091336","commenter_b":"It doesn't take rocket science to figure out the motive","commenter_a":"But it was probably just workplace violence.... We just don't know...","post_message":"According to police, here’s what we know about the #SanBernardino shooting: @webpagelink • 12 pipe bomb type devices were found in the home at the center of investigation • All four guns were legally purchased • The motive has not been determined • There are no credible threats at this moment   According to the FBI, here's what we know about the suspects: •  Male came back into the U.S. in July 2014  •  Female came to the U.S. on a K-1 visa under Pakistani passport"}]
