[{"comment_id":"1162663783801971","commenter_b":"I stopped reading at \" good man \" Trump is far far removed from being a good man..","commenter_a":"Trump, regardless of what people who don't even know you say, I believe you're a good man & have good intentions for this country. Don't get sucked into what the government or anyone else wants you to do. You've called on Jesus to be your Lord & Savior & I'm proud of you for that because I know that the moment I did, He changed my life forever. Seek Him & all He is & He will give you all of your hearts desires. He's God, all His riches & glory will never compare to money, just stay focused on the Lord & you've got this! Trust me. He loves you.","post_message":"The spirit is amazing --- thank you to this homeowner in Florida for their support."},{"comment_id":"10154376961882217","commenter_b":"Britain needs to sort their own issues first!!!!!","commenter_a":"Odious poison dwarf","post_message":"Will this speech stop Donald Trump addressing the UK Parliament?"},{"comment_id":"1589075444729621","commenter_b":"To keep the Marxist Corrupt Hillary out!","commenter_a":"Why should anyone care what a theologian thinks about a political choice?","post_message":"ICYMI: Theologian Wayne Grudem lays out the moral case for voting Trump."},{"comment_id":"10153478960668984","commenter_b":"Shows what kinda person she is, she throws her own Dad under the Bus,, Classy, dirt bag.","commenter_a":"They say the acorn doesn't fall from the tree","post_message":"Mosby has made it widely known that she comes from a long line of police officers, but this admission reveals a very different look into her background..."},{"comment_id":"447409202129260","commenter_b":"She is the best candidate!","commenter_a":"Dear God deliver us from this evil!","post_message":"Slap Yo'self! www.eaglerising.com"},{"comment_id":"1585670881742175","commenter_b":"DRAIN THE SWAMP","commenter_a":"END THE CORRUPTION!","post_message":"WATCH LIVE: Donald Trump campaigns in Golden, Colorado before he comes to Phoenix."},{"comment_id":"892607410865802","commenter_b":"As far as an analogy, this is not \"I don't agree with you so I get to beat you.\" This was more like \"you're an abusive boss and I will not be quiet about it.\"","commenter_a":"I find it funny how these pro Trumpers freak out and say how violent Bernie supporters are when in reality it is Trump's hate filled rhetoric that instigates this reaction. God help us all.","post_message":"Californians are having none of Donald Trump's bigoted hate speech."}]
