[{"comment_id":"867849870028244","commenter_b":"I love this video! I can't stand the woman!","commenter_a":"Donald J. Trump should play, over and over, when she said, 'What difference does it make now?\" - regarding Benghazi. !!","post_message":""},{"comment_id":"10153313662524342","commenter_b":"No...not white people get away with murder No white lady who spoke nasty to an officer then killed herself ever got a street named for her... Thats just a black thing Just check statistics n wow Stereotypes proven true;)","commenter_a":"White people issues:/","post_message":"Police say an investigation into a mail theft led them to a drug lab   in a Pearland apartment.  DETAILS/MUG SHOTS --> @webpagelink"},{"comment_id":"831073873594702","commenter_b":"She needs to eat goat meat. Raw.!","commenter_a":"Hey monkey looking good","post_message":"What's wrong with her!? You have to read this:"},{"comment_id":"1833117833414623","commenter_b":"Migrants coming in to work for the NHS?","commenter_a":"its only going to get worse with all the immigrants coming in","post_message":"Worst NHS week in 15 years"},{"comment_id":"10153585034949497","commenter_b":"Eh you know how the hot chicks are...","commenter_a":"Area Gisele fails to properly deflate Tom Brady's balls","post_message":"The NFL has debuted new rules pertaining to the quantity, air pressure, inspection, labeling, and monitoring of game-day balls"},{"comment_id":"10153218446741051","commenter_b":"she wont care, she has another kid to take her spot. i bet she will continue to see him, and probly get married. sick nasty world!","commenter_a":"That is one sick family hope that mother feels real good abouit that sex, it cost her daughter and grandchild[s life.","post_message":"A pregnant lady walked in on her husband with another woman. When she realized who the woman was, she killed herself."},{"comment_id":"1302858003140584","commenter_b":"Hillary is a war monger. You think There would be peace if she was elected?","commenter_a":"He will destroy this country parents get ready to send your children to war","post_message":"Nailed it."}]
