[{"comment_id":"10154171433698701","commenter_b":"Crazy! :-)","commenter_a":"86 in Woodland, WA","post_message":"As of 2 p.m. today, Portland is hotter than Palm Springs, CA; Albuquerque, NM and Atlanta, GA! Stay up-to-the-minute with the FOX 12 Weather App: @webpagelink"},{"comment_id":"1082049255206943","commenter_b":"\"Claim to be Muslim\"??? Muslims marry 6 year old girls! Muslims think that women are 2nd class citizens! Muslims believe that women shouldn't be allowed to drive or leave the house alone! Muslims believe that the punishment for being gay is DEATH! Their culture and our culture can't coexist peacefully! Is there some part of that that you can't understand?!?!?!?","commenter_a":"It reminds me of Sodom and Gomorrah. The whole group would not allow the police to get to the BOY...What the fuck is wrong with these sick Bastards, that claim to be Muslim? Raping of young boys and girls is okay? I ned to re-read the Koran...","post_message":"Some of Obama's Muslim \"refugees\" were raping a 10-year-old boy when the cops were called.  The police arrived, but what they did once they got there has left the country furious.  It's time America learned the WHOLE truth..."},{"comment_id":"10154228784001378","commenter_b":"Yes ty @username I did","commenter_a":"@username did you get one yet?","post_message":"The Hatchimals are coming! The Hatchimals are coming! Target has announced that a new shipment of the hottest toy of the holidays will be popping up in stores nationwide starting today. Are Hatchimals on the list this year?"},{"comment_id":"529761760538579","commenter_b":"You ruined it","commenter_a":"@username @username Sam Finch We get the joke :)","post_message":""},{"comment_id":"10153816577949160","commenter_b":"You believed that nonsense? Sue glad Donald never cheated at anything.","commenter_a":"When can we not have to listen to lying cheating Teds shrill voice cry over everything. Ted cheated on his wife then lied about it.","post_message":"Donald J. Trump just won Indiana. Here's what that means.  READ MORE: @webpagelink"},{"comment_id":"10153673793456336","commenter_b":"Please don't find your way to StL!","commenter_a":"That is great, she prolly is afraid of going to prison!! She is about as racists as they come, she showed her true colors!!","post_message":"Breaking News: Baltimore Mayor Stephanie Rawlings-Blake announced Friday that she will not seek re-election.  @webpagelink"},{"comment_id":"1170305866326090","commenter_b":"@username you are the number one reason for birth control!","commenter_a":"I'm so glad they had a chance to speak about their loss. Some people don't care that lives were lost because they want to be so against a movement they can't possibly understand.","post_message":"These mothers who've lost their black children to police brutality and gun violence had a powerful moment at the DNC."}]
