[{"comment_id":"10153084060819330","commenter_b":"I. Jesus. Side. Way. I am not. Crazy. Even. With. Alzheimer. If. He. Every. Receive. Jesus. He. Still can. Today","commenter_a":"Elvis with his wings bowing his head.","post_message":"Do you see the angel in this ice formation on a porch in Bristol? Audrey Totire sent us this See It, Share It photo after her friends noticed the image of what they say looks like an angel.  What do you think?  See more top photos from the week here ---> @webpagelink"},{"comment_id":"10154216584759203","commenter_b":"Ivory towers allow a lot of false logic. She'll just fly away to her mansion. No skin off her nose.","commenter_a":"I thought, 'Well she is on with Bill Maher. Lets see how she explains this away. And all she did was lie. She said she simply said yada and the people who were complaining didn't see the interview. Well I saw the interview and she lied. Not to be undone though, after a few minutes with Bill Maher, she actually showed her true colors and did admit what she believes. Then to top it off, as soon as Bill Maher brought up their support for Ralph Nader, which cost the country GW Bush and millions of lives, she simply interrupted, pivoted and changed the subject. She is a horrible human being and I wouldn't watch another movie with her in it on a bet...even if she does have the best rack of any 70 year old(Oct) I've seen.","post_message":"Susan Sarandon found herself in the hot seat Friday night."},{"comment_id":"1117289745030745","commenter_b":"Joshua DeVere you don't like vaginas? You think they're 'yucky'? You stupid fucking asshole. You don't have testicular fortitude, you have testicular stupidity. Get off the steroids pee per head.","commenter_a":"I swear the haters probably have a sexual fetish on saying he failed as a president. It is more sad that around 23% of americans (more likely republican) still believe he is a muslim. -_(\\\\","post_message":"Pres. Obama's accomplishments speak for themselves. And to think that he did it all without ANY help from Republicans.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153313662524342","commenter_b":"No...not white people get away with murder No white lady who spoke nasty to an officer then killed herself ever got a street named for her... Thats just a black thing Just check statistics n wow Stereotypes proven true;)","commenter_a":"White people issues:/","post_message":"Police say an investigation into a mail theft led them to a drug lab   in a Pearland apartment.  DETAILS/MUG SHOTS --> @webpagelink"},{"comment_id":"10153579142479170","commenter_b":"she's never right !","commenter_a":"Sorry the American voters frustrated you. You can just stay home and learn to deal.","post_message":"According to Hillary, we're all just too stupid to understand how brilliant she is. She gets frustrated by that, and admits that her frustration is her 'greatest weakness.'"},{"comment_id":"10154234196571509","commenter_b":"Maybe if you realized the obvious. Terrorists would not attempt entry as refugees. They'd arrive as illegals and criminals along with the rest of the parade crossing into the US via our unprotected southern border.","commenter_a":"Try telling this to republicans and they won't listen, only people with commonsense know that it would be difficult for terrorists to enter the U.S. as a refugee. Maybe if fox news told them they would believe it.","post_message":"Here's how the refugee process stacks up to other ways of getting into the U.S."},{"comment_id":"699615530187912","commenter_b":"Its you Liberal Pukes who need safe spaces ! Too bad there are no safe spaces in NJ !","commenter_a":"Newt Gingrich says anyone who believes in Sharia Law should be deported. Hey Newt - I believe in Sharia law! 100%! Muh muh muh muh......MY SHARIA! Now - come try and deport me!","post_message":"'I'm through trying to understand the sick ideology of Islamism. Instead of trying to understand it, we ought to just try to kill it.' – Sheriff David Clarke @webpagelink"}]
