[{"comment_id":"843350562368952","commenter_b":"With the UK refusing to stop child molesting rings, why is it surprising that thier corruption extends to the zoo.","commenter_a":"Not a fan of any of the stories that start...\" You won't believe what happened after this....\" It's The Star magazine hook line and sinker. It's like the Kardashians are the publishers.","post_message":"\"Zoo of Horrors\""},{"comment_id":"604077913107506","commenter_b":"Heather: have you been living under a rock, or have you just somehow managed to not notice Hillary trashing her husband's mistresses (or victims, depending on how you want to look at it)? You're right, sexism IS still at large in this country, yet you want to vote for a woman who openly bashes other women and stands by her cheating, lying, scandalous husband? I'm not saying I like Trump, but dear God woman, have some respect for yourself. If you really think Hillary is going to stand for your rights any more than Trump will, then you obviously need to do a little more research.","commenter_a":"And it is unfathomable that a man with such decency, courage and leadership, as exhibited by her husband, has so often been disparaged and attacked by the right while they embrace a fraudulent sexual predator.","post_message":"\"I can’t stop thinking about this — it has shaken me to my core,\" Michelle Obama said of lewd remarks by Donald J. Trump."},{"comment_id":"486778464846067","commenter_b":"@username Your a FREAKING DUMB EXCUSE FOR A SO CALLED HUMAN BEING!","commenter_a":"What do expect out of a Muslim bitch that won't even place her hand over her heart when National Anthem is sang.","post_message":"Michelle Obama just said something treasonous about the flag. This is ridiculous, that flag is the symbol of the greatest nation on Earth. Do you support the American Flag?"},{"comment_id":"10152959541546519","commenter_b":"But it's totally cool that the white women told the black kids to go back to their Section 8 housing, right? Ugh.","commenter_a":"I truly wish people would read the whole story before commenting. This was one of 2 cops (until backup arrived) who had just been charged by dozens of young adults and teens. He has every right to fear for his safety...AND he has every right to restrain a \"kid\" who is illegally trespassing in a gated community and trying to run every chance she gets.","post_message":"This cop picked the wrong kid to harass and abuse..."},{"comment_id":"10153521630153984","commenter_b":"Why fight it? Gay marriage can't do any more harm to the sanctity of marraige then us heterosexuals have already done! 50% of marraiges or more end in divorce! We spend billions on weddings creating unesseccary specticals that have nothing to do with the marraige spoken of in the Bible! Jesus would not condemn, He would love. Point fingers if you want but my goodness people, haven't we learned our lesson yet?","commenter_a":"Thank you Judge Wes Allen! May others follow you!","post_message":"This official took a bold stand for traditional marriage, and the initiative is spreading across the state. Do you support what this probate judge did?"},{"comment_id":"10153132255848145","commenter_b":"Thank you Rachel Payne Nunlist! :)","commenter_a":"I'm sure I will get major flack for this, but the older kids were 10 & 8!!!! Why don't they OPEN THE STUPID DOOR??? I'm not saying the mom was right, the kids could have for sure been taken, but for heavens sake, 10 & 8 is still 10 & 8 when it comes to a hot locked car!!!","post_message":"When a passerby found three young children alone in a locked car, police were called. The children's mom was found a few minutes later in a tanning salon. Here's what happened: @webpagelink #wftv"},{"comment_id":"10152949428967061","commenter_b":"who freaking cares,she need to get her tubes tied !","commenter_a":"none of anyone's business....really don't care....","post_message":"Bristol Palin announces second pregnancy; says she knows it will be \"huge disappointment\" to many: @webpagelink"}]
