[{"comment_id":"618479561657305","commenter_b":"You should really pay a visit to area 51 theres aliens there","commenter_a":"Why didn't you bring up in your speech how the people at the Bataclan were tortured and videotaped before being murdered - oh and that it was hidden by the media...","post_message":"Hillary Clinton will increase Syrian refugees by 550% without a realistic screening process."},{"comment_id":"983254505089966","commenter_b":"I can't imagine any other first lady doing that. Both of them are not comporting themselves as befitting their roles","commenter_a":"Michelle is no rocket she looks like Ichabod crane","post_message":"What an embarrassment"},{"comment_id":"1391521917576588","commenter_b":"She is one ugly ape!","commenter_a":"Where is the FBI? Where is homeland security? These idiots are threatening the president of the United States.","post_message":"Nasty Liberal Journalist Asks Why Trump Assassination Is Taking So Long INSTANTLY Blows Up In Her FACE!"},{"comment_id":"10152593040747093","commenter_b":"Both need supervision. That dog could have killed that child.","commenter_a":"Can't blame a 3 year old.","post_message":"Parents of a 3-yr-old attacked by a dog are not happy...b/c the dog’s owners aren't going to get rid of the pet… @webpagelink"},{"comment_id":"10152999790806167","commenter_b":"I would pay money to watch Nikki Haley and the vampire fight each other.","commenter_a":"conservative firebrand???lol whatever! she is a delusional racist self hating woman!","post_message":"Fact: Governor Nikki Haley was born in South Carolina."},{"comment_id":"854726854659317","commenter_b":"Build the wall","commenter_a":"The Donald has done it again @username","post_message":"I don't have time for political correctness and neither does this country. Donald J. Trump"},{"comment_id":"10153051831985950","commenter_b":"WTF?! I would have knocked that bitch the fuck out if that were my child. And the so called DAD is a piece of SHIT too! They need to light her ass up in PRISON! >:(","commenter_a":"What?! I can't comprehend this... why,,,,","post_message":"Police say a stepmom bullied her now 15-year-old stepson: \"She asked me if I wanted to play the game,\" the boy said. \"And I said no. So then she called me 'punk,' so we did it. We went in the bathroom, she poured a whole bunch [of alcohol] on my butt and then she lit it on fire.\""}]
