[{"comment_id":"10153535023142522","commenter_b":"fine, let's see what you got","commenter_a":"@username reckon you can make one of these with those design skills of yours?","post_message":"Grill while you chill:"},{"comment_id":"488632654671676","commenter_b":"55555","commenter_a":"Nonthawat Ford Focus @username","post_message":"Watch this T-Rex own ‘American Ninja Warrior.’"},{"comment_id":"502143199967560","commenter_b":"I wouldn't even give her the Cleveland steamer","commenter_a":"That's a face you could donkey punch.","post_message":"She makes it official!"},{"comment_id":"1890349187852006","commenter_b":"One does not have to TRY to cast america in a bad light..... The racists & Nazis here do a good enough job by themselves. America is NOT great, & will never be great again until the cancer which arrived here In 1492 is removed. Swim back to Europe racist beast","commenter_a":"Stupid, stupid, stupid. I only still like this site cuz i wanna read what propoganda u spew next. Has anybody else thought that this site is communist run, or pro russian. They always try to find ways to cast the US in a very bad light","post_message":"OMG, did you hear? $$ Dump: @webpagelink DAPL Raid: @webpagelink Drone Bomb: @webpagelink Join Us: The Free Thought Project"},{"comment_id":"10153513922564087","commenter_b":"Typical obfuscation from a serial liar & all-around nasty woman,","commenter_a":"Bernie will release whatever you ask him to. He has nothing to hide!","post_message":"“Let everybody who’s ever given a speech to any private group under any circumstances release them,” Hillary Clinton said on ABC’s “This Week.” “We’ll all release them at the same time.”"},{"comment_id":"10156311774755354","commenter_b":"you bitch","commenter_a":"POS","post_message":"PARTY TIME!!!"},{"comment_id":"1301129679938665","commenter_b":"Would it be ok if you calmed your titties and stopped being such a butthurt faggot?","commenter_a":"(Cough) tarnak farm friendly fire incident (cough)","post_message":"Sometimes it's not the enemy you need to worry about. ~Will"}]
