[{"comment_id":"960454674002831","commenter_b":"I agree and anyone with a brain knew what the little guy was doing. Your business and the buck stops at the top. But Rubio wouldn't know about a business or for that matter what it's like to take a job and show up to work! Only be a puppet whipping boy for the old lifetime old farts on the hill. Look on line about Rubio and pulling strings to help his drug dealing brother in law? Check it out! This is the jurk running for the top office? Or any office! What a joke and a choker! Did I get it right little man that sweets like a pig?","commenter_a":"The true story... Trump did not know the Sub contractor hired the polish workers but settled it anyway and took responsibility even though it was not his doing.. Rubio and Cruz are the con-artists and the liars. Typical politician bull-crap. @webpagelink","post_message":"MARCO-BOT is back!"},{"comment_id":"1249598461784360","commenter_b":"Illegal go home","commenter_a":"Why doesn't anyone show compassion? They lost their mother, they are grieving. How would u feel? Instead they act like she is a criminal for wanting her kids to have a future no matter what happened to her.","post_message":"LIVE VIDEO: The family of the Valley mother who was detained and deported under President Donald J. Trump's immigration executive order speaks outside of ICE headquarters in Phoenix. STORY: @webpagelink"},{"comment_id":"10154734487368352","commenter_b":"You got that right,unless she's a fool","commenter_a":"When they get that paper he'll want a black woman","post_message":"Browns quarterback Robert Griffin III pictured walking hand-in-hand with a blonde Estonian athlete as reports he is divorcing his wife of three years emerges"},{"comment_id":"10153411890826167","commenter_b":"Don't Muslims go the mosque all the time? What's the big deal?","commenter_a":"Well, we knew THAT was coming!!","post_message":"The White House said Obama's upcoming mosque visit is meant to \"reaffirm the importance of religious freedom to our way of life,\" but suddenly conservatives don't seem to care about that:"},{"comment_id":"10153060149946051","commenter_b":"Bitch boy Yu still white nd YUr trash to pussy","commenter_a":"Nothing like white/black trash argueing!","post_message":"When this woman heard what a couple parked near her said, she lost it."},{"comment_id":"10153203949426782","commenter_b":"This is complete BS!!! They are illegals!! NOT undocumented.... In Oklahoma you have to prove you are here LEGALLY, not an illegal criminal to get an Oklahoma ID or DL. Sign up for a DL as an illegal and get deported.","commenter_a":"If Americans went to Mexico illegally, they would be thrown in jail, deported, if they're lucky, possibly shot and killed, but I can guarantee they wouldn't be given free medical, free schooling, welfare, jobs, driver's license, etc....all at the tax payer's expense.","post_message":"An Oklahoma City grassroots effort to get undocumented immigrants drivers licenses is gaining momentum."},{"comment_id":"10152665844280667","commenter_b":"If only she would run Elisabeth Warren would get my vote.","commenter_a":"Can't sstnd this women! She DOES NOT and WILL NEVER, EVER vote for her!!! Liar, liar, pants on fire!","post_message":"56% of women have a favorable opinion of Hillary Clinton, a Gallup Poll finds."}]
