[{"comment_id":"1049402575096281","commenter_b":"Talking about slavery isn't race-baiting. It's American history. Also, I didn't hear you mention the part about women's rights.... Did you also mean gender-baiting? If not, maybe you are the one stuck on race...","commenter_a":"America was great when americans had pride in your country instead of some fatherless minion trying to tear it apart to serve his race baiting tv program...","post_message":"“Make America Great Again” begs the question: when exactly was America great?"},{"comment_id":"10154249804566509","commenter_b":"And they say white men can't jump.","commenter_a":"He just proved obama has crappy security. There have been tons of jumpers since obama became president. You would think they would have increased security by now.","post_message":"This photo shows the White House fence jumper in the middle of his attempt to go over the barrier on #Thanksgiving. @webpagelink"},{"comment_id":"10156788909185354","commenter_b":"She's a dick!","commenter_a":"A good start. Now take back the universities, colleges and America from these thugs!","post_message":"BOOM."},{"comment_id":"1693365440922113","commenter_b":"We need to take back our country from these liberal Morons! How dare they: your rights STOP where ours begin!","commenter_a":"Funded by MUSLIM BROTHERHOOD to divide & conquer!","post_message":"Black Lives Matter supporters spat and stood on the American flag outside a Donald J. Trump rally Sunday."},{"comment_id":"10153224417118984","commenter_b":"Both sides of her mouth - she's guilty and she knows it","commenter_a":"YES; An Orange Pant Suit would do just fine!!","post_message":"The irony is unbelievable. I don't think I could have said it any better than Hillary did in this 38-second video... Should Hillary be punished for her email scandal?"},{"comment_id":"477998972394364","commenter_b":"Me too, but sometimes I go overboard and can't keep track of all my comments on the Internet.. So I have to take a break.. Also I get discouraged when people call me names :(","commenter_a":"They didn't say \"get over it.\" They promised to look into it, did so, and concluded that their pop culture reference was fine and that people misconstruing it would be in the minority and no changes needed to be made. Kinda funny how you can spin a story with a contentious headline. Ben & Jerry's seemed concientuous and compassionate here, not combative and dismissive as the headline suggests.","post_message":"These folks became very upset over the name of Ben & Jerry's new ice cream flavor and demanded it be changed. Ben & Jerry's response: Get over it."},{"comment_id":"10154400468321509","commenter_b":"How does this help improve the economy, education, and create jobs! The battle is more than Hilary, let her stop dreaming!!!!!!!!!","commenter_a":"Go directly to jail","post_message":"Hillary Clinton: \"I will defend voting rights, and make it a priority... to get rid of Citizens United and its pernicious effects on our electoral system.\" Read her opinion piece on CNN: @webpagelink"}]
