[{"comment_id":"10153054297358984","commenter_b":"Obama has always chosen the side of the terrorists from the very beginning. I can't help wondering if he was in on the planning and carrying out of the 1st 9/11 attack and just what his roll has been in other events like the shooting at Fort Hood, etc.","commenter_a":"If 3.7 million protestors and marchers didn't get Obama off his ass then nothing will. Not just any but those that support freedom and liberty.","post_message":"This man does not have a problem telling us how he really feels. And boy, does he have some harsh words for Obama...  Do you agree with what this Lt. Colonel just said about Obama?"},{"comment_id":"10154157874771130","commenter_b":"'@username Your comment shows you failed to do any research before blabbering...a familiar Trump trait. The Ukraine government was propped up by the Russian government at the time Manafort was dealing with them. It was Russian/Soviet Union weaponry that took the life of a cousin in Vietnam. I'm a veteran from the Reagan era and broke out in a cold sweat every time general quarters was sounded thinking Russia/Soviet Union had finally attacked us. From the day I first opened my eyes Russia/Soviet Union was my country's enemy. Today's Russian government mirrors the government of my former enemy and the GOP candidate praises their leadership and hints that we should crawl in bed with them...I THINK NOT!!!!!","commenter_a":"Well, this is not news; Dumbocrats support rigged elections not the popular support. I don't get it, why leftists are so stupid and dumb?","post_message":"Size isn't everything 😜"},{"comment_id":"1011822325526221","commenter_b":"Iran needs to get with the times. You se to want tourism but then scare people off by arresting people for no reason. Wake up!!","commenter_a":"generally muslim men under lucifer Allah do not respect women very well, look obama does not he muslim islamic religion","post_message":"In recent years, debate in the west has largely focused on the more visible aspects of the status of Muslim women and Islam, with many claiming that women have fewer rights than men."},{"comment_id":"10152777121252217","commenter_b":"Lots of girls called Charlotte if u want to call her it then do nobody will care","commenter_a":"Well we are due a girl in 6 weeks and charlotte was on our list of names 🙈 Well thats not going to happen now because there will be thousands choosing it because of the princess lol","post_message":"#RoyalBaby: Introducing Charlotte Elizabeth Diana - she'll also be known as HRH Princess Charlotte of Cambridge"},{"comment_id":"10156463430895354","commenter_b":"Look another bitch working for Obama","commenter_a":"What about anti american hate speech from scuzzy muslims ? Real americans dont like having to suck up to people who want to kill real americans !A plot by our government to change America into a third world craphole !","post_message":"Obama prepares the muzzle to silence Americans who are FED UP with his coddling of terrorists."},{"comment_id":"968496726540356","commenter_b":"That thinking, @username, is why so many illegals come here. They know if they have their 'anchor' baby here, they will get to stay because that baby needs parents to care for it. More illegals come, have their babies, and get to stay...it's an endless invasion!!!","commenter_a":"If you are born in the United States and not on foreign soil like an Embassy, then you are an American, but that doesn't mean your parents or the rest of your family are!","post_message":"A few of the candidates have come out against birthright citizenship so far.  Message your Rep and make your voice heard!"},{"comment_id":"1698523013768491","commenter_b":"Women making decisions over a man's body","commenter_a":"It's not for fucking cosmetic reasons. It's for hygiene and it prevent a large amount of penile infections.","post_message":"Y'all should probably still stop cutting baby's dicks for cosmetic reasons though."}]
