[{"comment_id":"1113814495365780","commenter_b":"@username Illegal immigrants cost taxpayers money and jobs as well as their lives.","commenter_a":"American taxpayers are spending over $130 Billion a year on welfare programs for illegal immigrants and that doesn't include prison for the felons.","post_message":"American taxpayers have already spent billions of dollars on border security, including a 700-mile long physical barrier along the southern border."},{"comment_id":"10153815696151336","commenter_b":"I don't know about that. I think this election we have many that will go up against HRC. She ruined her own chances. Everyone's sick of the shenanigans","commenter_a":"\"DESPERTA FERRO\"..., AWAKEN IRON!!! Christian Battle Cry of the Crusades. Unite and Fight people. WIPE THIS DEMOCRAP FILTH FROM AMERICA!","post_message":"“I am Hillary Clinton‘s worst nightmare — a conservative woman who will take her on on her track record and her policies and her lies.” – Carly Fiorina"},{"comment_id":"557055264492970","commenter_b":"What scum bunnies.","commenter_a":"It should be simple, if you don't vote, then don't complain! But it seems the ones who didn't vote, are the ones crying, whining, rioting and be rude!","post_message":"\"That's sort of amusing,\" Donald J. Trump senior adviser Kellyanne Conway tweeted."},{"comment_id":"10153394971818984","commenter_b":"She is as stupid as her 2 sons. one is hell now ,, the otherone will follow .","commenter_a":"I wanted him to get life in prison I did not want him to become a martyr","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing... Do you think this Boston bomber got what he deserved?"},{"comment_id":"10155137005061037","commenter_b":"Most illegals come here by not wading a river.","commenter_a":"Trump supporters are more worry about illegals than of terrorists what a sad world dnt forget that criminals come of all races and not just cause your brown skin means your from mexico Natives,Mexicans,Italians share the same skin color","post_message":"He once referred to it as “The Great Wall of Trump.”"},{"comment_id":"809439485771743","commenter_b":"no sh-- sherlock, and obummer is running circles around the media....idiots.","commenter_a":"Andrea you are so astute! That is more than obvious, with that clown Kerry doing the negotiating!","post_message":"We could've told you that, Andrea. #Iran"},{"comment_id":"985798528183066","commenter_b":"What if the Mexico government said any pregnant women being deported back to Mexico must have an abortion. Would ya let them stay or kill the baby because remember #alllivesmatter.","commenter_a":"I don't know. I still see a lot more dead baby posts than lion.","post_message":"\"This is offensive stuff, and there’s more outrage about a dead lion than there is about dead babies.\" -- Marco Rubio, on Planned Parenthood's videos"}]
