[{"comment_id":"920923791276376","commenter_b":"She is a scandal ridden low life scum.","commenter_a":"What does this say about Hillary Clinton?","post_message":"BREAKING - Hillary Clinton's Sex Scandal"},{"comment_id":"10154633905401336","commenter_b":"LOL, Yahoo doesn't have that many accounts....is this a hoax for attention?","commenter_a":"Your World with Neil Cavuto----- You are talking to a brick wall today,","post_message":"Breaking News: Yahoo says at least 500 million accounts were hacked in 2014, and reportedly believes the culprit was a “state-sponsored actor.” @webpagelink"},{"comment_id":"875716175906497","commenter_b":"No Muslim majority country throws gays off of buildings (unless you want to recognize the legitimacy of the 'Islamic State'). Genital mutilation has no semblance of a relation to Islam. It's a cultural problem endemic of Northern Africa, not Islam (Christians and Jews from this region have the same problems with this practice).","commenter_a":"Yeah, except this ancient religion doesn't through gays off buildings, mutilate female sexual organs, and and want to kill anyone who doesn't become a Jedi! DUMBASS!!!!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10152906901509270","commenter_b":"Unreal !!! This makes me sick !!!","commenter_a":"It's just Wrong. Wanna bet the Commander in Chief authorized this crap..","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10155161723871037","commenter_b":"You are so gross ...","commenter_a":"States where mestizos who refuse to learn English because we made it possible to not have to learn English and tell them assimilation is bad, have horrendous scores.","post_message":"Number 1? Massachusetts."},{"comment_id":"1304804312923886","commenter_b":"Your kids would be better off in a Orphanage than with you..","commenter_a":"Lock them up","post_message":"They blazing new trails."},{"comment_id":"969391529750304","commenter_b":"Even a whore has the right to decide when she has sex!","commenter_a":"Following a celebrity back to their hotel room doesn't make you ambitious. It makes you a whore.","post_message":"This is the side of the Bill Cosby rape scandal that hardly anyone is talking about  but everyone should."}]
