[{"comment_id":"10152804178333445","commenter_b":"I am too good for Reggie foo. Keep that shit.","commenter_a":"Ya dumbasses the shit from cali been growing by the mountains .and guess who growing that the mexicans .indica or sativa its the same shit. Stop acting like you are too good for Reggie. Spoiled ass dudes.","post_message":"Legal Marijuana Screwing the Mexican Cartels  @webpagelink"},{"comment_id":"1420083668051377","commenter_b":"Oh shes a female.. whoops","commenter_a":"Muslims r like a football team. The radicals /terrorist r the strikers. The extremists r the midfielders who feed the radicals. The defenders r the moderate Muslims who create diversions, deflect, defend and save Islam from legitimate criticisms n any accusations. They work as a team though they create the perception that the defenders have nothing to do with the strikers. The Liberals r the goalies who jump in when the situation gets worse with statements like Islam is a religion of peace @ De Joe Int'l ur comment had to be repeated.","post_message":"'We march through the night to cut and behead... Allahu Akbar'"},{"comment_id":"10154420026498984","commenter_b":"If the white house puts up another fence to keep people of its lawn then its only fitting to build a wall to keep people from coming into the country","commenter_a":"I grew up 30 miles from the border of Mexico. You need to be there to understand. Most Americans are clueless about the Southwest.","post_message":"This was NOT what the journalist expected...  Do you think America needs a president with a tough immigration stance?"},{"comment_id":"10153412977987293","commenter_b":"Racist white lady alert","commenter_a":"I've never seen or heard of another president blamed for more things out of their control.","post_message":"It's not like he keeps a dais parked in front of the desk all the time."},{"comment_id":"1279009012178004","commenter_b":"Fuck that girlfriend","commenter_a":"I woulda just gave her the pipe since the gf it a dumb bitch anyways","post_message":"Dude passed the test!  #WSHH"},{"comment_id":"10153235359857093","commenter_b":"Same procedure as a mandatory hurricane evac. Some people just have to cause issues tho","commenter_a":"Are they going to arrest people who do? It's interesting that the homeowners aren't allowed to determine if their own home is safe.","post_message":"The Garland Police Department is asking those people who are able to remain safely sheltered in their homes to do so.  Residents who leave the damaged area will not be allowed to return until it is deemed safe.  Officials are working to identify and secure any possible utility hazards such as gas leaks and downed power lines."},{"comment_id":"10153527716947623","commenter_b":"Trump will get enough advertising on Buzz feed by way of the anti Trump protestors acting like idiots. If you watch a video of people getting assaulted and are ok with it then you don't have much of a moral character. Why should America allow illegal immigrants to keep coming in and why shouldn't we have the ones here deported? There are legal ways of coming to this country use that rout and people will respect you more. Don't want to become legal then don't come to the USA. Stay in the country you are from.","commenter_a":"Wow, this is pretty pathetic. Considering Trump's numbers I believe we can infer he'll continue to do just fine without Buzzfeed's advertising lol. Can't wait to see their reaction this January! #Trump2016!","post_message":"\"We don't run cigarette ads because they are hazardous to our health, and we won't accept (Donald J. Trump) ads for the exact same reason.\""}]
