[{"comment_id":"10153692267024087","commenter_b":"Li'l ol' ladies with landlines","commenter_a":"In New York,Hillary has a 4-point lead over Sanderss...There is no doubt that she will win N.Y thanks to black votes but by a small margin......She is so popular among African Americans despite that her husband sent 2.4 million black males in jails..It is difficult to explain or justify thier desire to vote in favor of their oppressor..She has 16 points ahead of Sanders in the city of Philadelphia (Pennsylvania) once again thanks to black voters.Hlllary clinton is unpopular among independents and blue collars .It will be impossible for her to win the general election in November without these voters.. ..Only Sanders can persuade independents,and blue collars to vote for democrats in the next election...Sanders is also the only leading candidate with positive favorability at the national level. .","post_message":"\"This is the best territory for him on the calendar,\" Hillary Clinton's campaign chairman John Podesta said of Bernie Sanders's recent wins. \"Most of those were Western caucuses. But when you look at what happened overall in this election, she's gotten 2.4 million more votes than Bernie Sanders.\""},{"comment_id":"10153835231273984","commenter_b":"If it were any of us, we would be held accountable! This IS her mess!!!","commenter_a":"Fry the bitch! Tired of listening to her lies, and hearing her giggle when she's asked about her emails as if she knows she already got away with murder!","post_message":"WOW. There's no doubt Hillary did NOT want this to get out there. This makes things looks so much worse for her... Do you think Hillary Clinton should be held accountable for her actions?"},{"comment_id":"1558222467532092","commenter_b":"Oh, oh. Is this were the Kiju come from?","commenter_a":"And what will happen if we try and remove it? It will cause all kinds of movement in the earth's crust - aka DEVASTATING EARTHQUAKES!","post_message":"It's as much as 1,000km down, a third of the way to Earth's core."},{"comment_id":"1047910738660847","commenter_b":"Exactly who would this little girl call if a robber happened to storm into her place of employment and point a gun at her, another employee or patron? Who would she be begging to step in between herself and a threat? Who would be more than willing to lay down his life for her? The answer is the man she refused to serve. I'm glad she lost her job. I hope others learn from her foolish mistake.","commenter_a":"hahahah yes!","post_message":"An Alabama Taco Bell employee who refused to serve police officers has been fired."},{"comment_id":"964740956976016","commenter_b":"I am glad to see someone else that sees what is happening. Right now there are 76k Islamic refugees that have arrived and continue to come. Barack Husein Obama has strategically placed them throughout the U.S. Now ask yourself, how long will it take before key cities fall to Islam within the U.S..? He knew what he was doing, and his plan is working due to tolerance and bleeding heart liberals. It may not be next year, however, in the near future, we will see more turmoil through Islam than anything else. Bullets and beans brother...","commenter_a":"Notice that the UN is NOT pushing to fight Muslim extremists so these people don't have to flee their homes? That they're trying to export them around the World instead? The reason is OBVIOUS. To create chaos and bring down western culture. Look at France and Germany's problems with the bastards..","post_message":"That was a ... BAD idea. Check it out. @webpagelink"},{"comment_id":"10153700802697235","commenter_b":"Untrue. Unfair. The DC snipers were/are referred to as mentally ill, not as \"thugs.\" I can't think of another black mass shooter offhand. Most U.S. mass shootings are either non-blacks with histories of mental illness, or gang/drug related shootings committed by blacks.","commenter_a":"It's because he was white. That's why now it's about mental illness next week a black kid will be a thug or a menace to society","post_message":"This is a big lie we're always told so that we can avoid talking about the obvious -- GUNS."},{"comment_id":"10153476732498132","commenter_b":"She can't sing or act....","commenter_a":"She's still hotter than Kim Kardshian and she has talent.","post_message":"She must be a magician with double-sided tape. #MetGala"}]
