[{"comment_id":"10153349843651051","commenter_b":"She's a stupid bitch","commenter_a":"Aunt Jen, your a money hungry twat.","post_message":"This aunt is suing her 12-year-old nephew for $127,000 over a hug."},{"comment_id":"1229145840456983","commenter_b":"Clinton can't tell the truth! Can't remember her lies ! Gives her daughter 1,000,000$ a year of stolen money gained from corruption even year making Chelsea an accomplice ! As well as an accomplice to her email crimes! Arrest them all 2017!!!! Obama and Clintons open boarder policy and the invasion led by both to destroy America while millions come their way ! A record number of illegal aliens penetrate our wide open borders and manipulate a dysfunctional visa system, the boys now urinate in the girls bathroom if they identify as a female, the growth of Islam in America is unstoppable, the debt is so high the number appears fake, the shrinking of the military is sickening, veterans are killing themselves at alarming rates, the war on cops is an epidemic, we back to segregating college campuses, Obamacare is worse than what we had before it was a law, ...","commenter_a":"Hello she bed IP with people ehp kills hays","post_message":"She is the LAST person in the world who should be lecturing anybody about respecting anybody's rights, with her own HORRIFYING connections..."},{"comment_id":"10153333368109705","commenter_b":"Maybe more like 12, but the whole \"space age\" thing they started with \"i\" everything is tired. Heck, even their naming scheme. About the only difference today is they do most things in aluminum instead of white plastic, but it still has the same design queues. But who can blame them? When you have so many people branded to buy your products without blinking, change would be scary.","commenter_a":"Let's hope so. Apples design has been stale & stagnant for the last 15 years. For a company who is lauded for it's design, I can't believe It's gone this long without some fresh blood or new design ideas.","post_message":"Jony Ive just got promoted to Apple's C-suite. Here's why it might be his first step toward the exit door."},{"comment_id":"10153968888907894","commenter_b":"I am with you Tee. These woman don't have any sense, you better get with a man with money. Get your own money as well.","commenter_a":"All these females calling her a gold digger but running around single as fuck with some random broke niggas kids they ain't even with....lmao...ladies it's wise to get with a man that can provide and keep yall asses out the welfare office and from working dead end jobs so you can actually raise your kids. ...but yall been taught it's proper and prideful to struggle with a dude that can't even purchase you a house let alone afford school uniforms for public school 😂😂😂😂","post_message":"60-Year-Old Mel Gibson and His 26-Year-Old Girlfriend Are Expecting"},{"comment_id":"10153186932521167","commenter_b":"Women who watch faux news confuse me","commenter_a":"Brittany Shelton OMG!","post_message":"We were going to do a \"Top 10 Awful Displays of Sexism on Fox News\" video, but the clips just kept rolling in. Here are 70:"},{"comment_id":"10153831793476438","commenter_b":"Celine O'Hara maybe you are the one biggest fucking idiot !!!","commenter_a":"After he was done introducing Trump, I fully expected Trump to say to him, \"Now shut up and go home.\"","post_message":"Will somebody please help Chris Christie? Seriously: Is this a hostage situation? @webpagelink Christie does not seem to enjoy serving as Donald Trump’s hype man. Like, not at all. Do you see any hint of joy as he introduces Trump at his press conference in Palm Beach tonight? This is a hostage who is reading a statement with a gun pressed to his back."},{"comment_id":"10156415559120354","commenter_b":"This woman.. Needs to be sent to a Muslim refugee camp ... What a sorry idiot ...","commenter_a":"Bill should be running for president","post_message":"“56% of Americans believe that the Syrian refugees have odds that are at values — their values are at odds with our values. That may not be wrong. If you are in this religion, you probably do have values that are at odds. This is what liberals don’t want to recognize.\""}]
