[{"comment_id":"919439784782166","commenter_b":"She is a no brainier!","commenter_a":"Sarah Palin has a mental drought that no reservoir will cure.","post_message":"Sarah Palin is here, and she's got some wisdom for y'all."},{"comment_id":"1352047571524023","commenter_b":"Lock her up","commenter_a":"Merry Christmas from Michigan","post_message":"Pat Dollard LIVE! The secret Truth of Obama"},{"comment_id":"10153182332356051","commenter_b":"i dont read anything about this lying bitch","commenter_a":"Hell no","post_message":"Here is how Hillary Clinton is defending herself against the e-mail scandal. Do you believe her?"},{"comment_id":"10153973009181409","commenter_b":"Considering Hillary shouldn't even be allowed to run she should be the one stepping down","commenter_a":"Then he should step down from running ... it's the right thing to do","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1023827831012269","commenter_b":"Darlene Daniel not fair to Americans. Take way American jobs with low wage illegal invaders","commenter_a":"We 'ALL' know that Donald Trump is 'NOT' afraid of Megyn Kelly. Actually it is just the opposite. Fox News is AFRAID OF DONALD TRUMP.","post_message":"Michael Moore chided Donald J. Trump for being afraid of Megyn Kelly and backing out of the upcoming Republican debate Tuesday night on 'The Kelly File.'"},{"comment_id":"10154965744184641","commenter_b":"I would agree that would be a good reason to March however that March said absolutely nothing about this. As a matter of fact the lady running the March believes in Sharia law and in her belief system this is perfectly acceptable","commenter_a":"This why we march. This is not acceptable for ANY culture.","post_message":"When she was 12, she was sold into 'marriage' with a 70-year-old man -- and there are hundreds like her."},{"comment_id":"10153060785906519","commenter_b":"Hillary covered up for him all those years in AR because she knew he was going to be president. The wives of predators who cover up for them are almost as guilty as the offender. She only cares about one thing...power.","commenter_a":"Y'all still talking about Clinton and consensual sex. Oh I get it Hillary's running, so y'all need to bring that up again. Never mind that it isn't relevant! Or are we blaming Hillary for a spouse that strays?","post_message":"'The actual facts of the matter are that Bill Clinton was a serial abuser of working-class women–he had exploited that power differential even in Arkansas...'"}]
