[{"comment_id":"1725002974382878","commenter_b":"Send this fool to the hangman to show that that USA won't put up with this crap, my husband post this","commenter_a":"obama 's sons if had them","post_message":"These disgusting Donald J. Trump-haters showed up to protest Trump as publicly and obscenely as possible.  And part of their protest was a SICK demonstration involving the American flag.  But before they could finish, they heard a voice give 1 order they never expected to hear..."},{"comment_id":"687121244811787","commenter_b":"She can go and join Isis!","commenter_a":"Fuck this traitor bitch","post_message":"Woman goes on TV and points the finger at Americans for this. She has some nerve. What a ridiculous statement. Does this infuriate you?"},{"comment_id":"1015366121832142","commenter_b":"Get em allll out of our country","commenter_a":"True!!!!!","post_message":"NO Sharia, NO Obama!"},{"comment_id":"10152607725262452","commenter_b":"How does he have signal?! Lol","commenter_a":"Meanwhile, we're all on our phones judging this man. Lol","post_message":"It's a sign of the times -- an Instagram photo shows a man missing a humpback whale surfacing just two feet away from him because he was glued to his cellphone. @webpagelink  (Photo via Instagram/Eric Smith)"},{"comment_id":"502459539951113","commenter_b":"RINO","commenter_a":"Who cares about Romney! Let's move on and win this one!","post_message":"You cannot be serious."},{"comment_id":"1005304559506884","commenter_b":"@username wow dude! go tell that to china, india, russia...they pollute the air you breathe in an astronomically higher number , last i checked, the earth only has one atmosphere.","commenter_a":"God be with you and your team as you go forward for our great state of Kentucky.","post_message":"\"They bribe us with our own money to stick it to ourselves. And we will not do that anymore in the state of Kentucky.\""},{"comment_id":"10153095836953299","commenter_b":"What does she care, it's not her money.","commenter_a":"no wonder she is flopping around like a boated eel.","post_message":"Almost $1 MILLION on polling alone in just a few months...."}]
