[{"comment_id":"10153362119139087","commenter_b":"IF I WERE A JEW ,,,, i would not want this broad on my side shes a idiot !!!!!","commenter_a":"Oh, please nitwit.","post_message":"“Our country turned [900 Jewish refugees fleeing Germany] away, and many who were sent back to mainland Europe were killed in the Holocaust,” said Democratic National Committee Chairwoman Rep. Debbie Wasserman Schultz. “Instead of learning from that mistake, Republican candidates and politicians were eager to repeat it.”"},{"comment_id":"10153437815231680","commenter_b":"She is worthless!!","commenter_a":"Hillary... Who DA feck Cares!!!","post_message":"Hillary Clinton: 'Well, as one of the more than 65 million Americans who voted to reelect Barack Obama, I’d say my voice is being ignored right now because of their obstructionism.'"},{"comment_id":"993982434028144","commenter_b":"That's my girl.","commenter_a":"Aarøn Andersøn","post_message":"'The Seniors and Veterans Emergency Benefits Act would give about 70 million seniors, veterans, people with disabilities, and others an emergency payment equal to 3.9 percent of the average annual Social Security benefit, about $581 – the same percentage raise as the top CEOs got last year.'  Read more here: @webpagelink  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153576717714024","commenter_b":"This is what's wrong with our country. Not just the BRAINLESS, CLUELESS, MORONS like her in congress, but THE SAME ONE'S THAT PUT HER THERE!","commenter_a":"They do indeed walk among us and get elected","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink #BB4SP"},{"comment_id":"10153302293701051","commenter_b":"EVERY country is populated at some point in its history by people who migrated to it ... THAT is how all countries began.... good grief. No one is against LEGAL immigration.","commenter_a":"Nearly 100% Americans ARE immigrants. Through their ancestors. :-))","post_message":"Do you agree with the vast majority of Americans on this?"},{"comment_id":"10154724621788984","commenter_b":"Hey Walmart has glasses 2 for the Price of one One for your dumb Head and one for Your your brown spot","commenter_a":"Lady you need to get your head out!Quit your job cause you are not of sound mind like Hillary Clinton","post_message":"Attorney General Loretta Lynch just issued a message to Charlotte rioters - and something about it immediately raised eyebrows."},{"comment_id":"10154632790424705","commenter_b":"Isabel Galindo","commenter_a":"'@username xx","post_message":"Flawless."}]
