[{"comment_id":"480718348785412","commenter_b":"She needs to take her husband and leave go back to were ever their home is","commenter_a":"She has no right to tell anyone what they can or cannot eat. She needs to worry about herself.","post_message":"What Michelle Obama is banning now is just plain unacceptable.  The American people are tired and finally fighting back.  Do you agree Michelle Obama should mind her own business?"},{"comment_id":"1163050380483299","commenter_b":"'@username, I'm quite happy with my wife of 33 years, but thanks for the suggestion.","commenter_a":"Honestly, I don't know anyone who wears Ivanka trump's clothing. This is the risk you run when you become part of the political process.","post_message":"A recent survey found that 57% of women refuse to buy Ivanka Trump branded merchandise following her father's controversial campaign."},{"comment_id":"10154002938919749","commenter_b":"Cindy Rhodes go do one stupid cow feminists are scum","commenter_a":"If your still hung up on feminism within the uk and the us then you need to develop your personality. Not your discrimination skills.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10155027837294411","commenter_b":"I am trying to learn you that you can't blame a whole religion on the wrongdoing of one person.. It's like blaming denmark for a crime a danish man did in Spain... And you are still rude and can't spell.. Please go back to school and learn english and grammar... And maby move to an island with all your other nazi racist friends...","commenter_a":"What??? In most of europe these markets has nothing to do with christianity, but with shopping... Stop trying to divide people based on religion... We all know how you hate muslims now... And maby you should think that the western world, and Russia is bombing and killing the shit out of the middle east... Could be a reason for the hate you know...","post_message":"'A Christmas market which is a Christian symbol is a classic target for Islamic jihadists' (Op-Edge)"},{"comment_id":"10153656346543352","commenter_b":"I could careless about all that bullshit it's a proven fact your ugly ass hell & I damn sure look better than you on my bad day, you look old & wash up do your hair & get some better make up stop acting like your a model , you don't have ninjas checking for you mines face looks. Better than yours hoe","commenter_a":"Remove this dumb bitches ovaries make sure she doesn't get the chance to even enjoy a child if she ever wanted one after you take her shit out throw her away in jail","post_message":"Woman Hit With Murder Charges For Aborting Her Own 5-Month-Old Fetus In Her Car With Illegal Abortion Pill, Causing Baby To Die 30 Minutes After Abortion"},{"comment_id":"10154780872790695","commenter_b":"One tactically trained security Guard at the massacre in Orlando changed nothing.","commenter_a":"RIP young angel If the school faculty were allowed to be tactical trained and had permission to use a gun in this kind of cases our kids would be safer idiots would fear and no one will have to shed a tear","post_message":"JUST IN: The coroner has confirmed 6-year-old Jacob Hall died this afternoon.  Hall was one of three people shot during an elementary school shooting in South Carolina earlier this week."},{"comment_id":"10154366000234166","commenter_b":"Idiots. Careless. I will be glad to raise the baby.","commenter_a":"Betsy Carver ..unreal","post_message":"Police said neighbors found the toddler outside in 96-degree weather with no water. He was screaming, crying, and trying to get inside."}]
