[{"comment_id":"10153150214411320","commenter_b":"so judging by the comments...women think that it is too much, and men not far enough. :D","commenter_a":"Nothing left for the imagination","post_message":"The cover of the Sports Illustrated Swimsuit Issue features Hannah Davis. She is wearing one of the most revealing bikinis yet for the annual issue. Do you think the magazine has gone too far? Read also: Plus sized model to appear in swimsuit issue: @webpagelink"},{"comment_id":"10153853522001336","commenter_b":"Your Governor says yes to more refugees.","commenter_a":"I just found out that approximately 130 Syria refugees are here in PA .","post_message":"“What I want is a watch list. I want surveillance programs. Obviously there are a lot of problems. I want a database for the Syrian refugees that Obama’s gonna let in.” Donald J. Trump went “On the Record’ to clarify his recent comments, emphasizing that he wants to keep track of the Syrian refugees entering the United States, not all U.S. Muslims. @webpagelink"},{"comment_id":"10153184116079330","commenter_b":"She is just the white female version of what we already have. Time for a woman, yes, but not time one!","commenter_a":"Way to go Hillary - We need a lady in the white house and get rid of the Joker that is there now.","post_message":"Sources tell NBC News that former Secretary of State Hillary Clinton will announce her candidacy for president of the United States \"as early as Sunday.\" ---> nbcnews.to/1FHI9C6"},{"comment_id":"10154889440018701","commenter_b":"@username I totally agree with you ! So many people are making lame excuses for these kids! They were old enough to be out by themselves with no supervision,THEY MADE THE DECISION to do what they did,which KILLED PEOPLE and DESTROYED HOMES !! I hope the deaths and destruction is imbedded in their minds FOREVER !!! Bad choice of a way to spend your day ya little F***ERS !!!","commenter_a":"As a child a friend and I were playing with fire in a field. We accidentally set a huge bush on fire that could have easily spread out of control had we not had a drink with us. By the grace of god it didn't spread to all the near by homes. We were not trying to burn people's homes down. I think people need to realize that kids don't always think of what could happen. They are children! They will have this on them for the rest of their lives.","post_message":"Two minors have been arrested and accused of starting wildfires that killed 14 people in eastern Tennessee."},{"comment_id":"10158012155960354","commenter_b":"Prosecute her! Drain the swamp!","commenter_a":"lock donna brazil up.........","post_message":"“Stealing valuable proprietary confidential information is illegal, and debate questions are highly confidential,” said Ken Sukhia, who served as United States Attorney for North Florida and who has prosecuted numerous white collar crimes."},{"comment_id":"10154501246119255","commenter_b":"NUTS","commenter_a":"moron","post_message":"What a stooge. By Daily Kos user teacherken"},{"comment_id":"10153956285791880","commenter_b":"@username I'm white. I'm not mad bro. But was that kid in Ferguson mo a thug and literally just robbed. Convenience store? Sure back lives matter.. I'm indifferent tho.. Any race, sex or creed comes at me Wrong I'll end you. Period.","commenter_a":"All the white ppl mad!! Lmao, after the 400+yrs of oppression that they weren't victims of, they want to be included in a black lives matter movement... Smh, never been discriminated against, but black lives matter is a racist cult?? Can't c the forest from the trees...","post_message":"The Facebook CEO issued a companywide memo chastising employees who have been crossing out the phrase “black lives matter” and writing “all lives matter.”"}]
