[{"comment_id":"1396465177113199","commenter_b":"Stfu Hilary won POPULAR vote.","commenter_a":"Cry baby losers. You can't say he's not your president and it be true. If you live in the USA he is your president. Keep throwing tantrums and rioting, destroying property, setting cars on fire. You are just going to make more people vote for him next time.","post_message":"Fear not!  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"436426606545633","commenter_b":"Women are too smart for an old fish tale lol","commenter_a":"Good job, Mrs. Wifey","post_message":"This is great..."},{"comment_id":"1022858884507686","commenter_b":"Just go away! Crawl into the hole of failed soorts stars, and never come out again, unless you grow up and apologize to America!","commenter_a":"Way to preach Professor Kap! Fool!","post_message":"Colin Kaepernick praised the dictator's commitment to education and criminal justice reform.  \"We do break up families here. That’s what mass incarceration is. That was the foundation of slavery. So our country has been based on that as well as the genocide of Native Americans,\" he added."},{"comment_id":"1121385761232992","commenter_b":"WHY MEN WALK AWAY FROM SOOOO MANY WOMEN .","commenter_a":"So guess they'll be getting rid of the \"women in literature\" as well...?","post_message":"You can't make this stuff up anymore, folks.  Radical feminists just got their way on campus and you can now say good-bye to THIS essential college class. [Read below]"},{"comment_id":"10153562430331350","commenter_b":"Shut up you stupid woman","commenter_a":"Why do white think they can break rules ? Anyone hunts is a savage, and they are going to suffer, that's the way they think you can treat black people also, you and your seeds will suffer, and it's long overdue, there is no way God gave me this same book to worship as the white man. Break the curse and burn the bible.","post_message":"Legal analyst Lisa Bloom explains what could be next for the dentist."},{"comment_id":"10152787006691545","commenter_b":"What time?","commenter_a":"I can't believe they just showed up out of the blue. There should have some fore-warning. *drum snare*","post_message":"About 30 members and supporters of Bloodstained Men, a nonprofit group based in California, held signs that read, \"Foreskin is not a birth defect.\""},{"comment_id":"485248075011731","commenter_b":"thats one ugly he bitch","commenter_a":"To damn bad","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"}]
