[{"comment_id":"933938620044552","commenter_b":"Big money and those they have bought don't want us to know what is happening!!!!","commenter_a":"My understanding of this pipeline is that it is not considered a national pipeline, bypassing congress and the Whitehouse and following state guidelines in each state it passes through. Could this be right?","post_message":"Why theres a media blackout on the native american oil pipeline blockade"},{"comment_id":"10155824563490725","commenter_b":"White girl","commenter_a":"I am praying \"IN JESUS NAME\" that Donald Trump becomes our President, WE should all pray \"IN JESUS NAME\" that Donald Trump becomes our President so we can get our America back to the way God wants it to be. I know with Donald Trump as our President he will \"Make America Great Again\", Amen!","post_message":"The U.S. will invite El Chapo, the Mexican drug lord who just escaped prison, to become a U.S. citizen because our \"leaders\" can't say no!"},{"comment_id":"1238572816162746","commenter_b":"...aaaaaand to jail this woman will go.","commenter_a":"A real action star. Give him an oscar award!","post_message":"Watch the moment a suspect hit an officer's car with her SUV during a high speed chase. The officer escaped with only minor injuries.  Full story: @webpagelink"},{"comment_id":"10156300562155093","commenter_b":"He called illegal Mexican immigrants \"rapists and criminals.\"","commenter_a":"Hispanics for Trump!","post_message":"What a Donald J. Trump presidency would actually look like, courtesy of Saturday Night Live."},{"comment_id":"10154097450244641","commenter_b":"She legally can't give consent if she was drunk so it would still be considered rape......","commenter_a":"\"The alleged perpetrator initially told police that the sex act was consensual, but the girl told them that she had no memory of it\". She is suing although she doesn't know if she consented. I wouldn't be surprised if she had consented when she was drunk. This isn't your average \"She was raped. Case closed\" case. She shouldn't drink like an animal and have sex like one and then sue someone...If you can't handle yourself when you drink, you shouldn't drink! At 16 it is illegal to drink alcohol, so she should be charged as well for her own offense.","post_message":"The court dismissed the charge because unconsciousness and intoxication are not mentioned in the state's forcible sodomy law."},{"comment_id":"1620928861543005","commenter_b":"No one should hit ANYONE. Its assault. Penis or vagina.","commenter_a":"Im confused....she put her hands on him first. This shouldn't even be a thing.","post_message":"This football star was filmed punching a woman in the face. He's still allowed to play."},{"comment_id":"1281596298596888","commenter_b":"I physically couldn't go eaither. But we can still stand in solidarity on social media. #IBiteGrabbers #MyVaginaMyRules #NastyWomenUnite","commenter_a":"Not starting a fight here, you right I'm old the same age as Madonna but just never followed her. I wish I had gone. What a great way for women to express themselves. Sorry no harm intended","post_message":"LIVE VIDEO: More than 500K are downtown at a rally for the Women's March on Washington MORE: @webpagelink"}]
