[{"comment_id":"10153474188676350","commenter_b":"But they can't make babies it takes a man and a woman to have s baby","commenter_a":"So wrong","post_message":"#BREAKING: Supreme Court makes same-sex marriage legal nationwide in landmark decision."},{"comment_id":"743858605712748","commenter_b":"I know another PENNY ,and she is worth much more that as a friend !","commenter_a":"Good grief!! And people say pennies are worthless.","post_message":"Are they nuts?"},{"comment_id":"1717651245149172","commenter_b":"You're 100 % missing the point","commenter_a":"I love Bernie but these supporters are idiots. Throwing real money? How about using that money to feed the homeless and poor? Im sure Bernie would be just fine with that. I hate radicals. They do what they do for the spotlight and not for what's right.","post_message":"Well, this is certainly one way to get your point across…"},{"comment_id":"590256634486210","commenter_b":"Haha america was never great and with you or Hilary as our president it will continue to never be great !","commenter_a":" Vote strong Vote Trump","post_message":"This is only the beginning. Hillary is CROOKED! She is not capable of making America great again. Sadly, she would do the opposite."},{"comment_id":"933893426670406","commenter_b":"I'm sure Myra Hindley was a serial killer @username, that's only one name, I could name a few. Woman r quite capable of becoming serial killers. The statement is true, most serial killers start with killing and torturing animals","commenter_a":"thats how serial killers start!","post_message":"'My first bow kill lol'"},{"comment_id":"10156327027695389","commenter_b":"Cuff the lying witch already.","commenter_a":"Sounds like a recommendation for an Indictment may be in the new future. If the DOJ rejects it.....Will their be alot of resignations from the FBI??","post_message":""},{"comment_id":"10154344957028753","commenter_b":"@username so you are ok with building a wall by cutting programs like help Americas like are vets and retired or elderly and poor, like a childrens education, too what build a wall that will no nothing in the end 10 years from now when or if is done, I will not give my money for a wall I rather help Americas, the environment, help kids have a good education, and yes help those illegals trying too become citizen that cant afford too pay 5000 dollars too take a class to become a legal citizen,a wall will do nothing ,ask any Germany how the berlin wall worked for them, most European, middleeast and faeest ppl come tho Canada, Toronto airport is a major gate way too northamerica, why not a wall there, this as nothing too do with topps illegals it has too do with dons ego, he has too ...","commenter_a":"I'm okay with that. I would rather pay for a method to keep illegals out as much as possible, than to pay for their food, housing, health insurance, etc. and also feel the wrath of the homelessness because they invade my husbands profession.","post_message":""}]
