[{"comment_id":"10156504426675725","commenter_b":"Melania will be a wonderful First Lady and she'll bring class back to the White House!","commenter_a":"she'll be a 1000 time better than Michelle Antoinette Obama !!!","post_message":"My beautiful wife, Melania, shot in Trump Tower--- a great First Lady!"},{"comment_id":"10152884101260950","commenter_b":"Day. I love all animals.....and the nice part is.....nobody can stop me.","commenter_a":"Burn her ass. Grrrrrr. My compassion for animals is soooo much stronger than it is for humans.....karmas a bitch","post_message":"The woman allegedly set a terrier mix named Brownie on fire; the dog's burns were so bad, he had to be euthanized."},{"comment_id":"1376753242362908","commenter_b":"o.k you're can't be racist . how about a whiney , hateful bitch ? yeah ,that suits you better .","commenter_a":"Outrageous!","post_message":"These people are insane."},{"comment_id":"10152744364061051","commenter_b":"And she can spend all the money she wants...mother nature will eat you from the inside our eventually","commenter_a":"Wonder how many hungry people that money could feed? But why try to end world hunger when you can go to the gym.","post_message":"This couple spends $80,000 per year on their looks, and they say that's why they're the best looking people in America."},{"comment_id":"10152821814048717","commenter_b":"Lmao truth hurts!","commenter_a":"good job Rivas. leave the cheaters behind","post_message":"After helping the New England Patriots win the Super Bowl, Darrelle Revis has decided to go back to New York. The cornerback agreed to terms with the Jets Tuesday, his agent said. @webpagelink"},{"comment_id":"941291755930573","commenter_b":"Women are just as bad..","commenter_a":"Men are pigs","post_message":"She reported them to police because she said it made her walk to work an 'awful experience'"},{"comment_id":"10152698000912452","commenter_b":"I would still as long as she doesnt talk.","commenter_a":"Jessica acting like she ain't asking for attention lol girl you would be doing the same crap. Earn the beads Jessica","post_message":"UPDATE: The girl in the photo had been identified. She is 17 years old and does not attend college. Although she says her interaction with the group was consensual, she did not realize her photo was being taken. @webpagelink  Do you know her? Police in Florida are concerned this spring breaker, spotted in naked photos, may be in danger."}]
