[{"comment_id":"10154131960333797","commenter_b":"It's a free country. She is free to leave!","commenter_a":"Bye bye!","post_message":"\"WHAT HAVE I DONE?\" British-born actress Emily Blunt became a naturalized U.S. citizen in August, but now she says it was a \"terrible mistake.\" What do you think? Here's what made her come to that decision:"},{"comment_id":"1042887679092881","commenter_b":"Democraps Are The Cronies....","commenter_a":"What bunch of pussys, liberal Socialist progressive cry babies","post_message":"Democrats are staging a sit-in for gun control measures on the House floor, led by Congressman John Lewis. Congressman Beto O'Rourke is streaming the sit-in from the floor @webpagelink"},{"comment_id":"10152931610594270","commenter_b":"He has to be doing this just to make me look like a saint.","commenter_a":"West Point grad and comissioned Officer - apology not good enough. Gotta go. If he could ly about something as serious as Valor what else can he lie about?","post_message":""},{"comment_id":"10153245617818908","commenter_b":"So, let me get this straight, a man with his foreskin is unhygienic, but a woman with her parts all tucked away inside is hygienic? How does that logic make any sense? It's called basic hygiene practices. FYI, as men age (much older) their penis could fold inside of him and it will need pulled out to keep clean. This could be the issue your Family member was talking about. It's no different than when you wash your own genitals.","commenter_a":"I have 3 boys and all are circumcised. As a person that has family in the medical field it's for cleanliness when they get older. My mother worked in a nursing home and she has horror stories from having to bath uncircumcised men. It's gross not to be. Infection and bacterial growth is more common if the foreskin is still intact","post_message":"Why do Americans go out of their way to remove this part of human anatomy, when the rest of the world does not?"},{"comment_id":"969122396467721","commenter_b":"i wasnt created to have babies..a lot of women arent..","commenter_a":"God created us to have babies, not kill them he doesnt like it","post_message":"And abortion is NOT healthcare!"},{"comment_id":"10152926851271336","commenter_b":"My God leave the Good Doctor alone. Don't see you going after those that treat patients in their mammogram buses and doing blood and plasma draws that happen to be far more dangerous. Give the guy a break. He is licensed to practice in that state, the entire state. Can you blame the Dr. after what Obamacare has done to folks. Jesus Lord...go after POTUS for putting people in this position in the first place, without healthcare, sucking what was left of Medicare that the elderly needed and driving up healthcare coverage so govt gets a buck.","commenter_a":"Need more like him and fewer like Obama.","post_message":"Mississippi health officials are threatening to revoke the medical license of an 88-year-old doctor because he treats patients out of his Toyota Camry. Dr. Carrol Landrum says his patients are too poor to travel to him, so he goes them."},{"comment_id":"1110364735689669","commenter_b":"I'm confident the courts will rule it unconstitutional. They better!","commenter_a":"I suggest that all intelligent, human Oklahomans leave and then we build a wall around this putrid state and let them fester in their backward, flat earth, anti evolution, bible thumping mess.","post_message":"The Republican War on Women continues as a bill making abortion a felony was passed without discussion or debate."}]
