[{"comment_id":"891775107623863","commenter_b":"Michelle isn't a woman for women. Let someone rape one of her babies and watch out!! And of course Bill Clinton may try! I've worked with sex offender's like Bill all my life and they DONT change. They like white, black, Asian, and ALL the girlees. Even baby girls. Bill is a threat to our children. Hillary doesn't stand for the security of our babies... she hands them over to Bill to be F...!!","commenter_a":"two faced .... you heard what what she said when Obama ran for office","post_message":"Michelle Obama did not get emotional for Juanita Broaddrick. Michelle Obama did not get emotional for Kathleen Willey. Michelle Obama did not get emotional for Paula Jones. Michelle Obama did not get emotional for Connie Hamzy. Michelle Obama did not get emotional for Eileen Wellstone. Michelle Obama did not get emotional for Sandra Allen James. Michelle Obama did not get emotional for Christy Zercher. When will Michelle Obama get emotional about all of Clinton's alleged sexual assault and rape victims?"},{"comment_id":"924642210962167","commenter_b":"What a dumbass!","commenter_a":"No political enemy of this country could have done more to destroy it then the Republican party has done over the past 30+ years. They have nothing to offer our citizens but hatred & fraud. Neither Russia nor China could have planned it better. These evil people have taken a strong, compassionate country & turned into the laughing stock of the rest of the free world. All they really want is to have us pay for & die for their desire to make war all the time. It's time we figured out that these \"straight\" (maybe) white men are truly impotent & can only declare their\"manliness\" by making war on everyone rlse, including you & I. If there is such a thing as the \"anti-Christ\", it has come in the form of the Teapublicans, not just one person. They are sickening & digusting.","post_message":"Too true. Image by Occupy Democrats, LIKE our page for more."},{"comment_id":"10153855606886336","commenter_b":"How come you mother fu*kers can't just go to school and stfu?","commenter_a":"Yes","post_message":"Are students demanding too much power?"},{"comment_id":"10154844264313132","commenter_b":"Sorry katie but i think you are confused between who hillary is and who trump is cuz clearly he was the one interupting her on soo many questions and tring to intimidate her just like he does every other woman but thank goodness she is a strong woman and did not let him get to her lol","commenter_a":"Wow this just goes to prove that hillary is the better candidate hands down. She definately killed trump and i think he got angry and became soo defensive lol she was very prepared and he was not","post_message":"Donald J. Trump says he will release his tax returns when Hillary Clinton releases her deleted emails. @webpagelink"},{"comment_id":"10153723467413984","commenter_b":"Wow what a woman","commenter_a":"You FOOLS! Let this American citizen out of jail and start concentrating on REAL illegals in this country! You have totally lost track of reality! In my 65 years on this planet I have never seen the U.S. Government be so dysfunctional as it is right now!","post_message":"Amazing. Kim’s 21-year-old son has just stood up for his mother in a HUGE way after she was ordered to jail, and it speaks volumes. Do you support Nathan Davis?"},{"comment_id":"350626235140891","commenter_b":"She needs to be gone","commenter_a":"Then take Kenyatta West and get the hell out of the USA I think Iran would be a good place for you .","post_message":"Hip-Hop Artist Hates America, White Americans and Conservative People!"},{"comment_id":"10153434470306323","commenter_b":"Vahan alko tanssijalkaa vipattaa :D","commenter_a":"Nora ootkos tanssinut taas?","post_message":"Five passengers were injured after a train derailed at Mumbai's Churchgate station on Sunday. CCTV shows the local passenger train crashing into the barriers and partly mounting the platform. Officials have blamed human error for the incident."}]
