[{"comment_id":"1717305195178742","commenter_b":"@username Did you smoke crack before your post? Americans can be Asians. Using your logic, Latinos and Latinas can't be Americans either. And all blacks would be African. Also, those nations are far from being heterogeneous like ours.","commenter_a":"Yes Asian men are not portrayed in a very nice light especially in american media. however, I find many Asian men to be attractive. love the facial structures and there is nothing like a guy with a sword.","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"10153029424263445","commenter_b":"You're a stupid ass welfare bitch. I can tell by your reaction","commenter_a":"Fuck you. You can't dictate what people do with their money. Plus, how do you know they don't have a kid with an awful disorder that benefit from pot? Your ignorance is showing. Check your privilege.","post_message":"ICYMI - Colorado Bans Use of EBT Cards at #Pot Shops"},{"comment_id":"10153918675239170","commenter_b":"Incompetent? Really? Jobless rate record low. Economy back on track. Bin Laden dead. Equal rights for everyone. Health care for everyone. I think you need to reevaluate. Perhaps it is the people who you are getting your facts from who are the incompetent ones. And since they're evidently your only source, I'd say you might want to step up your game.","commenter_a":"He's such an incompetent douchbag. 12 more months, thank God!","post_message":"Probably as close as Obama will ever come to actually admitting it."},{"comment_id":"1089311434439529","commenter_b":"This surprised me.....even a blind squirrel finds a nut.","commenter_a":"The view sucks all those asswipes on that show should move to Brussels if trump gets elected..","post_message":"\"I can't believe I’m feeling this way...\""},{"comment_id":"10154369972274749","commenter_b":"He is just like the guy that went on s rampage at the abortion clinic but this time he us a Muslim which changes the entire situation.","commenter_a":"Come on give the man a break,he was only a good muslim following the teachings in holy quran giving the wife the odd back of the hand and killing gay's is all well and good with islam ! It's us that have to adjust to the way they want us to live","post_message":"Mateen's ex-wife said she had been beaten by him during outbursts of temper in which he would \"express hatred towards everything.\""},{"comment_id":"1312709298805295","commenter_b":"GOD BLESS THE REAL WOMEN IN THIS COUNTRY! No vigina hats here","commenter_a":"I'm proud of them!","post_message":"HERE ARE SOME WOMEN WHO MARCH FOR OUR RIGHTS"},{"comment_id":"10153927537756350","commenter_b":"Glad she isn't winning the contest. Shallow personality and spoiled.","commenter_a":"He didn't need to interview her and ask for an apology, when he already did the same night the mistake happened. She's a spoiled brat looking for attention, and of course Steve Harvey is the way. What it bothers me more, is the fact that he and his family has been threatened, and the media still paying attention to her, she's greddy! #getoverit #sorelosers","post_message":"See Steve Harvey come face-to-face with Miss Colombia Ariadna Gutierrez, the contestant he accidentally crowned Miss Universe."}]
