[{"comment_id":"10153070035530399","commenter_b":"I thought I saw this woman at Hooters the other night. That's always been a good source of Broadcast talent for Faux.","commenter_a":"Just a new way for the Dummycrats to steal more votes!!!!!!!!!!!!!!!!!","post_message":"It's always Andrea Tantaros."},{"comment_id":"1231022086976838","commenter_b":"Look at the size of that wood. Those are strong birds. Yet so very gentle with their chick.","commenter_a":"Menifee California","post_message":"BREAKFAST TIME! Looks like Momma Eagle is feeding her new hatchling. More info: @webpagelink Where are you watching from this morning?"},{"comment_id":"1718806018406509","commenter_b":"Illegals!!! Bahaha","commenter_a":"Chicago doesn't want trump, we aren't gonna deal with his jokes","post_message":"Protests continue after Donald Trump's UIC rally is canceled for security concerns: @webpagelink"},{"comment_id":"10153162026679091","commenter_b":"Stephanie, he wants ILLEGAL immigrants gone. And Americans have been doing just fine before the influx of Mecican Illegals before and will after!","commenter_a":"He'll be crying when there is nothing for him to eat because its the immigrants that work the field for our food, and run our plants that provide our meat. He wants immigrants gone, he should be the first to leave. Give this land back to native American people, the earth was pure and clean. Be a leader Trump, lead yourself out","post_message":"Donald Trump has released his specific plan for immigration reform: @webpagelink"},{"comment_id":"10153263764260329","commenter_b":"But what does she think of fat bastard?","commenter_a":"Who is this bitch?? Oh yeah that's right... #Irrelevant","post_message":"Azealia Banks said a whole bunch of interesting stuff, but let's not ignore that startled cat 0_0"},{"comment_id":"10153362253533132","commenter_b":"Please dont let her walk free like Casey Anthony is walking free. If she wants to kill herself let her. She is not a mother. A mother doesnt kill her children AND take pictures of it!!","commenter_a":"Leah Stevens","post_message":"In the arrest report, detectives reported finding an open journal with an entry addressed \"To My Family.\" According to authorities, Jessica McCarty apologized for what she was about to do."},{"comment_id":"10154080413671162","commenter_b":"You must be a star chaser or useless female cop.","commenter_a":"What a bunch of ignorant aholes....do me a favor and NEVER CALL THE COPS to help your pathetic selves...none of you are worth it....all loser thug scum bags","post_message":"Police say they were trying to pull a car over when it smashed into their patrol SUV in the Loop."}]
