[{"comment_id":"1756054801276415","commenter_b":"Though what border did the Muslims come ?","commenter_a":"Don't mess with Texas!","post_message":"BREAKING: Texas Lt. Governor Announces That Texas Has Finally Shut Down The Border. It's about time. With or without a wall, we will protect our country. Do you think we need to close our borders to Mexico?"},{"comment_id":"760226330784714","commenter_b":"The woman is an MD, right? She is by definition smart. So what happened?","commenter_a":"Welcome to the female version of Ben Carson... So. Damned. Stupid.","post_message":"It’s official now: Jill Stein—and the Green party if it agrees with her—is/are a waste of space. By Daily Kos user BoGardiner"},{"comment_id":"1009873989035649","commenter_b":"Is this bitch right about anything she should go back into hiding","commenter_a":"FAIL!!!","post_message":"Joy Behar calls out Carly Fiorina. Is she right?"},{"comment_id":"10155363897415231","commenter_b":"She's gorgeous!!! You go girl!!!","commenter_a":"Wow!! Gorgeous baby!!!","post_message":"She was bullied because of the color of her skin, but she fought her way through the tough times to now become the recipient of a $10,000 scholarship. @webpagelink"},{"comment_id":"10153197324656491","commenter_b":"@username if you don't have weapons, then vermin thugs might get your food and water.","commenter_a":"I wonder if this is how walking dead started","post_message":"The researchers plan to “revive” the virus in a safe laboratory setting."},{"comment_id":"1049399221792530","commenter_b":"A Hillary supporter should be asking themselves why they want a killer in office.","commenter_a":"A Trump supporter should be asking themselves why Putin would be interested in Trump winning the generals. Makes you wonder about where you stand.","post_message":"Donald Trump’s call for Russia to hack America makes this election an easy choice. ►Full Episode: @webpagelink"},{"comment_id":"1054929361214588","commenter_b":"She* is a woman.","commenter_a":"Sorry Siri, but according to his DNA, he's still Bruce! A rose by any other name.....","post_message":"Siri knows Caitlyn's name and she's going to correct anyone who forgets."}]
