[{"comment_id":"803355223130806","commenter_b":"we love newt, let the whole world know about her shady crap , we don't care about your tax release, she has the nerve to talk crap about that and look at her hiding server deleated emails, noooooo way. go TRUMP","commenter_a":"Good Luck with Today President Trump!!Go Gently, but be Strong!! Stand Your Ground but be Humble!! America needs You!!","post_message":"\"Speaker Newt Gingrich pointed out the pay disparity between male and female executives at the Clinton Foundation, where men earn 38 percent more on average, before telling viewers that Trump is more pro-woman than the former secretary of state. He also noted that this likely would come as a \"shock\" to many voters.\""},{"comment_id":"10154406866831037","commenter_b":"give me back the days of stong America when it was \"sticks and stones that brake your bones and (words) can never hurt me\" !!","commenter_a":"Weren't people just mad because people get \"artistically enhanced\" to be skinnier than normal? Perhaps they should pick a side an stick to it.","post_message":"Disney's new movie has already sent the internet into a rage."},{"comment_id":"10154945545241002","commenter_b":"Let them fight \" Darwin \" will take over !","commenter_a":"Terrible!","post_message":" loved everyone, said Robert Ybarra daughter. \"He was one of those neighborhood dads that people could count on.\""},{"comment_id":"10154119755618188","commenter_b":"now why on earth would you go and say something so hateful?","commenter_a":"Glenn is an idiot","post_message":"Crazy flash back photo from the early 90's.    Mike Opelka center and a long haired drinking Glenn."},{"comment_id":"10156577107260725","commenter_b":"Rand Paul is already crying he is your typical corrupt out of touch Washington politician. He wants to rid us of the US military. So that jerk will be at the debate.","commenter_a":"I can make a difference between Winning & Losing & i really want Donald Trump to Win. I have lots of valuable inputs to give. How do i get in touch with you. Warm Regards, @username...","post_message":""},{"comment_id":"942978109072863","commenter_b":"You're supposed to protect your children not potentially ruin them.","commenter_a":"Ever think of asking her why she steals? How about showing how her loved ones are affected by her stealing, a family intervention. How about telling her that you love her and if there's ever anything that she needs, she can ALWAYS come to her father!","post_message":"Too far or just punishment?"},{"comment_id":"10154803405263128","commenter_b":"@username - worked at Her campaign she is the most corrupt person with Her $150 million from countries w Sharia Law - Killary wants globalization. Google Bilderberg Group","commenter_a":"I've lived in Utah for almost 3 decades. The state's Mormon mouthpiece, The Deseret News, has already denounced Cinnamon Hitler as \"evil\" and a wannabe dictator. That should be a warning to all you Republican conservatives out there of the quality of your candidate.","post_message":"While most political prognosticators are closely tracking a familiar group of about 10 presidential battleground states, Utah is emerging as one of the most surprising wild cards in the 2016 race."}]
