[{"comment_id":"1153775948001804","commenter_b":"She's still a turd.","commenter_a":"Nancy, your a turd!","post_message":"“Lady Justice has on a blindfold because all victims and all defendants are to be treated equally under the law,\" says Nancy Grace."},{"comment_id":"216170728787107","commenter_b":"She is a dried up piece of human flesh!","commenter_a":"This is a crazy idiot sue her but her out of business","post_message":"The heck!"},{"comment_id":"10154210673661509","commenter_b":"Sean Small look up The Southern Poverty Law Center. Look at how many WHITE HATE GROUPS that exist. A lot of them have the word AMERICAN in their names. Some of them you probably don't even know they are considered HATE GROUPS. Only 2 black hate groups are listed and BLM is not one of them. The fact that you harp on on BLM just shows you are ignorant. Why don't you focus on the NUMEROUS WHITE HATE GROUPS??? Why don't you focus on getting rid of these people in white hate groups who continue to infect this country with a disease she doesn't seem to be able to cure \"RACISM\"?? Maybe if you and people like you concentrated on fixing your HATEFUL and RACIST THINKING then racism and discrimination wouldn't exist and the BLM would have no reason to be. I don't condone violence at ALL. Violence again police ...","commenter_a":"Strange that this makes news, but when the Black Supremacist from the BlackLivesMatter hate group sends out hits on cops... they are called freedom fighters and said to be striking out against oppression. They are either both evil or both good. You cannot have it both ways.","post_message":"Two Virginia men were arrested on accusations of being white supremacists plotting to bomb black churches and synagogues as part of a race and hate war, federal authorities said."},{"comment_id":"10153992040756336","commenter_b":"This is a must read. I copied it from a post. These are things you need to know about Islam and Muslims. Allah IS NOT the same God who is worshiped by Jews and Christians. Allah is no more a God than the Golden calf of Egypt. Allah predates Islam by over a thousand years, and was a minor deity in the Temple of Baal, the Canaanite Sun God, who was worshiped throughout the Middle East. Baal (ba'al) was an ancient Canaanite and Mesopotamian deity associated with agriculture. He was believed to be the \"giver of life\" and mankind was dependent upon him for providing what was necessary to sustain the farms, flocks and herds. Allah was the moon god who's sign was the crescent moon. Mohammad, born 570 years after the Birth of Christ, was very familiar with Judaism and Christianity and stole traditions from both religions to create ...","commenter_a":"Why does Christianity need protecting? It is the dominate religion and is afforded special privileges. Christians are just upset that they don't have the right anymore to force their beliefs on others.","post_message":"Donald J. Trump spoke about protecting Christianity during a speech at Liberty University today. @webpagelink"},{"comment_id":"1296209600419509","commenter_b":"She's a evil bitch, liar, corrupt and criminal, she's in the pockets of the big business and lobbying, a warmonger. Vote anyone else but her.","commenter_a":"No shit...the rein malicious and bone headed Republican governance is hurting Business!","post_message":""},{"comment_id":"1000336466699775","commenter_b":"Bitch Stfu quit preaching","commenter_a":"Kanye was her man at one point. I'm sure y'all have done stuff to please your significant other while in a relationship. GTFOH. Y'all clowning Amber for pleasing her man at the time?? Really???","post_message":"#ShotsFired Amber Rose Just Fired Back At Kanye West!"},{"comment_id":"10153705245475667","commenter_b":"Build that wall tall!!","commenter_a":"Libertarian is just another word for Republicanism!","post_message":"Libertarian presidential candidate Gary Johnson talks with Paul Singer."}]
