[{"comment_id":"10154970022528690","commenter_b":"The world and so call United Nation have no interest in alepo people just because they are muslim, if its christian region this is happening the UN will have take action, but we the muslims are just folding our arm doing nothing, the only thing is to back to Allah, by saying; HASBUNALLAHU WANI'IMAL WAKIL, WANI'IMAL MAULA WANI'IMAL WAKIL,","commenter_a":"there is tubelight, internet, electricity bla bla. it seemed she is speaking from hotel pan pacific Singapore. we didn't heard even a sound of bullet fired. weird.","post_message":"Residents of East Aleppo are giving their final messages to the world."},{"comment_id":"10153115054444091","commenter_b":"You are 100% right about Starbucks.","commenter_a":"I blame Dunkin' Donuts....if they had a drive thru, this wouldn't have happened. If he drove through a Starbucks, I would have bought him coffee!","post_message":"A 16-year-old who was practicing driving for his learner's permit with his mother, crashed into a Dunkin' Donuts in Glen Rock Sunday morning. MORE: @webpagelink"},{"comment_id":"10152602108687061","commenter_b":"And a fat hoe","commenter_a":"Michelle looks more like a hoe everyday","post_message":"Pres. Obama: 'I have no more campaigns to run.'  (audible clapping in chamber; pause)  Pres. Obama: 'I know, 'cause I won both of 'em.' #SOTU2015 -- (click for audio) abcn.ws/1JbdOLY"},{"comment_id":"971724402865796","commenter_b":"Why does having a child who is American entitle one to come to USA to live? Child should leave when parents leave due to illegal status or visa expiration. They can come back on their own when of age.","commenter_a":"this is not all that is in the 14th amendment. It is only a part. there are other antiquated clauses that really formed America after the Civil War. Section 2 guaranteed that southern people would not have a say in politics for at least 2 decades. We have a president now that should be impeached for treason per this amendment, bill Clinton should never had been allowed in politics per this amendment, America's judiciary ignores whatever they want. the entire amendment needs reviewed not just one sentence.","post_message":"This may surprise a lot of liberals and Republicans alike. Spread this everywhere!"},{"comment_id":"649755178530332","commenter_b":"Please start packing now! Believe me no one will even miss you and your dirty mouth.","commenter_a":"V","post_message":"I guess it's time to say goodbye, and good riddance. 'LIKE' if you support Whoopi leaving the country!"},{"comment_id":"936129599822500","commenter_b":"Why did they come here? Get out, do back from whence you came.","commenter_a":"Get the hell out of our Country!!","post_message":"RT If these people want Sharia Law they should go back to their own country."},{"comment_id":"1237347102949965","commenter_b":"You and me, (and millions of others, I'm sure), both!","commenter_a":"It isn't because she's a woman. I would stand in line for 5 hours to vote for Elizabeth Warren. Hillary? *shrug* It better be a short line.","post_message":"Here’s a strong but fair piece from the heart on the media establishment in DC by CNN’s Jeff Greenfield, whose long experience in politics and journalism began with Robert F. Kennedy back in the 60s."}]
