[{"comment_id":"10152925468786680","commenter_b":"Love is no ones business but the two who found it's bliss.","commenter_a":"Well, you could always just ignore it. Our government seems to be doing that alot lately. Like DC ignoring the Heller case.","post_message":"“It seems like the oppressor is now taking on the mentality of the oppressed.”"},{"comment_id":"10153060645251350","commenter_b":"And you'd win a beauty contest for sure ...","commenter_a":"She's so ugly. She has a mouth the size of a horses mouth","post_message":"What do you think: Is this a subtle pregnancy announcement or just a cute silly photo from Beyonce?"},{"comment_id":"10154382417947293","commenter_b":"Meanwhile Russia is laughing so hard all the way to the bank. Hope everyone who helped put this unstable Trump into this position will enjoy learning their new language of Russian cause now Russia owns us.","commenter_a":"Infighting violence much Washington post?????","post_message":"2016 might really be our own 1914."},{"comment_id":"10153648598172894","commenter_b":"Where's your daughter? Dummy","commenter_a":"Shes already A Mother. Didn't she give her first daughter Away?? 🙈🐸🐸🐸☕☕☕☕","post_message":"Confirmed: Janet Jackson IS Pregnant, Expecting First Child with Husband Wissam Al Mana"},{"comment_id":"10153671007817452","commenter_b":"@username if ur really going to have a discussion please don't start with \"then how is it that...\" When you focus on the trees rather than the forest, ur def lost. If you haven't done research on average income, crimes by income, distribution of resources to low income, then this is above your level of comprehension. Start with census and BJS","commenter_a":"“If Black Lives Matter was truly concerned about black lives, they’d be concerned about black crime.”","post_message":"From Atlanta to Phoenix, to right here in L.A., protests are growing across the nation after this week's deadly officer-involved shootings. But not everyone is happy that protesters have hit the streets less than 24 hours after the Dallas bloodbath that left 5 police officers dead and 7 others wounded. Tonight the tense scenes from coast to coast - at 11 from ABC7 Eyewitness News. @webpagelink"},{"comment_id":"534617120056639","commenter_b":"Mike Bassenti This is what they get for coming here !! We have to pay for this ! @webpagelink","commenter_a":"Big news is Trump is earning MAJOR support from segments of the population which almost exclusively vote for Democrats. SurveyUSA announced that Donald Trump would receive 25% among black registered voters. That is news that has Hillary Clinton terrified, and is shaking the political establishment to the core!","post_message":"I had an incredible time in Detroit yesterday. A great experience - learned a lot by listening to everyone. I am grateful for their support - and time. You can catch what I had to say to everyone, right here. Thank you! -DJT"},{"comment_id":"10154715866881077","commenter_b":"A real woman would provide a chicken pot pie, just saying...","commenter_a":"Kiss my what? Real women can provide their own and don't need any man. After all, I have done just fine on my own with my 2 special needs children (because their father wasn't any sort of real man: his moto provide, but beat and refuse basic needs or the right for me to work) That being said real men and woman work together to get through life together. Men nor women are above one another. This billboard only assists in the purpose of one being better than the other and undermine equality, which we have been fighting so hard for.","post_message":"What do you think about this billboard?"}]
