[{"comment_id":"1731231320495188","commenter_b":"Fool","commenter_a":"Now ratify Obama's choice for Supreme Court judge.","post_message":"Backed into a corner, Senate Republicans have given up trying to repeal Obamacare."},{"comment_id":"1402181823177264","commenter_b":"He wants all Muslim refugees to stay there......","commenter_a":"GOOD FOR THEM , EVERY STATE IN THE UNION SHOULD DO THIS !!","post_message":"Victory for the Constitution!!"},{"comment_id":"10154595284389888","commenter_b":"Oh for crying out loud. He's pissed because he can't get his bad people in. OMG. People are so childish. Illegal vs legal.","commenter_a":"Why don't U take your Iranian A$$ back to your country and direct movies over their . U don't like it here LEAVE.Sorry POS. And stick that OSCAR where the sun don't shine","post_message":"\"My absence is out of respect for the people of my country and those of other six nations whom have been disrespected by the inhumane law that bans entry of immigrants to the U.S. Iranian director Asghar Farhadi won an Oscar tonight, but chose not to attend the ceremony in response to President Donald J. Trump's recent travel ban."},{"comment_id":"1754762228138614","commenter_b":"If you think things are bad now if Hillary get in a wall, illegal immigrants and whatever you want talk about are going to be the very least of your (our) problems. She will destroy anything and anyone plus she will cheat, lie and steal and never think twice about it! She not even be in the running! If she gets in everybody better run like hell!","commenter_a":"Actually, Clinton was talking ABOUT trump since trump HIRED illegal immigrants! Clinton didn't put anyone down when stating this. Every president/candidate has said this. It's how and what you say that make a difference. Trump wouldn't be called a racist etc. If he didn't put a whole country/religion down with name calling. There's a HUGE difference between what bill said and what trump says. Whoever can't see that needs help...","post_message":"Do you think this sounds a lot like Donald J. Trump? MORE: @webpagelink"},{"comment_id":"1376753242362908","commenter_b":"o.k you're can't be racist . how about a whiney , hateful bitch ? yeah ,that suits you better .","commenter_a":"Outrageous!","post_message":"These people are insane."},{"comment_id":"1134794909920596","commenter_b":"He bitch ya breathe smells like shit I can prove it.","commenter_a":"Well thats what the little shit gets for fucking with a monkey","post_message":"Angry baboon throws poop in little girl's face! #WSHH"},{"comment_id":"10153931678551523","commenter_b":"You can't fix stupid! This bitch is flat out ignorant","commenter_a":"She's the same sister that said to take all the violence to the suburbs, but yet she condemns it. Lmao Yeah, condemns it when it's in her part of town, but to hell with the rest of the city and surrounding areas.","post_message":"One-on-one with the sister of Sylville Smith. She spoke exclusively with FOX6's A.J. Bayatpour on Monday. @webpagelink"}]
