[{"comment_id":"10153799919868352","commenter_b":"She trying to get relevant","commenter_a":"Whaaaaaat","post_message":"‘Whitney will haunt you from the grave': Fight breaks out at Bobbi Kristina’s funeral after Bobby Brown’s screaming aunt has to be ‘escorted out by Tyler Perry’ for attack on Pat Houston mid-service"},{"comment_id":"10153267588169497","commenter_b":"@username's a big ole pussy","commenter_a":"Deserter.","post_message":"In Focus:   The Onion breaks down what you need to know about the former POW"},{"comment_id":"835498176546436","commenter_b":"Deb... Your name Is tasty.","commenter_a":"Was he speaking to an empty chair? I can't think of anybody else who would or should listen.","post_message":"The director has spoken."},{"comment_id":"958348850875022","commenter_b":"She is a frickin IDIOT","commenter_a":"Don't screw with my free speech !!! It won't go well for you !!!","post_message":"The Constitution’s 1st Amendment protections for free speech apply only to “institutions of faith” and not individual Americans, according to Sen. Tammy Baldwin (D-Wis.). Baldwin, the nation’s first openly lesbian member of the U.S. Senate, offered that bit of liberal logic during a recent discussion on MSNBC. Asked by the MSNBC host whether a bakery whose owners have religious objections to the ruling should be compelled by the government to bake gay wedding cakes, Baldwin insisted that religious free speech has no place outside churches, synagogues or mosques.  @webpagelink"},{"comment_id":"1147055582023224","commenter_b":"She is a thief put her in jail","commenter_a":"She is obviously enjoying her new found freedom . Notice there is no hajji .","post_message":"Muslim Welfare Queen Loses Benefits After Cops See THIS On Her Facebook Page..WOW!  Do you agree that Muslims come to America just to soak up free money?"},{"comment_id":"10153440207470950","commenter_b":"The stats show that you're more likely to shoot a family member than anyone else. Guns don't kill people, but people with guns can and do kill more people than those without. Who would have been at fault if the kids shot out the car window and killed someone? The kid, or her for failing to secure a murderous weapon? What if after after being almost killed by her son, she veered into on-coming traffic and kills another driver? Who is at fault then? Not only do I not understand the pro-gun and pro-kill people, I don't believe their justification for wanting to kill.","commenter_a":"Dumb ass","post_message":"The mom, a pro-gun activist who runs the page Jamie Gilt for Gun Sense, told deputies her 4-year-old son shot her in the back with a .45-caliber handgun that was on the floor of her pickup truck."},{"comment_id":"10153186882059641","commenter_b":"hmmm as long as it's not cooking drugs, printing fake marriage certificates, scamming, and turning young girls into prostitutes... #NOTOXENOPHOBIA AND ALL ILLEGAL ACTIVITIES","commenter_a":"I hope South Africans will not hear this, they will accuse the robot of taking their job and another xenophobia again.","post_message":"This robot chef will soon be able to cook 2,000 recipes. Pity it can’t eat them: @webpagelink"}]
