[{"comment_id":"1107986062575198","commenter_b":"Transgendered women do not want to look up your dress or steal your kids. They want to use the facilities.","commenter_a":"When will they wake up?","post_message":"The people that this ad is about aren't disgusting, but the ad is."},{"comment_id":"10154003044699199","commenter_b":"They dont wanna work !","commenter_a":"Picking apples and berries?","post_message":"There were 5.4 million job openings in the U.S. in April  the highest number of openings in 15 years.  It is a record high since the Bureau of Labor Statistics began tracking monthly job openings in December 2000."},{"comment_id":"10156284558895725","commenter_b":"I am a US Navy veteran having had taken my Philippine born wife through the immigration process. The immigration process can always be improved but, to give out amnesty to the illegals is like saying don't worry about the long waits in line; hundreds of dollars spent on forms; and the months it takes to swear in as a US citizen. If illegal immigrants want amnesty then pick a number; pay a penalty, and follow the process including all the fees. People who are following the rules are deeply wronged by illegals jumping the line by receiving amnesty.","commenter_a":"God Bless Donald Trump as he is our next real President.","post_message":"Press Conference LIVE"},{"comment_id":"10155994061055354","commenter_b":"I'd really like to know what these morons see in this group that would make them leave the US ,.and join a group who sodomizes little boys and rapes little girls, kills anyone who disagrees with them and thinks they are right. ?","commenter_a":"She had a hard time deciding join isis or black lives matter! It's pretty sad to see the kind of warped minds our society is producing another lost soul gone to waste!","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS.   Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"10156419798640354","commenter_b":"John Lansing Hillary is a right winger?? She is the queen of liars!1","commenter_a":"What a tool Brokaw is.. people actually saw it too.. WE KNOW who is spreading lies and it's not Donald J. Trump","post_message":"You saw what Tom Brokaw said on-air this morning, right?   If not, we've got the VIDEO for you here..."},{"comment_id":"946413835412782","commenter_b":"100% on welfare and too lazy to work. Their freebie food gives them energy to cause protests and riots all the time.","commenter_a":"I wonder if George Soros is funding any of these BLM people. He funded the protesters at Ferguson and Baltimore. Same faces running around protesting....","post_message":"Grassroots Activists Push Black Lives Matter Thugs Off Of Michigan Ave [Video]  This is what the main stream media DIDN'T show you..."},{"comment_id":"10153885880700667","commenter_b":"His wife is an idiot","commenter_a":"He is still body shaming this woman? Really Trump?","post_message":"\"I saved her job because they wanted to fire her for putting on so much weight.\""}]
