[{"comment_id":"10155741989330192","commenter_b":"There are many democrats who share many of conservertive ideas.like ideas about gays ,abortions,veterans rights,the militery.","commenter_a":"They are called libtards for a reason... Those that oppose legal hunting are just bad shots.","post_message":"A group of conservationists is urging Gov. Rick Scott to cancel the bear hunt that is set to take place this fall."},{"comment_id":"10153892633433812","commenter_b":"STFU","commenter_a":"Sex is meant for procreation. If you don't want kids the only sure way is to not have sex. Birth control, even when packaged correctly is not 100% I have had multiple friends become pregnant while properly using birth control. Stupidest reason to sue ever.","post_message":"More than 100 women are suing Qualitest Pharmaceuticals after they say they got pregnant while taking incorrectly packaged birth control pills."},{"comment_id":"1041909399153863","commenter_b":"Craig your brain isn't fully developed until you're in your 20's. Please just shut up.","commenter_a":"GOOD!...i hope she get life in prison...she killed a human being , not just a blob of cells....after 20 weeks the baby has feelings when touched...full lungs , full body parts , a full brain...it was murder plain and simple....why would ANY WOMAN wait sooo long to decide to kill her baby???","post_message":"The criminalization of pregnancy continues"},{"comment_id":"1145080512196207","commenter_b":"@username, no. The crime is to be caught crossing the border into this country. Once you're in the country, it is a CIVIL offense and people are due a hearing and disposition before a judge.","commenter_a":"It'll literally distract them from focusing on real crimes","post_message":"\"If the federal government takes a more aggressive role on deportation, then they’ll have to do that on their own.\""},{"comment_id":"10153898297209726","commenter_b":"I know someone that used to be a neighbor to one of Bill's party friends and Bill partied there all the time. They would bring in scores of prostitutes.","commenter_a":"Look this stuff is 20 years old. Bill chased women. A lot. Hes not the first and wont be the last man to do that lets move on","post_message":"WATCH: The central figure in the Lewinsky affair is speaking out about scores of Clinton affairs unknown to the public!"},{"comment_id":"10155084101790329","commenter_b":"LOL she's too real","commenter_a":"@username LMFAO BYE","post_message":"The best answer to the infamous question we've ever heard."},{"comment_id":"1194337773935013","commenter_b":"This bitch got the fucking nerve to talk about pollution killing people yet donated money to an army of murdering cowards to support them killing children. Fuck outta here","commenter_a":"Hillary can double that... in a weekend!!","post_message":"\"Pollution kills more people every year than wars, car accidents, and homicides combined.\" -- Arnold Schwarzenegger"}]
