[{"comment_id":"10153325338244342","commenter_b":"Stfu Lilia Jimrnez....you dumb woman","commenter_a":"So are we going to start killing police, getting revenge and causing a war in our country? Or are we actually going to try and solve these problems between police and the people they are supposed to be trusted to protect.","post_message":"Hundreds of people are expected to attend a prayer walk slated for Sunday night in northwest Harris County to remember Harris County Deputy Darren Goforth. #abc13"},{"comment_id":"1045180198948491","commenter_b":"Yeah @username all seemingly Noble reasons however... Trump is a sleazebag so regardless of whatever Noble reasons you may have... The end result is still the same. Let me explain to you about how Germany does things. They have what's called social democracy. Everybody gets Healthcare everybody gets an education not just the wealthy. Donnie's cabinet controls more wealth then 95% of the country and you honestly believe he is going to do what's best for America. You're a bigger fool than I could have imagined","commenter_a":"You people are more ridiculous than I ever imagine... What are you think she's going to do privatize public education... The woman barely has a clue as to how the education system works in the first place she has no real understanding of Education in general and yet she's going to revolutionize education in America... Sure she is... Another far-right right hair-brained scheme to put dollars in somebody's pocket","post_message":"Ignore the noise!"},{"comment_id":"940335786059476","commenter_b":"That's right fuck that dumb cunt!!!","commenter_a":"Michael Lance Kaniala-Ekahi Baldasare-Low Shelbie King @username","post_message":"How to silence Kim Davis supporters who cherry-pick the Bible to discriminate against LGBT Americans. In the comments, tag your friends who need to see this. Video by Occupy Democrats, please LIKE our page!"},{"comment_id":"1582505828713381","commenter_b":"@username That is right on the money but it goes even further than that. The phrase well regulated militia did not mean the same thing that people understand it to be now. At that time well regulated meant that every man was to be completely equipped on his own dime. Every citizen was expected to be armed and ready to defend their community. Consider that at that time there were still unfriendly hostiles that raided towns and farms. Each citizen was expected to be armed and would have been quite foolish not to be. These days as civilization seems to be degenerating we are also faced with the dangers of criminals and terrorists and yes even perhaps our own government. People have been conditioned to be drones who don't bother with thinking so they let the government do it for them. What they fail to realize is that the government ...","commenter_a":"People have rights, not militias. Militias depend on people having rights, people's rights do not depend on being in a militia. Let's parse this: The 2nd Amendment consists of two clauses. The first clause \"A well regulated Militia, being necessary to the security of a free State\" is a dependent clause, because it is not a complete sentence. It cannot stand on its own. The second clause \"the right of the people to keep and bear Arms, shall not be infringed\" forms a complete sentence, it is an independent clause. The first clause is dependent on the second clause. Or, in simple English, the existence of a militia (which is essential to the security of a free State), is DEPENDENT on people having un-infringed rights, not the other way around. No laws, licenses, permits or taxes that by design are designed to keep Americans from exercising their 2A right can ...","post_message":"California Lt. Gov. Gavin Newsom, who's pushing more gun control in The Golden State, recently appeared on Chelsea Handler's show. Not only did they slam the NRA (not surprising), Handler also said American gun owners are \"embarrassing.\""},{"comment_id":"10153659892877093","commenter_b":"Woman","commenter_a":"Bomb that guy","post_message":"HOUR-LONG STANDOFF: The woman refused to get out of her SUV & cooperate with police. She tried to drive away and was finally taken into custody... @webpagelink"},{"comment_id":"10153575814345950","commenter_b":"Fuck trump POS!","commenter_a":"Thry are all illegal wall jumpers. Come back to the US after u grow up","post_message":"\"No hate in our state,\" demonstrators chanted early in the day, with a few carrying Mexican flags in protest of Trump's anti-immigrant policies."},{"comment_id":"1183411145055216","commenter_b":"Wake up Hillary will destroy trump","commenter_a":"Trump is walking all over Hillary. Polls showing her ahead i do not believe.","post_message":"Dorothy Woods, whose husband Ty Woods was one of the four Americans killed in the 2012 Benghazi terror attack, says that Hillary Clinton's track record proves that the Democratic nominee believes rules don't apply to her. @webpagelink"}]
