[{"comment_id":"10154120407252908","commenter_b":"attaboy Davies pass the buck.","commenter_a":"I've been trying to figure out why someone would be a Republican and for the life of me I just can't find an answer.","post_message":""},{"comment_id":"895683467194573","commenter_b":"He's not crazy, his mother had him tested!","commenter_a":"I know he's an idiot","post_message":"President Paul?"},{"comment_id":"565035256989762","commenter_b":"What would the us do if mexicans where stealing land putting colonies into their land? Only rockets?!","commenter_a":"Military action would be used against a country which sends rockets, terrorists and death into any western democratic country. Why is it unacceptable when the only democracy in the Middle East does it to protect their own democratic citizens? If the vice news offices where destroyed by a Mexican rocket would their be a US reaction.","post_message":"The armed wing of Hamas has vowed to retaliate for the deaths of the two children."},{"comment_id":"10153269533886833","commenter_b":"Obama is more dangerous to this country than any ammo.","commenter_a":"Topend Towing","post_message":"Since announcing its proposed ban on commonplace 5.56x45 mm ammunition, the Obama administration has been careful to claim that this attack on gun rights is in the interest of law enforcement officer safety. However, law enforcement doesn't seem to agree. The Executive Director of the Fraternal Order of Police National Legislative Office, James Pasco, was quoted by the Washington Examiner as stating: \"Any ammunition is of concern to police in the wrong hands, but this specific round has historically not posed a law enforcement problem.\" FOP's website describes the organization as \"the world's largest organization of sworn law enforcement officers, with more than 325,000 members in more than 2,100 lodges.\" #M855"},{"comment_id":"10154684364106130","commenter_b":"Jerry's beautiful wife. Who looks like that","commenter_a":"Gayle Gergich, you rock Pawnee!","post_message":"Slay, Christie Brinkley!"},{"comment_id":"10153476529996756","commenter_b":"I think they assume they can just take take take, and someone will eventually design a self sustaining space station and then they'll buy it.","commenter_a":"I don't understand why the Masters of the Planet want to destroy the planet.","post_message":"A provision in the TPP allows corporations to sue governments for limiting their ability to compete in a market, which critics say could undercut food labeling policies that promote healthier food choices and make it more difficult to battle rising obesity rates."},{"comment_id":"1157767754287378","commenter_b":"This is the most ridiculous thing I have ever heard. NC, doesn't need this Administration deciding this issue for them! This administration is quick to bully states to legalize Gay marriage, overriding the will of the majority of people, bullying states to fall in line with their LGBT agenda. Counting the days til this administration crumbles.","commenter_a":"With all the crap that is going on and she chooses to fight this battle?","post_message":"“This is about the dignity and the respect that we accord our fellow citizens, and the laws that we as a people and as a country have enacted to protect them.” Attorney General Loretta Lynch formally announced that the The United States Department of Justice is filing a federal civil-rights lawsuit against the state of North Carolina, Gov. Pat McCrory, the North Carolina Dept. of Public Safety and the University of North Carolina over the state’s controversial “bathroom law.”"}]
