[{"comment_id":"479579702230323","commenter_b":"Yes","commenter_a":"Finally!!","post_message":"Do you think Hillary should be facing criminal charges right now? [Watch below]"},{"comment_id":"1210989268913328","commenter_b":"Impeach this !!!!!!! Donkey Dicks ! Vote Trump","commenter_a":"How can you Impeach Trump??? He's not even President!!! Impeach the one in there now!! What the heck is the matter with people now a days??!! No common sense, want everything free, think they are entitled, scream racism at everything, destroy property with no remorse, get mad and just shoot people, not responsible for anything they do wrong, always due to their past or otherwise, no morals................ect..........And now talk of impeaching someone who isn't even President!!! America stand up and be counted for what is real, true, moral and right!! All Whiners can leave!!! Of course just my opinion! I know all will not agree, but \"Freedom of Speech!! My country, my Right!!","post_message":"Donald Trump doesn't have the GOP nomination and he hasn't been elected yet. But that is not stopping the effort to have him impeached the moment he might be sworn in as president"},{"comment_id":"10154888478529714","commenter_b":"#FuckTrump #FuckPence #MelaniaFirstWhoreOfTheUnitedStates","commenter_a":"Boycott the show!! This is truly getting out of control. Did this occur when OBAMA became President? \"Of Course NOT\"!! The left are outspoken to the point of embarrassing themselves on a platform of defeat. Protesting, Chanting, Revolting won't change anything!! The American people have made a choice, that choice is for change. \"Get over it, get with it\" The Liberals power(s) were overturned, \"what a beautiful thing\" & they don't know how to deal with it!!","post_message":"\"Vice president-elect, I see you walking out but I hope you will hear us.\""},{"comment_id":"1307978642581533","commenter_b":"@username,you're lying, white folks were looting,breaking in stores,starting fires at the riots especially in Ferguson. As a matter of fact,the cops had pulled over a pick-up truck with 4 white guys in it with molotov cocktails. And this was Ferguson. In Atlanta, 10 white people were arrested for trying to block traffic,they were the first to do it. During the L.A. riots, white girl made the front page. She was running out of the store arms full of clothes. And you have never heard a black person say they burn and loot because of their culture. So you're lying again. Speak on the whites that loot and burn when their favorite team loses. Stop acting like whites are not out here doing the same. Oh boy, I should have known you was going to bring the President into the post,typical of your kind. Always finding a reason to blame him. ...","commenter_a":"Black on Black crime strikes again. No outrage as usual by BLM or anyone in the racist black groups of Cop haters. Where's the concern for this boy ? No concern since it was a \"Culture\" killing ? Heard that whites don't understand their \"Culture\" I understand you folks don't give two shitts when it's black on black crime.","post_message":"A 3-year-old boy on a shopping trip with his grandmother was shot and killed during an apparent road rage incident, police said. @webpagelink"},{"comment_id":"10153335574974384","commenter_b":"A complete waste of good female human flesh.","commenter_a":"Communist scum.","post_message":"Celebrating Women’s History Month by honoring women of \"Supreme\" achievements! Indeed, an inspiration to us all."},{"comment_id":"1741105056106659","commenter_b":"BWAHAHAH AND THAT'S WHAT MAKES AMERICA GREAT!","commenter_a":"Carla Stovall Jeanne' Cleopatra Thompson Anthony Stovall BLOOP!!!!","post_message":"TRUTH: Kaepernick's critics are failing to see the larger point. Roland Martin nailed it with this one.  Shared by Occupy Democrats, LIKE our page for more. Video from MSNBC."},{"comment_id":"10154514715036077","commenter_b":"You will be glad to know Trump is looking to hire people like you to build that wall. Jobs jobs jobs, and then he'll send you back and bum pay you. That's how he has gotten rich on the sweat of others people like you who believe his propaganda. According to him we are all here illegally. .and a bunch of low life criminals","commenter_a":"As American hispanics, we are tired of how all of these coward racist liberals that hate America like Obama, Clinton, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, we're supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of our skin... disgusting. That's why we elected President Donald J. Trump. Help us reach more people by following our great pro-America page \"@username\", the only true patriotic cartoon comic strip. And let's Make America Great Again! Thank you.","post_message":"It would take 37 electors nationwide currently pledged to Donald Trump to vote for someone else to derail the election results and trigger a vote in the U.S. House of Representatives"}]
