[{"comment_id":"10153572355174575","commenter_b":"Look people I'm not trying to insult anyone but we have the most advanced technology in the world and your telling me that there is no way the government can find out 9f she sent classified e-mails or not? Who the f#### are we kidding. The truth is she did not and they want to put that thought in people's minds. Those that believe it must be stupid (no insult intended). They just do not want her to be president. Hillary Clinton out of all the candidates is qualified to run this country. I don't care what anyone says.. every one has a right to an opinion and this is mine. HILLARY CLINTON 2016","commenter_a":"Clear she is nothing but a lying scum bag","post_message":"“I am confident that I never sent nor received any information that was classified at the time it was sent and received.”   Democratic presidential candidate Hillary Clinton addressed media in Iowa on Saturday, adding that the latest controversy is an example of disagreement among various parts of the government about what should or should not be publicly released.  Her remarks come after The New York Times reported Thursday night that inspectors general for the intelligence community and the State Department had asked the Justice Department to launch a criminal investigation into Clinton’s possible mishandling of classified email."},{"comment_id":"876171829182663","commenter_b":"Moderate moslems DO NOT exist!","commenter_a":"YEP, They are ALL extremists, and should ALL be deported! Its simple!","post_message":"I'm not joking when I say this is the most important video I will ever share..."},{"comment_id":"390976721026923","commenter_b":"She needs a new Do!!! Lol","commenter_a":"Yep holder in a skirt","post_message":"What do you think of the White House nominee for Attorney General?"},{"comment_id":"688684917923527","commenter_b":"Bye Lil bitch","commenter_a":"Damm bye @username","post_message":""},{"comment_id":"392884667560081","commenter_b":"Bitch!","commenter_a":"He certainly does, and the GOP deserves a kick in the ass!","post_message":"President Obama deserves a HUGE thank you!"},{"comment_id":"674830109374234","commenter_b":"This America and every body should be able to fly our flag and if any muslim feels threaned then they can just leave your country and go back to where they belong and stay there","commenter_a":"I say- \"TOUGH\"","post_message":"You'll never believe why this man was forced to remove his flag.  This is absolutely wrong. If you're offended by the flag, LEAVE.  Can we get 20,000 'LIKES' in support of the American Flag?"},{"comment_id":"10152968274184099","commenter_b":"Thank God!! These kids don't know what they are doing to their parents and the dangers there are out there. Stay ya tail in the house.","commenter_a":"Glad she is safe","post_message":"A missing teenager who left her Edgemont home more than a week ago wearing only pajamas has been found in Manhattan, police said. @webpagelink"}]
