[{"comment_id":"10152950804022434","commenter_b":"Just a bunch of liberal bitches that have no fucking brains. Their full of their self","commenter_a":"The view is always just a bunch of dumb bitches!","post_message":"Eggland's Best Eggs and Johnson & Johnson have pulled out as show sponsors."},{"comment_id":"731521210341165","commenter_b":"You mean the Wars the Bush started and Obama ended? Also James now that you've mentioned hospitals, in Syria we as a country have never bombed a hospital, it was Russian and Syrian Regime bombs that caused those explosions. Banning or restricting the immigration from certain countries has been happening for as long as the United States had borders. But this is the first time we have banned people of a certain religion from entering the country. Even though these Muslim men, women and children are suffering just as much as their next door neighbors who are Christian or Jewish.","commenter_a":"Where were these people when Obama was bombing the countries the refugees are fleeing from?","post_message":"Americans across the country protested against Trump's travel ban."},{"comment_id":"1281382285238371","commenter_b":"Well said. If this Jolie live in Muslim country like we do ,then her opinion about Islam will radically change. She should know the Muslim will never compromise with others..stupid","commenter_a":"I don't listen to rich new world order liberal fucking wackos. If the come out and try to tell us all to do something. Its never ever good. This Bitch is rich living in nice safe places. Safe from the hell the rest of us would have to deal with","post_message":"DOES ANYONE CARE WHAT THIS LOSER HAS TO SAY?"},{"comment_id":"1040367212665366","commenter_b":"Suck a dick Diane.","commenter_a":"TRUMP will close our borders to illegal people. TRUMP will rid us of common core curriculum! TRUMP will temporarily ban Muslims from entering our country.. TRUMP will build up our military to its once held position! TRUMP will dump obamacare! TRUMP will allow the 2nd amendment to stand! TRUMP will negotiate with foreign countries like a hellstorm! And will NOT back down! TRUMP will in for America! DONALD TRUMP loves America! TRUMP will get jobs... DONALD TRUMP is The ONLY CHANCE we have to stay a FREE NATION!!! That's ALL why we NEED DONALD TRUMP for PRESIDENT of these UNITED STATES of AMERICA!!!!!!!!","post_message":"Breaking...  This changes EVERYTHING!!"},{"comment_id":"1775352399350823","commenter_b":"Who would cheat on a woman like Beyonce?","commenter_a":"Ok y'all I admit I'm \"Becky\". J has a wonderful package and I milked it well. Sorry Queen B.","post_message":"Fans claim she is 'Becky with the good hair'"},{"comment_id":"1707461899536305","commenter_b":"This lady is lady has her own set of rules","commenter_a":"From you? Yeah right!. . . The Ambassador and thsoe Marines are - ROLLING IN THEIR GRAVES. . . right now. . .","post_message":"Do you agree with Hillary Clinton? #SCPrimary"},{"comment_id":"10152888898915496","commenter_b":"But... But... Gay marriage is destroying straight marriage! @webpagelink","commenter_a":"Brenda. I believe that you are right in some of your thoughts. I don't delieve we should judge people. However we are definitely called to judge actions. In the case of same-sex marriage to support same-sex marraige is to supoort something that goes against the Bible's definition of marraige. Same-sex marraige is social, cultural, and traditional. Social, cultural and traditional acceptance will change with time but Biblical truth does not. Therefore I believe that we are to love everyone but support what is right in the eyes of the Lord.","post_message":"Brenda Wood 11Alive looks back at the fast-moving and historic events of last week in Monday's Last Word -- \"Same-sex marriage: Judgement Day.\"  More Last Words: @webpagelink"}]
