[{"comment_id":"1131895816845262","commenter_b":"husbands fault not the woman","commenter_a":"Is this Hilary Clinton? Always the women's fault, cause the man didn't know he was married.","post_message":"A woman found out that her husband had been cheating. She grabbed three of her friends and tracked down the mistress. What she did next is something you have to see to believe."},{"comment_id":"10154042620823717","commenter_b":"Go away and take your predator husband with you.","commenter_a":"UPDATE: Hillary Clinton has expressed regret for calling 'half' of Donald J. Trump supporters 'deplorables.' \"Last night I was 'grossly generalistic,' and that's never a good idea. I regret saying 'half' -- that was wrong.\" @webpagelink","post_message":"UPDATE: Hillary Clinton has expressed regret for calling 'half' of Trump supporters 'deplorables.' \"Last night I was 'grossly generalistic,' and that's never a good idea. I regret saying 'half' -- that was wrong.\" @webpagelink --- Donald J. Trump and Republicans quickly pounced on the remarks, which drew comparisons to President Obama's comments about clinging to \"guns and religion\" at a 2008 campaign fundraiser and Mitt Romney's \"47 percent\" remark in 2012. @webpagelink"},{"comment_id":"972807806163282","commenter_b":"shes a Savage","commenter_a":"@username her","post_message":"The former Stanford University student who sexually assaulted a woman behind a dumpster was released from prison on Sept. 2, 2016. That a full three months early from his original six month sentence."},{"comment_id":"903840716398977","commenter_b":"Nestle can suck my balls","commenter_a":"Rick Rule","post_message":""},{"comment_id":"10156759727355354","commenter_b":"He might make good filler for potholes.","commenter_a":"Stick your head into a stump grinder? Please?","post_message":"HUMBLE"},{"comment_id":"802434323195863","commenter_b":"I support neither group. Blacks and whites need to get along. We are in a failing country that is falling apart.we need to get rid of this racism and focus on the big picture here","commenter_a":"As a member of the Armed Forces and a decorated war veteran...she does not owe me an apology. She used her platform to deliver a message while honoring a historic Black-ran group on their 50th anniversary during the one month Black history seems to be relevant. Coldplay honored the LGBT community in their performance but ironically there was no uproar over that. If anything @username you owe me, the Armed Forces, and the Veterans an apology for posting this crap and trying rally up sympathizers to further your racist agenda. Radical? Hardly....maybe you should brush up on some history and ask yourself why these organizations began in the first place before posting....oh and this...","post_message":"***BLACK PANTHER PARTY SUPPORTER AND BLM RADICAL DONOR BEYONCE OWES AMERICA'S POLICE, ARMED FORCES, & VETERANS AN APOLOGY***"},{"comment_id":"10152609366937093","commenter_b":"Stfuh","commenter_a":"What a disrespectful jerk! You're lucky Saul that she didn't arrest you right there on live TV. You don't put your hands on an officer PERIOD!","post_message":"RAW & UNCUT: A sheriff's deputy didn't like where FOX 4 News reporter Saul Garza was standing during his live shot this AM.... then this happened.... @webpagelink"}]
