[{"comment_id":"10153603915850667","commenter_b":"Thank you sir. You are right. Prayers for the family.","commenter_a":"Prayers^^^ These parents have to live with this loss for the rest of their days.This isn't the time to be judgemental or self righteous. Prayers and condolences are in order.","post_message":"The father struggled with the alligator to try to save his son, but was “unsuccessful.\" @webpagelink"},{"comment_id":"1202509189764740","commenter_b":"It's always about me Me ME!","commenter_a":"cause i aint dead and after 38 years you cannot make me a beater to be dead after 38 years and with mama rosa's paperwork","post_message":"One thing he doesn't say, is \"victory.\""},{"comment_id":"1387475997939242","commenter_b":"It's probably a welsh lamb that's fucking had enough of being raped 😂","commenter_a":"Fucking ouch!!!!","post_message":"And you thought you were having a bad day... via JukinVideo"},{"comment_id":"10154398240872293","commenter_b":"There is strength in numbers. So many Nasty Women","commenter_a":"Bikers for Trump and oath keepers pls be ready to welcome them!","post_message":"While President-elect Donald Trump’s remarks served as an impetus for the protest, a march organizer said it won’t be an anti-Trump rally."},{"comment_id":"913202388702552","commenter_b":"For women, there's always danger no matter how much you use your head.","commenter_a":"No danger if you use your head. Crime is down in most of the civilized world. The news cycle is just longer.","post_message":"\"Are you alone?\""},{"comment_id":"541837822650909","commenter_b":"blow hard............lies lies lies.....#USA4DJT, #MakeAmericaGreatAgain, #VoteTrumpForPresident","commenter_a":"So sorry this is his last year","post_message":"Your reaction to President Obama's State of the Union Address?"},{"comment_id":"10153035327685399","commenter_b":"stop insulting snakes","commenter_a":"It's the eyes with this one... It's the kind of eyes you've seen on a snake.. Just makes your skin crawl","post_message":"Whoops"}]
