[{"comment_id":"599148503619234","commenter_b":"Yeah bitches","commenter_a":"We all know who... @username Daniel Hughes @username","post_message":"This is so accurate  #WSHH"},{"comment_id":"10152974175586130","commenter_b":"So much prettier than the trashy thong suits of today.","commenter_a":"Courtney Kelley Michler","post_message":"Gorgeous!"},{"comment_id":"10153953240508984","commenter_b":"We are AMERICANS! As are all legal CITIZENS! We believe in the LAW, THE CONSTITUTION and what it stands for! I don't have a problem with blacks, Mexicans or Muslims! But they seem to have a problem with us! They shoot or hurt us first and because we fight back we are racists? What the heck s wrong with this! Our Lord Jesus gave us two great laws, to love God above all else and to love our neighbors as ourselves! It doesn't say our neighbors have to be white, black, brow, or purple!","commenter_a":"Americans are done with the media as well as p.c.We are not racists or bigots..or hateful people as we are portrayed.We are patriots who are not going to let this country fall.","post_message":"This 8 word statement from the Republican debate was the most important and influential of the evening. Whether or not the candidate who said it becomes the GOP nominee, its far-reaching impact will be felt for the rest of the campaign.  Do you support this candidate's position?"},{"comment_id":"10153443850876680","commenter_b":"For her Clinton Foundation....Just say NO to HILL the SHILL!!","commenter_a":"Hillary Clinton will make a great President ! :-)","post_message":"Hillary Clinton name-checked some of her local allies and shared a series of personal stories, such as the recovery following the 9/11 attack and working with Congress to get first responders health care."},{"comment_id":"10153379974755329","commenter_b":"You have a baby in your belly. No more goofing off!","commenter_a":"Michael Aragona @username @username how do you like that?","post_message":"Thank you, restaurant gods."},{"comment_id":"644296295760949","commenter_b":"I'll wipe my butt with everyone that comes my way","commenter_a":"Not even on a penny","post_message":"Obama is trying change our countries money.  He has absolutely no right to even consider this change.  Do you think Obama deserves to have his face on a dollar bill?"},{"comment_id":"1015238835192369","commenter_b":"Not that she's seeming to give a flying bigoted spit spatter regarding the education of people in that group however. Still a power bred over privileged crusty plantation damsel. Like seven generations later. She still wants her back washed by the maid.","commenter_a":"Batshit crazy.","post_message":"Nancy Pelosi identified what she called the \"three G's\" – reasons why white males favor Donald J. Trump over Hillary Clinton. @webpagelink"}]
