[{"comment_id":"10153228787618984","commenter_b":"Well he still did his job get unlicensed uninsured drivers off the streets. They are a huge reason insurance prices are so dam high. Besides Mexicans from across the boarder are becoming the majority especially in states like Arizona!! I'd vote for Sheriff Joe every day of the week and twice on Sunday.","commenter_a":"More LE needs to do that to rid America of the damn illegals","post_message":"I cannot believe he admitted this. Liberals will be giddy. He'll really need his supporters to step up now... Do you still support Sheriff Joe Arpaio?"},{"comment_id":"1109262989140148","commenter_b":"Crazy woman- Good match for Trump","commenter_a":"What an imbecilic shallow fool! Has she ever gone a day without knowing where she will sleep for the night or whether she will find a meal before the end of the day? God! Someone just shut her up!","post_message":"\"Knowing that Trump won on [immigration], it should empower you to go ahead and ask the candidates, 'What the heck are you thinking, candidates? What are you thinking when you're going ahead and actually asking for more immigrants, illegal immigrants, welcoming them in, even inducing and seducing immigrants with gift baskets of teddy bears and soccer balls?' \" Sarah Palin said."},{"comment_id":"1037527509601593","commenter_b":"Well America will allow idiots to have guns","commenter_a":"What a dingbat","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"10153703339506509","commenter_b":"Hillary will be in jail before she ever becomes president!","commenter_a":"the entire republican party is a joke","post_message":"Rick Santorum officially announces that he's running for president. @webpagelink"},{"comment_id":"10156528298190206","commenter_b":"She is treacherous!","commenter_a":"IS THIS TRUE???@username, a Republican candidate president and the former CEO of Hewlett-Packard, presents herself on the campaign trail as a hawk on Iran. She promising to take a hardline on the regime in Tehran. However, during her time as the chief executive of HP, she hundreds of millions of dollars worth of products to Iran through a foreign subsidiary, despite strict U.S. export sanctions, Bloomberg reports.","post_message":"I’ve answered hundreds of questions on the campaign trail. Find videos of my answers here:"},{"comment_id":"10153432982041262","commenter_b":"Haha. That was sarcasm.","commenter_a":"Every month is Teacher appreciation week, they only work about 6 months out of the year and get paid for a full year.","post_message":"Tag a teacher that has made a difference in your life."},{"comment_id":"10153725740586336","commenter_b":"Who Cares. He's a Conservative Rapist","commenter_a":"Keep him on the other side of the Trump Wall.","post_message":"Police say Paul Jackson and his older brother, Vance Roberts, kidnapped prostitutes, drove them to Roberts' home and held them captive for days."}]
