[{"comment_id":"1731115690475220","commenter_b":"She should just go NOW!!!","commenter_a":"Another nut.","post_message":"Barbara Streissand says she's joining Al Sharpton and leaving the country if Donald Trump becomes president. Would you miss them?"},{"comment_id":"10154771811749411","commenter_b":"Basket of this, Bucket of that...Ms. Clinton seems to have a container to stick all of us in. Apparently, we're not much to be concerned about. To my mind she's a big pile of ***t,...bring your own shovel. No need to place her in an urn or other bucket-like container, just toss it in with the other compost and let her continue to decompose.","commenter_a":"I've seen a number of articles on 'alternative' news sites claiming wikileaks is falsifying all this stuff. Kind of sad that people would go so far to bury their heads in the sand rather than even consider the thought that a candidate which rigged a primary is capable of so much more. #HillaryforPrison","post_message":"The sheer number of insults in the email trove has left the Clinton campaign unable or unwilling to respond."},{"comment_id":"1692664807687298","commenter_b":"She is evil...completely stupid","commenter_a":"She needs help that was sick","post_message":"This is SICK!   End the Cop-Hate NOW. #AllLivesMatter"},{"comment_id":"10154428619792144","commenter_b":"Kimberly, other than Melania Trump, you wouldn't know an illegal immigrant from a U.S citizen if your life depended on it. Get ahold of yourself woman!","commenter_a":"Seriously????? Let it go.....He's done, THANK GOD!!!!!! The end of an ERROR....","post_message":"Thank God."},{"comment_id":"10155846311480405","commenter_b":"God tell you to eat there!! Moron!!","commenter_a":"Just had some Chick-fil-A minutes ago at the Atlanta Airport !!! @username and Susana Martinez !","post_message":"Ate at the original Chick-fil-A in Georgia. -SW #Walker16"},{"comment_id":"10156554094585615","commenter_b":"what an ass","commenter_a":"He's so wrong. I can judge him too.","post_message":"He calls declaring same-sex couples 'apostates' just a 'policy disagreement.' Meanwhile, LGBTQ kids are dying by suicide."},{"comment_id":"10154362826911323","commenter_b":"In Bulgaria women sunbathe topless. Older women, too. At first it seemed a bit strange to me, then I thought 'Oh well, if a 60 year old can do that, I can, too'. That was when I stopped caring. As for underpants, not enough fabric, so I'll pass.","commenter_a":"Stupid debate. Why should it bother me how people sunbathe? I don't care if they are dressed, half naked or naked. Let everyone do what they are comfortable doing, it's not like you have to look.","post_message":"“It all depends on what type of underwear it is. If they had an Ann Summers crotchless type affair then that would be a touch odd.'"}]
