[{"comment_id":"1140743049271284","commenter_b":"Little girl, you are asking for a theocracy, which America is not. Time for you to leave and go to Iran, pookie. No one wants your cowardly, uneducated, anti-American traitor self here.","commenter_a":"If God said it, it is settled!, no matter what any pervert says! And the supreme court is not supreme!, God is!","post_message":" represent the people, and the people have shown several times that they are opposed to this, and are in favor of traditional marriage, state Rep. Bill Chumley, R-Woodruff."},{"comment_id":"1047903455266183","commenter_b":"I wish you would get an education, maybe you wouldn't say such stupid things Douglas","commenter_a":"Lmao. what a joke. So the economy is better, Because the middle class people are working 2 jobs to make what they were making before Obama and to pay for more expansive healthcare? The people have strengthened the economy,not politicians, through hard work and much sacrifice. I am sure the \"rich\" are happy, anyway.It works for them.","post_message":"We have to defend the progress we’ve made and build an economy that works for everyone—not just those at the top."},{"comment_id":"827024174060503","commenter_b":"@username you move and take that communist Kenyan creep with you","commenter_a":"You libs are pure , unaldulterated \"mush\"! Your president is taking us down the road to nowhere and you are worried about the police killing a wonderful young \"punk\" who stole and bullied and tried to kill an officer? Get off welfare and get a job!","post_message":"\"The power to kill is the most awesome power that any government worker could possibly have. We have given that power to police, and then we have refused to monitor it.\" - Lawrence O'Donnell"},{"comment_id":"1197700750270781","commenter_b":"Get over it. The water is theirs. Respect it.","commenter_a":"@username I just adore you!!!","post_message":"These sharks aren't actually all that scary when you get your facts straight. Something else is, though."},{"comment_id":"784349154999752","commenter_b":"Bitch","commenter_a":"Another racist liberal what does she have against Orange people. Ray","post_message":"Oh, Meryl...."},{"comment_id":"10152814329771636","commenter_b":"The LibDems should have fought for a workable PR system when they had the opportunity.","commenter_a":"As much as I don't like the UKIP he is right","post_message":"'I now have to think seriously about my future life, and what I want to do'"},{"comment_id":"1336033269792120","commenter_b":"Lol mybe we all should get a dogs and then all the Muslims will live.Cause thay thank dogs r evil ant that funny .","commenter_a":"He was acting like a mad dog, so he got what he deserved!!","post_message":"When This Muslim Migrant FAILS To Surrender, Police Let Their K9 SHRED Him To Pieces! (VIDEO) LOL! Sorry! Even \"Beggin' Strips\" can't save you now! LOL!!!!!! :D"}]
