[{"comment_id":"649975575168534","commenter_b":"God Bless Heal Comfort Renew & Keep that poor innocent child...as 4 Them(Mr Swollen & Miss Crazy Lookin) ..Vengeance is Mine said the Lord!!!","commenter_a":"😡😡😡😡","post_message":"True tragedy. A 4-year-old was found beaten and zip tied to her bed. Not only that, she didn't know her own name and told police she thought it was 'Idiot'."},{"comment_id":"980597458645157","commenter_b":"Let's start following it, shall we?","commenter_a":"God bless the Constitution of the USA","post_message":"Happy Constitution Day!"},{"comment_id":"10152993022307217","commenter_b":"We really don't like immigrants here. Go back to your country, HitchBOT! Stop stealing American jobs that nobody wants.","commenter_a":"I'm very sorry it happened. I wish we could have done a well as everyone else. It would have been awesome if we could have sent to Australia.","post_message":"HitchBOT crosses Europe and Canada but is smashed to pieces in the US"},{"comment_id":"471302453029710","commenter_b":"Shut up bitch","commenter_a":"Lovely comments. Your humanity cards should be revoked. Two pilots died. They weren't bombing anyone. They didn't authorize an invasion. They may have left families. They made modest incomes. Let's hope we can oppose Russian foreign policies without celebrating the deaths of two everyday Russians. Condolences to their families.","post_message":"This is the sixth military aircraft accident in the country in just under six weeks."},{"comment_id":"1642069832709355","commenter_b":"I'm voting for Trump.Is it just me or is Sara palins voice extremely annoying?Like worse the that Kathy griffins creature.","commenter_a":"I approve this message. I am anxious to know Mr. Trump's running mate. Go, Donald!","post_message":"I am greatly honored to receive Sarah Palin's endorsement. She is a friend, and a high quality person whom I have great respect for. I am proud to have her support. #Trump2016 #MakeAmericaGreatAgain"},{"comment_id":"10153069048676770","commenter_b":"Both are bitchs","commenter_a":"I see that Meryl has picked her poison.","post_message":"\"How can people like Meryl Streep and Hillary Clinton envision themselves as rebels when they are the establishment?\""},{"comment_id":"10154402963106729","commenter_b":"and..... Beyonce needs to get the hell out of the United States of America!...","commenter_a":"Our police are just doing their job and taking out the trash.","post_message":"Everyone needs to see what he sent Obama...POWERFUL."}]
