[{"comment_id":"660327817491130","commenter_b":"I love that woman !!!","commenter_a":"Read the artical..Where does Obama himself go after Sarah's family? What did I miss? I do not like Obama, (even saying his name makes me shudder) but I do not like miss information. What I read was the IRS is going after her dad.","post_message":"Obama is now targeting Sarah Palin's family, but she's not backing down. Way to go Sarah. We love you and your family, God bless. Can we get 30,000 'LIKES' for Sarah Palin?"},{"comment_id":"10152739568405796","commenter_b":"Thanks for breaking the \"fear of being called a racist\" barrier Charles. My memory serves to tell me that most of these crimes are done by out of state blacks. National statistics back this up.","commenter_a":"Anyone noticing if it isn't locals its out of staters and 9/10 times they're black...","post_message":"A South Carolina man admitted Friday in U.S. District Court that he imported crack cocaine, powdered cocaine and heroin from out of state and distributed the drugs in the Bangor area."},{"comment_id":"629045897266731","commenter_b":"no - if they want to work, they must follow the rules of the company, not shariah law.","commenter_a":"omg,.... to quote Faye, No more 'political correctness' for me. I am getting tired of this \"FAVOR\" at the expense of the average AMERICAN citizen. ANY business ANY where in the USA that refuses to fly the AMERICAN Flag, that honors false Gods.....will not get my business, Period!!!","post_message":"Home Depot Embraces Shariah Law With ‘Muslim Sensitivity Training’. They are submitting to societal pressure. Do you think Shariah Law has no place in America?"},{"comment_id":"1076328745721469","commenter_b":"I got bafar as well","commenter_a":"Woooow @username","post_message":"This is really, really weird. Check out the explanation here: bit.ly/1bRZ7nn Via by AsapSCIENCE."},{"comment_id":"10155397159458797","commenter_b":"And no telling how many more he has! Since he likes to pull on ladies p___y. Freak!","commenter_a":"Since you all won't acknowledge our formal president as the \"First Black President\" i will only acknowledge trump as the FIRST PRESIDENT WITH THREE BABY MOMMAS' BAHAAAAA! HAPPY BLACK HISTORY MONTH!!!","post_message":"On this first day of Black History Month, we recognize former President of the United States, Barack Obama. He was the 44th U.S. President and the first African American to serve as president."},{"comment_id":"10152857545591051","commenter_b":"They all need to be sent over with Isis! If you don't like this country, get the hell out!!!!!","commenter_a":"Agree with @username.","post_message":"More than 1,200 people, including a lot of prominent professors, just signed a letter to ban the American flag. Here are all their names and the schools they’re from."},{"comment_id":"1836028549960584","commenter_b":"She is our next President.actually Trump made it easier for her .","commenter_a":"Yeah, it pisses me off ... but my respect for her has just gotten greater.","post_message":"She and her supporters smile and thrive despite a daily avalanche of hatred."}]
