[{"comment_id":"10153027990406130","commenter_b":"I'd add not to be shy about calling your OB for more pain meds, especially after multiple c-sections. They're not surprised, it's actually common. I wish I would have called sooner than suffer unnecessarily.","commenter_a":"I've had 6 c-sections.. 3 of which were After a long labor. While laughing and/or coughing is painful for the 1st day, that's about the worst of it, I never took pain meds after... The first one I might call 'rough'- but the other 5 were not bad at all. #5 was 6 weeks early and I had to pump milk and walk to the nursery (she needed the heat light) every 2 hours to feed her, it really wasn't that bad.","post_message":"Congratulations! Your ab muscles are completely non-existent now. The good news: Your arms are gonna get buff."},{"comment_id":"10153123506246770","commenter_b":"I have zero respect for someone who marries a low-IQ maid.","commenter_a":"But he is more concerned about foreigners who break our laws than citizens! See ya!","post_message":"Danny Diaz, campaign manager for Republican presidential candidate Jeb Bush, told The Daily Caller that Bush opposes abortion and would not promote it as president."},{"comment_id":"10153737001138812","commenter_b":"This lady is still working there??????????????","commenter_a":"why not go ask a Muslim cleric to marry them get married in a mosque","post_message":"Another gay Kentucky couple denied marriage license by controversial clerk: @webpagelink"},{"comment_id":"1197123797007048","commenter_b":"we dont have to suit anyone, the LORD gave us free will, why dont the VATICAN set up a special place for these illegals.","commenter_a":"you like mr pope you take them all including obama kerry h clinton no need to thank america for giving you these winners you are welcome o mexico will send all their winners too you are welcome ok","post_message":"I wonder how many spare rooms the Vatican has..."},{"comment_id":"685062714983869","commenter_b":"So...when will they let Ted Nugent or Trey Gowdy be a moderator?","commenter_a":"Why Matt Lyer? What a CREEP!","post_message":"CLINTON, TRUMP SQUARE OFF"},{"comment_id":"10154330734419087","commenter_b":"Shes a half wit scrub striving for brownie points. Bitch needs to go home and make a peanut butter sandwich and shut the fuck up, we ain't got her candy.","commenter_a":"@username not enough money or incentive","post_message":"#BREAKING: The Green Party is dropping the case spearheaded by Jill Stein to request a recount of the election results in Pennsylvania, citing an inability to pay a $1 million bond required by the court."},{"comment_id":"10153509244088854","commenter_b":"Go home!!","commenter_a":"Don't let the hit you in the behind when you leave","post_message":"Obama Claims He’d Be Treated Better In Europe, Whines About “Names I’m Called” In America..."}]
