[{"comment_id":"10153466611918635","commenter_b":"Amen","commenter_a":"Amen, aleluya","post_message":""},{"comment_id":"10157050332450354","commenter_b":"This bitch is a PSYCHO!!!!!!!!! I am 100% convinced now ( before I couldn't be totally sure ) that those bruises on her forearm were made prior to Cory grabbing her. Corey grabbed her biceps the video shows more likely than her lower arm. She has 0 credibility and will never get a job as a respected journalist again","commenter_a":"You stupid bitch you need to let it go. There was no case and you should be the one arrested. You will be lucky if you can get a job delivering papers. Your a liar just trying to get more than your 15 which by the way is up. You didn't do what you were told to do just like every other common thug that feels they can what ever they want. Now shut up and go home before you make a even bigger ass of yourself","post_message":"“The entire situations just seem to me a little sketchy....\""},{"comment_id":"543331865850763","commenter_b":"WANTS TO KEEP AMERICANS STAGNANT, MOVING BACKWARDS AND PAY HIGHER TAXES TO SUPPORT IMMIGRANTS COMING OVER OUR BORDERS FROM ISIS COUNTRIES TO PUT AMERICANS IN GREAT DANGER, WANTS TO KEEP MINORITIES IN DEMOCRATIC OPPRESSION, POVERTY, JAIL, AND HIGH CRIME, NO FUTURE, WELL WHY NOT VOTE FOR HILARY CLINTON.","commenter_a":"Says the oh so honest Christian man who dumped his wife (who was fighting for her life with cancer in the hospital) for his bimbo secretary after he dumped the first wife because she wasn't pretty enough to be married to a great man like him.","post_message":"\"Donald J. Trump's going to win, because in the end the country's not going to reward big banks and big unions and big bureaucracies and big donors and big corruption by voting for a big liar.\" –Newt Gingrich"},{"comment_id":"10153162076526680","commenter_b":"How the hell did you get to this conclusion based on my comment ?","commenter_a":"He's 100% right. Charlie Hebdo was especially targeted because they did cartoons criticizing Islam. What's more frightening in last week's attacks, is that, there was no rationale, just indiscriminate killing of everyone in sight.","post_message":"John Kerry suggested that there was a “rationale” for the assault on satirical French weekly Charlie Hebdo, unlike the more recent attacks in Paris."},{"comment_id":"1160371997392384","commenter_b":"She made us women proud!","commenter_a":"Proud of you, and I don't even know you! I spend a lot of time in Florida although I don't live there. If I ever encountered Scott, I'd like to think I'd tell him off, perhaps not so 'eloquently'!","post_message":"\"In some ways this is about me and my personal interaction, but it's also about all of us who are having to live under the reign of Governor Scott.\" - Cara Jennings"},{"comment_id":"558632694347761","commenter_b":"Oh Karen, you drank the Kool-Aid!","commenter_a":"Clinton News Network is the Communist News Network! Suppressing the american people and the truth and shutting down live feed the minute anyone mentions anything negative about your Wicked Queen is disgraceful! Your network is just as bad as the National Inquirer with fake reporting! You continue to try and brainwash americans into believing the left wing propaganda. News Flash...millions of americans are starting to use their own brains, which you can no longer control! Continue to cheer for Killary, because you're proving to the american people that your network is as crooked as she is!","post_message":"“There’s no quote. You’re not gonna find a quote from me,” Donald J. Trump told Hillary Clinton. Well, we found a few. Watch 4 of Trump's statements from the debate stage that don't seem to match up with what he previously said @webpagelink"},{"comment_id":"10153047179381323","commenter_b":"Katie price is entitled to exactly the same as everyone else she is a British citizen who pays her taxes so she and her children are entitled to use the Nhs. Maybe we should be concentrating on people who arnt entitled coming to this county just for the benefits and Nhs and maybe the government should be claiming back the millions we loose in this way. I don't expect Katie price or other celebs are a drain on our economy as some people who claim benefits with no intention of ever working.","commenter_a":"The benefit system isn't struggling & costs being cut because of Katie Price, it's struggling because of the generation of freeloaders who see Benefits as a career choice, people who can work & pay taxes but don't; If everyone in this country that can work had the right work ethic we wouldn't be in half the mess we are. I was always brought up benefits are for those who need it for clothes, warmth, food, the essentials - including specialist care for the disabled, people nowadays have full sky packages watched on 50\" tvs, have a social life and go abroad for holidays all from benefits, where's the incentive then to get off their backsides and go to work. Whilst I'm not her biggest fan Katie price pays much more than her fair share in tax, she's a grafter & a worker, her son deserves his benefit rights in return","post_message":"\"This is exactly why universal benefits matter. Defend the right of mothers of disabled children, such as Price, to get help, and it reinforces the rights of everyone else. That’s how society works. Strengthen one pillar and the other gets bolder; weaken one and it won’t be long before they all start to crumble.\""}]
