[{"comment_id":"10156198873145354","commenter_b":"Screw Faux News and that bitch Megyn Kelly.","commenter_a":"FOX is decending to a new low leval! I used to have it on all the time but now i will just tune in for one program!","post_message":"We have the intense Twitter exchange between Donald Trump and National Review editor Rich Lowry. Read the tweets!"},{"comment_id":"1133469633342492","commenter_b":"Women's bathrooms have that too bc some haven't mastered the art of hovering. Then add on period stuff.","commenter_a":"Joke's on you, pal. Men's public bathrooms are usually pretty disgusting.","post_message":"This. Is. AMAZING."},{"comment_id":"10153588391460667","commenter_b":"@username: you basically need a nice warm cup of shut the hell up.","commenter_a":"Don't feel sorry about those ... These soliders maybe killed 300 kids and 300 from elderly people in Palestine , but we say Islam say don't kill innocents people even from your enemy ...","post_message":"\"Terror will not silence us, we will return to work tomorrow,\" Tel Aviv Mayor Ron Huldai said."},{"comment_id":"10152952082057452","commenter_b":"Shes beautiful","commenter_a":"So precious!","post_message":"This video of a baby seeing her parents’ faces for the first time after getting glasses will melt your heart: @webpagelink"},{"comment_id":"808271599289223","commenter_b":"Same as women who cheat","commenter_a":"Why frikken cheat? If your not happy, just go, leave..men who cheat are just cowards, w too much ego...dont play stupid games..","post_message":""},{"comment_id":"935958373261405","commenter_b":"Can she get any uglier.","commenter_a":"Trash just like her parents glad they are gone","post_message":"This speaks volumes about who they are as people. Thank the good lord we are done with them. Were the Obama's the worst first family ever?"},{"comment_id":"1215195555169015","commenter_b":"Angela Merkel sucks wake-up idiots please","commenter_a":"Actually, Donald Trump is the only candidate, with a proven business record, who can assess data, consult with people who need to be heard, and make decisions he can logically defend. Hillary's track record as a senator and Secretary of State are without merit! (Btw, I used to be a democrat but I refuse to vote - then or now - for the two most corrupt politicians of our era!)","post_message":"“She is the only candidate who can assess data, consult with people who need to be heard, and make decisions she can logically defend.” —WIRED on Hillary"}]
