[{"comment_id":"1095120020511481","commenter_b":"Can you imagine a women asking for that to happen What an ass","commenter_a":"rapper bitch needs to be hung .....","post_message":"BOOM."},{"comment_id":"10153765423589170","commenter_b":"'@username you are spot on 100%. You don't allow a foreign entity into your country and let them have an area nor let them 'work it out'. Because that area gets a little bigger then a little bit more before soon they are running the country.","commenter_a":"Rahm assisted his Muslim brother Obama in degrading the police when they did do their job. Now the police are afraid to do their jobs.","post_message":"The irony here is that it's HIS ideology that has cops afraid to do their jobs.  His ilk spent the last eight years calling everyone racists.  Now he has the nerve to complain about the outcome?"},{"comment_id":"10153484016796519","commenter_b":"Illegal aliens... is not racist. No mention of race... just ILLEGAL.","commenter_a":"Funny but kind of hypocritical on SNL's part since they gave him legitimacy not that long ago even after he had said racist things.","post_message":"SNL hilariously scorched Donald Trump's supporters last night...."},{"comment_id":"1173415112684267","commenter_b":"Society is being destroyed by this abomination! Gay lifestyle brought the AIDS virus, now innocent woman and children are dying because of promiscuity, bisexual acts, and gay relationships! Sin has deadly consequences that all in society pay the price for! That's why Rian!","commenter_a":"I agreed ban same sex marriages.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1099626483393732","commenter_b":"RINO revolt began with Romney. We shall soon see a series of similar dogs.","commenter_a":"Ventura is a jackass!","post_message":"Someone other than Michael Bloomberg is considering a run for president.  Could this controversial figure make an impact on the 2016 race?"},{"comment_id":"10152994622700796","commenter_b":"Women are more likely to have chronic pain, be prescribed prescription painkillers, be given higher doses, and use them for longer time periods than men. Women may become dependent on prescription painkillers more quickly than men. Women may be more likely than men to engage in “doctor shopping” (obtaining prescriptions from multiple prescribers). Abuse of prescription painkillers by pregnant women can put an infant at risk. Cases of neonatal abstinence syndrome (NAS)—which is a group of problems that can occur in newborns exposed to prescription painkillers or other drugs while in the womb—grew by almost 300% in the US between 2000 and 2009. ---@webpagelink","commenter_a":"These addictions for many were not choices but had a slow way of happening. Many were prescribed pain relieving drugs after surgery or have a bad back or another painful injury and the doctors wrote prescriptions for opioid medicine like the were going out of style. The family that owes the company that make Oxy, are literally billionaires now just by selling Oxycontin. When you write millions of prescriptions for Oxy in less than 20 years, what the hell do you think that will happen? Many of those people become addicts if you take these drugs for a long enough time. When the doctors stop writing scrips, the people turn to any source available. IMO, Doctors are responsible for the current heroin epidemic in this state and country.","post_message":"“It focuses on a social service intervention as opposed to criminal justice intervention, and it’s been very successful in Seattle,” Portland Mayor Michael Brennan, who is a licensed clinical social worker, said."},{"comment_id":"1533770763589743","commenter_b":"Stupid!!!","commenter_a":"Idiots. I don't watch or care about that crap.","post_message":"Tonight at the Oscars, celebrities will be wearing gun control bracelets (paid for by the anti-gun group Brady Campaign), while being surrounded by massive amounts of armed security. Think any of them will note the irony?"}]
