[{"comment_id":"10152854969571051","commenter_b":"Let behead these scumbags..What the F**k is wrong with people..Your parents should get their asses kicked","commenter_a":"Tell me where they live. I'll do the rest...","post_message":"These teens beheaded a puppy with a machete and posted the video to Snapchat. Then they picked up another puppy and did it again. And they didn’t stop there."},{"comment_id":"10153203722519614","commenter_b":"You must talk a lot huh? I said NOT ALL Pitts... Damnnn women take a deep breath. Move on peace out, relax.","commenter_a":"Another Pitbull attack! Unfortunately we all probably knew this was the case even before reading the story. I'll be shouted down by Pit defenders as is their norm, but I don't care. No other breed is killing other dogs and humans like this, and this breed needs a re-set NOW.","post_message":"A French bulldog puppy that died after being attacked by another dog while in the care of a Petco-owned dog-boarding facility has prompted calls for #justiceforboggs.  The Pooch Hotel Hollywood representatives initially told the dog's owner that Boggs was taken to a vet as a precaution after an altercation, according to the owner's roommate. About 45 minutes later, an ER vet called to say the puppy was in critical condition with a torn trachea and multiple internal injuries.   Described as \"13 pounds of pure joy,\" Boggs was put down as her out-of-town owner listened helplessly on the phone. Now she is considering legal action.  Read KTLA's story here: @webpagelink"},{"comment_id":"10153756549625667","commenter_b":"No Trump No Hillary, any body else, American have the best.#","commenter_a":"like my page awlad nass","post_message":"As the Iowa State Fair got started 20 years ago, two people were shot dead in the exhibitor campgrounds."},{"comment_id":"10153976487996130","commenter_b":"we are living in the country that has no national insurance and crazy people can have a gun. poor sick people will die without government help and crazy people can massacre a lot of people easily and at one time with a gun.","commenter_a":"Kasa","post_message":"Another mass shooting. Another national address by President Obama."},{"comment_id":"10153224011251051","commenter_b":"Shoot the the sonofbitch","commenter_a":"Dirt bag!","post_message":"A lot of people considered this man a hero. Then the truth came out."},{"comment_id":"10153569563806051","commenter_b":"They should be sent back where they came from ASAP !!! End of that story !!!","commenter_a":"Please do some research. What does your state actually offer in the way of public assistance to noncitizens? In California noncitizens are not eligible to cash assistance or Calfresh (foodstamps). No Social Security or Medicare without legal residency. So just what are you haters talking about? I hope none of you ever find yourselves in a financial situation which would drive you away from your home in order to survive. I hope you don't call yourself \"Christians\" because you are so far from the core of that belief.","post_message":"Should illegal immigrants be banned from receiving Obamacare subsidies? That was far from the case in 2015."},{"comment_id":"10153448119649753","commenter_b":"What a great idea, Helen! Let's all go out and buy guns and have daily shootouts in the malls of America! If I had a choice between keeping you here or one of the Muslims I know, I'd pick the Muslim.","commenter_a":"They were Muslim terriost keep your guns ready if you don't own one get one get a carry permit if you go to the mall take your gun we have to stop them obummer wants to protect them wants to let more in write your govnor insist we don't want them here","post_message":"ISIS has reportedly claimed responsibility for the San Bernardino, CA shooting that took place on Wednesday, December 2. For the past couple days, the Federal Bureau of Investigations has only speculated that the shooting – which claimed the lives of 14 victims and left 19 injured – was an act of terrorism, but have not confirmed. Now, the come forward with a chilling statement about the San Bernardino shooting and the Muslim newlyweds responsible for the massacre – Syed Farook, 28, and his... @webpagelink"}]
