[{"comment_id":"10154084901793837","commenter_b":"How horrible to be treated like that. I hope she gets fired.","commenter_a":"Wtf is wrong with these people ..","post_message":"QUESTIONABLE TSA TREATMENT? A woman diagnosed with breast cancer says she was humiliated by TSA during a recent security check. Hear what she has to say about the ordeal."},{"comment_id":"10154098504122541","commenter_b":"Omg you. Are too much really","commenter_a":"Ugh, putting my faith in Mike Pence to save us from Trump? Lose Lose situation. Pence is actually scarier, he just tweets less. Hmm, decisions lol","post_message":"Let's talk about the 25th Amendment."},{"comment_id":"10153328109319087","commenter_b":"@username Let the refugees go fight for themselves.","commenter_a":"When are people going to accept that refugees are not terrorists?","post_message":"President Barack Obama still plans to allow 10,000 Syrian refugees into the country over the next year, despite terrorist attacks in Paris, at top aide said Sunday."},{"comment_id":"10155683176459778","commenter_b":"@username classless is any woman who voted for Trump...","commenter_a":"I hope he sticks his middle finger up on the walk across the lawn...","post_message":"Are you ready to say goodbye to President Obama?"},{"comment_id":"10153344961531336","commenter_b":"With the negros and the muslims,America is done.","commenter_a":"Someone \"finally\" says that they noticed the male charging up to the officer put his hand behind his back! Was that officer supposed to \"WAIT\" & see if the guy had a gun ??Plus,we DON'T know what he said to the officer! Don't be idiots & think the officer shouldn't be ready to protect himself just because \"THEY WERE TEEN AGERS\"!!!! AND IT ALL GOES BACK TO...\"LISTEN & DO WHAT THE OFFICERS SAY\" INSTEAD OF THINKING YOU'RE \"ABOVE THE LAW\".......","post_message":"JUST IN: Cpl. Eric Casebolt has resigned from the McKinney Police Department after almost 10 years on the force. His resignation was confirmed by his attorney, Jane Bishkin of Dallas."},{"comment_id":"943252975710162","commenter_b":"I feel like singing. We say grace we say ma'am if ya ain't in to that we don't give a dam. Were from north california and south alabam and little towns all. Around this land. But on a serious note. Being politically correct has made our country weak. Made our children bad and taught them mom and dad will save me no matter what. And yes I do support trump. I'm against illegal immigration and gun control.","commenter_a":"If she would have been taught respect for authority at home this wouldn't have happened true thug trash.","post_message":"Some reasons why Officer Ben Fields should be fired immediately."},{"comment_id":"10153500482753598","commenter_b":"nothing that comes out of this woman's mouth is ever true!!!!!","commenter_a":"She is an idiot..","post_message":"Hillary Clinton Claims “All of Us Want to Fund Planned Parenthood”"}]
