[{"comment_id":"998513920215363","commenter_b":"girl needs to sit down","commenter_a":"LOL @username","post_message":"Yeah, Um....No."},{"comment_id":"10153410983047787","commenter_b":"@username, she is an idiot!","commenter_a":"You are an idiot. Climate change causes prostitution I have never heard such a stupid coment.","post_message":"Diversity is our nation’s greatest strength – our currency should reflect that. I’m so glad that the Treasury Department agrees! Which shero would you like to see on #TheNew10?"},{"comment_id":"10154517045124087","commenter_b":"The Muslim ban from war torn nations is meaningless. Besides him not banning Muslims from Saudi Arabia - because they have \"great human rights\" over there from Women not being allowed to drive or throwing Gays off of roof tops; Trump says US will prioritize Christian refugees. How do you determine who is a Christian when one can easily lie about this? Congress will likely overturn this. While they're at it, Trump stop droning brown people overseas and Congress stop sending foreign aid to these terrorist organizations who indirectly receive it.","commenter_a":"Good","post_message":"BREAKING: President Trump has signed an executive order indefinitely banning all refugees from war-torn Syria and suspending all refugee entry for at least 120 days."},{"comment_id":"10153604770703984","commenter_b":"I know that Obama was slow to react. The main reason is the fallen were White and Hispanic soldiers killed by a Islamic terrorist. He has zero respect for our military and would be very happy if all military members that don't support his new direction for this country would resign. We have a President that wants to convert America into a third world country that will allow him to remain its Dictator. Everyone needs to remember the USSR and how it broke up into many small countries that are loaded with the rich leadership and the overtaxed people who just want to live in peace. Russia's streets are ruled by gangs and the mafia. WAKE UP AMERICA!!!","commenter_a":"Obama is some commander in chief NOT!! He should be ashamed! What happened to freedom of speech?","post_message":"What just happened in a crowd of veterans during an Obama speech says a lot about his presidency. The bold veteran who stood up even after he was dragged down is attracting a lot of attention. Do you support what this veteran did?"},{"comment_id":"1046875855332998","commenter_b":"Scary!!!","commenter_a":"correct your self b4 you talk about Mr President Obama tramp....","post_message":"Since I am self-funding my campaign, I don’t have to worry about being politically correct! President Obama has fought ISIS in a politically correct manner and look where it has gotten us! If we don’t talk about and address our country’s issues - we will never solve them!"},{"comment_id":"1231714623549367","commenter_b":"She will fit in better there, anybody who watched Fox on election night knew how desperately she wanted Hillary to win!","commenter_a":"Good bye bye democratic stooge","post_message":"BREAKING: BUH-BYE MEGYN…The Woman Who Miscalculated Her Power With Viewers Is Leaving FOX To Join Liberal, Anti-Trump NBC"},{"comment_id":"10153306712306323","commenter_b":"Women are garbage collectors in the US. I've worked with a woman in construction 25 years ago in construction. I quit that job, and got an easier one. She remained, lol. I don't mind Feminism, I think it's something that needs to exist. I just don't like the internet clusters of nutjobs, who believe if you smile or say \"hello\" to a woman, you are promoting rape culture-whatever the fuck that is. These types of Feminists are useless. They need to fuck off.","commenter_a":"According to 2010 BLS data, the following jobs contain 1 percent female workers or less: boiler making, brick masonry, stonemasonry, septic tank servicing, sewer pipe cleaning and working with reinforcing iron and rebar. Maybe the reason female workers aren't in these occupations is that too many are in other occupations. Females are 97 percent of preschool and kindergarten teachers, 80 percent of social workers, 82 percent of librarians and 92 percent of dietitians and nutritionists and registered nurses. Women have demanded more professorships, seats in congress and chairs in the boardroom, but have never complained that there were not enough female garbage collectors, waste water treatment workers, plumbers, welders, pipe fitters, coal miners, truck drivers, brick masons an block masons, lumberjacks, oil rig workers, well drillers, surveyors, longshoremen, construction workers, landscapers, sheet metal workers, HVAC repair persons, meat packers, high rise window washers, car mechanics, iron workers or any physically ...","post_message":"\"Philip Zimbardo is one of the first people undergraduate psychologists learn about. His prison experiment in the basement of Stanford University showed a darker side of humanity. He now tells us that there are fewer men than women at college, stating that positive discrimination is now needed to increase the numbers of men at university, but this is because ‘one reason you go to college is to find a guy’. Not only are these kinds of views horribly sexist and outdated, they’re also far too simplistic.\""}]
