[{"comment_id":"10153446133962550","commenter_b":"Because it's hilarious","commenter_a":"So no crime and no charges....Why is news then?","post_message":"Police found the 22-year-old man curled in a fetal position on the floor, groaning and surrounded by snacks that included Doritos, Pepperidge Farm Goldfish crackers, and Chips Ahoy cookies."},{"comment_id":"10155984439405354","commenter_b":"She's gross and needs to go away. Now.","commenter_a":"She's making too much money telling bad jokes.","post_message":"Schumer did not mention that the shooting during her movie took place in a theater with a total gun ban–**100 percent gun control**."},{"comment_id":"1411212282241061","commenter_b":"That's DIRECTED To YOU Mr Joe Biden. .oh my mistake. .mr. Joe bishop!","commenter_a":"Trump is still a fraud and will always be! Go Ted Cruz 2016!","post_message":"The #NeverTrump movement has been around longer than you'd expect."},{"comment_id":"10153590307723837","commenter_b":"De p***a WTF is wrong with the human race","commenter_a":"@username here's another one to the list","post_message":"DON'T HIRE HER! A baby sitter brought the kids she was watching to help her rob a bank! But why she robbed the bank makes it even worse!!!"},{"comment_id":"10154543039398132","commenter_b":"Two jerks","commenter_a":"Stay joyful! Happy birthday Blake","post_message":"Gwen Stefani celebrated Blake Shelton's big 4-0 with some epic throwbacks."},{"comment_id":"702990689891509","commenter_b":"Vote for trump.he is going to kick.the illegals out of the.u.s.","commenter_a":"It Obamas fault.......#feelthebern","post_message":"Donald Trump was just stabbed in the back by the GOP. This is cut throat. Do you still support Trump?"},{"comment_id":"1752390171683339","commenter_b":"Well if you like being killed because your a woman so be it but not here in the US stay in your own free country an kill all you want just not here","commenter_a":"She has to be in the running for the Idiot of The Year Award, she has my vote.","post_message":"You have got to be kidding me. Get this liberal trash off the air. Do you think this is racist and ignorant?"}]
