[{"comment_id":"1057199377724507","commenter_b":"Sensing feminists being triggered","commenter_a":"What u gone do now @username??? Does Hillary still own y'all? Who y'all gone brain wash now ??? The swamp has been drained it's time for the real Americans to take back this united States we the people are apathetically sick of corruption!!!!","post_message":"Many people did not believe Donald J. Trump could win the election @webpagelink"},{"comment_id":"10153837082186130","commenter_b":"Just like a woman - fickle and gossipy.","commenter_a":"I'd like to see a woman president too. The right woman president. Someone so awesome she makes everyone wonder why we waited so long for that woman. I don't think we've found that woman yet.","post_message":"It's not neccessarily an endorsement for Hillary Clinton, but..."},{"comment_id":"982253175146252","commenter_b":"Surprised? Evil bitches!","commenter_a":"Wait until you need one...","post_message":"So their non-apology apology meant nothing? Color me shocked!"},{"comment_id":"631671896999280","commenter_b":"Too many real stories of sexual predators taking advantage of this garbage! BOYCOTT target!","commenter_a":"After the Trump rally last night here in Pa all the restaurants and stores were packed in the vicinity. We drove past Target to get out of the traffic jam and we noticed they were dead. It was really weird to see.It was bad enough when we came home from Kmart one day my 13 year old daughter telling me a female came in the bathroom with a bag and needle. Wish I knew before we left but I do not want her coming out and telling me a MAN was in there watching her No way.","post_message":"Target customers show the company just how they feel about its new transgender bathroom policy. @webpagelink"},{"comment_id":"10153204485844087","commenter_b":"Lucky!!! I wish I could have gone.. And TO ALL LIBERALS. I'll end with this.. Yall say if you're not natives to shut up about immigration. Tell you what, when the Mexicans conquer the land like the Europeans, they can have it. When they conquer and claim. Good luck.","commenter_a":"What a fun rally. Sold out and packed American Airlines center. It was beautiful. So beautiful, in fact, they may rename it the Trump center.","post_message":"\"I'm not going anywhere and we're not going anywhere,\" Donald J. Trump told a packed American Airlines Center in Dallas, where an estimated 20,000 rallied. \"We are killing it. They mentioned a little while ago about the silent majority — it's back. And it's not silent. Maybe we should call it the noisy, aggressive, wanting-to-win majority.\""},{"comment_id":"10153046934697894","commenter_b":"#SaveYourself #hatinAssHoes","commenter_a":"Because she can't find a job doing anything else #shade","post_message":"Dawn Richard Announces She’s a New Spokeswoman for PETA (People for the Ethical Treatment of Animals) [Photo]"},{"comment_id":"10153324088600736","commenter_b":"Having a girlfriend costs alot more than a hooker","commenter_a":"You would think that even the ugliest of men can get a girlfriend without having to pay for one...","post_message":"The man showed up at the police station \"much to the bewilderment of those in attendance,\" West Linn police said."}]
