[{"comment_id":"10153694817752293","commenter_b":"All they have to do is ask and I'd let a nurse snap all the dick pics she wanted.","commenter_a":"And her name is Johnson ....","post_message":"Police discovered a photo and video on the nurse’s laptop."},{"comment_id":"10153237283580329","commenter_b":"Kurt Russell","commenter_a":"Jared padalecki from supernaturals","post_message":"Keanu Reeves or Arnold Schwarzenegger?"},{"comment_id":"1145897778760904","commenter_b":"I have the same solution no matter the skin color......shot them, protect the population from killers.","commenter_a":"Throw him in a cell with a bunch of big angry sex offenders.","post_message":""},{"comment_id":"10153233796523717","commenter_b":"If she did this to one of my children, she would be begging to go to prison or she would beg for the death penalty!","commenter_a":"Judging by similar cases involving females, she will probably get probation.","post_message":"A Concord woman arrested last week faces multiple child pornography charges. The arrest was made in connection with an investigation started by Hollis police: @webpagelink"},{"comment_id":"10153323990951509","commenter_b":"Certainly makes most if the rest of us look very lazy","commenter_a":"@webpagelink WATCH THE ABOVE YOUTUBE VIDEO LINK.THIS IS THE BREAKING NEWS I WAS TAKEN IN HEAVEN AND SHOWN THE TRUMPET BEING BLOWN AND JESUS COMING VERY VERY VERY VERY FAST AND VERY VERY SOON. THIS IS THE LAST WARNING.JESUS IS COMING FAST AND SOON Ezekiel 3:27 But when I speak to you, I will open your mouth and you shall say to them, 'This is what the Sovereign LORD says.' Whoever will listen let them listen, and whoever will refuse let them refuse; for they are a rebellious people.","post_message":"He trudged the better part of a marathon each workday. Donations poured in for the Detroit man whose daily commute is a 21-mile walk: @webpagelink"},{"comment_id":"843772605660081","commenter_b":"We no longer have a president. I impeached him for tyranny & not protecting Americans & for not following our constitution. Since we have no leader, no harm fine, no foul. Hearing whst a great leader has to say like Mr N is hood hoe America","commenter_a":"Good he's not good enough to walk in Bibis shadow !","post_message":"Socialist Senator Bernie Sanders: \"The idea that the president wasn’t even consulted… that is wrong and not a good thing for our country.”"},{"comment_id":"10154328122239641","commenter_b":"Right after you @username..... she will right after you.","commenter_a":"I hope Hillary drops dead before November.","post_message":"BREAKING NEWS: Donald J. Trump comes out of the Republican convention ahead of Hillary Clinton in the polls."}]
