[{"comment_id":"509824199177535","commenter_b":"^ Then stop posting your shit on our news, we honestly couldn't give a fuck about you dumb cunt Americans. Continue shooting each other, I need more wanking material.","commenter_a":"\"More guns!\" -Americans","post_message":"DEVELOPING: The search for the suspected gunman continues this morning."},{"comment_id":"10153689476229411","commenter_b":"^your a dumb bitch lol","commenter_a":"Neo nazi sentiments are riseing in europe includeing islamaphobia and alittle anti semetic retoric. This is a reality. I dont care if u agree or dont its happening. People say get rid of the immigrants that have refugee status and those fleeing war zones and this intolerance will end. No it wont. This is a deep rooted problem of european ethnic supremacy masked. Its disguised well and they sure convince alot of people of there philosophy from people like madam blavatsky. And her race based ideology. Whats fueling race and ultimately religious intolerance is low birth rates from the native peoples of europe so they blame immigrants even tho the state subsidizes births in europe. Neo fascism is gaining ground because of this wacky race based fear and economic troubles. So the nazis are mixing both messages pointing it at immigrants and they do get violent. They dont only want ...","post_message":" is disrespectful is the political reality in Europe that people, suffering so greatly hand, over thousands of euros and must take such unsafe routes while for the rest of us Europeans it is so easy  to travel in the other direction\""},{"comment_id":"10153095836953299","commenter_b":"What does she care, it's not her money.","commenter_a":"no wonder she is flopping around like a boated eel.","post_message":"Almost $1 MILLION on polling alone in just a few months...."},{"comment_id":"10153329238969228","commenter_b":"So what Johnny they were here before you were... immigrants.","commenter_a":"A permanent plaque in the public sidewalk for a kid who tried to kill a police officer in broad daylight?! May as well let all the murderers, rapists, and sexual predators go free and give them all a museum!","post_message":"Mike Brown's dad works to remove the memorial in the middle of Canfield Drive in Ferguson.  This would have been his son's 19th birthday.    A permanent plaque will be placed in the sidewalk after a Ferguson paving project.  The objects will be temporarily stored by Urban League"},{"comment_id":"664826563698227","commenter_b":"She should have been in the nut house a long time ago! Along with most liberals crazies!","commenter_a":"What a brainless numb scull.","post_message":"If there was a prize for \"worst listener ever\", Nancy Pelosi would be the far-and-away winner."},{"comment_id":"10153936171871813","commenter_b":"Your wifes hot though LOL","commenter_a":"If your not in Law Enforcement nor never have been dont even bother to comment on this post","post_message":"Here’s a way to increase much-needed police accountability — especially when force is used."},{"comment_id":"10154534822598132","commenter_b":"The only way,she should have stop him is by calling the authorities. She need to go to jail,knonkle head","commenter_a":"She is as guilty as that stupid dude!!! She knows a thing or two she should be charged!!!!","post_message":"The second wife of #Orlando killer Omar Mateen has reportedly said she pleaded with him not to do anything violent."}]
