[{"comment_id":"10153996390124071","commenter_b":"@username STOP ALL WELFARE PROGRAMS AND WE WILL NOT BE FINE! THERE WILL BE MORE MENTAL HEALTH ISSUES, MORE DRUG ISSUES, MORE CRIME, MORE HOMELESSNESS, MORE TRAUMA.. THAT IS NOT THE ANSWER BUT IF THERE WAS A LIVING WAGE PUT IN PLACE WE WOULD HAVE LESS PEOPLE ON WELFARE THAT IS A GIVEN. TOO EASY..","commenter_a":"Velocity of Money: I think it's quite simple if you look at something called velocity of money. What does that mean? That is the money that gets spent back into the economy. When you have the top 1% getting money, they spend 5-10% of what they earn. When you have the lower end of the economy getting money, they spend 100-110% of what they earn. Since we are a consumer economy this will be good for business in the long term. Not for the people getting the $15 per hour.","post_message":"An economist explains why Clinton’s plan to raise the minimum wage to $15 might be 'too much, too quickly.'"},{"comment_id":"1018549428199222","commenter_b":"Deport all of them before they have greater numbers!","commenter_a":"“The thing about Muslims that you should realize, is that they do not assimilate. Islamists don’t adapt to the existing culture of the host country, they simply try to force citizens of that country to conform to their beliefs or suffer the consequences,” wrote Diana Spirit. 1. @webpagelink 2. @webpagelink 3. @webpagelink","post_message":"MUSLIM IMAM: Be Compassionate...Kill Gays [Video]"},{"comment_id":"627551224082449","commenter_b":"What a nasty woman. ...","commenter_a":"Rosie is totally against any heterosexual type of sex,she would prefer all people were gay like her.s","post_message":"Rosie O'Donnell called Donald Trump a “demented human being,\" a “sexual predator,” and several other nasty things."},{"comment_id":"10153007851971051","commenter_b":"Sick ass bitch!wtf","commenter_a":"Why don't sickos like this get life in prison or death? Rapists and molesters are released to hurt more people? The system is messed up!!!!!","post_message":"This babysitter repeatedly sexually assaulted a little girl. Last week, justice was finally served."},{"comment_id":"10153439402362550","commenter_b":"How about instead of locking our doors, we teach thieves not to steal?","commenter_a":"How about instead of teaching our girls how not to get raped, we teach our boys to not rape?","post_message":"California high schools are the first in the nation to teach a new form of sex education instead of \"no means no,\" students will learn that \"yes means yes.\" Details here ---> @webpagelink"},{"comment_id":"1832531477017547","commenter_b":"Calm down, people didn't realise the date wasn't in American standard form. And we didn't feel it, or at least no one I know felt it. Innocent enough mistake, I don't think anyone deserves to be called an idiot for it","commenter_a":"For all of you idiots saying nothing happened today.","post_message":""},{"comment_id":"1034492959948582","commenter_b":"Strike one for Bernie. This has been well refuted many times over. Besides the feminists will vote for Hillary only for the fact she is a woman.","commenter_a":"All you brogressives claiming the wage gap doesn't exist don't deserve to have Bernie as your president.","post_message":"Women are making 79 cents on the dollar compared to men. For women of color it's even worse. African American women earn just 63 cents for every dollar a white male earns, while the figure for Hispanic women is just 54 cents. That's nothing but sexism and discrimination."}]
