[{"comment_id":"607285086107002","commenter_b":"I didn't know the definition of feminist included wanting to have sex with your daughter. @webpagelink","commenter_a":"idc. I would still rather have him as a president than Hillary","post_message":"Trump has been accused of sexism by his critics"},{"comment_id":"858336867535069","commenter_b":"Good for her Muslims need to go back to their own country and stay there. Stop pushing their laws on us. And stop giving into them","commenter_a":"move go back to your country","post_message":"#Sharia comes to Texas?   Not this time!"},{"comment_id":"10153746378278984","commenter_b":"A bitch with a hitch............","commenter_a":"Obviously above the law! I guess if you are part of the liberal click you are above the law! Hillary Clinton, Bill Clinton, Obama and all the rest apparently don't have to obey the law like everyone else","post_message":"James O'Keefe's undercover videos strike again. This time exposing Hillary's campaign ignoring and knowingly violating this state's laws - and laughing about it. You will be blown away by what some of Clinton's staffer say is the campaign’s motto. Everyone needs to see this.  Do you think Hillary Clinton would be the worst thing to happen to the U.S. if elected?"},{"comment_id":"10153092087111438","commenter_b":"Ha! You said it before I finished my statement.","commenter_a":"It's very obvious what happened here, it has been right from the start. This plane was intentionally driven into the ground by one of the pilots on the plane. This was very clearly a suicide/mass murder. Sadly, this is not the first time a pilot on a major airline has done this either. We are going to need to start doing a FAR better job of digging deep into the backgrounds of the pilots that we entrust to fly our major airliners going forward now. Or, we are going to have to start piloting these planes remotely from the ground and only using on-board pilots as a back-up in case the remote piloting system fails for some reason.","post_message":"A bit of eerie evidence has turned up on the cockpit voice recorder from the Germanwings flight that crashed into the French Alps this week."},{"comment_id":"10152868223844342","commenter_b":"You all ladies is nutts","commenter_a":"The mom went looking for trouble. This all would not have happened if she would have been the adult and just let it go, but she couldn't. She payed the ultimate price and now this teen is going to have to answer to a judge. No one wins in this situation. Two families lifes are forever changed. Smfh","post_message":"Police tweeted this photo of the suspect in a road rage case that left a #LasVegas mother dead  FULL STORY @webpagelink/  Photo courtesy Las Vegas Police Department"},{"comment_id":"967666993287466","commenter_b":"Lying sack of s@&$. Only pigs do that.","commenter_a":"These Muslims make up the most unbelievable lie's .","post_message":"46 Yr Old Millionaire Muslim In Court For Raping Teen: “I fell on her and penetrated her by accident’"},{"comment_id":"10156088559505294","commenter_b":"In my opinion, the collarbone issue and sleeveless tops or dresses are a bit over the top. The women in most offices I've worked at wore sleeveless dresses and tops that were tasteful and appropriate. Even the women news anchors wear tasteful sleeveless outfits. I don't see a problem with that. I do however agree a dress code should be in place for kids in school. When they get out in the real world, there are rules, and they have to be followed. 48-50 years ago, we had to wear skirts or dresses that touched the floor if kneeled down. If it didn't touch the floor, we had to change. The guys had to wear belts. If they didn't have a belt, they had to pay 50 cents for a piece of masking tape with the word belt on it and tape it to their pants, and they better have ...","commenter_a":"I say all schools should have a dress code and make sure all students adhere to it. It teaches them to accept things in life their not happy about, but rules must be followed.","post_message":"It's back to school time, and we're hearing more stories about dress code violations. Students at one school in Chicago are protesting a rule that they wear only shirts and dresses with sleeves.   Click below for more, and tell us: Are dress codes these days fair? Unfair? Do they go too far?"}]
