[{"comment_id":"10153232276610496","commenter_b":"Fire them, then keep your doors locked.................that is exactly why they do not need to be in this country.","commenter_a":"Not showing up for 3 days to work with no explanation...how is that part of religious freedom...that many accomodationa are not made for Christians...and if Christians prayed in front of Muslims at the same workplace, Muslims would say they were offended...kind of one sided thinking ...","post_message":"\"Prayer is the first priority to every Muslim. We can sustain without a job, but we cannot sustain without prayer.\""},{"comment_id":"1128228853905897","commenter_b":"EXECUTE the QUEER ----NOW !!before this poor girl is DEAD from being RAPED by this SUBHUMAN PR*CK !!!","commenter_a":"Discusting pervert","post_message":"DISGUSTING! Muslim Migrant Men Pose with Pre-Teen Non-Muslim Girlfriends on Social Media! Obama wants these perverts in your neighborhood!"},{"comment_id":"1189532041066824","commenter_b":"only girls use pillow when they fight","commenter_a":"A pillow fight injured more than two dozen people????? Boy, are we ever ready for World War 3 if need be!!!","post_message":"UPDATE: A pillow fight at the United States Military Academy at West Point turned so violent that it caused concussions in 24 cadets, the superintendent of the school told NBC News on Saturday."},{"comment_id":"10154467754523010","commenter_b":"@username .... Look who's talking?! Trump got his mistress pregnant, that's were his second daughter came from. Malania said, in her plagiarized speech, that she Trump had been together 18yrs....Trump was still married to wife number two at that time! Children with three different women!!!!! Can you imagine what the Republicans would be saying, if that was Hillary?! Hypocrites!!","commenter_a":"He and Bill should hang out since they both cheated on their wives multiple times. Nothing like knocking up the maid. #NeverHillary #ImAgainstHer #VoteTrump","post_message":"Not quite hasta la vista to the Republican party."},{"comment_id":"10153395749836336","commenter_b":"Well what if I said I'm tired of boarder jumpers and we need a 50' tall concrete wall put up to keep them out cuz I'm tired of dealing with them. But I do love Mexicans. I mean all of it. I love the ppl just don't care as much for those who try to come to the states illegally.","commenter_a":"I'm totally on Trump's side here. The U.S. does need to end its TPA with ALL FOREIGN COUNTRIES! Regardless of how the ppl feel. Mexico is taking this offensively because they know that Trump will keep his word, he will stop doing business with them, he will put up a wall to stop immigration and Mexico doesn't want to deal with losing our money and then having to take care of all of their people who have illegally made a life in the states and are sent back to their homeland. I think the U.S. should do as Canada does and anyone who wants to become a citizen should have a sponsor.","post_message":"“I’m going to have to sue Univision now.” Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10157164250770206","commenter_b":"yeah allowing syrian refugees into your country , with no skills or money , will really bring about progress and sustained growth.","commenter_a":"nope not gripped by it.","post_message":"The Turkish Coast Guard has released a gripping video of a Syrian refugee being rescued after his boat sank – killing 27 people, including at least 11 children. @webpagelink"},{"comment_id":"1567259589966213","commenter_b":"She is a better person than all of you below!!! I am white and a Christian.","commenter_a":"I am so disgusted by all the haters. Eating healthy, and fighting childhood obesity benefits everyone in this country; or maybe you would like to pay the medical bills for all the diseases that are caused by lifestyle in this country. Even Trump with all his bragged about billions does not have th money to pick up that bill.","post_message":"She made a beautiful announcement then was called every racist name in the book."}]
