[{"comment_id":"967043476669844","commenter_b":"I heard it was originated by harem members trying to catch the attention of sheiks so fat the women had to do all the work!?.","commenter_a":"There are spiritual aspects to female sexuality, this is where belly dancing comes from...before it was a way for women to show their sexual fertility to their husbands it was a practice done by female worshipers of the snake goddess. Not sure but to me this seems like a modern take on that...in most cases such dancing is done for the benefit of men. But when it is done to express one's sexuality in a personal way, it does have an empowering effect. It suggests that a woman's sexuality belongs to her and doesn't need a male audience to be valid.","post_message":"I never thought a pole-dancing video could be such a tearjerker. Man, was I ever wrong! - Andrea Garcia-Vargas"},{"comment_id":"1226004427434976","commenter_b":"Get rid of her please","commenter_a":"Anyone else would have been fired.","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"10152911718959342","commenter_b":"Start lining up Muslims and illegals until they leave!","commenter_a":"Amen and Amen!!!","post_message":"FIRING SQUADS MAKING A COMEBACK? Utah -- the only state in the past 40 years to carry out a death sentence by firing squad -- is poised to bring back the Old West-style executions if the state cannot track down drugs used in lethal injections."},{"comment_id":"10153546137853352","commenter_b":"Black cop should shoot to kill her ass","commenter_a":"And today in white folks news","post_message":"Tulsa Woman Caught At Funeral Home Cutting Up Face, Hair, and Messing Up Makeup of Corpse Who Once Dated Her Boyfriend"},{"comment_id":"10153539515518984","commenter_b":"The Feds own substantial acres of land in several of these states and when they pass these more restrictive rulings guess what? They exempt themselves from said compliance AND if they choose to return some of said land to the state, guess what? The state is forced to bring land into compliance. Tks AZ for joining with the 26 sister states in this fight.","commenter_a":"It gets worse and worse and yet our congress , senate, supreme court , fbi ,cia all seem afraid, They do not represent the people.","post_message":"These 27 states just made an epic move against Obama's federal power grab... they are not going to let Obama take over their states without a fight.  This is exactly the right move... share their strategy everywhere."},{"comment_id":"1044939055565842","commenter_b":"Watch out for the showers.","commenter_a":"Disrespectful, Ungrateful Cretins!","post_message":"Refugees in Germany are being housed in a former Nazi concentration camp"},{"comment_id":"10153121038682212","commenter_b":"Ugh. You're a woman. Why are you being so dense?","commenter_a":"Isn't there a disclaimer that states not all birth control is always 100% effective??","post_message":"More than 100 women are suing a drug company for a birth control packaging error they say resulted in unplanned pregnancies; three of whom are from Oklahoma. #News9 #CBSNews"}]
