[{"comment_id":"10152742802465950","commenter_b":"How come them crazy coloradians cant just flush them like the new yorkers with their alligators.or the floridians with their boas!! Lol","commenter_a":"Time for some catfish!","post_message":"Someone dropped a few goldfish into the water. Soon, those few fish spawned into thousands."},{"comment_id":"10153078341498812","commenter_b":"Can't we just all agree that Muslims should just be wiped off the face of the earth?","commenter_a":"\"Not afraid.....hey America you guys are still coming right????\"","post_message":"\"NOT AFRAID\" - Thousands in France gather to a send message after Charlie Hebdo attack: @webpagelink"},{"comment_id":"10153488869101636","commenter_b":"I am nothing close to a conspiracy theorist, but doing what I did in the military, I seen how cut throat people could be. Especially if they are scared that information will get out there that will harm them. I'm not saying that anybody did tamper with his breaks, all I am saying is that it is possible. Nobody cut his break line obviously because he would of known, but had some drilled a pin hole in a brake line or reservoir, then sealed it to make sure it didn't leak out while sitting stationary. Then as he leaves the drive way he is still able to brake because there is fluid there to press the caliper in, but it breaks the seal and starts to leak out and he could use the brakes so long that the hydraulic fluid is still able to pressure the system. By the time ...","commenter_a":"I am just throwing it out there but Im pretty sure if his brakes had been tampered with he would have known it after the first stop sign or stop light after he started his car.... They dont pick and choose when to work and when not to work when tampered with","post_message":"Police say the data box from Aubrey McClendon's vehicle registered what was happening just seconds before the crash."},{"comment_id":"10155409638445725","commenter_b":"I hope she goes to hell","commenter_a":"Crazy selfish bitch","post_message":"Attorneys for the woman accused of faking cancer and pocketing thousands of dollars in donations from strangers, family and friends for more than a year, spoke alongside the woman today. What they said about the incident and the woman----> @webpagelink"},{"comment_id":"604244696428800","commenter_b":"Don KorLeone","commenter_a":"son in front look lik Derrick Rose","post_message":"Police are looking for eight males who robbed speakers from a Crown Heights, Brooklyn Family Dollar and attacked an employee with shopping baskets on the way out.   Full story: @webpagelink"},{"comment_id":"912646568790348","commenter_b":"@username i have worked in kane country elections for Dems for 27 years I do my home work ! Bernie only got 8 bills passed in all his 40 years in the sen!!!! Hillary in 4 years got double that!!!! Bernie is ALL TALK NO ACTION!! He is in Bed with the NRA and voted against the brady bill 5 times and voted against amber alert!!! are you kidding amber alert!!!! Now that turns me WAY of Bernie!.And I dont HATE Bernie but Hillary I feel will get the job done and I would love to see what a woman can do!!!! And please dont call me DEAR!!","commenter_a":"Bernie is telling people what they want to hear not what he is capable to really get accomplished.His promises are not doable. They are unrealistic. Hillary has already accomplished many many good things for the poor and the middle class. Bernie is running on our ticket and using us. He is not a democrat and refuses to join our party, and has scorned our party for years. He is a left wing socialist. He voted against the Brady Bill and Amber Alert. He voted to protect the gun corporations and manufacturers against any and all law suits. He said that underage teenage girls should be allowed to have sex with their boyfriends not to get cancer. ( Wierdo) He also said toddlers should be allowed to to explore their sexuality with each other. He refused to serve in our military under concientious objection during the Viet Nam War when 55,000 ...","post_message":"It is clear that the views of the right wing do not reflect the views or the needs of the vast majority of the American people. The Koch brothers and the billionaire class are way, way out of touch with where the American people are."},{"comment_id":"1829596377287822","commenter_b":"I don't think Zippy Goldberg never looked up anything and that's why she always sounds like an idiot that hates America I just hope that if white people finally start rioting , go to wherever she lives to take her things and burn her cars so she can get a feel for what it's really like.","commenter_a":"Who watches that nightlight anyway?","post_message":"Whoopi Goldberg just scolded millions of Americans on The View. Apparently if you voted for Trump, it's because you \"didn't do your homework\" on Hillary."}]
