[{"comment_id":"10152864481646336","commenter_b":"Zeke...you're the kind of kid that gave the bully in school your lunch money every day thinking it would make him like you. Never worked did it. This is a religious war. It's in their unholy book and no amount of appeasement will fix them. Their founders motto was \"CONVERT or DIE\". This is simple stuff. Read it. Understand it and don't give in to it. I admire the cartoonists for their bravery. That COEXIST bumper sticker should be pulled off every car on every liberal college campus and off every Subaru in liberal Minnesota and sent to some Islamist nation. We coexist VERY well. Our early settlers didn't kill the Indians who didn't convert. Our Founders didn't work that way either. We are not the ones who need the lecture. We wrote the book on getting along. They don't care to read it.","commenter_a":"Dear Muslims....COEXIST.... Or get out... or else.","post_message":"They were four of France’s most fearless and best known political cartoonists – all sought out and summarily executed by gunmen in Wednesday's massacre inside the offices of #CharlieHebdo: Stephane Charbonnier, Georges Wolinski, Jean Cabut and Bernard Verlhac."},{"comment_id":"835165216569680","commenter_b":"Don't accept it. Doesn't matter to me. I still have the right to marry...whether you like it or not.","commenter_a":"We Christians do not recognize this, not accept this, just ignore this. Just because MAN says it does NOT mean it is true. God is our Commander, Lord and Leader. Whatever He has stated is so; with His statutes we will stand, and believe Him forever. Look up everyone, for our redemption draweth nigh. . .","post_message":"So much for state rights. Where do we go from here? #SCOTUSmarriage"},{"comment_id":"10153203354164071","commenter_b":"I also voted for Romney and would do it again. The Presidency was 'stolen' from him.","commenter_a":"Vice President Romney","post_message":"Mitt Romney just unloaded on President Barack Obama's foreign-policy legacy."},{"comment_id":"937512336383801","commenter_b":"What goes around comes around ppl remember that !! They will get theres !","commenter_a":"If I find out you were ask and turned them down I wiil. O longer listen to your music. Bon Joni is off my list. Even Adele since she supported Hillary.","post_message":"Seriously?!"},{"comment_id":"10153789938206680","commenter_b":"yes there is, put her in jail.","commenter_a":"Former \"Bush\" defense official??? Go figure!","post_message":"The United States' adversaries, James Clad says, \"must never hear flippancy or ignorance in America’s voice.\""},{"comment_id":"10152956795647093","commenter_b":"Definitely a woman","commenter_a":"She looks like she could be a man in a wig","post_message":"Arlington police would like your help finding a car burglary suspect caught on camera..."},{"comment_id":"1854247478194959","commenter_b":"Why you do this to me","commenter_a":"@username try not to cry","post_message":"Walnut the whippet was not alone on his final walk 🐶😢 #walkwithwalnut (via BBC England)"}]
