[{"comment_id":"1552075435096764","commenter_b":"She is the queen of lies! Talk about incoherence!","commenter_a":"POT CALLING THE KETTLE..........(hiding fear and jealousy)","post_message":"Hillary Clinton went after Donald Trump's ideas, calling them 'dangerously incoherent' and a 'series of bizarre rants, personal feuds, and outright lies.' What do you think?"},{"comment_id":"10153774717459726","commenter_b":"She's an angry heifer","commenter_a":"Cows go... MMMMOOOOOOOOO","post_message":"WATCH: GOP consultant Liz Mair says she's going for big money now to sink the GOP front-runner"},{"comment_id":"752107674943648","commenter_b":"Loretta Lynch is a corrupt dirty rotten scoundrel is about to be charged herself for crime. Why? Stay tuned for more Wikileaks coming to a theater near you.! Loretta and Obama on the hit list for being nasty dirty people who have smirked and abused their positions in the greatest country. They will meet their maker on earth.","commenter_a":"HilLIARy has already admitted guilt and felonious actions??? She has admitted that her staff reviewed all her emails so they could delete her 'Personal emails', right? Since this occurred AFTER she left the government, it is an admission of guilt!!! Why? It is a violation of law to reveal or share classified information with anyone that does not have a current active security clearance equal to or exceeding the classification of the material. Further it is required that the person have a 'need to know' even if they have security clearance. Since her staff has neither a current and active security clearance or even if some did they did not have a need to know. Since it is now known that some of those emails were Top Secret SAP it is virtually certain none of those staff were listed as having access. The argument that none of the released emails ...","post_message":"President Bill Clinton – whose wife is currently in the crosshairs of the Justice Department over her use of a private email server – met privately with Attorney General Loretta Lynch."},{"comment_id":"10154429082261378","commenter_b":"Yes...fix her a$$...so she can't bring any more babies in the world...","commenter_a":"Yes","post_message":"A judge ordered a drug-addicted mother of 4 who has worked as a prostitute not to get pregnant again. Is this order fair?"},{"comment_id":"10153862268256680","commenter_b":"'@username I was waiting for Hillary to pass out again and need to get dragged off stage. Maybe next debate!","commenter_a":"He wasn't great we can admit that but he just needs to show he can sit in the chair and he more than did that!","post_message":"Donald J. Trump is used to audiences that are already primed and ready, unlike the debate crowd."},{"comment_id":"10158064309830354","commenter_b":"She's so ugly!","commenter_a":"she looks like a dude to me. this not a real female.","post_message":"Poisoned coffee on the day of the debate???"},{"comment_id":"10153754092626051","commenter_b":"Suck it up bitches!","commenter_a":"Why don't we buy them cars and houses, too? (shakes head sadly)","post_message":"California is moving forward with a bill to grant undocumented immigrants access to Obamacare. Are you for or against the move?"}]
