[{"comment_id":"10153759354128352","commenter_b":"She's a slut","commenter_a":"U can tell exactly who the sluts are on this post lol all the women who are defending her..","post_message":"Woman who was ‘slut shamed’ after her public threesome at Calgary Stampede went viral says she has no regrets – in video seen by 3.4million"},{"comment_id":"10156329985125354","commenter_b":"Stupid Hoe","commenter_a":"One Day ,,,Every Knee Will Bow and Proclaim Him Lord, including you Ms,Johansson...that is the day you will give an answer for this horrible mocking of Gods word you have done","post_message":"Surely Scarlett Johansson is working on a Koran version as well. Surely that's happening, right?"},{"comment_id":"10153637483924714","commenter_b":"White people rock!!!","commenter_a":"^^^when the police start killing your people and getting away with it then you tell how how to protest/feel #nojusticenopeace","post_message":"Philosopher and activist Dr. Cornel West was arrested during a demonstration outside the Saint Louis federal courthouse."},{"comment_id":"10154142250393132","commenter_b":"Ugh. Disgusting human being. She should be on the sex offender registry.","commenter_a":"You woman are the epitomy of stupid!","post_message":"Grace Riedlinger, 21, is charged with capturing an image of nudity without consent."},{"comment_id":"10153070699666028","commenter_b":"Cuz ur DUMB","commenter_a":"No vote here !!!!","post_message":"\"I have a great relationship with the Mexican people\": Donald Trump tells NBC in an interview that \"there's nothing to apologize for\" regarding his comments made about Mexican immigrants last month. He says he believes he will win the Latino vote. \"I will create jobs and the Latinos will have jobs that they don't have right now. And I will win that vote.\" @webpagelink"},{"comment_id":"1019297701444035","commenter_b":"Fix it or pay the consequences rich people.","commenter_a":"What I want to know, is why in the hell is the contractor, not a American company but one from the UK ?","post_message":"This worker does everything right. He works hard, and all the time, and he still can't feed his kids without food stamps. Why does the Senate allow this?"},{"comment_id":"10153801598562042","commenter_b":"God this makes me sooo angry I just want to cry and beat the crap out of her. She is a monster and deserves the death penalty!! Rip Little Angel!! 😢","commenter_a":"And That POS is pregnant again","post_message":"DISTURBING DEATH: A mom allegedly punched her 2-year-old repeatedly in the stomach and the child was found dead the next day. What the mother later admitted to police is horrific ..."}]
