[{"comment_id":"10154245788639060","commenter_b":"\"Women: Kill yourselves.\"","commenter_a":"Rename this rag to The Feminist. I'm sure that there was something else happening in the world today more important than finding another excuse the use the word misogyny in an article. Generally more men die in every society than women by an order of magnitude. Women have a lot of catching up to do to meet those equality of outcome goals.","post_message":"The murder of a young woman in South Korea has prompted hand-wringing over festering misogyny in a country that ranks near the bottom of the pile for gender equality"},{"comment_id":"10158310227560389","commenter_b":"I think they are GRRRRRRRREAT!!!!! For the first time in my adult life, in a long, long time, I feel very proud to be an American!!! President Trump has done more in his first few days, than Obama did in 8 years!!!! Thank God we are rid of Obama and his family!!!","commenter_a":"He is doing great as we expected doing what he said he would do !!","post_message":"Question of the Day: What do you think of the moves President Donald J. Trump has made so far?"},{"comment_id":"552487634912815","commenter_b":"Your racist dumb fool he's not understanding the concept on the purpose for building the wall","commenter_a":"your not going to stop drugs coming in with a wall, they have already proven that for the last 20 years. there are inventions like aero lights, tunnels, submarines. and boat. not to mention all the ways they catapult drugs over already. your all stupid for supporting this waist of tax payer money. not forgetting all the jobs they do that you office pussys wont and can't do because you have no back bone.","post_message":"Do you agree with Bill O'Reilly here?"},{"comment_id":"955678404472632","commenter_b":"Hey Christie, are your kids vaccinated? FOOL!","commenter_a":"Sooo, Chris believes that parents should have a Choice...wonder how far that goes beyond vaccination...","post_message":"Gov. Christie: “Not every vaccine is created equal, and not every disease type is as great a public health threat as others.”"},{"comment_id":"886538858047877","commenter_b":"My corner gay bakery wouldn't bake me a vagina cake......... The USA is goin to shit","commenter_a":"Most of the people commenting here have no concept of freedom. The beauty of America is if you don't like the way one busines does thongs, you can go to another. Using government to force people to comply is not Freedom. Should a gay baker be forced to make a cake for an anti gay group? This is a continuing attack on the rights of American's in general, just like telling businesses the can't smoke in them anymore. Just because a business is open to the public does not mean every person has a right to frequent there no matter what.","post_message":"How do YOU feel about this case? Should government be able to force businesses to do things against their will by writing legislation? What do YOU think?"},{"comment_id":"858336867535069","commenter_b":"Good for her Muslims need to go back to their own country and stay there. Stop pushing their laws on us. And stop giving into them","commenter_a":"move go back to your country","post_message":"#Sharia comes to Texas?   Not this time!"},{"comment_id":"10153021059601051","commenter_b":"What a cruel woman","commenter_a":"All I can say, is he is better off without her for a mother.","post_message":"This baby's mom decided she didn't want him anymore and had him deported."}]
