[{"comment_id":"10152979533166438","commenter_b":"I love Katy, But I did noticed that and it made me laugh. She has no swag! But I think that's part of who she is she knew she couldn't dance for shit but she went and did her thing with a fresh face.","commenter_a":"What makes me laugh is how people are talking about the shark... Did we not notice Katy herself completely unable to move as a quasi-good dance partner with Elliott's dancers?!?!","post_message":"\"We should leave Left Shark alone.\""},{"comment_id":"10153149110684877","commenter_b":"Yes, she should be arrested. This type of crap gets people killed.","commenter_a":"She deserves prison time.","post_message":"Woman claims she was attacked by black men, allegedly faked injuries with makeup. She TRIED it! You have to see the pics for yourself.   Grio fam, should authorities press charges if it's proven she faked her claims? Sound off below!"},{"comment_id":"10153620963073984","commenter_b":"When will Americans wakeup to the fact that Hillary is for Hillary and she don't give atinkers damn about anyone else!!! She BITCH!!","commenter_a":"Who in their right mind would vote for her???","post_message":"As cynical as I may be about politics, I just don't see how Hillary can survive this avalanche of scandals.  Do you think Hillary is destined for the ash heap of history?"},{"comment_id":"10153247740094411","commenter_b":"Suck it up mother fucker","commenter_a":"När Israel skrotat alla sina atomvapen, har dom först då, rätt att ha trovärdiga synpunkter.","post_message":"BREAKING"},{"comment_id":"1644783155547189","commenter_b":"Not busted, she's been padding HER wallet for a L-O-N-G time! You guys are way late to the game..try doing some reading, I knew this, long ago!","commenter_a":"Meanwhile @ Standing Rock! Energy Transfer Partners, WHISPERS TO THE PROTECTORS YOU CANNOT WITHSTAND THE STORM.TULSI GABBARD, US VETERANS AND THE PROTECTORS WHISPER BACK \"WE ARE THE STORM!!!","post_message":"Busted!"},{"comment_id":"448351221956139","commenter_b":"I'm from Texas and Perry has done a good job for jobs and everything else, except shutting the border down. He gets an F for that...........","commenter_a":"Trump,Rick Perry is a very bright man.He lead Texas very good for many years.","post_message":"It seems that Donald Trump has now turned his attention to this rival GOP candidate."},{"comment_id":"10153182888819060","commenter_b":"Run, Kamala, run!","commenter_a":"@username - her Agenda is TO REPRESENT US, CALIFORNIA, in Washington, D.C., UNlike the Republicans who spout \"The American People Want\" yet they ( GOP ) go for what the 1%ers want.","post_message":"“An entire generation of Democrats, who have been waiting for this moment for years, took one look at Kamala Harris, and quickly backed off.” For the first time since 1992, California has an open Senate seat and only a Democrat can win. That should have been the cue for an almighty dust-up. Yet, one by one, a billionaire environmentalist, a former mayor of Los Angeles, and the lieutenant-governor, have all stepped aside so there is only one serious candidate. Are they scared? Yes. And they have every reason to be: Ms Harris is an intimidating opponent. The daughter of an Indian cancer researcher and a Jamaican economics professor, she is the first woman, first African-American and first Asian attorney-general of California @webpagelink"}]
