[{"comment_id":"10152983591416491","commenter_b":"Lena did it for 10 yrs. She's gross!!","commenter_a":"Lena was seven. Not 14 or 15. And Duggar raped his own sisters many times over many years. And who the hell is Palin? An irrelevant person seeking relevance.","post_message":"“I’m sickened that the media gives their chosen ones a pass for any behavior as long as they share their left-wing politics.”"},{"comment_id":"10153413521069255","commenter_b":"Loose lips sink ships.","commenter_a":"Santorum doesn't even know that the Pope is in fact a scientist! He is a chemist! Santorum is the idiot!","post_message":"Yes. That Rick Santorum said that."},{"comment_id":"776537535808625","commenter_b":"Bitter and jealous? Suck an A.","commenter_a":"you look like you eat porridge for breakfast from a silver spoon, bro","post_message":"The waiters had a little fun with me this AM. #nailsforbreakfast"},{"comment_id":"10153639382745950","commenter_b":"Clever ladies..some of those pre rape drugs put you out for life.","commenter_a":"Good job ladies, we gotta stick together as women or we'll all parish to the hands of the evil ones. May GOD bless them all","post_message":"It doesn't matter if you're a friend or a stranger. When these 3 women noticed a man allegedly slip something into his date's drink, they couldn't just sit there and watch it happen."},{"comment_id":"10153001294901636","commenter_b":"Yes they do!! So it's just one person that has sex with all these people?? Or different girls?","commenter_a":"I think it would be funny to see all these people exposed!!! You shouldn't be cheating. Even though your not doing it in person and physical contact, your still cheating talking to that person if your other half doesn't know about it!!!","post_message":"A dating website that helps married people cheat has been hit by hackers who threatened to release information about millions of customers."},{"comment_id":"1312061745499049","commenter_b":"You two are makeing it hard for people that are serious about their beliefs your making them look bad,so knock it off!","commenter_a":"#Theydontrepresentme","post_message":"\"After sharing my thoughts about the recent Women's March on Facebook, rabid feminists quickly attacked, displaying their 'tolerance' as they 'lovingly' called me a twat and worse. That didn't bother me. What irritated me was the 'We did this for you' remarks. Before these feminists march for me again, there's something I want them to know.\" @webpagelink"},{"comment_id":"873971869318028","commenter_b":"You can hack those toys so easily","commenter_a":"Junior Marquina Perez & @username I WAS NOT ABLE TO SEE YOUR REPLY :'(","post_message":"Do your kids like the Minions? One family did a double take after hearing their 5-year-old daughter's McDonald's Happy Meal Minion toy speak:"}]
