[{"comment_id":"1311796595543533","commenter_b":"#DontBoo #VoteHillary #NastyWomenVote","commenter_a":"we are not going backward, we are going forward , Best of luck The world President @username \"I am sick and tired of the negative, dark, divisive, dangerous vision and behaviour of people who support Donald J. Trump","post_message":"Don’t miss out! Join them: hillaryclinton.com/makeaplan"},{"comment_id":"775477502501275","commenter_b":"I agree with Mark Colwell.one muslim won't go against the other.they are all for crap..","commenter_a":"Gee, really, and what would they do if he made them angry? Another Dem moron speaks in defense of her Beloved Leader and what she says is as stupid as they both are. How do these people get through even elementary school being this dumb?","post_message":"And this is what Democrats think about terrorists... #facepalm"},{"comment_id":"10155525671531002","commenter_b":"@username It is my business when it is my tax dollars going to feed you .","commenter_a":"If you can eat it and drink it why is it anyone's business what you buy. I don't care and by the way, congress uses a food budget bigger than anyone that has food stamps can we say what they are allowed to use it for?","post_message":"A recent U.S. Department of Agriculture report on food stamps found soft drinks account for 5 percent of dollars spent on food."},{"comment_id":"10153733743438606","commenter_b":"Human nature wants us to create Heaven on Earth where everything is perfect and explained (No disasters, illnesses, wars, and sadness). That's exactly WHY people are sad and sick and at war. They can't reconcile it. I have no clue why bad things happen. But I do have my faith in God. I wouldn't dismiss for a moment why you feel your way. I hope you won't dismiss mine. I just can't see Bill Nye explaining this to me? I sincerely hope you have a great day 🌺","commenter_a":"You figure he wouldn't have orphaned and separated them years ago in the first place then.","post_message":"INCREDIBLE STORY! Two orphaned sisters separated decades ago in Korea have been reunited after miraculously getting hired on the same floor of a Florida hospital ----> @webpagelink"},{"comment_id":"10153520610884705","commenter_b":"this is a joke , seriously , he would probably kill her. That would be sad.","commenter_a":"I like her she's a hell of a fighter but Mayweather would make mincemeat of her quite quickly","post_message":"Ronda Rousey says she'd beat Floyd Mayweather (and anyone else) in a no rules fight."},{"comment_id":"844439005656552","commenter_b":"breaks my heart to see what my son and brother actually see. These people don't just mad out on red and green. When they see anything that has a red or green in it. They don't see it with the colors they can interpret. So nothing is as it should be. You need red to Make purple, purple doesn't appear the way the rest of us see it for them.","commenter_a":"Sylvain St-Arneault","post_message":"Watch people see color for the first time thanks to these high-tech glasses."},{"comment_id":"10152871405466717","commenter_b":"I remember seeing this it really touched my heart loved it!!! And those moms can suck it!","commenter_a":"Moms... eat shit and die! Hypocritical, bigoted ass-holes..... 1,000,000 Moms = about 12 homophobic morons!","post_message":""}]
