[{"comment_id":"10150572291974999","commenter_b":"Ok head in a pressure cooker, she chop the guy? that is cold, women have alternatives like \"the police\", runing away, any place she runs to will be better than prison for life or death. So she did the crime, now do the punishment she had her choice.","commenter_a":"....she killed the guy, put his head in a pressure cooker and then chop the rest of him before telling anybody. Do you know how long that must have been? china did exactly what was right and her sentence isnt harsh at all. Anyone asking for a lighter sentence is out of their mind. She needs to sit in jail for a while and maybe see a head doctor.","post_message":"Women in China who killed abusive spouses were once routinely executed, but as the scale of domestic violence began to emerge in the early 2000s — officials say one in four marriages is affected, activists say one in three — lengthy prison sentences became the norm instead."},{"comment_id":"10155206212838984","commenter_b":"It could also be that the libertards Have No Taste! They don't know a Good Thing When They See It!","commenter_a":"For the life of me , I cannot understand the obsession all these small minded liberals have with the Trump family. Is it jealously ?? You can't possibly spend that much time dwelling on people you don't even know. Lots of people weren't happy with the Obama presidency or his crude wife, but they didn't spend every waking moment stalking them, writing fake news about them. At this point I have serious concerns that there is a mental health epidemic in this country as far too many people are consumed with hatred that has no true origin. Hopefully the pharmaceutical companies can keep up with the demand for medications that clearly need to be prescribed.","post_message":"Maybe now this reporter will think twice before attacking the first lady."},{"comment_id":"875277045852257","commenter_b":"You are a woman your body is naturally designed to bear children. It is worse when you make the choice to get pregnant.","commenter_a":"Most pro-aborts know there is an actual baby being killed. 99 percent of them have never had an abortion, yet have no problem telling others it's perfectly okay to have one. Pro-aborts are sick people.","post_message":"When was the last time you saw a baby announcement like this?"},{"comment_id":"10150532816329999","commenter_b":"It's also ingrained that we're each other's competition. Women don't hate each other naturally any more than men do. That's nurtured behavior. If we support each other more, things will change. This goes on all fronts. I can't tell you how many housewives hate me just b/c I'm not a submissive woman who pushes out kids and reads mommy porn (those ideas are also ingrained on far too many women-in the year 2015...)","commenter_a":"I've definitely seen it and it's so ingrained that a lot of people don't notice.","post_message":"When a man talks in a meeting, he gets heard, but when a woman does, she gets interrupted, Sheryl Sandberg and Adam Grant write. Have you experienced gender bias at your workplace? If so, how have you dealt with it? Share your stories in the comments, or within the article."},{"comment_id":"1059194827547028","commenter_b":"He is not even their president. Or that is what their signs say. Besides, they will not be part of the US for much longer.","commenter_a":"Richmond? Bwahahahah! Crime central.","post_message":"So this just happened..."},{"comment_id":"10153638033307377","commenter_b":"dumb@$$","commenter_a":"Sooooo, did Michelle Obama use any words that Laura Bush used? Hmmm a good listen.","post_message":"Bill Kristol, editor of The Weekly Standard, has delivered an eleventh-hour pep talk to Republicans."},{"comment_id":"10154343689874094","commenter_b":"People know who she is. She will get whats coming to her","commenter_a":"Hopefully she'll get caught out on a camping trip and be torn apart slowly by wolves.","post_message":"Roadrunner the dog's injuries were so severe that a veterinarian had to remove his eyes."}]
