[{"comment_id":"488312324683981","commenter_b":"Hmm if firearms are a replacement for a small penis what are females replacing with firearms @username???","commenter_a":"Gun Worship in The United States of Guns is Killing US...","post_message":"SCARY!!"},{"comment_id":"10155080825746037","commenter_b":"Andrea ... it is scientific fact that bees couldn't fly without wings, but, pull the wings off of that bee and it is still a bee ! Semper Fi","commenter_a":"There is a scientific basis for being transgender. The brain's gender identity and the genitals develop at different times in utero. So mismatches due to hormones are possible. If God knits these children together in the womb, He must do some transgender knitting. A boy who goes through a phase of wearing a dress is entirely different than a boy who persistently and insistently over a number of years says he is really a girl. Psychologically, it is best for these kids to use modern medicine to enable their outsides to match their insides.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154533840951509","commenter_b":"well you certainly are a hateful person!! Jealousy is a evil trait poor girl.","commenter_a":"I dont know if rock hudson was at the gates to meet nancy reagan if she even made it shame shame shame on you nancy","post_message":"1980s star Mr. T did not pity the fool as he recalled his seemingly odd-couple friendship with Nancy Reagan."},{"comment_id":"10155314611590652","commenter_b":"hahaha! this is amazing","commenter_a":"'@username apparently the jar of mayonnaise episode anticipated this.","post_message":"'Life is best when it's a bit strange.'  This weird new reality show has millions of people pretty much watching paint dry:"},{"comment_id":"10154254253351336","commenter_b":"She's Nasty !","commenter_a":"White guilt is a real thing. Sad but true.","post_message":"“I’m a white lady. I’m an easy target,” Melissa Click said in an article."},{"comment_id":"10153817478256320","commenter_b":"'@username he will never be a woman","commenter_a":"Um. No. Besides i hear she doesnt even want to be a woman anymore.","post_message":"Happy Birthday!  Caitlyn Jenner celebrates what she considers to be her 'first birthday.'"},{"comment_id":"1537745596485739","commenter_b":"Got it STOCKINGS !!!!!!","commenter_a":"salt","post_message":"Riddle of the day! What is it?   Quiznatic Media"}]
