[{"comment_id":"10153436699476337","commenter_b":"Yea and he's got a fake pussy.","commenter_a":"No one here read the article did they? She's not being called out for being a white NAACP supporter or for \"not being black enough\", she's being called out for lying about being black. She's totally not black at all. She's a white woman pretending to be black saying that she grew up poor, black, and racially profiled. When she wasn't. At all. -_-,","post_message":"HOW DOES THIS HAPPEN? Is this NAACP leader pretending to be black? Many on the Internet certainly think so..."},{"comment_id":"10152606580602434","commenter_b":"The \"greedy bitch\" is a man.","commenter_a":"Getting married doesn't automatically entitle you to gifts or money, your guests will give what they can, if they can but surely their attendance is more important than receiving things from them? This is the most jacked up article I've read in a long time, far too much misdirected vitriol. Hope this greedy bitch gets nothing! Equating the whole situation of gift/money giving to 'living in sin' is so ridiculous and the amount of times people are directly cursed out is excessive. If you wanted to express your opinion so badly, you should have learned how to write first. Bridezilla!","post_message":"These people often fall in the same group as elitist jerks who think getting a dress from David's Bridal is \"tacky.\""},{"comment_id":"10153523399935329","commenter_b":"And a lets get a pug","commenter_a":"@username I want a bear","post_message":"THIS GUY!"},{"comment_id":"1038817212861551","commenter_b":"My gurl !!!!","commenter_a":"President Hillary Clinton","post_message":"\"Don’t let anyone ever tell you that this country isn’t great.\" - Michelle Obama delivers an emotional testimony to the greatness of the United States of America. @webpagelink"},{"comment_id":"705783696236172","commenter_b":"No ovaries. Only clitoris.","commenter_a":"The clit and ovaries.","post_message":"Most of you are, or will be, very familiar with it. But it looks very different than you might imagine."},{"comment_id":"10152748268571491","commenter_b":"No","commenter_a":"Ok ill tryit..... When will the coffee maddness end????","post_message":"If you’re still hungry after your meal."},{"comment_id":"10154534822598132","commenter_b":"The only way,she should have stop him is by calling the authorities. She need to go to jail,knonkle head","commenter_a":"She is as guilty as that stupid dude!!! She knows a thing or two she should be charged!!!!","post_message":"The second wife of #Orlando killer Omar Mateen has reportedly said she pleaded with him not to do anything violent."}]
