[{"comment_id":"1086019278181113","commenter_b":"She's going to crush her opponent into Cheeto Dust. BYE ORANGE FELICIA","commenter_a":"BS","post_message":"Democratic presidential candidate Hillary Clinton will be speaking at an early voting rally in Cincinnati, Ohio."},{"comment_id":"10153055275424877","commenter_b":"How can a woman rape a man..??","commenter_a":"interesting turn of events","post_message":"Mother of 3 arrested for breaking into a man's apartment and raping him while he slept. Grio fam, if she was a man do you think her sentencing would have been more severe? Sound off below!"},{"comment_id":"10153866703120575","commenter_b":"Yeah she has hate written all over her face. Smug bitch","commenter_a":"Megyn's dislike of Trump is obvious.,and a bit over the top, clouding her Demeanor, Neutrality, and Professionalism.,she may have to pay the Piper if Trump goes all the way,!! Though, I don't feel Trump is a Vengeful person,!!","post_message":"66,000 Signed Petition to Boot Megyn Kelly from FOX News Debate!"},{"comment_id":"10153313566903908","commenter_b":"Like the symbolism...but don't know about using it as a flag...we tend to fly flags when we want to differentiate our selfs from others...this differentiation leads to conflict and destruction...no flag","commenter_a":"I see that beautiful symbol as being interconnected and one. Almost reminds me of the flower of life or a lotus","post_message":"This could become the flag that is used to represent our planet as a whole when we travel to other worlds. It was designed to \"evoke the feeling of global community in people all over the world, reminding us that we all are connected and should take care of our home planet and each other.\" Sacred geometry, anyone?"},{"comment_id":"10153047179381323","commenter_b":"Katie price is entitled to exactly the same as everyone else she is a British citizen who pays her taxes so she and her children are entitled to use the Nhs. Maybe we should be concentrating on people who arnt entitled coming to this county just for the benefits and Nhs and maybe the government should be claiming back the millions we loose in this way. I don't expect Katie price or other celebs are a drain on our economy as some people who claim benefits with no intention of ever working.","commenter_a":"The benefit system isn't struggling & costs being cut because of Katie Price, it's struggling because of the generation of freeloaders who see Benefits as a career choice, people who can work & pay taxes but don't; If everyone in this country that can work had the right work ethic we wouldn't be in half the mess we are. I was always brought up benefits are for those who need it for clothes, warmth, food, the essentials - including specialist care for the disabled, people nowadays have full sky packages watched on 50\" tvs, have a social life and go abroad for holidays all from benefits, where's the incentive then to get off their backsides and go to work. Whilst I'm not her biggest fan Katie price pays much more than her fair share in tax, she's a grafter & a worker, her son deserves his benefit rights in return","post_message":"\"This is exactly why universal benefits matter. Defend the right of mothers of disabled children, such as Price, to get help, and it reinforces the rights of everyone else. That’s how society works. Strengthen one pillar and the other gets bolder; weaken one and it won’t be long before they all start to crumble.\""},{"comment_id":"999294776794334","commenter_b":"An epic read to do at 5.45am but i feel it went nowhere","commenter_a":"Sean Weir @username","post_message":"What if you found out there was a key that would enable you to open and close your doors of perception at will, void of psychedelics? What if you found out you not only held the key, but you were the key? Would you unlock the doors, or keep them shut? This is a good read."},{"comment_id":"10153847730226336","commenter_b":"Those widows aren't afraid to strap on a vest and blow innocent people to pieces ...#mrpresident","commenter_a":"He could never win a debate with Cruz.","post_message":""}]
