[{"comment_id":"1717801081829837","commenter_b":"Crazy lady.","commenter_a":"go Killery.","post_message":"Is this hypocritical? WATCH: Hillary Clinton called out Donald J. Trump for his lavish lifestyle, despite living in luxury herself."},{"comment_id":"10155243196880354","commenter_b":"If the border is not closed these terrorists will continue to come into America!!!","commenter_a":"Save the taxpayer some money and just shoot them. Don't tell the world, just shoot them and be done.","post_message":"Meanwhile, as Obama was snapping selfies...."},{"comment_id":"1676979775916397","commenter_b":"IF TRUMP CANT HANDLE SOME FEMALE MODERATOR HOW THE HELL WOULD HE HANDLE WORLD LEADERS? GIVE ME A BREAK. DONT EMBARRASS THE REST OF THE COUNTRY NH!!!","commenter_a":"New Hampshire vote for him! Trust Trump! Thank you for volunteers!","post_message":"I enjoyed a great breakfast at the Airport Diner! Everyone get out & vote in New Hampshire! Lets MAKE AMERICA GREAT AGAIN! Voting questions? @webpagelink"},{"comment_id":"10152911365806336","commenter_b":"That's NOT truth.....","commenter_a":"Open carry does not apply to black men.. No one wants to admit it, but it's the truth..","post_message":"A Florida man thought he was acting heroically for tackling a man with a gun at Walmart. Instead, the vigilante ended up in handcuffs."},{"comment_id":"10153440859824411","commenter_b":"Fascists? LMAO!","commenter_a":"Both obama & hillary are fascist pigs !","post_message":""},{"comment_id":"10153785925861130","commenter_b":"So disgusting! Foot kiss'n Catholics just turn my stomach.","commenter_a":"Some people on this post are so stupid. Read the bible that is if you can read. Jesus washed feet. And the pope is just trying to be as Christ like as he can be. Some of you really need to follow his example. That is if you are not to ignorant","post_message":"Pope Francis says regardless of religion, we're all \"children of the same God.\""},{"comment_id":"10152556429696680","commenter_b":"I think it has been established that there would be a guest worker allocation. I am more concerned with the 40% of Illegals that are OVER stayed Visa workers! They come here on Visitor,Student and Work Visa's and don't leave when their term limit is up!! They are taking jobs from all levels of American workers!!","commenter_a":"In the meantime how about passing E-Verify and prison and fines to those employers that hire illegals??","post_message":"The House might have to delay consideration of its border security bill until the middle of February. @webpagelink"}]
