[{"comment_id":"1792810264314039","commenter_b":"Encoded in every religion is the belief of the family unit,man and women create children and society moves on. The radical notion that homosexuals can reproduce and create this dynamic is laughable and should not be lauded as some great thing for society. Man and women really do have different roles in society and its quite apparent no matter how society wants to change it. Secondly, racism is flat out wrong but we are doing a damn good job for a country so young with diverse groups of people.Religious freedom made this country and most of its core tenets come from the Christian bible and not the quran or any other text. Churches should be taxed if they become political and held to task on their beliefs in the marketplace. The past 8yrs tried to change America but Americans bit back and won.I am not talking political just basic morality ...","commenter_a":"Let's get rid of tax free status for churches.","post_message":"What a great idea. Let's end the separation of church and state. Let's convert religious organizations into political organizations. Let's funnel dark money funds raised by religious organizations into political campaigns. Let's sanction racism, sexism, homophobia and other forms of discrimination under the guise of \"religious freedom.\" This absurd and unconstitutional idea must not be passed by Congress."},{"comment_id":"10154024812315470","commenter_b":"Lol, whatever you have to tell yourself... moron.","commenter_a":"Seeing how anti-science Bernie is and how his followers uncritically swallow his anti-science stand I wouldn't be shocked by the numbers that try this.","post_message":"BE ON THE LOOKOUT! A picture going around on social media looks like an ad supporting Bernie Sanders, offering instructions on how to make so-called Bernie Sanders glow sticks. The recipe is actually for a deadly chlorine bomb."},{"comment_id":"974467552593717","commenter_b":"Fuck this cunt","commenter_a":"Love you Barbara...","post_message":"Senator Barbara Boxer, in 20 minutes, gave the BEST smackdown to the GOP I have ever seen -- calls them a \"national disgrace,\" and tells them to end their \"hostage\" taking of the DHS because of their \"hatred for the president.\""},{"comment_id":"10153666146819099","commenter_b":"Shut up you dumb broad","commenter_a":"Get guns off the street. It's time for stricter gun laws.","post_message":"A 30-year-old wanted criminal with 12 prior incarcerations allegedly shot a 33-year-old NYPD officer in the head in East Harlem, authorities say ----> @webpagelink"},{"comment_id":"1672968102966647","commenter_b":"@username If she's 201 lbs I'm a dolphin.","commenter_a":"Plus sized? She's not even rubenesque. A way to help Sports Illustrated tell if their model is plus size or not to ask ask \"if we don't tell people she is plus size, will anyone know?\"","post_message":"A trailblazing move by Sports Illustrated Swimsuit."},{"comment_id":"10153754020631337","commenter_b":"Little Crybaby Bitches....aww","commenter_a":"Mets fans are always crying.","post_message":"'AN ABSOLUTE SCUMBAG': Folks were not happy with Chase Utley's slide against the New York Mets, to the point that they almost went too far..."},{"comment_id":"10153263550734205","commenter_b":"Sure @username","commenter_a":"Not every Muslim is a terrorist, but most terrorist are Muslim. It's science.","post_message":"Man Bullies Muslim At Town Hall"}]
