[{"comment_id":"786447821458391","commenter_b":"And that woman belongs in a jumpsuit behind bars so what's your point","commenter_a":"Only people with dignity responded! The rest???? This man belong to a mafia organization! Not the White House!","post_message":"Former anchorman Dan Rather has issued a challenge to his colleagues: \"This cannot be treated as just another outrageous moment in the campaign.\""},{"comment_id":"10153166751996336","commenter_b":"CIA is the source of evil, they create such groups like ISIS, Al-Qaida to fight its dirty proxy war in other countries","commenter_a":"Haha go ahead smash the headstones. They are just mad the one thing they can't take is our eternal life with Jesus.","post_message":"ISIS continues with their calculated campaign of terror across the Middle East, destroying Christian graves in the Iraqi city of Mosul."},{"comment_id":"952954108073344","commenter_b":"Freaking Cowards !!!!!!","commenter_a":"My heart and stomach hurts..This has to stop and stop now..whos going to do it?..Not Obama cause hes one of them..This madness must stop","post_message":"BREAKING: This is the face of EVIL..."},{"comment_id":"10154700417126323","commenter_b":" This is why women worldwide have body issues. Because nasty bitches like this one feel it is their duty to mock and body shame. Well shame on her for bringing the world down a notch in my estimation...","commenter_a":"'It's not the person I am' well it is love because you took the picture and posted it. Goes to show beautiful on the outside not at all on the inside.","post_message":"A Playboy model who used social media to body shame a 70-year-old woman at her gym was charged with invasion of privacy by the Los Angeles city prosecutor on Friday."},{"comment_id":"10156410445115354","commenter_b":"Rebecca the clan was founded in 1865....u ignorant slut....","commenter_a":"If this paper had any business sense and compassion, they would fire that guy.","post_message":"When you see the CARTOON mocking Republican Gov-elect Matt Bevin's adopted children from Ethiopia, just remind yourself: it's only racist when attacks are against Democrats, not Republicans."},{"comment_id":"10154807734390115","commenter_b":"Marcia, Dont insult the neanderthals by comparing them to prolifers. 😂","commenter_a":"Wow, some one just said men cause pregnancy! Considering it take two haploid cells to make a child.","post_message":"LIVE: Planned Parenthood supporters hold a rally outside the St. Paul, Minnesota, headquarters alongside Planned Parenthood protesters."},{"comment_id":"10153253183992690","commenter_b":"Hispanic Race Mexican Race Human Race Everyone is a Race!","commenter_a":"I do not hate Mexicans! So get that straight! Illegal alien does not necessarily mean \"Mexican\"! Seriously????","post_message":"A former Texas DPS employee at the Irving office is sentenced Thursday for selling driver's licenses to dozens of unauthorized immigrants. @webpagelink"}]
