[{"comment_id":"1505305382822543","commenter_b":"Well i guess that's better than a illegal immigrant..","commenter_a":"Don't judge maybe that's his girl","post_message":"At least both the driver and the 'passenger' were wearing seat belts."},{"comment_id":"1213125935366328","commenter_b":"This old hoe has lost her mind.!!","commenter_a":"You can be the first one to be unprotected! Have your security do without their weapons to protect you & Bill!","post_message":"Hillary Clinton, front-runner for the Democratic Party presidential race, heartily endorsed the idea of high taxes for gun sales, along with high fees for gun dealers."},{"comment_id":"10153169832344087","commenter_b":"Can you give an educational description of what is a liberal and a conservative","commenter_a":"Maybe he should have gave the same talk to the average liberal they are after all at the same mental stage as a second grader","post_message":"“The congressman chose to give an example of the current situation in Iran, and made some inappropriate comments about ‘Do you know what a nuclear weapon is? Do you know that there are schools that train children your age to be suicide bombers?'' one parent said."},{"comment_id":"10153494400717093","commenter_b":"They some hoes","commenter_a":"'@username Mayra Castaneda","post_message":"Instead of going into a legal battle, the Dallas owners want the public's help picking a new name for the restaurant. @webpagelink"},{"comment_id":"1697499920518952","commenter_b":"Um that's the point! Either way a wall effects their economy and they don't want it! As far as causing more immigrants to come here, that's the benefit of the wall! How stupid can people to to listen to and believe the lines off bullshit that people like oboma feed us?!","commenter_a":"fuck obama","post_message":"Here ya go...  WATCH:"},{"comment_id":"10154276196928128","commenter_b":"more like a buzzard ,she will eat america alive","commenter_a":"People seem to forget!! This is what happens when you mess with the Clinton's!! You can share this from my page if you want. And I did not write this I copied it from someone else that posted it. And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clintons convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown .. The murder happened just after she was togo public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock ...","post_message":"Aaron David Miller asks: Is Hillary Clinton's hawkish past an accurate indication of how she would behave as president?"},{"comment_id":"10153774717459726","commenter_b":"She's an angry heifer","commenter_a":"Cows go... MMMMOOOOOOOOO","post_message":"WATCH: GOP consultant Liz Mair says she's going for big money now to sink the GOP front-runner"}]
