[{"comment_id":"10153527225684255","commenter_b":"pre-civil rights and more white privilege.","commenter_a":"War. Environmental disdain. Injustice for all but 'ordinary white folks'. Coat hanger abortions. Dirt roads. Family 'secrets'. Weapons. Vigilantes. Klansmen, those gallant white knights of chivalrous times. Tarring and feathering of \"revenues\". Constitutionally inspired militia to kill picketers and whining war vets. Cold hearted popes. Freedom to convert Jews to Jesus by whatever means necessary. Make hatred cool again.","post_message":"What do they mean when they say that? To which supposed golden age of America do they want to return? Who can say what is in the hearts of such people? #DailyKosClassics By Daily Kos user Steven D"},{"comment_id":"1122936174469300","commenter_b":"That fat lady will sing in the end, just wait","commenter_a":"I'd never vote for ANY republican, but when it comes to one-liners nobody beats Trump. His smack-down of Hugh Hewitt was epic, and Trump argued well taking on both Rubio and Cruz at the same time.","post_message":"Romney insists Trump's reasoning is an excuse."},{"comment_id":"10153998219462169","commenter_b":"Please email this to every teacher, parent, and administrator in the nation.","commenter_a":"This is garbage! We have nothing left to encourage positive behaviors or discipline!","post_message":"Column: Hey teachers, please stop using behavior charts. Here’s why (From PBS NewsHour)"},{"comment_id":"1278673865484657","commenter_b":"I understand that Hillary has a criminal mind, and I never want someone like her in any office of our government. Her evil intentions are based upon her greedy lust for power and money. But with all due respect, Mr. Trump, what I find so incredibly \"shocking\" is that NO ONE CARES ENOUGH TO DO ANYTHING ABOUT HER!!! Everyone is pissing and moaning ALL THE TIME about Hillary and Obama, saying she done this, and Obama done that. BUT WHAT IS BEING DONE ABOUT THEIR REIGN OF TERROR? NOTHING. ZERO. ZILCH. NADA. To me that says that Americans are a bunch of APATHETIC ENABLERS. We the people deserve the lot we've been given because we, as a nation, have ALLOWED IT!!! #stoptheenabling #stopthetyranny #votetrump","commenter_a":"\"Because one wrong move can mean the difference between life and death.\" -Hillary Clinton, 8-25-16 We know that's true, Hillary. We know that's true. Signed: Ambassador Stevens Sean Smith Glen Doherty Tyrone Woods","post_message":"Hillary Clinton’s actions constitute all of the elements of a major criminal enterprise - she created a private illegal email server in order to hide her corrupt dealings. She did so knowing full well it would put American lives at risk by making classified information highly vulnerable to foreign hacking. But, she didn’t care – as long as it helped her get away with her crime, no risk to America was too great. Then, to further cover-up her crime, she deleted 33,000 emails to keep them out of the hands of authorities and the American public. As a further element of the criminal cover-up, she claimed under penalty of perjury that she turned over all of her work related emails. We now know this to be one more massive Clinton lie. The FBI found thousands of work-related emails she failed to turn over, including the new discovery this week of ..."},{"comment_id":"382957778552770","commenter_b":"Better her than some right wing nut!","commenter_a":"Hoping for someone else - Hillary is too close to big bankers. :(","post_message":"You won't believe how large her lead is now!"},{"comment_id":"1674844459456494","commenter_b":"Mary Taylor i would have punched the bitch","commenter_a":"Prime example of a child who is never disciplined!!! Always got there way if I throw big enough fit !!!!! Afulenza child !!!!","post_message":"WHO DOES SHE THINK SHE IS?"},{"comment_id":"1113788628681311","commenter_b":"I will be voting for a true American who has respect for our military n veterans who's goal is to make America strong again for we the American people n the future of our country n children bring jobs back. close our borders Build the WALL My Vote like many Americans who are sick of our do noting liberal government Will vote Trump Go TRUMP","commenter_a":"Indiana, go vote Trump over lyin' Ted and Kasich! Time to send Donald to the White House. We're tired of all talk and no action politicians! #TRUMPTRAIN","post_message":"Last week we had huge wins in Connecticut, Delaware, Maryland, Pennsylvania and Rhode Island. It has been an amazing week in Indiana. We have traveled all over the state visiting Indianapolis, Evansville, Fort Wayne, Terre Haute, South Bend and beyond. I was endorsed by many sports icons including the legendary coach Bobby Knight, long-time Purdue University Basketball Coach Gene Keady, former Notre Dame Coaches Digger Phelps and Lou Holtz, and actor and former NFL player Fred \"The Hammer\" Williamson. I also received support from many Republican leaders across the country, who believe we will unify the party and defeat Hillary Clinton in the fall. The latest polls indicate this to be true. According to the latest Rasmussen poll, I beat Hillary easily and with your support we can widen this margin and Make America Great Again! It is so important to me to win Indiana. Not only would it solidify ..."}]
