[{"comment_id":"1225587407484516","commenter_b":"'@username @username ca vaut aussi pour les chats bande de cingle !","commenter_a":"Krushank Shah","post_message":"This is why you should stop letting your dog lick your face."},{"comment_id":"1140950715967044","commenter_b":"Lying two faced cutthroat hag.","commenter_a":"If mouth is open lies are being told.","post_message":"BOOM! Coal Miner Calls Out Hillary to Her FACE! Watch her try to 'umm umm babble babble' a way out of it VIDEO  The entitled hag gets slapped with karma! WATCH!"},{"comment_id":"908720232539273","commenter_b":"Oh Mr Trump , I personally can not wait for you to be our New PRESIDENT! All these people saying they are going to leave, I sure hope they do , to bad you can not make it a law that they have to, American might just be s better place without these people. You raised 6 million for the vets what did these people do ??? Besides complain they need to put their energy towards something positive instead of trying to find negativity. Great Job Mr further PRESIDENT TRUMP","commenter_a":"idiot,trump cant do any worse than dumb obama n our stiupid ripoff goverment'get real","post_message":"A majority of people said they would go to Mexico."},{"comment_id":"10153682330001037","commenter_b":"She's nuts.","commenter_a":"Just sad","post_message":"“I honestly regret what I have done and take responsibility for it,' wrote Petra Laszlo in a letter to a Hungarian newspaper."},{"comment_id":"10153717178056002","commenter_b":"why not just peep in their windows?? people are falsely put on these so called 'lists'","commenter_a":"There already is one of these lists. When a Employer does a deep background check it shows everything. You and I can go on OTIS with the right info on a person like birthday date , ssn and full name you can get all of their info.","post_message":"Two boys from different families are abused by the same woman. See what this mom is doing to protect other children."},{"comment_id":"652378504952728","commenter_b":"If I were near and could get it down, I'd burn it!","commenter_a":"take it down and rub bacaon on it and wipe your ass then brun the fucking thig","post_message":"A family in Texas has drawn controversy over this flag...  The ISIS flag should never been hung in America and should be considered a traitorous act.  'LIKE' if this is WRONG!"},{"comment_id":"10154247544237894","commenter_b":"Damn yo mama mean BUSINESS!","commenter_a":"one year my brother and i unwrapped all our Christmas presents before Christmas and my mom found out and took everything back, i would've much rather gotten the ASS whooping instead.","post_message":"Say What Now? Indiana Woman Arrested After Beating Kids for Opening Christmas Gifts Early"}]
