[{"comment_id":"10153068260504804","commenter_b":"It didn't read like that in my head...haha!","commenter_a":"Best president in my lifetime, second only to George Washington in my opinion.","post_message":"Today would have been the 104th birthday of our nation’s 40th President Ronald Reagan. As we remember President Reagan and his exemplary leadership, please take a few moments to watch this video compilation of some of the most memorable moments of his 8 years as President.    @webpagelink"},{"comment_id":"10155604314476509","commenter_b":"I love it. Obama Obama Obama. Biden Biden Biden best Pres and Vice President ever","commenter_a":"At this point what difference does it make","post_message":"Biden: I'm not giving them the wifi password  Obama: Joe..."},{"comment_id":"842369659142996","commenter_b":"Child abuse has actually increased since Roe v Wade. Abortion logic 101...the baby \"might\" be abused later so we'd better kill her now; the baby might actually get to LIVE in a non-traditional home so we'd better kill her now\". Sheeeesh, the stupidity.","commenter_a":"So many young couples would love to take that precious angel growing inside of you. Please don't murder that innocent baby..","post_message":"You don't get to \"choose\" to kill another human being."},{"comment_id":"10152884498052293","commenter_b":"not really","commenter_a":"This is the internet they cant ban anything.","post_message":"Sad Keanu? Nope. And sad Putin? Absolutely not."},{"comment_id":"10153188549718812","commenter_b":"Why don't they beat men cuz the guy cant","commenter_a":"Good","post_message":"JUST IN: NASCAR says driver Kurt Busch has been suspended indefinitely: @webpagelink"},{"comment_id":"1834629973441103","commenter_b":"Such an embarrassment to REAL Women!!!","commenter_a":"Such bullshit","post_message":"More white women voted for Donald Trump than Hillary Clinton..."},{"comment_id":"1247431258610235","commenter_b":"Shut Up!","commenter_a":"Black guy shoots a white guy who was trying to help a female. Sad. When do the riots start?","post_message":"SHOOTING CAUGHT ON CAMERA: New Orleans police are searching for the man shown in this video shooting a med student who was trying to stop the suspect from allegedly attacking a woman. The suspect can be seen shooting the student in the stomach after a verbal confrontation, and then attempting to shoot him again when his gun appears to jam. Read full story: @webpagelink"}]
