[{"comment_id":"1588312174810373","commenter_b":"Killery destroyed evidence after she received a subpoena from the FBI and she Lied under oath! Alot of people have went to jail for less! Our Government and the Media are so corrupt! The same people that have major shares in every media outlet are same people that fund Killery! Saudi and Arab countries!!! I hope you know how they treat Women? Children! Gays?","commenter_a":"This woman has no shame... She will say and do anything for power.. Wake up Dems you're trying to elect a criminal for president.","post_message":"Latest batch of WikiLeaks emails contain details on Hillary Clinton's narrative on Benghazi. @webpagelink \"We see an email exchange among John Podesta [and] other top aides, where Hillary Clinton was being coached on, in their words, 'how to stir up some moral outrage against Republicans' at this Benghazi hearing several months ago,\" Ed Henry reports."},{"comment_id":"10153543784611130","commenter_b":"Bitch where?","commenter_a":"Why are some Android users so concerned with Apple? I know as an Apple user, I could care less about what Android does. It's not really the competition some make it out to be if it's one-sided...","post_message":"Great news for Android."},{"comment_id":"995597563869829","commenter_b":"@username you are free to get the hell out","commenter_a":"Nobody takes Huff po seriously . I read it to see what liberal homos think.","post_message":"Should news sites cover Donald Trump as politics or entertainment?"},{"comment_id":"560952214097169","commenter_b":"These mf's white mf's think it's funny","commenter_a":"Whats the story? Video is not working... Someone pm me!!!!","post_message":"#BREAKING: There are reports that a #Chicago school bus driver has been shot in the head in the West Garfield Park neighborhood... @webpagelink"},{"comment_id":"10155866233724199","commenter_b":"@username trump wives were here illegally before became citizens , your an immigrant just like these people. The were properly vetted and that's a fact . S maybe you should go back where your from and see how fast you live after setting on one foot .","commenter_a":"IF YOU ARE NOT HERE LEGALLY THEN GET OUT ! WE HAVE LAWS AND THEY ARE GOING TO BE ENFORCED !","post_message":"Governor Jay Inslee reacts to President Trump's immigration ban. \"The unjustifiable chaos and cruelty caused by President Trump executive order is now on full display, right now at Sea-Tac airport.\" More: @webpagelink"},{"comment_id":"10153664693511336","commenter_b":"Until Obama resigns she stays","commenter_a":"I'm sorry Governor Huckabee chose to support this action. She is a public official and her religious beliefs can not interfere with her professional responsibilities and duties. Is this how he would respond if he was Prresident of the U.S.? I'm disappointed in you Governor. She should resign her position if she is unwilling to comply with the law!","post_message":"Gov. Mike Huckabee joined Fox & Friends this morning to discuss his support of Kentucky county clerk Kim Davis, and why he believes she's remaining \"steadfast\" to her beliefs."},{"comment_id":"10156429610305354","commenter_b":"No \"Refugees\" from Muslim countries!","commenter_a":"Kill all 15 on the spit","post_message":"So much for Obama's crackerjack \"vetting\" process..."}]
