[{"comment_id":"1495644530464502","commenter_b":"Trump !! Hillary can't swim!!","commenter_a":"Butt wipe","post_message":"Watch Nebraska Senator Ben Sasse's speech LIVE to close out this year's #RSG16!"},{"comment_id":"879699705417529","commenter_b":"NO !!!!!! MORE !!!!!! ENFORCE THE LAWS & SEND THE ILLEGALS ALREADY HERE BACK TO \" WHEREVER \" THEY BELONG !!!!! WE NEITHER WANT THEM HERE ,,,, NOR CAN WE AFFORD TO SUPPORT ALL THEY ARE GIVEN !!!!! HELP THE PEOPLE IN AMERICA ,,,,, NOT THE ILLEGALS !!!!!!","commenter_a":"So if we harbor a criminal we go to jail, but providing \"sanctuary\" is different, right? Pffffft. A rose is still a rose....","post_message":"(VIDEO) HILLARY CLINTON'S TWISTED APPROVAL OF SANCTUARY CITIES FOR ILLEGAL ALIENS Stop the invasion!"},{"comment_id":"623726524464132","commenter_b":"LOCK HER UP ---THROW AWAY THE KEY","commenter_a":"That kind of memory or lack thereof makes her a danger to herself and others.","post_message":"Tom Fitton is LIVE discussing Hillary Clinton's response to Judicial Watch questioning under oath and more in our Weekly Update. [for higher volume touch sound icon on screen or turn your speakers up ]"},{"comment_id":"455564827957330","commenter_b":"So then maybe, when girls get pregnant and don't want to keep it, @username, you will take them?","commenter_a":"I wish it wasn't legal. There is nothing whatsoever \"OK\" about killing an unborn baby and justifying it as \"a woman's choice\". Women's rights and women's health issues have nothing to do with killing a baby. Albeit legal, it's a complete disgrace. But you're right - no tax monies should support it!","post_message":"Abortion is legal, but taxpayers shouldn’t have to pay for it. @webpagelink"},{"comment_id":"998045550284803","commenter_b":"i i think trump should have an abortion and have his you know w hat removed along with his tongue","commenter_a":"Is he going to waterboard women too?","post_message":"BREAKING:"},{"comment_id":"10153842971535950","commenter_b":"Mary, please remove yourself from the gene pool. Don't reproduce.","commenter_a":"Many western people feel targeted and afraid of muslims. You never know what they have underneath all that crap they have on. Why don't they go back to Muslims countries?! If they can't adapt them should not migrate.","post_message":"In Nice, a city with the ban, police can fine any woman wearing a burkini -- or force her to disrobe."},{"comment_id":"1080670505276592","commenter_b":"Unbelievable! This is going to backfire on them. ut makes them look pretty disgusting. Did they use children because the parents can't speak English?","commenter_a":"Bet our tax dollars are paying for those braces leeches","post_message":"Foul-mouthed kids yell at Donald Trump in new campaign"}]
