[{"comment_id":"10153828594101135","commenter_b":"Ignorance at its best","commenter_a":"losers go back to the burbs","post_message":"Supporters of Donald Trump are gathering for a \"flash mob\" on the Wayne State University campus - where Hillary Clinton is scheduled to speak later this afternoon."},{"comment_id":"10152857545591051","commenter_b":"They all need to be sent over with Isis! If you don't like this country, get the hell out!!!!!","commenter_a":"Agree with @username.","post_message":"More than 1,200 people, including a lot of prominent professors, just signed a letter to ban the American flag. Here are all their names and the schools they’re from."},{"comment_id":"10152886010046051","commenter_b":"Kill them sick people,now we'll have to pay for them to live in prison","commenter_a":"Both of them will burn in hell. Drugs are the most powerful tool of the devil.","post_message":"This mom decided to trade her 11-year-old for something that was a lot more important to her."},{"comment_id":"1032023936930784","commenter_b":"Dear God if people did this to the Obama girls everyone would be pissed","commenter_a":"Sick freaking guy that Spinola..Ugh.","post_message":"Oh, Hell no..."},{"comment_id":"10153895768928132","commenter_b":"Showing your butt in public doesn't empower women. It's the opposite. It shows women as sex objects. It shows little girls that is ok to post pictures of them naked. It shows those real woman with curves that if they don't look like that, they are not\"normal\".","commenter_a":"Beautiful!","post_message":"You rock, Demi Lovato!"},{"comment_id":"1033268563393975","commenter_b":"Build the wall already and gas up the coaches to take the illegals home!","commenter_a":"Scumbag democrats and other illegal scumbags.","post_message":"PROTEST TURNS VIOLENT OUTSIDE TRUMP RALLY: \"There won't be no United States without Mexicans.\" [Video]"},{"comment_id":"1226784960751087","commenter_b":"How much is this going to coast the tax payers? What do you know about Hillary's REAL immigration policy, which will bring MILLIONS of radical, ideologically subverted maniacs here, who believe it is their right to oppress, enslave and kill women, gays and all LGBT people? Below are just a few of the extreme immigration positions held by Clinton. (1) Amnesty Within 100 Days *note: she has said she greatly admires Angela Merkel and will emulate her policies if she becomes president. Full amnesty for the illegal immigrant population will cost U.S. taxpayers $6.3 (2) Expanding Unconstitutional Executive Amnesty (3) Freezing deportations (4) Closing Detention Centers (5) Obamacare for illegal aliens (6) Full path to citizenship Hillary Clinton has called for a massive expansion in Middle East migration. As Donald Trump has observed, “Crooked Hillary wants a radical 500% increase in Syrian refugees.” “I’ll work to ensure that every single ...","commenter_a":"It's really sad to see so many of you Liberal Americans not caring about TRUTH, HONOR AND PRIDE.... To just over look the LIES AND HYPOCRISY of Hillary Clinton is pathetic.","post_message":"Given the biggest political gift yet of his troubled campaign, Donald J. Trump muddled his message and diminished its impact."}]
