[{"comment_id":"10153048928789071","commenter_b":"We have to build a wall...","commenter_a":"@username gute Nacht murica","post_message":"A Univision reporter gets kicked out of a Trump event"},{"comment_id":"936977403012167","commenter_b":"If they are illegal, how can they vote ?? Just askin'","commenter_a":"Hell no","post_message":"More than 1 in 3 Americans believes illegal aliens should have the right to vote in U.S. elections, a figure buoyed by the majority of Democratic voters who favor the idea. @webpagelink"},{"comment_id":"1811899142196174","commenter_b":"Then honey you an your country will be taken over. Woman you have made that country weak.","commenter_a":"Turn the other cheek!! Weakness will not be seen as strength by Muslims! They will eventually control and rule Germany! She is a liberal nut job and her options are few at this point! Damage is done!","post_message":"The insanity continues..."},{"comment_id":"999662090090320","commenter_b":"@username True enough, but do you know how RARE it is for a woman to change her mind?!!","commenter_a":"It takes a strong woman to change her mind! Thanks, @username for evolving to take a public stand for LGBT equality.","post_message":"“No future generation of LGBT Americans should live in a country that doesn’t embrace their full and equal rights.” hrc.io/1G7BhCp"},{"comment_id":"10154602894018145","commenter_b":"wcjb tv 20 out of gainesville covers you daily too.","commenter_a":"Hardly news when you live in the Ocala area............and BTW, we are in YOUR viewing area and could use the same weather 'attention' that Orlando/Daytona/Melbourne get.....especially those of us in the rural area.....thanks","post_message":"MUCH colder weather is around the corner!"},{"comment_id":"10153559673746130","commenter_b":"Exactly, I forgot all about this bitch! Lol","commenter_a":"Why did you make her a thing again?","post_message":"Finally, something Kim Davis and her critics can agree on."},{"comment_id":"461301070747634","commenter_b":"They are ILLEGAL!!! It should not be allowed!","commenter_a":"No illegals have no right to vote in our country's elections. The democrats are destroying this country. Wake up is a phone worth your vote. Honestly look around are you better off now than 8 years ago. On the economy I blame both parties!","post_message":"BREAKING: Obama Launches Plan To Allow Illegals To Vote In Next Election They are not citizens of our country, and should not be allowed to vote. Do you think this is wrong?"}]
