[{"comment_id":"10153677956363961","commenter_b":"@username Yes, those stupid one.","commenter_a":"In case you haven't notice, Tom, Obama has given the \"middle finger\" to Americans since he's been in office, always going against the will of the majority. We'll remember you when your term is up.","post_message":"Proud to help secure a new federal grant to improve public transit and fix traffic lights in 10 Connecticut towns"},{"comment_id":"1071265242982572","commenter_b":"Do NOT be BLINDED people for it won't be long before they find a way to seize everyone's guns- THAT'S WHAT THIS IS TRULY ABOUT- SMH","commenter_a":"You are representing terrorists","post_message":"Attorneys for the family of Keith Lamont Scott hold a news conference."},{"comment_id":"10153020088312235","commenter_b":"You just said 17 Americans died in 2011. We've been at war with Muslims for over 10 years. There is such thing as an enemy. Nothing racist but anybody who is stupid enough to follow a man made book and then kill on behalf of that fairytale should be executed. If I invite you into my home and you disrespect me and my family, I'm going to kick you out. Same thing with Islam. Western nations opened the door to HELP THEM, not to get FUCKED BY THEM, and people are starting to get sick of it. It's likely best if all that do not want to embrace the culture of their host country go back home where they can lop off heads all day long and molest children","commenter_a":"How stupid are you? Focusing on Americans piss ass shootings? Look at the big picture as you support Islamic terrorism and put it on a pedestal. Animals trying to get nukes and you are worried about a couple gun nuts. They are devouring Western Europe and you pick the flea off of the dog to focus on. That's why Liberalism is a mental deficiency - focusing on the flea on the dog instead of the dog.","post_message":""},{"comment_id":"921176444602838","commenter_b":"Bernie or Hillary will destroy the economy with their policies. Plus, they're so weak on immigration and would prefer for the illegal immigrants, who by the way, suck up over 150 billion dollars per year, to stay. Trump is on point with just about everything.","commenter_a":"Michael Luna Can't wait to see what Obama says or these other people just opening the gates to everyone... Donald J. Trump is right on this one, we need to close the border right now...","post_message":"The two men have been training at the base since February and “were screened prior to their arrival in the United States more than a year ago,” according to the statement."},{"comment_id":"10154468706093869","commenter_b":"Maybe not, 45 may beat her to the prison. At least, those of us who are not bamboozled are hoping to see him in a federal prison.","commenter_a":"Dream on. Hillary will be convited and thrown in prison where she belongs.","post_message":"Today's daily cartoon by Tom Toro. Swipe through more cartoons with the New Yorker Today app: @webpagelink"},{"comment_id":"10153201313814255","commenter_b":"How is this even legal?! How do these cretins get to refuse to act on ONE thing because they don't LIKE another?!!!!!","commenter_a":"Geriatric Mutant Ninny Turtle. Competing with Agent Orange to see who is the worst leader in Congress.","post_message":"Thugs."},{"comment_id":"10153466375525575","commenter_b":"She got her 15 minutes of fame. Should go dance on a pole now! What a ho!","commenter_a":"Magan sure isn't winning any thing after Howard strearn show about her sex life and now these pictures are coming out of Her.","post_message":"The Gateway Pundit - Donald Trump Builds on Lead After First Debate – Ted Cruz Surges to Second"}]
