[{"comment_id":"630413113793105","commenter_b":"okay so heres why i still disagree, especially in regards to syrian refugees. the poison example is still not a good one, because no damage that isis can do to the country is comparable to the damage that poison will do to a persons body. it would be tragic to lose people in attacks, but it wouldnt be strictly 'devestating' to the country. the united states stregnth and resolve would be largely unchanged. refuting refugees is stupid, and here is why i think so. for one, the refugee vetting process is the most extensive and thorough process that is in place, if any sort of check is going to detect a potential terrorist, this is the one. refugees take about two years to finish vetting and finally get relocated, and they dont even get to choose where they go! they get sent to a country that is assigned to them. ...","commenter_a":"'@username thoughts","post_message":"Donald J. Trump tweeted about the case, saying Bonifacio Oseguera-Gonzalez 'should have never been here.'"},{"comment_id":"1067472230049155","commenter_b":"fuck your wall. period wall wont do shit. 2nd those thousands of lives were addicts, as if you care.","commenter_a":"I am not sure why a man who is responsible for the deaths of thousands through violence and drug overdoses is considered a cult hero by some people. However I think we should consider parole if he will pay for the wall!","post_message":"El Chapo not happy with the prison conditions. #ElChapo #WSHH"},{"comment_id":"10153491404021680","commenter_b":"We live in a generation that feels like everybody owes them something. @webpagelink","commenter_a":"You guys are so biased, it's disgusting.","post_message":"Bernie Sanders must run a gauntlet of closed primaries and Hillary Clinton strongholds next week."},{"comment_id":"968962986483662","commenter_b":"Exactly @username. @username, has already contradicted herself more than once. She is all over the place. That's one weird Troll.","commenter_a":"Barack Obama has done more damage to the USA then all past presidents put together...............He lies continually, he is anti-police, pro-thug, anti-life for gay marriage..... he says he is Christian but his fruits of his works are anti-Christ.....he sides with Islamic terrorists....goes against are biggest ally the Jewish Nation and has done everything he can to bring racial division to this once great nation. Treason is an understatement!!! Why don the Senate evoke the NUCLEAR option so to force our Divider and Chief veto all of the bills coming out of the Senate??? We the people should elect a person who will obey our Constitution and has faith in God, and a person who truly cares for the people and our Veteran!","post_message":"In 5 days, Congress will have to send 'must pass' legislation to President Obama's desk to fund the government.  Sign your emergency fax petition urging them not to send a single penny of taxpayer dollars for abortion or abortion providers! Click here! @webpagelink"},{"comment_id":"652310991589660","commenter_b":"LMFAO. Stupid dumb Bitch.","commenter_a":"'@username i can see u doing this. so smart of him","post_message":"When the mother who was in line behind him refused to do anything about her loud, obnoxious child, this man decided to take matters into his own hands."},{"comment_id":"963715427023908","commenter_b":"Thugs is a nice word for these fools...","commenter_a":"Disgusting!!","post_message":"SAVAGE THUGS DIG UP CONFEDERATE SOLDIER: Group Fed Up With Waiting Begin Digging Up Confederate General Grave (VIDEO)  NO RESPECT!   @webpagelink"},{"comment_id":"941978015839539","commenter_b":"I do like a chick with a beard...","commenter_a":"Hi I am Jessica. I am 17 years old. Inbox me and I'll compromise your account passwords and/or bank account.","post_message":"Penned on sheep skin, this document will have a major impact on the way we view Islam."}]
