[{"comment_id":"10153177506232885","commenter_b":"Scumbag whore.","commenter_a":"Unwhite Bastards.","post_message":"At a complete loss for words right now! This is absolutely disgusting and an abuse of the right to free speech!"},{"comment_id":"10152884468574877","commenter_b":"Happy birthday you beautiful queen","commenter_a":"Happy Birthday!!!!!","post_message":"We are wishing Lupita Nyong'o HAPPY BIRTHDAY today!! The Academy Award winning actress received her masters degree in acting in 2012 from the Yale School of Drama and in 2014, she was named \"The Most Beautiful Woman\" by People and \"Woman of the Year\" by Glamour. LIKE and SHARE to celebrate!! >>>@webpagelink"},{"comment_id":"897587366974686","commenter_b":"Please don't speak English again your murdering my language. Just keep speaking Spanish.","commenter_a":"Speak English? Good or bad I'm bilingual BITCH","post_message":"Crazy Racist Old Lady Yells At A Woman For Speaking Spanish At An Ihop!"},{"comment_id":"10154110456411337","commenter_b":"Why are they anonymous?? Staying unknown seems cowardly... Bunch of bullies. Be open about it if that's what they feel and think....","commenter_a":"Erica Rudolph","post_message":"TOTAL WAR: Things are getting really ugly between Anonymous and Donald Trump."},{"comment_id":"1721173881464308","commenter_b":"All lies, the smile to fool American's! No woman shouls allow to ru for prseident on Bil's Lewinski nasty in the White on principle alone on top of all the dangerous mistakes and incompetence that runs throyugh her desparate veins. Souless human!","commenter_a":"AMEN!!!!!!.......","post_message":"Breaking News: Hillary Clinton has clinched the Democratic nomination for president, according to The A.P."},{"comment_id":"723294587810406","commenter_b":"Leah sure! Hillary's leaked email referrer's to Mexican's as \"taco bowls\". That says it all right there. Racist as anybody can be.","commenter_a":"Hillary no lo hace un coche de usted . Solo su voto","post_message":"\"Do all the good you can. Measure your life by the positive effect you can have on other people’s lives. Be of service to one another.\" —Tim Kaine"},{"comment_id":"1181889591889575","commenter_b":"Disgusting, disrespectful pigs. They should kiss the ground they walk on and be grateful to be here instead of the hellhole they came from. However, maybe they should go back. They laugh at us, the stupid Americans that clothe and feed them not to mention housing and oh yes, the free education!!!!! Filthy people.","commenter_a":"Go away...","post_message":"A Muslim family is going viral in a bad way after they made a SHOCKING move while the National Anthem played... this is NOT good. Now that the video is out, they probably wish they had never done this..."}]
