[{"comment_id":"10155610147785389","commenter_b":"Maybe we all need too draw more Cartoons/dont like it leave our Country.If we went to there Muslin Country they cut your head off are take your body parts for opening your mouth,so i think we all need too fight back too these ugly Muslin who think they are going too rule America and kill us for nothing.All they are Communist and they are brought in too our Country too destroy ,let them destroy there own.Lock these borders and stop letting them build camps too close too us.","commenter_a":"The Lamestream media are sell outs to this great Republic, and therefore deserve nothing but disdain from all true patriots.","post_message":"Question of the Day: Is the mainstream media wrong for criticizing Pamela Geller, instead of the radical Islamists?"},{"comment_id":"1415750351836830","commenter_b":"She was with the head writer of SNL and the woman who plays her on SNL skits. They All suck!!!","commenter_a":"id bet they were laughing at each other because they couldn't decide who was SKANKIEST.....","post_message":"Hillary raised a lot of eyebrows with her dinner guest..."},{"comment_id":"10155187026858984","commenter_b":"I caught the statements that's she was making. I'm glad she wasn't as blatantly shoving her opinion down people's throats as Beyonce did. I applaud her professionalism but I still find her and her music repulsive. On a separate issue, how does get eaten alive for her unoriginality? It's like she can't decide who she wants to rip off more, madonna or David Bowie.","commenter_a":"Anyone who knows the meaning behind This Land is Your Land knew she made a political statement. I don't think that was very many trump voters, though. Her subtlety is what was appreciated by them because they likely missed it and it allowed them to enjoy the show.","post_message":"Of all of the things Lady Gaga could have done during her Super Bowl halftime show, this was perhaps the most shocking... and the most unexpected."},{"comment_id":"1345400498836549","commenter_b":"They need to go in and kill every one of those cockroaches.","commenter_a":"DUH !!!","post_message":"QUITE ALARMING FOR EVERY WESTERN COUNTRY!"},{"comment_id":"773429869426968","commenter_b":"This is why the crooked libs are trying to let illegals vote. Another law breaking move. Criminals. That's what libs are.","commenter_a":"He is a waffler. Stop the insanity. Everyday. He takes a different stand. Go away. Please","post_message":"Trump's rally in Phoenix, Arizona immediately made headlines all over the country - and there's 10 big reasons why..."},{"comment_id":"587990821351234","commenter_b":"2","commenter_a":"2","post_message":"Some say two, some say 13 can you tell? Take our TODAY poll!"},{"comment_id":"10154755276262619","commenter_b":"Heads up!","commenter_a":"Natanyahu is not an Orthodox Jew. He is a secularist.","post_message":"The Israeli Ministry of Defense Missile Defense Organization head Yair Ramati has been dismissed from his post due to grave security violations."}]
