[{"comment_id":"10153227271719228","commenter_b":"If she didn't go to the hospital another couple hours she would have been gone cuz it would have went to her heart it was that close to her heart they caught it in time","commenter_a":"The exact same thing happened to my daughter they went in a Lana ectomy scraped her spinal cord put her in a coma for 2 weeks it took her 2 months to learn how to walk again but she is walking again","post_message":"Her body started to go numb and she lost feeling in her legs."},{"comment_id":"10154026339057464","commenter_b":"Wisconsin people must have cheese for brains! How else can you explain why they are listening to Mitt and the Republican party supporting Cruz.! With Cruz you'll get another Bush style government paying higher taxes and less jobs! Only Trump has a solution to bring jobs back to America!","commenter_a":"I want the media to go after Cruz like they have gone after Trump. They are so biased and they make me sick. Media, please ask Ted this question: Have you been unfaithful to your wife? AND don't stop asking him until he answers that simple question!","post_message":"It's not too late to enter to win tickets to the championship game in Houston --> @webpagelink"},{"comment_id":"822097871159007","commenter_b":"Take it from a feminist, there is no wage gap. @webpagelink","commenter_a":"All wonderful.... now let's see if we can make \"being paid like a girl\" equivalent to being paid like a man!","post_message":"Maybe it's not a bad thing... (h/t United Humanists) Do you consider yourself a feminist? Let us know: @webpagelink"},{"comment_id":"10156328907740354","commenter_b":"This cheap harlot is getting a high price for her prostitution. I can only expect less from someone as low as her.","commenter_a":"Nasty skank!","post_message":"Surely Scarlett Johansson is working on a Koran version as well. Surely that's happening, right?"},{"comment_id":"10152978558206051","commenter_b":"Ive seen mothers making babies for the purpose of the money BULLSHIT lazy ass mothers","commenter_a":"if you're TOO POSH to push STOP HAVING BABIES :p","post_message":"This pregnant mom of 11 gets $60,000 per year in benefits, but she still wants the government to pay for a c-section for her next baby. And that's not her only request."},{"comment_id":"10153659892877093","commenter_b":"Woman","commenter_a":"Bomb that guy","post_message":"HOUR-LONG STANDOFF: The woman refused to get out of her SUV & cooperate with police. She tried to drive away and was finally taken into custody... @webpagelink"},{"comment_id":"1832240316996227","commenter_b":"Since you took the time to report this, why not put the effort to fix it? or educate us how to prevent this? Or are you one of those assholes that like to stir up nonsense to get recognitions?","commenter_a":"When I was young I vowed to kill all the bees. I see my plan is working.","post_message":"Do NOT scroll past this!! ✋✋ Source → @webpagelink #WakeUpCall | #SaveTheBees Join Us: The Free Thought Project"}]
