[{"comment_id":"10153307059689714","commenter_b":"Women are bad","commenter_a":"Girls at my school were not allowed to wear just leggings either.. I'm not scratching my head..don't really understand why this is a viral story..?","post_message":"Scratching our heads"},{"comment_id":"1558544671099313","commenter_b":"Go to hell","commenter_a":"He is such a joke ! I wish he would go back to where he came he's not even an AMERICAN !!!!!","post_message":"This makes my blood boil!"},{"comment_id":"10152767856712426","commenter_b":"Hide yo kids hide yo wife","commenter_a":"Michelle Grider","post_message":"Startling!"},{"comment_id":"10153459562633445","commenter_b":"No jail time and no probation for less than ounce....Wasted time n court's and jail space.....GET REAL GO FOR CARRIER CRIMINALS ,AND MURDERS ,LOCK THEM UP NOT A POT SMOKERS GETTING BELIEF N PAIN MANAGEMENT ,NO PILLS ,DAAAAAAA","commenter_a":"www.premierepotpourri.com","post_message":"#Pot Matters: Marijuana, the Courts and Probation"},{"comment_id":"838126822975658","commenter_b":"I think it is very interesting when you look closely at all the photos of the refugees....you men, military age. ISIS? Muslim Extremists? Frightening to say the least.","commenter_a":"It is with glee and satisfaction i'm watching Europe's descent ito Islamic morass.They want to replace 6 million killed Jews with 40 million Arabs. Europe's punishment is Islam.","post_message":"'Generous welcome by Germany created a strong magnet to bring millions of migrants from Asia and Africa to Europe.  This is sheer madness and it is dangerous,' says Daniel Grynglas."},{"comment_id":"10153159279537452","commenter_b":"^^ wrong house","commenter_a":"How about the government stay out of our homes.","post_message":"THIS JUST IN: The Los Angeles City Council unanimously voted to require guns that are stored at home to be kept in locked containers, disabled with a trigger lock. abc7.la/1GGHSUi"},{"comment_id":"811711869019390","commenter_b":"I wouldnt trust that asshole with my worst enemies life","commenter_a":"He should have never been trusted in the first place.","post_message":"Obama Scrambles And Goes Into Hiding After This Investigation Leaks.  He's doing whatever he can to keep this quiet.  Do you think Obama should not be trusted?"}]
