[{"comment_id":"10153597366220329","commenter_b":"Like we're met to be best friends lol","commenter_a":"Craig! I still think it's you.","post_message":"It's not me, it's your god damn chargers."},{"comment_id":"10152660058432452","commenter_b":"Why should your taxes pray double to kill her","commenter_a":"Forgive her. Two wrongs will never make a right...","post_message":"The execution of the first female in Georgia in 70 years was on hold as the U.S. Supreme Court reviewed last-minute arguments by her lawyers that they hoped would persuade the nation's top justices to grant a stay. abc7.la/1M2tBxU"},{"comment_id":"1270203316353471","commenter_b":"she cant and is a skank","commenter_a":"Say what you want about Miley--those pipes of hers are GOLD. period. And, she's been a sole advocate of LGBT and homeless rights. She's young and finding her voice but good for her for wading into the advocacy pool! Applause!!","post_message":"She may be an attention seeking diva with a voice like nails on a chalkboard, but she's also a politically active advocate for women's rights who despises Donald Trump."},{"comment_id":"1103020493078450","commenter_b":"@username and Donald Trump's wife is a illegal alien what's your point","commenter_a":"Can somebody explain this to me. Donald Trump just had a physical done and all of his stats are great for 70-year-old man. But yet factor in the draft he couldn't pass a physical exam. Did he get more healthy in the last 50 years? No I don't think so. And it wasn't because of a physical disability. Because right after he dodge the draft he just went to college and play physical sports such as tennis squash and football. So now the medical Side of the argument is contradicting 50 years later. The physical part of it is completely out of the question at the time of the draft because of the sports he played right after he dodged a war. So what other excuse is there to keep you out of the draft? Please somebody answer this question. And these veterans today deserve to hear the answer to ...","post_message":"After four days spent recovering from pneumonia, Hillary Clinton returns to the campaign trail, chats with reporters aboard her plane @webpagelink"},{"comment_id":"10153558491861051","commenter_b":"Holy hells crybaby slavery ended 150 plus years ago u were no slave no one in america today owned a slave sorry your ancestors got sold to whites by other blacks and were forced to come here and work but no one alive today is responsible for it how about a lil respect for the northern army who marched on thier own people to free the blacks i always hear the we were slaves evil white mans fault but when in history has a race fought itself to free another race?so many northerners died freeing blacks for what so theu can bitch and moan and blame all whites","commenter_a":"By legal you mean taken from Africa to work (no pay, against our will, beaten, raped, broke our families a part and more), on you fields of dreams (plantations), so that American can prosper because you sure tried to make it hards for blacks, than you are white I mean right Mr (Master) Tump","post_message":"Trump says he opposes all illegal immigration, but firmly believes that legal immigrants are the backbone of America. Do you feel the same way?"},{"comment_id":"10153944005826336","commenter_b":"@username Your cocksucking grandma needs to read the bible!!","commenter_a":"What is this world coming to?!","post_message":"Just a few weeks before Christmas, Labor Commissioner Brad Avakian wiped out the Klein family’s bank accounts – taking nearly $7,000."},{"comment_id":"10152782539256130","commenter_b":"It would take the entire roll of toilet paper for some women. Hell I go through super plus tampons with a super extra maxi overnight within 2 hours bc I have PCOS. I was homeless and LUCKILY people donated to the shelter and I was usually able to have what I needed. Sometimes I didn't but I would go sit in the day labor office with a bunch of homeless men, I was like the only woman there, while I was on my period, bleeding through my clothes just to go do manual labor all day so I could make $30 to buy what I needed. I fucking hate asshole people.","commenter_a":"Growing up poor, you learn to use other methods. Guess what's free and in bathrooms everywhere? =p","post_message":"Pads and tampons are often what homeless women ask for the most."}]
