[{"comment_id":"1701200686777335","commenter_b":"Gun laws will not effect non-American \"Crazy\" residents taking advantage of our Freedoms.","commenter_a":"What do you think the USA has done all over the planet.....we have bombed and killed thousands upon thousands of innocents and we are the victims? I think not","post_message":"“They want to blow up our country. They want to blow up our cities. They want to knock down our buildings, and [Pres. Barack Obama’s] worried about global warming. We have somebody that’s not in touch.” – Donald J. Trump"},{"comment_id":"10154320018886323","commenter_b":"Fascist dictatorship and destruction of cabinet government system. Democracy under attack.","commenter_a":"I am okay I never voted either tyrant but that's that's English government","post_message":"\"The Tories are about to give us a second female prime minister while much of the left will say gender is an irrelevance or that there are many more important things to deal with. Women, know your limits!\""},{"comment_id":"10150935910204999","commenter_b":"Women for Donald J. Trump","commenter_a":"Is this the Hillary lecture show or a debate where we're going to hear from two people. Chris Wallace if you wanted to have a person conversation with Hillary you should have called it as such and not drag us through this BS","post_message":"Chris Wallace’s star turn is a welcome source of pride at Fox News. And, maybe, some relief."},{"comment_id":"813461822117937","commenter_b":"Dream on billary Jr.","commenter_a":"Donald Trump for president thank you Jesus 2016","post_message":"Chelsea Clinton: Scalia’s Out of the Way, so now we can gut the Second Amendment @webpagelink"},{"comment_id":"1425850460773794","commenter_b":"She has obviously got a different understanding of Constitutional law than most citizens!","commenter_a":"Please go eat some cyanide soup...","post_message":"She is not fit for public office. Do you agree?"},{"comment_id":"10154254205206179","commenter_b":"Yes, the man who was accused of racism 30 years ago despite being a legal champion of civil rights when it mattered, showing he can actually put personal beliefs aside and do his job when it counts. Can't have someone like that as attorney general. He might actually enforce the law.","commenter_a":"She knows the rules. . She was warned. . She broke the rule. . She was disciplined. . The rules are arcane, but then crying cause y'all don't get your way, well please! #growuppeople","post_message":""},{"comment_id":"831982023505806","commenter_b":"This woman needs to take the beam out of her eye before plucking the speck out of mine.","commenter_a":"The key point is she CHOOSES what to wear. So long as it is her choice, and not forced upon her, that's fine.","post_message":"Christian mom explains why she decided to stop wearing leggings:"}]
