[{"comment_id":"1264248823618692","commenter_b":"@username Trump lost the entire west coast, not just California. But, for the sake of your argument, such as it is, yes, take away California...take away the most populous state in the Union, the state with its own fucking economy, the state that has to give more than it takes from Federal coffers in order to support the welfare red states who take more than they give to Federal coffers...disenfranchise those people...disenfranchise the many for the few. Lady, and I use the term very loosely with you, that's how tyranny starts.","commenter_a":"Trump and his little army, are the most corrupt bunch. Electoral College...do your patriotic duty, the duty Alexander Hamilton intended you to do when faced with a Demagogue who has ties to our enemies in foreign lands. UPDATE: I have thoroughly enjoyed the response of you moronic Trumpbots...more than I know. You have validated my assessment of you folks...an assessment that can be summed up in one sentence, \"Dumb as a bag of rocks.\" So while y'all keep going on about Liberals, Dems, 'Killary', the bogus line about Hillary selling uranium, blah..blah...blah, \"We won, you lost,\" etc., etc., etc., a few pointers: You might have some valid points about some Liberals...if only you would learn to use proper analysis techniques and then had the ability to form a proper sentence to explain said analysis; yes, Dems can be as bad as Repukes...both are corrupt, and both sides are hypocrites...as are ...","post_message":"So: Shep Smith just called out Donald Trump's lies about Russian election interference on Fox News. \"It was brought up before the election. Over and over and over again.\""},{"comment_id":"10153029424263445","commenter_b":"You're a stupid ass welfare bitch. I can tell by your reaction","commenter_a":"Fuck you. You can't dictate what people do with their money. Plus, how do you know they don't have a kid with an awful disorder that benefit from pot? Your ignorance is showing. Check your privilege.","post_message":"ICYMI - Colorado Bans Use of EBT Cards at #Pot Shops"},{"comment_id":"822517567938820","commenter_b":"This woman is crazy saying Hillary is the most loved and respected woman in the world! She's been hanging around Hillary to much, and Hillary's lying is rubbing off!!","commenter_a":"Security should of threw her out on her ass. The demons must be running scared.","post_message":"Watch: Dem Chair Shows Up INSIDE GOP Convention Arena And Does The Unthinkable It is amazing to see to what extent the Democratic party will try to derail Trump's campaign. Do you stand behind Donald Trump?"},{"comment_id":"1032281423464900","commenter_b":"Oh please. You gotta be kidding. I will say Madcow needs the ratings for sure.","commenter_a":"When you get the guts to go on Rachel Maddow's show, please let me know.","post_message":"I talked with Fox News’ Gretchen Carlson this afternoon about the House passage of the Homeland Security Appropriations bill. As I told her, we made a commitment in December to seek to block President Obama’s lawless, unconstitutional amnesty using the \"power of the purse.\" Today we upheld that promise by doing our part to pass the strongest, most conservative bill that we could. I hope you’ll take a moment to watch."},{"comment_id":"1059551124091179","commenter_b":"Surprise, I don't want women in mine either!","commenter_a":"Don't want some guy in bathroom with any girls. Whose to say he really is gay. ! Don't care if he is though don't belong there.","post_message":"Why is this so hard to understand?"},{"comment_id":"1752390171683339","commenter_b":"Well if you like being killed because your a woman so be it but not here in the US stay in your own free country an kill all you want just not here","commenter_a":"She has to be in the running for the Idiot of The Year Award, she has my vote.","post_message":"You have got to be kidding me. Get this liberal trash off the air. Do you think this is racist and ignorant?"},{"comment_id":"10153480820949726","commenter_b":"Skank whore.","commenter_a":"That song is getting a little old hillary...just like you","post_message":"WATCH: Hillary Clinton targets Wall Street!"}]
