[{"comment_id":"10153665573326077","commenter_b":"Yep bet you never did anything wrong in your life","commenter_a":"Wth is wrong with kids nowadays... Everyday they are up to something crazy !! Yesterday was drinking fuel with soda , today is this , tomorrow?? What??","post_message":"Have you heard of the 'duct tape challenge?'"},{"comment_id":"10153780723343984","commenter_b":"the Muslim parents could have kept their brats at home that day and celebrate their butts off.","commenter_a":"Yes","post_message":"Tempers flared after this city's board of education refused to take a day off of school in observance of an Islamic holiday, and these Muslim parents were NOT happy about it.  Do you agree with the decision these school officials made?"},{"comment_id":"1515340161809773","commenter_b":"Well... he lost the popular vote, so that's clearly not true. But you're right, Bernie supporters should feel cheated.","commenter_a":"Obviously people approve of Trump more then Hillary 🤗🙃 Let's be honest he won because of crocked Hillary's disapproval. Bernie supports should feel cheated... he'd be the next president if she hadn't been the democratic candidate.","post_message":"Do you approve of Donald J. Trump?"},{"comment_id":"10153307893053352","commenter_b":"They both should quit. There should be a black woman on the panel discussion.","commenter_a":"Kelly your the best always classy","post_message":"Kelly Osbourne Threatens to Quit ‘Fashion Police’ Over Rancic’s Racist Remark on Friend Zendaya"},{"comment_id":"10154776330225831","commenter_b":"'@john, Lets talk abt the difference please.....Lets talk abt the American Citizens who took a gay man, James Byrd Jr.....beat him...tied behind a truck, and then dragged him for miles until some of his body parts started ripping off of him....when they finally stopped to toss his body over a cliff....all that was left was his torso....all done by Americans.....Legal US Citizens, in 1998..... Or better yet......the Oklahoma bombings, in 1995, who was carried out by Timmothy McVeigh.....let me reminded you how this Legal American Citizen; bombed the Alfred P. Murrah Federal Building in downtown, Oklahoma City, killed 168 people, and injured more than 680 others ...here's another legal Citizen attack for you, since we Americans forget how we're our own enemies {but I guess thats okay}.....: Eric Rudolph carried out the Olympic Park bombing in Atlanta during the 1996 Summer Olympics.....that blast killed spectator Alice Hawthorne and wounded 111.....lets ...","commenter_a":"Instead of deporting 'illegal immigrants' kick out all the Nazis skin heads KKK alt right Moran's and we shouldn't have any problems with the rest of the world","post_message":"The 9th U.S. Circuit Court of Appeals has refused to reinstate President Donald J. Trump's travel ban. In response, President Trump tweeted, 'See you in court' and 'the security of our nation is at stake.' Do you agree with the court's decision?"},{"comment_id":"10153057363191028","commenter_b":"Bhahaha!!! A ccw in San Fran ? Does a unicorn issue those?","commenter_a":"I am sure that the thugs guns were a registered and they all had concealed carry permits with proper background checks done.","post_message":"The brazen attack occurred just before 6 a.m. at Pier 14 in San Francisco, where the reporter and photographer – along with several other news stations – were covering a story.   'I thought I was going to hear a click,' the photographer said afterward, meaning that he thought he was going to die. @webpagelink"},{"comment_id":"10153792774496162","commenter_b":"Anna Silva","commenter_a":"Lisa DeRosa Raphael","post_message":"Lucky Charms has finally created a marshmallow-only version of its cereal: @webpagelink"}]
