[{"comment_id":"10155824563490725","commenter_b":"White girl","commenter_a":"I am praying 'IN JESUS NAME' that Donald Trump becomes our President, WE should all pray 'IN JESUS NAME' that Donald Trump becomes our President so we can get our America back to the way God wants it to be. I know with Donald Trump as our President he will 'Make America Great Again', Amen!","post_message":"The U.S. will invite El Chapo, the Mexican drug lord who just escaped prison, to become a U.S. citizen because our 'leaders' can't say no!"},{"comment_id":"957861980892726","commenter_b":"Allowed, not aloud. Here, not hear. You're, not your. Go back to school, Linda.","commenter_a":"No one should be aloud in this country without being vaccinated period! No matter if you lived hear your whole life or your just coming in. Unless there is a medical reason it's just common sense.The risk of spreading these diseases is too high.","post_message":"The current measles outbreaks sweeping the country are the fault, at least partly, of Barack Obama lax illegal immigration practices, according to former Johns Hopkins neurosurgeon and possible 2016 GOP presidential candidate Dr. Ben Carson.   Read more at @webpagelink"},{"comment_id":"428369787523578","commenter_b":"Lady if I was standing right next to you I'd slap the s*** out of you","commenter_a":"Lana Genchi","post_message":"This woman's racist rant just got her banned by the mall for life."},{"comment_id":"10154584633716955","commenter_b":"I think she should move to Mexico!!!","commenter_a":"I'm thinking she would have done that whether she won or lost.","post_message":"TIRED HILLARY"},{"comment_id":"1729274910624261","commenter_b":"'@username well then","commenter_a":"Donate this to where the world needs 😩","post_message":"Science at work - The LifeStraw.  The LifeStraw removes at least of 99.99999% of waterborne bacteria and 99.9% of waterborne protozoan parasites. It can filter up to 1000L of water.   Throughout the world, an estimated 884 million people still do not have access to clean sources of water. This device contains no chemicals or batteries and makes it possible to drink safely from any river, lake or puddle.  Buy them here: bit.ly/1YbTja9  For every unit sold, two children in the developing world will be supplied with clean drinking water for a year."},{"comment_id":"10153203354164071","commenter_b":"I also voted for Romney and would do it again. The Presidency was 'stolen' from him.","commenter_a":"Vice President Romney","post_message":"Mitt Romney just unloaded on President Barack Obama's foreign-policy legacy."},{"comment_id":"10152967828847061","commenter_b":"Yes legal immigrants ma'am","commenter_a":"I am ashamed at the negative narrow minded comments. Check your heritage. We are all immigrants","post_message":"America Ferrera to Donald Trump: Thanks, your comments will send more Latino voters to polls: abcn.ws/1Iw7NNn"}]
