[{"comment_id":"10156261922235354","commenter_b":"Time to go home.","commenter_a":"Don't know Trevor ...M and glad of it.","post_message":"Nevertheless, Trevor Noah still trashed Dr. Ben Carson for being 'callous.'   No joke."},{"comment_id":"1240366709375196","commenter_b":"Oh how I pray that would happen because that is where she belongs. Get out and vote TRUMP!","commenter_a":"She must NOT be elected, then impeached or her VP would take office. Then she would just be the puppet master. Telling him what to do. Come on America, do what is right!!","post_message":"We all hope that Donald J. Trump takes down Hillary, but a backup plan has just been launched in case he doesn't.  This is a massive development in the campaign, and you know it's got Hillary's people worried."},{"comment_id":"1171128359565299","commenter_b":"How's he going to pay for the bloody wall????","commenter_a":"Showing a total and complete ignorance of understanding of the root of the problem.","post_message":"A big wall is the Swiss Army Knife of Republican politics."},{"comment_id":"10156946907525389","commenter_b":"'@username you are just a hater. Stop disrespecting people specially Muslims.","commenter_a":"Love this man!","post_message":"'Why didn't she say, 'Hey, make better lifestyle choices?' If you want to join something, why don't you join a church, why don't you join the Boy Scouts or the Girl Scouts?'  Milwaukee County Sheriff David A. Clarke Jr criticized Hillary Clinton's comment on joining 'positive gangs.' @webpagelink"},{"comment_id":"10153619308152235","commenter_b":"'@username a racist comment about baking!?? Okay, surely you jest. You don't know what you're talking about so you're automatically excluded. @username I agree it could be seen as sexist except I am a female and bake all the time, but MORE IMPORTANTLY Men are known to be the best chefs😉. @username she didn't make any valid point when she stated 'nothing new, threats made against students daily' She's out of touch with the article and with reality if she is trying to compare unspecified kids being threatened to a RACIST threatening to kill only BLACK KIDS posing with ak47 on the school grounds!! ARE YOU FREAKING KIDDING ME!??? The generalization she attached to this comment is uncanny, disturbing, and I'm sorry RACIST in an of itself. Because the DENIAL of racism IS racism also.","commenter_a":"This is nothing new. Threats are made against students daily! We went through this last year and most kids were kept at home until the instagram poster was identified.","post_message":"Another effing beautiful day in post-racial America."},{"comment_id":"10154300951236519","commenter_b":"But Hillary lost. There will be no Gulag.","commenter_a":"Boy, at least He can feel like he has clean hands as we are all marched into the Gulag. Very comforting.","post_message":"One elector defected so far, but not from Donald Trump."},{"comment_id":"10153479859171337","commenter_b":"Shut up hoe","commenter_a":"Love him. And you know what HE DONT GIVE A SHIT!!!! He tells it like it is. Everybody put your big boy or girl pants on and DEAL WITH IT!","post_message":"WHOOPS: Donald J. Trump made some inflammatory comments about Mexican-Americans, and they're coming back to haunt him..."}]
