[{"comment_id":"664601907063721","commenter_b":"What a FFFFFFFFFFing Bitch.","commenter_a":"Yes","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"},{"comment_id":"10153746116545326","commenter_b":"'@username I'm still waiting for the tons of stepford wives to come.","commenter_a":"Lots of bitterness coming from the Sanders.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153145592901336","commenter_b":"I bet if not for her panties her guts would fall out","commenter_a":"Hope they send all the men back.","post_message":"Liana Barrientos, 39, who took six trips down the aisle in 2002 alone, will now be walking into court to face felony charges."},{"comment_id":"967666993287466","commenter_b":"Lying sack of s@&$. Only pigs do that.","commenter_a":"These Muslims make up the most unbelievable lie's .","post_message":"46 Yr Old Millionaire Muslim In Court For Raping Teen: “I fell on her and penetrated her by accident’"},{"comment_id":"642161199307792","commenter_b":"If she get to say what she wants ,WHY can't the other people say what they want ,She talks down to ALL the people You could say that bitch pist me off and kelly would so you think all women are bitches no just the ONE THAT PIST ME OFF She just think she is everything do no wrong.","commenter_a":"No","post_message":"Megyn Kelly may be getting kicked off the air...  FOX needs our support, let's give it to them.  Do you support FOX News?"},{"comment_id":"10152784038336491","commenter_b":"Preaching to the choir, sister! One of many reasons I'm now divorced.","commenter_a":"Now if only science could find a man worth having......","post_message":"Science shows that there are quite a few health benefits of getting intimate."},{"comment_id":"10154521229303318","commenter_b":"Start building the wall","commenter_a":"The idiot has border fences all along southern Mexico whats that for. They think they can just come to America an send the money back.","post_message":"Mexico's president just cancelled his meeting with President Trump.  He told Trump Mexico 'does not believe in walls' and 'demands respect.'  Do you support or oppose Trump's dedication to the wall?"}]
