[{"comment_id":"10152994999515326","commenter_b":"Screw you laurie. Are you a tea bagging bitch?","commenter_a":"Good man!","post_message":""},{"comment_id":"10156822812815725","commenter_b":"your wife is hot","commenter_a":"You alone? Really? No help from anyone? Hmmmm","post_message":"Europe and the U.S. must immediately stop taking in people from Syria. This will be the destruction of civilization as we know it! So sad! It was just announced that as many as 5000 ISIS fighters have infiltrated Europe. Also, many in U.S. I TOLD YOU SO! I alone can fix this problem!"},{"comment_id":"1138008016249439","commenter_b":"Hillary is a corrupt liar","commenter_a":"Bernie is accepting the will of the majority of democrats, and throwing his support behind an amazing woman who will make an astounding President.","post_message":"Bernie Sanders and Hillary Clinton campaign in Portsmouth, NH. Full video here: @webpagelink"},{"comment_id":"675151445982815","commenter_b":"illegals are going back..THE WALL","commenter_a":"But according to trump and his supporters he must be either a thief or a rapist. To the people that dislike Hillary for whatever reason: \"vote for her and hold your nose\", that orange Nazi is at the door, and we can't let him in.","post_message":"14-year-old mariachi singer opens night 3 of the DNC with a rendition of The Star-Spangled Banner. Sebastien de la Cruz was 11 when he sang it at the NBA Finals, a performance that sparked a wave of racist comments on social media. @webpagelink"},{"comment_id":"10155187026858984","commenter_b":"I caught the statements that's she was making. I'm glad she wasn't as blatantly shoving her opinion down people's throats as Beyonce did. I applaud her professionalism but I still find her and her music repulsive. On a separate issue, how does get eaten alive for her unoriginality? It's like she can't decide who she wants to rip off more, madonna or David Bowie.","commenter_a":"Anyone who knows the meaning behind This Land is Your Land knew she made a political statement. I don't think that was very many trump voters, though. Her subtlety is what was appreciated by them because they likely missed it and it allowed them to enjoy the show.","post_message":"Of all of the things Lady Gaga could have done during her Super Bowl halftime show, this was perhaps the most shocking... and the most unexpected."},{"comment_id":"10153598424984364","commenter_b":"Lighten up, lady.","commenter_a":"We don't \" Happy Holidays\" we wish Merry Christmas and Happy New year. Same to you.","post_message":"Here's wishing everyone Happy Holidays!"},{"comment_id":"498325633682650","commenter_b":"Latino political organizations need to get their voters in large numbers to make sure that ASSHOLE doesn't get in office!","commenter_a":"I am not a Republican. I am not a fan of any of these idiots running. But Trump has got to go . People are gonna get hurt, innocent people. Look at the monsters he has as his security detail that will swing at anyone for no reason and now this with his supporters. The media has to stop covering him. Take away all the attention he is getting. Maybe cover him when something intelligent comes out of his mouth, which so far has been nothing. This man can say whatever he want but we are a democracy, we have a government and he rant about all he wants to do but he can't do it alone. There are 3 branches of government. I know that he has veto power but then we would be calling him Dictator Trump not President Trump. He is a egotistical classless piece of shit.","post_message":"It's getting worse."}]
