[{"comment_id":"1673236709627945","commenter_b":"I can't stand this big eared liar!","commenter_a":"Bull crap! You say that federal background checks don't work when it relates to gun control but when it relates to checking refugees you say it does so apparently it only works when you are telling the public lies to get what you want = pitiful","post_message":"'Any refugee coming to the United States, some of them victims of terrorism themselves, will continue to get the most intensive scrutiny of any arrival.'  After meeting with his national security team, President Barack Obama said that 'our intelligence and counterterrorism professionals do not have any specific and credible information about an attack on the homeland,' but that 'we have to be vigilant.'"},{"comment_id":"1022105807844423","commenter_b":"'@username Mexico can barely afford to do anything for it self what makes you think it's going to pay for a damn wall? Because let's think about this..America is scared you are living in fear. Last time I checked Toddlers kill more people with guns per year in the USA than Terrorists do.","commenter_a":"As soon as #DonaldTrump builds the wall, Hillary needs to be tossed up and over the wall into Mexico!! #Trump","post_message":"Making public colleges and universities tuition-free is not unrealistic. It's necessary. — Sara Goldrick-Rab"},{"comment_id":"10153618174361051","commenter_b":"America will pay. Cheaper to build wall than to keep paying for the illegals.","commenter_a":"There will only be a wall if the Donald pays for it,because Mexico says they will NOT pay for any wall!","post_message":"Donald Trump reiterated this week: If he becomes president, he's building a wall at the border. Would you be for or against the wall?"},{"comment_id":"10153825599556770","commenter_b":"Crooked Hillary's campaign is doing what they do best, and that is to take the focus off of her current health problems and turn the attention on to what Mr. Trump said in 1996 about a pageant queen. What's even more troubling is that the media is in their back pockets, treating her like she just won the presidency, while slamming Mr. Trump! Sorry, but who was it again who had 33,000 emails wiped from her private server using BleachBit that can never, ever be recovered? Who was it again who had staffers destroy their Blackberry phones with hammers? Who was it again who blatantly lied to the FBI? Who was it again whose 'key witness' staffers were given amnesty from testifying? Who was it again who called tens of millions of Americans deplorables? And, of course, the list goes on and on and on! Isn't it amazing how crooked ...","commenter_a":"This is coming from a man who paraded his mistress around the city and let his wife be the last one to know he was divorcing her...he has as much room to talk about Hillary and Bill as Trump does...","post_message":"Former New York City Mayor Rudy Giuliani has some harsh words for Hillary Clinton."},{"comment_id":"10153179691834091","commenter_b":"Hmm...not as bright as WE thought, are you???","commenter_a":"See there, its already fixed. I'm sure it's not the first time this has happened. Everyone have a great night.","post_message":"YIKES!!!"},{"comment_id":"10155770026010354","commenter_b":"She would England better than America.","commenter_a":"And I will remember not to vote for you!","post_message":"Facebook pool: how long until there's a hunting photo op to show how much Hillary understands sportsmen?"},{"comment_id":"10154973031601509","commenter_b":"yah ! you r big brother of DONAL TRUMP .","commenter_a":"Farage is a racist. And Trump is a racist. Racists love each other.","post_message":"Brexit leader Nigel Farage: Donald J. Trump 'dares to talk about things that other people want to brush under the carpet... For the United Kingdom, I think Trump would better for us than Barack Obama's been.' @webpagelink"}]
