[{"comment_id":"1439879839405093","commenter_b":"@username this the lady I was talking about","commenter_a":"So beautiful I'd do the same without a doubt","post_message":"After her daughter's battle with leukaemia left her unable to carry to full term, Theresa offered to become a surrogate and gave birth to a healthy boy ❤️"},{"comment_id":"1251273681614205","commenter_b":"They need to build a wall around Chicago... after all the illegals show up the murder rate will soar even higher","commenter_a":"Because chiraq has so much extra money laying around.","post_message":"Dem Chicago Mayor Rahm Emanuel just created a legal fund for the roughly 150,000 illegal immigrants in Chicago"},{"comment_id":"10153003040749091","commenter_b":"Thugs","commenter_a":"Soon will catch this people what a shame.","post_message":"HOME INVASION: Men break into South Bronx home, steal necklaces, PlayStation. Watch the surveillance video of the suspects.   FULL STORY: @webpagelink"},{"comment_id":"927580090624348","commenter_b":"@username OMG are you loco? This b&tch kills off people.","commenter_a":"You not being elected the President will make America safer","post_message":"Hillary Clinton: Guns Will Not Make Americans Safer #DemDebate   @webpagelink"},{"comment_id":"10153759399624228","commenter_b":"Her point, Chad, is that it's not just Muslims who are terrorist. I'm not a supporter of Muslims and have my own views but you can't just pick and choose. If you're going to list terrorists, list them all. Not just a specific religious/culture type","commenter_a":"It's not just ISIS.","post_message":"They want all of us to become hostile"},{"comment_id":"10153155614114411","commenter_b":"Circumcision removes most of the nerve endings from the penis - so no, it is not good for intercourse.","commenter_a":"curcumstich is good for the sexual intercorse between man woman. But the preast outbreath and homosex agenda and child melest could make Even God leave the churche..and the girls virganity and boys firs blow job...fuck them. Herpes is an evel sicknes related both to rosesicknes that makes your body ..","post_message":"Via RT America: City health officials said 17 cases of infant herpes since 2000 have been connected to the traditional Orthodox practice of sucking blood from the circumcision wounds of infants penises."},{"comment_id":"1202982936435126","commenter_b":"I agree fuck him he got that light skin nigga syndrome straight bitch","commenter_a":"That's what he gets","post_message":"Thoughts? Is this fair punishment for the crime? #KevinGates #Jail #WSHH"}]
