[{"comment_id":"10154339492484087","commenter_b":"'@username, good luck trying to deport a Native, you racist bigoted POS.","commenter_a":"Meanwhile, Boeing stocks take a hit because of this asshole.","post_message":"Boeing released a statement saying it was under a $170 million contract with the Air Force, not $4 billion as Trump claimed."},{"comment_id":"669515329853116","commenter_b":"obama's peaceful religion! muslim Orcs bring intolerance, hate, terror, destruction, and death. The culture and 'civilization' manufactures nothing else but!","commenter_a":"Just why would you call her crazy. They can flip into terrorism at any time. The parents should not have hired her. Stupid.","post_message":"Russian police arrested the nanny and charged her with murder after she was found at a subway station holding a child’s severed head, yelling 'Allahu Akbar,' according to reports."},{"comment_id":"667942883338893","commenter_b":"No.","commenter_a":"Because whites haven't been a suppressed race for hundreds of years.....does stupid hurt? I figured I would ask the idiot that runs this page wth a grade school education.","post_message":"Hmmmm....."},{"comment_id":"10153248729158908","commenter_b":"Sharon Wilkshire","commenter_a":"Nancy Brown","post_message":"Coconut oil has many health, home, and beauty uses. This oil is a simple, easy, and inexpensive replacement for many commercial products that you may be using at home."},{"comment_id":"10153953096951336","commenter_b":"So according to your logic @username driving home after having a few beers is equivalent to shooting a gun into a crowd of people? Am I understanding you correct? I bet you still believe Marijuana makes people go crazy.","commenter_a":"People who drink and drive should serve prison time. At least a 1to 5 year minimum . And if they kill or hurt someone while driving drunk they should serve life in prison.","post_message":"'Social media led us straight to this suspect to stop him before he was able to hurt himself or others,' the Franklin County Sheriff's office said."},{"comment_id":"10155170960495093","commenter_b":"You know, the more I see about Manspreading and Manslamming and Mansplaining and etc...the more I think 'Womanwhining'","commenter_a":"How bizarre that a feminist would lie while trying to make a (man-shaming) point. First time for everything, I guess","post_message":"The term 'manslamming' comes from one woman's claim that she walked around NYC without moving out of anyone's way and almost every man slammed into her but almost no women did.   So National Review's Katherine Timpf decided to try it out herself  and 66 women ran into her vs. just 23 men. You can see video of all the slams here:"},{"comment_id":"1620932058215182","commenter_b":"Cse'Doobie Major bruh.. she can blink and ash that bih","commenter_a":"Brittlynn Jacob Ygnacio","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
