[{"comment_id":"1199877433404302","commenter_b":"Neither. I refuse to vote for a disgusting womanizer who cares nothing about this country and I also refuse to vote for a woman who has covered up her husband's sexual assaults and has allowed troops and ambassadors to die on her watch. They are both liars and cheats and I will pray for this country everyday until either one of them is finally out of office.","commenter_a":"Hillary Clinton","post_message":"Women Voters Only: Your Choice for President?"},{"comment_id":"10152829806276636","commenter_b":"U can't find african american in this kind of situation coz they are at home just waiting for their money from welfare...since when african american have their sense of urgency in going to work?","commenter_a":"Ironically, wasn't there a case in US of an african american single parent who was desperate for a job, left her children (older than this one) in car in car park so that she could attend interview....put in prison and her children removed, that just doesn't seem very fair does it?","post_message":"He'd got half an hour to work before making the realisation..."},{"comment_id":"1187655654624295","commenter_b":"You couldn't even please your husband, what makes you think you can please us? #NeverHillary","commenter_a":"Nice","post_message":"In the presence of practical, tactical brilliance at Hamilton: An American Musical."},{"comment_id":"1347077192027276","commenter_b":"LuAnn...I guess you are ready to pick some fruits and veggies for 2 bucks an hour in any kind of weather mind you! Oh and then remember anything coming in from Mexico like tequila and avocados will cost you 20 cents more for every dollar the item costs! Hmmmmm! So, we are paying for the wall!","commenter_a":"Round 'em up ... head 'em out... back across the border... if they are here illegally they have already broken the law they do not need to be here number one . it's the rule of law .. number two .. it's common sense for the survival of the Republic ... BUILD THE WALL ... and whatever else it takes to keep them out .. they want to come in they can get in line and do the process ...","post_message":"Speaking at the CPAC today, President Trump says he intends to keep his campaign promises:"},{"comment_id":"10157286339920093","commenter_b":"There's no such thing as humane murder, just like there's no such thing as humane rape. Either way they're going to die and nobody wants to die. It's not our choice, these are foreign proteins that make our bodies suffer . They have a negative impact on us yet were continuing this vile massacre. Did you know that they rape cows ( the artificially inseminate them with a \"rape rack\").","commenter_a":"Humans love to kill land and sea animals. People are like cavemen and think they still have to kill to eat. I've been doing great for 20 years now without eating meat or seafood. I don't believe in killing things it's a pretty crappy thing to do. Heartless and inhumane. It's called using your brain and evolving. How can anyone with a conscience bully and kill something I don't get it.","post_message":"Hundreds of lobsters avoided being boiled alive thanks to a group of Buddhist monks."},{"comment_id":"396582543845311","commenter_b":"Richard J. Lindner She Did Commit Perjury, Destroyed Evidence Under Subpoena GET OFF THE H-TRAIN","commenter_a":"Repost: Federal Law: Title 18. Section 2071 Can it be any clearer? Former United States Attorney General Michael Mukasey tells MSNBC that not only is Hillary Clinton's private email server illegal, it \"disqualifies\" her from holding any federal office. Such as, say, President of the United States. \"If you do this or that bad thing, you've essentially disqualified yourself as being the leader of the free world,\" said Mukasey, referring to the illegal server and the illegal handling of classified materials. Mukasey specifically points to one federal law, Title 18. Section 2071. For those of us who do not have United States Code committed to memory, here's what it says: (a) Whoever willfully and unlawfully conceals, removes, mutilates, obliterates, or destroys, or attempts to do so, or, with intent to do so takes and carries away any record, proceeding, map, book, paper, document, or other thing, filed or deposited with ...","post_message":"BAM!"},{"comment_id":"841833905948136","commenter_b":"What utter rubbish, it's the same beautiful country i have loved all my life & watched change under EU dictatorship & when my 88yr old father says \" this isn't what we fought for \" i know we've done the right thing , please don't panic people after a bumpy ride calm & Great Britain will be restored","commenter_a":"Spengler predicted this.","post_message":"\"This is not the country it was yesterday. That place has gone forever.\""}]
