[{"comment_id":"10153780264915950","commenter_b":"Dana is a ugly bitch she loves controversy let me see where she works if she works the internet does wonders and ensure her emoloyer","commenter_a":"You're all pissed about a teenage 'KID' using the N word a couple times in a tweet, (because according to the former Miss Teen, 'it ain't her word,-it should be no ones word, yet black America puts it out in song lyrics etc., that kids sing to) and not up in arms about a political head deleting thousands of emails and being hacked to boot. Oh, and a pretty blonde won so you're pissed there as well. News flash...the last one wasn't white! Get over it . Racism is not going away now or in the immediate future because the liberal media perpetuates most of it.","post_message":"A screenshot of 4 tweets have been making the rounds online."},{"comment_id":"10152716358611680","commenter_b":"Red herring fallacy and straw man fallacy.","commenter_a":"This is sexist and Politico and the lib media are trying to hide this story. Nice try. @webpagelink","post_message":"Kelley Paul says 'to have that label put on him, that really upset me.' @webpagelink"},{"comment_id":"10153313662524342","commenter_b":"No...not white people get away with murder No white lady who spoke nasty to an officer then killed herself ever got a street named for her... Thats just a black thing Just check statistics n wow Stereotypes proven true;)","commenter_a":"White people issues:/","post_message":"Police say an investigation into a mail theft led them to a drug lab   in a Pearland apartment.  DETAILS/MUG SHOTS --> @webpagelink"},{"comment_id":"1247969895269376","commenter_b":"So we can take hus away also. He is more privileged than her.","commenter_a":"Are you kidding me? He is simply making a point that she is a privileged elite who lives by one standard of protection and expects the little people--the unworthy stupid masses--to try and survive under a different one. It's called irony. To deliberately misinterpret and inflame his message (as a call to 'assassination'???!!!) is just proving Hillary right--her sheeple are the stupid masses. I say, let's prove her wrong and show some common sense.","post_message":"DISQUALIFYING! This is the SECOND time he suggests that Hillary should be shot. What is WRONG with him?  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153174163477452","commenter_b":"he better not get fired. @username","commenter_a":"GET SOME!!!!","post_message":"Big Mac attack!   A McDonald's worker wasn't 'Lovin' it' when an irate and apparently drunken customer launched into a vicious attack at the drive-thru window. But the worker wasn't going down without a fight. abc7.la/1KYEgIq  It's just the latest case of a service worker attacked on the job."},{"comment_id":"902494896546891","commenter_b":"I told you I was going to get her out","commenter_a":"'@username she's a chunk! Pictures were a lie! 😁 She's out @username lol","post_message":"Our camera caught the middle school teacher who reportedly got pregnant during an affair with an 8th grader as she left the jail. We had questions, but she didn't have any answers. Full video: @webpagelink"},{"comment_id":"1217472704997930","commenter_b":"WE MUST STOP CORRUPT CROOKED LYING KILLARY...If she gets into OUR White House she will appoint the nest Supreme Court Judge...GOD Forbid it be the MUSLIM POS OVOMIT. This will affect US, OUR CHILDREN and OUR GRAND CHILDREN for years to come. She will do her best to cost us OUR SECOND AMENDMENT RIGHTS, While keeping the Secret Service ARMED to protect HER SORRY ASS !!!! She will FLOOD OUR COUNTRY WITH SYRIANS, TERRORISTS, and ILLEGALS.... OUR Borders will NEVER BE CLOSED. AND all of this we will be FORCED TO PAY for with her PROMISED RISE IN TAXES on the MIDDLE CLASS. if that DOESN'T KILL US, we can always be BOMBED, BEHEADED, RAPED or MURDERED by ISIS....GET A CLUE, OPEN YOUR EYES, SEE HILLARY'S AMERICA , BUT THINK TWICE BEFORE YOU VOTE FOR THIS TRAITOROUS B*TCH !!!!!!....TRUMP 2016 !!!!!","commenter_a":"TOO many martinis & pills.","post_message":"Democrats are in full-on panic mode after reporters scooped a picture of Hillary Clinton literally UNABLE to stand. This is going to intensify speculation about her health BIG TIME.  Do you think that Hillary Clinton is fit to serve?"}]
