[{"comment_id":"760226330784714","commenter_b":"The woman is an MD, right? She is by definition smart. So what happened?","commenter_a":"Welcome to the female version of Ben Carson... So. Damned. Stupid.","post_message":"It’s official now: Jill Stein—and the Green party if it agrees with her—is/are a waste of space. By Daily Kos user BoGardiner"},{"comment_id":"969099383223240","commenter_b":"Lock her up !","commenter_a":"there were 2 ac130's in Sicily only 2 hours away that would have wiped the attackers from the face of the earth had they been deployed","post_message":"Every American needs to know this before the election!"},{"comment_id":"10152911089911491","commenter_b":"There's already two women on the dollar coin","commenter_a":"So... doesnt it cost money to change the bill ? Im not paying for it. Are you Ms.Hillary Clinton ?","post_message":"Hillary Clinton: Harriet Tubman on the $20 bill would be \"awesome, well deserved — and about time.”"},{"comment_id":"10154869505163812","commenter_b":"Yuck","commenter_a":"Bill Clinton is the pig lets talk about what he did to woman .","post_message":"In light of the release of a recording of a vulgar conversation Donald J. Trump had where he brags about groping women, it seems that very little appears to have ever been off limits for the Republican presidential nominee."},{"comment_id":"588513781327245","commenter_b":"Trump is not pro amnesty, he's a negotiator and looking at the best way to deal with families who have lived here for 10 or more years. Even if he does half of what he said he'd do it will be HUGE!! Id be happy with getting rid of illegal criminals, upholding the laws we have and securing the border and building the wall! That is HUGE!! Trump 2016!!","commenter_a":"I @username will not be voting for you Mr. @username because you are starting to sound like a main stream republican when it comes to ILLEGAL IMMIGRATION . I was with you from the beginning but not now. NO AMNESTY !!!","post_message":"The Clinton's are the real predators..."},{"comment_id":"725221097581400","commenter_b":"This Latino American Women thinks its terrible that people here illegally are breaking laws & think its ok no its not..","commenter_a":"The petty haters whining about tax dollars need to just have a seat. And take a long, hard look at themselves. A) she's a CHILD B) she's going to go further in life than any of you small-minded simpletons because of her drive and determination, and her GPA and scholarships were a direct result of that. She didn't show up on free Yale day. She is smart, worked her butt off, and is on track for the kind of success she deserves.","post_message":"Larissa Martinez held a 4.95 GPA and took 17 AP classes over her McKinney Boyd High School career. She's also an undocumented immigrant who arrived in the U.S. in 2010 -- but only 10 of her classmates knew that before last week. After her speech, they gave her a standing ovation."},{"comment_id":"1312061745499049","commenter_b":"You two are makeing it hard for people that are serious about their beliefs your making them look bad,so knock it off!","commenter_a":"#Theydontrepresentme","post_message":"\"After sharing my thoughts about the recent Women's March on Facebook, rabid feminists quickly attacked, displaying their 'tolerance' as they 'lovingly' called me a twat and worse. That didn't bother me. What irritated me was the 'We did this for you' remarks. Before these feminists march for me again, there's something I want them to know.\" @webpagelink"}]
