[{"comment_id":"10154864481904170","commenter_b":"I know enough about Trump and Clinton. Only one has committed crimes worthy of prison time. Can't dispute facts.","commenter_a":"Ivanka is an amazing woman which demonstrates that President Trump is not only successful in business, but with his family too. A real winner in every sense of the word. #MAGA","post_message":"This should get people's attention."},{"comment_id":"1258751664191586","commenter_b":"i bet she can harvest a lot of trees on minecraft","commenter_a":"Look little bittt i wana see you actually fight some one as good","post_message":"Nice with the hands. #WSHH #Boxing"},{"comment_id":"1670051896580847","commenter_b":"Hell yes","commenter_a":"Definitly YES !","post_message":"OMG! Obama shortchanged the VA by 2 billion and gave away 4 billion to Muslim migrants! He hates our vets! FOLLOW US----> Freedom Daily"},{"comment_id":"1661665617421412","commenter_b":"Ignorant dick shouldn't of been running his mouth and chest bumping him. No pity","commenter_a":"Why was the reporter saying \"F you\" to the agent? Why did the agent feel such a response was needed? Enjoy the circus.","post_message":"A photographer was choked and slammed to the ground by a Secret Service agent during a Donald Trump rally in Virginia today. @webpagelink"},{"comment_id":"879093232228004","commenter_b":"She is an ugly person!","commenter_a":"Maybe she can hire a personal assistant to help her with clothes and makeup...","post_message":"$20,000,000.00 a year?! Shoot, I wouldn't pay her $20 a year."},{"comment_id":"898221040294675","commenter_b":"Kill the mother fucker","commenter_a":"I would put a shotgun up his ass and let the trigger fly!","post_message":"Multiple Choice Quiz time, kiddies. I chose option 'C'. What about you? @webpagelink"},{"comment_id":"1172930249409099","commenter_b":"I get chastised for bad grammar but she gets a free pass for talking about wanting to Murder Men. Cough** cough** cognitive dissidents. Cough** cough**","commenter_a":"Yes, it is called bandwagoning. And the sad fact of it is that now we will never know how many of them were being honest and how many are lying for the limelight. Cases like this only cast doubt on instances of rape, unfortunately. If you are victimized, report it immediately. Don't wait.","post_message":"Awful."}]
