[{"comment_id":"10155380353783797","commenter_b":"Smh Freaking Nazis","commenter_a":"KevinNajera","post_message":"HOLOCAUST REMEMBRANCE DAY: Today marks the liberation of the Auschwitz Nazi death camp on January 27, 1945. Take a moment to remember the millions killed. bit.ly/2k1HfMq"},{"comment_id":"10155201075949657","commenter_b":"why would a woman vote for this asshole he calls them FAT PIGS","commenter_a":"I'm surprised women don't value honesty more in light of Hillary's proven lies","post_message":"Trouble."},{"comment_id":"1169765843057166","commenter_b":"Leave them alone, they have to live somewhere!","commenter_a":"DON'T CARE.... Kids are hungry.. Will be more hungry when school out !!!!! Focus on important things in the Community!!!!!","post_message":"Rumors are flying! Are Beyoncé and Jay Z living in Tampa? Our news partner the Tampa Bay Times went to check out the rumors and here's what happened..."},{"comment_id":"483171531871140","commenter_b":"Amen","commenter_a":"Ya, Right. would never believe this bullshit!","post_message":"Shocking!"},{"comment_id":"1141972632481659","commenter_b":"I think they should exact a form of sharia law on these ME males. Cut their peckers off. They are stealing from these women","commenter_a":"Europe wake up and time to get you at of my bed. We can't except no more of this crime it's disgusting and these middle eastern got to go bye bye and ready for there deportation sentence. We don't want to hear no more of liberal excuses oh it's racist.Racist my face those people deserve there jail sentence and then there deportation sentence.","post_message":"Drip, drip, drip: News of more Muslim sex attacks leaks out"},{"comment_id":"10152793900772452","commenter_b":"Bad women drivers! ;)","commenter_a":"Who the hell runs over a motorcyclist and does not have a clue that they hit someone????! Thank god the other drivers made her stop FINALLY!!!","post_message":"The dramatic rescue of a motorcyclist who had been dragged underneath a truck on the eastbound 91 Freeway was caught on video. abc7.la/1EK2HcY The video was submitted to Eyewitness News by viewer Byron Holeman who used the #ABC7Eyewitness."},{"comment_id":"998929483475806","commenter_b":"Don't know why.He has much more intelligence than Trump","commenter_a":"Cruz will make a great president and trump vice p.","post_message":"Thank you, Ted Cruz!"}]
