[{"comment_id":"10153736667641350","commenter_b":"She lost","commenter_a":"Crap weazel !!!!","post_message":"The woman felt her nephew was negligent for giving her an enthusiastic hug."},{"comment_id":"10152765303355950","commenter_b":"@username, \"Ridiculous comment. The complete opposite of what we should take away from this as feminists. Imagine what would happen if all of the barricades were removed & women could advance the way men do. Even more women would be standing where she is.\" Okay, so support your putative position with evidence, versus just asserting it like your job is done.","commenter_a":"Great! Now feminists can see that it is by working hard, getting really lucky, and not giving up that we are best equipped to fulfill our dreams, rather than trying to reengineer society... like the whole thing is just broken. Even the grass can get through concrete... with enough time and the right conditions.","post_message":"At 19 years old, Elizabeth Holmes dropped out of college. She had a little money and a big idea. More than a decade later, she became the youngest female billionaire in the world."},{"comment_id":"10153846163628984","commenter_b":"So invite some of those Muslim refugees into your home, fool....see how that works out","commenter_a":"The Koran speaks extensively about Jesus Christ. U fools who do not know. Look it up.","post_message":"She was riding the bus when two Muslim men starting attacking, as soon as one started stabbing her she let out four simple but powerful words that she credits to saving her life. This woman's story of survival is truly incredible."},{"comment_id":"10153206684663855","commenter_b":"F LA! No bears or real men only these fake ass roided out bitches","commenter_a":"Where did they get the inspiration for those haircuts ... :-)","post_message":"Love these pics!"},{"comment_id":"10153748388188132","commenter_b":"You have lost. Your. Mind. Woman.","commenter_a":"All of you women on here calling her disgusting and gross and saying \"Ewww we don't need to see that,\" are absolutely part of the problem. There are countries where menstrual shamming still occurs and young girls are treated like animals as a result. You may think it's gross because you live in an entitled world where you're treated no differently when you have your period. Educate yourselves before you run your mouth... @webpagelink","post_message":"Thoughts?"},{"comment_id":"10153697633816636","commenter_b":"@username females mature quicker than boys, starting periods as young as 9, some see that as start of womanhood, females have sexual hormones and crushes in early teens so YES it isn't any different... She does need locking up","commenter_a":"I think you mean that she raped the 13 year old boy on an almost daily basis. She is sex offender who groomed then raped her victim, if genders were swapped people would see this monster for what she is and see that the 13 year old is a victim.","post_message":"'I have chills because of this'"},{"comment_id":"726825177508060","commenter_b":"Muslims offend me. Make them leave.","commenter_a":"God help us all. Leave your American Flag flying high. I sure will. It's OUR country. If u don't like it----- get the h---ll OUT. We didn't invite u here.","post_message":"Texas man ordered to take down American flag because it offends Muslims. In our country we fly our flag. This is absurd. Do you think this is ridiculous?"}]
