[{"comment_id":"10155028895888010","commenter_b":"@username this isn't a Democracy. It's a Constitutional Republic. BIG difference.","commenter_a":"I think the LA Times is confused. There is a difference between an attack and a response to an attack. I'm not saying Trump never attacks people...I know he does. But several times now I've seen Trump's responses described as attacks (ie Meryl Streep).","post_message":"The president-elect was responding to criticism."},{"comment_id":"898221040294675","commenter_b":"Kill the mother fucker","commenter_a":"I would put a shotgun up his ass and let the trigger fly!","post_message":"Multiple Choice Quiz time, kiddies. I chose option 'C'. What about you? @webpagelink"},{"comment_id":"10153719523799138","commenter_b":"What is,wrong w people???? If they have,an \"urge\" can't they have,any self control! !! Haven't people heard of video surveillance? ? Makes me wonder what else they've done that hasn't been detected...","commenter_a":"It's too bad that the media gets a hold of these stories and everybody believes them. That's not to say it didn't happen. Some children do lie about these things.","post_message":"The teaching assistant has been taken into police custody and is no longer an employee at St. Louis Park Public Schools."},{"comment_id":"10154258956738352","commenter_b":"Congratulations. Amazing lady.","commenter_a":"Twins!","post_message":""},{"comment_id":"10153322219778188","commenter_b":"@username......... you're making me hungry!!!!!!","commenter_a":"Should they be wearing ball caps and tennis shorts? You equip with the best available to protect yourself.","post_message":"Local police are now often seen equipped with the same gear and weapons you would see in a war zone. How did this happen? @webpagelink"},{"comment_id":"10153642652659411","commenter_b":"Needs to be bombed to death. No more terrorism, no more parasitic immigrants.","commenter_a":"You want to slow down the migrant crisis? Stop bombing the Middle East!","post_message":"Op-Edge: 'The root cause is frankly Europe just not being prepared for this large scale numbers of people fleeing persecution and misery in other countries. Europe has rather just closed its eyes to reality and rather hoped that the situation might just go away' - Keith Best, former Vice Chair of the European Council for Refugees and Exiles"},{"comment_id":"10154082768681130","commenter_b":"The popular vote doesn't determine the presidency.","commenter_a":"She should have picked Bernie and that way all his voters would have voted for them","post_message":"Meet Hillary Clinton's running mate: Sen. Tim Kaine of Virginia."}]
