[{"comment_id":"927281534054105","commenter_b":"He doesn't belong in America!!!! Get out Obama!!!","commenter_a":"He is a traitor and should be impeached.","post_message":"This is seriously outrageous."},{"comment_id":"457954454329149","commenter_b":"and an Ass!","commenter_a":"Bush family is Scum....I'm a Reagan Republican.","post_message":"President George W. Bush dances to music performed by a high school band in New Orleans for the anniversary of Hurricane Katrina. Looks like he still has a spring in his step!"},{"comment_id":"10154517046780329","commenter_b":"Not bad, but these sudden death quizzes are pretty f***ing unpopular. I would have hoped y'all would have gotten the point.","commenter_a":"Mike Snee","post_message":"There are 20 questions, but as soon as you get one wrong, you LOSE. (via BuzzFeed Quiz)"},{"comment_id":"397229163813931","commenter_b":"Get these people deported","commenter_a":"if these goat humpers do not like the laws of the US they are free to leave any time they want","post_message":"Shock Poll! More than HALF of Muslim-Americans Think They Should be Allowed to be Governed by Sharia Law!"},{"comment_id":"517851475047476","commenter_b":"One ugly dumb coward.","commenter_a":"This guy should be selling catsup in his front yard .","post_message":"This is the fourth deadline extension since an interim deal was struck in April."},{"comment_id":"901304566673644","commenter_b":"A woman's right to KILL her alive yet unborn child!!!","commenter_a":"Save the fetus- starve the child. They're not pro-life, they're pro-birth.","post_message":"Accurate."},{"comment_id":"10153401968107411","commenter_b":"GOOD..,TIRED OF SMELLING DOG POOP ON A HOT SUMMER DAY we have filthy nasty neighbors with too many dogs...they don't clean the poop and it FEEDS RATS PEOPLE...","commenter_a":"Esoj Ornelas","post_message":"Mayor Emanuel and several Chicago aldermen are proposing a new ordinance that calls on property owners to clean their lots daily to keep them free of feces -- or face fines up to $500."}]
