[{"comment_id":"1230461060352731","commenter_b":"Finish your comment. What type of women are these?","commenter_a":"I'm actually quite amazed at the amount of women attempting to justify this. As if abusive culture isn't hard enough on you. Just wow. Like demographic though.","post_message":"UPDATE: According to Rolesville Mayor Frank Eagles, the officer seen slamming a student to the ground is school resource officer Ruben De Los Santos, who has been placed on paid administrative leave. Follow this story>>wral.com/@username/"},{"comment_id":"1391779917508701","commenter_b":"lol white girl troll","commenter_a":"The confederate flag, rebel flag doesn't stand for slavery nor against blacks. But it's OK for them to tote around black panther crap which is known as a black supremacy group?? Get a life and find something meaningful and real to whine about.","post_message":"The House has voted to ban the display of the Confederate flag on flagpoles at Veterans Administration cemeteries."},{"comment_id":"10155021638815859","commenter_b":"And dress like a woman","commenter_a":"Of course Trump fails to mention that there really is NO WAY to call the white house and expect to actually get through to anyone.","post_message":"Pres. Donald J. Trump: 'I haven't had one call' complaining about Dakota Access Pipeline. \"I don't even think it was controversial.\" @webpagelink"},{"comment_id":"1112602185474010","commenter_b":"FFFFFFFFFFFFFFFFFFFFFF trump he is a orange bigot! #Ftrump","commenter_a":"trump 2016","post_message":"Former Mexico President Vicente Fox is sorry, not sorry about his big middle finger to Donald J. Trump and his proposed wall along the U.S. southern border."},{"comment_id":"698823633563273","commenter_b":"Well then stop her. Isn't that your job?","commenter_a":"Yes a female Eric Holder,","post_message":"GOP leadership should stop the Loretta Lynch nomination by not reporting it to the floor for a vote. We must reject lawlessness, outright."},{"comment_id":"10154770811534411","commenter_b":"come on now David, gotta bring the muslims into it. Bet your a fucking Tory, or one of those ukip nazis. Away and take your face for a shite","commenter_a":"@username being one of media that show Russia is not a problem in Syria after its jets bombs and kill thousands of women and children,Killing by bombing is still an act of terrorism and should not be favoured,just fool those who see one side of the coin and they dont want the truth to prevail","post_message":"'There is a hysteria which is being organised by politicians and the media against Russia to see Russia as the only problem in Syria'"},{"comment_id":"761596003989174","commenter_b":"Sure","commenter_a":"TRUMPET THE SCARIEST ORANGE CAT GRABBING PSYCHOTIC CLOWN AFTER TRUMPET LEARNED A FOREIGN DIGNITARY SAID TRUMPET SHOULD PRODUCE HIS BIRTH CERTIFICATE TO PROVE TRUMPET WAS NOT SPAWNED BY A SCARY ORANGE APE ! TRUST TRUMPET WITH NUCLEAR WEAPONS ?!!!","post_message":"Too soon? Lol. - kyle"}]
