[{"comment_id":"1231219033565772","commenter_b":"they can sew it to the mini brain they grew.....","commenter_a":"There is hope for me yet! Haha Juventas Buzevicius Moses Olivas Hanna Kozlowski Andrew Holtzmann","post_message":"Scientists have grown miniature kidneys in a laboratory."},{"comment_id":"866874116779101","commenter_b":"who voted that fugly bitch in ?","commenter_a":"Because she's batshit crazy","post_message":"Watch this! I guarantee it's the STUPIDEST thing you hear all weekend..."},{"comment_id":"802434323195863","commenter_b":"I support neither group. Blacks and whites need to get along. We are in a failing country that is falling apart.we need to get rid of this racism and focus on the big picture here","commenter_a":"As a member of the Armed Forces and a decorated war veteran...she does not owe me an apology. She used her platform to deliver a message while honoring a historic Black-ran group on their 50th anniversary during the one month Black history seems to be relevant. Coldplay honored the LGBT community in their performance but ironically there was no uproar over that. If anything @username you owe me, the Armed Forces, and the Veterans an apology for posting this crap and trying rally up sympathizers to further your racist agenda. Radical? Hardly....maybe you should brush up on some history and ask yourself why these organizations began in the first place before posting....oh and this...","post_message":"***BLACK PANTHER PARTY SUPPORTER AND BLM RADICAL DONOR BEYONCE OWES AMERICA'S POLICE, ARMED FORCES, & VETERANS AN APOLOGY***"},{"comment_id":"865465356933659","commenter_b":"But you DIDN'T worry when YOU went after Trump. NOW you're worried? I guess the old Texas saying is true: Your alligator mouth over loaded your mocking bird butt. TUFF SHIT. DEAL WITH IT.","commenter_a":"Oh, please. She'd do just about anything to Mr Trump to denounce him. You need another job, or stop putting your own opinions on your show. Get a life. I used to like you, but I'm not a fan of yours anymore","post_message":"Megyn Kelly tells Mediaite she worries that “someone’s gonna hurt me in the presence of my children.”"},{"comment_id":"10154813371927787","commenter_b":"Hate to tell you, but Nordstrom is an American company..","commenter_a":"President Trump daughter will make it even more with us American women behind her.. I will not be buying from these companies any longer....I buy American and I Support American...","post_message":"Press Secretary Sean Spicer weighs in on Nordstrom dropping Ivanka Trump's fashion line. is a direct attack on [President Donald J. Trump's] policies and [Ivanka's] name. @webpagelink"},{"comment_id":"10155425307145615","commenter_b":"\"But no use trying to educate them...\" I feel the same way, because after all: 1) This law is not discriminatory. Anti-discrimination law always trumps Religious freedom law, especially when discrimination is not explicitly addressed, as if the case for RFRA laws. If this was an attempted to legalize discrimination, the analogy would be like a man throwing a feather at a door to force it open. It is a sad attempt. 2) This is not religion being forced down your throat. It is religious liberty. Perhaps, it bothers you that a man would be allowed to wear long hair in an office that requires a clean cut, or that the Amish would not be forced to \"drive\" a minimum speed limit, but it hardly qualifies as religion being forced down one's throat, in my opinion. 3) This is merely a copy of the federal law with some of the ...","commenter_a":"I'm tired of Pence and all his follower's trying to \"defend\" him. They're all discriminating bigots!! Plain and simple!","post_message":"Wow!"},{"comment_id":"10154179770204330","commenter_b":"How did this happen,if the Zoo was secured? Just so happens this is a Black child. Had it been a White child,there wouldn't be no complaints. Hypocrites!","commenter_a":"Accidents happen. They do. However, accountability and fault are determined and responsibility for the loss of this priceless animal (financial) should be taken in a court of law.","post_message":"\"Accidents happen.\" That's the response from the mother of the 4-year-old boy who fell into the gorilla exhibit at the Cincinnati Zoo over the weekend, forcing zoo staff to shoot and kill the gorilla. She says too many people are judging her. Thoughts? @webpagelink"}]
