[{"comment_id":"10154876629414411","commenter_b":"Ĺol Canada doesn't care. Second biggest land mass on Earth, only 40 million people live here. We will put all the Americant's a few hundred km north west of Alaska. Enjoy the polar bears bitches.","commenter_a":"Please send him to Mars! We Canadians don't need this dickhead in our beautiful country...","post_message":""},{"comment_id":"10155469339470093","commenter_b":"NOOOOOOOOOOO!!! PLEASE no!!!!! Idiot progressives!!!","commenter_a":"Why would this NOT piss off everyone in NY who are legal tax paying American citizens??","post_message":"The impossible may soon become possible."},{"comment_id":"1602376966724515","commenter_b":"@username I am fully aware of who I have voted for since 1992. Hillary Clinton put herself in this position by NOT doing what's right and serving HER own interests. Public Service is a privilege and shouldn't be abused. I look forward to more ethical women running for President in the future, hopefully in my lifetime.","commenter_a":"She puts herself in a coma just hearing herself!! Her own husband is so unimpressed, HE doesn't know her campaign slogan!!","post_message":"LIVE NOW: Hillary Clinton early vote rally, Cedar Rapids, Iowa"},{"comment_id":"10153463081456336","commenter_b":"So all that is wrong with this country is the Hispanic Illegals?","commenter_a":"People need to realize something, Donald J. Trump is the only person so far in the entire field of presidential candidates who is willing to take on the genuine issues that the other candidates are so afraid to talk about. The truth hurts, medicine never tastes good. Whether or not he would deliver is another subject altogether. #Trump2016","post_message":"Donald J. Trump says Joaquin “El Chapo” Guzman's escape from prison is evidence that his past comments on Mexico are true. Read more of Trump's tweets and tell us your thoughts. @webpagelink"},{"comment_id":"938755412831598","commenter_b":"If she's a white lady, I'm a white lady.","commenter_a":"I am surprised she still has those white teeth in her mouth wow.","post_message":"Let's be honest. If this woman was black, she wouldn't be smiling for a cute little mugshot...because she'd most likely be dead now. #WhitePrivilege"},{"comment_id":"1186165314729122","commenter_b":"She can afford it. Why do taxpayers pay for her ?!!!! She needs get over herself.","commenter_a":"All cops should refuse ,let her pay for her own security.","post_message":"Several members of the Pittsburgh Police Department have refused to work security at Beyoncé's concert tonight."},{"comment_id":"10153286881869197","commenter_b":"the mother better be caring about who next door than what on facebook the people she see everyday","commenter_a":"That not discipline that torture and making a mockery of her child in front of the world what if she cause harm to herself mom can discipline at home not on Facebook","post_message":"VIRAL VIDEO: A 13-year-old girl secretly posted racy photos to #Facebook. Check out what her mother did when she found out: @webpagelink What do you think? Too harsh... or effective punishment?"}]
