[{"comment_id":"10153181342983812","commenter_b":"I do agree not to go looking for trouble. Often times, ya get more than ya bargained for ;)","commenter_a":"You can not go looking for trouble, find it, then decide you don't want said trouble. Its already too late!","post_message":"Relatives held a candlelight vigil to honor the life of Tammy Meyers. @webpagelink"},{"comment_id":"10152771526960950","commenter_b":"She didn't tell people to do this so she isn't responsible for what happens. She is only on the show since her older sisters were in the lime light to begin with and then as she got older she got in the light! It's not her fault these girls are dumb af!!! She paid money to get filler in her lips she didn't suck her lips into a bottle!","commenter_a":"I know kids who have done is following that crazy K lead. She should be held responsible if anyone becomes disfigured. Time for a public statement, Kylie.","post_message":"WARNING: Teens who participate in the #KylieJennerLipChallenge by suctioning their lips with a bottle or jar could be left permanently disfigured or deformed, doctors say."},{"comment_id":"10153145592901336","commenter_b":"I bet if not for her panties her guts would fall out","commenter_a":"Hope they send all the men back.","post_message":"Liana Barrientos, 39, who took six trips down the aisle in 2002 alone, will now be walking into court to face felony charges."},{"comment_id":"511818058979535","commenter_b":"Good they dont belong there. Its for shoppers and family time keep your zoo off all streets and malls! If black lives mattered so much to them why are they not stationed in the community?? #enoughalready","commenter_a":"They are a nuisance.","post_message":"The Mall of America is seeking a temporary restraining order that would bar the group from protesting. It also wants the group to post a message on social media saying the protest is cancelled."},{"comment_id":"10152653855300950","commenter_b":"Good! That mother is a monster!","commenter_a":"I don't know that it's child abuse, so much as poor parenting. Different religions physically discipline their children, pursuant to their faith - there's a line where it become child abuse, but I don't know that that threshold has been met. As to the poor parenting - yeah, she really should not have done this. Humiliation of a child is not ever going to be the correct form of discipline. And, it will likely result in later life issues. This is a private matter, which should have remained in the home. If the girl had friends, then they should have been told in private, not through a public shaming. And I would hope the mother focuses less on the letter grade and more on the actual learning. If your child thinks that \"allowed\" and \"aloud\" are the same thing - your problem is bigger than you realize.","post_message":"A mother is facing child abuse charges after she sent her daughter to middle school wearing a \"public shaming\" t-shirt for getting \"F's in all of [her] classes.\""},{"comment_id":"10153891687451782","commenter_b":"And what of Betty Shelby??? When will they lock that monster up? When will her day come?","commenter_a":"It is not over he may not but I saw a tweet today by a new elect and NY police are ready for several charges including the spirit dinners were those poor children are molested and then killed!! It may take time but all of them will be charged! Trump will be too busy to do it but their day will come!!","post_message":"President-elect Donald Trump's aide is suggesting that he will not pursue a probe of Hillary Clinton private email server in an effort to help her ;  @webpagelink"},{"comment_id":"10154707923201800","commenter_b":"hahahah omg yes!","commenter_a":"Now we're fucked. Like the Civil War and the Civil Rights Movement, this is yet another horrible scar on our nation. The damage was already done, and now it's just worse. I seriously hope our younger generations, myself included, can fix this within our lifetime. Shame on all of you who made this happen.","post_message":"Ready for either outcome. Tune-in to our LIVE Election Special tonight at 11/10c! #election2016"}]
