[{"comment_id":"649308955259683","commenter_b":"Stfu you stupid bitch.","commenter_a":"Gifts from the illegals","post_message":"A new disease is spreading like wildfire, doctors calling it the new aids.  Share this with your friends and family.  Have you seen these symptoms?"},{"comment_id":"541947015995878","commenter_b":"Impeach this peace of crap in the WH !","commenter_a":"boo the windbag muslim !","post_message":"Americans are furious after Obama hammers christians on TV.  What disrespect. He's gone too far with this.   Do you think Obama is out of line?"},{"comment_id":"10157535598360389","commenter_b":"The press just like the FBI is covering for Hillary!","commenter_a":"The media are stupid and if it was not for Mr. Trump running against their Idol they would not have a paycheck. They all need to take a long vacation and never come back. There grins are annoying.","post_message":"Question of the Day: What do you think of some of the press' softball questions to Hillary Clinton? Share your thoughts below!"},{"comment_id":"1024965370917718","commenter_b":"@username Agreed!","commenter_a":"Being vegetarian doesn't change much in the lives of cattle however. Nor hens. It's better than being an omnivore, yes, but still not cruelty free. Although nothing truly is. From medical treatments, medicine, to our pets sustenance, to palm oil, to beauty and household products, etc. As for diet, we are naturally omnivorous. We would not have survived very well as a species without meat as sustenance and the remainder for clothing/tools, along with plants, fruits, nuts, etc. Especially in the North.","post_message":""},{"comment_id":"899714753418554","commenter_b":"If we sent the illegals home wages would go up. It is called supply and demand. What are our collages and universities teaching these days?","commenter_a":"That's about half a million jobs for our citizens if we sent them home.","post_message":"Wow."},{"comment_id":"10154091613326491","commenter_b":"@username, being dumb is a choice. Well done. Did you decide to be straight ?","commenter_a":"Stop... you are American or you arent. Quit separating people by what body parts a person likes to sleep with and what color of skin they have... Just stop","post_message":"“When you don’t have data about a community, at times it can seem like the community doesn’t exist.”"},{"comment_id":"1797253250554324","commenter_b":"Tax the nfl that might cut into some of the players money lot of overpaid jerks. Funny how middle Americans love this country and those zeros will not embrace it. I see problems not the countries fault it's the politicians, take care of it at the polls.","commenter_a":"I'm done with the NFL you guys play a game and earn millions piss on all of you who disrespect our country!!!!","post_message":"BREAKING NEWS...."}]
