[{"comment_id":"1212512528838103","commenter_b":"STFU already! Hillary lost because she's Hillary. Get over it!!!","commenter_a":"Trump can't make an honest or decent response to anything.","post_message":"Trump’s Latest Twitter Tantrum Desperate Distraction From Tuesday’s Stunning Revelation. It’s likely not a coincidence that the President-Elect is rehashing won battles after Tuesday’s breaking news that FBI Director James Comey likely acted favorably towards Donald Trump with his October announcement that new evidence emerged in the Clinton email investigation. Read the whole story at Reverb Press HERE: @webpagelink"},{"comment_id":"10153659318868797","commenter_b":"You did a great job by taking this dog to the Vet, as well as putting you life at risk from being hit by traffic. And having to pay the bill just for an irresponsible person","commenter_a":"At least someone cared","post_message":"MUST SEE: This puppy was hit while wandering through traffic. A woman stopped to help, and even took the dog to the vet. Then, she held him in her arms as he died. The woman blasted the dog's owner in an angry letter she posted online, and it has since gone viral. Wow, you're going to want to see this:"},{"comment_id":"1612078455751826","commenter_b":"She wouldn't recognize the truth if it hit her in the face","commenter_a":"Hillary tells it like it is, OH that's terrible take it back, Donald Trump supposedly tells like it is, oh, he's so refreshing to have some one not pc and speaks their mind. F#@K all you people, you're nuts!!!. I really hate she seemed to walk it back, because it's the truth.Donald Trumps supporters are all eating out of the same trough.","post_message":"Mike Pence responds to Hillary Clinton's comment that \"half\" of Donald J. Trump's supporters are a \"basket of deplorables\": \"They are Americans and they deserve your respect.\" @webpagelink"},{"comment_id":"607183962802381","commenter_b":"@username then maybe you should move out of America if you can't handle it. Bye Felicia","commenter_a":"Only reason big cities elect her is Bc they are the low life's looking for their hand outs... Guess what?! You'll be returning your Obama phones soon :) haha","post_message":"We’re in New York with Chris Moody and Vanessa Yurkevich who are talking to voters about tonight’s dramatic election results. Any questions? Let us know! #CNNElection #ElectionNight #MyVote"},{"comment_id":"1271166009570419","commenter_b":"Get some sleep pretty lady","commenter_a":"The story that will never die.","post_message":"The DNA analysis that prompted a Colorado prosecutor to exonerate the family of 6-year-old beauty queen JonBenet Ramsey in her 1996 murder was not as clear cut as she portrayed it at the time, a newspaper reported on Friday."},{"comment_id":"10154162143246756","commenter_b":"@username No, it doesn't. As a woman, you should pay attention to who thinks you aren't able to make decisions about your own body.","commenter_a":"Scalia institutionalized his vicious hatred of women and gay people and his lack of respect for the Constitutional rights of every American. If he didn't want people to speak ill of him after he was dead, he should have lived a different life. He was a hateful man and will be rightly remembered as one. Death doesn't suddenly turn a monster into Winnie the Pooh.","post_message":"Perhaps most of all, Scalia will be remembered for his scathing dissents. He was a reliable conservative, but every once in a while he broke rank."},{"comment_id":"1210524342343014","commenter_b":"Maybe she's drunk or high. Don't even look good","commenter_a":"Notice how fb took off the video? CNN reporter admitted Obama paying off the media to only cover bits and pieces of Trump speeches, to keep the media from exposing Hillary's corruption","post_message":"What is wrong with Hillary? She just completely froze AGAIN...her handler had to rush the stage, comfort her, and tell her what to say! WATCH..."}]
