[{"comment_id":"1150014791717682","commenter_b":"Can we class-action sue her for discrimination, like the gays do when you won't bake them a cake? And why not? What's the difference?","commenter_a":"Another idiot committing corporate suicide!","post_message":"Maine Restaurant Owner Bans Owners and Supporters of AR-15 From Restaurant"},{"comment_id":"10153709063006350","commenter_b":"I can't stand Matt Lauer -- he's too much of a liberal for me.","commenter_a":"Hope not trump !!!","post_message":"'If I think for some reason it's not going to work, then I go back to my business,' Donald J. Trump told Matt Lauer about whether he would drop out of the presidential race. 'There's no question about that.'"},{"comment_id":"10153099972135329","commenter_b":"Nah, I don't think I will.","commenter_a":"Someone needs to give him his balls back.","post_message":"BuzzFeed Books editor Isaac Fitzgerlad wore makeup for a week, here is what he learned."},{"comment_id":"10155487950195354","commenter_b":"Then will she pay for all her vacations, her clothes, her helpers!","commenter_a":"44.4 Million on vacations alone...She need to pay that back! ..........She's NOT an elected official.........","post_message":"“I want a big paycheck for Michelle.”"},{"comment_id":"1004502652963001","commenter_b":"Better hope Hillary don't get to be President. This country will be a goner in 4 yrs. if she does.","commenter_a":"Oh, so Democrats are crossing over to vote for Trump. I see your game plan Dems. After Nov. gets here and if Trump is the nominee you all will turn around and vote Democrat.","post_message":"#FloridaPrimary"},{"comment_id":"10158083946035206","commenter_b":"Then clean your ears out!","commenter_a":"Can someone please tell me what the heck Trump stands for because to this day i haven't heard anything positive come from out of his mouth.","post_message":"Donald J. Trump supporters describe why it's sometimes hard to be for Trump. @webpagelink"},{"comment_id":"10153792774496162","commenter_b":"Anna Silva","commenter_a":"Lisa DeRosa Raphael","post_message":"Lucky Charms has finally created a marshmallow-only version of its cereal: @webpagelink"}]
