[{"comment_id":"455406524619303","commenter_b":"And guess what... that girl who got pinned to the ground.....yeah she has a pass to the pool.","commenter_a":"I love kicking people out from our community Pool. They are not allowed because of 'race' but because they don't own a house in our 'Gated' community and pay HOA fees.","post_message":"'The officer never asked any questions. He jumped out of the car and immediately started running to the black kids.'"},{"comment_id":"957822790936024","commenter_b":"Let's get all them bitches","commenter_a":"👌👍👊","post_message":"Human excrement gets flushed! Australia's most wanted ISIS terrorists just got smoked in Iraq. ~Will"},{"comment_id":"10153858888594474","commenter_b":"Actually, she needs to go to jail.","commenter_a":"Not soon enough!!!!! We might get Hillary so it will just be like having Obama in the White House.","post_message":"Let the countdown begin. Share if you're ready for the end of the Obama era!"},{"comment_id":"10153719642089091","commenter_b":"'@username so you've gotten an infection from using a public restroom ?","commenter_a":"Why would you let your 8 year old daughter go to a public bathroom by herself??!! Smdh.","post_message":"Thank goodness for the customers and staff members who helped rescue the 8-year-old after her mother heard her scream. Police say the man was caught carrying the unconscious girl into a bathroom stall."},{"comment_id":"10153122066896037","commenter_b":"Porter up there is absolutely right","commenter_a":"no, we have no backbone in the US so we will let Russia take what it wants.","post_message":"The leaders of #Ukraine, #Germany, #France and #Russia pledged renewed support for a tattered ceasefire in eastern Ukraine despite violations -- including the storming of a key town by pro-Russian rebels.  Do you think peace will happen?"},{"comment_id":"10152910744010779","commenter_b":"I believe that you're a dumb whore.","commenter_a":"Can you guys just NOT send me this one in the mail? Thanks.","post_message":"Reality-TV juggernaut, selfie queen, actress, model, mother, Internet-breaker, entrepreneur and video game subject Kim Kardashian has something to say: 'I believe that I am so much smarter than I'm portrayed.' The 34-year-old megastar talks about her scandals, family, and feminism in our wide-ranging new cover story. Here are 11 highlights you won’t want to miss: @webpagelink"},{"comment_id":"960457477322681","commenter_b":"Hunt these cops! Good Germans would say this!","commenter_a":"police state","post_message":"Officer Thomas Webster was just found not guilty of assault... even though he was caught KICKING and UNARMED MAN IN THE FACE as he obeyed police commands.  This is America, 2015. Not the Jim Crow Era.  From (Y) Counter Current News - MBD"}]
