[{"comment_id":"10155433619800500","commenter_b":"The article says nothing about the use of donor eggs, just that she sought fertility treatments.","commenter_a":"High risk of having babies w/birth defects !!!!!","post_message":"TOO OLD or OKAY? This woman is 65 years-old and pregnant with quadruplets. @webpagelink"},{"comment_id":"1132859160143668","commenter_b":"Ian, Trump has also excepted money from the Saudi's, ad a matter of fact, he owes them for a billion dollar hotel project in the UAE. So....please.","commenter_a":"I'm no trump supporter but things like this are just bias non stories. I'm sure if we went through each candidates individual supporters we could find a long list of unsavory people who believe and do unsavory things.","post_message":"The young, black protester was being escorted out at the time of the incident."},{"comment_id":"10153266614821336","commenter_b":"California has been sicking for some time! One of the things liberals in CA like to do is drive companies out of the state! Also turn off the water to the small farmers, that put 40,000 farm works out of work! Keep building houses when they don't have the water to supply to them. Build a high speed rail road that no one wants or needs!","commenter_a":"Hard to find anything dumber than a California Democrat.","post_message":"Nobody's laughing, Rep. Loretta Sanchez."},{"comment_id":"796247023857405","commenter_b":"Her mouth is perfectly formed for Donny DOUCHEBAG ...","commenter_a":"DISGUSTING human being !!","post_message":"This woman is a disgusting POS!"},{"comment_id":"1259153044105704","commenter_b":"You could try this? :) @webpagelink","commenter_a":"Judy Acres too bad we can't watch this :( UK only","post_message":"Absolutely spectacular footage from the BBC's latest nature documentary, #thehunt. Honestly, some of these shots look almost too perfect to be real.  \"Witness a polar bear sneak up on its prey using ice holes to surprise it. This is the first time ever this has been captured on film.\"  You can watch on iPlayer here: bbc.in/1j0xI5B"},{"comment_id":"10153516438174087","commenter_b":"Only stupid people would let Syrian.people come to the U.S. Or illegals.","commenter_a":"Han er decideret syg i hovedet Oliver Dagn","post_message":"“I’m wondering if you would be able to look at [Syrian refugee children] in the face and tell them that they’re not allowed to go to school [here],” a voter asked Donald J. Trump. \"I can look in their face and say, ‘You can’t come here,’” Trump replied to applause."},{"comment_id":"10152746114636545","commenter_b":"That's bootylicious","commenter_a":"Kaci, Ryan, Anthony and Cory - get home ASAP but do so in a safe manner.","post_message":"The roads are getting worse everywhere in North Texas and accidents are starting to pile up. Check the traffic conditions if you need to go anywhere.   TRAFFIC: @webpagelink"}]
