[{"comment_id":"10153154397831051","commenter_b":"Trump is absolutely right. Illegal aliens are not immigrants by the way. They are merely common criminals. Criminal is not a race.","commenter_a":"I don't want their jobs but we need our benefits. Would you let your kid go hungry to feed a stranger?","post_message":"We went to the Donald Trump protest this week to speak to his supporters and critics. Here's what they had to say. Do you agree or disagree with Trump when it comes to immigration?"},{"comment_id":"10153534266495399","commenter_b":"We don't need him and take little Mexico with you","commenter_a":"And he's supposed to be the \"smart\" one?","post_message":"Asked to clarify, Jeb said, \"Things happen all the time. Things. Is that better?\""},{"comment_id":"10156409017440354","commenter_b":"Hillary is a stupid c*** and anybody who votes for her is a f****** moron.","commenter_a":"@webpagelink George Soros is the money and the monster backing them all!","post_message":"Don't ask questions. Just trust Hillary."},{"comment_id":"10153659682115399","commenter_b":"Really? In what way could Trump have forestalled the Syrian refugee crisis?","commenter_a":"If Trump would have been in charge before this, these horrendous wars and humanitarian crisis may not be going on. It appears that Obama is way out of his league. #trumpforpresident","post_message":"Reminder: More than 100 people were killed and more than 350 injured in the coordinated terror attacks."},{"comment_id":"512454232283082","commenter_b":"To the person who said go back to Africa.... Pack your bags too & head back to Europe! Cuz white ppl ain't native to this land either. Dummy!","commenter_a":"Not worthy of my ear wax!","post_message":"Hip-hop legend Q-Tip is here talking about race and policing in America. Leave your questions in the comments."},{"comment_id":"1028722620528934","commenter_b":"Much better than the lying Hillary or senile Bernie!","commenter_a":"And the other morons will vote for Trump.","post_message":"Americas Freedom Fighters"},{"comment_id":"10153776672201770","commenter_b":"So Is @username","commenter_a":"Who is this Pollyanna? She thinks Hillary is all rainbows and unicorns. You can't put lipstick on a pig.","post_message":"\"She is a real person...\""}]
