[{"comment_id":"10153603206034342","commenter_b":"Make her Vice President...you will truly be elected","commenter_a":"Sarah Palin is Hott","post_message":"Sarah Palin is endorsing Donald Trump..."},{"comment_id":"10154074583926159","commenter_b":"However Cruz is a natural born citizen always has been always will","commenter_a":"Absolutely....Cruz is the true conservative and is a constitutional scholar. Trump is all BS and bluster.","post_message":"Would you watch?"},{"comment_id":"10153853111962217","commenter_b":"Well done Team GB proud to be British and the achievements of our wee islands athletes.","commenter_a":"US is winning the olympics. That's good. I heard who ever wins the olympics has home field advantage during the next world war.","post_message":"Good job Team GB ðŸ‘ðŸ‡¬ðŸ‡§"},{"comment_id":"1129911067026242","commenter_b":"Well said my friend....well said!! Megan Kelly WILL tear them apart...no doubt about it!","commenter_a":"Oh trust me they are in for a rude awaking during this interview. Big mistake if they think it will be a walk in the park. Megyn Kelly will rip them a new one. She is awesome at her job and takes no prisoners. Fox News is the only station not on Obama's payroll. ( not that this has anything to do with him) but it's the only news station were you can expect to hear the truth!!!! Love Megyn and Fox!!","post_message":""},{"comment_id":"10153855927834330","commenter_b":"Wow","commenter_a":"You kids are borderline retarded","post_message":"\"Dewshine\" is a mix of racing fuel and Mountain Dew. Two teens are now dead after consuming the highly toxic mixture ---> @webpagelink"},{"comment_id":"10153534824302550","commenter_b":"She wasted our tax dollars on fantasy.","commenter_a":"Why is everyone so negative? A thirteen year old took a state to court. That says alot. Why is it OK for the president to waste money talking about climate change but not her. Get your heads out of your Butts people. She is not the problem, but did try to come up with a solution","post_message":"A judge has ruled against a 13-year-old girl who took North Carolina to court over climate change More ---> @webpagelink"},{"comment_id":"995165647267071","commenter_b":"Ignorant fucking racist bitch","commenter_a":"Today is the first time I listened to his so-called speech, I usually either hit the mute button or change the channel. I sat through his speech and was dumbfounded...The lies were spewing all over the place, he is such a narcissist and egomaniac I could not believe what I was hearing. I hope and pray that Crooked Hillary, the Benghazi Butcher does not get elected because if she does, we are in for four more years of the same!","post_message":"Simple question: Are you happy or unhappy with the way President Obama has responded to the Orlando attack?"}]
