[{"comment_id":"1021100727949032","commenter_b":"I'm no a socialist I'm a total independent from the corruption government..I'm so proud of myself","commenter_a":"Bernie Sanders it's a socialist.. !!","post_message":"We're live in the #GOPDebate hall!"},{"comment_id":"10154689857838487","commenter_b":"What a complete idiot","commenter_a":"He gave his brain away, didn't he. That's got to be the reason. He was selfless and gave his brain away.","post_message":"Carson accused Kay of making him  bad guy, and asked Joe Scarborough, the show's host, to  her microphone off so I can talk."},{"comment_id":"818351058200569","commenter_b":"If he is here illegally, he should return home and come back through the front door!","commenter_a":" quality I would most like to magnify in human race is empathy. It brings us together in a peaceful, loving state, A very wise and educated man say it.","post_message":"New Latthivongskorn was brought to the United States from Thailand when he was 9 years old. New grew up in San Francisco, California, became an excellent student, and dreamed of becoming a doctor. A month after New graduated from Cal-Berkeley with honors, a 3.7 grade point average, and a major in Molecular and Cellular Biology, President Obama established the DACA program. DACA has allowed New to begin medical school and pursue his dream of becoming a doctor. New and other Dreamers like him have so much to contribute to our country. But if the Republicans have their way, New will be deported back to Thailand. Let’s remind them that #DACAworks."},{"comment_id":"10153639666243138","commenter_b":"You, m'dear, are brilliant. Wish I was a Floridian.","commenter_a":"Since we have Debbie Wasserman Schultz to hold to the fire for unfairly slanting the elections, I thought it might be productive to take her to task and donate to her democratic rival in Florida's 23 district Tim Canova. Knock her right the hell out of her seat in congress. Might wanna throw him 5 bucks and help him send her packing. It matters.You don't have to live in Fla to donate, it affects us all. @webpagelink #TellHimBernieSentYa","post_message":"I'm not saying Donald J. Trump won by appealing to the KKK, but if the hood fits…"},{"comment_id":"10155083272367994","commenter_b":"I don't care if this woman is a mental reject, I'd like to throw her off a bridge to see if she can fly.","commenter_a":"She forgot to take her psychotic pills...","post_message":"Officials: Woman throws dog from bridge, claiming it can fly."},{"comment_id":"1003724273013669","commenter_b":"This woman is dumber than a box of rocks!","commenter_a":"freaking nut case!","post_message":"Dems know where to get their votes..."},{"comment_id":"10152977695566234","commenter_b":"He does not have a chance in hell. Rand Paul 2016! Sweeny will NOT be our Governor either. LET FREEDOM RING!","commenter_a":"HELL NO!!!!!!! But don't worry, he'll NEVER GET THAT FAR!!!!!!!!!!","post_message":"Would Gov. Chris Christie's trademark brash demeanor be an asset as he dealt with foreign relations if he were elected president?"}]
