[{"comment_id":"10154960801467232","commenter_b":"@username what benefits do you offer","commenter_a":"They call it pennsyltucky for a reason. Outside of philadelphia its all trailerparks and farms.","post_message":"The Southern Poverty Law Center defines a hate group as an organization that has  or practices that attack or malign an entire class of people, typically for their immutable characteristics. @webpagelink"},{"comment_id":"10153206762797377","commenter_b":"That's right!!! They have started doing everything you have talked about! Next they will start Building the Wall!!!! Lmbo!!!! Go Mr Trump!!!","commenter_a":"They can`t stop the peoples chose for Trump that`s already there!!","post_message":"Trump Tweets: Wow, because of the pressure put on by me, ICE TO LAUNCH LARGE SCALE DEPORTATION RAIDS. It's about time!"},{"comment_id":"10155069293808010","commenter_b":"@username well since trump is saying illegals voted for Hilary!!! I'm being sarcastic you Troll!!","commenter_a":"Oh let me guess they were illegal immigrants 2","post_message":"He operated the scheme for two years from behind bars. He and an accomplice made more than $600,000."},{"comment_id":"10153245617818908","commenter_b":"So, let me get this straight, a man with his foreskin is unhygienic, but a woman with her parts all tucked away inside is hygienic? How does that logic make any sense? It's called basic hygiene practices. FYI, as men age (much older) their penis could fold inside of him and it will need pulled out to keep clean. This could be the issue your Family member was talking about. It's no different than when you wash your own genitals.","commenter_a":"I have 3 boys and all are circumcised. As a person that has family in the medical field it's for cleanliness when they get older. My mother worked in a nursing home and she has horror stories from having to bath uncircumcised men. It's gross not to be. Infection and bacterial growth is more common if the foreskin is still intact","post_message":"Why do Americans go out of their way to remove this part of human anatomy, when the rest of the world does not?"},{"comment_id":"1663378140627092","commenter_b":"wow cant wait to see u guys in 10 years w ur sugar daddy/ies, and ur lavish lifestyle its gonna be great","commenter_a":"@username time to sign up😂","post_message":"This summit actually teaches young women how to score a sugar daddy..."},{"comment_id":"1266265003452033","commenter_b":"YES THIS IS WHAT I HEAR RULES AND LAWS ARE NOT FOR ANY POLITICIAN JUST FOR THE REST OF US","commenter_a":"but we already knew that, it's just nice to see the truth and evidence being uncovered.","post_message":"The rabbit hole just got a lot deeper... the corruption and incompetence that has been put in place to protect Hillary Clinton is mind boggling.  It's time we did something about this."},{"comment_id":"10152994622700796","commenter_b":"Women are more likely to have chronic pain, be prescribed prescription painkillers, be given higher doses, and use them for longer time periods than men. Women may become dependent on prescription painkillers more quickly than men. Women may be more likely than men to engage in “doctor shopping” (obtaining prescriptions from multiple prescribers). Abuse of prescription painkillers by pregnant women can put an infant at risk. Cases of neonatal abstinence syndrome (NAS)—which is a group of problems that can occur in newborns exposed to prescription painkillers or other drugs while in the womb—grew by almost 300% in the US between 2000 and 2009. ---@webpagelink","commenter_a":"These addictions for many were not choices but had a slow way of happening. Many were prescribed pain relieving drugs after surgery or have a bad back or another painful injury and the doctors wrote prescriptions for opioid medicine like the were going out of style. The family that owes the company that make Oxy, are literally billionaires now just by selling Oxycontin. When you write millions of prescriptions for Oxy in less than 20 years, what the hell do you think that will happen? Many of those people become addicts if you take these drugs for a long enough time. When the doctors stop writing scrips, the people turn to any source available. IMO, Doctors are responsible for the current heroin epidemic in this state and country.","post_message":"“It focuses on a social service intervention as opposed to criminal justice intervention, and it’s been very successful in Seattle,” Portland Mayor Michael Brennan, who is a licensed clinical social worker, said."}]
