[{"comment_id":"10152910640286770","commenter_b":"Buzz off you jerk!","commenter_a":"Who is this 'Jon Stewart'? Is he Portuguese?","post_message":"Jon Stewart: 'Donald J. Trump has no control over the projectile vomit of dickishness that comes out of his mouth every time he opens it.'"},{"comment_id":"10154838138336509","commenter_b":"If she does a good job, why should anyone care that she is single?","commenter_a":"China, it's non of your business. So proud of our new president.","post_message":"'As a single female politician, she has no emotional encumbrances of love, no family restraint, no children to worry about. Her political style and tactics are often emotional, personalized, and extreme.'"},{"comment_id":"502394676575976","commenter_b":"I wonder if she's inbred?","commenter_a":"Stay classy, Penny. Fucking troll bitch.","post_message":"Today's fan mail."},{"comment_id":"424924557632585","commenter_b":"Yup she is a liar ,n scandals n bullshit ,just like he cheating filthy fall down husband","commenter_a":"Yossarian Lives Akhil Babel Vinayak Sharma","post_message":"Here's the #HillaryClinton scandal you aren't being told about that actually matters."},{"comment_id":"1712281645723927","commenter_b":"Ash Jesus another self righteous know it all illegal immigrant go back to your country bitch this is my country not yours","commenter_a":"Makes me laugh that those who are here 'legally' think they are any better than those who cross the border. Yes deport those with criminal record, but why throw out hard working folks like my parents who come here for a better life and contribute to this country. They also pay their taxes. People screaming out CRIMINALS to immigrants as if US citizens weren't criminals. Instead of complaining about immigration, perhaps you should demand the government to stop exploiting other countries' resources and their people. Bring down your ignorance and arrogance down a notch. Seriously, who do you all think you are? When you die and rot in your tomb, you won't be needing your 'citizenship'.","post_message":"Do you agree or disagree with the majority of Americans on this?"},{"comment_id":"10156072417220603","commenter_b":"Well take up not enough jobs with the people that keep letting foreigners in the country.","commenter_a":"Yall saying people should be able to support themselves are not understanding that jobs at McDonald's etc are NOT meant to support a family. If you have a job there and have a family they (McDonald's) and us (people that will take the hit of a min wage increase because the cost of products will go up) should not have to pay for your poor choices for not being mature and either going to college or tech school or working your way up in a company. Min. Wage jobs are for high school/college students so if youre past those ages and still making min. wage you should've made better choices and should stop expecting the same pay as people that did!","post_message":"Do you think the minimum wage should be raised?"},{"comment_id":"10153307243877217","commenter_b":"Holly Allcock sucks all cocks","commenter_a":"Trump is the most hated man in the world. What a disgrace!","post_message":"About 568,000 people have called for action against the presidential hopeful."}]
