[{"comment_id":"10153255280801336","commenter_b":"You can't fix stupid. She was stupid before she went to college or she wouldn't have come out that way!","commenter_a":"Lol GW created ISIS... yeah, and Obama is the best President we've ever had. I think you should get a refund for your college tuition, because it's not working...","post_message":"College student to Jeb Bush: \"Your brother created ISIS.\""},{"comment_id":"10152920092525736","commenter_b":"Because I dive in pussy. No fecal flakes on my","commenter_a":"Because they know what they're doing is wrong & disgusting.","post_message":"41% of transgender people try to kill themselves, compared with 4.6% of the general public, according to a study."},{"comment_id":"649171271940118","commenter_b":"So how many times would we pay for the same illegals to be deported again and again and again","commenter_a":"Yes deport all the illegals that are in Our Country, if they can't come in our Country legally then they don't belong here, the illegals are nothing but a drain on our economy, with welfare, food stamps, medical housing and transportation which Obummer is giving them all, and Bankrupting our Country, all at the tax payers expense. I feel that they should have been deported long ago and not allowed to come back into the US since they came in illegally in the first place and those that have done this they should never also be allowed to try for Citizenship to The United States...","post_message":"Donald Trump just showed everyone how much illegals really cost. Enough is enough. Send them all back! Do you agree all illegals should be deported?"},{"comment_id":"10153434645860329","commenter_b":"no, #4 killllllled me. so funny.","commenter_a":"Matt Megan Freeman @username Megan KellyThis is actually the funniest thing I've read in a while.","post_message":"LOL"},{"comment_id":"10153661151756167","commenter_b":"Ditzy Daisy, throw her out! Keep her coat! Knock the cr*p out of her! Go ahead back to your momma! Drag her outta here! Ditzy Daisy, she's really nuts folks, really nuts. Yep, that's how Drumpf would handle her...","commenter_a":"That goes for all you communists who call us racists and if you spell president trumps name wrong again. The democrats are the party of anti american hate mongering. Now we can sue yo ass.","post_message":"Trump’s plan to “open up our libel laws” is just the beginning."},{"comment_id":"1118654024897515","commenter_b":"Chemo is poison!","commenter_a":"Nicole, how insensitive can you get? Chemo? with all of the cancer survivors and sufferers fighting their disease with GOOD lifesaving chemo? Hope you never need CHEMO. Trump is not CHEMO. He IS POISON.","post_message":"“The Trump supporters see Trump as political chemo. He may be toxic. He may kill every healthy cell in the bloodstream. But he is the only cure for the cancer that is Washington establishment.” - Nicolle Wallace"},{"comment_id":"1850461285187986","commenter_b":"If hillary clinton introduced herself to me as Hillary Clinton I wouldn't beleive her.","commenter_a":"#alwaysHillary","post_message":"Hillary Clinton holds a rally in the battleground state of North Carolina."}]
