[{"comment_id":"10153079679845950","commenter_b":"What a dumb ignorant bitch","commenter_a":"When it's not your turn, it's NOT your turn! That is how press conferences work people!!! TRUMP 2016 :)","post_message":"JUST NOW: Donald J. Trump tells reporter Jorge Ramos to sit down, has him escorted from press conference: \"Go back to Univision!\" \"You can not deport 11 million people,\" he yells: @webpagelink"},{"comment_id":"1048961388493889","commenter_b":"@username and what do you mean by Americans pay for illegals not you I am an American last I checked","commenter_a":"I don't know what your being told but Obama has more people deported than any other president. ...I see it constantly in the Hispanic news channels","post_message":"CIS found that criminal prosecutions for immigration offenses have dropped 36% over the last five years and due to sanctuary cities policies, the detention of illegal aliens in jails is down by two-thirds."},{"comment_id":"10154930045761037","commenter_b":"Don, you can get you point across without being condescending and juvenile. Just ask Bernie Sanders.","commenter_a":"Watch the trumpettes ignore the financial FACTS and whine that everybody isn't bowing down to their orange cheeto god. LOL at them. Hey trumpettes: you were conned. Again. Told you so.","post_message":"WATCH: Donald J. Trump tours Carrier plant, gives speech after company agrees to keep 1,100 jobs in Indiana."},{"comment_id":"1098378433550493","commenter_b":"Gore's win was not robust enough and Bush et al weaseled their way into the White House and blew up the Middle East nearly blew up Roe V Wade - even if you have to hold your nose it will be worse if Hillary loses - people will die, the environment will be further destroyed, social security will be looted. Please reconsider. Fight for a third party after the election or begin now but please don't let Trump win - the pleasure of the spite will not be worth it. Just look at the destruction, devastation, the inhumanity, wreckage of Bush presidency. If Hillary is defeated because of the spite of Bernie people it will be a Pyrrhic victory certainly.","commenter_a":"Bernie, I will follow you anywhere... but I won't be able to vote for HER. I don't begrudge you supporting her... I'm sure there was a lot of pressure to do so as well as strategic reasons. I CAN get behind down ballot progressives though! Love you, Bernie!","post_message":""},{"comment_id":"10153570996910329","commenter_b":"*high five* you guys are awesome! :D","commenter_a":"I'm a proud Christian and I'm ecstatic about this. I'm not even gay. Or American.","post_message":""},{"comment_id":"785803421556302","commenter_b":"GREAT!!! MAKE HER LIVE BY OUR LAWS!!!","commenter_a":"Yes sir jail or take that crap off , its disrespectful !!!","post_message":"Judge Throws Muslim Woman In Jail For Refusing To Remove Headscarf In Court. If you can't obey our laws, you go to jail. Do you think she had this coming?"},{"comment_id":"787563944661438","commenter_b":"No more shrubs!","commenter_a":"What do you expect from him, he is a Bush.","post_message":"Democrats have a field day mocking Jeb Bush for pretending to be \"his own man\" despite the fact his policy advisors list reads like a Who's Who from the Reagan administration and those of his father, George H.W. Bush, and his brother, George W. Bush #ItDoesntFallFarFromTheTree"}]
