[{"comment_id":"10153863012497042","commenter_b":"Stfu pussy","commenter_a":"Well, The Knicks Can't Hit A Shot, But I Guess Shots Can Hit Them...","post_message":"BREAKING: New York Knicks player Cleanthony Early was held up at gunpoint and shot in Queens just hours ago, NYPD says."},{"comment_id":"1283735711683013","commenter_b":"horrible woman","commenter_a":"How bitchy she is...very bad attitude though","post_message":"The Hungarian camerawoman who tripped and kicked migrants has been sentenced."},{"comment_id":"10156684390715354","commenter_b":"Pussy.","commenter_a":"Yikes...say goodbye to England","post_message":"Prime Minister David Cameron announced: “I want London to stand alongside Dubai and Kuala Lumpur as one of the great capitals of Islamic finance anywhere in the world.”"},{"comment_id":"1026655844022093","commenter_b":"so, we didn't have Zero cases of measles in the US in 2000 then?","commenter_a":"Wake up. Measles has NEVER been ERADICATED!","post_message":"Let's take a moment to remember that measles was ERADICATED from the USA in 2000. Nice job, anti-vaxxers."},{"comment_id":"10154557773663203","commenter_b":"Its like sayin that one is born an alcoholic or a chain smoker... It is a LEARNED action","commenter_a":"Uh...no, most Americans don't say that!","post_message":"Are gays ‘born that way’? Most Americans now say yes, but science says no"},{"comment_id":"1641329602799278","commenter_b":"Black lives matters ass bitch","commenter_a":"This person needs to be arrested!","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"},{"comment_id":"1230498736993040","commenter_b":"why was she doing in the motel with him for. bah bah bah any way what has all this got to do with running the country .alot of men have had women but Trump is rich and they are after his money so stop so he may have kissed someone well i sure they wanted him to women were after him when he was younger and maybe now to .come get a life..","commenter_a":"Interesting!!","post_message":"'When I saw her on TV crying, I felt like she did a 360-degree turn here.'  Full Interview: John Barry refutes the sexual misconduct accusations against Donald J. Trump made by his cousin and former 'Apprentice' contestant Summer Zervos."}]
