[{"comment_id":"10156113177590725","commenter_b":"@username What was your last name @username again? we really need the wall!","commenter_a":"Like you always say China is eating our lunch.","post_message":"Depression- be careful of China!"},{"comment_id":"10153982598576509","commenter_b":"Burn","commenter_a":"@username Angel Castro @username Ivan Longoria noooooooohhhhhh!!!","post_message":"Some retailers are offering Caitlyn Jenner costumes for Halloween, but critics say these costumes mock the transgender community. What do you think? @webpagelink"},{"comment_id":"10153573127079268","commenter_b":"then get up lock n load and go fight..i dint want my kid dying for your stupid ass. Wordy @username","commenter_a":"\"Republicans trying to find a way to go to war and make their sugar daddies happy.\"","post_message":"The House is looking for a loophole."},{"comment_id":"933218310052361","commenter_b":"So how many snipers are needed to guard them from poachers?","commenter_a":"There's a herd in Florida too.","post_message":"Well, would ya look at that! (via TakePart.com)"},{"comment_id":"10153120617440927","commenter_b":"Yep, she's the best they got. crappy pants and all","commenter_a":"You can't help but admire a woman who stays married to a serial rapist and craps her pants during the last Democrat debate.","post_message":"59 TIMES: Billy Graham has been in Top Ten more than any other person Pope Francis and Donald Trump both got 5% this year Teddy Kennedy tied Blessed Mother Teresa with 18 years on the most-admired list"},{"comment_id":"10153779129081336","commenter_b":"If she took responsibility where is the jail time?","commenter_a":"The fact that she is actually running in 2016 with all this going on shows me that there major sociopath here... MAJOR!! At least wait till the Bengazi investigation is over and maybe not in the front of our minds.. Can't believe she is running.. I don't get how people could vote for someone who lied straight face to the country ,,,","post_message":"\"I took responsibility, and as part of that, before I left office, I launched reforms to better protect our people in the field and help reduce the chance of another tragedy happening in the future,”  Hillary Clinton said a short time ago at today's Benghazi hearing."},{"comment_id":"1374679629226158","commenter_b":"No they are NOT normal. Maybe they are from his neck of the world but the Western world not so much. England needs to wise up and get rid of him and the rest of the muslims that are taking the country over before its too late.","commenter_a":"Can't stand this guy what is he doing in US???","post_message":"The new normal."}]
