[{"comment_id":"449537148504213","commenter_b":"Lindsay Graham needs to shut the Hell up","commenter_a":"I guess I am part of the dark side and this asshole is one of the bright politicians that are bankrupting America!??","post_message":"Lindsay Graham made this highly controversial comment about Donald Trump. Do you agree or disagree with him?"},{"comment_id":"10154876019385329","commenter_b":"Better fat than a dumb Mexican. Have fun once trump is elected. Fool. Lol","commenter_a":"\"Fat\" the word you are looking for is \"Fat\"","post_message":"Simone Mariposa told BuzzFeed News she created #WeWearWhatWeWant to \"highlight plus-size girls making unconventional fashion choices, and looking amazing\"."},{"comment_id":"10153256342071336","commenter_b":"Thank you.","commenter_a":"Good! He deserves it!","post_message":"Breaking News: Jury sentences convicted Boston Marathon bomber Dzhokhar Tsarnaev to death."},{"comment_id":"967087283327615","commenter_b":"Yes you scared little woman","commenter_a":"This muslim kid brings a suitcase filled with wires and people are being mocked for over reacting?","post_message":"Standing tall after an outrageous arrest."},{"comment_id":"577042442420795","commenter_b":"Lmao and crystal you're vote dosent count dumb ass. Have fun. In the end the government is choosing hillary over the rest of the puppets. This country was never and will never be good. And like I said cunt. He ships jobs out of fucking state. But hey research dosent count when a babbling moron says shit you like does it fucking broad? And you're voting for another greedy old men who has already said we're going back to war. And starting another war with Mexico if they don't pay for his little wall. You're stupid as fuck. Fucking little sheep. No a pig. Eating the shit they tell you. Fuck the media. It's all bull shit. Just like your vote. The world would be better without trump and his little feeble supporters. All so violent. All short of a few brain cells. Lmao you all get dumber and dumber ...","commenter_a":"This really exposes the mass ignorance in this country. The media brainwashed assses will stoop to any level. I remember when nobody hated Trump. Then the government owned media started a smear campaign. Wonder why the media would tell so many lies on one person. He's obviously a threat to the punks running things in this country.","post_message":"Because Donald Trump’s star continues to be vandalized, the Hollywood Historic Trust is considering removing it from the Hollywood Walk of Fame."},{"comment_id":"10153262230564255","commenter_b":"Evil like this should be flogged. He's a monster like the rest of the TeaParty Jerks.","commenter_a":"I truly believe this man, Ted Cruz and their followers have very warped brains that will only bring greater harm to the world than Dubya/Cheney created and we are still trying to repair! They whole group needs to be tried and sentenced to jail for 3 years for TREASON!","post_message":"Losing his grip on reality, or lying shamelessly?"},{"comment_id":"1553360474683977","commenter_b":"This sellout Hispanic wants to sell you some crappy shirt","commenter_a":"As American hispanics, we are tired of how all of these coward racist liberals that hate America like Obama, Clinton, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, we're supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of our skin... disgusting. That's why we support Donald Trump. Show everyone your support for Trump by buying the fantastic Trump Strong t-shirt at: www.teespring.com/trumpstrong . And let's Make America Great Again! Thank you.","post_message":"During a Colorado rally on Sunday, Trump unfurled an upside-down rainbow flag with the words \"LGBTs for Trump\" written on it."}]
