[{"comment_id":"1363879910298702","commenter_b":"Yeah! Stupid Sheep","commenter_a":"Love Bernie Sanders! #feelthebern","post_message":"Bernie Sanders was cheered for like a rock star during his surprise visit to a Verizon picket line in Brooklyn today. Read full story: @webpagelink"},{"comment_id":"900210363349638","commenter_b":"Yep, definitely my twin lol","commenter_a":"@username this you lol had to double take lol","post_message":"“There has never been anything like this seen in a fish’s gills before.\""},{"comment_id":"927281534054105","commenter_b":"He doesn't belong in America!!!! Get out Obama!!!","commenter_a":"He is a traitor and should be impeached.","post_message":"This is seriously outrageous."},{"comment_id":"10154153182021519","commenter_b":"The joke is going to be on the fools who think Trump is bringing their jobs back.","commenter_a":"... . : get uses to it, the next four years is going to be the Donald Trump Aion of the dead-letter-literal-interpretation Christian religious right fundamentalists. The poor rust-belt have-nots put Trump in office because of neoliberalism global economics And the religious right put Trump in the White House , because They want Supreme Court judges to turn back abortion and gay rights etc. . And neoliberal Wall Street buddy's of Trump will get what they want , deregulation for Wall Street and tax cuts. The right wing is in the candy store and everything is free . Like I said; the next political reality show startes after November. ~~~ ~","post_message":"Ted Cruz in the Supreme Court sounds like a nightmare."},{"comment_id":"10154464854894087","commenter_b":"Your fucking Scum","commenter_a":"World's Greatest Groper...engraved on the back of the medal.","post_message":"BREAKING: President Obama awarded Vice President Joe Biden with the Presidential Medal of Freedom -- the highest civilian honor -- in the surprise ceremony."},{"comment_id":"10154070918229330","commenter_b":"And that moron idiot Trump??? His posture is dangerous.... Anyone who thinks otherwise is misinformed and reckless, to say the least","commenter_a":"MY TWO CENTS - To all the people who love politics. I can’t predict the future but let’s take a hypothetical in which Donald Trump is the presumptive nominee. Let’s take it one step further and say for this narrative that he runs against Hillary Clinton. I think the race to be POTUS will be close, and irrespective of who wins, can you imagine of what Donald Trump is going to do with all the dirt on Hillary Clinton. She and her husband amassed a 200 million dollar fortune while in political office. If they both worked their entire lives for the government, they couldn’t make that kind of money, let alone have it in the bank. That didn’t go unnoticed. She got a $650,000 for a 45 minute speech from a “bank,” but swears she will kick their butts to the curb (yeah right). Her email server was used ...","post_message":"Nearly 8,000 people are expected to gather at the Convention Center when Donald Trump makes his way to Hartford tonight. @webpagelink"},{"comment_id":"1121295257893818","commenter_b":"Maybe the sign should have said \"ladies don't pee on the toilet seat\".","commenter_a":"By the Holy Ghost I am being formed in the Earth! Says the Lord, My Time has Come! When I say, , My Kingdom COMES FORTH! Now is the Day of Salvation! Whoever wants it . Whoever is thirsty for Right and Good, . Whoever is hungry for Love and Peace and Deliverance from evil, . Now is The Time!!! When u Ask me, I give. Whoever Asks will Receive. Believe! Believe! Believe! Now is The Time!","post_message":"The owner of Windy City Pizza posted a sign that appeared to reference the controversial topic of transgender restrooms: @webpagelink"}]
