[{"comment_id":"1072525059447912","commenter_b":"Well actually Tara bring em all to your house ok AMERICA FOR AMERICANS !","commenter_a":"Correct me if I'm wrong but majority is suppose to rule in AMERICA and you only have 4 States that want these people and 20 that don't keep them the F out of America !!! AMERICA FOR AMERICANS !!!","post_message":"\"There is absolutely no constitutional power for a state to exclude anyone from its territories,\" said one legal scholar."},{"comment_id":"1228827110542853","commenter_b":"Liberals dont like putin cause they love isis","commenter_a":"So this is liberalism?","post_message":"She says Trump needs to step down before the inauguration, and the audience agrees!  Shared by Occupy Democrats, LIKE our page for more! Video from The View."},{"comment_id":"10153239420904087","commenter_b":"WooHoo - I'm stupid as hell says Trumpette fool hoping to be wife #4.","commenter_a":"Woohooo! #Trump2016","post_message":"“I think Donald J. Trump changed the opinions of the African-American pastors that were in the room,” Pastor Darrell Scott told CBN News. “They saw a side of him outside of the media depiction, and that they would give strong consideration in regards to supporting his presidency.\""},{"comment_id":"10152833310366051","commenter_b":"She prostituted herself out for the Republican party without thinking of the fall out from orally satisfying the president. He never did anything with her. He allowed her to get on her knees and prostrate and prostitute herself. She and the ugly woman with her ruined their own lives, not his.","commenter_a":"Good job Mr. Shanks. The worst part is that he carelessly wrecked the life of a young vibrant Monica Lewinsky. What a man! What a man! Jerk!","post_message":"The man who created Bill Clinton’s official portrait hid something in plain sight – and the Clintons aren’t happy about it."},{"comment_id":"611157035758918","commenter_b":"Deport them","commenter_a":"I would hope the FBI is investigating this organization for violating a US law!","post_message":"The \"religion of peace\" strikes again..."},{"comment_id":"1146539692060530","commenter_b":"I have 3 son's and from the time they were little my husband and I taught them to never hit a girl told them to walk away from them,they never ran into a situation where happened, but I got to say if a girl( and I'm using this term lightly) ever hit one of my son's like she is going after this guy ,I probably would tell them if they act like man treat them like man this girl talks and act's like a guy!!","commenter_a":"Never hit a woman. Period. Walk or run to get away, but don't hit her. File a suit, get her charged, don't strike a female. Unless she's trying to kill you. Then do what you have to.","post_message":"WATCH THIS BEFORE DINNER AND ... discuss with your son. 16M video views. Wild stuff."},{"comment_id":"10152933531687434","commenter_b":"Sex is only for straight, married, rich people!","commenter_a":"It's like they WANT teenagers to have babies. No sex ed, no planned parenthood. Since we know abstinence only education does not work, what else can we take from this?","post_message":"“If they’re doing such a great job, why aren’t these things better?” Bobby Jindal asked of Planned Parenthood."}]
