[{"comment_id":"1272474692787949","commenter_b":"She looks very ill, mentally, emotionally, physically and spiritually.","commenter_a":"Fuckin mental!","post_message":"WHY. WON'T. YOU. LEAVE? You're like that nasty drunk chick who won't leave the party after it's OVER."},{"comment_id":"10154230431661770","commenter_b":"Is that all they got going for them fake boobs, fake everything it looks like","commenter_a":"No one cares lol","post_message":"Kim Kardashian just wore the most ridiculous dress."},{"comment_id":"1832396510332680","commenter_b":"Should we really call it entertainment..I call it junk","commenter_a":"Why do you suppose Liberals love the entertainment biz and wanted control over it..it's one of their mainstream vehicles to get their agenda across...so much for entertainment anymore..","post_message":"“The music industry suffered a melt down on national television during the American Music Awards – launching into unhinged, profane tirades directed at President-elect Donald Trump and his wife, Melania,” Todd Starnes writes."},{"comment_id":"1052907811455998","commenter_b":"She looks like Hitler's nasty ass! THERE'S A PARTY GOING ON AND THE TRUMP TRAIN TO GET ON, CHOO CHOO, CHOO CHOO","commenter_a":"The left wing nuts see trump as a dictator. He's trying to follow the Constitution and our rule of law. What a bunch of morons","post_message":"Sarah Silverman is a _____________."},{"comment_id":"10153797525542183","commenter_b":"@username No it was the racist Obama that started this long before Trump was running for president. He wants to incite the Blacks to get them out and vote Democrat so he had to get the media to claim Blacks were being killed by cops. The only thing he left out was they were Black criminals attacking cops that were being killed.","commenter_a":"Obama is the poster boy for the \"Black Lives Matter\" racists. Obama started this along with his media puppets to get Blacks to vote Democrat. The Democrats do not care how many cops or law abiding Blacks have to die to get and keep their power.","post_message":"Don't expect a word of this to sink in with those suffering from ODS."},{"comment_id":"960437774039688","commenter_b":"Get the delegates and you win.. How would they screw him if he gets the necessary votes?","commenter_a":"If after winning FL, MO, NC and IL, Trump does not get nomination, Rubio and Kasich do not drop out... I with all my family and friends will never vote for GOP.. We will be life time democrat..Trump is better than all GOP candidates , if not trump than Clinton or Bernie is fine for me because GOP does not count out votes as votes... They want to do what they want.. They don't hear our voice...","post_message":"\"Donald Trump is one of the two most talented presidential candidates any of us have covered.” Mark Halperin Bloomberg Politics Managing Director Editor"},{"comment_id":"10153989537064203","commenter_b":"Lots of women in Iran do not wear head scarfs","commenter_a":"I wouldn't want to land there. They'd want me to wear a headscarf to walk off the plane. Nope","post_message":"If they had not become international pariahs, could Tehran have been to airline routes what Dubai now is?"}]
