[{"comment_id":"10153708332298984","commenter_b":"Omg. Women bitching. Grow up","commenter_a":"i will always agree with Dana...............jan","post_message":"These woman got into a debate so intense, there was only one way for Megyn Kelly to cool them off... Do you agree with Dana Loesch?"},{"comment_id":"1387674034582344","commenter_b":"@username if i had a girlfriend i probably would not watch porn, but women are picky and i am nothing special.","commenter_a":"BAN PORNOGRAPHY...simple. It is a debauched and at times cruel form of sex and at the moment is fully open to those low-lives whose brain thinks it's fully acceptable to either engage in such ridiculous practices or expect their partners to or inflict it on others. Of course this terrible crime on this poor girl was inflicted by a deviant but the role of watching pornography put fuel to the fire...BAN IT!!!!!!","post_message":"The man who held Elizabeth Smart captive when she was a teenager regularly looked at pornography, which \"just led to him raping me more,\" the now 28-year-old woman says in a new video."},{"comment_id":"749120498611861","commenter_b":"Ghetto trashy bitch.","commenter_a":"TELL ME WHO IS RACIST,,HE WAS A GENTLEMEN..I WOULD HAVE SLAPED HER ASS","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO] Racebaiters will never say anything about this. What would you do in this situation?"},{"comment_id":"983699055080206","commenter_b":"Stay out of the bedroom of married women.","commenter_a":"Yes because of his sorry voice and music, put your money where your loud mouth is west, take on a navy seal and see what happens to your sorry arse. Then let them send you to pakistan and see what happens, I bet body bag for you","post_message":"DELUSIONAL! Kanye thinks he's tougher than an American soldier. 'LIKE' if you think Kanye West is just a completely idiotic LOSER. [Read below] @webpagelink"},{"comment_id":"10152922358545927","commenter_b":"PLEASE GET RID OF THIS TRAITOR NOW.","commenter_a":"This guy is quickly becoming a fossil himself.","post_message":"Obama VOWS to \"convene other nations to meet THIS threat. ...\" Can you guess what \"THREAT\" Obama is trying to combat?"},{"comment_id":"1187655654624295","commenter_b":"You couldn't even please your husband, what makes you think you can please us? #NeverHillary","commenter_a":"Nice","post_message":"In the presence of practical, tactical brilliance at Hamilton: An American Musical."},{"comment_id":"1070333876354408","commenter_b":"She makes my ears hurt.","commenter_a":"She will say anything and she will lie to America like she's always there","post_message":""}]
