[{"comment_id":"10154739043556336","commenter_b":"Did you read her comment, Michael? Kapernick has his rights, we have ours. But our rights aren't as relevant?","commenter_a":"And yet again, we have the right to not patronize the NFL that allows players to disrespect our military, LEO and country.","post_message":"\"If you have the platform to speak up and you choose to do so, then that is your prerogative,” Derek Jeter said."},{"comment_id":"1030052270365446","commenter_b":"If she is afraid her flatulence will be recorded maybe she should stop opening her mouth.","commenter_a":"Up here.... they would call that problem... The Rocky Mountain Quick Step..... apparently it isnt that quick with the carpet bagger of the east","post_message":"\"Sorry.\""},{"comment_id":"10153332905444726","commenter_b":"you ladies have silly opinions","commenter_a":"Who in the world is this guy? Why does anyone care what he says? Why isn't he doing something. Instead f criticizing, why isn't he doing something?!!!!","post_message":"WATCH: Byron Allen Calls Obama a White President in Black Face"},{"comment_id":"10154700417126323","commenter_b":" This is why women worldwide have body issues. Because nasty bitches like this one feel it is their duty to mock and body shame. Well shame on her for bringing the world down a notch in my estimation...","commenter_a":"'It's not the person I am' well it is love because you took the picture and posted it. Goes to show beautiful on the outside not at all on the inside.","post_message":"A Playboy model who used social media to body shame a 70-year-old woman at her gym was charged with invasion of privacy by the Los Angeles city prosecutor on Friday."},{"comment_id":"1002116393141873","commenter_b":"I wonder if Muslim women can cover their faces at protests with the new anti-mask protest law?","commenter_a":"Does this mean people can wear the banned Anonymous mask to the citizenship oath ceremony?","post_message":"Developing"},{"comment_id":"10153464063176509","commenter_b":"Don't correct what I wrote, Gail Mac! Mind your own business. Sarah Palin has no intelligence at all!","commenter_a":"Why her, can you not find someone better with no baggage and have a mother who has no brain.","post_message":"Bristol Palin and Medal of Honor recipient Dakota Meyer are engaged. Meyer, a Marine who received the nation's highest military honor, announced the news on his Instagram account. @webpagelink"},{"comment_id":"10152556429696680","commenter_b":"I think it has been established that there would be a guest worker allocation. I am more concerned with the 40% of Illegals that are OVER stayed Visa workers! They come here on Visitor,Student and Work Visa's and don't leave when their term limit is up!! They are taking jobs from all levels of American workers!!","commenter_a":"In the meantime how about passing E-Verify and prison and fines to those employers that hire illegals??","post_message":"The House might have to delay consideration of its border security bill until the middle of February. @webpagelink"}]
