[{"comment_id":"1018949481459396","commenter_b":"Bitch","commenter_a":"So men are the most evolved. We do it since birth. Maybe that's why women never let us forget shit because they're living in the past.","post_message":"And that's why men have nipples!  Via Curiosity."},{"comment_id":"10153055610099877","commenter_b":"Do you see the sick people that are holding office? Beautiful child; disgusting/sick thought pattern to justify abuse.","commenter_a":"The mind can be a wicked thing!!!","post_message":"Republican lawmaker: Rape can be ‘beautiful’ if it produces a child.    Grio fam, do you think anti-abortion laws should make exceptions for victims of sexual assault?"},{"comment_id":"10156189535540354","commenter_b":"'@username you do know that Sharia Law requires gays to be destroyed?","commenter_a":"I can't imagine any conservative/Republican not standing with Dr. Carson on this.","post_message":"'Sharia law is so inconsistent with the US Constitution Ben Carson could not be more right.'"},{"comment_id":"1566069946786462","commenter_b":"This will motivate her to lie and cheat more","commenter_a":"Yay!!","post_message":"IT'S HAPPENING..."},{"comment_id":"10157460185340725","commenter_b":"Awesome speech in The Motor City, Mr. Trump. Inspiring, uplifting. Gave me goosebumps!","commenter_a":"CHINA = GARBAGE","post_message":"My trade reform means STRONG protection against currency manipulation."},{"comment_id":"477818462421667","commenter_b":"Good for him, we support him 100%. If the Muslims can burn our Flag we can burn theirs.","commenter_a":"Burn it!!! And send it back to hell where it came from.","post_message":"VIDEO: College Students Burn ISIS Flag And Muslims Are Outraged. SHARE to support these students are taking a stand against those ISIS pigs!"},{"comment_id":"1102356133153121","commenter_b":"dumb bitch","commenter_a":"Yooooooo I Knew She Was A Tranny!!","post_message":"‘I Stand Corrected:’ Wendy Williams admitted fault and apologized for her remarks about HBCUs.  Williams spoke with Roland Martin on Thursday's edition of The Wendy Wiliams Show where the NewsOne Now host eloquently summed up America's troubled past of slavery, segregation, and the oppression of African-Americans. WATCH the discussion and the NewsOne Now recap -> @webpagelink"}]
