[{"comment_id":"10153208513188812","commenter_b":"WWF on wheels....","commenter_a":"He should b able to race it wasn't his fault his car got stolen they should make an acceptation","post_message":"UPDATE: Police find stolen NASCAR Sprint Cup race car: @webpagelink"},{"comment_id":"1118673694809606","commenter_b":"yeah...chickens have lips and pigs can fly!!!!!","commenter_a":"not with him in office.","post_message":"Can Obama convince voters US moving in the right direction?"},{"comment_id":"1341790949180015","commenter_b":"There are people in the world that defend raping children and killing babies . Ignore these people .","commenter_a":"Disgusting.","post_message":""},{"comment_id":"10153826127084024","commenter_b":"funny how she started all of it and then plays the victim","commenter_a":"With a native name like NO ONE WANTS TO POKE HER TUNA.","post_message":"It’s the latest in a series of Internet “tweetstorms” calling Trump on the carpet for his treatment of women and his insults toward her."},{"comment_id":"10152594464675927","commenter_b":"Go F♤♤K yourself Hussein, and that thing you call a wife !","commenter_a":"speaking OF \" ignorant\"...","post_message":"You should NEVER apologize for being a proud American.  NEVER."},{"comment_id":"10153506761069091","commenter_b":"Imagine if nothing was found like the weapons of mass destruction....mmmmm and you are right @username","commenter_a":"Yes","post_message":"Should Apple be required to help police unlock the San Bernardino gunman's phone? @webpagelink"},{"comment_id":"10156742074775354","commenter_b":"the millennials need to really research socialism & check out the countries that have it now & they are worse off than ever ...want to wait in lines for food? be lucky to get a loaf of bread, some milk & maybe a little veggies or fruit...guess they would change their minds if they really knew what that would do to this country....jobs worse, financially drained families from such high taxation etc...healthcare would be ...forget it...more deaths ...socialism is plain & outright destruction & more misery than this country could stand....then we'd have bigger problems with the refugees forcing their crap down our throats...is that what you want you idiot millennials?","commenter_a":"This millenial would like to thoroughly dissociate himself with most of the rest of the generation.","post_message":"GENERATION SANTA CLAUS?"}]
