[{"comment_id":"10153105510381336","commenter_b":"I elected Obama twice. You wingnuts act like Hillary did some sinister dastardly deed that caused 4 people to die at Benghazi.Not true..The US lies and spies and tortures and misleads as a matter of policy.J ust like Bush Rumsfeld and Cheney did. I will never vote for a conservative. Politic is a tough business. acvtually governing is something the GOP has forgotten about.","commenter_a":"What truly amazes me is that State Communications Security let her first use a personal e-mail for government business and second they let her keep an unsecured server at her home. This is a complete violation of all government communications security regulations and practices. There is no way possible that she did not send classified e-mails during her entire tenure as Secretary of State and there is no way possible that they can say that unsecured server was not hacked by outside sources. What kind of a moron would think that? The idiots that are defending this woman are absolutely CLUELESS as to the magnitude that this Security Breach is. People go to jail and/or get fired for much less than this. It is absolutely mind boggling and staggering to me that this server was not turned over and now has supposedly been wiped. This server should be confiscated and ...","post_message":"Rep. Trey Gowdy said the former secretary of state has failed to produce a single new document in recent weeks and has refused to relinquish her server to a third party for an independent review."},{"comment_id":"1311803105524589","commenter_b":"Bryan Gogg Citation? I didn't think so. The SS never comments on such things.","commenter_a":"I will not shed one tear for any faithless elector that ends up suffering grave consequences.","post_message":"This is about to be all over the news, folks."},{"comment_id":"10154377654466729","commenter_b":"parents need to stay in contact with reality when it comes to their kids. pay attention to what schools is teaching our kids. it is all coming together. womans lib, moms are not home any more to pay attention to what kids bring home. homes have been destroyed.","commenter_a":"Those who can, do.","post_message":"Bingo."},{"comment_id":"335857396538054","commenter_b":"There is no climate change that is your agenda","commenter_a":"Does this arrogant, smug, condescending community organizer and failed President REALLY want to compare resumes with the Donald? More evidence of how delusional he is and how stupid he thinks we all are.","post_message":"“I think foreign observers are troubled by some of the rhetoric that’s been taking place in these Republican primaries and Republican debates. I don’t think it’s restricted, by the way, to Mr. Trump.”  During a press conference earlier today, President Barack Obama slammed Donald J. Trump and other GOP presidential candidates while continuing to tout climate change. @webpagelink"},{"comment_id":"10153216973363855","commenter_b":"Good let the idiots divorce","commenter_a":"overinflated sense of their own importance much? idiots","post_message":"Here's to a speedy divorce!"},{"comment_id":"1033603779993966","commenter_b":"Please guys, read it again. 'The VIRUS'agrees that vaccines cause autism. Maybe vaccines cause stupism?","commenter_a":"Viruses are not to be trusted.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1201058653247496","commenter_b":"'@username Yeah get rid of all laws because you don't like them, shoplifting, welfare and insurance fraud, ect... Do you even know what Jaywalking is where you live it why its a law?","commenter_a":"How about telling the entire story how he ran from the cop and tried to board that red bus in the picture while the cop was writing him a ticket... Also how you can hear the cop tell him to stop resisting while the kid was grabbing his baton. Oh because he doesn't feed your anti cop agenda?.","post_message":"Nine officers can be seen in the video, as an onlooker pleads 'He's just a kid!'"}]
