[{"comment_id":"10152892388271749","commenter_b":"oh, that makes sense, you live in bankrupt California.","commenter_a":"more uninformed people are stating that whites killed blacks (KKK) and somehow this means whites should have no say in the current crisis. However it is necessary to point out the gross inaccuracy of the white vs black default position that is happening. The KKK was started by none other than the Democratic Party. They even held meetings in THE WHITE HOUSE. It was not a white vs black terror group It was A Republican vs Democratic terror group. All blacks were Republican at that time for reasons that are obvious and for some that are not obvious Democratic party wanted to enslave and/or lynch blacks and go figure, Republicans had a problems with that. However of the estimated 5000 people killed by the KKK, 2000 were WHITE Republicans who, just like the Black Republicans, were fighting for equality and liberty that the dems were opposed to. So get off ...","post_message":""},{"comment_id":"10153394437991336","commenter_b":"Illegal aliens aint welcome to merica deport them back!!!","commenter_a":"Univision responds to Mexico or the US? These guys are wrong. AMERICA first! If you dont like it, go back.","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10154246184914609","commenter_b":"BUILD THE WALL","commenter_a":"Good because if you bothered watching the full video, you would see those guys attacking trump supporters and taking their signs. Those thugs (not protestors) got what they deserved.","post_message":"About that photo widely circulated across social media: “It started burning – burning really, really bad. I couldn’t open my eyes for probably 40 minutes,” the man hit says. @webpagelink"},{"comment_id":"1052573001452785","commenter_b":"Absolutely fuck a gun i don't hit women but that ghetto trash should've been slapped in the face","commenter_a":"This is the norm for these racist cockroaches, get a gun people because we're at war whether you like it or not................It's all thanks to that sorry POS Obama and his corrupt administration that led us here!","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO] Racebaiters will never say anything about this. What would you do in this situation?"},{"comment_id":"1512943285667077","commenter_b":"While ur asses get your alcoholic drinks!","commenter_a":"@username hahaha","post_message":"\"Is there free food?\""},{"comment_id":"10154985622284687","commenter_b":"She schould blame her father for this","commenter_a":"Brilliant ! Will do","post_message":" is just  it's a wonderful line. I own some of it. I fully  I'm going to give a free commercial here. Go buy it today, everybody. You can find it online."},{"comment_id":"1225587407484516","commenter_b":"@username @username ca vaut aussi pour les chats bande de cingle !","commenter_a":"Krushank Shah","post_message":"This is why you should stop letting your dog lick your face."}]
