[{"comment_id":"10153948445168812","commenter_b":"you gonna adopt it?","commenter_a":"And for Christmas the pup should be freed from its current owners and gifted to a loving home.","post_message":"A pup from Hardin County, Iowa, got a sweet surprise this Thanksgiving when she was gifted a brand new dog house after living outside for almost three years."},{"comment_id":"865762326792523","commenter_b":"She needs to go home and git her dildo and go for a ride","commenter_a":"I'm sure Netanyahu is ignoring them...","post_message":"Why does the Democratic Party hate #Israel so much?"},{"comment_id":"343579349178913","commenter_b":"Nobodynis beyond the law!! ARREST OBAMA AND CHARGE WITH TREASON!!!","commenter_a":"That's because they are all STupid, and follow their leader and Nancy P.","post_message":"ICYMI - Nearly Half of Democrats think Obama Should Have the 'Right' to IGNORE the Courts!"},{"comment_id":"1272811836073158","commenter_b":"I wouldn't mind my dick being six feet longer","commenter_a":"Is this before or after birth......if so I know many candidates for editing DNA to make civilised human.....step forward 8b7...there are some 'adjustments' needed.","post_message":"Should we be allowed to edit human DNA?"},{"comment_id":"1415440468755532","commenter_b":"Embarrassing shows some English women are ,more than stupid!!! What a PRATshe is , excuse the pun!!!","commenter_a":"These stories are not the norm. As a Brit I have been shocked & saddened at the attitude of the Brits post Brexit. If you are foolish enough to believe that the newspapers print stories that represent the situation of most refugees then you really are foolish. Yes stories like this happen, they always have. But for many this is not their situation.","post_message":"‘He is doing this to take citizenship'"},{"comment_id":"10154575281024877","commenter_b":"Melania looks like Caitlyn Jenner. !! !!","commenter_a":"Jobin, I fell the same way sometime it takes something to open her eyes maybe this is it","post_message":"This is one of the main reasons we need to stop treating Melania like a helpless victim."},{"comment_id":"916180815144838","commenter_b":"She is still the best when compared to the other guys. Run, Hillary, Run.","commenter_a":"Rut-roh!","post_message":"Are Clinton's numbers doing better or worse since she formally entered the 2016 race?"}]
