[{"comment_id":"10155770026010354","commenter_b":"She would England better than America.","commenter_a":"And I will remember not to vote for you!","post_message":"Facebook pool: how long until there's a hunting photo op to show how much Hillary understands sportsmen?"},{"comment_id":"1152177854802243","commenter_b":"She's a POS lire!!! Qualified! Gimme a break!","commenter_a":"I don't believe a word she says. Right now the most important thing to her is more excuses...","post_message":"A young boy asked Hillary Clinton 'What is the most important part of life?' Here's her response."},{"comment_id":"10153120906398205","commenter_b":"95percent of the illegal immigrants are hard workers.... So much so that many citizens feel threatened will take their jobs.....i would never be scared if an illegal taking my job......","commenter_a":"Thus is what you spend your time on. Your dedication should be the American people I think your priorities are screwed up. As a congressman you work for the citizens of this country.","post_message":"Central Florida - I'm coming to talk about how to get ready for DACA and DAPA!"},{"comment_id":"10153095720526051","commenter_b":"You poor sick woman, you must have never gone to school ever.","commenter_a":"Not saying what he did by any means was right.... But blacks are openly threatening to kill us everyday... The Black panthers said they were going to bomb white nurseries and how they need to rape and kill all white women and children. All this can be looked up. There are numerous hate crimes committed by blacks against whites everyday yet finally a white boy snaps and it's everywhere on fb and everyone wants him publicly hung. Obama is now pushing his gun control bs again over this but why doesn't he do that over the thousands of shootings everyday pointed towards the black on black crimes? Open your eyes people... I think you're all missing the much larger picture here.....","post_message":"Dylann Roof just confessed to the #CharlestonShooting. He says he had just one goal in mind when he opened fire."},{"comment_id":"10153046284854705","commenter_b":"I wish someone would put that pig back in the barn and close the door. I'm sick to death of her nasty face.","commenter_a":"Who would buy that! ?!","post_message":"Kim Kardashian just out-Kardashian-ed herself."},{"comment_id":"10153984129784497","commenter_b":"Area woman would have crashed car regardless of spider's presence.","commenter_a":"Area woman crashes car trying to get away from spider","post_message":"Report: Spider"},{"comment_id":"10154085001886800","commenter_b":"Eve, the most hated woman to ever exist.","commenter_a":"More specifically, women are paying for it. Eve ate the apple, now we're cursed with periods, painful pregnancy, and really shitty mood swings.","post_message":"Connecticut lawmakers want to get rid of the statute of limitations on child sex abuse cases, but they're running into opposition from the Roman Catholic Church."}]
