[{"comment_id":"10153333476251770","commenter_b":"My father is an immigrant from France, I lived 15 miles from the border of Mexico for ten years, I love the Mexican people and so does Trump, don't you see??? People who are in the legal process are being cut in line by illegals. Illegals ruin your wage rates, take your jobs, use our governments program resources. By shutting the border down deporting the illegals the Mexican Americans will get the wage they deserve! As acting, legal tax paying citizens!","commenter_a":"Because the legal Latinos want jobs. The illegal compete and lower the wage rate and that affects the legals ability to make a decent wage.","post_message":"Donald J. Trump beat out his Republican rivals in America's most Latin city Tuesday."},{"comment_id":"1773311049564873","commenter_b":"Jerk","commenter_a":"Mitt Romney should be quiet. I worked very hard for him, was sick when he lost to Obama mostly because he would not fight back. He broke a lot of hearts the way he ran and loss. He has absolutely no RIGHT to open his mouth now. I am angry at him.","post_message":"Mitt Romney wants Donald Trump as FAR from the White House as possible... but nobody thought he would go this far to accomplish it. Is Mitt Romney irrelevant?"},{"comment_id":"477075479149699","commenter_b":"Go Greta Don't. Let the Liar.,,Dunce worry u","commenter_a":"Yes","post_message":"Greta Van Susteren's career was just threatened by Obama. Greta's under attack, she needs our help. Do you support Greta Van Susteren?"},{"comment_id":"10152794611951636","commenter_b":"It is just that!.we women have no say....we just get on with it!.","commenter_a":"Really?? A marketing campaign for icecream?? You don't know half of what happens .","post_message":"We’re not supposed to break the silence and secrecy surrounding women’s bleeding bodies..."},{"comment_id":"10153679672384586","commenter_b":"Cunts","commenter_a":"Aaron Andrew Bantoft this made me physically cry","post_message":"Imagine being alive for just ONE day... And then THIS happens, just because you were born male :("},{"comment_id":"594130970711496","commenter_b":"She a commie in bad clothing","commenter_a":"I'm just wonderin......Does she feel \"tyred\" these days??","post_message":"Hillary Clinton says people are \"concerned\" by Trump's \"divisive rhetoric\" and he needs to be stopped \"conclusively.\" Is she right?"},{"comment_id":"1265311083486900","commenter_b":"Why would the GOP, composed exclusively of embittered liars, care?","commenter_a":"IT'S CALLED THE TRUMP BUBBLE, AND IT'S FILLED WITH A LOT OF HOT AIR...","post_message":"Truth, logic, reason and consistency don’t seem to count for very much in our political discourse these days - especially when it comes to Donald J. Trump. Author and media commentator Neal Gabler explains why the mainstream media is letting Trump get away with it."}]
