[{"comment_id":"1017702978286400","commenter_b":"It's a true testament to J.K. Rowling's writing that I can read that passage, and, nearly 9 years later, still feel the same goosebumps I felt the first time I read the book in July 2007. Very sad day today.","commenter_a":"'Look... At... Me...' He whispered. The green eyes found the black, but after a second, something in the depths of the dark pair seemed to vanish, leaving them fixed, blank and empty. The hand holding Harry thudded to the floor, and Snape moved no more. '","post_message":"'It is an ancient need to be told in stories.'"},{"comment_id":"10153931593886336","commenter_b":"Let's add panderer to Hillary's resume after liar. Perfect qualifications to be the next President.","commenter_a":"She has mislead the Hispanic voters by lying to them. Just because they do not understand the law and the BS she has so taken advantage of them. Hillary for Prison in 2016.","post_message":"A campaign post aimed at winning over Latino voters has backfired and instead is drawing the ire of many social media users for purportedly playing up ethnic stereotypes."},{"comment_id":"10156191527000354","commenter_b":"Huma, you criminal bitch, up yours.","commenter_a":"Dr Ben Carson: 'Islam is not consistent, not compatible with the Judeo-Christian Values and Principles of America, the U.S. Constitution, Sovereign Individual Freedom and Liberty Dr. Ben Carson nailed it on the head, and like Trump, is not 1 ounce of 1 iota fearful of any biased politically correct media backlash because he states the truth as it is, not as they want it to be. Those who are ignorant of the Islamist threat and unwilling to confront it, will be conquered, subjugated, enslaved, raped, tortured, and exterminated over time. David Wood on Islam's 3 stages of Jihad @webpagelink","post_message":"'Huma’s history includes her past work at an Islamist periodical, the Journal of Muslim Minority Affairs (JMMA). The journal was founded by a man named Abdullah Omar Naseef, who would later go on to aid Al Qaeda’s operations worldwide.'  MORE..."},{"comment_id":"10154077831881509","commenter_b":"Tell them to eat pork!","commenter_a":"I don't think I have read more ignorant comments than those supporting Ben Carson. Yes, Carson is entitled to his opinion but it shows the complete lack of understanding of the way our nation operates. A man who believes he can pick and choose which laws to obey is not qualified to run as President. Where are all the Christians who were crying about religious liberty? This man wants to take away the religious liberty of a very large portion of those practicing a different religion. A very sad day for America and those haters bashing the Muslim faith.","post_message":"A call for Dr. Ben Carson to drop out: @webpagelink"},{"comment_id":"10154039827188984","commenter_b":"I hope it was a woman that pulled the trigger","commenter_a":"I am so grateful to my Lord that I do not have to live in a war torn place like this... never feeling safe and never knowing when you went to market if a suicide boomer was going to show up and kill you and others!! Never knowing when you rhusband was going to demand sex or molest your little daughter!! What a horrible life that would be!","post_message":"This terrorist fighter was excited to show off his machine gun skills to his buddies.  He stepped out beside a building, started to open fire, and then there was a CRACK followed by a dull thud."},{"comment_id":"10153896841896636","commenter_b":"Let's talk about what about ... 1. What about Christian imperials from England who colonized, enslaved, stole and murdered people during their colonialism , don't they have Christian knowledge, 2. What about Christian Europeans colonizing America and stealing their land, murdering millions of natives, 3. What about white Christians enslaving blacks people in America treating them like animals and killing blacks for sport. Can you blame these crimes against humanity on Christian faith , NO you cannot , and you cannot blame Islam for the actions of ignorant people. Don't lower your intelligence to the level of ignorant people of past and today who are enemies of humanity .","commenter_a":"Are you trying to defend Islam by claiming that, ISIS recruits have very poor knowledge of islam ? ok, what about the radical Muslim clerics all over Europe, Asia and USA, don't they too have any knowledge on Islam ?","post_message":"Incredible"},{"comment_id":"10153641389062994","commenter_b":"I still don't understand all the female supporters on here. He hates you.","commenter_a":"He did a great job!!!","post_message":"Donald J. Trump is in Birch Run and will take the stage in just moments. Watch what the GOP contender has to say about Michigan, this country, his campaign, and who knows what else."}]
