[{"comment_id":"10154262387346509","commenter_b":"What is justice? Isn't it making something \"just\"? If so, how is justice possible in cases where the crime can't be reversed? If someone steals a $100 bill, justice can be had by paying it back to the victim. You can't undo rape, murder, abuse... etc. So then it comes down to punishment, coping, and vengeance. Punishment is negative reinforcement to change someone's behavior. Coping with a problem is minimizing or eliminating the threat. If someone is an immediate threat and won't be considered fit to be in society, that means prison or death. Vengeance is just getting revenge and causing suffering to deal with suffering/pain.","commenter_a":"I hope the suspects are found alive, justice must be served","post_message":"“I heard rapid shooting — just boom, boom, boom …” Eyewitnesses describe the scene of a mass shooting in San Bernardino, California. @webpagelink"},{"comment_id":"10152918950086336","commenter_b":"What a doll!","commenter_a":"What a cutie and smart too!","post_message":"An incredibly brave 4-year-old girl is being credited with saving her pregnant mother who suffered a seizure and couldn't reach the phone."},{"comment_id":"10153783532251336","commenter_b":"You drug addicts are so jealous that it went to the police station. I will say it again. I'm glad it went there. get yourselves off the streets. IDIOTS!!","commenter_a":"Glad it went to the police station. Keep it off the streets!","post_message":"Officers wrote in a Facebook post, \"If you were expecting these packages and would like to claim them, please come to Police Headquarters.\""},{"comment_id":"1329308387112427","commenter_b":"Muslims just can't adapt to modern society. Their value system is based on lower less evolved emotions and weaker minds","commenter_a":"Simple solution leave go back to where you came from","post_message":"DO THEY EVER STOP WHINING?"},{"comment_id":"555137491342104","commenter_b":"HELLARY ROTTEN CLINTON IS A SEXUAL PREDATOR AND A RAPIST CRY BABY","commenter_a":"We won fairly and stop saying it was the russians and trump. Stop filling your head with media lies","post_message":"WATCH LIVE: Members of the Electoral College in Texas gather at the statehouse in Austin to vote for the president and vice president of the United States. One Republican elector, Chris Suprun, has revealed his intention to vote for John Kasich instead of Donald J. Trump."},{"comment_id":"10153077946636037","commenter_b":"How about you stop being a stripper?","commenter_a":"Good for them. That's their job and everyone deserves fare treatment. Whether their dancing on a poll or serving meals at a local diner. This is America.","post_message":"Tired of watching well-meaning strangers impose their own visions for improving the plight of the exotic dancer, some of Portland's seasoned #strippers are working directly with state lawmakers and professional lobbyists."},{"comment_id":"1705740913046354","commenter_b":"Bitch!","commenter_a":"Go whoop, go now.","post_message":"Oh my gosh, I can't believe Whoopi Goldberg said this. Cancel The View right now."}]
