[{"comment_id":"10153578934943984","commenter_b":"Really. Yall have to ask??? Stupid crap and a shame people think of HIM as courage. SAD. However HIS timing was planned just at the right time for the supreme courts decision.","commenter_a":"What a joke.","post_message":"Wow. Immediately after the ESPYs it became clear to those paying attention that ESPN made a big mistake. I'm pretty sure ESPN never saw this coming when they decided to give Jenner the Arthur Ashe Courage Award. Do you think ESPN was wrong to give this award to Jenner?"},{"comment_id":"1988963441329253","commenter_b":"LOL I never ever listen to any of her crap music.","commenter_a":"Thats right America! Keep giving your money to hollywood libs! Making them millionaires! She and her thug hubby laughing all the way to the bank...","post_message":"***FIRESTORM*** An online #BoycottBeyonce campaign to boycott Beyoncé and her music has picked up steam since the pop star performed a controversial tribute to the Black Panthers during the Super Bowl halftime show on Sunday....Developing..."},{"comment_id":"363912913812223","commenter_b":"This LOSER should not even be in this country!!!!!!","commenter_a":"I say disarm the cops on the same day that this turd becomes a vegitarian!","post_message":"Michael Moore Demands Cops Disarm!"},{"comment_id":"10153456933913132","commenter_b":"Oh my word!!!!! What in the hell?! If you don't want your baby there are plenty of ways to give it up safely! I will never understand women!!","commenter_a":"@username wtf is wrong with people","post_message":"Kimberly Pappas reportedly stored her baby in a drawer after giving birth in a bathroom at work."},{"comment_id":"10153524199539641","commenter_b":"because most of them came here for money, and they are imigrants who are using the situation,not the real war refugees - the real war refugees would be happy just to be in a safe UE country,without demanding to get to the richest countries with the best social care (get money fo free and reproduce like rabbits).","commenter_a":"I'm sure only few of the refugees are children. many are young males and what is with refugees? why won't they stay at hungary? hungary is peaceful nation. i wonder why. hmh","post_message":"Anguish erupts as migrants and refugees are prevented from boarding trains:"},{"comment_id":"921257648004031","commenter_b":"Nope, Michelle can get naked with any woman she chooses. I'm okay with that. Hillary too. Lesbian love! Let's all celebrate that.","commenter_a":"I couldn't care less about the nude photos. That has no effect on my disdain towards Trump. I DO care about the fact that conservatives are fine with this, but would have a complete meltdown if this were Michelle Obama and call her every dirty name in the book.","post_message":"What kind of example would First Lady Melania provide for America's children? But let's hear more Fox \"News\" outrage about Michelle Obama's sleeveless dress PLEASE... sigh... Full photo here: @webpagelink"},{"comment_id":"10154473389496336","commenter_b":"Hahaha we thought same thing.","commenter_a":"Lmao! So the DNC asked the lady who caused all the chaos in Baltimore to restore order ?? Wow ! The DNC is in trouble","post_message":"Baltimore Mayor Stephanie Rawlings-Blake gaveled in to bring the Democratic National Convention to order, after Debbie Wasserman Schultz excused herself from the role amid controversy regarding leaked DNC emails."}]
