[{"comment_id":"10150887913809999","commenter_b":"Ya and she is going to jail if she don't win so she will say anything to get her way! She will do what ever it takes.... Murder . lie . steal. #Trump2016 #MakeAmericangreatagain #GodblessAmerican","commenter_a":"I can't believe Americans will vote for this idiotic woman, but they will and bring another 4 years suffering to the world","post_message":"\"Donald Trump has built his campaign on prejudice and paranoia. He is taking hate groups mainstream and helping a radical fringe take over the Republican Party,” Hillary Clinton said."},{"comment_id":"10152734752671051","commenter_b":"Unbelievable! some women should not children and she is one. Discipline begins at home.","commenter_a":"Needs a good ole fashion spankin.","post_message":"This 11-year-old boy is responsible for a fifth of the crime in his town – and his mother knows exactly who to blame for that."},{"comment_id":"10153490058828352","commenter_b":"Dumbest comment I've read. You're pretty much agreeing with this greedy ass woman.","commenter_a":"Even though this is crazy...thinking about it though if it werent for her he wouldnt be where he is today so...she really shouldnt have to ask...SINCERELY!","post_message":"Former NFL player reveals his mother demanded $1m after he was drafted ‘for raising him for 18 years’"},{"comment_id":"865998906849825","commenter_b":"godless atheists,satanists THIS FUCKIN FUSE OF LOWLIFES WILL END SOON","commenter_a":"When we start seeing these statue like this around America , that means the devil have claimed this land, God is coming back soon ppl be warned","post_message":"Florida Agrees to Distribute Satanic Temple Materials To School Children"},{"comment_id":"10154080042346336","commenter_b":"I care what anyone says obama was a good president.","commenter_a":"Yep, detention without trial , without legal representation ,without charge has no place in America .","post_message":"“We can try [terrorists] and put them in our maximum security prisons and it works just fine.” – President Barack Obama on closing Guantanamo Bay facility @webpagelink"},{"comment_id":"1510900072276579","commenter_b":"They hate immigrants but call themselves Europeans?! Ok then go back to Europe ya fuckin assholes.","commenter_a":"\"We as Europeans\" Sorry if you live in America and have done for generations your not Europeans, there are many non-white people who are more European than you Anyone who holds any level of feeling that they are culturally attached to every other white person on the planet in some way is just weird","post_message":"\"Hitler did nothing wrong! I feel like there are two sides.\" - Tila Tequila"},{"comment_id":"10154457010786378","commenter_b":"U should've said bring it on sista!!! This white girl from P.G Co. lol...","commenter_a":"I don't know who she is. I'm glad I dont.","post_message":"A black Saturday Night Live writer is under fire after cracking a joke about white people who support Black Lives Matter."}]
