[{"comment_id":"557086307813348","commenter_b":"AHHAH u need a matching one","commenter_a":"@username one for mal","post_message":"That pose though"},{"comment_id":"10154261283691350","commenter_b":"Yes, those dang gators.","commenter_a":"@username, is this the real reason you're leaving Florida lol","post_message":"Is that thing real?!"},{"comment_id":"1299985666689108","commenter_b":"typical woman sexism","commenter_a":"Almost every man I know that gets the flu is a big baby about it and stays home to be pampered and relax, while women who get sick continue with their daily routine of kids and work and household duties, so, ppft. Women still get it worse!","post_message":"Turns out, cold ad flu viruses might actually be worse for men after all."},{"comment_id":"967920213241731","commenter_b":"Stay out of Florida's business.","commenter_a":"Yes","post_message":"A bill to require a 24-hour waiting period for abortions passed the Florida Legislature and is now heading to Gov. Rick Scott's desk. Do you think he should sign it?"},{"comment_id":"849566101841798","commenter_b":"Ignore Spenser Jeffery, he's bankrupt, c);-)","commenter_a":"God Bless this wonderful man! God bless his family and many friends. You truly lost a good man. Prayers and all the respect in the world to him and his family!! Please holy father, take this wonderful soul into your loving arms, amen and amen.","post_message":"\"I swear to God I love this city but I wonder if this city loves me,\" slain officer Montrell Jackson wrote on Facebook earlier this month."},{"comment_id":"1207405515987329","commenter_b":"HappyBirthday, Sir, \"It's one more candle and a trip around the sun\" !","commenter_a":"Happy Birthday Dr. Carson!!!","post_message":"#keepcalm"},{"comment_id":"10154371662414117","commenter_b":"This will make it easier to build a wall. Then Mexico can invade and get back it's land.","commenter_a":"God I hate my damn State.","post_message":"The people who are pointing to CalExit as a possibility have little grasp of either the demographics of the state, nor its actual finances. It is oblivious to the fact that the non-coastal parts of California are similar to the non-coastal parts of the rest of the United States. It is oblivious to the reality that the state's financial crisis is due to overspending within California and not because they're sending money to D.C."}]
