[{"comment_id":"1513285485378585","commenter_b":"Mmmmmmmhm! I noticed that. Pussy","commenter_a":"How true","post_message":""},{"comment_id":"10154404367061037","commenter_b":"Get a life lady","commenter_a":"When trump loses I wonder what the trump voters that have outed themselves as racists and bullies are going to do, double down or deny it.","post_message":"Is Donald J. Trump's historic presidential run doomed to fail?"},{"comment_id":"10153307437349641","commenter_b":"Well a man Isis noob is better than a super trained nato soldier who does nothing as all NATO soldiers do - nothing","commenter_a":"i dont think isis fighters are more than trained noobs :v","post_message":"ISIS \"moron\" gives away HQ location on social media:"},{"comment_id":"10157992746740594","commenter_b":"@username if I'm going to make my mother get up in the middle of the night and travel four states to feed me she better be bringing more than a hot pocket.","commenter_a":"This is great, this is just what you liberal snowflakes need to cope with reality. It's nice that Google is providing portable \"safe-spaces\" for tomorrow's Captains of State Dependency.","post_message":"Turn photos of Donald Trump into adorable kittens with this Chrome extension."},{"comment_id":"10156240313260551","commenter_b":"This post is a waste. If you have 1/2 a brain you have known for over 6 years that she is a racist.","commenter_a":"IF....all the white folks were gone from this country, there wouldn't be enough others to support the welfare system or the Obama's income......hummmmm.","post_message":"This woman is RACIST!"},{"comment_id":"703541823169729","commenter_b":"Both of the girls always look miserable !","commenter_a":"You tell a bunch of things that aren't true . Please people","post_message":"Malia Obama at the center of damning White House scandal. The whole family is a disgrace. This is ridiculous. Do you think the Obama family is the worst presidential family in history?"},{"comment_id":"10154455008597509","commenter_b":"Andre Ceasar","commenter_a":"Brittany Benoit, Jade Walker","post_message":"Take a look at the friends who you have outgrown, who you don’t talk to anymore, who makes no effort to see you. Focus on the friends who matter most."}]
