[{"comment_id":"765775893538794","commenter_b":"What about women that do?","commenter_a":"Wonder what this means for me","post_message":"Research Says Men Who Take Selfies Have More Psychopathic Tendencies"},{"comment_id":"1554877448153804","commenter_b":"#HellForHer. #FeelTheBern","commenter_a":"I wouldn't vote for Hilary under any circumstances, because she is dishonest and has done nothing to help the cause of human rights in her entire career! In fact, everything she's ever done has been solely for her own promotion and gain! Power is what she's after and we definitely DON'T want someone like her in charge of our country! Bernie is one of us, a man who's worked hard for positive change, who is diplomatic, anti-war and pro-planet, in short, just what we need at this particular moment in time! With Bernie, we would all have a say, whereas, with Hillary, as a people, we would become more suppressed than ever, given her plans for further militarisation, both military and police wise and polluting of our planet in favour of the almighty buck! Bernie puts the needs of THE PEOPLE first, which is why he must be our first ...","post_message":"When we talk about a political revolution, sisters and brothers, we don't just mean the presidency. What this moment  requires is people in the streets fighting for change and legislatures across the country willing to stand with them."},{"comment_id":"10154572108529087","commenter_b":"She should put on her fake Indian outfit on.","commenter_a":"WARREN IS A BRAIN DEAD DUMBACRAT !!!","post_message":"Elizabeth Warren: \"Congress must pull its head out of the sand and launch a real, bipartisan, transparent inquiry into Russia. Our national security is at stake.\""},{"comment_id":"10152943603067217","commenter_b":"Mosks should be destroyed first","commenter_a":"The earthquakes should destroy only churches.","post_message":"New Zealand's Christchurch was struck by a devastating earthquake in 2011"},{"comment_id":"10153633872565950","commenter_b":"Yeah! Lets send everyone back to where they came from! Build a wall ! Its back to Europe with you my friend:)","commenter_a":"And this is NEWS , Why??? Don't even care or know who this guy is... Stay out of Mexico and South America and guess what?? You will be safe...","post_message":"25-year-old Alan Pulido is a forward for Olympiacos of Greece and was part of Mexico's 2014 World Cup team."},{"comment_id":"500239873497639","commenter_b":"Quit calling them mulims call them moslems, it is derogetory","commenter_a":"Amen.shut our borders down..asap","post_message":""},{"comment_id":"627551517435427","commenter_b":"Big mouth cow","commenter_a":"So we'll give her grandmother a free drink.","post_message":"This entitled woman just demanded a free drink... Because of slavery?  This is absolutely ridiculous. We owe her nothing.  Should she be compensated for slavery?"}]
