[{"comment_id":"10153389202536051","commenter_b":"Bitch your fake, n ugly to boot !!!! Fake ass , go be with Obama !!!","commenter_a":"Quick somebody wake her up! She's having a nightmare!","post_message":"This model says that after wearing a corset for 7 years and getting four boob jobs, two nose jobs, butt implants and all her teeth removed, she finally has the \"perfect\" body. Decide for yourselves if that's true."},{"comment_id":"10154240769776438","commenter_b":"@username No. You're being dishonest. The \"second amendment solution\" is to use the guns to kill people, and he was talking about his followers killing Secretary Clinton, and he was talking about his followers killing the judges she will appoint as President. You can try to say that he didn't actually think they would follow his advice, but you can't say that isn't what the words mean.","commenter_a":"Hmm I wonder if he's talking about the NRA? Taking things out of context, as usual","post_message":"\"Nothing you can do folk—although, the Second Amendment people, maybe there is, I don't know.”"},{"comment_id":"934836243223515","commenter_b":"Take the cop dick out of your mouth, June. It's not a good look for you.","commenter_a":"This is ridiculous! Officers, please forgive the Mayor for having a more \"balanced\" perspective, because of the diversity of his family. He is in a unique position to be able to \"see both sides.\" It would behoove you, officers , to learn something from him and his family!","post_message":"America has told the NYPD in no uncertain terms that using a funeral to make a political point is not okay, and they just did it again."},{"comment_id":"10153202858353352","commenter_b":"Nigger Bitch??? Hahaha So Original","commenter_a":"Only because he was a black cop..... If he was a white cop that cracker would be locked up..","post_message":"Gun enthusiast who shot police chief four times during raid walks free because cops 'didn't have enough evidence to charge him'"},{"comment_id":"10153266920996051","commenter_b":"I think he's a muslim sleeper, programmed to distroy this country and let in all the muslims he can recruit.","commenter_a":"Even if he was it's his freedom to choose...why does he have to practice Christianity or Catholicism?","post_message":"Do you think these voters are right about President Obama?"},{"comment_id":"868334796545922","commenter_b":"Heather go live in that cave","commenter_a":"If the public would STOP using Craigslist, it would shut down...as long as people continue using it they will stay open.","post_message":"Georgia police have confirmed that two bodies found Monday were identified as Elrey and June Runion. The elderly couple vanished last Thursday after they went to meet someone who had responded to a Craigslist ad they posted: @webpagelink"},{"comment_id":"937882449580510","commenter_b":"Can't stand her","commenter_a":"No no! Remember the first amendment? She was and is free to ask anything of anybody. Man up everyone. Hopefully this will stay a free country.","post_message":"Uh oh..."}]
