[{"comment_id":"1110789318977717","commenter_b":"Why didn't this administration just tell the truth in the first place. If the President or Hillary would from the beginning, just tell the People the truth, that they screwed up. Most Americans will probably forgive, (But not forget) But Now we have to spend time and millions of dollars to do an investigation Same goes for President Clinton, just admit you got a blow job in the oval office and the American people would of probably forgave you. Nixon same thing, why can't they just do the right thing and tell the truth from the beginning. Friggin Politicians, I'm so sick of being lied to.","commenter_a":"I used to have hope that you were going to get the job done, @username but after all this time, I have lost faith in you and your committee. I think you are now part of the cover-up and just playing along to make it look like something is being done.","post_message":"It is deplorable that it took over a year for these records to be produced to our committee, and that our Democrat colleagues never lifted a finger to help us get them. Shame on them and everyone else who has demanded this committee to give up before gathering all of the facts. This investigation is about a terrorist attack that killed four Americans, and it could have been completed a lot sooner if the administration had not delayed and delayed and delayed at every turn. For example, the #Benghazi committee still does not have records we requested over a year ago, and we are still waiting for some witnesses to be made available for interviews. As soon as possible, we will release our report and interview transcripts so everyone can see the evidence for themselves, and I’m confident the value and fairness of our investigation will then be abundantly clear to everyone."},{"comment_id":"527866774028766","commenter_b":"Are you a feminist?!?!? Yea!","commenter_a":"Every time you read or hear this story it changes ... The parents are frickin LIARS ! They knew about this years ago and MORE WILL COME OUT .... He's a pervert ! So much for feeling 'SAFE AT HOME' . He isn't the only one that should be charged ... Mom and dad .... Hi Ho , Hi Ho ... OFF TO JAIL YOU ALL GO ! SHAME ON BOTH OF YOU PARENTS ! ( to bad you don't know what the hell that means ! Mom you look up at the thing you call a husband and act like a little puppy, what , believes get everything he says , GET A BACKBONE AND WATCH OVER YOUR CHILDREN , you made them and GAVE BIRTH, ACT LIKE A MOTHER ! There would be HEADS ROLLING if this happened in MY HOUSE , believe me ! Your son should ...","post_message":"And the Duggars and police COVERED IT UP!"},{"comment_id":"10153871273143984","commenter_b":"go home and take obama with you !","commenter_a":"OMG. They need to take this list to Iraq and make their demands. Not here.","post_message":"Illegals just issued their new 'Bill of Rights' to the American people, and I definitely don't see many being too happy about it...  Do you think the U.S. needs a president who has a tough immigration stance?"},{"comment_id":"1092002180891914","commenter_b":"Tiny little penis","commenter_a":"Piece of shit","post_message":"Think quick! Then, click 'like' on your favorite answers in the comments.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153969905469575","commenter_b":"Translation ?","commenter_a":"The bus should not pass that test bc there was something wrong if bus driver try back out but it's still jump forward an hit students an a frav principal an it's be proof on wthr new long time ago when they was look why bus have problems pass the test!","post_message":"In their inspection last night, police found nothing mechanically wrong with the bus involved in the fatal crash at Amy Beverland Elementary School.  Police are still awaiting the toxicology results from the mandatory blood draw, but the bus driver showed no signs of impairment."},{"comment_id":"10153457931491130","commenter_b":"Zane Gutierrez","commenter_a":"The politics of this is, scandalously ,that its a way for the establishment to write people off , they do not want to understand., There is so much hypocricy on this particularly in relation to alcohol : whats wrong with wanting to feel good , which is why anyone tries to get high off anything ?How we try to achieve this might be questionable but anything can be abused, does not make it bad in itself . people would not do self-destructive things if they felt self-worth. As some people here have said in their comments here,learning to love themselves was key to giving up the addiction .(not read the article btw)","post_message":"'We put people who are not well in a situation that makes them feel worse and hate them for not recovering.'"},{"comment_id":"550509575137335","commenter_b":"So do it already arrest her corrupt ass because she is dangerous to our society.","commenter_a":"yeah...won't hold my breath !! 'smh'","post_message":"FINALLY..."}]
