[{"comment_id":"10152736026831051","commenter_b":"Liberal logic - Ban guns because you can call the police but the Police are Militant racists that can't be trusted so who are we supposed to call again? Ban all guns in the U.S. it will make us safer but keep the borders open so when the black market opens the guns can flow in like water. On an ending note; Police are in no way obligated to protect you from any threat per the Supreme Court so I guess when they do show up they can draw that chalk outline around your fresh corpse.","commenter_a":"Blah blah blah bullshit bullshit bullshit out of all the diehard ammosexual blowhards who love their guns. Europe doesn't have the problems we have in the country with guns. Neither does Canada or Australia. You want to believe what you want to believe. Follow the money. It's the NRA who wants you to keep your guns and fills your head with nonsense that you're just too willing to believe because you have no balls and tiny dicks. Try thinking about things instead of just buying into the rhetoric. The USA is safer now than at any other time in history. Why do you need them? Why focus on fairy tales like imagined revolutions against the government instead of focusing on things that are ACTUALLY happening like kids being killed in schools by LEGALLY OWNED GUNS.","post_message":"A company that worked on ‘Taken 3’ with Liam Neeson didn’t take kindly to his comments about the U.S."},{"comment_id":"453308998193014","commenter_b":"She's in AMERICA and that gives her the right to display the flag. Leave it up !!!","commenter_a":"Yes","post_message":"Do You Support This Woman's Refusal To Remove Her Flag?  Comment 'yes' or 'no'."},{"comment_id":"10153307243877217","commenter_b":"Holly Allcock sucks all cocks","commenter_a":"Trump is the most hated man in the world. What a disgrace!","post_message":"About 568,000 people have called for action against the presidential hopeful."},{"comment_id":"999541756747912","commenter_b":"Wake up American, Those people re Terrorists not Refugees.","commenter_a":"New York! !!","post_message":"WOW!"},{"comment_id":"10153976487996130","commenter_b":"we are living in the country that has no national insurance and crazy people can have a gun. poor sick people will die without government help and crazy people can massacre a lot of people easily and at one time with a gun.","commenter_a":"Kasa","post_message":"Another mass shooting. Another national address by President Obama."},{"comment_id":"10153654951896519","commenter_b":"@username tell that to Europe where is a hell hole for sex workers in the \"legal\" market and human trafficking of child prostitutes is at an all time high. Prostitution functions on the idea that women and their sex organs are a commodity to be bought and sold for the pleasure and consumption of men, it's dehumanization 101, how on earth could it be empowering when the average age that people start sex work is at 14?","commenter_a":"It is aginst the law yet you break it, You understand that liberals do not want you exploiting these women and yet you are hypocrite for doing so.","post_message":"\"Instead of seeking love, I sought success...\""},{"comment_id":"10154274649819087","commenter_b":"Dear Democrats and Liberals, I'm noticing that a lot of you aren't graciously accepting the fact that your candidate lost. In fact you seem to be posting even more hateful things about those of us who voted for Trump. Some of you are apparently \"triggered\". Because you are posting how \"sick\" you feel about the results. How did this happen you ask. You created \"us\" when you attacked our freedom of speech. You created \"us\" when you attacked our right to bear arms. You created \"us\" when you attacked our Christian beliefs. You created \"us\" when you constantly referred to us as racists. You created \"us\" when you constantly called us xenophobic. You created \"us\" when you told us to get on board or get out of the way. You created \"us\" when you forced us to buy health care and then financially penalized us for not participating. You created ...","commenter_a":"People will never vote Democrat again, once they appoint an Islamic extremist at the helm:)","post_message":"\"People didn't vote for Trump so he could bring a white supremacist into the White House,\" Elizabeth Warren said."}]
