[{"comment_id":"10156409954230354","commenter_b":"DUMBASS BITCH STRIKES AGAIN!!!!!#","commenter_a":"Get her out of the power supply. Feel for your own residents. One bankrupt San Bernardino. Please give our city hope .","post_message":"Nancy Pelosi’s message to Americans this Thanksgiving is that the nation’s “broken immigration system” is “cruel” to illegal immigrants. No mention of the THOUSANDS of victims of criminal illegal aliens. Pass the turkey..."},{"comment_id":"555840684604224","commenter_b":"Look how christianity views woman it's almost as bad","commenter_a":"What confuses me is why women would want to stay in this horrific religion that view women and children less than animal's. Mohammed is dead he isn't coming back !!!","post_message":"Spread this..."},{"comment_id":"384888735032754","commenter_b":"Beautiful.","commenter_a":"just awesome just like his dad great job","post_message":"Just like his Father...AWESOME!"},{"comment_id":"10153915007936336","commenter_b":"TRUMP the first one to say BUILD THE WALL. TRUMP the first one to say DEPORT. TRUMP the first one to say BOMB the hell out of the ISIS Oil Fields. TRUMP the first one to DEMAND LEGAL IMMIGRATION. TRUMP was the ONLY one to say NO refugees from countries that hate America! #TRUMP2016! - the best & ONLY choice to secure America!","commenter_a":"Let me see? Agreements with murdering Cuban communists and Iranian murdering Islamic terrorists. Agreements with such allies only means that they remain our enemies!!!!?","post_message":"Breaking News: The U.S. and Cuba have reached an agreement to resume commercial airlines service."},{"comment_id":"903256166376472","commenter_b":"Where does this B S come from !","commenter_a":"Stupidity","post_message":"Incredible!"},{"comment_id":"10154208001624497","commenter_b":"an improper whore","commenter_a":"I'd recommend an 8 ball of crack and a proper whore","post_message":"\"Every reasonable alternative has been examined and exhausted; every rational avenue, from acupuncture to chocolate, explored to no avail.\""},{"comment_id":"720244888107018","commenter_b":"they ran out on their bill and stiffed the waitress , who had to pay it from her own pocket ... THAT'S why they want to raise min . wage to 15, so waitresses at diners can afford to pay the tabs of these deadbeats","commenter_a":"LMBO","post_message":"Who paid the bill?"}]
