[{"comment_id":"10153114585296130","commenter_b":"but feminism isn't about equality or justice.. it is about hatred for males and the destruction of the family..","commenter_a":"a male feminist.. wouldn't that be a bitch boy?","post_message":"Mark Ruffalo takes the (feminist) cake."},{"comment_id":"10152578653426636","commenter_b":"Crazy moms be crazin","commenter_a":"Jeremy Blackwater Lopez","post_message":"A mother is now facing charges after she allegedly forced her children to drink poisoned apple juice.  According to authorities, she came up with the plan because she was mad at their father."},{"comment_id":"10153299722707434","commenter_b":"I thought women hated dick pics. ;-)","commenter_a":"Huh. Where are the usual people who attack women for not being cautious enough? If you don't want to have problems, just don't take naked pictures. How dare this guy not take proper precautions around a woman? How dare he get unconscious? Girls will be girls, you know.","post_message":"Compounding an already criminally terrible idea, she sent the photo and video to her coworkers."},{"comment_id":"707783986078846","commenter_b":"Ugly bitch man!!!!","commenter_a":"Just plain stupoid","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"10153179631761833","commenter_b":"lots of canadians too,,but they have to do it ILLEGALLY,,,lol..","commenter_a":"The enemy fears us does not matter if they are in Washington or are muslim extremists the end results will be the same. We will protect our 2nd Amendment rights.","post_message":"John Lott: Terrorists can strike anywhere and at any time, giving them a huge strategic advantage.Unfortunately, too many politicians around the world are refusing to admit this.  In the U.S., over 12 million American civilians are licensed to carry concealed handguns.  These Americans save lives."},{"comment_id":"10154271812178717","commenter_b":"Seems like all women think of is sex lol","commenter_a":"I would love to see the media dig deeper into this story--if possible. So many details baffle me. Why was she with Rood and Ross in the hotel room, sharing a bed? If sexual abuse/assault was part of this web that led to her death, I hope it's exposed and the appropriate people are charged.","post_message":"Jazzmyn Rood was sentenced Friday for her role in the 2015 death of Eve Tarmey. Details here: @webpagelink"},{"comment_id":"10153227250726336","commenter_b":"Why did your daughter just bought a 10.4 million apt. What are you paying her away.","commenter_a":"Taking in millions of $ in the name of charity and only 12% actually goes to poor/charity......The Clinton Foundation is the family business for these two and supports them and their friends and family. DISGRACEFUL! But people are so blind and uninformed when it comes to Hilary and Bill...","post_message":"Former President Bill Clinton said there's nothing \"sinister\" in trying to get wealthy people and countries to spend money in a way that helps the poor."}]
