[{"comment_id":"10153236028424087","commenter_b":"Oh @username, beautiful, sexy, intelligent. You're a dream girl, woman.","commenter_a":"Exactly! Time to move on. Love wins errrr maybe","post_message":"“We've got to keep striving every day to treat each other the way I believe God sees us, as equal in His eyes,” Barack Obama said."},{"comment_id":"10154177685016943","commenter_b":"Quit talking about it and do something! Put her in jail!","commenter_a":"Enough already with the disclosures. I'd be happy with just one little indictment.","post_message":"Hillary Clinton has taken a beating this month over the discovery that donors to her family charitable foundation received special treatment from the State Department when Clinton was secretary of state. And she unlikely to get a reprieve before Election Day, as the organization behind those email disclosures expects several more headline-grabbing document dumps in the next 11 weeks. - via Newsweek"},{"comment_id":"1175628809124795","commenter_b":"Geena -_- those jerks","commenter_a":"Leave it to the u.s to ruin this cool idea!","post_message":"Why are people such assholes?!"},{"comment_id":"1824785004425894","commenter_b":"Women who support Trump have severe Stockholm syndrome and suffer insecurity","commenter_a":"Three times divorced, womanizer dares to talk about morality.","post_message":"Let's talk about the debate...what just happened?"},{"comment_id":"1018537924833053","commenter_b":"Teenage girls are creating life inside them all the time. Seems pretty easy to me. The quote is about the creation, not the maintenence of said life, so I'll leave it at that.","commenter_a":"Creating a life is actually one of the easiest, most instinctual acts all mammals share... It's not difficult at all. Properly caring for one is something else entirely.","post_message":"Wise words from Robyn Lawley: 'You created a life inside of you, that's no easy feat.'  (via HuffPost Canada Parents)"},{"comment_id":"1058553324165678","commenter_b":"That's it women take everything, soon they'll be complaining about not competing against men in the olympics, #equalityformen","commenter_a":"Yea thats cute... but look at developers these days... 99% are men. you wouldnt be on facebook talking crap right now without men.","post_message":"Margaret Hamilton was the lead flight software designer for Project Apollo. Just 31 when it landed on the moon, and her code has been credited for preventing an abort of the mission.  #womenyoushouldhaveheardof"},{"comment_id":"651668038332170","commenter_b":"And the idiots will vote her in.","commenter_a":"Thats true Mr President! A lot of unfair things are happening. Please take control of this country.","post_message":"The system is rigged. General Petraeus got in trouble for far less. Very very unfair! As usual, bad judgment."}]
