[{"comment_id":"10153700669189586","commenter_b":"I think you are an idiot. Zoos are bad conservation centres are good! You want to show your children animals in far too small spaces and teach them this is acceptable? Why don't we then put our toddlers in gages where we can keep better eye on them.","commenter_a":"That's totally insane! BAN ZOOS!","post_message":"The kids' faces say it all."},{"comment_id":"10152851658596636","commenter_b":"I am Muslim..&I say Good For Them! I hope it's banned allover the world..it has nothing to do with Islam .. It only has to do with Extremism &safe wise.. It's very dangerous...in many cases it's being used by terrorists..men or women escaping the law...etc","commenter_a":"Should be banned everywhere in the civilized world, its loved by fanatics, it belongs in regressing places like the Isis caliphate only.","post_message":"The Government says the move has 'nothing to do with religion'"},{"comment_id":"494982004030385","commenter_b":"The towers that Donald Trump built ... Border Patrol endorses you to build that wall too, Mr. Trump ... A BUILDER ... not a destroyer ... of American liberties/freedom FOR POTUS!!! @webpagelink @webpagelink #DONALDTRUMP #POTUS #REPUBLICANPARTY #GOP #2016ELECTION #BORDERWALL #BORDERPATROL #TRUMPTOWERS #PRESIDENTIALPRIMARIES #VOTETRUMP #TRUMPTRAIN #MAKEAMERICAGREATAGAIN","commenter_a":"7% lead is good but you know that you need to win by double digits to shut ted up. IF you have any last minute secret weapons or anything you haven't used now is the time. Win NY huge and then take Cali and then proceed to destroy the liar and the commie.","post_message":"Thank you, California! I will see you soon! Have a great day - and remember - - TOGETHER WE WILL MAKE AMERICA GREAT AGAIN! #TrumpTrain"},{"comment_id":"966202806772801","commenter_b":"#dumbasses","commenter_a":"Robbie Raul Markosyan","post_message":"Kate Upton among scores taking part in #HoldACokeWithYourBoobsChallenge for breast cancer... unaware the trend ISN'T raising money"},{"comment_id":"1059297857458355","commenter_b":"bag your bags u/piece of pig shit bitch & go back or get killed soon","commenter_a":"bring this bigot home and throw her off the team.","post_message":"Seriously?"},{"comment_id":"10152965639377690","commenter_b":"Evil women have already stole my soul. It's too late.","commenter_a":"Really? Really?","post_message":"Texans hold prayer vigil for Blue Bell Ice Cream after massive recall @webpagelink"},{"comment_id":"1297208260357707","commenter_b":"How can she do that from behind bars","commenter_a":"Only three more days of this fake bullshit, then Hillary will shut your lying asses up.","post_message":"The Associated Press may be the most venerable wire service in the world. However, they're now under massive fire after the sickening offer they made to the Clinton camp was just discovered...  The press is willing to do anything to stop Donald J. Trump, and this is yet more proof."}]
