[{"comment_id":"10153712165499138","commenter_b":"I'm not a hunter, however, anyone who eats meat has no right to be against hunting your own meat. At least the animals being hunted have a chance and have a good life in the wild. Anyone who eats grocery store meat should try going to the farm that the meat came from, those animals have it far worse than a dear dying from a quick shot.","commenter_a":"Stop this hunting that's what he gets","post_message":"A reminder worth sharing. Have a safe hunting season."},{"comment_id":"10157139733295354","commenter_b":"\"Lets bring in 1000's of Muslim refugees\" Sincerely, Libtards of America","commenter_a":"Have you seen this on BBC today ?????When Donald J. Trump offered to make Sadiq Khan an \"exception\" to his ban on Muslims travelling to the US, here's how the new London Mayor responded.","post_message":"***BREAKING***"},{"comment_id":"10153620760216028","commenter_b":"From the Bible: (who cares about what verse, you know it's in there!) If your own full brother, or your son or daughter, or your beloved wife, or you intimate friend, entices you secretly to serve other gods, whom you and your fathers have not known, gods of any other nations, near at hand or far away, from one end of the earth to the other: do not yield to him or listen to him, nor look with pity upon him, to spare or shield him, but kill him. Your hand shall be the first raised to slay him; the rest of the people shall join in with you","commenter_a":"Quran (2:191-193) - \"And kill them wherever you find them, and turn them out from where they have turned you out. And Al-Fitnah [disbelief or unrest] is worse than killing... but if they desist, then lo! Allah is forgiving and merciful. And fight them until there is no more Fitnah [disbelief and worshipping of others along with Allah] and worship is for Allah alone. But if they cease, let there be no transgression except against Az-Zalimun(the polytheists, and wrong-doers, etc.)\"","post_message":"UPDATE: The death toll has risen to 63 people, with more than 300 others injured. The Pakistani Taliban has claimed responsibility for the suicide attack. BREAKING: At least 52, mostly women and children, were killed and around 150 others were injured when an explosion ripped through a crowded park in the Pakistani city Lahore, a few feet away from children's swings, officials said. @webpagelink"},{"comment_id":"10153276953617293","commenter_b":"Whitesplaining.","commenter_a":"I guess since the whitest guy in the world doesn't find it offensive it must not be.","post_message":"\"I don’t find it offensive,\" Jeb Bush said. \"Native American tribes generally don’t find it offensive.”"},{"comment_id":"10154840389483256","commenter_b":"Mine Fuhror has a real hard on for the $500BILLION dollar oil deal with the Russians.","commenter_a":"Trump keeps finding the billionaires who will so care about the United States and her citizens, I am sure. Are the pigs flying yet?","post_message":"President-elect Donald Trump is expected to select Exxon Mobil chief executive Rex Tillerson as secretary of state, elevating a dark-horse prospect who seems to have surged past seasoned political actors like Mitt Romney and Sen. Bob Corker, R-Tenn., in the stretch."},{"comment_id":"10153906891941051","commenter_b":"When you don't treat a woman right - she will do you wrong.","commenter_a":"Wish I had not read this.","post_message":"A man came home early only to find his wife in bed with someone else. The worst part? It was with the absolute last person he'd ever expect to find her in bed with."},{"comment_id":"1156100184429437","commenter_b":"This woman is for Trump","commenter_a":"It was really disgusting watching how Fox News joined the rest of the \"Left-stream\" media last night in savoring Ted Cruz's Wisconsin win. Megyn Kelly & co. continually dissected the voters by pointing out that \"Trump was losing the appeal of woman voters.\" \"That Wisconsin voters were educated and paid very close attention to details!\" How sad. Never in my life have I witnessed how the GOP could deliberately try & take down one of their own while leading the attacks against Mr. Trump in their on-going crusade \"to stop Trump!\" This is very disturbing. Cruz and that nasally annoying voice of his was carrying on as though he transformed this presidential race when in fact it was Mr. Trump who initiated the anti-establishment hostility from the moment he threw his hat in the presidential ring. Cruz is a GOP plant as is Kasich.","post_message":"THE EXPANSION OF TERROR is so much worse than what we'd like to admit, a new report out of the EU confirms: @webpagelink"}]
