[{"comment_id":"10154081202079205","commenter_b":"We now need the DNC to forever get rid of super-delegates. This should be an immediate mission, so this never happens again. Contact the DNC and demand we end the Super-Delegates! #DNC #NoMoreSuperDelegates #ListenToVoters #VotesMatter @webpagelink Mailing address: Democratic National Committee 430 South Capitol St. SE Washington, DC 20003 Main phone number: 202-863-8000","commenter_a":"Yes it was a circus , that's too bad , 15 rounds Trump TKO not a knockout","post_message":"What did the polling look like heading into the CNN New York Democratic Debate, did the polls impact #BernieSanders or #HillaryClinton performance in the debate?"},{"comment_id":"773671329465065","commenter_b":"The hole is on the wrong side of her head for her to shoot herself and fall that way too.","commenter_a":"Murder. She has the gun on the wrong hand and she's left handed.","post_message":"What y'all think? #WSHH"},{"comment_id":"1175706475803156","commenter_b":"But women shouldn't be able to get birth control or abortions...","commenter_a":"Now thats the Paul Ryan I know.","post_message":"WOW."},{"comment_id":"10154047243421990","commenter_b":"Your moms desperate.","commenter_a":"Out of all California, he gets a \"band\" from Hilmar, CA. I'm sure the musicians are talented but...LMAO!","post_message":"Who will be marching in Donald J. Trump's inaugural parade? Here's your answer: @webpagelink"},{"comment_id":"10154126600721770","commenter_b":"I agree....classy lady","commenter_a":"Ivanka could hop into a potato sack and make it look good.","post_message":"You couldn't miss Ivanka Trump today."},{"comment_id":"10155910391265725","commenter_b":"Take America back. STOP buying crap from other countries.","commenter_a":"DONALD TRUMP: Speaking what everyone is thinking. TAKE AMERICA BACK.","post_message":"Wow, some new and even greater polls-- thank you!"},{"comment_id":"775477502501275","commenter_b":"I agree with Mark Colwell.one muslim won't go against the other.they are all for crap..","commenter_a":"Gee, really, and what would they do if he made them angry? Another Dem moron speaks in defense of her Beloved Leader and what she says is as stupid as they both are. How do these people get through even elementary school being this dumb?","post_message":"And this is what Democrats think about terrorists... #facepalm"}]
