[{"comment_id":"10153436831622217","commenter_b":"I never said I sympathized with Rhodes, I'm concerned over how you are passing over Hitler's attrocities if they are nothing. Generally, people who downplay Hitler are anti-Semitic","commenter_a":"Oh my God... if you compared Hitler with Cecil Rhodes, the former is a TODDLER... he killed over 15 million people, kidnapped forced millions into slavery, his statue shouldn't be anywhere for people to remember him, he's not hero or we can have statue of HITLER in Berlin","post_message":"Campaigners say #CecilRhodes represents white supremacy."},{"comment_id":"10154335459871509","commenter_b":"Bret, insults show a lack of intelligence, but continue.","commenter_a":"10 Reasons for Supporting Trump 1. Donald Trump is immune to special interest lobbying because he has accepted no donations or special interest money. No other candidate can make this claim. 2. Trump knows how to negotiate. No one builds an international business empire the size of Trump without being able to win at the negotiating table. 3. Donald Trump is an executive. The President of the United States is the Chief Executive Officer of our nation. We don need a policy expert or a legislator we need someone who knows how to run an organization. Trump is the only candidate who has a proven record as a successful executive on a large scale. 4. Trump is a man who tells the truth. He may not always say it in the most polished way, but our country has had enough suave liars. It is time for some straight forward honesty. ...","post_message":"Emotional scenes at Vancouver airport."},{"comment_id":"983083455063224","commenter_b":"Don't apologize, you have a right to feel the way you do, you are a woman","commenter_a":"GEEZE","post_message":""},{"comment_id":"10154529100646323","commenter_b":"@username..tanks, anti-missile system or cannons are completely useless in civil war in a country where anybody and everybody can have a gun. And when government doesn't know who has it. There's a reason America in a last century (and before) was the safest place to live in the world. Totaling all the murders in 20th century USA is 10-20 times safer than S. America, Africa, Europe or Asia. Thanks to 2nd Amendment in our Constitution.","commenter_a":"It is odd how right-wing custodians of patriotism have a problem with Kapernick regarding the anthem but hardly emit a peep when scores of people are killed by lunatics with guns who take advantage of that great piece of antediluvian legislation otherwise known as the Second Amendment.","post_message":"\"Declining to stand and laud that country until these outrageous, deadly imbalances are repaired – until our flag actually does represent everyone – is perfectly reasonable. America gets my unreserved, hand-on-heart patriotism when it earns it.\""},{"comment_id":"901774593215623","commenter_b":"About time we had larger ladies ,","commenter_a":"looks interesting !!!","post_message":"'I feel sexy and confident'"},{"comment_id":"978723315520750","commenter_b":"With photographs like that, she ain't no lady!","commenter_a":"too much hate toward this young lady. Racist white pigs","post_message":"It's the pool party that forced a police officer to resign...but the organiser has got a modeling contract out of it"},{"comment_id":"10154645739237178","commenter_b":"Rather have snow than ice in Wake Forest !","commenter_a":"Sketchy in so pines","post_message":"Winter weather update with WRAL Elizabeth Gardner. (Stick around for the end to watch a little gloating from Brian Shrader's Anti-Snow League)"}]
