[{"comment_id":"1537745596485739","commenter_b":"Got it STOCKINGS !!!!!!","commenter_a":"salt","post_message":"Riddle of the day! What is it?   Quiznatic Media"},{"comment_id":"10155114776336509","commenter_b":"Yes lets look at all those years Hillary has been in office but she doesn't handle classified information. So what does she do??? Trump has declared bankruptcy 7 times out of over 500 businesses. Pretty good success rate. I would like to see you try and run two businesses and see how you do. NEVER HILLARY!!!!!!","commenter_a":"Let's compare resumes, shall we? Hillary Clinton: 9 years, First Lady of Arkansas 8 years, First Lady of the United States 8 years, U.S. Senator 4 years, U.S. Secretary of State Donald Trump: At least 15 failed businesses Owns casinos that have filed for bankruptcy no less than 4 times 0 years in public service Now, if you were looking at those numbers, who would you hire? Who would you trust?","post_message":"While introducing Hillary Clinton at an appearance in Omaha, Nebraska, billionaire Warren Buffett challenged Donald J. Trump to release his tax returns: 'I'm under audit too. I would be delighted to meet him any place, any time. ... I'll bring my tax return, he can bring his tax return.' @webpagelink"},{"comment_id":"1322741314433625","commenter_b":"MORE POWER TO THE AMERICAN PEOPLE AND GO SUCK AN EGG TO U DAM MUSLUMS.","commenter_a":"If that's what they want, let them start their own school, with their own money.","post_message":"JUST IN..."},{"comment_id":"939799776150807","commenter_b":"Screw her!!!","commenter_a":"They have been alright with it as long as it worked inn their favorr.","post_message":"Democrat Senator Introduces Bill to Abolish Electoral College @webpagelink"},{"comment_id":"10154203076004087","commenter_b":"Of course Axelrod.... in the mean time we have to keep a corrupted woman out of the WH by massively voting for another candidate... Just get back in the swamp and be happy Axelrod Traitor !","commenter_a":"It has been revealed that part of the Clinton strategy is to incessantly blare from any and all platforms that it's game over, Hillary already won, Trump can't win, etc. Of course the reality is that Hillary can't fill high school gyms with supporters while Trump fills arenas. So, only a few more days till we know if votes still count or if we live in a rigged system controlled by some shadow government and foreign interests.","post_message":"'I don't know any consultant on either side, any strategist, who privately believes that Donald Trump is going to win this election,' Obama campaign strategist David Axelrod said."},{"comment_id":"452509181540789","commenter_b":"Courtney i could care less what a fugly cunt, such as yourself thinks.","commenter_a":"No one wants to see ugly bitches without a top on.....maybe feminazis, but they don't count they're not people","post_message":"We support these brave and courageous women as they demonstrate against the rise of #policebrutality nationwide. What do you think about this form of protest? Effective?   Learn more → @webpagelink #SayHerName #FreeTheNipple #StopPoliceBrutality #TFTP"},{"comment_id":"10154960801467232","commenter_b":"'@username what benefits do you offer","commenter_a":"They call it pennsyltucky for a reason. Outside of philadelphia its all trailerparks and farms.","post_message":"The Southern Poverty Law Center defines a hate group as an organization that has  or practices that attack or malign an entire class of people, typically for their immutable characteristics. @webpagelink"}]
