[{"comment_id":"1126542647424270","commenter_b":"@username oh I wouldnt doubt that, that witch needs to go down!!!!","commenter_a":"Not the first time this reporter has accused someone of the same type of assult, just another reporter looking for the spotlight!!!!","post_message":"The Secret Service just dropped a massive bombshell about the charges against Donald J. Trump's campaign manager, Corey Lewandowski... this is huge. What this agent says about the \"assault\" will completely change the case..."},{"comment_id":"1753089554908587","commenter_b":"Race has nothing to do with him being a dumbass.","commenter_a":"and he owes over 10.000.000 to creditors in US","post_message":"Kanye West is finally leaving. Thank the lord. We don't want him anyway. Can we get 5,000 'LIKES' to have Kanye leave for good!"},{"comment_id":"676191809238064","commenter_b":"I`ll say it agin, if the damn guns would stop shoten off there damn barrols!","commenter_a":"This father did not know his son was mentally ill and did not know his son was planning to commit mass murder with the dozen or so guns that unknown to this same father. This father is such a failure and out of touch with his son that his opinion doesn't count. He failed his son and now wants to put the blame some where else.","post_message":"The father of the shooter in Oregon just blamed guns for what happened. He must be out of his mind. This is a sick joke. Do you think his son is to blame?"},{"comment_id":"10153621477392293","commenter_b":"Holy crap. Did you even read it?","commenter_a":"UCMJ does prohibit frat w subordinates. This was NOT RAPE. Rape is not consensual. She was consenting then because he pulled away? She claims rape?? Not fair. If she wanted to be an officer then suck it up buttercup.","post_message":"A Naval Academy teacher fights to prove he’s innocent of sexual misconduct. Then a lost cell phone is found."},{"comment_id":"10154072479709586","commenter_b":"This is so wrong... Those poor chicks.","commenter_a":"What fking country is that, where?! This is filmed. Why isn't someone there to do something about that?!","post_message":"People actually do this for #Easter. All the babies are just DUMPED in there :("},{"comment_id":"10153519316691037","commenter_b":"Disney isn't on my list of good companies either. They are firing Americans and hiring ILLEGALS. Really?","commenter_a":"Whatever happened to statute of limitations? If he did this, I certainly don't condone it, but this was 40 years ago.","post_message":"Disney's decision comes after court documents from 2005 were unsealed"},{"comment_id":"10153696558342629","commenter_b":"SO MANY fucking people are up in arms for this person. Unless her mental illness was so severe, that she couldn't have had the slightest idea that driving into a crowd of people was a BAD thing to do, then I don't think her being an angry, evil nut job is enough to let this thing off the hook.","commenter_a":"Is anyone surprised that Adacia Chambers already has a days-old Facebook support group? Yeah, me either.","post_message":"“The evidence suggests this was an intentional act, not an accident.”"}]
