[{"comment_id":"507357776079666","commenter_b":"This bitch","commenter_a":"What a whacko...and who says \"keen\" anymore?!","post_message":"Look at me! Look at meeee! I'm better than Hillary!   -Linda"},{"comment_id":"478375502350743","commenter_b":"Ridiculous. Stop this nonsense","commenter_a":"Pay the fine..it's a small price to pay for all God has given us.","post_message":"Obama's America hating Christianity..."},{"comment_id":"10157017965955206","commenter_b":"The women will rally and vote for a woman... that will be Killary. Just like Obama got his job because of his race.","commenter_a":"Check the men's response compared to the women's response here. You all k ow so.much about what we think. Well, Much of what she says has merit. Whether you like her voice or her face! She speaks for many women. As long as you make this about her voice or her face, YOU are the PROBLEM! WE are HERE! WE have a VOICE whether you think we're pretty or sexy or pleasing or NOT!","post_message":"My whole life, people have told me to settle and accept the way things are. Now, politicians are asking the American people to do the same thing: to settle for a nation that doesn’t reach our potential."},{"comment_id":"10153956190753797","commenter_b":"She better go to juvenile....period.","commenter_a":"those other kids should be charged also for not stopping it and cheering it on! makes me sick!","post_message":"UPDATE:  Last week, a controversial video went viral that shows a 3-year-old child being dragged and beaten by two young girls. Over the weekend, officials identified the girl and brought her in to custody. The shocking details involving the attack, here:"},{"comment_id":"10152969085332623","commenter_b":"Lock up your wives.","commenter_a":"Filling out that trophy case.needs that one for the set!lol","post_message":"Tiger Woods has entered to play in next week's Wyndham Championship in Greensboro:"},{"comment_id":"10154005509605575","commenter_b":"Go back to Canada you slimy rat","commenter_a":"THIS IS THE MAN THAT HELPED DEVELOPE NAFTA FOR THE BUSH'S IN ORDER THAT WE WILL HAVE OPEN BORDERS","post_message":"Trump blasts Natural born Canadian Ted Cruz..."},{"comment_id":"1201296159904188","commenter_b":"Trump a moron! !!","commenter_a":"Donald J. Trump","post_message":"Megyn Kelly May Have Just Crossed The Line With This Comment About Trump  She just started a battle that she will never be able to win.  Do you stand behind Trump over Megyn?"}]
