[{"comment_id":"10153494400717093","commenter_b":"They some hoes","commenter_a":"'@username Mayra Castaneda","post_message":"Instead of going into a legal battle, the Dallas owners want the public's help picking a new name for the restaurant. @webpagelink"},{"comment_id":"1397444103681973","commenter_b":"Welcome to the internet hun.","commenter_a":"90% percent of the people calling others cry babies are the same who were crying and complaining when obama was president.","post_message":"This one sums up today's women's rights marches beautifully..."},{"comment_id":"1289522947781268","commenter_b":"Spoiled racist brat","commenter_a":"Michelle Obama is the most bitter, most racist First Lady in recent history.","post_message":"First lady Michelle Obama implied this week that many Americans no longer have hope because of Donald Trump's victory.  Thoughts?"},{"comment_id":"10152991625460409","commenter_b":"GOD BLESS GOV RICK PERRY. I PRAY IF THE LORD LEADS YOU TO RUN FOR THE PRESIDENCY THAT YOU WIN. YOU HAVE BEEN THE BEST GOV THAT TEXAS HAS EVER HAD. I'M PROUD TO CALL YOU A BROTHER IN CHRIST AND I PRAY THAT WHATEVER YOU ARE LEAD OF THE LORD TO DO THAT GODS BLESSINGS WITH OVERFLOW TO YOU.","commenter_a":"I never understood the concept of hurting one class of Americans helps the other! Question for Obama, if the wealthiest 1% is forced to pay their fair share as you say are they more likely to sacrifice their life style to pay the tax hike with or slash the payroll aka are jobs to pay for it ? And if given the choice between getting the rich to pay ( again as you say) their fair share or having a job to provide for my family, I'll take the latter every time!!","post_message":"This administration has failed to prioritize job creation and economic opportunity. The Washington culture may be fundamentally broken, but the American spirit that built this great nation is not. America's leaders should be working to ensure every person who wants a job, has a job. That’s what this is about – making sure mothers and fathers can provide for their families and our children have every opportunity to pursue their dreams. #SOTU"},{"comment_id":"10153274848901600","commenter_b":"Just send a card. She should get the hint.","commenter_a":"Decline the invitation","post_message":"A mom is causing a backlash online for an apparent email she sent before her son’s first birthday party. The email includes specific requests about acceptable gifts for her son."},{"comment_id":"10154146599832541","commenter_b":"Can we deport you? Bigots not needed in America.","commenter_a":"Aren't Obama's illegal immigrant aunt and uncle still here? They should be top priority for deportation.","post_message":"Joel LaPierre will have to keep his racist thoughts to himself from now on."},{"comment_id":"1012624708881318","commenter_b":"'@username. She speaks 5 languages!! How many do you speak?","commenter_a":"I honestly can't stop crying right now to know that this monster is playing with families like this when his wife can't even speak English herself","post_message":"Watch protests at U.S. airports in opposition to Trump's executive order restricting travelers from specific countries.  Read more details on the travel restrictions issued by President Trump: @webpagelink"}]
