[{"comment_id":"861460177233384","commenter_b":"She needs to smoke. Nancy Disgrace","commenter_a":"I refuse to watch her anymore..go away Nancy!!!!","post_message":"Nancy Grace vs. 2 Chainz: Part 2! Right now on HLN. Where do you stand on the debate? #PotToBlame"},{"comment_id":"10153163966344255","commenter_b":"Where my confusion comes in is most people don't trust the government with their money but they will trust it with their children's lives....","commenter_a":"See fellow liberals? This is the fanatic pro-vaxxers showing their true face. Fascist totalitarianism. Hitler and Mengele would be proud of the folks signing this petition. These are not liberals. These are corporate thugs in disguise using liberal forums like @username to try to convince us that the pro-vax position is the smart, scientific , modern one and that vax-skeptics are a bunch of right wing anti-science fundamentalist boneheads. Its simply not the case. The real smart folk can see right thru this Big Lie that all vaccines are perfectly safe. They clearly are not. And most of us do not want to ban vaccines as they would have you believe. We just want safer vaccines, common sense, and for folks to see both sides of the scientific debate. And yes, vax fanatics, there IS a scientific debate.","post_message":"Public health must trump parental choice. Tell your governor to introduce legislation to ban all belief-based vaccination exemptions."},{"comment_id":"984815688241627","commenter_b":"She is the best lying POS that know!","commenter_a":"She is the best","post_message":"“If you want a president who will tell you everything that’s wrong with America and who’s to blame for it, you’ve got plenty of other choices.…But if you want a president who will listen to you, work her heart out to make your life better, and together to build a stronger, fairer, better country—then you’re lookin’ at her.\" — Hillary today at the New Hampshire Democratic Party State Convention"},{"comment_id":"1287415054614429","commenter_b":"@username If SCOTUS is majority conservative, and I'm sure it will be, they won't overturn any of this because they don't care about the wellbeing of this country or its people.","commenter_a":"Wanna bet? First, women have been ending pregnancies for millenia and nothing the Kentucky Legislature can do about that. Second, with Roe V Wade the law of the land, any attempts to ban abortion will be overturned. Third, the so-called \"pro-lifers\" will not always be in total control of Kentucky and what this Legislature might pass can just as easily be thrown out.","post_message":"For the first time in 95 years, Republicans took total control over the Kentucky state government this week and immediately moved to strip rights from women and workers."},{"comment_id":"543443959158926","commenter_b":"Time to skewer the witch!!","commenter_a":"Hell Ya !","post_message":"'Hillary Is In for the Ride of Her Life' When She Takes On Trump. Governor Mike Huckabee"},{"comment_id":"1416682211693618","commenter_b":"Ya we we'll come u 2 da seat Hillary","commenter_a":"She is a wonderful woman, read this to get the proof @webpagelink","post_message":"A reminder heading into tonight's debate."},{"comment_id":"1125723030801501","commenter_b":"Lord, she's a vile woman.","commenter_a":"Does anyone have the balls to fire this woman for not doing her job. FIRE HER!!!!!","post_message":"Seems Kim Davis may be going back to jail..."}]
