[{"comment_id":"10153673371886336","commenter_b":"Exterminate them all","commenter_a":"And they wonder why their lives don't matter?","post_message":"Scott Lattin and his family painted the words “police lives matter” on the back window of their truck.  Then, someone spray-painted obscenities about the police on their car and wrote “black lives matter” in spray paint across the side of the truck.."},{"comment_id":"10153751099450575","commenter_b":"get this ass out of office and then let them rape her!!!!!!!!!!!!!","commenter_a":"Yup!!!!! a little common sense, people....she's the leader of Germany...Oh , sorry, look at the leader of the U.S. He's not smart enough to pick up on this.....well I think he is smart enough , but he's on a fast track to destroy america, so, it can do that!!!","post_message":"Now she admits it after she already destroyed Germany. . . ."},{"comment_id":"10152931648796491","commenter_b":"They are business women now and could buy everyone on the show. Maybe they will make a cameo appearance, if the show stays on the air? They should just leave the show alone and move on with their lives.","commenter_a":"I believe they've both stated they are through with acting. Its their choice how they live their lives. They don't owe anyone anything. They're both very well suited for their current endeavors in fashion, out of the limelight.","post_message":"“I understand they’re in a different place and I wish them the best,” John Stamos said."},{"comment_id":"401829593338668","commenter_b":"How very sad to read this. Our vets are not being taken care of properly and it is a shame. The President cared more for illegals then he does our veterans. Shame, shame.","commenter_a":"Semper Fi marine R I P","post_message":"RIP Marine..."},{"comment_id":"10154278123559497","commenter_b":"so sorry, I hate seeing girls do this to gay guys","commenter_a":"As a gay man, this was the majority of high school. Being dragged along by my female best friend. Apparently as a gay guy I was supposed to Enjoy whole foods, Bloomingdales, frozen yogurt and Mac lol. Also always being asked for advice by every girl on guy issues.","post_message":"'You just never know where the day is going to go with Paul.'"},{"comment_id":"996595140397015","commenter_b":"These gun nutters are too chicken to go fight a REAL threat, so they try to intimate normal people. You freaks are just trying to intimidate people. Red beck, Inbreeds!","commenter_a":"You don'y have to give up your guns, and no one is proposing that (I'm a gun owner and a vet), to have sensible regulation.","post_message":"“I grew up in Tucson, Arizona, and I live there now. And I'm a gun owner and a supporter of the Second Amendment. But I couldn't give you more credit that we need to deal with the wrong people getting guns, especially with mental illness. As you know, in Tucson we had a person who had all kinds of trouble and was able to buy a gun. In Virginia Tech. In Louisiana… So from a gun owner, from a reddest of red states, and a person who owns guns, more power to you.” —an attendee at Hillary’s town hall on gun violence prevention in Manchester, NH"},{"comment_id":"1532770816783042","commenter_b":"You are a gross old creeper anyways. Have fun jerking off the rest of your life.","commenter_a":"Fuck black Lives matter!","post_message":"Black Lives Matter is a racist hate group! Share if you agree!!"}]
