[{"comment_id":"10156572511460725","commenter_b":"You just hit a grand slam Ron! Trump 2017-2025","commenter_a":"Donald Trump - Think about it... will they stop him, Democrats and Republicans alike? This affects all Americans who get the short end of the stick Democrats and Republicans and Independents. Interesting take on Donald Trump Former U. S. Secretary of Education , William J. Bennett's frankly candid and shocking observations of Donald Trump's impact on the behavior of the entrenched Washington D. C. bureaucrats in both parties -- and the risk The Donald faces in so doing. William J. Bennett, Host of Bill Bennett's Morning in America Show, is one of America 's most important, influential, and respected voices on cultural, political, and education issues. He has one of the strongest Christian world views of any writer in modern times. What I See Happening In a Trump Presidency By Bill Bennett They will kill him before they let him be president. It could be a Republican or a Democrat ...","post_message":"What a great honor- the Reverend Jerry Falwell Jr. of Liberty University, one of the most respected religious leaders in our nation, has just endorsed me!"},{"comment_id":"10153486419716680","commenter_b":"Yeah, see you at the polls.","commenter_a":"Only because he has not been Vetted by the Media he's a very flawed man mean and nasty. He's not well like in the Senate he was not an effective Senator! once he is fully Vetted those numbers will go down! for those who are members of his Cult why don't you do more research on him? You all have that Jim Jones Mentality and are drinking his Kool Aid! You may not know who Jim Jones is? because again you know nothing about Politics or Math or Civics! You seem not to have Jobs and Mommy And Daddy never said No to you! The old goat s a lying Fraud and you believe his BS! Those are also his Initials!","post_message":"Bernie Sanders now has 48 percent support nationwide, putting him in a virtual tie with Hillary Clinton, who is at 50 percent."},{"comment_id":"10153097133433271","commenter_b":"Better relocate. .. drunks and moosee don't mix well..... drunk will loose","commenter_a":"@username this would've been amazing:)","post_message":"A young female moose wandered into downtown Boulder Sunday night, strolling down the Pearl Street Mall. On the advice of a state wildlife officer, police fired some bean-bag rounds at the moose's backside and eventually shooed it away from the populated area.  More details: @webpagelink"},{"comment_id":"10153240911786491","commenter_b":"Women spend 25 percent of their lives menstruating. That is the biggest reason we spend more time in the bathroom.","commenter_a":"The only way to have bathroom equality is for women's toilets to have the same turnover rate of women coming out of the bathroom as men. Just because it's the same physical size restroom doesn't mean it's an equal situation.","post_message":"\"Many public restrooms continue to be facilities that are equal in physical space, while favoring men’s bodies, experiences, and needs.\""},{"comment_id":"434228700035058","commenter_b":"Why so illegal immigrants can collect our money??? I think u should have to prove that you' have worked for 20 yrs or more to collect","commenter_a":"Also give thanks to Bill Clinton who signed the bill making it legal to outsource jobs here.","post_message":"Jeb Bush wants people to work until this age. I'm sure this will raise some eyebrows."},{"comment_id":"10150859256639999","commenter_b":"What a great joke....I mean choice for first woman president! Way to be a role model for young thugs of this great nation! Proud non supporter of the most despicable woman in the world! Rot in prison and may you get your soul back from satan! God bless America and God bless the American dream!","commenter_a":"She'll have plenty of time to read in prison!","post_message":"\"She’ll drop everything for a few minutes of blowing kisses and reading Chugga-Chugga Choo-Choo with her granddaughter,\" Chelsea Clinton said of her mom."},{"comment_id":"1077135272363972","commenter_b":"Stop the madness! Go home!!","commenter_a":"Ignorant people taking up the time of our officers who put their lives on the line everyday. Hope none of them have to call 911 one day.","post_message":"Hundreds of protesters marched through Buckhead, blocking part of Peachtree Road. Several people were arrested. @webpagelink"}]
