[{"comment_id":"1921412701405309","commenter_b":"Your daughter is next.","commenter_a":"But had they wasted the dude, they'd be selling shirts with his thug face and calling for a cop lynching.","post_message":"A police officer's body camera captures the moments he and his partner were shot during a traffic stop. More details ---> @webpagelink"},{"comment_id":"1438922076159420","commenter_b":"Chill your butthurt bitches lol","commenter_a":"Are you kidding me? You people need to get a life!!!","post_message":"Was it inappropriate?"},{"comment_id":"1054613801267881","commenter_b":"If they don't want to abide by our laws then go back to where you came from.","commenter_a":"I am sorry, but if you live in America, our laws trumps your religion.","post_message":"Muslim who refuses to remove head covering for officers gets rude awakening. Regardless of religious law, this is a safety concern. Do you think she got what she had coming?"},{"comment_id":"608238889333781","commenter_b":"They can leave this country","commenter_a":"Tell them to leave","post_message":"Texas Man Told Remove His American Flag Because It Was A ‘Threat To Muslims’. Let's show this patriot our support. Can we get 75,000 'LIKES' for his love of his country?"},{"comment_id":"10153204606574342","commenter_b":"If she hate America she need to move","commenter_a":"but, she likes their $$$$$$$$$$$!","post_message":"Ariana Grande says she's sorry for saying \"I hate America\" in a recent video that leaked of her in a doughnut shop."},{"comment_id":"927319353970153","commenter_b":"Who cares about whatever Sarah has to say....she's a nobody. Good grief !!","commenter_a":"BO doesn't care he's in office as a fraud perpetuating and feeding the muslime brotherhood on our dime","post_message":"HA HA!"},{"comment_id":"10154151078661002","commenter_b":"Oh please just remember who killed the most Americans on American soil they were not Black or White that's what's wrong with this country if we banned together we would never worry about muslim terrorist! They wouldn't stand a chance against the blacks and whites of America","commenter_a":"Because he's a pale person his information is not even released yet","post_message":"3 dead in Lafayette theater shooting WATCH: @webpagelink #Local4Today"}]
