[{"comment_id":"10156057897300725","commenter_b":"Who would vote for this guy?! Mexicans are the main ones who supplies you with your food and groceries! They built all the buildings you take advantage of today!","commenter_a":"They aren't crashing. Get real. And what the hell do you think you could do about it, huh?? Kick Walmart out of America? They put China on the map today. Good business people. Anything for a buck.","post_message":"Markets are crashing - all caused by poor planning and allowing China and Asia to dictate the agenda. This could get very messy! Vote Trump."},{"comment_id":"1085736288142060","commenter_b":"Crazy woman!","commenter_a":"So sick of these lifer politicians & their lies.","post_message":"Nancy Pelosi's pointing fingers (again)...."},{"comment_id":"10150909460504999","commenter_b":"Why won't they announce the legal charge? What a messed up legal system","commenter_a":"What r they charging her with?!","post_message":"Richard Ratcliffe's wife and daughter are being held by the government of Iran. He's in New York during the United Nations General Assembly in an attempt to confront the president of Iran. He shares his story here and answers your questions."},{"comment_id":"1191127007601184","commenter_b":"Sometimes it takes longer for the other egg. They don't always lay both at the same time. And if was a bad egg she would get rid of it.","commenter_a":"It's crop never seems to look full?","post_message":"AFTERNOON #HATCHWATCH2017: Anytime now, the second eaglet is expected to hatch. A New Year's Day birth, perhaps? Video courtesy of Dick Pritchett Real Estate @webpagelink"},{"comment_id":"10156208561685354","commenter_b":"So is this a rally call to hate blacks or something? I mean, if SHE said it, then EVERYBODY in the black race must feel the same way, right? You extremists only care about the opinions of other extremists. Fuck a race war, fuck a holy war, fuck an unnecessary war.","commenter_a":"There is the face of a true racist.....","post_message":"“Right now we declare, it’s open season on a motherf–king cracker. All you motherf–king crackers y’all need to watch your motherf–king heads.”"},{"comment_id":"10153189105981336","commenter_b":"The pansies out there today would be a total embarrassment to this country. They would all turn tail and run. No backbone, no moral compass, no strength and no sense of reality. I blame the coddling society and the progressive liberal media.","commenter_a":"start the draft back up ...let these boys do a few years in the service","post_message":"Frat boys from the University of Florida and Emory University have been accused of urinating on an American flag, spitting on a vet and a service dog, and making derogatory comments toward veterans’ wives.  And that was just the beginning…"},{"comment_id":"10154913059491350","commenter_b":"Shawna Cargill","commenter_a":"Nick Shanahan","post_message":"CHICKEN. TOT. PIE."}]
