[{"comment_id":"10153420455089087","commenter_b":"Oh Brett. That's terrible. I am the wife Brett. I live in Texas, 10 generations next door to Mexico. Are there bad people there coming here? yes! Do we need immigration laws? yes! Will a wall stop it. No Brett. It wont matter how beautiful the wall is or how much it cost or who pays for it. Those drugs you smoke are going to make it here. Nothing you can do about it. The cartel will get immigrants and dope here. If anything there will be more killing and keeping that wall up is going to be draining on the economy. It's impossible.","commenter_a":"Trump's ability to showboat and boast out loud has a hypnotic impact on people who should know better. Please don't buy into Trumpmania.... he is all talk and I thought we were tired of that. You people have short memories. He was a full on liberal democrat just a few short years ago. Trump is telling you what you want to hear. He has no intentions of fulfilling these vocal obligations. It's all lip service and he will cater to his businesses before the people. Just because Bush isn't a loud mouth narcissist doesn't mean he can't get the job done. Trust me, you will never be so sick of anything as you will be of The Donald and his ego driven power play.","post_message":"“Donald I’ll take you on one-on-one in a debate, any time, any place,” Jeb Bush declared. “You name it and I’ll do it.”"},{"comment_id":"10152731282606051","commenter_b":"She is one sick bitch.","commenter_a":"She takes care of a disaled child and sick husband , I would worry aout what she would do to them as well. The punishment is far to lienient.","post_message":"This lady arranged to have a woman raped after she outbid her for a home. Some say her punishment should’ve been more severe. Decide for yourselves if that’s true."},{"comment_id":"1382362188508980","commenter_b":"You ass dont belong on a road unless it has wheels on it who raised these nuts?","commenter_a":"Yes","post_message":"Liberal protesters are furious after a new bill introduced by a state lawmaker... here's why this could cause a lot more \"accidents\" when these lefties block highways.  Do you support this bill?"},{"comment_id":"475937869263460","commenter_b":"what drug is she on these days? Think she's lost it in her old age....","commenter_a":"yes christian should pray all the time","post_message":"Parton delivers strong message to christians everywhere.  This is out of line, we need to show her that this type of public disrespect is unacceptable.   Do you agree that christians should be able to pray in public?"},{"comment_id":"10153911608872577","commenter_b":"The definition of terrorist declares them terrorists.","commenter_a":"No, a Heavily armed group of people using fear and power to push their beliefs on a government is what makes them Domestic Terrorists.....","post_message":"Non-violent occupation now considered domestic terror. #CNN #Bundy #Oregon @webpagelink"},{"comment_id":"10152808578696130","commenter_b":"Sadly, I could post these articles about pitbulls all day long and never be finished","commenter_a":"The purebreds are a very dangerous breed. Statistics do not lie.","post_message":"\"This bill would make Mississippi the only state in the nation with a statewide policy discriminating against a specific dog breed, and the impact on local communities, animal shelters, and law enforcement would be disastrous.\""},{"comment_id":"10154725067651341","commenter_b":"Now I wonder which side is truly the terrorist nation","commenter_a":"\"Netanyahu Warned New Zealand It Was Declaring War\" - what, by adhering to international law which was administered to PREVENT war?? Repeatedly violating resolutions and stealing land on some warped justification of ancestors IS a declaration of war!!! Thanks Israel for finally showing your true colours to those who remained unsuspected and blind to your callous actions.","post_message":"EXCLUSIVE: New details on Israel's last-ditch scramble to stop the UN settlements vote"}]
