[{"comment_id":"10153528204119497","commenter_b":"Ha!","commenter_a":"I see the girl inviting us to like her page is already here.","post_message":"\"I could make somebody happy, I am loving, and I deserve to be happy, too.\""},{"comment_id":"10152719503449117","commenter_b":"Don't these pigs have any REAL criminals to hunt down???","commenter_a":"Boy that's a basket of snarls","post_message":"Why the sex lives of teens should be subject to school discipline is suspect enough, but it's extra perplexing what interest the government has in such matters."},{"comment_id":"10153440207470950","commenter_b":"The stats show that you're more likely to shoot a family member than anyone else. Guns don't kill people, but people with guns can and do kill more people than those without. Who would have been at fault if the kids shot out the car window and killed someone? The kid, or her for failing to secure a murderous weapon? What if after after being almost killed by her son, she veered into on-coming traffic and kills another driver? Who is at fault then? Not only do I not understand the pro-gun and pro-kill people, I don't believe their justification for wanting to kill.","commenter_a":"Dumb ass","post_message":"The mom, a pro-gun activist who runs the page Jamie Gilt for Gun Sense, told deputies her 4-year-old son shot her in the back with a .45-caliber handgun that was on the floor of her pickup truck."},{"comment_id":"10153669770570950","commenter_b":"My thought exactly. If you see the pictures and videos, there are lounge chairs and tables just feet away from the water. People can read the \"no swimming\" sign, but an alligator is not going to think twice about coming on land. I think Disney needs to close off areas where there are gators. I lived in Tampa for four years, and gators were everywhere near water. You just knew where they were, and if you didn't, there were signs. I doubt people did not know about the alligators; you can always spot them especially if there are more than three. This could have been prevented.","commenter_a":"Why were alligators allowed to be so close to where human activity is? Especially DISNEY WORLD where 1000's of children are on a daily basis??","post_message":"Officials are pulling alligators from the nearby lagoon and putting them down to check for the boy's body; so far, they haven't found him."},{"comment_id":"10153145419396323","commenter_b":"Fucktards","commenter_a":"Romantic assholes","post_message":"Colossally stupid."},{"comment_id":"1603960996557680","commenter_b":"Deport her","commenter_a":"Racist pig!","post_message":"Ridiculous...  Take Oprah Winfrey off TV right now."},{"comment_id":"1084003008332003","commenter_b":"#VOTETRUMP AND BUILD THAT WALL!!!!","commenter_a":"Melania will have the last laugh. She is smarter and prettier than this idiot, not to mention more accomplished and wealthier.","post_message":"Unreal..."}]
