[{"comment_id":"946243322102083","commenter_b":"Vote UKIP","commenter_a":"And who listyens to this moron?","post_message":"Russell Brand who called voting 'a massive waste of time' no U-turns and says: 'Vote Labour'"},{"comment_id":"10155083896191178","commenter_b":"He might bring racist charges up against you","commenter_a":"OK I'm going to say it Everyone is racist OK we get it wahh wahh wahh!","post_message":"The histrionic grumblings for the liberal parodies over at MSNBC are STILL outraged over Sen. Sessions.  Liberals never seem to realize that they've worn out the racism accusation."},{"comment_id":"10153337726654726","commenter_b":"IF she had ANY self respect, she would NOT be making a fool of herself and making up LIES for obaloser and the rest of the liars!!!","commenter_a":"It disappeared. Hmmm...","post_message":"WATCH: State Department spokeswoman is laughed at while trying to give Obama credit!"},{"comment_id":"943824045713848","commenter_b":"It´s not a coincidence why Jeb Bush started his campaign in Miami...All his Cuban friends were drug dealers as Leonardo Martínez; money launderers as Armando Codina; Medicare swindlers as Jose Miguel Recarey; dangerous terrorists as Luis Posada Carriles and Orlando Bosch....... and every Cuban corrupt politician of Miami. When Jeb Bush signed the law forbidding to give the Driver License to illegal people in 2005 (he was the first governor to do it), he wanted to push the deportation of millions of illegal NON Cubans from Florida, who could not continue driving and give their jobs to millions of Cubans rafters newcomers. Bush never thought in unemployed veterans or other US citizens. He only has Cubans in his agenda.","commenter_a":"He will lead this country to a war in the sand...and your children will be buried there.....","post_message":"How a group of hecklers forced Jeb Bush to go off script and talk about immigration."},{"comment_id":"1376440642415680","commenter_b":"Women today have lost their values and morals.","commenter_a":"Ugly","post_message":"Dare to bare!"},{"comment_id":"541947015995878","commenter_b":"Impeach this peace of crap in the WH !","commenter_a":"boo the windbag muslim !","post_message":"Americans are furious after Obama hammers christians on TV.  What disrespect. He's gone too far with this.   Do you think Obama is out of line?"},{"comment_id":"10153536003698967","commenter_b":"God... I would love to work here JUST so that I can belittle upper management when they fire my ass for pulling an \"Office Space\"... Also... I can see a documentary in their near future.. Similar to the one about Walmart... ... Can't wait!!!","commenter_a":"I hate to hear that they run Amazon like a Randian dystopia. I use them for so much stuff now. What a shame.","post_message":"Amazon's corporate culture is terrifying."}]
