[{"comment_id":"10153115741995950","commenter_b":"That is BULLSHIT there terrorist right now in AZ 1out of 4 children are starving obama cant feed and house. Ours so what the hell he is gonna feed and house them. You hate the US you love terrorist get the hell out of here","commenter_a":"Good!","post_message":"NEW: The U.S. is preparing to accept at least 10,000 Syrian refugees in the next fiscal year, which begins in October."},{"comment_id":"10152623544456680","commenter_b":"Yes, I want our economy ran into the ground by having a college drop-out as our president. Said no one. Ever.","commenter_a":"I would rather see him run than Walker! I'm scared of Walker. After what he's done in WI, our economy would be in shambles after one year under him. @webpagelink","post_message":"Jeb Bush isn’t playing well among Republicans, Peggy Noonan writes in a new Wall Street Journal op-ed."},{"comment_id":"1069254933097554","commenter_b":"So who fixed the boat?","commenter_a":"I don't like this picture","post_message":"That's a heck of a thing to say!  Especially with servicemen captured."},{"comment_id":"10155048729377235","commenter_b":"I cannot and will not even listen to this lying disgusting woman! I cannot watch her on TV for even three seconds, she makes me wanna puke!","commenter_a":"Oh shut up!","post_message":"The Trump administration just doubled-down on their attack on one of America's biggest allies."},{"comment_id":"10153358341224726","commenter_b":"She need to get out of there","commenter_a":"the mayor of Baltimore is what you have a news conference but she cant handle a news reporter how did she get the job ,WE ALL KNOW ????????????dumb. .","post_message":"WATCH: Baltimore Mayor Snaps At Fox News Reporter for Asking Questions"},{"comment_id":"896505850386756","commenter_b":"Hillary is evil. The only people vote for her is either they think she is \"Good\" and/or \"Qualifies for President\" or simply the fact that she is a woman.","commenter_a":"Be carful her crew is monitoring this","post_message":"\"I have to ask, though, if you want cops to turn over camera footage of every single moment of their shifts, why did you turn over only some of your e-mails from your time as secretary of state?   What is the difference?\""},{"comment_id":"10154226374872894","commenter_b":"Kim better stop bcuz money can dry up. At the rate that she is spending it.","commenter_a":"...but Andy Cohen has had work done himself so what's his point??? *sips Brandy and Eggnog*","post_message":"Andy Cohen Grills Kim Zolciak About Plastic Surgery: Sweetie, You Need to Stop (Video)"}]
