[{"comment_id":"1202403033149557","commenter_b":"Greg is right and you Libtards are in denial.","commenter_a":"To understand what Hillary and her leadership will do to America. all you have to do is look at our Democrat run cities. Poverty, Crime, Drugs and Hatred. Syrian Refugees and Open Boarders will only add fuel to the fire! Democrats do not want prosperity for everyone, they want to keep the poor dependent so they can perpetuate their cause of corruption and lies. It is a fact. An obvious fact. Only selfish, bleeding heart liberals could be so ignorant as to the facts and the reality of the situation. It is a joke. @webpagelink","post_message":"The women of the U.S. Senate are fighting to make their firsts the first of many."},{"comment_id":"10153439531452235","commenter_b":"Bitch is bucking for re-election.","commenter_a":"As Governor, I would think she had the power to do so on her orders.","post_message":"WHOA!"},{"comment_id":"10153404952670399","commenter_b":"Women see him and spontaneously abort.","commenter_a":"Cherry picking keeps religion alive.","post_message":"Way, way too much information."},{"comment_id":"753368658095076","commenter_b":"Some people should not be allowed to breed, let alone having these many kids. Birth control should have avoided all these tragedies. Imagine the mental damage done to the remaining children.","commenter_a":"\"F\" er...period.IF...this is true...","post_message":"She confronted the father of one of her kids in court."},{"comment_id":"853540474702649","commenter_b":"By the way I don't agree with this either. But just think if people do not hire illegals they couldn't survive here. That is the root problem maybe we should start there.","commenter_a":"States did this not Obama. Do you blame him for everything? If the Cardinals don't win the World Series I'm asking congress to impeached him because it would have to be his fault","post_message":"10 states now offer driver's licenses to illegal aliens. Don't you think this is WRONG?"},{"comment_id":"10156091694535725","commenter_b":"when was i a women? rockstar","commenter_a":"Mr @username has taken to personal invective again, this time mocking the appearance of the only woman in the Republican field, Carly Fiorina. This from a man who wears a tribble on his head","post_message":"I will be speaking at the #StopIranDeal rally shortly- watch live here-"},{"comment_id":"10152784811780927","commenter_b":"Why give a s**t? You act like he is relevant!","commenter_a":"Why do we care what he thinks?","post_message":"Another rock star goes on the attack against conservatives."}]
