[{"comment_id":"10153549714052014","commenter_b":"She should've closed her legs.","commenter_a":"Unfortunately this POS will get an attorney who will say she is mentally ill, then she will go to some mental hospital. She will be there few years and they will say she is better, she will be back having more babies. I don't care what the reason, crazy, postpartum, bad day, whatever she deserves jail for the rest of her life!! She should have just whacked herself, sorry I have absolutely no pity for her.","post_message":"HORRIFIC UPDATE: Police are now saying the mother who killed her 3 children also partially dismembered them. Two of the kids were placed in closet & the 2-month-old baby was 'stuffed into a case.'"},{"comment_id":"511120385679668","commenter_b":"Our government pushes meth, heroin and every other drug, but its OK because they say it is?","commenter_a":"Let's not forget that a large portion of the prison population in the U.S. has been incarcerated because of nonviolent drug charges.","post_message":"Listen here: @webpagelink"},{"comment_id":"10153395061888690","commenter_b":"Saudi is bad for woman, Iran is worst. Pakistan is the best Muslim country for Muslim woman.","commenter_a":"Iranian cancerous mullah regime needs to be removed surgically.they are biggest violators of human rights.","post_message":"Prominent Iranian activist 'forcibly arrested' by security forces in Tehran @webpagelink"},{"comment_id":"923666907700065","commenter_b":"That hoe better learned how to fight cuz we gon square up lmao","commenter_a":"'@username if I ever find out my daughter sucking dick idgaf she can get it . lmao go to her school and embarrass her. lmao","post_message":"Mom Beats Her Daughter In Broad Daylight For Sucking D!"},{"comment_id":"10156715676250725","commenter_b":"Reilly Steidle they're calling for you","commenter_a":"Lauren Lynn","post_message":"MTV is on the search for the next reality stars of the “Real World,” and fans living in the Chicago area have a chance to be a part of the show this weekend. How to apply ----->   @webpagelink"},{"comment_id":"10153750563214497","commenter_b":"Liar. You're not a prostitute.","commenter_a":"As an African American prostitute I find this offensive.","post_message":"For more world-renowned reportage, visit theonion.com."},{"comment_id":"910749262351462","commenter_b":"SHE IS A BITCH.","commenter_a":"I'm going to have to block this site, even though I agree with it, almost all the time. This is stooping to the level of the opposition, mudslinging and negativity. Pretty ugly.","post_message":"Trump has won the hearts and 'minds' of Tea Party Republicans, and he isn't afraid to take on the GOP establishment and party elite."}]
