[{"comment_id":"10153199582481336","commenter_b":"IF YOUR BLACK YOU ARE FOR OBAMA AND NOT FOR OUR LAWS!!!! INVESTIGATE HILLARY CLINTON AND BENGHAZI AND ALL HER PAY OFFS AS SECRETARY OF STATE!! THIS WOMEN SHOULD BE IN JAIL AND YOU KNOW IT!!!!!!!","commenter_a":"Is she qualified? Or is it a race thing.... As the usual poop that osamabama does???? Really America, when will you take back your country? When he's given everything to the enemy, the one he won't name????","post_message":"“We can restore trust and faith, both in our laws and in those of us who enforce them.” Moments ago, Loretta Lynch was sworn in as the 83rd U.S. attorney general – the first African American woman to assume the position. @webpagelink"},{"comment_id":"10153767520167994","commenter_b":"Alicia Anne , try Jennie Craig","commenter_a":"I no longer have any remorse for anyone in an accident. I see drivers acting like morons every morning and every night...until they start acting like humans, people will continue to die. Michigan drivers are all a bunch of morons.","post_message":"The Davison Freeway westbound remains closed as investigators comb the scene where a man was killed in a crash."},{"comment_id":"10155026863931509","commenter_b":"she doesnt look that bad for a transgender","commenter_a":"What a beautiful woman our first lady is.","post_message":"First families join hands for a rendition of \"The Battle Hymn of the Republic\" during memorial for slain Dallas officers. @webpagelink"},{"comment_id":"1612302922163164","commenter_b":"No idiots!!!","commenter_a":"No. Sickening. Stop enabling these nuts.","post_message":"Should Germany allow child brides out of respect for Muslim culture?"},{"comment_id":"10153417319160927","commenter_b":"....using plus size models to sell plus size products, what a amazing concept!","commenter_a":"Game over? Looks like the fat lady is singing.","post_message":"Did Facebook fat-shame?"},{"comment_id":"1818799778404105","commenter_b":"It is time for a woman president peeps..........this is not the woman.","commenter_a":"She may have one the debate, but America lost in this Presidential election","post_message":"Join Hillary live in North Carolina for her first rally since winning last night's debate → IWillVote.com"},{"comment_id":"10154427870651491","commenter_b":"She was deported because she is a felon!!","commenter_a":"Now if only the Native Americans could some how deport the illegal descendants who settled in America and forcibly stole their tribal lands in violation of Native American law, because that would be poetic justice.","post_message":"She inspired protests in Phoenix, Arizona when she was detained on Wednesday."}]
