[{"comment_id":"10154248071539714","commenter_b":"@username seriously what does being white have to do with anything.","commenter_a":"Isn't that discrimination? I mean I don't care. It could be a good thing. But with all the political pc going around. This is discrimination compared to what liberals say","post_message":"A former Uber driver and his wife are launching an alternative car service for female passengers only. (via Good Morning America)"},{"comment_id":"595790673878859","commenter_b":"SHE NEEDED TO LEAVE!!!","commenter_a":"Ragheads go home .","post_message":"This Muslim woman walked into a salon and demanded all the men leave so she could remove her headscarf. It didn't take long for her to realize she had made a huge mistake and this hairdresser was not going to accommodate her entitled behavior."},{"comment_id":"10153036681682235","commenter_b":"You bitch I hope he shoots you right between your eyes.","commenter_a":"it is a sick movie about a truly sick man who was used by his government. Instead of treating his sickness they increased it and used it to kill.","post_message":"Fox News host gets off on killing."},{"comment_id":"10153211498337894","commenter_b":"Lmao","commenter_a":"If that baby head is as wide as hers… Chrissy… You in danger gurl! LOL","post_message":"John Legend and Chrissy Teigen Are Having a Baby! [Photo]"},{"comment_id":"423132557811339","commenter_b":"Al Sharpton is a racist !","commenter_a":"Afraid this will spread as it has in the past.","post_message":"Could this violence against police spread around the country?"},{"comment_id":"1243601928984608","commenter_b":"Speak for yourself, Bertha. Don't pretend you speak for the majority of women because you sure as hell don't!","commenter_a":"Don't have the right to impose their beliefs on others.. huh? Well, then the religious right should stop right there...","post_message":"Ted Cruz’s tour de transphobia has embraced a new extreme position."},{"comment_id":"1196095087116904","commenter_b":"This women is craving Attention poor thing","commenter_a":"And they call this art !!!! How ??? Not on !!!","post_message":"She's doing what?"}]
