[{"comment_id":"458683577589570","commenter_b":"Negotiations are not PC, you get what you can out of your adversary ! GO AMERICA, to hell with \"global niceties !","commenter_a":"The author is racist against Asians. Trump is not","post_message":"Donald Trump shows that he's not afraid of anyone, especially people from other countries that he does business with every day."},{"comment_id":"1687479528205826","commenter_b":"You can come to America if you do it legally if you want to go over the wall if there was a wall yes shoot to kill. That will be a deterrent to stop other illegals from trying to do it.","commenter_a":"Yes and shoot to kill anyone crossing from Mexico to the USA","post_message":"Yes, I do!"},{"comment_id":"10153683071398984","commenter_b":"Get the hell out bitch!","commenter_a":"Pork sandwiches for everyone.","post_message":"This Muslim tried to shame a grocery clerk into taking off her American flag pin... but instead, something amazing happened. This story is going viral across the nation..."},{"comment_id":"1189126694470722","commenter_b":"With all the beutiful woman in NYC you get a mop","commenter_a":"She only cares about money she will never have true love' She must work for the IRS or the Goverment","post_message":"When it comes to love, Martina Paillant won’t settle for someone who has a credit score below 700."},{"comment_id":"564263730449143","commenter_b":"She prolly snuck it in in her lady part","commenter_a":"Pam murdered Russ Farias wife Betsy and framed Russ","post_message":"Pam Hupp charged with murder - O'Fallon, Missouri Police and St. Charles County Prosecuting Attorney's Office hold a press conference on charges related to last week's shooting. Hupp has been charged with 1st degree murder in the shooting death of Louis Gumpenberger. She was arrested Tuesday. She was a central figure in a highly publicized murder trial covered extensively by Fox 2 News."},{"comment_id":"10152805783329342","commenter_b":"Kristine Bak","commenter_a":"It's been ALWAYS happening ....everywhere","post_message":"WARNING FOR PET OWNERS: There's a growing trend called dog flipping; someone takes your dog and then tries to sell it, and it is happening right here in Houston. FULL STORY ---> @webpagelink"},{"comment_id":"944173558951399","commenter_b":"Every thing that man spoke is true. Leave lady","commenter_a":"Muslim people you live in the United States . Take that f--king towel off your face . Your weak minded people . With no chance to Evolve , your stupid religion holds you back . Just get out of are country . So we can bomb you and get rid of you ! .","post_message":"A Muslim woman confronted a female cashier about her flag pin... What happened next is going VIRAL!"}]
