[{"comment_id":"1199808656730781","commenter_b":"I will say that being raised by two parents, not necessarily a man and a woman, can be a good support system for a child though. Single parents aren't worse by any means, but it is tougher out there for single parents, that's for sure.","commenter_a":"2 perverts","post_message":"Classic Jeb! (Hat tip to Bipartisan Report)"},{"comment_id":"10153283660836770","commenter_b":"This woman is an utter moron! There's more people watching the GOP debate tonight than all the democratic debates!","commenter_a":"Freud would be laughing at DWS totally projecting on the GOP.....exactly what she has been doing .....burying dem debates on Saturday nights!","post_message":"Democratic National Committee (DNC) Chairwoman Debbie Wasserman Schultz tweeted Saturday night suggesting the Republican Party was “trying to hide” a debate by scheduling it on the same weekend as the Super Bowl."},{"comment_id":"10153396181678908","commenter_b":"Good morning through Facebbok","commenter_a":"Beth Bethy Lockwood","post_message":" are confirming the health benefits of meat-free eating. Nowadays, plant-based eating is recognized as not only nutritionally sufficient but also as a way to reduce the risk for many chronic illnesses. Harvard Medical School"},{"comment_id":"10150578591129999","commenter_b":"she has class","commenter_a":"Sexy","post_message":"Jennifer Lawrence in Dior couture at the Met Gala. See more photos: @webpagelink Credit: Josh Haner/ The New York Times"},{"comment_id":"1269332673102189","commenter_b":"Becky, RAISE YOUR HEAD UP OUT YOUR BOYFRIENDS LAP, CHILD!","commenter_a":"Sorry but safety of USA citizens comes before everyone else!! This is All on Obumfuck!","post_message":"The youngest Nobel Prize winner says it perfectly."},{"comment_id":"1680724472211527","commenter_b":"The falwells have been stealing and lying to americans for years. So it goes without saying thieves run together.","commenter_a":"Fallwell has lost his gourd.","post_message":"What a great honor- the Reverend Jerry Falwell Jr. of Liberty University, one of the most respected religious leaders in our nation, has just endorsed me!"},{"comment_id":"10153430194047042","commenter_b":"To answer your question politically I don't like Hilary and I don't believe I would care for her personally either.","commenter_a":"How did Americans become so Dumb? No matter what kind of Facts you show them they will still support this Fool of a President.There is a Health Care Crisis is Puerto Rico yet they love this Fool.Israel will soon be whipped off the map by Iran yet Jews Love this President.Not a single Latin family has been untouched by this Man and his Policies yet we are about to elect someone worst Hilary.The Mexicans don't understand that there being used like a mule to further a democratic Political agenda.The president could have made millions of illegals legal yet there left in limbo and now he is gonna lecture us on race relations when he is the most divisive of Presidents..","post_message":"\"RACISM, WE ARE NOT CURED OF IT\": President Barack Obama used the n-word to make a point about the reality of racism in America."}]
