[{"comment_id":"527181674109539","commenter_b":"Illegal immigration","commenter_a":"I wanna kick all of them out.. 100% every single one out. .","post_message":"A Pew Poll shows that 83% of the public believes the annual baseline level of legal immigration (1 million per year) should either be frozen or reduced."},{"comment_id":"345060612364120","commenter_b":"Can we trust her? What an absurd question! Of course not!!","commenter_a":"She still has no moral compass.","post_message":"Hillary Clinton's Record Begs the Question - Can We Trust Her?"},{"comment_id":"997230403648529","commenter_b":"Let the mf die","commenter_a":"NOT refugees","post_message":"What ungrateful, low life people. Should be a real asset to the country..."},{"comment_id":"10152996037727869","commenter_b":"Abortions are legal, fingerbanging little kids illegal. Change the law if you want to stop abortions and legalize kid screwing. Oh, but you have Christians like the Duggars fighting for you. Good luck with that. I'll pray that you elect pedophiles so you can pray away the sin and let the criminals walk around molesting new victims. Jesus forgives. but society should prosecute crimes. He admitted to committing CRIMES!","commenter_a":"you might wanna find out more about the Duggars before you endorsed supporting them today..this is why YOU WILL NOT BE PRESIDENT. america doesn't want a president who thinks sexual abuse of children is ok or normal.","post_message":"We’re headed into Memorial Day weekend.  That means more than just picnics and sales and the start of summer.  It’s a time to offer tribute, prayers and thanks to the heroic men and women of America’s military who for over two centuries have laid down their lives to protect our freedoms.    But we should also remember the many wounded warriors who survived the battles, but came home with deep and lasting scars.  They deserve the very best care we can give them.  Not only through the Veterans Administration, but through private aid groups, like K9s For Warriors.  It’s a non-profit group that provides service dogs to vets with PTSD, traumatic brain injuries and other disabilities, to help them return to civilian life with independence and dignity.  100 percent of individual donations go to the program.  And 95 percent of the service dogs they train are rescued from shelters.  So when you donate to them, you don’t just help a veteran, you save a dog, too. Talk about doubling your money!  To learn more, go online to K9sForWarriors.org."},{"comment_id":"1002745926520222","commenter_b":"HITLERY, MURDERS AMERICANS IN THE WOMB!!!!","commenter_a":"Stop Hate Dump Trump","post_message":"WATCH LIVE: Donald Trump speaks at his second campaign event, this time in Eau Claire, Wisconsin. Earlier in the day, he spoke to supporters in Valley Forge, Pennsylvania."},{"comment_id":"1743528099240171","commenter_b":"Why did he choose to only visit those living in North Baton Rouge?","commenter_a":"Our great president. A day late and a dollar short","post_message":"We're in Baton Rouge where President Obama is landing to tour the flood-ravaged city after facing criticism for not visiting sooner. (No audio) @webpagelink"},{"comment_id":"10154928634761320","commenter_b":"Classy","commenter_a":"drop dead.","post_message":"Happy Birthday to Secretary of State John Kerry.  He turns 73 today."}]
