[{"comment_id":"10154250068154749","commenter_b":"How does she get away with this rubbish?????","commenter_a":"Diane Abbot is a hypocrite of the first order, always trying to play the race card if the argument does not go her way. As for JC he's a dead man walking yes massive grass roots support but his own back benchers are actively plotting against him and most are preying for bad election results so they can stage a coup. He's lost big backers, even the labour red tops are Luke warm at best. And grass roots support doesn't transfer to the ordinary man and woman on the street who see him as a reactionary 70s throwback and apologist. Labour will either ditch it before the next general election or face annihilation and ditch him and her after.","post_message":""},{"comment_id":"1183171455046239","commenter_b":"Who is she to decide who the child should live with","commenter_a":"I just read another story that he had reversed his decision, probably due to pressure from above.","post_message":"SOUND OFF: Judge believes a child is better off with a heterosexual couple."},{"comment_id":"10155243196880354","commenter_b":"If the border is not closed these terrorists will continue to come into America!!!","commenter_a":"Save the taxpayer some money and just shoot them. Don't tell the world, just shoot them and be done.","post_message":"Meanwhile, as Obama was snapping selfies...."},{"comment_id":"949193028544815","commenter_b":"BLM is a terrorist organization, lets call it like it is.. Also the New Black Panthers are no better then blm..","commenter_a":"Good","post_message":"The Real Showdown with the BLM is about to Begin!. @webpagelink"},{"comment_id":"10153723682667144","commenter_b":"It makes perfect sense to the Grand Ol' Party. Women should just kept their legs shut. Duh.","commenter_a":"Geeze, who would have guessed that access to birth control would result in lower pregnancy rates.","post_message":"An all-time low!"},{"comment_id":"10157252417295354","commenter_b":"TRUMP...Build that wall!","commenter_a":"Ten accused, 3 convicted, 2 still not apprehended. One was going to use his \"Federal Education Aid\" money. Didn't see their citizenship status though. Planned to show ISIS how easily they can cross through our Southern Border. What say critics of a wall or temporary ban of refugees now?","post_message":"They're here."},{"comment_id":"10153491120417869","commenter_b":"How ironic, mike; YOU are the one that's \"done\". You know what I'm talking about. This was your swan song, buddy.","commenter_a":"All Presidents are natural born to eat the dirt and breathe the air within USA soil ONLY!!! President\\tDOB\\tPlace of Birth George Washington\\tFebruary 22, 1732\\tWestmoreland County, Virginia, British America John Adams\\tOctober 30, 1735\\tQuincy, Massachusetts, British America Thomas Jefferson\\tApril 13, 1743\\tShadwell, Colony of Virginia, British America James Madison\\tMarch 16, 1751\\tPort Conway, Virginia Colony, British America James Monroe\\tApril 28, 1758\\tMonroe Hall, Virginia, British America John Quincy Adams\\tJuly 11, 1767\\tBraintree, Province of Massachusetts Bay Andrew Jackson\\tMarch 15, 1767\\tWaxhaws border region between The Carolinas USA Martin Van Buren\\tDecember 5, 1782\\tKinderhook, New York United States William Henry Harrison\\tFebruary 9, 1773\\tCharles City, Virginia Colony, British America John Tyler\\tMarch 29, 1790\\tCharles City County, Virginia United States James K. Polk\\tNovember 2, 1795\\tPineville, North Carolina United States Zachary Taylor\\tNovember 24, 1784\\tBarboursville, Virginia United States Millard Fillmore\\tJanuary 7, 1800\\tSummerhill, New York United States Franklin Pierce\\tNovember 23, 1804\\tHillsborough, New Hampshire United States James Buchanan\\tApril 23, 1791\\tCove Gap, Pennsylvania United States Abraham Lincoln\\tFebruary ...","post_message":""}]
