[{"comment_id":"10154019054861509","commenter_b":"White Americans do not recognize anyone else","commenter_a":"American??? Wow, she is so ignorant. Many American citizens came here from other countries speaking another language. English, the American version, is what has been spoken here for many generations. However, we now have many citizens who speak Spanish, Russian, Mandarin, Vietnamese...We are a country of many. Let's stop the ignorance and the Palins of the world.","post_message":"Sarah Palin praised Jeb Bush on speaking Spanish, but said “let's speak American\" to unify the country: @webpagelink"},{"comment_id":"565467440308215","commenter_b":"And here ya go, they will bite the hands that feed them .. dumbass .","commenter_a":"What about our children who live on the streets and homeless families in America!!","post_message":"He was wrong! What happened next..."},{"comment_id":"10153689334397869","commenter_b":"Locked away in a prison? So that your tax dollars can feed him, cloth him and pay for the medicine when he is sick. There is already a fence up and they scale it. If you build a bigger wall then they will just dig tunnels.","commenter_a":"Governor, I've always respected you. I voted for you when you ran for president eight years ago, and I was proud to cast that vote. That said, wouldn't it be better to have him arrested and locked away where he can't do any more harm, regardless of what side of the border he's on? I'm concerned that having a \"deport the criminals\" stance fuels a xenophobic mentality that all illegal immigrants are dangerous criminals. Also, there's no way to ensure he stays deported for good, even with a wall. Lastly, it seems to imply that if he's a danger to society that we don't care about the lives of people outside of our borders. Aren't humans worthy of human dignity regardless of what side of the border they're on? Imprisonment seems like the best option. I'm genuinely curious, and would appreciate an honest, civil discussion.","post_message":"Prayers today for the family of North Texas firefighter Captain Peter Hacking, who was killed along with his four-year-old stepdaughter and 22-month-old son when a van veered into their lane and hit their car head-on. If the van driver recovers, he’ll be charged with criminally negligent homicide. Let’s hope that’s also enough to get him deported for good, since he’s an illegal immigrant who was already deported in 2008, but came right back across the border. Normally, I’d link to a news site for more, but I’d rather that you read it here. It’s the GoFundMe page set up to help Captain Hacking’s widow and his surviving son and four step-children:"},{"comment_id":"1073234599424148","commenter_b":"BESIDES ALL OF LIES, CORRUPTION, ALL FAILED FOREIGN POLICYS, LYING TO AMERICAN PEOPLE, ILLEGAL SERVER IN HER BASEMENT, PUTTING OUR SECURITY AT RISK. RIGGING THE DEMOCRATIC NOMINATION, DID ABSOLUTELY NOTHING AS SECRETARY OF STATE. TOOK MILLIONS OF DOLLARS FROM WALLSTREET. AND BIG BANKERS, TOOK MILLIONS FROM TERRORIST COUNTRIES. CORRUPT CLINTON FOUNDATION. BENGASI, I CAN GO ON AND ON.... WHY I WANT TRUMP... HE DOESNT HAVE TO DO THIS. HE WAS ON OPRA SHOW 25 YEARS AGO, GO GOOGLE IT. SHE ASJED HIM IF HE WOULD RUN, SAME RESPONSE NOW AS THAN. ... 1-I WANT ILLEGALS TO NOT COME INTO OUR COUNTRY, SO A WALL. 2-I DON'T WANT SYRIAN REFUGEES COMING INTO OUR COUNTRY, THEY NEED TO BE EXTREMELY VETTED. WE CAN HELP THEM IN THERE OWN COUNTRY. ( FOOD, BEDDING, DIAPERS, GUARDED. 3-NO ABORTION. HILLARY WILL ALLOW UP TO 6 MONTHS PREGNANT 4-TO CALL TERRORISM WHAT IT IS... AND ACTUALLY ...","commenter_a":"Not even bill","post_message":"Breaking News: Obama using terrorist and Black lives matter to incite riots so he can declare Martial Law and suspend elections. Will you survive? Watch Video: @webpagelink"},{"comment_id":"10154073966458837","commenter_b":"Getting pregnant for most chicks doesn't cost anything ! Save a few bucks and don't buy a condom .......","commenter_a":"Omg! I'm really trying to understand her thought process at that time, but really can't! Some people have no brains and should never reproduce! There are so many women out here that are dying to be able to birth a child and you have pos ppl like this. Smfh!!!","post_message":"SHOPPING MOM ARRESTED - A Florida mom was arrested after leaving her 4-month-baby in an unlocked car while she went holiday shopping."},{"comment_id":"1629069924061974","commenter_b":"She's beyond dumb she is STUPID","commenter_a":"You people keep forgetting shes not the stupied one, its the people who voted her back in","post_message":"WOW! Huckabee Asks Nancy Pelosi If She’s \"Racist” Or \"Just Dumb” Over Dr. Ben Carson Comments"},{"comment_id":"465830173607563","commenter_b":"Bossy bitch!","commenter_a":"Just ban Michelle.","post_message":"Should We Ban This Word To Please Michelle? Comment 'yes' or 'no'."}]
