[{"comment_id":"10152789526371130","commenter_b":"I think her father is a proud lesbian.","commenter_a":"well this little girl is just over the top.. do you think her father is proud? I think not..","post_message":"\"I've been pegged with the word insensitivity. It's just how I've been sensitized and the tone I chose.\""},{"comment_id":"10155047061111336","commenter_b":"what a bunch of bullcrap everyonr can get s social security number legal or not","commenter_a":"Wow that hurt my brain to watch. He says illegal immigrants contributed billions of dollars in taxes and social security 😂😂😂😂 you cant do that if you dont have a social security number and if your here illegally you dont have one. So how exactly is illegal immigrants doing anything for our nation except burding all of our systems and taking jobs from american citizens.....","post_message":" do you have a Social Security card to be in this country? How do you have a Social Security number? ICYMI: \"Angel Mom\" Laura Wilkerson and undocumented immigrant Jose Antonio Vargas clashed over President Donald J. Trump's executive orders on illegal immigration. @webpagelink"},{"comment_id":"10153254451090671","commenter_b":"and that's why you women are pathetic ladies should not twist my words around","commenter_a":"most women are less productive as far as in the construction field is concerned but in the construction field I think they are paid the same I don't like working with women every time I do I have to work harder just to keep the same production schedule going","post_message":"Under the new law, an employer must show the “differences in wages are due to factors other than gender, that the factor is job related and reasonable and that these factors, rather than discrimination, account for the difference in pay.”"},{"comment_id":"728623440630942","commenter_b":"Adam , undocumented immigrants pay billions in taxes.","commenter_a":"The wall we take longer than 4 years to build. He won't get re-Elected and the wall won't be finished. Then us tax payers will be stuck paying for it.","post_message":"U.S. taxpayers will foot the bill for the wall, at least initially."},{"comment_id":"1061054770617718","commenter_b":"I'm voting for you Hillary!!!","commenter_a":"That will be hard to do from Leavenworth. But if she thinks she can go for it. Bill will be too busy I am afraid to help though.","post_message":"“It’s clear she knows how to get things accomplished in these crazy political times. She’s still standing after decades of Republican attacks, and she’ll force them to the table once in office.” -Iowa Starting Line"},{"comment_id":"10152746962915950","commenter_b":"We get your point. She is NOT a man. Therefore she must be a Woman. Congratulations to her.","commenter_a":"She's not a female pilot, she's a Marine Corp Aviator! Semper Fi!","post_message":"Meet the first female pilot in the Navy's Blue Angels' 69-year history, Marine Corps Capt. Katie Higgins: @webpagelink"},{"comment_id":"10152794611951636","commenter_b":"It is just that!.we women have no say....we just get on with it!.","commenter_a":"Really?? A marketing campaign for icecream?? You don't know half of what happens .","post_message":"We’re not supposed to break the silence and secrecy surrounding women’s bleeding bodies..."}]
