[{"comment_id":"10156156980300615","commenter_b":"You think most women are going to wear a gun strapped to their hip or chest so that it is visible? Are you serious?","commenter_a":"Open carry idiots should connect with this, since they are such dickheads.","post_message":"What's wrong with this picture? In Texas it will soon be legal to carry a gun on campus but not a red plastic penis."},{"comment_id":"10153169137025950","commenter_b":"Ella Patrice Nierva","commenter_a":"Ricardo Alvarez","post_message":"WATCH: Little girl can't wait another second to hug her soldier dad, runs to him in the middle of a ceremony @webpagelink"},{"comment_id":"10153275307228132","commenter_b":"You're a total dick!!!","commenter_a":"Junkie","post_message":"\"So funny, honest and loving. We lost a great one today.\""},{"comment_id":"10153385776126323","commenter_b":"\"Studied film and literature\"... Bahahaha bitch please...you are obviously no intellectual titan","commenter_a":"Though at least as far as the so-called \"New Atheists\" go Dawkins - along with Daniel Dennett - actually has substance to what he says and knows how to contextualise his arguments (some of the time). Christopher Hitchens sounded like an intellectual but acted like a thug. And Sam Harris is frankly one of the most pathetic and risible writers to garner an otherwise intelligent audience in this century so far. Ego the size of a planet - with a humourless sense of his own importance despite the impotence and unoriginality of his work - without even the charisma of Hitchens or the intellect of Dawkins/Dennett to back it up.","post_message":"“How dare you force your dopey unsubstantiated superstitions on innocent children too young to resist? How DARE you?”  Is Richard Dawkins a hero, a heathen, or a liability?"},{"comment_id":"10153916920276350","commenter_b":"The dumb lady who filed said her lips started drying after putting it on...so she put more on. Idiot.","commenter_a":"I used this, got a rash and it dried my lips out so bad that they cracked and bled. I had to get medication to heal my lips, but I STOPPED USING IT!!!!!! It's not rocket science. If it hurts you or doesn't work, don't use it. I wouldn't sue over it even though it was nasty looking and hurt like no other.","post_message":"Have you had any skin issues using eos lip balm?"},{"comment_id":"701341166639263","commenter_b":"Did porky hamas say something. Shame","commenter_a":"(Eo) amaso ne estas felia pro Amnesty International.","post_message":"Hamas is NOT happy with Amnesty International"},{"comment_id":"1198210753566421","commenter_b":"She's a hack","commenter_a":"This isn't right. What is wrong with her?","post_message":"CNN HOST To Jill Stein: \"Have You Seen Any Direct Evidence That Anyone Hacked The Voting Systems In MI, WI And PA?\"...\"Um...no\" [VIDEO]   And then there's that whole issue with one of the states that only uses paper ballots...."}]
