[{"comment_id":"10154474961664062","commenter_b":"And please don't be a coward and read my msg and don't reply...I wanna know your comeback and actually be real about it...","commenter_a":"I'm sure it was taken out of context by the biased media","post_message":"\"You've got to see this guy.\" He then ridiculed Kovaleski's appearance by bending his wrists and jerking his arms around."},{"comment_id":"10153790439861680","commenter_b":"This woman should shut up since she and her husband were just as corrupt as the current one!","commenter_a":"Mexico is a cesspool. There's nothing we need from them but they rely on everything from the USA. We've bailed them out so many times and the American Government is making taxpayers flip the bill for Mexico's $50 billion bailout. Build the wall, tax their imports and tax the $35 billion the illegals are sending through wire transfers a year. Punish companies leaving the USA and moving operations to Mexico and over seas!","post_message":"\"Mexicans have dignity and repudiate his hate speech,\" she writes."},{"comment_id":"906562849439968","commenter_b":"Can't wait for more racial division from this fraud. She's Holder with a dress on. Worst choice ever.","commenter_a":"Wonderful","post_message":"BREAKING"},{"comment_id":"1048428675208939","commenter_b":"@username What are you reading? How did the US government start this war? The Syrians and everyone else out in North Africa and the Middle East have access to the internet and make their own decisions. When people have access to information freely they act accordingly. People have free will to think and make decisions. No one forced the Syrians to fight or oust Assad. He cracked down on protests violently and this is the result.","commenter_a":"How can Assad sleep at night knowing he is responsible for the deaths of 300,000+ of his own people. It's disgusting","post_message":"What chance is there for peace in Syria? Join our Q&A"},{"comment_id":"10153753811221051","commenter_b":"So tell me, how does a colored woman have a bronzed beachy glow? They want whites only.","commenter_a":"Oh lame. So now every ad for everything (make-up, sports, clubs, restaurants...) has to have a picture of male and female, old and young, straight and gay and transgendered, and ever single culture/race, etc. on EVERY single ad so as not to exclude? STOP IT.","post_message":"It only took a few hours for this photo to spark outrage. Take a look and decide for yourself if it's worthy of the controversy."},{"comment_id":"1144750032228005","commenter_b":"Here we have someone taking things just a lil too seriously","commenter_a":"\"Discovered\" more like created...","post_message":"Pokemon are a diverse class of creatures that were first discovered by Japanese scientists Satoshi Tajiri and Ken Sugimori in 1996."},{"comment_id":"610785519070224","commenter_b":"Check that woman's mouth for raw....","commenter_a":"Keep in mind, these people are not working real jobs.","post_message":"Has anyone seen this Fox host's soul? It appears to be missing.   -Conover"}]
