[{"comment_id":"1232095813528626","commenter_b":"Deplorable bitch","commenter_a":"Corrupt politician","post_message":"I want to see what you all come up with... Describe Hillary in just two words... Ready, set, go!"},{"comment_id":"704293576413843","commenter_b":"Can't wait to be done with the racist goat humper","commenter_a":"Yay for Trump!!! Bye bye Obama!","post_message":"LIVE VOTE: With Trump taking office, are you grieving or cheering? Let us know why in the comments and see what others think. Join us for continuing coverage as President-elect Donald Trump prepares to take office, straight ahead on The Four!"},{"comment_id":"429016630556711","commenter_b":"Fuck off cunt slut ...","commenter_a":"Why is the cuffed woman running? If she woulda kept her cuffed ass where it needed to be she'd be fine","post_message":"This cop was too lazy to run after the woman so he tasered her causing her muscles to lock up. She fell, hit her head and later died from injuries. What do you think of this case?"},{"comment_id":"10153292448497235","commenter_b":"Dear, ditzy Megan does her best to serve her corporate owners and their agendas. Sorry, that leaves no room for accurate reporting.","commenter_a":"Never liked Kelley she lies all of the time. Looks so smug.","post_message":"\"Fair and Balanced,\" huh?"},{"comment_id":"10153735845537144","commenter_b":"The dog having a home is the goal isn't it? This woman didn't know the dog, she might not have liked it. The dog could have hated her. Yeah, the governor had an advantage and the guy's not my favorite. However, this whiny woman sems too needy and I'm not at all sure I would trust her to care for a pet.","commenter_a":"Another entitled old white guy. God how I despise his ilk.","post_message":"What. The. Hell."},{"comment_id":"10152860755326051","commenter_b":"way to go Arizona..mebbe the first shot of the Revolution...we MUST abide by the Constitution or it means NOTHING!!","commenter_a":"What does any one expect for any state to follow the president even when he not following the law of the lands that was put there for a reason... His theory is he have a pen n a phone so that gives him the right to over step the government that he has to go through because it's the Law! He hasn't done nothing for me nor my family, all he has done is given my taxes away freely while we struggle.. Nothing he has done has improve my family living not one bit... At the end of the day we don't need his helping hand at all it does us more harm then good for us... If anyone expect any state to follow the president then he needs to lead by example n follow the laws that was put there way before his time n stop acting like the ...","post_message":"This state just passed a bill allowing them to ignore anything President Obama asks them to do. And that’s not even the most controversial part of the bill."},{"comment_id":"855360527843909","commenter_b":"Really clueless woman","commenter_a":"Shes not relevant!","post_message":"How's this for abortion logic?"}]
