[{"comment_id":"1062292093806211","commenter_b":"DON'T NEED ANOTHER BILL CLINTON","commenter_a":"Lol! Trumps hands are not looking so small now. Hehehe","post_message":"Breaking News!"},{"comment_id":"1011935972208484","commenter_b":"No amnesty. We need to figure out exactly how many workers our farmers need and make it easy to give immigrants return visas once they have been vetted then give them 5 year vias, before needing to reapply.","commenter_a":"Democrats, you have one job this November: Don't give our country to the GOP! Elect a Democratic President and give them a Democratic Congress to work with! And complete the job by dumping the GOP from state and local government!","post_message":"'Nuff said. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1813669392186653","commenter_b":"I believe the only way to stop 5.O Is to kill em all Or stop bitch in, the popo gotta Gun n they Evil law,,Bt every nigga in the hood can shoot back,so kill em before they kill one u","commenter_a":"America you're gone so far.","post_message":""},{"comment_id":"10156899392785725","commenter_b":"Hope she gets jail time","commenter_a":"hillary who shed the blood of innocent American at Libyan embassy. Obama and clinton who created all conflicts possible in America ( income war, gender war, age war, war on women, Race wars) driving wedges among the people. Hillary clinton and bill clinton war on women explained by Roger Stone on youtube","post_message":"As President of the United States of America- I will see to it that the AWARENESS continues -- I will be in a position to immediately handle all of the issues at the VA --- nobody will look after our Veterans --- our heroes, like me. I guarantee that!"},{"comment_id":"10153305940576051","commenter_b":"If she is guilty, she should get the death penalty...","commenter_a":"\"Parents should be allowed to do whatever they want with their kids,\" we insist. \"It's THEIR children,\" we say. But what happens when the parents are sick and twisted? Huh? Don't kids have a right to be safe from their own parents?","post_message":"Even the grand jury was stunned that a mother could be so cruel to her own daughter."},{"comment_id":"1166947526658609","commenter_b":"I am a Democrat and I will not vote for this woman!","commenter_a":"the bride of frankenfood. no mercy.","post_message":"Is she in trouble?"},{"comment_id":"556763161150305","commenter_b":"Steven...do you suck your dad off with that mouth?","commenter_a":"Oh, that's soooo terrible... You think the several thousand people he had killed didn't fear for lives? The ones who were shot, beheaded by chainsaws, scalped & skinned alive, and who had limbs broken and cut off? Extradite Chapo, throw him in ADX Florence for the rest of his life, and admit this bimbo to a psych ward.","post_message":"Emma Coronel: \"I'll follow him wherever because I am in love with him.\""}]
