[{"comment_id":"1189126694470722","commenter_b":"With all the beutiful woman in NYC you get a mop","commenter_a":"She only cares about money she will never have true love' She must work for the IRS or the Goverment","post_message":"When it comes to love, Martina Paillant won’t settle for someone who has a credit score below 700."},{"comment_id":"10154587626459411","commenter_b":"holding a sign for 20 minutes ,","commenter_a":"Mishelle obama cares for them, #bring back our girls :D","post_message":"'No one cares for us'"},{"comment_id":"1171399196245487","commenter_b":"She's better than me!..step into my personal space uninvited and your eye will get dot!!!","commenter_a":"Where's the guy in the 8 ball jacket when you need him???","post_message":"A racist Trump supporter went ballistic on a black subway passenger in NYC. #MicBrights"},{"comment_id":"10153289431079726","commenter_b":"Sure, show me how the bad outweighs the good and maybe I believe it.","commenter_a":"Real think tank in here. Glad none of you are plotting my future. Real Christian like thoughts in here as well. Fact is you don't know what he does or doesn't watch. Fact is none of you are objective enough about yourself to see through your hatred. You'll call it something else to redirect but it's hate and negativity. It is for those reasons fox news and it core viewership are not to be believed or trusted to be fair and impartial lol","post_message":"WATCH: Krauthammer: Obama ‘Doesn’t Know A Damn Thing About What’s On Fox’"},{"comment_id":"1029144867143578","commenter_b":"@username maybe they should all go to Mexico instead .","commenter_a":"Trump. A habitual liar, narcissist, racist, fascist, five time draft dodger, four time bankruptcy filing, woman hating misogynist, bigoted bully. A man who only has money because he's a vaginal success. (Born into wealth.) A man who represents everything that's wrong with this country. Yet, people will vote for him. The very same individuals who stand to lose the most. Wake up. He only cares about himself.","post_message":"New Jersey Gov. Chris Christie offered up the latest twist of the Republican presidential primary when he endorsed Donald J. Trump on Friday."},{"comment_id":"1539781299650210","commenter_b":"Trump will CRUSH Hillary!!","commenter_a":"if you know Hillary will lose against Trump click like","post_message":"Wendy Long: Trump's 'America First' Platform Will Grow GOP Nationwide."},{"comment_id":"1663183500635910","commenter_b":"That sumbitch looks like death warmed over.","commenter_a":"Soros is a subversive ShitBag and should be brought up on charges.","post_message":"George Soros is a _____________."}]
