[{"comment_id":"10154743661575470","commenter_b":"@username (Psst. She means white.)","commenter_a":"Finally a decent president out with the trash in with the class","post_message":"INAUGURAL PARADE: Watch President Donald J. Trump take part in the ceremonial parade."},{"comment_id":"10154134010956323","commenter_b":"Be careful, please. Chose a president because she is woman is sexism. Here in Brazil we already had our first woman president, and this brought to us hope about a better country, but now she is under impeachment process due responsibility crimes made and allowed by her. This not means that women are worst than men, au contraire, I have been working with many managers, directors and executives women and found professionals better than men. Point is, be careful with WHO is the woman you are choosing.","commenter_a":"No.","post_message":"\"Following a decisive victory in New York and with her path to the presidency ever-more surefooted, the possibility of the first female president is sinking in. And whatever your feelings about Hillary Clinton as the vessel for this achievement, it’s an extraordinary one.\""},{"comment_id":"1183411145055216","commenter_b":"Wake up Hillary will destroy trump","commenter_a":"Trump is walking all over Hillary. Polls showing her ahead i do not believe.","post_message":"Dorothy Woods, whose husband Ty Woods was one of the four Americans killed in the 2012 Benghazi terror attack, says that Hillary Clinton's track record proves that the Democratic nominee believes rules don't apply to her. @webpagelink"},{"comment_id":"10153573726630950","commenter_b":"bitch shut your half dead looking ass up !!!","commenter_a":"I am watching on television and I am seeing a lot of Mexican Flags. This is absolutely unacceptable. Last time I looked, California is still a state in the United States of America. If you want to fly the Mexican Flag, go back to Mexico!","post_message":"WATCH: Protesters are gathering outside of a Donald J. Trump event, shouting chants and clashing with police @webpagelink"},{"comment_id":"1220652477966511","commenter_b":"LOCK HER UP! LOCK HER UP!","commenter_a":"Lock her up!!!!","post_message":"Live: Donald J. Trump delivers a speech at the VFW National Convention in Charlotte, North Carolina."},{"comment_id":"781508608584844","commenter_b":"Problem is giving amnesty to the ones here only perpetuates the problem. The next ones to jump the border will believe they will be given amnesty and so on and so on. Companies employing illegals need to be punished and no freebies, IE entitlements to non citizens.","commenter_a":"Do the house republicans have a plan to actually fix the problem? I know the tough talk is to \"just send them all back\" but those aren't plans. Sure wish yall had answers to problems instead of continuing this political theatre.","post_message":"Last night, a federal judge issued a preliminary injunction that effectively blocks President Obama's unilateral executive actions on immigration. The magnitude of the President's executive overreach on immigration cannot be ignored. The House passed legislation to stop the President's unlawful plan, but Senate Democrats will not even allow it to be debated. It is my sincere hope that Senate Democrats see this legal action as a wakeup call and let the House bill be considered in the Senate."},{"comment_id":"10153327649961943","commenter_b":"She should be in Prison As well as ALL the rest of that bunch!","commenter_a":"$170,000 is a really hefty pension for the shaft of Obammy's challengers by the crooks in he IRS . AND her boss is still there covering up the evidence !!!","post_message":"This material shows that the IRS cover-up began years ago. We now have smoking-gun proof that top officials in the Obama IRS unlawfully harassed taxpayers just to keep them from complaining to Congress about IRS targeting and abuse. Please SHARE!"}]
