[{"comment_id":"10155808489605968","commenter_b":"Exactly.","commenter_a":"Of course they knew.","post_message":"KEY POINT: \"The current and former officials said that although they believed that Pence was misled about the contents of Flynn’s communications with the Russian ambassador, they couldn’t rule out that Flynn was acting with the knowledge of others in the transition.\""},{"comment_id":"10153236305609342","commenter_b":"You have a brown child, she can easily be in the same boat!","commenter_a":"Hopefully her family can let her rest in peace and find a new cash cow to milk..","post_message":"JUST IN -- The 11-page report released Friday corroborates findings detailed a day earlier by Waller County officials. Warning: Some details are graphic."},{"comment_id":"722398331226681","commenter_b":"Miley Cyrus is so gross. She's going to be a washed up disgusting old lady if she makes it that far.","commenter_a":"Who would believe anything that raunchy ugly thing says anyway ?","post_message":"Class act, that Cyrus!"},{"comment_id":"10154686052869586","commenter_b":"Get this bear out of there now","commenter_a":"Holding animals in captivity is inhumane. Do not support zoos.","post_message":"Thousands of people visit daily to take selfies & knock on the glass :("},{"comment_id":"10154114920114726","commenter_b":"She is an assault magnet!!","commenter_a":"What do Leonardo DiCaprio Congressman Allen West, the NYPD and Students for liberty all have in common? They all had assault charges filed by Michelle Fields......who is Michelle Fields>? The Woman who is claiming she was assaulted by Mr Trump's Campaign manger. Check her background.","post_message":"Even liberal Susan Sarandon thinks Trump is better than Clinton."},{"comment_id":"800733213450589","commenter_b":"Islam was banned from the US in 1952, but Obama doesn't want you to know that nor does he respect or uphold the U.S. law. The immigration and Nationality Act passed June 27, 1952 revised the laws related to immigration and naturalization and nationality for the United States. The act, which became Public Law 414, established both the law and the intent of congress regarding the immigration of aliens to the U.S. and remain in effect today. Among the many issues it cover, one in particular found in Chapter 2 section 212, the prohibition of entry to the U.S. if the alien belongs to an organization seeking to overthrow the government of the United States by \"force, violence, or other unconstitutional means\" This, by it's very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House. Islamic immigration to the U.S. ...","commenter_a":"No! God gave them a place to make there home! we do not have the space!","post_message":"Dalai Lama Warns America And Europe About Muslim Refugees... Obama Shocked If this isn't a sign that we should close our borders than I don't know what is. Do you think we should let Muslim refugees into America?"},{"comment_id":"10154589090613132","commenter_b":"I thought the same thing...wow, she's just like every other woman!!","commenter_a":"I'm not gonna lie, I'm glad her mascara runs too hahaha!","post_message":"A pregnant Blake Lively and husband Ryan Reynolds were caught locking lips in Rhode Island over the weekend."}]
