[{"comment_id":"10154289283474149","commenter_b":"Why does she keep hitting he neck","commenter_a":"Push it out already lol.","post_message":"We're on #GiraffeWatch2017! When do you think the baby giraffe at Animal Adventure Park will make its debut? Read more: @webpagelink"},{"comment_id":"595052750663656","commenter_b":"So RACIST I used to really like her. Now o can't stand her..","commenter_a":"And we don't want to hear you talkm","post_message":"THE VIEW’S Whoopie Goldberg To Co-Host: “This Is Why Black People Don’t Wanna Talk To White People” [VIDEO]"},{"comment_id":"566112886870821","commenter_b":"another one to kiss that ring and feet","commenter_a":"if donald trump is a racist why to people of many different races show up to his rallies? why aren't they kicked out? He hasn't singled out any one particular ethnic group that he has singled out by saying he hates them.","post_message":"Welp, Donald Trump sure has that racist vote down pat. -Conover"},{"comment_id":"10153636723007507","commenter_b":"^This is feminism. Mmmmm smell the equality!","commenter_a":"You know what? Doctors have been ignoring women's pain as imaginary forever. Everything is not about race.","post_message":"The need to constantly reiterate black humanity—because that’s what this comes down to—is both fatiguing, and frankly, infuriating."},{"comment_id":"10154506752502619","commenter_b":"Call Sarah please let me leave you with this I am Hebrew my tribe is Nazarene but I am not Jewish a lot of people and I know that you're not one of them get that mixed up quite a bit for it is possible to be Hebrew and not to be Jewish","commenter_a":"There were no unions until the 19th century when a bunch of Jewish garment workers in NYC publicly protested and marched through the streets for safe,decent places to work and a living wage. How dare this bunch of ignorant,uneducated pigs discuss human rights. They couldn't find Israel on a map if their lives depended on it. Their hatred is based on jealousy of the achievements of Israel and the will to survive in a world where hatred of Jews is very fashionable.","post_message":"Citing the Jewish state's \"long history of violating the human rights of the Palestinians,\" the United Electrical, Radio and Machine Workers of America have reportedly become the first nationwide union to join the boycott against Israel."},{"comment_id":"10154466445410399","commenter_b":"@username Don't you have some wheelchairs to kick?","commenter_a":"The mom was an anti-Trump plant using her kid as a tool -- so it is another non-troversy for those fearful of the complete Clinton crushing coming tomorrow.","post_message":"“The crowd started chanting 'U-S-A' and pushing his wheelchair,” his mother said. “We were put out by security. Mr. Trump kept saying, 'Get them out.' \""},{"comment_id":"10154343689874094","commenter_b":"People know who she is. She will get whats coming to her","commenter_a":"Hopefully she'll get caught out on a camping trip and be torn apart slowly by wolves.","post_message":"Roadrunner the dog's injuries were so severe that a veterinarian had to remove his eyes."}]
