[{"comment_id":"10154261503546770","commenter_b":"Hollywood is full of whores!","commenter_a":"Omg. It's just a dress! Didn't your mothers teach you that if you don't have anything nice to say, don't say anything at all!!! Looks like you could all use a lesson in kindness!!","post_message":"Holy moly, Jennifer Aniston."},{"comment_id":"438573499666627","commenter_b":"'@username. She's an idiot","commenter_a":"Another liberal sheep just voting for a female!","post_message":"Lena Dunham isn’t worried about Michael Bloomberg."},{"comment_id":"1683593111700811","commenter_b":"That's why they have a little pill now called Plan B...take that the day after you're raped if you can't stand to carry the baby and put it up for adoption to a family who doesn't care how the child was conceived! Abortions, especially late term abortions are cruel and inhumane!","commenter_a":"It's planned parent hood they do a lot more then abortions. And @username women chose well some prolly forced so @username women got knocked up because they didn't practice safe sex. I thought women wanted the right to chose what they do with there bodies planned parent hood also helps with women's health who can't afford insurance or hospitals the government cut there funding right? So how can they help these people and if they closed right now you don't think @username people won't find someone else to do abortions. I promise if there not smart enough to use protection and pph closed you would see a lot of dumb young women ending up in ER with a coat hanger hanging out of them. Americans are such pussies anymore of it is not your baby or body and you don't know the person making there chose mind your fucking business","post_message":"Ugh why?!"},{"comment_id":"730431657058963","commenter_b":"Stupid ass talk to text I sent hats off to Mr Gilbert who donated 10.5 million to Toys for Tots you can say what you want about these new country singers but I like mr. Gilbert's music and a bunch of the other ones and if you don't like that you kiss my ass","commenter_a":"You can say what you want but these new country singers other not countries in a sucker most of butter how many people you know to get stoned.5 million for toys for tots hats off to mister yogurt hold a good man and a good singer and if you don't like it like that you kiss my ass","post_message":"“Whether a kid is into Barbie or Star Wars, I hope we’ve given a bit of fun and inspiration.”"},{"comment_id":"1027501837293064","commenter_b":"What a lying bitch , she tried to be the center if attention and it didn't work out for her. There is nobody left for her to blow, so she wants to quit. Awe.... poor little helpless girl who swallowed so much she is choking on it. Lol","commenter_a":"She brought it on herself","post_message":"Megyn Kelly has stunned her fans and Fox News with an announcement that changes everything.   She's put Fox in a VERY hard position and disappointed a lot of her fans."},{"comment_id":"10153562591278487","commenter_b":"It's disturbing that someone who presents as a cop on Facebook would be one of the few people to say 'this was a good shoot.' But #notallcops or #bluelivesmatter or some other inaccurate bullshit to keep people hero worshipping, right? Please.","commenter_a":"I hope you all understand that because the prosecutor went for a murder charge, this officer will be found not guilty. One, due to the fact that the prosecution will have to prove that an on duty officer was out there to kill someone, which won't happen. Two, for the fact that a vehicle is a deadly weapon and shooting a suspect using a vehicle in a manner that puts an officers life in danger is standard procedure and is taught in every academy in the U.S. This was a good shoot and the officer will be exonerated. But get ready to torch your local cvs for justice.","post_message":"is without question a murder, the prosecutor said about Sam Dubose's death.  didn do anything violent toward the officer. He wasn dragging him. And [the officer] pulled out his gun and shot him in the head."},{"comment_id":"1422900164405547","commenter_b":"My integrity will not allow such a travesty. She is a war monger.","commenter_a":"We can't , CANNOT, be punitive at this time in history and not vote for Clinton. I KNOW Bernie would have been a WAY better President, but I will hold my nose and vote for Clinton.","post_message":"I don't know if it's a world record but Donald Trump has been sued more than 3,500 times over the past 30 years. This isn't someone who should be president."}]
