[{"comment_id":"588380568016902","commenter_b":"NO, they just want to shove another \"change\" down our throats!!! I am so sick of this. We don't have the money to make such a change. If anything put her on something else but DO NOT MAKE CHANGES!!!!! Do you Dems think money grows on trees?? I am not paying for nor will I ever use a $20.00 again if this is done!!!","commenter_a":"So who made this decision?","post_message":"OH HAPPY DAY!"},{"comment_id":"905390669594112","commenter_b":"@username you must have a patheticly small one if it turns into an innie","commenter_a":"If you have an innie, use the women's. If you have an outie, use the men's. That's not difficult.","post_message":"BREAKING: The Supreme Court just ruled on their first transgender case..."},{"comment_id":"10153309975398128","commenter_b":"Rich girl with bad credit","commenter_a":"Let us all shed a tear for the rich girl...","post_message":"Even the daughter of the CEO of the largest U.S. mortgage lender found it hard to buy a home in one of the country’s hottest housing markets."},{"comment_id":"1708950036028896","commenter_b":"@username I have a problem with Mexicans coming back even after the wall is built. What they did to this country is almost irreparable damage, it's overwhelming, and the amount of people they killed is staggering. You NEVER read about an American killing a Mexican. But you do read the opposite. You can't take the illegal out of an illegal. They will always be a dark cloud of problems to any society they get it. They can't change, they're programmed that way. They will bring virus' disease and plunder. Even the ones running their country a derelicts of the 3rd kind, their intent is to make America part of Mexico, that's why they send them, that's why they don't assimilate and want YOU- (Americans to assimilate) ...(google \"The RECONQUISTA / Mexicans say they will take America without firing a single shot\")..this is why Vinente Fox and Jorge Ramos are trying ...","commenter_a":"The role of our government is to keep its citizens safe.....sadly they are failing \"A house with no walls will collapse\"","post_message":"“This is something that’s happening almost on a daily basis now, that we have illegal immigrant criminals that are committing murder or rape or numerous child predator type actions.” – Steve Ronnebeck"},{"comment_id":"10153402345983812","commenter_b":"Women are to careless & I don't try to twist anything!!!This is a 10 year old girl,not an Adult woman..In most cases ppl could prevent getting pregnant but they do NOT!!I do not even see how would be possible for this child to carry a baby to full term..I think if you are old enough to spread your legs you should be responsible enough for the outcome..Like I said this is a baby not an Adult!!Not going to argue the difference!!!","commenter_a":"I'm totally against abortion but in a case like this her being so young she does not need to carry that baby!!","post_message":"10-year-old girl who was allegedly raped and impregnated by her stepfather has been denied an abortion: @webpagelink"},{"comment_id":"10153215419029726","commenter_b":"She is a much bigger problem than wild Willy","commenter_a":"possibly the only reason she wants to be president is so that she avoids prison time.","post_message":"Are YOU Ready for Hillary? Which is her bigger problem... Benghazi, missing emails, Wall Street? @webpagelink"},{"comment_id":"10153786664991336","commenter_b":"You only needed 5 minutes, for her to spend 11 hours lying is a waste of time.","commenter_a":"We need closure and justice for them","post_message":"\"I'd like to believe that no matter what party you are, you want to put American life and safety first and foremost.\" – Gov. Mike Huckabee"}]
