[{"comment_id":"10153593433561323","commenter_b":"when people are in the process of migrating from one spot to another they are sometimes referred to as migrants.","commenter_a":"because it describes a particular group of people. Like descibing a group of people from Norway as Norwegian or whatever. jeez","post_message":"\"You will still see the word 'migrants' or 'migration' in the Guardian as a general expression to cover people who for whatever reason have moved, or are moving, from the country of which they are nationals to another. But 'refugees', 'displaced people' and 'asylum seekers', all of which have clear definitions, are more useful and accurate terms than a catch-all label like 'migrants', and we should use them wherever possible.\" - David Marsh, Guardian style guide editor."},{"comment_id":"10154230431661770","commenter_b":"Is that all they got going for them fake boobs, fake everything it looks like","commenter_a":"No one cares lol","post_message":"Kim Kardashian just wore the most ridiculous dress."},{"comment_id":"10153020088312235","commenter_b":"You just said 17 Americans died in 2011. We've been at war with Muslims for over 10 years. There is such thing as an enemy. Nothing racist but anybody who is stupid enough to follow a man made book and then kill on behalf of that fairytale should be executed. If I invite you into my home and you disrespect me and my family, I'm going to kick you out. Same thing with Islam. Western nations opened the door to HELP THEM, not to get FUCKED BY THEM, and people are starting to get sick of it. It's likely best if all that do not want to embrace the culture of their host country go back home where they can lop off heads all day long and molest children","commenter_a":"How stupid are you? Focusing on Americans piss ass shootings? Look at the big picture as you support Islamic terrorism and put it on a pedestal. Animals trying to get nukes and you are worried about a couple gun nuts. They are devouring Western Europe and you pick the flea off of the dog to focus on. That's why Liberalism is a mental deficiency - focusing on the flea on the dog instead of the dog.","post_message":""},{"comment_id":"10153307437349641","commenter_b":"Well a man Isis noob is better than a super trained nato soldier who does nothing as all NATO soldiers do - nothing","commenter_a":"i dont think isis fighters are more than trained noobs :v","post_message":"ISIS \"moron\" gives away HQ location on social media:"},{"comment_id":"368033556718272","commenter_b":"Sarah Got A Back Bone She Don't Back Down To That Evil Snake","commenter_a":"does she even know where Paris is?","post_message":"Good God, Mr. President, we were once known as the leader of the free world, standing for what is right! You must not let America’s sacrifices be in vain. When will you learn that actions speak louder than your words?”"},{"comment_id":"1459625230716396","commenter_b":"Send them home!","commenter_a":"Who's with me ?? BUILD the W. A. L. L.","post_message":"Deport them all, President Trump"},{"comment_id":"10153422129686636","commenter_b":"legal migrants not border jumping criminals","commenter_a":"Trump is a right wing extremist who perpetrates racial stereotypes about minorities to serve an agenda. Trump is an opportunistic bigot who has historically enjoyed good relations with Muslims but to become elected, he has jumped on the bandwagon of Islamaphobia. Attacking the Mexican community is also another opportunistic attempt to create hatred, division and anger. The most beautiful thing about America is its a nation of immigrants. A melting pot of many nationalities and a true leader would do everything in their power to unite all of us as opposed to dividing through religious and racial hatred.","post_message":"Well played, Canada"}]
