[{"comment_id":"1900645696822355","commenter_b":"Fucking pigs!","commenter_a":"2seconds in & I can't even watch.","post_message":"His screams for helping are truly disturbing.."},{"comment_id":"1582128638759914","commenter_b":"Normal people don't put bombs in dumpsters......terrorists do....","commenter_a":"Tell us again how this isn't an act of terror?","post_message":"Breaking News: FBI releases a 'Wanted' poster identifying 28-year-old Ahmad Khan Rahami, a suspect in the bomb blast in New York City Saturday night.   The FBI's wanted poster identifies Rahami as a naturalized U.S. citizen of Afghan descent. MORE DETAILS: @webpagelink"},{"comment_id":"597841083739804","commenter_b":"OBAMA IS THE SAME ALL ARE THE SAME CORRUPTS AND CRIMINALS WHAT HAPPEN IS PEOPLE WANT'S TO BE CORRUPTS AND HAVE POWER AND ABUSE OF POWER THAT IS WHY THEY LIKE THEM CONGRATULATION LOOK AT THE WORLD HOW IT LOOKS AND THINK A LITLE NOT TO MUCH AND SEE WHAT IS GOING ON","commenter_a":"Damn right!","post_message":"George W. Bush was right, there were weapons of mass destruction.  We always had his back. He is a great man, and a true patriot.  Do you support George W. Bush?"},{"comment_id":"1186921104703676","commenter_b":"Graciela Rojas","commenter_a":"Unfucking believeable!","post_message":"WATCH: Shocking police shooting of an unarmed black man attempting to help a suicidal man with autism, caught on camera; the man is now recovering: @webpagelink"},{"comment_id":"800175416791290","commenter_b":"shes disgusting!","commenter_a":"I don't know anyone personally that thinks Amy Schumer is funny . Her only following is a bunch of feminist that think her over the top vulgarity makes her equal to men but even most men aren't as perverted as her .she tries to hard and it just isn't funny or entertaining.","post_message":"'Of course, we're in Florida, you're going to boo.' - Amy Schumer after being booed for making jokes about Donald J. Trump"},{"comment_id":"1040857019285867","commenter_b":"Go back to Cuba shitstain.","commenter_a":"II Bill of Rights. A well-regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed........................ . MOLON LABE (Come And Take Them). Obama, you pussy, from my cold dead hand!. . 'A well-regulated militia being necessary to the security of a free state, the right of the people to keep and bear arms shall not be infringed.' 'I ask, sir, what is the militia? It is the whole people, except for a few public officials.' George Mason, in Debates in Virginia Convention on Ratification of the Constitution, Elliot, Vol. 3, June 16, 1788.. NOT ONE of the new obama regulations will prevent a terrorist or thug from securing a weapon and using it ... That is the issue.... This is just more political BS for resume enhancement..... Terrorist and thugs DO NOT buy their ...","post_message":"This is only the beginning folks..."},{"comment_id":"635245713332674","commenter_b":"Jail her!","commenter_a":"She is corrupt about time she need to come clean.","post_message":"The evidence in the Benghazi controversy just blew up in Hillary's face, it's over.  It's about time. Send her to jail already.  Do you agree Hillary should be arrested?"}]
