[{"comment_id":"10150935097914999","commenter_b":"no clue what you're talking about?? You're not a woman so sfu!","commenter_a":"No, she's a hypocrite! Have you ever watched an abortion? I have...in 20 weeks it is a baby. In late term abortion labor is induced. The baby's head is delivered. a small incision is inserted into the back of the head the knife is twisted to kill the baby. The brains and skull is crushed.","post_message":"\"Hillary Clinton owned her feminism. She sounded like the first woman running for president, defending other women — our autonomy and our control of our own bodies,\" Emily Bazelon writes in The New York Times Opinion Section."},{"comment_id":"1328806503882265","commenter_b":"I bet most of these women pretending trump troubles them are the same willing to kill an unborn child at 13 weeks","commenter_a":"The whole family should crawl back in that BLACK WHOLE THEY CAME FROM..","post_message":"Donald J. Trump's son defended his father's comments caught on tape, saying other men make similar remarks."},{"comment_id":"10153715486157144","commenter_b":"Boom bitch!","commenter_a":"Y u gotta say boom","post_message":"BOOM."},{"comment_id":"1000192243373586","commenter_b":"The little bitch should serve time.","commenter_a":"It's not white privilege. It's called \"daddy is connected\". Still doesn't make it right","post_message":"This girl had so many drugs that her sentence should be more than 200 years -- read on to find out what she's going to actually get."},{"comment_id":"938211592934866","commenter_b":"Kick His Ass Anyway, besides it was one of Jesus's Crew","commenter_a":"Jesus says an Eye For an Eye. Someone down there kick his ass Please and Thank You","post_message":"Remember, nothing says \"Soldier for Christ\" like giving a child a black eye!"},{"comment_id":"1083178338406653","commenter_b":"Debunked snopes factcheck go away","commenter_a":"I would not vote for Hillary she got off easy a 12 year old child rapist, the Benghazi scandal, Clinton Cash, and emails. Don't forget about Bill Clinton rape cases/allegations. Trump call Hillary: Crooked.","post_message":"“Ella sigue siendo la mejor agente de cambio que he conocido”—presidente Bill Clinton sobre Hillary."},{"comment_id":"10154980169065789","commenter_b":"@username poor little bitch, guess what trumps your president now ! Lol","commenter_a":"He's accomplished so much in such a short period of time, compared to the last administration. So thankful we have someone who will strengthen our nation and our military. God bless you President Trump!!","post_message":"Donald Trump has been in the White House for 13 days. Do you like or dislike what you've seen from his administration so far?"}]
