[{"comment_id":"497304097143406","commenter_b":"LEAVE ABE ALONE DIMWITS!","commenter_a":"Leave our money alone","post_message":"First The 20, Now The $5 Bill - Obama Announces More 'Diverse' Face For The Bill Stop it. Leave our money alone. Do you think they should keep honest Abe on the 5$ bill?"},{"comment_id":"827081283993961","commenter_b":"Moochele needs to shut her ugly mouth.","commenter_a":"We can't stand her either.","post_message":"Is she serious?"},{"comment_id":"10152796011681130","commenter_b":"That's right. You. Cant Your not a football fan. Just some bitch with a uneducated opinion. Sad...","commenter_a":"So they should be disqualfied and the Colts should get in.","post_message":"So it wasn't just some weird conspiracy theory."},{"comment_id":"682571568600088","commenter_b":"I am so sick of hearing this offends the Muslims that offends the Muslims what the hell are they living here in America this is our country go back to where you came from because you offend us","commenter_a":"DONT LET THEM DO IT!!! Don't keep the truth away from AMERICA. Don't let them do it.","post_message":"Schools are removing the Holocaust for curriculum because it offends Muslims. This is could be the most ridiculous thing I've ever heard. Do you think they should keep the Holocaust in history lessons?"},{"comment_id":"10154011637299062","commenter_b":"Either way she is screwed...hopefully they catch these horrific criminals soon!","commenter_a":"Hmmmm wonder if they plan to murder her now?","post_message":"She \"allegedly intended to be the men's getaway driver but got cold feet and failed to show up at a rendezvous point.\""},{"comment_id":"10154200201311636","commenter_b":"I don't understand how she can even show her face in public after what she's done to Germany. Which in turn has had a negative impact on the rest of Europe. They should ship her out of the country along with all her precious illegal migrants.","commenter_a":"Thats good news for the AFD party..... No German wants to see this puppet!","post_message":"More follows"},{"comment_id":"1271695059532579","commenter_b":"she is so miserable with herself she just lashes out at everyone such a poor excuse for a female","commenter_a":"Rosie is not well! Needs Mental Health help!","post_message":"Rosie is disgusting!"}]
