[{"comment_id":"1683253511914514","commenter_b":"@username Trump & FOX NEWS have Greatly Exaggerated This Issue The Lying About the Protesters IS On TV Footage & They Still FLAT-OUT LIE.... Why is Fox NEWS Saying it was Violent Protestors, The Media Was there you can See Who are the Aggressors it was the Trump Supporter, but the Trump Supporters Started Sucker Punches Again, Most of the protestors inside were young White Girl with locked armed, the Protesters Outside were very peacefully walking around Outside with their signs until the Inside Trump Supporters Went Out Side & started Yelling & Pushing Protesters, it's on CNN. Trump Calls CNN & Tell them they were violently attacking, He Ran Off as soon as he saw there was more than one Protestor there's Footage...Trump Lies & Exaggerates everything 1000 Times Fold !! TRUMP Wants to Turn Our Military INTO Brainless Terrorist Animals To Beat ISIS, Our Military Has Rules & ...","commenter_a":"After tonights Chicago thuggery, trump will probably win every state voting on Tuesday in a landslide lol","post_message":"Marco Rubio is urging Republicans in Ohio to vote for Gov. John Kasich in order to prevent Donald J. Trump from winning, according to published reports and comments from his own people."},{"comment_id":"1205288416198545","commenter_b":"in tears watching this. God keep him with you and give the family strength and patience to heal.","commenter_a":"Priceless....God bless this little tyke and his family and friends..","post_message":"WATCH: 6-year-old boy killed in SC school shooting laid to rest dressed as Batman at superhero-themed funeral: @webpagelink"},{"comment_id":"10153379437614411","commenter_b":"To Turchinov's bitches.","commenter_a":"Ukraine have just had a 175 Billion dollar loan about 3 weeks ago, Plus a 1.8 billion dollars this week from the EU and now they are getting ready to default on these debts. Could someone please tell me where all the money has gone in such a short space of time????","post_message":""},{"comment_id":"1982433335149738","commenter_b":"Beyonce is good in showing off her booty and that's about it .","commenter_a":"Agreed with Santana. Her performance was too visual artistic and address to a very narrow audience....it was not too much a vocal challenge or a singing performance in the true sense. This characterize her style over all.","post_message":"Carlos Santana: Beyoncé is not a singer, with all respect to her"},{"comment_id":"10154347897121375","commenter_b":"Fernando Barbosa god I hate this bitch","commenter_a":"@username \"dirty Muslim who'd piss of daddy\" literally us to every white guy","post_message":"This viral rant on #WomensMarch is riddled with fake outrage and hypocrisy where she complains about women complaining."},{"comment_id":"10154865700468256","commenter_b":"Aaaaaaannnnndddd just fortifying my position even more!! Lmfao!","commenter_a":"I sit back, a giggle my butt off at all these liberals grasping at straws to stop Donald Trump. Such hypocrites, because just 8 years ago when Obama was elected, they were so critical of the \"birther\" cries from conservatives...... I guess when your horse loses the race, you go chasing unicorns!!","post_message":"Pressure on members of the electoral college to select someone other than Donald Trump has grown dramatically - and noisily - in recent weeks, causing some to waver ahead of the Monday vote."},{"comment_id":"760141017451798","commenter_b":"he also spoke at her rallies against Obama Care!! he should be thrown out for being publicly biased BC he knows he had to make decisions on it so it is illegal for him to do that!! his teaturd wife is insane too!!! apparently if your rich, you are above the law! time for a big change here!!!","commenter_a":"And what about Thomas \"inadvertently\" forgetting to report 1.6 million in income his wife earned lobbying and speaking against healthcare? How is he still on the Supreme Court?","post_message":"Very interesting."}]
