[{"comment_id":"10153906125115736","commenter_b":"So should grabbing pussy.","commenter_a":"It's already beginning to sound like a dictatorship!","post_message":"Trump says burning the flag should be punishable by 'perhaps loss of citizenship or a year in jail.'"},{"comment_id":"1231733206844027","commenter_b":"I see nothing beautiful about her, she's hateful, that's ugly!","commenter_a":"Michelle Bachmann is a beautiful woman. Too bad....","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153171186966051","commenter_b":"stand your ground. no to muslims","commenter_a":"I would say no no no","post_message":"The people in this town are prepared to do whatever it takes to keep a Muslim cemetery out. In fact, they have one very specific idea in mind."},{"comment_id":"1174759955897808","commenter_b":"And assholes will be assholes!","commenter_a":"They are F'n PIGS... We learned that in the sixties... How soon the ignorant forget. PIGS BE PIGS... NOTHING HAS CHANGED","post_message":"We FINALLY have the proof!"},{"comment_id":"1759425104296851","commenter_b":"So how come she is now for crooked Hillary?","commenter_a":"michelle you said that Hillary was not fit for the white house nothing has changed since 2008 except she committed more crimes","post_message":"The first lady who did pushups on Ellen, whose hubby sang Al Green, claims Trump's immature."},{"comment_id":"1812875395612222","commenter_b":"'@username......................your a @&$)(:; fool","commenter_a":"Such a BS! Obama made a deal to stop nuclear proliferation. Iran's compliance with our demands lifted the sanctions. So they got THEIR money. Eric Trump is total idiot thinking he knows anything about this matter.","post_message":"'[President Obama] lied about it. He said that it wasn't ransom money... No different than when he lied about ObamaCare.'  Yesterday on 'Sunday Morning Futures,' Eric Trump accused President Obama and Hillary Clinton of lying to the American people."},{"comment_id":"10154474483213812","commenter_b":"Arrested for saving lives........?????? Your mother should have swallowed you.","commenter_a":"Why don't you take care of them too. He should be arrested for illegal immigration. Try and bring Mexicans through the US border and see what happens.","post_message":"Privately owned search-and-rescue company owned by American millionaire has saved 500 refugees and migrants at risk of drowning after only 2 days of searching."}]
