[{"comment_id":"10154730532542042","commenter_b":"yetanother photo u tag me in with the rachetness 😂😂😂 are we sure this one is also a she?","commenter_a":"@username wah do she eye 😂😂😂😂😂😂😑😑😑😑😑","post_message":"The New Jersey hairstylist said her client was unhappy with her services -- so she pepper sprayed the woman in the face."},{"comment_id":"501283103409637","commenter_b":"I'll bet this ungrateful Liberal enjoys the freedom that our military & constitution provide her !!!","commenter_a":"The original blonde joke. No offense meant for conservative blondes or any blonde with good sense.","post_message":""},{"comment_id":"558741910917069","commenter_b":"Well a lot of the problem is, is she is a woman. I guarantee you she is going to have to fight a lot to become President, now and if she becomes president it will only get worse.and I am not voting for her.","commenter_a":"Shut up, Ben!!! You're out of this race.....","post_message":"Does Clinton's use of a private email server prove she has poor judgment and is unfit to be president?"},{"comment_id":"979482032090033","commenter_b":"I hope they fire this liberal girl.","commenter_a":"What do we expect from a company whose owner and chief executive is arrogant and unChristian!They just follow their leader. hope that more people boycott Starbucks. There are better coffee and cheaoer ones out there.","post_message":"Starbucks seems to be on a roll lately, and not in a good way! Should conservatives stay away from Starbucks?"},{"comment_id":"828004503968344","commenter_b":"The world is better off for her decision. Her kids wouldnt only be stupid...they'd be ugly as hell too!","commenter_a":"Damn good thing she doesn't want children. We don't need more idiots like her. Just imagine how brain dead her offspring would be.","post_message":"Liberals are repulsive Dc Gazette (y)"},{"comment_id":"10153990406082293","commenter_b":"@username apparently you believe so easily what Hillary says. She is a vicious Evil woman who cares about Money and Power and no one else. I have been around for all the Hillary Scandals and every one of them will be coming back at her during the next few months. I don't know how this woman can sleep at night for what she has done.","commenter_a":"She has been held to a higher standard. Republicans have spent decades trying to pull her down. #ImWithHer","post_message":"Hillary Clinton's honesty problem is growing."},{"comment_id":"10153672150997217","commenter_b":"Watch your tongue","commenter_a":"Most muslims hate gays yet have no problem seeing a murderous paedophile prophet as a role model for all mankind? That's f***ed up I'm sorry but it is.","post_message":"BREAKING: The suspect for the mass shooting at Pulse Orlando gay nightclub is 29-year-old Omar Mateen, the BBC understands. It is believed the US citizen was not on a \"terrorism watch list\"."}]
