[{"comment_id":"583593931828899","commenter_b":"We Can't Let This Happen ! Deport Them !","commenter_a":"Horrible","post_message":"Our Kids are in DANGER!"},{"comment_id":"10153244569769087","commenter_b":"Youare a fucking ignorant whore.","commenter_a":"Benjamin Netanyahu - is protecting the Free World while Hussein Obama wants the Deadly Suicide Pact with Iran. Wait until Iran hits America with their ICBM's, Iran can already Hit Israel.","post_message":"Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו delivered an intense silent protest of the Iran nuclear deal by staring down members of the United Nations General Assembly for nearly a minute without saying a word. WATCH:"},{"comment_id":"1562278293792195","commenter_b":"Hillary for PRISON !!!","commenter_a":"Deplorable in fl","post_message":"Join Chris Jansing at the polls from the key battleground state of Ohio Live! Full coverage all day: @webpagelink"},{"comment_id":"10157199580185231","commenter_b":"Congratulations!","commenter_a":"Congratulations","post_message":"This will make her the first African American recipient in the award’s 21-year history. Congrats Gwen Ifill!!"},{"comment_id":"10153860953039614","commenter_b":"Total fool.......actually wore than Hitler. Hitler is dead. Trump is still with us. For now.","commenter_a":"Clown","post_message":"A heckler interrupted Donald J. Trump at a rally in South Carolina, as the billionaire presidential candidate called for a \"total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what the hell is going on.\"  \"They have no respect for human life,\" Trump said, referring to \"people that believe only in Jihad.\"  He has previously called for surveillance against mosques and said he was open to establishing a database for all Muslims living in the U.S.  Read KTLA's story here: @webpagelink"},{"comment_id":"1775783539370851","commenter_b":"Idiots arrest them all","commenter_a":"White lives matter more!","post_message":"WATCH LIVE:  Protesters have gathered in downtown Atlanta. We have several Channel 2 Action News reporters with a group that is marching near the King Center and we'll have live coverage starting at 11."},{"comment_id":"10153049677426051","commenter_b":"She's in her 20's?? Seriously at first glance she looks like an old woman, she needs to lay off the drugs","commenter_a":"Damn.!!!","post_message":"A customer was walking through the Walmart parking lot when she noticed something odd about a nearby green Hyundai. After taking a quick peak inside, she immediately called 911."}]
