[{"comment_id":"10156170430735354","commenter_b":"Women don't need men any longer. They hate men. They have each other, the feminist lesbian agenda, invetro fertilization and high tech sex toys. All they need are man farms for harvesting sperm.","commenter_a":"Truer words.........","post_message":"\"...academics and feminists are terrified and calling for them to be banned.\""},{"comment_id":"10153286761179586","commenter_b":"The same with all Zoo's and not only seaworld. But if he or she is born in a Zoo or seaworld, they will have hard time to survive the real world and maybe die of hunger. So what to do? let them live in seaworld or zoo? kill them now? or let them free so they my die a slow dead of hunger because they never have learn how to hunt and survive?","commenter_a":"Assholes!","post_message":"How much space does an orca at #SeaWorld REALLY have? @webpagelink THIS is why they swim in circles in their tanks. The chart at 0:20 seconds explains it ALL."},{"comment_id":"904311766324849","commenter_b":"How do dicks like this get rich?","commenter_a":"Wow, what a dick!","post_message":"All I can say is that this guy is a total douche. What's your response to this video?"},{"comment_id":"382957778552770","commenter_b":"Better her than some right wing nut!","commenter_a":"Hoping for someone else - Hillary is too close to big bankers. :(","post_message":"You won't believe how large her lead is now!"},{"comment_id":"1109408939099898","commenter_b":"yaaaassss bitch yasss","commenter_a":"Angela Swartzel Melinda Bailey Mallory Brogli Chelsea Pande Roma Rispoli Kunia Rodrigues Carmel Rae Anne Mellies @username Jackie Smith fucking dyingggg😂😂😂","post_message":"That Voice Over! (Free The Monkey Though)"},{"comment_id":"1551588725149374","commenter_b":"Rest in the arms of Jesus little man. The world is praying for your family.","commenter_a":"you are in my prayers little angel. So are your mommy and daddy.","post_message":"Our hearts go out to the family of 2-year-old Nebraskan boy, Lane Graves."},{"comment_id":"980167608741328","commenter_b":"Trump should just buy there piss ant country..","commenter_a":"So funny","post_message":"What do you think of the proposal to ban Donald J. Trump from entering Mexico?"}]
