[{"comment_id":"10155313897730231","commenter_b":"Oprah, don't do it!","commenter_a":"He need two jobs!","post_message":"Own gives reality show to man with 34 children. ‘Fix My Life’ coach to guide him during the show."},{"comment_id":"10153356905187439","commenter_b":"Mussies I swear they're really just opressed homosexuals","commenter_a":"Bastards.","post_message":"@webpagelink"},{"comment_id":"10153416517971051","commenter_b":"She should not face any charges. She protects her child.","commenter_a":"You go girl he got off easy","post_message":"When this wife discovered what her husband did to her 7-year-old, she set him on fire."},{"comment_id":"10153414168399024","commenter_b":"it's a big city...Houston may have enough fag votes for that bitch, but Texas does not! The voters of Houston will wake up and dump the fag...","commenter_a":"My question is, how did a liberal get elected in....Texas.","post_message":"Of course, Annise Parker doesn't care what the voters think. Typical liberal. @webpagelink #tcot #ccot"},{"comment_id":"10155696474235389","commenter_b":"Not sure, police officers have a great sense of duty and honor.","commenter_a":"Neuter the police, this is the result.","post_message":"Question of the Day: Do you think Baltimore cops are now less likely to put themselves at risk?"},{"comment_id":"764036443733722","commenter_b":"Absolutely! Throw the Muslims off the bus. When will we be able to do as we please even if the stupid Muslims are offended. WE HAVE RIGHTS AND THE MUSLIMS OFFEND US.","commenter_a":"Were wrong. This is America. Freedom of speech.","post_message":"Woman And Daughter Kicked Off Bus For Singing Nursery Rhyme That Offended Muslim Passengers. She was just trying to soothe her daughter. Do you think this is wrong?"},{"comment_id":"10153941418821167","commenter_b":"Nope! He's going to insist that the debate was rigged.","commenter_a":"I haven't seen a whooping that bad since my cousin said the F word in front of Grandma. #KillaryKilled #TrumpTucksTinyTail #debates","post_message":"\"Overwhelmingly Hillary Clinton\""}]
