[{"comment_id":"10152705151371234","commenter_b":"He has a temperament ill suited to public office.","commenter_a":"That's because he didn't bring me KandyKakes, a cheese hoagie, and soft pretzels. Serves him right, loser.","post_message":"\"I think the trip was an utter failure... It should have been a trip of 'good behavior' instead of showing a short fuse,\" said a presidential historian at Rice University of Governor Chris Christie's trip to the U.K."},{"comment_id":"10153243373545950","commenter_b":"Go Hillary...to JAIL","commenter_a":"BREAKING NEWS: Donald Trump, Republican presidential candidate drowned today, apparently he was trying to learn to waterboard.","post_message":"President Obama banned the practice of waterboarding and other so-called \"enhanced interrogation techniques\" after he took office. But Donald J. Trump said he would \"bring it back\" to fight ISIS."},{"comment_id":"10154647718578132","commenter_b":"Ahhhh...women tearing other women down! How mature!","commenter_a":"At least she did the mop on her head somewhat decent tonight","post_message":"First Lady Michelle Obama delivered an unusually personal and emotional speech at tonight's #DNC."},{"comment_id":"10153103366966770","commenter_b":"@username yes Mario was an idiot but he's dead and buried. Andrew is his idiot son and Governor. Chris is his other idiot son. Both are liberal loonies.","commenter_a":"These idiots who push for these huge wage increases are what drives prices up!","post_message":"A proposal to enact a $15 minimum wage in New York could cost state school districts $276 Million, according to a report released Friday."},{"comment_id":"727273657378849","commenter_b":"We can not trust Iran and we definitely do not need to give them money. Thanks for standing up against this deal and a deal that does not even include the release of our Americans held in the Iran prison.","commenter_a":"hey rodney you pathetic weasel,the US has violated almost every treaty they have ever signed you delusional fool.","post_message":"My statement on the nuclear deal reached with Iran: “In the coming days and weeks, I will carefully analyze the details of this agreement, but remain skeptical that the Iranian regime will live up to its end of the deal,” said Davis. “We’ve been here before with North Korea who two decades later have cheated its way out of a deal and onto a path to dozens of nuclear weapons. I fear this administration has agreed to terms that will leave the world’s leader in state-sponsored terrorism stronger economically with a nuclear program largely intact.” Last week, I spoke on the House floor warning against a bad deal with Iran →"},{"comment_id":"10154770919726037","commenter_b":"There isn't any suspense. I think we all know what Trump's reaction will be when he loses...","commenter_a":"He answered truthfully. We'll wait and see. It was a gotcha question for which there is no correct answer.","post_message":"“I’ll keep you in suspense.” - Donald J. Trump"},{"comment_id":"1588312174810373","commenter_b":"Killery destroyed evidence after she received a subpoena from the FBI and she Lied under oath! Alot of people have went to jail for less! Our Government and the Media are so corrupt! The same people that have major shares in every media outlet are same people that fund Killery! Saudi and Arab countries!!! I hope you know how they treat Women? Children! Gays?","commenter_a":"This woman has no shame... She will say and do anything for power.. Wake up Dems you're trying to elect a criminal for president.","post_message":"Latest batch of WikiLeaks emails contain details on Hillary Clinton's narrative on Benghazi. @webpagelink \"We see an email exchange among John Podesta [and] other top aides, where Hillary Clinton was being coached on, in their words, 'how to stir up some moral outrage against Republicans' at this Benghazi hearing several months ago,\" Ed Henry reports."}]
