[{"comment_id":"1387475997939242","commenter_b":"It's probably a welsh lamb that's fucking had enough of being raped 😂","commenter_a":"Fucking ouch!!!!","post_message":"And you thought you were having a bad day... via JukinVideo"},{"comment_id":"10153762734254087","commenter_b":"All this woman does is lie her ass off 24/7","commenter_a":"Republican Hypocrisy !!","post_message":"FBI Director James Comey dismissed Hillary Clinton's claim that his agency's probe into her private email server was a routine “security inquiry,\" telling reporters \"I'm not familiar with the term 'security inquiry.'\""},{"comment_id":"10153062976166680","commenter_b":"Eh. Women do come back in body bags but whatever.","commenter_a":"The candidates should pledge to keep Jackson and Hamilton on the currency. Where does it say a women has to go on a bill. Women don't come back in body bags during our wars. To go on a currency bill as Washington, Lincoln, Hamilton, Jackson, Grant, Franklin, and Jefferson have is b/c of their committment to this country, AND NOT b/c of their genitals. If a woman is to go on a bill let it be on a three-dollar bill.","post_message":"POLITICO Europe: “There is such a thing as society,” Cameron said in an implied retort to Margaret Thatcher’s counter-view, “it’s just not the same thing as the state.”"},{"comment_id":"10153376239848984","commenter_b":"Kill the fucking idiot","commenter_a":"He is now someone's girlfriend...","post_message":"He stabbed a police officer 14 times and what he said here was even WORSE. Do you think this criminal deserves life behind bars after this?"},{"comment_id":"10153075860699614","commenter_b":"A women should know her body lets slit her throat!!","commenter_a":"@username I understand what you're saying I've been through it also 3 times but when you see your babies all thoughts of dying and killing go away post part um depression it's just an excuse","post_message":"A young mother in Olympia, Washington, allegedly told police that she slashed the throats of her 6-month-old twins and 2-year-old daughter to keep them quiet for her husband. Christina Booth, who is believed to be suffering from postpartum depression, made a 911 call Saturday sobbing and screaming at the operator that her children would not stop crying. When police arrived they found the twins on the couch crying \"uncontrollably\" and \"bleeding from their necks.\" The 2-year-old was upstairs with a similar wound. All three survived their injuries. Booth allegedly told police \"she knew if she killed all the kids the house would be quiet\" for her husband \"who gets annoyed when the children cry.\" Read KTLA's story here: @webpagelink"},{"comment_id":"10153604606804024","commenter_b":"AFUCKINMEN ON THAT SHIT!","commenter_a":"OBAMA DOES NOT CARE---HE TREATS THE ENEMY BETTER THEN AMERICANS !!!!!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1698726270383299","commenter_b":"@username I DON'T KNOW WHAT YOU ARE SMOKING OR DRINKING BUT EVERY SINGLE DAY HE LAYS OUT POLICY....1. CLOSED BORDER, 2. DEPORT ILLEGALS, 3, BUILD A WALL. 4 HEALTH INSURANCE OVER STATE LINES SO IT IS COMPETITIVE. 5. BUILD THE MILITARY...6. IMMEDIATELY DEFEAT ISIS...7 SMART TRADE NOT JUST FREE TRADE WHICH BROKE THE COUNTRY..8. CUT TAXES FOR MIDDLE CLASS..9...TAX COMPANIES GOING OUTSIDE THE USA TO MANUFACTURE AND SELL HERE WITH NO PENALTY. 10. SMALLER GOVERNMENT, TRIM COSTS, AND WASTE. 11. PLACE CONSERVATIVE JUDGES ON SC...HE WILL NAME THE CHOICES BEFORE ELECTION 12. PRO LIFE...13.NO SALARY FOR HIMSELF 14. EDUCATION BACK TO THE STATES...NO MORE COMMON CORE...I GO ON BUT YOU NEED TO PAY ATTENTION AND STOP SPOUTING LIES....YES ONCE HE GETS IN...THE PENTAGON AND OTHERS WILL GIVE HIM INFO HE DOES NOT YET HAVE ACCESS TO...BECAUSE OF THAT NEW INFO, HE MAY HAVE TO ALTER THINGS SOME...THAT'S TRUE OF EVERY ...","commenter_a":"Yeah. Donny Trump and his lackeys DO NOT get to redefine what a conservative is. Many many real conservatives have fought hard, long battles over the decades to pull this nation back onto the constitutional rails advocating for founding principles. This fight has always been against politicians of the democrat party and republican establishment put there in part with Donny Trump donations. Where was Donny when some were standing tall against amnesty? Where was Donny when some were fighting Obamacare? Where was Donny when some were fighting to get Planned Parenthood defunded? Where was Donny when a certain someone was fighting the unconstitutional DC gun ban? Where was Donny when average citizens were having their homes confiscated by local governments so rich people could use them instead............... He was on the other side, or silent......because it didn't benefit him personally to be on the right side. Trumpers are for a ...","post_message":"Dana Loesch unloads: \"She made it personal first — I’m just doing it the Trump way: you come at me, I’ll come back at you three times as hard. You like it now?\""}]
