[{"comment_id":"10153961188184705","commenter_b":"Show us your Boob's lady.","commenter_a":"Hi from rio brasil","post_message":"Get an exclusive tour of the Mashable House at SXSW with Pete Cashmore."},{"comment_id":"10154831195946729","commenter_b":"Well, turns out Michelle Obama herself was accused of plagiarizing part of her speech. In fact, the Democrats who are using last night’s speech as a means to cast aspersions might have done well to pause and consider the list of their own high-profile leaders who have been caught plagiarizing.","commenter_a":"Melania Trump Did NOT Plagiarize Michelle Obama’s Speech And This Is Why… The accusation is that Melania Trump “plagiarized” a speech made by Michelle Obama in 2008. Well I’m sorry liberals, she did not. Here are the comments from Michelle Obama in 2008: \"And Barack and I were raised with so many of the same values: that you work hard for what you want in life; that your word is your bond and you do what you say you’re going to do; that you treat people with dignity and respect, even if you don’t know them, and even if you don’t agree with them. And Barack and I set out to build lives guided by these values, and pass them on to the next generation. Because we want our children — and all children in this nation — to know that the only limit to the height of your achievements ...","post_message":"Wow..."},{"comment_id":"1124947717560231","commenter_b":"Hurry up woman!!","commenter_a":"Alright, that's it...we're moving to Colorado. @username","post_message":"It is absurd that here in America, we remain the only major country on earth not to guarantee health care to all people. If this proposal for universal health care can win in Colorado, I believe it will spread around the country."},{"comment_id":"981651015256776","commenter_b":"Lol because people and companies don't donate cars and trucks for tax write offs","commenter_a":"God forbid American tax payer money goes towards improving lower and middle class families or stuff that actually benefits us, but check out the sweet new cars dps get to drive!","post_message":"Next time you pass a red Dodge Challenge or Yellow Ford Mustang GT, you might want to check your speed. DPS troopers now have two new unmarked vehicles for traffic enforcement."},{"comment_id":"10153695940741955","commenter_b":"Does she get virgins too?","commenter_a":"ew....that is all...","post_message":"UNDER THE BURQA"},{"comment_id":"10153070562531051","commenter_b":"She needs to be put in a hospital were criminals go. They need to put all the weirdos on a dam island somewhere.","commenter_a":"THere has to be a way to trace the video, find this woman and make her pay for this horrible murder of an innocent dog. Nothing could be gained by this act and the woman needs to be stopped before she kills again.","post_message":"First she tied the dog up. Then she took out her blowtorch."},{"comment_id":"677143662389195","commenter_b":"Shut Up!!!!!","commenter_a":"The Patriots are speaking! Donald Trump is our Patriot Leader! E-verify. Numbersusa.com. Arm all our military - - active, reserve, and veterans. Honor The Constitution / Bill of Rights, limited government, free enterprise, and USAmerican exceptionalism. Make The USA Great Again! Go, Trump! Support the Muslim Reform Movement. No more terrorists! m.facebook.com/Muslim-Reform-Movement-@username/ MuslimReformMovement.org","post_message":"If Donald J. Trump \"gets his way, it will be like Christmas in the Kremlin,\" says Hillary Clinton"}]
