[{"comment_id":"10155893621460231","commenter_b":"That's her prerogative ....","commenter_a":"Take it are leave it! but get a life.","post_message":"The singer—along with a lot of other people—isn’t buying it."},{"comment_id":"10155453199626729","commenter_b":"Illegal immigrants big issue here too, handing out drivers licenses that look identical doesn't help with the voter fraud issue we definitely have, but don't acknowledge.","commenter_a":"We have the same problem in Nevada. My guess would be 25% of the plates are Californian, maybe an exaggeration, but at least 10-15% are, and these aren't tourists because they're parked and driving out in our neighborhoods. These are just the ones that haven't bothered to register their cars here. Overwhelming people you talk to are Californians and most have come within the last 5-10 years. Majority of true Nevadans, natives and long time residents, are embarrassed by the color our state was on that election map. I wish the infestation would retreat to their looney state but it appears we've been overrun.","post_message":"So simple, a liberal could understand it"},{"comment_id":"10155058445841509","commenter_b":"Well shoot - if Queen says no to him, how dare he run for President...lol - let the woman with the impeached husband take over!","commenter_a":"Not only was part of Melania Trump's speech plagiarized (word-for-word) from Michelle Obama... Also...Both the guitarist and the record company for Queen refused to authorize Trump Inc (and all political groups) to use their song 'We Are The Champions'...but of course that boundary was disrespected by Trump. Is this a Prank Show ??? THIS is stranger than fiction. When are they going to say: 'Ta-Dahhh!!! Y'all just got Punk'd!!!'","post_message":"JUST IN: Speaker Paul Ryan announces Donald J. Trump 'has been selected as the Republican party nominee for President of the United States.' @webpagelink"},{"comment_id":"10153790527131336","commenter_b":"Coming in your town soon.","commenter_a":"Beyond stupid","post_message":"Critics have pointed out that the Obama administration has taken a different position when it comes to defending Christians' religious liberties."},{"comment_id":"10150622928829999","commenter_b":"She needs to go and work with Al Dunlap. They both do jobs that no one else has the guts to.","commenter_a":"Joe Jack","post_message":"Ellen Pao is resigning from reddit after a week of ceaseless criticism from angry users."},{"comment_id":"10156367673320725","commenter_b":"'@username pull your pants up","commenter_a":"This Latina and my family are voting for Donald Trump all the way to the white house!! Yay for me!","post_message":"I will NOT let America down! Thank you for your continued support of my presidential campaign. Together, we can all #MakeAmericaGreatAgain! #Trump2016"},{"comment_id":"1585095868182585","commenter_b":"Just go away!","commenter_a":"Isn't mental illness a sad thing?","post_message":"Oh dear god."}]
