[{"comment_id":"10153669770570950","commenter_b":"My thought exactly. If you see the pictures and videos, there are lounge chairs and tables just feet away from the water. People can read the \"no swimming\" sign, but an alligator is not going to think twice about coming on land. I think Disney needs to close off areas where there are gators. I lived in Tampa for four years, and gators were everywhere near water. You just knew where they were, and if you didn't, there were signs. I doubt people did not know about the alligators; you can always spot them especially if there are more than three. This could have been prevented.","commenter_a":"Why were alligators allowed to be so close to where human activity is? Especially DISNEY WORLD where 1000's of children are on a daily basis??","post_message":"Officials are pulling alligators from the nearby lagoon and putting them down to check for the boy's body; so far, they haven't found him."},{"comment_id":"10155033056251350","commenter_b":"you alice are the lame one.... bet u r fun at parties....not!","commenter_a":"how can americans put the flynn event in context. flinn's entry into the trump power structure was vigorously opposed from the beginning: one might even consider his a marked man. part 2: media has propogated trump's comments on intelligence agencies extensively. so one could ask the question how does the leak on flynn occur in the first place: NSA surveillance or other. it would appear a US intelligence agency leaked to the anti trump news media:))) could one consider that a direct attack on this nation to influence American government: yes. trump must drain the swamp in the intelligence community now. the entire establishment apparatus that supported the status quo is now actively working against change middle class voted for: start the purge. there is an outlier that must be considered: Israel. trump is surrounded by Israel firsters. was flynn one of those or was he an American firster. did ...","post_message":"On this Valentine Day, watch George H.W. and Barbara Bush share their touching love letters on TODAY in 2011 (and try not to cry!) @webpagelink"},{"comment_id":"890220867779354","commenter_b":"I'm sure she doesn't care. She's a coon. They love being used and abused by white people","commenter_a":"Maybe she didn't swab his knob as good as the other women at Fox News","post_message":"Ex-Fox News CEO Allegedly Referred to Stacey Dash as 'Mean Black Girl'"},{"comment_id":"10153584221598352","commenter_b":"Throw her dumb ass in jail.... She'll get a lot of attention","commenter_a":"Aye u had sum true to heart good ass friends. U messed up big time","post_message":"Fraudster who made her friends shave their heads in her honor after claiming she was dying of cancer admits she made it up for attention"},{"comment_id":"10150640777899999","commenter_b":"Did she send that message on her illegal server?","commenter_a":"Donald Trump- the gift that keeps on giving. Signed Hillary Clinton","post_message":"Donald J. Trump promoted tweets that called Megyn Kelly a “bimbo” and that said she “bombed” as a debate moderator."},{"comment_id":"10152776407520047","commenter_b":"Good someone see him for what he is , wake up. Before its to late .","commenter_a":"Thank you ACLJ","post_message":"Today, a federal appeals court upheld a previous ruling against the Obama Administration's unconstitutional Executive overreach.  Impatient Presidents don't get to change the law. READ MORE."},{"comment_id":"1062536000443119","commenter_b":"White girls can't even right now.","commenter_a":"I went in to the Starbucks on Bay Area blvd across from baybrook mall,ready to buy coffee and a sandwich. They insisted on giving me everything \" on the house\" ! They were so kind and respectful to their customers. There was an outpouring of kindness from all who were in the store. The tip jar was full of large tips! They locked the doors right after I made my \"purchase\", but never once rushed me out of the door. This place is a class act!","post_message":"A computer outage is disrupting Starbucks sales in the U.S. and Canada, and its impacting a lot of people right here in Houston. KPRC2 Anoushah Rasta is following this story on #KPRC2 News at 10 p.m.  MORE ---> @webpagelink"}]
