[{"comment_id":"10154473671751234","commenter_b":"Take the names of all the restaurants employing illegal aliens, seize the records, heavily fine the businesses, and deport the illegals. Give the jobs to Americans- rumor has it, employment for AMERICANS is still suffering. And if you're an American who needs a job, but won't take one, no entitlements for you. There. I said it. Call it common sense.","commenter_a":"What are the party affiliations of the owners and bosses of @username?","post_message":"Some New Jersey restaurants are preparing for a strike on Thursday."},{"comment_id":"10154253294384486","commenter_b":"Jack, this heartless bitch is worse than an animal","commenter_a":"make no mistake,this is an animal","post_message":"Only 12,000 more signatures needed...."},{"comment_id":"10153213531701336","commenter_b":"I will bet she cannot fix anything, maybe breakfast if she knew how to turn the stove on.","commenter_a":"Sounds like she's twisted","post_message":"Moments ago, Baltimore Mayor Stephanie Rawlings-Blake defended her decision-making to critics and vowed there will be justice for Freddie Gray."},{"comment_id":"10154038199220470","commenter_b":"Dang! 2 females! Crazy!!","commenter_a":"@username.. This is the chase we saw","post_message":"#BREAKING: The police chase lasted about a half hour, police say. No one was injured."},{"comment_id":"10158475114940354","commenter_b":"Is Melania Trump retarded?","commenter_a":"Uninstalling Obama in... 99.9 % Complete!!","post_message":"Say what?!"},{"comment_id":"1024247464301668","commenter_b":"Thats life woman ....","commenter_a":"Why do we have to broadcast everything? Is anything private anymore?","post_message":"The scar that saved a baby's life"},{"comment_id":"1060233254031678","commenter_b":"I have a question, I received an email from the bernie sanders.com saying i did not have a party preference but to request a democratic ballot. i did get a democratic ballot. this is my first time voting and was wonder if that's what it actually meant?","commenter_a":"I like how honest Bernie is. The Democrats sold that clean coal fantasy for years, and Clinton is still trying to sell it. Heck, she said natural gas is a \"bridge fuel\" when, renewable can replace most energy needs. When a candidate who sold fracking to the world, and supports \"clean coal\" gets environmental group endorcements. That candidate is the establishment. Because nothing else makes any damn sense.","post_message":"Safe fracking is like clean coal, pure fiction. Fracking pollutes water, degrades air quality and worsens climate change. No amount of regulation can make it safe."}]
