[{"comment_id":"765284786938035","commenter_b":"real women respect themselves enough to not get knocked up and then run from responsibility.","commenter_a":"The Colorado shooter's neighbors have been interviewed and his shack has been visited. Turns out he was...drumroll please...AN OBAMA-LOATHING PRO LIFE CHRISTIAN! Now who could've possibly seen that coming? The propaganda videos led the terrorist to carry out his deed. Sound familiar something going down a tad east of here?","post_message":"What a sleaze ball."},{"comment_id":"1008727995814878","commenter_b":"Wolves are twice the size of a coyote.","commenter_a":"I bet the majority of you couldn't spot the difference between between a coyote and a wolf either.","post_message":":("},{"comment_id":"882724591787290","commenter_b":"Battered but still a warrior, great courage.","commenter_a":"This kid needed a gun and a CCL. So as to defend himself!....oh wait he lives in Newtongrange, Midlothian. Is that in....the UK? They not allowed to defend themselves with lethal force, from Thugs! Thanks to people that think like Piers Morgan.","post_message":"Left for dead with a battered face and multiple fractures by man he stopped to help"},{"comment_id":"10153085331829205","commenter_b":"she would","commenter_a":"He needs to be charged with AT LEAST manslaughter... she w","post_message":"New Sandy Bland Dash Cam Footage Released"},{"comment_id":"726552340811280","commenter_b":"this female is an ignorant scumbag","commenter_a":"I guess that means yes....","post_message":"I'm not afraid to say these are FAKE TEARS!"},{"comment_id":"817400965070133","commenter_b":"Full fledged ASSHOLE and you too @username...go back to Mexico you illegal alien!","commenter_a":"And you Bill de Blasio are a Asshole !!!!! At least Mr. Trump has the balls to stand up for what he believes in !!!","post_message":"'I didn’t realize this was in question. Behaves like a racist, speaks like a racist…of course @RealDonaldTrump is a racist,' New York City Mayor Bill de Blasio tweeted."},{"comment_id":"10153162975649205","commenter_b":"Assholes","commenter_a":"JAYWALKING noting wong","post_message":"Cops Beat Black Teen For 'Resisting' His Jaywalking Ticket"}]
