[{"comment_id":"888341521222544","commenter_b":"She sounds worse than the other guy Holder.","commenter_a":"Another dumbass handpicked","post_message":"Add your name HERE: @webpagelink"},{"comment_id":"1188981914457930","commenter_b":"A better statement than any feminist has ever made...","commenter_a":"Curtis Oakley","post_message":"They are doing it for a powerful reason."},{"comment_id":"10154233003321336","commenter_b":"@username criminal actually the first foreign language spoken by illegals immigrants in the usa territory was English","commenter_a":"Donald Trump he's making our nation the laughing stock of the world but he is not the problem apparently in the usa there are a legions of racists misogynistics and fear filled ignorant people just waiting for a voice of lead and release them ,, he is not our shame the idiocy of some of our citizenry is our shame","post_message":"\"I've spent less money than almost anybody else and I'm in first place by a lot.\" – Donald J. Trump"},{"comment_id":"460222577435670","commenter_b":"Build the Wall, send all illegals home with the babies, end sanctuary cities, take care of our Vets and end abortion. Yippee!! Go Trump.","commenter_a":"Everyone like how he \"tells it like it is\"---after he becomes president and tells YOU the truth about yourselves, don't call for impeachment!","post_message":"When asked for the reason behind his recent political success, Donald Trump gave this simple answer."},{"comment_id":"1025085544195452","commenter_b":"@username , are you Canadian ? If so , we will gladly ship a few million muslims to your neighborhood","commenter_a":"That \"teacher\" should be fired!!","post_message":"“My daughter wanted to know why she was asking her that.”"},{"comment_id":"10154415987472908","commenter_b":"DUMP TRUMP!","commenter_a":"Quite right. Remember Lincoln : \"A house divided agaisnt itself cannot stand\". Tell that to Trump who is SUPPOSED to be a Republican but he's a disgrace to their histoy.","post_message":"I do not want to see the frustration and the despair that so many people feel being picked apart by people like Donald Trump, preyed upon, in order to divide us again. A few months ago we were supposed to hate the Mexicans who according to Trump were all racists and criminals. And now we're supposed to hate the Muslims. That's not what this country is supposed to be about. We are strongest when we stand together."},{"comment_id":"10155098907990329","commenter_b":"I'm always grateful to be corrected, especially when someone is able to be patient with me even though I'm not owed it :)","commenter_a":"My family has been calling this season's theme \"A Haunting\" because of the reenactments and stuff. I like the season so far but guys, what happened to the people of Roanoke really isn't that big of a mystery. Most likely after part of the group left to get supplies more colonist died from a mix of starvation and attacks. They then most likely moved to settle with the Croatoan tribe for both help feeding themselves and protection. It also helps explain the upsurge in Croatoan children with blonde hair or other features that are rare, though not unheard of, in their genetic pool. Basically, your elementary school teacher lied to you. Other lies you learned in history class: the Mayans didn't just mysteriously disappear. They over farmed the valleys they lived in and could no longer continue to occupy large cities and began living in smaller groups. They're are still ...","post_message":"Mind blown. // American Horror Story"}]
