[{"comment_id":"1033904696677262","commenter_b":"it's good that there is surveillance even watching midwives, and exposing this crazy cow is also good, but I just feel that this might start a trend of uploading horrendous abuse videos. The media should try to hide the identities of poor kids like this baby. She definitely needs shooting a few times at least.","commenter_a":"I have not seen the video nor do I want to. Y on earth is it here for everyone to see!? What is there to gain from displaying a horrific video of a child being abused? The story should be published but when this poor child grows up and sees that this video has been seen by millions how do u think he/she will feel? Hope this cow rots in hell.","post_message":"WARNING: GRAPHIC VIDEO"},{"comment_id":"1109262989140148","commenter_b":"Crazy woman- Good match for Trump","commenter_a":"What an imbecilic shallow fool! Has she ever gone a day without knowing where she will sleep for the night or whether she will find a meal before the end of the day? God! Someone just shut her up!","post_message":"\"Knowing that Trump won on [immigration], it should empower you to go ahead and ask the candidates, 'What the heck are you thinking, candidates? What are you thinking when you're going ahead and actually asking for more immigrants, illegal immigrants, welcoming them in, even inducing and seducing immigrants with gift baskets of teddy bears and soccer balls?' \" Sarah Palin said."},{"comment_id":"1619157871724827","commenter_b":"oh come on this is another lie and I would sue thevhekl out of Gloria and this bimbo! all these women have come back and stated they lied!! this bimbo wants her 15 minutes and she has no merit! ! he was right most Hollywood women will let you grope them for them to get ahead!! funny how all these women kept going around him time after time therefore it did not happen or they would not have wanted to be around him!!","commenter_a":"Blah blah blah,,,,, ummm what happened to all the other woman during the elections. Bye felicia","post_message":"WATCH LIVE: Donald J. Trump to face lawsuit from woman alleging sexual misconduct."},{"comment_id":"10154582886013725","commenter_b":"Go away and have another affair with the maid. You have your nerve. You embarrassed your whole family!","commenter_a":"If trumps doing what he said I hope all you moron trump supporters cozy up 15 billion for the wall that you ignorant assholes and trump are foolish enough to build. Doubt that right so stfu scumbags.","post_message":"Arnold Schwarzenegger says Trump is completely embarrassing the United States on the world's stage right now. Is he right?"},{"comment_id":"558522770939482","commenter_b":"@username is PURE CANCER to this country, DONT LISTEN TO HER LIE's. GO SEE THE MOVIE THAT WILL EXPLAIN EVERYTHING THAT'S HAPPENING RIGHT NOW \"HILLARY'S AMERICA\" will burn this hag to the ground. NEVERHILLARY","commenter_a":"HAhahaha WHAT A JOKE THIS POST IS. THEY ARE ALL YOUR SUPPORTERS INCLUDING THE KKK YOU TOOK DONATIONS FROM.","post_message":"\"Couldn't have said it better!\" —David Duke, former grand wizard of the Ku Klux Klan, on Donald Trump's RNC speech"},{"comment_id":"889757574548152","commenter_b":"Bye bye bitch","commenter_a":"When","post_message":"Rosie O'Donnell's worst nightmare just came to fruition. Good riddance, get her out of the country asap. Can we get 20,000 'LIKES' to get Rosie out now!"},{"comment_id":"10152760483166051","commenter_b":"I guess she rubbed them the wrong way......","commenter_a":"They didn't arrest her but they issued her a citation.","post_message":"Police took one look at the video this girl posted from the Oregon State University library and arrested her immediately."}]
