[{"comment_id":"10153165521747217","commenter_b":"Yes.. haha true because their women are so beautiful ;) :)","commenter_a":"Next time Netanyahu - global warming also caused by Palestinians","post_message":"Germany steps in after Israel's prime minister claimed a Palestinian leader told the Nazis to kill Europe's Jews"},{"comment_id":"1626892184281597","commenter_b":"@username I didn't know whiney little bitches played hockey...","commenter_a":"The whole irony in this, is that Trump knew he was never going to be able to get Mexico to pay for the walll...and now im just waiting for some trump supporter to justify this and or blame Obama.....","post_message":""},{"comment_id":"524518094380814","commenter_b":"Planned parenthood another way of saying murderous selfish bitch, or greed doctor. I think both. Revoke the doctors licences, and any woman getting an abortion gets a hysterectomy too. If you're willing to murder your own child once you don't deserve the privilege to have any at all.","commenter_a":"Hillary’s claiming credit for Planned Parenthood’s selling of fetal body parts. She says it’s a real money maker, and the only way she’s able to afford Starbucks....","post_message":"The top Planned Parenthood doctor whose face is all over the Internet because of an undercover video otherwise has left little mark on social media or elsewhere on the Web."},{"comment_id":"1243855252377391","commenter_b":"Jennifer, Donald trump doesn't care who you sleep with. Yes, it's better to vote GOP than to vote to import non assimilating Muslims who will cost a fortune and harm our citizens.","commenter_a":"I'm a Bernie supporter who's voting for Hillary whom I think is going to lose to Trump","post_message":"These names would be a huge draw in any feature film, but on Tuesday they lent their star power to another production -- the Democratic National Convention."},{"comment_id":"496338953890018","commenter_b":"Dumb as hillbilly racist. This ain't your country. You must of been beaten to many times by your hillbilly husband. Stay the fug out of their area then. You KKKrackers have many don't go zones, outsiders not welcomed. Most trailer parks in Auburn CA. and any white town in Mississippi. Live and let live mafaacaas!","commenter_a":"yes spray the area with pig fat","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"10153057043503984","commenter_b":"Kick her dumb ass out of office!","commenter_a":"NO!!!!!! We the people need to come together and figure out what to do about these people. No one in Washington is.","post_message":"I guess she's revealing her true intentions behind becoming someone in power... I wouldn't want to live under her rule.  Do you think this new mayor should be allowed to put restrictions on the Constitution?"},{"comment_id":"810160139094199","commenter_b":"guns? what guns? we aint got no stinking guns. Now lets play hide and go seek...","commenter_a":"And hopefully this is what ends up being her downfall","post_message":"Band-aids don't fix bullet holes You say sorry just for show If you live like that, you live with ghosts..."}]
