[{"comment_id":"501076896740857","commenter_b":"Please jailer give that crazy lady a good short hair cut. Get rid of that horses tail.......","commenter_a":"She wants more of the spotlight I do hope that they send her back and let her stay there enough of her do your job or resign enough of you","post_message":"Send her back!"},{"comment_id":"10152886398966378","commenter_b":"She makes me sick!!!!! And look at her with the big smile on her face,I'd like to smack the sh-- out of her!!!!! Loose your license!!!!","commenter_a":"Put an arrow through her head!","post_message":"NEW DEVELOPMENT: The case of a veterinarian fired over a Facebook post of a cat with an arrow through its head is heading to the DA for charges."},{"comment_id":"1643657415907529","commenter_b":"Literate people too lazy to read...","commenter_a":"And...this thread has made me loose hope for humanity.","post_message":"What is it and why is this happening?"},{"comment_id":"1022890011112195","commenter_b":"well people you all know by now that the illegals are who and what is at the top of being cared for first and they receive what our own Military should be getting as well as the American people our men and women who risk their lives are just a # and after thought and these actions begins with THE PRESIDENT OF THE UNITED STATES who has no respect for any Military or the American people , prayers for all who serve and have served and and fought for this great Country and our freedom and what we stand for we need to clean out the Government offices starting with the WH oval office we need a real man put in that position one that will help America not destroy it","commenter_a":"its in my tat","post_message":"NEVER FORGOTTEN! The voice of the people"},{"comment_id":"817179565047318","commenter_b":",the problem is that these companies take too much Shit from their UNRULY customers.Customerst first..What about employees?","commenter_a":"The manager did NOT make the right call which is why they are out of a job!!!! You don't reward bad behavior. Companies don't have certain people to service certain customers!!! You have problem resolution departments or resolution specialist but in this case the customer was the problem!!! Options being \"mam we can certainly deliver your item(s) or we can refund your money but we do not have special delivery people\".","post_message":"The driver says he was told \"you are black, and they don't want you at the house.\""},{"comment_id":"10153321750847439","commenter_b":"LMAO love it! She is a low life who feeds on hatred","commenter_a":"It takes a lot for an atheist such as myself to be bothered enough to come on this page and attack a low life like Geller who has zero intelligence and is followed by a bunch of losers who are the love children of their mothers and uncles, but hey, we all gotta do what we gotta do.","post_message":"Amazing heroes providing security for free speech conference #motoons #AFDI"},{"comment_id":"10154095575861051","commenter_b":"Hillary ain't sending no one back she'll let the whole world here, terrorists included","commenter_a":"I just hope that when Hillary wins she will issue a deportation order for Ted's old man.and sends his goofy ass back to Cuba.","post_message":"Ted Cruz says Trump would absolutely be a better president than Hillary Clinton, so he'll be casting his vote for him this November. Do you feel the same way?"}]
