[{"comment_id":"10154026339057464","commenter_b":"Wisconsin people must have cheese for brains! How else can you explain why they are listening to Mitt and the Republican party supporting Cruz.! With Cruz you'll get another Bush style government paying higher taxes and less jobs! Only Trump has a solution to bring jobs back to America!","commenter_a":"I want the media to go after Cruz like they have gone after Trump. They are so biased and they make me sick. Media, please ask Ted this question: Have you been unfaithful to your wife? AND don't stop asking him until he answers that simple question!","post_message":"It's not too late to enter to win tickets to the championship game in Houston --> @webpagelink"},{"comment_id":"812922865409803","commenter_b":"Imagine being the daughter of the two biggest a$$es in recent history - how would YOU react?","commenter_a":"she is a teenager, let her alone .... I am as anti-obama as the hext person, but geeeeeeeeeeez ... don't attack a kid","post_message":"Why is she supporting this?"},{"comment_id":"10153378828583984","commenter_b":"Yes","commenter_a":"Yes","post_message":"The Obama Administration’s pattern of rubber stamping these cases has significantly increased this percentage in the US. Do you support securing our border?"},{"comment_id":"1669966499994538","commenter_b":"Dumb. Completely fucking dumb if you vote for her. Please, take her and leave the country.","commenter_a":"WHAT A WEB WE ARE WEAVING , A WOMAN CAN BE PRES. JUST NOT THIS LYING WOMAN,WHO COULD BE PROUD OF HILLARY FOR PRESIDENT.","post_message":"Michelle Obama got emotional when speaking at the Democratic National Convention, as she remarked that \"Because of Hillary Clinton, my daughters...take for granted that a woman can be president.\" @webpagelink"},{"comment_id":"1191302950909160","commenter_b":"Time for the Trump wall","commenter_a":"we don't care that much where they come from, we only care to DEPORT them ASAP","post_message":"UNREAL! Look how many illegals from other countries are now coming in through Mexico!! WHERE they are from is ALARMING! @webpagelink"},{"comment_id":"10153137583782293","commenter_b":"What's this?! Women get butthurt on the Internet? Get out...","commenter_a":"Wait, what? Women actually care to attract men? I thought they'd much rather prefer to smugly ignore the existence of all men in public settings so as to artificially build their own self-esteem. Your mileage may vary, I suppose.","post_message":"\"Fear not. Since Eve, woman has been responsible for the fall of man, and again, we shall prevail.\" via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"10153007949671636","commenter_b":"Cannot stand her!","commenter_a":"@username - your favourite!","post_message":"'What's wrong with you?!'"}]
