[{"comment_id":"10153514086261955","commenter_b":"Still trying to jump that fence huh? @username ...better hurry before that Trump wall gets built.","commenter_a":"It's not that hard to figure out why Trump is doing so well. People are so tired of politically correct politicians.","post_message":"Pollsters dumbfounded by Trump..."},{"comment_id":"1264285906955844","commenter_b":"Agree public should not enable bad behavior from 15 year old kid.","commenter_a":"She ain't no child, she wanted act grown, so she got treated likes she grown. Please don't sympathize with her, you are only enforcing the behavior that she is a 'child' and she can get away with anything.","post_message":"'The juvenile had to be detained.'"},{"comment_id":"10153265498530047","commenter_b":"'@username over 5million LOL. Dead people and illegals","commenter_a":"SIGN THE PETITION / CLICK ON WEB SITE Justice Scalia one of the most brilliant and ardent defenders of the Constitution has just passed away. This is a huge, deeply felt loss. We must not forget that the next justice could impact the Court and the direction of our nation for decades. The American people deserve a voice in this decision: @webpagelink","post_message":"President Obama will stop at nothing to force his nominee for the U.S. Supreme Court through the Senate before his last year in office comes to an end.      But we can stop this from happening.  SIGN & SHARE our urgent petition to the U.S. Senate today: @webpagelink"},{"comment_id":"1080661608696757","commenter_b":"Stfu!","commenter_a":"Way to go Lebron!! Millionaire rappers should do rap outs in support of someone who pointed an EXACT replica of a Colt 1911 at police. Yes it was a pellet gun, but if the child was educated at home on gun safety and how to never point anything that resembles a gun at police officers he would be ALIVE today.","post_message":"'This issue is bigger than me; it’s about everyone. And gun violence and tragedies and kids losing lives at a young age, some way, somehow we need to understand that that matters more than just an individual.'  - LeBron James"},{"comment_id":"10153324881199312","commenter_b":"1 in 100,000 people infected with measles died before the measles vaccine, meaning even if EVERYONE caught measles in the USA today only 3,000 would die, BUT thats if EVERYONE in America caught it, not millions, and because we take care of ourselves and wash our hands and eat slightly healthier that would not be the amount today anyhow, measles does not mean instant death, and if one more person tries to spread 'herd immunity' crap I'm gonna lose it, it's not real! We do NOT have herd immunity!","commenter_a":"What concern. Everybody got measles when I was a kid.","post_message":"More than 1,000 students are exempted from measles vaccine in St. Louis area schools. Tonight at 10, 5 On Your Side investigates the concern, the controversy and how quickly an outbreak could occur."},{"comment_id":"950390221741940","commenter_b":"here comes people saying. 'no deport them all' and stuff. and yet they forget who really made America. found by immigrants. the Irish had a very hard life back then, the hate saying this word, African Americans had a harsh life, people whats the difference between illegal immigrants and legal immigrants. a legal immigrant can be much more dangerous than an illegal. look what happen in 9/11. Boston bombing. ect. and how is it that an illegal can have a job, without knowing the English language. no American education?? the come here, and still believe that the American dream is still alivem but we Americans are the ones that destroyed it.","commenter_a":"THAT'S the way! No one is 'illegal'. We are ALL human beings and should treat one another accordingly.","post_message":"'We need to take 11 million undocumented people out of the shadows, out of fear, and we need to provide them with legal protection,' Sanders said."},{"comment_id":"10154460904419411","commenter_b":"Nonsense. Religious claptrap has been indulged enough. They will never be satisfied.","commenter_a":"It's not OK. A country which excel in development like Swiss, must receive new minorities than traditional aliens. Therefore if you never had Buddhists, you will receive them make sure you also received their way of ideology. This is an article of Human Rights 'Freedom of Religion'.","post_message":"girls, whose names were not disclosed, said their religion prevents them from participating in compulsory swimming lessons with males in the pool at the same time.'"}]
