[{"comment_id":"10153647988748145","commenter_b":"She should have hit their dumb a$$es with it. Now run tell that","commenter_a":"WTH?","post_message":"After 40 minutes of trying to convince the security team that removing the prosthetic wasn't necessary, the woman was led to a private room where she was asked to remove her pants and take off her leg."},{"comment_id":"1119467821481588","commenter_b":"Yay!!!","commenter_a":"Exactly his point!","post_message":"San Francisco 49ers quarterback Colin Kaepernick says he has received death threats for making his views known"},{"comment_id":"10153436441037439","commenter_b":"STFU mooslins and go back home.","commenter_a":"Not me Jesus is Lord.We are not under any bondage to fear any thing.They are fighting a losing battie.","post_message":""},{"comment_id":"10153702146296491","commenter_b":"Huh ...well suck his dick already","commenter_a":"John Drumpf Miller and his toxic orange implants.","post_message":"Megyn Kelly: \"I would say the hair is real. I have laid hands on it personally.\""},{"comment_id":"10152521923501135","commenter_b":"The automakers would like to sell you a new vehicle sooner rather than later.","commenter_a":"Jennifer A. Thompson","post_message":"Do you really need to idle your car on days like today? We separate the facts from the myth. WHAT WE FOUND: @webpagelink"},{"comment_id":"10153140551051051","commenter_b":"Absolutely. It's a broken system. What I don't get is that in any other country if you enter the country illegally, you get sent back. Why is it soo hard here for that to happen? It's a bigger problem then an illegal person killing another person. Maybe it's time to close the borders and get our country and its laws in order?","commenter_a":"deport trump to mexico...","post_message":"The man who had been deported 5 times before killing an innocent S.F. woman entered a surprising plea. Do you think he's an example of how the current immigration policy isn't working?"},{"comment_id":"1113947365314026","commenter_b":"@username you piss with the men, but u have no balls,bitch","commenter_a":"PRETTY SOON IT WILL BE A JOY TO VISIT NORTH CAROLINA","post_message":"North Carolina: Land of Fewer and Fewer Progressive Wingnuts by the Day!"}]
