[{"comment_id":"10153752277268984","commenter_b":"Hell No!!! Women in combat will be a liability and not an asset!!! I am all about women achieving their highest, but to EVER say a woman physically has the same strength as a man, is absolutely false!! Our culture teaches males to protect females, our Military does NOT need that liability in battle!!!!!","commenter_a":"Sorry ladies but I feel that only a few of us can fit certain gender roles in many male jobs. No standards should be lowered to make women fit . Some can apply but not all can make it.","post_message":"Shortly after the US military lifted its ban on women serving in combat, the Marine Corps began a year-long experiment - here's the result... What do you think about women serving in combat?"},{"comment_id":"10154056167770329","commenter_b":"For Christ's sake lady give it a rest!!! Please get yourself fixed and do my reproduce we don't anymore people like you. And if you've already reproduced I pray for your children. Now kindly fuck off and go find someone else to annoy. Seriously anyone else. The other girl got the message why can't you??","commenter_a":"So stupid. Blackface doesn't make someone racist.","post_message":"IMPORTANT REMINDER: It's never okay to wear blackface!"},{"comment_id":"10154590275170586","commenter_b":"Which wife is she again?","commenter_a":"It takes a real woman to critize Melanie Trump. She is elligant. She will make a better First Lady than Bill Clinton will make. She hasn't hurt anyone. How can you even mention her name.","post_message":"Lady Gaga has joined the chorus of those criticizing Melania Trump days after the would-be first lady gave a speech decrying bullying online."},{"comment_id":"10153520838606051","commenter_b":"She needs to go to prison, too. Hope they sterile her so she can't bring anymore babies into this world for her husband","commenter_a":"Your husband should be on death row, and never see the light of day. To murder an innocent baby shows the cowardice and evil in his heart. He can't be allowed to live...he's a threat to society. One question...how can you defend his actions? He MURDERED your BABY...absolutely disgusting, both of you.","post_message":"This woman's husband was fed up with his son crying so he hit him so hard that it killed him. Now, she has one message for all the people criticizing her husband."},{"comment_id":"1201903546502686","commenter_b":"No way, he works at Wal Mart today. He made something of himself.","commenter_a":"Is she related to the banjo player in \"Deliverance\"???? Same eyes!","post_message":"It’s a shame, but I guess we shouldn’t be surprised by Hillary Clinton’s attempt to politicize another tragedy to advance an anti-gun agenda. As this analysis rightly points out, Oregon has some of the strictest gun laws on the books, and none of these proposed new laws would have stopped these awful shootings in the first place. We all want to stop these senseless tragedies, but using them to push unconstitutional, unrealistic, and ineffective new laws in order to win favor on the left isn’t going to help. I’m a gun owner myself, and I strongly value the rights guaranteed in the Second Amendment. The overwhelming majority of gun owners are law-abiding citizens who strictly follow all applicable state and local regulations. I will oppose any effort to take away the rights of law-abiding American citizens to own firearms."},{"comment_id":"10154038278856990","commenter_b":"My prayers and condolences for the family. Heartbreaking.","commenter_a":"This is horrible.... I am not sure what escalated it into him putting one guy in a headlock and then getting stabbed by the 2nd guy, but I really feel for his family. All those babies will never be able to experience a completely happy Christmas again. :(","post_message":"A father-of-four went to Target to buy gifts for his children on Christmas Eve, but was stabbed to death as his 4-year-old son watched. A witness said the victim confronted a pair of men who were allegedly playing vulgar music in the toy section. @webpagelink"},{"comment_id":"10157131061465354","commenter_b":"She should have hung herself with the noose. That'll show em!!!!","commenter_a":"Tighten that noose!","post_message":"+++FIRESTORM+++"}]
