[{"comment_id":"1298762416842950","commenter_b":"Actually W paints pretty darn decent pictures.","commenter_a":"nobody expected Bush to paint like a 5th grader. Okay, yeah we did.","post_message":"Don't expect him to stay home and take up painting."},{"comment_id":"944666172296302","commenter_b":"She's has a mental illness","commenter_a":"At this point she's coming across as delusional and totally disingenuous.","post_message":"“It means that I have really gone there with the experience in terms of being a mother with two black sons.'  -Rachel Dolezal on being black"},{"comment_id":"1131104760243867","commenter_b":"Because no feminist says that.","commenter_a":"So when feminists say, genders should be separated in school, it's just a valid opinion. But if a straight white male says the same thing about science labs, it's sexist? How does this logic work? Oh, sorry, I forgot it isn't logic, it's stupidity. ;)","post_message":"I'm crying with laughter over some of these."},{"comment_id":"10154362431207293","commenter_b":"'@username She may surprise you.","commenter_a":"Pennsylvania must be filled with idiots. The KKK and White Supremacists have always held high number of members in that state","post_message":"“Put in Trump and we’ll win again,' one voter said."},{"comment_id":"10152949520761519","commenter_b":"FWIW: Jesse, I love your points of view. Over the years your passion and knowledge have helped me evolve my own perspectives on politics and the news. However, I respectfully disagree with your use of pejorative terms to describe women in this fashion. I think it is as much demeaning to you, and women at large, as it is to the targets of your invective. I respect your assertion of your right to use these terms, and you have articulated to me in the past why you choose to use them. I respectfully disagree with it.","commenter_a":"Those Fox News bitches really whore it up with the make up, don't they?","post_message":"'You can’t separate fiscal issues from social issues...'"},{"comment_id":"10152968850756519","commenter_b":"Affirmative action laws are in place. Maybe she could work to eliminate them all so that we all get a equal opportunity in education, employment and business instead of posing as a woman of color and cutting in front of EVERYONE ELSE in line..lol, Caitlin Jenner can cut in right behind her.","commenter_a":"1 Rachel Dolezal = appropriation/ race traitor and an abomination. 1 million 'Rachel Dolezals' = 1 million 'less racist' white people, who are fighting for the advancement of colored people. Weird to think about.","post_message":"Rachel Dolezal finally speaks: 'As you probably know by now, there are questions and assumptions swirling in national and global news...'"},{"comment_id":"10153426857830329","commenter_b":"Faketalian !!! Grossest shit ever.","commenter_a":"'@username oh my gawd we need to go","post_message":"We all knead this."}]
