[{"comment_id":"956693264446697","commenter_b":"If my 2 daughters were still in school now and this begins I would not send them to public school it would be private or at home its just not safe, I don't have a problem with transgender boys don't belong in giur!s bathrooms and visa versa","commenter_a":"Wow..that's a big problem..!..put a extra bathroom in for Transgender..simple..problem solved..","post_message":"President Obama recently said all public schools must allow transgender students to use the bathroom of their choice. Let us know your thoughts below:"},{"comment_id":"477526855778749","commenter_b":"@username It won't because its Racist...You that Dumb??","commenter_a":"Celebrating Diversity while excluding whites is NOT Diversity. It is Discrimination.","post_message":"“Seeking NON-WHITE men and women, ages 20s to 30s, for Broadway and upcoming Tours!” the casting notice for \"Hamilton the Musical\" read."},{"comment_id":"950451268383973","commenter_b":"I look forward to never looking at this Obummer again!","commenter_a":"Why is it everybody is out to get Trump? It seems to me they are so scared he may get President they have stooped to the lowest ways to destroy him....it just wants me to vote for him more because they are scared he will and the fact is it will ruin the political garbage at the white house who are trying to bring our country down.....I want our Country back and the Constitution back to what it was meant to be!!!!!","post_message":"“Good luck with that…We’ve got serious problems here.” President Barack Obama addressed Donald J. Trump's plans to build a wall and get Mexico to pay for it."},{"comment_id":"895447730553834","commenter_b":"You can both GFYS , typical ignorant trash","commenter_a":"Fuck the Oneida nation","post_message":"Mayor Patrick O'Connor said the long-time village seal shows a historic wrestling match between village founder Hugh White and an Oneida Indian that figured into good relations between early settlers and the Oneidas."},{"comment_id":"1001578793209206","commenter_b":"I should hope so. I thought charges had been brought before the court. Let's hope these 2 black women thugs go away for a long while and go to finishing school. Sarcasm intended","commenter_a":"Way to be behind in the news. Also i believeit was in indianapolis and the girl has been arrested on an unrelated charge. Yup mainstream news media at its best","post_message":"Shocking video out of Texas where a woman holding a child was assaulted by two other women."},{"comment_id":"10153717655651323","commenter_b":"I'm sure mosques will be very useful for Syrian refugees in Germany. Are you for real?","commenter_a":"Focussing on mobile phones while poor syrians are getting genocided by poseidon in the mediterranean? Fucking white neonazi shitlords.","post_message":"You will soon be able to ignore your friends and family in Europe as well as at home for no extra cost."},{"comment_id":"1812447718973572","commenter_b":"Trump could not be trusted with his own password on Twitter!","commenter_a":"Habeis conseguido que este mas hasta los huevos de los que hablan de Donald que del pato.","post_message":"Only four days until the inauguration! Who will be meeting president-elect Trump today?"}]
