[{"comment_id":"10153423270403837","commenter_b":"'@username I don't think @username hates gun owners... But @username brings up a good point what are the consequences for this happening? Other then the fact she was shot! She should be fined and her gun license stripped until she completes a gun safety class! Even if she attended one in the first place to own her guns. She obviously wasn't paying attention when the part of trigger locks was brought up! But sadly she will probably not have to change anything about the way she practices gun safety and I'm sorry but that's wrong! Again she's lucky the kid didn't blow its own face off! I really think we should be able to own guns but not if you're not responsible about it! Gun owners are all jacked up about this but, every gun owner I know would never in a million years let this happen! Including you! You're ...","commenter_a":"I read the comments here from people laughing and saying they don't feel bad for this woman. You people are so filled with hate towards gun owners it's sickening. Yes this seams clear cut to me this woman didn't use common sense with her firearm I may even go as far to say she not to bright for leaving a firearm in reach of a kid But the hate that comes from you people I don't understand. What if she left a kitchen knife out and her kid hurt her with it Or had the kid in the car running and got run over by the child Would you all feel bad for her? We all make mistakes and Some worse than others but put you petty gun hate aside and give her a break. Someday you might make a mistake and hit someone with your car It can happen ...","post_message":"MOM SHOT BY SON - A Florida mom who appears to be an ardent pro-guns supporter is in stable condition after being shot by her 4-year-old son."},{"comment_id":"1218171641599870","commenter_b":"She's a COOK","commenter_a":"Wow! Mr. Anderson Cooper. Thank You!! It gives me hope for CNN.","post_message":"Anderson Cooper must have hit a nerve! He just suggested to Elizabeth Warren that the Democrats might be 'out of touch', and she was NOT happy."},{"comment_id":"10153645551275575","commenter_b":"Who cares about Mexican officials ? Why don't they keep their people there in Mexico ?","commenter_a":"I STAND WITH TRUMP!!!","post_message":"Sounds like a good idea!"},{"comment_id":"10152853251337217","commenter_b":"No one is trying to say being plus size is a standard but there are plus size women who love their body and would not like to be ostracized for loving themselves the way they are. But these underweight model can start a trend of anorexia because girls WILL starve themselves to be like that","commenter_a":"They don't do that with the obese women... ¬¬","post_message":"Ad featuring 'unhealthily underweight' model is deemed 'irresponsible'"},{"comment_id":"10154172496221717","commenter_b":"Indiana needs to leave the transgenders alone!!!","commenter_a":"They refused to hear the bill and it's officially dead.","post_message":"Freedom Indiana warns that the the proposed legislation 'could be used to target transgender individuals for discrimination and harassment.”"},{"comment_id":"1182572491799444","commenter_b":"Mj we are talking about the ones that come here and are here illegally. You became a marine and I bet you did it the right way. Now we have a big problem with terrorist that are sneaking into all the countries. Sorry but we have to take care of all Americans first. You have to admit a country can only hold so many. Thank you for your service I am a vet myself so are my son and daughter.","commenter_a":"All these racist comments and generalizations. You should all be ashamed. I am cuban and came to the US. Im sure not many of you can say the same but i actually benefitted from government programs. I served our countries military as a marine, i hold three different degrees - accounting, finance and im a registered nurse- sonif an immigrant is taking your jobs then you didnt take full advantage of what the US has to offer, no just arrived unprepared laborer will ever take any of thoae jobs from me. I love thia country but i hate people like you that put down immigranta that only want to make a better life for themselves and family. You are whats wrong with the US today!","post_message":"Right?"},{"comment_id":"10153995983694203","commenter_b":"should be a white woman","commenter_a":"Michael Jackson had a deep-seated race problem. Or an Elizabeth Taylor fetish...","post_message":"What the f*ck?"}]
