[{"comment_id":"10153574681028010","commenter_b":"To bad DHS doesn't enforce our laws...she should be returned with millions more just like her.","commenter_a":"Go back then.","post_message":"“I thought I came to this country to escape abuse, mistreatment and disrespect. But it's the same here.”"},{"comment_id":"10153434470306323","commenter_b":"Vahan alko tanssijalkaa vipattaa :D","commenter_a":"Nora ootkos tanssinut taas?","post_message":"Five passengers were injured after a train derailed at Mumbai's Churchgate station on Sunday. CCTV shows the local passenger train crashing into the barriers and partly mounting the platform. Officials have blamed human error for the incident."},{"comment_id":"10153632745068812","commenter_b":"Get her a feed bag and shut the pig up!","commenter_a":"Yet big oil is in her pocket","post_message":"\"You don't have to be scientist to take on this urgent challenge that threatens us all. You just have to be willing to act,\" she says: @webpagelink"},{"comment_id":"1520981961255162","commenter_b":"And this coming from someone that used an \"excuse\" to avoid draft?","commenter_a":"This man is pitiful.","post_message":"Donald J. Trump suggested veterans suffering from PTSD are not \"strong.\""},{"comment_id":"873173032819817","commenter_b":"Why are so many women that insecure? Come on...","commenter_a":"No thats called someone having mental issues lol","post_message":"Warning to all couples."},{"comment_id":"222401854833654","commenter_b":"Build the wall","commenter_a":"Say it to mexico, who build the wall with...? u know the answer, and it turned up very good, no illegal immigration and less crime , Israel built the wall too, and no muslims terrorist attack, bulgaria and hungary have kinda wall/fence, and no attacks, there you go...","post_message":"Those who don't know history are doomed to repeat it Details: @webpagelink #BerlinWall | #TrumpsGreatWall Join Us The Free Thought Project"},{"comment_id":"10156282182225354","commenter_b":"Why are they even getting licenses??","commenter_a":"Lord, don't even let me go there, cause my head will explode............","post_message":"Illegal immigrant activists complain that Colorado's illegals aren't getting their driver's licenses issued quick enough. Seriously..."}]
