[{"comment_id":"1428416493869569","commenter_b":"She, that was a woman officer","commenter_a":"watched the video again lucky nobody was shot what people need to remember officers have a family too they want to go home in one piece he should have drawn his weapon but he still would have been the bad white cop","post_message":"MUST WATCH: Two people face assault charges following a wild brawl with a police officer in Nashville."},{"comment_id":"10154485862326037","commenter_b":"Sure, if you choose to believe the people in collusion with the election fraud.","commenter_a":"If you wanted unity, you should have allowed the voters to choose the nominee instead of allowing your corporate masters to do it.","post_message":"DNC chair Marcia Fudge calls for unity amid a chorus of boos and jeers from Bernie Sanders supporters: \"We're all democrats\""},{"comment_id":"1191420990909535","commenter_b":"Really??? I use my pants to hide this dick!!!!","commenter_a":"I'm sorry","post_message":"Military intelligence... isn't. ~Will"},{"comment_id":"10153359529326051","commenter_b":"I would have beat her ignorant ass with a stick too. Hopefully karma hits her with a Mac truck.","commenter_a":"And that is why I dont trust daycares","post_message":"When this woman's 2-year-old son came home with these marks on his leg, she marched down to his school and demanded to see the surveillance footage. Now she's even more outraged."},{"comment_id":"1303998932977651","commenter_b":"Your a straight up pussy for that one. News flash dumbass your girls a ho","commenter_a":"A \"real nigga\" dont sneak shit..look like he aint wake dude up till bout the 5th punch..weak shit 😂😂","post_message":"He beat his a$$! #WSHH"},{"comment_id":"10154079954761833","commenter_b":"hopefully some illegal alien or muslum will off her with a hammer .","commenter_a":"More people are killed with hammers in the US than guns each year. Why isn't she calling for tool manufacturers to be held liable?","post_message":"When Hillary Clinton says that the firearms industry is only business in America that is wholly protected from any kind of liability,\" she is not telling the truth. Gun manufacturers and companies are responsible for bad products. What they are not responsible for are bad people who misuse their products."},{"comment_id":"10157168676140293","commenter_b":"Get off it already. There are bigger issues in our country to deal with such as gun control, racism and all these shootings, immigration, abortion, same sex unions, and the list goes on. Not whether or not she used the same words as our current first lady or not. I don't care if she copied the whole speech word for word as long as he can put our country in better shape than out current president and first lady.","commenter_a":"Not her fault...She just read what they gave her.. Don't blame her...","post_message":"Melania Trump's speech last night at the 2016 Republican National Convention is now the subject of a plagiarism controversy. READ why some are saying some of her words were lifted from the current First Lady:"}]
