[{"comment_id":"10156113177590725","commenter_b":"'@username What was your last name @username again? we really need the wall!","commenter_a":"Like you always say China is eating our lunch.","post_message":"Depression- be careful of China!"},{"comment_id":"10154069186973967","commenter_b":"Yeah how dare she have an opinion, why didn't your whore mother have that coat hanger abortion she wanted?","commenter_a":"Check your shit together before basing bias yo..she was more concerned about her own BS and not about Nintendo. Also you have to be THIS goddamn retarded to lose an awesome job at Nintendo","post_message":"Nintendo watched her become the center of a witch hunt and did nothing publicly to defend her."},{"comment_id":"10153223251130329","commenter_b":"What a nasty bitch.","commenter_a":"Wow that Katie chick is a bitch.","post_message":"Awesome."},{"comment_id":"10154018245628352","commenter_b":"Why kill the woman?... Just get a divorce and carry on with your life idiots!!!","commenter_a":"he was lying to her crazy ass....","post_message":"‘I want you so bad – if only someone was out of the way': Chilling texts Army medic sent to his mistress weeks before his wife was found murdered"},{"comment_id":"10153428206108984","commenter_b":"She needs prison time!","commenter_a":"As far away as possible","post_message":"Looks like this is coming back to haunt her...  Do you think Hillary Clinton needs to stay far away from the White House?"},{"comment_id":"10154114787935329","commenter_b":"LOL Chad.... Mom I'd be so mad!!!","commenter_a":"Chad Stacy Mike Deb don't buy these for the girls!!","post_message":"'Her butt-length hair is now chin length. I was lucky to save that much.'"},{"comment_id":"10153974696736943","commenter_b":"Double talk.!","commenter_a":"This is how you stand for law in government?","post_message":"Wednesday, June 01, 2016 Judicial Watch Director of Research and Investigations Chris Farrell appeared on'America's Newsroom' on Fox News Channel to discuss the latest developments in the depositions of Former Secretary of State Hillary Clinton inner circle regarding her use of private email while serving at the State Department."}]
