[{"comment_id":"10156457619055354","commenter_b":"She's only fit to lead her prison cell block at this point.","commenter_a":"Well, Hillary, if you hadn't enabled the enemy by letting the Benghazi attack go on, sending arms to our enemies, selling, for your own profit, 1/3 of our uranium to Russia and in many other ways letting terrorists know that it's open season on Americans, we wouldn't be having to listen to you whine that you want us all unarmed so we can't fight back.","post_message":"Unserious and out of touch."},{"comment_id":"604709916395876","commenter_b":"Is it all the bleach that makes Trump women stupid? They should do a study...","commenter_a":"This speech is ridiculous he's supposed to be a leader he's dividing people thinking he has power I'm embarrassed to say he thinks he represents all of us","post_message":"\"We are going to be the first state in the country to fight back on Washington.\" Boston Mayor Marty Walsh gave impassioned remarks at the rally ahead of the Boston Women's March for America.  @webpagelink"},{"comment_id":"10153992040756336","commenter_b":"This is a must read. I copied it from a post. These are things you need to know about Islam and Muslims. Allah IS NOT the same God who is worshiped by Jews and Christians. Allah is no more a God than the Golden calf of Egypt. Allah predates Islam by over a thousand years, and was a minor deity in the Temple of Baal, the Canaanite Sun God, who was worshiped throughout the Middle East. Baal (ba'al) was an ancient Canaanite and Mesopotamian deity associated with agriculture. He was believed to be the \"giver of life\" and mankind was dependent upon him for providing what was necessary to sustain the farms, flocks and herds. Allah was the moon god who's sign was the crescent moon. Mohammad, born 570 years after the Birth of Christ, was very familiar with Judaism and Christianity and stole traditions from both religions to create ...","commenter_a":"Why does Christianity need protecting? It is the dominate religion and is afforded special privileges. Christians are just upset that they don't have the right anymore to force their beliefs on others.","post_message":"Donald J. Trump spoke about protecting Christianity during a speech at Liberty University today. @webpagelink"},{"comment_id":"865998906849825","commenter_b":"godless atheists,satanists THIS FUCKIN FUSE OF LOWLIFES WILL END SOON","commenter_a":"When we start seeing these statue like this around America , that means the devil have claimed this land, God is coming back soon ppl be warned","post_message":"Florida Agrees to Distribute Satanic Temple Materials To School Children"},{"comment_id":"10156396288885354","commenter_b":"If you want refugees you can have them but please build a containment wall around your state!","commenter_a":"Yes, if it is truly about safety, then they can stay in the Middle East, and we can help provide for them, which would be the right and just thing to do. They are human and most are probably good people fleeing a civil war. No need to be sent to the United States.","post_message":"\"There is no reason America cannot create a safe zone for these refugees in the Middle East. That is the most compassionate thing to do for them. It is the safest thing to do for America. The only reason Obama is risking the safety of Americans to bring them here is to feel sanctimonious and to divide us.\""},{"comment_id":"10153850699096955","commenter_b":"She got too big for her britches!!","commenter_a":"All of you hating on Kelly now, probably liked her before she decided she doesn't like trump.","post_message":"SCALIA'S SON BREAKS SILENCE"},{"comment_id":"10153576489935667","commenter_b":"Their aliens","commenter_a":"I wonder what it looks like now","post_message":"Experts have yet to identify their breed but guess they could have a bit of wild cat in their DNA."}]
