[{"comment_id":"1084778228228546","commenter_b":"they go around and touch people like mother theresa What is your POLICY?!","commenter_a":"The only barriers I have is the hidden files on JFK. Please be more of a transparent President and release all of the hidden files regarding my (past life) assassination. Thank You, very much.","post_message":"'We can open the door to every person in this country again.' —President Bill Clinton"},{"comment_id":"997888900251582","commenter_b":"this lady is crazzy.","commenter_a":"The Amerikan Taliban.","post_message":"Hey you! You should go to church every Sunday! And the government should require it. Because America and morals and stuff."},{"comment_id":"898000640266692","commenter_b":"True sir but he a bitch for that lol","commenter_a":"If he would have kept talking he could have ended up dead. People man have no chill, calling dude a bitch. He avoided confrontation!","post_message":"Cop Goes On A Major Power Trip After Being Asked A Simple Question!"},{"comment_id":"703909133102373","commenter_b":"Keep it going and that shithole country might be cleaned up someday👍","commenter_a":"the result is the same be it honor killing (Indian way) or random shooting of school kids (US way)","post_message":"India reports a spike in “honor killings” — but the numbers are probably even higher."},{"comment_id":"10155076076173987","commenter_b":"You do realize refugees are the ones fleeing the terrorists right?","commenter_a":"Well, Starbucks, you give 10,000 refugees easy access to kill 10,000 veterans. Yeah, great plan.","post_message":"“To those who would suggest Starbucks is not committed to hiring veterans, we are here to say: check your facts,' the Starbucks Armed Forces Network wrote in a letter to customers."},{"comment_id":"10152754691111051","commenter_b":"It's wonderful to know he has an optic nerve and so may one day be able to see!","commenter_a":"Why did they lie to her to start with !!!!!!!!","post_message":"This mom repeatedly asked why her new baby wasn’t opening his eyes. Doctors said his face was just a little swollen. Two weeks later, she found out the truth."},{"comment_id":"10153530669581955","commenter_b":"HahahahahagagagagagahahahahahagahahahahagahahahagahahahahahahahahahahahahahahahahahahHahahahahahahahahahahahahahahahahahahahahahaha. Fucking HA! The bitch was married FOUR FUCKING TIMES. Maybe..... Just... Maybe..... SHE'S the one fucking our morals over? Hmmmm maybe YOU are the one fucking our morals over? Hmm","commenter_a":"I admire you..I would have done the same thing if I were in YOUR position..they are destroying the morals of our society..","post_message":"JAILED FOR NOT MARRYING THE GAYS"}]
