[{"comment_id":"1088078934585187","commenter_b":"She is a pest!","commenter_a":"Does she not realise that her actions will encourage pest infestation of insects & rodents, germs will have a field day, right next to where she's raising her child?","post_message":"Some people are just scum"},{"comment_id":"606469089512450","commenter_b":"Cus Beyoncé just another weak ass bitch in the guise of some sort of strong independent woman.","commenter_a":"Except she didn't do any of this and stayed with the man that's been cheating on her (and before the beehive goes crazy, I love Beyoncé...but what I said is also very true...) soooo you can't be a strong independent woman who brushes aside the fuck boy...when you're still married to him. Now if she comes out and says that they are still married cause it's business but they sleep in separate rooms and have an open relationship then awesome for them...but it's not empowering women...its perpetuating the stereotype","post_message":"14 Beyoncé 'Lemonade' Lyrics For When Your Ex Texts You"},{"comment_id":"521473731374253","commenter_b":"Piece of shit impeach this Muslim before it's to latr","commenter_a":"Good every state should ban the refugees from any where. This is our country not theirs.","post_message":"List growing rapidly....America is waking up!!!!"},{"comment_id":"10153369236751051","commenter_b":"Bitch got what she deserved..","commenter_a":"I am happy for the boy to let his real self show that bully get what she needed..","post_message":"This boy tried to stay calm in the face of relentless bullying from a girl on his bus. Finally, he just couldn't take it anymore."},{"comment_id":"10154244294358132","commenter_b":"I love me who do you love? Stop posting naked pictures of yourself you hoe!!!","commenter_a":"Omg! She doesnt know what to do to get attention!","post_message":"Kim Kardashian West is letting it all out."},{"comment_id":"1256135284407480","commenter_b":"Er, spider silk has almost nothing to do with a spider's reproductive system, other than if some species use it for mating rituals. So I don't think you can rape a spider. If they were to take off the harmless pins, it would find a corner and immediately start building a web, because it's a spider and it has no conscience. The closest I can relate to this spider is giving blood.","commenter_a":"Wow. That's horrific and pretty fucked up","post_message":"Poor spider!"},{"comment_id":"10155008881554411","commenter_b":"Zeyad Hopkins : @webpagelink","commenter_a":"She didn't spark anger, in fact Saudis didn't care. But @username has a case against Saudi and the USA, and yes I don't like Saudi but let's not start spreading bullshit and hate","post_message":"Just days after Merkel said burka should be banned in her own country."}]
