[{"comment_id":"10154689577603812","commenter_b":"He also has many lawsuits in the 80's and 90's for discrimination against blacks and people of color.","commenter_a":"TRUMP STOOD UP FOR BLACKS AND JEWS: About 20 years ago the rich elites ran Palm Beach and wouldn allow Jews and blacks to use the golf and country club facilities. When he bought Mar-a-lago, MR. TRUMP WENT TO COURT TO END THAT DISCRIMINATION, won in court and forever changed how minorities are treated in Palm Beach. That THE REAL Donald Trump. What has Hillary or ANY politician done? @webpagelink","post_message":"A potentially record-breaking gap between two groups marks one of the most striking elements of preferences in the 2016 presidential race: college-educated white women for Hillary Clinton vs. non-college white men for Donald J. Trump."},{"comment_id":"10153111712291491","commenter_b":"Respectfully disagree. I like my women a pretty delicate flowers, but that's just me.","commenter_a":"She might be the all around inside/outside sexiest female of the 21st century!","post_message":"Ronda Rousey's next opponent: the box office."},{"comment_id":"10158012155960354","commenter_b":"Prosecute her! Drain the swamp!","commenter_a":"lock donna brazil up.........","post_message":"“Stealing valuable proprietary confidential information is illegal, and debate questions are highly confidential,” said Ken Sukhia, who served as United States Attorney for North Florida and who has prosecuted numerous white collar crimes."},{"comment_id":"10155187026858984","commenter_b":"I caught the statements that's she was making. I'm glad she wasn't as blatantly shoving her opinion down people's throats as Beyonce did. I applaud her professionalism but I still find her and her music repulsive. On a separate issue, how does get eaten alive for her unoriginality? It's like she can't decide who she wants to rip off more, madonna or David Bowie.","commenter_a":"Anyone who knows the meaning behind This Land is Your Land knew she made a political statement. I don't think that was very many trump voters, though. Her subtlety is what was appreciated by them because they likely missed it and it allowed them to enjoy the show.","post_message":"Of all of the things Lady Gaga could have done during her Super Bowl halftime show, this was perhaps the most shocking... and the most unexpected."},{"comment_id":"1236456179783965","commenter_b":"I was expecting a stripper jump on a pole. Boring.","commenter_a":"Nice speech, all lies","post_message":"Melania Trump speaks at the Republican National Convention. Watch the full live stream here: @webpagelink"},{"comment_id":"1112383468868962","commenter_b":"So she's been here illegally since 1993........of course she'd vote for a criminal.","commenter_a":"If Facebook was not a thrown for liberals, and they removed news pages for being one sided, this would be the smoking gun","post_message":"She survived the holocaust — and years later, she’s getting her citizenship so she can vote for Hillary Clinton @webpagelink"},{"comment_id":"610453139087868","commenter_b":"Fuck that arrogant asshole","commenter_a":"I hate this motherfucker.","post_message":"You piece of garbage."}]
