[{"comment_id":"10150745246359999","commenter_b":"More difficult than jamming his shirt into his pants","commenter_a":"*Insert Fat Jokes Here*","post_message":"Governor Chris Christie must now cram his vast political ambitions back into a space the size of New Jersey."},{"comment_id":"814364195330989","commenter_b":"Do that shit over here!","commenter_a":"and they wonder why most of Americans don`t want them here,Trump is right.Not all muslims are killers,but how would we know>?","post_message":"VIDEO: This is What Muslims Did in The Streets After Orlando Massacre…"},{"comment_id":"10153445196113984","commenter_b":"She has no right to control any thing!","commenter_a":"Not only does she not have any class, she is ugly and gross! I do not care if she is republican or democrat she is just nasty!","post_message":"This has to be very embarrassing for the First Lady. Hopefully this doesn't make her try even harder to control Americans...  Do you think Michelle Obama as First Lady is bad for America?"},{"comment_id":"865416670223607","commenter_b":"Your mother is a dumb fuck you ignorant whore.","commenter_a":"WW3","post_message":"Turkish F16s warned the jet over the airspace violations before shooting it down, the military official said."},{"comment_id":"10154429812461051","commenter_b":"Damage fags","commenter_a":"Impeach Trump","post_message":"The World Bank claims Trump could be the best thing to ever happen to the American economy. Do you think they're right?"},{"comment_id":"10153169803431336","commenter_b":"She put her hands on her kid. I would of laid her flat too.","commenter_a":"every single student involved should be place in juvie. If the teacher isn't given justice she should sue the school for a million. no teacher should put up with that kind of sh&& from a parent or students. School's do not give teachers the support they need when the students act like animals","post_message":"Annika McKenzie allegedly put the teacher into a headlock and threw her on the ground. Then, several students reportedly began kicking and punching her while she laid unconscious."},{"comment_id":"10155130620974060","commenter_b":"Yeah Yeah okey then you are one of those...","commenter_a":"UK will go out on a Friday and apply to go in on a Monday....that will suit the FTSE trading too....","post_message":"If the public is to turn against Brexit, it will do so on its own terms. The task of Remainers is to be ready"}]
