[{"comment_id":"10152732363406051","commenter_b":"...women who don't have vaginas? WHAT?!?!?!","commenter_a":"If he has a pussy and she has a pecker you call them 'heshe's! If he has neither a pussy or a pecker and she has neither a pecker or a pussy you call them awfully damn horney! In Another vernacular you might just call them freaks of nature! Them the question is what do you feed them? One thing is for sure! They won't reproduce!' Put them in a side show at the fair. Pay your money, go in, hoot and holler, laugh until you pee your pants. Now got to work Monday morning telling everyone what you did and saw! Then you will find out who the real freak is!","post_message":"This all-women's school will no longer perform the 'Vagina Monologues' because it doesn't want to offend women who don't have a vagina."},{"comment_id":"10153209825548445","commenter_b":"Not if you make the tincture right","commenter_a":"Don't make edibles at all. If you want an edible high, just buy/make tincture and eat it with cookies. Or just eat the weed in fillable capsules: 1. Decarboxylate your Dry herb 2. Fill swallable capsules with dry herb 3. swallow capsules with food and drink","post_message":"10 Commandments of #Marijuana Edible Safety"},{"comment_id":"10154383747512908","commenter_b":"Pussy","commenter_a":"It will never stop. Americans absolutely love guns and violence. The NRA owns this country. I got my passport so I'm outta here.","post_message":"Mass shootings are becoming an almost-everyday occurrence in this country. This sickening and senseless gun violence must stop."},{"comment_id":"1112148695548048","commenter_b":"Imagine if Hillary did all the finger wagging that Bernie does in debates?","commenter_a":"Men can get away with anything this election season that women (Hillary) could not. Waving their arms, swearing, making fun of people...anything goes.","post_message":"Social scientists have found the exact same affect by a woman simply doesn’t play the same way."},{"comment_id":"10154473898974411","commenter_b":"@username stick to your supermarket shopping you dumb f","commenter_a":"So many ignorant people commenting on this. This is a traditional harvest of one of the only renewable resources the inhabitants of this barren rock can survive from. Educate yourselves.","post_message":"'The ordeal began this morning when locals spotted a pod of between 100-150 pilot whales'"},{"comment_id":"10153639008667098","commenter_b":"Down the street prima","commenter_a":"@username @username not near you guys?","post_message":"WOAH, that's a big sinkhole. It's over in Madera near Fresno and it's almost 20 feet deep.   Read more: kron4.com/2016/04/12/video-giants-sinkhole-swallows-street-in-madera/"},{"comment_id":"10153264678366336","commenter_b":"98 percent of the illegals don't show up for their hearing.","commenter_a":"All future liberals lol.","post_message":"Some judges believe the backlog is expected to get worse."}]
