[{"comment_id":"1202757773119671","commenter_b":"Yes Ivanka Trump would not be anywhere without her rich daddy!","commenter_a":"If it was not for her family name no one would listen to a word this really stupid spoiled brat has to say. You actually have to do something or have accomplished something to be a voice worth listening to and this twit as done nothing. Additionally hanging around with a child molester like Dunham shows just how pathetic she is.","post_message":"Chelsea Clinton tried to shame Ivanka Trump on live TV, but it immediately blew up in her FACE! This proves that Hillary Clinton has NO CHANCE!   Let's get 3,000 SHARES to show that we don't need a Clinton anywhere near a position of power!"},{"comment_id":"10153203209001336","commenter_b":"THANK GOD THERE ARE MOTHERS LIKE HER I WOULD DO THE SAME THING IF IT WAS MY KID!!","commenter_a":"Lets hope she isn't accused of child abuse!","post_message":"VIDEO: A woman is seen beating a rioter in Baltimore. It turns out he is her son."},{"comment_id":"10152956106239877","commenter_b":"It always existed except my dark skinned Sista women had it worse.","commenter_a":"True statement Colorism exist","post_message":"'Empire' Actress Grace Gealey: 'I Was Discriminated Against For Being Light-Skinned.' Read more on her revealing statements here.  Grio fam, sound off with your thoughts on all she had to say."},{"comment_id":"10155508321034778","commenter_b":"Round 'us' up ans ship us out? Why would they round up and ship out legal immigrants or citizens?","commenter_a":"No. they are here to serve and protect us. Not round us up and ship us out. That's not part of their job. That's ICE's problem and a federal issue. They want people out then they can do it themselves.","post_message":"Should local police departments participate in immigration raids?  Explain why and your comment could be used on #OffScriptOn9 at 7 p.m.  Full story-->@webpagelink"},{"comment_id":"10153072554446037","commenter_b":"Feed her to the hogs","commenter_a":"Bye bye","post_message":"#Jordan will execute Wednesday a woman on death row over a failed bombing after the government vowed to avenge the murder of a pilot by the #IslamicState group, an official said."},{"comment_id":"10154568633769411","commenter_b":"'@username, fuck cows!!","commenter_a":"It's really strange, Facebook isn't offering me a chance to superimpose the Pakistani flag over my profile picture. It's as if they dont really give a fuck unless it suits the agenda of the overlords of western governments.","post_message":"The Khorasan province branch of ISIS has claimed responsibility for the attack"},{"comment_id":"10154743598641323","commenter_b":"Yep. Greedy bastards.","commenter_a":"Ladies and gentleman. I present to you - Capitalism at its finest......","post_message":"Michelin-starred TV chef Michel Roux Jr. has been paying some kitchen staff at his Mayfair restaurant less than the minimum wage, the Guardian can reveal, while charging over £60 for one starter."}]
