[{"comment_id":"1941882042704784","commenter_b":"And some will just because it's a female!!","commenter_a":"I'm speechless!!! It's incredible what that vile woman has gotten away with! I've lost all hope in this government and country! It's bad enough she's gotten away with MURDER but to think of the multitude of fellow Americans who'll vote for her is an atrocity!!","post_message":"'Yes, [Donald J. Trump] is far better to be commander-in-chief than Hillary Clinton in my mind. I don't think Hillary Clinton is going to do any of the things we need to do to get this country back on the right track. More importantly, I think she has been holding herself to a different set of standards, and I don't think that is representative of what we want to see in the White House.' — Speaker Paul Ryan"},{"comment_id":"968962986483662","commenter_b":"Exactly @username. @username, has already contradicted herself more than once. She is all over the place. That's one weird Troll.","commenter_a":"Barack Obama has done more damage to the USA then all past presidents put together...............He lies continually, he is anti-police, pro-thug, anti-life for gay marriage..... he says he is Christian but his fruits of his works are anti-Christ.....he sides with Islamic terrorists....goes against are biggest ally the Jewish Nation and has done everything he can to bring racial division to this once great nation. Treason is an understatement!!! Why don the Senate evoke the NUCLEAR option so to force our Divider and Chief veto all of the bills coming out of the Senate??? We the people should elect a person who will obey our Constitution and has faith in God, and a person who truly cares for the people and our Veteran!","post_message":"In 5 days, Congress will have to send 'must pass' legislation to President Obama's desk to fund the government.  Sign your emergency fax petition urging them not to send a single penny of taxpayer dollars for abortion or abortion providers! Click here! @webpagelink"},{"comment_id":"1812875395612222","commenter_b":"'@username......................your a @&$)(:; fool","commenter_a":"Such a BS! Obama made a deal to stop nuclear proliferation. Iran's compliance with our demands lifted the sanctions. So they got THEIR money. Eric Trump is total idiot thinking he knows anything about this matter.","post_message":"'[President Obama] lied about it. He said that it wasn't ransom money... No different than when he lied about ObamaCare.'  Yesterday on 'Sunday Morning Futures,' Eric Trump accused President Obama and Hillary Clinton of lying to the American people."},{"comment_id":"1833528413366580","commenter_b":"I say build the wall right up to California and let them funnel in but the thousands and with this Joker figure out what to do with him he'll change his mind pretty quick","commenter_a":"They better stopp look and listen","post_message":"'There’s something called CEQA in California...'"},{"comment_id":"10153507892259203","commenter_b":"Figure out how to get guns from criminals. They won't follow the law and they the criminals are the problems. Use a little common sense. Let's fix places like Chicago were control is not working. Or do no lives matter.","commenter_a":"If you go by empirical data from countries with gun restriction laws to those that don't. ...it's a no brainer decision. ...gun control and restrictions DO work. The data shows less of these types of crimes. Does it completely stop gun related violence (where a gun was used to commit a crime)....NO. Does it lessen the chances of these crimes from happening. ..YES! Its been proven that there are less crimes where guns are used within countries with solid gun control laws...period. Every country that has gun restrictive laws and gun control is a prosperous nation whose avid hunters and gun clubs (shooting ranges) also prosper. Now if your argument and reason for no gun control is because you have the right to defend yourself...THEN you must also believe that the world would be a safer place if every country in the world had nuclear weapons to defend themselves... the ...","post_message":"Bill Maher blames right-wing media and Fox News for Charleston: 'They present a really twisted view.'"},{"comment_id":"10153545478606162","commenter_b":"She is a fake little creep","commenter_a":"hmmmmm, if she hates the way Americans eat why was she in a donut shop?","post_message":"ARIANA DRAMA: 'What the **** is that? I hate Americans. I hate America! That's disgusting,' Grande said when a tray of doughnuts appeared in front of her."},{"comment_id":"899130260122396","commenter_b":"Eat what we or go back to your own country.","commenter_a":"Just go away.","post_message":"OUTRAGE"}]
