[{"comment_id":"10153102018738822","commenter_b":"What is wrong with these women!?","commenter_a":"Dumb fkn bitch","post_message":"A mother has been arrested after she left her baby on the side of the road in Maryland this past weekend."},{"comment_id":"10153548931652550","commenter_b":"my only solution to this and advice to the american government is to stop allowing foreigners to come into the united states... I think this country has the worst imigration problem.","commenter_a":"Who trusts the Obozo regime to make sure no terrorist enter our country masquerading as refugees?","post_message":"Welcome to America: New photo shows newly-married couple who killed 14 people in California last week in a suspected ISIS-inspired attack, entering the U.S. together for the first time last year ... @webpagelink"},{"comment_id":"10153829501651337","commenter_b":"Humanity","commenter_a":"The amount of non judgmental compassionate comments on here is truly staggering","post_message":"HE'S KNOWN HOW LONG? Here's Charlie Sheen's HIV announcement..."},{"comment_id":"1260728277356755","commenter_b":"Can we talk about your taxes Trump and some of your wife's well kept secrets since you are always pointing your finger at everybody else!!!","commenter_a":"Instance 302-A when Trump is actually projecting himself.","post_message":"\"She also lacks the mental and physical stamina to take on ISIS and all of the many adversaries we face.\" - Donald J. Trump questions Hillary Clinton's health"},{"comment_id":"10153181723473984","commenter_b":"Put all of them in jail there all criminals","commenter_a":"He needs to go!!!!!!!!!","post_message":"Unbelievable! Boehner just gave Obama exactly what he wanted... Do you feel betrayed?"},{"comment_id":"1346170432096021","commenter_b":"@username What makes you think it's civilized? Is it the fact that mankind is about to lose it head (literally) to religious beliefs by people that still throw stones and rape like cavemen! I see your education come from ''acadamia\"! Which is also still in the dark ages!","commenter_a":"@username Nutt, a researcher at Imperial College, had to crowdfund this LSD study. He calls LSD research \"the worst censorship of science there has ever been.\" Read more: @webpagelink","post_message":"For the first time ever, scientists scanned a brain on LSD using modern technology. What they saw was a more \"unified brain.\""},{"comment_id":"857261721036748","commenter_b":"He is a terrible president regardless of anything else.","commenter_a":"I'm sick of this crap!...He's a great President..Who cares what religion he is?","post_message":"Scott Walker says he doesn't know if President Obama is a Christian."}]
