[{"comment_id":"1875772702705471","commenter_b":"These hoes aint loyal","commenter_a":"@username 😴","post_message":"So messed up  #WSHH"},{"comment_id":"10153163723737377","commenter_b":"She belongs in jail!","commenter_a":"And Huma's email said something about after her nap. Seriously this evil woman is too old to hold the highest office in the United States of America!!!!","post_message":"\"These new Benghazi emails are disturbing and show why Hillary Clinton and the Obama administration had to be forced to disclose them,\" said Judicial Watch President Tom Fitton in a release to Newsmax. Watch more on this tonight on Newsmax TV- Directv 349, Dish 223, Verizon FiOS 115, or Newsmax App."},{"comment_id":"10153231679439071","commenter_b":"But they're so nasty lol","commenter_a":"Hnsh Ltif ewwwww","post_message":"A company has created a replacement for water bottles that you can actually eat."},{"comment_id":"10156451475900500","commenter_b":"Fire her","commenter_a":"So this woman or all the people she was ordering food for did not have a cell phone to order lunch? It should have never been done with a 911 phone.","post_message":"DANGEROUS SITUATION- What do you think of her punishment?  @webpagelink"},{"comment_id":"1005304559506884","commenter_b":"@username wow dude! go tell that to china, india, russia...they pollute the air you breathe in an astronomically higher number , last i checked, the earth only has one atmosphere.","commenter_a":"God be with you and your team as you go forward for our great state of Kentucky.","post_message":"\"They bribe us with our own money to stick it to ourselves. And we will not do that anymore in the state of Kentucky.\""},{"comment_id":"979152762203038","commenter_b":"I just know I would rather believe in God and find out there is none than not believe and find out there is... God help us all...","commenter_a":"no wonder this country is fuc*d up and we are the laughing stock of the world. this Guys will vote dem and allow muslims in. the will be the first to loose their heads","post_message":"SICKEST THING I HAVE EVER SEEN! THIS IS CALLED DARING THE JUSTICE OF GOD. REST ASSURED AMERICA, A RESPONSE IS COMING FROM HEAVEN!  Leviticus 18:22, 20:13 Romans 1:24  NOW DO UNDERSTAND WHERE THIS IS GOING? ABOMINABLE!"},{"comment_id":"1280019028698326","commenter_b":"The football players that choose to disrespect all of the heroes that have died for this country, this anthem, this flag and unfortunately for them are lowest ungrateful humans that are part of the big problems of this country. I will not support the NFL in any form until they get rid of the garbage.","commenter_a":"BOYCOTT! Stop giving these spoiled brats their millions of dollars to play around. Then they will respect US!","post_message":"\"To protest against the flag, which stands for the United States of America, it's a disgrace. And if they don't like it they should go play football in Canada.\"  Jim Riches, whose son Jimmy was a firefighter killed on September 11, responded to NFL players like Colin Kaepernick and Brandon Marshall who are choosing to protest the national anthem."}]
