[{"comment_id":"1264843663556103","commenter_b":"Christianity will not be dead, extremist Islam will keep it from dying and drying out. BTW atheist here.","commenter_a":"Because \"Christmas break\" is very Biblical. -.- I am so sick of these people hijacking God and MY Faith for their asshattery and hate. It's repulsive and they are such an embarrassment. And this is why Christianity will be dead in the US within the next 50-75 years.","post_message":"This kind of ignorance has no business influencing school children."},{"comment_id":"10155017567319628","commenter_b":"That's a lie Muslim DID NOT HELP BUILD AMERICA","commenter_a":"that is wrong, they (muslims) had no part in building America.","post_message":"Ohio State University is now teaching students that Muslims helped build America"},{"comment_id":"10155961820435725","commenter_b":"Time for Americans to play the TRUMP card!!! Adios Illegals!!!","commenter_a":"Mr Trump ...the RNC will NEVER give you the nomination .... This is a chance for America to rid itself of the GOP for good... Start a third party... American Patriot Party... A Party of the People!!! If it doesnt work... so be it... You are the only one who can beat Hillary and if you are not the nominee ...she will win.. But at least we gave it a shot... If you dont win...then the GOP wont win!!!!","post_message":"Our online store is officially open! Visit www.DonaldJTrump.com/shop to shop the latest #MakeAmericaGreatAgain merchandise."},{"comment_id":"10153614097404199","commenter_b":"Victim or not, that was still unacceptable behavior. She tried to attack her! That lady could have just kept going.... BUT she chose road rage.","commenter_a":"That mom wasn't scared. She was pissed at the person driving recklessly. If she was scared, she could of pulled herself out of the situation at many different side roads and pull offs. She choose to keep following someone she new was driving aggressively putting herself and child in more danger.","post_message":"UPDATE:"},{"comment_id":"745372418902804","commenter_b":"Throw the Illegals out. Send them all to Germany and have Merkel deal with them!","commenter_a":"Why the smirks???? Like saying I know something you don't know.","post_message":"Austrian police says 6,500 people crossed into the country on Saturday, with the number predicted to rise to 10,000; most en route to Germany"},{"comment_id":"10153641179393132","commenter_b":"I agree. She's a scam artist. But other women don't think women do that apparently...","commenter_a":"This woman is a monster in female skin. Let me generalize by saying that she makes you all look bad.","post_message":"\"He thought he owned her.\""},{"comment_id":"1796936270580308","commenter_b":"She is so low a snake would have to slither over her. #Hillaryforprison www.clintonkaine.com","commenter_a":"Go Hillary ! You have shown us during a most difficult campaign that you don't go low you always go high ! I'm with you and my family as well!!","post_message":"The decision we make in four days will affect our country for decades. hillaryclinton.com/makeaplan Share this if you agree:"}]
