[{"comment_id":"10153291330611770","commenter_b":"Sorry to hear this!","commenter_a":"when we have a women president this is the gal I would vote for she is smart and very much better looking then Hillary. Really!!!!!!!!","post_message":""},{"comment_id":"1922337691198281","commenter_b":"What easier place to pull off a mass murder? A gun free zone, loser!!! Did your law stop the murderer from having a gun?? Libs just keep getting dumber.","commenter_a":"another freaking retard liberal","post_message":""},{"comment_id":"539553339568579","commenter_b":"Yes. Send them home. They CANT Obey Our laws","commenter_a":"To Syria, no return ever!!","post_message":"Furious Muslim students rush stage during American Sniper showing. They have no respect. If they don't like American Sniper they can leave. Do you agree these Muslims are out of line?"},{"comment_id":"1011635065552183","commenter_b":"Are you surprised by this woman's corruption? She should be in jail with the other corrupt politicians. Wonder what she'd look like if she didn't have access to plastic surgery for a couple of years.","commenter_a":"this woman should be took out and shot for all the corrupt things she has done ,, and throw in her friend Dirty Harry Reid also ...","post_message":"Here's Nancy Pelosi real \"war on women\""},{"comment_id":"10157269253925500","commenter_b":"and they get paid less than the men! I have to say that these ladies look to be a MUCH stronger group physically than the men.","commenter_a":"Agree!","post_message":"Let's go, Team USA! The women's soccer team looks to be the first to win a World Cup and then Olympic gold in the following year. WATCH LIVE @ 4: @webpagelink"},{"comment_id":"1790206457902451","commenter_b":"Michele Obama said Hillary can't run her own house, how can she run the White House","commenter_a":"Bring the jobs back. Throw out the Chinese fakes","post_message":"WATCH: Hillary Clinton and Donald J. Trump go head to head in the final presidential debate, live from Las Vegas."},{"comment_id":"10153181502489705","commenter_b":"RJ Ring,Brett Alexander,Chandler Hunt","commenter_a":"Victor Trezic Mata","post_message":"Star Wars fans. It has arrived. Rejoice."}]
