[{"comment_id":"10153228723406336","commenter_b":"Please these Repigs are tooo much..HILLARY CLINTON WILL BE PRESIDENT Regardless of all the BS Faux NONEWS says and EXAGGERATIONS from Hannipig","commenter_a":"Listen for the \"vast right-wing conspiracy\" defense.","post_message":"Hillary Clinton has agreed to testify on Capitol Hill later this month about two controversial issues when she was secretary of state – the fatal terror attacks in Benghazi and using a private server and emails for official business."},{"comment_id":"10152763555906051","commenter_b":"This is just getting so ridiculous why don't people just mind your own business and live her own life grow up","commenter_a":"i think she is one hell of a shot. i wouldent piss her off. leave her alone. your just jelous because you can't bow hunt as good as her. she is feeding someone. you have nothing to be scared of with an eye like yours. u go girl.","post_message":"This woman has been getting death threats over her photos. Decide for yourselves if the criticism is warranted."},{"comment_id":"10153548931652550","commenter_b":"my only solution to this and advice to the american government is to stop allowing foreigners to come into the united states... I think this country has the worst imigration problem.","commenter_a":"Who trusts the Obozo regime to make sure no terrorist enter our country masquerading as refugees?","post_message":"Welcome to America: New photo shows newly-married couple who killed 14 people in California last week in a suspected ISIS-inspired attack, entering the U.S. together for the first time last year ... @webpagelink"},{"comment_id":"10153292993241350","commenter_b":"I don't think I should be President, but another woman could do a great job.","commenter_a":"WOW - she has self esteem issues if she thinks she (or ANY Women) can't be President!!!!","post_message":"\"I think women can do anything and be anything, but the president, I feel, is for a man...That does not mean we cannot be successful run businesses, be doctors, be lawyers I was only speaking of one specific position...and again, it's just my opinion.\""},{"comment_id":"1447392598607688","commenter_b":"Style and Clinton DO NOT go together; she dresses worse than a bag lady.","commenter_a":"Oh Lordy, how gross!","post_message":"Hillary Clinton? You mean THAT Hillary Clinton?"},{"comment_id":"10154403631241509","commenter_b":"Soooo she will be participating in the great invasion Day for sure then..you people are true life devils and still till this day it shows......GO BACK TO THE CAUCASUS MOUNTAINS !!!","commenter_a":"She's clearly in love haha with money","post_message":"Mariah Carey is set to marry an Australian billionaire."},{"comment_id":"434449293346332","commenter_b":"Oh Cheryl chill out","commenter_a":"Anyone who thinks this is ok and there is at least one person here, (@username, seems to think so) is an idiot.","post_message":"When a student couldn't pay for her lunch, school officials decided to do this with the food instead."}]
