[{"comment_id":"10154235206604203","commenter_b":"Black girl magic. Fucking lol.","commenter_a":"Kathryn, guuuurl. You can find me runway-walking down the street to your house with a bottle and a mission to witness this black girl magic. Let me stop by Red Lobster real quick, tho.","post_message":"Wow."},{"comment_id":"10154233423376179","commenter_b":"'@username - He wants an empire. Fascism 101 lesson, from 1947: @webpagelink","commenter_a":"Wow, another white man! What could possibly be up with that?","post_message":"Trump #SCOTUS nominee revealed"},{"comment_id":"10152821064059342","commenter_b":"^ they just don't have enough self control to keep from raping a woman unless shes covered apparently.","commenter_a":"Why do we have a muslim Capitol day?","post_message":"FBI RESPONDING TO MUSLIM CAPITOL DAY THREATS: Organizers say demonstrators are expected to protest against Thursday's rally. A spokesperson said the event began in 2003 and has never drawn opposition before, but this year online threats have prompted the council giving event to contact the FBI."},{"comment_id":"1626892184281597","commenter_b":"'@username I didn't know whiney little bitches played hockey...","commenter_a":"The whole irony in this, is that Trump knew he was never going to be able to get Mexico to pay for the walll...and now im just waiting for some trump supporter to justify this and or blame Obama.....","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10156794589450231","commenter_b":"She looking like a dog tie her azz up","commenter_a":"Need her tubes snatched from her body...","post_message":"Pregnant mom arrested after 2 toddlers found tied up like dogs behind home."},{"comment_id":"10153042217565047","commenter_b":"JH move to Israel","commenter_a":"Because our communist muslim pig so called president is one if them. America stand for Israel Defy the leadership of this commie government and fight for what is right. Stand with Gods people.","post_message":"The terrorist-led Palestinian Authority (PA) has ended its peace with Israel.  War could be imminent, so why are we still sending millions of dollars to the PA?   We must stand with Israel.  SIGN & SHARE our petition to stand with us: @webpagelink"},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."}]
