[{"comment_id":"815801661894546","commenter_b":"Kick them out of this country","commenter_a":"If you don't like the American flag, pick one you do like..... and move to that country you bunch of losers.","post_message":"Absolutely appalling."},{"comment_id":"10155066406976509","commenter_b":"Don talking bull**** without proof !","commenter_a":"Everyone dopes in the Olympics China, USA, Germany you name it, everyone, the Russians were just dumb enough to get caught.","post_message":"BREAKING NEWS: Russia has failed in its quest to have a ban on its track and field athletes at the Rio 2016 Olympic Games overturned."},{"comment_id":"10153696182197300","commenter_b":"He is absolutely correct....because the large majority of crimes are done by blacks....thus more police treatment...","commenter_a":"The numbers don't lie. He is absolutely correct.","post_message":"Democrats will reach out to black voters in the debate tonight. Bernie Sanders made a claim about African American arrest rates. See what PolitiFact found: @webpagelink"},{"comment_id":"421728768009004","commenter_b":"Burn her as a witch","commenter_a":"So intelligent, and powerful women","post_message":"Share if you're Ready For Hillary!  Get all the best HRC coverage you need here:  @webpagelink"},{"comment_id":"1512943285667077","commenter_b":"While ur asses get your alcoholic drinks!","commenter_a":"@username hahaha","post_message":"\"Is there free food?\""},{"comment_id":"10153648281727093","commenter_b":"What an ignorant woman.","commenter_a":"She shoulda kept her mouth shut. Definately part of the problem not the solution... Our Dallas officers have absolutely ZERO to do with the recent ON CAMERA MURDERS of those men. So NO JOHNSON IS NO MARTYR. HE WAS A VILE POS THAT GOT JOHNNY C4d","post_message":"The first African-American Miss Alabama said she knows it's not right to feel this way, but can't help it... @webpagelink"},{"comment_id":"1929449190619936","commenter_b":"Trump will not get a record number of votes. No way. This is going to be the biggest landslide in modern American history.","commenter_a":"My prediction in this election is that Trump will get a record number of votes beating Hillary. But Hillary will get the electoral vote giving her the presidency. The electoral is there so the establishment gets final say. Sad but true. Isn't that right Bernie Sanders.","post_message":"Donald J. Trump says he would \"promise and pledge\" to accept the results of the election --- if he wins."}]
