[{"comment_id":"1045431208809965","commenter_b":"This is not news worthy.","commenter_a":"Who cares?","post_message":"BREAKING> Beijing wins bid to host 2022 Winter Olympics. China's capital will be first city to host summer & winter games."},{"comment_id":"1198972140162838","commenter_b":"Well you sure have a funny way of showing your best wishes for our country yourng woman. Respect is due any President, First Lady, VP and his wife. I hope you have learned from the experience.","commenter_a":"Yeah!!!! Why not you leave too. I can do your job! You do that about obama and tell me what happens!","post_message":"Gigi Hadid says her impression of soon-to-be First Lady Melania Trump at the American Music Awards was \"done in good humor.\" @webpagelink"},{"comment_id":"10154427870651491","commenter_b":"She was deported because she is a felon!!","commenter_a":"Now if only the Native Americans could some how deport the illegal descendants who settled in America and forcibly stole their tribal lands in violation of Native American law, because that would be poetic justice.","post_message":"She inspired protests in Phoenix, Arizona when she was detained on Wednesday."},{"comment_id":"10154310279241409","commenter_b":"@username I'm not against deporting any illegal immigrant that cannot qualify for resident alien status. If they have minor children, the children should stay with their deported families, but be allowed the reenter the US after the age of 18 with the proper paperwork. Legal migrant workers are the backbone of many US industries which would not survive without that work force. We don't really need a wall we only need to change the orders that have been forced upon our border patrol officers which makes the ineffective in most interactions with illegal migrants.","commenter_a":"Does anyone know what it is that they are protesting? Do they have any suggestions on how to handle illegal immigration, and the vetting process of refugees and immigrates? This seems like it may just be a way to get a day off work and get on TV.","post_message":""},{"comment_id":"10153499829950329","commenter_b":"Whooooah Michelle Esquibel Gena Esquibel","commenter_a":"Jenna Benham","post_message":"For a \"kids\" party, yes. Definitely not for adults. *coughs*"},{"comment_id":"1340506826002077","commenter_b":"Not me kick the muslims baxk to there own countries","commenter_a":"Why don't you go eat a goat turd sandwich and drop dead","post_message":"This is the congressman that stated the Islamization of America can't be stopped..."},{"comment_id":"950451268383973","commenter_b":"I look forward to never looking at this Obummer again!","commenter_a":"Why is it everybody is out to get Trump? It seems to me they are so scared he may get President they have stooped to the lowest ways to destroy him....it just wants me to vote for him more because they are scared he will and the fact is it will ruin the political garbage at the white house who are trying to bring our country down.....I want our Country back and the Constitution back to what it was meant to be!!!!!","post_message":"“Good luck with that…We’ve got serious problems here.” President Barack Obama addressed Donald J. Trump's plans to build a wall and get Mexico to pay for it."}]
