[{"comment_id":"706978382784196","commenter_b":"MAKE AMERICA AMERICA AGAIN!!!!!!","commenter_a":"Come on Bill, let us hear the speakers, please.....","post_message":"Duck Dynasty on A&E's Willie Robertson, former Texas Governor Rick Perry, retired U.S. Navy SEAL Marcus Luttrell, actor Scott Baio and Patricia Smith, mother of Benghazi victim Sean Smith, speak at the Republican National Convention."},{"comment_id":"10153469800395671","commenter_b":"The fact she had felony DUI charges in the waiting... leads one to think she has done this more than once. \"...facing felony drunken driving charges and cruelty to a child stemming from a previous incident.\" I doubt that she was so unlucky that the one time she went drinking then driving, she got into an accident and was arrested for DUI. This is usually a pattern behavior.","commenter_a":"Your not innocent when you drive drunk, multiple times. Your a murderous person that cares less about others even your own children! Wake up !","post_message":"The woman who was driving a car that crashed and killed five people this past weekend was facing felony DUI charges and cruelty to a child stemming from a previous incident."},{"comment_id":"10153722294756350","commenter_b":"Nobody is forcing people to contribute","commenter_a":"This is what has been attained from people feeling low, down & out. Preacher Joel Osteen had amassed a fortune of $56,508,500 and lives in a $10,500,000 mansion in River Oaks. River Oaks is the wealthiest and most expensive community in Texas.","post_message":"Are you going through a tough time? Pastor Joel Osteen has some advice. (cc: Joel Osteen Ministries)"},{"comment_id":"1616996585254121","commenter_b":"Now keep the fuckers from being immigrants in this country","commenter_a":"\"The Brig it is.\"","post_message":"These pirates never saw it coming..."},{"comment_id":"10154420186151194","commenter_b":"Allah is shopping like à sodomized bitch right now","commenter_a":"who just saw that giant fuckin orb?","post_message":"LIVE: Anti-ISIS military op near Mosul, Iraq"},{"comment_id":"10154244362139411","commenter_b":"@username - Shut up bitch","commenter_a":"I can just see a flood of poor women getting pregnant so they can sell babies. What a terrible idea. Plus the fact that many which grew up in a state foster home become criminals if not adopted early","post_message":"'Chance to live'"},{"comment_id":"615536761924441","commenter_b":"It open season on black people out here...I swear..the day when the rabbit has the gun is almost near.","commenter_a":"Well world, what do you think of the greatest country in the world now???","post_message":"Remember little Aiyana Stanley-Jones? She was only 7-years-old and ASLEEP when a Detroit cop fatally shot her in the head. Now it's official: EVERY LAST CHARGE against the cop who killed her has been DROPPED! He will face NO punishment AT ALL!  Are you surprised?"}]
