[{"comment_id":"10154767405540575","commenter_b":"So surprised (NOT)!","commenter_a":"That has been standard operating procedure for n0bama and his corrupt administration since day one........","post_message":"BREAKING NEW REPORT FROM FEDERAL AUDIT...  Stupid Facebook pulled in the old title which has a typo!"},{"comment_id":"10152578505267217","commenter_b":"Can't stand the woman!","commenter_a":"Congrats Serena","post_message":"Serena Williams  jumped for joy on winning the Australian Open and her 19th Grand Slam."},{"comment_id":"10153869125358812","commenter_b":"Why are Christians punished for praying. No one says others have to follow.","commenter_a":"Wow","post_message":"High school football coach suspended for praying at games attends as a spectator while  Satanists gathered outside of the stadium: @webpagelink"},{"comment_id":"1121385761232992","commenter_b":"WHY MEN WALK AWAY FROM SOOOO MANY WOMEN .","commenter_a":"So guess they'll be getting rid of the \"women in literature\" as well...?","post_message":"You can't make this stuff up anymore, folks.  Radical feminists just got their way on campus and you can now say good-bye to THIS essential college class. [Read below]"},{"comment_id":"1224908530916491","commenter_b":"Kaboom, Kaboom no more Illegal Protesters' .","commenter_a":"Abba Father, we thank You Lord for Your anointed and pray for Your strength for the road ahead to exact Your purpose for such a time as this to UNITE AMERICA, ISRAEL'S DEFENDER, UNDER THE ONE TRUE GOD FOR THE GLORY OF YOUR NAME! In Jesus Name, Amen!","post_message":"The group of seven men and three women stood across the inbound lanes holding banners reading #SomosVisible, or #WeAreVisible, and another reading \"Resist, Organize, Rise Up.\""},{"comment_id":"10153706263011336","commenter_b":"Who cares.. She's an old dried up prune!","commenter_a":"Oh dear... Am I surprised or what? NOT!!! :)","post_message":"BREAKING NEWS: After declining to state her position for years, Democratic presidential candidate Hillary Clinton says she opposes the Keystone XL oil pipeline."},{"comment_id":"10153551674003984","commenter_b":"Latino's vote democrat most of the time anyway. Illegals shouldn't be voting. Lets crack down on cheating. voter ID.","commenter_a":"So now conservatives have to worry about the huge amount of Latinos who will vote Democrat in the 2016 elections, just because Trump voiced the truth about those coming here illegally. We have over a year to go before a candidate is chosen, giving the criminals who came over the border illegally plenty of time to change the minds of Americans.","post_message":"These days, Donald Trump seems to be at the center of every controversy.  He might just be in the midst of another one after this actress just thanked him for his stance on immigration...  Do you agree with Donald Trump's views on immigration?"}]
