[{"comment_id":"10154120855527908","commenter_b":"So California can just take water from somewhere else? I thought they already did that... And destroyed the water source. Humans can adapt and migrate with little effort. To dry? Move.","commenter_a":"How about we build a water pipeline instead? Ample areas of the country have excess while others are in drought. The worst that happens if it leaks a little is some flowers or trees grow :)","post_message":""},{"comment_id":"1061923367225138","commenter_b":"Shes a rino like glenn.. no one cares..","commenter_a":"Good riddance, campaign for the liar Hillary.","post_message":"“This is not a decision I make lightly, for I am a lifelong Republican.”"},{"comment_id":"1207859512585616","commenter_b":"Kick her out!!!! Dishonorable discharge!!!!","commenter_a":"She should be discharged, and labeled as an undesirable. Her fellow sailors cannot depend on her to have their back in a time of need.","post_message":"A Navy sailor made national news when she decided to film herself not standing for the flag. Now, she's in trouble... here's the swift justice she received. Do you think she got what she had coming to her?"},{"comment_id":"709741415860770","commenter_b":"She's about one stupid fucking bitch.","commenter_a":"Nancy, Nancy, Nancy: you've been in theHouse/government too long !!Time for you to resign!!!","post_message":"Liberal logic: Taxpayers don't fund abortions, they fund the organization (Planned Parenthood) that performs the abortions. This is liberal, pro-abortion double-speak at it's worst."},{"comment_id":"1137787319581255","commenter_b":"She is a disgrace!","commenter_a":"\"When Democrats win, America wins.\" 😂","post_message":"Everything about the Clintons is fake, including Hillary's faux-Southern accent—listen! #Hillary2016"},{"comment_id":"1264747770240434","commenter_b":"where are you people getting married? That's way tooo much for a wedding.","commenter_a":"save that money for a down payment on a starter home. have a small personal wedding. in the longrun no one is going to remember crystal chandeliers, wine glasses or the color of the bridesmaid dresses. only you. in 35 years your husband won't remember that----only the credit card bills. Have a wonderful time no matter what you do.","post_message":"And about $16,000 of that is for the venue alone... STORY: @webpagelink"},{"comment_id":"10153024704310927","commenter_b":"Bill; do you understand that the 08 housing crash was the result of the 01 dot-con crash and that crash was preceded by the savings & loan crash and crash backwards it goes back to drilling nuclear holes in the ground & Vietnam and then disasters back to 1913 non-federal reserve bank. That to sustain the illusion the fiat currency denominator had to be divided by greater volume than gold, then oil and now QE zero interest ether ?? Destroying the ME extends the time line that said nations can once again convert away from the bankrupt US dollar ??","commenter_a":"Just more political theatre. It has already been shown that the IRS did not target conservative groups. The were doing their jobs and broke no laws.","post_message":"Rep. Jason Chaffetz UNLOADS on IRS Commissioner John Koskinen while introducing resolution of impeachment: violated the public trust ... Impeachment is the appropriate tool to restore public confidence in the IRS ... .\""}]
