[{"comment_id":"10155350061090231","commenter_b":"He couldn't shoot him in the leg and let him live?????","commenter_a":"Did he sprinkle crack on him before calling it in?","post_message":"BREAKING NEWS: Video shows SC police officer, Michael T. Slage, shooting Walter L. Scott, 50, in the back as he fled."},{"comment_id":"10154460376356955","commenter_b":"Let's get real honest for a minute. WHAT demographic purachased most of the 80 million copies of \"FIfty Shades of Grey\"? White suburan WOMEN. They were ok with the talk about p888y in that book and movie, but are all the sudden appalled at trump's language 11 yrs ago.. As espn football guys would say, \"COME ON MAN\"!","commenter_a":"Funny how all the establishment types who have fought to stop Trump all along, republicans and democrats alike, are the ones most offended by coarse language and not so bothered by corruption and criminal activity.","post_message":"Voters Heckle Paul Ryan, Chant: 'SHAME ON YOU!'..."},{"comment_id":"10152659193766680","commenter_b":"Not for the people in charge.","commenter_a":"They're right, our presidential debate system is broken.","post_message":"The group aims to make it easier for independent candidates to get a coveted spot on the national stage in the fall of 2016."},{"comment_id":"10155057669604099","commenter_b":"Go away!","commenter_a":"Propaganda News has their disturbed audience...and their days are numbered. They have no one to blame but themselves! Buh-bye!","post_message":"The announcement comes a day after President Donald Trump's spat with the media sharply escalated."},{"comment_id":"10155018018037311","commenter_b":"You should not judge unless you walk in their shoes, there are many reasons why they come in and stay illegally, majority work harder then any one born here to make ends meet. They do not get freebies, unless someone is kind and help them. 90% of them just come here to work and work harder then most people. People just talk out of ignorance","commenter_a":"It's too bad all these snowflakes can't distinguish between Immigrants and ILLEGAL Immigrants. The United States has always welcomed legal immigrants who want to come to this country, embrace the culture and make a contribution to the success of this country. We do not welcome people who come like thieves in the night, vote illegally, steal social security benefits, use our schools and hospitals and commit a disproportionate amount of crime. Big Difference. PASS IT ON!!!","post_message":"It calls for immigrants across the country to not attend work, not open their businesses, not spend money or even send their kids to school."},{"comment_id":"10154533749294062","commenter_b":"Lilly Cantor your a dumb young blond and still blind to the horror the earth has to offer so let me educate you . Among these people that actually need help there are terrorist trying to infiltrate us to attack us . So while your feeling bad terrorist are coming over plotting an attack . Bam attack happens then your like awww so sad but don't realize among these refugees there were terrorist . Terrorist are cowards that attack dirty . There goal is killing as many people as they can . So before you let people into our house AKA United states might want to consider would I let these people in my own house not knowing who they are","commenter_a":"Thank you Canada! It will take all of us to save these people from the horror of ISIS. They have already suffered so much and lost everything. The least we can do is welcome them With compassion.","post_message":"Canada will allow 25,000 refugees to resettle in the nation by February, with up to another 25,000 by the end of 2016."},{"comment_id":"10153287384469714","commenter_b":"We never like skinny models.we love skinned and boned and toned models that should take the run ways","commenter_a":"I think people don't get it. It's attractive to be thin but you don't have to starve yourself. You don't have to be super skinny. People like a nice figure but above all a nice personality. You don't have to kill yourself to have a nice figure. Eating right and working out makes you look nice and feel better .","post_message":""}]
