[{"comment_id":"1164964563593106","commenter_b":"I saw them at Riverside too! I remember crying lol","commenter_a":"@username remember Riverside lol","post_message":"This is Paula first time on tour in 25 years!"},{"comment_id":"1269429443084021","commenter_b":"I prefer the lady in the center.","commenter_a":"I bet I can tell you which one sells the most copies haha.","post_message":"For the first time ever, there are three different Sports Illustrated Swimsuit covers – representing women of all shapes and sizes. @webpagelink"},{"comment_id":"10154302176821491","commenter_b":"Duchess Aungelique GauBrielle You're officially crazy. Added, this is one man's personal experience as well to be fair...","commenter_a":"In all honesty, this sounds like a disgruntled employee... all of the African Americans employed, & previously employed at Versace... he's the only one to disclose this... people buy into anything where race is concerned. I'm African American, I shop high end... I've definitely experienced Racism while shopping, but I could literally count the incidents. Racism is very real, but it's being used and over used to justify everything! However, if this is true, why did he wait until he was fired to speak up. Also, why have none of the other African American employees past or present come out to support him?","post_message":"The store employees were taught during training to say \"D410\" whenever a black customer entered the store, according to the lawsuit."},{"comment_id":"10154124888373812","commenter_b":"The jobs that illegal immigrents work in this country are jobs that, #1 citizens of this country are unwilling to work and #2 jobs that employers are not willing to pay a fair wage for. That's where this country needs to start. We can build a wall that anyone who wants to cross will and does.","commenter_a":"13 million might get you just under a mile of fence.....and I'm not talking chain link. Trump would be first in line to throw in his overpriced bid.","post_message":"President Bill Clinton tells Donald J. Trump supporter “If you want to build a wall along the Rio Grande and spend $13 million, then you should follow him like Moses into the Promised Land.”"},{"comment_id":"10153432042256051","commenter_b":"Those poor people deserve a better life I heard they throw their children in the garbage because they're girls","commenter_a":"Taking misogynists whose lives revolve around subjugation of women is a bad idea. Honor killings and selling daughters are both illegal in America. Thank God.","post_message":"Here's why President Obama says accepting Syrian refugees is the ultimate American thing to do. Do you agree with his message?"},{"comment_id":"760324150750635","commenter_b":"You sons a bitches!! Lmao","commenter_a":"Thanks a lot sister that was my favorite soda!! Gross! Jessica LeAnn Miko","post_message":"Disturbing Thing A Man Says He Found Inside A Freshly Opened Pepsi Can"},{"comment_id":"10152980624100667","commenter_b":"Not.","commenter_a":"The Ross Perot of the 21st century :/","post_message":"Donald Trump declined to rule out a third-party presidential bid Thursday if he loses the Republican nomination. \"I will not make the pledge at this time,\" Trump said at the start of the GOP prime-time debate."}]
