[{"comment_id":"1793816267524585","commenter_b":"Amy you should be ashamed for trying to get people to vote for that criminal!!! The things she's going to do to our country aren't going to effect you because you have money !!!","commenter_a":"I'd be much more concerned if I voted for someone who was indited and convicted of high crimes against the United States and humanity!","post_message":"\"Your voting history is public record.\""},{"comment_id":"10153512540611491","commenter_b":"Blow this mf off the face of the earth","commenter_a":"@username Camangyan","post_message":"\"The only way for defending the sovereignty of our nation and its right to existence under the present extreme situation is to bolster up nuclear force.\""},{"comment_id":"1004445152942983","commenter_b":"Obama's fault!!!!!!!!!","commenter_a":"The only thing we need. United Sovereign.","post_message":"FOUR PREVIOUSLY DEPORTED ILLEGAL ALIENS Charged In Rape, Beating Of Couple  A WALL AT THE BORDER WOULD BE GREAT!"},{"comment_id":"475027816013769","commenter_b":"Guess she is a shameful person.","commenter_a":"Remember, she was also \"ashamed\" that Bush was from Texas","post_message":"Dixie Chicks member Natalie Maines also took aim at Donald J. Trump, tweeting, \"As long as Donald Trump's decisions for America are as solid as his decision about his hair, we're in good shape.\""},{"comment_id":"10150520498839999","commenter_b":"Sick woman. Sigh.","commenter_a":"WHO CARES","post_message":"The Rev. Dr. Martin Luther King, Jr. would be 86 today.   Photo: George Tames/The New York Times"},{"comment_id":"1776189505982322","commenter_b":"dumb blonde","commenter_a":"You can't act like a 10 year old threatening to nuke someone if you don't get your way -- that's what Trump would do. Donald Trump doesn't have the temperament, the intelligence or the conscience to have these codes.#imwithher","post_message":"Republicans agree: We can't give Donald Trump control of our nuclear codes."},{"comment_id":"10153621315776037","commenter_b":"Me either, but because of my mom, I've been around terminally ill people as I worked for her. This is a big deal and I believe it's important. Suffering through a long painful death is hard on families as well as patients.","commenter_a":"Death with dignity is a big deal to people. Unless you're living with a terminal illness, I suggest you leave your judgement at the door.","post_message":"Religious groups and advocates for people with disabilities opposed a nearly identical California bill earlier this year."}]
