[{"comment_id":"959584250762524","commenter_b":"That woman is so far out of touch with reality she is in her own dimension","commenter_a":"Hilary will lose","post_message":"Hillary Clinton on potential battle with Donald J. Trump: \"Look, I’ve been standing up to bullies my entire life on the international stage, on the national stage.”"},{"comment_id":"486025081592014","commenter_b":"I really really want her to go to jail","commenter_a":"This lying bitch only knows how to take care of her greedy self!!!!","post_message":"Hillary Clinton criticizes Republican Donald Trump's tax plan, calling it \"trickle down economics on steroids.\" Do you agree or disagree with Clinton on this?"},{"comment_id":"10155018887269329","commenter_b":"Rehash rehash... blah blah you lefties, blah blah. We won blah blah. No new content. Regurgitation continued. Yawn.","commenter_a":"You'll fit in with the self-important Hollyweird glitterati JKR. The British have never been enamoured of their paid entertainers except for simply that, as entertainers, who are well paid for their craft. The disenchanted and disenfranchised led the way with Brexit. Believe me, those who formed this majority are not racist not are they Ill educated. Nor are they of the lower socio-economic strata of society. They are the majority who stopped being intimidated by the PC brigade. The U.S. followed and Europe is next. The pendulum has swung back in reaction to the rot spreading from the highest echelons of government down, aided and abetted by a dishonest press and a compliant and unrepresentative public service.","post_message":"J.K. Rowling has outdone herself."},{"comment_id":"10154648148626509","commenter_b":"Women for Trrump!!!: \"They'll be on their knees soon enough.\"","commenter_a":"Woman and Americans for our next president Donald J Trump.. Welcome aboard it's a wonderful ride to the White House","post_message":"This mogul once said he's a member of \"the lucky sperm club.\" How Donald J. Trump sees himself, in his own words: @webpagelink"},{"comment_id":"1035032136534126","commenter_b":"You're a sick woman.","commenter_a":"Go Trump..Tell us the truth because that's what the people want to hear! We don't want Muslims or Cubans running our nation!!! Trump 2016","post_message":"Donald J. Trump wants Iowa voters to keep this one thing in mind come caucus day: \"When you’re casting your ballot, remember.”"},{"comment_id":"10150532816329999","commenter_b":"It's also ingrained that we're each other's competition. Women don't hate each other naturally any more than men do. That's nurtured behavior. If we support each other more, things will change. This goes on all fronts. I can't tell you how many housewives hate me just b/c I'm not a submissive woman who pushes out kids and reads mommy porn (those ideas are also ingrained on far too many women-in the year 2015...)","commenter_a":"I've definitely seen it and it's so ingrained that a lot of people don't notice.","post_message":"When a man talks in a meeting, he gets heard, but when a woman does, she gets interrupted, Sheryl Sandberg and Adam Grant write. Have you experienced gender bias at your workplace? If so, how have you dealt with it? Share your stories in the comments, or within the article."},{"comment_id":"10153921510965329","commenter_b":"lol i thought this was cute calm down woman","commenter_a":"Alison Wonderland when you tame the mane...","post_message":"can't stop watching this"}]
