[{"comment_id":"10153347711966680","commenter_b":"And from your own site @webpagelink","commenter_a":"No one has ever really cared what David Duke says so people don't need to flare up over his nonsense.","post_message":"Former KKK grand wizard David Duke on Donald J. Trump: “He’s meant a lot for the human rights of European Americans.”"},{"comment_id":"10156802863905354","commenter_b":"She's def a whore! Well said","commenter_a":"Hillary is nothing more than a lying, conniving political whore.","post_message":"REVEALED:"},{"comment_id":"1800270353550404","commenter_b":"She is a news whore and can't stand when she's not the center of the news! Whole thing probably a publicity stunt!","commenter_a":"insurance","post_message":"Kardashian West has yet to post about the incident in the days since it all allegedly went down."},{"comment_id":"10154181766797093","commenter_b":"It's non violent offenses .","commenter_a":"What about victims? Can you erase their memory?","post_message":"If you have a criminal record, a group of Dallas county judges will help people with criminal records get their lives back on track. bit.ly/2li0sJ9"},{"comment_id":"10154231947457411","commenter_b":"You would think they would have heard all the bee's buzzing around up in the attic long before it got to this point. DUH.","commenter_a":"This is common wasps or bees or Lizards I have seen a lot but not this much","post_message":"A Texas homeowner found herself in a sticky situation after calling for help with what she thought was going to be a simple roof repair."},{"comment_id":"1746066945644780","commenter_b":"Sickening","commenter_a":"If Hillary wins we are fucked. All will end for this once dear nation. Adios America this nation is now a dump China & Russia are the leading nations now. Deceiving Hillary is going to backstab everyone. She will do anything to get your vote but at the end you will see her lies.","post_message":"Does Trump's violent rhetoric and bigotry remind you of something? Let's take a look back at history and find out... Big thanks to Marianne DeMarco for making this video."},{"comment_id":"614711638682250","commenter_b":"So she was stealing from her mother?WTF","commenter_a":"What an idiot...did she say her mom lives there even after he said it was his house?! Also what in the world would her \"niece and nephew\" need from Grainger?? Stop the stupidity people...","post_message":"An attempted package thief who was confronted by a homeowner tried to tell him that her mother lived at the home. The homeowner said he was going to call police, and she dropped the packages and fled. Now the Alhambra Police Department is looking for help identifying her. Read KTLA story here: @webpagelink"}]
