[{"comment_id":"10153087285766491","commenter_b":"Hilarious female!","commenter_a":"Stop talking about her. Shes not funny get over it. Stop trying to make her famous by shoving her down our throats","post_message":"Interviewers, beware: do not mess with Amy Schumer."},{"comment_id":"731507293614546","commenter_b":"DUMBASSES...HAVE TO KILL THINGS...HUMANS ARE FUCKED UP.","commenter_a":"He should have drug it up on the shore and smashed it's head in with a boat oar. The only thing a fish like that is good for, is seriously limiting the population of other fish in it's habitat. You can't even eat a fish like that, you could try but I wouldn't advise it. #Conservation #BottomFeeders","post_message":"Surprised?"},{"comment_id":"10156471247000354","commenter_b":"Yes...IT IS A WAR AGAINST ISLAM SO...your point is?@webpagelink","commenter_a":"Sticking up for your golden Gose?","post_message":"Can't make this stuff up.   It happened this morning. VIDEO on the flipside..."},{"comment_id":"1418440301796751","commenter_b":"Looks like even white deer are emboldened by a Trump presidency. They must be racist!","commenter_a":"They are beautiful. I would love to see one up close.","post_message":"This is a rare sight: Not one but THREE albino deer spotted in a yard in Wisconsin. One out of every 20,000 deer is albino, making them so rare they're illegal to hunt. MORE: @webpagelink"},{"comment_id":"10153230146462439","commenter_b":"Why do you say that?","commenter_a":"The use of the Neutron Bomb comes closer.....","post_message":"Iran is the world’s leading state sponsor of terrorism. Hizb’Allah is its client in Lebanon. Hussein Obama has apparently joined the axis of evil…and that will be his legacy. “Iran is placing guided warheads on Hezbollah rockets,'” by Yaakov Lappin, …"},{"comment_id":"10153323990951509","commenter_b":"Certainly makes most if the rest of us look very lazy","commenter_a":"@webpagelink WATCH THE ABOVE YOUTUBE VIDEO LINK.THIS IS THE BREAKING NEWS I WAS TAKEN IN HEAVEN AND SHOWN THE TRUMPET BEING BLOWN AND JESUS COMING VERY VERY VERY VERY FAST AND VERY VERY SOON. THIS IS THE LAST WARNING.JESUS IS COMING FAST AND SOON Ezekiel 3:27 But when I speak to you, I will open your mouth and you shall say to them, 'This is what the Sovereign LORD says.' Whoever will listen let them listen, and whoever will refuse let them refuse; for they are a rebellious people.","post_message":"He trudged the better part of a marathon each workday. Donations poured in for the Detroit man whose daily commute is a 21-mile walk: @webpagelink"},{"comment_id":"1542774025748103","commenter_b":"As usual women come ro the rescue","commenter_a":"What kind of crap insinuating Hillary in this???","post_message":"YES!"}]
