[{"comment_id":"10152823238956130","commenter_b":"Women graduate at a far higher rate than men. From high school and college.","commenter_a":"And no the factors you listed clearly are important, not to discussing what wages should be, but to the discussion of why wages are not equal. Data clearly shows the problem is economic insufficiency, regardless of there being widespread discrimination. So we could make more progress closing the gap by everyone getting a better education (even at the library or online if you know how to source good) building your own successful business, or something innovative.","post_message":"This is what the wage gender page gap looks like."},{"comment_id":"493375190853061","commenter_b":"Ban muslims from holding a job AND ban them from welfare benefits! Starve them out of our country!!!","commenter_a":"Now I know why CVS has become so powerful in the insurance business. Owned by Muslims, friends of Obama. So many large companies are now making their employees use only CVS to get their medications. CVS charges more for all their medications. So wrong.","post_message":"His Muslim boss tried to harass him for being Christian, be he wouldn't back down.  Amazing. Let's show him we have his back.  Do you support his stand against his Muslim supervisor?"},{"comment_id":"10155686821610354","commenter_b":"Please were in Big Trouble if the ASSHOLE gets in. It's bad enough the ASS already in office is dismantling our Country little by little she'll just finish it off. Her and her asshole of a husband.","commenter_a":"She could have changed to state ID if she is no longer driving and that information should have come via letter","post_message":"Clinton said that she was fighting “for the grandmother who’s turned away from the polls because her driver’s license expired.”  If she didn't want it to expire, she could have driven once or twice since 1996..."},{"comment_id":"10154944748138690","commenter_b":"Rohingas living there from 400 years! How much time need to be a citizens of a country? And any illegal citizens can be clear by any countrys government, Bangladesh will do that and India also can clear any illegal citizens from their country.","commenter_a":"He is a Novel laureate for peace from Bangladesh but he didn't said anything about Myanmar Muslim crisis!! Bangladesh facing huge problem for the crisis but as a novel laureate he has some responsibilities to stop violence in Myanmar but he acting like a blind coward and always making way to steal money from poor peoples. That's why Bangladeshi peoples think he is a greedy businessman and Novel price is a joke!","post_message":"'If it is politically motivated, to victimize a person, then it is a cause of concern.'"},{"comment_id":"10154261503546770","commenter_b":"Hollywood is full of whores!","commenter_a":"Omg. It's just a dress! Didn't your mothers teach you that if you don't have anything nice to say, don't say anything at all!!! Looks like you could all use a lesson in kindness!!","post_message":"Holy moly, Jennifer Aniston."},{"comment_id":"1146022832118940","commenter_b":"How much did this investigation cost you???? Lying bitch.","commenter_a":"Hey liar, the FBI doesn't release information on investigations.","post_message":"Clinton is calling for the FBI to release more details on the investigation, saying 'the American people deserve to get the full and complete facts immediately.' Agree or disagree?"},{"comment_id":"10154436669806509","commenter_b":"Hillary is a lying hag. #feelthebern","commenter_a":"Hillary Clinton is a chameleon. She changes her beliefs faster than I change socks. She's a liar and we all know it. The only supporters she has are middle-aged feminists.","post_message":"Can Hillary Clinton assure voters that, as president, she would not expand U.S. military involvement abroad?   Live updates from #DemTownHall: @webpagelink"}]
