[{"comment_id":"10153183398771234","commenter_b":"Poor deluded woman.","commenter_a":"Donald Trump you have my vote","post_message":"Has Donald Trump always been, well, Donald Trump? According to his one-time roommate, the answer is..."},{"comment_id":"953797061420139","commenter_b":"'@username hahaha","commenter_a":"And this witness is just as big a piece of shit, like the article ends with. Haha you cats are seriously not right. Good luck in the big scary liberal future. It's called progress get on board or get left behind.","post_message":"HERE WE GO.............."},{"comment_id":"1724892717782853","commenter_b":"We are in America! Speak English woman! Lol","commenter_a":"'@username they read my post!","post_message":"'Hail Hydra' are two words no one ever expected Captain America to say."},{"comment_id":"1037877766321802","commenter_b":"THE ONLY VOTE FOR HILLARY WERE BUTTERCUPS AND ILLEGALS.","commenter_a":"Shabaz, you have a problem with Israel I see!!","post_message":"Who's meeting with the president-elect today? We're at Trump Tower watching the most famous elevators in the world"},{"comment_id":"845673835565796","commenter_b":"'@username - As usual, the liberal fails to consider the unintended consequences of their actions. Transgenders make up only .3% of the population so the threat from them is minimal. The threat from perverts who will abuse this decision to commit assaults will far outnumber the Transgenders who simply want to go pee. It will be the innocent among the majority of Target's customers that will face the consequences of Target's liberal, feel good decision.","commenter_a":"Well I guess my kids will not be using the fitting rooms. I to will be reconsidering using their bathrooms and even shopping there. This country has lost it's damn mind!","post_message":"Are you kidding me?!"},{"comment_id":"1308930149151726","commenter_b":"Smug asshole !","commenter_a":"and why is anyone voting for this self centered fool ....","post_message":"His response is simply 'deplorable.'"},{"comment_id":"10153956657931336","commenter_b":"Amen she needs to go to jail u r correct","commenter_a":"112 million raised and supposedly all from minorities and women. This woman is the single biggest threat to our country. She is actually worse than Obama and as we know that is as bad as it gets. The nazi queen needs to go to prison","post_message":"The Hillary Clinton campaign said that puts her total raised in 2015 to spend on the presidential primary campaign at $112 million."}]
