[{"comment_id":"10154055081001770","commenter_b":"Those girls are too skinny. They need to put some meat on those bones before they could be sizzling","commenter_a":"sizzling...but was she a Hillary voter?","post_message":"Are these sizzling photos too much for the internet to handle?"},{"comment_id":"10153294493981438","commenter_b":"I hate her as corporate whore and war monger.","commenter_a":"I like her as Nerd and Law Student!","post_message":"Nerds are cool, and that is Hillary’s true self. She should two-strap her way to the White House."},{"comment_id":"10154351189226051","commenter_b":"Lmao nope 😅","commenter_a":"Christine you didn't get this one did you! 😂","post_message":"When these parents took the doll out of the box, they were surprised at what they saw. Take a look for yourself and see if it's worthy of the controversy."},{"comment_id":"1229145840456983","commenter_b":"Clinton can't tell the truth! Can't remember her lies ! Gives her daughter 1,000,000$ a year of stolen money gained from corruption even year making Chelsea an accomplice ! As well as an accomplice to her email crimes! Arrest them all 2017!!!! Obama and Clintons open boarder policy and the invasion led by both to destroy America while millions come their way ! A record number of illegal aliens penetrate our wide open borders and manipulate a dysfunctional visa system, the boys now urinate in the girls bathroom if they identify as a female, the growth of Islam in America is unstoppable, the debt is so high the number appears fake, the shrinking of the military is sickening, veterans are killing themselves at alarming rates, the war on cops is an epidemic, we back to segregating college campuses, Obamacare is worse than what we had before it was a law, ...","commenter_a":"Hello she bed IP with people ehp kills hays","post_message":"She is the LAST person in the world who should be lecturing anybody about respecting anybody's rights, with her own HORRIFYING connections..."},{"comment_id":"10154276196928128","commenter_b":"more like a buzzard ,she will eat america alive","commenter_a":"People seem to forget!! This is what happens when you mess with the Clinton's!! You can share this from my page if you want. And I did not write this I copied it from someone else that posted it. And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clintons convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown .. The murder happened just after she was togo public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock ...","post_message":"Aaron David Miller asks: Is Hillary Clinton's hawkish past an accurate indication of how she would behave as president?"},{"comment_id":"900098320056924","commenter_b":"What a stupid bitch","commenter_a":"Carmen Favela girls dick ride the shit out of drake 😂😂","post_message":"Drake Fan Calls Cops On Meek Mill & Rats Him Out To His Probation Officer For Threatening Drizzy!"},{"comment_id":"10154403631241509","commenter_b":"Soooo she will be participating in the great invasion Day for sure then..you people are true life devils and still till this day it shows......GO BACK TO THE CAUCASUS MOUNTAINS !!!","commenter_a":"She's clearly in love haha with money","post_message":"Mariah Carey is set to marry an Australian billionaire."}]
