[{"comment_id":"1354400067935066","commenter_b":"Just try it you fucking bitch! Just try it!","commenter_a":"PRESIDENT TRUMP, PRESIDENT TRUMP, PRESIDENT TRUMP!!!! WE THE PEOPLE SAID SO!","post_message":"Discuss.   SHARE THIS and FOLLOW US at Reverb Press and Stories That Resonate for progressive news and opinion that you can trust."},{"comment_id":"965413580245506","commenter_b":"Keep trying @username. Killery the lying hag will fall short.","commenter_a":"PT Barnum is running for president!!","post_message":"Donald J. Trump tried to remember #DDay with a photo that wasn't from D-Day."},{"comment_id":"10154547365036756","commenter_b":"'@username . Some were royal flushed and forced to eat their perpetrators feces .","commenter_a":"you guys just don't understand the pressure of defending your homeland against New Zealand AND Tasmania.","post_message":"The physical abuse, one victim said, was 'systemic, traditional and commonplace.'"},{"comment_id":"10154845355999705","commenter_b":"Omg this is perfect","commenter_a":"'@username lolol we need one","post_message":"Someone reverse engineered the umbrella - and it totally works."},{"comment_id":"10154387812405329","commenter_b":"Pretty ladies :)","commenter_a":"My mom and I get asked if we're sister's whenever we're out","post_message":"Um....................................."},{"comment_id":"495634957263126","commenter_b":"u get the fuck away from us first we will leave ur shit","commenter_a":"Muzzies. This is why these scum don't belong in the West, they refuse to assimilate.","post_message":"'We've kind of been forced back to the primitive ways of schooling.'"},{"comment_id":"752331831534238","commenter_b":"This guy is DANGEROUS!!! USA will not be a safe place if this ass hole wins. countries like RUSSIA! Will declared WAR on USA. He is thinking to pressure MEXICO to pay for a wall base in WAR!!! Mexico has many ALLIES! WWIII Don't make a bad decision people!","commenter_a":"He is the devil","post_message":"Watch Trump directly contradict himself — watch more here: @webpagelink"}]
