[{"comment_id":"10153085724024228","commenter_b":"let her leave, she's the one who will suffer","commenter_a":"Let's not forget child-support from Miss congeniality.","post_message":"After holding baby Leo's hand for the first time, his dad fell in love."},{"comment_id":"10153140087886037","commenter_b":"@username I have a friend who works as an ICE agent and their hands are often tied when getting rid of criminals and they already deport the serious criminals.","commenter_a":"My mother-in-law went through the process legally and in November she took the oath. She took the process seriously, learning US history, learning english, and working hard to pay the fees. Freely handing out citizenship is an insult to those who went through the process legally. Laws are put in place for a reason, we cant pick and choose which ones we follow. And the President can't be allowed to give millions of people citizenship when it goes against our laws. I don't care if the president is Democrat or Republican, this is not legal.","post_message":"Confident Obama predicts success in immigration appeal, has message for millions facing possible deportation @webpagelink"},{"comment_id":"10154082717346037","commenter_b":"You're an old hag and a criminal","commenter_a":"Hilary for president of America 2016!","post_message":"Hillary Clinton and Ted Cruz have received the most funding from the groups so far."},{"comment_id":"10153520838606051","commenter_b":"She needs to go to prison, too. Hope they sterile her so she can't bring anymore babies into this world for her husband","commenter_a":"Your husband should be on death row, and never see the light of day. To murder an innocent baby shows the cowardice and evil in his heart. He can't be allowed to live...he's a threat to society. One question...how can you defend his actions? He MURDERED your BABY...absolutely disgusting, both of you.","post_message":"This woman's husband was fed up with his son crying so he hit him so hard that it killed him. Now, she has one message for all the people criticizing her husband."},{"comment_id":"596524653885918","commenter_b":"Hell no she's a racist and a bigot . Her husband did our country more harm than good. No way would I ever vote her into office.","commenter_a":"no way in Hell","post_message":"Would you vote for Michelle Obama if she ran for president one day?"},{"comment_id":"10152863339776491","commenter_b":"Just think all the traffic that's been through her!! Her germs have germs!!","commenter_a":"Can you imagine being the one that has to kiss those lips? Ugh. I mean uuuugggghh!","post_message":"\"Every time I say something that’s extremely truthful out loud, it literally breaks the Internet.\""},{"comment_id":"10155254752442908","commenter_b":"@username Is that right? My life is in order. I am a home owner. I have had the same employer since 1994. I have never been on food stamps or welfare. I never take a vacation. If I do take time off, it is to do chores that has built up around the house. My wife (which also has a job and the same employer for 5 years) and I had 2 children, and raised them to be hard workers. Both my daughter and son in law to be have jobs. My daughter has two jobs. They are not planning on having children until they actually have their life started, and a place to call their own. They both have their own vehicles. Ones they have worked for and were not just given. Compare that to your life. Let me know... Then we can see who has spent their life ...","commenter_a":"Funny how some of these people are using the term 'greedy' to describe the rich, only to say that THEY want more money...face-palm.","post_message":"A few years ago, a $15 minimum wage was considered too radical. But when people see the justice of an idea, it catches fire very quickly."}]
