[{"comment_id":"10153987601378908","commenter_b":"And another commenter who didn't read the article.","commenter_a":"And this is the article that should prove to all of you that collective evolution spreads bullshit ... Yellowstone has a big herd over 4000 bison .... And they are to slaughter 4-600 of them to prevent spread of disease !!!!!","post_message":"Park rangers have begun capturing wild bison in the Stephens Creek trap within Yellowstone National Park. Since Feb. 20, approximately 150 of America last wild buffalo have been trapped. According to park officials, all are destined for slaughter."},{"comment_id":"10155238822815579","commenter_b":"In 2016 he US allowed 38,901 Muslim refugees also 37521 Christian refugees.","commenter_a":"In a practical sense, Obama had a ban against middle eastern christians. He seemed pleased they were being made victims of genocide, instead.","post_message":"President Trump: \"World Is A Mess & Angry\" - AGREE or DISAGREE?"},{"comment_id":"1644623019109095","commenter_b":"Dear: Mr. trump; you have a nice fire burning for yourself, why open the damper and burn it out?","commenter_a":"Mr. Trump :If you truly believe in America, stop the hate talk: read, or have read to you, both the Constitution of these United States and the Declaration of Independence. My Uncles served in World War 2 to protect us from the Fascists (Dad had medical issues and couldn't serve in the military: worked for the government instead!) : by posting this, I'm hoping someone will connect the dots and know that's what you are!","post_message":"Statement on Preventing Muslim Immigration:"},{"comment_id":"488489361275658","commenter_b":"Don't think she will get off easy this time.","commenter_a":"She will get off easy because she's a cops wife","post_message":"A cop's wife did this to another cop's wife. I wonder what on earth she was thinking!"},{"comment_id":"10155889983075354","commenter_b":"This was the flag of SOUTHERN DEMOCRATS, no less! It took a Republican (Lincoln) to free the slaves!","commenter_a":"With all of the \"racism this, and political correctness that\" nonsense going on, the attempt to distract the masses is working. Do you know the REAL REASON this flag is under attack?? Simple, it's because it's the rebel flag, the flag of RESISTANCE!!! The one true evil behind all of this, is government. They realize people are waking up to their BS and want the sheep to behave... nope, I will NOT ABIDE!!! Wake up people!!!","post_message":"\"I understand the true nature of the war, and slavery was not the primary issue.\""},{"comment_id":"10155226705950579","commenter_b":"She is sharp","commenter_a":"Where is the voice for the white race and culture?","post_message":"British Prime Minister Theresa May: \"I am pleased that I am able to meet President Trump so early in his administration.That is a sign of the strength of the special relationship between the United Kingdom and the United States of America.\"  Full video of Primer Minister's Questions here: @webpagelink"},{"comment_id":"1056816484380468","commenter_b":"Islam, by law, is prohibited from US immigration The Immigration and Nationality Act passed June 27, 1952 revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in Chapter 2 ACT 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by \"force, violence, or other unconstitutional means.\" This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House.Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the Hadith all require complete submission ...","commenter_a":"Don't waste tax dollars with a trial, start setting an example of what happens to terrorest who murder.","post_message":"BREAKING: Muslim Teen Refugee Charged With MURDER For Beating 97-Yr-Old WWII Veteran To Death  These refugees can not be trusted with freedom... give an inch they take a mile.   Http://woundedamericanwarrior.com/breaking-muslim-teen-refugee-charged-with-murder-for-beating-97-yr-old-wwii-veteran-to-death/"}]
