[{"comment_id":"10153122769748145","commenter_b":"Vote the hurricanes out!","commenter_a":"Already started ;)","post_message":"Today is the start of the 2015 Hurricane Season! Are you prepared if a big storm hits Central Florida? #WFTV Check out these must-have supplies: @webpagelink"},{"comment_id":"10154449367595470","commenter_b":"Trump means GET RID OF MUSLIMS","commenter_a":"This is typical of the Hillary group","post_message":"Local republicans say they don't think the act of vandalism was done by a Trump supporter but they say they don't condone that type of behavior. They are hopeful it will stop and be replaced by actual conversations about opposing ideas."},{"comment_id":"583735078458513","commenter_b":"Mike( @username) what makes these kinds of statements so hateful and racist in that it taxing the ancestors of one group for the actions of the ancestors of another group. The probabilities are just as likely that your ancestors dies freeing the slaves or were not even in America in the mid 1800's or that fella demanding the free $ had relatives that sold the Africans to the slavetraders. That's how it was done. Africans selling other Africans to the traders. Throughout history all groups and races enslaved each other. Many believe the pyramids were built by slaves under the direction of African Masters. Let's try it Dr King's way by judging people by their character not color. That chip on ones shoulder can get quite heavy!","commenter_a":"No","post_message":"All White People Owe Us Reparations, 'If You Don't Give It, We Are Coming To Take It' [VIDEO] They are demanding that we give them money for their ancestors slavery. Will you pay African Americans reparations?"},{"comment_id":"1335655576501194","commenter_b":"Omg this little girl does need someone to beat her ass. Khloe can do it lol","commenter_a":"This lil girl is trash shame on her people need to stop giving her 5 minutes of fame","post_message":"She's calling out Kylie Jenner!  #WSHH #CatchMeOutside #KylieJenner"},{"comment_id":"10153599019231323","commenter_b":"Sack the bitch","commenter_a":"Either the bigot does the job she's paid to do by the taxpayer or quit. Its quite simple.","post_message":"“To issue a marriage license which conflicts with God’s definition of marriage, with my name affixed to the certificate, would violate my conscience.”"},{"comment_id":"1046837848719437","commenter_b":"@username You must be trying to sound smart but if you are a Trumpeter... Oh well need I say it? Trump lies every single time he opens his ignorant mouth! I will take my chances with @username! At least she has a coherent campaign beside I am uh going to uuhh build a Wall YEAH a Great big wall DUH!","commenter_a":"When voters were asked to say the first word that came to mind when they thought of @username, the most popular responses were , , and .","post_message":"The fate of immigration reform—and millions of undocumented families—is in the hands of the next president."},{"comment_id":"1152891968103883","commenter_b":"She is very cute and beautiful little baby but don't present her like,\" world's most beautiful girl\". You are ruining her childhood, i guess it's already been ruined but better late than never. Let her live her normal life please. I could see her turn into justin bieber like child in the future. He was no doubt blessed child but what media attention has done to him?? Spoliled him forever. One thing more how can you claim WORLD'S most beautiful child? World means 200 countries and over 7 billion human beings! Have you seen all of them?","commenter_a":"Not being funny but kids are cute not beautiful..that really sounds wrong unless it's you perents saying it.","post_message":"The controversial ten-year-old has been dubbed 'the most beautiful girl in the world'"}]
