[{"comment_id":"542298055958487","commenter_b":"That shouldn't come as a suprise.There is alot more where that came from. JAIL HILLARY 2016","commenter_a":"If this was only true. If she is arrested she should be put it with all the other criminals and NO special treatment","post_message":"She looks good in orange..."},{"comment_id":"10154664283754778","commenter_b":"We can see all the ex cons..right in this thread...","commenter_a":"He would look good in any back alley dumpster","post_message":"\"If I had to bet, I would say to Kalorama or a neighborhood called Mass Ave. Heights.\" Where do you think?"},{"comment_id":"10156750651870551","commenter_b":"Any one who eats pizza with a folk should get out of the country .WHAT A DOUCHEBAG","commenter_a":"He's a loser! Go down the tubes! And another one bites the dust!","post_message":""},{"comment_id":"639543372893417","commenter_b":"As I said the jobs are what this is all about. Yet we continue to give unlimited tax breaks to these major corporations to stay here. Just look at all the money LOANED to GM that has never wholly been repaid and never will. Major corporations are \"pimping\" themselves out so WE the middle class can continue to pay for all their tax breaks. When our American companies relocate outside of our country they should be heavily taxed for importing there product here. Since they're paying these third world workers nothing anyway for once let's get into their profits.","commenter_a":"Oh well thank you is in order for saving those jobs. Too bad we the middle class have to make up for that $7m tax break you just gave them. What should have been done is let them leave and import their products back here and tax the crap out of them. Since they are going to pay some Mexican $2 hour. ONLY IN AMERICA!","post_message":"Trump's Carrier deal shows corporations they can: ✅ Threaten to outsource jobs ✅ Actually outsource jobs ✅ Still get a tax cut"},{"comment_id":"1172807002807988","commenter_b":"But you know it's hard to dress a tranny and make anyone think they're a woman !!!","commenter_a":"Well this certainly has nothing to do with the article, but thank goodness Michelle's designer will not be dressing Melania. Think how hard it was to come up w flower gardens, etc to cover all the hair on Michelle's chest every time she dressed her. Melania's designer will have it much easier dressing a woman w a figure.","post_message":"Looks like Michelle saved her most patronizing comments for last. When you see what she just said, try not to lose it! Are you ready for Melania Trump to be the First Lady?"},{"comment_id":"10154969618344726","commenter_b":"muslim migrants.","commenter_a":"And people wonder why nationalistic skinheads are on the rise in that country.","post_message":"One poll finds German women no longer feel safe."},{"comment_id":"672451282894291","commenter_b":"@username The trump wall is ! I want mexico to build it ! If you arent part of the solution you are the problem .","commenter_a":"When a unstopable force meets a unimpregranable wall It is time to vote for Trump ! Hope I spelled that right libs and spell check police !","post_message":"Donald J. Trump said he didn't call Ted Cruz 'Lyin' Ted' in his New York victory speech because \"I thought it would be very undignified for me to get up at that particular moment with ... pretty much the world watching.\""}]
