[{"comment_id":"10154672636522994","commenter_b":"Not me Jonathon. I hate anything pumpkin","commenter_a":"Generalizing entire groups of people works both ways. Don't assume all black men are criminals, don't assume all cops are bad, don't assume all white girls like pumpkin spice, all black women are angry, all white men are drunks or that all Asians can't drive. Just be nice to other people.","post_message":"What started as a daughter's effort to plan a retirement party for her police officer father turned into so much more."},{"comment_id":"10154115994939369","commenter_b":"The thugs will make their way over to this mall too.","commenter_a":"This must be for everyone who wants to shop at Easton, but are tired of all the thugs that are there on the weekend.","post_message":"Not all neighbors and nearby businesses are happy about the new mall."},{"comment_id":"553065348238039","commenter_b":"Boy please!! Your mama gonna beat you stupid!","commenter_a":"I'm black and voting trump. Most of my family's also voting trump. Even most of my friends are voting trump so the news is a joke nowadays. And in case your all wondering yea we are 90% black family and friends.","post_message":"Here's why Donald J. Trump is struggling to win over black voters."},{"comment_id":"10153648598172894","commenter_b":"Where's your daughter? Dummy","commenter_a":"Shes already A Mother. Didn't she give her first daughter Away?? 🙈🐸🐸🐸☕☕☕☕","post_message":"Confirmed: Janet Jackson IS Pregnant, Expecting First Child with Husband Wissam Al Mana"},{"comment_id":"10153843599995796","commenter_b":"@username - did white privilege cause 360,000 Union soldiers to die fighting to free the slaves?","commenter_a":"Black lives matter is a racist (by definition) organization funded by George Soros to spread a false narrative, agitate and wreak havoc. People who fall for it, like Ms. Hathaway, are never interested in \"having a conversation\".","post_message":"\"I believe the Black Lives Matter movement calls on us to acknowledge our white privilege and its unfairness, to listen to the lived experiences of our darker brothers and sisters and to help them to achieve a world in which people of all shades live in safety,\" Julia Hathaway writes in her OpEd."},{"comment_id":"1721173881464308","commenter_b":"All lies, the smile to fool American's! No woman shouls allow to ru for prseident on Bil's Lewinski nasty in the White on principle alone on top of all the dangerous mistakes and incompetence that runs throyugh her desparate veins. Souless human!","commenter_a":"AMEN!!!!!!.......","post_message":"Breaking News: Hillary Clinton has clinched the Democratic nomination for president, according to The A.P."},{"comment_id":"10155466728060354","commenter_b":"Lol...I remember when a female Dem said that recently.","commenter_a":"What will he do about all the women driven to prostitution as a result of global warming?","post_message":"We look forward to your witty comments on this one. The possibilities are endless."}]
