[{"comment_id":"10153291339743188","commenter_b":"Under our current president and democratic leaders the constitution is officially thrown out the window. Many thousands of illegal immigrants will be pushed to vote ending our two party system, Obama's ultimate goal.","commenter_a":"The more people taking hits at Killary before the election, the better! And likewise, she doesn't know who the Republican nominee will be. So all she can do is lie low until she knows who to go after.","post_message":"From Stu Burguiere: There are now 6 officially announced candidates for the 2016 GOP nomination, and there are a lot more coming. Are there any of these that you think probably WON'T run? RubioWalkerPaulBushHuckabeeCruzCarsonChristiePerryGrahamSantorumFiorina That super long run-on name is packed with 12(!) options, and doesn't include others like Jindal, Trump, Kasich etc, who might get in. On that note, it's time to refresh our monthly poll. You vote for each candidate by giving them a letter grade. Just remember not to vote on what you think is going to happen. Vote on what you want to happen. Results coming on the radio show Friday."},{"comment_id":"10153243499636336","commenter_b":"We definitely need a Godly man in the White House. I thank God for him.","commenter_a":"Amen, Dr. Ben!","post_message":"Did you know? Presidential candidate Dr. Ben Carson, a retired neurosurgeon, revealed on Fox & Friends this morning why he prayed before every surgery."},{"comment_id":"1250923198278313","commenter_b":"Another add payed for by the Clintons","commenter_a":"What happened to the American people deciding who will represent us. I'm so tired of this political old timers dictating our path","post_message":"“[Donald J. Trump] is a dangerous demagogue completely unsuited to the responsibilities of a United States president.” - Bruce Kovner, who has donated nearly $3 million to the Republican party"},{"comment_id":"10152749769427894","commenter_b":"Fuck u Im beautiful somebody love it and u must love I don't have time to entertain your stupid ass go suck a sick dick bye bitch. Go suck Bruce Jenner dick look like u in love with him","commenter_a":"Bruce Jenner is a joke wtf look how he look","post_message":"Too Far? Jamie Foxx Jokes About Bruce Jenner During the iHeartRadio Music Awards [Video]"},{"comment_id":"10152829564776770","commenter_b":"Go home Clintons","commenter_a":"Bullshit cover up","post_message":"Hillary is secretly a great person, says Clinton campaign"},{"comment_id":"834137006720940","commenter_b":"It's called dual citizenship, I suggest you look it up.","commenter_a":"I guess the fact that Malik Obama is a Kenyan citizen, currently living in KENYA and cant vote in an American election doesn't mean anything...ughhh once again those pesky things called facts always getting in the way of a good story","post_message":"Wow, President Obama's brother, Malik, just announced that he is voting for me. Was probably treated badly by president-like everybody else!"},{"comment_id":"10153171636986756","commenter_b":"Trust me, women are interested in computer science. The brogrammer culture is very offputting.","commenter_a":"Considering that there were more women in computer science back in Turing's day than there are now?","post_message":"There are fewer women in fields where genius is a perceived prerequisite, a study finds. Does the stereotype of the male \"lone genius\" in art have an impact?"}]
