[{"comment_id":"10156303577690354","commenter_b":"She should be in jail for her do nothing in Benghazi.She is a liar and I hope she gets what she deserves.She thinks She is above the laws the rest of us must follow.Oh and why is Sharpton not in jail for not paying his taxes.We've got to get rid of all of these politicians.","commenter_a":"Yes she did","post_message":"'Clinton may have committed perjury, then, when she signed a sworn statement promising that she turned over all of her work-related emails pursuant to a Judicial Watch lawsuit for Clinton’s email records.'"},{"comment_id":"856127001183895","commenter_b":"Did Japan apologize for pearl Harbor, Bataan, and the rest of the atrocities committed by the Japanese military?","commenter_a":"Did Japan apologize foe pearl harbor","post_message":"Castro criticizes President Obama for not apologizing to Japan during a trip to Hiroshima in May."},{"comment_id":"10154801850791509","commenter_b":"Probably all the women appearing on TV to tout his brilliance.","commenter_a":"If relationships toward women was a deciding factor than Bill Clinton never would have been president. Bill had several women accused Bill Clinton of sexual attacks. How many women have accused Trump?","post_message":"Republican National Committee Chairman Reince Priebus says Donald J. Trump 'is going to have to answer for' his behavior around women — but also says Trump's presidential campaign isn't being judged based on his personal life."},{"comment_id":"10153004075042061","commenter_b":"These magnificent creatures were never meant to be made to stand on their heads or do any of the other ridiculous tricks they're forced to do.","commenter_a":"Stop hitting elephants.","post_message":"An elephant attacking your car - never a good thing: abcn.ws/1LxMzPP"},{"comment_id":"10156017725535405","commenter_b":"Btw, Bob, Walker has never had a surplus. He borrowed $3 billion in a series of loans, threw it in the bank and called it a 'surplus' withput taking into account the 30 debt payments on his loans. Links to the official records are here, mostly oin the footnotes: @webpagelink","commenter_a":"Scott's ok in my book. He reduced my property tax by about $500. Better than tax and spend Doyle who raised every tax and fee he could, typical tax and spend democrat. Scott let's clean house, enough with the time for a change, it's definitely time for a change.","post_message":"Governor Walker was on 'The Kelly File' last night, highlighting his plan to challenge big-government special interests at the national level and put the hardworking people of America back in charge."},{"comment_id":"976055745789876","commenter_b":"Load these pos up and ship them back to where they crawled out from under a rock!","commenter_a":"If things in this category really get bad, just like an ISIS, looking at the black white demographics in the U.S. these guys could be in big trouble if there is ever a major backlash revolt.","post_message":"Woman planning F*ck Your Flag Day on 9/11 says,  White People Must Die (VIDEO)  @webpagelink"},{"comment_id":"1266265003452033","commenter_b":"YES THIS IS WHAT I HEAR RULES AND LAWS ARE NOT FOR ANY POLITICIAN JUST FOR THE REST OF US","commenter_a":"but we already knew that, it's just nice to see the truth and evidence being uncovered.","post_message":"The rabbit hole just got a lot deeper... the corruption and incompetence that has been put in place to protect Hillary Clinton is mind boggling.  It's time we did something about this."}]
