[{"comment_id":"522533064595578","commenter_b":"Shut up and set down!!","commenter_a":"he is not black he had a black father and a white mother so put that in his book","post_message":"WATCH: At a rally in Harlem, Hillary Clinton suggested there was an element of racism in Republicans' insistence that President Obama doesn't have the right to nominate Justice Scalia's successor. They're acting like he's 'not the real president' @webpagelink"},{"comment_id":"10154741316933812","commenter_b":"Hillary will be president","commenter_a":"Remember when Hillary Clinton said the 50,000 emails she kept from the State Department (in violation of the Federal Records Act) were about yoga and her daughter's wedding? How many of the most recent set of 14,900 emails ordered made public by a federal court are about yoga or her daughter's wedding? I'm thinking zero. But hey: pertinent falsehoods under oath aren't criminal when you're aspiring to become the First Woman President (TM).","post_message":"Meet Meatball: The adorable, friendly and rotund pit bull mix that can't help but flash his brightest smile as soon as he sees a camera. 'As soon as the camera turns on he just gets this huge grin on his face.'"},{"comment_id":"712619718886803","commenter_b":"At the risk of repeating myself, J. McCain turn your back on this blight you call a presidential candidate! You do a disservice to your party, your constituents, your military compatriots and most importantly your moral compass which should be leading you away from rather than to Trump.","commenter_a":"Trup will be lopplllllppp Cidgbelillnnrvrubrg","post_message":"He's mad as hell but is he gonna take it any more? -- Paddy"},{"comment_id":"10154632790424705","commenter_b":"Isabel Galindo","commenter_a":"'@username xx","post_message":"Flawless."},{"comment_id":"10154271863249071","commenter_b":"China! China ! Chiana!","commenter_a":"Lorenzo","post_message":"Alibaba.com founder Jack Ma meets with Donald J. Trump."},{"comment_id":"10153949454199087","commenter_b":"This idiot is a democrat? I bet no one saw THAT coming...","commenter_a":"Send this loser to another planet.","post_message":"Democratic congressman Hank Johnson on Monday compared Israeli settlers to termites while discussing Israel-Palestine relations."},{"comment_id":"10156788493850389","commenter_b":"My family and friends in Utah are behind Trump!","commenter_a":"Please Utah vote Trump!! He cares about We the People.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
