[{"comment_id":"556934131139724","commenter_b":"So your telling me that New York wants refugees even after they experienced 911? I'm going to officially say they are retarded.","commenter_a":"It's not up to the states to determine it.... it just slows the process down, but they can ultimately come to wherever they want so long as the feds allow it...","post_message":"UPDATE: Four additional Governors have said that they are willing to allow Syrian refugees into their states: New York, Oregon, Utah, and Virginia. We simply do not have the ability to adequately vet more than 75,000 incoming refugees. I stand with the 31 Governors who are fighting to keep our nation safe. Contact your Governor today. CURRENTLY ACCEPTING: Colorado Governor John Hickenlooper Phone Number: (303) 866-2885 Facebook: @webpagelink/ Connecticut Governor Dannel Malloy Phone Number: (860) 566-4840 Facebook: @webpagelink/ Delaware Governor: Jack Markell Phone Number: (302) 744-4101 Facebook: @webpagelink Hawaii Governor: David Ige Phone Number: (808) 586-0034 Facebook: @webpagelink/ Pennsylvania Governor: Tom Wolf Phone Number: (717) 787-2500 Facebook: @webpagelink Vermont Governor: Peter Shumlin Phone Number: (802) 828-3333 Facebook: @webpagelink/ Washington Governor: Jay Inslee Phone Number: (360) 902-4111 Facebook: @webpagelink Oregon Governor: Kate Brown Phone Number: (503) 378-4582 Facebook: @webpagelink/ Utah Governor: Gary Herbert Phone Number: (801) 538-1000 Facebook: @webpagelink/ New York ..."},{"comment_id":"10154268994748822","commenter_b":"Assclown fool","commenter_a":"I'm so proud to have this man as my governor and I'm ashamed of the Pennsylvanians (some of whom are commenting here) who are racists and religious bigots. Thank you Governor Wolf for representing ALL Pennsylvanians (even the ignorant ones) and for protecting our children!","post_message":"NEW: Gov. Tom Wolf's administration released a response plan after recent incidents involving racism and religious intolerance in Pennsylvania schools."},{"comment_id":"1201515593201525","commenter_b":"Sad as it is. As often as this stuff happens and these woman still don't learn","commenter_a":"Update she was found dead and the man who did it is in custody. ;( RIP>","post_message":"UPDATE: Human remains found in a recycling bin have been tentatively identified as the missing Renton mother, Seattle police said. A suspect was arrested in Snohomish County. DETAILS >> kiro.tv/Renton-Mother"},{"comment_id":"10154382417947293","commenter_b":"Meanwhile Russia is laughing so hard all the way to the bank. Hope everyone who helped put this unstable Trump into this position will enjoy learning their new language of Russian cause now Russia owns us.","commenter_a":"Infighting violence much Washington post?????","post_message":"2016 might really be our own 1914."},{"comment_id":"10154269549387994","commenter_b":"You ugly asf stfu.^","commenter_a":"People have gone crazy if they think Trump can run this country.","post_message":"BREAKING: Ted Cruz has dropped out of the GOP race for president, clearing the way for Donald Trump to likely win the nomination."},{"comment_id":"601888693294679","commenter_b":"Pussy is pussy","commenter_a":"Almost every girl I've ever met before my current relationship has just been looking for someone to either buy all their shit so they don't have to work, or someone to be step daddy. Smh. I don't want to hear shit about unfair expectations.","post_message":"Well Damn!"},{"comment_id":"10153330953062452","commenter_b":"Stay out of this Stephanie Mullins","commenter_a":"Great. Now it'll be legal for California to smell worse than just smog and congestion. ***Disclaimer*** This comment was made in sarcastic jest. If you're offended by this joke, clearly you cannot comprehend sarcasm over the internet. Avoid replying if you're offended. You'll just make yourself look as stupid as the halfbreeds of Offended By Everything 2015. #PSA #TheMoreYouKnow #CalmYourTitsAndTokeYourHits","post_message":"Is California going to pot? The push to legalize recreational marijuana use in the state just got a big boost. The California Medical Association is giving the proposed ballot initiative a big thumbs up. abc7.la/20oIUO6 So, should adults 21 and over be able to buy and smoke weed?"}]
