[{"comment_id":"707039379420654","commenter_b":"Shut DOWN Sanctuary Cities FUNDING","commenter_a":"NO STRIP TRUMP FROM AMERICA","post_message":"Trump should strip federal funding from sanctuary cities - Agree or Disagree?  For more videos like this, check out Opposing Views Video"},{"comment_id":"10155329030581002","commenter_b":"What's wrong with these racist black women?","commenter_a":"What is wrong with these nasty white bitches?","post_message":"A former Santa Fe Independent School District teacher is accused of having sex with two students over the last year and a half."},{"comment_id":"10154233484170496","commenter_b":"She's a smart woman","commenter_a":"At least she kept her yap shut","post_message":"What do you think of Lady Gaga's Super Bowl halftime performance?  PHOTOS: @webpagelink  (Photo by Patrick Smith/Getty Images)"},{"comment_id":"10154886702384166","commenter_b":"We got a little here in Honea Path :-)☃","commenter_a":"got some in pelzer, they are haveing a blast in it!!!","post_message":"Sort of an encore performance of snow over parts of the Upstate just before 7 AM. Folks in Anderson could very well get a quick dusting out of this. Let us know if you do! We're on for another 2-3 more hours on FOX Carolina. -Ben"},{"comment_id":"10153813340919342","commenter_b":"I am also. But unfortunately not all women have that same luxury.","commenter_a":"They don't do thorough background checks?!!!!!!! My heart hurts every time I see stories like this! That's why I'm a stay at home mom. Can't trust anyone now a days.","post_message":"A parent's worst nightmare comes true. #abc13"},{"comment_id":"1488583267837295","commenter_b":"Are there ANY sane, normal, decent and honest people who want to do this job?","commenter_a":"He's angling for the Sec State slot if Trump gets elected.","post_message":"Most people don't really struggle with this question."},{"comment_id":"10153838559734203","commenter_b":"I said it, these muslims terrorists are disgiusing themselves as refugees, it is time for europe to immetiate Autraleria, keep them in prison like camp, then deport them back to where they are coming from","commenter_a":"bull. shit.","post_message":"A Greek official said the Syrian passport holder whose ID was found on the body of one of the Paris attackers landed in Greece last month on a boat from Syria."}]
