[{"comment_id":"935042419864513","commenter_b":"Our borders have never been as bad as they are now. Obama is to blame for that! You never hear about it on the news either. I have family in the South and they say it's scary whst is coming into our country right now illegally.","commenter_a":"Good going trump lets get started right now throw Obama in jail and you can take over tonight","post_message":"Donald Trump's announcement is something we've never seen in history!  This is HUGE!"},{"comment_id":"1201058653247496","commenter_b":"@username Yeah get rid of all laws because you don't like them, shoplifting, welfare and insurance fraud, ect... Do you even know what Jaywalking is where you live it why its a law?","commenter_a":"How about telling the entire story how he ran from the cop and tried to board that red bus in the picture while the cop was writing him a ticket... Also how you can hear the cop tell him to stop resisting while the kid was grabbing his baton. Oh because he doesn't feed your anti cop agenda?.","post_message":"Nine officers can be seen in the video, as an onlooker pleads 'He's just a kid!'"},{"comment_id":"10153245501553984","commenter_b":"This is a state matter not federal.If these Muslims can't live by the laws that are already here and set then I suggest they leave.Preferably the latter.","commenter_a":"go girl ... rippem up !","post_message":"Political correctness is NOT in this mayor's vocabulary.   Do you support her stand against Sharia Law?"},{"comment_id":"10154874909449369","commenter_b":"No actually one of my best friends is a gay black woman. She knows I love her.. she is just not childish enough to allow difference of vote affect our friendship.. we have had since we children. :) Bcuz she is grown.","commenter_a":"I have grown to respect Mike Pence. Great choice!","post_message":"Vice President-Elect Mike Pence is taking over President-elect Donald Trump's transition team, replacing the former chair of the operation."},{"comment_id":"10153420202186323","commenter_b":"Why do people feel the need to insult disabled people anyway what ever word is used?","commenter_a":"You know what? Decent people will not say 'Retarded' around the mentally challenged, because those are the actual victims who have a right to be offended. I won't say retarded around retarded people. Around non-retarded people, different story. If your feelings are hurt by me stringing a couple letters together to form a word that has had not impact on your life, tii bad.","post_message":"\"It’s not about policing language, but having “a call to action” that will make people think twice about using a term that can hurt and exclude so many people.\""},{"comment_id":"10152669035866135","commenter_b":"Me too","commenter_a":"Me too, worst sound i have heard from my phone! I try to read the alert and they want me to answer a survey! Are you freaking kidding me?!?","post_message":"UPDATE: Police have now released a picture of missing 6-year-old Hailey Betts.  READ MORE: @webpagelink  Have you seen her? Please call police right away if you have any information."},{"comment_id":"10154379177365579","commenter_b":"Thats illegal zach. You have to come here to get it.","commenter_a":"If only he lowered the debt, defeated terrorists, raised the employment level, etc. as well as he cracked jokes.","post_message":"FULL REMARKS from President Obama at his final White House Correspondents' Dinner."}]
