[{"comment_id":"10154650140738984","commenter_b":"Lol Thomas.. I always look for that very same sticker.","commenter_a":"They could have lost their job after they bought the car. That also could be their groceries for the month. When I worked at Walmart I would see carts like that and see that a lot of people would buy their monthly groceries at one time. So if you broke the cart down into 4 it really wouldn't be that much.","post_message":"This man noticed a difference between his cart and one in front of him in line at the checkout. What he saw next is royally ticking off Americans everywhere."},{"comment_id":"10153122245742377","commenter_b":"Ford didn't take any bail out money yet it is thriving.","commenter_a":"Bankruptcy isn't illegal or immoral, unlike some of Rubio's financial issues. And he never filed for personal bankruptcy, it was a few of his companies out of a thousand. He's a billionaire, yet Rubio has trouble paying credit cards. Truly Rubio doesn't want to go down this path with Trump.","post_message":"Rubio and Trump trade trash talk on finances."},{"comment_id":"1591225437848101","commenter_b":"You can leave too lady.","commenter_a":"This is totally wrong you don't disrespect the flag our the National Anthem . Good they would never play another down","post_message":"High-school football players in New Jersey, Alabama and Massachusetts, replicating Colin Kaepernick's protest, are facing suspension from school."},{"comment_id":"10150906812849999","commenter_b":"Which candidate doesn't?","commenter_a":"Guys he meant he is happy that nobody died lol get over it you all know what he meant. He says a gaffe, everyone is on it and saying how ill qualified he is, yet 99% of the time he is showing his wits no one cares.","post_message":"\"Well, first of all, just grateful that nobody got hurt,\" Gary Johnson told CNN after the attacks in New York and Minneapolis."},{"comment_id":"10158192109115206","commenter_b":"Moms Le Lotpi go to the kitchen? Is that where you think all woman belong? So ignorant.. Put your wife in the kitchen!!","commenter_a":"Wtf is wrong with these parents today. Heartless, deranged animals! Torture her slowly to her death..","post_message":""},{"comment_id":"564505557070656","commenter_b":"😩😩😩","commenter_a":"@username 😩😂😂😂😂","post_message":""},{"comment_id":"980300718729649","commenter_b":"The 2 trillion plus mentioned was already taxed in the countries their products were sold into! Why is it that our government is the only nation that promotes the idea of US companies paying taxes on products they never sold here? That is pure greed and BS! If our government was really interested in repatriation of those funds they would create a tax environment that encouraged companies to keep their plants and wealth here!","commenter_a":"and the moron we have now is no better and the douch bag is not the answer either","post_message":"We have much bigger problems to worry about. Image by Occupy Democrats, LIKE our page for more!"}]
