[{"comment_id":"10152865341779342","commenter_b":"Mexicans do deserve some credit so here it is. Murder up 67%- committed by illegal aliens Child molestation up 97%- committed by illegal aliens Rape up 53%- committed by illegal aliens Gang violence up 78%- illegal aliens Robbery up 62%-committed by illegal aliens aliens Car thieft up72% - committed by illegal aliens Economy down - contributed by illegal aliens Jobs down - contribution illegal aliens aliens Welfare abuse up 98% - fraudulent claims filed by illegal aliens aliens I could keep going but I think you get the picture.","commenter_a":"Want Mexican music go to Mexico. Pretty simple don't you think?????","post_message":""},{"comment_id":"10152657458940047","commenter_b":"First get your children out of that muslim so called college. Stop paying tuition. Shut it down. It is now a muslim training camp. Congress must shut off funding. Senate and House must stop acting like they dont work for us and get all Muslims out of this country. Enough is enough!","commenter_a":"Operation Paperclip: 69 Years Later: @webpagelink","post_message":"ISIS militants and Hamas jihadists conducting training camps on American college campuses is no different than a training session for student athletes?    According to the Assistant Dean of Students at Cornell University they are.  Astounding."},{"comment_id":"10153380454004270","commenter_b":"Well lady if you want the horrors of War you go for it.","commenter_a":"Can they take the mental pressure of War. And getting raped by someone like ISIS?","post_message":"\"I think women are showing they can do the job. Physical capability is not the issue; it’s men’s acceptance of women that’s the issue.\""},{"comment_id":"1789908131147685","commenter_b":"\" You won't divide by zero on my plane, you little bastard \"","commenter_a":"What a typical story of people being scared of things they don't understand.","post_message":"He was interrogated for two hours."},{"comment_id":"10153254996144099","commenter_b":"Darlene is just another brainwashed white women who think all blacks are \"misunderstood\"","commenter_a":"with all the training they get they can not subdue a guy with a hammer???","post_message":"UPDATE: Police and multiple sources initially said the man was dead, though authorities later said he was hospitalized in extremely critical condition.  #BREAKING: Hammer-wielding suspect shot dead after trying to hit officer, police say @webpagelink"},{"comment_id":"10154789513347908","commenter_b":"Bernie concede and join forces with Hillary. We all know this is what will happen anyway. We have to start now if not we will be wishing so if trump wins!","commenter_a":"Thank you, Bernie Sanders.","post_message":""},{"comment_id":"10153864924433984","commenter_b":"she should be sent to self defense classes .","commenter_a":"Sadie, the bully, should be charged with felony assault. Punishment: lengthy juvenile detention and expulsion from school AFTER standing in front of her school during AM student drop-off and PM student pick-up wearing a sign stating, \"I am a BULLY!\" Her parents should also be made to stand beside her donning signs stating, \"We raised a BULLY!\" and have to pay restitution to the victim's family.","post_message":"A 5th grade bully decided she was going to throw her weight around to torture another student at her school. However, she was about to find out that's not how things work...  She got justice, and she got it fast."}]
