[{"comment_id":"10154789025934641","commenter_b":"If wonder woman can do it ..so can I","commenter_a":"This is so disappointing. Anyone petitioning for the removal of Wonder Woman as ambassador, clearly doesn't know the history of the character. Peace Justice Equality ...and more. Bottom line: basing her removal mainly on appearance - is sexist. Look at male superhero costumes. They leave little to the imagination also. No one is hollering about that. As a feminist, I understand that the sexual objectification of women is a huge problem in our culture. The answer is not to force women to cover up. The answer is to allow women to express themselves without fear. The answer is to teach our boys how to behave. Read the comics. Read the history of the character. Read scholarly articles on WW as a feminist icon. She has pro-women zingers that make me cheer! Many parts of her \"sexy\" costume are actually powerful symbols. Do some research. I know there are more important ...","post_message":"Wonder Woman has been stripped of her role as UN honorary ambassador less than two months after the appointment was made."},{"comment_id":"10153706895136680","commenter_b":"Go to hell","commenter_a":"We should be afraid of those 'people' who are different, they're culture and values are incompatible with western cultures and values, they claim their holy book teaches that we must convert of they must kill us... Sounds like these 'people' are going to be a great fit in our country... A nation that was built of immigrants who DID assimilate and welcome the new culture and values of the country they moved too","post_message":"New York Governor Andrew Cuomo says Donald Trump's campaign message is: \"Be afraid of people who are different.\""},{"comment_id":"10153553147025927","commenter_b":"Send her into orbit!","commenter_a":"Racist","post_message":"Apparently Whoopi doesn't care if the DNC rigged the system. Why? Because it's against a white guy. #DNC2016"},{"comment_id":"10154859326468487","commenter_b":"We don't know wtf is out there - we could be in a giant terrarium","commenter_a":"And most American Christians are whiney little bitches. They have some nerve to plagiarize the Jesus myth and then steal all the pagan holidays that revolve around the axial tilt of the earth, and then pretend they're persecuted.","post_message":"Even though some Muslims have been in the United States for longer than many of the Protestant and Catholic descendants of German, Italian, and Irish immigrants, most Americans still believe Islam is odds with American values and way of life."},{"comment_id":"642882945885651","commenter_b":"Not really. Go read history..that's a facade...","commenter_a":"LOVE the Bush family! So presidential, respectful, and patriotic. Something I've missed for the last 8 years and the coming 4 years.","post_message":"President Obama, President George W. Bush, First Lady Michelle Obama, former First Lady Laura W. Bush, and others speak at the opening ceremony of the Smithsonian National Museum of African American History and Culture."},{"comment_id":"1458627227490636","commenter_b":"We refused to take Germanies Immigrants & the Nazi's killed 6 Million! Racist, Bigots still lurk in all corners of OUR Country!","commenter_a":"^5","post_message":"State Department figures show that 2,340 Syrian refugees arrived last month in the United States."},{"comment_id":"932169176839778","commenter_b":"And, they won't ever listen to us when they have all these illegals voting for them! I hope the Democratice citizens are taking note of all that is going on in our country!","commenter_a":"Americans had better listen to Anne Coulter. She is right and she is warning Americans what I have also been saying. We are losing America to illegal immigrants because of obama.","post_message":"A new Pew Poll found that only 24% of Americans want to increase immigration to the U.S."}]
