[{"comment_id":"519399201582629","commenter_b":"I hope one of hillary Clinton refugees knocks on your front door. . . You will probably be dead after that tho. . . She will continue to destroy this country and you want her to. . . Good job","commenter_a":"To bad his parents and Trump feed the poor kid lies. She has not been found guilty of anything and in this country you are innocent until proven guilty. You need to get of the Benghazi kick. The ambassador's family has come out and said it was not the State Department or Secretary Clintons fault. Grow up people. You would rather have a racists , hatred spewing, women hating asshole in office?","post_message":"BOOM!"},{"comment_id":"1755557531334252","commenter_b":"I love how the racist cunt doesn't realize Africa isn't a country lol","commenter_a":"Good. GTFOut. Go to Africa where it's guaranteed you'll have a black president. This half white didn't work out so well.Alec baldwin made the same statement. Liberals whine and cry when they don't get their way. About time to unleash that Trump ttain.","post_message":"\"The View\" host Raven Symone says she's leaving America if a Republican becomes president. Will you miss her?"},{"comment_id":"10154255735864411","commenter_b":"It doesn't hurt to have sense of humour :)","commenter_a":"It's pretty stupid how media outlets are sharing such pathetic content. It's Obviously and clearly not a frikin time traveller. What's even more pathetic, is how the public seem so hooked onto such rubbish.","post_message":"'Time travel is real?'"},{"comment_id":"10153929399138598","commenter_b":"she does NOT belong in prison","commenter_a":"You pig","post_message":"Woman Who Killed Her 25-Week-Old Unborn Baby and Threw Him in Dumpster Appeals Conviction"},{"comment_id":"1367266676644002","commenter_b":"Why do you think we have any right to tell another country anything?","commenter_a":"Why afford them any opportunity to keep growing their attempts for long range missiles?","post_message":"North Korea continues their aggression."},{"comment_id":"10154886159283010","commenter_b":"Hippie bitch is a nobody","commenter_a":"The left is still jockeying for attention...and this is the best they've got..Less than impressive..","post_message":"A political twist on a holiday classic."},{"comment_id":"10155239787299411","commenter_b":"Says the Muslim cunt !fuck you and Muhammad","commenter_a":"Is Denmark a Christian or Pagan country?Seems like a dictator country. Forcing people to embrace religion against their will. Sad to see another country being brainwashed to reject the immigrant after all the destruction they had done to their country. Evil system being employed by the world government to spread hatred and misery for their own expenses. Screw the Minister!!! Bunch of hypocrite running the top country post. N shame on the citizens whom do not do a about it/opposing the motion. U are just as two faced ass***e just like your leaders.","post_message":"'Un-Danish?'"}]
