[{"comment_id":"10153248513449087","commenter_b":"Stupid liberals so hope you run that old white socialist ass wipe.","commenter_a":"and democrats blame all the world's problems on Republicans, you old fart shut up","post_message":"\"In their world, every problem that you can possibly imagine is caused by Barack Obama,” Bernie Sanders quipped at a campaign rally in Boston. \"If there is rain, if it’s too hot, if there’s a mosquito in the room, it is all Barack Obama.”"},{"comment_id":"10152687938146813","commenter_b":"So what? Some women don't want to have kids at a particular time. Some never want to have kids. Second, most women who have abortions do so because of financial reasons. Third, contraception isn't 100% effective. Some types are only 75% or so effective. The diaphragm in a multi-para woman has a low effectiveness rate. I've been pregnant twice on oral contraception. Each woman has her own story. If she wants to tell it, she will. Otherwise, it's none of your damned business. Oh, and if my body is affected, it is my choice. I have self-autonomy over my body.","commenter_a":"Abortion is not a method to avoid pregnancy; a woman can avoid pregnancy by using birth control provided to her for free and not getting herself pregnant. Abortion is, in reality, simply a way to avoid MOTHERHOOD; it's not 'my body, my choice,' it's 'my LIFESTYLE, my choice.'","post_message":"The question matters: More people support abortion rights when the poll language focuses on women. #LetsTalk @webpagelink"},{"comment_id":"10153579142479170","commenter_b":"she's never right !","commenter_a":"Sorry the American voters frustrated you. You can just stay home and learn to deal.","post_message":"According to Hillary, we're all just too stupid to understand how brilliant she is. She gets frustrated by that, and admits that her frustration is her \"greatest weakness.\""},{"comment_id":"965007433534716","commenter_b":"2 pussy's","commenter_a":"Freya Mistry Rayan Mistry","post_message":"Donald Trump and Jeb Bush are fighting over who is tougher. What do you think?"},{"comment_id":"10153091519691680","commenter_b":"Yeah, but Vance. Don't forget the illegals & their anchor babies ? Factor them in, & you have a wipe out. Yes, foreign, along with illegals, WILL DECIDE THE NEXT PRESIDENT & GOVT","commenter_a":"Democrats only need 38% of the white vote-- we get that with no problem. Romney only got 24% of Hispanic vote and 5% of African American voter. Because of Trump, Hillary will EASILY get 85% of Hispanic vote. Hillary will also score 80% of Asian vote for a landslide win in electoral college","post_message":"Noncitizens are factored into the electoral college. @webpagelink POLITICO Magazine"},{"comment_id":"10153780658736350","commenter_b":"@username I have no clue what you are talking about but let me clue you and those like you in on something .... we wonder why kids are shooting up schools and bully each other to death when all they have to do is look at ignorance like you for an example. Sit behind a computer screen and throw insults around like you are all important. You get on a thread and bash a new born baby and his parents that take care of them selves and don't do anything what so ever to you and the likes of you. Instead of passing over a story you don't want to be a part of you get on threads and be an ugly soul and bully people that are happy for this couple or any couple that lovingly gives birth to a much loved and wanted baby. Since you brought up ...","commenter_a":"People have babies everyday! Women birth children under horrible circumstances... Alone .. In poverty ... How about focusing on that instead of these irrelevant people!!","post_message":"Congratulations, Jessa Seewald and Ben Seewald!"},{"comment_id":"1192807494093054","commenter_b":"@username Refugees are not illegal. Go troll someplace elst.","commenter_a":"Children are innocent, they can't be held guilty for anything their parents say or do. And my question is how can you hate war refugees, and many of them children, and still claim you're Christian. The tenet of the religion is to care for the stranger, the wretched, and the sick. Not sure what part of that is hard to understand. Jesus was a refugee, and so were his parents, we seem to forget that. Bravo to the troops, they're doing the right thing.","post_message":"Kudos to these vets for speaking out against Trump."}]
