[{"comment_id":"10153548365891350","commenter_b":"You girls are so funny I love how jealous women can be towards each other. GET OVER IT! there are lots of work out clothes like this. Just cause YOUR ASs can't fit in it doesn't mean everyone else that looks good in this type of workout clothes has to stop wearing them! Jealouse? Shut up bitch go run in the treadmill then!!!!","commenter_a":"What's the issue...? Some moms look like this, some are chunky. I had a very nice body after my first son, trying to get back to that now after having my second. There's nothing offensive about this at all, some women are just bitter and resentful.","post_message":"This was probably not the reaction Bugaboo was expecting..."},{"comment_id":"10154742195526178","commenter_b":"The X miss universe is Hillary's friend plus the miss X universe is in a world of hurt on her own now she's in trouble with the law","commenter_a":"RUSH: The thing that's ironic about this, they're claiming that Donald Trump bullied this ex-Miss Universe. Has anybody asked about Hillary Clinton bullying all of the bimbos that have erupted during the course of her and her husband's political career? This is so screwed up. If there is anybody in this campaign who doesn't pay women what she pays men in her office, it's Hillary Clinton. If there's a woman in this campaign that bullies other women and has been acclaimed for it, it is Hillary Clinton","post_message":"Now First Lady Michelle Obama is getting into it with Donald Trump."},{"comment_id":"853572084739045","commenter_b":"Lol! Wow!","commenter_a":"I agrees with the Judge! Come here by the proper channels! WTH","post_message":"Here's a breakdown of what the immigration ruling means."},{"comment_id":"10154274349426051","commenter_b":"CAN I HELP AL , GET THE HELL OUT OF THE U, S, A, DUMB ASS","commenter_a":"He is ALL mouth--did anyone really think any of these ppl. were going to leave? WHO would want them?","post_message":"The Rev. Al Sharpton has finally decided if he'll leave the country now that Donald Trump is President."},{"comment_id":"435422649916109","commenter_b":"Look at her scarf. Clearly a terrorist","commenter_a":"Who do you trust these days? Don't call a cop on a cop.FOP same as KKK. FATURNTY ORDER OF POLICE.I see FUCK OTHER PEOPLE.","post_message":"BREAKING: Cop Says He Doesn't Need a Warrant, Forces Way Into Woman's Home  Video posted by Facebook user New York, NY resident Diane Malikah Moomin Pinkston with this caption (Follow The Anti-Media for further updates on this story)  'Just happened about an hour ago April 9, 2015 2pm they didn't give me their names or badge numbers . They ran like cowards wanting people to do their ob for them and they get paid. they all left without giving me their info. this is what the system allows them to do. And I'm holding the whole system responsible. they keep screwing up n need to pay to make sure this never happens again.'  Update: the victim of this warrantless search has posted another video responding to this incident: @webpagelink  via The Rundown Live  Full story: @webpagelink"},{"comment_id":"10153512476881337","commenter_b":"Dat nigga is fuccin NASTY!!!!","commenter_a":"AE Guy Hung Nhi Vo","post_message":"GET EXCITED: The Predator is about to enter the Mortal Kombat X world..."},{"comment_id":"1563692830591111","commenter_b":"'@username We don't need to build a wall... we need to make all employers use E2Verify, get our Congress to quit allowing corporations to import H1b and H2b workers... Then move military bases from sanctuary cities and put them along the border...use the open spaces for war practice and bombing ranges to collapse the tunnels.","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, preserve the sanctity of the unborn life, preserve the sanctity of the 2nd amendment ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness","post_message":"We cannot pretend the problem does does not exist. We need to build the wall- in order to make America safe now-- and for future generations!"}]
