[{"comment_id":"10154668593434062","commenter_b":"Yes, and the NFL approved it and promoted it. If you're going to boycott anything it should be NFL products.","commenter_a":"For those that are clueless or ignorant, she endorses and is promoting the black panther party, which is a racist militaristic organization whose motto is literally \"kill whitey\".","post_message":"Online opinions are intense."},{"comment_id":"10153575842934087","commenter_b":"If she withdraws we can toss her and Bernie a Peanut.","commenter_a":"Of course, who wants to be a target for Hillary shaming?","post_message":"Pressure is building on Democrats to rally behind front-runner Hillary Clinton after her strong Super Tuesday showing, but 22 House members and five senators are holding back."},{"comment_id":"1108048615955838","commenter_b":"Betty is a murderer!","commenter_a":"Just joined. Is this purge night or something","post_message":"WATCH LIVE: Protesters are filling the streets in Charlotte after police say an officer shot and killed an armed man. @webpagelink"},{"comment_id":"10154106990671409","commenter_b":"God help us if this is all they can trawl up for person of the year . He is only out to fill his own own pockets further. This misogynistic , ecogotistical man is only out for himself, and will turn out to be america's biggest mistake.","commenter_a":"He's NOT a PERSON!!! He's an orangatan and inhumane ethnocentric lying bully.","post_message":""},{"comment_id":"10153382960318717","commenter_b":"I used to not like Mr. Trump. Then started to like him...sort of. Now I dislike him again.","commenter_a":"He's a prick","post_message":"The New York Times is angry that Donald J. Trump mocked one of its reporters who has a physical disability: @webpagelink"},{"comment_id":"1628546037432509","commenter_b":"Go get those evil men!","commenter_a":"Exactly... Agree with you @username!!","post_message":"WHOA! This weapon is like something out of the Iron Man movie..."},{"comment_id":"1458627227490636","commenter_b":"We refused to take Germanies Immigrants & the Nazi's killed 6 Million! Racist, Bigots still lurk in all corners of OUR Country!","commenter_a":"^5","post_message":"State Department figures show that 2,340 Syrian refugees arrived last month in the United States."}]
