[{"comment_id":"1583910615243254","commenter_b":"She's worth no comment","commenter_a":"Illuminate","post_message":"VIDEO! Cops are being slaughtered since Beyonce's Racist anti-cop performance. In 8 days 8 cops were murdered, and many more shot!  SHARE THIS EVERYWHERE!"},{"comment_id":"1902414739981573","commenter_b":"Do these woman have any idea how stupid they are?","commenter_a":"How stupid","post_message":"Whoopi Goldberg: Right to Celebrate Christmas is the Same as a “Woman’s Right” to Abortion"},{"comment_id":"569916976504180","commenter_b":"'@username, different country different faith but people still using the text to justify murdering gays. Was it the predominantly Muslim US States that passed the 'Gay panic defense?' @webpagelink","commenter_a":"Good on you, Bruce. Christians warned us about Sharia law, and now they've imposed their version of it on us. Irony?","post_message":"'Some things are more important than a rock show.'"},{"comment_id":"1115942415111321","commenter_b":"You are a woman, you are worthless, you shouldn't vote. See? That's how you sound. Btw, #hillaryforjail.","commenter_a":"I did not know Gov. Mike Pence. Thanks @username, I like his backbone. Voting Trump/Pence Donald J. Trump thanks for standing firm for the safety of America.","post_message":"If you ever had any doubts about Donald J. Trump sticking with his divisive and dangerous plan for America—say hello to his new running mate."},{"comment_id":"1673100576267383","commenter_b":"Happy Birthday Goldie, what a delight you have been over the years!","commenter_a":"Yep, gotta love our girrrrrl....","post_message":"Happy birthday, Goldie Hawn!"},{"comment_id":"10154031990961636","commenter_b":"Yusuf Saleh shut up","commenter_a":"It disturbs me that people have used the laughing response to this. Because domestic violence and child abuse (not to mention sheer ignorance and sexism) is just hilarious(!)","post_message":"He's on the run"},{"comment_id":"10153361867349726","commenter_b":"He has no womb case closed Obummer has no morals or common sense","commenter_a":"The country is damn near in chaos and he takes the time to talk about this BS...","post_message":"WATCH: Obama: Caitlyn Jenner Showed 'Tremendous Courage'"}]
