[{"comment_id":"10153784197573132","commenter_b":"Dig these hard chicks","commenter_a":"Way to go ladies! Proud of you. You are true role models.","post_message":"True role models."},{"comment_id":"10153256940195736","commenter_b":"God forbid we put them in shelters and feed them.","commenter_a":"I have advocated for helping the homeless for a decade but it has gotten out of hand over the last couple years...which is to be expected, given we've mostly ignored the problem. These folks belong in Wapato and Wapato needs to be converted into a mental health care site.. They commit crimes against society -- leaving garbage around is just a visible symptom but when folks aren't looking, they misbehave in more destructive ways. They need to be 'rebooted,' in the computer sense, not the kick-in-the-pants sense. Though some of them need that as well...","post_message":"Mayor Hales said today was the first of several in which the homeless will be moved out of city parks."},{"comment_id":"1317246778287960","commenter_b":"She'd have been funnier if she'd have swallowed her Mic..","commenter_a":"What the he'll is wrong with these mean girls, this country? You don't do that to ANYONE! Not ANYONE EVER! This show allowed this? We teach our children it's wrong, if it was done in school it's called bullying....my God! She should lose her modeling contract!!! Stop this Madness!","post_message":"Gig Hadid threw some serious shade at Melania Trump tonight..."},{"comment_id":"998169870194483","commenter_b":"Dicks","commenter_a":"How the hell does anyone defend this crap?","post_message":"Their Orwellian alternative to paid family leave -->"},{"comment_id":"10153066527856336","commenter_b":"Please woman go troll somewhere else","commenter_a":"Poor guy","post_message":"Bristol Palin is engaged to Medal of Honor recipient Dakota Meyer – the Kentucky native is credited with saving the lives of 36 Marines, Army soldiers and Afghan soldiers."},{"comment_id":"1188648117842550","commenter_b":"America shouldn't change Muslims need to adapt to our cultures","commenter_a":"UN","post_message":"MUSLIMS FLIP OUT! McDonald, Pizza Hut And KFC Refuse Muslim Demands To Serve Halal...  Time to go eat a Big Mac! Can we get 10K LIKES for this!"},{"comment_id":"10153392413471748","commenter_b":"Abortion is safe cause ha aint getting in","commenter_a":"Historically, once extremism takes hold, it is very, VERY difficult to put the genie back into the bottle. As long as the extremists face no serious consequences, they will just get more and more radical in their pronouncements and actions. Only when there is a very strong backlash is there any chance of them backing down, as we saw when the anti-communist witch hunts were finally contained. But religious extremism like Huckabee's is much harder to deal with (as Goldwater presciently saw), because they regard all resistance as persecution and attacks by spiritual enemies. Sadly there is a chance, even if it is small at the moment, that America will ride the tiger of extremism to disaster. And unlike Germany after WW2, there would be unlikely to be any second chances, any opportunity for redemption, because a radical, apocalyptic, theocratic USA would almost certainly initiate WW3.","post_message":"Mike Huckabee thinks that as president, he could prevent literally all abortion."}]
