[{"comment_id":"1652752338307075","commenter_b":"Wow what a dumb bitch. She's also so stupid that she thinks all Muslims are from other countries. That's funny. Pretty sure my Muslim aunt was born and raised American and so are her children!","commenter_a":"LOL They must be Muslim, people are loosing their minds, they come to a western country, because they don't like there Muslim rules, now they want to change things hear. Can we petition to Ban all Muslims???? Maybe they are color blind!!!!!","post_message":"Students sign petition to ban the song \"White Christmas.\" This is how crazy political correctness is on campuses today!"},{"comment_id":"10154901503909641","commenter_b":"From our childhood we used to draw it on our notebook hoping for good fortune and will continue I dun care what the world says","commenter_a":"James Higgins-Durnan","post_message":"Conal Footwear apologized and recalled a line of boots after a viral image showed they left swastika imprints @webpagelink"},{"comment_id":"517019608487085","commenter_b":"Hell no, they can NOT stay! They are all guilty of a criminal offence. They are here ILLEGALLY, you dumb...","commenter_a":"The only path they should get is the road to the border where they would be deported.","post_message":"\"For the 11 and a half million who are here illegally, if they've not committed a crime since they've been here, I would give them a path to legalization.\" Today on \"Fox News Sunday,\" John Kasich discussed immigration."},{"comment_id":"1264161686965709","commenter_b":"Sounds like the brides need to chill the hell out lol i would rather go on a awesome honeymoon then spend that kinda money just to walk to a isle... But that's just me and I'm a very different kinda women.","commenter_a":"Retarded....","post_message":"And about $16,000 of that is for the venue alone... STORY: @webpagelink"},{"comment_id":"370446236477004","commenter_b":"Take the bastards OUT!","commenter_a":"Time for drone, and Hell Fire missles.","post_message":"Is your state on the list?"},{"comment_id":"1770528716571181","commenter_b":"@username you like being grabbed by the pussy,, I can see that from 100s of miles away. Lmao!!!!!!","commenter_a":"Come on. It's more like a Dr. who accidentally discloses he didn't go to med school, let alone college and is practicing without a listener and has a large number of outstanding malpractice lawsuits against him. But you still trust him.","post_message":""},{"comment_id":"1538803016422900","commenter_b":"EVIL WOMAN!","commenter_a":"WHAT IS THAT, AN ALBINO MONKEY????????","post_message":"Did Hillary Clinton get her money's worth?"}]
