[{"comment_id":"1214141488640014","commenter_b":"See what happens when the Muslim population increases? Get It?","commenter_a":"FYI","post_message":"WOMEN IN FRANCE Fight Back After Muslim Men BAN Them From Sharing Public Spaces [VIDEO]"},{"comment_id":"1035959943168617","commenter_b":"@username Trumper Humpers have elected her through their ignorance.","commenter_a":"We will never forget scum like u Vote TRUMP","post_message":"Did Obamacare deliver lower premiums & more choices? No. Our office has done the research. Read our full report here: @webpagelink"},{"comment_id":"435422649916109","commenter_b":"Look at her scarf. Clearly a terrorist","commenter_a":"Who do you trust these days? Don't call a cop on a cop.FOP same as KKK. FATURNTY ORDER OF POLICE.I see FUCK OTHER PEOPLE.","post_message":"BREAKING: Cop Says He Doesn't Need a Warrant, Forces Way Into Woman's Home  Video posted by Facebook user New York, NY resident Diane Malikah Moomin Pinkston with this caption (Follow The Anti-Media for further updates on this story)  \"Just happened about an hour ago April 9, 2015 2pm they didn't give me their names or badge numbers . They ran like cowards wanting people to do their ob for them and they get paid. they all left without giving me their info. this is what the system allows them to do. And I'm holding the whole system responsible. they keep screwing up n need to pay to make sure this never happens again.\"  Update: the victim of this warrantless search has posted another video responding to this incident: @webpagelink  via The Rundown Live  Full story: @webpagelink"},{"comment_id":"10154534955796336","commenter_b":"Hillary will NEVER do time for all the crimes she has committed. She and Bill have been getting away with their CRAP for YEARS. Just because it's a different year, doesn't mean anything will change.","commenter_a":"Hillary Clinton will win the election in November. Then, sometime between November and January, Hillary will be indicted. The IRS is now investigating the Clinton Foundation and the whole e-mail thing isn’t over yet. Once under indictment she won’t be able to assume the Office of the President in January. Tim Kaine, who will not actually be the Vice President because neither he nor Hillary have been inaugurated, cannot assume the Presidency. The Speaker of the House can’t move up to it because there is already a sitting President and Vice President. So President Obama, in an Executive Order citing “emergency situation,” gives himself another four years in office is the only way possible. Obama has been planning this for a while now, knowing he has enough on Hillary to indict her. Had the Attorney General indicted her based on evidence from the FBI this plan wouldn’t have worked because ...","post_message":"\"The terrorists overseas utilize our strengths – which are compassion and empathy – against us.\"   Kris \"Tanto\" Paranto, who survived the attack in Benghazi, expressed his support for a more rigorous vetting process for refugees."},{"comment_id":"10153315040146336","commenter_b":"If the engine can take the stress of lifting a couple of hundred ton into the air at 700 mph I think it's ok after this girl sat on it......just me but then again I'm not STUPID either.........","commenter_a":"Absolutely not!","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"10154164626642293","commenter_b":"This is so very tragic and sad. Based on the videos that have been released, this officer appears to have fired for no reason. Police need to be held accountable, just like everyone else, when they break the law.","commenter_a":"And we need female policepersons exactly why?","post_message":"Officer Betty Shelby has been charged with manslaughter for the shooting of Terence Crutcher."},{"comment_id":"10154075834221336","commenter_b":"Jen Beth -I'll probably do that too, but if Trump wins the nomination, Hillary becomes President.","commenter_a":"The only ones surprised at this are fox news , democrats and rinos. The people will put Donald J. Trump in as president","post_message":"\"I'm going to win states that nobody else is going to win on the Republican side... And we will get a lot of Democrats and Independents to cross over.\" – Donald J. Trump"}]
