[{"comment_id":"1082496428446957","commenter_b":"Taxpayers fund churches!! Churches don't pay taxes! Planned Parenthood is doing a service that they are legally allowed to preform because there are women choosing to have those services done. Christians have no right do insist this be stopped just because of their religious beliefs. I'm sick of Christianity being all high and mighty thinking that it is the end all be all of decision making for everyone else on the planet. Not everyone is a Christian and not everyone must be. Defund your churches!! Make the churches pay taxes!! Every time a Christian stops an abortion make a Christian take in an illegal alien and put him/her through school/college!! Stop hiding behind your bible and pretending to actually care about the embryos because we all know when you're not cursing abortion your wishing gays would go away and praying extra hard that your children won't turn out to be ...","commenter_a":"You know what's really ironic? Your religious organization doesn't pay taxes yet you're complaining about the money spent on abortions. Another thing is that you want to stop abortions but there's starving children right there in your neighborhood and your church and its congregation all have food on their tables, cars, cell phones etc. Then, you even complain about paying for birth control because it goes against your religious beliefs but then you expect non Christian tax payers to pay for your churches. In addition, you believe that your Christianity should trump my rights as a woman and you should decide what I should do with my body because of what your bible says. Well, I'm telling you NO!! Abortion is legal and its going to stay that way because of people like you. Women like me will always be here to stand up for our rights not only just ...","post_message":"Planned Parenthood has made a business out of destroying that which God has created. The one-sided relationship between it's ever-growing bank account and American taxpayers must be severed. That is why I introduced the \"Defund Planned Parenthood Act of 2015.\"   #ProLife #DefundPP"},{"comment_id":"835165216569680","commenter_b":"Don't accept it. Doesn't matter to me. I still have the right to marry...whether you like it or not.","commenter_a":"We Christians do not recognize this, not accept this, just ignore this. Just because MAN says it does NOT mean it is true. God is our Commander, Lord and Leader. Whatever He has stated is so; with His statutes we will stand, and believe Him forever. Look up everyone, for our redemption draweth nigh. . .","post_message":"So much for state rights. Where do we go from here? #SCOTUSmarriage"},{"comment_id":"1089067221104747","commenter_b":"it's only good enough for those of us that don't pray to the gun god!","commenter_a":"Republicans; \"Carry a gun everywhere, except near us.\"","post_message":"If conservatives are so convinced that gun-free zones attract killers, then why do so many conservative places and events ban guns?"},{"comment_id":"10153540589586323","commenter_b":"Oh my god did you even read the article!! The number ending up at Calais is miniscule, the article also states most don't even know about our benefit system so maybe we left behind a massive impression after colonising half the world they figure we are the country they admire or can relate to, to be honest i don't care, if its they live or die then they should live here","commenter_a":"Those people in calais are not true refugees or asylum seekers, if they where, they would claim fir asylum in france. EU law says that they should claim asylum in the first safe country they arrive in. Last time I checked, france is a safe country, so is spain, italy, germany, and many other eu countries. What I don't understand is why there are over 5,000 of these so called asylum seekers camping in calais trying to get into the uk. If you are a genuine asylum seeker, you don't get to pick and choose where you want to live.","post_message":"When you’re facing the world’s biggest refugee crisis since the second world war, it helps to have a sober debate about how to respond. But to do that, you need facts and data – two things that the British migration debate has lacked this summer.  These, in the clearest terms, are the 10 key facts."},{"comment_id":"998886506840133","commenter_b":"How about Obombas birthday?","commenter_a":"stupid dicision","post_message":"NYC Schools Close for Muslim Holiday for First Time  @webpagelink"},{"comment_id":"10153703182846438","commenter_b":"lolz u wot m8","commenter_a":"just look at them..smh ....what idiots and morons","post_message":"Why his supporters stick with him despite all his gaffes and lies."},{"comment_id":"10153347951697144","commenter_b":"that's most likely it - when people camp out, they live somewhere, and the fault line between public and private gets blurred.","commenter_a":"why didn't they want the press there?","post_message":"Finally."}]
