[{"comment_id":"10154479449143271","commenter_b":"Happens to every girl.","commenter_a":"LoL OMG! When I was 14 I lived off of 14th and Pierce by Casa Bonita....and had to catch the bus on Colfax for school. If I would have reported every dude who cat called, they would have needed a daily report for me alone on the news. I'm really not trying to down play the fact that this guy could have been a weirdo but this seems a little extreme.","post_message":"Keep an eye out, Colorado. This man reportedly tried to follow the girls home after they ran away from him."},{"comment_id":"10150862465429999","commenter_b":"Here, here.","commenter_a":"The truth in the matter is that Washington is all about who has power and control of the agendas, no matter how awful their candidate. Withdrawing support from Awful Trump means conceding power to awful Hillary and the equally awful Democrats. The only way to break this power struggle is to elect more third party candidates that will force our elected public servants to compromise for the benefit of the American People.","post_message":"It's time for John McCain and other Republican leaders to set an example for their party by withdrawing support for Donald J. Trump, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"10153345787268984","commenter_b":"She's a corn ball","commenter_a":"Yes, She Is Crazy!","post_message":"Christians are ripping Hillary to shreds over this. What was she thinking?? Do you think Hillary's already done enough damage to America?"},{"comment_id":"1683253511914514","commenter_b":"@username Trump & FOX NEWS have Greatly Exaggerated This Issue The Lying About the Protesters IS On TV Footage & They Still FLAT-OUT LIE.... Why is Fox NEWS Saying it was Violent Protestors, The Media Was there you can See Who are the Aggressors it was the Trump Supporter, but the Trump Supporters Started Sucker Punches Again, Most of the protestors inside were young White Girl with locked armed, the Protesters Outside were very peacefully walking around Outside with their signs until the Inside Trump Supporters Went Out Side & started Yelling & Pushing Protesters, it's on CNN. Trump Calls CNN & Tell them they were violently attacking, He Ran Off as soon as he saw there was more than one Protestor there's Footage...Trump Lies & Exaggerates everything 1000 Times Fold !! TRUMP Wants to Turn Our Military INTO Brainless Terrorist Animals To Beat ISIS, Our Military Has Rules & ...","commenter_a":"After tonights Chicago thuggery, trump will probably win every state voting on Tuesday in a landslide lol","post_message":"Marco Rubio is urging Republicans in Ohio to vote for Gov. John Kasich in order to prevent Donald J. Trump from winning, according to published reports and comments from his own people."},{"comment_id":"10151087068944999","commenter_b":"ALL ILLEGALS LEAVE AMERICA NOW!","commenter_a":"I wonder how many of them are legal immigrants. What's wrong with deporting illegal immigrants?","post_message":"On Thursday, foreign-born residents stayed home, or took to the streets, in protest of President Trump's immigration policies."},{"comment_id":"10154362244534778","commenter_b":"This is a symptom of disrespect. Did the office overreact, perhaps. What do you do with a teenager that doesn't listen to authority? Continue to let her disrupt the class? This girls deserves to be punished. She may have gotten hurt because of her initial defiance but she is not a victim. They should review the incident and I hope they clear the officer of everything and I hope they give the girl detention. If we don't stop the disrespect, the result is anarchy.","commenter_a":"This kid did not attack anyone she may have ignored commands peacefully as most protestors will do but in no way is that a crime. The violent attack from this cop was in fact a crime.","post_message":"About 100 students wore T-shirts reading \"Free Fields\" or \"#BringBackFields.\""},{"comment_id":"923707264362696","commenter_b":"Then fuck off with THAT bullshit. You ain't Gods gift to women. 😂😂✋","commenter_a":"Why are dudes so obsessed with a woman's personal life? Why do you need to know that and why does that information matter? The real issue is are you both STD free, not how many people someone has had sex with. Evolve please!","post_message":"When She Says She Only Had Sex With 3 Guys"}]
