[{"comment_id":"897791007078142","commenter_b":"Shes ugly","commenter_a":"Gosh is she going to lose in PA again?","post_message":"Hillary makes disturbing announcement about development in Pennsylvania. We could be looking at history right now. Will you refuse to let Hillary be your president?"},{"comment_id":"10156224999290551","commenter_b":"Go back to your own shithole country.","commenter_a":"Let's wrap them up in bacon and send em back to where they come from😎","post_message":"Trump was right - Muslims did celebrate 9/11."},{"comment_id":"765017110298136","commenter_b":"I agree. That would stop illegals dead in their tracks!","commenter_a":"If they would allow the soldier to shoot that vermin off the fence, that shit would end","post_message":"For some reason, this truth is lost on liberals, but what isn't?"},{"comment_id":"1002765619855375","commenter_b":"She's not that classy oh wait well anyways lmfao whatever get off the trip people smh","commenter_a":"I think it's funny how she's trying to show 'modesty' When we've all seen her naked already. Lmao","post_message":"Social media thinks Melania is channeling Jackie O this morning. Your thoughts? @webpagelink"},{"comment_id":"10154051432298445","commenter_b":"Listen you little bitch ur just mad because","commenter_a":"Come on they just want to get paid like everyone else....shut the fuck up and give them their chop...before you end up paying an arm and a leg for mr.college degree but cant find a job in the field i studied for...to show up and try to charge u 30% of ur crop this is America only place they have buffets js","post_message":"#TBT to 2015. 'trimmigrants.' had trouble finding work, created tension after arriving in Humboldt expecting trim jobs.   Humboldt friends - has the atmosphere changed?"},{"comment_id":"10154803405263128","commenter_b":"'@username - worked at Her campaign she is the most corrupt person with Her $150 million from countries w Sharia Law - Killary wants globalization. Google Bilderberg Group","commenter_a":"I've lived in Utah for almost 3 decades. The state's Mormon mouthpiece, The Deseret News, has already denounced Cinnamon Hitler as 'evil' and a wannabe dictator. That should be a warning to all you Republican conservatives out there of the quality of your candidate.","post_message":"While most political prognosticators are closely tracking a familiar group of about 10 presidential battleground states, Utah is emerging as one of the most surprising wild cards in the 2016 race."},{"comment_id":"1803612926545625","commenter_b":"I agree ...where they trained to beat the crap out of people because they ran....smh","commenter_a":"What they fail to mention is that even if this man was the actual perpetrator it's still inexcusable for the cops to beat him unless he was resisting. The police's job in this case is to apprehend suspects. Suspects are innocent until proven guilty and should be treated as such.","post_message":"'I've never been cursed, physically abused, beaten and treated like a slave as I was two days ago.' A retired corrections officer says he was assaulted by Garden City Police in a case of mistaken identity. CBS2's Carolyn Gusoff shares his story: @webpagelink"}]
