[{"comment_id":"1260234220691789","commenter_b":"We don't care anymore you protested us to death.","commenter_a":"UI hope these idiots Freeze out there in MN","post_message":"LIVE NOW: Protest against Trump's immigration order happening in Minneapolis, Minnesota. STORY: @webpagelink"},{"comment_id":"1310724188980341","commenter_b":"This woman has nothing better to do.","commenter_a":"idiot","post_message":"Hey, stop \"appropriating\" our language..."},{"comment_id":"10154698288912178","commenter_b":"If anyone would like to help the family they do have a gofundme account .","commenter_a":"They did do a GREAT job...we were actually driving by when all this was happening.","post_message":"Emergency workers were able to rescue a dog trapped inside an Aberdeen home that caught fire this afternoon. Story>> wral.com/@username/"},{"comment_id":"10156572511460725","commenter_b":"You just hit a grand slam Ron! Trump 2017-2025","commenter_a":"Donald Trump - Think about it... will they stop him, Democrats and Republicans alike? This affects all Americans who get the short end of the stick Democrats and Republicans and Independents. Interesting take on Donald Trump Former U. S. Secretary of Education , William J. Bennett's frankly candid and shocking observations of Donald Trump's impact on the behavior of the entrenched Washington D. C. bureaucrats in both parties -- and the risk The Donald faces in so doing. William J. Bennett, Host of Bill Bennett's Morning in America Show, is one of America 's most important, influential, and respected voices on cultural, political, and education issues. He has one of the strongest Christian world views of any writer in modern times. What I See Happening In a Trump Presidency By Bill Bennett They will kill him before they let him be president. It could be a Republican or a Democrat ...","post_message":"What a great honor- the Reverend Jerry Falwell Jr. of Liberty University, one of the most respected religious leaders in our nation, has just endorsed me!"},{"comment_id":"10154700832214369","commenter_b":"Stfu crackers","commenter_a":"Time to play the National Anthem.... they will all take a knee then they can swoop in for a mass arrest.","post_message":"Violent protesters rampaged through Charlotte as anger continued to build over the deadly police shooting of Keith Lamont Scott"},{"comment_id":"679207482232542","commenter_b":"Criminal woman Brave !!","commenter_a":"Hillary is so brave for being a woman!","post_message":""},{"comment_id":"495708673953046","commenter_b":"A Bullet to the head! No need to play nurse maid to this POS!","commenter_a":"shitbum","post_message":"This thug thought he was tough, not so tough now.   Good, he got exactly what he deserved. He is scum.  Do you agree all thugs should be deported?"}]
