[{"comment_id":"10154654618245575","commenter_b":"@username are you by chance a Libetard? from cali ?","commenter_a":"The President to be mocks the loser that's really Presidential.","post_message":"TRUMP MOCKS HILLARY ON HER CANCELLED FIREWORKS SHOW! ---VIDEO"},{"comment_id":"875104725882610","commenter_b":"muslims are worthless anyway..","commenter_a":"go ahead we will be happy for that!!","post_message":"And Turkey says the whole site will be banned if it does not obey"},{"comment_id":"480214172160463","commenter_b":"Angry old white woman, I wonder where her people came from? Hell?","commenter_a":"The old lady isn't smart enough to know another language.","post_message":"Portrait of a Donald Trump Supporter. (2015)"},{"comment_id":"10155201433711320","commenter_b":"There's no Native American blacks and Latinos in Eastern Europe. The perfect place for RACIST AMERIKKKA","commenter_a":"Yeah the country is being lead by white supremacy you people find this okay?? oh wait a minute...This is RACIST AMERIKKKA. WHAT more can you expect.","post_message":"This is a live look at Washington, D.C.  Are you pleased with what our nation's leadership is doing right now?"},{"comment_id":"10155239787299411","commenter_b":"Says the Muslim cunt !fuck you and Muhammad","commenter_a":"Is Denmark a Christian or Pagan country?Seems like a dictator country. Forcing people to embrace religion against their will. Sad to see another country being brainwashed to reject the immigrant after all the destruction they had done to their country. Evil system being employed by the world government to spread hatred and misery for their own expenses. Screw the Minister!!! Bunch of hypocrite running the top country post. N shame on the citizens whom do not do a about it/opposing the motion. U are just as two faced ass***e just like your leaders.","post_message":"'Un-Danish?'"},{"comment_id":"10153760611904087","commenter_b":"@username not as big of a liar as HilLiary!! She's the queen of lying, pandering and flip flopping! #WhichHillary","commenter_a":"Thank you VP Joe Biden for saying: \"I feel confident that Hillary Clinton will be the nominee and I feel confident she'll be the next president\". Coming from you that's awesome!!!","post_message":"“I feel confident that [Hillary Clinton] will be the nominee and I feel confident that she’ll be the next president,” said Vice President Joe Biden."},{"comment_id":"551602895008576","commenter_b":"Every time he speaks I vomit in my mouth","commenter_a":"Obama said on Nation wide TV that the Syrians are like people who came over on the Mayflower. Oh really. We know how he came over. On an elephant from Kenya. Too bad today isn't his last day.","post_message":"Here's why President Obama says accepting Syrian refugees is the ultimate American thing to do. Do you agree with his message?"}]
