[{"comment_id":"10153268798664170","commenter_b":"I'm sure asexuals all over are just shaking their heads and thinking the rest of the world is delusional in this quest for 'happiness' which Hollywood and Madison Avenue thrive upon.","commenter_a":"Gay conversion therapy.... Sounds like a good way to convince gay youth to commit suicide. Let them be who they are. Perhaps we should have idiot religious zealot therapy","post_message":"I think families can make this decision for themselves, don't you?"},{"comment_id":"1565559713753745","commenter_b":"Boy are you missing it!!!! Blacks kill each other 1000% more!!!!","commenter_a":"Wow. I didn't really support this dudes agenda before but after this, I can get down with him somewhat. It's a shame a man from another country has to speak on behalf of black Americans.","post_message":"'Why are you Americans killing the black people there, shooting them down when they are already on the ground?' he said. 'Answer that question, because even if it's just one or two or three, it is still human rights violations.'"},{"comment_id":"10154079186342541","commenter_b":"'@username what are you talking about ?","commenter_a":"Officers do well checks. Would have taken a few seconds for a FB friend to call the cops and have that phone traced.... SMH.","post_message":"'It's amazing for someone to sit there and see somebody or hear them take their last breath, and nobody did anything.'"},{"comment_id":"10152602775901636","commenter_b":"She could have kept going, but she also could have allowed the crazy lady to get a great distance away from her. She had a kid in the car. Why engage someone and put yourself and your child in danger? I do not blame the victim, however, she could have made the decision to pull over for 3 minutes or so to put some distance between them.","commenter_a":"Maybe that was the road she needed to take? So it's her fault for continuing to drive like she's supposed to??? Geeze","post_message":"Things take a scary turn when the woman stops her vehicle, gets out and walks up to the car."},{"comment_id":"735467686595927","commenter_b":"Immigrants are welcome here. Illegal aliens are not.","commenter_a":"I'm very proud of my family's race. I'm white my stepfather is Mexican and he's from the states my grandparents are from Mexico so I believe that they have the right to come to the United States and make something out of yourself and y'all want to say here and criticize them being immigrants and using us for money when they're the ones that will work harder than any other people . So as I was raised this post be a free country and we supposed to love each other not hate each other and be there for each other. But with everybody with all this hate and everything yeller going to regret it because the day that you have to go and speak to the heavenly father is the date you're going to have to answer for how your reactions are everybody should be equal. So I'm very proud ...","post_message":"Live from Donald Trump protest in River Oaks: coverage all day on Eyewitness News"},{"comment_id":"10153721390631800","commenter_b":"'@username Girls, that's who.","commenter_a":"I can't see the humor in girls trying to look sexy and then being offended by aroused boys and then also being offended when boys don't care about them. I think the problem here is with the girls identity crisis rather than with boys boners.","post_message":"Kristen Schaal finds a way to prevent teenage boys from being too 'distracted' by girls in leggings. @webpagelink"},{"comment_id":"10152995083802869","commenter_b":"Isn't there something about judging a tree by the fruit it bears. This sir, is what you stand for and represent.","commenter_a":"I can't believe he found a woman stupid enough to marry and procreate with him.","post_message":"Janet and I want to affirm our support for the Duggar family.  Josh’s actions when he was an underage teen are as he described them himself, 'inexcusable,' but that doesn’t mean 'unforgivable.'  He and his family dealt with it and were honest and open about it with the victims and the authorities.  No purpose whatsoever is served by those who are now trying to discredit Josh or his family by sensationalizing the story.  Good people make mistakes and do regrettable and even disgusting things.  The reason that the law protects disclosure of many actions on the part of a minor is that the society has traditionally understood something that today’s blood-thirsty media does not understand—that being a minor means that one's judgement is not mature.  No one needs to defend Josh’s actions as a teenager, but the fact that he confessed his sins to those he harmed, sought help, and has gone forward to live a responsible and circumspect life as an adult is testament to his family’s authenticity and humility.  Those who have enjoyed revealing this long ago sins in order to discredit the Duggar family have actually revealed their own insensitive bloodthirst, for there was no consideration of the fact that the victims wanted this to be left in the past and ultimately a judge had the information on file destroyed—not to protect Josh, but the innocent victims.  Janet and I love Jim Bob and Michelle and their entire family.  They are no more perfect a family than any family, but their Christian witness is not marred in our eyes because following Christ is not a declaration of our perfection, but of HIS perfection.  It is precisely because we are all sinners that we need His grace and His forgiveness.  We have been blessed to receive God’s love and we would do no less than to extend our love and support for our friends.  In fact, it is such times as this, when real friends show up and stand up.  Today, Janet and I want to show up and stand up for our friends.  Let others run from them.  We will run to them with our support."}]
