[{"comment_id":"979014955531025","commenter_b":"Yes yes Milana the porn star.","commenter_a":"Did anyone besides me have flash backs to Jackie Kennedy when Melania walked out Classy dressed to the nines This lady loves America This lady will be a great first lady","post_message":"Donald J. Trump made a dramatic entrance at the GOP convention and introduced his wife Melania Trump. #RNCinCLE @webpagelink"},{"comment_id":"1588672124482344","commenter_b":"Shut up phonies","commenter_a":"U need to find out mr trump how much killary and obama paid her to do that","post_message":"Meryl Streep blasted Donald Trump and the people who voted for him at the Golden Globes. She received thunderous applause from most of the celebrities gathered there. Do you agree with Trump's assessment of her career?"},{"comment_id":"1069463933089027","commenter_b":"All abortions are murders !","commenter_a":"he knows what we all know, the muslim is a fool a joke a laughing stock a disease forced on AMERICA","post_message":"*****BREAKING NEWS*****"},{"comment_id":"992220407519685","commenter_b":"Meghan Sullivan","commenter_a":"Hold up! Imma let you finish, but I just wanted to say Bernie Sanders had one of the best shut downs of all time!! #feelthebern","post_message":"Bernie Sanders to Hillary Clinton: \"Excuse me, I'm talking.\""},{"comment_id":"378908105805941","commenter_b":"These people are demon possessed. They need to be stopped.","commenter_a":"Trumps fault","post_message":"MUSLIM MEN WHO RAPED 11-YEAR OLD Shout \"Allahu Akbar\" At Sentencing...The Girl Had A Baby At 12   No remorse whatsoever..."},{"comment_id":"1779215949028239","commenter_b":"#Fuckhillary #Neverhillary #Nevertrump","commenter_a":"#neverhillary","post_message":"Matt Lauer asks Hillary Clinton about the qualities that make her qualified to become Commander-in-Chief.  More coverage on @webpagelink"},{"comment_id":"10152893024866051","commenter_b":"Yeah ? How bout someone take a cane to your goofy ass an lets see if it looks like paint..Oh no...lets not.... forgot your ass looks like a map from rand mcnally with all those ugly stretch marks....yuck","commenter_a":"That looks like paint, not blood.","post_message":"This man’s wife has been found guilty of domestic abuse against him. Even she wasn't expecting so much jail time."}]
