[{"comment_id":"10153874849832439","commenter_b":"I heard her spine landed on top of police car. Best news I heard today! Rot in hell psychotic bitch!","commenter_a":"Can she blow herself up again, with all her brethren with her?","post_message":"Hmmm, is she making the (Eiffel tower) peace sign? Islam is peace, brother. The good news is -- she's dead. The bad news is Obama wants to bring these 'widows' and 'children' like the refugee Boston bombers to our shores. This savage tried to lure police within detonation range by crying \"help me, help me\" before blowing herself up."},{"comment_id":"10155201801124170","commenter_b":"And the are letting this teach our children!!!!!!!!!!!!!!!","commenter_a":"I was talking with someone who told me they way he sees what's happening is most of these rioters are youths and college students that aren't even from HERE!!!Don't care about America, don't even know about America our home sweet home. So they need to STFU.","post_message":"Public education at its finest."},{"comment_id":"964259683612268","commenter_b":"get them the hell out of our usa we dont want them here,take that scumbag obama with you.","commenter_a":"Probably headed to the Democrat Registration Office.","post_message":"Oy vey."},{"comment_id":"1155951624441179","commenter_b":"\"Security concerns\"... Right. It was probably because smiling is illegal.","commenter_a":"Real reason: Mewtwo is in Tehran 😂","post_message":"Iran isn't going to catch them all."},{"comment_id":"10153254451090671","commenter_b":"and that's why you women are pathetic ladies should not twist my words around","commenter_a":"most women are less productive as far as in the construction field is concerned but in the construction field I think they are paid the same I don't like working with women every time I do I have to work harder just to keep the same production schedule going","post_message":"Under the new law, an employer must show the “differences in wages are due to factors other than gender, that the factor is job related and reasonable and that these factors, rather than discrimination, account for the difference in pay.”"},{"comment_id":"10154493614517235","commenter_b":"How about just sending all of the whites back to their mother countries and leave the Americas to the Natives!","commenter_a":"I've always believed conservatives would destroy this country and it would appear they are well on their way to doing it - maybe we should boot the old confederacy out and let them make it on their own - if Mexico wants texas back, if france wants louisiana, spain wants florida or great britain wants the southern colonies, hey guys don't call us yankees - you got what you wanted LOL","post_message":"BUSTED."},{"comment_id":"10152655147557267","commenter_b":"Plain english","commenter_a":"No bill should be over ten pages long, nothing else added and in plain English a fifth grader could read","post_message":"I voted ‘no’ on final passage of H.R. 240, the Department of Homeland Security Appropriations Act of 2015, which was ultimately stripped of provisions to stop the President’s executive action on immigration. Read my full statement here: @webpagelink #idpol"}]
