[{"comment_id":"852688794861003","commenter_b":"Biggest POS IN AMERICA TODAY, then KILLARY","commenter_a":"Yes","post_message":"President Obama continues to top lists of most admired people in the world. Do you admire him?"},{"comment_id":"10153785801499087","commenter_b":"U also allow rapist into the country everytime people born.","commenter_a":"Trump wants to protect Americans. Hillary wants to allow in illegals, including rapists, in exchange for votes. Who's the monster again?","post_message":"\"We are hearing some divisive and dangerous rhetoric in this election. We have a candidate who wants to tear families apart and forcibly deport 11 million undocumented immigrants, who calls Mexicans rapists, who talks about banning Muslims from entering the country,\" Hillary Clinton said in a new video."},{"comment_id":"1082496428446957","commenter_b":"Taxpayers fund churches!! Churches don't pay taxes! Planned Parenthood is doing a service that they are legally allowed to preform because there are women choosing to have those services done. Christians have no right do insist this be stopped just because of their religious beliefs. I'm sick of Christianity being all high and mighty thinking that it is the end all be all of decision making for everyone else on the planet. Not everyone is a Christian and not everyone must be. Defund your churches!! Make the churches pay taxes!! Every time a Christian stops an abortion make a Christian take in an illegal alien and put him/her through school/college!! Stop hiding behind your bible and pretending to actually care about the embryos because we all know when you're not cursing abortion your wishing gays would go away and praying extra hard that your children won't turn out to be ...","commenter_a":"You know what's really ironic? Your religious organization doesn't pay taxes yet you're complaining about the money spent on abortions. Another thing is that you want to stop abortions but there's starving children right there in your neighborhood and your church and its congregation all have food on their tables, cars, cell phones etc. Then, you even complain about paying for birth control because it goes against your religious beliefs but then you expect non Christian tax payers to pay for your churches. In addition, you believe that your Christianity should trump my rights as a woman and you should decide what I should do with my body because of what your bible says. Well, I'm telling you NO!! Abortion is legal and its going to stay that way because of people like you. Women like me will always be here to stand up for our rights not only just ...","post_message":"Planned Parenthood has made a business out of destroying that which God has created. The one-sided relationship between it's ever-growing bank account and American taxpayers must be severed. That is why I introduced the \"Defund Planned Parenthood Act of 2015.\"   #ProLife #DefundPP"},{"comment_id":"10153860204493598","commenter_b":"She probably has no problem selling those little body parts.I wonder how those people will answer God when they stand before Him!","commenter_a":"More like satan","post_message":"Wendy Davis is Dedicated to Promoting Abortions With God’s Help: “By God, We Get Back Up”"},{"comment_id":"1758550144422291","commenter_b":"73% approve and still got 4 more months. Dam fine job sir! Hillarys new add kids are watching is stupid thats all she has. Ok hillary kids are watching as you say who cares soldiers are dieing! What a piece of garbage she is time to take out the trash Trump we love you. Voters get out and vote Trump 2016","commenter_a":"Finally a strong leader to be. Mr Trump a country with no borders is not a country. Make America great again.","post_message":"I will not let this country down. I am grateful for everything I have ever been able to accomplish. I want to give back. I want to MAKE AMERICA SAFE & GREAT AGAIN!  -DJT"},{"comment_id":"10154205031258701","commenter_b":"You are clueless chickie....","commenter_a":"Seriously people, faulting the girl for not reporting! It's a small town good-old-boy system. You really think the police chief would arrest his good friend? They were probably laughing about it. Since she went public she is being harassed. Small town politics...","post_message":"A probable cause affidavit states he exposed himself to a female employee at Flowers 'N Fluff at least twice a week for at least two years."},{"comment_id":"10153389055716770","commenter_b":"Wow is she stupid or what. Racist pig.","commenter_a":"Sure we can play with a bad bad boy and you will get bad results","post_message":"A CNN guest argued that her ex-CIA panel-mate was unqualified to talk about ISIS because he's white."}]
