[{"comment_id":"10153279327706973","commenter_b":"Your saying this restaurant chain is hateful and kills animals when dozens of others do exactly the same thing? You do know that cows and fish are animals and killed in order to make the food you find at McDonald's, Burger King, Wendy's, Arby's, Subway, Taco Bell, Panda Express, Red Robin, Dennys, IHOP, etc. right?","commenter_a":"Don't do it! They're a little too conservative for our area. Do people really want to support a company that not-so-secretly opposes equal rights (not to mention the whole killing of animals thing...)? @webpagelink","post_message":"The fast-food chain is looking to to add one or two restaurants a year until there are 10 to 12 locations in the greater Portland area."},{"comment_id":"843772605660081","commenter_b":"We no longer have a president. I impeached him for tyranny & not protecting Americans & for not following our constitution. Since we have no leader, no harm fine, no foul. Hearing whst a great leader has to say like Mr N is hood hoe America","commenter_a":"Good he's not good enough to walk in Bibis shadow !","post_message":"Socialist Senator Bernie Sanders: \"The idea that the president wasn’t even consulted… that is wrong and not a good thing for our country.”"},{"comment_id":"10154830329021830","commenter_b":"wow what shit if a celb said something worth hearing then ok fine but most are just fucked up losers that cry for attention","commenter_a":"Anthony Turner","post_message":"Ashton Kutcher Helps Reiterate Why Tomi Lahren & Co Are Full Of Shit"},{"comment_id":"896147533775276","commenter_b":"We Americans are beat. Face it effort to assist citizens verses supposed immigrants (illegal) is futile. We are sold out! The few elite own the few corporations and all are subjects of the foreign owned NON \"federal\" reserve! GOVT benefits were advertised south of the border. The border is not secure. Enforcing US deportation laws are ordered on STANDING DOWN. An increasing invasion of illegal foreigners flock into our nation. So now, the govt is offering huge tax rebates to illegals never having paid taxes! I give up! America can never survive.","commenter_a":"NO I DO NOT AGREE!!!!!!!!!!!!!!!","post_message":"PETITION HERE: @webpagelink"},{"comment_id":"927501820717545","commenter_b":"Perfectly stated.","commenter_a":"Translation: \"I am begging all my supporters, that despite conning you into voting for me, you need to come to DC. I need a display of reverence and adoration. I will be mostly alone but I am terrific and I alone make a great show!... Oh, come as you are... preferably in white sheets.\".","post_message":"Twitter reply of the year goes to Tony!  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154048575244456","commenter_b":"Joke","commenter_a":"Prayers for Gunn's mom and prayers for Officer Smith. I pray that the whole truth be revealed and this young man will be safe.","post_message":"\"MPD supports their men and women in blue. #it'sok2hitthelikebutton,\" the post on a MPD Facebook page stated.  Here's what we learned today:"},{"comment_id":"943876645729114","commenter_b":"Put her as a no fly list and jail","commenter_a":"🖕🏿","post_message":"When this Black Lives Matter entitled brat threw a fit on an American Airlines flight after not getting her way she started up the accusations of racism immediately.   'LIKE' if you think this race-baiting BLM supporter got what she deserved."}]
