[{"comment_id":"1311513512199990","commenter_b":"So Slick Willies wife is the answer, LOL","commenter_a":"Trump is a symptom. He makes it easy for people to place the blame on him because, let's face it, he thinks he's smarter than he's capable of being. But, the vitriol and hate that is so easy to see NOW has always been there, simmering. Trump is a boil, a symptom of an untreated infection. People need to take a good look at themselves, their friends, their families, and their neighbors if they really want to understand the \"virus\" and the \"unreason\". It isn't as distant as Donald Trump.","post_message":"American history is littered with \"narcissistic demagogues who lie and distort in pursuit of power and self-promotion. Bullies all, swaggering across the landscape with fistfuls of false promises, smears, innuendo and hatred for others, spite and spittle for anyone of a different race, faith, gender or nationality.\" -- Bill Moyers and Michael Winship."},{"comment_id":"10153527137233717","commenter_b":"Hell no! The real woman for the job is Hillary! #Hillary2016","commenter_a":"Please support Carly Fiorina tomorrow! Non establishment, proven leadership. Fight against the machine with a level headed conservative. Please support Carly! She needs your help to place in the top 4!","post_message":"Donald J. Trump is holding a rally at the Verizon Wireless Arena in Manchester. Watch live: @webpagelink"},{"comment_id":"10153148221999087","commenter_b":"Close the Border why are they allowed to get all this free stuff, when we have people in this country who need help??","commenter_a":"get it back TRUMP!!","post_message":"\"People are walking across the border right now, right in front of these great people we have,” Donald J. Trump said. “We have wonderful Border Patrol people. They can do their job, but they’re not allowed to do the job.”"},{"comment_id":"438540092994538","commenter_b":"Ron i understand....however Im still not tryin to make excuses but im a single homeowner with a mortgage that works full time and has the same bills as everyone else. I wanted it bad enough and i found a way to do it. If anyone wants it bad enough then they will find a way to sacrifice for the time being. Only reason i origanally commented on this post is because i am proof that a lil sacrifice and hard work pays off. I gave up alot for the year i went to school. Most people will just \"omg i cant give all that up, eh ill just work at a crap job and complain and expect to get things handed to me.\" What bothers me is the sarchasm and name calling ive gotten here from some people haha. Ur the ones that want things handed to you probably!! Stop ...","commenter_a":"Or?? How bout it means get off ur butt and try to better yourself....","post_message":"Let's aim for a living wage."},{"comment_id":"843350562368952","commenter_b":"With the UK refusing to stop child molesting rings, why is it surprising that thier corruption extends to the zoo.","commenter_a":"Not a fan of any of the stories that start...\" You won't believe what happened after this....\" It's The Star magazine hook line and sinker. It's like the Kardashians are the publishers.","post_message":"\"Zoo of Horrors\""},{"comment_id":"10154516833146162","commenter_b":"Ain't no 6ft sumn woman hanging their self in no jail cell miss me with that","commenter_a":"Wow, this tells everyone....NOTHING! I would like to hear... Exactly how Sandra Bland died. Period!!!!!!!","post_message":"An ex-guard admits to falsifying Sandra Bland's jail log... @webpagelink"},{"comment_id":"10153141821778352","commenter_b":"Fuck that!!! I will be in no way shape or form involved in any queer shit in my household!!!! Point blank period NO SON OF MINE WILL EVER BE A GIRL!!!","commenter_a":"I could never accept my son being A Gay!!!!! Hell naw I'm not raising no queer in my household !!! Goodbye go live ya life but not in my fuckin house!","post_message":"'We don't support that': Christian parents who were blamed in their transgender daughter's suicide note REFUSE to accept her female identity after she walked in front of truck, but insist they loved 'him'"}]
