[{"comment_id":"10153075277316770","commenter_b":"This hag is despicable,","commenter_a":"anything that comes out of this woman's mouth is bullshit just saying","post_message":"Debbie Wasserman Schultz says Republicans \"alienate women, alienate the LGBT community... [and talk] about it at their debates. Kicking immigrants out of this country, talking about taking away healthcare from Americans, talking about which candidate is worse for women and take their healthcare away, deny their rights, oppose equal pay for equal work.\""},{"comment_id":"706537696174664","commenter_b":"White trash! Take a bath!","commenter_a":"Omg. Thought we only had one clown in the white house then she showed up. Glad its only for a few days left thank god","post_message":"Happy 53rd birthday to First Lady Michelle Obama! Join us in wishing her well!"},{"comment_id":"1747479275473588","commenter_b":"Fawwwwwk no cuz that proves a bih can't cook fr😩😩😂😂😂","commenter_a":"@username some shit you'd do😂😂😂","post_message":""},{"comment_id":"10153234607601491","commenter_b":"Imagine... First lady of America has a sex video. No please!!! Cant call kim a lady!","commenter_a":"Lol","post_message":"Kanye and Kim Kardashian West are looking forward to redecorating the White House."},{"comment_id":"1436165433143173","commenter_b":"We non-native people are all illegal immigrants. Nobody gave us permission to live here.","commenter_a":"Somebody needs to read History books this country was owned by Native American Indians (@username) we all are immigrants in this country","post_message":"This mother speaks for the millions of people who live in fear of Trump's deportation squads."},{"comment_id":"1059208864172624","commenter_b":"Sounds just like a female lol","commenter_a":"Obviously. Ignorance is bliss? But when will they see who he really is. A narcissistic sociopath. Will to nuke anyone who hurt his little feelings","post_message":"\"People who support Donald J. Trump are people who should be respected for how they feel, but I worry that they don't understand that they're being scammed. And that they're being scammed by someone who's really good at it.\"  - Mika Brzezinski, co-host of Morning Joe"},{"comment_id":"10155940183045354","commenter_b":"Does she have an extra kidney. You really only need one. Never mind it comes from her scummy body. Monster","commenter_a":"You go Hollywood stars. I wouldn't put anything past you stupid people. If you agree to selling aborted baby parts, I can only imagine how many times you all have done it. It is no wonder I can't stand almost all Hollywood stars.","post_message":"Check out the Instagram video Scar Jo appeared in for Planned Parenthood"}]
