[{"comment_id":"1901824630047376","commenter_b":"Meant to be","commenter_a":"Catherine her name... :)","post_message":"She’s a Republican college student and she’s proof that marching is about more than politics. #WomensMarch"},{"comment_id":"1117162291652524","commenter_b":"Get over it she is covered in the right places and so what if she wasn't. Are you ashamed of your body so let's slam others?","commenter_a":"She is such a skank!!","post_message":"WOAH!"},{"comment_id":"417366948387900","commenter_b":"Hey rhino you want amnesty, and the DOJ candidate Obama and Holder want , your one of five republicans and who would negotiate with a terrorist country ? In sorry you won the election here in SC , your a R HINO ,","commenter_a":"Good point ...........we should be negotiating with Iran!","post_message":"Lindsey Graham has some harsh words for Rand Paul."},{"comment_id":"10153898357108984","commenter_b":"'@username - there is a huge difference between then and now regarding 'camps' and rounding up people; if the refugees were peaceful, they have proven otherwise, but if they were- they would not be in 'camps'- we didn't round up the illegals and place them in camps- the only reason they would be in camps now: time to be thoroughly vetted before allowing them among the citizens in America. Reasonable- yes.","commenter_a":"It seems as though the Founding Fathers knew something like this could happen, and in the Constitution under the 9th, and 10th Amendments gave each State the right to Sovereignty. State's that 'believe' in the Constitution should be able to break away from those that want excessive government control, and socialism! the de-centralization of power is essential to the preservation of 'Freedom', Washington has no more right to control us than London does. There is a reason we are defined as 'States', and not Provinces. we are sovereign state with our own constitutions. Our union was formed as an agreement between the States. Texas itself made it part of the agreement to join the union that they could leave at anytime. America was founded as a Confederation. Abraham Lincoln destroyed our states rights. I can assure you that Washington will not hold us together by force should we choose to ...","post_message":"One state is taking the refugee crisis seriously, and they're now making a huge move to send in the National Guard.  Obama may be able to bully other states, but this one's not having any of it.  Time for the rest of the states to follow their lead!"},{"comment_id":"10153252381712016","commenter_b":"Don't speak for young women. You aren't one.","commenter_a":"Young women see through Hillary..she put up with a cheat for a husband as a ticket to the WH...thats not what young women want for a future...its from the 50s...she lied to protect him through numerous scandals and no longer does it convincingly...she mumbles stock phrases about equality with no real commitment to anyone but her ambition!","post_message":"'Through a record-breaking voter turnout, we won because we harnessed the energy and the excitement that the Democratic Party will need to succeed in November.' --Bernie Sanders"},{"comment_id":"1633936340229657","commenter_b":"TWISTY IS REAL","commenter_a":"'@username well this sounds like fun","post_message":"Residents in this neighborhood are saying creepy clowns are trying to lure children into the woods.  #MicBrights"},{"comment_id":"1781276175448687","commenter_b":"And she wants to spend her last dying days being president? Really? Think please!!","commenter_a":"Make it sound as bad as you can, @username, you always do.","post_message":"JUST IN: Hillary Clinton was diagnosed with pneumonia on Friday, her doctor says. The doctor revealed the condition hours after Clinton stumbled while leaving a 9/11 event. @webpagelink"}]
