[{"comment_id":"10155604314476509","commenter_b":"I love it. Obama Obama Obama. Biden Biden Biden best Pres and Vice President ever","commenter_a":"At this point what difference does it make","post_message":"Biden: I'm not giving them the wifi password  Obama: Joe..."},{"comment_id":"10152904940001636","commenter_b":"Death penalty. Make em think twice. We need to set an example out of these murderers.","commenter_a":"Charge the worthless parents. What was he doing alone in a public park with a pellet gun like that and no orange tip and a pistol none the less. Horrible parents","post_message":"A judge found probable cause for multiple charges against the officers involved in the killing of 12-year-old Tamir Rice."},{"comment_id":"504677803025508","commenter_b":"Can't stand Mcain","commenter_a":"John Mccain almost crying because he's losing his beloved mercenaries under Russian airstrikes - @webpagelink","post_message":"What is really going on?"},{"comment_id":"10154672765359760","commenter_b":"Why? Ugly horse face bitch!","commenter_a":"Hell No! She didn't belong there in the first place. Garbage.","post_message":"Michelle Obama was loved by millions of people around the world as First Lady. Do you miss seeing her in the White House?"},{"comment_id":"10152861396861051","commenter_b":"Shut up","commenter_a":"Sick. Stay with your own race.","post_message":"A police officer came in, handcuffed this teen and dragged him out of school. When they got outside, the teen realized what was happening."},{"comment_id":"988494927933952","commenter_b":"SEND THE MUTHA-FUKA BACK TO SYRIA WITH ALL OF HIS WIVES AND A FEW WELFARE WOMEN AND THEIR CHILDREN.","commenter_a":"Hell no tell him to get a job","post_message":"How do you say, 'Kiss my ass' in Farsi? Check this crap out. @webpagelink"},{"comment_id":"10154614899766729","commenter_b":"The woman is already bought and paid for, she is an insult to any decent woman!","commenter_a":"Bitch please!!!!!!!","post_message":"Where is the mainstream media on this? Complete silence..."}]
