[{"comment_id":"10152601048042061","commenter_b":"till she open`s her stupid mouth.......again !!!!","commenter_a":"I love this photo. Most models would be posing and trying to be the focal point. I just adore the fact that stunningly gorgeous Giselle has her hat pulled down and is pointing at Tom, and not stealing a bit of his thunder. What a great couple they make!","post_message":"Coming in at number 3 in the  News midday buzz  see how Gisele Bundchen and Tom Brady and their kids celebrated the Patriots AFC Championship win: @webpagelink"},{"comment_id":"1562278293792195","commenter_b":"Hillary for PRISON !!!","commenter_a":"Deplorable in fl","post_message":"Join Chris Jansing at the polls from the key battleground state of Ohio Live! Full coverage all day: @webpagelink"},{"comment_id":"10153362031969087","commenter_b":"BAN ISLAM! BAN MUSLIMS! CLOSE THE MOSQUES NOW!!!","commenter_a":"I see we owe the NRA and Republican a big thank you for allowing another mass shooting DROP DEAD YOU MOTHER FUCKERS","post_message":"'Upwards of 14' people are dead and 'upwards of 14' people are injured after 'up to three people' opened fire at a holiday party inside the Inland Regional Center building in #SanBernardino, California. WATCH LIVE:"},{"comment_id":"1151519384914815","commenter_b":"Bol bitch deserved it","commenter_a":"Mykel Connors","post_message":"Chick knocks out an old lady on a bus!  #WSHH"},{"comment_id":"10158310227560389","commenter_b":"I think they are GRRRRRRRREAT!!!!! For the first time in my adult life, in a long, long time, I feel very proud to be an American!!! President Trump has done more in his first few days, than Obama did in 8 years!!!! Thank God we are rid of Obama and his family!!!","commenter_a":"He is doing great as we expected doing what he said he would do !!","post_message":"Question of the Day: What do you think of the moves President Donald J. Trump has made so far?"},{"comment_id":"1159718984066336","commenter_b":"Hang that ugly devil.","commenter_a":"go figure","post_message":"Disgusting."},{"comment_id":"10153064039634411","commenter_b":"Apart from the many proven lies? He was a cold blooded killer, how's that heroic?","commenter_a":"That bit about Jewish controlled media ... Whoa! How repetitive. And untrue. A sniper's job is to reduce the length of war by taking out one person at a time who appears to be aiding the killing of Americans. Thus Not mowing down a big group, thus not continuing backlash. Yes, he died young, at age 38. The movie is portraying the truth.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
