[{"comment_id":"10153270179214087","commenter_b":"Wrong @username, when people come across any countries borders without proper papers in hand they are criminals hence they commit a crime. Trump is correct illegal immigration is the most pressing problem for this country of whi h it is not in the least ludicrous. If you are much wanting illegals here then why don't all you democrats join together, invite them to live with you and pay their way instead of demanding we tax payers pay for all the freebies they get, not to mention all those ancor babies that we have to pay for to be born then pay for them and all the freebies they will be getting for the rest of their live.","commenter_a":"real change like we have never seen before. Go Trump!","post_message":"When immigration activists began heckling Donald J. Trump for his remarks on illegal immigration at a rally Wednesday night, his supporters came to his defense."},{"comment_id":"10153884149866130","commenter_b":"Its a joke you stupid bitches. Get over yaselfs.","commenter_a":"Ummm, kinda defeats the purpose of going out to the bar to get drunk if the bar is going to try and deter me from drinking. Wtf. Thats like my weed dealer explaining the importance of not smoking so I dont get cancer, smh. Dumb. Lol.","post_message":"One bar is getting patrons to think twice about drunk-driving by setting up a live-stream with a convicted felon."},{"comment_id":"10152991332957377","commenter_b":"He is a lot weaker. Building a WAll is a lot cheaper then paying for all the illegals and their so called benefits!","commenter_a":"jeb cant carry his own state.","post_message":"Jeb Bush fights back..."},{"comment_id":"10153337404314454","commenter_b":"Just be thankful that our atmosphere isn't filled with Volcanic ash from a bunch of volcanoes erupting.... We could go into a hundred year mini Ice Age.","commenter_a":"The earth will one day shake humans off like fleas off a dog. But how sad we couldn't have done better.","post_message":"Using data collected by NASA satellites, researchers have found that more than 1/3 of the world's largest aquifers are drying up faster than they being replenished."},{"comment_id":"1180471822029044","commenter_b":"Because she was high as a kite!","commenter_a":"WDF is this?","post_message":"Now this is funny."},{"comment_id":"10154144312645861","commenter_b":"I'm sure they don't assume Christians drink wine and eat tiny pieces of bread for attention, nor insult their robes or any other attire calling it dress up. OR stand up and interrupt their prayers/services when they disagree with it! Freedom of religion, and simple respect...ever heard of it? I hope you don't expect anyone to respect your religion!","commenter_a":"He wanted attention, he wanted to upset people. Someone should tell him his dress is too big for him/her....but not to worry Halloween will be here soon enough, and he can go get a new costume to play dress up in.","post_message":"\"I saw community of people come together and take a stand for what was right.\""},{"comment_id":"10153910838991336","commenter_b":"And slap her face!","commenter_a":"Bless her heart...","post_message":"Carly Fiorina says tech companies need to be asked “to bring the best and brightest, the most recent technology to the table.” #GOPDebate"}]
