[{"comment_id":"10153182888819060","commenter_b":"Run, Kamala, run!","commenter_a":"@username - her Agenda is TO REPRESENT US, CALIFORNIA, in Washington, D.C., UNlike the Republicans who spout \"The American People Want\" yet they ( GOP ) go for what the 1%ers want.","post_message":"“An entire generation of Democrats, who have been waiting for this moment for years, took one look at Kamala Harris, and quickly backed off.” For the first time since 1992, California has an open Senate seat and only a Democrat can win. That should have been the cue for an almighty dust-up. Yet, one by one, a billionaire environmentalist, a former mayor of Los Angeles, and the lieutenant-governor, have all stepped aside so there is only one serious candidate. Are they scared? Yes. And they have every reason to be: Ms Harris is an intimidating opponent. The daughter of an Indian cancer researcher and a Jamaican economics professor, she is the first woman, first African-American and first Asian attorney-general of California @webpagelink"},{"comment_id":"1089590774419709","commenter_b":"The most stupid people in America are and has been those always vote against their own economical interests. While the Democrat Party still was the people's party, all the aforementioned idiots were working class Republicans, but not anymore. Now the most disgusting idiots are Democrats whom supporting Queen of Monsanto, Hillary Clinton.","commenter_a":"Vote for the ONLY Candidate who stands up against Monsanto! Bernie Sanders!","post_message":"“If Monsanto gets its way, the American people will pay a high price for corporate greed and political corruption.”"},{"comment_id":"1037567749698799","commenter_b":"Facebook is trying to silence him tonite","commenter_a":"Completely cut off","post_message":"Watch Live: Donald J. Trump holds a rally in Sterling Heights, Michigan."},{"comment_id":"1231022086976838","commenter_b":"Look at the size of that wood. Those are strong birds. Yet so very gentle with their chick.","commenter_a":"Menifee California","post_message":"BREAKFAST TIME! Looks like Momma Eagle is feeding her new hatchling. More info: @webpagelink Where are you watching from this morning?"},{"comment_id":"10154465918697235","commenter_b":"She might have been taken off because she is a hateful bitch. I cannot imagine someone would want to have sex with her.","commenter_a":"He should have taken you off the air YEARS AGO, Andrea Tantaros for being a LIAR and ILL-INFORMED. Good Luck with your impending lawsuit. Hope to never see you on the air ever again.","post_message":"WHOA"},{"comment_id":"10153579944776438","commenter_b":"If he hates it that much, he can step down and we can keep his paycheck.","commenter_a":"lol @ headline","post_message":"\"He hates it.\""},{"comment_id":"10153731050907464","commenter_b":"@username THEY'RE A LOT OF SICK TEABILLIES!!","commenter_a":"You referred to the Colorado Springs shooter who killed 3 people as a \"transgendered leftist activist\". Since when does a \"leftist\" spread anti-Obama propaganda and refer to fetal tissue as \"baby body parts\" as you and your ilk do? You are a disgrace for spreading even MORE rhetoric and you are unfit to be president.","post_message":"An impression from my favorite movie? As you wish..."}]
