[{"comment_id":"10158320001025294","commenter_b":"I agree!! If your DNA IS ON THE VICTIM..SPEEDY DEATH!!","commenter_a":"I beleive in crimes like this. Should be Swift justice if you're found guilty nothing less then the death penalty and in a short period of time 3 days fir greiveing for convicts family and then serve sentence out!","post_message":"The suspect is a registered sex offender. \"Our investigators didn’t stop. The culmination of their efforts is the arrest of a person who we need to make sure never touches our streets again,\" said Cleveland's police chief as he announced an arrest in the case."},{"comment_id":"625393104287939","commenter_b":"She is NOT too smart!!!!","commenter_a":"Enemy of the Republic right there people.","post_message":"Pentagon Officials Furious After Clinton Announces US Response Time for Nuclear Launch During Debate @webpagelink"},{"comment_id":"666105456853575","commenter_b":"This wench should go back to hell .... <3","commenter_a":"She sounds poorly educated. Does she know what a bigot Sharia Law is on women and gays??","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"1362948977061222","commenter_b":"@username oh look a grammar nazi, good burn lol","commenter_a":"First of all I know what it's like to work in a shop with just men. Men talk locker room talk. What you do think woman talk the same way! Shut the F up! It works both ways! Until you know what it's like to work in an all male job you can shut up!","post_message":"This rape survivor just took a powerful stand against Jeff Sessions."},{"comment_id":"1187051574713979","commenter_b":"She don't care why try and make her lower her standards. Melania is a very classy lady and you want her to lower herself and dress down.","commenter_a":"I'm sure she can find another dresser! No big deal!","post_message":"Michelle Obama's favorite designer, a woman who dressed the First Lady for 8 years in a row, just refused to dress Melania Trump. The reason? She isn't tolerant of her despite asking everyone else to be tolerant of her. The self-professed liberal meant to snub the new First Lady -- but she never saw this coming."},{"comment_id":"10154091486669445","commenter_b":"As is history. It is the dark side of humankind.","commenter_a":"We're all in, but especially Europe, for a very tough long haul. When you have people hating as a lot of terrorists do, willing to give up their lives, there's practically no way to stop them. And Europe is full of them","post_message":"The Eiffel tower is lit up in the colors of Belgian national flag after #Brussels terror attacks @webpagelink"},{"comment_id":"10153522112557690","commenter_b":"Amen","commenter_a":"Rest well kiddo !!! Hope your fam find some comfort in the lord !!!! From him we came and to him we shall return!!!","post_message":"Police say a Denton teenager died after being struck by an SUV while trying to cross the street. @webpagelink"}]
