[{"comment_id":"10154574159493445","commenter_b":"The only wall is much needed to keep illegals out that are a drain on society. Mexico doesn't want them back and they send millions if not billions to pump up Mexico's economy and drain our economy. Many of these immigrants are from further south than Mexico. Mexico wants to keep them out of their country as well that's why they put a large wall on their southern border. Why are they allowed to do that yet we are not??? I've had several friends killed my illegals because they can't drive. I also have a very good friend that can't walk, can hardly talk and will never work again all because a car load of illegals didn't know what double yellow lines on the highway stood for. They passed around car load of illegals at the top of the hill and hit him head on at 60 mph. 3 of ...","commenter_a":"Texas.","post_message":"Creative smugglers will always come up with ways to get drugs over the border - and many doubt the effectiveness of a wall to curb the flow."},{"comment_id":"1522859634396359","commenter_b":"\"Liberalism is a mental disorder\"...Dr Michael Savage. That woman is not fit to be that precious little boy's mother!","commenter_a":"I cannot watch this. This monster (mother) is horrible and I cannot imagine how frightened this little child was. She deserved to be punished.","post_message":"Imagine how the media would have been all over this story if the mother had been a Trump supporter furious at his defeat. And this story still hasn't made out of Houston. It's still just a local story."},{"comment_id":"10157043455730206","commenter_b":"May God keep you stronger, Celine","commenter_a":"So sorry for your loss!","post_message":"Celine's brother Daniel had been battling cancer of the the throat, tongue and brain."},{"comment_id":"578481392330649","commenter_b":"THEY LOOK SO FOOL OF IT.....SSSSSSSSSSSSSSSSSSS","commenter_a":"Pot, meet Kettle...","post_message":"“One of the greatest frauds in modern electoral history is Donald J. Trump pretending to be an outsider.\" Tonight on “Hannity,” Ted Cruz said that Trump is part of the establishment because he funded liberal Democrats for years."},{"comment_id":"1263312547023087","commenter_b":"James Walters watch it","commenter_a":"I feel deceived. I thought he was going to explain the theory briefly with the popcorn.","post_message":"It's the 100th anniversary of Einstein's theory of relativity this year. Here's an explanation so good, it won $400,000"},{"comment_id":"1243497535729399","commenter_b":"Who is this angry old lady?","commenter_a":"500,000 Women march on Washington to protest Trump becoming 45th President march today for the moral core of this nation, against which our new president is waging a war, actress America Ferrera told the Washington crowd. ..... for the moral core of this nation - most curious statement ! Both Presidents Jack Kennedy and Bill Clinton were known womanizers - both had long history of doing so Kennedy had his lovers escorted into the White House late at night while Clinton had a young woman intern give him oral sex right in the Oval office ONLY difference was that Kennedy and Clinton were Democrats while Trump is a Republican At the core of the protest is that Trump won the 2016 election in KEY states and the Democrats could not get their vote out in the KEY states Moore, Garry R - Solutions Inc","post_message":"\"Well, good did not win this election. But good will win in the end,\" Madonna delivered a fiery R-rated, anti-Donald J. Trump speech during the #WomensMarch @webpagelink"},{"comment_id":"962171047226860","commenter_b":"She's a loser. She should stay with a loser.","commenter_a":"Well it's about time! Now she and Hillary can be together.","post_message":"Breaking: Huma Abedin announces she's separating from Anthony Weiner one day after husband's new sexts emerge."}]
