[{"comment_id":"891235850923043","commenter_b":"She is such a disgusting, hateful, ugly hag!","commenter_a":"Democrats are ALREADY on record favoring abortion AFTER birth.","post_message":"Unreal.  So the Supreme Court's imposed policy of abortion-on-demand for the full nine months of pregnancy isn't enough for Hillary?   Enough is enough.  Sign the petition to defend unborn babies from radicals like Hillary! Click here! @webpagelink"},{"comment_id":"1140950715967044","commenter_b":"Lying two faced cutthroat hag.","commenter_a":"If mouth is open lies are being told.","post_message":"BOOM! Coal Miner Calls Out Hillary to Her FACE! Watch her try to 'umm umm babble babble' a way out of it VIDEO  The entitled hag gets slapped with karma! WATCH!"},{"comment_id":"10153815392947293","commenter_b":"She have bipolar disorder.","commenter_a":"Please be kind when commenting. Even if you don't like her, she is a real human being, who has had significant struggles with mental illness. She has family and friends who are worried and scared.","post_message":"Sinead O'Connor has been found."},{"comment_id":"10155686821610354","commenter_b":"Please were in Big Trouble if the ASSHOLE gets in. It's bad enough the ASS already in office is dismantling our Country little by little she'll just finish it off. Her and her asshole of a husband.","commenter_a":"She could have changed to state ID if she is no longer driving and that information should have come via letter","post_message":"Clinton said that she was fighting “for the grandmother who’s turned away from the polls because her driver’s license expired.”  If she didn't want it to expire, she could have driven once or twice since 1996..."},{"comment_id":"10153377527143984","commenter_b":"Are some people just figuring out she's a LIAR and always will be!","commenter_a":"People need to wake up & research the person they are going to vote for....She is hiding so many things....","post_message":"Supporters of Hillary Clinton are reconsidering their choice for president after learning some stunning facts.   Are you glad to see Clinton's hypocrisy exposed?"},{"comment_id":"1718806018406509","commenter_b":"Illegals!!! Bahaha","commenter_a":"Chicago doesn't want trump, we aren't gonna deal with his jokes","post_message":"Protests continue after Donald Trump's UIC rally is canceled for security concerns: @webpagelink"},{"comment_id":"10154568274058690","commenter_b":"'@username lay off the meth girl","commenter_a":"If this story was other way around everyone would have called him a terrorist and the 2 billion muslims had to apologise for his actions.","post_message":"Arab communities in the United States are in shock after a Lebanese-American man was shot and killed by a neighbour that had allegedly used violence and racial slurs against the family for years."}]
