[{"comment_id":"10152949520761519","commenter_b":"FWIW: Jesse, I love your points of view. Over the years your passion and knowledge have helped me evolve my own perspectives on politics and the news. However, I respectfully disagree with your use of pejorative terms to describe women in this fashion. I think it is as much demeaning to you, and women at large, as it is to the targets of your invective. I respect your assertion of your right to use these terms, and you have articulated to me in the past why you choose to use them. I respectfully disagree with it.","commenter_a":"Those Fox News bitches really whore it up with the make up, don't they?","post_message":"'You can’t separate fiscal issues from social issues...'"},{"comment_id":"10154266348729203","commenter_b":"Go on sis!","commenter_a":"It seems that people are pushing their agenda however way they can... Big changes are coming soon... @webpagelink","post_message":"'Captain America: Civil War' screenwriters on the importance of Cap in light of Trump: 'It important to have someone remind people that that is not what this country is about, and you being kind of an ugly fool, and reductive.'"},{"comment_id":"599148503619234","commenter_b":"Yeah bitches","commenter_a":"We all know who... @username Daniel Hughes @username","post_message":"This is so accurate  #WSHH"},{"comment_id":"10154062439342541","commenter_b":"Too much fat around the waist can't grab that skank","commenter_a":"Big deal. There's a position waiting for her in the White House after January, 2017. She seems to have the required credentials/ideology that would qualify her for employment under that administration.","post_message":"The non-profit director who called First Lady Michelle Obama an 'ape in heels' has been fired for good."},{"comment_id":"10153121276986051","commenter_b":"Tie her tubes. Now. Horrible mother.","commenter_a":"She is a great reason for forced sterilization","post_message":"This mom decided to let her 14-year-old have an alcohol-fueled, destructive party that lasted 3 days. You can probably guess what her neighborhood looks like now."},{"comment_id":"1762539284023573","commenter_b":"Adrian Chapman, Anyone that thinks trump is a racist has their head up their ass. Do you even know what the definition of racism is? Illegal immigrants are not a race. Stopping the flow of terrorism from Muslim dominate countries is a precaution to stop terrorism. Not all Muslims are terrorist but terrorist come from Muslim nations. Common sense not racism.","commenter_a":"How many TRUMP SUPPORTERS do you see on national news blocking highways, trying to stop other candidate's supporters legal right to rally.","post_message":"15-year-old groped and pepper sprayed at Trump rally"},{"comment_id":"1728684567380415","commenter_b":"#NotMeUs hillary just want your vote so she can work hard for the rich people!","commenter_a":"Please exit out of video , share the post by clicking SHARE button on bottom right. Come back and join us❤️","post_message":"Bernie Sanders rally in Pittsburgh: Part I"}]
