[{"comment_id":"10152955110391336","commenter_b":"What i do NOT understand is.....if kids get vaccinated....then why in the world are those parents concerned their kids will get the disease they've been vaccinated for??? Aren't the vaccines any good?? It's NOT the ppl who aren't vaccinating their children who are bringing disease to other in this country....it's the illegals who are flooding in here who are bringing this stuff with them!!! Blame the correct ppl if you're going to play the blame game....","commenter_a":"Well said Margaret","post_message":"A 3-year-old girl with leukemia was exposed to measles at an outpatient clinic in Arizona."},{"comment_id":"779579485508565","commenter_b":"Mia King you are just making things worse. People of all races kill period! I could waste my time looking for articles of blacks killing whites but I'm not trying to keep the racist shit going.","commenter_a":"The TRIBAL ATTACK is alive and well. Took seven (7) FUCKING NEGRAHS to beat up one (1) homeless white man. Put these porch monkies one-on-one and they run like the cowards they are.","post_message":"Dear liberals and the #BlackLivesMatter movement, police and white people are not the problem. This is the problem...Sickening."},{"comment_id":"457954454329149","commenter_b":"and an Ass!","commenter_a":"Bush family is Scum....I'm a Reagan Republican.","post_message":"President George W. Bush dances to music performed by a high school band in New Orleans for the anniversary of Hurricane Katrina. Looks like he still has a spring in his step!"},{"comment_id":"1707955089264613","commenter_b":"We have an American president now-thank god","commenter_a":"I wonder how quick INS would offer a job to an immigrant that came to this country LEGALLY? I'll be more than happy to deport the illegals.","post_message":"Entitled Immigrants Protesting Trump Are PISSED After They Just Got NASTY Surprise When They Showed Up To Work Today!"},{"comment_id":"10153601667565329","commenter_b":"Wtf buzzfeed? That chick with her fingers under her eyelids?!","commenter_a":"My leg spasms like that too. It's nasty!","post_message":"No. No you can not."},{"comment_id":"1086256118053035","commenter_b":"So we leave our selves defenseless so that some kid can study underwater fire fighting?","commenter_a":"Spending more money that we don't have, Thank You, so very much!","post_message":"The Perkins Loan Program can be a critical lifeline for many low-income students. I’ve joined 53 of my colleagues, including Senator Robert P. Casey, Jr., in calling for its reauthorization. Learn more below."},{"comment_id":"1013838895312830","commenter_b":"That's what girls get, cause they want to grow up fast n experience sex.... Don't blame the man... They r just man... Like a dog give him a bone n he would eat it no matter what...","commenter_a":"Sadly this happens a lot. My neighbors daughter was 14 with a 22 year old. Her parents knew. Let her go to the beach with him, let him stay the night ect.. then they broke up and he broke her heart. The parents put him jail. He now has to register as a sex offender for life. : (","post_message":"FUGITIVE WANTED: The Dickinson Police Department is looking for a 24-year-old man accused of sexually assaulting a 14-year-old. Authorities say they have been unable to locate Joshua Dwight Blair at his residence or last known place of employment. If you know any information about his whereabouts, you are asked to call police or Crime Stoppers. MORE ---> @webpagelink"}]
