[{"comment_id":"10153475546708734","commenter_b":"So why is she crying rape now? It's not going to get her out of the ticket, is it?","commenter_a":"Sorry but she is not a victim! And the so-called officer is a POS!","post_message":"The female victim initially agreed to engage in a sex act in exchange for money. Then during that encounter, Tucker allegedly pointed a gun at her and forced her to engage in another sex act against her will."},{"comment_id":"10153501091738690","commenter_b":"Afgan want peace but usa want target killing of muslims.","commenter_a":"Afghan was peaceful peoples. Bu when usa attack on afghan they become defender and now usa and others calling terrorist. Shame on you.","post_message":"At least 17 policemen have been killed in Afghanistan's Helmand province after 'hundreds of Taliban fighters' attacked the police compound, officials said. @webpagelink"},{"comment_id":"10153068305271051","commenter_b":"She is legal","commenter_a":"fire the cop,he must like young girls.","post_message":"This teen girl was with her friends when a police officer started hitting on her. She decided she wasn’t interested. Bad move."},{"comment_id":"10154273015234205","commenter_b":"'@username you are so right ! And I'm glad I'm not the only one seeing this woman's racist side. @username you aren't from here your European American ! This isn't your merica it belongs to all the people ! No matter what your ancestors were once undocumented immigrants so don't speak as if you are a true American because a true American would realize that America isn't just for legals. If so you should of been long ago with the Damn mayflower.","commenter_a":"On October 22, 2016 Trump said that we would pay for it and Mexico would reimburse us. Check your facts people. We will get reimbursed through tariffs on anything that has to do with Mexico. Brilliant!!! That's why we hired you president Trump.","post_message":"Will Congress pay for Trump's border wall?"},{"comment_id":"1382362188508980","commenter_b":"You ass dont belong on a road unless it has wheels on it who raised these nuts?","commenter_a":"Yes","post_message":"Liberal protesters are furious after a new bill introduced by a state lawmaker... here's why this could cause a lot more 'accidents' when these lefties block highways.  Do you support this bill?"},{"comment_id":"10154594617592235","commenter_b":"Forgot this","commenter_a":"Typical conservative lack of knowledge. And yes, libertarians are conservatives. They are republicans. Believe me, they are republicans. Believe me. Republicans. Libertarians are republicans. Republicans. (Doing my best Trump impersonation, repeating myself over and over again. Repeating myself. Over and over. Believe me. Over and over)","post_message":"What the hell?  They announced victims right from the start."},{"comment_id":"467273093466185","commenter_b":"Hello . It is ok to call this guy a f....t ?","commenter_a":"Haven't we learned that terrorist have the greatest amount of patients and will take years and alter thier lives how ever they need to to carry out a plan. Throwing us off course, that's part of thier plan. Taking our attention away, part of the plan.","post_message":"Orlando shooter who killed 49 people at the Pulse nightclub was himself a regular patron of gay clubs in Florida for years, classmates, friends and club employees say."}]
