[{"comment_id":"1133405013362371","commenter_b":"She looks that way from years of only having a tiny withered Cheeto to satisfy her","commenter_a":"Why does every picture of Melanie look constipated or disgusted. Her eyes are always squinted, and her lips are always tight. I mean it is not a happy look. This is not a rant because she is female, and it is not a comment on her worth or attractiveness. It is a comment on how people show expression in their face. She doesn't look happy at all.","post_message":"Could you imagine the right-wing reaction if the Obamas did this?"},{"comment_id":"10153637483924714","commenter_b":"White people rock!!!","commenter_a":"^^^when the police start killing your people and getting away with it then you tell how how to protest/feel #nojusticenopeace","post_message":"Philosopher and activist Dr. Cornel West was arrested during a demonstration outside the Saint Louis federal courthouse."},{"comment_id":"10153155555711051","commenter_b":"sick bitch!!!!!!!!!!!!!!!!!!! Nancy P","commenter_a":"Are these women brain dead ??? Do they think they won't get caught????","post_message":"A teacher was arrested after the authorities found out what she had been doing to a student. Now she wants her bond reduced. Initially the request was going to be rejected - then she presented her reason."},{"comment_id":"10154678643996729","commenter_b":"Screw that ignorant queer!","commenter_a":"It makes sense now why the Obama administration doesn't want us to have guns, he needs to sell them to people that hate us.","post_message":"This one hits close to home..."},{"comment_id":"10153897345459726","commenter_b":"As a man, whenever I hear Hilary's shrill angry voice my blood runs cold. Bernie should be more careful attacking Hilary, she'll wave her wand and turn him into a frog.","commenter_a":"Same old crap.!!!!!!!!!!!!!!!!","post_message":"WATCH: Clinton and Sanders called out for lies!"},{"comment_id":"1807825672796282","commenter_b":"If he gets in please let him build that wall to protect our Canadian women and girls from him and His followers.","commenter_a":"This is what I commented on his \"apology\": You literally said: you grab women by the p----. You kiss them and don't even wait. That sir is sexual assault. You should be apologizing for your behavior not your words. And what about the 13 year old who accused you of rape? Your own wife accused you of rape as well and you shut her up in your divorce settlement. You sir are a disgusting misogynist and will say what you need to to deflect the attention from your personal flaws. You are projecting onto Clinton what you've done yourself. And this isn't about Bill Clinton. This is about who should be the next president, you or Hillary. Your past behavior is proof that you don't care about the women of this country, and Hillary has shown she does. Additionally, President Obama yesterday just signed a bipartisan bill that passed the ...","post_message":"For hours on Friday night, the political world waited for the rarest of expressions from Donald J. Trump — a heartfelt apology. What viewers got was anything but."},{"comment_id":"1657660854509683","commenter_b":"His wife was from Saudi Arabia the home of Isis and bin ladan. She radicalized him! These people mindset are very scary","commenter_a":"Islamic terrorist scumbags.. His wife should never have been admitted into the USA. America has the dumbest immigration policy on earth. Thanks for the 1965 \"turn America into the world's dumping ground \" immigration act teddy Kennedy!! NOT","post_message":"The gunman who turned a holiday party into a mass murder scene with his wife had complained that his co-workers made fun of him."}]
