[{"comment_id":"996296000407740","commenter_b":"You are going to deal with it...as he repels the illegal invaders","commenter_a":"Trump does not get it wrong when it comes to policy","post_message":"\"Wait, wait, wait...\""},{"comment_id":"1678077472472997","commenter_b":"Fuck all Muslims and let them go to hell!!!!!","commenter_a":"So sad. It's bad enough that the boy lost his life, but for the Father of the murderer to defame his character is just too much.","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack  This is tragic. His died with honor, let's send our prayers for his family.  Can we get 100,000 'LIKES' for him and his family?"},{"comment_id":"1004207899725254","commenter_b":"Nasty woman","commenter_a":"Vote the issues!!! Main stream media has succeeded in blinding and brainwashing its people, spinning half truths and omitting important truths. You will NEVER GET REAL NEWS FROM MSM. Go to TRU NEWS, InfoWArs, and many other investigative journalists who are not afraid to tell the truth or worry about losing their jobs. If you are Gay, Why are you voting for Hillary when she wants to bring in thousands of refugees that believe all Gays should be executed? If you are Black, Why are you voting for Hillary when she admires Margaret Sanger and defends Planned Parenthood who want to abort as many black babies as possible? Exterminate the black race because they are like \"weeds\". (Margaret Sanger quote) Most of those clinics are in Black neighborhoods. If you are a Christian, Why are you voting for Hillary Clinton when she wrote her Senior thesis on Saul Alinsky who ...","post_message":"\"I'll do the very best I can if I am fortunate enough to win today,\" said Hillary Clinton after casting her vote today @webpagelink"},{"comment_id":"1076811719002844","commenter_b":"If this does not prove they are out to destroy America I do not know what will. they succeeded divding this country now they want to conquor it.","commenter_a":"Impeach all of them !","post_message":""},{"comment_id":"10154624272397042","commenter_b":"Yea she has no right to refuse medical attention she is a minor, she could be hurt and this could look bad on us, lets slam her into a wall and toss her around to make sure she goes.","commenter_a":"If I'm not mistaken, she doesn't have the right to refuse medical treatment because she's a minor right? Her parents have to make that decision as well as them signing a Miranda for cops to question her. I hope her family sues and the officers gets properly reprimanded","post_message":"Body-camera videos of police using pepper spray on a 15-year-old girl have caused widespread uproar."},{"comment_id":"10153908601902629","commenter_b":"Bye bye, bitch!","commenter_a":"Hope Cliven doesn't have any horse shit on those fancy kickers","post_message":"Cliven Bundy, the Nevada cattle rancher who birthed the Oregon militia movement in more ways than one, was arrested last night on felony conspiracy charges after he tried to join the standoff."},{"comment_id":"10150808006769999","commenter_b":"Minority women...","commenter_a":"i get the point about not many women in software engineering.. but, minorities? umm..just looking around my office floor right now, all i see are minorities (asians and south asians)","post_message":"Why do so few women and minorities work in software engineering? We’re discussing reasons for the gap and what can be done to improve it.  Join filmmaker Robin Hauser Reynolds, whose new documentary, “Code,” explores the issue; Nick Rockwell, CTO at The New York Times; Minerva Tantoco, CTO for New York City; Myrna Soto, Senior Vice President Global Chief Information Security Officer at Comcast; and Jazmine Hughes, Associate Editor at The New York Times. If you have questions, leave them in the comments.  For the second half of this live stream, click here: @webpagelink"}]
