[{"comment_id":"10155112285036729","commenter_b":"Just a clone of evil Hillary. Let her be gone and never seen of again!","commenter_a":"We can only hope. Oh, she may be protected as a Native American. Oh, that's right. She lied about that.","post_message":"Your feel-good story of the day, folks!"},{"comment_id":"10153270035730779","commenter_b":"Oh! And what about all those potential babies killed when wankers like you spill your seed onto barren ground?! #EverySpermIsSacred","commenter_a":"Forty million dead babies can't be wrong. An entire generatation of Americans has been murdered in the womb.","post_message":"Yes, Martin O'Malley, Bernie Sanders and Hillary Clinton are all pro-choice, but that isn't good enough. Simply promising to veto abortion restrictions passed by a Republican Congress isn't how we protect access to abortion, not when state legislatures are making it increasingly difficult for the most vulnerable women to get one. It's time debate moderators talked about it."},{"comment_id":"10153564922718984","commenter_b":"I think the Hispanic people think that the U.S. owes them everything. Being a hairdresser I did lots of H/cuts on men. They wanted every hair on their head to be Perfect. It really bothered me when so many men came in the salon just to wait until the H/C was finished. They would bring young girls with them, who could interpret the English language. It was so hard for the young girls to be put in the middle to speak for them & me. This should be a wake up call due to illegal immigrants.","commenter_a":"We all know this!!!","post_message":"This frustrated sheriff just sent a huge message to America that perfectly sums up Donald J. Trump ... his words are going viral and it's easy to see why. What do you think about what this sheriff just said about Trump?"},{"comment_id":"10153736495329753","commenter_b":"Yes","commenter_a":"Of course he's backing Killary. He's a libtard!","post_message":"Incarcerated hip-hop artist Bobby Shmurda has endorsed Hillary Clinton’s 2016 presidential bid. The 21-year-old leader of the Brooklyn-based GS9 crew is the latest in a string of high-profile hip-hop artists to back the Democratic front-runner, including Snoop Dogg, Pharell and Eminem. According to Shmurda, Clinton is the most suitable candidate to take over the Oval Office in November because of her “strong mind” and empathetic nature. “I’m going for Hillary, man,” he told Vibe. “I like... @webpagelink"},{"comment_id":"1278741865525899","commenter_b":"@username dese bitch jam cuz","commenter_a":"🤘🏼OUS🚀ON","post_message":"Slim Thug's new joint \"King\" off the new album, \"Hogg Life, Vol 4: American King\"! #WSHH #SlimThug #Exclusive"},{"comment_id":"10153414468266323","commenter_b":"Took five years for my son to be. Diagnosed he is now ten","commenter_a":"This is fucking offensive. I can't believe the writer is a senco of all people.","post_message":"The range of options available to the discerning child-labeller is growing: social issue, learning difficulty, behavioural need, obsessive tendency, food intolerance or – my all time favourite – being “on the spectrum” ..."},{"comment_id":"10153242088138132","commenter_b":"Pretty sure you have to have virgin hair","commenter_a":"Well I just got my hair colored and cut. I'm sure it will be on the front page by Monday. Hehe","post_message":"Love it or leave it?"}]
