[{"comment_id":"10154188943324255","commenter_b":"How is it that these backwoods fucktards are so hopped up about the rights of fetuses, but when that fetus grows up and needs public assistance, they think it's a loser and a piece of shit? Idiots. I guess this is what happens when you fuck your sister.","commenter_a":"yeah lets legislate morality. Like that ever works. Like some others have said, forget getting any of my tourist dollars.","post_message":"All these new restrictions will not make abortions go away. But they will kill women."},{"comment_id":"10154502608806051","commenter_b":"Shut up","commenter_a":"Chelsea sorry to say don't qualify as woman she is a pig .only flilthy mouth people it would draw to the show . Its isn't either from the species called human the bag she has she took from garbage dump she lives in","post_message":"Chelsea Handler is sparking some serious controversy over what she's holding in her hands outside the White House in this viral picture."},{"comment_id":"701341166639263","commenter_b":"Did porky hamas say something. Shame","commenter_a":"(Eo) amaso ne estas felia pro Amnesty International.","post_message":"Hamas is NOT happy with Amnesty International"},{"comment_id":"1204140369633795","commenter_b":"Did Queen Elizabeth die and they forgot to tell us about it? Holy hell had busted out all over England and some muslim dude is acting like the king! What's up England?","commenter_a":"Dear God, what will happen next? Aren't things crazy enough?","post_message":"Yes, this is real..."},{"comment_id":"1114415161915837","commenter_b":"Sweet! Kill all the muslims too!","commenter_a":"Two wrongs do not make it right.","post_message":"#Canada #EndTimeHeadlines #Quebec"},{"comment_id":"10153880758701337","commenter_b":"Lesbians","commenter_a":"Who the fuck cares..","post_message":"Justin Bieber has more than 50 tattoos yet this one fit perfectly in an unexpected spot..."},{"comment_id":"1750223515225265","commenter_b":"The other video was funnier and because you didn't get as many likes as her shes a dumb bitch. That's what made this video suck","commenter_a":"She had fun so you call her a dumb bitch. This kinda attitude is what gives pro 2a a bad rap. That and the stupid shit the NRA says.","post_message":"Remember that dumb bitch who went viral for laughing at herself?  @drewhopkins has outdone her.  Shop.TacticalShit.com"}]
