[{"comment_id":"629211877227588","commenter_b":"If you were born to an married father who was a citizen of the US, I'm pretty sure you're a natural born american, until and unless you and/or your parents renounce it.","commenter_a":"Being a naturalized citizen is not the same as being a natural BORN citizen. I'm a naturalized citizen, born in the UK to a British mother and an American father. I am not a natural born citizen and would not be eligible to run for President. How did he ever get in this race to begin with?","post_message":"It's like a circular firing squad!"},{"comment_id":"1046767232087074","commenter_b":"@username I know that - he promoted that they would all go back intially and has since changed his agenda. He announced it more or less on Hannity last night - please read the comment again. There are AT LEAST 11.5 of illegals in the nation who would not be classified as criminals. And even tho \"they would not be given citizenship\" who does not know the Left's MO - of course the left will push for voting rights. The Left needs an underclass to stay in power. They are building the numbers year after year of voting blocs to keep themselves in power!","commenter_a":"So you are going to let the 11.5 illegals stay in the nation. You say they will not be given citizenship. You must know that most of us on the right are not stupid by now, right? The Marxists will push for their voting rights anyway - and get them w/a song and dance. And there goes the nation. We will never get her back - ever. The Left is delighted. They did it. They stacked the nation in their favor. WHY do you think the wall was never built? RIP USA.","post_message":"Will be on #Hannity @ 10pE on Fox News - discussing various subjects including immigration - if elected, we will #BuildTheWall & enforce our laws! Tune in - as Donald Trump Jr. Joins me with other special guests!"},{"comment_id":"1642912372619537","commenter_b":"Very nice & her tiara stayed on!!!","commenter_a":"Awesome","post_message":"These two turned up the HEAT!"},{"comment_id":"1016582615062710","commenter_b":"I bet her tits are as ugly as her face. Just sayin.","commenter_a":"You are absolutely the dumbest white woman I have ever seen.","post_message":"Another day, another crazy comment from the View crew."},{"comment_id":"694257180764860","commenter_b":"Oh please, these people are untouchable or she would have had in jail a long time ago.","commenter_a":"Throw her off the face of the earth along with Obama. .that would be the best thing for this country","post_message":"Insider information surfaces that will ruin Hillary's career forever. She's finished. Let's spread this. Can we get 30,000 'LIKES' to keep Hillary out of office forever?"},{"comment_id":"10153889638518598","commenter_b":"You have it all wrong. The time to take-down Planned Parenthood and stop the murder of babies is now.","commenter_a":"Excellent! State's rights in action!!","post_message":"BREAKING: Kansas Governor Sam Brownback Signs Bill to Permanently De-Fund Planned Parenthood"},{"comment_id":"1324175080956294","commenter_b":"You'd rather vote for Killary That murdering lier. God help us.","commenter_a":"Can't imagine any decent American voting for this clown!! I'm not the biggest Hillary fan but anything is better than this. Use this weekend while we spend time with family and friends to first of encourage people to VOTE. And then let them know the evils this dude is spewing. We've come too far to let this dude take us backwards!!","post_message":"Just when you thought Trump couldn’t get any more racist and misogynist, he manages to lower the bar of human decency."}]
