[{"comment_id":"946663845429868","commenter_b":"One thing that is jumping out at me about this shooting in South Carolina is the way the community has come together, whites and blacks as ONE community. I look at this and than think back to Ferguson and Baltimore, what a difference. And yet so many times I have listened to liberals post on @username about the hateful, bigoted small minded people of the south. God Bless the people of Charleston and the families of the victims of this hateful crime.","commenter_a":"Hold on, those who love God will see you through, especially, those from that Church and all Churches that love the Lord Jesus Christ.","post_message":"“Oh my lord, he’s done made our life a living hell. What he did was unspeakable.”   -Carson Cowles, Dylan Roof's uncle"},{"comment_id":"10154725073385935","commenter_b":"So many silent racist ppl out there that voted for him. It's so sad","commenter_a":"That's what you think you orange buffoon!!! #FuckTrump #Resist","post_message":"President Donald J. Trump says his executive order banning immigrants from seven Muslim-majority countries is \"working out very nicely.\" @webpagelink"},{"comment_id":"1002708926488828","commenter_b":"Syrian refugees will be coming in legally. They will be documented and traced. If they wanted to sneak terrorists in the country they could do it through our southern border without much problem. AND they probably have. I would prefer that we only accept families and no single men.","commenter_a":"This breaks my heart","post_message":"If we don't know our history, we're doomed to repeat it.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154267977076756","commenter_b":"Really?....Belgium. Some of the nicest people in Europe. There is no reason in these people. They just hate everybody. Sympathy to the Belgian people. I have visited your country and was impressed with your quality.","commenter_a":"So terrible...","post_message":"NPR is following the deadly attacks in Brussels. -- At least 30 people died in explosions at the airport and a metro station.  -- Some 200 were injured, including at least one U.S. service member and his family. -- ISIS has claimed responsibility for the attacks, and police released a photo of a suspect."},{"comment_id":"1237650529605618","commenter_b":"Who is going on the Walking Dead cruise in February","commenter_a":"This is kindergarten.....,childish.........by.....","post_message":"The Walking Dead gift reveal party"},{"comment_id":"571151523088148","commenter_b":"Woopi is possessed. She can't help it.","commenter_a":"This is the woman who tried to lower the RAPE benchmark by stating in defense of an acused rapist that it wasnt \" RAPE rape.\" I heard her with my own ears.","post_message":"Did Whoopi just blame women for having affairs with Bill Clinton?  Watch the clip."},{"comment_id":"1789908131147685","commenter_b":"\" You won't divide by zero on my plane, you little bastard \"","commenter_a":"What a typical story of people being scared of things they don't understand.","post_message":"He was interrogated for two hours."}]
