[{"comment_id":"696088307225578","commenter_b":"So because this woman stooped so low as to call Obama a name in public all of you are doing the same thing. You're not any different than she is.","commenter_a":"Unbelievable.............speechless","post_message":"Apparently, saying something really racist will only get you fired for a little while."},{"comment_id":"10152811499753525","commenter_b":"Evil little monster! How would you ever trust her again!!","commenter_a":"as she should be charged.","post_message":"A Colorado mother says she smelled something different in her drinks on two occasions. She confronted her daughter about it. Now, a young girl is charged with attempted murder.   READ: @webpagelink"},{"comment_id":"10153013974226323","commenter_b":"Sam Dean Errrrrrrrr orthodox jews DO go around killing people and they are not fussy if it is children!. They have been doing so for decades while the world turns a blind eye to Israeli atrocities.But then probably too busy reporting extremists who are the minority in comparison.","commenter_a":"If a Jew does such things he is orthodox but if a Muslim happens to to involved in such things he is 'an extremist and even terrorist.Sheer madness and discrimination against female gender in Israel is DECENCY and MODESTY whereas a fraction of such acts in Muslim society is viewed and portrayed by so called free media as brutal discrimination against women .","post_message":"Something is missing here..."},{"comment_id":"10153823007621636","commenter_b":"The US is no longer safe for the blacks, pls find other homes.","commenter_a":"\"He's put on a paid administrative leave\"!!!!!!! What on earth is happening in America???? These are not police officers in fact they're BLACKAMERICANKILLERS.. cos surely where I live police officers protect people from harm and do not to blindly shoot them.","post_message":"In North Miami"},{"comment_id":"593792507477995","commenter_b":"Leave the girls alone.","commenter_a":"In all fairness now, you'd take Drugs too if you had those two Lying Muslim Idiots for parents! LOL","post_message":"The White House is in uproar after Obama daughters caught doing THIS.  This is outlandish. These are the daughters of our president.  Would you vote to kick the Obamas out of the White House?"},{"comment_id":"10152917419231051","commenter_b":"Seriously the Husbands deserve same treatment. I am not saying the mistress didn't have it coming . Chinese ladies are crazy !!!","commenter_a":"I don't get it! What about her douchebag husband!!? He's the one married but still decided to sleep with her sooo....","post_message":"This wife decided to track down her husband’s mistress and make an example out of her."},{"comment_id":"1131244553635264","commenter_b":"#BernieOrBust #BernieAllTheWay #DropOutHillary","commenter_a":"Either way it will be a Democrat all the way to the White House again for another eight years along with a Democratic majority in Congress! Many thanks to the GOP for putting up unelectable candidates election after election,those dumb idiots will never learn","post_message":"Trump must be stopped.  Image by Occupy Democrats, LIKE our page for more!"}]
