[{"comment_id":"10154125251399726","commenter_b":"Trump quick build the wall!!! Try to stop them. There is nothing wrong with Ford investing where they want. It's a great big world. We used to lead it and WELCOME business and capitalism and now we just take and tax to DEATH. Maybe if Mexico has something like Ford, creating jobs, it could slow off the illegal immigrants.","commenter_a":"then tax the vehicles made in that plant","post_message":"Ford announced Tuesday that it is investing $1.6 billion to build a new plant in San Luis Potosi, Mexico."},{"comment_id":"10153928172287411","commenter_b":"Love it...what a hoot! Dang, she would drink me under the table with that stuff!","commenter_a":"@username here is Dorothy again making good on her shot.","post_message":"That Dorothy Farrell sure knows how to party."},{"comment_id":"10154272140216336","commenter_b":"You do not agree with me because I want Trump to build the wall, and I want Hillary in jail!","commenter_a":"This clown gave cartoon maps to his citizens to help direct them to places in our border where they could run accross illegaly to work and send money back to Mexico. He's bought by the cartels and Fox is lame for giving him a voice in American politics!","post_message":"\"Pay for the wall? Why? Who is going to pay for the war on trade, the war on China's trade – it's [the] United States.\" Former Mexican President Vicente Fox Quesada said he is \"not for open borders,\" but advocates an \"intelligent and wise\" way to deal with immigration."},{"comment_id":"10153054078171336","commenter_b":"hey @username you guys have been saying that for 6 years. Settle down haters! And you sound like an idiot.","commenter_a":"Dig deeper because this is not enough to derail her run. She kept the records!","post_message":"“Can we trust Hillary Clinton to produce all of her email when we couldn’t trust her to obey the law that she had to use a State Department email?” – Senator Rand Paul asked on tonight's The Kelly File. @webpagelink"},{"comment_id":"10155022062873984","commenter_b":"Support the Gaines-not the pastor!","commenter_a":"Yes I stand for u chip and joanne","post_message":"'Fixer Upper' stars Chip and Joanna Gaines are being targeted by the media for their church's support of traditional marriage. Liberals are trying to destroy the Gaines family, and now they need your support more than ever. Stand behind Chip and Joanna Gaines and fight the liberal media by signing this petition!"},{"comment_id":"10153238484143984","commenter_b":"Screw the bitch and her lying ass husband.","commenter_a":"Move out bitch","post_message":"People are furious, and I can understand why. Do you think Michelle is an out of touch First Lady?"},{"comment_id":"1729018337314031","commenter_b":"Hello everyone,my name is sandra from the united state,getting my lover back was what I least expected and could never imagine,my lover and I were together for five years,but all of a sudden he changed completely and turned away from me and I had no idea what was going on,I tried asking him why but he refused to tell me what the problem was,as time went on he sought for a breakup,I was so worried and confused but I never gave up on him until I met an old friend of mine who had a similar problem,she told me about a spell caster called alakijaoogun who helped her situation,I never used to believe in spell casting in my entire life because I never taught it could work for me but to my greatest surprise it got me a positive result and I was able to get my lover back,even after ...","commenter_a":"i think she has thrush","post_message":"Miley Cyrus delivered quite a statement to Donald Trump..."}]
