[{"comment_id":"409554185871204","commenter_b":"Like we could depopulate people that breed like rats.","commenter_a":"Depopulate Mexico is the name of the game. Guess who benefits?","post_message":"The case of the 43 missing students in Mexico has galvanized discussion and efforts to locate thousands of others who remain missing."},{"comment_id":"10153725740586336","commenter_b":"Who Cares. He's a Conservative Rapist","commenter_a":"Keep him on the other side of the Trump Wall.","post_message":"Police say Paul Jackson and his older brother, Vance Roberts, kidnapped prostitutes, drove them to Roberts' home and held them captive for days."},{"comment_id":"1009718899145010","commenter_b":"Well the Wicked Witch odf Washington has looked better noow hasn't she.....TRUMP will save America...For us Mericans. Yall can move to Canada.....","commenter_a":"The dumbing down of America, this is the people we take care of with government assistance, most are not capable of taking care of themselves let alone voting","post_message":"Woah. Donald Trump voters will be the end of America as we know it. Thanks to Mitchell Wiggs for the video. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153779495443854","commenter_b":"WE ALL DEAD","commenter_a":"is this where the inhabitants of the northern hemisphere exterminate themselves","post_message":"Putin Warnes of Global War"},{"comment_id":"1630331337026989","commenter_b":"@username Yes. That is certainly a tragedy which no one denies. These people were murdered and their sacrifice should be honored. This article is stating that obama could have stoped it and deliberately did not. This is fake news at its highest degree and is shameful because it uses the dead to tell a lie.","commenter_a":"Fake news: Moreover, the majority report issued by the House Select Committee on Benghazi plainly stated that, minutes after learning about the ongoing attack at the U.S. diplomatic compound, President Obama and Secretary of Defense Leon Panetta issued \"clear orders to deploy military assets\":","post_message":"Here's the proof folks. Both Hillary Clinton AND Barack Obama are now exposed for not pulling the trigger to save anyone's life in Benghazi, when they could. This is the end of their careers! Let's get 5,000 shares if you think they should both be locked away for war crimes."},{"comment_id":"10153627829156336","commenter_b":"Who really cares about the name?!!!! Native Americans care about protecting Mother Earth!!!! Get rid of the Pipeline!!","commenter_a":"How about leaving the mountains name alone and concentrate on more important priorities.","post_message":"President Barack Obama is restoring the name of the tallest North American mountain peak – Mt. McKinley in Alaska – to the native Alaskan name of “Denali,” the White House said today. @webpagelink"},{"comment_id":"1231536326885822","commenter_b":"She's not getting in the White House !","commenter_a":"The real sad thing is that Hillary won this election a long time ago with lies , blackmail, payoffs etc. The list goes n and on. She and her party are so dangerous and I fear our world will never recover from her.","post_message":"SHADY KAINE @webpagelink"}]
