[{"comment_id":"10158383797715093","commenter_b":"what do we care? get the wall built!","commenter_a":"I BET THE PEOPLE WHO LEAKED WERE DEMOCRATS","post_message":"\"It time for the constitutional system to work. It time for the legislative branch to investigate the executive. Simply put, it time for the truth.\""},{"comment_id":"1357571687635909","commenter_b":"Kidult fan!","commenter_a":"That's what the fans should be saying to you","post_message":"Don't get us thrown out of Euro 2016"},{"comment_id":"763958360369439","commenter_b":"A child should not have that choice any more than she can legally choose to smoke and drink.","commenter_a":"With all the people out there fighting for a woman's right to make choices for her body (abortion and birth control) how can you justify forcing medical treatments on someone? Either a person has total control of their body or they don't. Can't have it both ways.","post_message":"After treatment, she's in remission."},{"comment_id":"905632936170129","commenter_b":"No mames wey pobre jente k vive cercas!!!","commenter_a":"Luis atacko godzila.","post_message":"Huge Chemical Plant Explosion In Tianjin, China!"},{"comment_id":"10153959431701756","commenter_b":"10,000 troops + ??? = Peace. Duh.","commenter_a":"Sure, send ground troops, take out Isis on a matter of weeks and then... What?","post_message":"Sen. Lindsey Graham says he wants to send in upwards of 10,000 ground forces as part of a coalition to fight ISIS."},{"comment_id":"10153731050907464","commenter_b":"@username THEY'RE A LOT OF SICK TEABILLIES!!","commenter_a":"You referred to the Colorado Springs shooter who killed 3 people as a \"transgendered leftist activist\". Since when does a \"leftist\" spread anti-Obama propaganda and refer to fetal tissue as \"baby body parts\" as you and your ilk do? You are a disgrace for spreading even MORE rhetoric and you are unfit to be president.","post_message":"An impression from my favorite movie? As you wish..."},{"comment_id":"1720797558169853","commenter_b":"LOL.... The immigrants steal our jobs.... even our speeches!","commenter_a":"She did a great job last night!","post_message":"Join me behind the scenes at the 2016 GOP Convention -- as I introduce our next First Lady of the United States of America, Melania Trump! #MakeAmericaSafeAgain"}]
