[{"comment_id":"10153487463364203","commenter_b":"Problem is not her parents. Problem is a whacked out white woman desperately wanting to be black.","commenter_a":"It's weird but I wonder why her parents threw her under the bus. Must be something else going on.","post_message":"The NAACP president in Spokane, Washington, has come under investigation after her parents said she been posing as black for years."},{"comment_id":"777437579026197","commenter_b":"No I think the lying words wouldn't come out,she was choking on them.","commenter_a":"BS","post_message":"I don't think she had ANYONE fooled..."},{"comment_id":"1538307646229359","commenter_b":"Let it burn ...what a dumb bitch...","commenter_a":"Let's see how that works out!","post_message":"What do you think?"},{"comment_id":"10154369386511545","commenter_b":"Imagine if someone came and ruined America and a civil war started. People killing and fighting everyone. Not everyone has the money to buy guns or the nads to pull a trigger. Hopefully that never happens but I am guessing people would try and leave, some in a hurry to wherever is better and closest....and hopefully don't get turned away at borders.","commenter_a":"Why, oh why, can't the pot stirrers understand the difference between LEGAL and ILLEGAL when it comes to immigration?!? The US was indeed made up of immigrants, and we love immigrants still, WHO COME HERE LEGALLY. And while I'm at it, why should we take in refugees WHEN WE HAVE NEEDY AND HOMELESS AMERICANS IN EVERY MAJOR CITY IN THE US? Let's give the CITIZENS all the benefits first. Why is that such a hard concept for some people? Seriously! Do you really think any other country in the world would put refugees AHEAD of its own citizens?!? No! Americans first, then help others. Just like in an airplane, put YOUR oxygen mask on first, then help the ones around you. Oy!","post_message":"The full commercial didn't appear on television during the big game after it was rejected by Fox. The full ad, which is nearly six minutes long, is available on the company's Twitter account."},{"comment_id":"10153920476909614","commenter_b":"Silly girl!","commenter_a":"@username - this is the women I was referring too.","post_message":"It was just two years ago today that iconic singer Natalie Cole performed \"This Will Be (An Everlasting Love)\" during the 125th Rose Parade. Following news of her death, this clip from the KTLA archive seemed like an appropriate tribute to the nine-time Grammy winner. Cole died Thursday evening at L.A.'s Cedars-Sinai Medical Center due to complications from ongoing health issues, according to a family statement provided to the AP. Read KTLA's story here: @webpagelink"},{"comment_id":"10154247175501680","commenter_b":"I've seen you post this exact thing, verbatim, on another posting. Are you just copy/pasting on all the posts? If so, I would spend some time on grammar and punctuation because this is completely incoherent. I've tried 2xs to understand what you are saying but i give up by the second run on sentence...","commenter_a":"Trump return dodd-frank law to gang of bail out banks to reduce their power and to transfer it to the people of usa and to stop fraud in the stock market stealing from workers ,middle class investors and retirement funds and reduce USA world's record inequality ,legacy of lawless obama.They will have to pay you your part anyway because if not you send them to jail for using privileged info all together for stock trading,take gang of bail out banks the license to steal with stock market and reduce their money to pay for protests ,lies, to bribe GOP politicians and to own Democrat party.take the financial resources from the establishment.FREE USA.return power to USA people.Make america great again.,there is more freedom in china than usa ,with gang of bail out banks holding power here since they brought obama to powerThere was another fair solution for banks ,was to bring ...","post_message":"The best guide to what Donald J. Trump would do as president appears to be what he said he would do as president."},{"comment_id":"10152900283295950","commenter_b":"You're the little bitch","commenter_a":"First of all, why the hell are 5th graders getting diplomas???","post_message":"One by one, Trinecia Blacklock's fifth grade classmates were called to walk across the stage to get their diplomas. The wheel-chair bound student waited for her turn, but her name was never read aloud — and she was left alone, sitting by herself."}]
