[{"comment_id":"10155061225139726","commenter_b":"The woman wearing this would probably be beaten to death. Better off carrying a gun!","commenter_a":"Women in America carry guns. What are we back to the middle ages? women at the time wore chastity belts to protect themselves from the muslim ancestors of the same ones today who were terrorizing Europe back then.","post_message":"It's a modern day chastity belt."},{"comment_id":"10153923917206130","commenter_b":"No this is an attention seeker.Most women don't do this,especially at someone's wedding.","commenter_a":"Nothing says lets party more than a baby on a boob. :)","post_message":"Now THIS is a cool mom. 😎"},{"comment_id":"1784975415104883","commenter_b":"Quit talking the talk and walk the walk and prosecute this Bitch already for crying out loud!!!!!! No more POS criminal Clintons in the White House!!!!!!!","commenter_a":"We need to start a new Party, the Constitutional Conservative Party.","post_message":"DML explains about indicting Hillary Clinton for her emails -- what would it do? Plus, little inside info from pollsters who say Trump leading in polls nationally by Tuesday. Watch, share, and if you are new to DML please give this page a LIKE."},{"comment_id":"10153149843920090","commenter_b":"NOT this woman ;)","commenter_a":"too bad all the women will vote for her, for no reason other than shes a woman, like the minorities voted for Obama...with no reason other than he is black","post_message":"Share this with your friends & neighbors—take the pledge to Stop Hillary! Start here: @webpagelink"},{"comment_id":"1027684670588211","commenter_b":"Sadly it's true though. The American education system is poor and it's not the citizen's fault.","commenter_a":"Who did this survey? You just want to make fun of Americans and make others feel superior. By the way, your Grand Canyon photo is too dark, poorly done.","post_message":"Do you know where these major national landmarks are?@webpagelink"},{"comment_id":"10158120208050557","commenter_b":"You attempting to make this about ME, so as to DISTRACT from the FACTS, TRUTH and REALITY, is a very \"cute\" little trick, implemented by YOU and so many others, who comment on this page.","commenter_a":"The PRICKTATOR's is at it again. If you're not concerned yet, you're either brain dead or a complete idiot.","post_message":"President Donald Trump fired acting Attorney General Sally Yates Monday night for refusing to enforce a legal order designed to protect the citizens of the United States, the White House said."},{"comment_id":"10155984439405354","commenter_b":"She's gross and needs to go away. Now.","commenter_a":"She's making too much money telling bad jokes.","post_message":"Schumer did not mention that the shooting during her movie took place in a theater with a total gun ban–**100 percent gun control**."}]
