[{"comment_id":"10152631358675779","commenter_b":"He's hip pop. And of course they do numbers most ppl think the radio is all there Is to offer. And I'd say 3 ouuta 4 drake fans r girls. Drake can go hard but he chooses not to cuz that don't sell albums to women...so instead he's like \"long as my bitches love me\" lol","commenter_a":"It's funny how people who don't like hip-hop or don't like Drake's music post derogatory comments .If you don't like it don't post it,I think music like Young Thug(or when Gucci Mane was hot) & HALF of what I hear on the radio is trash lyrically but perfect for a party,but I don't sound off on it b/c the numbers that these songs/mixtapes/albums do,speak for themselves regardless of what we as neigh-sayers,b/c it's not our cup of tea,may say about it.Although I am biased to Drake's music,I love music period so why don't we all just take a lil advice from a19 year old(myself) & actually be grown about what we post instead of being ignorant cause honestly,8 times out of 10,nothing we say is taken into major consideration by the famous.In the words of Kevin Durant,\"Why do you tweet?\" lol...dang","post_message":"Is it an album? Is it a mixtape? Who cares? The 17 tracks Drake released at midnight last Thursday hit harder and hold together more cohesively than most big-budget event albums. Click through for our full review of ‘Too Late.'"},{"comment_id":"10153609114867212","commenter_b":"@username and the other \"haters\", tension in the city? \"Maybe\" criminals and snipers will think twice before shooting someone like the officers, if they know they have fire power back! In Dallas most of those officers only had hand guns to defend theirselves and the innocent people! Their hand guns didn't reach the distance needed! Now, that's TENSION! You think it would be \"tension\" if your Police Officers were equipped properly in your city, but what would you do if this same thing happened in your city like it did in Dallas? Dont ever say it can't! The world is changing, wake up! It shows you do NOT have a son, brother, father, uncle or a good friend out there daily in a police uniform or you would want them protected! Keep hiding your head in the sand and hope one day you, your child, parent or loved one never ...","commenter_a":"They should carry their guns on duty n off back off the cops they save life's no matter what anyone says they have been their when I needed them and I have my blue to show it. Chief is doing what he thinks is right period","post_message":"The American Civil Liberties Union of Oklahoma (ACLU) is speaking out against Oklahoma City Police Chief decision allowing officers to carry personal rifles, saying it is likely to increase tension between the public and law enforcement. #News9"},{"comment_id":"10153880713234753","commenter_b":"Do better job then Hillary","commenter_a":"Vote trump","post_message":"A Latino Trump supporter in California claims it’s a lot more difficult to publicly support Donald Trump than to come out as gay. Juan Hernandez, who is a member of the Log Cab Republicans, a gay conservative group, indicated that he was leaving the Trump rally in San Jose, California, on June 2, when a mob of violent Trump protesters attacked him, breaking his nose in the process. A friend was similarly set upon by the assailants, some of whom carried the Mexican flag and were burning the... @webpagelink"},{"comment_id":"10154428619792144","commenter_b":"Kimberly, other than Melania Trump, you wouldn't know an illegal immigrant from a U.S citizen if your life depended on it. Get ahold of yourself woman!","commenter_a":"Seriously????? Let it go.....He's done, THANK GOD!!!!!! The end of an ERROR....","post_message":"Thank God."},{"comment_id":"10154135870346336","commenter_b":"@username OMG---More Trump Fabricated LIES!!!Trump Played Everyone Like A FIDDLE With Those TRUMP Planted PAID Protesters, Trump Now Has 20 Secret Service Guys Guarding Him At His Rally, EGO IS THE WORD...He Really Knows How To Play the Media & Followers *NEVER TRUMP* TRUMP Wants to TURN Our Military INTO ZOMBIE TeRRORIST Animals To Beat ISIS...BUT OUR MILITARY IS AN ELITE GROUP & Has Rules & Morals.... ISIS is A BAND Of MURDERS & CRIMINALS.... TRUMP Wants A WAR $$.....People Are Blinded by Trump's Rhetoric and can't SEE Trump Sending Our Young Adults To Fight An All OUT WAR AGAIN! Government Welfare KING DUMP Trump doesn't need anyone's HELP exposing His LIES Trumps own EGO Is His Own Nemesis.. ??Has Trump Gone From Selling Realestate Properties To Selling Our Whole Country!TRUMP wants to Do Away with Social Security & Medicaid For Our ELDERLY!!! HOW is Trump Helping American JOBS when ...","commenter_a":"Typical Trump...talking about anything other than specifically HOW he is going to make AMERICA great again!! Just saying it won't make it so!! Maybe that's why he gets no more than 35% of the vote. The other 65% are on to his BS...He only cares about Trump not one of his supporters! Wake up people!!!","post_message":"\"[Marco Rubio] made a statement that I had small hands. He made it up. He's a politician. Politicians lie.\"  Today on \"MediaBuzz,\" Donald J. Trump talked about the \"hands\" story."},{"comment_id":"10153400875176833","commenter_b":"my Vote WILL NOT BE FOR HER!!! I want to Keep the Constitution. We she get in the white house you can kiss this Country and are Constitution good bye..","commenter_a":"Where's sirhan sirhan when you need him ?","post_message":"Never mind all the rhetoric about how Hillary Clinton can get the Democrat Party presidential nomination because some fringe elements don think she radical enough. The Hill reports that  for gun control [an increasingly fringe group in their own right] have high hopes for Hillary Clinton presidential run, seeing her as  ally who can finish the push for tightened background checks that has stalled in President Barack Obama second term.  Indeed, Clinton has been a vocal gun control supporter for more than 20 years."},{"comment_id":"988508257851300","commenter_b":"what a women feel when do this?","commenter_a":"Back before social media, women's magazines used to use this as a rule of thumb for whether you could get away with going braless (if the pen falls, you can ditch the brassiere. if it stays, strap 'em in.) Which would be shaming in the other direction, by today's standards, I guess?","post_message":"Why #Underboobchallenge is going viral."}]
