[{"comment_id":"1273278439392985","commenter_b":"This is what the feminist want for women in America","commenter_a":"Very sad! But the good part is that she is a martyr and spends eternity with our God of pure Love!","post_message":"GRUESOME VIDEO: Muslim Mob Tears 27 Year Old Woman Apart Before Killing Her Over False Accusation Of Burning Quran  This horrific \"honor killing\" was caught on video and published by the New York Times. It took place in Afghanistan…These are NOT terrorists. They are just a mob of local Muslim men administering \"justice\" to a woman who was unjustly accused of burning a Quran. ***WARNING***Video is very graphic!"},{"comment_id":"10153518586283812","commenter_b":"I say if men can do it, so can women. Get over it. If she doesn't want to shave then she doesn't have to. But if you want to then do it.","commenter_a":"No thanks. I think I'll skip this fad too","post_message":"On social media and red carpets, from New York to China, women's hairy underarms are having a mainstream moment: @webpagelink"},{"comment_id":"1762322484002162","commenter_b":"Criminal CUNT","commenter_a":"Absolutely NOT !!","post_message":"Is Hillary Clinton America's best choice for president?"},{"comment_id":"10153352212341162","commenter_b":"So, Michael \"TheArtist\" Louis, what you're saying is- the young man in the meme isn't \"black\" enough for you? That only people who subscribe to the stereotypical depiction of how black people dress and behave are \"real\" black people? If that's not racist against African Americans, I don't know what is... Smh. And isn't the point of ending racism getting AWAY from stereotyping based on the color of a person's skin? The funny thing is, the meme maker -who is presumably black based on what the meme says- is *trying to* say that white people are racist, when in reality - they have such deeply rooted issues of their own that they didn't even realize their meme was racist against themselves. Start with yourself...","commenter_a":"Looks like she for sent home for having a black date nothing's wrong with her dress","post_message":"TOO REVEALING? A girl was sent home from prom because school officials thought her dress showed too much skin. What do you think?   PHOTOS: @webpagelink"},{"comment_id":"481694655288924","commenter_b":"This lady is an idiot.","commenter_a":"Her eyes bulge out because her head is so full of bullshit it's about to explode!","post_message":"Isn't that just rich...The only time rich Hollywood liberals pretend to care about the Bible is when they think they can twist and contort it to make some asinine political point to appeal to those Bible thumpin' dumbo Christians in \"fly over\" country.  #NiceTry #ElitistLiberals"},{"comment_id":"10153534003896336","commenter_b":"He's also a Democrat","commenter_a":"our Massachusetts senator markey voted not to defund planned parenthood","post_message":"BREAKING NEWS: Senate blocks Republican legislation to defund Planned Parenthood. @webpagelink"},{"comment_id":"10154165590671746","commenter_b":"Yes ! Now the lazy legal Immigrants have no excuse of not being able to find jobs","commenter_a":"Please restaurant owners get new workers","post_message":"Two South Shore restaurant owners were put on notice by their staff either early Thursday morning or Wednesday evening: Workers would be no-shows for the 16th \"out of protest.\""}]
