[{"comment_id":"1035959943168617","commenter_b":"@username Trumper Humpers have elected her through their ignorance.","commenter_a":"We will never forget scum like u Vote TRUMP","post_message":"Did Obamacare deliver lower premiums & more choices? No. Our office has done the research. Read our full report here: @webpagelink"},{"comment_id":"10152885307051336","commenter_b":"Totally totalitarian and just plain wrong","commenter_a":"Start pushing back people!!! They care nothing about your kids.","post_message":"UPDATE: The Goochland County School Board has now voted down the controversial policy on religious homeschooling. @webpagelink   Virginia parents are outraged over a new policy that demands home-schooled children justify their religious beliefs to a school board within 30 days of their 14th birthday."},{"comment_id":"1824366427776560","commenter_b":"Build that wall starting January 20, 2017.","commenter_a":"Build that wall !!!!","post_message":"URGENT: Please vote now.  Do you support building a wall with Mexico?  A new national poll released today says 53% of Americans DO NOT want a wall along our southern border.  The question is, do you?"},{"comment_id":"529925163864730","commenter_b":"Kool","commenter_a":"This poor (morally) man reminds me of the KKK and how most whites were offended and embarrassed by them in the early 60's.","post_message":"Al Sharpton's career is going to come to a screeching halt after this.  His own people are turning against him. Now is the time to strike.  Can we get 30,000 'LIKES' for Al Sharpton getting fired?"},{"comment_id":"10154173925206498","commenter_b":"She'll give birth at 2-3am like most animals do lol","commenter_a":"The guy in an earlier video said it can take hours to days for the birth to happen it is when nature is ready for it.","post_message":"GIRAFFE CAM: April the giraffe is about to give birth. @webpagelink"},{"comment_id":"10152738126476051","commenter_b":"What a dumb woman","commenter_a":"Just give her the money and don't accept any more invitations from her, damn !!!","post_message":"The woman who invoiced a 5-year-old for missing her child’s birthday party has a message for all the haters."},{"comment_id":"10152557601575950","commenter_b":"Well they can't come back and tell the others that there are no virgins","commenter_a":"French terrorist ? I never heard viva la France during a plane hijacking and if I hear Allah Akbar I'm knocking that son of a bitch out","post_message":"There is evidence the three dead suspects -- brothers Said and Cherif Kouachi and grocery store gunman Amedy Coulibaly -- knew each other and shared common ties with known terrorists."}]
