[{"comment_id":"902172716496023","commenter_b":"I stand corrected. It is Planned parenthood that started with the concept to murder black babies before they were born.","commenter_a":"Aren't the Democrats responsible for the initial abortion idea and practice? Also, the plan was to abort unborn black babies. Who's the racist? Hint...DEMOCRATS!","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"1300695323356852","commenter_b":"Get educated. Oh that's right you don't want the truth only lies from the most disgusting pig.","commenter_a":"Hillary supporters, How do you put Syrian refugees before American people? How do you look a homeless vet or child in the eyes and say sorry I won't help you. Oh the same way you turned your back on American's in Benghazi.","post_message":""},{"comment_id":"1093795067333572","commenter_b":"Suck it.","commenter_a":"He means defying the will of the people is what the campaign is about. Hillary has the popular vote and delegate lead. #dropoutberniesanders","post_message":"TONIGHT: Bernie Sanders on continuing his fight for the Democratic nomination: \"Defying history is what this campaign has been about.\"  @webpagelink"},{"comment_id":"10153227586230047","commenter_b":"He did the right thing","commenter_a":"No","post_message":"While serving overseas, Sergeant Martland intervened to protect a child from sexual abuse.  He deserves to be honored for this heroic action, not punished.     Sign and Share our petition to fully reinstate Sergeant Martland: @webpagelink"},{"comment_id":"10152897660675950","commenter_b":"I wondered the same thing. Those bitches be crazy!","commenter_a":"where's part 3??","post_message":"In a video of the incident, two women are heard yelling at one another before the argument escalates and gets physical. Then a 6-year-old gets involved; at one point, the boy is seen hitting a woman with a shampoo bottle as the women wrestle on the ground."},{"comment_id":"1240263705993657","commenter_b":"@username Oh Dave, ad hominem?","commenter_a":"NBC's biased information. All gun injuries are required by law to be reported by Dr's and Hospitals. What is under reported is the number of fools believing NBC","post_message":"A researcher believes the number of unintentional deaths of children involving firearms may be under-reported. \"We make make it incredibly easy for anybody who wants a gun to get a gun. And, we don't store them safely,\" he said."},{"comment_id":"10153854482548854","commenter_b":"She's shrewish","commenter_a":"I do not know why? But I do not like Fiorina...She looked like a teacher who is lecturing a student. She sound defensive as if she is always under attack.","post_message":"Carly Fiorina Calls Out Clinton And Obama For Politicizing San Bernardino Shooting"}]
