[{"comment_id":"1471521346221666","commenter_b":"@username I cannot in this day and age believe that someone as backwards uneducated,unread as you still exists. You know all that crap has been debunked yet you continue to stream it. I don't know if you are a troll or not but there is no brain matter in your skull.","commenter_a":"He is just a rich piece of trash. Money can buy you tons of stuff, but it cannot buy you decency, morals, health or happiness.","post_message":"It just keeps getting worse!"},{"comment_id":"1638898229733425","commenter_b":"Everything good in your speech, but I believe illegals should not be getting welfare or food stamps, or free health care or education it's just a magnet and most of them are not paying into payroll taxes. You are still avoiding what you are going to do with the illegals that aren't criminals. Actually they did break the law if they came here illegally and if they stay here even if they don't get citizenship it's still ammnesty. You need to be up front with what you are going to do.","commenter_a":"Great speech!!!!","post_message":"Thank you for your wonderful support last night- with regard to my Immigration Speech that I delivered at the Phoenix Convention Center. I love this country - and you, the people. Lets MAKE AMERICA SAFE AND GREAT AGAIN! I love you! Donald J. Trump"},{"comment_id":"10153321569596615","commenter_b":"The mask is part of hiding from an insecure woman so she can never find me again.","commenter_a":"Insecure women ruin more lives than drugs.","post_message":"\"Some people are commenting that she must be insecure or something, but it’s quite the opposite. People tell us we have the best marriage they’ve ever seen.\""},{"comment_id":"10153637330793271","commenter_b":"Good, throw them both in jail and throw the key away!","commenter_a":"I am happy to hear this. I pray that it will bring even a little comfort to the family and friends who are grieving.","post_message":"#BREAKING: Ignacio Paul Daigle, the second suspected car thief involved in a crash that killed a young Thornton mother, has been arrested.  Good job, Westminster PD!"},{"comment_id":"800077153428906","commenter_b":"Women....or bitch....","commenter_a":"Welcome to a Hillary Presidency: Day to day scandals and law breaking. But, the Dems are OK with that as long as their guy is in office.","post_message":"This is definitely raising eyebrows..."},{"comment_id":"1772923492974110","commenter_b":"@username .. Tippu tip, one of the greatest slave traders known to man that had over 10,000 slaves in Zanzibar, grandmother was a muslim slave. The problem with islam is the contradictions. You inherit the greatness of your lineage as well as all of the ills. The first step for Muslims to get passed this & be accepted in the international community is to accept the past for what it is & stop lying, deflecting, & manipulating it. It only creates more RAGE! Everything in this video is FACT and supported with 100's of years of abundant evidence. This video is actually a low ball. The actual number of victims of islamic genocide s 100 - 150 million deaths. Please stop telling me about \"bilal\" that was a slave in the first place by an arab. Abu bakr freed 3 personal pagan slaves for bilal's emancipation. Am I suppose to ...","commenter_a":"This is the blind teaching the blind. A ratings based media hub focusing on the impulses of the ignorant. This is not accurate about Muslims and therefore makes it inaccurate of Arabs. All Arabs aren't white. There was a black Arab named TIPPU TIP, he was one of the biggest contributers to slavery. He was very black. Look him up. Also, a Arab can't teach islam. Because Islam isn't synonymous with Arabs, it's more wide spread with Asians. Indonesia is the largest population of Muslims. All Arabs aren't muslim. And there were many Arabs who rejected Prophet Muhammed. I love history but I hate when people try to each topics of sensitive topics but pose a biased view. Black people must realize we are not all the same. Americans aren't the same a all Africans. We know why we're African, but most don't know we're more American than the white ...","post_message":"10 Facts About The Arab Enslavement Of Black People Not Taught In Schools"},{"comment_id":"922540534474731","commenter_b":"DO IT! I am afraid that he will fire them all and replace them with illegals and give them citizenship.","commenter_a":"I'll support police officers","post_message":"Cops Threatening To Turn Their Backs On Obama At Annual Police Memorial Friday  @webpagelink"}]
