[{"comment_id":"1805298753047564","commenter_b":"I know Jim, I'm a diehard liberal, but when people like this commit these acts they prove that they are complete wastes of oxygen and need to be taken out of society. They are sociopaths and can never change. They must go for the safety of society!! Lethal injection is easy compared to what some people do to others. They actually are dying a much easier death than their victims.","commenter_a":"again everytime i think there should be no capital punishment, assholes like these come along and changes my mind","post_message":"The man had to crawl to save his wife."},{"comment_id":"10154177899058812","commenter_b":"shut up and go away","commenter_a":"and now back to the real news","post_message":"JUST IN: President Obama orders flags flown at half-staff in honor of Nancy Reagan. abcn.ws/1M2M51P"},{"comment_id":"976984712394583","commenter_b":"it was a $130,000 bust lol.... oooh what an impact. Responsible gun owners who will do things like \"not break the law\" and register their firearms, aren't going to buy them illegally on the black market. The people who are looking for guns to commit crimes with will continue to buy them on the black market. Changing any laws will not change this fact. In other news, water is wet.","commenter_a":"Holy silenced Uzis.","post_message":"This is why criminals get guns so easily."},{"comment_id":"1285291914863987","commenter_b":"Another Muslim bites the dust !!!","commenter_a":"Thank you sir","post_message":"The police officer who shot and killed The Ohio State University attacker has been identified as Alan Horujko. @webpagelink"},{"comment_id":"10153290694163279","commenter_b":"Shut up.","commenter_a":"@webpagelink David W. Blight described the day: This was the first Memorial Day. African Americans invented Memorial Day in Charleston, South Carolina. What you have there is black Americans recently freed from slavery announcing to the world with their flowers, their feet, and their songs what the war had been about. What they basically were creating was the Independence Day of a Second American Revolution.","post_message":"As part of our Memorial Day special, watch this speech by former Rep. Pat Schroeder recorded at the conference, \"Vietnam: The Power of Protest.\""},{"comment_id":"10154489632511051","commenter_b":"True, LOCK HER UP !","commenter_a":"agree'","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"},{"comment_id":"10153127913913812","commenter_b":"Shut up Canadian","commenter_a":"Classless","post_message":"Leaving her head uncovered in Saudi Arabia, a country where women have few rights, the First Lady leads by example: @webpagelink"}]
