[{"comment_id":"10153920476909614","commenter_b":"Silly girl!","commenter_a":"@username - this is the women I was referring too.","post_message":"It was just two years ago today that iconic singer Natalie Cole performed \"This Will Be (An Everlasting Love)\" during the 125th Rose Parade. Following news of her death, this clip from the KTLA archive seemed like an appropriate tribute to the nine-time Grammy winner. Cole died Thursday evening at L.A.'s Cedars-Sinai Medical Center due to complications from ongoing health issues, according to a family statement provided to the AP. Read KTLA's story here: @webpagelink"},{"comment_id":"656722471175453","commenter_b":"Bitch","commenter_a":"PIG.","post_message":"GO!!!"},{"comment_id":"10153063738641135","commenter_b":"Ladies","commenter_a":"Except, it turns out she is not a very kind person either. Her facebook is private now but before this story broke and it was visible, she had posted many things making fun of those with disabilities. She is also appears to be a 9/11 conspiracy theorist. I wish news outlets would look into this before constantly sharing this story.","post_message":"ICYMI: A Michigan mom bought coffee for two women behind her at a Tim Hortons despite insulting comments made about her looks. STORY: @webpagelink"},{"comment_id":"1544946612212472","commenter_b":"Superior to a chimp maybe.......","commenter_a":"He's such a moron! And his father has the nerve to say he has superior genes!","post_message":"What an idiot!"},{"comment_id":"10153141451562894","commenter_b":"She a dub","commenter_a":"@username 😕","post_message":"Kylie Jenner literally just went from 100 to 0"},{"comment_id":"599734130175363","commenter_b":"she is such a idiot","commenter_a":"Repeat a lie long enough and loud enough . . . Welcome to Nazi America, 2015","post_message":"Temper, temper, Carly."},{"comment_id":"10153292993241350","commenter_b":"I don't think I should be President, but another woman could do a great job.","commenter_a":"WOW - she has self esteem issues if she thinks she (or ANY Women) can't be President!!!!","post_message":"\"I think women can do anything and be anything, but the president, I feel, is for a man...That does not mean we cannot be successful run businesses, be doctors, be lawyers I was only speaking of one specific position...and again, it's just my opinion.\""}]
