[{"comment_id":"10153822220001162","commenter_b":"She needs to die a horrible death","commenter_a":"Her parents must be very proud of how their daughter turned out.","post_message":"BUSTED: The \"Baby Doll\" drug lord, Ana Marie Hernandez, is arrested in Mexico for allegedly running a cocaine pipeline to Chicago --> @webpagelink"},{"comment_id":"10154218056967439","commenter_b":"The ones in the Muslim communities that haven't done anything are still in Stage 1......just wait until they move to Stage 2 & 3....it is in the Quran: @webpagelink","commenter_a":"Cameron what a d-------","post_message":"And do what exactly? Convert? Christianity is not the problem. How many murders, attacks etc will it take for these craven quisling to realize their appeasement and submission is not working? UK PM Cameron: \"Our brothers and sisters who are Muslims, they want our assistance.\" Uh, no they don't."},{"comment_id":"10154311772481694","commenter_b":"Just when I stop thinking of him as Vern Schillinger.","commenter_a":"Geez. He must pull the plow at Farmers Insurance","post_message":"Commissioner Gordon is apparently way more into fitness than J. Jonah Jameson."},{"comment_id":"10154101126057680","commenter_b":"That's why we as black folk don't claim her ass! She can take a seat over there with O.J. and Tiger Woods!","commenter_a":"She is going straight to hell for stating people will BOW DOWN to that clown. Who talks like that????? OMG! Sad part about it ... she's oh, so serious. smh This chick needs to be mentally evaluated. Clearly, the elevator doesn't reach the top floor in that screwed up head of hers. Delusional is an understatement! She is so embarrassing ... :(","post_message":"Omarosa Injured at the White House, Reportedly Rushed to the Hospital on a Stretcher"},{"comment_id":"1120997057921304","commenter_b":"In my way to get wine lol!!!!!!","commenter_a":"Bad science!","post_message":""},{"comment_id":"10154082768681130","commenter_b":"The popular vote doesn't determine the presidency.","commenter_a":"She should have picked Bernie and that way all his voters would have voted for them","post_message":"Meet Hillary Clinton's running mate: Sen. Tim Kaine of Virginia."},{"comment_id":"10156001387100354","commenter_b":"I would prefer you be hung, Stabbed, set on fire, tar and feathered, AND THEN DECAPITATED. SAD THING, Americans NEVER GETTING WHAT THEY WANT OR NEED!","commenter_a":"How do so many of these guys have zero brains when it comes to breaking the law. They are truly brain dead about this!","post_message":"How, again, did this guy break into the top 10?"}]
