[{"comment_id":"10153395954276051","commenter_b":"It's a deformed pig fetus.","commenter_a":"Yea right.","post_message":"When a woman found this bizarre creature in her backyard, she was completely horrified."},{"comment_id":"1007076626015699","commenter_b":"Yes they need to hire them back and get rid of the illegals that took there place ...what needs to be done is the illegals need to be shipped out of this country we don't need them not do we want them","commenter_a":"they need to hire them back","post_message":"Trump also criticized Marco Rubio for sponsoring the \"I-Squared\" bill that would TRIPLE the number of H-1B foreign visa holders in the U.S."},{"comment_id":"10154434142778822","commenter_b":"The new laws in place are great for addicts but not so much for those experiencing post-op pain. Again, everyone is paying the price for addiction.","commenter_a":"There are legal opiate drugs and you don't get refills.","post_message":"Opioid addiction is an epidemic in our region and throughout the country. The numbers are preliminary, but deaths from drug overdoses have hit another all-time high in the region in 2016… and the crisis is showing no signs of slowing down."},{"comment_id":"10153238417336717","commenter_b":"Like regular hetero marriage is such a fountain of virtue. LOL","commenter_a":"What a nice slap in the face for marriage equality. They say they dont care what anyone thinks....I think they look like whores, when's number 4 coming?","post_message":"In case you missed it:"},{"comment_id":"1786545848249097","commenter_b":"@username What's that? No one has been able to get him to say what that is. Oh I forgot, he's going to build a wall.","commenter_a":"Agree Obama put us in a real position with his foreign policy. Now all the people saying Hillary should be our next president she is just as bad or worst then Obama. We need Trump to get in office and try to clean up there messes !!!","post_message":"House Speaker Paul Ryan says \"Our enemies no longer fear us and too many of our allies no longer trust us,\" all because of President Obama's foreign policy. Do you agree or disagree?"},{"comment_id":"10153744728059087","commenter_b":"And, to all of the pissy whiney Clinton supporters who complain about how \"mean\" Bernie has been to Hillary by his pointing out true negative aspects of her record--if Clinton prevails, Trump will decimate her and Bernie will never look so good to them.","commenter_a":"I call...bullshit. Bernie","post_message":"\"I sense some great deal of momentum, I sense some great victories coming,\" Bernie Sanders said after his stunning upset victory in Indiana. \"I think we can pull off one of the great political upsets in the history of the United States and in fact become the nominee for the Democratic Party and once we secure that position, I have absolute confidence that we are gonna defeat Donald Trump in the general election.\""},{"comment_id":"10154883031433010","commenter_b":"Illegal Immigrants have been paying taxes for the longest time. Look it up. I suppose you don't want that money either.","commenter_a":"Those law makers assume that all Californians want this, many of us don't want lawless immigration, no matter what country they are from. We don't like that our laws aren't being enforced and our budget and resources for our state are being given away to non-Americans.","post_message":"California's fighting back."}]
