[{"comment_id":"496533153870598","commenter_b":"We will never submit to Islam! Go fuck another goat!","commenter_a":"How do you really know that @username...you have documentation to explain here to that right wingers are like muslims??? Haven't seen a right winger decapitate anyone yet...or did i miss one?? Are right wingers now involved in terror plots against America and are they sneeking into third world muslim countries and blowing people up?? Man!!! I must have missed all the headlines...sure glad you brought us up to page on this!!!","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"10153064930639135","commenter_b":"She should be returned to New Jersey. So should it's Governor.","commenter_a":"Why wait until the end of August? Drop out now and avoid two weeks of mental anguish. It's over for you, which is a good thing for America.","post_message":"President Obama and Secretary Kerry, now that we have an American flag flying in Cuba, I urge you to demand the immediate return of Joanne Chesimard to New Jersey.  Like so many others, the families of her victims continue to suffer under the Castro regime. Justice must be served."},{"comment_id":"1495672320492892","commenter_b":"Leave her there","commenter_a":"Why?? Why would you tarnish your gold!! The first black woman and you trash your chance to be a roll model and a proud American! Wtf is wrong with you! You just ruined your chance at becoming everything I wished for you! You Dumb bitch!!!","post_message":"I can't even anymore with this garbage..."},{"comment_id":"10152882725317807","commenter_b":"More trolling stupidity. Shuster, you are pitiful.","commenter_a":"Does this give you pause @username??????@webpagelink","post_message":"It’s tax day, but the American people certainly don’t need another reminder that the federal government is taking too much of their money.    In what ways do you believe government is over taxing you?"},{"comment_id":"10156102482195615","commenter_b":"State officials are supposed to be non-bias. If she can comply, she can find another occupation.","commenter_a":"You really don't have one KIM!!!!","post_message":"And here we finally have the truth, folks!"},{"comment_id":"10154292221654411","commenter_b":"Aka....draw and quarter Snyder.....lil bitch","commenter_a":"Cunts are a shame....get rid of them...","post_message":"The problem isn infrastructure but rather 'a hate crime and mass poisoning of Black and poor people,'  filmmaker Michael Moore."},{"comment_id":"10153112038031770","commenter_b":"We need TRUMP we need the wall 11 mil illegals today 25 mil tomorrow when will it stop !!!!! North Carolina here voting TRUMP 2016","commenter_a":"And just another reason NOT to have this trash in our country!!!","post_message":"The District of Columbia started issuing drivers licenses to illegal immigrants in 2014, and now some are complaining because the process takes longer than they would like."}]
