[{"comment_id":"10152804178333445","commenter_b":"I am too good for Reggie foo. Keep that shit.","commenter_a":"Ya dumbasses the shit from cali been growing by the mountains .and guess who growing that the mexicans .indica or sativa its the same shit. Stop acting like you are too good for Reggie. Spoiled ass dudes.","post_message":"Legal Marijuana Screwing the Mexican Cartels  @webpagelink"},{"comment_id":"893708487388873","commenter_b":"Barbara can't you see what this Idiot is doing to this country?","commenter_a":"I agree. It makes no difference to me if a Republican or Democrat occupies the White House. This HATRED for this PRESIDENT is appalling. In their HATRED they are destroying America! But they're too ignorant to realize it!!","post_message":"Too true.  Image by Occupy Democrats."},{"comment_id":"10155334759910329","commenter_b":"You won't be here to tear it down....This is America not Mexico...Tell your parents to get out and take you with them. And see where you end up.Won't be here in USA because you be able to climb the wall.","commenter_a":"No, you won't","post_message":"The photo was taken at a anti-Trump march on Saturday."},{"comment_id":"650239665120653","commenter_b":"Congress does the budget not the President. Stop passing the buck","commenter_a":"Close off shore corporate tax loop holes. Oh, would that be a conflict in interest? Legalize marijuana. Tax the church!","post_message":"A new Congressional Budget Office report shows that President Obama’s latest budget would leave us with a $486 billion budget deficit for 2015 alone and a deficit of over $7.2 trillion from 2016-2025. That’s just another reason why my first bill in the Senate requires Congress to do its job, get federal spending under control, and pass a balanced budget."},{"comment_id":"1077135272363972","commenter_b":"Stop the madness! Go home!!","commenter_a":"Ignorant people taking up the time of our officers who put their lives on the line everyday. Hope none of them have to call 911 one day.","post_message":"Hundreds of protesters marched through Buckhead, blocking part of Peachtree Road. Several people were arrested. @webpagelink"},{"comment_id":"10155266404471756","commenter_b":"I bet the indigenous Indians would love all of us to go home and leave their water alone !!!","commenter_a":"Bull! Obama and Clinton too!","post_message":"Protesters 'March to the Arch' to oppose Trump immigration order"},{"comment_id":"10153227250726336","commenter_b":"Why did your daughter just bought a 10.4 million apt. What are you paying her away.","commenter_a":"Taking in millions of $ in the name of charity and only 12% actually goes to poor/charity......The Clinton Foundation is the family business for these two and supports them and their friends and family. DISGRACEFUL! But people are so blind and uninformed when it comes to Hilary and Bill...","post_message":"Former President Bill Clinton said there's nothing \"sinister\" in trying to get wealthy people and countries to spend money in a way that helps the poor."}]
