[{"comment_id":"10155424694168812","commenter_b":"@username Mexico is important! Why do you have to be so damn nasty??","commenter_a":"I can not way for Mexico start not combating drug dealers and not helping stop immigrants from other countries to reach US, then you will see how important Mexico is as a neighbor.","post_message":"Canada's border has seen a surge in people crossing illegally from the U.S., with a 230% increase in people crossing into Quebec in January compared to a year ago. @webpagelink"},{"comment_id":"10153239404845329","commenter_b":"If a women wants to hate on men and bring them down, she is not a feminist no matter how much she claims to be. Feminists just want complete gender equality!","commenter_a":"I'm pretty sure that most men aren't like \"rape is so cool bruh, I'm going raping this weekend bruh, you coming?\" Stop lol And not all men get all \"EEEEEKKK\" about periods. Personally, I can listen to my female friends talk about it and not even get slightly sick.","post_message":"\"Imagine if men were as disgusted with rape as they are with periods.\""},{"comment_id":"10154242925578837","commenter_b":"The wall will cost billions and stop hundreds. Wao.","commenter_a":"A wall to stop terrorists, criminals and drugs from pouring into America, what a noble idea","post_message":"CONGRESS TO PAY FOR WALL - GOP leader Paul Ryan says congress will end up paying $12 billion to $15 billion for President Trump's border wall."},{"comment_id":"10153973402646350","commenter_b":"Damn her! So bloody uncooperative.","commenter_a":"Every fortnight I clean out the strainers, wipe under the rubber and run an empty dishwasher on hot with vinegar, bicarbonate and eucalyptus oil. Same for my washing machine.","post_message":"The answer is"},{"comment_id":"1447392598607688","commenter_b":"Style and Clinton DO NOT go together; she dresses worse than a bag lady.","commenter_a":"Oh Lordy, how gross!","post_message":"Hillary Clinton? You mean THAT Hillary Clinton?"},{"comment_id":"588513781327245","commenter_b":"Trump is not pro amnesty, he's a negotiator and looking at the best way to deal with families who have lived here for 10 or more years. Even if he does half of what he said he'd do it will be HUGE!! Id be happy with getting rid of illegal criminals, upholding the laws we have and securing the border and building the wall! That is HUGE!! Trump 2016!!","commenter_a":"I @username will not be voting for you Mr. @username because you are starting to sound like a main stream republican when it comes to ILLEGAL IMMIGRATION . I was with you from the beginning but not now. NO AMNESTY !!!","post_message":"The Clinton's are the real predators..."},{"comment_id":"913202388702552","commenter_b":"For women, there's always danger no matter how much you use your head.","commenter_a":"No danger if you use your head. Crime is down in most of the civilized world. The news cycle is just longer.","post_message":"\"Are you alone?\""}]
