[{"comment_id":"1018949481459396","commenter_b":"Bitch","commenter_a":"So men are the most evolved. We do it since birth. Maybe that's why women never let us forget shit because they're living in the past.","post_message":"And that's why men have nipples!  Via Curiosity."},{"comment_id":"654971807960745","commenter_b":"Fake fugly whore.","commenter_a":"can she get her face redone?","post_message":"This woman wears a corset for 23 hours a day. She has also had 4 breast enhancements, a gastric bypass, and two nose jobs. She says she finally has the most perfect body in the world.   Do you think she has a perfect body?"},{"comment_id":"10153834511188721","commenter_b":"Suck on these nuts","commenter_a":"@username Beetje bullshit dat \"size of the earth\" Nog steeds wel zieke shit, though!","post_message":"Space, folks. (via Mic)"},{"comment_id":"934918126557241","commenter_b":"Why dont you vote for Hillary then? She cant say two words without lying her ass off. But I bet everyone who commented will be there to vote for her. Thats why Donald is SELF FUNDED. Doesnt take money from soros or rockefeller. Thats why the media hates him and all of you do as well. Obama has already said that muslim refugees will go in a database. But when Trump says it hes a racist bigot. Obama used different \"words\" and its totally different . When really its not. Its the same and Im not argueing . I hope you will all be happy when your next LIAR is elected. Thats why grandkids wont enjoy America as you did. Thanks dickheads.","commenter_a":"The dude tells the truth. Regardless noone else has rhe balls to speak the truth anymore","post_message":"The call took place right around the time Donald Trump announced his intention to bar Muslims immigrants from entering the U.S."},{"comment_id":"10153475591131051","commenter_b":"What a real sick bitch needs to go down for good she dont need her other kids go down bitch","commenter_a":"Prayers for that baby girl","post_message":"When residents here stumbled across an alcoholic mother trying to eat her own daughter alive, they decided to handle the situation personally."},{"comment_id":"1710894845846679","commenter_b":"somebody please...slap this bitch!!!","commenter_a":"This is interesting as the Black and Hispanic communities are some of the most \"Biblically religious\" communities in this country!","post_message":"Say what?"},{"comment_id":"1664084467202646","commenter_b":"Then I would campaign for congressional term limits Allow the country to decide if abortion is to be legal or not. The same with gay marriages. The supreme court should not be involved in these maters. If the is challenged and reversed. So be it. I would not allow mass illegal immigration. Illegal is wrong by definition. As to radical Muslims. Not welcomed. Peaceful Muslims who migrate legally are welcomed as long as they assimilate . And do not try to impose sharia law. This country has its laws made by its citizens. If you come here. You need to assimulate. I would ask for voter IDs. Driver license are not proof citizenship. Sorry.","commenter_a":"I would dump Obama care and replace it with something that makes sense. Eliminate the following depts. Education, environment and agriculture. TSA homeland security plus the irs. Treasury dept can handle collecting a flat tax. Eliminate the federal minimum wage. No need for the federal govt to be involved in these areas. Then I would walk away from the Iran nuke deal and global warming. Bad policies. Then I would invite the Mexican president to the white house and bitch slap him. Cut the budget across the board by 10% for each of the 1st 4 years Have a flat federal tax of 17.5 on everyone. Period. No deductions. Nothing. Flat. Period. I would then review all of BHS executive orders and reverse or modify what I decide what is needed.","post_message":"If you were president what is the first problem you would address?"}]
