[{"comment_id":"1359242680802143","commenter_b":"Nope. Her boobs would be bigger.","commenter_a":"She looks amazing, but that belly looks like it's growing a baby","post_message":"Is Jennifer Aniston pregnant at 47?"},{"comment_id":"10155037130139369","commenter_b":"Sucker","commenter_a":"I'm 51 now and have paid into social security since my first job at 15 years old. I want MY money! Let them try and take our money. They'll have a revolution on their hands!","post_message":"That's $32,000,000,000,000."},{"comment_id":"10155759756435354","commenter_b":"Such a witch. Don't want people saying these things then start arresting and deporting the mexican criminals and all other illegals because they are criminals just by being here.","commenter_a":"How about giving guns to jihadist to fight Syrian Prez. YOU, Clinton, armed ISIS.","post_message":"WATCH Hillary's Race-Baiting Remarks Slamming Donald Trump"},{"comment_id":"10156205584795354","commenter_b":"Right, blacks and immigrants are the problem. It was a white kid who went into a black church and shot and killed 9 blacks while they worshiped. It was a white kid who went into the Sandy Hook Elementary School and shot and killed 20 children while they were trying to learn. He also shot and killed 6 educators who were trying to teach the days lessons. It was a white man who went into a theatre in Lo. and killed people while they were watching a movie for enjoyment. It was a white man who went into the theatre in Co. and shot and killed people who were out for a night of entertainment.","commenter_a":"If people like her wouldn't say dumb shit like this, then most of the \"white people\" wouldn't be racist towards blacks. They just keep it going instead of trying to get to the problem, causing more anger and violence from within everyone.","post_message":"“Right now we declare, it’s open season on a motherf–king cracker. All you motherf–king crackers y’all need to watch your motherf–king heads.”"},{"comment_id":"1013896902039895","commenter_b":"News flash, illegals don't have state ID's or driver's licenses therefore they couldn't be auto registered to vote. Another case of a republican who pretends to be smart.","commenter_a":"So illegals can vote too? dirty liberals","post_message":"A victory for voting rights!"},{"comment_id":"10152691933545950","commenter_b":"You look like a crooked bitch","commenter_a":"Yeah and what they are going to do give him the death penalty.....dam sure won't let him walk like they do those crooked a** cops","post_message":"A suspect has been arrested in the shooting of two police officers in Ferguson, Mo."},{"comment_id":"10154094410781051","commenter_b":"Again, there are more good cops than bad cops.","commenter_a":"Media is the reason we don't see or hear of these Good Deeds....stopped watching the news & buying the paper...All liberal bias crap & I'm sick of it!!❤️👮🏻❤️","post_message":"When these police officers learned that a local teen was walking two hours to work each day, they immediately stepped up to the plate and helped him out. Do you think America needs to hear more stories like this?"}]
