[{"comment_id":"1139906406032404","commenter_b":"you are an idiot!! AND STOP KILLING ANIMALS!! They have souls too you creep!!","commenter_a":"Ok. So release the previous 5 years. That will provide an accurate picture of what to expect when the audited returns are ready for release.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"10154738132201037","commenter_b":"everything she does is fake.","commenter_a":"Sounds fake to me. She'll have to sue me to I guess.","post_message":"The suit alleges Kim Kardashian West was victimized a second time when the website reported that she faked the robbery and lied about the assault."},{"comment_id":"10154729609496729","commenter_b":"Unfit evil lying grandma killery","commenter_a":"She only said it because she wanted to diffuse Trumps statement. Too late to get on that band wagon. Meanwhile American lives are lost due to stupidity.","post_message":"Whoa. About damn time."},{"comment_id":"846989298730657","commenter_b":"I thin Aaran Afalava needs to do some homework about the way marriage has been done in the past.","commenter_a":"Why is this so special? My parents were together for 57 years...... If lesbians and gays want to be treated like everyone else why do they (and you) feel that everything they do is a milestone, or 'historic' or ...something! If they want to be treated like everyone else then they need to quit acting like they are something special.","post_message":"'People seem to understand our relationship with no difficulty at all. They seem to know what we want them to know, which is that we are a loving couple, living a normal, happy life, just as we hope they are.'  - Lennie Gerber and Pearl Berlin"},{"comment_id":"517056128505278","commenter_b":"'@username I'm pretty sure much of what you typed is not true.","commenter_a":"Hillary should be forced to work as the next ambassador to Libya. She can hire the Mexican drug cartels as her security since Obama armed them better than he did our embassy in Benghazi.","post_message":"Eric Trump criticized Hillary Clinton's foreign policy and said it should be a requirement for Americans to watch '13 Hours: The Secret Soldiers of Benghazi' before voting for president."},{"comment_id":"10153409431986336","commenter_b":"Give it a rest ! Donald Trump has every right to his opinion. I agree that this country has had an influx of illegals for years. Be informed and know that Mexico and Guatemala have cut a deal to send thousands more to cross our borders illegally. The monies they send back to Mexico and Guatemala is $120 Billion dollars. This president wants to give them a free pass plus $35 thousand tax refunds? So they cross illegally, burden our health centers, schools, and oh only so you get my disgust! All I used to hear at the hospital is people telling other relatives of theirs to 'Come to the U.S., because this country is so stupid. They give you money for living, food stamps and oh if you have your babies in the U.S. , then they are citizens and you can stay'... So these so called nice people ...","commenter_a":"Its a PR move. All they really care about are the $$$$$$ NBC and MSNBC are financially hurting. Low ratings low viewership.","post_message":"Breaking News: NBC is ending its business relationship with Donald J. Trump due to his 'recent derogatory statements' regarding immigrants.   DETAILS: @webpagelink"},{"comment_id":"10153329997574342","commenter_b":"Thanks, Becky.","commenter_a":"Great picture Reed","post_message":"What a fantastic photo sent in by Reed W.  It's a shot of the sun coming up over the HPD Memorial.  Reed posted it to honor HCSO Deputy #DarrenGoforth.  @webpagelink"}]
