[{"comment_id":"10155083896191178","commenter_b":"He might bring racist charges up against you","commenter_a":"OK I'm going to say it Everyone is racist OK we get it wahh wahh wahh!","post_message":"The histrionic grumblings for the liberal parodies over at MSNBC are STILL outraged over Sen. Sessions.  Liberals never seem to realize that they've worn out the racism accusation."},{"comment_id":"10153743354289614","commenter_b":"He doesn't like illegals","commenter_a":"You know TRUMP is mad!","post_message":"BREAKING: Mexico has defeated the U.S., 3-2, in the CONCACAF Cup match at Rose Bowl Stadium in Pasadena."},{"comment_id":"10156282327890294","commenter_b":"screw u u hateful witch\\\\","commenter_a":"Society isn't the problem. Men dressing like women and visa versa is the problem. Also, walking in to traffic is a problem. Don't walk in to traffic. Don't blame other people for your actions.","post_message":"“From a very young age I was told that people like me are freaks and abominations, that we are sick in the head and society hates us. This made me hate who I was, \" she said in the post.    She asked others to share her story and said, \"Please help fix society;\" then she did something heartbreaking:"},{"comment_id":"10154215455576770","commenter_b":"Lock her up","commenter_a":"As a retired military wife she Makes me sick!!! Like she ever cared about America!! She cares only for herself and if you support her I feel sorry for you!!!","post_message":"Hillary Clinton responded within minutes."},{"comment_id":"10153666146819099","commenter_b":"Shut up you dumb broad","commenter_a":"Get guns off the street. It's time for stricter gun laws.","post_message":"A 30-year-old wanted criminal with 12 prior incarcerations allegedly shot a 33-year-old NYPD officer in the head in East Harlem, authorities say  ----> @webpagelink"},{"comment_id":"1135270439841709","commenter_b":"George is just another Clinton Whore!!!!","commenter_a":"clinton news network at it again","post_message":"Donald Trump destroys the liberal media! (WATCH)"},{"comment_id":"679207482232542","commenter_b":"Criminal woman Brave !!","commenter_a":"Hillary is so brave for being a woman!","post_message":""}]
