[{"comment_id":"10153175852531990","commenter_b":"That ain't no woman either !","commenter_a":"400 lbs with a beard.....that ain't no woman!","post_message":"BEARDED WOMAN: So this happened. @webpagelink"},{"comment_id":"905233582940760","commenter_b":"So they can rape your children","commenter_a":"No way","post_message":"Obama Admin Proposes Plan for Americans to \"Adopt\" and \"Sponsor\" Muslim Immigration into the US @webpagelink"},{"comment_id":"10153726432609087","commenter_b":"I'll buy her plane ticket","commenter_a":"Bye","post_message":"“I know a lot of people have been threatening to do this, but I really will,” Lena Dunham said about moving to Canada if Donald Trump is elected president."},{"comment_id":"10153948150211680","commenter_b":"Someone has butt hurt, I'll keep licking my windows while you keep hoping for your 72 virgins.","commenter_a":"Is Trump seriously just now realizing his supporters are a bunch of window-licking water heads? Donald, you are talking to the craziest people in the country. You could literally take off your shoe mid-speech, hold it up to your ear, say you’re getting a call from Batman and they would be quiet until you hung up your shoe.","post_message":"Donald J. Trump: \"Premiums are going to go up at 116%...Unless I get elected, in which case, you won't have to worry about it.\""},{"comment_id":"1354573844595375","commenter_b":"wELL LET THEM TERRORIZE THEM AND THIER FAMILIES AND LET'S SEE HOW QUICK SHE REPEATS THIS ASSINIGNE REMARK","commenter_a":"Send these twits over there to give them love and hugs.","post_message":"Oh brother!"},{"comment_id":"10154303024133132","commenter_b":"Shut up, Maggie.","commenter_a":"It's not nice to be wearing such nice clothes to cuba when those people have nothing! They looked scaredto be their in my opinion.","post_message":"Sasha and Malia Obama delivering a healthy dose of style inspiration while in Cuba! (via PeopleStyle)"},{"comment_id":"10153168898035950","commenter_b":"Says the jaded soul. We still love you.","commenter_a":"He really thinks his opinion really matters. I hope and pray to God he loses really bad so he can get off his arrogance. He is a very insecure man. You can see how he talks and communicates his body language very insecure man. His life is a big lie and is willing to say what it takes to take the country down. Amazing some coat see right through him. Must not be very bright people.","post_message":"The secret to real estate mogul Donald Trump's popularity in this election season has eluded pundits, pollsters, the Republican establishment, and really, everyone else. \"Honestly it's my looks,\" Trump said before a rally in Atlanta on Saturday. \"I'm very handsome. That's the only thing I can think of right now\""}]
