[{"comment_id":"1271419419547512","commenter_b":"Lil bitch","commenter_a":"12 jurors acquitted these guys based on the lack of evidence. This had nothing to do with white privilege, they were locked up in solitary confinement while rioters get away with burning down towns.","post_message":"Heavily armed ranchers forcefully occupied a federal building in Oregon, but they got acquitted because white privilege is real."},{"comment_id":"10152604672427894","commenter_b":"I bet the beautiful lupita will be married before her silly ass will ever be...hell Walter didn't want her .","commenter_a":"Kenya need to stfu with her stupid ass","post_message":"Kenya Moore Shades Lupita Nyong'o Over Golden Globes Photo Snub: 'Girl Bye'"},{"comment_id":"900665266646768","commenter_b":"abortions have been going on before obama ever took office","commenter_a":"Abortion is indeed murder, and he is the ring leader behind it all.","post_message":"Eight years with a pro-abortion radical is eight too many. No more pro-aborts in the White House!"},{"comment_id":"974467552593717","commenter_b":"Fuck this cunt","commenter_a":"Love you Barbara...","post_message":"Senator Barbara Boxer, in 20 minutes, gave the BEST smackdown to the GOP I have ever seen -- calls them a \"national disgrace,\" and tells them to end their \"hostage\" taking of the DHS because of their \"hatred for the president.\""},{"comment_id":"10153085724024228","commenter_b":"let her leave, she's the one who will suffer","commenter_a":"Let's not forget child-support from Miss congeniality.","post_message":"After holding baby Leo's hand for the first time, his dad fell in love."},{"comment_id":"1800084686916109","commenter_b":"Since 1952 Muslims are here ILLEGALLY. They need to get the hell out.","commenter_a":"Dear Democrats and Liberals, I'm noticing that a lot of you aren't graciously accepting the fact that your candidate lost. In fact you seem to be posting even more hateful things about those of us who voted for Trump. Some of you are apparently \"triggered\". Because you are posting how \"sick\" you feel about the results. How did this happen you ask. You created \"us\" when you attacked our freedom of speech. You created \"us\" when you attacked our right to bear arms. You created \"us\" when you attacked our Christian beliefs. You created \"us\" when you constantly referred to us as racists. You created \"us\" when you constantly called us xenophobic. You created \"us\" when you told us to get on board or get out of the way. You created \"us\" when you forced us to buy health care and then financially penalized us for not participating. You created ...","post_message":"President-elect Donald J. Trump​, Melania Trump, Speaker Paul Ryan​ and VP-elect Mike Pence​ meet at Capitol Hill."},{"comment_id":"624793527653829","commenter_b":"I thought the window sign was funny too.","commenter_a":"Julie! lol","post_message":"If you are a Starbucks customer, you might be a racist... apparently."}]
