[{"comment_id":"500328103497004","commenter_b":"'@username your mom is another uninformed voter. Now I'm voting for Trump just so you and your mom get hassled by immigration.","commenter_a":"Let me get this straight. Trump can beat Hillary, but he can't beat Bernie? So by voting for Hillary...you're basically voting for Trump?","post_message":"Is Bernie Sanders harming Hillary Clinton's chances against Donald J. Trump? Here's what he has to say about it. via Today Show"},{"comment_id":"10153669770570950","commenter_b":"My thought exactly. If you see the pictures and videos, there are lounge chairs and tables just feet away from the water. People can read the 'no swimming' sign, but an alligator is not going to think twice about coming on land. I think Disney needs to close off areas where there are gators. I lived in Tampa for four years, and gators were everywhere near water. You just knew where they were, and if you didn't, there were signs. I doubt people did not know about the alligators; you can always spot them especially if there are more than three. This could have been prevented.","commenter_a":"Why were alligators allowed to be so close to where human activity is? Especially DISNEY WORLD where 1000's of children are on a daily basis??","post_message":"Officials are pulling alligators from the nearby lagoon and putting them down to check for the boy's body; so far, they haven't found him."},{"comment_id":"1016519435107777","commenter_b":"Yes, and the idea that we should force women to wear a veil in the USA makes me physically ill. Women are NOT 3rd class citizens, which is what they are in strict Muslim households!","commenter_a":"There are many women who are voting republican because they are against abortions and they do not believe PP is anything other than there to do abortions. At age 72 I am with Stevie. I think we worked too hard to go backwards. I remember when I was first married there were states where it was against the law for a woman to use any form of birth control other than abstinence. If abortion is outlawed, how long before birth control will be outlawed.","post_message":"TRUTH."},{"comment_id":"10153184918416336","commenter_b":"never believe this man promise. that's look errr. that's look that can behead you, rape your children and take your wives.","commenter_a":"The face of evil.","post_message":"Abdul Rahman Shalabi, who allegedly served as a bodyguard for Usama bin Laden, went before a parole board to ask for his release so he can marry and have a family."},{"comment_id":"741809245917684","commenter_b":"THOSE 3 BITCHES...ARE GETTING THE SHIT GANG BANGED OUT OF THEM NOW.","commenter_a":"IS is recruiting sluts for sex only son","post_message":"Aqsa Mahmood, 20, left her home in Glasgow in 2013, and married an IS militant in Syria."},{"comment_id":"10152632992600927","commenter_b":"When has she even known what is going on? The woman is AWOL in the brain department.","commenter_a":"Iranians are our enemies you idiota","post_message":"She's backing Obama's Iran response.  What do you think?"},{"comment_id":"550201625175196","commenter_b":"Totally agree","commenter_a":"Lisa you need these!","post_message":"Laboratory beaker wine glasses 😍  From @webpagelink"}]
