[{"comment_id":"10156095135925389","commenter_b":"Donna I believe bush\"s were much better then the Muslim terrorist we have now!","commenter_a":"I do not want Bernie Sanders, Hillary, or Biden!!! Wake up America we need some one who will fix America!!!","post_message":"Question of the Day: Do you think Bernie Sanders can beat Hillary Clinton in Iowa and New Hampshire?"},{"comment_id":"10153033074808837","commenter_b":"To those with negative comments : May your offspring never have any genetic challanges. I'd hate to think of your lack of support to them","commenter_a":"You are a great dad, she must see you as her hero.","post_message":"HOW GREAT IS THIS? A father looking to support his 6-year-old daughter got a tattoo matching the same implant device that she received in her ear."},{"comment_id":"10153302488640329","commenter_b":"You obviously don't know what feminists sound like then.","commenter_a":"\"How dare you show women's breasts you pervert\" - Feminists \"How dare you censor women's breasts you oppressor\" - Feminists.","post_message":"Warning: NSFW due to lots of nipples. (via BuzzFeed News)"},{"comment_id":"1198460870230286","commenter_b":"Women have it Harder then men? Who has to work in construction for his whole life if he doesn't have an good education? men do. Who has can't just suck dick and flash their tits or be a stripper or be a prostitute to get easy money? Men can't. So listen here you ugly fucking single mother in practice bitch you should've been caught in the condom.","commenter_a":"Stop boner shaming! Girls get to flaunt their sexuality. They get to show off their nipples. Then guys have to hide boners. You know how uncomfortable it is to flip a boner into your waist band Only some people breast feed. None of you would be here without a boner FREE THE BONER","post_message":"You! #WSHH"},{"comment_id":"1338951096148716","commenter_b":"Anthony - Huh? Who proposed that? If you're not a citizen, you don't get to vote. If undocumented get amnesty (which can only be done by Congress), that doesn't necessarily make them a citizen. If we decide (via legislation) they should have a path to citizenship, then citizens get to vote. Your comment makes no sense, and is a total strawman.","commenter_a":"If you can't win on the merits of your policy ideas, change the system. The GOP should be ashamed.","post_message":"Republicans are pushing, in Virginia and elsewhere, to make it harder for Democrats to win the Electoral College."},{"comment_id":"10153163380586336","commenter_b":"ANIMAL! wait is that Obama's son??","commenter_a":"Hang em on national TV.","post_message":"UPDATE: A third man has been charged with sexually assaulting a woman during spring break in Panama City Beach, Florida, that was captured on cellphone video, authorities said."},{"comment_id":"10153344764512235","commenter_b":"When racists attack children and/or make them cry, it makes me positively homicidal. I have HAD it with these people. What have they done for American society? Hell, what have they done for our SPECIES? Name ONE thing, America.","commenter_a":"The nurse needs to be fired!","post_message":"Wow. Just wow."}]
