[{"comment_id":"10153069537647293","commenter_b":"lol holly you do realize \"lust\" existed before the legalization, right? plenty of both gay and straight couples letting lust \"win\" on a regular basis. the legalization of same-sex marriage allows same-sex couples in LOVE to get married. so yes, love wins.","commenter_a":"Give it up haters. Love won. You lost.","post_message":"\"This is no time for fear or outrage or politicizing. We see that we are strangers and exiles in American culture.\""},{"comment_id":"10155070129079445","commenter_b":"Massachusettes as a state is no kill. They'd only euthanize if the dog was extremely sick or aggressive.","commenter_a":"I dunno with all these people saying take the dog to a shelter... Shelters euthanize dogs... I'd be afraid to leave one there. Maybe they thought this would be better it certainly got media attention.","post_message":"The pooch was found on the side of the road... but had food, clothing and blankets with him. @webpagelink"},{"comment_id":"10153484638827507","commenter_b":"Whining lil Bitch!","commenter_a":"Activist farmers? REALLY?! They got time for that shit?! I have a better idea, STOP suckling from the federal ethanol teat, get back to your damned fields, and grow the crops that feed the people!!!! I hope that you make a fortune, the HONEST way, and keep your damned MORONIC racial political opinions to yourself!","post_message":"This is important."},{"comment_id":"988396247881207","commenter_b":"She should have walked with a pig","commenter_a":"So stupid.","post_message":"Woman Hitchhiked Through The Middle East To Prove Muslims Are Peaceful. What They Did Next..."},{"comment_id":"989796557698481","commenter_b":"Women aren't human beings?","commenter_a":"women will die?????? really???? this is incredible... what about how many BABIES HUMAN BEINGS will die???????????","post_message":"Breaking ranks"},{"comment_id":"10153252005637235","commenter_b":"Stupid girls","commenter_a":"Racist comments aside their flow is terrible.","post_message":"The girls insist they are not racists or bigots."},{"comment_id":"1333958173358453","commenter_b":"@username you racist prick","commenter_a":"#FakeNews THIS is what it really looked like.","post_message":"An estimated 700,000-900,000 people attended President Donald J. Trump's inauguration today, about half the number of people who attended Barack Obama's eight years ago. @webpagelink"}]
