[{"comment_id":"10153992733094726","commenter_b":"Beautiful, smart elegant lady","commenter_a":"Let Ivanka rest for a while . she will have a new Baby soon .","post_message":"Trump's wife Melania steps into the spotlight, joining his daughter Ivanka"},{"comment_id":"10154151058422756","commenter_b":"To see how idiots can find an angle to go against clean energy. Wind turbines kill birds? A far less amount then any oil spill I have seen. Or pipeline that explodes. We could do this all day but this country is long past the need to go clean energy. I hope you idiots are paid to post all these ridiculous comments.","commenter_a":"Wind and solar don't make any sense, you have to cut down large areas of forest's to put up windmills on mountain tops to construct them, and they end up killing many birds. Same goes for solar, you would have to blanket the continental US with solar panels to replace fossil fuels. It's got nothing to do with \"evil big business\", wind and solar will just never be as efficient and reliable as coal, oil, and natural gas.","post_message":"A natural gas plant in Lycoming County is now complete, and it provides energy to nearly 1 million families in our area and other parts of the northeast."},{"comment_id":"1289659341093811","commenter_b":"So someone stole a car that means they deserved to get raped? Sickening","commenter_a":"But you stole and you went to prison, perhaps you shouldn't steal so that you can practice your transgender in your house","post_message":"Horrifying.  (via Daily Mail Australia)"},{"comment_id":"1726142824304062","commenter_b":"These are \"outrageous\"? Come on! Blacks, African-American, People of Color, or whatever is the nonoffensive way they are referred to these days, often get a pass for calling each other the \"N-word\". What the hell is going on here! Odd double standard. Remember \"Colored People\", bad!!!, \"People of Color\", GOOD!!! Wow, what crap!!!","commenter_a":"She thought she had a friend","post_message":"Fox News chief allegedly referred to Stacey Dash as ‘the black girl’, called another anchor an \"angry black woman\"  Grio fam, are you surprised by any of this? Check out the other outrageous things coming out in this new lawsuit!"},{"comment_id":"1091990537522616","commenter_b":"Fat lady has not even cleared her throat yet.","commenter_a":"Jesus Bernie. You've given up. You're turning into what you've said you despise. All of us fought for you, not so you could buckle up like a belt and endorse Hillary. I refuse to vote for Hillary. You are letting us all down, all because of a back-room conversation where Barack likely asked you to \"fall in line\". I'm concerned, but still very hopeful that you get up on that stage at the DNC, and demand that your followers vote 3rd party!!!!!","post_message":"I want to express my pride in what we have accomplished together over the last year. But so much more must be done to make our vision a reality. Now more than ever our country needs our movement — our political revolution. As you have throughout this historic campaign, I ask for your ongoing support as we continue through the fall and beyond."},{"comment_id":"10153414168399024","commenter_b":"it's a big city...Houston may have enough fag votes for that bitch, but Texas does not! The voters of Houston will wake up and dump the fag...","commenter_a":"My question is, how did a liberal get elected in....Texas.","post_message":"Of course, Annise Parker doesn't care what the voters think. Typical liberal. @webpagelink #tcot #ccot"},{"comment_id":"1394356603915019","commenter_b":"Odds Hillary Won Without Widespread Fraud: 1 in 77 Billion Says Berkeley, Stanford Studies After applying various statistical models to subsets of 2016 primary voting data several academic researchers conclude Hillary Clinton win was only possible through widespread vote fraud.","commenter_a":"#HillaryDNCRiggingCrooks","post_message":"It turns out that Bernie Sanders may not fight all the way to Philadelphia after all."}]
