[{"comment_id":"787208168094254","commenter_b":"That woman's a little unhinged!","commenter_a":"You are a has been. Good luck in finding work. You might need President Trumps help in finding a job.","post_message":"Classy!"},{"comment_id":"1801914530074898","commenter_b":"Deport all illigals","commenter_a":"Deport all illigals","post_message":"WATCH LIVE: Donald J. Trump speaks at campaign event - will he address the multiple allegations of sexual assault?"},{"comment_id":"10154840580075695","commenter_b":"Go Hillary!!!!!! Vote blue!!!!!!","commenter_a":"#voteblue","post_message":"People fainting, 3-5 hour waits in line and it's only day 1 of voting. Local elections officials say today was the biggest turnout they have ever seen for early voting in an election. @webpagelink"},{"comment_id":"895490467164248","commenter_b":"Married women have abortions too !","commenter_a":"Pro choice is about a woman's right to screw like a whore without any consequences. That's the reason Obama wants it for his kids.","post_message":"Do you agree?"},{"comment_id":"10153035783794877","commenter_b":"hes right yall hoes more worried about her hair then her policies..","commenter_a":"Pretty amazing the priorities of the majority of blacks. Grio post an article about a federal investigation on police, and folks talking about how the Mayor hair and lips... Then we wonder why black folks are look down on.","post_message":"The Baltimore Police Department probably isn't happy with what Mayor Stephanie Rawlings-Blake just asked for. Get the scoop below.  Grio fam, was this the right move? Will it pan out? Sound off..."},{"comment_id":"10152564458982623","commenter_b":"Pure trash . Should have ran over her .","commenter_a":"Idiot.","post_message":"It's the video everyone is talking about.  The woman recorded in a terrifying road rage incident in Randleman has been charged."},{"comment_id":"571151523088148","commenter_b":"Woopi is possessed. She can't help it.","commenter_a":"This is the woman who tried to lower the RAPE benchmark by stating in defense of an acused rapist that it wasnt \" RAPE rape.\" I heard her with my own ears.","post_message":"Did Whoopi just blame women for having affairs with Bill Clinton?  Watch the clip."}]
