[{"comment_id":"10155360412381509","commenter_b":"She's a nasty looking monkwy","commenter_a":"Michelle Obama is the most elegant, intelligent and intellectual First Lady's ever to grace the White House. This family will be missed!! God bless them!","post_message":"Over the past eight years, former President George W. Bush and First Lady Michelle Obama have been seen becoming increasingly chummy."},{"comment_id":"10150690692729999","commenter_b":"Maybe this can cut back on oil use?","commenter_a":"They should never have entertained the idea of the pipeline in the first place. Sending that dirty oil through our country was a really bad idea.","post_message":"Barack Obama has rejected the request to build the Keystone XL pipeline, saying it \"would not make a meaningful longterm contribution to our economy.\""},{"comment_id":"1118654024897515","commenter_b":"Chemo is poison!","commenter_a":"Nicole, how insensitive can you get? Chemo? with all of the cancer survivors and sufferers fighting their disease with GOOD lifesaving chemo? Hope you never need CHEMO. Trump is not CHEMO. He IS POISON.","post_message":"“The Trump supporters see Trump as political chemo. He may be toxic. He may kill every healthy cell in the bloodstream. But he is the only cure for the cancer that is Washington establishment.” - Nicolle Wallace"},{"comment_id":"10153866253733984","commenter_b":"Neurotic sad women","commenter_a":"Go TRUMP","post_message":"This is exactly what makes Donald J. Trump such a polarizing figure. Some people love him for this sort of thing, and some people hate him for it. Are you one of the ones that likes him?"},{"comment_id":"10153703275114384","commenter_b":"Whine, whine, whine. All the illegals will vote for hand outs, what more do you corrupt fools need? Lying POS!","commenter_a":"BLUE ALL THE WAY!!!","post_message":"It is inexcusable for Republicans to have left town without acting to restore the Voting Rights Act. Click LIKE if you agree: Nothing should stand between American citizens and their most sacred right to vote."},{"comment_id":"859144567515130","commenter_b":"I did walk in the shoes of a LEGAL immigrant. We get that money gets you here either way legal or illegal. But when you lack respect for laws you come here illegally when you respect them you come here legally. Trust me I get the escaping from violence and your family is in danger side of it. There are avenues if that is the case in these days for emergency immigration if you fit the criteria.","commenter_a":"Si se puede! We are all immigrants and thats what makes up the USA !","post_message":"\"We love this country. We want to belong. We want to come right with the law...we don't like living in fear. We want to be out of the shadows.\" -Gaby Pacheco, DREAMer"},{"comment_id":"864868203550521","commenter_b":"ROFLOL!!!","commenter_a":"I see a white guy in a gold shirt.","post_message":"Photo: 20-year-old Jeffrey Williams, suspect charged in shooting of two police officers in Ferguson, Mo. @webpagelink"}]
