[{"comment_id":"10157388184590603","commenter_b":"That wall doesn't work. Many people coming in illegally from Mexico are actually from Cental America.","commenter_a":"I think it will help open discussion about illegal entry into the US. Mexico has a huge wall on its border with Guatemala for the same reason.","post_message":"Do you think think this trip will help or hurt Donald J. Trump?"},{"comment_id":"10155405289876729","commenter_b":"@username I can respect that and pretty much agree.","commenter_a":"Anyone that takes the time to read this case will side with Ventura. Kyle bandwagon jumpers will say Chris Kyle was incapable of any wrong like Jesus. He made a mistake and his insurance was there for this very reason. In short, Chris Kyle should of never made up that story in the first place. I am disappointed with you @username.","post_message":"Finally."},{"comment_id":"1661303277474551","commenter_b":"Municipalities the masses? Did you maybe mean manipulates? Lol","commenter_a":"The more bias tords trump just show how mutch media manipulates the masses and is shooting themselves in the foot","post_message":"\"On Feb. 9, we trust New Hampshire Republicans will send 'Biff Trump' back to somewhere — anywhere but on the road to the most important elective office in the United States at a most crucial time for this nation.\""},{"comment_id":"10155541308376002","commenter_b":"@username or we could use the same money they giving all folks coming here to do the same thing . Plus we want the wall and not these folks that want to blow us up .","commenter_a":"He has an issue with executive pen on immigration but no issue when Obama was doing it? Also this executive order is for 60-120 days same thing Obama did. Obama before he left slowed down Cubans to come in, President Carter sent Iranian students back during the hostage crisis. Hell my own grandparents in the 1900s came over and we're sent back to Italy. Rather fix the VA first then global problems second. Immigration isn't a right, my taxpayer dollars doesn't want to go to a bunch of illegals","post_message":"Senate Minority Leader Chuck Schumer is holding a press conference to demand the reversal of President Donald Trump's immigration ban.   You can watch the press conference live here:"},{"comment_id":"10153546316384714","commenter_b":"Piss off Clinton and go smack your ugly wife.","commenter_a":"You can take the black out the ghetto, but you can't take the ghetto out the black.","post_message":"Johnson was dismissed just hours after a video of him punching a woman was released"},{"comment_id":"1178173242225154","commenter_b":"That's what whores do","commenter_a":"She shoulda put sum lil shorts on underneath that dress if she gonna be doin all that twistin round..she knew damn well that shit is more like a shirt than anything on her.","post_message":"Big booty problems."},{"comment_id":"620966654718777","commenter_b":"She is the most horrible stupid idiot that has ever lived. Look at all the destruction she has caused even after her death.","commenter_a":"Neither did Karl Marx.","post_message":"Two attempts -- one small, one large; one entirely private, one government-backed -- have both come to the same conclusion: Ayn Rand didn't understand squat about real-world capitalism."}]
