[{"comment_id":"967920213241731","commenter_b":"Stay out of Florida's business.","commenter_a":"Yes","post_message":"A bill to require a 24-hour waiting period for abortions passed the Florida Legislature and is now heading to Gov. Rick Scott's desk. Do you think he should sign it?"},{"comment_id":"812675022209688","commenter_b":"@username, she should have been in jail a long time ago!!","commenter_a":"We need Trump 100%. Clinton is going to do nothing new for the @username people","post_message":"She disagreed with Donald Trump's proposal."},{"comment_id":"418033801654548","commenter_b":"The woman deserves to burn in hell for eternity.","commenter_a":"Zeeeeerooooooooooooooooooo!","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"},{"comment_id":"10158040412050206","commenter_b":"I was thinking that too. Where is the Air Marshal?","commenter_a":"Good on the pilot.... but where the hell are some of the passengers to help??? Seriously....bunch of cowards.","post_message":"This 25-year-old passenger was restrained by a pilot after pushing and threatening a flight attendant on an American Airlines flight into Charlotte, North Carolina. @webpagelink"},{"comment_id":"427873120742228","commenter_b":"hiliary could disapear forever and I reilly do not think she would be missed.Bill would be happy .The country would be a lot safer .Not to mention all those people who overheard something her loud mouth said would not have to die.A lot of people have died in her wake.EVIL EVIL EVIL WOMAN if thats what you want to call her.","commenter_a":"F#!#hillary","post_message":"Donald J. Trump has demanded Hillary Clinton apologize for making claims about him and ISIS propaganda that turned out to be false. Hillary's campaign just responded without holding anything back... Do you support Trump over Hillary?"},{"comment_id":"10153814359479411","commenter_b":"@username I don't have sex with animals unlike yourself.","commenter_a":"A monkey is still a monkey, even if you put a suite on it.","post_message":"Coming soon on RT Documentary - Congo's kings of style."},{"comment_id":"10153866507862144","commenter_b":"So this is just one more example of her poor judgment. It seems like every single chance she gets, she uses poor judgment. How can people want someone who CONSTANTLY displays terrible judgment to be president?!","commenter_a":"She admitted she was careless. Careless is not a crime. She's not stupid and would never send material that would endanger national security. And she won't be using a private server as President, that's for sure!","post_message":"FINALLY."}]
