[{"comment_id":"10154266056696051","commenter_b":"She looks dreadful!!!","commenter_a":"the VALUES are no 'right' unless they are YOUR values?? I don't think so...........the American people have spoke. Donald Trump Is Our President","post_message":"Hillary Clinton made her first major appearance since losing the presidential election last Tuesday. Do you agree with what she's saying?"},{"comment_id":"1263042020429217","commenter_b":"She started the whole thing ...she spit on him and was calling him a n***** ...she even lied and said she didn't even hit him or anything and begged for the video to not be shown.she is also suing the restaurant and this is not the first time she assaulted someone and lied about it .she is scum and a money hungry bitch","commenter_a":"Everybody saying she deserved it, just hope your daughters don't instigate something and get her ass beat.","post_message":"Totally uncalled for!  #WSHH #Oklahoma #JoeMixon"},{"comment_id":"832641430106532","commenter_b":"My first thoughts also.. Selfish woman!","commenter_a":"Selfish woman","post_message":"'...why my wife hid that letter is beyond me.'"},{"comment_id":"10153129775024877","commenter_b":"yeah big black women are ugly","commenter_a":"why they didn't get a plus size white girl in there too ??","post_message":"Target is using 'real' models in its new summer swimwear collection.  Grio fam - do you think it's time more major retailers used body positive advertising? Or is this just a passing fad of acceptance? Sound off below!"},{"comment_id":"718460845008873","commenter_b":"never happen... if they couldn't massage their egos with those little golden idols... their would dry up and blow away.... or perhaps blow each other (y)","commenter_a":"Oscar - a trophy given by actors to actors for being actors. Like it makes the world a better place - NOT.","post_message":"Hollywood SCUMBAGS Might CANCEL the Oscars to Protest Trump"},{"comment_id":"10153885822754087","commenter_b":"Lmao.. She's a moron","commenter_a":"'@username hysterical","post_message":"Hillary Clinton took things a bit too literally during a recent campaign stop when she read the word “sigh” off her TelePrompTer instead of actually doing one. WATCH:"},{"comment_id":"10154013859753812","commenter_b":"Well let's work and try to keep dump people from getting guns.","commenter_a":"you would be smart Mr President to work on peoples parenting NOT GUN CONTROL, guns dont kill dumb people do","post_message":"President Obama plans to sit down with Attorney General Loretta Lynch after returning from his Hawaiian vacation to discuss gun control options. @webpagelink"}]
