[{"comment_id":"10152957013791336","commenter_b":"It's NOT HEALTHY to break into their homes or rob them or attempt To hurt their families......","commenter_a":"Why are all Americans so obsessed with guns, it's not healthy.","post_message":"Bonnie and Clyde's infamous pistols of choice — What are they worth? Find out tonight at 8:30p ET on Fox News Channel.   (via Strange Inheritance)"},{"comment_id":"1113331872041003","commenter_b":"Lauren my family worked hard & works hard to pay taxes not to give it away to terrorists & fake MTFs who pretend to be refugees & plus why don't they fuckin claim asylum first point of call instead of wanting to come to UK ! It's not cuz of getting money & free housing is it ? This island is full & like I say open your house to a family than . No ? Thought so another one all talk no action","commenter_a":"Go back & live your life in your home as there's nothing here for you & Europe does not want you . Your president as a lot to answer for.","post_message":"Refugees are forced to travel light, and they have to carry everything they'll need for their journey inside a small backpack. What's inside? AJ+ takes a look."},{"comment_id":"1043010225790700","commenter_b":"She'll want you to lie and cheat just like she does. Better stay clear of that lot.","commenter_a":"This is why I'm proud to be a Democrat Hillary is on her way Sign me up Hilary Whatever you need me to do Love is better than hate Love you Republicans","post_message":"Tonight: Hillary Clinton at the #DemConvention. Watch the speeches LIVE on Twitter now."},{"comment_id":"10154406846618734","commenter_b":"Really lady get over yourself. All you want is Money!!","commenter_a":"This is where feminism has brought womyn: seeing themselves victimhood is the highest calling of all.","post_message":"Do you think the claim is too much? Or just right?"},{"comment_id":"1062563810499126","commenter_b":"Proud to be a new yorker","commenter_a":"What a bunch of BS!!!","post_message":"Former New York City Mayor Rudy Giuliani speaks at the RNC.  Donald J. Trump introduces his wife Melania Trump and she speaks at the Republican National Convention."},{"comment_id":"419035241611690","commenter_b":"Ladies, use what ever you want, it is no one elses business","commenter_a":"Idiot !","post_message":"This GOP legislator has invented new female anatomy."},{"comment_id":"10155066406976509","commenter_b":"Don talking bull**** without proof !","commenter_a":"Everyone dopes in the Olympics China, USA, Germany you name it, everyone, the Russians were just dumb enough to get caught.","post_message":"BREAKING NEWS: Russia has failed in its quest to have a ban on its track and field athletes at the Rio 2016 Olympic Games overturned."}]
