[{"comment_id":"585280771667035","commenter_b":"This photo is liiiiiiiife!!!! :D :D :D","commenter_a":"Brian Rungeling don't you like Trump's new \"Make Russia Great Again\"?","post_message":"Alec Baldwin just trolled Trump again by walking around New York City wearing a “Make America Great Again” hat — with the embroidered logo in Russian.  The timing for Baldwin’s hat couldn’t be better, coming as the president-elect sat down with security officials on Friday who told him the Russians helped him win the election — an assertion Trump flatly denies because it would contribute to the belief that his win is suspect having lost by over 3 million in the popular vote."},{"comment_id":"10152818451732014","commenter_b":"Can't believe it. She had black heart so seem didn't care own baby. Y are abuse own child.","commenter_a":"How can people be so freaking stupid??!!!!!!!","post_message":"A Phoenix mother has been arrested for allegedly leaving her 4-month-old daughter in a hot SUV."},{"comment_id":"1000913466673540","commenter_b":"Trounce her lying ass!","commenter_a":"Don't run like Romney....","post_message":"Take our new CLASH Poll. Should Donald J. Trump play nice or ... should he put The Hildebeest on ICE? @webpagelink"},{"comment_id":"838459919590086","commenter_b":"Women who love Trump here.","commenter_a":"Montana here.","post_message":"LIVE NOW: Donald Trump expected to arrive at a \"Thank You Rally\" in Cincinnati, Ohio soon. It's the first of several stops for the President-Elect's thank you tour."},{"comment_id":"10154177327588984","commenter_b":"Don't want her anywhere near the White House.","commenter_a":"Lies more lies everytime she opens her corrupted mouth","post_message":"Hillary's campaign is once again doing damage control...  Is Hillary Clinton one of the last people you'd want to become president?"},{"comment_id":"10153238029913822","commenter_b":"You guys sound like some broke ass jealous bitches!","commenter_a":"How tacky of a wedding pic","post_message":"Personal chefs, fancy cars, an expensive pool & more… at 35,000 square feet, it’s described as the biggest house in Pa.  And now it's the focal point of allegations made in a massive federal tax fraud investigation: @webpagelink"},{"comment_id":"926693817463797","commenter_b":"Fuck u bitch","commenter_a":"Good :) anything to make more conservatives whine and bitch like the petulant children they are.","post_message":"This is just plain sad..."}]
