[{"comment_id":"942535009139581","commenter_b":"get over yourself girl","commenter_a":"So girls/ladies do you go phoarrrrr when poldark shows you his chest? If so you cant complain.","post_message":"The wolf whistling debate has got VERY heated"},{"comment_id":"10153280384163812","commenter_b":"Stfu bitchass","commenter_a":"Time to eliminate this threat to life.","post_message":"He's back, but this time, instead of just going for a leisurely stroll, Goliath the massive alligator is spotted trying to eat an entire turtle on his Florida golf course: @webpagelink"},{"comment_id":"10152908801970927","commenter_b":"No body forced you to spread your legs; and, no body forced you to have unprotected sex!!!!","commenter_a":"Cross your legs","post_message":"It's no surprise that Satanists support Planned Parenthood, but what is SURPRISING is how they showed that support ..."},{"comment_id":"198765370606154","commenter_b":"Bye Bye!","commenter_a":"Also you suck at acting","post_message":"George Lopez is still angry about the outcome of the presidential election. Let's make 200,000 #SHARES if you Never want to see Lopez Again !!!!"},{"comment_id":"1059213794114079","commenter_b":"You look like my next door neighbor. No seriously! My next door neighbor wears a hijab. She's one of the sweetest people we know. Even brought us cookies for Christmas!","commenter_a":"Islam is the best","post_message":"She stood up in an incredible way."},{"comment_id":"10156503411730354","commenter_b":"Obama and Bergdahl both need to be tried for treason, found guilty then shot.","commenter_a":"obama's plan is working.","post_message":"***BERGDAHL AND OBAMA HAVE DISGRACED AMERICA***"},{"comment_id":"10154010252346350","commenter_b":"The kid didn't make a mistake. If she was driving drunk then she committed a crime. Having someone plow into your home is not only traumatic at the time of the event, but then there are all of the repairs to deal with. It can take months to get it all put back together. And insurance doesn't cover all of the costs. Guess who gets to pick that up. Not the kid. She wasn't over reacting. If anything, she was quite conservative. I would have gladly beat the stuffing out of the one that hit us.","commenter_a":"I'm probably the only one who is think Kim... Is.. Well... Being a little actress like in all these tweets. We get it. The kid made a mistake. One that could of been fatal. One tweet is probably good enough (if at all) but like 4? Get a grip Kim. Ridiculous.","post_message":"\"This young girl could have killed herself, her friends, and me. Frightening.\""}]
