[{"comment_id":"1084762064867436","commenter_b":"Get your head out of your but she , started this joke !! May be you should pay for her education","commenter_a":"Looks like Fox found the dumbest person possible to ask questions to lol. Love how you're all thumping your chests cause Cavuto outwitted some dumb college girl.","post_message":""},{"comment_id":"1004538792920312","commenter_b":"@username I'd love to hear your thoughts on the post from Kylelebrius Kennethius Jenkonious","commenter_a":"Hey friends, just wanted to highlight part of this post for those who aren't able to read the whole thing or watch the entire video. I really want this post to get people thinking about how we talk about these issues but also what causes these situations, not just the consequences of them. I know this is a tough situation and one that provokes lots of emotion and passion, but I hope we can talk about this in a productive and respectful way. Thanks in advance. \"Violence of any kind is wrong. But there's a serious problem when white students rioting after the annual Pumpkin Festival are described as \"rowdy\" and \"unruly\" but black protesters rioting in response to police brutality are portrayed as \"violent thugs.\"","post_message":"If you replace \"white\" with \"black,\" suddenly it doesn't sound so far-fetched. That's precisely the problem with the way folks are talking about the Baltimore riots. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"1395591783831296","commenter_b":"If you are depressed, how do you think I am living at 30 minutes away from Russia? This thing sounds real to me because I see what's happening around Russia. If American people don't do nothing to stop the US government, my country and other countries around Russia will be erased before you people even realize that the war is started. Russians have nukes, we have sticks. My country doesn't have an army, half of Russian citizens are soldiers. So while America is still thinking if the news is real or fake, we think why our governments made an alliance with USA and allowed them to build anti-rocket shields and military bases on our territory, making us look like a threat to the Russians when we are not. Here we hate wars and guns. People here don't have guns, we don't go to wars. We don't want this s***. But ...","commenter_a":"always liked the mind unleashed but u get a ton of ppl on here saying u r blowing things out of proportion.. i for one as a parent dont appreciate being scared shitless.. surely u r just feeding the monsters propaganda?.. (the same fear that made ppl think they had to turn to the likes of trump!?..) yep in a ideal world the scum/politicians of the world would do whats best for everyone not just theyr own greedy vile selves but that aint gonna happen with any of the muppets in power right now.. dont u think the world is scarey enough already when someTHING like trump can get into such an important position of power!?? a pathetic joke of a man nobody in a rational mind would ever dream of looking up to! (minus the fear that is).. if this is just sensationalist headlining then give it a rest! ...","post_message":"Time to start paying attention."},{"comment_id":"934315223319642","commenter_b":"Michelle Owen Nyki KiKi 😂😂😂😂","commenter_a":"AHAHAHAGA help","post_message":"Via The Everlasting GOP Stoppers"},{"comment_id":"1692723517682991","commenter_b":"One of you crazy ladies is from Texas.","commenter_a":"Realism is not what I see coming from most of HRC's supporters. There are some extremely hard to admit, and in fact, frightening facts that I think we have all tried to glaze over for years. In Bernie Sanders we have got a candidate that is addressing those facts. Climate Change is real, most democrats are no longer climate change deniers, but I feel like the real threats are being overlooked. For example, droughts are happening all over the United States. We are quickly depleting our fresh water aquifers. When one factors Fracking into this, we are willfully allowing our government to destroy more of our fresh water systems. HRC cannot denounce Fracking. Now, before you think that article that spells out how much HRC is taking in campaign contributions from the fossil fuel industry is another Republican smear tactic, note that it is by Greenpeace. She has to go. ...","post_message":"\"We can open the door to every person in this country again.\" —President Bill Clinton"},{"comment_id":"1306972999355460","commenter_b":"If they come after our guns we are so screwed...This is something we better not let them do...If ever we need to fight it will be when they do come for our guns....Wake up american's...That Muslim snake in the white house is out to get us and it looks like he will stop at nothing to destroy us and our country...","commenter_a":"Yes it will!","post_message":"“An armed citizen is nothing for me to worry about”"},{"comment_id":"1375338609150152","commenter_b":"It's a bit of a give and take, really. Housing bubbles are good for homeowners and sellers, but when they burst, it's good for the people looking to buy homes. Both scenarios benefit real estate speculators in their own way.","commenter_a":"The housing crisis was NOT good for average Americans. It was a terrific thing for the realty speculators.","post_message":"Trump is literally arguing that America needs a president who will act like a selfish billionaire."}]
