[{"comment_id":"1338517659516985","commenter_b":"I call Bull!!! On that one!!! I have to perform and work twice as hard than my Caucasian counter part and still make less money. Do the 'work' of a title position but not get the position because the Caucasian has it and can't do the job!!!","commenter_a":"Always like this Guy best of movie real actor love him I see most of his movie .","post_message":"So accurate, it’s SCARY!"},{"comment_id":"10154249032461178","commenter_b":"She should be gangraped!","commenter_a":"Is the reverse also true?? Are you fair game if you disagree with my views?? What an idiot!","post_message":"A rapper with a history of controversy says violence against women is OK as long as they disagree with her politics."},{"comment_id":"1288527907860500","commenter_b":"Melissa these manhating proabort feminists don't get the concept of responsibility","commenter_a":"As early as 9 weeks the baby in the womb has all the same organs as you and I but in an earlier stage of development. He/she has a head, ears, nose, eyes, arms, legs, heart, brain, lungs. So tiny and so beautiful. Denying his/her humanity is denying science. Denying a human being his/her rights is against a concept of civilized society.","post_message":"Isn't life precious?"},{"comment_id":"590256634486210","commenter_b":"Haha america was never great and with you or Hilary as our president it will continue to never be great !","commenter_a":"Vote strong Vote Trump","post_message":"This is only the beginning. Hillary is CROOKED! She is not capable of making America great again. Sadly, she would do the opposite."},{"comment_id":"10154327870086509","commenter_b":"If they did who cares cnn enjoy the holidays merry Christmas to the Muslim world . Leave cnn racism behind .","commenter_a":"and lovebirds don't own February. So wtf is your point?","post_message":"'Christians don't own December,' one atheist writer says."},{"comment_id":"920378308055224","commenter_b":"Chris, stupid bitch, For Real, and there's the hate card you stupid impotent motherfucker.","commenter_a":"Hey it could have been done sooner. White priveledged males prevented it.","post_message":"EXCELLENT news!"},{"comment_id":"10152864481646336","commenter_b":"Zeke...you're the kind of kid that gave the bully in school your lunch money every day thinking it would make him like you. Never worked did it. This is a religious war. It's in their unholy book and no amount of appeasement will fix them. Their founders motto was 'CONVERT or DIE'. This is simple stuff. Read it. Understand it and don't give in to it. I admire the cartoonists for their bravery. That COEXIST bumper sticker should be pulled off every car on every liberal college campus and off every Subaru in liberal Minnesota and sent to some Islamist nation. We coexist VERY well. Our early settlers didn't kill the Indians who didn't convert. Our Founders didn't work that way either. We are not the ones who need the lecture. We wrote the book on getting along. They don't care to read it.","commenter_a":"Dear Muslims....COEXIST.... Or get out... or else.","post_message":"They were four of France’s most fearless and best known political cartoonists – all sought out and summarily executed by gunmen in Wednesday's massacre inside the offices of #CharlieHebdo: Stephane Charbonnier, Georges Wolinski, Jean Cabut and Bernard Verlhac."}]
