[{"comment_id":"1118930614814076","commenter_b":"Palin has a mental disorder, do not vote for this woman at all Americans.","commenter_a":"She gives all Alaskan women a bad name. Duct tape would be useful over her mouth.","post_message":"She's mind-bogglingly dimwitted."},{"comment_id":"10152895452606051","commenter_b":"BANG! But since that didn't happen, \"drop the soap bitch.\"","commenter_a":"Coward!!! Thank God for good neighbors.","post_message":"This man grabbed a woman and began raping her. That's when a group of Good Samaritans heard her screams."},{"comment_id":"10154303589011051","commenter_b":"Immigrants are always welcome, if they come legally and come to be A PART OF AMERICA. If they come to just spread their own countries ideals that conflict with the ideals of the USA, then why come at all? As for who said anything about Sharia Law...that is one of the biggest current issues with immigrants going to the US. They believe in it. They shouldn't be in our country if they do.","commenter_a":"What a wonderful way to make immigrants feel welcome (ps: that's sarcasm) or perhaps immigrants aren't really welcome? In your hearts do you hate people who haven't been born here or speak with an accent or celebrate holidays differently than you do? Whatever happened to \"We hold these truthes to be self-evident- that ALL men are created equal.\"? Or do we really mean all white northern European men are created equal?","post_message":"Do you agree or disagree with this Theodore Roosevelt quote?"},{"comment_id":"1111727715607435","commenter_b":"sick woman in many ways and not to be respected!!","commenter_a":"Clinton stood tall and showed she was someone to be respected, unlike the baby bully who consistently showed his ignorance and called name likes like a third grader.","post_message":"The final presidential debate is in the books. Which candidate made the best case for themselves: Trump or Clinton?"},{"comment_id":"1452387791451811","commenter_b":"until they bring in these terriosts refugees here watch diseases spread","commenter_a":"Not vaccinated your all welcome","post_message":"Antivaxxers, don't fuck this up for us."},{"comment_id":"10153644969898812","commenter_b":"Those flags do not represent the United States that I love.","commenter_a":"The church did not request it. The church is private property. Why does anyone think that TRASH should be placed on church property? If it is so much \"Southern heritage,\" why was it placed on a predominantly black church? Is that like burning a cross on someone's lawn?","post_message":"Four Confederate flags were discovered this morning by the Ebenezer Baptist Church and the Martin Luther King, Jr. Center: @webpagelink"},{"comment_id":"829690333773863","commenter_b":"The black community needs to clean up their act, plain and simple.","commenter_a":"This type of person should not be free.","post_message":""}]
