[{"comment_id":"10155399536459199","commenter_b":"Oh ok was wondering how close this happened it didn't specify what a sick man hope they catch him fast.","commenter_a":"Where is Lakewood Commons I live up by Lakewood high school?","post_message":"The man was about 6 feet tall and rode off on a green bicycle after exposing himself to the child."},{"comment_id":"10153881231351800","commenter_b":"Rubio is for granting amnesty for all these illeagals. Sorry we don't need rubio or his muslim immigrants.","commenter_a":"I would much rather see Rubio get the nomination instead of Chump Trump or Crazy Cruz...they are both psychos.","post_message":"Marco Rubio claims he's a GOP underdog because of his fancy boots, but Trevor thinks it might be something else. @webpagelink"},{"comment_id":"881915648510562","commenter_b":"Bitch you wanna get arrested????","commenter_a":"@username we talked about this as well","post_message":"The dark history of why cocaine is illegal... (ATTN: is excited to launch a new series about the history of illegal drugs)."},{"comment_id":"10153156333212093","commenter_b":"Agree @username, I appreciate your candor.","commenter_a":"I would have to say too bad. There are reasons why adoption laws are written the way they are. Just because various individuals attempted to circumvent the prior marriage laws to gain legal status instead of going about the legal routes and legal boundaries others have until the recent decision on same sex unions, is not a good enough reason to change the laws surrounding adoption and the laws against adoptive parents becoming involved with adopted children. Do they think they are the only \"couple\" who have this issue. There are countless stories of parents who adopted a child, got divorced, and one of the \"parents\" wanting to change the legal definition of the legal parent-child relationship. How about you made your bed when you tried to circumvent the laws to get around state and federal laws regarding things like insurance eligibility, income tax deductions, ect., just because there are ...","post_message":"Roland and Nino want to get married now that same-sex marriage has been legalized. The only catch is that they are already legally father and adopted son... @webpagelink"},{"comment_id":"10153417298067434","commenter_b":"Yeah everyone needs this guy in the women's bathroom","commenter_a":"This is how we protect our women... not guarding bathrooms for trans \"predators\".","post_message":"\"I was going on about something and saw Monica staring behind and making a funny face. I stopped. 'What’s going on?' After a few second she said 'That guy just put something in her drink.'”"},{"comment_id":"10153564798429614","commenter_b":"Don't crucify this jesus but put his head on a rope and pull him on a tall tree. Hope am communicating?","commenter_a":"Another senseless act of violence, may the victims RIP","post_message":"Two parents were killed and their daughter wounded when they stopped to help a man who appeared to be having car trouble on a road inside a Montana reservation. When the family approached Jesus Deniz Mendoza, he pulled out a gun and ordered them out of their car, the surviving daughter said. He then told them to walk away from their car. As they turned to leave, the daughter heard a gunshot. She looked back and saw her father lying in the road, she said. The next shot killed her mother. The third shot hit her in the back. Mendoza said he the victims because he was getting tired of waiting around, and because the daughter laughed at him, the criminal complaint says. Read KTLA's story here: @webpagelink"},{"comment_id":"1068708143222239","commenter_b":"Stupid","commenter_a":"Think of how awesome it would be if our President wasn't the anti christ.","post_message":"Happy Presidents Day. Image by Occupy Democrats, LIKE our page for more!"}]
