[{"comment_id":"10150751541914999","commenter_b":"Racists get uncomfortable when a mirror is held up to their face! No problem with unarmed Black men and women being slaughtered on a daily basis in a country that prides itself on being the greatest nation on the face of the earth. I mean, even the United Nations thinks there's a problem. Go figure! And any attempt to prove otherwise just simply means you're racist!","commenter_a":"Wah wah. Shut up and do your job.","post_message":"The Miami police union say Beyoncé had aimed to “divide Americans by promoting the Black Panthers” during the Super Bowl 50 halftime show."},{"comment_id":"10152987066401336","commenter_b":"She is a f*&king idiot","commenter_a":"Once again the State Department speaks nonsense. Save your money - don't send your kids to Universities if she is any example of what they are turning out.","post_message":"“This is an insult to all the people in the world who are actually poor and are not blowing people up and not targeting Christians.\"  Laura Ingraham slammed U.S. State Department spokesperson Marie Harf’s suggestion that job opportunities are a way to fight ISIS. @webpagelink"},{"comment_id":"420220894769172","commenter_b":"Yep and anyone else. Crazy bitch","commenter_a":"If she can't take it, get out of the kitchen!","post_message":"Republican Presidential candidates are all ganging up on Hillary Clinton. Is this fair?"},{"comment_id":"689708227853298","commenter_b":"Evidently the back of your father's hand never helped you because you're still talking crap go home Joe go home","commenter_a":"Hypocritical scum. \"This is a Big f---ing deal\". Didn't you say that?","post_message":"Vice President Joe Biden: Donald J. Trump's language would have gotten me \"the back of my father's hand\" abcn.ws/2fOBDpy"},{"comment_id":"10153003184965671","commenter_b":"Remove the millions of illegals. It may be a smaller piece....but it is still huge.","commenter_a":"Somewhat comical given the subject. If you're really worried about climate change and water, STOP GRANTING BUILDING PERMITS that CONTINUE to INCREASE California's population and water requirements.","post_message":"\"Longer fire seasons, extreme weather, and severe droughts aren’t on the horizon, they’re all here – and here to stay. This is the new normal. The climate is changing,\" Brown wrote in a letter addressed to Donald J. Trump.   Thoughts?"},{"comment_id":"982881765080578","commenter_b":"I hope so how can that woman even sleep much less lead a country would she do that to all Americans how can anybody vote for her","commenter_a":"I look at this picture and am reminded of the horrible torture this man endured, before his death, and wonder what really happened and who was responsible for not seeing the embassy was secured for their safety. It may not matter to Hillary, but it does to us and the the family members of those who died.","post_message":"Could we finally bring Hillary to justice?"},{"comment_id":"10155361770815354","commenter_b":"Yea an so is this bitch!!","commenter_a":"she sounds like nixon i am not a crook","post_message":"Hillary & Bill Clinton are simply without shame..."}]
