[{"comment_id":"10154450699361323","commenter_b":"Umm... because she's a woman!","commenter_a":".On what grounds does such a person NOT rather enter in the MALE-items?....","post_message":"\"It is unquestionably a sensitive and complicated issue and one that has arisen many times at the Olympics and other sporting competitions where it has been alleged that male athletes have attempted to compete as women or, in Caster Semenya’s case, that a woman has an intersex condition, which provides an alleged unfair advantage.\""},{"comment_id":"578535808963586","commenter_b":"Little beaver !","commenter_a":"10208389159192541lol smh","post_message":"Happy Groundhog Day—here's to six more weeks of winter. Thanks to Believing in imaginary friends and fairy tales is outside of my age bracket for sharing."},{"comment_id":"486444454879468","commenter_b":"I can't stand her either..","commenter_a":"Yes I will always honor and support the Flag of the United States of America!!","post_message":"Michelle Obama just said something treasonous about the flag. This is ridiculous, that flag is the symbol of the greatest nation on Earth. Do you support the American Flag?"},{"comment_id":"10154941514794062","commenter_b":"Say what you like.. Hoe, no talent.. Her bank account says otherwise. Carry on","commenter_a":"The only fame she has is singing with her legs apart and if it wasn't for that she wouldn't have any fans.","post_message":"Good news for Beyonce fans!"},{"comment_id":"510721549087800","commenter_b":"Ok 1. Lets ask ourselves do they want to destroy capitalism answer (no) 2. Will they take the means of production from the capitalist answer no 3. Do they want to destroy the upper class answer no","commenter_a":"The progressives will next demonize God and Jesus then they'll start pushing multiculturalism and diversity so Ireland get ready","post_message":"\"Abortion has been demonized and criminalized in this country and older generations think there's something really wrong of it... but it's something that should be available to people.\""},{"comment_id":"588617531328826","commenter_b":"She is a joke","commenter_a":"Yes she should keep her mouth shut. She is not the president (neither is Obama). She mouths off and there are Americans starving and dying because they cant get medicine. They both need to just go away. They dont need to be in the US.","post_message":"Michelle Obama wants America's sympathy for all that she has to put up with. Nobody cares. What a joke. Do you agree Michelle Obama should keep her mouth shut?"},{"comment_id":"10153098509611813","commenter_b":"The ACLU doesn't stand for white heterosexual males or gun rights...ever.","commenter_a":"The ACLU stands for dead babies and bombings.","post_message":"The ACLU supports refugees and stands against fear mongering by politicians. @webpagelink #refugeeswelcome"}]
