[{"comment_id":"10153951391170579","commenter_b":"We have millions of people on welfare because Illegals are doing the jobs they are qualified for...we can use guest workers legally if we need more workers...I don't see us the US needing them though","commenter_a":"The republicans are certainly changing their tune on immigration. But they have no choice. Nobody in their right mind believes that we can deport all illegal immigrants without devastating our economy and millions of families. Even Trump admitted that they could come right back, a weak attempt to lessen the blow of his ridiculous plan. Yet another win for Bernie Sanders, who has no need to flip on issues to garner support.","post_message":"Your takeaway from the 4th Republican Presidential Debate?"},{"comment_id":"10152987199648645","commenter_b":"We are fed up with illegals and their anchor babies.","commenter_a":"What an idiot!! Those poor children! Obviously the program was already english hence the translator for the parents. Have some compassion and MANNERS!!!","post_message":"Witnesses at the Kindergarten concert said the man stood up as a Spanish translator began speaking and repeatedly shouted ! English only!"},{"comment_id":"10153315514576336","commenter_b":"That turbofan jet engine intake is sturdy enough to handle the weight of that woman. Also, her derrière is not going to effect the shape of the intake. It is designed to handle air pressure from 250 knot IAS relative wind that at altitude could be as high as 550 knots TAS. So, what's the big deal? I think the picture looks COOL!!!","commenter_a":"I do not think so. The preconditions are whether the company has the clear policy for it, whether she got enough training of behavior in the company?","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"962607787132303","commenter_b":"I am a Turkish citizen, as well as a British,! all our cities, streets and everywhere in Turkish borders are full of Syrians.. More than 2.5 million people officialy! Isn't that enough?? You still call yourself\"human\"?? We are sharing our bread and shelters with them. What about you? When it comes to talking about peace and human rights, you are the best, huh?Act now! It's the right time! Or do you prefer watching this American film on vision in your comfy sofas forever??? Barry in mind! ISIS is USA, UK, and IS'REAL terrorist organisation!!! They r the ones! Making, and forcing them to die or leave their homes.!! Then UK, USA, and IS'REAL terrorist organisations can get an easy access to their recourses, gold, diamond, oil, and gas.!!!! You both got it!!!","commenter_a":"If the EU keep housing them they will keep coming and is only going to make the problem worse. If they really wanted safety then they would have stayed in Muslim Turkey. They are all out for the benefits that get lavished on them. You cant blame them and most people would do the same.","post_message":"Bikinis, sun loungers ... and a tide of despair"},{"comment_id":"768354383300233","commenter_b":"@username Go ahead and Kick the Tea Partiers and Trumpetiers out of the GOP, MARY JANE FAGALA! WHAT YOU WILL HAVE LEFT SHOULD BE ENOUGH TO HOLD A STRATEGY SESSION ON HOW TO REACH OUT TO DISAFFECTED DEMOCRATS, SOCIALISTS, COMMUNISTS AND LOTS OF OTHER \"ISTS,\" BUT YOU WILL HAVE LOST ALL THE POWER THAT THE TEA PARTY DELIVERED TO YOU. LOTS OF LUCK!!","commenter_a":"If the GOP think the people are ANGRY NOW,,,,just wait until they try a brokered convention!! It will be mayhem. The LAST NAIL in the coffin of the Republican Party!! You can take THAT TO THE BANK.","post_message":"A brokered convention seems to be all the talk in the Republican party right now, but there's a real split in who's supportive of the idea... Do you think Ted Cruz is right about this?"},{"comment_id":"10154262387346509","commenter_b":"What is justice? Isn't it making something \"just\"? If so, how is justice possible in cases where the crime can't be reversed? If someone steals a $100 bill, justice can be had by paying it back to the victim. You can't undo rape, murder, abuse... etc. So then it comes down to punishment, coping, and vengeance. Punishment is negative reinforcement to change someone's behavior. Coping with a problem is minimizing or eliminating the threat. If someone is an immediate threat and won't be considered fit to be in society, that means prison or death. Vengeance is just getting revenge and causing suffering to deal with suffering/pain.","commenter_a":"I hope the suspects are found alive, justice must be served","post_message":"“I heard rapid shooting — just boom, boom, boom …” Eyewitnesses describe the scene of a mass shooting in San Bernardino, California. @webpagelink"},{"comment_id":"10154297413016378","commenter_b":"And, as usual when in the playoffs, promptly lose","commenter_a":"Haha, pretty sure Garrett said he wanted to keep the momentum going into the postseason. The only QB to move the ball was Romo and he got most of his yards through PI. The Boys were flat out beaten today. No excuses. Dallas has looked pretty weak the past few weeks.","post_message":"The Philadelphia Eagles end the season on a high note with a win over The Dallas Cowboys! Final Score: 27-13. @webpagelink Way to go Birds! E-A-G-L-E-S EAGLES!"}]
