[{"comment_id":"10153184013859255","commenter_b":"ThankYou","commenter_a":"Who was it that said \"You have to have some intelligence to realize how stupid you are\"? No intelligence on display with those who still believe in the KKK. Haters and bigots.","post_message":"Another day in post-racial America."},{"comment_id":"10154037878823984","commenter_b":"Mr. Trump from the time he started his campaign he has always states that all the illegals have to go back have to go back to Mexico and Central America but yet he is one of the largest employers in the Real Estate , Casinos , Hotels, and Golf Courses business, has bragged about hiring illegals to including his contractors and subcontractors and they love him 1. did he use e-verification to see if he or his contractors and subs to see if they had a work permit or they are who they say they are. 2. you claim you want to help the veterans but your company hires more illegals than vets. 3. if you are serious about what you are campaigning on why not be the first to fire or dismiss the illegal aliens and fill those jobs with veterans lead by example and make America great again ...","commenter_a":"Yup another lifer. GET RID OF POLITICAL LIFERS THAT ARE FEATHER BEDDING Stump for Trump. You Go Don, Go Don all the way to the WHITE HOUSE.","post_message":"Wow. The governor of Iowa is actively working against one of the GOP's most popular presidential candidates. This is very unusual for the Iowa caucus... the Iowa governor must feel very strongly about this. Do you agree with the Iowa Gov.?"},{"comment_id":"1107023316031416","commenter_b":"@username white people have committed more rapes and drug transactions than mexicans","commenter_a":"This is what leadership looks like - he's going right into the heart of the democrat plantation, not because of the votes, but because he cares, and he believes that everyone deserves to have the opportunity to prosper and live in safety.","post_message":"\"Christian faith is not the past, but the present and the future. Make it stronger.\" Moments ago in Detroit, Donald J. Trump spoke to the Great Faith Ministries International Church, calling the African American faith community \"one of God's greatest gifts to America and to its people.\""},{"comment_id":"961399343937315","commenter_b":"Polls mean nothing, Remember Reagan! Go Trump!","commenter_a":"Are you sure it is Cruz and all the lies he told and putting the blame on others like Obama well I am not there is others was ways to do it like the Gop and the liberal party L","post_message":"\"Ted Cruz SEVERELY CUTS Trump's national lead from 18% to 3% in ONE MONTH!\" Let's go, #CruzCrew!"},{"comment_id":"10153958527368822","commenter_b":"apparently you havent done your homework or been around long enough to have seen and heard her bigot comments in the past. She stated she will raise all taxes and healthcare. unless you are wealthy and dont care about others who are not your ok with paying more. Also I would still love to see Bush in prison right beside OBUMMER and KILLary. She is not for woman. She was the lawyer for a man who raped a 14 year old girl and got him off. Do some homework. Ive studied both sides and a liar , a cheat and a murderer for president of my country. our country that so many have died for no F_G way. Your so hung up on a stupid wall and blinded on real issues. Our parents and grand parents have worked all there lives for ss and its a loosing battle because the ...","commenter_a":"So to the people that are angry by this. You are willingly admitting that you are and support racism, bigotry, homophobia, xenophobia, getting rid of women's rights, allowing abuse of children and women to be legal. To literally rounding up whole races of people tagging them and putting them in camps. Exactly what the Nazi's did. You are saying that you are unable to think for yourselves, that you think there is this america that you are being held back from that doesn't actually exist. If so I hope you are proud of being a horrific human being. You are a traitor to America and all that it stands for. You are scum, a filthy plague on human society. You are the embodiment of everything that you hate.","post_message":"\"We are a city of bridges, not a city of walls,\" said Congressman Mike Doyle, referencing Donald J. Trump, at Clinton-Kaine rally in #Pittsburgh."},{"comment_id":"10153315530254203","commenter_b":"Yes,Everywoman has a right to choose.","commenter_a":"Here's one for ya: \"WHAT DIFFERENCE AT THIS POINT DOES IT MAKE!??!?!?!\" (With appropriate accompanying \"toddler having a tantrum\" body language). That's one of MY faves.","post_message":" rights are women rights and women rights are human rights once and for all."},{"comment_id":"1154241914613147","commenter_b":"Maybe that dickwad should of been aborted.","commenter_a":"The faux outrage is big with this one. Who gives a crap.","post_message":"“How the hell do you think this joke is OK?”"}]
