[{"comment_id":"10155598100226002","commenter_b":"Something white people started, after having intercourse with monkeys they would die from AIDS. Mosquitos was a bacteria form from their deceased corpes.","commenter_a":"Hmmmn,what's the next thing that will be killing us...SLEEP???????Always fear mongering and hysteria..","post_message":"Known to health experts as the most deadly animal on the planet, the minuscule mosquito, with its dreaded whine, is responsible for millions of deaths from multiple diseases each year."},{"comment_id":"10153101086445736","commenter_b":"a burnt pussy lips","commenter_a":"Shannon Linda Harman","post_message":"Thanks to some \"Sound Prosthetics\" Honey and Badger are on a roll."},{"comment_id":"863004940415197","commenter_b":"Throw her in jail","commenter_a":"Take her down!","post_message":"\"Perfect\" was the response Lerner used about the non-archived messaging system."},{"comment_id":"10154217299006350","commenter_b":"Praying for yall","commenter_a":"This is my daughter dressed for the winter formal, I am proud of who she is inside and out. She loves school, sports, and her church. I don't care who she decides to love or what she wears as long as she does it with all her heart and as long as she knows me and Jesus love her.","post_message":"\"I think God accepts me for me.\""},{"comment_id":"875716175906497","commenter_b":"No Muslim majority country throws gays off of buildings (unless you want to recognize the legitimacy of the \"Islamic State\"). Genital mutilation has no semblance of a relation to Islam. It's a cultural problem endemic of Northern Africa, not Islam (Christians and Jews from this region have the same problems with this practice).","commenter_a":"Yeah, except this ancient religion doesn't through gays off buildings, mutilate female sexual organs, and and want to kill anyone who doesn't become a Jedi! DUMBASS!!!!","post_message":""},{"comment_id":"684673561687958","commenter_b":"Your right I will vote female when it's right and it won't be Chelsea Clinton either. MAYBE IVANKA TRUMP.","commenter_a":"I would have no objection voting for a QUALIFIED female for president. However, I will not vote for anyone of any gender, color, or nationality that is a liar, is a thief, etc to run our country further into the ground. This election is not the time to vote for a female president.","post_message":"\"For all you women out there who think that electing a female president will lift us all up, just ask yourselves if electing an African American president lifted up the blacks in this country.\" – Judge Jeanine Pirro @webpagelink"},{"comment_id":"1777971925823252","commenter_b":"She's cheating with a cheater, duh.","commenter_a":"Can't stand him. Good voice but once a cheater, always a cheater . Maranda your so much better without him. Keep up the good music. He's trash and so is She. .","post_message":"Whoa..."}]
