[{"comment_id":"1729422480677478","commenter_b":"I'm for the wall. Now!","commenter_a":"Immigration across the southern boarder is at an all time low level. President Obama has deported more illegals than any other president.","post_message":"Donald Trump says a border wall is a common sense way to slow the flow of illegal immigration at the border. Are you for or against his plan?"},{"comment_id":"10154620452720575","commenter_b":"She should have had a gun!!!!!","commenter_a":"Was it a Muslim?","post_message":"WIFE OF MISSOURI GOVERNOR-ELECT IS ROBBED AT GUNPOINT IN ST. LOUIS!"},{"comment_id":"706998779490700","commenter_b":"I'll help her pack!!! Don't let the door hit your big fat ass on the way out!!!!","commenter_a":"She is as big a piece of shit as her husband","post_message":"Michelle Obama was caught bad mouthing America in this newly surfaced video. If she doesn't like America, she can leave. Would you be happy if Michelle was gone?"},{"comment_id":"10153095274501600","commenter_b":"JERK","commenter_a":"there needs to be an (unlike button)","post_message":"“We are entering the curvy girl era and when all eyes are on the bikini babes of Sports Illustrated, it would be a great time to have the conversation about the rise of the curvy girl,” a spokeswoman for Sports Illustrated said."},{"comment_id":"1090355681009413","commenter_b":"IT'S CALLED CORPORATE WELFARE , and it's been going on for way tooooooo long , and it needs to STOP !!!!!!!!!!","commenter_a":"the republican way","post_message":"Congress continues to let billionaires slide and pats the back of the wealthy while every day Americans suffer. Sign your name to help raise the minimum wage →   @webpagelink  (Hat tip to The Other 98%"},{"comment_id":"10153041187141037","commenter_b":"Which one Rebecca?","commenter_a":"Life begins when that egg is fertilized life begins when that baby Not a fetus has a heart beat life begins when that baby can survive outside the body. This isn't religion this is real talk","post_message":"In an embarrassing setback, House #Republicans abruptly decided to drop planned debate of a bill criminalizing virtually all late-term #abortions after objections from GOP women and other lawmakers left them short of votes."},{"comment_id":"10153155479946051","commenter_b":"I take it, SHE is a woman who likes to dress as a man.","commenter_a":"Disgusting","post_message":"This soldier has been told point blank: You must wear a female uniform if you want to participate."}]
