[{"comment_id":"637787356403576","commenter_b":"She's a psychopath","commenter_a":"She's correct. We're living in an era when a significant number of Americans simply refuse to acknowedge facts, or even the existence of facts. It's the populist wave.","post_message":"Hillary Clinton: \"It's now clear that so-called fake news can have real world consequences.\""},{"comment_id":"10153168410293690","commenter_b":"In ind had been an individual liber,on account of each mob should be admit each religion.its actual substance,besides already has recognized via Basic R8s","commenter_a":"Its expected from modi sarkar, as he has the record of massacaring muslims in Gujrat..","post_message":"Are India minorities under attack? Christians and Muslims say the government is not doing enough to protect them from hardline Hindus. But is prime minister Narendra Modi being compromised by his nationalist roots? @webpagelink"},{"comment_id":"10153586503151336","commenter_b":"Lmao @username is a pussy cuz a girl made it","commenter_a":"@username @username Cody Wilkerson","post_message":"Two women have made military history by becoming the first female soldiers to complete the U.S. Army's grueling Ranger Course."},{"comment_id":"10153603488066680","commenter_b":"The only law that need making is that ONE that makes it illegal for people to break the law!!","commenter_a":"The Boston bomber used a pressure cooker, Oklahoma was fertilizer. Killers will find a way. Let's blame the perpetrators, the ideology,not inanimate objects. Law abiding citizens should not have there rights tampered w. Let's enforce the laws we have.","post_message":"\"We need to have the hard discussion and talk about gun laws that allow an individual to legally purchase weapons that facilitate mass killing. We have to have those hard discussions,\" Lynch said Tuesday."},{"comment_id":"1220911264593201","commenter_b":"@username who is illegal stupid!!!","commenter_a":"FINAL, now THAT is something to celebrate because: #BarackObama is a sociopathic liar, a national disgrace, an enemy of the Constitution, racially divisive, a promoter of black genocide by abortion, denies the threat of radical Islam and then supports that threat, a communist sympathizer and a traitor to civilization. That is his legacy.","post_message":"SATURDAY: Watch President Obama's final White House Correspondents' Dinner - LIVE on C-SPAN (TV) and here on C-SPAN's Facebook page. More here: @webpagelink"},{"comment_id":"978476018838818","commenter_b":"How can a woman like this evil face.","commenter_a":"Oh for God's sake.","post_message":"PLEASE SHARE: Seattle police have released a photo and have identified the man suspected of setting his girlfriend on fire in South Seattle last night. Police are looking for 62-year-old John Turner >> @webpagelink"},{"comment_id":"10152867381576130","commenter_b":"The fact he's sharing this photo makes it people's business lol","commenter_a":"So what does he have down there?","post_message":"\"We've had comments saying 'he doesn't look trans' which brings up a great point on what does trans even look like?\""}]
