[{"comment_id":"631709593654535","commenter_b":"Just left Great Lakes Navy Recruit Center and such pride in our country and military on full display....folks from all backgrounds. Hillary does not support our troops and I can only pray that my son does NOT have to have that woman as his CIC","commenter_a":"The irland of cyprus to .with u trump","post_message":"I am truly honored and grateful for receiving SO much support from these military leaders -- American heroes -- who have defended our freedoms. THANK YOU for your service and sacrifice, as well as your confidence in me to serve as Commander-in-Chief. #AmericaFirst!"},{"comment_id":"936584933056721","commenter_b":"Well bye bye you illegal immigrant because your ancestors aren't from here .","commenter_a":"Black life's matter movement is a threat to law enforcement! The Obama administration is a threat to law enforcement! Islam is a threat to law enforcement! Illegal immigration is a threat to law enforcement!...... This man is not!","post_message":"In a video he apparently posted last week on Facebook, Jon Ritzheimer calls out New York-based The Islamic Post for calling him the \"American Taliban.\" Now the FBI has issued an alert, citing he is a  threat to law enforcement."},{"comment_id":"10153551437246336","commenter_b":"Hello!! They treated him like that bc they believe him to be a wolf in Sheep's clothing. I find him very entertaining but he is the Clintons wild card. He will divide the republicans so democrats will win. They even point blank asked him when he became a republican and all he can say is I changed my mind.","commenter_a":"@username owes Donald Trump an apology. Get rid of Megyn Kelly while you're at it.","post_message":"Which GOP presidential candidate do you think gave the most impressive performance during the Fox News-Facebook prime-time debate?"},{"comment_id":"859334654119032","commenter_b":"Btw, military grade doesn't always mean what you think it means.","commenter_a":"There is no such thing as an assault rifle. It's a made up term to scare ppl.","post_message":"DEVELOPING - Father of Patient Takes Hostages at Houston Hospital with Rifle   Hoping for a peaceful resolution."},{"comment_id":"682546678578123","commenter_b":"Historical facts, not rumors, not hearsay just plan undeniable facts. (This is just a small percentage of a much longer list ) Of the two candidates running for president... Only @username was caught lying to congress. Only @username was fired from a job for being unethical. Only @username deleted 30 some thousand emails after she was ordered to hand them over to the Fed. Only @username had that same computer wiped clean by professionals. Only @username got the rapist of a teenage girl off on rape charges then laughed about it. Only @username lied to the American people about Benghazi. Only @username lied to the American people about her emails. Only @username lied about being under sniper fire. Only @username lied about lying to the American people. Only @username was involved in \" Cash Cow \" Only @username has a long list of scandals. Only @username nationally belittled her husband's ...","commenter_a":"If you hate her so much why do you sad feckers bother to be here? And have you actually looked at Trump? The rest of the world are scared shitless that he'll get in. Oh, apart from Russia.","post_message":"Born before women could vote, Ruline just cast her ballot for Hillary in Iowa today. Join her: IWillVote.com"},{"comment_id":"10153852047087061","commenter_b":"Woman need to have concealed carry. Just too nasty out there now.","commenter_a":"Wtf!!!","post_message":"BRUTAL ATTACK: Police are looking for a man who walked up to a woman near a San Francisco park and began punching her in the face. Read more: @webpagelink"},{"comment_id":"793075604079241","commenter_b":"Thank you SIR!","commenter_a":"Thanks, the GOP needs more people like you, Scott.","post_message":"I voted against the \"clean\" DHS funding bill today. I will not compromise when it comes to our Constitution. President Obama has shown he has no regard for the principles our nation was founded on. If Congressional Republicans won't hold the line against this president, then who will?"}]
