[{"comment_id":"10153957663196509","commenter_b":"i would run away too if rosie was my embarassing mother, RUN GIRL RUN......","commenter_a":"Gay parents would make any child go crazy!!!","post_message":"The 17-year-old had stopped taking medication for an undisclosed mental illness, Rosie O'Donnell said in a statement. @webpagelink"},{"comment_id":"10153306712306323","commenter_b":"Women are garbage collectors in the US. I've worked with a woman in construction 25 years ago in construction. I quit that job, and got an easier one. She remained, lol. I don't mind Feminism, I think it's something that needs to exist. I just don't like the internet clusters of nutjobs, who believe if you smile or say \"hello\" to a woman, you are promoting rape culture-whatever the fuck that is. These types of Feminists are useless. They need to fuck off.","commenter_a":"According to 2010 BLS data, the following jobs contain 1 percent female workers or less: boiler making, brick masonry, stonemasonry, septic tank servicing, sewer pipe cleaning and working with reinforcing iron and rebar. Maybe the reason female workers aren't in these occupations is that too many are in other occupations. Females are 97 percent of preschool and kindergarten teachers, 80 percent of social workers, 82 percent of librarians and 92 percent of dietitians and nutritionists and registered nurses. Women have demanded more professorships, seats in congress and chairs in the boardroom, but have never complained that there were not enough female garbage collectors, waste water treatment workers, plumbers, welders, pipe fitters, coal miners, truck drivers, brick masons an block masons, lumberjacks, oil rig workers, well drillers, surveyors, longshoremen, construction workers, landscapers, sheet metal workers, HVAC repair persons, meat packers, high rise window washers, car mechanics, iron workers or any physically ...","post_message":"\"Philip Zimbardo is one of the first people undergraduate psychologists learn about. His prison experiment in the basement of Stanford University showed a darker side of humanity. He now tells us that there are fewer men than women at college, stating that positive discrimination is now needed to increase the numbers of men at university, but this is because ‘one reason you go to college is to find a guy’. Not only are these kinds of views horribly sexist and outdated, they’re also far too simplistic.\""},{"comment_id":"1982433335149738","commenter_b":"Beyonce is good in showing off her booty and that's about it .","commenter_a":"Agreed with Santana. Her performance was too visual artistic and address to a very narrow audience....it was not too much a vocal challenge or a singing performance in the true sense. This characterize her style over all.","post_message":"Carlos Santana: Beyoncé is not a singer, with all respect to her"},{"comment_id":"1787974808090517","commenter_b":"When a woman as dumb as a rock has been a Senator, Secy of State, and candidate for president of the USA, my God , makes one wonder how many ignorant people have voted for her.","commenter_a":"awwwww wasn't trained???? They keep saying she's so \"intelligent\" and the most \"Qualified\". Everything about her is BS! The absolute worst Democratic candidate EVER!","post_message":"A senior Department of State official claimed there is no documentation showing former Secretary of State Hillary Clinton ever received training in the proper handling of classified materials, according to a June 30 Department of Justice filing in U.S. District Court."},{"comment_id":"864666960316353","commenter_b":"I know! Power to the feminists. But that would make me feel dirty .","commenter_a":"Grace Te Moananui @username","post_message":"Armpit Hair Is Trending, And It’s A Step Forward For Women Everywhere"},{"comment_id":"10155704643444199","commenter_b":"No we dont want that woman in office.","commenter_a":"People don't want a woman in office. It's that simple! You can tell yourself and the rest of us that that's not the case. But it is.","post_message":"It the first time in four decades the state electors have broken from the popular vote for president. At least one vote was cast for Faith Spotted Eagle."},{"comment_id":"1129043100469880","commenter_b":"There is a woman out there thirsting for this man","commenter_a":"@username LOL","post_message":"He wants to be \"the complete father,\" and he's doing it one braid at a time. A video by Jess Blank."}]
