[{"comment_id":"554155158094381","commenter_b":"Christie is killing ittonote! I'mactually a Cruz supporter. Sorry Ms. Pendleton but u cant have 15 people on the stage and get anything worthwhile discussed. I like Mrs. Fiorina,I think she is brilliant, but she didnt get enough supporters. Sorry for that cause I think she would be a great first woman president. However, we have to end with an electable candidate that will beat the demo candidate, cause we dont need another Obama presidency. Electing Clinton would be electing another Obama.","commenter_a":"ABC is doing a horrible job of not including Ben Carson in any of the debate questions since the question of Senator Cruz cheating him out of votes in Iowa.","post_message":"WATCH LIVE: Republican presidential candidates face off in the ABC News #GOPDebate in New Hampshire. Watch all of our debate coverage right here! @webpagelink"},{"comment_id":"10155309638386509","commenter_b":"Stay home old hag","commenter_a":"There was nothing ,\" near\" about it . The Clinton News Network rolls on. In the bag for the Hag.","post_message":"Four days after her near fainting spell, Hillary Clinton is returning to the campaign trail"},{"comment_id":"1411515005587074","commenter_b":"@username yes you are bitch","commenter_a":"Thank God he is back. Just feel better knowing he is in the USA.","post_message":"Welcome back, President Obama!"},{"comment_id":"1094669133962671","commenter_b":"Well folks that's more reason that woman will never be president","commenter_a":"Alright, That's it!","post_message":"JUST IN"},{"comment_id":"10153413861058352","commenter_b":"Keep raping her for the rest of her life like she did to her grands","commenter_a":"Sick piece of shit","post_message":"Woman sent to jail for the rest of her life after raping her four grandchildren is described as the ‘most evil person’ the judge has ever seen. #STILLTRENDING"},{"comment_id":"10155169857528690","commenter_b":"Que triste, que bom que salvaram!! Quero adotar!!!","commenter_a":"Daniela","post_message":"91 dogs and 10 cats were rescued from a suspected puppy mill in Australia."},{"comment_id":"642441049213821","commenter_b":"Crying over spilled milk. She should move on","commenter_a":"Our system does NOT invite tampering, if you asshats didn't decide to cheat. Pure and simple! And the fact that you and your ilk can so easily rationalize your way around the rules suggests that you're definitely part of the problem.","post_message":"Green Party presidential candidate Jill Stein says a recount is needed because the current voting system \"invites tampering\" and there have been many \"red flags\" with votes in the election. Should there be a recount?"}]
