[{"comment_id":"10154759718811178","commenter_b":"The Times does not have to worry about the leak, we all could hear and see how biased the moderator was.","commenter_a":"Birds of a Feather, always stick together....","post_message":"The NY Times let it slip they thought the moderator helped Kaine during the #VPDebate.  But it's what they did next that's getting attention."},{"comment_id":"10153796451206491","commenter_b":"STFU","commenter_a":"Wanna help stop racism? Quit talking about it","post_message":"\"The more we learn about who we are and how we got here, the more we will mobilise\""},{"comment_id":"10152942742574753","commenter_b":"I have learned a lot about you guys","commenter_a":"this goes to show you the high levels of stupidity and ignorance that exist in the white race. they think they are so smart; that they know everything. yet, they do not know that there are people as Black as me with full heads of blonde hair in this world. she should have gotten more money. there is no excuse for this degree of ignorance, today.","post_message":"An arbitrator awarded an ex-Hooters waitress $250,000 in lost wages and attorney compensation after she was allegedly fired for having blond highlights in her hair. Hooters denies the allegations and says many African-American women have worked at the chain of restaurants while having various shades of hair, including blonde, without any difficulty whatsoever."},{"comment_id":"1237520902934076","commenter_b":"She's a criminal, with really bad hair.","commenter_a":"She did what she was hired to do.","post_message":"The American people deserve better. The DNC and Hillary Rotten Clinton rigged the system and completely ignored what the people wanted! They are so, SO corrupt!"},{"comment_id":"950867651635304","commenter_b":"The son of a bitch is white----that's why!!","commenter_a":"How bout this bastard coward be sentenced to 79 years, the age of the gentleman he hit, please put him with the gangs","post_message":"Texas man who filmed himself assaulting an elderly black man during what is known as the “knockout game” sentenced to 71 months in federal prison.  Conrad Alvin Barrett was charged with a hate crime for punching 79-year-old Roy Coleman, fracturing the man’s jaw in two places. Barrett said he targeted the man to see if the assault against an African-American victim would be nationally televised. MORE ----->  @webpagelink"},{"comment_id":"10153044647531680","commenter_b":"For such a homely woman, she certainly is getting a boat load of dates all of a sudden.","commenter_a":"Go ahead and meet her! Just turns off every moderate republican and makes him that much more of a joke.","post_message":"Ted Cruz, whose staff has been in touch with her lawyer, plans to visit Davis at the Carter County Detention Center, where she is being held, in the early afternoon."},{"comment_id":"10154757524712300","commenter_b":"booooooooooooohooooooooooooo","commenter_a":"Got eeeem","post_message":"Anti-Donald J. Trump protesters gather at Bayfront Park (may contain graphic language)"}]
