[{"comment_id":"10153266437101336","commenter_b":"Real biker gangs are way more dangerous than the pretty actors on that show made them seem.","commenter_a":"They all must have watched a marathon of Sons of Anarchy this past weekend","post_message":"UPDATE: Police adjust the number of people arrested from 192 to 170. \"This is probably one of the most gruesome crime scenes I've ever seen in my 34 years of law enforcement.” – Waco police Sgt. W. Patrick Swanton @webpagelink"},{"comment_id":"10150578591129999","commenter_b":"she has class","commenter_a":"Sexy","post_message":"Jennifer Lawrence in Dior couture at the Met Gala. See more photos: @webpagelink Credit: Josh Haner/ The New York Times"},{"comment_id":"10155047061111336","commenter_b":"what a bunch of bullcrap everyonr can get s social security number legal or not","commenter_a":"Wow that hurt my brain to watch. He says illegal immigrants contributed billions of dollars in taxes and social security 😂😂😂😂 you cant do that if you dont have a social security number and if your here illegally you dont have one. So how exactly is illegal immigrants doing anything for our nation except burding all of our systems and taking jobs from american citizens.....","post_message":" do you have a Social Security card to be in this country? How do you have a Social Security number? ICYMI: \"Angel Mom\" Laura Wilkerson and undocumented immigrant Jose Antonio Vargas clashed over President Donald J. Trump's executive orders on illegal immigration. @webpagelink"},{"comment_id":"10154106990671409","commenter_b":"God help us if this is all they can trawl up for person of the year . He is only out to fill his own own pockets further. This misogynistic , ecogotistical man is only out for himself, and will turn out to be america's biggest mistake.","commenter_a":"He's NOT a PERSON!!! He's an orangatan and inhumane ethnocentric lying bully.","post_message":""},{"comment_id":"508254089382552","commenter_b":"It's cheaper in the long run to deport them now.america can't continue to feed ,clothe,and give free everything to these people.Damn it our vets and needy in america should come first.","commenter_a":"We don't , and they don't assimilate ..","post_message":"NO."},{"comment_id":"966131710165214","commenter_b":"The people Hitler was fighting nare in control of America now.#GoZioniost#FickZionoistPuppets","commenter_a":"Hillary and Obama are a cancer to our country.","post_message":"Is it happening again? Join Us: The Free Thought Project"},{"comment_id":"1297466373615674","commenter_b":"HOW CAN ANYONE VOTE FOR THIS WOMAN WHO IS SO BLATANTLY FOR THE SUPER RICH !","commenter_a":"GO BERNIE !!! YES ... we surely need to implement a nationwide ban on this problem will destroy our only livable planet, Hillary support fracking... That's totally unacceptable and she is unfit to be pres.","post_message":"Fracking is a reckless, destructive and expensive practice and we must put an end to it all over this country. Add your name to say you support preventing the worst effects of climate change through the Keep it in the Ground Act."}]
