[{"comment_id":"10154060269921162","commenter_b":"BANG...! that's all","commenter_a":"Two things that are impossible... To rehabilitate a terrorist or a child molester. Both should be shot on sight...","post_message":"DISTURBING: Thousands of digital images that show children as young as 5 years old engaging in sex acts with adults were found in an Indiana man's home... @webpagelink"},{"comment_id":"10153970352414087","commenter_b":"how many lies does that bitch have to tell before your eyes open? Or do you not care, is it all about the vagina's turn in the WH?","commenter_a":"more like clinton being suicidal (can only hope) watching her campaign going down in flames with all her lies","post_message":"\"Longtime ally of Paul Manafort, Trump's campaign manager: 'Manafort not challenging Trump anymore. Mailing it in. Staff suicidal,'\" CNBC reporter John Harwood tweeted."},{"comment_id":"10152841288932061","commenter_b":"I LOVE Johnny Depp and most of his movies. This is disappointing. He should just send them home. Save their lives. They should not have to pay for his stupidity!","commenter_a":"Everyone else has to do this and so do you,Depp!","post_message":"Depp is in Australia to shoot the fifth edition of of the Caribbean, called Men Tell No Tales.\""},{"comment_id":"10153575076007411","commenter_b":"He was probably lured in by a crazy lady offering him pizza","commenter_a":"Susie Gollehon","post_message":"UPDATE: The boy has been found safe Police in Glen Ellyn are searching for a missing 12-year-old boy who was last seen riding his bike Monday. Story: @webpagelink"},{"comment_id":"908467619212716","commenter_b":"They are idiots. Why have 19 kids? Whats thier motive? This is called incest.","commenter_a":"Let the legal system work the way it should.","post_message":"Is anyone surprised by this?"},{"comment_id":"10153080762721051","commenter_b":"Set his butt on fire the next time sis.. Light a match and go for it. Learn how to defend yourself.","commenter_a":"It has to do with the fact that even with the strides that women have made in securing rights. Women are still 2nd class citizens we are expendable. The national movement has wrapped itself up in abortion rights as the only right we speak out for. Susanne B Anthony must be rolling in her grave. Shame on us for allowing this to continue. There are currently more women than men worldwide. Withhold that which men hold dear, watch how fast things change.","post_message":"This woman's husband repeatedly abused her. Then he sent her a text message that read, \"In the next 48 hours I will be locked up and you will be dead.\" Despite that, he's still walking free."},{"comment_id":"917736131581794","commenter_b":"If she wants us white people to die bring it I'm locked and loaded she ain't got the balls to","commenter_a":"Now who's the racist.","post_message":"I'm sorry, what?!"}]
