[{"comment_id":"1046419898744877","commenter_b":"What a total moron !!! This woman really was an Amb. at one time ,what an asshol. she is !!!","commenter_a":"They already did you cow!!!!!!!","post_message":"Former Secretary of State Madeleine Albright says that \"nobody is going to die as a result of\" Hillary Clinton's emails."},{"comment_id":"552107031615918","commenter_b":"Jordan get out of here with that nonsense.","commenter_a":"Doesn't affect me. I'll be voting for Bernie.","post_message":"In response to a VICE News FOIA request, a federal judge on Thursday ordered the State Department to release the bulk of the remaining Clinton emails before the February 27 contest."},{"comment_id":"482294165294497","commenter_b":"Our home, our laws. Get out of our country!","commenter_a":"Kick islam out of America.","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"10153221748849087","commenter_b":"@username,where are you from?? You pig!! Photoshop your KKK outfit on your daddy...hahahahahaha","commenter_a":"IT WAS YOU, OBAMA who spoke these words at an Islamic dinner - \"I am one of you.\" IT WAS YOU, OBAMA who on ABC News referenced - \"My Muslim faith.\" IT WAS YOU, OBAMA who gave $100 million in U.S. taxpayer funds to re-build foreign mosques. IT WAS YOU, OBAMA who wrote that in the event of a conflict -\"I will stand with the Muslims.\" IT WAS YOU, OBAMA who assured the Egyptian Foreign Minister that - \"I am a Muslim.\" IT WAS YOU, OBAMA who bowed in submission before the Saudi King. IT WAS YOU, OBAMA who sat for 20 years in a Liberation Theology Church condemning Christianity and professing Marxism. IT WAS YOU, OBAMA who exempted Muslims from penalties under Obamacare that the rest of us have to pay. IT WAS YOU, OBAMA who purposefully omitted - \"endowed by our Creator\" - from your recitation of The ...","post_message":"“I do not believe Sharia is consistent with the Constitution of this country,” Dr. Ben Carson told The Hill. “Muslims feel that their religion is very much a part of your public life and what you do as a public official, and that’s inconsistent with our principles and our Constitution.”"},{"comment_id":"707783986078846","commenter_b":"Ugly bitch man!!!!","commenter_a":"Just plain stupoid","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"1099336866769294","commenter_b":"There great on the grill","commenter_a":"they are nasty things.. we have loads of them out here in Texas.. they tear up pasture land and wreak havoc on vegetation and are very dangerous and have been known to maim and kill people who get too close.. I would seriously not encourage residents to take them out unless they are in a rural area and are familiar with how to use caution in hunting them.. get the parks and wildlife involved.. they better know how to deal with them..","post_message":"Update: Wild pigs that have damaged landscaping at Fairmount Park and other Riverside County areas have caused millions of dollars worth of damage, and officials are warning residents to be careful around the animals.  Read KTLA's story here: @webpagelink"},{"comment_id":"873492039433845","commenter_b":"make all the illegals-legal so thats 10 million persons paying taxes. we could sell the republicans to the dog eating festival. thats say 100 dollars.","commenter_a":"cool give them texas. that would be hilarious!!!!!!","post_message":""}]
