[{"comment_id":"10153184314438984","commenter_b":"This lady is a disgrace to our country. She needs to retire or get voted out so she can get a real life.","commenter_a":"Nancy Pelosi needs to shut up. Who cares what she thinks. She knew what to expect of the speech, stay away. People were there to support the PM not to listen to her senseless sniveling.","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10153349843651051","commenter_b":"She's a stupid bitch","commenter_a":"Aunt Jen, your a money hungry twat.","post_message":"This aunt is suing her 12-year-old nephew for $127,000 over a hug."},{"comment_id":"880649995314349","commenter_b":"What's the hold up? The President cannot be trusted to follow the law. President Obama has repeatedly shown that he will use \"prosecutorial discretion\" to simply refuse to enforce provisions of the existing deportation laws. Marco Rubio originally helped sponsor the Senate bill, but now says that he opposes any immigration reform until the border is secure FIRST. Any immigration reform should first start with verifiable border security -- not 100% since that's not realistic, but verification that almost all illegals are turned away at the border. At the same time, the Visa system needs to be reformed -- people from all over the world enter the U.S. with a tourist visa and then never leave -- the current system fails to track these people and force them to leave. This is not an issue of race; it is an issue of national sovereignty. Only after the Border is secure ...","commenter_a":"I am very impressed, Rep. @username, you nailed it. First, this is a vital issue under the Constitution -- the President cannot simply wish a new law into existence, especially one opposed by Congress, and the Congress MUST assert its Power of the Purse to preserve the balance of power. Otherwise, the Presidency becomes too powerful. Second, this Administration and the Democratic party have been able to accomplish much of their agenda by simply refusing to negotiate, forcing the Republicans to give in. However, the structure of the legislative branch in the Constitution was INTENDED to require compromise to get things done. It is obvious that the Democrats are more concerned with political victories than what is best for the country. This is one time when the Republicans should not, and CANNOT simply acquiesce to the other side who refuses to compromise. We all know that separating DHS funding bill ...","post_message":"I spoke on the House floor to discuss the Department of Homeland Security's funding and challenged our Congress to find solutions. You can watch my remarks here:"},{"comment_id":"386555874837702","commenter_b":"You obviously know nothing about the economy or laws or Russia in general...","commenter_a":"Its nice to see that thier prioritizing With all that going on with thier financial collapse and war in the Ukraine They have made driving xdressed a precedent Just curious... How would one know that the driver is a pyromaniac Will he be the one with the lit flare out the window???!!","post_message":"\"At first glance, it already appears absolutely absurd.\""},{"comment_id":"10154892673543690","commenter_b":"@username Yeah I get it, I'm just evil with white supremacy and global domination on my mind. Nobody with brown or black skin anywhere outside the United States is capable of doing anything wrong, because of white people, right? You're just a victim? I wasn't in the Navy, I am a Marine. But I feel like I have to defend the Navy here. There are sailors representing men and women from every race, not just whites. I guess you didn't know that. You say that the US Navy contributes to human misery but when a tsunami struck Indonesia in 2004, who was there for the rescue effort? When an earthquake struck Nepal, who was there? When a hurricane destroyed Haiti, who was there? I was there distributing food and medical supplies to desperately poor people in Ethiopia and Somalia. The US Navy prevents two-bit pirates with speedboats and AK47's from ...","commenter_a":"All I do is get up to go to work everyday to provide for my family. Ive never oppressed anyone and I Judge people based on the content of their character. I still hear all over the media how I, and people like me, are causing all the problems in this world. I suppose im just tired of it. Please tell me how being born with white skin makes me responsible for societies ills.","post_message":"Marwan Bishara: America needs anger management"},{"comment_id":"10153041862786045","commenter_b":"I also like all those racist flags in your picture reference there.","commenter_a":"What should they expect, the flag does represent slavery and Jim Crow. But I guess folks must cater to the idea that \"Southern Heritage\" must only be represented by the confederate battle flag and not the U.S. flag.","post_message":"Controversy continues to surround the #ConfederateFlag. Two men in Decatur say they were fired from their jobs at Turner Industries because they refused to remove the Confederate Battle Flag from their personal vehicles."},{"comment_id":"10153236342649255","commenter_b":"What can you expect from a LIAR!","commenter_a":"That's why I dislike Christians their not trustworthy.","post_message":"Lies. All of it."}]
