[{"comment_id":"10156282182225354","commenter_b":"Why are they even getting licenses??","commenter_a":"Lord, don't even let me go there, cause my head will explode............","post_message":"Illegal immigrant activists complain that Colorado's illegals aren't getting their driver's licenses issued quick enough. Seriously..."},{"comment_id":"1000663273302101","commenter_b":"Fuck you pig boot licker.","commenter_a":"HAHAHAHAHA. Just because they be black,,,,,,,,you think yo sorry black asses BE safe with Islamists \"protecting\" yo ASSES? HAHAHAHAHA","post_message":"The police thought they were the only alternative for security. They just found out that there are many groups willing to do their jobs for them, for cheaper and with more accountability if they mess up! Do you support this move? Or will their be utter chaos without the police there? Follow >> (Y) Counter Current News for the latest!"},{"comment_id":"2026860724207699","commenter_b":"Dumb bitch","commenter_a":"leftist hypocrite","post_message":"Racist blacks cried foul when Republicans wouldn't support the policies of Barack Obama. But what are you if you don't support Trump? For Leftists, a hero."},{"comment_id":"10152929070861336","commenter_b":"They're still human beings escaping horrible working conditions, some of these people don't even have the education or access to resources to migrate legally. So, our government is going to arrange for them to be able to live in peace and be employed in jobs that most people wouldn't take. And they'll be grateful. Sounds like the rush of immigrants that came over in the 1800's. Maybe you need to chill out instead of being knee-jerk reactionists like the anti-immigration groups from back then.","commenter_a":"Idiots both of them","post_message":"U.S. Attorney General nominee Loretta Lynch said she believed in an illegal immigrant's \"right\" and \"obligation to work\" during Wednesday’s confirmation hearing."},{"comment_id":"1086551791461598","commenter_b":"oboma is kissing hillerys ass cause she going to put him in the supreme court sit .Lord please don't let this evil. women win .","commenter_a":"It will be the end of the America our founding fathers put together","post_message":"ClashDaily.com"},{"comment_id":"10153816646376336","commenter_b":"They think that are comedians!:) seriously??? They are not funny at all! These women on the view are ugly and boring! I am still at a loss who watches this show?","commenter_a":"Let's don't get started about people's looks .","post_message":"“If you meant [the] comment about my face being demented as a Halloween mask as humor, so be it… I have a real thick skin,\" Carly Fiorina fired back."},{"comment_id":"10153664512035530","commenter_b":"Ya Chaldean girls are cute ;) lol","commenter_a":"Honestly it's about half right. But if you want to talk about the Metro Detroit area as a whole there are some really beautiful women in the area. I was at Exodos rooftop (in Greektown) in the Summer a couple years back talking to a girl that was there from Philly and she said how good looking everyone was. The Albanian and Chaldean women in Metro Detroit are GORGEOUS. The city itself might not be the prettiest but there are some beautiful foreign women in the area. But I know the article wasn't just focused on the people.","post_message":"Detroit takes it on the chin in this survey based on nightlife, setting, hot locals and \"an undercurrent of desire.\""}]
