[{"comment_id":"466002853760417","commenter_b":"Screw your health care - you can buy a freaking wall instead America.","commenter_a":"Trump suffers from major PARANOIA....💰💵😎","post_message":"Speaker Paul Ryan on President Trump's executive order to build a wall on the U.S.-Mexico border: \"We're going to pay for it and front the money.\" Watch Greta Van Susteren's full interview with Speaker Ryan. @webpagelink"},{"comment_id":"980526942073728","commenter_b":"Don't forget Mexicans I'm white.. had four kids ,a lazy ass dead beat American wouldn't pay child support on ,I met a 22 year old Mexican illegal I was 29 ..4 kids this man married me raised my four kids we had two of our own so 6 kids to raise Got my first home got his papers fixed got a home in Mexico My soul mate best friend passed away at age 47 working his self to death for his kids so build your damn wall Trump., IF ...you get president there are good men from Mexico I had the best","commenter_a":"What gets me is if people don't like Hillary Clinton then why do you come to @username. Others don't want to hear from Donald Frump supporters.The man is nothing but a racist,bigot,moron, and an idiot.And that's just being nice! Bill Maher gave Mr. Frump the perfect name. Whiney Little Bitch because that's all he does.Hillary will take him down and win. Just my opinion.","post_message":"BOOM! And there you have it! Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"508257596043081","commenter_b":"His wife destroyed that college but gave herself $200k severance pay. They are crooks","commenter_a":"If Sanders were to be nominated and elected in Nov, big problem is that he has not raised money, or campaigned for, congressional Democratic candidates. In other words, Sanders will be no better off than Obama has been if he can't get enough members of Congress to pass his initiatives.","post_message":"The attacks are going to get more unhinged."},{"comment_id":"10154660100050575","commenter_b":"Is she one of those nasty girls with nasty feet","commenter_a":"Funny how Americans don't like crooks","post_message":"Oh, my!!"},{"comment_id":"996230513733330","commenter_b":"Hillary would then round up JEWS if she could ... Thats been done by HITLER","commenter_a":"How big of a f-----n idiot can some one that is running for office be she is going way to for","post_message":"BREAKING: Hillary Clinton accuses GOP of wanting to implement Nazi tactics."},{"comment_id":"588870771303502","commenter_b":"He should be deported. Hillary should be charged for her recent money scam","commenter_a":"lmmfao","post_message":"Obama is formally being charged with treason. He is getting it from all angles. Now is our time to push. Should Obama serve time for his crimes?"},{"comment_id":"956407617772796","commenter_b":"Really?? No, really. Once again giving twits a bad name!","commenter_a":"Whites freed,WTF How many Northern soldiers had to die for southerners idea that it is ok to enslave others.Sad thing is there's still bands of ignorant racist That still feel the same way now a days.","post_message":"Leave it to two David Barton and Glenn Beck to have a historically inaccurate and completely offensive conversation about race... Shared by Occupy Democrats, LIKE our page for more!"}]
