[{"comment_id":"10153254996144099","commenter_b":"Darlene is just another brainwashed white women who think all blacks are 'misunderstood'","commenter_a":"with all the training they get they can not subdue a guy with a hammer???","post_message":"UPDATE: Police and multiple sources initially said the man was dead, though authorities later said he was hospitalized in extremely critical condition.  #BREAKING: Hammer-wielding suspect shot dead after trying to hit officer, police say @webpagelink"},{"comment_id":"1177607535665632","commenter_b":"That is sickening! Who are these wild, viscious, beasts that we allow to walk our streets with a loaded weapon 'in the name of the LAW'? They are just low life sub 60 IQ, sociopaths. They are over paid and forget who signs thier paychecks. Wake up Americans!","commenter_a":"That poor soul...you can see his body struggling to stay alive. I sure hope these fuckin cops don't get away with this...disgusting!","post_message":"There was no reason to kill him."},{"comment_id":"10154423071206336","commenter_b":"Was she deserves to do is pull her name off the ballot and put yourself in Sing Sing for 25 years","commenter_a":"I wouldn't want it anyway. It would not be sincere.","post_message":"Question Of The Day: Does Hillary Clinton owe the American people an apology for lying about her server scandal? #Hannity"},{"comment_id":"666476586876253","commenter_b":"She needs to worry about herself ugly!!!!","commenter_a":"No me jodas... ...","post_message":"Controversial video just leaked that shows what Michelle thinks about white people.  This is extremely offensive. We need to spread this, and show the country she's a racist.  Do you agree Michelle Obama is the worst first lady ever?"},{"comment_id":"10156284616795354","commenter_b":"Lol, they weren't immigrants.","commenter_a":"Immigrants....","post_message":"What in the world is going on?"},{"comment_id":"10154600253629170","commenter_b":"All the hildebeast fears is losing the election and facing her well deserved comeuppance .","commenter_a":"The FBI said that she had no intent when she broke the law, but Trey Gowdy said in the documents they received from the FBI, that there were no questions to probe if there was any intent. No questions of why, she had a private server. No questions at all, to prove intent. Sounds very fishy. They ( the FBI) just threw that in, ( No intent ) to get her off , from all the crimes that she committed","post_message":"The one thing she fears the most."},{"comment_id":"1954618021430775","commenter_b":"It aint over till the fat lady sings,lol","commenter_a":"Mark my words, in future presidential elections, candidates will try to do what Donald Trump is doing.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
