[{"comment_id":"10153348611360950","commenter_b":"And he got arrested? For what? Bitch probably asked for it","commenter_a":"NEEDLE TIME NOW. Not 50 years later.","post_message":"Officials believe the 19-year-old suspect was upset over \"a bad breakup\" with the victim's teen daughter. Police say he confronted the mother as she was leaving her car, shot her multiple times and then went inside her home and fatally shot a dog."},{"comment_id":"10153266523095927","commenter_b":"Should have BABY MURDERER on the FRONT of that DRESS!!","commenter_a":"DISGUSTING!!","post_message":"Dress is part of a social media campaign that encourages women to share \"POSITIVE STORIES about their abortion experience ...\""},{"comment_id":"1773091102960388","commenter_b":"FBI Director Comey states that \"There is no evidence that Hillary Clinton lied\".","commenter_a":"I'm not a Republican by any stretch of the imagination, but at least we can find some common ground on the Hillary Clinton issue. It's completely insane that the DNC has supported her this whole time. She, along with Bush and Cheney, need to be in jail. Let's stop allowing these people on both sides to be above the law.","post_message":"The Director of National Intelligence should deny Hillary Clinton access to classified information given how she so recklessly handled it as Secretary of State."},{"comment_id":"486025081592014","commenter_b":"I really really want her to go to jail","commenter_a":"This lying bitch only knows how to take care of her greedy self!!!!","post_message":"Hillary Clinton criticizes Republican Donald Trump's tax plan, calling it \"trickle down economics on steroids.\" Do you agree or disagree with Clinton on this?"},{"comment_id":"1333030216717005","commenter_b":"She has no talent and is trash","commenter_a":"Levy a fine, and move on. That show was one of the best in a long time. Grande was very good.","post_message":"Singer and actress Ariana Grande surprised the \"Saturday Night Live\" audience and crew with an unexpected profanity during her monologue."},{"comment_id":"1022535797795443","commenter_b":"hahaha good one, and accurate.","commenter_a":"I flushed something more qualified than both of them this morning.","post_message":"LOL..."},{"comment_id":"1907053972848209","commenter_b":"THROW THIS BITCH OUT OF THE COUNTRY. PLEASE","commenter_a":"not my president","post_message":"She isn't backing down."}]
