[{"comment_id":"10156156980300615","commenter_b":"You think most women are going to wear a gun strapped to their hip or chest so that it is visible? Are you serious?","commenter_a":"Open carry idiots should connect with this, since they are such dickheads.","post_message":"What's wrong with this picture? In Texas it will soon be legal to carry a gun on campus but not a red plastic penis."},{"comment_id":"10153469659427042","commenter_b":"She's getting a life now getting away from that abrasive idiot.....stop with the marriage BS married or not no woman should be abused","commenter_a":"It means there not married right!! Now they have a child with no Dad , that's why Hashem laws say first we get married than have children . Are actions will let us all see our Rebbe King Moshich . She should get a life. Yechi Hamelech","post_message":"\"I have the courage to actually do something about it this time.\""},{"comment_id":"10152535254222623","commenter_b":"It'd be great if people actually read, studied and paid attention in school and did something with their lives except screwing, rolling blunts, and figuring out ways to commit crimes.","commenter_a":"Look at the parents. Poor child","post_message":"A mother and father have been charged after police found video of a baby playing with a real handgun."},{"comment_id":"421180878069520","commenter_b":"^^ this idiot supports sanctuary cities and providing safe harbor to illegal alien criminals","commenter_a":"Hillary belongs in prison.","post_message":"More than $400 million has poured into the presidential race so far."},{"comment_id":"1382362188508980","commenter_b":"You ass dont belong on a road unless it has wheels on it who raised these nuts?","commenter_a":"Yes","post_message":"Liberal protesters are furious after a new bill introduced by a state lawmaker... here's why this could cause a lot more \"accidents\" when these lefties block highways.  Do you support this bill?"},{"comment_id":"10153258826178812","commenter_b":"women are such babies","commenter_a":"Is it necessary to show this photo? This was someone's child, a little more respect would be great. Rest in Heaven, thank you for your service","post_message":"Navy officials: Navy SEAL killed in parachute accident in California: @webpagelink"},{"comment_id":"10153255421196028","commenter_b":"AMERICA IS MY COUNTRY AND I SPEAK ENGLISH!!!!! ENGLISH ONLY IN AMERICA. NOT SPANISH. I have nothing against latinos BUT come here and get legal.. speak English.. STOP HAVING BAMBINOS IN AMERICA SO WE PAY FOR IT.","commenter_a":"@username, I hope one day you decide to go home as well. Maybe to your own country? Thank you.","post_message":"\"I feel hope again.\" Lorenza Cardenas and her two daughters were living in a small storage unit in a San Diego junkyard -- until things finally turned around for the family: @webpagelink"}]
