[{"comment_id":"1030656443730298","commenter_b":"'Socialism never took root in America because the poor see themselves not as an exploited proletariat but as temporarily embarrassed millionaires.' John Steinbeck","commenter_a":"Fight Bernie Fight for us all!!!!!! We need u!!!! The Dark Side of the Force will be strong with this administration.....","post_message":"Trump is assembling the wealthiest cabinet in history — so wealthy that its members have more money than the bottom 1/3 of American households combined. That does not sound like an 'anti-establishment' administration to me."},{"comment_id":"878409832218766","commenter_b":"Too lazy to be princess! Punish her to work at Royal Household!","commenter_a":"Like mother like daughter","post_message":"‘Scrounger’ Beatrice’s three holidays in a MONTH"},{"comment_id":"10156168064325594","commenter_b":"Asians women are Crazy hands down!","commenter_a":"Well this certainly doesn't fit the regular narrative.","post_message":"The tearful and frantic 911 call was clear: “We got into a fight. I stabbed him. He’s bleeding.”"},{"comment_id":"10153127223956800","commenter_b":"Jodi, you are a serious bitch. And an ableist, uninformed, obnoxious bitch at that.","commenter_a":"I urge every parent with a child with autism (I have two children dx autism) to seek out proper IGenex testing for Lyme. Lyme mimics autism. Both of my children recovered from autism w proper Lyme treatment.","post_message":"'The whole show is about raising money -- not to cure autism. Because a lot of people are working on biomedical research. My wife and I couldn't get our kid into any kind of school or program that was adequate for him until he was 7 years old. And people with fewer resources than us -- it's unimaginable to us what they have to go through. And the kids. They deserve better.” — Robert Smigel discusses Night of Too Many Stars   ► Watch the interview: @webpagelink ► Support autism programs: @webpagelink"},{"comment_id":"1007362382702564","commenter_b":"That's uncle Ernie sitting on the eggs","commenter_a":"'@username get off of here!","post_message":"ONE EGG IS HATCHING! Eaglet Watch 2016 continues as Harriet and her mate M15 wait for their two eaglets to hatch. One egg began to crack yesterday! Fingers crossed we get an eaglet today!   Once an eagle egg begins to crack, it can take 12 to 48 hours for the eaglet to fully hatch.   Live video: Southwest Florida Eagle Cam MORE: @webpagelink"},{"comment_id":"1194513290647275","commenter_b":"Yep and a drunk driver that got behind of the wheel of a car but didn't hurt anyone should not be taken away from their family and put in jail when they were caught????","commenter_a":"She's a threat to no one. They just took a mother from he children who were born in this country!! We are the one's who are threatening the lives of people who trusted us and came here to make their lives better, just like Trumps mother did. Just think, if they had sent her back we wouldn't be dealing with this heartless man! What a blessing that would be. He's done more damage in less than 3 weeks than Nixon did in about 6 years and he wasn't this bad!!","post_message":"Immigration agents “said she’s a threat, but my wife isn’t a threat,” her husband said in an interview."},{"comment_id":"10152949520761519","commenter_b":"FWIW: Jesse, I love your points of view. Over the years your passion and knowledge have helped me evolve my own perspectives on politics and the news. However, I respectfully disagree with your use of pejorative terms to describe women in this fashion. I think it is as much demeaning to you, and women at large, as it is to the targets of your invective. I respect your assertion of your right to use these terms, and you have articulated to me in the past why you choose to use them. I respectfully disagree with it.","commenter_a":"Those Fox News bitches really whore it up with the make up, don't they?","post_message":"'You can’t separate fiscal issues from social issues...'"}]
