[{"comment_id":"1119120924851115","commenter_b":"You're a misogynistic prick who probably doesn't get laid often. Go masturbate or something.","commenter_a":"Aww poor babies couldn't handle a wittle emotional turbulence? Fuck you, you are such testicles (in lieu of pussies, which can actually take quite a pounding).","post_message":"Depression, muscle pain, mood swings, acne, and changes in libido – sound familiar?"},{"comment_id":"10152962778127411","commenter_b":"Not in Texas! It's illegal!","commenter_a":"So the f what....... it's not illegal to smoke marijuana. The question is, how'd she get it while in custody? Aren't all the jails covered in cctv cameras? Where is the footage? WHO gave her the weed? is that also the same person who murdered her?","post_message":"SANDRA BLAND: A toxicology report has been released showing the levels of THC in Sandra Bland's system were so high, some experts believe she either smoked marijuana in jail or was a chronic pot smoker."},{"comment_id":"1173905836039000","commenter_b":"She's not my plan b.","commenter_a":", Sanders is a good man, sad what the DNC did to him, they rigged the rules against him, Hillary is running all the way to the bank laughing her big fat @ss off, this Democrat will not vote for that money sucking Hag !!","post_message":"Bernie Sanders shoots some hoops with NBC's Chris Jansing. More from the court: @webpagelink"},{"comment_id":"10153560422922629","commenter_b":"Hell yeah bitch","commenter_a":"This post glorifies violent masculinity.","post_message":"Two apparent members of the U.S. Marine Corps reportedly overpowered and halted the gunman."},{"comment_id":"628508020691140","commenter_b":"Put her out of the white house","commenter_a":"Michelle Obama is a awesome person she certainly a lady of class.","post_message":"Michelle Obama has just broke the last straw. She should have been kicked out of the White House a long time ago. Do you think Michelle Obama is the worst first lady in history?"},{"comment_id":"10154356809342654","commenter_b":"DEPORTATE ALL IMMIGRANTS ILLEGAL! God Bless US .","commenter_a":"All the people walking there equals one mexican party or quince lmfao","post_message":"Immigrants who work at dozens of restaurants around Washington, D.C. are participating in the Without Immigrants protest. We're live at Pizzeria Paradiso (Dupont Circle) where managers are trying to get by without their employees AND we're live at the site where protesters are organizing."},{"comment_id":"10157243305955354","commenter_b":"Then get to work.","commenter_a":"She could move out of her government subsidized housing if she actually had any employable skills.","post_message":""}]
