[{"comment_id":"10154689577603812","commenter_b":"He also has many lawsuits in the 80's and 90's for discrimination against blacks and people of color.","commenter_a":"TRUMP STOOD UP FOR BLACKS AND JEWS: About 20 years ago the rich elites ran Palm Beach and wouldn allow Jews and blacks to use the golf and country club facilities. When he bought Mar-a-lago, MR. TRUMP WENT TO COURT TO END THAT DISCRIMINATION, won in court and forever changed how minorities are treated in Palm Beach. That THE REAL Donald Trump. What has Hillary or ANY politician done? @webpagelink","post_message":"A potentially record-breaking gap between two groups marks one of the most striking elements of preferences in the 2016 presidential race: college-educated white women for Hillary Clinton vs. non-college white men for Donald J. Trump."},{"comment_id":"893860944043492","commenter_b":"Theres nothing \"hateful\" about 1) secure the border 2) Enforce the immigration laws. In fact every country, including Mexico, does this. People ARE angry. For good reason. As we see our country being ruined by endless millions of incading illegal aliens.","commenter_a":"Its very simple. 1) Enforce our immigration laws. 2) Secure our borders. By the way, that's how all the other countries try and deal with immigration. The rest of this nonsense is just typical liberal delusions","post_message":"End of a DREAM?"},{"comment_id":"10154135528287541","commenter_b":"Cops can not go around just asking people to show their ID without them committing a crime or breaking the Law!!!","commenter_a":"The Police needs to know and learn what the Law actually states!!! Because what they did is against the Law... American Citizens do have Rights!!! If they oppose to it or not!!! The cops should not be above the Law!!!","post_message":"They Tasered a black man in the face who was actually a part of their team."},{"comment_id":"1819541594934723","commenter_b":"Why caught, why is that bitch alive.","commenter_a":"Oh well","post_message":"At least they got the scum bag! @webpagelink"},{"comment_id":"10153134474569369","commenter_b":"@username so then bill Russell should be the greatest to ever play if where talking about rings you idiot SMH it's not about the rings stupid head","commenter_a":"M. J. Loyal to his team.","post_message":"It's one of the big sporting questions of our time."},{"comment_id":"10154125606926615","commenter_b":"Those mountains r no joke girl","commenter_a":"For a few inches of snow????","post_message":"11 ALERT: Several school districts have decided to send students home early today, before the snow begins to fall. Keep checking this link for updates. FULL LIST: @webpagelink"},{"comment_id":"10153387791927690","commenter_b":"Amen. If another female in heat walked by, he'd have been on it. He's safe now. But if both had been fixed, neither would have been out by the road.","commenter_a":"Dogs are indeed wonderful. This is a sad story and an all too common story. However, as is the case in many of these sad stories, the male gets loose to chase a female that is in heat. She gets hit by a car and he refuses to leave her side , not because they were best friends or because he is a loyal friend, but rather because he is fixated on the female in heat. The moral of this sad story should be to have your dogs fixed.","post_message":"A heart-wrenching photo tells the story of a loyal dog found by his friend side Sunday morning in Dallas: @webpagelink"}]
