[{"comment_id":"10154963214296178","commenter_b":"Did that woman just get out of bed ?","commenter_a":"How is he behaving like an authoritarian? By having the EPA enforce regulations that Congress wouldn't pass? By giving amnesty to people who are here illegally, with his pen and phone? By allowing an underling to leave men for dead in Benghazi because it was politically expedient?","post_message":"According to Brian Stelter, Donald Trump is acting like the leader of an \"authoritarian regime.\" His solution? Have the media act MORE biased."},{"comment_id":"10153017975939205","commenter_b":"Well you'll have to fuck off back to Europe then, cunts !","commenter_a":"I worship Ana.....Every square inch...","post_message":"Who knew Jesus was against immigration!"},{"comment_id":"10153924246056800","commenter_b":"Bye Felicia","commenter_a":"I can't! Im done with this show....this used to be one of my favorite shows that would tell it more or less like it was. But now its just a one sided political agenda. Goodbye daily show may you rest in peace","post_message":"Activist DeRay Mckesson talks about the tenets of the Black Lives Matter movement."},{"comment_id":"1834672043468268","commenter_b":"Well if she wants to waste her money.... Whatever","commenter_a":"wasted money","post_message":"Actress Meryl Streep loves throwing her money into politics. Particularly when it involves Barack Obama and Hillary Clinton."},{"comment_id":"624483627700413","commenter_b":"Someone gets it.","commenter_a":"Awesome, telling them to get a job is not on the list.","post_message":"Think what you're doing helps the homeless? Maybe it's time to think again. ~Amy"},{"comment_id":"10152731106111051","commenter_b":"Yet if you speak out against it, you are \"behind the times\" or \"living in the past\". We need to turn the clock back about 50 years to see what a moral society looks like and I am not just talking about the gay agenda. I am talking about adultery, divorce, teenage pregnancy, children born out of wedlock and anything else that used to be immoral that we are forced to accept today.","commenter_a":"Um, did they leave the word \"incest\" out of the story on accident??","post_message":"This girl never really knew her father – until they ended up dating."},{"comment_id":"10153473976261438","commenter_b":"Shut the fuck up attention whore","commenter_a":"Trump for president. Enough is enough, its time to get tough. Make America great again.","post_message":"What if Trump's polling ceiling is much higher than we thought?"}]
