[{"comment_id":"10153295318271130","commenter_b":"Then those girls who don't know how to do that stuff better learn. Especially the condoms. That's both partners responsibility.","commenter_a":"And I am sure girls do not know how to buy their guys condoms, strap-ons and penis rings. So what???","post_message":"They didn't have a chance."},{"comment_id":"1302858003140584","commenter_b":"Hillary is a war monger. You think There would be peace if she was elected?","commenter_a":"He will destroy this country parents get ready to send your children to war","post_message":"Nailed it."},{"comment_id":"1560631690895039","commenter_b":"Good for his ASS. I hope they rape him in prison nite and day. Carma is a BITCH lol","commenter_a":"the sentence is more lenient than what he deserves","post_message":"There is no punishment severe enough for these heinous crimes."},{"comment_id":"1193495714026101","commenter_b":"If they can live by our laws get out of our country","commenter_a":"Amen !!!!!!!!!! They must be stopped from take over and destruction. All states please follow. Help us keep our great nation. !!!!!!!!!!","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"10153511898009087","commenter_b":"Look at the lies thay have in office today everyone of them for nothing but money .and there's nothing wrong with what trump personally done. .there trash on everyone .","commenter_a":"You will not turn a single vote away from trump support ers .you will only make more people for trump .","post_message":"'I stand by every question I asked [Donald Trump] and he was not the only one who had tough questions,” Megyn Kelly said. “He was the only one, however, who complained.” WATCH:"},{"comment_id":"10152713958671051","commenter_b":"Note, Date women closer to your age.","commenter_a":"Be careful in what you want!","post_message":"A 69-year-old man thought he and his 17-year-old girlfriend had something truly special. You can probably guess how this story ends."},{"comment_id":"10155020907765329","commenter_b":"I mean fuck the patriarchy, but like FUCK the patriarchy... amiright?","commenter_a":"'@username #17 please","post_message":"So your dirty mind can go back to school."}]
