[{"comment_id":"947171632075323","commenter_b":"She can put them in her house","commenter_a":"She is insignificant.","post_message":"Now Amal Clooney slams Britain!"},{"comment_id":"1110306035681925","commenter_b":"She's a evil hypocrite","commenter_a":"Good point!","post_message":"'Hillary Clinton doesn’t miss an opportunity to ridicule Donald Trump’s illegal immigration solution of a wall on the southern border — but that’s exactly what she’s deployed to keep undesirables away from her.'"},{"comment_id":"2193117860914394","commenter_b":"As if I would let her lick my face when she cleans her asshole 😂😂😂 come on now","commenter_a":"@username Munro","post_message":"It's not just gross, it's dangerous."},{"comment_id":"609436732514253","commenter_b":"She is a bitch","commenter_a":"Obama deserves no respect People who turn away from the very truth that is staring them in the face, will learn all too soon what these represent. This will be the beginning of the end. People have no idea what Hilary and Obama are doing behind our backs. Their evil and hatred goes much deeper and more wide spread than you can imagine. This is not a joke, it is coming.","post_message":"Some say this sign is extremely disrespectful to President Obama and should be removed on that basis alone. This man says it's his property, and the First Amendment gives him the right to keep the sign up. Decide for yourselves who is right."},{"comment_id":"1440023386030632","commenter_b":"Amen","commenter_a":"It's really a fresh wind","post_message":"Find out why Judea and Samaria leaders say, 'a new wind is blowing from the US.'"},{"comment_id":"982852498479883","commenter_b":"racist hater sit down and shut up","commenter_a":"Oh, sure, especially the way he goes to other countries and slams the US, apologizes for America and bows to other world leaders and racist michelle complains that she wakes up in a house built by slaves, was not proud of her country til barry started destroying it and spends millions of taxpayer dollars taking her huge crew on vacation around the world. They are an embarrassment.","post_message":"Are you proud to have the Obamas representing America around the world?"},{"comment_id":"10157696214715603","commenter_b":"Lol @username not gonna happen","commenter_a":"Don't believe the media...Hillary's poll numbers are falling faster than Bill Clinton's pants in an Arkansas trailer park...","post_message":"Hillary Clinton forcefully challenged the FBI's new email inquiry Monday, declaring during a campaign rally in battleground Ohio, \"There's no case here.\""}]
