[{"comment_id":"727321410703321","commenter_b":"She is gross","commenter_a":"WILEY CYRUS","post_message":"Her parent's must be so proud! Smh..."},{"comment_id":"10153371305674575","commenter_b":"Strip the Super Bowl, the ring, one year suspension (if not more) and mega fines","commenter_a":"He makes millions of dollars you think four games is really going to teach him a lesson? Dude strip the superbowl from them. Didn't you learn that a slap on the hand solves nothing!","post_message":"#BREAKING: Tom Brady has been suspended for the first four games of the season for his role in #Deflategate. Among other punishments, the Patriots were fined $1 million.  Brady will return from his suspension the week the Indianapolis Colts take on the Patriots at Lucas Oil Stadium."},{"comment_id":"10153956657931336","commenter_b":"Amen she needs to go to jail u r correct","commenter_a":"112 million raised and supposedly all from minorities and women. This woman is the single biggest threat to our country. She is actually worse than Obama and as we know that is as bad as it gets. The nazi queen needs to go to prison","post_message":"The Hillary Clinton campaign said that puts her total raised in 2015 to spend on the presidential primary campaign at $112 million."},{"comment_id":"1241832409215206","commenter_b":"She is a bitch and a ugly one.","commenter_a":"back off","post_message":"Michelle Obama is leaving her mark before she leaves. She wants to shut down our National museums for this absurd reason. Do you think Michelle Obama is a racist?"},{"comment_id":"10154291212970329","commenter_b":"hahahaha!! for real though!","commenter_a":"Hahaha @username Alyssa Purnell Mimi Zink @username @username","post_message":"oh heeyyyy (via So Relatable)"},{"comment_id":"10154930329184411","commenter_b":"eeehh how much cost an ukranian whore that can make this? 20 euros?","commenter_a":"OH someone throw these naked chicks money and maybe they'll start dancing to finally enterain us","post_message":"'Ukraine to EU', 'Break the Wall': The one-woman demonstration."},{"comment_id":"10153109185578812","commenter_b":"I hope people know the women in Iowa aren't all like her.","commenter_a":"I'm from Iowa. So embarrassing!","post_message":"The Republican Response to #SOTU2015: Who is Joni Ernst?"}]
