[{"comment_id":"1025513424232102","commenter_b":"THAT BITCH NEVER HAD A MIND","commenter_a":"Who's gives a fling f--k what these assholes say .nobody watches that so called show anyway.get ready to pack bitch","post_message":"I think I can see steam coming from her ears! @webpagelink"},{"comment_id":"10153668004231037","commenter_b":"Good they can all go to jail with her too","commenter_a":"America is a sick country","post_message":"About 300 people gathered outside of the Kentucky jail on Saturday to show support for Kim Davis."},{"comment_id":"10150620952809999","commenter_b":"You people don't get it. Keep sticking your heads in the sand. You focus on what he says and not what Hillary has done","commenter_a":"Dump Trump.","post_message":"The P.G.A. became the first major golf organization to pull an event from one of Donald J. Trump's properties in response to his comments about Mexican immigrants."},{"comment_id":"1220979514606949","commenter_b":"That's always the answer huh fellas,if you feel this strong about it how about throwing some fist,oh I forgot you can't fight without guns.","commenter_a":"Until the authorities start treating these \"protestors\" Like the domestic Terrorists they are the riots will continue. And they will get worse! Time to take off the PC shackles and get down to business! It all starts from the top. As long as the Democrats are in the White House this will get worse. Elect Trump 2016.","post_message":"Many people have been arrested in Charlotte, North Carolina after the past several days of protesting and rioting. 70% of those who have been arrested have something in common, and it leads to a lot more questions about who is really behind all this..."},{"comment_id":"10152578291366636","commenter_b":"But I'm not joking. Why would a western woman live there ?","commenter_a":"A list of things that doesn't offend these clowns needs to be published. How can any intelligent women move to this place?","post_message":"Pakistan is not happy with Imran Khan's new wife..."},{"comment_id":"1086347321421796","commenter_b":"Oh my, kicking out the Black Lives Matter people AGAIN during your Atlanta, GA rally. Second time in how many days, Shill? Awww, she loves the Blacks, she sure does, except for when they might just question her. @webpagelink","commenter_a":"I was one of them too! Now I'm a 29 year old man and I'm voting for Hillary!! You had our back and now we have yours!!","post_message":"Eight million kids have healthier lives and brighter futures thanks to the Children’s Health Insurance Program. Connar is one of them."},{"comment_id":"10153342829529170","commenter_b":"Then STOP Them, enough already!!!","commenter_a":"homegrown terrorist and a president that wants Americans Disarmed.......YEA, THAT'LL WORK!","post_message":"If you're a liberal claiming ISIS doesn't exist inside the US, Barack Obama's own FBI Director has a message for you...."}]
