[{"comment_id":"10153888628981336","commenter_b":"@username - your brain is a mulsim! SHUT ALL \"DOORS\"!! KILL ALL muslim islams!! The only people who hate Trump are the illegals, anchor babies, muslims! Again, I ask, which one are you or are you all three? I demand to block ALL ILLEGAL aliens; muslim islams, to PROTECT OUR borders! Then IMPEACH obama blammer mouth!","commenter_a":"Obama can't help it. His father was a Muslim, not an American. His allegiance is pretty clear.","post_message":"Yesterday on \"America's News Headquarters,\" Mike Huckabee shared his perspective in light of the #SanBernardino terror attack."},{"comment_id":"10153988463481077","commenter_b":"If this is true, shame on her! She should be charged too!","commenter_a":"So she knew about it before it happened?","post_message":"Mateen's current wife told the FBI that she was with him when he bought ammunition and a holster, and that she once drove him to Pulse because he wanted to scope it out."},{"comment_id":"10157240650595294","commenter_b":"Nice dress","commenter_a":"I hope we get rain.","post_message":"Will rain get in the way of your Fourth of July celebrations? Jenn Harcher, Meteorologist is going to let us know!"},{"comment_id":"987087694644317","commenter_b":"Babies gotta eat . If you don't like it don't look . If you want to fight something, fight the laws that deal with drunk drivers . Come on America WAKE UP !","commenter_a":"Well said @username","post_message":"Dozens of mothers staged a \"nurse in\" in front of the state Capitol building today in nationwide movement. What do you think? A. I'm glad these moms are standing up for their rights B. Attention to \"discrimination against breastfeeding\" is needed C. This wasn't needed D. That's fine, we just don't need to see it E. Your own answer"},{"comment_id":"10155024202814703","commenter_b":"America has American terrorist's as well. Why no effort on banning them, or shipping them out of our Country???","commenter_a":"Bet you never thought you would see planes crash intentionally into buildings either","post_message":"Thoughts?"},{"comment_id":"728722383954381","commenter_b":"this shit sad most if not all terrorist are from s Arabia and suni.. it hasn't even been 1 Iranian terrorist. and they fund ppl to defend they city that's not called funding terrorist. fuck trump AZ a U.S. citizen. I'm a shame of this racis country. that's why I fucking moved. fuck that bitch and his racis face. let that bitch try to come fuck w iran and see what happens. wer not Iraq or Syria. none of that. we strong. and we got them nukes and Russia and China fuck w us. let Israel bitch ass make move😎fuck Israel and s Arabia","commenter_a":"Should be interesting to see this brought up in Surpreme Court...","post_message":"The Muslim (country) ban."},{"comment_id":"10158293361345725","commenter_b":"Well mother nature must be a murderer because women spontaneously abort all the time. It's called a miscarriage.","commenter_a":"Although I consider myself a Progressive, I have to agree that abortion is murder. That is one thing that I agree with the Republicans. Not because of their political beliefs but me as a human being. Murder is murder and we shouldn't give permission to commit it.","post_message":"Ohio Governor John Kasich has signed a bill imposing a 20-week abortion ban, in a prelude to the broad offensive abortion-rights opponents plan to launch across the nation in January."}]
