[{"comment_id":"759924327531478","commenter_b":"Just showing up is prolblem for me. Trash that is all she is","commenter_a":"Yes","post_message":"You Won't Believe What Hillary Clinton Was Caught Doing During Nancy Reagan's Funeral This is really does speak volumes to what kind of person she really is. Do you think Hillary Clinton would make a terrible president?"},{"comment_id":"742612555896157","commenter_b":"We need women unless you enjoy cocks in your ass","commenter_a":"FINALLY WE CAN GET RID OF THE PLAGUE CALLED WOMEN","post_message":"The infants were carried to full term, and seem to have no health problems."},{"comment_id":"10154427228206162","commenter_b":"Clearly the women in this case is at fault she bought the cheaper tickets and tried to pull a fast one.","commenter_a":"Leave it to ABC news to make a bigger deal out of a story than what it should be.","post_message":"A mother was devastated after she and her five children were forced off an Amtrak train in the middle of the night. READ MORE: @webpagelink"},{"comment_id":"566112886870821","commenter_b":"another one to kiss that ring and feet","commenter_a":"if donald trump is a racist why to people of many different races show up to his rallies? why aren't they kicked out? He hasn't singled out any one particular ethnic group that he has singled out by saying he hates them.","post_message":"Welp, Donald Trump sure has that racist vote down pat. -Conover"},{"comment_id":"10153075860699614","commenter_b":"A women should know her body lets slit her throat!!","commenter_a":"@username I understand what you're saying I've been through it also 3 times but when you see your babies all thoughts of dying and killing go away post part um depression it's just an excuse","post_message":"A young mother in Olympia, Washington, allegedly told police that she slashed the throats of her 6-month-old twins and 2-year-old daughter to keep them quiet for her husband. Christina Booth, who is believed to be suffering from postpartum depression, made a 911 call Saturday sobbing and screaming at the operator that her children would not stop crying. When police arrived they found the twins on the couch crying \"uncontrollably\" and \"bleeding from their necks.\" The 2-year-old was upstairs with a similar wound. All three survived their injuries. Booth allegedly told police \"she knew if she killed all the kids the house would be quiet\" for her husband \"who gets annoyed when the children cry.\" Read KTLA's story here: @webpagelink"},{"comment_id":"2070583743040341","commenter_b":"Go Back to your own Country!!!","commenter_a":"What scum is voting these things into office?","post_message":""},{"comment_id":"1146546865428217","commenter_b":"Melania doesn't even know where she is right now...","commenter_a":"Yep preparation H.","post_message":"Donald Trump and Hillary Clinton attend the Al Smith Dinner in New York"}]
