[{"comment_id":"10153307590149087","commenter_b":"Bitch got a face like a monkeys nut sack....to friggin ugly to be president","commenter_a":"Of course....he rocks!","post_message":"A poll of Iowa voters found Dr. Ben Carson decisively defeating Hillary Clinton in a hypothetical general election matchup."},{"comment_id":"10153638033307377","commenter_b":"dumb@$$","commenter_a":"Sooooo, did Michelle Obama use any words that Laura Bush used? Hmmm a good listen.","post_message":"Bill Kristol, editor of The Weekly Standard, has delivered an eleventh-hour pep talk to Republicans."},{"comment_id":"548865588651254","commenter_b":"How touching❤️","commenter_a":"Love this and will remember when choosing between Home Depot and Lowes!","post_message":"This disabled vet was having trouble finding a job because of his service dog — so Lowe's hired them both."},{"comment_id":"472562882934292","commenter_b":"She's a want to be Queen A Big Not she's not the first ya got it .","commenter_a":"that woman definitely needs therapy posing as a queen lol dream on woman","post_message":"Michelle tried to do something absurd, but USPS shut her down. Awesome, it's about time someone told her 'no'. Do you support the post office's stand against Michelle?"},{"comment_id":"527521687455792","commenter_b":"Don't give her anything free ,I bet she would loose some weight then maybe she will like what she sees,maybe if she was real hungry she would find a job,how about stopping everyone's welfare look what a cost saving that would be and it would help our United States we wouldn't have to feed a bunch of free loaders .","commenter_a":"Oink, Oink !!","post_message":"I couldn be more disgusted by what she saying"},{"comment_id":"102010026995579","commenter_b":"Wanna borrow my gun?","commenter_a":"Go ahead Cher! I'm not stopping you.","post_message":"Famed singer and radical leftist Cher is at it again, making outrageous and unwarranted comments. @webpagelink"},{"comment_id":"712618255553616","commenter_b":"They are giving your money to the illegals.","commenter_a":"Moral standpoint! My husband is on disability because of 2 strokes. He cannot even get a part time job because of his disability. I'm on social security and we both do not make enough to get us through the month. We worked for our social security. It is our money. I hope people who are in the same boat as us will stand up to this major jackass!","post_message":"Trump will slash anything, as long as it doesn't affect HIS wallet."}]
