[{"comment_id":"10153230146462439","commenter_b":"Why do you say that?","commenter_a":"The use of the Neutron Bomb comes closer.....","post_message":"Iran is the world’s leading state sponsor of terrorism. Hizb’Allah is its client in Lebanon. Hussein Obama has apparently joined the axis of evil…and that will be his legacy. “Iran is placing guided warheads on Hezbollah rockets,'” by Yaakov Lappin, …"},{"comment_id":"10153860997211756","commenter_b":"He is a hero","commenter_a":"Traitor!","post_message":"Snowden tweeted \"Can you hear me now?\" then had an exchange with astrophysicist Neil deGrasse Tyson covering Mars, cat pics and labels."},{"comment_id":"1385476598133803","commenter_b":"@username Total dumb ass","commenter_a":"I say that's bullshit, race problem was minimal until we got this racist Muslim traitor idiot in the white house, Obama administration and his friends are the problem with this country now.","post_message":"The majority of Americans say there's still widespread racism against African-Americans in our country. Do you agree or disagree?"},{"comment_id":"521579714699275","commenter_b":"She is like a pile of dung. Worthless!","commenter_a":"Yes","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way.  What a disgrace. She needs to deported to the Middle East.  Do you think Nicole Kidman is a sell out?"},{"comment_id":"1701571813463264","commenter_b":"Carly without a doubt!","commenter_a":"No question Carly","post_message":"Poll: Who Would Be A Better President, Carly Fiorina or Hillary Clinton  (A) Carly Fiorina (B) Hillary Clinton"},{"comment_id":"10154974610048896","commenter_b":"Lets make this clear Theres only to genders And youre born with the parts youre supposed to have Fucking millineals","commenter_a":"Ah just give him some money. He wont shut up until they do. Maybe he'll use it to treat his mental illness.","post_message":"\"I'm not unique in all of this — this upheaval happens to trans people all the time.\""},{"comment_id":"1637686876527430","commenter_b":"I don't rbecall we doing this Obama some needs to stop this it is un-American to do this not happy leave the country that has let you make millions of dollar from the same people you bash we are sick of all this go cry to Hillary or better sit on her husband lap","commenter_a":"How stupid can they get? Pathetic!!","post_message":"Some celebrities will show up to Trump's inauguration....to protest."}]
