[{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. \"We hope and pray the U.S. Coast Guard is able to bring Samantha home.\" @webpagelink"},{"comment_id":"10153284422191323","commenter_b":"White people are often unaware of their privilege as it is invisible a lot of the time. Happened to me when I got pulled over by a cop for cutting in front of them. I got an angry warning. If I were black, there's a better chance I would have gotten a ticket. I'm not 100% white, but eh, close enough in terms of looks to get the benefits of privilege most of the time. Except at hoity toity Connecticut country clubs.","commenter_a":"Do you understand now white folks?? Its not about you as a person but the system that programs these prejudice biases into you without you knowing consciously.... So when we speak out about institutional racism and bias...its not a direct knock against you as ppl but the fabric your ancestors created and is still maintained today.....","post_message":"Racism is a business. Its marketing is so successful that even Akala looks sideways at a young black man holding a lot of cash"},{"comment_id":"10152957045101316","commenter_b":"that is why... Joran","commenter_a":"\"Messing with our veines/immune system, why?\"","post_message":"#Vaccine industry attempted bribery of #Disney, #ESPN, Oprah and CNN: @webpagelink"},{"comment_id":"10156404407160354","commenter_b":"You dumb bitch","commenter_a":"what an idiot!","post_message":"Terrorists just need a hug and a lollipop...."},{"comment_id":"946732062040088","commenter_b":"Right. Because all those women raped enjoyed it. *eyeroll*","commenter_a":"If you don't want to get pregnant that is a choice. If you don't want to get pregnant, don't have sexual intercourse. There's other ways to find physical satisfaction than sexual intercourse & they won't create a baby. Abortion IS NOT a means of birth control. It's murder. For those who are for abortion as a woman's choice, what about the choice of all of those female babies that have been aborted?","post_message":"So true."},{"comment_id":"1009830989039949","commenter_b":"Don't even watch the view anymore.. THose women have so much anger in them.. They never say anything nice about anyone.. Joy was off the show for awhile,, needs to stay off the show.. Just my opinion..","commenter_a":"Who in the Hell is Joy Behar, and why is anybody listening to her or her or anyone on the View?","post_message":"Joy Behar calls out Carly Fiorina.  Is she right?"},{"comment_id":"10152797676794753","commenter_b":"Typical female.","commenter_a":"He replies.. \" sorry Hun I forgot u said light toast not dark. My bad not happen again\" lol","post_message":"A solider at Fort Bragg in Fayetteville, North Carolina, tried to bring his wife a surprise breakfast in bed Friday morning, but things went terribly wrong."}]
