[{"comment_id":"10154566623729877","commenter_b":"Copycats!","commenter_a":"Obsessed with Obama like the petulant envious kid trying to copy everything related to their nemesis!","post_message":"The Trumps just don't plagiarize speeches — they also lack originality when it comes to cakes. Go figure."},{"comment_id":"10153158889713837","commenter_b":"Yes, where kids have easier access to that stuff...*smh*","commenter_a":"Thank goodness. Maybe the tide is turning. Where nothing has been off limits, fortunately Playboy has made the decision to no longer contribute to the filth that saturates the marketplace.","post_message":"NO MORE NUDES! Playboy magazine has announced that it will eliminate nude pictures from its pages. But it's OK, you only read it for the articles, right?"},{"comment_id":"1640983469535980","commenter_b":"Speak for yourself. You've been in your spot for years, tell us something you have done. LADY, clean out from under your doorstep before you start criticizing someone else.","commenter_a":"Your a sick women","post_message":"Pelosi on Republicans: \"They pray in church on Sunday, and prey on everyone the rest of the week.\""},{"comment_id":"496116510576642","commenter_b":"There are no virgins they rape them all","commenter_a":"Kill them all and let them find Allah and the virgins","post_message":"SICKOS!"},{"comment_id":"10152816296297452","commenter_b":"I hate possums they look like big rats","commenter_a":"Time to burn the house down","post_message":"Can something be totally terrifying and completely cute at the same time? We've seen a lot of \"wild animal in the city\" stories here in Southern California: bears, coyotes, mountain lions... But this could be the wildest. What one L.A. woman found in her closet is lighting the internet on fire. @webpagelink How it got in... how it got out... and the reason it was so angry. Tonight at 11 from ABC7 Eyewitness News. Courtesy: Tara McVicar"},{"comment_id":"10154001365909497","commenter_b":"There are plenty of nice average looking women that \"nice\" average looking guys ignore because they chase hot chicks. It works both ways.","commenter_a":"Local man who would be good provider for area woman`s kid friendzoned while area woman dates unemployed band members. Area woman complains about lack of good men.","post_message":"\"If they find a cure for Zika tomorrow, it not like I can afford to get pregnant under my current insurance plan.\""},{"comment_id":"1196105023763301","commenter_b":"I got something for your ass you want it","commenter_a":"How about remove the sick person behind addicting info !!!!","post_message":"Somebody just did something genius to help in the battle to remove Donald Trump from public life."}]
