[{"comment_id":"10153268288138984","commenter_b":"Asshole !","commenter_a":"I bet if the truth were known, he didn't get injured by some machine falling on him. I bet his wife finally had enough of him and beat the devil out of him!!","post_message":"You'll have to read this list to find out what the top worst moments of his career are, but I definitely know what the best moment of his career is... When he finally leaves!!!"},{"comment_id":"10153615881104199","commenter_b":"Crazy lady!","commenter_a":"White trash at its finest","post_message":" knew what was going to happen. I wanted it on tape. Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off road first time. She got behind me a second time and then went to go around again. I let her have the road, called 911, reported her and her plate number I started phone video which was in a holder on dashboard hands free"},{"comment_id":"498469603689886","commenter_b":"This sissy should go into a latino hood, she won't be talking smack for long","commenter_a":"Get outta here.","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING. Enjoy. ~ DG"},{"comment_id":"941873945853078","commenter_b":"Stop asking this lady to run. She has an agenda allow her to work it with your support.","commenter_a":"Right on","post_message":"THIS Is why we want Elizabeth Warren to run In 2016!"},{"comment_id":"10153969486484255","commenter_b":"Warren was among female Democratic senators who asked Hillary to run for 2016.","commenter_a":"When I think of Elizabeth Warren, I think honesty and integrity-that is why I can Only see her with Bernie Sanders-this is the Lady I envision as our first female POTUS!! Thank You Senator","post_message":"A beautiful smackdown. From Daily Kos user Lady Libertine"},{"comment_id":"10153406999866336","commenter_b":"This is why blacks think conservatives are racist. Only foxtards are defending this flag.","commenter_a":"How about just not ban anything...and let the consumers decide for themselves !!! Or...would that be racist somehow too ???","post_message":"“If Amazon.com is removing the Confederate flag from its offerings, the logical and principled decision is to stop selling any promotional material... of Che Guevara or any mass killer.”"},{"comment_id":"10153601667565329","commenter_b":"Wtf buzzfeed? That chick with her fingers under her eyelids?!","commenter_a":"My leg spasms like that too. It's nasty!","post_message":"No. No you can not."}]
