[{"comment_id":"10158316523410578","commenter_b":"Lock up homegrown terrorists!","commenter_a":"OUT OF HERE ILLEGALS.","post_message":"Do you support the Immigration Crackdown? \"As we speak, immigration officers are finding the gang members, the drug dealers, and the criminal aliens and throwing them the hell out of our country. And we will not let them back in. They not coming back in, folks. They do, they going to have bigger problems than they ever dreamed of.\" - President Trump @webpagelink"},{"comment_id":"10152594345774071","commenter_b":"What girl with an f cup wants to wear a bra with half inch width straps? VS bras aren't comfy anyways.","commenter_a":"The bigger the size the harder is must be to line up the targeted areas with the proper tie downs ...","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."},{"comment_id":"543375892529200","commenter_b":"She wouldn't survive!","commenter_a":"She should go to Sinaloa, they've been purging for a couple of years now, plenty of Mexicans to choose from there","post_message":"\"I would kill as many Mexicans as I could in one night.\"  A waitress, who was apparently upset that a customer didn't leave a tip, has been fired after she tweeted a racist comment."},{"comment_id":"10153382120572293","commenter_b":"They are not the same at all","commenter_a":"Deidri","post_message":"Why the analogy is important."},{"comment_id":"1705293566392359","commenter_b":"Not only is she racist she has a chip on her shoulder against whites. She has done very well in this nation and it took whites to get her where she is at! Ungrateful bitch.","commenter_a":"Liberals always resort to name calling. They can't come up with a rational argument. Help Oprah go away don't buy anything of hers and don't watch her. She will then be loving whites. She's a sad woman.","post_message":"Oprah: ‘Anyone Who Doesn’t Like Obama Is Racist’. Unbelievable. What a bigot. Do you think Oprah is the racist?"},{"comment_id":"1178538995510357","commenter_b":"I would have moved too.","commenter_a":"Ungrateful people if they really look at the whole picture officers are out there protecting us,don't judge the rest because of the other bad apples.Now they got to deal with criminals and the society plus news reporters.Too bad the officers can't close their eyes and walk away and say I don't want to help you guys!!!!!! But they swore under oath they will serve and protect you!!!!!!!","post_message":"The officers even covered the couple's tip."},{"comment_id":"10153108653466770","commenter_b":"Psycho woman.","commenter_a":"Ho hum!!!","post_message":"Debbie Wasserman Schultz says Donald J. Trump's “misogynistic comments” are “reflective of what the entire Republican Party stands for.”"}]
