[{"comment_id":"1104177846295508","commenter_b":"@username Actually the major of women that have Abortions are Christian @webpagelink","commenter_a":"thats is because the democRATs favorite sport is killing our unborn babies...","post_message":"There is something very important missing here..."},{"comment_id":"10153783532251336","commenter_b":"You drug addicts are so jealous that it went to the police station. I will say it again. I'm glad it went there. get yourselves off the streets. IDIOTS!!","commenter_a":"Glad it went to the police station. Keep it off the streets!","post_message":"Officers wrote in a Facebook post, \"If you were expecting these packages and would like to claim them, please come to Police Headquarters.\""},{"comment_id":"1090391007723817","commenter_b":"Arrest the bum and let him drink the water","commenter_a":"A shame","post_message":"The city has confirmed 200 cases and 9,000 exposures to lead poisoning in kids under age 6."},{"comment_id":"10154043795967061","commenter_b":"The fact that the lady moves so slow is the first reason she should no longer be driving!!!!!!","commenter_a":"Grab her and get her out!! Why so slow Poor lady Car could explode","post_message":"WATCH: Body cam video shows Santa Fe police officer rescuing an 87-year-old woman from a burning car. \"I could have burned to death. @webpagelink"},{"comment_id":"10152610219894071","commenter_b":"Gabriel Emilio","commenter_a":"Bates PAPA Creighton","post_message":"They're killing it right now."},{"comment_id":"1074021369287319","commenter_b":"She's negative. ..kinda like both of u ... f off","commenter_a":"Beyonce is an asshole","post_message":"Not a lot people noticed, but Beyonce took a major stand last night."},{"comment_id":"697839387073306","commenter_b":"She should have been arrested months ago!!!! Arrest her now and put her away for good!","commenter_a":"Our Justice Department is corrupt. They will not take appropriate action.","post_message":"FBI wants to take down Hillary Clinton after she is caught in huge act of espionage. She needs to be thrown in prison. We can't let her get away again. Do you think Hillary Clinton should be arrested?"}]
