[{"comment_id":"993982434028144","commenter_b":"That's my girl.","commenter_a":"Aarøn Andersøn","post_message":"'The Seniors and Veterans Emergency Benefits Act would give about 70 million seniors, veterans, people with disabilities, and others an emergency payment equal to 3.9 percent of the average annual Social Security benefit, about $581 – the same percentage raise as the top CEOs got last year.'  Read more here: @webpagelink  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1188648117842550","commenter_b":"America shouldn't change Muslims need to adapt to our cultures","commenter_a":"UN","post_message":"MUSLIMS FLIP OUT! McDonald, Pizza Hut And KFC Refuse Muslim Demands To Serve Halal...  Time to go eat a Big Mac! Can we get 10K LIKES for this!"},{"comment_id":"10155348213273132","commenter_b":"Oh boo hoo! Get over yourself! The world doesnt revolve around Queen B! Plus she is not the same artist she used to be... of course her sister would be the one to start the unnecessary drama lol","commenter_a":"Beyonc is not all that any more ADEL IS ABSOLUTELY THE BEST SINGER EVER Beyonc did not get snubbed She lost GET OVER IT","post_message":"have only been two black winners in the last 20 years for album of the year.'"},{"comment_id":"10157208654565294","commenter_b":"Preach!","commenter_a":"God I wish we could stop talking about this guy. Who cares he's a waste and obviously doesn't want to try and help himself in anyway. Glad he's at least not on the Browns any more.","post_message":"'I hate to say it but I hope he goes to jail. I mean, that would be the best place for him.'"},{"comment_id":"10153203209001336","commenter_b":"THANK GOD THERE ARE MOTHERS LIKE HER I WOULD DO THE SAME THING IF IT WAS MY KID!!","commenter_a":"Lets hope she isn't accused of child abuse!","post_message":"VIDEO: A woman is seen beating a rioter in Baltimore. It turns out he is her son."},{"comment_id":"1116694178387110","commenter_b":"Jim Kelley who's disingenuous now? Context is everything, two debates are scheduled during major NY sports team match ups. The other during his good morning America interview.","commenter_a":"Bernie is not even registered as a Democrat. He is just running on the Democratic ticket for funds and benefits. He should have run as a socialist, Oops, I mean Independent. Hillary 2016","post_message":"Hillary Clinton cree que la educación es la clave para salir adelante. Lee el artículo."},{"comment_id":"10154080413671162","commenter_b":"You must be a star chaser or useless female cop.","commenter_a":"What a bunch of ignorant aholes....do me a favor and NEVER CALL THE COPS to help your pathetic selves...none of you are worth it....all loser thug scum bags","post_message":"Police say they were trying to pull a car over when it smashed into their patrol SUV in the Loop."}]
