[{"comment_id":"1735673330034205","commenter_b":"the last thing this world needs is a liar like Hillary Clinton","commenter_a":"Hillary, we don't need any more of your failures! you've proven thru experience that you cannot lead anything!","post_message":"\"'Diversity' has come to mean that you have to be accepting of every different thing but you cannot, in any way, celebrate a traditional viewpoint.\" – Mike Huckabee"},{"comment_id":"960437774039688","commenter_b":"Get the delegates and you win.. How would they screw him if he gets the necessary votes?","commenter_a":"If after winning FL, MO, NC and IL, Trump does not get nomination, Rubio and Kasich do not drop out... I with all my family and friends will never vote for GOP.. We will be life time democrat..Trump is better than all GOP candidates , if not trump than Clinton or Bernie is fine for me because GOP does not count out votes as votes... They want to do what they want.. They don't hear our voice...","post_message":"\"Donald Trump is one of the two most talented presidential candidates any of us have covered.” Mark Halperin Bloomberg Politics Managing Director Editor"},{"comment_id":"10153492886881973","commenter_b":"I gave up.","commenter_a":"Could you make the article even less readable on a mobile?","post_message":"Our pop culture reporter didn't think \"Spotlight\" deserved Best Picture last night, so he went back to give us his picks from the past 40 years."},{"comment_id":"10153888153653352","commenter_b":"You said it all...Thank you!","commenter_a":"I feel she should have been fired.... possibly fined. Holding her in jail until she changes her mind is a waste of tax dollars and time.... yes this woman stood up for what she believed but she still had a job to do .... not only did she refuse to issue same sex marriage license but she didn't allow the people under her who were willing to issue them either.... that is wrong..... this woman used her title and athority and held an entire government staff to her religious beliefs ... she didn't have to issue them she could have let someone else do that and still be faithful to God's law.... this country was built on freedom of religion. That means no law can be withheld or upheld based on religious beliefs.... she made an oath to follow the laws of the US , as soon as the laws ...","post_message":"Defiant Court Clerk, Kim Davis, Will Be Held In Jail Until She Agrees To Issue Same-Sex Marriage Licenses! CHRISTIANS WHAT IS YOUR REACTION?"},{"comment_id":"634863706677709","commenter_b":"Yes absolutely. ...you are on our soil...you NOW live by our laws...if you don't like that LEAVE....","commenter_a":"Yes she has to obey the law's of this land, or be deported","post_message":"Muslim Refuse To Remove Head Covering For Officers – Gets Brutal Wakeup Call. Should of listen to authority. Do you think everyone should have to obey they law, regardless of religion?"},{"comment_id":"1056310464431070","commenter_b":"AND THERE WILL BE MORE THANKS TO OBAMA AND CONGRESS","commenter_a":"Just kill him","post_message":"BREAKING: ACTUAL ISIS FIGHTER ARRESTED IN SACRAMENTO: Aws Mohamed Younis Al-Jayab Lied To Immigration Authorities ISIS is in the USA! We need TRUMP 2016 to eradicate them! @webpagelink"},{"comment_id":"10154565207543812","commenter_b":"A gun can not cause violence. It's harmless. I have several. They have never shot anyone. They have never caused violence against me or anyone. Get it??","commenter_a":"He lost his brother, son and partner to VIOLENCE by someone using a gun. Could have been a knife, a baseball bat or even a suicide vest. Lay any of these items on a table and they do nothing. Let me know what I'm missing here","post_message":"#Dallas Police Chief David Brown Sr., a 30-year veteran and Dallas native, lost his former police partner, his younger brother and his own son to gun violence."}]
