[{"comment_id":"495130020646953","commenter_b":"So work overtime so you can afford your eggs. Whining like a menstruating bitch with sand in her vagina isn't going to improve the situation.","commenter_a":"Fuck you MCdickbags watch egg inflation. Then this will make natural farm raised local eggs like $25 a carton","post_message":"McDonald's currently uses around 4 percent of all the eggs produced in the United States each year, around 2 billion eggs total."},{"comment_id":"1204291722963907","commenter_b":"and as I assume the majority of their passengers are muslims - then they are providing them information that they require - AND - is harmless","commenter_a":"What kind of prayer? I've flown Royal Brunei Airways twice so far. Before the plane takes off, a Muslim prayer ist shown on the monitors and during the flight the direction towards Mekka is shown and not the plane's position!","post_message":"A passenger saw a WhatsApp message about 'prayer' and feared he was a terrorist"},{"comment_id":"10154082717346037","commenter_b":"You're an old hag and a criminal","commenter_a":"Hilary for president of America 2016!","post_message":"Hillary Clinton and Ted Cruz have received the most funding from the groups so far."},{"comment_id":"1798905343724193","commenter_b":"\"She doesn't want guns, take their let's see what happens to her,\" Trump said. \"Take their guns away, okay? It'll be very dangerous.\"","commenter_a":"How can this extremely ignorant, sorry excuse for a human, still be in office? and in Texas???","post_message":"What say you, Texas?"},{"comment_id":"862688910457525","commenter_b":"Women is just as bad","commenter_a":"Ryan selfish & sexism pig!!!!","post_message":"Ryan Giggs' brother: 'He never even apologised'."},{"comment_id":"10153541842375329","commenter_b":"Kim has a nice body","commenter_a":"Who wore it better? Kim or Doug the Pug?","post_message":"Way to turn the tables, girls. (via BuzzFeed Trending)"},{"comment_id":"118155238703506","commenter_b":"Yes, to bad they are ruining a great state. It's going to take more than Hollywood to support the illegals. Have fun, I'm gone","commenter_a":"Hell yesss goodbye","post_message":"There could be 49 states of America very soon. It's only a matter of time. Good riddance. Do you think we would be better without those libs?"}]
