[{"comment_id":"1016566111717194","commenter_b":"What a fucking hypocritic Bitch.","commenter_a":"Please don't accuse her for stealing a flag. She needed one to wear for a photo shoot to feel nostalgic about a time when she was a playmate.","post_message":"An enraged conservative attempted to steal an American flag from African-American protesters and fought with police, but was not arrested...at a demonstration regarding white privilege."},{"comment_id":"10152737995296519","commenter_b":"Whore's goal. A quick happy ending, get the john outta there.","commenter_a":"Yep and when you have it down real well, men cum in one minute instead of two.....grrreeeaaaatt.","post_message":"\"Those who master it walk away armed with strong sexual skillsets, and even stronger vaginas\""},{"comment_id":"596504240534222","commenter_b":"She is such a liar!","commenter_a":"If Donald would answer the question instead of just attacking Hillary perhaps she could stop having to check and correct his accusations first before actually answering the question in her own 2 minutes. Geez it's insulting that this man shows up to a debate unprepared. #whatajoke","post_message":"RT LIVE STREAM: Hillary Clinton / Donald Trump 2nd Presidential Debate (Courtesy: Ruptly)"},{"comment_id":"909196299140119","commenter_b":"She aint no fun!","commenter_a":"Jack King","post_message":"Virgin wife who won't have sex is trying to set husband up with live-in lover"},{"comment_id":"777311705792740","commenter_b":"FUCK YOU BITCH!!!!","commenter_a":"What a tool.","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"10154892441134312","commenter_b":"Shes hot","commenter_a":"And the mother of the year award goes too...","post_message":"The toddler was found inside suffering from hypothermia and frostbite."},{"comment_id":"10153719642089091","commenter_b":"@username so you've gotten an infection from using a public restroom ?","commenter_a":"Why would you let your 8 year old daughter go to a public bathroom by herself??!! Smdh.","post_message":"Thank goodness for the customers and staff members who helped rescue the 8-year-old after her mother heard her scream. Police say the man was caught carrying the unconscious girl into a bathroom stall."}]
