[{"comment_id":"1083906904965768","commenter_b":"Girl, it was a woman who slapped the horse (read the article, John :) )","commenter_a":"Guy must have thought he was Alex Karras or something. Now draw and quarter the worthless skid-mark.","post_message":"BUSTED"},{"comment_id":"10153475865743645","commenter_b":"Yes and she is a real b:tch","commenter_a":"Was the gator named karma ?","post_message":"He jumped into a pond to hide from authorities and an alligator attacked him."},{"comment_id":"10152872089786135","commenter_b":"Nations aren't doing too well and filled with hate, before this law was passed.","commenter_a":"We all know what God does to nations that disobey His word and goes rampant","post_message":"BREAKING: U.S. Supreme Court requires states to recognize marriage between two people of the same sex. LIVE UPDATES: @webpagelink"},{"comment_id":"712619718886803","commenter_b":"At the risk of repeating myself, J. McCain turn your back on this blight you call a presidential candidate! You do a disservice to your party, your constituents, your military compatriots and most importantly your moral compass which should be leading you away from rather than to Trump.","commenter_a":"Trup will be lopplllllppp Cidgbelillnnrvrubrg","post_message":"He's mad as hell but is he gonna take it any more? -- Paddy"},{"comment_id":"936069706469980","commenter_b":"Colleen Boulden Jj Kane","commenter_a":"Ryan Lindgren take me here !","post_message":"Clark Griswold would be envious of this home on Prior Road in Wilmington, Delaware. The huge Christmas light display caught the attention of the SkyForce10 team while they were flying to another story. The set-up even has a walk-through section. Share your favorite lights displays with us here on Facebook or through the NBC10 app!"},{"comment_id":"10153123506246770","commenter_b":"I have zero respect for someone who marries a low-IQ maid.","commenter_a":"But he is more concerned about foreigners who break our laws than citizens! See ya!","post_message":"Danny Diaz, campaign manager for Republican presidential candidate Jeb Bush, told The Daily Caller that Bush opposes abortion and would not promote it as president."},{"comment_id":"10152976962214205","commenter_b":"Yea, you're right. My comment is stupid, cause it was meant to be. And all you idiots commenting on my stupid comment as if I'm serious lol What's even more ridiculous is \"the police have to do their jobs\". So that's why some ppl get Burger King and walked out of a building (when they've killed 9ppl) and other ppl get choked to death for selling loose cigs, or get shot to death on site for having a toy gun (a 12 year old btw). Or others mysteriously die by being shot in the back while cuffed and in the back of a cop car. Yea cops totally just doing their job by the books. So yea, thanks for \"proving\" me wrong on a comment that was clearly not serious to begin with. You butthurt idiots can shut your dick holsters and relax.","commenter_a":"Prolly told him \"good job son, you played your role perfectly. You did a good job as patsy for your government. Now here's your complimentary Burger King as promised.\"","post_message":"Did you know the cops bought Dylann Roof Burger King AFTER they arrested him? WTF?!"}]
