[{"comment_id":"1634982916802334","commenter_b":"I haven't seen this yet!!!","commenter_a":"@username my fav","post_message":"Cubs players sing \"Go Cubs Go!\""},{"comment_id":"10153063599505950","commenter_b":"Hope they change the entire show. Take both women off tv and replace with meaningful entertainment.","commenter_a":"So nice","post_message":"Kathie Lee Gifford returned to TV for the first time since Frank Gifford's death: \"He passed away instantly that morning, all dressed in what he knew was my favorite outfit -- white shirt, very tight black jeans -- having his coffee, watching his TV, getting ready to go, ready for church, and excited about what we were gonna have for lunch.\""},{"comment_id":"10153514022490047","commenter_b":"Why couldn't they give birth control wouldn't that been cheaper going have to do better than that","commenter_a":"Except what little they give women for birth control. When I couldn't afford birth control, much less a birth, they were there to help.","post_message":"A senior Planned Parenthood abortionist was caught on camera detailing how they \"crush\" the baby and sell the organs.       Planned Parenthood must be stopped.  SIGN our petition to take action: @webpagelink"},{"comment_id":"10155066370401509","commenter_b":"So trump does something good and the left will still whine like stuck pigs and try to spin it.","commenter_a":"Sadam Hussein was Trumps mentor.","post_message":"Donald J. Trump  last month forgave more than $47 million in loans he made to his own campaign committee"},{"comment_id":"1043755919078659","commenter_b":"White people...now hear this...You have no right to tell us black people, when, where, why, and most definitely how to protest anything at all. Besides, your ancestors brought us here, enslaved us here, discriminate us here, hang, and shoot us here...We're still trying to figure out why? 95% of the last 15 shootings since Kaepernick starting protesting, like many before, have been unarmed black males. He just started protesting 3-4 weeks ago. Do the math on that. There is an eradication of my people in progress. We're fed up. It won't be long before WE start shooting back. Bank on it","commenter_a":"322 white people killed by police this year vs 172 backs. How come the media doesn't report on those lives. Stop reporting 1/2 truths and creating race riots.","post_message":"Police confront protesters in Charlotte, N.C., who were demonstrating after police confirmed they'd shot and killed a man while seeking a different person.  FULL STORY: @webpagelink"},{"comment_id":"1287351561304298","commenter_b":"Pneumonia?! Doubtful!!! Maybe her conscience raised its despicable, dishonest head and gave her a little peak at her destiny - a one way trip to spend eternity in Hell - now that ought to make her swoon!!! Still...Doubtful!!!","commenter_a":"Just another lie...","post_message":"New News Is Hillary has pneumonia.  FOR THOSE WHO WERE OFF THE GRID TODAY MOST, here is all you need to know about Hillary's \"medical episode\"  (aka fainting) during the 9/11 ceremonies in NYC.  All the videos you need to see:  @webpagelink"},{"comment_id":"449537148504213","commenter_b":"Lindsay Graham needs to shut the Hell up","commenter_a":"I guess I am part of the dark side and this asshole is one of the bright politicians that are bankrupting America!??","post_message":"Lindsay Graham made this highly controversial comment about Donald Trump. Do you agree or disagree with him?"}]
