[{"comment_id":"10153685089913037","commenter_b":"@username how about we deport you Michelle? You see my Apache and Mexican ancestors were here before you ancestors ever set foot, RAPED and KILLED my people. Texas belongs to us. So, get it straight. YOU are the illegal here Michelle.","commenter_a":"Omg if you are legal he doesn't want to send you back. If you are illegal you should be in jail anyway","post_message":"\"It was kind of demeaning.\""},{"comment_id":"1073645179326169","commenter_b":"^^^boom^^^","commenter_a":"Christian's don't commit Adultery Hypocrites Do God is Revealing what is done in the Dark. Nothing is hidden from God","post_message":"DEVELOPING: Possibly Millions More Christians Have Committed Adultery Using Ashley Madison Than Previously Thought. #FallingAway #AshleyMadison"},{"comment_id":"1788072574740832","commenter_b":"jesus Christ those girls look petrified","commenter_a":"@username @username 😱😱","post_message":"Parents in remote parts of Malawi are sending their daughters to be sexually initiated by local men - called \"hyenas\" - when they reach puberty. Meet Eric, he’s proud of his role as a \"hyena\". Learn more from BBC News Magazine: @webpagelink Listen to the documentary: @webpagelink"},{"comment_id":"1055356871225809","commenter_b":"Trump is clearly a tyrant.","commenter_a":"Go, @username! This man will bring down the Republic! He's a barbarian baying at the gates of our Rome. He wants to change the legal system our forefathers died for, deny us freedom of the press and access to unbiased information, encourages racism and discourages free exercise of religion. This will not end well.","post_message":"\"The Post will continue to cover Donald Trump as it has all along-- honorably, honestly, accurately, energetically and unflinchingly,\" Executive Editor Marty Baron said in response."},{"comment_id":"1205011436232276","commenter_b":"Hahaja pornhub and fat bitches fighting over fooood lmfao","commenter_a":"@username #14 😂. That's Steve","post_message":"Enjoy This Week's Vine Comp! #WSHH #Vine #Compilation"},{"comment_id":"1289811051085647","commenter_b":"Nothing prepares your for a move a bitch ass pussy makes smh","commenter_a":"Always gotta be ready. I definitely think it was a pussy move though","post_message":"What a cheap shot! #mma #cheapshot #wshh www.worldstarhiphop.com/videos/video.php?v=wshhfsWHNoydsw8M0AY7"},{"comment_id":"10152854969571051","commenter_b":"Let behead these scumbags..What the F**k is wrong with people..Your parents should get their asses kicked","commenter_a":"Tell me where they live. I'll do the rest...","post_message":"These teens beheaded a puppy with a machete and posted the video to Snapchat. Then they picked up another puppy and did it again. And they didn’t stop there."}]
