[{"comment_id":"10156346245355354","commenter_b":"She should have been body shamed. What body she has that is.","commenter_a":"How about just a useless cunt?","post_message":"READ what anti-America donut-licker Ariana Grande wrote. Genuine pain from being 'body shamed'? Or shameless PR stunt to gain sympathy?"},{"comment_id":"930011010437419","commenter_b":"Lady u need help fuck grump","commenter_a":"\"Semame?\" Really, is spell checking really that difficult? I'm only pointing this out because it's a constant with your memes and videos. As funny as they are and as much as I enjoy them, please, for the love of God, use spell check. You look like buffoons when you misspell such easy words.","post_message":"WATCH: 10 years ago, Sesame Street called out trashy Donald Grump. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153630936701955","commenter_b":"Idiots are using it for crack and other illegal substances !","commenter_a":"What a shitty headline. The doctors put him in a coma, not the e-cig. Drudge should have had more sense than to repost such drivel.","post_message":"Man In Coma After E-Cigarette Blows Up In His Face..."},{"comment_id":"1153132958040066","commenter_b":"All 3 should be skinned and decapitated!","commenter_a":"And everyone \"outraged\" are all Vegen, right?!! Where is the outrage for the 100's of 1000's of innocent babies murdered every year???!!!","post_message":"The U.S. tourist who who killed Zimbabwe's beloved lion, Cecil, received global condemnation as news spread. Read more here: @webpagelink"},{"comment_id":"713882998713829","commenter_b":"...then get to it...show the American citizens that you politicians have some cajones...IMPEACH the MF'er!!!","commenter_a":"THIS IS THE FIRST TIME IN HISTORY THAT A LEADER OF THE FREE WORLD ISN'T HELD ACCOUNTABLE FOR HIS ACTIONS . AND I WOULD LIKE TO KNOW WHY.","post_message":"The American President... Or Jihadist In A Suit? ⋆ Dc Gazette... @webpagelink"},{"comment_id":"10153308445179342","commenter_b":"You right, had he been a negro, that M.F would be pushing up daisy right about now.","commenter_a":"If he was black I doubt he'd be alive to take pics","post_message":"SUSPECT PHOTO RELEASED: Kevin Daigle, 54, of Lake Charles was arrested for allegedly shooting a trooper in the head during a traffic stop. Charges against Daigle will include attempted murder of a police officer. DETAILS --> @webpagelink"},{"comment_id":"898221040294675","commenter_b":"Kill the mother fucker","commenter_a":"I would put a shotgun up his ass and let the trigger fly!","post_message":"Multiple Choice Quiz time, kiddies. I chose option 'C'. What about you? @webpagelink"}]
