[{"comment_id":"10155173773771320","commenter_b":"Barbie has Ken what's the difference....","commenter_a":"Good grief!! My oldest granddaughter collected them, but this is plain stupid! Why don't you make an American Boy series???","post_message":"Big news in the world of toys. One of the newest American Girl dolls is... A BOY! It is the brand's first boy character. He is a drummer in a Nashville band. Thoughts? @webpagelink"},{"comment_id":"10153043301434411","commenter_b":"probably a women could define.","commenter_a":"So does this apply to women?","post_message":"Warning! Selfie men!"},{"comment_id":"934086226709659","commenter_b":"Put more women in your cabinet!","commenter_a":"I AM MY SISTERS VOICE VOTE DEM :::::::::::REVELATION 21 = THE TWO ARE ONE = TWO TRUMP AND WALKERIGHT ONLYESATANACYES <DID 911 SATANACYESEENTHREE THE FATHER THE SON THE HOLYESPIRIT <<< THEY DID IT NY INDYESHUALLHEARTRUTHEART:::::KY DC = DOVESON CHRIST < TRUE IN THE FLEASH CAME ON THE 3RDAYESON ROCKING < THE TRUTH USABLE <++++}:::::::::::::::::::::::::::::::>ART<:::::::::::::::::::::::::::::::{+++>:<>","post_message":"Born five years before most women could vote in America, Shirley has lived through the Great Depression, two world wars, the Civil Rights Movement, and the moon landing. Today, she’s rooting for something she never thought she’d live to see: the first woman president of the United States."},{"comment_id":"877009682392087","commenter_b":"If you are a salaried worker, no overtime pay. Which means you get a set rate of pay weekly or biweekly and have to work how many ever hours you have to, to finish your job. Whether it's 30 hrs or 50 hrs you get the same pay. It's like that for a lot of managers and supervisors.","commenter_a":"I must be in a bubble, I thought anything over 40 hrs is overtime, I have always been paid time and a half for anything over 40 always. What is it the restaurant businesses? Who doesn't pay overtime?","post_message":"This is HUGE! 'A hard day's work deserves a fair day's pay,' the President said in his announcement.  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153921301277217","commenter_b":"'@username has lost their integrity!","commenter_a":"Hahaha.sorry for the laugh. But @username Please investigate first before you conclude on this report. These are all accusations to our beloved president . even his rival denied those witnesses that testified in the senate. sad to say our president's rival now is doing the best they can to destroy our only hope to have a drastic change in this country . BTW You need to go to our country first to know more abt the facts and whats really happening here. :3 -_- #PostResponsibly -_-","post_message":"Gruesome gangland-style hits, including feeding one victim to a crocodile, were described to a Senate hearing by a former death squad member."},{"comment_id":"741381376052440","commenter_b":"Big ugly cow, let her bitch.","commenter_a":"So go to another store, what's the big deal?","post_message":"Welfare Queen Goes BALLISTIC After Seeing THIS Sign At The Grocery Store  Let her be mad, this is what she deserves.  Are you sick and tired of entitled welfare leeches?"},{"comment_id":"10152889547313299","commenter_b":"I thought I could not dislike this so called woman any more than I do, but, taking a disabled parking spot is outrageous!!! Did she get a fine? Everyone else would have. Do you really want to see this self-centered, rule breaking murderer as president???","commenter_a":"Hilliary is entitled to be queen and all the common people are her court. she can be charming but she's Danger with a capital Dl . she is deceptive with a capital D and isn't that strange Democrats. Is a capital D too","post_message":"Hillary Parks in Handicap Spot ... @webpagelink"}]
