[{"comment_id":"1816447821944782","commenter_b":"put a sock in it bitch","commenter_a":"What if Trump said he was here for the white folks. These people just don't get it.","post_message":"Former Bernie Sanders campaign spokeswoman Symone Sanders just appeared on CNN to weigh in on the future of the DNC and the Democratic party."},{"comment_id":"1180596495393685","commenter_b":"We ain't going to miss you don't let the door hit you on the way out","commenter_a":"He accomplish nothing but racial tension","post_message":"Here is how Americans feel about Obama as he leaves office. Are you proud of what he accomplished for our country?"},{"comment_id":"1024247464301668","commenter_b":"Thats life woman ....","commenter_a":"Why do we have to broadcast everything? Is anything private anymore?","post_message":"The scar that saved a baby's life"},{"comment_id":"10153400550747042","commenter_b":"Good thing those girls were white, if they were black they probably would've been arrested","commenter_a":"The cops are doing their job! These girls are breaking the law. Now let's give the cops a big round applause (being sarcastic)","post_message":"KIDS' STAND SHUT DOWN: They were trying to earn money to buy their dad a special gift for Father's Day."},{"comment_id":"614667495400588","commenter_b":"although she used the same structure as the \"hero myth\" that Joseph Campbell taught us to be a structure present in all traditional cultures","commenter_a":"Yeah, gonna have to disagree with this article. Just because whiny liberal twenty-somethings are hijacking the HP narrative for their agenda does not mean that the series is poorly written or guilty of propagating a false view of the world. Sure, Rowling is loudly liberal herself. But as a conservative I can, and do, greatly enjoy her books.","post_message":"Let's be honest, J.K. Rowling isn't a very good writer."},{"comment_id":"1099878783413317","commenter_b":"Thank-YOU!!!!!","commenter_a":"Damn good question! Ask obama!!","post_message":"America's Freedom Fighters"},{"comment_id":"10154211754086509","commenter_b":"Immigration, no; Illegal invasion, yes!!!","commenter_a":"I get that people are against immigration. But some of these comments go to show how Inhumane people are. Sickening. (Since people don't know how to read and have messaged me ugly things saying how I should take them in...I'm going to state that I agree with immigration restrictions but I do not agree with having them DROWNED or KILLED.) Jeez.","post_message":"A Polish teacher asked students to calculate how many Syrian refugees had to be thrown overboard for a boat to stay afloat and reach Greece."}]
