[{"comment_id":"10153768480704203","commenter_b":"And that makes it ok? So she should be President?","commenter_a":"Name me ONE successful person who has not had a pattern of hurting people, stepping on them, and then rewarding themselves? She's no different than 99% of the CEO's out there that make MILLIONS on the backs of their employees.","post_message":"need people to know who this woman is and what her pattern is of hurting people, stepping on them, and then rewarding herself."},{"comment_id":"10153171348750736","commenter_b":"Yeah, I want my 30 cents! in a check.. pronto!","commenter_a":"Instead of someone winning, split thee winnings with everyone who bought a ticket!!","post_message":"#BREAKING  No winner in tonight's Powerball Jackpot.  Wednesday's draw will be worth at least $1.3 BILLION.  Is there a billionaire's equivalent to the Dollar store??"},{"comment_id":"10155361770815354","commenter_b":"Yea an so is this bitch!!","commenter_a":"she sounds like nixon i am not a crook","post_message":"Hillary & Bill Clinton are simply without shame..."},{"comment_id":"626166684240577","commenter_b":"She is a idiot ass","commenter_a":"She always does that is why nobody watches the show the POS is on.","post_message":"Whoopi Goldberg made a sad attempt to play the race card, big mistake. What liberal filth. She needs to be taken off TV. Are you tired of liberal trash polluting the media?"},{"comment_id":"10153235422567994","commenter_b":"Hahahaha mathieu blocked me awe","commenter_a":"Who are these people with nothing better to do than just constantly complain about everything being racist? My God shut up.","post_message":"It's a bank robbery for Skittles. Is it a student video gone wrong?"},{"comment_id":"1033963386626709","commenter_b":"Please Kathy. Just run the Pap strip over your big mouth. Infected!!!","commenter_a":"Trust me Kathy........Nobody want to see your Ugly......Except maybe KILLARY!!!!","post_message":"Another classy remark from Kathy Griffin."},{"comment_id":"10153448230456680","commenter_b":"'@username Lucky for you these modern day Hitler's didn't murder you in your womb.","commenter_a":"The innocent handicapped underdeveloped should not be punished by death. Some are responsible and need to be punished. Donald J. Trump is correct again. Trump for president 2016.","post_message":"Planned Parenthood Action also issued a five-figure ad buy in partnership with Priorities USA Action – a super PAC supporting Hillary Clinton."}]
