[{"comment_id":"1639973446062778","commenter_b":"Fucking bitch...outsmarted herself and all her dumb ass supporters!","commenter_a":"I thought it was us racist white people truth is you did not deserve to be our president because we don't trust you your record suck your forein policy was terrible and caused so much death your husband disgust me and you lied about your server when you bleached bit your emails to hide your crimes blew it for you but what you did to our heros in Benghazi was the worst then to cheat in debates with Donna showed us your still the sneak we all know you are. Go away already your done","post_message":""},{"comment_id":"10154269549387994","commenter_b":"You ugly asf stfu.^","commenter_a":"People have gone crazy if they think Trump can run this country.","post_message":"BREAKING: Ted Cruz has dropped out of the GOP race for president, clearing the way for Donald Trump to likely win the nomination."},{"comment_id":"1114475591908563","commenter_b":"Scum","commenter_a":"Two interviews; one discussing the present, when he declares no share ownership etc, etc, and a second interview, which was today, discussing the past when he did own some. Two very different things. Perhaps it's wise to point that out, instead of skewing the facts to confuse your poor readers....","post_message":"BREAKING #MicBrights"},{"comment_id":"994057867406695","commenter_b":"3 americans tried to blow up a mosque in Kansas. No coverage here","commenter_a":"This is why we should NOT bring anymore refugees here and should return the ones that are here. We NEED to take care of our Americans first!","post_message":"An Iraqi refugee who planned to blow up two malls in Houston pleaded guilty to trying to help ISIS. @webpagelink"},{"comment_id":"10154020630826636","commenter_b":"@username however... that's detracting from my point! My original comment was about the UK's inability to prosecute migrant sex offenders!","commenter_a":"The only problem people in the uk have with immigrants, new British, Muslims etc... is the lack of police prosecution and \"special treatment\" minority groups get. There are an estimated 1 million cases of Islamic grooming, which've been swept under the carpet, by social services or went uninvestigated by police because of fear of being branded racist! That's not just some \"bigoted\" or \"islamphobic\" propaganda.. that's the reality of people living in a heavily Muslim populated area! The problem isn't with immigrants or non white Christian Brits... it's the lack of ability to deal with the crime coming from their community's by the authorities!","post_message":"Ironic?"},{"comment_id":"421180878069520","commenter_b":"^^ this idiot supports sanctuary cities and providing safe harbor to illegal alien criminals","commenter_a":"Hillary belongs in prison.","post_message":"More than $400 million has poured into the presidential race so far."},{"comment_id":"10153730594409099","commenter_b":"Who are all these women stuffing their babies in bags?","commenter_a":"Thank god the baby was left somewhere where baby could be found alive unlike all these mothers stuffing them in bags killing them. This was a woman that loved the baby enough not to hurt it. Maybe she was afraid of something like deportation or something else. At least it was at a church not in a dumpster or alley. We don't know the circumstances or her story so lets not be aholes and judge at least someone can raise that baby who wants it.","post_message":"BABY IN A MANGER: A wailing newborn baby was found with its umbilical cord attached inside a nativity scene at a Queens church, police say ----> @webpagelink"}]
