[{"comment_id":"826344630889447","commenter_b":"We are sick and ;tierd of feeding these lazy women who just keep laying on their backs , letting free loaders get them Pregnant. We need to sterilize these women. We should pay to get them sterilized.","commenter_a":"Get a JOB, leeches.","post_message":"They are losing it. That's what happens when you mooch for your entire life.  Do you think this was a long time coming?"},{"comment_id":"902522343195539","commenter_b":"Smart pooch 😂😂😂","commenter_a":"Krissy Maree","post_message":"This Great Dane's having a Great Time on a trampoline.  Video: Jukin Media"},{"comment_id":"10153809413306101","commenter_b":"Oh give me a break. This silly leftist woman is acting like a jerk.","commenter_a":"I cannot believe what you have said. I myself really don't care what she has to say and I would disagree 100% with her!!!!","post_message":"Donald J. Trump may want to listen to Eva Schloss about what racism looks like."},{"comment_id":"10152542079335927","commenter_b":"What state elected this Muslim trash","commenter_a":"Minnesota has a Muslim problem. There has been over 40 of its citizens gone over to the Middle East to fight for ISIS. The liberal democrats will welcome these terrorists make to the United States with open arms.","post_message":"It's a tricky situation preventing money from getting into the hands of terrorists."},{"comment_id":"10153553698421323","commenter_b":"I'd rather be surrounded by happy refugees , than miserable right wing morons.","commenter_a":"Have you seen most of these refugees? Not the kind of people you want living near you. They've already turned many areas into hellholes for the residents.","post_message":"'Anyone who tells me Germany is full up, or that we can’t afford them, I say think of our past, and of the future. Of course we can afford them – we’re a rich country, and we have a duty to help those in need.”  The German mayor desperate to welcome immigrants to his town."},{"comment_id":"10153760568196162","commenter_b":"I wish except i don't think my mom would know how to play the lotto lol!!!","commenter_a":"'@username your mom won","post_message":"POWERBALL WINNER: Someone in Michigan just won the second largest Powerball jackpot this year. @webpagelink   The winning ticket is worth $310.5 million.  Here are the winning numbers:"},{"comment_id":"602032646612178","commenter_b":"It's a very very last resort. We would have to live with it for the rest of our life. I am a responsible gun owner. Guns are meant for hunting and in case of a immediate threat on your or someone else's life only. #Berniesanders","commenter_a":"The guns themselves don't worry me. It's the people who demand having them that worry me. They never have legitimate reasons. It always boils down to paranoia and delusions of grandeur based on violence. Not the kind of humans I want to see armed.","post_message":"Multiple other vehicles were hit by gunfire, too. How many other angry Little Fellers are out there with guns?  -Conover"}]
