[{"comment_id":"10154438030826336","commenter_b":"Fat lesbians...","commenter_a":"Disgusting that Chick Fil HITLER would laugh about genocide.","post_message":"Celebrate #CowAppreciationDay at Chick-fil-A!"},{"comment_id":"10154044362479024","commenter_b":"Let's cleanse American by not letting his sorry ass back into the USA","commenter_a":"tell Will Smith that we were here frist , and to fuck off","post_message":"With video. Bad things usually happen when leftists start talking about \"cleansing...\""},{"comment_id":"1813003575594431","commenter_b":"Us white people got to go yuh eard meh","commenter_a":"Were pray tell is this \"white rage\"? I am white and I feel no rage nor the desire to go out in public and carry signs around. I am not happy with where this country is going but I am not out all day every day protesting and tearing things up..oh wait a minute...I work all day.","post_message":"According to a new book by Emory historian Dr. Carol Anderson, many of the struggles faced by the African-American community are the result of \"white rage.\""},{"comment_id":"1062665507148980","commenter_b":"Scum","commenter_a":"They are a terrorist group and should all be locked up.","post_message":"Black Lives Matter Takes to Twitter to Celebrate the Slaughter of Baton Rouge Police. Here are Their Sick and Disturbing Tweets..."},{"comment_id":"1565960626752926","commenter_b":"With 12 to 15 million illegal Aliens in this country there is no way of knowing how many votes she got illegally.","commenter_a":"without California...Trump would would have won popular votes...snowflakes in cali...put on your diaper pin & pet a puppy !","post_message":"Hillary Clinton lost the presidency in 2008, she lost in 2016, she lost the 2016 recount, and she's gonna lose the Electoral College today. Four times Hillary Clinton has lost the presidency in eight years, a modern American record."},{"comment_id":"10152887362811770","commenter_b":"Liar....","commenter_a":"gormless!!","post_message":"Pantsuit on fire!"},{"comment_id":"10153123905806800","commenter_b":"What??!!! A telling point, if in jest, that she made her own rules!","commenter_a":"Sorry, John. I usually love your stuff, but you missed the point on this one. As someone who used to have a government email account, this is a big deal. Every government employee must have one, and to access most government systems, you need to use it. This allows those emails to be captured as part of the public record. This is significant enough that it's caused me to reevaluate my support for her. I see two major issues: 1. I can't imagine the hurdles and hoops her staffers had to jump through to make this happen. And it wasn't like it made things easier for Hillary. Several high-ranking people I worked for had a government email account and hardly ever read it. Their staff checked their emails and passed on the ones they needed to know about (like just about any high-ranking person in a company). This just put ...","post_message":"\"Is that against the law not to have an email account? It seems less of a scandal and more of like a nerd snap. 'Oh, she so old she doesn't even have an official email account!'\" -- Jon Stewart ►Watch the episode: @webpagelink"}]
