[{"comment_id":"902293323230618","commenter_b":"Please put the lying pig in prison where she belongs","commenter_a":"Isn't it ironic the Bill Clinton appointed Loretta Lynch in New York City to her appointment as federal judge there! Obama appoints Loretta Lynch to be attorney general after ever called or left! Barack Obama supports Hillary Clinton for president of the United States saying he doesn't think she did anything wrong! Loretta Lynch Meats with Bill Clinton by coincidence in Arizona Airport where they both went with private planes and just happens to be on this farm at together! After Loretta Lynch meet with Bill Clinton by chance and the Arizona taubat she requests the judge postponed releasing Hillary Clinton's emails for 200 and some days after the November election! How are you folks believe Barack Hussein Obama's administration is not totally corrupt I guess you're waiting for the Easter Bunny, Santa Claus and any other mythical person to come by your side along with the Unicorn! I guess ...","post_message":"An iconic photograph of Hillary Clinton using her BlackBerry while wearing sunglasses on a military plane prompted an official in her office to inquire about whether Clinton had been assigned a government email address...  The information came out in sworn testimony in a Judicial Watch deposition of Karin Lang, a former State Department official. Please SHARE!"},{"comment_id":"10154333518999641","commenter_b":"It's about time america should have their own female leader, if they truly wanted a real change, that lady touch would make a real difference for a great nation to reach further.","commenter_a":"VOTE FOR HiLLARY CLINTON 2016 . Hillary for America","post_message":"'We just put the biggest crack in that glass ceiling yet.” - Hillary Clinton appears via satellite at DNC in hat-tip to history @webpagelink"},{"comment_id":"10153963536777235","commenter_b":"And a large percentage of illegal immigrants simply come here legally with a visa and just don't leave.","commenter_a":"The wall is absolutely absurd. See the ocean? You can use it to go around the big ugly wall. See the airplanes? You can go over the wall. Ask El Chappo about going under things. It's nostril flaringly stupid. Ancient technology. Pre airplane, backhoe and no ocean on either side. It would be funny if there weren't so many truly stupid people believing it. Gag, cough, hurl.","post_message":"BUSTED!"},{"comment_id":"10153216649359705","commenter_b":"Heterosexuals have rights to same sex bathrooms","commenter_a":"PA-THE-TIC! Only country in the world that does this garbage!","post_message":"White House staff now have access to an all-gender bathroom. Here's why it's important."},{"comment_id":"10155114776336509","commenter_b":"Yes lets look at all those years Hillary has been in office but she doesn't handle classified information. So what does she do??? Trump has declared bankruptcy 7 times out of over 500 businesses. Pretty good success rate. I would like to see you try and run two businesses and see how you do. NEVER HILLARY!!!!!!","commenter_a":"Let's compare resumes, shall we? Hillary Clinton: 9 years, First Lady of Arkansas 8 years, First Lady of the United States 8 years, U.S. Senator 4 years, U.S. Secretary of State Donald Trump: At least 15 failed businesses Owns casinos that have filed for bankruptcy no less than 4 times 0 years in public service Now, if you were looking at those numbers, who would you hire? Who would you trust?","post_message":"While introducing Hillary Clinton at an appearance in Omaha, Nebraska, billionaire Warren Buffett challenged Donald J. Trump to release his tax returns: 'I'm under audit too. I would be delighted to meet him any place, any time. ... I'll bring my tax return, he can bring his tax return.' @webpagelink"},{"comment_id":"1050627531700165","commenter_b":"Go Hillary!","commenter_a":"I don't think Republicans even talk a good game. Nothing but LIES and the people who vote for them are too stupid to see it.","post_message":"'We cannot – and I will not – put our vets at the mercy of private insurance companies without any care coordination or leave them to fend for themselves with healthcare providers who have no expertise in the unique challenges that are facing our veterans.'   --Hillary Clinton"},{"comment_id":"1014349388612957","commenter_b":"931389766893258R931389766893258o931389766893258c931389766893258h931389766893258e931389766893258l931389766893258l931389766893258e931389766893258 931389766893258C931389766893258h931389766893258a931389766893258r931389766893258l931389766893258e931389766893258s931389766893258","commenter_a":"931389766893258C931389766893258a931389766893258r931389766893258l931389766893258e931389766893258t931389766893258t931389766893258a931389766893258 931389766893258S931389766893258t931389766893258e931389766893258w931389766893258a931389766893258r931389766893258t931389766893258 931389766893258y931389766893258o931389766893258 931389766893258c931389766893258o931389766893258m931389766893258e931389766893258 931389766893258l931389766893258o931389766893258o931389766893258k931389766893258 931389766893258a931389766893258t931389766893258 931389766893258t931389766893258h931389766893258i931389766893258s931389766893258 931389766893258b931389766893258s931389766893258","post_message":"Slavery Happened A Long Time Ago?  Scientist Are Now Saying the Trauma May Be Encoded In The Genes of Black People"}]
