[{"comment_id":"10152969196420796","commenter_b":"So?!","commenter_a":"I am very pleased not to be surrounded by poorly educated, I'll healthed, no skilled illegals and newly landed muslims. Maine people do well to care for Our own. Let the world work it out. America is not a dumping for human trash. Coe with skills and be ready to fly our flag, defend our Constitution, and become a citizen.","post_message":"The state's current demographics resemble what the rest of the country used to look like. In 1940."},{"comment_id":"948395698606028","commenter_b":"Karma's a b**** and so is Hillary Deplorable Hillary LIES MATTER Pay for play Lining her pockets","commenter_a":"It was not a mistake...it is who she is. Angry bitter vindictive with money and power. Glad she was feeling enough pressure to be who she always was. A spiteful mean spirited person","post_message":"When you are president, you are president of all the people."},{"comment_id":"10154512685084411","commenter_b":"No copy paste","commenter_a":"copy paste. This is what you do ? Be creative guys.","post_message":"The Big Mac is dead, long live the DonMac!"},{"comment_id":"1337743466286160","commenter_b":"How about we deplorables boycott all of you talentless walking DUMB LIBTURDS!!!","commenter_a":"These slobs have sold their souls years ago on the casting couch of Hollywood! What do they know about the struggle of the everyday @username! Go back to your fantasy world of make believe, most people live in the REAL world!","post_message":"Hollywood Hail Mary: See who's begging the Electoral College to vote against Donald J. Trump."},{"comment_id":"1185646658122029","commenter_b":"Yeah, thanks fer nuthin'. Don't need some guy's forgiveness for anything. Not lookin' for it, ain't askin' for it.","commenter_a":"No one but God can forgive sins. The Pope and priests are men.","post_message":"BREAKING NEWS: Pope Francis will allow Roman Catholic priests to absolve women who have had abortions if they seek forgiveness, the Vatican announced Tuesday."},{"comment_id":"10153337610537093","commenter_b":"Lol !!! Nice comeback April. #SpokenLikeATrueTenYearOld","commenter_a":"Not surprised at all Texas is a racist redneck controlling state!","post_message":"Rick Perry's good name has been restored... @webpagelink"},{"comment_id":"10156406946480354","commenter_b":"She'll be a thief til her last breath!!!!!!!!!!!!!!!","commenter_a":"Hillary Clinton is a corrupt, old, nasty glory seeker.","post_message":"\"Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" Hillary Clinton is a _________________."}]
