[{"comment_id":"10153108119036037","commenter_b":"We should have been more selective when your ancestors came over.","commenter_a":"Towels and curtains have a purpose in the USA curtains go on windows and towels go in closet.s neither go on our heads ... if you wanna live love and respect ur traditional values then go enjoy them In your country not cram them in the face of good hard working American s","post_message":"Police in North Carolina say they are still investigating possible motives for the killing of three Muslim college students, whose relatives are pressing for hate crime charges against the alleged shooter. Legal experts, however, say a hate crime case could be difficult to prove. @webpagelink"},{"comment_id":"10153514569274228","commenter_b":"@username, although they were religious and studied the bible, they were vehemently against forming a national religion and/or intertwining government and religion.","commenter_a":"This is garbage. Separation of church and state was never and will never be a thing in the cultural vacuum that is the American bible belt.","post_message":"Not everyone is pleased with the new decals"},{"comment_id":"10153934644331336","commenter_b":"Immoral women?","commenter_a":"I wonder what would happen if sexes were reversed. Point is, the guy will be wrong no matter which side he is on.","post_message":"He pinched her, so she punched him... hard."},{"comment_id":"1091727720848238","commenter_b":"Those people should be sterilized","commenter_a":"Everyone who is against this is a damn hippje","post_message":"This is HUGE news."},{"comment_id":"10152758680722144","commenter_b":"Racist pigs","commenter_a":"What the hell are these people thinken DO THERE DUM ASSES KNOW THAT CHILD ABUSE","post_message":"WTF."},{"comment_id":"10153071705477093","commenter_b":"^ Alex I almost did but I knew she as well as many others wouldn't grasp that concept.","commenter_a":"\" AGAINST HATE\" in Dallas,Texas SEPTEMBER 14, 2015- MONDAY At the American Airlines Center At 5:30pm....all those that want to stand against hate are welcomed. march to the... American Airlines Center In Victory Square...from Cathedral of Guadalupe Off Ross St in Downtown. Police Department will be on site but I would like to note that everyone should be very cautious & on guard. There have been reports that peaceful protesters have been attacked by Trump supporters & some dressed like protesters & assult others within the crowd & reported spitting in their faces. Have your groups be alert & camera rolling just in case, if this happens, attackers can be on record & prosecuted! Thank you everyone & remain peaceful yet boldly stand for Justice. Arm & Arm. Wearing Red,White & Blue colors.","post_message":"A \"Dump Trump\" rally is now scheduled ahead of Trump's rally in downtown Dallas tomorrow."},{"comment_id":"10152867281821051","commenter_b":"Give it your best shot bitches","commenter_a":"Full of crap","post_message":"ISIS just announced the specific targets they’re looking to blow up – including the American ones."}]
