[{"comment_id":"1935250666534672","commenter_b":"How about i kick you instead?","commenter_a":"Look like they're from the bloody Purge","post_message":"... But refuse to quit because they 'love the limelight'."},{"comment_id":"10153686445776336","commenter_b":"Any illegal here who has family Who is here legally, the LEGAL family should be hit with a fine/special additional tax to pay for their illegal family here!","commenter_a":"Deport illegals! And all the money that are spending for them should be given to our vets!! Trump is the one who cares about Americans!","post_message":"\"Right now — and you know it — we have illegal immigrants that are treated better, by far, than our veterans.\" – Donald J. Trump (via Fox Business)"},{"comment_id":"987975737904514","commenter_b":"obitch isn't happy unless she's ruining things for chidren","commenter_a":"She has no Constitutional authority at all...why do we allow her interference in our schools, homes and communities?","post_message":"Michelle Obama wants to BAN HALLOWEEN!"},{"comment_id":"10152923328206051","commenter_b":"Screw you bitch.","commenter_a":"It don't count it was just a dog.","post_message":"This guy knew his injured neighbor couldn’t take her dog out for a walk, so he offered to. While the two were out, he killed it with an ax. Guess how much jail time he got. Wrong. Less."},{"comment_id":"10153360842296162","commenter_b":"Hope they enjoy their 72 male virgins.","commenter_a":"Fuckkkkkkkkkkkk Muhammed!!!!!","post_message":"COP SAVED LIVES: The officer who returned fire at two men who shot assault rifles outside an event displaying cartoons of the Prophet Mohammad \"saved lives,\" according to authorities @webpagelink"},{"comment_id":"931654693541670","commenter_b":"It's not just barbaric, it is one more tool of the rich used to keep the not-rich \"in their place\".","commenter_a":"I guess when you have universal medical coverage you don't realize what a nightmare our system is.","post_message":"The headline really begs the question, who the hell would ever want to visit the United States knowing they could be bankrupted if they should need medical care while they are here?/"},{"comment_id":"1230794190274923","commenter_b":"Umm for a free orgasm I bet you would.","commenter_a":"@username how do we get our hands on some of those mushrooms!","post_message":"This fungus can give a woman an instant orgasm."}]
