[{"comment_id":"10153478653615950","commenter_b":"Here come the pro-trump/Hillary is the devil comments. I stand by Hillary and will gladly vote for her in November. #Hillary2016","commenter_a":"She does not care, just wants them votes!!!","post_message":"Hillary Clinton  takes a swipe at Donald J. Trump's \"neutrality\" during her AIPAC speech: America \"can't ever be neutral when it comes to Israel's security or survival\" @webpagelink"},{"comment_id":"1841493012732673","commenter_b":"Another Asshole.... crawl back under the rock you came out from and take that Orange face dumb ass with you","commenter_a":"Really??","post_message":"Straight from the horse's mouth!"},{"comment_id":"1048204431922451","commenter_b":"in the beginning of his campaigned media said he was a Muslim,friends of the activist terrorist eyre and his pastor mentor for 20 yrs condemned America,his wife hate America, the only PRESIDENT APOLOGIZED FOR AMERICA and the people still vote for him, and look America now, bankrupt morally,financially,economically and bankrupt spiritually. AND THE BAD NEWS HILARY GOAL IS TO FOLLOW HIS STEPS. IF ANY ONE OF DEMOCRATIC WIN, THE END OF AMERICA . WE WILL BECOME A SOCIALIST ,COMMUNIST COUNTRY LIKE CUBA AND SOCIALIST COUNTRY OUR LIFE WILL RUN BY THE GOVERNMENT. YOUNG PEOPLE ARE BRAINWASH OF THE SOCIALIST TEACHERS IN SCHOOL AND UNIVERSITIES. PRAY FOR OUR COUNTRY AND YOUNG PEOPLE,","commenter_a":"I have been saying that for years!!! He isn't going to do anything to hurt his peeps.","post_message":"Former CIA Agent Says Obama is Working With The Muslim Brotherhood Against America. ⋆ Please Share ⋆"},{"comment_id":"10156175589090354","commenter_b":"Arrogant hateful ole hens that arent worth the waste of time!!","commenter_a":"Liver Transplant Recipient of 4 1/2 years. The Doctors saved my life in surgery but the Nurses kept me alive and watched over me and I would not be here without them. Bless them all.","post_message":"The #NursesUnite movement is mobilizing against liberal co-hosts of \"The View\" Joy Behar and Michelle Collins.   But now, new arrogant and elitist behind-the-scenes comments are coming to light and sparking further uproar with nurses across America..."},{"comment_id":"1814101218857117","commenter_b":"When you walk into McDonalds they already had yo order ready , \"ay 3 big Macs to the front, this fatass just walked in here...\" built ass, you sitting down eating on a bean burrito & yo bitch walk in butt naked all you can do is *munch munch on food* \"uhh tf I'm supposed to do with that?\" Gay ass outta here","commenter_a":"What kinda fake ass pink sack of waste of human flesh trump supporting stds catching macaroni and cheese smellin diaper full of shit stain 'my dad a lawyer' \"Just bought 2 big nos tanks for my honda and added turbo that way when I drive it goes really fast like 300 mph\" lookin ass damnnn 'Daniel back at it again with the pink verses fruity man' head ass \"wanna hot dog on a stick?\" Head ass normie fuckboi made this meme?","post_message":"This man is a genius ahaha #WSHH"},{"comment_id":"10154319112003812","commenter_b":"Cover that nipple, girl.","commenter_a":"Time and a place for everything that was not the place. Plain and simple.","post_message":"Woman says she was kicked out of a North Carolina courtroom for breastfeeding during a child custody hearing. \"Ma'am, you need to cover up.\""},{"comment_id":"1112148695548048","commenter_b":"Imagine if Hillary did all the finger wagging that Bernie does in debates?","commenter_a":"Men can get away with anything this election season that women (Hillary) could not. Waving their arms, swearing, making fun of people...anything goes.","post_message":"Social scientists have found the exact same affect by a woman simply doesn’t play the same way."}]
