[{"comment_id":"10152917139561051","commenter_b":"Kim, Please show me where the white kids were doing this. I must have missed this.","commenter_a":"Can anyone explain why blacks act like this? Is it something about IQ?","post_message":"These kids thought it would be funny to jump on people's cars and dent them. It took about a minute before someone noticed and decided to make them regret it."},{"comment_id":"10153722201678812","commenter_b":"He is a Hero..","commenter_a":"Prayers for family. The boy is a hero","post_message":"Charlie Finlayson had to leave his father and set off alone on a hiking mission to find help: @webpagelink"},{"comment_id":"894432780616200","commenter_b":"Baltimore is am example of liberal policies failure people want jobs not government social handouts","commenter_a":"This is a Democrat liberal myth if any of the Democrats they would read a history books they would learn that the Democratic Party was the original racist party remember Lincoln was a Republican","post_message":"Can't say we weren't warned ahead of time this might be a problem."},{"comment_id":"10155501213150354","commenter_b":"New campaign slogan: A burrito in every pot and a hooker in every bed...Vote for Hillary","commenter_a":"Why not, Hillary has been a pro at f**king everybody.","post_message":"Bill Clinton hits the jackpot."},{"comment_id":"1740170942902081","commenter_b":"Yeah! Say that to UN! They should go to thoses places rather than bothering Philippines!","commenter_a":"Philippine leader must have nothing better to do... He just want to become famous for a little bit...Do you want to see humans right violations every day? Do you want to see people getting kill by the government? Do you really want to help people because humans right violations?? Go to Cuba!!! Go to Venezuela!!!!!move to Central America!!!! You idiot!!!","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"918244381576759","commenter_b":"She is a freaking fat ass I've seen pictures of her shoveling food in her fat face the fat bitch","commenter_a":"Serve it or she'll dip her balls in the mashed potatoes and gravy!","post_message":"Michelle Obama Orders Schools To Feed Children Her Slop Or She Will... Ugh. Totally gross! SPREAD THIS EVERYWHERE! @webpagelink"},{"comment_id":"10154024812315470","commenter_b":"Lol, whatever you have to tell yourself... moron.","commenter_a":"Seeing how anti-science Bernie is and how his followers uncritically swallow his anti-science stand I wouldn't be shocked by the numbers that try this.","post_message":"BE ON THE LOOKOUT! A picture going around on social media looks like an ad supporting Bernie Sanders, offering instructions on how to make so-called Bernie Sanders glow sticks. The recipe is actually for a deadly chlorine bomb."}]
