[{"comment_id":"1583049088381782","commenter_b":"@username crazy women beat their selves up.","commenter_a":"Before this is over, the \"two women\" will be just ONE MAN, and the \"abduction\" will likely turn into an \"affair\". The reason why she is saying it was women, is so that there's no suspicion of rape. = Less of an investigation.","post_message":"Authorities are searching for two women suspected in the abduction of a California mother. via NBC Bay Area"},{"comment_id":"530303733802764","commenter_b":"Today is your Birthday? Well, then Happy Birthday!!!","commenter_a":"Happy birthday! God bless","post_message":"My birthday wish is that our nation would once again recognize God as our leader."},{"comment_id":"760923940676233","commenter_b":"This lady is an idiot","commenter_a":"Oh well","post_message":"\"White folks gotta give up something\" - Marissa Jenae Johnson, cofounder of Black Lives Matter"},{"comment_id":"947324245313643","commenter_b":"Sick witch, heartless.","commenter_a":"Arrested her","post_message":"Police say woman hid body of dead son in trunk of her car. According to police, the boy was last seen in 2004. @webpagelink"},{"comment_id":"10152784839266680","commenter_b":"Oh hell no...","commenter_a":"Universal speed Bernie, your track record is AMAZING and your heart is filled with incredible passion! Thank you for FIGHTING FOR US #berniesandersforpresident #wallstreet #monsanto #earthfirst #love #care #animalsmatter #politics #gasland #environment #oceans #earth #america #goodpeople #bernie #hillary #hillaryclinton #jebbush @webpagelink","post_message":"Democratic Whip Steny Hoyer: \"We will dictate that the only people who can serve are the rich and I don’t think that’s what the Founding Fathers had in mind.”"},{"comment_id":"10153161322294726","commenter_b":"If she moves her lips She is lying","commenter_a":"Think she bad now if she WIN. White house .no stopping HER","post_message":"WATCH: Bombshell Report Clinton Did Use Private Email For State Department Business"},{"comment_id":"10153283124151316","commenter_b":"Blackie Chan where does a gorilla get his protein? The gorilla does not eat any meat, This beast can throw a 200lb man across the street with one arm....maybe dark greens.....","commenter_a":"What's your protein source?","post_message":"Man says raw food diet has made him 'almost superhuman'... @webpagelink"}]
