[{"comment_id":"10157043455730206","commenter_b":"May God keep you stronger, Celine","commenter_a":"So sorry for your loss!","post_message":"Celine's brother Daniel had been battling cancer of the the throat, tongue and brain."},{"comment_id":"10154323192091051","commenter_b":"Where do you people come up with this nonsense?! How is $30, for an ID, that lasts for years, beyond anyone's budget? The only people that can't get IDs, are people that are here illegally! FYI: states, and various organizations, will pay for a poor person's ID; There are no excuses!","commenter_a":"Lets get one thing straight, it isn't about the ID cards. Its about how, where ,what ,when ,and cost of those cards that determine whether they are a fraud protection, or a voter suppression! If IDs are required, it should be incumbent on the states to see that every eligible voter has one, therein lies the rub! By charging for them, even a little, it puts it out of the reach of some peoples budget. By placing the outlets for the cards away from wards and precincts with opposition voters in large numbers, such as the inner city that tends to vote Democratic, you can insure that many won't have them and therefore affect the vote. By requiring a special card and locating it well away from colleges and universities, you can limit the number of out of state students that vote, especially when the college is rural, since students ...","post_message":"Michigan legislators just passed the strictest voter ID law in the nation. Do you support voter ID laws?"},{"comment_id":"10153400467734228","commenter_b":"Why would anyone expect there are appropriate records if baby stealing was happening? Poor women!","commenter_a":"Records are only as good as your charting if it's not written down it didn't happen ! That's law never said it was a good law so a lot could have been left out","post_message":"\"You are trying to kill my character. You`re trying to lie and say I was at one hospital and you can keep up your records that good.\""},{"comment_id":"10153638037189778","commenter_b":"Wait. What?!? Trixie, sorry for not telling you, but I cannot have crazy women, or effeminate looking men stabbing people to death in my hotel.","commenter_a":"@username Donovan Hotel? You never said a thing about it. ;)","post_message":"POLICE NEED YOUR HELP! Police say this person is suspect in the stabbing death of a 30-year-old lawyer in NW DC. Please SHARE to help him/her to justice."},{"comment_id":"10153216754526167","commenter_b":"Madam President get used to it.","commenter_a":"But Hillary sucks","post_message":"Finally, everyone starting to agree that we need to shut it down. It's instructive to look at how we got to this point."},{"comment_id":"10153720423624312","commenter_b":"Thank you. I let my daughter go camping!","commenter_a":"Poor parenting skill for letting her daughter go camping, wow he is delusional.","post_message":"Shirley Fortner, 70, has re-lived the night of her daughter death five times during five prior parole hearings. Bret Arbuckle killed Angela Lyn Fortner in rural Ash Grove, Mo., in 1989."},{"comment_id":"10153306545444575","commenter_b":"Its hard to trust the justice system when everyone isn't treated equally","commenter_a":"I'm sure anyone could argue \"what the parent should have/have not been doing\"... It only takes a quick look away for something like a car accident or a child to run out in the street to happen. What's unfortunate , is that we as people, don't trust the justice system when we face situations as such and feel the need to take matters in our own hands. Praying for both of the families in this loss.","post_message":"A driver and his teen passenger were shot and killed by an unknown gunman while talking with police. Right before the shooting the driver hit and killed a toddler who ran into the street. “Today is not a good day — when an infant can lose his life, and then someone, a Good Samaritan tries to do the right thing and then all of a sudden a tragedy occurs,” said a city official."}]
