[{"comment_id":"10155025944411509","commenter_b":"That is not a woman.","commenter_a":"Why is this even news. Do we report on all suicide attempts by convicted criminals or just the Transgender ones ? Bias, bias, bias....","post_message":"U.S. Army soldier Chelsea Manning, imprisoned for leaking classified documents, tweeted that she was \"glad to be alive.\""},{"comment_id":"10153810212319087","commenter_b":"stupid picture talking bitch. @webpagelink","commenter_a":"this is good. \"Rarely does a presidential election hit the unthinkable issues that can completely divide a nation and endanger the peace and security of that nation. It seems Donald Trump is poised to kick down doors concealing issues that mainstream media and mainstream candidates fear to even discuss. The competence level of our leaders in government and their weak attempt to compete in world markets is one of this countries forbidden issues. The other forbidden issue is the democratic party position that Islam has nothing to do with violence, as opposed to Donald Trump explosive position that hates us. It a good bet that America is about to get an education in what Islam represents and what its intentions are, as perceived by Donald Trump. I believe the two afore stated issues will sharply divide the American electorate and could possibly threaten the peace in some instances. Donald Trump ...","post_message":"Here are five of the most important primary fights to watch this month that could determine who will win this fall's battle for control of Congress."},{"comment_id":"10157063927485725","commenter_b":"#ByeByeCrookedHillary","commenter_a":"Wipe terrorism off the map...so many countries suffering...and who knows...without TRUMP we WILL be next...TRUMP 2016","post_message":"Thank you Lt. Steven Rogers. We will respond to terrorism with strength in 2017!"},{"comment_id":"10154883031433010","commenter_b":"Illegal Immigrants have been paying taxes for the longest time. Look it up. I suppose you don't want that money either.","commenter_a":"Those law makers assume that all Californians want this, many of us don't want lawless immigration, no matter what country they are from. We don't like that our laws aren't being enforced and our budget and resources for our state are being given away to non-Americans.","post_message":"California's fighting back."},{"comment_id":"1313221025411316","commenter_b":"Big ear bitch stfu","commenter_a":"Keep resisting arrest dumbasses 👌🏼... If you do what your told you'll be fine If not well then that's yo fucken fault Don't try to fight them , especially against a lot of cops.., that's retared your gonna lose If your rights are violated then take them to court. 😮👌🏼. Hopefully you guys learned something from this video","post_message":"Where the officers being too aggressive? #WSHH"},{"comment_id":"1009175035805692","commenter_b":"Thanks god being a feminist is hip again!","commenter_a":"Sweet","post_message":"A 12-year-old feminist named Olivia wrote Hillary this brave, heartwarming letter. Olivia 2040, anybody?"},{"comment_id":"1820054648241595","commenter_b":"I agree the farther him an his tranny wife are from the white house the better !","commenter_a":"What is wrong with you people. Thank God he's on vacation and not going to get involved and make things worse!","post_message":"Nothing gets in the way of Barack Obama's golf game."}]
