[{"comment_id":"10153380454004270","commenter_b":"Well lady if you want the horrors of War you go for it.","commenter_a":"Can they take the mental pressure of War. And getting raped by someone like ISIS?","post_message":"\"I think women are showing they can do the job. Physical capability is not the issue; it’s men’s acceptance of women that’s the issue.\""},{"comment_id":"10155292076102501","commenter_b":"can't we keep her out of this state somehow? I tihnk every time I see her kids commercial how many unborn infants have died because of her support for abortion. Protect kids? Get serious lieing Hillary","commenter_a":". --------------------------------------------------------------------- HILLARY - BREAKING THE GLASS CEILING? --------------------------------------------------------------------- Mrs. Clinton, how can I possibly tell my daughter to follow you as an example after you allowed your husband to assault and demean multiple women throughout his political career? Were those women not important? Tell me, will you fight for my rights like you fought for those womens? Ummmm, I hope not. What about the sisterhood, Mrs. Clinton? Did you expose your husband for his abuse? No! Instead, you enabled him as the abuser and tried to silence his victims. How can you live with yourself? Female empowerment? ......... Nice try!","post_message":"Hillary is coming back."},{"comment_id":"1583910615243254","commenter_b":"She's worth no comment","commenter_a":"Illuminate","post_message":"VIDEO! Cops are being slaughtered since Beyonce's Racist anti-cop performance. In 8 days 8 cops were murdered, and many more shot!  SHARE THIS EVERYWHERE!"},{"comment_id":"10154469965885579","commenter_b":"Why would that surprise you Mr. Brown, Mr. Trump becoming the next President of The United States is a blessing compared to it almost not being America at all thanks to all the corruption of this Government and the Politicians letting it be taken over my illegals that pretty much rule OUR COUNTRY, PRAY TO THEIR GOD ON THE SOIL FOUGHT MY THE MEN AND WOMEN OF OUR VETERANS AND ACTIVE SERVICEMEN , THAT WE OURSELVES AS AMERICAN CITIZENS ARE DENIED, BURN OUR COUNTRY'S FLAG AND I COULD GO ON AND ON, BUT LETS JUST SAY \"CHANGE IS COMING, THOSE GETTING A FREE RIDE WILL BE OVER, THE RICH GOVERNMENT WILL NO LONGER BE LIVING HIGH ON THE HUG, THE POLITICIANS WILL NO LONGER BE MAKING DIRTY DEALS AND ROBBING THE AMERICAN CITIZENS OF THE HARD EARN MONEY !! Yep he made it this far because he's one of US ...","commenter_a":"I'm seriously embarrassed that this man can make it so far in our country. He takes what class the GOP had and throws it to the wind.","post_message":"Donald J. Trump: \"Tonight we close one chapter in history and we begin another.\" Watch complete speech here: @webpagelink"},{"comment_id":"10152967828847061","commenter_b":"Yes legal immigrants ma'am","commenter_a":"I am ashamed at the negative narrow minded comments. Check your heritage. We are all immigrants","post_message":"America Ferrera to Donald Trump: Thanks, your comments will send more Latino voters to polls: abcn.ws/1Iw7NNn"},{"comment_id":"386115264910101","commenter_b":"She needs to die. She would never have gotten any place in this country without white people. I hate that racist trash.","commenter_a":"She sounds like she is mad at the world .","post_message":"Oprah plays the race card again..."},{"comment_id":"10153247991679342","commenter_b":"Abortion is good. They should abort all babies born before the mother is 25","commenter_a":"here we go, \"all these people worried about worms in the water and nobody cares that planned parenthood is selling dead babies!\"","post_message":"One woman said she first noticed the worms yesterday in her bathtub and after collecting a few, she heard neighbors found the same thing.   @webpagelink"}]
