[{"comment_id":"10152739973466519","commenter_b":"The Democrats are the snakes. Here come the eagles.","commenter_a":"At least the Republicans are growing a spine and starting to stand up to the Democrats properly rather than just whining about impeaching Obama.","post_message":"It took long enough, but here's how Obama realized that playing nice with Republicans is a sucker's game..."},{"comment_id":"10153564606248984","commenter_b":"She needs to be taking down. She not worried about what you doing. This needs to be done quickly","commenter_a":"She should not be allowed to run. She is a liar bad person evil evil !!!! If she gets in people pack your bags go anywhere don't stay here she will put the cherry on the demise of our country !!!!!!","post_message":"Hillary’s been caught in another blatant LIE regarding her private email server. In a recent interview, Hillary said she had not been subpoenaed by the Select Committee on Benghazi, but records indicate she was subpoenaed in March 2015. Even the press covered it!  Rep. Trey Gowdy won’t tolerate her deceit, and neither will we.   Send a message to Rep. Trey Gowdy telling him what you think!"},{"comment_id":"888687604591297","commenter_b":"@username freedom of speach bitchhhh","commenter_a":"Yo man if you really care about the U.S.A and everyone in it there is something you should do... \\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b$18,152,809,942,589 is our current debt... Donate all your money except a mil to our debt... A mil is a lot more than most of us will ever see... Your money wouldn`t even really touch our debt but still would help... If you really care help us out... It wasn`t the average Joe`s fault... It was the all politician`s fault\\b\\b\\b\\b\\b\\b\\b\\b... Help us out bro and you`ll earn my vote...","post_message":"I've created tens of thousands of jobs and I'm really good at it. As President, I WILL get America back to work! #MakeAmericaWorkAgain"},{"comment_id":"574693549357266","commenter_b":"Whores don't have souls, so yeah...","commenter_a":"so legalise drugs, legalise prostituion, are we just going to start legalising everything?","post_message":"\"Being a sex worker isn't about lack of choice. If I really had no choice, I'd be working in a garment factory.\""},{"comment_id":"10154282425457439","commenter_b":"Pussy's","commenter_a":"They are clueless","post_message":"The Armenian and Greek genocide by the Muslim Turks is reason enough not to build such a mosque. And what makes these knuckleheaded officials so sure that the imam won't teach and preach jihad. The jihadic doctrine is a critical component of Islam."},{"comment_id":"10153215543531519","commenter_b":"She now has to move from comedian to propagandist. Not an easy feat","commenter_a":"Last nights show was unfunny. Amy Schumer was not funny last night IMHO. She's really being pushed right now, and while I think she can be funny, there are way funnier female comedians.","post_message":"Watch: Amy Schumer crushed it on \"SNL\" last night, but this gun commercial parody might be the most brilliant short clip the show has done in years"},{"comment_id":"1358974884162256","commenter_b":"All these fat women suddenly come in and attack her breasts? Like, I can see the v necks but in this day and age, you call that too much? Stay jealous.","commenter_a":"You look amazing! Good for you!","post_message":"She was drinking four litres of Coca-Cola a day  (Via Daily Mail Australia)"}]
