[{"comment_id":"1558544671099313","commenter_b":"Go to hell","commenter_a":"He is such a joke ! I wish he would go back to where he came he's not even an AMERICAN !!!!!","post_message":"This makes my blood boil!"},{"comment_id":"1420936454624649","commenter_b":"I hope that this administration will figure out how to keep us safe without becoming totally isolationist. Not all immigrants or Muslims are terrorists. Weed out the bad but don't turn away those who honestly need our help and who only want to make this counrty a better place.","commenter_a":"Do you know you have done more than every other country to help?","post_message":"Senior Politics Writer John Haltiwanger is at JFK International Airport where there's a massive protest against President Donald Trump's refugee and Muslim traveler ban."},{"comment_id":"489966784527235","commenter_b":"Fuck em and feed em pork","commenter_a":"Yes.","post_message":"Radical Muslim group CAIR orders that Obama exempts them of this.  They are dangerous, and so is our president.  Do you agree that Obama is a threat to the United States?"},{"comment_id":"999687850098947","commenter_b":"FGM - Female Genital Mutilation. The stats about it: @webpagelink","commenter_a":"The awkward moment where liberal values clash with Islam and no one wants to stand up for the gay man to avoid insulting Muslims...","post_message":"“My religion is very clear about what happens to gay people...'"},{"comment_id":"10154426729152446","commenter_b":"Wtf. Who do they think they are. Little unqualified woman","commenter_a":"wth???","post_message":"'@webpagelink"},{"comment_id":"1156510771035618","commenter_b":"Maybe criminals should stop shooting people unwarrantedly","commenter_a":"Maybe police officers should stop shooting people unwarrantedly?","post_message":"Authorities are hunting for the gunman."},{"comment_id":"1039445359429269","commenter_b":"Ewe, she looks drugged. GHB, JEB.","commenter_a":"I hate that... its like telling you , your my pet.I be your master.","post_message":"At least the younger Bush is a little more smooth with his moves."}]
