[{"comment_id":"10153341180476545","commenter_b":"Didn't a Muslim refugees came to U.S.A and took part in 9/11? So yes we have seen American Idol attacked be a refugee","commenter_a":"Funny... I do treat people the way I wish to be treated, I have not once cut off anyone's head.","post_message":"Their voices: Both sides of the Richardson mosque protest VIDEO: @webpagelink"},{"comment_id":"801914353278362","commenter_b":"Trump will crush this fat ugly lying lady","commenter_a":"Love how the little girl scout is pointing out the cookies to you. Rock on Hillary -supporting you in Colorado. Ignore the haters inWV","post_message":"Cookie stop in Kentucky. Picked up some tagalongs and samoas before heading across the border to West Virginia."},{"comment_id":"988198774550796","commenter_b":"shes to stupid to even understand her own thought process...","commenter_a":"Learn self control, honey. Everybody was quick to pull out phones and record it! I have great respect for the lady who was talking to her but I have more for the woman who got up and got her kid out if there. This was just stupid, shouldn't of happened. Looking for a pay day.","post_message":"“She wouldn’t leave when asked and became more agitated throwing a paper she grabbed from over the counter and pulling away from PennDOT officials.”"},{"comment_id":"10154114920114726","commenter_b":"She is an assault magnet!!","commenter_a":"What do Leonardo DiCaprio Congressman Allen West, the NYPD and Students for liberty all have in common? They all had assault charges filed by Michelle Fields......who is Michelle Fields>? The Woman who is claiming she was assaulted by Mr Trump's Campaign manger. Check her background.","post_message":"Even liberal Susan Sarandon thinks Trump is better than Clinton."},{"comment_id":"10152973288751130","commenter_b":"No its sad you women believe that men always negotiate harder. Please provide some scientific evidence of this, other than that try harder.","commenter_a":"Isn't that sexist to say men negotiate better than women? Lol","post_message":"“Men negotiate harder than women do, and sometimes women get penalized when they do negotiate.\""},{"comment_id":"10154189490969497","commenter_b":"Most teen girls are total bitches, even those with cancer.","commenter_a":"they always use a teenage girl for this example but never a teenage boy that does the same thing/worse :P","post_message":"Though the chemotherapy Rachel Fullerton is undergoing often makes her weak, she said she has strived to maintain her typical routine of rolling her eyes and sighing loudly anytime an adult addresses her."},{"comment_id":"10157164250770206","commenter_b":"yeah allowing syrian refugees into your country , with no skills or money , will really bring about progress and sustained growth.","commenter_a":"nope not gripped by it.","post_message":"The Turkish Coast Guard has released a gripping video of a Syrian refugee being rescued after his boat sank – killing 27 people, including at least 11 children. @webpagelink"}]
