[{"comment_id":"10150728672209999","commenter_b":"Well rebecca I'd recommend finding a director with more credibility before trying to gain traction on this movement. I'm not saying they're unjustified in their claim but Spike Lee is a pos","commenter_a":"Spike Lee hasn't made a good movie in over a decade so who really cares.","post_message":"The outcry over the nomination of 20 white actors, and no black ones, for the coming Academy Awards gained momentum on Monday — MLK Day — as Spike Lee and the Jada Pinkett Smith announced that they wouldn’t be attending the ceremony."},{"comment_id":"1632662777034101","commenter_b":"Hope she cheats on you!","commenter_a":"I did the same thing to my fiancee. I told her if didn't register to vote, I'd be mad. She did register. When it came the time to vote early, she feet - dragged. And I told her if you didn't vote for Hillary Clinton, our relationship would be over. She voted. Emails or no emails, Hillary all the way!","post_message":"'If you didn't vote for Hillary Clinton ... I'll seize your phone, I'll seize the car.'  Watch this mom's impassioned plea for her son to vote for Hillary Clinton."},{"comment_id":"1228827110542853","commenter_b":"Liberals dont like putin cause they love isis","commenter_a":"So this is liberalism?","post_message":"She says Trump needs to step down before the inauguration, and the audience agrees!  Shared by Occupy Democrats, LIKE our page for more! Video from The View."},{"comment_id":"1929449190619936","commenter_b":"Trump will not get a record number of votes. No way. This is going to be the biggest landslide in modern American history.","commenter_a":"My prediction in this election is that Trump will get a record number of votes beating Hillary. But Hillary will get the electoral vote giving her the presidency. The electoral is there so the establishment gets final say. Sad but true. Isn't that right Bernie Sanders.","post_message":"Donald J. Trump says he would 'promise and pledge' to accept the results of the election --- if he wins."},{"comment_id":"10153196939420047","commenter_b":"Remove yourself from The United States of America. You Don'T America's Ways. LEAVE!!!","commenter_a":"It probably should be removed. Does a nation that promotes the murder of the unborn and celebrates a counterfeit'marriage' trust in the one, true God who has revealed Himself in Scripture? Nope. Meaningless words that don't impress the God of all creation at all. Repent and believe the Gospel.","post_message":"Avowed atheist Michael Newdow is at it again.  He's just filed a federal lawsuit demanding that 'In God We Trust' be removed from U.S. currency.    We must remain vigilant in defending the Constitution from yet another assault on our religious heritage."},{"comment_id":"452057048331142","commenter_b":"I'm in love I think! She hit the nail on the head.","commenter_a":"You tell'em Grans....","post_message":"Race-Baiting CNN Host Is Shocked At Grandma Answers To His Questions:  is no such thing as  privilege' [VIDEO]"},{"comment_id":"10156488324870093","commenter_b":"About time now shoot the poachers especially dentists lol","commenter_a":"Thanks!!","post_message":"Yay!"}]
