[{"comment_id":"1269059086447452","commenter_b":"Can you imagine how outraged the freeloading Obama brown nosers minion would be if that would be the Obama girls.","commenter_a":"But the images of the Obamas as monkeys is ok?","post_message":"Sen. Ted Cruz launched an \"emergency\" fundraising appeal after the Washington Post published a cartoon online depicting his daughters as dancing monkeys."},{"comment_id":"1022812631106658","commenter_b":"You fucking cooks make this world more dense and dumb","commenter_a":"The cures are out there stop suppressing them","post_message":"Real talk for a second: someone I love very much has recently been diagnosed with terminal cancer, and I find myself growing even angrier with the charlatans who promise miracle cures and insult the incredible doctors and scientists who are working so hard to help the people afflicted with this terrible disease. They prey on desperate and sick people to line their own pockets. \"There is no alternative medicine. There is only medicine that works and medicine that doesn't work.\" Richard Dawkins Image via the Food Hunk."},{"comment_id":"10152731106111051","commenter_b":"Yet if you speak out against it, you are \"behind the times\" or \"living in the past\". We need to turn the clock back about 50 years to see what a moral society looks like and I am not just talking about the gay agenda. I am talking about adultery, divorce, teenage pregnancy, children born out of wedlock and anything else that used to be immoral that we are forced to accept today.","commenter_a":"Um, did they leave the word \"incest\" out of the story on accident??","post_message":"This girl never really knew her father – until they ended up dating."},{"comment_id":"10153563776309170","commenter_b":"Oblowme you are such a disgusting pussy!!!!!!","commenter_a":"Of course he does. Anyone surprised?!?","post_message":"Remember: Nothing is ever his fault. The buck, without fail, stops somewhere else."},{"comment_id":"1148960128472164","commenter_b":"Beat the whore","commenter_a":"Ok idiot, lets say this girl had no idea he was married and after realizing how dumb you are, he leaves you bcz he knows deep down that he is to blame not the girl....","post_message":"A woman found out that her husband had been cheating. She grabbed three of her friends and tracked down the mistress. What she did next is something you have to see to believe."},{"comment_id":"10154083249768984","commenter_b":"you bitch you took away something that is all American and turned it into a race baiter bunch of bullshit you and jazeeee suck please move","commenter_a":"behind the sheriffs all the way! DISGUSTING, RACIST, C!","post_message":"When these sheriffs saw what Beyonce was doing in front of the biggest TV audience of the year, they knew there was only one thing they could do... Do you support these sheriffs?"},{"comment_id":"10153705912357217","commenter_b":"Morons.","commenter_a":"There needs to be an investigation into the biased remain reporting by the publically owned BBC, a petition is needed to force an investigation by the government that will hopefully result in the breakup and sell off of the corrupt paedophile luvies club and their bully boy licence fee tax collection department too, good riddance!! #ENDBBC!😡","post_message":"EU leaders say the UK must move swiftly to negotiate leaving the organisation bbc.in/euref #BBCShorts"}]
