[{"comment_id":"736534466449620","commenter_b":"RADICAL ISLAMIC TERRORIST MURDERED THE 49 PEOPLE IN ORLANDO!! ...NOT GUNS!! KEEP AMERICA ARMED! OBAMA WANTS TO DISARM EVERYONE EXCEPT RADICAL ISLAM.","commenter_a":"What the heck? How ridiculous is this?!!!!! These are grown people in huge positions of leadership acting like fools. This is messed up!","post_message":"Louie Gohmert crashes the 'sit-in' and drops some truth."},{"comment_id":"10153503601036770","commenter_b":"BLM? not at all! worthless savage racists. if they think that their worthless lives matter then go into the dangerous crime ridden ghettos created by blacks and convince them to stop killing each other. I would rather give black thugs target practice so that they don't hit innocent bystanders when trying to shoot each other.","commenter_a":"SCREW BLM...","post_message":"A controversy has erupted at Dartmouth College after a pro-police display was torn down by Black Lives Matter activists, who denounced it for memorializing the 'perpetrators' of 'state violence.'"},{"comment_id":"10152780915443124","commenter_b":"the person who insists on letting everyone know their phone conversation in a public place #AmazonGiveaway","commenter_a":"The GravyMaster","post_message":"Add a name to the  and live like  by entering the Amazon.com  Blacklist Villain Sweepstakes for a chance to win a trip for you and a guest to NYC including airfare, hotel accommodations, and more. To enter for a chance to win, respond to this post in the comments below with one sentence or less naming your own The Blacklist villain (please include #AmazonGiveaway in your comments). @webpagelink  Don forget to watch  Blacklist, available on Blu-ray, DVD, and Amazon Instant Video US. @webpagelink  Ends 2/2/2015 at 11:59 PDT. We will reply to the winner's randomly selected comment with instructions on how to claim the prize. NO PURCHASE NECESSARY. See Official Rules: @webpagelink"},{"comment_id":"886419331393489","commenter_b":"Blacks have been raping, stealing and destroying everything they touch as long as they have existed and are still doing it today but t hey also never create anything. If you don't believe it just look at Africa that they are so proud to be from it hasn't evolved much from cave man days. So STFU Othello you racist douchebag.","commenter_a":"First of all not all black people shoot police, you have a bunch of crazy white people you can include, and also rednecks or countrymen use foul language and abuse women so are they considered thugs considering he said what a thug is ?","post_message":"TRUTH"},{"comment_id":"10153646612799071","commenter_b":"Thank you my sweet. Lucky dog!","commenter_a":"'@username here is the video I was talking about 🐶","post_message":"Rumbo Mediterráneo quit his job to kayak the sea with his dog."},{"comment_id":"1287965734605309","commenter_b":"Fuck Trump. There's my dignity. I'll grab him by the pussy.","commenter_a":"All of you need to remember that you are not in the fourth grade anymore, and that we can actually behave as adults. Cut out the filthy language and the belittling insults. If you have something to say, say it with a little dignity. Also, try to improve your spelling and grammar.","post_message":"Gullible fools...  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152803478324877","commenter_b":"And so are you......","commenter_a":"Cosby is guilty.","post_message":"Malcolm-Jamal Warner Breaks His Silence On The Bill Cosby Rape Allegations. Read what the 'Theo' actor had to say about his TV dad.   Grio fam, is this a fair comparison for him to make? Sound off."}]
