[{"comment_id":"1111506912205431","commenter_b":"The video basically implied that Donald Trump was a racist simply because he doesn't want illegal immigration in this country. There is an enormous amount of drug trafficking, Sex trafficking and a lot of bad people are coming through our borders. Yes their are a lot of great Latinos in this country and my husband is one of them but what basically everybody is saying is that Donald Trump is a horrible person and a racist simply because he wants to stop illegal immigration in this country. let's not get started on what people are saying about Donald Trump supporters. That we're ignorant that we are racist. And please don't lecture me on how I should respond to things! Like I'm some child in a classroom and you're the teacher. You're being extremely condescending.","commenter_a":"This is total bullshit!!Mexicans that think we are racist because we want to have a wall how about the wall you have between Guatemala and the Mexico border. None of you ever answer that question. (and if you want to get technical it's not a wall it's a huge fence with Barbwire on top of it)And I'm not a racist my husband is Latino and my children are considered biracial so stick it where the sun don't shine,I don't want to hear any of that crap.The people in this country are totally fine with legal immigration it is illegal immigration that Americans have a problem with. I don't see Mexico having open borders and even if they did they certainly wouldn't be giving illegal immigrants welfare food stamps Medicaid I could go on and on and it's all being paid for by the hard-working American taxpayers.it sucks when you live ...","post_message":"The Latino community has a powerful message for Donald Trump.  #MicBrights"},{"comment_id":"1092318047486497","commenter_b":"The chick in the limo is smokin...","commenter_a":"Yet he still left the guns...","post_message":"Now THIS is how you get out of a bad date. Mat Best MBest11x always taking it to the extreme. ~Will"},{"comment_id":"885087015015208","commenter_b":"She needs to move on and except defeat u fucking scumbag criminal","commenter_a":"Yes","post_message":"What a sore loser. She needs to come grips with reality. Are you glad Hillary is not going to be our president?"},{"comment_id":"10154327870086509","commenter_b":"If they did who cares cnn enjoy the holidays merry Christmas to the Muslim world . Leave cnn racism behind .","commenter_a":"and lovebirds don't own February. So wtf is your point?","post_message":"\"Christians don't own December,\" one atheist writer says."},{"comment_id":"10153683223480575","commenter_b":"Leave my country!","commenter_a":"You got to be kidding.","post_message":"Pig books now banned.... They might offend Muslims."},{"comment_id":"1027413480657895","commenter_b":"Cause he wanted to, yall white people ready to see a brother arrested","commenter_a":"He has already turn himself in people are so stupid","post_message":"UPDATE: The brother of the man identified as a person of interest in the downtown shooting tells NBC 5 his brother has nothing to do with the shooting - in fact he said his brother handed his gun over to officers when the shooting happened: @webpagelink"},{"comment_id":"1733272846942683","commenter_b":"Girl bye! Ain't nobody listening to your BS. Ms Lori.","commenter_a":"Poof Obama creating race card and divide.... Michelle just made it clear she lives in the house built by slaves! REALLY?! A spokeswoman for the first lady says that Michelle Obama currently has a staff of 24. So, she has slaves using taxpayer money too, huh?! You have done nothing but create racial divide while in that house! Nothing deserving or anything to brag about....You could have gone down in history as a great black leadership in that house. Instead, you have did the biggest disservice to people of color by creating the deepest racial divide I have ever witnessed in my well over 50 years of life! You have weakened our country security and will go down in history as one of, if not the worst President in USA history!","post_message":"\"Don’t let anyone ever tell you that this country isn’t great.\" - Michelle Obama delivers an emotional testimony to the greatness of the United States of America. @webpagelink"}]
