[{"comment_id":"1179490578805054","commenter_b":"@username Little girl please... You have zero inclination of who I am, where I've been and with whom I've walked. My dad always said, \"Never argue with an unarmed person\". Go away before your feelings get hurt.","commenter_a":"A gentleman named Bill Howell eloquently wrote the below letter. Dear Mr. Trump, It’s taken me a while to realize this and to admit it, but I’m grateful to you. For the past few months I’ve spent a good deal of time lamenting your campaign and the poison it has so effortlessly generated. I’ve watched our country imploding, our public discourse become polluted, our political climate grows ever more corrosive, and wrongly assumed you were to blame. It’s only lately I’ve come to understand that you haven’t manufactured our current national ugliness—you’ve simply revealed it. By saying the irresponsible, mean-spirited, ignorant things you say so freely and so frequently, you’ve given other like-minded people license to do the same. You’ve opened up the floodgates for our corporate sewage to flow fully. People no longer conceal their vile mess, they now revel in it, they broadcast it and retweet it. You’ve ...","post_message":"Trump appears to be ready for victory. Do you think he should win in November?"},{"comment_id":"734527313335610","commenter_b":"Corina doesn't have a head occupying her brain. She doesn't seem to be aware that Jews have been \"occupying\" that region for 4000 years.","commenter_a":"State who creates biggest terror in the world since 1948 doesn't know anything about human rights.","post_message":"Iranian President Hassan Rouhani famously said in 2013 that ethnicities, all religions, even religious minorities, must feel justice..."},{"comment_id":"10153547017035950","commenter_b":"There is no excuse for paddling in school. Sounds like mom has serious issues too.","commenter_a":"He has missed 18 days of school, he's got in two fights this week, he spit on a kid and his mother is on the verge of going to jail not only because he has missed school but because of things she does in her personal life. If she doesn't want to be a parent to that child somebody has to be.","post_message":"\"It was not a spanking. It was abuse,\" said the boy's mother."},{"comment_id":"10156205584795354","commenter_b":"Right, blacks and immigrants are the problem. It was a white kid who went into a black church and shot and killed 9 blacks while they worshiped. It was a white kid who went into the Sandy Hook Elementary School and shot and killed 20 children while they were trying to learn. He also shot and killed 6 educators who were trying to teach the days lessons. It was a white man who went into a theatre in Lo. and killed people while they were watching a movie for enjoyment. It was a white man who went into the theatre in Co. and shot and killed people who were out for a night of entertainment.","commenter_a":"If people like her wouldn't say dumb shit like this, then most of the \"white people\" wouldn't be racist towards blacks. They just keep it going instead of trying to get to the problem, causing more anger and violence from within everyone.","post_message":"“Right now we declare, it’s open season on a motherf–king cracker. All you motherf–king crackers y’all need to watch your motherf–king heads.”"},{"comment_id":"10153928172287411","commenter_b":"Love it...what a hoot! Dang, she would drink me under the table with that stuff!","commenter_a":"@username here is Dorothy again making good on her shot.","post_message":"That Dorothy Farrell sure knows how to party."},{"comment_id":"10152939984116680","commenter_b":"Right Dave, when he was running in 2008, did you support him then?? Do you remember what horrible things Dems said about McCain ?","commenter_a":"Im a Democrat embarrassed by Trumps remarks!!!!","post_message":"In a stream-of-consciousness address, the real-estate mogul riding high in Republican polls sticks to his favorite targets."},{"comment_id":"10158500628960389","commenter_b":"As a Hispanic born in the US, no Jorge Ramos! This country does not belong to illegals! You're are crazy and delusional, if you love Mexico so much go back there and see how it goes for you! We are not against legal immigrants, it's the criminal illegals that should go back! So screw off and shut up!","commenter_a":"Deport Ramos. I'm an immigrant and can't stand him.","post_message":"Univision anchor goes on an ethno-nationalist tirade."}]
