[{"comment_id":"10153242859546636","commenter_b":"i agree women want equal rights go to prison for murder they will get treated these ams as men","commenter_a":"Send Teresa May then!","post_message":"Satire died on Friday 20 November 2015"},{"comment_id":"1722122661395846","commenter_b":"White people'n 😂😂😂😂😂😂😂😂","commenter_a":"Just White people..White people'n","post_message":"What...is...this?"},{"comment_id":"541297862703293","commenter_b":"All wall must be built before the country is lost!","commenter_a":"We lived in Mercedes . Know exactly what you are going thru !!!","post_message":"We need a wall fast to stop ILLEGAL IMMIGRATION and ILLEGAL DRUGS from entering our country. Its just common sense!"},{"comment_id":"10153037800452434","commenter_b":"@username So yeah... indeed! That is a bit ironic, ain't it? I'm not republican either, I'm against the two party system, but anyway you're so right.. cracked me up.","commenter_a":"\"the Republican Muslim Coalition\" ....really?","post_message":"\"WHAT UP BITCH\" -this hijab"},{"comment_id":"1494215257285326","commenter_b":"If ur here illegally you got to go. 100%.","commenter_a":"If you're here legally and ICE knocks at your door: Answer and say hello, you haven't broken the law so you have nothing to fear.","post_message":"ICE raids have resumed in several cities under the Trump administration, continuing to tear immigrant families apart and put whole communities in the target hairs. Thankfully, more and more people are getting aware and awake, and are hitting the streets to protect undocumented communities and protest raids, mass detentions, and deportations. Activists in many cities are holding \"know your rights\" trainings over the next several days - get involved in your city, and join the movement to protect immigrants and their families!"},{"comment_id":"691444044379507","commenter_b":"Hate Crime.. All of these black criminals are Racists","commenter_a":"This is bullshit! There's hundreds of incidents happening everyday! Want to be fair put them all up everyday!","post_message":"A white father and son were killed by two black teens and there are no riots. The media is completely one sided. Race Baiters are the problem. Do you agree Al Sharpton is the problem not the solution?"},{"comment_id":"483635665160347","commenter_b":"Ban it out of our country!","commenter_a":"These black robe people are not making decisions that we like they need to Go.","post_message":"The Supreme Court just made a shocking ruling on Shariah Law. We must voice ourselves publicly, Shariah Law has no place in America. Do you agree Shariah should be banned?"}]
