[{"comment_id":"1128370543896366","commenter_b":"Girl quiet !!","commenter_a":"When I would sneak in food for you while you hid your pregnancy with jayden from my parents. Jacqueline Carranza 😂😂 #iGotChu","post_message":"Sibling goals!"},{"comment_id":"10153982345631162","commenter_b":"Lol at the lady that thinks Chicago is Houston!","commenter_a":"Well the store has a history of getting robbed at gun point. Also note, armed robbers have been killed in the past trying to rob this store. Its best not to try to stick this place up anymore. Matter of fact, why not obey the law and not stick up any stores.","post_message":"EMPLOYEE SHOOTS SUSPECTS: Two men were killed after police say they attempted to rob a liquor store when an employee opened fire at them - Diane Pathieu ABC7 is live with more: @webpagelink"},{"comment_id":"577340679100840","commenter_b":"If you don't leave america it will be the end of us","commenter_a":"Yeah. We've survived Obama. Barely.","post_message":"And that's not all he said either..."},{"comment_id":"900773723315710","commenter_b":"And how is this news? Last time I checked, Mail was supposed to be a page for news.","commenter_a":"just kill them all anyway","post_message":"In these exclusive pictures, she goofs around like a typical London schoolgirl. Here we reveal what poisoned the mind of the 15-year-old who's run off to join ISIS."},{"comment_id":"10153573434494087","commenter_b":"Oh for the love of God, I fear for the United States when that evil emotional vampire gets the keys to your White House!!! Vote Trump. Vote Sanders, for all things decient don't have that evil woman near the White House","commenter_a":"Trump for President and Hillary for Prison","post_message":"Two of the top three most retweeted tweets of last night's Republican debate were from Hillary Clinton, while none of the GOP candidate even entered the top 5."},{"comment_id":"10153075666953812","commenter_b":"Inhuman barbarism was the assassination in Paris. Please accept honest condolence to families.","commenter_a":"Prayers for all!!","post_message":"BREAKING: French president: 12 dead in \"terrorist operation\" on Paris-based satirical magazine: @webpagelink"},{"comment_id":"10154493907103352","commenter_b":"Amen and thank you Lord","commenter_a":"Amen","post_message":""}]
