[{"comment_id":"1036501259720547","commenter_b":"If illegals are going to remain here what difference does it make?","commenter_a":"Trump/Cruz will have my vote.... but if Trump is not on the ballot......don't expect me to cast one","post_message":"Ted Cruz explains why he thinks \"2016 is going to be an incredible year.\""},{"comment_id":"524989287704578","commenter_b":"Build the wall","commenter_a":"Hillary has been in the lime light for 30 years first lady, senator of New York, Secretary of state, and i can not think of one good thing she has done, nothing prolific, nothing of any worth, and i see a successful business man. Oh the choices","post_message":"WATCH: Donald J. Trump hosts campaign rally at the Fox Theatre in Atlanta. @webpagelink"},{"comment_id":"10152820501225736","commenter_b":"And he signs new contract with Hair Club for Men.","commenter_a":"EEEEEEEEEE-HA!!!!!!!","post_message":"\"Due to the recent derogatory statements by Donald Trump regarding immigrants, NBCUniversal is ending its business relationship with Mr. Trump.\""},{"comment_id":"973671239335036","commenter_b":"She always has been a racist bitch. Where have you'all been?","commenter_a":"Get your head out of your ass and do something productive with your life.","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"10154086298502541","commenter_b":"I find this horrific but please take down the pictures","commenter_a":"Where is Al Sharpton when you need him. Lol","post_message":"Police spokesman Anthony Guglielmi said that while the suspects made “terrible racist statements” against white people during the attack, it does not appear to be racially motivated."},{"comment_id":"1061923367225138","commenter_b":"Shes a rino like glenn.. no one cares..","commenter_a":"Good riddance, campaign for the liar Hillary.","post_message":"“This is not a decision I make lightly, for I am a lifelong Republican.”"},{"comment_id":"10153238274816107","commenter_b":"Counseled women*","commenter_a":"Thank you Rand! The only one who stands for the people!","post_message":"Thanks to your continued pressure, this morning I'm pleased to announce that I've secured a commitment to have a vote on my bill to defund Planned Parenthood before the August recess! I pushed hard all weekend long to vote on defunding Planned Parenthood. My campaign sent out millions of emails mobilizing patriots like you to join this critical fight. It worked. I believe right now you are seeing the impact one man who's willing to stand for something can make in Washington, D.C. with the backing of millions of good folks like you. But now our job gets even tougher. Please call your U.S. Senators at (202) 224-3121 and insist they \"Stand with Rand\" and vote for my bill to defund Planned Parenthood. And please let me know you've got my back by adding your name as a Citizen Co-Sponsor: @webpagelink"}]
