[{"comment_id":"1063488917004194","commenter_b":"Lysha Ewing u r a very bitter woman.","commenter_a":"Stupid cops. To think if it were a black baby they would have walked by","post_message":"Police officers smash window to find fake baby."},{"comment_id":"10154776227370399","commenter_b":"Listen to all the cry baby's all the little bitches are just jealous because they don't have what she has and besides it don't make a damn if her daddy gave it to her. So just shut the fuck up","commenter_a":"It's called Democracy. Don't like a company, don't buy it. It's evident large companies want to distance themselves from tRump and his administration.","post_message":"\"If Ivanka were anyone else’s daughter, she would be praised as a trailblazer.\""},{"comment_id":"10153279079299170","commenter_b":"With so many illnesses she has claimed, she must be unhealthy in the brain!! We already have one of those we don't need another one!!","commenter_a":"islamofascists have no respect for women, including Barry O. How could they have any respect for Hillary?","post_message":"If Hillary's such a precious little snowflake that Rand Paul is supposed to treat her with kid gloves, how is she supposed to deal with Putin, ISIS, The Norks, Iran, Asaad, Cuba, China, etc?"},{"comment_id":"1141292965963756","commenter_b":"There is evil everywhere in all religions! This is a slap in all Christian faces whether they are right, left, or middle! It's just another example of a sick individual taking advantage of others!","commenter_a":"I was in the BIG HOUSE for 2 months long ago and I have to tell ya, some of the queens in there started to look pretty good. Damn Did I just say that?","post_message":"And another \"family-values\" hypocrite bites the dust."},{"comment_id":"1825166017710828","commenter_b":"BUILD THE WALL!!! Go Trump","commenter_a":"Trump now has my vote. This lawlessness has to stop. There is nothing racist about wanting to enforce laws that apply to everyone. I do hope he can be talked out of the wall though. We need improved cooperation and relations with Mexico. Not a big wall dividing us. Both countries need to crack down on crime and make sure people moving between the two countries do it legally. Only way to have a civilized society is to enforce the laws. If laws are unfair, let's change them. But let's do it legally and civilly. Trump is not the racist monster that the liberal propaganda machine makes him out to be.","post_message":"\"Hundreds of cars were forced to make a U-turn less than three miles from a Donald Trump rally today after protesters parked in the highway to block Trump supporters from reaching the event.\""},{"comment_id":"10153223808830927","commenter_b":"IS IT A DONT PAY TAXES PROTEST","commenter_a":"It gives the bum a purpose in life to boycott something, anything! Bless his pathetic excuse for a heart!","post_message":"Why is Rev. Sharpton urging people not to watch the Oscars this Sunday?"},{"comment_id":"1141174309285545","commenter_b":"PUT THESE RAGHEADS OUT IF THEY CAN'T COMPLY!!!","commenter_a":"No","post_message":"The military doesn't bend their rules for their soldiers. If you want to serve, then fall in line. Do you think our society has become too sensitive?"}]
