[{"comment_id":"1626733787627072","commenter_b":"D'nariusLovable Lewis you ever hear this girl talk? Lol she is delusional and ignant as fuck haha","commenter_a":"Tomi Lahren. The next Ann Coulter?","post_message":"You've seen Tomi Lahren's criticism of anti-Trump protesters making the rounds. Here is our Occupy Democrats response. Share it on her wall to make sure she sees it!"},{"comment_id":"751318988350209","commenter_b":"Wondering if Melania has to listen to the snorting every night in bed!!!","commenter_a":"Why doesn't he realize that he has this problem with his nose, which only appears at the debates and not at any other occasions.","post_message":"It's just allergies, right? Right?! --Andrew"},{"comment_id":"10153248022411336","commenter_b":"John V Salazar","commenter_a":"We had a similar issue at a university I worked at years ago. The guy was just a creepy freak but he cried \"academic freedom\" and got away with showing porn in a music class and \"relating it to music\". Oddly enough, once he FINALLY retired, the class was discontinued as it had no value. There are times academic freedom goes too far and yet that is the basic premise of any university and with tenured faculty your hands are tied if they \"justify\" it.","post_message":"Parents, what do you think of this? A professor at UC San Diego is reportedly asking students to be naked to pass the final exam."},{"comment_id":"865380196838555","commenter_b":"You're a dumb b****.","commenter_a":"Islamists stand together...if he were to admit islamism, he might be called an apostate.","post_message":"There’s a far bigger issue involved here than going to the anti-terror march in Paris on Sunday. That is Obama’s persistent refusal to identify the enemy as what it really is: Islamic terrorism. It’s pathetic to see the contortions our president and various administration officials and spokesmen go through to avoid using the word “Islam” when talking about the people who are waging war on the West. @webpagelink"},{"comment_id":"10152926851271336","commenter_b":"My God leave the Good Doctor alone. Don't see you going after those that treat patients in their mammogram buses and doing blood and plasma draws that happen to be far more dangerous. Give the guy a break. He is licensed to practice in that state, the entire state. Can you blame the Dr. after what Obamacare has done to folks. Jesus Lord...go after POTUS for putting people in this position in the first place, without healthcare, sucking what was left of Medicare that the elderly needed and driving up healthcare coverage so govt gets a buck.","commenter_a":"Need more like him and fewer like Obama.","post_message":"Mississippi health officials are threatening to revoke the medical license of an 88-year-old doctor because he treats patients out of his Toyota Camry. Dr. Carrol Landrum says his patients are too poor to travel to him, so he goes them."},{"comment_id":"10153505158314877","commenter_b":"Racist POS!","commenter_a":"Stupid POS.","post_message":"Sam's Club CEO Blasted as 'Racist'...Because She Believes in Diversity. Watch how the backlash started below.  Grio fam, here's our message for Rosalind: Keep up the good work. What's your reaction?"},{"comment_id":"10154377596014411","commenter_b":"Does anyone realize what is happening? History is repeating itself and no one is taking notice. The Middle East is on fire. Obama and Hillary started this with Libya, they had no business getting involved. Now we have a flood of Muslims who hate American and our culture. They do not want to be equal, they want to dominate and change America and the West to a Muslim country. This is a fact, Turkish President is building mosques all over the West and no one is paying attention. In Turkey they are burning down churches, killing and raping Christians. It's a genocide but Obama only brings in Muslims no Christians. Americans are being told, to take down crosses, take pork from American public schools, allow Muslims to have pray time in public schools, Our children are learning Islam is the faith to be. WAKE UP PEOPLE. They are moving in ...","commenter_a":"I dont think people are comprehending how much people are actually crossing over in europe. its not like in north america. Canada for example scrapes the cream of the crop at 10,000 vs half a million in germany alone. So its full of feel good stories. Whats left stays in europe and the people keep coming and summer has just started. We're talking about a city moving into the EU completely needing of support. At the rate of growth. They'll have a small country entering the EU (mostly unscreened). Europes economy is already weak. Germany has a strong economy, but they're carrying the bulk of the weight. Swedens already cracking under the weight of just one year. Not to mention the culture shock of a sudden mix of two completely different cultures. Hes not saying turn them away. Obviously care for them. But you cant have this number of them ...","post_message":"Dali Lama to Germany: You're doing it wrong"}]
