[{"comment_id":"10153931139325695","commenter_b":"Omg poor @username lmao. What a nut job . So should we deport whites for crimes? Since this wasn't really our land to begin with?","commenter_a":"Really disappointed with you, WSB.","post_message":"Our investigation found the number of refugees deported for violent crimes is skyrocketing, and it includes numerous refugees here in Georgia. Today at 5, the numbers that leaders call a \"game changer\" in the Syrian refugee debate."},{"comment_id":"1117850661583687","commenter_b":"She is trash !!","commenter_a":"Or is it Michael Obama?","post_message":"Keep on Rockin In The Free World!"},{"comment_id":"10154458181463128","commenter_b":"Everyone is scared in America because there are so many guns. We need commonsense gun control ASAP. We need to vote out all politicians that oppose commonsense gun reform and get this issue addressed","commenter_a":"The cop is clearly nervous as hell. His voice is cracking and his gun is shaking terribly. To me, this is proof cops just aren't trained enough to identify true threats and staying calm under extreme pressures. He shot this guy in fear. Period. He should be charged for murder. I am absolutely terrified of cops and it shouldn't be that way.","post_message":"\"Police just shot my boyfriend for no apparent reason\": A police officer fatally shot a man in a car with a woman and a child, an official said. Authorities are looking into reports that the aftermath was live-streamed on Facebook."},{"comment_id":"10153097402831748","commenter_b":"Michael Savage you are an ignorant swine prejudice d Jewish imigrant not worthy of comment. You are inciting racial war!","commenter_a":"And you may as well be...oh hell-I can't think of anyone that I want to insult that badly. You are in your very own camp of What-the-hell??","post_message":"Michael Savage asserts \"[Obama] may as well be Charles Manson” for inciting racial tension in America."},{"comment_id":"1284456268283154","commenter_b":"Take her down, NOW! Before the Election!","commenter_a":"Vote Trump! There is just to much evidence of serious corruption to ignore. She is a criminal and a traitor to America!","post_message":"This is the end of Hillary Clinton's campaign, and it's all due to Congressman Jason Chaffetz releasing damning new evidence that will make sure Hillary sees the inside of a jail cell. The FBI isn't ignoring this anymore. Let's get 2,000 shares to prove that America has spoken and we want Hillary behind bars."},{"comment_id":"10152478705626990","commenter_b":"I eat a lot of eggs too, but it's just about a dollar or less, so I don't really pay attention to the price increase.","commenter_a":"Eggs are one of the few inexpensive natural proteins ... I'm concerned that this is gonna hit poor families where it hurts the worst :/ just a thought","post_message":"EGG-SPENSIVE! A new California law mandating that hens get more room in their cages, means egg prices are likely to go up --> @webpagelink"},{"comment_id":"1257959987602294","commenter_b":"You are completely ignoring many of the issues such as the inequality in wages between men and women, the dearth of equality in positions of power such as government and business, and, many other issues which have been a problem for many years. Most murders of women are by men as are rapes. Women are often expected to wear short skirts and behave in what men deem a \"feminine\" way on TV and in many businesses. An excellent example is Fox news.","commenter_a":"I think this poem/speech misses a huge issue and ignores the obvious. Humans as a whole are failing. This isn't just a man's issue. I see, daily, women tearing other women down. Calling them the same things you hear. It is a problem from all sides. We have failed to raise children with respect, love, and caring. That is the issue. To suggest it is only males is dishonest. We should accept it is a societal issue and not a male/female issue.","post_message":"She’s a “dangerous\" woman because she dares to speak her mind in an online community that openly harasses, disparages, and threatens women. Warning: contains strong language. (via Agnes Török Poetry)"}]
