[{"comment_id":"621998441316699","commenter_b":"Sadly many get all their\"information\" from the globalist owned main Street media........the sheep are being led to slaughter!!!!!!","commenter_a":"The problem is, NO BODY WHO SUPPORTS HILLARY CARES!!! The amount of hard evidence, current criminal offenses is mind boggling... but her supporters just don't care... she shouldn't even be allowed to run...","post_message":"Uh oh..."},{"comment_id":"873396172789454","commenter_b":"Taking our RIGHTS to to fulfill your agenda is not going to happen. Do you have armed security? I bet if a person walked in and brandished a weapon he/she would be taken out by a person you hired or are in connection with you and your party that is wielding a gun. You would say its protection...... We say the same thing.... It is for Protection.... While you want to make guns illegal for law abiding citizens to obtain, you will only make it Illegal to own them. Causing a bigger issue for some. People will always have guns. Ask a Drug dealer if they have issues getting illegal drugs.... NOPE. they will straight laugh at you. All you are doing is wasting taxpayer money and time. If you want to make change, ban together to reform Immigration to be fair and swift, Vote laws to tax churches to ...","commenter_a":"Real action","post_message":""},{"comment_id":"983924208336363","commenter_b":"America matters. They have been told we are the land of the free.some people here know what free is.if our government would stop the hand outs then and only then we wouldn't have to support them or anybody else...take care of our own first.","commenter_a":"This is the UN top priority to control these flood of people leaving their own country for a better life/safety of their family, and if they make it all the way....The human smuggling organizations like this type of situation and it brings a large revenue to their business all over the globe... We only can hope and pray that all nations will come together try to come up a solutions to stop the displacement of these people of the terrorist activity and senseless killing of innocent people base of their religion.... Here we are, we spent millions or billions in a exploration way out deep in our universe to study a planet that can sustain a human in the near future?...Yet, we have all of these important issues that needs to be fix, and maybe, we make our planet a better place for everyone.... We only can hope and pray ...","post_message":"RIDICULOUS: Over 700 African Illegals Caught in Panama en Route to the United States The number of Africans who have illegally traveled through Panama on their way to the United Sates has more than doubled so far this year. GREAT WALL OF TRUMP PLEASE! @webpagelink"},{"comment_id":"719541998236378","commenter_b":"Happy birthday keesh!!!? Love you and am so proud of all of you Guy's","commenter_a":"40,000 likes, is that going to help?","post_message":"Putin is firing on all fronts after news of a Russian plane being shot down. Russia is doing good work. Can we get 40,000 ‘LIKES’ for Putin bombing Syria?"},{"comment_id":"1132662126754797","commenter_b":"Haaaa! Sandhopper burgers all round !!!","commenter_a":"@username they stole our business idea!!","post_message":""},{"comment_id":"10153200218821636","commenter_b":"Not even a single Scottish one who wrote this article....","commenter_a":"@username waaaay yours didn't get a mention","post_message":"Warning: reading this will make you hungry"},{"comment_id":"10154614760931077","commenter_b":"Only a nasty hateful woman would write this. Pathetic!","commenter_a":"what a nasty hateful woman she is.:(.","post_message":"There were visible awkward moments during the meeting of the two families."}]
