[{"comment_id":"10153536791141717","commenter_b":"Stupid, dumb BITCH!","commenter_a":"I guess she never met Alexander the Great.. lol","post_message":"A gay man could never be a \"warrior.\""},{"comment_id":"10154575658114255","commenter_b":"The women who want to be at the beach fully clad should be left alone. Why is this an issue?","commenter_a":"Those women would be sentenced to death for not respecting the laws and religion of some countries.","post_message":""},{"comment_id":"379639485727556","commenter_b":"#buildthatwall","commenter_a":"BUILD THAT FUCKING WALL & FUCK FOX & PENA NIETO!!!!","post_message":"Looks like Mexico isn't feeling that border wall!  #WSHH #Mexico #DonaldTrump #VicenteFox"},{"comment_id":"10154073349643132","commenter_b":"Piss off you twit and merry Christmas","commenter_a":"Why would you congratulate someone who goes out of their way to shame woman for pre-marital sex yet does it herself?","post_message":"Congratulations are in order for new mama Bristol Palin!"},{"comment_id":"10153906444119705","commenter_b":"All these people on here saying Apple is supporting terrorism have no clue. If the software is created to unlock this phone, it can be used to unlock any phone. They all use the same data encryption software. This would put all of Apple's customers (hundreds of millions of us around the world) in danger of our privacy being breached by thieves or overreaching governments. Apple has complied with every aspect of this investigation otherwise, including providing data stored on its servers as required by warrant. But the software needed to break into the rest of the data on this phone doesn't and shouldn't exist.","commenter_a":"The order specifically refers to *this* phone, specifically allows Apple the option of doing it on *their* premises, and specifically allows *Apple* to retain control of the method used. What? They can't keep that process secure themselves?","post_message":"Apple vs. the FBI explained, how this case might affect your iPhone."},{"comment_id":"895114997196955","commenter_b":"Your mother is a rat","commenter_a":"for press tv and iran the houthi rebels who tried to overthrow the govt are not terrorists. Instead the forces fighting houthi rats are terrorists. and iran claims to be a democracy. wtf","post_message":"Saudi warplanes airdrop weapons to militants in #Yemen  Read more: @webpagelink"},{"comment_id":"10154439835324203","commenter_b":"It takes brain power to watch a documentary? Lol","commenter_a":"not many of Trump's supporters read these guys, nor watch PBS documentaries, too much brainpower needed.","post_message":"David McCullough, Robert A. Caro, Ken Burns (PBS), and more have stepped up."}]
