[{"comment_id":"10155114776336509","commenter_b":"Yes lets look at all those years Hillary has been in office but she doesn't handle classified information. So what does she do??? Trump has declared bankruptcy 7 times out of over 500 businesses. Pretty good success rate. I would like to see you try and run two businesses and see how you do. NEVER HILLARY!!!!!!","commenter_a":"Let's compare resumes, shall we? Hillary Clinton: 9 years, First Lady of Arkansas 8 years, First Lady of the United States 8 years, U.S. Senator 4 years, U.S. Secretary of State Donald Trump: At least 15 failed businesses Owns casinos that have filed for bankruptcy no less than 4 times 0 years in public service Now, if you were looking at those numbers, who would you hire? Who would you trust?","post_message":"While introducing Hillary Clinton at an appearance in Omaha, Nebraska, billionaire Warren Buffett challenged Donald J. Trump to release his tax returns: \"I'm under audit too. I would be delighted to meet him any place, any time. ... I'll bring my tax return, he can bring his tax return.\" @webpagelink"},{"comment_id":"10154553649688812","commenter_b":"This is getting ridiculous... Killing them is not necessary..","commenter_a":"As for sending these animals to zoos sanctuaries, etc. That would be the best solution, but those places have limited space and resources. Sometimes there just isn't any option.","post_message":"Colorado officials euthanize baby deer that was picked up by people who likely mistakenly thought it had been abandoned."},{"comment_id":"10152822135907434","commenter_b":"You are no gentleman.","commenter_a":"Sure, dude.","post_message":"\"It’s not just about me. It’s about all of us accepting one another.”"},{"comment_id":"1022450851126484","commenter_b":"And let's not forget, all of the terrorist attacks on United States soil have been committed by less then 100 Muslims. How many more United States citizens must die before this insanity is stopped?","commenter_a":"How about we see how she rules on things before we pass judgement? If her rulings are in accordance with the laws then who cares. If she starts using Sharia law to pass judgements then we can raise an issue.","post_message":"This is why we can't have nice things...but SERIOUSLY!"},{"comment_id":"10154282425457439","commenter_b":"Pussy's","commenter_a":"They are clueless","post_message":"The Armenian and Greek genocide by the Muslim Turks is reason enough not to build such a mosque. And what makes these knuckleheaded officials so sure that the imam won't teach and preach jihad. The jihadic doctrine is a critical component of Islam."},{"comment_id":"1727798617495109","commenter_b":"She's a hottie","commenter_a":"Megyn Kelly is a dream come true.. Smart and beautiful","post_message":"“When I am wounded, I go after people hard, okay? And I try and ‘un-wound myself.’” — Donald J. Trump"},{"comment_id":"10154271812178717","commenter_b":"Seems like all women think of is sex lol","commenter_a":"I would love to see the media dig deeper into this story--if possible. So many details baffle me. Why was she with Rood and Ross in the hotel room, sharing a bed? If sexual abuse/assault was part of this web that led to her death, I hope it's exposed and the appropriate people are charged.","post_message":"Jazzmyn Rood was sentenced Friday for her role in the 2015 death of Eve Tarmey. Details here: @webpagelink"}]
