[{"comment_id":"912964402129948","commenter_b":"Great ideas .. And it would eliminate early voting '","commenter_a":"It's incredible how many people are so patriotic on the 4th of July yet not so much on Election Day!","post_message":"This would be a huge step forward towards restoring the integrity of our democracy."},{"comment_id":"1041804329212648","commenter_b":"The same family will bring in refugees, no doubt, and will regret that as well.","commenter_a":"At the shelter in my city they put all pits and even half pits to sleep, they don't even adopt them out.","post_message":"Pit bull rescued from 'death row' attacks daughter just minutes after arriving at family home"},{"comment_id":"1073538729332546","commenter_b":"Terri must not have kids to make a statement like she or he made. Shame on you putting the blame on the mother.","commenter_a":"School needs to be held accountable and the bus driver for forcing her off. This can never happen to another child. They are lucky the right person found this child and returned her.","post_message":"A #Seattle bus driver is now off his route --- after a 7-year-old was found wandering Capitol Hill, crying. >> kiro.tv/WrongStop"},{"comment_id":"1158183760868319","commenter_b":"Ya cause your a pussy","commenter_a":"Thanks Delta & united Airlines for the great work. U got my business.","post_message":"Humane Society's president said Delta \"has set a great example.\" \"No airline should provide a get-away vehicle for the theft of Africa's wildlife by these killers.\""},{"comment_id":"598276743693951","commenter_b":"Wow. What a racist pig..","commenter_a":"You serve SATAN !!!! You are a very poor excuse for a human !","post_message":"CNN host Fareed Zakaria calls for jihad rape of white women"},{"comment_id":"543983115775139","commenter_b":"Let them keep walking to wherever they came from","commenter_a":"Let them walk all the way to the muddeled East.","post_message":"Muslim Students Walk Out During National Anthem [VIDEO] If don't want to show your respect for our country, you can leave. Are you appalled by their blatant disrespect?"},{"comment_id":"837370303025890","commenter_b":"Your just another Dumb Female","commenter_a":"Slick willy fits him better","post_message":"Just call him Adam."}]
