[{"comment_id":"10156425606485725","commenter_b":"Lol Caitlyn Jenner beat you as Most Fascinating Person. Lol Loser","commenter_a":"This is a cool post Donald ! I haul livestock so unfortunate'ly wasn't able to watch the show ! Really cool you post the neatest stuff!!!","post_message":"You do not want to miss Barbara Walters 10 Most Fascinating People of 2015 tonight at 9:30pmE on ABC! ENJOY!"},{"comment_id":"656722471175453","commenter_b":"Bitch","commenter_a":"PIG.","post_message":"GO!!!"},{"comment_id":"800309873404645","commenter_b":"16-years ago America watched as the Clintons packed their moving vans with about $200K of stolen furnishing and valuables from the White House and drove away, finally removing a large stench of corruption and sleaze from our nation's capital. We'd be insane to allow them back. TRUMP-2016 MAKE AMERICA GREAT AGAIN!!!","commenter_a":"Counter punch...she has a glass jaw. (email, poor sec of state, another Obama)","post_message":"Crooked Hillary Clinton is spending a fortune on ads against me. I am the one person she doesn't want to run against. Will be such fun!"},{"comment_id":"1026050264097061","commenter_b":"illigals should not be able to vote period","commenter_a":"I agree, if sending all illegals back to where they came from will save lives, then do it and to the illegals be damned!!","post_message":"YES!!"},{"comment_id":"10154627182156509","commenter_b":"287877634908162s, as a native (Blackfoot) I encourage you to stay out of 'our' business. Immigrant......","commenter_a":"Does @username cares even a bit about Sanders? All this channel talks about is Donald Trump.","post_message":"This is the decade when Donald J. Trump thinks America was great."},{"comment_id":"10154399903958797","commenter_b":"Idiots!!","commenter_a":"And then people wonder why they are shot. First responders should be licensed to carry and use if needed.","post_message":"WHO DOES THAT?! Two people have been charged with scratching and hitting paramedics on a Red Line platform in the South Loop Sunday night. Officials say the suspects walked up and hit the responders in the face and body before spitting in their faces."},{"comment_id":"10153023631106770","commenter_b":"She should leave right away!","commenter_a":"OHHH so you weren't bothered by the USA Planned Parenthood baby chopping business? You weren't bothered by Hillary's stupidity with her email? You weren't bothered by Racists looting and burning Ferguson? You aren't bothered by Miley Cyrus twerking on TV for young girls? I see. You were bothered by the GOP debate... Right.....","post_message":"Emily Blunt said becoming an American was “strange and slightly disarming.”"}]
