[{"comment_id":"10152875626591051","commenter_b":"Yep.. she should have her vehicle towed for parking in the handicap spot. That will give her an attitude adjustment real quick!","commenter_a":"The American Disability Act will allow the police to fine this nasty man. I'd call the police. Let them handle him.","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"10154074342184087","commenter_b":"This woman is demented and willing to win at any price including a race war. I support Trump and I fought America's wars for forty three years from a 17 year old poverty stricken high school dropout to a sixty year old colonel with several academic degrees. I also was a first generation American but also have Native American DNA from my French Canadian and Micmac side. Demonizing me and belittling my service which included the Cuban Missile Blockade, Vietnam, Cold war Germany, Panama, the Gulf War. Bosnia and support for the Iraq War; is the best this lying, corrupt, sick loon can do.","commenter_a":"Generally speaking, 100% of what comes out of Hillary Clinton's mouth is deplorable......","post_message":"\"You know, just to be grossly generalist, you could put half of Trump’s supporters into what I call the basket of deplorables,\" Hillary Clinton said. \"The racist, sexist, homophobic, xenophobic, Islamaphobic — you name it.\""},{"comment_id":"10154964993289411","commenter_b":"What have they to complain about the weather in Greece is lovely.","commenter_a":"pablo escobar ?","post_message":"LIVE: Protesters rally in Athens to honor memory of teen killed by police COURTESY: Ruptly"},{"comment_id":"684314941708338","commenter_b":"You pussy","commenter_a":"A vote for Trump is a blatant vote for racism. I'm so embarrassed at the people who support such hatred.","post_message":"Skywriters' message for Donald J. Trump: \"America is great. Trump is disgusting,\""},{"comment_id":"10154264315237550","commenter_b":"Yes you and your mother, @username! You old goat!","commenter_a":"They look real stupid with riot gear on outside a stadium!! There's no bomb threat! That Chief Of Police is a idiot. People are coming to enjoy a football game. Don't bring unnecessary rhetoric to this.","post_message":"Police are in riot gear outside of Bank of America Stadium in Charlotte ahead of the Panthers game. Read more here: abc11.com/@username/"},{"comment_id":"10154464043803010","commenter_b":"Stfu bitch","commenter_a":"Cop shot the hood who shot him. Case closed. #righteouskill","post_message":"Officers stumbled into a shooting in progress, and a gun battle ensued."},{"comment_id":"10153750734644369","commenter_b":"Ya, and you will go after corrupt windbags in D.C next? It looks good on paper, but it wont happen. There are laws in place that wont allow this to happen. Take the LLC for example, go after the company but cant get the person. But then again, when did laws ever apply to this administration.","commenter_a":"They need a home now!!","post_message":"It is a \"significant scaling up\" of the U.S. commitment to accept refugees from Syria."}]
