[{"comment_id":"10153256663916770","commenter_b":"Another huge waste of tax payer money. There are so many departments in the WH, that do nothing, except, pad their pockets & suck America dry! A big majority of them need to be kicked out!","commenter_a":"Same accountant Obama has. It's just like dropping a billon here and here(like dirty socks).","post_message":"Department of Energy officials might want to take a few more accounting classes after they miscalculated their budgets by a few billion dollars."},{"comment_id":"10153467245366770","commenter_b":"@username are you doing your homework?","commenter_a":"According to Roger Stone, 182919686769s Mens Fashion Editor and the only named \"source\" in the National Enquirer smear story about Ted Cruz cheating on his wife with five women. Ted Cruz doesn't have time for that crap, he's too busy pushing back the establishment.","post_message":"\"Despite the old guard and amateur pundits blaming Donald J. Trump and the majority of GOP voters who support him, much of the rift in the Republican Party has been caused by Texas Senator Ted Cruz conning nationalists into believing he is one of them.\""},{"comment_id":"10153188126467293","commenter_b":"What is this, then? \"That multicolored background is not gonna save you.\"","commenter_a":"That qualification was executed with a double standard.","post_message":"For all those who doubt the women's accomplishments."},{"comment_id":"10154420350898797","commenter_b":"She dont need those racist mother f**ckers","commenter_a":"Beyoncé has a concert coming up in Florida. Guess what? I read not enough off duty Police want to work it. Karma be a beeoch.","post_message":"BEYONCE BOYCOTT: The police union deemed her performance - which included allusions to the Black Panthers, Black Lives Matter, and Malcolm X - \"antipolice.\""},{"comment_id":"10154274724531320","commenter_b":"Let us see the lady you're talking to.","commenter_a":"Where is Greg?","post_message":"Good Day After Show!"},{"comment_id":"10158517971145725","commenter_b":"Another triggered cornflake with vagina envy","commenter_a":"You could fill 2 grand canyons with the amount of leg and vagina hair at this march","post_message":"Despite organizers saying the Women's March on Chicago was too big to march, demonstrators are on the move.   Live updates: nbcchi.com/lsLGCKs"},{"comment_id":"894646007249901","commenter_b":"Go home","commenter_a":"Shut your eyes or put a bag over your head !!!","post_message":"This is the real agenda of radical Muslims."}]
