[{"comment_id":"10155238822815579","commenter_b":"In 2016 he US allowed 38,901 Muslim refugees also 37521 Christian refugees.","commenter_a":"In a practical sense, Obama had a ban against middle eastern christians. He seemed pleased they were being made victims of genocide, instead.","post_message":"President Trump: \"World Is A Mess & Angry\" - AGREE or DISAGREE?"},{"comment_id":"765874163568797","commenter_b":"Unfortunately, so true.","commenter_a":"How are you guys able to post, I thought the Obama phones were shut off already?","post_message":"We have nobody to blame but ourselves..."},{"comment_id":"1044864242277400","commenter_b":"@username Of course you haven't ever heard a group of 59 year old women bragging about \"popping a Tic-Tac\" so they could forcibly kiss a handsome man. And never have I heard this same age group say, \"grab'em by the d*ck\", nope, it doesn't happen...","commenter_a":"I am still trying to figure out how this man became a surgeon. Are you sure that his license and everything or legit cuz he is a total nut","post_message":"Ridiculous!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153236337040047","commenter_b":"This is an evil,should be exterminated.","commenter_a":"So sad","post_message":"This week, the European Parliament voted unanimously to recognize ISIS's atrocities against Christians as genocide.  When will the U.S. do the same?       Sign and Share our critical legal letter to Secretary of State John Kerry to demand immediate action: @webpagelink"},{"comment_id":"10153683983505575","commenter_b":"This country is OWNED AND RAN by Muslims.... Obama will make you accept Terrorist Muslim Refugees... There is nothing you can do about it,,, UNLESS YOU FIGHT his Civil war ( Marshall Law ) he is forcing upon you..","commenter_a":"I think it time .... all the state stand up to penis head... fight for our freedom of speech and rights to bear arms.... protect our U.S....","post_message":"BREAKING. . . ."},{"comment_id":"10153155404671323","commenter_b":"@username cool your jets mate !! Why should this woman or any woman in her situation sit around and wait for her breasts to kill her when she can do something proactive !! Do you know what it feels like to have the threat of your breast tissue turning against you and threatening your life !! Arrogant shite !","commenter_a":"What the fuck are you taking about? Are you a complete imbecile? She has a genetic mutation. This has nothing to do with chemicals. Besides, there are thousands of scientist like me around the world doing research to cure and prevent cancer. Read more before spreading nonsense.","post_message":"'I love my boobs but they have to go'. YouTube star Claira Hermet says goodbye to her beloved breasts before undergoing surgery for a double mastectomy"},{"comment_id":"535259990005462","commenter_b":"I wish Dr Carson was our nominee! However, Trump is and he must win or our nation is doomed. Clinton has proven to be the most corrupted, evil lying politician ever!! It's beyond me that anyone in their right mind could support her!","commenter_a":"How can you defend this man?","post_message":"It's a shame that The New York Times and the media are on an all out witch hunt against Donald J. Trump. The media should be fair and balanced, not biased."}]
