[{"comment_id":"1180816798605996","commenter_b":"Our babies are so talented and intelligent","commenter_a":"Aram Kc Julia McLeod Ayling","post_message":"Happy International Cat Day!"},{"comment_id":"10158232325655646","commenter_b":"Didn't one of those illegals walk back in and rape and murder a woman whose husband was a official of the government...This should not be able to happen in this country.","commenter_a":"Surprisingly enough nobody see's the resemblance to how the Jews were being taken during one of the Schutzstaffel's (S.S.) \"routine sweeps\" History Repeats itself my friends! We let it happen!","post_message":"Immigration and Customs Enforcement officials have yet to release details on how many people agents arrested Thursday, but advocates say more than 100 immigrants were taken into custody as ICE conducted home raids in Santa Paula, Oxnard, Van Nuys, Downey and San Bernardino. Those detained were either illegal immigrants with deportation orders but no criminal background, or family members of those sought who were home during the raids and told officials they lacked documentation, according to the Coalition for Humane Immigrant Rights of Los Angeles."},{"comment_id":"10155098283689411","commenter_b":"Bitch","commenter_a":"Politics and sex don't belong together. Also, what a dirty whore.","post_message":"'Everything is ok'"},{"comment_id":"10154501796200861","commenter_b":"A form of The old bait and switch. ....I don't feel sorry for the jewelry store...you knew better","commenter_a":"I'm not saying profiling works every time but it would of worked this time","post_message":"Do you know any of these men? Police need your help."},{"comment_id":"566112886870821","commenter_b":"another one to kiss that ring and feet","commenter_a":"if donald trump is a racist why to people of many different races show up to his rallies? why aren't they kicked out? He hasn't singled out any one particular ethnic group that he has singled out by saying he hates them.","post_message":"Welp, Donald Trump sure has that racist vote down pat. -Conover"},{"comment_id":"1007260792718180","commenter_b":"You can cuck off to bitch","commenter_a":"So----don't sing","post_message":"Hello, it's me. I've been wondering if you think I give a crap what you think..."},{"comment_id":"1087968054553877","commenter_b":"your e next president!","commenter_a":"Sic'em Bernie !","post_message":""}]
