[{"comment_id":"1173335299353316","commenter_b":"Lady...Just give it up and go home!!!!","commenter_a":"Pathetic!!","post_message":"\"I don't think what Donald J. Trump says is worse than actually what Hillary Clinton in fact has done.\"  - Green Party presidential nominee Dr. Jill Stein"},{"comment_id":"10153747990651178","commenter_b":"He right she butt ugly","commenter_a":"Trump all the way.","post_message":"Which corner are you in? Fiorina or Trump?"},{"comment_id":"10152656496006680","commenter_b":"No Hillary, 'JUST YOU!'","commenter_a":"Loretta Lynch is another clueless, racist, who will follow Eric Holder with more bad decisions, race baiting, and support for illegal aliens, as indicated by her actions on the bench and answers to questions during confirmation proceedings. She should absolutely be voted down.","post_message":"Clinton’s social media outburst comes after Loretta Lynch has been waiting for Senate confirmation for 128 days."},{"comment_id":"1038817212861551","commenter_b":"My gurl !!!!","commenter_a":"President Hillary Clinton","post_message":"\"Don’t let anyone ever tell you that this country isn’t great.\" - Michelle Obama delivers an emotional testimony to the greatness of the United States of America. @webpagelink"},{"comment_id":"965413580245506","commenter_b":"Keep trying @username. Killery the lying hag will fall short.","commenter_a":"PT Barnum is running for president!!","post_message":"Donald J. Trump tried to remember #DDay with a photo that wasn't from D-Day."},{"comment_id":"935666689826142","commenter_b":"Tom thats only because fox hires those wannabe dumb blonde bimbo beauty queens who are only good for getting idiots who watch them get a hard on.","commenter_a":"How low does your IQ have to be to qualify as a Fox viewer?","post_message":"Um......what?"},{"comment_id":"10153759258966694","commenter_b":"Do not compare this to GOT...or dr who....or any other shit please...","commenter_a":"Oh, gee, you don't really mean it's going to make my brain explode, do you? Like The Walking Dead was supposed to make my BRAIN EXPLODE, and Game of Thrones was supposed to make my BRAIN EXPLODE, and Dr. Who was supposed to make my BRAIN EXPLODE...Seriously, how much did Raimi and Co. pay you guys to headline Ash vs. Evil Dead as an exploding-brain event? Because, you know what? Every time @username claims some stupid TV show will \"explode your brain,\" viewers barely end up with a BRAIN TWINGE. So instead of over-hyped praise, why don't you guys try something different? Something along the lines of: \"WE SAT THROUGH THE FIRST EPISODE OF ASH VS. EVIL DEAD AND WE DIDN'T GET CRAMPS IN OUR ASS.\" In short, Lower Expectations = More Pleasurable Viewing Experience. You're welcome!","post_message":"Ash vs Evil Dead is going to make your brain explode in the best way"}]
