[{"comment_id":"1256816384396895","commenter_b":"Then those women will one day regret their stupidity!!","commenter_a":"The Clinton's know there in trouble with the common voter. So now they are trying to go woman power... so tragic.... but a lot of women will vote just cause she is a woman...","post_message":"Chelsea Clinton recently tried to stump for her mom on local TV at a rally in Michigan. Later on, she wore a shirt that had a LOT of people talking.  What do you think about what was on Chelsea Clinton's shirt?"},{"comment_id":"666544360165278","commenter_b":"@username, Mexico has a wall on their Southern Border and they swear it has dropped the amout of illegals in their country from Guatemala by 2/3rds. That's 66% less illegals if you can't understand what 2/3rds is. And No, Mexico can't do us more harm, only our Politicians like Clinton, Johnson and Stein can. Don't let them give America away.","commenter_a":"Sadly, we have become a society where protecting borders is not even an issue. It must be done because of the outside terrorists. Then our people could concentrate efforts significantly more on internal ones. I cannot believe I just wrote that. Trust in God.","post_message":"Truth."},{"comment_id":"1905080359721745","commenter_b":"I. Bet money the daughter started it and got in her feelings when white girl wasn't going for the bullshit.","commenter_a":"But yet where were you at when your monkey was jumping around and disrespecting people.","post_message":"Used that right hand like a weapon!  #WSHH #Fight"},{"comment_id":"1187550147931680","commenter_b":"It is her job totally, but let's be fair, her job duties changed abruptly in June after SCOTUS ruled. That said, she should resign if she can't/won't carry out her duties and leave her religion out of the office. She can be as devout as she wants, but not on the taxpayer's dime. Those couples are paying her salary and deserve better","commenter_a":"If she don't want to issue gay marriage licenses she shouldn't have to...","post_message":"JUST IN: Kentucky clerk who refused marriage licenses for gay couples taken into custody @webpagelink"},{"comment_id":"10156389241130725","commenter_b":"if the so called good muslims are offened with what Donald Trump is saying why are they not stepping up and reporting the ones that are trying to hurt us,that offens ME!","commenter_a":"On Trump, his blocking Muslim entry is due to terrorists in with refugees, Americans as terrorists coming back not the innocent and good ones, he wants to stop the entering to get the bad ones out first to protect Americans. I agree with @username","post_message":"Statement on Preventing Muslim Immigration:"},{"comment_id":"1169322949765857","commenter_b":"I understand that the left hates and has an unnatural desire to control everyone around them. It's just what they do; and it's the reason they should never be allowed to hold any position of power. To hate for no good reason is insane. Obviously none of the people here who hate Trump have no idea WHY they hate him except maybe that they were manipulated to do so. You don't have to like him; you're not hiring someone to be your friend (although that might be the only way you can get friends); you're hiring a POTUS so vote with honest logic. Not feelings.","commenter_a":"There's no denying the fact that he's more wealthy than even the elitists in Washington can hope to be; AND it's obvious that if you're that wealthy; the IRS has already seen your taxes so there's nothing hidden about his returns except just like yours; they're not PUBLIC knowledge. The only ones who want to make a big deal about them are the people who are scraping the bottom of the barrel trying to find something they can twist into a questionable issue that the most ignorant of voter will be swayed with.","post_message":"“There’s nothing to learn from them,” said Donald J. Trump."},{"comment_id":"1258337087519652","commenter_b":"Found the domestic enemy of our Constitution. As a soldier, I vowed to defend against you.","commenter_a":"Time to disband the Supreme Court. Time to hold all these people who violate our Constitutional rights accountable.","post_message":"The U.S. Supreme Court Monday handed a legal victory to advocates of banning firearms commonly known as assault weapons."}]
