[{"comment_id":"10156869276120725","commenter_b":"Thank you Wisconsin! #TRUMPTRAIN #makeamericagreatagain","commenter_a":"The era of appeasement is coming to an end! They are only making the majority stronger and more galvanized than ever! All are welcome on the Trump Train - GO TRUMP!!! #Trump2016 #TrumpTrain","post_message":"THANK YOU, AMERICA! I love you!"},{"comment_id":"1720797558169853","commenter_b":"LOL.... The immigrants steal our jobs.... even our speeches!","commenter_a":"She did a great job last night!","post_message":"Join me behind the scenes at the 2016 GOP Convention -- as I introduce our next First Lady of the United States of America, Melania Trump! #MakeAmericaSafeAgain"},{"comment_id":"10155117699521178","commenter_b":"Especially women not yet born.","commenter_a":"So... the baby killers are really not for ALL women? Gotcha. 😂😂👀","post_message":"BREAKING: Pro-lifers not welcome at women's march after uproar from feminists."},{"comment_id":"10154235562969456","commenter_b":"Who's going to put the food on your table ? This country needs illegal immigrants who work for low wedges and keep the prices down .. trump and the gop knows that but keep believing this idiot","commenter_a":"The man never said he was against the Mexican people or their country, traditions, etc. ! JUST those entering our country illegally! Even Hispanics that came to the United States and became citizens LEGALLY, support his platform on this subject. Why would anyone think it’s okay to go to a foreign country, have anything and everything that country has to offer and get it for nothing! I don’t believe any other countries in the world would allow that…why should we?! My husband and children are of Hispanic decent and their relatives came to this country, did what was expected and became citizens legally. It can be done! So, go ahead Donald..build that wal!","post_message":"Despite promises to build a wall along the Mexican border, Donald Trump is still a fan of Cinco de Mayo. >>> @webpagelink"},{"comment_id":"10153477114308984","commenter_b":"She's obviously trashy","commenter_a":"Am I the only one that saw that woman get out of that scooter, clearly nothing wrong with her","post_message":"This woman's young son got involved in her brawl with another Walmart shopper, and the video took the internet by storm. Now she's speaking out to defend their actions...  Do you think her son's behavior was unacceptable?"},{"comment_id":"10154290589526323","commenter_b":"On bbc this morning she actually said that she wants europe, keep the pound and still have no borders with the uk!!!! This woman is nuts.....","commenter_a":"If Scotland votes to leave the UK and joins the EU then welcome to the Euro, Schengen and for Brussels to take over your resources like Banking, Oil, Fisheries and Hydro Power! You will become swallowed up and ruled with an iron fist from Brussels with orders and wrapped around a straight jacket..and have a border with England! Fancy it?","post_message":"'If the Scottish parliament is judging this on the basis of what’s right for Scotland then the option of saying we’re not going to vote for something that’s against Scotland’s interests, that’s got to be on the table. You’re not going to vote for something that is not in Scotland’s interests.'"},{"comment_id":"10154217299006350","commenter_b":"Praying for yall","commenter_a":"This is my daughter dressed for the winter formal, I am proud of who she is inside and out. She loves school, sports, and her church. I don't care who she decides to love or what she wears as long as she does it with all her heart and as long as she knows me and Jesus love her.","post_message":"'I think God accepts me for me.'"}]
