[{"comment_id":"798452466914476","commenter_b":"thank you againe Mr President for saving your citizens from the corporate wolves","commenter_a":"Question: wasn't the FCC suppose to have public comments?","post_message":"BREAKING: This is a huge victory for American consumers.  Share the good news!  Read more: @webpagelink Image by Occupy Democrats."},{"comment_id":"10153907516071178","commenter_b":"Colbert is out of touch with reality","commenter_a":"Colbert and Koppel who ?","post_message":"It's like a liberal media love-fest."},{"comment_id":"173468886485698","commenter_b":"Well...Bye!","commenter_a":"California says screw you USA, until they want something from the rest of us in the USA.","post_message":"Spread this everywhere!"},{"comment_id":"439880426200251","commenter_b":"Awesome we need more women like her.","commenter_a":"I would done same","post_message":"Don't mess with this mom..."},{"comment_id":"679238678931090","commenter_b":"I have been drinking Pepsi since 1966! I will NEVER BUY IT AGAIN, not because of what she said , but because TRUMP HAS SAID FROM THE BEGINNING , This country has sold out to foreign countries that hate us AND PEPSI HAS THIS WOMAN IN CHARGE OF AN AMERICAN COMPANY!!","commenter_a":"When will they ever learn.. Boycotts work..","post_message":"INSTANT JUSTICE... Let's get 5,000 SHARES for TRUMP!"},{"comment_id":"10158382623765093","commenter_b":"It would be illegal to play it. It is national Security. and Illegal.","commenter_a":"Flynn talking about sanctions people what more important a Russia helping to stop ISIS around the world and stop aggression or keep Obama sanctions on them and never accomplish anything .Only reason Obama put sanctions on them while leaving was to stop Trump from making deals with the to help stop ISIS","post_message":"\"It seems inconceivable that Flynn did not consider the likelihood, the virtual certainty, that he was calling a wiretapped line.\" -- Andrew C. McCarthy"},{"comment_id":"10153204026980090","commenter_b":"I will NEVER EVER forget her saying \" What Difference at this point does it make\" Americans died Hillary don't you get it?","commenter_a":"FOUR MOTHERS, that's Mothers, NOT MILLIONS, that's The Difference Hillary it's Time to get Right with God, you will be glad all through out Eternity!!!","post_message":"Hillary Clinton still owes us answers.  SHARE & SIGN to support Republicans fighting for the answers: @webpagelink"}]
