[{"comment_id":"10153214662726130","commenter_b":"Mmmm lies","commenter_a":"@username Sezer Yazar Karl Ervine","post_message":"This. Is. Amazing."},{"comment_id":"10153149176726636","commenter_b":"Shocking. She should be able to speak openly about her experiences with hardline muslims. Censorship at a students union is about as bad as it gets, but it does not surprise me given the 'right on' nature of some idealistic fools in the student world.","commenter_a":"And the pandering to the nasty ideology goes on, unfortunately!","post_message":"'They’re basically labelling me a racist'"},{"comment_id":"10153607403426323","commenter_b":"Actually the first vikings that came to the US we're killed on spot by the really Americans Native Americans so why don't you do ur damn history!","commenter_a":"German organization & German decency....so different from the horrible treatment & hateful anti-immigrant rhetoric coming from so many here in the US","post_message":"“We just wanted them to know that the torture is over.”"},{"comment_id":"1005484162805096","commenter_b":"That only applies to people who follow invisible friends.","commenter_a":"With all due respect I won't be taking advise from any Catholic leader when it comes to kids and sex. Religion does not, ever dictate what I do or my children do with their bodies.","post_message":"\"While the vaccination program is not inherently wrong, parents need to make an informed decision and communicate it in a way that can serve to strengthen their child in the virtue of chastity and reinforce her appreciation of abstinence as the only truly healthy choice.''"},{"comment_id":"10155647671150354","commenter_b":"She is a racist and a total disgrace!!! She encouraged the thugs to destroy Baltimore; what a LUNATIC!!!","commenter_a":"She also believe that is disrespectful to ask a Liberal a real question and expect it answered with out making a quote that your question is disrespectful to there position. Attention Liberal Politicians: every aspect of your your public life, how you act, what you say and your political views are all fair game in the management of the public safety.","post_message":"What do you think? Was the reporter being rude?"},{"comment_id":"1877280792500982","commenter_b":"Hes an alien!!","commenter_a":"Can't hear clearly","post_message":"Paul Ryan is speaking."},{"comment_id":"10153524671301323","commenter_b":"If they are dangerous, then stay away!","commenter_a":"So is crossing the street. Let's kill all the drivers.","post_message":"“Everybody thinks we’re cold-hearted killers and it’s not that ... Giraffes are very dangerous animals. They could hurt you seriously, very quickly.”"}]
