[{"comment_id":"836581726388456","commenter_b":"I've always respected women.","commenter_a":" declare to you today that you shall surely perish. You will not prolong your days in the land where you are crossing the Jordan to enter and possess it. 19\"I call heaven and earth to witness against you today, that I have set before you life and death, the blessing and the curse. So choose life in order that you may live, you and your descendants, 20by loving the LORD your God, by obeying His voice, and by holding fast to Him; for this is your life and the length of your days, that you may live in the land which the LORD swore to your fathers, to Abraham, Isaac, and Jacob, to give them.\" Now you anti's are taking the Bible out of context.....","post_message":"Powerful words to live by."},{"comment_id":"1235543663197041","commenter_b":"Are you crazy fat black lady?","commenter_a":"Can't fix stupid","post_message":"Apparently, torturing white people and yelling \"F**k Donald Trump! F**k white people!\" isn't a hate crime..."},{"comment_id":"10153986738115667","commenter_b":"She is a joke","commenter_a":"Haters go away","post_message":"\"The American people deserve to get the full and complete facts immediately,\" Clinton said in her first comments about the newly discovered emails. She added that she is \"confident\" the FBI won't change its mind about bringing charges against her."},{"comment_id":"10154582886013725","commenter_b":"Go away and have another affair with the maid. You have your nerve. You embarrassed your whole family!","commenter_a":"If trumps doing what he said I hope all you moron trump supporters cozy up 15 billion for the wall that you ignorant assholes and trump are foolish enough to build. Doubt that right so stfu scumbags.","post_message":"Arnold Schwarzenegger says Trump is completely embarrassing the United States on the world's stage right now. Is he right?"},{"comment_id":"10154471352991337","commenter_b":"Lil girl","commenter_a":"Bitch I hope one of these hoes are next on the hit list of dead cops fuck the police bitch and if u don't like fuck u too hoe come get some bitch ass nigga I'm waiting for w a big ass weapon nigga find out what it is","post_message":"What happens in this video is not ok."},{"comment_id":"1166767616720554","commenter_b":"@username - Deceit + Greed = Hillary Clinton.","commenter_a":"Here is what a Real Poll looks like in America. Please take the Time to Read.. A Total of 50,000 people Polled in 50 States.... PG Farnsworth We have just completed our own poll since we cannot get factual information from the mainstream media!! We called 1000 homes in each of the 50 states and asked basic questions on the economy, terrorism, immigration and presidential pick. Economy was the number one factor that Americans are concerned about and terrorism was number two. Presidential pick was Trump by a large percentage. Trump 33478 votes 67% Clinton 9788 Votes 19% Undecided or other 6739 votes 13% My friends and I are all Graduate students from all walks of life we meet to discuss stuff. 13 people who like and have served in the Military. It took us most of two weeks to be sure our calls were to all people and not ...","post_message":"U.S. Department of State reports show that 2,340 Syrian refugees arrived last month in the United States."},{"comment_id":"976949909016658","commenter_b":"Female Opinions? Female Opinions Being Heard? Female Opinions Mattering? #BananaPeelSledToHell","commenter_a":"We need more where I live!!","post_message":"It's a slippery slope, America"}]
