[{"comment_id":"10153655047616130","commenter_b":"When someone makes those comments, they will learn what my bitch face REALLY looks like!","commenter_a":"Everyone: Are you okay? Everyone: You look tired. Everyone: You look upset. Everyone: You look confused. Everyone: Are you mad at me? Everyone: Why are you mad at me? Me: IT'S JUST MY FACE!!!!! This has been an accurate description on what it's like to live with Resting Bitch Face.","post_message":"Scientists say resting bitch face is real."},{"comment_id":"1279039008785553","commenter_b":"Video by a feminist probably...","commenter_a":"Wait a second. You're mad because 20 people, out of 320 people, dropped out of the study.... so 6%.... and because 6% couldn't handle it..... you reach the conclusion that obiously men can't handle birth control.... isn't that a sexist statement against men? Not to mention I'm sure more than 6% of women don't take birth control because of side effects. Let's just think before we generalize a group.","post_message":"Male birth control is here, but men won't take it because they can't handle the same side-effect of female birth control that women have been dealing with since the 1960s."},{"comment_id":"10153828343101051","commenter_b":"You are a brave girl I'm happy you kids are out off that hell hole","commenter_a":"This so sick and so sad! I pray for these children are in a good foster home. The mother and the boyfriend and the other person go to jail for life. This child was very brave to email the teacher. Didn't anyone at school see that something was wrong with these kids? The boyfriend should be castrated! How can this happen in America?","post_message":"This teacher was reading her e-mails when she noticed a message from one of her students. Because of how young the kids in her class are, they rarely sent her e-mails. She realized almost immediately that something was wrong."},{"comment_id":"10153543031078812","commenter_b":"If you are crossing borders illegally... You broke the law, entered our country without proper credentials and then I'm suppose to foot the bill? Hell no, if I have to follow the rules, then so should the ILLEGAL immigrants!!!","commenter_a":"In my opinion he offended not only #mexicans but all imigrantes that have to cross any border w/ USA. MY RESPECT to anyone that comes to the USA trying to have a better life.","post_message":"NEW: Univision dropping Miss USA pageant and cutting all business ties with Donald Trump over comments about Mexican immigrants: @webpagelink"},{"comment_id":"1589075444729621","commenter_b":"To keep the Marxist Corrupt Hillary out!","commenter_a":"Why should anyone care what a theologian thinks about a political choice?","post_message":"ICYMI: Theologian Wayne Grudem lays out the moral case for voting Trump."},{"comment_id":"807798315963065","commenter_b":"ENOUGH IS ENOUGH, DO YOUR JOB CONGRESS!!!!","commenter_a":"HOW is this legal?","post_message":""},{"comment_id":"10153523680568606","commenter_b":"God Bless ♡ Hearts broken♡","commenter_a":"It time to vote trump","post_message":"The remains of the four Marines gunned down in the Chattanooga attack were transported through Northern Virginia. @webpagelink"}]
