[{"comment_id":"10153720539999749","commenter_b":"Andrea Lopez who is an American? You are an illegal 2 me","commenter_a":"I think Trump can cause the 3rd world war with only his mouth , the N.korean dear leader wldnt stand him for a minute","post_message":"'Ivanka’s intervention has only served to undermine her own integrity. Just one more mortifying moment in a long line of Donald Trump’s dealings with women.'"},{"comment_id":"10155043885602908","commenter_b":"Move out of Big Blue high tax, high cost of living Commifornia. Problem solved.","commenter_a":"$7.25/hr equates to about $1250 a month before taxes. After taxes let's say $1000. I live in a studio apartment in CA and it's $885/mo. So $115 remains for 4 weeks of food, utilities, transportation to and from the job? Get real, America. Especially for a family even $15/hr would be a stretch, but it'd be better.","post_message":"It is a national disgrace that millions of full-time workers are living in poverty and millions more are forced to work two or three jobs just to pay their bills. A job must lift workers out of poverty, not keep them in it. The current federal minimum wage of $7.25 an hour is a starvation wage and must be raised to a living wage."},{"comment_id":"1689347211355625","commenter_b":"Well hopefully none of these girls are lesbians because if they want shari law they could end up getting stoned to death. Bunch of fools.","commenter_a":"I'm offended that must stop OHH wait a minute I'm a white America I don't have rights !!!","post_message":"SHARIA WEEK! Islam Week At Schools In America, Administrators Demand Females Wear Hijabs To Show Support!   Lets get 3000 SHARES if you'd like to see Trump outlaw Sharia Week!"},{"comment_id":"10153764021131509","commenter_b":"And as far as white women go.... I've quite seen a few black women with arm pits and legs full of hair. Jus sayin..","commenter_a":"WHITE-WOMEN! Tryinna start a trend....","post_message":"What do you think about the growing trend? The 'free to be hairy' notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"},{"comment_id":"10153895371347452","commenter_b":"'@username. Well you are not a very educated woman. I hope you don't reproduce! This world doesn't need more deplorables.","commenter_a":"Really ?! Just because he says vulgar things about women who cares ! And I am a woman! Least he isn't hiding emails or having innocent people killed!!!!","post_message":"Donald J. Trump was caught in a 2005 video making vulgar comments about women. He issued an apology and added, 'Bill Clinton has said far worse.'"},{"comment_id":"791848880944157","commenter_b":"The entire so called debate is a joke as always .FEAR CARD PLAYING BIG TIME .....VOTE BERNIE VOTE BLUE GIVE YOURSELF A CHANCE","commenter_a":"I feel like they act like they want to think of us but yet foot in mouth with trump!!","post_message":"Donald J. Trump is a chaos candidate, and he'd be a chaos president. #chaospresident"},{"comment_id":"1200289290023832","commenter_b":"It just needs to be remembered do this with no violence unless it is used on them and if the illegal aliens respond with violence deal with them direct and swiftly. No questions just stomp them and dump them back across the border.","commenter_a":"She just deserve a raspberry. It is the to be said to her. Our immigration system needs work but she is really talking about letting illegal aliens in. The term illegal means we have acknowledged that they have committed a non-legal act, thus becoming a criminal. That means do not pass Go do not collect 200 dollars. They are already being coddled at our expense. If, they are caught they should be taken direct to be fingerprinted and photographed, then directly to a border. If, they are identified as having done it before. We should setup a location far away to ship them to. This non-American needs to mind her own business, instead of trying to shovel her troubles on to us.","post_message":"Oh really?"}]
