[{"comment_id":"10153203713812894","commenter_b":"She's a damn lie! Ain't nobody stupid! That's what's wrong with her lying ass all them babies and surgeries!","commenter_a":"What did she do to her face? She looks weird","post_message":"Kim Zolciak Reveals Doctors Discovered a Hole in Her Heart While She Was Hospitalized After Her Stroke"},{"comment_id":"1079326368771039","commenter_b":"Devil women","commenter_a":"that will be a cold day in Hell!","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More ‘Comfortable’. This is just getting ridiculous. Do you think they should keep the cross in our Churches?"},{"comment_id":"10156776105275354","commenter_b":"Difference between American and European women...","commenter_a":"And we pay $260 billion a year for our government.","post_message":"CHAOS IN AMERICA'S STREETS..."},{"comment_id":"10157322113810354","commenter_b":"She is the spitting image of miss piggy. Shut up bitch","commenter_a":"@username keep this irrelevant fat slam pig off my feed, k?","post_message":"Amy Schumer: you know what Americans are \"sickened\" by? We dumb, poor, working class folk are \"sickened\" by rich, elitist, Leftist \"celebrities\" who can afford to live in million dollar homes with high-end security and bodyguards lecturing us for protecting our families and children. Sorry, Amy Schumer, that we can't afford to live in a gated mansion with state of the art alarm systems. But your pal Obama destroyed the American economy. So spare us the lectures!"},{"comment_id":"10154450520586320","commenter_b":"Well said Claudia","commenter_a":"own it. you have ignited and stirred the kettle and walked away. you have failed to address the real crimes of black/black murders happening every day in your 'home town' of chicago. you are perpetuating a false narrative to strip the local police from doing their job, create chaos and mistrust. own it for once and stop blaming everyone else.","post_message":"President Obama is to address the #BatonRougeShooting where 3 police officers were killed."},{"comment_id":"703522563139507","commenter_b":"She's just jealous ,because she has NEVER looked this good in her whole life ,just saying !!!","commenter_a":"What country did rosie post that from...I bet she stares at that pic. all night...","post_message":"OUTRAGE...! Rosie posts naked photo of Melania when comparing her to other First Ladies. WARNING: Nudity"},{"comment_id":"909858709204705","commenter_b":"Absolutely ! It's not a color issue , they were intruders !","commenter_a":"What a brave wonderful woman. So sorry to hear of her loss!","post_message":"Dorothy Hendrix unloaded on thugs who broke into her house... but look what happened next. She has every right to blow those intruders away. Do you stand behind her constitutional right to defend herself?"}]
