[{"comment_id":"1271510422882923","commenter_b":"Momma ain't raise no bitch","commenter_a":"I love how everyone says stop snitching but if he/she dosnt snitch he/she could go to prison as well for withholding information. I dont give a fuck my freedom is worth more then their freedom sorry not sorry. *Heres a little side note i have an extreme case of dyslexia so if my grammar is terrible i apologize *","post_message":"'What r u going to gain from it'"},{"comment_id":"10153152461759170","commenter_b":"Because many people don't understand the effects of war on our men and woman of the war they fight overseas and home. It's the sadest thing I've come to know and yet sooooo many people can't understand. Watch and learn what they suffer along with there Loved ones. Then remember there sacrifice!!","commenter_a":"No they don't hate war movies, they hate war movies when an American is the Hero.","post_message":"No one should be surprised that American Sniper didn't win much at last night's Oscars..."},{"comment_id":"10153588597752042","commenter_b":"Its not indecent exposure. Breasts arent genitals and they are legal in ny. Also its 2015, so if they ban toplessness in nyc or just the times square section, men jogging around topless or wearing loose tanktops showing nipples should be banned as well. Its the same body part. As a matter of fact men in beach should wear something to cover their bare chests as well. Its only fair to women.","commenter_a":"Nope! First Amendment vs. Decency! The problem was old-styled Garbage at Times Square, that problem was solved by then-Mayor Giuliani in late 1990s. DeBlasio was too socialist today!","post_message":"NO MORE NUDITY: After several calls of criticism about topless, body painted women in Times Square, a Bronx politician has introduced legislation to ban toplessness across New York. Do you think this should be passed?"},{"comment_id":"10152692514188299","commenter_b":"All this talk...............start calling your congressmen, bombard them with calls until they DO something....................","commenter_a":"What the hell is wrong with this guy? Most Americans are against this.","post_message":"Five More Terrorists Transferred Out of Gitmo … @webpagelink"},{"comment_id":"10153486509166320","commenter_b":"Stupid woman. Don't vote for her just because she is a woman. You voted for a color. Remember...","commenter_a":"And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course ‘lest we forget’ what has happened to many “friends” of the Clintons. 1- James McDougal – Clinton’s convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr’s investigation. 2 – Mary Mahoney – A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown.. The murder happened just after she was to go public w:th her story of sexual harassment in the White House. 3 – Vince Foster – Former White House councilor, and colleague of Hillary Clinton at Little Rock’s Rose Law firm. Died of a gunshot wound to the head, ruled a suicide. 4 – Ron Brown – Secretary of Commerce and former DNC Chairman. Reported to have died by impact ...","post_message":"Hillary Clinton held her first major rally of her 2016 presidential campaign on Roosevelt Island today. She called for a new era of shared prosperity in America and told supporters that workers can trust her to fight for them."},{"comment_id":"10154912048588128","commenter_b":"... so now that the republican congress has a republican president, can they start paying down the national debt now? :)","commenter_a":"We need to fight Islamic terrorists and China. Congrats Trump! Let's make America great again. With Love, From India. We are also celebrating in Delhi for your victory!","post_message":"President-elect Donald Trump will likely get the chance to fill the Supreme Court vacancy created by the death of Justice Antonin Scalia, and could have the chance to tilt the balance of the court more solidly conservative for decades if other justices retire."},{"comment_id":"10154452810413812","commenter_b":"Kick her out.. Back to Honduras, then she can sue the Doctor there...","commenter_a":"I'm waiting for liberals to come on here and blame Trump somehow I'm surprised ABC didn't blame Trump for it","post_message":"Mother of infant born in NJ with microcephaly says doctor in Honduras told her everything would be 'fine' after she reported having a fever. “He said, ‘Don’t worry, everything will be fine. I don’t think you will be affected.' Then I had an ultrasound, and everything looked fine.'"}]
