[{"comment_id":"10153000313242383","commenter_b":"you mean Haliburton? .. don't you think they got compensated enough?","commenter_a":"What about the contractors who did everything including making the ultimate sacrifice only to come home and be crapped on","post_message":"Interpreters who helped save Marines lives on the battlefield are fleeing to the U.S. with nothing  so one Marine is pushing to get them veterans benefits. @webpagelink"},{"comment_id":"1901824630047376","commenter_b":"Meant to be","commenter_a":"Catherine her name... :)","post_message":"She’s a Republican college student and she’s proof that marching is about more than politics. #WomensMarch"},{"comment_id":"843353782366711","commenter_b":"Not soon enough I cannot stand she's a pathetic liar a disgrace to our country","commenter_a":"Oh please let it be! Haven't we suffered enough?","post_message":"Hillary EXPOSED!"},{"comment_id":"10152841390816491","commenter_b":"Men wouldn't would they!!!","commenter_a":"What the hell? Who cares? I mean honestly. Who the hell cares?","post_message":"“Every ounce of milk I’m able to produce for my child is nothing short of a miracle and to watch that milk be thrown away without any regard for my baby was heartbreaking.”"},{"comment_id":"10154200313034411","commenter_b":"'@username do explain which nation was exterminated, and you're a unwelcome imigrant in south africa, you will also get what you sow, dickhead","commenter_a":"England never apologized for any war crimes during Imperialism era ...bcoz they are too fucking arrogant and Egoistic goons !!!","post_message":"During the Second World War, Ireland remained neutral and successive Irish governments were openly belligerent to British interests (Op-Edge by Bryan MacDonald)"},{"comment_id":"10154874760616037","commenter_b":"He said he was deporting illegal CRIMINALS not all illegals.","commenter_a":"it would cause a shitstorm...seeing police officers pulling parents out of their homes while kid's look on crying...meanwhile it would be all over CNN...and the divide between people and officers would be even greater","post_message":"Officers are 'not going to engage in law enforcement activities solely based on somebody's immigration status.'"},{"comment_id":"10153743132780950","commenter_b":"Fuck you Bitch!!!","commenter_a":"The entire staff cheats on that team !!! Even Bellicheck...fuck the entire Patriots organization!!!!","post_message":"New England Patriots quarterback announces latest move in wake of court rejecting appeal."}]
