[{"comment_id":"10153312472421323","commenter_b":"Over kill..............","commenter_a":"It's a wonder the shells didn't bounce off the medals.","post_message":"Hyon Yong Chol, who heads the isolated country’s military, was purged and then executed by firing squad with an antiaircraft gun, watched by hundreds of people, South Korean media reported on Wednesday."},{"comment_id":"10153589847823984","commenter_b":"I'll help her pack to get the hell out of America! What a twit...","commenter_a":"If she is on welfare take her check and benefits away. Then make her do community service cleaning the toliets in a national park.","post_message":"Wow. This news makes her challenge even more shocking...  Do you think there should be a punishment for those who desecrate the American flag?"},{"comment_id":"10153880713234753","commenter_b":"Do better job then Hillary","commenter_a":"Vote trump","post_message":"A Latino Trump supporter in California claims it’s a lot more difficult to publicly support Donald Trump than to come out as gay. Juan Hernandez, who is a member of the Log Cab Republicans, a gay conservative group, indicated that he was leaving the Trump rally in San Jose, California, on June 2, when a mob of violent Trump protesters attacked him, breaking his nose in the process. A friend was similarly set upon by the assailants, some of whom carried the Mexican flag and were burning the... @webpagelink"},{"comment_id":"1739139336348305","commenter_b":"My thoughts are she need to shut up! She belongs being bars!!","commenter_a":"She is a disgrace.","post_message":"'It's essential that we stop terrorists from getting the tools they need to carry out the attacks and that is especially true when it comes to assault weapons like those used in Orlando and San Bernardino.' -Hillary Clinton  Weigh in with your thoughts. @webpagelink"},{"comment_id":"10153004075042061","commenter_b":"These magnificent creatures were never meant to be made to stand on their heads or do any of the other ridiculous tricks they're forced to do.","commenter_a":"Stop hitting elephants.","post_message":"An elephant attacking your car - never a good thing: abcn.ws/1LxMzPP"},{"comment_id":"10155014119221178","commenter_b":"Democrats have always gotten away with MURDER!!","commenter_a":"Accountability was not a word he knew--or enjoyed.","post_message":"Talk about a major understatement from The Daily Beast."},{"comment_id":"10153140603601051","commenter_b":"Shut up bitch [Lizzie] !!!","commenter_a":"I believe you were given an explanation...if your son didn't understand, you sure did and should have suggested he put it on the wall or door of his bedroom. You are the parent.","post_message":"This mom didn't think anything would happen when her disabled son displayed something in his window. A few days later she got a letter from her community's management company: Pack your things and leave."}]
