[{"comment_id":"10154119917737234","commenter_b":"Donna anther corrupt politician","commenter_a":"Marine Waters","post_message":"Who Will Be The Next DNC Chair? The Vote Is Happening Now"},{"comment_id":"1271439512904593","commenter_b":"Now this is the kind of moms we need in America. This the type of mom who deserves happiness","commenter_a":"wow","post_message":"MOM OF THE YEAR: She says she promised herself she'd do anything to give her kids a normal life."},{"comment_id":"10153208409382093","commenter_b":"She asleep in the kitchen ?","commenter_a":"So just because you invite someone over that person has the right to have sex with you? No means no! And even if she was too drunk to say no, if she never say yes, then it is a freaking no! I didn't know that just because you let someone in your house you're automatically saying \"you can come in my house and rape me :)\"","post_message":"The victim said she woke up to find the suspect forcing himself on her.... so she fought back with what she could find... @webpagelink"},{"comment_id":"10153534824302550","commenter_b":"She wasted our tax dollars on fantasy.","commenter_a":"Why is everyone so negative? A thirteen year old took a state to court. That says alot. Why is it OK for the president to waste money talking about climate change but not her. Get your heads out of your Butts people. She is not the problem, but did try to come up with a solution","post_message":"A judge has ruled against a 13-year-old girl who took North Carolina to court over climate change More ---> @webpagelink"},{"comment_id":"10153796202658797","commenter_b":"I sure am glad this lady didnt work at a bank....","commenter_a":"really?? you're going to fire a pregnant employee for being robbed? how dumb and stupid and idiotic can they be? are they blind and deaf SHE JUST GOT FREAKIN ROBBED. i say sue them dumbasses","post_message":"YOU'RE FIRED! Marissa works at a fast food place. She’s 5 months pregnant. Imagine her terror when a gunman jumped the counter and demanded money. He got away with nearly $400. But Marissa says the store blames her. They gave her a choice: She can pay back the money or lose her job. But the store has a very different story:"},{"comment_id":"1398558810203863","commenter_b":"Stay off facebook lady.","commenter_a":"I'm not a hater, and love fashion, but, this dress is absolutely unprofessional! Why would she do something like this...makes a person wonder!!!","post_message":"'She looks like she's working for an escort agency!'"},{"comment_id":"10153290853866636","commenter_b":"Did she prove he showed her that fake passport? How else could she get cleared?","commenter_a":"Give that woman my phone number","post_message":"Amanda Lockhart is 46"}]
