[{"comment_id":"1199877433404302","commenter_b":"Neither. I refuse to vote for a disgusting womanizer who cares nothing about this country and I also refuse to vote for a woman who has covered up her husband's sexual assaults and has allowed troops and ambassadors to die on her watch. They are both liars and cheats and I will pray for this country everyday until either one of them is finally out of office.","commenter_a":"Hillary Clinton","post_message":"Women Voters Only: Your Choice for President?"},{"comment_id":"10154738479449575","commenter_b":"Hanna Mae Klemann there you go","commenter_a":"No","post_message":"Arby's is testing out venison sandwiches at select locations for just a few bucks! Would you try the sandwich?"},{"comment_id":"10153888153653352","commenter_b":"You said it all...Thank you!","commenter_a":"I feel she should have been fired.... possibly fined. Holding her in jail until she changes her mind is a waste of tax dollars and time.... yes this woman stood up for what she believed but she still had a job to do .... not only did she refuse to issue same sex marriage license but she didn't allow the people under her who were willing to issue them either.... that is wrong..... this woman used her title and athority and held an entire government staff to her religious beliefs ... she didn't have to issue them she could have let someone else do that and still be faithful to God's law.... this country was built on freedom of religion. That means no law can be withheld or upheld based on religious beliefs.... she made an oath to follow the laws of the US , as soon as the laws ...","post_message":"Defiant Court Clerk, Kim Davis, Will Be Held In Jail Until She Agrees To Issue Same-Sex Marriage Licenses! CHRISTIANS WHAT IS YOUR REACTION?"},{"comment_id":"10154595284389888","commenter_b":"Oh for crying out loud. He's pissed because he can't get his bad people in. OMG. People are so childish. Illegal vs legal.","commenter_a":"Why don't U take your Iranian A$$ back to your country and direct movies over their . U don't like it here LEAVE.Sorry POS. And stick that OSCAR where the sun don't shine","post_message":"\"My absence is out of respect for the people of my country and those of other six nations whom have been disrespected by the inhumane law that bans entry of immigrants to the U.S. Iranian director Asghar Farhadi won an Oscar tonight, but chose not to attend the ceremony in response to President Donald J. Trump's recent travel ban."},{"comment_id":"10153995580906037","commenter_b":"This is an ugly woman","commenter_a":"This is not a man. This is not a man who will handle such a public failure very well. This is not a man. This is not a man who was courageous enough to participate in the last Republican debate despite Megyn Kelly asking hard questions. This is not a man.","post_message":"In the week leading up to the Iowa caucuses, Donald J. Trump issued more than 120 tweets. He took 16 hours to break the silence after his loss to Ted Cruz ."},{"comment_id":"10153577383622061","commenter_b":"she is an african american woman and can clearly see the hand on the jacket is a white persons hand. Open your eyes","commenter_a":"This has to be photo shopped. The woman has 3 hands. 2 on her face and 1 on his coat. My father was a fireman too, but would not have been allowed to pull a stunt like this!","post_message":"WATCH: Firefighter goes to great heights, literally, to make one stunningly beautiful proposal!"},{"comment_id":"10154376961882217","commenter_b":"Britain needs to sort their own issues first!!!!!","commenter_a":"Odious poison dwarf","post_message":"Will this speech stop Donald Trump addressing the UK Parliament?"}]
