[{"comment_id":"987873944592566","commenter_b":"She willl burn in Hell","commenter_a":"you have that right @username,I wonder if she ever thought how she got here on earth??","post_message":"Pro-abortion Congresswoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb. baby that's not born yet. Her response? No restrictions. Period. Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"10153535750495667","commenter_b":"@username she is a horse","commenter_a":"She's still ugly and that will never change!","post_message":"Michelle Obama turned Friday the 13th into a fashionable affair."},{"comment_id":"10152702805232452","commenter_b":"No!!! Go away. ...far away","commenter_a":"Crystal Porras...No!!! Not SB!!","post_message":"A person who was being monitored by the Santa Barbara County Public Health Department for Ebola was being taken Sunday night to a Los Angeles area hospital as precautionary measure after displaying signs of illness. @webpagelink"},{"comment_id":"1027758113945859","commenter_b":"What a bunch of liberal pussies you all are.....keep smoking that pot and living in your mom's basement LOL","commenter_a":"I love you Bernie!","post_message":"In just a few days, voters across New York will make their choice for the presidential nomination on Tuesday, April 19. The entire country will be watching as the results come in. And with your help, New York will send a profound message to the political and economic establishment in this country. That's why we're asking you to commit to vote for Bernie."},{"comment_id":"1166206863447175","commenter_b":"Agree","commenter_a":"when did she say that? when her mother was running against him for the nomination?...can't think she said it recently...","post_message":"Americas Freedom Fighters"},{"comment_id":"1816447821944782","commenter_b":"put a sock in it bitch","commenter_a":"What if Trump said he was here for the white folks. These people just don't get it.","post_message":"Former Bernie Sanders campaign spokeswoman Symone Sanders just appeared on CNN to weigh in on the future of the DNC and the Democratic party."},{"comment_id":"10156229104235354","commenter_b":"Kim more is nothing but a troll. But she needs to shut up and mind her on business. Dumb Limey.","commenter_a":"Piers shut up and stay in England, count all the people been kill in your own country....................................................","post_message":"See his 5 tweets."}]
