[{"comment_id":"1757774521121112","commenter_b":"This is so DUMB! I would vote for any Republican before I would vote for \"Killery\" You sure don't know what you will get with her!.","commenter_a":"@username Agreed","post_message":"An RNC delegate just announced the great lengths she’d go to make sure Trump doesn’t win, it's not going to sit well with many people..."},{"comment_id":"10153778379533984","commenter_b":"They are disgusting!","commenter_a":"Cancel it immediately!","post_message":"If you thought the controversial comments that were made on air by 'The View' co-hosts were bad, wait till you see what was reportedly said backstage... What do you think of 'The View'? Have they gone too far this time?"},{"comment_id":"10152600779162217","commenter_b":"How is it funny how we'll let an aeroplane be controlled by a computer, when we all know of the very high general standard of trained pilots we have flying our passenger aeroplanes who are there too? Just thought I'd point out one of the stupidest thing I've ever heard.","commenter_a":"I didn't think it would be long before we had driverless cars. I am a terrible driver so this would suit me right down to the ground.","post_message":"Driverless pods, set to hit the streets of UK cities, are unveiled for the first time. Would you be able to relax and trust technology to take you for a ride? @webpagelink"},{"comment_id":"10153437079993984","commenter_b":"She can eat poop as far I care along with her piece of crap husband","commenter_a":"We need to vote more of these intellectual people into office. We should be so grateful to them for telling us what to eat...reckon they could help me pick out my clothes too?","post_message":"Wow. I will have to pass and stick to the original... Do you think the federal government should stay out of what Americans decide to eat?"},{"comment_id":"1052995884768693","commenter_b":"Miley Cyrus? The skank can't even keep her tongue in her mouth!","commenter_a":"Good who needs them!","post_message":"“I will give you a one-way ticket to the country of your choice, with the stipulation that you promise never to come back.” WATCH: Sean Hannity made an offer to the celebrities who are vowing to leave the country if Donald J. Trump becomes president."},{"comment_id":"10154271758836336","commenter_b":"oh god, its attack of the uneducated middle aged housewives!","commenter_a":"bush is guilty of actual war crimes, but no, lets just crusade against a democrat because they are a democrat. you retards disgust me.","post_message":"BREAKING NEWS: The infamous Romanian hacker known as “Guccifer,” speaking EXCLUSIVELY with Fox News, claims he easily – and repeatedly – breached former Secretary of State Hillary Clinton’s personal email server in early 2013."},{"comment_id":"10153624031427293","commenter_b":"But don't forget it's going to be a wall that's yuuuuge and beautiful and the best part is Mexico is going to pay for it!","commenter_a":"does he have any ideas? any plan other than the wall?","post_message":"\"(Trump) will run into a buzz saw of reality otherwise known as the general election, and he may not know how badly mangled he’ll get.\" via Washington Post Opinions, Outlook, and PostEverything"}]
