[{"comment_id":"10153401168701130","commenter_b":"Pussy ... no balls...","commenter_a":"Char Marsh","post_message":"President Obama is a little too used to reacting to shootings. Video: NowThis"},{"comment_id":"916180815144838","commenter_b":"She is still the best when compared to the other guys. Run, Hillary, Run.","commenter_a":"Rut-roh!","post_message":"Are Clinton's numbers doing better or worse since she formally entered the 2016 race?"},{"comment_id":"556934131139724","commenter_b":"So your telling me that New York wants refugees even after they experienced 911? I'm going to officially say they are retarded.","commenter_a":"It's not up to the states to determine it.... it just slows the process down, but they can ultimately come to wherever they want so long as the feds allow it...","post_message":"UPDATE: Four additional Governors have said that they are willing to allow Syrian refugees into their states: New York, Oregon, Utah, and Virginia. We simply do not have the ability to adequately vet more than 75,000 incoming refugees. I stand with the 31 Governors who are fighting to keep our nation safe. Contact your Governor today. CURRENTLY ACCEPTING: Colorado Governor John Hickenlooper Phone Number: (303) 866-2885 Facebook: @webpagelink/ Connecticut Governor Dannel Malloy Phone Number: (860) 566-4840 Facebook: @webpagelink/ Delaware Governor: Jack Markell Phone Number: (302) 744-4101 Facebook: @webpagelink Hawaii Governor: David Ige Phone Number: (808) 586-0034 Facebook: @webpagelink/ Pennsylvania Governor: Tom Wolf Phone Number: (717) 787-2500 Facebook: @webpagelink Vermont Governor: Peter Shumlin Phone Number: (802) 828-3333 Facebook: @webpagelink/ Washington Governor: Jay Inslee Phone Number: (360) 902-4111 Facebook: @webpagelink Oregon Governor: Kate Brown Phone Number: (503) 378-4582 Facebook: @webpagelink/ Utah Governor: Gary Herbert Phone Number: (801) 538-1000 Facebook: @webpagelink/ New York ..."},{"comment_id":"421180878069520","commenter_b":"^^ this idiot supports sanctuary cities and providing safe harbor to illegal alien criminals","commenter_a":"Hillary belongs in prison.","post_message":"More than $400 million has poured into the presidential race so far."},{"comment_id":"10153974538694228","commenter_b":"Wow. Two uneducated racists here.....Jean and Gary! Shame on you both!","commenter_a":"You can thank Trump for perpetuating this problem.","post_message":" Muslim? All of you should die! The man yelled from his car. He then went inside for his gun. Police are seeking hate crime charges."},{"comment_id":"10153064906873984","commenter_b":"Providing we can sue you - You don't even secure the borders .","commenter_a":"Another Hitler.With his name being Barrack Hussein Obama,what do you expect. He's proud of his name,and being a Muslim.","post_message":"A government in control of all cyber space is slowly taking shape. Consider yourself warned."},{"comment_id":"1202395043109110","commenter_b":"betty you need to get your facts checked for you are off your mind. over the past 6 years the number have increase and a large number that was to be send back Obama administration let them go. don't listen to the libs press unless you can't think for yourself. a American life is worth more then sending illegals back. and it's the free stuff they get is why they come. so next illegal that was charged for federal crimes and sent back to their country comes back and kills an American why don't you go tell the family that there was nothing that could have been done to stop them because the illegal is more important then their love one. why don't you use your head and read both sides of the story instead of only one side unless you are an illegal yourself.","commenter_a":"Harry Reid is right. This bill is not the answer to a difficult problem. Some of the folks that have posted think this is a great bill. They aren't stopping to realize that it will cost more to house, feed, and send these people back to wherever they have come from, which is probably a very unsafe place or why would they have left in the first place? I hope this bill is seen for what it is, a terrible step in the wrong direction and hopefully our Senators will have more sense than to pass it into law. If you will check the numbers, in recent years more undocumented people have left the United States than have entered.","post_message":"The vile legislation that is now before the Senate might as well be called the \"Donald Trump Act.\" Like the disgusting and outrageous language championed by Donald Trump, this legislation paints all immigrants as “criminals and rapists.” Local law enforcement officials, domestic violence groups, immigrants’ rights groups, mayors, faith leaders and labor groups all oppose the \"Donald Trump Act.\" This bill does nothing to keep Americans safe, and it certainly does nothing to address our broken immigration system."}]
