[{"comment_id":"10152592127946717","commenter_b":"I wonder why she hasn't refused service to other heathens? You know, non-Christians, like Muslims or women who cut their hair...wait...that bitch cuts her hair! Where's my stone!","commenter_a":"So let's get this right. She's in the business of making money but she didn't want to accept money and now she's willing to spend money in order to avoid making money. She is logically 'out of business'.","post_message":""},{"comment_id":"1783246305275728","commenter_b":"@username Yes She did","commenter_a":"I am Dutch. Sylvana Simons said \"All White people are Racists\". Now everybody is angry at her. She never changed her opinion and never said sorry. She is a member of Denk, a Dutch Turkeys political party. The party has very extreme opinions and backs Erdogan without questions. They like sharia law, and child marriage.","post_message":"\"People shouldn't turn it into something negative,\" says one mum whose son dressed up as 'Black Pete' for a parade."},{"comment_id":"10153825781392522","commenter_b":"There goes the fake Native American vote!","commenter_a":"Another documented lying Democrat fanning the flames. STFU Pocahontas","post_message":"\"We will fight harder, we will fight longer and we will fight more passionately than ever.\""},{"comment_id":"1172312176140350","commenter_b":"BUILD THAT WALL!!!! BUILD THAT WALL!!!!","commenter_a":"Lol","post_message":"EXACTLY!"},{"comment_id":"10155823067465492","commenter_b":"Oh God there she goes again someone gotta find this chick a map","commenter_a":"Thank you Di Blassio!","post_message":"\"We are currently investigating and stand ready to assist the NYPD in bringing these individuals to justice,\" an Uber spokesman said."},{"comment_id":"10153475865743645","commenter_b":"Yes and she is a real b:tch","commenter_a":"Was the gator named karma ?","post_message":"He jumped into a pond to hide from authorities and an alligator attacked him."},{"comment_id":"10152666100851680","commenter_b":"I used to be sympathetic to Israel. Not today, and I'm part jewish.","commenter_a":"Yes it has lost its soul and also the respect the world had for Israel.","post_message":"OPINION: Fear defeated hope in Tuesday’s election, disfiguring our future. Via POLITICO Magazine"}]
