[{"comment_id":"10153545151956336","commenter_b":"Megyn deserved the beating from Trump. She's an uppity bleach blonde.","commenter_a":"Tonight Fox sucks","post_message":"“I think the big problem this country has is being politically correct. I don’t, frankly, have time for total political correctness.”    Donald J. Trump responds to Megyn Kelly after she asked him, “How will you answer the charge from Hillary Clinton…that you are part of the war on women?”"},{"comment_id":"10153722294756350","commenter_b":"Nobody is forcing people to contribute","commenter_a":"This is what has been attained from people feeling low, down & out. Preacher Joel Osteen had amassed a fortune of $56,508,500 and lives in a $10,500,000 mansion in River Oaks. River Oaks is the wealthiest and most expensive community in Texas.","post_message":"Are you going through a tough time? Pastor Joel Osteen has some advice. (cc: Joel Osteen Ministries)"},{"comment_id":"765017110298136","commenter_b":"I agree. That would stop illegals dead in their tracks!","commenter_a":"If they would allow the soldier to shoot that vermin off the fence, that shit would end","post_message":"For some reason, this truth is lost on liberals, but what isn't?"},{"comment_id":"10153743310093606","commenter_b":"Sad, if she didnt want the child I would have taken her no questions asked","commenter_a":"She needs shoot","post_message":"HORRIFIC: A 6-month-old baby girl died Thursday afternoon after police and witnesses say her naked mother dangled her from the window of an apartment building in the Bronx before throwing her to the pavement six stories below. @webpagelink"},{"comment_id":"616988195096921","commenter_b":"If they don't like it, what can the Republicans offer that's better. We need well educated people.","commenter_a":"Where do I sign?","post_message":"The President just announced something very BIG - a proposal to make two years of community college free for anyone who’s willing to work for it.   #FreeCommunityCollege"},{"comment_id":"637619693095276","commenter_b":"Lock her up","commenter_a":"ITS FUCKTARDS LIKE YOU THATS FUCKED THIS COUNTRY UP ,, AND THE LIVES OF YOUR KIDS !! G E T T O T R A S H. !!","post_message":"This woman is bragging about stealing your tax dollars.  Disgraceful. She should be kicked off welfare and be forced to pay us back immediately.  Do you agree we should kick her out of the country?"},{"comment_id":"884400811644417","commenter_b":"Once again, that blonde bimbo has diarrhea of the mouth!","commenter_a":"this guy has an ego like no other. he is disgusting to look at and if he weren't rich he would probably be a homeless pervert or a wall street runner.","post_message":"The Oracle of the Republican Party speaks out."}]
