[{"comment_id":"1742501459315047","commenter_b":"SORRY HILLARY IS PRISON BOUND.MAYBE YOU CAN WRITE HER.","commenter_a":"Just like she took care of the Benghazi situation?","post_message":"\"I’m afraid because these motherf—kers are coming for us, y’all.”"},{"comment_id":"467807840076463","commenter_b":"IDIOT ! LEAVE !!","commenter_a":"Yes, DEFINITELY","post_message":"Should Muslims Who Don't Like Christian Holidays Leave America?  Comment 'yes' or 'no'."},{"comment_id":"697111387146106","commenter_b":"Go get them","commenter_a":"Unleash the Donald","post_message":"Donald Trump says he would bomb the sh*t out of ISIS during speech.  You have to watch this. He is absolutely right.  Do you support Donald Trump?"},{"comment_id":"10152709650356051","commenter_b":"Daila Gonzalez, if you are here illegally, it's time for you to leave!","commenter_a":"We should spend more money on our mentally ill americans then we do illegals.. It is such a shame they get so much while we neglect our own...","post_message":"Police saw that a man at IHOP couldn’t pay his tab, so they decided to pay for him. A few hours later, they made a grisly discovery in his apartment"},{"comment_id":"10153663398345695","commenter_b":"Are you for real, time and money wasted on a couple of idiots that felt the need to drop confederate flags on a church lawn!!!","commenter_a":"Can someone please explain to me how this is a crime .","post_message":"\"What can you do? Nothing but pray for them,\" said Stacy McCrary.   Why the suspects can't be charged with a hate crime starting on Channel 2 Action News at 4 p.m."},{"comment_id":"10154855250569062","commenter_b":"please name a book that would represent all citizens lol come on now. Tennessee is like 81% christian so i think the book works fine @webpagelink/ it represents the people not the government, so there is your seperation :P","commenter_a":"Even when I was an atheist, the bible was a good read. Some of them just need to get their head out of their butt to look at things objectively.","post_message":"Good idea? Bad idea?"},{"comment_id":"10153218789208132","commenter_b":"What about women who cheat?","commenter_a":"If my husband cheated on me I'd do a lot more then throw a shoe at his face. This man should consider him lucky. Its SAS that people stick up for men when they cheat. And people wonder why women get upset in relationships.","post_message":"\"Wouldn't you be this upset if you came home to this?\" she said when asked if she had thrown the shoe."}]
