[{"comment_id":"683830911775006","commenter_b":"WHO CARES!!!!!!!!!!!!","commenter_a":"So she is smart good for her.","post_message":"People are freaking out over what's being said about Taylor Swift today..."},{"comment_id":"10153406573360329","commenter_b":"Crocs get the pussy wet.","commenter_a":"There's nothing wrong with my crocs.","post_message":"Welcome to the nope zone."},{"comment_id":"1541756345884108","commenter_b":"Needs to be castrated","commenter_a":"someone please castrate this idiot","post_message":"The 'abhorrent' paedophile has been jailed for just THREE years"},{"comment_id":"10153963573598984","commenter_b":"Disgusting stupid females that believe that has brevetted mine","commenter_a":"And this is not their idea of hell a place of lust","post_message":"This Muslim cleric realized that female suicide bombers don't have a whole lot of use for 72 virgins... so he came up with his own reward for these \"martyrs.\" It's even more disgusting than you think it is, too."},{"comment_id":"10157894599650291","commenter_b":"Every time a Democrat gets in, we lose more of our state and lively hood. Need to cut the head off of that green snake.","commenter_a":"how are you even still in office?...","post_message":"Today President Barack Obama placed the entire Chukchi Sea and the vast majority of the Beaufort Sea off-limits to energy development. The only thing more shocking than this reckless, short-sighted, last-minute gift to the extreme environmental agenda is that President Obama had the nerve to claim he is doing Alaska a favor. President Obama has once again treated the Arctic like a snow globe, ignoring the desires of the people who live, work, and raise a family there. I cannot wait to work with the next administration to reverse this decision."},{"comment_id":"729302233879236","commenter_b":"@username No, she is insane and a danger to others.","commenter_a":"Dreadlocks existed in Scandinavian, Mediterranean, and Middle Eastern cultures as well. Also, does this make it permissible to confront black women who have straightened or relaxed hair for taking white people's culture? No?","post_message":"\"You're saying that I can't have a hair style because of your culture? Why?\" the man said. \"Because it's my culture,\" the woman said."},{"comment_id":"10153553147025927","commenter_b":"Send her into orbit!","commenter_a":"Racist","post_message":"Apparently Whoopi doesn't care if the DNC rigged the system. Why? Because it's against a white guy. #DNC2016"}]
