[{"comment_id":"1133897243307426","commenter_b":"Matt AtkinsonJack Nicholls looks like im moving","commenter_a":"Luis Barillas this reminds me of donuts after work. Hahaha","post_message":"Not recommended for our home viewers.... @webpagelink"},{"comment_id":"10153135798986323","commenter_b":"oh no Claire Leivers you are being invaded by more vikings!","commenter_a":"Martin Theander ...thoughts ?","post_message":"A bridge too far?"},{"comment_id":"10153036402924885","commenter_b":"excuse you? I am so sick of all that we went through when we brought the rams here, and they aren't that great a team to be trying to drum up public support for them again. If you're such a good fan, how bout you follow then to wherever they end up!","commenter_a":"Let 'em GO! Let 'em GO!","post_message":"Details of the plan for a new downtown football stadium were revealed today. Peacock called the project more than a football stadium: \"We are talking about a revitalization of our downtown.\" Take a look and let us know what you think."},{"comment_id":"10153676011437093","commenter_b":"I'm highly educated and make my decisions based on research and personal conviction. I am 100% against abortion used as birth control (not medically necessary terminations). I will never give up my rights to bear arms. And I find your tone patronizing, but that's nothing new. I won't vote for HRC because she is the reason my brothers are dead from Benghazi, she never owns her bad decisions and she cuts out the millions of Conservative women in her views.","commenter_a":"The entire DNC has spoken in this convention as though we millions of Republicans aren't even part of America. Can't wait until he is gone and Trump is our president!","post_message":"President Obama encourages Democratic Convention crowd to do more than boo Donald Trump. #DemsInPhilly @webpagelink"},{"comment_id":"1694550140816786","commenter_b":"Misogyny!... misogyny everywhere!","commenter_a":"RIP, Chyna. But in your next life don't be a wrestler and a pornstar. Two terrible choices for a woman.","post_message":"She was known as the \"Ninth Wonder of the World\". #RIPChyna"},{"comment_id":"10153144950646350","commenter_b":"Or because girls are just jealous that \"that ugly skank\" will have taylor for life now","commenter_a":"Why is everyone a hater! Give them your best and move on! I think they are a wonderful couple! Congratulations!","post_message":"Congratulations, Lady Gaga!"},{"comment_id":"10154297413016378","commenter_b":"And, as usual when in the playoffs, promptly lose","commenter_a":"Haha, pretty sure Garrett said he wanted to keep the momentum going into the postseason. The only QB to move the ball was Romo and he got most of his yards through PI. The Boys were flat out beaten today. No excuses. Dallas has looked pretty weak the past few weeks.","post_message":"The Philadelphia Eagles end the season on a high note with a win over The Dallas Cowboys! Final Score: 27-13. @webpagelink Way to go Birds! E-A-G-L-E-S EAGLES!"}]
