[{"comment_id":"817070211680479","commenter_b":"Who cares about this slut","commenter_a":"POS","post_message":"“I hate everything about this country.” Rapper Azealia Banks Tells Playboy Why White America Owes Her Reparations… How does someone who makes millions in America get away with saying she hates everything about our country?"},{"comment_id":"617240545084050","commenter_b":"Gabe Monfried","commenter_a":"She was checking up on Bill","post_message":"It was really strange when Hillary was missing from the podium last night. Not very presidential!"},{"comment_id":"465274473632508","commenter_b":"Goddamn witches..","commenter_a":"Animals.","post_message":"This is the first time they have beheaded civilian females."},{"comment_id":"10154408917183797","commenter_b":"How big is that wall going to be? Lol","commenter_a":"This is why I can't wait for Trump being elected and building a giant wall!!!","post_message":"FLIGHTS TO CUBA: U.S. officials say the United States and Cuba will sign an agreement next week to restart commercial air traffic for the first time in five decades."},{"comment_id":"776943375772176","commenter_b":"Nope definitley not a lie lol, I was biologically born female.","commenter_a":"I'm a conservative on most issues, but I disagree big time on this one being a trans male as well (my original biological sex being female). You really want me to go in the women's room and make people there uncomfortable?","post_message":"Are you freaking kidding me..."},{"comment_id":"1132428533502348","commenter_b":"I think they should be deported back to Mexico. There here because Obama wants more democratic votes. He is now trying to give them rights to vote. A lot of Hispanic legals who work hard are against them.","commenter_a":"This should anger all Americans!! BUILD THAT WALL TRUMP!!!!","post_message":"This firefighter and 2 kids were just killed... if that weren't infuriating enough, wait til you see WHO murdered them. This is EXACTLY what Donald J. Trump has been talking about..."},{"comment_id":"10153911405746509","commenter_b":"Lesbians rock","commenter_a":"its possible that he may have some mental issues :P but seems like a practicing Jewish...!!","post_message":"A 16-year-old girl, who was one of the people stabbed during a gay pride parade last week in Jerusalem, has died, police said. @webpagelink"}]
