[{"comment_id":"10153161460796051","commenter_b":"You're stupid","commenter_a":"He's promoting this cause he knows him and his racist wife will end up in a cell very soon.","post_message":"Here's why President Obama says it's time to end mass incarceration in America. Do you agree or disagree with his message?"},{"comment_id":"1590050817948698","commenter_b":"Hey, Justine. Did you know that the Quran teaches Muslims to kill you and I? If you think that's religious freedom that Christians should be tolerant of when they come to kill you I'll be happy to tolerate it, but when it's my turn I'll handle it the old American way.","commenter_a":"No America was founded on Christian values","post_message":"Barack Obama continues to show his Muslim roots..."},{"comment_id":"852438651458224","commenter_b":"She's an idiot!","commenter_a":"AS. THE REAL Castro DID FOR THE USA. SEND THE BOAT PEOPLE. RETURN THE FAVOR. SEND OUR BOAT PEOPLE LET THEM SEE HOW THE REAL CUBANS ARRE BEING TREATED THE NUT. JOB IS TALKING. REVOLUTION.ARESST IT PUT IT IN JAIL. THE SCHOOL KNOWS ALL ABOUT HER AND DID NOTHING.INVESTGATE THE SCHOOL THEY HAVE MORE LIKE her","post_message":"Look kids, this is what #liberalism does to the brain!  Pray you're never on a plane with someone like this! You have to see it to believe it:"},{"comment_id":"917823551667757","commenter_b":"This is another stupid Question!! HILLARY SHOULD BE IN PRISON 2016.. Dumb ass thinks she can run for president She just needs to STOP INSULTING AMERICANS INTELLIGENCE!!!","commenter_a":"Yes","post_message":"Multiple Choice Quiz time, Republican kiddies! Which answer did you choose? A or B? @webpagelink"},{"comment_id":"10154566603193645","commenter_b":"Most murders in US is commited by non Immigrant. Sandy Hook was by a mentally unstable person. Charleston commited by a Rasist unrepentant kkk inspite of the grace afforded him by the people he killed and their families. Florida commited by mentally unstable guy. The guns remain a major problem . Why is there no Presidential order banning guns. No NRA sponsored their election. Why ban muslims but allow christians. A a Christian myself I see this as very wrong. Saudi Arabia had 15 of the 19 killers of 911. Why is Saudi Arabia not included. Something is not right . I am Proud of the brilliant Judges. No one is above the Law.","commenter_a":"They should be thrown out and replaced. They can run for a political office if they want to push a political agenda","post_message":"BREAKING: A 3-judge panel just unanimously ruled against reinstating Trump's Muslim travel order. Do you support or oppose the court's ruling?"},{"comment_id":"10154592681344445","commenter_b":"Yup, they are trying to invade the US as we type. Better build that wall.","commenter_a":"Now that half the Republicans in the house have been officially brain-washed, his confirmation will take place. This country will be taken over by Islam, when it happens. Bad news for women and gays.","post_message":"\"I am confident he will serve the American people with integrity and a steadfast commitment to justice,\" the president said. @webpagelink"},{"comment_id":"10154280732936336","commenter_b":"Agree100%","commenter_a":"How is this discriminatory? Use the bathroom according to your plumbing not your frame of mind. What about the civil rights of those who don't want to share the restroom with those of another gender? If a transgender earns money they pay taxes according to their earning not what they think they should pay. I'm really tired of a few people re-writing the moral and cultural standards for the nation.","post_message":"\"I’ll make a decision in 24 hours.\""}]
