[{"comment_id":"760883910715426","commenter_b":"We will give her up to you Iran! Go let her ruin your country!","commenter_a":"Don't you need a brain to be a spy?","post_message":"Is Kim Kardashian West a secret agent?"},{"comment_id":"10154964809584522","commenter_b":"That is very much understood that was real wow","commenter_a":"What a beast! If only the Saints' defense could move like that and cover that much ground!","post_message":"See video of the massive tornado that caused serious damage throughout New Orleans East. Here's another shot of it from another angle in the Michoud area. (Video by Aundra Woodfin)"},{"comment_id":"725495814307663","commenter_b":"Hillary is a virus!","commenter_a":"That's Tillery when we're not really being serious about lives of American citizens. She's a disgrace to represent any American. Trump 2016!","post_message":"Trump Just Leaked A Video Of Hillary Clinton That Could End Her Campaign [VIDEO]  She is panicking. See this video before it gets scrubbed from the internet.  Do you think Hillary has no place in our White House?"},{"comment_id":"10154523076746028","commenter_b":"Milo is trash","commenter_a":"And most of you laugh when our president calls all of the BS networks and papers \"fake news\"!","post_message":"Eek."},{"comment_id":"1204607766260053","commenter_b":"Crazy woman","commenter_a":"Why is she even in the news? What is wrong with people that will send her money for this fruitless action...how stupid can you be?","post_message":"WOW! JILL STEIN'S 'FIRESIDE CHAT' Exposes Her Delusion On Recount [Video]   Jill Stein trying her best to remain relevant!"},{"comment_id":"10153716806409749","commenter_b":"What's wrong with a black lady ?","commenter_a":"Wasn't the judge a black lady???!!!","post_message":"\"There will probably be a book. It will talk of his love for Reeva. And the awful feelings of loss and guilt, that will stay with him forever.\""},{"comment_id":"880035775457816","commenter_b":"Some of the women who have become men have beards ,tattoos and 6 packs. Do people really want them to still use ladies toilets?","commenter_a":"This is not a presidential issue","post_message":"WATCH: Donald J. Trump addressed the recent fight over transgender use of public bathrooms, and whether he'd add separate facilities at his Trump properties."}]
