[{"comment_id":"1200823989996135","commenter_b":"@username I, for one, will not miss that evil animal at all!","commenter_a":"Lets just Eliminate him ... can't understand why he has not been removed already ... Oh Wait , people are to afraid to do anything !","post_message":"Obama now want to eliminate another of our national symbols. Just wait until you see this!"},{"comment_id":"10152931717926336","commenter_b":"They have no \"rights\" here in the US -- if they are here illegally they should be deported and if caught coming back into our country they should be put in a hard labor camp for 5 or more years --","commenter_a":"Thats all we need , one more moron!!","post_message":"U.S. Attorney General nominee Loretta Lynch said she believed in an illegal immigrant's \"right\" and \"obligation to work\" during Wednesday’s confirmation hearing."},{"comment_id":"1123021131087914","commenter_b":"the bulshit they talk is baloney. the true Americans are the native people the rest are immigrants.","commenter_a":"eah did you ount the dead, I mean the millions massacred by your ancestors the funding fathers the true Americans the only ones with the right to talk about how bad is immigration. Your talk is baloney.","post_message":"A Pew study found immigration will account for 88% of U.S. population growth over the next 50 years."},{"comment_id":"1363588373682001","commenter_b":"She should be a circus act, a walking talking pig!","commenter_a":"She's such a pig! She's irrelevant and is desperately attempting to retain some sort of notability. Yeah Rosie you and your big disgusting mouth will be remembered for the hateful words you've inflicted on society. Nice going!! I'm pretty sure you're own adopted kids figured you out and want nothing to do with you!? Very telling!","post_message":"Her tweet of a video questioning whether his young son, Barron, is autistic is nothing short of bullying."},{"comment_id":"10153373232208984","commenter_b":"Wow!! Such nasty, foul mouth comment from a woman. First Lady has more class than you will ever know.","commenter_a":"Yes we can not wait to get a real first lady again this nasty racist bitch needs to fk off","post_message":"I thought I'd seen every attempt at the race card possible, but this is definitely a new one... Do you look forward to Michelle leaving the White House?"},{"comment_id":"10154110742322439","commenter_b":"Cowards !! Stay to fight for your country !! You are Iran's puppets !!","commenter_a":"No problem. Enlist them in the French Foreign Legion - minimum 12 year enlistment; send them to Corsica for Basic and Combat training, and then deploy them to Libya to fight ISIS.","post_message":""},{"comment_id":"952954108073344","commenter_b":"Freaking Cowards !!!!!!","commenter_a":"My heart and stomach hurts..This has to stop and stop now..whos going to do it?..Not Obama cause hes one of them..This madness must stop","post_message":"BREAKING: This is the face of EVIL..."}]
