[{"comment_id":"10153447810474575","commenter_b":"Krista, i sure hope your child don't get molested, seems all you Duggar nut huggers have kids.","commenter_a":"Drive into traffic, Palin. Nitwit.","post_message":"Sarah Palin is lashing out against ‘radical liberals in media’ and their portrayal of the family behind the popular TV show “19 Kids in Counting,” after reports of Josh Duggar's sexual misconduct surfaced.  Palin said there was a double standard, stating actress Lena Dunham did not receive the same backlash after she revealed in her book that, as a child, she used ‘anything a sexual predator might do’ to bribe her young sister for kisses and more.   Palin began her rant on Facebook in all caps, writing 'HEY LENA, WHY NOT LAUGH OFF EVERYONE'S SEXUAL 'EXPERIMENTS' AS YOU HAUGHTILY ENJOY REWARDS FOR YOUR OWN PERVERSION? YOU PEDOPHILE, YOU.”"},{"comment_id":"1286858341353620","commenter_b":"who cares !!! no one !!! let that bitch fall !!!!","commenter_a":"She is sick. She was having a seizure. She is lying about her health. She was the only one wearing sun glasses and I thought it strange. She is a basket case.","post_message":"BREAKING:  HILLARY HAS MEDICAL EPISODE AT 9/11 CEREMONY in NYC.  Swept away by security detail.  VIDEO  @webpagelink"},{"comment_id":"10153444075108132","commenter_b":"Pretty sure she's had surgery and botox.. or some serious airbrushing was done. Cripes everyone at 50 has a wrinkle.","commenter_a":"Thank you for picking someone normal and down to Earth without a bunch of surgery","post_message":"Sandra Bullock is PEOPLE's #MostBeautiful Woman! @webpagelink"},{"comment_id":"10153460799391130","commenter_b":"When bitch steals ur face 😠","commenter_a":"Alyse Kozis @username - she makes one of your faces Karlie 😂😂","post_message":"Instagram's @Daddyissues_ hilariously meme-ifies herself."},{"comment_id":"512162555660096","commenter_b":"'@username, Kanye will never be President.","commenter_a":"Trump","post_message":"WATCH: Video of full Donald Trump campaign rally in Phoenix, Arizona."},{"comment_id":"10153664912304726","commenter_b":"There are Syrian refugees already there!!","commenter_a":"Yeah, let the refugees all live at the vatican. they got lots of money and plenty of room.","post_message":"The Vatican keeps out the throngs while the Pontiff urges the U.S. to open borders."},{"comment_id":"1116556865104033","commenter_b":"ignorant bitch, we are ALL immigrants!!!! VOTE HER OUT & VOTE STRAIGHT BLUE, FEEL THE BERN!!!!!!!!!!!","commenter_a":"When is the last time the republicans filled a bill about anything that would benefit the American people? These fools are of limited intelligence to be sure. Please people vote Blue every chance you get.","post_message":"Republicans are now setting their sights on our librarians."}]
