[{"comment_id":"521358881400958","commenter_b":"They never would of been allowed into Our Great America.","commenter_a":"Vote all Democrats out of office Be Smart America they are worthless hypocritical self centerd murdering traitors","post_message":"If you were in charge, would you have these deported back to where they came from?"},{"comment_id":"10153566690418812","commenter_b":"Get those horny chicks out of there.","commenter_a":"This is a good reason why you don't have them in there or serving in combat.","post_message":"One former female corrections officer is providing an insider perspective on forbidden love behind bars: @webpagelink"},{"comment_id":"1870199419930367","commenter_b":"@username I would argue that we are far worse than monkeys.","commenter_a":"What's truly is a tragedy is the length of time humans have been in existence, and we still haven't gotten very far and I don't think we're capable of forming a world based on simple human decency.","post_message":"A great nation is judged not by how many millionaires and billionaires it has, or by the size of its military budget. It is judged by how well it treats its weakest and most vulnerable citizens. A truly great nation is one that is filled with compassion and solidarity."},{"comment_id":"606394809493701","commenter_b":"Wish they would come here n do that to woman who use lil kids as weapons against their Dads .","commenter_a":"Christians werent complaining when they wiped out the indians or burned people in the south","post_message":"Show this a liberal."},{"comment_id":"1039851232779934","commenter_b":"Leave the poor girl along. ..she's retarded","commenter_a":"No. She has been lied about for years!! Republicans can't stand a strong woman with brains!! Gotta tear them down. They prefer mindless, brainless twits like Michelle Bachman and Sarah Palin.","post_message":"Answer with a simple 'yes' or 'no': Is Hillary Clinton corrupt?"},{"comment_id":"10153588505935329","commenter_b":"Arielle white people shit. Add this to the list.","commenter_a":"Ewrick Velasquez shark week!!!!","post_message":"Jaws IRL."},{"comment_id":"10152670705340671","commenter_b":"Glad she was able to fight him off but lets be smart about it ladies.","commenter_a":"What was she doing jogging in the dark at 5 am in the morning. I am not condoining she got attack. But account for ones own safety is what I am saying.","post_message":"The woman was able to fight the attacker off, police say."}]
