[{"comment_id":"599509270200252","commenter_b":"THE ALPHA MALE !","commenter_a":"South Carolina here comes TRUMP. Let's work together and get this man elected as President of USA. United we Stand!!","post_message":"Departing New Hampshire with my amazing family! THANK YOU- NEW HAMPSHIRE! Tonight the VOTERS decided. Next stop is South Carolina! I LOVE you ALL & THANK YOU! Together we are GOING TO MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10154077757710575","commenter_b":"WOW WORLD LEADERS RATTLED BY TRUMP JUST LIKE THEY WERE WITH REAGAN I THINK IT'S A GOOD THING THEY ARE SHAKING IN THERE BOOTS NOW THE FOLKS THAT ARE ABLE TO WORK LET'S GET THEM OFF OUR DIME MAKE THEM WORK EVEN IF THEY STAY ON WELFARE LET'S MAKE THEN CLEAN THE STREETS WORK FOR THE MONEY","commenter_a":"world leaders have no respect for Obama.","post_message":"Obama wants to make headlines...  So he attacks Donald Trump while in Japan."},{"comment_id":"470542439803003","commenter_b":"He","commenter_a":"If she was a man...say so.","post_message":"Michelle thought she could have her way, boy was she wrong.  She forgot that there are still real Americans ready to expose her, we support them 100%.  Do you support their stand against Michelle?"},{"comment_id":"997230403648529","commenter_b":"Let the mf die","commenter_a":"NOT refugees","post_message":"What ungrateful, low life people. Should be a real asset to the country..."},{"comment_id":"10152621933698067","commenter_b":"You nuts lady!","commenter_a":"Of course it is not free but at least your taxes are going to education instead of wars all the time. I can't believe how many Americans are so brainwashed against a little socialism. You guys at \"the top\" gotta get back to basics. The greed in your country is appalling. We are the lucky ones to still have subsidized healthcare. Taxes should go first to education and not onky spelling and writing, but to teaching life-skills, budgeting, health. 2nd to health including dental health. Tax the crap out of the fat and sugar laden processed foods. Start caring for community and stop supporting the conglomerates. Yay for Obama. The best president since JFK, only mote moral in his private life.","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."},{"comment_id":"991326630995465","commenter_b":"I will never refer to you as a woman, just a bitch!","commenter_a":"I will never refer to him as President, just trump, no capital t","post_message":"From placing sworn white supremacists in key cabinet positions to sucking up to Vladimir Putin, Trump's actions speak for themselves... he is a clear and present danger to the survival of our country."},{"comment_id":"10154290844506323","commenter_b":"I get the picture: not everyone shares my view of the EU but I was trying to make a point that not all the youth are wanting to remain in the EU.","commenter_a":"I am 19 I voted for Ukip and tor the UK yo leave the EU. Not all of the youth are wanting to stay in the EU. I will stay loyal to our ancestors who fought and won two wars to ensure our freedom!","post_message":"Jeremy Corbyn has defended Labour’s campaigning in the EU referendum, telling a heckler at London’s Pride festival “I did all I could” in his first public defence of his role in the remain campaign."}]
