[{"comment_id":"1318671731495117","commenter_b":"So basically women have no rights to privacy in a woman's bathroom or locker room. So women have no rights in Washington State.","commenter_a":"They make a law for about one hundred (max) people. The Washington government doesn't think much of all the rest of the states people do they. What a waste of time.","post_message":"Big Brother is watching"},{"comment_id":"10152767059646519","commenter_b":"She is not a stripper!","commenter_a":"Really? Praising a stripper mom? You lost me today, @username.","post_message":"Go mom!"},{"comment_id":"1025373750832154","commenter_b":"@username, nope, not voting for her, either.","commenter_a":"The Trump train is full speed ahead. Get on board the Trump train. You will get run over. It is full speed ahead to making America great again. Mr. Trump for president 2016!!!!","post_message":"America is proud to stand shoulder-to-shoulder with a free & independent UK. We stand together as friends, as allies, & as a people with a shared history."},{"comment_id":"10153094131986378","commenter_b":"Nothing is going to happen to this so called mother ...because if a white judge sentenced her to prison..she'll pull the race card.......","commenter_a":"Can we leave her in a hot car???","post_message":"TODDLER LEFT IN 117-DEGREE CAR: An Arizona mom has been charged with child abuse after surveillance video showed her leaving her toddler locked inside a hot car while she went shopping at Walmart. See the surveillance footage:"},{"comment_id":"1538313829806168","commenter_b":"I am not paying you shit I had nothing to do with era so fuck you and for your stupid information the Dutch started the slave trade.but I can tell you come to my house I can guarantee you will have a bad day","commenter_a":"Not only no but Hell No","post_message":"All White People Owe Us Reparations, 'If You Don't Give It, We Are Coming To Take It' [VIDEO] They are demanding that we give them money for their ancestors slavery. Will you pay African Americans reparations?"},{"comment_id":"1061054770617718","commenter_b":"I'm voting for you Hillary!!!","commenter_a":"That will be hard to do from Leavenworth. But if she thinks she can go for it. Bill will be too busy I am afraid to help though.","post_message":"“It’s clear she knows how to get things accomplished in these crazy political times. She’s still standing after decades of Republican attacks, and she’ll force them to the table once in office.” -Iowa Starting Line"},{"comment_id":"10153129588721051","commenter_b":"Bitch, the only person rotting is you.","commenter_a":"The US has went to hell. Gays allowed, and 10 Commandments comes down. Shameful.","post_message":"Should this Ten Commandments statue stay up?"}]
