[{"comment_id":"969205239835501","commenter_b":"Karma ain't she a bitch!!!","commenter_a":"Karma is a bitch. Racism and bigotry are not signs of a patriotic, freedom loving American.","post_message":"The couple that hates together stays together, but their hypocrisy has finally come back to bite them."},{"comment_id":"1151935354873218","commenter_b":"Nasty hoe","commenter_a":"Some people are seriously fucked up! Mad, evil with a shot of mental illness.","post_message":"Damn  #WSHH"},{"comment_id":"10153919933534342","commenter_b":"ABC 13 Houston could you please explain what \"stunning\" about a kid riding a bike?","commenter_a":"At least its a 2 stroke bike","post_message":"Stunning video captured the moment a teen rode a dirt bike through a HS campus.  For the FULL story --> @webpagelink"},{"comment_id":"10153600253057431","commenter_b":"Well stated @username. Irony received. 😉","commenter_a":"White supremacist exist whether as paramilitary, or the idiotic Trump supporter who thinks he owns everything and everybody telling a Hispanic American (Jorge Ramos) to go back where he came from, to people who will destroy other cultures way of life for a dollar because they have no respect for others. They are so pervasive the only way to resist them is for people of color to band together. To pretend white supremacist don't exist or that they will magically disappear is to ensure their continued control over our lives. Working together to overcome an evil is not anti-American, it's just common sense.","post_message":"Fighting White Supremacists: Don't Forget, We Are In It Together!  @webpagelink"},{"comment_id":"10154243512856770","commenter_b":"We will send you more Muslims , you can send us the anti Muslims.","commenter_a":"I openly protest morons who throw homosexuals off buildings and burn people alive who don't bow before their god (may he eat pork)","post_message":"Police in Toronto, Ontario might charge a group of anti-Muslim protesters for violating hate crime laws."},{"comment_id":"557366464412130","commenter_b":"She's anti-woman.","commenter_a":"and, an eyesore.","post_message":"Carly Fiorina is gaining in the polls because Trump gave her his attention in a tweet. Now Republicans are claiming she supports women's rights."},{"comment_id":"909362045826715","commenter_b":"NO!","commenter_a":"You idiot libs! Most of us conservatives carry a gun everywhere we go. You just dont know it. And if a criminal tries to go on a killing spree, we will save your dumb a$$es too.","post_message":"Should guns be allowed in parks and playgrounds?   What do you think? Sound off below!"}]
