[{"comment_id":"1863343793909726","commenter_b":"I hate that woman wit a passion if whoopi was there she will shut her off","commenter_a":"Omarosa is phony as hell. She does not represent Black Americans at all!!! I wish WHOOPI was on set today she would've put her in her place ! Poor joy didn't push hard enough. I don't like Omarosa","post_message":"It wasn't pretty."},{"comment_id":"10152957985436316","commenter_b":"Ignorant bitch. Talk about crime? I haven't heard of an illegal immigrant shooting up an elementary school or a movie theater. Americans are using drugs that's why drugs are trafficked here. Can you read a sociology book and gain better insight into social issues than base your opinions on ignorance?","commenter_a":"and all the anchor babies..they pop out 5 or 6 kids and they have welfare for life, the low life dads beg to stay because his child is \"american citizen\" .. so 1 breeder, 6 kids, 6 dads> IS 14 ILLEGALS ON WELFARE< running drugs, chop shops, gangs...all of this in a 1 bedroom apt in a apt complex that has 500 units... Now much money is being sent down a rat hole????","post_message":"The number of illegal aliens residing and working in the United States now outnumbers Americans who are unemployed and looking for a job, an issue that is certain to be a priority for tens of millions of voters in the 2016 presidential election: @webpagelink"},{"comment_id":"575480735957321","commenter_b":"I'd rather listen to a milk cow","commenter_a":"Go 3rd Party!","post_message":"Watch the final night Republican Convention live with NPR and PBS NewsHour. Donald Trump accepts the party’s nomination tonight and makes his case to be the nation’s next president. Scheduled speakers include: Brock Mealer, Marsha Blackburn, Mary Fallin, Lisa Shin, Reince Priebus, Peter Thiel, Tom Barrack, Ivanka Trump and Donald Trump."},{"comment_id":"10153723426423487","commenter_b":"What the fuck ever. My answer is clear, even if backwards. Bikes should follow the rules, however it is phrased.....jackass.","commenter_a":"Of course they should follow the traffic laws. A bike has been my main mode of transportation for most of my 61 years. We cyclists demand drivers follow every rule and yet many of my fellow cyclists think the rules do not apply to them. They risk their lives, cause wrecks, etc. with careless behavior.","post_message":"What's safest for cyclists and pedestrians? (CityLab)"},{"comment_id":"480329612157619","commenter_b":"deport all illegals","commenter_a":"and I went through 2 WTC bombings 5 months pregnant in the first one.. 2 back surgeries had and foot surgeries in the second and I could not get a dime to support myself and my daughter other than the Social Security Disability I worked for for 23 years ...in fact was told \"I made too much money to get any help\" Really????","post_message":"This illegal immigrant has been collecting welfare for 20 years... This is outrageous. Illegals on welfare should be kicked off and deported immediately. Should we deport all illegals collecting welfare?"},{"comment_id":"1353532451354276","commenter_b":"Said the blond headed, blue-eyed white woman.","commenter_a":"I am so sorry if this happens, your fear, only because your skin is darker than mine. But I kinda think all of this has happened to white skinned people as well. If we could all walk argh nd inside out we would see assholes right up and recognise good when we see it. Its not about race for everyone. Some of us see us all as people!!!","post_message":"This man shares his haunting testimony: He too is afraid of being killed by the police. (via KevOnStage)"},{"comment_id":"1724147734520564","commenter_b":"First Ladies always ware pearls. Hers are a double strand!","commenter_a":"She's no lady she is only 1 step above hillary Clinton in being the most pathetic excuse for a first lady","post_message":"Has Michelle Obama been a good First Lady?"}]
