[{"comment_id":"985729194809437","commenter_b":"Having the private server in itself is breaking the law Please get her out of the nomination cycle now","commenter_a":"Coverup","post_message":"Why did the State Department do this?"},{"comment_id":"10153530234038854","commenter_b":"We knew this was coming, all part of the homosexual agenda.","commenter_a":"By Law, Churches are automatically Tax Exempt, so there's no need for them to have an IRS 501C-3 status. If you don't believe it, I suggest you research it.","post_message":"This is going to get ugly… Obama’s Lawyer To Supreme Court: Religious Institutions May Lose Their Tax-Exempt Status If They Don’t Back Gay Marriage…"},{"comment_id":"10152641860006135","commenter_b":"What a joke","commenter_a":"How do you find out if you have fines?","post_message":"Just a HEADS-UP If you've skipped out on jury duty in Michigan in the last 12 months...  READ: @webpagelink  You have until the end of the business day today to request a new jury service date to avoid fines."},{"comment_id":"779978185438256","commenter_b":"And she is responsible for 100s of men being killed.","commenter_a":"In the Commander In Chief Debate tonight, wondered if anyone noticed that Hillary was wearing an earpiece. See picture here at @webpagelink Only thing that makes sense was that she was being fed the answers. That's why she sounded so scripted and robotic. Donald Trump was Presidential tonight. Hillary's 'in you face' lies to the Veteran who asked the question about National Security cannot inspire confidence in the American public. How can anyone still support her? Trump is the only choice! America First is the plan!","post_message":"THANK YOU to our fantastic veterans. The reviews and polls from almost everyone of my Commander-in-Chief presentation were great! In addition, THANK YOU for hosting us this evening, Intrepid Sea, Air & Space Museum! -DJT"},{"comment_id":"10153063204299726","commenter_b":"What a mouth full of shit that is!","commenter_a":"They promised to kill all in the Us if you will recall as well as Israel called us the great satan","post_message":"WATCH: Obama says Islam will cause Iran not to pursue nuclear weapons!"},{"comment_id":"1678077472472997","commenter_b":"Fuck all Muslims and let them go to hell!!!!!","commenter_a":"So sad. It's bad enough that the boy lost his life, but for the Father of the murderer to defame his character is just too much.","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack  This is tragic. His died with honor, let's send our prayers for his family.  Can we get 100,000 'LIKES' for him and his family?"},{"comment_id":"10154323044371545","commenter_b":"I don't need to march with a bunch of femanazis' I'm fully aware of my rights as a woman and my freedoms as a US citizen - no one has tried to take any of those away from me except the last administration so I'm good MAGA","commenter_a":"I wonder how many women signed up to go to these marches thinking that they were supposed to be empowering women when it turned out just to be an anti Trump rally- so I would say that at least half of the women may be there for totally different reasons - which means the people who organized these marches were completely disingenuous","post_message":"Any DFW women make the trip to Washington for the #WomensMarch? If you did, Hannah Davis wants to hear from you. Share your pictures here."}]
