[{"comment_id":"10156823156490594","commenter_b":"I don't want my great-granddaughters going into to bathrooms where males are also present. I'm not talking about transgender; there are sick people that will use that as an excuse to be were they shouldn't","commenter_a":"I never really shopped at Target's, I will now. I'm glad your taking a stand for the transgender population. So sad that people's lack of knowledge or fear make them judge.","post_message":"'Inclusivity is a core belief at Target,' said the retailer in a statement. 'It's something we celebrate.'"},{"comment_id":"1227335790638732","commenter_b":"You are a Pussy, bitch !!!","commenter_a":"Lmaooooo Go Ana....I LOVE IT 😂","post_message":"EPIC! Oh, and the woman in red is a REPUBLICAN! This happened tonight on CNN.  Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"10153047231286615","commenter_b":"Dogs are innocent. At least a human can report what happens to them and make the choice who they stay with","commenter_a":"But you are all ok with James Harrison? He beat his girlfriend. Vick never harmed A HUMAN BEING.","post_message":"DEVELOPING: Quarterback Michael Vick is on his way to #Pittsburgh to meet with the Steelers, according to ESPN's Adam Schefter..."},{"comment_id":"10155104320669614","commenter_b":"Liliana Sanchez ghetto AF.","commenter_a":"Losers","post_message":"Officers recovered a large amount of stolen mail, checks, W-2's, government identification cards, and narcotics after arresting the pair, authorities say.   Police estimate there are more than 50 victims in San Bernardino and Riverside counties."},{"comment_id":"10154100013603598","commenter_b":"I have no more words to write about this witch","commenter_a":"Add murdering human life to the list of HER immorality!","post_message":"Hillary Clinton: An Unborn Child Just Hours Before Delivery Has No Constitutional Rights"},{"comment_id":"1258430004197187","commenter_b":"It will never happen. Hillary will win and that will be the end of America kiss your freedom goodbye and welcome Hillary Clintons new and improved America you fools!!!!!","commenter_a":"The regular polls are rigged. This is what's actually real. We need to find a way to get polls of our own. @webpagelink","post_message":"Despite getting barely any attention from traditional media, our numbers have been surging on social media.   See what the buzz is about at tonight's #GreenTownHall!"},{"comment_id":"10152967093391051","commenter_b":"Your a heartless bitch","commenter_a":"Waaahhh","post_message":"Since school officials refuse to do anything about her bullies, this teen is now turning for help elsewhere."}]
