[{"comment_id":"163756660695086","commenter_b":"She's unbelievable. I swear she better not get into office. WAKE UP AMERICA!!!","commenter_a":"I think Hillary is channeling Marie Antoinette.","post_message":"Hillary Clinton just landed her plane in Nantucket...   Almost immediately after people saw her, this HUGE problem went viral..."},{"comment_id":"10154862137916756","commenter_b":"Yes, It's sad to see our Democracy gone to Totalitarianism. We're ruled by the subversive evil Corperations who War on terror was a scam. More honestly put it was WAR to produce terrorist so Corperations could exploit, kill and take down America itself by stripping freedoms as the Patriot act does and by spending the majority of monies on WAR. Now the Red Scare if being probigated by the Democreeps","commenter_a":"I'm stressed about the ugliness that this election has revealed in my fellow Americans. It is disgusting and frightening.","post_message":"Are you?"},{"comment_id":"1174478745905487","commenter_b":"The hormonal teenager that's checking people's bags is supposed to make us feel secure?","commenter_a":"I would rather be inconvenienced than shot why I watched a movie","post_message":"The chain said the procedure would inconvenience guests but provide better security."},{"comment_id":"1021502754552734","commenter_b":"Sammy Rose Dunaj Emmett Lally","commenter_a":"Serge Ermakov","post_message":"Save $26 on an Amazon.com Prime subscription."},{"comment_id":"10153830910205695","commenter_b":"Unfortunately he's correct. Totes second ship found some things in the ocean that they believe belong to el faro","commenter_a":"It's obviously on the bottom of the ocean.","post_message":"Loved ones aren't giving up hope, despite a life ring being found."},{"comment_id":"10153672451109062","commenter_b":"He's a lady","commenter_a":"Michael Keaton was robbed!","post_message":"BEST ACTOR goes to Eddie Redmayne for \"The Theory of Everything.\" More: @webpagelink  Photo: Dan MacMedan, USA Today"},{"comment_id":"10153109103456636","commenter_b":"Shut our doors and keep them out","commenter_a":"Am I the only one disgusted by negative comments here? there is a big difference between migrants and refugees? if that was your child? seriously? and the fact that 99% of migrants pay a hell of a lot into society? that doesn't count? unnaceptable - we need to be helping now.","post_message":"'David Cameron’s muted response to the crisis is disgraceful"}]
