[{"comment_id":"1603692309937131","commenter_b":"Hillary got 2 million more votes. Americans REJECTED TRUMP","commenter_a":"\"Why are you really doing this?\" Despite the many rumors swirling on the Internet, the Stein/Baraka campaign genuinely believes in the power of grassroots democracy. Independently funded candidates like @username cannot stand a chance if our electoral system is rigged in favor of establishment, corporate-funded candidates. The evidence so far shows it is easy to hack many voting machines being used in elections. Aside from conducting a recount, we advocate Ranked Choice Voting and federal campaign financing, just a few solutions put forth by the Green Party in it's six-point plan for grassroots democracy. The Green Party Platform, which calls for \"publicly-owned, open source voting equipment and deploy it across the nation to ensure high national standards, performance, transparency and accountability; use verifiable paper ballots; and institute mandatory automatic random precinct recounts to ensure a high level of accuracy in election results.\" jill2016.com/recountfaq","post_message":"I am joined tonight with Kevin Ronca, the director and creator of the incredible docuseries, \"The Revolution Televised.\" Although only 13 minutes in length, each of these episodes get to the heart of the matter: exposing the corruption that has been taking place in our sick political system! I would like to invite you to join the conversation as we will be releasing the 4th episode in this series right now, followed by a live Q&A session between our viewers, me and Kevin about this extraordinary series and where he goes from here. I'm sure you all have heard about the dramatic developments at Standing Rock, including the announcement today by the Army Corps of Engineers (see below). Kevin is willing to go there with his team to bear witness to this very important struggle. --- Press Release from Army Corps of Engineers 11/25/16: @webpagelink -- Here are some of ..."},{"comment_id":"517177675137728","commenter_b":"here we go lone rider, is he picking up speed","commenter_a":"Looks like he is near Morongo Casino soon.","post_message":"Police pursued a stolen big rig near Riverside, California this afternoon."},{"comment_id":"10154660299872501","commenter_b":"She can work anywhere in these United States.","commenter_a":"So she can be a lawyer not a judge cool.","post_message":"We reached out to Angela Stokes today to ask about her future legal plans. If she responds, we'll add her comments to the story."},{"comment_id":"1254986011246599","commenter_b":"@username, Hillary was pandering the liberal black voter.......sickening to say the least! Hang the bitch till dead.","commenter_a":"I sense a lot of vigilantes are going to start taking matters into their own hands, since Obama, of course refuses to acknowledge blacks are the problem.","post_message":"This is the nightmare we all envision when thinking about being stuck in a riot. What would you do in the same situation..."},{"comment_id":"683458785174693","commenter_b":"No Whoopie it's the exact OPPOSITE!!!! We did our homework on Corrupt Lying Criminal Killary Clinton and her open border policies and that's exactly why we voted TRUMP!!! Dumbass Racist!","commenter_a":"You didn't do yours.","post_message":"Whoopi Goldberg just scolded millions of Americans on The View. Apparently if you voted for Trump, it's because you \"didn't do your homework\" on Hillary."},{"comment_id":"10153121038682212","commenter_b":"Ugh. You're a woman. Why are you being so dense?","commenter_a":"Isn't there a disclaimer that states not all birth control is always 100% effective??","post_message":"More than 100 women are suing a drug company for a birth control packaging error they say resulted in unplanned pregnancies; three of whom are from Oklahoma. #News9 #CBSNews"},{"comment_id":"10154249804566509","commenter_b":"And they say white men can't jump.","commenter_a":"He just proved obama has crappy security. There have been tons of jumpers since obama became president. You would think they would have increased security by now.","post_message":"This photo shows the White House fence jumper in the middle of his attempt to go over the barrier on #Thanksgiving. @webpagelink"}]
