[{"comment_id":"10153613317153132","commenter_b":"Lovely woman","commenter_a":"magnifique Augrey","post_message":"\"I didn't know she was a movie star. She always looked at my father like he was the center of attention.\""},{"comment_id":"10153497244196051","commenter_b":"You are such a bitch. You need put to death just like you did your baby. You bitch","commenter_a":"Glad she didn't get off like Casey Anthony","post_message":"This woman didn't want her ex-boyfriend dating other women. Her 2-year-old daughter ended up paying the price."},{"comment_id":"1145540435508072","commenter_b":"No job , 6 kids , no husband . Stop !","commenter_a":"Waited in line for six hours if you would've been working kids would've ate","post_message":"Entitlement Mentality: Welfare Recipients React to Food Stamps Being Cancelled. This shows everything wrong with the entitlement mentality."},{"comment_id":"1773311049564873","commenter_b":"Jerk","commenter_a":"Mitt Romney should be quiet. I worked very hard for him, was sick when he lost to Obama mostly because he would not fight back. He broke a lot of hearts the way he ran and loss. He has absolutely no RIGHT to open his mouth now. I am angry at him.","post_message":"Mitt Romney wants Donald Trump as FAR from the White House as possible... but nobody thought he would go this far to accomplish it. Is Mitt Romney irrelevant?"},{"comment_id":"596524653885918","commenter_b":"Hell no she's a racist and a bigot . Her husband did our country more harm than good. No way would I ever vote her into office.","commenter_a":"no way in Hell","post_message":"Would you vote for Michelle Obama if she ran for president one day?"},{"comment_id":"10154746403950399","commenter_b":"Hope CNN is the first nail in her coffin.her propaganda is responsible for bringing a narcissistic sociopath to power.she knew what he was and put herself and financial gain before our country.she is a traitor.","commenter_a":"Excellent move CNN. The people deserve better going forward. She did an excellent job selling campaign flimflam, but her job is done now, she does not have the skills for the White House world stage.","post_message":"\"We passed. Those are the facts.\""},{"comment_id":"10153380669974135","commenter_b":"you again? really , go away you angry negative bitter woman!","commenter_a":"Why don't you open you wallet and pay NJ back for the money you stole from them for your bridegate \"investigation\" and your campaign expenses. Oh, don't forget $82,000 for hot dogs and beer at the ball games.","post_message":"I opened my heart to you"}]
