[{"comment_id":"10153438111440496","commenter_b":"STFU","commenter_a":"Always 3 sides to a story don't be quick to judge U ppl have no idea how students behave themselves at school unless u worked at schools Unbelievable not saying what that officer did was appropriate I haven't watched the video nor do I choose to Let them finish their investigation u stay out I choose to do the same","post_message":"Video shows a 6th-grade girl at a Texas middle school being grabbed and dropped by a school resource officer. The officer is now on leave."},{"comment_id":"1069739979818471","commenter_b":"I thought she'd be gone by now! How the F can they relect that bitch!","commenter_a":"This lady can hide her own Easter Eggs...","post_message":"Folks, Pelosi is at it again..."},{"comment_id":"1272631619499754","commenter_b":"There are hundreds of billions of untaxed dollars, probably trillions going to Mexico every year through the boarder in drug profits. An effective wall and boarder security will prevent tons and tons of drugs from coming in, as a result people wont be able to buy as many drugs so the money they would normally be using to buy drugs will be spent on other things that will help the economy. So not only will it prevent drugs from coming in but it will prevent billions from going out to Mexico and that money instead will be cycled through the US economy and taxed every step in the cycle. This wall will also help clean up the drug abuse problem our society has and save many lives to overdose and drug related violence. Not to mention illegal immigrants not paying taxes but also sending their extra money back to Mexico. ...","commenter_a":"LOL..heck he doeesn't even know what he is talking about how can he keep up with himself...just hilarious to watch each day what has changed. Ya know, I think his hairdresser is leaving the bleach on too long and it is affecting his brain..just a thought.","post_message":"As the Trump campaign tries to pitch minority voters, Donald J. Trump's  position on immigration seems to keep changing."},{"comment_id":"1107746175912227","commenter_b":"@username -- The women lied under oath and colluded. I'd call that misandry, not misogyny.","commenter_a":"And the feminist backlash begins in 3...2...1","post_message":"Former CBC host Jian Ghomeshi has been found not guilty of sexual assault and choking.   Full story: @webpagelink  (Photo: Chris Young/Canadian Press)"},{"comment_id":"10154322735965963","commenter_b":"Deport all illegals","commenter_a":"This is bull nothing but bull! I have family that works and pay taxes and just to renew the green card 💳 cost a lot of money","post_message":"LIVE: Minneapolis police are monitoring the Caravan of Love protest that started at City Hall and is heading toward the U of M. The estimated crowd of 2,000 is marching in support of immigrants and refugees."},{"comment_id":"10154633798866729","commenter_b":"Jamie i am totally sober at all times Jamie…..maybe you are on drugs for believing she is not an Evil Satanic Whore who laughs at Raped 12 year old Girls when she knowingly defends their guilty Rapist ?","commenter_a":"Many in the FBI still do love this country very much and are NOT blind followers of Obama and his Anti American Commie nonsense….it would be a good tactical move to wait till Hillary is nominated as the \"Head Liberal Witch\" before they Arrest her and burn her at the Stake ( like we are all praying) happens on live TV so we can rub one out while watching her salty tears run down her Reptillian Alien face.","post_message":"Finally, the end may be near..."},{"comment_id":"10154443469472293","commenter_b":"Lady you are what makes liberals look stupid.","commenter_a":"Her rapist will be the next GOP candidate for president.","post_message":"Police were called to his $5 million mansion after a 21-year-old was allegedly assaulted at his annual Halloween gathering."}]
