[{"comment_id":"10153148221999087","commenter_b":"Close the Border why are they allowed to get all this free stuff, when we have people in this country who need help??","commenter_a":"get it back TRUMP!!","post_message":"\"People are walking across the border right now, right in front of these great people we have,” Donald J. Trump said. “We have wonderful Border Patrol people. They can do their job, but they’re not allowed to do the job.”"},{"comment_id":"10153633238805575","commenter_b":"Get those monsters outta here!","commenter_a":"Oh who did not see this coming? Remember in Greece all the guns that were found? This is not refugees this is trying to take over send them back!!!","post_message":"This is frightening."},{"comment_id":"818332488251250","commenter_b":"American exceptionalism...we can be batshit crazy and justify it with religious idiocy. We're special :)","commenter_a":"Have we gone completely nuts or completely American/Christian Taliban?","post_message":"Six states currently permit pharmacists to refuse prescribed contraception medication to a woman based on personal and/or religious beliefs."},{"comment_id":"10153000556273855","commenter_b":"You're the most ignorant bitch here so far. Congratulations on stepping back two centuries.","commenter_a":"If a Christtian owned biz loses business for serving gays, it has the right to say, hey guys, dont take it personal, i need to make a living...go elsewhere. WTF U MEAN I CANNOT REFUSE SERVICE? THE ONLY PEOPLE I CANNOT REFUSE SERVICE IS TO BLACKS DUE TO SLAVERY AND BLSCKS BEING OUSTED AS AMERICANS SIMPLY BECAUSE OF SKIN color. Sexual stuff...can be a challenge to many. Leave people alone. Ask them to leave you alone. By the way - imFOR gay union, but not in a church.","post_message":"First Yelp, now Angie's List!"},{"comment_id":"1615889428471180","commenter_b":"That'll put some die in her ass","commenter_a":"Oh,stfu. Take your crybaby ass to your favorite proctologylist and get a soothing ointment to rub on your buthurt","post_message":"This young woman was deeply offended by a sweater Target is selling. Should Target keep selling it anyway?"},{"comment_id":"1737362022990205","commenter_b":"#fingersinthebootyassbitch","commenter_a":"He looks miserable. ..","post_message":"Kim Kardashian West is reportedly 'annoyed at him for refusing to rest' following 'psychotic break' (Via Daily Mail Celebrity)"},{"comment_id":"756120254539294","commenter_b":"Dont \"let\" her leave America, MAKE IT LEAVE AMERICA! !!","commenter_a":"I thought Rosie was leaving?","post_message":"It's no secret that Rosie O'Donnell and Donald J. Trump don't like each other very much. But what she just did took things WAY too far..."}]
