[{"comment_id":"10154475429571336","commenter_b":"One could only hope. But she seems to be too slimy to catch!","commenter_a":"Wikileaks founder, Julian Assange, has said that Wikileaks has obtained information that, when released soon, will guarantee a Hillary Clinton indictment. During a recent interview with ITV, Assange said his next release will “provide enough evidence” to see Hillary arrested.","post_message":"At the Veterans of Foreign Wars VFW convention, Donald J. Trump slammed Democrats for not mentioning ISIS during their DNC speeches. @webpagelink"},{"comment_id":"948553515267521","commenter_b":"Hillary is a big fat liar and she will never be president.","commenter_a":"Lol","post_message":"This team is the only thing left that can stop Donald Trump.  We’ve got to leave it all on the field here, and we need contributions from Facebook to reach our goal of 100,000 by midnight. Will you chip in? hrc.io/2d4999O"},{"comment_id":"10157109427360354","commenter_b":"but.. its ok if your a doctor and have permission?","commenter_a":"She looks evil!","post_message":"A woman from Boulder, Colorado, was sentenced to 100 years in prison for attempted murder and unlawful termination of a pregnancy after attacking a stranger and cutting her baby out of her womb."},{"comment_id":"579741315536254","commenter_b":"How is she a bigot? Because you disagree with her. She is speaking the truth. I don't like her method. She be out in front of the building doing this, not in the store.","commenter_a":"Biggest bigot I've seen so far. Who died and made her thee Almighty?","post_message":"The woman, a mother of 12, screams throughout the video and says that she wouldn't spend a penny at Target because of what she calls their 'wicked practice.'"},{"comment_id":"10154259987641955","commenter_b":"Lilla Williams","commenter_a":"Good lord. I was watching a news person on Fox this morning lifting off in a balloon and thought, what if it caught on fire. Saw this later and it's so sad","post_message":"HORROR: HOT AIR BALLOON CRASHES IN TX...  16 DEAD..."},{"comment_id":"469085879883119","commenter_b":"Except for people who saw it flying over their state capital day after day, a flag that also flew with burning crosses and nooses around the necks of limp bodies. Sick of fucking people saying this is a diversion. First of all, it's pretty damn serious to A LOT of people. Secondly, you act as if these news stories would be discussed anyway. Anyone stupid enough to think real shit is covered by the MSM is the true 'idiot sheep.' Grow the fuck up, we have a nearly unlimited access to all sorts of information. If this 'diverted' you, you were never paying attention.","commenter_a":"I read some of the commits and have to wonder if red necks get the discovery channel. If all of mankind's dna began in Africa. What does that make all white people on earth? Some different people but it is the rays from the sun that could be a problem.","post_message":"While the media turned a tragedy into a debate over a flag, here are 10 major stories you might have missed"},{"comment_id":"1815699362041993","commenter_b":"Can't stand that wretched woman","commenter_a":"I was gonna click for sound but then I saw a clip of Tomi Lahren pop up and thank god I dodged that bullet #iamsaved #toliveanotherday","post_message":"Republicans think protesters should just get over it and accept the results of the election just like they did when Obama won in 2008 and 2012  Oh wait..."}]
