[{"comment_id":"10153341236279170","commenter_b":"This guy needs to stay in London. I do not exactly agree with what Pam Geller did, but she was well within her rights. It's just like when the muslims were building their mosque down the street from the 9/11 Memorial. They were within their rights, even though that definitely was the wrong thing and wrong place to put it. Islam has no tolerance and so America should stop being tolerant to Islam.","commenter_a":"So according to the traitor liberals it is fine to offend Jesus Christ but it is wrong to offend Mohammed , only in the bs traitor mind of the socialists this makes sense.","post_message":"If you're one of the people saying we need to rein in the First Amendment so we don't offend Islamists, just watch this VIDEO and know that THIS is what you're trying to coddle."},{"comment_id":"1147833905269371","commenter_b":"No, thickhead, enough of YOU is enough!!","commenter_a":"@username if the guns are taken away from good citizens they will be more killing than you every seen before my my where is your common sence!!!!!","post_message":"@webpagelink"},{"comment_id":"10153945489322522","commenter_b":"And more illegal aliens in states Trump won","commenter_a":"If the electoral College didn't exist. There would be no need to campaign outside of New York and California. The election is over. The results are in. Clinton conceded. Trump won. Move on. If America really wanted to elect Clinton, perhaps more Americans should have voted!","post_message":"It's official:"},{"comment_id":"10153542667459087","commenter_b":"Liberal democrats won't be happy until every city in this country looks like this..","commenter_a":"Trump could tell a Muslims being shot with bullets dipped in pigs blood story and his support will continue to grow.","post_message":"“He took 50 bullets and he dipped them in pig’s blood,” Donald J. Trump said. “And he had his men load his rifles and he lined up the fifty people, and they shot 49 of those people. And the 50th person, he said, ‘You go back to your people and you tell them what happened.’ And for 25 years there wasn’t a problem.” WATCH:"},{"comment_id":"10154449321726729","commenter_b":"Fuck u bitch.. I'm an Obama supporter and wouldn't say no shit.like.that.. FUCK U!","commenter_a":"You know what's amazing about Trump's supporters? They are so cult-like that if Donald Trump raped a little girl, his supporters would insist that's okay. They would say that she was probably asking for it. No true conservative supports Trump.","post_message":"BREAKING: The decision desk has now called the winner of Kansas..."},{"comment_id":"10153656233196756","commenter_b":"Kerry Hayes Bryan Hayes James Cadillac Cardarelli told ya","commenter_a":"What?!... Well, I like \"Las Mananitas\" better anyway","post_message":"Ever wonder why you so rarely hear \"Happy Birthday to You\" on TV or the big screen? Turns out that, while it may be one of the most recognized songs in the English language, its copyright is also owned by a music publisher. So, if you're going to sing those famous strains on screen, you'd better be prepared to fork over some cash."},{"comment_id":"10153368767146694","commenter_b":"Those were not feminists, those were trolls.","commenter_a":"Meh to all the feminist crying. If you hate her characterization, you don't have to force the entire female gender into the issue. Also, the action figure industry is asinine. See how it screwed over Green Lantern TAS and Young Justice.","post_message":"Let's talk about The Avengers' Black Widow problem."}]
