[{"comment_id":"725368590987052","commenter_b":"That bitch should get shot","commenter_a":"Leave blondie","post_message":"Share if you agree."},{"comment_id":"10154713029439411","commenter_b":"Good on her. If only she had a shot gun or military rifle she may have got the others too.","commenter_a":"Looks good on him and them. These three losers garner no sympathy from me. Karma has been served.","post_message":"They picked the wrong house"},{"comment_id":"10154764685995470","commenter_b":"Walls do work... ask any prisoner. They keep the bad guy's in and on the border they will keep the bad guy's out... and pregnant mothers wanting a free birth provided by an American hospital. The border invasion has to stop and Trump will stop it.. The wall is a cheap way to get the job done.","commenter_a":"I hope all the geniuses that voted for these clowns are ready to part with their hard earned money...","post_message":"House Speaker Paul Ryan says Congress will front the money for President Donald Trump's newly announced wall on the U.S.-Mexico border."},{"comment_id":"10153519316691037","commenter_b":"Disney isn't on my list of good companies either. They are firing Americans and hiring ILLEGALS. Really?","commenter_a":"Whatever happened to statute of limitations? If he did this, I certainly don't condone it, but this was 40 years ago.","post_message":"Disney's decision comes after court documents from 2005 were unsealed"},{"comment_id":"10155010955881350","commenter_b":"I need that hippo.","commenter_a":"Sydney Elise Harville","post_message":"WATCH: Make your Monday better with this hippo waddle. @webpagelink"},{"comment_id":"960647347306835","commenter_b":"I can't find what I'm looking for now.","commenter_a":"I try not to think of them at all...","post_message":"What do you think of these massive new changes coming to your local Target store?"},{"comment_id":"10156578303710354","commenter_b":"Bill's actions are not the real issue ... how Hillary victimized Bill's victims is the real issue. Bill abused women, Hillary declared war on the women Bill abused.","commenter_a":"Hillary knew about bill and his abuse","post_message":"Silence, peasant!"}]
