[{"comment_id":"381679348687026","commenter_b":"Yeah, and look what we have now. A man and woman who think they are king and queen and are destroying our country. Stop him.","commenter_a":"George Bush was a really great President and Laura Bush so graceful and elegant!","post_message":"We love George W. Bush...such a true class humour!"},{"comment_id":"918671201578514","commenter_b":"Death should be her punishment.if not Deport her rotten ass . We don't want her here.evil.","commenter_a":"Behead the Bitch...","post_message":"Muslim Nanny Who Beheaded 4 Year Old Girl Will Not Face Murder Trial Because... This is the world we are living in today people. What do you think her punishment should be?"},{"comment_id":"10152872619506336","commenter_b":"Real simple solution to all of this. Remove these people from all Western Countries. And NEVER allow them in ever again. End of all problems.","commenter_a":"Had her and let her walk right past them, idiots!","post_message":"French authorities are conducting a countrywide manhunt for 26-year-old Hayat Boumeddiene, a suspect in Thursday's murder of a French policewoman. Police said Boumeddiene should be considered dangerous and potentially armed."},{"comment_id":"1798905343724193","commenter_b":"\"She doesn't want guns, take their let's see what happens to her,\" Trump said. \"Take their guns away, okay? It'll be very dangerous.\"","commenter_a":"How can this extremely ignorant, sorry excuse for a human, still be in office? and in Texas???","post_message":"What say you, Texas?"},{"comment_id":"10156026923975354","commenter_b":"She makes me sick .","commenter_a":"Sadly, the low information voters, which seems like 70% of the populace today, buys her act hook, line and sinker...Then again, if she is so naive about servers and cell phones, who on earth wants this dimwit in the White House (again)...","post_message":"A reporter asked if she had attempted to “wipe” her server. She replied, “What, like, with a cloth or something?” And she didn't stop there..."},{"comment_id":"624073524449893","commenter_b":"Leave Trump alone, We love him","commenter_a":"I love Fox News","post_message":"A Fox News reporter just left for this surprising reason. No matter we stand behind Fox News. Do you support Fox News?"},{"comment_id":"10153000267696130","commenter_b":"Fire her sorry hateful ass!","commenter_a":"She was only suspended for a week WITH PAY. Hopefully ESPN decides to fire her after that week. You can fix bad teeth and weight gain... You can't fix being that ugly on the inside.","post_message":"How can people say things like this?"}]
