[{"comment_id":"10153328047582217","commenter_b":"I think it was just you and me. I don't even remember the boys being there?? I can't really remember the play either, just waiting at the stage door after!! I think your right about Minnie driver too.","commenter_a":"@username :-)","post_message":"🎶 So no one told you life was gonna be this way...🎶 😃"},{"comment_id":"911808665590508","commenter_b":"Go home","commenter_a":"Ok send these people back where they came from.....F them!","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays  Lets get 3000 SHARES if we should deport them!"},{"comment_id":"10153465913933145","commenter_b":"Your mom took the time to raise you right....take the time to raise your children right !","commenter_a":"This kid didn't have to go thru this were was the mama, I hope the kid has been taken out of the home? Why did the grandmother didn't do anything for the girls. We live in a crazy world?","post_message":"A father is facing child abuse and drug charges after police say he beat his daughter because she didn't get enough candy while trick-or-treating."},{"comment_id":"10154538085533812","commenter_b":"\"You gotta take them out\"...... for dinner and a movie. Because Hillary, you see, she's a criminal. All my lawyer friends understand this. And we're gonna build that wall, believe it.","commenter_a":"He is such an idiot","post_message":"Donald J. Trump said that he would be open to using NATO forces to fight ISIS despite blasting the alliance in the past as \"obsolete.\""},{"comment_id":"841359735901368","commenter_b":"He just \"forgets\" that we are in the 21st century, not in the Middle Age. We've learned from the past and they don't.","commenter_a":"We are all aware that this President is ill informed and has had trouble when it comes to Historical accounts... Whether or not you believe the Crusades were meant to stop Islamic atrocities or to spread Christianity, that should not be the focus here. Suggestion: Truly read the differences between Christianity and the Islamic faiths and decide which spreads peace within its holy scriptures.... An interesting example below siting scripture from both religions (read in its entirety). ...Especially, the Ellen Mems comparison. This is a public FB debate between a Muslim and a Christian: Quoting \" Christianity & Islam A debate... Gamal Abouomar Who is Prophet Muhammad, may peace and blessings be upon him? He is the one who defended the rights of all humanity 1400 years ago. He defended men's, women's and children rights He commanded and fostered the love between relatives and neighbors He established a coexistence relationship ...","post_message":"Barack Obama's prayer breakfast comments about Christianity are causing some to perk up.   “Unless we get on our high horse and think this is unique to some other place, remember that during the Crusades and the Inquisition, people committed terrible deeds in the name of Christ.\""},{"comment_id":"1742230942710926","commenter_b":"Hillary can't speak without a Telepropter... She has no clue what tk say. Her speech pattern, body language, facial expression..etc. fake","commenter_a":"There is such a HUGE difference in the way Hillary speaks up to Americans and the way Trump talks down to Americans!!!! I am excited to see her win this!!","post_message":"History made. hrc.io/1YesHYS"},{"comment_id":"1619982001628404","commenter_b":"HILLARY WILL BRING MORE OF THESE TERRORISTS INTO THE UNITED STATES !!!!! SHE MUST BE STOPPED !!","commenter_a":"Who would predict that...lol...: @webpagelink","post_message":"Hillary Clinton's weakness while she was Secretary of State, has emboldened terrorists all over the world to attack the U.S., even on our own soil. They are hoping and praying that Hillary Clinton becomes President - so that they can continue their savagery and murder."}]
