[{"comment_id":"854160414621300","commenter_b":"That's because they don't know it, and they think they're smarter and know more than anyone else. Truth is, they're afraid of Gowdy!","commenter_a":"GO GET EM!!! If anyone can do it you can.Luv your passion and fire!!!The dems DON'T think anyone knows the Constitution...","post_message":"\"I'll make you this promise...\""},{"comment_id":"10153614987044199","commenter_b":"Disagree. I think she's a hero. Get this psycho off the road.","commenter_a":"I just watched the whole video and I call bs on the mom. She had 4 opportunities to take a turn and drive away from this woman. If you have your kid in your car it's not your time to stand your ground. Let her drive on, pull over let them go on their way, turn down another road go another way home. Don't keep following them especially when they keep randomly braking.","post_message":"UPDATE:"},{"comment_id":"10154144112782699","commenter_b":"too bad this policemans life has been changed because of some mouthy teenagers","commenter_a":"With the chief of police not supporting him...most definitely. He can't go it alone.","post_message":"\"Eric Casebolt of the McKinney, Texas Police Department has quit his job, after a video of him pulling his firearm on rowdy teens went viral.\" @webpagelink Do you think the officer should have resigned?"},{"comment_id":"1020979627937496","commenter_b":"@username you shouldn't talk about yourself and Justin that way, asscrack. Ohhh she's not American so her music sucks? You and people like you are the reason this place sucks so much. God forbid you have to hear something that doesn't cater to you! Try really sacrificing for something worthwhile other than greedy politicians and your bank accounts and egos. Half of this country doesn't believe in the armed forces and government any more for good reason. Sacrifice my asshole, you don't know what sacrifice and hardship are until you've been homeless and still given things up for others. You know why people go into the armed services, most of them? They're too fucking lazy and/ or stupid to figure out something else on their own and sheep need the direction of wolves.","commenter_a":"If you've never heard the language before, don't insult and call it gibberish. You're the reason everyone thinks America is full of morons, thanks!","post_message":"People are getting really worked up over \"Work\" for the WRONG reason."},{"comment_id":"10153739079978812","commenter_b":"Waste of my energy girl..","commenter_a":"Hillary","post_message":"A new poll produced for ABC News/ Washington Post suggests negative views of Hillary Clinton have jumped since midsummer, while Donald Trump's popularity has grown more polarized along racial and ethnic lines: @webpagelink"},{"comment_id":"10152986192691491","commenter_b":"You're an odd little woman","commenter_a":"Malala is big drama queen , thousand of girl are raped and kill no body knows why malal","post_message":"Malala gunmen secretly set free in Pakistan @webpagelink"},{"comment_id":"1153743537971235","commenter_b":"She needs to be in prison!!!","commenter_a":"Really! I don't believe it! Her conscience must be getting to her. But I doubt it. Are they trying to make us feel sorry for her?","post_message":"Is this the real reason Hillary has so many \"issues\" when it comes to her health?"}]
