[{"comment_id":"1723943734489970","commenter_b":"Not only ridiculous, but stupid. What did Muslims have to do with the Holocaust? There far more people that are not offended by things that offend the Muslims. It is still our country, who make only one race happy all the time. Leave this alone and it may just prevent the horrible era from ever happening again. God please help us.","commenter_a":"WRONG!!!","post_message":"Schools Are Dropping The Holocaust From History Lessons To Avoid Offending Muslims. Things are getting ridiculous. Do you think this is wrong?"},{"comment_id":"1136992022978933","commenter_b":"Every Bill which shall have passed the House of Representatives and the Senate, shall, before it become a Law, be presented to the President of the United States; If he approve he shall sign it, but if not he shall return it, with his Objections to that House in which it shall have originated, who shall enter the Objections at large on their Journal, and proceed to reconsider it. If after such Reconsideration two thirds of that House shall agree to pass the Bill, it shall be sent, together with the Objections, to the other House, by which it shall likewise be reconsidered, and if approved by two thirds of that House, it shall become a Law. But in all such Cases the Votes of both Houses shall be determined by yeas and Nays, and the Names of the Persons voting for and against the Bill shall be entered on ...","commenter_a":"It'll fail in the Senate, and if not Obama will veto it","post_message":"Even Democrats voted for a 'pause' on the Syrian refugee program."},{"comment_id":"10157484651970725","commenter_b":"'@username PAM she is already DESTROYING THE COUNTRY !","commenter_a":"Go trump ! So, 96% of Hillary's charitable donations went to the Clinton Foundation! Yeah, 96%, they donated to themselves.","post_message":"Unbelievable! Thank you Erie, Pennsylvania. This is a MOVEMENT! I have no doubt that we are going to WIN -- and MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"10152870861243837","commenter_b":"You guys are brainwashed.","commenter_a":"Shows were priorities are. You guys should some great stories about our fallen heroes soldiers and what the community is doing to help but let's trade BBQ ideas. But that's Florida for ya. I'm sooo happy I moved to TX were we are actually having memorials ,recreations, events, to show the generations what our soldiers went thru. Houses here show proudly displayed flags. Remember the fallen for if it wasn't for their sacrifice we wouldn't be the land of free.","post_message":"Tips for people looking to fire up the grill on Memorial Day @webpagelink"},{"comment_id":"672161809583667","commenter_b":"This gal is a piece of .......","commenter_a":"Nothing quick about judging this one. It's been years in the coming","post_message":"I'm sorry....I'm not a fan."},{"comment_id":"1833633870187083","commenter_b":"Whatever her position, she chose it. I have researched her & she was looking for a meal ticket. Hopefully she knows now the real meaning of money. She has a mouth & 2 feet & she could walk. No matter if there is a prenup & what it says, this bastard is going down & in the end she would probably prevail.","commenter_a":"we have more important things to do with our words and our time--feel sorry for Melania and the Barron--or get our Country back--it's a choice-Can't do both---you people better choose------Bleeding Heart will only go to degree---We have a choice...to allow a Dictator or feel sorry for his family? Cut me a break!!","post_message":"WOW. Melania's face says it ALL! #freemelania"},{"comment_id":"10154313536616509","commenter_b":"Um, the judge is a republican. But thanks, though.","commenter_a":"Fox news haters will blame muslims","post_message":"A week after a warrant for his arrest was issued, Ethan Couch -- more commonly known as the 'affluenza teen' remains on the lam."}]
