[{"comment_id":"1156907360996940","commenter_b":"That's a huge bitch!","commenter_a":"DAYUM!","post_message":"This is one of the largest black holes ever discovered. It is 7 BILLION times the mass of our sun."},{"comment_id":"888341521222544","commenter_b":"She sounds worse than the other guy Holder.","commenter_a":"Another dumbass handpicked","post_message":"Add your name HERE: @webpagelink"},{"comment_id":"10153364798139877","commenter_b":"Robin! Amen! Everybody wrong for agreeing with that old woman!","commenter_a":"She is so wrong , she is not the Pastor nor is she the head of the Church. So far out of place in the Church , just because you put in a offering or your family started the church its not your church nor are you the Pastor. Dang shame! Guess she wants to go to hell in a hand basket.","post_message":"103-year-old woman who was kicked out of her church clapped back...now the pastor is in hot water. Watch what happened next below.   Grio fam, we're glad she put up a fight. What's your reaction?"},{"comment_id":"10153100496946051","commenter_b":"i hope the fry his fat white ass","commenter_a":"He deserves life. He has destroyed that child's .Sending prayers for that little Man","post_message":"An 8-year-old boy was playing outside his apartment complex when this man showed up and shot him in the face. Decide for yourselves if the man's punishment was severe enough."},{"comment_id":"10153846533754641","commenter_b":"A VOTE FOR HILLARY WILL BE THE END OF WHAT WE KNOW OF A FREE AMERICA , NO MORALS, ONLY PROMISES AND MORE LIS ! I WAS SHOCKED AT HOW MANY PPL STILL VOTED FOR HER AFTER KNOWING SHE HAS COMMITED TREASON ALONG WITH OBAMA AND THOSE TOP SECURITY TAPES BEING EXPOSED FOR JUST ANYONE TO SEE , THEY CAUGHTBOTH OBAMA AND HER IN LIES WHEN ASKED ABOUT THOSES TAPES . EVEN IF SHE DID MAKE IT TO BE PRESIDENT SHE BETTER NOT GET SETTLED IN TO QUICK , iI HAVE A FEELING SHE WILL BE INDICTED AND OBAMA WILL BE ALSO !","commenter_a":"Every other one is a liar and owned by big $$. What will they do to help you directly? I don't know any millionaires so I guarantee #Bernie2016 s policies will give you more spendable money. He's not really giving anything away, we already pay for most of it and he's found ways to pay for MORE than the rest, the excess will pay down the deficit. He will create jobs and raise wages, which will lift millions of people out of poverty and they will rely less, or not at all, on welfare. (No, this will not cause massive job loss or inflation. When poor people earn more money, they spend it, giving businesses plenty more money to use to pay the higher wages, usually with little to no increase in price.) He will implement a small tax on wall street transactions and other UNEARNED income, and will invest ...","post_message":"Donald J. Trump after a projected 2nd-place finish at Iowa caucuses: 'We will go on to easily beat [ Hillary Clinton ] or [ Bernie Sanders ], or whoever the hell they throw up there.'   Live updates from the Iowa caucuses: @webpagelink"},{"comment_id":"10153396293173525","commenter_b":"'@username, yes I do know that. It has never happened despite 45 of 50 states allowing open carry, and some that have NEVER PROHIBITED it since they became states. No open carrier has ever been 'taken out' by a criminal.","commenter_a":"Kinda think it's dumb. Makes you a target basically. Someone will see ur gun and be like let me take them out first... Ya kno... Element of surprise is better.","post_message":"OPEN CARRY: The same law that's being proposed here in Florida just went into effect in Texas, and to celebrate, several groups rallied at the State Capitol carrying their guns.  STORY: @webpagelink"},{"comment_id":"10154793363900575","commenter_b":"Fucking right a wall","commenter_a":"You have a wall? Why you so upset ?","post_message":"THE WALL JUST GOT 10 FEET TALLER..."}]
