[{"comment_id":"10153452421356323","commenter_b":"\"Tear down this wall.\" ;)","commenter_a":"America will elect a Socialist when China democratically elects Ronald Reagan as its President.","post_message":"If Democratic socialist Bernie Sanders is elected president of the United States, how do you think it could impact global politics?"},{"comment_id":"1379882718715731","commenter_b":"Illiterate angry white trash lady. #sad","commenter_a":"They lost the election because they rigged their nomination and backed the wrong candidate","post_message":"TheBlaze's Dana Loesch explains why Democrats lost the election at the Conservative Political Action Conference (CPAC) 2017. See more Dana @ theblaze.com/dana-loesch"},{"comment_id":"1499576316724205","commenter_b":"Leave now. You are discase","commenter_a":"CANT WAIT","post_message":"THEY'RE OUTTA HERE!"},{"comment_id":"10155013534653734","commenter_b":"There are many veterans that need work. Why not offer them a job?","commenter_a":"Just make sure they got their paperwork together since you made a public announcement.","post_message":"Starbucks Chairman and CEO Howard Schultz announced the move after President Donald Trump's travel ban that applies to Syrian refugees and six Muslim nations."},{"comment_id":"1615889428471180","commenter_b":"That'll put some die in her ass","commenter_a":"Oh,stfu. Take your crybaby ass to your favorite proctologylist and get a soothing ointment to rub on your buthurt","post_message":"This young woman was deeply offended by a sweater Target is selling. Should Target keep selling it anyway?"},{"comment_id":"10154456212209060","commenter_b":"Have yall seen an uncircumcised vagina? Yikes","commenter_a":",,,,yea but have yall seen an uncircumcised penis???? Yikes","post_message":"If men can become astrophysicists or master carpenters, surely they can learn to wash? Campaigners are fighting the perception that the benefits of circumcision outweigh the risks"},{"comment_id":"1784975415104883","commenter_b":"Quit talking the talk and walk the walk and prosecute this Bitch already for crying out loud!!!!!! No more POS criminal Clintons in the White House!!!!!!!","commenter_a":"We need to start a new Party, the Constitutional Conservative Party.","post_message":"DML explains about indicting Hillary Clinton for her emails -- what would it do? Plus, little inside info from pollsters who say Trump leading in polls nationally by Tuesday. Watch, share, and if you are new to DML please give this page a LIKE."}]
