[{"comment_id":"10153986318004071","commenter_b":"Still I could look up plenty more lyrics","commenter_a":"But he just did a commercial with little yachty which doesn't make sense 🤔🤔. In lil yachtys biggest song he saids ''tell her I can get that pussy easily''. Wake up sheeple","post_message":"LeBron James is speaking out against Donald J. Trump's 'locker room talk.'"},{"comment_id":"579381068889728","commenter_b":"BUILD THAT WALL AROUND TRUMP","commenter_a":"#BUILDTHATWALL","post_message":"Donald J. Trump joins supporters in chanting, 'Build that wall!'"},{"comment_id":"10154130637278352","commenter_b":"I'm positive with all the comments you got some backlash lol, but keep in mind they're fucking disgusting bitches ha ha ha ha","commenter_a":"There's nothing wrong with breast feeding, but this is disgusting to put your almost 4 year old on the boob.... Want your child to drink your breast milk? invest in a pump....","post_message":"Mother defends breastfeeding her three-year-old son claiming cows' milk is bad for children as she encourages more women to feed toddlers this way"},{"comment_id":"10153964436169705","commenter_b":"'@username but did he attend the funeral for Lady Bird Johnson? Gasp.","commenter_a":"Obama will probably attend HIS funeral!","post_message":"The co-founder of the annual South by Southwest festival Louis Meyers has died."},{"comment_id":"10153414475016167","commenter_b":"Damn uppity women with their words and assertiveness","commenter_a":"They should know we Chicago folks like a good shout out. Have they never been to a Cub, Bear or Hawks game? It is enthusiastic and honest.","post_message":"Add this to the list of things the media would never attack a male politician for:"},{"comment_id":"10156378664500725","commenter_b":"I have an idea. JDLTI. Just don't let them in. When you become President close all immigration for up to five years. We can take care of the terrorists in the Middle East while weeding them out here in the U.S.","commenter_a":"E","post_message":"I keep saying it. When the President of the United States of America, Barack Obama -  will not issue the words RADICAL ISLAMIC TERRORISM - the problem will NOT BE SOLVED!"},{"comment_id":"10152908039036491","commenter_b":"Exactly mark. What about people who use PED's? Where is that integrity?! Why isn't their team also punished? Wes Welker violated those rules with Denver. But it got retroactively sustained due to rule changes. Are you kidding?!?!","commenter_a":"In the end his punishment had nothing to do with deflated footballs. It was for behavior detrimental to the integrity of the game and the league. Read the letter to Brady explaining his punishment. Accountability goes a long way, too bad tb, belicheck and Kraft don't know the first thing about it.","post_message":"More bad news for Tom Brady."}]
