[{"comment_id":"1811243409145396","commenter_b":"what kind of genius stays with a man who outright cheats on you and is a womanizer....","commenter_a":"what kinda genius puts our deficit at $20 trillion....","post_message":"\"Now, how anybody can lose a dollar, let alone a billion dollars in the casino industry, is kind of beyond me,\" Hillary Clinton said of her opponent."},{"comment_id":"1316028568419930","commenter_b":"What happens if you don't believe in \"God\"? I personally will not end up in hell if I have an abortion, as I don't follow the teachings of any religion. For me, it is my body and if I don't want something growing in my body I will remove it. I have had a miscarriage, and I have my one child. I do not want another child, ever. I can't use birth control, I can't use affordable condoms. If I have sex and I end up with a pregnancy I will have an abortion. Becuase I do not want another child. It is that simple. If we do not watch out we will soon be sent to jail for having a miscarriage, that is the road we are going down. So every female that has ever had a miscarriage needs to stand up and fight for the rights of others, ...","commenter_a":"Sometimes pregnancy happens regardless of how many precautions are taken. Sometime a woman's right to consent is taken from her. Sometimes the pregnancy is a deadly risk for the mother. Sometimes the baby may live a short, painful life or a long painful life. Sometimes a woman does not realize she is pregnant right away. Every time it is her body, her rules.","post_message":"This bill would prohibit abortions after the first detectable fetal heartbeat but many women don' even know they're pregnant that early."},{"comment_id":"1028975063831277","commenter_b":"That lady has no clue","commenter_a":"What was the criminal background of the one shot in chicago by the cop? Just wondering. Did we get rid of an upstanding future physisist, doctor, or a career criminal who's career was cut short? Just wondering !","post_message":"OUTRAGEOUS: Chicago Thug Executes 9-Year-Old Boy Point Blank In The Head, Black Community SILENT! (VIDEO) They won't protest this child killer, but will protest a cop who shot and killed a thug! SICKENING! Share this if you're sick of these people and their bigotry! FOLLOW OUR PAGE---> Freedom Daily @webpagelink"},{"comment_id":"1109370075781392","commenter_b":"@username, do you think the military being forced to lower their standards to allow females into front line infantry units is a good thing? The Marine Corps did numerous studies that show infantry units became much less effective when women were added. Currently, a special forces Sgt. is being court martialed and will be less than honorably discharged because he confronted an Afgan police officer and pushed him to the ground because he was ongoingly raping a little boy- that's a good thing? Our veterans are literally dying because they are having to wait for treatment from the VA - that's a good thing? A lot of great officers are being let go and forced out because they don't agree with Obama's policy's....that's a good thing? The current ROE's tie soldiers hands and put them in danger. The morale is at an all time low....things are not good. THis plus ...","commenter_a":"Our military is second to none! The only people questioning the readiness of our military forces are Republicans! There isn't one nation on the planet that wouldn't trade to have both our military personnel and equipment! So stop perpetuating a political lie in the hopes of portraying President Obama as un-supportive of our troops and military leadership!","post_message":"When President Barack Obama took office, he inherited a professional, world-class, battle-toughened military. Seven years later, many experts see the U.S. armed forces as a tattered and demoralized organization. In a special 'Fox News Reporting - Rising Threats - Shrinking Military,' Bret Baier investigates what Obama has done with – and to – the military. Don’t miss it Friday at 10p ET on Fox News Channel. @webpagelink"},{"comment_id":"992365204151742","commenter_b":"Since the dawn of evolved time mankind has migrated so that won't stop. I agree the need know who is entering the nation if I remember a European country found that immigrants were part of protest. And terrorist will use this to build cells to attack. However I don't see how Trump will get Gulf States to build security safe zone since the 'fountain is running dry' or maybe he will reignite the polluting of the environment with fossil fuels and take action to get fossils prices back to 110 which will create more bad than good but greedy and gluttony will prosper. His positions may have down sides for any real growth. And I agree that America needs to stop providing bulk funding, to the UN and other, let the world let the new imperialists do it and they, US, rebuild and make the world positive, green, clean and ...","commenter_a":"Republican Party souls have been sold to highest bidders, \"The Sneaky Wolves\". Lincoln Party is officially dead. So sad, Republican primary election is fraud, unfair and rigged, it seems every bigot and racist hiding behind the conservatism came out the closet to poisoned the election process in order to hijacked the Republican Party. I feel sorry for the gullible and naive Republicans who have been mislead, bluffed, lied and manipulated. Trump’s gang for hostile takeover of Republican Party maybe the worst case scenario in the American political history. Thanks a lot media for giving Trump’s gang free ride. Media is sold out to the highest bidders and freedom of press is no longer relevant to corrupt bosses and greedy investors Not again, another Hitler era, never again. @webpagelink Going in and out of building makes a person a Christian no more than going in and out of a barn makes ...","post_message":"“No. I would not allow people to come in from Syria. They’re not vetted properly. They’re moving in by the thousands.” Donald J. Trump reaffirmed his commitment to a ban on Muslims immigrating to the United States, arguing that it is better to build \"safe zones\" in Syria. What do you think?"},{"comment_id":"10154830070756337","commenter_b":"I feel good Hillary is going to win","commenter_a":"I'm with her!","post_message":"We're counting down to Tuesday's election. Tell us how you feel..."},{"comment_id":"791521404314373","commenter_b":"ENOUGH FREAK SHOW BULLSHIT IF YOU HAVE A COCK YOU USE THE MEN'S ROOM","commenter_a":"That's the Republicans in a nutshell lol. Poverty??? Jobs?? Helping the Poor and Veterans??? FUCK NO!!! we don't have time to do that we have to make Bathroom rules lol","post_message":"Oh no....last time I posted on something like this I hate Liberal hate mail for about a month. So what's your thought on this?"}]
