[{"comment_id":"1000663273302101","commenter_b":"Fuck you pig boot licker.","commenter_a":"HAHAHAHAHA. Just because they be black,,,,,,,,you think yo sorry black asses BE safe with Islamists \"protecting\" yo ASSES? HAHAHAHAHA","post_message":"The police thought they were the only alternative for security. They just found out that there are many groups willing to do their jobs for them, for cheaper and with more accountability if they mess up! Do you support this move? Or will their be utter chaos without the police there? Follow >> (Y) Counter Current News for the latest!"},{"comment_id":"10154742351861336","commenter_b":"Insane b.s. But Hillary is a free woman. Wtf","commenter_a":"When I went to vote in the primaries, there were people wearing Hillary shirts and they had signs and were giving out stickers. Oh I guess it's OK for Democrats. :/","post_message":"A Donald J. Trump voter in Texas was arrested Monday for wearing a T-shirt to the polls that mocked Hillary Clinton’s infamous comment in which she said half of Trump supporters were “a basket of deplorables.”"},{"comment_id":"438540092994538","commenter_b":"Ron i understand....however Im still not tryin to make excuses but im a single homeowner with a mortgage that works full time and has the same bills as everyone else. I wanted it bad enough and i found a way to do it. If anyone wants it bad enough then they will find a way to sacrifice for the time being. Only reason i origanally commented on this post is because i am proof that a lil sacrifice and hard work pays off. I gave up alot for the year i went to school. Most people will just \"omg i cant give all that up, eh ill just work at a crap job and complain and expect to get things handed to me.\" What bothers me is the sarchasm and name calling ive gotten here from some people haha. Ur the ones that want things handed to you probably!! Stop ...","commenter_a":"Or?? How bout it means get off ur butt and try to better yourself....","post_message":"Let's aim for a living wage."},{"comment_id":"10153312130831051","commenter_b":"its a MUTE SUBJECT!!! THERES NOT ONE RUNNING FOR PRESIDENT ... AMERICANS ARE SICK OF THIS CRAP !!!!!!!!!!!","commenter_a":"I would beleive Mr Carson anyday over Obama or any of his men......","post_message":"The Obama administration just slammed Ben Carson for saying America shouldn’t elect a Muslim president. Who do you think is right here: Carson or the Obama administration?"},{"comment_id":"1333824080002554","commenter_b":"@username love that red dress","commenter_a":"Jessica Phillips @username Jasmin Pluto this is great","post_message":"WTF does \"girlfriend material\" even mean?..."},{"comment_id":"10155208349228690","commenter_b":"JEWS also believes in exactly the same GOD we worship,,,the one and only,,,,,They call him Hashem,,,,and have other name in Hebrew,,,,ISLAM allows MUSLIMS to EAT koshered MEAT ,,or animals slaughtered by Jewish rituals,,because they also recite name of our / their GOD,,,,,so this MEANS ,,Islam has accomadated both MUSLIMS JEWS christians to LIVE side by SIDE,,,understood,,but ones who LIE may NEVEr admit this,,,","commenter_a":"They steal their land, they're destroying their houses, they're spoiling their olivers, they're arresting children and abuse them, they're using chemical weapons against them, they're isolating them, making them starving, they're bombing hospitals, ... And they're blaming palestinians for throwing them stones and hating them ! Should they give you flowers?! Go ahead Palestinians! May Allah bless youuu","post_message":"Eshaq Abu Jibneh suffered the injuries in a brutal attack in a West Jerusalem public square last summer, belatedly recognised by Israeli authorities as a hate crime."},{"comment_id":"10153606210716509","commenter_b":"she should have given him a stone cold stuner","commenter_a":"We need more moms like this!!","post_message":"What do you think of this mom's actions? Taking matters into her own hands, her son got a heavy dose of discipline on live TV: @webpagelink"}]
