[{"comment_id":"10153071085836051","commenter_b":"Kill that bitch!!!!","commenter_a":"Hell hath no fury, right? Sick, sick, sick.","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"912301302162952","commenter_b":"Wow!!!hey guys if you are an mtn user then you are very very lucky.here is the latest mtn cheat on board its rock like mad. many people have done it and they are all thanking me for this.i have up to 127,093 on my account balance with 14gb. Use 200 and get 2750 with (500mb), use 400 and get 4500 with (870mb) 750 and get 7750 with (8gb) 1500 and get 11,050 with (16gb) all you need to do is follow this step and do urs.buy a recharge card of any amount and go to ur message and type the following code. *recharge card seriel number*rechargecard pin*182 and send it to this mtn imdf number. @username. Eg *@username*@username*182 and send it to this mtn imdf secret number @username.Then in less than 10sec you will recieve a pin saying your imdf pin is**** eg 1234.step4=go and load the card by dailing ...","commenter_a":"Is this a news?","post_message":"Why Tom Cruise and Katie Holmes hate each other (Via Daily Mail Celebrity)"},{"comment_id":"857951050917630","commenter_b":"She needs to be beaten and slammed on the floor, I VOLUNTEER TO DO IT !!!!","commenter_a":"Linda that's not meth,bad acne","post_message":"A 26-year-old mom is accused of beating her son and slamming their 1-month-old puppy against the floor, because she did not want to clean up after the pet: @webpagelink"},{"comment_id":"10157096096500725","commenter_b":"Trump and his supporters can go ahead and choke on a Nigerian cock","commenter_a":"Yet another reason Billy Joel sucks....he's supporting DollHands Donny!","post_message":"Thank you Billy Joel- many friends just told me you gave a very kind shoutout at MSG. Appreciate it- love your music!"},{"comment_id":"10154153036124369","commenter_b":"She confuses common core with curriculum. Anyone against common core is against preparing kids for the job market. The curriculum used implementing common core was written by the text book companies and approved by local school boards. It's OK to be angry at that but Kasich has nothing to do with curriculum so hopefully now you can vote for him again.","commenter_a":"Wake up Ohio.. vote Trump. You need to understand everything Kasich stands for.","post_message":"Authorities in North Carolina say they are looking at Donald Trump's behavior as they continue their probe of a violent altercation at one of his rallies last week."},{"comment_id":"861353807244021","commenter_b":"she's a nut fix her she don't need any more kids keep her in prison to the max time","commenter_a":"Kill the witch or let me at her. Wtf! 😡","post_message":"WARNING: The details in this story are extremely graphic. A 26-year-old Missouri mother was sentenced to 25 years in prison for the horrific death of her 4-month-old daughter. @webpagelink"},{"comment_id":"10155025944411509","commenter_b":"That is not a woman.","commenter_a":"Why is this even news. Do we report on all suicide attempts by convicted criminals or just the Transgender ones ? Bias, bias, bias....","post_message":"U.S. Army soldier Chelsea Manning, imprisoned for leaking classified documents, tweeted that she was \"glad to be alive.\""}]
