[{"comment_id":"10153020088312235","commenter_b":"You just said 17 Americans died in 2011. We've been at war with Muslims for over 10 years. There is such thing as an enemy. Nothing racist but anybody who is stupid enough to follow a man made book and then kill on behalf of that fairytale should be executed. If I invite you into my home and you disrespect me and my family, I'm going to kick you out. Same thing with Islam. Western nations opened the door to HELP THEM, not to get FUCKED BY THEM, and people are starting to get sick of it. It's likely best if all that do not want to embrace the culture of their host country go back home where they can lop off heads all day long and molest children","commenter_a":"How stupid are you? Focusing on Americans piss ass shootings? Look at the big picture as you support Islamic terrorism and put it on a pedestal. Animals trying to get nukes and you are worried about a couple gun nuts. They are devouring Western Europe and you pick the flea off of the dog to focus on. That's why Liberalism is a mental deficiency - focusing on the flea on the dog instead of the dog.","post_message":""},{"comment_id":"10154645431764445","commenter_b":"Why? Herr Drumpf is a racist bigoted sexist pig","commenter_a":"Of course he's white","post_message":"BREAKING: The suspect in the deadly Washington state mall shooting is in custody, according to officials: @webpagelink"},{"comment_id":"10154308942676336","commenter_b":"Build the wall screw the Mexicans","commenter_a":"no need to .. i mean their ignorant puppet master says it all the time :P","post_message":"The student said he wanted to do something \"provocative\" to protest restrictions on freedom of speech and didn't realize until later that the phrase held such a strong, threatening connotation."},{"comment_id":"10153163216675950","commenter_b":"What...like it's hard?! #illegallyblonde","commenter_a":"This nonsense is in the same category as the Nobel Peace Prize nonsense. Victory is awarded by decree. Neoliberals in higher education are waging an aggressive campaign to destroy meritocracy.","post_message":"\"There are few teams we are prouder of having lost a debate to than the phenomenally intelligent and articulate team we faced this weekend,\" students on the Harvard team wrote."},{"comment_id":"1739262919647781","commenter_b":"Hilary is a Republican. She votes like one on war and trade deals. I can find examples if you would like","commenter_a":"Dear Democrats. Bernie Sanders is \"not\" a Democrat. Bernie applied as a conscientious objector in the Vietnam war and did until he was too old to be drafted. In July 1985, Bernie Sanders traveled to Nicaragua, where he attended an event that one wire report dubbed an -U.S. rally. In 1981, he won a shocking victory by only 10 votes to become mayor of Vermont largest city, Burlington. Sanders was elected on a socialist platform and led a mayoral administration that he boasted was radical than any other in the country. And he had a vision! Sanders believed his work in Burlington could spread socialism throughout America. In April 1985, the Los Angeles Times published a lengthy interview with Sanders in which he outlined his plan to spark change. That is exactly what he is trying to do now. Show a tiny bit of his plan and drastically change America ...","post_message":"Back-to-back poll results suggest that Hillary Clinton is on the cusp of a pivotal victory that would help her regain momentum after a string of embarrassing defeats and that would deliver a blow to Bernie Sanders as the two Democrats gear up for the final stretch of voting."},{"comment_id":"619645721526492","commenter_b":"I bet this woman also looks good with clothes on (y)","commenter_a":"Please don't take any advise from the Kardashian's. Look at their lives, they have no right to give out advice","post_message":"Would you contour your bum? We're trying out the 3D tan loved by Kim Kardashian West and Olympia Valance"},{"comment_id":"1132662126754797","commenter_b":"Haaaa! Sandhopper burgers all round !!!","commenter_a":"@username they stole our business idea!!","post_message":""}]
