[{"comment_id":"1115505231842557","commenter_b":"Because there are so many foreigners in London working illegally, they can't keep up!!","commenter_a":"They shouldn't be allowed to operate, they're all rip off merchants on benefits, why does tfl turn a blind eye.","post_message":"'How do you charge £600 for half-an-hour?'"},{"comment_id":"1333030216717005","commenter_b":"She has no talent and is trash","commenter_a":"Levy a fine, and move on. That show was one of the best in a long time. Grande was very good.","post_message":"Singer and actress Ariana Grande surprised the \"Saturday Night Live\" audience and crew with an unexpected profanity during her monologue."},{"comment_id":"1563584047268472","commenter_b":"Our society does not need assault weapons!!!The politicians have blood on their hands, because of their inaction when it comes to the NRA!!!!","commenter_a":"President Obama tried to enforce stricter gun regulations but Congress voted against it. They voted for individuals on the terror watch list to keep rights to own assault weapons and now they're blaming Isis. How convenient.","post_message":"This is infuriating.  Image by Occupy Democrats, like our page for more."},{"comment_id":"1309167775828422","commenter_b":"Start packing and get the hell out of America now","commenter_a":"Don't forget to take your BS . with you","post_message":"At least one Hollywood celebrity has kept their word. Here's a star who said they'd leave the United States if Donald J. Trump got elected who's actually doing so...  Bon voyage! We can think of a few more you can take with you!"},{"comment_id":"10152594345774071","commenter_b":"What girl with an f cup wants to wear a bra with half inch width straps? VS bras aren't comfy anyways.","commenter_a":"The bigger the size the harder is must be to line up the targeted areas with the proper tie downs ...","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."},{"comment_id":"10158382623765093","commenter_b":"It would be illegal to play it. It is national Security. and Illegal.","commenter_a":"Flynn talking about sanctions people what more important a Russia helping to stop ISIS around the world and stop aggression or keep Obama sanctions on them and never accomplish anything .Only reason Obama put sanctions on them while leaving was to stop Trump from making deals with the to help stop ISIS","post_message":"\"It seems inconceivable that Flynn did not consider the likelihood, the virtual certainty, that he was calling a wiretapped line.\" -- Andrew C. McCarthy"},{"comment_id":"10155026545836337","commenter_b":"Not the worse but close.","commenter_a":"Chuck is on point","post_message":"WOW. Charles Barkley torched the entire NBA..."}]
