[{"comment_id":"10154280018188797","commenter_b":"Illegal immigrant aka alien. Im no immigrant nor do i support harboring illegal aliens","commenter_a":"Thank god for her. Thanksgiving is a day to honor a massacre, it's disrespectful to even celebrate the event. Religion is a lie so she is only protecting the best interest of the child, shame on parents who don't. More schools need to follow her lead. She is not the principal of a private Catholic school. She is the principal of a public school. Argument ended","post_message":"NO THANKSGIVING, SANTA, OR PLEDGE: A school principal has banned Santa Claus, Thanksgiving and the Pledge of Allegiance at her school. What do you think?"},{"comment_id":"10152763555906051","commenter_b":"This is just getting so ridiculous why don't people just mind your own business and live her own life grow up","commenter_a":"i think she is one hell of a shot. i wouldent piss her off. leave her alone. your just jelous because you can't bow hunt as good as her. she is feeding someone. you have nothing to be scared of with an eye like yours. u go girl.","post_message":"This woman has been getting death threats over her photos. Decide for yourselves if the criticism is warranted."},{"comment_id":"1194058434020542","commenter_b":"Coulda, woulda, probably shoulda.","commenter_a":"Thank you, Bernie Sanders for finally bringing unity to the Democratic Party!","post_message":"This moved us to tears... what a moment!"},{"comment_id":"10153238439315950","commenter_b":"seeing as every single non 1st nations person is an immigrant they need to stfu","commenter_a":"Guess you \"forgot\" to mention yr phony ISIS had 20,000 twit-sites taken out by Annonymous? CIA must be a tad depressed today? Not to worry guy's....it's only REAL NEWS! We can find it anywhere but here. Jokers! Shame on the lot of you!!!","post_message":"UPDATE: More states are saying \"no\" to Syrian refugees in the U.S., call for stricter screening @webpagelink"},{"comment_id":"10152622903648067","commenter_b":"POLICE and MILITARY are made up of FALLIBLE HUMANS......some FALLIBLE humans do HIDEOUS things and then hide behind the BADGE!!! Those that do such things deserve to be OUTTED","commenter_a":"When they stop waging war against the Police and Military maybe I'll get behind the group... until then. They're a bunch of punks living in their moms basement, blaming everyone else for their problems.","post_message":"\"We, Anonymous around the world, have decided to declare war on you, the terrorists,\" the hackers said in a YouTube video. @webpagelink"},{"comment_id":"1265995716788763","commenter_b":"^fuck that baby","commenter_a":"What is up with this country? A woman owns her body and nobody can tell here what she can and can't do. Its called freedom.","post_message":"Millions of women rely on the health care services of Planned Parenthood, and we must stand with them. The women of this country have the right to control their own bodies, not politicians. No cuts to Planned Parenthood."},{"comment_id":"1970418399684565","commenter_b":"Gorgeous dress","commenter_a":"Horrible dress","post_message":"Politics made it to the Grammys!"}]
