[{"comment_id":"10153228124522235","commenter_b":"You scaring kitty. You BAD man.","commenter_a":"Scum!","post_message":"Convicted felon, Tom Delay, crawled out from under his rock to share his very important opinion about rights and liberties."},{"comment_id":"1049399221792530","commenter_b":"A Hillary supporter should be asking themselves why they want a killer in office.","commenter_a":"A Trump supporter should be asking themselves why Putin would be interested in Trump winning the generals. Makes you wonder about where you stand.","post_message":"Donald Trump’s call for Russia to hack America makes this election an easy choice. ►Full Episode: @webpagelink"},{"comment_id":"543331865850763","commenter_b":"WANTS TO KEEP AMERICANS STAGNANT, MOVING BACKWARDS AND PAY HIGHER TAXES TO SUPPORT IMMIGRANTS COMING OVER OUR BORDERS FROM ISIS COUNTRIES TO PUT AMERICANS IN GREAT DANGER, WANTS TO KEEP MINORITIES IN DEMOCRATIC OPPRESSION, POVERTY, JAIL, AND HIGH CRIME, NO FUTURE, WELL WHY NOT VOTE FOR HILARY CLINTON.","commenter_a":"Says the oh so honest Christian man who dumped his wife (who was fighting for her life with cancer in the hospital) for his bimbo secretary after he dumped the first wife because she wasn't pretty enough to be married to a great man like him.","post_message":"\"Donald J. Trump's going to win, because in the end the country's not going to reward big banks and big unions and big bureaucracies and big donors and big corruption by voting for a big liar.\" –Newt Gingrich"},{"comment_id":"10153066527856336","commenter_b":"Please woman go troll somewhere else","commenter_a":"Poor guy","post_message":"Bristol Palin is engaged to Medal of Honor recipient Dakota Meyer – the Kentucky native is credited with saving the lives of 36 Marines, Army soldiers and Afghan soldiers."},{"comment_id":"10155345287068132","commenter_b":"She needs to save her nekkidness for JZ.","commenter_a":"Wierdo & shes so over rated meh","post_message":"We're still not over Beyonce's performance! Join us in the comments to let us know what you thought."},{"comment_id":"936073656538031","commenter_b":"She is the one for the job. Let's go forward not backward.","commenter_a":"HILLARY will be a GREAT PRESIDENT.. #PRESIDENTHILLARYCLINTON2016","post_message":"Matt Lauer asks Hillary Clinton about the qualities that make her qualified to become Commander-in-Chief. More coverage on @webpagelink"},{"comment_id":"1782129565361138","commenter_b":"@username SHES tying her hair up so it doesn't get in the way of the dick she about to suck bc she dosent wanna verbally apologise","commenter_a":"@username I don't get this, explain?","post_message":"Apology accepted"}]
