[{"comment_id":"10156091000625354","commenter_b":"White Trash ...Bastard .... Hoe Bag.... She has Evil Eyes.....Ugly Bitch.....!!!!!!..","commenter_a":"That's this fat slobs 2 seconds of fame, congrats your grandkids will tell stories","post_message":"Here's what we're dealing with, folks…"},{"comment_id":"1020621978034054","commenter_b":"Queen of England? LOL... She's such a jokester, a desperate one.","commenter_a":"Why should anyone stand with him? No reason to","post_message":"Sarah Palin doesn't stand with Ahmed."},{"comment_id":"614711638682250","commenter_b":"So she was stealing from her mother?WTF","commenter_a":"What an idiot...did she say her mom lives there even after he said it was his house?! Also what in the world would her \"niece and nephew\" need from Grainger?? Stop the stupidity people...","post_message":"An attempted package thief who was confronted by a homeowner tried to tell him that her mother lived at the home. The homeowner said he was going to call police, and she dropped the packages and fled. Now the Alhambra Police Department is looking for help identifying her. Read KTLA story here: @webpagelink"},{"comment_id":"10153368767146694","commenter_b":"Those were not feminists, those were trolls.","commenter_a":"Meh to all the feminist crying. If you hate her characterization, you don't have to force the entire female gender into the issue. Also, the action figure industry is asinine. See how it screwed over Green Lantern TAS and Young Justice.","post_message":"Let's talk about The Avengers' Black Widow problem."},{"comment_id":"1370641286340188","commenter_b":"HE is transitioning. This FEMALE is taking a hormone that naturally occurs in both sexes bud. The hormone treatments are meant to change the development of certain features. Nails, hair, masculine chest, skin tone, fingers etc. Workout drinks for women such as, pre workout, come with testosterone for added boosts. Now, there are specific weight categories to ensure fairness. There is a woman that goes to my gym, I overheard her say she weighs 150lbs. She can bench as much as me. She can squat more than me. It's all about the work and dedication you put into your day and routine.","commenter_a":"Testosterone. Why SHE, shouldn't have been allowed to compete against boys or girls. Period.","post_message":"He didn't back down."},{"comment_id":"10152707849071028","commenter_b":"With their family issues this's couple should not have children.","commenter_a":"\"Seven case workers were assigned to the family\" yet they didn't do a thing!","post_message":"The girl’s nose and part of her cheek were eaten away, while her upper lip was shredded. @webpagelink"},{"comment_id":"1266472966743179","commenter_b":"But why are their boobs exploding tho?","commenter_a":"Amen","post_message":""}]
