[{"comment_id":"10153205127216336","commenter_b":"They should be arrested, if any are on welfare they should lose their benifits..!!","commenter_a":"So they riot and loot because they don't have jobs and are poor?","post_message":"\"Because of my faith in God and people in the church that never gave up on me, I was able to pursue my own calling and purpose and destiny.\" Pastor Donte Hickman of Southern Baptist Church (Baltimore) told Gretchen Carlson that the youth in his community are not a lost cause."},{"comment_id":"1181889591889575","commenter_b":"Disgusting, disrespectful pigs. They should kiss the ground they walk on and be grateful to be here instead of the hellhole they came from. However, maybe they should go back. They laugh at us, the stupid Americans that clothe and feed them not to mention housing and oh yes, the free education!!!!! Filthy people.","commenter_a":"Go away...","post_message":"A Muslim family is going viral in a bad way after they made a SHOCKING move while the National Anthem played... this is NOT good. Now that the video is out, they probably wish they had never done this..."},{"comment_id":"10156924916305405","commenter_b":"Kathy ugly woman inside and out. I don't talk to commie vermin!!","commenter_a":"Hillary will become president amidst your persistent digging. Republicans cannot even nominate a republican, the party is a total eclipse. Trump vs Hillary is a mono party.","post_message":"\"I have turned over all my emails…I have been incredibly open about doing that.\" Yet Clinton deleted more than 31,000 emails."},{"comment_id":"870399723007863","commenter_b":"Her and Her Husband are a disgrace to America.period!","commenter_a":"She think it ok i am obama wife","post_message":"Is it her?!"},{"comment_id":"10153066062681770","commenter_b":"She will say anything to get people to vote for her!","commenter_a":"I wouldn't back her as dog catcher, the dogs never did anything to me, I like dogs. Can't stand Hitley.","post_message":"Hillary Clinton claims the National Rifle Association takes an “absolutist” stance on gun rights, comparing it to “the Iranians and Communists.”"},{"comment_id":"776943375772176","commenter_b":"Nope definitley not a lie lol, I was biologically born female.","commenter_a":"I'm a conservative on most issues, but I disagree big time on this one being a trans male as well (my original biological sex being female). You really want me to go in the women's room and make people there uncomfortable?","post_message":"Are you freaking kidding me..."},{"comment_id":"10152973600191336","commenter_b":"Na she's not crazy . Mothers turn super human when someone hurts or almost hurts their kids","commenter_a":"Ok...pretty sure this woman is cray-cray...not a protective mama bear, but whatever","post_message":"A wild police chase in Dallas came to an end thanks to a protective mother."}]
