[{"comment_id":"953914171315722","commenter_b":"I do agree that woman look proactive in these yoga suits. I always wear a long shirt over mine. Why cant these young women use some common sense.","commenter_a":"I am not responsible for someone else's thoughts.","post_message":"This woman's response to the idea that women should dress in a way that prevents men from having lustful thoughts is both amazing and hilarious:"},{"comment_id":"990898310953409","commenter_b":"\"Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you\"","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas. @webpagelink"},{"comment_id":"10153200362991943","commenter_b":"Cause she's sn idiot","commenter_a":"obama and his ilk will kill us long before the climate.","post_message":"Why is Obama EPA administrator, Gina McCarthy trying to scare Americans into believing \"Climate Change\" could kill them?"},{"comment_id":"1683253511914514","commenter_b":"@username Trump & FOX NEWS have Greatly Exaggerated This Issue The Lying About the Protesters IS On TV Footage & They Still FLAT-OUT LIE.... Why is Fox NEWS Saying it was Violent Protestors, The Media Was there you can See Who are the Aggressors it was the Trump Supporter, but the Trump Supporters Started Sucker Punches Again, Most of the protestors inside were young White Girl with locked armed, the Protesters Outside were very peacefully walking around Outside with their signs until the Inside Trump Supporters Went Out Side & started Yelling & Pushing Protesters, it's on CNN. Trump Calls CNN & Tell them they were violently attacking, He Ran Off as soon as he saw there was more than one Protestor there's Footage...Trump Lies & Exaggerates everything 1000 Times Fold !! TRUMP Wants to Turn Our Military INTO Brainless Terrorist Animals To Beat ISIS, Our Military Has Rules & ...","commenter_a":"After tonights Chicago thuggery, trump will probably win every state voting on Tuesday in a landslide lol","post_message":"Marco Rubio is urging Republicans in Ohio to vote for Gov. John Kasich in order to prevent Donald J. Trump from winning, according to published reports and comments from his own people."},{"comment_id":"10154189776881130","commenter_b":"I'm ready, bitch.","commenter_a":"Not reading the article--no time for it. But to pass along, a commentator on CNN today said that the Clintons operate from a stance of self - righteousness, thus they cant see what they're doing is oh so wrong. Hit it on the head! Two major party candidates, to major flawed choices!","post_message":"If Hillary Clinton wins in November, brace yourselves."},{"comment_id":"10153609828841051","commenter_b":"and where are these little bastards from ? shot there little asses down like the dogs they are and make there parents pay for this lady for the rest of her life and a huge settlement to her first.","commenter_a":"People are VENDICTIVE!!!! Mean...and must be CRAZY! What makes people want to do these things! We need an island , or send them to the Muslim area. There they will see what CRAZY IS!!!","post_message":"First these boys attacked an 87-year-old woman. Then they raped her. And then they poured bleach down her throat."},{"comment_id":"592725884246871","commenter_b":"She looks like the devil","commenter_a":"She is definitely easier on the eyes than the current one or the wicked witch running for pres","post_message":"Would Melania Trump be a good First Lady?"}]
