[{"comment_id":"739571439509370","commenter_b":"Suzette, no, she doesn't. She just encourages them to get abortions so they can go back to their life and most likely get pregnant again.","commenter_a":"So here's an actual SOLUTION for all the pro-life people... Rather then protest, why don't you offer to help those poor, confused girls seeking an abortion? Perhaps these women feel they have no other option. So why don't you offer to help them out, since you love babies so much? Offer to take these girls in & give them an alternative, especially since a lot of them fear that their family is going to shun them due you to this unplanned pregnancy. Then, pay for all of their medical bills for all the doctor visits they'll need, including the hospital birth. Then, while the mother recovers at YOUR house, you can raise the baby you desperately wanted to save when she leaves to go on with the life that she wanted to live. I think that would work. Why don't all you pro-life people go and do that? Oh wait, ...","post_message":"Planned Parenthood doesn't want anyone to know this? Then spread this EVERYWHERE!"},{"comment_id":"1549806335319114","commenter_b":"She is why we don't need women leading our country.","commenter_a":"She is nuts!","post_message":"An RNC delegate just announced the great lengths she’d go to make sure Trump doesn’t win, it's not going to sit well with many people..."},{"comment_id":"10154159417163797","commenter_b":"Y u hating? Stop trippin & stop actin like a jealous punk. Man, sometimes these women can be straight up fools and want to try ruin something that is a gift for a couple that wanted something so bad and finally god gave that gift. Ezella, being a punk gets u nowhere. Shut up and complain about ur own life princess if u wanna be such a negative Nancy","commenter_a":"He's not crying because he's happy, he's crying because that's his 9th kid & he already owes 30k in arrears. 😈😼🙈🙉🙊","post_message":"TEARS OF JOY: A video of a man bursting into tears when he learns his wife is pregnant is warming hearts all over the Internet. Watch Here:"},{"comment_id":"10153924016401130","commenter_b":"Oh grow up all of you. Why should she need to put a cover over her breasts. You put a cover over your mind and give thanks that mothers can feed portably whilst not being excluded. I'm sure you can train your mind to manage to view a pair of breasts as a feeding devise and look at how your own mind processes this function. Women relinquish enough do to our biology - can't we at least feed and belong at the same time?","commenter_a":"She should have stayed home. Not her day.","post_message":"Now THIS is a cool mom. 😎"},{"comment_id":"889604141156365","commenter_b":"YOU LOOK LIKE A GORILLA SLAVE. WAS CHEETA YO MASTER? STUPID FUCKING NIGGER DOESN'T EVEN KNOW THAT IT WAS HER OWN RACE SELLING THEM TO MUSLIMS AND THEN TO WHITE PEOPLE. SOME OF THESE BLACKS ARE THE MOST IGNORANT SOB'S IN THE WORLD. MUST BE A QUEER BLACK WOMAN WITH A NAME LIKE BUBBA.","commenter_a":"First of all she is full of shit! when i worked in burger King you just kept on cooking .you dont know who is getting the Burger.she is pissed because she didnt prepare herself for a better job .Whos fault is that?why do thet put this shit onF.B .It isnt helping anybody It just fans the flames of racism.I find that OFFENSIVE!","post_message":"Did you miss this one? I bet you did because in Obamaland... 'The Media' doesn't cover such stories. Enjoy. @webpagelink"},{"comment_id":"10153710881709726","commenter_b":"yeah she needs to go to jail....","commenter_a":"Gowdy why worry Hilary broke a lot of laws and she's just scum period someone has to put her ass in jail","post_message":"WATCH: Benghazi Probe has ‘Nothing To Do’ with Clinton"},{"comment_id":"10154228299244218","commenter_b":"FYI this was NOT over drugs!","commenter_a":"clean up cecil county get drugs out the killed will stop . can,not count all the kids pasway in 20 year I live in cecil county iam way ingfor a call my son rusty is died I love rusty but he love his drugs","post_message":"Two people were killed in a shooting Monday night in Elkton, police said. @webpagelink"}]
