[{"comment_id":"1311217235558559","commenter_b":"I watched and every single one of the questions by Greta and the so-called voters sounded handwritten by Trump henchmen... they each read off their question all just like they were part of Trump 's typical campaign stump speeches... That was nothing more than free air time for a Trump speech... Greta where was Ted or John?''' I am done with Greta and Hannity you just cannot trust anything they would report on again... I used to think better of Greta giving everyone a fair shake but this is just too blatantly biased... hope her ratings tank and Fox gets rid of her!!!","commenter_a":"Gutfield is a moron. Flip the channel whenever he is on.","post_message":"Gutfeld now openly mocking fellow Fox News hosts."},{"comment_id":"10153405463063132","commenter_b":"5 year cancer survivor right here. I flew everywhere, because I didn't want to stay at home alone, my guy is a commercial pilot and I can fly for free..so why not?Because my cbc count was low, I had to fly with a mask on, because I had to. I even flew on Alaska airlines from Denver to anchorage. I believe this to be an isolated incident...I was always treated with dignity and respect and allowed to go down first because I said I felt weak..Because I did! So tell me what's the difference between if an elderly person says they feel weak and a cancer patient says it?","commenter_a":"Dear America, your bottom line is not more important than common courtesy or basic human rights.","post_message":"\"We need to make sure that ... corporations aren't so concerned with liability and bottom line that they overlook common sense and common decency.\""},{"comment_id":"10153137257982869","commenter_b":"Mr. McCain should not have called Trump backers, \"crazies\" but I dont hear any of you calling him on that. I like you Mr. Huckabee and would vote for you but understand that Trump is saying what we want ALL of you to say, the truth! McCain can no longer ride on his service alone, he is an awful senator and has done much to hurt veterans today!!!!","commenter_a":"I agree! I respect him for my freedom! He has been outspoken about issues I agree with - don't know what will steer our country In the right direction. I know we need prayer first! Who loves America the most should be elected! I love my country and love it's history! To all who love our red, white and blue!","post_message":"John McCain is an American hero. When our troops return from combat, they should be treated with the utmost respect and admiration. Every breath I breathe and every step I take is free because of brave Americans like John McCain."},{"comment_id":"10154726138223812","commenter_b":"Fact for cowards. Unlike political girly men now. ENFORCE LAW and ORDER--GO TRUMP. Law and order will be immediately restored. Immediately Trump start Rounding up, deporting illegal swine criminals, illegal swine drug dealers, illegal swine drug cartel members. This will solve a lot of the problems.","commenter_a":"How many clowns can you fit in your trunk Mr, King?","post_message":"Rep. Steve King, a conservative immigration hawk who has expressed skepticism about Donald J. Trump's shifting tone on immigration, says at Joni Ernst's Roast & Ride: \"I'm not only going to go into the polls and vote for Donald Trump in November, but I'm going to bring everybody I can with me.\" @webpagelink"},{"comment_id":"977342359028683","commenter_b":"I HAD SEVERAL FRIENDS AND FAMILY MEMBERS KILL IN AUTOMOBILE ACCIDENTS !! WE NEED STRICTER LAW AGAINST AUTOMOBILE OWNERSHIP","commenter_a":"all of you who do not think ammunition and gun availability should not have stricter laws have never had a loved one killed by some mentally handicapped person who had access to this. and if the ammunition and gun manufacturers did not feel there would be laws suits then why did they pay Congress to pass laws so they could not be sued?","post_message":"\"We are relegated to second class citizens. Our civil rights have been taken away from us through this lawsuit. We cannot sue for someone that sold the ammunition. Who's turned out to be a mass murder ... sold him everything he needed to commit this heinous act.\"  Lonnie Phillps"},{"comment_id":"10152762111222061","commenter_b":"Real FAT women","commenter_a":"It's time that real women get recognized!","post_message":" I happen to be a size 22, but I am sexy...\" -- Lane Bryant takes aim at Victoria's Secret with #ImNoAngel campaign: @webpagelink"},{"comment_id":"1011840532205809","commenter_b":"She's always been a corrupt liar","commenter_a":"One thing I know, Hillary has always been involved in community service. Go Hillary! ; .)","post_message":"A young man met Hillary at the NewsOne town hall and asked: What did you learn from the Girl Scouts that you would use to be a successful president?"}]
