[{"comment_id":"1906434399416299","commenter_b":"Imagine something bit u on ur naked body lolzz","commenter_a":"The restaurant name should change to Animals restaurant","post_message":"Owners describe it as an 'orgasmic atmosphere.'"},{"comment_id":"10154082717346037","commenter_b":"You're an old hag and a criminal","commenter_a":"Hilary for president of America 2016!","post_message":"Hillary Clinton and Ted Cruz have received the most funding from the groups so far."},{"comment_id":"944507348950462","commenter_b":"this women is a moron!!!","commenter_a":"are you sure her last name isn't Clinton?","post_message":"Furious Germans Send This 20 Ton “GIFT” To German Chancellor Who Demands Muslims Be Let In These people mean business. Spread this absolutely everywhere."},{"comment_id":"10152987263776130","commenter_b":"@axelnieto and @hugoaguilar. I never said people in Latin American countries aren't happy. I also never said that there is absolute no wealth or opportunity. I agree with you that it's not easy (which is what I was trying to make a point of to begin with) but it is there.","commenter_a":"They don't make work, wealth, and success important because their country doesn't give them the opportunity for that. Duh huffington post.","post_message":"\"Instead of making work, success and wealth the most important things in life, Latin Americans typically have family and community firmly at the top of their priority list.\""},{"comment_id":"10153017975939205","commenter_b":"Well you'll have to fuck off back to Europe then, cunts !","commenter_a":"I worship Ana.....Every square inch...","post_message":"Who knew Jesus was against immigration!"},{"comment_id":"964102913657572","commenter_b":"I guess he's not a good Christian !!!!!!!!!!!","commenter_a":"who is he?","post_message":"Americas Freedom Fighters"},{"comment_id":"10153636723007507","commenter_b":"^This is feminism. Mmmmm smell the equality!","commenter_a":"You know what? Doctors have been ignoring women's pain as imaginary forever. Everything is not about race.","post_message":"The need to constantly reiterate black humanity—because that’s what this comes down to—is both fatiguing, and frankly, infuriating."}]
