[{"comment_id":"10157077224085354","commenter_b":"Ignorant slut","commenter_a":"Crazy socialist bitch","post_message":"The only thing \"ludicrous\" about it is what Debbie Wasserman-Schultz said this morning.  WATCH:"},{"comment_id":"585591074975467","commenter_b":"He must be some form of illegal alien. Where do orange people come from?","commenter_a":"Prepare for 4 years of unrelenting mocking until you take this job seriously and treat people with respect","post_message":"Trump is such a crybaby..."},{"comment_id":"10154921930118690","commenter_b":"Karim Alyaa Dina","commenter_a":"Bal","post_message":"Integrating into a new country can be hard. That's why Horst Wenzel is teaching refugees the ins and outs of German dating culture."},{"comment_id":"652127268253788","commenter_b":"To you Mrs. Michele Obama I say name me just one all white college. I am not racist, I do have several black friends. Being white of course I do have more white friends, then black friends. They seem to under stand my point. But for blacks to say they can't go here or there. I don't see those barriers. I wish we all can stop this racist name calling g and pointing fingers, at each other. I know I can name at least 4 black colleges. I just want to know if anyone can name me just one all white college.","commenter_a":"why is she there? go home & drink some tea","post_message":"A race baiter who is not proud of her country."},{"comment_id":"10153165565220399","commenter_b":"The Democratic President Lyndon B Johnson, the father of the \"Great Society\" that was the rebuilding of the Urban Center for the Black communities to populate and be the new beginning for the poor blacks.. How did that workout... Detroit was setup as the model city.. As was Baltimore and Chicago... In reality, all the democrats did was move the blacks from the southern plantations to the Urban Plantations and laugh as they did it!! Here is the quote from LBJ as he did this: \"These Negroes, they're getting pretty uppity these days and that's a problem for us since they've got something now they never had before, the political pull to back up their uppityness. Now we've got to do something about this, we've got to give them a little something, just enough to quiet them down, not enough to make a difference... I'll have them niggers voting Democratic ...","commenter_a":"Blame it on anyone else but your OWN failed policies, GOP.","post_message":"The conservative blame game is in full effect."},{"comment_id":"1031281086912749","commenter_b":"Oh. Duh. Maybe I could! Planning.","commenter_a":"Oh my. Could someone unfurl a banner with this at the next gathering of Congress?!?","post_message":"This is just great advice.  Image via our friends at ATTN:."},{"comment_id":"1024492464317039","commenter_b":"@username, we can send all illegals home and we'll start with you! Mexican Americans/Native Americans are the only people who this land belongs to. So dip","commenter_a":"Where's the mom so she can start putting graduation pictures up and say that her kid never did anything wrong that he was a good kid and never did drugs Ill be waiting","post_message":"NEW VIDEO: #Chicago police have just released dashcam video that shows a female cop being beaten by a man who was high on PCP. (WARNING: Video is very graphic and has inappropriate language) @webpagelink"}]
