[{"comment_id":"10152747219056051","commenter_b":"This is soooooo wrong and why can't these cases be corrected immediately when the proof comes out. The women who do this should be prosecuted and pay for All damages!","commenter_a":"Back in 1990 I had to pay 400 a week child support for 3 kids the courts let me have custody of my oldest boy gave the ex-wife custody of the three youngest the day that we walked out of the courtroom the ex wife let me have the other three children two years later the welfare department came to me and told me that I have to pay back the last two years of u living expenses that they was giving her she forgot to tell them that she was getting 400 a week the last 2 years took me 2 years in the court system to fight it the system does not like to put women in jail so I know what you are going through","post_message":"This man had an arrest warrant issued for him and got threatened with jail time over unpaid child support. There's just one problem."},{"comment_id":"10156245317395720","commenter_b":"What illegals are we talking about? The ones that invaded on the Mayflower? Or the ones that boldly and brazenly broke into our shores on Ellis Island?","commenter_a":"THE LAW already says certain immigrants can work without fear of deportation. They're called the ones who came here LEGALLY! ILLEGALS, on the other hand, may not work in the United States.","post_message":"184 Members of the House and 34 U.S. Senators filed an amicus brief last night supporting Supreme Court review of President Obama’s executive actions on immigration. We are confident that allowing certain immigrants to come out of the shadows, register with the government, and work without fear of deportation fully comports with immigration law and the U.S. Constitution. Read more here: @webpagelink"},{"comment_id":"10154481356497098","commenter_b":"You a dumb hoe kris","commenter_a":"The awkward moment when you spent all of your infrastructure funds on illegal immigrants and government handouts. 😂 #ihopetrumpmakesyougetonyourkneesandbeg","post_message":"FEDERAL FUNDS REQUESTED: Gov. Jerry Brown is asking the Trump administration for federal assistance in responding to a potential failure of a spillway at the Oroville Dam in Northern California."},{"comment_id":"1715965605357218","commenter_b":"Y E S. I D O. ! ! !","commenter_a":"Of course they should","post_message":"Yes, I agree!"},{"comment_id":"10153238798269255","commenter_b":"OMG! Saved from the menace of foreign wine!","commenter_a":"Hahahahahahahaha.","post_message":"Dummy."},{"comment_id":"1809742349269568","commenter_b":"IF YOU CAN DUMP TRUMP OVER SOMETHING HE DID YEARS AGO IN PRIVATE LIFE. THEN HILLARY SHOULD BE IN PRISON NOW.LOOK AT 5HE TREASONOUS ACTS AGAINST AMERICANS. THIS IS ALL SHE CAN COME UP WITH TO DEBATE TRUMP SHE HAS LOST ALREADY.","commenter_a":"It's not happening folks, he IS our next president !!!! He has done nothing most guys haven't done around a bar table or a camp fire with their friends, and most girls have done talking to their girlfriends and men, his words can't even come close to what that female has done, so get over it he is the only smart choice !!!!!","post_message":"Lawyers at the Republican National Committee are assessing what legal remedies, if any, could allow the committee to remove Donald Trump as the party’s standard bearer."},{"comment_id":"1868657266690469","commenter_b":"Talking about Melanie trump class haha she need a pole and dancing,center for the entertainment industry.","commenter_a":"She is such a beautiful person, so graceful and such class she brings to the WH, something g we Havn't had in several years.. What a great change","post_message":"Michelle Obama doesn't think Melania is fit to serve as First Lady.  'LIKE' if she's WRONG!!!"}]
