[{"comment_id":"10154303024133132","commenter_b":"Shut up, Maggie.","commenter_a":"It's not nice to be wearing such nice clothes to cuba when those people have nothing! They looked scaredto be their in my opinion.","post_message":"Sasha and Malia Obama delivering a healthy dose of style inspiration while in Cuba! (via PeopleStyle)"},{"comment_id":"533363636854216","commenter_b":"if this person had been a white lady, shed be up on charges...black privilege","commenter_a":"Good for her kick his ass","post_message":"After this mom found out her son was rioting, she took immediate action. All the parents in Baltimore should be doing this to their race rioting children. Do you agree her race rioting son got what he had coming?"},{"comment_id":"827024174060503","commenter_b":"@username you move and take that communist Kenyan creep with you","commenter_a":"You libs are pure , unaldulterated \"mush\"! Your president is taking us down the road to nowhere and you are worried about the police killing a wonderful young \"punk\" who stole and bullied and tried to kill an officer? Get off welfare and get a job!","post_message":"\"The power to kill is the most awesome power that any government worker could possibly have. We have given that power to police, and then we have refused to monitor it.\" - Lawrence O'Donnell"},{"comment_id":"10153352524191179","commenter_b":"B**ches","commenter_a":"No class!...it really starts at home","post_message":"Arizona high school students' racism even offends Arizona"},{"comment_id":"10153101656568717","commenter_b":"You call that a women?","commenter_a":"I was always taught that women are to be loved honored and respected. So she hit him any Real man would have walked away and let the cops handle it","post_message":"This video may be hard to watch. Officials in Florida released surveillance video of Florida State University quarterback De'Andre Johnson punching a woman in the face: @webpagelink Johnson was dismissed by the team today: @webpagelink"},{"comment_id":"10152922358545927","commenter_b":"PLEASE GET RID OF THIS TRAITOR NOW.","commenter_a":"This guy is quickly becoming a fossil himself.","post_message":"Obama VOWS to \"convene other nations to meet THIS threat. ...\" Can you guess what \"THREAT\" Obama is trying to combat?"},{"comment_id":"484838455040068","commenter_b":"Yes, ban Sharia Law in the USA","commenter_a":"I hope tsa patted her down throughly to make sure she wasn't carry bombs, I think the whole thing is a set up!","post_message":"She walked on the plane wearing her Hijab, boy was that a mistake. Shariah Law is dangerous, we support the patriots that stand against it. Should Shariah be banned in all 50 states?"}]
