[{"comment_id":"10150572291974999","commenter_b":"Ok head in a pressure cooker, she chop the guy? that is cold, women have alternatives like \"the police\", runing away, any place she runs to will be better than prison for life or death. So she did the crime, now do the punishment she had her choice.","commenter_a":"....she killed the guy, put his head in a pressure cooker and then chop the rest of him before telling anybody. Do you know how long that must have been? china did exactly what was right and her sentence isnt harsh at all. Anyone asking for a lighter sentence is out of their mind. She needs to sit in jail for a while and maybe see a head doctor.","post_message":"Women in China who killed abusive spouses were once routinely executed, but as the scale of domestic violence began to emerge in the early 2000s — officials say one in four marriages is affected, activists say one in three — lengthy prison sentences became the norm instead."},{"comment_id":"10154596744362439","commenter_b":"Shoot that prick.","commenter_a":"so WE GIVE UP ON YOU BASTARD.","post_message":"That's why Europeans have to give up on the EU, if they hope to survive."},{"comment_id":"585837851590068","commenter_b":"Unlike Hillary taking the china!","commenter_a":"No matter your political views, Mrs. Reagan always showed great class and dignity to the Whitehouse. The love for her husband was extraordinary. May you rest in peace.","post_message":"Nancy Reagan died this morning of congestive heart failure at the age of 94. She will be buried at the Ronald Reagan Presidential Library in Simi Valley, California, next to her husband. @webpagelink"},{"comment_id":"10152961665786336","commenter_b":"Why would any of you morons disagree with Dr. Carson? As long as kids get vaccinated and as long as adults have already been vaccinated this Country can be protected from these diseases. Time for Obama to guarantee that anyone illegal immigrant be vaccinated...","commenter_a":"Just another reason why we need to CLOSE the borders, ENFORCE the laws already on the books and DEPORT all illegals. That means, NO AMNESTY for anyone.","post_message":"Fox News Sunday EXCLUSIVE: Dr. Ben Carson joins Chris Wallace with his stance on the vaccine debate and his plans for 2016. Check your local listings or tune in to Fox News Channel at 2p and 6p ET."},{"comment_id":"1684200761639665","commenter_b":"Like I said, she looks like an old hag.","commenter_a":"My gosh, she only 49 years old and looks much older.","post_message":"Kellyanne Conway breaks out her bathing suit as she manages to sneak away from Team Trump for a brief family vacation"},{"comment_id":"10154587626459411","commenter_b":"holding a sign for 20 minutes ,","commenter_a":"Mishelle obama cares for them, #bring back our girls :D","post_message":"'No one cares for us'"},{"comment_id":"1901824630047376","commenter_b":"Meant to be","commenter_a":"Catherine her name... :)","post_message":"She’s a Republican college student and she’s proof that marching is about more than politics. #WomensMarch"}]
