[{"comment_id":"10155292076102501","commenter_b":"can't we keep her out of this state somehow? I tihnk every time I see her kids commercial how many unborn infants have died because of her support for abortion. Protect kids? Get serious lieing Hillary","commenter_a":". --------------------------------------------------------------------- HILLARY - BREAKING THE GLASS CEILING? --------------------------------------------------------------------- Mrs. Clinton, how can I possibly tell my daughter to follow you as an example after you allowed your husband to assault and demean multiple women throughout his political career? Were those women not important? Tell me, will you fight for my rights like you fought for those womens? Ummmm, I hope not. What about the sisterhood, Mrs. Clinton? Did you expose your husband for his abuse? No! Instead, you enabled him as the abuser and tried to silence his victims. How can you live with yourself? Female empowerment? ......... Nice try!","post_message":"Hillary is coming back."},{"comment_id":"10152882725317807","commenter_b":"More trolling stupidity. Shuster, you are pitiful.","commenter_a":"Does this give you pause @username??????@webpagelink","post_message":"It’s tax day, but the American people certainly don’t need another reminder that the federal government is taking too much of their money.    In what ways do you believe government is over taxing you?"},{"comment_id":"941291755930573","commenter_b":"Women are just as bad..","commenter_a":"Men are pigs","post_message":"She reported them to police because she said it made her walk to work an 'awful experience'"},{"comment_id":"10154240769776438","commenter_b":"@username No. You're being dishonest. The \"second amendment solution\" is to use the guns to kill people, and he was talking about his followers killing Secretary Clinton, and he was talking about his followers killing the judges she will appoint as President. You can try to say that he didn't actually think they would follow his advice, but you can't say that isn't what the words mean.","commenter_a":"Hmm I wonder if he's talking about the NRA? Taking things out of context, as usual","post_message":"\"Nothing you can do folk—although, the Second Amendment people, maybe there is, I don't know.”"},{"comment_id":"10153763916386320","commenter_b":"Who cares? All cops should spend one day arresting all the illegals in NJ and we wouldn't have this problem. All illegals should be made uncomfortable by cops and regular citizens alike.","commenter_a":"and again until you've walked in a cops shoes you don't know what it's like! They deal with scum of the earth a lot and there hands are basically tied. It's a shame and it's frustrating. I did not watch the video and I don't plan too. I'm Sick and tired of orople picking on the cops. Yes I'm sure there are some that aren't the best but most of the cops are good. Start celebrating the good cops for a change!! But sadly no one seems to be recording when they are doing something good","post_message":"A New Jersey cop goes off and is caught on video saying racial comments to three Latinos. Watch here: @webpagelink"},{"comment_id":"10155021805082501","commenter_b":"He's a Big joke andhorrible mouth. When General's don't approve of him how can YOU?","commenter_a":"Your headline should be Duck Femocracy. The DC elite do not get to elect our President.","post_message":"Ted Diadiun: We are on the precipice of a catastrophic national political decision as we prepare to elect our 45th president."},{"comment_id":"10154877505644351","commenter_b":"Build it electrify it arm the wall with automatic weapons cameras night vision electrify deep into the ground to kill tunnellers pass new deportTion laws make it a felonie criminal act to border hop punishable by years in a very bad prison","commenter_a":"His whole campaign was based on building a wall!! Of course he should, we need secure borders!!","post_message":"Thoughts?"}]
