[{"comment_id":"10153933179656509","commenter_b":"Lol see what I mean? \"White people do this all the time.\"","commenter_a":"Who could do such a thing? I don't want to hear that mental illness mess either. Lethal injection time.","post_message":"The suspect broke into the house and handcuffed the victims in their bedrooms -- and then shot them, authorities said. @webpagelink"},{"comment_id":"1202757773119671","commenter_b":"Yes Ivanka Trump would not be anywhere without her rich daddy!","commenter_a":"If it was not for her family name no one would listen to a word this really stupid spoiled brat has to say. You actually have to do something or have accomplished something to be a voice worth listening to and this twit as done nothing. Additionally hanging around with a child molester like Dunham shows just how pathetic she is.","post_message":"Chelsea Clinton tried to shame Ivanka Trump on live TV, but it immediately blew up in her FACE! This proves that Hillary Clinton has NO CHANCE!   Let's get 3,000 SHARES to show that we don't need a Clinton anywhere near a position of power!"},{"comment_id":"10152634683050779","commenter_b":"Could be great, i hope so.","commenter_a":"Woohoo!!","post_message":"In a stunning announcement today, Blur have revealed plans to release their first new album in over a dozen years, titled 'The Magic Whip.' UPDATE: Click through to listen to the new song \"Go Out\" and see the track list for the album."},{"comment_id":"555357001316722","commenter_b":"@username open your eyes hill right hand person Muslim female yea so Trump might not be perfect or what this country really wants but he is 100 times better then hillary","commenter_a":"Mitt I actually liked you and voted for you! Thank you for giving me even more reasons to vote for an outsider! All of you politicians disgust me and are hypocrites! #trump2016","post_message":"WATCH: Mitt Romney slammed Donald J. Trump as \"a fraud\" and called on the 2016 GOP candidate to release his tax returns.  What do you think of Romney's speech? @webpagelink"},{"comment_id":"1030700923658691","commenter_b":"Muslim invaders go back to your own country your not wanted here !!!!","commenter_a":"And just what the hell have you Muslims done to get rid of Isis who hijacked your religion?","post_message":"UNREAL: Dearborn Muslims Protest In Support Of Syrian  And Against  In America  @webpagelink"},{"comment_id":"10153044647531680","commenter_b":"For such a homely woman, she certainly is getting a boat load of dates all of a sudden.","commenter_a":"Go ahead and meet her! Just turns off every moderate republican and makes him that much more of a joke.","post_message":"Ted Cruz, whose staff has been in touch with her lawyer, plans to visit Davis at the Carter County Detention Center, where she is being held, in the early afternoon."},{"comment_id":"444470795746949","commenter_b":"It's all about him he really doesn't care about us what a dick","commenter_a":"He has zero fuks to give.","post_message":"As 43 Americans are killed by tornadoes during the Christmas holiday, Obama golfs (again)..."}]
