[{"comment_id":"10153496846973132","commenter_b":"I highly doubt they kept having them JUST to have a girl.","commenter_a":"How selfish, to keep having kids only hoping for a gender. That 13th boy will someday realize he was only born because his parents hoped he'd be a girl.","post_message":"Maybe the 14th time's the charm?"},{"comment_id":"10154058218236770","commenter_b":"Procecute this women she just as dishonest as Hillary","commenter_a":"Obama tossed her under the bus. So much for loyalty.","post_message":"Attorney General Loretta Lynch is defending the FBI against allegations that the bureau mishandled investigations of email hacks of Democrats and focused too much attention on Hillary Clinton’s private email server."},{"comment_id":"10153165834319411","commenter_b":"Errrmm... only one that i can think of.","commenter_a":"Russian threat !! NATO's a war monger since its creation,based on Anglo Saxson ,Viking ,etc...of blood thirsty tribes !","post_message":""},{"comment_id":"10153192015881162","commenter_b":"Hell is too good of a place for her, bring her to me.","commenter_a":"They should have allowed me to drive her to hail. She wouldn't make it there.","post_message":"HORRIFIC: A mother is accused of stabbing her 4-year-old son and partially mutilating his genitals. Authorities say the 23-year-old woman then dragged him out and continued the assault in the driveway, beating the boy with a garden tool and slamming him to the ground.   FULL STORY: @webpagelink"},{"comment_id":"10152729868175667","commenter_b":"Oh calm yer tits..it's just fun","commenter_a":"I may stop following USA Today because of this specific post. The guy isn't even old enough to run and you're reporting it like its important, which just means you made a joke out of yourself.","post_message":"President Flame would be a pretty epic name. Just saying."},{"comment_id":"1734065923549548","commenter_b":"This is exactly why we shouldn't have zoo's . So that dumb mf could have been eaten. Probably would have fed a family of little lion cubs. Too bad it's a shame . Literally shot the lions for doing something completely natural smh","commenter_a":"I would have let him be eaten","post_message":"Poor lions :( Note: people suggesting that the keepers should have let the man be eaten will be banned. Mental illness is not a joke."},{"comment_id":"1201058653247496","commenter_b":"@username Yeah get rid of all laws because you don't like them, shoplifting, welfare and insurance fraud, ect... Do you even know what Jaywalking is where you live it why its a law?","commenter_a":"How about telling the entire story how he ran from the cop and tried to board that red bus in the picture while the cop was writing him a ticket... Also how you can hear the cop tell him to stop resisting while the kid was grabbing his baton. Oh because he doesn't feed your anti cop agenda?.","post_message":"Nine officers can be seen in the video, as an onlooker pleads 'He's just a kid!'"}]
