[{"comment_id":"853194554776798","commenter_b":"all illegals should be hunted down like animals captured and deported","commenter_a":"Send. Them. All. Back. Legal immigration only.","post_message":"\"I know it’s going to pass, and I know we’re going to be protected.” - Camila Trujillo, DREAMer"},{"comment_id":"10153111712291491","commenter_b":"Respectfully disagree. I like my women a pretty delicate flowers, but that's just me.","commenter_a":"She might be the all around inside/outside sexiest female of the 21st century!","post_message":"Ronda Rousey's next opponent: the box office."},{"comment_id":"1903950129833878","commenter_b":"@username It was stolen! Putin and Trump stole the election, doesn't your little brain understand this. A foreign dictator stole our election so that this con-man could be manipulated by an evil russian. Read!!","commenter_a":"Then come on Democrats, let's shut down America! Trump cannot make it to the White House!","post_message":"No doubt! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153049947289170","commenter_b":"From the info I have seen, they have entire areas that could just be surrounded and taken out......all those \"unsafe for non-muslims to enter\" areas......","commenter_a":"At least someone in power will acknowledge these Muslim terrorists need to be taken out! The problem is they have almost completely taken over France at this point. Apparently France has over 750 No-Go zones in which only Muslims are allowed to live and travel in these territories. Sadly the govern has let them take over like this.","post_message":"I guess this was some reality check."},{"comment_id":"10153672150997217","commenter_b":"Watch your tongue","commenter_a":"Most muslims hate gays yet have no problem seeing a murderous paedophile prophet as a role model for all mankind? That's f***ed up I'm sorry but it is.","post_message":"BREAKING: The suspect for the mass shooting at Pulse Orlando gay nightclub is 29-year-old Omar Mateen, the BBC understands. It is believed the US citizen was not on a \"terrorism watch list\"."},{"comment_id":"857390540965850","commenter_b":"I resent paying for any illegal immigrant through our tax money...It is fundamentally wrong and immoral to take away from the next generation of real Americans.... Obama is evil......how about taking care of our elderly, our Veterans and our AMERICAN children?","commenter_a":"thanks obama","post_message":"This is insane, no rational government would do this, or am I off base on this one?"},{"comment_id":"10152823352857093","commenter_b":"Manslaughter is manslaughter no matter who you are or what you got...","commenter_a":"I think she's disoriented by her cash! Not the crash..man so a if","post_message":"YOUR TURN: Nicole Hutchison faces an intoxication manslaughter charge, accused of hitting and killing a TXDOT worker on U.S. 75 Central. Police say she told them she was wealthy, they would regret arresting her & asked about her 3 dogs but not the victim. Her attorney says she was disoriented by the chain reaction crash... WATCH: @webpagelink READ: @webpagelink"}]
