[{"comment_id":"1406868092703665","commenter_b":"Get back here with my food mother fucker!","commenter_a":"Christopher. Stop allowing the americans access!","post_message":"Does the US government want a war with Russia?"},{"comment_id":"2077791549112023","commenter_b":"@username, They are both illegal, just being born here doesn't mean a thing if your parents are illegal to begin with. 2 illegals cannot make a legal.","commenter_a":"How did she get there? If she had to fly? I don't fly, don't you need an Id and if she has a letter to be deported, how does this work?","post_message":"Democrats just got busted violating federal law at the DNC convention. This is HUGE, but apparently the law doesn't apply to Democrats. Can you imagine if a Republican had done this?"},{"comment_id":"10152783223285667","commenter_b":"I wondered what happened to the bikes. Bike sale soon????","commenter_a":"Yes and they have confiscated over 150 bikes..Bikers are pissed off","post_message":"Some of the dead and wounded may have been shot by officers responding to the bedlam, a Waco police spokesman said."},{"comment_id":"10154307369739099","commenter_b":"Well a attack on citizens is a attack on all of us as well punk","commenter_a":"So DeBlasio you're still going to give criminals a free pass you hypocrite ?","post_message":"\"An attack on our police is an attack on all of us,\" Mayor de Blasio said @webpagelink"},{"comment_id":"1276379159041275","commenter_b":"Thank you for showing the American people what a corrupt lying bitch she is","commenter_a":"I think you should give this guy some kind of a metal for Honor possibly a fruit basket!","post_message":"Ohhhh boy..."},{"comment_id":"974683422567079","commenter_b":"Ignore this woman! NWO!","commenter_a":"The people that surround her, and adore her, are walking dead at best....gonna be a blast to watch her debate a Socialist in the Democratic debate, hope the POS screws up royally.","post_message":"PROOF that the liberal media is in the bag for Hillary!"},{"comment_id":"10156613595445354","commenter_b":"I'm amazed at how ignorant she is!!!","commenter_a":"Wasserman Schultz is what you cal and air head. The elivator does not reach the top floor.","post_message":"\"...it’s incumbent upon us to stand with our Muslim brothers and sisters and make sure that we can push back hard...\""}]
