[{"comment_id":"1244207775611835","commenter_b":"That's why she wants to let them all in and use up our benefits and drain it. Enough is enough.","commenter_a":"Well just in case you needed another reason to NOT vote for Hillary here it is. But sadly, this nation is over run with uneducated and uninformed voters who will vote for free stuff that is anything but free to to american taxpayer.","post_message":"Obama used executive actions to grant amnesty to millions of illegal immigrants WITHOUT Congressional approval. Hillary Clinton says she will go EVEN FURTHER!"},{"comment_id":"1313639405344510","commenter_b":"Saudi is the most corrupt and evil country in the world. Where else are women banned from doing anything? Even worse than North Korea. And yet, Hillary took money from them and her supporters love to cry \"sexism!\" One Nation under God \"there is no one like our God\" Jesus, Amen. We don't need any Islamic states in American","commenter_a":"Saudi is the most corrupt and evil country in the world. Where else are women banned from doing anything? Even worse than North Korea. And yet, Hillary took money from them and her supporters love to cry \"sexism!\" One Nation under God \"there is no one like our God\" Jesus, Amen. We don't need any Islamic states in American","post_message":"U.S. president-elect Donald Trump’s recent cabinet appointments had drawn harsh criticism from civil rights campaigners. The cabinet picks have, however, earned praise from white supremacists and neo-Nazis. What do you think about his cabinet? Join us on #presstvdebate at 18:33 GMT"},{"comment_id":"10153365455244087","commenter_b":"@username , that is BULLSHIT! They purchased the assault rifles they used IN CALIFORNIA!","commenter_a":"No one has lost any rights to guns under Obama. No one has had any guns taken away under Obama. If ONLY the right wing could learn to try to GOVERN instead of just doing things that appeal to their right wing base, that would be just great!","post_message":"“Coming in the wake of the terror attack here in Paris, this horrific murder underscores we are at a time of war,” Sen. Ted Cruz said yesterday. “Whether or not the current administration realizes it or is willing to acknowledge it, our enemies are at war with us.\""},{"comment_id":"10153126119146770","commenter_b":"You aint no Woman Be otch","commenter_a":"What a joke, your no hero you did this by choice!","post_message":"Protesters hurled insults at Caitlyn Jenner as he left a Chicago hotel yesterday."},{"comment_id":"10153007291820667","commenter_b":"yes... weed is as bad as crack. and if they made crack legal, will you or anyone you know start using it? if not why? its legal.... everyone will use it if its legal....","commenter_a":"Crack Cocaine is next! Woo hoo!","post_message":"Cloudy with a chance of pot smoke."},{"comment_id":"1801521536786663","commenter_b":"We can send all the \"safe space\" cry babies here. It will be perfect Trump will just need a longer wall. Oregon? You want in on this? Please speak up before we order materials for the wall","commenter_a":"Please do.","post_message":"The group said they plan to seek independence through the United Nations."},{"comment_id":"1270965036267418","commenter_b":"This poor dear is fighting an incurable disease and still want's to see American go back to being a great Nation again. Hillary keep you porn star and all the other jokers you can muster up. Melissa never give up dear, God can do miracles. Thanks for being a strong and down to earth women, unlike Hillary's choice of women.","commenter_a":"Rick Webb","post_message":"Former Miss Wisconsin USA Melissa Young, who is battling an incurable and fatal condition, said a note from Donald J. Trump in her darkest days reminded her that \"my purpose is to fight and I need to get up and fight.\""}]
