[{"comment_id":"910131575844085","commenter_b":"It should NOT be given to illegal aliens #1. It should not be a life time money train #2.","commenter_a":"Unfair.The middle class working people can no longer pay for these people to watch TV all day and do nothing. Now when we die out because of Obamcare.they too will die behind us.","post_message":"Welfare recipients just got hit with some devestating news. The party is coming to crashing halt. Do you think it should be illegal to live off other people's hard work?"},{"comment_id":"10153259644748984","commenter_b":"Counting the days when that POS Imam con black theologist of hate is out of our WH!","commenter_a":"Can you say\" concealed carry\"?","post_message":"Let's hope police catch this creep and wipe that cocky smile off his face!"},{"comment_id":"1512598459048144","commenter_b":"Your the dumb ass!!","commenter_a":"You people are stupid if you think illegal immigrants get assistance. They stay in hiding so that they don't get caught and sent back. They can't get assistance without a social security card. Stop listening to dumb ass Trump.","post_message":"Trump says his plan to build a wall at the border is absolutely not negotiable. Do you support or oppose the wall?"},{"comment_id":"1150660831667337","commenter_b":"@username shut up fatass hoe","commenter_a":"America was built on hate! Just ask the Indians.... oh wait it's hard to find any because the white man almost killed off the whole entire race for land?? Land that was never theirs?? Land that is foreign to them? Oh and we are the savages?","post_message":"Good question #Philippines #WSHH"},{"comment_id":"10153264316296336","commenter_b":"Civil liberties can cram it where the sun don't shine! Freedom of speech for ALL.","commenter_a":"How about this group goes f@$#s it self","post_message":"A civil liberties group says this United States Air Force general should be court-martialed for speaking about how God has guided his career."},{"comment_id":"10153937473666336","commenter_b":"Michell is NOT a woman.","commenter_a":"PU$$ Y !!!","post_message":"\"You help keep us free. You help keep us strong. Whatever service you're in, whatever branch, we are extraordinarily grateful for everything that you do every single day.\" – President Barack Obama"},{"comment_id":"10154404367061037","commenter_b":"Get a life lady","commenter_a":"When trump loses I wonder what the trump voters that have outed themselves as racists and bullies are going to do, double down or deny it.","post_message":"Is Donald J. Trump's historic presidential run doomed to fail?"}]
