[{"comment_id":"992247137464743","commenter_b":"The women that hate Amber Rose are either ugly or fat or both. A secure woman has NO REASON to hate on another woman.","commenter_a":"I love seeing a post about 2 women making a serious public statement about the hate women recieve and then reading nothing but hate on those 2 women (BY OTHER WOMEN) in the comments.........","post_message":"Jaw-dropping. #VMAs"},{"comment_id":"10153308747171037","commenter_b":"Failing to report 1,100 donations and $145 million in donations isn't sinister. It's just a small bookkeeping error. This is how totally out of touch this moron and his wife are.","commenter_a":"And, I did not have sexual relations with that lady, Miss Lewinski.","post_message":"Former President Bill Clinton used his first interview since Hillary Clinton announced her 2016 campaign to address questions about the Clinton Foundation - by Dylan Stableford in Yahoo Politics."},{"comment_id":"1115766885107801","commenter_b":"Carly Fiorina is so lame she should be charged for being a Phony! (Fake).","commenter_a":"Her comment alone discourages me from wanting to see more. SILLY","post_message":"Carly Fiorina used the opportunity to bring up the time President Obama once ate dog meat."},{"comment_id":"1787942078130672","commenter_b":"It's a good thing you are there, because you have no idea how evil and vile that woman is.","commenter_a":"I'm not from america , i live in morocco , but i hope from the bottom of my heart for clinton to win and she really deserves to be the president of the white house because if trump was elected he is gonna make america a hell place on the planet earth","post_message":"Barack Obama was elected the 44th President of the United States on this day 8 years ago."},{"comment_id":"1005304559506884","commenter_b":"@username wow dude! go tell that to china, india, russia...they pollute the air you breathe in an astronomically higher number , last i checked, the earth only has one atmosphere.","commenter_a":"God be with you and your team as you go forward for our great state of Kentucky.","post_message":"\"They bribe us with our own money to stick it to ourselves. And we will not do that anymore in the state of Kentucky.\""},{"comment_id":"10154038010859205","commenter_b":"That's because it turns out she actually is a nasty woman. With a lot to hide.","commenter_a":"Robbie Mook is a terrible liar. Look at that body language!","post_message":"A blog called “True Pundit” said there were reports of Hillary Clinton asking why the government couldn’t just assassinate Julian Assange via drone strike. Hillary Clinton’s denial is less than convincing."},{"comment_id":"1142218742523327","commenter_b":"No just Hillary now get back to your cat.","commenter_a":"They go together both fruit cakes","post_message":""}]
