[{"comment_id":"10153349843651051","commenter_b":"She's a stupid bitch","commenter_a":"Aunt Jen, your a money hungry twat.","post_message":"This aunt is suing her 12-year-old nephew for $127,000 over a hug."},{"comment_id":"925264027533346","commenter_b":"So skinny women aren't real?","commenter_a":"oh look real women","post_message":"Large ladies in lingerie are No Angels"},{"comment_id":"10152850999936813","commenter_b":"One thing that strikes me is how people obsess with the LGBT. For some reason it's \"all the Gay's fault\". If only we could get rid of them, all our world's social problems will be solved. NOTICE: YOU DO NOT SEE SIGNS SAYING: \"ADULTERERS/CHEATERS, WIFE BEATERS, ADDICTS, RAPISTS, CHILD MOLESTERS, LIARS, THIEVES, TERRORISTS, CORRUPT POLITICIANS & PASTORS WILL NOT BE SERVED OR ARE NOT WELCOME IN THIS STORE\". NONE! It's always the Gays....","commenter_a":"Actually let small businesses post these types of signs. This tells me to take my dollars elsewhere!","post_message":"Tennessee hardware store owner hangs a “no gays” sign in the front window. It's 2015, not the 1950's. @webpagelink"},{"comment_id":"10153734368245950","commenter_b":"Here's another dense one told all her life she's witty","commenter_a":"It sounds like some shyt white Americans did to build this country then brag and say they did. Then tell u get over it.just saying the story sounds familiar","post_message":"The captives were sometimes held in chains, whipped, beaten and threatened, underfed or made to eat off the ground, according to a statement."},{"comment_id":"1779395119015202","commenter_b":"So women have been successfully doing this for how long? Most cases of extreme pain can be resolved medically and if not that's why we accrue roughly 8 hours of sick time per month at standard full time jobs One cannot expect businesses to experience this loss of productivity and still want to retain female workers","commenter_a":"Emily Lynn Bowman","post_message":"(Note: Look at the women in the back left of this photo.)"},{"comment_id":"998929483475806","commenter_b":"Don't know why.He has much more intelligence than Trump","commenter_a":"Cruz will make a great president and trump vice p.","post_message":"Thank you, Ted Cruz!"},{"comment_id":"10154624417173010","commenter_b":"Water board this bitch daily then drown her","commenter_a":"Sorry. 21 years is not long enough. That baby is missing out on 80 or so years of Life. Dad is Missing out on 60 years with His son. That is NOT justice for that baby. I don't believe in an afterlife, but hers would Be incredibly cruel And dark.","post_message":"When the boy regained consciousness, she called the child's father to ask him to give up his custody rights. When he said no, she once again held the toddler's head underwater until he died, prosecutors said."}]
