[{"comment_id":"10152869358831336","commenter_b":"We should get rid of the Kkk. This is not their land either.","commenter_a":"We should Deport Obama and his Kind back to Kenya or where they all came from this is our Land Not their's!!!","post_message":"In Thursday’s Talking Points Memo, Bill O'Reilly asked: where is America's policy to fight the Islamic jihad?  Watch and weigh in: @webpagelink"},{"comment_id":"604853703036255","commenter_b":"HOW she could stand there and openly lie to those families is just beyond me!! That is one dangerous woman!!","commenter_a":"People will still vote for her. Don't they know what a evil heartless lying phony she is. Here we have a vet who knows the truth she left those men to die despite numerous calls for help none came under her watch. She lied about the video not only to Americans but she lied straight to the faces of the victims families. She knew it was a planned attack that night but no she went to bed and I'm sure she slept peacefully. But as she yelled at the hearings \"What difference does it make.\" Her supporters should watch this over and over this will show her true colors.","post_message":"He exposed Hillary!!!"},{"comment_id":"10152940333217061","commenter_b":"@username shes a hoe","commenter_a":"Hi Guys :) I'm Ashley :) 19 years <3 , I m Single and beautiful <3 girl <3 please like my page :) in 2 secs and i'll send you a friend request and inbox you <3 you will never regret, :( i promise you, please support me by just 1 like <3 1 Like (y) = 99 Help <3","post_message":"Police: Jake Lloyd, the actor known for his role as young Anakin Skywalker in 'Star Wars', arrested: @webpagelink"},{"comment_id":"1123039051096182","commenter_b":"@username Y u so MAD!","commenter_a":"Everyone who verbally attacks BLM are silent supporters of the kkk!! Show me why u hate BLM so much. Show us pics of the smiling around a dead white person or any other ethnic groups body!!! U can't so fuck u","post_message":"Lol: #Virginia #police pulls a woman over for driving without an ice cream cone!  #WSHH"},{"comment_id":"10153752215990575","commenter_b":"Better yet, deport them each and every one ASAP !!!","commenter_a":"Shoot everyone of them no more rape","post_message":"Good question!"},{"comment_id":"1355437474524022","commenter_b":"Open season. Was Michelle off limits for you? No? Then neither should this ex porn model.","commenter_a":"Funny, not funny.... Who's paying for the wall? Mexico Mexic Mexi Mex Me.","post_message":"Today we celebrate one week since making history with the swearing-in of President Donald J. Trump and Vice President Pence! Watch the unforgettable inauguration:  @webpagelink"},{"comment_id":"10154425895814087","commenter_b":"Let's all pretend Byrd didn't flip on racial issues. Let's pretend he didn't become a staunch advocate for civil rights. Byrd was honored by the NAACP. Your meme is fucking stupid.","commenter_a":"NEWS FLASH !!!! The only people happy with Trump are the ones that hide under sheets and dunce caps, while molesting children and raping disabled people, while burning crosses and churches! ! THIS IS BULLSHIT! !! LOCK TRAITOR TRUMP UP FOR TREASON! !!","post_message":"A spokesman for music producer Quincy Jones -- a Hillary Clinton supporter -- says he will not be attending Trump’s New Year’s Eve party and doesn't know why the Trump team said he would."}]
