[{"comment_id":"10153913650358010","commenter_b":"Male, female, you are still a crazy bitch.","commenter_a":"Bill Clinton is the WHITE BILL COSBY and she is a LIAR","post_message":"We're 309 days away from Election Day."},{"comment_id":"10154504498488655","commenter_b":"@username You can tell 84Lumber just how much we don't need illegal immigration: www.84Lumber. com","commenter_a":"Hmmm if they wanted to show people on the path to becoming legal Americans, why didn't they show them going to the embassy and applying for a visa? Some dramatic music while they fill out paperwork","post_message":"Who didn't see right through that?"},{"comment_id":"10153134555889753","commenter_b":"They should lock her down before she kills some one.","commenter_a":"Yes! This was a full on assault! When there is a minor present it is a felony. She should be tried to the fullest extent of the law!","post_message":"Do you think this teen should be tried as an adult?"},{"comment_id":"1062077417179756","commenter_b":"She is a fraud !","commenter_a":"bad squaw","post_message":"WATCH: CHEROKEE PEOPLE Express Disgust Over \"Lying\" Elizabeth Warren Faking \"Native American Heritage\" To Get Prestigious Law Professor Job [VIDEO] @webpagelink"},{"comment_id":"1009117072471350","commenter_b":"How typical for illegals to play the race card while obviously not understanding the term racist.","commenter_a":"No one in their right mind should support Trump","post_message":"Add Lindsey Graham to the list of Republicans who say they will not support Donald J. Trump."},{"comment_id":"1800766070155339","commenter_b":"#NeverHillary #Hillaryforprison","commenter_a":"we are all trapped","post_message":"Hillary Clinton just became the first female presidential nominee of a major party. Here's the reaction on the floor."},{"comment_id":"10153097402831748","commenter_b":"Michael Savage you are an ignorant swine prejudice d Jewish imigrant not worthy of comment. You are inciting racial war!","commenter_a":"And you may as well be...oh hell-I can't think of anyone that I want to insult that badly. You are in your very own camp of What-the-hell??","post_message":"Michael Savage asserts \"[Obama] may as well be Charles Manson” for inciting racial tension in America."}]
