[{"comment_id":"557055264492970","commenter_b":"What scum bunnies.","commenter_a":"It should be simple, if you don't vote, then don't complain! But it seems the ones who didn't vote, are the ones crying, whining, rioting and be rude!","post_message":"\"That's sort of amusing,\" Donald J. Trump senior adviser Kellyanne Conway tweeted."},{"comment_id":"10152765303355950","commenter_b":"@username, \"Ridiculous comment. The complete opposite of what we should take away from this as feminists. Imagine what would happen if all of the barricades were removed & women could advance the way men do. Even more women would be standing where she is.\" Okay, so support your putative position with evidence, versus just asserting it like your job is done.","commenter_a":"Great! Now feminists can see that it is by working hard, getting really lucky, and not giving up that we are best equipped to fulfill our dreams, rather than trying to reengineer society... like the whole thing is just broken. Even the grass can get through concrete... with enough time and the right conditions.","post_message":"At 19 years old, Elizabeth Holmes dropped out of college. She had a little money and a big idea. More than a decade later, she became the youngest female billionaire in the world."},{"comment_id":"955377877852075","commenter_b":"Most corrupt woman in American history.","commenter_a":"Hillary is not only the MOST QUALIFIED candidate for president, she is an American shero. She has done and continues to do so much for our country and its people. I know she will create jobs, equality and so much more. Go Hillary, go!!","post_message":"Hillary has spent her entire life standing up for kids and families. That's why she's running for president. Watch one of our first TV ads of the 2016 campaign:"},{"comment_id":"10153627054797217","commenter_b":"They were one of the best armys when Saddam was in power. Everything in Iraq lost its glory after him.","commenter_a":"It's a shame the Iraqi army is so awful otherwise they may actually succeed.","post_message":"To retake Falluja from the so-called Islamic State."},{"comment_id":"10153994248378132","commenter_b":"Illegals. Not immigrants.","commenter_a":"Ironic to be married to someone with such disdain for immigrants.","post_message":"Barbara Walters says she was surprised by Melania Trump."},{"comment_id":"10152700445176051","commenter_b":"Another snobby bitch","commenter_a":"You guys are all assholes siding with the trailer woman... There goes the neighborhood ... These answers talk about what has happened to the country... If you want to live in a trashy neighborhood, move to one. Don't trash up the one you are in due to your own selfishness...","post_message":"When this woman saw a note one of her neighbors left for her, she couldn’t believe it."},{"comment_id":"10153215864872235","commenter_b":"She's just making up the rules as she goes along.","commenter_a":"200,000 dollars so they can keep serving shitty pizza! Yay! Everybody wins!","post_message":"Someone needs to drink a big, tall glass of STFU juice at this point."}]
