[{"comment_id":"10152723762841545","commenter_b":"WE OCCUPY THEIR COUNTRIES FOR MONEY!!!!!!!! how would you feel if that happened here. we had foreign soliders occupy us for 10 years for the elite to make more money based on lies!","commenter_a":"The more you know liberals","post_message":"Three students from campuses including University of North Texas, University of Texas at Arlington, and at University of Texas at Dallas each reported being the targets of anti-Muslim threats this week."},{"comment_id":"2053445024754213","commenter_b":"Just the opposite he carry a 3.95 GPA and has all he life. he Just married that MUSLIM pile of pig shit and was told by Obama you need to rebel.","commenter_a":"He probably doesn't know how to read or write.","post_message":""},{"comment_id":"863959926995293","commenter_b":"Denise Lange-Baker ugly ugly ugly. @username stupid stupid stupid. Denise & Tim inbreeding at it's best","commenter_a":"Sen Blunt does it hurt to be so stupid. I imagine it must hurt","post_message":"I’m proud to co-sponsor Senator Johnson’s bill to stop President Obama’s lawless #immigration power grab. I’ll continue to working with my colleagues in the House and Senate to fight against the president’s executive amnesty and his blatant disregard for the law and the Constitution. #StopObamasAmnesty"},{"comment_id":"939719642754180","commenter_b":"Or he could just drop dead and save his family the embarrassment and the courts the cost.","commenter_a":"IF any of this is even true, if you waited this many years, you own it. Grow up.","post_message":"The once beloved comedian will hopefully not get away with his alleged horrific crimes against women."},{"comment_id":"10153020526397464","commenter_b":"STAND FOR PRINCIPLE or lose America!","commenter_a":"Either the Republican party morphs into liberatrian values or even conservative values, I see no reason to continue to throw away my votes on them. As it stands now, the difference between Republicans and Democrats is hard to see. They are BOTH for bloated Federal Government way beyond it's constiutional limits.","post_message":"We are facing a fundamental decision for our country.   Do we go back to the same old, same old or do we stand for principle? #SCTeaParty15"},{"comment_id":"10157552769965725","commenter_b":"IF YOU SAW HANNITY'S TOWNHALL WITH MR. TRUMP TONIGHT- NO PARENT WOULD VOTE FOR KILLARY!! #BUILDTHATWALL!","commenter_a":"I mean that's true, but what are you going to do about that? I guess grow a garden, but then you can only harvest every year, maybe twice a year if you plant early","post_message":"Thank you TEXAS!  We are going to declare our independence from failures of the past and create a New American Future.   Once again, we will have a government of, by, and for the people. Americanism, not globalism, will be our credo."},{"comment_id":"1095502743841518","commenter_b":"Jenny Davis so sorry you are correct. It was friends nothing to show.","commenter_a":"Lets all stand behind trump, the winner of the republican party!","post_message":"Who do you think Donald J. Trump should choose as his running mate?"}]
