[{"comment_id":"1189205214435858","commenter_b":"Go suck or the black dicks racist bitch","commenter_a":"Look black on black crime is the number death rate among blacks! They need to talk to each other. They also need to fix their family unit, that's how young kids make it in life!","post_message":"#BlackLivesMatter were not happy with this speech"},{"comment_id":"10154334657668797","commenter_b":"I'LL SKIN THAT DOG AN THROW IT ON THE GRILL FOR DINNER. .. MMMMM MMMMM MMMMM DOG.....","commenter_a":"The newest FB trend....disabled animals as \"news.\"","post_message":"LIFE ROLLS ON: A puppy born without front legs was found abandoned and shivering in a cardboard box on a busy street. But now, she has her very own set of wheels to get around! See here:"},{"comment_id":"10153903960665329","commenter_b":"Wtf!!! She don't play","commenter_a":"This is hilarious. @username Maria Maldonado","post_message":"#goals"},{"comment_id":"992365204151742","commenter_b":"Since the dawn of evolved time mankind has migrated so that won't stop. I agree the need know who is entering the nation if I remember a European country found that immigrants were part of protest. And terrorist will use this to build cells to attack. However I don't see how Trump will get Gulf States to build security safe zone since the 'fountain is running dry' or maybe he will reignite the polluting of the environment with fossil fuels and take action to get fossils prices back to 110 which will create more bad than good but greedy and gluttony will prosper. His positions may have down sides for any real growth. And I agree that America needs to stop providing bulk funding, to the UN and other, let the world let the new imperialists do it and they, US, rebuild and make the world positive, green, clean and ...","commenter_a":"Republican Party souls have been sold to highest bidders, \"The Sneaky Wolves\". Lincoln Party is officially dead. So sad, Republican primary election is fraud, unfair and rigged, it seems every bigot and racist hiding behind the conservatism came out the closet to poisoned the election process in order to hijacked the Republican Party. I feel sorry for the gullible and naive Republicans who have been mislead, bluffed, lied and manipulated. Trump’s gang for hostile takeover of Republican Party maybe the worst case scenario in the American political history. Thanks a lot media for giving Trump’s gang free ride. Media is sold out to the highest bidders and freedom of press is no longer relevant to corrupt bosses and greedy investors Not again, another Hitler era, never again. @webpagelink Going in and out of building makes a person a Christian no more than going in and out of a barn makes ...","post_message":"“No. I would not allow people to come in from Syria. They’re not vetted properly. They’re moving in by the thousands.” Donald J. Trump reaffirmed his commitment to a ban on Muslims immigrating to the United States, arguing that it is better to build \"safe zones\" in Syria. What do you think?"},{"comment_id":"10154767294838812","commenter_b":"she or her family must be here illegal...u guys go back to where u came from and come back the right way..","commenter_a":"Someone please throw a bucket of water on this witch!!!!","post_message":"Hillary Clinton: \"What would Ronald Reagan say about a Republican nominee who attacks America's generals and heaps praise on Russia's president? I think we know the answer.\" @webpagelink"},{"comment_id":"1073538729332546","commenter_b":"Terri must not have kids to make a statement like she or he made. Shame on you putting the blame on the mother.","commenter_a":"School needs to be held accountable and the bus driver for forcing her off. This can never happen to another child. They are lucky the right person found this child and returned her.","post_message":"A #Seattle bus driver is now off his route --- after a 7-year-old was found wandering Capitol Hill, crying. >> kiro.tv/WrongStop"},{"comment_id":"10154876629414411","commenter_b":"Ĺol Canada doesn't care. Second biggest land mass on Earth, only 40 million people live here. We will put all the Americant's a few hundred km north west of Alaska. Enjoy the polar bears bitches.","commenter_a":"Please send him to Mars! We Canadians don't need this dickhead in our beautiful country...","post_message":""}]
