[{"comment_id":"10153477964755575","commenter_b":"I'm in true awe at how people react to situations. I am physically sick at what these murderers are doing and GETTING AWAY WITH IT. What kind of people are we to sit back and let the government ruin our lives. You saw, as Americans, how much power we have when Megyn Kelly attacked Donald J. Trump. Why aren't we furious about ISIS and demanded our government eliminate them all. obama has done an excellent job on turning American people against one another an will continue to do so as long as WE allow it. Its time people. Stand up and voice your opinion and tell obama that this is WRONG. WE have the Power......Use it.","commenter_a":"This crap needs to be stopped, let the Marines do it...","post_message":"The Gateway Pundit - ISIS Kidnaps Priest, Kills Him, Cuts Him into Pieces, Packs Him in Box and Sends Him Back Home"},{"comment_id":"10153564963769778","commenter_b":"Happy Birthday Andrew Thomas,thought you might like this. :D","commenter_a":"hahah xD oh i must watch i will feel the flow xD i know it!","post_message":"After reviewing dashcam footage, the Dover Police department in Delaware came across some interesting sights. \"We hope you enjoy this...and Taylor Swift, if you're watching...we're sorry.\""},{"comment_id":"945138485506331","commenter_b":"Ya skinny women are repulsive...","commenter_a":"why on earth would she? She's beautiful! When I was body building in my 20's I wore a size 10 & weighed 150lbs the muscles in my legs & back we big had to wear mens pant & shirts... now at 56yrs old I weigh 155lbs & wear a size 8. I can assure you I don't look likre I did in my 20's even though there is only 5lbs difference. Muscle is denser & takes up less space..curves are better than stick woman anyday","post_message":"She weighs 160 pounds, and no, she's not worried about her dating prospects at all. (via HuffPost Canada Living)"},{"comment_id":"10154523609503984","commenter_b":"oh, Spanish ought to set you off too, especially those who want to make it our official language, after all it was Spain that did the most detriment","commenter_a":"Cynthia, America is not racist. There are racist people that live in AMERICA. Obama is a race baiting man stop being BLIND. It was VERY INAPPROPRIATE for the speech he gave in Dallas. If anyone has the TRUE right to be angry about racism it is MY PEOPLE, NATIVE AMERICANS. I don't see any blacks living on reservations in America.","post_message":"This guy hits the nail on the head. I'm sure race baiting liberals will be fuming after watching this. A lot of people took aim at Michelle Obama in 2015, but no one hit the bullseye harder than he did..."},{"comment_id":"1166185690114851","commenter_b":"I agree Awesome comment thanks :/","commenter_a":"OG gives zero fucks","post_message":"Uber driver loses it after man smokes weed in his car"},{"comment_id":"1615919975382867","commenter_b":"Jake Jutras the first eagle has landed","commenter_a":"Virgil John Ariel John Monique John","post_message":"#BREAKING: The first eaglet has HATCHED! Harriet and her mate M15 were both at the nest during our first sighting of the eaglet, which is almost fully out of his or her shell. A New Year's Eve eaglet - SO EXCITING! Video: Southwest Florida Eagle Cam STORY: @webpagelink"},{"comment_id":"736610399801339","commenter_b":"Then vote for Jeb the choice of illegal aliens","commenter_a":"We need Trump to win and not another Bush.","post_message":"I'm running with heart and running to win. It¹s time to unite to defeat Hillary Clinton. Watch:"}]
