[{"comment_id":"744192892380562","commenter_b":"Jerome-- a mole? Are they all?","commenter_a":"Close the borders. With all due respect congressman, only idiots would even consider calling military age men \"refugees.\" Our borders have been poorly managed that it is impossible to tell who has infiltrated my America. Seems that Congress has chosen to remain totally mute on this issue. Obama bashing does not hide the fact that inaction equals compliance.","post_message":"It's frustrating that President Obama refuses to shift his strategy to defeat ISIS. The horrific attacks in Paris are evidence that the current strategy to defeat ISIS is not working. I discussed this earlier today on Fox Business' Varney & Co.. Watch below:"},{"comment_id":"10154001964165329","commenter_b":"yep these girls need to be fitted properly and get the right size!","commenter_a":"Dude half of them are in the wrong size & the VS bra featured isn't a push up, it has all over padding. This makes me want to give them all personalized lingerie sessions / lessons","post_message":"Do push-up bras actually work? And if they do, do they make us feel any better?"},{"comment_id":"10152925468786680","commenter_b":"Love is no ones business but the two who found it's bliss.","commenter_a":"Well, you could always just ignore it. Our government seems to be doing that alot lately. Like DC ignoring the Heller case.","post_message":"“It seems like the oppressor is now taking on the mentality of the oppressed.”"},{"comment_id":"1141174309285545","commenter_b":"PUT THESE RAGHEADS OUT IF THEY CAN'T COMPLY!!!","commenter_a":"No","post_message":"The military doesn't bend their rules for their soldiers. If you want to serve, then fall in line. Do you think our society has become too sensitive?"},{"comment_id":"10152858304201336","commenter_b":"Enough is enough time to start locking these mothers up. They think they can just take over everything","commenter_a":"Man why doesn't this stuff happen in areas I'm in? I would never try to shout these people down. I'm going to physically knock them down. I simply cannot stand, nor will tolerate, this level of open disrespect. You have a right to protest, my right to protest in return is my choice, by the means I choose necessary.","post_message":"The protesters did not stop shouting until 100-year-old U.S. Navy vet Dario Raschio spoke up and said, \"Give me a chance. At least let us show a little respect for this occasion.\""},{"comment_id":"982153291907152","commenter_b":"The wall wont be anywhere as effective as you think. All it will do is provide more cover for traffickers.","commenter_a":"Texas here! We NEED THAT WALL!! 1 million dollars worth of drugs just confiscated last week that came from Mexico! Happens ALL the time! It must stop!","post_message":"Watch: Donald J. Trump addresses the American Legion National Convention in Cincinnati, Ohio"},{"comment_id":"10154292885141037","commenter_b":"She will never get this vote!","commenter_a":"Democrat Hillary is most qualified, most knowledgeable, and most well informed. Please vote her. Thank. Socialist Bernie and his wife Jane dumped nuclear waste in America where poor Latino people live. Never vote for him Thanks. America: Never ever Trump please. Trump insulted men and women all and sundry.","post_message":"Mitt Romney is “very distraught about” Donald J. Trump, an adviser said. “He thinks Trump is this vulgar, dangerous, principle-less, value-less opportunist — putting it mildly.”"}]
