[{"comment_id":"563542197162994","commenter_b":"Dear black lady: it's stupid to do either example you gave. Way to drink the cool aid.","commenter_a":"Yesterday in Charlotte (As per Charlotte Police Chief--He's Black)Black man exits car with a gun in his hand, told to drop weapon and refuses....shot by a black police officer. Gun recovered....not a book. Stop the false narrative! Stop the Madness!!","post_message":"At least 12 officers and 5 demonstrators were injured in protests in Charlotte after a black man was shot and killed by police. Video shows protesters destroying a marked police vehicle."},{"comment_id":"1137409276317081","commenter_b":"Hillary threatened by a female!? The Republican Party just makes me laugh!","commenter_a":"Hillary Clinton threatened by Melania??? lol give me a break.","post_message":"\"It's just another example of... when Hillary Clinton is threatened by a female, the first thing she does is try to destroy the person\": Donald J. Trump's campaign manager Paul Manafort addresses allegations that Melania Trump's #GOPConvention speech was plagiarized @webpagelink"},{"comment_id":"1228736923813002","commenter_b":"poor womaan! jail is patently the wrong place for her....she requires help, not punishment!!!","commenter_a":"Monster.","post_message":"A 26-year-old woman on Monday expressed her indescribable pain and regret for the death of her newborn son whom she stuffed into a plastic bag after giving birth to him at her suburban Detroit workplace."},{"comment_id":"1865774367000002","commenter_b":"If you think that way then you should leave as well. This Country actually belongs to the Native Americans.","commenter_a":"I am a lifetime member of the Sons of the American Revolution. My ancestors landed in 1732 and father and son fought in the revolution. All of you republicans whose family landed AFTER that revolution are not \"pure Americans\" and must get MY permission to remain. Ban half breed Americans..only the descendants of REAL patriots may remain","post_message":"\"We're not going to shut up. We're going to resist.\""},{"comment_id":"10155353294040231","commenter_b":"Your mom is a monkey","commenter_a":"I'm going to leave this right here. #Unapologetic #BlackAgenda @webpagelink","post_message":"Yet another black person has become a hashtag after being killed by a police officer."},{"comment_id":"10152870129557093","commenter_b":"Omg this woman is so racist!!! Just watch! Lol @webpagelink","commenter_a":"He doesn't need to apologize! People need to learn how to act! And how to respect higher Authority. Life would be more peaceful if people just learned to act like decent people","post_message":"Attorney for McKinney Cpl. Casebolt said two suicide calls before pool party put him in \"emotional place\" .... said Casebolt apologizes to those offended by his actions.... @webpagelink"},{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."}]
