[{"comment_id":"581181075381182","commenter_b":"@username Many are 'insured' but access to care is more expensive than ever when you add copay, deductible, out of pocket, and actual cost of premium. These \"facts\" are manipulated to make the ACA look \"good\". In reality it is a tax, as defined by our own government.","commenter_a":"\"We’re forcing the president to confront the failures of this law once and for all\" - Speaker Paul Ryan","post_message":"Republicans in Congress used reconciliation to be able to get the Restoring Americans' Healthcare Freedom Reconciliation Act to the president."},{"comment_id":"10153711983118445","commenter_b":"Better take a look in the mirror you ugly bitch.","commenter_a":"Trump is a pig","post_message":"#Pot Matters: Trump on Drugs"},{"comment_id":"10153417590345329","commenter_b":"Nah,cause then feminists will bitch.","commenter_a":"Stop that already! Or make MomBodies a thing!","post_message":"DadBody goals right here via Leonardo DiCaprio."},{"comment_id":"10153016776944117","commenter_b":"Cause she was terrible. @webpagelink","commenter_a":"Because they are willing to sell out.","post_message":"From RUSH drummer Neal Peart to Rep. Paul Ryan to Uber CEO Travis Kalanick. Why do famous people deny that they admire Ayn Rand?"},{"comment_id":"10152776711902014","commenter_b":"Swatting twitch users I bet!","commenter_a":"#rekt","post_message":"A 17-year-old teen from Surprise has been arrested for several \"swatting\" incidentsin which she reported fake shootings and bomb threats."},{"comment_id":"499136410296158","commenter_b":"Go back to Mexico you trash","commenter_a":"Very disrespectful! I can say I'm embarrassed, what type of protest is this? I don't agree with Trump but I certainly don't agree with this. That guy in the white shirt with the Mexican flag under his hat is ridiculous. Obviously he does not know how to respond correctly and only starts welling stupid stuff. The only history they are making is to upset people to react upon their actions.","post_message":"Watch This Insane Reckless Trump Protester Nearly Kill People"},{"comment_id":"10153378197295950","commenter_b":"go home please","commenter_a":"When will she realize she is in the wrong party for the rights of women and minorities?","post_message":"\"I have battled breast cancer,\" Fiorina voice says in the ad as clips of the candidate at various campaign events play out. \"I have buried a child. I have read my Bible. I know the value of life.\""}]
