[{"comment_id":"1265082296896088","commenter_b":"Women get no opinion in Adolf Trump's amerikkka. So stfu and get back in the kitchen","commenter_a":"But not the recount in Detroit, where there r more votes than voters now. Not Russian--democratic votes.","post_message":"Trump supporters are calling the effort undemocratic. What do you think?"},{"comment_id":"10153088777412994","commenter_b":"Dan Bedford Hmm lol","commenter_a":"It was destiny.","post_message":"They've walked down the aisle together twice, but have only been married once."},{"comment_id":"984580881613100","commenter_b":"That will happen with or without Trump, so she can stfu !","commenter_a":"Maybe it wouldn't hurt to try her way. Just stop giving them the attention.","post_message":"Malala Launches Vicious Attack..."},{"comment_id":"10153567569125927","commenter_b":"The history of Islam counters everything he says about it. No surprise as he must have flunked history.","commenter_a":"pathological liar","post_message":"\"A perversion of Islam that has taken root ... that is appealing to even folks who don't necessarily know anything about Islam, and aren't even practicing Islam in any serious way ...\""},{"comment_id":"10153970352414087","commenter_b":"how many lies does that bitch have to tell before your eyes open? Or do you not care, is it all about the vagina's turn in the WH?","commenter_a":"more like clinton being suicidal (can only hope) watching her campaign going down in flames with all her lies","post_message":"\"Longtime ally of Paul Manafort, Trump's campaign manager: 'Manafort not challenging Trump anymore. Mailing it in. Staff suicidal,'\" CNBC reporter John Harwood tweeted."},{"comment_id":"1196791103694693","commenter_b":"David, better vote for anyone on the GOP side than voting for the criminal Hillary \"Cankles\" Clinton. The woman should be in prison.","commenter_a":"DO NOT be complacent. Progressives need to come out in the MILLIONS and vote. Otherwise, the Republicans/teaparty, who sold out to crazies who actually want to take a dump on the Constitution and make America a \"Christian\" Theocracy, will win.","post_message":"Republicans are losing ground in key demographics."},{"comment_id":"931005183682927","commenter_b":"Send that black bitch back to the jungle baby.. Yeeaaahhh","commenter_a":"Fire her. if she were white, she would already be gone.","post_message":"Sam's Club CEO made some serious anit-white racist comments. She thought it would slide under the radar because it was directed at white people. She was very wrong. Payback that is happening has been brutal and swift and she deserves it. Can we get 5,000 'LIKES' to fire this CEO for racism?"}]
