[{"comment_id":"1098939776819315","commenter_b":"Does your Mommy know she raised a selfish, irresponsible, inhumane twat?","commenter_a":"A good majority of those 31 thousand people that are shot to death are killed in self defense and line of duty shootings by police. So that number should be adjusted down. Many of those killed tried to kill some one else. Back to Abortion. End it. End it now for the love of God. I lost a child to abortion. I don't know how my ex-fiance goes to sleep at night.","post_message":"There is no outrage in the media regarding how many lives are taken by abortion."},{"comment_id":"1091727720848238","commenter_b":"Those people should be sterilized","commenter_a":"Everyone who is against this is a damn hippje","post_message":"This is HUGE news."},{"comment_id":"10154126114949877","commenter_b":"Off with her head!!!","commenter_a":"If it were my child, the white mother would be in a box today.","post_message":"White Mother Charged w/ Assault for Slapping Black Teen after Screaming N-Word. Watch how it all unfolded and the family's reaction below. Grio fam, can you imagine if this was your child? Sound off!"},{"comment_id":"10156323895095354","commenter_b":"@username Your not aware of everything that went on or was said. I \"ASSUME\" he told her to GET UP and being Defiant and Arrogant she decided \"I'LL DO WHAT I WANT TO DO\" . She should have STOPPED what she was doing when she was TOLD TO. It was Harsh but perhaps the rest of the Class learned a Lesson. Crap like she pulled Disrupt a Class ands children that WANT to LEARN can't.","commenter_a":"Yes good for the cop, if you do not like this then do what your told to do by the cops.","post_message":"The FBI and DOJ have jumped in..."},{"comment_id":"1033609543378017","commenter_b":"Arrested???? WE OWN THIS BUILDING!!!!, and ALL THE GOVEMRNNENT BUILDINGS. BOUGHT, BUILT AND MAINTAINED WITH OUR TAX $$$$$$$$","commenter_a":"Yes!!! #DemocracySpring is currently trending on Facebook!!!","post_message":"The Young Turks live from the Democracy Spring: Sit In. Save Democracy. protest in Washington, District of Columbia - The police are arresting people now."},{"comment_id":"10154198707121636","commenter_b":"You British slaves deserve this Royal domination and humiliation!! The King plus Queen rules slaves are always slaves!!","commenter_a":"The point is that the royal family could easily afford to pay for the renovations themselves. We have no money for the NHS, but plenty for this? How is that in any way fair?","post_message":"Money well spent?"},{"comment_id":"10153712165499138","commenter_b":"I'm not a hunter, however, anyone who eats meat has no right to be against hunting your own meat. At least the animals being hunted have a chance and have a good life in the wild. Anyone who eats grocery store meat should try going to the farm that the meat came from, those animals have it far worse than a dear dying from a quick shot.","commenter_a":"Stop this hunting that's what he gets","post_message":"A reminder worth sharing. Have a safe hunting season."}]
