[{"comment_id":"838459919590086","commenter_b":"Women who love Trump here.","commenter_a":"Montana here.","post_message":"LIVE NOW: Donald Trump expected to arrive at a 'Thank You Rally' in Cincinnati, Ohio soon. It's the first of several stops for the President-Elect's thank you tour."},{"comment_id":"1362072713808008","commenter_b":"ROTFLMFAO!!! Opine from the woman actually wearing an 'A$$' hat! You just CAN'T make this stuff up!","commenter_a":"The Judge is a lawyer for La Raza. He is literally a La Raza Grand Dragon.. He has literally helped many illegal immigrants break the law in this country. Donald Trump could go further and he didn't but when you start doing some digging this Judge doesn't seem like a very nice man. A lawyer for a group who has said many times to 'kill all white people'.. Okay.. Donald Trump could go further.. You may very well make him show his hand and there's a lot to show on this judge and the company he keeps. The ONLY racism here is of the judge and the people he represents. Imagine if the Judge was a KKK member presiding over a case that affected black men. You'd be outraged. You know you would. How is the Donald going to get a fair shake when the judge is soooo clearly biased ...","post_message":"By refusing to denounce Donald Trump’s attack on Judge Curiel for the racism it clearly connotes, it shows Senate Republican Leader Mitch McConnell is the poster boy for the Republican spinelessness that allowed Trump to be the Republican nominee for President of the United States.   Senator McConnell has so fully embraced Donald Trump that we are all unclear as to where Trump’s platform ends and Senate Republicans’ begins."},{"comment_id":"10153891687451782","commenter_b":"And what of Betty Shelby??? When will they lock that monster up? When will her day come?","commenter_a":"It is not over he may not but I saw a tweet today by a new elect and NY police are ready for several charges including the spirit dinners were those poor children are molested and then killed!! It may take time but all of them will be charged! Trump will be too busy to do it but their day will come!!","post_message":"President-elect Donald Trump's aide is suggesting that he will not pursue a probe of Hillary Clinton private email server in an effort to help her ;  @webpagelink"},{"comment_id":"10153174163477452","commenter_b":"he better not get fired. @username","commenter_a":"GET SOME!!!!","post_message":"Big Mac attack!   A McDonald's worker wasn't 'Lovin' it' when an irate and apparently drunken customer launched into a vicious attack at the drive-thru window. But the worker wasn't going down without a fight. abc7.la/1KYEgIq  It's just the latest case of a service worker attacked on the job."},{"comment_id":"10157235838770231","commenter_b":"Because they are white? And black thugs will get arrested because they are black very simple?","commenter_a":"Privileged, yes. I'm not convinced about the White part. Jameis Winston was accused of a much more serious crime but because he is an athlete he was shielded from those repercussions. And let's not even get into Bill Cosby.","post_message":"It must be nice to be white and entitled."},{"comment_id":"10155157892736729","commenter_b":"HILLARY LIED UNDER OATH SEVERAL TIMES- SHE TOOK FOREIGN BRIBES FOR CONTROL OVER OUR SOVEREIGN NATION- SHE DESTROYED EVIDENCE AFTER CONGRESS DEMANDED IT WITH A SUBPOENA- THOSE ARE REAL CRIMES- WE WOULD BE IN JAIL FOR- THE DEMOCRAT'S SAY COMEY IS SIDING WITH ONE SIDE OVER THE OTHER-FOR POLITICAL REASONS- BUT NOT THE FIRST TIME - WHEN HE WOULD NOT PROSECUTE CRIMINAL HILLARYS-BLATANT INTENTIONAL-CRIME SPREE- NO- ONLY NOW -THEY SAY IT- WHEN IT'S NOT GOOD FOR THEM- THIS NEW FBI INVESTIGATION- IS A JOKE- THEY WOULD HAVE ALREADY PUT HILLARY IN JAIL!!!! **WIKI LEAKS AND THE FBI-ALREADY HAVE ENOUGH EVIDENCE TO PUT HILLARY IN JAIL- THIS IS A SCAM- THIS IS JUST A DISTRACTION- SO HILLARY CAN SAY- SEE- THIS IS NONSENSE- THERE IS NOTHING THERE--CRIMINAL HILLARY HID EVERYTHING BUT NOW WANT'S IT OUT- I CALL BULLCRAP","commenter_a":"Kill yourself you fucking pig","post_message":"Amazing."},{"comment_id":"760057160777731","commenter_b":"Kick her off the force","commenter_a":"She should be sacked for that .How are Americans letting there country , that there relatives fought for .Letting this happen . You are been invaded ,don't you see this . They are Attacking you on your land ,they burn your flag and disrespect your ways ,I never thought Americans would stand for this .Has Obama destroyed America .","post_message":"Here's Islam in action, again. @webpagelink"}]
