[{"comment_id":"10153199114815950","commenter_b":"I'd pick up the deal with her in it and put her outside. Call her parents and tell them she's outside. She looked small enough. The cop lost his cool. Out smarter by a brat. Now he is fired and they will sue. Sad all around.","commenter_a":"I was raised very conservatively about manners and respect, and I agree that she was wrong for her actions. However, that deputy does not need to be a SRO if he is going to deal with students this way. It's unprofessional and disturbing.","post_message":"\"I was praying out loud for the girl and I just, I couldn't believe it was happening. I was just crying, and he was like, well since you've got so much to say you're coming too.\""},{"comment_id":"1001794969843293","commenter_b":"Feminism is cancer.","commenter_a":"Sorry lady but I put my arm around my wife because I lover her. She does the same to me and we have been married for 49 years. Maybe you ought to try a little bit of love instead of hate.","post_message":"The Dame has spoken."},{"comment_id":"1059645677404171","commenter_b":"Stop her","commenter_a":"Pero que no fueron capaces de pararlo...","post_message":"LIVE NOW: Police chase in Long Beach, CA."},{"comment_id":"10153881330947434","commenter_b":"So funny how some morons predict an armageddon just because their feminist messiah didn't win.","commenter_a":"Except for the fact that Jill is only asking for recounts in places where Trump won narrowly and has continually ignored asking for recounts in areas where Hillary won by even less votes. It's not about electoral integrity, it's about a woman having an infantile, foot stomping temper tantrum because she didn't get her own way.","post_message":"Jill Stein herself, standing across the street from Trump Tower, encouraged the president-elect to support her campaign’s efforts to ensure that every vote is accurately counted. “There is nothing to be afraid of,” Stein said, “if you believe in democracy.”"},{"comment_id":"1672686459685954","commenter_b":"She once said she want to let more come in than Obama it is a joke that she cares about us. I would not mind a women in the white house, but not her. Also I do not want her husband messing around there. How could she make good decisions worrying about him cheating.","commenter_a":"Neither. It's Germany. @webpagelink","post_message":"The mother of a police officer who was killed by an illegal immigrant speaks out in support of Donald J. Trump due to his strong stance on illegal immigration. @webpagelink (via Fox & Friends)"},{"comment_id":"793441997371016","commenter_b":"If they don't want to be detained. The scum should not steal. We pay for that! We need to get tougher on criminals","commenter_a":"Don't break the LAW!!! Then resist as well! Quit sticking up for criminals. This lady is an idiot to begin with don't do the crime. Choices... Make the right ones or like anyone else suffer the consequences from your choices. Maybe crime will go down if we actually don't try to protect the criminals and support our police forces. Remember enforcing the Law is for our safety. So for all you law breakers don't break the law if you don't want to take the risk of suffering the consequences.","post_message":"RAW VIDEO: A shopper claims she caught security guards at a Chandler Walmart putting a suspected shoplifter in a chokehold.  She took the video below on her cell phone. You can hear the woman shouting \"I can't breathe. I can't breathe.\" She then appears to be passed out on the ground.   Do you think security was too rough, or just doing their job?  FULL STORY: @webpagelink"},{"comment_id":"427202340738140","commenter_b":"Pharmaceutical companies cannot profit so much that's why they do not do what they are supposed to do is protect the public","commenter_a":"Lauren Martin","post_message":"This video is from a new documentary The Culture High which looks at both sides of the marijuana prohibition argument."}]
