[{"comment_id":"10153484924965861","commenter_b":"Impeach her","commenter_a":"Mary Failin was trumped","post_message":"BREAKING: The Oklahoma Court of Criminal Appeals has granted a two-week stay in the execution of Richard Glossip."},{"comment_id":"1227725310657052","commenter_b":"Please don't reproduce.","commenter_a":"Trump incites violence. He is bringing the racists out in droves and he is dividing this country. Since he came on the scene, there has been more hate crimes than I've ever seen. Wake up people!","post_message":"The sniper attack on Dallas police officers now ranks among the deadliest against U.S. law enforcement since 1900."},{"comment_id":"10153442882309087","commenter_b":"@username No Edna is the one with the brains, you however should go get and education and then come back to the table. Nevermind don't bring that stupidity back, you may let the men in your family rule your body but they definitely will not rule mine. Whether you like it or not abortion is legal in this country ..... why would any self respecting woman let any GOP teabagger try and rule their bodies....,.I just don't get it and never will. If you won't vote for the women in your lives I certainly will !!","commenter_a":"Obama is ISIS! That's why he didn't cry before!","post_message":"“I was affected by [President Obama crying during Monday's gun control speech] but I thought we should’ve had the same kind of reaction when James Foley was beheaded, when San Bernardino and Paris occurred,\" Speaker Paul Ryan said. \"That’s the kind of reaction I had when those occurred.”"},{"comment_id":"10154525583946336","commenter_b":"Another red herring, Republicans? We've had enough of your endless investigations that amount to NOTHING.","commenter_a":"I'm sorry to say that she could murder a nun on 5th ave. and nothing would happen ...... Why?","post_message":"\"She did it for greed and for power and for the almighty dollar.\"  In her Opening Statement last night, Judge Jeanine Pirro said it's now clear that Hillary Clinton used a private email server to \"hide her shady Clinton Foundation dealings.\" @webpagelink"},{"comment_id":"1712814082319419","commenter_b":"Disbar her. So corrupt!!","commenter_a":"Prison for treason","post_message":"Continuing Live Coverage: Attorney General Loretta Lynch testifies before the House Judiciary Committee on the DOJ's decision not to charge Hillary Clinton over her personal email use while secretary of state."},{"comment_id":"2193117860914394","commenter_b":"As if I would let her lick my face when she cleans her asshole 😂😂😂 come on now","commenter_a":"@username Munro","post_message":"It's not just gross, it's dangerous."},{"comment_id":"1213161752065703","commenter_b":"Report real news leave this story alone","commenter_a":"Do you realize that this constant back and forth over this story just reminds us that so-called 'journalists' in this age have NFI what they're doing? Being thorough is better than first, you all sound like a cross between TMZ paparazzi and the National Enquirer. Get a grip, you hacks.","post_message":"REAL OR FAKE? A Tennessee TV station stands by reports of a Santa's encounter with a dying child."}]
