[{"comment_id":"987021391354390","commenter_b":"@username: Once again, you can argue all you want day in, day out. And guess what will happen? The ongoing trend. It get's worse and worse year after year. The debt keeps climbing, yet some have their blind folders on like they can't see this way of thinking, and the economy is constantly nose diving, we are constantly going further and further in debt. Another fact, we in the South are tired of pressing 1 to listen to English while we live in America. If Hillary had it her way before she goes to jail, the mid-west and North would be in the same situation after she let them flood in and gives them drivers license, you too would be having to Dial 1, every single time you want to hear English. Think it wouldn't bother you? Think again, you'll question whether you are really living in America. After-all these ...","commenter_a":"Raise Minimum Wages - Put Small Businesses Out of Business, Take Jobs from Americans. Allow immigrants to flood the country, give them drivers licenses, and take jobs from Americans. Oppose the pipeline, Take Americans jobs. Do away with energy companies, Take Americans jobs. \"Hello, I'm @username, the hypocrite, I promise Americans jobs!\"","post_message":"Time to invest in a clean energy future—not build a pipeline to carry our continent's dirtiest fuel across the US. I oppose Keystone XL. -H"},{"comment_id":"1569633279990452","commenter_b":"U a fat bitch.u hater.k.k.k.","commenter_a":"Oprah is a racist bitch","post_message":"Way to go Carrie Underwood!"},{"comment_id":"10153903118333690","commenter_b":"Israeisl go there with American pasports","commenter_a":"Donald Trump need to stop Americans going to Muslim Countries whether it,s visit or work","post_message":"US Republican front-runner Donald Trump wants to ban all Muslims from entering the United States.    Elsewhere in the world, Tuesday marked the 50th anniversary of the Race Relations Act in the UK, which outlaws discrimination on the grounds of colour, race, ethnic or national origin.  So, how has racism changed over time?"},{"comment_id":"1394356603915019","commenter_b":"Odds Hillary Won Without Widespread Fraud: 1 in 77 Billion Says Berkeley, Stanford Studies After applying various statistical models to subsets of 2016 primary voting data several academic researchers conclude Hillary Clinton win was only possible through widespread vote fraud.","commenter_a":"#HillaryDNCRiggingCrooks","post_message":"It turns out that Bernie Sanders may not fight all the way to Philadelphia after all."},{"comment_id":"10153214035528433","commenter_b":"Russ, that is exactly what legalizing same sex marriage will do. No church will be forced to perform a same sex marraige, but some already do. Heterosexuals are considered married if they have a civil ceremony, so why do we need some 'different' classification just for same sex couples??? That is called 'seperate but equal' and was ruled on by the Supreme Court in the 60s. Seperate is NOT equal.","commenter_a":"Why is civil union treated exactly like marriage between a man and woman not good enough for the homosexual activists??? IMO these radical activists just want to stick it to those with strong religious beliefs.","post_message":"Today, the Supreme Court hears oral arguments about same-sex marriage. Here's some fact-checks on the issue. bit.ly/1GyIiZb"},{"comment_id":"685418174982094","commenter_b":"Why don't they take those liberal bitches off the air","commenter_a":"These women need to think before they speak","post_message":"The View is going to be taken off the air after host says this about candidate on live TV. This show is disgusting liberal trash. Put an end to the show already. Can we get 100,000 'LIKES' to have The View cancelled?"},{"comment_id":"10153184060913690","commenter_b":"If God wanted women to get around he would have given them legs....","commenter_a":"The intension is not to drive a car but to goo free life against the social and religious norms.","post_message":"Maysaa al-Amoudi Loujain al-Hathloul were freed after spending more then two months behind bars. Hathloul had tried to drive into Saudi Arabia from neighbouring United Arab Emirates in defiance of the Saudi female driving ban. @webpagelink"}]
