[{"comment_id":"1564121906980885","commenter_b":"Such a nasty woman","commenter_a":"Ew","post_message":"😍😍😍 (Via Daily Mail Celebrity)"},{"comment_id":"1078205312195129","commenter_b":"She will walk! MSM will guarantee it.","commenter_a":"She served on the Watergate committee. That's where she got the idea. Hillary did get fired from that commission for lieing. She is the original old crony.","post_message":"Hell, Nixon only erased 18 minutes. Hillary erased literally everything."},{"comment_id":"577421592439857","commenter_b":"I don't believe anything this woman says.","commenter_a":"\"You can always point a finger. But there's three pointing back. Literally, If you point a finger at someone else, three of your fingers are pointing back at you. This also means that you need to stop blaming others and deal with your own issues to help yourself.\"","post_message":"Hillary Clinton and her running mate Tim Kaine have released their tax returns, as her campaign called on Donald J. Trump to do the same."},{"comment_id":"10155119252083690","commenter_b":"@username U r a horrible women ur all posts r anti Islamic. ...shame on u..","commenter_a":"Correction: Racism sparks anger towards dude getting on with his life.","post_message":"A British boxing star has stirred far-right anger after posting a picture of himself taking part in Muslim prayers at a mosque in the UAE."},{"comment_id":"1032100616836565","commenter_b":"This Woman is pure Evil.","commenter_a":"hillary maggie mae clinton..........cause the morning sun, when its in her age really shows her age","post_message":"Pro-abortion politicians have ramped up their war on the unborn for 2016. It's up to us to do everything we can to protect them by continuing to build support behind the Life at Conception Act! Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb171"},{"comment_id":"10153150963247483","commenter_b":"I am totally convinced that libs are the only people that post comments on AL.com. Must be a lib ran organization. Oh I forgot, its part of the media!","commenter_a":"Assholes","post_message":"\"In my judgement, with respect to Hillary Clinton, she will be a unique president if she is elected by the public next November, because the day she's sworn in is the day that she's subject to impeachment because she has committed high crimes and misdemeanors,\" Congressman Mo Brooks"},{"comment_id":"1633238976976440","commenter_b":"Debate is good!!! It means they're taking an interest in politics! I don't agree with the shirt but how can you be a 'free country' and yet ban a tshirt ? The teen has a right to free speech","commenter_a":"No keep it on, this is a good learning experience for them to do research and compile facts to rebut the shirt. In fact if she wants to wear that shirt she should have to make a presentation showing fax and citations from non-biased source is why she thinks it's true!","post_message":"The teen said she was asked to take the shirt off after it sparked a debate in class."}]
