[{"comment_id":"10156663842160354","commenter_b":"KILL THEM Europe.","commenter_a":"This is what the fool, Obama wants for America .","post_message":"A DOZEN PHOTOS... \"Parents have been advised to keep their children indoors as migrants roam through playgrounds, while on residential streets police wearing riot gear stalk gangs of migrants.\""},{"comment_id":"467385036785410","commenter_b":"Bitch shut the fuck up and close your dam legs and get a job Iike everyone else does","commenter_a":"No. I worked for more than 30 years before making $15.00 an hour.","post_message":"Should Blacks Be Compensated For Slavery? Comment 'yes' or 'no'."},{"comment_id":"10153001285494091","commenter_b":"Why have a trial for this garbage. Execute her already.","commenter_a":"savage.","post_message":"\"Everybody wants to know. Yes, I did kill her. The mother accused of killing her two children and storing their bodies in a freezer yelled in court that she killed them: @webpagelink"},{"comment_id":"10153629049609255","commenter_b":"Hey JEB. Your mom called: @webpagelink","commenter_a":"Pay no attention--he's speaking with his head---UP HIS ASS---AS USUAL !!","post_message":"Jeb! Bush, noted women's health expert."},{"comment_id":"500763203381607","commenter_b":"This crap started with Clinton. Oliver North warned us what was coming.","commenter_a":"He warned Bush,but wasn't taken seriously.","post_message":"Do you agree or disagree with Donald Trump on this?"},{"comment_id":"910131575844085","commenter_b":"It should NOT be given to illegal aliens #1. It should not be a life time money train #2.","commenter_a":"Unfair.The middle class working people can no longer pay for these people to watch TV all day and do nothing. Now when we die out because of Obamcare.they too will die behind us.","post_message":"Welfare recipients just got hit with some devestating news. The party is coming to crashing halt. Do you think it should be illegal to live off other people's hard work?"},{"comment_id":"10153941098352439","commenter_b":"pigs.","commenter_a":"Simple solution. Send them back home where they can pound sand. Better still, why doesnt even one affluent opulent oil rich middle eastern lingdpm take thrm in? Why not? Hypocracy. In Abu Dabi that even have free good stugfs gor those that don't have....","post_message":"In the wake of jihad slaughter, Western leaders and media elites hand-wring and rail over \"fear of reprisals\" against Muslims and islamofauxbia - myths to distract and defend the Islamic faith. When, in fact, it is antisemitic incidents that are at record levels. Anti-Jewish attacks are daily now. No one says anything about that because it is largely Islamic Jew-hatred. Respect it."}]
