[{"comment_id":"10154678643996729","commenter_b":"Screw that ignorant queer!","commenter_a":"It makes sense now why the Obama administration doesn't want us to have guns, he needs to sell them to people that hate us.","post_message":"This one hits close to home..."},{"comment_id":"10153212099990927","commenter_b":"She and Whoopi are proof that there are people in this world that shouldn't be allowed to reproduce.","commenter_a":"She is so irrelevant.","post_message":"So if you don't ago along with Obama plans...you're racist? Only the 'View' Crew could come up with something so stupid."},{"comment_id":"10158475114940354","commenter_b":"Is Melania Trump retarded?","commenter_a":"Uninstalling Obama in... 99.9 % Complete!!","post_message":"Say what?!"},{"comment_id":"1028722620528934","commenter_b":"Much better than the lying Hillary or senile Bernie!","commenter_a":"And the other morons will vote for Trump.","post_message":"Americas Freedom Fighters"},{"comment_id":"833545303358765","commenter_b":"She's a idiot!","commenter_a":"Abortion is not the answer - Pro-Life is!","post_message":"How many of you would have been aborted under this perverted logic?"},{"comment_id":"1010063709005886","commenter_b":"Don't ask questions.....get them out !! We don't want those barbarians here !! They have proven they can't live in a civilized world .....they try forcing there garbage on everyone !! I refuse to live like these monsters !!!! Deport obama along with his muslime scums !!","commenter_a":"Its about time! He had relocated OVER 353k muslims since he entered offc. NO CHRISTIANS - he left them to be slaughtered by his isis comrades. All of these relocated muslims r all on welfare and considered ILLEGALS. Living off the backs of 741915279236631s they hate.","post_message":"Finally, the GOP is getting serious about asking questions about Barack Obama colonizing America with Muslim Refugees!"},{"comment_id":"10152700019752212","commenter_b":"While I understand what they are trying to do, forcing a certain body shape (or denying a certain body shape) under penalty of law is rather draconian. They might better serve the public through education.","commenter_a":"In this day of unrealistic, unattainable goals for what is beautiful, unless you go under the knife or starve yourself. I say Amen. Keep it real.","post_message":"HOT TOPICS: France has passed legislation banning models deemed excessively thin. The law also imposes steep fines and possible jail time for any agent and modeling agency who hire them. The law focuses on the model Body Mass Index (BMI) and bans anyone whose BMI is, according to the law, than levels proposed by health authorities and decreed by the ministers of health and labor. Opponents of the law think that the criteria for banning a model is too rigid; that BMI alone is not a good judge of who is and isn healthy. Others, though, say they happy the law is put in place. They think the law will stop glorifying an unhealthy body image. #9HotTopics What do you think? Robin Marsh and Lacie Lowry may share your comments today on News 9 at Four!"}]
