[{"comment_id":"10153059346813525","commenter_b":"Stacey Panarelli","commenter_a":"If you read the whole story, the girl was able to free the dog and it came back to help her when she was in danger! What a HERO, Awesome dog that gave its life to save hers. About it being off leash, how many of us at a park take a pet off leash to fetch a ball or play or whatever? Have a HEART!!! I cant imagine what they are going through and its terrible those kids and Haze`s family watched in horror. My prayers and heart go out to them!!!!! Haze youre a hero dog!!!!","post_message":"\"By the time I got on the bank with 'Haze,' the gator is eyeing both of us.\" www.myfoxtampabay.com/story/@username/gator-snags-dog-on-hillsborough-river-as-family-watches-in-horror"},{"comment_id":"388258684695759","commenter_b":"We all need to ban to gather and kick all Muslims out of this country they have no say so in this country if they want say so they need to go back to their own country this is United States of America not Mohammed country","commenter_a":"You damn right. All states should do this","post_message":"It's time that all the states do the same..."},{"comment_id":"10154805040466037","commenter_b":"WTF!!!!! You're the hypocrite. Vote for Hillary a baby killer","commenter_a":"Dumb heartless trump, there are civilians....women and children in Mosul. They need to get out before attacking the place. Hmmmm there's something called \"war crime\" if u attack recklessly as ur suggesting innocent lives will be lost... It funny how u don't support necessary abortion to save a mother's life but ur happy to kill many innocent civilians... Trump = fool bigly","post_message":"“We gave them months of notice. U.S. is looking so dumb. VOTE TRUMP and WIN AGAIN!”"},{"comment_id":"10156550497830354","commenter_b":"It would seem to me that either of the following words would properly describe this situation; Epic... Fail, Fell, Fall.","commenter_a":"Weedoing out the useless.","post_message":"Distracted walking while using an electronic device led one man to a deadly 60-foot fall off a San Diego cliff on Christmas Day..."},{"comment_id":"10153696500960575","commenter_b":"Shoot this mother fucker.","commenter_a":"Hey you are invited to my next BBQ all the pig you can eat","post_message":"More tolerance and love from the Religion of Peace."},{"comment_id":"10153463322016051","commenter_b":"Too sick! This woman might wear Christian symbols at Christmastime !","commenter_a":"There is no meshing between our God and theirs-the Holy Bible is our guide and law-we are inclusive but stand on firm ground!","post_message":"This evangelical Christian school just suspended a tenured professor for expressing solidarity with Muslims. And they didn't stop there. Decide for yourselves if the school behaved correctly. (Via VICE News)"},{"comment_id":"1459625230716396","commenter_b":"Send them home!","commenter_a":"Who's with me ?? BUILD the W. A. L. L.","post_message":"Deport them all, President Trump"}]
