[{"comment_id":"10153885650817061","commenter_b":"@username , please take the tin foils off. For Benghazi, blame the Republicans. All of what you are saying about HC is all conspiracy based. EVERY investigation ha cleared her of wrongdoings. She is not perfect, but far better than that lying rapist BIGOT woman hater thief (ask the thousands of people he stiffed out of their money) IDIOT DT.","commenter_a":"Oh...don't mention Indiana! We are not proud that we have idiots voting for him!","post_message":"Sign of the times: Donald J. Trump supporter from Indiana says he's gone to great lengths to protect his yard sign with the candidate's name on it. So far, he says, \"I'm 2 and 0.\""},{"comment_id":"10153129046736051","commenter_b":"The border is broken and Obama wants everyone to come on in. Breakdown between law enforcement agencies. I agree with Trump. Build a damn wall. I live in a border city. Luckily we don't have a big problem but now we have to worry about middle eastern people.","commenter_a":"That's a Dad who will have nightmares the rest of his life! May God be with him. What a beautiful young woman! What the hell is wrong with our country?","post_message":"This woman's dad had his arm around her when they heard the pop. As she collapsed on the ground, he could hear her repeat the same thing over and over again: \"Dad, help me, help me.\""},{"comment_id":"10153717285696509","commenter_b":"Looking better then the women in his home","commenter_a":"Should be on the cover of freaks magazine","post_message":"Caitlyn Jenner is on the cover of Vanity Fair, in an image shot by famed photographer Annie Leibovitz: @webpagelink #CallMeCaitlyn"},{"comment_id":"591215384344977","commenter_b":"Wash your mouth lady!","commenter_a":"Ummm it's not a white thing, it's a hygiene thing.....","post_message":"Imagine if a Republican had said this about Black people...... They'd be destroyed."},{"comment_id":"1753991328222832","commenter_b":"Angry, angry woman.","commenter_a":"I hear some sniffles coming out of Philly, sure sounds like a bad case of the Blue Flu may be headed that way","post_message":"We'll see what ends up happening..."},{"comment_id":"10154363624237501","commenter_b":"This is getting Old. What will she want next a Movie? This lady is a $$$$ hungry Biotch","commenter_a":"Why oh why do you continue to post this?","post_message":"As testimony comes in and new evidence is provided, has your opinion about the shooting changed over time?"},{"comment_id":"10157151513605231","commenter_b":"Thank u god bless all of his children with love","commenter_a":"He had a dream and we are still dreaming and look how far that has got us police still killing us and now we helping them and everybody's out for themselves king would be shaking his head because we have sold out, we have become a consumer race of people for every other race but our on everybody makes money off of us just look around you where do you spend your black dollars ?","post_message":"On April 3, 1968, Dr. Martin Luther King, Jr. gave what would be his final and most recognized speech. On April 4, 1968, he was assassinated by a coward who doesn't even deserve to be named. Dr. King's contribution to the Civil Rights Movement and to the advancement of black people cannot be ignored. Thank you, Dr. King. \"Well, I don't know what will happen now. We've got some difficult days ahead. But it really doesn't matter with me now, because I've been to the mountaintop. And I don't mind. Like anybody, I would like to live a long life. Longevity has its place. But I'm not concerned about that now. I just want to do God's will. And He's allowed me to go up to the mountain. And I've looked over. And I've seen the Promised Land. I may not get there with you. But I want you to ..."}]
