[{"comment_id":"925749584134949","commenter_b":"May they name a FEMA camp after you. What a totally ignorant woman you are! Unbelievable!","commenter_a":"You need some solid intelligence. We had these under Bush , he is the one who stated war and depleted the reserve funds. Obama replenished them. I am happy to have such a high IQ, highly educated president with multiple graduate degrees including a Doctorate in Constitutional Law. He even taught it at Harvard. I have worked on secure govt projects . The govt can show power to those in the Middle East . Fox News? keeps the fear mongering going. It has a 20% accuracy rate. The elites are the Koch brothers & Corporate powers. Get a reality check!","post_message":"In case you missed it, here's the top story from Tuesday: The recent exposure of the nationwide Jade Helm 15 exercise has made many people suspicious, and with good reason. Federal crisis exercises have a strange historical tendency to suddenly coincide with very real crisis events. The elites are clearly preparing for something big. When the elites wage war on America, this is how they will do it: They will control public opinion, control the public, isolate population centers, decapitate leadership, and initiate fourth-generation warfare. Crisis is the best weapon the elites have at their disposal, and exercises like Jade Helm show that they may use it in the near term. The defense that defeats crisis is preparation — preparation not just for yourself, but for others around you. War is coming, and while we can’t know the exact timing, we can assume the worst and do our best to ..."},{"comment_id":"10156257885050389","commenter_b":"What the hell are they waiting for?? Indict her already !!!","commenter_a":"she sure is aging fast","post_message":""},{"comment_id":"1004203859620086","commenter_b":"Awful woman !!!","commenter_a":"I don't want to see this face in my newsfeed.","post_message":"Leave it to Michele Bachmann to exploit a tragedy to take a swing at President Obama"},{"comment_id":"10154148275886162","commenter_b":"#FEELTHEBERN #DUMPTRUMP","commenter_a":"Yes, I did!","post_message":"SHARE if you got out and voted today! We'll be updating with all the latest results throughout the night: @webpagelink"},{"comment_id":"10153344405883984","commenter_b":"what more does this witch have to do before they put her where she belongs, PRISON!!!!!!!","commenter_a":"Hillary's political career ended with her departure from the State Department as far as I'm concerned. She's never been a vialble candidate for that office.","post_message":"I don't see any way Hillary can escape from this one. She's probably kicking herself right about now... Do you hope this ends Hillary's presidential chances?"},{"comment_id":"10154523489186336","commenter_b":"This must be an attempt to try and dig yourselves out of the hole you're in.","commenter_a":"If you want to know what is really happening in the world bypass FOX and CNN, and go to alternative news sources. You will be amazed to see how much the American news media ignores. We are all living in the dark.","post_message":"Now more than ever, viewers are turning to Fox News Channel – Most Watched, Most Trusted!"},{"comment_id":"10153086762191438","commenter_b":"Besides there no such thing as a attractive Democrat woman!","commenter_a":"Boils down to primal fear in Liberals, Hillary is toast and Warren is way to Marxist except for the hard Left....and Liberalism doesn't sale to Americans....Cruz has a great message and the Left knows it...see the exact same responses on other Leftists sites...you can smell the wet panties and fear....","post_message":"Ted Cruz has no chance of becoming president."}]
