[{"comment_id":"10153868854236336","commenter_b":"Heck yeah","commenter_a":"It's OUR country. We don't have to agree. I'm sick of people like this telling other people to leave. You don't make the rules buddy.","post_message":"'The silent majority has been silent way too long.'  Harris County Sheriff Mike Jolley says he's proud to be political incorrect, and if you don't like it, you can leave his county. @webpagelink"},{"comment_id":"1170579889643596","commenter_b":"Haha I thought the same thing. She should cover up!!! Lol","commenter_a":"She shouldn't be breastfeeding in public.....she should cover up.......oh wait animals breastfeed their babies out in the open too and no one bats an eye. Sorry just had to","post_message":"Prague Zoo's 24-year-old gorilla, Shinda, gave birth unexpectedly to a baby girl. Zookeepers didn't know Shinda was pregnant; they thought she was just overweight. @webpagelink  Correction: Prague Zoo has not yet released the official name of the baby gorilla. Shinda, its mother, has been living at the zoo since 2001, not 2003."},{"comment_id":"1137500072976406","commenter_b":"I agree she's a snobby cow that needs to learn a lesson and go inside but prisons are full","commenter_a":"Yet another classic case of women and their double standards...if a man had stabbed a woman, there'd be out with the pitchforks and torches baying for his blood...","post_message":"Woman who stabbed a man in the eye with her stiletto walks FREE from court"},{"comment_id":"968036809901222","commenter_b":"Take the criminals away first","commenter_a":"FAST & FURIOUS ???","post_message":"This is one of those times where a picture is worth a 1,000 words!"},{"comment_id":"10153936171871813","commenter_b":"Your wifes hot though LOL","commenter_a":"If your not in Law Enforcement nor never have been dont even bother to comment on this post","post_message":"Here’s a way to increase much-needed police accountability — especially when force is used."},{"comment_id":"10157919704880354","commenter_b":"Any woman is capable of cheating","commenter_a":"Deplorable in State Of Jefferson!","post_message":"LIVE: Behind-the-Scenes Look of the New Store with Breitbart's Alex Swoyer,  Sonnie Johnson and Charlie Spiering"},{"comment_id":"1824785004425894","commenter_b":"Women who support Trump have severe Stockholm syndrome and suffer insecurity","commenter_a":"Three times divorced, womanizer dares to talk about morality.","post_message":"Let's talk about the debate...what just happened?"}]
