[{"comment_id":"969780003138778","commenter_b":"Bye, bye illegal aliens and their bastard American children.","commenter_a":"Love it, ... and Muslims too !","post_message":"Ay, caramba! #BuildTheWall @webpagelink"},{"comment_id":"10154122755384641","commenter_b":"Jajajajajajajajajajajajaja Trump for better world? ...dig a hole in your yard lady. ..","commenter_a":"Wish I could go back to 1945, find Donald Trump's father and give him a condom.","post_message":"With the growing chances of a Donald J. Trump presidency, world leaders are beginning to swallow their previous distaste."},{"comment_id":"644515682393824","commenter_b":"Hi liar y!! Tear down that wall. Let all illegals in that wish to come in and take stuff for free!!!","commenter_a":"I love that Trump is not afraid to call bs when he sees it!!","post_message":"'Hillary Clinton doesn’t miss an opportunity to ridicule Donald Trump’s illegal immigration solution of a wall on the southern border — but that’s exactly what she’s deployed to keep undesirables away from her.'"},{"comment_id":"10154052672876051","commenter_b":"You deserve crooked Hillary!","commenter_a":"LMFAO, Clinton has SECURED enough electoral votes that she doesn't even NEED TO campaign anymore. Nice try there. It's pretty goddam pathetic that the absolute BEST the \"party of values\" could scrape up is a con artist who cheated on wife #1 with wife #2, has FIVE children from three different wives, wife #3 lied about having a degree and may possibly be an illegal immigrant; Trump appeared on the cover of Playboy and owned strip clubs AND gambling casinos; admits he wants to bang his own daughter; mocked the handicapped; supports torture; numerous business failures; bribed Florida AG Pam Bondi; is facing ethics lawsuit regarding Trump University, and that's just off the top of my head - yeah, right. Some \"Presidential\" material. So shove your fake-ass BULLSHIT stories about emails and Benghazi, you cheap phony \"patriots\" supporting Trump.","post_message":"Election swing: Donald Trump is now leading Hillary Clinton by two points in a major nationwide poll. Would you like to see Trump shock the world and win this November?"},{"comment_id":"1533770763589743","commenter_b":"Stupid!!!","commenter_a":"Idiots. I don't watch or care about that crap.","post_message":"Tonight at the Oscars, celebrities will be wearing gun control bracelets (paid for by the anti-gun group Brady Campaign), while being surrounded by massive amounts of armed security. Think any of them will note the irony?"},{"comment_id":"10150859256639999","commenter_b":"What a great joke....I mean choice for first woman president! Way to be a role model for young thugs of this great nation! Proud non supporter of the most despicable woman in the world! Rot in prison and may you get your soul back from satan! God bless America and God bless the American dream!","commenter_a":"She'll have plenty of time to read in prison!","post_message":"\"She’ll drop everything for a few minutes of blowing kisses and reading Chugga-Chugga Choo-Choo with her granddaughter,\" Chelsea Clinton said of her mom."},{"comment_id":"1240366709375196","commenter_b":"Oh how I pray that would happen because that is where she belongs. Get out and vote TRUMP!","commenter_a":"She must NOT be elected, then impeached or her VP would take office. Then she would just be the puppet master. Telling him what to do. Come on America, do what is right!!","post_message":"We all hope that Donald J. Trump takes down Hillary, but a backup plan has just been launched in case he doesn't.  This is a massive development in the campaign, and you know it's got Hillary's people worried."}]
