[{"comment_id":"967905263263639","commenter_b":"She needs to be in jail!","commenter_a":"No just you","post_message":"EPA Chief Reveals Her 'Trashy' Upbringing And What She's Sure All Families Did Pre-EPA [Video]"},{"comment_id":"10153165284351770","commenter_b":"This woman is so wrong for our country.","commenter_a":"This lady is delusional, don't they do mental checks before putting people in these high ranking positions??","post_message":"Attorney General Loretta Lynch suggested that President Barack Obama could call for Congressional action for increased gun control in the wake of the San Bernardino terrorist attack.  Read more: @webpagelink"},{"comment_id":"496930887161871","commenter_b":"women, they just don't listen lol","commenter_a":"Hope she went to jail!!","post_message":"'Thank to Obama and I don't have to OBEY you', she said to the police officer!"},{"comment_id":"10153681874356130","commenter_b":"Did he build the wall?","commenter_a":"The Pope is a hypocrite. Take down the Vatican walls and let people enter freely and demand to be taken care of.","post_message":"Satan For President? @webpagelink"},{"comment_id":"10152795603885950","commenter_b":"if i turned into a woman id still want a woman so id be a lesbian, lets all turn to woman","commenter_a":"thats right, if i want to be a woman, ill be a woman, but i kind of like my dick so ill keep it","post_message":"'If he says he's a woman, then he's a woman.'"},{"comment_id":"10153224011251051","commenter_b":"Shoot the the sonofbitch","commenter_a":"Dirt bag!","post_message":"A lot of people considered this man a hero. Then the truth came out."},{"comment_id":"1639738129419643","commenter_b":"'@username he hasn't done anything yet. He is the President elect. He won because People are tired of the false unemployment rate Obama is pushing. Tired of the rising cost of Insurance except for people like you who probably get it for free. Tired of the war with radical Islam that he has no strategy for winning. Tired of illegal aliens pushed on us and tired of sanctuary cities and tired of people like Kate Steinle being murdered by them. You certainly can't blame Trump for any of those things. Have a nice day in your la-la land world.","commenter_a":"Actually, Barack Obama is responsible for Trumps win because he has screwed this country so badly and people are sick of his shit and knew that Killary is not only unqualified, dishonest as hell, and a total liar but that she would continue Obamas agenda to destroy our country.","post_message":"Barack Obama said that Russia is responsible for Donald J. Trump's win, but he didn't expect Sean Hannity to knock his lies right back in his face. The democrats just got schooled.  Let's get 2,000 shares to show that America can't wait to get Obama out of office."}]
