[{"comment_id":"10153179398831051","commenter_b":"I wouldn't make my daughter wear a sign as punishment. I would just give her a spanking.","commenter_a":"I like it!","post_message":"This is how a dad decided to punish his teenage daughter. Good idea or bad idea?"},{"comment_id":"10153459873801756","commenter_b":"She's a Jew deliberately provoking hatred between Christians and Muslims.. Ask yourself why...","commenter_a":"I have to say I thought more people would be for protecting speech from violence, since we're in the liberal west and all, but apparently not. Paris gets shot up and the claim is to be \"je suis charlie,\" Texas gets shot up and \"they were asking for it.\" Makes no damn sense. You're either for the rights of us all to speak without fear of being shot, or you're not. I went to a public school and I learned that Voltaire quote. Small minded terrorists of an idiot ideology that requires giving your life to kill anyone who mocks your \"sacred\" beliefs. What a load of bullshit.","post_message":"The group's executive director runs a website called Atlas Shrugs, which The New York Times says \"attacks Islam with a rhetoric venomous enough that PayPal at one point branded it a hate site.\""},{"comment_id":"10155598100226002","commenter_b":"Something white people started, after having intercourse with monkeys they would die from AIDS. Mosquitos was a bacteria form from their deceased corpes.","commenter_a":"Hmmmn,what's the next thing that will be killing us...SLEEP???????Always fear mongering and hysteria..","post_message":"Known to health experts as the most deadly animal on the planet, the minuscule mosquito, with its dreaded whine, is responsible for millions of deaths from multiple diseases each year."},{"comment_id":"700248193457289","commenter_b":"@username honey your aluminum cap should b worn at all times ...","commenter_a":"When he opens his mouth he divides. Expected from a 1/3 white 1/3 black and 1/3 Arab who is a closet Muslim. Conflicted hate eVeryone but MUSLIMS. THATS TRUTH NOT A FALLING LYIN' tree.","post_message":"Probably... but we'll never really know will we?  Hostile Politics"},{"comment_id":"460484767469658","commenter_b":"China dont want none!!!","commenter_a":"So we take warnings from communist?","post_message":"TRUMP WIN RATTLES CHINA"},{"comment_id":"10153917559886770","commenter_b":"Nah, her girl fans drink boiler-makers.","commenter_a":"Amy Schumer fans do not drink beer. They drink fruity drinks with umbrellas in them. And her female fans drink those, too.","post_message":"This doesn't sound good...."},{"comment_id":"1222382617796158","commenter_b":"Idiot please don't reproduce","commenter_a":"End of the circus... was a main attraction.... They do away with the side shows...then the tent... now the elephants.... Why would one even want to attend.... another bit of America down the toilet...","post_message":"Elephants performed for the last time in the Ringling Bros. and Barnum & Bailey Circus on Sunday, putting an end to the controversial practice. The animals will live at the 200-acre Ringling Bros. and Barnum & Bailey Center for Elephant Conservation in Florida."}]
