[{"comment_id":"10155247808221729","commenter_b":"Jill stein was just in it for the money! She pulled one over on her own people.","commenter_a":"When will these #NOTMYPRESIDENT jerks learn. Get over it. If Hillary would've won we would be over it and preparing for all the bad she'd unleash on the USA!","post_message":"EPIC FAIL."},{"comment_id":"1012396785523240","commenter_b":"BUSH AND CHENEY WAR CRIMINALS!","commenter_a":"BENGHAZI, EMAILS, Feckless Foreign Policy , He is a Muslim , look at this snow ball Mr, President... Im not a Scientist , repeal Obama Care and shutting down the government again ?","post_message":"11 days and one massive to-do list."},{"comment_id":"617790755078170","commenter_b":"She a geto gutter hoe send her back","commenter_a":"I agree with Brooks.And Steven Joseph Sr.God bless that soldier .And thank you for your service","post_message":"Michelle Obama wanted this army staff sergeant to do this, but he refused.  This is amazing. We stand behind this soldier 100%.  Do you support this war hero stand against Michelle?"},{"comment_id":"10153861210290950","commenter_b":"You kiss your Moms with that nasty mouth?","commenter_a":"Here is my thought. Don't show him on TV!! Focus on the team, the stands, and the rest of the stadium and to hell with him. If everyone stops making him big news, maybe we can all go back to watching football and the rest of the players on the field. Make him prove he even deserves to be out there, and sorry 49er fans, but before all this crap by him became news, I couldn't even tell you who he was. Maybe this is his way of getting some publicity because he ain't no Tom Brady or Peyton Manning!!! Let him sit, he may just earn the right to sit there all season!!!","post_message":"A veteran who supports the San Francisco 49ers quarterback tweeted: \"Don't use my service--or that of any veteran--to justify the silencing of black Americans.\""},{"comment_id":"10153815392947293","commenter_b":"She have bipolar disorder.","commenter_a":"Please be kind when commenting. Even if you don't like her, she is a real human being, who has had significant struggles with mental illness. She has family and friends who are worried and scared.","post_message":"Sinead O'Connor has been found."},{"comment_id":"868758169887103","commenter_b":"crying about the NRA , every lobbying groups receives money from those they represent . Guns sell themselves , new models fly off the shelves and gun stores hardly discount. Women are one of the fastest group of gun owners in the country .Many single mothers and single women carry weapons , it is the best defense . Many women have stopped harassment , rape or assault because they were armed, weapon is often never fired .","commenter_a":"If you read the article, it sounds as if alcohol should be banned from campus. What the article does not say, is you still need to be 21 to legally have a handgun. That and you would still need your concealed carry permit. Concealed carriers are as a group less likely to commit crimes than even the police. Ever time carry options get more loose, liberals cry the streets will run red with blood, but the reality is just the opposite.","post_message":"These bills are moving through state legislatures across the country - here's what you need to know."},{"comment_id":"10152846459704205","commenter_b":"African wisdom here seems to be too verbose.","commenter_a":"Larry is a voice which needs amplifying as he speaks to our being qualified to run America's business of governing. His professorial countenance with assurance of our intelligence to grasp the duties and tasks for citizens of our land to undertake he does with the smoothness that is purely African wisdom.","post_message":""}]
