[{"comment_id":"10153424886503598","commenter_b":"How do you plan a family without having a man involved. What they have encouraged is the prostituition of women both in devaluing young girls and women and when they become pregnant pretending to help. But their motive all along was to take a product that costs them nothing and process it( dissect and distribute) to the highest bidder.) to be used for unimaginable purposes. This philosophy is one of the most vile known to humankind. I know a woman who was told by her father when she was a teenager if you get pregnant you nor the child will be helped by me; she would be disowned. This man was a leader in his church but he had absolutely no Love from Christ in his heart. That is not Father God 'a kind of love. That is the kind of hard hearted ness that allowed these baby slaughterhouses to ...","commenter_a":"Amen","post_message":"After 27 Years of Killing Babies in Abortions, Abortion Clinic in Virginia Shuts Down for Good"},{"comment_id":"10153511380259641","commenter_b":"I can't believe some of the comments here - So much hate {that's not justified} :/","commenter_a":"RIP the old England, lost to Islam now.","post_message":"#TBT:"},{"comment_id":"10153664452407183","commenter_b":"Very good comment !!!","commenter_a":"Mr. Robertson you do know that the Bible is a compilation of 66 books and letters written by more than 40 authors during a period of approximately 1,500 years. Its original text was communicated in just three languages. The Bible's authors were very human and may have been inspired by what they understood to be God's words, thoughts, actions. These 40 individuals came from various walks of life. Moses was probably the most educated, while the others were shepherds who became the King of Israel (David), farmers, fisherman and warriors. These earliest accounts were handed on from generation to generation in songs, narratives, and poetry. In those early societies there was no writing as yet and people passed on these oral accounts and with that the stories are exaggerated, changed, misrepresented, and contradictions, so we admit the humans creating the bible were not infallible or God is bi-polar. The creation ...","post_message":"Who knew that being kind to gays was a death sentence?"},{"comment_id":"1298794080158825","commenter_b":"OK. Sacrifice your two daughters first....and we will all follow suit (he is a big asshole)","commenter_a":"Obama's a damn clown","post_message":"More evidence that this president believes in sacrificing military readiness on the altar of social engineering."},{"comment_id":"636098806550073","commenter_b":"#FuckDonaldTrump","commenter_a":"You people are celebrating this? He has not done anything to you. Anyone applauding a man loosing a fortune for standing up for his beliefs is soiling their own humanity. By ruining his life, you are staining your own soul. All of you are behaving much worse than anything you are accusing him of (falsely I might add). Those lambasting him are the ugly ones. I have seen much more vulgar behavior from the anti-trump crowd than anything that has been used as ammunition against him, true or not (most of it is false).","post_message":"The numbers say that Trump casinos, stores, and golf courses have suffered most."},{"comment_id":"549834655207114","commenter_b":"These women are child abusers. Where is child protection?","commenter_a":"Yes !","post_message":"These two lesbians are trying to play god with their son. This is the world we are living in today. Do you think this is wrong?"},{"comment_id":"958986307470162","commenter_b":"Beware, ladies!","commenter_a":"There's zero evidence supporting that he was filming her. The only harassment caught on film was of the women berating a man. This guy will have a great lawsuit for slander against her.","post_message":"This woman just gave a street harasser a taste of his own medicine."}]
