[{"comment_id":"418283194962942","commenter_b":"They are all criminals, that why they call them Illegals.","commenter_a":"So you want to prioritize sending back students & children before the criminals. I see.","post_message":"This Texas judge is boldly standing up to the White House. Should more follow his lead?"},{"comment_id":"10153235652851519","commenter_b":"He has a brain?","commenter_a":"Trump's hair is getting into his brain, not Mansanto.","post_message":"Very presidential..."},{"comment_id":"416029885255267","commenter_b":"@username why your government killing cows on throw them on street to make violence ?","commenter_a":"If Islam follows their one and only Prophet Muhammad who was a rapist, murderer, and pedophile be peaceful? Remember his youngest wife being 6 and forced to have sex at 9. Please tell to me how this is possible? No jokes or hate being meant just really need answers.","post_message":"For the past 5 months - media poll experts & establishment politicians have predicted that my campaign will fail. As the polls indicate - we are growing, and will continue to do so - thanks to your support!  What else do you think they are capable of under estimating? Terrorism? Threats of cyber-attacks? I DO NOT WANT TO FIND OUT! When I am elected #POTUS - I will see to it that we DO NOT find out!"},{"comment_id":"10153377279001756","commenter_b":"It's not just women. I had to go to the ER with a legit panic attack and they accused me of being on cocaine.","commenter_a":"A medical professional assuming that a woman is having a panic attack instead of a real problem? Shocking!","post_message":"Often, doctors reinforced women's fears of pulling a false alarm, automatically assuming that those with heart attack symptoms were suffering from indigestion, or maybe a panic attack."},{"comment_id":"10156269605955354","commenter_b":"This is so illegal and so disrespectful of those who have risked all for this country. Illegals are invaders.","commenter_a":"Another reason to leave this GD socialist state!","post_message":"It's starting."},{"comment_id":"963507617048798","commenter_b":"Black women live in public housing for generations it is time to let them live in the streets like white people do. 5 year limits on public housing so it does not continue as a breeding center for black skanks.","commenter_a":"Why do we have so many homeless? if our country has immediate help and housing for All the refugees then this country should have housing and help for all Americans immediately. No American citizen should be homeless, take care of our own First. Homelessness breeds all kind of crimes.","post_message":"Three teenage brothers suspected of a fatal attack in a #Seattle homeless camp known as ‘the Jungle’ have been charged with first-degree murder and assault. Michelle Millman reports what we know >> kiro.tv/JungleCharges"},{"comment_id":"10154684897643872","commenter_b":"Cow Patty is a crooked Hillary corporate baby killing whore and will lose in November!!!!","commenter_a":"Yeah, I'm voting you out for voting for TPP, freedumb act planned unparenthood and supporting crooked Hillary, enjoy unemployment Cow Patty!!!!","post_message":"Voting starts today! Got questions? Visit iwillvote.com for answers."}]
