[{"comment_id":"10154532123498271","commenter_b":"Oh, you're so compassionate from your suburban home, Kim. Here's to hoping they move in next door to YOUR family.","commenter_a":"So green card holders and those with dual citizenship are our enemies? And regardless of that, these people, they are us. We or generations ago of us were standing on this land as immigrants. They are us.","post_message":"\"This is not about religion - this is about terror and keeping our country safe,\" says President Donald J. Trump in new statement.   @webpagelink"},{"comment_id":"922771304482591","commenter_b":"We all wish we could return your white asses back.","commenter_a":"Damn the ignorant white man - HisStory - his Eurocentric propaganda BS taught in public education and he can't even remember his own fucking history. Beyond head up the ass!","post_message":"Not only are they hypocritical, they are also ignorant of history."},{"comment_id":"10157985698230594","commenter_b":"Hillsborough residents don't want the riffraff coming through their fancy neighborhood? Mountain lions can eat your pets.","commenter_a":"And the point is?","post_message":"Peter Rauenbuehler has posted video online showing a mountain lion attacking a deer and then dragging the limp animal away from his Hillsborough home."},{"comment_id":"1175029912517037","commenter_b":"Hal the point is we do need to tighten our borders, there are too many illegals here that get a free ride from the tax payers, and as much as people are going to hate this, if you came here illegally the children you have here are illegal. So, I do agree with you just never heard of known a Canadian to come here just to have a baby.","commenter_a":"look people. If you come to this country legally, doing all the appropriate paerwork and forms, any kids you have that are born here will be American Citizens. That won't change. What we want to change is the Anchor Baby tourism that flourishes on the West Coast, with the Asian women travelling here on 'vacation' to have their babaies in specially marketed motels just for them, so that their children, and them by association many times, would be American Citizens. And those illegal immigrants who cross our northern and southern border, from a multitude of countries, who break the law by sneaking in like a thief in the night, who have their babies here hoping for the chance to stay with them. People should not be rewarded fro breaking a law.","post_message":"With a renewed conversation challenging birthright citizenship, a look back at the 1898 case that first established the legal precedent in the U.S."},{"comment_id":"1151823781577341","commenter_b":"He claims he knows more about Isis than any one else","commenter_a":"As a Vietnam vet I may be able assist in the area of adjectives for Trump. I prefer using the term chicken-hawk. It pairs well with draft doger.","post_message":"This one is PERFECT."},{"comment_id":"10154263809393598","commenter_b":"A very sick lady, Murderer. Lier. Corrupt.","commenter_a":"SHE WILL EAT THOSE WORDS ONE OF THESE DAYS","post_message":"As the debate begins, remember.... Hillary Clinton: An Unborn Child Just Hours Before Delivery Has No Constitutional Rights"},{"comment_id":"10154233423376179","commenter_b":"@username - He wants an empire. Fascism 101 lesson, from 1947: @webpagelink","commenter_a":"Wow, another white man! What could possibly be up with that?","post_message":"Trump #SCOTUS nominee revealed"}]
