[{"comment_id":"10154787328718984","commenter_b":"Perhaps she should have kept her mouth shut and the White House wouldn't have to protect her!!","commenter_a":"BS....houses don't talk. We are about to witness the biggest revolt on DC and heads will be rolling. Trump will clean house literally. The most crooked leaders plus the worst media in the world. People are po'ed and WE aren't going to take it anymore.","post_message":"Right after Michelle Obama took the stage and launched an attack on Donald J. Trump that sent the media into a frenzy, the White House delivered a message to the Republican candidate that did NOT go unnoticed..."},{"comment_id":"10156429610305354","commenter_b":"No \"Refugees\" from Muslim countries!","commenter_a":"Kill all 15 on the spit","post_message":"So much for Obama's crackerjack \"vetting\" process..."},{"comment_id":"692289614253147","commenter_b":"Doubt it,he won't say anything different then he has already,he's got a small mind and can't think beyond the paper and crayolas","commenter_a":"No,it's not...after his scripted speech Hillary IS going to have a lot of problems","post_message":"This made my morning. I hope you guys enjoy it as well. ~Natalie"},{"comment_id":"10153174947101545","commenter_b":"So what's your excuse then casey?! Bahahaha!!! Mama was drinking when she was pregnant with you?!","commenter_a":"Now she and her followers will claim that she was jailed for being a christian, as opposed to a bigot hiding behind Christianity.","post_message":"A Kentucky county clerk was found in contempt of court Thursday for her refusal to issue marriage licenses in wake of the Supreme Court decision to allow gays to wed."},{"comment_id":"10154322509929087","commenter_b":"Truth Hurts huh you little bitch? go whine and cry somewhere else. you sound like a little girl.. Here I'll give you your wubby","commenter_a":"This is the death of the Republican Party written as a victory. The backlash will be fierce and overwhelming if Trump behaves in office as if he has a mandate.","post_message":"#BREAKING: Hillary Clinton 's popular vote lead over Donald J. Trump is now over 2.3 million or 48.1 percent of the vote."},{"comment_id":"10153210442256336","commenter_b":"Good!! Put that b!tch in jail....","commenter_a":"Were they on Hillary Clinton's server?","post_message":"A Treasury Department watchdog has recovered roughly 6,400 emails from Lois Lerner and turned them over to Congress – reviving the investigation into the IRS targeting of conservative groups."},{"comment_id":"10155069293808010","commenter_b":"@username well since trump is saying illegals voted for Hilary!!! I'm being sarcastic you Troll!!","commenter_a":"Oh let me guess they were illegal immigrants 2","post_message":"He operated the scheme for two years from behind bars. He and an accomplice made more than $600,000."}]
