[{"comment_id":"10153525959526336","commenter_b":"The mom is a idiot No common sense dumb woman that is it Let lock her up in a hot car and see if she likes it That little girl was soak with sweat even with the windows rolled down a little bit duh","commenter_a":"She took one kid with her and left the other one in the car????","post_message":"Video below shows the moment that officers freed the little girl from the van."},{"comment_id":"541947015995878","commenter_b":"Impeach this peace of crap in the WH !","commenter_a":"boo the windbag muslim !","post_message":"Americans are furious after Obama hammers christians on TV.  What disrespect. He's gone too far with this.   Do you think Obama is out of line?"},{"comment_id":"10153936528885695","commenter_b":"You run like a girl","commenter_a":"Jose Arellano that's probably why we saw the traffic earlier today","post_message":"Wait for it...wait for it -- a police officer chased three shoplifting suspects across Georgia 400 after this car crash. See the full video, plus we'll explain how it all started, at 5:14! @webpagelink"},{"comment_id":"10153951102966234","commenter_b":"She should had gotten revoke of gun license and probation","commenter_a":"'@username u was jus talkin bout dis , she got 3 years","post_message":"Itiyanah Spruill pleaded guilty to child endangerment charges in connection with the death of her 4-year-old son."},{"comment_id":"10153216973363855","commenter_b":"Good let the idiots divorce","commenter_a":"overinflated sense of their own importance much? idiots","post_message":"Here's to a speedy divorce!"},{"comment_id":"10154425900258366","commenter_b":"There is no wall","commenter_a":"Who f****** cares. Now it will be a party. They're gonna roast him like never before.","post_message":"BREAKING: President Trump has officially announced that he will not attend this year's White House Correspondents' Dinner."},{"comment_id":"10153064930639135","commenter_b":"She should be returned to New Jersey. So should it's Governor.","commenter_a":"Why wait until the end of August? Drop out now and avoid two weeks of mental anguish. It's over for you, which is a good thing for America.","post_message":"President Obama and Secretary Kerry, now that we have an American flag flying in Cuba, I urge you to demand the immediate return of Joanne Chesimard to New Jersey.  Like so many others, the families of her victims continue to suffer under the Castro regime. Justice must be served."}]
