[{"comment_id":"10153492097934170","commenter_b":"Two F'n losers.","commenter_a":"There is a serious lack of testicular fortitude between those two!","post_message":"I'm very disappointed in the King v. Burwell ruling, but we shouldn't be relying on the courts to get rid of ObamaCare anyway. Here are the guys who need to do it."},{"comment_id":"10153359647714138","commenter_b":"Get the place shut down, then sue them for everything.","commenter_a":"Oh no!!","post_message":"When the family didn't hear back from Petco after a few hours they called the store and were told to meet the manager at an animal hospital."},{"comment_id":"10153405815803132","commenter_b":"about time....she is to good for him!","commenter_a":"Amanda Nicole Ross","post_message":"\"There have been problems for a while, so this was inevitable.\""},{"comment_id":"921846451264234","commenter_b":"Hey al sharpton you and the guy next to you with the dorkey looking glasses on why don't you preach for colored people to be good instead of hate or is it because your so friggin stupid . I never realized that years ago back when you were a fat boy some one tried to kill you I guess your were spared so into the future you could spread your hate .","commenter_a":"Pay your taxes Deadbeat ! plus penalties, plus interest, You will when Trump takes over !","post_message":"\"...offensive and insulting.\""},{"comment_id":"985293351528112","commenter_b":"Well the high taxes on import/exported goods and labor, access fees to our harbors and Panama Canal or fees to get visas will sure help to pay for wall. LOL!","commenter_a":"Your country will PAY for the wall knucklehead, we hold the ACE CARD, your economy is DEPENDENT on USA! USA is a self contained nation. This is something a LOT of Americans have forgotten, this country is SELF CONTAINED, we don't need to import, we have RAW MATERIALS for EVERYTHING you can think of! I can't wait for factories growing all over USA like grass when Trump occupy the Oval Office.","post_message":"We're 'Not Going To Pay For That F*cking Wall'"},{"comment_id":"10153994248378132","commenter_b":"Illegals. Not immigrants.","commenter_a":"Ironic to be married to someone with such disdain for immigrants.","post_message":"Barbara Walters says she was surprised by Melania Trump."},{"comment_id":"631712173663014","commenter_b":"Illegals should not have the right to vote.","commenter_a":"Trump is the answer our country needs at this point in time. I have a feeling that this election in November will bring record number of voters -- what I don't agree with is that illegals have the right to vote. That is why the Democrats are pushing this because otherwise they will lose. Voting should only be for US citizens. Looking forward to a better and greater America come January 2017. #Trump/Pence.","post_message":"Watch: This was the highest-scored moment of the entire 2016 Republican National Convention, and it happened during Donald J. Trump’s speech as he addressed the corruption surrounding Hillary Clinton. @webpagelink"}]
