[{"comment_id":"10154325825161051","commenter_b":"Um I think this woman is a incredibly ignorant idiot, you can see anything in everything if you are looking for it. It is just a design of lines, what a dumbass","commenter_a":"If it offended you dont buy it.What's wrong with these cry babys","post_message":"Here's the Walgreens wrapping paper that had this lady outraged."},{"comment_id":"10153214192574170","commenter_b":"Could care less what she thinks !!!! LEAVE AMERICA!!!!","commenter_a":"Her opinion is s💱t Like her music Ghetto monkey opinions on race is ignorant and illegitimate Black rap culture is immoral dishonorable and gross","post_message":"I know, I know. \"who cares about some rapper?\"  The sad answer is \"a lot of people.\"  Conservatives have failed to engage in the pop-culture space for too long. That needs to change."},{"comment_id":"10154181766797093","commenter_b":"It's non violent offenses .","commenter_a":"What about victims? Can you erase their memory?","post_message":"If you have a criminal record, a group of Dallas county judges will help people with criminal records get their lives back on track. bit.ly/2li0sJ9"},{"comment_id":"1017838814918244","commenter_b":"Feminazis everywhere","commenter_a":"@username Fucking Feminazis...","post_message":"It's time to rethink sexism in toys."},{"comment_id":"10152540826575047","commenter_b":"Sign me up, no they should NOT be allowed back in the US, they're a security risk!","commenter_a":"Go fight with the enemy, you be become the enemy. No tollerance for deserters of the American Constitution. You are for America, or you are against America. No gray area here. Don't let these deserters back in. They leave, they stay gone forever!!!","post_message":"American citizens must not be allowed to fight alongside jihadists, only to then return to the U.S. to spread jihad here.   Sign & Share our petition to protect our homeland:  @webpagelink"},{"comment_id":"1759120751072019","commenter_b":"I don't want refugees coming in and I want Muslims out","commenter_a":"Wear a Make America Great Again hat! Fuckem!","post_message":"This was powerful!"},{"comment_id":"10154479942176509","commenter_b":"It's why we need the wall","commenter_a":"I wish the people of Mexico could do something to rid their country of all the corruption and hideous violence there. They deserve so much better.","post_message":"Five years ago Carlos Gutierrez had his legs cut off by Mexican police officers after not being able to give them extortion payments.  Today, he'll join a group of 400 people receiving blessings from the pope."}]
