[{"comment_id":"1170595402996226","commenter_b":"And the world would be a lot better place without your racist, misogynistic ass in it. Twit begone!","commenter_a":"Most admired my ass this stinking bitch allowed 4 people to die she a corrupt lying useless bitch should been in jail or zoo cage right next to the ape in heels","post_message":"Hillary Clinton just won Gallup's \"Most Admired Woman\" poll for the 21st time. Do you admire her?"},{"comment_id":"1640584582874588","commenter_b":"Arnel, stay away from my dog. Haaaaaaaaa!","commenter_a":"We should not reward liars... reject Hillary.","post_message":"“We should not reward people who use inflammatory rhetoric, who use the kind of derogatory comments, whether it's about Muslims, or Mexicans, or women, or people with disabilities, whoever it might be,” Hillary Clinton said, referring to Donald Trump. “That is not a sign of leadership. That's a sign of, you know, showmanship, of desperation, that should be rejected roundly by the American people.”"},{"comment_id":"702990689891509","commenter_b":"Vote for trump.he is going to kick.the illegals out of the.u.s.","commenter_a":"It Obamas fault.......#feelthebern","post_message":"Donald Trump was just stabbed in the back by the GOP. This is cut throat. Do you still support Trump?"},{"comment_id":"10156412412225354","commenter_b":"Fire the hoe","commenter_a":"I guess they suspended her because her job, if she is actually a reporter, is just that, report the news and don't add to it or shade it with your opinion. If you want to share your opinion get a job as an editorial writer but don't pretend to be a reporter if that is what you would rather do.","post_message":"What liberal media bias? That's just a figment of your fevered rightwing imaginations."},{"comment_id":"10152984234114726","commenter_b":"Deport all Muslims!","commenter_a":"Muslims can live in their Muslim lands in the Middle East. Europe must expel these terrorists. Unlike the Nazis, these Islamists will NOT be sent to concentration or death camps. They will be sent to their homes to stop their invasion of other lands. But we must say things that are NOT politically correct and follow those with actions if we are to survive these Islamic horde. Once they have enough power to resist, then it would be too late. Now is the time to deport, expel or arrest them. Now not later.","post_message":"VIDEO: RAW footage from the terrorist attack in Paris!"},{"comment_id":"10157151513605231","commenter_b":"Thank u god bless all of his children with love","commenter_a":"He had a dream and we are still dreaming and look how far that has got us police still killing us and now we helping them and everybody's out for themselves king would be shaking his head because we have sold out, we have become a consumer race of people for every other race but our on everybody makes money off of us just look around you where do you spend your black dollars ?","post_message":"On April 3, 1968, Dr. Martin Luther King, Jr. gave what would be his final and most recognized speech. On April 4, 1968, he was assassinated by a coward who doesn't even deserve to be named. Dr. King's contribution to the Civil Rights Movement and to the advancement of black people cannot be ignored. Thank you, Dr. King. \"Well, I don't know what will happen now. We've got some difficult days ahead. But it really doesn't matter with me now, because I've been to the mountaintop. And I don't mind. Like anybody, I would like to live a long life. Longevity has its place. But I'm not concerned about that now. I just want to do God's will. And He's allowed me to go up to the mountain. And I've looked over. And I've seen the Promised Land. I may not get there with you. But I want you to ..."},{"comment_id":"1215195555169015","commenter_b":"Angela Merkel sucks wake-up idiots please","commenter_a":"Actually, Donald Trump is the only candidate, with a proven business record, who can assess data, consult with people who need to be heard, and make decisions he can logically defend. Hillary's track record as a senator and Secretary of State are without merit! (Btw, I used to be a democrat but I refuse to vote - then or now - for the two most corrupt politicians of our era!)","post_message":"“She is the only candidate who can assess data, consult with people who need to be heard, and make decisions she can logically defend.” —WIRED on Hillary"}]
