[{"comment_id":"10153734368245950","commenter_b":"Here's another dense one told all her life she's witty","commenter_a":"It sounds like some shyt white Americans did to build this country then brag and say they did. Then tell u get over it.just saying the story sounds familiar","post_message":"The captives were sometimes held in chains, whipped, beaten and threatened, underfed or made to eat off the ground, according to a statement."},{"comment_id":"10153270179214087","commenter_b":"Wrong @username, when people come across any countries borders without proper papers in hand they are criminals hence they commit a crime. Trump is correct illegal immigration is the most pressing problem for this country of whi h it is not in the least ludicrous. If you are much wanting illegals here then why don't all you democrats join together, invite them to live with you and pay their way instead of demanding we tax payers pay for all the freebies they get, not to mention all those ancor babies that we have to pay for to be born then pay for them and all the freebies they will be getting for the rest of their live.","commenter_a":"real change like we have never seen before. Go Trump!","post_message":"When immigration activists began heckling Donald J. Trump for his remarks on illegal immigration at a rally Wednesday night, his supporters came to his defense."},{"comment_id":"343579349178913","commenter_b":"Nobodynis beyond the law!! ARREST OBAMA AND CHARGE WITH TREASON!!!","commenter_a":"That's because they are all STupid, and follow their leader and Nancy P.","post_message":"ICYMI - Nearly Half of Democrats think Obama Should Have the 'Right' to IGNORE the Courts!"},{"comment_id":"10153451774798132","commenter_b":"Some lesbians dress like men everyday.... Just saying.","commenter_a":"HE SAY'S HE IS A WOMAN BY ALL MEANS, BUT STILL DRESSING IN MEN'S DRESS SHIRTS?? humm I don't get that","post_message":"Here's what everyone will be talking about tomorrow."},{"comment_id":"10153069061709342","commenter_b":"Has She wore it all year? Then it would of been out of respect and not show","commenter_a":"Let her wear it!!!!","post_message":"A Native American high school senior is fighting for her right to wear an eagle feather with her cap and gown. She says its about respecting her heritage. School officials call it decoration."},{"comment_id":"10153499829950329","commenter_b":"Whooooah Michelle Esquibel Gena Esquibel","commenter_a":"Jenna Benham","post_message":"For a \"kids\" party, yes. Definitely not for adults. *coughs*"},{"comment_id":"10154208001624497","commenter_b":"an improper whore","commenter_a":"I'd recommend an 8 ball of crack and a proper whore","post_message":"\"Every reasonable alternative has been examined and exhausted; every rational avenue, from acupuncture to chocolate, explored to no avail.\""}]
