[{"comment_id":"584218068426739","commenter_b":"For sure playing the women card. Wouldnt have 5% of the vote without a vagina. Whos voting for vagina????","commenter_a":"Are you going to play the women card for the rest of the election? it's getting really old really quick....","post_message":"Like a boss."},{"comment_id":"10153583217394712","commenter_b":"I'm getting hit with smokers tax and I don't smoke. Time to divorce my wife and let her and kids go on state insurance and I'll pay penalty !! It's the American way.","commenter_a":"Up up and away....the never ending story of insurance rate hikes. We pay. $1200 a month as it is....SMMFH","post_message":"The state's largest insurer says they are dealing with more than $100 million in losses and other issues that have driven up costs."},{"comment_id":"10153628238979071","commenter_b":"Oh yes omg yall are so smart im so duum whyd i ever doubt yeuuu.. illiterate tards","commenter_a":"Why do people believe that ice melting in a closed ecosystem will cause the water to rise? I do live in one of these areas. I'll move when my toes get wet. Pretty sure FL has been becoming swampland for a super long time.","post_message":"Not good."},{"comment_id":"392158754326577","commenter_b":"I hope Trump wins the nomination. Then The Americans will for sure vote for a demokrat, whether it be Hillary or Bernie. No way the Americans are that stupid!!","commenter_a":"Isn't his stand against Muslims prohibitive by the Constitution and therefore automatically eliminates him from presidential nomination?","post_message":"Let’s stop the racism. Let’s stop the xenophobia. Let's stop Trump. #GOPDebate"},{"comment_id":"802250076569145","commenter_b":"You two should be sterilized","commenter_a":"Here comes the next Republican Party split. The birth of idocracy, with trump being the first idiocrat. All right America... Goodbye.","post_message":"On the morning after #SuperTuesday, one thing is clear: the GOP is at a crossroads."},{"comment_id":"10155230776483690","commenter_b":"Hahaha we cn kill u indian pigs","commenter_a":"They can kill only innocents, not terrorists. Pigs.","post_message":"In less than 24 hours after Pakistan's deadliest attack in more than two years, the army kills more than 100 'terrorists'."},{"comment_id":"10153210976889726","commenter_b":"The love affair begins","commenter_a":"How much are the promises he made going to cost us this time?","post_message":"WATCH: Obama and Castro sit side by side!"}]
