[{"comment_id":"666187176847797","commenter_b":"Too much butt kissing being done. The pilot and his white privilege remark, the seat mate's skin color even being mentioned, the flight attendant feeling compelled to apologize...oh, brother! This chick needs to put her big girl panties on and if she's a peace loving/seeking person, she'd drop the whole issue.","commenter_a":"So let all muslims boycott United, I will feel much safer with them not being there. Muslims are lower than whale shit.","post_message":"Look what happens when a flight attendant refuses to give a Muslim woman a Diet Coke..."},{"comment_id":"546417122231127","commenter_b":"You're so racist it's sick. Tell that to the kids who can't go to school because they can build multimillion dollar stadiums or provide tourist attractions all while shutting down schools. You grew up a sheltered white girl. I already know.","commenter_a":"They lack the testicular fortitude to do this on a Saturday night around 2 Am in Miami 's Liberty City or Overtown or in front of Snoop Dog's house in LA. Instead they go on a Sunday afternoon, when this office is closed. I see nothing but loudmouth cowards with missing teeth and bad clothes.","post_message":"White Lives Matter group protests outside of the NAACP in Houston's third ward! #WSHH #NAACP #Houston #WhiteLivesMatter #BlackLivesMatter #AllLivesMatter"},{"comment_id":"1849864471907247","commenter_b":"Oh yea, he needs another wife. Loser!","commenter_a":"Too soon!","post_message":"As no surprise, Gwen Stefani said yes!"},{"comment_id":"1090441274344209","commenter_b":"People keep saying this but it seems like Hillary IS our Trump-like candidate.","commenter_a":"Allow me devil's advocacy: 1. If the dems ever run a \"Trump\"like candidate, the super delegate system would be designed to stop that person. 2. Getting more than a small percentage of voters to the primary booths will make the dem party more democratic than overhauling the super delegate system","post_message":"Ending the superdelegate system is what will make the Democratic Party more democratic. This is the kind of grassroots democracy that will help the Democratic Party grow and win elections."},{"comment_id":"392535437595004","commenter_b":"What a misogynistic jerk!","commenter_a":"WTF? what a loser! how is this guy in politics? what a loser!","post_message":"No, there's no GOP war on women."},{"comment_id":"628508020691140","commenter_b":"Put her out of the white house","commenter_a":"Michelle Obama is a awesome person she certainly a lady of class.","post_message":"Michelle Obama has just broke the last straw. She should have been kicked out of the White House a long time ago. Do you think Michelle Obama is the worst first lady in history?"},{"comment_id":"1255997957800290","commenter_b":"Drop her ass off after 😂","commenter_a":"At least he was a gentleman and took you to dinner after.","post_message":"Separate bills please. #WSHH"}]
