[{"comment_id":"483171531871140","commenter_b":"Amen","commenter_a":"Ya, Right. would never believe this bullshit!","post_message":"Shocking!"},{"comment_id":"10154139350608132","commenter_b":"She needs her original face back. She looks just like thousands of other women who have paid to look like Jack Nicholson's version of The Joker.","commenter_a":"For the love of God, someone give her a sandwich...stat!","post_message":"Patrick Dempsey's plans for divorce are now off the table."},{"comment_id":"10154846804139411","commenter_b":"Goat fucking muslims","commenter_a":"Stupid curry eating Hindus","post_message":"'Not in the spirit of a Sport'"},{"comment_id":"10152873585726051","commenter_b":"I thought they are suppose to be getting a education if they are going to act like fouls then everyone needs to pay and kick them out of school so somebody wanting to be there can.","commenter_a":"What a disgrace!!! Is this what they went to college for? They should be expelled and not allowed in any other college!! Let them have to work hard for the rest of their lives!!","post_message":"This fraternity caused $430,000 in damage and wasn't sorry about it at all. Well, now they're sorry."},{"comment_id":"10154403631241509","commenter_b":"Soooo she will be participating in the great invasion Day for sure then..you people are true life devils and still till this day it shows......GO BACK TO THE CAUCASUS MOUNTAINS !!!","commenter_a":"She's clearly in love haha with money","post_message":"Mariah Carey is set to marry an Australian billionaire."},{"comment_id":"10158192109115206","commenter_b":"Moms Le Lotpi go to the kitchen? Is that where you think all woman belong? So ignorant.. Put your wife in the kitchen!!","commenter_a":"Wtf is wrong with these parents today. Heartless, deranged animals! Torture her slowly to her death..","post_message":""},{"comment_id":"10150690692729999","commenter_b":"Maybe this can cut back on oil use?","commenter_a":"They should never have entertained the idea of the pipeline in the first place. Sending that dirty oil through our country was a really bad idea.","post_message":"Barack Obama has rejected the request to build the Keystone XL pipeline, saying it \"would not make a meaningful longterm contribution to our economy.\""}]
