[{"comment_id":"10153113232077093","commenter_b":"Drum Corps have endured worse sweetie, you're giving us band nerds a bad image, we are not weak...","commenter_a":"She got a bruise you can get that walking into a counter at home. She still continued to perform after. It was accident. My generation because I'm 20 is so weak it's pitiful. I was always told to get back up if it's not broken or bleeding. I played football with a concussion and a separated shoulder. So a bruise is easy to deal with.","post_message":"The father of a high school band member who was hit after one school’s football team crashed the half-time show says his daughter is still in pain...  WATCH: @webpagelink  READ: @webpagelink"},{"comment_id":"10153016776944117","commenter_b":"Cause she was terrible. @webpagelink","commenter_a":"Because they are willing to sell out.","post_message":"From RUSH drummer Neal Peart to Rep. Paul Ryan to Uber CEO Travis Kalanick. Why do famous people deny that they admire Ayn Rand?"},{"comment_id":"10153621315776037","commenter_b":"Me either, but because of my mom, I've been around terminally ill people as I worked for her. This is a big deal and I believe it's important. Suffering through a long painful death is hard on families as well as patients.","commenter_a":"Death with dignity is a big deal to people. Unless you're living with a terminal illness, I suggest you leave your judgement at the door.","post_message":"Religious groups and advocates for people with disabilities opposed a nearly identical California bill earlier this year."},{"comment_id":"10158310227560389","commenter_b":"I think they are GRRRRRRRREAT!!!!! For the first time in my adult life, in a long, long time, I feel very proud to be an American!!! President Trump has done more in his first few days, than Obama did in 8 years!!!! Thank God we are rid of Obama and his family!!!","commenter_a":"He is doing great as we expected doing what he said he would do !!","post_message":"Question of the Day: What do you think of the moves President Donald J. Trump has made so far?"},{"comment_id":"10153809270614454","commenter_b":"Hurrah! Hurrah! Hurrah!!!","commenter_a":"Couldn't happen soon enough. Long overdue .","post_message":"ICYMI: This week, Hong Kong pledged to ban the import and export of Ivory goods. #SaveElephants"},{"comment_id":"10156195234480093","commenter_b":"Guns are not only made here...","commenter_a":"People said America is full of nuts but before reading these comments i did not believe it. Take all the guns and destroy all the gun factories and find out what living in peace means","post_message":"Let's have an HONEST conversation about it."},{"comment_id":"806051249493483","commenter_b":"Republicans....","commenter_a":"What flipping IDIOT would vote for this nut","post_message":"He leads his closest competitor by 11 percentage points."}]
