[{"comment_id":"10153640013936636","commenter_b":"O questo o un procione non voglio altro siamo io e te li vedi li vedi Dio pinolo?!","commenter_a":"Luca sparati in bocca con me","post_message":"Red pandas have an adorable wrestling competition  Via Detroit Zoo"},{"comment_id":"902172716496023","commenter_b":"I stand corrected. It is Planned parenthood that started with the concept to murder black babies before they were born.","commenter_a":"Aren't the Democrats responsible for the initial abortion idea and practice? Also, the plan was to abort unborn black babies. Who's the racist? Hint...DEMOCRATS!","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"628263567364222","commenter_b":"I'll stick with Palin on this issue!","commenter_a":"Sarah Palin is just an nut","post_message":"Americans are now claiming that Sarah Palin is racist.  This is absurd. Sarah is under attack, let's get her back.  Do you support Sarah Palin?"},{"comment_id":"985965458116748","commenter_b":"Crazy witch","commenter_a":"This is murder , God forgive us if we don't stop this","post_message":"Pro-abortion Congresswoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb. baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"10154534955796336","commenter_b":"Hillary will NEVER do time for all the crimes she has committed. She and Bill have been getting away with their CRAP for YEARS. Just because it's a different year, doesn't mean anything will change.","commenter_a":"Hillary Clinton will win the election in November. Then, sometime between November and January, Hillary will be indicted. The IRS is now investigating the Clinton Foundation and the whole e-mail thing isn’t over yet. Once under indictment she won’t be able to assume the Office of the President in January. Tim Kaine, who will not actually be the Vice President because neither he nor Hillary have been inaugurated, cannot assume the Presidency. The Speaker of the House can’t move up to it because there is already a sitting President and Vice President. So President Obama, in an Executive Order citing “emergency situation,” gives himself another four years in office is the only way possible. Obama has been planning this for a while now, knowing he has enough on Hillary to indict her. Had the Attorney General indicted her based on evidence from the FBI this plan wouldn’t have worked because ...","post_message":"\"The terrorists overseas utilize our strengths – which are compassion and empathy – against us.\"   Kris \"Tanto\" Paranto, who survived the attack in Benghazi, expressed his support for a more rigorous vetting process for refugees."},{"comment_id":"897302730329476","commenter_b":"and youre famous for? ABSOLUTELY NOTHING","commenter_a":"It's funny how Your ugly dress made you famous more than your music did !","post_message":"#thedress girl speaks: 'It's madness. I feel like I'm living in a dream'"},{"comment_id":"10154318363317232","commenter_b":"Why aren't they being plowed through? Run these scumbuckets down!","commenter_a":"Sent in the robot","post_message":""}]
