[{"comment_id":"10153619254387439","commenter_b":"You stupid son of a bitch. She will never do a day in jail. Dream on asshole.","commenter_a":"FBI didn't seize a fucking thing, they were voluntarily turned over to the FBI and justice department. Geller is a rotten crotched liar.","post_message":"// google_ad_client = \"ca-pub-@username\"; google_ad_slot = \"@username\"; google_ad_width = 336; google_ad_height = 280; // ]]> // // ]]> Hillary is such a tool for jihad and a knave to her lover pal Huma Abedin, I don t care how this destroyer gets her comeuppance, as long as she does. Like Capone and tax evasion charges. It was hardly the worst of what he did, but it got him put away. She should be sitting in prison for Benghazi, but if this is the best we can do, so be it. Although I hardly trust the DoJ. WASHINGTON As pressure builds on Hillary Clinton to explain her official use of personal email while serving as secretary of state, she faced new complications Tuesday. It was disclosed her top aides are being drawn into a burgeoning federal inquiry and that two emails on her private account have been classified as “Top Secret.” The inspector general for the Intelligence Community notified senior members of Congress that two of four classified emails discovered on the se"},{"comment_id":"1083798295013251","commenter_b":"The JUDGE is a woman...","commenter_a":"How stupid!!! Wonder how this guy became a judge!!! Her mother is with her!!! Who is the idiot who is challenging her contract? Hang tough Bindi!!!","post_message":"A court judge is demanding proof that the 'Crocodile Hunter' is dead.  (via Daily Mail Australia)"},{"comment_id":"1106662279389311","commenter_b":"Kick their sorry butts off the team!!","commenter_a":"They obviously don't have good leadership, good manners, honor and respect come from the top. Must be some bad coaches and school administration!!! Teaching them disrespect and telling them it is \"freedom of speech\". Just wait they will soon have wished they hadn't disrespected this country. Muslims and sharia law will be your worst nightmare!!!","post_message":"This is beginning to happen nationwide and it is a travesty!  Do you hold Barack Obama responsible for his role in the #BlackLivesMatter movement to disrespect our flag?"},{"comment_id":"957903450911743","commenter_b":"Muslims are still using the jiihad to increase their power and stupid European leaders are letting it happen.","commenter_a":"LanceBell fox loves you","post_message":"Spread this everywhere:"},{"comment_id":"942676889125393","commenter_b":"Is she ROYALTY ?","commenter_a":"How much did the vet charge?","post_message":"60-stone woman lifted out of her home by a crane in a SEVEN-HOUR emergency operation"},{"comment_id":"502375926577851","commenter_b":"WELL damn go fund ME!","commenter_a":"It worked for this hating pig, wait for the next one. Gopers are slow learners.","post_message":"I'd say I've been doing it all wrong the past few years... except I'm a decent human being with a conscience... via The GOOP  | Liz"},{"comment_id":"10153708782186350","commenter_b":"Michelle ovomit is the washed out hag!","commenter_a":"Michelle Obama is a wonderful woman who deserves respect. She didn't do anything to you. Stop acting like 12 year old bullies and grow the hell up","post_message":"Find out what Michelle Obama can't wait to do once she leaves The White House."}]
