[{"comment_id":"10153069426151770","commenter_b":"GIVE ME A BREAK. !!!!!!!! WHITE LIVES MATTER. LATINO LIVES MATTER. ASIAN LIVES MATTER. NATIVE AMERICAN LIVES MATTER. BLACKS ARE NOT THE ONLY ONES THAT MATTER","commenter_a":"Blue lives come in all colors, both sexes all nationalities. What a moron.","post_message":"TheGrio, the segregated NBC News website, and MSNBC claim racism and 'controversy' in caring about the lives of police officers."},{"comment_id":"1772923492974110","commenter_b":"'@username .. Tippu tip, one of the greatest slave traders known to man that had over 10,000 slaves in Zanzibar, grandmother was a muslim slave. The problem with islam is the contradictions. You inherit the greatness of your lineage as well as all of the ills. The first step for Muslims to get passed this & be accepted in the international community is to accept the past for what it is & stop lying, deflecting, & manipulating it. It only creates more RAGE! Everything in this video is FACT and supported with 100's of years of abundant evidence. This video is actually a low ball. The actual number of victims of islamic genocide s 100 - 150 million deaths. Please stop telling me about 'bilal' that was a slave in the first place by an arab. Abu bakr freed 3 personal pagan slaves for bilal's emancipation. Am I suppose to ...","commenter_a":"This is the blind teaching the blind. A ratings based media hub focusing on the impulses of the ignorant. This is not accurate about Muslims and therefore makes it inaccurate of Arabs. All Arabs aren't white. There was a black Arab named TIPPU TIP, he was one of the biggest contributers to slavery. He was very black. Look him up. Also, a Arab can't teach islam. Because Islam isn't synonymous with Arabs, it's more wide spread with Asians. Indonesia is the largest population of Muslims. All Arabs aren't muslim. And there were many Arabs who rejected Prophet Muhammed. I love history but I hate when people try to each topics of sensitive topics but pose a biased view. Black people must realize we are not all the same. Americans aren't the same a all Africans. We know why we're African, but most don't know we're more American than the white ...","post_message":"10 Facts About The Arab Enslavement Of Black People Not Taught In Schools"},{"comment_id":"10153757809364877","commenter_b":"She wouldn't even have had the chance to do that to me, once I saw the knife in her hand it would be over for her with the quickness! I hope she gets arrested and that boy leaves her high and dry if he hasn't already!","commenter_a":"He should run and never look back","post_message":"Woman holds knife to boyfriend’s throat, forces public apology for flirting on Instagram.   Grio fam, how would you react if your son or daughter was in this relationship? Please be advised that this footage shows graphic imagery."},{"comment_id":"897791007078142","commenter_b":"Shes ugly","commenter_a":"Gosh is she going to lose in PA again?","post_message":"Hillary makes disturbing announcement about development in Pennsylvania. We could be looking at history right now. Will you refuse to let Hillary be your president?"},{"comment_id":"10153775506759203","commenter_b":"'@username Look over this list....Drugs & guns to YOUR front door, so tell me again how gun control works!!!! @webpagelink","commenter_a":"Gun bans have always had the same effect once implemented: none. They do not create a (sustained) period of increased murders, nor do they reduce the rate of homicides.. @webpagelink","post_message":"'We can toughen background checks and stop the sale of firearms to folks who have a violent history or history of mental illness.'  Amy Schumer"},{"comment_id":"10157089744255347","commenter_b":"If Obama lied about military service/valor, would he be a hero or a liar? My guess is he'd be a liar, so how is this man still a hero?","commenter_a":"Chris Kyle was an American war hero...PERIOD. You liberal hacks need to find another hobby :/!","post_message":"American Sniper Chris Kyle told yet another lie: How many medals he received."},{"comment_id":"10153091862830329","commenter_b":"Some women like to be told.","commenter_a":"This world needs to stop being offended by everything, and just let people live their lives.","post_message":"A pledge email from the University of Southern California’s Alpha Chi Omega chapter published by Jezebel today shows how authoritarian the sorority’s rules are for things like hair color, eyebrow shape, and required Spanx wearing."}]
