[{"comment_id":"10153844066851770","commenter_b":"******* PENCE WHIPPED WITH A KAINE *******","commenter_a":"Not too much for me to say, I hope they both lose. God bless the U.S., amen.","post_message":"The #VPDebate is over, but there's still a lot to talk about. Like that rumor that Trump is mad about Mike Pence doing so well, or all those times Tim Kaine interrupted him. Keep watching for a special round of trivia, starring a giant tub of Nutella. Your hosts: Christopher Bedford, Christian Datoc and Katie Frates."},{"comment_id":"10154335098801002","commenter_b":"Amy... are you serious?!?! IQ test?!? A lot of criminals have high IQ's when tested! It has NOTHING AT ALL TO DO WITH IQ! It has EVERYTHING to do with COMMONSENSE!!","commenter_a":"Why is she being charged it was completely the guns fault lol","post_message":"CHARGES: A woman who fired her gun at suspected shoplifters in a Home Depot parking lot has been charged."},{"comment_id":"875339435822246","commenter_b":"And that wig is horrible!","commenter_a":"No new news...She says that about all men. No shame and straight up tacky.","post_message":"Sherri Shepherd Wants To Sleep With Johnny Gill… @webpagelink"},{"comment_id":"10153359064344411","commenter_b":"Just say it mate... She's a cunt spread the word","commenter_a":"If she is poor with $30 millions in her pocket imagine me without $30 millions smh","post_message":""},{"comment_id":"10153096190609614","commenter_b":"What kind of women gives up their child?","commenter_a":"Great daddy! This baby is so LUCKY to have such loving and loyal to baby kind of daddy!","post_message":"After this baby mom abandoned him because he was born with Down syndrome, his father stepped in to raise the son he calls and as a single dad. Leo Forrest was born in Armenia last month. Upon learning of the genetic condition, his mother and her family gave up on the child. They also told Samuel Forest he would no longer be welcome in their home if they decided to keep him, according to a GoFundMe page set up to help Forrest and the baby. Faced with a difficult choice -- his wife or his infant son the new father chose Leo. She has since filed for divorce, he says. Forrest is returning to Auckland, New Zealand, where he is originally from, to raise the baby. Read KTLA story here: @webpagelink"},{"comment_id":"10153163966344255","commenter_b":"Where my confusion comes in is most people don't trust the government with their money but they will trust it with their children's lives....","commenter_a":"See fellow liberals? This is the fanatic pro-vaxxers showing their true face. Fascist totalitarianism. Hitler and Mengele would be proud of the folks signing this petition. These are not liberals. These are corporate thugs in disguise using liberal forums like @username to try to convince us that the pro-vax position is the smart, scientific , modern one and that vax-skeptics are a bunch of right wing anti-science fundamentalist boneheads. Its simply not the case. The real smart folk can see right thru this Big Lie that all vaccines are perfectly safe. They clearly are not. And most of us do not want to ban vaccines as they would have you believe. We just want safer vaccines, common sense, and for folks to see both sides of the scientific debate. And yes, vax fanatics, there IS a scientific debate.","post_message":"Public health must trump parental choice. Tell your governor to introduce legislation to ban all belief-based vaccination exemptions."},{"comment_id":"10153226517872232","commenter_b":"Probably...","commenter_a":"And while all were watching the fight 1 or more were most likely walking out with merchandise","post_message":"CAUGHT ON VIDEO: Several women got into a brawl Friday afternoon inside the popular Rittenhouse Square clothing store, Zara --> @webpagelink"}]
