[{"comment_id":"1042921652395512","commenter_b":"Clams don't eat salt. That's its foot anyway.","commenter_a":"Now who wants to lick salt off a clam","post_message":"It's easy to forget that shellfish are animals ... until you see something like this."},{"comment_id":"10157170758630354","commenter_b":"This woman is psychotic.","commenter_a":"She's fucking disgusting to look at! A professional con artist like the Obama's and the privilege Clinton's they all should get tarred and featured in public !","post_message":"Want nightmares? WATCH:"},{"comment_id":"388258684695759","commenter_b":"We all need to ban to gather and kick all Muslims out of this country they have no say so in this country if they want say so they need to go back to their own country this is United States of America not Mohammed country","commenter_a":"You damn right. All states should do this","post_message":"It's time that all the states do the same..."},{"comment_id":"10154993397619254","commenter_b":"Hello from erie pa my is he getting big","commenter_a":"His fur is waterproof.","post_message":"HAPPY FRI-YAY! Eaglet E9 is relaxing in the nest this morning. We can't believe how big E9 is! The eaglet will look more like an eagle as soon as white feathers start coming in :) Where are you watching from? @webpagelink"},{"comment_id":"1004765479656630","commenter_b":"That's no lady. Bigger dick than Barry.","commenter_a":"Disgraceful First Lady","post_message":"Hot diggity dog..."},{"comment_id":"10153348375511756","commenter_b":"Women are just as capable of destroying the infrastructure of poorer countries leading to the suffering and death of millions of innocent people as men are.","commenter_a":"No women on front line.","post_message":"Cpl. Jasmine Abrego is just 5 feet 1 inches tall. She left her job as a Marine clerical worker to train for the infantry and, as she puts it, \"kick bad guys' butts.\" \"Mentally it's just being strong, you just get stronger,\" she says. \"You just push yourself through it, that's what I've been doing.\""},{"comment_id":"1587873301226283","commenter_b":"They won't do that. They are professionals and have ethics.","commenter_a":"This is how it is going to work now for the Libs. If you voted for Trump there will be a price to pay. Lost a lot of money because of Obama in Office and I let it be. Be careful Libs, Don't get Jammed up. Most of the Police, Firemen, and Military are Conservative. What would happen if they decide not to respond because your a known Lib.","post_message":"\"WON'T BE BULLIED.\""}]
