[{"comment_id":"10153647642558352","commenter_b":"She's the other woman, this is why women need to stop claiming men until they put a ring on it and claim you","commenter_a":"Sad","post_message":"GIRLFRIEND FINDS OUT ON SOCIAL MEDIA HER SUPERSTAR SOCCER PLAYER BOYFRIEND MARRIED ANOTHER WOMAN RIGHT AFTER SHE DROPPED HIM OFF AT THE AIRPORT (PHOTOS)  This is real bad!"},{"comment_id":"1197017153648966","commenter_b":"Get her on board and watch him sink........","commenter_a":"Her only claim to fame is loosing and quitting.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"936644226390980","commenter_b":"The typical holiness young woman will argue with a tree and maybe this is why they got together and removed this mother from the church the reason refused to listen to anyone else way of thinking you be bless and I hope you live as long as the 103, may the same happen to you","commenter_a":"From what the article said... she thinks he's trying to change the denomination of the church. .. this beautiful 103 mother misunderstands that Holiness is a way of life.. not a denomination.. the Pastor could have handled this better. .. there's no need to put her out of the church. . To be sanctified means to live a life separated from sin.. that's not a denomination either. .. sounds to me that teaching through love and kindness is in order.. people seem to fear what they don't understand. . To call her names and disrespect her by leaving her in a dark church is not right and does not reflect Holy living . They need to repent of that.. always respect your elders regardless. .. but also remember .. just because your old does not mean you know all the way of the Lord... no one does.. that's why we ...","post_message":"A 103-year-old Georgia woman was banned from the Elberton church she’s served for 92 years after she voiced concerns about the pastor’s sermons.  After ignoring the ban and attending church the weeks after getting the letter, the pastor dismissed the service and left her sitting in the pew with the lights off. Police were notified, but refused to throw a 103-year-old woman out of church.   She was also subjected to slurs from their former fellow churchgoers. MORE ----->  @webpagelink"},{"comment_id":"10152893024866051","commenter_b":"Yeah ? How bout someone take a cane to your goofy ass an lets see if it looks like paint..Oh no...lets not.... forgot your ass looks like a map from rand mcnally with all those ugly stretch marks....yuck","commenter_a":"That looks like paint, not blood.","post_message":"This man’s wife has been found guilty of domestic abuse against him. Even she wasn't expecting so much jail time."},{"comment_id":"102418186941623","commenter_b":"'@username 99% of the Republicans that seem to comment in these venues seem to share the same ugly views. Those that aren't like that need to speak up more.","commenter_a":"That's because Republicans are selfish, self-righteous, hypocritical pieces of shit who are blowing loads over their new ability to grab power.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1024079497651798","commenter_b":"She's not a model , clearly, unless she is modelling Down Syndrome !","commenter_a":"Yes it's great and all but why does she constantly be labelled as the Down syndrome model, just call her a model.","post_message":"'People with Down syndrome can do anything' (via Daily Mail Australia)"},{"comment_id":"10153866172049411","commenter_b":"Jews can suck a dick","commenter_a":"Satanism and Islam are the same thing","post_message":"dudes have offered to escort Muslims and Sikhs afraid of hate-attacks for groceries and elsewhere."}]
