[{"comment_id":"10153344147357439","commenter_b":"Lol is that where Muslims come from? Wow didn't know that!","commenter_a":"Send them back to Egypt.","post_message":"DC Area Professor To Catholic University: Too Many Crosses On Campus For Muslim Students To Pray @webpagelink Anywhere American law and Islamic law conflict, it's American law the inevitably has to give way. These demands for special accommodation are everywhere. Hertz, Heinz, Costco, IKEA, Target, Wal-mart, Disneyland, McDonalds and hundreds of others have all been in the cross-hairs. Islamic demands and the ensuing lawsuits in order to impose sharia...."},{"comment_id":"10153992942406316","commenter_b":"what is the life span of a fruit fly??","commenter_a":"Wayna Biggs","post_message":"Truvia sweetener a powerful pesticide, kills fruit flies in less than a week..."},{"comment_id":"10154304123721051","commenter_b":"When Leftists Attack - Man Harassed For Wearing #BuildTheWall T-Shirt","commenter_a":"Teddy Roosevelt was our President during a different time period. Our country has grown in diversity, and as we continue to progress, expanding our minds and opening our hearts is the order of the day.","post_message":"Do you agree or disagree with this Theodore Roosevelt quote?"},{"comment_id":"10154736430788984","commenter_b":"I think she's loosing her butt and I'm glad!","commenter_a":"So go be a Grandma and get out of the race.","post_message":"It took Hillary Clinton less than 15 words to show her debate strategy in a very clear way. Do you think Donald J. Trump is winning the debate?"},{"comment_id":"10153274022815326","commenter_b":"The DNC are the ones calling in the second string. I do like VP Biden, and respect him, but it is obvious that the DNC establishment see Hillary as a loser now. Senator Sanders is the ONLY candidate who is fighting for ALL of WE are the 99%. The media and their Oligarch Masters are afraid of Bernie Sanders, which is why they have been ignoring him. Bernie is fighting for WE the 99% regardless of race, age, gender, sexual orientation or beliefs. He should be getting 99% of ALL votes including republicans, democrats and independents. Let's all vote for our own self interests for a CHANGE. FEEL THE BERN? Everyone had better or we are doomed.","commenter_a":"The Dem establishment can't be too pleased if Biden does decide to run. Could hurt Hillary by splitting the establishment vote.","post_message":"Vice President Joe Biden is still figuring out if it is in his heart to run for President again in 2016. Biden is a fighter for the middle class, Ed Schultz and Katrina vanden Heuvel discuss. Watch the entire show at: @webpagelink"},{"comment_id":"10154307546211509","commenter_b":"Joking? Missing a punch line...","commenter_a":"Fox News: Thug tries to jump on three girls, and bullets stopped him. Bill O'reily: What was he trying to do to those three girls before the bullets? We're just asking questions.","post_message":"15-year-old Zaveon Dobson was shot and killed after he jumped in to shield three girls from gunfire. @webpagelink"},{"comment_id":"10153252345186990","commenter_b":"Roger Morris it is Justin Bieber!","commenter_a":"Lisset Medina","post_message":"#SB50 SIGHTING: Justin Bieber spotted taking pictures with fans in San Francisco. @webpagelink Have you spotted any Super Bowl celebs yet? Tell us below! [Via @JBCrewdotcom]"}]
