[{"comment_id":"1815699362041993","commenter_b":"Can't stand that wretched woman","commenter_a":"I was gonna click for sound but then I saw a clip of Tomi Lahren pop up and thank god I dodged that bullet #iamsaved #toliveanotherday","post_message":"Republicans think protesters should just get over it and accept the results of the election just like they did when Obama won in 2008 and 2012  Oh wait..."},{"comment_id":"10154153789003010","commenter_b":"Gee, I bet General Petraeus wishes people held him to the same standard they hold Clinton. Maybe if he put a (D) next to his name, he could have gotten away with it.....","commenter_a":"Hillary Clinton has been a dedicated public servant for decades and she will be an awesome president.","post_message":"Let's not mince words: Clinton screwed up. But did she commit a crime, asks columnist Doyle McManus.   (via Los Angeles Times Opinion)"},{"comment_id":"10153806670970329","commenter_b":"No. I'd rather have this Screw spiders","commenter_a":"THIS IS WORSE THAN 100 SPIDERS","post_message":"Always look under your bed! (via BuzzFeed Trending)"},{"comment_id":"10153585954722994","commenter_b":"White people are the terrorist.....not Muslims","commenter_a":".","post_message":"After last week's attack in Tennessee, this man showed up at a military recruitment center with his AR-15 - but preventing another attack isn't why he did it."},{"comment_id":"10153226681651833","commenter_b":"Thanks Jason - the 'next one' will probably effect me, though.","commenter_a":"I don't even own an AR, but I sent an e-mail to the ATF 'comments' site opposing the ban on M855. I also sent e-mails to my congressman and both senators and signed a petition about the same issue. I suspect that the motivation is simply that the government doesn't want those who own ARs to have a source of reasonably priced ammo for their guns. I oppose this mindset.","post_message":"A notice from the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF) shows the agency is considering a ban on the popular M855 AR-15 round  by re-categorizing the round as  piercing.  Be sure to contact ATF and let them know you oppose this proposal. Then contact your members of Congress and express your opposition to ATF's ammo ban.  @webpagelink/ #M855"},{"comment_id":"10152853716122894","commenter_b":"I get tired of hearing about this lil hoe everyday","commenter_a":"Biancaa Ft Blue","post_message":"Watch: Kylie Jenner Gets 'High as F*ck', Tries Popeye's Chicken for the First Time [Video]"},{"comment_id":"10154227931919087","commenter_b":"They can have the goof!","commenter_a":"Fake polls Hillary is up 5.6 pats in NH","post_message":"The most recent New Hampshire polls shows Donald J. Trump with a slim lead."}]
