[{"comment_id":"10155022606302501","commenter_b":"Why. Dont. U. Suck. His. Cock. Bitch.","commenter_a":"Donald Trump is a psycho and a nut has no business running for president","post_message":"John Kasich will be on the outside looking in for the RNC, but what is he really up to?"},{"comment_id":"10154601974052690","commenter_b":"Could it be that she is still here illegally","commenter_a":"The other problem people need to understand is everyone that is Spanish is not from Mexico. This woman is from San Salvadora. Everyone automatically thinks Mexico. I wonder why? Could it be ignorance taught to them by ignorant people. There are so many \"illegal immigrants\" here that people assume are from Mexico when in fact they are not. Stop stereo typing and get educated.","post_message":"An undocumented woman in need of surgery to remove a brain tumor is being held at a North Texas Immigration and Customs Enforcement detention center, her attorney says."},{"comment_id":"450455948478319","commenter_b":"Get off her fat butt and walk. That does not cost. Stop whining and exercise at home. Absolutely disgusting.","commenter_a":"Yet she has enough to do that fugly bozo the clown hair color","post_message":"Should All Welfare Abusers Be Arrested?  Comment 'yes' or 'no'."},{"comment_id":"10153064930639135","commenter_b":"She should be returned to New Jersey. So should it's Governor.","commenter_a":"Why wait until the end of August? Drop out now and avoid two weeks of mental anguish. It's over for you, which is a good thing for America.","post_message":"President Obama and Secretary Kerry, now that we have an American flag flying in Cuba, I urge you to demand the immediate return of Joanne Chesimard to New Jersey.  Like so many others, the families of her victims continue to suffer under the Castro regime. Justice must be served."},{"comment_id":"10156217121965725","commenter_b":"@username, ur just a stupid liberal who wont open ur eyes... If u think Veterans get better treatment than these illegals ! You must be screwing one. Idiot","commenter_a":"America needs Trump for President !!!","post_message":"Notice that illegal immigrants will be given ObamaCare and free college tuition but nothing has been mentioned about our VETERANS #DemDebate"},{"comment_id":"10157436737495389","commenter_b":"If you are Gay, why are you voting for Hillary when she wants to bring in millions of refugees that believe gays should be executed If you are Black, why are you voting for Hillary when she defends Planned Parenthood and admires Margaret Sanger, who wanted to abort as many black babies as possible and exterminate the black race because they are like \"weeds.\" Most of those clinics are in Black neighborhoods. If you are a Woman, how can you vote for Hillary when she has buried all of Bill's rape victims under the rug. As an attorney, Hillary also defended the rapist of a 12-year old girl and laughed about it later. She plays the woman-card and acts entitled; implying that she deserves your vote merely because of her sex. How is that gender neutral? If you have are a Miner, Steelworker or have a Factory job, why are ...","commenter_a":"You don't understand. Obama and cronies want Islam here, and Islam is intrinsically radical. It advances their agenda of Societal destruction, \"social engineering\".","post_message":"\"I think if we don't speak honestly and clearly about what's happening, [then] we can't solve the issue.\"  Karen McWatters, who lost her leg in the Boston Marathon bombing, said the President and other leaders can't solve the problem of radical Islam until they're willing to call it what it is."},{"comment_id":"1836845559870004","commenter_b":"She doesn't deserve to be nominated.. What a laugh..","commenter_a":"Her expressions are the worst.... From her constant head nodding to her wide eyed expressions. And what's worse is when she opens that mouth of hers to spew out a constant stream of lies...","post_message":"Balloons are released to celebrate the official nomination of Hillary Clinton & Tim Kaine."}]
