[{"comment_id":"10154432726796320","commenter_b":"Another white woman mad","commenter_a":"Oh let's not forget how a caucasian family looked away from there child in Disney and the alligator got him(🙏🏾) did they drag his parents threw the news talking about their backgrounds? Nooooooo but a African American child falls in a gorilla pit and they put his fathers picture up and he wasn't even around!!!!","post_message":"In a dramatic image, a protester is grabbed by police officers in riot gear after she refused to leave the road in front of the the Baton Rouge Police Department Headquarters on Saturday. She has been identified by multiple media outlets as Ieshia Evans, 35, a nurse and mother of a 5-year-old boy. (AP Photo/Max Becherer)"},{"comment_id":"10154622879034024","commenter_b":"I think she should sue the college to go back and redo the 4 years and maybe learn something.","commenter_a":"There's no way she could be that dumb and have finished high school.I think we need to have a new law enacted Where our leading officials must have t least a IQ of 117 or above.But Them that would knock out 85-90% of them .","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1053133688060436","commenter_b":"What!!!???","commenter_a":"We're number 1!! We're number 1!! Oh wait......","post_message":"While the rest of the world is reducing maternal deaths, the number of pregnancy-related deaths in the U.S. continues to rise. In fact, America now has the highest rate of maternal deaths in the Western world."},{"comment_id":"10153474188676350","commenter_b":"But they can't make babies it takes a man and a woman to have s baby","commenter_a":"So wrong","post_message":"#BREAKING: Supreme Court makes same-sex marriage legal nationwide in landmark decision."},{"comment_id":"1085637111459772","commenter_b":"Y'all sound like a bunch of cheating mistresses!!!","commenter_a":"Here you go If you plan to vote for Ted Cruz, you MUST know these things! Educate yourselves on him and his wife * Heidi Cruz has been employed by Goldman Sachs since 2005. She is currently on leave. * Heidi Cruz is a member of the leftist council on foreign relations, advocates of world Government and a New World Order. * Ted Cruz was George Bush's top policy advisor. * Ted Cruz was in the federal Trade Commission. * Ted and Heidi met when they were both Bush staffers. * Cruz advised on legal affairs and Heidi on economic policy for the bush administration. * Heidi was director for the Western Hemisphere on the national security council under Condoleeza Rice. * Heidi served as deputy U.S. Trade Representative to USTR head, Robert Zoellick, working on China trade policy. * Ted Cruz' campaign chairman, Chad Sweet, is a former CIA ...","post_message":"The story the whole Internet is buzzing about..."},{"comment_id":"10153417319160927","commenter_b":"....using plus size models to sell plus size products, what a amazing concept!","commenter_a":"Game over? Looks like the fat lady is singing.","post_message":"Did Facebook fat-shame?"},{"comment_id":"780568308754036","commenter_b":"She is a pig!","commenter_a":"Loved it you will not see another first lady as classy and beautiful as Michelle Obama for a while. She is gorgeous!","post_message":"What did you think of the First Lady's sunny State of the Union dress?"}]
