[{"comment_id":"786225381476070","commenter_b":"Thats what fat racist lady wanted the cops to believe. I believe the teens who say the lady started yelling racist slurs and then slapped an underage girl. Then the racist lady called cops and lied to the police saying everyone was unruly and uninvited.","commenter_a":"It was not a pool party by all accounts....a dj set up beside a private pool and the pool was invaded by the people at the dj gathereing. And after being asked to leave by the security guard and being unruly ....the police were called and told a group of black individuals were causing trouble.....that s why th ey were focused on the black individuals....it was not a race thing. ...it was a group of disrespectful unsupervised kids being trouble....and they get attention from all of you...instead if being ignored by the public and handled by their parents....wow they have something to brag about now.....grow up and stay out of it and let the people involved handle it...","post_message":"He ran when the cop pulled out his gun."},{"comment_id":"10154593126179614","commenter_b":"Kassandra Alvarez","commenter_a":"Women beater no mercy for him","post_message":"Update: Chris Brown has been transported to downtown Los Angeles where he is expected to be arrested on suspicion of assault with a deadly weapon.   The singer initially refused to come outside and was not allowing police into his home, an LAPD official said."},{"comment_id":"10153802169701519","commenter_b":"Lol that's it. I'm mad women can do something. You got me. Get real","commenter_a":"No it isn't. Feminism is. Hey dummies you realize this whole free love shit means men win right? You don't want to make a man commit, so men sleep with you and then drop you when they want. They don't have to commit or treat you right because they can go find some other chick not interested in holding a man down, fuck her then leave again. Men win you idiots","post_message":"Literally."},{"comment_id":"10154361925736336","commenter_b":"'@username Post the video of your interview with Dr. Jasser!","commenter_a":"Thank you President Obama for speaking up on this issue. It's sad that this event had to happen during Ramadan. Something needs to be done about assault rifles now!","post_message":"“We know enough to say that this was an act of terror and an act of hate.”   Moments ago, President Barack Obama addressed the city of Orlando facing the tragedy of the deadliest shooting in modern U.S. history."},{"comment_id":"10155157643776162","commenter_b":"Someone needs to go in there and knock her in the head about 50 times","commenter_a":"OMG!!!","post_message":"HEARTBREAKING ABUSE! 'I told you to stop feeding the dog human food!' Please share to help find the caregiver who was caught on video repeatedly hitting and swearing at a 94-year-old woman suffering from dementia. The victim son set up the surveillance camera after noticing bruises on his mom. @webpagelink"},{"comment_id":"10153275307228132","commenter_b":"You're a total dick!!!","commenter_a":"Junkie","post_message":"'So funny, honest and loving. We lost a great one today.'"},{"comment_id":"1445788068782419","commenter_b":"If that bitch wins it will not be USA any more cause she will screw it over and over. Immigrants will take over.","commenter_a":"Never Hillary","post_message":"ELECTION POLL! Who should win the 2016 Presidential election?  LIKE Qpolitical for the results."}]
