[{"comment_id":"10155009435559910","commenter_b":"Andre Lopez illegal immigrants can't vote. That's a lie","commenter_a":"lollllll \"won by a large electoral college vote\" he CANNOT let it go that he is the BIGGEST LOSER OF THE POPULAR VOTE EVER.","post_message":"WATCH LIVE: President Trump and Canadian PM Justin Trudeau hold a joint press conference."},{"comment_id":"1305307819486565","commenter_b":"#DUMPTRUMP NOW!","commenter_a":"TRUMP will have them shot, Obama let them make it with their lives. He's already making plans for Paul Ryan, he has ties to the Mafia and will use them. They will have to get rid of Trump.","post_message":""},{"comment_id":"1174215552594104","commenter_b":"This is one time I hope your wrong,Rush! We don't want Hillary as President!","commenter_a":"You just ruined my day, Rush!","post_message":"Everybody is sending me e-mails about Hillary Clinton. Do any of you really, really think she's not going to be the nominee? Come on, let's get serious! There isn't anybody else that's gonna be the Democrat nominee. All of this doesn't mean anything."},{"comment_id":"10153391212533984","commenter_b":"Dumb ass!!!","commenter_a":"Another actor who thinks his opinion matters to anyone with an IQ over that of a houseplant....sooooo sorry George, but you really should stick to acting.","post_message":"This might lose George a few fans. What's worse than announcing he'll give this candidate 'whatever they want,' was the claim he made about a scandal that surrounds this particular 2016 hopeful..."},{"comment_id":"10153148405249753","commenter_b":"Fuck you again bitch and fuck your manner too. Don't come to teach about manner. My mama only said \" baby, respect everyone before get that respect back.\" My mama is better than yours.","commenter_a":"Everyone shall be respected the American's rules because we are living in America, not your or mines, so lady get that into your head.","post_message":"The Dearborn Police Department has been slapped with a lawsuit after a Muslim woman says that she was ordered to remove her hijab, or headscarf, for her booking photo after she was arrested."},{"comment_id":"10153186576481162","commenter_b":"I'm glad she won't be crushing any more babies.","commenter_a":"I happy 4 her but i want to do it with out surgery","post_message":"HALF-TON NO MORE: She is the woman once dubbed the \"Half Ton Killer,\" accused of killing her nephew by rolling on him with her 1,000-pound frame. But after clearing her name, she has a new lease on life, a smaller body, and is motivating others with her weight loss story. AMAZING TRANSFORMATION---> @webpagelink"},{"comment_id":"608860039265106","commenter_b":"@username Beautiful? NO!! She's SICK!!","commenter_a":"So real girls will have their dreams of becoming prom queen crushed because this school will more than likely give the award to a man in a dress just so the school can appear to be progressive.","post_message":"\"I'm not going to let anyone discourage me from being who I am.\" 18-year-old Dakota is one of four finalists running for prom queen her Portage, Indiana high school. The transgender teen is becoming an unlikely hero for some."}]
