[{"comment_id":"1666754860284644","commenter_b":"As a veteran educator with 31 years experience, I am appalled by Betsy DeVos's level of complete and utter incompetence. As a parent of a special needs child, I am alarmed and sickened at her flippant discard of imperative federal laws that protect those that cannot protect themselves. Shame on you, Donald Trump, for promoting her, and shame on you, Betsy DeVos, for accepting a position for which you have zero aptitude.","commenter_a":"Once again Senator Kaine, your questioning along with others brought out that she has NO clue. Our children cannot afford to have this kind of management over their education. Scary!!","post_message":"I worry about the effects of a leader who thinks 'government sucks' on the morale of teachers. Disappointed Betsy DeVos does not support equal accountability and IDEA for all schools getting tax dollars."},{"comment_id":"10153225477750736","commenter_b":"The show pits women against each other and promotes dangerous stereotypes and archaic gender roles. It isn't entertainment and this isn't news.","commenter_a":"Leann Allisgood","post_message":"ICYMI: Lauren Bushnell, the flight attendant from West Linn, got another rose during 'The Bachelor' in The Bahamas, but not until she swam with unruly pigs first:"},{"comment_id":"10153915589591336","commenter_b":"Russian women are hawt !!!!","commenter_a":"Putin thinks Trump is great Could this mean that we could be friends again with Russia if Trump wins? I think so","post_message":"Donald J. Trump has plenty of admirers, and you can apparently count Russian President Vladimir Putin among them."},{"comment_id":"769122743278303","commenter_b":"Your right just little bitches","commenter_a":"Three armed thugs couldn't handle one 67yr. old man. Punk ass b!tches, take note; One responsible, LEGALLY armed American Citizen is better than three worthless, no job pussies with mothers on welfare with multiple kids from multiple donors. And they wonder why they get shot.","post_message":"Thugs Attack Little Girl, Grandpa Immediately Blows Them Away With Shotgun. Thank god for the 2nd amendment. Let's show him our support. Can we get 75,000 'LIKES' for this grandpa?"},{"comment_id":"1176027829155419","commenter_b":"Smart woman","commenter_a":"Big deal!!! She had a right as an American citizen to vote but who she voted for is no one's business but hers.","post_message":"People are freaking out over what's being said about Taylor Swift today..."},{"comment_id":"10153291171784203","commenter_b":"Jews and fat women.","commenter_a":"Yeah, bring back the jokes about Gays and Blacks.","post_message":"Why can we all grow up and just let comedians be comedians again?"},{"comment_id":"1179490578805054","commenter_b":"@username Little girl please... You have zero inclination of who I am, where I've been and with whom I've walked. My dad always said, \"Never argue with an unarmed person\". Go away before your feelings get hurt.","commenter_a":"A gentleman named Bill Howell eloquently wrote the below letter. Dear Mr. Trump, It’s taken me a while to realize this and to admit it, but I’m grateful to you. For the past few months I’ve spent a good deal of time lamenting your campaign and the poison it has so effortlessly generated. I’ve watched our country imploding, our public discourse become polluted, our political climate grows ever more corrosive, and wrongly assumed you were to blame. It’s only lately I’ve come to understand that you haven’t manufactured our current national ugliness—you’ve simply revealed it. By saying the irresponsible, mean-spirited, ignorant things you say so freely and so frequently, you’ve given other like-minded people license to do the same. You’ve opened up the floodgates for our corporate sewage to flow fully. People no longer conceal their vile mess, they now revel in it, they broadcast it and retweet it. You’ve ...","post_message":"Trump appears to be ready for victory. Do you think he should win in November?"}]
