[{"comment_id":"924205284313566","commenter_b":"Who teaches people to hold a handgun like that???","commenter_a":"No don't agree along those lines , that's open a CAN of of worms with BIG problems behind it . ,good Luck","post_message":"For God's sake, get a grip!"},{"comment_id":"10153194187981600","commenter_b":"It;s not an assault rifle as assault rifles are illegal,","commenter_a":"So, not really sure why there is this distinction of it being an \"assault rifle\" and not...\"He pointed a gun at the officers\"???","post_message":"Officers heard the distinctive sound of a rifle being charged or a round being chambered, they reported."},{"comment_id":"980300718729649","commenter_b":"The 2 trillion plus mentioned was already taxed in the countries their products were sold into! Why is it that our government is the only nation that promotes the idea of US companies paying taxes on products they never sold here? That is pure greed and BS! If our government was really interested in repatriation of those funds they would create a tax environment that encouraged companies to keep their plants and wealth here!","commenter_a":"and the moron we have now is no better and the douch bag is not the answer either","post_message":"We have much bigger problems to worry about. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153021389625399","commenter_b":"All you have to do is look it up .they are in key positions and were placed there by Plummer. Thank you Franklin Graham keep telling it like it is","commenter_a":"Listened to him!","post_message":"\"Washington, has been infiltrated by Muslims who are advising the White House, who I think are part of the problem.\""},{"comment_id":"1150560135003462","commenter_b":"Pathetic Kardashian whore.","commenter_a":"you go it right she is pathetic","post_message":"Caitlyn Jenner joined the festivities in Cleveland where she explained her reasons for being a Republican."},{"comment_id":"10153523815251636","commenter_b":"This Guy is a Catholic Hater. Think women are 2nd class humans. Would kill all LGBT if he gets the chance. Yet he's pretending to be the victim. Oh and always blame Israel.","commenter_a":"How many people will have the iraqi flag on their profile? More selective outrage from ..........","post_message":"More as we get it"},{"comment_id":"10153738689479032","commenter_b":"Thanks to those who muck it up for other people. Your stupidity is so appreciated. Stop breeding too.","commenter_a":"Maribel Maldonado","post_message":"Visiting Fossil Creek? As of May 1, you need a permit. @webpagelink"}]
