[{"comment_id":"10152758680722144","commenter_b":"Racist pigs","commenter_a":"What the hell are these people thinken DO THERE DUM ASSES KNOW THAT CHILD ABUSE","post_message":"WTF."},{"comment_id":"1754978767895197","commenter_b":"Trump going to build that wall around your house.","commenter_a":"good lord, no tact at all. Biggest moochers on the planet, biggest joke presidency. Not enough he more than doubled the national debt, now in his mere final weeks, they go ahead and keep living high on the hog. Trump was not my pick among GOP candidates, but doing this stuff for 8 years while telling successful hardworking citizens ,\"you didn't earn that\" or \"some folks are going to have to give up their piece of the pie\" really screamed to everyone on how we don't want this again.","post_message":"Aloha Obamas!"},{"comment_id":"552329344892078","commenter_b":"Impeach her! She's suppose to be UNBIASED. What a joke","commenter_a":"Term limits asap","post_message":"Supreme Court Justice Ruth Bader Ginsburg bashes Donald J. Trump, calling him \"a faker\" and criticizing him for not releasing his tax returns."},{"comment_id":"10153511898009087","commenter_b":"Look at the lies thay have in office today everyone of them for nothing but money .and there's nothing wrong with what trump personally done. .there trash on everyone .","commenter_a":"You will not turn a single vote away from trump support ers .you will only make more people for trump .","post_message":"\"I stand by every question I asked [Donald Trump] and he was not the only one who had tough questions,” Megyn Kelly said. “He was the only one, however, who complained.” WATCH:"},{"comment_id":"10157067954080354","commenter_b":"FEMINISTS ARE THE NEW NAZIS.","commenter_a":"Where I work at, women who do the same job, get the same pay! It was even like that at my last job! Corporations cannot discriminate based on sex or they will face lawsuits! Feminists are always pushing the lie that women don't get paid the same! I've seen it first hand that it is just a LIE!","post_message":"\"It would be nice to be able to have a more complex conversation and to be able to look at it more than just a quota or numbers.”"},{"comment_id":"676035105920401","commenter_b":"they wouldn't be happy with anything they are a bunch of animals and don't want peace all they care about is destruction send them back where they came from give them nothing","commenter_a":"Don't like it go home!","post_message":"Muslim refugees are refusing to go into the shelter, demand they be given apartments. If they are seeking safety from a war zone, they should be happy with a shelter. Do you think this demand is ridiculous?"},{"comment_id":"10153475546708734","commenter_b":"So why is she crying rape now? It's not going to get her out of the ticket, is it?","commenter_a":"Sorry but she is not a victim! And the so-called officer is a POS!","post_message":"The female victim initially agreed to engage in a sex act in exchange for money. Then during that encounter, Tucker allegedly pointed a gun at her and forced her to engage in another sex act against her will."}]
