[{"comment_id":"10154701801396002","commenter_b":"Just like this woman doesn't care if you believe her or not.","commenter_a":"I'm not believing this, you're leaving prescription drugs in the house and know you're going to be gone for 5 days? We never leave ours behind Fir any reason because of what you have to go thru to replace them. I also can't believe they stole video games and not the TV. According to the report and the time limit, they would of wiped them out. Just my opinion.","post_message":"Standing in the middle of her ransacked living room, Taylor resident Janice Mulholland is in disbelief."},{"comment_id":"10156425606485725","commenter_b":"Lol Caitlyn Jenner beat you as Most Fascinating Person. Lol Loser","commenter_a":"This is a cool post Donald ! I haul livestock so unfortunate'ly wasn't able to watch the show ! Really cool you post the neatest stuff!!!","post_message":"You do not want to miss Barbara Walters 10 Most Fascinating People of 2015 tonight at 9:30pmE on ABC! ENJOY!"},{"comment_id":"712988442225067","commenter_b":"aint she pretty..i would rather kiss the south end of a north bound mule...","commenter_a":"My God that's one ugly broad she has more rinkles than a road map","post_message":"Like if you agree."},{"comment_id":"1025021754204963","commenter_b":"Will make the perverted staff , horny ?","commenter_a":"Give gun control without rules. Makes a lot of sense. Not. But tell a little girl she can't feel pretty. :(","post_message":"A father bought an adorable dress for his adorable little 5-year-old girl but her school forced her to wear a t-shirt and a pair of jeans because her shoulders were showing and Texas school officials couldn't handle it."},{"comment_id":"10153538645367232","commenter_b":"Yous are CRAZY, certainly it HAD to ALWAYS be a GHETTO, NO one would ruin a neighborhood ;)","commenter_a":"What Camden used to look like before the take over.","post_message":"Females attack woman with pole on South Jersey street in broad daylight and it was caught on camera: WATCH THE VIDEO => @webpagelink"},{"comment_id":"1521502694809851","commenter_b":"And once again we don't riot , block busy streets and and make up bullshit like a certain group of people--- absolutely this is murder and a hate crime!!","commenter_a":"absolutely","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news. No riots, no protests, no media coverage. Do you think he should be charged with a hate crime?"},{"comment_id":"1731231320495188","commenter_b":"Fool","commenter_a":"Now ratify Obama's choice for Supreme Court judge.","post_message":"Backed into a corner, Senate Republicans have given up trying to repeal Obamacare."}]
