[{"comment_id":"10154221705040530","commenter_b":"What a dumb bitch!","commenter_a":"Black on Black crime really needs to stop. So sad this young lady endured such hatered and pain from peers of her own. Rest in peace. I'm praying the killers are soon arrested and face the fate of their punishment real soon, behind bars for the rest of there life and no parole it will serve them right","post_message":"Amy Inita Joyner-Francis, 16, died Thursday morning during a violent attack in the girls bathroom."},{"comment_id":"780568308754036","commenter_b":"She is a pig!","commenter_a":"Loved it you will not see another first lady as classy and beautiful as Michelle Obama for a while. She is gorgeous!","post_message":"What did you think of the First Lady's sunny State of the Union dress?"},{"comment_id":"10154522869261051","commenter_b":"The only thing Melania will do as first lady is give free head and hand jobs","commenter_a":"He can't handle being President is a joke just like his supporters he is being a reality show president","post_message":"This is not what Donald Trump wanted to hear today."},{"comment_id":"1008364749198946","commenter_b":"But the only way to stop a bad baby with a gun is with a good baby with a gun!","commenter_a":"My Hero","post_message":"BOOM!"},{"comment_id":"10153720536124087","commenter_b":"@username I bet you're wife is a illegal ass immigrant. Get ready to never see her again once he wins","commenter_a":"Cool. Soon there will be no minorities left for trump to insult. He'll start insulting the lackof intelligence of his supporters.","post_message":"GOP front-runner Donald J. Trump recalls phoning his credit-card company to see if an Indian call center would answer."},{"comment_id":"1461843750508898","commenter_b":"WHY DO THEY LET THIS GUY DO THIS ? JUST SHOOT HIM AND BE DONE WITH IT .","commenter_a":"Another scumbag trying to blame someone else for his criminal actions. This seems typical of his type. Rot in prison and enjoy your \"foot longs\" until you die, Jared Fogle","post_message":"He is claiming that the PARENTS are to be blamed for her spiral of drug abuse, self-harm suicidal thoughts, which she says was the result of his abuse."},{"comment_id":"514346735420286","commenter_b":"Muslims cause cancer and sure death. Let's ban them...","commenter_a":"Amazing. After all these years they find this out. I think it's a bunch of bullshit. Remember certain people hate bacon and want it out of restaurants","post_message":"WOW! NOT EXPECTING THIS!!!"}]
