[{"comment_id":"10154048881589753","commenter_b":"They both need to be charged she was sorry as hell to let him do that your kids come first","commenter_a":"I sure hope they don't place that child back with her. Lock her up until she is too old to bear any more kids. Where are the Fathers nd Grandparents of these abused kids?","post_message":"An Arkansas mother and her boyfriend were taken into custody and charged with first-degree domestic battery after the woman’s four-year-old daughter was found zip-tied to her bed, reports KTLA. Jennifer Diane Denen, 30, and her 47-year-old live-in boyfriend, Clarence Eugene Reed, both residents of Hot Springs, were taken into custody last week after a staff member at the Cooper-Anthony Mercy Child Advocacy Center found Denen’s daughter to be severely malnourished and abused, according to The... @webpagelink"},{"comment_id":"640840709429112","commenter_b":"QUIT RAPING AMERICA ..........WHY ARE YOU NOT IN PRISON. .........WHY","commenter_a":"oooh, I bet they are shaking in their boots","post_message":"BREAKING NEWS: Obama fires back at Russia..."},{"comment_id":"10154191212073132","commenter_b":"Some girls eat and eat and not gain a pound, I'm not talking about girls with eating disorders. That's a different topic. Some girls are skin and bones regardless of how hard they try and gain.","commenter_a":"Far better looking then the skin and bones models they normally show. But she isn't \"Plus size\", she's fit and healthly size.","post_message":" thought Sports Illustrated was taking a risk by putting a girl my size in the pages. But putting me on the cover? They aren just breaking barriers; they are the standard now. This is beyond epic."},{"comment_id":"911844395571846","commenter_b":"Hillary is Hillaryous!!!","commenter_a":"Oh great, more solar energy... Solyndra anyone? $535 million more in gov't grants to a failed technology? Better to build a nuke plant AND it doesn't take up as much space, it would take miles and miles of solar panels to even come close to a nuke plants energy output!","post_message":"Do you agree with Hillary Clinton? #DemDebate"},{"comment_id":"996483170392155","commenter_b":"She needs to go sit in the snow for a few decades..","commenter_a":"She is a regular stand up comic! Keep it coming Sarah...we all need a good laugh.","post_message":"If her goal was to make sure people still know she's an idiot, she succeeded."},{"comment_id":"10154362433106509","commenter_b":"What a pussy","commenter_a":"Obama = anti christ he wants to disarm us so he can let his refugees attack and we be left defenceless","post_message":"Barack Obama addresses the notion of a \"conspiracy\" that \"we are creating a plot to take everybody's guns away so that we can impose martial law...\" #GunsInAmerica @webpagelink"},{"comment_id":"10154204294889778","commenter_b":"Then let her pay for it","commenter_a":"They need to get over it! Rename something of their own! Confederates were a part of history too! If this is the case, let's change every building's name that offends every confederate soldier's family too!!! I Have Had Enough of this - so crazy & ridiculous!!!","post_message":"Actress Julianne Moore and Hollywood producer Bruce Cohen want a new name for their old high school in Virginia, named for a Confederate general."}]
