[{"comment_id":"875538442502852","commenter_b":"Absolutely, illegal is illegal and alien is alien!!!!!","commenter_a":"There is no reason they can't do that legally","post_message":"Don't you agree this is ridiculous?"},{"comment_id":"1747485088840690","commenter_b":"On god all these bitches do is tattoo they brows and date niggas who still rock dickies and cortez I live an hour away from Clovis","commenter_a":"Man pussy can't be that scarce in NM","post_message":"WTH: New Mexico mother and son face jail time for incest! #NewMexico #Incest"},{"comment_id":"405363642956925","commenter_b":"Bitches can try","commenter_a":"Come bring that b.s. this way I'm ready","post_message":"The video is titled \"A Message Signed With Blood to the Nation of the Cross.\""},{"comment_id":"10154716616787908","commenter_b":"It looks like GE is moving part of it's head quarters to Boston, since Boston will give them a $25 million dollar tax break! It's all about the deal! I'm told that what they're giving back is just a drop in the bucket compared to what they'll get. We're so lucky!","commenter_a":"Yes BERNIE Yeeeeees","post_message":"I didn’t hear the head of GE and all these CEOs who ship jobs to China asking the Chinese for a bailout check in 2008. Instead, after laying off American workers they came begging the American taxpayers for a bailout."},{"comment_id":"1245500588795529","commenter_b":"Clinton thugs!","commenter_a":"@username-- You proud of this?? After watching this, I'm gladly giving my vote to Trump now. These Mexicans don't represent me, & aren't \"Americans\" acting like thugs.","post_message":"MUST WATCH: Video documents months of violent attacks by the radical left on Donald Trump supporters that are COMPLETELY ignored by the mainstream media. This video compilation shows Trump fans assaulted all ACROSS the nation. Worse and not surprising, the media, the left, and Hillary Clinton herself BLAME Trump for these violent assaults when they should be blaming those attacking the Trump supporters. Show your support for Trump by getting the TRUMP: REAL HOPE, REAL CHANGE bumpersticker! --> @webpagelink"},{"comment_id":"10153881891966782","commenter_b":"I think you ladies are missing the point of the story","commenter_a":"Here let me help you pay attention Army=soldier Navy=sailor Marine corps=marines Air force=AIRMAN you're welcome get it straight","post_message":"A Kirtland Air Force Base soldier and his wife are getting a lot of attention for something they posted online. @webpagelink"},{"comment_id":"10153575411863132","commenter_b":"I don't think she did either...","commenter_a":"I Don't believe she killed him...he was negligible to wearing proper gear... he took a big chance and lost his life... just plain STUPID! Shame :(","post_message":"\"I certainly would not be out on the Hudson River in 47-degree water without a dry suit on, that's asking for trouble.\""}]
