[{"comment_id":"1782129738697799","commenter_b":"She doesnt know, she just wants to bash him because shes a Kate fan.","commenter_a":"Shameful that these girls have been brainwashed.....the mother is more responsible for the marriage breakup. She treated the father horribly. TLC destroyed this family. Just as you have one mother young ladies; you also have one father. He nurtured you as well when you were babies up to the point your mother ran him off. Look at your old pictures and first episodes of your show. Your father was pretty much left with nothing.","post_message":"“He doesn’t even know us”"},{"comment_id":"10154542886848984","commenter_b":"And Whoopie Goldberg and all those cackling The View women!!! BYE FLEICIA!!! Lol","commenter_a":"Gotta go with Ted on this one, but he left off Kanye West off his list. Maybe when West leaves the country, he'll take the Kardoucheians with him.","post_message":"Rock legend and conservative firebrand Ted Nugent has released his 20 reasons to vote for Donald J. Trump, and they've gone viral. No wonder. Look at what he's saying here.  Finally someone will tell the blunt truth about Trump versus the establishment. You've gotta love this!"},{"comment_id":"10154083516697541","commenter_b":"She a Dildo lover lol..hahaha","commenter_a":"Hahahahhah! Dildo lover! @username lol","post_message":"Kylie Jenner won't be posting on her own app anymore after an inappropriate message went up without her approval."},{"comment_id":"10156404407160354","commenter_b":"You dumb bitch","commenter_a":"what an idiot!","post_message":"Terrorists just need a hug and a lollipop...."},{"comment_id":"1150787404931568","commenter_b":"Trump is only running to give the candidacy to Hillary... or Bernie. He is still very much a Democrat. The \"conservatives\" who joined him have proven that stupidity doesn't necessarily stop with the Democrats only.","commenter_a":"Mr. Trump is not my first choice, but the more the elite republican insiders attack him the more I am inclined to support him.","post_message":"Will Republican attacks work or is Trump unstoppable?"},{"comment_id":"10153139725131037","commenter_b":"Hillary won't be in office. Smfh never that","commenter_a":"This guy actually thinks he is a good president. LOL","post_message":"Confident Obama predicts success in immigration appeal, has message for millions facing possible deportation @webpagelink"},{"comment_id":"10153931656668812","commenter_b":"This is way out of context y'all all sound ignorant specially the one starting this comment","commenter_a":"Waiting to see who blames Obama or immigrants....","post_message":"Long Island town demolishes U.S. Navy veteran's home while he was in Florida recovering from a knee replacement: @webpagelink"}]
