[{"comment_id":"1172821626098535","commenter_b":"She needed to be shut down 20 years ago!!!!","commenter_a":"What kind of a statement would you expect from somebody as stupid as she is. Her brain is lacking in intelligence","post_message":"Whoopi Goldberg got shut down."},{"comment_id":"1824785004425894","commenter_b":"Women who support Trump have severe Stockholm syndrome and suffer insecurity","commenter_a":"Three times divorced, womanizer dares to talk about morality.","post_message":"Let's talk about the debate...what just happened?"},{"comment_id":"10154438861719726","commenter_b":"While I can understand the basis for some of these observations, the main thing I firmly believe is that perhaps just over half the Democrats who actually voted for Obama in the last election will turn out to vote this cycle. I do not see near the support, energy, emotion, or urgency that I saw in the last two Obama campaigns, and lets be honest here folks... Hillary Clinton IS NOT barak obama. She does not have the well-oiled campaign machine Obama had. All she has is a character-assassination campaign, that's it, and it's exactly what I expected from her too. It honestly would not surprise me if Trump carried a lot of the swing states simply because democrat voters know she's a damaged candidate. Add to that that about half of the Democrat voter bloc in play this cycle was Bernie Sanders supporters of which many of them won't ...","commenter_a":"HIllary doesn't want to talk about the issues because she has no plans except what Obama has told her to say.","post_message":"This is the strategy Trump can use to defeat Clinton:"},{"comment_id":"10153999056241323","commenter_b":"She is pickled she will last a long while yet","commenter_a":"And when the Queen kicks the bucket we will have our money overhauled yet again. How much does it cost to overhaul the money all these times?","post_message":"To be eligible to appear on the new bill, the woman must be Canadian, either by birth or naturalization, and she must have died at least 25 years ago."},{"comment_id":"1478938502146617","commenter_b":"That redneck is probably terrifying his sister...err! Girlfriend!!!","commenter_a":"That woman looks like she's trying to hide her identity. I would too if I had to go to a Trump rally with that gormless chubby asshole. :(","post_message":"\"One man's sexual assault,\" one said, \"is another man's flirtation.\""},{"comment_id":"10153368825000329","commenter_b":"Christine, go read the bible or something.","commenter_a":"Congratulations... you all look like lesbians.","post_message":"The students coordinated wearing flannel shirts and wrote \"anti-gay\" on their hands, after the school's Gay-Straight Alliance held a \"Day of Silence.\" (via BuzzFeed News)"},{"comment_id":"1795750557330111","commenter_b":"Couldn't agree more!! Set up! All the drama, theatrics all made for Reality TV!! Kardashian styling! #Whinylittlebitch","commenter_a":"I believe THAT was completely stage set up!!!!! How can possibly someone can get through with a gun if someone did try to do something.... Complete set up","post_message":"The Secret Service rushed Donald J. Trump off the stage at a rally on Nov. 5 in Reno, Nev.: @webpagelink"}]
