[{"comment_id":"10153739704671051","commenter_b":"Dumb ass","commenter_a":"For recreational usage YES, only and dope does dope for no reason other than to escape reality. For MEDICAL use, HELL NO, it should be 100% illegal. BUT, that is not the real issue here..... the REAL issue is, THE LAW Follow it, or pay the price, SIMPLE","post_message":"Do you think marijuana usage should be illegal?"},{"comment_id":"460760697382304","commenter_b":"Ummm... Not sure what that has to do with the U.N. but ok.","commenter_a":"The UN has been one of the greatest propaganda tools in history! They serve no actual purpose other than releasing statements from time to time with the appearance of having morality supporting it.","post_message":"The UN commission claims that Israel exercised 'great restraint' while bombing elementary schools in Gaza which resulted in the deaths of 519 Palestinian children last summer."},{"comment_id":"1225877584098936","commenter_b":"Build a wall!! That'll stop em!! Bahahaha","commenter_a":"El Chapo was there.","post_message":"The 'super tunnel' – eight football fields in length – was discovered along the U.S-Mexico border south of San Diego.  via NBC 7 San Diego"},{"comment_id":"861219497357519","commenter_b":"Natalie, that is wrong. His opinion absolutely matters. Knock it off. Francisco, if you want to discuss this rationally, you'll have to like my comments so I know you've replied, no notification on a public post for me. Don't worry about the trolls. If you wish to have an objective conversation, I'm game.","commenter_a":"Chanting that you are going to make America great again is pathetic it's not the leader that makes America great it's the people that's why the revolution war was fought this country will always be a country of immigrants from all over the and we are who make America great not a 'leader' in search for power claiming that he will make America great","post_message":"MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10154270105832293","commenter_b":"Feminist spotted","commenter_a":"If you have an ounce of common decency, you're statistically more likely to support Hillary Clinton.","post_message":"If you have daughters, you're statistically more likely to support Hillary Clinton."},{"comment_id":"1088078934585187","commenter_b":"She is a pest!","commenter_a":"Does she not realise that her actions will encourage pest infestation of insects & rodents, germs will have a field day, right next to where she's raising her child?","post_message":"Some people are just scum"},{"comment_id":"10152928005661615","commenter_b":"Btw, @username, go blue!","commenter_a":"Hahaha haha hahaha haha hahaha haha hahaha haha hahaha! !!","post_message":"“It hit my wife and knocked her over, and punched my daughter”   The 'it' was a DOLPHIN that jumped out of the ocean -- and into the family's boat, breaking the woman's ankles."}]
