[{"comment_id":"10154307546211509","commenter_b":"Joking? Missing a punch line...","commenter_a":"Fox News: Thug tries to jump on three girls, and bullets stopped him. Bill O'reily: What was he trying to do to those three girls before the bullets? We're just asking questions.","post_message":"15-year-old Zaveon Dobson was shot and killed after he jumped in to shield three girls from gunfire. @webpagelink"},{"comment_id":"10152969596402452","commenter_b":"Exactly @username, you apply these same rule to your god daughters.😊","commenter_a":"No one cares about the children lol pets ftw!","post_message":"PET SAFETY: Arizona Cardinals player Tyrann Mathieu sits in an SUV with the windows rolled up on a sunny day in a new PSA about the dangers of leaving pets in a hot car. He lasted only eight minutes. WATCH: @webpagelink"},{"comment_id":"812894658799894","commenter_b":"GI, Hillary, go.","commenter_a":"Hillary is a strong woman and won't tolerate any Republican CRAP.","post_message":"This is Hillary in full badass mode. You may not love her, but you should love her passion!"},{"comment_id":"10153701497529740","commenter_b":"Ben what is the answer. I'm sure more violence isn't but then what. Flowers, prayer, a handshake. These people, I use that term loosely, are predators. How do you stop a predator? You can try and take the source of the problem. Drugs for the money and high. Its a start. Not as easy as you might think.","commenter_a":"Tell the felon to STFU. Chicago is out of control. Most of us are not in that city's position. You can't control a city like that unless you show aggressive behavior and make these criminals know you mean business. This might not work in most places but Chicago is falling apart.","post_message":"The highly awarded Cmdr. Glenn Evans who has thrown himself in front of bullets to save fellow officers is now under scrutiny for same aggressive tactics that he's been praised for."},{"comment_id":"722235994591000","commenter_b":"For sure! Madam President for Prison 2016 once Trump beats her.","commenter_a":"i can't wait to be able to call you Madam President!!","post_message":"16 days. IWillVote.com"},{"comment_id":"10152775475131045","commenter_b":"Yes, don't nobody want to mess with this grandma about her grandchildren.","commenter_a":"As a grandparent I cannot Fathom how you could do this. I would protect my children and grandchildren with my last breath","post_message":"Breaking news out of Etowah County tonight. A jury found Joyce Garrard guilty of capital murder in the running death of her 9-year-old granddaughter."},{"comment_id":"10154092035258352","commenter_b":"NASTY ANIMAL.","commenter_a":"Just gross","post_message":"Dairy Queen worker who 'has herpes' arrested for 'spitting on officer's burger'"}]
