[{"comment_id":"621998441316699","commenter_b":"Sadly many get all their\"information\" from the globalist owned main Street media........the sheep are being led to slaughter!!!!!!","commenter_a":"The problem is, NO BODY WHO SUPPORTS HILLARY CARES!!! The amount of hard evidence, current criminal offenses is mind boggling... but her supporters just don't care... she shouldn't even be allowed to run...","post_message":"Uh oh..."},{"comment_id":"10153875456235329","commenter_b":"Dear women, stop giving us all of your stuff to put in our pockets","commenter_a":"YES! Matt","post_message":"This is not a drill."},{"comment_id":"10152796636027217","commenter_b":"where are the women","commenter_a":"Check their passports and visas ...","post_message":""},{"comment_id":"937107439663448","commenter_b":"These ladies look forward to the attention of their dress, slot b of time and money is put into finding the perfect dress ,I don't watch the awards I could care less but I know people who watch it just to see what is being worn them turn s it off","commenter_a":"non-story","post_message":"When it comes to the Academy Awards and other red carpet shows, this is what smart, successful women get asked about instead of, you know, their accomplishments. Sigh."},{"comment_id":"1691864404387315","commenter_b":"Omg ....how adorable!! You want one Mark? Do you still have your hot tub?? You're all set! I'll baby sit for you!","commenter_a":"Signe Nielsen tror jeg har fundet dr - at passe denne lille pige","post_message":"Welcome to Chicago, sea otter pup! At 10 weeks old, this little lady was found on a California beach all alone. Now, she's got a new home at the Shedd Aquarium. See the full video and photos here: @webpagelink"},{"comment_id":"10153143313576350","commenter_b":"Idiot!","commenter_a":"I think they are all smiling because they didn't know how to react. Maybe a nervous laughter? And they have more class than to be rude...even though he does deserve it!","post_message":"Kanye West had an impromptu moment last night with the TODAY anchors!"},{"comment_id":"1201578119864976","commenter_b":"All rapists should be killed.","commenter_a":"Yes it does","post_message":"This reeks of white privilege."}]
