[{"comment_id":"1186888831331145","commenter_b":"Hold her in contempt and lock her up.","commenter_a":"What's next stone her.....","post_message":"Her act of resistance has rocked her small Appalachia community 60 miles east of Lexington and made headlines nationwide."},{"comment_id":"10156322425460725","commenter_b":"Maybe ISIS knew America would take in the refugees, it was there plan all along to have a easy way into America to destroy us! Lord help us all.","commenter_a":"He's a traitor, he is just a resident of the white house, he has broken the oath and is no longer legally the president","post_message":"What is our President doing?"},{"comment_id":"10158155475600615","commenter_b":"Man baby. Strong women make them crazy.","commenter_a":"No surprise! We might respect the office of the President, but that's not \"carte blanche\" for Trump to do whatever pleases his whim.","post_message":"Check out these images from Women's Marches around the world."},{"comment_id":"1043726442390274","commenter_b":"We have our own problems here, send em to other Arab countries","commenter_a":"Not only a great actor, but an absolute class act.","post_message":"\"The show was fantastic, but you left in tears after [Benedict Cumberbatch's] speech. It was very eloquent, emotional, and beautifully put … He gave a 4-letter word to the politicians and said, ‘We’ve got to do something about it.’” - Rachel Martin, audience member"},{"comment_id":"600652730065515","commenter_b":"Christians are doing it now to homosexuals, in Uganda","commenter_a":"They are savages. Anyone who can cut off a person's head is cold blooded.","post_message":"Attention Liberals: The Koran is a Satanic Manifesto & Christianity is not as bad as Islam!"},{"comment_id":"460063127508901","commenter_b":"I bet the GOP hate her since she actually has a heart.","commenter_a":"Well said","post_message":"Wow is right."},{"comment_id":"10154877505644351","commenter_b":"Build it electrify it arm the wall with automatic weapons cameras night vision electrify deep into the ground to kill tunnellers pass new deportTion laws make it a felonie criminal act to border hop punishable by years in a very bad prison","commenter_a":"His whole campaign was based on building a wall!! Of course he should, we need secure borders!!","post_message":"Thoughts?"}]
