[{"comment_id":"676035105920401","commenter_b":"they wouldn't be happy with anything they are a bunch of animals and don't want peace all they care about is destruction send them back where they came from give them nothing","commenter_a":"Don't like it go home!","post_message":"Muslim refugees are refusing to go into the shelter, demand they be given apartments. If they are seeking safety from a war zone, they should be happy with a shelter. Do you think this demand is ridiculous?"},{"comment_id":"10153447455781051","commenter_b":"Trash get class Ur pregnant!","commenter_a":"Well if there married its her car too sucks to be him hopefully the baby in her tummy is ok","post_message":"When passersby saw this pregnant woman smashing a car in the parking lot, they ran outside to stop her. As soon as they learned why she was doing it, they let her continue"},{"comment_id":"640840709429112","commenter_b":"QUIT RAPING AMERICA ..........WHY ARE YOU NOT IN PRISON. .........WHY","commenter_a":"oooh, I bet they are shaking in their boots","post_message":"BREAKING NEWS: Obama fires back at Russia..."},{"comment_id":"1202278743181685","commenter_b":"Lots of estrogen.","commenter_a":"Causation or correlation? Lol","post_message":"Men Supporting Hillary Clinton Have Lower Testosterone"},{"comment_id":"10153951391170579","commenter_b":"We have millions of people on welfare because Illegals are doing the jobs they are qualified for...we can use guest workers legally if we need more workers...I don't see us the US needing them though","commenter_a":"The republicans are certainly changing their tune on immigration. But they have no choice. Nobody in their right mind believes that we can deport all illegal immigrants without devastating our economy and millions of families. Even Trump admitted that they could come right back, a weak attempt to lessen the blow of his ridiculous plan. Yet another win for Bernie Sanders, who has no need to flip on issues to garner support.","post_message":"Your takeaway from the 4th Republican Presidential Debate?"},{"comment_id":"488243741366206","commenter_b":"Hell no don't mess with our children!!!","commenter_a":"I thinks it's wrong for Muslims to even to be on our soil!!!!!!","post_message":"American students are being forced to dress like Muslims.  This is absolutely unacceptable, we need to spread this and show Muslims we are not going to stand for this.  Do you think it's wrong for Muslims to force their beliefs on our children?"},{"comment_id":"1076528565795194","commenter_b":"Let's see ... when he said, \"yes she broke the law, but we don't think it rises to the level of prosecution... \" everyone was happy. Now something changed that ... something explosive enough to convince someone who supported and did everything to protect Hillary ... that \"something\" is enough for me to say I CAN'T TRUST HER! WHERE THERE'S SMOKE... THERE'S A FLIPIN' INFERNO!","commenter_a":"www.mostdamagingwikileaks.com","post_message":""}]
