[{"comment_id":"10153576489935667","commenter_b":"Their aliens","commenter_a":"I wonder what it looks like now","post_message":"Experts have yet to identify their breed but guess they could have a bit of wild cat in their DNA."},{"comment_id":"10153936171871813","commenter_b":"Your wifes hot though LOL","commenter_a":"If your not in Law Enforcement nor never have been dont even bother to comment on this post","post_message":"Here’s a way to increase much-needed police accountability — especially when force is used."},{"comment_id":"10153851364301336","commenter_b":"Women and small children only.","commenter_a":"Look at all of those men! Able bodied men not fighting to defend their own country! Cowards!!!!","post_message":"The bill would require the FBI director to certify a background investigation for each refugee – and several top security officials to certify that each refugee is not a security threat to the U.S."},{"comment_id":"1341782245865041","commenter_b":"Wow!!!! Clearly a Muslim traitor...... Like Barry and Michael, maybe they can all room together......Prison 2017 !!!!!!","commenter_a":"'Farking Nuts'","post_message":"YES, POLITICIANS HAVE LITERALLY LOST THEIR BRAINS..."},{"comment_id":"1714085968841110","commenter_b":"WTF WORLD U LIVIN IN THEN MOTHA FUCKA GTFOH","commenter_a":"He need to take him and his gang go play I'm traffic","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153444075108132","commenter_b":"Pretty sure she's had surgery and botox.. or some serious airbrushing was done. Cripes everyone at 50 has a wrinkle.","commenter_a":"Thank you for picking someone normal and down to Earth without a bunch of surgery","post_message":"Sandra Bullock is PEOPLE's #MostBeautiful Woman! @webpagelink"},{"comment_id":"10152744813956094","commenter_b":"What is your alternative, Scott?? Just curious.","commenter_a":"Liz Warren is pissed off. Anyone who •isn't• pissed off, isn't paying attention!","post_message":"Yves Smith shreds the the Obama administration's rebuttal to Elizabeth Warren's critiques of the secret trade panels proposed in the TPP and TTIP treaties."}]
