[{"comment_id":"10156120572270354","commenter_b":"She is a Dumb o crap","commenter_a":"The city of Baltimore has an idiot for a mayor. I wonder if he is a Democrat or a Republican?","post_message":"“This settlement...avoids costly and protracted litigation that would only make it more difficult for our city to heal and potentially cost taxpayers many millions more in damages,” said Baltimore Mayor Stephanie Rawlings-Blake."},{"comment_id":"10154262289194877","commenter_b":"And this the female who said it.","commenter_a":"Put your picture up there probably a dog","post_message":"Not today Satan."},{"comment_id":"1551588725149374","commenter_b":"Rest in the arms of Jesus little man. The world is praying for your family.","commenter_a":"you are in my prayers little angel. So are your mommy and daddy.","post_message":"Our hearts go out to the family of 2-year-old Nebraskan boy, Lane Graves."},{"comment_id":"10152727190457452","commenter_b":"This is why women do NOT belong in an all male environment. You uptight B****s can't even take a joke.","commenter_a":"Is she going to use a flag or a kitchen rag?","post_message":"Meet Sarah Thomas, the first woman hired as an NFL official, according to reports. @webpagelink"},{"comment_id":"1338951096148716","commenter_b":"Anthony - Huh? Who proposed that? If you're not a citizen, you don't get to vote. If undocumented get amnesty (which can only be done by Congress), that doesn't necessarily make them a citizen. If we decide (via legislation) they should have a path to citizenship, then citizens get to vote. Your comment makes no sense, and is a total strawman.","commenter_a":"If you can't win on the merits of your policy ideas, change the system. The GOP should be ashamed.","post_message":"Republicans are pushing, in Virginia and elsewhere, to make it harder for Democrats to win the Electoral College."},{"comment_id":"10152935286327426","commenter_b":"Medical \"miracle.\" Plus, you're not dead yet, so you're dreaming of what you expect to see. If you were convinced you were going to an eternal punishment, you'd have a very different dream outcome. Also, funny how this doesn't work trans-culturally, don't you think?","commenter_a":"Amen","post_message":"His family is convinced it was a miracle."},{"comment_id":"10154937498024885","commenter_b":"She MAY have HAD fashion, but when she wears hideous clothes made for her. It speaks volumes.","commenter_a":"Ok Post Disgrace, we get it STL has a slightly few more liberal, reverse racist, nobodies then the rest of the Midwest. However, this is no time to be praising Osama Obama's wife. We just celebrated Christmas for God's let's try to keep the sane ones sane.","post_message":"\"She's made an effort to wear accessible fashion,\" designer Tracy Reese says. \"I think Jackie (Kennedy) was a great role model but she wore a lot of couture, and things that most Americans could not afford.\" Mrs. Obama, she says, has worn both high-end and moderately priced fashion."}]
