[{"comment_id":"1756660697910009","commenter_b":"I hate everything about this wannabe she makes me sick","commenter_a":"I think I throw up in my mouth every time this convict opens her trap.","post_message":"\"Don't let anyone tell you that our country is weak. We're not. Don't let anyone tell you we don't have what it takes. We do. And most of all, don't believe anyone who says, 'I alone can fix it.'\" Hillary Clinton slammed Donald J. Trump, saying his words \"should set off alarm bells for all of us.\" @webpagelink"},{"comment_id":"1270991109602974","commenter_b":"You are full of BS. Damm Obama imported these terrorists and should be charged and prosecuted!","commenter_a":"It doesn't matter what kind of statement Trump makes if it's not from the heart and just words he thinks people want to hear it meant nothing at all. When our PresidentObama sends his condolences and express his deepest regrets it is from the heart. Trump on the other hand is only putting on a show to try to make President Obama look bad because that is what all the Repugs do!! Won't work!!!","post_message":"This is what a real leader does!"},{"comment_id":"10154144112782699","commenter_b":"too bad this policemans life has been changed because of some mouthy teenagers","commenter_a":"With the chief of police not supporting him...most definitely. He can't go it alone.","post_message":"\"Eric Casebolt of the McKinney, Texas Police Department has quit his job, after a video of him pulling his firearm on rowdy teens went viral.\" @webpagelink Do you think the officer should have resigned?"},{"comment_id":"966131710165214","commenter_b":"The people Hitler was fighting nare in control of America now.#GoZioniost#FickZionoistPuppets","commenter_a":"Hillary and Obama are a cancer to our country.","post_message":"Is it happening again? Join Us: The Free Thought Project"},{"comment_id":"10153656714955575","commenter_b":"Well Baltimore is already torn up for them!!! Wonder what the blacks think about them coming.","commenter_a":"Obama is bringing Mexicans and Syrians in to train them. Terrorist that kill with weed whips","post_message":"Baltimore politicians defying logic once again. . . ."},{"comment_id":"10153883162778145","commenter_b":"Illegals cannot vote","commenter_a":"she has a point nobody likes having to pay for others but more than 50% of US citizens are on government assistance and probably all of the illegals that's why the democrats keep trying to make it easier for felons and illegals to vote , you know they will vote for the party giving stuff away","post_message":"The profanity-laden video was uploaded to YouTube and has sparked headlines and heated discussions on social media. You can watch it here:"},{"comment_id":"10153153444601051","commenter_b":"Go ahead baby girl google dat, ill wait.... Lol","commenter_a":"This Latina is a trump supporter.","post_message":"We went to the Donald Trump protest this week to speak to his supporters and critics. Here's what they had to say. Do you agree or disagree with Trump when it comes to immigration?"}]
