[{"comment_id":"10152542079335927","commenter_b":"What state elected this Muslim trash","commenter_a":"Minnesota has a Muslim problem. There has been over 40 of its citizens gone over to the Middle East to fight for ISIS. The liberal democrats will welcome these terrorists make to the United States with open arms.","post_message":"It's a tricky situation preventing money from getting into the hands of terrorists."},{"comment_id":"10152782566181051","commenter_b":"I hope the next time Kanye storms the stage whoever is up there just decks him. What a POS!!!","commenter_a":"I thought west was leaving the USA. What happened? We'll help pack you up and get you out of here!","post_message":"Beck just issued a response to Kanye West’s rant about him not deserving a Grammy."},{"comment_id":"10153053821551051","commenter_b":"Nazi bitch. Do that in front of me. Evil","commenter_a":"Again school employees who think they have the answers this is awful and someone should take her food away from her","post_message":"A school official walked up to this little girl, picked up her lunch and threw it in the trash in front of everyone. The girl immediately began to cry."},{"comment_id":"10156224999290551","commenter_b":"Go back to your own shithole country.","commenter_a":"Let's wrap them up in bacon and send em back to where they come from😎","post_message":"Trump was right - Muslims did celebrate 9/11."},{"comment_id":"10154740685431337","commenter_b":"Hillary is the whore of Islam.","commenter_a":"If Hillary is elected president, Putin said he will wage nuclear war against the United States, but I guess that's not a big deal...","post_message":"Barack Obama's 10 Essential Sci-Fi Movies And Shows:  The Matrix Star Wars: Episode IV Star Trek: The Original Series Cosmos (...)"},{"comment_id":"10154239643734411","commenter_b":"Evil Bitch","commenter_a":"That last one killed me, oh man","post_message":""},{"comment_id":"1159279537467495","commenter_b":"The Obama 's are more racist then anyone else Michelle everytime she opens her racist mouth it's all about her give me a break and it's true the other 1st ladies have more class then she will ever have and it has nothing to do with the color of her skin if the whites are so racist he wouldn't have been in office","commenter_a":"I wish she has racism up her back side!!!","post_message":"Michelle Obama Calls Out Military Racism  This Marine Answer Is DEVASTATING!"}]
