[{"comment_id":"981651015256776","commenter_b":"Lol because people and companies don't donate cars and trucks for tax write offs","commenter_a":"God forbid American tax payer money goes towards improving lower and middle class families or stuff that actually benefits us, but check out the sweet new cars dps get to drive!","post_message":"Next time you pass a red Dodge Challenge or Yellow Ford Mustang GT, you might want to check your speed. DPS troopers now have two new unmarked vehicles for traffic enforcement."},{"comment_id":"555840684604224","commenter_b":"Look how christianity views woman it's almost as bad","commenter_a":"What confuses me is why women would want to stay in this horrific religion that view women and children less than animal's. Mohammed is dead he isn't coming back !!!","post_message":"Spread this..."},{"comment_id":"1450281048346082","commenter_b":"'@username why don't you then? Rather than complaining? You are angry because women are doing exactly that for themselves but they aren't doing it for you?","commenter_a":"Machism means feminism...no extreme is good...Breast cancer has 10x more funding and support than prostate cancer (for equal mortality), there are more men incarcerated than women, men spend more time in jail then women for the same sentences...Men also suffer from inequality and starts from birth: life expectancy is lower than females and seems to be genetically driven (extra Chr X seems to provide some protection)","post_message":"Do you know what machista means? The hashtag #EsMachismo started trending, and these 21 tweets explain a lot. - Alicia E. Barrón"},{"comment_id":"10153424908946094","commenter_b":"I wonder if the folks at Apple are thinking 'PLEASE Mr. Snowden, don't support us!'.","commenter_a":"Citing an 18th century law concerning iPhones?!","post_message":"A major debate over privacy and online encryption has erupted after the computer giant Apple announced it will resist a court order to help the FBI break into an iPhone recovered from one of the San Bernardino shooters."},{"comment_id":"10153703239058984","commenter_b":"She would be the worst women president ever !!!!","commenter_a":"Same crap. Boring!","post_message":"She wasted NO time with this one...  Do you think Hillary would be the worst pick for president?"},{"comment_id":"1008713619198681","commenter_b":"She's a BAD example of a women !!!!","commenter_a":"Excellent ... +++","post_message":"Whoever you support in this election, it's important to mark historic firsts - and this is the first time that a woman from either party has won the Iowa caucus."},{"comment_id":"10153672451109062","commenter_b":"He's a lady","commenter_a":"Michael Keaton was robbed!","post_message":"BEST ACTOR goes to Eddie Redmayne for 'The Theory of Everything.' More: @webpagelink  Photo: Dan MacMedan, USA Today"}]
