[{"comment_id":"429495940593558","commenter_b":"The racists are AGAINST Trumo!","commenter_a":"The days of Nazi Germany are coming back if we don't stop this racist Trump. Blacks and Latinos must unite power to end this nonsense.","post_message":"The Secret Service rushed to shield Donald J. Trump after someone tried to jump a barrier during an Ohio rally on Saturday."},{"comment_id":"10153059465629614","commenter_b":"Just because u are a police dose not mean that u have the right to break the laws n u say that police need a break well who give use a break","commenter_a":"She doesn't no her traffic sings lo hahaha","post_message":"A sheriff deputy is under investigation after cell phone video showed her getting into a patrol car that was parked in a disabled parking space at a Circle K store in Sacramento. always park in handicap when you not on a call? A man can be heard saying in the video. allowed to get breaks, the deputy replies. The Sacramento undersheriff said he was disappointed and that punishment could range anywhere from documented counseling all the way to termination. Watch KTLA video here: @webpagelink"},{"comment_id":"10154275464344024","commenter_b":"@username You stfu!","commenter_a":"It's so nice to see that Black Lives Matter to Black People!","post_message":"Two people were killed early this morning, and several others were wounded, in a shooting at a Halloween party in Newburgh, Orange County. Details: @webpagelink"},{"comment_id":"1342533789196332","commenter_b":"It's all the evil devil and god. God controls everything so all Christian's say. So he was obviously murdering babies in Syria with an American fleg while satana Satana was makin googoo sing good lol. It's the devil but. Fuk away aff to your backward bible ye balloons and leave the rest the world out your hilariously illogical book of fairytales. Batter still. Get one your mates to stab you in the eyeball so you get t meet Jesus sooner and save us having to see an read your hilarious pish from the days before people could read. Pol","commenter_a":"They all signed in blood, sold they're souls! Devils!","post_message":"Someone Removed Background Music From Lady Gaga’s Superbowl Show, And It’ll Give You Goosebumps"},{"comment_id":"10153680623219087","commenter_b":"@username Why should the gun industry be the only industry in our country to be granted blanket immunity?","commenter_a":"Ah yes, @username ready to go with its latest Bernie slam piece right after he wins Wisconsin and right after they post an article praising Hillary's graceful concession. Quality, non-agenda-filled journalism, lads and ladies.","post_message":"\"Shame on you, @BernieSanders try living one hour of our lives. Love, the #SandyHook Principal's Daughter,\" Erica Smegielski tweeted with links to the front page of Wednesday’s New York Daily News, with a headline reading: Bernie’s Sandy Hook Shame."},{"comment_id":"10153199702710095","commenter_b":"We'll soon be seeing the kids wearing these shirts. Happens every election. Thanks for helping to clothe the poor in Africa and South America.","commenter_a":"Please take the time to read my little rant! And the article! Monday morning trash x 2 floors.. Plus 6 bathrooms to wipe up and make presentable, a floor and a half to sweep and mop, vacuum 1 study room, then I can begin in my own bathrooms according to schedule.. Ive mopped my half of 5th and finished up there about to sweep and mop my own whole floor.. All for $7.57 an hour.. Oh and I left our the part about the beer poured all over the floor near and in back of fifth floor trash cans.. Im not usually a complainer and I really feel sorry for the people that have been here longer than me. Pack the students in and don't worry these petty people will clean up whatever the students can throw at them.. I was also promised a raise after 6 months of my ...","post_message":"New Jindal for President shirts are available. Buy one today."},{"comment_id":"924961764238223","commenter_b":"Some companies are specifically recruiting unskilled migrants because they know they can get away with paying them next to nothing! Also these entrepreneurs you speak of often pay such little to their employees so they can get rich themselves!","commenter_a":"70% tax from working people to pay while we have so many lazy unemployed sitting at home seems fair","post_message":"She says injustice and inequality makes her \"as angry as the Hulk\"..."}]
