[{"comment_id":"1035032136534126","commenter_b":"You're a sick woman.","commenter_a":"Go Trump..Tell us the truth because that's what the people want to hear! We don't want Muslims or Cubans running our nation!!! Trump 2016","post_message":"Donald J. Trump wants Iowa voters to keep this one thing in mind come caucus day: \"When you’re casting your ballot, remember.”"},{"comment_id":"10150699616999999","commenter_b":"He knows well cause his father was a partner with the militar goverment that killed thousands of Argentinian citizens.","commenter_a":"If I were him I would use another story. Something to do with Argentina and it's people. Just saying.","post_message":"At 32, Mauricio Macri, the president-elect of Argentina, was kidnapped and placed in a coffin by rogue police officers, an awakening that put him on a path toward politics."},{"comment_id":"867487780024323","commenter_b":". #TooChickenToDebate #ChickenTrump #ChickenShitTrump #ChickenHillary #ChickenShitHillary","commenter_a":"God bless you for being you Hillary.","post_message":"\"I have fought for the rights of women and girls here at home and around the world. It really maters whether women are treated with respect and equality, because when we do that, we are all better off, our economy is better off, our democracy is better off.\" —Hillary"},{"comment_id":"1065696356784708","commenter_b":"and it is not round","commenter_a":"So the planet isn't flat.","post_message":"Find out what the world really looks like."},{"comment_id":"10155187211337871","commenter_b":"Two out of 54 are not very good odds but we can't give up hope.","commenter_a":"Thoughts to the EDITOR of a Free Press by President Jefferson... \"Perhaps an editor might begin a reformation in some such way as this. Divide his paper into four chapters, heading the 1st, Truths. 2nd, Probabilities. 3rd, Possibilities. 4th, Lies. The first chapter would be very short, as it would contain little more than authentic papers and information from such sources as the editor would be willing to risk his own reputation for their truth. The second would contain what, from a mature consideration of all circumstances, his judgment should conclude to be probably true. This, however, should rather contain too little than too much. The third and fourth should be professedly for those readers who would rather have lies for their money than the blank paper they would occupy.\" --Thomas Jefferson to John Norvell, 1807. ME 11:225","post_message":"\"I hate the press. I hate you especially. But the fact is we need you.\" - Senator John McCain jokes, but stresses the importance of a free press to a democracy, adding that \"the first thing that dictators do is shut down the press.\" Read more: @webpagelink"},{"comment_id":"747501402054427","commenter_b":"Wouldn't happen to my children. My kids are five,three and one. They know better than to go into a wild animal pens. Plus me and my wife keep our eyes on them all the time. Hands are held too at all times. No excuses for that gorilla to be killed. The parents were neglectful and should be charged with neglect and child endangerment. That gorilla didn't ask to be in the pen. Then to be killed for being a gorilla. I'm not saying leave the kid to die either. Sad situation that should of never happened.","commenter_a":"For all of those slamming the zoo for killing the gorilla, what if it was your kid who fell in? Would you want the zoo to let your kid die because the gorilla was endangered? We all need to think and put ourselves in others shoes before we start spouting off on things.","post_message":"Jack Hanna says he agrees with the decision that the Cincinnati Zoo made in killing the gorilla that was dragging a toddler who fell into its enclosure. Learn more: @webpagelink"},{"comment_id":"678517065647894","commenter_b":"#TRUMPPOTUS Save America from wussies!","commenter_a":"When is NBC going to start posting about the latest Wikileaks stories?","post_message":"\"I regret coming to the Trump support event, and in particular allowing my son to be a part of it,\" one donor said."}]
