[{"comment_id":"10153444075108132","commenter_b":"Pretty sure she's had surgery and botox.. or some serious airbrushing was done. Cripes everyone at 50 has a wrinkle.","commenter_a":"Thank you for picking someone normal and down to Earth without a bunch of surgery","post_message":"Sandra Bullock is PEOPLE's #MostBeautiful Woman! @webpagelink"},{"comment_id":"351086708348331","commenter_b":"All about the MONEY Honey.","commenter_a":"It has profited as much as it can.","post_message":"“One source confirmed to me Caitlyn Jenner has made whispers of ‘sex change regret,’ hinting she might go back to being Bruce Jenner.” - Ian Halperin"},{"comment_id":"10153711323820695","commenter_b":"Girl, STOP!","commenter_a":"A true example of faith. My prayers go out to him and his family. They'll get what they deserve, evil doers do not prosper.","post_message":"FORGIVENESS: That's what the wife of a man shot during a home invasion is expressing as her husband recovers."},{"comment_id":"10154102515036409","commenter_b":"She knows how to promote something unreal as real!","commenter_a":"Yes! Prepare to have big business be hit with a steel chair! Bring Main St back to America!","post_message":""},{"comment_id":"10153793026628010","commenter_b":"@username Try entering Mexico illegally and see what happens","commenter_a":"Most illegals can't come on work permits or marry for papers. Most hope to just work and return home. Lebanese, Greeks, Armenians and Syrians, Salvadorians are fleeing their countries do to violence. Are they criminals for entering the USA, and other countries in order to want to survive? Wanting a better life isn't a crime.","post_message":"It is the fourth immigrant detention facility in the U.S. where protesting detainees have refused food in recent weeks."},{"comment_id":"1372039169498167","commenter_b":"Illegal aliens out of my health care","commenter_a":"Politics is what got you your \"free\" healthcare. We the people are tired of being forced to pay for it, So please feel free to sit down and STFU.","post_message":"HERE IT IS!"},{"comment_id":"861173230647951","commenter_b":"She is crazy","commenter_a":"Just 12 years? WTF","post_message":"8-year-old Julie died the same day she was going to be a flower girl at a wedding. Her mom has admitted to killing her daughter."}]
