[{"comment_id":"10153975105390950","commenter_b":"Lock her up for life","commenter_a":"Sounds like she should have found a new career. A long time ago","post_message":"In one incident, the woman hung up on a caller reporting a robbery at a convenience store. The man called back and spoke to a different operator, but by the time police arrived, the store manager was dead."},{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"10154108531615950","commenter_b":"Wrong. Abortion is a huge problem and IS murder. IF A PREGNANT WOMAN GETS MURDERED ITS DOUBLE. HOMICIDE..DOUBLE STANDARDS","commenter_a":"Why are people so fixated on someone's death? That is, ONLY if the tool used happened to be a firearm? Why not by other tools and means? #1. There is no gun death epidemic in America. In fact, many more people are killed each year by abortion, alcohol, tobacco, obesity, vehicles, prescription drugs, drownings, STDS... #2. Murder is not on the rise in America. In fact, violent crimes across the board are down some 50%, and have been falling for the last 20 plus years. This despite the fact that firearm ownership is quickly rising more each year. Studies even show where private firearm ownership is the highest, crime is the lowest. #3. Many of the same people who are supposedly against the deaths of a small percentage of people by firearms, are perfectly happy to murder their own sons and daughters by the millions each year. Talk about hypocrisy! ...","post_message":"Police locked down a South Florida mall after one person was killed and another was injured in a shooting."},{"comment_id":"10153220185391336","commenter_b":"I bet you that pussy Obama couldn't ride a bike","commenter_a":"How racist of him to ride a bike it's all his fault","post_message":"Former President George W. Bush hosted his fifth annual Warrior 100K bike ride in Crawford, Texas. This year's theme was healing the invisible wounds of war. @webpagelink"},{"comment_id":"899588953421066","commenter_b":"Even Satan and the demons in Hell believe God exists. They know He does. Why aren't they in Heaven?","commenter_a":"There Will Never Be An Excuse Big Enough To Convince Our GOD That Killing Innocent Babies Is Okay! :(","post_message":"Do you agree?"},{"comment_id":"10152623544456680","commenter_b":"Yes, I want our economy ran into the ground by having a college drop-out as our president. Said no one. Ever.","commenter_a":"I would rather see him run than Walker! I'm scared of Walker. After what he's done in WI, our economy would be in shambles after one year under him. @webpagelink","post_message":"Jeb Bush isn’t playing well among Republicans, Peggy Noonan writes in a new Wall Street Journal op-ed."},{"comment_id":"1091990537522616","commenter_b":"Fat lady has not even cleared her throat yet.","commenter_a":"Jesus Bernie. You've given up. You're turning into what you've said you despise. All of us fought for you, not so you could buckle up like a belt and endorse Hillary. I refuse to vote for Hillary. You are letting us all down, all because of a back-room conversation where Barack likely asked you to 'fall in line'. I'm concerned, but still very hopeful that you get up on that stage at the DNC, and demand that your followers vote 3rd party!!!!!","post_message":"I want to express my pride in what we have accomplished together over the last year. But so much more must be done to make our vision a reality. Now more than ever our country needs our movement — our political revolution. As you have throughout this historic campaign, I ask for your ongoing support as we continue through the fall and beyond."}]
