[{"comment_id":"10154082768681130","commenter_b":"The popular vote doesn't determine the presidency.","commenter_a":"She should have picked Bernie and that way all his voters would have voted for them","post_message":"Meet Hillary Clinton's running mate: Sen. Tim Kaine of Virginia."},{"comment_id":"10154315361436656","commenter_b":"Shes a bi**h fr","commenter_a":"Let it go nothing or know one is perfect, and we surely can't do what she does on a good day! Let it go... Damn media!","post_message":"\"I'm trying to be a good sport here.\""},{"comment_id":"10153050855917452","commenter_b":"Sound like she listening to Future lol","commenter_a":"Lmao wtf","post_message":"A suspected car thief got out of the vehicle and started dancing in the middle of the street after leading police in a wild chase through downtown Los Angeles. @webpagelink"},{"comment_id":"1617460714934208","commenter_b":"Hopefully she'll waste away and go away","commenter_a":"Apparently not","post_message":"Since she's not moving to Canada, Dunham could always try eating all that crow."},{"comment_id":"10154752862228941","commenter_b":"No Weapon formed against us shall prosper...witches have absolutely no power over men of God","commenter_a":"These people are not REAL witches. They do not know what they are doing and only will cause harm to themselves. Real witches look to help and heal. What they put out comes back three fold. These people are just plain evil and should not be considered as witches.","post_message":"The forms of protests against President Donald J. Trump are just getting weirder and weirder..."},{"comment_id":"10156094482870354","commenter_b":"Throw that fat stank ass pig in the pen!","commenter_a":"She deserves the same","post_message":"***UPDATE***"},{"comment_id":"922136247820460","commenter_b":"Keep drinking the kool-aid lady!","commenter_a":"I think you are clueless dude. The \"obstructionist party\" is obstructing because they have listened to their fellow supporters of we the people! I don't want more and higher taxes! I don't want more illegals here illegally! I don't want Obamacare! I don't want a gigantic government telling me when, where, why and how to blow my nose! I don't want them taking away my guns! I don't want them (Democrats - now the Socialists/Communists of America) allowing Bengazi, fast and furious, and Ferguson protests to happen. I don't want Obama \"using his pen and paper\" Anymore! ILLEGALLY! WITHOUT CONGRESS!","post_message":"Back home in Indiana after a late night. The Senate held its 25th amendment roll call vote of 2015 late yesterday, already more than all of 2014."}]
