[{"comment_id":"10153411890906167","commenter_b":"Nah. Satan and the Mrs, would have had an abortion before bringing this creep into the world. ;)","commenter_a":"the son of satan.","post_message":"Troy Newman's views are so extreme that, as The New York Times reported in 2015, Australia cancelled Newman's visa over 'concerns that he might encourage violence against abortion providers or women seeking the procedures.'"},{"comment_id":"475027816013769","commenter_b":"Guess she is a shameful person.","commenter_a":"Remember, she was also 'ashamed' that Bush was from Texas","post_message":"Dixie Chicks member Natalie Maines also took aim at Donald J. Trump, tweeting, 'As long as Donald Trump's decisions for America are as solid as his decision about his hair, we're in good shape.'"},{"comment_id":"837605946394236","commenter_b":"Another dumb southern woman","commenter_a":"If y'all vote Killary in, You are the dumbest people that walk the face of this earth. Obama has done enough damage. Military people do not want Killary as their commander and chief. If you think of no one else, think of our military. She has NO CLUE how to run this country.","post_message":"Donald Trump has landed at Dallas Love Field.  WATCH LIVE coverage of visit: @webpagelink READ latest updates & see photos: @webpagelink"},{"comment_id":"10153002585681770","commenter_b":"All conservative women are stupid!!!","commenter_a":"All liberal women are stupid!","post_message":"During a keynote address at the New York State Fair Wednesday, Democrat New York Senator Kirsten Gillibrand erroneously referenced the Constitution’s Fourteenth Amendment as the law that gives women the right to vote."},{"comment_id":"10153137257982869","commenter_b":"Mr. McCain should not have called Trump backers, 'crazies' but I dont hear any of you calling him on that. I like you Mr. Huckabee and would vote for you but understand that Trump is saying what we want ALL of you to say, the truth! McCain can no longer ride on his service alone, he is an awful senator and has done much to hurt veterans today!!!!","commenter_a":"I agree! I respect him for my freedom! He has been outspoken about issues I agree with - don't know what will steer our country In the right direction. I know we need prayer first! Who loves America the most should be elected! I love my country and love it's history! To all who love our red, white and blue!","post_message":"John McCain is an American hero. When our troops return from combat, they should be treated with the utmost respect and admiration. Every breath I breathe and every step I take is free because of brave Americans like John McCain."},{"comment_id":"10153541363403908","commenter_b":"Ass holes and sexism lol I understand!","commenter_a":"Kendrick- a small reference for the man haters in your life? Idk","post_message":"earlier this year, women were using the hashtag #WomenAgainstFeminism in order to set the record straight about their views on feminism. Here's a powerful response  for the 'not a feminist' movement. What are your thoughts on this?"},{"comment_id":"1683735615241075","commenter_b":"'@username that 'swhy we dont need foreigners like you in our country! keep begging... you still dont think you are mentally ill! lmao an opinion got your balls, smh sick in the head.","commenter_a":"l.o.l why it took a republican... Donald Trump is the truth and he makes sense but his arrogance ways does make him look bad ! but we dont need anyone leaving or coming into America right now since we have no control over our country....","post_message":"They called on Republicans to reject Donald J. Trump immediately."}]
