[{"comment_id":"10153218039995090","commenter_b":"Stop Hillary!","commenter_a":"REMEMBER THE.LINTL Whttps://www.facebook.com/judy.winders/posts/@username LINTON. MURDER LIST","post_message":"Taking a road trip this summer? Show that you are committed to Stopping Hillary.  Take the pledge & get your free Stop Hillary bumper sticker: @webpagelink"},{"comment_id":"1155155194501829","commenter_b":"Get over it. There are two different justice systems, if not more; operating within one....","commenter_a":"white privilege","post_message":""},{"comment_id":"10153523843241323","commenter_b":"Get a gf!","commenter_a":"In good times and bad times ........dick head there is prob shit about you but she's doesn't tell you ! She just except the idiot you are !","post_message":"How do I tell her how I feel without hurting her feelings?"},{"comment_id":"10153006629032756","commenter_b":"no it isn't all urine its sweat also, you ever lean on a couch and your arms start itching well that usually sweat, other bodily liquids like tears, saliva and other related stuff can cause the burning of the eyes too","commenter_a":"Jason Meade","post_message":""},{"comment_id":"1014969508525839","commenter_b":"It only matter what the FBI thinks about the emails. It's obvious when obama's FBI investigates it's something serious.","commenter_a":"Socialist nut job or a lying criminal oh the options we have.","post_message":"This is the surprise moment from the #DemDebates everyone will be talking about tomorrow."},{"comment_id":"10155008790239214","commenter_b":"@username please educate me as to exactly how NM receipt of federal dollars will be affected by the senator's boycott of the inauguration.","commenter_a":"Please don't join that ship of fools boycotting the inauguration. New Mexico needs those federal dollars.","post_message":"The president-elect is taking to twitter this weekend to harass a civil rights icon and the Director of National Intelligence. I think we can all agree that is not how Donald Trump should be spending his time."},{"comment_id":"803115886455778","commenter_b":"Shoot that mother f***** in the head","commenter_a":"Courtney Surprenant my fear at dollar tree or anywhere really","post_message":"Video captured a Florida mother wrestling her own daughter from the arms of a would-be kidnapper inside a store. The suspect ran out of the store but was quickly stopped by an off-duty police officer at gunpoint. @webpagelink"}]
