[{"comment_id":"439880426200251","commenter_b":"Awesome we need more women like her.","commenter_a":"I would done same","post_message":"Don't mess with this mom..."},{"comment_id":"10153155824991770","commenter_b":"My all time favorite woman. Great leader, strong, respected. Leader@","commenter_a":"Certainly an Iron Lady! Lest you forget she helped cover-up atrocities committed to the Irish people in the occupied 6 counties. Allowed 10 hunger strikers to die and was forced out of office. Thatcher came under intense pressure from Ronald Reagan to avoid a military response from the Falkland Islands.","post_message":"Margaret Thatcher has been voted the most influential woman of the last 200 years in a recent poll."},{"comment_id":"10153471873556770","commenter_b":"'@username - afraid your husband will be deported huh?","commenter_a":"These Clowns are hilarious Dracula aka Cruz and Cruella Devile aka Fiorina ....She was dying for some spotlight....Well she will get if for about another month...Then Bye Bye weirdos","post_message":"During Carly Fiorina’s acceptance speech for running mate with Sen. Ted Cruz, Fiorina sang a made up nursery rhyme to Cruz’s daughters."},{"comment_id":"10156122397820354","commenter_b":"Hang her worthless ass for treason!!!","commenter_a":"Sickening","post_message":"Yesterday, a defiant Hillary told the AP she wouldn't apologize for endangering U.S. national security with her unprecedented secret server scheme. Today, she flipped.    FACT: No other Sec. of State in American history has EVER set up a secret private server. Period."},{"comment_id":"10158383797715093","commenter_b":"what do we care? get the wall built!","commenter_a":"I BET THE PEOPLE WHO LEAKED WERE DEMOCRATS","post_message":"'It time for the constitutional system to work. It time for the legislative branch to investigate the executive. Simply put, it time for the truth.'"},{"comment_id":"10153400582321051","commenter_b":"She's a bitch? Really???","commenter_a":"Have fun in jail bitch","post_message":"When this man's wife discovered he was cheating on her, here's how she decided to handle it."},{"comment_id":"10153706263011336","commenter_b":"Who cares.. She's an old dried up prune!","commenter_a":"Oh dear... Am I surprised or what? NOT!!! :)","post_message":"BREAKING NEWS: After declining to state her position for years, Democratic presidential candidate Hillary Clinton says she opposes the Keystone XL oil pipeline."}]
