[{"comment_id":"1311191442237531","commenter_b":"Pretty lady","commenter_a":"Same thing happened to me but without the note.","post_message":"'Found this on the floor of a bar about a year ago. Hope you don mind...'"},{"comment_id":"1175128772557320","commenter_b":"This one nah woman?","commenter_a":"You didn't lose because you're a woman. You lost because of all the horrible things you did. Trump might have said a couple bad things, but you did many bad things. You spend our enemies money bashing him and he funded himself. I can't wait till he's in office and saying Merry Christmas is ok again and don't have to worry about offending someone for saying it. He WILL make America great again. GOD bless him.","post_message":"Scripture tells us: Let us not grow weary in doing good, for in due season, we shall reap, if we do not lose heart."},{"comment_id":"10154348216771337","commenter_b":"Michael Joseph wow this guy has balls, he's about to lose 100,000 to the Rap God","commenter_a":"That's cute","post_message":"WTF? Nick Cannon has quite the challenge for Eminem."},{"comment_id":"10153784012776337","commenter_b":"Bitch you won't riot. You'll cry !","commenter_a":"if you kill glen we riot","post_message":"HE TRIED! One The Walking Dead character would still be alive if producers had listened to Andrew Lincoln..."},{"comment_id":"1086698044698949","commenter_b":"THINK ABOUT THIS ,TRUMP SAYS HE'LL ADD A 45% TARIFF ON IMPORTS FROM MEXICO AND CHINA ,STOP MONEY TRANSFERS OUT TO MEXICO TO GET THEM TO PAY FOR A WALL ,WE EXPORT 236 BILLION A YEAR TO MEXICO IF WE ADD A 45% TARIFF TO IMPORTS THEY WILL DO THE SAME ,BOOM! THOUSANDS OF PEOPLE OUT OF WORK !! CHINA IMPORTS 116 BILLION FROM AMERICA INCLUDING ALMOST OUR INTIRE CROP OF SOYBEANS ,WE MESS WITH THEM THEY GO SOMEWHERE ELSE ONCE AGAIN FARMS SHUT DOWN, FARM HANDS OUT OF WORK .WE'RE TALKING 1930'S STYLE DEPRESSION.WHY ?..........DONALD TRUMP WE IMPORT MORE FROM MEXICO THAN WE EXPORT TO THEM TRUE 5 BILLION A YEAR IS DIAMONDS AND PRECIOUS METAL,14BILLION A YEAR IN OIL,AND 11 BILLION A YEAR IN FRUIT,NUTS AND VEGETABLES ,YOU WANT YOUR FOOD AND FUEL COST TO GO UP 45 % IT WON'T BOTHER TRUMP HE'S WORTH 10 BILLION","commenter_a":"Our current administration is a joke. They have been living off of the tax payers for years without one concern for the US Citizens. People, wake up. Take a good long look at your life, are you living better now or five years ago? or even 10 years ago, Is your income the same, are you now needing to work 2 jobs just to make ends meet. People, we are now competing with our teenagers for the jobs we held as teenagers to learn responsibility just to make ends meet. Wake up people, I don't think this is what our parents believed was the American Dream. And we certainly aren't living better than they did. Think long and hard about your future and that of your children and the generations to come, will they have a FUTURE!!!!!!","post_message":"Whoa!! Do you still support Trump?"},{"comment_id":"10154457609673812","commenter_b":"#RIP @MuhammadAli #MuhammadAli #TheGreatest @webpagelink","commenter_a":"RIP and praying for your family","post_message":"BREAKING: Boxing legend Muhammad Ali has passed away at age 74, according to family spokesperson. @webpagelink"},{"comment_id":"1119860174747403","commenter_b":"I don't need friend like that... Whend they go to my home they got everything and more.. and whend I go to they shiet hold I have to wayting.. I don f think so... don't invite me no more.. I got my own park in my house.. .. is my house and I live here. Jajajajaja... fucking IDIOTS...","commenter_a":"Lydia Taylor lol so you 😂😂😂","post_message":"The struggle"}]
