[{"comment_id":"1754978767895197","commenter_b":"Trump going to build that wall around your house.","commenter_a":"good lord, no tact at all. Biggest moochers on the planet, biggest joke presidency. Not enough he more than doubled the national debt, now in his mere final weeks, they go ahead and keep living high on the hog. Trump was not my pick among GOP candidates, but doing this stuff for 8 years while telling successful hardworking citizens ,'you didn't earn that' or 'some folks are going to have to give up their piece of the pie' really screamed to everyone on how we don't want this again.","post_message":"Aloha Obamas!"},{"comment_id":"10154362042947756","commenter_b":"I would like to point out, this is myself debating with other women, not only do they act insane, but they will hate on any woman whom has a different opinion, get rid of the illegals, they are a drain on our economy...period, if you don't like, then let them live in your home, your a bunch of rabid animals acting like crazy people...how can anyone ever take you seriously...this was an experiment for my college professor whom wanted us to learn abouy equality...lol","commenter_a":"Well once all the blood sucking illegal's are gone, we can put money towards our vet's and the wall, we all know Mexico is to cheap and lazy to pay for it.","post_message":"President Donald Trump is expected Wednesday to move forward with plans for border wall, increased deportations."},{"comment_id":"10154227376546336","commenter_b":"She'll milk it til the end.","commenter_a":"There was never evidence to warrant charges. Hopefully, that reporter had her five minutes in the spotlight, and she's done in the field of journalism. What an insult to journalism!","post_message":"Breaking News: Charges will not be filed against Donald J. Trump's campaign manager Corey Lewandowski, Florida state attorney says."},{"comment_id":"10157018686460389","commenter_b":"And who is this new party going to be run by.. Romney?","commenter_a":"Ronald Reagan had similar numbers at this point in the process...the anti-Trumpites will fall by the waste-side....they are caught up in narrow-mindedness babble that has locked the GOP out of the White House for 8 years...it does not work WITH their current platform...we will re-write the 'Contract with America' and the Republic's Platform (for our constitutional republic) and our new GOP party--the New American Conservative Party...AND TRULY MAKE AMERICA GREAT AGAIN. #TeamTrump #TeamUSA #BrightLightOnTheHill #AnythingisPossible #PositiveAttitude","post_message":"This is what an insurgency looks like."},{"comment_id":"1092002180891914","commenter_b":"Tiny little penis","commenter_a":"Piece of shit","post_message":"Think quick! Then, click 'like' on your favorite answers in the comments.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"863410587096986","commenter_b":"90% London is full of foreigners, loud mouth rude boys and junkies.","commenter_a":"But london will not make exception for trump","post_message":"London's new mayor will be an 'exception' to his proposed ban on Muslims."},{"comment_id":"1092750970772962","commenter_b":"Omg when I hear you little sheep that follow that lying bitch it makes me gringe","commenter_a":"Unfortunately Tronald Dump has his followers their just as dumb as he is at this point Dump can say whatever he wants and he will still have his followers sad what this country has become but we can stop this Dictator in November do the right thing VOTE BLUE","post_message":"LOL"}]
