[{"comment_id":"10153397569465950","commenter_b":"Girl power!! I'm sure he deserved it.","commenter_a":"So. The boy must have said it done something very intimidating to push get to this point don't have think?","post_message":"The viral video of a high school lunch fight shows a girl throwing a boy to the ground. At one point someone tries holding her back, but then she breaks free and knees the boy in the face before running away."},{"comment_id":"10153399838202411","commenter_b":"\"Do the right thing\", go away for good.","commenter_a":"Don't care for him..Chi raq was a horrible movie and I didn't even see and will never ever see it (just from previews). True Chicagoans will agree with me...Ugh, go away and take Kanye west and his family with u too..","post_message":"Happy Birthday, Spike Lee! The director of \"Chi-Raq\" and \"Do the Right Thing\" turns 59 today."},{"comment_id":"1833117833414623","commenter_b":"Migrants coming in to work for the NHS?","commenter_a":"its only going to get worse with all the immigrants coming in","post_message":"Worst NHS week in 15 years"},{"comment_id":"10154546397896162","commenter_b":"Wow. What an inbred type comment. Do us all a favor and move into a cave with a black bear so he can eat your face off.","commenter_a":"dig this monster up and mail him back to the middle east with his family in tow.","post_message":"Visitors gather in Arlington National Cemetery around the grave of Humayun Khan, the U.S. Army Captain whose family has been in public dispute with Donald J. Trump... @webpagelink"},{"comment_id":"10153412977987293","commenter_b":"Racist white lady alert","commenter_a":"I've never seen or heard of another president blamed for more things out of their control.","post_message":"It's not like he keeps a dais parked in front of the desk all the time."},{"comment_id":"1661303277474551","commenter_b":"Municipalities the masses? Did you maybe mean manipulates? Lol","commenter_a":"The more bias tords trump just show how mutch media manipulates the masses and is shooting themselves in the foot","post_message":"\"On Feb. 9, we trust New Hampshire Republicans will send 'Biff Trump' back to somewhere — anywhere but on the road to the most important elective office in the United States at a most crucial time for this nation.\""},{"comment_id":"1097247357003041","commenter_b":"Bitch please","commenter_a":"These cops did nothing wrong. They asked him why he was filming and they were trying to protect there fellow officer. Everyone needs to stop hating on the police.","post_message":"We just received this, these cops are ABSOLUTE CHILDISH BULLIES! Full details: @webpagelink They got right up in his face like they were looking for a fight, they have ZERO respect for anyone outside of their little gang."}]
