[{"comment_id":"720244888107018","commenter_b":"they ran out on their bill and stiffed the waitress , who had to pay it from her own pocket ... THAT'S why they want to raise min . wage to 15, so waitresses at diners can afford to pay the tabs of these deadbeats","commenter_a":"LMBO","post_message":"Who paid the bill?"},{"comment_id":"10153380386696130","commenter_b":"No, illegal immigrants do not commit 35% of murders in this county. Give me factual numbers.","commenter_a":"Everyone hating, yet he leads all polls.","post_message":"The rest of the media finally remembered that Donald J. Trump is entertainment, not politics! (We told ya so!)"},{"comment_id":"1194913097195385","commenter_b":"shame on you that is racist and you being irish you would under stand that do not be like that sarah","commenter_a":"I know his brother Mr Poopoo !","post_message":"Chinese officials detained Ai Weiwei for 81 days and seized his travel documents in 2011, charging him with tax evasion, an accusation he has long denied."},{"comment_id":"10153593433561323","commenter_b":"when people are in the process of migrating from one spot to another they are sometimes referred to as migrants.","commenter_a":"because it describes a particular group of people. Like descibing a group of people from Norway as Norwegian or whatever. jeez","post_message":"\"You will still see the word 'migrants' or 'migration' in the Guardian as a general expression to cover people who for whatever reason have moved, or are moving, from the country of which they are nationals to another. But 'refugees', 'displaced people' and 'asylum seekers', all of which have clear definitions, are more useful and accurate terms than a catch-all label like 'migrants', and we should use them wherever possible.\" - David Marsh, Guardian style guide editor."},{"comment_id":"1070333876354408","commenter_b":"She makes my ears hurt.","commenter_a":"She will say anything and she will lie to America like she's always there","post_message":""},{"comment_id":"895356030506185","commenter_b":"Saudees R disgusting devils.","commenter_a":"Saudi regime should be removed out of power and kicked out of the country.","post_message":"What do you expect of the #Saudi aggression against #Yemen? Raise your voice by taking part in our poll: www.presstv.ir"},{"comment_id":"10152954398027452","commenter_b":"Feminists sure do preach equality until it comes to self-defense.","commenter_a":"The biker needs to be commended on how well he held his composure after being punched more than once by an older man. That Football player that punched a girl needs to take lessons from this guy.","post_message":"Motorcycle meltdown! A driver goes berserk after he says he was cut off by a biker. But what happens next escalates the situation to a dangerous new level that ends in a medical emergency. @webpagelink Is \"driver vs. biker\" road rage getting worse? The confrontation caught on camera. Tonight at 11 from ABC7 Eyewitness News."}]
