[{"comment_id":"1571850159771728","commenter_b":"Wish you would replace Pelosi!!!! Sick of her!","commenter_a":"Hopefully she'll endorse the only true Constitutionalist Conservative, Ted Cruz.","post_message":"This campaign was always about citizenship—taking back our country from a political class that only serves the big, the powerful, the wealthy, and the well connected. Election after election, the same empty promises are made and the same poll-tested stump speeches are given, but nothing changes. I've said throughout this campaign that I will not sit down and be quiet. I'm not going to start now. While I suspend my candidacy today, I will continue to travel this country and fight for those Americans who refuse to settle for the way things are and a status quo that no longer works for them. Our Republican Party must fight alongside these Americans as well. We must end crony capitalism by fighting the policies that allow it to flourish. We must fix our festering problems by holding our bloated, inept government bureaucracy accountable. Republicans must stand for conservative principles that lift people ..."},{"comment_id":"10154177421583734","commenter_b":"OK, toss in Jesus too, and all the Angles, and it still won't get him the Seat.","commenter_a":"He could have God running with him . He still has no shot at winning","post_message":"Do you think Fiorina was a good choice for Cruz?"},{"comment_id":"10152994999515326","commenter_b":"Screw you laurie. Are you a tea bagging bitch?","commenter_a":"Good man!","post_message":""},{"comment_id":"1134360159938174","commenter_b":"My comment here is in no way an attack on this guy. The reality is that he's working an entry level / minimum wage job so that's why he makes minimum-wage. I'm a disabled Marine Corps veteran myself and I spent four years in school so that I could earn enough money to support my family and give them a better life. For those that say that maybe he doesn't have the aptitude to go to college, there are trade schools out there that he would be more than qualified to go to. When fast food workers start making $15 an hour then entry-level welders need to be making $25 an hour and those that are currently making $25 an hour will then need to make $35 an hour and so on and so forth.","commenter_a":"This man risked all he had for this country, got wounded but continued to serve his country and now he gets $7.50/hour and cannot afford to support his family!!! :( While Mr. Cheney does not step his foot on the battlefield once, and his Halliburton makes nearly $40 billion dollars from the Iraq war!!!!!!!!!!!!!!!!!!!!!!!!! How can this country allow such extremely disproportionate treatment of its citizens???? I think the living wage is around $27 to $30 dollars/hour and that's what the veterans deserve....","post_message":"He fought in Iraq, but back home, he's struggling to get by. Fight for $15 advocates that everyone be paid a decent wage."},{"comment_id":"514850542008234","commenter_b":"Tyler, youz a lil bitch!","commenter_a":"Psshh* his Dad is a fucking Islamic nut, we all know what that kid was up to, this kid is PROOF how dog shit socialists insane the media is. What an embarrassing joke.","post_message":"“Wow. Just wow.”"},{"comment_id":"1111126252261565","commenter_b":"Bigger the caliber smaller the cock.","commenter_a":"Maybe she should just use the dildo then relax a little. Nothing wrong with open carry. All of these other campuses getting shot up didn't allow guns and that didn't work either.","post_message":"If this doesn't get people to pay attention to how ludicrous our gun laws are, I don't know what will. - Eric March"},{"comment_id":"1057253901026942","commenter_b":"and raising the min wage only cuts jobs, hrs, and closes busnesses","commenter_a":"We've seen this movie! And it doesn't end well for most Americans","post_message":"Research has found that massive tax breaks for the wealthy don’t trickle down into economic growth."}]
