[{"comment_id":"758826910928758","commenter_b":"Those fucking bastards.....we gotta gut em, then kill them, then gut em again, then smoke a blunt or two and plant a tree and then maybe spread their entrails on our enemies lawn so they get the message.","commenter_a":"There's obviously some sort of mysterious group of people who have been trying to hide the advantages of the hemp plant to prouduce many of our products for everyday use.","post_message":"The solution seems obvious, doesn't it?"},{"comment_id":"10154129546231545","commenter_b":"Romo a true gentleman and it took alot for him to do that, better to be up and walking than being in sever pain the rest of your life. Thank you for being a model for the younger players! A true Cowboy. ..","commenter_a":"Luckily, he has someone very close by to talk to about the benefits of being a backup QB on a Super Bowl quality team.","post_message":"Today wasn't easy for Tony Romo.  He's not the starting quarterback for the Dallas Cowboys anymore.  But he handled the situation with dignity:"},{"comment_id":"10153567353788984","commenter_b":"I will have one long after your ass is gone","commenter_a":"that just show the driver of the truck isn't paying attention what is going around his ride. That ass hole would be wearing salt rock in his britches","post_message":"I don't care what your opinion on the Confederate flag is, there's no denying that what this guy did is truly insane..."},{"comment_id":"1569576153350573","commenter_b":"Oh, and your fat head out of women's uterine issues!","commenter_a":"The goverment has no right to interfere in a very personal decision, hard enough without some men thinking they can decide for us.","post_message":"Don't doubt him for a second..."},{"comment_id":"1012675578755490","commenter_b":"Stupid women","commenter_a":"shut up skanks, cancel the p.o.s....","post_message":"Umm ACTUALLY it is in the Bible!"},{"comment_id":"783518591838718","commenter_b":"Hillary needs to change her tampon..","commenter_a":"Eat shit bitch","post_message":"Hillary Clinton Says ‘Christians Have To Change Their Beliefs’ Or Else… [VIDEO].  She is the one who should change her beliefs.  Do stand strong behind your faith?"},{"comment_id":"10154464695802994","commenter_b":"If it is against her religion for birth control, she shouldn't be having sex out of wedlock either then","commenter_a":"Babies are blessings and I'm sure she loves them. But it's probably time for some birth control. 3 kids at 20 is quite a bit, but 6 is a lot (seeing as if they weren't twins someone would have to start around 13 and have a baby every year so I'm sure it hasn't happened much)","post_message":"\"My regrets would be timing, but I'm really happy that I can even create babies or have life because some women can't do that,\" 20-year-old Danesha Couch said."}]
