[{"comment_id":"10155545705355725","commenter_b":"There should be charges against the lady too for leaving a dog in a hot car!","commenter_a":"hahaha!!!!!!!! I left my dog in my car once with the windows rolled up and a lady stopped and started yelling at me. I told her I'll turn off the a/c in a min..... I'll be right back.","post_message":"A man was arrested after smashing the window of a Mustang to free a dog left inside the hot car in a shopping center. He now faces charges ---> @webpagelink"},{"comment_id":"373546919515489","commenter_b":"She's retarded.","commenter_a":"I'm so sick of her BS, she needs to just plain go away and leave America alone.","post_message":"Pro-Gay, Pro-Abortion Nancy Pelosi Calls Marco Rubio a Bad Catholic"},{"comment_id":"1032286876827841","commenter_b":"Yes most LEGAL immigrants do but not the illegal invaders.","commenter_a":"Immigrants pay more taxes and work harder than SOME AMERICANS.... i know some","post_message":"Most Americans agree: We must provide a path to citizenship for our immigrant families."},{"comment_id":"1342427385796715","commenter_b":"Lock her up!","commenter_a":"How can people be voting for this woman I just don't understand we are doomed","post_message":"BOOM.... !! Judicial Watch comes out with a powerful STATEMENT.  @webpagelink"},{"comment_id":"10153236038721336","commenter_b":"See this is what I mean, we know this guy is a terrorist. He admits so on TV and trains other MUSLIMS the most effective ways to be a terrorist. Why is he allowed to walk the streets? We need a force not answerable to normal athority that can move in on MUSLIM terrorist like this without constraints and not having to watch them for 10 years then wait a week after they attack to make an arrest. Get the job done and move on to the next one.","commenter_a":"Why giving your air time to this evil, wicked man","post_message":"Imam Choudary: 'The United States of America are the champions of murdering innocent people!'  Muhammad contest organizer Pamela Geller: '[We're] the champions of freedom, sir!'"},{"comment_id":"10154692047301037","commenter_b":"Guess she can dress anyway she wants. Is that a big deal?????","commenter_a":"Hillary is on heroin!She wears long sleeves always even when its 95° out.And she fell out at the 9/11 memorial. And she'd have to be on heroin to put a U.S.Ambassador in a war zone with a couple of bodyguards. The last one he may have had some info that could get her convicted and that was a way to off him.","post_message":"“He has delusions—I’m not talking about being crazy, but for example when he told everybody he was very smart not to pay taxes, then denied he said it in front of a hundred million people.”"},{"comment_id":"10153005348800496","commenter_b":"So it's from not walking?","commenter_a":"Can someone explain to me how they grow like that? What about wild horses? Thanks.","post_message":"Disturbing: @webpagelink"}]
