[{"comment_id":"10154473671751234","commenter_b":"Take the names of all the restaurants employing illegal aliens, seize the records, heavily fine the businesses, and deport the illegals. Give the jobs to Americans- rumor has it, employment for AMERICANS is still suffering. And if you're an American who needs a job, but won't take one, no entitlements for you. There. I said it. Call it common sense.","commenter_a":"What are the party affiliations of the owners and bosses of @username?","post_message":"Some New Jersey restaurants are preparing for a strike on Thursday."},{"comment_id":"1497908770268866","commenter_b":"Alina is converted or living with muslims , check her page.","commenter_a":"A mother of 3, just 26 years old..... Makes me wonder about her story. Don't believe everything you read in the media. If she really got raped the men must be punished, simple as that. Shouldn't she have stayed at home with her children in the first place in stead of wandering the streets? And going out all by herself without a friend? Mmmm","post_message":"Raped by 'migrants from Iraq, Syria and Bahrain' after her drink was spiked"},{"comment_id":"1370953329605967","commenter_b":"She can start any day....","commenter_a":"@username maybe Jerry will do this to Eddie someday soon. 😐","post_message":"The only thing that can calm this grumpy toddler is her love for her baby sister: @webpagelink"},{"comment_id":"10153708234594199","commenter_b":"Then go. If they let you in. Otherwise.... You might end up an illegal alien. Ironic, eh?","commenter_a":"Canada looks better everyday.","post_message":""},{"comment_id":"817062668431422","commenter_b":"We are to political and afraid to hurt someones feelings to do anything... when Trump ginally takes the seat yall will see some change","commenter_a":"My tears go to all the fatalities. Rest in peace","post_message":"BREAKING NEWS: Berlin terror attack... At least 12 dead as truck ploughs into Christmas market Full story: @webpagelink"},{"comment_id":"10153189234471491","commenter_b":"I still want my coke 0. Gitty up !!!","commenter_a":"Hahaha! European countries welcoming muslim refugees beware! In a few years time......","post_message":"She filed a discrimination complaint."},{"comment_id":"1612302922163164","commenter_b":"No idiots!!!","commenter_a":"No. Sickening. Stop enabling these nuts.","post_message":"Should Germany allow child brides out of respect for Muslim culture?"}]
