[{"comment_id":"10155755235340725","commenter_b":"U mean I have to marry ur ass!? Ugh","commenter_a":"Patti McGough, let's meet at Daley center on tuesday.","post_message":"#BREAKING: Supreme Court rules all gay couples have a constitutional right to marry-----> @webpagelink"},{"comment_id":"1089143724523512","commenter_b":"Jenny Magnanelli I would pummel him.","commenter_a":"Travis Kieska","post_message":"A Texas mother wants everyone to stay aware when out shopping with your baby. A man walked up picked up her 14-month-old without permission. When confronted, the man never spoke to the mom, just addressed the baby, then left the store with no merchandise. #NBC5Now More: @webpagelink"},{"comment_id":"10154336399174342","commenter_b":"🤔 alright hoe😭😭","commenter_a":"@username @username Rest In Peace Damiyah","post_message":"Happy #NationalCatDay Don't be a scaredy-cat! Watch these purr-fect #kittens reenact horror films: @webpagelink"},{"comment_id":"10155769419940231","commenter_b":"My thought is this Ladies; the occurrences, that we are know seeing unfold are strategic! I hope that you will agree that the system has removed a majority of our \"Black\" men who would physically engage in battle with the injustices. They are being removed from society and that weakens us as a people. They are imprisoned for a greater length of time, killed in unlawful ways right in our faces (bullets in the back, strangled and held by more than one, ect...). A great majority of our women are now out and about alone and really can not defend themselves physically against the powers that be! In addition I see more \"Black\" women, more than ever going to be the next victims of murder. This leaves our children more venerable than ever before!","commenter_a":"It would of not been like that if a man was in the car with her!","post_message":"It may not be in the way that she thought she would, but she has, indeed, changed history."},{"comment_id":"10153003636601167","commenter_b":"Conspiracy--Huh,,,, Just MORE REPUBLICAN,,,LIES !!!!!------Why don\"t republicans want \" Regular Americans \" to have Obamacare ( ACA) ?????--HATE for the BLACK MAN, in the White House !!!!! Republicans,, STILL INSIST,,,,Racism Doesn\"t Exist ---YEA,,RIGHT !!!","commenter_a":"Not again \".,(;#!!:#$,:that Damn Obama. Lol","post_message":"LOL."},{"comment_id":"10153884149866130","commenter_b":"Its a joke you stupid bitches. Get over yaselfs.","commenter_a":"Ummm, kinda defeats the purpose of going out to the bar to get drunk if the bar is going to try and deter me from drinking. Wtf. Thats like my weed dealer explaining the importance of not smoking so I dont get cancer, smh. Dumb. Lol.","post_message":"One bar is getting patrons to think twice about drunk-driving by setting up a live-stream with a convicted felon."},{"comment_id":"10153166532823188","commenter_b":"Women voting for conservatives are the ultimate foolish morons...","commenter_a":"I am a conservative FIRST and there is NO other party to which I can relate...I pray for common sense and decency to prevail but I REFUSE to ALLOW a few bad apples to make me think there is no hope within this party!!","post_message":"It's too late to save it."}]
