[{"comment_id":"10153185005136323","commenter_b":"'@username how can you possibly call immigration colonisation? I am an immigrant to this country and I have no intention of imposing my way of life on every person living here or subjugating the 'indigenous' people of this land. I think I can speak for the vast majority of immigrants in saying that they also do not intend to do so. Most immigrants integrate into society. Perhaps you just don't like the way they look like. As was stated before, Britain is 85% white. All these people fearing that this country is swamped by brown and black people, Eastern Europeans and other pesky foreigners need to get their facts together. Moreover, study after study has proven that immigration is indeed beneficial to the British economy. We may also not forget that Britons emigrate to other countries in large numbers. This is not a one way street. Immigration is part of ...","commenter_a":"For a country whose language is a mix of old german, latin and celtic language, i'm laughing. In the past, Brits never had any issue with colonizing Australia our the US and imposing their culture (or 'civilization') to the native populations. That's so ironic !","post_message":"A quarter of Britons think the government should encourage immigrants and their families to leave. That's people like Mehdi Hasan. He argues that while hostility to outsiders may not be a new phenomenon, the so-called immigration debate is now toxically out of control. Anti-immigration sentiment isn't a result of increased immigration, but fear and prejudice  Meera Syal: Growing up between cultures is tough – until you realise it’s a creative blessing: @webpagelink"},{"comment_id":"10157050589675206","commenter_b":"Ok girl","commenter_a":"Nuts!","post_message":"“We are lucky that we have this son who loves Prophet Muhammad that much.”"},{"comment_id":"1781541005401492","commenter_b":"Praying","commenter_a":":(","post_message":"Live coverage from Eyewitness News: NJ Transit train crashed into the station at Hoboken Terminal.  More details: @webpagelink Photos: @webpagelink"},{"comment_id":"10152882647786234","commenter_b":"Hypocrite. ^^^ She let 4 Americans die. You dummy.","commenter_a":"Christie goin down. I always said he would.","post_message":"David Wildstein admitted to conspiring with others to 'punish' the Fort Lee mayor for not endorsing Governor Chris Christie in his re-election bid."},{"comment_id":"1173415112684267","commenter_b":"Society is being destroyed by this abomination! Gay lifestyle brought the AIDS virus, now innocent woman and children are dying because of promiscuity, bisexual acts, and gay relationships! Sin has deadly consequences that all in society pay the price for! That's why Rian!","commenter_a":"I agreed ban same sex marriages.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"594388797376563","commenter_b":"To all of you saying fair game and all that.... You are no better than the republicans that did it Michelle Obama, you should be ashamed of yourselves","commenter_a":"People of character do not talk negatively about someones' spouse nor kids. End of that discussion. With that said, I sincerely hope Carson never holds any public office at this stage of his life due to what appears to be his deteriorating mental faculties. He is running for president of my country so that is a legitimate comment of my concern of his abilities. This comment does not in any way extend to any members of his family.","post_message":"He's a candidate, so that means she is automatically in the spotlight - but do people really need to be so cruel?"},{"comment_id":"1160460537342680","commenter_b":"'@username God is with us; not the one @username's people created, but the One who created the rest of us.","commenter_a":"You could make this same argument against every single other country in the world as there is no country that didn't have slavery and there is no race on earth that was not enslaved at some point, I was never a slave nor did my ancestors own any slaves so my question is why in the hell would I owe any reparations? Please explain?","post_message":"U.N. experts believe that the U.S. owes a significant amount of reparations to African-Americans.   With ongoing police shootings, unsolved legacy of slavery and so much more do you believe the U.S. will pay reparations? DETAILS ——> @webpagelink"}]
