[{"comment_id":"1427245267295499","commenter_b":"Half a gallon of milk. $2.50, a box of cereal can be found for under $5 in your local hood supermarket lol come on people, don't be this stupid. Don't be the person who goes out for $7 cereal.","commenter_a":"If it comes with refills, I'm in!","post_message":"It better be a gr-r-reat bowl of cereal."},{"comment_id":"1421316697902078","commenter_b":"Then go away Monica!","commenter_a":"I think both ladies look great. Love the pink dress and wish I had the shape to wear the red one.","post_message":"LIVE VIDEO: Watch as various entertainers perform at the Inaugural Ball before the arrival of President Donald Trump. @webpagelink"},{"comment_id":"776943375772176","commenter_b":"Nope definitley not a lie lol, I was biologically born female.","commenter_a":"I'm a conservative on most issues, but I disagree big time on this one being a trans male as well (my original biological sex being female). You really want me to go in the women's room and make people there uncomfortable?","post_message":"Are you freaking kidding me..."},{"comment_id":"1990611657665239","commenter_b":"Another vile rapefugee","commenter_a":"death penalty anyone ?? #asktrump","post_message":"Horrifying."},{"comment_id":"10154400168208525","commenter_b":"Good grief, you ladies are in a panic. There is the morning-after pill for that kind of thing.","commenter_a":"Believe it or not, you don't have to get pregnant. It's a personal choice","post_message":"#BREAKING: President Donald Trump has signed an executive order withdrawing the U.S. from the Trans-Pacific Partnership deal, and has also placed a hiring freeze on some federal workers and cut off funding for international groups that perform abortions. MORE: @webpagelink"},{"comment_id":"10153367741477411","commenter_b":"Good. Disgusting woman","commenter_a":"I say she probably didn't know anything about it! My sisters ex husband was a cop and she knew nothing about the \"dirty deeds done dirt cheap\"!","post_message":"Fox Lake lieutenant Joe Gliniewicz's widow Melodie faces several conspiracy charges as well as charges on money laundering and the misuse of charitable funds."},{"comment_id":"10153363875728352","commenter_b":"We all need a break dumbass bitch but you don't see us throwing our kids out the car !!","commenter_a":"Yep she look like she need a BREAK!","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"}]
