[{"comment_id":"10153583578957144","commenter_b":"they were chanting,Bernie,Bernie...:)","commenter_a":"Ah @username... no mention of the STANDING OVATION for Bernie at the end of the debate? You guys are so blatantly transparent in your shilling for HRC","post_message":"\"I'm not even answering that question.\""},{"comment_id":"826344630889447","commenter_b":"We are sick and ;tierd of feeding these lazy women who just keep laying on their backs , letting free loaders get them Pregnant. We need to sterilize these women. We should pay to get them sterilized.","commenter_a":"Get a JOB, leeches.","post_message":"They are losing it. That's what happens when you mooch for your entire life.  Do you think this was a long time coming?"},{"comment_id":"10154006195498984","commenter_b":"The witches on the view can't understand normal thinking!","commenter_a":"Moron","post_message":"Ouch. It has to be embarrassing for Whoopi to get set straight in front of her own fans like that. She was no match for Rand Paul. After one of Whoopi's famous rants, Rand Paul pointed out exactly what is so ridiculous and silly about her argument.  Do you agree with Rand Paul?"},{"comment_id":"10152939626746636","commenter_b":"Would you please get that hamster out of there by you're in?","commenter_a":"Gonzalo Jara is disgusting and may be homosexual. He should be banned for life!","post_message":""},{"comment_id":"10155032769051757","commenter_b":"Great","commenter_a":"Excellent! I hope to see you do many more of Fox's interviews with President Trump. You deserve it. Thank you for always reporting the truth when others didn't.","post_message":"Question of the Day: What did you think of my interview with President Donald J. Trump?"},{"comment_id":"1234949299869862","commenter_b":"Really irritate me how she copies her speech","commenter_a":"Better to repeat the inteligent words of an inteligent woman, than stupid words of a stupid husband! Since an empty head isn't capable of producing words of her own!","post_message":"Listen to Melania Trump's speech last night vs. Michelle Obama's speech in 2008 @webpagelink"},{"comment_id":"906611306042877","commenter_b":"I think what most Americans are concerned about is that a lot of illegals want the same rights that we do. A lot of illegals work and send money back to Mexico and then asking for aid with our tax money. You are very welcome here....if you follow the immigration laws.","commenter_a":"Enough of the PC crap. There is no such thing as \"undocumented immigrant\". They are ILLEGAL. I know this has been said before, but calling an illegal alien an \"undocumented immigrant\" is like calling a drug dealer an \"undocumented pharmacist\".","post_message":"“This undocumented immigrant...wants to, as a sign of my humanity and yours, recognize you and say, ‘Can I give you a hug?’”"}]
