[{"comment_id":"1471521346221666","commenter_b":"@username I cannot in this day and age believe that someone as backwards uneducated,unread as you still exists. You know all that crap has been debunked yet you continue to stream it. I don't know if you are a troll or not but there is no brain matter in your skull.","commenter_a":"He is just a rich piece of trash. Money can buy you tons of stuff, but it cannot buy you decency, morals, health or happiness.","post_message":"It just keeps getting worse!"},{"comment_id":"1835608856683220","commenter_b":"What shut the fuck up","commenter_a":"Nazi Supremacy! Disgusting Asshats!","post_message":"The university stated that Richard Spencer's views are 'in direct conflict with our core values.'"},{"comment_id":"735565289967382","commenter_b":"Dear God, kick this ignorant African so hard he gets back to Africa. He needs English as a second language. Also needs to be taught to not make threats. What a POS. Go back to where you came from.","commenter_a":"This guy is a fanatic. He'd better be stop or someone s going to get Bharat namely, him","post_message":"Knife wielding Muslim attacks Trump, but watched what happens next. I bet he never expected this. Let's show him our support. Can we get 30,000 'LIKES' Donald Trump?"},{"comment_id":"1008713619198681","commenter_b":"She's a BAD example of a women !!!!","commenter_a":"Excellent ... +++","post_message":"Whoever you support in this election, it's important to mark historic firsts - and this is the first time that a woman from either party has won the Iowa caucus."},{"comment_id":"10154965744184641","commenter_b":"I would agree that would be a good reason to March however that March said absolutely nothing about this. As a matter of fact the lady running the March believes in Sharia law and in her belief system this is perfectly acceptable","commenter_a":"This why we march. This is not acceptable for ANY culture.","post_message":"When she was 12, she was sold into \"marriage\" with a 70-year-old man -- and there are hundreds like her."},{"comment_id":"578454362315144","commenter_b":"Jesus look at that horse mouth...damn that is one ugly woman","commenter_a":"I wonder if Chelsea knows the blood that comes with that Money?","post_message":"The hypocrisy is thick..."},{"comment_id":"10153687260803188","commenter_b":"He will make a great mayor of crazy town","commenter_a":"Glenn. Enough. We like Trump. We will figure this out . Let it be. Trump 2016.","post_message":"Oh, now I see why Donald Trump lashed out today.    He got bad coverage in the NYTimes and research on the conservative voting base.  I just thought it was a typical trump circus non sequitur.  I hadn't seen this story until now.  I feel sorry for him.   It just isn't going to end well for him.  Maybe I am wrong but I just don't think the American conservative likes the bully act.  Is everyone who disagrees with him:  fat, ugly, stupid, loser or failing?  It is amazing to see anyone not in the Obama White House with an \"enemies list\" this large.  Be fore he ran for president he was always a nice hotelier to me and my family.     I said four weeks ago that I did not want him on the show as the only thing to be gained was fifteen minutes of ratings and seeing that my ratings have never been higher nor have my commercial rates been higher, I didn't feel it was worth the trade of integrity.  He is welcome on many talk radio shows.  Not mine.  I will stick with Cruz, Carson, Fiorina, Santorium, Paul and tomorrow Bobby Jindal.  My audience rates Donald Trump consistently in tenth place in the race.   We have spend the last 16 years learning about progressives.  My audience is not fooled.  @webpagelink"}]
