[{"comment_id":"10152942568911636","commenter_b":"She has to Post some Nudes on the Internet for the People to Comment about Her Sexuality! :D","commenter_a":"I love yo voice","post_message":"Michelle Rodriguez praises Cara Delevigne"},{"comment_id":"1166718606737699","commenter_b":"Why?","commenter_a":"Anyone realize some veterans actually support Kaepernick. Also if you think this is the best country in the world you must be ignoring the debt, constant war, and division of society by ethnicity, race, sex, religion etc. that is plaguing this country. So if you think this country is not oppressive then you are wrong. If you think this country represents equality you are wrong. If you think this country represents democracy you are wrong. If you think this country represents the bourgeoisie elite and capitalist greed then you are right and that is why I won't support the flag not to disrespect the troops who died but to respect them because they died only for greed and American imperialism.","post_message":"Allen West Republic"},{"comment_id":"1730897643856292","commenter_b":"who cares she just a slut","commenter_a":"Yes by a long shot","post_message":"Scandalous Photos Of Donald Trump’s Wife Leak To The Public [SEE PHOTOS]. Regardless, she is 100x classier then Michelle Obama. Do you think Melania Trump would make a good first lady?"},{"comment_id":"1838786586350264","commenter_b":"This is a nothing story, women have been allowed to go topless in Canada since 1995. Grow up and get over the human body.","commenter_a":"Now this is a cause that I can put my hands up and support......Just kidding. I agree that if it's good for one gender, then it should be good for both genders.","post_message":"\"As long as men are allowed to be topless in public, women should have the same constitutional right.\""},{"comment_id":"1760125540941984","commenter_b":"They're far better than Hillary and her crooked minions! If she gets elected, we'll be under Sharia Law so fast your head will spin!","commenter_a":"Too funny - it just continues to be the funniest convention of all time - Hey, Christie a few months ago when you were running yourself - you decardedTrump unqualified to be President - too funny. All of these clowns: Christie; Gingrich; Pence and TRUMP are all an embarassment to the GOP party.","post_message":"Delegates at the Republican National Convention chant \"lock her up\" as Governor Chris Christie says \"I welcome the opportunity to hold Hillary Clinton accountable for her performance and her character.\" More: @webpagelink"},{"comment_id":"511047909019803","commenter_b":"Throw that racist bitch out the door!","commenter_a":"BLM, Black Panthers, Farrakhan -- any of those available? Why would you not use them since you hold them in high esteem?","post_message":"Beyonce bashed cops at the Super Bowl but is now asking for their help. They want her to find a way to protect herself."},{"comment_id":"1012314152218696","commenter_b":"Ungly Chelsea looks just like her father , Webster Hubble. What s slut that crooked Hillary!!!!!!!!","commenter_a":"Yes. Beauty & the beast think you can figure this out for yourself.","post_message":"Is turnabout FAIR play? This deserves about 25,000 'LIKES & SHARES'. Enjoy... @webpagelink"}]
