[{"comment_id":"607613792773547","commenter_b":"If this does not touch your heart nothing will amen","commenter_a":"Get that rotten PIG .","post_message":"FALLEN - NOT FORGOTTEN: The community is gathering for a vigil honoring two fallen heroes - Master Sgt. Debra Clayton of Orlando PD and Deputy Norm Lewis of the Orange County Sheriff's Office.  Meanwhile, the search for Markeith Lloyd continues: @webpagelink"},{"comment_id":"10154274654574641","commenter_b":"criminals together the murderer of the children in iraq","commenter_a":"We will meet at Hague. ...together with Rumsfeld and Cheney","post_message":"\"I will be with you, whatever\" -- Tony Blair to George W. Bush, 28 July 2002"},{"comment_id":"10152968850756519","commenter_b":"Affirmative action laws are in place. Maybe she could work to eliminate them all so that we all get a equal opportunity in education, employment and business instead of posing as a woman of color and cutting in front of EVERYONE ELSE in line..lol, Caitlin Jenner can cut in right behind her.","commenter_a":"1 Rachel Dolezal = appropriation/ race traitor and an abomination. 1 million \"Rachel Dolezals\" = 1 million \"less racist\" white people, who are fighting for the advancement of colored people. Weird to think about.","post_message":"Rachel Dolezal finally speaks: \"As you probably know by now, there are questions and assumptions swirling in national and global news...\""},{"comment_id":"10153666209640399","commenter_b":"Fire her!","commenter_a":"I've always liked Debbie, and had a lot of respect for her, but if this thing has legs, it could spell big trouble. There is enough dishonesty in Republican Ranks, we don't need any in Progressive Ranks. We all need to watch this carefully.","post_message":"Debbie Wasserman Schultz said the DNC needed to suspend access until they can be sure that the information hasn't been \"manipulated.\""},{"comment_id":"958471064269672","commenter_b":"BUT.... FOR ANY SMALL REASON SHE CAN GETS SHARIA LAW...... NO BAD TO TRY...!!!","commenter_a":"Lindsey! Remember no smoking no alcohol no pork prayer 5 times each day etc. However there will be more than enough sex and just think you will replace several goats! This will make you very popular with peta!!!!!😎","post_message":"Dear Lindsay: Pay particular attention to the anti-women bashing bits and ... then smoke a cigarette and meditate whether or not you really wanna to convert. @webpagelink"},{"comment_id":"1314229205273274","commenter_b":"Stupid, greedy women who don't respect themselves LOVE Trump. I mean, look at his wife.","commenter_a":"So they're trying to use looks to get people to vote for a man who half his party do not even like.","post_message":"People started freaking out when the hashtag #TrumpGirlsBreakTheInternet started trending Sunday night."},{"comment_id":"10154692887376336","commenter_b":"Deplorable Californian here","commenter_a":"Ga.here","post_message":"Live Now: Donald J. Trump speaks in Columbus, Ohio."}]
