[{"comment_id":"1541756345884108","commenter_b":"Needs to be castrated","commenter_a":"someone please castrate this idiot","post_message":"The 'abhorrent' paedophile has been jailed for just THREE years"},{"comment_id":"1769177686700867","commenter_b":"Move out of our country then bitch! I'm glad Mike didn't let you carry our flag you traitor!!!!!!!!","commenter_a":"If your ass don't like it here leave you jabroni ass clown","post_message":"Ibtihaj Muhammad - the first American Muslim to compete in the Olympics wearing a hijab - just went on a disgusting rant about how much she hates the United States. This is SICK..."},{"comment_id":"865498240307419","commenter_b":"She does this for money . She is a witch like her Mom","commenter_a":"I do feel sympathy for Chelsea. She is truly a victim of the unlucky sperm club. She has to defend two people who are seriously flawed while trying to raise her own family. Their lecherous and unlawful behavior are certainly not her fault.","post_message":"Chelsea tried to challenge her, immediately regrets that decision. This woman was forcefully raped by Bill, let's show her some support for god sakes. Can we get 10,000 'LIKES' for her Bravery?"},{"comment_id":"10153750337633812","commenter_b":"Trayvon martin attacked Zimmer . Tired of the lies , zimmer lived in that neighborhood and had the same rights to walk as trayvon . Zimner's head veing slamned into the ground doesnt matter plus your ignorant white comment shows you don't know the facts . Zimmer is latino , black and white so stick your white privilege lie up your backside where your head is already stuck .","commenter_a":"A man who killed a lion is in hiding but the man who killed trayvon Martin is walking free?? Ohhh to be white in America","post_message":"Walter Palmer, the hunter tied to Cecil the lion killing, headed back to work: abcn.ws/1K0cdrW"},{"comment_id":"1390020544359635","commenter_b":"I would turn the hose on her and spray that STD filled flea bag off my property","commenter_a":"please knock on my door. we have lots of property and a back hoe","post_message":"I would rather ___________ than have Miley Cyrus knock on my door."},{"comment_id":"1076817779005244","commenter_b":"We'd have a beautiful First Lady!","commenter_a":"Don't want her or him","post_message":"If Melania Trump succeeds Michelle Obama as First Lady, she may trace her road to the White House back to 1987 and a chance encounter in the capital of her native Slovenia. Find out more about Melania: @webpagelink"},{"comment_id":"10153246663015950","commenter_b":"Only in America . Keep the girl scouts all girls and leave the boys alone . If the girls want to do the same stuff as the boys do then create your own stuff for girls only .","commenter_a":"Boy Scouts are so much more organized with better opportunities, I don't blame them one bit! As an adult involved in both, I'd much prefer to be a Boy Scout! Girl Scouts of America need to get their crap together.","post_message":"A group of girls decided they were more interested in what the boys were doing. So, they quit Girl Scouts and started participating in activities alongside a local Boy Scout troop. Now they're fighting to prove they can do the same things boys can."}]
