[{"comment_id":"919963074724525","commenter_b":"It's not burning fast enough.hope they got all there goats out.would be a shame to lose what use to be there virgins","commenter_a":"probably after insurance so they can buy more guns???????????","post_message":"Taking bets...accident or on purpose? Was this an 'act of God'? What do you think?"},{"comment_id":"1283819971638030","commenter_b":"She's a disgusting wombat","commenter_a":"Looks like big bird. We paid over 2 grand for that dress?","post_message":"The Narciso Rodriguez dress sold out online before the president had even finished speaking."},{"comment_id":"10153007103196336","commenter_b":"Yes, teachers do hve input as to curriculum. No teacher nor educator has the right to instill their political views on to their students.","commenter_a":"These teachers need to be replaced if they are inserting their political views in the classroom and have only One answer which the see as correct whether it is correct or not! This is MY opinion! This does Not need to be taught in school anymore than religion! Go argue on someone elses opinion if you don't like mine. I will Not be called ignorant by anyone!","post_message":"“The Democrat is building. The Republican is destroying.”  According to an 8th-grade teacher in Wisconsin, this was the correct answer for a social studies assignment on immigration policy."},{"comment_id":"1074652632613170","commenter_b":"SURE, CLINTON LIES EVERY TIME SHE OPENS HER MOUTH !","commenter_a":"She needs a nose job.","post_message":"RINO Sen. Susan Collins is a ________________."},{"comment_id":"895114997196955","commenter_b":"Your mother is a rat","commenter_a":"for press tv and iran the houthi rebels who tried to overthrow the govt are not terrorists. Instead the forces fighting houthi rats are terrorists. and iran claims to be a democracy. wtf","post_message":"Saudi warplanes airdrop weapons to militants in #Yemen  Read more: @webpagelink"},{"comment_id":"1402706749758182","commenter_b":"Awesome Donna! Way to #GrabEmByThePussy !","commenter_a":"No to Any replacement for Trump! No to Pence!! He could Never beat Hillary. Remember almost 1/2 of America did not even know who Mike Pence was a week ago and the V debate had poor ratings. 40 percent of America wull stay home on election day.","post_message":"Sen. Johnson kicked off Manufacturing Month with a special video message to students touring Pewaukee manufacturer TLX Technologies during their open house. Hundreds of students visited the business throughout the day to learn about careers in manufacturing."},{"comment_id":"10153706069823717","commenter_b":"Best part about this is her age, she's not an 18 or 20 year old like most ad models.","commenter_a":"Oh thank heavens. The world is a safer place.","post_message":"People magazine has named Jennifer Aniston the 'World's Most Beautiful Woman' for 2016."}]
