[{"comment_id":"10153396181678908","commenter_b":"Good morning through Facebbok","commenter_a":"Beth Bethy Lockwood","post_message":" are confirming the health benefits of meat-free eating. Nowadays, plant-based eating is recognized as not only nutritionally sufficient but also as a way to reduce the risk for many chronic illnesses. Harvard Medical School"},{"comment_id":"10153029967097014","commenter_b":"She's a weirdo","commenter_a":"Amy Lunsford JUST DO IT","post_message":"At first glance, the text messages appear to show a disturbing case of cyberbullying: one teen urging another to kill himself. But this was no bully. They were from a 17-year-old girl to her boyfriend, whom she called the love of her life. \"You can't think about it. You just have to do it. You said you were gonna do it. Like I don't get why you aren't\""},{"comment_id":"10155070762506037","commenter_b":"But the person doing the watching had intentions maybe","commenter_a":"Something sounds like she wondered off but someone had been watching her.","post_message":""},{"comment_id":"10153134555889753","commenter_b":"They should lock her down before she kills some one.","commenter_a":"Yes! This was a full on assault! When there is a minor present it is a felony. She should be tried to the fullest extent of the law!","post_message":"Do you think this teen should be tried as an adult?"},{"comment_id":"10155083980414203","commenter_b":"April BABIES have NO REALITY according to YOU! THAT IS WHAT IS CRAZY. I don't listen to insane lunatics April.","commenter_a":"Thank you Pence for deciding what women can do with their bodies. When the time comes, if it hasn't already, that you need Viagra or any other penile disfunction medication or treatment, we will decide if you can get your dick pills or not. Oh and, fuck you Pence!!","post_message":"Today was a Mike Pence crowd."},{"comment_id":"1744978035715181","commenter_b":"Me too. She was sweet. I guess that's why she bit it.","commenter_a":"Kim, I thought you would appreciate this.","post_message":"AMC's the Walking Dead may soon be stumbling its way out of Georgia if the state's anti-LGBT bill is passed."},{"comment_id":"10153889238948984","commenter_b":"Send them BACK to Syria!","commenter_a":"Go back....","post_message":"You would think that Syrian \"refugees\" wouldn't be able to make many demands of their host nations. However, they have -- and some of them are completely RIDICULOUS. This should put the lie to the myth that these migrants are only coming to the West to escape persecution... and this is what Obama wants to import HERE?"}]
