[{"comment_id":"10154509463236162","commenter_b":"Same Jen same","commenter_a":"@username... worried for @username","post_message":"HOT DOG RECALL: Put down the hot dogs!   372,000 pounds of hot dogs and corn dogs are being recalled over concerns of listeria contamination.  Bar-S Foods is recalling five chicken and pork products.   The recalled items include Bar-S bun-length and classic franks made with chicken and pork, Bar-S classic corn dogs and Signature Pick 5 corn dogs."},{"comment_id":"10154188943324255","commenter_b":"How is it that these backwoods fucktards are so hopped up about the rights of fetuses, but when that fetus grows up and needs public assistance, they think it's a loser and a piece of shit? Idiots. I guess this is what happens when you fuck your sister.","commenter_a":"yeah lets legislate morality. Like that ever works. Like some others have said, forget getting any of my tourist dollars.","post_message":"All these new restrictions will not make abortions go away. But they will kill women."},{"comment_id":"651012365080931","commenter_b":"The most Corrupt Woman in the world","commenter_a":"SEE YOU IN PRISON SOON HILLARY = JAIL TIME FOR #YOU !!","post_message":"La decisión que tomemos en cuatro días tendrá un efecto en nuestro país por décadas. hillaryclinton.com/planparavotar  Comparte esto si estás de acuerdo:"},{"comment_id":"10153069048676770","commenter_b":"Both are bitchs","commenter_a":"I see that Meryl has picked her poison.","post_message":"\"How can people like Meryl Streep and Hillary Clinton envision themselves as rebels when they are the establishment?\""},{"comment_id":"10153011055951336","commenter_b":"He is against us having freedom from OPEC !! We could be self contained and let the Muslims go to being dependent on us !! If no one byes oil from them they are through! OB knows this, that's why he vetoed pipeline 👿","commenter_a":"Job killer.","post_message":"Breaking News: President Barack Obama has vetoed the Keystone XL pipeline bill."},{"comment_id":"1147635848590103","commenter_b":"that evil woman will cause alot more problems for america","commenter_a":"HAHA!!","post_message":"North Korea has backed presumptive U.S. Republican nominee Donald Trump, with a propaganda website praising him as \"a prescient presidential candidate\" who can liberate Americans living under daily fear of nuclear attack by the North."},{"comment_id":"2049822328577410","commenter_b":"@username Mexican rapists.","commenter_a":"My question is, why is the inauguration not being cancelled until all of this has been investigated and charges brought together? Why is nothing being done?","post_message":"\"Either Donald J. Trump and friends have engaged in treasonous acts or America’s intelligence officials are guilty of a colossal lapse in judgment — or worse, a conspiracy against Trump. Either way — whether any of these allegations are true or false — the entire matter must be investigated thoroughly and immediately.\" - Bill Moyers and Michael Winship"}]
