[{"comment_id":"10153542319922629","commenter_b":"Do you job or get the hell out of the way. She should have been fired weeks ago when she first refused to do the job she is being paid to do.","commenter_a":"a woman that has been married 3 times is turning down marriage licenses... go figure","post_message":"Citing religious beliefs (as opposed to, say, deep-seated, bigoted hangups), the county clerk refuses to treat gay people as equal to straight people."},{"comment_id":"10153853111962217","commenter_b":"Well done Team GB proud to be British and the achievements of our wee islands athletes.","commenter_a":"US is winning the olympics. That's good. I heard who ever wins the olympics has home field advantage during the next world war.","post_message":"Good job Team GB 👏🇬🇧"},{"comment_id":"10152629454892894","commenter_b":"She mad @username don't believe that hoe","commenter_a":"Aliah Tamartian Trainer Toi Magee-Taylor","post_message":"Coupled Up? Keke Palmer & August Alsina are Ridin' Around & Gettin' It [Photos]"},{"comment_id":"10153396676558837","commenter_b":"What cracker dnt steal money there all crooks","commenter_a":"At Least in sweet water PD This is standard procedure","post_message":"OFFICER ARRESTED: Detective Armando Socarras, a 10-year veteran, was accused of taking $1,300 in drug money."},{"comment_id":"1060076290679393","commenter_b":"I believe you! Just saying IMF found some crazy monetary practices. Matching 8% would create a crazily unsustainable and unattainable and unrealistic economic goal. We had our state government promise such riches for a 20 year period to public employees and it's not a practice followed and linger because we have had to fund that same crazy generosity despite economic ups and downs. This created alot of resentment as courts say we must continue to fund these government employees who gave themselves this great pension!","commenter_a":"This is just like Greece, nepotism, expensive payrolls and pensions created to benefit a few individuals and their families while real public needs are neglected...this is the opposite of socialism @username","post_message":"The budget crisis faced by Illinois is dire - the state government itself is drowning in $37 billion of debt. Read more: @webpagelink via Special Reports"},{"comment_id":"1199347126788647","commenter_b":"We have to get these people out of here why pay for illegals school when we can't afford school for American kids","commenter_a":"When people have had enough then this will be brought to a stop not until, they think they are entitled to everything free and then they will take your job, then you'll be on welfare without a means to support yourself!","post_message":"What?!?!"},{"comment_id":"10154994151726800","commenter_b":"Thinking of spending time at home. On the Galapagos islands with the other tortoises.","commenter_a":"@username dudes face says it ALL!!","post_message":"#LifesAMitch"}]
