[{"comment_id":"10153588391460667","commenter_b":"@username: you basically need a nice warm cup of shut the hell up.","commenter_a":"Don't feel sorry about those ... These soliders maybe killed 300 kids and 300 from elderly people in Palestine , but we say Islam say don't kill innocents people even from your enemy ...","post_message":"\"Terror will not silence us, we will return to work tomorrow,\" Tel Aviv Mayor Ron Huldai said."},{"comment_id":"467385036785410","commenter_b":"Bitch shut the fuck up and close your dam legs and get a job Iike everyone else does","commenter_a":"No. I worked for more than 30 years before making $15.00 an hour.","post_message":"Should Blacks Be Compensated For Slavery? Comment 'yes' or 'no'."},{"comment_id":"390922764595794","commenter_b":"Amen","commenter_a":"Amen","post_message":""},{"comment_id":"459523527541329","commenter_b":"Because so many criminals in this country. That's why I'm so confused why so many foreigners want to come here and live. Just stay in your own country and make it better there.","commenter_a":"Drugs and drug dealing. No good role models. Role models that are drug dealers ,pimps and prostitutes. Ex. Jay zeee. Beyonce, barrack oboma. All thugs. That promote drug use and degrade women.","post_message":"The U.S. incarcerates more people than any other country in the world. One in three African-American males born today are expected to go to jail or prison at some point in their lives."},{"comment_id":"10153816577949160","commenter_b":"You believed that nonsense? Sue glad Donald never cheated at anything.","commenter_a":"When can we not have to listen to lying cheating Teds shrill voice cry over everything. Ted cheated on his wife then lied about it.","post_message":"Donald J. Trump just won Indiana. Here's what that means. READ MORE: @webpagelink"},{"comment_id":"614554242047139","commenter_b":"And Bill's a natural player , what a fraud the Clintons are .","commenter_a":"ring a ding, a ding ding, blow it out his smarmy lying blowhole!","post_message":"\"She's a natural leader, she's a good organizer, and she's the best darn change-maker I ever met in my entire life.\" President Bill Clinton said Hillary Clinton is \"worth every single year she's put into making people's lives better.\""},{"comment_id":"1192108440886151","commenter_b":"He is going to be a great president","commenter_a":"He is the uneducated and ignorants president which apparently there is a lot of!","post_message":"WATCH LIVE: President-elect Donald J. Trump makes a statement from Mar-A-Lago estate"}]
