[{"comment_id":"1742230942710926","commenter_b":"Hillary can't speak without a Telepropter... She has no clue what tk say. Her speech pattern, body language, facial expression..etc. fake","commenter_a":"There is such a HUGE difference in the way Hillary speaks up to Americans and the way Trump talks down to Americans!!!! I am excited to see her win this!!","post_message":"History made. hrc.io/1YesHYS"},{"comment_id":"10153035820806770","commenter_b":"she can't even lead her servants...","commenter_a":"now she wants to bring in people to vote for her......","post_message":"Democratic presidential candidate Hillary Clinton told “Face the Nation” host John Dickerson Sunday that she hopes the United States will “lead the world” and take in 65,000 Syrian refugees over the next year."},{"comment_id":"10154263187613984","commenter_b":"If Hillary were to win, she and Bill would never let Megan Kelly out of the White House!","commenter_a":"I think the Hildabeast has an eye for Megyn Kelly. Watch out Megyn, being too close to this one may lead to stupid. Be careful.","post_message":"During a recent interview, Hillary Clinton revealed her true thoughts about Megyn Kelly. No one expected what she was about to say..."},{"comment_id":"133746713872563","commenter_b":"Burn in Hell scumbag","commenter_a":"You mad!!!!!","post_message":"JUST WATCH: Here's a snippet from the sentencing of Michael Morgan, the man convicted of killing two children in a house fire. @webpagelink  What do you think?"},{"comment_id":"937882449580510","commenter_b":"Can't stand her","commenter_a":"No no! Remember the first amendment? She was and is free to ask anything of anybody. Man up everyone. Hopefully this will stay a free country.","post_message":"Uh oh..."},{"comment_id":"1720347271558389","commenter_b":"What a pathetic slut !!!!!!!","commenter_a":"Just another Wacko;showing her ignorance.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153238053014586","commenter_b":"plants are living things too... so eat sand... all human should eat sand.","commenter_a":"literally feel sick watching this how can people still let this happen? disgusting","post_message":"Can you imagine having that huge metal tube shoved down your throat?!   This is just 60 seconds of how #FoieGras ducks spend THEIR ENTIRE LIVES.   They sound so terrified. :("}]
