[{"comment_id":"1061814317192373","commenter_b":"Also...let's not forget...Obama is to blame for your mama giving birth to a shit head like you....you should have been aborted","commenter_a":"Another Jack A**** heard from","post_message":"Frequent Fox News guest Jesse Lee Peterson says that Obama is to blame for the South Carolina mass shooting at a black church because he insists on pointing out that racism is a problem in America."},{"comment_id":"1038011639567708","commenter_b":"Hell no, look at her go though Kalen would move","commenter_a":"Wtf imagine if this was kalen lol @username","post_message":"At 6 months and 27 days old, little girl breaks the record for the youngest person to ever water ski. @webpagelink"},{"comment_id":"10153212648798690","commenter_b":"West & their illegal wars do. Racist Christine","commenter_a":"Dont go to Australia and the likes. There are a lot of other muslim friendly countries.","post_message":"\"The prime minister of Australia acted to firmly entrench in the national psyche not only that Australian Muslims are not to be trusted, but that Islam and Muslims are complicit in the 'death-cult' ISIL.\"  @webpagelink"},{"comment_id":"957903450911743","commenter_b":"Muslims are still using the jiihad to increase their power and stupid European leaders are letting it happen.","commenter_a":"LanceBell fox loves you","post_message":"Spread this everywhere:"},{"comment_id":"1137500072976406","commenter_b":"I agree she's a snobby cow that needs to learn a lesson and go inside but prisons are full","commenter_a":"Yet another classic case of women and their double standards...if a man had stabbed a woman, there'd be out with the pitchforks and torches baying for his blood...","post_message":"Woman who stabbed a man in the eye with her stiletto walks FREE from court"},{"comment_id":"10153319556628352","commenter_b":"She's got meth face.","commenter_a":"Fuck y r sum moms like dat not fair for children they deserve better","post_message":"Mother arrested for child neglect after her young daughters traveled barefoot trying to sell their toys door to door as she slept"},{"comment_id":"928454370547645","commenter_b":"Because only girls can get raped","commenter_a":"I am so glad that I don't have a daughter. I'd be terrified for her in this world we live in. Heartbreaking.","post_message":"'The most disgusting, sickening' gang rape at Spring Break beach party"}]
