[{"comment_id":"1188867387819383","commenter_b":"how about just stopping illegal immigration which brought it here in the first place","commenter_a":"Running a high powered fan inside, facing your entry door might help as you come in and out and might help them from entering your home and any that might be clinging to you!","post_message":"ZIKA is FOR REAL and it hits more than just PREGNANT LADIES @webpagelink"},{"comment_id":"1832453327028289","commenter_b":"Always thought she is trash and this proves it.","commenter_a":"Arrest her","post_message":"Ever the provocateur, Madonna dropped a trio of f-bombs and admitted that she's \"thought an awful lot about blowing up the White House\" during a speech at the Women's March on Washington on Saturday."},{"comment_id":"10155012522801944","commenter_b":"It's now about money Obama laid out a lot of this deportation and Trump has to bite the bullet. Now back to money. Only ones going to make money on the deportation of illegals are LAWYERS. Lose. Lose situation for the illegals. Serves them right? Our forefathers and mothers came in legally Any questions ?","commenter_a":"Id like to see 365 days without illegal immigrants. enforce the law deport illegals.","post_message":"Serves 'em right."},{"comment_id":"10153105313784203","commenter_b":"Speaking of Obama not attending a rally in France, how about Bush, Cheney, and other Conservatives not attending the 9/11 memorial in their own country @webpagelink","commenter_a":"Unlike the communists digging up Kathy Griffin and Margaret Cho, Jay is actually funny.","post_message":"Why the hell do Republicans love Jay Leno so much?"},{"comment_id":"10154147730689071","commenter_b":"Lol you need help lady","commenter_a":"Good job trump. Keep up the good work. We need to be making more friends. Even if the liberals wanted to go to war with Russia led by Hillary. It's time for a new chapter in diplomacy.","post_message":"\"To be honest with you, the waters here seem like a little bit of a tempest in a teapot. I mean, it's striking to me that President Obama would reach out to a murdering dictator in Cuba and be hailed as a hero...\""},{"comment_id":"10155998790520294","commenter_b":"No!!! I'll pass on swimming in everyone's pee and who knows what else lol. Germ infestation!","commenter_a":"I want to do this","post_message":"Would you take a ride on this 800 foot water slide? A few thousand people in Akron are!"},{"comment_id":"10154444403041337","commenter_b":"Yeah IF you were, possibly. But you're not. You're just a shit talking bitch who hides on FB and acts tough. Again, you impress no one. Go fuck yourself.","commenter_a":"Everyone on here that's against Chris kyle show some respect I come from a marine family and by God if they heard the negativity about this legend a urban war would uprise show some respect ppl","post_message":"CHANGING HISTORY? American Sniper Chris Kyle's record has officially been changed..."}]
