[{"comment_id":"10153948445168812","commenter_b":"you gonna adopt it?","commenter_a":"And for Christmas the pup should be freed from its current owners and gifted to a loving home.","post_message":"A pup from Hardin County, Iowa, got a sweet surprise this Thanksgiving when she was gifted a brand new dog house after living outside for almost three years."},{"comment_id":"10153646092561167","commenter_b":"Liberals hate women!!!","commenter_a":"If Megyn Kelly didn't have her looks and her little fued with the Donald to capitalize on she'd be a non issue.","post_message":"Can everyone finally stop pretending Megyn Kelly is any kind of “hard-hitting journalist”?"},{"comment_id":"10154075665287377","commenter_b":"Denounce your US Citizenship,,proclaim illegal alien status anf receive FREE Medical from the Government!!!!","commenter_a":"Can't repeal it fast enough for me! My own insurance costs went up 700 bucks once Obamacare kicked in. Seems I'm paying for some family that can't afford their own insurance. Well... I can't afford their insurance either!","post_message":"Sen. Rand Paul slammed the Affordable Care Act, also known as Obamacare, saying Congress will, \"as its first course of action, vote to repeal Obamacare. It cannot happen soon enough.\""},{"comment_id":"10153500482753598","commenter_b":"nothing that comes out of this woman's mouth is ever true!!!!!","commenter_a":"She is an idiot..","post_message":"Hillary Clinton Claims “All of Us Want to Fund Planned Parenthood”"},{"comment_id":"10152765716636028","commenter_b":"What an effen B-tch I see why he cheated on her weird @$$","commenter_a":".","post_message":"\"That's what you get for cheating on me,\" said a woman who allegedly lured her ex to a drug house where a group of men robbed him at gunpoint, according to a judge. @webpagelink"},{"comment_id":"10155647671150354","commenter_b":"She is a racist and a total disgrace!!! She encouraged the thugs to destroy Baltimore; what a LUNATIC!!!","commenter_a":"She also believe that is disrespectful to ask a Liberal a real question and expect it answered with out making a quote that your question is disrespectful to there position. Attention Liberal Politicians: every aspect of your your public life, how you act, what you say and your political views are all fair game in the management of the public safety.","post_message":"What do you think? Was the reporter being rude?"},{"comment_id":"10156090164245354","commenter_b":"She not a little fat she a Big FatASS just saying.","commenter_a":"maybe she deserves execution,someone must think she has creepy perv eyes,and she,s fat","post_message":"Here's what we're dealing with, folks…"}]
