[{"comment_id":"990898310953409","commenter_b":"\"Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you\"","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas. @webpagelink"},{"comment_id":"965586620162170","commenter_b":"Scumbag","commenter_a":"....too many \"GUNS\" on the street....and who is holding these guns????? The criminals, thugs, refugees, muslims, and other monsters that are given free reign and encouragement to commit these crimes against innocent citizens! Another elected official with his head up the governments butt!","post_message":"BREAKING…CAUGHT ON TAPE: 30 Yr Old MUSLIM MAN Ambushes, Shoots Philadelphia Cop Several Times “I’m shot. I’m bleeding heavily!” Muslim shooter says he did it \"In the name of Islam\" When Obama's War On Cops and Islamic Terror collide...."},{"comment_id":"1415750351836830","commenter_b":"She was with the head writer of SNL and the woman who plays her on SNL skits. They All suck!!!","commenter_a":"id bet they were laughing at each other because they couldn't decide who was SKANKIEST.....","post_message":"Hillary raised a lot of eyebrows with her dinner guest..."},{"comment_id":"1686987451566043","commenter_b":"@username -- A woman who gets raped didn't choose to have that sex.","commenter_a":"Isn't it great that we have the Government to make decisions about what women can and cannot do with their bodies? I'm so glad we have old, white men who can control our woman parts for us.","post_message":"Indiana Governor Mike Pence signed a bill that bars women from seeking an abortion because the child will be born with a disability, a controversial restriction that is one of the tightest abortion laws in the country."},{"comment_id":"1155452914533533","commenter_b":"She has blood in her hands #garyjohnson President 2016","commenter_a":"Hilary Clinton my president of America, I'm so Happy for and all the women's should be able to learn from her. My president Clinton is very professional and smart. Sorry! Trumper's but it's time to be in the top line. \"With great people, we move forward to another level\"","post_message":"Michelle Obama on Donald J. Trump: \"...that's why he demeans and humiliates women as if we're objects meant solely for pleasure and entertainment.\" @webpagelink"},{"comment_id":"1178341715558004","commenter_b":"LOCK HER UP!","commenter_a":"You hate hillary (so do i) but you pick a man that can't beat hillary.. we've got big problems come election time.","post_message":"Donald J. Trump, Sen. Joni Ernst, and others campaign in Iowa at the Iowa senator's second annual Roast and Ride."},{"comment_id":"1124947717560231","commenter_b":"Hurry up woman!!","commenter_a":"Alright, that's it...we're moving to Colorado. @username","post_message":"It is absurd that here in America, we remain the only major country on earth not to guarantee health care to all people. If this proposal for universal health care can win in Colorado, I believe it will spread around the country."}]
