[{"comment_id":"10153315079826680","commenter_b":"Women are voting for her because she's the most qualified and she's been speaking up for us her whole political career. Not because we're shamed or bullied into it.#Imwithher","commenter_a":"And join her in hell","post_message":"POLITICO's Roger Simon says: It's a strange world when women are being shamed into voting for Clinton."},{"comment_id":"1107644279295319","commenter_b":"I don't agree and what she did is wrong. But Trump can suggesting banning all Muslims from the USA and get away with it?","commenter_a":"Strange but when these muslims say and do the same things..Nothing happens....WHY...","post_message":"The devout Christian has been ordered to do community service"},{"comment_id":"927473010672643","commenter_b":"@username this has made my day!! When are you and Rene coming to visit I miss you guys!!!!","commenter_a":"Eyes bigger than stomach? 😜","post_message":"That's the most metal thing I ever heard. \\\\m/"},{"comment_id":"1215472705166021","commenter_b":"No, slutty women are.","commenter_a":"I wonder how many these so called rape or incest abortions our taxes go to are really that or women lying. I'm sure planned slaughterhood and other abortion providers don't perform parternity tests.","post_message":"Like and Share if you agree!"},{"comment_id":"10152554042082623","commenter_b":"Girl bye lol","commenter_a":"It looks like a H.I.M. sticker lol also the pentagram/pentacle is an ancient symbol that represents the great spirit, and the elements air fire earth and water...upside down means nothing as there is no Satan and no Jesus. .... someone needs to read something OTHER THAN THE BIBLE HAHAHA","post_message":"A woman says she snapped a picture as soon as she spotted what she says is a symbol of evil in these school bus brake lights."},{"comment_id":"884264261619642","commenter_b":"Crazy crazy high price. Very sad .... 😡","commenter_a":"Yes and not to mention that you hear I want this I want that I want want seriously it use to be a different meaning to go to Disney now it has gone commercial stop going and they will start decreasing prices ....bottom line","post_message":"The price of a ticket to Walt Disney World just got more expensive. Here's what one day trip will now cost you. @webpagelink"},{"comment_id":"10153294741338984","commenter_b":"California idiots are the cause of the decline of morals! Create a safe haven for idiots called Cali weirdness!","commenter_a":"Everyone knows that Parker","post_message":"DEVASTATING! In his own words, Obama proves time and again he's a calculating liar. Will you join millions of other Americans in demanding Obama be impeached?"}]
