[{"comment_id":"10154071992886770","commenter_b":"Clinton, Bushes, Obama took away citizen's rights. They betrayed our nation. The USA was hated while they were in office. We are better off turning our backs on these traitors and marching forward in the right direction.","commenter_a":"Thank you, you have more class than some of the others.","post_message":"Both Bushes, Jimmy Carter and Bill Clinton all attended Barack Obama's inauguration in 2009."},{"comment_id":"1125682197501441","commenter_b":"I hope so, I heard today we have the most immigrants in the USA!!! I'm furious!!!","commenter_a":"I'm not happy with Michigan!!!!","post_message":"Team Hillary is full freak out mode...needs massive knockout punch in tonight's Debate of the Century to stop Trump momentum..."},{"comment_id":"1075906369172131","commenter_b":"These people ARE violent CRIMINALS!","commenter_a":"You're crazy sue","post_message":"WATCH: Protests in Charlotte, North Carolina after a man was shot, killed by an officer in the University City section. [WARNING: This live video is RAW and UNEDITED. Viewer discretion is advised.] Read more: @webpagelink"},{"comment_id":"1034492959948582","commenter_b":"Strike one for Bernie. This has been well refuted many times over. Besides the feminists will vote for Hillary only for the fact she is a woman.","commenter_a":"All you brogressives claiming the wage gap doesn't exist don't deserve to have Bernie as your president.","post_message":"Women are making 79 cents on the dollar compared to men. For women of color it's even worse. African American women earn just 63 cents for every dollar a white male earns, while the figure for Hispanic women is just 54 cents. That's nothing but sexism and discrimination."},{"comment_id":"480556725471124","commenter_b":"She is right! Lock up Hillary.","commenter_a":"She is right, absolutely. This corrupt two system set up by Republican party for a long time ago, specially in G.W. Bush's administration. Now finally, some one found a guts to talk about it. We need more of these speech to bring the truth and fact to American and Washington. Shame, shame.............and shame. Viva and thanks to Democrats for bringing a truth in this matter.","post_message":"YES! This morning, Sen. Warren gave Republicans an EPIC smackdown as they voted for a Koch-sponsored bill to make it harder to prosecute financial criminals. \"There are two legal systems in America; one of the rich and powerful, and one for everyone else.\" \"Billionaire Republican donors Charles and David Koch have been pushing for the corporate crime relief amendment\" according the the Huffington Post. UGH! Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"778166008983598","commenter_b":"Huge wall!","commenter_a":"Obama is the racist pos","post_message":"“Has anybody tried that wine? How good can that wine be?” President Obama poked fun at Donald J. Trump and the GOP at a fundraiser in Texas."},{"comment_id":"10154400820486051","commenter_b":"@username Suck it up Buttercup, it's the middle class that pays the taxes that all you losers live on. President Trump has done more, so far than Obama has done in 8 years. Oh I forgot he (BHO) has flooded America with illegals that are: murderers, rapist and child molestersl. The best thing that can happen for the USA is the Big One hit and take California with it.","commenter_a":"Rock on Rosie! Trump is scum! All these despicable people supporting him would make america great again by leaving. They are what is wrong with our country.","post_message":"Rosie O'Donnell just made a very controversial accusation against Donald Trump."}]
