[{"comment_id":"1203286669686614","commenter_b":"I am not sure where you, Harry Reid are coming from. This bill is not for or against immigration, it is against illegal immigration. Why are you against protecting the USA against illegal acts? The best thing we can do for the USA is have the exact same law for illegal immigrants as our neighbors to the south. Let us have the same illegal immigrant laws as Mexico, then there will be no thought or comments about being wrong or too tough. Yes?","commenter_a":"The vilest thing in the Congress are you sir!","post_message":"The vile legislation that is now before the Senate might as well be called the \"Donald Trump Act.\" Like the disgusting and outrageous language championed by Donald Trump, this legislation paints all immigrants as “criminals and rapists.” Local law enforcement officials, domestic violence groups, immigrants’ rights groups, mayors, faith leaders and labor groups all oppose the \"Donald Trump Act.\" This bill does nothing to keep Americans safe, and it certainly does nothing to address our broken immigration system."},{"comment_id":"10154125037012377","commenter_b":"Women are smarter than you think. This is always from a man's perspective that we are weaker. Always remember women birth your armies, their children suffer and die. The hands that rock the cradle rule the world. And when they send troops home blind and crippled, it's the woman wives and mother that take up the healing the grieving and the praying. God made us special that way. Someone has to have sense.","commenter_a":"I hope that Trump comes up with some way to penalize the Media when they publish lies.....They should not be able to get away with it.....they put up pictures that are not true with the stories.....the media has become a very negative view on anything with Trump...they dont have the truth in them......I have high hopes for President Trump and do believe he will do a great job.....It is time for all to quit all tthe stupid protesting and join together to help America!!!","post_message":"Americans reactions to President Donald Trump's inauguration were positive with more people saying they are now more hopeful about the next four years than those who are less hopeful, a Gallup Poll reveals."},{"comment_id":"894267073955650","commenter_b":"She makes me sick!!!!! Gag!!!","commenter_a":"Not even smart enough to keep her mouth shut.","post_message":"OUCH: Meet the Press plays brutal montage of Hillary Clinton flip-flopping on various issues @webpagelink"},{"comment_id":"10153099824304753","commenter_b":"This bitch should burn in hell and die of slow painful death","commenter_a":"Look at this demon shaking my damn head","post_message":"She murdered two of her children, one of them in front of her 8-year-old son. At today's custody hearing, she wanted the whole world to know it and was kicked out of the courtroom. What do you think should happen to this woman? @webpagelink"},{"comment_id":"1237296066293181","commenter_b":"Stupid Hoe","commenter_a":"I think she is mad talented but until she stops dressing like a skank and humping everything from the air to the ground to the men in her music videos, the attention she gets will not be based off her amazing talent but on her sexuality. Becuase I think she is so talented I have watched many of her videos looking more for talent than her soft core porno ways and found that only a handful of her videos showcase her talent and not her ASSets. Soooo I mean, do something else girl cuz that talent is off the hook.","post_message":"There's a tendency to read Minaj solely through her sexuality."},{"comment_id":"10154877505644351","commenter_b":"Build it electrify it arm the wall with automatic weapons cameras night vision electrify deep into the ground to kill tunnellers pass new deportTion laws make it a felonie criminal act to border hop punishable by years in a very bad prison","commenter_a":"His whole campaign was based on building a wall!! Of course he should, we need secure borders!!","post_message":"Thoughts?"},{"comment_id":"10153470522401545","commenter_b":"I totally agree. It won't happen because it generates big money. A bunch of sick people","commenter_a":"And Porn is still accepted & allowed in our country & world ?!?! Porn is a horrible addiction causing harm to others. I want our elected officials to get porn out of our lives forever !","post_message":"In police documents obtained by WFAA, school bus driver Leonard Bradford told investigators he swam in a public pool with 40 to 60 children in the summers of 2014 and 2015. According to police, Bradford admitted to investigators that he purposefully rubbed his genitals on five girls."}]
