[{"comment_id":"1216674918389035","commenter_b":"Vote Hillary","commenter_a":"Vote Hillary","post_message":"“En mis primeros 100 días, voy a introducir legislación para una reforma migratoria integral con camino a la ciudadanía. Esto no solo es lo correcto sino que cada análisis independiente ha demostrado que añadiría cientos de miles de millones de dólares a nuestra economía. Mantendría también a las familias juntas. Tenemos que sacar a las personas trabajadoras fuera de las sombras. Estados Unidos siempre ha sido un lugar donde personas de alrededor del mundo trabajan duro y aplican sus talentos al crecimiento e innovación del país en la búsqueda de sus sueños. Así que haremos todo lo posible para lograrlo” —Hillary."},{"comment_id":"10153189307188352","commenter_b":"I Understand hw U feel. U will ask d Grace frm God 2 give U a woman,I mean a \"Virtous Woman\". God wil give U a Good woman as a Wife. Remember d Bible says, He who finds a Wife,finds a good thing n Obtain Favour frm God. U jst av to b HAppy wit Urslf.","commenter_a":"How is that when everything you are she just crap on me rip my heart out and then go to our church act like I don't even exist understand how you can say you love me 1 minute and then say you don't want to be with me the next and all I hear from people is get over it and just move on wow so easy to say I am not a man that has the gift of words to woo a woman love one forsake all others that is how I was raised","post_message":"Breakups hurt, but losing someone who doesn't respect and appreciate you is actually a gain, not a loss."},{"comment_id":"1203579539653054","commenter_b":"I'll be sure to let them know you said that Ralf, I'm sure they'll be devastated,.?!","commenter_a":"More bs from HRC,.. H and her half-truths... Number of oil, gas and coal industry lobbyists that have made direct contributions to Hillary Clinton 2016 presidential campaign: 57 57 registered oil, coal and gas lobbyists have personally given $126,200 to the Hillary campaign Of those 57, 11 are bundlers. 11 lobbyists have bundled $1,140,930 in contributions to the Hillary campaign 43 lobbyists have contributed the maximum allowed ($2700). Source : @webpagelink","post_message":"Hillary Clinton showed a flash of anger when confronted by a climate activist: \"I'm so sick of the (Bernie Sanders) campaign lying about me.\" @webpagelink"},{"comment_id":"10154468706093869","commenter_b":"Maybe not, 45 may beat her to the prison. At least, those of us who are not bamboozled are hoping to see him in a federal prison.","commenter_a":"Dream on. Hillary will be convited and thrown in prison where she belongs.","post_message":"Today's daily cartoon by Tom Toro. Swipe through more cartoons with the New Yorker Today app: @webpagelink"},{"comment_id":"10154542525666051","commenter_b":"So we get rid of all the illegals and we pay $5.00 for a head of lettuce cause who is going to do all this work?","commenter_a":"Sneaking into our country is explicitly illegal. Why is Mexico allowed to have a wall on its southern border with strictly enforced immigration laws but America isnt? What would happen to 100% of Americans caught illegally entering","post_message":"The Trump Administration's latest deportation plan is explicitly illegal under international law. Here are the details:"},{"comment_id":"483277565194949","commenter_b":"Jesus wouldnt like that she kills babies for a living.","commenter_a":"So sorry you folks are tearing this young woman apart, would Jesus do this?","post_message":"What'd you think, folks?"},{"comment_id":"10152894854427756","commenter_b":"I use paper condoms.","commenter_a":"Thanks Obama. *shakes fist*","post_message":""}]
