[{"comment_id":"1419494658112647","commenter_b":"Show your junk to one of my babies and I promise you will sit to pee the rest of your sick life touch one and you will meet your maker and it won't be GOD","commenter_a":"You're one sick son of a b****","post_message":"CNN Believes That Little Girls Should Be Exposed To Male Genitals, Here The DISGUSTING Reason They Are Pushing This!"},{"comment_id":"10153522493691167","commenter_b":"Wow I wish this guy would go away","commenter_a":"He is who? A old confused white guy","post_message":"Nope."},{"comment_id":"10157436737495389","commenter_b":"If you are Gay, why are you voting for Hillary when she wants to bring in millions of refugees that believe gays should be executed If you are Black, why are you voting for Hillary when she defends Planned Parenthood and admires Margaret Sanger, who wanted to abort as many black babies as possible and exterminate the black race because they are like 'weeds.' Most of those clinics are in Black neighborhoods. If you are a Woman, how can you vote for Hillary when she has buried all of Bill's rape victims under the rug. As an attorney, Hillary also defended the rapist of a 12-year old girl and laughed about it later. She plays the woman-card and acts entitled; implying that she deserves your vote merely because of her sex. How is that gender neutral? If you have are a Miner, Steelworker or have a Factory job, why are ...","commenter_a":"You don't understand. Obama and cronies want Islam here, and Islam is intrinsically radical. It advances their agenda of Societal destruction, 'social engineering'.","post_message":"'I think if we don't speak honestly and clearly about what's happening, [then] we can't solve the issue.'  Karen McWatters, who lost her leg in the Boston Marathon bombing, said the President and other leaders can't solve the problem of radical Islam until they're willing to call it what it is."},{"comment_id":"475707345887193","commenter_b":"If they don't like it here I will help them pack and kick there a##es out of here","commenter_a":"I'm sick of hearing about muslims. How abov you?","post_message":"A butcher was selling this to Muslim customers without them knowing. Now he's going to jail."},{"comment_id":"10154000261646337","commenter_b":"Tiny Fey and Amy Poehler would so destroy you right now with words of girl power and women unitedness. #Womanizer","commenter_a":"#BETsoBlack am I doing this right or nah?","post_message":"'IT'S A REGRESSION': Will Smith stays positive about the #Oscars and Hollywood's bigger problem with diversity..."},{"comment_id":"1075446135834786","commenter_b":"She's a sell out!","commenter_a":"I don't know who she is. I've seen her before but in what I don't recall. But I really didn't get the joke or whatever it was supposed to be. ...","post_message":"What did you think of Stacey Dash's appearance at the #Oscars? @webpagelink"},{"comment_id":"10152781007061615","commenter_b":"Our veterans go without while lazy a**es and foreigners collect cash, food stamps and free medical. What's wrong with this picture??? VETERANS AND ALL MILITARY SHOULD COME FIRST! They put their lives on the line so the lazy idiots and illegals don't have to. WAKE UP AMERICA AND GET YOUR PRIORITIES STRAIGHT!!! Rant over.","commenter_a":"but it was OK that he put his life on the line for this country give the man what he deserves","post_message":"DENIED. An American hero, unable to collect his military benefits when he needed them most. WPXI Rick Earle gets help for this veteran. His story is coming up tonight at 5:45 p.m."}]
