[{"comment_id":"833697490010213","commenter_b":"All babies are precious I guess your mother didn't think like you or you wouldn't be here idiot","commenter_a":"How but killing the mother so she can't have anymore kids","post_message":"How many of you would have been aborted under this perverted logic?"},{"comment_id":"695324637324781","commenter_b":"Get ISIS and obammy out of AMERICA first. We need to protect ourselves and children. Then we can help ours.","commenter_a":"Wipe them off the face of the earth!!!!!!","post_message":"An innocent American girl was found in the middle of this ISIS debacle. America now truly stands with France against ISIS. Do you think that America should wipe ISIS from the face of this planet?"},{"comment_id":"523635814493665","commenter_b":"Give the lady her job back, NOW!!!!!!","commenter_a":"Too bad- Boo Hoo Hoo","post_message":"A lunch lady was fired for serving pork to a Muslim student.  We are in America, give that poor lady her job back.  Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"10153879601166545","commenter_b":"Thugs.","commenter_a":"Sometimes it's the company you keep, parents need to know who their kids are hanging out with...and for the people with the insults etc it could be very well your child, then you would think differently, and you will still be help accountable for your ill words against another.","post_message":"Arrest warrants have been issued for three more teens believed to be connected to the Aug. 2 robbery."},{"comment_id":"10154067221877464","commenter_b":"@username BUT OF COURSE YOU WOULD BRING UP CHILDREN..because you are filth. All Cruz people dumber than dirt.","commenter_a":"Keep on going Ted! The more you make Trump mad, the more likely it is you beat him.","post_message":"Read more: @webpagelink"},{"comment_id":"10153096349467377","commenter_b":"I agree with Rush. I'm sick of women pushing themselves to the front of every topic. And using their gender to advance themselves. We who have sons and brothers hate to see the way they are pushed to the back of the bus.","commenter_a":"I have listen to Rush for 20 years!! Love him!! I agree with him.. most people who don't like him have never listen to him!! I like Michael Savage to, talk radio is where you find the real news... wake up people we are losing our country!!!!!!","post_message":"Rush Limbaugh says that too many women journalists have led to the \"chickification\" of the news — which gives it a female-friendly slant."},{"comment_id":"10153166657159456","commenter_b":"White devils are a nightmare!!","commenter_a":"Welcome President and Mrs. Obama. It is an honor!","post_message":"UPDATE: President Obama has arrived in Selma. Scheduled to speak at 1:35 p.m.  The President is on his way to Selma after landing in Montgomery. Should be there soon! @webpagelink"}]
