[{"comment_id":"1299289040084712","commenter_b":"It was an independent anti-Trump, Political Action Committee. The chair said she doesn't support Ted Cruz. She is only anti-Trump.","commenter_a":"they attacked Melania first and Trump has as much right as Cruz does to protect his wife. If they don't want to get attacked don't attack him !!","post_message":"Nailed it, Senator."},{"comment_id":"10153315514576336","commenter_b":"That turbofan jet engine intake is sturdy enough to handle the weight of that woman. Also, her derrière is not going to effect the shape of the intake. It is designed to handle air pressure from 250 knot IAS relative wind that at altitude could be as high as 550 knots TAS. So, what's the big deal? I think the picture looks COOL!!!","commenter_a":"I do not think so. The preconditions are whether the company has the clear policy for it, whether she got enough training of behavior in the company?","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"672451282894291","commenter_b":"@username The trump wall is ! I want mexico to build it ! If you arent part of the solution you are the problem .","commenter_a":"When a unstopable force meets a unimpregranable wall It is time to vote for Trump ! Hope I spelled that right libs and spell check police !","post_message":"Donald J. Trump said he didn't call Ted Cruz 'Lyin' Ted' in his New York victory speech because \"I thought it would be very undignified for me to get up at that particular moment with ... pretty much the world watching.\""},{"comment_id":"10152629454892894","commenter_b":"She mad @username don't believe that hoe","commenter_a":"Aliah Tamartian Trainer Toi Magee-Taylor","post_message":"Coupled Up? Keke Palmer & August Alsina are Ridin' Around & Gettin' It [Photos]"},{"comment_id":"1676754379239687","commenter_b":"Bramden whos god bitch","commenter_a":"What a dumbass. It just shows how little thought he's put into what he's saying. The environmental impact alone would be devastating. My problem with Trump is, if he were somehow to get elected, when he didn't get his way he would just say \"I'm going back to my life as a billionaire where I get my way and everything has a price so I can have what I want\". He's made that statement in one of his speeches. He said \"you might not like my statements and I may not get elected for them. So what, I'll just go back to my life of wealth\".","post_message":"How would Donald Trump crack down on ISIS as president? Let's just say he has a bold plan. Here, in his own words, is what he'd do:"},{"comment_id":"893147240733824","commenter_b":"If the women go topless I'll go lol","commenter_a":"Aida Nunez really. Kids should not see this. Go home and do that at your own home. At least! Or in your backyard lol","post_message":"Go Topless Arizona organized a protest in Central Phoenix today. The group organized a protest march this morning down Indian School protesting what they view as discrimination against women. The law allows men to go topless,they say, while women cannot. We \"cover\" the story tonight at 9 & 10."},{"comment_id":"10152641754716367","commenter_b":"Yes she is!!! She wears Spanx.","commenter_a":"Mucho baggae...g","post_message":"The Hillary Clinton email controversy is a reminder of one inescapable fact: She comes with baggage."}]
