[{"comment_id":"10153700282571955","commenter_b":"Ann Coulter's long lost French sister !!! Yea !!!! <3 \\b\\b\\b\\b\\b","commenter_a":"European and US far right are far different there is no limited governemtn and free marekt in Europe, it is just taking chashing cultures seriously.","post_message":"NEW WONDER-GIRL OF FRANCE FAR RIGHT..."},{"comment_id":"10154335392498812","commenter_b":"learn the law because you look like an idiot. TRANSGENDER people can use the bathroom, not men like you and I. I cant just say oh I want to go pee in the ladies room. that isn't how it works. I have a friend who is transgender and her license now says female. she looks like a female. should she go into the mens room? the law is for people like that, not just people who decide today to go in the opposite sex bathroom.","commenter_a":"I won't be listening to them anymore!!! Transgender people are not the only ones with rights,,,if you're a man who wants to use the ladies room get a sex change ....Liberalism is ruining our country,,,,what was a constitutional republic is turning into a socialist hell hole","post_message":"Pearl Jam cancels North Carolina concert, calling HB2 law \"a despicable piece of legislation that encourages discrimination.\" @webpagelink"},{"comment_id":"10153720190262894","commenter_b":"She'll always be a ghetto bitch from Chicago","commenter_a":"Read this shit @username gold diggin bitch","post_message":"Wiz Khalifa and Amber Rose Finalize Their Divorce, Hit the Strip Club Together [Video]"},{"comment_id":"934248849943870","commenter_b":"American's just as guilty for ALLOWING these Satanic PIGS to roam our country and have their way! THIS----IS---OUR---COUNTRY!!! NOT the POA - NOT Islams!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"These MUSLIMS think they can come to this Country and do what they want, NO if you don't like it go back rape you women and kill but not in AMERICA!","post_message":"Must Watch!"},{"comment_id":"10154179155026051","commenter_b":"Yup","commenter_a":"Nop","post_message":"Do you think Donald Trump would be a better president than Hillary Clinton?"},{"comment_id":"1062576617115128","commenter_b":"I think if Americans knew the reason and how our fresh produce(picked by illegal and legal migrants) become contaminated with ecoli and other harmful filth- we would all choose trained Americans to harvest our FOOD. People pay more for organic produce, unsoiled produce is just as valuable.","commenter_a":"The farmers did it to themselves. They gave those jobs, back in the 60s, to illegals who worked for cents on the dollar - and American families were shoved out of the industry. Don't say there aren't people out there who won't do the work. There WERE people out there doing the work - and they threw them away. Let's FIRST - get rid of them ALL - and give it a year to play out to see where we actually NEED work visas. If american companies (and farmers) can show that they diligently TRIED to hire Americans and could not get the skill or number of people they needed - FINE, then they can apply to bring people in on VISAs.","post_message":"THE #1 ISSUE FACING AMERICA Recently, I joined Dr. Carson to discuss immigration. We met for 90-minutes. I shared my experiences, opinions, concerns, and solutions with him. Topics ranged from border security, terrorism, drug and human trafficking, the impact on jobs, wages, welfare, education, culture, and healthcare. HIGHLIGHTS OF WHAT I SHARED: 1. Last year, after announcing I’d explore running for president myself, Megyn Kelly asked why I wanted to be president? I replied, “I hold the sort of conservative values which America needs today. And in the same way Reagan kept his word by bringing home the hostages, I promise to secure the border and solve the immigration problem. I went on to say I'd protect the American people, their lives, their jobs, their health, and their children in the same manner I protect my own. I told her audience I was in love with America. Later that night ..."},{"comment_id":"369489863429570","commenter_b":"Ship her out ban her from AMERICA","commenter_a":"I agree she should be arrested","post_message":"President Trump says Madonna is 'disgusting' and a 'disgrace' to America because she said she wanted to blow up the White House. Agree or disagree?"}]
