[{"comment_id":"10155961820435725","commenter_b":"Time for Americans to play the TRUMP card!!! Adios Illegals!!!","commenter_a":"Mr Trump ...the RNC will NEVER give you the nomination .... This is a chance for America to rid itself of the GOP for good... Start a third party... American Patriot Party... A Party of the People!!! If it doesnt work... so be it... You are the only one who can beat Hillary and if you are not the nominee ...she will win.. But at least we gave it a shot... If you dont win...then the GOP wont win!!!!","post_message":"Our online store is officially open! Visit www.DonaldJTrump.com/shop to shop the latest #MakeAmericaGreatAgain merchandise."},{"comment_id":"1091478814208499","commenter_b":"what a dumb bitch","commenter_a":"Our President has made it ok to be racist again.","post_message":"Doesn't seem like EVERYTHING is racist? According to the New York Times anyway."},{"comment_id":"10152987213175090","commenter_b":"She is a liar!!","commenter_a":"'What difference does it make'!","post_message":"Why don't you want Hillary Clinton to be President? @webpagelink"},{"comment_id":"822346244580816","commenter_b":"Lock her up for using RNC email server for government business.","commenter_a":"I will turn off any program that has her... the \"Minister of Propaganda\"","post_message":"It's time to stop giving Conway the mic - nothing she says is true or credible."},{"comment_id":"507285912795322","commenter_b":"God will show his hand and these creatures will be taken away to their doom.","commenter_a":"Take off the masks ladies!","post_message":"ISIS just made a huge move against America. This is unacceptable. Spread this post, we need to fight back. Do you agree ISIS should be wiped off the Earth?"},{"comment_id":"10153915045317434","commenter_b":"And like she's trying to get the fuck away.","commenter_a":"Am I the only one who thinks the second pic looks like he is going down on her? Oy!","post_message":"Enjoy some underwater pregnancy announcement pictures."},{"comment_id":"1557909130909006","commenter_b":"Go watch FOX bitch...","commenter_a":"Because guns cure racism and misogyny. Vice you are officially the retarded wing of journalism.","post_message":"What radical black womanist politics organized around self-defense actually looks like, and why it matters."}]
