[{"comment_id":"1371652822850169","commenter_b":"Shut the fuck up dum bytch","commenter_a":"a policemans job is hard and they have to put up with alot of verbal abuse and it takes alot of self restraint, thats y it is important for the good brave cops who really care about what they do to take pride and turn in the bad cops who do not care or are just burnt out","post_message":"This DJ just said it's time for good cops to start calling out bad cops."},{"comment_id":"10152543335115933","commenter_b":"Amen!!","commenter_a":"Leave our kids alone! GET RID OF COMMON CORE!","post_message":"It's about time we get college costs under control, and I'm glad to have Ohio's college and university presidents on board as we move to make it happen."},{"comment_id":"10152866488206336","commenter_b":"that IS child endangerment..someone needs to be locked up--along with the snake........","commenter_a":"Some are just nuts","post_message":"This video footage of a 14-month-old girl playing with the family pet might make you a little nervous."},{"comment_id":"10154323932234091","commenter_b":"I am so so so tired of the general public making excuses for these clowns and demanding we idolize them and refer to them as heroes. A LOT of them are just low IQ goons who made it through a few weeks of police academy and are let loose on the streets to act juvenile and bully citizens. And the more people worship them and expect the rest of us to, the more emboldened they feel to keep up this embarrassing and sometimes even deadly behavior.","commenter_a":"Yet another incompetent coward revenue collector.","post_message":"\"We thought (the officer) was texting on his phone. Because the whole three hours we were sitting here, he was the one standing there. We saw him on his phone, but we didn't think an officer would do that.\""},{"comment_id":"929340743844610","commenter_b":"Unfortunately, it will only get worse if lying, cheating, Hillary gets in the White House. God Bless us all.","commenter_a":"Time can't pass fast enough until he is gone and out of office!! He is such a disgrace to this great nation!!! I would love to see him locked up for all of his crimes that he has commented on the people!! TRUMP is the only hope we have...Hillary will be even worse than Obama!!!","post_message":"Obama Admin Gives Homeless Vets The Finger; Housing Illegals at Military Base Instead.... Obama is like Colin Kaepernick... Hates America, Hates our Flag and HATES the people in the US Military who defend it. Then Cries racism at every corner while becoming RICH from it."},{"comment_id":"630177530448762","commenter_b":"It is not surprising, if it was a terrorist attack the pilot would have tried to crash the plane into a very densely populated area i.e not the French Alps.","commenter_a":"I'm relieved (and surprised) that the pilot's last words weren't Allah Akbar.","post_message":"Aha! That's a BIG part of it I'm sure."},{"comment_id":"10152670705340671","commenter_b":"Glad she was able to fight him off but lets be smart about it ladies.","commenter_a":"What was she doing jogging in the dark at 5 am in the morning. I am not condoining she got attack. But account for ones own safety is what I am saying.","post_message":"The woman was able to fight the attacker off, police say."}]
