[{"comment_id":"10153229988242293","commenter_b":"And who would that lady be? Certainly not this four times married adulterous who're?","commenter_a":"It takes lady to show the world what TRUE VALUES are; and how STAND UP in those VALUES ...!!","post_message":"Kim Davis entered the Carter County Detention Center under cover of night five days ago. She emerged to Survivor’s “Eye of the Tiger.”"},{"comment_id":"10155107253330557","commenter_b":"White people riot","commenter_a":"Must of been a black on black murder .... No riots","post_message":"#BREAKING: 2 people in custody, another still at large in the murder of a man in Reading. Developing details in the story below and in a live report on 69 News at 5:30."},{"comment_id":"10152984965615950","commenter_b":"@username what a BITCH","commenter_a":"Cute. But this is not the 1st time they put the glasses on the baby.","post_message":"WATCH: Adorable viral video shows a baby seeing clearly for the first time, and it teaches an important lesson for parents: it's never too soon to check your child's eyesight @webpagelink"},{"comment_id":"10153142074684030","commenter_b":"Apparently all the men do. Lol. I've never heard of her","commenter_a":"I love Natasha Leggero!","post_message":"The Bieber roasters get a geography lesson from Natasha Leggero. The #BieberRoast premieres Monday, March 30 at 10/9c."},{"comment_id":"875427632505785","commenter_b":"I prefer to be even more accurate than that. The legal term is \"Illegal Aliens\".","commenter_a":"Hey Fox 10! I love you, but this has to stop! It's ILLEGAL IMMIGRANTS NOT JUST IMMIGRANTS! Immigrants are preserved for those who came here LEGALLY. GET WITH IT!","post_message":"More than 1,800 immigrants that the federal government wanted to deport were nevertheless released from local jails and later re-arrested for various crimes, according to a report released Monday. What do you think about these findings?"},{"comment_id":"952878738162068","commenter_b":"Than go home! Are laws not yours","commenter_a":"mix bacon with it .../","post_message":"\"The Islamic form of slaughtering animals involves killing through a cut to neck when the animal is still alive. An Islamic prayer is then read as the blood is drained from the body. In the UK animals are legally required to be stunned before their neck is cut, but some Muslim argue this is against their religion.\""},{"comment_id":"10152706974886717","commenter_b":"As an Australian, observing from afar, ALL your possible candidates are hypocrites and troubling. In a perfect world, Bernie Sanders would be President and the GOP and the Tea Party would have melted into oblivion. However, it's NOT a perfect world, and I'm a realist. Even the darling of the left, Elizabeth Warren, is an avid supporter of Israel, whilst allowing the continued persecution of the Palestinian people. Politics isn't about the best possible person: it's about the least worst. Hillary Clinton is the least worst by a country mile. We know where she stands. We know how she thinks. We know how she works. We know she's a fierce supporter of women's rights. We know she's learnt a lot of painful lessons from her time as first lady, Senator for NY, and as Secretary of State. I also believe that she's learnt from these mistakes to make herself a ...","commenter_a":"Doesn't mean she should be president. we need to stop being single issue voters and look at the whole picture.","post_message":""}]
