[{"comment_id":"10153373196639877","commenter_b":"Girl bye !","commenter_a":"SIT UR FACT AZZ DOWN ..AINT GONNA HAPPEN .","post_message":"Wendy Williams wants Terrence Howard fired from 'Empire' because of past abuse allegations. Check out the video clip below.  Grio fam, what do you think of Wendy's remarks? Sound off."},{"comment_id":"499065056962019","commenter_b":"I can't stand her. Send her back to India where her parents are from.","commenter_a":"We can't let the GOP pick and choose who they want in office. It is up to the voters! GOP take notice, heed our warning, because if this does happen, and Donald becomes and independent; there will be. Democrat elected!","post_message":"Now that she criticized him, will Donald Trump snuff out Gov. Haley's rising star?"},{"comment_id":"1003724273013669","commenter_b":"This woman is dumber than a box of rocks!","commenter_a":"freaking nut case!","post_message":"Dems know where to get their votes..."},{"comment_id":"10155187473209614","commenter_b":"Your armpit makes me gag hahahhaha","commenter_a":"let them do their job.... and yes if you are on list ...GOOD BYE !!!!!!!!!! SUPPORT ICE FOR THE MAKING AMERICA GREAT AGAIN...","post_message":"Los Angeles' top elected officials cosigned a letter  urge in the strongest possible terms that ICE immediately cease this practice in our city.  Since the late 1970s, L.A. police have worked to build trust within the city large immigrant community so those in the country illegally can report crimes and offer information to police without fear of deportation."},{"comment_id":"10154244033251519","commenter_b":"So @username does not use gas. Good for you.","commenter_a":"Hey they lost a war. Get over it. Ppl been fighting ppl over land since the beginning of our time, even animals do it. What makes Indians so special?","post_message":"Salon's Charlie May was at Standing Rock as protesters celebrated the recent #DAPL news. Veterans, including Wes Clark Jr., bowed and asked Native elders for forgiveness.  Read more: @webpagelink"},{"comment_id":"1772229929682875","commenter_b":"'@username In defense of Donald Trump : Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not starting a race war. Trump did not leave any US soldiers in Benghazi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion ...","commenter_a":"Trump represents everything that is wrong with America. A narcissistic opportunist, a pathological liar, a clueless idiot, an unashamed con man and an unapologetic bigot!","post_message":"Imagine this man in charge of our men and women in uniform."},{"comment_id":"10152813313326523","commenter_b":"Glad everyone shared that video and got this no good nasty tramp bitch arrested!","commenter_a":"Black lives matter","post_message":"“It’s almost like they plan these fights, they want these fights to be on tape where they can put it on social media. This is horrible.”"}]
