[{"comment_id":"10153107155889411","commenter_b":"Your mother is a terrorist","commenter_a":"Not all muslims are terorist but all terorists are muslim...","post_message":""},{"comment_id":"1035505973211617","commenter_b":"Rondell....you are missing something","commenter_a":"What makes Melania Trump's speech troubling is not that she \"plagiarized\" words/phrases from FLOTUS Michelle Obama's 2008 speech. But rather that Melania was not able to speak \"authentically\" about how she feels about \"her\" own husband, Donald J. Trump. The fact that Melania had to use another woman's words to speak about her husband versus using her own words underscores something deeper--not just about the Trump campaign, but whether America can trust a man whom his wife does not even know.","post_message":"In-house writer with the Donald J. Trump campaign steps forward with apology for Melania Trump's speech and tries to resign - but Trump camp rejects resignation."},{"comment_id":"10154323932234091","commenter_b":"I am so so so tired of the general public making excuses for these clowns and demanding we idolize them and refer to them as heroes. A LOT of them are just low IQ goons who made it through a few weeks of police academy and are let loose on the streets to act juvenile and bully citizens. And the more people worship them and expect the rest of us to, the more emboldened they feel to keep up this embarrassing and sometimes even deadly behavior.","commenter_a":"Yet another incompetent coward revenue collector.","post_message":"\"We thought (the officer) was texting on his phone. Because the whole three hours we were sitting here, he was the one standing there. We saw him on his phone, but we didn't think an officer would do that.\""},{"comment_id":"10155981845940354","commenter_b":"Trump is a media whore. Anyone dumb enough to support him might as well give your vote to Hillary because that is what you asshats are doing NOTHING in Trump's history suggests he is a real conservative. He is just repeating what we say and making republicans look like clowns. His close friend Oprah Winfrey, the person who did more to get Obama elected than anyone else and endorsed by Trump to be vp is ecstatic.","commenter_a":"Hes right pc has got to go. I heard him this morning, if cnn would have allowed him to finish his sentence, he was referring to nose mouth obviously. Typical, cut them off and use it for a soundbite.","post_message":"\"I’ve had lots of men imply that I was unfit for decision-making because maybe I was having my period…\""},{"comment_id":"10156577406325231","commenter_b":"Girl tell it.","commenter_a":"Did anyone question how much the late Nancy Reagan spent during her time in the White House, especially on all that expensive china she had to eat off of and let's not even discuss her designer clothing, shoes, and handbags and the country was in a recession then too. Leave these children alone!","post_message":"How about people stop worrying about the price of the first family's clothing?"},{"comment_id":"940671535979474","commenter_b":"Traci, if you feel that way then please block me.","commenter_a":"The trolls are up and ready. I see no great news for women. No woman should have the right to kill, like no man should have the right to force himself on her. Two wrongs don't make a right.","post_message":"Life begins at conception and it's time the law reflected this obvious truth! Have you signed YOUR petition yet? Click HERE to urge Congress to pass the Life at Conception Act! @webpagelink"},{"comment_id":"10154889301650180","commenter_b":"Mine must have Bluetooth capability or something... every time I use it for lane changing, the car behind me speeds up to block me... weird!","commenter_a":"Oh so there not decorations for the holidays? Because it seems that's the only time I see people really using them","post_message":"Indiana State Trooper films hilarious PSA about this major vehicle safety feature called a \"turn signal.\" @webpagelink"}]
