[{"comment_id":"10155811623205594","commenter_b":"You are $hit. This is about a little girls recipe. keep your poitical agenda where it belongs. in the crapper","commenter_a":"Must look like SH!T...","post_message":"Barack Obama told her it was a standout dish for him."},{"comment_id":"1008103192579543","commenter_b":"For those of you @username fans, I am posting this article to show the evils of this woman and why you should not vote for her. @webpagelink","commenter_a":"Hillery for prison in 2016","post_message":"\"As a South Carolinian, an African American man, and a father, I can't stop asking myself once again: Where does my community go from here?\" Clay Middleton, Hillary for South Carolina State Director, on the #AssaultAtSpringValleyHigh."},{"comment_id":"10154871308810586","commenter_b":"Oh it was Bakersfield, now I get why it happened.","commenter_a":"Brooke, I bet this is my problem!!","post_message":"“They said it’s just fat, you’re just fat…it’s just fat developing there,” the man said of the benign tumor that doctors now believe likely started due to an ingrown hair."},{"comment_id":"10154610047733132","commenter_b":"This breaks my heart seeing this adorable fella like this.","commenter_a":"Help him !!!!","post_message":"Just one look in this poor guys' eyes tells you he's deeply unhappy. (via PEOPLE Pets)"},{"comment_id":"633419350152037","commenter_b":"Bye, don't come back","commenter_a":"His gravy train parliamentary salary wasn't enough he must have found another income that was better for less hours","post_message":"What's next for David Cameron?"},{"comment_id":"523659234491323","commenter_b":"Not with a dogs dick!","commenter_a":"fuck her","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"},{"comment_id":"10154073966458837","commenter_b":"Getting pregnant for most chicks doesn't cost anything ! Save a few bucks and don't buy a condom .......","commenter_a":"Omg! I'm really trying to understand her thought process at that time, but really can't! Some people have no brains and should never reproduce! There are so many women out here that are dying to be able to birth a child and you have pos ppl like this. Smfh!!!","post_message":"SHOPPING MOM ARRESTED - A Florida mom was arrested after leaving her 4-month-baby in an unlocked car while she went holiday shopping."}]
