[{"comment_id":"396582543845311","commenter_b":"Richard J. Lindner She Did Commit Perjury, Destroyed Evidence Under Subpoena GET OFF THE H-TRAIN","commenter_a":"Repost: Federal Law: Title 18. Section 2071 Can it be any clearer? Former United States Attorney General Michael Mukasey tells MSNBC that not only is Hillary Clinton's private email server illegal, it \"disqualifies\" her from holding any federal office. Such as, say, President of the United States. \"If you do this or that bad thing, you've essentially disqualified yourself as being the leader of the free world,\" said Mukasey, referring to the illegal server and the illegal handling of classified materials. Mukasey specifically points to one federal law, Title 18. Section 2071. For those of us who do not have United States Code committed to memory, here's what it says: (a) Whoever willfully and unlawfully conceals, removes, mutilates, obliterates, or destroys, or attempts to do so, or, with intent to do so takes and carries away any record, proceeding, map, book, paper, document, or other thing, filed or deposited with ...","post_message":"BAM!"},{"comment_id":"10156227118445354","commenter_b":"And gays, get ready to be tossed off the highest building available. Who let the muslims here. Get ready fools.","commenter_a":"Prepare , you liberal women better bend over and shut your fucking mouth. This is what you asked for.","post_message":"Green light GO!"},{"comment_id":"1142904239055165","commenter_b":"Cruz wants to stop illegal immigration. He or Trump will basically rescind all this lawless president's entire presidency in the first month.","commenter_a":"Don't bet on it. Remember, Cruz though he has his good points, he still \"wears the Republican & Special Interests chain\" he forged by accepting campaign contributions. Also, remember fort 7 long, long, long years...he didn't constatnly call for John Boehner (sober?) to call for The House Sergeant-at-Arms to arrest \"Barry O from Honolulu\" for multiple counts of High Treason, violation of The Presidential Oath of Office, failing to defend The Constitution, and counts of U.S. Treasuyr Embezzlement of Funds to illegally fund bogas business startups that failed, disappeared, and the money disappeared as well.","post_message":""},{"comment_id":"10154424065382885","commenter_b":"If I'm not mistaken your authorized to wear awards from other services you earned. I know in my unit former Marines would wear their aviation badges.","commenter_a":"The officer in this picture is wearing a Navy Fleet Marine Force Breast insignia, Navy Conduct Medal, Navy and Marine Corps Achievement Medal ... weird","post_message":""},{"comment_id":"519829538184192","commenter_b":"Santagini - you are either batshit crazy or very funny.","commenter_a":"The traitor flag belongs in a military museum next to Nazi war memorabilia we took from dead Germans. You want heritage? Wave the white flag, that's your heritage.","post_message":"\"The time surely comes when [justice] must and will be heard,\" New Orleans Mayor Mitch Landrieu told the city council, calling for the statues of Jefferson Davis and Robert E. Lee.to be put in a museum. \"Members of the council, that day is today. The Confederacy, you see, was on the wrong side of history and humanity.\""},{"comment_id":"10152721267846813","commenter_b":"Did feminists put these dumb words in this clown's mouth?","commenter_a":"The problem comes from this institutionalized idea that men are superior to women and therefore can make decisions on behalf of women. It is a systemic problem that as a society we have been fighting externally, but have found challenges how to fight it internally.","post_message":"Should men be able to decide what happens to a woman’s body? Sound off in the comments section! #LetsTalk"},{"comment_id":"1186165314729122","commenter_b":"She can afford it. Why do taxpayers pay for her ?!!!! She needs get over herself.","commenter_a":"All cops should refuse ,let her pay for her own security.","post_message":"Several members of the Pittsburgh Police Department have refused to work security at Beyoncé's concert tonight."}]
