[{"comment_id":"1184855771553940","commenter_b":"I won't be watching @username tonight. I will not be watching that Hag!! Why is @username making such a big deal out of THAT LYING WITCH??","commenter_a":"Here's me not watching","post_message":"\"We know that Russian intelligence services... hacked into the DNC.\" Today on \"Fox News Sunday,\" Hillary Clinton commented on the recent hack and Donald J. Trump's attitude towards Putin."},{"comment_id":"10154277505591509","commenter_b":"At the end of the day, Banning Muslims from this country isn't going to fix the problem. They will find another way to hurt us. It's an ongoing threat that's not going to stop unless you eliminate the threat.","commenter_a":"I've never seen so much racism in my life, say it ain't so, but the comments and the reactions are very disturbing.","post_message":"\"The fact is what Donald J. Trump said yesterday disqualifies him from serving as president,\" The White House Press Secretary Josh Earnest said Tuesday. @webpagelink"},{"comment_id":"10153622787011336","commenter_b":"Michelle Obama and Obama need to go!","commenter_a":"Both the schooling and the feeding of the children of the USA should remain at the local levels. We don't need an untrained fool to tell us how to raise our kids.","post_message":"Public schools are continuing to serve the federally mandated fruits and vegetables, but a new study claims the fresh produce is going into trash cans more than tummies."},{"comment_id":"10153519311713984","commenter_b":"you do see there is a white girl sating beside her and a couple of white boys with phones videoing they need to have there butts kicked","commenter_a":"This president is ramping up the racial discord for a reason, and it's not going to be good.","post_message":"A white woman was holding her toddler and minding her own business... but then this black teenager saw her and did something awful. The entire scene was caught on video... can you guess why Al Sharpton isn't saying anything about this?"},{"comment_id":"1096146180493131","commenter_b":"Mexicans showing their little dicks. Their penis's are as big as a Mexican pepper. Will see who kisses of illegals your asses are grass.","commenter_a":"Trump","post_message":"CITIES TELL TRUMP to KISS OFF @webpagelink"},{"comment_id":"542586789241125","commenter_b":"Get off drugs!!! Our economy would crush!!","commenter_a":"Trump is not dropping out you idiots. The best you can hope for is Trump/Carson ticket.","post_message":""},{"comment_id":"971595456226551","commenter_b":"there is a problem with a Black man being president and not standing for a black man, or a white man!! but only standing for illegals and Terrorist!!! thats what should be bombed!!! leave white babies or any babies out of it!! SPILLING INNOCENT BLOOD MAKES YOU JUST AS LOW AND WRONG AS WHAT IS HAPPENING NOW!!!","commenter_a":"I will gladly Kill you for the White Nation!!!","post_message":"(Audio) A war cry... @webpagelink"}]
