[{"comment_id":"10156622282140354","commenter_b":"Al Sharpton can kiss my all white hairy ass..","commenter_a":"AL SHARPTON---STILL FLAPPING HIS LIPS---HEY AL --Where were you when those three Black Thgs killes that 3 year od Black girl playing on her porch Christmas Day---oh thats right--there was no pay day in that one for you..","post_message":"Liberals are FUMING over these 2 tweets from Al Sharpton blasting liberal Hollywood hypocrites..."},{"comment_id":"10154528764136955","commenter_b":"TO ALL AMERICANS - PLEASE WAKE UP AND SMELL THE ROSES. Whether you like TRUMP or not, he is the only viable candidate. If you want all of the above to happen, the lost of 5 amendments to the Constitution that we all learned about in school and everything else she wants to do to put this country into the ground for her benefit only ( REMEMBER, SHE LIVES ON OTHER PEOPLE'S MONEY), we have to work hard for ours, then HILLARY is your girl. If you want the opposite, to save all our rights and freedom, more jobs, getting better and cheaper health insurance (UNLESS YOU WANT TO PAY REALLY HIGH PREMIUMS), a strong military should we ever need it, keeping the refugees out of this country (otherwise you will find them right in YOUR OWN BACKYARD), childcare for all working women (who make up 40% of the workforce), ...","commenter_a":"Lol Trump was winning anyway see yea dumas Hillary quacks","post_message":"PAPER: Dems should ask her to step aside..."},{"comment_id":"10154566603193645","commenter_b":"Most murders in US is commited by non Immigrant. Sandy Hook was by a mentally unstable person. Charleston commited by a Rasist unrepentant kkk inspite of the grace afforded him by the people he killed and their families. Florida commited by mentally unstable guy. The guns remain a major problem . Why is there no Presidential order banning guns. No NRA sponsored their election. Why ban muslims but allow christians. A a Christian myself I see this as very wrong. Saudi Arabia had 15 of the 19 killers of 911. Why is Saudi Arabia not included. Something is not right . I am Proud of the brilliant Judges. No one is above the Law.","commenter_a":"They should be thrown out and replaced. They can run for a political office if they want to push a political agenda","post_message":"BREAKING: A 3-judge panel just unanimously ruled against reinstating Trump's Muslim travel order. Do you support or oppose the court's ruling?"},{"comment_id":"10154306553151729","commenter_b":"'@username then you should be glad that we want to stay out of it, dumbass! Unless you want us to go back to our 1940s mindset and you won't have anything but a glass parking lot over there.","commenter_a":"They have been fighting over there for centuries. Stay out of it let them finish each other off.","post_message":"This is very serious folks."},{"comment_id":"10153271300604497","commenter_b":"Sadia","commenter_a":"Bmc Covert Joe Sanders","post_message":"'Mom and Dad are going to be thrilled when I bring literally anyone home to meet them.'"},{"comment_id":"10153248729158908","commenter_b":"Sharon Wilkshire","commenter_a":"Nancy Brown","post_message":"Coconut oil has many health, home, and beauty uses. This oil is a simple, easy, and inexpensive replacement for many commercial products that you may be using at home."},{"comment_id":"10155240461128984","commenter_b":"Wow Jim what a brilliant comeback. You most assuredly are a Democrat.","commenter_a":"Another average comment from your average Democrat. Together they all three have a collective I.Q. Of less than 70","post_message":"This is so sad. Our thoughts and prayers are with the family."}]
