[{"comment_id":"10153662620879877","commenter_b":"So that make it cool huh ? Betta keep close eye on ya little one bro ^^^^","commenter_a":"So you found people unconscious, didnt call an ambulance or anything you shot them . That's murder.","post_message":"Black Couple Killed by Police Were ‘Unconscious’ Inside Their Car When Officers Arrived. Watch what happened next below.   Grio fam, what's going on here? Seven children are now without parents..."},{"comment_id":"10154704981818812","commenter_b":"Shut up Ayesha","commenter_a":"NBA is rigged!","post_message":"U.S. men's basketball team earns gold for third consecutive Olympic Games and the sixth time in seven tries with NBA players."},{"comment_id":"431964536928587","commenter_b":"Sluts should be treated like people. So that's fine if you treat a slut 'like a slut' as long as you consider them people and treat them accordingly","commenter_a":"I don't understand the negative stigma behind girls being sluts. God Damnit, Men love sluts.","post_message":"Regardless of what a person wears, they are worthy of your respect."},{"comment_id":"10153397476831336","commenter_b":"What do we do when Hildebeast gets elected? She certainly has no opponent in Jeb.","commenter_a":"What he meant to say was this was another victory over the people of America","post_message":"President Barack Obama called today’s Supreme Court ruling on gay marriage “a victory for America.”"},{"comment_id":"10155973415020354","commenter_b":"Shame on you Fox. Personal feelings are so beyond this forum. You putzes might as well learn how to say, 'large sized or regular?'","commenter_a":"I'm for Ted all the way, but if Fox wanted to hurt trump it was a mistake,","post_message":"Trumpnado!"},{"comment_id":"1810739472541280","commenter_b":"Recount!! Recount!! Go girl! Hillary for president!!","commenter_a":"Will she be filing in the states won by Her?","post_message":"BREAKING---- Green Party Candidate Jill Stein Files for Recount in Wisconsin.... Where Trump won by almost 30,000 votes! Wow!"},{"comment_id":"10153838476451509","commenter_b":"We 'poor people' are richer than she'll ever be. Shallow, vapid tart.","commenter_a":"Grande opening, Grande closing. Hopefully her career.","post_message":"Security footage showed singer Grande appearing to 'maliciously lick' a donut in a shop: @webpagelink"}]
