[{"comment_id":"173468886485698","commenter_b":"Well...Bye!","commenter_a":"California says screw you USA, until they want something from the rest of us in the USA.","post_message":"Spread this everywhere!"},{"comment_id":"1275227535851049","commenter_b":"she can go back to sleeping with cruz! lol","commenter_a":"When he loses, I hope this woman just disappears into obscurity, and gets to feel what it's like to be left behind by Trump. She's an ignorant tool.","post_message":"She had a meltdown after the host repeated Trump’s words verbatim."},{"comment_id":"10152823238956130","commenter_b":"Women graduate at a far higher rate than men. From high school and college.","commenter_a":"And no the factors you listed clearly are important, not to discussing what wages should be, but to the discussion of why wages are not equal. Data clearly shows the problem is economic insufficiency, regardless of there being widespread discrimination. So we could make more progress closing the gap by everyone getting a better education (even at the library or online if you know how to source good) building your own successful business, or something innovative.","post_message":"This is what the wage gender page gap looks like."},{"comment_id":"991088854247496","commenter_b":"It's about time we had somebody who will stand up and speak the truth!","commenter_a":"Who determines what is Polically Correct? The liberals trying to manage free speech.","post_message":"WATCH: The Donald gets into a heated exchanged with a member of the PC police at press conference."},{"comment_id":"10154655136218984","commenter_b":"Makes you wonder why she's riding in a van! Not very comfortable and certainly not presidential.","commenter_a":"Not a Hillary fan but have you ever tried getting out of one of those van back seats?","post_message":"There's some new footage of Hillary Clinton making the rounds, and it's exactly what her campaign does NOT want America to see. Here's what happened to Hillary when she tried to get out of a van.  This confirms a lot of things that we'd feared about the Democrat nominee..."},{"comment_id":"10153910519885695","commenter_b":"What a pig.","commenter_a":"He should be castrated .","post_message":"Jared Fogle's attorneys asked a judge for leniency, saying he is 'profoundly sorry.'"},{"comment_id":"895114997196955","commenter_b":"Your mother is a rat","commenter_a":"for press tv and iran the houthi rebels who tried to overthrow the govt are not terrorists. Instead the forces fighting houthi rats are terrorists. and iran claims to be a democracy. wtf","post_message":"Saudi warplanes airdrop weapons to militants in #Yemen  Read more: @webpagelink"}]
