[{"comment_id":"10153537278823984","commenter_b":"Women in that cult are beaten and stoned and daughters married off at nine. Honor this way of life????","commenter_a":"Emperor PINOCCHIO is trying to make his MUSLIM brothers happy!","post_message":"News of this has been met with sharp criticism by many.   Do you believe the military is enforcing policies hypocritically?"},{"comment_id":"944666172296302","commenter_b":"She's has a mental illness","commenter_a":"At this point she's coming across as delusional and totally disingenuous.","post_message":"“It means that I have really gone there with the experience in terms of being a mother with two black sons.\"  -Rachel Dolezal on being black"},{"comment_id":"364748327062015","commenter_b":"get rid of her","commenter_a":"You just can't fix STUPID !","post_message":"Nancy Pelosi says Math is Hard  Can Understand the Difference Between a Funding Hike and a Funding Cut"},{"comment_id":"10153611499316955","commenter_b":"Dumb broad should have to eat it herself before feeding the garbage to our kids.","commenter_a":"Good! If you eat what she eats you might end up looking like her!!!!!","post_message":"Students celebrate as school drops Michelle O lunch rules..."},{"comment_id":"1797347700498169","commenter_b":"If a cop ask you multiple times to put your hands where I can see them you do it!","commenter_a":"How you raise a black son in America? Tell them not to break the law and do what a cop is telling you to do. That's how","post_message":"It's an important question, without easy answers."},{"comment_id":"10153223251130329","commenter_b":"What a nasty bitch.","commenter_a":"Wow that Katie chick is a bitch.","post_message":"Awesome."},{"comment_id":"997942853639367","commenter_b":"Shut up ! this is ridiculous ! I refuse to allow illegal immigrants to pour into this country.","commenter_a":"Yes","post_message":"Seattle Mayor Murray, officials and advocates are holding a press conference in response to President Trump's executive orders on immigration.  Do you think Seattle should remain a sanctuary city?"}]
