[{"comment_id":"10152505089467434","commenter_b":"So feminism is bs cuz this guy is an a-hole?","commenter_a":"Jefferson owned slaves, Ayn Rand's life was full of contradiction ... ideas are not contingent of the righteousness of the persons life, they are objective concepts.","post_message":"A knowledge of feminism doesn't always translate into expressions of feminist ideas."},{"comment_id":"10153669606379060","commenter_b":"@username - my point is that Germany is too influenced by its past, too ready to apologize for its past. In the 90s, the extreme right-wing Republikaner and the DVU gained in support because of this blind open-door policy. What is more, Germany expects other EU countries to do the same, irrespective of the cost. I say that this has to stop.","commenter_a":"The Germans typically let in loads of war refugees. More than they can handle. It's their way of apologising for World Wars 1 and 2. In the 90s, they let in 320,000 war refugees from Yugoslavia. What happened in German towns ? Property rents skyrocketed and the crime rates went right up. What's worse, the Germans expect every other country to do the same. Whacky open-door immigration. The UK needs to leave the EU, get sovereignty over its borders and immigration / refugee legisation back and tackle the problem as a single nation. This time, the Germans are letting in 800,000 war refugees from Syria. Absolutely crazy.","post_message":"Ever since Angela Merkel took the lead on the migrant crisis, critics began speaking as though she created it. This is nonsense"},{"comment_id":"988494927933952","commenter_b":"SEND THE MUTHA-FUKA BACK TO SYRIA WITH ALL OF HIS WIVES AND A FEW WELFARE WOMEN AND THEIR CHILDREN.","commenter_a":"Hell no tell him to get a job","post_message":"How do you say, 'Kiss my ass' in Farsi? Check this crap out. @webpagelink"},{"comment_id":"10152594766464071","commenter_b":"Why do men think big boobs mean fat?","commenter_a":"Don't be fat. Problem solved.","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."},{"comment_id":"1252562101428763","commenter_b":"Pathetic. She should be charged like a criminal .","commenter_a":"Illegaly gotten fees and she gets a bonus?","post_message":"It's a disgrace that while millions of Americans were defrauded by Wells Fargo, the executive in charge of running a scam received a $124 million bonus."},{"comment_id":"10154194014766509","commenter_b":"*you're *themselves","commenter_a":"Why should everyone else have to be exposed to a trans person using the opposite bathrooms and locker rooms? If a person feels they are the opposite sex, get the full operation.","post_message":"The district has one month to provide access or they will lose federal funding."},{"comment_id":"10153656979036130","commenter_b":"I go, \"You know I had pulled a gun on a white girl...\" She goes, \"I knooooow!\" She got her white privilege isn't real wake up call! You know white girls LOVE to call the cops. When the cop didn't do anything and believed the guy she lost it! Long ass Facebook post! Lmao!","commenter_a":"You never hear Asian, Hispanic, African American, or any other race of men crying over the second amendment. One group only.","post_message":"The legislation mostly targets specific kinds of semi-automatic firearms -- such as AR-15s and AK-47s -- and large-capacity magazines, and adds certain registration and licensing requirements."}]
