[{"comment_id":"10153481340240575","commenter_b":"This should be a crime!!!!! Go to hell!!!","commenter_a":"This is a BLACK DEVIL HE NEEDS TO BE EXTERMINATED!!!!!","post_message":"The Gateway Pundit - Farrakhan Shouts “Allahu Akbar!” and “White People Deserve to Die” In Latest Sermon (Video)"},{"comment_id":"10153744028791178","commenter_b":"WHAT!!!! She's the one that should b in jail","commenter_a":"She needs to go to jail.","post_message":"I'm not sure you can send people to jail for this..."},{"comment_id":"1729905883960126","commenter_b":"That's ridiculous! Stupid woman","commenter_a":"As abreast feeding mother of two.................... She's crazy!! Get organised for Gods sake!!!","post_message":"She was breastfeeding her son in the pool while the wave machine was on"},{"comment_id":"1099293306823253","commenter_b":"Are you Serious ??/ \"You can keep your doctor \" LIAR Caliphate!","commenter_a":"The Classy president!!. The other side can run there collective mouths about things they have know idea about!!. ignorance is running wild in a America!!!.","post_message":"Gallup approval ratings show that President Obama is the most popular second-term president in recent history. Do you approve of the work Obama is doing in office?"},{"comment_id":"10153238960151438","commenter_b":"Ok clark. You win. All lesbians are fat hairy and ugly. That is completely accurate. No bullshit. You are a really smart person. So glad we had this talk.","commenter_a":"why are most queer women obese now thats a question","post_message":"Why don’t queer women flirt with other queer women?"},{"comment_id":"1738314809766910","commenter_b":"She should have moved here...we don't know who she is","commenter_a":"no matter what happened, she is the one who took the decision (??!) to take her own life. Unfortunately, she seemed a desperate and lost soul...","post_message":"Screenshots and soundbites from the video were mocked by Italian social media users and YouTubers."},{"comment_id":"10154130696774087","commenter_b":"PRAYING JUSTICE PREVAILS...After hearing about Obama using a fake name to communicate with Hillary on her unsecured personal server, it explains why Hillary was given a pass and never indicted. Their corruption is as thick as sewage all the way to the top of the White House. This is unacceptable. \"Deplorable\" is Hillary and Obama. Hillary and Obama for prison... Donald Trump for President!! Hillary is not an option... ##TrumpPence'16","commenter_a":"The GOP spent millions of our taxpayer money, and they proved that Hillary was blameless for the response to Benghazi. Just wait, the GOP might just open up yet another wasteful investigation. :D","post_message":"“What Hillary tried to set up and what they apparently spent months preparing is an ambush as false as Benghazi,” Newt Gingrich said."}]
