[{"comment_id":"10153260664437885","commenter_b":"Phuck that man cunt.","commenter_a":"I thought traitorous dogs got shot!","post_message":"Not a DuffelBlog....this is real"},{"comment_id":"452057048331142","commenter_b":"I'm in love I think! She hit the nail on the head.","commenter_a":"You tell'em Grans....","post_message":"Race-Baiting CNN Host Is Shocked At Grandma Answers To His Questions:  is no such thing as  privilege' [VIDEO]"},{"comment_id":"10152946576794099","commenter_b":"doesnt matter, she is still an adult","commenter_a":"i worked the front desk at a college dorm and i cant tell you how many times ive had mommy's call and ask me where their child is because they didnt answer their phone. shes 19! give her a break.","post_message":"A Connecticut teen who was reported missing after going out with a man she met online has been found safe, police say @webpagelink"},{"comment_id":"10154002938919749","commenter_b":"Cindy Rhodes go do one stupid cow feminists are scum","commenter_a":"If your still hung up on feminism within the uk and the us then you need to develop your personality. Not your discrimination skills.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1728040457449467","commenter_b":"She is bad to the bone","commenter_a":"She is bad to he bonem","post_message":"“Here’s Hillary Clinton campaigning in favor of women, while the foundation that she and Bill own pays men 38% more than women.”  Newt Gingrich shared some shocking statistics with Sean Hannity regarding the Clinton Foundation."},{"comment_id":"838659359573185","commenter_b":"DON'T LISTEN TO THE DUMB BLACK BITCH","commenter_a":"Bigot","post_message":"Oprah: ‘If You Hate Obama You Are Racist, If You’re Racist You Must Die’.  She is the racist.  Do you think Oprah is a bigot?"},{"comment_id":"1756313234607564","commenter_b":"Hillary the Corrupt Witch Bitch !","commenter_a":"#NeverHillary!","post_message":"***UNPRECEDENTED CORRUPTION***"}]
