[{"comment_id":"10153050855917452","commenter_b":"Sound like she listening to Future lol","commenter_a":"Lmao wtf","post_message":"A suspected car thief got out of the vehicle and started dancing in the middle of the street after leading police in a wild chase through downtown Los Angeles. @webpagelink"},{"comment_id":"10154009145851336","commenter_b":"She needs to rot in hell","commenter_a":"Problem is she's been in the public eye for way too long!!!","post_message":"“She is a good, smart, tough person who cares deeply about this country, and she has been in the public eye for a long time and in a culture in which new is always better,\" President Barack Obama said about Hillary Clinton. Do you agree?"},{"comment_id":"10154103250631756","commenter_b":"\"Are ya goin' ta prison like my maw??\"","commenter_a":"\"Are you goin' ya prison like my maw??\"","post_message":"Cuteness abounds, but so do questions about whether the kids are plants."},{"comment_id":"991037997658085","commenter_b":"Bitch didn't get cheated, she got outplayed. Sour grapes!","commenter_a":"The American people have had enough I being manipulated by candidates that don't know how to quit when they're beaten. Hey Idon't know where thus 2nd ballot thing comes from but they better knock it off before they a billion pissed off Americans !!","post_message":"CRUZ POACHES NEARLY ALL AZ DELEGATES Jan Brewer: 'I Got Cheated!'..."},{"comment_id":"683830911775006","commenter_b":"WHO CARES!!!!!!!!!!!!","commenter_a":"So she is smart good for her.","post_message":"People are freaking out over what's being said about Taylor Swift today..."},{"comment_id":"10153218753159270","commenter_b":"God will deal with this! He did it once.","commenter_a":"But your only going to enforce Christians to marry gays, but muslims can do whatever they want?","post_message":""},{"comment_id":"10152826258466051","commenter_b":"I hope the bitch gets life","commenter_a":"Got what you deserve","post_message":"First she stole this cancer-stricken man’s dog. Then she had him euthanized."}]
