[{"comment_id":"10153153941377507","commenter_b":"fuck her","commenter_a":"Who is this boob! Facts are facts!","post_message":"The last thing we need is a news outlet telling seniors that their Social Security isn't their money. We need to expand it - not cut it. Sign the petition if you agree: @webpagelink (via Snarky Pundit)"},{"comment_id":"10154624761426336","commenter_b":"What a dumb woman...","commenter_a":"Its her policy that allows these people in our country to kill us.","post_message":"Hillary Clinton addressed the latest bombings in New York City and New Jersey and emphasized that Donald J. Trump's comments are being used to recruit terrorists. @webpagelink"},{"comment_id":"10152899242557144","commenter_b":"Illegals Charlotte, illegals.","commenter_a":"\"We\" need to take care of our country first. We still have veterans dyeing before they get an appointment. Don't tell me about Mexicans.","post_message":"Wow."},{"comment_id":"1411629742215405","commenter_b":"She is nothing but a stinken trouble maker, kick her behind out of our country","commenter_a":"This fk needs to go","post_message":"Socialist Seattle City Councilwoman Kshama Sawant said activists should demand the mayor use local police to block Immigration and Customs Enforcement agents. Read both sides [here: kiro.tv/SawantOnICE] and tell us what you think: A. Yes, we need to hold ICE accountable B. No, police are needed for all protests C. We need a solution, this isn’t it. D. Wait, what? E. (Enter your own answer)"},{"comment_id":"10154208723663984","commenter_b":"The Clinton's are the world's greatest LIARS and they do not give a Damm about you fools who will vote for her ,this woman is a evil woman , but her sheep are if the dumbest people in this country.","commenter_a":"Boy, the \"free\" press keeping her back. Boy, they do the same for the Republicans, the only difference they erase the good comments.","post_message":"A CBS reporter asked Hillary a question about the Brussels attack, but then after she said this 1 thing they IMMEDIATELY cut her off and cut to commercial. This is absolutely nuts."},{"comment_id":"10153602906656509","commenter_b":"You can buy them too.","commenter_a":"I think she means she wants to make a lot of money. Those GEDs aren't cheap.","post_message":"Is America ready for #marijuana moguls? Follow one young couple's journey as they attempt to franchise legal marijuana @webpagelink #HighProfits"},{"comment_id":"10154493541114060","commenter_b":"Karolina Kulewicz yeyeee","commenter_a":"Congrats Daniel your city came second again! No shame in being runners up 😂😂","post_message":"1. Melbourne 2. Vienna 3. Vancouver"}]
