[{"comment_id":"198765370606154","commenter_b":"Bye Bye!","commenter_a":"Also you suck at acting","post_message":"George Lopez is still angry about the outcome of the presidential election. Let's make 200,000 #SHARES if you Never want to see Lopez Again !!!!"},{"comment_id":"10153409489988010","commenter_b":"AIR COOLED vs. WATER COOLED. Not all motorcycles are designed alike. Bikes also have a tendency to overheat in higher/hotter temperatures.","commenter_a":"I've heard a common argument in favor of lane-splitting from motorcyclists that it's a necessary practice due to the lack of cooling on motorcycle engines. To avoid overheating, motorcyclists cannot sit idle very long as automobiles do. I've always wondered what the full truth is behind that.","post_message":"Motorcycle lane-splitting — the rush-hour time saver for bikers that enrages many drivers — may be poised for formal legalization."},{"comment_id":"10153246589888445","commenter_b":"I hope all these dumb fucks on her get arrested by the feds no one wants your dirty swag bitch","commenter_a":"Haha don't worry we got your back here in co haha oh and water","post_message":"NEW: California Wildfires Are Affecting the Pot Industry."},{"comment_id":"10152694335031094","commenter_b":"^Calls other women whores^","commenter_a":"Anti-science lunatics...UGH!!!!!!","post_message":"The federal government has confirmed more than 100 people across 14 states have now developed measles. Will state governments respond by rescinding personal belief exemptions for parents who choose not to vaccinate their children?"},{"comment_id":"639140816274210","commenter_b":"Just like your whore mother.","commenter_a":"She is a pig.","post_message":"I am sick and tired of Michelle Obama and her family in the White House...GET OUT!"},{"comment_id":"654122978061007","commenter_b":"I know you do","commenter_a":"Omg I want to hold one!!! @username","post_message":"PANDAMONIUM: 4-month-old giant panda cubs at The Toronto Zoo are learning to walk."},{"comment_id":"10150520498839999","commenter_b":"Sick woman. Sigh.","commenter_a":"WHO CARES","post_message":"The Rev. Dr. Martin Luther King, Jr. would be 86 today.   Photo: George Tames/The New York Times"}]
