[{"comment_id":"10153366601141770","commenter_b":"Where is our freedom of speech??? Keep your rioters away from TRUMP! You all send them with your lies of deceit...so you can have business as usual in Washington! We Americans see right through you...the uneducated don't...or the naive youth..","commenter_a":"what happened to freedom of speech? trump had nothing to do with the violence at his rally in chicago these were paid punks to not let him speek","post_message":"Mitch McConnell told reporters he and Donald J. Trump spoke by phone Tuesday and he encouraged the New York businessman to “condemn” the “violent expressions” at some of his political rallies."},{"comment_id":"1494929760811093","commenter_b":"Isis isn't islam... Hahaha okay","commenter_a":"If Islam is a peaceful religion why is every Muslim country in turmoil and its citizens are totally controlled by the Imans and the Koran? Don't believe the lies of political correctness.","post_message":"\"Before you say, 'War is what ISIS wants,' realize that's simply an argument for inertia and putting off the inevitable. Does that make me a war-monger? Sure. It also makes me a global survival-monger.\" Last night on \"The Greg Gutfeld Show,\" Greg Gutfeld said radical Islam needs to be countered with \"radical Americanism.\" @webpagelink"},{"comment_id":"693471650843413","commenter_b":"Yes they should be deported!","commenter_a":"Yes it should!!!","post_message":"Unbelievable fate for this liberal that disrespected our flag. This man will never be the same. Should burning the flag be grounds for deportation?"},{"comment_id":"10158120208050557","commenter_b":"You attempting to make this about ME, so as to DISTRACT from the FACTS, TRUTH and REALITY, is a very \"cute\" little trick, implemented by YOU and so many others, who comment on this page.","commenter_a":"The PRICKTATOR's is at it again. If you're not concerned yet, you're either brain dead or a complete idiot.","post_message":"President Donald Trump fired acting Attorney General Sally Yates Monday night for refusing to enforce a legal order designed to protect the citizens of the United States, the White House said."},{"comment_id":"10154178335409877","commenter_b":"Well said Jillian. I too believe that BLACKLIVESMATTER! It's not right, it is unacceptable !! We are al the same inside, under the skin of all people. There is only 1 race. The HUMAN RACE, period!! The more that speak out the louder we are!! And I believe this to can CHANGE!","commenter_a":"Enough is enough","post_message":"So, so tired. #TerenceCrutcher"},{"comment_id":"574676589404983","commenter_b":"What a stupid bitch","commenter_a":"She should have seen that nazi meathead Trump fan telling Mexican protestors to make him a burrito. Way more uncivilized than what's happening here. What a stupid statement.","post_message":"She should have seen the \"uncivilized\" civil rights sit-ins that won her the right to be on Fox News."},{"comment_id":"10153359842468984","commenter_b":"Love it .. Good for the Bitch /Bastard","commenter_a":"You can go to hell leave us alone. We don't care what you call it marriage is one man and one woman.","post_message":"You knew this was coming..."}]
