[{"comment_id":"10153635584924575","commenter_b":"What about rap videos or BET...come on people","commenter_a":"All them white girls in one video.....thats RACIST","post_message":"A University of Alabama sorority has taken down a recruitment video after receiving a lot of criticism. One website described it as, \"Stepford Wives: College Edition. It’s all so…unempowering.\""},{"comment_id":"577283422434663","commenter_b":"Sandra Skolnik THE HILLARY VOTER ARE ,MUSLUMS ,ILEGAL IMAGRANTS, PEOPLE LIVINg in other countrIES silly woman that dont follow other candadits SO HOW DO THEY REALLY KNOW WHAT IS GOING THE WOMAN NEEDS TO BE INCITED SOON","commenter_a":"I'm starting to #FeelTheBern! Bernie Sanders has been consistent with his message throughout his career from climate change to #LGBT rights. @username not only voted in favor of the Iraq war but she also played a large role destabalizing the Middle East in Libya and Syria as Secretary of State. I hope New York, California, Pennsylvania and the remaining states get out and vote for Bernie Sanders before the FBI indicts @username over her mishandling top secret information on her private server. We need honest leadership not warmongers who destroy entire nations with irresponsible policies. Vote for peace! #FeelTheBern #BernieSanders2016","post_message":"It's understandable that Americans are angry. But instead of inciting violence, we should talk about how we’re going to address the challenges we have."},{"comment_id":"10152629454892894","commenter_b":"She mad @username don't believe that hoe","commenter_a":"Aliah Tamartian Trainer Toi Magee-Taylor","post_message":"Coupled Up? Keke Palmer & August Alsina are Ridin' Around & Gettin' It [Photos]"},{"comment_id":"10155992640990354","commenter_b":"They are none good roll models..they don't need these women as anything but singers..and you need to make sure they are dressing like hos..cause thats what all little girls seem to want to dress like..it's to late anyway..all of us have allowed them to face a world thats gone insane..they wont be in a world like we had..it's over..they will have abortion..hate..sex that kills..and men cutting off their heads and men raping them...so keep worrying about music..clothes..fingernails..princesses..and cutey stuff...they are doomed...and we let it happen.","commenter_a":"Taylor Swift is a good role model. Myley Cyrus is NOT a good role model. Taylor Swift writes and sings her amazing hit songs. What does Mylie Cyrus do? Sing and not good at all. My girls love Taylor Swift!","post_message":"Which is worse: Kiss Kiss or Bang Bang?"},{"comment_id":"554679601385273","commenter_b":"Just look at that fugly face! Barf","commenter_a":"What an ugly dude!","post_message":"Of course Sally Kohn brought up white privilege..."},{"comment_id":"10153217406773812","commenter_b":"You dont seem like the kinda girl that could shoot a dog more the poisening type.","commenter_a":"Nope nope nope. A dog bites my kid and he's lucky to die by gun.","post_message":"Man charged after shooting, killing family dog that bit 4-year-old boy: @webpagelink"},{"comment_id":"1214139651951673","commenter_b":"What a crock! Mr Trump is not a racist","commenter_a":"Sorry Jake but this isn't just about your skin color.it's also about a economic plan which the republican party has that is unfair. A foreign policy that won't work. -just about any plan they come up with is for the upper class.about much more than just you.","post_message":"18-year-old Jake Anantha was a Donald J. Trump supporter until he was kicked out of a rally. Anantha says he was being \"profiled\" and wants an apology. Watch more here: @webpagelink"}]
