[{"comment_id":"10153789765316770","commenter_b":"All for it don't need to spend our hard earn money on racists black bastards that haven't Done anything for our country America ! ! ! But disrespect our American laws our American Flag and our national anthem along with discriminating against white Americans and our American Veterans","commenter_a":"Boycott all nfl games and their sponsors.","post_message":"If they thought their fans would blindly go along with any insult to their country, they were sorely mistaken..."},{"comment_id":"1042018525819158","commenter_b":"This ladies dumb AF","commenter_a":"It should have been there when it could have helped my husband before he died. It doesn't matter much now whether they develop it or not. It can't help him now.","post_message":"A breath test for lung cancer could be on the horizon."},{"comment_id":"1234949299869862","commenter_b":"Really irritate me how she copies her speech","commenter_a":"Better to repeat the inteligent words of an inteligent woman, than stupid words of a stupid husband! Since an empty head isn't capable of producing words of her own!","post_message":"Listen to Melania Trump's speech last night vs. Michelle Obama's speech in 2008 @webpagelink"},{"comment_id":"10152634683050779","commenter_b":"Could be great, i hope so.","commenter_a":"Woohoo!!","post_message":"In a stunning announcement today, Blur have revealed plans to release their first new album in over a dozen years, titled 'The Magic Whip.' UPDATE: Click through to listen to the new song \"Go Out\" and see the track list for the album."},{"comment_id":"10154357788051509","commenter_b":"Escape to Germany or Sweden for safety?! Really?! Do not keep up with the news? Germany and Sweden have been taken over by the same Isis loving Muslims that killed this woman! There is no safe place for Arabic women to go to as long as Arabic men are around.","commenter_a":"There goes a girl who did not leave her country to reach Germany or Sweden for safety and fought as best as she could...she got executed for her tweets about life in Raqqa... Now you know what refugees who are labelled as \"cowards\" \"parasites\" \"are escaping from.","post_message":"She wrote about life under ISIS rule with humor, sadness and a glint of hope."},{"comment_id":"10154536419509087","commenter_b":"Jolie should worry about fixing her house first..","commenter_a":"Some day in history Freedom of Religion will meet the crossroads. How will America defend itself from enacting Shari Law?","post_message":"“Shutting our door to refugees or discriminating among them is not our way, and does not make us safer,\" Angelina Jolie said. “Acting out of fear is not our way. Targeting the weakest does not show strength.\""},{"comment_id":"937892139587360","commenter_b":"OF COURSE democrats WANT illegal aliens to vote. This would give them a VAST majority for all future elections. If this were to happen, the America that we know would cease to exist. ALL American citizens, regardless of party affiliation, must prevent illegals from being allowed to vote.","commenter_a":"What do expect it will help them to continue getting their freebies!!","post_message":"More than half the voters who identified themselves as Democrats in a recent Rasmussen poll said they believe illegals should be allowed to vote. Among all voters, more than one in three believes illegals should be allowed to vote. What do you think? @webpagelink"}]
