[{"comment_id":"1713956375559891","commenter_b":"I think ladies should have control over their bodies but what if your mama aborted you","commenter_a":"Bravo Guttier","post_message":"This is AMAZING. The ending is the best part. Share if you agree with Congressman Luis V. Gutierrez and give his page a LIKE! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"916443248422431","commenter_b":"Wow what a bitch!","commenter_a":"@username sad","post_message":"SMH: Mother Tries To Abandon Her Son In The Street!"},{"comment_id":"10153637396193854","commenter_b":"He is a idiot and a monkey like that wife of his both ugly as sin he want be there much longer they have signed impeachment papers","commenter_a":"GO TO HELL","post_message":"Under Obama, U.S. Army Orders Soldiers To Scrape Bible Verses Off Their Rifle Scopes…"},{"comment_id":"10150676513679999","commenter_b":"You're right @username, when I bought my Yankees jersey, I bought the Rivera one. Best closer ever.","commenter_a":"Nothing like the Yankees of my childhood. Subway series, tino Martinez, Alfonso Soriano, David justice, pettitte, Bernie Williams, posada and jeter. It won't ever be the same.","post_message":"The New York Yankees are knocked out of the playoffs after losing, 3-0, to the Houston Astros in a wild-card game."},{"comment_id":"10154173812304205","commenter_b":"As long as she keeps getting elected, she wont feel the need for change!","commenter_a":"If she was a basketball coach, she'd be fired. Continue to work for your district in CA, but someone else from another part of the country like for example a representative from Wisconsin or Michigan should lead. The Democrats are pussies.","post_message":"Nancy Pelosi wants to assure you that everything is fine in the Democratic party. She is wrong."},{"comment_id":"10153456483261051","commenter_b":"I suggest you keep your bitch ass on the internet @username. You don't want to handle it in person.","commenter_a":"Most of the commenters here are transphobic scum. I hope none of you end up with a transgender child.","post_message":"This man handled his child’s funeral arrangements. When her friends showed up and looked inside the casket, they couldn’t believe their eyes."},{"comment_id":"10153509665060950","commenter_b":"I'm sorry but that doesn't even sound right. The solution that they put the fetus in does not destroy it. If that was the case every placenta, product of conception, etc, would be destroyed! Most product/tissue that comes from one's body goes into some sort of formalin. And about them giving you back tissue/poc, that will never happen. I don't believe any hospital will be like oh here, you can have your 19 week demised fetus. It's not going to happen.. That's like saying you want your uterus when they take it out. Someone told you a load of crap if that is really what transpired.","commenter_a":"I find that hard to believe. They have protocols to follow when it comes to medical waste. Right? (I honestly believe they do)","post_message":"The woman claims as she screamed for the employee to stop, she could see the face of her child as it was flushed."}]
