[{"comment_id":"10153089934495329","commenter_b":"Nasty ass hoe lol","commenter_a":"Dude this is so fucking ugly @username @username","post_message":"NSFW, obviously."},{"comment_id":"10156348163835354","commenter_b":"This is exactly what we need..someone to shake up the illegals..make them realize that they cant stay here..these officials are part of the problem ..trump isnt crapping on latinos..he jist wants them to be here legally..obama and past administrations have turned their heads and not dealt with..we have a big problem now...go trump","commenter_a":"Really that is a bunch of nonsense! They would only be fearful of someone enforcing the Rule of Law for ALL... IF they have broken any laws. Anyone here legitimately -- they have nothing to fear at all! This Hispanic Lawmaker is sounding a false alarm! Instead of defending illegal aliens he should be working to improve the lives of the citizens and legal constituients he represents. Why is he working so hard to help those who do not belong here but doing nothing for those leagally here that needs the job he's allowing the illegals to stay at?","post_message":"“Mr. Trump’s racist remarks and his continued rhetoric demonizing Latinos and immigrants has created fear within these communities around the country....\""},{"comment_id":"10153673793456336","commenter_b":"Please don't find your way to StL!","commenter_a":"That is great, she prolly is afraid of going to prison!! She is about as racists as they come, she showed her true colors!!","post_message":"Breaking News: Baltimore Mayor Stephanie Rawlings-Blake announced Friday that she will not seek re-election.  @webpagelink"},{"comment_id":"10154203393907994","commenter_b":"Cut their dicks off.!!","commenter_a":"Wow","post_message":"THIS JUST IN: Police have released a picture of the second man wanted in the abduction and rape of a woman from a Walgreen's parking lot. Police say the two drove around and took turns raping her. More info:"},{"comment_id":"988941504498931","commenter_b":"@username c'est beau...","commenter_a":"@username Let them","post_message":"'I love you, wait for me, I'll be there soon'"},{"comment_id":"10153785801499087","commenter_b":"U also allow rapist into the country everytime people born.","commenter_a":"Trump wants to protect Americans. Hillary wants to allow in illegals, including rapists, in exchange for votes. Who's the monster again?","post_message":"\"We are hearing some divisive and dangerous rhetoric in this election. We have a candidate who wants to tear families apart and forcibly deport 11 million undocumented immigrants, who calls Mexicans rapists, who talks about banning Muslims from entering the country,\" Hillary Clinton said in a new video."},{"comment_id":"10153996676511770","commenter_b":"Her hips are way way too big. She just looks out of proportion","commenter_a":"Fat and ugly wannabe!!! Hope she is going into psychiatry!","post_message":"Do her steamy Instagram photos cross the line?"}]
