[{"comment_id":"10153775506759203","commenter_b":"'@username Look over this list....Drugs & guns to YOUR front door, so tell me again how gun control works!!!! @webpagelink","commenter_a":"Gun bans have always had the same effect once implemented: none. They do not create a (sustained) period of increased murders, nor do they reduce the rate of homicides.. @webpagelink","post_message":"'We can toughen background checks and stop the sale of firearms to folks who have a violent history or history of mental illness.'  Amy Schumer"},{"comment_id":"1673680616215825","commenter_b":"Stop letting this mother fucker control our future","commenter_a":"Nope","post_message":"Obama Gives 1.5 Billion Dollars To Muslim Brotherhood For THIS SICKENING Reason.  This shows you where his allegiance really lies.  Do you think Obama is a traitor?"},{"comment_id":"10154394638207042","commenter_b":"Christianity in mind? But what Christianity type of Christianity was happening through the genocides..? Lol never been to prison or even arrested but thanks for the weak statements 😁","commenter_a":"Crosses don't belong in public spaces much less public institutions. If you truly believe in your faith, symbols and manmade objects shouldn't matter. Actions and kindness to your neighbors should be more than enough of a display.","post_message":"CROSS COVER-UP: After one family's complaint about a cross displayed on a public school in Staten Island, it was covered up. Now, a community is outraged.   Do you think it should have been covered?"},{"comment_id":"585591074975467","commenter_b":"He must be some form of illegal alien. Where do orange people come from?","commenter_a":"Prepare for 4 years of unrelenting mocking until you take this job seriously and treat people with respect","post_message":"Trump is such a crybaby..."},{"comment_id":"538972829636804","commenter_b":"Stupid lady","commenter_a":"I don't anything about this conflict, and it seems like this woman is being pretty rude. However, it is also true that anyone living in this country should be speaking English in their public lives.","post_message":"'Speak English, b****. It's America. Put me on YouTube.'  What starts as an argument over a dog quickly escalates into a vicious tirade about language, nationality and entitlements. Now this parking lot rant, seen by millions, is quickly going viral. Why it's touching such a nerve. @webpagelink"},{"comment_id":"10152899941331336","commenter_b":"Sick woman","commenter_a":"This young lady will burn in her afterlife.","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."},{"comment_id":"1795749220655470","commenter_b":"The point is assult rifles are banned already....","commenter_a":"Too bad what you carried in Iraq was a selective fire M4, not a semi-auto ArmaLite rifle, you can't teach common sense, but you can at least know the difference between an Assault rifle and a AR-15","post_message":"I know assault rifles. I carried one in Iraq. They have no place on America's streets. #Orlando"}]
