[{"comment_id":"1098675453532382","commenter_b":"I don't need to see his return. But I do need to see killarys medical records. She's a wack a doo","commenter_a":"Go Trump 2016","post_message":"WATCH LIVE: Donald J. Trump addresses police shootings, claims America needs a 'national anti-crime agenda.'"},{"comment_id":"889809641117643","commenter_b":"We have a pussy in the White House who will do nothing to protect our service members!","commenter_a":"How many people in this thread actually read the article?","post_message":"The crew of two small Navy craft are being held by Iran."},{"comment_id":"10153200627856130","commenter_b":"She is to good for him","commenter_a":"Hence the \"quiet moment\" part of that headline. Gotta be all up in everyone else's business.","post_message":"The estranged couple were photographed sitting on a beach step outside their Baker's Bay private resort on July 3."},{"comment_id":"785803421556302","commenter_b":"GREAT!!! MAKE HER LIVE BY OUR LAWS!!!","commenter_a":"Yes sir jail or take that crap off , its disrespectful !!!","post_message":"Judge Throws Muslim Woman In Jail For Refusing To Remove Headscarf In Court. If you can't obey our laws, you go to jail. Do you think she had this coming?"},{"comment_id":"10153910519885695","commenter_b":"What a pig.","commenter_a":"He should be castrated .","post_message":"Jared Fogle's attorneys asked a judge for leniency, saying he is \"profoundly sorry.\""},{"comment_id":"937622143000705","commenter_b":"She can't win.","commenter_a":"Republicans are in total disarray! Hillary 2016","post_message":"According to the Washington Post, the four recent resignations have “gutted the core of Carson’s apparatus and left the 63-year-old first-time candidate with only a handful of experienced advisers.”"},{"comment_id":"10153699809290496","commenter_b":"Haha their wives might...lol","commenter_a":"As long as they bring home the gold, who cares??","post_message":"Three members of Team USA basketball reportedly ended up in a high-end brothel, but it was an apparent misunderstanding: @webpagelink"}]
