[{"comment_id":"10153071705477093","commenter_b":"^ Alex I almost did but I knew she as well as many others wouldn't grasp that concept.","commenter_a":"\" AGAINST HATE\" in Dallas,Texas SEPTEMBER 14, 2015- MONDAY At the American Airlines Center At 5:30pm....all those that want to stand against hate are welcomed. march to the... American Airlines Center In Victory Square...from Cathedral of Guadalupe Off Ross St in Downtown. Police Department will be on site but I would like to note that everyone should be very cautious & on guard. There have been reports that peaceful protesters have been attacked by Trump supporters & some dressed like protesters & assult others within the crowd & reported spitting in their faces. Have your groups be alert & camera rolling just in case, if this happens, attackers can be on record & prosecuted! Thank you everyone & remain peaceful yet boldly stand for Justice. Arm & Arm. Wearing Red,White & Blue colors.","post_message":"A \"Dump Trump\" rally is now scheduled ahead of Trump's rally in downtown Dallas tomorrow."},{"comment_id":"598181650332929","commenter_b":"If this is a representation of the caliber of people America is attracting we're in trouble. It's obvious that we seem to attract a large criminal element, and what does that say about America??? It says we're soft on immigration and soft on criminals, it also says that our Social Services are out of control and way too generous. Trust me these illegals KNOW that they well be given everything for free !!!! and that they can yell Police brutality and that they can do anything they want and get anything they want...welcome to liberal socialism..","commenter_a":"Pigs go to market","post_message":"I agree!"},{"comment_id":"1131895816845262","commenter_b":"husbands fault not the woman","commenter_a":"Is this Hilary Clinton? Always the women's fault, cause the man didn't know he was married.","post_message":"A woman found out that her husband had been cheating. She grabbed three of her friends and tracked down the mistress. What she did next is something you have to see to believe."},{"comment_id":"991210200940830","commenter_b":"DUMB-DUMB-DUMB WOMAN","commenter_a":"What a ghastly hag!","post_message":"She's not the only woman to make such a painfully ignorant comment. Just last week, a German Mayor made a very similar remark. Click here to read what she had to say about Muslim immigrant rapists, and how women in Germany can prevent rape: @webpagelink"},{"comment_id":"10154261283691350","commenter_b":"Yes, those dang gators.","commenter_a":"@username, is this the real reason you're leaving Florida lol","post_message":"Is that thing real?!"},{"comment_id":"525718480886525","commenter_b":"Go home angelia you're drunk","commenter_a":"Yesterday 100 innocent dead in Lebanon Attack, 500 innocent dead in Palestine, 200 Dead In Yemen, last year 400,000 dead in Syria, 5 years ago 1.5 million dead in iraq, Yet No one Says Word , The world Stands silent. And In Paris Attack Today 150 Dead And World Goes Crazy . Obama's statement after attacks in Paris: \"This is an attack not just on Paris...this is an attack on all of humanity\" Mr . Obama Wake up Humanity Has Been Getting Attacked and it dead long time ago. R.I.P To All those innocents Who Died In Paris Attack Today, and R.I.P To All Those innocent lives Who were never Mentioned In The Attacks , and Still Being Killed and not Being Mentioned .","post_message":"Our worst fears have been confirmed. #ParisAttacks The Free Thought Project.com (y)"},{"comment_id":"1780142445541305","commenter_b":"Lmao","commenter_a":"What in the actual fuck","post_message":"Punching White Woman After Yelling Hate White People Not Hate Crime, Judge Rules"}]
