[{"comment_id":"10152994999515326","commenter_b":"Screw you laurie. Are you a tea bagging bitch?","commenter_a":"Good man!","post_message":""},{"comment_id":"10153707555079753","commenter_b":"She racist trash","commenter_a":"She's a racist pig white lives matter she needs to move to Canada allso","post_message":"Apparently, Beyonce was only getting started when she hit the Super Bowl halftime show with the debut of her new song “Formation.” On Saturday, one of Beyonce’s fan clubs, The BeyHive Team, announced that she will be putting together another music video with the help of the parents of Trayvon Martin, Mike Brown and Tamir Rice according to The Grio. Rice, Martin and Brown have all become familiar faces in the Black Lives Matter Movement. According to reports, Beyonce’s new music video will... @webpagelink"},{"comment_id":"10153478854858188","commenter_b":"I see he didn't answer the second question. First answer was also rediculous since he has given all our prisoners from guantanamo away","commenter_a":"Glad he was put in his place.","post_message":"Wow."},{"comment_id":"10153685089913037","commenter_b":"@username how about we deport you Michelle? You see my Apache and Mexican ancestors were here before you ancestors ever set foot, RAPED and KILLED my people. Texas belongs to us. So, get it straight. YOU are the illegal here Michelle.","commenter_a":"Omg if you are legal he doesn't want to send you back. If you are illegal you should be in jail anyway","post_message":"\"It was kind of demeaning.\""},{"comment_id":"1645437002375216","commenter_b":"i like thin women but umm. no, just no","commenter_a":"That is just grotesque","post_message":"Hot or not?"},{"comment_id":"1345804005472359","commenter_b":"MANY WOMEN HAVE ACCUSED BILLY OF RAPE. THAT PLUS THE TRIPS TO EPSTINES ISLAND TO RAPE UNDER AGE SEX SLAVES THERE.","commenter_a":"WE ALL KNOW THE TRUTH..BILL AND HILLARY ARE AS MUCH OF A DISGRACE AS OBUMMA...GO TRUMP..","post_message":"Weak..."},{"comment_id":"1357769630924322","commenter_b":"This story is a distraction tactic to pull attention away from the real story. Americans seem to fall for it every time. Next week it will be something else..keeps us divvied and look we are.","commenter_a":"Oh, and another thing Far Left Liberals. The Head Muslim wants to destroy USA with his crazy Muslim immigration scheme so the U.S. \"can be lowered to the standard of the rest of the world\" is lunacy! Obama is a Muslim, this is not a Muslim state although he is trying to make it so..that is his Legacy. That is why Trump was elected. We are not the Muslim States of America!","post_message":"Hell has officially frozen over. Shared by Occupy Democrats, LIKE our page for more!"}]
