[{"comment_id":"10154324969511729","commenter_b":"How are they terrorists again ? Becus your tv said so ? They were where they shouldn't have been ...if Iran had war ships on the American shores America would nuke that country please stop with that bull shit all of a sudden people care for their army but when they come back broke homeless and jobless no one bats an eye no one takes time out of their lives to do shit about it no one protests to get them help ...so please shut the fuck Up with this false emotion","commenter_a":"A real president would have removed any hope of sanctions relief upon hearing reports that a terrorist regime had abducted any of our service personnel and had a carrier group steaming its way to the gulf with an ultimatum that those sailors be released immediately or else. But instead we get incompetent pandering from Lurch and Oblivious.","post_message":"Quite possibly the most ludicrous thing yet we've heard from this White House..."},{"comment_id":"1642423912674968","commenter_b":"@username health INSURANCE is NOT health CARE","commenter_a":"Wait....hold on a second. Usually stories like this are about people fighting to keep someone alive who wants to die. This time, this poor guy wants to live and the hospital wants to take his life, while he is coherent and of sound mind? I didn't read the story, but I would bet this is all because of $$$ or medical insurance!","post_message":"Heartbreaking video shows Chris Dunn nodding and putting his hands together in prayer when asked if he wants to live."},{"comment_id":"10153829963431130","commenter_b":"@username The two go hand in hand. you would have to post a naked pic to really prove you point but I doubt that is going to happen. She has blubbery arms and obviously fat hips and thighs.","commenter_a":"She looks amazing. I am a size 6 and I don't look that good naked. She seriously has a bomb AF body","post_message":"“This is for anyone who has ever been called FAT.\""},{"comment_id":"688684917923527","commenter_b":"Bye Lil bitch","commenter_a":"Damm bye @username","post_message":""},{"comment_id":"10154985176733690","commenter_b":"He talk easily bcoz he live well but Philippine's nation will suffer .China will dominate Philippine.","commenter_a":"G","post_message":"Duterte said the Philippines could do without US aid, called Americans \"sons of bitches\" and \"hypocrites,\" and praised China for offering what he said was huge financial assistance."},{"comment_id":"1010496572318771","commenter_b":"@username You should be ashamed of yourself, liberal whore.","commenter_a":"\"Trump rallies are becoming increasingly dangerous to protest\" Then stay the fuck away. You didn't see white folks showing up at Obama rallies, shouting racist bs. Goes to show the intellect of these animals. Fair is fair, equality for all! My ass! History has proven that equality never stops when things become equal. It's supremacy these animals want at this point.","post_message":"Happening NOW:"},{"comment_id":"10153141451562894","commenter_b":"She a dub","commenter_a":"@username 😕","post_message":"Kylie Jenner literally just went from 100 to 0"}]
