[{"comment_id":"1730400360525702","commenter_b":"White people are gross","commenter_a":"God... trump is going to get us all killed.","post_message":"Hey, at least they're being honest about it. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154848659386509","commenter_b":"Disney will think twice about hiring him now","commenter_a":"He deserves it and never should have left his wife for that homewrecker ! His children should appeal anything and everything this tramp wants.","post_message":"A Los Angeles judge has granted Amber Heard a temporary restraining order against husband Johnny Depp."},{"comment_id":"10153023631106770","commenter_b":"She should leave right away!","commenter_a":"OHHH so you weren't bothered by the USA Planned Parenthood baby chopping business? You weren't bothered by Hillary's stupidity with her email? You weren't bothered by Racists looting and burning Ferguson? You aren't bothered by Miley Cyrus twerking on TV for young girls? I see. You were bothered by the GOP debate... Right.....","post_message":"Emily Blunt said becoming an American was “strange and slightly disarming.”"},{"comment_id":"880543368756744","commenter_b":"@username ok women let karma take care of me .","commenter_a":"I hope the teen's parents pay for everything for what this family went through. Yes it is the parents fault for not controlling their little shits.","post_message":"The husband of the Ohio woman left brain damaged after teens threw a rock through the windshield of her moving car has committed suicide."},{"comment_id":"10153092045117756","commenter_b":"there is no place around here seems like most females prefer dating sites i think","commenter_a":"screw dating sites they dont work","post_message":""},{"comment_id":"917384355021286","commenter_b":"I would love to see Trump/Carson..... Trump because you can't push him around. carson because the man is just smart!","commenter_a":"How does a troll like Trump make America great. When he can't run a business without filing for bankruptcy. You get no I screwed it up and need a do over in politics. Just ask GW Bush. Anyone hear Trumps policy other than he's going to be great. I I don't think so. Let's call him the carnival barker and clown show that he is. And his supporters if you don't like government than don't participate. A vote for a angry clueless egotistical clown won't help America.","post_message":"Republican 2016 frontrunner Donald Trump is a stain on our country. Image by Occupy Democrats."},{"comment_id":"410883789115113","commenter_b":"I don't understand why they are picking on Trump! If I remember correctly the other candidates said the same thing. They did not want anymore refugees brought into to us but only Trump getts STOMPED for it.. DC is so afraid of him. Go Trump!","commenter_a":"Pot calling the kettle black.","post_message":"Trump is being attacked from all sides. He needs our support. Can we get 70,000 'LIKES' to elect Trump for president?"}]
