[{"comment_id":"1170305866326090","commenter_b":"'@username you are the number one reason for birth control!","commenter_a":"I'm so glad they had a chance to speak about their loss. Some people don't care that lives were lost because they want to be so against a movement they can't possibly understand.","post_message":"These mothers who've lost their black children to police brutality and gun violence had a powerful moment at the DNC."},{"comment_id":"1037567749698799","commenter_b":"Facebook is trying to silence him tonite","commenter_a":"Completely cut off","post_message":"Watch Live: Donald J. Trump holds a rally in Sterling Heights, Michigan."},{"comment_id":"10155348213273132","commenter_b":"Oh boo hoo! Get over yourself! The world doesnt revolve around Queen B! Plus she is not the same artist she used to be... of course her sister would be the one to start the unnecessary drama lol","commenter_a":"Beyonc is not all that any more ADEL IS ABSOLUTELY THE BEST SINGER EVER Beyonc did not get snubbed She lost GET OVER IT","post_message":"have only been two black winners in the last 20 years for album of the year.'"},{"comment_id":"10153141059471336","commenter_b":"BRAVO, Joe Prothera and AMEN!","commenter_a":"There is a way for a change u nid jesus the holy spiritto save u brother::::: beleaved in him","post_message":"BREAKING UPDATE: Jury finds Boston Marathon bomber Dzhokhar Tsarnaev guilty on all 30 counts.  He is eligible for the death penalty. @webpagelink"},{"comment_id":"10153375560764087","commenter_b":"'We should let all the Muslims in or they'll kill us.' -What Liberals actually believe","commenter_a":"Is rep McCaul suggesting that a large percentage of otherwise peaceful and law-abiding Muslims are ready to put that to one side and become violently active simply because someone like Trump says something outrageous? Why does McCaul place such low faith in the Muslim community? And if he is right then isn't he proving Trumps point?","post_message":"“Anytime somebody is making inflammatory statements about Muslims or whatever, they can take that and use it to their advantage for recruiting purposes,” House Homeland Security Committee chairman Rep. Michael McCaul. “They take things like this and they spin it, to inflame the Muslim world, to get more recruits to join the cause to fight in Syria.”"},{"comment_id":"1236747943048399","commenter_b":"#NeverEverHillary #CrookedHillary #LockHerUp","commenter_a":"I can't believe the uneven coverage you get. Trump lies daily and people don't care. You don't even have to do anything wrong and the republicans and media blow it out of proportion.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154278742015329","commenter_b":"Thats that lingo dang old times lol","commenter_a":"Diego X Flores Pringle","post_message":"Single and ready for a PRINGLE."}]
