[{"comment_id":"10153007409220950","commenter_b":"What difference does it make if the victimizer was an illegal immigrant? They're no more likely to be criminals than anyone else.","commenter_a":"How about if your family was a victim of an illegal immigrant?","post_message":"Would you forgive the suspected Charleston shooter if your family were among the victims? @webpagelink"},{"comment_id":"1048532555215895","commenter_b":"What a sicko. she needs to be either arrested or locked up somewhere.","commenter_a":"Someone should sew her legs together..better still use lots of super glue, she needs to suffer s little.","post_message":"Woman: “I’ve Had Five Abortions Because I Love Getting Pregnant But Don’t Want Kids”"},{"comment_id":"10153380669974135","commenter_b":"you again? really , go away you angry negative bitter woman!","commenter_a":"Why don't you open you wallet and pay NJ back for the money you stole from them for your bridegate \"investigation\" and your campaign expenses. Oh, don't forget $82,000 for hot dogs and beer at the ball games.","post_message":"I opened my heart to you"},{"comment_id":"933533113336146","commenter_b":"Humans suck","commenter_a":"I donate to Amur leopards monthly. I hope we can save these lovely creatures!","post_message":"We need to take action now or risk losing some of the most beautiful citizens of our world."},{"comment_id":"1162368457165867","commenter_b":"CORRUPT - I GUESS CLINTON HAS SOMETHING ON YOU!! KARMA - I HOPE PEOPLE SEE THROUGH YOUR CONSPIRACY FOR HILLARY.... I AM GOING TO CALL TO BOYCOTT UTAH","commenter_a":"who, whit ,where ??","post_message":"Could Evan McMullin be the next President of the United States? Full story: @webpagelink"},{"comment_id":"10152477981607434","commenter_b":"I agree. If she lived in Miami in a luxury condo, she'd probably pay more.","commenter_a":"But- that's not a lot of money when you consider she has no mortgage, no car, no food bills- I mean- I don't want it but....","post_message":"The cost of living like a goddamn queen is high."},{"comment_id":"10153619541286130","commenter_b":"In the mean time her SON was arrested for domestic violence. What a nice family she has. Her version of family values...a slut daughter who judges others while can't keep her knees together and a son who beats women. Gotcha.","commenter_a":"That was English?","post_message":"Sarah Palin used some very creative English in her Donald J. Trump endorsement."}]
