[{"comment_id":"10153902888094726","commenter_b":"Shut up you dopey ass bitch.","commenter_a":"Palin has lost her class. She is foolish supporting Trump and a lady doesn't swear!!! She must think he will choose her for V.P. Not a good idea for Trump!!!","post_message":"WATCH: Sarah Palin: Donald Trump Will Kick ISIS Ass"},{"comment_id":"1092391170839418","commenter_b":"@username why would you want my ass to look like your girls face......woof woof.","commenter_a":"His last words were probably \" more ham \". He was old and he was a fat slob. Nobody needed to kill him.","post_message":"Before passing away, Justice Scalia made a comment to his security detail. And based on what we're learning about his death, that comment may have changed everything about that fateful night."},{"comment_id":"10153933140869087","commenter_b":"It is their constitutional right to burn the flag just like the constitutional right to carry a gun. I might not agree with it b","commenter_a":"That's constitutional to do. Folks may not like it, but you can burn any flag. Free speech.","post_message":"Chaos as anti-Donald J. Trump protesters burn an American flag outside the GOP convention"},{"comment_id":"1569798589746550","commenter_b":"Lock her away...","commenter_a":"Common assault","post_message":"This is disgusting"},{"comment_id":"1037969679612623","commenter_b":"Preach it brother!! Racial hangups. More racial tension in this nation since the 1960's. that is a fact. Does every speech have to include how everyone use to be slaves, so down trodden and pitiful. I know alot of blacks. They are smart, educated and are not prisoners of the past. We understand history, we know what happened. But my goodness, dont be so beat down by killary. Dont let her use you. After all, she said, \"blacks are predators and she needs to bring them to heel\". So who has racial hangupsI I'll check back for your answer.","commenter_a":"I realize slaves help build the whitehouse. Whtes also helped build the whitehouse. That would have been a good statement. Like, blacks and whites worked together to build the place where our presidents live. It was a joint effort. But as usual, race baiting and on and on about how slaves had to rise up etc... We have had a potus who has made racial tensions the worst they have been since I was a teenager. How is this unity? How have bama and shelly brought unity to our nation? More rioting in the streets more blacks killing each other, our people are fighting and against each other. So much for the legacy of the first black potus. Now they want a woman to be the nxt black potus.","post_message":"Well said, Kelly Clarkson!"},{"comment_id":"621306871404081","commenter_b":"TruDat","commenter_a":"I do not like Chris Cuomo I quit watching CNN and ABC because of garbage just like this we need to vote them out with not giving them a minute of our time. All Chris is concerned with is his desperate search to find something to attack any republican for but especially our our President Elect if you don't agree with his liberal view he will try to destroy and humiliate you Kellyanne has class and courage to face such an excuse for a reporter if I was her he wouldn't get five seconds of my time.i don't understand what makes him think that is just his President because as my President I feel he has a right to tweet about his opinions and I like seeing what his opinions are.","post_message":"Kellyanne Conway embarrassed CNN's Chris Cuomo for obsessing over Donald J. Trump's tweets..."},{"comment_id":"10154472400523645","commenter_b":"Pisses me off as much as a person on death row getting a heart transplant. Only in California","commenter_a":"I thought convicts were entitled to three squares, dental, and health care, not wants. How could the state be legally required to pay for it? this operation had nothing to do with his health. Just because he believed he was a woman? Well how many of the inmates believe they are innocent? Shall we bow to their wants and beliefs?","post_message":"Shiloh Heavenly Quine - convicted of first-degree murder, kidnapping and robbery for ransom - had the surgery in San Francisco on Thursday. She will reportedly be moved to a women prison after leaving the hospital. The state was legally required to pay for the operation."}]
