[{"comment_id":"10154284968796336","commenter_b":"Because an orange narcissistic with a fake wig is better","commenter_a":"Because he promises free stuff, and doesn't say he's gonna take your jobs, but you'll lose your wealth if you try and make something of yourself! Both democrats running are a joke!","post_message":"BREAKING NEWS: Fox News projects Bernie Sanders as the winner of the West Virginia Democratic primary."},{"comment_id":"351086708348331","commenter_b":"All about the MONEY Honey.","commenter_a":"It has profited as much as it can.","post_message":"“One source confirmed to me Caitlyn Jenner has made whispers of ‘sex change regret,’ hinting she might go back to being Bruce Jenner.” - Ian Halperin"},{"comment_id":"10153370313159071","commenter_b":"Elaine Daly 😂😂","commenter_a":"Excel is childish approach towards industry of information and finance. Furthermore the database tools it offers is fluid and prone to human mistakes.","post_message":"Mastering Excel puts you way ahead of the competition."},{"comment_id":"709650085834839","commenter_b":"Exactly why I pointed it. Most like her, only dodge and deflect.","commenter_a":"This is not even true and amounts to propaganda plain and simple. And of course this is coming from Florida where an election was rigged. Why don't you educate your fellow man instead of scaring them and filling their tiny little minds with this ignorance; there are so many untruths in this article, number one being the use of the term \"body parts\". Since the majority of abortions are performed at the 12 week mark, these are embryos with no body parts to speak of. There are no videos that show any of this yet that is the main point of your argument. Second, fetal tissue is donated to medical research which is legal and most republicans voted it in (look up fetal tissue for medical research law) and had been, most recently, used very successfully in the treatment of Parkinson's disease. Since most conservatives don't believe in welfare, Planned ...","post_message":"I Freaking KNEW it."},{"comment_id":"10153238798269255","commenter_b":"OMG! Saved from the menace of foreign wine!","commenter_a":"Hahahahahahahaha.","post_message":"Dummy."},{"comment_id":"942676889125393","commenter_b":"Is she ROYALTY ?","commenter_a":"How much did the vet charge?","post_message":"60-stone woman lifted out of her home by a crane in a SEVEN-HOUR emergency operation"},{"comment_id":"10153811229123433","commenter_b":"1. Hardly \"record\" when the number of abortions is going DOWN. In 1990, there were 1.6 million abortions performed. Today, it's a little over a million. Numbers don't lie. 2. Hundreds of thousands of women were getting abortions BEFORE Roe V Wade legalized them. You are more likely to die due to childbirth/pregnancy complications than an abortion. 3. You are contributing to your own problem. Teens that had received comprehensive sex ed were 60% LESS LIKELY to get pregnant. The states with abstinence only education have HIGHER rates of teen pregnancy compared to states that actually teach sex ed. Why do women get abortions? Unwanted pregnancy. Much less likely to get pregnant when you're using contraception. It's not rocket science. 4. Abortion isn't free. The Hyde Amendment prohibits any federal funding of abortions except in the case of incest, rape, or danger to the life of the mother. They most ...","commenter_a":"What do you call 350k annually, or 10,000 late term per year how many is \" record\"?@webpagelink","post_message":"From the trail in Iowa. Carly Fiorina wrongly claims that we're seeing \"record\" abortions. @webpagelink"}]
