[{"comment_id":"10156227118445354","commenter_b":"And gays, get ready to be tossed off the highest building available. Who let the muslims here. Get ready fools.","commenter_a":"Prepare , you liberal women better bend over and shut your fucking mouth. This is what you asked for.","post_message":"Green light GO!"},{"comment_id":"10153573613391037","commenter_b":"An interesting job for our President on how to get these kids off the street at night and up in the morning to go to school.","commenter_a":"If it's done the right way!!!!","post_message":"The president says helping America's minority youth and making sure young people have the opportunity to succeed is \"an economic imperative.\" Liz Goodwin details the push behind the My Brother's Keeper initiative."},{"comment_id":"10153234485277293","commenter_b":"That's hard work for women","commenter_a":"Women must stay home and have babies that is strongest work in the world","post_message":"The research raises the question of whether the Marine Corps may press to keep the infantry and Special Operations, in particular, closed to women."},{"comment_id":"589287567920858","commenter_b":"Wanted to see the dogs lock jaw these pos","commenter_a":"Click bait everywhere goddamn","post_message":"A man was slashed after coming to the defense of a dog. Surveillance video shows the two men punching, kicking and beating dogs on Staten Island."},{"comment_id":"577283422434663","commenter_b":"Sandra Skolnik THE HILLARY VOTER ARE ,MUSLUMS ,ILEGAL IMAGRANTS, PEOPLE LIVINg in other countrIES silly woman that dont follow other candadits SO HOW DO THEY REALLY KNOW WHAT IS GOING THE WOMAN NEEDS TO BE INCITED SOON","commenter_a":"I'm starting to #FeelTheBern! Bernie Sanders has been consistent with his message throughout his career from climate change to #LGBT rights. @username not only voted in favor of the Iraq war but she also played a large role destabalizing the Middle East in Libya and Syria as Secretary of State. I hope New York, California, Pennsylvania and the remaining states get out and vote for Bernie Sanders before the FBI indicts @username over her mishandling top secret information on her private server. We need honest leadership not warmongers who destroy entire nations with irresponsible policies. Vote for peace! #FeelTheBern #BernieSanders2016","post_message":"It's understandable that Americans are angry. But instead of inciting violence, we should talk about how we’re going to address the challenges we have."},{"comment_id":"10153604770703984","commenter_b":"I know that Obama was slow to react. The main reason is the fallen were White and Hispanic soldiers killed by a Islamic terrorist. He has zero respect for our military and would be very happy if all military members that don't support his new direction for this country would resign. We have a President that wants to convert America into a third world country that will allow him to remain its Dictator. Everyone needs to remember the USSR and how it broke up into many small countries that are loaded with the rich leadership and the overtaxed people who just want to live in peace. Russia's streets are ruled by gangs and the mafia. WAKE UP AMERICA!!!","commenter_a":"Obama is some commander in chief NOT!! He should be ashamed! What happened to freedom of speech?","post_message":"What just happened in a crowd of veterans during an Obama speech says a lot about his presidency. The bold veteran who stood up even after he was dragged down is attracting a lot of attention. Do you support what this veteran did?"},{"comment_id":"853540474702649","commenter_b":"By the way I don't agree with this either. But just think if people do not hire illegals they couldn't survive here. That is the root problem maybe we should start there.","commenter_a":"States did this not Obama. Do you blame him for everything? If the Cardinals don't win the World Series I'm asking congress to impeached him because it would have to be his fault","post_message":"10 states now offer driver's licenses to illegal aliens. Don't you think this is WRONG?"}]
