[{"comment_id":"1180801771932078","commenter_b":"Thugs v thugs - time for trump to go","commenter_a":"This should get Trump even more votes, they are showing their true character!! Violence and Thugs....the Bernie and Hillary supporters, \"Democrats\"!!","post_message":"GRAMMY WINNER URGES BLACK MOBS TO PROVOKE TRUMP VOTERS 'See what they do then. Keep touching us, motherf----r'"},{"comment_id":"10152816296297452","commenter_b":"I hate possums they look like big rats","commenter_a":"Time to burn the house down","post_message":"Can something be totally terrifying and completely cute at the same time? We've seen a lot of \"wild animal in the city\" stories here in Southern California: bears, coyotes, mountain lions... But this could be the wildest. What one L.A. woman found in her closet is lighting the internet on fire. @webpagelink How it got in... how it got out... and the reason it was so angry. Tonight at 11 from ABC7 Eyewitness News. Courtesy: Tara McVicar"},{"comment_id":"1103187606428737","commenter_b":"More words of wisdom from the vastly intelligent mind of Pelosi, or liberals say the darndest things.","commenter_a":"idiot","post_message":"www.EagleRising.com"},{"comment_id":"1089383177744009","commenter_b":"eeeuuuuuuu - did she get that in her back yard?","commenter_a":"That looks awful.","post_message":"You as a parent do not know what's best for your kid. You don't know how to raise your kid right. You certainly do not know how to properly feed your child, and Michelle Obama and the government are going to do it for you and they're not gonna give you any choice in the matter."},{"comment_id":"10153313439013984","commenter_b":"Sick bitch...you go girl..to hell","commenter_a":"She fed the hungry so all you people that have never been hungry think about that you idiots some people don't know what its like to have an empty belly so you go girl","post_message":"The disgusting hatred from the left never ceases to amaze me. Do you support this young woman?"},{"comment_id":"10154077831881509","commenter_b":"Tell them to eat pork!","commenter_a":"I don't think I have read more ignorant comments than those supporting Ben Carson. Yes, Carson is entitled to his opinion but it shows the complete lack of understanding of the way our nation operates. A man who believes he can pick and choose which laws to obey is not qualified to run as President. Where are all the Christians who were crying about religious liberty? This man wants to take away the religious liberty of a very large portion of those practicing a different religion. A very sad day for America and those haters bashing the Muslim faith.","post_message":"A call for Dr. Ben Carson to drop out: @webpagelink"},{"comment_id":"10153668004231037","commenter_b":"Good they can all go to jail with her too","commenter_a":"America is a sick country","post_message":"About 300 people gathered outside of the Kentucky jail on Saturday to show support for Kim Davis."}]
