[{"comment_id":"10153025214071051","commenter_b":"I can't tell you how many cars my body has stopped that wouldve hit a lady otherwise","commenter_a":"The man always walks on the street side of a woman. That's manly eticat !","post_message":"A woman posted this photo with the caption, “I'm sure half of you guys don't even know what's wrong with this picture” alongside it. Well, she was right."},{"comment_id":"10153767545206002","commenter_b":"My son still has school.","commenter_a":"Schools need a coordinated web site saying exactly what are close or open..","post_message":"Bitter cold has closed schools not already on Winterbreak. School Closings: @webpagelink #Local4Today"},{"comment_id":"587659781407559","commenter_b":"I bet those predestinarians didn't know anything about her past !","commenter_a":"Please just drop out Hillary! Give Bernie a shot!","post_message":"A special moment with a (new!) supporter and his mother in Henniker, New Hampshire."},{"comment_id":"10154248904966337","commenter_b":"You ladies are making me think I'm being an asshole for the right reasons","commenter_a":"Stop this goddamn decimation of his character. Millions of us live with chronic pain every day.. Even if he was on painkillers so fucking what. Even if he possibly overdosed, it doesn't fucking matter. He was still a prodigy a musical genius. These post mortem aqusations are nothing more that cheep attempts at gathering attention for your shitty fucking attempts at journalism, and you should be fucking ashamed at your lack of talent and mortality... Fuck you","post_message":"OH NO: New details emerge regarding the death of #Prince."},{"comment_id":"10153541842375329","commenter_b":"Kim has a nice body","commenter_a":"Who wore it better? Kim or Doug the Pug?","post_message":"Way to turn the tables, girls. (via BuzzFeed Trending)"},{"comment_id":"1047910738660847","commenter_b":"Exactly who would this little girl call if a robber happened to storm into her place of employment and point a gun at her, another employee or patron? Who would she be begging to step in between herself and a threat? Who would be more than willing to lay down his life for her? The answer is the man she refused to serve. I'm glad she lost her job. I hope others learn from her foolish mistake.","commenter_a":"hahahah yes!","post_message":"An Alabama Taco Bell employee who refused to serve police officers has been fired."},{"comment_id":"10153198007713203","commenter_b":"Poor babies. Why do moms do this....May God for give us all. This needs to stop","commenter_a":"May God have mercy on the world.","post_message":"I left Planned Parenthood after seeing ‘perfectly formed’ quadruplets aborted: former abortion worker"}]
