[{"comment_id":"10153195782398984","commenter_b":"she is a witch","commenter_a":"She's a BIG box of rancid nuts , and there are plenty more in there with her !!!!!","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"1004293156333603","commenter_b":"Truth hurts if ou weren't an illegal you wouldn't have taken offense.","commenter_a":"Keep them out the US we have enough problems with illegals already. Deadbeats sucking the economy dry","post_message":"This year, nearly 200,000 people have landed on Greek shores, another 110,000 have arrived by sea to Italy and more than 120,000 by land to Hungary. Germany has just announced that it expects to receive 800,000 asylum applications in 2015."},{"comment_id":"10156136666730725","commenter_b":"@username..so the Democrats will bring in foreigners who despise us and our way of life. Yes that will certainly help.","commenter_a":"Why are we not taking care of our homeless veterans better first?","post_message":"BREAKING: Secretary of State John Kerry says the U.S. will significantly increase the number of worldwide refugees it takes in over the next two years to help ease the Syrian refugee crisis ----> @webpagelink"},{"comment_id":"1026050264097061","commenter_b":"illigals should not be able to vote period","commenter_a":"I agree, if sending all illegals back to where they came from will save lives, then do it and to the illegals be damned!!","post_message":"YES!!"},{"comment_id":"10153644073950861","commenter_b":"They can get married with benefits now. What the hell else do they want?","commenter_a":"The Florda man is at it again","post_message":"The display, based on the holiday depicted in \"Seinfeld\", will be 6-feet tall, wrapped in the colors of the gay pride rainbow flag and topped with a disco ball."},{"comment_id":"10153332297102061","commenter_b":"What's racist about putting Americans protection FIRST from illegal alien Mexican criminals and potentially ISIS infiltrated refugees?","commenter_a":"Trump is a racist piece of trash. He needs to just step down and hide for a few years","post_message":"TOP STORY: Trump rally draws hundreds of protesters in Bernie Sanders' home state of Vermont: abcn.ws/1JxW5UZ -- see more on GMA..."},{"comment_id":"1727548687496080","commenter_b":"HILLARY CLINTON IS AN ARROGANT NARCISSISTIC SOCIOPATHIC LIAR AND VERY EVIL WOMAN !!","commenter_a":"Time will tell","post_message":"We'll see what ends up happening..."}]
