[{"comment_id":"1180033235377842","commenter_b":"Obamo is nothing but a Fuc##^#gJerk that is trying to desroy AMERICA !!!!!!","commenter_a":"Shocked, Hassan rejected Syrian refugees! Of course Obama told the Govenors to pound sand! He's sending them in under the darkness of night on buses!","post_message":"Did your state make the list?"},{"comment_id":"10153137487806336","commenter_b":"Because 'not topless' she would never make the cover. Topless, she is on the cover. Follow the money.","commenter_a":"Why the hell do you have to pose topless to represent yourself? She plays golf, she's not a go go dancer so pose with something that represents your sport. As it is all she represents is the moral decay of America.","post_message":"\"I decided that I wanted to do it not only to represent myself as a professional athlete and a golfer, but to represent just all women athletes in general.\"  LPGA golfer Lexi Thompson appeared on 'Fox & Friends' to address criticism of her controversial \"GolfDigest\" cover photo."},{"comment_id":"10153871025190579","commenter_b":"How many more innocent people must die before we outlaw gun free zones?","commenter_a":"😩😫😨😱Smh... ..... How many more innocent people have to die before we regulate gun control? If we can save (((1)))) innocent person then that's 1 less family that have to suffer in pain because they loss their love one to violence. 😒😞😢 Numbers don't lie. It's time for gun regulations NOW!!!! 😒😞 I understand that there's no way you can get criminals to obey the laws, that's why they are \"criminals \" because they break the laws but we need to make it a little more difficult for them to get their hands on a gun like they did in Australia in 1996 after a mass shooting there .... Law abiding citizens still should have their rights to own a gun for protection hunting and recreation. @webpagelink","post_message":" politics has to change. President Obama answers two questions on guns at a press conference.  Watch the full video here: @webpagelink"},{"comment_id":"967087283327615","commenter_b":"Yes you scared little woman","commenter_a":"This muslim kid brings a suitcase filled with wires and people are being mocked for over reacting?","post_message":"Standing tall after an outrageous arrest."},{"comment_id":"1273581186010307","commenter_b":"Shut up bitch","commenter_a":"I wonder what u yank heros would do if a dog attacked u?? That's right, each and every one of u pussies would take out your big tough guns and shoot it!! You're all cowards who hide behind guns so don't blame the cops for doing their jobs","post_message":""},{"comment_id":"10154911255250530","commenter_b":"@username you. The Asian carp are not bottom feeders, their meat is high in protein. Watch some YouTube videos on them....you'll learn a thing or two.","commenter_a":"I've read that they are good to eat and high in protein. But, man has wiped out many species of plants & animals, don't know why this should be so difficult.","post_message":"Here come the carp."},{"comment_id":"1007291799323583","commenter_b":"Social Media: What a bunch of freakin half wits. I wish we could send them all out on a barge in the middle of the ocean sink the barge and see how many swim back. Social media morons the world would be a better place if we took your cell phones away until you learn what they are supposed to be used for. One irresponsible person does not make everyone irresponsible. Wake up! This is exactly what Obama wants, take our guns so he can declare the U.S. a dictatorship and he would be the dictator!","commenter_a":"no","post_message":"Here we go..."}]
