[{"comment_id":"948719421835197","commenter_b":"naw, the generation of things now being exposed more like it","commenter_a":"The generation of no personal responsibility.","post_message":"If this tactic works, we're a sicker country than I could have ever imagined."},{"comment_id":"10154362709291438","commenter_b":"@username Put down the bong.","commenter_a":"BLM=Obama/ISIS cop killers.","post_message":"The head of the local union doesn't think NFL players have a right to free speech."},{"comment_id":"10156131278050725","commenter_b":"only one that needs to apologize is hillary the corupt crook who lined her pockets and sold out the entire USA to make millions. where are those emails hillary?","commenter_a":"HELL NO!!! He doesn't defend America. When he starts defending America and her citizens, then we can start defending him.... if he does something right, that is.","post_message":"Am I morally obligated to defend the President every time somebody says something bad or controversial about him? I don't think so!"},{"comment_id":"1811896189089892","commenter_b":"Cause she was lying, and she knows we all know she is a liar!","commenter_a":"Wow.. a fair and unbiased job by Chris Wallace..finally!!...Trump didnt expose her as the lying criminal that she is as much as I hoped Hillary must have had an earpiece she was nodding yes through the whole debate...what a fake! Now lets listen to the corrupt media spin it left when its obvious Trump won.","post_message":"There was no doubt about it..."},{"comment_id":"10152864140411051","commenter_b":"She should be afraid not to file for divorce!","commenter_a":"Is time that she buys a gun and it will be the last time that he ever hurts her again.","post_message":"A mom was picking up her children from daycare when, all of a sudden – boom."},{"comment_id":"10154018713024411","commenter_b":"Antony. I don't represent the US government. The US government doesn't represent me. I don't excuse all of the bad things the crooks who call themselves \"my government\" do. And none of that excuses crimes Israel commits. Including the subversion of my country's government via AIPAC and all of its spies, such as the traitor Jonothan Pollard, and dual-citizen Israeli loyalists in positions of influence and power. If you don't like the crimes my country has commited in the Middle East since 9/11, you can attribute a big part of the blame on Israel and its subversives in the US. Not all, but a big part.","commenter_a":"The excuse is always the same. A missile from Gaza lands harmlessly into the Israeli desert. Israel bombs the hell out of Gaza, killing dozens or hundreds of civilians. When are people going to wake up to this scam. Israeli agents shoot off the missile to provide a pretext for Israel's aggression.","post_message":"URGENT"},{"comment_id":"1693802114227741","commenter_b":"The towers that Donald Trump built ... Border Patrol endorses you to build that wall too, Mr. Trump ... A BUILDER ... not a destroyer ... of American liberties/freedom FOR POTUS!!! @webpagelink @webpagelink #DONALDTRUMP #POTUS #REPUBLICANPARTY #GOP #2016ELECTION #BORDERWALL #BORDERPATROL #TRUMPTOWERS #PRESIDENTIALPRIMARIES #VOTETRUMP #TRUMPTRAIN #MAKEAMERICAGREATAGAIN","commenter_a":"We have said that for years,They dont need us to protect them anymore.If they do,they pay for it.","post_message":"Changing times call for changing perspectives. I am proud to have started this conversation."}]
