[{"comment_id":"10153060149946051","commenter_b":"Bitch boy Yu still white nd YUr trash to pussy","commenter_a":"Nothing like white/black trash argueing!","post_message":"When this woman heard what a couple parked near her said, she lost it."},{"comment_id":"1169952976350143","commenter_b":"Nope. I have worked in Criminal Court, and this was battery.","commenter_a":"Yup","post_message":"POLL: Should charges be dropped against Donald Trump's campaign manager Corey Lewandowski? (VOTE NOW)"},{"comment_id":"10154303703286178","commenter_b":"You sound like a feminist bro.","commenter_a":"So does this mean only woman can understand how to run a home ? What a CROOKED crock of chit HILLARY !","post_message":""},{"comment_id":"1022890011112195","commenter_b":"well people you all know by now that the illegals are who and what is at the top of being cared for first and they receive what our own Military should be getting as well as the American people our men and women who risk their lives are just a # and after thought and these actions begins with THE PRESIDENT OF THE UNITED STATES who has no respect for any Military or the American people , prayers for all who serve and have served and and fought for this great Country and our freedom and what we stand for we need to clean out the Government offices starting with the WH oval office we need a real man put in that position one that will help America not destroy it","commenter_a":"its in my tat","post_message":"NEVER FORGOTTEN! The voice of the people"},{"comment_id":"564066700424981","commenter_b":"She's a cunt.","commenter_a":"Please, it's time to serve her!","post_message":"It's about time!"},{"comment_id":"1661235427481336","commenter_b":"We need the wall Canada has a wall but i forgot all the famers might lose there free lador","commenter_a":"hahaha... a very accurate comparison! Lol.","post_message":"\"On Feb. 9, we trust New Hampshire Republicans will send 'Biff Trump' back to somewhere — anywhere but on the road to the most important elective office in the United States at a most crucial time for this nation.\""},{"comment_id":"1260485777320174","commenter_b":"I can't wait for President elect Donald Trump to take office and start tossing out the undocumented illegals..........I hope this joker is the first to go.","commenter_a":"that is so sick they should kick them all out","post_message":"BOOM! (WATCH)"}]
