[{"comment_id":"369671676554460","commenter_b":"Of course we pay for her boobs because we pay for all the boos in Washington","commenter_a":"This is disgusting and she should be kicked out in the cold! Taxpayers pay for this fraud nd sh should be removd from all social welfare programs! He doctor should never be able to bill this type of fraud.","post_message":"This Parasite... Unbelievable."},{"comment_id":"1101969979880290","commenter_b":"@username and @username You are both aware that faith is not a verifiable thing,correct? You also don't need religion to have the emotion of faith in something. My goodness...where do you people get your educations?","commenter_a":"Pretty happy we have the technology to make this happen. Thanks to the doctors for their experirnce and service. god has nothing to do with this surgery how about you thank the heros the doctors.","post_message":"After over 26 hours of a remarkable surgery, the moment when the parents saw one of their conjoined twins separate for the first time. The twins, Anias and Jadon were successfully separated after being born conjoined at the head 13 months ago. #JadonAndAnias. @webpagelink"},{"comment_id":"1329814237089560","commenter_b":"These seem so handy","commenter_a":"This feels like a Savannah thing.","post_message":"If there's one thing we can all agree on, it's that tying shoelaces is the worst: @webpagelink"},{"comment_id":"1008364749198946","commenter_b":"But the only way to stop a bad baby with a gun is with a good baby with a gun!","commenter_a":"My Hero","post_message":"BOOM!"},{"comment_id":"818824291595686","commenter_b":"@username. I don't live it Kentucky Faggott. Ummmm, Self -Employed Trucker. You big and Bad, bring your punk Ass on. Scatter my Brains. You ALL talk, punk Bitch. Tell your mama, to get back on the Corner, her break is up!","commenter_a":"By Law, if the man is found not guilty, they cannot Execute him. This is a Bogus Site!!!","post_message":"SPREAD THIS LIKE WILD FIRE! This man is INNOCENT! Do not stop until this is HEADLINE NEWS in the #MainstreamMedia! NONE OF US ARE FREE UNTIL ALL OF US ARE FREE!"},{"comment_id":"659111814237594","commenter_b":"I hope you both get shot in the head!","commenter_a":"OMG! I can't believe I live in this country!","post_message":"All in the name of fighting tyrannical Obama and his assault on the Second Amendment. -- Robert"},{"comment_id":"10153526773721350","commenter_b":"Those hips are MALE hips!","commenter_a":"She look so stunning & beautiful tonight","post_message":"Caitlyn Jenner shared some very powerful words from the podium."}]
