[{"comment_id":"10153227262005667","commenter_b":"@username where do you live? Come on your pry think we don't need crude oil any more either.","commenter_a":"If you think it's cute I will snare one and let you try to pet it. They are vermin and need to be killed or they will take over. Now they just eat your pets, if the numbers get out of control they will come after humans.","post_message":"The animal was spotted entering the baggage claim area and then ran across the ticket check-in area and toward the TSA checkpoint."},{"comment_id":"501298436725116","commenter_b":"Need more Americans like him . Hope he can beat all the charges . Muslims need to go back home !","commenter_a":"Not a hate crime","post_message":"A lesson he'll NEVER forget..."},{"comment_id":"1115714755184548","commenter_b":"@username DUMBF TRUMP BUILDING HIS OWN WALL BECAUSE MEXICAN PRESIDENT SENT HIS ASS PACKING.","commenter_a":"Smart women.. COUNTRY COMES FIRST. LET'S VOTE BLUE IN NOVEMBER. HILLARY NEXT PRESIDENT OF THE UNITED STATES OF AMERICA.","post_message":"This is just too good!"},{"comment_id":"481193578737889","commenter_b":"After the shit she did she should be quiet people that live in glass houses should not through stones!!!!!","commenter_a":"A great concept and certainly worth attempting. We pray for success and abolishing obamas illegal actions.","post_message":"Sarah Palin is starting a revolution... and Obama's first to go. She's leading the 50 states and we’re right behind her. Do you support Sarah Palin?"},{"comment_id":"834219746615367","commenter_b":"It's hard in that situation it would be nice if it worked just that easily but pregnancy is a risk and you or I can't force a women to carry a baby.","commenter_a":"Woman's Rights? What about the fathers rights? I had a fiancee who had an abortion about 25 yrs ago. I didn't even know she was pregnant until after the abortion. She had her friend call and tell me. Then wanted me to pay half of the cost. I as the father I should have had a right in the say so for abortion.","post_message":"Five reasons why Matt Walsh says he is pro-life without exception:"},{"comment_id":"1134361886576067","commenter_b":"Totally agree!","commenter_a":"We need to have Trump supporters at all polling places. ALOT of cheating will be going on to stop Trump GET THIS WORD OUT.","post_message":"Things could always change, of course nothing is ever set in stone in a presidential race. But for the time being, Trump not only the party frontrunner, he is actually defining the race for everyone else"},{"comment_id":"10153394561766336","commenter_b":"Only one I see judging is you","commenter_a":"Her Christian mother must be so proud. This is why you don't preach and judge. Once you put yourself out there, you are now the target to being judged.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child. “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"}]
