[{"comment_id":"877412165685172","commenter_b":"As long as you're legal. Either way, hard work or not your family broke the law so you're criminals. It's the truth. The country is better off without illegals.","commenter_a":"Please please all illegals and Mexicans and Mexican-Americans keep posting your stories. We need to show Trump and his ignorant followers the truth!!! Post your stories. Post your families stories. Flood the Internet and Facebook with the truth of why people of every nationality and every nation come to America!!! Make it known and state the facts and truth!!!!!! Bring ignorance to its knees.","post_message":"She really nailed \"The Donald!\""},{"comment_id":"10153721427574753","commenter_b":"Devious nasty man woman. Ugh","commenter_a":"1 she is a man...2 who cares","post_message":"Caitlyn Jenner just competed in her first golf tournament where she played as a woman. Jenner has always loved golf and this didn’t change when she transitioned. For some reason, it just took this long for her to do a tournament. ET Online shared the details of Caitlyn’s recent golf tournament. Jenner was in the ANA Inspiration Pro-Am in Rancho Mirage, California, on Friday morning and she played alongside former U.S. soccer star Abby Wambach. Caitlyn did a great job on the golf course today... @webpagelink"},{"comment_id":"10158282673955294","commenter_b":"Today????????","commenter_a":"Does this mean Chris Jericho, aka Y2J, has been signed to a lifetime contract with WWE? If not, they're stupid idiots!","post_message":"A group of scientists have moved the \"Doomsday Clock,\" a symbolic countdown to the end of the world, to two and a half minutes to midnight."},{"comment_id":"10153792015980695","commenter_b":"Why white woman","commenter_a":"I'm just saying. I would stop if I hit a deer or a white woman. I can tell the difference also.","post_message":"“For someone to know you hit my mom and never even tried to stop or brake, I don't understand that.\""},{"comment_id":"608866065958951","commenter_b":"Yes!!!","commenter_a":"@username :O","post_message":"Dangerously adorable."},{"comment_id":"822624721167115","commenter_b":"The U S citizens land it crosses and Native Americans land it crosses should have the last word on this. Not some politician, or Lobbyist or any one who will make money off it. It looks to me that the land owners don't want it. VETO< VETO< VETO.","commenter_a":"Woot!","post_message":"A defiant GOP votes to fast-track Keystone."},{"comment_id":"10156191527000354","commenter_b":"Huma, you criminal bitch, up yours.","commenter_a":"Dr Ben Carson: \"Islam is not consistent, not compatible with the Judeo-Christian Values and Principles of America, the U.S. Constitution, Sovereign Individual Freedom and Liberty Dr. Ben Carson nailed it on the head, and like Trump, is not 1 ounce of 1 iota fearful of any biased politically correct media backlash because he states the truth as it is, not as they want it to be. Those who are ignorant of the Islamist threat and unwilling to confront it, will be conquered, subjugated, enslaved, raped, tortured, and exterminated over time. David Wood on Islam's 3 stages of Jihad @webpagelink","post_message":"\"Huma’s history includes her past work at an Islamist periodical, the Journal of Muslim Minority Affairs (JMMA). The journal was founded by a man named Abdullah Omar Naseef, who would later go on to aid Al Qaeda’s operations worldwide.\"  MORE..."}]
