[{"comment_id":"579271598927799","commenter_b":"As a sentence. Send her dumb ass over there and pull her passport, then pull her citizenship and tell don't come back. PS. Take the view with you","commenter_a":"Do Barry proud, he'll probably pardon her.","post_message":"Mississippi woman who attempted to join ISIS pleads GET INSTANT JUSTICE from No-PC Judge"},{"comment_id":"10155157892736729","commenter_b":"HILLARY LIED UNDER OATH SEVERAL TIMES- SHE TOOK FOREIGN BRIBES FOR CONTROL OVER OUR SOVEREIGN NATION- SHE DESTROYED EVIDENCE AFTER CONGRESS DEMANDED IT WITH A SUBPOENA- THOSE ARE REAL CRIMES- WE WOULD BE IN JAIL FOR- THE DEMOCRAT'S SAY COMEY IS SIDING WITH ONE SIDE OVER THE OTHER-FOR POLITICAL REASONS- BUT NOT THE FIRST TIME - WHEN HE WOULD NOT PROSECUTE CRIMINAL HILLARYS-BLATANT INTENTIONAL-CRIME SPREE- NO- ONLY NOW -THEY SAY IT- WHEN IT'S NOT GOOD FOR THEM- THIS NEW FBI INVESTIGATION- IS A JOKE- THEY WOULD HAVE ALREADY PUT HILLARY IN JAIL!!!! **WIKI LEAKS AND THE FBI-ALREADY HAVE ENOUGH EVIDENCE TO PUT HILLARY IN JAIL- THIS IS A SCAM- THIS IS JUST A DISTRACTION- SO HILLARY CAN SAY- SEE- THIS IS NONSENSE- THERE IS NOTHING THERE--CRIMINAL HILLARY HID EVERYTHING BUT NOW WANT'S IT OUT- I CALL BULLCRAP","commenter_a":"Kill yourself you fucking pig","post_message":"Amazing."},{"comment_id":"515532941989754","commenter_b":"She so sickening","commenter_a":"And your high taxes and high minimum wage and Obamacare will put small businesses out of business so just stop. Americans can see through your BS .","post_message":"Hillary went off her rocker today. She is YELLING at voters. Very Bizarre."},{"comment_id":"1514259995548132","commenter_b":"... People do realize the article isn't about humans right? None among us can store the seminal fluid of various males and asses it for quality before choosing our baby daddy's, just FYI. ;)","commenter_a":"Rachel Pratt :)","post_message":"There's more to semen than just sperm."},{"comment_id":"10153877177851162","commenter_b":"Get raped to death","commenter_a":"I'm not sure if they deserve death or to get raped everyday. Tough call.","post_message":"JUST IN: Two men have been charged with murder in the fatal shooting of a pastor's pregnant wife during a home invasion.  Amanda Blackburn was raped and shot in the head during the attack at the couple's home. She died the next day.  NEW DETAILS: @webpagelink"},{"comment_id":"10153815674903299","commenter_b":"Funny how y'all are judging but if you think you're perfect you're wrong. Trump may not be perfect but at least he's not selling out to the ones trying to take away our Christian beliefs.he wants Christian morals back in our schools and families and I don't care about the rest. God will handle the rest. If Hillary gets in you better learn Sharia law because shes already sold out. At least we have a chance with trump.","commenter_a":"1168434116541793maybe you should research Hillary 100% lies","post_message":"\"What you really have to do is you have to pray to get everybody out to vote for one specific person.\""},{"comment_id":"1769292306444953","commenter_b":"With you in that thought...sad but so true. In jail all his basic needs would be met and even medical. Sad we treat jailbirds better than the homeless.","commenter_a":"Imagine if he'd actually been trying to steal the food so he could go to jail and have a roof over his head and food in his belly. But good on the judge anyways for showing some compassion in a world that is lacking these days.","post_message":"A bit of compassion in the courts can go a long way."}]
