[{"comment_id":"10153180553634071","commenter_b":"ohh this one","commenter_a":"@username Teresa Oanh Hoang","post_message":"She had something much better in mind."},{"comment_id":"10153892680026680","commenter_b":"Get a grip Republicans! Don't get weak and give up on Trump! The stakes are much too high! Our lives as we have known them will never be the same if Hillary Clinton wins this election! Donald Trump apologized for things that were said in private 11 years ago but Bill Clinton has yet to apologize for putting his cigar in places it shouldn't be while in the Oval Office and being paid by the taxpayer! There is no low that Killary and team will not stoop to in order to steal this election! October 6, 2016 Clinton Foundation HACKED – Now We KNOW Hillary Clinton Stole More Than Taxpayer Dollars! barney-frank Americans may have been disappointed when Julian Assange announced that he didn’t have an October Surprise for Hillary Clinton, but they weren’t disappointed for long. Another hacker stepped up with an explosive leak. Going by the name “Guccifer ...","commenter_a":"This is too far. You can't start talking about someone is father specially if they are deceased.","post_message":"The file is all of eight pages in length, suggesting the bureau never subjected Fred Trump to any serious scrutiny prior to his death in 1999."},{"comment_id":"10154558437983645","commenter_b":"Oh Gabrielle you maam are the main reason racism still exist!","commenter_a":"Had to be white. He should of been charge with murder","post_message":"Dennis Meers faces 11 months in prison if he fails his probation. His granddaughter Cadence Orcutt died in a November 2015 rollover crash where she was behind the wheel."},{"comment_id":"10152601738206519","commenter_b":"Let The Punk Cops Take Their Licks Like The Chumps They Are !","commenter_a":"They're expressing their displeasure with the Mayor. Suck it up Billy-boy, ypu wanted the job, now take your lumps","post_message":"\"New York police unions’ mini-rebellion against Mayor Bill de Blasio carries anti-democratic undertones, and even a faint odor of right-wing coup...\""},{"comment_id":"1175870485808384","commenter_b":"YES\"","commenter_a":"Obama does not want us to abide with that law. What the hell are you talking about. Where do you get your information at.","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"10154144312645861","commenter_b":"I'm sure they don't assume Christians drink wine and eat tiny pieces of bread for attention, nor insult their robes or any other attire calling it dress up. OR stand up and interrupt their prayers/services when they disagree with it! Freedom of religion, and simple respect...ever heard of it? I hope you don't expect anyone to respect your religion!","commenter_a":"He wanted attention, he wanted to upset people. Someone should tell him his dress is too big for him/her....but not to worry Halloween will be here soon enough, and he can go get a new costume to play dress up in.","post_message":"\"I saw community of people come together and take a stand for what was right.\""},{"comment_id":"10153521099233010","commenter_b":"save your water for your illegal aliens...smfh","commenter_a":"Typical republican: \"entitled\".","post_message":"More than a dozen times, a white truck filled up at a Thousand Oaks hydrant and hauled the water to Selleck’s 60-acre ranch in Westlake Village -- court documents allege."}]
