[{"comment_id":"1184765608230962","commenter_b":"That works too","commenter_a":"Jenni Mahtinez","post_message":"Have you ever wondered how voting in the caucus even works? Because the answer is pretty weird. - Jon Comulada"},{"comment_id":"10154507396141051","commenter_b":"Maybe the kid should go to history class and learn how the evil \"white\" people voted to free the slaves. Oh ya, it was only the republicans who voted that. NOT ONE DEMOCRAT. And maybe he should learn that the flag represents freedom from the brits, For all Americans. If he doesn't like it, maybe he should take a year for some overseas education. Say France maybe.","commenter_a":"Move if you don't like America","post_message":"This teenage boy refused to stand up out of his chair for the Pledge Of Allegiance because, in his words, \"America sucks.\" Here's how his teacher responded."},{"comment_id":"10154260914771130","commenter_b":"@username and she's gonna tell her fake mom too!","commenter_a":"@username and @username this reminds me of some of our students.","post_message":"Boy, bye. 👋"},{"comment_id":"10154083516697541","commenter_b":"She a Dildo lover lol..hahaha","commenter_a":"Hahahahhah! Dildo lover! @username lol","post_message":"Kylie Jenner won't be posting on her own app anymore after an inappropriate message went up without her approval."},{"comment_id":"10153475900679705","commenter_b":"Excuse me, but what kind of a MOTHER leaves her DAUGHTER behind because there's no seat for her?!","commenter_a":"There's very easy way to avoid these things. Don't piss about at the last minute and end up being the last person to check in. Guaranteed a seat on the plane.","post_message":"Unbelievable."},{"comment_id":"470849343105646","commenter_b":"LOL.","commenter_a":"Fucking faggots. Abomination","post_message":"Something amazing just happened for the bakers who refused a gay couple.  Good, we fully support their decision and stand by them.  Should they have been forced to bake for a gay wedding?"},{"comment_id":"10154502608806051","commenter_b":"Shut up","commenter_a":"Chelsea sorry to say don't qualify as woman she is a pig .only flilthy mouth people it would draw to the show . Its isn't either from the species called human the bag she has she took from garbage dump she lives in","post_message":"Chelsea Handler is sparking some serious controversy over what she's holding in her hands outside the White House in this viral picture."}]
