[{"comment_id":"525608654307175","commenter_b":"Have dreams that often come true about other people.","commenter_a":"How do you know if you have a gift? My husband thinks I am a empath... I feel energies but don't know how to interpret them.","post_message":"We LIVE with Theresa Caputo! Send us your questions for the Long Island Medium."},{"comment_id":"10153929324394586","commenter_b":"WAIT WHY DID HE KILL IT ANYWAY WAS IT HIS TO BEGIN WITH IS HE IN JAIL HE NEEDS TO BE FOR ANIMAL ABUSE HAS The Dodo HEARD ABOUT THIS?!? I CANT BELIEVE SUCH AN INNOCENT CREATURE WOULD BE HURT LIKE THIS HUMANS ARE SUCH IDIOTS HE/SHE NEEDS TO BE LOCKED UP IM JUST SO MAD","commenter_a":"Where is the proof that this specific coyote was killed for the fur? I've witnessed coyotes stalking my dogs while they're in the back yard, and I can't have barn cats because the coyotes kill them. The coyotes get closer and closer to my house every chance they get. I'm all for nature taking its course, but you can guarantee I'm going to protect my pets' lives over the life of a coyote. How do you know this coyote didn't just attack a farmers chickens or livestock? How are you so sure this guy executed this specific coyote for the sake of its fur? I don't think you are. Posting graphic videos for awareness is one thing, but posting a graphic video with the wrong facts is nothing but propaganda.","post_message":"WARNING: EXTREMELY HARD TO WATCH.   Coyotes bark just like dogs when they're scared. Even the coyotes killed for fur trim.   CC: Canada Goose   [via Robert Banks]"},{"comment_id":"487160908141156","commenter_b":"Well Boo Fing Whoo you dont Like what she wore . Its Not a Fashion show , and this Women as been through More then I ever Hope you Ball less Lib Media assHoles ever have to go through. Leave her alone.","commenter_a":"Any one that saw the movie must know that we saw just a portion of what This couple meant to each other. We have no idea of what she is going through. Her grief is probably a lot worse than any one can imagine. So do us all a big favor and leave her alone. As far as I'm concerned, it's no bodies business what she wears. I applaud her for honoring him in the way she deams appropriate. He's definitely an AMERICAN HERO. So isn't she. God's Speed to her.","post_message":"Liberals slam Taya Kyle over what she wore, but she's not backing down.  We stand behind the Kyle family 100%. Let's show her our support.  Can we get 20,000 'LIKES' for Taya Kyle?"},{"comment_id":"879451945423561","commenter_b":"The Bimbo queen herself Sarah Palin.","commenter_a":"I hope she doth","post_message":"This is criminal!"},{"comment_id":"10153798584711350","commenter_b":"You need attention like that idiot cutting herself.","commenter_a":"She's trying to commit suicide by cutting her upper arm. She's an idiot. A bridge or high building is what she needs to do. Cutting her arm is just a cry for attention.","post_message":" a teenager is hard, school sucks, parents are lame but life has so much to give you.\""},{"comment_id":"450484615139832","commenter_b":"Who give dam who she is jealous hater","commenter_a":"He sucks period!","post_message":"White House panicked..."},{"comment_id":"1734065923549548","commenter_b":"This is exactly why we shouldn't have zoo's . So that dumb mf could have been eaten. Probably would have fed a family of little lion cubs. Too bad it's a shame . Literally shot the lions for doing something completely natural smh","commenter_a":"I would have let him be eaten","post_message":"Poor lions :( Note: people suggesting that the keepers should have let the man be eaten will be banned. Mental illness is not a joke."}]
