[{"comment_id":"10153035284712434","commenter_b":"Go move to syria ...bitch","commenter_a":"It is inhuman to turn these people away. The terror experienced in Paris for one night is what they go through on a day to day basis and you want to send them away? Have some empathy, what if it was you and your child fleeing this barbarism? Turning them away is no better than away Jewish refugees during WW2 (see SS St. Louis). How anyone can see their suffering and simply ignore it or tell them to leave defies any and all tenants of a Christian faith, humanity, and what America stands for.","post_message":"How very Christian of them."},{"comment_id":"10152719503449117","commenter_b":"Don't these pigs have any REAL criminals to hunt down???","commenter_a":"Boy that's a basket of snarls","post_message":"Why the sex lives of teens should be subject to school discipline is suspect enough, but it's extra perplexing what interest the government has in such matters."},{"comment_id":"10153210976889726","commenter_b":"The love affair begins","commenter_a":"How much are the promises he made going to cost us this time?","post_message":"WATCH: Obama and Castro sit side by side!"},{"comment_id":"1795134364108592","commenter_b":"Lock them up! Bunch of crybabies","commenter_a":"Pull out a bull whip and whip these bitches","post_message":"FOX 12's Mega Sugianto is live as protesters march for a fifth night in downtown Portland."},{"comment_id":"626166684240577","commenter_b":"She is a idiot ass","commenter_a":"She always does that is why nobody watches the show the POS is on.","post_message":"Whoopi Goldberg made a sad attempt to play the race card, big mistake. What liberal filth. She needs to be taken off TV. Are you tired of liberal trash polluting the media?"},{"comment_id":"675938265864099","commenter_b":"@username you wish your wife could be a go go dancer.","commenter_a":"Melania is an absolutely classic beauty. Proud of our new President and First Lady. May this country start healing and become whole again.","post_message":"Donald J. Trump was just sworn in as the 45th President of the United States.   How does this make you feel?"},{"comment_id":"10153450761424024","commenter_b":"blacks kill more blacks than any other race in this nation...but their little jungle minds don't see that !","commenter_a":"we don't want you because your dragging your diapers all over town. Get rid of the load, then we'll talk Leroy","post_message":""}]
