[{"comment_id":"10153212325922293","commenter_b":"Throw her off a tall skyscraper. She can't be rehabbed in jail. Ease the tax payers burden.","commenter_a":"Pure evil!","post_message":"“[If the police] read my messages with him I’m done. His family will hate me and I can go to jail.”"},{"comment_id":"10153325338244342","commenter_b":"Stfu Lilia Jimrnez....you dumb woman","commenter_a":"So are we going to start killing police, getting revenge and causing a war in our country? Or are we actually going to try and solve these problems between police and the people they are supposed to be trusted to protect.","post_message":"Hundreds of people are expected to attend a prayer walk slated for Sunday night in northwest Harris County to remember Harris County Deputy Darren Goforth. #abc13"},{"comment_id":"10156681132085354","commenter_b":"They could have a no-gravity policy, that wouldn't be real either. There are no gun-free zones in Oregon. The end.","commenter_a":"@username lies to low-information conservatives: Umpqua Community College was not a gun-free zone. No college policy overrode state law. There were students present that day with concealed weapons. The right perpetuates this lie because the truth undermines their \"it's always a gun-free zone!!\" narrative. @webpagelink","post_message":"Do YOU live in one of these 8 states? **Is #6 a little surprising?"},{"comment_id":"10156651164980551","commenter_b":"Dame this women looks alot like Natily wood","commenter_a":"Mine, too!","post_message":""},{"comment_id":"10152908269848855","commenter_b":"That isn't how lesbians do it.","commenter_a":"more and more promotion of sodomy","post_message":"Hooray!"},{"comment_id":"987021391354390","commenter_b":"@username: Once again, you can argue all you want day in, day out. And guess what will happen? The ongoing trend. It get's worse and worse year after year. The debt keeps climbing, yet some have their blind folders on like they can't see this way of thinking, and the economy is constantly nose diving, we are constantly going further and further in debt. Another fact, we in the South are tired of pressing 1 to listen to English while we live in America. If Hillary had it her way before she goes to jail, the mid-west and North would be in the same situation after she let them flood in and gives them drivers license, you too would be having to Dial 1, every single time you want to hear English. Think it wouldn't bother you? Think again, you'll question whether you are really living in America. After-all these ...","commenter_a":"Raise Minimum Wages - Put Small Businesses Out of Business, Take Jobs from Americans. Allow immigrants to flood the country, give them drivers licenses, and take jobs from Americans. Oppose the pipeline, Take Americans jobs. Do away with energy companies, Take Americans jobs. \"Hello, I'm @username, the hypocrite, I promise Americans jobs!\"","post_message":"Time to invest in a clean energy future—not build a pipeline to carry our continent's dirtiest fuel across the US. I oppose Keystone XL. -H"},{"comment_id":"10153127710904726","commenter_b":"This woman is as stupid as she is ugly!","commenter_a":"Brilliant question.","post_message":"WATCH: State Department is called out: Why Have Russian Hackers Seen More Emails Than American Public?"}]
