[{"comment_id":"717073721816539","commenter_b":"She is nothing but a bitch and a liar.","commenter_a":"Hillary for Prison 2016","post_message":"Hillary tried to damage Trump’s reputation by spreading this rumor. She is disgusting. Comment ‘yes’ if you think Hillary should be punished. Can we get 30,000 ‘LIKES’ for Donald Trump? [VIDEO]"},{"comment_id":"612643332237670","commenter_b":"It's really crazy that some men are coming up with more excuses for this kid","commenter_a":"What, now alcohol is being used as an excuse to rape a girl. People still know right from wrong, drunk or not. Rape is illegal. Justice needs to be served. Disbar that judge, also.","post_message":"The judge, also a Stanford alum, noted that the defendant was intoxicated at the time of the assault."},{"comment_id":"10156091938520231","commenter_b":"he will hurt New Jersey to get Black woman","commenter_a":"I think they better do it remember what happen at Fort lee Christie did not get his way things was crazy!!!!!!","post_message":"Gov. Christie says Assata Shakur has to \"face justice.\""},{"comment_id":"10152817930862169","commenter_b":"Because vaccines are no longer mandatory and with all the immigrants coming into the country are bringing the diseases and worse into America. And our govt doesn't give a crap.","commenter_a":"bandwagon idiocy","post_message":"Tonight on FRONTLINE: How the Disneyland measles outbreak has redrawn the battle lines in the bitter vaccine war. @webpagelink See it at 10/9c"},{"comment_id":"10152885774891130","commenter_b":"Someone needs to tell that to most of today's feminists","commenter_a":"True Feminism exhibits equality. Real Feminists are not extremists seeking to belittle others. Liberal or conservative politics have nothing to do with that. Real Feminism exists on a daily basis through all walks of life. It incorporates normal women rising to challenges at work, at home, and in their communities, who expect equal treatment and equal compensation. It's sad that people can be so ignorant to this definition and can only judge radicalism with radical judgement.","post_message":"Long before feminism was a Hollywood buzzword, these films were way before their time."},{"comment_id":"10155964895995354","commenter_b":"Dumb ass bitches is right on!","commenter_a":"All you dumb ass bitches on the view.. Trump isn't against Latino's. He's not asking for Latino's to be thrown out of the country. He wants illegal immigration stopped. Kelly Osbourne is a racist. Imagine if Donald Trump had said that!!","post_message":"Here's what Hollywood really thinks of minorities... And one of the View's co-hosts is Latina! WATCH how well she takes it in this video:"},{"comment_id":"10153200811382377","commenter_b":"I'll agree with you on that , but it still doesn't change my position on accepting unvetted refugees !","commenter_a":"So he just declared the Obama administration a terrorist group then !!","post_message":"British Prime Minister David Cameron: \"The Muslim Brotherhood is not the only movement that promotes values which appear intolerant of equality and freedom of faith and belief.\""}]
