[{"comment_id":"530303733802764","commenter_b":"Today is your Birthday? Well, then Happy Birthday!!!","commenter_a":"Happy birthday! God bless","post_message":"My birthday wish is that our nation would once again recognize God as our leader."},{"comment_id":"1082185285137594","commenter_b":"She dropped the dollar sign a long time ago. Its just Kesha now","commenter_a":"I'm telling you, all she has to do is use a different name. Use an S instead of a dollar sign or something. Prince did it in the early 90's when he figured out the labels were raping artists and wouldn't release him from his contract.","post_message":"The Bleachers and Fun. member is joining collaborator Taylor Swift and actually doing something to help. #FreeKesha"},{"comment_id":"10152845458146336","commenter_b":"you must be of yourr meds you moronic female","commenter_a":"A million and a half babies aborted each year in the United States and we are horrified by this?","post_message":"Zookeepers were horrified to discover 5-week-old cubs had been killed and eaten by their mother."},{"comment_id":"911829685530326","commenter_b":"She is a pig!!","commenter_a":"Sickening!","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"10153986223919087","commenter_b":"Trump is NOT a BS. Let's make America GREAT and SAFE again. Hillary is a liars just want the votes from the black and illegal immigrants. She just say whatever you all want to hear to get your votes. WAKE UP AMERICA!! US Citizen. Love USA!! Go Trump 2016 !!!","commenter_a":"Let's make America great again!.Hillary is a liars. We are people choice, love this name. His name is Donald Trump 2016.","post_message":"#BREAKING: “I will not be voting for Donald Trump for president,” Republican Sen. Susan Collins announced Monday."},{"comment_id":"988569754496111","commenter_b":"Wow, get jobs? because we kill all the whales every year","commenter_a":"I have no respect for the tribe. Why don't they get jobs and stop killing all the whales.","post_message":"The public weighed in tonight on whether the Makah Tribe should be allowed to hunt gray whales again >> @webpagelink"},{"comment_id":"10152692455750950","commenter_b":"Bullshit...gay people are a disease and should be eradicated....I say we boil them alive in acid","commenter_a":"these people are a minority forcing their perversion on everyone else. So when are the pedophiles and rapist going to start marching too","post_message":"LGBT groups march in Boston St. Patrick's Day parade @webpagelink"}]
