[{"comment_id":"10153205504771336","commenter_b":"You need to get the Fffff out there's you are useless Lady or what ever you are. You are a disgrace.","commenter_a":"Recall this mayor!","post_message":"“I never said, nor would I ever say, that we are giving people space to destroy our city. So my words should not be twisted.” Mayor Stephanie Rawlings-Blake spoke to reporters moments ago amid growing violence and chaos tonight in #Baltimore."},{"comment_id":"10154457609673812","commenter_b":"#RIP @MuhammadAli #MuhammadAli #TheGreatest @webpagelink","commenter_a":"RIP and praying for your family","post_message":"BREAKING: Boxing legend Muhammad Ali has passed away at age 74, according to family spokesperson. @webpagelink"},{"comment_id":"1324204954284728","commenter_b":"This is the future of the Democratic Party. She's sick .","commenter_a":"Thank goodness she got what she deserved.","post_message":"While out preaching on the sidewalk, a man was shocked to see a woman quickly approaching. Unfortunately, things would take a horrifying turn as the vile woman pulled something from between her legs and decided to gift him with it – but she wouldn’t be laughing just a few short days later. @webpagelink"},{"comment_id":"405363642956925","commenter_b":"Bitches can try","commenter_a":"Come bring that b.s. this way I'm ready","post_message":"The video is titled \"A Message Signed With Blood to the Nation of the Cross.\""},{"comment_id":"10154534078174445","commenter_b":"I know. Is that close to where you live? It's scary","commenter_a":"Sharon Leahy-Lind Elizabeth Lind","post_message":"Imagine you're enjoying a day in the woods, walking down a trail when you see THIS: a large snakeskin. @webpagelink"},{"comment_id":"10152785786292434","commenter_b":"All women can give you something. A headache, an empty wallet, herpes etc.","commenter_a":"Everyone has chlamydia. But Norway's a nice place to catch it.","post_message":"Well it certainly got my attention."},{"comment_id":"998442540272524","commenter_b":"She is bought and paid for and if she's president what happens then?","commenter_a":"She's a crook and lies about where money comes from and buys the illegal immigrants vote","post_message":"By the way, it ILLEGAL for foreign nations to influence the outcome of an election. Just so you know. @webpagelink"}]
