[{"comment_id":"10154084901793837","commenter_b":"How horrible to be treated like that. I hope she gets fired.","commenter_a":"Wtf is wrong with these people ..","post_message":"QUESTIONABLE TSA TREATMENT? A woman diagnosed with breast cancer says she was humiliated by TSA during a recent security check. Hear what she has to say about the ordeal."},{"comment_id":"10152981521492235","commenter_b":"Surpising?! I think not.","commenter_a":"No surprises here. The sad thing is so many of today's Democrats and Republicans choose to ignore their party's histories and instead make excuses for it - such as saying because things happened years ago it was acceptable.","post_message":"What these presidents said in private and what they did in public were often sharply at odds."},{"comment_id":"1455415254518218","commenter_b":"Define \"innocent\", please. Then I will explain to you the meaning of \"idiot\"","commenter_a":"The problem is that the conservative corporate controlled media has turned the conversation away from the police killing unarmed innocent citizens to this nonsense about kaepernick not standing. Where is the outrage against the police killing hundreds of innocent people?","post_message":"Megan Rapinoe said it was an intentional move to support 49ers' Colin Kaepernick"},{"comment_id":"676882525784251","commenter_b":"STOP IT !","commenter_a":"When did this actually happen? Yikes...............","post_message":"An oil spill the size of Manhattan is devastating the Gulf of Mexico, and nobody's talking about it. #MicBrights"},{"comment_id":"10153859214957169","commenter_b":"Should Donald Trump become President,what he has in mind to do,will go over Congress first","commenter_a":"All the blame on the \"current administration\" ignores that both the house and senate are republican...and they control (or obstruct) a major part of what happens in this country. Tho there is some opportunity for a president to make executive orders, it is a limited power. So our votes for our state reps and congress will carry a lot more weight. Just sayin'.","post_message":"Here's a look at some of the Republican presidential candidate's claims and how they compare with the facts (From PBS NewsHour)"},{"comment_id":"598083523681641","commenter_b":"She really shouldn't enter into a battle of wits unarmed!!","commenter_a":"Right... because Mechanical Engineering has nothing to do with science..... *rolls eyes*","post_message":"-_-"},{"comment_id":"895356030506185","commenter_b":"Saudees R disgusting devils.","commenter_a":"Saudi regime should be removed out of power and kicked out of the country.","post_message":"What do you expect of the #Saudi aggression against #Yemen? Raise your voice by taking part in our poll: www.presstv.ir"}]
