[{"comment_id":"10154126843971254","commenter_b":"Yeah what ever and if the western woman didn't she'd be killed Mu idiots","commenter_a":"If a muslim man approached a western non muslim woman in the middle east and threw a niqab on her asking to wear it because she is in their country it would have went viral and all muslim would have been accused as extremists. We live in a world full of contradictions.","post_message":"'Our Britain, you live by our f****** rules'"},{"comment_id":"10153602111881336","commenter_b":"No Obama already congratulated them.","commenter_a":"Obama will probably prosecute them.","post_message":"Three Americans are being hailed as heroes today for tackling and disarming a gunman on a high-speed train traveling between Amsterdam and Paris."},{"comment_id":"1790704097809032","commenter_b":"Pssst when's the last time the KKK has assassinated a cop in the streets? When's the last time the KKK burned down and looted their own towns? Who do you think BLM are voting for? Btw, do a Google search of who created the KKK. Democrats. Who freed the slaves? Republicans. Who passed a law allowing blacks to vote? Republicans. Who's the only candidate that voted against Civil rights? Hillary when she was a Goldwater.","commenter_a":"Yes. Except it is his supporters who are the real embarrassment. Buying into the lies of this conman. Feeling empowered, the violent white national (KKK) movement is showing itself in daylight. Embarrassment is not a powerful enough word.","post_message":"Yep.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1041548139262556","commenter_b":"I applaud those who came to discuss the matter at hand. To those who just want to attack me...lmao you have to do so much better than pulling your \"trump\" card","commenter_a":"Good. Maybe the Republican Party can stop killing our soldiers and blaming it on Hilary","post_message":"\"I'm worried that I will be the last Republican president,\" said Former President George W. Bush"},{"comment_id":"10153237393021350","commenter_b":"Great idea but this lady ain't fat...","commenter_a":"You look fantastic!!","post_message":"This mom has become a swimsuit role model."},{"comment_id":"548837575304535","commenter_b":"Bill Clinton could get away with anything.....all Hillary has ever cared about is \"power\". God forbid her from being President.","commenter_a":"Butch and Billy Americas First family good replacement for the Kennedys","post_message":"They can't cover this one up!"},{"comment_id":"496533153870598","commenter_b":"We will never submit to Islam! Go fuck another goat!","commenter_a":"How do you really know that @username...you have documentation to explain here to that right wingers are like muslims??? Haven't seen a right winger decapitate anyone yet...or did i miss one?? Are right wingers now involved in terror plots against America and are they sneeking into third world muslim countries and blowing people up?? Man!!! I must have missed all the headlines...sure glad you brought us up to page on this!!!","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"}]
