[{"comment_id":"1053358344760417","commenter_b":"shut our borders to any and all refugees ! whats wrong with you ?","commenter_a":"I'm seeing some really terrified Americans making terrible accusations about Syrian refugees .. people who are fleeing from terrorism themselves. I'm finding your people somewhat heartless and they sound from my perspective to be violent and racist themselves... No different in fact than the terrorists that have become their perpetrators. This is what fear does to people.. Aggressive behaviour .. We are so much more than this. I felt so sad when I read the response to Obamas humanitarian speech. So sad that you people have such fear and hatred inside you. This attitude of hatred and intolerance against people you don't even know personally will never make a better world. It just perpetuates the same old story. I feel Sad. Very very sad today.","post_message":"\"Many of these refugees are the victims of terrorism themselves – that's what they're fleeing. Slamming the door in their faces would be a betrayal of our values.\"  - President Obama  Watch more here: @webpagelink"},{"comment_id":"10154959360378812","commenter_b":"She's a nasty nasty woman","commenter_a":"charge her for what.......whats the charge...stop interfering in the election......","post_message":"Congressman Bob Goodlatte: FBI – Federal Bureau of Investigation Director James Comey \"very conscious of the controversy\" within the bureau over decision not to charge Hillary Clinton. @webpagelink #thisweek"},{"comment_id":"10153903054649753","commenter_b":"good ...she needs you to buy a ticket....unless she has already been forced to cancel all...","commenter_a":"of course she loves him....who ever heard of her before Blake....her new on tour being canceled for lack of sales suprise?????","post_message":"Blake Shelton started his 40th birthday celebrations with a cute note from Gwen Stefani. “Happy birthday to my favorite person I ever met @blakeshelton,” Stefani posted on Twitter. According to People, Stefani and Shelton’s PDA didn’t stop there. Stefani went on to share several messages to Shelton on Twitter and even changed her avatar to a photo of her country boyfriend. On Instagram, Stefani shared a photo of Shelton as a kid with the caption: “Happy birthday to @blakeshelton literally my... @webpagelink"},{"comment_id":"10152931610594270","commenter_b":"He has to be doing this just to make me look like a saint.","commenter_a":"West Point grad and comissioned Officer - apology not good enough. Gotta go. If he could ly about something as serious as Valor what else can he lie about?","post_message":""},{"comment_id":"10153573375216509","commenter_b":"Take away her license and fine/jail her","commenter_a":"Very cruel person","post_message":"A Texas veterinarian posted a proud photo to Facebook of herself smiling as she dangled the limp body of a cat she allegedly shot with an arrow. The vet said it was a feral tomcat. People who saw the post were outraged. Now, animal rights activists are pushing for charges.  @webpagelink"},{"comment_id":"1436806433003369","commenter_b":"@username Your vagina is showing....","commenter_a":"#NeverHillary #DNCLeaks #DemExit #StillSanders","post_message":""},{"comment_id":"891542370901815","commenter_b":"Behead the shitbag goat fuckers","commenter_a":"Hehehe","post_message":""}]
