[{"comment_id":"1090368724307930","commenter_b":"Women fought for many, many decades for the right to vote.","commenter_a":"Yay, and now we will get to vote in an awesome woman as president!","post_message":"The United States is 239 years old. Women have been able to vote for only 95 of those years."},{"comment_id":"10154355616737293","commenter_b":"He deserves a bullet.","commenter_a":"He looks like Gov. Christie","post_message":"The gruesome revelations are a stark contrast to Kohlhepp’s professional image. But details from his childhood hint at a deeply troubled individual."},{"comment_id":"10153477021199087","commenter_b":"Needle dick","commenter_a":"What will Obama give them for his release?","post_message":"#BREAKING: North Korea announced Friday that it had arrested an American student for allegedly carrying out \"hostile acts\" against Pyongyang."},{"comment_id":"10152709124101545","commenter_b":"And a healthy sex life;) lol love u baby!!!","commenter_a":"Me and @username have been married 13 years.... Trust, communication, honesty, & endless love... Agree on things, if you don't, work it out. Don't keep money from each other, if your having problems sit down and go over your financial obligations. Set a budget. Go to parent conferences together to understand your child's growth and development ... That simple","post_message":"Do you know the secret to a long and happy marriage? We want to hear from couples who’ve been married 25 years or longer to get advice on making it work. Comment below, and we may reach out to you for an interview."},{"comment_id":"10154376040464641","commenter_b":"making of The Taken 3 (Must watch Unbelievable) @webpagelink","commenter_a":"That's what we should be doing focusing on the dummies in the audience, the cockroaches","post_message":"Donald J. Trump's controversial \"Second Amendment people\" comment made Darrell Vickers' bearded jaw drop."},{"comment_id":"10153487180410667","commenter_b":"@username this couldve been you","commenter_a":"Outstanding young man and a very generous \"Thor \"","post_message":"\"I looked up at my mom and was like, 'ma, do you know who this is?'\""},{"comment_id":"1669026716715370","commenter_b":"You can not close borders. People can fly here, come on boats and come via Canada or Mexico. The president has deported more illegals than any other president. Frankly the wealthy prefer to hire illegals to watch their children, clean and build their homes and other jobs because they do not want to pay minimum wages and want them to work as slaves in the farms, restaurants and factories. Put the blame where it belongs, on the 5%ers that are reaping the benefits of immigrants. They get you passed at the victims rather than themselves. If you want change you have to vote for someone brave enough to address the issues and actually formulate and execute a plan. Perhaps Bernie who actually addresses the issue. Voting for billionaires backed by the 5% will not resolve any issues.","commenter_a":"Obama better back off, he is allready in it for Treason","post_message":"Franklin Graham just delivered a MASSIVE message to Obama and the left about jihad and what it means for America... liberals are furious, but over 100,000 people have \"liked\" what he said on Facebook. Do you agree with Rev. Graham?"}]
