[{"comment_id":"10153507149617452","commenter_b":"Your so dumb @username. Get ready to go back to Mexico or Cuba or wherever u from. Smh","commenter_a":"you idiots still voting for Trump. Smh","post_message":"New York Primary: Donald Trump and Hillary Clinton have won their parties' primaries in New York."},{"comment_id":"10154156442975443","commenter_b":"We did trust remember all Far East and then look what happened American trained Far East pilots flew their planes into our building now because of ISIS we need to take measures don't take all this personal and if ISIs does get in who will be at fault well oh a big war and then how will you feel this is what happened we are too trusting this has nothing to do with RACE do you all have better way to stop this","commenter_a":"One brave Judge saved Muslims from being discriminated against contrary to the constitution. We really need some brave republican congressmen to save America from heading into disaster by stopping this man making hate and racism a normal thing. What we have seen so far and just today banning CNN and The New York times is no joking mater.","post_message":"\"The situation seems to be pretty bad after Trump took over as the U.S. president.\""},{"comment_id":"10152982403506051","commenter_b":"Good grief....is she for real? She willingly showed up at his house to engage in sex with whom she was gullible enough to think was a male model... Really?????????? She DOESN'T have a leg to stand on in court... STUPID does as STUPID is...smh","commenter_a":"She had to be incredibly stupid and he is a douchebag","post_message":"A woman thought she had been chatting online with this man. They met in a dark hotel room and she wore a blindfold while they got intimate. When she took it off, she saw someone she wasn't expecting."},{"comment_id":"1733106183573180","commenter_b":"Liar, murderer and thief! Hang that bitch.","commenter_a":"She is such a P.O.S. lol, if there is nothing to hide then why not release them, it's ridiculous! No one is asking for others transcripts, just her's because she is a proven liar...anyone supporting this woman needs to really see the truth and stop denying what she really is.","post_message":"During last night's debate, CNN moderator asked Hillary three times why she won't release transcripts of her speeches to Wall Street banks if there's nothing that she's trying to hide from voters. Do you think Hillary Clinton is hiding something in those speeches?"},{"comment_id":"1048277701893900","commenter_b":"@username We have the highest number of legal immigrants per year in the whole world!","commenter_a":"I know this is going to be unpopular, but I know many Hispanics who agree with me. There is a legal way to come to the country, and contrary to some of the attacks I have seen on other posts, it does affect our low income Black, Hispanic, and White communities. They are used to a more extreme poverty, so they are willing to work for less than minimum wage, and are off the books, so taxes, SS are not paid. This means an American citizen or legal immigrant is denied a job. When so many of our jobs are being sent to Mexico, China, India how can we not address the issue of those who came here illegally. My nephew's wife is from Mexico. 2 of my nephews have dual citizenship. US/Brazil. I am far from racist or anti-immigration, but our own citizens and legal immigrants are suffering. We ...","post_message":"This week the media reported something that I find not just wrong, but inhumane: President Obama is currently planning \"a month-long series of raids in May and June to deport hundreds of Central American mothers and children\" who came to our country fleeing that same violence. Sending women and children back into harm's way after they already fled horrendous violence in Central America is painful and inhumane, and must be stopped. Sign my petition asking President Obama to stop these raids and to make sure that families fleeing violence in Central America are protected from deportation."},{"comment_id":"1000377376688677","commenter_b":"Just stay the hell out of America...we don't need your crap here.......Stay in your own country......These buttwipes are allowed to do this in their country, so go home and do what you want, keep it out of America!!!!!!","commenter_a":"1. First the US gov attacks its own people on 9.11 in false flag operation 2. They blame the attack on Osama Bin Ladin, a fictitious character created by the CIA and played by several actors. 3. The US makes war on two countries using false pretexts for war, both times. 4. The US uses drones to kill \"terrorists\" which include many innocent Islamic peoples 5. The US gov pretends to kill OBL as some kind of fake victory. Obviously, they cannot allow the remains to be scrutinised so they jetison it at sea and take no photographs either. All lies. 6. The US War on Terror is very similar to the Crusades where four centuries of young Christian men were lied to by the Pope and told to go brutalise and savagely attack innocent Saracens who were safeguarding the Holy sites in Palestine 7. In the US, whites kill ...","post_message":"And he wanted to take a second wife 'because it was allowed under Islamic law'"},{"comment_id":"10153842022041336","commenter_b":"@username. You are a blooming idiot fool!!","commenter_a":"Too egotistical! He will never resign but, he will go down in history as the most Anti-American and incompetent man ever to reside in Our White House without doubt!!","post_message":"“We are in World War III,” Michael Goodwin said on 'The Real Story.' “And if America is not going to lead, who is?”"}]
