[{"comment_id":"1041072545948147","commenter_b":"You look like a witch already","commenter_a":"this the third post i've seen with this baby and all the \"after\" babies are different babies...the jig is up!!! i'm starting to suspect the witchcraft claim is true...this baby has changed to even 3 different complexions and facial features or somebody has nothing to do by come up with lies to make themselves feel righteous!!!!","post_message":"A little positivity out of a horrible situation 🙏 Baby Hope, who was found starving on a street in Nigeria after he was abandoned by his family over accusations of witchcraft, makes extraordinary improvements since he was helped by Danish aid Anja Ringgren Lovén."},{"comment_id":"10154075378206336","commenter_b":"@username that's not the law u ding bat.For years the law has been if Cubans can make it here they can stay. They were running to get away from the tyrant and then Castro when he took over. They do not run a cross our boarders. They come by boat through Florida. So as soon as Cubans arrive they are legal","commenter_a":"What an absolute Jerk. The Republican Obama. Clown Prince Trump.","post_message":"Donald J. Trump said he didn’t know if Marco Rubio was eligible to run for president and that “the lawyers have to determine that.”"},{"comment_id":"10153511380259641","commenter_b":"I can't believe some of the comments here - So much hate {that's not justified} :/","commenter_a":"RIP the old England, lost to Islam now.","post_message":"#TBT:"},{"comment_id":"1854344181462778","commenter_b":"Trump!!! Build that wall!!!","commenter_a":"This time they'll just say \"we need to stop this black on black crime\"","post_message":"WARNING: This video is graphic and may be upsetting to some viewers. @webpagelink Officials released surveillance footage showing a violent takedown by an officer on a train platform in Houston. The officer resigned and authorities said the investigation was still ongoing."},{"comment_id":"939125846176797","commenter_b":"@username - absolutely, only 2 children & no marriages in what 8 years - that's actually fewer children that I would expect. She MUST have been using birth control.","commenter_a":"The audacity of this woman is amazing. She preaches abstinence, and criticizes women and girls for being irresponsible, all the while doing whatever the hell she pleases. I think having to pay child support is small potatoes compared to her hypocrisy. Karma will get you sooner or later. Pay up Bristol, it's your turn.","post_message":"Bristol Palin brought this upon herself. After all, she could have just practiced what she preached. Now, it's her turn to take responsibility."},{"comment_id":"1552538175033296","commenter_b":"bitch i had to work and my husband had to work get off your fcking ass bitch and nobody needs 15 kids that doesnt have a job thats why this fcking foodstamps got to stop","commenter_a":"GET A JOB LOSER !!!","post_message":"This is why we need LESS welfare handouts."},{"comment_id":"533141560209757","commenter_b":"Brainwashed stupid women!!!!!!!","commenter_a":"Let them go back to the country they came from if they want to wear their Burkas","post_message":"This Muslim woman refused to remove her veil, then something awesome happened. Good. There's no room for fanatical Islamic culture in the US. Do you support a Burka ban?"}]
