[{"comment_id":"10154808382292235","commenter_b":"What about Ted (Shit my pants draft dodger) Nugent? He can play his one and only hit about pussy grabbing.","commenter_a":"Ted will need to wear a diaper","post_message":"Looks like it's just Ted Nugent and Kanye."},{"comment_id":"777290672402535","commenter_b":"She is a whiny bitch","commenter_a":"Yes","post_message":"Megyn Kelly Stabs Fellow Fox News Stars In The Back, This Is Horrible   She should be ashamed of herself.  Do you think Megyn Kelly should be fired?"},{"comment_id":"10154335459871509","commenter_b":"Bret, insults show a lack of intelligence, but continue.","commenter_a":"10 Reasons for Supporting Trump 1. Donald Trump is immune to special interest lobbying because he has accepted no donations or special interest money. No other candidate can make this claim. 2. Trump knows how to negotiate. No one builds an international business empire the size of Trump without being able to win at the negotiating table. 3. Donald Trump is an executive. The President of the United States is the Chief Executive Officer of our nation. We don need a policy expert or a legislator we need someone who knows how to run an organization. Trump is the only candidate who has a proven record as a successful executive on a large scale. 4. Trump is a man who tells the truth. He may not always say it in the most polished way, but our country has had enough suave liars. It is time for some straight forward honesty. ...","post_message":"Emotional scenes at Vancouver airport."},{"comment_id":"10157270600175389","commenter_b":"Wow... she sure lost her dreadlocks for her 10 minutes on Hannity didn't she!","commenter_a":"Love how she went from braids to foxy diva afro overnight. That's all I got from her. Yawn.","post_message":"\"I don't believe in any cause that takes innocent lives, regardless of what that cause is.\"  Former Miss Alabama Kalyn Chapman James, who referred to the Dallas shooter as a \"martyr\" in a now-viral video, said she believes Micah Johnson thought he was dying for a cause, but was \"evil.\""},{"comment_id":"10153724551069641","commenter_b":"I remember years ago being in Saudi and Riyadh was lit up like Vegas and I thought this place could be nice after all.the reality came a few days later when walking down a shopping mall with some other guys and some women who were covered were heading in our direction .They made a miniscule mistake of revealing the smalles amount of leg.Out of nowhere came the \"Religious police\",who started flogging them with sticks for this horrendous \" crime\",.The reality of the country set in for how women are treat and this was one of the many mistreatments of people in general i saw.The dark ages is what describes the country .if that is what helps to eventually lead you to heaven i am glad i am going to Hell!Though back then i had an early insight into it.","commenter_a":"Let them vote, drive and have some say so, that is more powerful than anything you could give them.","post_message":"How significant is this change for Saudi women?"},{"comment_id":"10154201657127541","commenter_b":"White terrorists","commenter_a":"When we figure out that words isn't going to change minds of white people best believe if they knew there would be retaliation then they will think twice.","post_message":"Because federal terrorism statutes almost exclusively focus on foreign extremists, he won't face terrorism charges, but he could face 10 years in prison."},{"comment_id":"509555075871545","commenter_b":"We will never stop fighting for animals! <3","commenter_a":"OMG ! Enough already ! So very very sad...Cruelty to these animals is dead wrong wrong wrong. Aaron for putting this out there for all to see ! Thanks Keep showing everything you can. You are doing important work. This is your real work here on the planet '","post_message":"It takes the feathers of approximately 75 birds who go through THIS to make ONE down comforter.  It's 2016. There is no excuse for this."}]
