[{"comment_id":"1135270439841709","commenter_b":"George is just another Clinton Whore!!!!","commenter_a":"clinton news network at it again","post_message":"Donald Trump destroys the liberal media! (WATCH)"},{"comment_id":"10153906415276545","commenter_b":"'@username You are correct, we have plenty of citizens/legal residents committing crimes we don't need those who aren't supposed to be here in the first place compounding the problem. It is time for sanctuary cities to end. Either you are part of the U.S. and adhere to U.S. law which should be enforced or you secede.","commenter_a":"Is this guy a legal citizen?","post_message":"Laura Ostteen took a hit so hard that it hurts to see. All because of a 5 a.m. run for milk to a convenience store as the city of Dallas sees increase in violent attacks."},{"comment_id":"635288009979398","commenter_b":"How silly. Some people will sign anything.","commenter_a":"idiot","post_message":"An online petition to remove all air conditioning from Department of State property has gotten more than 1,800 signatures since it was posted online Sunday."},{"comment_id":"10153569563806051","commenter_b":"They should be sent back where they came from ASAP !!! End of that story !!!","commenter_a":"Please do some research. What does your state actually offer in the way of public assistance to noncitizens? In California noncitizens are not eligible to cash assistance or Calfresh (foodstamps). No Social Security or Medicare without legal residency. So just what are you haters talking about? I hope none of you ever find yourselves in a financial situation which would drive you away from your home in order to survive. I hope you don't call yourself 'Christians' because you are so far from the core of that belief.","post_message":"Should illegal immigrants be banned from receiving Obamacare subsidies? That was far from the case in 2015."},{"comment_id":"2029120557147682","commenter_b":"Thanks, Candice......I didn't know about Cooper.","commenter_a":"I feel badly for the cast of Moonlight! They missed out on having their movie called, and all the fan flair that accompanies an Oscar win! Shame in you PWH!","post_message":"Emma Stone: 'It was one of the most horrible moments of my life'"},{"comment_id":"10153353712173984","commenter_b":"Ugly BASTARD.","commenter_a":"Wow Al really got hammered but Al doesn't care he's laughing all the way to the bank.","post_message":"Wow! One of the top conservatives on the internet just lowered the boom on Sharpton in a big way. Many people were thinking it, but only one had the guts to say it..."},{"comment_id":"663264380530807","commenter_b":"Yes! Disgusting!! Vulgar!!","commenter_a":"Yes,don't wish to see their underwear or ''butts''.keep them covered","post_message":"These thugs were arrested after refusing to pull up their pants.  Hilarious. Let's make this a law, who agrees?  Should excessive sagging be illegal?"}]
