[{"comment_id":"1023792714394917","commenter_b":"We already lost it! We've gone backwards for the last 7 years and all that's happened is the Tory Party and it's mates busy enriching themselves from National and Taxpayer assets.","commenter_a":"I worked since I was 14 - paid my share and I say out ! All us pensioners have paid in - but David Cameron wants to open the borders to any one and give them all free hand outs and homes !!! It's not on !!!! We need to stand up for our selfs","post_message":"Britain faces a \"lost decade\" if we vote Leave, says David Cameron. He warned pensioners in particular \"don't risk it\". Is he right? Would leaving the EU really be bad for our pensions? Judge for yourself: @webpagelink"},{"comment_id":"10155005314954062","commenter_b":"@username Gale Adams @username @username Christina Marie 👀😒😔","commenter_a":"Justin Irwin","post_message":"Please be careful to all of our friends in the Conroe area. This was shared by Heather Dungan from Conroe 105 and I45 near Home Depot.  If you encounter high water, turn around. @webpagelink"},{"comment_id":"10152603535532894","commenter_b":"she slept with Jamie Fox, She slept with a fe NBA players. If you go on the internet its all there and on TMZ. She is a whore too","commenter_a":"Greg has his own real estate investments and can stand on his own. Please. Claudia is a whore. She has slept with everyone just like Kenya hoping for a big break. if you start your career on your back you always stay on your back That is a bad practice of sleeping with people to move up. People will never respect you as a woman or a professional like that","post_message":"#RHOA Fans Outraged: NeNe Leakes Hurls 'Half-Breed' Racial Slur at Claudia Jordan [Video]"},{"comment_id":"599509270200252","commenter_b":"THE ALPHA MALE !","commenter_a":"South Carolina here comes TRUMP. Let's work together and get this man elected as President of USA. United we Stand!!","post_message":"Departing New Hampshire with my amazing family! THANK YOU- NEW HAMPSHIRE! Tonight the VOTERS decided. Next stop is South Carolina! I LOVE you ALL & THANK YOU! Together we are GOING TO MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1228973160510939","commenter_b":"Typical liberal lesbian! Walking around with blinders on and not reporting the facts.","commenter_a":"She is the problem and needs to shut her mouth people like her have divided this country so much so sad they let her use what is suppose to be a bias platform to put out all this hate","post_message":"Run for Your Lives! Rachel Maddow is now warning that Donald Trump will definitely round up people and jail political opponents.  Meanwhile, you are accused of being a \"fear monger.\""},{"comment_id":"1333566343323648","commenter_b":"this sow could stand to lose a few pounds.","commenter_a":"That pig in the black shirt ought to be able to hang on for quite a while...","post_message":"When it's all over and they have their ethnic studies degrees in hand, these student activists will never be hungry again."},{"comment_id":"10153936928466130","commenter_b":"Tell his ex wife that. She's the one plastering the photos to every tabloid she can find.","commenter_a":"This is so incredibly none of anyones business--","post_message":"Amber Heard claims she’s the victim of repeated incidences of domestic violence."}]
