[{"comment_id":"842181922581654","commenter_b":"@username If you don't understand \"propagate\" look it up... your ignorant conservative bullshit is EXACTLY why we're debating here... you see, your \"bullshit\" has infected EVERYWHERE............. the terrorists, the refugees, the billions of dollars stripped from pensions, healthcare, education, infrastructure, to support conservative idiots and their dumb-fuckery... you ass-clowns should take ALL the fucking refugees, and house them in the districts of the same fucking idiots that voted for those wars (not the acts that empowered your fuckwit) in the first place. Comprende, dickhead?","commenter_a":"Don't worry ... Kerry is drafting an official apology to Putin right now","post_message":"This is what happens when you don't have a REAL leader in charge....Un-freaking-REAL."},{"comment_id":"1190105204361047","commenter_b":"Hang the bitch!","commenter_a":"Takes time to plan a coronation!!","post_message":"Hillary thinks she's already won. This kind of sick behavior is UNACCEPTABLE in a constitutional republic!"},{"comment_id":"1034762863247926","commenter_b":"She is a super predator","commenter_a":"@username is a strong leader, she is qualified, she is experienced, she is compassionate, has a lot of accomplishments, has been fighting for the equality and human rights her entire career, UNDERSTANDS foreign policy and the EFFECT and OUTCOME of her message domestically and abroad! #IAmWithHillary","post_message":"This country belongs to all of us, not just those at the top—not just the people who look one way, worship one way, or even think one way."},{"comment_id":"10153162975649205","commenter_b":"Assholes","commenter_a":"JAYWALKING noting wong","post_message":"Cops Beat Black Teen For \"Resisting\" His Jaywalking Ticket"},{"comment_id":"916358841790504","commenter_b":"Gee Sara. you really ARE a blonde.","commenter_a":"Even religious organizations support planned parenthood. Your turn, republicans. Now you can't even use your Christian arguments...","post_message":"Fifty-six religious organizations are standing up in support of women's health and rights."},{"comment_id":"933394380031531","commenter_b":"Good girl tell it like it is","commenter_a":"No one should lose their job for honesty","post_message":"Judge Jeanie Could Lose Her Job After Job After Publicly DESTROYING Obama On Live TV [VIDEO]  She just put everything on the line. Let's show her our support.  Can we get 30,000 'LIKES' for Judge Jeanie?"},{"comment_id":"689912921147432","commenter_b":"The left is aligned with the most pathetic in society!","commenter_a":"Very bad Photoshop ! Are you serious?","post_message":"This is really creepy. Look how close he is?"}]
