[{"comment_id":"1765051320401865","commenter_b":"Trump gave a rousing speech to cheers and shouts. Just checked in at Fox programming and all they have is same regurgitated talking heads spouting how bad this last week has been. I'm sick of seeing same boneheads saying same thing EVERY show. ME TV reruns from now on!","commenter_a":"This is what the people want Trump any Republican that does not support him is not supporting the people of America who choose him","post_message":"\"In our shared mission to make America great again, I support and endorse our Speaker of the House, Paul Ryan.\"  Donald J. Trump endorsed Ryan at a rally in Green Bay, while also endorsing John McCain and Kelly Ayotte in their reelection bids, after earlier comments implying he might withhold his support."},{"comment_id":"600892556733313","commenter_b":"She should put in jail with all Males and stay with them 24/7/365","commenter_a":"So not only he is a kid, he is also special needs. And on top of all of this, she is 71 among kids ????! The school should re think abt the age of teachers dealing with kids. In late 30s and a woman can hardly handle her own kids !!!! Shame","post_message":"71-year-old teacher Amelia Stripling was arrested and charged with 2nd degree cruelty to a child after knocking over a pre-K special needs student in Georgia.  @webpagelink"},{"comment_id":"10154595808829445","commenter_b":"Pot head moms, guiding their children. What a joke ........","commenter_a":"Craig Roberts Me as a parent.","post_message":"This mom clearly thought it was high time for the kids to go back to school @webpagelink"},{"comment_id":"554388108092251","commenter_b":"Merry Christmas to you and your family","commenter_a":"GOOD+++","post_message":"May your Christmas be filled with happiness and hope. Let us not forget the women and men overseas protecting our freedom. Merry Christmas from my family to yours."},{"comment_id":"10154208733135969","commenter_b":"Why do they want to protect illegals? Wth what about the citizens","commenter_a":"IAGREE YSE","post_message":"The White House Press Secretary Sean Spicer holds the daily press briefing after President Donald J. Trump met with Intel's CEO about investing in America."},{"comment_id":"10158098604455192","commenter_b":"Awww look at the snowflake. Upset because she can't find the safe room.","commenter_a":"Who really cares what these celebrities think.","post_message":"Streep noted that \"Hollywood\" is a reviled place. But in reviewing the backgrounds of several of her colleagues surrounding her at the Globes, she said that it's really a community filled with people from other places united in the mission to show different people and make audiences feel what they feel."},{"comment_id":"885477798171651","commenter_b":"Get out of here","commenter_a":"The Senate intends to rid this man from his job.","post_message":"(Video) The U.S. Muslim population has vastly increased under the Obama administration and set to continue to do so on an ever increasing scale.  What generally happens to societies as the Muslim population increases?   A work by Dr. Peter Hammond provides some insight...  Read More:  @webpagelink"}]
