[{"comment_id":"10152986192691491","commenter_b":"You're an odd little woman","commenter_a":"Malala is big drama queen , thousand of girl are raped and kill no body knows why malal","post_message":"Malala gunmen secretly set free in Pakistan @webpagelink"},{"comment_id":"10158362932045500","commenter_b":"Her water didn't break yet","commenter_a":"Her water did not break","post_message":"BABY WATCH (10am update): Still no baby giraffe yet! When do you think mom April will give birth at Animal Adventure Park? Don't miss anything: @webpagelink"},{"comment_id":"10153341904559170","commenter_b":"And why haven't you taken responsibility for your actions?","commenter_a":"And why haven't you solved your people's problems yet, Herm? Too busy slangin pizzas and tap dancing for white folks?","post_message":"Deplorable."},{"comment_id":"454178371439410","commenter_b":"Deport all savage backward ass cave dwelling Muslim","commenter_a":"Should ban all muslims completely","post_message":"Should The US Ban Islamic Veils In Public? Comment 'yes' or 'no'."},{"comment_id":"10153293825958132","commenter_b":"Yes, she's milado so she needs to stop.","commenter_a":"She's black and white..so this always confuses me. I guess you can pick your race when it suits you.","post_message":"Halle Berry admits she's \"disappointed\" that no other black women have won the top acting prize."},{"comment_id":"1084748028260016","commenter_b":"@username like they said there would never be a GREAT WALL OF CHINA. There will be a wall!!!!!","commenter_a":"Oh my god, people keep talking about Trump's \"wall\" as if it's an actual thing. It's not a thing. It will never be a thing. It's just a distraction so people don't ask him about real issues that he has no answers for!","post_message":"\"At the start of my conversation with Donald Trump I made it clear that Mexico will not pay for the wall,\" Mexican President Enrique Peña Nieto tweeted in Spanish from his official account."},{"comment_id":"1762485630649940","commenter_b":"In the world of medicine, an incorrect diagnosis could possibly be as good as death. So in this case, yeah. Alternative medicine does kill.","commenter_a":"\"Alternative medicine kills\" what the heck?! It didn't kill her, sure it didn't save her, but it certainly wasn't the cause of her death.","post_message":"Being vaccinated could have saved this child. Being taken to a qualified medical doctor rather than a quack could have saved this child. Alternative medicine kills."}]
