[{"comment_id":"1133405013362371","commenter_b":"She looks that way from years of only having a tiny withered Cheeto to satisfy her","commenter_a":"Why does every picture of Melanie look constipated or disgusted. Her eyes are always squinted, and her lips are always tight. I mean it is not a happy look. This is not a rant because she is female, and it is not a comment on her worth or attractiveness. It is a comment on how people show expression in their face. She doesn't look happy at all.","post_message":"Could you imagine the right-wing reaction if the Obamas did this?"},{"comment_id":"10153588638028203","commenter_b":"Really an evil woman. Whether intentional or not. Please God, open her eyes and heart.","commenter_a":"This one is heading for hell also .","post_message":"Nancy Pelosi: Planned Parenthood videos are a 'distraction' @webpagelink"},{"comment_id":"515071932006619","commenter_b":"you make a good argument eugene. historically the philistines controlled the coast of israel. the jews the interior. but after the romans any historian would agree the jews were not a player in the region. after 2000 years i think the claim of europeans to the region is moot. its like me saying i should have land in ireland taken from my ancestors by the english,or land in france taken by the catholics. its not valid and if the united states funded a military machine to take back those places i think it might be wrong.. prior to world war 2 the jewish population in palestine was a distinct minority. the subjugation of the place by european jews was rubber stamped by the west but never ok with the people of that place or any country near it. israel currently recieves billions from the american taxpayer to operate their apartheid ...","commenter_a":"that mosque was in palestine. europeans invaded the country,committed genocide to steal it and now you sit on a high horse and judge the indigenous people it was stolen from because you are ignorant of history or a hypocritical shill.","post_message":"Such extremism isn’t limited to out-of-the-way mosques where radical clerics operate in the shadows. It is occurring in mainstream and leading mosques world-wide, including at one of the most important religious institutions in Islam, the Al Aqsa mosque in Jerusalem."},{"comment_id":"10154162897758855","commenter_b":"@username I was fondled by an obnoxious straight woman at a bachelorette party at a gay bar. She would not stop. I grabbed her hands and she told me never to put my hands on a woman. She was thrown out of the bar","commenter_a":"What gay man would touch a woman's crotch and breasts..? That doesn't add up in the least... Also what about all the sexual harassment done by straight women to gay men? Are we going to completely ignore that?","post_message":"What role do gay men have in sexual harassment?"},{"comment_id":"10152739505691028","commenter_b":"YEAH!!CONSEQUENCES!!! Let's round up all the Muslims and throw them in camps and just gas them!!!! Because that works out so well for society,you know.","commenter_a":"If they are not savages, what are they then - klilling innocent people? There should be consequences for this!","post_message":"\"Statements like these cause mistrust and fear of Islam and Muslims. It is unbecoming of a public elected official to issue such bigoted statements.\" @webpagelink"},{"comment_id":"1090441274344209","commenter_b":"People keep saying this but it seems like Hillary IS our Trump-like candidate.","commenter_a":"Allow me devil's advocacy: 1. If the dems ever run a \"Trump\"like candidate, the super delegate system would be designed to stop that person. 2. Getting more than a small percentage of voters to the primary booths will make the dem party more democratic than overhauling the super delegate system","post_message":"Ending the superdelegate system is what will make the Democratic Party more democratic. This is the kind of grassroots democracy that will help the Democratic Party grow and win elections."},{"comment_id":"929829353743480","commenter_b":"Gee, you'd think women would be smart enough to either (a) buy better shoes or (b) switch them out when they start to hurt. I guess not.","commenter_a":"I don't know why people wear them tbf,not if they're uncomfortable","post_message":"Time to switch to flats, ladies!"}]
