[{"comment_id":"10153515225917994","commenter_b":"Then leave the country!!!!","commenter_a":"Another flag that represents racism and hatred.","post_message":"Confederate flags: History or discrimination?"},{"comment_id":"10154251165218984","commenter_b":"He shots he hits he scores, 250bucks for each, thrn charge mexico for the money, sry but see if you can just walk over the border there no you can not, you get arested and jailed asap, but some how the Mexicans and all the others get by Mexicos military hummmmm","commenter_a":"Oh yea Eean, Milo, Jackie, Heather, Cory, Liz, Justin.. Mmmmhhhhm I'm not gonna share on your walls but for those who have children, think of what type of democracy will enable if Sanders or Clinton both Democrat are elected president. To have too share the taxes you earn back for the benefit of others. Don't be naive because a lot abuse the system, which means if you want universal health care and benefits.. The Republican Party has to amend the laws of drug test issued for anyone wanting freebies and living off the cheese the government provides.. Which is I THE TAX PAYER. This revolution crap will end after New York. On another note, Ted Cruz may have a 10 day rant after this upcoming Super Tuesday winning Wisconsin with all delegates.. But Trump will win New York & all the eastern part of nation, and then we're too California! ...","post_message":"This is insane, and it happened right in front of a journalist... Do you think America needs a president with a firm stance on immigration?"},{"comment_id":"10153221748849087","commenter_b":"@username,where are you from?? You pig!! Photoshop your KKK outfit on your daddy...hahahahahaha","commenter_a":"IT WAS YOU, OBAMA who spoke these words at an Islamic dinner - \"I am one of you.\" IT WAS YOU, OBAMA who on ABC News referenced - \"My Muslim faith.\" IT WAS YOU, OBAMA who gave $100 million in U.S. taxpayer funds to re-build foreign mosques. IT WAS YOU, OBAMA who wrote that in the event of a conflict -\"I will stand with the Muslims.\" IT WAS YOU, OBAMA who assured the Egyptian Foreign Minister that - \"I am a Muslim.\" IT WAS YOU, OBAMA who bowed in submission before the Saudi King. IT WAS YOU, OBAMA who sat for 20 years in a Liberation Theology Church condemning Christianity and professing Marxism. IT WAS YOU, OBAMA who exempted Muslims from penalties under Obamacare that the rest of us have to pay. IT WAS YOU, OBAMA who purposefully omitted - \"endowed by our Creator\" - from your recitation of The ...","post_message":"“I do not believe Sharia is consistent with the Constitution of this country,” Dr. Ben Carson told The Hill. “Muslims feel that their religion is very much a part of your public life and what you do as a public official, and that’s inconsistent with our principles and our Constitution.”"},{"comment_id":"10153202645506350","commenter_b":"This women should go talk to parents.","commenter_a":"Everyone saying \"she could have dealt with this privately, how embarrassing for the kid\". She never even mentioned his name... She is just addressing him along with all the other boys out there who do this. Something similar happened to me when I was in grade school and instead of having my back, all my friends labeled me as a bitch for not giving this guy a chance. He WAS harassing me but it was seen as \"cute\" because women are taught to appreciate male attention no matter the circumstances. We are taught it is the best thing that could ever happen to us. Just bear in mind that if a teenage daughter willingly comes to her mother for help, during a time when most teens seek distance from their parents, there is clearly a huge problem. This is video that can help a lot of other parents and teens ...","post_message":"This mom has a message for the boy repeatedly being rejected by her 14-year-old daughter: No means no."},{"comment_id":"466002853760417","commenter_b":"Screw your health care - you can buy a freaking wall instead America.","commenter_a":"Trump suffers from major PARANOIA....💰💵😎","post_message":"Speaker Paul Ryan on President Trump's executive order to build a wall on the U.S.-Mexico border: \"We're going to pay for it and front the money.\" Watch Greta Van Susteren's full interview with Speaker Ryan. @webpagelink"},{"comment_id":"10157170758630354","commenter_b":"This woman is psychotic.","commenter_a":"She's fucking disgusting to look at! A professional con artist like the Obama's and the privilege Clinton's they all should get tarred and featured in public !","post_message":"Want nightmares? WATCH:"},{"comment_id":"10153678204533984","commenter_b":"They are scum ! We don't have enough prisons !","commenter_a":"This is a hate crime! Throw the book at these idiots!","post_message":"This is just brutal...How can anyone do this to an innocent teen?"}]
