[{"comment_id":"1058387144217814","commenter_b":"Best part, Karen, they probably don't even make minimum wage, if they're paid at all! Little Hitler Youth!","commenter_a":"Wowzer... I see the RNC interns are working through the weekend, copying and pasting their GOP talking points. Working hard to keep women, minorities, the poor, our LGBT brothers & sisters and immigrants under their jackboots 24/7. Shameful.","post_message":"It’s 2016. The days of dismissing the pay gap as a \"women's issue\" are over."},{"comment_id":"1429289687105057","commenter_b":"I'm going to beat your ass why you do that to me sis lmao","commenter_a":"Omg sis imagine this! VVanesha Williams","post_message":"This is the incredible moment a mother gives birth to her baby son - in a groundbreaking delivery procedure."},{"comment_id":"718123011626115","commenter_b":"BULLSHIT. And it has already been pointed out to you that the polar bear population has now reached record HIGH levels. The number of polar bears more than doubled since 2000, and increased FIVEFOLD since the 1960s. Pollar bears are thriving. Please don't disseminate this climate change crap.","commenter_a":"we can't even protect ourselves from these nazi socialist scumbags in charge","post_message":"If we do not fix this now they won't have a place to live much longer. Let's protect the Artic from Shell!"},{"comment_id":"10155891268485354","commenter_b":"Don't give a Shi# what race you are do something like this and it should be automatic death penalty!!!!!","commenter_a":"I'm surprised you can say \"black\" gangs. any one that can do that to another human should be swiftly executed for their absolute worthlessness to society.","post_message":"The gang of 6 forced \"the male victim to watch as his female companion was gang raped.\""},{"comment_id":"1179704828736654","commenter_b":"What do you expect their natural prey is vermin after all!","commenter_a":"Omen? It probably thought his hair was a nest.","post_message":"This might be the greatest story of the week."},{"comment_id":"464590737066851","commenter_b":"Unbelievable , to do that to an Elephant . Ought to cut his ta#@#@ fingers off.","commenter_a":"Neither.","post_message":"Left side: Donald Trump's son holding the tail that he cut off an elephant he shot in Africa. Right side: Chelsea Clinton working to prevent the illegal trade of ivory in the world. Whose family values do you prefer?"},{"comment_id":"1918194181741344","commenter_b":"Orange Hitler needs to shut up!","commenter_a":"Trump NEVER considers possible consequences of his words.","post_message":"Donald J. Trump told his supporters \"a bomb went off in New York,\" well before local officials had publicly confirmed details of the incident or what caused the explosion."}]
