[{"comment_id":"1037623106257736","commenter_b":"Many foreigners are required to take English in school unlike Americans.","commenter_a":"if you want to go to murica you have to speak engrish","post_message":"A study found that 77% of immigrants have high school diplomas and over 40% graduated from college."},{"comment_id":"10152627900846680","commenter_b":"We need to get rid of lowlife like Amy Klobuchar and her fellow treasonous, America-hating Democrat scum...Loretta Lynch is proving she'll be another Holder...we don't want nor need her to continue breaking laws for Barry O.","commenter_a":"The now extreme right GOP, are now preaching that all democrats/Liberals are lawless. Ted Cruz as a the son of an exiled ultra conservative and enraged anti-Castro Cuban, was brought up to think by his father, that all Liberlas are Communist and are out to overthrow the US government. I quess according to the GOP and Ted Cruz's definiton of Liberalism, which he defines as lawless, John Locke, one of the fathers of Western liberallism, who inspired the writers of the American Declaration of Independnece like Thomas Jeffersen, were all lawless! If this is true who is then lawless...","post_message":"Sen. Amy Klobuchar: 'So why has her nomination languished for nearly four months — longer than any nominee for attorney general in recent memory? And why have senators like my colleague Ted Cruz insisted that she is somehow lawless?"},{"comment_id":"1271510422882923","commenter_b":"Momma ain't raise no bitch","commenter_a":"I love how everyone says stop snitching but if he/she dosnt snitch he/she could go to prison as well for withholding information. I dont give a fuck my freedom is worth more then their freedom sorry not sorry. *Heres a little side note i have an extreme case of dyslexia so if my grammar is terrible i apologize *","post_message":"'What r u going to gain from it'"},{"comment_id":"1087648897921955","commenter_b":"Strange how our country hasn't been blown to pieces if all these Muslims are strapping bombs to themselves. I see your high school education didn't get you far. Must have been a sympathy pass..","commenter_a":"Send these filthy vermin back to the cesspool they came from","post_message":"The project was 'totally different from anything the government has ever done,' Immigration Minister John McCallum said Wednesday."},{"comment_id":"10150822941699963","commenter_b":"What an entitled, self absorbed, sniveling whiner she is.","commenter_a":"Grow up Donnie","post_message":"Who saw this coming?!  Everyone. Everyone saw this coming."},{"comment_id":"10155589843380231","commenter_b":"That Saltine needs to o put on her white sheet and HOOD and shut the hell up.","commenter_a":"Which is why she's scared to show her face...stand by your convictions woman!","post_message":"At least one McKinney resident is standing by the police, insisting that the actions taken were appropriate."},{"comment_id":"10153200495384411","commenter_b":"leave the fukers there ,revoke their passports","commenter_a":"They weren't British....","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
