[{"comment_id":"958471064269672","commenter_b":"BUT.... FOR ANY SMALL REASON SHE CAN GETS SHARIA LAW...... NO BAD TO TRY...!!!","commenter_a":"Lindsey! Remember no smoking no alcohol no pork prayer 5 times each day etc. However there will be more than enough sex and just think you will replace several goats! This will make you very popular with peta!!!!!😎","post_message":"Dear Lindsay: Pay particular attention to the anti-women bashing bits and ... then smoke a cigarette and meditate whether or not you really wanna to convert. @webpagelink"},{"comment_id":"10153860133856336","commenter_b":"He just figured this out LOL i knew ever since he took office.","commenter_a":"Absolutely.","post_message":"Do you agree with Mike Huckabee?"},{"comment_id":"10153138744168487","commenter_b":"Criminals will find anything, they're criminals after all. If they could kill you with love they would do! More guns will never make any situation safer; regardless of the victim feels they would have been safer with a gun. Chances are a criminal will know how to use one and you won't. Guns should be outlawed on a whole not made readily available to whoever wants one.","commenter_a":"so does higher rates of car ownership.","post_message":"A reminder from 2014 that higher rates of gun availability correlate with higher rates of female homicide."},{"comment_id":"1546155322346073","commenter_b":"A Butt Ugly Bitch!","commenter_a":"How sad he is But...wait pediphiles will be the next protected people","post_message":"This is the crux of the problem"},{"comment_id":"1003724273013669","commenter_b":"This woman is dumber than a box of rocks!","commenter_a":"freaking nut case!","post_message":"Dems know where to get their votes..."},{"comment_id":"1817386261807116","commenter_b":"I agree! She is pure evil!!","commenter_a":"Totally agree with Newt Gingrich! She has no scruples! She belongs in prison! Cannot stand this heartless woman! She just won't disappear!","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"},{"comment_id":"10153898665266336","commenter_b":"Don't forget about us crazy white women !!","commenter_a":"The white boys who are already here have horrible things on their minds. When are you going to call for them to be banned Donald the clown? @webpagelink","post_message":"On last night's 'The O'Reilly Factor,' Donald J. Trump defended his proposed Muslim ban and said the U.S. \"cannot allow people to come into this country that have horrible things on their mind.\" @webpagelink"}]
