[{"comment_id":"10154167828886077","commenter_b":"Oh whoopee!! It will soon b n Indiana! 🙀 Where did June go??","commenter_a":"Kill it with fire!","post_message":"❄️☃"},{"comment_id":"605402049616235","commenter_b":"'@username AMEN! She's just a stupid troll!!!","commenter_a":"He was probably drunk while being on the snowmobile. It will take more than duct tape to shut his wife's mouth.","post_message":"'Knowing Todd, once he's cognizant, he'll probably ask docs to duct tape him up and he'll call it good. He's tough,' Sarah Palin said."},{"comment_id":"10154151244455579","commenter_b":"A fool and her money are soon parted.","commenter_a":"Just now donated $20 for Hillary Clinton and committed to caucus in my state hope you do the same right now:) I am voting for Hillary because I fell she is the best qualified person. Three Supreme Court Justices will mostly likely be appointed and I want a democrat to be the one to select the appointees. She can do it better than Bernie plus backwards and in High Heels. We have made such progress under President Obama I would like to see how much more we can continue to do and I trust her and honestly know she will be the best Person and successor to Barack Obama additionally she has devoted her 'entire life' to bettering the lives of the American People.","post_message":"Hillary Clinton: 'We are going to fight for every vote in every state.' Full video here: @webpagelink #CSPANfan"},{"comment_id":"10153902791784087","commenter_b":"'@username : Shattup Trump whore","commenter_a":"Perfect. No one should be above the law and it's disgusting how her supporters are okay with her getting away with it but when repubs get away with it they act like babies. I'm not Republican either, mind you.","post_message":"#BREAKING: The House Oversight Committee will send a formal request to the FBI as early as next week asking to open a criminal investigation into allegations that Hillary Clinton lied to Congress."},{"comment_id":"10154322380197217","commenter_b":"I'm just surprised he didn't grab her in the pussy","commenter_a":"Anyone else shudder when he leaned in to kiss Michelle Obama?","post_message":"Hugs and a gift. The Trumps meet the Obamas at the White House   #InaugurationDay   bbc.co.uk/inauguration"},{"comment_id":"10155251280330294","commenter_b":"The only thing 'frightening' about this video is how butt ugly that lady is that get out of the car! Ha...","commenter_a":"There's 2 sides to every story...no other side could justify illicit behavior like that but what happened before the video started?","post_message":"'Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off-road first time.'  Then- things take an even scarier turn, when the woman stops her vehicle, gets out and walks up to the car."},{"comment_id":"1390703587614315","commenter_b":"We have no way of knowing how Bernie Sanders would have weathered the inevitably nasty storm against him if he had been the nominee.","commenter_a":"I'm really angry at Democrats sending the candidate least capable of defeating Trump into the general. What morons. They saw polling showing that Sanders would trounce Trump by double digits and yet decided that Clinton was the 'safe' bet??? Effing morons.","post_message":"Donald J. Trump's campaign tells us a lot about what kind of Commander-in-Chief he would be."}]
