[{"comment_id":"10153101086445736","commenter_b":"a burnt pussy lips","commenter_a":"Shannon Linda Harman","post_message":"Thanks to some \"Sound Prosthetics\" Honey and Badger are on a roll."},{"comment_id":"367438390047230","commenter_b":"Devora Sexton and you are a cheap whore","commenter_a":"If a man's children and wife are a measure of him, Trump is a hell of a guy.","post_message":"Another reason Dems are terrified..."},{"comment_id":"863004940415197","commenter_b":"Throw her in jail","commenter_a":"Take her down!","post_message":"\"Perfect\" was the response Lerner used about the non-archived messaging system."},{"comment_id":"10154326005239657","commenter_b":"Just heard this morning, accordeing to an article in the NYT, that Hillary's unprotected server had an email disclosing the locaation of Ambassader Stevens on 9/11/2012. It was also disclosed that our allies knew her email was not secure, so we can only speculate our enemies knew as well. If all of this is true, this woman should be shuned by the American people.","commenter_a":"Lollllllll. True","post_message":"A look back at the week's most memorable, powerful, and funny political cartoons.  #5 might be one of the best we've seen all year!"},{"comment_id":"10153272380601167","commenter_b":"Never trust a liberal woman with three names.","commenter_a":"Obama still has his college records sealed to hide that his grades weren't as good as Bush's.","post_message":"C'mon, conservatives, don't sell yourselves short. You did vet Obama, remember? Obama's a Muslim. Obama was born in Kenya. Obama forged his birth certificate. Obama is the son of Malcolm X. Obama's hiding his gay past!"},{"comment_id":"1004207899725254","commenter_b":"Nasty woman","commenter_a":"Vote the issues!!! Main stream media has succeeded in blinding and brainwashing its people, spinning half truths and omitting important truths. You will NEVER GET REAL NEWS FROM MSM. Go to TRU NEWS, InfoWArs, and many other investigative journalists who are not afraid to tell the truth or worry about losing their jobs. If you are Gay, Why are you voting for Hillary when she wants to bring in thousands of refugees that believe all Gays should be executed? If you are Black, Why are you voting for Hillary when she admires Margaret Sanger and defends Planned Parenthood who want to abort as many black babies as possible? Exterminate the black race because they are like \"weeds\". (Margaret Sanger quote) Most of those clinics are in Black neighborhoods. If you are a Christian, Why are you voting for Hillary Clinton when she wrote her Senior thesis on Saul Alinsky who ...","post_message":"\"I'll do the very best I can if I am fortunate enough to win today,\" said Hillary Clinton after casting her vote today @webpagelink"},{"comment_id":"10153394565113984","commenter_b":"As my friend @username said, stone the bitch!! I agree","commenter_a":" sorry, I can't take her seriously.","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing...  Do you think this Boston bomber got what he deserved?"}]
