[{"comment_id":"10153253016300329","commenter_b":"I can almost guarantee that this lady is nowhere near as big as this dress makes her look. I personally think she looks pretty average. Size 12 or 14. I'm not \"fat\" but I would probably look like that in that dress, thanks to the perfect little human I made. Haha. It just isn't flattering, that doesn't mean anything about her body.","commenter_a":"The dress is not for fat people that is the issue lol","post_message":"ICYMI"},{"comment_id":"872561492840104","commenter_b":"Just STFU!!!!","commenter_a":"You know he's an imbecile when he says the president should b e like a rapist,drugger of the unsuspecting; Bill Cosby","post_message":"\"America's Mayor\" wades back into the fray."},{"comment_id":"1030490090346441","commenter_b":"Time to build a wall around Chicago.","commenter_a":"It's white people's fault...or financial disparity, or whatever else they want to blame all their actions on","post_message":"Chicago Black Gang Member Lured Child From Playground And Executed Him Point Blank You mean #blackLivesMatter protestors are not rallying for this 9 year old boy who was executed by a thug! I guess his Black Life Didn't matter @webpagelink"},{"comment_id":"10154012429911509","commenter_b":"Shut-up and go away!!","commenter_a":"Hi i am Ellie I am 17 years old hot Girl want to some Love able friend I live in USA Follow me I will Follow you Back Like me And make me friend <3 :D <3","post_message":"In Malibu, people call the cops on other people just for sitting on the beach. It's been going on for decades. Last weekend, we put access to beach property to the test. @webpagelink"},{"comment_id":"10153643564026051","commenter_b":"She shouldn't be out!! WTH","commenter_a":"I don't think so","post_message":"A mom who killed her 3 kids is now demanding custody of her new children."},{"comment_id":"10152676390231519","commenter_b":"I always come across people who like to talk shit while hiding their face. Typical","commenter_a":"Mentioning Faux News isn't a \"liberal\" thing. The ones who mention it are humane, educated, not ignorant and are not racist. That's not \"liberal.\" People that watch Faux News other than for the laughs are both ignorant and racist. Period. They also hate democracy, hate poor people and hate minorities - I.e., they are thuggish punks. Wear your badges proud, you cowardly fascist creeps!","post_message":"This could end Brian Williams' career..."},{"comment_id":"885067018227393","commenter_b":"Moms should go to a socialist country where their values are the norm","commenter_a":"Cops are too agressive and think they are always the kings and you can't tell them anything, and they dont know the laws.","post_message":"Moms want out of America!"}]
