[{"comment_id":"1041909399153863","commenter_b":"Craig your brain isn't fully developed until you're in your 20's. Please just shut up.","commenter_a":"GOOD!...i hope she get life in prison...she killed a human being , not just a blob of cells....after 20 weeks the baby has feelings when touched...full lungs , full body parts , a full brain...it was murder plain and simple....why would ANY WOMAN wait sooo long to decide to kill her baby???","post_message":"The criminalization of pregnancy continues"},{"comment_id":"1346838938665097","commenter_b":"@username the fact is that a male will never transform himself into a female. FACT!!","commenter_a":"For people who don't understand, it is not just restrooms, but women's locker rooms and showers and dressing rooms. This is not right. This is not just a trans thing, but will allow men to go into confined areas where women are very vulnerable. So, how would you feel if your grandmother, mom, daughter, sister, aunt, etc. to shower with a man next to you with only a flimsy curtain? We here in NC will stand strong. I hope our governor will continue to fight for women's safety.","post_message":"The solution here might be that the North Carolina governor could say that we don't identify as North Carolina anymore, and therefore your lawsuit against us is irrelevant."},{"comment_id":"10153773304673869","commenter_b":"shut up, fool.","commenter_a":"It's a Prince song and it belongs to him. She just found a hit that he threw away. He was just that good.","post_message":"There's a moment in “Nothing Compares 2 U” in which a doctor tells O’Connor “Girl, you better try to have fun, no matter what you do.” The advice is patently dumb—though not unfamiliar to any woman who has ever been told to just smile."},{"comment_id":"10153084604971162","commenter_b":"Oh dear Lord I put this woman in your hands,we don't know her situation,we should not judge her..please Lord find her a place to lay her head protect her let her see the truth which is you..break her chains Lord,I saw in this article that she has a alcohol problem..break these chains Lord...I pray for all involved..in Jesus name amen","commenter_a":"That's sad!! Someone should get her some help like a shelter.","post_message":"WOMAN \"EVICTED\" FROM WALMART: A 45-year-old woman had been living inside Walmart for days before employees noticed her on the store's security cameras. VIDEO: @webpagelink"},{"comment_id":"906670476046247","commenter_b":"And you just said you are not for choice. You care less for the hungry And homeless. You want them killed. You want them to have no choice. Giving money to kill the child of someone who really wants to keep their child but can't because you gave money to have it murdered instead of giving money to her to help her with her choice to keep her child. Yeah. Pro abort!!!! Force abort!!!! Force te 11 year old against her will. Give money to murder mills to force a helpless woman have no other option because people like you pay to kill her child and not help support it.","commenter_a":"Stop Death Camps For The Unborn!!! Abortionists Are No Better Then Murderers!!!!!","post_message":""},{"comment_id":"1717305195178742","commenter_b":"@username Did you smoke crack before your post? Americans can be Asians. Using your logic, Latinos and Latinas can't be Americans either. And all blacks would be African. Also, those nations are far from being heterogeneous like ours.","commenter_a":"Yes Asian men are not portrayed in a very nice light especially in american media. however, I find many Asian men to be attractive. love the facial structures and there is nothing like a guy with a sword.","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"10153846163628984","commenter_b":"So invite some of those Muslim refugees into your home, fool....see how that works out","commenter_a":"The Koran speaks extensively about Jesus Christ. U fools who do not know. Look it up.","post_message":"She was riding the bus when two Muslim men starting attacking, as soon as one started stabbing her she let out four simple but powerful words that she credits to saving her life. This woman's story of survival is truly incredible."}]
