[{"comment_id":"1681195205453281","commenter_b":"Barbara just needs to go away!","commenter_a":"Her opinion doesn't matter!","post_message":"Barbra Streisand blasted “narcissist” Donald Trump in a 1,228-word Huffington Post op-ed."},{"comment_id":"881686708534340","commenter_b":"Still doesn't eliminate the fact that your router has been hijacked.","commenter_a":"Ad Block Plus add on for Chrome and Firefox","post_message":"If you're seeing scammy ads on legitimate sites, hackers may have gotten to your router."},{"comment_id":"952953064797748","commenter_b":"She needs to be deported to Alaska. Just like her mother, she does not know what the are talking about!","commenter_a":"Bristol Palin should keep both her ignorant mouth and her legs closed.","post_message":"Apparently, a kind gesture towards a scared teenager is grounds for a political attack these days."},{"comment_id":"619582968232282","commenter_b":"She has to go","commenter_a":"Yea","post_message":"Michelle was just caught red handed and is about to be charged with treason.  Good. It's about time she was exposed.  Do you agree Michelle Obama does not belong in the White House?"},{"comment_id":"1457146887628950","commenter_b":"She's singlehandedly responsible for the murder of countless unborn babies! She can burn in Hell!","commenter_a":"Rest In Peace Norma. God bless you","post_message":"Norma McCorvey, 'Jane Roe' of Roe v. Wade, dies at age 69"},{"comment_id":"430612380465476","commenter_b":"And what about the.over a million citizen muslims already here?","commenter_a":"Muslim immigration should be halted in this country and every other civilized country. Radical Islam is killing the world's people while government ignorance (Political Correctness) stands by and allows it to happen. Obama needs to stop apologizing for America and start protecting the American people.","post_message":"Question of the Day: Should we halt Muslim immigration until the federal government can get it under control?"},{"comment_id":"778104105644597","commenter_b":"CNN reported on this at its finest. Condemned those who stand as patriots while providing excuses for those who slaughter innocent people . Nothing but hypocrisy!","commenter_a":"Love this lady!","post_message":"Report: Man slain by police in Boston sought to behead Pamela Geller"}]
