[{"comment_id":"10156637699435354","commenter_b":"Political whore?","commenter_a":"If the polls leaned toward Bhudism, Hillary would relate to Buddhists.She tries to relate herself to whichever way the liberal winds blow. If one doesn't agree they are homophobic, racist or worse...a conservative.","post_message":"Haters gonna hate..."},{"comment_id":"1494929760811093","commenter_b":"Isis isn't islam... Hahaha okay","commenter_a":"If Islam is a peaceful religion why is every Muslim country in turmoil and its citizens are totally controlled by the Imans and the Koran? Don't believe the lies of political correctness.","post_message":"\"Before you say, 'War is what ISIS wants,' realize that's simply an argument for inertia and putting off the inevitable. Does that make me a war-monger? Sure. It also makes me a global survival-monger.\" Last night on \"The Greg Gutfeld Show,\" Greg Gutfeld said radical Islam needs to be countered with \"radical Americanism.\" @webpagelink"},{"comment_id":"10153444568593984","commenter_b":"hillary shouldn't even be allowed to run, she and all her and obamas co-horts should be in jail for treason. and what would be so bad about going back to the 50's. that was a great time to grow up. at least the govt. was 80% honest and not 99% dishonest. if she gets elected then something is diffinitely wrong with this country and the people in it.","commenter_a":"Sorry Mr. Levin but unless the Republicans can come up with a candidate who doesn't still live in the 1950s and can stay out of people's bedrooms, Hillary will win.","post_message":"BOOM! Outspoken Levin just stepped up to the plate and asked what everyone else is thinking. Hillary will NOT like this one bit... Do you support Mark Levin?"},{"comment_id":"10153122678405950","commenter_b":"Get another job lady!","commenter_a":"Where was her God when she divorced and remarried three times over? Can't hide behind religious beliefs when you can't follow them yourself.","post_message":"Before returning to work today, Ky. clerk Kim Davis said she is being \"forced to disobey her God,\" and that she still won't authorize marriage licenses for same-sex couples."},{"comment_id":"1101969979880290","commenter_b":"@username and @username You are both aware that faith is not a verifiable thing,correct? You also don't need religion to have the emotion of faith in something. My goodness...where do you people get your educations?","commenter_a":"Pretty happy we have the technology to make this happen. Thanks to the doctors for their experirnce and service. god has nothing to do with this surgery how about you thank the heros the doctors.","post_message":"After over 26 hours of a remarkable surgery, the moment when the parents saw one of their conjoined twins separate for the first time. The twins, Anias and Jadon were successfully separated after being born conjoined at the head 13 months ago. #JadonAndAnias. @webpagelink"},{"comment_id":"1832531477017547","commenter_b":"Calm down, people didn't realise the date wasn't in American standard form. And we didn't feel it, or at least no one I know felt it. Innocent enough mistake, I don't think anyone deserves to be called an idiot for it","commenter_a":"For all of you idiots saying nothing happened today.","post_message":""},{"comment_id":"1015110755212120","commenter_b":"Stand tall Hillary!","commenter_a":"We got your back @username our next president of the United States of America !","post_message":"Send Hillary a message of support as she heads into the #DemDebate."}]
