[{"comment_id":"10153882907494024","commenter_b":"The monkey bitch and her brood can't be gone soon enough for my taste.","commenter_a":"She complains about the \"house\" she lives in. Is she chained to the wall-?? Just move, bitch-!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10153287154044714","commenter_b":"Nope. She's a woman!","commenter_a":"Your father is a man I don't care he changes","post_message":"An incredibly touching story"},{"comment_id":"1038864972829192","commenter_b":"Children would suffer if women were drafted.","commenter_a":"#getridofthedraft","post_message":"Thoughts?"},{"comment_id":"10153715486157144","commenter_b":"Boom bitch!","commenter_a":"Y u gotta say boom","post_message":"BOOM."},{"comment_id":"488243741366206","commenter_b":"Hell no don't mess with our children!!!","commenter_a":"I thinks it's wrong for Muslims to even to be on our soil!!!!!!","post_message":"American students are being forced to dress like Muslims.  This is absolutely unacceptable, we need to spread this and show Muslims we are not going to stand for this.  Do you think it's wrong for Muslims to force their beliefs on our children?"},{"comment_id":"10154141987653145","commenter_b":"@username Yes! Thugs with guns and badges paid by our tax dollars.","commenter_a":"This is where we are today: Killer cops kill civilians and get away with it. Civilians kill cops and either get killed by other killer cops, or if very lucky, they get arrested, charged, and sentenced. Killer cops have no empathy for civilians they kill, or their families. The copsuckers show no empathy for the victims of killer cops who again, get away with it. If the killer cops, along with their apologists don't show empathy for the victims of police killings, why should civilians show empathy for the killed cops? If the killer cops won't shed tears when civilians get killed by cops, why should civilians shed tears when cops get killed? If the killer cops along with their apologists think it's OK for the civilians to be killed by cops (the unjustified killings), why shouldn't the civilians think it's OK for the cops to be killed? Only if ...","post_message":"The slain officer was a special agent with the Georgia Bureau of Investigation. Police say the gunman remains at large this morning."},{"comment_id":"1006224616090150","commenter_b":"Game ko anything basta sugtan lng ko hahahhahahahahaah","commenter_a":"Make ta tonight?!? @username @username dalhun ugma?!","post_message":"Learn how to make chocolate chip cookie dough ice cream sandwiches."}]
