[{"comment_id":"1707461899536305","commenter_b":"This lady is lady has her own set of rules","commenter_a":"From you? Yeah right!. . . The Ambassador and thsoe Marines are - ROLLING IN THEIR GRAVES. . . right now. . .","post_message":"Do you agree with Hillary Clinton? #SCPrimary"},{"comment_id":"10154156813446926","commenter_b":"It is indeed a colony of the US, and it cannot survive without Billions of dollars of aid from their masters. Israelis should decide what future do they want for their children, one in which they are perpetually fighting a war, or one in which they can make peace and learn to live with mutual respect. --- As far as ethnic cleansing is concerned..this is again the same issue. It is only ethnic cleansing when the Jews are forced out of their homes, it is not ethnic cleansing when ZIonist militants throw out Palestinians from the homes they were living in for centuries.","commenter_a":"The way I see it Israelis will be in the Palestinian villages for a long time..... society whose leaders campaign for a convicted terrorist to be given the Nobel Peace Prize, a society that teaches its children hatred and violence as part of its standard curriculum, a society that unabashedly teaches anti-Semitism through all means available, a society that puts suicide belts on children during political celebrations, a society that honors, glorifies and funds terrorists, a society that uses a hateful version of religion to poison the minds of its children, a society that engages in widespread jubilation when Jews are victims of terrorist attacks, is not a healthy society that can develop peace of any kind.","post_message":"#Israel's occupation forces in the #WestBank have used at least three Palestinian family homes as military posts in recent months"},{"comment_id":"10153043162846130","commenter_b":"'@username do us all a favor get a vasectomy","commenter_a":"You could skip the asking your boss to buy it for you and just buy it? Saved you a step. :)","post_message":"“Ask your doctor if birth control is right for you… then ask your boss if birth control is right for you.'"},{"comment_id":"652024288284285","commenter_b":"I'm so glad.","commenter_a":"Yes","post_message":"Muslim Miss USA Chooses Jesus Over Mohammed... Islamic Community FURIOUS  She has the right to believe whatever she wants to believe.   Do you support her choice?"},{"comment_id":"10153542250533812","commenter_b":"Chriss if you lease a car. Can anybody come in that vehicle and disrespect you. Chriss you happened to get a job that you get assigned a vehicle can anybody come tell you what and how. You're a smart man. You might get a job that requires you to move out of the state or even the country. That job comes with all expenses paid for four years including the house and the car. You tell me who can come in there and disrespect you. Not even the ceo or cfo of that company can do that without proper protocol. You had to move your family. And your doing your best job. Think about that chriss. YOUR A SMART INTELLIGENT MAN","commenter_a":"Pres. Obama. It is America's house we only let you borrow it for a little bit! Respect all people as you desire to be respected. You are in my house and every legal Americans house. Not that they were right but you are wrong!","post_message":"WATCH: Pres. Obama normally lets hecklers speak, but this time, he put his foot down: 'OK, you know what? No, no, no...'"},{"comment_id":"10154024287346680","commenter_b":"Thank God we elected a Nazi instead, right?","commenter_a":"Can Obama just pardon her if she promises to stay out of the public for the next 3 decades? It's time to move on.","post_message":"State officials said earlier this year they searched for visitor logs for Hillary Clinton's office and could not find any."},{"comment_id":"661747857265261","commenter_b":"'@username in LA-LA Land - Run back to the boarder and GET THE FUXK OUT OF MY COUNTRY!","commenter_a":"Then he obviously didn't listen to the end. Bibi gave 3 more stipulations that were very clear to add to the table","post_message":"US President Barack Obama says that Prime Minister Benjamin Netanyahu “didn’t offer any viable alternatives” to the current P5+1 negotiations in his speech to Congress.   #NetanyahuSpeech"}]
