[{"comment_id":"10153438446318984","commenter_b":"Give her nothing she encouraged the animals","commenter_a":"hire the thugs who destroyed, burned, looted and rampaged in your streets...serves 2 purposes, gives them a job, gets them off aid, and the plus........your city gets cleaned up by those who wrecked it, with your permission..so use your dollars, not mine","post_message":"The fact that she expects Americans to do THIS for her after the things she's said and the way she handled the riots is truly mind boggling. Are you outraged by the Baltimore mayor's request?"},{"comment_id":"10157365304615389","commenter_b":"If the Democrats can do it they will try! These are the most evil people I have ever witness! Just like I have said many times it's Good and Evil fighting now! The good (Trump) will win!","commenter_a":"100% yes","post_message":"Question of the Day: In light of Donald J. Trump's comments, do you think the general election could be rigged? Weigh in below."},{"comment_id":"840225226093860","commenter_b":"Science is proving the bible and religion is a load of rubbish...!","commenter_a":"The Bible is just a story book... Religion is a fable... looking for God is like going into a dark room and looking for a black cat that does not exist ! what religion does to people is brain wash them..","post_message":""},{"comment_id":"10154103250631756","commenter_b":"\"Are ya goin' ta prison like my maw??\"","commenter_a":"\"Are you goin' ya prison like my maw??\"","post_message":"Cuteness abounds, but so do questions about whether the kids are plants."},{"comment_id":"10153638608000667","commenter_b":"That must be why one out of every three women will have one.","commenter_a":"Abortion needs to be under attack! The murder of innocent babies is atrocious. It has no place in a civilized society.","post_message":"\"Abortion is still under attack all over the place.\""},{"comment_id":"530303733802764","commenter_b":"Today is your Birthday? Well, then Happy Birthday!!!","commenter_a":"Happy birthday! God bless","post_message":"My birthday wish is that our nation would once again recognize God as our leader."},{"comment_id":"10153180250311051","commenter_b":"Bitch","commenter_a":"matt bac she couldnt control her husband, the whole usa wtf","post_message":"Here's what Hillary Clinton had to say about her State Department e-mail scandal. Simple question: Do you think she'll be the next President of the United States?"}]
