[{"comment_id":"10154487307161336","commenter_b":"Unfortunately, Hillary and company think they are above reproach. She is doing the \"granny good witch\" routine for awhile and the cutesy lovers are falling for it. Did they honestly forget that Bill is a womanizer and she has ruined the lives of the women he was involved with? Barbra Streisand made a comment, \"We didn't elect the Pope\" and that tone of morality has taken its toll,","commenter_a":"Amen to that!","post_message":"\"If they can't control their own email maybe they shouldn't be controlling the state secrets of the United States.\"  Today on \"FOX & Friends Weekend,\" Mike Huckabee talked about how the hacking of Democrats calls into question national security. @webpagelink"},{"comment_id":"10152931610594270","commenter_b":"He has to be doing this just to make me look like a saint.","commenter_a":"West Point grad and comissioned Officer - apology not good enough. Gotta go. If he could ly about something as serious as Valor what else can he lie about?","post_message":""},{"comment_id":"10154172313547690","commenter_b":"Like the boy didn't have enough problems then get a nasty nanny!","commenter_a":"Put me in the room with there for about 30 minutes let me drive her around and a little more","post_message":"This nanny is facing charges after allegedly abusing a 4-year-old-boy with special needs.  Luke has Down syndrome, heart defects and epilepsy. Once his mother noticed a change in Luke behavior, she decided to get a nanny cam. This is what she discovered. #NBC5Now More: @webpagelink"},{"comment_id":"10153265757247061","commenter_b":"No, he was too busy lighting our disgraced white house Christmas tree.","commenter_a":"If you have no interest in hearing President Obama, why comment? I'm sure he's not reading your negative comments. He's much too busy and has other more important things to focus on, unlike you, who clearly have too much time on your hands!","post_message":"BREAKING: President Barack Obama to address the nation from the Oval Office on Sunday night at 8pm ET, White House says. @webpagelink"},{"comment_id":"528408970683016","commenter_b":"ghetto skank bitch","commenter_a":"They have,gotten away with it for six years and will keep doing it tell they leave the white house","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"10154720750937235","commenter_b":"Michael M you r an ass hole !!! No one cares what you think !! You r ugly and evil with no soul just like Hillary !!! You and Meghan r made for each other !!! You r a disturbed individual !! Making fun of hard working people struggling because of Obamas policies !!!. We all should boycott. All your crap . I will . Those hard working people paid to see your movies ! Thats how u got rich !! Thanks to the deplorable's. You 😤😤ASSHOLE !!","commenter_a":"Michael Moore will do anything for media attention and money.","post_message":"You've no doubt seen folks in your Facebook feed who believe Michael Moore is making the case for Trump.   That is a LIE."},{"comment_id":"10153905516506178","commenter_b":"I always say Merry Christmas at that is just the way it is.","commenter_a":"Fitting that a NUTCRACKER be in the back ground. :-)","post_message":""}]
