[{"comment_id":"1150426991676729","commenter_b":"We could put all Muslims on Atlantis and let them fight it out! Yes, I know it is a fantasy that Atlantis existed but believing Islam can coexist with the rest of the world is a fantasy, too. Best hope the idiots get there and drown vforevthey realize they have been had. Obama can lead them with Hilary behind. My fantasy! Sorry, but I have problems.","commenter_a":"Way to go Angola","post_message":"Muslims have been asked to tear down their own mosques under threat of paying for the demolition fees...."},{"comment_id":"660877367410427","commenter_b":"RACISTpig fucker","commenter_a":"Fuck you nigger u suck anyway","post_message":"Can i get a collective '______this Guy'?  Shop.tacticalshit.com"},{"comment_id":"10152989497399099","commenter_b":"Impatient mother f'r, bc that's y those light and sign is there for, so they can cross safe.","commenter_a":"Smh","post_message":"A driver is accused of hitting a 6-year-old boy as he was getting off the bus and walking toward his mother @webpagelink"},{"comment_id":"415868471934780","commenter_b":"as soon as they put one foot on our soil we must be ready to drop bombs on them.","commenter_a":"I am ready for them arats.","post_message":"They're here!!"},{"comment_id":"1729203870680375","commenter_b":"'@username Hillary still lies but that's true of most people who are liars. Dr. Carson must be desperate to dredge up a case this old.","commenter_a":"It's too bad these supporters, like Dr. Carson here, doesn't go after the things that Trump says and does everyday instead of something Hillary did 35 years ago. I'll bet a lot of us could dig into our pasts and find things we could have done or said better but yet we're going to vote for Trump, who is supposed to have maturity and says the most mean spirited things any Presidential nominee has ever said and he says these horrible things practically every day.","post_message":"Another woman from Clinton's past is speaking out."},{"comment_id":"1063012123817862","commenter_b":"It is under God not no damn allah you ignorant muslim cocksuckers. If you dont like our country,our anthem, our flag,and our laws then by all means get the fuck out and take the clintons and obamas with you","commenter_a":"WTF","post_message":"THIS IS THE UNITED STATES OF AMERICA! Our country was founded on Christian principles. 'LIKE' if you think this is wrong!"},{"comment_id":"10156674955065354","commenter_b":"Win by selling out our principles ? No way .","commenter_a":"Trumps campaign has been a wrecking ball for the conservative movement . Fox News was once our most dependable news outlet , it wasn't perfect . National Review use to be a respected magazine for conservative ideas , now there being attacked . Good conservative candidates such as Rand Paul , Rick Perry , Ted Cruz all now being attacked not by the liberals but by the GOP front runner . Good job trump you did more damage to the conservative movement than the liberals ever could","post_message":"***What happened to Fox News?***  “What would a conservative network be doing giving time to Michael Moore? Why would New York Times and Washington Post reporters be on the air to give opinions on a conservative network?” Limbaugh asked. “This is what peope are saying out there.'"}]
