[{"comment_id":"1084748028260016","commenter_b":"@username like they said there would never be a GREAT WALL OF CHINA. There will be a wall!!!!!","commenter_a":"Oh my god, people keep talking about Trump's \"wall\" as if it's an actual thing. It's not a thing. It will never be a thing. It's just a distraction so people don't ask him about real issues that he has no answers for!","post_message":"\"At the start of my conversation with Donald Trump I made it clear that Mexico will not pay for the wall,\" Mexican President Enrique Peña Nieto tweeted in Spanish from his official account."},{"comment_id":"10155683176459778","commenter_b":"@username classless is any woman who voted for Trump...","commenter_a":"I hope he sticks his middle finger up on the walk across the lawn...","post_message":"Are you ready to say goodbye to President Obama?"},{"comment_id":"10154376636126509","commenter_b":"I once heard, all Asian look alike!","commenter_a":"u killed innocent boy shame to those who disagree with Obama abt guns new law","post_message":"\"I just shot my son by accident.\" An Ohio father shot and killed his teenage son early Tuesday morning, apparently mistaking him for an intruder, Cincinnati Police said."},{"comment_id":"10153179541492014","commenter_b":"Who cares? She's giving a great Christmas! Good for her!!!!! People need to butt out and mind their own business!!!","commenter_a":"What's the problem? It's her money she works for her family.","post_message":"Sound Off: Is this a great Christmas or way too much?"},{"comment_id":"1043167352401972","commenter_b":"She needs to be fired.","commenter_a":"Again I say\"get rid of her\". There are many patriotic qualified principals out there.","post_message":"A New York school principal has banned the Pledge of Allegiance, Thanksgiving and Santa. The school's PTA president Mimi Ferrer told 'Fox & Friends,' \"We are in America. We're supposed to be proud of where we are.” @webpagelink"},{"comment_id":"10153852965454705","commenter_b":"She's a liability. Period. I wouldn't let someone like that work for me.","commenter_a":"She worked too hard to become a doctor to get fired, she should do community service and pay a fine and formally apologize to the Uber driver. We've all done/said stupid things while drunk.","post_message":"An internal investigation will determine any disciplinary action, including possible termination."},{"comment_id":"1045431208809965","commenter_b":"This is not news worthy.","commenter_a":"Who cares?","post_message":"BREAKING> Beijing wins bid to host 2022 Winter Olympics. China's capital will be first city to host summer & winter games."}]
