[{"comment_id":"10153302995429255","commenter_b":"That is not proven, nor can it be.","commenter_a":"I got the rubella vaccine when I was 27 because that was the one childhood disease I didn't contract. At age 27 my body was able to handle the vaccine. NOW tell me PLEASE how the hell do you think its OK for an hours old baby to get vaccinated for a sexually transmitted disease, and then 48 more by age 18 months? Its seems to me KOS person, you have been bought by big pharma, or you are on a rant. Because this getting tedious","post_message":"A \"perfect storm\" is starting to brew. By Daily Kos user Lib Dem FoP"},{"comment_id":"10154542525666051","commenter_b":"So we get rid of all the illegals and we pay $5.00 for a head of lettuce cause who is going to do all this work?","commenter_a":"Sneaking into our country is explicitly illegal. Why is Mexico allowed to have a wall on its southern border with strictly enforced immigration laws but America isnt? What would happen to 100% of Americans caught illegally entering","post_message":"The Trump Administration's latest deportation plan is explicitly illegal under international law. Here are the details:"},{"comment_id":"1669966499994538","commenter_b":"Dumb. Completely fucking dumb if you vote for her. Please, take her and leave the country.","commenter_a":"WHAT A WEB WE ARE WEAVING , A WOMAN CAN BE PRES. JUST NOT THIS LYING WOMAN,WHO COULD BE PROUD OF HILLARY FOR PRESIDENT.","post_message":"Michelle Obama got emotional when speaking at the Democratic National Convention, as she remarked that \"Because of Hillary Clinton, my daughters...take for granted that a woman can be president.\" @webpagelink"},{"comment_id":"1402181823177264","commenter_b":"He wants all Muslim refugees to stay there......","commenter_a":"GOOD FOR THEM , EVERY STATE IN THE UNION SHOULD DO THIS !!","post_message":"Victory for the Constitution!!"},{"comment_id":"10153483204295667","commenter_b":"Nardine","commenter_a":"Robert Taylor","post_message":"Do you see a ghost in this photo? Henry Yau took this photo at the Stanley Hotel, the real-life inspiration for Stephen King's 'The Shining.' Yau says no one was on the stairs."},{"comment_id":"775594199191746","commenter_b":"You should be in a burka, you slut.","commenter_a":"I suppose next the religious right will insist that women wear burkas next. They're getting more and more like muslim terrorists every day.","post_message":"“Somehow my shoulders are sexualized? Like it’s my responsibility to make sure the boys’ thoughts are not unclean.”"},{"comment_id":"992365204151742","commenter_b":"Since the dawn of evolved time mankind has migrated so that won't stop. I agree the need know who is entering the nation if I remember a European country found that immigrants were part of protest. And terrorist will use this to build cells to attack. However I don't see how Trump will get Gulf States to build security safe zone since the 'fountain is running dry' or maybe he will reignite the polluting of the environment with fossil fuels and take action to get fossils prices back to 110 which will create more bad than good but greedy and gluttony will prosper. His positions may have down sides for any real growth. And I agree that America needs to stop providing bulk funding, to the UN and other, let the world let the new imperialists do it and they, US, rebuild and make the world positive, green, clean and ...","commenter_a":"Republican Party souls have been sold to highest bidders, \"The Sneaky Wolves\". Lincoln Party is officially dead. So sad, Republican primary election is fraud, unfair and rigged, it seems every bigot and racist hiding behind the conservatism came out the closet to poisoned the election process in order to hijacked the Republican Party. I feel sorry for the gullible and naive Republicans who have been mislead, bluffed, lied and manipulated. Trump’s gang for hostile takeover of Republican Party maybe the worst case scenario in the American political history. Thanks a lot media for giving Trump’s gang free ride. Media is sold out to the highest bidders and freedom of press is no longer relevant to corrupt bosses and greedy investors Not again, another Hitler era, never again. @webpagelink Going in and out of building makes a person a Christian no more than going in and out of a barn makes ...","post_message":"“No. I would not allow people to come in from Syria. They’re not vetted properly. They’re moving in by the thousands.” Donald J. Trump reaffirmed his commitment to a ban on Muslims immigrating to the United States, arguing that it is better to build \"safe zones\" in Syria. What do you think?"}]
