[{"comment_id":"759569737474968","commenter_b":"We also.have to put up.with people like you. I'd welcome anyone from anywhere else before I'd welcome you .","commenter_a":"If we gotta put up with Muslims...why the hell not at least he doesn't want to behead us","post_message":"If you thought he was in jail, you thought wrong."},{"comment_id":"10155107547054258","commenter_b":"Crooked Donald! Lock him up!","commenter_a":"CNN stopped covering the rally and MSNBC with Greta from FOX ran the picture only but had a white House speaking on behalf of Trump. So, on TV we missed Warren , Bernie and others, Corporate controlled media. again ! Thank goodness for social media !","post_message":"WATCH LIVE: Democrats in Congress hold a protest at the Supreme Court against President Trump's immigration executive order."},{"comment_id":"10154506345988188","commenter_b":"1) Trump and Soros spent Christmas together in 2009 2) Soros funded Trump Towers, using a mezzanine loan 3) Soros and Trump were co-defenders in the same lawsuit. @webpagelink Trump Pals Around with George Soros The similarities between two billionaires from (allegedly) different sides of the aisle. conservativereview.com","commenter_a":"So why are you saying a Soros backed candidate is better and safer then Trump?","post_message":"We dissected this story on radio today. Listen here: @webpagelink"},{"comment_id":"10154151440809087","commenter_b":"Hillary is for women. I don't blame her one bit, those whores knew Bill was married!","commenter_a":"In 1978, Bill Clinton violently raped Juanita Broaddrick in a Little Rock, Arkansas, hotel room, then, as he was leaving, looked at her bloody lip and said: \"Better put some ice on that. Corroborated by five contemporaneous witnesses Knowing full well about Bill Clinton proclivity to sexually assault women, about three weeks after that rape, Hillary Clinton cornered Broaddrick at a party and said, pointedly, just want you to know how much Bill and I appreciate the things you do for him. Do you understand? Everything you do. In the early 1990s, Bill Clinton invited a young female staffer to his hotel room at the Excelsior Hotel in Little Rock, dropped his pants and said, it. As CEO of an organization, Bill Clinton had a young female intern just months out of her teens, perform oral sex on him while he made business calls. That girl name was Monica Lewinsky. ...","post_message":"#BREAKING: Former Utah governor Jon Huntsman's shocking call for Trump to quit comes one week after saying he planned to vote for him."},{"comment_id":"10153940302636770","commenter_b":"Hillary need to be placed in jail","commenter_a":"Trump is going to say , Hillery u'r Fired !!!!!!!","post_message":"TheDC Election Night: Race is tight!"},{"comment_id":"10153189308491336","commenter_b":"Fuc_k the Muslim Scum Bags. If they don't like the American way of life go to the \"Big Sand Box\" to live. Then they can cook and keep warm with Camel Dung...........","commenter_a":"SHAME SHAME SHAME on these colleges and universities for the disrespect they show to our America and for the disrespect they show our military who have given their all to protect THEM.................... just hard to believe there are people in these positions who let this garbage happen. STAND UP FOIR AMERICA AND DO THE JOB","post_message":"President of the University of Maryland College Republicans: \"This isn't a racist film. It's about a decorated American war hero who [risked] his life for you and me and all the viewers.\""},{"comment_id":"10154138321738837","commenter_b":"I read she was with the lady already in line she just had more items for her. She did'nt skip the line. That racist pos was out of line enough said! Pendeja!!!!!","commenter_a":"Realistically speaking if you're with someone and they're at the counter cashing out who's going to go to the back of the line if they were \"Together\" and you're only adding an item or two?? saying she should have went to the back of the line is both irrational and impractical... part of the problem is making excuses for the inexcusable...","post_message":"#RACIST RANT RECORDED: A woman's Tuesday night racist rant while Christmas shopping goes viral on social media."}]
