[{"comment_id":"489966784527235","commenter_b":"Fuck em and feed em pork","commenter_a":"Yes.","post_message":"Radical Muslim group CAIR orders that Obama exempts them of this.  They are dangerous, and so is our president.  Do you agree that Obama is a threat to the United States?"},{"comment_id":"10154131351242232","commenter_b":"She doesn't stand a chance against Trump","commenter_a":"Well we are screwed","post_message":"#Breaking. Hillary Clinton has won the Pennsylvania Primary and is about to take the stage. @webpagelink"},{"comment_id":"1512686248764628","commenter_b":"Oranges are offensive, they resembles balls, likes men's balls! such a coincidence that white males eat oranges?! patriarchy for sure","commenter_a":"This article is very misandrist and perpetuating the matriarchy. All men are handsome inside and out. Try being more accepting, less shallow, and do less femsplaining UGG #triggered","post_message":"\"If someone was quite a weird child, he tends to be a great date.\""},{"comment_id":"10152885307051336","commenter_b":"Totally totalitarian and just plain wrong","commenter_a":"Start pushing back people!!! They care nothing about your kids.","post_message":"UPDATE: The Goochland County School Board has now voted down the controversial policy on religious homeschooling. @webpagelink   Virginia parents are outraged over a new policy that demands home-schooled children justify their religious beliefs to a school board within 30 days of their 14th birthday."},{"comment_id":"10153274785312623","commenter_b":"I think they need counseling by Dr Phill.Hey people!Wake up!Want to be with the one you love?Renew your vows yearly.Want to have it both ways and live with guilt every day?Do not get married.","commenter_a":"It's like this.If you love each other.Fine.If you have the need to stray away from your soon to be spouse to hang out with the girls.Fine.But to be with somebody while you are married?Hey you are not fooling anybody but yourself.Either be married and be happy or go two different directions. I have been with my wife fronearly 20 years and have been through the best of times and the worst of times","post_message":"The wife of a Winston-Salem man arrested for bigamy is speaking out:"},{"comment_id":"10153512540611491","commenter_b":"Blow this mf off the face of the earth","commenter_a":"@username Camangyan","post_message":"\"The only way for defending the sovereignty of our nation and its right to existence under the present extreme situation is to bolster up nuclear force.\""},{"comment_id":"10155007053899641","commenter_b":"Wow people","commenter_a":"Good for them. Sad dt did this to them.","post_message":"Mexico is ready to hit the US where it hurts: Corn."}]
