[{"comment_id":"1039031896153505","commenter_b":"How many immigrants do you personally know? I'm guessing none","commenter_a":"Every one of you idiots came from immigrants","post_message":"The immigrant population in the U.S. is more than 4 TIMES what it was in 1970."},{"comment_id":"10156315267360725","commenter_b":"Humble pie lol","commenter_a":"She was getting way to cocky... talking way 2 much... didn't hit gloves before the fight .... she was force fed a slice of humble pie last night","post_message":"Glad to see that Ronda Rousey lost her championship fight last night. Was soundly beaten - not a nice person!"},{"comment_id":"10152879630121336","commenter_b":"Shes got her hands full.","commenter_a":"Blessings","post_message":"A Montana woman gave birth to a set of identical triplet boys in early December, a rare occurrence — especially without the aid of fertility drugs. @webpagelink"},{"comment_id":"725368590987052","commenter_b":"That bitch should get shot","commenter_a":"Leave blondie","post_message":"Share if you agree."},{"comment_id":"1267200936634248","commenter_b":"Childhood whooping cough measles mumps etc","commenter_a":"There is no mention of what vaccinations it is about, only that it will be forced. I don't really see this article as useful to anyone lol","post_message":"No jabs, no benefits."},{"comment_id":"922136247820460","commenter_b":"Keep drinking the kool-aid lady!","commenter_a":"I think you are clueless dude. The \"obstructionist party\" is obstructing because they have listened to their fellow supporters of we the people! I don't want more and higher taxes! I don't want more illegals here illegally! I don't want Obamacare! I don't want a gigantic government telling me when, where, why and how to blow my nose! I don't want them taking away my guns! I don't want them (Democrats - now the Socialists/Communists of America) allowing Bengazi, fast and furious, and Ferguson protests to happen. I don't want Obama \"using his pen and paper\" Anymore! ILLEGALLY! WITHOUT CONGRESS!","post_message":"Back home in Indiana after a late night. The Senate held its 25th amendment roll call vote of 2015 late yesterday, already more than all of 2014."},{"comment_id":"10153837326772293","commenter_b":"To know how irresponsible and corrupt a candidate is, is worthy to know. Even the main stream news, democrats and the I.A report denouncing Hillary of improper acts in office is added to her bungling of Libya and other important areas. You can't make this up. I'm sure if even convicted of treason her stiff supporters would kiss her ring before she flew away on her broom.","commenter_a":"Thanks for that pearl of wisdom Newt. While you were trying to impeach President Clinton, you and Hyde, Livingston were having affairs of you own..hypocrisy much!!","post_message":"“Part of it is, he’s just trying to throw stuff in the air and keep her rattled,” Newt Gingrich said."}]
