[{"comment_id":"1159620574116477","commenter_b":"Why doesn't she leave, to many people here anyway.","commenter_a":"American is great, but we all have to remember who we got this great country from the great American Indians they should be the only ones who can say who can stay and can't.","post_message":"This whiny Home Depot employee is going viral in all the wrong ways after a man's photo caught what was on her hat... this is disgusting. The employees of this Home Depot store clearly don't want our money, so let's make sure they don't get it."},{"comment_id":"10152756009211051","commenter_b":"Could be..Better than that leaching piece of whale dung..","commenter_a":"You Brits can have her...","post_message":"People in Saudi Arabia are livid with Michelle Obama for one very specific reason."},{"comment_id":"1107644279295319","commenter_b":"I don't agree and what she did is wrong. But Trump can suggesting banning all Muslims from the USA and get away with it?","commenter_a":"Strange but when these muslims say and do the same things..Nothing happens....WHY...","post_message":"The devout Christian has been ordered to do community service"},{"comment_id":"10153466375525575","commenter_b":"She got her 15 minutes of fame. Should go dance on a pole now! What a ho!","commenter_a":"Magan sure isn't winning any thing after Howard strearn show about her sex life and now these pictures are coming out of Her.","post_message":"The Gateway Pundit - Donald Trump Builds on Lead After First Debate – Ted Cruz Surges to Second"},{"comment_id":"10154191985279497","commenter_b":"Your a bitch","commenter_a":"obamas a piece of dog shit","post_message":" no need to be nervous; it a nice place, and I sure everyone will be very friendly to you. Barack Obama"},{"comment_id":"10152873585726051","commenter_b":"I thought they are suppose to be getting a education if they are going to act like fouls then everyone needs to pay and kick them out of school so somebody wanting to be there can.","commenter_a":"What a disgrace!!! Is this what they went to college for? They should be expelled and not allowed in any other college!! Let them have to work hard for the rest of their lives!!","post_message":"This fraternity caused $430,000 in damage and wasn't sorry about it at all. Well, now they're sorry."},{"comment_id":"10152897950463445","commenter_b":"To steal God is an oxymoron! Obviously your ignorant! God is there for everyone. It says in scripture that God will call up people from every nation on earth. After the rapture and 1000 yrs of destruction The promise land will be restored in all it's glory. And it's ridiculous to say everyone is Muslim, there were religions that worshipped idols and had orgies as part of their religious beliefs. This is what angered God and he wiped out the wicked in the great flood.","commenter_a":"My God doesn't reward murder , or threaten that if a person doesn't repent according to the Koran they will be killed. My God wouldn't reward living a just and Godly life with going to heaven and having 72 virgins!!! God would never give a sexual gift as a reward. Muslims treat women like shit, just like a woman has no civil rights. In America we have the right to practice whatever religion we want and freedom of speech. If this country sucked so bad immigrants wouldn't risk their lives to get here.🔯 Shalom😇","post_message":"#Cannabis Legalization Goes Mainstream in Israel"}]
