[{"comment_id":"10158427550135093","commenter_b":"I watched a movie recently where this woman wanted to sing and thought she could sing. Because her husband was somewhat affluent she sang in get togethers and everyone fawned upon her and let her believe she could sing. Eventually her delusion became so bad that she wanted to pursue more public and aggressive venues for her singing. A doctor stepped at her husbands request, and decided to record her and play it back to her so she could be faced with the reality of her own voice. Alas, upon hearing it. . .she dropped dead.","commenter_a":"Ye are away with the fairies so ye are","post_message":"Over the line. Katherine Timpf sums it up as only she can."},{"comment_id":"10154529341826178","commenter_b":"This may be fun! Hillary won't be debating a politician! I see a house falling on her and watching her toes curl!","commenter_a":"Illegals and dead people voting","post_message":"Mika seems so sure of this...#RNCINCLE"},{"comment_id":"10152676681972507","commenter_b":"Not to mention that anti-semitic statements are illegal in France.","commenter_a":"In France you pick up 8 year old kids for what they said in school. I don't care how nationalistic you can get over this, this shows the French authorities are massive hypocrites when it comes to 'Freedom of 'Speech.","post_message":"He's 8."},{"comment_id":"821190501249706","commenter_b":"just his type, they can have fruit loops together","commenter_a":"Yeh but our leader will meet with a woman eating fruit loops in a bathtub! !! POS","post_message":"The White House is FURIOUS with Boehner for breaking protocol! Looks like somebody doesn't like the taste of their own medicine!"},{"comment_id":"10154969761261509","commenter_b":"The same reason they have the Latin Grammys. When you are not represented in mainstream, you create your own.","commenter_a":"Imagine if there was a \"White Entertainment\" awards show, or a \"White Entertainment\" channel Oh the chaos Hypocrites","post_message":"Tracee Ellis Ross and Anthony Anderson's hilarious hosting, Beyoncé and Kendrick Lamar's surprise performance, Jesse Williams' powerful speech, and more from last night’s BET awards."},{"comment_id":"10154799380074486","commenter_b":"Suck it up, cupcake.","commenter_a":"The Feminist Movement emasculated men and created this generation of Pajama Boys.","post_message":"Spot on."},{"comment_id":"1509765899325906","commenter_b":"Shut up bitch","commenter_a":"As much as i hate to see President Obama leave office, I can't wait. I can't wait to point out to my Republican friends that noone has knocked on your door and taken your guns, he did not declare himself a dictator and refuse to leave office and my personal favorite example of media driven paranoia......were you chipped??","post_message":"\"What EXACTLY has Obama ruined in this country?!?!\" Video shared by Occupy Democrats, LIKE our page for more!"}]
