[{"comment_id":"10153994246388967","commenter_b":"2nd only to 2016 Kobe 'highlights'.","commenter_a":"The surfing scene from Escape from LA better be in there.","post_message":"Remember when these were cool?"},{"comment_id":"1039384902787653","commenter_b":"Wow! Just listen to some of the crazy sh*t that this woman is saying! Talk about freakin' scary! Someone needs to go get her, put her in a straight jacket and lock her up! She is dangerous to herself and others around her! Saying Obama is the antichrist?? Have no clue where this kind of idiot gets off saying the things she does but if I were the CIA, I would be kicking her door down and taking her to GITMO...where she clearly belongs.","commenter_a":"REALLY?? Look I'm half German and spend a lot of time there. Yes it's difficult times there and a clash of civilizations so to speak.but to package this as a massive multicountry deliberate planned invasion of extremists is ludicrous. What is true is that Western Europe in its liberalism has forgotten it's Christian faith and there is a faith vacuum. Alberi wieder des Infoax viel dies Michael Lenz","post_message":"This woman is BUCKETS full of crazy!"},{"comment_id":"1260170427412540","commenter_b":"Rudy Giuliani, just said, before president Obama there was no successful terrorist attack on America. I loved it! these so-called educated white men show their stupidity, every time they open their mouths, he just spit and pissed on the graves of all the 911 victims! , it happened not once, but twice in New York (terrorist attacks), and how could sun-bleached bleached Donald Trump care about the veterans when he said he doesn't like the ones that got captured? And before running for president he has never! donated to any veterans organization, but he's going to take care of the veterans and loved the veterans, he's a real sleaze ball!","commenter_a":"We got nothing","post_message":"Is Donald J. Trump likely to double-down on his proposed immigration ban?"},{"comment_id":"537705639687363","commenter_b":"@username you are wrong ! All the other religions follow AMERICA Laws!! Only Muslims want to bring in their Sharia laws for their JUSTICE , and their law on us and they can't , because Our Constitution, And We As Real American Citizens Will not change our Laws of Justice, for their BARBARIC 7th century murderous, degrading practice!!! Ship you are a bleeding heart Liberal!! Trump is not trying to divide us , He is trying to save this Country from people like you, Hillary, Bernie and that kiss ass Muslim OBAMA!!","commenter_a":"American Muslims are American. Just like American Catholics. Just like American Jews. Just like American Methodists. Just like American Presbyterians. And all the other Americans of various religions. Stop trying to divide us. Trump wants to secure our borders. Why is that wrong? Trump wants to end ILLEGAL immigration. Why is that wrong? Trump wants to verify that legal immigrants are not here to harm our citizens or create havoc. Why is this wrong?","post_message":"This is what American Muslims think about our presidential candidates. You might not be too surprised by what they had to say."},{"comment_id":"10152972323790950","commenter_b":"Sick bastards!!!!","commenter_a":"For now...I am going to let this investigation work itself out for evidentiary findings. Meanwhile, I choose to hive him the benefit of the doubt. Such is the way we were taught in college.","post_message":"BREAKING: Subway spokesman Jared Fogle is a suspect in a child porn probe, a law enforcement source says."},{"comment_id":"400393906751871","commenter_b":"Thank you. You pieces of uselessness. You screwed the Americans who voted your asses in but you will come up for re election. We Americans will not vote you back. You just handed America over to the democrats for life now that the illegals will have the paper work to slant the elections. Morons","commenter_a":"McConnell and Boehner are both hipocrits ~ they are not for the people and are not for the GOP Obama has them in his back pocket!","post_message":"Did Mitch McConnell just cave to the Democrats' demands?"},{"comment_id":"687121244811787","commenter_b":"She can go and join Isis!","commenter_a":"Fuck this traitor bitch","post_message":"Woman goes on TV and points the finger at Americans for this. She has some nerve. What a ridiculous statement. Does this infuriate you?"}]
