[{"comment_id":"486501341528450","commenter_b":"She's a skank. Thought she was going to leave the us if bush was elected. Leave the us bitch","commenter_a":"The fucking Libtards heads will explode when Trump gets elected. I will fucking LOVE IT!!!!","post_message":"You've GOT to see her characteristically snooty and elitist statement..."},{"comment_id":"10153697709133984","commenter_b":"He'd never make it to prison if that was my daughter or granddaughter. But since he will hopefully go to prison, its a shame someone never showed him an illustration on a blackboard about the size of your asshole before prison and the size it is when/if you get out. Maybe he would then have had sense enough not to rape a child. When he goes to prison he's going to find out what real rape is like...good.","commenter_a":"Castration sounds good to me. He wouldn't do it again","post_message":"This sick punk raped a young girl and admitted to it... but the disgusting thing is his absurd excuse.  Our country is in deep trouble and this proves it... this little girl did nothing to deserve this."},{"comment_id":"710239562414460","commenter_b":"Yep, it's a sure way to self-destruction and negativity.","commenter_a":"Nope, not true. If that were the case, there would be collective responsibility too, and that would be impossible. We are individuals responsible individually for our own actions, choices and lives.","post_message":""},{"comment_id":"10153811889982994","commenter_b":"Isn't that what the looney bin was made for? Lock her up!","commenter_a":"Hansel and Gretel's villain just got made","post_message":"'May I have a taste?' Minnesota woman allegedly threatens to eat neighbors' children"},{"comment_id":"10154075360053797","commenter_b":"You know her personal","commenter_a":"Wow look at all these people who would vote for a liar to run this country. What an uneducated bunch.go clear back to Watergate with hillary she is a liar.","post_message":"WOW! Rest in Peace Elaine. She was a registered Democrat and not \"a political person.\" However, her obituary says: \"Elaine requests, in lieu of flowers, please do not vote for Hillary Clinton.\" Her reason is getting a lot of attention. See here:"},{"comment_id":"937892139587360","commenter_b":"OF COURSE democrats WANT illegal aliens to vote. This would give them a VAST majority for all future elections. If this were to happen, the America that we know would cease to exist. ALL American citizens, regardless of party affiliation, must prevent illegals from being allowed to vote.","commenter_a":"What do expect it will help them to continue getting their freebies!!","post_message":"More than half the voters who identified themselves as Democrats in a recent Rasmussen poll said they believe illegals should be allowed to vote. Among all voters, more than one in three believes illegals should be allowed to vote. What do you think? @webpagelink"},{"comment_id":"10153085951882507","commenter_b":"no problem at all, as long as the part of the ----> well regulated militia <------ is the main factor, and not as is current, --> any inbred psychopath can buy any number of military grade weapons and high capacity magazine and then proceed to walk into restaurants with them.","commenter_a":"So this of course applies to second amendment rights also, correct?","post_message":""}]
