[{"comment_id":"962475507142312","commenter_b":"I KNOW!!!!! They've already started. It's so funny!!","commenter_a":"That will drive them crazy","post_message":"Why does Hillary love Snapchat? Watch and learn:"},{"comment_id":"1470713222988421","commenter_b":"Typical British woman. No morals, no values.","commenter_a":"Is this worthy of a news item? I think not.","post_message":"She text him the picture weeks later after not seeing him again"},{"comment_id":"10154960801467232","commenter_b":"'@username what benefits do you offer","commenter_a":"They call it pennsyltucky for a reason. Outside of philadelphia its all trailerparks and farms.","post_message":"The Southern Poverty Law Center defines a hate group as an organization that has  or practices that attack or malign an entire class of people, typically for their immutable characteristics. @webpagelink"},{"comment_id":"10153131425722293","commenter_b":"They are our imagine of the 'freedom' .","commenter_a":"Yes.","post_message":"Experts fear a whole slew of risks that may follow should these tribes come into full contact with the outside world."},{"comment_id":"10153550945636943","commenter_b":"No Syrian refugees....NONE!...call the Capitol...1-202-224-3121...follow instructions...Let them know you oppose Syrian refugees entering the U.S.. Took me 2 minutes...EASY!","commenter_a":"No","post_message":"Tom Fitton joins Fox News to discuss the danger Syrian refugees pose to the United States. Do you think Obama should allow thousands of Syrian refugees into our country?"},{"comment_id":"1516900544996637","commenter_b":"And crooked lying hellary deleted 33,000 incriminating emails. That's why 5 people were given immunity so they wouldn't be prosecuted. Now why would they need that??? Here's the definition of immunity: Law. exemption from criminal prosecution or legal liability or punishment on certain conditions. Did hellary ever find the 6 billion $$$ that has been missing while she was SOS??? It's most likely in the clintons Swiss bank account! Wake up liberals!!! @webpagelink","commenter_a":"Trump is nothing but a CRIMINAL.. A FRAUD... CON ARTIST.","post_message":"City of Phoenix to Trump: Our cops didn't endorse you."},{"comment_id":"10154769435278812","commenter_b":"Does this lady ever stop lying roflmao","commenter_a":"and Hillary thinks her connection to black voters is carrying hot sauce in her purse.","post_message":"Addressing the National Baptist Convention in Kansas City, Hillary Clinton took a veiled shot at Donald J. Trump, who made his first trip to a black church on the campaign trail this past weekend and has been making a pitch for the African-American vote."}]
