[{"comment_id":"10153058951371045","commenter_b":"send her to Hollywood she can act!! send to JAIL!!!!!!","commenter_a":"It seemed like a pretty fake cry to me, you know that baby was there just sorry she got caught!","post_message":" God. Oh God. I can believe I did that. Oh my God. My husband going to kill me. Oh my God! That's the reaction police body cameras caught when a frantic mother was confronted for leaving her 1-year-old daughter in a sweltering van parked in an Oklahoma Wal-Mart parking lot."},{"comment_id":"10153134315811336","commenter_b":"I don't believe a word she says along with that piece of trash ruining our country.","commenter_a":"Would that be illegal voters or the type that is human scum?","post_message":"Clinton's goal, according to two people close to her organization, is to make her second run for The White House more about voters and less about herself."},{"comment_id":"10153231020785933","commenter_b":"@username you are so wrong girl !","commenter_a":"#Kasich 4Us#...Kasich is a good man and a honest man who is humble enough to recognize God in his life and the need for him in the country once again,hes a man with all of the experience who learned from one of our best presidents Ronald Reagan...and he KNOWS how to lead this country in the direction that it needs to go to become great and LEAD the world as we once did...lets do something right in this country for once and VOTE KASICH!!","post_message":"It's our time to unite the country. New Hampshire, it's your time to vote for a leader who can do it. #Kasich4Us #fitn"},{"comment_id":"499007870289793","commenter_b":"She's an ass. She's not an elected official. Tell her to stuff it.","commenter_a":"Go away Michelle.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153116557673812","commenter_b":"The problem here is that if there wasn't such a demand for these young females by perverts this wouldn't exist. You are sick to lust a 14 yr old as a grown man.","commenter_a":"My heart goes out to this mother!","post_message":"WATCH: A mother in a desperate search for her missing 15-year-old daughter is overwhelmed with emotion when journalist Nicholas Kristof searches for and quickly finds her being advertised explicitly online – A Path Appears: Tonight on Nightline / Monday on PBS -- MORE: @webpagelink"},{"comment_id":"1194644643902280","commenter_b":"Build that Wall!!!!!!👍😃","commenter_a":"Yes but did anyone die?? CA is full of Illegals.. Probably the judge is as well.. Give em Hell Trump!👍","post_message":"U.S. District Judge Gonzalo Curiel in San Diego called for the documents to be released."},{"comment_id":"10152639623811680","commenter_b":"Illegals do vote. @webpagelink","commenter_a":"Not against legal citizens from voting. It is fraud and illegals voting. You took an oath. You should be against it also.","post_message":"Sen. Bernie Sanders: “An absolute disgrace for Republicans in the year 2015 to work overtime to deny people the basic right to vote.”"}]
