[{"comment_id":"557960721079763","commenter_b":"Put it in her butt and see if she still complains about size","commenter_a":"😂😂😂😂","post_message":"Size clearly matters to this girl! #WSHH"},{"comment_id":"10153253284026756","commenter_b":"i like to read porn not watch it as much","commenter_a":"Meanwhile, people are praising a movie about a creepy, abusive man who likes to manipulate women into believing they want to be treated like emotional and sexual slaves.","post_message":"In which the vice president manages to invade all of our personal spaces, simultaneously."},{"comment_id":"1170305866326090","commenter_b":"@username you are the number one reason for birth control!","commenter_a":"I'm so glad they had a chance to speak about their loss. Some people don't care that lives were lost because they want to be so against a movement they can't possibly understand.","post_message":"These mothers who've lost their black children to police brutality and gun violence had a powerful moment at the DNC."},{"comment_id":"919455181533446","commenter_b":"My kids go everywhere. I'm not getting a sitter for something like that. But also, I probably would have whipped out my tit and fed the poor thing.","commenter_a":"A baby should not be at a political rally. Should have found a babysitter.","post_message":"\"What a beautiful baby. It's young and beautiful and healthy, and that’s what we want,' Donald J. Trump mused, before saying he wants it ejected."},{"comment_id":"10152754691111051","commenter_b":"It's wonderful to know he has an optic nerve and so may one day be able to see!","commenter_a":"Why did they lie to her to start with !!!!!!!!","post_message":"This mom repeatedly asked why her new baby wasn’t opening his eyes. Doctors said his face was just a little swollen. Two weeks later, she found out the truth."},{"comment_id":"10153043089801519","commenter_b":"Right? Because...ick.","commenter_a":"#dontbethatguy","post_message":"\"He then sent me five nude photos of him lying in bed, his penis prominently displayed...\""},{"comment_id":"10153247740094411","commenter_b":"Suck it up mother fucker","commenter_a":"När Israel skrotat alla sina atomvapen, har dom först då, rätt att ha trovärdiga synpunkter.","post_message":"BREAKING"}]
