[{"comment_id":"861148387265123","commenter_b":"Female racist-in-chief.","commenter_a":"-who is she to make that decision, no man has that right - God creates life!","post_message":"What sorts of \"populations\" does it sound like Ruth Bader Ginsberg is interested in \"controlling\" here?"},{"comment_id":"466095273584336","commenter_b":"Good maybe that will keep a lot of those liberals and illegals out of the rest of America.","commenter_a":"Have it your way Jerry...","post_message":"Liberal California Governor Jerry Brown: ‘If Trump Wins, we’ll build a wall around California’"},{"comment_id":"1200823989996135","commenter_b":"@username I, for one, will not miss that evil animal at all!","commenter_a":"Lets just Eliminate him ... can't understand why he has not been removed already ... Oh Wait , people are to afraid to do anything !","post_message":"Obama now want to eliminate another of our national symbols. Just wait until you see this!"},{"comment_id":"10152647068355927","commenter_b":"She can be rich,but doesn't want the rest of us to be","commenter_a":"What's wrong with being rich? We pretty much all strive to be rich but the government does its utmost to prevent you. Good grief Hil.","post_message":"Great question..."},{"comment_id":"10154404411899877","commenter_b":"Well said","commenter_a":"We have a long way to go when race and sexual identification are listed when recognizing someone for a new position. Only time sexual orientation should be consider is when trying to hook someone up on a blind date.","post_message":"A black, queer woman being named EIC is one of the biggest media brands in the world is EPIC!"},{"comment_id":"10155547019200389","commenter_b":"Once again jay you are incorrect as Cheney resigned from Hali when he became VP. As you say google it","commenter_a":"We need to do the same with Bush and Chaney for the Iraq war","post_message":"Egyptian criminal court sentenced ousted Islamist President Mohammed Morsi to 20 years in prison on charges linked to the killing of protesters in 2012."},{"comment_id":"1334924336529627","commenter_b":"@username that's great except sometimes the child is tricked by a family friend, a coach, a counselor, etc... people that don't appear to be creeps. I'd like to help children see the signs, know what type of lies these predators tell them, and know how to get help if it's a family member or someone else. Killing the perpetrators after the fact will do nothing for the victims. Especially this little girl... she's already dead","commenter_a":"When I was young and in school we had the D.A.R.E program, trying to educate youth about drugs and help us make good decisions not to do them. We need a program now to educate our children on sexual predators, how to watch out for them, to be aware of how they manipulate, etc and where they can call for help and a safe harbor. I would happily volunteer to speak at any school. We need to protect these children and let them know they are not alone and that where someone may have failed them, we will not.","post_message":"Awful"}]
