[{"comment_id":"892853017418706","commenter_b":"This my friends is a true leader","commenter_a":"We'll never see Obama supporting our wounded Vets like Bush. Bush was a true patriot","post_message":"George W. Bush said the ride will highlight the \"bravery\" of America's veterans:  \"It’s a ride to herald people who were dealt a severe blow and said, ‘I’m not going to let it tear me down.’”"},{"comment_id":"10153365008995329","commenter_b":"ew. She's so disgusting .","commenter_a":"Should. Be. Fired. There are plenty of other \"educated\" people to rep ESPN. Or frankly to do her job you don't need a degree. You need decency.","post_message":"ICYMI (via BuzzFeed News)"},{"comment_id":"10152723867461680","commenter_b":"No, LIb. First of all you ASSume that every business owner in the country is a Republican, which is just more made up shyte by a LIb. Secondly, its called supply and demand. By flooding the labor market via illegal immigration and REWARDING illegal immigration, Libs increase the supply of labor in relation to the demand for labor, which lowers the price of labor.","commenter_a":"IT is amazing how those who vote republican seem to forget that Reagan and both Bush's gave amnasty to illegals, Reagan even went on to say that he would like to see an open border where the Mexicans could come and go any time they wanted, For all of you simpleminded republicans who want proof you have a computer look it up,","post_message":"Texas and other states suing over the moves say that only Congress can authorize the kind of sweeping actions Obama took."},{"comment_id":"519056438282649","commenter_b":"cair can go to hell","commenter_a":"Our country. .USA..AMERICA","post_message":"PLEASE SHARE AND HELP PROTECT OUR VETERANS!"},{"comment_id":"10153877739389205","commenter_b":"Whores these days. Pffffff 😂","commenter_a":"\"The protest has grown larger...\"","post_message":"One college is fighting for the right to carry…dildos."},{"comment_id":"10153555053111037","commenter_b":"I bet you any money she can't breathe anymore","commenter_a":"When will people learn the cops will not lose!! I don't care what color u r, she said \" I'm gonna see u in court \"! She baited him. Why would cops kill her in jail? It's another cry baby black!","post_message":"Newly released dash cam footage shows the events that led to Sandra Bland’s arrest."},{"comment_id":"10154079129819091","commenter_b":"Pence CNN 9/8/16 \"I think it's inarguable that Vladimir Putin has been a stronger leader in his country than Barack Obama has been in this country.\" Pence VP Debate 10/04/16 \"That is absolutely inaccurate. I said he's been stronger on the world stage.” Like his master Trump, Pence lies about his lies. The Trump campaign hostility towards President Obama is a national disgrace. President Obama is 100 times the leader that Trump or his boy Pence will ever be.","commenter_a":"The problem with Kaine was when Kaine spoke, Pence let him speak but the minute it was Pence's turn, two seconds into his turn Kaine was interrupting him, he's such a putz.","post_message":"VP nominees Tim Kaine and Mike Pence were both on the attack Tuesday night:"}]
