[{"comment_id":"10154991575839170","commenter_b":"Donald Trump our President will repeal it !!! And all politicians will live on the same policies","commenter_a":"He's a turncoat I do not trust him","post_message":"We didn't like it at the time, but let's compare what would have happened then to what's about to happen now."},{"comment_id":"10154944748138690","commenter_b":"Rohingas living there from 400 years! How much time need to be a citizens of a country? And any illegal citizens can be clear by any countrys government, Bangladesh will do that and India also can clear any illegal citizens from their country.","commenter_a":"He is a Novel laureate for peace from Bangladesh but he didn't said anything about Myanmar Muslim crisis!! Bangladesh facing huge problem for the crisis but as a novel laureate he has some responsibilities to stop violence in Myanmar but he acting like a blind coward and always making way to steal money from poor peoples. That's why Bangladeshi peoples think he is a greedy businessman and Novel price is a joke!","post_message":"\"If it is politically motivated, to victimize a person, then it is a cause of concern.\""},{"comment_id":"709686039165167","commenter_b":"@username Illegals don't have insurance.","commenter_a":"Norway has a single payer health system as does every other civilized country in the world but us. Get insurance companies out of the middle of my health care. They jack up the prices on everything, not just drugs. UPDATE: every other civilized country has either single payer or two-tier system. I included a link below. Scroll down.","post_message":"U.S. drug prices are higher for 93% of 40 top branded drugs compared to Norway. That is unacceptable. We should use our buying power to get better deals for the American people."},{"comment_id":"685699241620654","commenter_b":"How can \"she\" be a woman with male genitalia!","commenter_a":"I believe that by giving Jenner this award merely shows base ignorance. Women should not be offended, but rather look at the monster joke. A man that has not completed his surgery is woman of the year. What a joke. Gentleman the majority of us would never want to be a man. We are happy with ourselves. I feel sorry for this mockery of a woman and an insult to men in general.","post_message":"Female Marine goes off on Bruce Jenner for winning 'Woman Of The Year' Award. She's right. This is getting so ridiculous its not even funny. Can we get 75,000 'LIKES' for this female Marine?"},{"comment_id":"10154459292584138","commenter_b":"Right!!!","commenter_a":"What about bengizi, emails, her picks for judges, say goodbye to our Constitution, and gun rights, i could go on and on. Can anyone name 1 thing she has done positive for this country.....","post_message":"At CHS Field, people are casting their votes - with bobbleheads! People can \"vote\" and get a bobblehead of Donald Trump or Hillary Clinton at the door. The first bobblehead to run out wins the \"Bobblection.\""},{"comment_id":"10154534955796336","commenter_b":"Hillary will NEVER do time for all the crimes she has committed. She and Bill have been getting away with their CRAP for YEARS. Just because it's a different year, doesn't mean anything will change.","commenter_a":"Hillary Clinton will win the election in November. Then, sometime between November and January, Hillary will be indicted. The IRS is now investigating the Clinton Foundation and the whole e-mail thing isn’t over yet. Once under indictment she won’t be able to assume the Office of the President in January. Tim Kaine, who will not actually be the Vice President because neither he nor Hillary have been inaugurated, cannot assume the Presidency. The Speaker of the House can’t move up to it because there is already a sitting President and Vice President. So President Obama, in an Executive Order citing “emergency situation,” gives himself another four years in office is the only way possible. Obama has been planning this for a while now, knowing he has enough on Hillary to indict her. Had the Attorney General indicted her based on evidence from the FBI this plan wouldn’t have worked because ...","post_message":"\"The terrorists overseas utilize our strengths – which are compassion and empathy – against us.\"   Kris \"Tanto\" Paranto, who survived the attack in Benghazi, expressed his support for a more rigorous vetting process for refugees."},{"comment_id":"939419102765615","commenter_b":"If I was to make a point it would be that there should be an easier path to citizenship. People are coming over our boarders. Like or not, they are here. We can do three things at this point. We can continue the way we are. We can make a path to citizenship easier and less likely they're going to be expelled if they try. Or we can get all crazy and build a Great Wall around our boarders. Illegal citizenship builds poverty. Poverty creates crime. We all know this. I must remind you that precious few of us are truly Native Americans.","commenter_a":"People just don't understand how much America depends on Immigrant labor. If they were all to go on strike we'd all be paying more for things we take for granted. If they're here and not hurting anything what's so wrong with letting them stay and contribute to \"The Great American Melting Pot\"? Maybe, Just Maybe, They can become more than they started out when they got here. Never hurts to give them a chance.","post_message":"What a huge mistake. Except it shouldn't be one. - Laura Willard"}]
