[{"comment_id":"485555318301715","commenter_b":"All muslims need exterminated","commenter_a":"That will be a good time to take more out they will be together","post_message":"Gunman accused of hate crime in slaying of three Muslim students. Brace yourself, more race riots to come as angry Muslims prepare to march. Should all race rioters be wiped out?"},{"comment_id":"991037997658085","commenter_b":"Bitch didn't get cheated, she got outplayed. Sour grapes!","commenter_a":"The American people have had enough I being manipulated by candidates that don't know how to quit when they're beaten. Hey Idon't know where thus 2nd ballot thing comes from but they better knock it off before they a billion pissed off Americans !!","post_message":"CRUZ POACHES NEARLY ALL AZ DELEGATES Jan Brewer: 'I Got Cheated!'..."},{"comment_id":"1003928746312028","commenter_b":"Trump for President. Get rid of the Muslims","commenter_a":"Wasn't it said that you are either with us or against us and any nation found to be harboring terrorist or terrorist training camps will be dealt with as an enemy of the state? If nothing is going to be done about these confirmed training camps by Obama and his administration does this not make them enemies of the American People.? Perhaps it's time for the Knights Templer to return. Take back America Trump 2016!","post_message":"It is confirmed there are 22 Jihadi Training Camps in the USA, but the FBI says nothing can be done about them. This new map shows exactly where they are so you can see if there's one in more in your state."},{"comment_id":"1128329537202466","commenter_b":"That says it all! Those flag burners and dissenters can leave.","commenter_a":"I'm a proud veteran too.","post_message":"I'm A PROUD AMERICAN!!"},{"comment_id":"10154407674347756","commenter_b":"Muzzie lover go eat crap","commenter_a":"key word temporary oh maybe we republicans should go burn a few cities down now too and a few police cars right! Hmnnn oh thats right we like law and order imagine that.. Good things take time go TRUMP go we have your back...","post_message":"A Federal Appeals court Thursday evening ruled against the Trump Administration’s controversial transportation order, upholding a district court judge’s ruling to block the order."},{"comment_id":"10154280018188797","commenter_b":"Illegal immigrant aka alien. Im no immigrant nor do i support harboring illegal aliens","commenter_a":"Thank god for her. Thanksgiving is a day to honor a massacre, it's disrespectful to even celebrate the event. Religion is a lie so she is only protecting the best interest of the child, shame on parents who don't. More schools need to follow her lead. She is not the principal of a private Catholic school. She is the principal of a public school. Argument ended","post_message":"NO THANKSGIVING, SANTA, OR PLEDGE: A school principal has banned Santa Claus, Thanksgiving and the Pledge of Allegiance at her school. What do you think?"},{"comment_id":"10153694586758132","commenter_b":"More than that! They would make her CEO due to affirmative action. Come on now!","commenter_a":"I wonder if a black woman decided to be white would she get a vanity fair interview? #whiteprivilege","post_message":"The latest from Rachel Dolezal."}]
