[{"comment_id":"10154455210992577","commenter_b":"Mite as well. Hillary going to rig it so why not lol","commenter_a":"If the biggest criminal in the world doesn't want all that competition from Hillary who can blame him?","post_message":""},{"comment_id":"857261721036748","commenter_b":"He is a terrible president regardless of anything else.","commenter_a":"I'm sick of this crap!...He's a great President..Who cares what religion he is?","post_message":"Scott Walker says he doesn't know if President Obama is a Christian."},{"comment_id":"794052647345901","commenter_b":"LOL! Laughing mostly because I have a few friends like this guy...","commenter_a":"I believe it's called the \"pass the buck\" syndrome? Pity","post_message":"Image from Of the People, By the People, For the People"},{"comment_id":"401586413362986","commenter_b":"Cut off her welfare check!","commenter_a":"and they raised a boy? No wonder","post_message":"Michael Brown’s mother decided to show her true nature when she said this..."},{"comment_id":"1487031254643822","commenter_b":"Stupid? Of course they are. These are the women that will vote for Hillary for one reason only. Because she's a woman.","commenter_a":"The stupidity of some Americans gas gotten it of hand. Grow up baby cakes.","post_message":"Sorry Wonder Woman, feminists hate you because you have big boobs."},{"comment_id":"10154191515199087","commenter_b":"If Hillary gets elected Bill will be coming to the white house with her lets not repeat history.","commenter_a":"Unfortunately it's not Bill Clinton who's running for the President but it's Hillary Clinton, and Nobody cares what Bill Clinton did.","post_message":"The former reporter came forward today for the first time to accuse Bill Clinton of groping her on multiple occasions."},{"comment_id":"10153204606574342","commenter_b":"If she hate America she need to move","commenter_a":"but, she likes their $$$$$$$$$$$!","post_message":"Ariana Grande says she's sorry for saying \"I hate America\" in a recent video that leaked of her in a doughnut shop."}]
