[{"comment_id":"918539948208123","commenter_b":"I say we hand this trifling hoe to ISIS","commenter_a":"Another oxygen water","post_message":"DISRESPECT for our military and nations heroes is out of control. This is straight up disgraceful! READ HERE---> @webpagelink/ HONOR CHRIS KYLE!"},{"comment_id":"10153882831009714","commenter_b":"The same reason why men need viagra...","commenter_a":"No pregnancy is a choice and it doesn't deserve any special treatment. Women have been pregnant for as long as time and they didn't need special parking, so why do they need them now.","post_message":"What do you think?"},{"comment_id":"954958944620884","commenter_b":"all fuckin jerks,","commenter_a":"WORD","post_message":"ClashDaily.com"},{"comment_id":"10153322962454170","commenter_b":"I was born in 1950, so I was privileged to know the Greatest Generation. I don't think there will ever be a better generation. Our culture is too self absorbed, lazy, and uncompromising to produce anything better.","commenter_a":"I agree with Stephanie.","post_message":"Wow. Amazing people. I never get tired of seeing stories about the greatest generation."},{"comment_id":"10154333235104726","commenter_b":"So all the gun owners need to boycott Hawaii. See how they do when there money source dries up.","commenter_a":"It's begining","post_message":"Hawaii became the first U.S. state to sign into law a bill requiring all residents who register as gun owners to be placed in a federal criminal records database that monitors them for any crimes committed."},{"comment_id":"1180082675403600","commenter_b":"What a bitch and she says she is going to help the less fortunate! What a joke!","commenter_a":"And she has been for decades. So sad that so many black people are so clueless. This lying thieving dirt bag couldn't care less about anything but your vote.","post_message":"Talk about something the media will never show us. Look what happened when this young black girl got in Hillary's way. This is so sickening. Hillary is a complete and utter fraud."},{"comment_id":"1178309965526894","commenter_b":"@username I understand and do not disagree with you. I just believe that there is enormous demand for illegal workers by American employers for whatever reasons. That demand is what brings the illegals to this country and no one ever talks about this.","commenter_a":"Donald Trump does not have a problem with Mexican's, or anyone else for that matter. He has a problem, as do I, of illegally crossing the border to make use of our system without going through the proper channels. If you don't also have a problem with that, then this country is doomed.","post_message":"Worker says he took a stand against Donald J. Trump and his immigration policies by hanging a Mexican flag at the Trump International Hotel in Vancouver. \"From the concrete pouring, finishing, drywall, taping, wood forming and general labour, Mexicans were there, building it.\" @webpagelink"}]
