[{"comment_id":"727321410703321","commenter_b":"She is gross","commenter_a":"WILEY CYRUS","post_message":"Her parent's must be so proud! Smh..."},{"comment_id":"475937869263460","commenter_b":"what drug is she on these days? Think she's lost it in her old age....","commenter_a":"yes christian should pray all the time","post_message":"Parton delivers strong message to christians everywhere.  This is out of line, we need to show her that this type of public disrespect is unacceptable.   Do you agree that christians should be able to pray in public?"},{"comment_id":"10153115200467217","commenter_b":"He would embrace you but insist you stop sinning if his embrace is to continue . John 5:1-14..\"SIN NO MORE\"....","commenter_a":"Gemma Dunnell homophobes Homophobes everywhere","post_message":"\"I found a relationship with God... right around the same time I realised I was gay.\""},{"comment_id":"10152928923462293","commenter_b":"His twin appears normal. She also got a lead paint settlement?","commenter_a":"\"Didn't Die In Vain\" . . . but he lived in vain . . .","post_message":"Reports of Gray’s history with lead come at a time when the city and nation are still trying to understand the full ramifications of lead poisoning."},{"comment_id":"10154339330179087","commenter_b":"@username, who is afraid of immigrants? There are laws. Laws need to be followed to become a citizen. Do you want a POTUS ignoring federal laws?","commenter_a":"The left just can't help themselves. They have to cast this Trump... They have to portray him as somebody that's a walking mental midget, that literally has no idea what he's done here by winning the presidency, that has no idea how to talk, has no idea how to behave. They continue to make the mistake of plugging him into their model. They're plugging him into what they think an accomplished politician is, and he's not that, he's never been that, and he's not going to be that.","post_message":"“Trump and Pence, they pulled a dog and pony show on the numbers. I almost threw up in my mouth.”"},{"comment_id":"10153876614269024","commenter_b":"Kick this fucker right in the mouth","commenter_a":"What a poor excuse for a Mayor.","post_message":"@conservativebyt"},{"comment_id":"10153908258427235","commenter_b":"Clowns with Guns!","commenter_a":"Listen up numbnuts, the oath to protect the constitution against all enemies foreign and domestic means that YOU are the enemy and should be eliminated. YOU are the one threatening the government, YOU are the one who hates America. YOU are a moron and a #faketriot.","post_message":"These guys are treasonous."}]
