[{"comment_id":"10153296497591519","commenter_b":"@username No, I kiss your mother with that mouth.","commenter_a":"Racist Republican Religious Lying Christian Coward Party.","post_message":"\"Religions are not all the same, with some being more peaceful than others...\""},{"comment_id":"955856331137563","commenter_b":"Based on what I've seen it's because they are ugly and no man will take care of them.","commenter_a":"Why are liberal women unable to take care of themselves? Why must the liberal women depend on government for everything?","post_message":"To Jeb Bush and Republicans who don't think women's health should be a priority: You couldn't be more wrong."},{"comment_id":"10153941436496770","commenter_b":"Open your closed minds. Someday we will have a woman president but NOT THAT WOMAN!!!","commenter_a":"What s lie findlly give it up and give it a break. People make the most insane comments. Give the Rep. Some credit because we believe in ethics. You need to grow up and accept Trumps win . If you feel you need to live the country now then leave on the Miley train!","post_message":"And so begins the liberal blame game."},{"comment_id":"10153400467734228","commenter_b":"Why would anyone expect there are appropriate records if baby stealing was happening? Poor women!","commenter_a":"Records are only as good as your charting if it's not written down it didn't happen ! That's law never said it was a good law so a lot could have been left out","post_message":"\"You are trying to kill my character. You`re trying to lie and say I was at one hospital and you can keep up your records that good.\""},{"comment_id":"944724415582961","commenter_b":"Fuck all white people they stink as fuck come in my yard I'll kill all yall bitches I don't give a fuck about them crackers when they die they turn black bitch we all come from dust one man one woman dust is what color Brown bitch you black like us","commenter_a":"Sharokina Haghee","post_message":"This happened. A Facebook user who goes by the name of Geris Hilton posted a photo with a black child, who is allegedly the son of his co-worker. What happened next, will leave you disgusted. He and his friends decided to make racist “jokes” at the child’s expense. Had it not been for Black Twitter, they would have gotten away with it. MORE -----> @webpagelink"},{"comment_id":"10152785786292434","commenter_b":"All women can give you something. A headache, an empty wallet, herpes etc.","commenter_a":"Everyone has chlamydia. But Norway's a nice place to catch it.","post_message":"Well it certainly got my attention."},{"comment_id":"607183962802381","commenter_b":"@username then maybe you should move out of America if you can't handle it. Bye Felicia","commenter_a":"Only reason big cities elect her is Bc they are the low life's looking for their hand outs... Guess what?! You'll be returning your Obama phones soon :) haha","post_message":"We’re in New York with Chris Moody and Vanessa Yurkevich who are talking to voters about tonight’s dramatic election results. Any questions? Let us know! #CNNElection #ElectionNight #MyVote"}]
