[{"comment_id":"10152591778190927","commenter_b":"Give them an inch they will take a mile!","commenter_a":"Lies, lies, and more lies, this is all this administration knows how to do.","post_message":"They finally admit it."},{"comment_id":"10153953305054170","commenter_b":"It's really too bad the 'Pinoccio' factor isn't for real, Hillary would have four foot nose by now to go with her bulging eyes! Having made statements in front of people and then denying it, shows that she that she thinks we're all stupid! Well the jokes on you Hillary 'Rotten' Clinton, you're the 'Poster Child' for stupid! Careful what you say 'Hill' people around you do have a memory!","commenter_a":"Nothing has \"doomed\" her yet, doubt this will...","post_message":"Hillary definitively busted in another lie, by the father of one of the Benghazi victims. The media will try their best to ignore this so we're going to have to do their jobs for them."},{"comment_id":"2125671227658021","commenter_b":"And also a puppet parasite. She made thousands of ill people live in poverty and her life was everything except that. What a lie! ........ the same thing happens with jews, they say they are the people of god! Which one? Money god?","commenter_a":"MOther Theresa ... Love, Hope and Charity... Saint of the people ... Pray for us ... Amen.","post_message":"Mother Teresa is set to be canonized – made a saint in the Roman Catholic Church – on Sunday @webpagelink"},{"comment_id":"1705082506417935","commenter_b":"RACIST ASS HOLE!","commenter_a":"Trump is not for the KKK either Charlie.It's more likely that the Dems are still in bed with them","post_message":"\"What I really meant to say was...\"   WATCH:"},{"comment_id":"10152608268042452","commenter_b":"I know right she's thick not plus size","commenter_a":"She doesn't look so plus to some of us who are","post_message":"There's a big change coming to Sports Illustrated's swimsuit edition. For the first time, the magazine will feature a plus-sized model on its pages.  Model Ashley Graham will appear in a campaign for \"Swimsuits For All\", heralding a new chapter in the magazine's famous swimsuit issue.  So what do you think about a plus-sized model gracing the pages of SI? A sneak peek tonight at 11 from ABC7 Eyewitness News. abc7.la/1zifFNK"},{"comment_id":"10153207458909135","commenter_b":"Cindy- don't conern yourself with the three blind mice","commenter_a":"What lies are you planning on telling today? How are those donors and polls coming along?","post_message":"On the radio with Laura Ingraham now. Listen live here: @webpagelink"},{"comment_id":"931527210240361","commenter_b":"and why do women wear make-up? Hmmmm . . . .","commenter_a":"What a gent.... NOT!!","post_message":"Look on the face of woman as Lewis Hamilton sprays champagne in her face says it all."}]
