[{"comment_id":"773327109450736","commenter_b":"Sounds like she know how to have a good time.","commenter_a":"Billy Mills, Joshua Hill.. Here's an opponent for yall!","post_message":"Fighting a girl is a lose/lose proposition. @webpagelink"},{"comment_id":"10152892004126051","commenter_b":"This sick woman took advantage of boys. This was not age-appropriate activity. Why can't you creeps see the truth in that? The kid who told did the right thing.","commenter_a":"Kids these days,when I was a teenager we dreamed of something like that happening to use but now these little sissy go crying to their mommies. don't figure","post_message":"Police took one look at what this woman did to kids at a bar mitzvah and arrested her as quickly as they could."},{"comment_id":"10157991607240354","commenter_b":"Get them out of our country!!!","commenter_a":"Can't wait to have Trump in the White House soon enough. Obama and Hillary both want to stuff America with these sexual Islamic deviants in thousands. #SaveAmerica #VoteTrump","post_message":"Had they not been allowed in the country, it never would have happened."},{"comment_id":"1183433338419583","commenter_b":"@username Because they prefer her to Trump-- which is good.","commenter_a":"#HillaryClinton4President Bill Clinton's Presidency brought prosperity and economic stability leaving for the first time a projected surplus. George W Bush came along and reaped havoc on every financial sector, leaving millions losing their homes, Savings depleted and left America in the worst economic crisis since the great depression. Barack Obama won the Presidency and without any help from obstructionist Republicans, Obama saved America from another Depression and stabilized America's financial sectors. We need to Support and Vote Hillary Clinton for President of the United States to continue President Obama's Legacy and Policies, building on his successes and making America even greater than what it is. Republicans have been and continues to be America's Greatest Enemy! Twitter @sheriffali","post_message":"Bernie Sanders closes the gap slightly with Hillary Clinton this week following his victory in the Indiana."},{"comment_id":"1819434894958282","commenter_b":"@username pa la princess 😂😂😂😂","commenter_a":"Melissa Kaplan","post_message":"That pose though "},{"comment_id":"10153231600851491","commenter_b":"Well the last 3 harry Potter movies should had been directed by a woman then","commenter_a":"thats not how sexism works. Sexism is if there are qualified female directors available to direct, and they choose to hire a less qualified male director. If there are no qualified female directors available thats not sexism","post_message":"Emma Watson: \"I have been directed by male directors 17 times and only twice by women.”"},{"comment_id":"10153842036026336","commenter_b":"Is that all....disgusting? We can rid the nation of this vermin if we decide to get together and do it.","commenter_a":"Oh he didn't misread anything. He knows exactly what's going on and it's all part of his agenda to destroy America. Disgusting.","post_message":"Charles Krauthammer said that Obama's strategy to fight ISIS is not working because \"he thinks radical Islam is a passing phase.\""}]
