[{"comment_id":"10152987943491636","commenter_b":"We all foreigners no one stay for ever on this big country called earth.","commenter_a":"She's not banning foreign students only getting them to leave after they have qualified. It's not part of the deal that they can settle in The UK","post_message":"It's not a very popular decision"},{"comment_id":"707783986078846","commenter_b":"Ugly bitch man!!!!","commenter_a":"Just plain stupoid","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"1015647588491215","commenter_b":"'@username Hillary hasn't officially won the nomination there my dude... Did I say I was voting for her?","commenter_a":"In his defense, and I am in no way voting for this guy, he said the economy ran better under democrats but it SHOULD NOT be that way. So, that plays into him wanting to be a different option within the party. But whatever, the guy is a moron and I'm voting DEM!!","post_message":"LOL, WOW. You could ask this guy what he had for breakfast, and his answer would change from one minute to the next.   Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10156563321065354","commenter_b":"She is such a fucking idiot.","commenter_a":"A lying bitch just a lot of talk. Her proposals want ever work. Hillary though will never be president","post_message":"#6 and #7 will INFURIATE you..."},{"comment_id":"1022904834453429","commenter_b":"'@username TAKE YOU IGNORANT AGNOSTIC SELF AWAY....AND LEAVE THESE NICE PEOPLE ALONE ....TROLL!!!","commenter_a":"No. I don't think this God has anything to do with politics whatsoever. It's important to keep religion and politics seperate. Besides, this isnt even an important thing to be concerned about. There's a lot pressing matters to attend to than putting a God back into the government.","post_message":"SHARE IF YOU AGREE!"},{"comment_id":"1137397219630950","commenter_b":"Hey Josh this chick is tripping. Lol","commenter_a":"#newyorkvalues","post_message":"“I don’t want money, I’m going to rape you.”"},{"comment_id":"1357571687635909","commenter_b":"Kidult fan!","commenter_a":"That's what the fans should be saying to you","post_message":"Don't get us thrown out of Euro 2016"}]
