[{"comment_id":"10152922358545927","commenter_b":"PLEASE GET RID OF THIS TRAITOR NOW.","commenter_a":"This guy is quickly becoming a fossil himself.","post_message":"Obama VOWS to \"convene other nations to meet THIS threat. ...\" Can you guess what \"THREAT\" Obama is trying to combat?"},{"comment_id":"10152820540374342","commenter_b":"Run the woman down!","commenter_a":"If your gonna follow a potential road rage type person, keep the window rolled all the way up!","post_message":"\"Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off-road first time.\" Then things got even more frightening for a mother and her child when the woman stopped in the middle of the road and charged at their car."},{"comment_id":"10153590178129497","commenter_b":"You sons of bitches !","commenter_a":"Fearless!","post_message":"Via ClickHole:"},{"comment_id":"692289614253147","commenter_b":"Doubt it,he won't say anything different then he has already,he's got a small mind and can't think beyond the paper and crayolas","commenter_a":"No,it's not...after his scripted speech Hillary IS going to have a lot of problems","post_message":"This made my morning. I hope you guys enjoy it as well. ~Natalie"},{"comment_id":"1870199419930367","commenter_b":"@username I would argue that we are far worse than monkeys.","commenter_a":"What's truly is a tragedy is the length of time humans have been in existence, and we still haven't gotten very far and I don't think we're capable of forming a world based on simple human decency.","post_message":"A great nation is judged not by how many millionaires and billionaires it has, or by the size of its military budget. It is judged by how well it treats its weakest and most vulnerable citizens. A truly great nation is one that is filled with compassion and solidarity."},{"comment_id":"662069217316990","commenter_b":"Sorry Bitches !!! Go to jail !!","commenter_a":"Yes!!yes!!!!!yes!!! that;s a shame!! just think?? if that was your mom! or dad????","post_message":"These thugs tortured nursing home patients for an insane reason. These two are monsters. Let's lock them up and throw away the key. Do you agree these thugs should do life?"},{"comment_id":"10154830329021830","commenter_b":"wow what shit if a celb said something worth hearing then ok fine but most are just fucked up losers that cry for attention","commenter_a":"Anthony Turner","post_message":"Ashton Kutcher Helps Reiterate Why Tomi Lahren & Co Are Full Of Shit"}]
