[{"comment_id":"10153544587506350","commenter_b":"Real women dont need all that! They are content with the gift of life they just grew in their body for months!!!! This is a little overkill.","commenter_a":"Oh good grief...isn't the baby enough to show off? Must one be materialistic to have to have a push ring?","post_message":"Push presents (the bling or gift an expectant mom is given for, um, pushing) are getting more and more popular."},{"comment_id":"10152610651920667","commenter_b":"This girl is beautiful. Mrs. Rancic is just trying to make herself relevant by saying idiotic ridiculous comments. Amazing what people will do to try and get noticed.","commenter_a":"E! Should cancel the show, before they cause more trouble for them selves","post_message":"In dishing about all the red carpet looks on E!'s Fashion Police, Giuliana Rancic cracked that Zendaya probably \"smells like patchouli oil ... or weed.\" And an angry Zendaya took to Twitter to say there is a \"fine line between what is funny and what is disrespectful.\""},{"comment_id":"1210447342329069","commenter_b":"@username you are the brain washes moron if you believe the bs","commenter_a":"Of course republicans are pissed that Obama got those prisoners freed... They wanted those people to be killed thus becoming martyrs so they could use it as another excuse to go to war... And anything positive Obama does deflates their efforts to talk shit and make him look bad...","post_message":"Things just got VERY awkward for Obama's Iran critics."},{"comment_id":"10154249719951615","commenter_b":"Oh for real? That's good to hear bro.","commenter_a":"Poor kid. If Mt Oliver Cops are the lead investigators she may never be found. 😢😢😢😢😢😢😢","post_message":"PLEASE SHARE: Brandi Kolas was last seen Feb. 2 in Mount Oliver. She has blond hair and blue eyes, is 5 feet, 7 inches tall and weighs 110 pounds. Anyone with information about her whereabouts is asked to call 911, the National Center for Missing & Exploited Children or the Mount Oliver Police Department."},{"comment_id":"949558251844940","commenter_b":"All them women on the house wives shows","commenter_a":"@username Giselle Relleta","post_message":"Are you wearing dead animals on your EYELASHES?"},{"comment_id":"10152889213814071","commenter_b":"I'm gon die Miranda Hill Allie Lorimor","commenter_a":"Anfal Alkhalaf","post_message":"Listen to your dentist."},{"comment_id":"1180082675403600","commenter_b":"What a bitch and she says she is going to help the less fortunate! What a joke!","commenter_a":"And she has been for decades. So sad that so many black people are so clueless. This lying thieving dirt bag couldn't care less about anything but your vote.","post_message":"Talk about something the media will never show us. Look what happened when this young black girl got in Hillary's way. This is so sickening. Hillary is a complete and utter fraud."}]
