[{"comment_id":"817400965070133","commenter_b":"Full fledged ASSHOLE and you too @username...go back to Mexico you illegal alien!","commenter_a":"And you Bill de Blasio are a Asshole !!!!! At least Mr. Trump has the balls to stand up for what he believes in !!!","post_message":"\"I didn’t realize this was in question. Behaves like a racist, speaks like a racist…of course @RealDonaldTrump is a racist,\" New York City Mayor Bill de Blasio tweeted."},{"comment_id":"852688794861003","commenter_b":"Biggest POS IN AMERICA TODAY, then KILLARY","commenter_a":"Yes","post_message":"President Obama continues to top lists of most admired people in the world. Do you admire him?"},{"comment_id":"522092037950751","commenter_b":"Lol Uriah Bahl. Bitch","commenter_a":"Fuck these ingins","post_message":"\"It's a tiny community of [about 1,000] people taking on the federal government of Canada and three multi-billion dollar energy companies — opponents with virtually unlimited resources.\""},{"comment_id":"10156047259680231","commenter_b":"Kayne and Wiz are dirty whores!","commenter_a":"How you gonna forgive someone for you being a hoe? js","post_message":"Rose broke down in tears while talking about her exes during the SlutWalk she organized."},{"comment_id":"644948305695748","commenter_b":"She is still ugly","commenter_a":"I wish I could believe she would pay for this and Obama too","post_message":"Michelle was just caught red handed and is about to be charged with treason.  Good. It's about time she was exposed.  Do you agree Michelle Obama does not belong in the White House?"},{"comment_id":"10153263957778690","commenter_b":"I can't believe that I was able to watch this! Sometimes I can watch videos on here and sometimes not.","commenter_a":"the dictator in his fine living room....the syrians refugees knocking doors around the world hungry and cold...wtf?","post_message":"Syria: Broken Nation. To mark the four year anniversary of the conflict in Syria, Al Jazeera English will feature special coverage throughout the month of March.   In this film from June 2013, we follow Syrian exiles who risk their lives smuggling essential supplies to those fighting the regime inside Syria."},{"comment_id":"1284514134973476","commenter_b":"CJ 😂","commenter_a":"Eric Sylvain 😂😂","post_message":"It really be like that  #WSHH"}]
