[{"comment_id":"10154310886941178","commenter_b":"Spanish came from Spain which invaded south and north america long,long ago.So yes,spanish speakers invaded,killed and stole land long before white people.Feel better now?","commenter_a":"All you Mexican flag holders need to go back to the country you remain loyal to. Only legal Mexican are loyal to the USA. We welcome the ones that come in legally to assimilate and make America their country.","post_message":"The LA Times gets political over the Trump protests.  Here's their biggest concern..."},{"comment_id":"940190486114130","commenter_b":"What a fucking shitbag","commenter_a":"Bill Clinton was President and the Commander in Chief during part of my time in the National Guard. I had no respect for him as a man but had I ever encountered him I would have rendered proper military courtesy out of respect for the office of the President. When you put on the uniform you mo longer get to pick and choose.","post_message":"HA! She should've thought twice..."},{"comment_id":"10153248489871037","commenter_b":"Rob your a pussy.","commenter_a":"Hillary for Prison 2016","post_message":"A variety of sources in the Clinton orbit say they are anticipating an imminent announcement of #Hillary2016."},{"comment_id":"10153839178821636","commenter_b":"What exactly is your barometer for being 'ruined'? You realise Germany is one of the most successful countries in the world right? In terms of GDP, growth, economic viability, social mobility, lower wealth inequality, higher math and literacy, better education, lower incarceration and homicide rates, lower obesity, drug and alcohol addiction etc etc. If being among the top few countries in the world for such things is 'ruined', you clearly don't know the meaning of the word. Put aside the right wing and sensationalist news outlets for a moment, who's job it is to highlight every transgression of migrants and Muslims, in order to make things seem much worse than they actually are, and instead take a minute to appreciate just how successful and dominant Germany is right now. Merkel is smart, she knows migration is the key to economic growth and sustainability, even if it has some negative byproducts. ...","commenter_a":"Merkel has not only ruined Germany with her idiotic open door fantasies, she has caused havoc for the rest of Europe. In an ideal world we'd all be free to roam. But the world is far from ideal now is it!","post_message":"For one reason"},{"comment_id":"10155091022728734","commenter_b":"Look at these white American men!! Hahahah! Look at these savages","commenter_a":"Disgusting","post_message":"A 37-year-old man has been arrested after allegedly trying to pay a mother to have sex with her seven-year-old daughter."},{"comment_id":"10156419798640354","commenter_b":"John Lansing Hillary is a right winger?? She is the queen of liars!1","commenter_a":"What a tool Brokaw is.. people actually saw it too.. WE KNOW who is spreading lies and it's not Donald J. Trump","post_message":"You saw what Tom Brokaw said on-air this morning, right?   If not, we've got the VIDEO for you here..."},{"comment_id":"505113796343580","commenter_b":"They reproduce like rabbits, anytime a Muslim gives birth in an American hospital they should be sterilized.","commenter_a":"Screw the Muslims, they are all sheep in the cult of Islam.","post_message":"Watch what happens when Muslim Brotherhood extremists attack journalist in front of the NYPD!"}]
