[{"comment_id":"10153465168796162","commenter_b":"She shouldn't have said anything. Should not have been on social media while working.","commenter_a":"It's not racist it's just ignorant, she could have just said these rude people","post_message":"Brookfield Zoo responds after an employee posted what some may call a racist comment on social media... @webpagelink"},{"comment_id":"1164964563593106","commenter_b":"I saw them at Riverside too! I remember crying lol","commenter_a":"@username remember Riverside lol","post_message":"This is Paula first time on tour in 25 years!"},{"comment_id":"735565289967382","commenter_b":"Dear God, kick this ignorant African so hard he gets back to Africa. He needs English as a second language. Also needs to be taught to not make threats. What a POS. Go back to where you came from.","commenter_a":"This guy is a fanatic. He'd better be stop or someone s going to get Bharat namely, him","post_message":"Knife wielding Muslim attacks Trump, but watched what happens next. I bet he never expected this. Let's show him our support. Can we get 30,000 'LIKES' Donald Trump?"},{"comment_id":"1002435359842664","commenter_b":"One things for sure there's plenty to pray for. For those precious children, for their mothers who have been fed lies from hell's own lips, and for those who would advocate for such heinous things to go on. I guarantee you this girl has had a couple of abortions and they were oh so wonderfully sickeningly sweet to her- so that they can use her face and influence. Makes me sick. Yes, she is responsible for her sins, but she's just a rebellious, gullible kid that several of these snakes have sunk their fangs into. Just like Brittany Spears before her- and Raven Symone.","commenter_a":"My heart went out to her when she started turning crazy. She's in the throes of rebellion, but I think it came because some of the snakes of Hollywood influenced her. She's rebelling against her dad, and the way he's tried to raise her, like many of the child actors and performers before her. The kid used to want to be a missionary and help save lives. Now she wants to be a champion for killing. I will still pray for her. God's arm is not short.","post_message":"\"I'm a good person to put on the face of a T-shirt.\""},{"comment_id":"659614807562431","commenter_b":"I would have left that along time ago. Angree black woman.","commenter_a":"We don't give a shit about their marriage , they are destroying America and need to be kicked out of the White House NOW!!!!!!!!!!!","post_message":"It seems that Michelle and Barack are going there separate ways. How about in the meantime, we find a president who can actually run our country. Do you agree America should divorce the Obamas?"},{"comment_id":"10155072860698690","commenter_b":"Cedric-Herrou, wherever you're you're my \"Hero\" Blessed are those hands that giveths.","commenter_a":"Diego Dab","post_message":"Farmer Cedric Herrou is standing trial for helping people cross into France, but his actions have made him a local hero."},{"comment_id":"1796145143964177","commenter_b":"If this one was another girl we would probably try one more time and call it quits bc three is the most I could possibly handle EVER. I'm still iffy on having a third bc I can't possibly handle another Jacey lmao she crazy","commenter_a":"@username at least we got lucky","post_message":"A Brazilian couple has 13 sons and won't stop having kids until they have a girl."}]
