[{"comment_id":"10153907733031002","commenter_b":"I don't believe she \"deserved\" it at all. I also agree that a man that size obviously has other options to restrain someone. These girls need to realize these men aren't their daddy, brother, uncle.. They don't know how they are going to react, so they need to keep their hand to themselves. Neither party was right here.","commenter_a":"She Wasn't out of pocket. Just Because she was waiting for her brother that gave him the right to grab her up like she was an issue. This is a grown man, you don't punch a teenager on the face like she a man. He had no right to ever touch her, her brother was just trying to protect his sister, as he should.. PEOPLE are out of control.","post_message":"A mother is demanding answers after her daughter was punched during a heated exchange at a skating rink."},{"comment_id":"1602329080072552","commenter_b":"Didn't he say \"it's easy for us to be around this everyday. It's hard for them to adjust after coming back from war\".","commenter_a":"Vote for Hillary...to finish the job on America that Obama started....","post_message":"Trump's message to veterans with PTSD isn't just wrong. It's dangerous. - Jon Comulada"},{"comment_id":"10153963116971341","commenter_b":"Better one soldier in jail and one terrorist dead then one terrorist in jail and one Israeli dead. That Palestinian is a terrorist who tried to stub innocent civilians.","commenter_a":"A large proportion of the Israeli population supports these extra-judicial killings @webpagelink","post_message":"\"What happened in Hebron does not represent the values of the Israel Defense Forces.\""},{"comment_id":"1179133135441029","commenter_b":"No you're thinking of a dog. Easy mistake to make.","commenter_a":"Wasps bite. They don't sting.","post_message":"And you thought getting stung was bad."},{"comment_id":"10153250160727235","commenter_b":"sue and angela, dumb bitchs","commenter_a":"I'm a gun owner and have a permit to carry. I'm also sick and tired of the gun nuts. There is absolutely no accountability on their part for the tens of thousands who die by guns every year. The NRA can kiss my ass also. Just a bunch of crazies and I'm sick of their crap. I also used to be a member. Time to grow up America and hold people accountable.","post_message":"What kind of people would be enraged because of a benefit for dead children? OH."},{"comment_id":"10153707515144778","commenter_b":"Laura, by all means move to Georgia and so you can all the naked men you want.","commenter_a":"A Georgia police officer shot and killed a naked, unarmed man at an apartment complex Monday and this is local news because?","post_message":"A Georgia police officer shot and killed a naked, unarmed man at an apartment complex Monday. What exactly happened is now being debated."},{"comment_id":"1236189426462383","commenter_b":"#ImNotWithHer","commenter_a":"You mean Hillary campaign staffers posing as sanders supporters","post_message":"Bernie Sanders supporters have taken to Twitter to reluctantly express support for Hillary Clinton using the unenthusiastic hashtag #GirlIGuessImWithHer."}]
