[{"comment_id":"1247325575291461","commenter_b":"Third *","commenter_a":"That's a fair shout but we killed them all off and interbred with them now we have evolved and are the last stage you see before your eyes, religion is cool except for when it blinds you and # Christianity is young as fuck compared to other religions fam","post_message":""},{"comment_id":"10154510747482446","commenter_b":"exactly wouldn't lower myself following that nasty woman.","commenter_a":"Hate mongering liberal degenerates that do what they normally do... Act like revolting pieces of trash that they ALL are","post_message":""},{"comment_id":"10153877177851162","commenter_b":"Get raped to death","commenter_a":"I'm not sure if they deserve death or to get raped everyday. Tough call.","post_message":"JUST IN: Two men have been charged with murder in the fatal shooting of a pastor's pregnant wife during a home invasion.  Amanda Blackburn was raped and shot in the head during the attack at the couple's home. She died the next day.  NEW DETAILS: @webpagelink"},{"comment_id":"10150755194664999","commenter_b":"Are you suggesting women become prostitutes?","commenter_a":"Domestic housekeeping is correctly dismissed as being of economically minimal value, because in the free labor market performing these tasks for others (child care / babysitting, housecleaning, short-order food preparation) are low- (or no-) skill jobs that are either minimum-wage, or \"under the table\" cash-based work.","post_message":"\"We need to call work what it is — work — whether you do it at home or whether you do it out in the labor force, and then give men and women options to choose what they want to do.\""},{"comment_id":"451215538402360","commenter_b":"I will refuse, fuc her and the dirty dog she rode in this on!","commenter_a":"YES","post_message":"Will You Refuse To Turn Over Your 2nd Amendment Rights To Michelle?  Comment 'yes' or 'no'."},{"comment_id":"1128964310481999","commenter_b":"Dayton Huebner thank you for proving yet again that one can't cure stupid or open a closed mind. Just once I wish people who are still stuck in the 50's definition of communism would educate themselves. You aren't even close.","commenter_a":"I've never contributed any financial assistance to a political campaign before. Couple days ago, I did, and it went to the campaign of Bernie Sanders. I don't usually trust politicians, and I don't ever remember being as excited as I am today about a candidate running for the White House. Bernie Sanders has not only earned my vote, but also my contribution to his campaign. Bernie Sanders has raised millions of dollars from small contributions from middle-class, ordinary families, unlike most politicians that go to their Wall Street buddies to beg for big cash donations. Bernie Sanders doesn't flip-flop on issues like most politicians do, his message was the same back in the 1990's. You can youtube it, it's incredible how honest and passionate he is, and has been about the need for our government to work and represent all Americans, and not just those at the very top. I ...","post_message":"In 1944, President Franklin D. Roosevelt presaged Bernie Sanders by calling for a \"Second Bill of Rights\" of an economic nature. They were:  The right to a useful and remunerative job in the industries or shops or farms or mines of the nation; The right to earn enough to provide adequate food and clothing and recreation; The right of every businessman, large and small, to trade in an atmosphere of freedom from unfair competition and domination by monopolies at home or abroad; The right of every family to a decent home; The right to adequate medical care and the opportunity to achieve and enjoy good health; The right to adequate protection from the economic fears of old age, sickness, accident, and unemployment; The right to a good education.  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"836075406488713","commenter_b":"Punch her out, Sarah!","commenter_a":"Between Hillary or Sarah it would be Sarah in a heartbeat.","post_message":"“I’m ready for Hillary, are you? Are you coming?”  - Sarah Palin"}]
