[{"comment_id":"10152863643681990","commenter_b":"Illegal immigrants should not be here to commit any crime. U. S. Citizens do not need the extra concern.","commenter_a":"Yes look at Dyllan Roof he looks Latino... He shoot 9 black people last month in church.","post_message":"IMMIGRANTS AND CRIME: Despite rhetoric in the Pier 14 shooting Francisco Sanchez case, immigrants do not commit more crimes that U.S. citizens. That's according to 100 years of research according to the American Immigration Council. @webpagelink"},{"comment_id":"10153414020695950","commenter_b":"A nebulizer doesn't even come CLOSE to the amount of power required for a VENTILATOR. Lady, are you freaking SERIOUS?","commenter_a":"Hope the family uses their blessing wisely now keep the lights off when not in use teach kids to open blinds for lighting in the day ...it's time people learn to turn things off when not in use to keep from having a bill u can't pay ....this firefighter was a true blessing","post_message":"After firefighters arrived at the house for a non-emergency medical call, they learned that one of the family's children requires a full-time ventilator to breathe. But the house no longer had electricity because the parents fell behind on payments, so one firefighter decided to light up the home with generosity."},{"comment_id":"886882338071488","commenter_b":"Go hug an illegal alien.","commenter_a":"Obama has done nothing for this country but make us the biggest joke in the world!!!! Hillary is worse!!! She wrote her memoirs and can't remember a thing about Whitewater, Bengazi and now the emails? Worse Secretary of State next to Kerry. How is she qualified? We have become the laziest country in the world and too much self entitlement.","post_message":"Democrats win. It's not even close! Data source: BLS and The Wall Street Journal Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1818799778404105","commenter_b":"It is time for a woman president peeps..........this is not the woman.","commenter_a":"She may have one the debate, but America lost in this Presidential election","post_message":"Join Hillary live in North Carolina for her first rally since winning last night's debate → IWillVote.com"},{"comment_id":"10153258414916770","commenter_b":"she more democrat liberal pig","commenter_a":"Megyn Kelly shouldn't be permitted to go anywhere near another GOP debate for the rest of her life after the debacle of the last one she was allowed to moderate..The sooner Fox News fires her off into oblivion the better..","post_message":"Donald J. Trump reignites the drama between himself and Megyn Kelly ahead of the January 28th Fox News Republican Debate."},{"comment_id":"1208229205939996","commenter_b":"CRIMINALS DON'T OBEY GUN LAWS OR ANY LAWS!","commenter_a":"Somebody went postal in Orlando last night. Another mass shooting, our country has so many. I have to have a licence to drive a car, to prove I am not so crazy as to kill people with it needlessly. But any idiotic crazy person can own a gun, or lots of them, with no accountability. The second amendment was not written to cover high capacity assault rifles, designed only for killing people.","post_message":"LATEST: Approximately 20 people are dead and scores wounded after a gunman opened fire and took hostages at a gay nightclub in Orlando."},{"comment_id":"10155086092991509","commenter_b":"They even rape cows over there... And they think cows are Gods. It's weird.","commenter_a":"India has one of the worst rape problems in the whole world, honestly if you're a woman going out after dark there it's almost a sure thing that you will get raped","post_message":"The suspect was reportedly out on bail while he awaited trial for his first rape of the teenage girl."}]
