[{"comment_id":"10153620969383352","commenter_b":"Girl people have no life!!!","commenter_a":"He's having a separate party for her idiots!!!","post_message":"CHRIS BROWN SKIPS ROYALTY'S FIRST BIRTHDAY PARTY TO BE IN MIAMI. SOURCE SAYS HE DIDN'T GET HER A GIFT OR HELP PAY FOR CHUCK E. CHEESE EITHER!"},{"comment_id":"1189532041066824","commenter_b":"only girls use pillow when they fight","commenter_a":"A pillow fight injured more than two dozen people????? Boy, are we ever ready for World War 3 if need be!!!","post_message":"UPDATE: A pillow fight at the United States Military Academy at West Point turned so violent that it caused concussions in 24 cadets, the superintendent of the school told NBC News on Saturday."},{"comment_id":"10154071724086320","commenter_b":"she is an amazing woman with a wonderful gift of talent","commenter_a":"I loved it","post_message":"Watch and see why everyone was crying after Kelly Clarkson's emotional performance on last night's \"American Idol.\" @webpagelink"},{"comment_id":"10153776630979714","commenter_b":"Woman here. Would never get an abortion myself, but don't want to impose my beliefs on others so if others want to abort, go ahead. I do not feel the American tax payers should have to fund others abortions, though.","commenter_a":"You have no place to discuss abortion or planned parenthood unless you are a female.... If you're a man, shut the hell up because most of you cant even tell me how many days are in between menstral cycles.","post_message":"Do you, Lena Dunham."},{"comment_id":"10154714016861509","commenter_b":"Now how is that wall going to work?","commenter_a":"Carlos","post_message":"It even had its own elevator."},{"comment_id":"10152991512942377","commenter_b":"She broke the law just by living too long","commenter_a":"Do not pass go, do not collect $200M","post_message":"Hillary says she never received classified emails on her personal server. Do you believe her?"},{"comment_id":"2113127628913184","commenter_b":"He just gained 3 points sweet","commenter_a":"HILLARY !!","post_message":"We’re in a drone flying above a voting center in Parma, Ohio #CNNElection #ElectionDay #MyVote (no sound)"}]
