[{"comment_id":"987930937907325","commenter_b":"That's how twisted this pervert is ! Prison !","commenter_a":"well well I never heard that stupid statement made before didn't fly with me","post_message":"UNBELIEVABLE! The audacity...  Story: @webpagelink"},{"comment_id":"10153145409004342","commenter_b":"Woman why the hell are you on a Houston news site? Get the hell back to Arkansas.","commenter_a":"You have to kill someone because they pissed you off....seriously? Houston a breeding ground for mental cases","post_message":"Police say a man who was shot and killed while changing a flat tire may have been targeted due to an altercation at another location."},{"comment_id":"652024288284285","commenter_b":"I'm so glad.","commenter_a":"Yes","post_message":"Muslim Miss USA Chooses Jesus Over Mohammed... Islamic Community FURIOUS  She has the right to believe whatever she wants to believe.   Do you support her choice?"},{"comment_id":"10156286873240389","commenter_b":"As Hillary Clinton would say 'What difference does it make'.....NONE!!! #DefundTheGOP!","commenter_a":"Welcome back John Boehner!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10155175769803984","commenter_b":"and we are not giveing up our freedom just stoping people entering oir country...our constitution does not apply to immigrates","commenter_a":"*'B4 you blame Trump read this'* ******************** *I still DO NOT understand why there's so much noise about Trump's decision to ban refugees from Muslim countries?? There are '100,000 empty fully air conditioned tents' in Mina- Saudi Arabia capable of housing 3 million people yet Saudi Arabia refuses to take the refugees, who speaks same language, same culture, same tradition, same religion, yet Saudi Arabia feels it's 'a security risks to accept the refugees' but wants the Christian world to do so? I'm trying to understand this thing called 'common sense', how it's been used. Is Saudi Arabia not too wicked for turning it's back against its own? Why blaming the US? Remember it is part of Trump's election promises, yet the Americans voted for him, meaning dats what they want.* *Germany took over 1 million refugees and Saudi Arabia came up with a proposal of spending billions to build ...","post_message":"Donald J. Trump gave Iran 1 chance to straighten up, and they defied him.  So now he's made a massive move to teach them we're the ones in charge.  Thank the Lord for a president with an actual backbone!"},{"comment_id":"1345080275507252","commenter_b":"I cannot believe how many selfish bastard whites live in this country that they stole from Mexico with a trumped up phony war. These selfish bastards all belong to the Repubtard party. which we need to destroy.","commenter_a":"Why do we have to pay for every disgruntled citizen from every country in the world.....you politicians have us deep in debt but want more from us....All you are doing is enabling irresponsible government around the world.....everyone sees the US as the international welfare program....we have too many of our own citizens who need to be cared for....and their violence is no worse than our own....","post_message":"I hope the administration reconsiders these raids. These children and their families are fleeing extreme violence in Central America and they should have a chance to seek relief, which is why I introduced the “Fair Day in Court for Kids Act” — a bill that mandates counsel for these vulnerable individuals. Instead of separating children from their parents, the administration should continue to address the violence and instability in the region that is forcing these families to leave."},{"comment_id":"10154181766797093","commenter_b":"It's non violent offenses .","commenter_a":"What about victims? Can you erase their memory?","post_message":"If you have a criminal record, a group of Dallas county judges will help people with criminal records get their lives back on track. bit.ly/2li0sJ9"}]
