[{"comment_id":"858391040863023","commenter_b":"Hillary should be strapped to the front of the bus in bumper to bumper traffic.","commenter_a":"another clown to join the clown bus! Out of touch with reality","post_message":"Dr. Ben Carson is running for president. Here's where he stands on the issues..."},{"comment_id":"947171632075323","commenter_b":"She can put them in her house","commenter_a":"She is insignificant.","post_message":"Now Amal Clooney slams Britain!"},{"comment_id":"1173415112684267","commenter_b":"Society is being destroyed by this abomination! Gay lifestyle brought the AIDS virus, now innocent woman and children are dying because of promiscuity, bisexual acts, and gay relationships! Sin has deadly consequences that all in society pay the price for! That's why Rian!","commenter_a":"I agreed ban same sex marriages.","post_message":""},{"comment_id":"10153584553228010","commenter_b":"time for a woman in the white house now","commenter_a":"Don't blame me for the situation of this nation. I did not vote. I opt out.","post_message":"What if you were automatically registered to vote? Oregon has a history as a ballot-box innovator."},{"comment_id":"10153898665266336","commenter_b":"Don't forget about us crazy white women !!","commenter_a":"The white boys who are already here have horrible things on their minds. When are you going to call for them to be banned Donald the clown? @webpagelink","post_message":"On last night's 'The O'Reilly Factor,' Donald J. Trump defended his proposed Muslim ban and said the U.S. \"cannot allow people to come into this country that have horrible things on their mind.\" @webpagelink"},{"comment_id":"997942853639367","commenter_b":"Shut up ! this is ridiculous ! I refuse to allow illegal immigrants to pour into this country.","commenter_a":"Yes","post_message":"Seattle Mayor Murray, officials and advocates are holding a press conference in response to President Trump's executive orders on immigration.  Do you think Seattle should remain a sanctuary city?"},{"comment_id":"10153668595164099","commenter_b":"This woman again? The Nurse who doesn't care if she infects everyone else? Go away! Your 15 minutes are over.","commenter_a":"Why are there so many greedy people in health care.","post_message":" never had Ebola. I never had symptoms of Ebola. I tested negative for Ebola the first night I stayed in New Jersey governor Chris Christie private prison, Kaci Hickox, 34, said. -----> @webpagelink"}]
