[{"comment_id":"10152784038336491","commenter_b":"Preaching to the choir, sister! One of many reasons I'm now divorced.","commenter_a":"Now if only science could find a man worth having......","post_message":"Science shows that there are quite a few health benefits of getting intimate."},{"comment_id":"10153982598576509","commenter_b":"Burn","commenter_a":"@username Angel Castro @username Ivan Longoria noooooooohhhhhh!!!","post_message":"Some retailers are offering Caitlyn Jenner costumes for Halloween, but critics say these costumes mock the transgender community. What do you think? @webpagelink"},{"comment_id":"10154178677146943","commenter_b":"Abedin is corrupt woman with an agenda..Hillary's agenda. Watch..if anyone goes down for corruption it will be her, and Hillary Clinton will get off by throwing her under the bus! It seems to me that HC always surrounds herself with live shields for her own protection. Everyone of them should be held accountable..starting with Hillary Clinton!! Why is she even a candidate?","commenter_a":"Lock them up...Lock them up...Lock them up!!!","post_message":"A Clinton Foundation donor and St. Louis-based political consultant begged Huma Abedin to get former Secretary of State Hillary Clinton to meet with her client, the U.S. largest coal company, according to emails released by a conservative legal group.  , I need your help now to intervene please, Joyce Aboussie, a Clinton Foundation donor with close ties to the former First Family, emailed Abedin in June 2009 after Clinton had been leading the State Department for about six months. - via The Daily Caller"},{"comment_id":"1819434894958282","commenter_b":"@username pa la princess 😂😂😂😂","commenter_a":"Melissa Kaplan","post_message":"That pose though "},{"comment_id":"10153931593886336","commenter_b":"Let's add panderer to Hillary's resume after liar. Perfect qualifications to be the next President.","commenter_a":"She has mislead the Hispanic voters by lying to them. Just because they do not understand the law and the BS she has so taken advantage of them. Hillary for Prison in 2016.","post_message":"A campaign post aimed at winning over Latino voters has backfired and instead is drawing the ire of many social media users for purportedly playing up ethnic stereotypes."},{"comment_id":"10152829564776770","commenter_b":"Go home Clintons","commenter_a":"Bullshit cover up","post_message":"Hillary is secretly a great person, says Clinton campaign"},{"comment_id":"10154121936472894","commenter_b":"Yes... trip his ass!","commenter_a":"I don't understand why some dudes so quick to wanna shoot at other dudes over money & drugs.. BUT NO ONE HAS SHOT THIS FOOL YET! Some thug nigga, PLEASE COME BE MVP. Make that sacrifice. 😂😂😂😂","post_message":"George Zimmerman Kicked Out of a Bar After Calling the Manager a Ni*ger Lover"}]
