[{"comment_id":"10153122322244705","commenter_b":"Rehan Perera Damith Wickramarathne","commenter_a":"It never looked black! Blue n Brown. On the right it's got black with blue.","post_message":"And there you have it, folks!"},{"comment_id":"10153304939531350","commenter_b":"He's a combo look of Chandler from 'Friends' and her ex-husband","commenter_a":"Courtney Cox marrying band member Johnny McDaid from Snow Patrol. My favorite 'Friends' and my favorite band!","post_message":"'She wants to be the flower girl, all the bridesmaids. She's very excited about it.'  CC: The Ellen DeGeneres Show"},{"comment_id":"10153735094753701","commenter_b":"As long as he doesn't use it as a photo op","commenter_a":"Molly in case you wondered, he flew in on a plane THEN a helicopter. Lol","post_message":"President Obama is expected to land in Eugene a little before noon and then take a helicopter to Roseburg to meet privately with families of the #UCCShooting victims. He is not planning any public events."},{"comment_id":"10155889983075354","commenter_b":"This was the flag of SOUTHERN DEMOCRATS, no less! It took a Republican (Lincoln) to free the slaves!","commenter_a":"With all of the 'racism this, and political correctness that' nonsense going on, the attempt to distract the masses is working. Do you know the REAL REASON this flag is under attack?? Simple, it's because it's the rebel flag, the flag of RESISTANCE!!! The one true evil behind all of this, is government. They realize people are waking up to their BS and want the sheep to behave... nope, I will NOT ABIDE!!! Wake up people!!!","post_message":"'I understand the true nature of the war, and slavery was not the primary issue.'"},{"comment_id":"10154373142406509","commenter_b":"It's bc she's white and rich.","commenter_a":"When you have money the law work for you and when you're poor it don't","post_message":"Tonya Couch, the mother of so-called 'affluenza' teen Ethan Couch, had her bond lowered from $1 million to $75,000 at a hearing on Monday."},{"comment_id":"10153544562557411","commenter_b":"Maybe if he didnt talk back, laugh and pull away, they would have let it go!!","commenter_a":"How can u steal FREE milk?? Lol smh....","post_message":"'This is ridiculous... this is beyond embarrassing... he's at home for 65 cents.'"},{"comment_id":"10153778472068984","commenter_b":"She doesn't owe anyone anything, much less a fucking apology lol","commenter_a":"Carly, how can someone so well versed on most subjects, be so uninformed on Muslims? Even Muslims know Islam is not a religion but an ideology of submission only. Therefore you owe Ben Carson an apology for being correct when he said they are not covered under OUR constitution. READ the Quran for yourself Carly and you will find out that you are an Infidel and are to be killed if you do not SUBMIT to Allah. Does that sound like someone our constitution would support? I think NOT!","post_message":"Carly Fiorina just revealed what she thinks about Ben Carson's comments about a Muslim serving as President of the United States - and you might be surprised with where she stands...  Do you think Fiorina is showing her true colors?"}]
