[{"comment_id":"1237593022967110","commenter_b":"'@username Because God made her a woman, SHE chose to be a sinner!","commenter_a":"Mormons are a religious cult not Christian in any shape or form. The only way that woman will ever change will be by the power of the Lord Jesus Christ and him alone.","post_message":"Beaten and made to carry bags of rocks for 18 hours a day"},{"comment_id":"760149437402889","commenter_b":"She's a fucking looney bitch","commenter_a":"Right wing shrieking is true.","post_message":"Chris Hayes throws down with Americans for Prosperity's Jennifer Stefano over the right’s relentless focus on destroying the health care law. #BestOf2014"},{"comment_id":"1073790629380657","commenter_b":"'@username. Just fn Stop it with the Fox 'news' total BS talking points. Insurance is about LIABILITY, not necessarily self protection..and it's Democratic Socialism at it's core such as our tax code: Put $$$ into the pot to benefit/secure your society's quality of living. The phrase 'free market capitalism' is nothing but corporate fascist propaganda for dumb asses.","commenter_a":"I like to ask people that hate socialism why they buy insurance? You can almost see them stroke out as they start to think really hard about the question.","post_message":"Brilliantly done."},{"comment_id":"1125267834218418","commenter_b":"His old ladies big ass!!","commenter_a":"Oh puleeze.....","post_message":"Obama posted this 'Happy Easter' pic on Sunday, but it didn't take long before people started noticing 1 enormous problem.  Did he just get caught in a sickening lie? Probably... but decide for yourself."},{"comment_id":"10153100561240329","commenter_b":"She's a pornstar","commenter_a":"I'm like how'd she land that job..like what conversation took place..how's was the interview conducted..do u interview her or her vagina","post_message":"¯\\\\_(ツ)_/¯"},{"comment_id":"535194776668815","commenter_b":"Enough reason to deny them into the USA!!!!","commenter_a":"Send them to the Obama White House when theyb return from vacation.","post_message":"***WARNING***"},{"comment_id":"10153839178821636","commenter_b":"What exactly is your barometer for being 'ruined'? You realise Germany is one of the most successful countries in the world right? In terms of GDP, growth, economic viability, social mobility, lower wealth inequality, higher math and literacy, better education, lower incarceration and homicide rates, lower obesity, drug and alcohol addiction etc etc. If being among the top few countries in the world for such things is 'ruined', you clearly don't know the meaning of the word. Put aside the right wing and sensationalist news outlets for a moment, who's job it is to highlight every transgression of migrants and Muslims, in order to make things seem much worse than they actually are, and instead take a minute to appreciate just how successful and dominant Germany is right now. Merkel is smart, she knows migration is the key to economic growth and sustainability, even if it has some negative byproducts. ...","commenter_a":"Merkel has not only ruined Germany with her idiotic open door fantasies, she has caused havoc for the rest of Europe. In an ideal world we'd all be free to roam. But the world is far from ideal now is it!","post_message":"For one reason"}]
