[{"comment_id":"1259466750760461","commenter_b":"@username=republitard shitbag","commenter_a":"Really? Last I checked, this is still Obama's America...... Next year you can call it Trump's but for now it's ALL Obama......","post_message":"Welcome to Donald Trump’s America."},{"comment_id":"895415013919526","commenter_b":"Now that her husband's term as President is closer to end, she should not have spoken like that. She had known before she moved with her husband and daughters that she woukd wake up in the house built by slaves.","commenter_a":"Reading these comments reveals why we're stuck as a nation on racial issues. There are a lot of black people who refuse to acknowledge we're no longer in 1955 and their shortcomings are primarily their own (the Obamas are not in that camp, by the way); and there are a lot of white people in stark denial of our nation's less than glorious past. And do people even read articles before they post their drivel? The First Lady was praising America for our progress, not looking down on the nation. Get a grip, people.","post_message":"Michelle Obama gave her last commencement speech as first lady at the City College of New York."},{"comment_id":"10154108644646178","commenter_b":"This is where GWB, Dickhead Cheney and all those racist MURDERER Cops belongs. They are the real MURDERERS !!!","commenter_a":"Stupidity abounds in the liberal media. Wake up folks!","post_message":"\"Well, actually, again, if you are a terrorist you belong in Guantanamo Bay. That where they should stay....\""},{"comment_id":"736002233211226","commenter_b":"She is such a wonderful bitch isn't she!?!!!","commenter_a":"I like Karma.","post_message":""},{"comment_id":"649755178530332","commenter_b":"Please start packing now! Believe me no one will even miss you and your dirty mouth.","commenter_a":"V","post_message":"I guess it's time to say goodbye, and good riddance. 'LIKE' if you support Whoopi leaving the country!"},{"comment_id":"10152705081476519","commenter_b":"And have lots of sex in ur ass ur gonna get raped first","commenter_a":"You might be interested in Googleing why it was banned. Few today would believe the pseudo-science mumbo jumbo presented as fact to Congress. 1) Smoking marijuana will make black men want to rape white girls. That's girls not women. There is ZERO evidence here. 2) Smoking marijuana will make young men more likely to experiment with homosexuality. THAT may be true, but the rest of the presentation turned that simple statement into more of an assertion that it would turn young men gay.","post_message":"\"It is time for us to replace the failed prohibition with a regulatory system that works and let states and municipalities decide for themselves if they want, or don't want, to have legal marijuana within their borders.\""},{"comment_id":"10154542525666051","commenter_b":"So we get rid of all the illegals and we pay $5.00 for a head of lettuce cause who is going to do all this work?","commenter_a":"Sneaking into our country is explicitly illegal. Why is Mexico allowed to have a wall on its southern border with strictly enforced immigration laws but America isnt? What would happen to 100% of Americans caught illegally entering","post_message":"The Trump Administration's latest deportation plan is explicitly illegal under international law. Here are the details:"}]
