[{"comment_id":"10154505706873812","commenter_b":"If you create terror among a group because you are shooting them and killing them, you are a terrorist. If you align yourself with a KNOWN terrorist group, you become part of that terrorist group. I don't believe any domestic terrorist has EVER sworn allegiance to God and commenced to killing folks though.","commenter_a":"Just because it's deleted doesn't mean it wasn't said!!! He swore his allegiance to isis! We already know this. I guess offending those of the same belief and/or faith is more important than the entire truth being released so it's sugar coated and deleted. Sickening!! Why bother releasing any of it if you delete the parts where he ADMITS he's a freaking terrorist?!!!!!","post_message":"UPDATE: DOJ and FBI release full transcript from Orlando shooter's 911 call to provide the \"highest level of transparency.\" abcn.ws/28It1Ld"},{"comment_id":"1729670857287408","commenter_b":"HILLARY CLINTON YOUR HONEST, LOVING, CARING CANDIDATE! @webpagelink","commenter_a":"Be patient my precious. Von Clownstick will not win the White House. Hillary will crush him come November. Then all these Dumpsters can slither back to their respective holes. Bye Drumpf.","post_message":"Donald Trump is closer than ever to clinching the GOP nomination. There's only one candidate who has more votes."},{"comment_id":"873971869318028","commenter_b":"You can hack those toys so easily","commenter_a":"Junior Marquina Perez & @username I WAS NOT ABLE TO SEE YOUR REPLY :'(","post_message":"Do your kids like the Minions? One family did a double take after hearing their 5-year-old daughter's McDonald's Happy Meal Minion toy speak:"},{"comment_id":"10156170333030354","commenter_b":"I think they just said on Fox and Friends he didn't want to go back to that school. They never reported any of this. The kids dad said he was not going back to that school and the president is involved so probably private school.","commenter_a":"The kid is probably probing...dont trust Muslims","post_message":"Have the media given you the police's side of this story?"},{"comment_id":"10153915589591336","commenter_b":"Russian women are hawt !!!!","commenter_a":"Putin thinks Trump is great Could this mean that we could be friends again with Russia if Trump wins? I think so","post_message":"Donald J. Trump has plenty of admirers, and you can apparently count Russian President Vladimir Putin among them."},{"comment_id":"488963091300703","commenter_b":"Amen and Amen. If you have no respect for our country then stay out. I believe in freedom but don't come over here trying to change this country into the country you left. If your country was so great then why did you leave?","commenter_a":"I see no problem in this","post_message":"What do you think of Donald J. Trump's plan to combat terrorism? @webpagelink"},{"comment_id":"10153010022651770","commenter_b":"They boy that was trying to force the little girl in the bathroom was asked why did you do that ,an the boy said ,thats what daddy does to mommy !!!!","commenter_a":"Little kids are not mature enough to determine if they are transgender. They have been brainwashed.","post_message":"Miraloma Elementary principal Sam Bass said the bathroom change is because between six and eight students have decided they are transgender, or are tomboys."}]
