[{"comment_id":"10154196764344749","commenter_b":"@username hahaha","commenter_a":"Does it poop inside the pouch? How does it eat? - So many questions...","post_message":"This tiny joey seems to enjoy her time watching the outside world, but she soon retreats back into the comfort of her mother's pouch."},{"comment_id":"10156399276440354","commenter_b":"What are you a freaking psychic? How would you know who is Christian?","commenter_a":"Man look all this Christian compassion.","post_message":"Ex-porn star Bree Olsen: \"It's bulls**t.\""},{"comment_id":"10152659082871717","commenter_b":"And don't forget daughters who talk back to their fathers. They get stoned to death too.","commenter_a":"Here's an idea: since many want gays executed according to biblical law, how about following biblical law to execute adulterers, pedophiles, fornicators, tattoos, and et al?","post_message":""},{"comment_id":"1250137068360096","commenter_b":"@username Oh no! not more people adopting, what a horrible place we live where people want children in their homes!!!","commenter_a":"You people know so little you call that a win just pitiful","post_message":"YES!"},{"comment_id":"1411157285603697","commenter_b":"Californians will get tired of being victims eventually and deal with these guys.. meantime lets send liberals refuges and illegals to them","commenter_a":"Brown is a two-time failure as governor.","post_message":"More are coming..."},{"comment_id":"10152917753321051","commenter_b":"The bitch cussing in the background should not be near kids!","commenter_a":"Good for you two to look out for that child! She shouldn't be near any children! !!!","post_message":"When a man saw how this woman was treating a 3-year-old, he knew he had to intervene."},{"comment_id":"10154329807781051","commenter_b":"These insecure women manage to chase away the good men...then end up with another POS and can't figure out why...imo","commenter_a":"Opps!","post_message":"This girlfriend really, really didn't trust her boyfriend, so she decided to send a porn star to test his fidelity while she watched it unfold on camera. She thought she was ready for anything - but she was definitely not ready to see what he did."}]
