[{"comment_id":"10153331816764087","commenter_b":"Time to make another donation to PP!","commenter_a":"and this is how our tax money is spent! Disgusting, we should defund all these Republicans, 1 month no pay for each time you waste our money on senseless, going nowhere bills. Aren't there bigger problems to solve?","post_message":"Senate Majority Leader Mitch McConnell on Tuesday dispelled speculation that Republicans might drop a provision defunding Planned Parenthood from an ObamaCare repeal package."},{"comment_id":"10155313897730231","commenter_b":"Oprah, don't do it!","commenter_a":"He need two jobs!","post_message":"Own gives reality show to man with 34 children. ‘Fix My Life’ coach to guide him during the show."},{"comment_id":"1110306035681925","commenter_b":"She's a evil hypocrite","commenter_a":"Good point!","post_message":"'Hillary Clinton doesn’t miss an opportunity to ridicule Donald Trump’s illegal immigration solution of a wall on the southern border — but that’s exactly what she’s deployed to keep undesirables away from her.'"},{"comment_id":"10154323044371545","commenter_b":"I don't need to march with a bunch of femanazis' I'm fully aware of my rights as a woman and my freedoms as a US citizen - no one has tried to take any of those away from me except the last administration so I'm good MAGA","commenter_a":"I wonder how many women signed up to go to these marches thinking that they were supposed to be empowering women when it turned out just to be an anti Trump rally- so I would say that at least half of the women may be there for totally different reasons - which means the people who organized these marches were completely disingenuous","post_message":"Any DFW women make the trip to Washington for the #WomensMarch? If you did, Hannah Davis wants to hear from you. Share your pictures here."},{"comment_id":"10153279901571955","commenter_b":"Good! You made that bed now sleep in it scumbags!","commenter_a":"Excellent! Expose the darkness, Lord of Light.","post_message":"Hacked Adult FriendFinder database reveals extramarital affairs of millions"},{"comment_id":"10154460256056509","commenter_b":"Let's not forget she's a sleazy hooker who is doing the work of an immigrant that no American would do.","commenter_a":"Oh so what! trump made fun of Bush having his 90 yr okd Mom campaigning. At least you can understand her, unlike Trumps trophy wife who needs speech lessons. Do we really need a flotus who barely speaks u derstandable englush!","post_message":"See if you can tell why Ted Cruz's campaign pulled this ad."},{"comment_id":"941945919231796","commenter_b":"Lol. They immigrated too #landbridge","commenter_a":"Should learn wut? Now listen here sis... You are just brainles jerky What the hell is American? You mean English????","post_message":"She fits right in with Donald Trump."}]
