[{"comment_id":"10153293386166051","commenter_b":"And he should step down.....","commenter_a":"I'm with him!","post_message":"Do you agree or disagree with this judge's position on marriage?"},{"comment_id":"10153829312141162","commenter_b":"Yes. Don't trust females","commenter_a":"I hope he learned a valuable lesson from this experience.","post_message":"BREAKING: Patrick Kane will likely NOT face charges for an alleged rape this past summer, according to the Buffalo News: @webpagelink"},{"comment_id":"1027028344015468","commenter_b":"Then slapped it in the face with my dick","commenter_a":"But if it was an Airman that got jumped the Marines would be applauded.","post_message":"We're on the look out for two scum bags who jumped a Phantom Fury vet in a case of mistaken stolen valor. If you have any information, please message the page, and we'll take care of the rest. Any factual information provided, leading to an arrest, will earn you a free Funker530 \"Winning Hand\" T-Shirt. ~Josh"},{"comment_id":"1047811211942074","commenter_b":"I love her and some woman here are simple misogynists!..bitter woman! GO HILLARY!","commenter_a":"Look Hillary, no one likes Lena Dunham.","post_message":"Follow along as Lena Dunham takes over Hillary’s Instagram account today from the trail in New Hampshire: instagram.com/HillaryClinton"},{"comment_id":"10153794621104726","commenter_b":"Thats the REAL ISSUE here..PRAYER and FAITH ..these guys are so far remoived from G-d its pathetic..This all has to do with the men in POWER.....has been since the beginning....even satan wanted to be above our creator..these followers of satan are no different","commenter_a":"Still another reason I'm a pub!","post_message":"Democrats come out against God"},{"comment_id":"980977625292266","commenter_b":"Send them all back to where they came from. We don't need the ANY illegals","commenter_a":"once again in the world of idiots we see how stupid people can get. illegal in country, on welfare, sucking tax payers money and they say they have rights? the only right they have is to get the hell out","post_message":"A group of illegal aliens filed a federal law suit in Georgia for what they claim to be a violation of their constitutional rights by denying them driver's licenses."},{"comment_id":"1087153308047587","commenter_b":"I'll vote for a female for our President, but Hillary is not one that I want to vote for for President. I also think that if your spouse, or former spouse was already President, then you should not be allowed to run/be President; I also think that it should at least skip one generation for sons/daughters.","commenter_a":"Voted for President Obama because he is Black. Voting for Hilary because she's a woman. Why did anyone vote for the last 40 white male Presidents?","post_message":"\"Nothing gets me angrier than when someone implies that I'm voting for Hillary Clinton because she's a woman.\"  - Lena Dunham"}]
