[{"comment_id":"953797061420139","commenter_b":"@username hahaha","commenter_a":"And this witness is just as big a piece of shit, like the article ends with. Haha you cats are seriously not right. Good luck in the big scary liberal future. It's called progress get on board or get left behind.","post_message":"HERE WE GO.............."},{"comment_id":"10154319378806337","commenter_b":"Mfs are crazy someone please give this puppy mf a show so i can laugh everyday as he humps his wifes leg and smell her butt. Wait i do all those things. This guy is normal","commenter_a":"Oh what the fuck happened to this world..lol","post_message":"UHHHH..."},{"comment_id":"953722131412277","commenter_b":"Bye bye little bitch","commenter_a":"All of this MORMON bailting tactics.......declaring him the prophecy.....ARE YOU ALL KIDDING ME....YOU REALLY BELIEVE THIS GARBAGE?? LOOK INTO HIS EVIL EYES and you will see what he plans for us!!!","post_message":"A new poll shows Sen. Ted Cruz (R-TX) with a sizable lead in Utah's upcoming caucus vote..."},{"comment_id":"705783696236172","commenter_b":"No ovaries. Only clitoris.","commenter_a":"The clit and ovaries.","post_message":"Most of you are, or will be, very familiar with it. But it looks very different than you might imagine."},{"comment_id":"10153523440189071","commenter_b":"You should always bet with Olly when he's had a few, he always loses.","commenter_a":"Olly Cairns @username","post_message":"It has a ton of benefits."},{"comment_id":"456287754495819","commenter_b":"She wil not get my vote, Trumps mine.","commenter_a":"I do not agree with old horse face at all.","post_message":"Carly Fiorina has vowed not to send 'boots on the ground' into the Middle East. Do you agree with this strategy?"},{"comment_id":"1306220052736740","commenter_b":"Trump has everything a person could want so he just wants to pay American back!! Hilary tried to steal furniture from the white house the first time around","commenter_a":"Hillary should be in prison! Treason and lying are her crimes. Benghazi will never be forgotten as she turned a deaf ear to our own and did absolutely nothing! Trump in 2016! 🇺🇸🇺🇸🇺🇸","post_message":"As of now, Donald Trump and Hillary Clinton appear headed for a showdown in November. Who gets your vote in this matchup: Trump or Clinton?  LIKE Opposing Views for more breaking news and analysis!"}]
