[{"comment_id":"1789863337898793","commenter_b":"NO !","commenter_a":"Like a dog misses fleas!","post_message":"Will you miss having President Obama in office when his term ends?"},{"comment_id":"888955024560582","commenter_b":"Yeah!!!","commenter_a":"'@username @username lunch 2mrw?!","post_message":"When you realize tomorrow is Friday... (click to play)"},{"comment_id":"1090190811037255","commenter_b":"Dear Charlotte She gonna frack it up","commenter_a":"So proud of you @username! Can't wait to vote for you in Kentucky on May 17th! Hillary 2016!","post_message":"What kind of president would Leslie Knope be? Amy Poehler: 'Full speed ahead!'"},{"comment_id":"1681195205453281","commenter_b":"Barbara just needs to go away!","commenter_a":"Her opinion doesn't matter!","post_message":"Barbra Streisand blasted “narcissist” Donald Trump in a 1,228-word Huffington Post op-ed."},{"comment_id":"1783246305275728","commenter_b":"'@username Yes She did","commenter_a":"I am Dutch. Sylvana Simons said 'All White people are Racists'. Now everybody is angry at her. She never changed her opinion and never said sorry. She is a member of Denk, a Dutch Turkeys political party. The party has very extreme opinions and backs Erdogan without questions. They like sharia law, and child marriage.","post_message":"'People shouldn't turn it into something negative,' says one mum whose son dressed up as 'Black Pete' for a parade."},{"comment_id":"969075749885792","commenter_b":"That was you , a hoe and a drug user","commenter_a":"Your corruption comes to an end today Hillary! You have stiffed this nation, you have deceived the American people. NO MORE CLINTONS, America will not let you disgrace this nation any more!","post_message":"Todo por lo que hemos trabajado se decide hoy. Comparte esto si apoyas a Hillary: hillaryclinton.com/buscador"},{"comment_id":"10153279327706973","commenter_b":"Your saying this restaurant chain is hateful and kills animals when dozens of others do exactly the same thing? You do know that cows and fish are animals and killed in order to make the food you find at McDonald's, Burger King, Wendy's, Arby's, Subway, Taco Bell, Panda Express, Red Robin, Dennys, IHOP, etc. right?","commenter_a":"Don't do it! They're a little too conservative for our area. Do people really want to support a company that not-so-secretly opposes equal rights (not to mention the whole killing of animals thing...)? @webpagelink","post_message":"The fast-food chain is looking to to add one or two restaurants a year until there are 10 to 12 locations in the greater Portland area."}]
