[{"comment_id":"10153751890519411","commenter_b":"Fuck Israel baby killers.","commenter_a":"The alleged tens of thousands of “rockets” from Gaza killed how many Israelis so far? How many? Palestine has a legal right of self-defense whether Israel likes it or not. Saying that Israel is a victim is like saying that Hitler acted in self defense. Israel has no more right to Palestine than the Nazis had over Austria, Hungary, Poland, etc... In 2000, 57 Arab and Islamic countries offered full diplomatic recognition of Israel if they returned to 1967 borders. Israel never acknowledged this offer. Israel kills in the name of self defense. US kills in the name of democracy. When they fight back they are called terrorists. When it is said to them: \"Make not mischief on the earth,\" they say: \"We are only peacemakers.\" [Quran 2:11] Isn't this the case today... in the name of Freedom and Democracy! Law of current world Muslims = Guilty (until proven innocent) ...","post_message":"She died of multiple wounds in a hospital after bleeding in the street for 30 minutes."},{"comment_id":"10153206999136336","commenter_b":"I love it. She should have her wooden spoon with her","commenter_a":"She is going to be arrested. She beat him that is abuse. Some Social worker will have her arrested.","post_message":"\"So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.\" – Ruben Navarrette"},{"comment_id":"1687768148176964","commenter_b":"Just love that woman","commenter_a":"Love it","post_message":"YES This is why we LOVE you, Reba McEntire!"},{"comment_id":"1084846008220301","commenter_b":"It's past time for the GOP to get behind Trump as front runner and he is not a racist the black and Mexicans are voting for him because they know the ILLEGALS are taking their jobs and we need that wall for our security and jobs for real Americans nobody wants to live off of welfare and with this core education makes it hard to get a job VOTE TRUMP 2016","commenter_a":"OK Donald and ted, you need to go to your corners and take a breath. When you have settled down you can no longer sit at the adult table. This is why we cannot have nice things, you two acting like very spoiled children. Enough of this infantile acting, are you trying to give this nomination to kasick?","post_message":"Things are about to get REALLY messy..."},{"comment_id":"10153903407251336","commenter_b":"Her teeth are still loose she can't knaw on a steak... Cheap date. (y)","commenter_a":"She could have easily ducked her commitment, all things considered, but didn't. I gained more respect for Ronda over this classy gesture in the face of her recent defeat and widespread public mockery, than any of her knockout wins. Much love to her and our Armed Forces.","post_message":"UFC superstar Ronda Rousey kept her promise and accompanied U.S. Marine Lance Cpl. Jarrod Haschert to his Marine Corps Ball in South Carolina on Friday."},{"comment_id":"1364548750229953","commenter_b":"Anything above .22 caliber is illegal expect where permitted by law, and by law I mean hunting clubs that bend the rules. Open carrying is restricted to law officials only. But yeah that sure stopped the cartels from getting their hands on em","commenter_a":"What about bad/psychotic people with gun permits and guns purchased legally? The system is a joke... How can you really determine good/bad ppl...","post_message":"The Dallas police chief says he is concerned about open carry laws. \"We don't know who the good guy is versus who the bad guy is if everybody starts shooting,\" he said."},{"comment_id":"10153570566941509","commenter_b":"Yes....and take alcohol off the market...","commenter_a":"medical pot SHOULD be legal for those who need it!","post_message":"Do you agree or disagree? Dr. Sanjay Gupta explains why it's time for a medical marijuna revolution on CNN Opinion: @webpagelink"}]
