[{"comment_id":"10153440624016680","commenter_b":"@username KILLERY LOVER<< YOUR SICK GO LIVE IN CANADA YOU LIBERAL IDIOT>>","commenter_a":"Donald Trump all the Way to the White House,,Heck with all the Haters and the Crooked Sander Backers,, and the ones that Love Hilary yea way to Support her a Criminal That Killed 4 American Servicemen,, she should be in prison,!!!!!!!!!!!!!!","post_message":"Donald J. Trump: Michelle Fields grabbed me."},{"comment_id":"1267659423273512","commenter_b":"JUST SHOOT THIS BITCH==PLEASE.","commenter_a":"SOMETHING TO THINK ABOUT -- do you know that Hillary will be bringing into the USA thousand of Refugees and Illegals just within the first year. ISIS has told the US that they will be sending in ISIS men and Rascal Islamic's in with them. Do you want to keep your family safe from the Radical Islamic's and the Illegals along with the threat of Sharia Law . Also the threats that the BLM has made to all Americans and Hillary is behind them also. Then you need to put your family first and vote for TRUMP . Because if you vote for Hillary you might just as well kiss your ass and the USA goodbye. We need to take our Country back Hillary has already proven that she is trying to destroy us. Don't forget our men in Benghazi and all the Email scandal and the Clinton Foundation . ...","post_message":"It's even WORSE than you thought!! @webpagelink"},{"comment_id":"1323559051002906","commenter_b":"YOU CAN'T TAKE OUR RELIGION AWAY FROM US.","commenter_a":"Keep it. Just don't use it when class is in session.","post_message":"Teacher Demands Christian Boy Surrender His Bible, He Says No, See What Happens Next Good for him. Let's show this young Christian our support. Can we get 30,000 'LIKES' for his refusal to surrender his bible?"},{"comment_id":"10153982625649087","commenter_b":"Nobody cares that she wants to redistribute their money to the millions and millions of illegal alien Freeloaders and refuess","commenter_a":"Trump needs to start hammering Hillary Clinton just like Bernie Sanders did","post_message":"Donald J. Trump lashed out at former CIA Director Michael Morell after he announced his support for Hillary Clinton and said Russian President Vladimir Putin \"played\" the Republican nominee."},{"comment_id":"10153752724022016","commenter_b":"In her ear? Why the hell would she listen after she is elected, considering she's not even listening now, when she needs our vote? I doubt she'll hear a damn thing, once she swears that oath. The revolution isn't dead, but its not gonna happen through or in the DNC.","commenter_a":"SOCIALLY THERE IS NO OTHER CHOICE, ITS HILLARY WITH SANDERS AND WARREN IN HER EAR! THE REVOLUTION IS NOT DEAD! -?","post_message":"\"Emphasizing the negatives of Donald Trump, while certainly easy to do, will not be enough to get millennials to support Hillary Clinton. The Clinton campaign needs to unapologetically embrace issues that will inspire this critical millennial voting bloc to come her support.\"  Otherwise...."},{"comment_id":"10154982308074641","commenter_b":"The Russians did it!!!! #CNN the Russians did it","commenter_a":"Is global warming to blame?","post_message":"Avalanches have killed more than 100 people after days of heavy snowfall along the Afghan-Pakistani border @webpagelink"},{"comment_id":"628263567364222","commenter_b":"I'll stick with Palin on this issue!","commenter_a":"Sarah Palin is just an nut","post_message":"Americans are now claiming that Sarah Palin is racist.  This is absurd. Sarah is under attack, let's get her back.  Do you support Sarah Palin?"}]
