[{"comment_id":"550590221774115","commenter_b":"Republican presidential candidate @username has admitted to lying about his application and acceptance to the U.S. Military Academy at West Point, Politico reported on Friday. The retired neurosurgeon and current GOP frontrunner has been using the story as a central point of his personal life during his campaign.","commenter_a":"But its just been confirmed that you lied about West Point. You're done in my book. Before that, I supported you.","post_message":""},{"comment_id":"732788963494483","commenter_b":"The Demon worshipping Islamic Terrorists murdering Jews even Jewish children needs to be put to death and send them to hell to meet their beloved false -prophet Mohammed .","commenter_a":"Where is the proof that Jews were responsible for this ? We all know only to well how Muslims murder their own children and use them is human shields and train them as shahids .And why is this self -hating Jews calling Jews terrorists and not calling Muslims Terrorists ? Jews are not Terrorists !!!!!!!!!!!!","post_message":"Jewish Home’s Ayelet Shaked calls the fatal firebombing ‘terrorism in every respect,’ and says that Jewish terror does more damage to Israel than Palestinian terror."},{"comment_id":"579271598927799","commenter_b":"As a sentence. Send her dumb ass over there and pull her passport, then pull her citizenship and tell don't come back. PS. Take the view with you","commenter_a":"Do Barry proud, he'll probably pardon her.","post_message":"Mississippi woman who attempted to join ISIS pleads GET INSTANT JUSTICE from No-PC Judge"},{"comment_id":"10156794589450231","commenter_b":"She looking like a dog tie her azz up","commenter_a":"Need her tubes snatched from her body...","post_message":"Pregnant mom arrested after 2 toddlers found tied up like dogs behind home."},{"comment_id":"10153447810474575","commenter_b":"Krista, i sure hope your child don't get molested, seems all you Duggar nut huggers have kids.","commenter_a":"Drive into traffic, Palin. Nitwit.","post_message":"Sarah Palin is lashing out against ‘radical liberals in media’ and their portrayal of the family behind the popular TV show “19 Kids in Counting,” after reports of Josh Duggar's sexual misconduct surfaced.  Palin said there was a double standard, stating actress Lena Dunham did not receive the same backlash after she revealed in her book that, as a child, she used ‘anything a sexual predator might do’ to bribe her young sister for kisses and more.   Palin began her rant on Facebook in all caps, writing \"HEY LENA, WHY NOT LAUGH OFF EVERYONE'S SEXUAL \"EXPERIMENTS\" AS YOU HAUGHTILY ENJOY REWARDS FOR YOUR OWN PERVERSION? YOU PEDOPHILE, YOU.”"},{"comment_id":"10154077831881509","commenter_b":"Tell them to eat pork!","commenter_a":"I don't think I have read more ignorant comments than those supporting Ben Carson. Yes, Carson is entitled to his opinion but it shows the complete lack of understanding of the way our nation operates. A man who believes he can pick and choose which laws to obey is not qualified to run as President. Where are all the Christians who were crying about religious liberty? This man wants to take away the religious liberty of a very large portion of those practicing a different religion. A very sad day for America and those haters bashing the Muslim faith.","post_message":"A call for Dr. Ben Carson to drop out: @webpagelink"},{"comment_id":"10155175983529749","commenter_b":"Not fair to use term feminist for these people...might be better to go on \"feminazzi\" :) . It's kinda offensive for the real feminism movement which is still something some part of the world really need no? :)","commenter_a":"Why are they always fat? I have never received a satisfactory explanation.","post_message":"Presenters and staff frantically scrambled to cover the woman's breasts."}]
