[{"comment_id":"10152816476327093","commenter_b":"Learn to speak english, illegals","commenter_a":"The only crime committed by police was that they did not deport him previously when he committed prior offenses","post_message":"Even though a grand jury didn’t charge a Grapevine officer for a deadly police shooting, the family of the man killed says the case is not over…  WATCH: @webpagelink  READ: @webpagelink"},{"comment_id":"823419914360098","commenter_b":"Never,never forget the countless acts of murder she committed by her acts against her brothers and sisters!","commenter_a":"I work hard at forgiving. I just can't forget. God told us in order for us to receive forgiveness, we must forgive. That is a tall order in this circumstance. I am trying. It is up to God to cleanse her of this deed. I had to turn it over to him. I still will not watch any movie or show she is on or in.","post_message":"Jane Fonda has changed her tune. She apologized for her Vietnam photos.   What do you think? Better late than never, or too little too late? Should she be forgiven?"},{"comment_id":"274535909638816","commenter_b":"You are a sick women!","commenter_a":"What's even scarier is Californians that elect her again and again. I was having a discussion with a gent on fb he stated he moved out of the northeast because we were stupid. He stated he moved to the 2nd most intelligent county in the country.I took a wild guess and asked if the state would be California? Bingo! See how these people think. Scary","post_message":"HOLY SMOKES! NANCY PELOSI: Orders People to Clap, Repeats Words Then Calls John Kasich The Gov. of Illinois [Video]  This is embarrassing! She scolds the audience!"},{"comment_id":"1228827110542853","commenter_b":"Liberals dont like putin cause they love isis","commenter_a":"So this is liberalism?","post_message":"She says Trump needs to step down before the inauguration, and the audience agrees!  Shared by Occupy Democrats, LIKE our page for more! Video from The View."},{"comment_id":"952645251457544","commenter_b":"I would kick they asses!!!","commenter_a":"Somebody goin down tuh-dey d'ere boy! This is a sign that everybody is not equipped to run a daycare. Idiots!!!","post_message":"Cornelius Jones went to pick up his one-year-old daughter, Journee, from daycare... only to find the facility closed. After hearing his daughter’s cries, he flagged down police who found the young one crying & crawling in the dark.   Employees said they thought Journee was a doll. DETAILS ----> @webpagelink"},{"comment_id":"10153372997486051","commenter_b":"It's a shame that she's no longer here and those 3 scum-bags are. Too bad she couldn't have shot all 3!!!!!!!!","commenter_a":"The fearless leaders kids.","post_message":"This 76-year-old woman was confronted by 3 attackers. Rather than giving in to their demands, she reached over, grabbed a gun and decided to take all of them on."},{"comment_id":"10152833385031749","commenter_b":".","commenter_a":"You are right Brent!","post_message":"'America’s resurgence is real. And now that we’ve got some calmer waters, if we all do our part, if we all pitch in, we can make sure that tide starts lifting all boats again. We can make sure that the middle class is the engine that powers America’s prosperity for decades to come.' —President Obama  Watch the weekly address: @webpagelink"}]
