[{"comment_id":"1340551885984265","commenter_b":"Your a believer if you believe what you said, people been saying that crap every election. I know you don't like either nobody does but someone is going to win Who would you rather","commenter_a":"@username I know you won't but watch this....","post_message":"TOTALLY VIRAL --- HOW TRUMP WINS (VIDEO) @webpagelink"},{"comment_id":"10157699168860294","commenter_b":"If you think he can do that with all the times she's been investigated over the last several years you're sadly mistaken.","commenter_a":"Trump is not for social society so I can't be for him","post_message":"“If I win, I am going to instruct my attorney general to get a special prosecutor to look into your situation because there has never been so many lies, so much deception.”"},{"comment_id":"1097574603596883","commenter_b":"Lol those mother fucks love my ankles","commenter_a":"Ruben Yunv Castillo","post_message":"Why do they torment me and leave everyone else alone?!"},{"comment_id":"10153312839004203","commenter_b":"No way she's a stupid bitch","commenter_a":"You'd rather have Rand Paul , Jeb Bush or Ted Effing Cruz? Really? GO HILL!","post_message":"This is it."},{"comment_id":"900278129995043","commenter_b":"No","commenter_a":"They're great to look at and their love is cute and all but not sure if their personalities would work for a talk show. Maybe a dating game show would work better.","post_message":"Would You Watch? Boris Kodjoe And Nicole Ari Parker Get Their Own Talk Show On Fox"},{"comment_id":"10154333235104726","commenter_b":"So all the gun owners need to boycott Hawaii. See how they do when there money source dries up.","commenter_a":"It's begining","post_message":"Hawaii became the first U.S. state to sign into law a bill requiring all residents who register as gun owners to be placed in a federal criminal records database that monitors them for any crimes committed."},{"comment_id":"10153123967295329","commenter_b":" ! Paco nooo","commenter_a":"Caffe Con Lechee","post_message":"We all have that That One Co-worker who can't control themselves around cake."}]
