[{"comment_id":"1533566413336617","commenter_b":"YES !","commenter_a":"Yes","post_message":"Michelle Bachmann says Trump's win is positive of what the Lord did. Do you think God had a hand in Trump winning?"},{"comment_id":"10153855927834330","commenter_b":"Wow","commenter_a":"You kids are borderline retarded","post_message":"\"Dewshine\" is a mix of racing fuel and Mountain Dew. Two teens are now dead after consuming the highly toxic mixture ---> @webpagelink"},{"comment_id":"623307227823727","commenter_b":"She should never be President,God help us if she does","commenter_a":"This whole thing just makes me ill!","post_message":"Crooked Hillary Clinton Lies vs. the FBI: A Tale of Two Press Conferences."},{"comment_id":"1787645241556279","commenter_b":"They look beautiful, professional and feminine. Certainly classy women.","commenter_a":"These are first class ladies No attitude","post_message":"There's great symbolism in Melania Trump and Ivanka Trump's inauguration style."},{"comment_id":"10153949819826770","commenter_b":"Trump is not against Muslims. He wants Muslims coming into the country right now to be stopped and vetted completely with what is going around in the world. He wants all the law breakers in the country that are illegally gone. And its not just them it means everyone for now till we can get a handle on jihadists trying to come in to the country. What is wrong with that!??","commenter_a":"A woman protesting in New York City just said she was protesting because Trump doesn't represent her beliefs! Well that's why we had an election yesterday and America spoke clear and loud that they were fed up with the way our country was going. The American people are tired of the murder of our unborn children. We voted!! The American people are tired of people who don't work being rewarded while people who do work are being punished. We voted!! The American people are tired of activists judges making new laws without the approval of we the people. We voted!! The American people are tired of foreigners being treated like first class citizens while our veterans needs are put on the back burner. We voted!! The American people are tired of our enemies disrespecting us. We voted!! The American people are tired of our policemen and other law enforcement people ...","post_message":"Asra Nomani is sick of the \"liberal honor brigade\" turning a blind eye to radical Islamic terrorism..."},{"comment_id":"1119860174747403","commenter_b":"I don't need friend like that... Whend they go to my home they got everything and more.. and whend I go to they shiet hold I have to wayting.. I don f think so... don't invite me no more.. I got my own park in my house.. .. is my house and I live here. Jajajajaja... fucking IDIOTS...","commenter_a":"Lydia Taylor lol so you 😂😂😂","post_message":"The struggle"},{"comment_id":"1191081784242503","commenter_b":"Can't we just put her in jail already?","commenter_a":"Ostensibly, this woman is a public servant whose salary is taxpayer funded. Her bigotry is flagrant and she has chosen to behave in a lawless manner and not serve the public. She is not adhering to her job description and thus is to be held accountable, as are those in the County and Republican Legislature who are condoning this assault on civil rights. Therefore, she, County administrators, and the Legislature need to be served with a large lawsuit.","post_message":""}]
