[{"comment_id":"928783390554410","commenter_b":"This is who he is at his core. This is what he will be. He has done us the great service of showing his true face, not the shiny, practiced veneer of the professional politician. Whether he learns to act presidential or not, this is the man you will be getting if you vote for him, a man who wants to pull out a measuring tape to settle disputes over issues. The fact of the matter is that there are no good choices this time. There aren't even any ok choices. But this man is a bully with all the character flaws that go with that, and he will do almost as much damage to this country as Clinton or Sanders. I am seriously dismayed by the continued popularity of this man, but I am equally dismayed by my other choices. And I am dismayed with a general electorate who ...","commenter_a":"It's past time for him to be acting more presidential. He also needs to do some research in preparation for the debates. Chris Wallace made him look like a fool when he put up those slides on his economic plan. He's making it harder and harder to not only defend him to skeptics, but to also remain an enthusiastic supporter instead of being a reluctant one.","post_message":"Despite what polls had shown days before Super Saturday, DONALD TRUMP lost two of the four states on Saturday to Sen. Ted Cruz, and the states he did win were at a lesser margin than predicted.  Some supporters and pundits are placing the blame on Trump's performance during the Thursday night debate, stating his 'less than presidential' behavior is catching up to him.  In the past, DT has stated he will act more presidential when the time is right, so we ask you to take our poll knowing DML will read the results later tonight on UNFILTERED.  POLL: Does Trump need to act more presidential in order to win?  @webpagelink"},{"comment_id":"1510900072276579","commenter_b":"They hate immigrants but call themselves Europeans?! Ok then go back to Europe ya fuckin assholes.","commenter_a":"'We as Europeans' Sorry if you live in America and have done for generations your not Europeans, there are many non-white people who are more European than you Anyone who holds any level of feeling that they are culturally attached to every other white person on the planet in some way is just weird","post_message":"'Hitler did nothing wrong! I feel like there are two sides.' - Tila Tequila"},{"comment_id":"10154633221506162","commenter_b":"Chelsea so this was my bike ride","commenter_a":"Lexi","post_message":"Cool clouds rolling over the Chicago area!"},{"comment_id":"1300466673353815","commenter_b":"If they all count, then re count where Hillary won by small margins...","commenter_a":"Jill stein sucks proletarian donkey dick","post_message":"We're at Trump Tower in NYC standing up for voting justice."},{"comment_id":"1184087691636663","commenter_b":"Donald Trump doesn't smoke, drink or do drugs. One of biggest problems in USA. Golden Crescent (@webpagelink) Build that Wall....Fence Act of 2006...Ask yourself the ???? Make America Great Again! Corruption!!!! Stop Trump!!!!","commenter_a":"Well Done Donald.","post_message":"Thank you Republican National Committee."},{"comment_id":"10154254253351336","commenter_b":"She's Nasty !","commenter_a":"White guilt is a real thing. Sad but true.","post_message":"“I’m a white lady. I’m an easy target,” Melissa Click said in an article."},{"comment_id":"10153571769331545","commenter_b":"She prolly can throw baseball better than you","commenter_a":"'@username hope I look half as good as her if I make it to 105!!!","post_message":"She's 105 and about to make you smile!  Her story: @webpagelink"}]
