[{"comment_id":"10154299169246051","commenter_b":"@username u would suck D. Chump dick if u had a chance. What a brain dead sheep u are.","commenter_a":"He's being practical. People were thinking it would be like the Great Wall of China, not realistic. He's still going to protect the country and secure the borders.","post_message":"Donald Trump just announced his giant wall isn't happening after all - and the reason has people outraged."},{"comment_id":"10153166262121336","commenter_b":"she can't stop lying","commenter_a":"If her lips are moving she is lying","post_message":"“All my grandparents, you know, came over here...\" – Hillary Clinton said on the campaign trail But Census records show that only one of Clinton’s grandparents was born outside of the U.S."},{"comment_id":"10156282182225354","commenter_b":"Why are they even getting licenses??","commenter_a":"Lord, don't even let me go there, cause my head will explode............","post_message":"Illegal immigrant activists complain that Colorado's illegals aren't getting their driver's licenses issued quick enough. Seriously..."},{"comment_id":"605420972951190","commenter_b":"The god \"them\" illegals.","commenter_a":"No guys. its not the trillions of dollars we spent on Nukes, its the god them illegals taking our tax money. #MakeAmericaGreatAgain","post_message":"The B61-12 gravity bomb is smaller and more accurate than the nuclear weapons we have now, and that has some experts very worried. Watch VICE on HBO tonight at 11PM to learn more about the next nuclear arms race."},{"comment_id":"10153029899116336","commenter_b":"She's a idiot.","commenter_a":"What a joke! Anything to grasp at more sympathy","post_message":"'American Sniper' Chris Kyle’s wife, Taya, asked family friend and U.S. Navy SEAL Pete Scobell to record the song \"Hearts I Leave Behind\" to honor her late husband. Watch Scobell's performance from earlier today on Fox & Friends."},{"comment_id":"914542602012252","commenter_b":"Communist asses back to Europe? That's a pretty racist thing to say isn't it. That's like me telling you to take your racist american hating ass back to africa","commenter_a":"The black community should be ashamed of backing this criminal","post_message":"People are going to EXPLODE on Fox."},{"comment_id":"955398181243627","commenter_b":"And we will ship them out idiots","commenter_a":"BIGGEST WANKER MUSLIM OF ALL TIME","post_message":"This is only the beginning..."}]
