[{"comment_id":"10153612780139614","commenter_b":"Breaking the law is a crime, and that includes illegally immigration. I get it. However, in this country technically only the natives whom they/we (Americans) have taken all their lands away. Any comments ??","commenter_a":"what hell wrong with Gov Mexico, I have been there and not doing dam thing to help county shame Gov.to much Durg going and lost lost people the USA should be Buy it. There lost of them doing wrong in USA. only God fix it not Mexico .","post_message":"Donald J. Trump has again upset immigration activists after he released details Sunday on his plans to deport all \"criminal aliens\" and force Mexico to pay for a wall on its border with the U.S. The GOP frontrunner's immigration plan includes overturning a law that grants citizenship to people born in the U.S. and put stricter limits on legal immigration. His plan is based on three core principles: that the U.S. must build a wall across the U.S.-Mexico border, that immigration laws must be fully enforced and that immigration plan must improve jobs, wages and security for all Americans. Read KTLA's story here: @webpagelink"},{"comment_id":"10154739927446037","commenter_b":"Sorry, women ARE voting...lol","commenter_a":"Most pictures are worth a measly thousand words. This one's worth millions. I would never advocate voting for a woman just because she's a woman, but this suggests that might not be a bad idea.","post_message":""},{"comment_id":"10152610651920667","commenter_b":"This girl is beautiful. Mrs. Rancic is just trying to make herself relevant by saying idiotic ridiculous comments. Amazing what people will do to try and get noticed.","commenter_a":"E! Should cancel the show, before they cause more trouble for them selves","post_message":"In dishing about all the red carpet looks on E!'s Fashion Police, Giuliana Rancic cracked that Zendaya probably \"smells like patchouli oil ... or weed.\" And an angry Zendaya took to Twitter to say there is a \"fine line between what is funny and what is disrespectful.\""},{"comment_id":"1585875914805484","commenter_b":"Yer yer yer no one beleavs it","commenter_a":"Melissa Saucedo","post_message":"She claims Donald J. Trump 'groped her butt' because she 'looked like a younger Melania'"},{"comment_id":"10152813780680950","commenter_b":"Kill the devil baby it comes from a rapist. The seed of evil grows within her.","commenter_a":"EVERYONE SHOULD REMEMBER U WERE ALL A FETUS AT ONE POINT TOO, MAYBE SOMEONE DEBATED ABORTIONING U WHEN THEY WERE PREGNANT, BUY UR HERE!!! I BET ALL U PEOPLE ARE AGAINST THE DEATH PENALTY TOO.....DAMN HYPOCRITS DONT WANT TO KILL AN ADULT BUT U WANT TO KILL A BABY!?!?!?!?","post_message":"In Paraguay, abortions are banned in all cases — even rape — except when the mother's life is in danger."},{"comment_id":"967357503323727","commenter_b":"This sexist pig is just pissed because two women probably did better than he did. Tell this little ass to pick up his toys and go the hell home! Quit whining !","commenter_a":"If the truth be known, men are the weaker sex. Most of the genetic information is on the X chromosome and women have 2 Xs, men only one X. The Y chromosome has little genetic information, besides the male sex gene. Consequently, women are genetically stronger in many way ways and live longer. In many European countries women do a lot of the heavy work in the fields. In the US women are treated as somehow inferior, and men want to believe that they are \"weaker,\" but it is not necessarily so.","post_message":"This Republican misogynist is fuming that these two women passed the same Army Ranger course he did."},{"comment_id":"10157682940820389","commenter_b":"Such bullcrap that she can get away with this!!!","commenter_a":"OF COURSE THEY DID....TWO OF AMERICA'S BIGGEST MISTAKES... WAKE UP AMERICA...VOTE DONALD TRUMP .....","post_message":""}]
