[{"comment_id":"10152686509170950","commenter_b":"Inbreds","commenter_a":"James Carville writes, \"There was nothing in the law that prohibited Secretary Clinton from using her personal email to conduct business as long as those emails were preserved, which they were. She preserved them and turned over all of them that had to do with State Department business -- 55,000 pages of them. But that's not enough for the right wing, who will continue to obsess over this issue until they find a new one. Let's watch the Clinton Rule in effect: Colin Powell and Jeb Bush also used their personal email, but they are held to a different standard in the press. Colin Powell admitted on ABC's This Week on Sunday that not only did he also use his personal email while secretary of state, but that he didn't preserve them or turn any of them over to the State Department as requested. Everyone went wild when they heard ...","post_message":"An archives expert tells \"Time\" that Hillary Rodham Clinton's methods for determining which emails to hand over to the government \"did not meet best practices.\""},{"comment_id":"10157204409490206","commenter_b":"This chick is so full of crap.","commenter_a":"He makes John Lennon seem like a man and Ryan Leaf viable.\\b","post_message":"The disgraced quarterback allegedly hit his ex-girlfriend on the side of her face, rupturing her eardrum, and she's reportedly still unable to hear out of that ear."},{"comment_id":"1123460471025521","commenter_b":"The mother is as full of crap as the child.","commenter_a":"Instead of asking the whole world to conform to ones abnormality or difference how about assisting that person to deal with their abnormality/difference in such a way as to not draw negative attention. If one is a diabetic the whole world does not need to eat a diabetic diet. If one has a limb removed does the whole world remove a limb? Honestly I see no difference. We all have differences and we learn to deal with them, not expect others to suffer or deal with it.","post_message":"Watch this amazing video as the mother of a \"trans\" teen makes the most outrageous claim possible about North Carolina's new HB2 law.   What do you think about this mother's claim?"},{"comment_id":"10153232403476323","commenter_b":"Because, you can fuck over your country. As long as your fucking bitches, smokin cigars, and drinking whiskey, like a man God damnnit","commenter_a":"Why is everything about being gay","post_message":"Gay-rights activist and award-winning author Larry Kramer is 79 and in failing health, but that won’t defuse the impact of his latest bombshell project: the first 800-page instalment of a two-part history of America that tells of the hidden sexualities of figures from Alexander Hamilton, George Washington and Abraham Lincoln to Mark Twain, Herman Melville and Richard Nixon."},{"comment_id":"1657934121091027","commenter_b":"What did they expect???? Idiot Merkel....","commenter_a":"A bunch of neanderthals","post_message":"The reports of assaults have added fuel to Germany's migration debate."},{"comment_id":"10153716144117577","commenter_b":"Your talking bullshit.","commenter_a":"I am an athiest so it's all bullshit to me anyway ... but you god nuts hate the pope because he is too close to what (if he did exist) christ would have been like .. do you not remember the part in the bible where jesus said \"there is more chance of a camel passing through the eye of a needle than a rich man getting into heavn\"? .. what about his whole ghandi/ john lennon peaceful hippiness .. \"let he who is without sin cast the first stone? .. and what about how jesus spent a lot of time hanging out with the poor, sick and prostitutes .. and he fed them and helped them .., some of you extreme conservative \"christian\" extremist terrorist CUNTS should actually read your bibles once in a while ... O and by the way ... if you are a good \"christian\" why ...","post_message":"Pope Francis has strong ties to socialism and even communism and is helping to destroy the faith of the Catholic Church from within, as Infowars journalist Kit Daniels explains."},{"comment_id":"10154126859997293","commenter_b":"They why are these alligators thriving in florida. They love the heat","commenter_a":"Why is this news? It's 90 degrees outside in a dense crowd and someone is hot. Big deal. Trump is a cold-blooded snake so I'm sure he could stand out there forever.","post_message":"Hillary Clinton was diagnosed with pneumonia before falling ill at the 9/11 memorial service."}]
