[{"comment_id":"10153917800769087","commenter_b":"Suck Ass Fox (lol)","commenter_a":"the people who think trump is a joke need to get smart....in a hurry. the only vote that will count in november is the one cast to defeat, no, destroy trump. i don't think jill stein will do that. hillary will. hold your noses people and do the right thing. for the wrong reasons perhaps, but do it. after the dust settles and trump, god forbid, wins, it will be too late to hear you whining.","post_message":"Dozens of the most prominent people in Silicon Valley signed an open letter on Thursday warning that Donald J. Trump \"would be a disaster for innovation.\""},{"comment_id":"10154026090214087","commenter_b":"Obama give the worlds largest terror sponsor a nuke deal. What the hell is that shit about? I know whats going on. You are just stupid. Hillary's top aide huma is a fucking muslim terrorist. This bitch lived in the middle east and wrote for Islamic extremist magazine. She wrote all kinds of anti american articles. And you dumb dip shits run around blind as a damn bat. You people have some real issues. Liberals are whack.","commenter_a":"I think Obama being the first Black President/so awesome set the bar too high for the first female President. We know many stellar women before Hillary never got a shot in politics. Hopefully Hillary breaking the glass ceiling improves equality even tho shes not ideal.","post_message":"\"Hillary Clinton is still changing the way we thought about women as spouses and politicians.\""},{"comment_id":"10156120572270354","commenter_b":"She is a Dumb o crap","commenter_a":"The city of Baltimore has an idiot for a mayor. I wonder if he is a Democrat or a Republican?","post_message":"“This settlement...avoids costly and protracted litigation that would only make it more difficult for our city to heal and potentially cost taxpayers many millions more in damages,” said Baltimore Mayor Stephanie Rawlings-Blake."},{"comment_id":"10153465651246545","commenter_b":"She Have to have police officers to work security. That's a city ordinance. If police don't work the event, her show will get cancelled. I think It will blow over tho and she'll be ok...","commenter_a":"I will say one thing...Police or No Police. The show will go on and will be sold out. So she is winning either way. So for those that are calling her racist. Why would all nationalities join in on the hate monger party and pay for a ticket. IJS","post_message":"The president of the Dallas Police Association said Saturday his group is not calling for a boycott of working security for Beyoncé's May concert at AT&T Stadium. However, he also said he wouldn't be surprised if many Arlington officers chose not to work the event."},{"comment_id":"539030936307389","commenter_b":"@username you're not paying for my uterus. Lol.","commenter_a":"So, Kaine, a Roman Catholic, has a moral conflict with his faith when it comes to the death penalty (killing criminals) but no qualm whatsoever promoting the killing of unborn babies?","post_message":"Mike Pence is a good man who had a strong performance tonight. This evening Tim Kaine demonstrated that he would serve as just another enabler of the failed Obama-Clinton policies that have hurt our economy, taken away our freedom, and weakened our security. The choice for Americans is clear. We cannot afford a third term of President Obama, and Clinton-Kaine would only continue the disastrous policies of the last eight years."},{"comment_id":"644827892343831","commenter_b":"If you agree with Mike's comment you're a sexist ignorant shithead. Thanks Mike for demonstrating what sexist assholes think!","commenter_a":"Does anyone know what is considered rape? Rape is one of the most hanus crimes that can be commited. But can anyone really know if rape was commited. Many cases each year happen when 2 people have sex and then the girl just changes her mind and calls it rape. Now i dont know all the details in this case, but maybe this judge knew more than we did.","post_message":"Judge Aaron Persky infamously handed down a sentence of six months jail time to Brock Turner in June."},{"comment_id":"10153205504771336","commenter_b":"You need to get the Fffff out there's you are useless Lady or what ever you are. You are a disgrace.","commenter_a":"Recall this mayor!","post_message":"“I never said, nor would I ever say, that we are giving people space to destroy our city. So my words should not be twisted.” Mayor Stephanie Rawlings-Blake spoke to reporters moments ago amid growing violence and chaos tonight in #Baltimore."}]
