[{"comment_id":"10154416632443701","commenter_b":"He already said he's voting for her lol","commenter_a":"Ugh!! Until I hear it from his mouth I don't believe it. Why should we believe ANYTHING a biased news station and a corrupt politicians say? In fact, if you read the article, it specifically says Bernie has not announced he endorsed her. Coming together in issues is NOT the same. Mis-leading headline, once again!! Sanders has not yet said he will endorse Clinton but told reporters on Saturday that the two campaigns were coming together and to stay tuned.","post_message":"Former Democratic rival Bernie Sanders will join Hillary Clinton at a New Hampshire event on Tuesday where he plans to endorse her."},{"comment_id":"682882035184939","commenter_b":"Until the war against christians ends. All countries should carefully screen all imigrants. Period","commenter_a":"Yes absolutely!","post_message":"Our children's future is at stake! YOU DECIDE!"},{"comment_id":"493465740841719","commenter_b":"Good I will not go there!!","commenter_a":"I wont be there so shove your coffee and other product up your big rich white ass","post_message":"Should we boycott now?"},{"comment_id":"685505648280301","commenter_b":"'@username don't worry, she'll deny, lie and get out of it. Doesn't she always!","commenter_a":"They say truth is stranger than fiction but this is ridiculous. We now have a presidential candidate running for office under investigation by the FBI and she is allowed to continue her campaign?","post_message":"BREAKING NEWS: New emails that prompted the reopening of the Hillary Clinton investigation came from devices owned by Anthony Weiner and Huma Abedin, according to an FBI source. @webpagelink"},{"comment_id":"1302858003140584","commenter_b":"Hillary is a war monger. You think There would be peace if she was elected?","commenter_a":"He will destroy this country parents get ready to send your children to war","post_message":"Nailed it."},{"comment_id":"10153544235856880","commenter_b":"My money is on Donald getting it done.","commenter_a":"Trump 20 16. Yes they will I am business man and I know I would make them pay it. Cost 30 billion","post_message":"Sorry, Donald."},{"comment_id":"837639489700820","commenter_b":"I will destroy humans","commenter_a":"Eloise Nicholls Regan Howard Louise Hemmings Sydnie-Jo Goodison Megan Wilkins @username","post_message":"This robot wants a family...and to destroy humans."}]
