[{"comment_id":"914235348632517","commenter_b":"So sad","commenter_a":"He'll claim it was medicinal for his PTSD.","post_message":"Bowe Bergdahl, the U.S. soldier who was released in a prisoner exchange in Afghanistan for five Taliban detainees, wound up in the middle of a pot raid earlier this week @webpagelink"},{"comment_id":"10154984816883797","commenter_b":"I hope this women knows that dying is the easy way out that she is not going to get.","commenter_a":"I utterly despise anyone who would harm and even go so far as to kill a child, ESPECIALLY the parent of the children.","post_message":"BREAKING: A statewide Amber Alert in Indiana has been canceled after a 7-year-old girl and 6-year-old boy were found dead Monday."},{"comment_id":"10154306058514062","commenter_b":"Women, always wear pants/skirts that have pockets. if they steal your purse and your gun is in it, you're screwed.","commenter_a":"And that's why I always have the Grim Ripper with me!!!","post_message":"So scary..."},{"comment_id":"1203821629704699","commenter_b":"@username anybody can suck dick! It takes a real woman to recive the education that Michelle Obama obtained. Only because shes black? You mad cuz a black first lady has done what your mother couldn't do for this country! PLEASE! Haven't you heard in the news? Melania Trump won't even set foot in The White House. HAHAHAHAHAHAHAHA. and FYI! I mastered 3 foreign languages.","commenter_a":"Is she still ashamed to live in America? Where's MELANIA!!!!!","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"10153626389226336","commenter_b":"Guns don't kill people husbands that come home from work early do.","commenter_a":"You need tougher idiot-control!","post_message":"\"I've got to do something going forward that makes her life meaningful and will always be with me. And this is the way to do it.\" – Andy Parker"},{"comment_id":"998201713572910","commenter_b":"Don't stop there. Get the rest of the scum","commenter_a":"How sad....","post_message":"Islamic State's chief singer-songwriter has been killed in an airstrike in Syria"},{"comment_id":"1724103797869883","commenter_b":"This black pig needs to be publicly executed by being hung till dead,then tossed in the garbage tho I doubt the land fill will allow the garbage truck to dump their garbage with him in it .","commenter_a":"BLM, baby ! BLM !","post_message":"Media Silent After Black Teen Shoots Newlywed Veteran And Executes His Pregnant Wife. Tragedy strikes again, please pray. What do you think his punishment should be?"}]
