[{"comment_id":"10153480166187235","commenter_b":"Oh,COME ON! In ALL of Florida there wasn't ANYTHING happening that was MORE illegal than two CONSENTING adults having SEX? RIGHT.😑","commenter_a":"Huh. If everybody who had ever had sex on the beach went to jail, well, spring break in Florida would be much less popular.","post_message":"Reminder: No one involved in the mortgage scandal has served a single day in jail."},{"comment_id":"1381562928548606","commenter_b":"Ya and they'll have to start paying for water or make their own from sea water. Of course northern Ca, will succeed, so all we will lose is the three out of control cities. Not bad","commenter_a":"3 trillion in debt CUT EM LOOSE","post_message":"Spread this everywhere!"},{"comment_id":"10154467754523010","commenter_b":"@username .... Look who's talking?! Trump got his mistress pregnant, that's were his second daughter came from. Malania said, in her plagiarized speech, that she Trump had been together 18yrs....Trump was still married to wife number two at that time! Children with three different women!!!!! Can you imagine what the Republicans would be saying, if that was Hillary?! Hypocrites!!","commenter_a":"He and Bill should hang out since they both cheated on their wives multiple times. Nothing like knocking up the maid. #NeverHillary #ImAgainstHer #VoteTrump","post_message":"Not quite hasta la vista to the Republican party."},{"comment_id":"1007260792718180","commenter_b":"You can cuck off to bitch","commenter_a":"So----don't sing","post_message":"Hello, it's me. I've been wondering if you think I give a crap what you think..."},{"comment_id":"10154931929434641","commenter_b":"Lickass, lickass, lickass from Sri Lanka.","commenter_a":"CNN offered a lot of 'fake news; and 'alternative facts' about Hillary and \"fake polls\" showing her victory.... Mainstream media has lost its credibility.... You cannot stop Trump getting elected in 2020 either","post_message":"\"Alternative facts aren't facts, they are falsehoods.\" - Chuck Todd In an interview on NBC's \"Meet the Press,\" Trump senior adviser Kellyanne Conway said White House press secretary Sean Spicer's false claims about the size of the crowd at President Donald J. Trump 's inauguration were \"alternative facts,\""},{"comment_id":"477887179066242","commenter_b":"That is so sick why would anyone want abort a unborn baby must one that already born i'll tell you who a sick mf that's who","commenter_a":"They have abortions like it's nothing, no big deal. I used to work with a woman that loudly explained to 2 co-workers how her Dr gave her some pills. She took the pills over a weekend and when she went to the bathroom the fetus fell out. I couldn't believe what I was hearing and was stunned. Made life seem cheap.","post_message":"This is INSANE...STOP THEM NOW! PLEASE SHARE TO EXPOSE THEM!"},{"comment_id":"10153316007267144","commenter_b":"Why doesn't she ever just answer the questions and stop telling everyone everything else!! Oh yeah, because she is the biggest liar ever!!!!!","commenter_a":"Way to go Hillary Clinton!","post_message":"The whole room joined her. Watch."}]
