[{"comment_id":"716079211915990","commenter_b":"Shirley you. Ignorant bitch","commenter_a":"How many mof these post DO WE HAVE TO SEE BEFORE IT IS DONE???? IMPEACH NOW!!","post_message":"House GOP is officially voting on the impeachment of Obama. Let's push this through. Please let this pass. Can we get 75,000 'LIKES' to have Obama impeached?"},{"comment_id":"1840557005997054","commenter_b":"Out her in jail!!!","commenter_a":"Insanity needs to be STOPPED now. Gets some 'TEETH' into prosecuting ALL threats.","post_message":"Yet another one..."},{"comment_id":"10152835596391519","commenter_b":"This woman should have her vocal chords removed!!","commenter_a":"I like to go down to the beach and write naughty words on the back of crabs.","post_message":"Repulsive..."},{"comment_id":"521358881400958","commenter_b":"They never would of been allowed into Our Great America.","commenter_a":"Vote all Democrats out of office Be Smart America they are worthless hypocritical self centerd murdering traitors","post_message":"If you were in charge, would you have these deported back to where they came from?"},{"comment_id":"10154422219571509","commenter_b":"Guys it's an easy fix. Just vote for whoever is black in any movie that's how they want it","commenter_a":"I never watch that mess anyway. I do love movies but I'm not into Hollywood all patting each other on the back.","post_message":"When it comes to diversity at The Academy Awards, most Americans shrug their shoulders."},{"comment_id":"10152612107376636","commenter_b":"Women have to cover their hair in 2015 Ffs as if hair tempts men into sinning, give me a break.","commenter_a":"Not true! I am a Muslim woman and NEVER been pushed away from any mosque; whether it be in my home country Egypt or in Tunisia where I currently live with my husban. I am totally sick of the Independent and of all the bogus they keep spreading on Islam","post_message":"This is a problem that has been going on for decades, and little has been done to change it"},{"comment_id":"10153314267037434","commenter_b":"\"Just fly to the UK, no biggie\" except this woman couldn't raise the money to fly to the UK and pay for the procedure that others get for free, and so she ended up in the above situation. \"Fly to the UK, prpblem solved!\" Easy to be callous and glib when its some other poor sucker's life and you're ignorant of the facts, isn't it?","commenter_a":"Yay, Ireland. I live in terror of an unwanted pregnancy because of this kind of insanity. :/","post_message":"Had the woman been living anywhere else in the United Kingdom, she would not have seen a courtroom. However, abortion remains illegal in Northern Ireland."}]
