[{"comment_id":"10153007409220950","commenter_b":"What difference does it make if the victimizer was an illegal immigrant? They're no more likely to be criminals than anyone else.","commenter_a":"How about if your family was a victim of an illegal immigrant?","post_message":"Would you forgive the suspected Charleston shooter if your family were among the victims? @webpagelink"},{"comment_id":"10153564963769778","commenter_b":"Happy Birthday Andrew Thomas,thought you might like this. :D","commenter_a":"hahah xD oh i must watch i will feel the flow xD i know it!","post_message":"After reviewing dashcam footage, the Dover Police department in Delaware came across some interesting sights. \"We hope you enjoy this...and Taylor Swift, if you're watching...we're sorry.\""},{"comment_id":"10153756605707293","commenter_b":"They under no obligation to equally satirize. None at all.","commenter_a":"When you do one on Cruz's squished nose, Hillary's liar farm, Bernie's insane core math, then I'll listen.","post_message":"Wait, what?"},{"comment_id":"10153699957431336","commenter_b":"Muslims need to stay in the Middle East. Or hell. Same thing.","commenter_a":"The Tsarnaev brothers were \"refugees\". Don't forget that.","post_message":"Secretary of State John Kerry says the U.S. will accept 85,000 refugees from around the world next year, up from 70,000, and the number will rise to 100,000 in 2017."},{"comment_id":"10154264837836130","commenter_b":"No she isnt spitting fire..she is comng off as a wimp","commenter_a":"Living in reality is not at all something conservatives are known for.","post_message":"Hillary Clinton spitting fire. 🔥"},{"comment_id":"775594199191746","commenter_b":"You should be in a burka, you slut.","commenter_a":"I suppose next the religious right will insist that women wear burkas next. They're getting more and more like muslim terrorists every day.","post_message":"“Somehow my shoulders are sexualized? Like it’s my responsibility to make sure the boys’ thoughts are not unclean.”"},{"comment_id":"10154739009466337","commenter_b":"I say extract the bitch the bitch that's in you that complains about characters of fiction switching ethnicities","commenter_a":"I say cast a white dude. Because it's cool to switch race's of established characters now right?","post_message":"BLADE'S RETURN? Marvel hopes so..."}]
