[{"comment_id":"10154316928129740","commenter_b":"Haha I look for radar too","commenter_a":"Driving in the personal car you see a vehicle in oncoming lanes that is definitely speeding.. You check the dash mounted radar that isnt there... Also constantly go to adjust the ghost ear piece off duty.","post_message":"These funny habits that follow you home — even after retirement — prove that officers are never truly off-duty."},{"comment_id":"10153845354225579","commenter_b":"I guess Elizabeth you didn't get the memo. Women are excluded from being president as well! You all don't have the fortitude to do what is clearly a mans job!","commenter_a":"Really..Because the shame is on all of the Obama administration. I happen to agree with Dr. Ben Carson..","post_message":"Senator Harry Reid: on Dr. Carson. The Senate minority leader responds to Dr. Ben Carson remarks on Muslims."},{"comment_id":"1207240762629769","commenter_b":"She at the very least a pathological lair.","commenter_a":"LIKE if you agree that Hillary Clinton is MENTALLY and PHYSICALLY #UNFIT for the Presidency!!!","post_message":"Today - I outlined a plan for American economic revival - it is bold, ambitious, forward-looking plan to massively INCREASE JOBS, WAGES, INCOMES and opportunities for the people of our country!"},{"comment_id":"10153752215990575","commenter_b":"Better yet, deport them each and every one ASAP !!!","commenter_a":"Shoot everyone of them no more rape","post_message":"Good question!"},{"comment_id":"10152984478206130","commenter_b":"That woman looks so pissed in every photo I have seen of her lol","commenter_a":"There is no \"key\" to living a longer than average life span. It's all about good genetics and being healthy","post_message":"“I feel good. I don’t feel sick. I’m still trying to do the right thing is all.”"},{"comment_id":"885210571612122","commenter_b":"@username i don t oppose military service because it is a viable way of deliveribg values that civil life doest provide However higher education and military should not be related whatsoever That correlation damages both the military and education And if you compare US army with any army in Europe you will see that your army is overproportionated with your needs","commenter_a":"When the army pays you college it is still your taxes that are being spent alongside with the expenses of the army which benefit the gun and army providers who become richer as long as your country keeps uninterruptly wars to feed their greed You prefer the perpretuation of war than the education of your youth and that is sad","post_message":"I can tell it went viral for a few reasons... ;)"},{"comment_id":"10153001285494091","commenter_b":"Why have a trial for this garbage. Execute her already.","commenter_a":"savage.","post_message":"\"Everybody wants to know. Yes, I did kill her. The mother accused of killing her two children and storing their bodies in a freezer yelled in court that she killed them: @webpagelink"}]
