[{"comment_id":"1310434322356653","commenter_b":"@username you brought the feminism in when you started defending being a hoe","commenter_a":"Only one thing I disagree is he could have waited till the sun came out more to take her and the kids out. I don't blame him for his actions if his busting his ass to provide for her and the kids. If they your kids. Please don't abandon them. And she should be grateful he didn't hurt her. I'm praying they work it out for the kids if their his.","post_message":"He felt the punishment fit the crime. #WSHH #Cheating"},{"comment_id":"10153898128831509","commenter_b":"Stay home until your baby is weaned? Seriously stop! If you want to live some backwards, 1950s lifestyle, you go right ahead. While you're at it, why don't you just keep your opinions to yourself, since that's what a nice housewife would do, right? Give me a break. This misogynist refused to give her a break. There is also nothing to be modest about when it comes to breast feeding or pumping. Maybe you're the one who should work on modesty when you're over there over sexualizing a part of the female anatomy that is meant to help sustain life.","commenter_a":"She should have Left the room To Pump! Really Embarrassing for the female and males in a business Meeting! Have you no Modesty or even Selfrespect ! Stay home till your baby is weaned !!","post_message":"Donald J. Trump's attorney says Trump's language wasn't about her decision to pump breast milk, but solely on where she chose to do it: @webpagelink"},{"comment_id":"10153456187686615","commenter_b":"That chick must be high","commenter_a":"Please everyone lets leave her in an empty room. I seriously don't understand how anyone could like her!!","post_message":"JUST IN: Hillary Clinton's campaign says the Democratic presidential candidate will be making a stop in Pittsburgh next week."},{"comment_id":"874645565991108","commenter_b":"Crista..isn't funny how she can write songs about all her ex boyfriends, and that's cool..but she's off limits???LOL..","commenter_a":"Kanye West..These cat's are crazy..LOL...if you are so \"untalented\" then why are they so worried about a song..not REAL life..a song..WORDS on a piece of paper..that have no relevance to their life..i'm about to get a lot of hate i bet..that's cool..but before you tell me i'm wrong people..how many of you own the Marshall Mathers C.D.?? it sold millions of copies..or have bought any Eminem album since?? so, those were just funny celebrity mentions?? but now it's serious?? people need to relax..","post_message":"In a new song, Kanye West speculates he might still have sex with Taylor Swift."},{"comment_id":"10154012959875329","commenter_b":"I was going to tag my bff, and a couple of them made cringe a bit because u do then, but Jesus, that's a real bitch. I must be just a mini bitch.","commenter_a":"Wow I thought I was a judgmental bitch until I read this. Good to know I'm not that bad!","post_message":"You judge everything."},{"comment_id":"10154424065382885","commenter_b":"If I'm not mistaken your authorized to wear awards from other services you earned. I know in my unit former Marines would wear their aviation badges.","commenter_a":"The officer in this picture is wearing a Navy Fleet Marine Force Breast insignia, Navy Conduct Medal, Navy and Marine Corps Achievement Medal ... weird","post_message":""},{"comment_id":"10153677449116336","commenter_b":"Have you ever noticed it's always pretty women getting killed? Eat more cheeseburgers.","commenter_a":"Yolanda Mejia","post_message":"A body found on a rural property in northwest Spain is most likely that of Denise Thiem, an American woman who went missing while walking along a pilgrimage route, Spanish officials said."}]
