[{"comment_id":"10155357191987439","commenter_b":"No thanks in representing the USA. Just another Linda Sarsour.","commenter_a":"Pretty sure this was found to be another muslim playing the victim","post_message":"Muhammad, a lifelong American citizen, claimed in an interview last week that she was detained \"just a few weeks ago\" by U.S. Customs and Border Protection agents. She said she was held for two hours without explanation."},{"comment_id":"10153897303435329","commenter_b":"Some girls are bigger than others","commenter_a":"You can open a bottle with any edge. Lighter, desk, door jam, bike pedal","post_message":"How To Open A Bottle With A Cigarette Lighter"},{"comment_id":"1796249287363379","commenter_b":"Khloe would put this midget bitch on blast.","commenter_a":"So what","post_message":"She really don't like the Kardashians. #WSHH"},{"comment_id":"10154514079711509","commenter_b":"That is funny","commenter_a":"I hate to say it but Bernie has done much more for equality than Donald trump","post_message":"\"There's nobody that's done so much for equality as I have,\" said Donald J. Trump."},{"comment_id":"836603479863562","commenter_b":"Prayers and positive messages on the Internet along with taking as many polls as possible. Drive elderly Trump supporters to polls and escort them in. BLM and Black Panthers plan to block the elderly and Veterans from voting. Black Panthers alone blocked them last election","commenter_a":"Yes , with all my heart, since I can't help him with money...I wish him good luck..","post_message":"He truly does want to make our country great again. Let's show him we stand behind him. Do you support Donald Trump?"},{"comment_id":"10153593940166336","commenter_b":"Every woman scares Jorge.","commenter_a":"He did NOT pay kids for sex. He raped children!! Get it right!!!","post_message":"Fogle offered to pay adult prostitutes a finder's fee if they could connect him with minors for sex acts, including some as young as 14 or 15 years old, authorities said."},{"comment_id":"10154903859534586","commenter_b":"Kill the cats!","commenter_a":"Im vegan and when i go out i try to tell at least 20 people im vegan and i dont eat gluten","post_message":"This is so accurate SHARE if you can relate! #GoVegan2017"}]
