[{"comment_id":"10153255474016509","commenter_b":"Avi Cohen she has money my $45,000 a year is her daily parking fee money","commenter_a":"I need to find her and get her pregnant ... I wonder if she likes chocolate","post_message":"After all that back-and-forth about their billion-dollar divorce, oil tycoon Harold Hamm's ex-wife has finally cashed the check for $975 million. @webpagelink via CNNMoney"},{"comment_id":"1203183663111217","commenter_b":"STFU","commenter_a":"Nothing Mr. Trump does compares with crimes Hillary and obama have committed.","post_message":"A prominent Republican who supports Donald Trump urged the candidate to start acting like “a potential leader of the United States.”"},{"comment_id":"949160488506463","commenter_b":"THIS IS 9AMERICA0 NOT SYRIA","commenter_a":"May I remind everyone, This is America and the judge was correct. Swear to the truth by swearing to it on the Bible!","post_message":"Did a judge violate this woman's religious freedom or were his actions justified?"},{"comment_id":"10153355392014087","commenter_b":"Frank, public services are for the good of the whole. Socialism is when you have a garden with beautiful tomatoes and I, being too lazy to grow a garden, get my share of your tomatoes. Not because I deserve them, because the government said you have to give them. How ling do you think you will continue to grow that garden to feed my lazy butt? Socialism fails because the workers quit working also because there is no reward to their labor. The workers will become the lazy also and there will be no tomatoes. Figured I had better break it down to kindergarten level for you.","commenter_a":"If you support sanders, go live in Cuba. Democratic socialism there already.","post_message":"Bernie Sanders is increasing the size of his campaign staff and boosting state budgets, according to a new report."},{"comment_id":"10153690862048812","commenter_b":"@username number 2 would be thugees not thugs","commenter_a":"Over rated NFL attention seeking drama thug using his kids for media attention.","post_message":"NFL star James Harrison strips his kids of their participation trophies. “These trophies will be given back until they EARN a real trophy.” @webpagelink"},{"comment_id":"10152742608351491","commenter_b":"I am amazed at how many women are so poorly informed on the issue and then let the world know how little they know. Amin wage woman does not have access to a mike and thankfully Patricia did and took advantage of it.","commenter_a":"Says a women riding home in a limo! Political rant to get attention. She is a actress","post_message":"“It’s our time to have wage equality once and for all and equal rights for women in the United States of America.”"},{"comment_id":"10154884706896729","commenter_b":"She wasn't worthy to be a. Olympican","commenter_a":"Then she gets disqualified and out of the Olympics!!! Send her home!","post_message":"Islamic anti-semitism on full display, folks..."}]
