[{"comment_id":"818332488251250","commenter_b":"American exceptionalism...we can be batshit crazy and justify it with religious idiocy. We're special :)","commenter_a":"Have we gone completely nuts or completely American/Christian Taliban?","post_message":"Six states currently permit pharmacists to refuse prescribed contraception medication to a woman based on personal and/or religious beliefs."},{"comment_id":"1294762407204042","commenter_b":"She should be arrested!! She a used this horse and disrespected the law","commenter_a":"Arrest her, let her do her time cleaning out stables of horse droppings .. It's equal to mentality !","post_message":"\"She seems nice\""},{"comment_id":"10154229601211179","commenter_b":"Ash Kay- see? I'm not the only one thinking this! 😂","commenter_a":"That is sadly amusing","post_message":"via @buzzfeed"},{"comment_id":"10154143941493984","commenter_b":"OF COURSE IF THEY FIND BLOOD FROM THE VICTIMS ON THE KNIFE, IT WILL BE TO LATE TO USE AGAINST OJ! BUT CAN ANYONE IMAGINE, IF THE PRISONERS FIND OUT ABOUT THAT, HE'LL NEED ALOT OF MONEY TO KEEP HIM SAFE IN PRISON!","commenter_a":"This must be the month of truth telling in EVERYTHING!","post_message":"Wow. What was found buried on O.J. Simpson's former property could change everything. This is a HUGE twist..."},{"comment_id":"969277346429620","commenter_b":"Women only have X chromosomes.","commenter_a":"Those babies will never be normal. You need X and Y chromosomes. This is going to be sad.","post_message":"Humanity may have crossed a treacherous threshold as Researchers led by an Indian-origin scientist, have shown that stem cells from the skin of two adults of the same sex can be used to make human egg and sperm cells. What this means is, there is no longer a need for the opposite sex to “create Life”. What could possibly go wrong with “Playing God” and altering the creation of Life? #daysofnoah"},{"comment_id":"10154054771666574","commenter_b":"Thank you Senator @username. Please stand up to this narcissistic demagogue who is the president. Please encourage your Republican colleagues to stand up to the POTUS and his white nationalist advisors.","commenter_a":"A Free Ukrainian and freedom for Chechnya, Dogestan, Alania, Ingushetio, North Osseha, and other ethic republic under Russian occupation.","post_message":"President Donald Trump’s call with Vladimir Putin is scheduled to take place amid widespread speculation that the White House is considering lifting sanctions against Russia. For the sake of America’s national security and that of our allies, I hope President Trump will put an end to this speculation and reject such a reckless course. If he does not, I will work with my colleagues to codify sanctions against Russia into law. In just the last three years under Vladimir Putin, Russia has invaded Ukraine, annexed Crimea, threatened NATO allies, and intervened militarily in Syria, leaving a trail of death, destruction, and broken promises in his wake. Russia’s war on Ukraine has killed over 10,000 Ukrainian soldiers and civilians. Russia supplied the weapons that shot down a commercial aircraft over Ukraine and killed 298 innocent people. Russia has conducted a massive military buildup along NATO’s eastern flank, conducted large-scale military exercises, ..."},{"comment_id":"10153269356147452","commenter_b":"@username the Marine Corps taught me nothing. You must be a weapons expert","commenter_a":"So you can hear two people yelling but not a gunshot?","post_message":"BREAKING NEWS: A homicide investigation is underway after one person was found dead following a report of two men yelling in an Alhambra neighborhood, police said. One person is being questioned, and there is no active search for other suspects."}]
