[{"comment_id":"10153678323388908","commenter_b":"Interesting - are Israelis more tightfisted than racis","commenter_a":"Luisa","post_message":"A cafe in Israel has decided to give a 50 percent discount to tables mixing Jewish and Arab diners, in an attempt to ease racial tension..."},{"comment_id":"10153426857830329","commenter_b":"Faketalian !!! Grossest shit ever.","commenter_a":"@username oh my gawd we need to go","post_message":"We all knead this."},{"comment_id":"1108523962492406","commenter_b":"Illegal aliens 62%!","commenter_a":"Most people on welfare are in a red state and are white. @webpagelink @webpagelink Undocumented immigrants pay taxes all the time. \"The 11.4 million undocumented immigrants currently living in the United States collectively paid $11.84 billion in state and local taxes in 2012. ITEP’s analysis finds their combined nationwide state and local tax contributions would increase by $845 million under full implementation of the administration’s 2012 and 2014 executive actions and by $2.2 billion under comprehensive immigration reform.\" @webpagelink","post_message":"Fighting off anti-immigrant myths with FACTS."},{"comment_id":"484066138450614","commenter_b":"@username any woman who needs a leader is not going to be the best wife.","commenter_a":"If that was my husband, he'd know his place, and it wouldn't be in my house. More like on the pavement.","post_message":"Kirk Cameron:  'Wives shouldn't tell their husband how he ought to be a better husband'"},{"comment_id":"10153547660103854","commenter_b":"Hates those who serve. Loves the illegals","commenter_a":"Scum of the earth","post_message":"ULTIMATE BETRAYAL: Obama To Cut Healthcare Benefits For Active Duty And Retired Military"},{"comment_id":"908007962567959","commenter_b":"Look at that nasty excuse of a woman.","commenter_a":"That family is severely screwed up. Corrupt financially, politically, and morally! Any wonder why this society is so bad? No. Just pathetic. And they smile in the face of this country with absolutely zero remorse or accountability.","post_message":"GROSS!"},{"comment_id":"10153560917566615","commenter_b":"Get off of here Martha","commenter_a":"Who cares he got away with rape.","post_message":"WELCOME TO STEELERS NATION, BABY BODIE!  The newest addition to the family of The Pittsburgh Steelers QB Ben Roethlisberger is right along side the rest of the City of Champions tonight, cheering on the Pittsburgh Penguins to a Game 7 win! LET'S GO PENS!  (Photos courtesy of Ben Roethlisberger - BigBen7.com)"}]
