[{"comment_id":"1205428982807783","commenter_b":"Actually our laws are being ignored, all illegals by law are to be deported and anyone who employs them face prison time if the current laws were enforced","commenter_a":"DONALD TRUMP It is a shame that a billionaire ...regardless of politics or party ...can walk in, fund himself and blackmail the political process.... Is this the future of our country only self-funded billionaires can run for president from now on? If that is the case then this is no longer a republic and we are no longer operating through a democratic process TRUMP'S IGNORANCE on the world stage will begin to be seen now. JUST WHAT DOES THIS MAN KNOW? He knows how to conduct business and DIRTY business deals He knows how to declare bankruptcy He knows how to be a GOOD ANCHOR HUSBAND who takes young women the age of his daughter who are NOT CITIZENS and provide them with $$$$$ and a pathway to citizenship... THAT IS WHAT HE KNOWS TRUMP continues to show the world what a racist pig he is SANTORM and CRUZ and ...","post_message":""},{"comment_id":"10153884149866130","commenter_b":"Its a joke you stupid bitches. Get over yaselfs.","commenter_a":"Ummm, kinda defeats the purpose of going out to the bar to get drunk if the bar is going to try and deter me from drinking. Wtf. Thats like my weed dealer explaining the importance of not smoking so I dont get cancer, smh. Dumb. Lol.","post_message":"One bar is getting patrons to think twice about drunk-driving by setting up a live-stream with a convicted felon."},{"comment_id":"1000377376688677","commenter_b":"Just stay the hell out of America...we don't need your crap here.......Stay in your own country......These buttwipes are allowed to do this in their country, so go home and do what you want, keep it out of America!!!!!!","commenter_a":"1. First the US gov attacks its own people on 9.11 in false flag operation 2. They blame the attack on Osama Bin Ladin, a fictitious character created by the CIA and played by several actors. 3. The US makes war on two countries using false pretexts for war, both times. 4. The US uses drones to kill \"terrorists\" which include many innocent Islamic peoples 5. The US gov pretends to kill OBL as some kind of fake victory. Obviously, they cannot allow the remains to be scrutinised so they jetison it at sea and take no photographs either. All lies. 6. The US War on Terror is very similar to the Crusades where four centuries of young Christian men were lied to by the Pope and told to go brutalise and savagely attack innocent Saracens who were safeguarding the Holy sites in Palestine 7. In the US, whites kill ...","post_message":"And he wanted to take a second wife 'because it was allowed under Islamic law'"},{"comment_id":"1239601439418363","commenter_b":"kill yourself then you basic bitch","commenter_a":"yo this shit is funny as fuck and if you disagree you're definitely not lit kill yourselves if you didn't laugh when the girl dialed 911 on the microwave and the first few notes of the x-files theme song plays as you hear the operator lmaoo im deaaaaaad if you didn't like this vid fuck u, ur bitch, ur fam, and the clique u claim","post_message":""},{"comment_id":"10153752215990575","commenter_b":"Better yet, deport them each and every one ASAP !!!","commenter_a":"Shoot everyone of them no more rape","post_message":"Good question!"},{"comment_id":"1088954241145047","commenter_b":"To all the women bitching","commenter_a":"He paid 50,000 for it! It's his! You big fat sissys!","post_message":"The identity of the American man who lured a treasured African lion out of a national park, shot it, stalked it for two days, then beheaded and skinned the animal, has been revealed. He's a dentist from Minnesota."},{"comment_id":"10153505176486051","commenter_b":"I disagree with every thing she says, such a liar","commenter_a":"I hope she does get the dem. nom. that way repub. are guaranteed a win.","post_message":"Hillary Clinton believes Americans should wholeheartedly reject Trump's rhetoric on Muslims and immigrants. Do you agree or disagree?"}]
