[{"comment_id":"10153395954276051","commenter_b":"It's a deformed pig fetus.","commenter_a":"Yea right.","post_message":"When a woman found this bizarre creature in her backyard, she was completely horrified."},{"comment_id":"10155993516865354","commenter_b":"How in da hell can a fine ass hoe like this want to go to hajji land to have a scarf put over that fine ass mug of hers","commenter_a":"what a shame. arrest them !!!","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS. Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"10154755276262619","commenter_b":"Heads up!","commenter_a":"Natanyahu is not an Orthodox Jew. He is a secularist.","post_message":"The Israeli Ministry of Defense Missile Defense Organization head Yair Ramati has been dismissed from his post due to grave security violations."},{"comment_id":"10154979163784712","commenter_b":"@username she has given no reason for anyone to respect her. She is disrespectful, offensive and rude.","commenter_a":"Ugh .... for fucks sake ... \" the tax payers are funding this \" you fucking idiots!! He is gutting federal funding from science to build this stupid fucking wall ... p.s most illegal aliens are here from over stayed visas ! From countries they took planes from ! Besides don't you watch international news ? Cartels use tunnels now to bring in drugs you fucking dummies !","post_message":"Trump will sign executive orders enabling construction of a border wall and targeting sanctuary cities."},{"comment_id":"10153506145308690","commenter_b":"and one manyetanyahu or whatever is his name of israel","commenter_a":"Arrest Bush , Cheney , Blair , Rumsfeld and all the WarCriminals !","post_message":"\"I wanted SA to arrest #Bashir. Not because of ICC, but more to see the shock and fear in the eyes of all the other African leaders.\""},{"comment_id":"1103187606428737","commenter_b":"More words of wisdom from the vastly intelligent mind of Pelosi, or liberals say the darndest things.","commenter_a":"idiot","post_message":"www.EagleRising.com"},{"comment_id":"479435838921955","commenter_b":"@username not very lady like !","commenter_a":"President trump all the way people power God bless Donald trump","post_message":"For many, the look on Chris Christie's face said it all during Donald J. Trump's #SuperTuesday event."}]
