[{"comment_id":"10154556133417235","commenter_b":"Good bye you old hag","commenter_a":"It could only have happened more quickly. Thank God for small miracles. Goodby. God Bless, where ever \"He\" .Kisses.","post_message":""},{"comment_id":"10153350973886051","commenter_b":"She lost !!","commenter_a":"that Aunt is a brain dead moron. She doesn't deserve to have any family members.","post_message":"This aunt is suing her 12-year-old nephew for $127,000 over a hug."},{"comment_id":"826509020778685","commenter_b":"LEGAL immigrants, please learn the difference.","commenter_a":"Not surprised ... Coming from a nation of immigrants, you have to be the right kind of immigrant #theyaregonnabusthellwideopen","post_message":"BREAKING"},{"comment_id":"1357316664288360","commenter_b":"You have got to be kidding. These people are making bad decisions how long are we going to baby adults too stupid not to do drugs? Why can't our country figure out what ILLEGAL means? How about illegal immigrants and illegal heroin.","commenter_a":"its better then clinton","post_message":"Ithaca's mayor wants to open safe injection rooms for heroin users."},{"comment_id":"1765071860379740","commenter_b":"damn elizabeth coming out swinging","commenter_a":"That was EXACTLY what happened to another person that was supposed to be deposed and speak out against the Clintons years ago, and was found three days later by the FBI after the guy missed his deposition:-(","post_message":"Do you think the Clinton's were involved in his death?"},{"comment_id":"1338517659516985","commenter_b":"I call Bull!!! On that one!!! I have to perform and work twice as hard than my Caucasian counter part and still make less money. Do the \"work\" of a title position but not get the position because the Caucasian has it and can't do the job!!!","commenter_a":"Always like this Guy best of movie real actor love him I see most of his movie .","post_message":"So accurate, it’s SCARY!"},{"comment_id":"10154161430028635","commenter_b":"Which is exactly why feminists aren't equalists, because they haven't dropped the privileged first-class citizenship baggage yet.","commenter_a":"My husband's previous wife took his son five states from him and the courts made him pay support without any effort to give the boy visits with his dad. That state is Indiana. The CP courts there are filthy with corrupt administrators.","post_message":"Teen applying for college finds out social security info don't match up and he was abducted as child"}]
