[{"comment_id":"1267539270005791","commenter_b":"@username , is it all intelligent, competent and strong women that intimidate you, or just Hillary? Hillary 2016","commenter_a":"He can only intimidate weak people... She's the exact opposite of that! #VoteBlue","post_message":"BOOM."},{"comment_id":"10153247018494087","commenter_b":"Bad cars cause people to die so do the bad guns!","commenter_a":"Yes it is Donald! The libs are too stupid to realize it! Look at Chicago, the more gun control, the more shootings.","post_message":"“The gun laws have nothing to do with this,” Donald J. Trump said. “This isn't guns, this is about really mental illness. And I feel very strongly about it.\""},{"comment_id":"880520761983346","commenter_b":"Perfect pic of her with her mouth wide open.","commenter_a":"She is scum.","post_message":"Tom Selleck is awesome!"},{"comment_id":"1632303213733906","commenter_b":"This dumb chick is over reacting","commenter_a":"Yeah! No thanks your husband has already broken America","post_message":"One first lady has already lost to Donald Trump... could Michelle win in 2020?? @webpagelink"},{"comment_id":"10154648148626509","commenter_b":"Women for Trrump!!!: \"They'll be on their knees soon enough.\"","commenter_a":"Woman and Americans for our next president Donald J Trump.. Welcome aboard it's a wonderful ride to the White House","post_message":"This mogul once said he's a member of \"the lucky sperm club.\" How Donald J. Trump sees himself, in his own words: @webpagelink"},{"comment_id":"10153328109319087","commenter_b":"@username Let the refugees go fight for themselves.","commenter_a":"When are people going to accept that refugees are not terrorists?","post_message":"President Barack Obama still plans to allow 10,000 Syrian refugees into the country over the next year, despite terrorist attacks in Paris, at top aide said Sunday."},{"comment_id":"954260038007303","commenter_b":"Shut up pain your wife's ugly","commenter_a":"@username 1254149964595086mond DeBusschere @username @username reminds me of the good ol days at the barracks","post_message":"Friends like this #WSHH"}]
