[{"comment_id":"901805833201774","commenter_b":"Clown in a wig . She makes me sick","commenter_a":"Better to resign before the s--- hits the fan.","post_message":"Why did Democrat Congresswoman Corrine Brown pay the Chinese embassy?"},{"comment_id":"10156681236645354","commenter_b":"Go Donald Trump make America great again Let's take our Country back Ban muslims God be with you and Stay Safe.","commenter_a":"Trump did NOT say Muslims should wear special ID badges. Clever editing by a hostile press invented that.","post_message":"Fox News Invites Anti-Trump, Hitler-Citing, Muslim Advocate to Join GOP TV-Debate"},{"comment_id":"512225352297167","commenter_b":"put that baby arm away bitch get tight hoooeeeee","commenter_a":"Savage","post_message":"It be like that "},{"comment_id":"10153738132321756","commenter_b":"Awesome. catch 'em.","commenter_a":"Loved this story today! Thank you @username! Very interesting and I can't wait to watch the documentary.","post_message":"To track the route of poached tusks, investigative journalist Bryan Christy commissioned a taxidermist to create fake ivory tusks, which he embedded with specially designed tracking devices."},{"comment_id":"1011637472207253","commenter_b":"Fuck drake ol biting ass nigga","commenter_a":"Fuck drake. He ripped off some shit from the nineties. Don't get crazy all you drake heads he is just trash anyways. pop not hip hop so don't disrespect hip hop by putting his name in the same sentence","post_message":""},{"comment_id":"10154559728153812","commenter_b":"@username He has lead our country in more debt than any other presidents He doesn't give social security costs of living raise in 3 years He's letting illegals into our country without being vetted He's trying to take guns away","commenter_a":"You Americans, I can't believe how you can produce great leaders like Obama and then still show up with Trump for the next elections.","post_message":"Donald J. Trump on #Dallas: \"This isn't the American Dream we all want for our children.\" abcn.ws/29mnwVr"},{"comment_id":"992170134153660","commenter_b":"She is a nasty, vile woman...","commenter_a":"What about the part where it was not illegal to have that information on a private server you could have debunked it as well","post_message":"\"Ahead of the #DemDebate, this is the video Hillary doesn't want you to see.\" - Reince Priebus."}]
