[{"comment_id":"10153831550149474","commenter_b":"I don't believe my dog trust Hillary","commenter_a":"I remember she slapped her husband's face at the White House. Lol.","post_message":"Simple. Share if you agree."},{"comment_id":"10154716628348812","commenter_b":"Cynthia, please please do not vote or reproduce.","commenter_a":"Republicans are throwing everything at Hillary trying to see if it will stick. They know they will lose the election in November, and this is the only way they can come up with crap to try to cast doubt on her campaign. It is not America's fault that the only person representing their party is a certified lunatic. :D","post_message":"The various iterations of the Clinton Foundation are coming under scrutiny as Hillary Clinton runs for The White House."},{"comment_id":"10153153729864726","commenter_b":"your mother is white your white bunch of zebras in the white house","commenter_a":"what an ass","post_message":"WATCH: Michelle Obama's mom admits she is worried about mixing races and is glad Barack Obama isn't completely white!"},{"comment_id":"10154764685995470","commenter_b":"Walls do work... ask any prisoner. They keep the bad guy's in and on the border they will keep the bad guy's out... and pregnant mothers wanting a free birth provided by an American hospital. The border invasion has to stop and Trump will stop it.. The wall is a cheap way to get the job done.","commenter_a":"I hope all the geniuses that voted for these clowns are ready to part with their hard earned money...","post_message":"House Speaker Paul Ryan says Congress will front the money for President Donald Trump's newly announced wall on the U.S.-Mexico border."},{"comment_id":"10154110742322439","commenter_b":"Cowards !! Stay to fight for your country !! You are Iran's puppets !!","commenter_a":"No problem. Enlist them in the French Foreign Legion - minimum 12 year enlistment; send them to Corsica for Basic and Combat training, and then deploy them to Libya to fight ISIS.","post_message":""},{"comment_id":"895356030506185","commenter_b":"Saudees R disgusting devils.","commenter_a":"Saudi regime should be removed out of power and kicked out of the country.","post_message":"What do you expect of the #Saudi aggression against #Yemen? Raise your voice by taking part in our poll: www.presstv.ir"},{"comment_id":"1252586078101378","commenter_b":"close the borders is THAT step you @$$hole","commenter_a":"Yeah he may need to stop staging them, its transparent that since hes been in office we have had the highest amoumt of mass shootings ever, and seems it happens around the time he wants to push for more gun control. Is it me or am i going nuts.","post_message":"Knowing nothing about the causes of the #SanBernardinoShooting, Obama issues his mindless chant for more gun control. cnn.it/1Xzyg5u"}]
