[{"comment_id":"10153134733596037","commenter_b":"A lot of women where I live buy as much jewelry. I don't think its extraordinary.","commenter_a":"As with Obama, the focus on a first lady is just a witch hunt. Jeb has enough of his own baggage to drag around.","post_message":"#JebBush's wife #ColumbaBush joins a long list of political spouses with a taste for extravagance. Yahoo News' Dylan Stableford reports."},{"comment_id":"10153590637376336","commenter_b":"Nuclear is clean efficient and it's a country's pride! Do you know ordinary Iranians are really nice folks?","commenter_a":"Boy this Iran sure wants nuke power really bad, but what I don't understand is why they need nuke power to light up clay homes in the desert. Does anyone else see a different picture? America used wind, coal, steam as a first time power source.","post_message":"Iran will reportedly be allowed to use its own experts to inspect a site it allegedly used to develop nuclear arms under a secret agreement with the International Atomic Energy Agency."},{"comment_id":"710239562414460","commenter_b":"Yep, it's a sure way to self-destruction and negativity.","commenter_a":"Nope, not true. If that were the case, there would be collective responsibility too, and that would be impossible. We are individuals responsible individually for our own actions, choices and lives.","post_message":""},{"comment_id":"122183888495014","commenter_b":"@username....lmao white ppl","commenter_a":"Holy shit lmfao","post_message":"How To Find A Masculine Halloween Costume For Your Effeminate Son"},{"comment_id":"1865190080165091","commenter_b":"What about the serial killers child molesters child rapists murderers here in the United States we should get rid of all of them as well have them sent somewhere so they can stop all this craziness here and yes there are many Savages right here in the United States","commenter_a":"These people are f--king sick get them out of our Country.","post_message":"Muslim Nurse Mutilates Little Girl’s Genitals, What She Told Her Is Even SICKER"},{"comment_id":"1204331449626601","commenter_b":"Lol","commenter_a":"I know I probably shouldn't but I find this diabolically hilarious.","post_message":"Someone sneaked up behind him  (via Daily Mail Australia)"},{"comment_id":"1923069711254227","commenter_b":"so far 1.5 million people have liked my last comment PERIOD!!!","commenter_a":"My gawd it's an immigrant disrespecting the flag! Shouldn't O'Reilly and Hannity be all over this? Lqtm","post_message":"Oh, how they would SCREAM!  Shared by Occupy Democrats, LIKE our page for more!"}]
