[{"comment_id":"10153831710401509","commenter_b":"OMG !!!! GET OFF HER BACK, people get suntaned without a hassle !","commenter_a":"ENOUGH!!","post_message":"Paula Deen has some \"explaining\" to do: @webpagelink"},{"comment_id":"852525808271329","commenter_b":"Fire the bitch","commenter_a":"not good","post_message":"She refused to hang his coat, but true patriots stepped in. This is how all of our vets, and active duty should be treated. Can we get 3,000 'LIKES' for our vets?"},{"comment_id":"959639310819514","commenter_b":"Maybe they should also be deported.","commenter_a":"I love the idea!","post_message":"ClashDaily.com"},{"comment_id":"769219589888459","commenter_b":"i have been there over and over the last time a mexican woman tried to give my mother her baby beged my mother to take the child this is a fact and sad but if mexico is so great then way are so many comming to America","commenter_a":"Who would want to move to Mexico? In dire stress, a person could find better options than that Anti American, drug cartel controlled country. Funny how they are so anti American, but so many scramble to get here huh? The citizens of Mexico don't even want to live there, and I can't say I blame them.","post_message":"Americas Freedom Fighters"},{"comment_id":"10155065257093984","commenter_b":"There is no doubt Israel or Jews were there first. As far back as 2166 B.C., some say as far back as 4000 B.C.. Arabs or Muslims first recorded being there 853 B.C., Mohammad wasn't born until 570 A.D..... The size of Israel is 12,877 Sq. mi. about the size of New Jersery... The size of Arab, Muslim land is 8,368,272 Sq. mi., and consist of 20 countries. That would be the size of putting together (Texas and Alaskas) 8 times.... Over the years Muslims have attacked Israel, even combining countries to fight Israel and have lost every time to Israel's strong military. During peace talks, Muslims have never given up anything to Israel. Whereas everytime Israel has given up land to Muslims, they have used the land to move closer for attacks against Israel. Muslims do not want peace with Israel. They have said they will not coexist with ...","commenter_a":"NBC is one of the least creditable news sources. The beat goes on ! Time to boycott them.","post_message":"Talk about \"fake news!\" Here's how NBC was just BUSTED in a massive lie designed to make people think less of Israel. Here's what they had to say that has a lot of people outraged... This proves EXACTLY how the mainstream media feels about Israel..."},{"comment_id":"10153778379533984","commenter_b":"They are disgusting!","commenter_a":"Cancel it immediately!","post_message":"If you thought the controversial comments that were made on air by 'The View' co-hosts were bad, wait till you see what was reportedly said backstage... What do you think of 'The View'? Have they gone too far this time?"},{"comment_id":"722580014574620","commenter_b":"Illegals voted here for Obama...","commenter_a":"Proof of Citizenship or Naturalization of Citizenship is the only way you can vote in National elections. Try going to any other country and vote in their elections, YOU CAN NOT. Period end of report","post_message":"Will someone steal your vote when you cast your ballot on Election Day? Voter fraud can drastically influence the outcome of elections."}]
