[{"comment_id":"10155034112494445","commenter_b":"She's nervous he may grab her by the pussy!!!","commenter_a":"She looks nervous as would I this has been a big day for them, STOP THE HATE, she is a beautiful woman... let's be real how would you be if the entire world was watching you!?","post_message":"President Donald Trump and First Lady Melania Trump share their first dance as the First Couple.  @webpagelink"},{"comment_id":"218545795283614","commenter_b":"Children in poor areas should not be doomed to poor schools.","commenter_a":"Yes, The GOP has lost every bit of self-respect they ever had. To vote Betsy DeVos in as education secretary with no educational experience is just irrational. If Betsy were smart she would decline the office and get the hell out of town now. She will not survive as educational secretary.","post_message":"Republicans just sold our public schools to the highest bidder.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154347399052045","commenter_b":"'@username well those kids shouldn't be causing trouble then no incident would have to end up like that. Just go school then go home then trouble won't follow you, like the old saying if you walk like a duck, talk like a duck, act like a duck then you're a duck... don't hang out with ignorant bad apple kids just be smart about it...","commenter_a":"These people ars out protesting, these 2 teenage kids that assaulted an off duty police officer. And because of one of these kids comes up from behind and hits this officer while holding his friend by the shirt he pulls out his gun and fires it into the ground, NOT INTO THE AIR, people protest. If these kids got the butt handed to them in there home growing up they wouldnt be out in the streets causing problems. The kids r lucky they dont have a bullet wound in the A $$","post_message":"Protesters in Anaheim are blocking streets to demonstrate against an off-duty LAPD officer's confrontation with a teen in which he fired his gun. @webpagelink"},{"comment_id":"10155114776336509","commenter_b":"Yes lets look at all those years Hillary has been in office but she doesn't handle classified information. So what does she do??? Trump has declared bankruptcy 7 times out of over 500 businesses. Pretty good success rate. I would like to see you try and run two businesses and see how you do. NEVER HILLARY!!!!!!","commenter_a":"Let's compare resumes, shall we? Hillary Clinton: 9 years, First Lady of Arkansas 8 years, First Lady of the United States 8 years, U.S. Senator 4 years, U.S. Secretary of State Donald Trump: At least 15 failed businesses Owns casinos that have filed for bankruptcy no less than 4 times 0 years in public service Now, if you were looking at those numbers, who would you hire? Who would you trust?","post_message":"While introducing Hillary Clinton at an appearance in Omaha, Nebraska, billionaire Warren Buffett challenged Donald J. Trump to release his tax returns: 'I'm under audit too. I would be delighted to meet him any place, any time. ... I'll bring my tax return, he can bring his tax return.' @webpagelink"},{"comment_id":"1073790629380657","commenter_b":"'@username. Just fn Stop it with the Fox 'news' total BS talking points. Insurance is about LIABILITY, not necessarily self protection..and it's Democratic Socialism at it's core such as our tax code: Put $$$ into the pot to benefit/secure your society's quality of living. The phrase 'free market capitalism' is nothing but corporate fascist propaganda for dumb asses.","commenter_a":"I like to ask people that hate socialism why they buy insurance? You can almost see them stroke out as they start to think really hard about the question.","post_message":"Brilliantly done."},{"comment_id":"1163050380483299","commenter_b":"'@username, I'm quite happy with my wife of 33 years, but thanks for the suggestion.","commenter_a":"Honestly, I don't know anyone who wears Ivanka trump's clothing. This is the risk you run when you become part of the political process.","post_message":"A recent survey found that 57% of women refuse to buy Ivanka Trump branded merchandise following her father's controversial campaign."},{"comment_id":"1588672124482344","commenter_b":"Shut up phonies","commenter_a":"U need to find out mr trump how much killary and obama paid her to do that","post_message":"Meryl Streep blasted Donald Trump and the people who voted for him at the Golden Globes. She received thunderous applause from most of the celebrities gathered there. Do you agree with Trump's assessment of her career?"}]
