[{"comment_id":"10156257244825725","commenter_b":"\"Multiple woman.\"","commenter_a":"Is that dan blizerian","post_message":"A man is accused of secretly recording himself having sex with multiple woman. One who was informed that she had been recorded didn't even know a sexual encounter had occurred ----> @webpagelink"},{"comment_id":"10154689857838487","commenter_b":"What a complete idiot","commenter_a":"He gave his brain away, didn't he. That's got to be the reason. He was selfless and gave his brain away.","post_message":"Carson accused Kay of making him  bad guy, and asked Joe Scarborough, the show's host, to  her microphone off so I can talk."},{"comment_id":"10154727514062235","commenter_b":"Between crooked Trumpkin and crooked Hillary I'm going to vote for Hillary.","commenter_a":"A vote for Donald Trump or any politician who supports his candidacy is a vote for discrimination. Period. No exceptions. No excuses. You might as well tell your Black, Latino, Asian, LGBTQ, Muslim, Jewish, Native American, non-Christian, disabled and woman fellow Americans they are not welcome in the U.S.","post_message":"Okay, Mr. Trump adviser, there is a big difference between a fact and just something you wish was true."},{"comment_id":"10153031093836037","commenter_b":"Whore....","commenter_a":"Heck, sue playboy, or your parents. smh She should have been in school...","post_message":"Lawyer says he has evidence @BillCosby wasn't at the Playboy Mansion at time of model's alleged abuse: @webpagelink"},{"comment_id":"10153808886723984","commenter_b":"Idiot bitches","commenter_a":"You just GO Ben!","post_message":"Wow! You don't see Dr. Ben Carson get this fired up too often, but  he sure wasn't taking any of Whoopi Goldberg and Joy Behar's nonsense.  Do you stand with Ben Carson despite the constant attacks from the mainstream media?"},{"comment_id":"773517859455693","commenter_b":"They should both go to jail","commenter_a":"Bill can't keep his pecker in his dried up wife's vagina and her server was unprotected. She is a liar, corrupt corrupt blood money.","post_message":"His reaction was..."},{"comment_id":"1148491358514249","commenter_b":"She would not make a good POTUS. She ran HP into the ground.","commenter_a":"I have thought the same thing about Carly Fiorina. I like her and believe technically she might make a good president. But she has a \"look\" about her, not about beauty or sexiness, but a look like she's been hurt badly sometime in her life and is going to have a nervous breakdown at any minute. Leadership also relies heavily on appearance and Ms. Fiorina's \"look\" just isn't motivational. It's almost all about appearance...when is the last time you've seen a multi-million dollar preacher that looks like he/she just lost their puppy? This country is going to need vitality to rebuild itself and she does not project that; FDR would not be photographed in his wheelchair and people still talk about Jimmy Carter's preacher look. We need and I haven't seen anyone that \"appears\" to resemble him, except maybe Sen. Marco Rubio, and only somewhat, a JFK.","post_message":"Trump was watching a newscast when a video clip zoomed in on rival Republican 2016 candidate Carly Fiorina. \"Look at that face! Would anyone vote for that?\"said Trump."}]
