[{"comment_id":"10156385306200231","commenter_b":"She nonce play a white girl maybe she believe she one of them","commenter_a":"Can she be traded in???","post_message":"Why Stacey Dash? Why?"},{"comment_id":"470357549819863","commenter_b":"Another Blind Bitch!!!!!","commenter_a":"Wow. How sad he has really done a lot to get us back on track after what GW bush left him with and am sorry that all these post are being done by redneck asshole","post_message":"How would you define President Obama in one word?"},{"comment_id":"10154966388510329","commenter_b":"She tried to eat my tuna pasta wee bitch","commenter_a":"@username I hope you make nice pals like Pippa 🐶","post_message":"Good girl, Pippa."},{"comment_id":"705392762974353","commenter_b":"Lol too bad she does more for this country than you ever will","commenter_a":"She's awful. She's a spoiled brat that needs attention. We need to stop giving her a second of our time and let her slither back to wherever she came from. Maybe she can go live with Heidi and Spencer.","post_message":"Newly-uncovered video proves Tomi Lahren changed her position on climate change to appeal to misinformed conservatives. SHARE to spread her shame!   Video by Occupy Democrats, like our page for more!"},{"comment_id":"1569576153350573","commenter_b":"Oh, and your fat head out of women's uterine issues!","commenter_a":"The goverment has no right to interfere in a very personal decision, hard enough without some men thinking they can decide for us.","post_message":"Don't doubt him for a second..."},{"comment_id":"1510863505601322","commenter_b":"Probably the shittest article to ever feature on ifl, absolute horse shit","commenter_a":"Read the article! It should say vitamin pills are not necessary, a balanced diet provides all you need","post_message":"Some vitamins can actually be dangerous - but these are the ones worth taking, according to the available evidence."},{"comment_id":"10154145894181973","commenter_b":"I sure wish FB had an option to simply unlike a post.","commenter_a":"I have never been prouder to be an Oregonian. THANK YOU, protesters! WE ARE BETTER THAN DONALD TRUMP!!","post_message":"At least 200 protesters marched through downtown Portland and blocked lanes of Interstate 5 early Wednesday to voice their displeasure with Donald Trump's election as the 45th president of the United States."}]
