[{"comment_id":"10155129809471929","commenter_b":"These two ladies. Need to step down they showing how they are. Active. With their mouth","commenter_a":"Crack kills","post_message":"Speechless folks..."},{"comment_id":"1170752382944790","commenter_b":"You can choose at any time not to have sex. Women don't have that luxury when it comes to their menstrual cycle.","commenter_a":"So? We pay sales tax on condoms?","post_message":"Forty U.S. states apply sales tax to menstrual products. via GlobalPost"},{"comment_id":"10153506145308690","commenter_b":"and one manyetanyahu or whatever is his name of israel","commenter_a":"Arrest Bush , Cheney , Blair , Rumsfeld and all the WarCriminals !","post_message":"\"I wanted SA to arrest #Bashir. Not because of ICC, but more to see the shock and fear in the eyes of all the other African leaders.\""},{"comment_id":"644825525648235","commenter_b":"That doesn't matter he is evil to the core Common core Rotten Apple Treasonous Muslim at war with America","commenter_a":"The antichrist is supposed to be gay I was taught","post_message":"Former Breitbart Reporter: Why Did Obama Join “The Gay Club” at Occidental College? @webpagelink"},{"comment_id":"1260055474038645","commenter_b":"Wonder who will pay her and the teachers salaries, and provide security and law enforcement if all the \"white people\" leave","commenter_a":"Have you seen it ? They can have it.","post_message":"Chicago Teachers Union Karen Lewis This City belongs” To Black People And Not White People."},{"comment_id":"1837423903207723","commenter_b":"She speaks in a strange language called hooking and whoring.","commenter_a":"Jackie Kennedy: BA in Arts Hilary Clinton: graduate Yale Law Michelle Obama: graduate Harvard law Laura Bush: degree in eduction, Masters in library science Pat Nixon: worked odd jobs to put herself through college including sweeping the floor of a bank! Graduated with the equivalent of a masters degree from the University of Southern Cali. Lady Bid Johnson: BA in journalism from the university of Texas Nancy Raegan: drama and English major graduate of Smith Melania Trump: college dropout. Model, married her sugar daddy, excuses his misogyny as \"boys will be boys\" lies on command. I don't care if she's posed nude so long as she has integrity. If she's honest. If she's got a mind of her own. But she doesn't. And that's a problem. Yep. Awesome role model. AWESOME. 🙄 #GiveMeABreak","post_message":"Liberal or conservative, misogyny is misogyny."},{"comment_id":"10153158889713837","commenter_b":"Yes, where kids have easier access to that stuff...*smh*","commenter_a":"Thank goodness. Maybe the tide is turning. Where nothing has been off limits, fortunately Playboy has made the decision to no longer contribute to the filth that saturates the marketplace.","post_message":"NO MORE NUDES! Playboy magazine has announced that it will eliminate nude pictures from its pages. But it's OK, you only read it for the articles, right?"}]
