[{"comment_id":"10153553106522411","commenter_b":"Can i pee on you","commenter_a":"It's sad that in this age for a 15 yr old to be out she is automatically labeled! Times change hell its summer break maybe her parents actually trust her. It's sad that people are blind to the fact that the issue is the guns and not enough enforcement this Lil girl will never come back ever! We live in the number one city in homicide many people know this but few are willing to do something","post_message":"UPDATE: Chicago police are still looking for suspects in the shooting death of 15-year-old Veronica Lopez, who was a passenger in a car on Lake Shore Drive early this morning. Police say she's just one of the victims in what's turning out to be a violent Memorial Day weekend. LATEST DETAILS: @webpagelink"},{"comment_id":"1235922729753315","commenter_b":"This is why these people need to go back to mexico and let the Mexicans that earned their way here stay","commenter_a":"we need to start burning Mexican flags, and ship the free loaders back!","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"},{"comment_id":"10153523680568606","commenter_b":"God Bless ♡ Hearts broken♡","commenter_a":"It time to vote trump","post_message":"The remains of the four Marines gunned down in the Chattanooga attack were transported through Northern Virginia. @webpagelink"},{"comment_id":"10153362630049641","commenter_b":"Whatever tickles your fancy. Hope you get a free lifetime of ky jelly .","commenter_a":"This country is going to hell in a hand basket.","post_message":"The White House takes on rainbow hues to celebrate the Supreme Court's marriage equality decision: @webpagelink"},{"comment_id":"10153541842375329","commenter_b":"Kim has a nice body","commenter_a":"Who wore it better? Kim or Doug the Pug?","post_message":"Way to turn the tables, girls. (via BuzzFeed Trending)"},{"comment_id":"1001474073269501","commenter_b":"Muslims consist of .9% of our population. Bigotry around 20%","commenter_a":"I disapprove! He has caused nothing but destruction! The flooding of illegals and Muslims! They are murdering innocent Americans! Obama just sits back and enjoys the show. He lies about his crimes like Hillary does. I'll enjoy the show when Trump is president and arrests your ass!","post_message":"Do you approve or disapprove of the job President Obama is doing in office?"},{"comment_id":"10153539858966943","commenter_b":"Remove them all and start over!!!' No one connected in anyway to ANY family ties whatsoever should be allowed to remain in office ... Mass re-election for both democrats and republicans!!! These people are not American to continue sabotaging the hard working people of America! I don't go to work to pay tax to support ILLEGAL aliens!!!!","commenter_a":"take care of our unemployed that you as president have created then you might leave a legacy dumbass","post_message":"Next week the U.S. Equal Employment Opportunity Commission will sign a deal with Ecuador to Ecuadorian nationals with information, guidance and access to education and training resources to help them exercise their workplace rights. SHARE if you think the federal government should help American workers - not foreign workers!"}]
