[{"comment_id":"10154534701938271","commenter_b":"Those seven countries on which the president issued the TEMPORARY ban weren’t picked out by him. They were picked in 2015 and 2016… by the Obama administration. Trump doesn’t even list those nations specifically in his executive order, he simply lists that he’s banning those nations named in the Terrorist Travel Prevention Act of 2015. ---> @webpagelink Trump’s TEMPORARY order specifically states that only refugees from 7 countries with ISIS controlled regions. (Syria, Iraq, Iran, Libya, Somalia, Sudan, and Yemen) ONLY AFFECT 12% OF THE WORLD’S MUSLIM POPULATION","commenter_a":"President Obama issued an order similar to President Trump’s in 2011 in response to a discovery that a known terrorist had entered the United States via the nation’s refugee program. It seems that much of the country’s forgotten about that, though even President Obama, himself, apparently.","post_message":"Obama's statement said he is \"heartened\" by citizens' civic engagement, but reiterated that policies should not discriminate against people based on religion."},{"comment_id":"10154244362139411","commenter_b":"@username - Shut up bitch","commenter_a":"I can just see a flood of poor women getting pregnant so they can sell babies. What a terrible idea. Plus the fact that many which grew up in a state foster home become criminals if not adopted early","post_message":"'Chance to live'"},{"comment_id":"392182107608412","commenter_b":"He had a gun in front of him , h9w do you know his hands were uo you cant see shit . You fuckers are stupid to believe that its the cops fault or the military fault if not for either you fucking scumbags wouldnt have a place to trash , rob and i really can care less if you dont cosider me a fellow american if you believe that fuck was innocent your as bid of a piece of shit as he WAS dont even call yourself an american you fucking soft liberal scumbag go catch a bullet.and if you th8nk i cant handle a weapon then come up to ny and find out get the fuck out of my country and go fuck your allah in the ass","commenter_a":"Dont hate the cops, hate yourselves for breaking the law and being to stupid and lazy to get a job","post_message":"\"I ain't doing nothing. I'm not reaching for nothing, bro.\""},{"comment_id":"10154630388634877","commenter_b":"why is anybody still giving Conway any attention at all, unless it is because she is an alien from another planet?","commenter_a":"Ummmm, maybe because she hasnt done anything","post_message":"Is Melania Trump not getting enough attention for being an immigrant herself?"},{"comment_id":"10154726386446729","commenter_b":"Evil witch!","commenter_a":"Sonny Blaze, happy Sunday","post_message":"But yeah, she's supposed to be a role model."},{"comment_id":"974691752568165","commenter_b":"Lol.","commenter_a":"He has a point.","post_message":"\"You're a despicable human being.\""},{"comment_id":"10154099189924071","commenter_b":"Killary is an Embarrassment ,she evidently has no idea how to run an office Legally or with Class. What she poured into this election was ill gotten money. She sure didn't use her own. I Honestly feel her major Dissapointment is her self absorbed issues that would have only added more money to the Clintons Fraudulent Foundation . Being a Great Nation is now much more attainable without corrupt Killary and the rest of her lackeys.","commenter_a":"Wow. So much hate on these posts. I hear a lot of people upset about the protests going after she lost but it seems like there are just as many sore winners out there. Whether you like her or not, people need to learn some respect. I guarantee 99.9% of the people on here haven't the foggiest idea what it takes to hold a high ranking position in our government or run for president. She poured a lot of time and effort into her campaign and to still come up short must be a major disappointment. I'm sure a lot of people have done less and been more hurt by their own failures. I thought this was a country of conscience and good will. This election has proved we are much further from being a great nation than we claim.","post_message":"“I know that over the past week a lot of people have asked themselves if America is the country we thought it was.\""}]
