[{"comment_id":"758826910928758","commenter_b":"Those fucking bastards.....we gotta gut em, then kill them, then gut em again, then smoke a blunt or two and plant a tree and then maybe spread their entrails on our enemies lawn so they get the message.","commenter_a":"There's obviously some sort of mysterious group of people who have been trying to hide the advantages of the hemp plant to prouduce many of our products for everyday use.","post_message":"The solution seems obvious, doesn't it?"},{"comment_id":"1038357019610877","commenter_b":"If BERNIE goes Independent, or goes Green, then Good, Hillary is a bitch, a liar, a thief. BERNIE should do anything and everything he can to defeat the nasty bitch. #NeverHillary #BernieSanders2016","commenter_a":"We may still be able to achieve some things of value at the convention. Bernie's current top priority at the convention (as stated in a conference call with his delegates) is to change the Democratic party rules to 'un-rig' future Democratic primaries so they will be fair to future Democratic party presidential candidates. For him (and our delegates) to have any chance of making future Democratic primaries more fair via votes in the rules committee at the convention, we need to get all our pledged Bernie delegates funded. We are still at risk of losing over 100 pledged Bernie delegate votes, purely due to lack of funds. That's down from over 200 a couple of weeks ago because we have never stopped trying to get them funded. For everyone who is #StillSanders, can you please consider donating $2.70, $5 or $10 (if you can spare a few dollars) to help ...","post_message":"We are building a movement because this country belongs to all of us - not just a handful of billionaires and wealthy campaign contributors. And I'm asking people across the nation to come together and organize an unprecedented grassroots movement."},{"comment_id":"10153900140313487","commenter_b":"Nazis are big in SA. Very wealthy, and powerful","commenter_a":"'Baby' Hitler was beaten by his father, and though loved by his mother, she died young. Take away either thing and you have a different adult.","post_message":"What would you do?"},{"comment_id":"10153816653768854","commenter_b":"Did you see the gaggle of stupid white girls in the 'shield?' I wonder why they hate their daddies so much.","commenter_a":"All that money spent, all the debt incurred, to produce kids like that.","post_message":"Liberalism is a Mental Disorder: Professor of Media Threatens Media with Mob Violence for Trying to Film Protest  [VIDEO]"},{"comment_id":"10153721851426178","commenter_b":"People are waking up. They don't need TV or papers anymore,until the net is more strangulation than it is now, serious voters make up their own minds and look at all sides of issues important to them. They are no candidates that one can agree 100% with but at least there are many out there there one can reconcile most of their views with and throw support that way.","commenter_a":"I have no use for the networks...","post_message":"Despite being the biggest story in the pro-life movement since Roe v. Wade, the networks couldn't care less."},{"comment_id":"10158374011905206","commenter_b":"Sucks to suck Donald Duck","commenter_a":"Trump has created more jobs in New York than any politician, yet they screw with him because..... You know ..... Politics.","post_message":"The Attorney General ruled that the Donald J. Trump Foundation had been raising cash in the state this year when it wasn’t registered to do so — a violation of state law."},{"comment_id":"10154454599501162","commenter_b":"That lady is an idiot","commenter_a":"What the f @username Angela Lemonjello Caringella Care Re","post_message":"Harbor seal pup euthanized after being carried off a beach in a plastic shopping bag."}]
