[{"comment_id":"10153230993584342","commenter_b":"No. Lol. I would have done that too.","commenter_a":"The restaurant manager obviously handled the situation poorly. She waited too long to intervene and then did it in anger. That is unprofessional. BUT.... The parent who allows their child to disturb all the people around them trying to enjoy a meal is inconsiderate and selfish! The excuse that the child is waiting too long for food is poor at best. You as a parent and should come prepared to entertain your child... That includes providing them snacks and toys. The parents should have removed that child from the table within 5 minutes of the unresolved tantrum. Yes... I am a parent and never allowed that to happen. Remember that you are not the only person in that establishment spending hard earned money to enjoy a simple meal!","post_message":"DINER OWNER YELLS AT CRYING CHILD: \"I turned around, slammed both hands on the counter and then pointed at the child and said, 'This has got to stop!'\" said Darla Neugebauer, after she says a toddler cried for more than 40 minutes. The child's mother is furious. Did the diner owner go too far?"},{"comment_id":"10154101869331323","commenter_b":"He's a cunt !!","commenter_a":"Look at that mugshot! THAT is the face of a man who has just been caught doing, pretty much anything imaginable...","post_message":"Chancellor George Osborne is facing calls to reveal whether he has ever benefited from offshore tax havens after the prime minister bowed to public pressure over the Panama Papers by releasing a summary of his tax returns."},{"comment_id":"1001125933342993","commenter_b":"Poor little Ivanka, I wonder what her price tag was? High class whore!","commenter_a":"Michelle had bare arms and got criticized by Republitards. Meanwhile, Melania posed nude and Republitards were silent. It's that self-serving double standard once again!","post_message":"Would Melania Trump be a good First Lady?"},{"comment_id":"1493294134044387","commenter_b":"She is pure evil & should be put to death.","commenter_a":"Hillary is done the writings on the wall god look at the rallies know it's there for her no signs no bumper stickers no T-shirts and say Hillary for prison. She's a criminal and should prosecuted","post_message":"Wow!"},{"comment_id":"10154435925811509","commenter_b":"Stz! Sexually transmitted zombies","commenter_a":"This is it. This is how zombies start.","post_message":"CDC confirmed the first case of Zika virus being transmitted sexually in the U.S. Dr. Sanjay Gupta has been following this fast moving story closely and is here live to answer your questions. What do you want to know?"},{"comment_id":"1625393254140954","commenter_b":"This guy is a certified idiot!","commenter_a":"This Cummings punk is the king of demegogoury. The only person I find more dispicable is Chucky Schumer.","post_message":"The Democrats have been parodies of themselves for so long they fell for another parody."},{"comment_id":"10154246053623797","commenter_b":"They are being peaceful.","commenter_a":"No reason to protest. Have a vigil. Be peaceful!!","post_message":"#CHICAGO PROTESTS: Protesters swarm the Chicago Police HQ"}]
