[{"comment_id":"847481612018670","commenter_b":"Kick them out of the country,they do not deserve to live here! DEPORT!","commenter_a":"Deport them to Iran.","post_message":"OUTRAGEOUS: Little Muslim Rats At Public School Walk Out When NATIONAL ANTHEM Plays Do you agree they should be deported?! Share this EVERYWHERE if you do! @webpagelink"},{"comment_id":"10153473054219087","commenter_b":"Also you're basically saying someone who has the same democratic socialism plan as MLK Jr is a Marxist. Please don't insult the intelligence of Bernie Sanders supporters. We know the difference and you sir are just trying to fear monger ppl into thinking that.","commenter_a":"Perhaps Bernie will be made to answer tough questions on his absurd views on governance. Bernie Sanders: A demagogue is on the rise The populist fever is now running rampant. A demagogue is on the rise. His appeal is founded in the notion that the professional political class has both failed and ignored the plight of a disaffected but vocal minority. In terms of substance, he leaves much to be desired. In style, however, he captivates and inspires. On the debate stage, he touts his surging poll numbers, spouts unrealistic but tantalizing anti-elitist policy preferences, and berates the moderators for asking him tough questions all to the cheers of his committed band of malcontents. Noah Rothman @webpagelink","post_message":"CNN abruptly announced today that it will hold a town hall with the Democratic presidential candidates in Iowa on Monday -- one week before voters in the state head to the polls for the first-in-the-nation caucuses."},{"comment_id":"10153500362571770","commenter_b":"The world does not have a right to illegally enter the United States. The American people have appealed to Congress for years to secure the southern border so that we could then begin to address the issue of the illegals already in the country. That could have at one time meant some sort of arrangement for them to stay legally. But Congress did nothing because the WSJ, the Chamber of Congress and the business world wanted a supply of illegal, off the books, low wage slaves while others long for a utopian open borders world. It's time to bend our politicians to our will. We need to send the message, secure the borders or pay the price come election day.","commenter_a":"make sure they're all legal!!!","post_message":"A new coalition of Latino groups and labor unions aimed at stopping Donald Trump from becoming president will begin holding voter registration drives at high schools in battleground states."},{"comment_id":"1800107736923413","commenter_b":"FALSELY MY ASS... CNN ( CLINTON NEWS NETWORK) HAS BEEN LYING TO US (WE THE PEOPLE) FOR EIGHT YEARS! ENOUGH WITH POLITICAL PROPAGANDA, ENOUGH WITH PROPAGANDA. BRING BACK JOURNALISTIC INTEGRITY OR GET THE HELL OUT OF THE BUSINESS, WE WILL NOT GO DOWN THE ROAD TO SOCIALISM. WE WILL FIGHT, WE WILL WIN.","commenter_a":"Sieg heil!!! ;-)","post_message":"A free press is a pillar of democracy. So when Trump called CNN \"fake news,\" this Fox News anchor chose to stand by his fellow journalists."},{"comment_id":"1003687313057656","commenter_b":"The tears flow as I watch and read this... For all of you Christian Conservatives out there, REPUBLICANS IN CONGRESS PARTICULARLY, we need to open our hearts and welcome the Syrian refugees in, otherwise we cannot call ourselves \"CHRISTian\". The refugees will be vetted over a 2-3 year period ~ they're not coming tomorrow. Be compassionate ~ that is what we are about here in the USA, remember our quote on the Statue of Liberty, which was a gift to us from France (!), welcoming immigrants and refugees: \"Give me your tired, your poor, your huddled masses, yearning to be free.\" How about we practice what we're preaching with this message?","commenter_a":"Tears.","post_message":"Watch this and you will get chills. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"10153042525998984","commenter_b":"NO....NO...NO......WAKE UP AMERICA! Kick these bastards out now!","commenter_a":"should not happen take off the d-- hood","post_message":"I can't believe this is happening. It has already sparked a big public outcry. Please help us get the word out so this situation can be stopped."},{"comment_id":"10153174192806694","commenter_b":"Hate-watching is incredibly stupid and masochistic *unless* you're getting paid to do it, in which case I get it. I get why I09 \"hate-watches\" - it's part of their business. But how the hell can someone who isn't getting paid justify it? Lots of bored, boring, aesthetically masochistic, profoundly lonely people looking for attention I guess?","commenter_a":"Stop watching it if it's so bad","post_message":"And the one moment that exemplifies every single problem with the series."}]
