[{"comment_id":"10152900862242061","commenter_b":"Sounds awesome! This is funny. Did you post this recipe because he's/she's a fruit?","commenter_a":"I can't think of anything to comment so I'm just going to post a Blueberry - Strawberry Pancake recipe. 1 1/4 cups all-purpose flour 1/2 teaspoon salt 1 tablespoon baking powder 1/2 teaspoon baking soda 1 1/4 teaspoons white sugar 1 egg 1 cup milk 1/2 tablespoon butter, melted 1/2 cup fresh or frozen blueberries, thawed 1 cup of fresh or frozen Strawberries 1. In a large bowl, sift together flour, salt, baking powder, baking soda and sugar. In a small bowl, beat together egg and milk. Stir milk and egg into flour mixture. Mix in the butter and fold in the blueberries and Strawberries Set aside for 1 hour.A 2. Heat a lightly oiled griddle. or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve. EnJoy","post_message":"Caitlyn Jenner unseats Pres. Obama to become fastest Twitter user to hit 1,000,000 followers: @webpagelink"},{"comment_id":"10154969127953128","commenter_b":"@username just another feminist.","commenter_a":"when I go to a show I pay to be entertained , I don't pay to listen to the actors personal views or his GD views on politics.","post_message":"A central part of Donald Trump’s presidential campaign was his use of social media to weigh in on issues surrounding him – large and small – and he did it again on Saturday morning."},{"comment_id":"317547525326742","commenter_b":"To pay the illegals","commenter_a":"GREAT NEWS!! You just keep spiking those taxes..why stop there..RAISE TAXES ON EVERYTHING....YOUR GOING TO NEED IT! Besides..dont you left winged morons believe in taxing yourselves into welfare?? Good job!! GO CALIFUCKUP!!","post_message":"Robbing Peter to pay Paul..."},{"comment_id":"1166997406690286","commenter_b":"We also have an excess of employers giving jobs to illegals. So really we don't have an illegals problem we have an employer problem. If there were no jobs to be had there would be no illegals.","commenter_a":"I don't want more foreigner coming in. that is for sure.. but.. there are right now 10 jobs for every man women and child in this country.. way way more jobs than people.. way more.. so..","post_message":"Do you agree with Senator Sessions on this?"},{"comment_id":"1717745955143572","commenter_b":"This espn reportor gets paid to ramble about bullshit. Who would even take the moron serious?","commenter_a":"Typical ESPN liberal reporter has absolutely no respect or love of country,","post_message":"Should the Team USA hockey coach be fired for threatening to bench players who sit during the national anthem?"},{"comment_id":"1003201996389936","commenter_b":"Melissa Missael","commenter_a":"Merly Vivanco Albert Perez what a joke Ben Carson is. Lol.","post_message":"This one is for those who ever doubted Trevor Noah's ability to fill Jon Stewart's shoes."},{"comment_id":"10152821064059342","commenter_b":"^ they just don't have enough self control to keep from raping a woman unless shes covered apparently.","commenter_a":"Why do we have a muslim Capitol day?","post_message":"FBI RESPONDING TO MUSLIM CAPITOL DAY THREATS: Organizers say demonstrators are expected to protest against Thursday's rally. A spokesperson said the event began in 2003 and has never drawn opposition before, but this year online threats have prompted the council giving event to contact the FBI."}]
