[{"comment_id":"10153260031480095","commenter_b":"Please remove the ones that are already here and close our state's borders to all of them. This is a matter of defense, not of immigration.","commenter_a":"#LetThemInBobby Rescind your order! You are an embarrassment and I am ashamed of you.","post_message":"I just signed an Executive Order instructing state agencies to take all available steps to stop the relocation of Syrian refugees to Louisiana. The Obama administration continues to fail to provide critical information to state government or local authorities and has intentionally kept our state in the dark about their irresponsible refugee relocation plans. This is a matter of national security and a matter of Louisiana’s security. I will do everything in my power to stop this from happening."},{"comment_id":"1034820419922610","commenter_b":"Fuck her","commenter_a":"Oh please she has an easy life it's the soldiers and other people have it hard and uncomfortable not her","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"10153224449077293","commenter_b":"If it happens without her name on it, fine, but she still had no right to do what she did up to now and she has to get re-elected which I doubt she will. What she did was wrong and I hope she stays in jail. The nasty hag is going to be rich anyway because there's enough idiots out there to give her $$$.","commenter_a":"Simply put...it doesn't...","post_message":"The question has arisen before."},{"comment_id":"10158187868175203","commenter_b":"Boo hoo bitch","commenter_a":"The Dems aren't going to stop. They're working their agenda to undermine our Constitutional Republic, the rule of law, and our civil society: @webpagelink","post_message":"Trump defends his travel ban."},{"comment_id":"10153027652339753","commenter_b":"If a woman forces her self on a man it's rape","commenter_a":"How the hell does a woman rape a man? I have never understood this concept. Especially when he's \"asleep.\"","post_message":"She was pregnant with her third baby when she committed the alleged rape. But would her sentence have been tougher if she were a man? @webpagelink"},{"comment_id":"1038174059551348","commenter_b":"@username you are an Idiot and will never Learn !!","commenter_a":"Absolutely! Why don't you just fly away to that new mansion in Dubai, never to be heard from again.","post_message":"Yes, and you should be ARRESTED!"},{"comment_id":"10153461487831636","commenter_b":"If this woman is happy to make her money from demonising victims whoever they may be then perhaps the rest of us should just think \"what a vile individual she is\" and distance ourselves. What she has successfully done, again, is to spark a debate about herself . Which is probably earning her a fortune . Stop reading the Daily Mail for a start . Johnson was found guilty in court by a jury. Quite rightly the judgement was made on evidence and fact. Not opinion and scaremongering . Let's just stop giving her air time.","commenter_a":"WTH bloody Katie Hopkins ffs again innit???","post_message":"Her comments have sparked a particularly vocal backlash"}]
