[{"comment_id":"10153469428757144","commenter_b":"Those beautiful little WHITE girls are gonna be so bummed out when they come to understand that THEY are the minority. All that was missing in their routine was the Zeig Heil!","commenter_a":"\"Tomorrow Belongs to Me\"","post_message":"The internet is freaking out about this video. Watch it and you'll understand why."},{"comment_id":"10154448392979749","commenter_b":"You Muslims should pick your fight with our MPS who love starting wars to make their friends rich most English have no problem with the way you run your country and don't want to have war with you.","commenter_a":"The british people love very much to fight","post_message":"UK troops had been due to leave Afghanistan this year but will now have their mission extended into 2017."},{"comment_id":"10153658403039726","commenter_b":"OK !! There are 42,000,000 illegals in this country, squatting out \"anchor babies\" like cockroaches---WHAT\"S HIS PLAN.","commenter_a":"Carsons' stand on illegal aliens is almost as bad as obamas. Vote what's best for America---Trump.","post_message":"WATCH: Carson Jokes: I Heard Trump Dropped Out!"},{"comment_id":"1065696356784708","commenter_b":"and it is not round","commenter_a":"So the planet isn't flat.","post_message":"Find out what the world really looks like."},{"comment_id":"1432027056824713","commenter_b":"PUSSY","commenter_a":"Canada doesn't want these idiots any more than we do.","post_message":"Progressives always break their promises."},{"comment_id":"1494215257285326","commenter_b":"If ur here illegally you got to go. 100%.","commenter_a":"If you're here legally and ICE knocks at your door: Answer and say hello, you haven't broken the law so you have nothing to fear.","post_message":"ICE raids have resumed in several cities under the Trump administration, continuing to tear immigrant families apart and put whole communities in the target hairs. Thankfully, more and more people are getting aware and awake, and are hitting the streets to protect undocumented communities and protest raids, mass detentions, and deportations. Activists in many cities are holding \"know your rights\" trainings over the next several days - get involved in your city, and join the movement to protect immigrants and their families!"},{"comment_id":"1168788129800109","commenter_b":"******TRUMP..... 2016 **** DESTROY ISLAM AMEN....pass the ammo \"SWIPER NO SWIPING\" *no illegals voting Quote..DORA THE EXPLORER *BLACK LIVES MuRDER ...jokes","commenter_a":"Lol She should have to wear a lie detector at all time....that zaps her when she fibbs","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"}]
