[{"comment_id":"963433877025367","commenter_b":"DICKHEAD","commenter_a":"Do not support his movies. He will have to stop acting. Rotten person","post_message":"Shocking!"},{"comment_id":"1769093619989896","commenter_b":"Send them all back across the border, they'll never get away with this crap in Mexico, they'll shot them there","commenter_a":"'America was never great.' Then why the fuck are you here?","post_message":"Blood flows in San Jose, California as Mexican flag-waving anti-Trump radicals attack Trump supporters, rip up American flag, chant 'Mexican Power!'...'America was NEVER great!' PHOTOS...VIDEO..."},{"comment_id":"10153224075406336","commenter_b":"I'm upset about it too, but let's take a look at our current President. He's stomped on the US Flag toward other nations apologizing for Americas stance for years on policy. He just keeps stomping and we just keep believing lies and hypocrisy.","commenter_a":"What a disgrace to our country!","post_message":"A new social media 'challenge' is encouraging people across the country to disrespect and stomp on the American flag."},{"comment_id":"10153982625649087","commenter_b":"Nobody cares that she wants to redistribute their money to the millions and millions of illegal alien Freeloaders and refuess","commenter_a":"Trump needs to start hammering Hillary Clinton just like Bernie Sanders did","post_message":"Donald J. Trump lashed out at former CIA Director Michael Morell after he announced his support for Hillary Clinton and said Russian President Vladimir Putin 'played' the Republican nominee."},{"comment_id":"10156612932690354","commenter_b":"Washed up schmuck","commenter_a":"The difficulties were not due to him being black.","post_message":"WATCH Geraldo Rivera blame, well, YOU for Obama's failed presidency!"},{"comment_id":"1763482420575354","commenter_b":"'@username your savor is going back on his own immigration stance. He was so bold at first, but now he's retreating lol. #typicalChump","commenter_a":"'Today in his Mexico press conference, Donald Trump lied about discussing how to pay for his wall with the Mexican president. Trump has boasted for months that he is going to get Mexico to pay for his ridiculous wall but when he came face to face with the Mexican president he got out maneuvered and then tried to cover it up on worldwide TV. Simply put, Donald got rolled. It turns out Trump didn just choke, he got beat in the room and lied about it.'","post_message":"Hillary Clinton didn't go to Louisiana, and now she didn't go to Mexico. She doesn't have the drive or stamina to MAKE AMERICA GREAT AGAIN!"},{"comment_id":"794164403965442","commenter_b":"F%%+ white people !!!","commenter_a":"This is why I hate white people!!!","post_message":"In an update to our previous coverage; ASU Police Officer Stewart Ferrin's administrative leave has been extended. His case was passed over to the new ASU Police Chief who will decide on the officer's fate."}]
