[{"comment_id":"10158335910850389","commenter_b":"California LARGEST INSANE ASYLUM IN THE WORLD Written by Chuck Garner on January 23, 2017 6:00 am - Interesting that the LA Times did this. Lou Dobbs reported this on CNN and it cost him his job. The only network we would see this on would be FOX. All the others are staying away from it. Whether you are a Democrat or Republican, this should be of great interest to you! Just One State be sure and read the last part try for 3 times. This is only one State If this doesn open your eyes, nothing will! From the L.A. Times. 1. 40% of all workers in LA County (10.2 million people) are working for cash; and not paying taxes. This is because they are predominantly illegal immigrants, working without a green card. (Donald Trump was right) 2. 95% of warrants for murder in Los Angeles are for illegal ...","commenter_a":"\"Alternative President Donald J. Trump\" you've been in the The White House only a week and already you're a total failure and made a complete fool of yourself so no wonder you LOST the popular vote and had such a SMALL crowd at your inauguration....by the way Mr. Alternative President you are delusional and need mental health treatment so please get some professional help before your words or actions are responsible for killing people....","post_message":""},{"comment_id":"1160971703940168","commenter_b":"BULL$H!T","commenter_a":"Then the black community should stop committing more than half of the crime in this country and start acting like civilized human being.","post_message":"\"Would this have happened if those passengers would have been white? I don’t think it would have.\""},{"comment_id":"1424339400924900","commenter_b":"Why would she want to debate that arrogant old man?","commenter_a":"I heard that it is against DNC rules for this type of debate. Sanders has become irrelevant and desperate - so sad - he could have created a legacy instead of angry tantrums","post_message":"He just called Donald Trump's bluff."},{"comment_id":"928522093922469","commenter_b":"The plans he has put in place, is FILL AMERICA WITH MUSLIMS AND ILLEGALS....\"GROWTH OF THE ECONOMY IS HIS MUSLIMS AND ILLEGALS IN PLACE FOR A WAR\" SO HE DOESN'T HAVE TO LEAVE THE WHITEHOUSE......WHY DO YOU THINK HE SAID HE WAS GOING TO STAY IN WASHINGTON FOR 2 MORE YEARS, SO \"SASHA\" COULD GRADUATE THERE? HE SURE IS NOT GOING TO PAY THE COST OF HER SCHOOLING OUT OF HIS POCKET....... WAKE UP, AMERICA....THE REASON HE IS NOT IMPEACHED, IS BECAUSE MOST OF THE ONES WHO WOULD HAVE DONE IT, ARE NOT AMERICANS, BUT ARE MUSLIMS.....","commenter_a":"To have a strong economy you need more Americans working and Obama's policies stand in the way of Americans going back to work again. Obama did place an incentive for employers to hire new workers BUT he also put a heavier tax burden on employers to keep their new hires.","post_message":"WATCH Obama:  is pretty darn great right now, and making strides right now...And I don expect that these facts and this evidence will convince some of the politicians out there to change their doomsday rhetoric"},{"comment_id":"10153046284854705","commenter_b":"I wish someone would put that pig back in the barn and close the door. I'm sick to death of her nasty face.","commenter_a":"Who would buy that! ?!","post_message":"Kim Kardashian just out-Kardashian-ed herself."},{"comment_id":"10152783930412293","commenter_b":"Tom terrorist deserve to be pooped on and have there have there heads cut off","commenter_a":"I could hv done the same thing..those animals hv no respect for life so u respect them in death?","post_message":"The story of a Marine sniper, dead at 28, and the 38-second video clip that became part of his legacy."},{"comment_id":"606850699417060","commenter_b":"What a pussy","commenter_a":"Remember these Libatards,I never forget !","post_message":"List Of 31 Democrats Who Will Be Giving Netanyahu The Middle Finger, SKIPPING His Speech ⋆ UFP NEWS... @webpagelink"}]
