[{"comment_id":"405687699555825","commenter_b":"They all do it, he was just to stupid and got caught.","commenter_a":"SOP,,,,,since forever!!!! Most all are getting away with it and have since day one!!!!","post_message":"How many politicians are getting away with this every day?"},{"comment_id":"10153042525998984","commenter_b":"NO....NO...NO......WAKE UP AMERICA! Kick these bastards out now!","commenter_a":"should not happen take off the d-- hood","post_message":"I can't believe this is happening. It has already sparked a big public outcry. Please help us get the word out so this situation can be stopped."},{"comment_id":"1544777802496810","commenter_b":"i smell a rat and it's not trump and his wife. ignore them,","commenter_a":"Are we still talking about this? Oh Glenn, you've lost your way!","post_message":"She has been done a grave disservice by somebody."},{"comment_id":"10153305166698984","commenter_b":"Please! Just let her go away!!!!!!","commenter_a":"18 U.S. Code 2071 - Concealment, removal, or mutilation generally (a) Whoever willfully and unlawfully conceals, removes, mutilates, obliterates, or destroys, or attempts to do so, or, with intent to do so takes and carries away any record, proceeding, map, book, paper, document, or other thing, filed or deposited with any clerk or officer of any court of the United States, or in any public office, or with any judicial or public officer of the United States, shall be fined under this title or imprisoned not more than three years, or both. (b) Whoever, having the custody of any such record, proceeding, map, book, document, paper, or other thing, willfully and unlawfully conceals, removes, mutilates, obliterates, falsifies, or destroys the same, shall be fined under this title or imprisoned not more than three years, or both; and shall forfeit his office and be disqualified from holding any office under the ...","post_message":"Wow. One of Hillary's first moves as a candidate may be the one that kills her campaign... Do you hope Hillary loses?"},{"comment_id":"10153438712476636","commenter_b":"Good start but we need a lot tougher laws for the sex offenders especially the pedophiles and rapists.... If there is a country to deport them to then fine, if they are British I think we should start new colonies on the barren islands around the uk.","commenter_a":"Hear hear.....send them all home,BLAGGING no good scumbags. Thank god a bit of sense at last they have been taking the k Piss of our system too long","post_message":"Exclusive: Theresa May's response to the uncovering of sex abuse gangs"},{"comment_id":"1015110755212120","commenter_b":"Stand tall Hillary!","commenter_a":"We got your back @username our next president of the United States of America !","post_message":"Send Hillary a message of support as she heads into the #DemDebate."},{"comment_id":"10154156442975443","commenter_b":"We did trust remember all Far East and then look what happened American trained Far East pilots flew their planes into our building now because of ISIS we need to take measures don't take all this personal and if ISIs does get in who will be at fault well oh a big war and then how will you feel this is what happened we are too trusting this has nothing to do with RACE do you all have better way to stop this","commenter_a":"One brave Judge saved Muslims from being discriminated against contrary to the constitution. We really need some brave republican congressmen to save America from heading into disaster by stopping this man making hate and racism a normal thing. What we have seen so far and just today banning CNN and The New York times is no joking mater.","post_message":"\"The situation seems to be pretty bad after Trump took over as the U.S. president.\""}]
