[{"comment_id":"10156148528265725","commenter_b":"Trump has the mentality of an 8 year old class bully","commenter_a":"Suzanna Mikolajczak Trump is a Beast","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."},{"comment_id":"10153139427330329","commenter_b":"Jajajaja es el actor secundario N1","commenter_a":"que wea braaaad.. sale hasta en la sopa el ql ajajja Carolina","post_message":"Here is the new Magic Mike trailer. You're welcome."},{"comment_id":"10152595015514071","commenter_b":"Everyone's saying about larger women.. Have any if you thought that some girls are blessed with a small back but large boobs!","commenter_a":"Good!!","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."},{"comment_id":"10152853063786748","commenter_b":"Know what, dude, if you and Obama went to a lunch counter in the deep south in the '50s, you would both stand an equal chance of getting abused and assaulted. And if the right wing scum you shill for ever get back in power, you'll find yourself right back in the 'separate but equal' category tout suite. :P","commenter_a":"right. cause Alan West is the epitome of \"blackness\"","post_message":"Right-wing pundits claim Obama isn't *really* a black American"},{"comment_id":"1262054097174477","commenter_b":"Ann coulter is a real bitch period","commenter_a":"You are one Bitter woman and no one in your life to love or who loves you. I know being 52 is hard but please dont take out your bitterness on other people. They are passionate in their believes. Let them be and go find yourself a man. it will help I promise.","post_message":"Controversial conservative figure Ann Coulter took to Twitter on Thursday, attacking protesters who continue to reject president-elect Donald J. Trump ."},{"comment_id":"842693252541388","commenter_b":"Go pound sand Joan","commenter_a":"WOO HOO!! #CRUZ4PRESIDENT!!","post_message":"Thank you Governor Mike Pence for your support! #ChooseCruz: votetedcruz.com/in"},{"comment_id":"626305930908697","commenter_b":"@username Yeah, those toddlers with guns are out of control right now.","commenter_a":"I blame Obama and Bush, Bill and Bush snr for forever labeling all Muslims as terrorists . they didnt know that by doing so they created further hate for Muslims in america and this is the result","post_message":"Kim Kardashian West made her opinion known (via Daily Mail Celebrity)"}]
