[{"comment_id":"10154456330994445","commenter_b":"I'm a female! Hilary needs to stay home and crochet something ya crazy hag","commenter_a":"I notice most of the haters of Hillary are men, you must have Momma issues!","post_message":"President Obama made the case for Hillary Clinton, saying there there's no other person more qualified for the most powerful office in the world. @webpagelink"},{"comment_id":"1756788254541132","commenter_b":"Calmate gueys!","commenter_a":"I'm Mexican. 100% computer engineer. I break 115k a year. Lol. I guess I did take a white man's job!","post_message":"WATCH: Immigration protesters from the Puente Human Rights Movement shut down a portion of Central Ave in Phoenix, near McDowell. They're upset with today's Supreme Court decision that overturns President Obama's plan to protect illegal immigrants whose children were born in this country."},{"comment_id":"10157013356035500","commenter_b":"Sure they do. After its dead. Please! Lol","commenter_a":"They are checking the contents of the stomach of the gator to see if there are any human body parts. They do this by gastric lavage.","post_message":"BREAKING: Officials have captured a large gator at the lake and will examine the gator stomach contents to see if there are human remains. Read more: @webpagelink"},{"comment_id":"1286627034690657","commenter_b":"Nope she will lose","commenter_a":"Hillary Clinton the next President of the United States.","post_message":"'WE HAVE A VERY SERIOUS PROBLEM' Hillary Clinton points out a striking divide in the criminal justice system in America during Sunday's NBC News-YouTube #DemDebate. Catch all the highlights here: @webpagelink"},{"comment_id":"1708950036028896","commenter_b":"@username I have a problem with Mexicans coming back even after the wall is built. What they did to this country is almost irreparable damage, it's overwhelming, and the amount of people they killed is staggering. You NEVER read about an American killing a Mexican. But you do read the opposite. You can't take the illegal out of an illegal. They will always be a dark cloud of problems to any society they get it. They can't change, they're programmed that way. They will bring virus' disease and plunder. Even the ones running their country a derelicts of the 3rd kind, their intent is to make America part of Mexico, that's why they send them, that's why they don't assimilate and want YOU- (Americans to assimilate) ...(google \"The RECONQUISTA / Mexicans say they will take America without firing a single shot\")..this is why Vinente Fox and Jorge Ramos are trying ...","commenter_a":"The role of our government is to keep its citizens safe.....sadly they are failing \"A house with no walls will collapse\"","post_message":"“This is something that’s happening almost on a daily basis now, that we have illegal immigrant criminals that are committing murder or rape or numerous child predator type actions.” – Steve Ronnebeck"},{"comment_id":"10152577391880047","commenter_b":"it is only the beginning of America rising up against it's enemies...all of them...","commenter_a":"This needs to be permanent!","post_message":"BREAKING: Federal court temporarily halts President Obama's illegal Executive action on immigration. Read and Share how the court agreed with our legal arguments in holding this imperial presidency accountable: @webpagelink"},{"comment_id":"1695714467362766","commenter_b":"You must have missed the fact that two pedophiles are involved in this legislation. One had to back down and the other is going strong. Has nothing to do with mixing anything up. It's the consequences and the perverts backing this type of legislation. Are you going to day pedophilia is okay now?","commenter_a":"Has a \"sign\" ever stopped a pedophile before?? No. Classifying transgender and pedophiles in a group together is just so wrong. Boys are sexually abused at double the rate girls are so why is everyone not up in arms for their sons? And statistically pedophiles prey on children they know. Family members/close friends not random children in a public bathroom. What does it matter what parts the person in the next stall over does or doesn't have? There in there to pee just like you and go on with their life! Thats my two cents on the whole subject! But apparently many people feel so differently and even though I don't understand it I respect that not everyone agrees!! I do however feel so heartbroken for the entire transgender community whose repeatedly being compared to pedophiles.","post_message":"\"This means a man can simply say he 'feels like a woman today' and enter the women's restroom... even if young girls or women are already in there,\" stated the American Family Association, which started the petition."}]
