[{"comment_id":"483464435177470","commenter_b":"Fuck you cunt lips","commenter_a":"The reason you are seeing her all of a sudden is to take the heat off of Obama . When thing get sticky with Obama his handlers bring out Michelle, or Biden. It is to take our minds off of Obama. Don't be fooled, Michele has no power, she is a fixture . I would venture to say she and her husband have very little to do with each other. It's for the television camera only. She was bought and paid for just like he was but her thing is just until he leaves office..","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"730165010456352","commenter_b":"@username I love women who are well read xxx","commenter_a":"Is price to paid, for this people, crazy,terrorist! ! I don't blame cpd.just keep us safe!!","post_message":"One minute a Chicago Muslim woman was running to catch her train. The next, she was tackled by Chicago police, and it didn't end there. Itemad \"Angel\" ALmatar said she faced more humiliation at the hands of police before being arrested."},{"comment_id":"880543368756744","commenter_b":"@username ok women let karma take care of me .","commenter_a":"I hope the teen's parents pay for everything for what this family went through. Yes it is the parents fault for not controlling their little shits.","post_message":"The husband of the Ohio woman left brain damaged after teens threw a rock through the windshield of her moving car has committed suicide."},{"comment_id":"10153686445776336","commenter_b":"Any illegal here who has family Who is here legally, the LEGAL family should be hit with a fine/special additional tax to pay for their illegal family here!","commenter_a":"Deport illegals! And all the money that are spending for them should be given to our vets!! Trump is the one who cares about Americans!","post_message":"\"Right now — and you know it — we have illegal immigrants that are treated better, by far, than our veterans.\" – Donald J. Trump (via Fox Business)"},{"comment_id":"10153585908813984","commenter_b":"See it turning into a Muslim state.lets wipe out all history.","commenter_a":"This is the stupidest bluff I have ever heard! Deny the NAACP and all they can do is hurt themselves. What's next? B.E.T. threatening to go off the air?","post_message":"The NAACP just made a stunning demand about this historical monument... this is shocking move. Nobody thought they would go this far... What do you think about the NAACP's demand?"},{"comment_id":"10155143983283010","commenter_b":"GIRL WHY YOU MUFASA","commenter_a":"Ben Rotherham GAMBI AS SIMBA THIS IS NOT A DRILL","post_message":"James Earl Jones is reprising the role of Mufasa, and Donald Glover is taking on Simba."},{"comment_id":"10153266437101336","commenter_b":"Real biker gangs are way more dangerous than the pretty actors on that show made them seem.","commenter_a":"They all must have watched a marathon of Sons of Anarchy this past weekend","post_message":"UPDATE: Police adjust the number of people arrested from 192 to 170. \"This is probably one of the most gruesome crime scenes I've ever seen in my 34 years of law enforcement.” – Waco police Sgt. W. Patrick Swanton @webpagelink"}]
