[{"comment_id":"921974804515254","commenter_b":"my favorite teacher was/is Mrs Cathy Zavacky-Barrek. She was my kindergarten teacher and I was a cry baby.she always made me feel comfortable and loved away from my mommy....The sweetest teacher ever, nice, loving, but also had control of her class...","commenter_a":"My favorite teacher was in 6th grade. He believed in me when I felt like no one else did- may he rest in peace. My favorite college professor (also my academic advisor) helped guide me along the path I needed to be the first in my immediate family to get a Bachelor's degree (thank you for that Bob)","post_message":"What stories do you have about YOUR favorite teacher?! #NationalTeacherAppreciationDay"},{"comment_id":"1260728277356755","commenter_b":"Can we talk about your taxes Trump and some of your wife's well kept secrets since you are always pointing your finger at everybody else!!!","commenter_a":"Instance 302-A when Trump is actually projecting himself.","post_message":"\"She also lacks the mental and physical stamina to take on ISIS and all of the many adversaries we face.\" - Donald J. Trump questions Hillary Clinton's health"},{"comment_id":"10152668576767377","commenter_b":"And Hillary is a broke down bus","commenter_a":"ted needs to take a cruise, maybe to the north pole. maybe, he and santa can go ride a reindeer, and build some toys together.","post_message":"Why Ted Cruz is the Strongest Candidate for President in 2016."},{"comment_id":"10155546384855192","commenter_b":"Don't worry God would not choose an unworthy Woman to Have His Child. People no matter how much they serve Christ can still go through very hard times. He didn't say because you love Him, and serve Him that life would be easy.","commenter_a":"First of all to those that say praying won't help them.....You better understand that they don't worship God, or believe Jesus Christ died for their sins. Maybe that is why their world was shaken. God isn't playing. These are the end times. They need to stop the things they do, and accept Jesus Christ in their hearts.","post_message":"The death toll from Nepal's earthquake soared past 3,700 Monday and rescue workers are still struggling to reach two days after the disaster."},{"comment_id":"1764917753728484","commenter_b":"Not!!! When she decided to make \"her\" body a home to another human being it stopped being \"her\" body and it became \"their\" body. And as that other human being is incapable of making decisions for itself, that dumb cunt sucking poisons into \"their\" body should be jailed until the other human being is freed. Then the dumb cunt should be put in an air tight room and have the exhaust of a semi pumped into it.","commenter_a":"No,it's not her choice.Since it's obviously to late for an abortion,and she cant' control her substance abuse;she should be incarcerated until the birth of the child.The child should be then taken from her and given the best possible foster care. Hopefully the child is ok.In any case,she should be charged with child endangerment at the very least and remain incarcerated until she's no longer able to reproduce.They should also find the father of this child to find out if he is either complicit in this endangerment or is morally able to care for the child.","post_message":"What do you think? Join Us: The Free Thought Project"},{"comment_id":"10153071798041051","commenter_b":"What a bitch","commenter_a":"Stupid! !","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"10153588391460667","commenter_b":"@username: you basically need a nice warm cup of shut the hell up.","commenter_a":"Don't feel sorry about those ... These soliders maybe killed 300 kids and 300 from elderly people in Palestine , but we say Islam say don't kill innocents people even from your enemy ...","post_message":"\"Terror will not silence us, we will return to work tomorrow,\" Tel Aviv Mayor Ron Huldai said."}]
