[{"comment_id":"10155971884414062","commenter_b":"You wouldn't even bow down to GOD himself but to some woman who 'claims' African goddess with Indian woman hair.. okaaayyyyy","commenter_a":"I take this performance highly offensive! There is Only One King and that is Jesus Christ! #Stepdown!","post_message":"This was the first glimpse of Beyoncé since her pregnancy announcement hit Instagram at the beginning of February.  Winners' list: @webpagelink Photos: @webpagelink Full GRAMMY coverage: @webpagelink"},{"comment_id":"10156250216360354","commenter_b":"Twisted woman","commenter_a":"So, she is trying to say she is with them as a fellow commie? I think someone farted.","post_message":"Yeah, so, um, this happened..."},{"comment_id":"10152732275938645","commenter_b":"fat a** hoe.","commenter_a":"Report me all you want trick","post_message":"The victim said the attacker threatened her during the rape, saying he knew where she lived and would return to kill her if she called the police."},{"comment_id":"10154997509084626","commenter_b":"YOU ARE AN INSULT TO ALL WOMEN","commenter_a":"The embryo inside you, is not your body","post_message":"LIVE STREAM: Women's March on Washington"},{"comment_id":"10153470437544726","commenter_b":"Send her ass packing!!!!!!","commenter_a":"She's from florida and hates america. Go away!","post_message":"WATCH: Ariana Grande: 'I Hate America, I Hate Americans'"},{"comment_id":"10154014604746680","commenter_b":"TRUMP AGENDA 2017 Make America great again. Close the borders. Build a border wall. Make Mexico pay for it. Deport all illegals. No amnesty. Lower taxes/a fairer tax plan. Stop trade deficits with countries. Bring American jobs back. Create new jobs. Fix the broken VA care system. Take care of our wounded vets. End NAFTA and other trade deals. End the Trans Atlantic Partnership. End the North American Union Deal. End obamacare. Rescind all illegal executive orders. End all illegal executive gun rights legislation Make better deals, fix the broken Iran deal. Blow ISIS to hell, no deals with terror. Strengthen and support our military. Put America and Americans first. Balance the out of control budget. Cut government, make it stay within its budget. Get rid of the deficit.","commenter_a":"Everyone knows that there has never been a link between Islam and radicalisim, right?","post_message":"Critics say Mike Flynn and Steve Bannon represent 'Islamophobic' thinking of the type rejected by Bush and Obama."},{"comment_id":"10153256940195736","commenter_b":"God forbid we put them in shelters and feed them.","commenter_a":"I have advocated for helping the homeless for a decade but it has gotten out of hand over the last couple years...which is to be expected, given we've mostly ignored the problem. These folks belong in Wapato and Wapato needs to be converted into a mental health care site.. They commit crimes against society -- leaving garbage around is just a visible symptom but when folks aren't looking, they misbehave in more destructive ways. They need to be 'rebooted,' in the computer sense, not the kick-in-the-pants sense. Though some of them need that as well...","post_message":"Mayor Hales said today was the first of several in which the homeless will be moved out of city parks."}]
