[{"comment_id":"10153380056966770","commenter_b":"Get rid of Obamacare and the illegal aliens!","commenter_a":"I so despise Hillary Clinton. Why don't they indict her already.","post_message":"Hillary Clinton wants to use Obamacare to provide health coverage for illegal immigrants."},{"comment_id":"1829950227225236","commenter_b":"William, true but there were two shots to the head though.","commenter_a":"These are the kind of people that 'commit suicide' with two gun shots to the back of the head.","post_message":"He joins a host of whistleblowers who have been saying this for YEARS!!"},{"comment_id":"10153009843726378","commenter_b":"A female can't be a predator","commenter_a":"So if a forty year old woman had sex with your sons you'd cheer him on and joke? What about a forty year old man that had sex with your 15 year old daughter? Because according to these comments no one cares about female predators.","post_message":"GUILTY PLEA: A former Baltimore Ravens cheerleader pleads guilty to raping a 15-year-old boy."},{"comment_id":"10158240785950641","commenter_b":"LETS GO BACK TO ..WHEN AMERICA WAS WHITE","commenter_a":"I love president Trump","post_message":"Happening Now: Judge Jeanine Pirro delivers remarks at #CPAC2017."},{"comment_id":"1300696676663751","commenter_b":"Fuck yo bitch ass fuck you too pussy","commenter_a":"Fuck Donald Trump orange ass","post_message":"Clearly wasn't feeling the jersey!  #WSHH #WakaFlocka"},{"comment_id":"10152656496006680","commenter_b":"No Hillary, 'JUST YOU!'","commenter_a":"Loretta Lynch is another clueless, racist, who will follow Eric Holder with more bad decisions, race baiting, and support for illegal aliens, as indicated by her actions on the bench and answers to questions during confirmation proceedings. She should absolutely be voted down.","post_message":"Clinton’s social media outburst comes after Loretta Lynch has been waiting for Senate confirmation for 128 days."},{"comment_id":"809566335745494","commenter_b":"So women are just as bad as men, better just keep it men. Got it.","commenter_a":"Sorry but all woman in politics have proven just as deviant and en n efficient as men. So let's not rush anything. They should be recognized for there merits. So are the men that have no connections and money. But stile do amazing work","post_message":"Powerful."}]
