[{"comment_id":"788608041305150","commenter_b":"Seems like a good time to turn off the tap to these law breaking cities. Go Trump!","commenter_a":"STOP THE INSANITY! Defund them and arrest those in charge that are breaking the law!","post_message":"A new study shows that more than 100 sanctuary cities across America received a total of $27 billion in federal grants and direct payments in one year."},{"comment_id":"10154759698326509","commenter_b":"Then no sex allowed","commenter_a":"What if you're bulking","post_message":"You're human, so chances are, you're interested in getting more sleep, having better sex and improving your mood..."},{"comment_id":"10152833752231130","commenter_b":"Hell yea older woman know what's up:) Amber Gray","commenter_a":"Lol. Ian.","post_message":"Yet women prefer to be younger than their partner."},{"comment_id":"1105849479462885","commenter_b":"She kills people and babies why would she care about a beautiful animal she has more money in her family clinton foundation to buy the farmer a new farm. Shes a disgrace .how can people turn a blind eye to what she has been doing to our country.Theres PROOF.SHE HATES AMERICA. SHE LIKES OUR MONEY ..THATS IT","commenter_a":"Love it!","post_message":"I can't believe THIS!"},{"comment_id":"1836299966658207","commenter_b":"Damn @username is just as bad as those UNAmericam bitches","commenter_a":"Hey whoopie knuckle dragging Goldberg, I thought you were leaving if Trump got elected, get the fk OUT of OUR COUNTRY and take your brainless bimbos with you!","post_message":"Things got CRAZY on the set of 'The View'  when one host went completely over the edge, and then demanded that Donald Trump do the unthinkable. Viewers could hardly believe it..."},{"comment_id":"1547989355230019","commenter_b":"'@username I hate Hillary but when you say she killed four people you sound crazy.","commenter_a":"Wow all these libtards hating on Hannity. What about all your bais media reporters? ??? They bend over and let Hilary use her strap on to them Cnnn already said Hilary won the next debate . When she didn't win the last . Is he going a little overboard yes. But let's face facts , if he was saying the same things about Hilary. He would be a genius in your eyes.","post_message":"What a week."},{"comment_id":"521921487998431","commenter_b":"she's a no good racial bitch","commenter_a":"Typical for ghetto trash","post_message":"Michelle Obama just dropped spent an absurd amount of money on something outlandish.  She is the worst first lady ever. We miss Laura Bush.  Does Michelle Obama's reckless spending upset you?"}]
