[{"comment_id":"10154268012211336","commenter_b":"HURRY UP AND OD, MAKE AMERICA PROUD, FIDDY THENTS.","commenter_a":"50 cent. Ironically, that's also what his career is worth.","post_message":"In a video posted on Instagram, 50 Cent confronts a young man as he pushes a cleaning cart through the terminal and accuses him of appearing to be high on drugs."},{"comment_id":"1001556806534263","commenter_b":"A vagina is a sex organ. A boob is not. Stop comparing them.","commenter_a":"Society uses breast on ad to sell cars, burgers and every shits they want but when it comes to the natural uses, which is feeding a baby assholes loses their minds ? Should think twice before saying women who breastfeed don't have respect for themselves. What did our mothers/grandmothers did before powdered milk ?","post_message":"Women are brilliantly standing up to breast-feed shaming. Read a powerful example right here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"10153055222394877","commenter_b":"Wrong! I've awakened with someone riding on my dick..The dick can get hard without you even knowing it... while you're asleep. Duh. Ever heard of a wet dream!","commenter_a":"Rape is rape, no matter the gender of the rapist and they all should get equal servere punishment. She deserves more than 9 months tho.","post_message":"Mother of 3 arrested for breaking into a man's apartment and raping him while he slept. Grio fam, if she was a man do you think her sentencing would have been more severe? Sound off below!"},{"comment_id":"1068619743164680","commenter_b":"why 'send' them anyplace? Just teach our history & proper methods, uphold the laws of our nation, put teeth n the laws n place, cut off the welfare & they will leave....don't waste any more $ on them....well...maybe a 1-way ticket!","commenter_a":"Gutless flag burner won't show his face Cowards","post_message":"The nerve that Rudy Giuliani touched this week is not merely Obama's anti-Americanism; it is the anti-Americanism of the progressive left."},{"comment_id":"10154573950249411","commenter_b":"Wow, it's funny how Democrats claim to be the party of love and tolerance but all her supports sound like you, ignorant!","commenter_a":"Way before this his own party should have replaced this dumb ass! And his dumbed down supporters have only remarks about Clinton whenever this ass wipe says and does something outrageously stupid! Shows they have the same low mentality as Trump! Trump doesn't have the smarts or the temperament for this position. Anyone who would want this dummy anywhere near some nuclear button are just as delusional as Trump or just as dumb and sure don't give two shits about this country! Trump will never ever be president of this country and we can look forward to one of the biggest meltdown and temper tantrums from this maggot!","post_message":"Case study: When mainstream media morphs into political activists."},{"comment_id":"921881311183439","commenter_b":"Obama go home to Kenya. Illegals go back to countries you came from. Need to help our own not illegals who drain our economy and increase our national debt......","commenter_a":"Dumbama suck donkey dic","post_message":"Will you accept Obama's latest \"order\"?"},{"comment_id":"389420827906465","commenter_b":"Tony, Many of today's pillars of righteous GOPer's come from illegal entry to the U.S. We often forget the illegal passage of our Italian, Irish, English, ancestors. You know the \"mention pot\". Key word that you are ignoring is RACISM. Hope that's not you, but it sounds like it might be. Have a good day !!!","commenter_a":"In a Nation of immigrants,mi would expect nothing less. The reactionary GOP is just plain backwards and have forgotten our heritage.","post_message":"President Obama has their back."}]
