[{"comment_id":"835588663194002","commenter_b":"As I was reading this article and the comments it evoked, which as a believer I support 100%, this thought came to me - what's to prevent a Godless government from forcing churches to perform gay marriage ceremonies much as they've strong armed bakeries and wedding venues?","commenter_a":"They will have to be married @ the Justice of the Peace. You can't force ministers, priests, rabbis, etc to marry them.","post_message":"The Supreme Court's decision on same-sex marriage doesn't change anything. The position of the Bible on marriage is not negotiable. #marriage #SupremeCourt"},{"comment_id":"10153332639166350","commenter_b":"I think either Dianna Elizabeth or Elizabeth Diane","commenter_a":"Congratulations William and Kate!!","post_message":"It's a princess! Congratulations, Duchess Kate and Prince William! on.today.com/1DRmS6f"},{"comment_id":"631671896999280","commenter_b":"Too many real stories of sexual predators taking advantage of this garbage! BOYCOTT target!","commenter_a":"After the Trump rally last night here in Pa all the restaurants and stores were packed in the vicinity. We drove past Target to get out of the traffic jam and we noticed they were dead. It was really weird to see.It was bad enough when we came home from Kmart one day my 13 year old daughter telling me a female came in the bathroom with a bag and needle. Wish I knew before we left but I do not want her coming out and telling me a MAN was in there watching her No way.","post_message":"Target customers show the company just how they feel about its new transgender bathroom policy. @webpagelink"},{"comment_id":"10155363897415231","commenter_b":"She's gorgeous!!! You go girl!!!","commenter_a":"Wow!! Gorgeous baby!!!","post_message":"She was bullied because of the color of her skin, but she fought her way through the tough times to now become the recipient of a $10,000 scholarship. @webpagelink"},{"comment_id":"10153009294016680","commenter_b":"Why doesn't he run for Lt. Governor and Dog Catcher, while he's at it! 😡","commenter_a":"Who says money can't buy you elections - er, I mean, caucuses. Now he can continue to get paid for doing a job he won't be doing while he is attempting to further his political ambitions.","post_message":"Rand Paul is closer to getting his way. | AP Photo @webpagelink"},{"comment_id":"452100988313815","commenter_b":"Oprah is on her way out No one watches her American people don't like racist people like her","commenter_a":"I've thought she's been racist for years!!","post_message":"Do You Agree Oprah Is A Racist? Comment 'yes' or 'no'."},{"comment_id":"10153344405883984","commenter_b":"what more does this witch have to do before they put her where she belongs, PRISON!!!!!!!","commenter_a":"Hillary's political career ended with her departure from the State Department as far as I'm concerned. She's never been a vialble candidate for that office.","post_message":"I don't see any way Hillary can escape from this one. She's probably kicking herself right about now... Do you hope this ends Hillary's presidential chances?"}]
