[{"comment_id":"10153915924607217","commenter_b":"The most and popular muslim holy wars, were against the Romans and Persians. because they were arrogant and in face of God wills.","commenter_a":"Not forgetting the millions of Hindus killed by Muslims in India ..one of the world's greatest forgotten genocides","post_message":"The fire at the Islamic Center of Fort Pierce may have been timed to coincide with the Muslim holiday Eid al-Adha and the anniversary of the 9/11 attacks."},{"comment_id":"947714872011958","commenter_b":"Thereeeesss Billl---","commenter_a":"This is just an endorsement for trump.. it has nothing to do with Cruz.. Why is it that everything to do with t rump is exaggerated , or just outright lies ? Every time he opens his mouth the stooges have to run around for three days explaining \"what he meant to say\"? he didn't mean women should be jailed for abortions, he meant they should be celebrated.. he didn't mean mexicans were rapists he was talking about \"the bad ones\".. he didn't mean single payer health care he meant government paid health care.. he didn't mean to call Carson a child molester he equivocated that he was LIKE a child molester.. He didn't mean to hire all those immigrants for his hotel, he meant to say Americans are lazy and won't take the low paying jobs.. He didn't mean to imply that his wife is just a \"piece of ...","post_message":"Ted Cruz is having a hard time with Latinos for one EPIC reason. When I heard it, I couldn't stop cheering! All aboard the Donald J. Trump train! Do you think Ted is finished?"},{"comment_id":"10154162654734087","commenter_b":"Yep, we saw how Liberal women threw their crotches at Bill Clinton with votes right? My guess is most would have gladly changed places with Monica Lewinsky. Sucks to be a hypocrital non-critical thinking Lib woman. That's Lib Feminism I guess.","commenter_a":"Yes, when a bigoted, neo-fascist, sexual predator runs for president on the GOP ticket, Democrats are loyal to their party and independents and moderate Republicans stream to join us to stop him as well...funny how that works.","post_message":"\"With the exception of cheating Bernie out of the nom the Dems have always proven to be far more loyal to each other than the Republicans!\" Trump tweeted."},{"comment_id":"1043101302382000","commenter_b":"@username, the worst president in OUR lifetime was 2000-2008.","commenter_a":"Rep. Todd Young I understand your optimistic out look. How ever if you think that man will ever do anything, that would make America stronger then you greatly disappoint my opinion of you.","post_message":"While the President closed his State of the Union address by noting his desire to work across the aisle, much of his speech was spent digging in his heels on the same tax-and-spend policies rejected by the American people rather than identifying areas of common ground. But while I’m generally disappointed he took this tack, I still think there were some hints of bipartisanship that might present opportunities to grow a stronger economy. For starters, I agree with the President that Congress must pass a trade promotion authority bill. With two of the largest free trade agreements in the history of the world currently being negotiated, it is vital that the administration works with Congress to set negotiating priorities so that a deal might be completed quickly. In order to grow our economy, we must continue to open foreign markets to agricultural products and manufactured goods from places like Indiana, ..."},{"comment_id":"10155353294040231","commenter_b":"Your mom is a monkey","commenter_a":"I'm going to leave this right here. #Unapologetic #BlackAgenda @webpagelink","post_message":"Yet another black person has become a hashtag after being killed by a police officer."},{"comment_id":"10153927371866037","commenter_b":"May them leave now and so what... Do they think they can bring down saudi arabia ...! Rubbish","commenter_a":"new begginings for World Friends & Foes...! ( drawing a line in the sands-a dark Red Cloud will come from that part of the world. )","post_message":"Foreign Minister Adel al-Jubeir says that all Iranian diplomats must leave Saudi Arabia within 48 hours."},{"comment_id":"1220297847993003","commenter_b":"174742062548592helle Simons, she had the ability to dispense medicine to stop their suffering and didn't. That makes her a monster.","commenter_a":"I think this article is written very poorly and from a single minded view . Being Saint does not mean that you are perfect as no one is . It means you have strived all their lives to fulfill Christ mission and to serve God . If you don't believe in the church values and mission then why do you care who we canonize? Also when it comes to caring for people with a large organization things are much more complicated . There are many people who max out on pain killers and still feel pain in the hospitals. So when it comes to pain meds that are very valuable and they may not work why administer them ? In places like Calcutta it is not just a question of money but also transportation . They in fact hold more money then they need to but I very well doubt ...","post_message":"Is Mother Teresa a saint or an expertly-managed brand?"}]
