[{"comment_id":"10153612983935329","commenter_b":"Where's the fat men in crop tops","commenter_a":"@username this is why buzzfeed is terrible lol. So hypocritical","post_message":"God bless you, Roberto Bolle. God bless the male body and also tights."},{"comment_id":"10153622148174497","commenter_b":"women can have some rights, just so long as they arent black mexican atheist homosexuals or anything.","commenter_a":"are men hogging up all of the rights again? come on guys... let the women have some of the rights.","post_message":"What is the path forward for women given the barriers to equality they face worldwide? The Onion explains women rights."},{"comment_id":"1495136007456674","commenter_b":"Just every woman with a family huh? Men with a family don't do more too?","commenter_a":"You all don't know what hard work is. Every woman that has a family does more than fast food workers, and fireman definitely do much more than fast food workers!!!","post_message":"\"Some people say paramedics don't even get $15 an hour and they save lives. So why should fast food workers get that?\" That question comes up a lot when we cover #FightFor15 rallies, like this one in Detroit. But Fox2's Roop Raj is having to defend himself just for asking it. Watch his whole report here and see what you think: @webpagelink"},{"comment_id":"10156746539145354","commenter_b":"Is she a horse of a different color? By looking in her mouth I would say this nag is pretty old herself.","commenter_a":"Wow! Maybe someone should check if she's a card carrying nazi. Hey Emma holocaust much?","post_message":"\"Either you wait for them all to die, or kill them off slowly.\""},{"comment_id":"1235543663197041","commenter_b":"Are you crazy fat black lady?","commenter_a":"Can't fix stupid","post_message":"Apparently, torturing white people and yelling \"F**k Donald Trump! F**k white people!\" isn't a hate crime..."},{"comment_id":"10154415286659445","commenter_b":"I don't know I live in a 3 family Black family on the first floor Hispanics on the second & Im Italian but white on the third","commenter_a":"woah?!?!?","post_message":"WCVB presents a town hall meeting on #RaceInBoston in partnership with The Boston Foundation. Watch on WCVB and share your comments below. @webpagelink"},{"comment_id":"1279396932093344","commenter_b":"This is why I hate narcan","commenter_a":"Horrible heroin.","post_message":"\"This child can't speak for himself but we are hopeful his story can convince another user to think twice about injecting this poison while having a child in their custody.\""}]
