[{"comment_id":"10153221736289087","commenter_b":"Hey Reid we do not want this BS in our country!! YOU GET IT?? WE THE PEOPLE WANT ALL OF YOU TO FOLLOW THE CONSTITUTION! WE STILL HAVE FREEDOM OF SPEECH IN THIS COUNTRY! WE WILL NOT BE PUSHED AROUND! WE DO NOT WANT SHARIA LAW HERE! WE DO NOT WANT ANYONE WHO WANTS IT HERE TO LIVE IN THIS COUNTRY! GET IT? GOT IT? GOOD!!!!!","commenter_a":"When will,Dirty Harry apologize for his Viscious atracks,insultscandvcharges,against innocent republicans like mitt Romney ????? Reid is a very bad person.","post_message":"“I call on every Republican to denounce Ben Carson’s disgusting remarks,” Senate Minority Leader Harry Reid said. “That shameful intolerance and bigotry should have no place here."},{"comment_id":"10155501902685389","commenter_b":"Tell her to go home & en joy her granddaughter","commenter_a":"Hopefully it will be the beginning of the Clinton END.","post_message":"Hillary Clinton is expected to officially announce that she is running for president this Sunday. How will Republicans respond?   Tune in tonight at 10p ET for more details!"},{"comment_id":"10156284616795354","commenter_b":"Lol, they weren't immigrants.","commenter_a":"Immigrants....","post_message":"What in the world is going on?"},{"comment_id":"598846743608854","commenter_b":"Death by hanging move to the front of the line two weeks should do","commenter_a":"It's like they are forcing you to become a racist.","post_message":"BREAKING: White Female Cop Shot By Thug Hours Before She Was To Go On Maternity Leave [VIDEO].  This is tragic, let's send our prayers.  Can we get 10,000 'LIKES' for this poor officer?"},{"comment_id":"10154320609521636","commenter_b":"SohailAnwer wow what an example.. pakistan ha?? Wow","commenter_a":"Islam gives rights to many and that can be seen if we open our eyes. In all Muslim countries that have stable governments, even minorities enjoy their rights. Look at Pakistan, its having a Santa Themed train that is traveling nationwide for Christmas. How many western governments give so much to their minorities?","post_message":"Fantastic"},{"comment_id":"10154456762501509","commenter_b":"Why not?!?!.Woman need to protect them selves.At least they got to train some combat skills hehehe...","commenter_a":"Feminism did not make a stride forward in the fight for women's rights. All they did was to send your daughters and granddaughters to potential war. They themselves didn't get anything out of it. They will never see war most likely. I hope they're proud of themselves.","post_message":"Do you agree?"},{"comment_id":"10153428772146509","commenter_b":"Cause she was worthless and weak that's why!!","commenter_a":"Why would you choose the classroom to do that?","post_message":"There was no indication of foul play, and every indication that she took her own life, officials said. @webpagelink"}]
