[{"comment_id":"10153248558026336","commenter_b":"Is eating pussy a sin??","commenter_a":"Just absolutely heartbreaking. So glad their little one survived. Prayers for all involved in this devastation.","post_message":"Melissa and Michael Mooneyhan died shielding their young daughter from a tornado in Arkansas. The girl, who is about 18 months old, survived."},{"comment_id":"10154208733135969","commenter_b":"Why do they want to protect illegals? Wth what about the citizens","commenter_a":"IAGREE YSE","post_message":"The White House Press Secretary Sean Spicer holds the daily press briefing after President Donald J. Trump met with Intel's CEO about investing in America."},{"comment_id":"10153316215802377","commenter_b":"\"We're\" what has he got to be mad about - he's part of the problem.","commenter_a":"I'm glad he didn't get it for president.","post_message":"\"Certainly part of what is behind the energy and the passion for Donald Trump on the Republican side and [Vermont Sen.] Bernie Sanders on the Democratic side is the frustration and anger people feel in this country,\" Mitt Romney said."},{"comment_id":"1283735711683013","commenter_b":"horrible woman","commenter_a":"How bitchy she is...very bad attitude though","post_message":"The Hungarian camerawoman who tripped and kicked migrants has been sentenced."},{"comment_id":"1645030555784057","commenter_b":"Every woman who wants an abortion should see this. Children are truly gifts from God!","commenter_a":"If everyone showed that much love for their mother and all their family. This world would not be in the shape its in today. Most beautiful example for everyone!, thanks","post_message":"Incredible."},{"comment_id":"10153174163477452","commenter_b":"he better not get fired. @username","commenter_a":"GET SOME!!!!","post_message":"Big Mac attack!   A McDonald's worker wasn't \"Lovin' it\" when an irate and apparently drunken customer launched into a vicious attack at the drive-thru window. But the worker wasn't going down without a fight. abc7.la/1KYEgIq  It's just the latest case of a service worker attacked on the job."},{"comment_id":"10157187236600354","commenter_b":"Feminists need to stage another protest akin to their bra burnings in the 60s. Perhaps a massive Hijab burning in multiple western countries.","commenter_a":"So funny how the media always pushes these anti-Iran stories even though iran is 1000x more secular than our \"allies\" Saudi Arabia... let's hear about how many women Saudi Arabia executed breitbart. Stop the Iran propaganda pieces, you're turning into another Fox News.","post_message":"When will feminists take on the REAL \"War on Women\"?    “...promote immoral and un-Islamic culture and promiscuity...”"}]
