[{"comment_id":"10154459002469714","commenter_b":"Heaven forbid, but you are right. She has bought and paid for this election, horrible, corrupt hag that she is.","commenter_a":"Hillary Clinton is going to be our first woman President.","post_message":"ICYMI: FBI director James Comey said Hillary Clinton was \"extremely careless\" in handling classified information, but recommends to the Department of Justice that Clinton not face criminal charges."},{"comment_id":"10156608436570354","commenter_b":"We need to STOP celebrating arrests.... and STOP the influx of these fuckers (LITERALLY) in the first place.... They breed like rats.... Once they infiltrate, there's NO GETTING RID OF THEM.... Think of the rat problems in NYC! How about cockroaches? How about emerald ash bore? Zebra snails? Asian carp? GET IT????????????","commenter_a":"There is no such thing as \"Moderate muslims.\" They all read from the same Quran.","post_message":"German police have now made a staggering 379 charges for the attacks in which women were sexually assaulted by migrant gangs on New Year’s Eve.  All the latest DETAILS here..."},{"comment_id":"908006605999185","commenter_b":"Just try to take mine down!","commenter_a":"Good for USA...fuck obama","post_message":"This is HUGE!"},{"comment_id":"10153860204493598","commenter_b":"She probably has no problem selling those little body parts.I wonder how those people will answer God when they stand before Him!","commenter_a":"More like satan","post_message":"Wendy Davis is Dedicated to Promoting Abortions With God’s Help: “By God, We Get Back Up”"},{"comment_id":"863998766982005","commenter_b":"Women. Are. Psycho.","commenter_a":"not worth it.","post_message":"A woman has died in a car crash after chasing down her husband who was with another woman. What do you think? Crazy details here:"},{"comment_id":"10158083946035206","commenter_b":"Then clean your ears out!","commenter_a":"Can someone please tell me what the heck Trump stands for because to this day i haven't heard anything positive come from out of his mouth.","post_message":"Donald J. Trump supporters describe why it's sometimes hard to be for Trump. @webpagelink"},{"comment_id":"1363332557011521","commenter_b":"Robert Flemming you still haven't answered my question.","commenter_a":"I tell ya, if any of that shit were real, I'd much rather be on the side of Satan, than some dude that allows childhood bone cancer to be a thing. I'll keep my free thought thanks, you can keep your sadistic, imaginary friend to yourself.","post_message":"Food for thought."}]
