[{"comment_id":"10153708814028010","commenter_b":"shut your filthy mouth","commenter_a":"Nutella is gross. Nothing is worth assaulting the elderly, especially poo-tasting Nutella.","post_message":"The 24-year-old had snagged several samples when the elderly shopper told him to take just one, police said."},{"comment_id":"865416670223607","commenter_b":"Your mother is a dumb fuck you ignorant whore.","commenter_a":"WW3","post_message":"Turkish F16s warned the jet over the airspace violations before shooting it down, the military official said."},{"comment_id":"1349008868469783","commenter_b":"Yes that will be great. Why don't you go hang out with some of those Jew loving Muslims and see how that works for you. She is just like Soros another self hating Jew.","commenter_a":"MOOOOOORRRRROOOOOON","post_message":"Total solidarity ... or something."},{"comment_id":"886020504921859","commenter_b":"You are right Mary the bitch owes Haiti","commenter_a":"Shut it down.. take some of the millions and help Haiti which some of it was supposed to be used for. Then rehire ALL NEW PEOPLE IN THE VA HOSPITALS AND HELP OUR VETS. some of those people are the rudest uncaring and unhelpful people around hire enough to take care of the vets so they don't have enough to wait so long for appointments etc. Help Americans for God's sake.","post_message":"Hillary devastated after finding out this about her foundation.  It's all coming crashing down.  Do you think the Clinton foundation should be shut down?"},{"comment_id":"10152739568860779","commenter_b":"Get off Kobain's dick, retard committed suicide.","commenter_a":"Jody Bombay VanderZouwen buy me this !!","post_message":"Kurt Cobain appears on the cover of our latest issue, on newsstands today. In a 1994 feature, David Fricke looks back at the Nirvana frontman's music and legacy. \"As a man of riffs and letters, Cobain was a sly dog who rarely stooped to the obvious…nothing in Cobain's music was ever quite what it initially seemed; his best-known song was named after a deodorant,\" Fricke wrote."},{"comment_id":"1362078013830431","commenter_b":"Cruz....Kiss that ass.","commenter_a":"Mr. President, Please do not squander this opportunity to put a conservative in the Supreme Court. This is extremely important, we do not need someone who's going to be a straddle of the fence. We have too much anti-American government, anti-Constitution battering happening inside our nations capital and a crossed our nation, we cannot afford to make evening a half step in the wrong direction. Please Mr. President I implore you to please hear my request, my plea.","post_message":"Ted Cruz NAILS it, everyone needs to see this!"},{"comment_id":"10153099040499726","commenter_b":"I'd like to get rid of your ass.","commenter_a":"Just another lie.","post_message":"WATCH: Democratic Representative: 'Tea Party People' Want To Bring Back Segregation, Get Rid Of Women's Rights."}]
