[{"comment_id":"1212505538766794","commenter_b":"Karma's a bitch.","commenter_a":"Well there goes this investigation out the window. An admitted ammosexual is heading This investigation. .","post_message":""},{"comment_id":"1769361876675571","commenter_b":"Chinguen su puta madre ,al igual sigana trump nos seguiremos pasando i cruzando la frontera ,pongan ipongan sercas siempre los burlaremos 100% mexicanos gustele aquien leguste somos los #1 .","commenter_a":"Nice honest, rich family.","post_message":"In an impassioned speech, Eric Trump called on Americans to \"vote for the candidate who can’t be bought, sold, purchased, bribed, coerced, intimidated or steered from the path that is right and just and true!\" @webpagelink"},{"comment_id":"1258430004197187","commenter_b":"It will never happen. Hillary will win and that will be the end of America kiss your freedom goodbye and welcome Hillary Clintons new and improved America you fools!!!!!","commenter_a":"The regular polls are rigged. This is what's actually real. We need to find a way to get polls of our own. @webpagelink","post_message":"Despite getting barely any attention from traditional media, our numbers have been surging on social media.   See what the buzz is about at tonight's #GreenTownHall!"},{"comment_id":"761877867244155","commenter_b":"STFU Shannon....stop raising a queer!","commenter_a":"A lot of folks are making \"wink wink\" comments but she is a sexual predator and you might feel differently if it were your son who was involved. I hope she gets treatment and does not teach again. Find another profession--I can think of one.","post_message":"The running joke was allegedly: \"Who is Ms. Altice sleeping with now?\""},{"comment_id":"945825838793990","commenter_b":"nothing but a whore from the sixties.","commenter_a":"Ask her to please go back to Vietnam where she loves it so much .","post_message":"Actress Jane Fonda, who 45 years ago as making the lives worse for Americans fighting for their life in the jungles of Vietnam, is now making lives worse for American energy producers. Given the fight Fonda now has against North American oil discovery and transportation, she has once again aided and abetted the enemy: Islamic oil producers. It seems Jihadi Jane neither understands how her actions are viewed by the enemy (major Muslim oil exporters, some of whose core members want to see the destruction of the United States) nor how these anti-jobs protests impact hundreds of thousands of North American families. @webpagelink"},{"comment_id":"10153748697767629","commenter_b":"If white women didn't flunk every black and Latino out we might have the blacks in college and in education that we need.","commenter_a":"When are we going to start making teachers uncomfortable and scared? its a white, more privileged profession with more time off. Especially at the college level. Shouldn't they fear being shot in the head too? Thankfully we are getting guns on college campuses so that all authority can be radically challenged with an in your face confrontation. The Russian left has always known the power of confronting authority so I'm glad America is catching up. War and Revolution baby! Just like the founding fathers intended.","post_message":"This is beautiful."},{"comment_id":"1153444948105615","commenter_b":"To bad she didn't get her way !!! Sick ass bitch !! And fugly as shit too !!! F&skin cry baby !!!","commenter_a":"Are you all that stupid she treats everyone that way she belives you all our not to smart","post_message":"THIS sounds about right. @webpagelink"}]
