[{"comment_id":"872917539471166","commenter_b":"Ohh @username shutup you miserable heifer","commenter_a":"This doesn't surprise me at all - and she looks great doing it !!!!","post_message":"Don't believe us just watch!"},{"comment_id":"1011935972208484","commenter_b":"No amnesty. We need to figure out exactly how many workers our farmers need and make it easy to give immigrants return visas once they have been vetted then give them 5 year vias, before needing to reapply.","commenter_a":"Democrats, you have one job this November: Don't give our country to the GOP! Elect a Democratic President and give them a Democratic Congress to work with! And complete the job by dumping the GOP from state and local government!","post_message":"'Nuff said. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10157699168860294","commenter_b":"If you think he can do that with all the times she's been investigated over the last several years you're sadly mistaken.","commenter_a":"Trump is not for social society so I can't be for him","post_message":"“If I win, I am going to instruct my attorney general to get a special prosecutor to look into your situation because there has never been so many lies, so much deception.”"},{"comment_id":"10154455008597509","commenter_b":"Andre Ceasar","commenter_a":"Brittany Benoit, Jade Walker","post_message":"Take a look at the friends who you have outgrown, who you don’t talk to anymore, who makes no effort to see you. Focus on the friends who matter most."},{"comment_id":"10154929144129657","commenter_b":"You're actually describing her as intelligent? Seriously?","commenter_a":"Intelligent strong ladies don't need NOW to fight their battles for them. They are capable of doing it themselves.","post_message":"Looks like she doesn't need NOW's help after all."},{"comment_id":"1173449382693296","commenter_b":"ANTI CHRIST HILLARY CLINTON IS BEING PROTECTED BY UN AND OBAMA! ISIS IS THEIR CHILD OF HATRED TOWARDS THE WORLD AND IS GROWING BY THE MIN THEY ARMED ISIS!","commenter_a":"Hmmm","post_message":"Should the US pull out of the United Nations over this?"},{"comment_id":"10154673400449062","commenter_b":"Nope","commenter_a":"Not only are we erasing our history, but this change will cost a lot of money to redo signs, get new uniforms etc. The district has $107 MILLION shortfall because of the Robin Hood Plan. I won't have a job next year, and campuses will be forced to do more with less in many areas. So many reasons that this is NOT a good decision. If we ignore our history we are doomed to repeat it!","post_message":"JUST IN: HISD votes to rename 3 schools named after Confederate leaders. Details: @webpagelink"}]
