[{"comment_id":"1128844340487134","commenter_b":"I believe in planned parenthood, but I believe it starts before you get pregnant, not after. Grab a couple condoms, take the pill or shot. Get your tubes tied. Life starts at the time of conception. Murder is murder, I don't care how old the person is.","commenter_a":"Can Hillary tell us on what date she considered Chelsea a human being?","post_message":"Sadly, true."},{"comment_id":"10153605257703984","commenter_b":"Afraid of the truth RNC they want only those who agree with their lies & deceit. No wants ur RINOS IN OFFICE.","commenter_a":"Sounds like Trump is a threat to Republicans, because he tells the truth? My understanding is all Repubicans should stand together. Go head Republicans, give this election to the Democrats and then whine afterward. All YOU have are empty words and promises and then you cave.","post_message":"I know the Republican Party has made some big mistakes in the past, but this one absolutely blows my mind. People are already saying they're done with the Republican Party after hearing this news. Trump has every right to be furious... Would you stand with Trump over the Republican Party?"},{"comment_id":"1036436079751842","commenter_b":"Now that's a face only a mother could love!!!! What a mutha!!!","commenter_a":"BS!","post_message":"UNREAL: Thug Rapper Calls For Presidential Candidate To Be Slaughtered- Media Silent (LISTEN) Could you imagine if a white guy did this to candidate Obama? @webpagelink"},{"comment_id":"1727548687496080","commenter_b":"HILLARY CLINTON IS AN ARROGANT NARCISSISTIC SOCIOPATHIC LIAR AND VERY EVIL WOMAN !!","commenter_a":"Time will tell","post_message":"We'll see what ends up happening..."},{"comment_id":"1820431918212382","commenter_b":"Stupid whore","commenter_a":"Good !!!!","post_message":"My, my, my..."},{"comment_id":"10153206057979312","commenter_b":"Yeah that's why global warming is such a bigger deal than millions of humans getting their head slashed. Good one! You know they will come over here and do the same!","commenter_a":"If the President comes out in favor of it they'll drop the idea like a hot rock.","post_message":"Under the proposed measure, Missouri residents would switch to daylight saving time in March 2017 and never turn their clocks back again. Good idea? Bad idea?"},{"comment_id":"10153653825589641","commenter_b":"Barbaric ... Disgusting behavior . Poor woman. I thank God every day that I was not born in an Islamic country and pity all those women who are oppressed . May she rest in peace .","commenter_a":"What happened to the man she was supposedly cheating with ? Let me guess ....nothing. That country is nothing but a bunch of murderers","post_message":"The victim was in a forced marriage, and had tried to flee with another man."}]
