[{"comment_id":"10153984129784497","commenter_b":"Area woman would have crashed car regardless of spider's presence.","commenter_a":"Area woman crashes car trying to get away from spider","post_message":"Report: Spider"},{"comment_id":"10153234666538188","commenter_b":"Who is the idiot who decided on this He or she must be a pervert can't wait to see little girls or boys pull down their pants","commenter_a":"What is this country becoming ? I don't recognize it!!!!","post_message":"I just got back from San Diego. Incase you need the restroom you are greeted with this sign.   Welcome to the new normal."},{"comment_id":"10153745171813837","commenter_b":"She lied. There's a difference.","commenter_a":"Far more honest about her mistakes than Hillary Clinton.","post_message":"MRS. TRUMP: Melania Trump announced Thursday that she took down her website, acknowledging that it contained inaccuracies."},{"comment_id":"10156148528265725","commenter_b":"Trump has the mentality of an 8 year old class bully","commenter_a":"Suzanna Mikolajczak Trump is a Beast","post_message":"I think Megyn Kelly should take another eleven day 'unscheduled' vacation."},{"comment_id":"10153956730069411","commenter_b":"You poor thing! (Jk)","commenter_a":"I know where I came from :) I am 20% from Asia, 20% from North America, 20% Pacific Islander and 40%European Meztizo. That is why I look like this. My eyes are brown and blue (blue edges, brown interior).","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153328841247377","commenter_b":"she should be in jail what she done to Stevens was murder .","commenter_a":"We The People That For Trump Will Vote For Trump The Hard Core Dem Will Vote Dem If I Told Them My Dog Was Running They Wood Vote For Her Most Of Dem And Rep Wont To See Our Country Great A Gain Will Vote Trump","post_message":"New email released Monday shows slain Ambassador Chris Stevens wanted to leave Benghazi for months before his death, ex-U.N. Ambassador John Bolton said Tuesday."},{"comment_id":"924923120897717","commenter_b":"That is what the Supreme Court is for! To keep the Executive branch from VIOLATING THE HOLY MONKEY SNOT out of the Constitution. This administration is shameless and arrogant to the EXTREME!","commenter_a":"Yes","post_message":"A Federal Court upheld a block on Obama's executive amnesty. Do you support their ruling? -- COMMENT with YES or NO"}]
