[{"comment_id":"493705967486650","commenter_b":"She should be in prison anyway!","commenter_a":"Finally justice might be done!","post_message":"Hillary's career could be over after she was exposed doing this.  Good. Let's end it right here, right now, once and for all.  Do you agree Hillary Clinton should be relieved of her duties?"},{"comment_id":"10153240103694575","commenter_b":"Don't nobody wanna hear that mess they need to charge her as an adult.","commenter_a":"You failed at parenting now it's time the state steps in with a real punishment!!! I don't know why that woman is trying to act like if someone beat her kids like that she wouldn't want to beat the crap out of them! Fact is you raised the one that did it. SHE MADE HER BED NOW IT'S TIME TO LAY IN IT!!","post_message":"Russ McQuaid spoke today with the mother and grandmother of the teen girl accused of attacking another girl and a young boy in Brookside Park.  The suspect's mother says her daughter suffers from PTSD and other ailments.  See more of the interview here: @webpagelink"},{"comment_id":"10153904128981336","commenter_b":"@username I'd rather my money go to vets than illegals.","commenter_a":"Oh man, companies supporting a competent and able workforce with bonuses. Conservatives will not like this one bit.","post_message":"Jeffery Hildebrand, the 56-year-old billionaire owner, will pay out more than $100 million in total and reportedly uses these bonuses to motivate his workforce."},{"comment_id":"10154101108342217","commenter_b":"TRUMPERS: Instead of saying get rid of abortion, why not use POSITIVE REINFORCEMENT by encouraging safe sex, and making birth control available in stores - WITHOUT HAVING TO GET A PRESCRIPTION. SILLY goose. SSSOOOO, are you saying that if a mentally retarded person is raped, then they should have the baby? Even though they don't have the mental capacity to care for themselves?.......... thats really stupid to state that they would have to go to another state in order for them to have an abortion, or to exclude ALL abortions. WOW. I bet you didn't consider mentally handicapped people being raped, or even 10 year olds. The youngest parents ever recorded, from my knowledge are the age of 10. Do you see the issue here? Think about it. Seriously. THINK people.","commenter_a":"TRUMPERS: Instead of saying get rid of abortion, why not use POSITIVE REINFORCEMENT by encouraging safe sex, and making birth control available in stores - WITHOUT HAVING TO GET A PRESCRIPTION. SILLY goose. SSSOOOO, are you saying that if a mentally retarded person is raped, then they should have the baby? Even though they don't have the mental capacity to care for themselves?.......... thats really stupid to state that they would have to go to another state in order for them to have an abortion, or to exclude ALL abortions. WOW. I bet you didn't consider mentally handicapped people being raped, or even 10 year olds. The youngest parents ever recorded, from my knowledge are the age of 10. Do you see the issue here? Think about it. Seriously. THINK people.","post_message":"The BBC's newsroom does the #MannequinChallenge.  BBC Children in Need."},{"comment_id":"1131104760243867","commenter_b":"Because no feminist says that.","commenter_a":"So when feminists say, genders should be separated in school, it's just a valid opinion. But if a straight white male says the same thing about science labs, it's sexist? How does this logic work? Oh, sorry, I forgot it isn't logic, it's stupidity. ;)","post_message":"I'm crying with laughter over some of these."},{"comment_id":"855184514566047","commenter_b":"Oh, he wont' do that - she's white.","commenter_a":"I Jeb Bush should set up a public shaming.","post_message":"What are your thoughts about this tweet about Bristol Palin, Sarah's daughter?!"},{"comment_id":"10154534955796336","commenter_b":"Hillary will NEVER do time for all the crimes she has committed. She and Bill have been getting away with their CRAP for YEARS. Just because it's a different year, doesn't mean anything will change.","commenter_a":"Hillary Clinton will win the election in November. Then, sometime between November and January, Hillary will be indicted. The IRS is now investigating the Clinton Foundation and the whole e-mail thing isn’t over yet. Once under indictment she won’t be able to assume the Office of the President in January. Tim Kaine, who will not actually be the Vice President because neither he nor Hillary have been inaugurated, cannot assume the Presidency. The Speaker of the House can’t move up to it because there is already a sitting President and Vice President. So President Obama, in an Executive Order citing “emergency situation,” gives himself another four years in office is the only way possible. Obama has been planning this for a while now, knowing he has enough on Hillary to indict her. Had the Attorney General indicted her based on evidence from the FBI this plan wouldn’t have worked because ...","post_message":"\"The terrorists overseas utilize our strengths – which are compassion and empathy – against us.\"   Kris \"Tanto\" Paranto, who survived the attack in Benghazi, expressed his support for a more rigorous vetting process for refugees."}]
