[{"comment_id":"1601073560185519","commenter_b":"@username I know I'm not saying he's illegal, he just wants every illegal to come into our country without becoming legal. He's ruining our country!","commenter_a":"She's not even a native born American trying to become the FLOTUS. Yet Donald Trump gave the current American President hell about his birth certificate! GTFOH","post_message":"Melania Trump: \"The race will be hard fought all the way to November, there will be good times and hard times...it would not be a Trump contest without excitement and drama.\" @webpagelink"},{"comment_id":"444744122316849","commenter_b":"YES IMPEACH Obama and his Administration","commenter_a":"The state of affairs in America is so sad. All about obama.","post_message":"Did President Obama do this on purpose or could it have been by accident?"},{"comment_id":"10156487496090615","commenter_b":"Give it up, David. If they'd vote for someone who votes for war, flip flops on the Keystone pipeline, takes money from Wall Street, and until very recently did not support marriage equality, I don't think they're interested in the truth. They'd rather just take their half truths and stir up crap, just like the candidate they support.","commenter_a":"So many Bernie fans complained that not enough debates were scheduled before the primaries. Now Bernie refuses to debate when the other two candidates are willing. Yet another reason I'll be voting for Hillary.","post_message":""},{"comment_id":"10156988779965500","commenter_b":"Exactly. These are sick women.","commenter_a":"This is sick! As the mother of that boy I would go psycho on her! Check out this loser, @username!","post_message":"TEACHER IN TROUBLE! She told investigators that the boy's family was supportive and excited when they found out she was pregnant. @webpagelink"},{"comment_id":"10154228784001378","commenter_b":"Yes ty @username I did","commenter_a":"@username did you get one yet?","post_message":"The Hatchimals are coming! The Hatchimals are coming! Target has announced that a new shipment of the hottest toy of the holidays will be popping up in stores nationwide starting today. Are Hatchimals on the list this year?"},{"comment_id":"1057781130958942","commenter_b":"Hmmm... say the Lil bitch talking shit on Facebook","commenter_a":"Wtf that nigga a pussy how you going to slap another man and walk away straight pussy.... I would of shot that nigga since he want to duel","post_message":"The disrespect!"},{"comment_id":"1296273287105505","commenter_b":"You can go to hell liar","commenter_a":"Thank you president Obama. You will always be my president . The orange one will never be able to walk in your shoes he is a lier and con man and most of all a racist sob. Never put president before his name.","post_message":"\"That's what separates us from tyrants and terrorists.\" Nearing the end of his presidency, President Obama shared his hopeful vision of America's future."}]
