[{"comment_id":"1415185618534424","commenter_b":"@username Spaniards have been in this country for a very long time and that will never change. It is very raciest of you to assume only Hispanics are illegal and most legal Hispanics would like illegals deported. We have immigration laws in this country and they will be enforced .You are nothing but a hateful bigot. Eva's country doesn't deal with an illegal immigration problem because they strictly enforce their immigration laws; as soon as Canada takes in 10 million illegals Eva can have an opinion on this matter.","commenter_a":"Trump stirred it up with all his comments during the campaign. He brought out the worst in people. And because he was so verbal againgst race...religions...women...all the racist bigots who kept semi silent for a while have come outta of the woodwork and guess who led the way. And to think he is now going to be the leader of your country.","post_message":"Chili's provides veterans a free meal every Veterans Day, so US Army veteran Ernest Walker went to his local Chili's for a burger. Instead, he was denied a meal after an altercation over his service record. @webpagelink"},{"comment_id":"10152755892071051","commenter_b":"Butch ass bitch...stop eating pussy behind the first ladies back and maybe someone would like your ugly ass","commenter_a":"If the Brits love this animal so much, they can have her.","post_message":"People in Saudi Arabia are livid with Michelle Obama for one very specific reason."},{"comment_id":"10153718777033690","commenter_b":"Why don't the Saudis and Qatari take them all. The are wealthy nations with more real state than Europe. We definitely don't want them here in the US we have enough dealing with illegals coming from our southern border...!","commenter_a":"Take 30 seconds to sign (and possibly share) this petition asking the US government to take in 65000 Syrian refugees. Germany is expected to accept 800,000 refugees this year, while the US has accepted less than 1,000 thus far. Let's do a small part to encourage the U.S. government to be socially responsible. This is a humanitarian crisis and the Syrian refugees have nowhere to go. You can vote no matter where you are from. @webpagelink","post_message":"\"The world sees Germany as a country of hope and chances,\" German Chancellor Angela Merkel said at a news conference last week. Despite all the positive energy, however, some observers are questioning how the tens of thousands of newcomers, many of whom are conservative Muslims, will integrate and adapt to German society."},{"comment_id":"1079787262080732","commenter_b":"BYE BITCH","commenter_a":"@username this is SCARY accurate dont hug me when u come home","post_message":"\"I love you.\" \"Ew. Stop.\""},{"comment_id":"10152854969571051","commenter_b":"Let behead these scumbags..What the F**k is wrong with people..Your parents should get their asses kicked","commenter_a":"Tell me where they live. I'll do the rest...","post_message":"These teens beheaded a puppy with a machete and posted the video to Snapchat. Then they picked up another puppy and did it again. And they didn’t stop there."},{"comment_id":"10153546478451337","commenter_b":"Bitch? Way to completely destroy everything no makeup selfies are meant to promote","commenter_a":"that bitch is bad without makeup real talk","post_message":"PERFECT RESPONSE: Watch Lana - WWE perfectly shut down her Instagram trolls..."},{"comment_id":"10155046621507704","commenter_b":"No way these girls aren't boozin b4 these press conferences, no way...","commenter_a":"If these morons didn't play loud music in the background, you might actually be able to hear what the people are saying.","post_message":"They're losing it! In more ways than one..."}]
