[{"comment_id":"10152998005499753","commenter_b":"Woman you have no clue.","commenter_a":"I think this mom did the right thing with her son. She is a hero to me and I for one would have done the very same thing. This columnist is way off base here and I think she needs to shut it.","post_message":"Toya Graham smacked her son and dragged him away from the Baltimore riots. Now a columnist is ridiculing her and those who support her for the \"abuse.\" @webpagelink"},{"comment_id":"10152861965631130","commenter_b":"Is that the END OF YOUR BULLSHIT?? Nothing to do with illegal immigrants. Whooping Cough outbreaks happening ALL over the world. The bacteria is mutating in two ways: one strain of bacteria lacks the primary protein used in the vaccines; the other strain has new proteins. These are found in Europe, Japan and elsewhere @webpagelink","commenter_a":"Vaccines can force the bacteria to mutate, did you know that? 100,000 Americans have gotten whooping cough in the last three years. 32 babies have died. C.D.C. scientists speculate that the current vaccine may be helping to drive the bugs’ evolution. “The fact that this happened so quickly, to the proportions we’re seeing now, clearly suggests some selective pressures …. Vaccine pressure is probably one of them. @webpagelink","post_message":"\"I believe in trusting doctors, not know-it-alls.\""},{"comment_id":"10153053075171770","commenter_b":"Yeaaaahhhh... She's much happier having a socialist traitor occupying the WH","commenter_a":"That's what I said about obama, and it's turning out to be true.","post_message":"\"That’s who I want representing my country, somebody politically incorrect. That will just be perfect.\""},{"comment_id":"10153344961531336","commenter_b":"With the negros and the muslims,America is done.","commenter_a":"Someone \"finally\" says that they noticed the male charging up to the officer put his hand behind his back! Was that officer supposed to \"WAIT\" & see if the guy had a gun ??Plus,we DON'T know what he said to the officer! Don't be idiots & think the officer shouldn't be ready to protect himself just because \"THEY WERE TEEN AGERS\"!!!! AND IT ALL GOES BACK TO...\"LISTEN & DO WHAT THE OFFICERS SAY\" INSTEAD OF THINKING YOU'RE \"ABOVE THE LAW\".......","post_message":"JUST IN: Cpl. Eric Casebolt has resigned from the McKinney Police Department after almost 10 years on the force. His resignation was confirmed by his attorney, Jane Bishkin of Dallas."},{"comment_id":"10153514692996135","commenter_b":"No other president has lived on the \"people's money\" like obama has except maybe the clintons ! They have all had their homes before they got elected and actually used them for \"vacation\" time etc. among other things ! If I have to tell you you must have been asleep for the last 7 1/2 years !","commenter_a":"Pretty good sized house for making pocket change for 8 years. It is funny how all the poor people he was supposed to help are still living on the streets and in the slums of the city ! But the scum always rises to the top ! ! !","post_message":"Check out these photos."},{"comment_id":"978977272143131","commenter_b":"I agree. That's a spot on observation. I never thought about that, but it's true. Many feminine topics make people uncomfortable. Whether it be hygiene, sexuality, or social treatment. All common topics for comedy.","commenter_a":"Honestly, I think a lot of the reason men don't find women funny, is because men AND women are trained to see things from a man's perspective. I can hear a boner story and laugh my ass off because I can imagine what they are telling me and it's amusing. So much of what women comedians talk about are things that men feel they can't relate to - they've never thought about most things from a women's perspective. Just my two cents though...","post_message":"First it sounds ridiculous. Then you get it. Then it's hilarious and sad all at the same time. - Eric March"},{"comment_id":"10154156171661509","commenter_b":"Who ever used the word 'liberal'? Labels are so 90s. I support Bernie because of his integrity, his consistency and his sincerity. I see none of those qualities in Hillary. I see the opposite in Hillary. I support Bernie because of his policies. Hillary uses too many weasel words when she talks about policy. She likes to leave the door open because she plans to make a hard right as soon as she's elected. She owes too many favors to the banks, corporations and wealthy investors who back her. They need a return on their investment and good ol' Hillary will no doubt deliver the goods.","commenter_a":"The media is dying to have Bush v. Clinton 2.0 so badly but I've never met anyone in person who thinks either of them would make a good president. It's a media manufactured dream match. Both of them would be bad for America but good for ratings. as long As I live I never want to hear the name Bush again and Clinton's got way too much baggage. Policy-wise Hillary is just a kinder face to the same neocon agenda that Bush would be peddling. Sanders is our best hope. Let's stop moving Backwards, let's move forward!","post_message":"Jeb Bush says Hillary Clinton is a \"smart person\" but is \"beatable.\" @webpagelink"}]
