[{"comment_id":"1614159405537839","commenter_b":"Throw her on a plane and get her the hell out of here","commenter_a":"Send them all back","post_message":"Deport these radicals NOW!"},{"comment_id":"401586413362986","commenter_b":"Cut off her welfare check!","commenter_a":"and they raised a boy? No wonder","post_message":"Michael Brown’s mother decided to show her true nature when she said this..."},{"comment_id":"1246473882081393","commenter_b":"TURN THEM LOOSE AN PAY THEM TO KILL AMERICANS !!!!","commenter_a":"Go figure that thank you Mr. Obama and miss Killory you guys are doing America so good","post_message":"REVEALED! Minnesota Mall Attacker ID'd As One Of Hillary's Somali Muslim Refugees!"},{"comment_id":"10156157123040725","commenter_b":"Keep the illegals out","commenter_a":"I'm glad to get this input.","post_message":"Marco Rubio is weak on illegal immigration and will allow anyone into the country. Has worst attendance record in Senate- rarely there to vote on a bill!"},{"comment_id":"10153801376773822","commenter_b":"Sean Hile lol","commenter_a":"Chelsea Nichole","post_message":"Burgers, Wings, and Country music... A taste of Nashville is set to move into #Pittsburgh's North Shore."},{"comment_id":"10154308587221323","commenter_b":"Oh stop with this mythology bull, grow up!","commenter_a":"Quran is base of Islam. Quran do not say that homosexuality is pride. GOD bans this type of relation in all abrahamic faiths, but also GOD say that He will punish this sin, people re not allowed to harm gays. They only can make advise. So Sadiq Khan should tell about Quran and not his personal views, abot homoseuxuality, only then muslims will accept him like a muslim.","post_message":"\"The irony of Brexit repercussions is that those good old (or new) British values we bang on about seem to be falling to pieces around our ears. Diversity, unity, respect, equality might sound like cliches on replay – but they do work for us, if we work for them. That’s why approaches like that of Sadiq KhanKhan are so badly needed now. He’s somehow got his act together during a moment of such uncertainty, doubt and disappointment.\""},{"comment_id":"1862646097306537","commenter_b":"Now that is what real Democracy looks like. You go GIRLS with you in spirit.","commenter_a":"Beautiful","post_message":"What a successful march! Can we get 300,000 likes for these brave ladies? Read more HERE: @webpagelink Image by Occupy Democrats, LIKE our page for more!"}]
