[{"comment_id":"10154529100646323","commenter_b":"@username..tanks, anti-missile system or cannons are completely useless in civil war in a country where anybody and everybody can have a gun. And when government doesn't know who has it. There's a reason America in a last century (and before) was the safest place to live in the world. Totaling all the murders in 20th century USA is 10-20 times safer than S. America, Africa, Europe or Asia. Thanks to 2nd Amendment in our Constitution.","commenter_a":"It is odd how right-wing custodians of patriotism have a problem with Kapernick regarding the anthem but hardly emit a peep when scores of people are killed by lunatics with guns who take advantage of that great piece of antediluvian legislation otherwise known as the Second Amendment.","post_message":"\"Declining to stand and laud that country until these outrageous, deadly imbalances are repaired – until our flag actually does represent everyone – is perfectly reasonable. America gets my unreserved, hand-on-heart patriotism when it earns it.\""},{"comment_id":"1085502584794544","commenter_b":"Good thing the fetuses don't care","commenter_a":"butchering humans is not health care","post_message":"Americans want funding for women's health."},{"comment_id":"10153119692871130","commenter_b":"ughhh these bitches Emily Lee","commenter_a":"Can't wait!","post_message":"See how far women's rights have come in the first trailer for one of the year's top Oscar contenders: Suffragette, starring Carey Mulligan, Helena Bonham Carter and Meryl Streep."},{"comment_id":"10153530026483707","commenter_b":"What have Senators Done??? over 30 some years.. Trump is 1000 percent Correct.","commenter_a":"McCain is a scumbag traitor. He was codenamed \"songbird\" by the NVA when he was a pampered guest at the hanoi hilton. He has done more harm to veterans as a senator than could be believed. He is no true American hero. Piece of filth.","post_message":"Congrats to my daughter Meghan on her new nationally-syndicated show, starting July 20th - very proud of you! Learn more:"},{"comment_id":"10155823678825354","commenter_b":"SUCK a Long donkey Eva ..","commenter_a":"She knows nothing about Hitler but she can run her mouth","post_message":"Desperate..."},{"comment_id":"10154229231904411","commenter_b":"If a woman have every right to show off her body or hair; then why can't she have the right to cover it? I haven't met any veil wearing ladies that have offended me in the least.","commenter_a":"The Golden Rule of Civil Rights is, One Mans Rights End Where Another Mans Rights Begin","post_message":"Awkward: Laurence Rossignol, who is ironically founder of the anti-discrimination organization SOS Racisme, compared Muslim women who wear veils to 'American negroes' who supported slavery"},{"comment_id":"10153472925796336","commenter_b":"Oh, what a surprise, Jackie is an ignorant b*tch offering her uninformed, sexist opinion.","commenter_a":"Everyone is so concerned with making sure winny people feelings don't get hurt by legalizing gay marriage and taking down flags but the real important stuff like the murder of baby's everyday is last on their agenda.. ban abortion and all these little hoes will be forced to used condoms. . If you get raped, , i understand it's a sad thing but don't kill the baby. .the baby didn't ask for it. Have the baby then give it up for adoption. . But it's an innocent baby. . Stop committing murder. .","post_message":"“I’m saying there ought to be some humanity and respect for the dignity of a potential life.” – Megyn Kelly on last night's 'The Kelly File'"}]
