[{"comment_id":"1583439795280427","commenter_b":"Disgusting, stupid woman.","commenter_a":"This woman and Palin and others like her are enemies of the state in my opinion! Shame on them for spewing their damage.","post_message":"WOW."},{"comment_id":"10154787098266438","commenter_b":"@username exactly, many of the \"1%ers\" are pro choice liberals, they can fund it.","commenter_a":"Just goes to prove, don't make women angry. We don't get even, we get revenge. Elected officials had no idea what they did. This is just a start. With Elizabeth Warren, Bernie Sanders, Schumer, and many others we will take our rights back. Ryan and Trump need to be scared, very scared.","post_message":"Huge crowds everywhere from D.C. to New York to Chicago to LA to Memphis to Nashville to Raleigh to Denver to Idaho ..."},{"comment_id":"1651699668460485","commenter_b":"The deficit has no real meaning re the economy. Look it up.","commenter_a":"A big not for 8 years. What a great vacation they have had. Our country has gone to crap. Glad you enjoyed it. The only thing I have left is change in my pocket.","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"1041807992526339","commenter_b":"Bitch please!","commenter_a":"he was 14. he admitted it freely (nobody knew or said anything or asked him, he just did the right thing) and he was treated and has no reoffended. If it was your 14 year old son, better yet, shall I name all the 12, 13 and 14 year olds I went to school with that groped me??? Maybe one IS you kid","post_message":"One of Josh Duggar's relatives stepped up to the plate to defend the Right's favorite child molester by claiming that ANYONE would molest kids if there were no consequences and the right opportunity."},{"comment_id":"466002853760417","commenter_b":"Screw your health care - you can buy a freaking wall instead America.","commenter_a":"Trump suffers from major PARANOIA....💰💵😎","post_message":"Speaker Paul Ryan on President Trump's executive order to build a wall on the U.S.-Mexico border: \"We're going to pay for it and front the money.\" Watch Greta Van Susteren's full interview with Speaker Ryan. @webpagelink"},{"comment_id":"1764590997115642","commenter_b":"Melanie can say she wrote her speech speaks what pea brain she have.","commenter_a":"Maybe because she copied it down in her own handwriting she THINKS she wrote it!","post_message":"WOW – Melania Trump’s plagiarism scandal just got even more interesting... Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153397415338984","commenter_b":"Guess you are be careful about who you ask to suck your dick!","commenter_a":"Very old","post_message":"Watch what happens when this bully starts a fight with the wrong guy... he didn't see this coming. The cameras caught this entire fight... Are you happy he got a giant slice of justice?"}]
