[{"comment_id":"818359668354610","commenter_b":"Freaken Muslim foreigner.","commenter_a":"Yes","post_message":"Obama Disrespects Our Nation's Police In A SICKENING Way Right After Dallas Shooting He is the worst president in our country's history. Do you think Obama is a disgrace?"},{"comment_id":"1766321223645256","commenter_b":"If you are gay why are you voting for Hillary when she wants to bring in millions of refugees that believe gays should be executed? If you are Black, why are you voting for Hillary when she defends Planned Parenthood and admires Margaret Sanger, who wanted to abort as many black babies as possible and exterminate the black race because they are like \"weeds.\" Most of those clinics are in Black neighborhoods. If you are a Woman, how can you vote for Hillary when she has buried all of Bill's rape victims under the rug. As an attorney, Hillary also defended the rapist of a 12-year old girl and laughed about it later. She plays the woman-card and acts entitled; implying that she deserves your vote merely because of her sex. How is that gender neutral? If you have are a Miner, Steelworker or have a Factory job, why are ...","commenter_a":"He did not say because of how they prey! This is Dem spin! KILLARY only is concerned with illegals and refugee''s Get that big dem base full of those needing your handouts!! Does not matter if some want to kill us Really our money, but once it get to DC it's their money!! Her motto should be just give me your I WILL MAKE THE DEMOCRATS!!!! This country is going down fast!! Bombings, beheading, murders etc And our president is worried about where someone should PEE !! Big world leader! OBAMA A TOTAL JOKE!!","post_message":"\"In this great nation, where our founders put a fundamental principle forward of religious freedom, [Donald J. Trump] says ban all Muslims, don't let certain people into our America because of how they pray.\" What do you think of Sen. Cory Booker's comments about Donald Trump at the #DNC?"},{"comment_id":"10154144112782699","commenter_b":"too bad this policemans life has been changed because of some mouthy teenagers","commenter_a":"With the chief of police not supporting him...most definitely. He can't go it alone.","post_message":"\"Eric Casebolt of the McKinney, Texas Police Department has quit his job, after a video of him pulling his firearm on rowdy teens went viral.\" @webpagelink Do you think the officer should have resigned?"},{"comment_id":"10157096096500725","commenter_b":"Trump and his supporters can go ahead and choke on a Nigerian cock","commenter_a":"Yet another reason Billy Joel sucks....he's supporting DollHands Donny!","post_message":"Thank you Billy Joel- many friends just told me you gave a very kind shoutout at MSG. Appreciate it- love your music!"},{"comment_id":"1630331337026989","commenter_b":"@username Yes. That is certainly a tragedy which no one denies. These people were murdered and their sacrifice should be honored. This article is stating that obama could have stoped it and deliberately did not. This is fake news at its highest degree and is shameful because it uses the dead to tell a lie.","commenter_a":"Fake news: Moreover, the majority report issued by the House Select Committee on Benghazi plainly stated that, minutes after learning about the ongoing attack at the U.S. diplomatic compound, President Obama and Secretary of Defense Leon Panetta issued \"clear orders to deploy military assets\":","post_message":"Here's the proof folks. Both Hillary Clinton AND Barack Obama are now exposed for not pulling the trigger to save anyone's life in Benghazi, when they could. This is the end of their careers! Let's get 5,000 shares if you think they should both be locked away for war crimes."},{"comment_id":"1761144924140317","commenter_b":"If Mexico wont pay for wall, lets put our own electric fence 2 miles from the border then put our violent offender prisoners behind it ! In tents. With no back wall.","commenter_a":"Please vote for trump!!!!!!!!!!!!!","post_message":"Truth."},{"comment_id":"10153228481536519","commenter_b":"Which means no one should have sex with her, dumb ass.","commenter_a":"Oh jeez these comments are sick! Yeah teach your girls to watch how much they drink (and get help if they can't control themselves).and situational awareness. BUT this girl was still raped. Those men are still guilty. If someone is that wasted they crash a bike into your house, you sure as hell don't have consent to sleep with them. If someone is passed out on a couch, you don't have an open invitation to rape them. You people need help","post_message":"\"The truth is... I don’t know the exact number of times I was sexually assaulted.\""}]
