[{"comment_id":"10150666434674999","commenter_b":"Haters are a sure sign that future President Trump has hit the nerves of all those left wing panty waste liberals that pulled their heads out of the sand just long enough to realize that Hillary isn't the omnipotent goddess they thought she was. Dry those tears little babies. Like.....wipe it with a cloth.","commenter_a":"This country is such a mess, it would probably take a Donald Trump to get us back on track. Shows how far we have sunk. Thanks Obama.","post_message":"Something unmistakable has happened to Donald J. Trump since he announced his campaign for president in June: He has become a better candidate."},{"comment_id":"1132425910108091","commenter_b":"The Duggars need to be rape themselves so they can experience what is like to be violated only then they will know that is not something you can can forget or forgive and it's even worse when the rapist is a family member that's supposed to protect you.","commenter_a":"Proves they believe girls/women have no value.","post_message":""},{"comment_id":"10156062936845354","commenter_b":"Thugs","commenter_a":"Im in SA and just yesterday in Point rd Durban, my freind Gregory who is 69 yrs old was attacked by young foreigners with sticks and badlly injured. I am an ex policeman and I am ashamed of this assosiation. Our police are useless, I WILL TELL THEM FACE TO FACE if I have to. Warning to anyone in authority: IF NOTHING IS DONE TO REPATRIATE CRIMINAL FOREIGNERS FROM OUR COUNTRY IMMEDIATLEY. I WIIL CALL ON ALL WHITES TO START FORMING VIGILANTE GANGS. THE BALLS IN YOUR COURT, GET RID OF THE FOREIGNERS AND THE CRIMINAL ELEMENT.","post_message":"The vicious blow to the senior citizen comes around the :11 second mark."},{"comment_id":"10153394444588984","commenter_b":"Reminds me of a script from Steinfeld when Kramer tryed to lie and win his lawsuit which he lost. What a pair they are. Wonder how she got the money for the trip? .","commenter_a":"So the Apple doesn't fall far from the tree huh ??? Lmaooo good one lol","post_message":"Shakedown artist Al Sharpton’s eldest child wants damages for “loss of quality of life,\" but looking at her recent photos, something seems a little fishy about the claim... Are you glad to see the younger Sharpton outed for this?"},{"comment_id":"891336577589705","commenter_b":"Americans, protect your selves!","commenter_a":"Thanks Obama","post_message":"Click to see these alarming new numbers..."},{"comment_id":"10153032074653145","commenter_b":"How date she!!","commenter_a":"'Stupid is as stupid does' Glad there's one less pea size brain off the streets. She and others with that type of violent ideas should be dealt with accordingly. Enough of thugs who think they can spread such animosity in a country with so many opportunities to do something positive, enough!!","post_message":" thought about shooting every white cop I see in the head..\" That's part of a Facebook post that got this mother arrested #WFTV"},{"comment_id":"696428793854373","commenter_b":"Because his mother does what every south african women does ! Drink and try to get pregnant so they can qualify for more government grants so they can get more money for doing nothing and then they will leave a child at the grandparents for the full monty payout !","commenter_a":"At the end of the day. Why the hell why was a 3 month old its own.","post_message":"This is horrifying!"}]
