[{"comment_id":"10153344418725326","commenter_b":"Me too..they are owned by Time Warner her 7th largest donor!?!?!","commenter_a":"THE QUESTION IS THIS. DID CNN FEED HILLARY THE QUESTIONS IN ADVANCE. IF YOU LOOK AT HER BODY LANGUAGE AND LACK OF PONDERING THE QUESTION HER RESPONSES WERE CANNED. I FIRMLY BELIEVE CNN FED HER THE SCRIPT.","post_message":"Hillary Clinton was put on the defense Tuesday for her ties to Wall Street. While Sen. Bernie Sanders has been saying for years that the Wall Streets are contributing to the overwhelming income inequality in America. Ed gives Commentary. Don't forget to Subscribe to Ed's YouTube Channel at: goo.gl/ScLQVu"},{"comment_id":"10154479545156320","commenter_b":"Because of a speech. Sheeeesh","commenter_a":"What an amazing speech by everyone last night at the convention.I really think Hilary Clinton will be the President of the United States of America.","post_message":"12 years after rising to national prominence at the 2004 DNC, President Barack Obama took to the convention stage to try to bolster Hillary Clinton's candidacy to succeed him. #DemsinPhilly"},{"comment_id":"1197755483636319","commenter_b":"oh look a trump impersonator ! If you don't agree with him your a PIG!! a LOSER a total Disgusting human beings!! We're going to make America grate and get my red hats from China yea it going to be grate! They both suck but I trust her with the nations safety and economic well being . He can't get it wrong! It's not like he can claim chapter 11 to get out of paying his bills? Right Einstein!! Lol","commenter_a":"Some People think being president is always being right! about everything you do or try to do! It's not that simple. Back seat driving is easy , but when your responsibility is keep America as safe as possible and the world. Some things will not always go right. You guys are the haters The Republican Party of No","post_message":"It's funny because it's true."},{"comment_id":"10153657891231336","commenter_b":"Stupid old woman","commenter_a":"Keep her in jail until she resigns or issues marriage licenses!","post_message":"Kim Davis will be in jail at least a week, but she could stay longer if she continues to not obey the judge's order."},{"comment_id":"10153104771426051","commenter_b":"That woman is whack a doodle!","commenter_a":"Get a real life.","post_message":"This mom took one look at her daughter's Christening cake and immediately demanded an apology from the cake shop."},{"comment_id":"1366518346740365","commenter_b":"Emilie Frost & your not even ginger anymore","commenter_a":"....","post_message":"Fans of Prince Harry and Ed Sheeran will be celebrating soon!"},{"comment_id":"10153780723343984","commenter_b":"the Muslim parents could have kept their brats at home that day and celebrate their butts off.","commenter_a":"Yes","post_message":"Tempers flared after this city's board of education refused to take a day off of school in observance of an Islamic holiday, and these Muslim parents were NOT happy about it. Do you agree with the decision these school officials made?"}]
