[{"comment_id":"10153844548482894","commenter_b":"Girls dem suga 😁 get well mi fellow Jamaican .","commenter_a":"Aww cmon now not Beenie Man","post_message":"Beenie Man Contracts Zika Virus, Forced to Miss OVO Fest Performance"},{"comment_id":"1194642483887307","commenter_b":"Still need to deal this evil bitch a Blow","commenter_a":"easy defense... animal was not collared, violated leash laws, and was a threat to their own pets and property.","post_message":"She killed the cat because she believed it was a stray and became a nuisance, but a couple who testified in court this week said “Tiger” was their pet."},{"comment_id":"10153223558734726","commenter_b":"She has already stole enough","commenter_a":"She can just get over her self classless wonder","post_message":"WATCH: Obama: Michelle Upset She's Not Being Paid as First Lady"},{"comment_id":"10154001175786336","commenter_b":"She should be held to the same standards as men. Clearly she thought that since she's a 100lbs 5'0 female she should get away with it. She should be held to even higher standards because she is a doctor.... For now at least","commenter_a":"Don't complain about equality between the sexes as long as your OK with women not being held accountable for their actions. A man would be in jail right, now where she belongs. We giggle when women break the law and demand justice when men do the same thing.","post_message":"The confrontation reportedly began when the woman got into the Uber car without a reservation."},{"comment_id":"10152505642191770","commenter_b":"She finally bought herself some new boobs?","commenter_a":"People dont realize that both Kim K and Paris are shrewed business women.","post_message":"Remember Paris Hilton? She's back, and she's letting it all hang out."},{"comment_id":"10153086110919411","commenter_b":"she is a child","commenter_a":"She just got out of jail 2 weeks prior for car theft and now was in another stolen car and tried getting away using the car as a deadly weapon, the cops have no idea who is behind the wheel, it doesn't matter at that point. Dumbass brought it on herself!","post_message":""},{"comment_id":"905632936170129","commenter_b":"No mames wey pobre jente k vive cercas!!!","commenter_a":"Luis atacko godzila.","post_message":"Huge Chemical Plant Explosion In Tianjin, China!"}]
