[{"comment_id":"10153730231431337","commenter_b":"Because women should only pursue careers that focus on their looks, right?","commenter_a":"Fxxx her kickboxing career shes georgus","post_message":"TOO BIG? This MMA fighter's \"12-pound\" breasts are ruining her fighting career..."},{"comment_id":"10153719523799138","commenter_b":"What is,wrong w people???? If they have,an \"urge\" can't they have,any self control! !! Haven't people heard of video surveillance? ? Makes me wonder what else they've done that hasn't been detected...","commenter_a":"It's too bad that the media gets a hold of these stories and everybody believes them. That's not to say it didn't happen. Some children do lie about these things.","post_message":"The teaching assistant has been taken into police custody and is no longer an employee at St. Louis Park Public Schools."},{"comment_id":"10153703275114384","commenter_b":"Whine, whine, whine. All the illegals will vote for hand outs, what more do you corrupt fools need? Lying POS!","commenter_a":"BLUE ALL THE WAY!!!","post_message":"It is inexcusable for Republicans to have left town without acting to restore the Voting Rights Act. Click LIKE if you agree: Nothing should stand between American citizens and their most sacred right to vote."},{"comment_id":"622131437962489","commenter_b":"That's a women? Wtf","commenter_a":"Stevo Reed bruh","post_message":"Freddie Gray’s mother Gloria Darden pledged to keep fighting for her son after news broke that all remaining cases against the officers charged with his arrest and death would be dropped: @webpagelink"},{"comment_id":"10154880669523614","commenter_b":"Let them go there and put up another wall.","commenter_a":"Now there's an idea, send them all there not here. Works for me.","post_message":"Canadian Prime Minister Justin Trudeau's immigration minister has declared an open door policy for immigrants and refugees."},{"comment_id":"10153144460870950","commenter_b":"Rules are rules and the parents are aware of them before schools starts. There has to be more to this than what is being said by the parents. Schools are not allowed to say anything regarding any matter involving a child. Before I can make an opinion on the matter would like to know the schools side on it.","commenter_a":"That's an understatement...","post_message":"The 8-year-old girl's mother says the elementary school sent her daughter home for wearing a kelly green polo shirt."},{"comment_id":"1848439335433149","commenter_b":"Keen 😜","commenter_a":"@username @username Mari Funfax","post_message":"Put us on the next plane to Dubai."}]
