[{"comment_id":"10153080456176051","commenter_b":"Feral pigs are a huge problem in this country.","commenter_a":"I am NOT a liberal, and do not believe in hunting for sport! Why do people who hunt, feel the need to post morbid pictures of \"their kill\" Is it to prove something?! Not many people want to see that!!","post_message":"These hunters have one message and one message only for their critics: get over it."},{"comment_id":"1357571687635909","commenter_b":"Kidult fan!","commenter_a":"That's what the fans should be saying to you","post_message":"Don't get us thrown out of Euro 2016"},{"comment_id":"10154326754201636","commenter_b":"Well I don't think she has that strength","commenter_a":"Can she slap Nigel Farage and Boris Johnson, and get away with it?","post_message":"The incredible powers you didn't know the Queen wields"},{"comment_id":"1667152256905944","commenter_b":"Why do we have this question. If they are illegal the only right is to be fed on their plane ride back home. On the other hand I have the right to protect my family, land and myself from these criminals. If they have kids then they have a choice, leave with the kid or leave without the kid and never see him or her again. All connections to the child will be erased from our records so you can't track them.","commenter_a":"They are NOT U.S. Citizens, so they shouldn't be allowed to vote.","post_message":"I agree!"},{"comment_id":"10153930448466323","commenter_b":"And you are a very unattractive white woman","commenter_a":"She is a fat, untalented negro who should have made the best political statement by boycotting the super bowl... It's disgusting that stupid entertainment pays people so much while so many are suffering... My husband saves lives for a living and paid way more for his education than any of those people and makes a fraction of what they do... All of them disgusting","post_message":"\"This is not some sudden awakening for Beyoncé – she has given millions to the homeless in Houston, her home city, she and her husband Jay Z have bailed out Black Lives Matter protesters in Ferguson and Baltimore. But now she is moving this highly visible assertion of identity centre stage. Her blackness, her femaleness, her pride, her politics, are not some kind of mysterious subtext.\""},{"comment_id":"1708937832702911","commenter_b":"I would like one illegal immigrant or one Mexican to please answer this question. Why is an American considered a racist because we want a wall to control the people that we allow in this country. You just can't have open borders and allow anybody and everybody to come in that is not a country anymore. Furthermore why is it that Mexico has a Huge fence with Barbwire and guards in towers with rifles by the Mexican Guatemala border??? What hypocrites!!! Maybe because Mexico does not want illegal immigrants coming into their country from the Guatemala border but Americans are racist if we don't want illegal immigrants coming into our country. Totally absurd!!","commenter_a":"And they have the Bundy 's in jail and killed Levoy . These violent protesters get to go home alive .","post_message":"HOW INSANE! Photos and videos you must see from last night:  @webpagelink"},{"comment_id":"10153627073939170","commenter_b":"It's gone too far when instead of protecting himself he thinks of the headlines to come and takes a beating.. Time to put the animals back in they're cages.","commenter_a":"I don't have military training or police training but why couldn't an officer shoot towards the legs and feet to attempt to wound or even scare and attacker. I know you would have to worry about the femoral artery and even ricocheting bullets but I seriously doubt every round fired allways hits the intended target when trying to shoot at center mass.","post_message":"Way to go, media. The crooks know the score now and they're taking full advantage."}]
