[{"comment_id":"1300941689949097","commenter_b":"She is to evil to regret anything !","commenter_a":"Angela merkel is romancing with muslims. She will regret later","post_message":"CAN THERE BE A DUMBER COUNTRY ON THIS PLANET?"},{"comment_id":"10153288258378854","commenter_b":"I'm seeing a lot of CRAP posted by: Sumah Volmarius. Pretty sure she's an OBAMA COMMIE...!!!","commenter_a":"If this is true why haeve w not seen this on the news, this is outragious .","post_message":"New Executive Order: Obama Takes Total Control of Internet: Declares ‘National Cyber Security Emergency’"},{"comment_id":"10153001285494091","commenter_b":"Why have a trial for this garbage. Execute her already.","commenter_a":"savage.","post_message":"\"Everybody wants to know. Yes, I did kill her. The mother accused of killing her two children and storing their bodies in a freezer yelled in court that she killed them: @webpagelink"},{"comment_id":"10153302212427439","commenter_b":"All other real religious beliefs will be outlawed !! Muslims don't do real religion ,,!!","commenter_a":"I guess he's all for isis and how shiria law can't be separted from the musilim religion they go hand and hand. And he's all in for this no such thing as islamophobia we can and will protest any genocide against anyone","post_message":"This is full blown sharia in the UK – not only will our ban not be lifted, I would expect more voices of freedom banned. UK: Labour leader says his government will criminalize “Islamophobia”, (thanks to Jihad Watch), April 26, 2015 We are going to …"},{"comment_id":"10153607443456130","commenter_b":"She is a fucking war criminal.Are you guys fucking high?","commenter_a":"I hope when this all over H.A. Goodman writes Hillary Clinton a thank you letter, because writing about how bad he thinks she is regardless of the facts is basically his entire career.","post_message":"\"The only leading candidate in 2016 (Ted Cruz, like Trump and Clinton has a negative favorability rating) with positive favorability numbers is Bernie Sanders. Think about that for a moment.\""},{"comment_id":"1203190183110565","commenter_b":"And Trump will build a wall and call you a rapist!","commenter_a":"It happens every election year, Bill Clinton (2 terms), G.Bush 2 terms, Obama 2 terms they pander for our votre (Hispanic) and once they get into office what do they do for the Hispanics. Bill Clinton had a few token Hispanics in his administration so did George Bush and very few with President Obama. Now Clinton and Sanders are also clamoring for our vote. They will probably get the majority of Hispanics to vote for a Democrat but I have a feeling that once Sanders or Clinton get in it will be more of the same for Hispanics in high governmental positions, Nada or muy poquito!, Trump has alienated about 99.9% of Latinos and every other race and if he gets in who knows what he will try to do with every so called minority group in America. The KKK will administer Homeland Security, the Amereican Nazi Party will administer ...","post_message":"The state so rarely has much say in a presidential race..."},{"comment_id":"10153365714833352","commenter_b":"Stupid bitch!","commenter_a":"Mental illness is real...","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"}]
