[{"comment_id":"1054613801267881","commenter_b":"If they don't want to abide by our laws then go back to where you came from.","commenter_a":"I am sorry, but if you live in America, our laws trumps your religion.","post_message":"Muslim who refuses to remove head covering for officers gets rude awakening. Regardless of religious law, this is a safety concern. Do you think she got what she had coming?"},{"comment_id":"888228281273425","commenter_b":"Go baby go! There is no one more capable to speak for the down trotted, our Vets and what wars do to people than you! And you are a hero and thanks a million for your dedication and Service!","commenter_a":"Go Tammy!","post_message":"She’ll challenge GOP Sen. Mark Kirk in the 2016 election."},{"comment_id":"10153810770121336","commenter_b":"A woman who associates with a child abuser (most especially her own child's abuser) should not be allowed on television ! Creepy woman !","commenter_a":"Nope - why? She broke?","post_message":"Will you watch?"},{"comment_id":"1162468617182722","commenter_b":"The magic number is 2026, half of 4051 . Bernie gets to that number the superdelegates have to support him.","commenter_a":"Bernie could win every state from here on out and Hilary would still be leading in the polls and delegate count. ..","post_message":"Hillary Clinton's margin narrows to just 6 points over rival Bernie Sanders."},{"comment_id":"10153460687383598","commenter_b":"Wretched evil vile women","commenter_a":"These sick people are going to BURN IN HELL","post_message":"NEW VIDEO: Planned Parenthood official caught selling aborted baby's eyeballs"},{"comment_id":"10153190415066037","commenter_b":"#TooBadBitch","commenter_a":"Please let him lose !","post_message":"BREAKING Israel Prime Minister Netanyahu and center-left opposition tied in election exit polls"},{"comment_id":"10154121489376350","commenter_b":"She's wearing lipstick","commenter_a":"Can we ignore the makeup issue for a second and talk about the fact a 42-year-old just wrote a book telling us how to age? 42? Girl, you've only just begun to age, check back in your 60s and we'll talk.","post_message":"Gorgeous, Cameron Diaz!"}]
