[{"comment_id":"10153188549718812","commenter_b":"Why don't they beat men cuz the guy cant","commenter_a":"Good","post_message":"JUST IN: NASCAR says driver Kurt Busch has been suspended indefinitely: @webpagelink"},{"comment_id":"959675597399526","commenter_b":"Hillary 2016 Hillary 2020","commenter_a":"Hillary!","post_message":"It sounds like voters have already decided who they are going to vote for in the presidential election. Have you?"},{"comment_id":"10153937111420695","commenter_b":"Girl you got something to be thankful.","commenter_a":"God bless","post_message":"“Everybody at the church got up and started handing the preacher money, and it was just crazy. So many people got up. They started hugging me. It was just awesome. I couldn’t help but cry. It was just amazing,” the mom said."},{"comment_id":"10154439835324203","commenter_b":"It takes brain power to watch a documentary? Lol","commenter_a":"not many of Trump's supporters read these guys, nor watch PBS documentaries, too much brainpower needed.","post_message":"David McCullough, Robert A. Caro, Ken Burns (PBS), and more have stepped up."},{"comment_id":"1877645852479520","commenter_b":"Me thinks Conservatives protest to much! There was no outrage when Sen.Foley was exposed for pedophilia, in fact 36 other senators wrote impassioned letters begging for mercy for Foley. Trump bragged about oggling young girls naked at Teen Miss America and 46 million people didn't think it was a big enough issue to prevent a pedophile from becoming President. It is clear Conservatives sexual icing children is okay!","commenter_a":"Karma!","post_message":"BREAKING"},{"comment_id":"10153268885327452","commenter_b":"COWARDS","commenter_a":"Nancy, you cannot be serious surely...better for who? It's always been dreadful since the concept of Zionism reared its ugly head and will never be any better only worse until Zionism is banished totally and the Palestinian people allowed to dictate their own terms. Israel should have no say in the matter, only the people who lived in Palestine and can prove it, no matter what their religion, should have the say in the reconstruction of Palestine. If squatters are to be repatriated whence they came so be it including Government ministers down to the last one of them.","post_message":"Mahmoud Alayan was fatally shot by an Israeli soldier while carrying a stone in his hand"},{"comment_id":"10154216584759203","commenter_b":"Ivory towers allow a lot of false logic. She'll just fly away to her mansion. No skin off her nose.","commenter_a":"I thought, \"Well she is on with Bill Maher. Lets see how she explains this away. And all she did was lie. She said she simply said yada and the people who were complaining didn't see the interview. Well I saw the interview and she lied. Not to be undone though, after a few minutes with Bill Maher, she actually showed her true colors and did admit what she believes. Then to top it off, as soon as Bill Maher brought up their support for Ralph Nader, which cost the country GW Bush and millions of lives, she simply interrupted, pivoted and changed the subject. She is a horrible human being and I wouldn't watch another movie with her in it on a bet...even if she does have the best rack of any 70 year old(Oct) I've seen.","post_message":"Susan Sarandon found herself in the hot seat Friday night."}]
