[{"comment_id":"10153874445353132","commenter_b":"Women WE MUST UNITE AGAINST STUPIDITY!,","commenter_a":"Did y'all read the article or just start running off at the mouth?! I, too, had the same reaction until I actually read the article. This congressman did not come up with this if his own accord. It was reported to him by the ones who trained them. THEY said there was special treatment.....not the congressman.","post_message":"\"Fighters must be prepared and capable. If they are not, people will die.\""},{"comment_id":"10154398240872293","commenter_b":"There is strength in numbers. So many Nasty Women","commenter_a":"Bikers for Trump and oath keepers pls be ready to welcome them!","post_message":"While President-elect Donald Trump’s remarks served as an impetus for the protest, a march organizer said it won’t be an anti-Trump rally."},{"comment_id":"10154948296594203","commenter_b":"all the illegals voted too..","commenter_a":"Hillary has 2,017,563 extra votes then Trump. The difference of extra Two Million+ vote which can give a decisive victory to a candidate \"anywhere else in the world\" has ZERO value in America?","post_message":"BREAKING."},{"comment_id":"960983097307632","commenter_b":"At the last supper, JESUS told the disiples that if they had own sword, to sell the cloak to by one. Peter was carrying in the garden. This old mam does not know the BIBLE.","commenter_a":"If you own a gun you can't be a believer??? God has not revealed that to me. Where in scripture did He reveal that to you your holiness???","post_message":"Can you believe what the Pope said about gun owners? I'm stunned: @webpagelink"},{"comment_id":"10153981739504091","commenter_b":"Go stick your head in a latrine!","commenter_a":"What did he know about the Clintons?","post_message":"RIP: The star of reality series Ice Road Truckers on HISTORY was killed in a plane crash while he was planning to film a show about recovering plane wrecks."},{"comment_id":"10155143983283010","commenter_b":"GIRL WHY YOU MUFASA","commenter_a":"Ben Rotherham GAMBI AS SIMBA THIS IS NOT A DRILL","post_message":"James Earl Jones is reprising the role of Mufasa, and Donald Glover is taking on Simba."},{"comment_id":"1123813841007500","commenter_b":"Illegals, you don't like our choice for president please do us a favor and go back to yours!","commenter_a":"Trump brought half his votes!!!","post_message":"WATCH LIVE: President Obama awaits Donald Trump's arrival at the White House for transition meeting. Story: @webpagelink"}]
