[{"comment_id":"10154807734390115","commenter_b":"Marcia, Dont insult the neanderthals by comparing them to prolifers. 😂","commenter_a":"Wow, some one just said men cause pregnancy! Considering it take two haploid cells to make a child.","post_message":"LIVE: Planned Parenthood supporters hold a rally outside the St. Paul, Minnesota, headquarters alongside Planned Parenthood protesters."},{"comment_id":"10153203581878984","commenter_b":"Didn't a bunch of people get in trouble for using their own private email accounts for using government email accounts during an election. Why is it different with this woman she should have to open up every single email ever written or received just because it was her so called private account she did government business on it so that exams her from any protection","commenter_a":"God Bless you, Trey Gowdy !!!","post_message":"Hillary’s private emails could contain the smoking gun regarding the scope of her involvement in the Benghazi attacks… Send an email to Rep. Gowdy demanding answers from Hillary and the State Department!"},{"comment_id":"10154577788564726","commenter_b":"New York should have voted smarter.","commenter_a":"They are so crazy. Now I start feeling sorry for them.","post_message":"He's taking a queue from Obama's playbook..."},{"comment_id":"1033609543378017","commenter_b":"Arrested???? WE OWN THIS BUILDING!!!!, and ALL THE GOVEMRNNENT BUILDINGS. BOUGHT, BUILT AND MAINTAINED WITH OUR TAX $$$$$$$$","commenter_a":"Yes!!! #DemocracySpring is currently trending on Facebook!!!","post_message":"The Young Turks live from the Democracy Spring: Sit In. Save Democracy. protest in Washington, District of Columbia - The police are arresting people now."},{"comment_id":"10154467987919342","commenter_b":"Ban cars. They kill more people than guns.","commenter_a":"Guns. Taking people's lives needlessly everyday because we let anyone and everyone have them. Not it's not a mental health issue. It's the acceptance of daily gun violence in our society. People will read this story and move on. Congrats NRA. Kill more Americans daily for our freedom to own guns. #GunsHaveMoreRightsThanPeople","post_message":"#Breaking: I 69 at Spur 527 is completely shutdown after a minor accident led to a deadly shooting."},{"comment_id":"742612555896157","commenter_b":"We need women unless you enjoy cocks in your ass","commenter_a":"FINALLY WE CAN GET RID OF THE PLAGUE CALLED WOMEN","post_message":"The infants were carried to full term, and seem to have no health problems."},{"comment_id":"723294587810406","commenter_b":"Leah sure! Hillary's leaked email referrer's to Mexican's as \"taco bowls\". That says it all right there. Racist as anybody can be.","commenter_a":"Hillary no lo hace un coche de usted . Solo su voto","post_message":"\"Do all the good you can. Measure your life by the positive effect you can have on other people’s lives. Be of service to one another.\" —Tim Kaine"}]
