[{"comment_id":"1067333573359551","commenter_b":"Latinos with Hillary!!","commenter_a":"Thank you Hillary for running and you've got our votes!","post_message":"This is a moment when we all need to stand together. Watch live as Hillary speaks on the terrorist attack in Orlando."},{"comment_id":"10154327831686509","commenter_b":"If this candidate is the best the Republican Party has to offer - why vote? Hillary will win! Trump doesn't nothing but trash! What is he going to do for this country other than blame everyone else?","commenter_a":"Sorry Tom. But I like Trump. I like strong men. Who make strong decisions. And I thing he is what we need at this time.","post_message":"For Donald J. Trump, Christmas doesn't seem to be the season of peace"},{"comment_id":"10154455210992577","commenter_b":"Mite as well. Hillary going to rig it so why not lol","commenter_a":"If the biggest criminal in the world doesn't want all that competition from Hillary who can blame him?","post_message":""},{"comment_id":"10153519416973812","commenter_b":"God rest their souls! That sicko should rot in hell!","commenter_a":"R.I.P god bless this good people.","post_message":"These are the 9 people who lost their lives after a gunman opened fire during a bible study at a Charleston church: @webpagelink"},{"comment_id":"696428793854373","commenter_b":"Because his mother does what every south african women does ! Drink and try to get pregnant so they can qualify for more government grants so they can get more money for doing nothing and then they will leave a child at the grandparents for the full monty payout !","commenter_a":"At the end of the day. Why the hell why was a 3 month old its own.","post_message":"This is horrifying!"},{"comment_id":"1008136642595139","commenter_b":"Not hardly! Idol contestants bring all they've got and lay it all on the line. \"What you see and hear IS what you get\", so that makes it easy to vote for the best. Presidential Candidates. ...... What you see and hear isn't always what you get which makes it very difficult to vote for the better of all the evils.","commenter_a":"I think Obama doesn't have a clue. He thinks we live in a world full of unicorns and rainbows","post_message":"In the unexpected opening act, President Barack Obama said he thinks voting for president \"should be almost as easy as voting on 'American Idol.'\" What do you think?"},{"comment_id":"10154901503909641","commenter_b":"From our childhood we used to draw it on our notebook hoping for good fortune and will continue I dun care what the world says","commenter_a":"James Higgins-Durnan","post_message":"Conal Footwear apologized and recalled a line of boots after a viral image showed they left swastika imprints @webpagelink"}]
