[{"comment_id":"10153130571029726","commenter_b":"Is that considered a rhetorical question? I think you know, and I'll add that all those girls need to be caged.","commenter_a":"Animals.","post_message":"VIDEO RAW footage of 4 teens viciously beating a girl in Brooklyn McDonald's as a crowd cheers them on. Why do parts of society cheer and take pleasure from this type of sheer brutality?"},{"comment_id":"10155151298004170","commenter_b":"@username And what disappointed me the most was our President never called for people to work together and come together as a Nation. It was like he wanted the divide! So sad for this nation!!","commenter_a":"I figured this out after his first term. If you believe the media, he did a great job. The numbers don't lie. He did zero except stir up racial divide. That is his legacy.","post_message":"Years in office: Eight. Years with GDP growth of 3 percent or better: Zero. The final report on 2016 seals his fate as a historic failure."},{"comment_id":"867088560054064","commenter_b":"A SMART WOMAN....not that stupid one!","commenter_a":"Ann Coulter","post_message":"There’s a growing movement to have a female hero replace Andrew Jackson on the $20 bill."},{"comment_id":"995637910477067","commenter_b":"HATE this hypocrisy. It's perfectly acceptable to tell a skinny woman to eat a hamburger or something, but if that woman then responds with \"eat a salad\", she's seen as a cruel bitch. Hate it!","commenter_a":"Prefer Pink any day to those anoreic coat-hangers.","post_message":"We love this tweet from P!nk about how you don't need a \"perfect\" body to be happy. <3"},{"comment_id":"1321737624513912","commenter_b":"So they're not seen as better coders, they're better coders who happen to be women!","commenter_a":"If all 4 of the total androgynous coders had 80%of their code approved, would that mean androgynous coders were superior than both other genders? How about keeping to the science topics, not social engineering propaganda.","post_message":""},{"comment_id":"10153824144307235","commenter_b":"These Kurdish Women have more Balls than these Idiots...","commenter_a":"Give dad and son some boots and send them to iraq","post_message":"The photo was rejected because school officials believe “it promotes violence and breaks federal and state law.”"},{"comment_id":"1452171914802834","commenter_b":"The only thing Hillary Clinton is going to do is be the 2nd woman to run for president and loose.","commenter_a":"Go Hillary it's an excellent speech","post_message":"\"Now Donald J. Trump says, and this is a quote, 'I know more about ISIS than the generals do….'\" \"No, Donald, you don't.\" Read more of Hillary Clinton's DNC speech: @webpagelink"}]
