[{"comment_id":"467950796728834","commenter_b":"Don't deport them-KILL THEM! They will only return if we don't . Simple truth","commenter_a":"He'll yes. Send them back were they came from. We are running out of bed sheets. Lol","post_message":"Do You Support Muslim Deportation In The United States? Comment 'yes' or 'no'."},{"comment_id":"1006229472770134","commenter_b":"You seem a lovely Christian...","commenter_a":"Scum bag,evil,man!! He's a Muslim running America,funding ISIS","post_message":"'Welcome home, Mr President'"},{"comment_id":"608368836001258","commenter_b":"Rigged? Really?? LOL!! Of course ir was and the next ones will be also! Did you notice the \"Hill\" isn't even wearing an American Flag pin? She didn't have any American flags at the convention either till the media mentioned it. A real pice of S===!","commenter_a":"yep when hillery was wired so she could be told what to say","post_message":"A rigged election!!"},{"comment_id":"10153832289717061","commenter_b":"Wow. This mf","commenter_a":"Only 1 million?","post_message":"Taylor Swift vows to donate $1 million to relief efforts in Louisiana after devastating flooding damaged 11,000+ homes."},{"comment_id":"611037522408756","commenter_b":"Is this trump's doing ? Has he stirred up so much open racism that a judge would feel more compassion for a white kid ?? Was there a bribe ? Maybe the judge himself is a pedophile? ? This absolutely makes no sense whatsoever. I'm so sick of these judges who release all these rapists back into society. Arrest these judges !!!","commenter_a":"I agree. It is an outrage! I am sure if he had been a minority he would have gotten life in prison!!","post_message":"This is an absolute OUTRAGE."},{"comment_id":"10152884821337093","commenter_b":"Why a woman?","commenter_a":"If it ain't broke don't fix it","post_message":"Which American woman deserves to be the new face of the $10 bill??? @webpagelink"},{"comment_id":"10156408466705354","commenter_b":"This woman is so disgusting! I can't even stomach accidentally surfing and the view is on for the second it takes for me to change it!","commenter_a":"Don't watch that show. Should be taken off and replaced with Mr. Roger's Neighborhood reruns.","post_message":"Maybe they should open every show with a preemptive apology for all the mind-blowingly stupid things they're sure to say. VIDEO below of their latest..."}]
