[{"comment_id":"10154339117992619","commenter_b":"THERE JOINING ISIS WILL LIBERATE THEM FROM ALL THERE PROBLEMS","commenter_a":"SO YOUR POINT IS ????","post_message":"A transsexual man and his gay female friend, have left to join ISIS, unaware that ISIS publicly executes gay people by throwing them off buildings and stoning them."},{"comment_id":"10157411786570594","commenter_b":"Mean douches create little mean douches. The parents created these mean little spawns.","commenter_a":"why does the school district tolerate this? those kids should be expelled and parents should be educated about this....","post_message":"His mother has pulled him out of the school."},{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. \"We hope and pray the U.S. Coast Guard is able to bring Samantha home.\" @webpagelink"},{"comment_id":"949815198400996","commenter_b":"@username China built a 13,000 foot wall over 2000 years ago. You don't believe we can build a 1000 foot wall? --- I live in California and illegal immigration is a huge problem that you clearly don't understand. Please take some time to do some research. Let's Make America Great Again!!! Cheers for Trump!!!","commenter_a":"Sir Newt may be one of your best choices as a Vp, he knows the political game better than most and is not the typical establishment guy, his IQ is also very high, I hope he is on your short list, to at least find a spot on your cabinet","post_message":"Via Newt Gingrich: Donald Trump's foreign policy speech is about putting AMERICA FIRST! I had been calling for an overhaul of the foreign policy establishment at the State Department since at least April 2003, when I gave a speech at the American Enterprise Institute calling for completely transforming the Department. And I first warned that America had “gone off a cliff” in Iraq in December 2003........"},{"comment_id":"10154872503577042","commenter_b":"If the child is deemed not viable for life outside the womb they will grant an abortion however get this there is nothing written into this law to protect the mother or take her health into consideration at all. It is a disgrace!! Turning women into human incubators whose body is controlled by the government.","commenter_a":"Wow are people really so uninformed? What if the baby has a condition incompatible with life or if the mother's life is at risk? What if it's an ectopic pregnancy that isn't always known by 6 weeks?","post_message":"Ohio lawmakers have passed a bill that would ban abortions in that state from the moment the heartbeat of a fetus can be detected."},{"comment_id":"1110994785663439","commenter_b":"All Hillary does is pander and shift her views to what's convenient for her.","commenter_a":"Democrats should Support Democrats , Bernie isn't a Democrat only in convenience, Playing basketball doesn't and shouldn't mean you support Minorities, where you live is who you are and in Vermont Bernie is 91% White?","post_message":"JUST IN: The Congressional Black Caucus PAC endorses Hillary Clinton for president."},{"comment_id":"10152554042082623","commenter_b":"Girl bye lol","commenter_a":"It looks like a H.I.M. sticker lol also the pentagram/pentacle is an ancient symbol that represents the great spirit, and the elements air fire earth and water...upside down means nothing as there is no Satan and no Jesus. .... someone needs to read something OTHER THAN THE BIBLE HAHAHA","post_message":"A woman says she snapped a picture as soon as she spotted what she says is a symbol of evil in these school bus brake lights."}]
