[{"comment_id":"10154773746046350","commenter_b":"That is so awesome-we need more of this-people helping other people-","commenter_a":"I was in an abusive relationship with an alcoholic constantly trying to keep him out of jail, take care of our 2 young children and working as a bartender. I lost a job due to not having a sitter while their father was in jail. Little did I know, 2 people who used to come into my old employment owned a small family bar and needed help. They contacted me and offered me a job. I had only been there for a short time and my boss lent me money to get my boyfriend out of jail. After a month when I reached the end of this relationship my boss lent me his car and more money to get a place and get on my feet. He never took the money I owed him out of my check. He told me to pay when I could. Every year for 3 ...","post_message":"What's the kindest thing that someone has ever done for you? Tell us in the comments below.    TODAY is kicking off our second annual #ShareKindness campaign with a goal of inspiring 1 million acts of kindness by the new year. @webpagelink    Our sponsor The Y is helping us out by committing to the first 10,000 acts."},{"comment_id":"10152929148789342","commenter_b":"That statement coming from a welfare trashy tattooed old skank. Go figure.","commenter_a":"aand let the killings begin...smh","post_message":"BREAKING -- The Texas Senate has given preliminary approval to allowing concealed handguns in college classrooms, a day after passing a measure allowing open carry of guns most everywhere else in America's second most-populous state.  FULL STORY ---> @webpagelink/  What do you think -- are guns on campus a good idea?"},{"comment_id":"10153447455781051","commenter_b":"Trash get class Ur pregnant!","commenter_a":"Well if there married its her car too sucks to be him hopefully the baby in her tummy is ok","post_message":"When passersby saw this pregnant woman smashing a car in the parking lot, they ran outside to stop her. As soon as they learned why she was doing it, they let her continue"},{"comment_id":"10153362253533132","commenter_b":"Please dont let her walk free like Casey Anthony is walking free. If she wants to kill herself let her. She is not a mother. A mother doesnt kill her children AND take pictures of it!!","commenter_a":"Leah Stevens","post_message":"In the arrest report, detectives reported finding an open journal with an entry addressed 'To My Family.' According to authorities, Jessica McCarty apologized for what she was about to do."},{"comment_id":"1360247024053830","commenter_b":"Get these bastards out of our country they are worse than maggots","commenter_a":"Ship her sorry ass back to the Middle East. She will be the one spit on.","post_message":"This Muslim did something absolutely SICK to white Americans at Walmart... She's now facing hate crimes charges over this... wow."},{"comment_id":"10153963536777235","commenter_b":"And a large percentage of illegal immigrants simply come here legally with a visa and just don't leave.","commenter_a":"The wall is absolutely absurd. See the ocean? You can use it to go around the big ugly wall. See the airplanes? You can go over the wall. Ask El Chappo about going under things. It's nostril flaringly stupid. Ancient technology. Pre airplane, backhoe and no ocean on either side. It would be funny if there weren't so many truly stupid people believing it. Gag, cough, hurl.","post_message":"BUSTED!"},{"comment_id":"1065496103473179","commenter_b":"J.K. needs to mind her business.","commenter_a":"WOW! She shut it down! OMG! Trump is backing down because a writer...no wait! This article isn't about the writer...it's not about Trump. It's about Pierson. No wait, it's about a writer comparing to one of her make believe characters. Jesus, if your going to attack; pick an opening paragraph and stay on topic. If you can't do that...atleast get the headline to reflect the topic...","post_message":"Just 5 words  and they say it all."}]
