[{"comment_id":"1084778228228546","commenter_b":"they go around and touch people like mother theresa What is your POLICY?!","commenter_a":"The only barriers I have is the hidden files on JFK. Please be more of a transparent President and release all of the hidden files regarding my (past life) assassination. Thank You, very much.","post_message":"\"We can open the door to every person in this country again.\" —President Bill Clinton"},{"comment_id":"10152692190456636","commenter_b":"Because of course it's the woman's fault! We are female, wear thongs and stiletto heels so obviously that translates to \"I want sex and will have it with anybody and my screams of no & stop obviously mean, yes!\" And if you go to court they ask questions about your underwear and what we're you doing out. Never ask the rapist what he was wearing or why he thought you walking down a street by yourself translates to brutally attack and rape me. It's 2015 the world has come far but on certain things importance ranks zero.","commenter_a":"road","post_message":"'I witnessed this years ago, after I was raped myself'"},{"comment_id":"10154122755384641","commenter_b":"Jajajajajajajajajajajajaja Trump for better world? ...dig a hole in your yard lady. ..","commenter_a":"Wish I could go back to 1945, find Donald Trump's father and give him a condom.","post_message":"With the growing chances of a Donald J. Trump presidency, world leaders are beginning to swallow their previous distaste."},{"comment_id":"10154048285749087","commenter_b":"She's a flippin' wreck yust waiting to happen....","commenter_a":"Lol they are dragging on the L for her fans","post_message":"BREAKING NEWS: Another very bad poll for Clinton."},{"comment_id":"10153258097608984","commenter_b":"And reporting them doesn't help. Even though you should ... This is disgraceful","commenter_a":"The sick part is my neighbor/friend gets 1800.00 a month via foodstamps and cash aid. Crazy huh. And she's an illegal and so is her boyfriend.","post_message":"Wow, I had no idea the government could do this. Now I'm terrified...  Are you tired of getting pushed around by big government?"},{"comment_id":"10155155433964778","commenter_b":"She wasn't a black swimmer to me until the media and people who keep stressing the fact of the first \"African American\" ... First off the has been in the past but what I see of anyone in the Olympics is an athlete who trained very hard and worked through their own adversities to reach their goals. To me African Americans want the dividing line to diminish, I know I treat people as people so I think the media should stop putting a dividing line there. I don't care who you are if you want to do a sport and make it to the Olympics with hard work and perseverance you can make it, it's not your color that helps you make it.","commenter_a":"She was just another amazing swimmer to me. I didn't think about her race...SHE made that the issue. It's hard to be colorblind when it keeps getting made an issue BY THE ONES COMPLAINING!! WTF!","post_message":"\"I want to be an inspiration, but I would like there to be a day when it is not ‘Simone the black swimmer.’"},{"comment_id":"517780028410290","commenter_b":"Send them to a boot camp along with their parents, they soon will learn respect! And cut off their welfare,so tired of supporting these aminals!!!","commenter_a":"THE BOY IS A PUNK","post_message":"INSANE..."}]
