[{"comment_id":"10154789574398132","commenter_b":"Sick people. Why do they need a child when they are idiots","commenter_a":"This is disgusting!!! Hope they rot!! That poor baby. I'm sure he has seen this many times in his short life. I'm sad for him.","post_message":"Ohio police have posted shocking photos of unconscious adults  who they believe overdosed on heroin."},{"comment_id":"512912212228885","commenter_b":"Beyonce!!!!!!!! Gave them the green light.. They wAnt what you have but don't want to educate themselves or help themselves. LAZY","commenter_a":"I think that this man that served alongside of every single race in the world as a brother, was assaulted by black thugs representing their selves as Black Lives Matter. Now let's see if someone from BLM will stand up and condone this behavior, or embrace it. There is racism in every race, but the citizens that stand alongside each other and condone this, are the true brotherhood.","post_message":"*****BREAKING NEWS*****  They said these 6 words..."},{"comment_id":"10154306785891130","commenter_b":"Hillary's crimes against women will get the best of her.","commenter_a":"Bush was 33, Trump was 59, its easier to fall and be impressed by a rich man at that age Trump should have act like the grown up. Trumps ego will get the best of him yet.","post_message":"But Donald J. Trump is still a presidential candidate."},{"comment_id":"810146635842580","commenter_b":"Aye.","commenter_a":"now they need to lock him and the rest that have been letting him get away with everything.","post_message":"Supreme Court Strikes Down Obama's Executive Immigration Order  This is huge. Finally the Supreme Court does something right.  Do stand behind their decision?"},{"comment_id":"1038233369545417","commenter_b":"Can't stand her!","commenter_a":"I stop to watch her program Always bashing on the same person all the time ! I did think that during the first debate the question was legitimated after all he has to respond because the question was going to be asked from her or somebody else But after all the bashing my trust in what they call fair and balance news under her reports was gone and I was certain that She did have an agenda by starting by this type of question Also what is making me mad is all the spin around her the queen She giggles all the time even when her guests are vulgar in her program It made me laugh when I ear that she is a respectable journalist and fox stands for her Did they listen when she was giggling from her heart when somebody said that during one of the debate ' ...","post_message":"Megyn Kelly didn't hold back! (WATCH)"},{"comment_id":"248420038902239","commenter_b":"Shouldn't she be starring in class B horror films?","commenter_a":"She's a fucking bitch and a liar and top of it😡😡😡😡","post_message":"''Alternative facts' are not facts. They're falsehoods.' Sean Spicer, Conway, and Trump tried to lie about the size of the inauguration crowd, but Chuck Todd didn't let them get away with it.   Shared by Occupy Democrats, LIKE our page for more! Video from Meet the Press."},{"comment_id":"10154365677768008","commenter_b":"I just hope she don't hide when she delivers.","commenter_a":"Your Holiness, thank you for all you do for the world if you are watching!","post_message":"BABY WATCH (10am update): Still no baby giraffe yet! When do you think mom April will give birth at Animal Adventure Park? Don't miss anything: @webpagelink"}]
