[{"comment_id":"10154986550662767","commenter_b":"@username DO SOME RESEARCH, BITCH!","commenter_a":"I hope he meets a terrible demise. Like I am talking, Isis style, execution. In high definition, with fabulous audio. Now, I would read THAT book, for sure. I wish nothing but the worst, to this radical islamic Kenyon born, Isis daddy! I wonder what chapter of the book describes Michelle, peeling off sweaty duct tape, and revealing the SCHLONG, that MADE THE FREAK BATHROOM BILL? Trump is wiping any, and everything, this TERRORIST has done. #HeDontMatter #GhostPresident","post_message":"Obama is widely expected to get the most lucrative contract ever for a post-presidential memoir."},{"comment_id":"519829538184192","commenter_b":"Santagini - you are either batshit crazy or very funny.","commenter_a":"The traitor flag belongs in a military museum next to Nazi war memorabilia we took from dead Germans. You want heritage? Wave the white flag, that's your heritage.","post_message":"\"The time surely comes when [justice] must and will be heard,\" New Orleans Mayor Mitch Landrieu told the city council, calling for the statues of Jefferson Davis and Robert E. Lee.to be put in a museum. \"Members of the council, that day is today. The Confederacy, you see, was on the wrong side of history and humanity.\""},{"comment_id":"10153687652479885","commenter_b":"That was stupid! Sounds like she needs to take that conceal carry class again!","commenter_a":"If you pull a gun out you need to pull the trigger. Shoot to kill not just threaten.","post_message":"A Florissant man was charged Tuesday with grabbing a pistol from a woman Saturday as she was trying to prevent him from attacking her friend in University City, then beating her and her friend with the gun and shooting one of the women."},{"comment_id":"10153965773226491","commenter_b":"Jenny Minttych, nice fat shaming other women. Shallow.","commenter_a":"No comparison, diet and genetics are different from those days, every generation gains on the next in height and build.","post_message":"See how a size 8 has changed through the ages."},{"comment_id":"10154156171661509","commenter_b":"Who ever used the word 'liberal'? Labels are so 90s. I support Bernie because of his integrity, his consistency and his sincerity. I see none of those qualities in Hillary. I see the opposite in Hillary. I support Bernie because of his policies. Hillary uses too many weasel words when she talks about policy. She likes to leave the door open because she plans to make a hard right as soon as she's elected. She owes too many favors to the banks, corporations and wealthy investors who back her. They need a return on their investment and good ol' Hillary will no doubt deliver the goods.","commenter_a":"The media is dying to have Bush v. Clinton 2.0 so badly but I've never met anyone in person who thinks either of them would make a good president. It's a media manufactured dream match. Both of them would be bad for America but good for ratings. as long As I live I never want to hear the name Bush again and Clinton's got way too much baggage. Policy-wise Hillary is just a kinder face to the same neocon agenda that Bush would be peddling. Sanders is our best hope. Let's stop moving Backwards, let's move forward!","post_message":"Jeb Bush says Hillary Clinton is a \"smart person\" but is \"beatable.\" @webpagelink"},{"comment_id":"666551896811325","commenter_b":"Nah send the atheists and liberals and dems over to beg for coexistence. Please !!!","commenter_a":"I want all liberals to go meet isis and propose there coexist mantra. All of them! Now please!","post_message":"I am begging liberals to understand this!"},{"comment_id":"1265995716788763","commenter_b":"^fuck that baby","commenter_a":"What is up with this country? A woman owns her body and nobody can tell here what she can and can't do. Its called freedom.","post_message":"Millions of women rely on the health care services of Planned Parenthood, and we must stand with them. The women of this country have the right to control their own bodies, not politicians. No cuts to Planned Parenthood."}]
