[{"comment_id":"1134361886576067","commenter_b":"Totally agree!","commenter_a":"We need to have Trump supporters at all polling places. ALOT of cheating will be going on to stop Trump GET THIS WORD OUT.","post_message":"Things could always change, of course nothing is ever set in stone in a presidential race. But for the time being, Trump not only the party frontrunner, he is actually defining the race for everyone else"},{"comment_id":"1745160079101455","commenter_b":"No, I am convinced she has a serious mental health issue. She lies and lies about lying. She questions your temperament to lead? She is the psycho, literally, staying with her husband solely for political purposes while constantly defending her indefensible record of blatant corruption. And for what? Her relentless pursuit of more power to abuse. Hillary is not mentally fit to lead","commenter_a":"she looks sedated","post_message":"Bad performance with foreign policy \"speech\" yesterday, by Crooked Hillary Clinton! Reading poorly from the telepromter! She doesn't even look presidential!"},{"comment_id":"499057813618132","commenter_b":"just a rich, fat, black bitch","commenter_a":"Sick idiot","post_message":"Oprah is going after white people on live television. The hypocrisy is overwhelming. We need to show her we're not going to stand for this. Do you agree Oprah is a racist?"},{"comment_id":"1284242998285633","commenter_b":"Proving they are not protesting anything really. They are just out to murder anyone they can for fun! Thugs paid for by Soros, Clinton's, Obama and others wanting one world government. Just like the Nazi regime but it will be 10 times worse. Liberals are too stupid to realize that. Until something they voted for creates a bad situation for them. Then they blame everyone else.","commenter_a":"That is really beneath everyone.","post_message":"So basically, this is incitement to murder and cops should treat them accordingly...what should they do?"},{"comment_id":"1786411671679890","commenter_b":"Fucker","commenter_a":"@username sheep bitch","post_message":"100% accurate!"},{"comment_id":"481872515336662","commenter_b":"She's doing a great job! Leave her alone! You look half as good as she does, you wouldn't have a problem!","commenter_a":"She is great and a real threat to the liberals and they will go after her.","post_message":"Liberals are after Megyn Kelly after she falls victim to wardrobe malfunction. She is in trouble, we need to show her we have her back. Can we get 20,000 'LIKES' for Megyn Kelly?"},{"comment_id":"10157871036080354","commenter_b":"@username that just shows how dumb you are! You actually think that hackers need trumps permission to hack!","commenter_a":"Hillary to Trump: \"We had a deal Don, you were supposed to help me!!!!\" Lol.... Does no one understand the Trump's constitutional rights were violated when he was recorded without his knowledge? This is exactly why we need him. The rule of law is run amuck.","post_message":"WATCH:"}]
