[{"comment_id":"10152901034836636","commenter_b":"Karina a poopoo head","commenter_a":"Great! Don't terrorize kids! Be the adult. Do your job and treat everyone equally. Don't only attack the black kids.","post_message":"This just in: That Texas officer videotaped outside an pool party has reportedly stepped down from the police force."},{"comment_id":"1017722631617599","commenter_b":"@username, you and your daughters are throwing your votes in the TRASH then.......smh @username 2016","commenter_a":"I hope Bill & herself have plenty of room for the Syrian refugees, since She is so kind to the terrorist islamics. #Stupid to BRING THE ENEMY HOME!!! Utterly wrong. SHE HAS #LOST my Vote... and my two daughters Votes. #MARCORUBIO will be my choice now.","post_message":"We cannot allow terrorists to intimidate us into abandoning our values. Turning away orphans, applying a religious test, discriminating against Muslims, slamming the door on every Syrian refugee—that is just not who we are. We are better than that."},{"comment_id":"456612701195977","commenter_b":"Try shutting your mouth and your legs , bitch !","commenter_a":"yep a free ticket to Africa","post_message":"Should Blacks Be Compensated For Slavery? Comment 'yes' or 'no'."},{"comment_id":"10153780658736350","commenter_b":"@username I have no clue what you are talking about but let me clue you and those like you in on something .... we wonder why kids are shooting up schools and bully each other to death when all they have to do is look at ignorance like you for an example. Sit behind a computer screen and throw insults around like you are all important. You get on a thread and bash a new born baby and his parents that take care of them selves and don't do anything what so ever to you and the likes of you. Instead of passing over a story you don't want to be a part of you get on threads and be an ugly soul and bully people that are happy for this couple or any couple that lovingly gives birth to a much loved and wanted baby. Since you brought up ...","commenter_a":"People have babies everyday! Women birth children under horrible circumstances... Alone .. In poverty ... How about focusing on that instead of these irrelevant people!!","post_message":"Congratulations, Jessa Seewald and Ben Seewald!"},{"comment_id":"464590737066851","commenter_b":"Unbelievable , to do that to an Elephant . Ought to cut his ta#@#@ fingers off.","commenter_a":"Neither.","post_message":"Left side: Donald Trump's son holding the tail that he cut off an elephant he shot in Africa. Right side: Chelsea Clinton working to prevent the illegal trade of ivory in the world. Whose family values do you prefer?"},{"comment_id":"10154075378206336","commenter_b":"@username that's not the law u ding bat.For years the law has been if Cubans can make it here they can stay. They were running to get away from the tyrant and then Castro when he took over. They do not run a cross our boarders. They come by boat through Florida. So as soon as Cubans arrive they are legal","commenter_a":"What an absolute Jerk. The Republican Obama. Clown Prince Trump.","post_message":"Donald J. Trump said he didn’t know if Marco Rubio was eligible to run for president and that “the lawyers have to determine that.”"},{"comment_id":"1398961996812250","commenter_b":"Hhhh u wish loser umais .. our heels over u and ur terrorists logic","commenter_a":"So what stopped Iran from making a grand Muslim Allaince against Terrorists? Unfortunately Iran gave it a secterian touch by involving only shias in the fight against daesh. Iran did not reach out to any Muslim country to come and help them in fight against daesh or did they?","post_message":"Pakistan’s Defense Minister has confirmed that the country’s former Army Chief has been appointed as commander of a so-called Saudi-led military coalition."}]
