[{"comment_id":"10153304672057377","commenter_b":"'@username, you are just giving me TONS OF REASON ! As i said............, if there are no 'illegals' to pick it up...............IT ROTTS on the ground.........! They are the ones who pick the fruit and vegetables !","commenter_a":"Trump will be in New York next year ! If anyone thinks that he can win the Presidency calling names to every minority in this Country, better have something else to sleep well because Donald Trump will never be President of the United States of America !","post_message":"The Rev. Franklin Graham Thursday suggested that Pope Francis 'build a bridge' to Republican front-runner Donald Trump because 'who knows where he may be this time next year.'"},{"comment_id":"10155794432670354","commenter_b":"she'll never get that stink off her!","commenter_a":"What was that idiot doing there anyway.","post_message":"What was she thinking?"},{"comment_id":"1354400067935066","commenter_b":"Just try it you fucking bitch! Just try it!","commenter_a":"PRESIDENT TRUMP, PRESIDENT TRUMP, PRESIDENT TRUMP!!!! WE THE PEOPLE SAID SO!","post_message":"Discuss.   SHARE THIS and FOLLOW US at Reverb Press and Stories That Resonate for progressive news and opinion that you can trust."},{"comment_id":"817721241706741","commenter_b":"She hasn't even a woman very long.....","commenter_a":"I'm very happy that you are living the life you want to live, Caitlyn- but that by no means makes you an expert on all women or what is good for them.","post_message":"It takes a lot of nerve for a Ted Cruz supporter to say something like this..."},{"comment_id":"1104014366324977","commenter_b":"How is that racist lol Muslims are a ravery of people haha and no makes them follow a old book written by a peodphie that married a 9 year old girl","commenter_a":"Hey! Don't forget that ISIS are not 'real' muslims. And it is just a coincidence that 100% of those who join or support are muslims. This has NOTHING to do with islam. And it is only 8% of the entire population of Turkey who supports ISIS. (according to a recent Pew Research poll) But don't worry about it, they are not 'real' muslims either. Anyone who says that the world has a problem with islam is just a racist. We all know that islam is a religion of peace. Case closed.","post_message":"EXCLUSIVE"},{"comment_id":"693090104129406","commenter_b":"she is a fraud... she was a mecanic in a motor pool","commenter_a":"You go girl!!!","post_message":"One way activists in the United States are supporting an end to poaching is by enlisting retired vets to take part in an organization that puts their years of combat training to work overseas."},{"comment_id":"10152505089467434","commenter_b":"So feminism is bs cuz this guy is an a-hole?","commenter_a":"Jefferson owned slaves, Ayn Rand's life was full of contradiction ... ideas are not contingent of the righteousness of the persons life, they are objective concepts.","post_message":"A knowledge of feminism doesn't always translate into expressions of feminist ideas."}]
