[{"comment_id":"10153357050192464","commenter_b":"Israel is bankrupting America, rich Jews are destroying democracy & destroying jobs here in America, Jewish love-of-money & Golden Calf worship & other anti-Christian values are totally corrupting America and infecting the world such that Talmudic-believing Jews have put us on the path to the 6th Mass Extinction of Live on earth. And for 35 years we've had Presidents who love love love Israel, to America's detriment. I believe God is punishing America for supporting Israel. It is time we have a Pres who doesn't believe the propaganda, who sees Israel for what it really is, who knows Jews are no longer the poor, hungry victims of discrimination & the Holocaust but are now the oppressors & suppressors & war-mongers, the rich, greedy & self-serving people who don't give a damn about the USofA or the American people but only care about themselves. And we need a POTUS who isn't ...","commenter_a":"Look at the country's that take money We get no TAXES and the PEOPLE get no help","post_message":"SHARE if you agree we need a President who will #StandWithIsrael!"},{"comment_id":"10154388349554657","commenter_b":"Put the witch on a stick and burn her.","commenter_a":"Should be incarserating her.","post_message":"It is the political story that just won’t go away for Hillary Rodham Clinton:"},{"comment_id":"1225168154206852","commenter_b":"No woman in her right mind would have voted for this man. God help us all.","commenter_a":"Genial","post_message":"'Donald Trump will make our economy great again'"},{"comment_id":"10152632178256813","commenter_b":"Shut up Statist. No one deserves jail because of an unpaid weed ticket. Jail should only be for Killers, Rapists, and Burglars. Is that too much to ask?","commenter_a":"I see, so break the law, claim you're poor, and get away with breaking the law. Talk about \"privilege\". :/ Being poor is NOT a \"justification\" for not taking responsibility for one's own acts. No more than being rich is a \"justification\" for not being responsible for one's own acts. It's interesting how people complain that the rich aren't being held responsible for committing violations of the law, then claiming that the poor should NOT be held responsible. Rich person doesn't pay their taxes, they belong in jail. Poor person doesn't pay for legal fines and fees, they should just be entirely excused for breaking the law. Interesting.","post_message":"Kevin Thompson was jailed for five days because he couldn't afford to pay fines and fees from a traffic ticket. Last week, we reached a settlement that promises to prevent others from being improperly jailed for being poor in DeKalb County. @webpagelink"},{"comment_id":"10154362181546077","commenter_b":"Put her in jail","commenter_a":"Go Trump!!","post_message":"Donald Trump rally live in Greeley"},{"comment_id":"10153506474399342","commenter_b":"She's one of these \"innocent\" women that our cretin in the White House wants to allow in the US.","commenter_a":"What a mutt. I hope they shot her in that ugly face of hers.","post_message":"We're getting our first look at the female shooter in Wednesday's tragedy in #SanBerardino."},{"comment_id":"10157488430805354","commenter_b":"Lock her up !","commenter_a":"She should strike her","post_message":"***Viewer Discretion is Advised*** The mother, streaming live on her daughter’s account, tore into and struck the 16-year-old numerous times for posting provocative photos of herself on Facebook...."}]
