[{"comment_id":"10153630257512235","commenter_b":"She's a dumb bitch.","commenter_a":"Aaaaaaaaaaaaaaaaaaaand let the Martyring begin! Yea totally did not see that one coming..nope, wow I am so surprised! *rolls eyes*","post_message":"Oh, c'mon ..."},{"comment_id":"10152888529356051","commenter_b":"Well that's where becoming a mature adult comes into play. He's had three children with more than one woman not married to any of them not stable himself there for you get what you get. Young people and old people to please stop having babies you didn't plan for it. You didn't save for. And you can't afford. Whether or not the mother works as a relevant because at this point she didn't get herself pregnant and cant. Guys wrap it up put on a raincoat run the rubber road or better yet stop treating sex as an entertainment videos. Stop having sex with all these women and not looking at the big picture tell you don't drive your car without a spare so don't live your life that way be prepared","commenter_a":"my son is a father of 3 girls, he pays so much child support that he cant afford to live himself, by the time he gets paid and all the child support comes out he has any where from 20 to 30 dollars to get in through the week..He cant afford to by food, just barley has the money for gas to get back and forth to work with, while in the mean time, the mothers get $500.00 a month in food stamps, don't have to work, They live off of his money, he cant get food stamps because he makes too much..well if they seen his check after everything comes out, then they would see what he is going trough. The laws needs to change..make these mothers get out and work.Cut out the food stamps because the mothers are selling them just for the money..","post_message":"This man has gone without food for days because of all the child support he owes. There’s one big problem with this."},{"comment_id":"1082137365131066","commenter_b":"So yeah, drug addicts can just stop for a few days to pass a test...yeah no, sorry that isn't how it works.","commenter_a":"Anyone bother reading the article? \"..recipients (of welfare) choose the day and time of the testing..\" This is how it's done in all these examples and *THAT* is why there was only one person that failed. Most drugs are out of your system (and won't show on a dipstick test) in less than 48 hours. Do *RANDOM* drug screening like I have to do for my job. No advance notice, just get here now and pee in a cup. See how many fail then.","post_message":"There are stereotypes and there is reality. Welcome to reality."},{"comment_id":"608627489270433","commenter_b":"More like the other way around...in Indian culture it's arranged for money issues, not love...and then the wife's are treated like maids...atheist she can be a maid to a person who loves her, for her and not for the money","commenter_a":"At least he didn't end up stuck with her.","post_message":"This has to be the worst Bride OF ALL TIME!"},{"comment_id":"863004940415197","commenter_b":"Throw her in jail","commenter_a":"Take her down!","post_message":"\"Perfect\" was the response Lerner used about the non-archived messaging system."},{"comment_id":"1571786566441790","commenter_b":"What good will it do, congress passes these laws.","commenter_a":"These people make me sick.","post_message":"These welfare abusers need to be taught a lesson.  Way to go Judge Judy!"},{"comment_id":"10154343776387061","commenter_b":"@username , just wait till he is done,The Republican Party!","commenter_a":"He was a great president, didn't help republicans but republicans don't help democrats. I'd like it if people met in the middle more rather than so far right or left. Obama is professional, polite, and articulate none of that fits Trump. And now that the new Trumpism is \"Alternative Facts,\" I am concerned.","post_message":"A look inside the Washington, D.C. residence the Obamas are moving to: @webpagelink"}]
