[{"comment_id":"1251860331547386","commenter_b":"She probably cheated..can't blame him","commenter_a":"Seems like all the guys in Berlin are pussies","post_message":"Cold blooded! #WSHH"},{"comment_id":"764424377012570","commenter_b":"Muslims are the problems in this world without muslims the would be a better place","commenter_a":"Why is it that every Arab must have a temper tantrum and act like a five-year-old about everything? I would love to see, one time, a mature, calculated, reasonable response from a Muslim. Just once.","post_message":""},{"comment_id":"1287852217938587","commenter_b":"Don't worry Hillary is gonna make it all go away!","commenter_a":"everything is so simple, what would you do if you were in their place?? if you were from the illuminati or some sort of influence to the world?? right? we would do whatever it takes, use the media and technology or any type of power given to us to lie to ppl to influence the. and make them thing whatever we want to think...population control","post_message":"Now that we finally know the Orlando shooter's real motive, the question remains: why did the FBI try to hide it for so long?"},{"comment_id":"10156209671355354","commenter_b":"Please stay there! Not welcome in Texas!","commenter_a":"I hope the next administration is one that will take this down!!","post_message":"And look what it's expected to be by 2018!"},{"comment_id":"10154517045124087","commenter_b":"The Muslim ban from war torn nations is meaningless. Besides him not banning Muslims from Saudi Arabia - because they have \"great human rights\" over there from Women not being allowed to drive or throwing Gays off of roof tops; Trump says US will prioritize Christian refugees. How do you determine who is a Christian when one can easily lie about this? Congress will likely overturn this. While they're at it, Trump stop droning brown people overseas and Congress stop sending foreign aid to these terrorist organizations who indirectly receive it.","commenter_a":"Good","post_message":"BREAKING: President Trump has signed an executive order indefinitely banning all refugees from war-torn Syria and suspending all refugee entry for at least 120 days."},{"comment_id":"10152710610321051","commenter_b":"Many Americans dont' have enough to while this couple seems to be eating too much - thanks to benefits they are not entitled to!","commenter_a":"Wrong!!!!","post_message":"A couple that lives off benefits because they’re too obese to work got another gift from taxpayers."},{"comment_id":"10154064486021509","commenter_b":"Sure they alienate all woman","commenter_a":"A lot of you folks are so quick to follow the narrative. There has not been a debate in years. Just mud slinging and popularity contests. One thing is true though, the only thing the Clintons should be doing is life in prison. What a dirty dirty dirty duo.","post_message":"Could the GOP's opposition to Planned Parenthood at the #CNNDebate be a general-election vulnerability? Hillary Clinton's top aides seem to think so: @webpagelink"}]
