[{"comment_id":"10153273654150329","commenter_b":"I can't stand feminists.","commenter_a":"Feminist are so fucking annoying.","post_message":"\"Meghan Trainor needs to take a women's studies class at the Taylor Swift school for pop stars who can't feminist good.\""},{"comment_id":"1393712353985142","commenter_b":"Someone send this to Senator Warren...but use small words so she MAY understand it!","commenter_a":"No one cares !!!!!","post_message":"Wow! Coretta Scott King gives a thank you to Sen. Jeff Sessions at the opening of the Rosa Parks library."},{"comment_id":"10154900824501037","commenter_b":"Obama is playing on Americans. He wants to play a nice guy. He knew all powers for executive orders has been striped off him. He wants to turned american workers against trump's adminstration. And gain cheap popularity from clueless workers. Obama's intentions for america is bad. this is just a cover up. Watch out. He will try something like this again even wen he knew that he doesn't have power to do so. Just to make names for himself n pave ways for his wife 2020. Am one person obama can't fool. All his doing is to put trump in a tight corner n make him look like a bad guy. His a hypocrite and no one shud take him serious. Hilary and obams wants to make sure that trump did not succeed.","commenter_a":"I hope this judge dies of pancreatic cancer.","post_message":"A devastating blow to one of Barack Obama's signature achievements for boosting wages."},{"comment_id":"1286179581424362","commenter_b":"And she is a liar and murder!","commenter_a":"He can talk about Hillary all day, but he has no real plan for this country, he's an imbecile.","post_message":"REPLAY: Donald Trump at a rally in Wilmington, Ohio."},{"comment_id":"10157671091150294","commenter_b":"Hush.","commenter_a":"Megan Crucis","post_message":"The person she contacted was using a clown photo as a profile picture -- as well as an alias."},{"comment_id":"10157668685335389","commenter_b":"This woman is not!!","commenter_a":"I know women are going to hate me but if Hillary becomes president I can see why they didn't allow women to vote until the 1920s?.... women are overwhelmingly voting for Hillary over Trump this is how stupid most women are...MOST...not all... their kids and grandkids will be screwed for life","post_message":"Perspective."},{"comment_id":"10153378230871770","commenter_b":"You have to be a special gentile stupid to call the protesters racist.read the Talmud you stupid bastards.","commenter_a":"I think I seen that dude on delliverance movie","post_message":"Violent anti-Israel protests broke out at the American Israel Public Affairs Committee’s annual conference in Washington, D.C. on Sunday."}]
