[{"comment_id":"10153449417193984","commenter_b":"She is a loser!!!!","commenter_a":"Her Poor daughter .. I bet she was totally humiliated .. and then to have mom remove her from her class mates .. Brutal :(","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"870560229647985","commenter_b":"Not bad for Teddy... only two outright lies in 4 sentences lol","commenter_a":"Love Ted Cruz","post_message":"Listen to how this Obamacare question from CBS News correspondent is phrased -- and then Ted Cruz's answer:"},{"comment_id":"10154289426723797","commenter_b":"'@username I am an alcohol manufacturer.","commenter_a":"They should never have been in prison to begin with.","post_message":"OBAMA COMMUTES DRUG SENTENCES: Nine people from Illinois are among the 95 whose prison sentences have been commuted by President Barack Obama."},{"comment_id":"456493334475707","commenter_b":"Fuck u bitch and that pedophile country PISSRAEL","commenter_a":"PISSRAEL","post_message":"In the following report, we’ve replaced references to Israel with the Islamic State of Iraq and Syria (ISIS) to make a point about how differently they are treated by the media and politicians."},{"comment_id":"10153799919868352","commenter_b":"She trying to get relevant","commenter_a":"Whaaaaaat","post_message":"‘Whitney will haunt you from the grave': Fight breaks out at Bobbi Kristina’s funeral after Bobby Brown’s screaming aunt has to be ‘escorted out by Tyler Perry’ for attack on Pat Houston mid-service"},{"comment_id":"1032855700144015","commenter_b":"No one is looking to take away your guns, just like no one is looking to take away your car.","commenter_a":"Taking guns away from citizens violates our rights. Criminals will be the ones with guns. I have a hard time understanding why the hell people dont get this!!!!","post_message":"Nearly 50 years ago, Robert F. Kennedy made an appeal for gun control in Oregon -- just miles from where the recent mass shooting at Umpqua Community College occurred."},{"comment_id":"10153475674267452","commenter_b":"Illegals for a living too.. And pay taxes and guess what they don't get a refund. Securing borders? Fix the immigration system it's hard becoming legal.. The system is he problem not the illegals..","commenter_a":"Congratulations on not being an illegal immigrant and working for a living. Trump is not against immigrants he and many other Americans are against ILLEGAL immigrants. Oh and your protest in Canada doesn't mean a thing in the USA.","post_message":"In protest of Donald Trump’s immigration policies, a construction worker hung a Mexican flag atop the Trump Tower in Vancouver, Canada. abc7.la/1W7pFVh  “While working on your tower, Mexicans didn't steal anything nor raped anyone. We just did the best work we could possibly do, for ourselves, our families and the future tenants in your building.”"}]
