[{"comment_id":"10153329525229203","commenter_b":"It's called Sharia Law and it's practiced in Muslim Country's where Women are considered worthless property.","commenter_a":"Alexis A Massey","post_message":"In Nigeria, violence a husband for the purpose of correcting his wife is considered lawful."},{"comment_id":"955398181243627","commenter_b":"And we will ship them out idiots","commenter_a":"BIGGEST WANKER MUSLIM OF ALL TIME","post_message":"This is only the beginning..."},{"comment_id":"1475217105828968","commenter_b":"You do not know what you are talking about! If woman cannot afford birth control then there will be a definate increase in unwanted pregnancy and ultimately more abortions than ever. Its a simple enough eqausion, NO PLANNED PARENTHOOD=NO AFFORDABLE BIRTH CONTROL=MORE ABORTIONS!","commenter_a":"Will never agree stay quite,agree or be agreeable to finance or support an organization that capitalizes on the murder of innocent children. And an organization that preys on the vulnerability of women in a bad situation, that is not women's rights but profit of murderers. It needs to be called what it is. Their profits and funding comes via. death and guilt not education.","post_message":""},{"comment_id":"1063488917004194","commenter_b":"Lysha Ewing u r a very bitter woman.","commenter_a":"Stupid cops. To think if it were a black baby they would have walked by","post_message":"Police officers smash window to find fake baby."},{"comment_id":"10153359842468984","commenter_b":"Love it .. Good for the Bitch /Bastard","commenter_a":"You can go to hell leave us alone. We don't care what you call it marriage is one man and one woman.","post_message":"You knew this was coming..."},{"comment_id":"10154250951204641","commenter_b":"Ok, u say it's a choice so that person chose to have unprotected sex and got prego. Who's fault is that. That child didn't ask to be killed because of their parent made a choice to not put a condominium on. The consequence of having unprotected sex is a baby. If u don't want to have a baby don't have sex. Abortion us an e cause to not take respinsibilty for ur actions. Abortion isn't safe. It leaves scared emotionally.","commenter_a":"If you don't want an abortion fine, but who the hell are you to tell another person who is getting a safe procedure by professionals what they can or can not do to there bodies? What if someone was raped, low financial income, mentally unstable, or if the pregnancy was unsafe for mother and baby? Explain that to your petty beliefs of striping women of he right TO THEIR OWN BODIES!!","post_message":"The 5-3 ruling is the most significant decision from the U.S. Supreme Court on abortion in two decades and could serve to deter other states from passing so-called \"clinic shutdown\" laws."},{"comment_id":"809439485771743","commenter_b":"no sh-- sherlock, and obummer is running circles around the media....idiots.","commenter_a":"Andrea you are so astute! That is more than obvious, with that clown Kerry doing the negotiating!","post_message":"We could've told you that, Andrea. #Iran"}]
