[{"comment_id":"775973422593235","commenter_b":"Absolutely, she should be in prison anyway not headed to highest position in America","commenter_a":"Elated!","post_message":"BUSTED: Hillary Clinton Was Just Caught Read Handed For Being Linked To... This actually might stop her from running. Would you be happy if she had to back out of the race?"},{"comment_id":"960936923986215","commenter_b":"She is loud!!! Trump!!!","commenter_a":"Now I'm really confused, Trump is not the true conservative, and I thought Palin was.","post_message":"Sarah Palin is ready for someone who can take down ISIS and #MakeAmericaGreatAgain- are you?"},{"comment_id":"256034241501428","commenter_b":"Hahah aww","commenter_a":"@username it'll be belated but you'll get it lol","post_message":"Pretty much #ValentinesDay #WSHH"},{"comment_id":"1000377376688677","commenter_b":"Just stay the hell out of America...we don't need your crap here.......Stay in your own country......These buttwipes are allowed to do this in their country, so go home and do what you want, keep it out of America!!!!!!","commenter_a":"1. First the US gov attacks its own people on 9.11 in false flag operation 2. They blame the attack on Osama Bin Ladin, a fictitious character created by the CIA and played by several actors. 3. The US makes war on two countries using false pretexts for war, both times. 4. The US uses drones to kill \"terrorists\" which include many innocent Islamic peoples 5. The US gov pretends to kill OBL as some kind of fake victory. Obviously, they cannot allow the remains to be scrutinised so they jetison it at sea and take no photographs either. All lies. 6. The US War on Terror is very similar to the Crusades where four centuries of young Christian men were lied to by the Pope and told to go brutalise and savagely attack innocent Saracens who were safeguarding the Holy sites in Palestine 7. In the US, whites kill ...","post_message":"And he wanted to take a second wife 'because it was allowed under Islamic law'"},{"comment_id":"323815704455468","commenter_b":"That's why we need someone who isn't a fool. Lindsey, go home, the adults need to take over.","commenter_a":"He should go home...he's really dumb","post_message":"Lindsey Graham needs to _______________."},{"comment_id":"501241236691320","commenter_b":"Yeah but the bride wore a short white dress with cowboy boots","commenter_a":"Why you live a better life you dope","post_message":"I know I've never had pizza at a wedding... The GOOP | Liz"},{"comment_id":"629803473847253","commenter_b":"she is a bitch to treat that young woman like that","commenter_a":"What a bitch!","post_message":"MUST WATCH: Hillary doesn't like being challenged by black woman. Welcome to the DEMOCRAT plantation."}]
