[{"comment_id":"1184948411561852","commenter_b":"FOREIGN WORKERS MEANS TAX BREAKS FOR THE COMPANIES AND LOWER WAGES..... ALSO MEANS NO JOBS FOR USA CITIZENS!!!!! TRUMP FOR POTUS - DEPORT THE ILLEGALS AND STOP WORK VISAS !!!!","commenter_a":"In my lifetime, I have been through 3 amnesties. Each was promised to be the last. Does anyone in the Congress, who made this promise to the American people, have enough backbone to honor their word? Seems not. Why believe anything they tell us?","post_message":"Not good."},{"comment_id":"1246991831993261","commenter_b":"goodbye both...","commenter_a":"thats \"goodbye America\"...","post_message":""},{"comment_id":"1386644204686259","commenter_b":"It's all geared for her to win. She knows this. The corruptness is too great and the winner will be whomever bows to the big $. Sanders and Trump won't do it but she does and will continue to do so.","commenter_a":"And, that a$$hat in the photo has never accomplished a thing worth mentioning.","post_message":""},{"comment_id":"1911468415618542","commenter_b":"Buy yo mama some food","commenter_a":"All doped up","post_message":""},{"comment_id":"1009683892433898","commenter_b":"ILLEGAL ALIENS should be deported not given drivers licenses and free housing and medical care.","commenter_a":"Why don't you add the rest of the story. Not only did 50% of all California driver's licenses go to illegal aliens, but they have motor voter laws so those illegals are now eligible to vote even though they are not citizens. Non-citizen should NEVER be allowed to vote and neither should welfare recipients who have been on welfare for more than two years. They should not be allowed to vote on how the money from tax payers is spent when they are not paying taxes themselves.","post_message":"Did you know HALF of all California driver’s licenses issued in 2015 went to illegal aliens?"},{"comment_id":"10154874909449369","commenter_b":"No actually one of my best friends is a gay black woman. She knows I love her.. she is just not childish enough to allow difference of vote affect our friendship.. we have had since we children. :) Bcuz she is grown.","commenter_a":"I have grown to respect Mike Pence. Great choice!","post_message":"Vice President-Elect Mike Pence is taking over President-elect Donald Trump's transition team, replacing the former chair of the operation."},{"comment_id":"10152858682652411","commenter_b":"She should have been tazed!!","commenter_a":"I don't condone what the the officer did but the situation would've been completely different if the little brat did what she was told.","post_message":"Breaking News: The police officer whose video-recorded actions at a North Texas pool party have drawn national attention and comment has resigned from the police force."}]
