[{"comment_id":"901951363197946","commenter_b":"Does this Kate Hopkins woman realize how ugly she is?","commenter_a":"i think thie so called woman shoudl keep her many nasty comments too her self ,she must have a very unfilled life ,becuase she comments and has ago at everybody ,stut up Katy Hopkins .","post_message":"Kelly Clarkson admits she didn't even know who Katie Hopkins was  (Daily Mail Celebrity)"},{"comment_id":"10153956256701336","commenter_b":"Exactly!","commenter_a":"government is always looking for a new tax. The gas prices should be lower for what crude is going for right now.","post_message":"The price of Brent crude in the United States has fallen below $40 a barrel – more than $30 lower than in May of 2015."},{"comment_id":"1142380192485341","commenter_b":"Wow are you serious they are trying to take out the Americans 1 job at a time and all the free handouts our government will give them. While our own government let's the Americans suffer by allowing them to free load off our system. Really they get social security for what . Americans get denied SSI while the immigrants step right up and no problem. really ?? Go Trump","commenter_a":"Welcome to the future!!!","post_message":"Nearly 40% of less-educated, working-age Millennials ages 18-29 don’t have a job.  That’s more than 15 million young-adult high school grads and high school dropouts who aren’t working."},{"comment_id":"10155008790239214","commenter_b":"'@username please educate me as to exactly how NM receipt of federal dollars will be affected by the senator's boycott of the inauguration.","commenter_a":"Please don't join that ship of fools boycotting the inauguration. New Mexico needs those federal dollars.","post_message":"The president-elect is taking to twitter this weekend to harass a civil rights icon and the Director of National Intelligence. I think we can all agree that is not how Donald Trump should be spending his time."},{"comment_id":"1341354572550959","commenter_b":"Right by Tacoma General","commenter_a":"Good. That's the way it's supposed to work. You rob people, you get shot. End of story","post_message":"A man was shot and killed yesterday evening after robbing two people at gunpoint in Tacoma. Natasha Chen reports, 5 p.m.: kiro.tv/LiveNews  What we know now: kiro.tv/TacomaShot"},{"comment_id":"1054816387945602","commenter_b":"Watching these comments I can't help but notice that Obama is almost as popular as burlap toilet paper....","commenter_a":"Will he be pausing to pray to the east immediately following this speech?","post_message":"President Barack Obama comments on #Brexit at the 2016 Global Entrepreneurship Summit."},{"comment_id":"10154080042346336","commenter_b":"I care what anyone says obama was a good president.","commenter_a":"Yep, detention without trial , without legal representation ,without charge has no place in America .","post_message":"“We can try [terrorists] and put them in our maximum security prisons and it works just fine.” – President Barack Obama on closing Guantanamo Bay facility @webpagelink"}]
