[{"comment_id":"10154007115431770","commenter_b":"IDIOT","commenter_a":"Another side affect of using baby powder........ugh","post_message":"When Tucker Carlson got the best of this anti-American-Flag student, it reminded us of the old Thug Life meme. Welcome to the Tuck Life."},{"comment_id":"10153746096543984","commenter_b":"shut Obama down, stop paying congress until they do their jobs","commenter_a":"not a dime til this is resolved","post_message":"Obama has just announced the number of Syrian refugees the U.S. will take in, and liberals aren't too happy about it.   What do you think the U.S. should do about the Syrian refugee crisis?"},{"comment_id":"849061198475049","commenter_b":"She wants no part of it. Very wise classy lady.","commenter_a":"Condoleezza for President, she'd make a wonderful one. Outstanding human, patriotic, religious.......intelligent, classy. She has much more quality than Hillary any day.","post_message":"Just beautiful. I didn't even know Condi was a musician..."},{"comment_id":"1590956274524819","commenter_b":"I won't stay there","commenter_a":"The should arrested the hotel owners and the stupid cops that arrested the veteran.","post_message":"I am boycotting this hotel. Veterans deserve BETTER!"},{"comment_id":"10154716865434586","commenter_b":"Omg idiots","commenter_a":"What's wrong with people they don't use there heads","post_message":"Dear everyone: Animals are NOT selfie props. This has to stop."},{"comment_id":"1164001233718693","commenter_b":"Come on bitch follow the dress code","commenter_a":"Justin Drake pleaaaaase go off on her for being annoying","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."},{"comment_id":"10153696182197300","commenter_b":"He is absolutely correct....because the large majority of crimes are done by blacks....thus more police treatment...","commenter_a":"The numbers don't lie. He is absolutely correct.","post_message":"Democrats will reach out to black voters in the debate tonight. Bernie Sanders made a claim about African American arrest rates. See what PolitiFact found: @webpagelink"}]
