[{"comment_id":"1024965370917718","commenter_b":"'@username Agreed!","commenter_a":"Being vegetarian doesn't change much in the lives of cattle however. Nor hens. It's better than being an omnivore, yes, but still not cruelty free. Although nothing truly is. From medical treatments, medicine, to our pets sustenance, to palm oil, to beauty and household products, etc. As for diet, we are naturally omnivorous. We would not have survived very well as a species without meat as sustenance and the remainder for clothing/tools, along with plants, fruits, nuts, etc. Especially in the North.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153148530580329","commenter_b":"It's not a fuckbuddy it's a weak ass pussy who ain't bout shit","commenter_a":"What is a f*ckboy? I must be getting old...","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153416119358203","commenter_b":"WTF is wrong with these people? How could they do that to such an innocent life","commenter_a":"that's outright murder!","post_message":"‘This baby won’t stop breathing!’: Abortionist strangled baby born alive while nurses stood and watched"},{"comment_id":"537404189787632","commenter_b":"YOU HAVE FORGOTTEN THAT YOU ARE NOTHING MORE THAN AN ACTOR WITH AN OPINION--AND NOT A VERY INTELLIGENT ONE-MAYBE YOU WOULD LIKE TO JUMP ON THAT PLANE THAT SO MANY OF YOU ACTORS ARE GOING TO BE ON IF TRUMP WINS???!!!!NANCY","commenter_a":"He's a self important cunt, that's what he is. Like his opinion matters. I like his acting, but when it comes to a political opinion, I'll form my own and he can fuck off with his.","post_message":"Robert DeNiro is a ________________."},{"comment_id":"10154556133417235","commenter_b":"Good bye you old hag","commenter_a":"It could only have happened more quickly. Thank God for small miracles. Goodby. God Bless, where ever 'He' .Kisses.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154284968796336","commenter_b":"Because an orange narcissistic with a fake wig is better","commenter_a":"Because he promises free stuff, and doesn't say he's gonna take your jobs, but you'll lose your wealth if you try and make something of yourself! Both democrats running are a joke!","post_message":"BREAKING NEWS: Fox News projects Bernie Sanders as the winner of the West Virginia Democratic primary."},{"comment_id":"10153811362959087","commenter_b":"She's too busy partying","commenter_a":"Dean Forest: your party is losing what it needs more of. Susana Martinez will seitch to the Dems if trump isn't careful.","post_message":"A Hispanic official with the Republican National Committee is resigning after telling coworkers she is uncomfortable in a job where she has to work to elect Donald Trump."}]
