[{"comment_id":"10154735713113132","commenter_b":"She lives for the fame..controversy and all.","commenter_a":"Why discuss this with tabloids? What does her children gain from it? That's private. Quit putting your kids out there to be vulnerable like this.","post_message":"Kate Gosselin is opening up about her son Collin."},{"comment_id":"1047246341998727","commenter_b":"Illegals should have NO rights in voting, wokring or anything here....PERIOD.","commenter_a":"You gotta get all the brainless and illegals to stop voting democrats, its the democrats that arm criminals but prevent legal law abiding people to legaly arm themselves","post_message":"Hillary and Bernie want taxpayers to cover healthcare for illegal aliens. What do you think?"},{"comment_id":"10153230871447708","commenter_b":"It's a good talk but you shouldn't make promises u can't keep. But you still have my vote","commenter_a":"Until AFTER election.....Read my lips...All the same","post_message":"I will oppose and veto ANY and ALL efforts to increase taxes. Join me in standing up for American taxpayers.  Click here now!"},{"comment_id":"1213265855432501","commenter_b":"I quit watching long ago. Now I know why. Bunch of bitches!","commenter_a":"Why don't they just give it up... Everytime they say something bad about Trump their show loses viewers. I never watched them but if I came across it channel surfing I'd stop and see what was on... Now I will keep surfing.... And I'm sure I'm not the only one.","post_message":"Joy Behar of 'The View' just said Donald Trump will bring “mental illness” to the White House."},{"comment_id":"10153411176356509","commenter_b":"I dont see any woman winning nothing by -coming forward- for the lack of proofs Cosby won`t face any compensation neither sentence, but it is a considerable quantity of womens telling the same, you figure it out ...","commenter_a":"Why are they all remembering it now?","post_message":"Heidi Thomas, who was an aspiring actress when she met Bill Cosby, is coming forward about a secret she says she has been holding for 30 years. This story contains graphic language:  @webpagelink"},{"comment_id":"1833633870187083","commenter_b":"Whatever her position, she chose it. I have researched her & she was looking for a meal ticket. Hopefully she knows now the real meaning of money. She has a mouth & 2 feet & she could walk. No matter if there is a prenup & what it says, this bastard is going down & in the end she would probably prevail.","commenter_a":"we have more important things to do with our words and our time--feel sorry for Melania and the Barron--or get our Country back--it's a choice-Can't do both---you people better choose------Bleeding Heart will only go to degree---We have a choice...to allow a Dictator or feel sorry for his family? Cut me a break!!","post_message":"WOW. Melania's face says it ALL! #freemelania"},{"comment_id":"10153647894113854","commenter_b":"Leave her alone","commenter_a":"You call this piece journalism? Now that's a long stretch.","post_message":"FLASHBACK: \"Megyn Kelly F**ks Brit Hume to Get a Job at Fox News\""}]
