[{"comment_id":"10154279210266028","commenter_b":"Don't you say Hey to me you ugly girl!","commenter_a":"@username @username Oh geez!","post_message":"The two classic American novels have been temporarily pulled from shelves in one Virginia school district following complaints from a parent. @webpagelink"},{"comment_id":"10154813371927787","commenter_b":"Hate to tell you, but Nordstrom is an American company..","commenter_a":"President Trump daughter will make it even more with us American women behind her.. I will not be buying from these companies any longer....I buy American and I Support American...","post_message":"Press Secretary Sean Spicer weighs in on Nordstrom dropping Ivanka Trump's fashion line. is a direct attack on [President Donald J. Trump's] policies and [Ivanka's] name. @webpagelink"},{"comment_id":"1612409662385087","commenter_b":"If we refuse service/sales to illegals we would be fined or jailed. They have rights, you know! More rights than American CITIZENS have!","commenter_a":"Hey...do not rent nor sell groceries or clothing or gas or anything else essential to their staying here....if we stick together their existence here will be short and sweet....","post_message":"This is stunning. After seeing this more countries might do the same. Do you think the two are connected?"},{"comment_id":"10153656233196756","commenter_b":"Kerry Hayes Bryan Hayes James Cadillac Cardarelli told ya","commenter_a":"What?!... Well, I like \"Las Mananitas\" better anyway","post_message":"Ever wonder why you so rarely hear \"Happy Birthday to You\" on TV or the big screen? Turns out that, while it may be one of the most recognized songs in the English language, its copyright is also owned by a music publisher. So, if you're going to sing those famous strains on screen, you'd better be prepared to fork over some cash."},{"comment_id":"1284368551656196","commenter_b":"It is true that staying home and taking care of the kids is cheaper but also if both parents are working to meet their needs then they can apply for daycare help to cover daycare instead of staying home and collect food stamps and cash from the government.. I'm a single mother and I was working full time and couldn't afford daycare or a full-time nanny and I did went to get help and they cover the daycare or babysitter cost...some people work half on the books and half off the books just so they can collect government help I see it every day...","commenter_a":"Is taking care of several under school age children not a full time job That mothers are not getting paid for. What should they do . For food .","post_message":"EXACTLY!"},{"comment_id":"1178309965526894","commenter_b":"@username I understand and do not disagree with you. I just believe that there is enormous demand for illegal workers by American employers for whatever reasons. That demand is what brings the illegals to this country and no one ever talks about this.","commenter_a":"Donald Trump does not have a problem with Mexican's, or anyone else for that matter. He has a problem, as do I, of illegally crossing the border to make use of our system without going through the proper channels. If you don't also have a problem with that, then this country is doomed.","post_message":"Worker says he took a stand against Donald J. Trump and his immigration policies by hanging a Mexican flag at the Trump International Hotel in Vancouver. \"From the concrete pouring, finishing, drywall, taping, wood forming and general labour, Mexicans were there, building it.\" @webpagelink"},{"comment_id":"10154473639164749","commenter_b":"Rebecca Jara","commenter_a":"carry knife free zone signs with them. they are very powerful deterrents.","post_message":"\"I would urge parents to speak to their children about the app and the best ways to make sure they stay safe.\""}]
