[{"comment_id":"812894658799894","commenter_b":"GI, Hillary, go.","commenter_a":"Hillary is a strong woman and won't tolerate any Republican CRAP.","post_message":"This is Hillary in full badass mode. You may not love her, but you should love her passion!"},{"comment_id":"1069291126441959","commenter_b":"WHEN DO WHITE PEOPLE GET TO TAKE THE COUNTRY BACK.......","commenter_a":"Rest well","post_message":"One of the Dallas police officers killed in the sniper attack has been identified as DART Officer Brent Thompson, 43. He is the first Dallas Area Rapid Transit officer to be killed in the line of duty. \"Our hearts are broken,\" DART spokesperson Morgan Lyons said in a statement. \"We have received countless expressions of support and sympathy from around the world through the evening. We are grateful for every message.\""},{"comment_id":"1647007322270889","commenter_b":"@username great values you're teaching your kid. Enjoy karma","commenter_a":"Yeah well cyclists need to be safer, in Utah they over take actual roads holding up traffic passing people off.","post_message":"Biking in America is way too dangerous. (Video: ATTN:)"},{"comment_id":"800309873404645","commenter_b":"16-years ago America watched as the Clintons packed their moving vans with about $200K of stolen furnishing and valuables from the White House and drove away, finally removing a large stench of corruption and sleaze from our nation's capital. We'd be insane to allow them back. TRUMP-2016 MAKE AMERICA GREAT AGAIN!!!","commenter_a":"Counter punch...she has a glass jaw. (email, poor sec of state, another Obama)","post_message":"Crooked Hillary Clinton is spending a fortune on ads against me. I am the one person she doesn't want to run against. Will be such fun!"},{"comment_id":"10152725934094071","commenter_b":"My manager told me \"if you want my position, you might need more than a Master degree, or probably more than one Master. Plus 10+ years of experience as manager\"... So spare me this story, its not the 80's anymore.","commenter_a":"Ain't that the farkin truth!!","post_message":"You don't have to earn an MBA to become a great manager."},{"comment_id":"851657764869646","commenter_b":"Keep on keeping on...........read the Bible verse EVERY DAY! If the atheists/muslims don't like it then let them leave!!!!!","commenter_a":"good-for-this-principal-","post_message":"YES! This school won't bend to the whims of #atheists! This is how they stuck it to #FFRF:"},{"comment_id":"10153226407581770","commenter_b":"Evil scum bags. Send them back!","commenter_a":"Strategically this suicide!","post_message":"When the politicians said \"Refugees Welcome,\" did they know they'd be welcoming a rape culture as well?"}]
