[{"comment_id":"10156385306200231","commenter_b":"She nonce play a white girl maybe she believe she one of them","commenter_a":"Can she be traded in???","post_message":"Why Stacey Dash? Why?"},{"comment_id":"10153763916386320","commenter_b":"Who cares? All cops should spend one day arresting all the illegals in NJ and we wouldn't have this problem. All illegals should be made uncomfortable by cops and regular citizens alike.","commenter_a":"and again until you've walked in a cops shoes you don't know what it's like! They deal with scum of the earth a lot and there hands are basically tied. It's a shame and it's frustrating. I did not watch the video and I don't plan too. I'm Sick and tired of orople picking on the cops. Yes I'm sure there are some that aren't the best but most of the cops are good. Start celebrating the good cops for a change!! But sadly no one seems to be recording when they are doing something good","post_message":"A New Jersey cop goes off and is caught on video saying racial comments to three Latinos. Watch here: @webpagelink"},{"comment_id":"1102356133153121","commenter_b":"dumb bitch","commenter_a":"Yooooooo I Knew She Was A Tranny!!","post_message":"‘I Stand Corrected:’ Wendy Williams admitted fault and apologized for her remarks about HBCUs.  Williams spoke with Roland Martin on Thursday's edition of The Wendy Wiliams Show where the NewsOne Now host eloquently summed up America's troubled past of slavery, segregation, and the oppression of African-Americans. WATCH the discussion and the NewsOne Now recap -> @webpagelink"},{"comment_id":"10153468728217507","commenter_b":"By RIGHTS she should be arrested, Constititutionally tried on TV and executed for TREASON. The first woman","commenter_a":"Hillary is a disgrace","post_message":"47 more states to go!"},{"comment_id":"10153627073939170","commenter_b":"It's gone too far when instead of protecting himself he thinks of the headlines to come and takes a beating.. Time to put the animals back in they're cages.","commenter_a":"I don't have military training or police training but why couldn't an officer shoot towards the legs and feet to attempt to wound or even scare and attacker. I know you would have to worry about the femoral artery and even ricocheting bullets but I seriously doubt every round fired allways hits the intended target when trying to shoot at center mass.","post_message":"Way to go, media. The crooks know the score now and they're taking full advantage."},{"comment_id":"898264413641666","commenter_b":"He shortchanged everybody Diddy! Everyone who isn't a 1%-er.","commenter_a":"Sometimes silence is golden. Our President has done an Excellent Job! Take the Plank out of your own EYE!!","post_message":"Sean 'Diddy' Combs Says President Obama 'Shortchanged' Black People"},{"comment_id":"10155029818006543","commenter_b":"Senator Wazzy got slapped on by Senator McMackinz. Tell a ho where she's at! @webpagelink","commenter_a":"Mitch McConnell email inbox is full. Let jam his faxes with the Coretta Scott King letter now. DC Office : (202) 224-2499","post_message":"In an extremely rare rebuke, U.S. Senator Elizabeth Warren was cut off while reading a 1986 letter by Coretta Scott King on the Senate floor @webpagelink"}]
