[{"comment_id":"10152955099256336","commenter_b":"They sound like a bunch of babies saying the same thing over and over again. Do it don't just say words.that mean nothing. You are not scaring these animals do something.","commenter_a":"Lt. Col. Peters ,just another fool on FOX, Susan Rice.... heads the NSA.","post_message":"“Secure, expand, defend, leverage – her four points. Bill, that’s not a strategy, that’s a bumper sticker. The yogurt I had for breakfast had more intellectual structure.'   Lt. Col. Ralph Peters slammed National Security Advisor Susan Rice’s speech on the United States’ national security agenda."},{"comment_id":"824943850887973","commenter_b":"What dumb a holes. They can't destroy anyone. The U.S. Would squash them like a bug.","commenter_a":"Someone shoot this idiot......he is the problem.","post_message":"Warns that 'Tehran will set fire to every military base from which a hostile U.S. plane takes off for bombing Iran.'"},{"comment_id":"10153716806409749","commenter_b":"What's wrong with a black lady ?","commenter_a":"Wasn't the judge a black lady???!!!","post_message":"'There will probably be a book. It will talk of his love for Reeva. And the awful feelings of loss and guilt, that will stay with him forever.'"},{"comment_id":"1061299707312818","commenter_b":"What an ass! Leave already.","commenter_a":"yah these dumbASSES are going to tell me to be tolerant with the beheading of CHRISTIANS in the MIDDLE EAST, hay DUMBass just cause a lot of people cannot believe that you are a focking muzlum dose not mean I'm going to kiss the muzlumz assss as they behead more Christians, BTW who the fock are you to tell us to be tolerant with the shayton muzlumz? name one Christian that has beheaded a muzlum this month, or this year, or even this century, you bass TURD have allowed so many innocent Christians to be killed by your demonic muzlum family, you have their blood on your hands, and their blood is crying out to GOD ALMIGHTY FOR JUSTICE. allahoooo ACHK BARR and GRILL YOU FOCKING BASS TURD.","post_message":"The Obamas have always gleefully kicked Christians to the curb during Christmas. This year was no different."},{"comment_id":"1283029891737480","commenter_b":"It is so embarassing to see some women with such low IQ and/or low self-esteem.","commenter_a":"TRUMP for PRESIDENT...GO TRUMP","post_message":"The crowd cheered."},{"comment_id":"1632165196804485","commenter_b":"'@username how are we snowflakes if we don't want to hear the opinion of some feminist being sad about a pipeline when there are thousands already in this country. To the other side of the wall for you.","commenter_a":"Unfollow.","post_message":":("},{"comment_id":"417366948387900","commenter_b":"Hey rhino you want amnesty, and the DOJ candidate Obama and Holder want , your one of five republicans and who would negotiate with a terrorist country ? In sorry you won the election here in SC , your a R HINO ,","commenter_a":"Good point ...........we should be negotiating with Iran!","post_message":"Lindsey Graham has some harsh words for Rand Paul."}]
