[{"comment_id":"621940064660952","commenter_b":"everyone can do something....u are allowed to make a certain amount of money....pay enough and you can get any documentation from a doc. disable now a days has a broad spectrum.....defining disabled. ....I know Vets that have missing limbs and they have to prove every year that the limb is still missing and gas nit grown back","commenter_a":"these so called christian politicians could learn some thing about welfare and hand outs to people who don't want to work. 2 Thessalonians chapter 3 verse 10. (even when we were with you we commanded you this,if anyone will not work neither shall he eat. amen.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153535673013352","commenter_b":"Rosey got no pics cuz she is a big fat pig","commenter_a":"Ape in the house","post_message":"The squatter from hell: Woman ‘moves into $800,000 Martha’s Vineyard vacation home and sells the owner’s possessions in a yard sale’"},{"comment_id":"1250137068360096","commenter_b":"'@username Oh no! not more people adopting, what a horrible place we live where people want children in their homes!!!","commenter_a":"You people know so little you call that a win just pitiful","post_message":"YES!"},{"comment_id":"1155965127752480","commenter_b":"I made the same point on a post on face book and was told I was comparing apples to oranges. P","commenter_a":"Cecil the Lion was made up of 'clumps of cells'...WTH. Clumps of cells are ALIVE! All those dunderheads seem to forget that THEY were clumps of cells at one time too!","post_message":"I am one of the people being pilloried, by the way, in elements of the Drive-By Media for daring to compare Planned Parenthood to Cecil the Lion.  People on the left who are overly concerned with Cecil the Lion say they are offended that they are being accused of caring more about animals than they are about 'clumps of cells.'"},{"comment_id":"933295990044593","commenter_b":"Most reusable bags are made from thick plastic. It makes me wonder how many thin bags it takes to make up one of those. Then how many if those are just thrown out because they become dirty or torn. Plus, as it was stated, the carbon footprint of these bags isn't helping anything. I think the best solution might be bags made biodegradable from corn or potato. I've seen some restaurants begin using those.","commenter_a":"when you walk a beach every day, as i do in seattle, it is clear that limiting the use of plastic bags is completely reasonable.","post_message":"Ah, the infamous 'paper or plastic' question. It's way more complicated than we thought, and now scientists are throwing their hats into the ring to solve this environmental quandary."},{"comment_id":"10153327078532411","commenter_b":"So this really can happen? My phone is usually under my pillow","commenter_a":"'@username can I have electronics in the bed","post_message":"This is why you don't sleep with your cell phone."},{"comment_id":"10153753103761037","commenter_b":"'@username tell me that in 12 months... no Bernie, no Trump, no Clinton and no JEB... then who's left? Let's talk again when there's only days left of this nonsense.","commenter_a":"Jim Webb won this debate: he got more exposure out of the media tonight than he has had since he began his candidacy. Compared to Clinton he looks honorable, compared to Sanders he looks responsible. Since those two are the media darlings, those are the only two he needs to be compared to until he can get out of single digit polls. If any of those candidates expect to get moderate Independent and Republican voters next fall, they need Webb on the ticket… unless Trump manages to stay in the race.","post_message":"Bernie Sanders defends his record on guns after Hillary Clinton pounces. #DemDebate"}]
