[{"comment_id":"10155866233724199","commenter_b":"@username trump wives were here illegally before became citizens , your an immigrant just like these people. The were properly vetted and that's a fact . S maybe you should go back where your from and see how fast you live after setting on one foot .","commenter_a":"IF YOU ARE NOT HERE LEGALLY THEN GET OUT ! WE HAVE LAWS AND THEY ARE GOING TO BE ENFORCED !","post_message":"Governor Jay Inslee reacts to President Trump's immigration ban. \"The unjustifiable chaos and cruelty caused by President Trump executive order is now on full display, right now at Sea-Tac airport.\" More: @webpagelink"},{"comment_id":"10153676011437093","commenter_b":"I'm highly educated and make my decisions based on research and personal conviction. I am 100% against abortion used as birth control (not medically necessary terminations). I will never give up my rights to bear arms. And I find your tone patronizing, but that's nothing new. I won't vote for HRC because she is the reason my brothers are dead from Benghazi, she never owns her bad decisions and she cuts out the millions of Conservative women in her views.","commenter_a":"The entire DNC has spoken in this convention as though we millions of Republicans aren't even part of America. Can't wait until he is gone and Trump is our president!","post_message":"President Obama encourages Democratic Convention crowd to do more than boo Donald Trump. #DemsInPhilly @webpagelink"},{"comment_id":"10153007949671636","commenter_b":"Cannot stand her!","commenter_a":"@username - your favourite!","post_message":"'What's wrong with you?!'"},{"comment_id":"10152731106111051","commenter_b":"Yet if you speak out against it, you are \"behind the times\" or \"living in the past\". We need to turn the clock back about 50 years to see what a moral society looks like and I am not just talking about the gay agenda. I am talking about adultery, divorce, teenage pregnancy, children born out of wedlock and anything else that used to be immoral that we are forced to accept today.","commenter_a":"Um, did they leave the word \"incest\" out of the story on accident??","post_message":"This girl never really knew her father – until they ended up dating."},{"comment_id":"548865588651254","commenter_b":"How touching❤️","commenter_a":"Love this and will remember when choosing between Home Depot and Lowes!","post_message":"This disabled vet was having trouble finding a job because of his service dog — so Lowe's hired them both."},{"comment_id":"10153913133146130","commenter_b":"Wtf is a \"puff hoe\"?","commenter_a":"I get all of my political advice from rich Hollywood actors, said no human ever. This just made another 100,000 people vote for trump,, keep it up puff hoe,, you're helping!","post_message":"Nailed it, Angelina Jolie."},{"comment_id":"10153453475573128","commenter_b":"To let the criminals' partnered officials pirate settlements to fill RICO crime established deficits AS the CRIMINALS declare exemptions on the fines, PRESERVES THEIR RIGHT TO THE CRIMINALLY GAINED CAPITAL, as the RICO mechanisms are left destroying the citizens WHO ARE NOT MADE RIGHT. They STILL lose the paid into asset/taxes.","commenter_a":"What is more egregious than a racket on our assets and THEN OUR WEALTH/earnings used to STEAL the racketeered assets WHILE the bank uses OUR wealth to outsource, exploit economic refugees, and MARKET RIG for decades? Citizen-taxpayers FORCED TO ASSUME market control(free market) destruction as RISK, as criminals assume racketeered assets, margins, and government. That is TEXTBOOK Weimar-Gangster Statism for which the criminal interests MUST be prosecuted and the assets/capital RETURNED to us as citizens and to our economy.","post_message":"A decade after homeowners used a soaring real-estate market to go on a borrowing binge against their own properties, many are now falling behind on payments."}]
