[{"comment_id":"10157050589675206","commenter_b":"Ok girl","commenter_a":"Nuts!","post_message":"“We are lucky that we have this son who loves Prophet Muhammad that much.”"},{"comment_id":"478833062241288","commenter_b":"We all know O-ass is reallllly stupid","commenter_a":"Obama'smass army of Murders.","post_message":"Here's what the NYPD Commissioner thinks of President Obama's plan to reduce overcrowding in federal prisons."},{"comment_id":"1087648897921955","commenter_b":"Strange how our country hasn't been blown to pieces if all these Muslims are strapping bombs to themselves. I see your high school education didn't get you far. Must have been a sympathy pass..","commenter_a":"Send these filthy vermin back to the cesspool they came from","post_message":"The project was \"totally different from anything the government has ever done,\" Immigration Minister John McCallum said Wednesday."},{"comment_id":"1231532310220572","commenter_b":"And male or not, you're a cunt","commenter_a":"The dirtbag can pick anyone he wants, Congress has no obligation to endorse the fascist's choice. Speaking of the Constitution. GOP won't be re-elected if they pass any nominee appointed by Ovomit.","post_message":"BOOM!"},{"comment_id":"10153547475163812","commenter_b":"it is just showing Obama is gay and that monkey guy he calls a wife now can be legal","commenter_a":"so nig","post_message":"White House lit in rainbow colors following US Supreme Court ruling that same-sex couples have right to marry: @webpagelink"},{"comment_id":"10154807029567293","commenter_b":"Make Racists Afraid Again.","commenter_a":"Have another drink, hillbilly hick","post_message":" not a bomb in your bag, is it? the man said, according to a passenger."},{"comment_id":"10153951102966234","commenter_b":"She should had gotten revoke of gun license and probation","commenter_a":"@username u was jus talkin bout dis , she got 3 years","post_message":"Itiyanah Spruill pleaded guilty to child endangerment charges in connection with the death of her 4-year-old son."}]
