[{"comment_id":"370446236477004","commenter_b":"Take the bastards OUT!","commenter_a":"Time for drone, and Hell Fire missles.","post_message":"Is your state on the list?"},{"comment_id":"10153324235171051","commenter_b":"Since some of you females here want to crucify the father let me be the first to defend him. The child was the one that is being held, not the father. They have enough evidence to hold him and charge the kid. We don't know what kind of man the father was or what custody agreement him and the mother had. The child is the one being charge and we should leave it like that until something new comes out.","commenter_a":"Where is the father of the fetus & how far along was she? Nobody noticed the front door open on Friday or Saturday? A single mother living in that house? They said the kid had been missing a couple days as well but their news broadcast says the boy disappeared after his mothers death. What was he doing there? How did he get there? The neighbor & sister both say the boy was a good kid, good grades, non trouble maker and she was a great mother who loved & protected her family. Almost all pregnant women who die, do so at the hands of the baby's father.","post_message":"This pregnant woman was killed by the one person she trusted most in the world."},{"comment_id":"795005380646682","commenter_b":"Y'all must be crazy","commenter_a":"Drain the swamp","post_message":"The United Nations resides on American soil, and the U.S. pays about 25% of its budget."},{"comment_id":"10152966322040047","commenter_b":"CRIMINAL","commenter_a":"Next they sell them for food ingrediants!!","post_message":"Planned Parenthood continues to defend its ghastly operations. Abortionists have confessed to changing their practices in order to harvest more body parts. Sign and Share our petition - demand that Congress further investigate the abortion giant and end the sale of babies' body parts."},{"comment_id":"620543131446096","commenter_b":"She's a LIAR!!!!!","commenter_a":"So, she's going to declare bankruptcy and drop out of the presidential race???","post_message":"Wow. I don't think she thought this one through... Do you think a Hillary Clinton presidency would be terrible for America?"},{"comment_id":"10153450529443352","commenter_b":"Livid??????? I would shut that MF down. ...Bastards","commenter_a":"Omg some one is responsible for this ok.who","post_message":"Mom Livid When Her 3-Month-Old Baby Girl Has Bruises on Her Face After Daycare"},{"comment_id":"10154647269064024","commenter_b":"You must be dumber than dumb to believe a fake news story. And the folks in Hamtramck are laughing their asses off at you, and everyone else, who believes this codswallop. Hamtramck is NOT under Sharia law.","commenter_a":"You folks in Hamtramck, Michigan must be dummer than dumb, now you can live and enjoy what you have done. Happy Days are NOT in your future.","post_message":"First Muslim City Council In U.S. ENFORCES Sharia Law... Too Late Now! - BB4SP"}]
