[{"comment_id":"10154241082384170","commenter_b":"@username, I like you a lot, but how is this woman good, when we had sanctions against Iran, she was selling to them like crazy....of course she was trying to save herself and get her numbers up, but just so wrong of her....that's just another one of the many things she did, she couldn't even win the Senate seat in CA...how could she help him win the Presidency? We just all need to stick with the best....TRUMP!","commenter_a":"Uh--oh! I hope he has a portable stage and plenty of microphones. That's her specialty.","post_message":"Smart move, if it pans out."},{"comment_id":"10154641640883145","commenter_b":"Yes 3 station, back in the day....... Family time is lost to the streets now.","commenter_a":"Its sad that some ppl don't have a life n wanna ruin it for everyone else","post_message":"Over the weekend they announced the circus would end in May. @webpagelink"},{"comment_id":"10153033979746378","commenter_b":"She was a dummy","commenter_a":"Just wondering... Why does everyone care now all the sudden","post_message":"A woman has been arrested after removing Confederate flag from outside South Carolina Statehouse."},{"comment_id":"10154077308573128","commenter_b":"would they let someone come in and do this to the liars Scruz and Ruby!","commenter_a":"When's the next GOP Debate?","post_message":"Republican leaders who had hoped Trump would stumble on Super Tuesday now face tough choices, writes Gerald F. Seib."},{"comment_id":"10153148530580329","commenter_b":"It's not a fuckbuddy it's a weak ass pussy who ain't bout shit","commenter_a":"What is a f*ckboy? I must be getting old...","post_message":""},{"comment_id":"1861600594119875","commenter_b":"Nasty Women","commenter_a":"Disgusted.","post_message":"LIVE: Women's Marches across the nation."},{"comment_id":"10153058361321770","commenter_b":"She is a loser !","commenter_a":"I'm sorry Hillary just wasn't natural, it was forced. That being said the bill was funny.","post_message":"Hillary Clinton made a “spontaneous” campaign stop with an appearance on Saturday Night Live. She even mocks Donald J. Trump.  @webpagelink"}]
