[{"comment_id":"10153184134613984","commenter_b":"she is a drama queen & idiot.","commenter_a":"What a crock of crap!","post_message":"People are NOT happy about this, and they're calling her out for it big time.  Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10154456467843717","commenter_b":"Real Feminists Don't Kill Babies You just can't ban abortion. You can only ban safe abortion.","commenter_a":"You just can't ban abortion. You can only ban safe abortion.","post_message":"The ban is expected to be challenged in court."},{"comment_id":"10153100644667431","commenter_b":"This girl knows nothing she is just as dumb as her ancestors, she is going to tell us that everything our ancestors fought for was a lie, no way our ancestors fought to keep our history alive and white people just want to erase us from history, don't let her finish her ancestors mission because she knows nothing she is a sheep, she doesn't even know about the underwater city they just found off the east coast of america a city that is older then her,,,,IM a descendant of a monkey theory, We know our history and can prove it with artifacts SHE CANT","commenter_a":"@username that's not true. The Bearing Strait Theory has been disproven by DNA and language development experts. Turtle Island is our original home given by the Creator","post_message":"Native American at Anti-Immigration Protest: 'You're All Illegal'  @webpagelink"},{"comment_id":"1681074165464529","commenter_b":"All the deplorables need to donate a brick for the wall with their name on it for the illegals to see who wants them gone....","commenter_a":"NO REFUGEES AND SEND THE ONES THAT ARE HERE BACK!!!!!","post_message":"Donald Trump LIVE! WATCH NOW     Best Conservative NEWS-----> Freedom Daily LIKE OUR PAGE!  Donald J. Trump Donald Trump For President #maga"},{"comment_id":"10154033103686065","commenter_b":"he is just telling it like it is....and i am him now","commenter_a":"On point and going after the media . Media is so bias and they are being called out for what they are.","post_message":"What do you think?"},{"comment_id":"540250699432857","commenter_b":"Really? ?? So does that go both ways, women cant be trusted watching kids that arent theirs I? ?? Your blanket statement, is kinda bullshit","commenter_a":"Some people treat their animals better than they treat their children. Why not take the baby with you? Never trust boyfriends with your kids.","post_message":"A woman and her friend wanted to run to the store, so she asked her boyfriend to watch her friend's kids for a little while. The women returned about a half hour later to find the man had done something horrific."},{"comment_id":"10153215543531519","commenter_b":"She now has to move from comedian to propagandist. Not an easy feat","commenter_a":"Last nights show was unfunny. Amy Schumer was not funny last night IMHO. She's really being pushed right now, and while I think she can be funny, there are way funnier female comedians.","post_message":"Watch: Amy Schumer crushed it on \"SNL\" last night, but this gun commercial parody might be the most brilliant short clip the show has done in years"}]
