[{"comment_id":"1570144263286969","commenter_b":"AMEN. Michele sure didn't/doesn't get it!","commenter_a":"I agree","post_message":"\"There is one crucial sentiment Donald Trump’s Slovenian born wife certainly didn’t copy from Obama’s — the inherent pride of being an American citizen.\""},{"comment_id":"10154011298015927","commenter_b":"Shut up you non event","commenter_a":"F u dusche bag","post_message":"\"It needed to be said, and you said it beautifully ...\""},{"comment_id":"1040495199380065","commenter_b":"Looks like only gays and uninformed women votes get this evil women.","commenter_a":"President Hillary Clinton","post_message":"A win for Hillary."},{"comment_id":"429495940593558","commenter_b":"The racists are AGAINST Trumo!","commenter_a":"The days of Nazi Germany are coming back if we don't stop this racist Trump. Blacks and Latinos must unite power to end this nonsense.","post_message":"The Secret Service rushed to shield Donald J. Trump after someone tried to jump a barrier during an Ohio rally on Saturday."},{"comment_id":"1080670505276592","commenter_b":"Unbelievable! This is going to backfire on them. ut makes them look pretty disgusting. Did they use children because the parents can't speak English?","commenter_a":"Bet our tax dollars are paying for those braces leeches","post_message":"Foul-mouthed kids yell at Donald Trump in new campaign"},{"comment_id":"10154490537796509","commenter_b":"Hillary will not even go on FoxNews because she is afraid of the questions. Trump is on every liberal channel.","commenter_a":"Very good luck for Hillary clinton...MY she beat all her contestants...especially Donald Trump...","post_message":"Donald J. Trump's campaign attributed the decision to pre-existing campaign engagements, but it's likely to reignite discussion about the longstanding feud with Fox News and with Megyn Kelly."},{"comment_id":"415787422087411","commenter_b":"Many more American waiting for jobs now, so if your illegal, then bye, bye. If your immigrants better get back to work, that is what you came to America for.","commenter_a":"Carol Johnson","post_message":"#DayWithoutImmigrants: Immigrants across the country are expected to stay home from school and work today to show how critical they are to the U.S. economy and way of life."}]
