[{"comment_id":"10153214035528433","commenter_b":"Russ, that is exactly what legalizing same sex marriage will do. No church will be forced to perform a same sex marraige, but some already do. Heterosexuals are considered married if they have a civil ceremony, so why do we need some 'different' classification just for same sex couples??? That is called 'seperate but equal' and was ruled on by the Supreme Court in the 60s. Seperate is NOT equal.","commenter_a":"Why is civil union treated exactly like marriage between a man and woman not good enough for the homosexual activists??? IMO these radical activists just want to stick it to those with strong religious beliefs.","post_message":"Today, the Supreme Court hears oral arguments about same-sex marriage. Here's some fact-checks on the issue. bit.ly/1GyIiZb"},{"comment_id":"10153036362074411","commenter_b":"I wasn't looking at the women.","commenter_a":"I've been to the Middle East and the people there are so beautiful. Their eyes mesmerize me.","post_message":"The corporal punishment will be carried out for 20 weeks after Friday prayers outside the mosque in Jeddah. That is the place famous for executions carried out in and it has got a nickname \"Chop Chop Square\""},{"comment_id":"10154166026884342","commenter_b":"Phulleeezzzee this woman isn't going to get caught","commenter_a":"There are freaking cameras everywhere. You will get caught. Not worth it. And the problem with leaving your purse in the car is her lousy boyfriend is watching in the parking lot and waiting to break into your car as soon as you're in the store. And these are the same ones videoing as a cop takes them down and screaming police brutality. You live by the camera, you are gonna go down because of the camera. Smile!","post_message":"A California woman is drawing eyes after she appears to brazenly snatch a wallet from the purse of a fellow shopper. @webpagelink"},{"comment_id":"10153799805727623","commenter_b":"They need to be handcuffed at all times !","commenter_a":"Now report how many inmates are killed by correctional officers every year","post_message":"4 correctional officers are assaulted at a North Carolina prison:"},{"comment_id":"10154240769776438","commenter_b":"@username No. You're being dishonest. The \"second amendment solution\" is to use the guns to kill people, and he was talking about his followers killing Secretary Clinton, and he was talking about his followers killing the judges she will appoint as President. You can try to say that he didn't actually think they would follow his advice, but you can't say that isn't what the words mean.","commenter_a":"Hmm I wonder if he's talking about the NRA? Taking things out of context, as usual","post_message":"\"Nothing you can do folk—although, the Second Amendment people, maybe there is, I don't know.”"},{"comment_id":"1187034151348219","commenter_b":"On the flip side the battle is going... ok ish","commenter_a":"\"Hold X to flip over\"","post_message":"Caption contest time! ~Josh"},{"comment_id":"942704895828117","commenter_b":"Wow your a cold heart bitch With a small dick","commenter_a":"A druggie died of an overdose with assistance from his mom and grandmother - unfortunately only he died and not all of them.","post_message":"The teen's mother and her mother face multiple charges."}]
