[{"comment_id":"10152747219056051","commenter_b":"This is soooooo wrong and why can't these cases be corrected immediately when the proof comes out. The women who do this should be prosecuted and pay for All damages!","commenter_a":"Back in 1990 I had to pay 400 a week child support for 3 kids the courts let me have custody of my oldest boy gave the ex-wife custody of the three youngest the day that we walked out of the courtroom the ex wife let me have the other three children two years later the welfare department came to me and told me that I have to pay back the last two years of u living expenses that they was giving her she forgot to tell them that she was getting 400 a week the last 2 years took me 2 years in the court system to fight it the system does not like to put women in jail so I know what you are going through","post_message":"This man had an arrest warrant issued for him and got threatened with jail time over unpaid child support. There's just one problem."},{"comment_id":"10153989923308854","commenter_b":"I hope the refugees stay with Obama... His wife and girls should get what they have planned for woman al over..","commenter_a":"ObamaNation only a socialist democratic liberal would create this program. Bernie Sanders love's this unconditional illegal ruling. $9.000 a year NOT to committ illegal crime. Who says crime doesn't pay. After WIC EBT HUD cash aid free ObamaCare medi medi welfare and food stamps total cost to the taxpayer's is over $50.000 a year. What's the incentive to work.!!!!!!! @webpagelink","post_message":"ISIS Promises to BEHEAD OBAMA and Transform America Into Muslim Province"},{"comment_id":"924642210962167","commenter_b":"What a dumbass!","commenter_a":"No political enemy of this country could have done more to destroy it then the Republican party has done over the past 30+ years. They have nothing to offer our citizens but hatred & fraud. Neither Russia nor China could have planned it better. These evil people have taken a strong, compassionate country & turned into the laughing stock of the rest of the free world. All they really want is to have us pay for & die for their desire to make war all the time. It's time we figured out that these \"straight\" (maybe) white men are truly impotent & can only declare their\"manliness\" by making war on everyone rlse, including you & I. If there is such a thing as the \"anti-Christ\", it has come in the form of the Teapublicans, not just one person. They are sickening & digusting.","post_message":"Too true. Image by Occupy Democrats, LIKE our page for more."},{"comment_id":"10153007949671636","commenter_b":"Cannot stand her!","commenter_a":"@username - your favourite!","post_message":"'What's wrong with you?!'"},{"comment_id":"1115803781778734","commenter_b":"True, God's judgement may happen just like in Sodom and Gomorah,, Because guy marriage is wickedness,,,","commenter_a":"The rath of God, is not some thing, they want to play with.","post_message":""},{"comment_id":"1852101905022122","commenter_b":"trump is nasty","commenter_a":"I still can't vote for either of them...","post_message":"WATCH: Hillary Clinton and Donald J. Trump go head to head in the final presidential debate, live from Las Vegas."},{"comment_id":"10153941436496770","commenter_b":"Open your closed minds. Someday we will have a woman president but NOT THAT WOMAN!!!","commenter_a":"What s lie findlly give it up and give it a break. People make the most insane comments. Give the Rep. Some credit because we believe in ethics. You need to grow up and accept Trumps win . If you feel you need to live the country now then leave on the Miley train!","post_message":"And so begins the liberal blame game."}]
