[{"comment_id":"594928020669934","commenter_b":"@username she said with her own mouth she wanna build a wall.","commenter_a":"@username once again dominating the night showing that she is clearly more knowledgeable, articulate and experienced to be President and commander-in-chief. Ready or not, Madame President here she comes!!!","post_message":"One candidate delivers catchy lines—the other delivers results. Add your name to say you're with Hillary. #DemDebate"},{"comment_id":"966636103398507","commenter_b":"Racism is alive and well and all the race baiters are enjoying tearing this country apart.","commenter_a":"This country is screwed up,this is what happens when people are as divided as modern day white people are. Who are the whites of these days owns slaves or would want to own anybody. The bible says u cannot enter into heaven if u don't forgive the ones who wronged u,yet some raise hell about a hundred years ago.what about the tribes in africa who captured weaker tribes and sold them to slave traders never her about that from the fame hunters.what about the poor whites who were treated the same and had to work all week for slab bacon,6 ears corn.","post_message":"RIDICULOUS: I can't figure this one out! Americans need to get their acts straight and realize who really protects them. LIKE our PAGE! www.facebook.com/Briankolfage"},{"comment_id":"10152776078426051","commenter_b":"Bet she's sorry after all those dollars were raised for his support. Selfish woman.","commenter_a":"Too bad that she thinks more of her secondary family then she does your husband in her own child","post_message":"Remember the woman who forced her husband to choose between her and a baby with Down syndrome? Well, here she is."},{"comment_id":"10153981739504091","commenter_b":"Go stick your head in a latrine!","commenter_a":"What did he know about the Clintons?","post_message":"RIP: The star of reality series Ice Road Truckers on HISTORY was killed in a plane crash while he was planning to film a show about recovering plane wrecks."},{"comment_id":"1225058540866079","commenter_b":"Got to Hell Nancy Pelosi! You are lost.","commenter_a":"Brain damaged fool! You're a disgrace!","post_message":"The American people should know: central to the Ryan budget is voucherizing Medicare and cutting Medicaid. Seniors have a lot to lose."},{"comment_id":"10153152962811323","commenter_b":"It doesnt apply both ways. It says it does but woman are malicious and always get their own way.","commenter_a":"Good. And what about divorced men who have brought up the children while the wife goes off to make her fortune without contributing to the children's upbringing?","post_message":"\"At last! The supreme court has just rocked the apple cart of unequal divorce. It has pronounced that being a parent is an obligation that lasts. Even if one parent is no longer around, for better or worse their fortunes are inextricably bound together. Particularly if those fortunes are for better.\""},{"comment_id":"10153061886448188","commenter_b":"Show this to Omuslim in the White House, and remind him how EVIL his Muslim Terrorist pals are!","commenter_a":"The Quran says for them to kill all non believers of Allah......the ones that do not are called hypocrites .....why would anyone say this is not Islam? Quran (9:73) - \"O Prophet! strive hard against the unbelievers and the hypocrites and be unyielding to them; and their abode is hell, and evil is the destination.\" Dehumanizing those who reject Islam, by reminding Muslims that unbelievers are merely firewood for Hell, makes it easier to justify slaughter. It also explains why today's devout Muslims have little regard for those outside the faith.","post_message":"We as a company have aired or released many horrible images in our short tenure as a media outlet, none of which have risen to the level of depravity of the images of Lt. Muath Al-Kaseasbeh’s death. We had chosen not to release these images out of respect for the victim, his family and his countrymen, but also because we do not wish to spread fear and the message of psychopathic killers. This morning, I, as the owner and operator of TheBlaze, have changed my mind. After looking at the images again, I believe it is important for the world to see them. We have been lured into a poppy field where we have fallen fast asleep as grave danger quickly approaches. It is time to wake up. This is the enemy of all mankind. Make no mistake, this is a global jihad and it has everything to do with ..."}]
