[{"comment_id":"1252850228086868","commenter_b":"Hang the bitch","commenter_a":"You all just racist that's why you all up all in trumps ass with his bull so take you all racist ass and do what you do best talk mess about real ppl. Trump going to blow your mind when he turns on you and do what's right","post_message":"Hillary Clinton is desperate these days and has even officially taken to getting down on her knees to beg the American people after Congress announced their next big plans for the corrupt Clinton – and the brutal nature of them has got to have Hillary downright horrified. @webpagelink"},{"comment_id":"935570869827883","commenter_b":"You don't have to apoligize for that bitch","commenter_a":"Don't worry, she is a fringe politician who's party holds only one seat in parliament. She doesn't speak for most Canadians (like me) who abhor Omar Khadr. Our apologies.","post_message":"This video makes me sick. Praising a Taliban war criminal for his \"class\", making light of the death of a U.S. soldier, and having to be dragged off stage all in one speech. I hope her career ends in a fiery explosion ASAP. Here is her Facebook page if you want to share your opinions on her speech > @webpagelink ~Funker"},{"comment_id":"10153782445088984","commenter_b":"Interesting that this is the same city where the Muslims tried to impose Sharia law and got shut down by the mayor, a woman at that!","commenter_a":"This whole thing looks like it was aset up from the beginning, but too many people are jumping to conclusions before the facts are out ...","post_message":"The mayor of Irving, Texas -- the home of the Muslim \"bomb-clock\" boy -- just came forward with a shocking statement about the boy and his family. What she revealed shows exactly what's going on here. This was a setup from the first, and this mayor refuses to stay quiet about it. She needs our support."},{"comment_id":"533363636854216","commenter_b":"if this person had been a white lady, shed be up on charges...black privilege","commenter_a":"Good for her kick his ass","post_message":"After this mom found out her son was rioting, she took immediate action. All the parents in Baltimore should be doing this to their race rioting children. Do you agree her race rioting son got what he had coming?"},{"comment_id":"10153108119036037","commenter_b":"We should have been more selective when your ancestors came over.","commenter_a":"Towels and curtains have a purpose in the USA curtains go on windows and towels go in closet.s neither go on our heads ... if you wanna live love and respect ur traditional values then go enjoy them In your country not cram them in the face of good hard working American s","post_message":"Police in North Carolina say they are still investigating possible motives for the killing of three Muslim college students, whose relatives are pressing for hate crime charges against the alleged shooter. Legal experts, however, say a hate crime case could be difficult to prove. @webpagelink"},{"comment_id":"975974852420526","commenter_b":"You would lie like that? You and Warren deserve each other!","commenter_a":"We really DO need to declare the GOP a terrorist organization!","post_message":"From today's #MorningReads: GOP Front-Group Targets Warren's Legacy; \"Jihad John\" IDed; and Inside the GOP's Campaign to Defang Federal Gun Laws."},{"comment_id":"10155061325079575","commenter_b":"Why would he care about dapl? Obviously he has no intention of cleaning up the water issues in Flint, Michigan either. Because who cares about the people of this country and their wellbeing when you're Trump","commenter_a":"They dont want money it is about the water supply and the destruction of it!","post_message":"President Donald J. Trump signed executive actions to advance construction of the Keystone XL and Dakota Access oil pipelines. The projects had previously been blocked by the Obama administration due in part to environmental concerns."}]
