[{"comment_id":"1786411671679890","commenter_b":"Fucker","commenter_a":"@username sheep bitch","post_message":"100% accurate!"},{"comment_id":"10153176047249255","commenter_b":"His wife should also go to jail .","commenter_a":"Such a self proclaimed victim.","post_message":"This story gets crazier every hour."},{"comment_id":"10156710754945093","commenter_b":"I dont think so!Murderous old hag!","commenter_a":"Everyone should know she is the liar, news video proves it.","post_message":"This woman knows no shame."},{"comment_id":"979482032090033","commenter_b":"I hope they fire this liberal girl.","commenter_a":"What do we expect from a company whose owner and chief executive is arrogant and unChristian!They just follow their leader. hope that more people boycott Starbucks. There are better coffee and cheaoer ones out there.","post_message":"Starbucks seems to be on a roll lately, and not in a good way! Should conservatives stay away from Starbucks?"},{"comment_id":"10153099143921323","commenter_b":"...rape their asses!!","commenter_a":"What will it take to stop ISIS, period! Where are the voices of reason and moderation among Muslim leaders? How can we help them be heard?","post_message":"Noor, a 14-year-old girl from a small village in northern Iraq, was sold 15 times, passed from one Islamic State fighter to the next. Each time, she was raped. Noor managed to escape and made her way, mostly on foot, to a refugee camp. “The worst moments,” Noor said, “were when one man would sell me to another. And I would have to hear them debating what my life was worth.”"},{"comment_id":"1062925700414568","commenter_b":"ruthless assholes w/$$ that want more $$ and have far right wing values!","commenter_a":"What idiot thought privatizing prisons was a good idea? Whoever it was... That's where they belong!","post_message":"Next time someone says we're a free country, have them read this."},{"comment_id":"10153577937396162","commenter_b":"I have always said, the best person to fix a budget problem is a single hard working mama! That woman knows how to stretch every last penny to make it count! If you don't need it and don't have the money for it...you DON'T buy it!","commenter_a":"This is why Illinois has a money problem! Corruption and greedy politicians!","post_message":"BREAKING: Former Governor Rod Blagojevich's sentence has been thrown out and he has been awarded a retrial on 5 counts... @webpagelink For the stories you care about - \"Like\" ABC 7 Chicago!"}]
