[{"comment_id":"1122113947823699","commenter_b":"Her feet are dangling fucking idiot","commenter_a":"And when exactly does he lift her and smash her against the car? Fuckin race baiter, who runs this page yo? Its gotta be a black person, racist bitch","post_message":"He LITERALLY lifted her off the ground and smashed her little body against the car! We just received this, will have more details soon."},{"comment_id":"10153655047616130","commenter_b":"When someone makes those comments, they will learn what my bitch face REALLY looks like!","commenter_a":"Everyone: Are you okay? Everyone: You look tired. Everyone: You look upset. Everyone: You look confused. Everyone: Are you mad at me? Everyone: Why are you mad at me? Me: IT'S JUST MY FACE!!!!! This has been an accurate description on what it's like to live with Resting Bitch Face.","post_message":"Scientists say resting bitch face is real."},{"comment_id":"912506822117747","commenter_b":"Grow up racist","commenter_a":"Thanks Fox, again you nailed it..","post_message":"Just when you thought #FoxNews couldn't get any crazier... @webpagelink From (Y) Counter Current News - MBD"},{"comment_id":"10153504938416336","commenter_b":"This woman, is what evil looks like. They all must be shut down!!!!!!!!!!!!!!!!!!!!","commenter_a":"Wonder what she would do with video of Charlie boy's gang inside the Tate house? Give them medals? #FreeCharlie!","post_message":"Calif. AG Kamala Harris will use her office’s authority to regulate charity organizations to see if the organization that made the videos violated registration or reporting requirements, or broke any other rules."},{"comment_id":"10153748388188132","commenter_b":"You have lost. Your. Mind. Woman.","commenter_a":"All of you women on here calling her disgusting and gross and saying \"Ewww we don't need to see that,\" are absolutely part of the problem. There are countries where menstrual shamming still occurs and young girls are treated like animals as a result. You may think it's gross because you live in an entitled world where you're treated no differently when you have your period. Educate yourselves before you run your mouth... @webpagelink","post_message":"Thoughts?"},{"comment_id":"10154247175501680","commenter_b":"I've seen you post this exact thing, verbatim, on another posting. Are you just copy/pasting on all the posts? If so, I would spend some time on grammar and punctuation because this is completely incoherent. I've tried 2xs to understand what you are saying but i give up by the second run on sentence...","commenter_a":"Trump return dodd-frank law to gang of bail out banks to reduce their power and to transfer it to the people of usa and to stop fraud in the stock market stealing from workers ,middle class investors and retirement funds and reduce USA world's record inequality ,legacy of lawless obama.They will have to pay you your part anyway because if not you send them to jail for using privileged info all together for stock trading,take gang of bail out banks the license to steal with stock market and reduce their money to pay for protests ,lies, to bribe GOP politicians and to own Democrat party.take the financial resources from the establishment.FREE USA.return power to USA people.Make america great again.,there is more freedom in china than usa ,with gang of bail out banks holding power here since they brought obama to powerThere was another fair solution for banks ,was to bring ...","post_message":"The best guide to what Donald J. Trump would do as president appears to be what he said he would do as president."},{"comment_id":"10154357996114203","commenter_b":"innocent guns. why do we ban drugs such as cocaine? if the entire responsibility is on the abuser","commenter_a":"line up Americans arguing what the definition of assault rifle is.","post_message":"Conan O'Brien: \"I am a father of two, I like to believe I have a shred of common sense, and I simply do not understand why anybody in this country is allowed to purchase and own a semiautomatic assault rifle. It makes no sense to me. These are weapons of war, and they have no place in civilian life.\""}]
