[{"comment_id":"1796967167212138","commenter_b":"What an idiot!!! Cher became a Chair!!!","commenter_a":"Scum of the earth. Crawl back into your hole.","post_message":"**Irony Alert**"},{"comment_id":"1144808412242519","commenter_b":"Keep them from working, take away their freebies and they will go back home on their own. Arrest the Gangster Types and deport them, then Build That Wall.","commenter_a":"He should be in jail with killary!","post_message":"A 4-4 tie decision by the Supreme Court upholds the lower courts decision and blocks President Obama's executive action on immigration (#DAPA). This means NO WORK PERMITS for the 4-5 million illegal aliens affected."},{"comment_id":"10154716616787908","commenter_b":"It looks like GE is moving part of it's head quarters to Boston, since Boston will give them a $25 million dollar tax break! It's all about the deal! I'm told that what they're giving back is just a drop in the bucket compared to what they'll get. We're so lucky!","commenter_a":"Yes BERNIE Yeeeeees","post_message":"I didn’t hear the head of GE and all these CEOs who ship jobs to China asking the Chinese for a bailout check in 2008. Instead, after laying off American workers they came begging the American taxpayers for a bailout."},{"comment_id":"670056826483078","commenter_b":"If those wars were a mistake why does the current administration keep sending troops there????","commenter_a":"The Republican Party needs to reform to become the conservative element we once knew before GW Bush or Reagan. They need to let the Tea party folks splinter into another party. Same with left Dems. Together they might found a centrist party most voters could support.","post_message":"You sure can't!"},{"comment_id":"10153348611360950","commenter_b":"And he got arrested? For what? Bitch probably asked for it","commenter_a":"NEEDLE TIME NOW. Not 50 years later.","post_message":"Officials believe the 19-year-old suspect was upset over \"a bad breakup\" with the victim's teen daughter. Police say he confronted the mother as she was leaving her car, shot her multiple times and then went inside her home and fatally shot a dog."},{"comment_id":"10152816607284877","commenter_b":"Girl you better zoom in! Boom","commenter_a":"Yet not a word about the lady in black. They can all kick rocks!","post_message":"Oh boy, they're coming for Michelle Obama for not wearing a headscarf in Saudi Arabia. Read more about her critics below. Grio fam, this seems foul to us. What do you think?"},{"comment_id":"10153444568593984","commenter_b":"hillary shouldn't even be allowed to run, she and all her and obamas co-horts should be in jail for treason. and what would be so bad about going back to the 50's. that was a great time to grow up. at least the govt. was 80% honest and not 99% dishonest. if she gets elected then something is diffinitely wrong with this country and the people in it.","commenter_a":"Sorry Mr. Levin but unless the Republicans can come up with a candidate who doesn't still live in the 1950s and can stay out of people's bedrooms, Hillary will win.","post_message":"BOOM! Outspoken Levin just stepped up to the plate and asked what everyone else is thinking. Hillary will NOT like this one bit... Do you support Mark Levin?"}]
