[{"comment_id":"774141519351123","commenter_b":"I hate when people treat service workers less than human just because they are having a bad day. I have been there as a server. Some people are evil!","commenter_a":"Entitlement, is why ppl act the way they do. But as a Manager sometimes you have to take what the customers throw at you, they are not always right but you make them Think they are! Its all in a days work, manager or not, right or wrong, you look like an ass when you throw a fit like this.","post_message":"Wow."},{"comment_id":"10158461091345206","commenter_b":"I wouldn't put it past that liar!!","commenter_a":"Dan Elsa","post_message":"“Early in Clinton’s tenure as secretary of state, she and her staff were observed removing lamps and furniture from the State Department which were transported to her residence in Washington, DC.\""},{"comment_id":"1003748633011864","commenter_b":"Gurmeet.... YOUR POINT IS MOOT.","commenter_a":"Things that make you go Hmmmm???? Curious how some women would vote for a candidate, that said he would date his own daughter if they weren't related. And said he was waiting fro her breasts and ass to blossom when she was younger.","post_message":"In one of his most overt efforts to reach out to the critical Latino voting bloc, the presumptive Republican presidential nominee Donald Trump wants to address a meeting of influential evangelical Hispanics this weekend hoping to draw their support this November. Do you believe this gesture is sincere?"},{"comment_id":"1135206533157482","commenter_b":"this isin't just people is it mr.president but our enemy vowing to destroy us and your actions importing these islamic terrorists into our city walls is aiding our enemy to carry out their evil intentions . STOP THE POISON IMPORTS NOW !!!!!!!!!!!!!!!!!!!!!!","commenter_a":"But of course. We discriminate against people based on their skin color .","post_message":"Persecuting Muslims is not the answer."},{"comment_id":"632963596894219","commenter_b":"No one with half a brain watches her ANYWAY!!!","commenter_a":"WHO'S OPRAH","post_message":"People are finally getting fed up with Oprah... Great. Let's get this hack off the air once and for all. Should Oprah be kicked off TV?"},{"comment_id":"10153939182654060","commenter_b":"There are no women in a yakuza clan.","commenter_a":"Curiously -- nothing is said about females role in the family🔮","post_message":"In 2011 a Belgian photographer was allowed entry into one of Japan’s Yakuza families. Over two years, he captured the lives of those living in the underworld"},{"comment_id":"643301722461533","commenter_b":"Does the American flag represent millions of people that have done nothing wrong and try to survive under a fucked up government? Or does it represent something else? See, that's the beauty of this flag. It holds different values for different people. You don't value yourself, others, anything? You more then likely will despise what I say and verbally attack me.You blindly support atrocities committed by our shit-for-brains leaders, you'll probably verbally attempt to attack me. My point remains clear, for those with a mind to think for themselves.","commenter_a":"Just for shits and giggles. I want to see the love we all profess for one another.","post_message":"This is epic."}]
