[{"comment_id":"10153671011123132","commenter_b":"Being a hooker.","commenter_a":"Oh pleeeeeeeze, her profession is/was a stripper. She posts lots of photos of her body parts all the time. How do you think she pays her bills?","post_message":"Whoa!"},{"comment_id":"10154465141311037","commenter_b":"Melania DUMP","commenter_a":"Think the media wants to sh!t all over this to distract the public on what's really going on...","post_message":"Did Donald J. Trump's campaign literally just RickRoll the nation?"},{"comment_id":"10153366613454712","commenter_b":"She's a joke","commenter_a":"So how is she suppose to be courageous when she hides reports that was commonly issued? She hide knife? How is she courageous? How courageous to point a muder finger at innocent driver","post_message":"Memo to Marilyn Mosby: Baltimore wants transparency, not sealed documents and gag orders."},{"comment_id":"10153245276305950","commenter_b":"Right clown ass hoe bitch go die","commenter_a":"And we call these animals humans??! Disgusting how they are getting away with treating the people who put their lives on the line to defend them. We should allow them to continue to kill each other ... that would mean less barbaric, meaningless, animals taking up valuable oxygen","post_message":"WATCH: Some 'angry' protesters clash with police in Chicago video of #LaquanMcDonald's shooting released @webpagelink"},{"comment_id":"10157030256485615","commenter_b":"'The Tennessee hardware store owner who banned 'the homosexual people' and posted a 'No Gays Allowed' sign at his business last year recently constructed an outhouse that he's calling a 'Transgender Bathroom.' @webpagelink","commenter_a":"yeah he test each person that comes in his store","post_message":"And yes, he sells 'choose god or gays' hats, too..."},{"comment_id":"10153555838691336","commenter_b":"Bring back W. I want the border sealed. Military USA should patrol its own borders. No longer want any language spoken in my country. No longer want to know that the 'immigrants' get to bring everyone. No Welfare, no SSA because you have a work history while an illegal immigrant. I want the next President to Stand for American Values. Jeb Bush only stands for Obama's values. Open Borders and Anyone can use our welfare system.","commenter_a":"he needs the help.....","post_message":"Yesterday, Jeb Bush told Neil Cavuto that he thought his debate performance 'went fine.'  Do you think so?"},{"comment_id":"819559654746124","commenter_b":"PS I certainly hope he doesn't think he's in the same league as Martin Luther King he's not fit to carry his shoes","commenter_a":"MLK Jr. Yes, Al Hell No !!!","post_message":"Martin Luther King, Jr. was a principled Christian who stood for his morals and convictions when fighting the Jim Crow in the Democrat-controlled South. For his courageous efforts, he paid the ultimate price.   Do you support MLK, Jr. and oppose Al Sharpton?"}]
