[{"comment_id":"10156550497830354","commenter_b":"It would seem to me that either of the following words would properly describe this situation; Epic... Fail, Fell, Fall.","commenter_a":"Weedoing out the useless.","post_message":"Distracted walking while using an electronic device led one man to a deadly 60-foot fall off a San Diego cliff on Christmas Day..."},{"comment_id":"1734664193415362","commenter_b":"Don't Worry Bernie supporters.. !! Hillary will never win, well never let her ! #FeelTheBern #NotMeUs #HesWithUs","commenter_a":"Hillary is the clear choice for the White House!","post_message":"What a week."},{"comment_id":"10153838420452217","commenter_b":"English can be privatised ? Wow.","commenter_a":"I'll trademark all the vowels...That way they are just spcsvrs...which makes no sense...","post_message":"Yes, you are reading this clearly. 👀 👓"},{"comment_id":"10153162076526680","commenter_b":"How the hell did you get to this conclusion based on my comment ?","commenter_a":"He's 100% right. Charlie Hebdo was especially targeted because they did cartoons criticizing Islam. What's more frightening in last week's attacks, is that, there was no rationale, just indiscriminate killing of everyone in sight.","post_message":"John Kerry suggested that there was a “rationale” for the assault on satirical French weekly Charlie Hebdo, unlike the more recent attacks in Paris."},{"comment_id":"800733213450589","commenter_b":"Islam was banned from the US in 1952, but Obama doesn't want you to know that nor does he respect or uphold the U.S. law. The immigration and Nationality Act passed June 27, 1952 revised the laws related to immigration and naturalization and nationality for the United States. The act, which became Public Law 414, established both the law and the intent of congress regarding the immigration of aliens to the U.S. and remain in effect today. Among the many issues it cover, one in particular found in Chapter 2 section 212, the prohibition of entry to the U.S. if the alien belongs to an organization seeking to overthrow the government of the United States by \"force, violence, or other unconstitutional means\" This, by it's very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House. Islamic immigration to the U.S. ...","commenter_a":"No! God gave them a place to make there home! we do not have the space!","post_message":"Dalai Lama Warns America And Europe About Muslim Refugees... Obama Shocked If this isn't a sign that we should close our borders than I don't know what is. Do you think we should let Muslim refugees into America?"},{"comment_id":"10153494540359641","commenter_b":"Good decision. No one wants to take the chance of harboring snakes on their own homeland, before long this migrant group would breed like crazy and before long their population would be 40 p.c or more and they might get some enlightenment and start bombing the locals.. The problem with most muslims, is they are always muslims first. They are not british, germans, australians, americans..There identity is muslim first and that's why its hard to trust loyalty of someone whose citizenship comes second to the God..These people can easily be blinded. From birth they are taught to prepare for heaven, if only they had such devotion for their mother land. Be it, wherever they are born, what ever citizenship they hold. The greed of heaven and fear of hell has done more bad to man than good.","commenter_a":"Oh no, of course not!","post_message":"Slovakian minister insists it's not discrimination."},{"comment_id":"10153613317153132","commenter_b":"Lovely woman","commenter_a":"magnifique Augrey","post_message":"\"I didn't know she was a movie star. She always looked at my father like he was the center of attention.\""}]
