[{"comment_id":"741809245917684","commenter_b":"THOSE 3 BITCHES...ARE GETTING THE SHIT GANG BANGED OUT OF THEM NOW.","commenter_a":"IS is recruiting sluts for sex only son","post_message":"Aqsa Mahmood, 20, left her home in Glasgow in 2013, and married an IS militant in Syria."},{"comment_id":"800883556714802","commenter_b":"Rheemyck Contreras","commenter_a":"Lexx Kennedy can we get one","post_message":"WATCH: Black panther creeps up on a man not paying attention? Wait for it... wait for it..."},{"comment_id":"1164591366914667","commenter_b":"Texas, enough said.","commenter_a":"Try to keep your vagina in your pants 'Ladies'","post_message":"The closing of safe, clean clinics across the state has brought the back alley abortion back to Texas."},{"comment_id":"10153428206108984","commenter_b":"She needs prison time!","commenter_a":"As far away as possible","post_message":"Looks like this is coming back to haunt her...  Do you think Hillary Clinton needs to stay far away from the White House?"},{"comment_id":"1129299917126536","commenter_b":"Hillary is the real war on women.","commenter_a":"Together we Move Forwards Vote to President @username 2016.","post_message":"In ten years, we can generate enough renewable energy to power every home in America. #EarthDay"},{"comment_id":"10154719986051130","commenter_b":"I'm a middle income American born and raised in America I paid Social Security and income taxes all my life I'm tired of supporting illegal immigrants and people freeloading from the US government on my nickel pretty soon the freeloading is going to stop","commenter_a":"Now I see a lot of ignorant uneducated and sick people talking about things that don't make any sense against the president when Donald Trump gets going you people that are on welfare illegally you people that get free handouts from the government illegally for you people the freeloading stops you're going to have to get a job and actually work for a living.","post_message":"WATCH LIVE: President Trump to speak in Melbourne. @webpagelink"},{"comment_id":"10153219716141336","commenter_b":"Geraldo is out there looking for trouble. He does not belong there.","commenter_a":"Sick of All of this!","post_message":"Geraldo Rivera reacts to the current atmosphere in Baltimore as police make arrests: 'The cops are swarming over the demonstrators that have defied the curfew.'  Tune in to 'Hannity' for continuing LIVE coverage."}]
