[{"comment_id":"10152683418148067","commenter_b":"Don't worry. You're 10 times better looking than this homely chick.","commenter_a":"I'm 20 and my biggest accomplishment is not setting the house on fire.","post_message":"While her peers are chatting about boys and clothes, this teen is texting the CEO she hired to run her growing business. @webpagelink"},{"comment_id":"1034345616576908","commenter_b":"Please. Many women CANNOT use those. I never could. Not everyone is the same dear.","commenter_a":"Ladies....Honestly. Get a menstrual cup. You will hate yourself for not doing it sooner.","post_message":"This should not be a thing"},{"comment_id":"1237060979686981","commenter_b":"Felicity Odgers! See, your friend would go viral with 'fox'","commenter_a":"the \"mole freckle\" on youtube is more amusing.","post_message":"That's definitely not right!"},{"comment_id":"1270965036267418","commenter_b":"This poor dear is fighting an incurable disease and still want's to see American go back to being a great Nation again. Hillary keep you porn star and all the other jokers you can muster up. Melissa never give up dear, God can do miracles. Thanks for being a strong and down to earth women, unlike Hillary's choice of women.","commenter_a":"Rick Webb","post_message":"Former Miss Wisconsin USA Melissa Young, who is battling an incurable and fatal condition, said a note from Donald J. Trump in her darkest days reminded her that \"my purpose is to fight and I need to get up and fight.\""},{"comment_id":"1903950129833878","commenter_b":"@username It was stolen! Putin and Trump stole the election, doesn't your little brain understand this. A foreign dictator stole our election so that this con-man could be manipulated by an evil russian. Read!!","commenter_a":"Then come on Democrats, let's shut down America! Trump cannot make it to the White House!","post_message":"No doubt! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154016611014087","commenter_b":"I agree but Jill can't win. It'd be impossible. So Hillary because of the Supreme Court","commenter_a":"\"The dems candidate is a disgusting violent criminal who should be locked up\" - every republican. \"The Republicans candidate is a disgusting violent criminal who should be locked up\" - every Democrat. \"You both are right\" - every sane person in the country #jillnothill","post_message":"Minnesotans have not voted in a Republican at the presidential level since Richard Nixon's landslide victory in 1972."},{"comment_id":"1207103952642966","commenter_b":"I'm a democratic and I don't like gay people at all I mean at all.","commenter_a":"I thought she was with the Inquisition.","post_message":"Kentucky clerk Kim Davis, a longtime Democrat, says she is switching to the Republican Party because she feels abandoned by Democrats in her fight against same-sex marriage."}]
