[{"comment_id":"10153553147025927","commenter_b":"Send her into orbit!","commenter_a":"Racist","post_message":"Apparently Whoopi doesn't care if the DNC rigged the system. Why? Because it's against a white guy. #DNC2016"},{"comment_id":"851850534874696","commenter_b":"Loads of respect for her now:) well done woman! Anything to wind those twats up makes my day","commenter_a":"Good","post_message":"Selena Gomez sparks fury by violating religious dress code in mosque."},{"comment_id":"1859871360913002","commenter_b":"Can we please build that wall around his ugly face and throw dirt in his mouth!","commenter_a":"GEEZ LET THAT MAN BUILD THE WALL ... @webpagelink","post_message":"\"We will build a great wall along the southern border,\" Donald J. Trump told a crowd in Phoenix, Arizona, during his immigration speech. After a long pause, he continued: \"And Mexico will pay for the wall.\" @webpagelink"},{"comment_id":"1028975063831277","commenter_b":"That lady has no clue","commenter_a":"What was the criminal background of the one shot in chicago by the cop? Just wondering. Did we get rid of an upstanding future physisist, doctor, or a career criminal who's career was cut short? Just wondering !","post_message":"OUTRAGEOUS: Chicago Thug Executes 9-Year-Old Boy Point Blank In The Head, Black Community SILENT! (VIDEO) They won't protest this child killer, but will protest a cop who shot and killed a thug! SICKENING! Share this if you're sick of these people and their bigotry! FOLLOW OUR PAGE---> Freedom Daily @webpagelink"},{"comment_id":"10152844274493525","commenter_b":"Burn the witch!!!!!!!","commenter_a":"good....now put him to sleep!","post_message":"The 30 verdicts for Dzhokhar Tsarnaev in the Boston Marathon bombings trial are as follows: Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty."},{"comment_id":"10154156633758822","commenter_b":"Ship all libs and Democrats there now!!!!","commenter_a":"Can we send the Obamas and Clintons as test citizens? Perhaps their buddies in Isis?","post_message":"Humans on Mars by the 2030s! That's what President Obama's plan calls to do."},{"comment_id":"590256634486210","commenter_b":"Haha america was never great and with you or Hilary as our president it will continue to never be great !","commenter_a":" Vote strong Vote Trump","post_message":"This is only the beginning. Hillary is CROOKED! She is not capable of making America great again. Sadly, she would do the opposite."}]
