[{"comment_id":"10152698391808717","commenter_b":"She's no Zumba instructor but she's not","commenter_a":"She's a hottie","post_message":"Claremont police say two people face charges after selling cocaine, crack cocaine and heroin in a school zone. @webpagelink"},{"comment_id":"10153084060819330","commenter_b":"I. Jesus. Side. Way. I am not. Crazy. Even. With. Alzheimer. If. He. Every. Receive. Jesus. He. Still can. Today","commenter_a":"Elvis with his wings bowing his head.","post_message":"Do you see the angel in this ice formation on a porch in Bristol? Audrey Totire sent us this See It, Share It photo after her friends noticed the image of what they say looks like an angel.  What do you think?  See more top photos from the week here ---> @webpagelink"},{"comment_id":"1846250902324669","commenter_b":"Don't pay pajama boy any mind! He'll be out of office in 30 days. Thank God! Then a real alpha male will show him how to run a country. Can't wait until the wuss is out of our White House and Trumps takes over.","commenter_a":"'They don't produce anything that anybody wants to buy', well, dear Americans, you are using Russian Soyuz space rocket to go into space, cause you just can't anymore.","post_message":"President Obama on Russia: 'They're a smaller country, they're a weaker country, they don't produce anything that anybody wants to buy.'"},{"comment_id":"663841097139802","commenter_b":"F the immigrants, it is Thanksgiving, you Effing Retard. Welcome to America, we are Americans.","commenter_a":"fuck him","post_message":"The Obama administration is trying to ruin your thanksgiving.  This is absurd. We can't let him get away with this.  Will you still call it Thanksgiving no matter what?"},{"comment_id":"10153580791529170","commenter_b":"She is so stupid she thinks she Smarter than anyone else but Slick Willie has been out fooling her all of her life","commenter_a":"i guess im stupid","post_message":"According to Hillary, we're all just too stupid to understand how brilliant she is. She gets frustrated by that, and admits that her frustration is her 'greatest weakness.'"},{"comment_id":"10154004285427061","commenter_b":"She is so ugly put a sack over her face","commenter_a":"I tried a similar comment above in my own post. Ppl are to busy thinking they are better or truly know or believe in the government to see the truth right in front of them. A little less attacking the comments of others on Fbk, an you could be smart enough to see the truth. Sure everyone deserves to dress lovely; however people continue to starve. Until you have walked a mile as I have struggling to feed your family/children; enjoy your fancy clothes. I will enjoy feeding my family!","post_message":"WATCH: Fashion forward First Lady Michelle Obama stuns at last night's White House State Dinner: abcn.ws/2ejwQwD"},{"comment_id":"10157208654565294","commenter_b":"Preach!","commenter_a":"God I wish we could stop talking about this guy. Who cares he's a waste and obviously doesn't want to try and help himself in anyway. Glad he's at least not on the Browns any more.","post_message":"'I hate to say it but I hope he goes to jail. I mean, that would be the best place for him.'"}]
