[{"comment_id":"10153912025664030","commenter_b":"Kiss my ass.","commenter_a":"'@username lol sleep tight","post_message":"Not Safe with Nikki Glaser asks the questions you didn't know you wanted answered.  All-new episode, tonight at 10:30/9:30c."},{"comment_id":"10154683704293984","commenter_b":"Lil pussy","commenter_a":"Go Trump!!!","post_message":"Actor Brad Pitt just shook things up with a very public Donald J. Trump rant that caught everyone by surprise..."},{"comment_id":"10153724329286336","commenter_b":"How about all countries fight isis and then the refugees CAN STAY HOME !","commenter_a":"The last time Russia was in the battle with the Muslim''''''''''''''''s they lost. They run back home and was broke after a decade. I say let them do it again while we rebuild our defense up again.","post_message":"'If he wants to fight ISIS, let him fight ISIS – why do we always have to do everything?'  Donald J. Trump told Bill O'Reilly that the U.S. has invested trillions of dollars and thousands of American lives in the Middle East, and he thinks it’s great that Vladimir Putin wants to take over what America has started. @webpagelink"},{"comment_id":"2004741493095269","commenter_b":"Because he does suck dick","commenter_a":"Why does he always look like he is about to suck a small dick?","post_message":"What an idiot."},{"comment_id":"10153180369332042","commenter_b":"Idiots.there goes their life down the drains.","commenter_a":"White trash ! Throw Away the key","post_message":"SINISTER GROUP 'PROJECT:' These 5 students met before and after school for week -- but they weren't working on a group project for class or a fundraiser for a pep rally.   Cops say what they were planning on doing was deadly."},{"comment_id":"10154165798037212","commenter_b":"It was an accident. Please use your words kindly. The driver needs our prayers . This was a total accident.","commenter_a":"I'd kill someone hands down. Hit my kid or my dog with your car and you better pray the police get there quick enough. I'm at a loss of words for this little family. Praying for them with everything in me.","post_message":"UPDATE: A 2-year-old boy has died after being hit by a car Tuesday night in Yukon. #News9"},{"comment_id":"1440691939283888","commenter_b":"Your point Is right. This woman shouldn't have so many children if she's can't even provide them basic needs for them... oh wait... we the tax payers do that for her!","commenter_a":"I think what Eddie did was fantastic and shows what a caring heart he has. On that note, hell, if it worked for her might as well try. I'm a single mom of a 12 year old. His dad passed several years ago. I'm a veteran of the US Navy and served during Operation Iraqi Freedom. I'm a teacher that works hard for all I have, and I have thousands in student loan debt (like many other college graduates). Would anyone like to give me free money so I can spoil my son with all the latest technological gadgets? *please, before you comment about how I'm greedy, be happy for this woman. I am happy for her and I don't actually expect to receive, nor do I want any money from anyone. It just seems that this story is a 'feel sorry for me' bit. We all have our hardships, ...","post_message":"Down on her luck, facing eviction with six children hopeful for gifts during the holidays, Tyshika Britten turned to Craigslist for help, and found it with a $10,000 donation from Pearl Jam's Eddie Vedder.  >>@webpagelink"}]
