[{"comment_id":"10153894125869205","commenter_b":"Another whiny bitch.","commenter_a":"Hey dummy it's not that you are reporting about him it is you only complain about him. Where as with Hillary you are sold out to her just like Bernie.","post_message":"After getting $2 billion in free advertising from the corporate-controlled media, Donald Trump is now whining about the fact that they’re being super mean to him (by doing nothing more than reporting on what he says.) The Ring of Fire’s Farron Cousins discusses this."},{"comment_id":"1686157554986660","commenter_b":"Smart woman only a dummy would join Scientology!!","commenter_a":"Kirstie, you are beautiful and such a smart woman! I applaud your endorsement of Donald Trump. Don't let your \"neighbors\" get you down.","post_message":"I am sure people in Hollywood are losing their minds right about now, but this actress is NOT backing down. Do you support Kirstie Alley's presidential pick?"},{"comment_id":"10153212099990927","commenter_b":"She and Whoopi are proof that there are people in this world that shouldn't be allowed to reproduce.","commenter_a":"She is so irrelevant.","post_message":"So if you don't ago along with Obama plans...you're racist? Only the 'View' Crew could come up with something so stupid."},{"comment_id":"831083283688817","commenter_b":"Just a bunch of fat people eating fat food. No incumbents in 2016 november.","commenter_a":"America runs on Dunkin!!","post_message":"Elizabeth Warren repped Massachusetts by bringing Dunkin' Donuts to the House sit-in."},{"comment_id":"10153236305609342","commenter_b":"You have a brown child, she can easily be in the same boat!","commenter_a":"Hopefully her family can let her rest in peace and find a new cash cow to milk..","post_message":"JUST IN -- The 11-page report released Friday corroborates findings detailed a day earlier by Waller County officials. Warning: Some details are graphic."},{"comment_id":"1308235872529496","commenter_b":"Such a HORRIBLE breed!! !!","commenter_a":"I hate pit bulls ... If judge Judy doesn't like em.... It's good enough for me .... Example here!!","post_message":"Noah suffered injuries to his head and face and underwent emergency plastic surgery."},{"comment_id":"10154319616791337","commenter_b":"???????????? LOL ????????????","commenter_a":"Looking forward to Colbert's inevitable rant about this, since he has Cap's shield.","post_message":"PURE FURY! Captain America fans are losing their sh*t over this decision..."}]
