[{"comment_id":"1642423912674968","commenter_b":"'@username health INSURANCE is NOT health CARE","commenter_a":"Wait....hold on a second. Usually stories like this are about people fighting to keep someone alive who wants to die. This time, this poor guy wants to live and the hospital wants to take his life, while he is coherent and of sound mind? I didn't read the story, but I would bet this is all because of $$$ or medical insurance!","post_message":"Heartbreaking video shows Chris Dunn nodding and putting his hands together in prayer when asked if he wants to live."},{"comment_id":"10153789765316770","commenter_b":"All for it don't need to spend our hard earn money on racists black bastards that haven't Done anything for our country America ! ! ! But disrespect our American laws our American Flag and our national anthem along with discriminating against white Americans and our American Veterans","commenter_a":"Boycott all nfl games and their sponsors.","post_message":"If they thought their fans would blindly go along with any insult to their country, they were sorely mistaken..."},{"comment_id":"10154468186761051","commenter_b":"She should never be allowed in another classroom!","commenter_a":"GOOD!","post_message":"This teacher was given the boot after video of what she did to Donald Trump went viral."},{"comment_id":"1563567157272928","commenter_b":"Stupid ass motherfucker","commenter_a":"way to go rosie, now evryone knows why trump treats you like he does. you usless POS. Done let the door hit you in the ass on the way out. if Canada doesnt want you, please dont come back","post_message":"Rosie O'Donnell just restarted an epic feud."},{"comment_id":"966056150146121","commenter_b":"Slow learners. Blacks keep voting Democratic even though Dems have done nothing but baby them and keep them down.","commenter_a":"They STILL haven't learned about the democrats !!!!!!!!!!!!!!!!!","post_message":"LANDSLIDE"},{"comment_id":"10154465918697235","commenter_b":"She might have been taken off because she is a hateful bitch. I cannot imagine someone would want to have sex with her.","commenter_a":"He should have taken you off the air YEARS AGO, Andrea Tantaros for being a LIAR and ILL-INFORMED. Good Luck with your impending lawsuit. Hope to never see you on the air ever again.","post_message":"WHOA"},{"comment_id":"10153753535205695","commenter_b":"She should be impeached","commenter_a":"I don't think she should be jailed. They should just fire her.","post_message":"#BREAKING: Judge orders defiant Kentucky clerk to jail after she refuses to issue marriage licenses."}]
