[{"comment_id":"10153444075108132","commenter_b":"Pretty sure she's had surgery and botox.. or some serious airbrushing was done. Cripes everyone at 50 has a wrinkle.","commenter_a":"Thank you for picking someone normal and down to Earth without a bunch of surgery","post_message":"Sandra Bullock is PEOPLE's #MostBeautiful Woman! @webpagelink"},{"comment_id":"10154252352423984","commenter_b":"Megyn is a bitch-not interested in anything she says.","commenter_a":"WHAT?????? Megan Kelly reported something bad about Trump - I am in shock -","post_message":"Trump's not going to want to hear it..."},{"comment_id":"1541468506160349","commenter_b":"If, they take away guns criminals will build bombs !","commenter_a":"America has got to be in the grip of a a gun cult. When reason and logic doesn't work, you know the NRA propaganda has got a serious grip on us. We've shown the world how much our armed gun citizenry has worked - America's mass shootings are on a continuous news cycle being aired around the world. They must think we are arrogant when we refuse to look at their own country's statics as proof that less guns indeed do work. It's so logical, so reasonable, less guns, less gun related deaths. Yet we continue to be surprised at each mass shooting and continue to have vigils and prayers only to buy more guns. Other country's must laugh sadly at our arguments of death by spoon, forks or auto or our description of a gun being an inanimate object or that guns don't kill. Other countries must seriously hate ...","post_message":"Mic drop.   Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10157053250220354","commenter_b":"She can't keel over soon enough. Evil beast!","commenter_a":"She's choking on all her lies!","post_message":"“You all right? Any mouth to mouth CPR?” one of the hosts joked, trying to lighten the mood.  “Senator, you coughing like you have something medicinal,” another host said.  LISTEN:"},{"comment_id":"10153631699856680","commenter_b":"Voter beware..","commenter_a":"We need to Unionize and fight back go on strike. I want those Rust belt Democrats to lean left and far left.","post_message":"They used to be Democrats. Now they really could hand Donald J. Trump the White House."},{"comment_id":"504839586342663","commenter_b":"You slimy cocksucker","commenter_a":"The poor need to try harder","post_message":"\"We are the first generation in human history that can end extreme poverty.\""},{"comment_id":"801468519888245","commenter_b":"The female judge is pathetic.","commenter_a":"Wow....","post_message":"The cop sexually violating her body is evil enough, and to see the judge's reaction is absolutely chilling. Watch now (WARNING: GRAPHIC): @webpagelink  -Via Filming Cops flashback files."}]
