[{"comment_id":"10153564963769778","commenter_b":"Happy Birthday Andrew Thomas,thought you might like this. :D","commenter_a":"hahah xD oh i must watch i will feel the flow xD i know it!","post_message":"After reviewing dashcam footage, the Dover Police department in Delaware came across some interesting sights. \"We hope you enjoy this...and Taylor Swift, if you're watching...we're sorry.\""},{"comment_id":"10153170015287690","commenter_b":"Eeewww No girl!!! Hate Snakes","commenter_a":"Margaret thought of your pet at Millies.","post_message":"\"If one got in the house or in the cars, I would have to move.\" One North Texas family fights hundreds of copperheads on their property: @webpagelink"},{"comment_id":"10153591312367217","commenter_b":"The death of the GOP is fun to watch!","commenter_a":"I can explain it in fewer words - sore losers","post_message":"He's the presumptive nominee but not everyone's a fan of The Donald."},{"comment_id":"720325791491332","commenter_b":"Josiee, you write like a whore. Are you?","commenter_a":"Screw the Muslims if they do not like our christian message go back to where you came from","post_message":"Trump is in deep trouble after sending out a beautiful message to his supporters. We stand with him. Can we get 40,000 ‘LIKES’ for Donald Trump?"},{"comment_id":"10152860079081130","commenter_b":"Her fat neck though!!","commenter_a":"His hair looks like an old lady! This kid has serious issues!","post_message":"Ellen and the Biebs are at it again."},{"comment_id":"1012223128870741","commenter_b":"Finally, someone says something. Geez, spot on Sean Penn 😊","commenter_a":"All trash talk by liberal wimps","post_message":"He's right. America must never forget who is truly responsible for creating ISIS. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10156088559505294","commenter_b":"In my opinion, the collarbone issue and sleeveless tops or dresses are a bit over the top. The women in most offices I've worked at wore sleeveless dresses and tops that were tasteful and appropriate. Even the women news anchors wear tasteful sleeveless outfits. I don't see a problem with that. I do however agree a dress code should be in place for kids in school. When they get out in the real world, there are rules, and they have to be followed. 48-50 years ago, we had to wear skirts or dresses that touched the floor if kneeled down. If it didn't touch the floor, we had to change. The guys had to wear belts. If they didn't have a belt, they had to pay 50 cents for a piece of masking tape with the word belt on it and tape it to their pants, and they better have ...","commenter_a":"I say all schools should have a dress code and make sure all students adhere to it. It teaches them to accept things in life their not happy about, but rules must be followed.","post_message":"It's back to school time, and we're hearing more stories about dress code violations. Students at one school in Chicago are protesting a rule that they wear only shirts and dresses with sleeves. Click below for more, and tell us: Are dress codes these days fair? Unfair? Do they go too far?"}]
