[{"comment_id":"10153024604841037","commenter_b":"Black people should pay more TAX","commenter_a":"Poor Bill, women coming from everywhere trying to get a payout. I believe you Bill.","post_message":"A model who claims #BillCosby assaulted her at the Playboy Mansion met to pursue criminal charges"},{"comment_id":"10153071085836051","commenter_b":"Kill that bitch!!!!","commenter_a":"Hell hath no fury, right? Sick, sick, sick.","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"1027413480657895","commenter_b":"Cause he wanted to, yall white people ready to see a brother arrested","commenter_a":"He has already turn himself in people are so stupid","post_message":"UPDATE: The brother of the man identified as a person of interest in the downtown shooting tells NBC 5 his brother has nothing to do with the shooting - in fact he said his brother handed his gun over to officers when the shooting happened: @webpagelink"},{"comment_id":"10153622998001323","commenter_b":"Don't give the bastard any ideas !","commenter_a":"This is why there are so few Tory comedians, they're about as funny as a burning orphanage.","post_message":"Barmpot."},{"comment_id":"1295164193914868","commenter_b":"Then her skin is too thin. I'm sure she's seen and heard much worse. Does she know what Muslims do to women?! And she wants them here sooooo bad.","commenter_a":"She is selling her soul to the devil. She can push the likes of Clinton on us. You can't be gone soon enough!","post_message":"First Lady Michelle Obama says the revelations about Donald J. Trump's treatment of women have “shaken me to my core.”"},{"comment_id":"1442368625820278","commenter_b":"@username maybe they would consider it if people would stop coming here illegally !! If America is not such a coveted place to be then stay in your country and deal with the shit you are handed !! It's quite simple ! But come here and mooch, steal, kill, sodomize , rape and terrorize then there will be action !! I'm not condoning it who likes war it's ugly but it is what it is !!","commenter_a":"The chinese & north koreans have killed millions, the russians and so on why just nail the USA? Ask China & Russia what their ammo is made from! Chocolates & jelly bean? Really, wake-up!","post_message":"People don't understand how bad this really is."},{"comment_id":"10153138369757293","commenter_b":"freedom of religions","commenter_a":"Delaney Lynch","post_message":"“To be the first person to touch something that’s been lost for 300 years is a magical experience.”"}]
