[{"comment_id":"10153469864552144","commenter_b":"Damn illegal immigrants voting illegally!","commenter_a":"His mother is on the voting rolls in Canada in 1974. You cannot have dual citizenship and vote in Canada. The question becomes, when did she renounce her American citizenship to vote in Canada? Or did she vote illegally?","post_message":"Hahahaha."},{"comment_id":"10154177400546756","commenter_b":"I do not intend to vote for her in Any case. Her shady politics, her Attitude, the skewed way this contest has been run, and my basic gut reaction of Strong Dislike for her are nearly overwhelming enough but... This recent tack she has made Insisting that the Democratic party MUST Permanently Give Up on things like Universal Health Care, drug reform, campaign reform, college access, and essentially Everything that Really Matters to ME as a voter has Convinced me that I CANNOT - under Any Circumstances pledge My Vote for her. To do so would be to Agree with her disgusting defeatist position. The truth is, this is the Same reason I will not vote repugnican. And, while you may say my actions make it more likely a Rep. will win, I see no Real hope in a Hillary win Worth Voting FOR. Deal with it.","commenter_a":"So, for those who will not vote for Hillary Clinton if she becomes the democratic nominee, do you think it is possible that this will result in a GOP victory? Would that actually be better for the country?","post_message":"Hillary Clinton is projected as the winner of the Nevada Democratic caucus, according to AP. #NVcaucus"},{"comment_id":"606361476221098","commenter_b":"WAKE UP AMERICA! The racists in our White House have no intentions of getting out. *Note* the race baiting going on now and the targeting of police departments. Obama is trying to start a race war so he can federalize law enforcement and declare Marshall Law so he can stay in office. Too many Americans are distracted by gay marriage and flags to pay attention to his real agenda. Look how he has the South stirred up... he knows that's his biggest problem, freedom loving, gun carrying Christens he knows will defend their rights! GOD HELP US ALL!","commenter_a":"Good grief! What do these people want! I have been picked on and had blacks make racist remarks to me all my life! I just keep on keepin on with the Lord! She only feels inferior because she wants to and as usual the whites get the blame!","post_message":"Controversial video just leaked that shows what Michelle thinks about white people.  This is extremely offensive. We need to spread this, and show the country she's a racist.  Do you agree Michelle Obama is the worst first lady ever?"},{"comment_id":"1016384461715898","commenter_b":"So stop your judgemental whining bitch","commenter_a":"Sorry mice, but as someone with crohns I fully support this research.","post_message":"Researchers have engineered small intestinal tissue from human cells, and when placed in mice, the transplants were able to digest and absorb like the real thing."},{"comment_id":"10154855250569062","commenter_b":"please name a book that would represent all citizens lol come on now. Tennessee is like 81% christian so i think the book works fine @webpagelink/ it represents the people not the government, so there is your seperation :P","commenter_a":"Even when I was an atheist, the bible was a good read. Some of them just need to get their head out of their butt to look at things objectively.","post_message":"Good idea? Bad idea?"},{"comment_id":"10153404466085950","commenter_b":"Go Trump!!! Scared?? Everyone's voting for him!!!! I'm scared of Hillary lying Clinton!!!! Speak for yourself sweetheart","commenter_a":"I'm hoping that if he's the Republican candidate, people will be scared to vote Republican and will therefore vote Democrat.","post_message":"BREAKING: Donald J. Trump will win the South Carolina Republican primary, CBS News projects @webpagelink"},{"comment_id":"10154223180398984","commenter_b":"Go get a life lady","commenter_a":"Sounds like Trump paying someone else to do his DIRTY work. Why not talk about all the mistresses of Trump. It must be the big bucks from Trump.","post_message":"Wow, I didn't expect Anonymous to be the next one to come after Ted Cruz, and the hackers are claiming something BIG..."}]
