[{"comment_id":"1244580435606816","commenter_b":"GET THOSE ANIMALS OUT OF HERE ....PLEASE PEOPLE GET THEM OUT.!!!","commenter_a":"30 minute response time? Sounds like they were having their dinner first.","post_message":"So grateful, so eager to assimilate..."},{"comment_id":"10153238439315950","commenter_b":"seeing as every single non 1st nations person is an immigrant they need to stfu","commenter_a":"Guess you \"forgot\" to mention yr phony ISIS had 20,000 twit-sites taken out by Annonymous? CIA must be a tad depressed today? Not to worry guy's....it's only REAL NEWS! We can find it anywhere but here. Jokers! Shame on the lot of you!!!","post_message":"UPDATE: More states are saying \"no\" to Syrian refugees in the U.S., call for stricter screening @webpagelink"},{"comment_id":"1267032153376522","commenter_b":"What with the Department of Health Services do to \"right size\" the Wisconsin Well Woman Program again if women coming flooding back to the program if the Marketplace goes away?","commenter_a":"How do we make people aware of Ryan's many sleights-of-hands that harm people?","post_message":""},{"comment_id":"10153270179214087","commenter_b":"Wrong @username, when people come across any countries borders without proper papers in hand they are criminals hence they commit a crime. Trump is correct illegal immigration is the most pressing problem for this country of whi h it is not in the least ludicrous. If you are much wanting illegals here then why don't all you democrats join together, invite them to live with you and pay their way instead of demanding we tax payers pay for all the freebies they get, not to mention all those ancor babies that we have to pay for to be born then pay for them and all the freebies they will be getting for the rest of their live.","commenter_a":"real change like we have never seen before. Go Trump!","post_message":"When immigration activists began heckling Donald J. Trump for his remarks on illegal immigration at a rally Wednesday night, his supporters came to his defense."},{"comment_id":"10153208287689087","commenter_b":"@username ... Trump was the topic being discussed. TRUMP didn't start wars.","commenter_a":"Rand Paul.. u r not only a sore loser, u r also a isolationist. We di not want America to be a isolationist nation. We like Trump and his \"make America Great Again\" message. We are REAL Republicans wanting real RESULTS, not words.","post_message":"“The message hasn’t penetrated yet that Donald Trump isn’t one of us. He’s barely a Republican. He’s been a Democrat,\" Rand Paul said. “I think ultimately when voters fully grasp who he is and what he supports, I think they’ll run away with their hair on fire.\""},{"comment_id":"10152926517991491","commenter_b":"A predator is a predator no matter what age they are. I'll bet kids who murder should get away with it based on naivety and hormones too right? Hormones drive alot in a human beings, including aggression, so thats an excuse I guess.","commenter_a":"Go figure. Anti-gay bigot who thinks gays are predators is a predator himself. So much self projection among the religious.","post_message":"“I would do anything to go back to those teen years and take different actions.”"},{"comment_id":"10153201111658984","commenter_b":"DEPORT ALL OF THEM !!","commenter_a":"And the sad part is that I have no faith this error will ever be fixed.","post_message":"This is just astonishing. I think this revelation will make a lot of people very uneasy..."}]
