[{"comment_id":"10155051034632235","commenter_b":"OMG, that white woman nothing but a pathetic looser, of course everyone could attack elderly or children, what a moron, see what happened if she fought younger Korean woman, she definitely 'll get beat up by her taekwondo or judo and beg for mercy, are we going to live backwards like in 90 again!?!😠😠","commenter_a":"It just goes to show you what low life's the \"superior\" white folks are.","post_message":"Welcome to Trump's America."},{"comment_id":"810172682363901","commenter_b":"Send the illegal aliens back","commenter_a":"Illegal immigration is an old problem, the native Americans used to call it \"White People\"","post_message":"It's as simple as that!  www.headlinepolitics.com"},{"comment_id":"10153354234326336","commenter_b":"Women should only be allowed to make the sandwiches.","commenter_a":"Females should not be prison guards for male prisons. And I don't want to hear from all the feminist. That is my personal opinion.","post_message":"BREAKING NEWS: New York state prison employee Joyce Mitchell has been arrested on felony charges for providing material assistance to prison escapees, state police say. @webpagelink"},{"comment_id":"1013388188713944","commenter_b":"All the illegals !!!","commenter_a":"All this happen cause of sin of Obama take our flight mh370 and keeping our passanger","post_message":"Will the blue helmets arrive to relocate tens of millions of Americans?"},{"comment_id":"10153379974755329","commenter_b":"You have a baby in your belly. No more goofing off!","commenter_a":"Michael Aragona @username @username how do you like that?","post_message":"Thank you, restaurant gods."},{"comment_id":"1077262612359760","commenter_b":"She is just nasty.","commenter_a":"That's how classy the liberals are.","post_message":"Today in 2015: Rosie O’Donnell: “I’d Like to Take My Period Blood and Smear It All Over [Pro-Life People’s] Faces”"},{"comment_id":"10156216618090389","commenter_b":"She'll get away with everything , just wait and see.","commenter_a":"I bet she gets away with it that's the way the Clinton's roll","post_message":"Those emails might not be about yoga or Chelsea's wedding. Do you think Hillary is finally feeling the heat?"}]
