[{"comment_id":"1297175820325446","commenter_b":"IF TRUMP IS SO PRO-ISRAEL THEN WHY NOT A 2 TIER SYSTEM AND HUMANE PRISON REFORM SYSTEM HERE 2?!!!!!!!!!!","commenter_a":"Once the ACA is dismantled, people are in for a RUDE awakening. If you thought premiums/pricing was bad before, they will only get higher once 'Obamacare' is gone. Trump voters are, essentially, like the dog with the bone who sees a reflection in the water of another dog with a bone, and tries to snatch it, losing both bones. I guarantee that you will be severely disappointed.","post_message":"LIVE: Sen. Bernie Sanders is holding a town hall meeting on CNN, talking about how we can fight back against Trump's bigotry and fascism.   *** audio is missing from the first few seconds, please stay tuned and it comes on shortly***  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1794488717482719","commenter_b":"Entertainers are daydreamer & live in fairytale world. Reality is not their attribute or focusing on oneself identity. Most live in denial & are good at role playing an artificial character. I'm not shocked at their liberal idealism & doing whatever for attention. These are individuals that struggle with growing up.","commenter_a":"Are they all just insane. Who cares if you cut your hair or any other stupid thing. It only hurts you no one else. So asinine.","post_message":"This is how some liberal women are coping with Trump's election win."},{"comment_id":"1044302852275608","commenter_b":"Trump wouldn't smoke a joint like billy tho","commenter_a":"'@username. @username we will work on your wall mr trump","post_message":"Outstanding! A top priority- so we can MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"180851402403803","commenter_b":"Your a dumb bitch 😂😂","commenter_a":"'@username dude this reminds of all of us 😂😂😂","post_message":"Friends like this  #WSHH"},{"comment_id":"693891444077370","commenter_b":"a lib angry bitch...","commenter_a":"First of all, she's just an angry bitch....second of all: who?","post_message":"Who does THIS Remind you of...."},{"comment_id":"10153811400261002","commenter_b":"Just goes to show we know how to do more than you men lol","commenter_a":"I think it's hilarious.Sadly a majority of uptight women will find it offensive,like they do if the wind blows the wrong way. Relax it's not a d**k don't take it so hard.","post_message":"A new jersey for a sports team has washing instructions that has caused an uproar. It reads  this jersey to your woman, it her job."},{"comment_id":"474611692726438","commenter_b":"Dear god. If I were Trump, and that batshit crazy woman decided to endorse me, I would bow out gracefully. Tail between my legs. Holy cow. She is a kook.","commenter_a":"How was she ever elected Governor!!!!!!!","post_message":"Sarah Palin endorsed Donald Trump on Tuesday. The result can only be described as Palinesque."}]
