[{"comment_id":"1260485777320174","commenter_b":"I can't wait for President elect Donald Trump to take office and start tossing out the undocumented illegals..........I hope this joker is the first to go.","commenter_a":"that is so sick they should kick them all out","post_message":"BOOM! (WATCH)"},{"comment_id":"1008748529146158","commenter_b":"And you are a pussy","commenter_a":"Your not a hunter if your using a gun, your a murderer.","post_message":":("},{"comment_id":"10153278742792144","commenter_b":"Foolish woman do you really think you can reason with a wild animal? Enough already.","commenter_a":"Very irritating.....good for the bear. There was no reason to pepper spray when she could have gone inside.","post_message":"HAHA."},{"comment_id":"10154178050418010","commenter_b":"I saw it! I was walking to the store to get cat litter and it went right in front of me when I was at Hollywood and Sycamore","commenter_a":"Ernesto Peimbert","post_message":"Open convertible driving in the rain: ✓ Donuts on Hollywood Blvd.: ✓ Entire thing almost derailed by a TMZ bus: ✓ It's too early to say, but this may be the most L.A. car chase of all time."},{"comment_id":"1107974842571087","commenter_b":"She lies and lies and lies and lies and . . .","commenter_a":"I AM SO DISAPPOINTED BY YOUR NEW JOB DR BEN CARSON , YOU WERE BETTER AROUND WHITE COAT....[...]","post_message":"Is anyone surprised?"},{"comment_id":"10153644066921337","commenter_b":"Oooooh damn. That sucks man. That bitch took the easy way out. Piece of shit lunatic","commenter_a":"A piece of shit ....is a piece of shit. No need to bring up RACE.","post_message":"GUNMAN IDENTIFIED: Former WDBJ7 reporter Vester Flanagan is behind the horrific on-air shooting of two news team members."},{"comment_id":"933293176705778","commenter_b":"@username have a shitty day bitch","commenter_a":"COPS ARE MURDERERS AND MANIPULATORS","post_message":"It's been called the most gruesome case of police brutality in US history. We will never forget you, Kelly. The civil trial for the cops is about to begin. Latest update here: @webpagelink/ Video by Truth Be Known."}]
