[{"comment_id":"10153502951211336","commenter_b":"Anyone who votes for her does not have a brain!","commenter_a":"She will be the next president","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153962696310950","commenter_b":"Seriously?? You are part of the problem! What she is wearing is irrelevant! She shouldn't have to wear a turtleneck to keep creeps from thinking they have free reign. Just because a woman wears sexy clothing it is not an open invitation. You still have to have permission period end of story!!!!","commenter_a":"She needs to get some self-dignity and wear something that covers her breasts.","post_message":"The soap star notably did not mention the GOP candidate in her statement."},{"comment_id":"10153160211535950","commenter_b":"No shame on you for not thinking outside the box, you are a ver naive women","commenter_a":"Why do people think that only adults can die of natural causes?? accusing them of covering something up is truly sick. Shame on you.","post_message":"YouTube star Caleb Logan of the Bratayley family died suddenly at age 13, his mother confirmed: 'This has come as a shock to all of us.'"},{"comment_id":"10153265498530047","commenter_b":"'@username over 5million LOL. Dead people and illegals","commenter_a":"SIGN THE PETITION / CLICK ON WEB SITE Justice Scalia one of the most brilliant and ardent defenders of the Constitution has just passed away. This is a huge, deeply felt loss. We must not forget that the next justice could impact the Court and the direction of our nation for decades. The American people deserve a voice in this decision: @webpagelink","post_message":"President Obama will stop at nothing to force his nominee for the U.S. Supreme Court through the Senate before his last year in office comes to an end.      But we can stop this from happening.  SIGN & SHARE our urgent petition to the U.S. Senate today: @webpagelink"},{"comment_id":"859150960886345","commenter_b":"You weren't forced to come either bitch!","commenter_a":"It kills me that someone who is not even from America can say such racist crap @username. Just remember or learn about the history of slavery and the continued discrimination today from immigrants like you who wasn't forced on a boat to come here. It's because of African Americans you have the freedoms you have today. Please don't comment on something you know nothing about and actually learn about the injustices African American people are facing today. You sound just like these ignorant people who always got something to say behind closed doors. I guess you wouldn't know about white supremacy because you've bought in to this bs white people have taught you in America. I guess all the killings by white police is something new. You have no idea what it's like to be black and to get even immigrants being racist towards you the same immigrants Martin Luther ...","post_message":"The Debt Collection Industry Is the Epitome of Systematic Racism"},{"comment_id":"10155571867589062","commenter_b":"She's a thug communist married to a drug pusher.","commenter_a":"She's a Texan so I can't say anything bad about a fellow Texas gal.","post_message":"Beyonce will be performing tonight at the CMA Awards. Do you think she was a good choice?"},{"comment_id":"10152950805022452","commenter_b":"Donald Trump should be proud that an 'Illegal Immigrant' did not win. We don't want them to take the jobs from the 'White' women! Next year they are going to have a new catagory called guess who is behind the sheets.","commenter_a":"Awesome","post_message":"Miss Oklahoma, Olivia Jordan, has won the 64th annual Miss USA contest. @webpagelink  This year's contest, held in Baton Rouge, Louisiana, had been largely overshadowed by comments made by pageant co-owner and real estate mogul Donald Trump while running for president."}]
