[{"comment_id":"10156889052280206","commenter_b":"if we really want to protect our country all we have to do is put up pictures of carly at the borders. that would scare anything.","commenter_a":"First is to end all illegal wars in the Middle East and stop supporting rebel groups with weapons which eventually end up in the hands of people who wish to harm the USA. We no longer need to rely on Middle East oil so there is no need for the US to be there.","post_message":"Q: What do we need to do to protect our homeland?   Get more answers at @webpagelink"},{"comment_id":"552487634912815","commenter_b":"Your racist dumb fool he's not understanding the concept on the purpose for building the wall","commenter_a":"your not going to stop drugs coming in with a wall, they have already proven that for the last 20 years. there are inventions like aero lights, tunnels, submarines. and boat. not to mention all the ways they catapult drugs over already. your all stupid for supporting this waist of tax payer money. not forgetting all the jobs they do that you office pussys wont and can't do because you have no back bone.","post_message":"Do you agree with Bill O'Reilly here?"},{"comment_id":"600892556733313","commenter_b":"She should put in jail with all Males and stay with them 24/7/365","commenter_a":"So not only he is a kid, he is also special needs. And on top of all of this, she is 71 among kids ????! The school should re think abt the age of teachers dealing with kids. In late 30s and a woman can hardly handle her own kids !!!! Shame","post_message":"71-year-old teacher Amelia Stripling was arrested and charged with 2nd degree cruelty to a child after knocking over a pre-K special needs student in Georgia.  @webpagelink"},{"comment_id":"10153361519746813","commenter_b":"That's the point. You said it yourself. Men have been using the men's room and women have been using the ladies room without an issue since forever without any problems. My point is that the law allows for men to use the ladies room and women to use the men's room, that is the basis of this law.","commenter_a":"I want to know why this is such a \"hateful\" law. The \"party of science\" is arguing against a law that basically says \"You know this restroom that's for boys/men? Only boys/men can use it. You know this bathroom that's for girls/women? It's only for girls/women\". So you think if women feel uncomfortable that a man that says \"Hey, I feel like a woman\" goes into a woman's locker room must hate LGBT people? Really? It's not the trans people I'm concerned about. It's the people POSING as trans people. Why should women be made to feel uncomfortable just so a man that thinks he's a woman can use the women's restroom/bathroom? Wanting people to use the bathroom of the sex they were BORN with (and actually STILL are, as science dictates) does NOT = hate.","post_message":"After nationwide outcry about North Carolina's harmful anti-LGBT law, Gov. McCrory said let's \"work on solutions that will make this bill better\" because NC is \"a state of inclusiveness, openness and diversity.\" Let’s make it clear - that means REPEAL HB2. Keep the pressure on. Add your name: @webpagelink"},{"comment_id":"10153018136071130","commenter_b":"I think ikea is a great test to the relationship for sure. I've gone with many friends who argue with their SO the whole time, who later break up... Whereas me and my bf of almost 10 years have gone together many times and have a blast","commenter_a":"Jacob opppsss","post_message":"Attention couples: this store will make you want to kill each other."},{"comment_id":"10156554094585615","commenter_b":"what an ass","commenter_a":"He's so wrong. I can judge him too.","post_message":"He calls declaring same-sex couples \"apostates\" just a \"policy disagreement.\" Meanwhile, LGBTQ kids are dying by suicide."},{"comment_id":"592518337598551","commenter_b":"Let's ban camel rapists","commenter_a":"No.","post_message":"NO!"}]
