[{"comment_id":"10153035284712434","commenter_b":"Go move to syria ...bitch","commenter_a":"It is inhuman to turn these people away. The terror experienced in Paris for one night is what they go through on a day to day basis and you want to send them away? Have some empathy, what if it was you and your child fleeing this barbarism? Turning them away is no better than away Jewish refugees during WW2 (see SS St. Louis). How anyone can see their suffering and simply ignore it or tell them to leave defies any and all tenants of a Christian faith, humanity, and what America stands for.","post_message":"How very Christian of them."},{"comment_id":"10153544457476509","commenter_b":"Thanks","commenter_a":"Why are animals doing what animals do all of a sudden national news?","post_message":"What a catch! Hear photographer John Bailey describe stumbling onto the powerful sight of a bobcat pulling a shark from the ocean: @webpagelink"},{"comment_id":"10154243663794160","commenter_b":"I bet he's caring a lot more women. As a woman, couldn't vote for Clinton. As a woman, she's an embarrassment to women.","commenter_a":"I pray, I pray, I pray","post_message":"Donald J. Trump is losing female voters."},{"comment_id":"10153852384658822","commenter_b":"Women wanted equal treatment in the military.. This makes them a little more equal. Be careful what you wish for you just might get it","commenter_a":"I had 3 sons and they all registered when they turned of age. I would have not wanted them to go but if I had a daughter which I don't I would not want her to be drafted and put in the position of getting captured. It is bad enough what they do to men when captured you can imagine what they would do to women before doing to them what they do to men. I do now have a grand daughter and a grandson. I hope neither of them ever have to go thru a war. I also hope everyone else's kids don't either.","post_message":"The Senate voted this week to require women to register for the draft.   What do you think of the change?"},{"comment_id":"714422425388653","commenter_b":"Get out of this country!!! The USA was great until you damn Devils Muslims started to come here!!!","commenter_a":"I don't care. Take that shit off. What do you have to hide. You want to wear it , wear it at home.","post_message":"She filmed it.   WATCH the video very closely..."},{"comment_id":"10152763354566051","commenter_b":"kill the bitch","commenter_a":"They need to wrap her head completely in duct tape !!","post_message":"When her fiance broke up with her, this woman decided to make his 3-year-old daughter pay."},{"comment_id":"10152765458922452","commenter_b":"What a beautiful woman!","commenter_a":"NoooooooooooH! Whhhhhhyyyyyyyyyyy!! 😢😣😧😩","post_message":"This is the last year that the original version of Kraft Mac & Cheese sold in the U.S. will contain artificial preservatives or synthetic colors. @webpagelink  In January, Kraft says its macaroni and cheese will be colored using paprika, annatto and turmeric."}]
