[{"comment_id":"1506151063011899","commenter_b":"REAL AMERICANS guns will only be taken over their dead bodies.","commenter_a":"Let's see, how many honest, law abiding gun owners, did not commit a crime with a gun, yesterday. Or ever, for that matter. If the government takes your guns, the next thing that they will take, is you.","post_message":"Exploiting tragedy while surrounded by ARMED guards. Hypocrisy much, Obama?"},{"comment_id":"10155299383400354","commenter_b":"Those of us who are legal US citizens in need can't get help yet we give those who are illegal help. When I fractured my neck in 3 places and shattered my leg all I got was 200 in food stamps. I was 55 and I lost everything. Stop giving this country away to those who disrespect with their very first action. Coming here illegally.","commenter_a":"They are giving them ids and other things so they can once again steal the presidency through illegals voteing. Get out and vote stop the craziness. Our president is in office illegally as he is not a US born citizen. So of course he is for illegals.","post_message":"NYC's New Illegal Alien ID Program Includes Free Membership to 33 Top NY Venues, Including the Metropolitan Museum of Art."},{"comment_id":"10153250160727235","commenter_b":"sue and angela, dumb bitchs","commenter_a":"I'm a gun owner and have a permit to carry. I'm also sick and tired of the gun nuts. There is absolutely no accountability on their part for the tens of thousands who die by guns every year. The NRA can kiss my ass also. Just a bunch of crazies and I'm sick of their crap. I also used to be a member. Time to grow up America and hold people accountable.","post_message":"What kind of people would be enraged because of a benefit for dead children? OH."},{"comment_id":"1125525780793011","commenter_b":"Sick people, and Michelle is out rapping with them, no class in the White House!","commenter_a":"YOUR a Dickhead! You should be arrested","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink Will Attorney General Loretta Lynch target this \"hate speech?\""},{"comment_id":"1027693250616162","commenter_b":"Suck","commenter_a":"@username 1mbps","post_message":"The technology is able to transmit up to 224 gigabits per SECOND."},{"comment_id":"1252245104845317","commenter_b":"So sad, the Hispanic ladies had more class then the racist. Also sad no one had the courage to stand up to her!!","commenter_a":"That's messed up. She forgot that U.S has the freedom of language","post_message":"This racist woman went off on two Hispanic shoppers with a racist rant and no one did anything to stop her. More on this story here: @webpagelink"},{"comment_id":"1033391136683934","commenter_b":"Dee I'm not a violent women, however I would love to bitch slap you. Sorry but I'm tired of idiots like Dee. Yes Dee it's called artificial insemination. I highly doubt anyone doing this would get an abortion.","commenter_a":"That MOTHER LOVING USED ASS WIPE thinks EVERYONE should WORSHI{_ HIS GODDESS, Ayn Rand, and that EVERYONE should be SELF-SUFFICIENT. Oh yeah, He is ADDICTED to TAXPAYER-FINANCED salary and TAXPAYER-FINSANCED health care. HIS ROTTEN KIDS would STARVE if he weren't a USELESS, WORTHLESS MOOCHEZR. Maybe HE would like to pay for all of the unwanted pregnancies.","post_message":"Did Speaker Ryan just go there on Planned Parenthood?"}]
