[{"comment_id":"10153532462028352","commenter_b":"And nobody in those stores were killed btw","commenter_a":"Use your brains people, this story isn't getting plastered all over the news because she's a good mother,AMERICA GETS OFF ON SEEING BLACK MEN GETTING ATTACKED.. And this is a perfect way to hide behind the actions of his mother. They love seeing black men being put in 'check' and being demeaned in public....AND Have you ever seen a black mother hit her son for enlisting in the military to fight some people that has no effect on the oppression of blacks in America ?","post_message":"‘I didn’t want him to be another Freddie Gray': America’s favorite mom speaks out after smacking masked son and dragging him from riot"},{"comment_id":"10154029353788352","commenter_b":"dont save these hoes","commenter_a":"Wow","post_message":"17-Year Marriage Ends in Three Dead When Wife Drops Husband Off to Catch Flight, But He Follows Her Instead – Catches Her Meeting Lover at Hotel: Husband Murders Man, Wife and Self"},{"comment_id":"10153153528689071","commenter_b":"You mean in the houses where tragedy still occurred, like drownings, accidental poisonings, falls etc? Not the sharpest tool in Lowes are ya?","commenter_a":"This sort of thing happens less often in houses without guns, but I'm sure that's just a strange coincidence.","post_message":"An awful tragedy happened in Chicago."},{"comment_id":"1167920019941418","commenter_b":"'@username and real men don't use emojis to other men over the Internet","commenter_a":"Donald trump used to endorse boxing a lot. That's why don king and Tyson support him. They actually know him instead of judging him based on the Internet and tv","post_message":"#DonKing is advocating for #DonaldTrump now! #WSHH"},{"comment_id":"951788561528283","commenter_b":"Sociopath with narcissistic delusions of grandeur, infantile anal expulsive ideology and penis envy. The bitch is a mess.","commenter_a":"Is he gonna cwy...poor widdle ting","post_message":"McTurtle can dish it out...but he sure can't take it. SHOCKING!"},{"comment_id":"10153950105412757","commenter_b":"Round them up and jail them. Find the illegals and deport them.","commenter_a":"Exterminate that vermin!","post_message":"Anti Trump showdown"},{"comment_id":"10154298251075098","commenter_b":"There's a reason why they're called filthy rich.","commenter_a":"This is so typical of corporate America. The C Level staff walk away with millions and everyone else has to suck it up.","post_message":"What a shock. Despite Trump's assertions that he was going to stand up for working people it turns out that Wall Street and Goldman Sachs are still running the show - and the Trump administration. Among many other billionaires in the Trump administration is Gary D. Cohn, the departing president of Goldman Sachs and Trump's new director of the National Economic Council. Upon leaving Goldman Sachs, Cohn just received an exit package of $285 million. Yes, $285 million.  And that's how the rigged economy and oligarchy works. The middle class of this country bailed out Goldman Sachs to the tune of over $800 billion. Goldman Sachs paid a $5 billion fine to the U.S. Treasury for illegal activity, as did virtually every other major bank. Meanwhile, no top Wall Street executive is prosecuted for criminal activity. Instead, the president of Goldman Sachs becomes the leading financial adviser to the President. And, to add insult to injury, Cohn and the Trump administration will soon end up supporting huge tax breaks for the rich while cutting Social Security, Medicare and Medicaid. Can we stop them? Yes. But only through a powerful and focused grassroots movement which tells Congress to represent us all, not just the 1 percent."}]
