[{"comment_id":"10152873861987434","commenter_b":"Shit for brains","commenter_a":"Since when did weed start smelling like fish?","post_message":"After pulling Charnesia Corley over for running a stop sign, two Houston deputies held her legs apart and forcibly administered a body cavity search in public—all because her arresting officer suspected she had weed."},{"comment_id":"10153742106021167","commenter_b":"The smartest bag of dicks!","commenter_a":"Wow you people are about as smart as a bag of dicks..","post_message":"Conservatives are now demanding the FBI director explain to them why their fantasy version of the email “scandal” doesn’t match his factual one."},{"comment_id":"1796700900563912","commenter_b":"Stupid lady!!","commenter_a":"People need to stop ... It was a choice ... No chances could be taken .... It's sad... But the choice had to be this 4yr old little boy","post_message":"Family of toddler who fell into the gorilla enclosure at the Cincinnati Zoo & Botanical Garden said their child is “doing well” and thanked zookeepers who fatally shot the gorilla."},{"comment_id":"10153610824739087","commenter_b":"So, I guess u rather lying, murderous Hillary to get the nomination.","commenter_a":"They don't have to support the nominee anymore than we have to! If Old butthole lips Trump gets the nomination you can bet I'll write my candidate in!","post_message":"“We have candidates who believe that they’re on the pathway to grabbing all the delegates for the nomination. Whether it’s posturing or whatever, I expect that they’ll eventually support the nominee,\" said RNC chairman Reince Priebus. \"We’ve always been able to come together before.”"},{"comment_id":"10154974435358812","commenter_b":"Russian Women For Trump ???","commenter_a":"Well rehearsed lol","post_message":""},{"comment_id":"10155132618144885","commenter_b":"@username CA would be in a lot less debt if they kept their own revenues. CA ranks as 46/50 in dependent states in the US. They give more than they get.","commenter_a":"What are these liberal agencies and locations going to do without Federal Funding? This is a direct threat from Trump. From what I've seen from him he keeps his word. Places like Chicago are going to be in a world of hurt without federal money.","post_message":"Chicago Public Schools has instructed its principals not to let federal immigration agents inside district buildings without a criminal warrant."},{"comment_id":"10154036323171337","commenter_b":"Rat face versus Moron","commenter_a":"Fuck Kanye. He's the biggest skank that ever was.","post_message":"WHOA! Did Taylor Swift just drop a whole lot of shade on Kanye West??"}]
