[{"comment_id":"530424503814796","commenter_b":"I'd be out of a job!","commenter_a":"what is illegal is letting ASS HOLE groups like the GAY patriot put their STUIPD SHIT on facebook they should be put in jail for life","post_message":"A popular company is forcing their employees to wear head scarfs.  This has to be illegal.  Would you quit if they tried to force you to wear a headscarf?"},{"comment_id":"10153532801498984","commenter_b":"put her in jail and let some women make her their bitch","commenter_a":"JUSTICE FOR ALL?????!!!!!!!!!","post_message":"The extremely disturbing video of a young girl brutally attacking a schoolmate who was holding a small child went viral, now the attacker is facing some serious consequences...  Are you hoping justice is served?"},{"comment_id":"10152758680722144","commenter_b":"Racist pigs","commenter_a":"What the hell are these people thinken DO THERE DUM ASSES KNOW THAT CHILD ABUSE","post_message":"WTF."},{"comment_id":"1419494658112647","commenter_b":"Show your junk to one of my babies and I promise you will sit to pee the rest of your sick life touch one and you will meet your maker and it won't be GOD","commenter_a":"You're one sick son of a b****","post_message":"CNN Believes That Little Girls Should Be Exposed To Male Genitals, Here The DISGUSTING Reason They Are Pushing This!"},{"comment_id":"10154739340963812","commenter_b":"HES STICKING TO BUILDING IT GOOD FOR YOU TRUMP BUILD THE WALL BUILD IT TALL","commenter_a":"Cause both of them know a wall isn't gonna happen, whether he wins or not!","post_message":"Donald J. Trump says that while he had a \"constructive\" meeting with the Mexican president, they \"didn't discuss\" who would pay for the border wall."},{"comment_id":"10154274349426051","commenter_b":"CAN I HELP AL , GET THE HELL OUT OF THE U, S, A, DUMB ASS","commenter_a":"He is ALL mouth--did anyone really think any of these ppl. were going to leave? WHO would want them?","post_message":"The Rev. Al Sharpton has finally decided if he'll leave the country now that Donald Trump is President."},{"comment_id":"1062536000443119","commenter_b":"White girls can't even right now.","commenter_a":"I went in to the Starbucks on Bay Area blvd across from baybrook mall,ready to buy coffee and a sandwich. They insisted on giving me everything \" on the house\" ! They were so kind and respectful to their customers. There was an outpouring of kindness from all who were in the store. The tip jar was full of large tips! They locked the doors right after I made my \"purchase\", but never once rushed me out of the door. This place is a class act!","post_message":"A computer outage is disrupting Starbucks sales in the U.S. and Canada, and its impacting a lot of people right here in Houston. KPRC2 Anoushah Rasta is following this story on #KPRC2 News at 10 p.m.  MORE ---> @webpagelink"}]
