[{"comment_id":"10156175309065231","commenter_b":"She lookin to get paid! I'm sorry ....she a hoe","commenter_a":"Voting democrat","post_message":"Pierson feels her new alliance with the Donald is \"perfect.\""},{"comment_id":"1015138285280684","commenter_b":"To the bone","commenter_a":"They cut his head","post_message":"Ron Mott said the four Chicago teens who kidnapped and tortured a mentally challenged young man weren't \"trying\" to be criminals."},{"comment_id":"10153107155889411","commenter_b":"Your mother is a terrorist","commenter_a":"Not all muslims are terorist but all terorists are muslim...","post_message":""},{"comment_id":"915235905266169","commenter_b":"Womanizer","commenter_a":"The hundreds of thousands of people, millions voting for Trump are not going to vote for any other GOP candidate. If this chick succeeds in unseating Trump, she might as well work for Hillary Clinton. When American voters votes no longer count, it's no longer America","post_message":"Kendal Unruh is trying to do what 16 Republican presidential candidates and at least three super PACs spending more than $20 million could not do: take down Trump."},{"comment_id":"1134794909920596","commenter_b":"He bitch ya breathe smells like shit I can prove it.","commenter_a":"Well thats what the little shit gets for fucking with a monkey","post_message":"Angry baboon throws poop in little girl's face! #WSHH"},{"comment_id":"1738373569725506","commenter_b":"Nasty bitch!","commenter_a":"Thief don't need to words","post_message":"This should be interesting....ClashDaily.com"},{"comment_id":"712619718886803","commenter_b":"At the risk of repeating myself, J. McCain turn your back on this blight you call a presidential candidate! You do a disservice to your party, your constituents, your military compatriots and most importantly your moral compass which should be leading you away from rather than to Trump.","commenter_a":"Trup will be lopplllllppp Cidgbelillnnrvrubrg","post_message":"He's mad as hell but is he gonna take it any more? -- Paddy"}]
