[{"comment_id":"927400923975122","commenter_b":"Lol. Kinda harder for a white person to flee the country. Try again. If your illegal then you are ILLEGAL. Their is no right about it.","commenter_a":"For all of you saying if the man who caused this accident was an \"illegal\" or \"undocumented\" man, what if the victims were illegal? Is that going to change how tragic and sad this is? Jeez, you would think the older the wiser but it seems to be the older the dumber and ignorant","post_message":"MCSO: \"ONE OF THE WORST DUI CRASHES WE'VE EVER INVESTIGATED.\" 5 A-M Sunday morning, Sheriff's deputies say 23 year old Cesar Villanueva, driving a white truck, slammed into the back of a Honda waiting at a stoplight in Avondale. The impact virtually destroyed the car. The young man and woman in the Honda were pronounced dead at the scene near Avondale Blvd. & MC 85. Detectives say Villanueva was speeding and was impaired. He is in custody. Details at 5."},{"comment_id":"1157609597663965","commenter_b":"Go Grab your mother's Pussy","commenter_a":"Dumb a$$ people - looking to start a war here on our home land - won't be happy until they do - hope they are truly ready for it - and hope they know what that will really mean.","post_message":"BREAKING: A massive protest of President-Elect Donald Trump is happening in downtown Chicago. It started outside the Trump Tower and is growing @webpagelink"},{"comment_id":"476652309189729","commenter_b":"donnnnt wanna hear it..cant stand her...","commenter_a":"Someone should us duck tape over her lips. She takes the cake for the most disgraceful women in the White House ever","post_message":""},{"comment_id":"10153176047249255","commenter_b":"His wife should also go to jail .","commenter_a":"Such a self proclaimed victim.","post_message":"This story gets crazier every hour."},{"comment_id":"1671482303102466","commenter_b":"I bet he dreams about it!","commenter_a":"Trump is a vulgar idiot yet Rubio is a hero? Seriously people, Trump didn't walk out on stage and say hey I got a big package. Rubio has insulted him for a week about this and Trump ended the insults. Rubio is the one that's vulgar and obsessed with Trumps Package.","post_message":"\"Did he just say that?!\""},{"comment_id":"891336577589705","commenter_b":"Americans, protect your selves!","commenter_a":"Thanks Obama","post_message":"Click to see these alarming new numbers..."},{"comment_id":"10154471352991337","commenter_b":"Lil girl","commenter_a":"Bitch I hope one of these hoes are next on the hit list of dead cops fuck the police bitch and if u don't like fuck u too hoe come get some bitch ass nigga I'm waiting for w a big ass weapon nigga find out what it is","post_message":"What happens in this video is not ok."}]
