[{"comment_id":"10152994930245671","commenter_b":"Because she knows she can get a pay day from the police.","commenter_a":"Her brain is definitely injured. She says she wanted the cops to back off, but if they hadn't been there she would be crying a different tune - saying they should have been there. She really thinks with all those guns and ammunition, that they would have just found there way home? They would have executed her.","post_message":"“My hopes for the whole thing were the cops would just back off, let these guys get where they needed to go, so me and Misty could find our way home somehow.\""},{"comment_id":"10152776711902014","commenter_b":"Swatting twitch users I bet!","commenter_a":"#rekt","post_message":"A 17-year-old teen from Surprise has been arrested for several \"swatting\" incidentsin which she reported fake shootings and bomb threats."},{"comment_id":"10153351373259614","commenter_b":"This woman wants to make decisions for you and for me.....","commenter_a":"Dummy","post_message":"A videotaped gaffe by Rep. Loretta Sanchez has sparked outrage among those who found the comment to be racially offensive. Sanchez, a candidate who wants to replace retiring Senator Barbara Boxer, was speaking at a California Democratic party convention event when she made a stereotypical Native American \"war cry.\" Referring to the difference between Indian Americans and Native Americans, the congresswoman tapped her hand to her mouth. Sanchez's main opponent, Attorney General Kamala Harris, was later asked for her reaction to the gesture. \"I don know what to say to that. That that that shocking,\" said Harris, whose mother is Indian. (Video courtesy of Uduak-Joe Ntuk) Read KTLA's story here: @webpagelink"},{"comment_id":"901335433248814","commenter_b":"It's time for YOU to answer AMERICA about BENGHAZI !! The four AMERICANS that lost their lives are on your clock and hands !!! It's time for YOU to answer AMERICA !! WHERE YOUR MILLIONS CAME FROM !! IT IS TIME FOR YOU TO TELL THE TRUTH ABOUT YOUR EMAIL CRIMES !! IT IS TIME FOR YOU TO ALLOW THIS COUNTRY TO BE MORAL AGAIN !!!","commenter_a":"If you are against he NRA, then you are for gun confiscation.","post_message":"“This has gone on too long and its time the entire country stand up against the NRA.”"},{"comment_id":"10152743535041973","commenter_b":"Women don't wreck things? You should've seen what my first wife did to the cable box!","commenter_a":"Sounds like teenagers at play.","post_message":"Eleven large boulders had been dug out of a steep bank below the trail and pushed down an embankment creating unstable soil, which is vulnerable to erosion from winter rains."},{"comment_id":"10154437348239087","commenter_b":"Crooked swamp dwellers. Lock them up!","commenter_a":"Let's run a government with a weakened opposition and lack of independent oversight. What could possibly go wrong?","post_message":"BREAKING: Republican lawmakers have decided not to strip the Office of Congressional Ethics of its independence following massive public backlash."},{"comment_id":"956349277815184","commenter_b":"To keep the bad guys out.....Tear down that wall and invite them in.","commenter_a":"This is why liberals suck, do as I say not as I do.","post_message":"ClashDaily.com"}]
