[{"comment_id":"10153464372430667","commenter_b":"Of COURSE you do, feminazi.","commenter_a":"Joe Biden didn't seem to give much credence to Anita Hill. Perhaps he could find a way to remove Clarence Thomas?","post_message":"Part of the pledge: To intervene in situations where consent has not or cannot be given."},{"comment_id":"10152847768557690","commenter_b":"How do you steal that many cattle without being noticed? Surely someone saw something","commenter_a":"Who let the cows out?!","post_message":"Officials are investigating how 1,121 cattle vanished from a Texas dairy facility >> @webpagelink"},{"comment_id":"10153846244313984","commenter_b":"Dumb bitch","commenter_a":"Well said Rubio!","post_message":"WOW. Out of all the things she could have been doing, or should have been doing - THIS is what she chooses. It's pretty unreal to think that some people actually want her to become the next POTUS... Do you think it's time for Hillary Clinton to drop out of the 2016 presidential race?"},{"comment_id":"1524641694504572","commenter_b":"@username Bernie wants you to suck off all the boys in Chicago so their bitches can have a night off","commenter_a":"All the protesters want the other candidates only one protester in question was for Trump and he was 87 and still willing to fight for what was right","post_message":"John Kasich is a _________."},{"comment_id":"538835082988240","commenter_b":"Yes it would 😂 cause you a hoe","commenter_a":"@username this is how we would be with Mr kitty 😂😂","post_message":"\"I pay puppy support...\""},{"comment_id":"404568359667759","commenter_b":"They all need to go somewhere else!","commenter_a":"what is wrong with the United States flag this is United States we have the right to fly our flag just like any other country","post_message":"Why do some people want to ban our flag?"},{"comment_id":"10154666136846833","commenter_b":"I'm thankful there isn't enough police to stop all crime! Because then we would be living in a police state!","commenter_a":"There is one more Woman who Had a gun to protect her Family, but a lot of Americans who will never be Able to protect there Family's for not owning a Gun. They live in a elusion of Safety that the Police have enough manpower to Protect them. Unfortunate there will never be enough Law enforce Officers to protect everyone. It is up to you to Protect yourself as much as possible.","post_message":"If three intruders break into your home and hold your spouse at gunpoint, what would you do? This Florida woman was faced with that dire scenario last week. Thankfully, she was able to run to the bedroom and grab her own firearm to end the ordeal and save her husband."}]
