[{"comment_id":"10153222530101167","commenter_b":"Ken, We still don't have all the emails she deleted several so we really don't have the entire story. But if we did get anything on Obama that would make Impeachment even better.","commenter_a":"They need to close down the Benghazi Committee and put those resources to the Hillary Email scandal.","post_message":"Stunning news: It's not just that Republicans are using the committee to launch partisan attacks on Hillary Clinton. The committee is also accused of illegally retaliating against an active duty investigator."},{"comment_id":"499065056962019","commenter_b":"I can't stand her. Send her back to India where her parents are from.","commenter_a":"We can't let the GOP pick and choose who they want in office. It is up to the voters! GOP take notice, heed our warning, because if this does happen, and Donald becomes and independent; there will be. Democrat elected!","post_message":"Now that she criticized him, will Donald Trump snuff out Gov. Haley's rising star?"},{"comment_id":"10157668685335389","commenter_b":"This woman is not!!","commenter_a":"I know women are going to hate me but if Hillary becomes president I can see why they didn't allow women to vote until the 1920s?.... women are overwhelmingly voting for Hillary over Trump this is how stupid most women are...MOST...not all... their kids and grandkids will be screwed for life","post_message":"Perspective."},{"comment_id":"10153100496946051","commenter_b":"i hope the fry his fat white ass","commenter_a":"He deserves life. He has destroyed that child's .Sending prayers for that little Man","post_message":"An 8-year-old boy was playing outside his apartment complex when this man showed up and shot him in the face. Decide for yourselves if the man's punishment was severe enough."},{"comment_id":"10154204294889778","commenter_b":"Then let her pay for it","commenter_a":"They need to get over it! Rename something of their own! Confederates were a part of history too! If this is the case, let's change every building's name that offends every confederate soldier's family too!!! I Have Had Enough of this - so crazy & ridiculous!!!","post_message":"Actress Julianne Moore and Hollywood producer Bruce Cohen want a new name for their old high school in Virginia, named for a Confederate general."},{"comment_id":"10154759698326509","commenter_b":"Then no sex allowed","commenter_a":"What if you're bulking","post_message":"You're human, so chances are, you're interested in getting more sleep, having better sex and improving your mood..."},{"comment_id":"1207705529241702","commenter_b":"'@username the majority of Americans correctly believe these people are nothing more than an a animal. They are correct","commenter_a":"Christian values are under attack. The moral fiber of our country.","post_message":"'The 'struggle for LGBT rights' in America is and has always been nothing more than a pretext for the complete disenfranchisement of Christians.'"}]
