[{"comment_id":"10153236305609342","commenter_b":"You have a brown child, she can easily be in the same boat!","commenter_a":"Hopefully her family can let her rest in peace and find a new cash cow to milk..","post_message":"JUST IN -- The 11-page report released Friday corroborates findings detailed a day earlier by Waller County officials. Warning: Some details are graphic."},{"comment_id":"10153543271535950","commenter_b":"If it said \"build a wall to keep the women in their place\" would you be offended?","commenter_a":"OMG get the crisis team there quick. It's a free speech wall that can only be used for their personal agendas and things they agree with . Poor pansies. Oh and make sure the crisis team comes with their prescription pad.","post_message":"The Ohio University wall has been an outlet for free speech for more than 40 years. But some students say the latest Donald J. Trump-related message went too far, and they decided to do something about it:"},{"comment_id":"649003498581759","commenter_b":"On a more humorous note.","commenter_a":"The republicans in congress have failed to do their job for 7 years ,but the stupid voters put them back.How do you explain this ?","post_message":"We can make major changes in Washington DC with our votes in November. Armed Democrats"},{"comment_id":"10153884149866130","commenter_b":"Its a joke you stupid bitches. Get over yaselfs.","commenter_a":"Ummm, kinda defeats the purpose of going out to the bar to get drunk if the bar is going to try and deter me from drinking. Wtf. Thats like my weed dealer explaining the importance of not smoking so I dont get cancer, smh. Dumb. Lol.","post_message":"One bar is getting patrons to think twice about drunk-driving by setting up a live-stream with a convicted felon."},{"comment_id":"1801596090092193","commenter_b":"Rot in jail bitches","commenter_a":"You mean to tell me. These people are so dumb that when they went out to do something this stupid. They didnt know anyone that would or could bail them out?.. That is pathetic","post_message":"Charlotte protesters want people's money for bail."},{"comment_id":"442004659257462","commenter_b":"Go home!","commenter_a":"The only thing that fat slob would bring to the White House is big-Big-Big Plate to feed his fat ass off of.","post_message":"Will Chris Christie's tough political style work in the White House?"},{"comment_id":"1115803781778734","commenter_b":"True, God's judgement may happen just like in Sodom and Gomorah,, Because guy marriage is wickedness,,,","commenter_a":"The rath of God, is not some thing, they want to play with.","post_message":""}]
