[{"comment_id":"1266627376716224","commenter_b":"No one has said no to immigration, just no to ILLEGAL immigration. And NO to ILLEGAL CRIMINAL immigrants! Wish you people would finally get it.","commenter_a":"white old man...","post_message":"As the son of an immigrant father who came to this country with no money and little education, I understand that our greatest strength is our diversity. We are a nation of people who have come here from every corner of the earth. We practice many religions. We are gay and straight. We are black, white, Latino, Asian American and Native American. Mr. Trump. Your job as president is to bring people together, not divide them up. Support comprehensive immigration reform, not mass deportation."},{"comment_id":"458683577589570","commenter_b":"Negotiations are not PC, you get what you can out of your adversary ! GO AMERICA, to hell with \"global niceties !","commenter_a":"The author is racist against Asians. Trump is not","post_message":"Donald Trump shows that he's not afraid of anyone, especially people from other countries that he does business with every day."},{"comment_id":"1487334004660057","commenter_b":"I'm sure my mom bragged about me when I was a teen thinking I was an innocent angel. Guess what? Girls are better at hiding it. I saw the video and see nothing wrong with it, she was wearing shorts, she moved her hips. I'm not a Obama fan but the girl is an adult and she's on her way to Harvard. There's bigger issues in the world than the presidents daughter dancing at a concert.","commenter_a":"I love all you people saying this is what a kid does. WRONG!!! Raise them right and raise the to respect their bodies and they don't do this. My daughter didn't do this crap. She was in the Sea Cadets and didn't do anything that would get her kicked out. She wanted a career in the military once she finishes college.","post_message":"Ohhhh boy..."},{"comment_id":"1454919074525438","commenter_b":"That horrid bitch belongs in prison period.","commenter_a":"Harold Alan,you hit that one right on the nail. Hitler and Mussolini that's the way he want to to Govern the United States Of America if elected.","post_message":""},{"comment_id":"10153921510965329","commenter_b":"lol i thought this was cute calm down woman","commenter_a":"Alison Wonderland when you tame the mane...","post_message":"can't stop watching this"},{"comment_id":"10153300662806491","commenter_b":"That is fair enough. I read a bit about the current government it is indeed incredibly corrupt and has generated a lot of hatred from the people due to actions which benefited only those in the inner circles. This however does not bode well, civil unrest of this scale does not end well.","commenter_a":"It is a horrible tragedy but it does not warrant for a cabinet to resign. I am confused at why the riots asked for the resignation rather then the changing of the laws.","post_message":"Prime Minister Victor Ponta and his Cabinet resigned Wednesday after mass protests."},{"comment_id":"914820658566958","commenter_b":"Let Syrian refugees move in with her! Let's see how she will put up.","commenter_a":"Idiot they always go straight to only thing they know gun control","post_message":"[AUDIO] Democrat Congresswoman Wants More Gun Control After Paris Attacks"}]
