[{"comment_id":"10154021550142377","commenter_b":"I see three women who should no longer be Senators!","commenter_a":"We have our own problems to solve. stop sticking your noses were they do not belong !! No other nation has made this kind of statement !!! $6Tril we spent and we have nothing except dead soldiers !!!","post_message":"Republican Sens. John McCain and Lindsey Graham have issued a blistering condemnation of the failure of the United States to act to prevent the slaughter of hundreds of thousands of people in Syria."},{"comment_id":"960686434063090","commenter_b":"Get her outta here!","commenter_a":"Take her off the air she is a bigot also joy you can see the hate in her face when President Trump is mentioned","post_message":"Whoopi Goldberg has been relentlessly gunning for Trump. He's had enough, and so has America. Should Whoopi Goldberg be kicked off TV forever?"},{"comment_id":"10153128335637377","commenter_b":"This has moved into the realm of pathetic and into hilariousness. Enjoy your bondage sir. Maybe try to forgive \"white\" America for its oppression and causing your \"struggle\" from 1960. Today, In this Great Country, Freedom is a choice, along with all its wonderful benefits. I beg you sir to chose it, its so much better than your aged and historical mind of past racisms and injustices. I look at your page and I see hate and division and lies, man and it saddens me. We're Americans and the media has us divided. I hate that. Its a new day bro, leave these young kids alone with your junk, let them grow up in a world without your racist wounds from the past. I shame you and the media for this junk. I have spoken my heart, this chain is closed for me","commenter_a":"You must know, this is not about equality, at its root its about domination from a revengeful spirit. There will be no end to this until they \"feel\" whites are subservient. This state has cowered to the media and social media pressures in lieu of implementing meaningful and lasting University policy changes of \"equality\". We should prepare for ....What and who is next?","post_message":"\"He just resigned for committing the crime of being a white male,\" Limbaugh said, calling it as \"a social justice warrior's story.\""},{"comment_id":"10153309975398128","commenter_b":"Rich girl with bad credit","commenter_a":"Let us all shed a tear for the rich girl...","post_message":"Even the daughter of the CEO of the largest U.S. mortgage lender found it hard to buy a home in one of the country’s hottest housing markets."},{"comment_id":"10153380386696130","commenter_b":"No, illegal immigrants do not commit 35% of murders in this county. Give me factual numbers.","commenter_a":"Everyone hating, yet he leads all polls.","post_message":"The rest of the media finally remembered that Donald J. Trump is entertainment, not politics! (We told ya so!)"},{"comment_id":"10154351189226051","commenter_b":"Lmao nope 😅","commenter_a":"Christine you didn't get this one did you! 😂","post_message":"When these parents took the doll out of the box, they were surprised at what they saw. Take a look for yourself and see if it's worthy of the controversy."},{"comment_id":"1318403084859330","commenter_b":"They wont be missed","commenter_a":"Awwww!","post_message":"There are some deaths that don't make us cry."}]
