[{"comment_id":"10150751541914999","commenter_b":"Racists get uncomfortable when a mirror is held up to their face! No problem with unarmed Black men and women being slaughtered on a daily basis in a country that prides itself on being the greatest nation on the face of the earth. I mean, even the United Nations thinks there's a problem. Go figure! And any attempt to prove otherwise just simply means you're racist!","commenter_a":"Wah wah. Shut up and do your job.","post_message":"The Miami police union say Beyoncé had aimed to “divide Americans by promoting the Black Panthers” during the Super Bowl 50 halftime show."},{"comment_id":"1793816267524585","commenter_b":"Amy you should be ashamed for trying to get people to vote for that criminal!!! The things she's going to do to our country aren't going to effect you because you have money !!!","commenter_a":"I'd be much more concerned if I voted for someone who was indited and convicted of high crimes against the United States and humanity!","post_message":"\"Your voting history is public record.\""},{"comment_id":"910749262351462","commenter_b":"SHE IS A BITCH.","commenter_a":"I'm going to have to block this site, even though I agree with it, almost all the time. This is stooping to the level of the opposition, mudslinging and negativity. Pretty ugly.","post_message":"Trump has won the hearts and \"minds\" of Tea Party Republicans, and he isn't afraid to take on the GOP establishment and party elite."},{"comment_id":"1362072713808008","commenter_b":"ROTFLMFAO!!! Opine from the woman actually wearing an \"A$$\" hat! You just CAN'T make this stuff up!","commenter_a":"The Judge is a lawyer for La Raza. He is literally a La Raza Grand Dragon.. He has literally helped many illegal immigrants break the law in this country. Donald Trump could go further and he didn't but when you start doing some digging this Judge doesn't seem like a very nice man. A lawyer for a group who has said many times to \"kill all white people\".. Okay.. Donald Trump could go further.. You may very well make him show his hand and there's a lot to show on this judge and the company he keeps. The ONLY racism here is of the judge and the people he represents. Imagine if the Judge was a KKK member presiding over a case that affected black men. You'd be outraged. You know you would. How is the Donald going to get a fair shake when the judge is soooo clearly biased ...","post_message":"By refusing to denounce Donald Trump’s attack on Judge Curiel for the racism it clearly connotes, it shows Senate Republican Leader Mitch McConnell is the poster boy for the Republican spinelessness that allowed Trump to be the Republican nominee for President of the United States.   Senator McConnell has so fully embraced Donald Trump that we are all unclear as to where Trump’s platform ends and Senate Republicans’ begins."},{"comment_id":"10153173280761491","commenter_b":"LMAO this is a joke!!!! Yea right, sure. And the first lady, Kim Kardash can show the sex tape she made in 2003 for company to the White House. This is what gave her fame and made her millions, Something she sure can be proud of and maybe even have her pres hubby pass a law that it be played in all public schools. LMAO","commenter_a":"Bernie Sanders","post_message":"It's still unclear if he's serious."},{"comment_id":"10153987601378908","commenter_b":"And another commenter who didn't read the article.","commenter_a":"And this is the article that should prove to all of you that collective evolution spreads bullshit ... Yellowstone has a big herd over 4000 bison .... And they are to slaughter 4-600 of them to prevent spread of disease !!!!!","post_message":"Park rangers have begun capturing wild bison in the Stephens Creek trap within Yellowstone National Park. Since Feb. 20, approximately 150 of America last wild buffalo have been trapped. According to park officials, all are destined for slaughter."},{"comment_id":"10154818490392235","commenter_b":"Last I checked deplorables 1 idiots 0","commenter_a":"I wonder why raw story didn't post anything about the black kids jumping the white guy because they thought he supported trump. Liberal logic the worlds cancer","post_message":"This video just is the latest in a series of white people justifying their obnoxious behavior and demanding special treatment because they voted for Trump."}]
