[{"comment_id":"10154153182021519","commenter_b":"The joke is going to be on the fools who think Trump is bringing their jobs back.","commenter_a":"... . : get uses to it, the next four years is going to be the Donald Trump Aion of the dead-letter-literal-interpretation Christian religious right fundamentalists. The poor rust-belt have-nots put Trump in office because of neoliberalism global economics And the religious right put Trump in the White House , because They want Supreme Court judges to turn back abortion and gay rights etc. . And neoliberal Wall Street buddy's of Trump will get what they want , deregulation for Wall Street and tax cuts. The right wing is in the candy store and everything is free . Like I said; the next political reality show startes after November. ~~~ ~","post_message":"Ted Cruz in the Supreme Court sounds like a nightmare."},{"comment_id":"913170958829660","commenter_b":"@username Now suck on that and go vote for that murderer her name is clinton.","commenter_a":"No i don't support ending it ,it is a aganist the law they should be lock up.","post_message":""},{"comment_id":"1344780435541174","commenter_b":"Yes For Hillary!!!!!!","commenter_a":"Vote Hillary","post_message":"Watch: Hallie Jackson gives a special preview of what's to come on #ElectionDay from NBC News HQ in New York! Full coverage all day: @webpagelink"},{"comment_id":"1368444483166524","commenter_b":"Best line of the day....Hillary: \"RELEASE YOUR TAX RETURNS.\" TRUMP: \"I EMAILED THEM TO YOU.\" HAHAHAHAHA","commenter_a":"One reason I support Trump is not because he knows everything, but because I agree with his position on most things. I like his energy and desire to solve problems, and he seems to be willing to change when something isn't working..unlike most politicians who refuse to admit when they're wrong. However, (and this is an example) when Hillary says he doesn't believe in climate change, he needs to back up his position with facts on why. Sure she can say scientists believe in it..well not all of them do. Trump needs to bring up scientists that don't support that theory. Also I would like to see him release his taxes, so she can't bring it up anymore.","post_message":"'CNBC, Time magazine online polls say Donald Trump won the first presidential debate' via The Washington Times."},{"comment_id":"1602329080072552","commenter_b":"Didn't he say \"it's easy for us to be around this everyday. It's hard for them to adjust after coming back from war\".","commenter_a":"Vote for Hillary...to finish the job on America that Obama started....","post_message":"Trump's message to veterans with PTSD isn't just wrong. It's dangerous. - Jon Comulada"},{"comment_id":"704402909750287","commenter_b":"1st lady my ass","commenter_a":"She destroyed the school lunch program. Absolutely destroyed it...","post_message":"Michelle Obama gets blind sided with this devastating blow, it's over. No one cares about her. She is a disgrace. Are you tired of hearing about Michelle Obama?"},{"comment_id":"10155209080925652","commenter_b":"mast! :D","commenter_a":"Ashay Gangwar @username check this out!","post_message":"These maps offer the most enjoyable route, not the fastest:"}]
