[{"comment_id":"10153800106900530","commenter_b":"No respect for life anymore. Started with free abortions pushed by Democrats. The liberal attitude that a baby in the womb is not life has created this pervasive attitude that life means nothing no matter what the age.","commenter_a":"put his ass in jail he dont respect life","post_message":"Police say the driver tweeted a photo of the 16-year-old victim's body and wrote \"I jus killed a man.\""},{"comment_id":"10152993022307217","commenter_b":"We really don't like immigrants here. Go back to your country, HitchBOT! Stop stealing American jobs that nobody wants.","commenter_a":"I'm very sorry it happened. I wish we could have done a well as everyone else. It would have been awesome if we could have sent to Australia.","post_message":"HitchBOT crosses Europe and Canada but is smashed to pieces in the US"},{"comment_id":"937487649627809","commenter_b":"NO, NO, NO. Why is there even a question about this. Too many illegals in this country already. Do you want more?????","commenter_a":"Everytime I think I hear the dumbest thing ever, something else trumps it. I cant believe how unpatriotic some folks are now days. America is for Americans. Become an American and then you can vote. No intelegent group would ever let an outsider make a decision for them. It doesent make sense.","post_message":"More than 1 in 3 Americans believes illegal aliens should have the right to vote in U.S. elections, a figure buoyed by the majority of Democratic voters who favor the idea. @webpagelink"},{"comment_id":"10154075360053797","commenter_b":"You know her personal","commenter_a":"Wow look at all these people who would vote for a liar to run this country. What an uneducated bunch.go clear back to Watergate with hillary she is a liar.","post_message":"WOW! Rest in Peace Elaine. She was a registered Democrat and not \"a political person.\" However, her obituary says: \"Elaine requests, in lieu of flowers, please do not vote for Hillary Clinton.\" Her reason is getting a lot of attention. See here:"},{"comment_id":"10153324817246523","commenter_b":"And this is only the beginning of another year in Wisconsin.","commenter_a":"Oh people quit ur whining an complaining! It's sickening! It SNOWS every year, this is nothing new!!! Blah, blah, blah!!!","post_message":"NEW: We're been upgraded to a winter storm WARNING in southeast Wisconsin."},{"comment_id":"10153235422567994","commenter_b":"Hahahaha mathieu blocked me awe","commenter_a":"Who are these people with nothing better to do than just constantly complain about everything being racist? My God shut up.","post_message":"It's a bank robbery for Skittles. Is it a student video gone wrong?"},{"comment_id":"10153484016796519","commenter_b":"Illegal aliens... is not racist. No mention of race... just ILLEGAL.","commenter_a":"Funny but kind of hypocritical on SNL's part since they gave him legitimacy not that long ago even after he had said racist things.","post_message":"SNL hilariously scorched Donald Trump's supporters last night...."}]
