[{"comment_id":"10153882688775736","commenter_b":"Freedom of speech!!! Gotta love it!","commenter_a":"Performers are there to perform, and that's all we're paying for. I believe an audience member sharing their political views during a performance stands a good chance of being asked to leave. Why is it ok for them?","post_message":"A cast member responded to Trump's tweet, 'Conversation is not harassment sir. And I appreciate Mike Pence for stopping to listen.'"},{"comment_id":"10153227586230047","commenter_b":"He did the right thing","commenter_a":"No","post_message":"While serving overseas, Sergeant Martland intervened to protect a child from sexual abuse.  He deserves to be honored for this heroic action, not punished.     Sign and Share our petition to fully reinstate Sergeant Martland: @webpagelink"},{"comment_id":"10155131143925389","commenter_b":"Can't deport an American born stupid","commenter_a":"In a Court of law your reporting would be ' hear say ' Sean","post_message":"One of the two brothers suspected of gunning down 12 people in Wednesday’s attack in Paris traveled to Yemen in 2011, where he was in touch with Al Qaeda training camp leaders, U.S. officials told Fox News."},{"comment_id":"1222586881085915","commenter_b":"I can't believe a woman would even consider voting for Trump unless they are Transgender.","commenter_a":"It's pretty obvious that TRUMP will be President --- and I can't wait -- Hillary would be a disaster ---No one can say that TRUMP would be worse than Obama or Hillary --- Remember don't listen to polls or media -- they are just media bias--- TRUMP TRAIN all the way to DC ---- Don't forget to VOTE in the remaining Primaries","post_message":"An honor to receive the support from golfing legend, Jack Nicklaus. I will defeat Crooked Hillary Clinton in November, and we will MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"1742501459315047","commenter_b":"SORRY HILLARY IS PRISON BOUND.MAYBE YOU CAN WRITE HER.","commenter_a":"Just like she took care of the Benghazi situation?","post_message":"'I’m afraid because these motherf—kers are coming for us, y’all.”"},{"comment_id":"1787231111544405","commenter_b":"She was sucking the hell out that dick! Stephanie Nicole Goad lmfao","commenter_a":"Macie Knisley @username lol ummmm #Merica lol","post_message":"This Veterans Day party gives free tattoos, haircuts and blowjobs to veterans..."},{"comment_id":"10153935292307434","commenter_b":"Shay shut the fuck up","commenter_a":"'Transgendered' sooooo 2013. BOOOORRRING No one cares. We get it, you're edgy. Zzzzzzzzz","post_message":"'Trans women are not only sex objects or prostitutes,' said Amiyah Scott, explaining her departure from the show."}]
