[{"comment_id":"10153541850619712","commenter_b":"It's Bush's fault, and you're a Racist. Let's audit the EBT accounts of people to ensure that they are not out selling 2 for 1 groceries, to get their Malt Liquor and Newport's. There is no Free Ride, you Generational Welfare Leeches. Some people shouldn't Breed!","commenter_a":"that what they do","post_message":"Despite calls for his ouster after making controversial comments about lead poisoning, Gov. Larry Hogan's housing secretary will keep his job."},{"comment_id":"10153800001886336","commenter_b":"OK all immigrants should loose there language and culture. Derp","commenter_a":"Gop crybabys don't ask me questions the Fox news debate asked basically the same questions does Reince Priebus realize that was the only gop debate to be simulcast on a Spanish network effectively telling Spanish Americans we don't care about you","post_message":"Reince Priebus  told Fox News that aside from making sure “CNBC isn’t hosting and moderating another debate with our candidates,” the Republican Party is going to review “everything” about the debates. @webpagelink"},{"comment_id":"10155223291794218","commenter_b":"Hillary didn't get elected. You're a victim of liberal ideology and the dumbing down of society.","commenter_a":"Section 212(f) of the immigration and nationality act of 1952 states: whenever the president finds that the entry of any aliens or of any class of aliens into the united states would be detrimental to the interests of the united states, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or non immigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate. Any questions?","post_message":"The Department of Homeland Security says it will comply with federal orders not to deport detained travelers"},{"comment_id":"538972829636804","commenter_b":"Stupid lady","commenter_a":"I don't anything about this conflict, and it seems like this woman is being pretty rude. However, it is also true that anyone living in this country should be speaking English in their public lives.","post_message":"\"Speak English, b****. It's America. Put me on YouTube.\"  What starts as an argument over a dog quickly escalates into a vicious tirade about language, nationality and entitlements. Now this parking lot rant, seen by millions, is quickly going viral. Why it's touching such a nerve. @webpagelink"},{"comment_id":"494457030748305","commenter_b":"Bitch u should forgive me","commenter_a":"@username hope u forgive me","post_message":""},{"comment_id":"1126925213993897","commenter_b":"Woman*","commenter_a":"Women?","post_message":"This woman was found dead in a shopping cart -- and police have started a murder investigation. >> kiro.tv/BodyInvestigation"},{"comment_id":"959204997435717","commenter_b":"Well.... sometimes women are raped...","commenter_a":"Will this decision really stand? Don't get my hopes up.... Can it be vetoed? Will it stand? (I hope it stands but We the people have been asking them to defund PP for a long time and they haven't listened!)","post_message":"This Congress and its relevant committees must complete a thorough investigation of the disturbing accusations evidenced in the Planned Parenthood videos before another taxpayer dollar goes to this controversial organization. These funds can be better used providing legitimate health services for women in places like North Dakota"}]
