[{"comment_id":"10153178614619342","commenter_b":"This dude doesn't even capitalize TEXAS or GOD and y'all comment on this???Surely the fear of God sounds so Christian???? LOVE IS LOVE END OF STORY!!!","commenter_a":"texas is a god fearing state.we will not compromise on our faith","post_message":"JUST IN: Texas Attorney General Ken Paxton calls the Supreme Court decision giving same-sex couples the right to marry a \"lawless ruling\" and says state workers can cite their religious objections in denying marriage licenses. STORY --> @webpagelink"},{"comment_id":"710565325800712","commenter_b":"Get out","commenter_a":"Just what? About this woman isn't alarming?","post_message":"Muslim picks fight with patriotic cashier, and then this happened. If you don't like our country's flag, you don't have to live here. Can we get 75,000 'LIKES' for this patriot?"},{"comment_id":"10153157386338984","commenter_b":"MUSLIM ASSHOLES","commenter_a":"@username:(. Not all blacks are Freeloaders. You are being Racist I hope you don't teach that to your Grandchildren's. What about the Bushes when they were in WH and they traveled around the world,that was ok right. And you Republican want another fucking Bush in office.","post_message":"Outrageous. This makes my stomach churn. I think we should make HIM pay up... Do you think Obama should be impeached?"},{"comment_id":"1113246462026036","commenter_b":"I love being a princess. As you can see from time line Imma pussy","commenter_a":"She uses the same playbook as the very people she supposedly hates. Yet the morons line up behind her, rank and file. 'Murica.","post_message":""},{"comment_id":"822097871159007","commenter_b":"Take it from a feminist, there is no wage gap. @webpagelink","commenter_a":"All wonderful.... now let's see if we can make \"being paid like a girl\" equivalent to being paid like a man!","post_message":"Maybe it's not a bad thing... (h/t United Humanists) Do you consider yourself a feminist? Let us know: @webpagelink"},{"comment_id":"10154512310684726","commenter_b":"her face looks like a duck.","commenter_a":"Liar","post_message":"Tammy Duckworth says they’re all orphans and widows because the men are 'all dead.'"},{"comment_id":"874917705876659","commenter_b":"people need guns to protect them selves from this sort of scum. is this copper stil walking?","commenter_a":"I smell a wrongful death suit with a nice pay out cooking","post_message":"This is CRAZY! A unarmed boy's last moments were caught on bodycam, just before he was SHOT & KILLED by a TRIGGER HAPPY COP! Of course the cop will not be charged for any crimes. Blood boiling VIDEO: @webpagelink"}]
