[{"comment_id":"384727298550424","commenter_b":"So twisted. Islam has been illegal here since 1952","commenter_a":"Not my pOtus not my kkk","post_message":"LIVE VIDEO: 'Not My Presidents Day' anti-Donald J. Trump protests are happening across the country.  WARNING: Viewer discretion is advised"},{"comment_id":"10153478726962293","commenter_b":"Women don't drink beer?","commenter_a":"Cool, can they make beer tax free to even the score??","post_message":"\"Basically we are being taxed for being women.\""},{"comment_id":"1370428343050216","commenter_b":"Keep this animal in jail","commenter_a":"These two idiots actually represent the sick mentality of the republican party. They are both sick and depraved. What I really find interesting is how much american men admire that behavior and vote for them. They seem to have a lot in common with these two.","post_message":"SPREAD HIS SHAME."},{"comment_id":"1269427259813296","commenter_b":"SOME OF YOU IMBECILES SICKEN ME WITH YOUR OPEN MINDEDNESS TO ALLOW MORE REFUGEES AND WHICH ARE TERRORISTS COME INTO THIS COUNTRY!! WAKE UP UNLESS YOU WANT TO BECOME ENSLAVED TO THE RELIGION OF ISLAM AND LOSE ALL YOUR FREEDOM ,BE BEATEN,BE RAPED ,BE BEHEADED..ETC...ETC...THERE'S NO PLACE IN THIS GREAT COUNTRY FOR YOU UNTIL CHRIST'S RETURN,THEN SHALL YOUR FATE BE DELIVERED AND ETERNAL HELL AND DAMNATION WILL BE UPON YOURSELVES,NOT 72,000 VIRGINS AS YOU THINK !! THE ONLY VIRGINS YOU RECEIVE ARE THE INNOCENT LITTLE GIRLS 6,7,8,9,10 YEARS OLD THAT YOU ARE RAPING AND DESERVE DEATH TO YOURSELVES FOR!!","commenter_a":"STFU he said he does not reveal plan! STFU","post_message":"Broken campaign promise!"},{"comment_id":"1310724188980341","commenter_b":"This woman has nothing better to do.","commenter_a":"idiot","post_message":"Hey, stop \"appropriating\" our language..."},{"comment_id":"984113211608432","commenter_b":"Why are girls doing this! It's so ugly!","commenter_a":"Elle Paiva-Wilson","post_message":"In a dangerous new beauty ritual, teens are sucking on shot glasses to pump their lips, then posting photos of the disastrous results on social media. >>@webpagelink"},{"comment_id":"1517317031907717","commenter_b":"Lol! I know right! Hate that woman! This,Chicana is for #trump2016 !!","commenter_a":"The most satisfying thing in the world to see, EVER, is watching Megyn Kelly say Trump wins!!!!!!!","post_message":"BREAKING: Initial reports indicate Donald Trump has won the Republican primary in South Carolina. Let's take a poll of our own...would you like to see Trump as the next US president?"}]
