[{"comment_id":"1257260354293992","commenter_b":"You are illegal go away","commenter_a":"Oh yeah more guns to START shooting over the least thing or person ASSumed to be Muslim....................","post_message":"\"If more good people had concealed carry permits then we could end those Muslims before they walked in killing,\" Jerry Falwell Jr. said Friday."},{"comment_id":"10152729868175667","commenter_b":"Oh calm yer tits..it's just fun","commenter_a":"I may stop following USA Today because of this specific post. The guy isn't even old enough to run and you're reporting it like its important, which just means you made a joke out of yourself.","post_message":"President Flame would be a pretty epic name. Just saying."},{"comment_id":"10154400820486051","commenter_b":"@username Suck it up Buttercup, it's the middle class that pays the taxes that all you losers live on. President Trump has done more, so far than Obama has done in 8 years. Oh I forgot he (BHO) has flooded America with illegals that are: murderers, rapist and child molestersl. The best thing that can happen for the USA is the Big One hit and take California with it.","commenter_a":"Rock on Rosie! Trump is scum! All these despicable people supporting him would make america great again by leaving. They are what is wrong with our country.","post_message":"Rosie O'Donnell just made a very controversial accusation against Donald Trump."},{"comment_id":"1065254780239751","commenter_b":"Yes he did !!!","commenter_a":"Good idea. Take questions submitted by the public and picked randomly. Put each at a table with a mic. Turn off the mic when two minutes is up.","post_message":"It wasn’t pretty. More like a street fight than boxing, but Trump fearlessly took the game straight to Hillary and made the next 30 days about her repeated lies and corruption and not his disgusting comments of 11 years ago. He often reminded people why he won the primaries by unapologetically hitting at failed policies of the elites and establishment from both parties. Trump needed to show contrast and he did. He is more a chain saw than a scalpel, but his cuts drew blood. And it’s time to get rid of the so-called moderators. Get a big clock and let the candidates go to the stage and take turns and get rid of the media personalities who want to debate the candidates. My advice to “moderators?” If you want to debate, become a candidate. Trump won the debate. That much I know."},{"comment_id":"10158232325655646","commenter_b":"Didn't one of those illegals walk back in and rape and murder a woman whose husband was a official of the government...This should not be able to happen in this country.","commenter_a":"Surprisingly enough nobody see's the resemblance to how the Jews were being taken during one of the Schutzstaffel's (S.S.) \"routine sweeps\" History Repeats itself my friends! We let it happen!","post_message":"Immigration and Customs Enforcement officials have yet to release details on how many people agents arrested Thursday, but advocates say more than 100 immigrants were taken into custody as ICE conducted home raids in Santa Paula, Oxnard, Van Nuys, Downey and San Bernardino. Those detained were either illegal immigrants with deportation orders but no criminal background, or family members of those sought who were home during the raids and told officials they lacked documentation, according to the Coalition for Humane Immigrant Rights of Los Angeles."},{"comment_id":"1025668424151460","commenter_b":"Again son, go fuck yourself, you're nothing but a useless troll :) you understand that, right?","commenter_a":"Hum... hopefully the US and Russia will agree in sharing intels, would be a shame if US troops got bombed by Russia because the US didn't want to tell them where they troops were...","post_message":"Just remember, folks… this is all about ISIS, the big bad boogeyman in the black pajamas, and has nothing to do with Assad's rebound or the influx of Russian special forces troops into Syria. ~Will"},{"comment_id":"10152956267682061","commenter_b":"Congratulations, Ginger!!! We love you in Atlanta!","commenter_a":"Congrats","post_message":"Ginger Zee is pregnant and we couldn't be any more thrilled for her! Same with Lara and Amy Robach! @webpagelink"}]
