[{"comment_id":"10156625671370354","commenter_b":"Dork....","commenter_a":"He's a black man who don't no shit about running a country","post_message":"“I’m a black man who sometime wears his hat on backwards,” Obama said. And the rest is, well, you'll see..."},{"comment_id":"1037567749698799","commenter_b":"Facebook is trying to silence him tonite","commenter_a":"Completely cut off","post_message":"Watch Live: Donald J. Trump holds a rally in Sterling Heights, Michigan."},{"comment_id":"10152957950051051","commenter_b":"You know yall need too look back in historey books .do yall remember this wasn't the first flag made back then.","commenter_a":"That's right keep it up","post_message":"This man doesn't care what anyone says – he refuses to take down the decorations on his yard."},{"comment_id":"10155333457725354","commenter_b":"Besides all this...Clinton looks like she needs a facelift! She definitely has not aged well. With all the worries she's had I can see why she looks like this...","commenter_a":"No integrity","post_message":"MELTDOWN: Hillary's Disastrous Press Conference..."},{"comment_id":"10154187252849657","commenter_b":"You are a very, very, very silly little women with no wisdom at all, and I doubt you ever had any. You are to old to think the way you do with lousy liberal logic.","commenter_a":"What I do understand is this, man is supposed to be smarter now than then, but yet the present man cannot product a document like the constitution. Isn't it sad that they are trying to destroy it because man cannot write a constitution now. The reason they can't is because they are not GOD fearing, like the founding fathers were.","post_message":""},{"comment_id":"10153396685831320","commenter_b":"Time to keep the animals out of Mc Donalds!!","commenter_a":"Also known as Black Brooklyn Beatdown!","post_message":"It happened again! A mob of teens take part in a nasty brawl inside a Brooklyn McDonald's. Watch the video here: @webpagelink"},{"comment_id":"10155489129664657","commenter_b":"Not with a Republican Senate she isn't!","commenter_a":"as soon as these two women are no longer useful they will be out, they are pawns.","post_message":"Uh oh."}]
