[{"comment_id":"1480804778605937","commenter_b":"FEAR-MONGERING ULTRA-RIGHT FASCISTS!","commenter_a":"Well, there's this...@webpagelink","post_message":"Washington State Republican Party chair Susan Hutchison​ is holding a news conference after the Washington state attorney general announced a lawsuit against President Donald Trump over the immigration executive order. >> kiro.tv/WASuesTrump"},{"comment_id":"10152943603067217","commenter_b":"Mosks should be destroyed first","commenter_a":"The earthquakes should destroy only churches.","post_message":"New Zealand's Christchurch was struck by a devastating earthquake in 2011"},{"comment_id":"10153620766011337","commenter_b":"I would only wish there were black only sororities, but no, whites are free to join and pollute the heritage","commenter_a":"So I'm just asking. On campus at Grambling University pretty sure there are ALL BLACK sorority houses. Why no uproar over that ?;","post_message":"RACIALLY INSENSITIVE? This Alabama sorority video had to be deleted after a diversity backlash.  Watch it and judge for yourself..."},{"comment_id":"10153898357108984","commenter_b":"@username - there is a huge difference between then and now regarding \"camps\" and rounding up people; if the refugees were peaceful, they have proven otherwise, but if they were- they would not be in \"camps'- we didn't round up the illegals and place them in camps- the only reason they would be in camps now: time to be thoroughly vetted before allowing them among the citizens in America. Reasonable- yes.","commenter_a":"It seems as though the Founding Fathers knew something like this could happen, and in the Constitution under the 9th, and 10th Amendments gave each State the right to Sovereignty. State's that \"believe\" in the Constitution should be able to break away from those that want excessive government control, and socialism! the de-centralization of power is essential to the preservation of \"Freedom\", Washington has no more right to control us than London does. There is a reason we are defined as \"States\", and not Provinces. we are sovereign state with our own constitutions. Our union was formed as an agreement between the States. Texas itself made it part of the agreement to join the union that they could leave at anytime. America was founded as a Confederation. Abraham Lincoln destroyed our states rights. I can assure you that Washington will not hold us together by force should we choose to ...","post_message":"One state is taking the refugee crisis seriously, and they're now making a huge move to send in the National Guard.  Obama may be able to bully other states, but this one's not having any of it.  Time for the rest of the states to follow their lead!"},{"comment_id":"1043008155755713","commenter_b":"To prison. Oh that's right she is above she law.","commenter_a":"It wasn't a vacation it was a paid leave of absence. Hello Obama is any body home? You work for us just like Hillary. O yeah she doesn't do anything but lie.","post_message":"Tonight is the biggest fundraising deadline yet of this campaign. It isn’t about money, budgets, or even what our competitor might raise. It’s about you and me, working together to protect and build on President Obama’s progress—making sure our country is strong, safe, and fair. If you're with me, chip in $1 right now: hrc.io/1NXINOf -H"},{"comment_id":"10153898443761770","commenter_b":"In GOD we TRUST....Vote for Trump/Pence 2016..Hillary hate guns because dangerous to the toddlers!!! But In the GOD's name why she's ok to rip out the unborn 9 months in the womb...and Hillary sharing our national classify to others and exchange to pay her ...GOD bless American people to support Trump... because only Trump/Pence can stop government corrupt, bring job, boom the economy, protect our family and help veterans, military and make America safe and great again... that Hillary been extremely careless to protect our national security....and Trump will stop Hillary accepting money from foreign country that treat LGBTQ and women like animal... and Hillary call all my Africa-American friends \"SUPER PREDATOR \" and insulting all my Latinos & Latinas \"NEEDY & BOWL of TACO\"","commenter_a":"Who gives a damn","post_message":"Nate Schmidt of the Washington Capitals sits down with David Hookstead to talk about life as an NHL player."},{"comment_id":"1089539017791300","commenter_b":"Hillary belongs in jail! Do your job Congress.","commenter_a":"I would think about why she dosen't answer the question","post_message":"This state rep took a huge stand against Hillary and even called her out at one of her rallies.  But the rep had no idea what she had gotten herself into.  Now she says she carries a gun because of what Hillary's goons have done to her."}]
