[{"comment_id":"921974804515254","commenter_b":"my favorite teacher was/is Mrs Cathy Zavacky-Barrek. She was my kindergarten teacher and I was a cry baby.she always made me feel comfortable and loved away from my mommy....The sweetest teacher ever, nice, loving, but also had control of her class...","commenter_a":"My favorite teacher was in 6th grade. He believed in me when I felt like no one else did- may he rest in peace. My favorite college professor (also my academic advisor) helped guide me along the path I needed to be the first in my immediate family to get a Bachelor's degree (thank you for that Bob)","post_message":"What stories do you have about YOUR favorite teacher?! #NationalTeacherAppreciationDay"},{"comment_id":"1263312547023087","commenter_b":"James Walters watch it","commenter_a":"I feel deceived. I thought he was going to explain the theory briefly with the popcorn.","post_message":"It's the 100th anniversary of Einstein's theory of relativity this year. Here's an explanation so good, it won $400,000"},{"comment_id":"1043787832310738","commenter_b":"So she cooks for him he does not eat rigjt away he showers then she but instead of making a plate of cooked food he decides to cook something different and its her fault.no he just know he can take advantage.nothibg wrong fixing a plate but he was petty.its childish","commenter_a":"This lady has time to waste, why is she asking the internet for advice when she could simply have a conversation with her man about this habit or preference. if she has an issue with making him a plate, then she should make it known..........geesh, communicate with the man instead asking us for our opinions since we do not know the whole story.","post_message":"Are his legs broken?! Anywho, what should this woman do?"},{"comment_id":"10153495840691051","commenter_b":"Then don't post it online and she should mind her own business.","commenter_a":"People should also mind their own business","post_message":"This woman says her child *isn't* too old to be breastfed. Decide for yourselves if that's true."},{"comment_id":"10153127976631162","commenter_b":"You sound ignorant you stupid old lady","commenter_a":"A 3, 2, year old and she is 8 months pg. give her birth control.","post_message":"TODDLER SHOOTS PARENTS: A 3-year-old boy shot his dad and his 8-months-pregnant mom when he found a loaded handgun in her purse while looking for an iPod. READ MORE: @webpagelink"},{"comment_id":"10153804113241770","commenter_b":"Wasn't it Hillary yesterday stating that she has always been in favor of strong vetting of refugees? Obviously she sees which way the wind is blowing on that issue, so she's trying to get onboard. Wish she and Obama had been in favor of that when they started letting this evil, diseased crap into the country by the tens of thousands.","commenter_a":"I've always been amused at the people who say you shouldn't profile. But EVERYONE does it on a daily basis. That's a bit of reality for you... Yes to profiling, more stop and frisk.","post_message":"Republican presidential nominee Donald Trump called for profiling techniques to combat U.S. domestic terrorism threats during an appearance on Fox News Monday."},{"comment_id":"1765463453479427","commenter_b":"Tell that to these women. @webpagelink","commenter_a":"Hey! if their good their good why not if that's what they want to do! and pass all the ground's for being able to handle it!","post_message":""}]
