[{"comment_id":"1144542405568548","commenter_b":"@username bull","commenter_a":"Hilary should start a new centrist party for disenfranchised republicans, and the DNC should back Bernie. He stands for unions, while she slept thru Walmart union negotiations and stayed mute. He marched and protested for civil liberties while she was a Goldwater Girl. And the Clintons made shady insider trading deals with Tyson way back in the day to kick start their career. The only thing that makes her a democrat is her stance on women's issues. When it comes to war, trade agreements, corporate welfare, and dark money, she's a republican.","post_message":"\"That's what the American people are saying.\""},{"comment_id":"1231862310212247","commenter_b":"We better get building that wall","commenter_a":"This will be interesting. Will President Trump undo what Obama did to lift sanctions and travel restrictions to Cuba?","post_message":"Live Look: Celebrations in Miami over the death of Fidel Castro, and images from Cuba."},{"comment_id":"10154331830756028","commenter_b":"They both need to be put in population in prison and let be what needs to be done to these two monsters they didn't protect that beautiful innocent baby","commenter_a":"I am beyond sickened by this....death penalty.....","post_message":"In the days before her death, little Leah Brown-Meza suffered multiple injuries to her head, a broken arm and a second-degree burn to the bottom of her foot. Her mother and her mother's boyfriend sat in blue jail uniforms as they listened to the evidence presented against them in court. @webpagelink"},{"comment_id":"10154295725641162","commenter_b":"@username Says the ignorant person. I'm not trashy, so I won't stoop to your level.","commenter_a":"Time to take the trash out. Waited 8 years for this.","post_message":"Pres. Obama *literally* drops the mic at the end of his last White House Correspondent's Dinner: @webpagelink"},{"comment_id":"776943375772176","commenter_b":"Nope definitley not a lie lol, I was biologically born female.","commenter_a":"I'm a conservative on most issues, but I disagree big time on this one being a trans male as well (my original biological sex being female). You really want me to go in the women's room and make people there uncomfortable?","post_message":"Are you freaking kidding me..."},{"comment_id":"637787356403576","commenter_b":"She's a psychopath","commenter_a":"She's correct. We're living in an era when a significant number of Americans simply refuse to acknowedge facts, or even the existence of facts. It's the populist wave.","post_message":"Hillary Clinton: \"It's now clear that so-called fake news can have real world consequences.\""},{"comment_id":"893860944043492","commenter_b":"Theres nothing \"hateful\" about 1) secure the border 2) Enforce the immigration laws. In fact every country, including Mexico, does this. People ARE angry. For good reason. As we see our country being ruined by endless millions of incading illegal aliens.","commenter_a":"Its very simple. 1) Enforce our immigration laws. 2) Secure our borders. By the way, that's how all the other countries try and deal with immigration. The rest of this nonsense is just typical liberal delusions","post_message":"End of a DREAM?"}]
