[{"comment_id":"10152721939436051","commenter_b":"Your a cunt ya bitch","commenter_a":"Dumb bitch she would of been mad if the made her fat ass look fater","post_message":"This girl couldn’t believe what her school did to her yearbook photo."},{"comment_id":"10156018657180389","commenter_b":"Carly Fiorina thinks that men that do not want to vote for her are \"Sexist\"... All of you that support her are actually Feminist, or men that are ashamed of being men... Do you really want a Feminist like Hillary or Carly in the White House?","commenter_a":"Hey Sean! Gonna be seeing our man Ted Cruz tomorrow:))!","post_message":""},{"comment_id":"10153438152599087","commenter_b":"What a phony!","commenter_a":"This man should win an award . I wanted to hurl. Wake up people, he is setting you up, playing you like a fiddle for his own political agenda. What a low life to use the children over and over. Not one damn thing he is going to use that damn pen for, will stop the issues we have. The gun doesn't pull its own trigger and mentally ill, terrorists, and murderers do not obey damn laws. He wants to disarm the law abiding. Ask him to dismiss the secret service that carry guns to protect his ass and see how far you get.","post_message":"“Every time I think about those kids [in Newtown], it gets me mad,” President Barack Obama said as tears rolled down his cheek. WATCH:"},{"comment_id":"10154403370309170","commenter_b":"She needs to go bye","commenter_a":"We're doomed!","post_message":"You have got to be kidding me. We actually elected people who believe stuff like this?"},{"comment_id":"522894674501793","commenter_b":"@username NEVER THE BENGHAZI BITCH.....please","commenter_a":"i would vote for hillary to stop cruz. if he should become the nominee i will for the first time in my life vote democrat just to block a foriegner from getting in. I want a president born in the usa not canada, whether he is eligible or not is beside the point","post_message":"Have the GOP left it too late to try to stop Donald Trump?"},{"comment_id":"161828217554597","commenter_b":"Racist bitch","commenter_a":"The racist white ppl that support Trump never show black ppl in a good light!! Never!! @username is the most racist of the right-wing, white supremacist sites!","post_message":"After the Louisiana flood, this man started wondering when the help from Black Lives Matter and Black Panthers would be arriving... The TRUTH is devastating..."},{"comment_id":"483635665160347","commenter_b":"Ban it out of our country!","commenter_a":"These black robe people are not making decisions that we like they need to Go.","post_message":"The Supreme Court just made a shocking ruling on Shariah Law. We must voice ourselves publicly, Shariah Law has no place in America. Do you agree Shariah should be banned?"}]
