[{"comment_id":"10152705081476519","commenter_b":"And have lots of sex in ur ass ur gonna get raped first","commenter_a":"You might be interested in Googleing why it was banned. Few today would believe the pseudo-science mumbo jumbo presented as fact to Congress. 1) Smoking marijuana will make black men want to rape white girls. That's girls not women. There is ZERO evidence here. 2) Smoking marijuana will make young men more likely to experiment with homosexuality. THAT may be true, but the rest of the presentation turned that simple statement into more of an assertion that it would turn young men gay.","post_message":"\"It is time for us to replace the failed prohibition with a regulatory system that works and let states and municipalities decide for themselves if they want, or don't want, to have legal marijuana within their borders.\""},{"comment_id":"10154523489186336","commenter_b":"This must be an attempt to try and dig yourselves out of the hole you're in.","commenter_a":"If you want to know what is really happening in the world bypass FOX and CNN, and go to alternative news sources. You will be amazed to see how much the American news media ignores. We are all living in the dark.","post_message":"Now more than ever, viewers are turning to Fox News Channel – Most Watched, Most Trusted!"},{"comment_id":"10153572381213984","commenter_b":"Real Americans care, libtards don't give a damn, want more illegals here!","commenter_a":"So sorry......","post_message":"One man whose life was forever changed the day his teenage son died at the hand of an illegal repeat offender is now embracing one 2016 candidate's message. Do you agree with what he said here?"},{"comment_id":"1312709298805295","commenter_b":"GOD BLESS THE REAL WOMEN IN THIS COUNTRY! No vigina hats here","commenter_a":"I'm proud of them!","post_message":"HERE ARE SOME WOMEN WHO MARCH FOR OUR RIGHTS"},{"comment_id":"10153725721616770","commenter_b":"Donald is getting rid of illegal immigrants That doesn't belong in America","commenter_a":"Judy white your are a Democratic like them ripping the people of America no jobs Don't you know that God got Donald trump's back Revelation 18 the fall of Babylon and all trades deals .if Hillery Clinton knew god maybe she would be president But she hates god . remember god is greater.any humans On earth no one can overcome what god Has planned can try .","post_message":"New pro-amnesty campaign manager for Donald J. Trump says \"deportation force\" now \"TBD\""},{"comment_id":"1172600979417284","commenter_b":"She is nothing. Melanie has class!","commenter_a":"Cruz is a desperate man and a liar and will do anything !!! Go Trump!!","post_message":""},{"comment_id":"1033224813385043","commenter_b":"My favorite lesbians work at Home Depot............","commenter_a":"I think my favorite part is that the guy was uncomfortable that gay men were running a hair salon. What? Don't you know that's where gay men come from? Salons and interior decorating warehouses. (Edit: Apparently I need to state that I am a lesbian and an activist and this is a joke poking fun at the stereotype. If you're offended by this, I suggest you take your efforts and make a change instead of complaining on an internet post.)","post_message":"*slow clap*"}]
