[{"comment_id":"1695206677435751","commenter_b":"@username totally agree! She's a waste of good breath!","commenter_a":"Bye bye!!","post_message":"ClashDaily.com"},{"comment_id":"974273862659225","commenter_b":"We get it Hillary you and the democrats are buying the immigrates votes!","commenter_a":"Hillary Clinton is saying we must be guided by laws? Comedy gold!","post_message":"Hillary Clinton said the deportation raids had \"sown fear and division in immigrant communities across the country.\""},{"comment_id":"953112161448505","commenter_b":"Women.Stop having sex without condoms....","commenter_a":"Women. Stop having sex with Republicans.","post_message":"Sen. Elizabeth Warren has a powerful message for the Republicans that just voted to defund Planned Parenthood. Pass it on! Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"409710459217248","commenter_b":"Sad she's even allowed in this country & in our schools!","commenter_a":"Sad that she promotes hate.","post_message":"Jewish professor shuts her mouth..."},{"comment_id":"1651699668460485","commenter_b":"The deficit has no real meaning re the economy. Look it up.","commenter_a":"A big not for 8 years. What a great vacation they have had. Our country has gone to crap. Glad you enjoyed it. The only thing I have left is change in my pocket.","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"952148034847314","commenter_b":"How LOW can you go? What a dirtbag!","commenter_a":"Public Square Hanging is well deserved.","post_message":"EXPLOSIVE: Thief Stole Veteran Gravestones to Make Granite Flooring at His Home (VIDEO) @webpagelink"},{"comment_id":"10154993397619254","commenter_b":"Hello from erie pa my is he getting big","commenter_a":"His fur is waterproof.","post_message":"HAPPY FRI-YAY! Eaglet E9 is relaxing in the nest this morning. We can't believe how big E9 is! The eaglet will look more like an eagle as soon as white feathers start coming in :) Where are you watching from? @webpagelink"}]
