[{"comment_id":"704049616452283","commenter_b":"fuck that stinky black ugly bitch","commenter_a":"She maybe a First but NO LADY..","post_message":"Our first lady just disrespected all the white women in our country. She is a hypocrite and a racist. We miss Laura Bush. Do you agree Michelle Obama is a disgrace of a first lady?"},{"comment_id":"10153354052466770","commenter_b":"Who cares what a woman beater thinks fk off chrissy","commenter_a":"Racist lives matter","post_message":"He had nothing good to say."},{"comment_id":"10153137299814060","commenter_b":"NOT OUR BELIEF !!!","commenter_a":"In islam animal or human statue is ban","post_message":"The destruction of ancient statues (some replicas) at the Mosul museum in Iraq, a video of which was released on February 26th, is far from the most heinous crime committed by Islamic State. But the group’s sacking of holy sites and libraries are elements of a broader attack, perpetrated in the name of Islam, on the Middle East’s rich cultural and religious heritage @webpagelink"},{"comment_id":"10156470803785354","commenter_b":"They KISS ASS better then the others!!!","commenter_a":"There are thousands of kids bullied every day but Muslims are going to have our government defending them. That is so wrong. Why are they more important than the rest of the kids in our country. B.S.","post_message":"And check out Rush's epic take on this..."},{"comment_id":"10153362630049641","commenter_b":"Whatever tickles your fancy. Hope you get a free lifetime of ky jelly .","commenter_a":"This country is going to hell in a hand basket.","post_message":"The White House takes on rainbow hues to celebrate the Supreme Court's marriage equality decision: @webpagelink"},{"comment_id":"552329344892078","commenter_b":"Impeach her! She's suppose to be UNBIASED. What a joke","commenter_a":"Term limits asap","post_message":"Supreme Court Justice Ruth Bader Ginsburg bashes Donald J. Trump, calling him \"a faker\" and criticizing him for not releasing his tax returns."},{"comment_id":"939447022776130","commenter_b":"1 Muslim + 4 wives = 32 children!!","commenter_a":"Our country has so many homeless families and so of these people would be so grateful to be able to benefit from a number of these programs, and not not offered to them. If we have the housing and benefits for foreign refugees than we have the resources to help our own citizens first. And the positive side to this, we won't have to worry about any of these people killing other Americans","post_message":"Michigan Gov Snyder, Senator Peters And CAIR Pushing For Huge Influx Of Muslim Migrants...Don't The People Have A Choice?"}]
