[{"comment_id":"10154385390083132","commenter_b":"GORGEOUS","commenter_a":"'@username kitchen","post_message":"We can't decide which we love moreBritney Spears' marble kitchen or her breathtaking view.  (via People Great Ideas)"},{"comment_id":"10153082765311955","commenter_b":"Are you bitches inbred or just drank the kool-aid? ?","commenter_a":"Fucking baphomet bullshit EVERYWHERE 😡","post_message":"MADONNA FALLS HARD"},{"comment_id":"10152918751311336","commenter_b":"Because there wasn't technically a government and laws like European style governments didn't give the European invaders the right to grab the land and kill the people that were already living here my ancestors didn't welcome yours","commenter_a":"If you are in a country without the required paperwork, you are an illegal. Check the dictionary please.","post_message":"'We don't believe in capitulating to people who are going to tell us how to run our newspaper,' said Scott Steepleton, city editor of the Santa Barbara News-Press on FOX & Friends Weekend."},{"comment_id":"10154720750937235","commenter_b":"Michael M you r an ass hole !!! No one cares what you think !! You r ugly and evil with no soul just like Hillary !!! You and Meghan r made for each other !!! You r a disturbed individual !! Making fun of hard working people struggling because of Obamas policies !!!. We all should boycott. All your crap . I will . Those hard working people paid to see your movies ! Thats how u got rich !! Thanks to the deplorable's. You 😤😤ASSHOLE !!","commenter_a":"Michael Moore will do anything for media attention and money.","post_message":"You've no doubt seen folks in your Facebook feed who believe Michael Moore is making the case for Trump.   That is a LIE."},{"comment_id":"10153467696365736","commenter_b":"This is Florida were talking about... the question of 'Consent' is irrelevant. As the boys will simply plead that they were standing their ground!","commenter_a":"If you can't 'consent ' to having sex with an older person, you should not be able to consent to sex trafficking...","post_message":"The 15-year-old girl was a sex trafficking victim for two years, her mother says. At issue is whether she was capable of consent."},{"comment_id":"10153233796523717","commenter_b":"If she did this to one of my children, she would be begging to go to prison or she would beg for the death penalty!","commenter_a":"Judging by similar cases involving females, she will probably get probation.","post_message":"A Concord woman arrested last week faces multiple child pornography charges. The arrest was made in connection with an investigation started by Hollis police: @webpagelink"},{"comment_id":"10153599019231323","commenter_b":"Sack the bitch","commenter_a":"Either the bigot does the job she's paid to do by the taxpayer or quit. Its quite simple.","post_message":"“To issue a marriage license which conflicts with God’s definition of marriage, with my name affixed to the certificate, would violate my conscience.”"}]
