[{"comment_id":"10153445603501051","commenter_b":"If I was the Dad I would be the one in jail...I would had killed that bitch over and over again","commenter_a":"Sorry if I was dad he wouldn't be in Jail he would be in the ground dead!","post_message":"When the boy's 11-year-old sister saw what was happening, she threw herself at the attacker and screamed for her father. But at that point it was too late."},{"comment_id":"10154982308074641","commenter_b":"The Russians did it!!!! #CNN the Russians did it","commenter_a":"Is global warming to blame?","post_message":"Avalanches have killed more than 100 people after days of heavy snowfall along the Afghan-Pakistani border @webpagelink"},{"comment_id":"10154355731201051","commenter_b":"stupid bitch.","commenter_a":"it doesn't matter what trumpie ever says His repugnant followers don't care about anything even if it affects them They lost out on the education they sorely needed..and they will never complain because they are too dumb to know it","post_message":"Actor Tom Arnold says he has secret recordings of Donald Trump doing something so bad that it could change everything."},{"comment_id":"561305640738010","commenter_b":"Yeah men can't back out....it's called child support lol","commenter_a":"Men should be made accountable and pay all money through a court.","post_message":"We couldn't agree more!"},{"comment_id":"790486571080388","commenter_b":"Shut up!","commenter_a":"BUSH IS A JUVENILE WHO WORKS FOR THE BUSHES----NO MORE BUSHES---2 tooooooooooo many---TAKE YOUR MILLIONS AND FALSE POLICIES ELSEWHERE-----We do not want another IRAQ!!! and then be left hanging out to dry like your brother did-----VOTING TRUMP ---","post_message":"Question from Cameron, a 5th grader in New Hampshire: What are the top 3 things you want to accomplish in your first term?  Watch to hear my answer:"},{"comment_id":"543511749143213","commenter_b":"@username hell don't exist kid you will rot just like eveyone else when you die and are burried","commenter_a":"we aren't animals anymore we used our intelligence to go beyond that, why would we want to back track? I wouldn't want my kids seeing them sexual or not. Or my husband sexual or not. No matter how much we try to \"not sexualize\" them, they always will be and there will be women and men who will sexualize them. It's not hard to leave a fucking shirt on","post_message":"Women everywhere are freeing the nipple  but Facebook doesn't want us to show it. #MicCheckDaily"},{"comment_id":"10154289426723797","commenter_b":"@username I am an alcohol manufacturer.","commenter_a":"They should never have been in prison to begin with.","post_message":"OBAMA COMMUTES DRUG SENTENCES: Nine people from Illinois are among the 95 whose prison sentences have been commuted by President Barack Obama."}]
