[{"comment_id":"10153030782377434","commenter_b":"Thank you. However, white women wear wigs and added hair too. 95% of them in hollyweird do.","commenter_a":"I think this is significant when many African American female celebrities wear wigs that look like Caucasian hair, because of our so-called standards of beauty. I think the natural look is much more attractive and empowering for girls who look to them as role models.","post_message":"“If you say you’re beautiful without hair and makeup, then they will believe you,\" Maria Borges said of the hairstyle she walked during the Victoria's Secret Fashion Show."},{"comment_id":"10152921412801051","commenter_b":"You go girl.only someone with a shallow mind and no heart would think such sick thoughts.fckn perverts.","commenter_a":"This woman is awesome! ^_^ <3","post_message":"When this woman saw a hungry baby animal, she decided there was only one thing to do: breastfeed it."},{"comment_id":"10154085328776782","commenter_b":"But if you are here illegal then you are already breaking the law just my thought","commenter_a":"Yes, mainly so it allows/requires them to get auto insurance. Having a license won't make people more likely to be in Oklahoma or use more resources. But if an undocumented person hits my car, I have a better shot of not having to pay for it myself.","post_message":"A newly elected Oklahoma lawmaker is pushing through one of his first bills this legislative session, but it likely to get some pushback from the majority Republican House. Patty Santos has the story: @webpagelink"},{"comment_id":"10152940333217061","commenter_b":"@username shes a hoe","commenter_a":"Hi Guys :) I'm Ashley :) 19 years <3 , I m Single and beautiful <3 girl <3 please like my page :) in 2 secs and i'll send you a friend request and inbox you <3 you will never regret, :( i promise you, please support me by just 1 like <3 1 Like (y) = 99 Help <3","post_message":"Police: Jake Lloyd, the actor known for his role as young Anakin Skywalker in 'Star Wars', arrested: @webpagelink"},{"comment_id":"1058315940902294","commenter_b":"Stupid white girl","commenter_a":"Dr. Cornel West is as arrogant and blind as Bernie. Blaming good Democrats for not getting things done and ignoring Republican majorities blocking them. They don't help. They just \"manage\" from the side lines. Bernie at least has worked some in legislation, but not as hard or as successfully as Hillary. Dr. West has done nothing put complain that people who are doing the heavy lifting are not working hard enough.","post_message":"What do you think about his choices?"},{"comment_id":"470911213097172","commenter_b":"Muslims offend me, so I want Muslims banned from America.","commenter_a":"Your face being covered offends me.","post_message":""},{"comment_id":"858336867535069","commenter_b":"Good for her Muslims need to go back to their own country and stay there. Stop pushing their laws on us. And stop giving into them","commenter_a":"move go back to your country","post_message":"#Sharia comes to Texas?   Not this time!"}]
