[{"comment_id":"10153834639439255","commenter_b":"Fuck her!","commenter_a":"for being called out, really !!!!!!","post_message":"How did we get so many sociopaths running for President in one year, anyway?  By Daily Kos user barskin"},{"comment_id":"10156191527000354","commenter_b":"Huma, you criminal bitch, up yours.","commenter_a":"Dr Ben Carson: 'Islam is not consistent, not compatible with the Judeo-Christian Values and Principles of America, the U.S. Constitution, Sovereign Individual Freedom and Liberty Dr. Ben Carson nailed it on the head, and like Trump, is not 1 ounce of 1 iota fearful of any biased politically correct media backlash because he states the truth as it is, not as they want it to be. Those who are ignorant of the Islamist threat and unwilling to confront it, will be conquered, subjugated, enslaved, raped, tortured, and exterminated over time. David Wood on Islam's 3 stages of Jihad @webpagelink","post_message":"'Huma’s history includes her past work at an Islamist periodical, the Journal of Muslim Minority Affairs (JMMA). The journal was founded by a man named Abdullah Omar Naseef, who would later go on to aid Al Qaeda’s operations worldwide.'  MORE..."},{"comment_id":"10153543401066336","commenter_b":"You illegal aliens need to self deport along with your anchor babies!!! Get Out!","commenter_a":"'Mr. Trump's statements are offensive to all Latinos, but especially to the undocumented community,' said Bertha Sanles, who has lived illegally in Miami for 14 years. 'Trump is focused on promoting hatred and ignores the positive economic contributions we bring to this country.' You know what, become a citizen so you can vote.","post_message":"A resolution to condemn Donald J. Trump's remarks about Mexican immigrants failed last night to win approval of the city council in Doral, Fla."},{"comment_id":"10153380129759087","commenter_b":"The countries that ban him should take the refugees. If they want to stand up for them so bad, take them. Oh ya, Dubai won't take any refugees. They are just hypocrites.","commenter_a":"Another great endorsement to vote for Donald Trump. Way to go Dobye.","post_message":"Donald Trump's name has been removed from a multi-billion-dollar luxury golf course project in Dubai in the wake of public outcry over the GOP presidential candidate's proposal to ban Muslims from entering the US."},{"comment_id":"10155955897895354","commenter_b":"The nasty b*tch just wanted attention and guess what? Now everybody is giving it to her.","commenter_a":"For the life of me I will never understand killing these magnificent animals. I just don't understand how it can be wonderful, thrilling, exciting or in any way fulfilling to kill an exotic animal. And then chop it's head off or whatever you do with that giraffe and have it mounted. Makes not one bit of sense let alone any kind of satisfaction.... Just don't get it.STOP IT NOW!!!!","post_message":"This hunter is single-handedly breaking the Internet today.   Check out the photos of her other controversial kills..."},{"comment_id":"10154884349326509","commenter_b":"Donald Trump would not try to lock the WW2 vets from their own memorial or lock American school kids out of the WH like the pho9ny Obama & dem's did. Pelosi would not even talk to the vets because she was speaking to a group of illegals. However, the scourge is claiming a very fraudulent amount for her retirement, way up in the 6 digits.","commenter_a":"It's still related to DDay and that was sent around by far more than him. Get over it, at least he was honoring the event.","post_message":"Donald J. Trump tried to remember #DDay with a photo that wasn't from D-Day."},{"comment_id":"370042553184039","commenter_b":"marriage was not meant to be a shitty relationship depends have a market I would like to invest","commenter_a":"evolution and same sex cannot coexist","post_message":"POLL: God's design for marriage? (man and woman)"}]
