[{"comment_id":"10154061060138433","commenter_b":"@username -that's the point. Many have NOT committed a crime or have been overcharged to force a plea because poor people can't afford bail, or to wait in jail for a trial and to leave their kids or their job..","commenter_a":"They seem well paid to me. Especially when there's a glut of them.","post_message":"Did you see the Netflix series Making a Murderer? Remember Jerome Buting, one of the defense attorneys? PolitiFact Wisconsin recently checked his claim that Wisconsin pays criminal defense lawyers who represent the indigent $40 per hour, \"the lowest in the country.\" That rated a Mostly True."},{"comment_id":"413560098853531","commenter_b":"How can any woman murder a baby like this??? @webpagelink","commenter_a":"Well, when they intentionally murder babies and sell their body parts, what do they expect to happen? They are murderers, spiritual people do hate that. Here is a 18-week old baby, how can folks not get upset about murdering innocent babies? If you don't want to get pregnant, close your legs or be responsible. Stop using abortion as birth control; it's that simple.","post_message":"\"We've seen an alarming increase in hateful rhetoric and smear campaigns against abortion providers and patients over the last few months. That environment breeds acts of violence.\""},{"comment_id":"10156192968210354","commenter_b":"This witch has lied, cheated and crooked everything she come in contact with in Washington.....she deserves to be in prison but not as long as the democrats up hold her, she will continue to get away with everything.","commenter_a":"Obombass will back Biden but only if obombass can vice president..... dictator","post_message":"***BREAKING*** \"...raises the possibility that the Democratic presidential candidate’s correspondence eventually could become public.\""},{"comment_id":"10153294493981438","commenter_b":"I hate her as corporate whore and war monger.","commenter_a":"I like her as Nerd and Law Student!","post_message":"Nerds are cool, and that is Hillary’s true self. She should two-strap her way to the White House."},{"comment_id":"10153524671301323","commenter_b":"If they are dangerous, then stay away!","commenter_a":"So is crossing the street. Let's kill all the drivers.","post_message":"“Everybody thinks we’re cold-hearted killers and it’s not that ... Giraffes are very dangerous animals. They could hurt you seriously, very quickly.”"},{"comment_id":"10153166262121336","commenter_b":"she can't stop lying","commenter_a":"If her lips are moving she is lying","post_message":"“All my grandparents, you know, came over here...\" – Hillary Clinton said on the campaign trail But Census records show that only one of Clinton’s grandparents was born outside of the U.S."},{"comment_id":"10153845354225579","commenter_b":"I guess Elizabeth you didn't get the memo. Women are excluded from being president as well! You all don't have the fortitude to do what is clearly a mans job!","commenter_a":"Really..Because the shame is on all of the Obama administration. I happen to agree with Dr. Ben Carson..","post_message":"Senator Harry Reid: on Dr. Carson. The Senate minority leader responds to Dr. Ben Carson remarks on Muslims."}]
