[{"comment_id":"583876271812949","commenter_b":"Niggah Please","commenter_a":"Um....why walmart though?","post_message":"Trump's #1 supporter has a disgusting warning for voters..."},{"comment_id":"1292616690749798","commenter_b":"I need to learn how to do that. You never know when you need to live stream.","commenter_a":"This was one smart woman! Her cool during this was amazing. Streaming it to FB was really smart. If the cops took her phone the record was still there. I hope others follow her example.","post_message":"The aftermath was streamed live on Facebook for the world to see."},{"comment_id":"10153973402646350","commenter_b":"Damn her! So bloody uncooperative.","commenter_a":"Every fortnight I clean out the strainers, wipe under the rubber and run an empty dishwasher on hot with vinegar, bicarbonate and eucalyptus oil. Same for my washing machine.","post_message":"The answer is"},{"comment_id":"907290132700573","commenter_b":"Grossly misinformed woman, too.","commenter_a":"You reap what you sow, so when your harvest comes in, don't be crying cause it ain't what you wanted. You sow perversion & corruption, you will reap your harvest.","post_message":"Will marriage equality really kill people, cause 900,000 abortions and undermine heterosexual men?"},{"comment_id":"1040430382659049","commenter_b":"they are getting to close for comfort. she will play the stroke card any day now.","commenter_a":"She looks like a wore out old saddle bag.","post_message":"Hillary, EXPOSED!"},{"comment_id":"1770528716571181","commenter_b":"@username you like being grabbed by the pussy,, I can see that from 100s of miles away. Lmao!!!!!!","commenter_a":"Come on. It's more like a Dr. who accidentally discloses he didn't go to med school, let alone college and is practicing without a listener and has a large number of outstanding malpractice lawsuits against him. But you still trust him.","post_message":""},{"comment_id":"10153933282696350","commenter_b":"Bethsaida Yadnara Why have their own muslim brother's turned them all away??? Jordan, UAE, Dubai, Saudia Arabia?? Those are some very rich countries, right around them.","commenter_a":"They don't belong here...and sure their parents are collecting major benefits, just for entering the country.","post_message":" know people have mixed feelings, and they can be afraid because it's the unknown. But the more we get to know these people, the more the community gets to know them, the more that's just fading away.\""}]
