[{"comment_id":"10154757833186037","commenter_b":"What in the world is a 15 year old doing out at 4:00 a.m.? Oh and BTW, black lives don't matter to black thug killers!","commenter_a":"Sry to hear this","post_message":"Trinity Gay, the 15-year-old daughter of Olympic sprinter Tyson Gay, has been fatally shot."},{"comment_id":"1800766070155339","commenter_b":"#NeverHillary #Hillaryforprison","commenter_a":"we are all trapped","post_message":"Hillary Clinton just became the first female presidential nominee of a major party. Here's the reaction on the floor."},{"comment_id":"817971878238235","commenter_b":"WTF. Is she even more stupid then I thought.","commenter_a":"She is so stupid!!Does she have that kind of power or does that have to have congregational approvevl?","post_message":"Big news! What do you think about this?"},{"comment_id":"10153076129356680","commenter_b":"Yes she is a witch and should be burned","commenter_a":"Just another witch hunt.","post_message":"“This is enormously significant.”"},{"comment_id":"10153402345983812","commenter_b":"Women are to careless & I don't try to twist anything!!!This is a 10 year old girl,not an Adult woman..In most cases ppl could prevent getting pregnant but they do NOT!!I do not even see how would be possible for this child to carry a baby to full term..I think if you are old enough to spread your legs you should be responsible enough for the outcome..Like I said this is a baby not an Adult!!Not going to argue the difference!!!","commenter_a":"I'm totally against abortion but in a case like this her being so young she does not need to carry that baby!!","post_message":"10-year-old girl who was allegedly raped and impregnated by her stepfather has been denied an abortion: @webpagelink"},{"comment_id":"10153223186871336","commenter_b":"Lol @username it wouldn't be America without us it would still be Native American land Indian land you call crazy and aliens would still be over in Europe living without sign in famine","commenter_a":"Actually 52-0 if you count all the woman beatings and cheap shots outside of the ring.","post_message":"ICYMI: Floyd Mayweather piled up enough points against Manny Pacquiao to win by unanimous decision in their welterweight title bout last night. Mayweather extended his win record to 48-0, cementing his legacy as the best of his generation."},{"comment_id":"10154512976631943","commenter_b":"YES!!!!..... LOCK HER UP!!!...LOCK HER UP!!!!...HILLARY FOR PRISON NOW!!!!...IT MUST BE PROVEN TO ALL THAT NO ONE IS ABOVE THE LAW IN OUR AMERICA!!!....HILLARY'S CORRUPTION WILL NEVER STOP TILL SHE IS BEHIND BARS!!!!!.........TRUMP IS THE PRESIDENT AMERICA DESERVES!!!....GOD BLESS OUR NEW PRESIDENT!!!!.","commenter_a":"Mr. Trump we can't let her go Free!! She's trying to destroy you every chance she gets.. Let Gowdy loose on her","post_message":"Share if you agree!"}]
