[{"comment_id":"10153959018846341","commenter_b":"The problem that Islam faces is that it is continuously moving backwards. Even in the Islamic golden era, the economy was reliant on slaves and infidels. The only successful Islamic countries today are the ones that have massive oil reserves. Muslims living in countries with no resources tent to live in poverty. This is why you always see Muslims migrating into infidel lands but you don't see infidels moving into Islamic lands. I do believe that Islam will dominate Europe. I have no doubt. Firstly the countries will be split into two with one being Islamic and the other being Christian but the Muslims will continue to migrate into the Christian countries because they will be poverty stricken. Because sharia is so retrograde Europe will imminently turn into another failed Islamic state as they have no resources. European winters can be very hard If everyone wants to pray 5 times ...","commenter_a":"unfortunate though, but this is the same way Palestinians are wailing, groaning and moaning everyday yet no one seems to care. Let's not unite in periods like this alone but all the time.","post_message":"The residents of Belgium capital city woke up Wednesday morning to a new reality, on the day after the terrorist attacks that killed at least 31 people."},{"comment_id":"10152948975362434","commenter_b":"SHUT UP BITCH","commenter_a":"Oh I think I don't need to post my thoughts as just the last two comments from Shoshana and Kelly do it for me. But - who the hell does she think she is anyway?","post_message":"Of course she is."},{"comment_id":"10156932201230389","commenter_b":"Good answer. She is a sellout.","commenter_a":"NOT EVEN HONEST TO THE PEOPLE THAT PAY HER?","post_message":"David Webb: “Do you think Hillary Clinton’s honest?” Answer: “I think she’s honest to the people who pay her.” MORE: @webpagelink"},{"comment_id":"10154001365909497","commenter_b":"There are plenty of nice average looking women that \"nice\" average looking guys ignore because they chase hot chicks. It works both ways.","commenter_a":"Local man who would be good provider for area woman`s kid friendzoned while area woman dates unemployed band members. Area woman complains about lack of good men.","post_message":"\"If they find a cure for Zika tomorrow, it not like I can afford to get pregnant under my current insurance plan.\""},{"comment_id":"1141292965963756","commenter_b":"There is evil everywhere in all religions! This is a slap in all Christian faces whether they are right, left, or middle! It's just another example of a sick individual taking advantage of others!","commenter_a":"I was in the BIG HOUSE for 2 months long ago and I have to tell ya, some of the queens in there started to look pretty good. Damn Did I just say that?","post_message":"And another \"family-values\" hypocrite bites the dust."},{"comment_id":"10155685513649838","commenter_b":"Build a wall or simply arrest business owners for hiring illegals","commenter_a":"Curtail \"illegal\" immigration.,......why is it so hard for liberals to grasp the concept of \"illegal\" ? Great having a \"difference maker\" with a backbone back in the White House.","post_message":"Trump plans to sign an executive order today to direct federal funds to be shifted toward the building of a wall on the southern border, a signature promise of his campaign. He has argued that doing so is vital to gaining control over the illegal flow of immigrants into the United States."},{"comment_id":"10152865946012293","commenter_b":"Married men have to make more. There are others to provide for.","commenter_a":"Jamal Barcillano :)","post_message":"Marriage appears to transform men’s approach to work and the way employers treat them."}]
