[{"comment_id":"10154406577771051","commenter_b":"Ray >Melania isn't even from the US can't speak English an is a HOE!!!!!","commenter_a":"There is nothing wrong with her dress.","post_message":"This photo of Melania Trump sparked serious backlash after people noticed one thing about her dress."},{"comment_id":"1084382244943634","commenter_b":"The below information must get exposed. Hillary wrote a college thesis on Saul Alinsky's book. We have to save America .!! These are facts., Not propaganda Please read and copy paste to pass this on The Cloward-Piven aka \"Coward Proven\" strategy is based on the teachings of Saul Alinsky a communist socialist died about 43 years ago, but his writings have influenced the politicians who control our nation today. Hillary Clinton did a college thesis on his writings and Barack Hussein Obama writes about him in his books. Saul Alinsky Died: June 12, 1972, Carmel-by-the-Sea, Ca Education: University of Chicago Spouse: Irene Alinsky. Books: Rules for Liberal Radicals Reveille for Radicals Anyone think this stuff isn't happening today in the U.S. ? All eight rules are currently in play. There are eight levels of control that must be obtained before you are able to create a Liberal Socialist state. The ...","commenter_a":"These are okay but when will the size and cost of government be SUBSTANTIALLY reduced? When will we secure our borders? When will we un-bridle the economy and the coal industry? When will we adopt the Fair Tax? Stop playing with the small stuff and fix the big issues!","post_message":"Here are 7 bills we recently sent to the president's desk. Every single one is now law. @webpagelink"},{"comment_id":"10154647842874197","commenter_b":"KHILLARY HAS ROBBED ALL OF US. BILLIONS OF DOLLARS IN HER COFFERS!!! TAKE THEIR MONEY AND GET OUT OF THE US!!!","commenter_a":"He won't save it he will get what he wants at your expense lol","post_message":"WATCH LIVE: Donald Trump speaks in North Carolina."},{"comment_id":"10153736965291336","commenter_b":"She dosen't know what she's talking about .Shout up !!","commenter_a":"Think she's irrelevant at this point","post_message":"\"Every single Republican candidate for president is against marriage equality. Every one of them. Many of them are against anti-discrimination laws. Many are against same sex couples adopting.” – Hillary Clinton"},{"comment_id":"1076328745721469","commenter_b":"I got bafar as well","commenter_a":"Woooow @username","post_message":"This is really, really weird. Check out the explanation here: bit.ly/1bRZ7nn Via by AsapSCIENCE."},{"comment_id":"1616469018618909","commenter_b":"Trending: Obama's Fault Racism Gun Violence Marines holding umbrellas Climate change (that is simultaneously not real) ISIS Al Queda Hot days Cold days Rainy days The economy Abortion rate Teen pregnancy rate Hurricanes Tsunamis Butterflies that flap their wings and cause Tsunamis Terror attacks in Paris Russia attacking Ukraine North Korea hating everyone Syrian Refugees Illegal Immigration Muslims Christians hating Muslims Cops \"fearing for their lives\" #BlackLivesMatter Fox News hatred The wealthy 1% Everyone else Fantastic Four being a horrible movie _________ Fill in the blank.","commenter_a":"I don't see how you blame our first African American president for racists coming out of the wood work.","post_message":"Barack Obama is seen as one of America's most racially polarizing presidents, numerous polls show. So will tensions ease once his term ends? #RaceAndReality"},{"comment_id":"1183094928399954","commenter_b":"Hate this woman!","commenter_a":"Imagine that.","post_message":""}]
