[{"comment_id":"1480511455341931","commenter_b":"Definition of Goldigger: A woman who dates men purely to extract money and gifts from men; in particular a woman who strives to marry a wealthy man.","commenter_a":"She only came for the boat. Now she's trying to act like she's not a gold digger. Too late","post_message":"This is the Tinder date from hell"},{"comment_id":"10156372463505354","commenter_b":"OMG that laugh of hers is so annoying and she is a ugly old bitch! Carley is so much more a women than Hillary could ever be and much more knowledge than the old hag. She let four Americans die in Benghazi she should not even be able to run for President and her emails and her and Bills Clinton foundation fiasco I could go on !","commenter_a":"She is sick","post_message":"*DEMOCRATS' WAR ON WOMEN* Remember how the liberal media EXPLODED when a questioner asked Trump about \"Muslim Obama\"? Well, look at THIS..."},{"comment_id":"10153197491081051","commenter_b":"She's already proven she's delusional","commenter_a":"Nancy - Have Another Drink !","post_message":"Nancy Pelosi says President Obama's Iran deal is simply brilliant. Agree or disagree with her?"},{"comment_id":"968043416588740","commenter_b":"I don't think the majority of people in England would believe any of this rubbish any more than you or I","commenter_a":"The danger of this kind of journalism is the Anti Scottish fervour that it builds up in England. English nationalism is not the civic nationalism that we are trying to achieve in Scotland. The feathers of the establishment have been rattled by,first the referendum, and then the GE. The audacity as the Mail sees it is for Scotland to be ungrateful subsidy junkies who have sent 56 SNP MPs to Westminster to represent their constituents. To carry on this vilification that Cameron promoted during the GE campaign, only months after love bombing Scotland, is to let a Genie out of a bottle that won't go back in. The union could and should end in an agreement between too friendly nations who share an island by the voting power of the people of Scotland, and not by this ever increasing acrimony fostered by the English press. It's a dangerous and unprincipled ...","post_message":"Did the Scottish National Party (SNP) hound Charles Kennedy to his death?"},{"comment_id":"693135860835189","commenter_b":"@username you are too old to be so stupid. Old white men are disgusting.","commenter_a":"Clinton is a LOSER. She may win the Democratic nomination but Sanders supporters will NEVER vote for her = she's lost the general election. Sanders can win it either as a Democrat or independent or third party. . Clinton forgot one thing...,she antagonized Sanders supporters so much that even if he begged they would not vote for her. Not a winning game plan.","post_message":"Hillary Clinton knows exactly how to beat Donald Trump, and she has what appears to be a winning game plan. --Andrew"},{"comment_id":"1397503370290352","commenter_b":"Shellie","commenter_a":"Hahahaha fool","post_message":"Absolutely Hilarious... Spread this everywhere!"},{"comment_id":"1005026196219449","commenter_b":"Demon dog born of a jackle, shut your butt hole","commenter_a":"He didnt do nuffin...he was just minded his own biz..like they all do..blame the whites in America. .tell me one state thats mostly black..that dont have a high crime rate?..then tell me how its whites fault...anddd go!","post_message":"Authorities in Austin, Texas have identified the Black, unarmed teenager who was fatally shot by police Monday morning. Initial reports didn’t name 17-year-old David Joseph or his age, but what has been revealed is that he was naked at the time of the shooting. Geoffrey Freeman, a sergeant with Austin police, and other officers were responding to a call at an apartment complex. Although details are scant, Freeman arrived on the scene and apparently opened fire. MORE ---> @webpagelink"}]
