[{"comment_id":"10152715468475736","commenter_b":"Well, it would also be illegal to shoot undocumented immigrants.","commenter_a":"SHOOT ON SIGHT.","post_message":"The sea lions are making their way into town now! (Well one of them is.)"},{"comment_id":"10153291024331509","commenter_b":"They are, dummy. You must be the next Nancy Grace.","commenter_a":"Fact is most of us don't drive around with hundreds of thousands in cash on us. The article barely mentions the fact that this program is geared towards getting drug dealers off the streets. Cops make mistakes because they're human but this article gives two examples that make it sound like cops are robbing innocent people daily of their cash. @username strikes again.","post_message":"You may have never heard of this program, but it's a widespread practice in which police can take your cash without any criminal charges: @webpagelink"},{"comment_id":"10152821365179091","commenter_b":"PERFECT, never let her out!!!","commenter_a":"Lock her up in the crazy house and throw the key away","post_message":"\"If she is desperate, she may do the unmentionable and harm the mother and take the baby.\"  An eerie Facebook post about Dynel Lane seems to have predicted that she would act violently toward an expectant mother. Lane was arrested Thursday after police say she cut a baby out of a pregnant stranger womb.  Read the whole Facebook post --> @webpagelink"},{"comment_id":"1319359411443456","commenter_b":"LOL...she needs to put her fake boobs away....","commenter_a":"Totes newsworthy!","post_message":""},{"comment_id":"10153058052287452","commenter_b":"Scum bags","commenter_a":"Trump be like \" bet they were Mexicans \"","post_message":"Gone in 90 seconds!   A burglary crew crashes an SUV right into a clothing store and dashes off with thousands of dollars in merchandise.  Not even steel security gates could stop this crew. Tonight, the hunt to catch the cunning crooks who knew exactly which designer threads to grab. Tonight at 11 from ABC7 Eyewitness News. abc7.la/1FenO5y"},{"comment_id":"883127565153756","commenter_b":"We have aspects of both a Republic, and a Democracy","commenter_a":"We will never know the truth.","post_message":"I really hope everyone on Facebook reads this."},{"comment_id":"10153840102456523","commenter_b":"Your ignorant Jessica. Just Stfu","commenter_a":"Gang members shoot people to they do drive byes or just randomly shoot somebody it could be any if us blk kill blks latinos kill latinos white kil whites wow only in America","post_message":"The graphic video shows the three men listening to music, and a man in the front passenger seat holding the phone.   Suddenly, the phone drops to the floor of the car as what sounds like at least 30 gunshots can be heard in the background."}]
