[{"comment_id":"1786899774881601","commenter_b":"All you liberal women should really read this. You don't know who Hillary is. @webpagelink","commenter_a":"Don't continue to fall into Hillary's trap; she's laughing and the Press loves it....forget the Bimbo beauty queen of years past; we have urgent needs in this country that must be addressed and fixed, not to mention Christians being slaughtered by ISIS.","post_message":"'Donald Trump is ready to lead.' Gov. Mike Pence"},{"comment_id":"1181219778640173","commenter_b":"She's crazy!","commenter_a":"she needs to fall on the other side of her face","post_message":"Typical Hollywood liberal elite, who compares everything she doesn't like with the Nazi regime."},{"comment_id":"1538992396141613","commenter_b":"Are these women able to drive their car alone?","commenter_a":"Sorry, I may sound ignorant of the culture, but these women appear to be upper class, mostly because they speak English well, they are educated. I wonder what life is like for poor Muslim women, if their freedoms are the same?","post_message":"These Muslim women are calling out stereotypes, throwing out labels, and asking others to see them as people first and foremost. (via Bustle with more info at u.pw/1qv4Eb0)"},{"comment_id":"10155034112494445","commenter_b":"She's nervous he may grab her by the pussy!!!","commenter_a":"She looks nervous as would I this has been a big day for them, STOP THE HATE, she is a beautiful woman... let's be real how would you be if the entire world was watching you!?","post_message":"President Donald Trump and First Lady Melania Trump share their first dance as the First Couple.  @webpagelink"},{"comment_id":"10156552625375354","commenter_b":"Let me try this again without hitting the return button prematurely. The Hijrah is mandated in the Qu'ran. It seems to be proceeding according to their plan. So long as Merkel and her other Western apologists permit unfettered entry in their respective countries, Islamic conquest via mass immigration will have been accomplished even ahead of schedule.","commenter_a":"Islam is not a religion or a race. It is an illegitimate organized group of murderous thugs and has been since it began. Their modus operandi is always the same. The videos in the links are about Islam. @webpagelink . There is more here @webpagelink . Watch the first one. The second link has many more videos by Dr. Bill Warner.","post_message":"Tensions are rising on the Mediterranean Island of Corsica, a province of France, where authorities have banned all public protest..."},{"comment_id":"1470713222988421","commenter_b":"Typical British woman. No morals, no values.","commenter_a":"Is this worthy of a news item? I think not.","post_message":"She text him the picture weeks later after not seeing him again"},{"comment_id":"10153666896386749","commenter_b":"Um. It's 4-4 and been controlled by conservatives for like 30 years","commenter_a":"Essentially, the republicans refuse to allow the supreme court to be anymore liberalized than it already is!","post_message":"Stop obstructing our Supreme Court."}]
