[{"comment_id":"10153512316881130","commenter_b":"Classy old gal she is....lmao","commenter_a":"I don't know about that if your kid is old enough to eat real food with a spoon its time to take them off the tit.","post_message":"\"There's no difference in me feeding my baby with my breast than you feeding yourself with a spoon.\""},{"comment_id":"1100615946681704","commenter_b":"@username I am very well aware of anything involving Trump or Hillary. I have kept myself very informed for years. Information he gained while being social with the Clinton's is exactly the information he needed to make his decision to run for President. She is corrupt. Period.","commenter_a":"There is a prayer movement sweeping across the country for Donald Trump. More and more roadblocks are popping up to stop him. If he is your choice, please share a prayer at 10 am and 7 pm that God will take him to the presidency. Feel free to share this post.","post_message":"Wow... he really said it! @webpagelink"},{"comment_id":"10154019054861509","commenter_b":"White Americans do not recognize anyone else","commenter_a":"American??? Wow, she is so ignorant. Many American citizens came here from other countries speaking another language. English, the American version, is what has been spoken here for many generations. However, we now have many citizens who speak Spanish, Russian, Mandarin, Vietnamese...We are a country of many. Let's stop the ignorance and the Palins of the world.","post_message":"Sarah Palin praised Jeb Bush on speaking Spanish, but said “let's speak American\" to unify the country: @webpagelink"},{"comment_id":"10153029899116336","commenter_b":"She's a idiot.","commenter_a":"What a joke! Anything to grasp at more sympathy","post_message":"'American Sniper' Chris Kyle’s wife, Taya, asked family friend and U.S. Navy SEAL Pete Scobell to record the song \"Hearts I Leave Behind\" to honor her late husband. Watch Scobell's performance from earlier today on Fox & Friends."},{"comment_id":"1338210979551629","commenter_b":"Lady your way too old to be a cheerleader!!!!","commenter_a":"This woman is not well","post_message":"HOLY SMOKES! NANCY PELOSI: Orders People to Clap, Repeats Words Then Calls John Kasich The Gov. of Illinois [Video] This is embarrassing! She scolds the audience!"},{"comment_id":"10155495328191509","commenter_b":"@username you should be ashamed voting a criminal!!!","commenter_a":"Could we think less of him? Really, he's been in the public eye for 30 years. We know what he is and she is. I'm not voting for a person. I am voting for the economy, the Supreme court, and the best chance for the US.","post_message":"Garry Kasparov suggested that the Russians could possess information on Donald J. Trump that is at least as damaging as WikiLeaks releases have been for Hillary Clinton."},{"comment_id":"10153106076119255","commenter_b":"We have so many publications on both side that are mudslingers with out facts--about time both sides clean up their act and print thing to promote and support","commenter_a":"@username only wants to stir the pot recently!","post_message":"They were insiders. Home grown. Godly. Our neighbors, friends, and kin. People like us. By Bill Moyers"}]
