[{"comment_id":"10153228723406336","commenter_b":"Please these Repigs are tooo much..HILLARY CLINTON WILL BE PRESIDENT Regardless of all the BS Faux NONEWS says and EXAGGERATIONS from Hannipig","commenter_a":"Listen for the \"vast right-wing conspiracy\" defense.","post_message":"Hillary Clinton has agreed to testify on Capitol Hill later this month about two controversial issues when she was secretary of state – the fatal terror attacks in Benghazi and using a private server and emails for official business."},{"comment_id":"10154403030526523","commenter_b":"@username your a pussy.","commenter_a":"TRUMP IS A FLAMING HOMO","post_message":"President-elect Donald Trump responds to a new poll from CNN/ORC which found that he has an approval rating of just 40% ahead of his Friday inauguration. @webpagelink"},{"comment_id":"1658924690814663","commenter_b":"And last time I checked, Treason still carries the death penalty! That would certainly get rid of a bunch of \"bad actors\"! It would go a LONG WAY towards \"making America great again\"!!!","commenter_a":"Trump and Bannon are complicit in Flynn's actions. Does anyone remember Trump tweeting about how \"smart\" Putin is after Putin chose to not retaliate against the sanctions?? This was all coordinated at the highest levels. The whole administration should be in jail for conspiring with a foreign government against America's interests both before and after the election. If all of this put together isn't treason, I don't know what is.","post_message":"Bet Trump knew about this...."},{"comment_id":"464836607049445","commenter_b":"She is a hoe simple as that... stop giving hoes attention ..","commenter_a":"You know, If it weren't for facebook, I wouldn't even know who these weirdos are. I am proud to say Ive never seen them anywhere else. I wont ever use brainspace on any television shows that contain such nonscense","post_message":"“I don't do drugs, I hardly drink, I've never committed a crime —and yet I'm a bad role model for being proud of my body?” Kim Kardashian West came out defending nude pictures she posted on social media."},{"comment_id":"434665249991403","commenter_b":"Like Ms. Richards said \" get over it\"","commenter_a":"The supreme court has been and is political. It has jettisoned the straight forward and logical meaning of the Constitution in a growing social activism. The concept of heterosexual marriage has been intact from the beginning of historical time...until the present attempts to normalize the homosexual perversion . Legal liasons by contract have always been possible to all persons but the attempts to socially institutionalize and legally legitimize homosexual marriage as an equal and legitimate alternative to heterosexual marriage will never legitimize it. It may legalize it - but unborn baby murder is legal but will never be morally normal nor moral.","post_message":"Rick Santorum thinks that Congress should fight the Supreme Court if the court rules in favor of gay marriage. Is he right or wrong?"},{"comment_id":"1871694196449652","commenter_b":"Bahaha Anna O'Toole","commenter_a":"Kaylee Parsons-Cordrey Jessica Shoffner k I don't really give a fuck about either of them but ajdvabsjz skz yes","post_message":"The most bromantic sign of the day."},{"comment_id":"10154020630826636","commenter_b":"@username however... that's detracting from my point! My original comment was about the UK's inability to prosecute migrant sex offenders!","commenter_a":"The only problem people in the uk have with immigrants, new British, Muslims etc... is the lack of police prosecution and \"special treatment\" minority groups get. There are an estimated 1 million cases of Islamic grooming, which've been swept under the carpet, by social services or went uninvestigated by police because of fear of being branded racist! That's not just some \"bigoted\" or \"islamphobic\" propaganda.. that's the reality of people living in a heavily Muslim populated area! The problem isn't with immigrants or non white Christian Brits... it's the lack of ability to deal with the crime coming from their community's by the authorities!","post_message":"Ironic?"}]
