[{"comment_id":"775703385909730","commenter_b":"Lying bitch","commenter_a":"Obama is the divider in chief.","post_message":"So, um, yeah...this went down on 'Meet the Press.'  Here's the VIDEO if you missed it this morning..."},{"comment_id":"743009682482479","commenter_b":"Our military needs to follow the example of General Pershing in 1911. Soak the bullets in swing blood, kill them, pack their cavities with sausage and bury them with a pig. This would stop the rest of them from whining. This guys is a loser from the start.","commenter_a":"Don't worry ducky, soon you will join your comrades in line waiting for your non-existing virgins. Will a couple old goats do?","post_message":"Boo-Frickin'-Hoo. You think life sucks now... @webpagelink"},{"comment_id":"608860039265106","commenter_b":"'@username Beautiful? NO!! She's SICK!!","commenter_a":"So real girls will have their dreams of becoming prom queen crushed because this school will more than likely give the award to a man in a dress just so the school can appear to be progressive.","post_message":"'I'm not going to let anyone discourage me from being who I am.' 18-year-old Dakota is one of four finalists running for prom queen her Portage, Indiana high school. The transgender teen is becoming an unlikely hero for some."},{"comment_id":"10153664920821636","commenter_b":"The appointment of this known Moldovan pimp and thug proves beyond any doubt that the so called 'Jewish state' is actually a fascist state built on violence ,murder and colonialism.","commenter_a":"Hitler would be so proud of these two!!","post_message":"In 2016"},{"comment_id":"859150960886345","commenter_b":"You weren't forced to come either bitch!","commenter_a":"It kills me that someone who is not even from America can say such racist crap @username. Just remember or learn about the history of slavery and the continued discrimination today from immigrants like you who wasn't forced on a boat to come here. It's because of African Americans you have the freedoms you have today. Please don't comment on something you know nothing about and actually learn about the injustices African American people are facing today. You sound just like these ignorant people who always got something to say behind closed doors. I guess you wouldn't know about white supremacy because you've bought in to this bs white people have taught you in America. I guess all the killings by white police is something new. You have no idea what it's like to be black and to get even immigrants being racist towards you the same immigrants Martin Luther ...","post_message":"The Debt Collection Industry Is the Epitome of Systematic Racism"},{"comment_id":"10153389202536051","commenter_b":"Bitch your fake, n ugly to boot !!!! Fake ass , go be with Obama !!!","commenter_a":"Quick somebody wake her up! She's having a nightmare!","post_message":"This model says that after wearing a corset for 7 years and getting four boob jobs, two nose jobs, butt implants and all her teeth removed, she finally has the 'perfect' body. Decide for yourselves if that's true."},{"comment_id":"550509575137335","commenter_b":"So do it already arrest her corrupt ass because she is dangerous to our society.","commenter_a":"yeah...won't hold my breath !! 'smh'","post_message":"FINALLY..."}]
