[{"comment_id":"994031577299051","commenter_b":"scumbags who cross the border are exactly that illigal criminals who purposely defy US laws. The wall just got taller.","commenter_a":"Keep your citizens and residents on your side of the border. When I travel to Mexico, I have to fill out paperwork. To get back into the United States, I have to fill out paperwork. It is unacceptable that someone can come into this country through Mexico without having filled out anything and no record of them in existence while they're here.","post_message":"Vicente Fox Quesada: \"I'm not going to pay for that f---ing wall.\" Donald J. Trump: \"The wall just got ten feet taller.\" Presidente Enrique Peña Nieto: Trump has damaged the relationship between the U.S. and Mexico."},{"comment_id":"10155098283689411","commenter_b":"Bitch","commenter_a":"Politics and sex don't belong together. Also, what a dirty whore.","post_message":"'Everything is ok'"},{"comment_id":"652489448217570","commenter_b":"Bella, ur out of your mind.","commenter_a":"I've never seen a bigger deal made out of nothing than Deflategate","post_message":"Uh-oh...This could be BAD NEWS for Tom Brady!"},{"comment_id":"10153147282168701","commenter_b":"Shut up Leah Jesus Christ.","commenter_a":"GUILT BY ASSOCIATION! I GUESS IN AMERICA YOU CAN BE HELD RESPONSIBLE FOR WHAT OTHERS DO, I THOUGHT YOU WHERE INOCENT UNTIL PROVEN GUILTY, BUT THE WHORES OF SOCIETY-AKA THE NEW STATIONS, REPORTERS, OREGONIAN, HAVE TRIED, COVICTED, AND SENTENCED A MAN FOR CRIMES HIS GIRLFRIEND COMMITTED, SOME PRIOR TO THEM EVEN MEETING BUT SOME HOW IT IS HIS CRIME, SHAME ON YOU WHORES!!!!","post_message":"Here's the full resignation letter from Gov. John Kitzhaber, who says: \"I understand that I have become a liability to the very institutions and policies to which I have dedicated my career and, indeed, my entire adult life.\""},{"comment_id":"10154343689874094","commenter_b":"People know who she is. She will get whats coming to her","commenter_a":"Hopefully she'll get caught out on a camping trip and be torn apart slowly by wolves.","post_message":"Roadrunner the dog's injuries were so severe that a veterinarian had to remove his eyes."},{"comment_id":"10155037977401509","commenter_b":"Hillary basically said hey let's use intelligence to figure out where they are coming from. Trump just wants to get the military involved and kill them all.","commenter_a":"Both called for war so what's the difference? Obama's the one who's weak. Ms. Clinton is a savage compared to Obama and Trumps Attila The Hun lol","post_message":"Donald J. Trump and Hillary Clinton struck different tones following the attack."},{"comment_id":"1066896063328404","commenter_b":"Get these suckers!","commenter_a":"Billie. Do you need to suck each and every bit of lefty nonsense and regurgitate it?","post_message":"Four House Democrats are calling for an investigation into the Center for Medical Progress (CMP) as the group’s deceptively edited video attacking Planned Parenthood continues to fall apart under public scrutiny."}]
