[{"comment_id":"1776934572577306","commenter_b":"I will be voting for Hillary, because trump is grabbing pussy","commenter_a":"If you still plan to vote for HilLIARy after this, you must hate Trump more than you love your country. Think about it. Long and hard. Is your pride worth placing an untrustworthy, corrupt criminal, who flippantly handles our national security, in the highest office in the land?","post_message":"Hillary Clinton's campaign is waging a full-out war on FBI Director James Comey in the final 10 days of the election."},{"comment_id":"10155111311329170","commenter_b":"Another Crazy Woman, she needs to go away, Far away !","commenter_a":"This woman belongs in an institution. She is delusional. Medicate her and get her out of office. My god.","post_message":"VIDEO: Somewhere in California there's an entire district of people who keep sending this woman back to Washington. Wut."},{"comment_id":"10153947034057464","commenter_b":"Cruz for president 2016","commenter_a":"I think what irritates me the most about the republican election right now is people are voting for Trump because they think he is going to stand up for the American people, NEWS FLASH people he's not going to, he has illegal immigrants working for him, he has donated more to the Democratic Party than the Republican Party, and he was one of the people who supported Obama care. He is not our best choice he's our worst choice. He's a frigging liberal that is in the election to help Hillary get in why can't people see that!!'","post_message":"WATCH Ben Ferguson on why he's endorsing our campaign.  Join the #CruzCrew: tedcruz.org/volunteer"},{"comment_id":"10154748214069486","commenter_b":"Fools all of them grrrrd","commenter_a":"WRONG!!!!...ARREST THE CLINTONS NOW!!!!...THEY WILL NEVER STOP ALL THEIR CORRUPTION UNTIL THEY ARE ALL BEHINDS BARS!!!!!!!","post_message":"Is this throwing in the towel?"},{"comment_id":"1281011171918910","commenter_b":"I would buy a hitman to kill grammar Nazis","commenter_a":"Your not going to win. Buy a beer instead","post_message":"What would you do with hundreds of millions of dollars?"},{"comment_id":"10153876150456680","commenter_b":"Libs can't ubderstand acting in legal ways. No wonder they so adore ILLEGAL aliens.","commenter_a":"About the taxes. Trump did nothing outside the law. So he really is a genius. He employed tens of thousands of people and according the the law, he paid the required taxes. Now the democrats are mad that Trump complied with business laws set by Democratic governments and utilized these laws properly? A bunch of hypocrites. #TrumpPence2016","post_message":"“Almost everybody else is getting poorer.  And yet billionaires like Donald Trump are able to manipulate the tax system so that they avoid paying federal income tax,” Bernie Sanders said."},{"comment_id":"996496440403675","commenter_b":"She would take money from a baby for her own use","commenter_a":"The spineless Republican leaders arent getting the word out that Orlando was a terrorist killing in the name of Allah. The lying left has actually convinced their stupid followers the massacre is a \"gun problem\" rather than admitting this was a radical Islamic terrorist event. Our Country is in BIG trouble when we lose 49 innocent people, and the REAL problem has NOT been identified.","post_message":"CROOKED HILLARY CLINTON: FOR SALE!"}]
