[{"comment_id":"10153757247084753","commenter_b":"She needs to stay in prison!!!","commenter_a":"She has been in jail almost 50 years let her go to die a free woman for all you goodie 2 shoes some people deserve a second chance let he who is without sin cast the first stone","post_message":"In shocking news today, Charles Manson follower Leslie Van Houten could be getting out of prison after all this time. Us Magazine shared that Leslie has now been tentatively approved for parole effective today. She has actually been turned down 19 times in the past. Most people know her as the one who wrote the messages on the wall at the murder scene of married couple Leno and Rosemary LaBianca back in 1969. At this time, Leslie Van Houten has been recommended for parole. There is nothing... @webpagelink"},{"comment_id":"10153767520167994","commenter_b":"Alicia Anne , try Jennie Craig","commenter_a":"I no longer have any remorse for anyone in an accident. I see drivers acting like morons every morning and every night...until they start acting like humans, people will continue to die. Michigan drivers are all a bunch of morons.","post_message":"The Davison Freeway westbound remains closed as investigators comb the scene where a man was killed in a crash."},{"comment_id":"500542473482734","commenter_b":"What's so crazy is that these people's ancestors were probably poor farmers! VERY few southerners owned slaves - only the richest - but they convinced the dumb farmers to go to war for them. Learn some history rednecks!","commenter_a":"Your ancestors didn't own a thing in their lives. They didn't own black people then and now. If someone did not willingly agree to become your slave it means you did not own them. They are their person. Unless they make An argreement with you as similar to terms of employment then you do not own then. All sales of slaves are void because you can't sell a human as property or goods. God already said Let My People Go... And so be it that was the end of slavery and should have remain that why. I'm sure if all Black people go back to Africa and the Caribbean and keep allot our wealth their and all white people move back to Europe without our riches we would still be more wealthy than you because you would knocking on our doors for our oil, gold, diamond and anything of value ...","post_message":"HOLY CRAP."},{"comment_id":"10152950876076130","commenter_b":"They're such bitches.","commenter_a":"Emma Green @username","post_message":"\"I cleaned the counter for you.\""},{"comment_id":"865498240307419","commenter_b":"She does this for money . She is a witch like her Mom","commenter_a":"I do feel sympathy for Chelsea. She is truly a victim of the unlucky sperm club. She has to defend two people who are seriously flawed while trying to raise her own family. Their lecherous and unlawful behavior are certainly not her fault.","post_message":"Chelsea tried to challenge her, immediately regrets that decision. This woman was forcefully raped by Bill, let's show her some support for god sakes. Can we get 10,000 'LIKES' for her Bravery?"},{"comment_id":"891587657549689","commenter_b":"Two bullies fightng for power all over the arab both are terrorist","commenter_a":"Saudi arabia please don't do this because you are not killing your enemy you are killing your own brother","post_message":"The Saudi King says his country’s military operations against #Yemen will continue. Three days of airstrikes have killed over 50 people, many of them civilians. What do you think about the attacks on Yemen? Join us on #presstvdebate at 18:33 GMT"},{"comment_id":"10153098509611813","commenter_b":"The ACLU doesn't stand for white heterosexual males or gun rights...ever.","commenter_a":"The ACLU stands for dead babies and bombings.","post_message":"The ACLU supports refugees and stands against fear mongering by politicians. @webpagelink #refugeeswelcome"}]
