[{"comment_id":"10154559728153812","commenter_b":"@username He has lead our country in more debt than any other presidents He doesn't give social security costs of living raise in 3 years He's letting illegals into our country without being vetted He's trying to take guns away","commenter_a":"You Americans, I can't believe how you can produce great leaders like Obama and then still show up with Trump for the next elections.","post_message":"Donald J. Trump on #Dallas: \"This isn't the American Dream we all want for our children.\" abcn.ws/29mnwVr"},{"comment_id":"1213918441976908","commenter_b":"She should step down, even if she did win, God forbid , she won't make the first half year..","commenter_a":"Ken put the straw down","post_message":"She's dying!"},{"comment_id":"10153163075739091","commenter_b":"Resorting to name calling shows the classless women you are! Good job!","commenter_a":"What? Do you want him to ride public transport?! He's the NEXT PRESIDENT OF THE UNITED STATES!!!! #TRUMPTASTIC Man!!! @webpagelink","post_message":"How Donald Trump does jury duty... here's his arrival at a NYC courthouse. STORY HERE: @webpagelink"},{"comment_id":"10153784197573132","commenter_b":"Dig these hard chicks","commenter_a":"Way to go ladies! Proud of you. You are true role models.","post_message":"True role models."},{"comment_id":"10153039923756037","commenter_b":"^ pathetic.","commenter_a":"Tranny.","post_message":"#MichelleObama relished watching children ride their bikes and walk their dogs inside the White House as she pushed her \"Let's Move\" campaign forward."},{"comment_id":"1767897086815216","commenter_b":"Stfu u dummy","commenter_a":"She has to be on drugs and was coached for the interview. There is way more to this story. I've never had a cop pull a gun on me when I was pulled over for a speeding ticket.","post_message":"WATCH: ABC News EXCLUSIVE: Woman who live-streamed boyfriend shot by police in Minnesota shares her story: @webpagelink"},{"comment_id":"1343888468964236","commenter_b":"What's Columbus Day? Idk that dude.","commenter_a":"Possibility of a historic windstorm close to the 54th anniversary of the Great Columbus day storm? Wow. The weather here just keeps getting crazier!","post_message":"There is a one in three chance of a “historical windstorm for nearly all of Western Washington that would be long remembered.”  Take today to prepare for possible power outages and have some extra supplies on hand."}]
