[{"comment_id":"912344515551025","commenter_b":"Illegals are taking jobs we Americans can't or won't take...","commenter_a":"Well I like Cruz...a lot. My husband and I both voted for him. He's a true conservative and defender of the constitution....","post_message":"Ted Cruz voiced his strong opposition to President Barack Obama's lax enforcement of our nation's immigration laws, arguing that his policies have led America down a path of economic turmoil. @webpagelink"},{"comment_id":"956871837686622","commenter_b":"This mother is insane.","commenter_a":"Not cute or darling...it is ANIMAL ABUSE..this child will grow up not respecting animals or people a a result of mommy's abuse to her and to animals...kids do not know...they have to be taught...","post_message":"This is not “cute” or “playful” or “darling” or “harmless” — it’s ANIMAL ABUSE, indirectly perpetrated by a mother too ignorant to keep her clueless (and ultimately innocent) toddler from treating a LIVING, FEELING creature like an inanimate rag doll. Disgusting…"},{"comment_id":"10155295092495579","commenter_b":"Liar!","commenter_a":"Zero evidence that Russia had any influence in our elections , period. The only people that believe this are the liberals that hate Trump.","post_message":"President Trump: \"To be honest, I inherited a mess. It's a mess. At home and abroad. A mess.\" Watch full news conference here: @webpagelink"},{"comment_id":"10155260669520557","commenter_b":"Death row is just fun. ;)","commenter_a":"Death is the easy way out, watch some of the programs on prisons Then you will feel better knowing that each and every day he or she will wake up in their 4x6 house shared with another body, no privacy to use the bathroom or get dressed, no delicious food and if their lucky can get through a shower safely. Every day they will think about what they have done and to me this is worst punishment than death!","post_message":"'I'm disappointed... he did not consult with district attorneys or consult with the families of victims whose lives have been torn apart by the people who have been sentenced to death for their actions,' Berks County DA says in speaking out today against Gov. Tom Wolf's moratorium on the death penalty in Pennsylvania."},{"comment_id":"532815796909000","commenter_b":"Shut up lady","commenter_a":"STOP THIS.........these are two little girls that are living under the worst conditions possible at this time............leave them alone. Can you imagine how hurtful your stupid post are to them? They are teenagers.........they don't need their friends or the public to read your lies and innuendos. The site the the Patriot should be burned at the stake........stop your disgusting posts and leave innocent people alone............","post_message":"The White House is in uproar after Obama daughters caught doing THIS. This is outlandish. These are the daughters of our president. Would you vote to kick the Obamas out of the White House?"},{"comment_id":"10153319908498352","commenter_b":"And we know she sell pussy how??","commenter_a":"So she's gonna stop posting pics of her kid!?? How about stop posting pics of your ass.... Bash is better off with his daddy","post_message":"Amber Rose Responds To Wiz Khalifa Saying She Has A Dirty House & Baby Bash Birthday Issues"},{"comment_id":"1546700958971228","commenter_b":"Heaven forbid that us stupid stupid people should be allowed to have some one tell us the truth! Good Grief!","commenter_a":"But why","post_message":"BREAKING: You’ll Never Believe The Reason Greta Van Susteren Is Losing Her Job. This is terrible. We love her. Can we get 5,000 'LIKES' to Greta on the air?"}]
