[{"comment_id":"847757325414844","commenter_b":"fly your flag and tell these invaders to get out","commenter_a":"Let him fly his flag, this is America","post_message":"There is nothing threatening about an American flag.  He wants to show his pride for his country, let the man!  Do you think he should be able to fly his flag?"},{"comment_id":"10153935380939456","commenter_b":"Ikr and people smuggle exotic animals and plants like that don't spread diseases but I guess everything that's wrong with the world is only caused by illegals.","commenter_a":"I'm stuck between laughing out loud at the idiocy of Jennifer and lucindas comments, or just being out right dumbfounded! But no, I laughed, y'all's ignorance just made my day 😂😂😂😂 Lol don't be mad cuz your wall can't stop illegal entry of virus spreading... Mosquitos 😂😂😅","post_message":"An illness is spreading around the world, and there's mounting evidence linking it to a terrible birth defect."},{"comment_id":"10153080456176051","commenter_b":"Feral pigs are a huge problem in this country.","commenter_a":"I am NOT a liberal, and do not believe in hunting for sport! Why do people who hunt, feel the need to post morbid pictures of 'their kill' Is it to prove something?! Not many people want to see that!!","post_message":"These hunters have one message and one message only for their critics: get over it."},{"comment_id":"10152758680722144","commenter_b":"Racist pigs","commenter_a":"What the hell are these people thinken DO THERE DUM ASSES KNOW THAT CHILD ABUSE","post_message":"WTF."},{"comment_id":"1188648117842550","commenter_b":"America shouldn't change Muslims need to adapt to our cultures","commenter_a":"UN","post_message":"MUSLIMS FLIP OUT! McDonald, Pizza Hut And KFC Refuse Muslim Demands To Serve Halal...  Time to go eat a Big Mac! Can we get 10K LIKES for this!"},{"comment_id":"10153690719066130","commenter_b":"Andrew Ritchie","commenter_a":"Woof, there are some dumbass people on this feed. The benefits outweigh the risks.","post_message":"This vaccine is drastically reducing HPV cases in teenage girls, but some parents can't get over the stigma."},{"comment_id":"10156148528265725","commenter_b":"Trump has the mentality of an 8 year old class bully","commenter_a":"Suzanna Mikolajczak Trump is a Beast","post_message":"I think Megyn Kelly should take another eleven day 'unscheduled' vacation."}]
