[{"comment_id":"10153187675581336","commenter_b":"Obviously the Muslim student. If she doesn't want to watch it go get a coffee or do something else. I mean I don't like certain movies but instead of causing a ruckus I just don't go see it. Remember...we do live in a FREE country.","commenter_a":"We're just going to let them dictate to us what we can watch in our own country!?!","post_message":"President of the University of Maryland College Republicans: \"This isn't a racist film. It's about a decorated American war hero who [risked] his life for you and me and all the viewers.\""},{"comment_id":"1800270353550404","commenter_b":"She is a news whore and can't stand when she's not the center of the news! Whole thing probably a publicity stunt!","commenter_a":"insurance","post_message":"Kardashian West has yet to post about the incident in the days since it all allegedly went down."},{"comment_id":"10153877529004778","commenter_b":"Yup she's a joke","commenter_a":"Why because they know she going to give them a run for there money..","post_message":"\"Rarely in the history of any criminal case has a prosecutor so directly maintained so many conflicts of interests,\" the motion declares."},{"comment_id":"10153714584104087","commenter_b":"She's a pure Red in disguise.","commenter_a":"The PEOPLE are speaking. She's winning by a lot of votes.. doesn't matter what the internet thinks. Real people are voting, and real people are voting for her.","post_message":"Fresh off a commanding win in New York, Hillary Clinton has a 13-point edge in the biggest state up for grabs in next week's primaries."},{"comment_id":"682571568600088","commenter_b":"I am so sick of hearing this offends the Muslims that offends the Muslims what the hell are they living here in America this is our country go back to where you came from because you offend us","commenter_a":"DONT LET THEM DO IT!!! Don't keep the truth away from AMERICA. Don't let them do it.","post_message":"Schools are removing the Holocaust for curriculum because it offends Muslims. This is could be the most ridiculous thing I've ever heard. Do you think they should keep the Holocaust in history lessons?"},{"comment_id":"10154179155026051","commenter_b":"Yup","commenter_a":"Nop","post_message":"Do you think Donald Trump would be a better president than Hillary Clinton?"},{"comment_id":"10153227586230047","commenter_b":"He did the right thing","commenter_a":"No","post_message":"While serving overseas, Sergeant Martland intervened to protect a child from sexual abuse. He deserves to be honored for this heroic action, not punished. Sign and Share our petition to fully reinstate Sergeant Martland: @webpagelink"}]
