[{"comment_id":"10153041187141037","commenter_b":"Which one Rebecca?","commenter_a":"Life begins when that egg is fertilized life begins when that baby Not a fetus has a heart beat life begins when that baby can survive outside the body. This isn't religion this is real talk","post_message":"In an embarrassing setback, House #Republicans abruptly decided to drop planned debate of a bill criminalizing virtually all late-term #abortions after objections from GOP women and other lawmakers left them short of votes."},{"comment_id":"992247137464743","commenter_b":"The women that hate Amber Rose are either ugly or fat or both. A secure woman has NO REASON to hate on another woman.","commenter_a":"I love seeing a post about 2 women making a serious public statement about the hate women recieve and then reading nothing but hate on those 2 women (BY OTHER WOMEN) in the comments.........","post_message":"Jaw-dropping. #VMAs"},{"comment_id":"602527166571478","commenter_b":"Certain ppl should stop reproducing","commenter_a":"'@username fuckin retard","post_message":"So Dumb: She Thought She Found A Hack To Charge Her Iphone!"},{"comment_id":"10153751099450575","commenter_b":"get this ass out of office and then let them rape her!!!!!!!!!!!!!","commenter_a":"Yup!!!!! a little common sense, people....she's the leader of Germany...Oh , sorry, look at the leader of the U.S. He's not smart enough to pick up on this.....well I think he is smart enough , but he's on a fast track to destroy america, so, it can do that!!!","post_message":"Now she admits it after she already destroyed Germany. . . ."},{"comment_id":"1250451044993129","commenter_b":"Her supporters are indebted to her for what she has connected them with of course you're not going to spit in her eye the whole group including her supported just crave Power by any means necessary and feel they are much Superior to all other beings and should be allowed to run the world according to their plan blow them all out of the water please go vote for the one who loves his country it's the only hope we have","commenter_a":"The love of money is the root of all evil. They should be in jail. Anyone else who did this would be.","post_message":"This is important."},{"comment_id":"10153111204826680","commenter_b":"The paper of choice for Fox News viewers","commenter_a":"What was curious about the Democrat primary Debate selection pool is all Old White people — No Blacks No Hispanics -diversity?","post_message":"The National Enquirer is fixated on Hillary Clinton's mortality."},{"comment_id":"1081030328612686","commenter_b":"Go bang your mother with a mace","commenter_a":"All you people saying taxation is theft are such complete morons. Taxation is a membership fee to live in the USA where we have benefits that greatly outweigh the cost. Why don't you renounce your citizenship and gtfo out of the USA and move to Antarctica if you don't want to be taxed. Bunch of unpatriotic pieces of human garbage in here.","post_message":"Wouldn’t it be great if you could refuse to pay your taxes until you decided your tax rate was “fair”?"}]
