[{"comment_id":"1650724908525555","commenter_b":"Let's see, she and Obama, on one hand, want to take our guns, and on the other hand, want open borders of illegal aliens and possible terrorists to enter the Country. They are aiming to make all of America a soft target. Whose side are they on, anyway? Never mind, I think we know. Vote out all liberal, progressive, Democrats. Obviously, they are mentally ill.","commenter_a":"Gun control my a$$ - We ALL need to be armed!","post_message":"Wasting no time..."},{"comment_id":"10153396977353010","commenter_b":"Illegal aliens should have NO rights in OUR country...time to load them up and send them home and shoot them if they try to return.","commenter_a":"Right wingers have often been bigots and dismissive of the Constitution.","post_message":"In a letter to supporters, Maricopa County Sheriff Joe Arpaio asked for help with his legal fees, adding that he feels 'targeted' by the immigration rights groups that have sued him to stop what they say are racist policies targeting Latinos."},{"comment_id":"10156528431575354","commenter_b":"Screw her","commenter_a":"Boo-fucking-hoo! Lifes tough on EVERYBODY! And not everyone drives their car up on the sidewalk! Now the media will make her out to be the victim! Put her ass in prison and throw away the key!!","post_message":"Changed Name from ‘Lakeisha Holloway’ to ‘Paris Paradise Morton’…"},{"comment_id":"10154128479435673","commenter_b":"She needs to go. and you can go to....","commenter_a":"Too little too late Jack","post_message":"The decision not to seek prosecution of Hillary Clinton is plain wrong. I have joined several of my colleagues to do something about it."},{"comment_id":"10155813559759778","commenter_b":"Very heartbreaking and moving commercial...but unfortunately there still has to be something done about ILLEGAL immigrants coming into America. The Mexican President Enrique Pe Nieto could do something to help make their country better so the Mexican people would want to stay in their own country. I am sure he doesn't mind allowing the criminals to come here and apparently he doesn't care about the poor either, but something has to be done to protect our America.","commenter_a":"I loved it. Saw the ending...Touching.","post_message":"Budweiser isn't the only company to tackle the politically heavy topic of immigration in their Super Bowl commercial this year."},{"comment_id":"10153689476229411","commenter_b":"^your a dumb bitch lol","commenter_a":"Neo nazi sentiments are riseing in europe includeing islamaphobia and alittle anti semetic retoric. This is a reality. I dont care if u agree or dont its happening. People say get rid of the immigrants that have refugee status and those fleeing war zones and this intolerance will end. No it wont. This is a deep rooted problem of european ethnic supremacy masked. Its disguised well and they sure convince alot of people of there philosophy from people like madam blavatsky. And her race based ideology. Whats fueling race and ultimately religious intolerance is low birth rates from the native peoples of europe so they blame immigrants even tho the state subsidizes births in europe. Neo fascism is gaining ground because of this wacky race based fear and economic troubles. So the nazis are mixing both messages pointing it at immigrants and they do get violent. They dont only want ...","post_message":"is disrespectful is the political reality in Europe that people, suffering so greatly hand, over thousands of euros and must take such unsafe routes while for the rest of us Europeans it is so easy  to travel in the other direction'"},{"comment_id":"1084762064867436","commenter_b":"Get your head out of your but she , started this joke !! May be you should pay for her education","commenter_a":"Looks like Fox found the dumbest person possible to ask questions to lol. Love how you're all thumping your chests cause Cavuto outwitted some dumb college girl.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
