[{"comment_id":"10153031341999705","commenter_b":"Sunset Avenue Dove Dove","commenter_a":"I need this in Florida!!!","post_message":"Ok, Starbucks."},{"comment_id":"865762326792523","commenter_b":"She needs to go home and git her dildo and go for a ride","commenter_a":"I'm sure Netanyahu is ignoring them...","post_message":"Why does the Democratic Party hate #Israel so much?"},{"comment_id":"461209797400647","commenter_b":"This isn't the dark ages, human beings are starting to accept all people. Perhaps the asswipes on this thread should become more tolerant and stop wasting all their energy on irrational hatred.","commenter_a":"What awesome gay couple would want to be married by a bigoted pastor? There are plenty of other ordained people who will be more than happy to marry a beautiful couple!!! Peace!!","post_message":"Breaking..."},{"comment_id":"10153861308944087","commenter_b":"@username and u so fucking stupid","commenter_a":"The sad part is people in this country seriously think she is worth voting for...","post_message":"#BREAKING: A federal judge blocked Judicial Watch’s effort to begin interviewing State Department officials under oath and collecting evidence as part of a lawsuit over Hillary Clinton’s private emails."},{"comment_id":"10153109185578812","commenter_b":"I hope people know the women in Iowa aren't all like her.","commenter_a":"I'm from Iowa. So embarrassing!","post_message":"The Republican Response to #SOTU2015: Who is Joni Ernst?"},{"comment_id":"954186131315786","commenter_b":"Her being revealing? Do you think she picked out the dress herself and made a conscious choice to show her nipples?","commenter_a":"To be so revealing when so young is certainly extremely questionable moral territory.","post_message":"Too young?"},{"comment_id":"10154308587221323","commenter_b":"Oh stop with this mythology bull, grow up!","commenter_a":"Quran is base of Islam. Quran do not say that homosexuality is pride. GOD bans this type of relation in all abrahamic faiths, but also GOD say that He will punish this sin, people re not allowed to harm gays. They only can make advise. So Sadiq Khan should tell about Quran and not his personal views, abot homoseuxuality, only then muslims will accept him like a muslim.","post_message":"\"The irony of Brexit repercussions is that those good old (or new) British values we bang on about seem to be falling to pieces around our ears. Diversity, unity, respect, equality might sound like cliches on replay – but they do work for us, if we work for them. That’s why approaches like that of Sadiq KhanKhan are so badly needed now. He’s somehow got his act together during a moment of such uncertainty, doubt and disappointment.\""}]
