[{"comment_id":"10154859326468487","commenter_b":"We don't know wtf is out there - we could be in a giant terrarium","commenter_a":"And most American Christians are whiney little bitches. They have some nerve to plagiarize the Jesus myth and then steal all the pagan holidays that revolve around the axial tilt of the earth, and then pretend they're persecuted.","post_message":"Even though some Muslims have been in the United States for longer than many of the Protestant and Catholic descendants of German, Italian, and Irish immigrants, most Americans still believe Islam is odds with American values and way of life."},{"comment_id":"10154000901360575","commenter_b":"Trump may not be as conservative as you or I, but neither is he a liberal, and anyone who tries to convince you that Trump is a liberal is a liar. A liberal would not want to build a wall. A liberal would not want to enforce our immigration laws. A liberal would not want to repeal Obamacare. A liberal would not want to bomb ISIS back to the stone age. A liberal would not want to bring back waterboarding “and worse” for terrorists. A liberal would not want to protect your right to own and carry a gun to protect yourself. A liberal would not want to defund tax-funded abortions. A liberal would not want to build up the military. A liberal would not want to take care of our vets. A liberal would not support our police. A liberal would not want to negotiate trade deals that give ...","commenter_a":"@username, you are so correct!! Trump has not said one intelligent thing during any of his speeches. Furthermore, his false accusations of calling Senator Cruz a lier is not working for him. Anyone who believes anything Donald says is delusional. Why has Trump not agreed to debate Senator Cruz!? Donald knows he is no match to Senator Cruz. Additionally, Donald lacks knowledge, experience and intelligence to speak about the most critical issues facing our country. You cannot be a Commander-in-Chief just because you are rich!! CEO's of large corporations are not hired to run a company because they are rich. Your resume matters!","post_message":"Cruz trashes New York in hopes of picking up votes in Pennsylvania."},{"comment_id":"10153537073428352","commenter_b":"Lol she is a freak","commenter_a":"Still dont see why he should loose his life over trafficking drugs, after all he didnt commit murder. I hate indonesia and its stupid laws","post_message":"‘My life is a perfect example of an absolute waste': Andrew Chan’s haunting letter to schoolchildren around the world, warning them about the dangers of drugs"},{"comment_id":"10154630383678145","commenter_b":"She can Rot in prison too!!! Throw everything you can at her!!","commenter_a":"LOCK HER UP THROW AWAY THE KEY.","post_message":"Officials believe LaKensha Smith-Loyd knows where her uncle, accused cop killer Markeith Loyd, is but she has so far refused to tell them."},{"comment_id":"10155025944411509","commenter_b":"That is not a woman.","commenter_a":"Why is this even news. Do we report on all suicide attempts by convicted criminals or just the Transgender ones ? Bias, bias, bias....","post_message":"U.S. Army soldier Chelsea Manning, imprisoned for leaking classified documents, tweeted that she was \"glad to be alive.\""},{"comment_id":"1614611835509066","commenter_b":"you're welcome u baster","commenter_a":"I'm going to the toilet and leaving my phone on charge, I expect loads of likes when I'm back. Thank you","post_message":"US President-elect Donald J. Trump will soon be accompanied at all times by a military aide carrying the nuclear \"football,\" enabling him to order a nuclear strike at a moment's notice."},{"comment_id":"10152899242557144","commenter_b":"Illegals Charlotte, illegals.","commenter_a":"\"We\" need to take care of our country first. We still have veterans dyeing before they get an appointment. Don't tell me about Mexicans.","post_message":"Wow."}]
