[{"comment_id":"1040475262630610","commenter_b":"Many women who can't do hormonal, do the copper IUD. 10 years in, less of a fail rate than a tubal!","commenter_a":"If only BC didn't have so many side effects tho. I had to get off, I almost had a stroke at 30. Not to mention I gained 40 lbs😟","post_message":"Today is the fifty year anniversary of a court case that changed everything"},{"comment_id":"991848417558053","commenter_b":"what woman?","commenter_a":"If this woman is willing to show such an overt act of patriotic disrespect, how will she ever effectively enforce our laws in an unbiased way? She should be removed from her position. End of story.","post_message":"VIDEO: Muslim Police Chief Shows This Act Of Complete Disrespect To America And Is Under Heavy Fire For It."},{"comment_id":"1247857341977182","commenter_b":"The radical Christians in this country would throw gays off of rooftops too if they wouldn't go to jail for it. If you think that's wrong read the comments on any article about them.","commenter_a":"Now all the Christians will throw the pope under the bus for stating the obvious","post_message":"\"It's like a mixed fruit salad. There is a bit of everything. There are violent people in all religions,\" Pope Francis said."},{"comment_id":"10154083249768984","commenter_b":"you bitch you took away something that is all American and turned it into a race baiter bunch of bullshit you and jazeeee suck please move","commenter_a":"behind the sheriffs all the way! DISGUSTING, RACIST, C!","post_message":"When these sheriffs saw what Beyonce was doing in front of the biggest TV audience of the year, they knew there was only one thing they could do... Do you support these sheriffs?"},{"comment_id":"474408059350901","commenter_b":"Stay off their land!","commenter_a":"Err... They only kill white people because their other fellow tribes who join the \"democratic\" world suffered a lot of losses and they warned them. There is a documentary on this. You should check it out.","post_message":"Anyone who has ever tried to come ashore the island was attacked or even killed."},{"comment_id":"10155316493136509","commenter_b":"She's a putz.","commenter_a":"Kacie Hughes","post_message":"Hillary Clinton: \"The good news is my pneumonia finally got some Republicans interested in women’s health\" @webpagelink"},{"comment_id":"10153319908498352","commenter_b":"And we know she sell pussy how??","commenter_a":"So she's gonna stop posting pics of her kid!?? How about stop posting pics of your ass.... Bash is better off with his daddy","post_message":"Amber Rose Responds To Wiz Khalifa Saying She Has A Dirty House & Baby Bash Birthday Issues"}]
