[{"comment_id":"10150935910204999","commenter_b":"Women for Donald J. Trump","commenter_a":"Is this the Hillary lecture show or a debate where we're going to hear from two people. Chris Wallace if you wanted to have a person conversation with Hillary you should have called it as such and not drag us through this BS","post_message":"Chris Wallace’s star turn is a welcome source of pride at Fox News. And, maybe, some relief."},{"comment_id":"1280473441987748","commenter_b":"Why is it that when someone makes a valid point. He or she is told to leave. His country was solely built on the backs of slaves. Leave a country you built. How bout leave a country you stole","commenter_a":"Don't like or agree then leave the country if shit offends you... like mama said I'm pretty sure the grass isn't greener on the other side but your more than welcome to check if ya don't like it here just don't let the door hit ya in the ass on the way out ....","post_message":"Massive respect to Colin Kaepernick for having the courage to speak out!!"},{"comment_id":"10154306553151729","commenter_b":"@username then you should be glad that we want to stay out of it, dumbass! Unless you want us to go back to our 1940s mindset and you won't have anything but a glass parking lot over there.","commenter_a":"They have been fighting over there for centuries. Stay out of it let them finish each other off.","post_message":"This is very serious folks."},{"comment_id":"10154721377651320","commenter_b":"Don't forget Al Sharpton hanging there too.. shes a joke!","commenter_a":"Really ? So how do you handle having Jay Z in the Whitehouse with the crap that comes out of his mouth that he makes money off. Shaken to your bones ?","post_message":"Thoughts?"},{"comment_id":"10153535805923352","commenter_b":"You dumb wet back bitch and @username you ugly bitch go ahead. Pink monkey bitch","commenter_a":"He is though. What happened to \"freedom of speech\"? Oh it's selective I see.","post_message":"Female middle school teacher forced to resign after telling students that President Obama is a ‘Muslim baby killer’"},{"comment_id":"705952482887629","commenter_b":"#NeverKillary, #CriminalHillary, #Notwithher, #Trump, #MakeAmericagreatagain","commenter_a":"dont you wish people liked you like this????","post_message":"Donald Trump lied to the American people at least 58 times during the first presidential debate. (We counted.)"},{"comment_id":"10154113028645329","commenter_b":"Does this mean we all just became best friends?","commenter_a":"Wow. Completely true. Very accurate quiz.","post_message":"It really will. (via BuzzFeed Quiz)"}]
