[{"comment_id":"10153086762191438","commenter_b":"Besides there no such thing as a attractive Democrat woman!","commenter_a":"Boils down to primal fear in Liberals, Hillary is toast and Warren is way to Marxist except for the hard Left....and Liberalism doesn't sale to Americans....Cruz has a great message and the Left knows it...see the exact same responses on other Leftists sites...you can smell the wet panties and fear....","post_message":"Ted Cruz has no chance of becoming president."},{"comment_id":"10158183422455594","commenter_b":"What message are you sending? That nutty women can run around dressed as vaginas and cry out for the \"right\" for women to kill their innocent babies? Some message from you silly chicks.","commenter_a":"Funny how the negative comments are posted predominantly by males. Do we make you nervous and uneasy? Good. You should be nervous.","post_message":"Crowds went berserk for the big-screen actress as she waxed poetic in R-rated language on women's rights and the perceived threat the new administration poses to those liberties."},{"comment_id":"1195052803848081","commenter_b":"No more illegals. Go trump","commenter_a":"Trump rocks . Save Americans from drug cartels. Sanctuary citys and organizations promoting murder","post_message":"New polls show Trump is appealing most heavily to a certain kind of Republican voter."},{"comment_id":"10154490507826051","commenter_b":"Absolutely NOT! Lying Ghetto trash Marxists.","commenter_a":"Absolutely did not he's a Muslim has no class.","post_message":"Yes or no: Did the Obamas represent America with class and dignity?"},{"comment_id":"1145080512196207","commenter_b":"@username, no. The crime is to be caught crossing the border into this country. Once you're in the country, it is a CIVIL offense and people are due a hearing and disposition before a judge.","commenter_a":"It'll literally distract them from focusing on real crimes","post_message":"\"If the federal government takes a more aggressive role on deportation, then they’ll have to do that on their own.\""},{"comment_id":"565467440308215","commenter_b":"And here ya go, they will bite the hands that feed them .. dumbass .","commenter_a":"What about our children who live on the streets and homeless families in America!!","post_message":"He was wrong! What happened next..."},{"comment_id":"10154155058901770","commenter_b":"Yep just what I thought!! Gets her hair color from a bottle! And still stupid","commenter_a":"I think melania trump should be taking clothing tips from a real Material Girl","post_message":"Madonna slammed Trump supporters, calling them “lazy and “un-unified.\""}]
