[{"comment_id":"1722289054713180","commenter_b":"notice how she talks about white man?","commenter_a":"@username Former foreign minister , has failed in its mission and has caused much of the confusion the US administration @username was not calling things by their names correct .. for example, terrorist organizations ( liberation movements ) , states that support extremism ( our friends ) , dictatorships ( our partners ) @username win means that a disaster occur American nation","post_message":"Women across the country lose out on every paycheck—and women of color feel it the most. Our families can’t wait: It’s time to ensure equal pay for women. hrc.io/EqualPayDay #EqualPayDay"},{"comment_id":"10153396977353010","commenter_b":"Illegal aliens should have NO rights in OUR country...time to load them up and send them home and shoot them if they try to return.","commenter_a":"Right wingers have often been bigots and dismissive of the Constitution.","post_message":"In a letter to supporters, Maricopa County Sheriff Joe Arpaio asked for help with his legal fees, adding that he feels \"targeted\" by the immigration rights groups that have sued him to stop what they say are racist policies targeting Latinos."},{"comment_id":"10153236337040047","commenter_b":"This is an evil,should be exterminated.","commenter_a":"So sad","post_message":"This week, the European Parliament voted unanimously to recognize ISIS's atrocities against Christians as genocide.  When will the U.S. do the same?       Sign and Share our critical legal letter to Secretary of State John Kerry to demand immediate action: @webpagelink"},{"comment_id":"10154251408229726","commenter_b":"Shave her head and tar and feather her!","commenter_a":"You gotta love how this whole event has been mis characterized by the libs. If you can afford the home-- mortgage it shouldn't matter what the value may rise or drop to. The libs set people up to fail by simply forcing lenders to lend. Then you have an angry hypocrite like this creep ignore facts just to throw a dart. One day these stupid politicians are going to realize they are helping Trump.","post_message":"Massachusetts senator blasts businessman for making money, but she omits her own house-flipping past."},{"comment_id":"1038152239553568","commenter_b":"She is dumb","commenter_a":"Guess she will have to work for a living now","post_message":"This model lost everything."},{"comment_id":"10156358709930725","commenter_b":"She's deserves to rot in hell.","commenter_a":"Allie Stoltenberg @username","post_message":"Police are investigating a pet owner after a Facebook post of her dog muzzled with duct tape went viral ----> @webpagelink"},{"comment_id":"935435836504943","commenter_b":"Mexicans dont pose much of a threat like ISIS refugees picked a wrong time to come over","commenter_a":"The Federal government cant property vet any of these refugees because there are no records on any of them! Hickenlooper is putting Colorado communities at risk as well as the Federal Government! 26 States as of today have refused to take any. Less States mean more refugees per State. Obama wants upwards of 200,000 refugees! If we would have wiped them out early, the world would not be in this position! How many refugees would we receive in your State if only 10, 5 or 2 States allow them? They will migrate to other states and most will go on welfare, food stamps and Obama care, not to mention the cost to educate them or the real cost of American lives from terrorist attacks in our communities! What price do you put on that Mr Speaker!? Hickenlooper as well as the Federal is putting our communities at a security risk ...","post_message":"Our nation has always been welcoming, but we can’t let terrorists take advantage of our compassion. We should not bring Syrian refugees into this country unless we can be 100 percent confident that they are not here to do us harm."}]
