[{"comment_id":"10153247991679342","commenter_b":"Abortion is good. They should abort all babies born before the mother is 25","commenter_a":"here we go, 'all these people worried about worms in the water and nobody cares that planned parenthood is selling dead babies!'","post_message":"One woman said she first noticed the worms yesterday in her bathtub and after collecting a few, she heard neighbors found the same thing.   @webpagelink"},{"comment_id":"10154874338494641","commenter_b":"Make the wall will be turist attraction !! Turist will puy a lot for walking on the wall-))) US ern on it, every hotel and restaurant and gifts shops","commenter_a":"Una traduzione bizzarra","post_message":"The move would break a key campaign promise when Donald J. Trump repeatedly said he would force Mexico to pay for the construction of the wall along the border"},{"comment_id":"10152963504506130","commenter_b":"What was she thinking? Dumb model!","commenter_a":"Well they can't fire her now that the world is laughing at it. PR, people, PR.","post_message":"Whoops."},{"comment_id":"10155889196645354","commenter_b":"Trump that bitch!","commenter_a":"She has more wrinkles than my nuts. Americans are dumb enough to vote this tramp in.","post_message":"Short memory!"},{"comment_id":"1266650310018983","commenter_b":"'@username so a WOMAN RAPED HAS MENTAL DEPRESSION FROM THE INCIDENT CANNOT NOW BUY A GUN TO FEEL SAFE AND ALL THIS WITHOUT A JUDGE OR DUE PROCESS???","commenter_a":"Meh, I'm glad he's trying something, anything to try and save one child. Better than 7 years of NRA owned congress not even acknowledging the Sandy Hook children. I'm a responsible gun owner that likes the idea of strong background checks and licensed gun dealers.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10157399464465093","commenter_b":"A hun will never kill anyone! Its the people that use them! People kill people! Criminals get them illegally and you can't stop that! It is not possible! Give me a reason why you think criminals should only have guns?","commenter_a":"Yes but 100% of gun crimes involve guns, so start with the legal gun owners because it's way easier, and it looks like we're doing something.","post_message":"Pass it on."},{"comment_id":"10152691502210927","commenter_b":"I agree they are just like his kids - Brats who think they deserve everything on a silver platter.....Put them back on the top of train cars headed for Central America","commenter_a":"Y r yall so against latinos/ mexicans last i checked they were here n mingled with natives b4 many of urs ancestors, when did they push, steal, lie, march families out of their lands","post_message":"Illegal aliens are just like our kids according to Obama."}]
