[{"comment_id":"1189361681104302","commenter_b":"@username--you are right, she is a troll","commenter_a":"actually he voted for Ovomit","post_message":"These are the dangerous consequences of Donald Trump's hate speech."},{"comment_id":"10158083946035206","commenter_b":"Then clean your ears out!","commenter_a":"Can someone please tell me what the heck Trump stands for because to this day i haven't heard anything positive come from out of his mouth.","post_message":"Donald J. Trump supporters describe why it's sometimes hard to be for Trump. @webpagelink"},{"comment_id":"10153034727835667","commenter_b":"Wtf she's ugly and weird","commenter_a":"Linzee Kay @username","post_message":"Miss Piggy will not be pleased."},{"comment_id":"10152817094974877","commenter_b":"I agree zimmerman was guilty as -ell. But this woman is even more guilty if you research her case. I feel sorry for the next man she meets. She'll kill the next one for sure.","commenter_a":"This is crap! This woman should be allowed to live her life....she didn't take a life...meanwhile George Zimmerman roams free! This is why it is important, people, to vote - local elections affect you more than national elections....VOTE, VOTE, VOTE!","post_message":"Marissa Alexander is officially a free woman, delivers powerful statement to reporters. Read the details of her release below.  Grio fam, will Alexander's case inspire more changes to Florida law?"},{"comment_id":"10155238822815579","commenter_b":"In 2016 he US allowed 38,901 Muslim refugees also 37521 Christian refugees.","commenter_a":"In a practical sense, Obama had a ban against middle eastern christians. He seemed pleased they were being made victims of genocide, instead.","post_message":"President Trump: \"World Is A Mess & Angry\" - AGREE or DISAGREE?"},{"comment_id":"10153780693499071","commenter_b":"Nina Puspita","commenter_a":"They look for kindred spirits of greed, just ask Hillary.","post_message":"Here's what Goldman Sachs looks for in a résumé."},{"comment_id":"1383799158379801","commenter_b":"I hate that little bitch","commenter_a":"Omg I can't stand her, I saw her the first time (and the only time) on one American news network, I guess she's not on there anymore. Good, she's awful, she's uneducated, and that voice omg....id rather jam an ice pick in my temple than listen to her.....who decided she had a brain or talent was sorely mistaken......oy.......","post_message":"Your move, Tomi Lahren!  Video by Occupy Democrats, LIKE our page for more!"}]
