[{"comment_id":"10152831511530496","commenter_b":"She is ugly","commenter_a":"While we understand that there are various strong opinions on this topic, we ask that everyone express them with in a respectful manner. Memes and inappropriate comments will be blocked from view. Those posting slurs or otherwise offensive comments will have their posting access to our Facebook page blocked.","post_message":"Caitlyn Jenner, the Olympic athlete formerly known as Bruce, makes her debut as a transgender woman, posing in a swimsuit on the cover of Vanity Fair. Take a look: @webpagelink"},{"comment_id":"10156062936845354","commenter_b":"Thugs","commenter_a":"Im in SA and just yesterday in Point rd Durban, my freind Gregory who is 69 yrs old was attacked by young foreigners with sticks and badlly injured. I am an ex policeman and I am ashamed of this assosiation. Our police are useless, I WILL TELL THEM FACE TO FACE if I have to. Warning to anyone in authority: IF NOTHING IS DONE TO REPATRIATE CRIMINAL FOREIGNERS FROM OUR COUNTRY IMMEDIATLEY. I WIIL CALL ON ALL WHITES TO START FORMING VIGILANTE GANGS. THE BALLS IN YOUR COURT, GET RID OF THE FOREIGNERS AND THE CRIMINAL ELEMENT.","post_message":"The vicious blow to the senior citizen comes around the :11 second mark."},{"comment_id":"10153289871647894","commenter_b":"Lol","commenter_a":"Somebody tried to get with daddy.....lmao!","post_message":"‘Married to Medicine’ Star Dr. Heavenly Accused of Trying to Run Over Her Neighbor with Her Car"},{"comment_id":"10154090150895329","commenter_b":"OMFG she's such a bitch...","commenter_a":"@username STRUGGLE SO REAL","post_message":"\"I will bleed on everything you love.\""},{"comment_id":"1357815300916697","commenter_b":"LOSER. MOVE ALONG NOW!!!","commenter_a":"Made this myself fits them perfectly","post_message":"Stein planned to make an announcement about the Pennsylvania recount Monday outside the Trump Tower in New York."},{"comment_id":"1220005224782920","commenter_b":"She was a fucking stripper! Yeah, real class!!!","commenter_a":"Yes, what a wonderful change. And so does Mellania - what a classy First Lady we have!","post_message":"ClashDaily.com"},{"comment_id":"1033268563393975","commenter_b":"Build the wall already and gas up the coaches to take the illegals home!","commenter_a":"Scumbag democrats and other illegal scumbags.","post_message":"PROTEST TURNS VIOLENT OUTSIDE TRUMP RALLY: \"There won't be no United States without Mexicans.\" [Video]"}]
