[{"comment_id":"825939240815639","commenter_b":"Us as well!!!!! IF people do not want the AMERICAN FLAG, THEY SHOULD GET THEIR BEHINDS OUT OF AMERICA......PERIOD!!!!!!! Jo","commenter_a":"Fidiots, this is America, the laws they are SUPPOSED to enforce are AMERICAN laws. I'm so tired of the constant assault on my flag and my country.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154305700931729","commenter_b":"'@username STFU you aussie pussy","commenter_a":"God (the real God) does not require one to pray a certain number of times. He's willing to listen at any time!","post_message":"Well, they probably won't do THAT again."},{"comment_id":"820665888078295","commenter_b":"Silly woman","commenter_a":"Wtf? Isn't non schooling illegal (and 5... That's stupid... once they are on solids why breastfeed?)","post_message":"Neither of her kids can read as she refuses to let them go to a mainstream school."},{"comment_id":"1000833706595553","commenter_b":"Too bad we can't deport people who desecrate our flag, but hey, this is America and they have rights! Too bad they can't send these idiots to live in Iran, North Korea or Russia!! Let them try that there and they'll find themselves in front of a firing squad!","commenter_a":"They would","post_message":"Obama's America  Air Force Veteran arrested at Valdosta State University trying to stop Black Power group from desecrating American Flag."},{"comment_id":"10154225245793483","commenter_b":"Wtf is wrong with this woman. She needs to be arrested for abuse. I take care of elderly people and this is despicable!!","commenter_a":"That's disgusting. Has she been arrested?","post_message":"A 94-year-old woman was supposed to be taken care of by a home health care provider. But she was screamed at and even hit by the woman.  'I told you stop feeding that dog human food,' the worker screamed at the 94-year-old woman. FOUL LANGUAGE WARNING FULL STORY --> @webpagelink"},{"comment_id":"177307306103129","commenter_b":"Wrong! Never said in his first 30 days","commenter_a":"Didn't he defeat ISIS already? He said he would in his first 30 days.","post_message":"Join us as President Donald J. Trump delivers the Weekly Address."},{"comment_id":"10153289541199614","commenter_b":"Thank God he blessed me! Don't gotta do that","commenter_a":"stupid is has stupid does! Forstes Gump","post_message":"A concerning new trend on social media shows young women trying to imitate the big-lipped pout of 17-year-old reality TV star Kylie Jenner of the Kardashian family.  The so-called #KylieJennerChallenge requires suctioning one lips into a shot glass or bottle. Some young women are ending up with painful bruises, photos on Instagram and Twitter show.  The challenge could result in injuries to nerves, muscles and trauma to the blood vessels, a plastic surgeon says.  Read KTLA's story here: @webpagelink"}]
