[{"comment_id":"1607924772836368","commenter_b":"Yes young lady you can , just don't lie to the FBI , don't help rapist do 10 months for raping a 12 year old, don't stay with a man who had many affairs. There Are many women who can be great presidents , Hillary just isn't one.","commenter_a":"Not if you win Hillary! I fear that your election might irrevocably tarnish the idea of female presidency... Bear in mind of course, that we have to deal with a reality where people automatically stereotype and generalise...","post_message":""},{"comment_id":"10155050203774369","commenter_b":"It wouldn't have meant a thing if Hillary didn't lie to the congressional hearing. She's the one that committed perjury and gave Russia the opportunity. .","commenter_a":"All I can say if they didn't have anything to hide, why so angry?","post_message":"The 2016 U.S. election was NOT the first to be the object of \"malicious cyber activity,\" Barack Obama said."},{"comment_id":"10152861965631130","commenter_b":"Is that the END OF YOUR BULLSHIT?? Nothing to do with illegal immigrants. Whooping Cough outbreaks happening ALL over the world. The bacteria is mutating in two ways: one strain of bacteria lacks the primary protein used in the vaccines; the other strain has new proteins. These are found in Europe, Japan and elsewhere @webpagelink","commenter_a":"Vaccines can force the bacteria to mutate, did you know that? 100,000 Americans have gotten whooping cough in the last three years. 32 babies have died. C.D.C. scientists speculate that the current vaccine may be helping to drive the bugs’ evolution. “The fact that this happened so quickly, to the proportions we’re seeing now, clearly suggests some selective pressures …. Vaccine pressure is probably one of them. @webpagelink","post_message":"\"I believe in trusting doctors, not know-it-alls.\""},{"comment_id":"10154909768331509","commenter_b":"The World knows Obama and Hillary have failed us.","commenter_a":"Trump might use be them, but Hillary will email them to someone..","post_message":"The U.S. president has the power to order a nuclear strike anywhere in the world at any moment -- so choose your next leader carefully, America. (via CNN Opinion)"},{"comment_id":"10153201550225329","commenter_b":"I agree she thought she untied the cloak and when they pulled she realized it was not untied so it was a mistake and I doubted anyone will get blamed for it.","commenter_a":"Because of my job, I saw the Brit Awards here in the US. What people DID NOT SEE (unless you live in the UK) is the fact that she did her entire performance. She may not have been able to dance to the best of her ability because of what happened, but she made it throughout the end.","post_message":"Poor Madonna"},{"comment_id":"10154211754086509","commenter_b":"Immigration, no; Illegal invasion, yes!!!","commenter_a":"I get that people are against immigration. But some of these comments go to show how Inhumane people are. Sickening. (Since people don't know how to read and have messaged me ugly things saying how I should take them in...I'm going to state that I agree with immigration restrictions but I do not agree with having them DROWNED or KILLED.) Jeez.","post_message":"A Polish teacher asked students to calculate how many Syrian refugees had to be thrown overboard for a boat to stay afloat and reach Greece."},{"comment_id":"1027250217329982","commenter_b":"Samantha please do me a favor you sound like and intelligent young lady .HERE GOES LOOK AT SOCIALISUM IN SOUTH AMERICA THE People ARE STARVING LIVING LIKE RATS AND THE BIG BOYS ARE TAKING THE MONEY 85 percent TAXATION SAME CRAP IN CANADA AND THEY WILL SWARE ITS THE GREATEST FREEDOM AND FREE MARKETS ARE THE ONLY WAY NOT CONTROL","commenter_a":"Every state should have open primaries. Pretty disappointed in my state of NY. So many people can't vote because of this.","post_message":""}]
