[{"comment_id":"878303132360263","commenter_b":"Just like your whore mother.","commenter_a":"That's no lady. It's a MAN !!","post_message":"Here's the ugly truth about MOOCHELLE. This is disgusting. Do you think Michelle is the worst first lady in history? Comment 'yes' or 'no'!"},{"comment_id":"10153719523799138","commenter_b":"What is,wrong w people???? If they have,an \"urge\" can't they have,any self control! !! Haven't people heard of video surveillance? ? Makes me wonder what else they've done that hasn't been detected...","commenter_a":"It's too bad that the media gets a hold of these stories and everybody believes them. That's not to say it didn't happen. Some children do lie about these things.","post_message":"The teaching assistant has been taken into police custody and is no longer an employee at St. Louis Park Public Schools."},{"comment_id":"1747275395512005","commenter_b":"@username if it isn't Mr. Trump YOU will be voting in Hillary","commenter_a":"The only thing that needs to change is HIM OUT OF THE WHITE HOUSE.","post_message":"Obama says \"we\" need to pray for the \"strength to change.\" It's yet another of his disgusting refusals to acknowledge the realities we face."},{"comment_id":"10152558711931770","commenter_b":"When was the last time the Climate beheaded, butchers and burned to death with gas someone?","commenter_a":"what a goof","post_message":"The president compares climate change with ISIS..."},{"comment_id":"370852156623268","commenter_b":"It appears that She doesn\"t know how to do anything. Maybe she can pole dance or do hoing!!!!","commenter_a":"Guevona!","post_message":"She hasn't done anything..."},{"comment_id":"1034492959948582","commenter_b":"Strike one for Bernie. This has been well refuted many times over. Besides the feminists will vote for Hillary only for the fact she is a woman.","commenter_a":"All you brogressives claiming the wage gap doesn't exist don't deserve to have Bernie as your president.","post_message":"Women are making 79 cents on the dollar compared to men. For women of color it's even worse. African American women earn just 63 cents for every dollar a white male earns, while the figure for Hispanic women is just 54 cents. That's nothing but sexism and discrimination."},{"comment_id":"394396457415315","commenter_b":"Muslim women why do you want to stay somewhere your notttttttt wantedddddddd !!!!!!!!!!!","commenter_a":"There was nothing wrong with America until THEY came here to destroy everything we have worked so hard for!!! She and eveyone like her needs to go back where they came from!!","post_message":"“You Are Everything That is Wrong in America”"}]
