[{"comment_id":"716457901822319","commenter_b":"You the ugly one!","commenter_a":"She know she UgMo...lol..","post_message":"Isn't this a great response when they questioned Serena about her beauty?"},{"comment_id":"10153186979634411","commenter_b":"Also, Gustav, there is a Palestine. There is a squatter on its land that usurped the Biblical name \"Israel.\"","commenter_a":"Um, Europe is crowded. If one million of any group left, it would be good for Europe. It doesn't matter who.","post_message":"'I think out of 3mn Jews living in Europe at least 1mn will leave and it will be a disaster'"},{"comment_id":"10155194763231178","commenter_b":"why r these liberal women ,so f-in ugly?","commenter_a":"Just another hypocrite.","post_message":"The New York Times reporter smeared the Tea Party as racist a few years ago.... now she's urging the left to start copying it."},{"comment_id":"844173412298350","commenter_b":"She's a witch!","commenter_a":"And she is a pig!","post_message":"NEW unpublished audio recordings of Clinton Foundation head Donna Shalala privately expressing concerns about Bill and Hillary Clinton’s mental state."},{"comment_id":"981038348622309","commenter_b":"All the prostitutes brainless Repugnicans were born from a cow. Have no brains no soul no dignity full of hate and hipocersy and a aberration against women . Why ? Their mothers are cows.","commenter_a":"Why do Ryan's wife and daughters stay with a man who has nothing but loathing for their gender? Can they not exert any influence over him? If THEY cannot, will he listen to anyone that opposes his point of view? I seriously hope his daughters are never raped, never need the assistance of Panned the Parenthood. He can evoke \"Family Leave\" and I am sure he will still receive full pay - pay that is provided by taxpayers who he wants to deny \"paid family leave\". He will also work against Social Security and Medicare, but when he retires I believe he will gladly accept it. Can his man be any further from someone we want to represent our interests in Congress? He has no interest in representing us. He has NO integrity.","post_message":"Examine his voting record and you’ll find Ryan to be anything but a representative of the American people. Especially when it comes to female Americans."},{"comment_id":"1159189937449759","commenter_b":"WHAT DOES THE OBAMAS AND CLINTONS HAVE TO HIDE FROM THE VOTERS. THEY ALL REMIND ME OF ALI BABA AND THE 40 THIEVES BUNCH OF CRIMINALS DON'T TRUST ANY OF THE CROOKS.","commenter_a":"Gee, funny they can tell who hacked emails showing Democratic corruption but, they have not had any luck finding Hillarys missing 30,000 emails.","post_message":"Whoa!"},{"comment_id":"10154596759964166","commenter_b":"Only applies to men though... Women can murder their babies. Just ask killery","commenter_a":"What is \"feticide\" ?","post_message":"JUST IN: The man accused of killing a pregnant teacher and dumping her body has bonded out of jail. His bond was set at $500,000."}]
