[{"comment_id":"10153648565856320","commenter_b":"Gather them up like cattle. Send them to Iran or where ever and let them find isis","commenter_a":"Just stop with the protests and move on. If they only knew how ridiculous they look continuing to honor a criminal.","post_message":" recent acts of violence will not be tolerated in a community that has worked so tirelessly over the last year to rebuild and become stronger. - St. Louis County Executive Steve Stenger State of Emergency issued in St. Louis County, Mo., as they prepare for a second night of protests in Ferguson. More Details: @webpagelink"},{"comment_id":"10153840747221336","commenter_b":"Let every congressman in Washington put up 10 \"refugees\" each in their own homes. The White House could take care of at least 100 of them. Just keep them out of our towns and cities.","commenter_a":"\"Stupid is as stupid does.\" - Forrest Gump","post_message":"On Monday, Governor Greg Abbott announced that he sent a letter to President Barack Obama saying that Texas will not take any Syrian refugees in light of the Paris attacks."},{"comment_id":"953377128015374","commenter_b":"Should if ate a snickers","commenter_a":"Of course it has gone viral.","post_message":"A 21-year-old was charged with beating her so-called friend unconscious over a hamburger. (Graphic warning: Video includes fight)>> kiro.tv/HamburgerBeating “I’m more hurt emotionally than physically.\""},{"comment_id":"1312277812121210","commenter_b":"If AMERICANS don't put a stop to this ANTI American travesty NOW, IT WILL BECOME harder to stop from behind when more tragedies are hitting us from all sides!","commenter_a":"Sanctuary Cities will become Brussels in the next 10 years.","post_message":"If you're gonna openly allow people to emigrate to your country who are not going to assimilate -- and we have been doing that. We have not been requiring assimilation. That's a stark difference between the immigration of today and the immigration prior to 1986."},{"comment_id":"10154104100243132","commenter_b":"#2. he likes ugly chicks","commenter_a":"Just be happy... The beginnings are the best!","post_message":"New year, new romance for Amy Schumer!"},{"comment_id":"1097322517004941","commenter_b":"#LockHerUp","commenter_a":"Hillary Clinton is a Criminal, who should be in prison, not running for office!","post_message":"\"I think my whole life has been about handling pressure. I think I have a great temperament for winning, 'cause I know how to win.\" Donald J. Trump argued that in comparison, Hillary Clinton is \"a loser\" who \"doesn't know how to win.\""},{"comment_id":"986959091402697","commenter_b":"Your wife?","commenter_a":"Twat","post_message":"The poll shows a 10.7 point lead among likely voters over Trump."}]
