[{"comment_id":"1793905347490203","commenter_b":"Plus she is nasty and disgusting","commenter_a":"This young lady is very talented, but she has no clue what this country is all about. It happens when you grow up with the world revolving around you. She has no idea what she supports! Or Who!","post_message":"Miley Cyrus is begging people to vote for Hillary Clinton"},{"comment_id":"10153101680026336","commenter_b":"Muslim Terrorist","commenter_a":"Andreas Lubitz is not a muslim but a terrorist","post_message":"LATEST: #Germanwings co-pilot Andreas Lubitz appears to have kept evidence of an illness from his employers, including a doctor’s note excusing him from work the day he crashed an Airbus A320 into the French Alps, prosecutors said. @webpagelink"},{"comment_id":"629211877227588","commenter_b":"If you were born to an married father who was a citizen of the US, I'm pretty sure you're a natural born american, until and unless you and/or your parents renounce it.","commenter_a":"Being a naturalized citizen is not the same as being a natural BORN citizen. I'm a naturalized citizen, born in the UK to a British mother and an American father. I am not a natural born citizen and would not be eligible to run for President. How did he ever get in this race to begin with?","post_message":"It's like a circular firing squad!"},{"comment_id":"1170909956275538","commenter_b":"This women is a trashy slut","commenter_a":"So I guess there is no point here. Don't waste my time.","post_message":"\"Look, people are only voting for Donald Trump, most of his supporters are only voting for him because he’s a white guy. And frankly, if he were a woman, or if he were, I don’t know, let’s pick, Latino, Muslim, any of the groups that he’s stoked hatred amongst his supporters, if he were any of those, I don’t think he’d be getting support either.\""},{"comment_id":"404730193048608","commenter_b":"Go back to your own country and suck off your own people!!!! Get out!!","commenter_a":"How about dog food it has no bacon in it.","post_message":"This group wants a low price halal food shelf..."},{"comment_id":"1203821629704699","commenter_b":"@username anybody can suck dick! It takes a real woman to recive the education that Michelle Obama obtained. Only because shes black? You mad cuz a black first lady has done what your mother couldn't do for this country! PLEASE! Haven't you heard in the news? Melania Trump won't even set foot in The White House. HAHAHAHAHAHAHAHA. and FYI! I mastered 3 foreign languages.","commenter_a":"Is she still ashamed to live in America? Where's MELANIA!!!!!","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"10153294741338984","commenter_b":"California idiots are the cause of the decline of morals! Create a safe haven for idiots called Cali weirdness!","commenter_a":"Everyone knows that Parker","post_message":"DEVASTATING! In his own words, Obama proves time and again he's a calculating liar. Will you join millions of other Americans in demanding Obama be impeached?"}]
