[{"comment_id":"10153950458738690","commenter_b":"Actually another problem is that we have a long border with Afghanistan which is called Durand Line and Afghanistan does not accept it as an International Border and those terrorists move in between both countries and attack and then we blame to each others.","commenter_a":"This the same Pakistan my country Nigeria, training army to fight terrorism, have Pakistan already solved there Taliban terrorist? Terrorist are political party, negotiations is the solution to terrorism.","post_message":"At least 12 dead as suicide bomber on a motorbike crashes into government office."},{"comment_id":"10154860386705470","commenter_b":"So why are you flocking to America?","commenter_a":"Of course we should. We should also stop doing drugs, selling drugs, prostitution, eating high cholesterol. What kind of a story is this. No one is advocating hate crimes and there are more hate crimes in India from Hindus and Muslims than almost anywhere else in the world.","post_message":"It’s been a long day for Srinivas Kuchibhotla’s widow, his coworkers at Garmin, those in his home country of India, members of the Olathe community, and those with Indian heritage who live in the US.  “Even though that guy was talking so discriminately about his race, he was still minding his own business... He did not deserve a death like this.\""},{"comment_id":"10152658308576680","commenter_b":"I don't know why your playing around with her. You need a special prosecutor ,this way she needs to comply or go to jail.","commenter_a":"WHY!!!??? SO she can try to hide more stuff??","post_message":"The House Committee on Benghazi has given Hillary Clinton an additional two weeks to respond to a subpoena asking for her private emails on Libya and the 2012 terrorist attacks."},{"comment_id":"694737757326072","commenter_b":"Unemployment is down because you can't get it silly woman.","commenter_a":"That's all of ya dumbass president who ya voted for should've just kept the house republican","post_message":"WHAT?!??!!?"},{"comment_id":"10152969085332623","commenter_b":"Lock up your wives.","commenter_a":"Filling out that trophy case.needs that one for the set!lol","post_message":"Tiger Woods has entered to play in next week's Wyndham Championship in Greensboro:"},{"comment_id":"641559742659462","commenter_b":"This woman is either a complete idiot or a pure propagandist.","commenter_a":"Oh how people forget that gore won the votes of the people","post_message":"\"Not since the American Revolution has the ruling class tried so hard and so blatantly to take away our vote.\" – Judge Jeanine Pirro @webpagelink"},{"comment_id":"1749284951998475","commenter_b":"I love this","commenter_a":"@username @username me in second year","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"}]
