[{"comment_id":"1028272853931448","commenter_b":"She wasn't even twerking she was just bn silly joking like she was. Pull up her dress with spanks under Neath......its really not a big deal. If Obama get mad about that he shitty.","commenter_a":"Carlos Aden Carlyle lol","post_message":""},{"comment_id":"1020710211322060","commenter_b":"Alexcea Erini Apostolakis bod","commenter_a":"I think the poor girl should be left alone","post_message":"The birthday festivities never end for Kylie Jenner (via Daily Mail Celebrity)"},{"comment_id":"757206074401067","commenter_b":"Go suck off another jihadi, Dilosh asshoIe.","commenter_a":"How can you go into someone else's land. Occupy it, then claim self defence when a 16 year old kid attacks. Isn't he the one doing self defence since its you that on his land?","post_message":""},{"comment_id":"10152564778122623","commenter_b":"What I don't understand is why would anyone want to follow her? Congratulations you got video of her stopping and starting over and over, all the while you are driving in wet conditions with one hand, with a child in the car??? Plus this crazy lady could have gotten out WITH a gun and killed the woman driving and the child. People need to just let road raged people go. Just pull off to another road or whatever, get a tag number and call 911. Leave it to the authorities. She should be thankful for her life.","commenter_a":"I'm glad the nut case was turned in and charged.","post_message":"It's the video everyone is talking about. The woman recorded in a terrifying road rage incident in Randleman has been charged."},{"comment_id":"812987998844624","commenter_b":"Bra,panty,stockings,make up are part of a woman's world We want to look presentable when we go out ....not look like a beat up gf or wife","commenter_a":"The husband is so sweet ,im sure he bought perfume and other toiletries for her","post_message":"The husband was helping his wife choose a makeup color that matched her skin tone. He helped her find the color and kissed her on the forehead, according to Love What Matters."},{"comment_id":"10153344405883984","commenter_b":"what more does this witch have to do before they put her where she belongs, PRISON!!!!!!!","commenter_a":"Hillary's political career ended with her departure from the State Department as far as I'm concerned. She's never been a vialble candidate for that office.","post_message":"I don't see any way Hillary can escape from this one. She's probably kicking herself right about now... Do you hope this ends Hillary's presidential chances?"},{"comment_id":"1076188252391484","commenter_b":"body slammed my ass this little cunt held on to the desk causing it to fall over with her nasty ass in it!!!! and now we'll have a litany about the evil whitey cop from some negro lawyer and welfare mama.","commenter_a":"Quick make a judgement before the facts come out.","post_message":"Student body-slammed by South Carolina officer"}]
