[{"comment_id":"10154308989386028","commenter_b":"Haha no way","commenter_a":"Screw San Diego all the tight pants wearing hipsters they can keep their f****** team","post_message":"A plan to move the San Diego Chargers to Los Angeles is almost a done deal, multiple sources tell NBC4's FredNBCLA. @webpagelink"},{"comment_id":"470490783141502","commenter_b":"Jail her useless ass dude. Fucking A","commenter_a":"'@username Ha wow.","post_message":"Should All Welfare Abusers Be Arrested?  Comment 'yes' or 'no'."},{"comment_id":"1662896673932550","commenter_b":"Her mom's argument is invalid, he's black, cops would have shot him anyway and by the time they got their clerk would be dead too, good job armed guy! (Y)","commenter_a":"Boo hoo my thug piece of shit waste of air got shot. She wanted him in jail so she didn't have to feed his useless ass.","post_message":"Normally, I would be on the side of the shooter in most cases, but this...?...  @webpagelink"},{"comment_id":"10153859068156955","commenter_b":"Leave the mug and leave her alone.","commenter_a":"She didn't like the interview either, ('Not one bit'). Did they ask Ms Flossie if & when SHE wanted to be interviewed? It was all very awkward. They gave her a station coffee mug (shameful)... Put flowers on her lap that she can't hold... The kicker to me was the opening where the interviewer held up the newspaper RIGHT IN FRONT OF HER FACE!!!! The whole thing was disrespectful.","post_message":"BEST INTERVIEW EVER"},{"comment_id":"1548076978821767","commenter_b":"'@username Illegals are already criminals by definition.","commenter_a":"These liberal are making more and more people want to vote for Trump.","post_message":"Top progressives are terrified the Democrat mob attacks on Americans will send millions of voters running to Trump."},{"comment_id":"1135270439841709","commenter_b":"George is just another Clinton Whore!!!!","commenter_a":"clinton news network at it again","post_message":"Donald Trump destroys the liberal media! (WATCH)"},{"comment_id":"903045683051621","commenter_b":"She embarrassed us once on national TV!!! We good!!","commenter_a":"Ya own kind hate'n why can't we stick together","post_message":"Guess Who Wants To Replace Kelly Osbourne On “Fashion Police”"}]
