[{"comment_id":"1075446135834786","commenter_b":"She's a sell out!","commenter_a":"I don't know who she is. I've seen her before but in what I don't recall. But I really didn't get the joke or whatever it was supposed to be. ...","post_message":"What did you think of Stacey Dash's appearance at the #Oscars? @webpagelink"},{"comment_id":"10154051789570326","commenter_b":"There ARE alternatives for oil. There is NO alternative for clean water.","commenter_a":"Tell it to the people in Arizona . . . How'd you like this coming out of your tap? @webpagelink","post_message":""},{"comment_id":"1325725004111513","commenter_b":"They're both adulterers. Trump cheated on his first 2 wives","commenter_a":"It is actually possible for both to be true: Trump is a conniving, egomanical pig who won't stop at destroying others to get to the White House and Cruz is a lying adulterous pig who would also be a big hypocrite. Sigh. And all of it unfolding on Good Friday. You can't make this stuff up....","post_message":""},{"comment_id":"1225587407484516","commenter_b":"@username @username ca vaut aussi pour les chats bande de cingle !","commenter_a":"Krushank Shah","post_message":"This is why you should stop letting your dog lick your face."},{"comment_id":"10154435373078279","commenter_b":"@username shut the fuck bitch","commenter_a":"Unbelievable. Marissa Alexander gets 20 years behind bars for firing a warning shot at her abuser where no one even got hurt, and the same prosecutor can't get a child-murdering lowlife scumbag like George Zimmerman put away.","post_message":"Angela Corey had been dubbed the \"worst\" and \"cruelest\" prosecutor in the United States."},{"comment_id":"10156336306105354","commenter_b":"She has pretty skin like a white woman, she talks like a low- information angry blue-gum.","commenter_a":"Melissa Harris Perry should be worried about her ideology. She's in the minority.","post_message":"Melissa Harris-Perry: You know what Americans worry about? They worry about their kids and families being terrorized, raped, robbed, and murdered by criminal illegal aliens--people who should have never been in our country in the first place. THAT is what Americans worry about."},{"comment_id":"10152958455739071","commenter_b":"If all the Europe will have lider like her then for sure we would have less problems!","commenter_a":"Made in Germany","post_message":"Angela Merkel is a rarity — she's excelled her entire life."}]
