[{"comment_id":"10153957745968132","commenter_b":"wow pretty stupid its not like the jungle book jeez idiot she should be caged","commenter_a":"Who the hell in the PEOPLE staff is in charge of the facebook page that writes obsurd comments?? What the hell is terrifying about this situation?? Nothing! She was a moron that snuck into a zoo and decided to pet it. She got what was coming to her. Terrifying..would be if it's normal business hours and a tiger came out of its cage.","post_message":"This is so terrifying!"},{"comment_id":"533221760173934","commenter_b":"If this CRAP ever does fly,WE the PEOPLE,aka The Government,aka TAX PAYERS,will be SUED by LEGAL IMMIGRANTS who became CITIZENS for a HEFTY PRICE($650 per or better)wanting their money BACK because these CRIMINALS got in for FREE and remain on the TAX PAYERS TEAT...Check the story on he IRS scandle of earned income tax credit for the illegals collecting on kids(nieces.nephews,kids)IN MEXICO...They are aware(news station expose')& claime it's up to congress to close the \"loopholes\"...","commenter_a":"a vow of silence would be greatly appreciated by all career politicians and family dynasty politics","post_message":"\"The people at the heart of this issue are children, parents, families, DREAMers. They have names, and hopes and dreams that deserve to be respected\" - Hillary Clinton"},{"comment_id":"10153618824494778","commenter_b":"Lol jk","commenter_a":"At least we don't recruit murders us losing having killed anyone can the patriots say that....stfu period.","post_message":"Last summer, #Redskins Daniel Snyder said during an interview that the team was exploring the possibility of a new stadium. Now they're asking season ticket holders for input."},{"comment_id":"10154905567876336","commenter_b":"Ok, time for a bragging rights bet: First, it was \"racist and sexist white males,\" then \"fake news,\" and now the Russians. What do you think next week's excuse is going to be from the Dems as to explain Hillary's loss? Aliens? The cast from Duck Dynasty? My guess is that they will say Trump flew in the Aghori Monks, a modern day Monk Order from India that practices cannibalism, to scour the US and feed on Democratic Voters as to deter turnout.","commenter_a":"She lost because she is implicated in so many lies and scandals nobody has time for that.","post_message":"\"The Russians didn't elect Donald J. Trump. America did.\" Today on \"Cashin' In,\" Eric Bolling slammed anti-Trumpers who are searching for excuses as to why Hillary Clinton lost. @webpagelink"},{"comment_id":"10156217952900725","commenter_b":"Illegals only make it harder for the ones who have done it legal. If I were a legal immagrant I would u of be pissed off about the illegals. It's not an easy process and considering the economy I'm wondering if it's worth it to them to try to come in legally. Especially with the liberals making all these empty promises.","commenter_a":"Like if you are voting trump 2016!!","post_message":"The debate last night proved that Hillary is running against the “B” team. She won’t be so lucky when it comes to me!"},{"comment_id":"1119860174747403","commenter_b":"I don't need friend like that... Whend they go to my home they got everything and more.. and whend I go to they shiet hold I have to wayting.. I don f think so... don't invite me no more.. I got my own park in my house.. .. is my house and I live here. Jajajajaja... fucking IDIOTS...","commenter_a":"Lydia Taylor lol so you 😂😂😂","post_message":"The struggle"},{"comment_id":"10154178335409877","commenter_b":"Well said Jillian. I too believe that BLACKLIVESMATTER! It's not right, it is unacceptable !! We are al the same inside, under the skin of all people. There is only 1 race. The HUMAN RACE, period!! The more that speak out the louder we are!! And I believe this to can CHANGE!","commenter_a":"Enough is enough","post_message":"So, so tired. #TerenceCrutcher"}]
