[{"comment_id":"10153206865573525","commenter_b":"Stfu!","commenter_a":"'Charged' a police officer with a knife ? And she is still alive ? Oh wait, she is WHITE !","post_message":"HOUSE OF KNIVES: Here's a look at what deputies confiscated from a Hernando County woman's home after she charged at an officer with a knife. Thousands of knives and other weapons, along with fake severed limbs and fake skulls. MORE: @webpagelink"},{"comment_id":"936764406358981","commenter_b":"what tits. he was smelling her fart","commenter_a":"\"Joe stop staring at my tits, thanks.\" ~ Hillary","post_message":"Can you imagine? Talk about our country going to hell in a handbasket…"},{"comment_id":"10153720190262894","commenter_b":"She'll always be a ghetto bitch from Chicago","commenter_a":"Read this shit @username gold diggin bitch","post_message":"Wiz Khalifa and Amber Rose Finalize Their Divorce, Hit the Strip Club Together [Video]"},{"comment_id":"10153648874092060","commenter_b":"You made Nola.com Michelle!","commenter_a":"Tammy, we should have gone to target last night instead!","post_message":"Metairie Target shoppers got a little help with last-minute Father's Day shopping last night from a special guest – New Orleans Saints Quarterback Drew Brees."},{"comment_id":"10155143556313701","commenter_b":"Watch and you might learn something. @webpagelink","commenter_a":"The woman left behind her child in a hostile environment so she could save her own skin just to turn around and blame Trump's temporary travel ban as why her reunion with her child got delayed. Talk about one selfish mother.","post_message":"While in the vetting process a Somali refugee, named Sahara, gave birth to her son. Children are not automatically approved to travel, though, so she left her son with her mother in Uganda to speed up the process."},{"comment_id":"10153894151651782","commenter_b":"So if people have an issue with racism in this country they should leave?? How dumb","commenter_a":"I'd make sure they get no government grants or assistance! Way to keep division strong!","post_message":"A Massachusetts college says it will remove the American flag from its campus: @webpagelink"},{"comment_id":"10153825929880399","commenter_b":"Domestic Terrorists","commenter_a":"Let's say Trump gets defeated; narrowly or by wide margins, makes no difference. Will his supporters begrudgingly acknowledge defeat in the public forum of a democratic vote? Will they accept hat their ideas and policies, such as they are, are not accepted by the majority of their fellow citizens? I don't believe they will. And what then? Will they turn to other methods to advance political ideas that cannot be achieved through conventional democratic means? And what will we call them then...?","post_message":"Josh Marshall \"You can say all sorts of things about these folks being crazy, or extremists or whatever else. But set aside all these evaluative or partisan interpretations and one thing is fairly clear in objective terms: a large portion of the GOP is not satisfied with what can realistically be achieved by conventional political means.\""}]
