[{"comment_id":"10155392185178352","commenter_b":"'@username she still immigrant . She come in visa and hurry married for papers like any other person.","commenter_a":"He better deport his wife too","post_message":"It's open season on illegal immigrants: Trump declares that ANYONE in the US illegally can be deported, regardless of whether they've committed a crime"},{"comment_id":"806051249493483","commenter_b":"Republicans....","commenter_a":"What flipping IDIOT would vote for this nut","post_message":"He leads his closest competitor by 11 percentage points."},{"comment_id":"10154379213963812","commenter_b":"Go back to Europe. Lol","commenter_a":"Go TRUMP build the wal!! Deport illegal all of em Ban muslims Lets make america great again! !!","post_message":"Donald J. Trump announced on Good Morning America that he 'probably will take small contributions.'"},{"comment_id":"567943360046309","commenter_b":"How did you get where you are if that is true and by the way lady, the last time I checked the White House was occupied by a Black Family !Stop feeling sorry for yourself ! Get therapy and get over yourself !","commenter_a":"When hate is all you got to sell","post_message":"“This country was founded on racism and sexism, point blank.'"},{"comment_id":"10154271863249071","commenter_b":"China! China ! Chiana!","commenter_a":"Lorenzo","post_message":"Alibaba.com founder Jack Ma meets with Donald J. Trump."},{"comment_id":"1058824504164459","commenter_b":"'@username are they in mexico legally? if they aren't, they'd be in a mexican jail. if they are. then go after your gvt for not preventing the assaults. the fact is this.. ILLEGAL entry to any country, including mexico, is against the LAW. Mexico has enforced their law and the US MUST TOO. That means a wall since mexican cartels have made another business out of smuggling people into the us and those who can't pay the cartels, find a different way. Mexico didn't like it when Guatemala did it to them and we don't like it here either.","commenter_a":"Mexico has the largest border wall on earth bordering Guatemala to the south in order to protect it from the violence and to protect its mexican culture. It shows the historically true nature of mexican politics since Maximilian was executed. Nothing in mexico is good for America at this time. We dont need there people drugs or crime.","post_message":"'Suicide bombings in Israel went from 1,000 a year to zero a year once they put that fence up.'  Yesterday, Mike Huckabee spoke to Uma Pemmaraju about walls, using Israel as an example of why they work."},{"comment_id":"557366464412130","commenter_b":"She's anti-woman.","commenter_a":"and, an eyesore.","post_message":"Carly Fiorina is gaining in the polls because Trump gave her his attention in a tweet. Now Republicans are claiming she supports women's rights."}]
