[{"comment_id":"10154283827397014","commenter_b":"Milita Military Milita Military those two words don't sound the same","commenter_a":"A collection of dudes with short man complex playing army man and pretending to be \"patriots\"....awwwwwww, you guys run along and have fun now, don't get anyone or yourselves killed","post_message":"The group said they'll vow to protect the Second Amendment, even under Trump."},{"comment_id":"10153646092561167","commenter_b":"Liberals hate women!!!","commenter_a":"If Megyn Kelly didn't have her looks and her little fued with the Donald to capitalize on she'd be a non issue.","post_message":"Can everyone finally stop pretending Megyn Kelly is any kind of “hard-hitting journalist”?"},{"comment_id":"10154712423493812","commenter_b":"Oh goody. The racist, sexist, xenophobe will meet the corrupt, mass murderer President of Mexico if he wins.","commenter_a":"To do what? Give him the bill for the wall?","post_message":"Donald J. Trump says, if he's elected, he would meet with Mexico's President Enrique Peña Nieto. Last week, Pres. Nieto said he'd meet with Trump, despite previously comparing him to Hitler and Mussolini."},{"comment_id":"10152567053540927","commenter_b":"Rice did the same thing with her emails. Is she evil too?","commenter_a":"She is one evil person.","post_message":"They're taking her own staff's word for what could possibly have been a major national security risk!?!"},{"comment_id":"10153805659416167","commenter_b":"For some reason I don't find the position of first lady (as you put it) as important as President. He cheated on his wife, maybe you've never done that, but there's many people ou t there who have cheated on their significant others. Not saying it's right of course, but the other presidential candidate cheated on his wife(s) also and I know the Republican's like to compare other political people when they're accused of something. Look at Trumps wife and her past. Do you really think she should be living in the White House? She's not even from America. Not that I think that's a good enough reason, but I know how you Republicans feel about immigrants. If you look at the naked pictures of her you may also feel she doesn't belong in the White House for that reason. Not that I think that's a good enough reason, but ...","commenter_a":"IMAGINE if you can...a useless, disgusting, nasty, corrupt, rapist, POS perverted woman abuser as our 1st Lady...Billy the perverted Clinton!!!","post_message":"Good grief. Uhh Joe why are you just mentioning this now?"},{"comment_id":"1175628809124795","commenter_b":"Geena -_- those jerks","commenter_a":"Leave it to the u.s to ruin this cool idea!","post_message":"Why are people such assholes?!"},{"comment_id":"10154184705448525","commenter_b":"Yes, she meant for the child to nearly be injured. It was totally on purpose! What a horrible, horrible mother! We should prevent her from ever reproducing again! Period!!!!!!","commenter_a":"That is not considered an accident!!! That is carelessness and neglect of protecting your child. Plain and simple truth. Period!!!!","post_message":"IT ONLY TAKES A SECOND: This big brother is a hero after racing across the room and catching his baby brother as he falls from the changing table! Their mother hopes this will serve as a reminder to others to remain vigilant - always. Read more: @webpagelink"}]
