[{"comment_id":"10155117976876002","commenter_b":"Lets do a story on bum tenants....thats where it is","commenter_a":"Hanks a tool lol","post_message":"Help Me Hank: Landlord's secret launches investigation (Full story: @webpagelink"},{"comment_id":"968324823259627","commenter_b":"Bitch please","commenter_a":"This is ridiculous! Trump can beat Hillary or Bernie with one arm tied behind his back. America has made their choice. No more corrupt, lying, manipulative, smooth talking politicians. We want our country back! We have a real shot with Trump, and we're not going to be tricked any more.","post_message":"“Let me be clear on one thing tonight. This campaign is just beginning,” Bernie Sanders said. “When we come together, and don't let people like Donald Trump try to divide us, we can create an economy that works for all of us and not just the top 1 percent.\""},{"comment_id":"10153938743204087","commenter_b":"Karma is a Bitch!!! #NEVERHILLARY #STILLSANDERS #JILLNOTSHILL. #DEMEXIT","commenter_a":"And Bernie wants us to support her boss Hillary.","post_message":"DNC chairwoman Debbie Wasserman Schultz referred to Bernie Sanders' campaign manager as \"scummy\" and a \"damn liar\" in a leaked email published on Friday by Wikileaks."},{"comment_id":"876831439029591","commenter_b":"She needs to be fired because she should have done her job and not entertained the situation. She should have ignored the customer and sat her butt down.","commenter_a":"She needs to be fired.","post_message":"A woman caught on camera head-butting another woman at a Walmart says she has no regrets. The fight took place after the woman says she received poor customer service from a tax preparer: @webpagelink"},{"comment_id":"10154453619319030","commenter_b":"@username @username @username Kirsten Kolch Don't call her a bitch, but BUY YO BITCH SOME CHOCOLATE!!!","commenter_a":"Ching Lee Susan Ngo lmao so this is where I heard period sync","post_message":"Key & Peele is gonna teach you dudes something at Menstruation Orientation.  Watch the full episode: @webpagelink"},{"comment_id":"10153982489146438","commenter_b":"talentless racist bitch","commenter_a":"talentless bitch","post_message":"It's an incredible visual album, but how is it as an aural album?"},{"comment_id":"1760155984214134","commenter_b":"she makes money that way she is a media whore","commenter_a":"She is worse then a racist, bigot she hates whites and everything whites stand for. It the view comes on a channel any place I am at I change the channel I will not watch a racist show that she is on","post_message":"Whoopi Goldberg Insults TV Host For Being White, See What Happens Next. She is the biggest hypocrite. What a bigot. Do you think Whoopi is a racist?"}]
