[{"comment_id":"1075179569197597","commenter_b":"Crooked Worthless Hillary for Prison","commenter_a":"You brag about being a grandma on your Facebook page. Why don't you stay at home with your aides? Give your grandkids cookies and milk. America is a great country that influences the world. It needs a strong leader. POTUS is not a position for the weak and feeble.","post_message":"Danny Williams and his wife Leah lost their home after Trump University took advantage of them."},{"comment_id":"10152668576767377","commenter_b":"And Hillary is a broke down bus","commenter_a":"ted needs to take a cruise, maybe to the north pole. maybe, he and santa can go ride a reindeer, and build some toys together.","post_message":"Why Ted Cruz is the Strongest Candidate for President in 2016."},{"comment_id":"684458911714062","commenter_b":"Not this dumbass lady again","commenter_a":"\"Surrogate?\" That's his campaign CHIEF!","post_message":"¯\\\\_(ツ)_/¯"},{"comment_id":"10153880836367994","commenter_b":"EXPELL THE HOE S FOR LIFE , LET THEM WORK THE STREETS","commenter_a":"All I got to say is we need to bring back discipline back in the schools I would of never In a million yrs ever thought about hitting a teacher I think these kids need to b put in jail disgusting how these kids are now a day","post_message":"Those who work at Detroit Public Schools say this was \"teacher baiting\" -- and that this isn't the first time they've seen it happen: @webpagelink"},{"comment_id":"10157094830145354","commenter_b":"@username imagine if all illegals and invaders were deported!","commenter_a":"Will a moat filled with gators and sharks be next? Just make sure the fence has a gate so he can GTFO in a few months.","post_message":""},{"comment_id":"10154399971344087","commenter_b":"@username u one sick bitch","commenter_a":"Obama was basically a community activist turned president. No real domestic and certainly no foreign experience at all. Except maybe he was born in another country. With that said, trump is much better prepared day 1 than obama ever was.","post_message":"\"It is a source of great concern that our country is now in the hands of someone who seems to lack an ability to weigh the consequences of domestic and foreign policy decisions where great risks abound.\""},{"comment_id":"939262232775539","commenter_b":"Hey pam how about I come over and slam you're stupid ass to the ground and throw you across the room, see how you like being manhandled","commenter_a":"No the policeman was right!! No damn respect for anyone any more, just makes me sick!!!!","post_message":"BREAKING NEWS! The cop ASSAULTED a young girl in her South Carolina high school classroom has JUST been FIRED! Do you agree with this decision by his department? Does it change anything? Let us know and help SPREAD THE WORD about the power of #FilmingThePolice! From (Y) Counter Current News - MBD"}]
