[{"comment_id":"10152864140411051","commenter_b":"She should be afraid not to file for divorce!","commenter_a":"Is time that she buys a gun and it will be the last time that he ever hurts her again.","post_message":"A mom was picking up her children from daycare when, all of a sudden – boom."},{"comment_id":"10153903960665329","commenter_b":"Wtf!!! She don't play","commenter_a":"This is hilarious. @username Maria Maldonado","post_message":"#goals"},{"comment_id":"775477502501275","commenter_b":"I agree with Mark Colwell.one muslim won't go against the other.they are all for crap..","commenter_a":"Gee, really, and what would they do if he made them angry? Another Dem moron speaks in defense of her Beloved Leader and what she says is as stupid as they both are. How do these people get through even elementary school being this dumb?","post_message":"And this is what Democrats think about terrorists... #facepalm"},{"comment_id":"10153513194301157","commenter_b":"Sorry kill traders Isis is out to kill innocent people that trader should lie down 6 feet under","commenter_a":"13 year veteran, can't trust anyone anymore!","post_message":"A Washington D.C. Metro Transit Police officer has been charged for trying to provide material support to ISIS."},{"comment_id":"1115117555187217","commenter_b":"Jette de Vries","commenter_a":"Nathalie Baranke","post_message":"If you have a cat you should do this immediately. (Via JukinVideo )"},{"comment_id":"948666735231933","commenter_b":"Wow, no misogyny going on here (heavy sarcasm).","commenter_a":"More from man hating feminist jackasses. Keep your legs shut, or demand the guy who stick his dick in you wears a condom. Not that complicated.","post_message":"Patients would also be required to get counseling on celibacy as a valid life choice."},{"comment_id":"10153477026528352","commenter_b":"She should be buried under the jail,","commenter_a":"She's a LOSER.... There's no copping out of the fact that SHE murdered her kids.. Whether dad was around or not is irrelevant.. Plenty of women like myself are single moms and we aren't doing crazy shit like this","post_message":"Mother in court for ‘killing two of her kids and putting them in freezer’ has to be removed after flying into a rage over their absent father"}]
