[{"comment_id":"10154347399052045","commenter_b":"@username well those kids shouldn't be causing trouble then no incident would have to end up like that. Just go school then go home then trouble won't follow you, like the old saying if you walk like a duck, talk like a duck, act like a duck then you're a duck... don't hang out with ignorant bad apple kids just be smart about it...","commenter_a":"These people ars out protesting, these 2 teenage kids that assaulted an off duty police officer. And because of one of these kids comes up from behind and hits this officer while holding his friend by the shirt he pulls out his gun and fires it into the ground, NOT INTO THE AIR, people protest. If these kids got the butt handed to them in there home growing up they wouldnt be out in the streets causing problems. The kids r lucky they dont have a bullet wound in the A $$","post_message":"Protesters in Anaheim are blocking streets to demonstrate against an off-duty LAPD officer's confrontation with a teen in which he fired his gun. @webpagelink"},{"comment_id":"1452044741482218","commenter_b":"You need to put down your crack pipe that crap has fried your brain; dumb witch","commenter_a":"Democrats r a bunch if liars ..republicans are honest and classy","post_message":"\"I knew Ronald Reagan. I worked for Ronald Reagan. Donald Trump, you are no Ronald Reagan.\"  -Republican Doug Elmets says he's voting for a Democrat for the first time in 40 years.  More: @webpagelink"},{"comment_id":"10154219980731336","commenter_b":"Oh well....","commenter_a":"Aww. Poor things. I'm sure daddy will throw money at someone to make it happen.","post_message":"“They feel very guilty, but it’s fine.”   Donald J. Trump spoke to 'Fox & Friends' about his children Ivanka and Eric not registering to vote in the New York primary. Plus, hear what he said about choosing Ivanka Trump for VP."},{"comment_id":"1197370603617282","commenter_b":"Larissa Elliot","commenter_a":"Amy Batchelor","post_message":"An attempt to reproduce 100 psychology studies published in leading journals couldn't match the results in almost two thirds of cases."},{"comment_id":"10153876506189726","commenter_b":"Alas, McCain's time as a politician has lasted too long--- in fact, it was too long the day he took office.","commenter_a":"Tell McCain to shut up","post_message":"WATCH: John McCain Has Doubts About Ted Cruz's Citizenship"},{"comment_id":"525854287602864","commenter_b":"Send them all back to whatever country they come from. America has no room and not enough air for any of them. They are poisoning our good air.","commenter_a":"Why should he care she is a rent a kid not even his.","post_message":"Malia Obama at Center of Damming New White House Scandal"},{"comment_id":"493850430805537","commenter_b":"Shut Her Down !","commenter_a":"They spend money that is not theirs and should be made to pay it back.","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"}]
