[{"comment_id":"1242359992482301","commenter_b":"@username I know, I'm just saying. Course, they could always do what those nutters in that Ukrainian training video do.","commenter_a":"That's great and everything, but it's a whole different thing when there's bullets and shit coming back AT you. Paper doesn't fire back...","post_message":"See more training and combat at > Afghanistan Combat Footage - Funker530 CONTACT FRONT! ~Josh"},{"comment_id":"10154879829717178","commenter_b":"They are not moving anywhere. Btw transgender is not a protected class.","commenter_a":"BOA is in talks to move it's headquarters out of Charlotte because of the discrimination law. Way to go State Politicians.","post_message":"House Bill 2 has just about everything an editorial cartoonist could want: a well-known story, controversy, key players to lampoon, and toilets. Story >> wral.com/@username"},{"comment_id":"950976811609844","commenter_b":"Yes!!! Although these women should be considered normal size and healthy... Definitely not 'plus size'... Sick of all the labelling... How 'bout healthy, happy and active?!","commenter_a":"I don't care what anyone else thinks. I think she looks great. But I think the more important question is \"How does her personality, intelligence, etc. compare with her looks?\"","post_message":"So excited for The Official Ashley Graham Fan Page, the first \"plus-size\" model to have an ad in Sports Illustrated! AND for Robyn Lawley, who's the first \"plus-size\" Swimsuit Issue model! Here's why that's so exciting."},{"comment_id":"10154457609673812","commenter_b":"#RIP @MuhammadAli #MuhammadAli #TheGreatest @webpagelink","commenter_a":"RIP and praying for your family","post_message":"BREAKING: Boxing legend Muhammad Ali has passed away at age 74, according to family spokesperson. @webpagelink"},{"comment_id":"118155238703506","commenter_b":"Yes, to bad they are ruining a great state. It's going to take more than Hollywood to support the illegals. Have fun, I'm gone","commenter_a":"Hell yesss goodbye","post_message":"There could be 49 states of America very soon. It's only a matter of time. Good riddance. Do you think we would be better without those libs?"},{"comment_id":"1016582615062710","commenter_b":"I bet her tits are as ugly as her face. Just sayin.","commenter_a":"You are absolutely the dumbest white woman I have ever seen.","post_message":"Another day, another crazy comment from the View crew."},{"comment_id":"10153271978657411","commenter_b":"White trash.","commenter_a":"I don't really care.","post_message":"HAPPY BIRTHDAY, #FLOTUS! First Lady Michelle Obama is celebrating her 52nd birthday today!"}]
