[{"comment_id":"638227583024858","commenter_b":"They were all womanizers.","commenter_a":"President Lincoln: \"...that government of the people, by the people, for the people, shall not perish from the earth.\" President Kennedy: \"...Ask not what your country can do for you.\" Dr.Martin Luther King Jr. \"....one day we will be judged not by the color of our skin but by the content of our character.\" Donald Trump: \"...Grab 'em by the p***y\"","post_message":"Watch a Republican CNN commentator call on Trump to step down after tape was released of him explaining how to sexually assault women: \"He is a pig, he is vile. This is consistent behavior by him...He is not fit to be the Republican nominee. He is not fit to be called a man.\""},{"comment_id":"960118844029903","commenter_b":"Umar hayat, do u know people are injected with relegion, so they r blind what happent to u , u r a muslim and should not speak like this. See irain is only state which helps palsitane , a sunni state but our Arab the grand state of muslims is quite , wht does that mean. Leave blindness and b a responsible muslim","commenter_a":"which islamic republic ? Iran is a shia majoosi state dont use the name of islam with a sheetani state","post_message":"The Iranian president says the Islamic Republic will firmly deal with any acts of aggression: @webpagelink"},{"comment_id":"562038433961848","commenter_b":"Melissa Jayawardane","commenter_a":"Point is that this 'triad' is nothing special: we are given a pseudo-statement.","post_message":"Machiavellianism, narcissism, and psychopathy. Where do you rank?"},{"comment_id":"1089539017791300","commenter_b":"Hillary belongs in jail! Do your job Congress.","commenter_a":"I would think about why she dosen't answer the question","post_message":"This state rep took a huge stand against Hillary and even called her out at one of her rallies.  But the rep had no idea what she had gotten herself into.  Now she says she carries a gun because of what Hillary's goons have done to her."},{"comment_id":"1059208864172624","commenter_b":"Sounds just like a female lol","commenter_a":"Obviously. Ignorance is bliss? But when will they see who he really is. A narcissistic sociopath. Will to nuke anyone who hurt his little feelings","post_message":"\"People who support Donald J. Trump are people who should be respected for how they feel, but I worry that they don't understand that they're being scammed. And that they're being scammed by someone who's really good at it.\"  - Mika Brzezinski, co-host of Morning Joe"},{"comment_id":"689912921147432","commenter_b":"The left is aligned with the most pathetic in society!","commenter_a":"Very bad Photoshop ! Are you serious?","post_message":"This is really creepy. Look how close he is?"},{"comment_id":"944282629025715","commenter_b":"Yes","commenter_a":"Yes absolutely","post_message":"Yes!"}]
