[{"comment_id":"10153434124594032","commenter_b":"@username illegals aren't just Mexican stop being ignorant.","commenter_a":"I'm on the fence about this, the immigrants being lazy living off the state should be taken back. BUT the hard workers doing what they can taking care of their families should not be bothered!!!","post_message":"#BREAKING: The deportation operation by U.S. Immigration and Customs Enforcement would begin as soon as next month, the report said. UPDATE: DHS plan to raid Central American immigrants draws criticism. Details: @webpagelink"},{"comment_id":"767530393325420","commenter_b":"If employers are fined and punished who hire illegals and no welfare benefits were given to illegals, they'd have no incentive to be in the US and they go home..","commenter_a":"Senate Democrats need to stop being obstructionists!!! Keep up the good work Congressman.","post_message":"If Senate Democrats aren't happy with the House-passed #DHS funding bill, then they should allow debate & amendments-- that is how our government is supposed to work. I fear that Senate Democrats are playing politics with America's national security in an effort to protect the President's unconstitutional #executiveaction and to protect themselves from having to go on the record with their pro-#amnesty positions. #DontShutDownOurSecurity"},{"comment_id":"10153015286404641","commenter_b":"Check out dis video @webpagelink","commenter_a":"Pls. friends click the link and like the photo of cedrick he's good and intelligent student he doesn't have money for his college. your like is to help for his scholarship and share to your friends .. we really need ur help .. just click the Link below .. Please Like Candidate #1 .. Thank you po .. :-) @webpagelink","post_message":"Nigerian voters refuse to be silent in wake of election delays @webpagelink"},{"comment_id":"10153714763793132","commenter_b":"I seriously dislike this arrogant woman who will not be kind to Shannon, she's stupid not to learn from the others. She's annoying...","commenter_a":"The color is BLUE!!!!","post_message":"The Real Housewives of Orange County star made a beautiful gesture."},{"comment_id":"497217833799843","commenter_b":"American does not need to bring any of them here. They need to return to their country and fight for it.","commenter_a":"some dumb asses do not see it..as I say only welcome children and women....period...send those men back and tell them to fight for their country......those are ISIS men....they do anything to get in the civilized countries and take over.....wakw up people","post_message":"Can you see the BIG difference?"},{"comment_id":"1563613390592441","commenter_b":"fucking bitch","commenter_a":"Let the parents kick the bitch with steel toe shoes in the head","post_message":"This woman should be in jail!"},{"comment_id":"983273481708073","commenter_b":"She's just a lying skank!","commenter_a":"You need to be investigated from the beginning to the end","post_message":"You know Hillary is in trouble when her fellow Democrats stop protecting her!"}]
