[{"comment_id":"10153322373749087","commenter_b":"Ladies, don't embarrass yourselves....you got your asses kicked in both elections. ;)","commenter_a":"Well vote for the Republicans so they can make you feel more comfortable by taking you back to that time.","post_message":"Sister Souljah on Hillary Clinton: “She reminds me too much of the slave plantation white wife of the white ‘master.’ She talks down to people [and] is condescending and pandering. She even talked down to the commander in chief, President Barack Obama, while she was under his command.\""},{"comment_id":"10153427905081051","commenter_b":"stupid woman I hope she gets in big trouble .People like her don't need pets .They are a big part of the family","commenter_a":"GOOD! SHE NEEDS TO BE IN TROUBLE!","post_message":"Friends and family took one look at this woman's Facebook update and immediately called the police."},{"comment_id":"10154914956884411","commenter_b":"Agree! The protesters should just chill out, given everything we know about Trump, let's all PRETEND that this will be a normal president or let Murphy's law take its course!","commenter_a":"If you are an American, he is your president. Doesn't matter if you like him or not. I didn't want Hillary, however if she won, I would have still considered her my president. People need to grow up.","post_message":" is our chance to show the world that Donald Trump is not California president and that we are going to take direct action to defend our values, preserve our way of life, and protect our people."},{"comment_id":"1117171088374939","commenter_b":"Amen","commenter_a":"Sir where have you been to be so incredibly deceived?","post_message":"Live from the MGM Grand Las Vegas lazy river pool: Dana Perino and Chris Stirewalt record their pre-debate podcast, \"I'll Tell You What.\" #debates"},{"comment_id":"10152982438537217","commenter_b":"Hooray! Now show me the first 4 corpses of native Indians killed by the illegal immigrants from Eng And.","commenter_a":"Bet the Native Americans are over the moon about this! #genocide","post_message":"They were four of the first English men to colonise America"},{"comment_id":"10152942568911636","commenter_b":"She has to Post some Nudes on the Internet for the People to Comment about Her Sexuality! :D","commenter_a":"I love yo voice","post_message":"Michelle Rodriguez praises Cara Delevigne"},{"comment_id":"10152950210572169","commenter_b":"Clearly this woman lost her remote control long ago","commenter_a":"I will be glad when he is gone","post_message":"Saying goodnight to stupid pet tricks, top 10 lists and David Letterman (From PBS NewsHour)"}]
