[{"comment_id":"10152887029056336","commenter_b":"The yatahays are the illegals!!!","commenter_a":"We're all immigrant, except the native Indians.","post_message":"JUST IN: In a 237-190 vote, the House has voted to overturn President Obama's executive actions on immigration that extended protections to millions of people in the US illegally. @webpagelink"},{"comment_id":"10152858693731336","commenter_b":"And those countries don't have 30 million illegals and a lazy spoon feed group like we do either!","commenter_a":"No one had actually spoken to a Canadian. They have to wait in hallways for a room. They go to Mexico for medicine and dental. So how is it better. Trust me I have dealt with a lot of them who come to the US to get care. This information comes from the Canadians themselves because they purchase travelers insurance from various American Insurance Co so they can come here. If you have not lived in Canada don't talk about their healthcare you don't know about it.","post_message":"What could a Republican alternative to ObamaCare look like? “We could try freedom for a while,” Sen. Rand Paul said."},{"comment_id":"10154992215446729","commenter_b":"Stephanie Hallstrom Hillary is from Chicago.....send her back there. They grew her. They can keep her.","commenter_a":"You can see her jerking several times prior to falling / collapsing. Clearly from a seizure people know the difference. She should stop her thirst for greed and power and live her life and take care of herself in the private sector for herself and the American People. It was not weather people were there saw others in worse health and heavier clothing...she came out wearing same clothes as before. She is not well. Go Home Hillary!!","post_message":"Help get this out there, folks! People need to know the TRUTH."},{"comment_id":"10152767581187061","commenter_b":"Big deal. She is and always will be a pedophile","commenter_a":"She taught him in second grade??!!! How outrageous is that??!! And what about her 4 children that she already had? Not a word about them!! So wrong!!!","post_message":"Mary and Vili are still together and about to celebrate their 10th wedding anniversary. Their 2 daughters are now older than Vili when the affair started: @webpagelink"},{"comment_id":"788324967967350","commenter_b":"When all is over and you. Round up the clowns for arrest make sure you get this bimbo she cared nothing about any of us","commenter_a":"I agree idiocy speaks for itself.","post_message":"I can't believe this.....I knew they were stupid but stupid and dangerous?!? COME ON."},{"comment_id":"10152848964136051","commenter_b":"Hang the little bastards.","commenter_a":"I know @username 😞","post_message":"First these teens attacked an 87-year-old woman. Then they raped her. And then they poured bleach down her throat."},{"comment_id":"10153127710904726","commenter_b":"This woman is as stupid as she is ugly!","commenter_a":"Brilliant question.","post_message":"WATCH: State Department is called out: Why Have Russian Hackers Seen More Emails Than American Public?"}]
