[{"comment_id":"752518631516293","commenter_b":"AND YOU WANT AFRICAN-AMERICANS TO VOTE FOR TRUMP???? I PROBABLY TAUGHT YOU TO READ AND WRITE....LOL","commenter_a":"Who are you to say who is an american citizen? Were your parents born in AMERICA!....You defrauded all your workers to get rich!","post_message":"What I would do on my first day in office. #MakeAmericaGreatAgain  Text TRUMP to 88022 to join the #TrumpTrain"},{"comment_id":"1673236709627945","commenter_b":"I can't stand this big eared liar!","commenter_a":"Bull crap! You say that federal background checks don't work when it relates to gun control but when it relates to checking refugees you say it does so apparently it only works when you are telling the public lies to get what you want = pitiful","post_message":"\"Any refugee coming to the United States, some of them victims of terrorism themselves, will continue to get the most intensive scrutiny of any arrival.\"  After meeting with his national security team, President Barack Obama said that \"our intelligence and counterterrorism professionals do not have any specific and credible information about an attack on the homeland,\" but that \"we have to be vigilant.\""},{"comment_id":"10153080996873717","commenter_b":"Although I could actually care less about this flag, to call her a hero is a complete joke.","commenter_a":"I love how wmur calls the person who stole the flag an \"activist\" but not an extremist","post_message":"An activist removes the Confederate battle flag from the grounds of the state Capitol in South Carolina early Saturday morning. @webpagelink"},{"comment_id":"10154490901549062","commenter_b":"She has that privilege","commenter_a":"Well at least she looks happy.","post_message":"The Drug Enforcement Agency has confirmed that a woman arrested for allegedly selling drugs in College Station is the daughter of a DEA agent."},{"comment_id":"10153587762999087","commenter_b":"She's above the law.","commenter_a":"Bloody Hell , Hillar-ious Hellary should have been an evil stand up comedian..","post_message":"Hillary Clinton on dropping out of the race if indicted: \"Oh for goodness, that is not going to happen. I'm not even answering that question.\" #DemDebate"},{"comment_id":"10152859650389877","commenter_b":"Girl, bye.","commenter_a":"It looks like there's another sign that says \"Down\" so, I'm hoping the other sign, which we can't see, says with... Would spell out \"Down With White Power\". I'm curious to know what the colors of the other team are?","post_message":"High school students flash 'white power' signs at basketball game. Read what happened next below.   Grio fam, what should the punishment be 4 this ignorance? #soundoff"},{"comment_id":"10153304044791336","commenter_b":"Hope they show up in mine, I'll send them to hell.","commenter_a":"Please study these faces they could turn up in your neighborhood","post_message":"The five Taliban leaders traded a year ago for Sgt. Bowe Bergdahl could be free to travel as early as Monday as the terms of their supervised release are set to expire."}]
