[{"comment_id":"10154308942676336","commenter_b":"Build the wall screw the Mexicans","commenter_a":"no need to .. i mean their ignorant puppet master says it all the time :P","post_message":"The student said he wanted to do something \"provocative\" to protest restrictions on freedom of speech and didn't realize until later that the phrase held such a strong, threatening connotation."},{"comment_id":"10153069061709342","commenter_b":"Has She wore it all year? Then it would of been out of respect and not show","commenter_a":"Let her wear it!!!!","post_message":"A Native American high school senior is fighting for her right to wear an eagle feather with her cap and gown. She says its about respecting her heritage. School officials call it decoration."},{"comment_id":"717743675080590","commenter_b":"shes an ugly cunt that smells of camel piss","commenter_a":"Who is she ? Shariah ! Who's she? @username David A Doran","post_message":"FINALLY, We are taking back our country from the entitled Muslims that Obama let do whatever they want and try to tell us what to do!! SHARE if you agree that Sharia Law should NEVER be allowed in America!!!"},{"comment_id":"964264026942026","commenter_b":"I luv u tooo bitch","commenter_a":"That is fucked Up... But so entertaining...","post_message":"Details → @webpagelink Police The Police (Y)"},{"comment_id":"1160749183945110","commenter_b":"Lol, the next president will be Hillary!","commenter_a":"One of candidate from these group will be the next president of United of America. The name of that candidate is ......................... ?","post_message":"Here's what some of the candidates have been up to."},{"comment_id":"1035305006509971","commenter_b":"No woman should be a republican if they are smart..","commenter_a":"Young Republicans whyyyyyyyyy!!!!!!!!!!! Is any woman a republican?????????","post_message":"\"this young woman’s death serves a purpose. She 'Took one for the team.'”"},{"comment_id":"10152653934397169","commenter_b":"A woman should never lose her chic!","commenter_a":"Go girl!","post_message":"Part of a growing trend of older fashion icons:"}]
