[{"comment_id":"10152961247876680","commenter_b":"That's you and your crowd... Dead and cut up babies sold for the meat market !","commenter_a":"I proudly stand with Planned Parenthood.","post_message":"The move dramatically increases the chances of a government shutdown fight in the fall."},{"comment_id":"817688164952017","commenter_b":"Chesimard is a scum pig who needs to be extradited back to NJ to finish her punishment.","commenter_a":"And they wonder why there is racism in American. They are the worst and the rest of us are reacting to this sort of crap and the disproportionate numbers of black's in prison. Clean up your own house first and quit committing crimes and we might actually start to listen. Until then FY.","post_message":"[Video] INSANE LIST OF DEMANDS BY BLACK COLLEGE STUDENTS Includes Naming College Hall After Notorious Cop Killer"},{"comment_id":"10153828694670779","commenter_b":"So was Hillary's. But don't see you bitching about her. Oh that's right, you're for her, lol. They both suck! And war is coming. Hope you all are ready!","commenter_a":"Poor Frump supporters. At least they have the right temperament. :-D","post_message":"Donald J. Trump's debate conduct is destined to become a future candidate-training video of what not to do. The man dismissed as the most ignorant, uncivil and unprepared major-party candidate in history could not have conducted himself more poorly."},{"comment_id":"1099350153419328","commenter_b":"Wtf😱 she's going to be a double hoe😜","commenter_a":"Madisan","post_message":"A YouTube star recently revealed that she was born with two vaginas. Check out the interview here:"},{"comment_id":"1315765065158489","commenter_b":"I think.. Mexico already knows where the border is...start shooting.... enough said!","commenter_a":"Mr. Trump - take down that wall !!!","post_message":"Pres. Donald J. Trump wants to pay for his proposed wall by slapping a 20 percent tax on imports from Mexico. Do you think the tax is a good idea?"},{"comment_id":"10153247018494087","commenter_b":"Bad cars cause people to die so do the bad guns!","commenter_a":"Yes it is Donald! The libs are too stupid to realize it! Look at Chicago, the more gun control, the more shootings.","post_message":"“The gun laws have nothing to do with this,” Donald J. Trump said. “This isn't guns, this is about really mental illness. And I feel very strongly about it.\""},{"comment_id":"1757028301196802","commenter_b":"@username more than likely you are a illegal alien .","commenter_a":"Just the thought of having a mother/grandmother in the highest office..refreshing! Go Hillary! Have a great day with your wonderful family!","post_message":"Happy Mother's Day to Charlotte's mom, and my wonderful daughter, Chelsea Clinton."}]
