[{"comment_id":"1146539692060530","commenter_b":"I have 3 son's and from the time they were little my husband and I taught them to never hit a girl told them to walk away from them,they never ran into a situation where happened, but I got to say if a girl( and I'm using this term lightly) ever hit one of my son's like she is going after this guy ,I probably would tell them if they act like man treat them like man this girl talks and act's like a guy!!","commenter_a":"Never hit a woman. Period. Walk or run to get away, but don't hit her. File a suit, get her charged, don't strike a female. Unless she's trying to kill you. Then do what you have to.","post_message":"WATCH THIS BEFORE DINNER AND ... discuss with your son. 16M video views. Wild stuff."},{"comment_id":"1480804778605937","commenter_b":"FEAR-MONGERING ULTRA-RIGHT FASCISTS!","commenter_a":"Well, there's this...@webpagelink","post_message":"Washington State Republican Party chair Susan Hutchison​ is holding a news conference after the Washington state attorney general announced a lawsuit against President Donald Trump over the immigration executive order. >> kiro.tv/WASuesTrump"},{"comment_id":"10153414254384203","commenter_b":"50 cent throws like a girl... Lol. Might as well back one.","commenter_a":"That's the only way he can get his name out without dissing someone...","post_message":"\"Hillary was the president already once. You know what I sayin?\""},{"comment_id":"10153395040141336","commenter_b":"Because she and her mother are bible thumping morality pushing hypocrites. That's why.","commenter_a":"Why is it Bristol Palin gets pregnant and the liberals trash her, YET are proud of all the welfare momma's who have a half dozen kids, with several different donor dads, at the taxpayers expense? Bristol supports herself.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child.  “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"335857396538054","commenter_b":"There is no climate change that is your agenda","commenter_a":"Does this arrogant, smug, condescending community organizer and failed President REALLY want to compare resumes with the Donald? More evidence of how delusional he is and how stupid he thinks we all are.","post_message":"“I think foreign observers are troubled by some of the rhetoric that’s been taking place in these Republican primaries and Republican debates. I don’t think it’s restricted, by the way, to Mr. Trump.”  During a press conference earlier today, President Barack Obama slammed Donald J. Trump and other GOP presidential candidates while continuing to tout climate change. @webpagelink"},{"comment_id":"184666305270788","commenter_b":"This stupid woman is probably senile!","commenter_a":"Another lying liberal...we should be surprised?","post_message":"Wow! She didn't think we would find this letter!!"},{"comment_id":"916716405122968","commenter_b":"@username your name says it all!","commenter_a":"someone needs to mention the senior citizens in this country. We have not had a COLA raise for two years. BS. We might be old, but WE VOTE!","post_message":"Miners have one last shot in this election - the coal industry will be nonexistent if Crooked Hillary Clinton wins the presidency this fall. It is time to MAKE AMERICA GREAT AGAIN!"}]
