[{"comment_id":"1345530805539970","commenter_b":"@username again you also admitted to being a bitch so....","commenter_a":"It's funny that all these bad ass, gun toting, 2nd amendment conservatives seem to have no problem becoming Russia's bitch","post_message":"LOL! Thanks to Andy Borowitz for this helpful advice for Trump..."},{"comment_id":"10153451761433701","commenter_b":"That is NOT a tranny yo gooF! WOWO!! how do you not know a drag queen when you see one.. and btw... he would knock you out for identifying him inappropriately. so your surround sound is broken Debbie","commenter_a":"Seriously posting this in that manner is bullying. Wild interview? About to go viral? More like a compassionate individual & who cares what she looks like or which way she swings.","post_message":"It's a story about a bad crash in Mississippi, but the animated eye witness is stealing the spotlight. This is one wild interview that's about to go viral. Take a look"},{"comment_id":"10152739505691028","commenter_b":"YEAH!!CONSEQUENCES!!! Let's round up all the Muslims and throw them in camps and just gas them!!!! Because that works out so well for society,you know.","commenter_a":"If they are not savages, what are they then - klilling innocent people? There should be consequences for this!","post_message":"\"Statements like these cause mistrust and fear of Islam and Muslims. It is unbecoming of a public elected official to issue such bigoted statements.\" @webpagelink"},{"comment_id":"10152899469751130","commenter_b":"Women tearing women down. This is why we can never have nice things.","commenter_a":"The face and stance totally remind me of the gorillas at the zoo lol.","post_message":"Do not f**k with Ronda."},{"comment_id":"10154133402331770","commenter_b":"She needs to pull up her big girl panties,get over herself,go sit in a corner an SHUT UP!!!!","commenter_a":"she must have a lot of pull huh? Get of your bandwagon and properly take care of your children why don't you.","post_message":"Should Obama declare martial law and prevent Trump from being president \"UNTIL TRUMP IS 'CLEARED' OF ALL CHARGES\" as Rosie O'Donnell argues?"},{"comment_id":"10154713029439411","commenter_b":"Good on her. If only she had a shot gun or military rifle she may have got the others too.","commenter_a":"Looks good on him and them. These three losers garner no sympathy from me. Karma has been served.","post_message":"They picked the wrong house"},{"comment_id":"10153524199539641","commenter_b":"because most of them came here for money, and they are imigrants who are using the situation,not the real war refugees - the real war refugees would be happy just to be in a safe UE country,without demanding to get to the richest countries with the best social care (get money fo free and reproduce like rabbits).","commenter_a":"I'm sure only few of the refugees are children. many are young males and what is with refugees? why won't they stay at hungary? hungary is peaceful nation. i wonder why. hmh","post_message":"Anguish erupts as migrants and refugees are prevented from boarding trains:"}]
