[{"comment_id":"452202411637006","commenter_b":"There here in the us feed them pork to hell with them if they don't want to eat pork go back where they come from keep the. Lunch day she should not of been fired that bull shit vesta","commenter_a":"pork them all!!!!!","post_message":"Lunch Lady Fired For Serving Pork To Muslim Student.  'LIKE' if this is WRONG!!!!!!"},{"comment_id":"10154363651421323","commenter_b":"Irony? He hasn't been right wing, he's been a German-Iranian guy.","commenter_a":"Irony A German born rightwing neo-nazi shots up the place wanting foreigners to get out! Online echo chamber immediately call him an Islamic terrorist immigrant","post_message":"The situation in Munich is still developing. This is what we know so far about the shooting."},{"comment_id":"1086650491355306","commenter_b":"Furthermore: @webpagelink","commenter_a":"the outcome is so sad, I feel sorry for the woman relatives... I believe her suicide was due to the bad treatment she received from police, and that she was extremely emotional about it... nothing will avoid this happening again, but re-training the whole police dptm about the way they treat any ordinary citizens nowadays","post_message":"A Texas trooper who arrested Sandra Bland has been fired after being charged with misdemeanor perjury on suspicion of lying in the arrest report he filed, officials said. Read more: @webpagelink"},{"comment_id":"10153953968561491","commenter_b":"@username: get it right. SAD!","commenter_a":"when in the hell? @username @username","post_message":"\"Trump’s message to young people of color is simple: what do you have to lose? In my young optimistic eyes, after the last eight years of the Obama presidency, there is little left to lose.\""},{"comment_id":"10154775729248812","commenter_b":"Not to mention she has dyed her eyebrows to try to look younger. Won't work. She still looks like she needs a nap.","commenter_a":"They both disgust me","post_message":"Hillary Clinton: “Last night I was ‘grossly generalistic,’ and that's never a good idea.\""},{"comment_id":"1136245463077540","commenter_b":"Amen","commenter_a":"I didn't vote for you the 1st. , or the 2nd. , time! Most all of us True Americans want you out. You, and your Obamanites have done nothing but take America to a all time low!!!","post_message":"YES!"},{"comment_id":"684673561687958","commenter_b":"Your right I will vote female when it's right and it won't be Chelsea Clinton either. MAYBE IVANKA TRUMP.","commenter_a":"I would have no objection voting for a QUALIFIED female for president. However, I will not vote for anyone of any gender, color, or nationality that is a liar, is a thief, etc to run our country further into the ground. This election is not the time to vote for a female president.","post_message":"\"For all you women out there who think that electing a female president will lift us all up, just ask yourselves if electing an African American president lifted up the blacks in this country.\" – Judge Jeanine Pirro @webpagelink"}]
