[{"comment_id":"10155295844155354","commenter_b":"And you should get absolutely NOTHING if you are here illegally.","commenter_a":"If you did not go through the proper legal channels to enter this country, you are illegal and your ass should be deported!","post_message":"NYC's New Illegal Alien ID Program Includes Free Membership to 33 Top NY Venues, Including the Metropolitan Museum of Art."},{"comment_id":"10153551995732217","commenter_b":"Darn foreigners, coming over here putting mosaics under our gardens....","commenter_a":"Claire O'Regan","post_message":"This farmhouse owner was renovating his barn in Wiltshire when he uncovered... a Roman villa built around 200AD 😮 Full story: @webpagelink"},{"comment_id":"947825155333866","commenter_b":"..i got 99 problems but a bitch ain't one","commenter_a":"Wax off wax on Daniel son !!!!","post_message":"This can't be real"},{"comment_id":"10153348176116336","commenter_b":"I agree, some women go buy the biggest bag purse in addition to the over stuffed carry on.","commenter_a":"What they need to do is ENFORCE their rules now! I've seen people get on with HUGE carry ons! Just saying!!","post_message":"Will you buy new luggage if the world's airlines change their carry-on requirements? (via Fox Business)"},{"comment_id":"10152984234114726","commenter_b":"Deport all Muslims!","commenter_a":"Muslims can live in their Muslim lands in the Middle East. Europe must expel these terrorists. Unlike the Nazis, these Islamists will NOT be sent to concentration or death camps. They will be sent to their homes to stop their invasion of other lands. But we must say things that are NOT politically correct and follow those with actions if we are to survive these Islamic horde. Once they have enough power to resist, then it would be too late. Now is the time to deport, expel or arrest them. Now not later.","post_message":"VIDEO: RAW footage from the terrorist attack in Paris!"},{"comment_id":"10153488237764087","commenter_b":"Her looks are irrelevant to the fact that Trump is a punk ass bitch and his supporters leave slime trails.","commenter_a":"I have a challenge for Megyn. How about she show up at the debate wearing ZERO MAKEUP, so she shows her true self and not the all painted up deceptive image of who Megyn Kelly really is. Come on Megyn, quit hiding behind that makeup paint.","post_message":"\"As I've said before, I would rather set myself on fire in front of the Fox News studio than go on the debate stage with [Megyn Kelly],\" Morning Joe's Joe Scarborough said."},{"comment_id":"1736894583244313","commenter_b":"Jenny Fabbri Some of the images leaves much to be desired. Efforts are commended.","commenter_a":"Good, but they cannot do same for migrants?","post_message":"Awww... some amazing footage of a kitten revived by Italian coastguard's kiss of life..."}]
