[{"comment_id":"1203394389723827","commenter_b":"We need to run over them with a truck. They will move.","commenter_a":"I don't think protestors should block any roads or destroy any property. Its says a peaceful assembly, not blocking roads, jumping and climbing on trucks and trashing others property or businesses. If they can't assembly peacefully then they need to be arrested.","post_message":""},{"comment_id":"10152776226595047","commenter_b":"stupid anti Christians !","commenter_a":"Can't let them get away with this.","post_message":"General Craig Olson thanked God for his military successes, and asked for prayer for those being deployed at a National Day of Prayer event. Because of his public declaration of his beliefs, an anti-Christian group is demanding he face a court martial. This is outrageous. SIGN & SHARE the petition to fight back: @webpagelink"},{"comment_id":"371959982974642","commenter_b":"@username, Pelosi sucks!!!!!!!","commenter_a":"Teddy, you little Canadian anchor baby, it's time for you and me to have a little heart to heart talk. Firstly, let's face the facts. The people have spoken and it's Trumps year. Now there's two ways you can go here. You can fight tooth and nail to the bitter end. You'll lose and forever be seen as the jerk who tried to thwart the will of the people. Your political career will be over! Or, you can drop out and get behind Trump. You'll be seen as the man who helped to reunite the party and defeat Hillary Clinton. Play your cards right and you could set yourself up for a top position in the Trump administration. You're a young man Ted. After a successful 8 year Trump presidency, you could be in position to be the natural heir. Remember your hero, Ronald Reagen ran against Ford for the ...","post_message":"LETS MAKE AMERICA GREAT AGAIN!"},{"comment_id":"540816769423579","commenter_b":"Don't run 3rd party now. We would get blamed for a Hillary victory. There may not be much a republican party left in 2020, so that would be the time to start a new party.","commenter_a":"I think we should run a third party candidate now!","post_message":"Should conservatives start a third party? Should they begin one now and put it in place for 2020 or Should they run a candidate now? How would they not be blamed for a Hillary Win? Do you have the stomach for bloody politics to drive the final stake in the heart of Mitch McConnell's corrupt GOP? I have an opinion. I may surprise you. I want to hear Yours. Let's keep the name calling to a minimum let's have an actual debate based on Reason?"},{"comment_id":"10155353294040231","commenter_b":"Your mom is a monkey","commenter_a":"I'm going to leave this right here. #Unapologetic #BlackAgenda @webpagelink","post_message":"Yet another black person has become a hashtag after being killed by a police officer."},{"comment_id":"644827892343831","commenter_b":"If you agree with Mike's comment you're a sexist ignorant shithead. Thanks Mike for demonstrating what sexist assholes think!","commenter_a":"Does anyone know what is considered rape? Rape is one of the most hanus crimes that can be commited. But can anyone really know if rape was commited. Many cases each year happen when 2 people have sex and then the girl just changes her mind and calls it rape. Now i dont know all the details in this case, but maybe this judge knew more than we did.","post_message":"Judge Aaron Persky infamously handed down a sentence of six months jail time to Brock Turner in June."},{"comment_id":"696169153898296","commenter_b":"@username, a new time of patients unable to afford treatment are being kicked out of hospital , letting them stay in the parking lot. Or putting them in a cab, just stranding them anywhere! Has happened many times.","commenter_a":"I had hoped that they would at least do the right thing and replace before they left millions without coverage....plus I read that it's going to cost a huge amount of $$$ to dismantle the Affordable Care Act....I want to know where this is being fiscally responsible????","post_message":"Awful!"}]
