[{"comment_id":"10152881213667894","commenter_b":"Ciara can't sing, same songs to a different beat. She can compare herself to Mya or Ashanti who is and was a bigger artist then Ciara","commenter_a":"Hits yes, talent, no","post_message":"Do You Agree? Ciara Says She’s Had Hits 'Just as Big' as Beyoncé and Rihanna"},{"comment_id":"1088726504494434","commenter_b":"Ni en los concursos de pueblo se ve algo tan bochornoso!","commenter_a":"omg I am huge HARVEY FAN this was a horrible mistake i cant imagine how awful he must feel but thats live TV ...","post_message":"Something very unusual happened at the #MissUniverse pageant tonight...  #MissColombia was incorrectly crowned and she had to relinquish her crown to #MissPhilippines.  Social media has exploded from the result of this: @webpagelink"},{"comment_id":"10154130394501545","commenter_b":"@username I think CNN is giving you false hopes. You might want to turn off the biased media.","commenter_a":"I love how \"news\" organizations report this as news. Headline should read \"Professor got lucky with one correct prediction, and hopes another will come true.\"","post_message":"A professor who has correctly predicted the outcome of every presidential election since 1984 has a new prediction..."},{"comment_id":"10152967718236545","commenter_b":"White male driving.","commenter_a":"He's going 5 miles an hour. 1 car go in front and the rest block him in. This isn't rocket science. I don't think this is that news worthy. Just let us know what happens when it's over. #annoyed","post_message":"UPDATE: From Fort Worth police: Citizens, for your safety, please do not stop to take pictures, stay in your vehicle.  You may want to avoid east bound I-30 in Fort Worth for a while. Traffic is backed up for miles as police are still in a low speed pursuit of a vehicle.   WATCH LIVE: @webpagelink"},{"comment_id":"587883731397342","commenter_b":"Takes one to know one Babs!","commenter_a":"Who cares","post_message":"Barbra Streisand blasted “narcissist” Donald Trump in a 1,228-word Huffington Post op-ed."},{"comment_id":"1317246778287960","commenter_b":"She'd have been funnier if she'd have swallowed her Mic..","commenter_a":"What the he'll is wrong with these mean girls, this country? You don't do that to ANYONE! Not ANYONE EVER! This show allowed this? We teach our children it's wrong, if it was done in school it's called bullying....my God! She should lose her modeling contract!!! Stop this Madness!","post_message":"Gig Hadid threw some serious shade at Melania Trump tonight..."},{"comment_id":"10154884706896729","commenter_b":"She wasn't worthy to be a. Olympican","commenter_a":"Then she gets disqualified and out of the Olympics!!! Send her home!","post_message":"Islamic anti-semitism on full display, folks..."}]
