[{"comment_id":"10151085765109999","commenter_b":"@username, There is an \"illegal alien\" in the penthouse of Trump Tower. She came to this country without a visa but persisted in working illegally until she found a sugar daddy who would marry her out of convenience. ICE needs to go there and interrogate her to determine if her marriage is a sham marriage for legal status or not.","commenter_a":"Let's face it, Trump does not care about Jews or Israel. It is up to Israel to save itself and work on two states solution. It is the only option to maintain a viable democratic Jewish state.","post_message":"\"President Donald J. Trump may be the last man standing between Israel and a complete, self-inflicted disaster,\" Thomas Friedman writes in The New York Times Opinion Section."},{"comment_id":"10154493907103352","commenter_b":"Amen and thank you Lord","commenter_a":"Amen","post_message":""},{"comment_id":"460052980821324","commenter_b":"Put the pussy on the chain-wax","commenter_a":"This headline is complete and utter garbage click bait bullshit. Mumford & Sons had nothing to do with THE CITIES/RESIDENTS. You can't blame a band for the amount of fans they attract, they're grammy award winning musciams coming of a 2 year hiatus after releasng a long awaited album. The city is the problem here for using this \"cleanout method\" which they are literally treating these people, HUMAN BEINGS, like trash and obviously have no problem using terms that state that. Blame the city not the band, oh and actually read the article.","post_message":"Not cool."},{"comment_id":"10153272380601167","commenter_b":"Never trust a liberal woman with three names.","commenter_a":"Obama still has his college records sealed to hide that his grades weren't as good as Bush's.","post_message":"C'mon, conservatives, don't sell yourselves short. You did vet Obama, remember? Obama's a Muslim. Obama was born in Kenya. Obama forged his birth certificate. Obama is the son of Malcolm X. Obama's hiding his gay past!"},{"comment_id":"10153869230258352","commenter_b":"Wtf? The sorry bitch nees LIFE!","commenter_a":"i think life without parole is better","post_message":"Mom who gave her baby methadone ‘to help her sleep’ and killed her will serve up to 30 years in prison"},{"comment_id":"10153114597787507","commenter_b":"I thought women were the snakes","commenter_a":"An old lady told me about 30 years ago: Some men would screw a snake if someone would hold the head. So there you go!","post_message":"Go get em!"},{"comment_id":"859334654119032","commenter_b":"Btw, military grade doesn't always mean what you think it means.","commenter_a":"There is no such thing as an assault rifle. It's a made up term to scare ppl.","post_message":"DEVELOPING - Father of Patient Takes Hostages at Houston Hospital with Rifle   Hoping for a peaceful resolution."}]
