[{"comment_id":"10153353951364726","commenter_b":"She is adorable","commenter_a":"Uh oh!","post_message":"Tigger finds her dinner."},{"comment_id":"1221649794521715","commenter_b":"Thats not how a hoe talks to a pimp literally in this case","commenter_a":"He's just trying to cover his own butt.....","post_message":"The owner of the Nevada brothel where Lamar Odom was found unconscious says Khloe Kardashian's publicist has asked him to stop speaking to the media — a request that made him furious."},{"comment_id":"10156091938520231","commenter_b":"he will hurt New Jersey to get Black woman","commenter_a":"I think they better do it remember what happen at Fort lee Christie did not get his way things was crazy!!!!!!","post_message":"Gov. Christie says Assata Shakur has to \"face justice.\""},{"comment_id":"10154994151726800","commenter_b":"Thinking of spending time at home. On the Galapagos islands with the other tortoises.","commenter_a":"@username dudes face says it ALL!!","post_message":"#LifesAMitch"},{"comment_id":"10156478047465231","commenter_b":"Her lips are gorgeous","commenter_a":"Somebody is jealous of this beautiful lips!!! :* :* :*","post_message":"Some people just don't know how to cope when they see beautiful melanin and full lips."},{"comment_id":"10152941804948869","commenter_b":"Women in bed with marxism again...","commenter_a":"No, the world needs more female rockers...not more critics","post_message":"\"The problem for women is that our role in popular music was codified long ago.\""},{"comment_id":"10155685513649838","commenter_b":"Build a wall or simply arrest business owners for hiring illegals","commenter_a":"Curtail \"illegal\" immigration.,......why is it so hard for liberals to grasp the concept of \"illegal\" ? Great having a \"difference maker\" with a backbone back in the White House.","post_message":"Trump plans to sign an executive order today to direct federal funds to be shifted toward the building of a wall on the southern border, a signature promise of his campaign. He has argued that doing so is vital to gaining control over the illegal flow of immigrants into the United States."}]
