[{"comment_id":"10153596201678984","commenter_b":"Absolutely Support him. He has every right to refuse and shouldn't be forced to preform a same sex marriage if it's against his beliefs!!","commenter_a":"I am supporting the judge who didn't marry the same-sex couple. If gays and lesbians demand justice they also should let those who differ in thought the same right to practice what they believe instead, of trying to force someone to commit something that goes against what they belief..","post_message":"This judge's response has him in hot water. You'll be surprised when you learn his background, then when you see who stepped in for him -- you'll be even more surprised. A totally backwards scenario from what you'd expect... Do you support what this judge did?"},{"comment_id":"10153023573702452","commenter_b":"The bizarre part : Women buy purses but don't want to carry them ?? Who leaves their purse???","commenter_a":"Por pendeja!","post_message":"BIZARRE VIDEO: A thief was caught on surveillance video stealing a purse inside a Philadelphia restaurant - and then dancing away. @webpagelink"},{"comment_id":"10156323895095354","commenter_b":"@username Your not aware of everything that went on or was said. I \"ASSUME\" he told her to GET UP and being Defiant and Arrogant she decided \"I'LL DO WHAT I WANT TO DO\" . She should have STOPPED what she was doing when she was TOLD TO. It was Harsh but perhaps the rest of the Class learned a Lesson. Crap like she pulled Disrupt a Class ands children that WANT to LEARN can't.","commenter_a":"Yes good for the cop, if you do not like this then do what your told to do by the cops.","post_message":"The FBI and DOJ have jumped in..."},{"comment_id":"10152924363976130","commenter_b":"I picture the admin of this page, a fat whiney crazy feminist that hates life because the wine ran out, and because a man opened a door for her.","commenter_a":"How many women believe everything that men tell them?","post_message":"\"Generally speaking, we (men) do not believe things when they're told to us by women.\""},{"comment_id":"908907002538886","commenter_b":"Kool aid Oh Yea...","commenter_a":"Lol I love my president. ✊🏾","post_message":"“Bernie Sanders might run… apparently some folks really want to see a pot-smoking socialist in the White House. We could get a third Obama term after all.” - President Obama at the 2015 White House Correspondents' Dinner"},{"comment_id":"10152907368938525","commenter_b":"wth this world really sucks or should i say the women who dump their babies suck....","commenter_a":"I would probably adopt it too if i could. How sad but beautiful","post_message":"He was heading to work when he made an unexpected discovery."},{"comment_id":"10154514379914657","commenter_b":"And your answer is to just try to talk them out of killing us Nancy. \"Maybe if we're just nice to them, they won't hate us\". Coward","commenter_a":"Stirring up more hate,the Republican way. Your answer to everything is violence.I have never heard so much vile hate in my life. You are horrible human beings.","post_message":"UPDATE: A Paris prosecutor has also confirmed the passport that was found."}]
