[{"comment_id":"1068356466583942","commenter_b":"Chris clown is a pussy ass retard all this motherfucking bitch can do is beat on women","commenter_a":"Asswipe","post_message":"Chris Brown Threatens Trump And The Police: ‘Black People, Go Together 40, 50 Deep’ ⋆ UFP NEWS @webpagelink"},{"comment_id":"1747901745468646","commenter_b":"Do the same to that raghead bitch","commenter_a":"Is this true? If it is, she needs to be on death row!","post_message":"Muslim Nanny Who Beheaded 4 Year Old Girl Will Not Face Murder Trial Because... This is the world we are living in today people. What do you think her punishment should be?"},{"comment_id":"10154655136218984","commenter_b":"Makes you wonder why she's riding in a van! Not very comfortable and certainly not presidential.","commenter_a":"Not a Hillary fan but have you ever tried getting out of one of those van back seats?","post_message":"There's some new footage of Hillary Clinton making the rounds, and it's exactly what her campaign does NOT want America to see. Here's what happened to Hillary when she tried to get out of a van. This confirms a lot of things that we'd feared about the Democrat nominee..."},{"comment_id":"10152578291366636","commenter_b":"But I'm not joking. Why would a western woman live there ?","commenter_a":"A list of things that doesn't offend these clowns needs to be published. How can any intelligent women move to this place?","post_message":"Pakistan is not happy with Imran Khan's new wife..."},{"comment_id":"834219746615367","commenter_b":"It's hard in that situation it would be nice if it worked just that easily but pregnancy is a risk and you or I can't force a women to carry a baby.","commenter_a":"Woman's Rights? What about the fathers rights? I had a fiancee who had an abortion about 25 yrs ago. I didn't even know she was pregnant until after the abortion. She had her friend call and tell me. Then wanted me to pay half of the cost. I as the father I should have had a right in the say so for abortion.","post_message":"Five reasons why Matt Walsh says he is pro-life without exception:"},{"comment_id":"10153372708775950","commenter_b":"Yuck!","commenter_a":"Wahhabism is not about freedom , except the freedom from disbelief in Islamism . Obama loves the Muslim Brotherhood , just like this mosque does . How much Wahhabist / Muslim Brotherhood money is funding Hillary Clinton's campaign ? Since when did Political Islam become a fifth column in American Politics ? Who let them in ? NAIT ( North American Islamic Trust ) is the pass through for Political Islam ( Muslim Brotherhood / Wahhabist ) political activity in America . Islam is both a religion and a political entity .","post_message":"JUST IN: Hillary Clinton won the Iowa caucuses, defeating Bernie Sanders, according to final Iowa Democratic Party results @webpagelink"},{"comment_id":"10154892673543690","commenter_b":"@username Yeah I get it, I'm just evil with white supremacy and global domination on my mind. Nobody with brown or black skin anywhere outside the United States is capable of doing anything wrong, because of white people, right? You're just a victim? I wasn't in the Navy, I am a Marine. But I feel like I have to defend the Navy here. There are sailors representing men and women from every race, not just whites. I guess you didn't know that. You say that the US Navy contributes to human misery but when a tsunami struck Indonesia in 2004, who was there for the rescue effort? When an earthquake struck Nepal, who was there? When a hurricane destroyed Haiti, who was there? I was there distributing food and medical supplies to desperately poor people in Ethiopia and Somalia. The US Navy prevents two-bit pirates with speedboats and AK47's from ...","commenter_a":"All I do is get up to go to work everyday to provide for my family. Ive never oppressed anyone and I Judge people based on the content of their character. I still hear all over the media how I, and people like me, are causing all the problems in this world. I suppose im just tired of it. Please tell me how being born with white skin makes me responsible for societies ills.","post_message":"Marwan Bishara: America needs anger management"}]
