[{"comment_id":"10153538663841130","commenter_b":"Cristian Cabrera","commenter_a":"Marisa have you seen these guys??","post_message":"No mailman is safe..."},{"comment_id":"10154001365909497","commenter_b":"There are plenty of nice average looking women that \"nice\" average looking guys ignore because they chase hot chicks. It works both ways.","commenter_a":"Local man who would be good provider for area woman`s kid friendzoned while area woman dates unemployed band members. Area woman complains about lack of good men.","post_message":"\"If they find a cure for Zika tomorrow, it not like I can afford to get pregnant under my current insurance plan.\""},{"comment_id":"818563178203701","commenter_b":"For what? Please elaborate...","commenter_a":"Impeachment now","post_message":"Before we voted to defund President Obama's unconstitutional actions on immigration, Speaker Boehner read 22 direct quotes where President Obama argued, in his own words, that he couldn't act alone on immigration. Here are the quotes: March 31, 2008: “I take the Constitution very seriously. The biggest problems that we’re facing right now have to do with [the president] trying to … not go through Congress at all. And that’s what I intend to reverse when I’m President...” May 19, 2008: “I believe in the Constitution and I will obey the Constitution of the United States.” May 5, 2010: “Anybody who tells you … that I can wave a magic wand and make it happen hasn't been paying attention to how this town works.” July 1, 2010: “[T]here are those … who have argued passionately that we should … at least ignore the laws on the books... I believe such ..."},{"comment_id":"1273048739421267","commenter_b":"I don't believe very many Republicans are \"in to\" the arts except at fundraisers. lol","commenter_a":"They are Trumps uneducated.Gotta love STUPID!","post_message":""},{"comment_id":"10152784811780927","commenter_b":"Why give a s**t? You act like he is relevant!","commenter_a":"Why do we care what he thinks?","post_message":"Another rock star goes on the attack against conservatives."},{"comment_id":"10154315361436656","commenter_b":"Shes a bi**h fr","commenter_a":"Let it go nothing or know one is perfect, and we surely can't do what she does on a good day! Let it go... Damn media!","post_message":"\"I'm trying to be a good sport here.\""},{"comment_id":"10153216503482507","commenter_b":"I guess the gloves are coming off, the fourth reich is just about ready to emerge. When is that wall to Mexico scheduled?","commenter_a":"Evil","post_message":"Wow. Just wow."}]
