[{"comment_id":"1784144245187941","commenter_b":"Oh shut up!","commenter_a":"If African Americans don't understand that they're being exploited and used for their votes by this woman, well then they'll get what they deserve after they elect her, a lot of nothing! So sad to see them falling for this. She's using a black rapper to pull in votes, amongst other things. Using a group of people for a vote is so wrong, nothing more. She's disgusting to do this.","post_message":"Hillary Clinton quotes Jay-Z during Cleveland rally: “Rosa Parks sat so Martin Luther could walk, and Martin Luther walked so Barack Obama could run, and Barack Obama ran so all the children could fly.”  Read more here: @webpagelink"},{"comment_id":"10154973344274166","commenter_b":"@username my daddy would never. Then again he's only had one wife and never talked about groping his children.","commenter_a":"They about to get cozy. He is so in lust with her.","post_message":"Here's a look at Pres. Trump and daughter Ivanka as they departed Washington unannounced to honor slain Navy SEAL Chief Petty Officer William \"Ryan\" Owens. Read more: @webpagelink"},{"comment_id":"1034829756528494","commenter_b":"Yeah women!!!","commenter_a":"What about the father that wants to keep the baby? He has no rights...","post_message":"A win for choice"},{"comment_id":"10153811400261002","commenter_b":"Just goes to show we know how to do more than you men lol","commenter_a":"I think it's hilarious.Sadly a majority of uptight women will find it offensive,like they do if the wind blows the wrong way. Relax it's not a d**k don't take it so hard.","post_message":"A new jersey for a sports team has washing instructions that has caused an uproar. It reads  this jersey to your woman, it her job."},{"comment_id":"1115809875115612","commenter_b":"So basically since federal funds cannot go to abortion services you are going to punish tens of thousands of citizens who rely on the other 97% of services that they offer. Nice job. I see you really are the pro life party.","commenter_a":"How can it be that after viewing the videos and seeing the sonograms that people can STILL only talk about the \"rights of the woman\"? How can that be? And the sad thing is the terrible damage abortion does to women and many men.","post_message":"BREAKING: The House has passed #HR3134, my bill to freeze all federal funding to Planned Parenthood. Grateful to every Member of Congress who stood for life and supported this compassionate measure. The fight is just beginning!  #ProLife #DefundPP"},{"comment_id":"10153725058711178","commenter_b":"The tea party is NOT a criminal organization. Black lives matter IS a hate groups.","commenter_a":"There wouldn't be a black lives matter movement, if police brutality didn't exist.","post_message":"Is there a double standard in the media for the Tea Party and Black Lives Matter?"},{"comment_id":"1695494594049179","commenter_b":"And who's fault is it that the cartels exist ?? -- Your people! The youth in your country and their parents . The main fact that ignorant Americans either fail to realize or completely ignore is that America is the #1 drug consumer country in the world ! In order to be a business there needs to be a demand. Your society is demanding drugs you people are raised on terrible values and customs which is why you are heavily consuming drugs ! If your government could find a way to avoid that demand and necessity the business would cease to exist. Your people are indirectly the cause of the blood that sheds south of the border . Of course you didn't do your research properly! BITCH.","commenter_a":"#BringBackJonStewart ... Sorry, but you're misinformed and simply not funny Trevor. You obviously never visited a border town where cartels are actively kidnapping Americans. This is happening right now, while you attempt to make unfunny jokes about the problem","post_message":"Trevor unpacks Donald Trump's response to the mass shooting in Orlando. @webpagelink"}]
