[{"comment_id":"1082224775141850","commenter_b":"Beyonce sucks black stinky dicks","commenter_a":"She's entitled to her opinion but was inappropriate at Super Bowl. People need to boycott her appearances. If enough people cry their outrage maybe it will make a difference. I know I'm fed up with this BS!!!!","post_message":"***FIRESTORM*** An online #BoycottBeyonce campaign to boycott Beyoncé and her music has picked up steam since the pop star performed a controversial tribute to the Black Panthers during the Super Bowl halftime show on Sunday....Developing..."},{"comment_id":"1669026716715370","commenter_b":"You can not close borders. People can fly here, come on boats and come via Canada or Mexico. The president has deported more illegals than any other president. Frankly the wealthy prefer to hire illegals to watch their children, clean and build their homes and other jobs because they do not want to pay minimum wages and want them to work as slaves in the farms, restaurants and factories. Put the blame where it belongs, on the 5%ers that are reaping the benefits of immigrants. They get you passed at the victims rather than themselves. If you want change you have to vote for someone brave enough to address the issues and actually formulate and execute a plan. Perhaps Bernie who actually addresses the issue. Voting for billionaires backed by the 5% will not resolve any issues.","commenter_a":"Obama better back off, he is allready in it for Treason","post_message":"Franklin Graham just delivered a MASSIVE message to Obama and the left about jihad and what it means for America... liberals are furious, but over 100,000 people have \"liked\" what he said on Facebook. Do you agree with Rev. Graham?"},{"comment_id":"10153328261067093","commenter_b":"****Illegal immigrants.","commenter_a":"It's funny y'all keep talking about Democrats. I guess y'all are the same incompetent people that voted for Bush twice. Donald Trump has his head up his anus. He doesn't know the first thing about running a country. Let me guess he had y'all at Wall? He would build one to stop immigrants. All immigrants aren't bad they just want a better life. LeRhonda Flowers","post_message":"A resident of a tiny island in Canada is rolling out the welcome mat if Americans want to flee after Election Day.... @webpagelink"},{"comment_id":"10153831550149474","commenter_b":"I don't believe my dog trust Hillary","commenter_a":"I remember she slapped her husband's face at the White House. Lol.","post_message":"Simple. Share if you agree."},{"comment_id":"10153853522001336","commenter_b":"Your Governor says yes to more refugees.","commenter_a":"I just found out that approximately 130 Syria refugees are here in PA .","post_message":"“What I want is a watch list. I want surveillance programs. Obviously there are a lot of problems. I want a database for the Syrian refugees that Obama’s gonna let in.” Donald J. Trump went “On the Record’ to clarify his recent comments, emphasizing that he wants to keep track of the Syrian refugees entering the United States, not all U.S. Muslims. @webpagelink"},{"comment_id":"1776660905952346","commenter_b":"Pure, concentrated trash.","commenter_a":"Wow. I would be better of going to Hough and Central and picking something up, thank you.","post_message":"BLOWJOBS FOR HILLARY?"},{"comment_id":"1166947526658609","commenter_b":"I am a Democrat and I will not vote for this woman!","commenter_a":"the bride of frankenfood. no mercy.","post_message":"Is she in trouble?"}]
