[{"comment_id":"10153618615406320","commenter_b":"I think this moms do it on purpose.","commenter_a":"Please don't give this woman her kid back. They should take both. Her son will be next. Smdh","post_message":"SHOCKING: Child found 'Sweating profusely' Police in New Jersey had to rescue an child from a car seat in hot van while her mom went shopping. Details: @webpagelink"},{"comment_id":"889632651227311","commenter_b":"She's a dingbat","commenter_a":"Way to meny Hillary lovers. Hate Sarah only because she is a conservative.","post_message":"Trump comes forward with huge announcement about Sarah Palin... You're going to love this. She is a true patriot and will serve our country. Can we get 10,000 'LIKES' for Sarah Palin?"},{"comment_id":"434665249991403","commenter_b":"Like Ms. Richards said \" get over it\"","commenter_a":"The supreme court has been and is political. It has jettisoned the straight forward and logical meaning of the Constitution in a growing social activism. The concept of heterosexual marriage has been intact from the beginning of historical time...until the present attempts to normalize the homosexual perversion . Legal liasons by contract have always been possible to all persons but the attempts to socially institutionalize and legally legitimize homosexual marriage as an equal and legitimate alternative to heterosexual marriage will never legitimize it. It may legalize it - but unborn baby murder is legal but will never be morally normal nor moral.","post_message":"Rick Santorum thinks that Congress should fight the Supreme Court if the court rules in favor of gay marriage. Is he right or wrong?"},{"comment_id":"10154592575994062","commenter_b":"Hang these neggos today !!!","commenter_a":"They don't even care that they took someone life, so no one should care when they are giving them the chair","post_message":"TODAY: 4 accused of robbing a Houston restaurant and killing a man are scheduled to appear in court."},{"comment_id":"685160361665842","commenter_b":"She must have needed something to have married this turtle.","commenter_a":"His wife will head transportation dept. or something. She is anti-union and for big corporations. Family does Business abroad. Her family gave turtle face around 25 million.","post_message":"Astoundingly dishonest."},{"comment_id":"800309873404645","commenter_b":"16-years ago America watched as the Clintons packed their moving vans with about $200K of stolen furnishing and valuables from the White House and drove away, finally removing a large stench of corruption and sleaze from our nation's capital. We'd be insane to allow them back. TRUMP-2016 MAKE AMERICA GREAT AGAIN!!!","commenter_a":"Counter punch...she has a glass jaw. (email, poor sec of state, another Obama)","post_message":"Crooked Hillary Clinton is spending a fortune on ads against me. I am the one person she doesn't want to run against. Will be such fun!"},{"comment_id":"1703022976604096","commenter_b":"For everyone trying to give intellectual insight to a Trump supporter, you're wasting your time. I don't expect any moron to get it, neither should you. With Newt, he's guaranteed to lose, and be irrelevant, and then the rest of ua educated americans can get back to a #TrumpFreeReality . #TrumpSupportersareMORONS #DumpTrump #AMERICAISALREADYGREAT","commenter_a":"Absolutely I would vote for these two gentlemen. Newt could and would immediately provide the information and experience to \"hit the ground running\" I believe this would be an awesome team.","post_message":"Rumors are swirling that Donald Trump could pick former House Speaker Newt Gingrich as his running mate. Would you vote for this ticket?"}]
