[{"comment_id":"1258599470822378","commenter_b":"Trump contributed millions to liberals and their policies and now says he wants to fix the mess that he funded. No thanks.","commenter_a":"i have decided its safer with cruz, he has a record, trump is all talk, there is no certainty how he would be as president.","post_message":"I think Trump going after Cruz is quite normal; it's understandable. But I think he's making a tactical error the way he's doing it. Whatever you want to say, Cruz is not a \"nasty\" guy. When you get into criticism, it better be believable."},{"comment_id":"1538272953143656","commenter_b":"Benjamin Edward I do!!! I like this takes place in Brooklyn too!","commenter_a":"Benjamin Edward","post_message":"Mark Ruffalo and Bernie took a walk through the Brooklyn, New York school yards where Bernie grew up, and talked about his childhood, why he got involved in the Civil Rights Movement and how those experiences translated into his life in politics and this movement. (Directed by Matthew Cooke)"},{"comment_id":"10154979163784712","commenter_b":"@username she has given no reason for anyone to respect her. She is disrespectful, offensive and rude.","commenter_a":"Ugh .... for fucks sake ... \" the tax payers are funding this \" you fucking idiots!! He is gutting federal funding from science to build this stupid fucking wall ... p.s most illegal aliens are here from over stayed visas ! From countries they took planes from ! Besides don't you watch international news ? Cartels use tunnels now to bring in drugs you fucking dummies !","post_message":"Trump will sign executive orders enabling construction of a border wall and targeting sanctuary cities."},{"comment_id":"922742544437395","commenter_b":"It's not so much stupid and idiocy as it is vicious.","commenter_a":"Mississippi. Period. Point Blank. (sorry to paint with such a broad brush, but.............)","post_message":"This racist needs to be fired now. Sign the petition to have him removed from office: @webpagelink"},{"comment_id":"1139514676096919","commenter_b":"#TrumpThatBitch","commenter_a":"Hillary is dirt","post_message":"Hillary Clinton and Donald Trump clashed repeatedly over the economy, tax cuts for the wealthy and ISIS in the first of three highly anticipated presidential debates. Read KTLA's story here: @webpagelink"},{"comment_id":"10154449386136336","commenter_b":"Ban Muslims Now!!","commenter_a":"Open mouth insert foot.","post_message":"Last night on “Hannity,” Mike Pence echoed Donald J. Trump’s call for a temporary ban on immigration from countries where terrorists represent a threat to the United States. @webpagelink"},{"comment_id":"10153107155889411","commenter_b":"Your mother is a terrorist","commenter_a":"Not all muslims are terorist but all terorists are muslim...","post_message":""}]
