[{"comment_id":"1392116457753526","commenter_b":"Illegals DO NOT FREAKING qualify for SNAP or any Welfare!","commenter_a":"So, how many of these people are illegal?","post_message":"This state is preparing to kick roughly 30,000 people off food stamps."},{"comment_id":"10154455818619705","commenter_b":"She referred specifically to people who are \" ..racist, sexist, homophobic, xenophobic, Islamophobic.\" If you don't find those things deplorable then you're in the basket and you might as well wear the shirt so the rest of us can more easily identify you.","commenter_a":"Trump supporters take being referred to as \"deplorables\" like a badge of honor","post_message":"The shirts stem from a comment Democratic presidential nominee Hillary Clinton made at a fundraiser."},{"comment_id":"10153604606804024","commenter_b":"AFUCKINMEN ON THAT SHIT!","commenter_a":"OBAMA DOES NOT CARE---HE TREATS THE ENEMY BETTER THEN AMERICANS !!!!!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10155465475828797","commenter_b":"The president of Mexico is worried that if the drugs stop coming into the US , he will lose lots of money! Plus if all the Mexican criminals are send back , Mexico will be in more havoc !","commenter_a":"We The united states of America want President Trump to build a Border Wall just like Mexico! Also I would like to see the same Mexican LAWS on immigrants coming into their country, the same Mexican Law's in United States","post_message":"WATCH LIVE: Sec. of State Rex Tillerson and DHS Sec. John Kelly hold a joint press conference Thursday in Mexico City after meeting with Mexican officials, including President Enrique Peña Nieto."},{"comment_id":"1598021397151640","commenter_b":"At least God is doing something to help with the immigration problem.","commenter_a":"He is a wonderful god","post_message":"WHOA!"},{"comment_id":"903890666313022","commenter_b":"She better bring a big army.","commenter_a":"Well michelle said before she is out of the White House she is going to have guns taken away from the American people","post_message":"Outrageous!"},{"comment_id":"966246990097370","commenter_b":"Umm Ferguson, Watts Riots, La Riots. White people are out of control? Ok","commenter_a":"I pray for their families","post_message":"White supremacists shoot five people near the #BlackLivesMatter protests for Jamar Clark, a 24-year-old unarmed black man who was shot earlier this month by police. Protestors took to Twitter after the shooting & described the scene as chaotic, saying police maced the crowd before an ambulance arrived to assist the wounded. No arrests have yet to be made. DETAILS ----> @webpagelink"}]
