[{"comment_id":"1693513877603730","commenter_b":"This is silly. People may not like him me included but who Someone decides to vote for should be there choice and not pushed on them. That's exactly what this would do. I supposed you also felt bad for the Emory students that cried about some chalk?","commenter_a":"Futile","post_message":"#VoteTrumpGetDumped is encouraging women to dump Donald J. Trump supporters because of the way he treats women."},{"comment_id":"902649573193973","commenter_b":"And the nasty muslims rape goats","commenter_a":"There are police outside Catholic services in NYC right now. And Jewish services. But not allowed at mosques because it's insulting.","post_message":"“If you've got nothing going on [in mosques] but a beautiful religious service, why in His name would you not want to have police officers?” – Rudy Giuliani reacts to the #OrlandoShooting and Donald J. Trump's push for more surveillance"},{"comment_id":"1208631035874947","commenter_b":"It's like they are in our brains.","commenter_a":"Hahahaha Donna Chin, @username @username! (Rix I think that number 9 & 11 will be very familiar to you Hahahaha)","post_message":"You know they're a real friend when you can be a dick to them."},{"comment_id":"1486825354715718","commenter_b":"Thank you","commenter_a":"The judge then goes through the charges and dismisses the girl, to which she smugly replies, “adios!” He orders her to come back for the way she left, then increases bond for her charges from $5,000 to $10,000. “Are you serious?” the girl asks angrily, before saying “f-- you!” to the judge and storming off. She is then ordered to return again, and the judge becomes furious with her attitude. “Did you say ‘f--- you’? Did you say that?” the judge asks. “Yes sir, I did,” the girl responds. “Oh you did say that?” the judge replies. “I find you in direct criminal contempt. Thirty days in the county jail.” The video from 2013 went viral, with many praising the judge’s decision to punish the girl for her harsh words and attitude towards him.","post_message":"A judge thought he misheard what this teen girl said to him, so he asked her to repeat herself. She did. When he realized he hadn't misheard, the judge issued a response that the teen girl wasn't expecting."},{"comment_id":"744295802392870","commenter_b":"Oh god this world","commenter_a":"Anoosh GondalSadia Manzoor lol wth","post_message":"The PMS Package makes your 'time of the month' easier with candy and treats. Via In The Know"},{"comment_id":"10153203503306130","commenter_b":"Funny how people attack Obama's character then defend this guy, it's very revealing really.","commenter_a":"Donald Trump scares you because he'll take away all your free stuff! Donald Trump scares you because he believes in working hard to get what you need, what you want. He will fix America and you will continue to whine and cry about your \"entitlements\" being taken away! Suck it up and go to work America!","post_message":"See a map of the world through The Donald’s eyes."},{"comment_id":"638229933016362","commenter_b":"Yeah. There just has to be some reason why hitliery didn't win other than the fact that she is a worthless lier.","commenter_a":"no they did not more lies","post_message":"The CIA says Russia intervened in the election in order to help Trump win. How do you feel about this?"}]
