[{"comment_id":"888007527972526","commenter_b":"Send em to their mother land","commenter_a":"Why then are they even here? Get the hell out of this country","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays Lets get 3000 SHARES if we should deport them!"},{"comment_id":"10152680682100950","commenter_b":"Taniesha","commenter_a":"Wow","post_message":"The police officers who discovered the 18-month-old girl dangling in a car seat inside the submerged car said they heard a mysterious voice begging for help: \"Someone said 'help me' inside that car.\" Another officer also heard the voice: \"(It) wasn't just in our heads.\""},{"comment_id":"10153825778449877","commenter_b":"So what now only black women have abortions! GTFOH!","commenter_a":"No words. Just disgust","post_message":"College Newspaper Cartoon Depicts Black Woman Being 'Late' for Her 'Abortion.' Oh, and she was wearing a Black Lives Matter T-shirt. Read the full details below. Grio fam, what in the world is going on here?"},{"comment_id":"10153653825589641","commenter_b":"Barbaric ... Disgusting behavior . Poor woman. I thank God every day that I was not born in an Islamic country and pity all those women who are oppressed . May she rest in peace .","commenter_a":"What happened to the man she was supposedly cheating with ? Let me guess ....nothing. That country is nothing but a bunch of murderers","post_message":"The victim was in a forced marriage, and had tried to flee with another man."},{"comment_id":"10153048928789071","commenter_b":"We have to build a wall...","commenter_a":"@username gute Nacht murica","post_message":"A Univision reporter gets kicked out of a Trump event"},{"comment_id":"10153072205104614","commenter_b":"Let us hope this woman wasn't aware of the situation. Because otherwise they're both sick horrible people.","commenter_a":"I hope this pig gets sodomized repeatedly. ......human garbage.","post_message":"BREAKING: A 30-year-old man Newhall man has been charged with sexual assault and murder in the death of his 19-day-old infant daughter. Matthew Brendan Warner led investigators to the baby body less than 12 hours after the infant had been reported missing over the weekend. He was arrested on suspicion of murder. On Tuesday, prosecutors announced he had been charged with aggravated sexual assault, torture and other alleged crimes. Read KTLA's story here: @webpagelink"},{"comment_id":"1241837469190442","commenter_b":"@username was gonna say too :/.. probably bhs...","commenter_a":"Tim","post_message":"Ready to play during recess? Sit on the bench at this school, and you'll find friends in no time. (via CBC Saskatoon)"}]
