[{"comment_id":"331807290546859","commenter_b":"Dump trump and his bitch wife","commenter_a":"trumpers are ALL bullies! Only bullies attack a man 4 against 1, not to mention punching a poor old dog.... Their mothers must be so proud","post_message":"Trump, your 'bad hombres' are right here.  Shared by Occupy Democrats. Video credit: ABC 7 News - WJLA."},{"comment_id":"10153301098933067","commenter_b":"Both ladies were very graceful","commenter_a":"Mr. Trump, you are really out of your ulo..... it was an honest mistake and it was acknowledged so, just move on..... better luck next time Miss Colombia... congratulations to all the contestants and the winners........ jmtc","post_message":"'I'll tell you what I think I'd do. I think I'd make 'em a co-winner. It'd be very cool' - Donald J. Trump @webpagelink"},{"comment_id":"1338517659516985","commenter_b":"I call Bull!!! On that one!!! I have to perform and work twice as hard than my Caucasian counter part and still make less money. Do the 'work' of a title position but not get the position because the Caucasian has it and can't do the job!!!","commenter_a":"Always like this Guy best of movie real actor love him I see most of his movie .","post_message":"So accurate, it’s SCARY!"},{"comment_id":"10153115741995950","commenter_b":"That is BULLSHIT there terrorist right now in AZ 1out of 4 children are starving obama cant feed and house. Ours so what the hell he is gonna feed and house them. You hate the US you love terrorist get the hell out of here","commenter_a":"Good!","post_message":"NEW: The U.S. is preparing to accept at least 10,000 Syrian refugees in the next fiscal year, which begins in October."},{"comment_id":"10153165455697869","commenter_b":"End stupid people from breeding","commenter_a":"Amen....","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153148918692217","commenter_b":"'@username yeah because he will send you back to Mexico..... and will put a full stop to cross jumping.... All those tunnels on the US border in Texas will also be sealed.","commenter_a":"old news.","post_message":"Using their tune? Donald J. Trump needs to 'Dream On' 🎶"},{"comment_id":"10153514058971336","commenter_b":"We are all illegal one point American got started by illegals","commenter_a":"13 million illegal aliens keep me up at night.","post_message":"Attorney General Loretta Lynch said that a cyber-attack by the Islamic State is perhaps the terror group’s biggest, emerging threat."}]
