[{"comment_id":"1538313829806168","commenter_b":"I am not paying you shit I had nothing to do with era so fuck you and for your stupid information the Dutch started the slave trade.but I can tell you come to my house I can guarantee you will have a bad day","commenter_a":"Not only no but Hell No","post_message":"All White People Owe Us Reparations, 'If You Don't Give It, We Are Coming To Take It' [VIDEO] They are demanding that we give them money for their ancestors slavery. Will you pay African Americans reparations?"},{"comment_id":"10153775888041756","commenter_b":"Some of these countries send their boys to war as young as age 6. That's gendercide too. And a much more painful form of it. Like in Sparta where they would kill the boys if they didn't have a warrior's body. Male disposability exists throughout the world including the West. And it persists regardless of the sex of the leader. The Queens of England ruled half the world for long periods of time but it was still the men who were disposable. I would never expect the mass media to address that. Not for another hundred years that is.","commenter_a":"Those are going to be some very unhappy boys.","post_message":"Technology has enabled even the poorest of countries to boost the ratio of boys over girls. One expert even goes so far as to use the term \"culling\" when talking about what's going on in these countries — a word otherwise reserved for describing the removal of undesirable animals from the herd."},{"comment_id":"921257648004031","commenter_b":"Nope, Michelle can get naked with any woman she chooses. I'm okay with that. Hillary too. Lesbian love! Let's all celebrate that.","commenter_a":"I couldn't care less about the nude photos. That has no effect on my disdain towards Trump. I DO care about the fact that conservatives are fine with this, but would have a complete meltdown if this were Michelle Obama and call her every dirty name in the book.","post_message":"What kind of example would First Lady Melania provide for America's children? But let's hear more Fox \"News\" outrage about Michelle Obama's sleeveless dress PLEASE... sigh... Full photo here: @webpagelink"},{"comment_id":"10153156840858690","commenter_b":"F**k off, blue haired Zionist murderer!","commenter_a":"just a game, fake for 3 reasons: 1. To lower the rising American hate that's growing in the world 2. For Isreal to keep using the US as a negotiator (like calling your big brother to be a \"indendent \" deal maker\") 3. Confuse people, now we are talking about this while the settlements are being built and time goes on","post_message":"Increasingly isolated, Israeli Prime Minister Benjamin Netanyahu turns to US Senator Chuck Schumer, Israel's leading friend, to enlist his support against President Barack Obama. It's likely their conversation went like this, says Marwan Bishara. @webpagelink"},{"comment_id":"1232264963481332","commenter_b":"@username, you should read up on the case! It doesn't look good and she's only after what Trump would consider pocket change.","commenter_a":"Wait, Wait, Trump claims he never sexually assaulted anyone, \"I only spoke words, Bill acted\". but Bill was charged and cleared and Trump has been charged. Also, he is being charged with Raping a 13 year old girl. And I don't want to hear from Trump supporters that he \"innocent until proven Guilty\" because every single charge they've made against Hillary, she has not been proven guilty of.","post_message":"WOW. Trump has a lot of explaining to do... in federal court."},{"comment_id":"647292048744709","commenter_b":"Only think Muslim country doesnt provide is Security Reason for us to move USA !","commenter_a":"There is a renewed campaign that's getting a lot of attention to get the Equal Rights Amendment (ERA) into the U.S. Constitution. Many candidates talk about their support for fair treatment of women, and this amendment would provide a fundamental guarantee of equal rights. If elected, will you actively support the ERA? #GOPDebate","post_message":"Don Lemon is taking you through the latest in Facebook trends ahead of tonight's #GOPDebate. Have questions? Ask him anything!"},{"comment_id":"1077005215689340","commenter_b":"Hillary is an establishment hoe","commenter_a":"She is the most qualified candidate in this race. I strongly believe, Life will be better with @username. <3 #imwithher #weareforher #Hillary2016 #feelthehill #yeshill","post_message":"Anyone asking for your vote has to grapple with the reality of inequality in America—and offer real plans to fix it."}]
