[{"comment_id":"1801914530074898","commenter_b":"Deport all illigals","commenter_a":"Deport all illigals","post_message":"WATCH LIVE: Donald J. Trump speaks at campaign event - will he address the multiple allegations of sexual assault?"},{"comment_id":"10152955356009071","commenter_b":"I know I said LMAO, but really hit me up... could use the help. ;-)","commenter_a":"Dear anyone... please contact me if you're up for some pro bono work to sharpen your skills! Lmao!","post_message":"It's a known fact that hacking makes money. But how much money?"},{"comment_id":"1024212657594017","commenter_b":"Your Emperor said himself 22 times on record that he doesn't have the power to do this. Game over.","commenter_a":"@username, President Obama has only threatened Veto if the try to screw his Immigration E.O.s, which by the way are Constitutional, your party is still playing their very dangerous game of obstructing everything President Obama does. As for your erroneous statement about the First Family's Christmas vacation, I will enlighten you as to the fact that other than Secret Service detail, they paid their own vacation expenses. The taxpayers always pick up the tab for security and use of Air Force One for ALL Presidents while they were in office. Now you go research!","post_message":"Republicans have only been in control for a week and already they are picking an unnecessary political fight that risks shutting down the Department of Homeland Security and endangering our security. Republicans should stop playing games and pass a clean bill to fund the Department of Homeland Security because the pointless, political bill passed in the House today will not pass the Senate.   House Republicans voted to tear families apart and deport young people who came to this country as babies. Tearing families apart does nothing to secure our borders, fix our broken immigration system or strengthen our economy.   This is not a game and it is time for Republicans to take their responsibility to govern seriously, instead of playing to the most extreme voices in their party."},{"comment_id":"1037555982922868","commenter_b":"GB = Greedy Basturds!","commenter_a":"Where does he live now?","post_message":"Tony Blair’s office said there would be “no negotiations” over his fee, which per-minute is higher than the yearly salary of someone on minimum wage in the UK."},{"comment_id":"10154447143119087","commenter_b":"Katherine, I hope someone, someday, grabs you by the pussy, you uneducated white trash bitch","commenter_a":"lol he's a hot headed LOSER.... This asshole called his own daughter a Pig And somehow we care what he thinks about Donald Trump","post_message":"Alec Baldwin posted a photo on Instagram in a Russian \"Make America Great Again\" Hat."},{"comment_id":"1246991831993261","commenter_b":"goodbye both...","commenter_a":"thats \"goodbye America\"...","post_message":""},{"comment_id":"378908105805941","commenter_b":"These people are demon possessed. They need to be stopped.","commenter_a":"Trumps fault","post_message":"MUSLIM MEN WHO RAPED 11-YEAR OLD Shout \"Allahu Akbar\" At Sentencing...The Girl Had A Baby At 12   No remorse whatsoever..."}]
