[{"comment_id":"10153688042296028","commenter_b":"No way!! Frankie","commenter_a":"He not dead tf","post_message":"Update: Prince's publicist confirms that the pop superstar has died.  A death is being investigated at the Minnesota property of singer Prince. The identity of the person has not been released. @webpagelink"},{"comment_id":"10154203076004087","commenter_b":"Of course Axelrod.... in the mean time we have to keep a corrupted woman out of the WH by massively voting for another candidate... Just get back in the swamp and be happy Axelrod Traitor !","commenter_a":"It has been revealed that part of the Clinton strategy is to incessantly blare from any and all platforms that it's game over, Hillary already won, Trump can't win, etc. Of course the reality is that Hillary can't fill high school gyms with supporters while Trump fills arenas. So, only a few more days till we know if votes still count or if we live in a rigged system controlled by some shadow government and foreign interests.","post_message":"\"I don't know any consultant on either side, any strategist, who privately believes that Donald Trump is going to win this election,\" Obama campaign strategist David Axelrod said."},{"comment_id":"1783407658566153","commenter_b":"Bitch!!! the only ones not giving up their power are You, Hillary, and Obama!! You need to give it up!! You lost!","commenter_a":"\"The biggest way we give up our power is by not knowing we have it to start with.\" --Alice Walker (paraphrased)","post_message":"This week's fireside chat is a call to action. Trump and his allies are trying to block the democratic process and our right to a vote we can trust.  If you are near New York City, join us at Trump Tower on Monday morning at 10 AM to stand up for democracy."},{"comment_id":"10154001679275927","commenter_b":"Every time she opens her mouth out comes more drivel!","commenter_a":"She owns a vineyard in California, I think she personally does all the wine tasting herself!","post_message":"WATCH-- President Clinton, as well as President Obama, we operating on a pay-as-you-go basis ...\""},{"comment_id":"1151823781577341","commenter_b":"He claims he knows more about Isis than any one else","commenter_a":"As a Vietnam vet I may be able assist in the area of adjectives for Trump. I prefer using the term chicken-hawk. It pairs well with draft doger.","post_message":"This one is PERFECT."},{"comment_id":"1000336466699775","commenter_b":"Bitch Stfu quit preaching","commenter_a":"Kanye was her man at one point. I'm sure y'all have done stuff to please your significant other while in a relationship. GTFOH. Y'all clowning Amber for pleasing her man at the time?? Really???","post_message":"#ShotsFired Amber Rose Just Fired Back At Kanye West!"},{"comment_id":"1071843699548997","commenter_b":"Lol stfu","commenter_a":"God Bless you Donald Jesus has CHOSEN you to lead our country !","post_message":""}]
