[{"comment_id":"1260170427412540","commenter_b":"Rudy Giuliani, just said, before president Obama there was no successful terrorist attack on America. I loved it! these so-called educated white men show their stupidity, every time they open their mouths, he just spit and pissed on the graves of all the 911 victims! , it happened not once, but twice in New York (terrorist attacks), and how could sun-bleached bleached Donald Trump care about the veterans when he said he doesn't like the ones that got captured? And before running for president he has never! donated to any veterans organization, but he's going to take care of the veterans and loved the veterans, he's a real sleaze ball!","commenter_a":"We got nothing","post_message":"Is Donald J. Trump likely to double-down on his proposed immigration ban?"},{"comment_id":"10154105809967908","commenter_b":"Feel the Bern! Gonna be the first time I vote thanks to this man Bernie2016","commenter_a":"Yes, it is appalling.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1219006891496424","commenter_b":"They do not have a right to do so ILLEGALLY! God's Word says to obey the LAWS!!!! Read your Bible pope.","commenter_a":"In Syria , not here!","post_message":"Pope Francis said each refugee 'has a name, a face and a story, as well as an inalienable right to live in peace and to aspire to a better future' for their children."},{"comment_id":"552329344892078","commenter_b":"Impeach her! She's suppose to be UNBIASED. What a joke","commenter_a":"Term limits asap","post_message":"Supreme Court Justice Ruth Bader Ginsburg bashes Donald J. Trump, calling him 'a faker' and criticizing him for not releasing his tax returns."},{"comment_id":"1800960313527053","commenter_b":"She should wait till 2024 after Trump can't beat her again...","commenter_a":"She can't even walk right. Go to you jail cell and rest.","post_message":"Did I ever tell you the definition of insanity?"},{"comment_id":"10155121941959614","commenter_b":"Over that wall!","commenter_a":"This is how Normal Americans see trump n trump supporters.","post_message":"Far from targeting only  hombres, as Trump has said repeatedly, his new order allows immigration agents to detain nearly anyone they come in contact with who has crossed the border illegally.  People could be booked into custody for using food stamps or if their child receives free school lunches."},{"comment_id":"10157626698695603","commenter_b":"Stupid woman needs to be arrested .","commenter_a":"Thank God someone called the police and didn't just stand around videotaping it.","post_message":"Thankfully, the cats were not injured during the rampage."}]
