[{"comment_id":"10153220581496336","commenter_b":"And the rap sheet of those deceased are mind blowing. Sad to be in A profession where u care so much but the ones u protect care so little.","commenter_a":"A bad situation when police are persecuted for doing their jobs. The whole force should resign. I would.","post_message":"The booking photos of the six Baltimore police officers charged in the Freddie Gray case have been released."},{"comment_id":"10153577909221756","commenter_b":"And finally, Jesse Jackson IV, since I think he likes Kendrick Lamar too?","commenter_a":"'@username Mata Though I'm sure you have seen this...","post_message":"High school teacher Brian Mooney used rapper Kendrick Lamar's latest album to teach a unit on Toni Morrison's novel, 'The Bluest Eye.' Lamar found out about it, and decided to stop in for a visit. Full story here: @webpagelink"},{"comment_id":"10153319630981135","commenter_b":"Take her car away!","commenter_a":"FOUND IN OHIO.","post_message":"Nancy Carfes was last seen around 8:30 a.m. Monday morning in the area of Wayne and Warren Roads."},{"comment_id":"635093840035049","commenter_b":"The only duty this bitch understands is money and do what frump trump Hitler wants !!","commenter_a":"Hopefully she will realize that she is in way over her head and resign.","post_message":"Betsy DeVos has demonstrated she has a rudimentary understanding of the issues facing our students, teachers, and schools, which should have disqualified her from serving as Secretary of Education. She possesses no experience with the public education system as either a student, parent of a student, educator, or professional working on education policy. Now that Ms. DeVos is confirmed, she is charged with the responsibility of advocating for and protecting ALL students regardless of their background. I hope that she will fully embrace this duty."},{"comment_id":"10153326850769411","commenter_b":"muslims bitch and cry more than the gay. lets just put all of them gays and muslims on 1 island. and blow it the fuck up","commenter_a":"All muslims ever do is make demands.","post_message":"'They behave like the neighborhood bully, persecuting Palestine footballers, athletes and the movement of sporting equipment. Enough is enough.'"},{"comment_id":"10153689211286438","commenter_b":"Are uggos ugly women who like to hire pretty secretaries for pay raise kitty chow.","commenter_a":"Lesbians can rape just as easily as men.","post_message":"It’s time to stop pretending that only men perpetuate violence and women are only victims of it."},{"comment_id":"10152698672020927","commenter_b":"This is the same dolt that though islands could over-populate and flip over.......Donkey","commenter_a":"Another out of touch dem.","post_message":"The GOP budget will cause riots?"}]
