[{"comment_id":"10154627536394203","commenter_b":"And Hillary is in a self-serving line person all my God where are you woman you're in dreamland what are you smoking","commenter_a":"The man is entirely self-serving. His ego is his God. Bravo to Rev. Timmons for putting him in his place.","post_message":"Donald J. Trump's latest target? Rev. Faith Green Timmons of Bethel United Methodist Church."},{"comment_id":"724989260938156","commenter_b":"Honestly I wouldn't blame people for moving to canada if trump got presidency tonette kamakahi-gumapac","commenter_a":"Votefor Trump Happy Easter. Let's spend next Easter with Trump in the White House!","post_message":"Happy Easter to all, have a great day!"},{"comment_id":"10153083604111350","commenter_b":"They have noses ! Lori Askeland","commenter_a":"Please be sure to share that Etsy link when she does start a page up!! I'm interested in these adorable dolls!","post_message":"We just love the way this artist transformed these dolls -- they look like kids again! Click to check out all the awesome make-unders."},{"comment_id":"10153053678596157","commenter_b":"Ur rite mari but the USA cannot sentence this idiot to death cause Mexico won't allow it .","commenter_a":"He has ruined the life of an innocent women shame on him .....put him in life in prison or give him the death penalty.....","post_message":"BREAKING: Hidalgo County Sheriff Eddie Guerra says 17-year-old Eduardo Castro Lopez a Mexican man who lived in Mission confessed to killing a woman for her money. He took less than $100."},{"comment_id":"10152998520246037","commenter_b":"Rules are rules. But the airline's inconsistency in enforcing those rules is the real issue. It was ok to hold the child on the way down, it should have been the same on the way back. BUT I find the attention mongering of this mom downright pathetic. Totally disgusted. Not everyone is a world traveler, and I also get confused by the ever changing rules of the sky. Seems to me the mom holding her daughter was pretty clear that now she knows the airline's policy she will have a safety seat with her in the future. No further big deal made of it, issue was put to rest. Until this attention whore feels compelled to one-up her and try to publicly shame her. Disgracefull, classless and pathetic. If the woman went on and on and on about how she should be allowed to hold her child anyway, Yada yasa ...","commenter_a":"I agree with most of you, if she has a child with special needs then they shouldn't have been seperated in the first place. Secondly if the flight attendant had let that happen and something happened, then who would've been at fault then??","post_message":"\"The attention mongering schemes of Elit Kirschenbaum, who took to Twitter last week lambasting a United Airways flight attendant for refusing to allow her to hold her disabled three year old daughter on her lap during take off, make me want to puke.\""},{"comment_id":"10153373232208984","commenter_b":"Wow!! Such nasty, foul mouth comment from a woman. First Lady has more class than you will ever know.","commenter_a":"Yes we can not wait to get a real first lady again this nasty racist bitch needs to fk off","post_message":"I thought I'd seen every attempt at the race card possible, but this is definitely a new one... Do you look forward to Michelle leaving the White House?"},{"comment_id":"10153147409408812","commenter_b":"Terry is trollin trollin trollin, stfu","commenter_a":"2 billion years....lol make fun of me for believing in Santa Claus but you keep believing we could possibly ever know something was 2 billion years old.","post_message":"Scientists: Bacteria discovered that hasn't evolved in 2,000,000,000 years: @webpagelink"}]
