[{"comment_id":"10154518732261880","commenter_b":"Make America great again !! Thanks Mexico for the wall","commenter_a":"@username your boy is a fraud","post_message":"Buddy buddy."},{"comment_id":"880499385321632","commenter_b":"100% yes.","commenter_a":"Absolutely","post_message":"Do you approve of this change?"},{"comment_id":"10154125606926615","commenter_b":"Those mountains r no joke girl","commenter_a":"For a few inches of snow????","post_message":"11 ALERT: Several school districts have decided to send students home early today, before the snow begins to fall. Keep checking this link for updates. FULL LIST: @webpagelink"},{"comment_id":"10153521372371162","commenter_b":"Illegals cant vote....","commenter_a":"This men can't never be president white racist people can do it alone with out Hispanics and blacks his election is a waste time and money he lost already","post_message":"BREAKING: Donald Trump sues Univision for $500 million over the Miss USA pageant... @webpagelink"},{"comment_id":"10153585291913132","commenter_b":"The only reason 14-16 is a plus size model is because of fashion magazines. She is a NORMAL size model. That is average size.","commenter_a":"The woman depicted in this picture is a \"plus sized\" model and she's drop dead gorgeous! I wish they would STOP trying to glamorize Tess Holiday... she's pretty and if she truly feels good about herself being morbidly obese and unhealthy then good for her, but she's sending the wrong message!","post_message":"\"All women need to do to get a bikini body is to put a bikini on.\" - Tess Holliday"},{"comment_id":"1072744952785252","commenter_b":"Stacey Wilson this is the women I was on about on tv the other day","commenter_a":"Ben Haymes","post_message":"She wants YOU to pay to improve her sex life"},{"comment_id":"10152945760561051","commenter_b":"Great job for the AF vet I'm a 8 year vet from the ARMY I would have done the same maybe just a little more aggressive.","commenter_a":"No way the protesters are students. They are agitators.","post_message":"When this Air Force vet saw protesters stepping all over the American flag, she walked over to pick it up. Things escalated quickly from there."}]
