[{"comment_id":"10153899711236509","commenter_b":"I'd hate to see when an STD breaks out lol!!!","commenter_a":"Mahalia","post_message":"Imagine living in a town where everything you need is under one roof. Welcome to Whittier: @webpagelink #GreatAmericanStories"},{"comment_id":"968962986483662","commenter_b":"Exactly @username. @username, has already contradicted herself more than once. She is all over the place. That's one weird Troll.","commenter_a":"Barack Obama has done more damage to the USA then all past presidents put together...............He lies continually, he is anti-police, pro-thug, anti-life for gay marriage..... he says he is Christian but his fruits of his works are anti-Christ.....he sides with Islamic terrorists....goes against are biggest ally the Jewish Nation and has done everything he can to bring racial division to this once great nation. Treason is an understatement!!! Why don the Senate evoke the NUCLEAR option so to force our Divider and Chief veto all of the bills coming out of the Senate??? We the people should elect a person who will obey our Constitution and has faith in God, and a person who truly cares for the people and our Veteran!","post_message":"In 5 days, Congress will have to send 'must pass' legislation to President Obama's desk to fund the government.  Sign your emergency fax petition urging them not to send a single penny of taxpayer dollars for abortion or abortion providers! Click here! @webpagelink"},{"comment_id":"10153014740596545","commenter_b":"'@username stop right there. No Bush should be allowed in politics anymore. They've controlled things long enough!","commenter_a":"Go away Rick Perry......far away!","post_message":"Rick Perry referred to the Charleston incident as an 'accident' on Friday; staffers said he had meant to use the word 'incident.'"},{"comment_id":"1960555887503751","commenter_b":"TRUMP! Go, go go ... Defeat that evil woman and make America great AGAIN!","commenter_a":"Killary is a beast and needs to be in prison........TRUMP is the only candidate that deserves to be president","post_message":"I will defeat Hillary Clinton - and MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1244912678938315","commenter_b":"... Hillary Clinton for 2016 ...","commenter_a":"A terrorist killed your son. A terrorist the FBI removed from the watch list.Sorry for your loss, it must be devastating but Obama and Hillary wants more terrorists to come here.","post_message":"'Christopher's paternal grandparents met and fell in love in a Japanese internment camp, so it was in in DNA that love always trumps hate.'  - Christine Leinonen remembers her son Christopher, who was killed in the shooting at Pulse Nightclub in Orlando  Watch as the DNC took on the gun lobby: @webpagelink"},{"comment_id":"10153475546708734","commenter_b":"So why is she crying rape now? It's not going to get her out of the ticket, is it?","commenter_a":"Sorry but she is not a victim! And the so-called officer is a POS!","post_message":"The female victim initially agreed to engage in a sex act in exchange for money. Then during that encounter, Tucker allegedly pointed a gun at her and forced her to engage in another sex act against her will."},{"comment_id":"1037202013040797","commenter_b":"'@username oh go screw yourself you ignorant idiot i could care less about what you think ....arrogant pig","commenter_a":"Just goes to show what kind of trash is on trumps payroll he is nothing but a pig and so are his delegates OPEN YOUR EYES PEOPLE he is nothing but a piece of crap","post_message":"The Trump campaign said the man will be replaced immediately."}]
