[{"comment_id":"10152804674496094","commenter_b":"Can't wait to put the clothesline back up...hard to hang dry all the time when you're in a deep freeze for several months of the year.","commenter_a":"Lets force them!","post_message":"Human beings are highly adaptable, but even in the face of climate change, many remain unwilling to do more than tweak their current lifestyles."},{"comment_id":"10154755493169138","commenter_b":"Trump wont go after Hillary! His people will definitely do that! Trey goudy wants her head!","commenter_a":"I hope she gets bit in the butt and now I hope Trump will investigate her once he is in office","post_message":"Stein, the Green Party candidate who got roughly 1 percent of the national vote, wants a recount in Michigan, Pennsylvania and Wisconsin."},{"comment_id":"10154584084924166","commenter_b":"no more cover girl for me","commenter_a":"How stupid!","post_message":"The makeup manufacturer calls him a \"boundary breaker\" who will appear in an upcoming commercial. What are your thoughts on guys and makeup?"},{"comment_id":"491174087737551","commenter_b":"Muslims offend me. Ban them from the U.S.","commenter_a":"BS!","post_message":"Muslims Want to Change Our Nation and Obama is letting them..."},{"comment_id":"956149327758873","commenter_b":"Hit it girl","commenter_a":"Indeed I do agree and it's another reason why I dislike them.","post_message":"Veterans have had it with Republicans using them as political props, while screwing them every chance they get. Do you agree with this veteran's take?"},{"comment_id":"10153504352285329","commenter_b":"She's been on hormones for years-that's where the breasts come from. And you can't see anything under the suit because it was removed. Think ya need your eyes checked","commenter_a":"Guys... Where did that breast come from so suddenly?","post_message":"The olympian and reality star has made her debut in the July issue of Vanity Fair)"},{"comment_id":"758408480932531","commenter_b":"A BRAVE WOMAN!","commenter_a":"Brave lady. Stay safe!","post_message":"Thanaa Jawabreh prompts a heated debate following a public apology for the ‘horrendous’ shooting attack that killed aIsraeli couple."}]
