[{"comment_id":"10153331203624614","commenter_b":"@username Sure, black bears are much smaller than grizzly bears, and a couple of humans could scare it away","commenter_a":"What I noticed was all the younger guys running and totally leaving the few elderly people behind...shame :/","post_message":"A Montana wildlife official captured video of an unnerving encounter between humans and bears on a bridge in Yellowstone National Park. The footage shows several apparent tourists making a dash to safety after finding themselves a little too close to a black bear sow and her three cubs. No one was injured in the incident, and the animals made their way safely back to the forest, officials said. Read KTLA's story here: @webpagelink"},{"comment_id":"10154887847131729","commenter_b":"Take your head rag with you. Ungrateful bitch","commenter_a":"You are disgrace to my country! Pack your bags and go to one of the Muslim countries where you will be treated like a dog because you are female. What an ungrateful idiot.","post_message":"Seriously?"},{"comment_id":"901774593215623","commenter_b":"About time we had larger ladies ,","commenter_a":"looks interesting !!!","post_message":"'I feel sexy and confident'"},{"comment_id":"1916311915262611","commenter_b":"Wrong country? Or city? Please, do not behave yourselves wiser than Asians or Muslims. It's a sin. We have to love each nation regardless their colour, religion, geographic location.","commenter_a":"Pithy Vann that sucks","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"},{"comment_id":"1292616690749798","commenter_b":"I need to learn how to do that. You never know when you need to live stream.","commenter_a":"This was one smart woman! Her cool during this was amazing. Streaming it to FB was really smart. If the cops took her phone the record was still there. I hope others follow her example.","post_message":"The aftermath was streamed live on Facebook for the world to see."},{"comment_id":"10154331232125530","commenter_b":"Lol frfr and I would have them together honey","commenter_a":"@username they should put U in charge","post_message":"Fire up, Detroit Lions fans! Cheerleaders will be on the field soon!"},{"comment_id":"1185050781573456","commenter_b":"This lady is nothing but pure Evil","commenter_a":"Same ole same ole.","post_message":"A top official was just discovered dead... he was scheduled to testify against Hillary Clinton in an up coming corruption case. Our thoughts and prayers go out to his family...this is just terrible."}]
