[{"comment_id":"551724101692742","commenter_b":"He is the Only Hope we have,,,,,,,,can't keep Letting Career politicians Destroy Our Country!","commenter_a":"Yes I do!!!","post_message":"More than half of Trump supporters say he won't be able to fix America.   Do you think Trump will be able to 'Make America Great Again'?"},{"comment_id":"10153586502256336","commenter_b":"It's about time somebody is sticking up for the ppl that are born here & paid taxes, the illegals come here & get all the benefits we can't have, plus they're here to vote so they can get all the free stuff","commenter_a":"I believe that Mr. Trump will do better for the American people. And bringing back our Jobs.","post_message":"'Our elected leaders in Congress and The White House have chosen to stand down as the sovereignty of our great nation has been violated,' Todd Starnes wrote."},{"comment_id":"10155083896191178","commenter_b":"He might bring racist charges up against you","commenter_a":"OK I'm going to say it Everyone is racist OK we get it wahh wahh wahh!","post_message":"The histrionic grumblings for the liberal parodies over at MSNBC are STILL outraged over Sen. Sessions.  Liberals never seem to realize that they've worn out the racism accusation."},{"comment_id":"1024492464317039","commenter_b":"'@username, we can send all illegals home and we'll start with you! Mexican Americans/Native Americans are the only people who this land belongs to. So dip","commenter_a":"Where's the mom so she can start putting graduation pictures up and say that her kid never did anything wrong that he was a good kid and never did drugs Ill be waiting","post_message":"NEW VIDEO: #Chicago police have just released dashcam video that shows a female cop being beaten by a man who was high on PCP. (WARNING: Video is very graphic and has inappropriate language) @webpagelink"},{"comment_id":"10153813591902293","commenter_b":"Jealous women!","commenter_a":"Hmmm.....now what kind of people would call in and complain about a woman's bare shoulders......any guesses?","post_message":"The station received several e-mails during the broadcast complaining about her bare shoulders."},{"comment_id":"10153448398281350","commenter_b":"She lied to get jobs","commenter_a":"Why is ok for Bruce Jenner to claim to be a woman and not ok for Rachel to be black if that is what she wants ?","post_message":"'I did feel at some point I would need to address the complexity about my identity.'"},{"comment_id":"1605375073100237","commenter_b":"Fuck him and his family. Good job lady and sorry you had to as nobody wants to kill someone. But they will kill, torture, and rape you. Good you were armed. God bless you.","commenter_a":"Why do we allow people like this to contribute to the GENE POOL? His whole family should be spaded and or neutered. Why because of IDIOTIC lines like 'he needed money for clothes' what happen to all the government hand outs this family was getting, cause sure as shit they all were on welfare and not one ever held a job. As to whether or not it was the home owners fault is by far the most asinine thing ever spoken.","post_message":"This teen punk broke into a woman's home and tried to rob her. But she defended herself, and left him dead.  Now the punk's family is asking an absolutely sickening question, that left the woman and her friends shocked.  Only in Obama's America..."}]
