[{"comment_id":"432105150316631","commenter_b":"Haul her a•s to jail ???","commenter_a":"I would love to jerk the whole outfit off. Would stop a lot of shoplifting for a start😡👳🏾","post_message":"NO SHARIA LAW IN AMERICA!"},{"comment_id":"907462056016714","commenter_b":"Terry, but the illegals are taking away jobs from the blacks. WAKE UP. Joes trying to help you.","commenter_a":"GO JOE!! ..........someone needs to investigate these corrupt Liberal Judges","post_message":"And it gets worse ..."},{"comment_id":"10152904733026051","commenter_b":"I would love to get my hands on the bitch who wrote that! I'm very sorry that there are people out there like that.","commenter_a":"Key their car","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"10154263809393598","commenter_b":"A very sick lady, Murderer. Lier. Corrupt.","commenter_a":"SHE WILL EAT THOSE WORDS ONE OF THESE DAYS","post_message":"As the debate begins, remember.... Hillary Clinton: An Unborn Child Just Hours Before Delivery Has No Constitutional Rights"},{"comment_id":"10154738183646336","commenter_b":"But who's the hideous woman in the video?","commenter_a":"Well... he's certainly on the right show","post_message":"\"I understand why you're angry. You have every right to be angry – the system has failed you. But he is not the solution.\"  Filmmaker Michael Moore has a message for Donald J. Trump supporters who feel let down by the government. @webpagelink"},{"comment_id":"968873019828099","commenter_b":"Some dumb uuuugly woman","commenter_a":"Who is Kim Kardashian and why must I look at this?","post_message":"#KimKardashian felt #liberated, Bette Midler didn't!"},{"comment_id":"1641151569508654","commenter_b":"@username: no fault but Puerto Ricos...pretty sure they had a chance to vote for independence, and y'all didn't take it. You can have all the cultural pride you want...but it's the Olympics man, it is only for countries to compete in. Why not have Coca Cola and Pepsi join in?","commenter_a":"The underdog defeating the #2 in the world for gold.. Monica eres grande!!! PUERTO RICO!!! and to the bunch of salty Americans go read a book and learn about the damage the USA has done to PR!!","post_message":"After some of her more dramatic points, fans were shouting \"Si se puede\" and waving the flag of Puerto Rico."}]
