[{"comment_id":"1300544240024109","commenter_b":"She'll be kissing a whole lot of ass in jail","commenter_a":"The bitch lost - America knows she is a lying bitch now she has to kiss his ass to try to keep her out of jail","post_message":"It's over."},{"comment_id":"10154566623729877","commenter_b":"Copycats!","commenter_a":"Obsessed with Obama like the petulant envious kid trying to copy everything related to their nemesis!","post_message":"The Trumps just don't plagiarize speeches — they also lack originality when it comes to cakes. Go figure."},{"comment_id":"10153875046907235","commenter_b":"So did Ollie North! The fuckery.......","commenter_a":"\"Former United States Attorney general sold guns to drug cartels.\"","post_message":"WHOA"},{"comment_id":"10153458857456107","commenter_b":"Keep them out.","commenter_a":"As an avid, long-time, supporter of your campaign (I mean... I was hoping you'd run for president back in '04), I am very disappointed to see you taking this fearful and outdated stance. Isis doesn't need refugees to sneak into our country, they have the internet.","post_message":"Today I introduced a bill that calls for an immediate moratorium on visas for refugees. My bill will also stop all refugees as well as others from obtaining visas to immigrate, visit, or study in the U.S. from about 30 countries that have significant jihadist movements. This bill will be paid for with a special tax on arms sales to any of these countries. Read more here: @webpagelink"},{"comment_id":"1038357019610877","commenter_b":"If BERNIE goes Independent, or goes Green, then Good, Hillary is a bitch, a liar, a thief. BERNIE should do anything and everything he can to defeat the nasty bitch. #NeverHillary #BernieSanders2016","commenter_a":"We may still be able to achieve some things of value at the convention. Bernie's current top priority at the convention (as stated in a conference call with his delegates) is to change the Democratic party rules to \"un-rig\" future Democratic primaries so they will be fair to future Democratic party presidential candidates. For him (and our delegates) to have any chance of making future Democratic primaries more fair via votes in the rules committee at the convention, we need to get all our pledged Bernie delegates funded. We are still at risk of losing over 100 pledged Bernie delegate votes, purely due to lack of funds. That's down from over 200 a couple of weeks ago because we have never stopped trying to get them funded. For everyone who is #StillSanders, can you please consider donating $2.70, $5 or $10 (if you can spare a few dollars) to help ...","post_message":"We are building a movement because this country belongs to all of us - not just a handful of billionaires and wealthy campaign contributors. And I'm asking people across the nation to come together and organize an unprecedented grassroots movement."},{"comment_id":"10153546478451337","commenter_b":"Bitch? Way to completely destroy everything no makeup selfies are meant to promote","commenter_a":"that bitch is bad without makeup real talk","post_message":"PERFECT RESPONSE: Watch Lana - WWE perfectly shut down her Instagram trolls..."},{"comment_id":"1115743115130630","commenter_b":"No Jay Reed, it doesn't offend me because, undocumented immigrants pay taxes, create business, and help the country's economy. Undocumented immigrants don't obtain unexpected or desabilty benefit even when they pay to the programs.","commenter_a":"California has no place for this disgusting xenophobic individual. Dump Donald Trump where he belongs. .the trash Dump.","post_message":"Protesters smashed a police cruiser and at least one fight broke out after Donald J. Trump's rally in Southern California Thursday night."}]
