[{"comment_id":"10157646411850093","commenter_b":"But a woman who puts dow","commenter_a":"Who wants to manage him? It is just human nature to defend yourself when someone tells lies about you. There is no proof that he called this lady Miss a Piggy and Miss Housekeeping. The video showed him defending her and complimenting her. I don't believe her story. She just wanted her 15 minutes of fame and the Clinton campaign probably paid her. I want a President who stands up for himself when attacked. I certainly defend myself when someone lies about me!! We need a strong leader!!!","post_message":"Leading conservatives are engaging in wishful thinking."},{"comment_id":"10153203390966320","commenter_b":"Actually it's rent stabilized...different rules...","commenter_a":"a rent controlled apartment can not cost more than 2,100 a month. It even says so in the tenant laws","post_message":"Tenant accused of listing rate stabilized apartment for $649 a night on Airbnb @webpagelink"},{"comment_id":"1726486197616166","commenter_b":"She needs a male beside her. They wont vote for","commenter_a":"Love my Senator, Tim Kaine. But Elizabeth Warren should be the Veep pick. Please make it happen, Madame Secretary!","post_message":"Watch live as Hillary and Senator Tim Kaine take the stage in Virginia ⬇️"},{"comment_id":"10155581523315192","commenter_b":"Girl should be held responsible for her actions!!!","commenter_a":"Not news.","post_message":"This came to light when a mom received a nude picture of her daughter in a text message:"},{"comment_id":"1607872669509039","commenter_b":"All those white people in the crowd. Not enough Super predators. We need more super predators in the crowd please.","commenter_a":"killary for prison","post_message":""},{"comment_id":"10153939365405329","commenter_b":"Las lamparas y el cosito para escurrir los cubiertos <3","commenter_a":"Invente o si te gustan los elefantes @username","post_message":"Because elephants are beautiful and lovely and perfect. (via BuzzFeed Animals)"},{"comment_id":"10153368528042217","commenter_b":"i might put some tinfoil hats on eBay...","commenter_a":"if this crap conspiracy rubbish was true, the yanks would of asked us to extradite him, which we would have done. its that simple.","post_message":"A UN panel will conclude the Wikileaks founder is being \"arbitrarily detained\" in the UK, the Swedish foreign ministry has said."}]
