[{"comment_id":"10154450153734411","commenter_b":"@username Is there a government on this planet that is not - up to no good - ?","commenter_a":"Why are they bombing their own airport... ISIS Turks are weird","post_message":"BREAKING - #ATATURK #BLASTS:  - at least 50 dead - about 60 wounded - 2 explosions"},{"comment_id":"1555989074419098","commenter_b":"We'd have have a democracy in the first place to lose. Seem that ideal is long gone","commenter_a":"This is a response to the hard tack to the left by progressives. This is the fruit of your insane policies and social engineering. You have created the potential for an authoritarian American government. It won't happen instantly, but in increments. I have to admit, I prefer this future to a nation that celebrates stomping upon our flag, allowing veterans to die waiting for medical treatment in favor of allotting medical benefits to illegal aliens, and referring to children as purple penguins.","post_message":"The frightening rise of authoritarian populism in the West is a very real, clear and present danger, writes Mike Lofgren, a former congressional staff member."},{"comment_id":"10153085951882507","commenter_b":"no problem at all, as long as the part of the ----> well regulated militia <------ is the main factor, and not as is current, --> any inbred psychopath can buy any number of military grade weapons and high capacity magazine and then proceed to walk into restaurants with them.","commenter_a":"So this of course applies to second amendment rights also, correct?","post_message":""},{"comment_id":"1197816346947147","commenter_b":"She is a nasty offensive woman, and deserves being humiliated.","commenter_a":"I despise what she did to our good men and women in Benghazi and I despise her lying but this is offensive. I am embarrassed for you that you post something as low as this.","post_message":"OMG! The AP Took This Photo Of Hillary And It Proves She's Literally Full Of Crap! She Wants It Destroyed!  OOPSIE! Talk about a sh*ty situation! Let's make this viral!   Spread this everywhere if it made you LOL-"},{"comment_id":"1690937014458022","commenter_b":"Stupid Swede!","commenter_a":"Another nut","post_message":"This is INSANE..."},{"comment_id":"10156410644080725","commenter_b":".... And thats why im voting for Bernie Sanders and not a wealthy racist biggot like yourself.Mr. Trump our country doesnt need you.. you talk about about immagrants but all your wives were immagrants? What are you but an immagrant to this country yourself! Unless your native but that would be news to us! What tribe you belong to?? I.D cards to all the muslims in this country? Is this Nazi Germany???","commenter_a":"Trump is like a pre-PC candidate! So refreshing!! I remember feeling just a leetle bit awkward at first. That made me realize just how far we've fallen! #TeamTrump2016 #MakeAmericaGreatAgain #DitchAndSwitchNow","post_message":"People have got to stop working to be so politically correct and focus all of their energy on finding solutions to very complex problems!"},{"comment_id":"1859752354244114","commenter_b":"She is very stupid...and very mixed up..crazed..","commenter_a":"FUCK-YOU,YOU LYING ESTABLISHMENT PIECE-OF-SHIT...THIS BOOTLICKING PUBLICATION ISNT EVEN WORTH WHIPING YOUR ASS WITH...NO RIGHT-MINDED UNDIVIDUAL/FREETHINKING PERSON CARES ABOUT THE PARTISAN-CORRUPT GARBAGE THAT YOU CREATE OUT OF FABRICATED LIES...SO,GO SHOVE YOUR HEAD RIGHT BACK UP #MADAMEINMATE666'S FATASS AND QUIT PRETENDING TO BE A JOURNALIST PUBLISHING NEWS...FUK-OFF.","post_message":"It’s official now: Jill Stein—and the Green party if it agrees with her—is/are a waste of space.  By Daily Kos user BoGardiner"}]
