[{"comment_id":"10152847056142411","commenter_b":"Bill","commenter_a":"Its because Chicago is ran by a bunch of idiots.","post_message":"Have you ever witnessed a utility company ripping up a street or sidewalk that had recently been repaved? Chicago has a department that's supposed to coordinate schedules between the city and utilities. But it's not working as well as it should - and that means taxpayer money is being wasted. Dan Ponce reports: @webpagelink"},{"comment_id":"10155447635791509","commenter_b":"She just needs to shut up. She's backing a rapist wife","commenter_a":"Wikileaks is Hillary's nightmare","post_message":"\"I can't believe that I am saying that a candidate for President of the United States has bragged about sexually assaulting women,\" Michelle Obama, speaking in New Hampshire, addresses the Donald J. Trump tape @webpagelink"},{"comment_id":"10153567099501509","commenter_b":"Throw those Muslims overboard!!","commenter_a":"May God forgive them","post_message":"Muslims who were among migrants trying to get from Libya to Italy in a boat this week threw 12 fellow passengers overboard -- killing them -- because the 12 were Christians, Italian police said. @webpagelink"},{"comment_id":"10154451446444614","commenter_b":"Good that is what she gets. She is a cruel person","commenter_a":"She needs to be criminally charged and have to register as a sex offender.","post_message":"Dani Mathers has been banned from all LA Fitness gyms after she took a photo of a woman inside a locker room and posted it on social media with disparaging comments about her body."},{"comment_id":"10153533859861615","commenter_b":"Get that creep off the streets, love that area. People are so sick.","commenter_a":"Diane Fickley Pesci","post_message":"“(He) blocked her so she couldn’t go any further that way and says, ‘Hey, want to have a good time?’” NOW ON CHANNEL 11 MORNING NEWS: A man is being questioned in connection with an attempted luring of a teenage girl -- in the parking lot of South Hills Village Mall. Hear what she and her mom did to help police track him down."},{"comment_id":"1154135184625068","commenter_b":"@username,get that trailer cleaned up woman!","commenter_a":"Fake","post_message":"\"Donald Trump’s birther event is the greatest trick he’s ever pulled\""},{"comment_id":"1582505828713381","commenter_b":"@username That is right on the money but it goes even further than that. The phrase well regulated militia did not mean the same thing that people understand it to be now. At that time well regulated meant that every man was to be completely equipped on his own dime. Every citizen was expected to be armed and ready to defend their community. Consider that at that time there were still unfriendly hostiles that raided towns and farms. Each citizen was expected to be armed and would have been quite foolish not to be. These days as civilization seems to be degenerating we are also faced with the dangers of criminals and terrorists and yes even perhaps our own government. People have been conditioned to be drones who don't bother with thinking so they let the government do it for them. What they fail to realize is that the government ...","commenter_a":"People have rights, not militias. Militias depend on people having rights, people's rights do not depend on being in a militia. Let's parse this: The 2nd Amendment consists of two clauses. The first clause \"A well regulated Militia, being necessary to the security of a free State\" is a dependent clause, because it is not a complete sentence. It cannot stand on its own. The second clause \"the right of the people to keep and bear Arms, shall not be infringed\" forms a complete sentence, it is an independent clause. The first clause is dependent on the second clause. Or, in simple English, the existence of a militia (which is essential to the security of a free State), is DEPENDENT on people having un-infringed rights, not the other way around. No laws, licenses, permits or taxes that by design are designed to keep Americans from exercising their 2A right can ...","post_message":"California Lt. Gov. Gavin Newsom, who's pushing more gun control in The Golden State, recently appeared on Chelsea Handler's show. Not only did they slam the NRA (not surprising), Handler also said American gun owners are \"embarrassing.\""}]
