[{"comment_id":"10153871783832232","commenter_b":"Stop being such a witch","commenter_a":"Why would a news encourage this stupid behavior there has to be more important news for them to be reporting on","post_message":"We don't recommend this, but the boys swim team from Hatboro Horsham found a new way to practice. Thanks to NBC10 viewer Kimberly McPoyle for sharing! Stay with NBC10 for full coverage of #Blizzard2016. --> @webpagelink"},{"comment_id":"1501291303224228","commenter_b":"@username one of the Deplorables. He quotes Breitbart. You instantly lose all credibility; and can't be taken serious. Here let me fix this for you...... @webpagelink","commenter_a":"Nevermind the Democrats who are actually poisoning the people of Flint, right?","post_message":"“Mr. Trump, I invited you here to thank us for what we’ve done in Flint, not give a political speech,” the pastor said."},{"comment_id":"10152940333217061","commenter_b":"@username shes a hoe","commenter_a":"Hi Guys :) I'm Ashley :) 19 years <3 , I m Single and beautiful <3 girl <3 please like my page :) in 2 secs and i'll send you a friend request and inbox you <3 you will never regret, :( i promise you, please support me by just 1 like <3 1 Like (y) = 99 Help <3","post_message":"Police: Jake Lloyd, the actor known for his role as young Anakin Skywalker in 'Star Wars', arrested: @webpagelink"},{"comment_id":"10154449367595470","commenter_b":"Trump means GET RID OF MUSLIMS","commenter_a":"This is typical of the Hillary group","post_message":"Local republicans say they don't think the act of vandalism was done by a Trump supporter but they say they don't condone that type of behavior. They are hopeful it will stop and be replaced by actual conversations about opposing ideas."},{"comment_id":"10153245501553984","commenter_b":"This is a state matter not federal.If these Muslims can't live by the laws that are already here and set then I suggest they leave.Preferably the latter.","commenter_a":"go girl ... rippem up !","post_message":"Political correctness is NOT in this mayor's vocabulary.   Do you support her stand against Sharia Law?"},{"comment_id":"1074790329229886","commenter_b":"You're going to be the sad one when this country has the problems all countries that Muslims populate have, rape murder persecution. All countries that are being invaded by \" refugees \" are living in fear, there are NO success stories of peaceful Muslims coexisting","commenter_a":"These comments reflect a said piece of America that just wont die... Progress has left you behind, blind and ignorant. You worship a billionarw who says he cares about you while sending your jobs overseas, knows nothing of history, and can't answer direct questions about policy. The world mocks you, I pitty you","post_message":"A GREAT NIGHT IN IOWA! Thank you for all of your support. Get out and VOTE! TOGETHER we will MAKE AMERICA GREAT AGAIN! #IACaucus #FITN"},{"comment_id":"10155127516070294","commenter_b":"A**hole","commenter_a":"Blacks,, that's all they know.","post_message":"You may have seen the video circulating online...  Now, because of social media, police say two people have been arrested in the large brawl at Beachwood Place Mall the day after Christmas. More here: @webpagelink"}]
