[{"comment_id":"1038927489460337","commenter_b":"As for your statement about businesses being free to do what they want, I very respectfully suggest that you read some civil rights history. Businesses used to post signs such as \"Help Wanted--Irish Need Not Apply\" or of course Jim Crow laws. Would you seriously be okay with the return of Jim Crow? Businesses have discriminated in horribly blatant ways. Up until just a few years ago women weren't allowed to be members of all sorts of organizations even though there was nothing about the organization that was impossible for women (they were mostly golf and country clubs). We've had 50 years of the Civil Rights Act which people seem happy to toss out the window. If that were to happen, you yourself could easily be discriminated against with no recourse. Please read some civil rights history and see what incredibly horrible things were said and done to decent, hard-working ...","commenter_a":"I thought a private business owner reserved the right to refuse service to anyone for any reason. We have a sign up at work that says exactly that. I may think his is a dumb reason (even though to him it is not), but he is a private business owner operating on private property and should have the right to do business with whomever he wishes, and not do business with whomever he doesn't wish to do business with. That being said, I wonder what he'd say if he tried to go into a diner for lunch and saw a sign that said \"No Christians allowed.\"","post_message":"A Florida gun supply owner says his store is now a “Muslim-free zone” -- after the deadly shooting in Tennessee. Here's what an American-Islamic group had to say in response: kiro.tv/GunStore What do you think of the owner's actions?"},{"comment_id":"10152659193766680","commenter_b":"Not for the people in charge.","commenter_a":"They're right, our presidential debate system is broken.","post_message":"The group aims to make it easier for independent candidates to get a coveted spot on the national stage in the fall of 2016."},{"comment_id":"1199877433404302","commenter_b":"Neither. I refuse to vote for a disgusting womanizer who cares nothing about this country and I also refuse to vote for a woman who has covered up her husband's sexual assaults and has allowed troops and ambassadors to die on her watch. They are both liars and cheats and I will pray for this country everyday until either one of them is finally out of office.","commenter_a":"Hillary Clinton","post_message":"Women Voters Only: Your Choice for President?"},{"comment_id":"10153898443761770","commenter_b":"In GOD we TRUST....Vote for Trump/Pence 2016..Hillary hate guns because dangerous to the toddlers!!! But In the GOD's name why she's ok to rip out the unborn 9 months in the womb...and Hillary sharing our national classify to others and exchange to pay her ...GOD bless American people to support Trump... because only Trump/Pence can stop government corrupt, bring job, boom the economy, protect our family and help veterans, military and make America safe and great again... that Hillary been extremely careless to protect our national security....and Trump will stop Hillary accepting money from foreign country that treat LGBTQ and women like animal... and Hillary call all my Africa-American friends \"SUPER PREDATOR \" and insulting all my Latinos & Latinas \"NEEDY & BOWL of TACO\"","commenter_a":"Who gives a damn","post_message":"Nate Schmidt of the Washington Capitals sits down with David Hookstead to talk about life as an NHL player."},{"comment_id":"10153058205158984","commenter_b":"Good job, give the woman a raise.","commenter_a":"Would her employer be happier if she was the one who was shot??? I commend her for having the courage to stand up for herself","post_message":"I don't think this robber thought that holding a woman on the ground at gunpoint would land him a bullet to the face, but this gal delivers more than just pizzas! Do you think this woman should be afraid of getting fired for defending her life?"},{"comment_id":"10154308698454607","commenter_b":"Do these liberal protesters have jobs!!!!!!","commenter_a":"The US is being ridiculed by idiotic liberals who are obviously clueless on what President Trump is doing, protecting Americans!!! I live less than 20 miles away from that radical Islamic terrorist attack in San Bernardino, where 14 innocent people were murdered!! It's not Trump's fault that our government is so corrupted and does not have an immigration accountability system to know who exactly is entering our country! There are Isis training camps all over the United States! If you don't believe me Google it!!! There is an Islamic training camp less than 10 miles away. They are spreading like a disease everywhere! Last year local law enforcement caught 16 radical Islamic Muslims training near the a river bed all of them had AK-47's!!! All of them are now being investigated by FBI! 5 of which are on the top 10 most wanted list!!! Do you want to know why ...","post_message":""},{"comment_id":"1354769341225150","commenter_b":"How'd you like this one -60% of the USA. illegal population resides in the Golden State. That is one of many reasons why our politicians support this crap! Frankly, that is one reason why our state taxes are incredibly high and the other is bad management without accountability. We also have a disproportionate amount of refugees getting relocated here and illegals residing in our prisons.","commenter_a":"Californians are beyond reasoning!!! They refuse to obey a national law on harboring illegal aliens, and yet have the gall to ask for funding to support those illegals they are harboring!!! NO FEDERAL FUNDS SHOULD GO TO CALIFORNIA UNTIL THEY DEPORT THE ILLEGALS THEY ARE HARBORING!!!!!","post_message":"I can't believe they asked for THIS!"}]
