[{"comment_id":"1322864184423514","commenter_b":"Tear down their tereorist head quarters that's what all mosque's are . And deport them all","commenter_a":"good on you Donald deport them all","post_message":"TRUMP IS GOING TO CLEAN UP THE INSANITY THAT HAS BECOME AMERICA!"},{"comment_id":"10153562142188717","commenter_b":"Yes! Please leave!","commenter_a":"good for her .. Tah Tah","post_message":"Raven-Symone, co-host of \"The View,\" swore on the talk show that she will move to Canada \"if any Republican gets nominated\" for president."},{"comment_id":"10153183802333188","commenter_b":"\"The walking dead\" are serving as most of our representatives in Washington, take a good look next time someone speaks to the Congress.","commenter_a":"Why do you think it's so good? It prepares us for what we might expect in a SHTF scenario.","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"10153560993130667","commenter_b":"Sounds like Hellen Hollands is just a plain old witch to me.","commenter_a":"This school and school district should be ashamed of themselves. This young man left school in order to live - to SAVE HIS LIFE. He deserves every single thing that graduation affords, other than his actual diploma (which he will receive in December). I'm guessing there is no graduation ceremony in December, so he gets no graduation? School systems across America are failing their students every single day. Rules are made to be broken, changed or given a pass","post_message":"\"I never asked to receive a diploma and am even okay with not walking across that stage or having my name called. I just want to be a part of the ceremony.\""},{"comment_id":"10154208723663984","commenter_b":"The Clinton's are the world's greatest LIARS and they do not give a Damm about you fools who will vote for her ,this woman is a evil woman , but her sheep are if the dumbest people in this country.","commenter_a":"Boy, the \"free\" press keeping her back. Boy, they do the same for the Republicans, the only difference they erase the good comments.","post_message":"A CBS reporter asked Hillary a question about the Brussels attack, but then after she said this 1 thing they IMMEDIATELY cut her off and cut to commercial. This is absolutely nuts."},{"comment_id":"10154464043803010","commenter_b":"Stfu bitch","commenter_a":"Cop shot the hood who shot him. Case closed. #righteouskill","post_message":"Officers stumbled into a shooting in progress, and a gun battle ensued."},{"comment_id":"837415593047972","commenter_b":"what a lying hag she associates herself above everyone no matter color!!!!!!!","commenter_a":"Excuse me, is Hillary Clinton talking about humility ? - What a joke !","post_message":"Give me a break!"}]
