[{"comment_id":"10153178614619342","commenter_b":"This dude doesn't even capitalize TEXAS or GOD and y'all comment on this???Surely the fear of God sounds so Christian???? LOVE IS LOVE END OF STORY!!!","commenter_a":"texas is a god fearing state.we will not compromise on our faith","post_message":"JUST IN: Texas Attorney General Ken Paxton calls the Supreme Court decision giving same-sex couples the right to marry a \"lawless ruling\" and says state workers can cite their religious objections in denying marriage licenses. STORY --> @webpagelink"},{"comment_id":"1142853059119585","commenter_b":"So's my father. Personally, I served a three year tour in the US Army.","commenter_a":"No! George Bush was in the service. But no one knows how he got out.","post_message":"Don't you EVER forget this... nor let these Republican chicken-hawks send your children off to die in wars for profit."},{"comment_id":"1242359992482301","commenter_b":"@username I know, I'm just saying. Course, they could always do what those nutters in that Ukrainian training video do.","commenter_a":"That's great and everything, but it's a whole different thing when there's bullets and shit coming back AT you. Paper doesn't fire back...","post_message":"See more training and combat at > Afghanistan Combat Footage - Funker530 CONTACT FRONT! ~Josh"},{"comment_id":"10154297413016378","commenter_b":"And, as usual when in the playoffs, promptly lose","commenter_a":"Haha, pretty sure Garrett said he wanted to keep the momentum going into the postseason. The only QB to move the ball was Romo and he got most of his yards through PI. The Boys were flat out beaten today. No excuses. Dallas has looked pretty weak the past few weeks.","post_message":"The Philadelphia Eagles end the season on a high note with a win over The Dallas Cowboys! Final Score: 27-13. @webpagelink Way to go Birds! E-A-G-L-E-S EAGLES!"},{"comment_id":"10151088515799999","commenter_b":"Such a misogynist!","commenter_a":"I was at Smith College when Maher came and spoke in the late 90s. His contempt for women was palpable. Not a surprise that he feels avuncular towards Milo. Once you accept it is okay to dehumanized one group, it is just a hop skip and jump away from demumanizing anyone.","post_message":"Bill Maher's interview with Milo Yiannopoulos was a mostly chummy affair. Then in a segment that ran after the broadcast, Yiannopoulos attacked transgender people."},{"comment_id":"1213471005342343","commenter_b":"Amnesty International can't even help the refugees that are dying in the Mediterranean today, all they can do is pick on Israel which is a democratic country and an easy target.","commenter_a":"Shame on you Amnesty International!","post_message":"This is ABSURD! How could they get away with this??"},{"comment_id":"1868770480033724","commenter_b":"Why, because the system is being drained my illegal aliens and the corrupt gov. Trump is fixing that open your eyes.","commenter_a":"This is as embarrassing as it can get. I wouldn't want to be president of a country if I had to think so negative about it. America is a great place to live but they r making some poorer each day. Cut Social Security, cut Medicare, cut insurance , cut food stamp, cut cut. Why?","post_message":"No. Words."}]
