[{"comment_id":"686707531519825","commenter_b":"Don't bother coming back here bitch ! if you do , they need to hang ya.","commenter_a":"Keep her.","post_message":"A woman who left home to join ISIS just got served up some karma. Good. Anyone supporting ISIS is a traitor to America. Click 'LIKE' if you agree!"},{"comment_id":"10153720554479330","commenter_b":"Exactly Kathy!! Lets duct tape her mouth shut!!!","commenter_a":"Good!! Can we duct tape her mouth!?!? I don't care that she made a post after this one saying that she was trying to make a point and that the dog stopped barking, no excuses and the dog was probably scared that the human he trusted would do this again!! She needs to be held accountable for this!!","post_message":"UPDATE: Police in Florida plan to speak with the person behind this viral Facebook post. So many calls reporting it as animal abuse have flooded into police departments from Connecticut to Florida that they've had to call in extra workers. --> @webpagelink"},{"comment_id":"10153636723007507","commenter_b":"^This is feminism. Mmmmm smell the equality!","commenter_a":"You know what? Doctors have been ignoring women's pain as imaginary forever. Everything is not about race.","post_message":"The need to constantly reiterate black humanity—because that’s what this comes down to—is both fatiguing, and frankly, infuriating."},{"comment_id":"1339247516091906","commenter_b":"America is turning vile and to bad for those who can't see it. If we keep it up we all lose .","commenter_a":"That is because it's a love fest! Everyone eventually comes around and loves Trump! He will be our greatest president in modern history! #trump2016","post_message":"Fox News host Megyn Kelly and Republican presidential candidate Donald J. Trump met in New York City on Wednesday morning."},{"comment_id":"1356943270993679","commenter_b":"Take away about 15-20 million illegal immigrants and where are you? Be careful what you wish for.","commenter_a":"Yet, those \"islands\" hold the majority of the population... which will continue to increase as urbanization increases. You can play spatial games with maps all you want, but the reality is, our country should be predicated on the idea of one person, one vote (equal representation).","post_message":"This is actually a very informative map."},{"comment_id":"381679348687026","commenter_b":"Yeah, and look what we have now. A man and woman who think they are king and queen and are destroying our country. Stop him.","commenter_a":"George Bush was a really great President and Laura Bush so graceful and elegant!","post_message":"We love George W. Bush...such a true class humour!"},{"comment_id":"10155155813577642","commenter_b":"Yes my last name is Perez, so what. My family and I aren't afraid because they did it the right way when coming over, they obeyed the law! No matter what ones last name is we are all immigrants, but there is a difference between immigrants and illegal immigrants. So sad that many people people don't realize the difference like yourself.","commenter_a":"What part do you all not understand or haven't read??? She entered the United States illegally November 2015!!!! Judge ordered her out of the US on January 26th. She broke the law!!! Yes it's sad that she MAY have a brain tumor but even the doctors have said they aren't for sure that it's cancerous. Doctors have cleared her medically to be discharged from the hospital in a stable condition! She had a medical episode on February 11th but once again got discharged from the hospital! So what makes this case \"non humane\" that you all speak of?!?!? She has broken the law, she has gotten medical help and was released from a medical team outside the detention center. Nothing inhumane going on!","post_message":"An undocumented 26-year-old woman from El Salvador who has a brain tumor was moved from a hospital to an ICE detention center in Texas."}]
