[{"comment_id":"10153692809021694","commenter_b":"\"there are people who care enough to find you\" Riverrrrrr??? D:","commenter_a":"@username :0","post_message":"We have so many questions, but we won't have to wait long for answers!"},{"comment_id":"10153113757150329","commenter_b":"I am 5 ft 9 and wear a 22. She is 4\" shorter than me., She is sitting sideways and we all know when we sit down the bulges show more. if she was standing up you would be able to tell better. She is gorgeous and fyi anything over a 12 is considered obese in the weight scale","commenter_a":"If she's a size 22 then I'm also a white woman.","post_message":"Meet Tess Holliday, a size 22 model who is the first of her size and height to be signed to a major agency."},{"comment_id":"1049253181797877","commenter_b":"So HRC YOU WILL NEVER WIN CALIFORNIA @webpagelink","commenter_a":"Hillary,we want you back at the White House!!","post_message":""},{"comment_id":"10157706187460354","commenter_b":"She was a joke","commenter_a":"Thud... Rolling stumble... Face plant. \"Humph, that pit of lies I just tripped on was not clearly marked.\"","post_message":"Did you HEAR what Hillary said at the Commander-in-Chief Forum?!"},{"comment_id":"10154253294384486","commenter_b":"Jack, this heartless bitch is worse than an animal","commenter_a":"make no mistake,this is an animal","post_message":"Only 12,000 more signatures needed...."},{"comment_id":"1783804358520815","commenter_b":"Shut up....","commenter_a":"As reprehensible as Dylann Roof's crimes are, the death penalty is simply a barbaric act that brings a blood-lust satisfaction. There is no Hell to which criminals are consigned that is worse than lifetime confinement.","post_message":"Defense attorneys for Dylann Roof, who is accused of killing nine people at a church in Charleston, South Carolina, filed a legal challenge to the constitutionality of the federal death penalty."},{"comment_id":"1765463453479427","commenter_b":"Tell that to these women. @webpagelink","commenter_a":"Hey! if their good their good why not if that's what they want to do! and pass all the ground's for being able to handle it!","post_message":""}]
