[{"comment_id":"10150514383944999","commenter_b":"All terrorists are Muslim?","commenter_a":"\"Boko Haram (\"Western education is forbidden\"), officially called Jama'atu Ahlis Sunna Lidda'Awati Wal-Jihad (People Committed to the Prophet's Teachings for Propagation and Jihad), is a militant Islamist movement based in northeast Nigeria.\" There's that common denominator again: Islam.","post_message":"Soon after Boko Haram kidnapped nearly 300 teenage girls in Nigeria, the U.S. sent surveillance drones and about 30 intelligence and security experts to help the Nigerian military try to rescue them. Seven months later, not one of the kidnapped girls has been found."},{"comment_id":"10153850884477235","commenter_b":"Only a woman who knows full well that things have changed since the days of screen time for weather \"girls\" only could say something so offensive. She is not worried about being masculinized out of a job.","commenter_a":"Mentally challenged","post_message":"The stupid, it burns."},{"comment_id":"546377932240042","commenter_b":"Wage gap seems like it is there but you femminists are being insincere about what it really means. You dont take so many factors into account. Men are more likely to work overtime. Woman take maternity. Woman should be thankful for that! How about that woman tend to get degrees that end up being useless and so they have to take lower paying jobs that arent what they studied for. There are SOOOOOOO many factors yoi ignore but without a doubt a woman WILL BE PAID THE SAME IF SHE DOES THE SAME WORK AS A MAN","commenter_a":"As a guy, I still love this. Great idea to raise awareness and galvanize support for an end to the gender gap and income inequality","post_message":"Take a deep breath, guys."},{"comment_id":"520761104778849","commenter_b":"Muslims are taking over united states they run all motels and 7 elevens in the country I don't know if its cause our government gives them a break on payinv taxes!","commenter_a":"political correctness......","post_message":""},{"comment_id":"10154562004884749","commenter_b":"How do you know it's a woman. Would she/he submit to a dope test?","commenter_a":"So she wears a body suit and that makes her special. I think not.","post_message":"She didn't win her race, but she did make history."},{"comment_id":"10154285238753984","commenter_b":"Dumb fucks.","commenter_a":"Yeah your baby sixteen not thirty???? but with a gun???? l bet he said before l'm a man a man he probably never said l'm a baby!!!! He pointed a gun at some cops you don't do that.If you point a weapon at someone it's to use it.And a good baby doesn't run from cops!!!! A gang member thug??? a baby???pleaseeeeee!!!! Over all it's sad when a young teen dies in this awful way. But you!!!! the parents of this teen is to be blame even charge with child cruelty for not teaching your baby respect since the beginning!!!! again it angry's me the ending of this young man!!!!","post_message":"A police officer chased the 16-year-old after he says the teen fled on foot from a car and then pointed a gun at him, which resulted in the shooting. Protests immediate erupt after eyewitnesses make this huge claim about the incident..."},{"comment_id":"10154009646005695","commenter_b":"Add this to the list of reasons why #ChikFilA is so awesome","commenter_a":"That's bc CFL is a Christian company....no PB sandwiches....love it, gives u hope nation has not completely brought into 'crap on everybody while I make my millions' type of company.","post_message":"AWESOME! Volunteers delivered free sandwiches to first responders and victims of the storms."}]
