[{"comment_id":"1022251871143567","commenter_b":"Trump card xxx you trump is good for God's love you trump","commenter_a":"clinton, liar, e-mails, white water, rose wood , scandals.... what's with webb hubell? is he chelsea's dad??..Vince foster?? tell America the truth...corruption with clinton foundation, schlonged by obama, OWES favors, soros, lobbyists, muslims leaders..her illict affairs with, yoko ono, vince foster etc....covering up billie's affairs..stole thousands from W H..when clintons left...benghazi, terrible lies...she let those heroes die...yeah, poooooor victim.. killary will do, or say... any thing to get elected....","post_message":"Trump Issues A Major Threat To Hillary!"},{"comment_id":"10153933179656509","commenter_b":"Lol see what I mean? 'White people do this all the time.'","commenter_a":"Who could do such a thing? I don't want to hear that mental illness mess either. Lethal injection time.","post_message":"The suspect broke into the house and handcuffed the victims in their bedrooms -- and then shot them, authorities said. @webpagelink"},{"comment_id":"10153647642558352","commenter_b":"She's the other woman, this is why women need to stop claiming men until they put a ring on it and claim you","commenter_a":"Sad","post_message":"GIRLFRIEND FINDS OUT ON SOCIAL MEDIA HER SUPERSTAR SOCCER PLAYER BOYFRIEND MARRIED ANOTHER WOMAN RIGHT AFTER SHE DROPPED HIM OFF AT THE AIRPORT (PHOTOS)  This is real bad!"},{"comment_id":"550023351824286","commenter_b":"Funny Denis.","commenter_a":"Good for North Korea, we have missiles why can't they","post_message":"The rocket was launched on a southward trajectory, as planned, passing over Japan's southern Okinawa islands."},{"comment_id":"10154448995838812","commenter_b":"'@username what makes her uneducated?","commenter_a":"And people seriously want to elect him president?!? Get a clue!!!","post_message":"New York's attorney general says he won't be deterred in pursuing the state’s case against Donald J. Trump and Trump University, just because the defendant is campaigning to be President of the United States."},{"comment_id":"10153880992094714","commenter_b":"Illuminati right?","commenter_a":"I really can't stand Obama right now nor his latest decisions. He's honestly pissing me tf off no lie Like the earlier comment said, you have plenty room at the white house to throw a traditional Thanksgiving dinner all for them... We'll see how fast you call that a good idea...I'll wait","post_message":"'[A] woman from Florida told me her family's history dates back to the Mayflower - and she said that welcoming others is part of 'what it means to be an American.''"},{"comment_id":"10153157126101051","commenter_b":"I doubt she was a gangbanger","commenter_a":"It isn't unusual at all for a 'routine' traffic stop to result in an arrest There are often some underlying cause to make an arrest. Outstanding warrants for priors. (Maybe that's why she was trying to make a new start in an other state) Drugs in the car, intoxication? Then resisting. There's more here. But it all hardly seems like reason enough to commit suicide. But one never knows all the reason(s) some people take their own lives. Maybe she was facing far more serious charges or problems if returned to her home state? Maybe she was trying to flee gang affiliations. Or gang threats. None of that is even given. Just the same old blame the cops and here we go again B/S story from the press.","post_message":"This woman was arrested during a routine traffic stop. Three days later they found her dead in her jail cell. Officials say it was a suicide - but there's one problem with that theory."}]
