[{"comment_id":"10153715291715950","commenter_b":"Sorry Sara Sterling you wouldn't know the NRA from a CPA. Guns were here before you and they'll be here long after you. They can pass all the unconstitutional laws they want the gun owners will not comply. If you don't like it well then your free to pack your sh*t and leave there isn't anybody forcing you to stay here. The earth is huge...","commenter_a":"CBS once again reaching with their BS agenda! Why don't you report how gun sales are at a record high? Obama is the best gun salesmen ever. If a government ever tells you to disarm yourself you need to arm yourself!","post_message":"This brother shares the story of his family's tragic trip to a gun range."},{"comment_id":"1083798295013251","commenter_b":"The JUDGE is a woman...","commenter_a":"How stupid!!! Wonder how this guy became a judge!!! Her mother is with her!!! Who is the idiot who is challenging her contract? Hang tough Bindi!!!","post_message":"A court judge is demanding proof that the 'Crocodile Hunter' is dead.  (via Daily Mail Australia)"},{"comment_id":"10156366153880389","commenter_b":"\"The very foundation of the United States is rooted in Native American genocide and the violent, forced abduction, murder, rape, annihilation, and enslavement of Africans... .So racism becomes a shield, hiding the magnitude of killing millions of people of color around the world... . If we must be told of the killing, we are told they are necessary to defend the way and . Because U.S. life is subsidized worldwide (and within the United States by people of color and poor White labor), racism must exist or else the entire edifice crumbles... . Race is not only necessary, but also a central tenet of westward expansion, for Western imperialism and capitalism are intimately tied to White superiority\" (Christopher Knaus \"More White Supremacy? The Lord of the Rings as Pro-American Imperialism\" Multicultural Perspectives, 7(4), 54-58. 2005).","commenter_a":"\"Who the United States considers to be evil is certainly not winning in reality. Poor, starving, bombed out women and children in Iraq and Afghanistan are not winning. The women working 16-hr workdays in sweat-shops in Thailand, the Philippines, Jamaica, and Mexico are not winning. The victims of human trafficking in New York, Florida, and Texas are not winning. Those with AIDS in Africa are not winning. The billions of poor people of color throughout the world are not winning. And yet we have set up an entire system of imperialized globalization, which we call democracy to keep them from winning. So we are, in fact, winning, although we only win because we have obscured not only what we are fighting for, but also whom we are fighting against\" (Knaus).","post_message":"Question of the Day: Which Republican presidential candidate do you think will be the toughest on radical Islamists?"},{"comment_id":"10153687678068487","commenter_b":"A drama queen is bad enough! But a stupid, manipulating drama queen can mess up your day! She's the wolf in sheep's clothing! Voters...do your own fact checking!","commenter_a":"Fiorina wasn't \"confused\". She was lying.","post_message":"No one can find the scene that Fiorina described at the debate in the Planned Parenthood videos."},{"comment_id":"689148981239347","commenter_b":"That's one way to get rid of the Muslims and have them leave on their own Trump wins","commenter_a":"These guys can go to? Just go! Scum.","post_message":"Donald Trump will win, and then they will have to face reality.  If they don't like it, good riddance.  Do you support Donald Trump?"},{"comment_id":"10156488324870093","commenter_b":"About time now shoot the poachers especially dentists lol","commenter_a":"Thanks!!","post_message":"Yay!"},{"comment_id":"1203426363052812","commenter_b":"@username AND SHE WANTS TO BRING THOUSANDS MORE INTO THIS COUNTRY' WAKE UP PEOPLE","commenter_a":"The cop should have called for backup and arrested the whole lot of them for inciting a riot. They should have been told it was none of their business what the woman was wearing. If they can't live by the laws of the countries they are in, they should be sent back home where their laws are enforced.","post_message":"WATCH This Muslim Scumbag Harass Women or Wearing Jeans Deemed too Tight By Islamic Standard! Then The POLICE Show up and teach him a lesson on Freedom! (VIDEO)  This is the problem with islam, they believe EVERYONE is subject to their bullsh*t!"}]
