[{"comment_id":"1769368463122894","commenter_b":"I mean, I don't know who tf this woman is but I'm guessing she didn't mean it how everyone thinks she meant it","commenter_a":"People have blown what she said way out of proportion. Please read the article and really absorb what she actually said, a lot of people read but don't understand what they are actually reading.","post_message":"What a moron"},{"comment_id":"10152867173405667","commenter_b":"Can't stand her","commenter_a":"Start with the thugs then will talk","post_message":"\"How is it possible that we as a nation allow guns to fall into the hands of people whose hearts are filled with hate?\" Hillary Clintonsaid."},{"comment_id":"10154273166073445","commenter_b":"Justin Ruffino build that wall!","commenter_a":"Hilarious!","post_message":"Role Reversal. Mexicans Are Smuggling American-Grown Weed South of the Border."},{"comment_id":"10156323559275294","commenter_b":"I will respond honestly. I am on the fence with medicinal use. Not sure it needs to be legalized for this purpose but not totally against it. I am totally against recreational usage because the bad outweighs any benefits in my opinion. I do not see it helping the economy or benefitting society at all. Plus the 10 only benefitted from the bill did not help and it should be a law only not a change to the constitution.","commenter_a":"To everyone that voted no I want a legit response on to what was so wrong with amendment???","post_message":"Issue 3, which would have legalized marijuana in Ohio, was voted down by a nearly two to one margin yesterday -- but officials with Responsible Ohio say the fight isn't over. Click below for more, including a complete list of election results:"},{"comment_id":"10152917193351813","commenter_b":"Women have options. Don't have sex if you can't afford the reprocussions.","commenter_a":"Why would you vote to decrease the options women have for health care? Makes no sense at all.","post_message":"BREAKING: Senate fails to defund Planned Parenthood. The road ahead is uncertain, but for today logic prevails. We’ll continue to stand alongside our partner and access to care for millions."},{"comment_id":"1083906904965768","commenter_b":"Girl, it was a woman who slapped the horse (read the article, John :) )","commenter_a":"Guy must have thought he was Alex Karras or something. Now draw and quarter the worthless skid-mark.","post_message":"BUSTED"},{"comment_id":"10153220983921770","commenter_b":"@username Then why did her husband push Trump to run?","commenter_a":"Trump is nothing but a Clinton crony who is trying to split the Republican vote to ensure a Clinton win. He is NOT a Conservative! @webpagelink","post_message":"After PolitiFact found that Donald J. Trump's first television advertisement uses footage of immigrants pouring over the Morocco-Spain border instead of the U.S.-Mexico border, the Trump campaign gave a blunt response to NBC News."}]
