[{"comment_id":"980159212038244","commenter_b":"build a wall around this state.","commenter_a":"Hang the son of a B... Sheep F'r! Make an example of him!... we don't tolerate this crap in our Country!","post_message":"BREAKING: ISIS SUPPORTER Arrested In Michigan Before He Could Carry Out This Plan [Video]  “It is my dream to behead someone”"},{"comment_id":"10153865845208984","commenter_b":"TRUMP IS A LIAR! TRUMP IS A RACIST! TRUMP IS A BULLY!","commenter_a":"If you watched the last debate Carson was nervous stuttered his responses I just don't think he's hard enough","post_message":"'The Donald' just ripped into his Republican rivals today and revealed the one big reason why he doesn't think Dr. Ben Carson could do the job. Some might agree that he makes a valid point...  Do you think Trump could be right about Carson?"},{"comment_id":"10156358709930725","commenter_b":"She's deserves to rot in hell.","commenter_a":"Allie Stoltenberg @username","post_message":"Police are investigating a pet owner after a Facebook post of her dog muzzled with duct tape went viral ----> @webpagelink"},{"comment_id":"803115886455778","commenter_b":"Shoot that mother f***** in the head","commenter_a":"Courtney Surprenant my fear at dollar tree or anywhere really","post_message":"Video captured a Florida mother wrestling her own daughter from the arms of a would-be kidnapper inside a store. The suspect ran out of the store but was quickly stopped by an off-duty police officer at gunpoint. @webpagelink"},{"comment_id":"10152924291939091","commenter_b":"A woman!","commenter_a":"That's why I like my men clean cut... No beards eww...","post_message":"How dirty is your beard?  A shocking new study found men's facial hair to contain the same bacteria found in human feces: @webpagelink"},{"comment_id":"1803336319885605","commenter_b":"@username \"She can watch the oath from a cell like she deserves\" Proof or you're a dirty liar.","commenter_a":"I borrowed these words from Daniel Greenfield who wrote them a few months ago in Front Page Magazine: Clinton has spent a third of her adult life trying to become president. are hoping that Hillary will go to jail. But the anger, frustration and bitterness that will gnaw on her after wasting decades and a small fortune on two failed efforts to win the White House in which she had every advantage only to lose before even leaving the starting gate will be worse than any prison. January 2017, Hillary Clinton will be sitting in front of a television set watching someone else take the oath of office. Nothing the penal system has to offer would be a harsher punishment than that moment.","post_message":"Six of the biggest takeaways from the FBI's investigation."},{"comment_id":"10152792831586130","commenter_b":"Nasty booby feeders??? Really thats ignorant! Howbabout you eat on a damn toilet and tell us how that goes","commenter_a":"Do that in private...how is that difficult?! Restrooms...everywhere!","post_message":"In a time when women are often shamed for nursing their children in public, it's good to know that one of the world's most influential leaders is in support of breastfeeding mothers."}]
