[{"comment_id":"10153561426376135","commenter_b":"we know this lady is","commenter_a":"Why would I answer those stupid questions to see this story? WXYZ are you crazy?","post_message":"In 2015, in Troy, she was charged with assault and battery. She later pled to disorderly person and, two weeks ago, she was ordered to pay a $500 fine and attend anger management."},{"comment_id":"960686434063090","commenter_b":"Get her outta here!","commenter_a":"Take her off the air she is a bigot also joy you can see the hate in her face when President Trump is mentioned","post_message":"Whoopi Goldberg has been relentlessly gunning for Trump. He's had enough, and so has America. Should Whoopi Goldberg be kicked off TV forever?"},{"comment_id":"882901261808481","commenter_b":"Wow. It's just a military organization, and not a very good one. Your fear is irrational and betrays you, allows you to be easily manipulated.","commenter_a":"Ok. These are Islamic extremists who believe that death in the service to their religion is the highest honor they can achieve. I'm fairly certain they've got some kind of contingency plan in place in event that their current leaders achieve \"martyrdom\". I'm just going to put that out there. \"We've killed more of their leaders\". So what? They want to die. They're promised 74 virgins in the afterlife. I'm absolutely positive there are plans in effect to appoint successors to those leaders who are destroyed.","post_message":"U.S.-led forces have killed 10 Islamic State leaders in air strikes, including individuals linked to the Paris attacks."},{"comment_id":"10154304263504203","commenter_b":"Haha crooked Dems are feeling the Bern, bet rigging the system doesn't seem to nice now does it DWS? Trump is going to destroy Crooked Hillary in November","commenter_a":"Dear Bernie.....GET OUT.","post_message":"Berning bridges."},{"comment_id":"10154985893890629","commenter_b":"@username Now he blamed \"fake news\" again. Only this time it was real \"fake news\".","commenter_a":"Our president is making speeches based on something he says he heard on Fox News? OMG, he has access to 1st hand intelligent briefings and he's getting his information from the news? What in the world is even happening?","post_message":"President Trump said he cited a nonexistent terrorism incident in Sweden as a reason for his travel ban after he saw a segment about immigration in the country on Fox News."},{"comment_id":"10153697157652098","commenter_b":"THIS ARE MAMA'S KIDS THEY NEVER DON NOTHING BAD, NO DRINKING, DRUGS, ROBE, HURT OR KILL SOMEONE, WHY THE POLICE DON'T SHUT ALL OF THEME ON THE SPOT, TAKE THEIR CARS AND NEVER LET THEM COME OUT OFF JAIL. EVER. BUT THEY GOT MORE WRITES THAN YOU OR ME. UNTOUCHABLE. IF YOU TOUCH THEM THE STUPID PROTEST WILL START.","commenter_a":"Nancy Jovana","post_message":"VIRAL VIDEO: A CHP vehicle was vandalized as an East Bay sideshow took place... DETAILS & FULL VIDEO: @webpagelink"},{"comment_id":"10154465845766162","commenter_b":"This is different, this girl has some evil in her!!","commenter_a":"Huh? Well that's just stupid. I tell you to jump off a cliff, and you do it... You're the idiot.","post_message":"A teenager who sent her boyfriend dozens of text messages encouraging him to take his own life and told him to \"get back in\" a truck filled with carbon monoxide fumes must stand trial for involuntary manslaughter: @webpagelink"}]
