[{"comment_id":"872957136089257","commenter_b":"lol bitch...u aint smart","commenter_a":"Harashi Dang u get this pic? Lol","post_message":"Classic. ~Will  More photos at Afghanistan Combat Footage - Funker530"},{"comment_id":"1391527697542910","commenter_b":"She's a self-serving, self-promoting blowhard who couldn't care less about anyone but herself.","commenter_a":"Hillary Clinton may have been investigated by the FBI, but Jill Stein has a fucking arrest warrant out on her, yet she still thinks she's a plausible option.","post_message":"Memo to Dr. Jill Stein: There's nothing \"progressive\" about saying that Hillary Clinton is more dangerous than Donald J. Trump, or that Bernie Sanders is a political insider, just because they don’t pass your purity test."},{"comment_id":"10153377527143984","commenter_b":"Are some people just figuring out she's a LIAR and always will be!","commenter_a":"People need to wake up & research the person they are going to vote for....She is hiding so many things....","post_message":"Supporters of Hillary Clinton are reconsidering their choice for president after learning some stunning facts.   Are you glad to see Clinton's hypocrisy exposed?"},{"comment_id":"1297673556961425","commenter_b":"She has taken UGLY to a new LOW!!!!","commenter_a":"This awesome. Trump just keeps on winning.","post_message":"Awful Rosie O Got Slammed With Worst News Of Her Career After Election, She Screwed!!!  The news just keeps getting better for America!!!"},{"comment_id":"1272011979492601","commenter_b":"Not a fan of the Dixie chicks!!! Stay out of politics!","commenter_a":"This lady is disgusting. Don","post_message":"Natalie Maines of the Dixie Chicks said she was \"ashamed Ted Cruz is from America\" on Saturday, a comment that echoed her famous comments about President George W. Bush in 2003."},{"comment_id":"10156175589090354","commenter_b":"Arrogant hateful ole hens that arent worth the waste of time!!","commenter_a":"Liver Transplant Recipient of 4 1/2 years. The Doctors saved my life in surgery but the Nurses kept me alive and watched over me and I would not be here without them. Bless them all.","post_message":"The #NursesUnite movement is mobilizing against liberal co-hosts of \"The View\" Joy Behar and Michelle Collins.   But now, new arrogant and elitist behind-the-scenes comments are coming to light and sparking further uproar with nurses across America..."},{"comment_id":"10153595542620575","commenter_b":"If its pure crap please backup that statement with facts. America is importing more Muslims than ever before in history.","commenter_a":"He IS scary with his beliefs and agenda for Muslim takeover of the world.","post_message":"The Gateway Pundit - Obama Blasts FOX News, Conservative Media for Making Him Look ‘Scary’"}]
