[{"comment_id":"1162022200542981","commenter_b":"Hillary Clinton's response would be \"What difference - at this point, what difference does it make?\" The crooked bitch would lie about it anyway!","commenter_a":"You don't know what he was doing!! Why did trump tell you ?","post_message":"Wow. A major discovery about the EgyptAir pilot was just made, and it could change everything. It's been revealed that he was doing something surprising before the plane went down, and it could explain a lot..."},{"comment_id":"10155012522801944","commenter_b":"It's now about money Obama laid out a lot of this deportation and Trump has to bite the bullet. Now back to money. Only ones going to make money on the deportation of illegals are LAWYERS. Lose. Lose situation for the illegals. Serves them right? Our forefathers and mothers came in legally Any questions ?","commenter_a":"Id like to see 365 days without illegal immigrants. enforce the law deport illegals.","post_message":"Serves 'em right."},{"comment_id":"563081667216516","commenter_b":"Where the white woman at !!","commenter_a":"Markus please don't allow this on my pic I have very young children One is my 6 month old grandson. And 4 other grand kids. Please help Me out lets work to gather to stay Younger. Love auntie Diana","post_message":""},{"comment_id":"513918755467368","commenter_b":"Screw that fat ass bitch","commenter_a":"Her and the view should of been gone long ago","post_message":"Joy Behar took a turn attacking the mother of the Benghazi victim. #RNCINCLE"},{"comment_id":"1033927403316825","commenter_b":"Good! Hopefully this will deter those damn anti-vaxxers from using Facebook and spreading their total stupidity. One can dream.","commenter_a":"Hip hip hor ehhhh","post_message":"Three cheers for Mark."},{"comment_id":"10154287365081130","commenter_b":"Bitter angry woman hater. I feel sorry for your kids, especially if you have daughters.","commenter_a":"We should let children make their own decision about whether they get to live or not. All Americans have basic civil rights and women do not have the right to take the right to life away from another living human being.","post_message":"\"We should let women make their own decisions.\" 👏"},{"comment_id":"10153603206034342","commenter_b":"Make her Vice President...you will truly be elected","commenter_a":"Sarah Palin is Hott","post_message":"Sarah Palin is endorsing Donald Trump..."}]
