[{"comment_id":"1108284169190819","commenter_b":"Bitch","commenter_a":"Remember Vince Foster!! He was murdered and the Clinton's look like they did it!","post_message":"Hillary Clinton has got to be sweating this one... Do you think this Dem presidential candidate needs to be held accountable for her actions?"},{"comment_id":"1769553679939796","commenter_b":"Those assholes responsible, should be in jail.","commenter_a":"Clueless in government or politics,draft dodger and buy politicians,insulting others or winning moron only will make a sorry Clown.😀PLEASE GROW UP LEARN THE RULES OF THE GAME INSTED OF USED YOUR MONEY TO MANUFACTURE HATS IN CHINA. 🇺🇸","post_message":"This isn't how democracy is supposed to work! Donald J. Trump is absolutely ANGRY over what Ted Cruz just did to him in Colorado. Do you think he has a right to be angry?"},{"comment_id":"1346838938665097","commenter_b":"@username the fact is that a male will never transform himself into a female. FACT!!","commenter_a":"For people who don't understand, it is not just restrooms, but women's locker rooms and showers and dressing rooms. This is not right. This is not just a trans thing, but will allow men to go into confined areas where women are very vulnerable. So, how would you feel if your grandmother, mom, daughter, sister, aunt, etc. to shower with a man next to you with only a flimsy curtain? We here in NC will stand strong. I hope our governor will continue to fight for women's safety.","post_message":"The solution here might be that the North Carolina governor could say that we don't identify as North Carolina anymore, and therefore your lawsuit against us is irrelevant."},{"comment_id":"1453852417965437","commenter_b":"Vile scum maggots.","commenter_a":"\"Did Huma have her genitals cut off?\",,,,More projection from Alex Jones?","post_message":""},{"comment_id":"10153745675114641","commenter_b":"The most beautiful mistake in history. It was like a fairy tale that came true. Both ladies got a chance to win. They are all winners.","commenter_a":"Que estUpido!","post_message":"The moment when Steve Harvey crowned the wrong Miss Universe. Full story: @webpagelink"},{"comment_id":"1191540644208167","commenter_b":"Two lesbians using sperm, fornication and evil","commenter_a":"Does this mean the she he cheated on the female? I mean someone had to party load in that right?","post_message":"Fernando Machado and Diane Rodríguez announced their pregnancy, believed to be the first of its kind in South America, on social media."},{"comment_id":"1011521052257456","commenter_b":"SHOWA. I would say if you didn't think it could happen again, it's happening again.","commenter_a":"INVADERS don't assimilate!!!","post_message":"Unreal. Stupid public schools ... celebrating the subjugation of women."}]
