[{"comment_id":"774112892726570","commenter_b":"Shit up traitor go suck on Hillary's nipple","commenter_a":"Know why? Because your last name means he who sands as in sandpaper.","post_message":"Boom. #DemocraticDebate #DemDebate"},{"comment_id":"10152697145362144","commenter_b":"Sam. The lowest approval rating ever goes to Obama.","commenter_a":"No he is not. I am so disappointed in how NOT liberal he is and I voted for him twice.","post_message":"Obama is the most liberal president since LBJ. But that's not what conservatives hate. They hate him because he's also the most effective Democratic president since LBJ."},{"comment_id":"898756240177140","commenter_b":". . . and it's just going to get worse until we deport them all ! ! ! !","commenter_a":"LOL. LOL. These retarded Liberals! Can't we all just get along... you stupid liberals have brought this into our country... and now it will be like the middle east... Socialist DEMOCRATS SUCK!","post_message":"(Video) Is 2015 the year we see outright war between radical Muslims and Americans on our streets? As exemplified by the actions of these Texans, Americans will push back against Islamization with highly provocative moves. Will Obama be able to keep his jihadists in check until he declares Caliphate? Read More + Video: @webpagelink"},{"comment_id":"944173558951399","commenter_b":"Every thing that man spoke is true. Leave lady","commenter_a":"Muslim people you live in the United States . Take that f--king towel off your face . Your weak minded people . With no chance to Evolve , your stupid religion holds you back . Just get out of are country . So we can bomb you and get rid of you ! .","post_message":"A Muslim woman confronted a female cashier about her flag pin... What happened next is going VIRAL!"},{"comment_id":"1393941760623890","commenter_b":"Just like they blocked Obama?","commenter_a":"It's a shame that Democrat voters don't vote on issues such as jobs, the economy, and security... They vote for the candidate who has the most celebrity backing... Low info voters.","post_message":"Lady Gaga criticized Melania Trump for saying she wants to end cyber-bullying if she becomes first lady. @webpagelink"},{"comment_id":"10155016645768010","commenter_b":"Let's keep in mind the big picture here. Less illegals, the better.","commenter_a":"As we've learned from all his businesses, failures and bankruptcies...he is very good at spending other people's money.","post_message":"He wants to get Mexico to reimburse the U.S."},{"comment_id":"10153917800769087","commenter_b":"Suck Ass Fox (lol)","commenter_a":"the people who think trump is a joke need to get smart....in a hurry. the only vote that will count in november is the one cast to defeat, no, destroy trump. i don't think jill stein will do that. hillary will. hold your noses people and do the right thing. for the wrong reasons perhaps, but do it. after the dust settles and trump, god forbid, wins, it will be too late to hear you whining.","post_message":"Dozens of the most prominent people in Silicon Valley signed an open letter on Thursday warning that Donald J. Trump \"would be a disaster for innovation.\""}]
