[{"comment_id":"10153228787618984","commenter_b":"Well he still did his job get unlicensed uninsured drivers off the streets. They are a huge reason insurance prices are so dam high. Besides Mexicans from across the boarder are becoming the majority especially in states like Arizona!! I'd vote for Sheriff Joe every day of the week and twice on Sunday.","commenter_a":"More LE needs to do that to rid America of the damn illegals","post_message":"I cannot believe he admitted this. Liberals will be giddy. He'll really need his supporters to step up now... Do you still support Sheriff Joe Arpaio?"},{"comment_id":"392535437595004","commenter_b":"What a misogynistic jerk!","commenter_a":"WTF? what a loser! how is this guy in politics? what a loser!","post_message":"No, there's no GOP war on women."},{"comment_id":"10154566623729877","commenter_b":"Copycats!","commenter_a":"Obsessed with Obama like the petulant envious kid trying to copy everything related to their nemesis!","post_message":"The Trumps just don't plagiarize speeches — they also lack originality when it comes to cakes. Go figure."},{"comment_id":"494885290693351","commenter_b":"Say what you will, but she has the right to stick with her belief.","commenter_a":"For one, she's not crazy, for two, Congress has to pass the laws,and no law was passed for her to grant marriage licenses to gays. Gods law, IS LAW","post_message":"One side has got to give in. Right?"},{"comment_id":"1015160651860508","commenter_b":"@username go be stupid with your blond friends elsewhere","commenter_a":"If the little brat would have respected the teachers authority in the first place the cop wouldn't have even needed to be there.","post_message":"No matter how smarmy some snot-nosed teenager might be, even if she’s burning off the teacher’s time, the class time and her own time, there’s never a moment in which it’s appropriate for a law enforcement officer to try out his best WWE moves in order to bring her to heel — even if she takes a swing at him. @webpagelink"},{"comment_id":"10156725914675093","commenter_b":"Trump gonna go all the way...There's no stopping the Trump Train!","commenter_a":"I really like watching all you rpublicans running in circles..HA...HA....HA HA!!","post_message":"Other Republicans say we should protect the Constitution. Ted Cruz has actually done it; indeed, it has been the animating passion of his career. Read the full editorial in the link & vote in our poll at the end!"},{"comment_id":"10153610824739087","commenter_b":"So, I guess u rather lying, murderous Hillary to get the nomination.","commenter_a":"They don't have to support the nominee anymore than we have to! If Old butthole lips Trump gets the nomination you can bet I'll write my candidate in!","post_message":"“We have candidates who believe that they’re on the pathway to grabbing all the delegates for the nomination. Whether it’s posturing or whatever, I expect that they’ll eventually support the nominee,\" said RNC chairman Reince Priebus. \"We’ve always been able to come together before.”"}]
