[{"comment_id":"10154017509764156","commenter_b":"I will keep you in my prayers, Eva. You'll need them.","commenter_a":"California has extremely strict gun laws! Many in violation of Supreme Court orders! Blame the terrorists that did this, not the gun laws! It's obvious no one other than the murderers had a weapon or this would have ended much sooner, with less tragedy!","post_message":"There are no words that can come close to describing the horror of today’s attack in San Bernardino and my heart goes out to the victims and their families. Our only response must be to take immediate action to stop tomorrow’s mass shooting by addressing the gun violence epidemic. Period."},{"comment_id":"10153831819518598","commenter_b":"Glad she doesn't love me","commenter_a":"Love is always a good reason to murder someone isn't it.","post_message":"Woman Writes: “I Had an Abortion Because I Love My Son”"},{"comment_id":"806491062782835","commenter_b":"Its funny the democratic party started the Confederate nation and fought to keep slavery. Robert byrd retired in 2010 a Democrat longest serving politician in history and was active member of the klan. Imagine all yhr bills he voted on due to his racist views. Alot of the Democrats knew he was a klan member and said nothing. Pull some ones opinions off line and use them to your benefits but truth is your being lied to but 99% of politicians and the first to speak up you all attack.lol just like o malley saying all lives matter and Democrats attacked him for that. Yet alone he is democrat himself. Get it through your heads we are done with the hypocrits and lies and political correctness","commenter_a":"Can someone please explain to me who they are polling to get Trump in the lead?","post_message":"And yes, it's really his number."},{"comment_id":"1270356769653367","commenter_b":"She is so gross, just sickening!","commenter_a":"Whatever That idiot should move to Mexico","post_message":""},{"comment_id":"10153623967716323","commenter_b":"This is the best thing ever said. Ever.","commenter_a":"Uniting all parts of Yorkshire could be a bad idea. If it took our fancy we could go game of thrones on your arse!","post_message":"\"Pit a bunch of Yorkshire folk against outsiders and they’ll all chunter on about how chuffing brilliant God’s Own County is. Put a Bradfordian, a Sheffielder, a Yorkie and a Leeds lad in the same room, however, and they’ll argue about their football teams, the relative quality of their beer, the beauty of their landscape and women, and everything in between. Often all that will unite them is a shared disdain for Hull.\" Full disclosure: Helen Pidd is from Lancashire."},{"comment_id":"10154070918229330","commenter_b":"And that moron idiot Trump??? His posture is dangerous.... Anyone who thinks otherwise is misinformed and reckless, to say the least","commenter_a":"MY TWO CENTS - To all the people who love politics. I can’t predict the future but let’s take a hypothetical in which Donald Trump is the presumptive nominee. Let’s take it one step further and say for this narrative that he runs against Hillary Clinton. I think the race to be POTUS will be close, and irrespective of who wins, can you imagine of what Donald Trump is going to do with all the dirt on Hillary Clinton. She and her husband amassed a 200 million dollar fortune while in political office. If they both worked their entire lives for the government, they couldn’t make that kind of money, let alone have it in the bank. That didn’t go unnoticed. She got a $650,000 for a 45 minute speech from a “bank,” but swears she will kick their butts to the curb (yeah right). Her email server was used ...","post_message":"Nearly 8,000 people are expected to gather at the Convention Center when Donald Trump makes his way to Hartford tonight. @webpagelink"},{"comment_id":"1295782043794583","commenter_b":"Let them fear! BE TERRIFIED! Trump will deport you! Americans WANT illegals and Moslems DEPORTED!","commenter_a":"\"I going to stand up for the 11-year-old girl in Nevada, who worried that her parents would be deported under a Trump presidency. For the Muslim family in Queens whose young children are terrified of how their family would be treated if Donald Trump becomes their Commander-in-Chief.\" What about the FIVE YEAR OLD GIRL in Idaho who was gang raped by SEVEN of your precious muslims,Hillary? What about the families in NY & NJ who are terrified that they will be blown up by ANOTHER muslim who has stolen and benefited from America's generosity,only to turn their islamic hate on us?!? Go to Hell,back where you came from,Hillary.","post_message":"HILLARY EMAILS HER DEBATE STRATEGY. AND ON THE HEELS OF A MUSLIM-LED TERROR ATTACK, HILLARY'S EMAIL COULD NOT BE MORE ANTI-AMERICAN. Read it. @webpagelink"}]
