[{"comment_id":"1109305832420099","commenter_b":"It's time for a female to make some real changes...","commenter_a":"Hes no match for #Hillary","post_message":""},{"comment_id":"10153845298899753","commenter_b":"Can 't see what any young girl would see in that creep--what do they see in those guys?","commenter_a":"Doesn't this family have any self respect? Who really gives a crap?","post_message":"Do Kylie Jenner and Tyga have a sex tape to release? Although multiple reports have claimed the former pair starred in a series of explicit films before they split weeks ago, Kylie Jenner and Tyga weren’t planning to release one of their clips last month. Following a report earlier this week, which claimed Kylie Jenner and Tyga were about to become the next celebrity sex tape stars just last month, a second report has shot the idea down. According to a May 23 report by Gossip Cop, Kylie... @webpagelink"},{"comment_id":"10155472847782178","commenter_b":"This about sums up his platform. To bad his plans don't include everyone. Especially when it comes to healthcare. Did you know that if Obama care is rebuild and replaced if you have a pre-existing condition then you cannot get medical coverage just like before during the Bush administration","commenter_a":"Truth! Dirty Donnie is playing us like a fiddle! All about him so he can make $$$$! He is not FOR anything but himself! Do you really think he is for you blue collar workers or the struggling middle class? Once he gets what he wants, he'll throw you to the gutter like a piece of trash. He is all about the $$ going into his pocket. His \"plan\" would put the workers back into the industrial age. Company town and company store, no unions, no rights, keep your mouth shut and just maybe you won't get fired, thrown out of your home, and dumped on the street! Tax cuts for the rich and everyone else can pay for it. Build a personal defense for to consolidate his power, throw opponents in jail, purge the government of the opposition,and align himself with his buddy Putin! Run away from NATO allies ...","post_message":"Donald Trump's priority today is clear: His personal brand and business."},{"comment_id":"10153573077978352","commenter_b":"Christina you're dumb","commenter_a":"Te'ron Walker because most black people blame whites for everything. When no white people alive today had a damn thing to do with the past. Not all white people are racist. There are plenty of black racist people though because all whites \"owe\" blacks every damn thing when we're not the ones that had anything to do with anything that happened before. Y'all need to take that shit up with all the dead white people. Oh, and the blacks too since whites weren't even the ones to START damn racism. Ignorance is bliss people.","post_message":"High school principal fired after racist outburst at ‘all the black people’ leaving Georgia graduation ceremony early"},{"comment_id":"1784602218530696","commenter_b":"This lady is a clown with money. She is a joke","commenter_a":"gotta laugh at all these haters who are left over from Obamas reign! Its time to shake up the education system!","post_message":"Join us as Vice President Pence holds a swearing-in ceremony for the Secretary of Education, Betsy DeVos."},{"comment_id":"966246990097370","commenter_b":"Umm Ferguson, Watts Riots, La Riots. White people are out of control? Ok","commenter_a":"I pray for their families","post_message":"White supremacists shoot five people near the #BlackLivesMatter protests for Jamar Clark, a 24-year-old unarmed black man who was shot earlier this month by police.  Protestors took to Twitter after the shooting & described the scene as chaotic, saying police maced the crowd before an ambulance arrived to assist the wounded.  No arrests have yet to be made. DETAILS ----> @webpagelink"},{"comment_id":"1203191243053664","commenter_b":"Fry the bitch!!!!","commenter_a":"She's as much of a terrorist as he is because she knew and said nothing!!! Life in prison or deport and never allow her back in our country.","post_message":"WIFE PLAYED A ROLE:  @webpagelink"}]
