[{"comment_id":"477075479149699","commenter_b":"Go Greta Don't. Let the Liar.,,Dunce worry u","commenter_a":"Yes","post_message":"Greta Van Susteren's career was just threatened by Obama. Greta's under attack, she needs our help. Do you support Greta Van Susteren?"},{"comment_id":"10152863643681990","commenter_b":"Illegal immigrants should not be here to commit any crime. U. S. Citizens do not need the extra concern.","commenter_a":"Yes look at Dyllan Roof he looks Latino... He shoot 9 black people last month in church.","post_message":"IMMIGRANTS AND CRIME: Despite rhetoric in the Pier 14 shooting Francisco Sanchez case, immigrants do not commit more crimes that U.S. citizens. That's according to 100 years of research according to the American Immigration Council. @webpagelink"},{"comment_id":"932489970229038","commenter_b":"Nothing compares to what Bill Clinton did as Gov of Ark, and in the White House with Monika Lewinsky and other women..same with John F Kennedy, with Marilyn Monroe, and mistress of a Gang boss, and nude swimming parties. They both dis honored our White House...where was the media..and why were they voted in twice...","commenter_a":"I agree! Mr. Trump has changed in the past 11 years but Hillary Clinton has not except for the worst!!","post_message":"Dr. Robert Jeffress, Senior Pastor of the First Baptist Church in Dallas, Texas, stated that he still supports Donald J. Trump, despite the GOP nominee's controversial 2005 comments."},{"comment_id":"10153638977331336","commenter_b":"Who said I only talked to one? I only mentioned ONE conversation","commenter_a":"Their apology means nothing if the employee was not fired immediately.","post_message":"The Pembroke Pines Police Department says that a uniformed officer was refused service at an Arby's simply for being a police officer."},{"comment_id":"10155758451790354","commenter_b":"Go away welfare momma!","commenter_a":"Bitch","post_message":"Not helpful..."},{"comment_id":"1726976590895675","commenter_b":"@username Drama queen.","commenter_a":". LETTERMAN'S TOP 10 REASONS TO VOTE DEMOCRAT 10. I vote Democrat because I love the fact that I can now marry whatever I want. I've decided to marry my German Shepherd. 9. I vote Democrat because I believe oil companies profits of 4% on a gallon of gas are obscene, but the government taxing the same gallon at 15% isn't. 8. I vote Democrat because I believe the government will do a better job of spending the money I earn than I would. 7. I vote Democrat because Freedom of Speech is fine as long as nobody is offended by it. 6. I vote Democrat because I'm way too irresponsible to own a gun, and I know that my local police are all I need to protect me from murderers and thieves. I am also thankful that we have a 911 service that gets police to your home in ...","post_message":"Good morning America! Big day ahead! Join me at 11amE - as I officially announce my Vice Presidential choice- Governor Mike Pence! Watch here: @webpagelink"},{"comment_id":"10153146090320667","commenter_b":"Watch out she's going to report u lmao","commenter_a":"Go get a life,","post_message":"In about three days, the group has collected 30,000 signatures."}]
