[{"comment_id":"10153394565113984","commenter_b":"As my friend @username said, stone the bitch!! I agree","commenter_a":" sorry, I can't take her seriously.","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing...  Do you think this Boston bomber got what he deserved?"},{"comment_id":"1067971246620705","commenter_b":"This is not a college campus, and she already dropped out of college. Go look, shiney object over there ...","commenter_a":"The media should be reporting on the despicable Republican Platform. #shameful","post_message":"The speechwriters who wrote the original speech are among the best, and weren't going to have their good name besmirched by Trump ..."},{"comment_id":"10154099091164203","commenter_b":"No BITCH, .it's a blog like TRUMP my mind works faster than my finger on a kindle and this blogging is not the most important issue in my life, now run along I graduated HS over 40 years ago, so you grading me is MEANINGLESS......specially since your from Canada.......","commenter_a":"Really? Bull SHIT BLACK LIVES MATTER have been showing up to all the rallies. Only TRUMP supporters are standing up to the fucking ghetto rat's. Go ahead talk OUT both sides of your MOUTH, you just keep confirming the NEED FOR THE TRUMP MOVEMENT.","post_message":"\"My own personal observation is that there is a cycle of behavior that is escalating and it's happening exclusively at Donald Trump events.\""},{"comment_id":"1388976751118684","commenter_b":"STOP KILLING BLACK PEOPLE","commenter_a":"معقول يصير بامريكا","post_message":"Courtesy: Ruptly"},{"comment_id":"10153440458394087","commenter_b":"God please give us her in the White House so we can see her on TV everyday!!","commenter_a":"just a dumb shit for hanging with trump","post_message":"“Do I agree with him all the time? No,\" Melania Trump says of her husband Donald J. Trump. \"I think it is good for a healthy relationship. I am not a ‘yes’ person. No matter who you are married to, you still need to lead your life.”"},{"comment_id":"1318079928223893","commenter_b":"Get out of White House. NOT MY PRESIDENT.","commenter_a":"still trying to convince America that he wasn't the worse president ever","post_message":"President Obama holds a press conference with Greek Prime Minister Alexis Tsipras. It is the final overseas trip of his presidency."},{"comment_id":"10156261922235354","commenter_b":"Time to go home.","commenter_a":"Don't know Trevor ...M and glad of it.","post_message":"Nevertheless, Trevor Noah still trashed Dr. Ben Carson for being \"callous.\"   No joke."}]
