[{"comment_id":"10153801088312690","commenter_b":"But that's just it. It's not about the transgender. In fact its nothing against them. It's about the fact that it now opens the door to any man out there. How do they want to strip women who were born women from there rights??? How do they want to take our safety and security. And yes a sexual assault can happen anywhere. We get it.","commenter_a":"Show me one article where a transgendered person assulted someone in a bathroom and I'll show you 10 where a priest, football coach, or teacher did the same thing.","post_message":"President Obama will issue an executive order that public schools must permit transgender students to use bathrooms consistent with their gender identity. Who should make that decision?"},{"comment_id":"755539251303319","commenter_b":"Send the bitch to jail and strip the bed sheets off of her","commenter_a":"Your in US lady you must obey the law... I'm sure when your in Muslim country your not even allowed to drive ....","post_message":"Burqa-Clad Woman Pulls Race Card On Cop, Gets Brutal Wakeup Call That's not how it works in America... Sorry. Do you think she got what she deserved?"},{"comment_id":"10154416532115575","commenter_b":"And what about Hillary's fat rearend!","commenter_a":"Ha wouldn't you like to see her have to do a daily weigh in!","post_message":"Democrat Claire McCaskill calls for daily weigh-ins for Donald Trump over media hoax from 20 years ago."},{"comment_id":"1766432363594674","commenter_b":"hillary a rothchilds criminal, she has already been selected months ago to be president all the sheep fall for it, see how the rothchilds find it easy to fool the easily lead with their controlled media","commenter_a":"Typical politician, first it's \"I didn't lie,\" then when the evidence piles up her statement quickly changes to \"I misspoke.\" Well, when you put it that way, I suppose you get a free pass...","post_message":"\"So I may have short-circuited it and for that, I, you know, will try to clarify because I think, you know, Chris Wallace and I were probably talking past each other because of course, he could only talk to what I had told the FBI and I appreciated that.\" - Hillary Clinton"},{"comment_id":"10153867338207212","commenter_b":"And she's voting for Hillary. Smh","commenter_a":"She's such a cute lady- I wanted to hug her!!","post_message":"Thousands of Oklahomans are voting early, including a 100-year-old woman who has a message for young voters. #News9"},{"comment_id":"1313767168664034","commenter_b":"Just a bunch of self absorbed leftist lesbians.","commenter_a":"Just say there prayin see what happens","post_message":"Wait...so the WNBA is still a thing??"},{"comment_id":"1286858341353620","commenter_b":"who cares !!! no one !!! let that bitch fall !!!!","commenter_a":"She is sick. She was having a seizure. She is lying about her health. She was the only one wearing sun glasses and I thought it strange. She is a basket case.","post_message":"BREAKING:  HILLARY HAS MEDICAL EPISODE AT 9/11 CEREMONY in NYC.  Swept away by security detail.  VIDEO  @webpagelink"}]
