[{"comment_id":"10158310227560389","commenter_b":"I think they are GRRRRRRRREAT!!!!! For the first time in my adult life, in a long, long time, I feel very proud to be an American!!! President Trump has done more in his first few days, than Obama did in 8 years!!!! Thank God we are rid of Obama and his family!!!","commenter_a":"He is doing great as we expected doing what he said he would do !!","post_message":"Question of the Day: What do you think of the moves President Donald J. Trump has made so far?"},{"comment_id":"10153822005111519","commenter_b":"It doesn't fit her","commenter_a":"Plus not just only black ppl have this done. White and other colors do 2.","post_message":"Lil’ Kim’s bleached skin and blonde hair are the tragic result of sexism, racism, colorism"},{"comment_id":"1108181272536216","commenter_b":"thats how i hid my virginity, yeah do that","commenter_a":"Cilian they're coming for reggie","post_message":"This is awesome."},{"comment_id":"10155170960495093","commenter_b":"You know, the more I see about Manspreading and Manslamming and Mansplaining and etc...the more I think \"Womanwhining\"","commenter_a":"How bizarre that a feminist would lie while trying to make a (man-shaming) point. First time for everything, I guess","post_message":"The term \"manslamming\" comes from one woman's claim that she walked around NYC without moving out of anyone's way and almost every man slammed into her but almost no women did.   So National Review's Katherine Timpf decided to try it out herself  and 66 women ran into her vs. just 23 men. You can see video of all the slams here:"},{"comment_id":"588617174663431","commenter_b":"Hillary Clinton is a criminal!","commenter_a":"Republican's are the enemy of millenials. They have been ruining America since before we were born. It's time to vote blue and vote for Hillary. We need to stand up against hate and bigotry. #Hillary2016","post_message":"\"And believe it or not there are even some Republicans in Congress who have already said they want to start the impeachment process,\" President Obama says."},{"comment_id":"910223922377697","commenter_b":"She a hoe messing with all them porch monkeys","commenter_a":"Narsha Gafar HAHAHAHHAHAHAHAH","post_message":"Before & After"},{"comment_id":"979982332037226","commenter_b":"Yawn. Y'know, feminism isn't out recruiting fuckwits today, to my knowledge.","commenter_a":"I will never call myself a feminist simply because feminism has no true definition. sure it has a dictionary definition but 9 times out of 10 people who support \"feminism\" have a different approach to it and have values that don't support equality. Men aren't afraid of powerful women I wish there were more powerful women because I can't stand submissive people. If I could find a woman that would stand up to me (in a loving way not a psychopath way like a lot of women think they need too)I would be very happy. I will say this again and again feminism is not the way to gain equal rights for all, because of its aggressive nature it will always have people fighting against it. Also the word feminism does not need to exist if it simply means equality then we can just say equality. I refuse to label ...","post_message":"Well said.  Like ATTN: on Facebook."}]
