[{"comment_id":"1140920095928019","commenter_b":"Mexicans and Americans are the same. they both are sheep","commenter_a":"most latinos want everything handed to them so of course they would vote democrat. duh","post_message":"GOP candidates might not want to overlook Latino voters."},{"comment_id":"10153519151958984","commenter_b":"Leave the park alone, it should be a safe haven for enjoyment; TAKE THE BLACK BITCH DOWN, she has no business being there with that attitude.","commenter_a":"There is so much STUPIDITY in the world anymore. I don't think we should discriminate by race or religion but could we just get rid of the stupid people!","post_message":"A white woman was holding her toddler and minding her own business... but then this black teenager saw her and did something awful.  The entire scene was caught on video... can you guess why Al Sharpton isn't saying anything about this?"},{"comment_id":"10154974610048896","commenter_b":"Lets make this clear Theres only to genders And youre born with the parts youre supposed to have Fucking millineals","commenter_a":"Ah just give him some money. He wont shut up until they do. Maybe he'll use it to treat his mental illness.","post_message":"'I'm not unique in all of this — this upheaval happens to trans people all the time.'"},{"comment_id":"1028079707241669","commenter_b":"Yes oooo. They know what their children are up to. Let the people deport them.","commenter_a":"Damn right.","post_message":"French Mayor Says ‘No More Muslims’, Orders The Destruction Of The Infamous Calais Camps And Expulsion Of Over Seven Thousand Muslims  @webpagelink"},{"comment_id":"1341790949180015","commenter_b":"There are people in the world that defend raping children and killing babies . Ignore these people .","commenter_a":"Disgusting.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1281596298596888","commenter_b":"I physically couldn't go eaither. But we can still stand in solidarity on social media. #IBiteGrabbers #MyVaginaMyRules #NastyWomenUnite","commenter_a":"Not starting a fight here, you right I'm old the same age as Madonna but just never followed her. I wish I had gone. What a great way for women to express themselves. Sorry no harm intended","post_message":"LIVE VIDEO: More than 500K are downtown at a rally for the Women's March on Washington MORE: @webpagelink"},{"comment_id":"1714085968841110","commenter_b":"WTF WORLD U LIVIN IN THEN MOTHA FUCKA GTFOH","commenter_a":"He need to take him and his gang go play I'm traffic","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
