[{"comment_id":"10156291676570500","commenter_b":"So so sad!","commenter_a":"Was it her baby or was she babysitting ?!","post_message":"Deputies say they found him in possession of child porn sent to him by his wife. @webpagelink"},{"comment_id":"1252586078101378","commenter_b":"close the borders is THAT step you @$$hole","commenter_a":"Yeah he may need to stop staging them, its transparent that since hes been in office we have had the highest amoumt of mass shootings ever, and seems it happens around the time he wants to push for more gun control. Is it me or am i going nuts.","post_message":"Knowing nothing about the causes of the #SanBernardinoShooting, Obama issues his mindless chant for more gun control. cnn.it/1Xzyg5u"},{"comment_id":"935669179891807","commenter_b":"Go Home. U. Brain dead Muslim parasite Abraham sand blasters","commenter_a":"Go back to the Middle East where it's a Holy War USA doesn't want that crap here","post_message":"This Texas mayor wasn't about to let fundamentalist Muslims set up a Shariah court in her town, so a bunch of angry Muslims demanded she surrender. What she hit them with next was NOT what they were hoping for..."},{"comment_id":"970626379645816","commenter_b":"#Ansab go back to your history, that land is promised land to Israel by God. Israel made mistake coz God told them to kill anybody who will be in that land but due to kindness of Israelites now they are suffering with these Palestians cursed tribe. Land of Canan belongs to Israel coz is promised land","commenter_a":"Palestinians they deserve to be killed by Israel because of their provocation. No mercy to Palestinian death","post_message":"More than 60,000 people in the UK have so far signed the petition calling for Israeli Prime Minister Benjamin Netanyahu to be arrested for war crimes against Palestinians when he pays an official visit to Britain next month. Read here: @webpagelink"},{"comment_id":"10156410445115354","commenter_b":"Rebecca the clan was founded in 1865....u ignorant slut....","commenter_a":"If this paper had any business sense and compassion, they would fire that guy.","post_message":"When you see the CARTOON mocking Republican Gov-elect Matt Bevin's adopted children from Ethiopia, just remind yourself: it's only racist when attacks are against Democrats, not Republicans."},{"comment_id":"1242359992482301","commenter_b":"@username I know, I'm just saying. Course, they could always do what those nutters in that Ukrainian training video do.","commenter_a":"That's great and everything, but it's a whole different thing when there's bullets and shit coming back AT you. Paper doesn't fire back...","post_message":"See more training and combat at > Afghanistan Combat Footage - Funker530 CONTACT FRONT! ~Josh"},{"comment_id":"10158101758695291","commenter_b":"And you know this how?","commenter_a":"Amazed at the crowd who, like all Americans, except native Americans, are from somewhere else. Jesus would not only be proud of these marchers, he would march with them.","post_message":"Birmingham-Shuttlesworth International Airport immigration and refugee march"}]
