[{"comment_id":"505113796343580","commenter_b":"They reproduce like rabbits, anytime a Muslim gives birth in an American hospital they should be sterilized.","commenter_a":"Screw the Muslims, they are all sheep in the cult of Islam.","post_message":"Watch what happens when Muslim Brotherhood extremists attack journalist in front of the NYPD!"},{"comment_id":"1685131825099212","commenter_b":"Bitch!","commenter_a":"Bitch","post_message":"Can you describe #Trump with 1 word?  The Free Thought Project.com (y)"},{"comment_id":"10153470437544726","commenter_b":"Send her ass packing!!!!!!","commenter_a":"She's from florida and hates america. Go away!","post_message":"WATCH: Ariana Grande: 'I Hate America, I Hate Americans'"},{"comment_id":"764404957026018","commenter_b":"I support 100 percent bitch!","commenter_a":"I mean seriously if you support trump you're probably as stupid as a Clinton supporter","post_message":"Geez...what caused this?"},{"comment_id":"10156981805725725","commenter_b":"Someone should exterminate these lowlifes","commenter_a":"You sorry protesters making violence! Mr. Trump paid for that rally in Cali you only making yourself look bad @username will even make America great for you guys. Stop making yourselves look like fools!! Thanks Bernie for the awesome soundbite!! I think that is personally the best campaign slogan to help @username. \"Hillary Clinton had bad judgement.\" @username 2016!! MAGA! Get out and vote Indiana and California!!! We are behind you 100% Mr. Trump in Mississippi!! My in laws in California are voting for @username!! Across the nation Trump 2016!! Your vote matters love America and vote Trump!","post_message":"Thank you Costa Mesa, California! 31,000 people tonight with thousands turned away. I will be back! #Trump2016"},{"comment_id":"10154689824655575","commenter_b":"get rid of this bitch","commenter_a":"Morons","post_message":"Is Jill trying to keep the money rolling in?"},{"comment_id":"10153640663754205","commenter_b":"#LetThemEatTrump #FuckTheDNC","commenter_a":"Hillary will have us in a war with Iran. We need to avoid Hillary at all cost.","post_message":""}]
