[{"comment_id":"10154323067108822","commenter_b":"Fourteen people are DEAD!","commenter_a":"So glad to see everyone is a judge!!! Are the kids wrong for what they did? Yes! Should they be punished for what they did? Yes! No one who made any of these comments could be their parents I'm sure or you wouldn't be saying such hate filled things. No one is going to win in situations like this, I pray all the families and businesses can come back from this, I pray something can be salvaged somewhere. And I pray everyone who has hate in their hearts can change. This world would be a much better place if people loved like they are supposed to, to much greed and hate now. How would any of you feel if they were your family members or if you lost someone. I'm sure some of you are christians?? Think about what you could do for someone instead of spreading hatred and negativity!","post_message":"JUST IN: 2 juveniles have been charged with starting the Tennessee wildfire that killed 14 people."},{"comment_id":"10154994136091800","commenter_b":"He probably knee jerked so hard he got a bloody nose and blames it on picking it too much!","commenter_a":"Trevor Noah is a puppet... Go back to south Africa where division is welcome stop trying to divide my country with your shitty humor... #Bringbackstewart","post_message":"The Daily Show recaps President Trump’s flurry of executive orders."},{"comment_id":"729187697271808","commenter_b":"A Hot MESS","commenter_a":"She should be in jail. Who is protecting this criminal and why.","post_message":"Like if you agree."},{"comment_id":"10156128714545725","commenter_b":"About time he helped his teammates out","commenter_a":"Them mugfucken Cubs been killen","post_message":"What a game! Let's hear it for the Cubs ----> @webpagelink"},{"comment_id":"10152853525740667","commenter_b":"If she needs to step down than Bruce Jenner needs to be a man","commenter_a":" Michelle","post_message":"Last week, Rachel Dolezal's parents said she was born Caucasian and has been deceiving people into thinking she was African American."},{"comment_id":"1776830319009844","commenter_b":"Maybe Cat is looking for a sanctuary city for cheap labor .","commenter_a":"Thanks","post_message":"Hardworking men and women from Peoria have always taken great pride in knowing their community has been home to Caterpillar, and there’s no denying this news is a real blow. Two years ago, I joined with officials from across our region as Caterpillar announced its intention to expand its footprint and keep its headquarters in Peoria – so this news comes as a shock. Our local economy is tied to the success of Caterpillar. My hope is that Caterpillar will keep the promise it made today for Peoria to remain its largest manufacturing site. I stand with all Peorians in expressing my deep disappointment with this decision."},{"comment_id":"10156794675835389","commenter_b":"That's what happens when you allow undocumented immigrants flood into your country, Duh....","commenter_a":"So where is the UN? What is the purpose of th UN? How much money does the UN get to do nothing to help","post_message":""}]
