[{"comment_id":"10154884648408984","commenter_b":"The old saying ...behind a good man is a great women.... nothing wrong with that","commenter_a":"Very impressive - I have watched her handle exceptionally tough and even hostile interviews exceptionally well. Great job!","post_message":"Trump's campaign manager, Kellyanne Conway, is the very first woman to run a victorious presidential campaign. After the election, she reveals why Trump chose her..."},{"comment_id":"551488165033429","commenter_b":"Wendy is my bitch","commenter_a":"@username wendy is the most annoying motherfucker. Bitch always has something to say, never intelligently or well spoken, and always speak out of her ass. SHHHHHHHHHHHHHHHHHH.","post_message":"This is how you shut down breastfeeding shamers. Read more about Alyssa Milano's activism here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"939497619530050","commenter_b":"She is a she!!!!!","commenter_a":"People can't see that this is a case of mental illness. I'm all for freedom of expression, but this is a cry for help.","post_message":"He calls it beautiful. You might call it disturbing. He removed his ears, tattooed the whites of his eyes, and did lots more in his transformation from Robert Hernandez to Tiamat, the Dragon Lady."},{"comment_id":"10153917800769087","commenter_b":"Suck Ass Fox (lol)","commenter_a":"the people who think trump is a joke need to get smart....in a hurry. the only vote that will count in november is the one cast to defeat, no, destroy trump. i don't think jill stein will do that. hillary will. hold your noses people and do the right thing. for the wrong reasons perhaps, but do it. after the dust settles and trump, god forbid, wins, it will be too late to hear you whining.","post_message":"Dozens of the most prominent people in Silicon Valley signed an open letter on Thursday warning that Donald J. Trump \"would be a disaster for innovation.\""},{"comment_id":"517994265057820","commenter_b":"she is a pig","commenter_a":"She is an idiot, why does anyone give her the chance to prove it and get her 15seconds of publicity?????","post_message":"Mike Brown's mom just said something infuriating about the two cops who were just shot. This is absolutely disgraceful. No wonder her kid was a thug. Do you agree Mike Brown's mom is totally out of line?"},{"comment_id":"10153231447637217","commenter_b":"But if she was an alcoholic, it would be okay","commenter_a":"...and yet we allow 16 year olds and younger to raise children because 'if you do the crime, do the time' BUT HEAVEN FORBID THAT YOU SMOKE MARIJUANA","post_message":"Sindy Melany Ortiz says a hospital is restricting her access to her newborn daughter because she smoked marijuana."},{"comment_id":"1180816798605996","commenter_b":"Our babies are so talented and intelligent","commenter_a":"Aram Kc Julia McLeod Ayling","post_message":"Happy International Cat Day!"}]
