[{"comment_id":"1056254801076607","commenter_b":"That's funny but I don't think you could trust Rubio on the border. He's too in to amnesty and letting illegals in.","commenter_a":"Won't it be great when Trump is President , and Rubio is reassigned to mixing cement on the Mexican border ?","post_message":"BOOM!!!"},{"comment_id":"10157152900750206","commenter_b":"I was with the writer until he called Manziel \"talented.\"","commenter_a":"Who cares!! He's a spoiled little brat that had everything handed to him. he has no class and a horrible role model for our youth. He shouldn't even be in the NFL..","post_message":"The football player's own father said, \"I truly believe if they can't get him help, he won't live to see his 24th birthday.\""},{"comment_id":"1266389850103907","commenter_b":"@username, do you kiss you're mail man with that mouth? Ms classy","commenter_a":"Every responsible voter should remember these days of how badly the democrats have acted after the Trump win and NEVER AGAIN vote for or put a democrat into a position of power, as they become once elected monsters absent completely of morals and integrity.","post_message":"Georgia Secretary of State now asking Trump to look into why the Department of Homeland Security has been trying to hack the Georgia voter database"},{"comment_id":"1789863337898793","commenter_b":"NO !","commenter_a":"Like a dog misses fleas!","post_message":"Will you miss having President Obama in office when his term ends?"},{"comment_id":"879451945423561","commenter_b":"The Bimbo queen herself Sarah Palin.","commenter_a":"I hope she doth","post_message":"This is criminal!"},{"comment_id":"10153544665036159","commenter_b":"about as transparent as a full inkwell","commenter_a":"Because all requests and responses must be vetted by the White House. Who would ever imagined!","post_message":"Transparency?"},{"comment_id":"10153833449353145","commenter_b":"Ignorant uniformed woman!","commenter_a":"Totally stupid. It's an illegal drug! Small amounts lead to large amounts. Bad enough there is a jerky a.. Attorney who is trying to legalize marijuana in Orlando. Get a grip. Bad enough this state is number one in the country with the worst drug problem!!","post_message":"This would be a major change in Orlando, but is it a step in the right direction or should leaders nip this in the bud? Let us know what you think."}]
