[{"comment_id":"1338517659516985","commenter_b":"I call Bull!!! On that one!!! I have to perform and work twice as hard than my Caucasian counter part and still make less money. Do the 'work' of a title position but not get the position because the Caucasian has it and can't do the job!!!","commenter_a":"Always like this Guy best of movie real actor love him I see most of his movie .","post_message":"So accurate, it’s SCARY!"},{"comment_id":"10153773404108984","commenter_b":"You Gotta Love America !!! :) I Do !!!","commenter_a":"Go Obama.","post_message":"The head of the National Sheriff's Association just threw down and issued a blunt threat to Barack Obama. This cop isn't going to take Obama's anti-cop attitude any longer, and now he's going to do something about it. This is awesome."},{"comment_id":"10156378664500725","commenter_b":"I have an idea. JDLTI. Just don't let them in. When you become President close all immigration for up to five years. We can take care of the terrorists in the Middle East while weeding them out here in the U.S.","commenter_a":"E","post_message":"I keep saying it. When the President of the United States of America, Barack Obama -  will not issue the words RADICAL ISLAMIC TERRORISM - the problem will NOT BE SOLVED!"},{"comment_id":"1056254801076607","commenter_b":"That's funny but I don't think you could trust Rubio on the border. He's too in to amnesty and letting illegals in.","commenter_a":"Won't it be great when Trump is President , and Rubio is reassigned to mixing cement on the Mexican border ?","post_message":"BOOM!!!"},{"comment_id":"10157863685855354","commenter_b":"she will be the death of our country","commenter_a":"She ain't no lady. She's a hydra. Think about it- during the whole day every MSM outlet was focused on a 10 yr old comment while- An arms dealer was not charged because he said he'd tell on POTUS and Clinton Russia had drills for its citizens to go to underground shelters The FBI was caught being more than complicit in helping destroy evidence The internet was given away The UN is coming for our small arms- both thanks to POTUS","post_message":"JUST IN..."},{"comment_id":"1268420859891333","commenter_b":"Stfu lol","commenter_a":"Amanda merry christmas lmao","post_message":"Bruh!  #Gifts #WSHH"},{"comment_id":"10155578231251509","commenter_b":"Leave then illegal.","commenter_a":"If Trump wins I'm leaving the country. If Hillary wins I'm still leaving the country. This isn't a political comment, I just want to travel.","post_message":"Watch Donald J. Trump supporters in Cincinnati, Ohio, react to the candidate's projected win in that state.  Live election results and coverage: @webpagelink"}]
