[{"comment_id":"10153825338913690","commenter_b":"... and what does anybody to prevent it, concerning slave traffickers???,","commenter_a":"Well it's right what you say, but where is Qatar in that case? Shouldn't Muslims help Muslims. I can't see any help from Saudi Arabia, Qatar or UAE!","post_message":"\"To have the small bodies of babies and children carried ashore or washed up on these idyllic beaches is devastating. I have seen children sleeping in the mud under a flimsy bit of cardboard, and kids shivering with blue lips and hands. We expect the situation to get much worse as winter really bites.\""},{"comment_id":"10154333697561509","commenter_b":"@username You jsut described yourself and your mother. You crazy old lady","commenter_a":"Have you noticed who the Trump haters are? I have.......Go Trump.","post_message":"\"Six months out from Donald J. Trump's foray into American politics, the national media is finally coming to terms with a hard truth: It's Trump's world, and they're just covering it.\""},{"comment_id":"1140743049271284","commenter_b":"Little girl, you are asking for a theocracy, which America is not. Time for you to leave and go to Iran, pookie. No one wants your cowardly, uneducated, anti-American traitor self here.","commenter_a":"If God said it, it is settled!, no matter what any pervert says! And the supreme court is not supreme!, God is!","post_message":" represent the people, and the people have shown several times that they are opposed to this, and are in favor of traditional marriage, state Rep. Bill Chumley, R-Woodruff."},{"comment_id":"851657764869646","commenter_b":"Keep on keeping on...........read the Bible verse EVERY DAY! If the atheists/muslims don't like it then let them leave!!!!!","commenter_a":"good-for-this-principal-","post_message":"YES! This school won't bend to the whims of #atheists! This is how they stuck it to #FFRF:"},{"comment_id":"10155752220095603","commenter_b":"Black lives must not matter too much, stupid idiots cannot stop killing each other.","commenter_a":"Tired of all this carp. Can we get along for a change.","post_message":""},{"comment_id":"10153091738774071","commenter_b":"Tesla already solidified its royalty by breaking the consumer report ranking system 😜","commenter_a":"\"While Porsche's Concept Mission E is just a concept now, Porsche said that it aims to begin production in the next five years.\" The cheaper Tesla will be out by then and Tesla Motors will solidify it's spot as the king of e.v's.","post_message":"The future of Porsche? (via Tech Insider)."},{"comment_id":"1109262989140148","commenter_b":"Crazy woman- Good match for Trump","commenter_a":"What an imbecilic shallow fool! Has she ever gone a day without knowing where she will sleep for the night or whether she will find a meal before the end of the day? God! Someone just shut her up!","post_message":"\"Knowing that Trump won on [immigration], it should empower you to go ahead and ask the candidates, 'What the heck are you thinking, candidates? What are you thinking when you're going ahead and actually asking for more immigrants, illegal immigrants, welcoming them in, even inducing and seducing immigrants with gift baskets of teddy bears and soccer balls?' \" Sarah Palin said."}]
