[{"comment_id":"10152936340096770","commenter_b":"She is such a Train Wreck","commenter_a":"Bored","post_message":"Kim Richards spent the night in jail and was released Monday afternoon on a $5,000 bail."},{"comment_id":"1929449190619936","commenter_b":"Trump will not get a record number of votes. No way. This is going to be the biggest landslide in modern American history.","commenter_a":"My prediction in this election is that Trump will get a record number of votes beating Hillary. But Hillary will get the electoral vote giving her the presidency. The electoral is there so the establishment gets final say. Sad but true. Isn't that right Bernie Sanders.","post_message":"Donald J. Trump says he would \"promise and pledge\" to accept the results of the election --- if he wins."},{"comment_id":"1005026196219449","commenter_b":"Demon dog born of a jackle, shut your butt hole","commenter_a":"He didnt do nuffin...he was just minded his own biz..like they all do..blame the whites in America. .tell me one state thats mostly black..that dont have a high crime rate?..then tell me how its whites fault...anddd go!","post_message":"Authorities in Austin, Texas have identified the Black, unarmed teenager who was fatally shot by police Monday morning. Initial reports didn’t name 17-year-old David Joseph or his age, but what has been revealed is that he was naked at the time of the shooting. Geoffrey Freeman, a sergeant with Austin police, and other officers were responding to a call at an apartment complex. Although details are scant, Freeman arrived on the scene and apparently opened fire. MORE ---> @webpagelink"},{"comment_id":"10152741968547894","commenter_b":"Eboney Are u Sure. We can only go by what she said. Bitch lied on Memphis, she is a bitch that would have taken it further. She was hurt because he would not marry her ass. Haven't heard about her going to any more Domestic Violence charities or events. What is that about. Her butts hurt.","commenter_a":"I remember when that \"beef\" started.. Tamar didn't start it.. She made a comment about Toya living her fairy tale and K Michelle thought it was in regards to her being a liar and she went in.. K Michelle's response called her a muppet and said that she preferred Toni.. So she can't play that Newton's Law card.. K Michelle is known for being a bully.. Just like Tamar is known for being the Shade Queen!! I think they should fight about it 😒 or let it go and be friends.. #JustMyOpinion","post_message":"Tamar Braxton Breaks Down in Tears Over K. Michelle's Hurtful 'Muppet' Comments, K. Michelle Responds [Photo + Video]"},{"comment_id":"555840684604224","commenter_b":"Look how christianity views woman it's almost as bad","commenter_a":"What confuses me is why women would want to stay in this horrific religion that view women and children less than animal's. Mohammed is dead he isn't coming back !!!","post_message":"Spread this..."},{"comment_id":"10156239205725354","commenter_b":"Let America become a car and truck free nation! and make it against the law to have any types of butter knives, butcher knives, and no hatchets, swords or knives of any shape or form, no sharp spears or sticks of any kind, pointed objects, needles including knitting, or sewing needles and absolutly NO clubs or bats or rocks of any shape or kind!! No ropes or twine or chains or braided objects! If they break the law and have any of these weapons in posession they will be put in prison untill they rot! Now tell me how is the government going to house and feeed all these lawbreakers????????............................................?","commenter_a":"You guys have no frigin idea what your talking about.","post_message":"No word yet on when they will call for a car-free America..."},{"comment_id":"1083559065045639","commenter_b":"She would have to pay me to go listen to her garbage.","commenter_a":"Are you listening Mom and Dad?","post_message":"What an incredible waste of both time and money. Blow it on beer, or burn it for warmth. Both better ways to spend your cash. Y'know, since college kids always have an extra three grand lying around."}]
