[{"comment_id":"10153020526397464","commenter_b":"STAND FOR PRINCIPLE or lose America!","commenter_a":"Either the Republican party morphs into liberatrian values or even conservative values, I see no reason to continue to throw away my votes on them. As it stands now, the difference between Republicans and Democrats is hard to see. They are BOTH for bloated Federal Government way beyond it's constiutional limits.","post_message":"We are facing a fundamental decision for our country.   Do we go back to the same old, same old or do we stand for principle? #SCTeaParty15"},{"comment_id":"932314590139215","commenter_b":"She's definitely covering her butt! It's all about the $$$$$$$$$$!","commenter_a":"Her check book should get a lot smaller after her nasty comments to all Americans. She just sunk her ship. Remember the Dixie Chicks comment?","post_message":"After 24 hours, Ariana Grande has issued an apology for saying she hates America.  And it's very bizarre."},{"comment_id":"10153327022163984","commenter_b":"I hope that he succeeds She is Satan","commenter_a":"Go all the way with this!!!!","post_message":"It’s been just over a week since Hillary’s announcement set off a firestorm of negative press about her past.   But one scandal stands out… Benghazi! Send an email to Rep. Trey Gowdy and tell him to pry the truth out of Hillary Clinton!"},{"comment_id":"10154141552967426","commenter_b":"Those who are always accusing others of hate don't seem to have enough self awareness,intelligence or what ever to know how obvious it is who they hate.","commenter_a":"Welcome to Hillary's America RVA.....","post_message":"\"Your vote was a hate crime,\" was sprayed painted on statues that honor Civil War icons along Monument Avenue in Richmond.  The graffiti was discovered as hundreds protested the election of  Donald Trump as president.  Updates: @webpagelink"},{"comment_id":"10154789506552439","commenter_b":"Get the filth back to the sand","commenter_a":"If the president cant name the enemy as Islam then the media and police cant either...im assuming this is a direct order from the whitehouse as Lt Chris Cammock eluded in the press conference that there were \"other\" departments at play...","post_message":"The Muslim targeted women -uncovered women -- in Macy*s, in the cosmetic department and he was shouting. They don't tell us what he was shouting but we already know, don't we? He killed four women and one man."},{"comment_id":"1694121650829136","commenter_b":"@username the immigrants themselves cannot legally however once they have a child in America we won't kick them out because they have to raise there American born child this is the idea called anchor babies","commenter_a":"What about his son? His wife is from Hungary right and his other kids had a Mother not American. How does that work?Ship them back I guess.","post_message":"\"No, it’s not in the Constitution. If you read and if you look, and if you go to the real scholars, like different people that I can give you, they will tell you.\" – Donald Trump  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10150833830084963","commenter_b":"What you should get is that it is too bad your mom didnt see you as cells and abort. Ouch stings like that.","commenter_a":"I can not understand why Republican women believe that their bodies and their minds belong to ANY government. If you do not believe in abortion, do not have one.","post_message":"Though the 2017 Official March for Life is happening today, there are indications that most Americans still approve of Roe v. Wade."}]
