[{"comment_id":"511283065698315","commenter_b":"But she looks like she has taken lots of dicks in her ass/mouth then made out with you","commenter_a":"But he will walk away with no punishment because USA is Saudi arabias little bitch","post_message":"That's a lot of drugs."},{"comment_id":"10154113028645329","commenter_b":"Does this mean we all just became best friends?","commenter_a":"Wow. Completely true. Very accurate quiz.","post_message":"It really will. (via BuzzFeed Quiz)"},{"comment_id":"10154871308810586","commenter_b":"Oh it was Bakersfield, now I get why it happened.","commenter_a":"Brooke, I bet this is my problem!!","post_message":"“They said it’s just fat, you’re just fat…it’s just fat developing there,” the man said of the benign tumor that doctors now believe likely started due to an ingrown hair."},{"comment_id":"1119120924851115","commenter_b":"You're a misogynistic prick who probably doesn't get laid often. Go masturbate or something.","commenter_a":"Aww poor babies couldn't handle a wittle emotional turbulence? Fuck you, you are such testicles (in lieu of pussies, which can actually take quite a pounding).","post_message":"Depression, muscle pain, mood swings, acne, and changes in libido – sound familiar?"},{"comment_id":"10153162222096051","commenter_b":"I think it should be done in private. What's a woman going to do just flop it out in front of everybody","commenter_a":"You can breast feed in public without your boobs hanging out.","post_message":"This woman was shopping at her local Target when she noticed that the store had left a special message to its customers."},{"comment_id":"1169884533107797","commenter_b":"Google William Jennings Bryan or Dixiecrats. Tories and Confederates were conservatives too. Wrong side of history since day one.","commenter_a":"The first black senator and congressman were Republicans :)","post_message":"Only one black woman has ever served in the Senate. Will that change this year?"},{"comment_id":"10154360980241336","commenter_b":"I would rather see the winner of the Miss USA pageant as president than that nasty skank Hillary","commenter_a":"That's because most Miss USA contestants are a whole lot smarter than Hillary.","post_message":"Thoughts?"}]
