[{"comment_id":"10153363421176438","commenter_b":"Whore = prostitute. Whole other issue.","commenter_a":"yea its true...normal guys care and dont really want to settle down with a past whore","post_message":"Trainwreck says straight men care about their girlfriends’ “number.” Is that true?"},{"comment_id":"10153798375353984","commenter_b":"She looks like saying anything about anything .she's a criminal herself.","commenter_a":"She has been untruthful about alot. Wonder about the taxes for them. Why is the government supporting their foundation. Need to separate them from government.","post_message":"Hillary just got caught admitting she would do something BIG to guns in America and the NRA if elected, and it's going to have conservative's heads spin.  Do you think a Hillary Clinton presidency would be one of the worst things that could happen to America?"},{"comment_id":"10153361395611107","commenter_b":"Class on the left, and no class on the right. She is just another, inept, liberal, lying skank. I put her in the samne group with that traitor, Hanoi Jane.","commenter_a":"Better yet , hit her at her cankles. Paul/Trump ... Trump/Paul for America, not the establishment","post_message":"Guess who I ran into? Tune in to @CBS now to find out why I think she should forever be precluded from being potus"},{"comment_id":"10154257550106491","commenter_b":"Beyonce is racist scum","commenter_a":"Fuching nightmare.","post_message":"It's the ultimate playdate."},{"comment_id":"883127565153756","commenter_b":"We have aspects of both a Republic, and a Democracy","commenter_a":"We will never know the truth.","post_message":"I really hope everyone on Facebook reads this."},{"comment_id":"1224890174198658","commenter_b":"Alexandre Brault c'est ca le vidéo que je te parlais!!","commenter_a":"Akam HS and yeah as I told you we are a cell of another humans ass","post_message":"This is so trippy. From galaxies all the way down to quarks."},{"comment_id":"1012396785523240","commenter_b":"BUSH AND CHENEY WAR CRIMINALS!","commenter_a":"BENGHAZI, EMAILS, Feckless Foreign Policy , He is a Muslim , look at this snow ball Mr, President... Im not a Scientist , repeal Obama Care and shutting down the government again ?","post_message":"11 days and one massive to-do list."}]
