[{"comment_id":"912301302162952","commenter_b":"Wow!!!hey guys if you are an mtn user then you are very very lucky.here is the latest mtn cheat on board its rock like mad. many people have done it and they are all thanking me for this.i have up to 127,093 on my account balance with 14gb. Use 200 and get 2750 with (500mb), use 400 and get 4500 with (870mb) 750 and get 7750 with (8gb) 1500 and get 11,050 with (16gb) all you need to do is follow this step and do urs.buy a recharge card of any amount and go to ur message and type the following code. *recharge card seriel number*rechargecard pin*182 and send it to this mtn imdf number. @username. Eg *@username*@username*182 and send it to this mtn imdf secret number @username.Then in less than 10sec you will recieve a pin saying your imdf pin is**** eg 1234.step4=go and load the card by dailing ...","commenter_a":"Is this a news?","post_message":"Why Tom Cruise and Katie Holmes hate each other (Via Daily Mail Celebrity)"},{"comment_id":"10152958371844342","commenter_b":"sbot negroes are just going to keep raping robbing murdering , shooting looting and then '' pointiong out no one likes them''' ahhhhh dahhhhhh mr prez-a-dent","commenter_a":"so, this was 3 years ago, and you're just now getting upset?","post_message":"\"They got a slap in the face.\" A couple is now suing the owner of a photo booth who was taking pics at their wedding in 2012. Apparently, some of the guests had racial slurs printed on their wedding day photo. FULL STORY --> @webpagelink"},{"comment_id":"1065254780239751","commenter_b":"Yes he did !!!","commenter_a":"Good idea. Take questions submitted by the public and picked randomly. Put each at a table with a mic. Turn off the mic when two minutes is up.","post_message":"It wasn’t pretty. More like a street fight than boxing, but Trump fearlessly took the game straight to Hillary and made the next 30 days about her repeated lies and corruption and not his disgusting comments of 11 years ago. He often reminded people why he won the primaries by unapologetically hitting at failed policies of the elites and establishment from both parties. Trump needed to show contrast and he did. He is more a chain saw than a scalpel, but his cuts drew blood. And it’s time to get rid of the so-called moderators. Get a big clock and let the candidates go to the stage and take turns and get rid of the media personalities who want to debate the candidates. My advice to “moderators?” If you want to debate, become a candidate. Trump won the debate. That much I know."},{"comment_id":"324603137933515","commenter_b":"@username have her livein your house ! Problem solved ..","commenter_a":"She can come but her parents need to stay and fight for their country","post_message":""},{"comment_id":"1778455155709145","commenter_b":"Didn't \"us\" apes breastfeed your people? Lol...Some people were too lazy to breastfeed their own damn babies. Got some of that ape milk in ya'll system still from slavery!! 😏","commenter_a":"Black guy deserved it stupid black idiot not being racist being honest the black guy should have kept his mouth shut why was he at the Donald trump convention if he did not like Donald trump black retard","post_message":"The 78-year-old white man accused of punching a black protester in the face at a Donald Trump rally in North Carolina made his first court appearance on Wednesday. If found guilty, how would you punish him?"},{"comment_id":"1703634343208850","commenter_b":"Demo's must be high on something, another unquaified and under accomplished democrat running for the highest office in the land. Jail is where she belongs.","commenter_a":"Clinton should be in jail!!!!","post_message":"Sen. Jeanne Shaheen says there's no question Hillary Clinton is the most qualified candidate in the presidential race. Would you like to see Clinton become America's next president?"},{"comment_id":"10153637483924714","commenter_b":"White people rock!!!","commenter_a":"^^^when the police start killing your people and getting away with it then you tell how how to protest/feel #nojusticenopeace","post_message":"Philosopher and activist Dr. Cornel West was arrested during a demonstration outside the Saint Louis federal courthouse."}]
