[{"comment_id":"1820054648241595","commenter_b":"I agree the farther him an his tranny wife are from the white house the better !","commenter_a":"What is wrong with you people. Thank God he's on vacation and not going to get involved and make things worse!","post_message":"Nothing gets in the way of Barack Obama's golf game."},{"comment_id":"1328476607175126","commenter_b":"Lachy are you mad?! Let's do the gym like this next year! A Christmas wonderland","commenter_a":"@username Lachy Munro","post_message":"You think you love Christmas? This couple has more than 100 Christmas trees in their house."},{"comment_id":"10155023527124614","commenter_b":"Oh it was...Sears. It's been awhile since this happened.","commenter_a":"It's sad to see Sears going this way. They lost their way and are seemingly heading towards permanent closure. What's sad is I think Kmart is to blame, whoever at Sears approved that merger with Kmart as they were going through bankruptcy was crazy.","post_message":"Sears Holdings announced today the closure of dozens of Kmart and Sears locations, including multiple locations in California. Stores in Riverside, Bakersfield, Coalinga and Kingsburg will be closed by the end of March, according to officials. decision to close stores is a difficult but necessary step as we take actions to strengthen the Company operations and fund its transformation. Many of these stores have struggled with their financial performance for years and we have kept them open to maintain local jobs and in the hopes that they would turn around,\" officials said in a statement."},{"comment_id":"1949140865300152","commenter_b":"Yo baby daddy work at the post office now? 😩😂 Imani Ave","commenter_a":"MsJackson Ifyounasty i think I would have sprayed them too would you??","post_message":"A postal worker caught on camera appearing to pepper spray three dogs. What happened to the dogs and how did USPS respond? ABC13-Jessica Willey has the details: @webpagelink"},{"comment_id":"844972862206722","commenter_b":"Why don't women have enough sense to take care of there sex life. U play u pay. Use birth control.","commenter_a":"The guy in the photo wants to be aborted NOW!!!","post_message":"“There are thousands of unborn babies who need us to fight.\""},{"comment_id":"1179133135441029","commenter_b":"No you're thinking of a dog. Easy mistake to make.","commenter_a":"Wasps bite. They don't sting.","post_message":"And you thought getting stung was bad."},{"comment_id":"10153854800096955","commenter_b":"@username loooooooool u stupid Americans are cute. Have fun finding water in 5 years 😜","commenter_a":"You should have to have a comprehensive background check before anyone can just buy a knife and close the knife show loop hole . Problem solved !","post_message":"NYC Residents On Edge After 3 Slashing Attacks In Less Than 48 Hours..."}]
