[{"comment_id":"1456373527716006","commenter_b":"secede already and take your cousin wife with you and all the other uneducated ignorant trash with you. Republican policies fail every time and only uneducated idiots do not see the truth that is why your state doesn't believe in education","commenter_a":"Once again......Trump was right!!! And that kills the over sensitive lefties.....","post_message":"Trump once remarked to a \"Celebrity Apprentice\" contestant that it \"must be a pretty picture, you dropping to your knees.\""},{"comment_id":"1073989012671274","commenter_b":"LOCK HER UP !!!!!! LOCK HER UP!!!!!!!!!! LOCK HER UP!!!!!!","commenter_a":"Yea to Iran and Syria to send there trash here while our jobs and wealth leaves while you trash the country to get rich???? Yea ok...#TRUMP2016","post_message":"\"Next week in Philadelphia, we will offer a very different vision for our country, one that is about building bridges, not walls.\"  In introducing her running mate U.S. Senator Tim Kaine, Hillary Clinton promised the DNC would look quite different than the RNC. bit.ly/2a3iybw"},{"comment_id":"10154316931887654","commenter_b":"it's with the thieves,rapists and murderers! this lady is a witch!","commenter_a":"It's hard to believe that she has enough brain to keep her breathing...........The woman is a grieving mother whose son was murdered by someone who should not have been here. Our borders are sieves because of failed policy and Pelosi says he was a \"law-abiding citizen\"???? Where is her soul? Her compassion? Her empathy?","post_message":"Democrat leader sides with illegal aliens over mom whose son was murdered by one."},{"comment_id":"10153906444119705","commenter_b":"All these people on here saying Apple is supporting terrorism have no clue. If the software is created to unlock this phone, it can be used to unlock any phone. They all use the same data encryption software. This would put all of Apple's customers (hundreds of millions of us around the world) in danger of our privacy being breached by thieves or overreaching governments. Apple has complied with every aspect of this investigation otherwise, including providing data stored on its servers as required by warrant. But the software needed to break into the rest of the data on this phone doesn't and shouldn't exist.","commenter_a":"The order specifically refers to *this* phone, specifically allows Apple the option of doing it on *their* premises, and specifically allows *Apple* to retain control of the method used. What? They can't keep that process secure themselves?","post_message":"Apple vs. the FBI explained, how this case might affect your iPhone."},{"comment_id":"443733605833672","commenter_b":"Mr. Trump, Your idea of building a wall to slow / prevent illegal immigration is far too narrowly focused. Here is what I think a solution to the problem could be. No matter where the immigrate is coming from. Though not my original idea it is a workable one - All immigrate males between 18 & 50 to be immediately inducted into the military to receive basic training, After completion, sent back to their country of origin, then given their weapons and told to defend and reclaim their own country. After they accomplish that we send them their families because they would have no excuses to come here. If they refuse to do this then they and their families can find another country that will take them because they would never make an AMERICAN anyway. We should not have to send OUR military to their country to fight and die ...","commenter_a":"We don't need 1,400 years of cosanguineous brain damage. We have enough of our own in the Republican Party.","post_message":"Our country is in trouble. We’re going to stop people from coming into our country illegally. #GOPDebate"},{"comment_id":"10154175784276509","commenter_b":"So how bad do you want a woman elected?","commenter_a":"Bernie Sanders cannot win a national, general election. Social media supporters should probably accept this.","post_message":"Bernie Sanders is signaling that he's increasingly willing to take personal shots at his chief rival Hillary Clinton in the Democratic primary."},{"comment_id":"1048428675208939","commenter_b":"@username What are you reading? How did the US government start this war? The Syrians and everyone else out in North Africa and the Middle East have access to the internet and make their own decisions. When people have access to information freely they act accordingly. People have free will to think and make decisions. No one forced the Syrians to fight or oust Assad. He cracked down on protests violently and this is the result.","commenter_a":"How can Assad sleep at night knowing he is responsible for the deaths of 300,000+ of his own people. It's disgusting","post_message":"What chance is there for peace in Syria? Join our Q&A"}]
