[{"comment_id":"10152896825378635","commenter_b":"What cowards!!! Five against i woman!! Day of judgement belongs to the Father\" Animals!!! There will be no rest , or prizes , at end of life for you .. How C an you be so dumb!!!! .so so evil ... Under the control of satan, and do not even know it!!!","commenter_a":"There are bad people in every religion.","post_message":"\"The five Muslims took hold of me, and they raped me there,\" the church source quoted the daughter as saying. \"I tried to scream, but they threatened to kill me. One of them said, 'Your father should stop this prayer meeting of trying to change Muslims to become Christians and close the church building — we have warned him several times.'\""},{"comment_id":"10154096917590329","commenter_b":"Grade 6 gym class. Ran face first into a cement wall during a game of dodgeball. I had two black eyes, one of which was swollen shut, and a nasty bump on my forehead. Our picture day was the following week. Best school picture ever!","commenter_a":"Jon Maloney you could add a story to this","post_message":"LOL"},{"comment_id":"1239847632704451","commenter_b":"Hillary is the Unindicted Felon!","commenter_a":"That is exactly what pisses me off the most, to see the wealthy paying zero taxes! I pay taxes so I make my contribution to our government just like millions of Americans do! It sucks, really sucks! And then to say it is smart not to pay taxes on National TV? That is an insult to the American people! Bragging about it makes me think that those who support this clown have something wrong in their heads, period! Is this the kind of Commander in Chief we want?","post_message":"There it is, folks!"},{"comment_id":"10153716144117577","commenter_b":"Your talking bullshit.","commenter_a":"I am an athiest so it's all bullshit to me anyway ... but you god nuts hate the pope because he is too close to what (if he did exist) christ would have been like .. do you not remember the part in the bible where jesus said \"there is more chance of a camel passing through the eye of a needle than a rich man getting into heavn\"? .. what about his whole ghandi/ john lennon peaceful hippiness .. \"let he who is without sin cast the first stone? .. and what about how jesus spent a lot of time hanging out with the poor, sick and prostitutes .. and he fed them and helped them .., some of you extreme conservative \"christian\" extremist terrorist CUNTS should actually read your bibles once in a while ... O and by the way ... if you are a good \"christian\" why ...","post_message":"Pope Francis has strong ties to socialism and even communism and is helping to destroy the faith of the Catholic Church from within, as Infowars journalist Kit Daniels explains."},{"comment_id":"1812875395612222","commenter_b":"@username......................your a @&$)(:; fool","commenter_a":"Such a BS! Obama made a deal to stop nuclear proliferation. Iran's compliance with our demands lifted the sanctions. So they got THEIR money. Eric Trump is total idiot thinking he knows anything about this matter.","post_message":"\"[President Obama] lied about it. He said that it wasn't ransom money... No different than when he lied about ObamaCare.\"  Yesterday on \"Sunday Morning Futures,\" Eric Trump accused President Obama and Hillary Clinton of lying to the American people."},{"comment_id":"235119820270004","commenter_b":"Haaaaaaaa!!!!! Stupid, stupid lady.","commenter_a":"Too bad crybabies, he is your president. And I hated Obama but I am a grown-up and lived with him and his ugly family for 8 years. So grow up and shut up","post_message":"Trump has now set a record for the most hated president."},{"comment_id":"963644947039340","commenter_b":"But she is dirty","commenter_a":"She knows women's issues best","post_message":"Watch live as Hillary talks to students at New England College in New Hampshire about the issues on their minds."}]
