[{"comment_id":"1794488717482719","commenter_b":"Entertainers are daydreamer & live in fairytale world. Reality is not their attribute or focusing on oneself identity. Most live in denial & are good at role playing an artificial character. I'm not shocked at their liberal idealism & doing whatever for attention. These are individuals that struggle with growing up.","commenter_a":"Are they all just insane. Who cares if you cut your hair or any other stupid thing. It only hurts you no one else. So asinine.","post_message":"This is how some liberal women are coping with Trump's election win."},{"comment_id":"1782129738697799","commenter_b":"She doesnt know, she just wants to bash him because shes a Kate fan.","commenter_a":"Shameful that these girls have been brainwashed.....the mother is more responsible for the marriage breakup. She treated the father horribly. TLC destroyed this family. Just as you have one mother young ladies; you also have one father. He nurtured you as well when you were babies up to the point your mother ran him off. Look at your old pictures and first episodes of your show. Your father was pretty much left with nothing.","post_message":"“He doesn’t even know us”"},{"comment_id":"10150751541914999","commenter_b":"Racists get uncomfortable when a mirror is held up to their face! No problem with unarmed Black men and women being slaughtered on a daily basis in a country that prides itself on being the greatest nation on the face of the earth. I mean, even the United Nations thinks there's a problem. Go figure! And any attempt to prove otherwise just simply means you're racist!","commenter_a":"Wah wah. Shut up and do your job.","post_message":"The Miami police union say Beyoncé had aimed to “divide Americans by promoting the Black Panthers” during the Super Bowl 50 halftime show."},{"comment_id":"10153394886826336","commenter_b":"Mexicans run America now and there is nothing u can do about trump ur screwed...don't run for president no more there is no way ur going to win piece of","commenter_a":"Sue them to Mexico and back!","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10153759061706051","commenter_b":"This is soo EVIL & SICK!!! Where were\\\\ R the kids parents??? Future Monsters in Society?","commenter_a":"poor little guy. he wanted to belong with the older ones. I hope the parents of this little guy sue the crap out of the murder's parents. The older kids had to be displaying signs of aggression.","post_message":"A 6-year-old boy was brutally tortured and killed by 5 other children. It gets worse."},{"comment_id":"10153859068156955","commenter_b":"Leave the mug and leave her alone.","commenter_a":"She didn't like the interview either, (\"Not one bit\"). Did they ask Ms Flossie if & when SHE wanted to be interviewed? It was all very awkward. They gave her a station coffee mug (shameful)... Put flowers on her lap that she can't hold... The kicker to me was the opening where the interviewer held up the newspaper RIGHT IN FRONT OF HER FACE!!!! The whole thing was disrespectful.","post_message":"BEST INTERVIEW EVER"},{"comment_id":"1263136400442382","commenter_b":"You mean Country before party right","commenter_a":"Bunch of bullshit. They need to do there job. Party before country.","post_message":"WOW."}]
