[{"comment_id":"974047066004855","commenter_b":"These tanks could easily create the blast heard around the world. Should that take place, this nation will erupt in a revolution unseen for hundreds of years. The resident of the white house should have his escape plan worked out because We the People will coming to evict him and his whole family .....and his mother in law too......!!!!","commenter_a":"Be afraid, be VERY afraid!!!!!","post_message":"FBI ON ALERT: Theft of dozens of propane tanks, purchase of 150 prepaid cell phones  [READ MORE]"},{"comment_id":"1017702978286400","commenter_b":"It's a true testament to J.K. Rowling's writing that I can read that passage, and, nearly 9 years later, still feel the same goosebumps I felt the first time I read the book in July 2007. Very sad day today.","commenter_a":"\"Look... At... Me...\" He whispered. The green eyes found the black, but after a second, something in the depths of the dark pair seemed to vanish, leaving them fixed, blank and empty. The hand holding Harry thudded to the floor, and Snape moved no more. \"","post_message":"\"It is an ancient need to be told in stories.\""},{"comment_id":"10155066492903352","commenter_b":"this dirty ass white trash have nerve to say something rude tlking about in my mother country do Thy use punctuation marks Bitch u just went thru ur pic on Facebook first of all you hve two boys how wuld I feel if some one were to follow the boys in rape them but then again you look like a crak head so u wuld not give two fucks right stop hittin that pip b4 you wanna tlk about other people in there country trailer trash Bitch don't u hve some beans to go warm up in the fire in eat","commenter_a":"Fa real if you can have the nerve to to that to a child who barley can right his name an innocent baby in the Lord's house you shuld get more than yur face ate in my mother country we wuld have tie his ass up in take turns slicing his body parts mKe him then make hungry stray dogs eat his freaking dick in his balls then when thats over set his ass on fire wile the mother stabs him his ass to see","post_message":"A mother let her 4-year-old go to the bathroom alone during Sunday Service…Rolls Wheeler, 39, followed the boy when he got up, and raped him in the restroom. ----> @webpagelink"},{"comment_id":"1195176803855108","commenter_b":"They, Mexicans, would have had more support, and got more support, but the riots have highlighted the burden they are on our nation AND the quality of the people involved. Now more than ever we want them out of here. The illegal aliens are criminals, it is that simple - but not only here illegally, but getting benefits and even legal advantages not given to Americans (like conviction and released to streets). Illegals are getting better benefits than many American's in need, BUT let's just consider one aspect that without any doubt is unacceptable; illegals are getting aid while vets die waiting for help. We must correct this problem. ONLY Trump will start the process. Thanks you Mexican rioters - you have reached a new low of acceptance in OUR nations. You are creating a new population of racists - it isn't hard to hate watching your antics!","commenter_a":"Taxpayers On BOTH Sides -- Aren't you sick and tired of all the destruction and crapola coming from these little punks and thugs, illegals, and paid rioters?? Taxpayers have to PAY for their destruction and mess! These PAID for Rioters should be ARRESTED, given LONGER jail time and VERY HIGH FINES -- also, if on government welfare programs or student benefit programs - they should be TERMINATED Immediately! Also, Make Them Do Community Service - Cleaning up All That They Destroyed. No Punks & Thugs, or George Sorsos Paid for Rioters, Muslim Agitators, or Law Breaking Illegals Are Going to Stop Donald from Making America Safe, Secure and Great Again! No Left Wing Owned, Biased Media will stop Mr. Trump! The more they try to throw the dirt and lies on Mr. Trump - the more I support him and his agenda, which is to make America SAFE, SECURE and ...","post_message":"KEEP WAVING THOSE MEXICANS FLAGS AROUND....    @webpagelink"},{"comment_id":"494289207428326","commenter_b":"I'm surprised the husband let her swim at all.","commenter_a":"Our Country our way of life. DON'T TREAD ON ME!!","post_message":"Two Muslim women wore their 'burkinis' to the pool and then something amazing happened.  Awesome. Muslim immigrants need to assimilate or leave.  Do you agree Muslims need to abide by our laws?"},{"comment_id":"10156506667295354","commenter_b":"MUCK FUSLIMS","commenter_a":"They hate what it stands for Freedom, and they want to take it over, take away all freedom and replace it with Sharia. They will by population growth win this battle and eliminate all non muslim men, women, and your children if you allow them to settle in our Country.","post_message":"\"The hatred of infidels is a religious imperative in Islam. No matter how fast we dance, appease, pay, accommodate, and submit, the hatred and holy war will not cease. On the contrary, the more we submit and reward the hatred and terror, the more we will have to surrender.\""},{"comment_id":"10154658986437034","commenter_b":"Stop illegal immigration!!!!!!!","commenter_a":"Is it too early to begin impeachment proceedings???","post_message":"THE WHITE HOUSE. We are now exactly 3 weeks into the Trump presidency. Thoughts?"}]
