[{"comment_id":"10153112038031770","commenter_b":"We need TRUMP we need the wall 11 mil illegals today 25 mil tomorrow when will it stop !!!!! North Carolina here voting TRUMP 2016","commenter_a":"And just another reason NOT to have this trash in our country!!!","post_message":"The District of Columbia started issuing drivers licenses to illegal immigrants in 2014, and now some are complaining because the process takes longer than they would like."},{"comment_id":"842181922581654","commenter_b":"@username If you don't understand \"propagate\" look it up... your ignorant conservative bullshit is EXACTLY why we're debating here... you see, your \"bullshit\" has infected EVERYWHERE............. the terrorists, the refugees, the billions of dollars stripped from pensions, healthcare, education, infrastructure, to support conservative idiots and their dumb-fuckery... you ass-clowns should take ALL the fucking refugees, and house them in the districts of the same fucking idiots that voted for those wars (not the acts that empowered your fuckwit) in the first place. Comprende, dickhead?","commenter_a":"Don't worry ... Kerry is drafting an official apology to Putin right now","post_message":"This is what happens when you don't have a REAL leader in charge....Un-freaking-REAL."},{"comment_id":"10152820559047144","commenter_b":"To hell in a hand basket. The women will have to bale them out.","commenter_a":"Most of those pharma pain killers are just synthetic heroin.","post_message":"A recent study found heroin abuse was 19 times higher among people who had previously abused pain relievers."},{"comment_id":"1680131802273932","commenter_b":"Just because you have a blinker doesn't mean you can automatically change lanes. What an idiot! She's lucky to be alive. Remember never change lanes in front of a big rig, They purposely leave that space open, they need a lot of room to stop.","commenter_a":"the world is full of stupid once while going to work a farm truck loaded with green beans tried to pass him as of the right as he was making a right turn little car was broken","post_message":"LESSON: don't mess with truckers."},{"comment_id":"1723610494573092","commenter_b":"Thanks a fucking lot to the woman who decided to skip her period and have this douche","commenter_a":" Marihuana is not physically addictive, but isn't pshycologically just as dangerous!?! Just because one bad and dangerous thing(alcohol) is legal - does not mean that legalizing another is a good idea!!!","post_message":"Alcohol is 114 times more deadly than marijuana.  Like ATTN: on Facebook."},{"comment_id":"10153588117402235","commenter_b":"An abortion is cheaper than kids...just sayin","commenter_a":"Ummm...2 things here...this jail is ridic for withholding/failing to administer medicine for an inmate...but also, stop having kids if you can't afford them...now these kids will be a burden on the system and are at risk to perpetuate this same cycle...aren't condoms like $5 wtf","post_message":"He was arrested for unpaid child support.   Now he's dead."},{"comment_id":"10153141566354641","commenter_b":"She is one of the terrorists in this world","commenter_a":"The time is now, change in governance of UNCLE SAM, time for good women of UNCLE SAM to vote for Hillary Clinton, what a man can do a woman can do it better. Let's give her a chance. She will surely make the difference. UP DEMOCRATIC PARTY.","post_message":"First on CNN: Hillary Clinton’s press team is growing: @webpagelink"}]
