[{"comment_id":"10154120188266770","commenter_b":"She is not funny anytime","commenter_a":"It painful just to watch het","post_message":"Amy Schumer was hard to watch."},{"comment_id":"1648797488740697","commenter_b":"Sadie is a lady Miley is a joke!!","commenter_a":"LOVE LOVE LOVE!","post_message":"America needs more Sadie Robertson and less Miley Cyrus."},{"comment_id":"747501402054427","commenter_b":"Wouldn't happen to my children. My kids are five,three and one. They know better than to go into a wild animal pens. Plus me and my wife keep our eyes on them all the time. Hands are held too at all times. No excuses for that gorilla to be killed. The parents were neglectful and should be charged with neglect and child endangerment. That gorilla didn't ask to be in the pen. Then to be killed for being a gorilla. I'm not saying leave the kid to die either. Sad situation that should of never happened.","commenter_a":"For all of those slamming the zoo for killing the gorilla, what if it was your kid who fell in? Would you want the zoo to let your kid die because the gorilla was endangered? We all need to think and put ourselves in others shoes before we start spouting off on things.","post_message":"Jack Hanna says he agrees with the decision that the Cincinnati Zoo made in killing the gorilla that was dragging a toddler who fell into its enclosure. Learn more: @webpagelink"},{"comment_id":"1702706209988180","commenter_b":"Stupid Question! Why should illegals be allowed to vote here? Do we vote in their country??????? NO!!!!!!","commenter_a":"YES","post_message":""},{"comment_id":"1023820500989519","commenter_b":"Ask Planned Parenthood to pay for it - Bitch.","commenter_a":"There are enough uber wealthy Dems to pay this. Why not hit up Oprah? This is spare change for Holliwood.","post_message":""},{"comment_id":"10154154937686409","commenter_b":"Very smart wife! You'd do well to follow her example!","commenter_a":"Beg to differ tree hugger. My wife warms up her 4Runner for five to ten minutes. I never warm up. Her car is a 2006 and runs like new. I've gone through two cars. And '06 and an' 08","post_message":""},{"comment_id":"974401272656125","commenter_b":"If he is not im sure he has been watching and waiting for his next money making endeavor.","commenter_a":"And here come the riots.","post_message":"JUST IN."}]
