[{"comment_id":"10155083896191178","commenter_b":"He might bring racist charges up against you","commenter_a":"OK I'm going to say it Everyone is racist OK we get it wahh wahh wahh!","post_message":"The histrionic grumblings for the liberal parodies over at MSNBC are STILL outraged over Sen. Sessions.  Liberals never seem to realize that they've worn out the racism accusation."},{"comment_id":"10153478726962293","commenter_b":"Women don't drink beer?","commenter_a":"Cool, can they make beer tax free to even the score??","post_message":"'Basically we are being taxed for being women.'"},{"comment_id":"1204270932993102","commenter_b":"Ape woman","commenter_a":"never heard of him !!","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"780559568801287","commenter_b":"Get a Real Job Bitch!!","commenter_a":"on welfare??? guess how much those tattoos cost>>???","post_message":"Welfare Recipients In THIS State Just Received Some DEVASTATING News  It is unethical to leech off the hard work of others.  Are you fed up with welfare moochers?"},{"comment_id":"1016384461715898","commenter_b":"So stop your judgemental whining bitch","commenter_a":"Sorry mice, but as someone with crohns I fully support this research.","post_message":"Researchers have engineered small intestinal tissue from human cells, and when placed in mice, the transplants were able to digest and absorb like the real thing."},{"comment_id":"540837429437883","commenter_b":"They reap what they sow ! Don't allow them in your country. Deport the ones there .","commenter_a":"Lets not allow these problems with muslim REFUGEES in europe keep us from doing our duty for the safety of america. Our president asked that we turn in our guns so we really need to get moving and take care of that!","post_message":"COMING SOON in your city and town..."},{"comment_id":"583909811799598","commenter_b":"Go away ugly rumors nasty gossip ho away","commenter_a":"So do it already and quit saying you're going to.","post_message":"Obama was just caught red handed in a massive act of treason.  Throw him out of the white house already. He is a criminal?\\t  Would you be happy if Obama was impeached immediately?"}]
