[{"comment_id":"10153291171784203","commenter_b":"Jews and fat women.","commenter_a":"Yeah, bring back the jokes about Gays and Blacks.","post_message":"Why can we all grow up and just let comedians be comedians again?"},{"comment_id":"722398331226681","commenter_b":"Miley Cyrus is so gross. She's going to be a washed up disgusting old lady if she makes it that far.","commenter_a":"Who would believe anything that raunchy ugly thing says anyway ?","post_message":"Class act, that Cyrus!"},{"comment_id":"10156019875440354","commenter_b":"Then lets deport them when they cause trouble!","commenter_a":"Why not? So should Italian Americans.","post_message":"Say what?"},{"comment_id":"10154769907171509","commenter_b":"But but, the Internet thinks for us so we don't have to!","commenter_a":"People need to start doing a little research. If @username (the actor) was dead, it would be on every single news outlet. And @username's wife (Jada) is darker than Raquel (who is lighter) Sad I have to edit my comment because people are getting bent out of shape.","post_message":"Before he died, Will Smith was part of an 18-month Executive MBA program at the University of Miami. His wife, who was shot in the legs during the attack that killed her husband, received it in his honor."},{"comment_id":"10153181655947452","commenter_b":"Said the hipster wannabe as he hangs out at Starbucks thinking it improves his social status.","commenter_a":"Anybody who goes to Starbucks is an idiot. At Christmas or any other time of year.","post_message":"#MerryChristmasStarbucks: Starbucks' new design for its iconic red holiday cups has some customers feeling less than cheery, with one man saying the company \"removed Christmas from the cups because they hate Jesus.\""},{"comment_id":"10154169581782042","commenter_b":"@username dude are you serious?","commenter_a":"It will be shared with other waitress as a group in the restaurant where she most likely get $200 if there are 5 people working and 15 % to bar back #restaurantlife","post_message":"When an 18-year-old waitress saw a customer talking to her boss, she feared she had done something wrong. What happened next brought her to tears."},{"comment_id":"10156323895095354","commenter_b":"@username Your not aware of everything that went on or was said. I \"ASSUME\" he told her to GET UP and being Defiant and Arrogant she decided \"I'LL DO WHAT I WANT TO DO\" . She should have STOPPED what she was doing when she was TOLD TO. It was Harsh but perhaps the rest of the Class learned a Lesson. Crap like she pulled Disrupt a Class ands children that WANT to LEARN can't.","commenter_a":"Yes good for the cop, if you do not like this then do what your told to do by the cops.","post_message":"The FBI and DOJ have jumped in..."}]
