[{"comment_id":"10153776592904087","commenter_b":"Socialists always promote Violence. In Europe They promote Muslim Violence by being WEAK!","commenter_a":"Bernie is an enabler for the lazy self entitled youth of this country.","post_message":"'Party leaders in Nevada...claim that the Sanders campaign has a ‘penchant for violence.' That is nonsense,' Bernie Sanders said in a statement. 'Our campaign has held giant rallies all across this country, including in high-crime areas, and there have been zero reports of violence.'"},{"comment_id":"10155932451330206","commenter_b":"Don't you think it's time for a woman President!","commenter_a":"Did you catch her phony southern accent from that speech she gave? Just more proof that nothing about her is real.","post_message":"Are you ready to beat Hillary? Join the team that can win in 2016."},{"comment_id":"10153249048488352","commenter_b":"Pure evil heartless bitch","commenter_a":"The same thing should happen to her no doubt about it","post_message":"Texas woman, 26, found guilty of suffocating fiancé's two-year-old daughter to death using duct tape after he broke up with her"},{"comment_id":"10156567119170725","commenter_b":"U R A NUTJOB AND A #FRUITCAKEFORILLEGALCRUZ ! #MAKEAMERICAGREATAGAIN #DONALDJTRUMP 2016 #ONLYAMORETRUMPNATIONCANSURVIVE!","commenter_a":"The sycophant behavior of many Trump supporters is identical to Obama Libtards, complete with vile hatred of anyone who disagrees and scummy ethics based on Utopian promises. I am starting to think maybe Americans do need to surrender their liberty and let the government take care of them like little retarded babies. Iowa better prove me wrong","post_message":"Ted Cruz isn’t tough on immigration. He stood up for amnesty, not for Americans. President Trump will be the tough leader that America needs. #MakeAmericaGreatAgain"},{"comment_id":"1624197824544119","commenter_b":"During the debate season, Hillary Clinton will mop Donald Trump off of the floor and dump him into the sewer with the mop water because she is 20x smarter than he is. She went thru 12 hours of gruesome testimonies with congressional republicans and didn't even break a sweat and was able to squash all of them like cockroaches. On the other hand, Donald Trump choked during a 1 hour meeting with the Mexican President and he choked and sweated bullets while being interviewed by Faux News Megan Kelly.","commenter_a":"Jordan Elum","post_message":"#Repost Ivanka Trump #Instagram ••••••••••••••••••••••••• Smooches from baby Theodore. 😘 #Latergram"},{"comment_id":"10154312935051337","commenter_b":"All i can say is wow! I mean since Bran can use his powers to enter into a body does that mean he will eventually enter into the white walkers body an control him by pushing out what was put in now that would be awesome.","commenter_a":"That was by far the saddest moment of this show! Rip hodor/direwolf.","post_message":"OH. MY. GOD. Craziest Game of Thrones yet?"},{"comment_id":"762861520482540","commenter_b":"Your lady isnt going to win lol thats a joke","commenter_a":"Hmmm but notice how all places she wins have issues with the polls.. Shes a cheat and a fraud whos bought out..","post_message":"Bernie Sanders went just one for five on Tuesday, bagging only Rhode Island."}]
