[{"comment_id":"639543372893417","commenter_b":"As I said the jobs are what this is all about. Yet we continue to give unlimited tax breaks to these major corporations to stay here. Just look at all the money LOANED to GM that has never wholly been repaid and never will. Major corporations are \"pimping\" themselves out so WE the middle class can continue to pay for all their tax breaks. When our American companies relocate outside of our country they should be heavily taxed for importing there product here. Since they're paying these third world workers nothing anyway for once let's get into their profits.","commenter_a":"Oh well thank you is in order for saving those jobs. Too bad we the middle class have to make up for that $7m tax break you just gave them. What should have been done is let them leave and import their products back here and tax the crap out of them. Since they are going to pay some Mexican $2 hour. ONLY IN AMERICA!","post_message":"Trump's Carrier deal shows corporations they can: ✅ Threaten to outsource jobs ✅ Actually outsource jobs ✅ Still get a tax cut"},{"comment_id":"542298055958487","commenter_b":"That shouldn't come as a suprise.There is alot more where that came from. JAIL HILLARY 2016","commenter_a":"If this was only true. If she is arrested she should be put it with all the other criminals and NO special treatment","post_message":"She looks good in orange..."},{"comment_id":"486444454879468","commenter_b":"I can't stand her either..","commenter_a":"Yes I will always honor and support the Flag of the United States of America!!","post_message":"Michelle Obama just said something treasonous about the flag. This is ridiculous, that flag is the symbol of the greatest nation on Earth. Do you support the American Flag?"},{"comment_id":"1334924336529627","commenter_b":"@username that's great except sometimes the child is tricked by a family friend, a coach, a counselor, etc... people that don't appear to be creeps. I'd like to help children see the signs, know what type of lies these predators tell them, and know how to get help if it's a family member or someone else. Killing the perpetrators after the fact will do nothing for the victims. Especially this little girl... she's already dead","commenter_a":"When I was young and in school we had the D.A.R.E program, trying to educate youth about drugs and help us make good decisions not to do them. We need a program now to educate our children on sexual predators, how to watch out for them, to be aware of how they manipulate, etc and where they can call for help and a safe harbor. I would happily volunteer to speak at any school. We need to protect these children and let them know they are not alone and that where someone may have failed them, we will not.","post_message":"Awful"},{"comment_id":"10154471352991337","commenter_b":"Lil girl","commenter_a":"Bitch I hope one of these hoes are next on the hit list of dead cops fuck the police bitch and if u don't like fuck u too hoe come get some bitch ass nigga I'm waiting for w a big ass weapon nigga find out what it is","post_message":"What happens in this video is not ok."},{"comment_id":"10153763759623812","commenter_b":"Girl, shut up.","commenter_a":"Relax dad, she's not a teen, stupid and sad comment - life is about friends, why confuse a happy loving kid, who loves boys too as friends...","post_message":"This 2-year-old girl is crushed to hear that she can’t have a boyfriend, insists to her dad that she has someone special in her life. Her conviction is intense! @webpagelink"},{"comment_id":"10153562142188717","commenter_b":"Yes! Please leave!","commenter_a":"good for her .. Tah Tah","post_message":"Raven-Symone, co-host of \"The View,\" swore on the talk show that she will move to Canada \"if any Republican gets nominated\" for president."}]
