[{"comment_id":"555638054626774","commenter_b":"monkey bitch","commenter_a":"Seriously? Get a life! This is none of your concern....","post_message":"After this Obama staffer quit, he leaked something disturbing secret about Michelle. This is a joke. She needs to be kicked out of the White House. Do you agree Michelle Obama is a disgrace?"},{"comment_id":"560649254116954","commenter_b":"Lady you are just plain stupid.","commenter_a":"I want to see a Sanders-Trump debate. If you think Hillary would wipe the floor with Trump, Bernie would \"bern\" the floor with Trump! Either way, Trump is a Loser.","post_message":"Wonder what a Hillary Clinton/Donald Trump debate would look like? Take a look."},{"comment_id":"1675801449377863","commenter_b":"Better yet: Buh bye racist ahole!","commenter_a":"Buh bye, racist!","post_message":"Serves him right."},{"comment_id":"1745001682421383","commenter_b":"Just when I think I had seen stupid, I look at a news feed like this, and all you libtards take stupid to a whole new level. All you lazy Daisy's don't want Trump in because your welfare checks will go away, and a you illegals will be deported home to build that WALL!!!!","commenter_a":"Trump is hammering her, love it! All she can do is smile & laugh because she has nada","post_message":"\"I will release my tax returns – against my lawyer's wishes – when she releases her 33,000 emails that have been deleted.\" Donald J. Trump hit at Hillary Clinton's email issue in the first presidential debate. #Debates2016 @webpagelink"},{"comment_id":"10153633951734170","commenter_b":"They are undocumented aliens.","commenter_a":"I find the term \"undocumented immigrant\" offensive. The press should stop using it.","post_message":"Epic VIDEO. Trump slams the proverbial door on a reporter who warns him that the term \"Anchor Baby\" could hurt someone's widdle feewings."},{"comment_id":"644885305702048","commenter_b":"A treasonous bitch","commenter_a":"How long is it going to take to get them both out. Seems to be all talk. They should have been long gone.","post_message":"Michelle was just caught red handed and is about to be charged with treason. Good. It's about time she was exposed. Do you agree Michelle Obama does not belong in the White House?"},{"comment_id":"1377095295664272","commenter_b":"And she will WIN !","commenter_a":"killery is an ass...panders to any voter cause","post_message":"Clinton isn’t letting this bigotry go unnoticed."}]
