[{"comment_id":"10155254792200354","commenter_b":"Which college did she attend? Was a waste of money.","commenter_a":"We don't need Work Place Violence. They need OUT of U.S.","post_message":"She actually stands by her statement that ISIS terrorists just need...job opportunities. Watch the insane VIDEO below."},{"comment_id":"10153604606804024","commenter_b":"AFUCKINMEN ON THAT SHIT!","commenter_a":"OBAMA DOES NOT CARE---HE TREATS THE ENEMY BETTER THEN AMERICANS !!!!!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10153242003291636","commenter_b":"Who gives a s**t the programs shite anyway I have better things to do with my life than watch reality shows","commenter_a":"Hannah Daw not the reason you thought","post_message":"'I screwed up'"},{"comment_id":"1037656442936422","commenter_b":"@username , I agree .","commenter_a":"Absolutely! This is the first campaign I have been able to follow totally since I retired, and I am sickened by how words that I have heard myself are mis-quoted and lied about, mostly by the Democrats. The lies are really incredible to me. Do they think nobody is paying attention?","post_message":"Huckabee says the mainstream media is making sure Clinton is \"presented in the best light,\" and goes out of their way to make Trump look bad. Is he right?"},{"comment_id":"10153221007429575","commenter_b":"Lmao. Guess who isn't surprised. I just wish I was there. There'd be holes in some stupid flat brim hats.","commenter_a":"Where's Jackson? Where's Sharpton? Where's Eric Holder? Where's the NAACP? Where's the constant 24/7 national news coverage? Oh wait, the attackers were black and the victims were white? Well in that case, move along, no big deal, nothing to see here.","post_message":"\"Their children and grandchildren were running around while we were fighting and they don’t know what’s going on and there’s blood everywhere.\" A party at an Ohio Chuck E. Cheese's got out of control after the store manager told guests the photo booth wasn't working."},{"comment_id":"1023513341058227","commenter_b":"Go figure. A business in business to make money. She should know, she's the biggest criminal of them all.","commenter_a":"imagine that, a company in business to make money. You can't fix stupid, but you can vote it out of office, or in this case make sure it doesn't get into office.","post_message":"This is most likely the dumbest comment she has made to date..... so far."},{"comment_id":"10154352675806336","commenter_b":"Lets hope they nail her butt to the wall!!","commenter_a":"video of her saying she was shot at and then video that she was not shot still cannot convince these people she is a liar.","post_message":"Bret Baier: \"The State Department IG, though, wanted to talk to you and you didn’t want to do that.\" Hillary Clinton doubled down on claims that her personal email scandal will not hurt her presidential bid or result in an indictment. @webpagelink"}]
