[{"comment_id":"10153513260681770","commenter_b":"I have something to say to this wet back. Guess.","commenter_a":"Yeah I don't like him at all !","post_message":"George Lopez has something to say about Donald Trump."},{"comment_id":"10150909460504999","commenter_b":"Why won't they announce the legal charge? What a messed up legal system","commenter_a":"What r they charging her with?!","post_message":"Richard Ratcliffe's wife and daughter are being held by the government of Iran. He's in New York during the United Nations General Assembly in an attempt to confront the president of Iran. He shares his story here and answers your questions."},{"comment_id":"10153080670828721","commenter_b":"ITT: Idiots. Everywhere.","commenter_a":"No matter what does someone have something -ve to say","post_message":"ConnectHome is a pilot program through which Google and other Internet service providers will give free or low-cost Internet access to 275,000 homes in 27 cities across the country."},{"comment_id":"1187550147931680","commenter_b":"It is her job totally, but let's be fair, her job duties changed abruptly in June after SCOTUS ruled. That said, she should resign if she can't/won't carry out her duties and leave her religion out of the office. She can be as devout as she wants, but not on the taxpayer's dime. Those couples are paying her salary and deserve better","commenter_a":"If she don't want to issue gay marriage licenses she shouldn't have to...","post_message":"JUST IN: Kentucky clerk who refused marriage licenses for gay couples taken into custody @webpagelink"},{"comment_id":"1073692496071264","commenter_b":"She's a POS !!!!!","commenter_a":"hahaha love this dude","post_message":"'[Hillary Clinton] keeps saying that we need to move slowly on this. Someone give her a Red Bull, because the wolf is at the door – the wolf is chewing through the door.' – Sheriff David Clarke on fighting Islamic terror threat"},{"comment_id":"10154179753088645","commenter_b":"Girl bye!!!","commenter_a":"She should be offended, he was trying to hook up with another woman while she was pregnant with his kid and during his apology he never said sorry to his wife.","post_message":"does not represent the man that I know, she added."},{"comment_id":"902494896546891","commenter_b":"I told you I was going to get her out","commenter_a":"'@username she's a chunk! Pictures were a lie! 😁 She's out @username lol","post_message":"Our camera caught the middle school teacher who reportedly got pregnant during an affair with an 8th grader as she left the jail. We had questions, but she didn't have any answers. Full video: @webpagelink"}]
