[{"comment_id":"10153752322536523","commenter_b":"He sound dumb then a mfa","commenter_a":"#5 don't count on a police presence to deter being shot .","post_message":"Chief Flynn's four-point plan for not getting shot in Milwaukee is as follows, according to a statement from the Milwaukee Police Association:  1) Don't belong to a gang 2) Don't be a drug dealer 3) Don't carry an \"illegal\" gun 4) Assure you're not going up against someone that has a worse arrest record than yours"},{"comment_id":"10153000313242383","commenter_b":"you mean Haliburton? .. don't you think they got compensated enough?","commenter_a":"What about the contractors who did everything including making the ultimate sacrifice only to come home and be crapped on","post_message":"Interpreters who helped save Marines lives on the battlefield are fleeing to the U.S. with nothing  so one Marine is pushing to get them veterans benefits. @webpagelink"},{"comment_id":"10154243512856770","commenter_b":"We will send you more Muslims , you can send us the anti Muslims.","commenter_a":"I openly protest morons who throw homosexuals off buildings and burn people alive who don't bow before their god (may he eat pork)","post_message":"Police in Toronto, Ontario might charge a group of anti-Muslim protesters for violating hate crime laws."},{"comment_id":"1603960996557680","commenter_b":"Deport her","commenter_a":"Racist pig!","post_message":"Ridiculous...  Take Oprah Winfrey off TV right now."},{"comment_id":"1589013221321122","commenter_b":"Bring back War Crimes Donald! #MakeDonaldDrumpfAgain","commenter_a":"Mitt Romney was and still is a total lightweight! Time for a candidate who's the real deal! Time for Americans to play the TRUMP card!! Adios illegals!! #MakeAmericaGreatAgain #TrumpTrain","post_message":"WE WILL MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153700669189586","commenter_b":"I think you are an idiot. Zoos are bad conservation centres are good! You want to show your children animals in far too small spaces and teach them this is acceptable? Why don't we then put our toddlers in gages where we can keep better eye on them.","commenter_a":"That's totally insane! BAN ZOOS!","post_message":"The kids' faces say it all."},{"comment_id":"858343807629738","commenter_b":"Yes! Lock her up!!!","commenter_a":"She looks much better BEHIND BARS !!!!!!","post_message":"Trump Nominated - Christie Calls for Prosecution of Hillary: “Lock Her Up” @webpagelink"}]
