[{"comment_id":"927870117281087","commenter_b":"How many illegitame grandkids does it take to keep her quiet","commenter_a":"I'm with you Sarah","post_message":"Sarah Palin goes off on Obama to his face. What a woman. Let's show her our support. Can we get 10,000 'LIKES' for Sarah Palin's stand against Obama?"},{"comment_id":"918090094974937","commenter_b":"Unless you make over 12 million dollars a year then you'll probably get a big tax break and a yearly stimulus for being a small business","commenter_a":"I'm a proud Tennessee woman, I've never been disappointed in my beautiful state, today is the first. Trump is not for the people. #FeelTheBern","post_message":"Thank you Tennessee! #Trump2016 #SuperTuesday"},{"comment_id":"1145897778760904","commenter_b":"I have the same solution no matter the skin color......shot them, protect the population from killers.","commenter_a":"Throw him in a cell with a bunch of big angry sex offenders.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153809354827169","commenter_b":"Let's make a new list and start it with Tamir Rice.","commenter_a":"White people in America don't have Race Hustlers disguised as Christian Reverends telling the young men that they can't win in life because they're a victim, nor have Whites exalted bards who glorify violence against sex objects that once were loved as women, violence to police, and street crime. In short, White people are starved for heroes, but Black people have chosen villains for their heroes, and feed their souls on poison. And what people of any age can rise above their heroes?","post_message":"Four out of 10 African-Americans said they doubt the nation will ever achieve racial equality, but as many white Americans believe racial equality has been achieved, according to a national study released by the Pew Research Center (From PBS NewsHour)"},{"comment_id":"1715971748670504","commenter_b":"'@username is not clearly thinking. What the soldiers need and what is spent, often wastefully, through our War budget are two separate things.","commenter_a":"Increase. I bet everyone saying to decrease posts those names on veterans day saying how you support the military. Obama cut meals for troops in a war zone. SMH","post_message":"U.S. Military Size: Increase, Decrease or Stay the Same?"},{"comment_id":"1208908179197618","commenter_b":"Who do any of these 'woman' think they are? The show SUX Whoopie go eat another side of beef!!!!","commenter_a":"They are both empty headed idiots!","post_message":"Loud mouth Whoopi and her co-hosts are making serious unfounded accusations and demanding Trump step down.  Let's get 5,000 'SHARES' & 'LIKES' to show that Whoopi is the one that America wants to see 'STEP DOWN!!!'  @webpagelink"},{"comment_id":"992416424184745","commenter_b":"Well I know it wasn't a baseball stadium or shopping mall","commenter_a":"Remember that first moron who said 'maybe, just maybe the earth is round'? Unless there's a time machine, people can have their own thought who built the pyramids in what year, and for what purpose.... My theory was that aliens or time travelers built them as some sort of energy source....","post_message":"Wow.. and he's supposed to the SMART Republican? Reality check: the EGYPTIANS -- not the Jews -- decided to build the pyramids for the pharaoh's graves -- NOT to store grain!  “My own personal theory is that Joseph built the pyramids to store grain,” Carson said. “Now all the archeologists think that they were made for the pharaohs’ graves. But, you know, it would have to be something awfully big if you stop and think about it. And I don’t think it’d just disappear over the course of time to store that much grain. And when you look at the way that the pyramids are made, with many chambers that are hermetically sealed, they’d have to be that way for a reason.”  Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"}]
