[{"comment_id":"10153835379166336","commenter_b":"Cause white people suck","commenter_a":"That door was racist against white people! Ban all cruise ships and doors.","post_message":"A jury has awarded a man $21.5 million in damages after he was hit by a sliding door on a cruise ship.   MORE: @webpagelink"},{"comment_id":"10155001030118908","commenter_b":"Angie ???","commenter_a":"Simon","post_message":"Science says practicing mindfulness exercises increases gray-matter density in the hippocampus!"},{"comment_id":"10153318704229614","commenter_b":"This is why women live longer than men..","commenter_a":"The stupidity is strong with this one","post_message":"A shirtless man got himself into quite a predicament after climbing up a basketball hoop in Seattle and somehow managing to get stuck upside down.   Hanging by a foot, the man flailed and thrashed about while officers tried to figure out how to get him down.    Eventually, a couple of firefighters came in with a ladder, cut the net down and rescued him.   'He may be arrested for property destruction, or at least goal-tending,' the Seattle Police Department tweeted on Friday.   Read KTLA's story here: @webpagelink"},{"comment_id":"1077509702340944","commenter_b":"She's a vulture.","commenter_a":"She is disgracing American's right to vote. She is labeling anyone who is not a Democrat. In other words we are 'basket cases'! It's one thing to bash Trump, quite another to degrade voters.","post_message":"Hillary Clinton is taking heat for saying 'you could put half of Trump’s supporters into what I call the ‘basket of deplorables’. Right? The racist, sexist, homophobic, xenophobic, Islamaphobic — you name it.' What do you think?"},{"comment_id":"10155598100226002","commenter_b":"Something white people started, after having intercourse with monkeys they would die from AIDS. Mosquitos was a bacteria form from their deceased corpes.","commenter_a":"Hmmmn,what's the next thing that will be killing us...SLEEP???????Always fear mongering and hysteria..","post_message":"Known to health experts as the most deadly animal on the planet, the minuscule mosquito, with its dreaded whine, is responsible for millions of deaths from multiple diseases each year."},{"comment_id":"480862922104288","commenter_b":"Let them go swim in there on country. We dont need them polluteing our pools.All that goat hair will mess the pool up.You want be able to drain it.","commenter_a":"Send these people packing","post_message":"A judge just ruled that public pools must allow Muslims to swim in 'Burkinis'.  We're tired of Muslims infiltrating our country. This stops now.  Do you agree that 'Burkinis' are WRONG?"},{"comment_id":"10155025843208734","commenter_b":"Oh I remember lol","commenter_a":"Thats Ari Moran! I know him! Great officer!!!","post_message":"We're live in studios with Fairfax County Police Department's new bloodhound, Juneau! 😍❤️🐶"}]
