[{"comment_id":"1387475997939242","commenter_b":"It's probably a welsh lamb that's fucking had enough of being raped 😂","commenter_a":"Fucking ouch!!!!","post_message":"And you thought you were having a bad day... via JukinVideo"},{"comment_id":"1017537058301696","commenter_b":"Black men are so screwed up, they are concerned about equal pay for women, pro-choice, illegal immigrants, grass, ducks and horses! Anything that has nothing to do with black men, a black man is concerned about. You idiots are going to be sorry, when all the immigrants are employed and NONE of you English-only speaking Negroes gets nothing. #BlackMen4Trump2016","commenter_a":"Maybe it was sarcasm. Idk... I need more rum...","post_message":"Wondering why Nation of Islam leader Louis Farrakhan said this about Donald Trump? ---> @webpagelink"},{"comment_id":"10157063927485725","commenter_b":"#ByeByeCrookedHillary","commenter_a":"Wipe terrorism off the map...so many countries suffering...and who knows...without TRUMP we WILL be next...TRUMP 2016","post_message":"Thank you Lt. Steven Rogers. We will respond to terrorism with strength in 2017!"},{"comment_id":"951958574839238","commenter_b":"These fuckin nazi like pigs make me sick my family came running from this 50 years later now look what the fuck is goin on the fourth reich vultures of america be killing our most loyal friends. Howcome We cant hurt their fukin dogs but they can jus come blast ours away word is bond kill my dogs look the fuck out","commenter_a":"Yanky fuckin cops","post_message":"This video is one of the most cowardly acts you will ever see. The poor dog was scared, ran and hid behind a table, and then was executed by a coward with a badge. The Free Thought Project.com (Y)"},{"comment_id":"1284368551656196","commenter_b":"It is true that staying home and taking care of the kids is cheaper but also if both parents are working to meet their needs then they can apply for daycare help to cover daycare instead of staying home and collect food stamps and cash from the government.. I'm a single mother and I was working full time and couldn't afford daycare or a full-time nanny and I did went to get help and they cover the daycare or babysitter cost...some people work half on the books and half off the books just so they can collect government help I see it every day...","commenter_a":"Is taking care of several under school age children not a full time job That mothers are not getting paid for. What should they do . For food .","post_message":"EXACTLY!"},{"comment_id":"837415593047972","commenter_b":"what a lying hag she associates herself above everyone no matter color!!!!!!!","commenter_a":"Excuse me, is Hillary Clinton talking about humility ? - What a joke !","post_message":"Give me a break!"},{"comment_id":"10153824341126955","commenter_b":"Who has a billion dollars for this nonsense? That obscene wealth needs to be redistributed!","commenter_a":"Sure it Berns now but it will itch latter.","post_message":"HILARIOUS"}]
