[{"comment_id":"10153177685071800","commenter_b":"Lol all these super women who, according to themselves, work so much harder.... Men work more hours, more dangerous jobs. Statistics are a bitch. The pay gap is a myth. Plain, simple. Even a feminist can see it. But yall keep pretending. Keep that victim thing going.","commenter_a":"People. It takes literally five minutes or less to find a credible publication explaining exactly what the wage gap is, and it really isn't anything in fact. It's just kind of inherently flawed, it is NOT based on men / women doing the same work but rather every man's wage and every woman's wage for EVERY FULL TIME JOB PERIOD, from waitress to business executive. It doesn't mean men are paid more automatically for being men, it just means men are generally getting the higher paying jobs (which there are legitimate sociological reasons for), OR men are more willing to do dirty / dangerous jobs that women are generally unwilling to do. So assuming of ten... Oh I don't know, sewer workers making 20 dollars an hour , eight are men and two are women, and of ten store clerks making 13 dollars an hour , eight are women and ...","post_message":"Jon: You're telling me we're going to print a human heart out of a Xerox machine before women get pay equality? Kristen Schaal: I'm telling you we're going to print human hearts out of Xerox machines 30 years before women get pay equality!    ► Jon and Kristen Schaal discuss the gender pay gap: @webpagelink"},{"comment_id":"10153309653924614","commenter_b":"She doesn't love him if she's trying to take off his mask","commenter_a":"About time.","post_message":"A Baltimore mother is being praised after cameras captured her berating and smacking her son after reportedly seeing him throw rocks at police during the city violent protests.   wish I had more parents that took charge of their kids out there tonight, the police commissioner said.   Nearly 200 people were arrested on Monday after more than 140 vehicles were set on fire and at least 15 police officers were injured during the protests.   Read KTLA story here: @webpagelink"},{"comment_id":"10154602642789062","commenter_b":"They need to close all of them they are evil an come from tha devil","commenter_a":"I hate Walmart.","post_message":"Wal-Mart is closing 269 stores, more than half of them in the U.S. - YOUR THOUGHTS?  UPDATE: 2 Houston stores closing -> @webpagelink"},{"comment_id":"417366948387900","commenter_b":"Hey rhino you want amnesty, and the DOJ candidate Obama and Holder want , your one of five republicans and who would negotiate with a terrorist country ? In sorry you won the election here in SC , your a R HINO ,","commenter_a":"Good point ...........we should be negotiating with Iran!","post_message":"Lindsey Graham has some harsh words for Rand Paul."},{"comment_id":"10153261650152507","commenter_b":"Not enough! We need more dogs killer their dumbass, redneck, gun-loving owners. Arm Fido!","commenter_a":"It's not guns that are the problem, it's the dogs!! So don't regulate guns, regulate dogs.....er, wait.....don't regulate dogs right to guns, because guns don't kill people, dogs do.....wait, that's not what I meant.......oh what the hell do I mean?","post_message":"This is just awful."},{"comment_id":"10153395040141336","commenter_b":"Because she and her mother are bible thumping morality pushing hypocrites. That's why.","commenter_a":"Why is it Bristol Palin gets pregnant and the liberals trash her, YET are proud of all the welfare momma's who have a half dozen kids, with several different donor dads, at the taxpayers expense? Bristol supports herself.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child.  “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"1136953183031095","commenter_b":"I can guarentee she will have a fitness dvd out soon, watch this space. All these reality stars have horrible pics taken of them on the beach then get fit n do dvdds xx","commenter_a":"A well cut swimsuit would be far more flattering, although not much one can do with cellulite - ugh.","post_message":"The Only Way is Essex star soaking up those wintry rays ☀"}]
