[{"comment_id":"1487251671334957","commenter_b":"That bitch could stick her face in dough and make gorilla cookies !!","commenter_a":"No matter what she wears it looks like it came off the rack at Walmart and she looks like aunt Esther. The only problem is us taxpayers are paying the big bucks for her to look like a curtain hanging over a big black window","post_message":"I'm SICK of my hard-earned tax dollars funding their lavish lifestyles!"},{"comment_id":"10154883066819411","commenter_b":"They don't care about children being blown to bits as long as they can let trans use women's toilets and have gay marriage","commenter_a":"They are so fukn stupid. Clinton will plunge this world into war and then run for the nearest bunker.","post_message":""},{"comment_id":"538992992891961","commenter_b":"Girls are just mean....need to face murder charges....they need the death penalty....need to be tried as adults","commenter_a":"They should all get life","post_message":"Three high school girls in Delaware are facing criminal charges over the fatal beating of a classmate inside a school bathroom last month. What could have caused them to do this?"},{"comment_id":"1260055474038645","commenter_b":"Wonder who will pay her and the teachers salaries, and provide security and law enforcement if all the \"white people\" leave","commenter_a":"Have you seen it ? They can have it.","post_message":"Chicago Teachers Union Karen Lewis This City belongs” To Black People And Not White People."},{"comment_id":"1457021290993798","commenter_b":"Bullshit they need to put her ass in prison","commenter_a":"jesse doesn't want her next to him at the gallows","post_message":"But, but...I thought she was innocent, Jesse?"},{"comment_id":"1801495493414518","commenter_b":"your witch is going to fry","commenter_a":"Can Trump even go to the bathroom without retracting or sending a \"revised\" tweet after his handlers yelled at him? Losing votes every day he is! Such a dope.... A con and dope. Sad.. As at one time I liked the guy???","post_message":"Donald J. Trump received swift backlash for tweeting about the fatal shooting of NBA star Dwyane Wade's cousin and writing, \"African-Americans will VOTE TRUMP!\""},{"comment_id":"1068539523183857","commenter_b":"How can you support Hillary she lier and a crook! Trump trying to make a better America for all Americans. Hillary trying to make a better America for Hillary.","commenter_a":"Another libertard","post_message":"Actress Rosie Perez: “I really, honestly, want to understand how can you support someone who said such racist comments, who said such hateful comments,”"}]
