[{"comment_id":"876171829182663","commenter_b":"Moderate moslems DO NOT exist!","commenter_a":"YEP, They are ALL extremists, and should ALL be deported! Its simple!","post_message":"I'm not joking when I say this is the most important video I will ever share..."},{"comment_id":"10152769636891636","commenter_b":"One day women will be in charge of everything ! Roll on","commenter_a":"Girl power!","post_message":"Last night, women took back politics from the boys' club..."},{"comment_id":"10156684390715354","commenter_b":"Pussy.","commenter_a":"Yikes...say goodbye to England","post_message":"Prime Minister David Cameron announced: “I want London to stand alongside Dubai and Kuala Lumpur as one of the great capitals of Islamic finance anywhere in the world.”"},{"comment_id":"10153097133433271","commenter_b":"Better relocate. .. drunks and moosee don't mix well..... drunk will loose","commenter_a":"'@username this would've been amazing:)","post_message":"A young female moose wandered into downtown Boulder Sunday night, strolling down the Pearl Street Mall. On the advice of a state wildlife officer, police fired some bean-bag rounds at the moose's backside and eventually shooed it away from the populated area.  More details: @webpagelink"},{"comment_id":"729100880559027","commenter_b":"Damn right! Put that bitch in office and watch what 'We the people' do!","commenter_a":"If Hillary wins, it will be because the electoral college was bought out!! The government has already bought the media and they are lying about the margin between Trump and Hillary---Trump is way ahead. The American people are fed up!","post_message":"“I am winning. I am beating everybody and, in my opinion, beating Hillary is easier than beating [my Republican adversaries],' GOP front-runner Donald J. Trump said."},{"comment_id":"10153127568784877","commenter_b":"This whole story interests me lol. This lady clearly has some issues, as u said. Smh","commenter_a":"They couldn't tell she is white? We need to be questioning the people who voted her in more than her!!!","post_message":"Rachel Dolezal gave lectures on ‘nappiness’ and ‘the brown paper bag test’, once told student she didn’t look ‘Hispanic enough.’ People from her past are coming out of the woodwork!   Grio fam, do you think the claims that Dolezal is a hypocrite are valid?"},{"comment_id":"10154018390388984","commenter_b":"they need to stop her for good","commenter_a":"YES","post_message":"Wow, things just keep getting worse and worse for Hillary Clinton. I wonder if she saw this one coming...  Do you hope Hillary gets defeated?"}]
