[{"comment_id":"10156359711135354","commenter_b":"Take the fuckin niggers too.","commenter_a":"Yeah screw Obama and the Obama does not care health insurance bull crap. He can get the hell out of America and take his illegals, criminals and Muslims with him.","post_message":"“We’re going to be aggressive…”"},{"comment_id":"10153143993045329","commenter_b":"That poor girl would eat both of you.","commenter_a":"@username @username Gerard Bravo 'Plus size' is where it's at.","post_message":""},{"comment_id":"1802126320030739","commenter_b":"I still say his daughter should be charged with inciting a riot! All damages, and the protester that was killed. I still think she was doing all of this to get a paycheck from the city. No difference between her and Browns momma in Ferguson Missouri. Remember her jumping up and down on somebody's car screaming \"Burn this mother*ucker down\" referring to the city! Was she charged? Hell no, I still wonder if she got paid ? Bitch should have been buried under the jail.","commenter_a":"Ah, more clickbait. Headline: Dash Cam Footage Released. Story: Police are not releasing the dash camera footage because..... Gotta love the manipulative lies in these article headlines that these sites put out just so they can get paid per click to the site.","post_message":"Riots have critically wounded one already and now it's proven he had a gun, not a book..."},{"comment_id":"10153442848704474","commenter_b":"She gives women a bad name.","commenter_a":"Bah bye! Don't let the door hit ya where the good Lord split ya! JUST LEAVE!","post_message":"REPORT: House Democrats ready for Pelosi to retire. Where do you stand?"},{"comment_id":"10153646970166336","commenter_b":"She'd be worse than that in the role of President!","commenter_a":"She jeopardized National security!! The idiot!!","post_message":"Hillary Clinton said in an interview Friday that she’s “sorry” her use of a personal email for State Department business has “been confusing to people,” but didn’t offer an outright apology for her actions."},{"comment_id":"710829429070596","commenter_b":"That a girl","commenter_a":"That's all you got NBC? IF that is even true, it pales in comparison to the lies and scandals of the Clinton's. Both candidates are far from perfect but I'm going with the one who doesn't support the butchering of full-term babies, who doesn't support millions of immigrants being granted citizenship, who is in favor of term limits and ending special interest groups in DC, who will create jobs through trade reform rather than the government creating yet another program and who will reform the health care system and end Obamacare, which, in case you haven't checked, your policy is going up by 25% next year, who supports our military and vets and our police officers and supports the NRA and my second amendment rights and the list goes on and on. If the truth were ever told by the media, this would be no contest.","post_message":"Federal agencies are barred by law from endorsing candidates in political elections"},{"comment_id":"10157413216720594","commenter_b":"Mom's instinct to protect their young.. Right or wrong.","commenter_a":"I say let the son alone and send his parents to jail for a long time for raising and protecting a rapist son. Whatever this parents are doing is making their son believe he did not do anything wrong.","post_message":"It makes a powerful statement about a parent's will to stand by a child who is morally culpable and has committed a crime."}]
