[{"comment_id":"10153465142866037","commenter_b":"Regina just stfu. Idc","commenter_a":"who cares. its their country their rules. i dont see why people like to police other countries because they find their practices to be disgusting. no different than people consuming pigs, goats, cows and chicken. don like it? donate other possible food sources then. if not stfu","post_message":"\"There are all sorts of cultural norms about what you can eat; you eat turkey, so why are you trying to force us to not eat dog meat?\""},{"comment_id":"10156217952900725","commenter_b":"Illegals only make it harder for the ones who have done it legal. If I were a legal immagrant I would u of be pissed off about the illegals. It's not an easy process and considering the economy I'm wondering if it's worth it to them to try to come in legally. Especially with the liberals making all these empty promises.","commenter_a":"Like if you are voting trump 2016!!","post_message":"The debate last night proved that Hillary is running against the “B” team. She won’t be so lucky when it comes to me!"},{"comment_id":"894713893918640","commenter_b":"They are teaching the future illegal aliens how to unionize for maximum benefits. What a COUNTRY!!!!","commenter_a":"VERY WRONG!!!","post_message":"The IRS commissioner says that even illegal aliens who don't pay taxes could receive tax refunds with Obama’s executive amnesty!"},{"comment_id":"1117284038339327","commenter_b":"Please don't. Why would she want to shame herself in this way?","commenter_a":"will the sausage be halal free?","post_message":"Cue mass exodus from the city centre."},{"comment_id":"10154102342209607","commenter_b":"Melania trump was a model","commenter_a":"And my question is why do we care? We elected a man with no political experience and our soon to be First Lady have nude pics floating around on the internet....I mean at this point does it matter if his family moves in? Everything about this is...unconventional lol.","post_message":"QUESTION OF THE DAY Do you think Melania and Barron Trump should move into the White House in January? Tell us your thoughts and they may appear live on Fox45 Morning News."},{"comment_id":"10153242088138132","commenter_b":"Pretty sure you have to have virgin hair","commenter_a":"Well I just got my hair colored and cut. I'm sure it will be on the front page by Monday. Hehe","post_message":"Love it or leave it?"},{"comment_id":"10153095051856770","commenter_b":"\"please everyone\" stop paying attention to the talking pig.","commenter_a":"AMY you need to get out of your dad's shadow. He's an idiot. Just look at the death rate in every city the has very strick gun laws. If we did not count them in death by guns the United States would have the lowest death by fire arms than any other nation.","post_message":"Amy Schumer continues to advocate for stricter gun laws after a man opened fire and killed two people during a July screening of her movie “Trainwreck.”"}]
