[{"comment_id":"10153727550292300","commenter_b":"Go naked girl! Again and again!","commenter_a":"South beach is super ghetto now.","post_message":"In video taken by witnesses and posted on a website where it went viral, Angelic Valle is completely naked when she “placed a steel chair leg into her buttocks,” according to the police report."},{"comment_id":"10153929399138598","commenter_b":"she does NOT belong in prison","commenter_a":"You pig","post_message":"Woman Who Killed Her 25-Week-Old Unborn Baby and Threw Him in Dumpster Appeals Conviction"},{"comment_id":"10153531348054740","commenter_b":"I agree you shouldnt have to justify.","commenter_a":"It is sad that so many don't know the difference between real life and tv.....","post_message":"Here's why cops don't 'shoot to injure':"},{"comment_id":"10154251408229726","commenter_b":"Shave her head and tar and feather her!","commenter_a":"You gotta love how this whole event has been mis characterized by the libs. If you can afford the home-- mortgage it shouldn't matter what the value may rise or drop to. The libs set people up to fail by simply forcing lenders to lend. Then you have an angry hypocrite like this creep ignore facts just to throw a dart. One day these stupid politicians are going to realize they are helping Trump.","post_message":"Massachusetts senator blasts businessman for making money, but she omits her own house-flipping past."},{"comment_id":"489966784527235","commenter_b":"Fuck em and feed em pork","commenter_a":"Yes.","post_message":"Radical Muslim group CAIR orders that Obama exempts them of this.  They are dangerous, and so is our president.  Do you agree that Obama is a threat to the United States?"},{"comment_id":"1668611910083188","commenter_b":"She ain't done nothing I wouldn't have done. I do not think any red blooded American should have to put up with this nonsense!!","commenter_a":"Stacey said what we all think, good for her.","post_message":"Stacey Dash has been suspended by Fox News for saying this to Obama. She needs our support. Should Stacey Dash be reinstated?"},{"comment_id":"1389869284386873","commenter_b":"Nothing, absolutely nothing. Vote them all out, they deserve to be jobless.","commenter_a":"They took a lot of time off, which means they weren't doing even more stupid hurtful stuff.","post_message":"We'll wait.  Like Addicting Info for more great content!"}]
