[{"comment_id":"10152868852711336","commenter_b":"I approve. What else should we call them? They are illegals.","commenter_a":"Americans should be able to freely shoot border jumpers no questions asked in protection of our country!","post_message":"A California newspaper will continue to use the term \"illegals\" to describe people who enter the U.S. without permission, despite an attack on its building by vandals believed to object to the term."},{"comment_id":"10153464723413734","commenter_b":"Take that child away from these monsters! Do NOT allow him back in that \"home\"!","commenter_a":"That's the kind of monster that deserves the death penalty.","post_message":"#BREAKING news out of Maryland.  The mom's boyfriend has reportedly been charged.  More details as they become available."},{"comment_id":"1593183134313238","commenter_b":"Lol, not true bitchhhhh.","commenter_a":"Jensen Beale","post_message":"\"5 minutes\" "},{"comment_id":"10157095473970206","commenter_b":"Because she's a lying scumbag","commenter_a":"GOP IGNORES CARLY FIORINA - WHY?","post_message":"The professional political class says whatever they need to do to win and then does whatever they please. We need to return to citizen government. Stand with me. Fight with me. Vote for me."},{"comment_id":"10156393524070389","commenter_b":"Isis , of course,climate change is a myth! It gives obama something to talk about beside the real problem, his muslim brothers.","commenter_a":"Odummy is the Threat!!!!!!!!!!","post_message":"Question of the Day: Which do you think is a bigger threat: Climate change or ISIS?"},{"comment_id":"10154436669806509","commenter_b":"Hillary is a lying hag. #feelthebern","commenter_a":"Hillary Clinton is a chameleon. She changes her beliefs faster than I change socks. She's a liar and we all know it. The only supporters she has are middle-aged feminists.","post_message":"Can Hillary Clinton assure voters that, as president, she would not expand U.S. military involvement abroad?   Live updates from #DemTownHall: @webpagelink"},{"comment_id":"10153132641871051","commenter_b":"Wow marla racist much? What else can we minorities thank you whites for?","commenter_a":"REMOVE YOUR HEAD DRESS!!!!!I!!!YOU'RE IN MY COUNTRY NOW HABIBA!!!!!!❤","post_message":"The police told this woman: take off your head scarf or you’ll be sorry. She didn’t take it off."}]
