[{"comment_id":"848560338575181","commenter_b":"BUILD THE WALL","commenter_a":"and this comes as a shock to no one.......ban them.","post_message":"Reports say #ISIS now has a passport machine to have its believers infiltrate our country. I told you so! We need to protect our homeland - and make it safe for all citizens. We need leadership! #Trump2016"},{"comment_id":"10153557014143984","commenter_b":"To the Ignorant person that said I must be an illegal immigrant you just showed you how ignorant you are. I'm an American. A REALISTIC AMERICAN!!!!! I agree with the person that mentioned the abuse of the welfare system, but those are Americans doing that. Illegal immigrants can't get benefits!!! To the person who said that the companies are putting money in their pockets I agree, but as soon as they have to pay minimum wage and provide benefits and go legit the cost will be passed onto the consumer it always does. To the person that mentioned Hispanic, Mexican etc. I never mentioned any group of people I made a general comment about all immigrants. You just showed how stupid you are that just because I mentioned working in Orange fields you automatically stereotype I was talking about Spanish people. Here's a little info for you not only Spanish ...","commenter_a":"This country was built by immigrants both legal and illegal. Im tired of hearing people complain about illegal immigrants!!! Who the hell do you think are working the lowest paying jobs that without them this country would not function. Will any of you go clean toilets for 6 dollars an hour (that's if they can get that much). NO!!! Would any of you go to the orange fields and go pick oranges for hours in over 98 plus degree weather for pennies a bag. HELL NO!!! But you like when you don't have to pay an arm and a leg for orange juice. If there were to be no illegal immigrants the costs of a lot of things people enjoy would sky rocket because the company would have to pay out more for employees passing the increase on to the consumer!!!!!! Everyone needs to back off immigrants because unless your ...","post_message":"There have been many to come out against Trump after his comments on illegal immigration, but one beloved politician just did exactly the opposite.   Do you support this Republican for taking a stand for Donald Trump?"},{"comment_id":"10152780915443124","commenter_b":"the person who insists on letting everyone know their phone conversation in a public place #AmazonGiveaway","commenter_a":"The GravyMaster","post_message":"Add a name to the  and live like  by entering the Amazon.com  Blacklist Villain Sweepstakes for a chance to win a trip for you and a guest to NYC including airfare, hotel accommodations, and more. To enter for a chance to win, respond to this post in the comments below with one sentence or less naming your own The Blacklist villain (please include #AmazonGiveaway in your comments). @webpagelink  Don forget to watch  Blacklist, available on Blu-ray, DVD, and Amazon Instant Video US. @webpagelink  Ends 2/2/2015 at 11:59 PDT. We will reply to the winner's randomly selected comment with instructions on how to claim the prize. NO PURCHASE NECESSARY. See Official Rules: @webpagelink"},{"comment_id":"10152931610594270","commenter_b":"He has to be doing this just to make me look like a saint.","commenter_a":"West Point grad and comissioned Officer - apology not good enough. Gotta go. If he could ly about something as serious as Valor what else can he lie about?","post_message":""},{"comment_id":"1311800738876452","commenter_b":"IN YOUR DREAMS !!! #DontBoo #VoteHillary #NastyWomenVote","commenter_a":"Trump will become the next President. I'm saying this because I analysed their horoscope from an astrological point of view.","post_message":"Don’t miss out! Join them: hillaryclinton.com/makeaplan"},{"comment_id":"1724919811095083","commenter_b":"^^ for a woman that's a very clever reply","commenter_a":"I think a more interesting question would be, will women cycle differently on other planets? I'm no scientitian, but it seems to me it's a helluva coincidence (that we take for granted) that the female menstrual cycle is in line with the lunar cycle. Our bodies are 2/3rds water and the moon controls the tides. Am I talking out my ass if I suggest maybe the moon can can influence the fluids in our bodies? So on a dfferent planet, with different moons (and presumably after having been there for several generations), would women cycle differently?","post_message":""},{"comment_id":"10154786679373984","commenter_b":"What a shame that this ladies after so many many years will fall for Hillary's BS and the press that are now panicking cause things are getting worse to them and the campaign. Keep wondering how much money is floating around to pay all this people that suddenly have brought this stories and this will continue until Election Day, desperation is the mother of FU. \"GO TRUMP \"","commenter_a":"There is no one that is for Trump that is going to believe this. If it was true theses (ladies) would have spoken up sooner, so you see you people are not talking to morans as you think.","post_message":"Michele Bachmann has gone on national radio and revealed what happened to her when Donald J. Trump hosted her for breakfast -- alone -- in his penthouse.  Every American needs to hear her story. It says a LOT about Trump..."}]
