[{"comment_id":"859144567515130","commenter_b":"I did walk in the shoes of a LEGAL immigrant. We get that money gets you here either way legal or illegal. But when you lack respect for laws you come here illegally when you respect them you come here legally. Trust me I get the escaping from violence and your family is in danger side of it. There are avenues if that is the case in these days for emergency immigration if you fit the criteria.","commenter_a":"Si se puede! We are all immigrants and thats what makes up the USA !","post_message":"\"We love this country. We want to belong. We want to come right with the law...we don't like living in fear. We want to be out of the shadows.\" -Gaby Pacheco, DREAMer"},{"comment_id":"10153446783647293","commenter_b":"-cough- There are already Muslims in America. -cough-","commenter_a":"Trump for President No muslims in America","post_message":"Donald Trump has his campaign rally groove — poll numbers, protesters, Putin, and of course, making America great again."},{"comment_id":"699124226887425","commenter_b":"Bitch","commenter_a":"Show me your certificate proving you are a qualified dietitian. No? Then leave our children's lunches alone.","post_message":"Michelle has sunk to a new low...[READ BELOW]"},{"comment_id":"863220680381940","commenter_b":"She looks like a he in drag","commenter_a":"If I have to hear one more time how beautiful and glamorous our First Lady is, I'm gonna take a hostage....not that she couldn't be attractive, but her personality pretty much ruins it.....","post_message":"“Michelle Obama looks like she’s part of the cast of...\""},{"comment_id":"10154539572188433","commenter_b":"@username ignores taped audio/video proof if it exposes negative info about Killary!","commenter_a":"I don't understand how Drumpf can stand up in front of the American people and continue spewing his blatant lies. He should know that he can't get away with it. If he doesn't, he's no more intelligent than his dumb deplorable supporters.","post_message":"In an attempt to defend his recently linked offensive comments, Trump claimed Clinton laughed at a 12-year-old rape victim. False. @webpagelink"},{"comment_id":"10153876230626130","commenter_b":"Of reported rapes (is estimated that nearly 60% of rapes are unreported), the percentage of false claims is the same as any other crime, which varies from about 2-8%. Rape culture is automatically assuming the victim is lying when it's statistically unlikely, so congrats, you are part of the problem.","commenter_a":"There are no evidence supporting an existence of \"rape culture\". There are rapes. Go to the police. But there are also plenty of lies and no facts aqusation of rape by some women","post_message":"Keep speaking up, Nadia."},{"comment_id":"10154017509764156","commenter_b":"I will keep you in my prayers, Eva. You'll need them.","commenter_a":"California has extremely strict gun laws! Many in violation of Supreme Court orders! Blame the terrorists that did this, not the gun laws! It's obvious no one other than the murderers had a weapon or this would have ended much sooner, with less tragedy!","post_message":"There are no words that can come close to describing the horror of today’s attack in San Bernardino and my heart goes out to the victims and their families. Our only response must be to take immediate action to stop tomorrow’s mass shooting by addressing the gun violence epidemic. Period."}]
