[{"comment_id":"1158864987513588","commenter_b":"\"You're the problem\" lol sound like a bitch","commenter_a":"You guys missed the full story here. See what happened was the person who served the food dropped them exact three fries on the floor, that lady was actually being a good Samaritan and helping the cop and taking the dirty fries away for him so he did not get sick. Long story short don't do anything nice for cops because they are assholes and will do everything they can to abuse their power and fuck over the average civilian. I made all of this up of course but all of us know never even talk to a cop unless you absolutely have to because they are just looking for a opportunity to arrest anyone because they are bored. She should have just waited for her own fries. Stupid decisions get stupid results.","post_message":"A woman was arrested in Northwest D.C. for stealing three French fries from a police officer who was dining at a U Street eatery. #WSHH"},{"comment_id":"10153090581796749","commenter_b":"Go fack your mam","commenter_a":"Fack you","post_message":"This is no longer a problem to leave for the next generation to fix. We have to act now."},{"comment_id":"10155076076173987","commenter_b":"You do realize refugees are the ones fleeing the terrorists right?","commenter_a":"Well, Starbucks, you give 10,000 refugees easy access to kill 10,000 veterans. Yeah, great plan.","post_message":"“To those who would suggest Starbucks is not committed to hiring veterans, we are here to say: check your facts,\" the Starbucks Armed Forces Network wrote in a letter to customers."},{"comment_id":"10152885514044342","commenter_b":"Ain't that the truth. These hoes need to held ACCOUNTABLE!!","commenter_a":"It's always a mental thing.. Always an excuse...","post_message":"MOTHER CHARGED: A 23-year-old mother has now been charged in a brutal attack on her 4-year-old son that left deputies responding to the scene shaken and disturbed --> @webpagelink"},{"comment_id":"1380514481968578","commenter_b":"You're way too late. It's all Hillary now #imwithher","commenter_a":"If you live in a state that has yet to hold a primary, join with Sanders and stop both Hillary and Trump. #nevertrump #neverhillary","post_message":"Ohio Gov. John Kasich will suspend his presidential campaign on Wednesday, a senior campaign adviser tells NBC News."},{"comment_id":"10153754425932431","commenter_b":"Americans are so evil they kill 99% of us and steal our land and then when we stand up to them, they say hey you better kiss our ass or we won't help you","commenter_a":"If americans want their pipeline then just put it on their land over their water not ours, They should have to pay the price for their greed not us, I am tired of americans living good lives off our suffering.","post_message":"Video: 7 Arrested After Pipeline Protesters 'Invade'  Enbridge's Duluth Offices  bit.ly/1Ms7Sjy"},{"comment_id":"1171823469552530","commenter_b":"Says the self loathing woman...","commenter_a":"Go find your safe place and cry. Omg please. Give up already Donald j trump is the president","post_message":"What do you make of this? These celebrities are among the stars taking part in a telethon airing on Facebook Live during Donald Trump presidential inauguration, which will raise money for Planned Parenthood and the environmental group Earthjustice."}]
