[{"comment_id":"1871395319625852","commenter_b":"I can totally see her talking to the Queens of other countries not clomping around scowling at everyone that is pretty","commenter_a":"For a GOP Super Pac to do this to a presidential candidate's wife and family is inexcusable and wicked as hell. Look at her TODAY. She will be the most glamorous and classy first lady yet and envy of the nations.","post_message":""},{"comment_id":"867742276749682","commenter_b":"You are a liar and a piece of shit!","commenter_a":"Yes","post_message":"Obama just gave Trump hell for complaining about the voter fraud but look what just happened. This goes to show you the sickening corruption that's happening in our country. Do you think the election is rigged?"},{"comment_id":"10153367741477411","commenter_b":"Good. Disgusting woman","commenter_a":"I say she probably didn't know anything about it! My sisters ex husband was a cop and she knew nothing about the \"dirty deeds done dirt cheap\"!","post_message":"Fox Lake lieutenant Joe Gliniewicz's widow Melodie faces several conspiracy charges as well as charges on money laundering and the misuse of charitable funds."},{"comment_id":"10153836785761350","commenter_b":"Lady do you even know.what the truth is? Doesnt seem like it","commenter_a":"Trump is the ONLY one telling the truth and saying like it is,,,,,,Obama just lies,,,,","post_message":"\"We have a whole bunch of Americans, Trump supporters and his support I think will grow after this moment who feel that no one is telling them the truth and no one is saying what is obvious to them.\""},{"comment_id":"10156146715050354","commenter_b":"Who the fuck is indoctrinating children?","commenter_a":"It is what perverts do !","post_message":"Cha-ching! Tax dollars, y'all!"},{"comment_id":"10153874849832439","commenter_b":"I heard her spine landed on top of police car. Best news I heard today! Rot in hell psychotic bitch!","commenter_a":"Can she blow herself up again, with all her brethren with her?","post_message":"Hmmm, is she making the (Eiffel tower) peace sign? Islam is peace, brother. The good news is -- she's dead. The bad news is Obama wants to bring these 'widows' and 'children' like the refugee Boston bombers to our shores. This savage tried to lure police within detonation range by crying \"help me, help me\" before blowing herself up."},{"comment_id":"10152960155261336","commenter_b":"Illegal aliens receive EBT & all other assistance, including Medicaid & Medicare, Dorri McNeal Vigar. They need a TIN. They get it at the County Office or SS Office via their computers. They are the \"900\" series. If they have \"anchor babies,\" they get it. If they have children born in other countries, they get it. Now here is the un- requested bonus kicker: If they have a\"900\" series TIN, file taxes, & claim their children; even children residing in Mexico or other countries who have never been in the US, they can apply for the Child Tax Credit & get it. All they need is a TIN for each kid. The IRS is the largest remitter of funds to Mexico. When called on the carpet about it 2 years ago, the IRS became highly indignant & stated congress made no law disallowing them to remit for children not born ...","commenter_a":"And proof of US citizenship.","post_message":"Arguing that taxpayers lose $858 million a year on food stamp fraud, several GOP lawmakers have proposed a new bill that would require photo identification to use food stamps."}]
