[{"comment_id":"1586521584985469","commenter_b":"@username - you are a disgusting racist pig!","commenter_a":"There is so many blind people to what the Obama has did to all of us. They are so disrespectful of our Military and country. Can't wait for them to leave.","post_message":"Happy 24th anniversary, Barack Obama and Michelle Obama! Here's a look back at the First Couple's sweetest moments."},{"comment_id":"10153764021131509","commenter_b":"And as far as white women go.... I've quite seen a few black women with arm pits and legs full of hair. Jus sayin..","commenter_a":"WHITE-WOMEN! Tryinna start a trend....","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"},{"comment_id":"10154823170036162","commenter_b":"That is what I called the good work","commenter_a":"@username dammm","post_message":"WOW: Have you seen this? Loyal Cubs fans in Nebraska knocked it out of the park with their Halloween decorations this year, honoring the team! Their decorations include a \"Go, Cubs, Go\" light show!!!  Thanks to Sabrina and Paul Faire for sharing their video with #abc7chicago."},{"comment_id":"1011526468943605","commenter_b":"That's what professional political tumors do!","commenter_a":"Good. Cruz wasn't there for Kim Davis. Ted was there for political purposes.","post_message":"Ted Cruz tried to get on the stage with Kim Davis in Kentucky ... only to be blocked by an event staffer."},{"comment_id":"611157035758918","commenter_b":"Deport them","commenter_a":"I would hope the FBI is investigating this organization for violating a US law!","post_message":"The \"religion of peace\" strikes again..."},{"comment_id":"10154700832214369","commenter_b":"Stfu crackers","commenter_a":"Time to play the National Anthem.... they will all take a knee then they can swoop in for a mass arrest.","post_message":"Violent protesters rampaged through Charlotte as anger continued to build over the deadly police shooting of Keith Lamont Scott"},{"comment_id":"378947809141289","commenter_b":"Alex check your fact on the cost","commenter_a":"Yes","post_message":"It is now being estimated that a border wall will cost $21.6 billion, which is much higher than Trump's initial estimate of $12 billion. Would you support the wall being built at this cost?"}]
