[{"comment_id":"1035379929888394","commenter_b":"@username actually if you check the poll aggregates you'll see that Hillary can best Trump.","commenter_a":"Can President Obama become her running mate for her Vice? Or Bill Clinton?","post_message":"The numbers don't lie, but Republicans definitely do."},{"comment_id":"611126095746235","commenter_b":"That's less people for Iran to jail and then demand ransom money for.","commenter_a":"Yeah they want to kill us but they want to take our money first good riddens who the hell would want to go there with those barbarians","post_message":"New post (Cancel your vacation plans: Iran bans US citizens, says US ban is \"obvious insult to the Islamic world\") has been published on Jihad Watch"},{"comment_id":"723507841151844","commenter_b":"Now her dumb ass should know better 😂😂😂","commenter_a":"@username @username bruh lol","post_message":"This pretty much sums up my life #WSHH"},{"comment_id":"842682652588978","commenter_b":"She needs to be kicked out of our country, we don't need trash like her kind around.","commenter_a":"Here's another puke, wants everything America has to offer but can't be happy with that, maybe the next time she appears in public, the police should not lift a finger to give it any protection, then she'll probably get stomped under the crowd, and she deserves every foot that would trample her arse!","post_message":"It is people like her that perpetuate hate. Police are the people that keep her safe. Do you think Beyonce needs to learn some respect?"},{"comment_id":"952012654839207","commenter_b":"Pair of fucking idiots. Shouldn't be allowed to breed...","commenter_a":"Every once in a while I read something that haunts me for years","post_message":"The baby was strapped into a child-seat and left on the floor."},{"comment_id":"10155547019200389","commenter_b":"Once again jay you are incorrect as Cheney resigned from Hali when he became VP. As you say google it","commenter_a":"We need to do the same with Bush and Chaney for the Iraq war","post_message":"Egyptian criminal court sentenced ousted Islamist President Mohammed Morsi to 20 years in prison on charges linked to the killing of protesters in 2012."},{"comment_id":"10155729304999638","commenter_b":"Trump is another Hitler in the making! Shame on all those Americans who brought him into power!!! Wonder what his next steps will be - Muslim concentration camps!?","commenter_a":"Hey Donald does this sound familiar! \"An evil exists that threatens every man, woman, and child of this great nation. We must take steps to ensure our domestic security and protect our homeland.\" -Hitler Racist big Donald and his racist supporters all deserve to go to hell!","post_message":"Donald J. Trump's controversial \"Muslim ban\" just hit a major legal roadblock."}]
