[{"comment_id":"10153098509611813","commenter_b":"The ACLU doesn't stand for white heterosexual males or gun rights...ever.","commenter_a":"The ACLU stands for dead babies and bombings.","post_message":"The ACLU supports refugees and stands against fear mongering by politicians. @webpagelink #refugeeswelcome"},{"comment_id":"444002905787317","commenter_b":"I wish someone would shoot that muslim nigger","commenter_a":"Unfortunately, the mass shootings will continue in the USA as long as the NRA continues to have such a strong influence, through its lobby, with the Republican Party in control of Congress. So many simple steps could be taken...background checks for instance or the banning of multiple-firing weapons ( one doesn't need a machine gun to kill Bambi! ) but the Republicans in Congress blocked even the discussion of background checks the last time it was brought up. With such intransigence in not even allowing discussion of the issue, I am afraid that no gun control law will be passed. President Obama is right to be furious as I am. As an American, I feel distressed, angry and frustrated but also, sadly, resigned. It is simply a matter of time until the next mass shooting. PS: Fewer than half of all Americans actually own a gun but those who do ...","post_message":"President Barack Obama is furious. Watch as he addresses the nation after another mass shooting. At least 10 were killed and 7 injured in a shooting at a community college in southwestern Oregon."},{"comment_id":"10153465175281162","commenter_b":"Unbelievable the number of ignorant do gooders on here. If you never handled pigs how can you say what is the best way to do it? if ya pick up a pig like a puppy it will struggle and squeal and put up a fight. but if ya hold it by a hind led it will settle down and let you handle it. The trucks they are on have multiple floors so yes you can get a lot of pigs on there, if they were less densely packed there would have been more mortality. and yes air can circulate. All you planet saver that think vegans are going to save the world, How much fossil fuel, fertilizer, herbicides, pesticides, and other pollutants, are produced in the growing and harvesting of what you eat.","commenter_a":"Jamie Hall","post_message":"A semitrailer carrying 2,200 piglets overturned on a highway. Watch as emergency crews rushed to wrangle the pigs -- > @webpagelink"},{"comment_id":"10155043885602908","commenter_b":"Move out of Big Blue high tax, high cost of living Commifornia. Problem solved.","commenter_a":"$7.25/hr equates to about $1250 a month before taxes. After taxes let's say $1000. I live in a studio apartment in CA and it's $885/mo. So $115 remains for 4 weeks of food, utilities, transportation to and from the job? Get real, America. Especially for a family even $15/hr would be a stretch, but it'd be better.","post_message":"It is a national disgrace that millions of full-time workers are living in poverty and millions more are forced to work two or three jobs just to pay their bills. A job must lift workers out of poverty, not keep them in it. The current federal minimum wage of $7.25 an hour is a starvation wage and must be raised to a living wage."},{"comment_id":"1048574538534260","commenter_b":"Please vote for Trump , Wisconsin !","commenter_a":"The career politicians in the runnng - all of them except Mr. Trump, have had many opportunities to do their job of protecting us, providing good paying jobs, help get a handle on the ever-increasing debt - - and they have done Nothing, but bask in the political paradise they have created - - getting paid with our valuable tax dollars to do nothing but make matters worse. I hope Wisconsin voters will not allow themselves to be bamboozled into voting for more of the same for the next 4 years. I don't think this country could take it. Trump 2016 !c","post_message":"My new radio ad, airing today in Wisconsin! See you soon! #MakeAmericaGreatAgain"},{"comment_id":"775973422593235","commenter_b":"Absolutely, she should be in prison anyway not headed to highest position in America","commenter_a":"Elated!","post_message":"BUSTED: Hillary Clinton Was Just Caught Read Handed For Being Linked To... This actually might stop her from running. Would you be happy if she had to back out of the race?"},{"comment_id":"10154162143246756","commenter_b":"@username No, it doesn't. As a woman, you should pay attention to who thinks you aren't able to make decisions about your own body.","commenter_a":"Scalia institutionalized his vicious hatred of women and gay people and his lack of respect for the Constitutional rights of every American. If he didn't want people to speak ill of him after he was dead, he should have lived a different life. He was a hateful man and will be rightly remembered as one. Death doesn't suddenly turn a monster into Winnie the Pooh.","post_message":"Perhaps most of all, Scalia will be remembered for his scathing dissents. He was a reliable conservative, but every once in a while he broke rank."}]
