[{"comment_id":"10153583217394712","commenter_b":"I'm getting hit with smokers tax and I don't smoke. Time to divorce my wife and let her and kids go on state insurance and I'll pay penalty !! It's the American way.","commenter_a":"Up up and away....the never ending story of insurance rate hikes. We pay. $1200 a month as it is....SMMFH","post_message":"The state's largest insurer says they are dealing with more than $100 million in losses and other issues that have driven up costs."},{"comment_id":"10153559640036051","commenter_b":"This post gave me cancer all over again....","commenter_a":"I support guns. I love them. I have some. They are for Huntin. I believe we should be able to own guns. But this Type of rifle. I think our militry And police is the only ones who should have this kind of gun. What does a deer hunter need with somethin like that. I think somethin like a 30-06 is plenty of gun. Or somethin similar. Not just that kind. But Nothin like Whats shown. There should be a limit. But not banned","post_message":"A federal court just ruled that a Maryland law banning citizens from owning military-style rifles is unconstitutional. Do you support the court's ruling?"},{"comment_id":"10152885159374342","commenter_b":"That witch would be 6 ft under! !!","commenter_a":"@username lol","post_message":"A 30-year-old woman faces criminal charges after a video surfaced that appears to show her storming onto a school bus and slapping a 5-year-old she believed was bullying her child.  FULL VIDEO/STORY --> @webpagelink"},{"comment_id":"10153712907532483","commenter_b":"@username, you need be aware that the Christian Bible never tells us to go out and kill others or to be vengeful. Any Muslim who believes the Quran as I believe the Bible would truly be a danger to most Americans.","commenter_a":"I want to speak out and let people know that there are a plethora of southern baptist churches that are very diverse. My pastor adopted his kids from Africa and they are black while he is white. It's a fantastic GODLY southern baptist church. Don't condemn all churches or all baptist churches or all southern baptist churches for what these people have done. This is very sad.","post_message":"\"There was pushback about... the types of children we were bringing in, and I was asked to not invite black children to [Vacation Bible School].\""},{"comment_id":"10154015419833869","commenter_b":"Having a hot flash doesn't mean she is not qualified!","commenter_a":"Yup","post_message":"The Borowitz Report: The same poll revealed that a broad majority of voters found an unconscious Donald Trump more fit to be President than a conscious one."},{"comment_id":"10153143736247434","commenter_b":"Bitch, I will snatch the wig off your f'ing head! Don't come for us gays, whore. We don't play!!!","commenter_a":"Another example of LGBT being absolutely clueless when it comes to racism.","post_message":"These are by no means new rumors but now’s not the time for this, Alexis!"},{"comment_id":"496930887161871","commenter_b":"women, they just don't listen lol","commenter_a":"Hope she went to jail!!","post_message":"\"Thank to Obama and I don't have to OBEY you\", she said to the police officer!"}]
