[{"comment_id":"917823551667757","commenter_b":"This is another stupid Question!! HILLARY SHOULD BE IN PRISON 2016.. Dumb ass thinks she can run for president She just needs to STOP INSULTING AMERICANS INTELLIGENCE!!!","commenter_a":"Yes","post_message":"Multiple Choice Quiz time, Republican kiddies! Which answer did you choose? A or B? @webpagelink"},{"comment_id":"10158125601040615","commenter_b":"America could only be so lucky.","commenter_a":"I think Trump is now afraid somebody just may be planning to 'take him out'. He should have thought of that before.Oh, yes, I forgot, he doesn't have a working brain!","post_message":"But..."},{"comment_id":"876171829182663","commenter_b":"Moderate moslems DO NOT exist!","commenter_a":"YEP, They are ALL extremists, and should ALL be deported! Its simple!","post_message":"I'm not joking when I say this is the most important video I will ever share..."},{"comment_id":"10154635792157599","commenter_b":"The GOP is better than this. The USA is far better than this. Be bold, represent your district, and stand against the unconstitutional, corrupt administration that has taken office. The administration's actions should be leading Republicans and Democrats in Congress to work closely together and assert power as the legislative branch, rather than acting as an extension of the executive branch. #NoBanNoWall","commenter_a":"Congressman Reichert, I believe it is important to remember that the United States of America is a REPRESENTATIVE republic. As our elected REPRESENTATIVE, please REPRESENT the people of your District. You were elected to REPRESENT the people of the 8th Congressional District of the State of Washington (NOT Donald Trump).","post_message":"Careful vetting to ensure the safety of the American people is the responsibility of the federal government and one I take very seriously. Unfortunately what we saw this past weekend was mass confusion and miscommunication between government agencies and the improper apprehension of people legally allowed to be in the US. I urge the administration to work with Congress on solutions that protect our borders while maintaining our nation's dedication to compassion and religious freedom."},{"comment_id":"1082800578422029","commenter_b":"She can squat but that don't put bread on the table!","commenter_a":"who makes up these polls for you ?","post_message":"BREAKING"},{"comment_id":"10152949649721378","commenter_b":"I don't use any drugs...yet your comment is still incomprehensible.","commenter_a":"Disturbing and sinful....","post_message":"IRELAND  MARRIAGE VOTE NUMBERS: 62.1% of voters in Ireland were in favor of same-sex marriage in the world first national vote on the issue.   Ireland's deputy prime minister, Labour Party leader Joan Burton, said Ireland was becoming \"a rainbow nation with a huge amount of diversity.\""},{"comment_id":"10153666896386749","commenter_b":"Um. It's 4-4 and been controlled by conservatives for like 30 years","commenter_a":"Essentially, the republicans refuse to allow the supreme court to be anymore liberalized than it already is!","post_message":"Stop obstructing our Supreme Court."}]
