[{"comment_id":"522407631280177","commenter_b":"Translation: her vagina scares me.","commenter_a":"Maybe it is because Hillary Clinton is just plain unlikable. I am not a Trump fan but will hold my nose and vote for him over her. Her voice scares people, she just can't connect with anyone. She is the female John Kerry.","post_message":"Hillary Clinton and Democrats think  or hope  that once the primary wraps up, tensions will subside."},{"comment_id":"437108856413709","commenter_b":"He will CERTAINLY BE BETTER THAN THE MORON IN THE WHITE HOUSE NOW!","commenter_a":"Agree","post_message":"'I will be the greatest jobs president that God ever created'. Agree or disagree?"},{"comment_id":"457572411058203","commenter_b":"I hate that vile bitch. Dumbest wokman on the planet.","commenter_a":"Sarah and her offspring are all a blight on humanity and whatnot, but the dog doesn't seem bothered. That said I still wouldn't stand on a dog..","post_message":"Just when you thought Sarah Palin couldn't sink any lower, this happens. If this woman can't teach her own kids to have respect for animals, she has no business even thinking about running for anything in 2016.  ~Darrell"},{"comment_id":"662083353949972","commenter_b":"'@username the police and you need to respect the first amendment","commenter_a":"These are adults who are supposed to be leaders in our community. They have the power to take life and they are the ones acting like children who have taken their ball and gone home. Is it any wonder these children are afraid of police and concerned with their actions? Shame. Shame on them. Shame on them for proving the children's point.","post_message":"Some Jefferson Parish deputies won't volunteer for security detail at Bonnabel High School football games after several team members kneeled during the national anthem during last weekend's game."},{"comment_id":"10153246796329607","commenter_b":"Stop them now!!!","commenter_a":"Yes","post_message":"QUESTION OF THE DAY:   Should the U.S. stop accepting Syrian refugees? #FOX45QOD"},{"comment_id":"10154752399793598","commenter_b":"They should be called feminazists","commenter_a":"So true!","post_message":"200 Million Girls Killed in China, Where Are the Feminists?"},{"comment_id":"10154287048884205","commenter_b":"TYT hello from Juneau Alaska! We are on the watch out here! Trump might sell us off back to the Russians, for a few barrels of oil!","commenter_a":"Hi Joe!!","post_message":"The Young Turks LIVE! Hosted by Cenk Uygur and Ana Kasparian"}]
