[{"comment_id":"1757125454570252","commenter_b":"Kasich belongs to the Liberal side, lies like they do. Thank God, all has been peaceful. Stay safe Law Enforcement 🇺🇸","commenter_a":"Loved your speach, Laura. I'm so disappointed in John Kasich, Jeb Bush and other Republican leaders who are helping Hillary to win.","post_message":"The Ohio governor is still refusing to attend the convention in his home state and support GOP unity."},{"comment_id":"331807290546859","commenter_b":"Dump trump and his bitch wife","commenter_a":"trumpers are ALL bullies! Only bullies attack a man 4 against 1, not to mention punching a poor old dog.... Their mothers must be so proud","post_message":"Trump, your 'bad hombres' are right here.  Shared by Occupy Democrats. Video credit: ABC 7 News - WJLA."},{"comment_id":"10153389766269203","commenter_b":"NAFTA hurt the American worker,manufacturing jobs are going where thry do not have to pay a living wage to American worker's. The middle class is paying for this by job lost and food stamps the working poor need.If this new trade agreement is good for America why is it fast tracking. America elite can build factories over seas and hire people there pay them enough to be able to buy the products they make.I believe we should start penalizing companies that move out of America for cheap labor abd export products back home. The USA will dominate no one if we do not start paying a living wage here and make jobs not loose jobs.THIS AGREEMENT BENEFITS COUNTRIES WHERE LABOR IS CHEAP THEY WILL HAVE JOB GROWTH EXPORTING TO THE USA,WE WILL BECOME A NATION OF TWO CLASSES THE ELITE AND THE POOR.","commenter_a":"There is nothing worse than a bunch of Puritans who are so sanctimonious that they would give comfort to the enemy -- people like Warren, Sanders, and Nader. But the Democratic Party has great discipline and it will not let a bunch of extremists wreck the party like the Tea Party has for the GOP. Team players make victory. @webpagelink","post_message":"Elizabeth Warren is leading a liberal revolt against a trade deal she insists will hurt workers and unravel Wall Street reforms. But can President Obama muscle it through anyway?"},{"comment_id":"10153123153839094","commenter_b":"Behind what.....the Jettsons?","commenter_a":"We are only behind because the city deferred maintenance and closed one of the terminals to make flyers more crowded and make the airport look awful.","post_message":"Kansas City should focus on planning for a single new terminal at Kansas City International Airport, airlines and the city’s aviation department said today."},{"comment_id":"934315223319642","commenter_b":"Michelle Owen Nyki KiKi 😂😂😂😂","commenter_a":"AHAHAHAGA help","post_message":"Via The Everlasting GOP Stoppers"},{"comment_id":"10153978622861438","commenter_b":"Of course she is. I could see through that bubbly bs","commenter_a":"Shocker....not.","post_message":"Kelly Ripa’s morning talk-show drama might force us to acknowledge all the work that goes into her cheery persona."},{"comment_id":"565700806961575","commenter_b":"Don't they get it! We don't want her!","commenter_a":"Hillary will probably die before then of karma and natural causes!","post_message":"Trump-Clinton rematch for 2020?"}]
