[{"comment_id":"10150715134694999","commenter_b":"@username Illegal immigrants steal roughly 9 billion dollars worth of resources reserved for American citizens every year. Deporting them per our existing laws will save us a ton of money...any more brain busters?","commenter_a":"What's even more appalling is that he's polling at 39% of Republican + Republican-leaning registered voters in the latest CNN poll. ...What does this say about our country and how folks want our supposed leaders to behave? What is this acceptance of ongoing crass commentary? ...And what happened to equanimity and professionalism?","post_message":"Donald J. Trump called Hillary Clinton's mid-debate bathroom break \"disgusting.\" Frank Bruni says it's \"the rare man-child who finds that worthy of ridicule.\" Read on in The New York Times Opinion Section."},{"comment_id":"10153067823099411","commenter_b":"My respected fellow u explain very nicely like a poet and blame to muslim now one question who attack on Afghanistan who is killing innocent people in Pakistan by drawn attacks who is killing Muslims in burma. who is killing Muslims in Africa,and one thing listen Islam is the religion of peace not terror first study islam than make justice infront of me 10 cristians got Islam its not the issue main point is that dont try to impose religion war make the world peaceful place not hell thank you","commenter_a":"Copy and paste this on ALL muslim stories! Flood them with the truth! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The underwear Bomber was a Muslim The U-S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bafi Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Muslims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The Besian Russian School Attackers were ...","post_message":"Hundreds of thousands have flooded the streets of Chechen capital of Grozny in a rally against the publication of the Prophet Muhammad by Charlie Hebdo magazine. The demo, dubbed to Prophet Mohammed, was organized by region clerics and united muslims from various regions of Russia."},{"comment_id":"1014820688580048","commenter_b":"Time for muslims to take their a$$e$ back where they came from","commenter_a":"That's the national anthem. If you aren't willing to be An American than go home! And take the stinking socialist with you. You can take the atheists and the Mexicans.","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays @webpagelink"},{"comment_id":"10153187015096051","commenter_b":"Carolyn, have some respect. He is our President after all. President Obama has made America great. We don't need Trump to mess it up.","commenter_a":"Agree. Obama is a joke and think the world knows it. He's like a bad kid. Just had to say something because he's mad. And the rest....thought he was talking about himself. The US does deserve better than him","post_message":"President Obama had some harsh words for Donald Trump today."},{"comment_id":"10156809367690725","commenter_b":"U shush up cactus lady","commenter_a":"STOP, JUST STOP! Trump uses this sad news to advance HIS agenda, and the terrorists use his rhetoric to advance theirs. DONALD TRUMP, JUST SHUT UP!","post_message":"Watch this clip from earlier this year. Time and time again- I have been right about terrorism. It’s time to get tough!"},{"comment_id":"10153124983097061","commenter_b":"fire her","commenter_a":"If she can't full fill her position she should step down.","post_message":"Kim Davis name removed from marriage license for same-sex couple: abcn.ws/1NrN92G"},{"comment_id":"10153085748364312","commenter_b":"So it's appropriate for the race card to be thrown here?? Wow","commenter_a":"I bet they don't get gunned down! BC \"white lives matter\"","post_message":"Two teenagers from Kentucky who vanished nearly two weeks ago are suspected in a multi-state crime spree."}]
