[{"comment_id":"955377877852075","commenter_b":"Most corrupt woman in American history.","commenter_a":"Hillary is not only the MOST QUALIFIED candidate for president, she is an American shero. She has done and continues to do so much for our country and its people. I know she will create jobs, equality and so much more. Go Hillary, go!!","post_message":"Hillary has spent her entire life standing up for kids and families. That's why she's running for president. Watch one of our first TV ads of the 2016 campaign:"},{"comment_id":"539787562878490","commenter_b":"Send Them back to their sand pile home, get them out of this country!","commenter_a":"Why were they even there watching if they didn't like it","post_message":"Furious Muslim students rush stage during American Sniper showing. They have no respect. If they don't like American Sniper they can leave. Do you agree these Muslims are out of line?"},{"comment_id":"818824291595686","commenter_b":"@username. I don't live it Kentucky Faggott. Ummmm, Self -Employed Trucker. You big and Bad, bring your punk Ass on. Scatter my Brains. You ALL talk, punk Bitch. Tell your mama, to get back on the Corner, her break is up!","commenter_a":"By Law, if the man is found not guilty, they cannot Execute him. This is a Bogus Site!!!","post_message":"SPREAD THIS LIKE WILD FIRE! This man is INNOCENT! Do not stop until this is HEADLINE NEWS in the #MainstreamMedia! NONE OF US ARE FREE UNTIL ALL OF US ARE FREE!"},{"comment_id":"10153460362791336","commenter_b":"Trump has Americans interest for once , not what can Americans do for illegals .","commenter_a":"The Silent Majority is COMING OUT FOR Donald J Trump. The PC ERA IS OVER. THE TRUTH ERA IS HERE. Donald J Trump 21st Century Patriot.","post_message":"\"The silent majority is back, and we’re going to take the country back.\" On Saturday, Republican presidential hopeful Donald J. Trump spoke to thousands of cheering supporters in Arizona."},{"comment_id":"588380568016902","commenter_b":"NO, they just want to shove another \"change\" down our throats!!! I am so sick of this. We don't have the money to make such a change. If anything put her on something else but DO NOT MAKE CHANGES!!!!! Do you Dems think money grows on trees?? I am not paying for nor will I ever use a $20.00 again if this is done!!!","commenter_a":"So who made this decision?","post_message":"OH HAPPY DAY!"},{"comment_id":"10153332639166350","commenter_b":"I think either Dianna Elizabeth or Elizabeth Diane","commenter_a":"Congratulations William and Kate!!","post_message":"It's a princess! Congratulations, Duchess Kate and Prince William! on.today.com/1DRmS6f"},{"comment_id":"10153736602849749","commenter_b":"@username - Why does Europe have to take these refugees? So many are military aged men. Why aren't they staying in their country and fighting to save it? Militant Islam is dangerous whether you agree to it or not. Letting these people into your country will diminish your country because these people will demand that you accommodate their religion and their way of life instead of them making an adjustment because they are guests. They will demand changes in established laws because they will not conform. These are not bigoted statements. These are facts that are easily verified.","commenter_a":"Why do militant atheists support the arrival of (militant?) Islam into Germany?","post_message":"German police spray left-wing protesters with a water cannon to keep them apart from an anti-Islam demonstration. See more: @webpagelink"}]
