[{"comment_id":"10153477334723984","commenter_b":"She doesn't care , she just wants the money,","commenter_a":"Go die you ugly whore what a fucken disgrace","post_message":"Pop star Miley Cyrus just said something highly disturbing about Christians. It's especially sad when you consider where she came from..."},{"comment_id":"10155862004711038","commenter_b":"That is impossible. Teenage girls take up the entire bathroom so you can't share it with them.","commenter_a":"Yeah, teenage boys are gross...but have you ever shared a bathroom with a teenage girl? It's fucking nasty.","post_message":"You love him, of course, but COME ON."},{"comment_id":"1097784373632154","commenter_b":"He always stands up... Except for when it's time to bend over for Trump.","commenter_a":"I have never stopped liking Cruz...He always stands up for what he believe in...Sometimes that puts him at odds with other Republicans.","post_message":"Excellent question..."},{"comment_id":"1037623106257736","commenter_b":"Many foreigners are required to take English in school unlike Americans.","commenter_a":"if you want to go to murica you have to speak engrish","post_message":"A study found that 77% of immigrants have high school diplomas and over 40% graduated from college."},{"comment_id":"1296273287105505","commenter_b":"You can go to hell liar","commenter_a":"Thank you president Obama. You will always be my president . The orange one will never be able to walk in your shoes he is a lier and con man and most of all a racist sob. Never put president before his name.","post_message":"\"That's what separates us from tyrants and terrorists.\" Nearing the end of his presidency, President Obama shared his hopeful vision of America's future."},{"comment_id":"10150728672209999","commenter_b":"Well rebecca I'd recommend finding a director with more credibility before trying to gain traction on this movement. I'm not saying they're unjustified in their claim but Spike Lee is a pos","commenter_a":"Spike Lee hasn't made a good movie in over a decade so who really cares.","post_message":"The outcry over the nomination of 20 white actors, and no black ones, for the coming Academy Awards gained momentum on Monday — MLK Day — as Spike Lee and the Jada Pinkett Smith announced that they wouldn’t be attending the ceremony."},{"comment_id":"1056082027782443","commenter_b":"She needs to speak for herself. Some of us still clean our own houses.","commenter_a":"Well it's probably good she is his ex wife lol","post_message":"Donald J. Trump's ex-wife spoke out in support of the GOP candidate and the need for legal immigrants."}]
