[{"comment_id":"1024646927570802","commenter_b":"What RUBBISH!","commenter_a":"Reality is that even if you consider it a minor incident, which it appears to be, the trumpster and his campaign manager lied about it, and are still doing so. He doesn't apologize. He doesn't ask for forgiveness. See a pattern?","post_message":"WATCH: Florida police have released surveillance video showing the incident between Donald J. Trump's campaign manager Corey Lewandowski and reporter Michelle Fields. Trump's campaign issued a statement calling Lewandowski “absolutely innocent” after he was charged with misdemeanor battery. @webpagelink"},{"comment_id":"582484121909678","commenter_b":"Man she need to stop with her owe puppy monkey baby looking ass","commenter_a":"Donte Grant","post_message":"She's not ready for a tattoo"},{"comment_id":"10153225867682061","commenter_b":"How can you cut taxes, increase military spending And balance the budget and the only thing going is Obama Care?","commenter_a":"CHILDREN DON'T CHOOSE TO HAVE POOR OR INCOMPETENT PARENTS. FATE GRABS CHILDREN BY THE THROAT AND SAYS, is your life. Poor Child and the Politicians Beneath the greedy iron fist of the Politicians, a ragged, hungry, poor child dwelled Poor Child family tried to climb over poverty restraining wall, but their fragile world collapsed during a cold-blooded eviction from their shoddy shelter Poor Child moved onto a filthy, freezing street, their destitution once again a widespread and noisy public dispute Poor Child body and hope were quickly fading away, tho for their soul, many fellow sufferers continued to wail Politicians and their cronies only cared that reduced assistance and lowered wages for the poor would increase their already huge fortunes Poor Child only wanted, one last chance to be warm, to be dry, to eat. @username","post_message":"WATCH: The #GOPDebate in a minute. More on the debate from last night: abcn.ws/1NJnjrU"},{"comment_id":"10152789526371130","commenter_b":"I think her father is a proud lesbian.","commenter_a":"well this little girl is just over the top.. do you think her father is proud? I think not..","post_message":"\"I've been pegged with the word insensitivity. It's just how I've been sensitized and the tone I chose.\""},{"comment_id":"955239887844766","commenter_b":"Good read. Tells it like it is.","commenter_a":"obama is the biggest pos in this country!","post_message":"I didn't expect THIS!"},{"comment_id":"10154393915434170","commenter_b":"They will find other ways !","commenter_a":"Guess the \"New World Order\" has been reordered....all the elites that envisioned a single Global Society can pretty much shove that right where it belongs!! :)","post_message":"The elites are having a meltdown, but the people of Britain have spoken. We've got the reaction from Donald J. Trump as well."},{"comment_id":"10153556298696130","commenter_b":"Hillary is a woman","commenter_a":"Trump isn't letting the terrorist in.. your boy Obama is and his right hand man hillary..","post_message":"This Donald J. Trump supporter reminds us that nobody has a monopoly on terror."}]
