[{"comment_id":"477526855778749","commenter_b":"@username It won't because its Racist...You that Dumb??","commenter_a":"Celebrating Diversity while excluding whites is NOT Diversity. It is Discrimination.","post_message":"“Seeking NON-WHITE men and women, ages 20s to 30s, for Broadway and upcoming Tours!” the casting notice for \"Hamilton the Musical\" read."},{"comment_id":"1607217966231983","commenter_b":"Both are trash , miley gross she nuts to she better grow up !","commenter_a":"Both are idiots","post_message":"Hillary Clinton and Miley Cyrus are a match made in Hell"},{"comment_id":"476672599181287","commenter_b":"Speaking of closet queens... overreact much, Michael???","commenter_a":"This is one of the reasons that many on the right hate him. They believe that when people are treated equally, they (personally) are somehow diminished.","post_message":"President Obama highlights why the Kenyan \"non-issue\" of LGBT rights is an issue."},{"comment_id":"10153572562143645","commenter_b":"the woman must have a strong heart...I would have had a heart attack and expired right then and there!!","commenter_a":"I would have been spooked","post_message":"This furry creature gave an elderly woman a rude awakening when she found it curled up on her chest."},{"comment_id":"987580134720040","commenter_b":"Send illegals home","commenter_a":"Send the illegal scum back home.","post_message":"\"The massive influx of immigrants, both legal and illegal, has been demonstrably bad for the employment prospects of low-skilled Americans...\""},{"comment_id":"1841357016150669","commenter_b":"Coming out now? It sure is a convenient time. Why is she reading it?Another thing if Trump was sexually abusing her why did she stay ? Why didn't she leave when he first kissed her. She stayed and he kissed her again. He put his hand on her breast and she still stayed? Give me a break! This woman is big time lying. This never happened!","commenter_a":"So many people are so stupid and are going to vote for Hillary but when she cause a war and all your children are sent to war and dying don't complain.","post_message":"\"I stood up and he came to me and started kissing me open-mouthed as he was pulling me towards him. I walked away and I sat down in a chair.\" - A former contestant on \"The Apprentice\" describes alleged unwanted sexual advancements made by Donald J. Trump. More: @webpagelink"},{"comment_id":"10153268969721336","commenter_b":"How stupid r parents...it is not that hard to put this on a tall shelf...what a bunch of dumbasses...","commenter_a":"Survival of the fittest.","post_message":"This year, U.S. poison centers have already logged an average of 31 exposures to laundry pods per day."}]
