[{"comment_id":"10153283124151316","commenter_b":"Blackie Chan where does a gorilla get his protein? The gorilla does not eat any meat, This beast can throw a 200lb man across the street with one arm....maybe dark greens.....","commenter_a":"What's your protein source?","post_message":"Man says raw food diet has made him 'almost superhuman'... @webpagelink"},{"comment_id":"1143510442327091","commenter_b":"I will personally go to the Springs to make sure this woman is defeated in her next election period!","commenter_a":"Time for her resignation!","post_message":"“The true instigator of this violence and all violence at any Planned Parenthood facility is Planned Parenthood themselves.\""},{"comment_id":"381679348687026","commenter_b":"Yeah, and look what we have now. A man and woman who think they are king and queen and are destroying our country. Stop him.","commenter_a":"George Bush was a really great President and Laura Bush so graceful and elegant!","post_message":"We love George W. Bush...such a true class humour!"},{"comment_id":"10154570947183822","commenter_b":"his ass should of been hung long ago.....his mother should of been charged as an accomplice too.. she knew damn well those officers would be walking into an ambush.","commenter_a":"Yeah...and I want a million dollars....sorry buddy...you earned it. No remorse ...no care....there are no words...","post_message":"The man convicted of killing three police officers in Stanton Heights appeared in court today. Richard Poplawski wants all charges against him dropped, and declared \"Let's Go Pens\" as he was led into court."},{"comment_id":"422994894562852","commenter_b":"All but trump need to drop out and quit wasting money! Hell give it to the vets and homeless! Trump!!!!!!!!","commenter_a":"Mitt Romney will hurt Marco Rubio campain, please do let him","post_message":"Help or hurt?"},{"comment_id":"10154233668643132","commenter_b":"Michelle Lena Butler idiots on both sides.","commenter_a":"Why is a 50 year old and a 47 year old trying to even reproduce? Can their be laws against that please?","post_message":"\"I can't afford Melissa's doctor visits . . . I don't think I can afford the babies, so I just want to abort all three babies.\""},{"comment_id":"1510580285648823","commenter_b":"She is amazing. Jill is a bad ass","commenter_a":"Margy White @username","post_message":"True confessions: What was I doing in Russia? Speaking out against Putin following the US into catastrophic war in the Middle East, and calling for a weapons embargo and #PeaceOffensive in the region. Check out the video of my full remarks: @webpagelink"}]
