[{"comment_id":"10153133093676491","commenter_b":"OMG IK WIL DIT NU AHH NERD FEELS OVERLOAD","commenter_a":"'@username Bram Van der Maat","post_message":"Attention, fans of The Lord of the Rings Trilogy."},{"comment_id":"10153256294124726","commenter_b":"Deport that illegal!","commenter_a":"Put them all on a boat back to Africa and sink it","post_message":"WATCH: Obama on Baltimore: 'Too Many Instances' of Police Target Poor African Americans"},{"comment_id":"1362072713808008","commenter_b":"ROTFLMFAO!!! Opine from the woman actually wearing an 'A$$' hat! You just CAN'T make this stuff up!","commenter_a":"The Judge is a lawyer for La Raza. He is literally a La Raza Grand Dragon.. He has literally helped many illegal immigrants break the law in this country. Donald Trump could go further and he didn't but when you start doing some digging this Judge doesn't seem like a very nice man. A lawyer for a group who has said many times to 'kill all white people'.. Okay.. Donald Trump could go further.. You may very well make him show his hand and there's a lot to show on this judge and the company he keeps. The ONLY racism here is of the judge and the people he represents. Imagine if the Judge was a KKK member presiding over a case that affected black men. You'd be outraged. You know you would. How is the Donald going to get a fair shake when the judge is soooo clearly biased ...","post_message":"By refusing to denounce Donald Trump’s attack on Judge Curiel for the racism it clearly connotes, it shows Senate Republican Leader Mitch McConnell is the poster boy for the Republican spinelessness that allowed Trump to be the Republican nominee for President of the United States.   Senator McConnell has so fully embraced Donald Trump that we are all unclear as to where Trump’s platform ends and Senate Republicans’ begins."},{"comment_id":"1017008728310597","commenter_b":"The imaginary kind.","commenter_a":"Just what kind of Christians are they ?","post_message":"'Poverty and joblessness are not indicators of bad character'"},{"comment_id":"710336325799525","commenter_b":"U R A STUPID BITCH !!","commenter_a":"Yes she is a well educated lady. She puts family first and shows alot of class. She was a model you don't hear people caalling actresses names for their jobs. She also is a women who knows how to work hard , she understands the immigration system. She also understands the average needs of the normal everyday person.","post_message":"Will Melania Trump make a good First Lady?"},{"comment_id":"10155094877376037","commenter_b":"She deserves the same treatment.... sick sick sick nasty woman. She doesn't deserve life","commenter_a":"Where's the picture of the mother?","post_message":"14-year-old Grace Packer was beaten, raped, poisoned and strangled."},{"comment_id":"544427389064045","commenter_b":"Why we allow these Muslims remain in our country. If they hate our traditions, and our ways. LEAVE your ungrateful Muslims.","commenter_a":"Disgusting!","post_message":"Muslim Students Walk Out During National Anthem [VIDEO]  If don't want to show your respect for our country, you can leave.  Are you appalled by their blatant disrespect?"}]
