[{"comment_id":"10152777493386130","commenter_b":"Ya. Clearly, women want nothing more than to \"trap\" some real prize catches around here. Give me a break.","commenter_a":"this is great. Now men are less likely to be victims of the tramps who lie about birth control and crazy GFs who try to lock their men in.","post_message":"We're looking at you, gentlemen."},{"comment_id":"882901261808481","commenter_b":"Wow. It's just a military organization, and not a very good one. Your fear is irrational and betrays you, allows you to be easily manipulated.","commenter_a":"Ok. These are Islamic extremists who believe that death in the service to their religion is the highest honor they can achieve. I'm fairly certain they've got some kind of contingency plan in place in event that their current leaders achieve \"martyrdom\". I'm just going to put that out there. \"We've killed more of their leaders\". So what? They want to die. They're promised 74 virgins in the afterlife. I'm absolutely positive there are plans in effect to appoint successors to those leaders who are destroyed.","post_message":"U.S.-led forces have killed 10 Islamic State leaders in air strikes, including individuals linked to the Paris attacks."},{"comment_id":"10155008685674170","commenter_b":"Buy Global Warming , Ol AL GORE needs the MONEY !!! 😎","commenter_a":"Al Gore. Captain America. He is just another Delta Dawn, someone who feels he deserved to win, it was owed to him. Just like Chillory. So glad they are seeing that not every one likes them or shares their views.","post_message":"Well, they couldn't stop the electors from voting for Trump. But the left never gives up! This new plan sounds like something from a Scooby Doo episode."},{"comment_id":"644944732314902","commenter_b":"Yes, she showed America just how much she loves her country, while the SLUT demonstrated her true nature as a racist!","commenter_a":"Never a real fan of Lady Gaga up until now. What a brilliant, beautiful voice. Beyonce should leave the country if she feels she must promote racism.","post_message":"Do you think Lady Gaga did a better job than Beyonce at the Super Bowl?"},{"comment_id":"1392116457753526","commenter_b":"Illegals DO NOT FREAKING qualify for SNAP or any Welfare!","commenter_a":"So, how many of these people are illegal?","post_message":"This state is preparing to kick roughly 30,000 people off food stamps."},{"comment_id":"10153040559681130","commenter_b":"Religion, Kartrashians, J.Lopez, M.Cyrus, and their ilk. Male dicktators ruling./ruining countries...","commenter_a":"I want to see a world without religion or Kardashians.","post_message":"Do you want to see a world without elephants, rhinos or gorillas?"},{"comment_id":"10154212889868822","commenter_b":"2 fecking idiots!!! That is all I have to say!","commenter_a":"Just look how dangerous Pittsburgh has become in itself!! There are murders every single day and crime is most def on the rise!! Jobs are scarce unless you want to work part time in fast food or at a gas station","post_message":"Boston Mayor Marty Walsh joined Pittsburgh Mayor Bill Peduto for breakfast before hitting the campaign trail to drum up support for Hillary Clinton ."}]
